{"id":"2203.16648","title":"Predicting Winners of the Reality TV Dating Show $\\textit{The Bachelor}$\n  Using Machine Learning Algorithms","authors":"Abigail J. Lee, Grace E. Chesmore, Kyle A. Rocha, Amanda Farah, Maryum Sayeed, Justin Myles","authorsParsed":[["Lee","Abigail J.",""],["Chesmore","Grace E.",""],["Rocha","Kyle A.",""],["Farah","Amanda",""],["Sayeed","Maryum",""],["Myles","Justin",""]],"versions":[{"version":"v1","created":"Wed, 30 Mar 2022 20:00:31 GMT"}],"updateDate":"2022-04-01","timestamp":1648670431000,"abstract":"  $\\textit{The Bachelor}$ is a reality TV dating show in which a single\nbachelor selects his wife from a pool of approximately 30 female contestants\nover eight weeks of filming (American Broadcasting Company 2002). We collected\nthe following data on all 422 contestants that participated in seasons 11\nthrough 25: their Age, Hometown, Career, Race, Week they got their first 1-on-1\ndate, whether they got the first impression rose, and what \"place\" they ended\nup getting. We then trained three machine learning models to predict the ideal\ncharacteristics of a successful contestant on $\\textit{The Bachelor}$. The\nthree algorithms that we tested were: random forest classification, neural\nnetworks, and linear regression. We found consistency across all three models,\nalthough the neural network performed the best overall. Our models found that a\nwoman has the highest probability of progressing far on $\\textit{The Bachelor}$\nif she is: 26 years old, white, from the Northwest, works as an dancer,\nreceived a 1-on-1 in week 6, and did not receive the First Impression Rose. Our\nmethodology is broadly applicable to all romantic reality television, and our\nresults will inform future $\\textit{The Bachelor}$ production and contestant\nstrategies. While our models were relatively successful, we still encountered\nhigh misclassification rates. This may be because: (1) Our training dataset had\nfewer than 400 points or (2) Our models were too simple to parameterize the\ncomplex romantic connections contestants forge over the course of a season.\n","subjects":["Computing Research Repository/Machine Learning","Astrophysics/Instrumentation and Methods for Astrophysics","Physics/Popular Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8WNroUkfl7s1aHS7Eu7rq2cU1hncBwUCAAdvAsxpw8Y","pdfSize":"478286"}