{"id":"2209.05456","title":"Probably Something: A Multi-Layer Taxonomy of Non-Fungible Tokens","authors":"Eduard Hartwich, Philipp Ollig, Gilbert Fridgen, Alexander Rieger","authorsParsed":[["Hartwich","Eduard",""],["Ollig","Philipp",""],["Fridgen","Gilbert",""],["Rieger","Alexander",""]],"versions":[{"version":"v1","created":"Mon, 29 Aug 2022 18:00:30 GMT"}],"updateDate":"2022-09-13","timestamp":1661796030000,"abstract":"  Purpose: This paper aims to establish a fundamental and comprehensive\nunderstanding of Non-Fungible Tokens (NFTs) by identifying and structuring\ncommon characteristics within a taxonomy. NFTs are hyped and increasingly\nmarketed as essential building blocks of the Metaverse. However, the dynamic\nevolution of the NFT space has posed challenges for those seeking to develop a\ndeep and comprehensive understanding of NFTs, their features, and capabilities.\n  Design/methodology/approach: Utilizing common guidelines for the creation of\ntaxonomies, we developed (over three iterations), a multi-layer taxonomy based\non workshops and interviews with 11 academic and 15 industry experts. Through\nan evaluation of 25 NFTs, we demonstrate the usefulness of our taxonomy.\n  Findings: The taxonomy has four layers, 14 dimensions and 42 characteristics,\nwhich describe NFTs in terms of reference object, token properties, token\ndistribution, and realizable value.\n  Originality: Our framework is the first to systematically cover the emerging\nNFT phenomenon. It is concise yet extendible and presents many avenues for\nfuture research in a plethora of disciplines. The characteristics identified in\nour taxonomy are useful for NFT and Metaverse related research in Finance,\nMarketing, Law, and Information Systems. Additionally, the taxonomy can serve\nas an information source for policymakers as they consider NFT regulation.\n","subjects":["Computer Science/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"c9cYAU2scrNuuWuzpteOGMmVlYUHtsevHTleCUfndEg","pdfSize":"702561"}