{"id":"2304.09240","title":"The Metaverse: Survey, Trends, Novel Pipeline Ecosystem & Future\n  Directions","authors":"Hani Sami, Ahmad Hammoud, Mouhamad Arafeh, Mohamad Wazzeh, Sarhad\n  Arisdakessian, Mario Chahoud, Osama Wehbi, Mohamad Ajaj, Azzam Mourad, Hadi\n  Otrok, Omar Abdel Wahab, Rabeb Mizouni, Jamal Bentahar, Chamseddine Talhi,\n  Zbigniew Dziong, Ernesto Damiani, Mohsen Guizani","authorsParsed":[["Sami","Hani",""],["Hammoud","Ahmad",""],["Arafeh","Mouhamad",""],["Wazzeh","Mohamad",""],["Arisdakessian","Sarhad",""],["Chahoud","Mario",""],["Wehbi","Osama",""],["Ajaj","Mohamad",""],["Mourad","Azzam",""],["Otrok","Hadi",""],["Wahab","Omar Abdel",""],["Mizouni","Rabeb",""],["Bentahar","Jamal",""],["Talhi","Chamseddine",""],["Dziong","Zbigniew",""],["Damiani","Ernesto",""],["Guizani","Mohsen",""]],"versions":[{"version":"v1","created":"Tue, 18 Apr 2023 18:58:14 GMT"}],"updateDate":"2024-05-20","timestamp":1681844294000,"abstract":"  The Metaverse offers a second world beyond reality, where boundaries are\nnon-existent, and possibilities are endless through engagement and immersive\nexperiences using the virtual reality (VR) technology. Many disciplines can\nbenefit from the advancement of the Metaverse when accurately developed,\nincluding the fields of technology, gaming, education, art, and culture.\nNevertheless, developing the Metaverse environment to its full potential is an\nambiguous task that needs proper guidance and directions. Existing surveys on\nthe Metaverse focus only on a specific aspect and discipline of the Metaverse\nand lack a holistic view of the entire process. To this end, a more holistic,\nmulti-disciplinary, in-depth, and academic and industry-oriented review is\nrequired to provide a thorough study of the Metaverse development pipeline. To\naddress these issues, we present in this survey a novel multi-layered pipeline\necosystem composed of (1) the Metaverse computing, networking, communications\nand hardware infrastructure, (2) environment digitization, and (3) user\ninteractions. For every layer, we discuss the components that detail the steps\nof its development. Also, for each of these components, we examine the impact\nof a set of enabling technologies and empowering domains (e.g., Artificial\nIntelligence, Security & Privacy, Blockchain, Business, Ethics, and Social) on\nits advancement. In addition, we explain the importance of these technologies\nto support decentralization, interoperability, user experiences, interactions,\nand monetization. Our presented study highlights the existing challenges for\neach component, followed by research directions and potential solutions. To the\nbest of our knowledge, this survey is the most comprehensive and allows users,\nscholars, and entrepreneurs to get an in-depth understanding of the Metaverse\necosystem to find their opportunities and potentials for contribution.\n","subjects":["Computer Science/Computers and Society","Computer Science/Artificial Intelligence","Computer Science/Computer Vision and Pattern Recognition","Computer Science/Networking and Internet Architecture"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"NhRdaf1mfsyuuiyKOFcatKMLVusjadvcsbEHNNHQq0E","pdfSize":"23810949"}