{"id":"2401.03461","title":"Amplification of Addictive New Media Features in the Metaverse","authors":"Ljubisa Bojic, Joerg Matthes, Milan Cabarkapa","authorsParsed":[["Bojic","Ljubisa",""],["Matthes","Joerg",""],["Cabarkapa","Milan",""]],"versions":[{"version":"v1","created":"Sun, 7 Jan 2024 11:50:07 GMT"}],"updateDate":"2024-01-09","timestamp":1704628207000,"abstract":"  The emergence of the metaverse, envisioned as a hyperreal virtual universe\nfacilitating boundless human interaction, stands to revolutionize our\nconception of media, with significant impacts on addiction, creativity,\nrelationships, and social polarization. This paper aims to dissect the\naddictive potential of the metaverse due to its immersive and interactive\nfeatures, scrutinize the effects of its recommender systems on creativity and\nsocial polarization, and explore potential consequences stemming from the\nmetaverse development. We employed a literature review methodology, drawing\nparallels from the research on new media platforms and examining the\nprogression of reality-mimicking features in media from historical perspectives\nto understand this transformative digital frontier. The findings suggest that\nthese immersive and interactive features could potentially exacerbate media\naddiction. The designed recommender systems, while aiding personalization and\nuser engagement, might contribute to social polarization and affect the\ndiversity of creative output. However, our conclusions are based primarily on\ntheoretical propositions from studies conducted on existing media platforms and\nlack empirical support specific to the metaverse. Therefore, this paper\nidentifies a critical gap requiring further research, through empirical studies\nfocused on metaverse use and addiction and exploration of privacy, security,\nand ethical implications associated with this burgeoning digital universe. As\nthe development of the metaverse accelerates, it is incumbent on scholars,\ntechnologists, and policymakers to navigate its multilayered impacts\nthoughtfully to balance innovation with societal well-being.\n","subjects":["Computer Science/Computers and Society","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"hljDEeb7ZAzo7BtGpRa4ohZFiNZeSUCRkxGTWVzV4Ys","pdfSize":"381845"}