{"id":"2403.05205","title":"Interoperability of the Metaverse: A Digital Ecosystem Perspective\n  Review","authors":"Liang Yang, Shi-Ting Ni, Yuyang Wang, Ao Yu, Jyh-An Lee, Pan Hui","authorsParsed":[["Yang","Liang",""],["Ni","Shi-Ting",""],["Wang","Yuyang",""],["Yu","Ao",""],["Lee","Jyh-An",""],["Hui","Pan",""]],"versions":[{"version":"v1","created":"Fri, 8 Mar 2024 10:38:01 GMT"},{"version":"v2","created":"Wed, 20 Mar 2024 17:05:20 GMT"},{"version":"v3","created":"Thu, 13 Jun 2024 07:43:41 GMT"},{"version":"v4","created":"Sat, 15 Jun 2024 12:39:26 GMT"}],"updateDate":"2024-06-18","timestamp":1709894281000,"abstract":"  The Metaverse is at the vanguard of the impending digital revolution, with\nthe potential to significantly transform industries and lifestyles. However, in\n2023, skepticism surfaced within industrial and academic spheres, raising\nconcerns that excitement may outpace actual technological progress.\nInteroperability, recognized as a major barrier to the Metaverse's full\npotential, is central to this debate. CoinMarketCap's report in February 2023\nindicated that of over 240 metaverse initiatives, most existed in isolation,\nunderscoring the interoperability challenge. Despite consensus on its critical\nrole, there is a research gap in exploring the impact on the Metaverse,\nsignificance, and developmental extent. Our study bridges this gap via a\nsystematic literature review and content analysis of the Web of Science (WoS)\nand Scopus databases, yielding 74 publications after a rigorous selection\nprocess. Interoperability, difficult to define due to varied contexts and lack\nof standardization, is central to the Metaverse, often seen as a digital\necosystem. Urs Gasser's framework, outlining technological, data, human, and\ninstitutional dimensions, systematically addresses interoperability\ncomplexities. Incorporating this framework, we dissect the literature for a\ncomprehensive Metaverse interoperability overview. Our study seeks to establish\nbenchmarks for future inquiries, navigating the complex field of Metaverse\ninteroperability studies and contributing to academic advancement.\n","subjects":["Computer Science/Computers and Society"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"vEZp1pqXGhqIC05AmLnJ4M8st5ExwCBpe4HWaRGRkYg","pdfSize":"5105116"}