{"id":"2405.19088","title":"Cracking the Code of Juxtaposition: Can AI Models Understand the\n  Humorous Contradictions","authors":"Zhe Hu, Tuo Liang, Jing Li, Yiren Lu, Yunlai Zhou, Yiran Qiao, Jing Ma, Yu Yin","authorsParsed":[["Hu","Zhe",""],["Liang","Tuo",""],["Li","Jing",""],["Lu","Yiren",""],["Zhou","Yunlai",""],["Qiao","Yiran",""],["Ma","Jing",""],["Yin","Yu",""]],"versions":[{"version":"v1","created":"Wed, 29 May 2024 13:51:43 GMT"}],"updateDate":"2024-05-30","timestamp":1716990703000,"abstract":"  Recent advancements in large multimodal language models have demonstrated\nremarkable proficiency across a wide range of tasks. Yet, these models still\nstruggle with understanding the nuances of human humor through juxtaposition,\nparticularly when it involves nonlinear narratives that underpin many jokes and\nhumor cues. This paper investigates this challenge by focusing on comics with\ncontradictory narratives, where each comic consists of two panels that create a\nhumorous contradiction. We introduce the YesBut benchmark, which comprises\ntasks of varying difficulty aimed at assessing AI's capabilities in recognizing\nand interpreting these comics, ranging from literal content comprehension to\ndeep narrative reasoning. Through extensive experimentation and analysis of\nrecent commercial or open-sourced large (vision) language models, we assess\ntheir capability to comprehend the complex interplay of the narrative humor\ninherent in these comics. Our results show that even state-of-the-art models\nstill lag behind human performance on this task. Our findings offer insights\ninto the current limitations and potential improvements for AI in understanding\nhuman creative expressions.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","pdfSize":"2529237","blobId":"AwfMe5M-P8vepxZ8u9f0bpD-TSoKAar82ELBfMzzKRQ","objectId":"0x1a5731989c616b4ecd50978db5cebd93393d39e3ade5215d7cb7f1da1c8bd07e","registeredEpoch":"27","certifiedEpoch":"27","startEpoch":"27","endEpoch":"227"}
