{"id":"2406.16051","title":"Entropy-driven decision-making dynamics sheds light on the emergence of\n  the \"paradox of choice\"","authors":"Manish Gupta, Arnab Barua, Haralampos Hatzikirou","authorsParsed":[["Gupta","Manish",""],["Barua","Arnab",""],["Hatzikirou","Haralampos",""]],"versions":[{"version":"v1","created":"Sun, 23 Jun 2024 09:06:34 GMT"}],"updateDate":"2024-06-25","timestamp":1719133594000,"abstract":"  Decision making is the cognitive process of selecting a course of action\namong multiple alternatives. As the decision maker belongs to a complex\nmicroenvironment (which contains multiple decision makers), has to make a\ndecision where multiple options are present which often leads to a phenomenon\nknown as the \"paradox of choices\". The latter refers to the case where too many\noptions can lead to negative outcomes, such as increased uncertainty, decision\nparalysis, and frustration. Here, we employ an entropy driven mechanism within\na statistical physics framework to explain the premises of the paradox. In\nturn, we focus on the emergence of a collective \"paradox of choice\", in the\ncase of interacting decision-making agents, quantified as the decision\nsynchronization time. Our findings reveal a trade-off between synchronization\ntime and the sensing radius, indicating the optimal conditions for information\ntransfer among group members, which significantly depends the individual\nsensitivity parameters. Interestingly, when agents sense their microenvironment\nin a biased way or their decisions are influenced by their past choices, then\nthe collective \"paradox of choice\" does not occur. In a nutshell, our theory\noffers a low-dimensional and unified statistical explanation of the \"paradox of\nchoice\" at the individual and at the collective level.\n","subjects":["Physics/Physics and Society","Condensed Matter/Statistical Mechanics","Nonlinear Sciences/Adaptation and Self-Organizing Systems","Physics/Biological Physics","Physics/Data Analysis, Statistics and Probability"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"5a8HSlYPg5yeD-xuJQBCrB2HEfZLfFpStNKVkHlqRvA","pdfSize":"1770233"}