{"id":"2406.10522","title":"Humor in AI: Massive Scale Crowd-Sourced Preferences and Benchmarks for\n  Cartoon Captioning","authors":"Jifan Zhang, Lalit Jain, Yang Guo, Jiayi Chen, Kuan Lok Zhou, Siddharth Suresh, Andrew Wagenmaker, Scott Sievert, Timothy Rogers, Kevin Jamieson, Robert Mankoff, Robert Nowak","authorsParsed":[["Zhang","Jifan",""],["Jain","Lalit",""],["Guo","Yang",""],["Chen","Jiayi",""],["Zhou","Kuan Lok",""],["Suresh","Siddharth",""],["Wagenmaker","Andrew",""],["Sievert","Scott",""],["Rogers","Timothy",""],["Jamieson","Kevin",""],["Mankoff","Robert",""],["Nowak","Robert",""]],"versions":[{"version":"v1","created":"Sat, 15 Jun 2024 06:26:25 GMT"}],"updateDate":"2024-06-18","timestamp":1718432785000,"abstract":"  We present a novel multimodal preference dataset for creative tasks,\nconsisting of over 250 million human ratings on more than 2.2 million captions,\ncollected through crowdsourcing rating data for The New Yorker's weekly cartoon\ncaption contest over the past eight years. This unique dataset supports the\ndevelopment and evaluation of multimodal large language models and\npreference-based fine-tuning algorithms for humorous caption generation. We\npropose novel benchmarks for judging the quality of model-generated captions,\nutilizing both GPT4 and human judgments to establish ranking-based evaluation\nstrategies. Our experimental results highlight the limitations of current\nfine-tuning methods, such as RLHF and DPO, when applied to creative tasks.\nFurthermore, we demonstrate that even state-of-the-art models like GPT4 and\nClaude currently underperform top human contestants in generating humorous\ncaptions. As we conclude this extensive data collection effort, we release the\nentire preference dataset to the research community, fostering further\nadvancements in AI humor generation and evaluation.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"KyqqKFovzi9TlWkYxn6TvUs8jbMIGCJQQykl9HlIX7w","pdfSize":"995167"}