{"id":"2407.17929","title":"Guided Latent Slot Diffusion for Object-Centric Learning","authors":"Krishnakant Singh, Simone Schaub-Meyer, Stefan Roth","authorsParsed":[["Singh","Krishnakant",""],["Schaub-Meyer","Simone",""],["Roth","Stefan",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 10:38:32 GMT"}],"updateDate":"2024-07-26","timestamp":1721903912000,"abstract":"  Slot attention aims to decompose an input image into a set of meaningful\nobject files (slots). These latent object representations enable various\ndownstream tasks. Yet, these slots often bind to object parts, not objects\nthemselves, especially for real-world datasets. To address this, we introduce\nGuided Latent Slot Diffusion - GLASS, an object-centric model that uses\ngenerated captions as a guiding signal to better align slots with objects. Our\nkey insight is to learn the slot-attention module in the space of generated\nimages. This allows us to repurpose the pre-trained diffusion decoder model,\nwhich reconstructs the images from the slots, as a semantic mask generator\nbased on the generated captions. GLASS learns an object-level representation\nsuitable for multiple tasks simultaneously, e.g., segmentation, image\ngeneration, and property prediction, outperforming previous methods. For object\ndiscovery, GLASS achieves approx. a +35% and +10% relative improvement for mIoU\nover the previous state-of-the-art (SOTA) method on the VOC and COCO datasets,\nrespectively, and establishes a new SOTA FID score for conditional image\ngeneration amongst slot-attention-based methods. For the segmentation task,\nGLASS surpasses SOTA weakly-supervised and language-based segmentation models,\nwhich were specifically designed for the task.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"sPp4JwQiAom6R09uT5gMK58WG2fJo9YX_GyQqRIaPJU","pdfSize":"23491901","objectId":"0x1f249dbdcd740ebdd1cf8cdc51307d723688341620dd45e9619990dee183a290","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
