{"id":"2407.14131","title":"Beyond Gaussian fluctuations of quantum anharmonic nuclei. The case of\n  rotational degrees of freedom","authors":"Antonio Siciliano, Lorenzo Monacelli, Francesco Mauri","authorsParsed":[["Siciliano","Antonio",""],["Monacelli","Lorenzo",""],["Mauri","Francesco",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 09:02:32 GMT"}],"updateDate":"2024-07-22","timestamp":1721379752000,"abstract":"  The atomic motion in molecular crystals, such as high-pressure hydrogen or\nhybrid organic-inorganic perovskites, is very complex due to quantum anharmonic\neffects. In addition, these materials accommodate rotational degrees of\nfreedom. All the approximate methods that describe the nuclei thermodynamics\nusing Cartesian coordinates lead to an unphysical hybridization of\nroto-librations with other high-energy modes. Hence, they do not accurately\naccount for the free energy contributions of these degrees of freedom. So, a\nreliable description of a molecular crystal's phase diagram is only possible\nwith Path Integral Molecular Dynamics (PIMD) at a high computational cost. This\nwork shows how to include roto-librational modes in the Self-Consistent\nHarmonic Approximation (SCHA) framework. SCHA approximates the nuclei Cartesian\nfluctuations to be Gaussian, thus neglecting curvilinear motion. Keeping its\nlow computational cost, we employ the generalization of SCHA, called nonlinear\nSCHA (NLSCHA). Our method relies on a Gaussian \\textit{ansatz} for the nuclei\ndensity matrix on a curved manifold, allowing us to map roto-librations into\nharmonic modes defined on a surface. By optimizing the surface's curvature\nvariationally, we minimize the free energy, allowing the spontaneous activation\nof these degrees of freedom without external parameters. Notably, in the limit\nof vanishing curvature, we recover the standard SCHA.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"25BAf03gXnq65uF4tCBK9JdruDetA3Pv0UfEaJA8VOw","pdfSize":"28226816"}