{"id":"2407.15302","title":"Fever Detection with Infrared Thermography: Enhancing Accuracy through\n  Machine Learning Techniques","authors":"Parsa Razmara, Tina Khezresmaeilzadeh, B. Keith Jenkins","authorsParsed":[["Razmara","Parsa",""],["Khezresmaeilzadeh","Tina",""],["Jenkins","B. Keith",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 00:05:31 GMT"},{"version":"v2","created":"Sat, 10 Aug 2024 08:18:33 GMT"}],"updateDate":"2024-08-13","timestamp":1721606731000,"abstract":"  The COVID-19 pandemic has underscored the necessity for advanced diagnostic\ntools in global health systems. Infrared Thermography (IRT) has proven to be a\ncrucial non-contact method for measuring body temperature, vital for\nidentifying febrile conditions associated with infectious diseases like\nCOVID-19. Traditional non-contact infrared thermometers (NCITs) often exhibit\nsignificant variability in readings. To address this, we integrated machine\nlearning algorithms with IRT to enhance the accuracy and reliability of\ntemperature measurements. Our study systematically evaluated various regression\nmodels using heuristic feature engineering techniques, focusing on features'\nphysiological relevance and statistical significance. The Convolutional Neural\nNetwork (CNN) model, utilizing these techniques, achieved the lowest RMSE of\n0.2223, demonstrating superior performance compared to results reported in\nprevious literature. Among non-neural network models, the Binning method\nachieved the best performance with an RMSE of 0.2296. Our findings highlight\nthe potential of combining advanced feature engineering with machine learning\nto improve diagnostic tools' effectiveness, with implications extending to\nother non-contact or remote sensing biomedical applications. This paper offers\na comprehensive analysis of these methodologies, providing a foundation for\nfuture research in the field of non-invasive medical diagnostics.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"UohthdiEghYp9PPmA6P_TMS2TtWzLlRvO-ZMcJCbWOk","pdfSize":"308516"}