{"id":"2407.13772","title":"GroupMamba: Parameter-Efficient and Accurate Group Visual State Space\n  Model","authors":"Abdelrahman Shaker, Syed Talal Wasim, Salman Khan, Juergen Gall, Fahad\n  Shahbaz Khan","authorsParsed":[["Shaker","Abdelrahman",""],["Wasim","Syed Talal",""],["Khan","Salman",""],["Gall","Juergen",""],["Khan","Fahad Shahbaz",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 17:59:58 GMT"}],"updateDate":"2024-07-19","timestamp":1721325598000,"abstract":"  Recent advancements in state-space models (SSMs) have showcased effective\nperformance in modeling long-range dependencies with subquadratic complexity.\nHowever, pure SSM-based models still face challenges related to stability and\nachieving optimal performance on computer vision tasks. Our paper addresses the\nchallenges of scaling SSM-based models for computer vision, particularly the\ninstability and inefficiency of large model sizes. To address this, we\nintroduce a Modulated Group Mamba layer which divides the input channels into\nfour groups and applies our proposed SSM-based efficient Visual Single\nSelective Scanning (VSSS) block independently to each group, with each VSSS\nblock scanning in one of the four spatial directions. The Modulated Group Mamba\nlayer also wraps the four VSSS blocks into a channel modulation operator to\nimprove cross-channel communication. Furthermore, we introduce a\ndistillation-based training objective to stabilize the training of large\nmodels, leading to consistent performance gains. Our comprehensive experiments\ndemonstrate the merits of the proposed contributions, leading to superior\nperformance over existing methods for image classification on ImageNet-1K,\nobject detection, instance segmentation on MS-COCO, and semantic segmentation\non ADE20K. Our tiny variant with 23M parameters achieves state-of-the-art\nperformance with a classification top-1 accuracy of 83.3% on ImageNet-1K, while\nbeing 26% efficient in terms of parameters, compared to the best existing Mamba\ndesign of same model size. Our code and models are available at:\nhttps://github.com/Amshaker/GroupMamba.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"tEtl0Kq6taWD4-vf8SfobX52erU-oPMnnB8B8XJzE5c","pdfSize":"10891856"}