{"id":"2407.19680","title":"A transiting multi-planet system in the 61 million year old association\n  Theia 116","authors":"Sydney Vach, George Zhou, Chelsea X. Huang, Andrew W. Mann, Madyson G.\n  Barber, Allyson Bieryla, David W. Latham, Karen A. Collins, James G. Rogers,\n  Luke G. Bouma, Stephanie T. Douglas, Samuel N. Quinn, Tyler R. Fairnington,\n  Joachim Kr\\\"uger, Avi Shporer, Kevin I. Collins, Gregor Srdoc, Richard P.\n  Schwarz, Howard M. Relles, Khalid Barkaoui, Kim K. McLeod, Alayna Schneider,\n  Norio Narita, Akihiko Fukui, Ramotholo Sefako, William Fong, Ismael Mireles,\n  Guillermo Torres, George R. Ricker, Sara Seager, Joshua N. Winn","authorsParsed":[["Vach","Sydney",""],["Zhou","George",""],["Huang","Chelsea X.",""],["Mann","Andrew W.",""],["Barber","Madyson G.",""],["Bieryla","Allyson",""],["Latham","David W.",""],["Collins","Karen A.",""],["Rogers","James G.",""],["Bouma","Luke G.",""],["Douglas","Stephanie T.",""],["Quinn","Samuel N.",""],["Fairnington","Tyler R.",""],["Krüger","Joachim",""],["Shporer","Avi",""],["Collins","Kevin I.",""],["Srdoc","Gregor",""],["Schwarz","Richard P.",""],["Relles","Howard M.",""],["Barkaoui","Khalid",""],["McLeod","Kim K.",""],["Schneider","Alayna",""],["Narita","Norio",""],["Fukui","Akihiko",""],["Sefako","Ramotholo",""],["Fong","William",""],["Mireles","Ismael",""],["Torres","Guillermo",""],["Ricker","George R.",""],["Seager","Sara",""],["Winn","Joshua N.",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 03:52:43 GMT"}],"updateDate":"2024-07-30","timestamp":1722225163000,"abstract":"  Observing and characterizing young planetary systems can aid in unveiling the\nevolutionary mechanisms that sculpt the mature exoplanet population. As an\nall-sky survey, NASA's Transiting Exoplanet Survey Satellite (TESS) has\nexpanded the known young planet population as it has observed young comoving\nstellar populations. This work presents the discovery of a multiplanet system\norbiting the 61 Myr old G4V star TIC 434398831 (M = 0.99 Msun, R = 0.91 Rsun,\nTeff = 5638 K, Tmag = 11.31) located in the Theia 116 comoving population. We\nestimate the population's age based on rotation periods measured from the TESS\nlight curves, isochrone fitting, and measurements of lithium equivalent widths\nin the spectra of Theia 116 members. The TESS FFI light curves reveal a\nmini-Neptune (Rb = 3.51 Rearth, Pb = 3.69 days) and super-Neptune (Rc = 5.63\nRearth, Pc = 6.21 days) with an orbital period ratio slightly larger than 5:3.\nFollow-up observations from CHEOPS and ground-based telescopes confirm the\ntransits of TIC 434398831 b and c, and constrain their transit times. We\nexplore the potential mass-loss histories of the two planets in order to probe\npossible initial conditions of the planets immediately after formation.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"tgA_gnsdAZou-n6ojpS5cMI7xSgxHdqPCXNDwZBBtRE","pdfSize":"8046296"}