{"id":"2407.20372","title":"A Model Generalization Study in Localizing Indoor Cows with COw\n  LOcalization (COLO) dataset","authors":"Mautushi Das, Gonzalo Ferreira, C. P. James Chen","authorsParsed":[["Das","Mautushi",""],["Ferreira","Gonzalo",""],["Chen","C. P. James",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 18:49:58 GMT"}],"updateDate":"2024-07-31","timestamp":1722278998000,"abstract":"  Precision livestock farming (PLF) increasingly relies on advanced object\nlocalization techniques to monitor livestock health and optimize resource\nmanagement. This study investigates the generalization capabilities of YOLOv8\nand YOLOv9 models for cow detection in indoor free-stall barn settings,\nfocusing on varying training data characteristics such as view angles and\nlighting, and model complexities. Leveraging the newly released public dataset,\nCOws LOcalization (COLO) dataset, we explore three key hypotheses: (1) Model\ngeneralization is equally influenced by changes in lighting conditions and\ncamera angles; (2) Higher model complexity guarantees better generalization\nperformance; (3) Fine-tuning with custom initial weights trained on relevant\ntasks always brings advantages to detection tasks. Our findings reveal\nconsiderable challenges in detecting cows in images taken from side views and\nunderscore the importance of including diverse camera angles in building a\ndetection model. Furthermore, our results emphasize that higher model\ncomplexity does not necessarily lead to better performance. The optimal model\nconfiguration heavily depends on the specific task and dataset. Lastly, while\nfine-tuning with custom initial weights trained on relevant tasks offers\nadvantages to detection tasks, simpler models do not benefit similarly from\nthis approach. It is more efficient to train a simple model with pre-trained\nweights without relying on prior relevant information, which can require\nintensive labor efforts. Future work should focus on adaptive methods and\nadvanced data augmentation to improve generalization and robustness. This study\nprovides practical guidelines for PLF researchers on deploying computer vision\nmodels from existing studies, highlights generalization issues, and contributes\nthe COLO dataset containing 1254 images and 11818 cow instances for further\nresearch.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"5HY7b8lpmdtUxHamB3xIJ6nI_nGVbhBedxUJT1DiggM","pdfSize":"12934833"}