{"id":"2407.15071","title":"Relational Database Augmented Large Language Model","authors":"Zongyue Qin, Chen Luo, Zhengyang Wang, Haoming Jiang, Yizhou Sun","authorsParsed":[["Qin","Zongyue",""],["Luo","Chen",""],["Wang","Zhengyang",""],["Jiang","Haoming",""],["Sun","Yizhou",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 06:19:10 GMT"}],"updateDate":"2024-07-23","timestamp":1721542750000,"abstract":"  Large language models (LLMs) excel in many natural language processing (NLP)\ntasks. However, since LLMs can only incorporate new knowledge through training\nor supervised fine-tuning processes, they are unsuitable for applications that\ndemand precise, up-to-date, and private information not available in the\ntraining corpora. This precise, up-to-date, and private information is\ntypically stored in relational databases. Thus, a promising solution is to\naugment LLMs with the inclusion of relational databases as external memory.\nThis can ensure the timeliness, correctness, and consistency of data, and\nassist LLMs in performing complex arithmetic operations beyond their inherent\ncapabilities. However, bridging the gap between LLMs and relational databases\nis challenging. It requires the awareness of databases and data values stored\nin databases to select correct databases and issue correct SQL queries.\nBesides, it is necessary for the external memory to be independent of the LLM\nto meet the needs of real-world applications. We introduce a novel LLM-agnostic\nmemory architecture comprising a database selection memory, a data value\nmemory, and relational databases. And we design an elegant pipeline to retrieve\ninformation from it. Besides, we carefully design the prompts to instruct the\nLLM to maximize the framework's potential. To evaluate our method, we compose a\nnew dataset with various types of questions. Experimental results show that our\nframework enables LLMs to effectively answer database-related questions, which\nis beyond their direct ability.\n","subjects":["Computing Research Repository/Databases","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7TxLfqqLFlKk3UICrBQDY4NyCWZRD0_x7qc2kkFF6Vk","pdfSize":"596022"}