{"id":"2407.17117","title":"EverAdapt: Continuous Adaptation for Dynamic Machine Fault Diagnosis\n  Environments","authors":"Edward, Mohamed Ragab, Yuecong Xu, Min Wu, Yuecong Xu, Zhenghua Chen,\n  Abdulla Alseiari, and Xiaoli Li","authorsParsed":[["Edward","",""],["Ragab","Mohamed",""],["Xu","Yuecong",""],["Wu","Min",""],["Xu","Yuecong",""],["Chen","Zhenghua",""],["Alseiari","Abdulla",""],["Li","Xiaoli",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 09:25:54 GMT"}],"updateDate":"2024-07-25","timestamp":1721813154000,"abstract":"  Unsupervised Domain Adaptation (UDA) has emerged as a key solution in\ndata-driven fault diagnosis, addressing domain shift where models underperform\nin changing environments. However, under the realm of continually changing\nenvironments, UDA tends to underperform on previously seen domains when\nadapting to new ones - a problem known as catastrophic forgetting. To address\nthis limitation, we introduce the EverAdapt framework, specifically designed\nfor continuous model adaptation in dynamic environments. Central to EverAdapt\nis a novel Continual Batch Normalization (CBN), which leverages source domain\nstatistics as a reference point to standardize feature representations across\ndomains. EverAdapt not only retains statistical information from previous\ndomains but also adapts effectively to new scenarios. Complementing CBN, we\ndesign a class-conditional domain alignment module for effective integration of\ntarget domains, and a Sample-efficient Replay strategy to reinforce memory\nretention. Experiments on real-world datasets demonstrate EverAdapt superiority\nin maintaining robust fault diagnosis in dynamic environments. Our code is\navailable: https://github.com/mohamedr002/EverAdapt\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"oD33VWkVGZMy5fBQ45tC6K1SPZrVCLYAuG-9Moxba6U","pdfSize":"1152331"}