{"id":"2407.15458","title":"EMO-Codec: An In-Depth Look at Emotion Preservation capacity of Legacy\n  and Neural Codec Models With Subjective and Objective Evaluations","authors":"Wenze Ren, Yi-Cheng Lin, Huang-Cheng Chou, Haibin Wu, Yi-Chiao Wu,\n  Chi-Chun Lee, Hung-yi Lee, Yu Tsao","authorsParsed":[["Ren","Wenze",""],["Lin","Yi-Cheng",""],["Chou","Huang-Cheng",""],["Wu","Haibin",""],["Wu","Yi-Chiao",""],["Lee","Chi-Chun",""],["Lee","Hung-yi",""],["Tsao","Yu",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 08:14:16 GMT"},{"version":"v2","created":"Tue, 23 Jul 2024 02:23:12 GMT"},{"version":"v3","created":"Wed, 24 Jul 2024 09:16:49 GMT"},{"version":"v4","created":"Tue, 30 Jul 2024 12:37:35 GMT"}],"updateDate":"2024-07-31","timestamp":1721636056000,"abstract":"  The neural codec model reduces speech data transmission delay and serves as\nthe foundational tokenizer for speech language models (speech LMs). Preserving\nemotional information in codecs is crucial for effective communication and\ncontext understanding. However, there is a lack of studies on emotion loss in\nexisting codecs. This paper evaluates neural and legacy codecs using subjective\nand objective methods on emotion datasets like IEMOCAP. Our study identifies\nwhich codecs best preserve emotional information under various bitrate\nscenarios. We found that training codec models with both English and Chinese\ndata had limited success in retaining emotional information in Chinese.\nAdditionally, resynthesizing speech through these codecs degrades the\nperformance of speech emotion recognition (SER), particularly for emotions like\nsadness, depression, fear, and disgust. Human listening tests confirmed these\nfindings. This work guides future speech technology developments to ensure new\ncodecs maintain the integrity of emotional information in speech.\n","subjects":["Electrical Engineering and Systems Science/Audio and Speech Processing","Computing Research Repository/Sound"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"pMPRz_4DLO-VOVwUOMoZMReQ_bzbpnyMvfS16FEI1Ac","pdfSize":"742874"}