{"id":"2407.06024","title":"A Swift X-ray view of the SMS4 sample -- II: X-ray properties of 17\n  bright radio sources","authors":"Alessandro Maselli, William R. Forman, Christine Jones, Ralph P.\n  Kraft, Matteo Perri","authorsParsed":[["Maselli","Alessandro",""],["Forman","William R.",""],["Jones","Christine",""],["Kraft","Ralph P.",""],["Perri","Matteo",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 15:22:07 GMT"}],"updateDate":"2024-07-09","timestamp":1720452127000,"abstract":"  Based on a proposal to observe 18 bright radio sources from the SMS4 catalog\nwith the Neil Gehrels Swift Observatory (hereafter Swift), we obtained X-ray\nobservations of 17 targets (one target was not observed). Following up our\nfirst paper that discussed 31 sources (see Maselli et al. 2022; 20 sources\ndetected as point sources and one very extended source), we present results for\nthis final sample of 17 radio sources, that previously lacked dedicated,\npointed narrow FOV X-ray observations. One of these 17 sources, undetected by\nSwift due to a very short exposure, was instead detected by eROSITA, and given\nin the Data Release 1 (DR1) Catalog. No 1eRASS source was found in the DR1 for\nthe remaining source, unobserved by Swift. The new Swift observations led to\neleven X-ray source detections in the 0.3-10 keV band and six upper limits. We\ninvestigated the extent of the X-ray emission, the hardness ratio, and when\nstatistics allowed we carried out a spectral analysis. The X-ray emission of\neight sources is consistent with point-like emission, while three sources show\nclear evidence of extent, each with peculiar properties. We used the X-ray\ndetermined positions and uncertainties of the twelve detected sources to\nestablish associations with infrared and optical sources from the AllWISE and\nthe GSC 2.4.2 catalogs. Requiring a detection in both the infrared and the\noptical bands to establish a candidate counterpart for our X-ray detections, we\nidentify counterparts for all twelve sources. We discuss the interesting\nstructure of MRC B0344-345 and PKS B2148-555, two of the six extended X-ray\nsources that we detected in both our Swift campaigns, and suggest they are very\npromising for further X-ray and radio investigations. For the 38 SMS4 sources\nthat lack pointed, narrow FOV X-ray telescope observations, after our Swift\ncampaigns, we list 18 likely counterparts from the eROSITA DR1 catalog.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"fs22uvDNfSwBQXb5f4cEnamXt6gKytklX-JHz611cYo","pdfSize":"1779662"}