{"id":"2407.01616","title":"Unveiling secondary particle generation in a SONTRAC detector through\n  GEANT4 simulations","authors":"Ahmet Ilker Topuz","authorsParsed":[["Topuz","Ahmet Ilker",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 05:30:01 GMT"}],"updateDate":"2024-07-03","timestamp":1719552601000,"abstract":"  SOlar Neutron TRACking (SONTRAC) is a detector concept based on a bundle of\nplastic scintillators by aiming at tracking the solar neutrons through the\ngeneration of the secondary particles such as protons from the (n, np) and (n,\np) processes. In this study, in addition to the particle population, the energy\nspectra of the secondary particles including protons, gamma rays, electrons,\nalphas, and ions that are produced either due to the interaction between the\nfast neutrons and a SONTRAC detector or through the interplay between the\nsecondary particles and the detector components are determined by means of\nGEANT4 simulations. The detector geometry in the present study consists of\n34$\\times$34 Kuraray Y11-200(M) fibers, and the current fiber bundle is\nirradiated with a planar vertical neutron beam of 0.2$\\times$0.2 cm$^{2}$ by\nusing an energy list composed of 20, 40, 60, 80, and 100 MeV where the number\nof incident neutrons is $10^5$. First, It is revealed that a non-negligible\nnumber of secondary protons are generated by the fast neutron bombardment;\nhowever, the population of these secondary protons is still low compared to the\nincident beam, i.e. in the order of $10^3$. Secondly, it is also observed that\nthe energy spectrum of secondary protons exhibits a decreasing trend that is\nlimited by the kinetic energy of incident neutrons. Additionally, the range of\nthe secondary protons along with the deposited energy is computed, and it is\ndemonstrated that a significant portion of the generated protons lose their\nentire energy and stop within the present SONTRAC detector. Finally, a\n34$\\times$34 pixel grid detector is introduced on each side of the fiber bundle\nto collect the optical photons produced from the energy deposition in the\nscintillation fibers, and the trajectory of the secondary protons on the pixel\ngrid is shown by using a fast neutron beam of 100 MeV.\n","subjects":["Physics/Instrumentation and Detectors"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"12f8gZvG3ia0y3Rj5JuMQ4cpLILBWQPaWQW94KGa5Z0","pdfSize":"734919"}