{"id":"2407.00624","title":"Evidence for particle acceleration approaching PeV energies in the W51\n  complex","authors":"LHAASO Collaboration","authorsParsed":[["LHAASO Collaboration","",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 08:43:00 GMT"},{"version":"v2","created":"Wed, 21 Aug 2024 00:48:46 GMT"}],"updateDate":"2024-08-22","timestamp":1719736980000,"abstract":"  The $\\gamma$-ray emission from the W51 complex is widely acknowledged to be\nattributed to the interaction between the cosmic rays (CRs) accelerated by the\nshock of supernova remnant (SNR) W51C and the dense molecular clouds in the\nadjacent star-forming region, W51B. However, the maximum acceleration\ncapability of W51C for CRs remains elusive. Based on observations conducted\nwith the Large High Altitude Air Shower Observatory (LHAASO), we report a\nsignificant detection of $\\gamma$ rays emanating from the W51 complex, with\nenergies from 2 TeV to 200 TeV. The LHAASO measurements, for the first time,\nextend the $\\gamma$-ray emission from the W51 complex beyond 100 TeV and reveal\na significant spectrum bending at tens of TeV. By combining the ``$\\pi^0$-decay\nbump\" featured data from Fermi-LAT, the broadband $\\gamma$-ray spectrum of the\nW51 region can be well-characterized by a simple pp-collision model. The\nobserved spectral bending feature suggests an exponential cutoff at\n$\\sim400$~TeV or a power-law break at $\\sim200$~TeV in the CR proton spectrum,\nmost likely providing the first evidence of SNRs serving as CR accelerators\napproaching the PeV regime. Additionally, two young star clusters within W51B\ncould also be theoretically viable to produce the most energetic $\\gamma$ rays\nobserved by LHAASO. Our findings strongly support the presence of extreme CR\naccelerators within the W51 complex and provide new insights into the origin of\nGalactic CRs.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Physics/High Energy Physics - Experiment"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"XPoWgg4KiuEJwIeDAABJrP5kkY_PD_Qugu19alXo614","pdfSize":"2991742","objectId":"0x1f07c11baf820a1b57e25d390cc139b12103ca92b7dfc00a69997584c1bf0328","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
