{"id":"2407.13394","title":"PICASSO: A Feed-Forward Framework for Parametric Inference of CAD\n  Sketches via Rendering Self-Supervision","authors":"Ahmet Serdar Karadeniz, Dimitrios Mallis, Nesryne Mejri, Kseniya\n  Cherenkova, Anis Kacem, Djamila Aouada","authorsParsed":[["Karadeniz","Ahmet Serdar",""],["Mallis","Dimitrios",""],["Mejri","Nesryne",""],["Cherenkova","Kseniya",""],["Kacem","Anis",""],["Aouada","Djamila",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 11:02:52 GMT"}],"updateDate":"2024-07-19","timestamp":1721300572000,"abstract":"  We propose PICASSO, a novel framework CAD sketch parameterization from\nhand-drawn or precise sketch images via rendering self-supervision. Given a\ndrawing of a CAD sketch, the proposed framework turns it into parametric\nprimitives that can be imported into CAD software. Compared to existing\nmethods, PICASSO enables the learning of parametric CAD sketches from either\nprecise or hand-drawn sketch images, even in cases where annotations at the\nparameter level are scarce or unavailable. This is achieved by leveraging the\ngeometric characteristics of sketches as a learning cue to pre-train a CAD\nparameterization network. Specifically, PICASSO comprises two primary\ncomponents: (1) a Sketch Parameterization Network (SPN) that predicts a series\nof parametric primitives from CAD sketch images, and (2) a Sketch Rendering\nNetwork (SRN) that renders parametric CAD sketches in a differentiable manner.\nSRN facilitates the computation of a image-to-image loss, which can be utilized\nto pre-train SPN, thereby enabling zero- and few-shot learning scenarios for\nthe parameterization of hand-drawn sketches. Extensive evaluation on the widely\nused SketchGraphs dataset validates the effectiveness of the proposed\nframework.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"8P8GpDm6C8DOkUSseJKDMQ7wZxULMmEtovX-gOxWClE","pdfSize":"2387859"}