{"id":"2407.07591","title":"A 'MAP' to find high-performing soft robot designs: Traversing complex\n  design spaces using MAP-elites and Topology Optimization","authors":"Yue Xie, Josh Pinskier, Lois Liow, David Howard, Fumiya Iida","authorsParsed":[["Xie","Yue",""],["Pinskier","Josh",""],["Liow","Lois",""],["Howard","David",""],["Iida","Fumiya",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 12:27:17 GMT"}],"updateDate":"2024-07-11","timestamp":1720614437000,"abstract":"  Soft robotics has emerged as the standard solution for grasping deformable\nobjects, and has proven invaluable for mobile robotic exploration in extreme\nenvironments. However, despite this growth, there are no widely adopted\ncomputational design tools that produce quality, manufacturable designs. To\nadvance beyond the diminishing returns of heuristic bio-inspiration, the field\nneeds efficient tools to explore the complex, non-linear design spaces present\nin soft robotics, and find novel high-performing designs. In this work, we\ninvestigate a hierarchical design optimization methodology which combines the\nstrengths of topology optimization and quality diversity optimization to\ngenerate diverse and high-performance soft robots by evolving the design\ndomain. The method embeds variably sized void regions within the design domain\nand evolves their size and position, to facilitating a richer exploration of\nthe design space and find a diverse set of high-performing soft robots. We\ndemonstrate its efficacy on both benchmark topology optimization problems and\nsoft robotic design problems, and show the method enhances grasp performance\nwhen applied to soft grippers. Our method provides a new framework to design\nparts in complex design domains, both soft and rigid.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Neural and Evolutionary Computing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"PhbWxDVzWBWj_YiAwcy8oUoogkG5qvYxpBqydvDtTFc","pdfSize":"1484507"}