{"id":"2407.07914","title":"Health Misinformation Detection in Web Content via Web2Vec: A\n  Structural-, Content-based, and Context-aware Approach based on Web2Vec","authors":"Rishabh Upadhyay, Gabriella Pasi, and Marco Viviani","authorsParsed":[["Upadhyay","Rishabh",""],["Pasi","Gabriella",""],["Viviani","Marco",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 10:33:15 GMT"}],"updateDate":"2024-07-12","timestamp":1720175595000,"abstract":"  In recent years, we have witnessed the proliferation of large amounts of\nonline content generated directly by users with virtually no form of external\ncontrol, leading to the possible spread of misinformation. The search for\neffective solutions to this problem is still ongoing, and covers different\nareas of application, from opinion spam to fake news detection. A more recently\ninvestigated scenario, despite the serious risks that incurring disinformation\ncould entail, is that of the online dissemination of health information. Early\napproaches in this area focused primarily on user-based studies applied to Web\npage content. More recently, automated approaches have been developed for both\nWeb pages and social media content, particularly with the advent of the\nCOVID-19 pandemic. These approaches are primarily based on handcrafted features\nextracted from online content in association with Machine Learning. In this\nscenario, we focus on Web page content, where there is still room for research\nto study structural-, content- and context-based features to assess the\ncredibility of Web pages. Therefore, this work aims to study the effectiveness\nof such features in association with a deep learning model, starting from an\nembedded representation of Web pages that has been recently proposed in the\ncontext of phishing Web page detection, i.e., Web2Vec.\n","subjects":["Computing Research Repository/Information Retrieval"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"vwvfrx7dLlo3yvaNsFXkDHTEQ2MB6wP1EUgXNFAuGJg","pdfSize":"420344"}