{"id":"2407.09381","title":"The Effectiveness of Curvature-Based Rewiring and the Role of\n  Hyperparameters in GNNs Revisited","authors":"Floriano Tori, Vincent Holst, Vincent Ginis","authorsParsed":[["Tori","Floriano",""],["Holst","Vincent",""],["Ginis","Vincent",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 16:03:58 GMT"}],"updateDate":"2024-07-15","timestamp":1720800238000,"abstract":"  Message passing is the dominant paradigm in Graph Neural Networks (GNNs). The\nefficiency of message passing, however, can be limited by the topology of the\ngraph. This happens when information is lost during propagation due to being\noversquashed when travelling through bottlenecks. To remedy this, recent\nefforts have focused on graph rewiring techniques, which disconnect the input\ngraph originating from the data and the computational graph, on which message\npassing is performed. A prominent approach for this is to use discrete graph\ncurvature measures, of which several variants have been proposed, to identify\nand rewire around bottlenecks, facilitating information propagation. While\noversquashing has been demonstrated in synthetic datasets, in this work we\nreevaluate the performance gains that curvature-based rewiring brings to\nreal-world datasets. We show that in these datasets, edges selected during the\nrewiring process are not in line with theoretical criteria identifying\nbottlenecks. This implies they do not necessarily oversquash information during\nmessage passing. Subsequently, we demonstrate that SOTA accuracies on these\ndatasets are outliers originating from sweeps of hyperparameters -- both the\nones for training and dedicated ones related to the rewiring algorithm --\ninstead of consistent performance gains. In conclusion, our analysis nuances\nthe effectiveness of curvature-based rewiring in real-world datasets and brings\na new perspective on the methods to evaluate GNN accuracy improvements.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"VnAd7gdbrky4qI478uCrF_nyG0NQr1kDdlQ1B1dvNA0","pdfSize":"1008380","objectId":"0xf2d9ef3a80ddae0372672864d98f33f08052c4d19ada50c1492390fbddfdd2b5","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
