{"id":"2407.00265","title":"Radiation Impedance of Rectangular CMUTs","authors":"Shayan Khorassany, Eric B. Dew, Mohammad Rahim Sobhani, Roger J. Zemp","authorsParsed":[["Khorassany","Shayan",""],["Dew","Eric B.",""],["Sobhani","Mohammad Rahim",""],["Zemp","Roger J.",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 23:55:28 GMT"}],"updateDate":"2024-07-02","timestamp":1719618928000,"abstract":"  Recently, capacitive micromachined ultrasound transducers (CMUTs) with long\nrectangular membranes have demonstrated performance advantages over\nconventional piezoelectric transducers; however, modeling these CMUT geometries\nhas been limited to computationally burdensome numerical methods. Improved fast\nmodeling methods such as equivalent circuit models could help achieve designs\nwith even better performance. The primary obstacle in developing such methods\nis the lack of tractable methods for computing the radiation impedance of\nclamped rectangular radiators. This paper presents a method which approximates\nthe velocity profile using a polynomial shape model to rapidly and accurately\nestimate radiation impedance. The validity of the approximate velocity profile\nand corresponding radiation impedance calculation was assessed using finite\nelement simulations for a variety of membrane aspect ratios and bias voltages.\nOur method was evaluated for rectangular radiators with width:length ratios\nfrom 1:1 up to 1:25. At all aspect ratios, the radiation resistance was closely\nmodeled. However, when calculating the radiation reactance, our initial\napproach was only accurate for low aspect ratios. This motivated us to consider\nan alternative shape model for high aspect ratios, which was more accurate when\ncompared with FEM. To facilitate development of future rectangular CMUTs, we\nprovide a MATLAB script which quickly calculates radiation impedance using both\nmethods.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"9KZjl3rUs8CRO3450_7M7r4k7-UiluFFe6P3JKi6VhE","pdfSize":"2447428"}