{"id":"2407.03827","title":"High-Frequency Radar observation of strong and contrasted currents: the\n  Alderney race paradigm","authors":"Dylan Dumas, Anne-Claire Bennis, Charles-Antoine Gu\\'erin, Guiomar\n  Lopez and Laurent Benoit","authorsParsed":[["Dumas","Dylan",""],["Bennis","Anne-Claire",""],["Guérin","Charles-Antoine",""],["Lopez","Guiomar",""],["Benoit","Laurent",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 10:57:17 GMT"}],"updateDate":"2024-07-08","timestamp":1720090637000,"abstract":"  The Alderney Race has been identified as a future site for the development of\ntidal energy, due to its bidirectional strong current reaching 5 m/s during\nspring tides. This hydrodynamics is very difficult to measure by in situ or\nremote sensing means. High-frequency coastal radars can provide a synoptic and\nnear-real-time view of such a complex circulation, but the classical processing\nalgorithms are not adapted to the extreme situation of strongly sheared\ncurrents. We propose an improved high-resolution direction-finding technique\nfor the azimuthal processing of such radar data. It uses phased-array systems\nand combines the advantages of the usual beam-forming technique to eliminate\nmany problems related to the distortion of Doppler spectra by extreme currents.\nThe method is evaluated with a unique data set of radar measurements at two\nradar frequencies (13 and 24.5 MHz) and three spatial resolutions (200, 750,\nand 1500 m). The radar-based surface currents are analyzed in the light of a\nhigh-resolution numerical model and also compared with in situ measurements.\nWhile high azimuthal resolution can be achieved in this way, it is shown that\nthe typical range resolutions of 750 and 1500 m are insufficient to account for\nthe strong spatial variations of the surface current at some specific times and\nlocations.\n","subjects":["Physics/Atmospheric and Oceanic Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"LthXt--tFxCDOLat3z2bLDe6xi3IzZ_uAcRWlzPGw1E","pdfSize":"3349771"}