{"id":"2407.04934","title":"Design and Reprogrammability of Zero Modes in 2D Materials from a Single\n  Element","authors":"Daniel Revier, Molly Carton, Jeffrey I. Lipton","authorsParsed":[["Revier","Daniel",""],["Carton","Molly",""],["Lipton","Jeffrey I.",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 02:51:25 GMT"}],"updateDate":"2024-07-09","timestamp":1720234285000,"abstract":"  Mechanical extremal materials, a class of metamaterials that exist at the\nbounds of elastic theory, possess the extraordinary capability to engineer any\ndesired elastic behavior by harnessing mechanical zero modes -- deformation\nmodes that demand minimal or no elastic energy. However, the potential for\narbitrary construction and reprogramming of metamaterials remains largely\nunrealized, primarily due to significant challenges in qualitatively\ntransforming zero modes within the confines of existing metamaterial design\nframeworks. In this work, we show a method for explicitly defining and in situ\nreprogramming zero modes of two-dimensional extremal materials by employing\nstraight-line mechanisms (SLMs) and planar symmetry, which prescribe and\ncoordinate the zero modes, respectively. We design, test, and reprogram\ncentimeter-scale isotropic, orthotropic, and chiral extremal materials by\nreorienting the SLMs in place, enabling these materials to smoothly and\nreversibly interpolate between extremal modalities (e.g., unimode to bimode)\nand material properties (e.g., negative to positive Poisson's ratios) without\nchanging the metamaterial's global structure. Our methodology provides a\nstraightforward and explicit strategy for the design and tuning of all\nvarieties of two-dimensional extremal materials, enabling arbitrary and dynamic\nmechanical metamaterial construction to completely cover the gamut of elastic\nproperties.\n","subjects":["Physics/Applied Physics","Physics/Classical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"88b0A9qMdobPaZHx-5V7m5Tp-s3ggnZ1HuTJIhiGHYs","pdfSize":"4109358"}