{"id":"2407.12061","title":"Situated Instruction Following","authors":"So Yeon Min, Xavi Puig, Devendra Singh Chaplot, Tsung-Yen Yang,\n  Akshara Rai, Priyam Parashar, Ruslan Salakhutdinov, Yonatan Bisk, Roozbeh\n  Mottaghi","authorsParsed":[["Min","So Yeon",""],["Puig","Xavi",""],["Chaplot","Devendra Singh",""],["Yang","Tsung-Yen",""],["Rai","Akshara",""],["Parashar","Priyam",""],["Salakhutdinov","Ruslan",""],["Bisk","Yonatan",""],["Mottaghi","Roozbeh",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 19:32:30 GMT"}],"updateDate":"2024-07-18","timestamp":1721071950000,"abstract":"  Language is never spoken in a vacuum. It is expressed, comprehended, and\ncontextualized within the holistic backdrop of the speaker's history, actions,\nand environment. Since humans are used to communicating efficiently with\nsituated language, the practicality of robotic assistants hinge on their\nability to understand and act upon implicit and situated instructions. In\ntraditional instruction following paradigms, the agent acts alone in an empty\nhouse, leading to language use that is both simplified and artificially\n\"complete.\" In contrast, we propose situated instruction following, which\nembraces the inherent underspecification and ambiguity of real-world\ncommunication with the physical presence of a human speaker. The meaning of\nsituated instructions naturally unfold through the past actions and the\nexpected future behaviors of the human involved. Specifically, within our\nsettings we have instructions that (1) are ambiguously specified, (2) have\ntemporally evolving intent, (3) can be interpreted more precisely with the\nagent's dynamic actions. Our experiments indicate that state-of-the-art\nEmbodied Instruction Following (EIF) models lack holistic understanding of\nsituated human intention.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"kaQ0kPKH6SX88xY-_C2hZspfsJN4LggYbdiD9GA8fe8","pdfSize":"3124207","objectId":"0x1a64b13d0952e901b1b7c44ccbbbac8ac227f5842a7c09075db2ac267020fbcf","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
