{"id":"2407.08891","title":"Hyperfine-to-rotational energy transfer in ultracold atom-molecule\n  collisions","authors":"Yi-Xiang Liu, Lingbang Zhu, Jeshurun Luke, Mark C. Babin, Timur V.\n  Tscherbul, Marcin Gronowski, Hela Ladjimi, Micha{\\l} Tomza, John L. Bohn,\n  Kang-Kuen Ni","authorsParsed":[["Liu","Yi-Xiang",""],["Zhu","Lingbang",""],["Luke","Jeshurun",""],["Babin","Mark C.",""],["Tscherbul","Timur V.",""],["Gronowski","Marcin",""],["Ladjimi","Hela",""],["Tomza","Michał",""],["Bohn","John L.",""],["Ni","Kang-Kuen",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 23:20:14 GMT"}],"updateDate":"2024-07-15","timestamp":1720740014000,"abstract":"  Energy transfer between different mechanical degrees of freedom in\natom-molecule collisions has been widely studied and largely understood.\nHowever, systems involving spins remain less explored, especially with a\nstate-to-state precision. Here, we directly observed the energy transfer from\natomic hyperfine to molecular rotation in the $^{87}$Rb ($|F_a,M_{F_a}\\rangle =\n|2,2\\rangle$) + $^{40}$K$^{87}$Rb (in the rovibronic ground state $N=0$)\n$\\longrightarrow$ Rb ($ |1,1\\rangle$) + KRb ($N=0,1,2$) exothermic collision.\nWe probed the quantum states of the collision products using resonance-enhanced\nmulti-photon ionization followed by time-of-flight mass spectrometry. We also\ncarried out state-of-the-art quantum scattering calculations, which rigorously\ntake into account the coupling between the spin and rotational degrees of\nfreedom at short range, and assume that the KRb monomer can be treated as a\nrigid rotor moving on a single potential energy surface. The calculated product\nrotational state distribution deviates from the observations even after\nextensive tuning of the atom-molecule potential energy surface, suggesting that\nvibrational degrees of freedom and conical intersections play an important part\nin ultracold Rb + KRb collisions. Additionally, our ab initio calculations\nindicate that spin-rotation coupling is dramatically enhanced near a conical\nintersection, which is energetically accessible at short range. The\nobservations confirm that spin is coupled to mechanical rotation at short range\nand establish a benchmark for future theoretical studies.\n","subjects":["Physics/Atomic Physics","Physics/Chemical Physics","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"GGJ1IBwdWTvwH9aYo-kOXercyaIuX2uYe98IEEMrlMI","pdfSize":"8081382","objectId":"0xd5973e3446dbceb3f59f6a0c7bc506c6a7d6f6d7fd33eeda1e530f0cc7047a6d","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
