{"id":"2407.05244","title":"Some Issues in Predictive Ethics Modeling: An Annotated Contrast Set of\n  \"Moral Stories\"","authors":"Ben Fitzgerald","authorsParsed":[["Fitzgerald","Ben",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 03:22:49 GMT"}],"updateDate":"2024-07-09","timestamp":1720322569000,"abstract":"  Models like Delphi have been able to label ethical dilemmas as moral or\nimmoral with astonishing accuracy. This paper challenges accuracy as a holistic\nmetric for ethics modeling by identifying issues with translating moral\ndilemmas into text-based input. It demonstrates these issues with contrast sets\nthat substantially reduce the performance of classifiers trained on the dataset\nMoral Stories. Ultimately, we obtain concrete estimates for how much specific\nforms of data misrepresentation harm classifier accuracy. Specifically,\nlabel-changing tweaks to the descriptive content of a situation (as small as\n3-5 words) can reduce classifier accuracy to as low as 51%, almost half the\ninitial accuracy of 99.8%. Associating situations with a misleading social norm\nlowers accuracy to 98.8%, while adding textual bias (i.e. an implication that a\nsituation already fits a certain label) lowers accuracy to 77%.\n  These results suggest not only that many ethics models have substantially\noverfit, but that several precautions are required to ensure that input\naccurately captures a moral dilemma. This paper recommends re-examining the\nstructure of a social norm, training models to ask for context with defeasible\nreasoning, and filtering input for textual bias. Doing so not only gives us the\nfirst concrete estimates of the average cost to accuracy of misrepresenting\nethics data, but gives researchers practical tips for considering these\nestimates in research.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"f3jAZU27Mk2GppUlnPbkRh4DUpyXub89-3KrUfDNWPY","pdfSize":"555860"}