{"id":"2407.12351","title":"High-power ultra-broadband supercontinuum generation in tapered\n  multimode glass rods","authors":"Esteban Serrano, Damien Bailleul, Fr\\'ed\\'eric D\\'es\\'ev\\'edavy,\n  Pierre B\\'ejot, Gr\\'egory Gadret, Pierre Mathey, Fr\\'ed\\'eric Smektala, and\n  Bertrand Kibler","authorsParsed":[["Serrano","Esteban",""],["Bailleul","Damien",""],["Désévédavy","Frédéric",""],["Béjot","Pierre",""],["Gadret","Grégory",""],["Mathey","Pierre",""],["Smektala","Frédéric",""],["Kibler","Bertrand",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 06:58:54 GMT"}],"updateDate":"2024-07-18","timestamp":1721199534000,"abstract":"  Simultaneously increasing the spectral bandwidth and average output power of\nmid-infrared supercontinuum sources remains a major challenge for their\npractical application. We address this issue through experimental developments\nof short tapered rods made from distinct glasses (silica, tellurite and\nchalcogenide families) for covering distinct spectral regions by means of\nsupercontinuum generation in the femtosecond regime. We demonstrate that\nultra-broadband spectral broadenings over the entire glass transmission window\ncan be achieved in few-cm-long segments of tapered rods by a fine adjustment of\ninput modal excitation. As the most significant example, our simple\npost-processing of glass rods unlocks the high-power regime for fiber-based\nsupercontinuum sources beyond the 10 micron waveband. By using a 5-cm-long\ntapered Ge-Se-Te rod pumped at 6 micron, a supercontinuum spanning from 2 to 15\nmicron (3 to 14 micron) with an average output power of 93 mW (170 mW) is\nobtained for 500-kHz (1-MHz) repetition rate. Spectral coverages from the\nvisible to 5 micron, and from the visible to 2.7 micron, are also reported with\ntapered rods made of tellurite and silica glasses, respectively. Numerical\nsimulations are used to confirm the main contribution of the fundamental mode\nin the ultrafast nonlinear dynamics, as well as the possible preservation of\ncoherence features. Our study opens a new route towards the power scaling of\nhigh-repetition-rate fiber supercontinuum sources over the full molecular\nfingerprint region.\n","subjects":["Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"yZO32NcYHOwvgA1v4qTdg5M9Ev7lWIsjNTvk3ZDAx2A","pdfSize":"1795020"}