{"id":"2407.04557","title":"Structural Constraint Integration in Generative Model for Discovery of\n  Quantum Material Candidates","authors":"Ryotaro Okabe, Mouyang Cheng, Abhijatmedhi Chotrattanapituk, Nguyen\n  Tuan Hung, Xiang Fu, Bowen Han, Yao Wang, Weiwei Xie, Robert J. Cava, Tommi\n  S. Jaakkola, Yongqiang Cheng and Mingda Li","authorsParsed":[["Okabe","Ryotaro",""],["Cheng","Mouyang",""],["Chotrattanapituk","Abhijatmedhi",""],["Hung","Nguyen Tuan",""],["Fu","Xiang",""],["Han","Bowen",""],["Wang","Yao",""],["Xie","Weiwei",""],["Cava","Robert J.",""],["Jaakkola","Tommi S.",""],["Cheng","Yongqiang",""],["Li","Mingda",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 14:42:54 GMT"}],"updateDate":"2024-07-08","timestamp":1720190574000,"abstract":"  Billions of organic molecules are known, but only a tiny fraction of the\nfunctional inorganic materials have been discovered, a particularly relevant\nproblem to the community searching for new quantum materials. Recent\nadvancements in machine-learning-based generative models, particularly\ndiffusion models, show great promise for generating new, stable materials.\nHowever, integrating geometric patterns into materials generation remains a\nchallenge. Here, we introduce Structural Constraint Integration in the\nGENerative model (SCIGEN). Our approach can modify any trained generative\ndiffusion model by strategic masking of the denoised structure with a diffused\nconstrained structure prior to each diffusion step to steer the generation\ntoward constrained outputs. Furthermore, we mathematically prove that SCIGEN\neffectively performs conditional sampling from the original distribution, which\nis crucial for generating stable constrained materials. We generate eight\nmillion compounds using Archimedean lattices as prototype constraints, with\nover 10% surviving a multi-staged stability pre-screening. High-throughput\ndensity functional theory (DFT) on 26,000 survived compounds shows that over\n50% passed structural optimization at the DFT level. Since the properties of\nquantum materials are closely related to geometric patterns, our results\nindicate that SCIGEN provides a general framework for generating quantum\nmaterials candidates.\n","subjects":["Condensed Matter/Materials Science","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"u1GqheH54pbXnU-FM4iZPkX5Heg4R1c2DOlzVAMmVk8","pdfSize":"34203745"}