{"id":"2407.15665","title":"A spatiotemporal deep learning framework for prediction of crack\n  dynamics in heterogeneous solids: efficient mapping of concrete\n  microstructures to its fracture properties","authors":"Rasoul Najafi Koopas, Shahed Rezaei, Natalie Rauter, Richard Ostwald,\n  Rolf Lammering","authorsParsed":[["Koopas","Rasoul Najafi",""],["Rezaei","Shahed",""],["Rauter","Natalie",""],["Ostwald","Richard",""],["Lammering","Rolf",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 14:28:46 GMT"},{"version":"v2","created":"Wed, 24 Jul 2024 07:51:20 GMT"}],"updateDate":"2024-07-25","timestamp":1721658526000,"abstract":"  A spatiotemporal deep learning framework is proposed that is capable of 2D\nfull-field prediction of fracture in concrete mesostructures. This framework\nnot only predicts fractures but also captures the entire history of the\nfracture process, from the crack initiation in the interfacial transition zone\nto the subsequent propagation of the cracks in the mortar matrix. In addition,\na convolutional neural network is developed which can predict the averaged\nstress-strain curve of the mesostructures. The UNet modeling framework, which\ncomprises an encoder-decoder section with skip connections, is used as the deep\nlearning surrogate model. Training and test data are generated from\nhigh-fidelity fracture simulations of randomly generated concrete\nmesostructures. These mesostructures include geometric variabilities such as\ndifferent aggregate particle geometrical features, spatial distribution, and\nthe total volume fraction of aggregates. The fracture simulations are carried\nout in Abaqus, utilizing the cohesive phase-field fracture modeling technique\nas the fracture modeling approach. In this work, to reduce the number of\ntraining datasets, the spatial distribution of three sets of material\nproperties for three-phase concrete mesostructures, along with the spatial\nphase-field damage index, are fed to the UNet to predict the corresponding\nstress and spatial damage index at the subsequent step. It is shown that after\nthe training process using this methodology, the UNet model is capable of\naccurately predicting damage on the unseen test dataset by using 470 datasets.\nMoreover, another novel aspect of this work is the conversion of irregular\nfinite element data into regular grids using a developed pipeline. This\napproach allows for the implementation of less complex UNet architecture and\nfacilitates the integration of phase-field fracture equations into surrogate\nmodels for future developments.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"_em327Y0Sr23tQOmprA7z4DYzgfNTfYp2rPQxccBvsY","pdfSize":"26219257"}