{"id":"2407.21074","title":"Holographic dark energy in Barrow cosmology with Granda-Oliveros IR\n  cutoff","authors":"M. Motaghi, A. Sheykhi, E. Ebrahimi","authorsParsed":[["Motaghi","M.",""],["Sheykhi","A.",""],["Ebrahimi","E.",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 13:27:04 GMT"}],"updateDate":"2024-08-01","timestamp":1722259624000,"abstract":"  Applying the modified Barrow entropy, inspired by the quantum fluctuation\neffects, to the cosmological background, and using thermodynamics-gravity\nconjuncture, the Friedmann equations get modified as well. In this paper, we\nexplore the holographic dark energy with Granda-Oliveros (GO) IR cutoff, in the\ncontext of the modified Barrow cosmology. First, we assume two dark components\nof the universe evolves independently and obtain the cosmological parameters\nand explore the cosmic evolution. Second, we consider an interaction term\nbetween dark energy (DE) and dark matter (DM). We observe that the Barrow\nparameter $\\delta$ crucially affects the cosmic dynamics, causes the transition\nfrom the decelerating phase to the accelerating phase occurs later. We find out\nthat the equation of state parameter is in the quintessence region in the past\nand crosses the phantom divide at the present time. Finally, we examine the\nsquared speed of sound analysis for this model. According to the squared sound\nspeed diagrams, the results indicate that the presence of interaction between\nDM and DE as well as increasing in the value of $\\delta$ leads to the\nmanifestation of signs of instability in the past $(v_s^2<0)$. Furthermore, by\nexamining the statefinder, we find that presence of $\\delta$ also makes a\ndistinction between holographic dark energy in Barrow cosmology with GO-IR\ncutoff and the $\\Lambda$CDM model. In fact, increasing $\\delta$ causes the\nstatefinder diagram move away from the point of $\\left\\lbrace r,s\\right\\rbrace=\n\\left\\lbrace 1,0\\right\\rbrace$ at $z=0$.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"oLPKlNP3iJYpuY8hCPE26LJbmOx56EAffvSt3xyNQrc","pdfSize":"388637","objectId":"0x4ecefe676bf868043bfa214051cc80308fe4480bb761973e107e43eeed939aed","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
