{"id":"2407.14286","title":"PACCOR4ESP: Embedded Device Security Attestation using Platform\n  Attribute Certificates","authors":"Thomas Gr\\\"ubl, Jan von der Assen, Markus Knecht, Burkhard Stiller","authorsParsed":[["Grübl","Thomas",""],["von der Assen","Jan",""],["Knecht","Markus",""],["Stiller","Burkhard",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 13:17:00 GMT"}],"updateDate":"2024-07-22","timestamp":1721395020000,"abstract":"  Verifying the integrity of embedded device characteristics is required to\nensure secure operation of a device. One central challenge is to securely\nextract and store device-specific configurations for future verification.\nExisting device attestation schemes suffer from notable limitations, including\na lack of standardization and a failure to encompass all hardware and software\naspects inherent to a platform. This paper proposes an extension of the NSA\nCybersecurity Directorate's Platform Attribute Certificate Creator (PACCOR) for\nthe ESP32, a widely-used microcontroller series. Platform Attribute\nCertificates store device characteristics as per the Trusted Computing Group's\nPlatform Certificate Profile. As of today, there is little research on hybrid\nattestation schemes utilizing Platform Attribute Certificates on embedded\ndevices, which this work addresses.\n  This paper presents a collection of attacks that can be detected using\nPACCOR4ESP. The toolkit extracts security-relevant information from an\nESP32-S3, such as the firmware hash, bootloader hash, GPIO pin configuration,\nand a reference to the endorsement key of the secure element, and automatically\nembeds it into a Platform Attribute Certificate. Lastly, this work shows how\nPACCOR4ESP can be integrated with existing embedded device attestation\nframeworks, such as RAS, CRAFT, and SEDA.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"0Yt-NCT-Ef2z-d3m4iOfoBnrOSSxCE2dtS9yZBaE_ho","pdfSize":"750031"}