{"id":"2407.02150","title":"VRBiom: A New Periocular Dataset for Biometric Applications of HMD","authors":"Ketan Kotwal, Ibrahim Ulucan, Gokhan Ozbulak, Janani Selliah and\n  Sebastien Marcel","authorsParsed":[["Kotwal","Ketan",""],["Ulucan","Ibrahim",""],["Ozbulak","Gokhan",""],["Selliah","Janani",""],["Marcel","Sebastien",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 10:47:50 GMT"}],"updateDate":"2024-07-03","timestamp":1719917270000,"abstract":"  With advancements in hardware, high-quality HMD devices are being developed\nby numerous companies, driving increased consumer interest in AR, VR, and MR\napplications. In this work, we present a new dataset, called VRBiom, of\nperiocular videos acquired using a Virtual Reality headset. The VRBiom,\ntargeted at biometric applications, consists of 900 short videos acquired from\n25 individuals recorded in the NIR spectrum. These 10s long videos have been\ncaptured using the internal tracking cameras of Meta Quest Pro at 72 FPS. To\nencompass real-world variations, the dataset includes recordings under three\ngaze conditions: steady, moving, and partially closed eyes. We have also\nensured an equal split of recordings without and with glasses to facilitate the\nanalysis of eye-wear. These videos, characterized by non-frontal views of the\neye and relatively low spatial resolutions (400 x 400), can be instrumental in\nadvancing state-of-the-art research across various biometric applications. The\nVRBiom dataset can be utilized to evaluate, train, or adapt models for\nbiometric use-cases such as iris and/or periocular recognition and associated\nsub-tasks such as detection and semantic segmentation.\n  In addition to data from real individuals, we have included around 1100 PA\nconstructed from 92 PA instruments. These PAIs fall into six categories\nconstructed through combinations of print attacks (real and synthetic\nidentities), fake 3D eyeballs, plastic eyes, and various types of masks and\nmannequins. These PA videos, combined with genuine (bona-fide) data, can be\nutilized to address concerns related to spoofing, which is a significant threat\nif these devices are to be used for authentication.\n  The VRBiom dataset is publicly available for research purposes related to\nbiometric applications only.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"uq-eQosOHGZQ2lyfCVyz53tS4M3hqNLmbo8HClvQWJc","pdfSize":"6667433"}