{"id":"2407.05064","title":"Reverse Engineered MiniFS File System","authors":"Dmitrii Belimov and Evgenii Vinogradov","authorsParsed":[["Belimov","Dmitrii",""],["Vinogradov","Evgenii",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 12:49:37 GMT"}],"updateDate":"2024-07-09","timestamp":1720270177000,"abstract":"  In an era where digital connectivity is increasingly foundational to daily\nlife, the security of Wi-Fi Access Points (APs) is a critical concern. This\npaper addresses the vulnerabilities inherent in Wi-Fi APs, with a particular\nfocus on those using proprietary file systems like MiniFS found in TP-Link's\nAC1900 WiFi router. Through reverse engineering, we unravel the structure and\noperation of MiniFS, marking a significant advancement in our understanding of\nthis previously opaque file system. Our investigation reveals not only the\narchitecture of MiniFS but also identifies several private keys and underscores\na concerning lack of cryptographic protection. These findings point to broader\nsecurity vulnerabilities, emphasizing the risks of security-by-obscurity\npractices in an interconnected environment. Our contributions are twofold:\nfirstly, based, on the file system structure, we develop a methodology for the\nextraction and analysis of MiniFS, facilitating the identification and\nmitigation of potential vulnerabilities. Secondly, our work lays the groundwork\nfor further research into WiFi APs' security, particularly those running on\nsimilar proprietary systems. By highlighting the critical need for transparency\nand community engagement in firmware analysis, this study contributes to the\ndevelopment of more secure network devices, thus enhancing the overall security\nposture of digital infrastructures.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Networking and Internet Architecture"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ObdYLvMeB9ZmHE0SzWKApx5qlbm7zkDzNNBYiyhnd8E","pdfSize":"909635"}