{"id":"2407.10884","title":"Effect of order of transfer matrix exceptional points on transport at\n  band edges","authors":"Madhumita Saha, Bijay Kumar Agarwalla, Manas Kulkarni, and Archak\n  Purkayastha","authorsParsed":[["Saha","Madhumita",""],["Agarwalla","Bijay Kumar",""],["Kulkarni","Manas",""],["Purkayastha","Archak",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 16:37:01 GMT"}],"updateDate":"2024-07-16","timestamp":1721061421000,"abstract":"  Recently, it has been shown that, in one dimensional fermionic systems, close\nto band edges, the zero temperature conductance scales as $1/N^2$, where $N$ is\nthe system length. This universal subdiffusive scaling of conductance at band\nedges has been tied to an exceptional point (EP) of the transfer matrix of the\nsystem that occur at every band edge. Further, in presence of bulk dephasing\nprobes, this EP has been shown to lead to a counterintuitive superballistic\nscaling of conductance, where the conductance increases with $N$ over a finite\nbut large regime of system lengths. In this work, we explore how these\nbehaviors are affected by the order of the transfer matrix EP at the band edge.\nWe consider a one-dimensional fermionic lattice chain with a finite range of\nhopping. Depending on the range of hopping and the hopping parameters, this\nsystem can feature band edges which correspond to arbitrarily higher order EPs\nof the associated transfer matrix. Using this system we establish in generality\nthat, in absence of bulk dephasing, surprisingly, the universal $1/N^2$ scaling\nof conductance is completely unaffected by the order of the EP. This is despite\nthe fact that existence of transfer matrix EP is crucial for such behavior. In\npresence of bulk dephasing, however, the phase coherence length, the extent of\nthe superballisitic scaling regime and the exponent of superballistic scaling,\nall encode the order of the transfer matrix EP.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Statistical Mechanics","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"-cWx2CbbyS8pcMj6MEPIEdfdq2yUAcNJ2V7rlnMAf1I","pdfSize":"984076"}