{"id":"2407.03133","title":"Quantifying the Cross-sectoral Intersecting Discrepancies within\n  Multiple Groups Using Latent Class Analysis Towards Fairness","authors":"Yingfang Yuan, Kefan Chen, Mehdi Rizvi, Lynne Baillie, Wei Pang","authorsParsed":[["Yuan","Yingfang",""],["Chen","Kefan",""],["Rizvi","Mehdi",""],["Baillie","Lynne",""],["Pang","Wei",""]],"versions":[{"version":"v1","created":"Fri, 24 May 2024 08:10:31 GMT"},{"version":"v2","created":"Thu, 11 Jul 2024 09:19:11 GMT"}],"updateDate":"2024-07-12","timestamp":1716538231000,"abstract":"  The growing interest in fair AI development is evident. The ''Leave No One\nBehind'' initiative urges us to address multiple and intersecting forms of\ninequality in accessing services, resources, and opportunities, emphasising the\nsignificance of fairness in AI. This is particularly relevant as an increasing\nnumber of AI tools are applied to decision-making processes, such as resource\nallocation and service scheme development, across various sectors such as\nhealth, energy, and housing. Therefore, exploring joint inequalities in these\nsectors is significant and valuable for thoroughly understanding overall\ninequality and unfairness. This research introduces an innovative approach to\nquantify cross-sectoral intersecting discrepancies among user-defined groups\nusing latent class analysis. These discrepancies can be used to approximate\ninequality and provide valuable insights to fairness issues. We validate our\napproach using both proprietary and public datasets, including EVENS and Census\n2021 (England & Wales) datasets, to examine cross-sectoral intersecting\ndiscrepancies among different ethnic groups. We also verify the reliability of\nthe quantified discrepancy by conducting a correlation analysis with a\ngovernment public metric. Our findings reveal significant discrepancies between\nminority ethnic groups, highlighting the need for targeted interventions in\nreal-world AI applications. Additionally, we demonstrate how the proposed\napproach can be used to provide insights into the fairness of machine learning.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"9t_jnh5WPaq8OMbM0bZc0FRwzrsoIMg7Fxf055bV0U0","pdfSize":"919700"}