{"id":"2407.05349","title":"Stable room-temperature multiferroic skyrmions in lithium niobate with\n  enhanced Pockels effect","authors":"Yalong Yu, Bo Xiong, Siqi Wu, Yekai Ren, Nuo Chen, Qingjiao Mi,\n  Kangping Lou, Rui Wang, and Tao Chu","authorsParsed":[["Yu","Yalong",""],["Xiong","Bo",""],["Wu","Siqi",""],["Ren","Yekai",""],["Chen","Nuo",""],["Mi","Qingjiao",""],["Lou","Kangping",""],["Wang","Rui",""],["Chu","Tao",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 13:00:22 GMT"}],"updateDate":"2024-08-20","timestamp":1720357222000,"abstract":"  Lithium Niobate (LN) is a ferroelectric material with exceptional electrical\ncharacteristics, including high piezoelectricity, high Pockels effect, etc.\nThese properties make it a promising platform for numerous fields such as\nhigh-speed communication, optical computation, and quantum information\nprocessing. Besides these, the introduction of magnetic structures to LN holds\nsignificant potential to achieve magnetoelectric coupling, which can be applied\nin magnetic memory and data-processing devices with high efficiency. Here, for\nthe first time, we observe a special topological magnetic structure called\nmagnetic skyrmion in LN (SK-LN) by the combination of magnetic field annealing\nand rapid annealing processes . Compared to the magnetic skyrmions reported in\nmagnetic systems, SK-LN exhibit exceptionally high stability. Additionally, the\ncenter of the magnetic vortex exhibits spontaneous ferroelectric polarization,\nindicating its multiferroic characteristic. With the excitation of these\nmultiferroic skyrmions, the modulation efficiency of the electro-optical (EO)\nmodulator fabricated on thin film lithium niobate on insulator (LNOI) wafer was\nfound to be enhanced from 1.98 V*cm to 0.63 V*cm. It is considered that the\nmultiferroic skyrmions significantly enhance the Pockels coefficient of LN to\n101 pm/V, nearly three times the result (32pm/V) reported previously.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"lDRQbfsi_kDwlq8c2vFCDsrfqvQkkEt_eje08NBhxUM","pdfSize":"1139564"}