{"id":"2407.03284","title":"Aligning Planet-Hosting Binaries via Dissipative Precession in\n  Circumstellar Disks","authors":"Konstantin Gerbig, Malena Rice, J.J. Zanazzi, Sam Christian, Andrew\n  Vanderburg","authorsParsed":[["Gerbig","Konstantin",""],["Rice","Malena",""],["Zanazzi","J. J.",""],["Christian","Sam",""],["Vanderburg","Andrew",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 17:10:01 GMT"}],"updateDate":"2024-07-04","timestamp":1720026601000,"abstract":"  Recent observations have demonstrated that some subset of even moderately\nwide-separation planet-hosting binaries are preferentially configured such that\nplanetary and binary orbits appear to lie within the same plane. In this work,\nwe explore dissipation during the protoplanetary disk phase, induced by disk\nwarping as the system is forced into nodal recession by an inclined binary\ncompanion as a possible avenue of achieving orbit-orbit alignment. We\nanalytically model the coupled evolution of the disk angular momentum vector\nand stellar spin vector under the influence of a distant binary companion. We\nfind that a population of systems with random initial orientations can appear\ndetectably more aligned after undergoing dissipative precession, and that this\nprocess can simultaneously produce an obliquity distribution that is consistent\nwith observations. While dissipative precession proceeds efficiently in close\nbinaries, favorable system properties (e.g., $r_{out} \\gtrsim 100$ AU, $\\alpha\n\\gtrsim 0.05$, and/or $M_b/M_{*} \\gtrsim 1$) are required to reproduce observed\nalignment trends at wider binary separations $a_\\mathrm{b} \\gtrsim450$ AU. Our\nframework further predicts that circum-primary planets in systems with high\nstellar mass ratios should be preferentially less aligned than planets in\nequal-mass stellar binary systems. We discover tentative evidence for this\ntrend in \\textit{Gaia} DR3 and TESS data. Our findings suggest that dissipative\nprecession may play a significant role in sculpting orbital configurations in a\nsub-set of moderately-wide planet-hosting binaries, but is likely not solely\nresponsible for their observed population-level alignment.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"nkAHmL-JaTqbAWjs2N3mUccbMbq60vXXOoyyIcKbjaI","pdfSize":"2274445"}