{"id":"2407.06262","title":"Indirect Searches for Ultraheavy Dark Matter in the Time Domain","authors":"David E. Kaplan, Xuheng Luo, Ngan H. Nguyen, Surjeet Rajendran, Erwin\n  H. Tanin","authorsParsed":[["Kaplan","David E.",""],["Luo","Xuheng",""],["Nguyen","Ngan H.",""],["Rajendran","Surjeet",""],["Tanin","Erwin H.",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 18:00:01 GMT"}],"updateDate":"2024-07-10","timestamp":1720461601000,"abstract":"  Dark matter may exist today in the form of ultraheavy composite bound states.\nCollisions between such dark matter states can release intense bursts of\nradiation that includes gamma-rays among the final products. Thus,\nindirect-detection signals of dark matter may include unconventional gamma-ray\nbursts. Such bursts may have been missed not necessarily because of their low\narriving gamma-ray fluxes, but rather their briefness and rareness. We point\nout that intense bursts whose non-detection thus far are due to the latter can\nbe detected in the near future with existing and planned facilities. In\nparticular, we propose that, with slight experimental adjustments and suitable\ndata analyses, imaging atmospheric Cherenkov telescopes (IACTs) and Pulsed\nAll-sky Near-infrared and Optical Search for Extra-Terrestrial Intelligence\n(PANOSETI) are promising tools for detecting such rare, brief, but intense\nbursts. We also show that if we assume these bursts originate from collisions\nof dark matter states, IACTs and PANOSETI can probe a large dark matter\nparameter space beyond existing limits. Additionally, we present a concrete\nmodel of dark matter that produces bursts potentially detectable in these\ninstruments.\n","subjects":["Physics/High Energy Physics - Phenomenology","Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/Astrophysics of Galaxies","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"dxxx5UuAGTRIuWBRWCYaa5pEzEdIqXOb4-4AOT9Wbn4","pdfSize":"1335401"}
