{"id":"2407.12897","title":"NeuroSynth: MRI-Derived Neuroanatomical Generative Models and Associated\n  Dataset of 18,000 Samples","authors":"Sai Spandana Chintapalli, Rongguang Wang, Zhijian Yang, Vasiliki\n  Tassopoulou, Fanyang Yu, Vishnu Bashyam, Guray Erus, Pratik Chaudhari,\n  Haochang Shou, Christos Davatzikos","authorsParsed":[["Chintapalli","Sai Spandana",""],["Wang","Rongguang",""],["Yang","Zhijian",""],["Tassopoulou","Vasiliki",""],["Yu","Fanyang",""],["Bashyam","Vishnu",""],["Erus","Guray",""],["Chaudhari","Pratik",""],["Shou","Haochang",""],["Davatzikos","Christos",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 15:33:10 GMT"}],"updateDate":"2024-07-19","timestamp":1721230390000,"abstract":"  Availability of large and diverse medical datasets is often challenged by\nprivacy and data sharing restrictions. For successful application of machine\nlearning techniques for disease diagnosis, prognosis, and precision medicine,\nlarge amounts of data are necessary for model building and optimization. To\nhelp overcome such limitations in the context of brain MRI, we present\nNeuroSynth: a collection of generative models of normative regional volumetric\nfeatures derived from structural brain imaging. NeuroSynth models are trained\non real brain imaging regional volumetric measures from the iSTAGING\nconsortium, which encompasses over 40,000 MRI scans across 13 studies,\nincorporating covariates such as age, sex, and race. Leveraging NeuroSynth, we\nproduce and offer 18,000 synthetic samples spanning the adult lifespan (ages\n22-90 years), alongside the model's capability to generate unlimited data.\nExperimental results indicate that samples generated from NeuroSynth agree with\nthe distributions obtained from real data. Most importantly, the generated\nnormative data significantly enhance the accuracy of downstream machine\nlearning models on tasks such as disease classification. Data and models are\navailable at: https://huggingface.co/spaces/rongguangw/neuro-synth.\n","subjects":["Quantitative Biology/Quantitative Methods","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"zzLXHsIIccgOkte94xSY0WVSM4AwH4wUMY3XRyNy99w","pdfSize":"1499705"}