{"id":"2407.19399","title":"Large-scale Multiple Testing of Cross-covariance Functions with\n  Applications to Functional Network Models","authors":"Qin Fang, Qing Jiang, Xinghao Qiao","authorsParsed":[["Fang","Qin",""],["Jiang","Qing",""],["Qiao","Xinghao",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 05:00:41 GMT"},{"version":"v2","created":"Wed, 4 Sep 2024 14:13:16 GMT"}],"updateDate":"2024-09-05","timestamp":1722142841000,"abstract":"  The estimation of functional networks through functional covariance and\ngraphical models have recently attracted increasing attention in settings with\nhigh dimensional functional data, where the number of functional variables p is\ncomparable to, and maybe larger than, the number of subjects. However, the\nexisting methods all depend on regularization techniques, which make it unclear\nhow the involved tuning parameters are related to the number of false edges. In\nthis paper, we first reframe the functional covariance model estimation as a\ntuning-free problem of simultaneously testing p(p-1)/2 hypotheses for\ncross-covariance functions, and introduce a novel multiple testing procedure.\nWe then explore the multiple testing procedure under a general\nerror-contamination framework and establish that our procedure can control\nfalse discoveries asymptotically. Additionally, we demonstrate that our\nproposed methods for two concrete examples: the functional covariance model for\ndiscretely observed functional data and, importantly, the more challenging\nfunctional graphical model, can be seamlessly integrated into the general\nerror-contamination framework, and, with verifiable conditions, achieve\ntheoretical guarantees on effective false discovery control. Finally, we\nshowcase the superiority of our proposals through extensive simulations and\nbrain connectivity analysis of two neuroimaging datasets.\n","subjects":["Mathematics/Statistics Theory","Statistics/Methodology","Statistics/Statistics Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"2gJRTNb-ao0c6WmAzTBw5eqDuJ_Iyo2N-RpMP2c-2Tk","pdfSize":"1134369"}