{"id":"2407.14145","title":"PassTSL: Modeling Human-Created Passwords through Two-Stage Learning","authors":"Yangde Wang, Haozhang Li, Weidong Qiu, Shujun Li, Peng Tang","authorsParsed":[["Wang","Yangde",""],["Li","Haozhang",""],["Qiu","Weidong",""],["Li","Shujun",""],["Tang","Peng",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 09:23:30 GMT"}],"updateDate":"2024-07-22","timestamp":1721381010000,"abstract":"  Textual passwords are still the most widely used user authentication\nmechanism. Due to the close connections between textual passwords and natural\nlanguages, advanced technologies in natural language processing (NLP) and\nmachine learning (ML) could be used to model passwords for different purposes\nsuch as studying human password-creation behaviors and developing more advanced\npassword cracking methods for informing better defence mechanisms. In this\npaper, we propose PassTSL (modeling human-created Passwords through Two-Stage\nLearning), inspired by the popular pretraining-finetuning framework in NLP and\ndeep learning (DL). We report how different pretraining settings affected\nPassTSL and proved its effectiveness by applying it to six large leaked\npassword databases. Experimental results showed that it outperforms five\nstate-of-the-art (SOTA) password cracking methods on password guessing by a\nsignificant margin ranging from 4.11% to 64.69% at the maximum point. Based on\nPassTSL, we also implemented a password strength meter (PSM), and our\nexperiments showed that it was able to estimate password strength more\naccurately, causing fewer unsafe errors (overestimating the password strength)\nthan two other SOTA PSMs when they produce the same rate of safe errors\n(underestimating the password strength): a neural-network based method and\nzxcvbn. Furthermore, we explored multiple finetuning settings, and our\nevaluations showed that, even a small amount of additional training data, e.g.,\nonly 0.1% of the pretrained data, can lead to over 3% improvement in password\nguessing on average. We also proposed a heuristic approach to selecting\nfinetuning passwords based on JS (Jensen-Shannon) divergence and experimental\nresults validated its usefulness. In summary, our contributions demonstrate the\npotential and feasibility of applying advanced NLP and ML methods to password\nmodeling and cracking.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"SYB2eQdR8fXToj1Fj9xRsjSziY-MjGio0LRcS70ByWs","pdfSize":"2253576","objectId":"0x4402af87a3731cf29d776e2907cae194c1f8ba4d2fb825189e3a884751e11397","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
