{"id":"2407.05025","title":"ProACT: An Augmented Reality Testbed for Intelligent Prosthetic Arms","authors":"Shivani Guptasarma and Monroe D. Kennedy III","authorsParsed":[["Guptasarma","Shivani",""],["Kennedy","Monroe D.","III"]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 09:39:25 GMT"}],"updateDate":"2024-07-09","timestamp":1720258765000,"abstract":"  Upper-limb amputees face tremendous difficulty in operating dexterous powered\nprostheses. Previous work has shown that aspects of prosthetic hand, wrist, or\nelbow control can be improved through \"intelligent\" control, by combining\nmovement-based or gaze-based intent estimation with low-level robotic autonomy.\nHowever, no such solutions exist for whole-arm control. Moreover, hardware\nplatforms for advanced prosthetic control are expensive, and existing\nsimulation platforms are not well-designed for integration with robotics\nsoftware frameworks. We present the Prosthetic Arm Control Testbed (ProACT), a\nplatform for evaluating intelligent control methods for prosthetic arms in an\nimmersive (Augmented Reality) simulation setting. Using ProACT with non-amputee\nparticipants, we compare performance in a Box-and-Blocks Task using a virtual\nmyoelectric prosthetic arm, with and without intent estimation. Our results\nshow that methods using intent estimation improve both user satisfaction and\nthe degree of success in the task. To the best of our knowledge, this\nconstitutes the first study of semi-autonomous control for complex whole-arm\nprostheses, the first study including sequential task modeling in the context\nof wearable prosthetic arms, and the first testbed of its kind. Towards the\ngoal of supporting future research in intelligent prosthetics, the system is\nbuilt upon on existing open-source frameworks for robotics.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"14xbxcrXhiJzIOPjvoxImBaGhoYq467GgABkbpfPrI8","pdfSize":"34322309"}