{"id":"2407.20724","title":"Exploring Loss Landscapes through the Lens of Spin Glass Theory","authors":"Hao Liao, Wei Zhang, Zhanyi Huang, Zexiao Long, Mingyang Zhou, Xiaoqun\n  Wu, Rui Mao, Chi Ho Yeung","authorsParsed":[["Liao","Hao",""],["Zhang","Wei",""],["Huang","Zhanyi",""],["Long","Zexiao",""],["Zhou","Mingyang",""],["Wu","Xiaoqun",""],["Mao","Rui",""],["Yeung","Chi Ho",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 10:37:15 GMT"},{"version":"v2","created":"Mon, 16 Sep 2024 12:39:33 GMT"}],"updateDate":"2024-09-17","timestamp":1722335835000,"abstract":"  In the past decade, significant strides in deep learning have led to numerous\ngroundbreaking applications. Despite these advancements, the understanding of\nthe high generalizability of deep learning, especially in such an\nover-parametrized space, remains limited. For instance, in deep neural networks\n(DNNs), their internal representations, decision-making mechanism, absence of\noverfitting in an over-parametrized space, superior generalizability, etc.,\nremain less understood. Successful applications are often considered as\nempirical rather than scientific achievement. This paper delves into the loss\nlandscape of DNNs through the lens of spin glass in statistical physics, a\nsystem characterized by a complex energy landscape with numerous metastable\nstates, as a novel perspective in understanding how DNNs work. We investigated\nthe loss landscape of single hidden layer neural networks activated by\nRectified Linear Unit (ReLU) function, and introduced several protocols to\nexamine the analogy between DNNs and spin glass. Specifically, we used (1)\nrandom walk in the parameter space of DNNs to unravel the structures in their\nloss landscape; (2) a permutation-interpolation protocol to study the\nconnection between copies of identical regions in the loss landscape due to the\npermutation symmetry in the hidden layers; (3) hierarchical clustering to\nreveal the hierarchy among trained solutions of DNNs, reminiscent of the\nso-called Replica Symmetry Breaking (RSB) phenomenon (i.e. the Parisi solution)\nin spin glass; (4) finally, we examine the relationship between the ruggedness\nof DNN's loss landscape and its generalizability, showing an improvement of\nflattened minima.\n","subjects":["Condensed Matter/Disordered Systems and Neural Networks","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"oMmro0tcilOHGVM72Eqq6Ay7bl_F_7YL4OP74hjmw6Y","pdfSize":"4834186","objectId":"0xbc1ea94643e0c071067d79d31657c3f49839e821e07ddb07af2175bfe766df41","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
