{"id":"2407.09556","title":"Explainable Image Captioning using CNN- CNN architecture and\n  Hierarchical Attention","authors":"Rishi Kesav Mohan, Sanjay Sureshkumar, Vignesh Sivasubramaniam","authorsParsed":[["Mohan","Rishi Kesav",""],["Sureshkumar","Sanjay",""],["Sivasubramaniam","Vignesh",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 16:27:47 GMT"}],"updateDate":"2024-07-16","timestamp":1719592067000,"abstract":"  Image captioning is a technology that produces text-based descriptions for an\nimage. Deep learning-based solutions built on top of feature recognition may\nvery well serve the purpose. But as with any other machine learning solution,\nthe user understanding in the process of caption generation is poor and the\nmodel does not provide any explanation for its predictions and hence the\nconventional methods are also referred to as Black-Box methods. Thus, an\napproach where the model's predictions are trusted by the user is needed to\nappreciate interoperability. Explainable AI is an approach where a conventional\nmethod is approached in a way that the model or the algorithm's predictions can\nbe explainable and justifiable. Thus, this article tries to approach image\ncaptioning using Explainable AI such that the resulting captions generated by\nthe model can be Explained and visualized. A newer architecture with a CNN\ndecoder and hierarchical attention concept has been used to increase speed and\naccuracy of caption generation. Also, incorporating explainability to a model\nmakes it more trustable when used in an application. The model is trained and\nevaluated using MSCOCO dataset and both quantitative and qualitative results\nare presented in this article.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"1_q3Z8iTGvd6WS56R_h2U0vMhaxGPTreae9B6HmJ9aQ","pdfSize":"2980590","objectId":"0xd45a1b78b17044b6adae85b405b382da30b7b8684db86f0e398c38d1b1ba91c5","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
