{"id":"2407.10173","title":"StatuScale: Status-aware and Elastic Scaling Strategy for Microservice\n  Applications","authors":"Linfeng Wen, Minxian Xu, Sukhpal Singh Gill, Muhammad Hafizhuddin\n  Hilman, Satish Narayana Srirama, Kejiang Ye, Chengzhong Xu","authorsParsed":[["Wen","Linfeng",""],["Xu","Minxian",""],["Gill","Sukhpal Singh",""],["Hilman","Muhammad Hafizhuddin",""],["Srirama","Satish Narayana",""],["Ye","Kejiang",""],["Xu","Chengzhong",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 12:00:20 GMT"}],"updateDate":"2024-07-16","timestamp":1720958420000,"abstract":"  Microservice architecture has transformed traditional monolithic applications\ninto lightweight components. Scaling these lightweight microservices is more\nefficient than scaling servers. However, scaling microservices still faces the\nchallenges resulted from the unexpected spikes or bursts of requests, which are\ndifficult to detect and can degrade performance instantaneously. To address\nthis challenge and ensure the performance of microservice-based applications,\nwe propose a status-aware and elastic scaling framework called StatuScale,\nwhich is based on load status detector that can select appropriate elastic\nscaling strategies for differentiated resource scheduling in vertical scaling.\nAdditionally, StatuScale employs a horizontal scaling controller that utilizes\ncomprehensive evaluation and resource reduction to manage the number of\nreplicas for each microservice. We also present a novel metric named\ncorrelation factor to evaluate the resource usage efficiency. Finally, we use\nKubernetes, an open-source container orchestration and management platform, and\nrealistic traces from Alibaba to validate our approach. The experimental\nresults have demonstrated that the proposed framework can reduce the average\nresponse time in the Sock-Shop application by 8.59% to 12.34%, and in the\nHotel-Reservation application by 7.30% to 11.97%, decrease service level\nobjective violations, and offer better performance in resource usage compared\nto baselines.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"vZ5vG3nMhWae95LNAFukOnjf15nl3sXeIblw-QY0GwQ","pdfSize":"3564584"}