{"id":"2407.00579","title":"Active-RIS-Aided Covert Communications in NOMA-Inspired ISAC Wireless\n  Systems","authors":"Miaomiao Zhu, Pengxu Chen, Liang Yang, Alexandros-Apostolos A.\n  Boulogeorgos, Theodoros A. Tsiftsis, and Hongwu Liu","authorsParsed":[["Zhu","Miaomiao",""],["Chen","Pengxu",""],["Yang","Liang",""],["Boulogeorgos","Alexandros-Apostolos A.",""],["Tsiftsis","Theodoros A.",""],["Liu","Hongwu",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 03:49:21 GMT"}],"updateDate":"2024-07-02","timestamp":1719719361000,"abstract":"  Non-orthogonal multiple access (NOMA)-inspired integrated sensing and\ncommunication (ISAC) facilitates spectrum sharing for radar sensing and NOMA\ncommunications, whereas facing privacy and security challenges due to open\nwireless propagation. In this paper, active reconfigurable intelligent surface\n(RIS) is employed to aid covert communications in NOMA-inspired ISAC wireless\nsystem with the aim of maximizing the covert rate. Specifically, a\ndual-function base-station (BS) transmits the superposition signal to sense\nmultiple targets, while achieving covert and reliable communications for a pair\nof NOMA covert and public users, respectively, in the presence of a warden. Two\nsuperposition transmission schemes, namely, the transmissions with dedicated\nsensing signal (w-DSS) and without dedicated sensing signal (w/o-DSS), are\nrespectively considered in the formulations of the joint transmission and\nreflection beamforming optimization problems. Numerical results demonstrate\nthat active-RIS-aided NOMA-ISAC system outperforms the passive-RIS-aided and\nwithout-RIS counterparts in terms of covert rate and trade-off between covert\ncommunication and sensing performance metrics. Finally, the w/o-DSS scheme,\nwhich omits the dedicated sensing signal, achieves a higher covert rate than\nthe w-DSS scheme by allocating more transmit power for the covert\ntransmissions, while preserving a comparable multi-target sensing performance.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"dpHPsw0vTP2AicvUksuNvgQhgd9D2_P-1UDwvlPmfFA","pdfSize":"1074870"}