{"id":"2407.02713","title":"Advancing Compressed Video Action Recognition through Progressive\n  Knowledge Distillation","authors":"Efstathia Soufleri, Deepak Ravikumar, Kaushik Roy","authorsParsed":[["Soufleri","Efstathia",""],["Ravikumar","Deepak",""],["Roy","Kaushik",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 23:30:01 GMT"}],"updateDate":"2024-07-04","timestamp":1719963001000,"abstract":"  Compressed video action recognition classifies video samples by leveraging\nthe different modalities in compressed videos, namely motion vectors,\nresiduals, and intra-frames. For this purpose, three neural networks are\ndeployed, each dedicated to processing one modality. Our observations indicate\nthat the network processing intra-frames tend to converge to a flatter minimum\nthan the network processing residuals, which in turn converges to a flatter\nminimum than the motion vector network. This hierarchy in convergence motivates\nour strategy for knowledge transfer among modalities to achieve flatter minima,\nwhich are generally associated with better generalization. With this insight,\nwe propose Progressive Knowledge Distillation (PKD), a technique that\nincrementally transfers knowledge across the modalities. This method involves\nattaching early exits (Internal Classifiers - ICs) to the three networks. PKD\ndistills knowledge starting from the motion vector network, followed by the\nresidual, and finally, the intra-frame network, sequentially improving IC\naccuracy. Further, we propose the Weighted Inference with Scaled Ensemble\n(WISE), which combines outputs from the ICs using learned weights, boosting\naccuracy during inference. Our experiments demonstrate the effectiveness of\ntraining the ICs with PKD compared to standard cross-entropy-based training,\nshowing IC accuracy improvements of up to 5.87% and 11.42% on the UCF-101 and\nHMDB-51 datasets, respectively. Additionally, WISE improves accuracy by up to\n4.28% and 9.30% on UCF-101 and HMDB-51, respectively.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"Lsck5Bt71FHGQSgNHmlFcNc8f1viPlD2L4CRGBGWEI8","pdfSize":"2909757"}