{"id":"2407.11224","title":"Distributed Semantic Segmentation with Efficient Joint Source and Task\n  Decoding","authors":"Danish Nazir, Timo Bartels, Jan Piewek, Thorsten Bagdonat and Tim\n  Fingscheidt","authorsParsed":[["Nazir","Danish",""],["Bartels","Timo",""],["Piewek","Jan",""],["Bagdonat","Thorsten",""],["Fingscheidt","Tim",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 20:20:04 GMT"}],"updateDate":"2024-07-17","timestamp":1721074804000,"abstract":"  Distributed computing in the context of deep neural networks (DNNs) implies\nthe execution of one part of the network on edge devices and the other part\ntypically on a large-scale cloud platform. Conventional methods propose to\nemploy a serial concatenation of a learned image and source encoder, the latter\nprojecting the image encoder output (bottleneck features) into a quantized\nrepresentation for bitrate-efficient transmission. In the cloud, a respective\nsource decoder reprojects the quantized representation to the original feature\nrepresentation, serving as an input for the downstream task decoder performing,\ne.g., semantic segmentation. In this work, we propose joint source and task\ndecoding, as it allows for a smaller network size in the cloud. This further\nenables the scalability of such services in large numbers without requiring\nextensive computational load on the cloud per channel. We demonstrate the\neffectiveness of our method by achieving a distributed semantic segmentation\nSOTA over a wide range of bitrates on the mean intersection over union metric,\nwhile using only $9.8 \\%$ ... $11.59 \\%$ of cloud DNN parameters used in the\nprevious SOTA on the COCO and Cityscapes datasets.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"oEIuZ7-J6jm2PzDlnCT9z-XATrg-qZcwMCAW4-KfDe8","pdfSize":"11362914","objectId":"0x180392308cf78e2e968bc85b5a5eaa737700959af456b78635e51325bab2660c","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
