{"id":"2407.15595","title":"Discrete Flow Matching","authors":"Itai Gat, Tal Remez, Neta Shaul, Felix Kreuk, Ricky T. Q. Chen,\n  Gabriel Synnaeve, Yossi Adi, Yaron Lipman","authorsParsed":[["Gat","Itai",""],["Remez","Tal",""],["Shaul","Neta",""],["Kreuk","Felix",""],["Chen","Ricky T. Q.",""],["Synnaeve","Gabriel",""],["Adi","Yossi",""],["Lipman","Yaron",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 12:33:27 GMT"}],"updateDate":"2024-07-23","timestamp":1721651607000,"abstract":"  Despite Flow Matching and diffusion models having emerged as powerful\ngenerative paradigms for continuous variables such as images and videos, their\napplication to high-dimensional discrete data, such as language, is still\nlimited. In this work, we present Discrete Flow Matching, a novel discrete flow\nparadigm designed specifically for generating discrete data. Discrete Flow\nMatching offers several key contributions: (i) it works with a general family\nof probability paths interpolating between source and target distributions;\n(ii) it allows for a generic formula for sampling from these probability paths\nusing learned posteriors such as the probability denoiser ($x$-prediction) and\nnoise-prediction ($\\epsilon$-prediction); (iii) practically, focusing on\nspecific probability paths defined with different schedulers considerably\nimproves generative perplexity compared to previous discrete diffusion and flow\nmodels; and (iv) by scaling Discrete Flow Matching models up to 1.7B\nparameters, we reach 6.7% Pass@1 and 13.4% Pass@10 on HumanEval and 6.7% Pass@1\nand 20.6% Pass@10 on 1-shot MBPP coding benchmarks. Our approach is capable of\ngenerating high-quality discrete data in a non-autoregressive fashion,\nsignificantly closing the gap between autoregressive models and discrete flow\nmodels.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"-m0gaMWEYStFaVvL2BBhrw9vaTkA2CSOJz5ekPjbDKU","pdfSize":"2646916","objectId":"0xbc320ecd2346a0f7d02411e539d46a665ff1a9bbccb13ca3bd7a9772be2abfd3","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
