{"id":"2407.19258","title":"Comprehensive Survey of Complex-Valued Neural Networks: Insights into\n  Backpropagation and Activation Functions","authors":"M. M. Hammad","authorsParsed":[["Hammad","M. M.",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 13:47:16 GMT"}],"updateDate":"2024-07-30","timestamp":1722088036000,"abstract":"  Artificial neural networks (ANNs), particularly those employing deep learning\nmodels, have found widespread application in fields such as computer vision,\nsignal processing, and wireless communications, where complex numbers are\ncrucial. Despite the prevailing use of real-number implementations in current\nANN frameworks, there is a growing interest in developing ANNs that utilize\ncomplex numbers. This paper presents a comprehensive survey of recent\nadvancements in complex-valued neural networks (CVNNs), focusing on their\nactivation functions (AFs) and learning algorithms. We delve into the extension\nof the backpropagation algorithm to the complex domain, which enables the\ntraining of neural networks with complex-valued inputs, weights, AFs, and\noutputs. This survey considers three complex backpropagation algorithms: the\ncomplex derivative approach, the partial derivatives approach, and algorithms\nincorporating the Cauchy-Riemann equations. A significant challenge in CVNN\ndesign is the identification of suitable nonlinear Complex Valued Activation\nFunctions (CVAFs), due to the conflict between boundedness and\ndifferentiability over the entire complex plane as stated by Liouville theorem.\nWe examine both fully complex AFs, which strive for boundedness and\ndifferentiability, and split AFs, which offer a practical compromise despite\nnot preserving analyticity. This review provides an in-depth analysis of\nvarious CVAFs essential for constructing effective CVNNs. Moreover, this survey\nnot only offers a comprehensive overview of the current state of CVNNs but also\ncontributes to ongoing research and development by introducing a new set of\nCVAFs (fully complex, split and complex amplitude-phase AFs).\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Upyr0E2nTD9_5GYW3VWce6HEkgivJvrbHVFTe9KGzic","pdfSize":"5321856"}