{"id":"2407.18535","title":"Improving the ROS 2 Navigation Stack with Real-Time Local Costmap\n  Updates for Agricultural Applications","authors":"Ettore Sani, Antonio Sgorbissa, Stefano Carpin","authorsParsed":[["Sani","Ettore",""],["Sgorbissa","Antonio",""],["Carpin","Stefano",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 06:33:10 GMT"}],"updateDate":"2024-07-29","timestamp":1721975590000,"abstract":"  The ROS 2 Navigation Stack (Nav2) has emerged as a widely used software\ncomponent providing the underlying basis to develop a variety of high-level\nfunctionalities. However, when used in outdoor environments such as orchards\nand vineyards, its functionality is notably limited by the presence of\nobstacles and/or situations not commonly found in indoor settings. One such\nexample is given by tall grass and weeds that can be safely traversed by a\nrobot, but that can be perceived as obstacles by LiDAR sensors, and then force\nthe robot to take longer paths to avoid them, or abort navigation altogether.\nTo overcome these limitations, domain specific extensions must be developed and\nintegrated into the software pipeline. This paper presents a new, lightweight\napproach to address this challenge and improve outdoor robot navigation.\nLeveraging the multi-scale nature of the costmaps supporting Nav2, we developed\na system that using a depth camera performs pixel level classification on the\nimages, and in real time injects corrections into the local cost map, thus\nenabling the robot to traverse areas that would otherwise be avoided by the\nNav2. Our approach has been implemented and validated on a Clearpath Husky and\nwe demonstrate that with this extension the robot is able to perform navigation\ntasks that would be otherwise not practical with the standard components.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"W3VTdgrz0HxLcfNhrojxBziX1-3Q7vzX3dlzwSHZrwA","pdfSize":"1362898","objectId":"0x2bdcbc9cf6d3b8af595754fe3f9321c4e90947f5e32bfd3789414e3db022f824","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
