{"id":"2407.06100","title":"Leveraging data-driven weather models for improving numerical weather\n  prediction skill through large-scale spectral nudging","authors":"Syed Zahid Husain, Leo Separovic, Jean-Fran\\c{c}ois Caron, Rabah\n  Aider, Mark Buehner, St\\'ephane Chamberland, Ervig Lapalme, Ron\n  McTaggart-Cowan, Christopher Subich, Paul A. Vaillancourt, Jing Yang, Ayrton\n  Zadra","authorsParsed":[["Husain","Syed Zahid",""],["Separovic","Leo",""],["Caron","Jean-François",""],["Aider","Rabah",""],["Buehner","Mark",""],["Chamberland","Stéphane",""],["Lapalme","Ervig",""],["McTaggart-Cowan","Ron",""],["Subich","Christopher",""],["Vaillancourt","Paul A.",""],["Yang","Jing",""],["Zadra","Ayrton",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 16:39:25 GMT"},{"version":"v2","created":"Wed, 24 Jul 2024 21:23:38 GMT"}],"updateDate":"2024-07-26","timestamp":1720456765000,"abstract":"  Operational meteorological forecasting has long relied on physics-based\nnumerical weather prediction (NWP) models. Recently, this landscape is facing\ndisruption by the advent of data-driven artificial intelligence (AI)-based\nweather models, which offer tremendous computational performance and\ncompetitive forecasting skill. However, data-driven models for medium-range\nforecasting generally suffer from major limitations, including low effective\nresolution and a narrow range of predicted variables. This study illustrates\nthe relative strengths and weaknesses of these competing paradigms using the\nGEM (Global Environmental Multiscale) and GraphCast models to represent\nphysics-based and AI-based approaches, respectively. By analyzing global\npredictions from these two models against observations and analyses in both\nphysical and spectral spaces, this study demonstrates that GraphCast-predicted\nlarge scales outperform GEM, particularly for longer lead times. Building on\nthis insight, a hybrid NWP-AI system is proposed, wherein GEM-predicted\nlarge-scale state variables are spectrally nudged toward GraphCast predictions,\nwhile allowing GEM to freely generate fine-scale details critical for weather\nextremes. Results indicate that this hybrid approach is capable of leveraging\nthe strengths of GraphCast to enhance the prediction skill of the GEM model.\nImportantly, trajectories of tropical cyclones are predicted with enhanced\naccuracy without significant changes in intensity. Furthermore, this new hybrid\nsystem ensures that meteorologists have access to a complete set of forecast\nvariables, including those relevant for high-impact weather events.\n","subjects":["Physics/Atmospheric and Oceanic Physics","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"T3Xhr0Ous9lcxAtzU2sLvYXHrcrLERWxa_lU7p1VV98","pdfSize":"18407691"}