{"id":"2407.09485","title":"Representation Debiasing of Generated Data Involving Domain Experts","authors":"Aditya Bhattacharya, Simone Stumpf, Katrien Verbert","authorsParsed":[["Bhattacharya","Aditya",""],["Stumpf","Simone",""],["Verbert","Katrien",""]],"versions":[{"version":"v1","created":"Fri, 17 May 2024 07:16:06 GMT"}],"updateDate":"2024-07-16","timestamp":1715930166000,"abstract":"  Biases in Artificial Intelligence (AI) or Machine Learning (ML) systems due\nto skewed datasets problematise the application of prediction models in\npractice. Representation bias is a prevalent form of bias found in the majority\nof datasets. This bias arises when training data inadequately represents\ncertain segments of the data space, resulting in poor generalisation of\nprediction models. Despite AI practitioners employing various methods to\nmitigate representation bias, their effectiveness is often limited due to a\nlack of thorough domain knowledge. To address this limitation, this paper\nintroduces human-in-the-loop interaction approaches for representation\ndebiasing of generated data involving domain experts. Our work advocates for a\ncontrolled data generation process involving domain experts to effectively\nmitigate the effects of representation bias. We argue that domain experts can\nleverage their expertise to assess how representation bias affects prediction\nmodels. Moreover, our interaction approaches can facilitate domain experts in\nsteering data augmentation algorithms to produce debiased augmented data and\nvalidate or refine the generated samples to reduce representation bias. We also\ndiscuss how these approaches can be leveraged for designing and developing\nuser-centred AI systems to mitigate the impact of representation bias through\neffective collaboration between domain experts and AI.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"rdH4eYKBEF794T_ppkNG2UUNCkXynIa5-NHffz46MaE","pdfSize":"1612702","objectId":"0xc76295fd8689d7f5c657c1899c8b8c04fd544f6eef710f0459ac60a86b3d2b7f","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
