{"id":"2407.02673","title":"A Novel Approach to Image EEG Sleep Data for Improving Quality of Life\n  in Patients Suffering From Brain Injuries Using DreamDiffusion","authors":"David Fahim, Joshveer Grewal, Ritvik Ellendula","authorsParsed":[["Fahim","David",""],["Grewal","Joshveer",""],["Ellendula","Ritvik",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 21:26:28 GMT"}],"updateDate":"2024-07-04","timestamp":1719955588000,"abstract":"  Those experiencing strokes, traumatic brain injuries, and drug complications\ncan often end up hospitalized and diagnosed with coma or locked-in syndrome.\nSuch mental impediments can permanently alter the neurological pathways in work\nand significantly decrease the quality of life (QoL). It is critical to\ntranslate brain signals into images to gain a deeper understanding of the\nthoughts of a comatose patient. Traditionally, brain signals collected by an\nEEG could only be translated into text, but with the novel method of an\nopen-source model available on GitHub, DreamDiffusion can be used to convert\nbrain waves into images directly. DreamDiffusion works by extracting features\nfrom EEG signals and then using the features to create images through\nStableDiffusion. Upon this, we made further improvements that could make\nStableDiffusion the forerunner technology in waves to media translation. In our\nstudy, we begin by modifying the existing DreamDiffusion codebase so that it\ndoes not require any prior setup, avoiding any confusing steps needed to run\nthe model from GitHub. For many researchers, the incomplete setup process,\nerrors in the existing code, and a lack of directions made it nearly impossible\nto run, not even considering the model's performance. We brought the code into\nGoogle Colab so users could run and evaluate problems cell-by-cell, eliminating\nthe specific file and repository dependencies. We also provided the original\ntraining data file so users do not need to purchase the necessary computing\npower to train the model from the given dataset. The second change is utilizing\nthe mutability of the code and optimizing the model so it can be used to\ngenerate images from other given inputs, such as sleep data. Additionally, the\naffordability of EEG technology allows for global dissemination and creates the\nopportunity for those who want to work on the shared DreamDiffusion model.\n","subjects":["Quantitative Biology/Neurons and Cognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"zFteekhJKNyUc0pA25I21pvv2S6M3LYZOwbv49rrrZI","pdfSize":"9971364","objectId":"0xc05d57f7b12f25650c8e14494203c7cfa15ff82b69bc94281c298260cec86a89","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
