{"id":"2407.14390","title":"Honest Computing: Achieving demonstrable data lineage and provenance for\n  driving data and process-sensitive policies","authors":"Florian Guitton, Axel Oehmichen, \\'Etienne Boss\\'e, Yike Guo","authorsParsed":[["Guitton","Florian",""],["Oehmichen","Axel",""],["Bossé","Étienne",""],["Guo","Yike",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 15:13:42 GMT"}],"updateDate":"2024-07-22","timestamp":1721402022000,"abstract":"  Data is the foundation of any scientific, industrial or commercial process.\nIts journey typically flows from collection to transport, storage, management\nand processing. While best practices and regulations guide data management and\nprotection, recent events have underscored its vulnerability. Academic research\nand commercial data handling have been marred by scandals, revealing the\nbrittleness of data management. Data, despite its importance, is susceptible to\nundue disclosures, leaks, losses, manipulation, or fabrication. These incidents\noften occur without visibility or accountability, necessitating a systematic\nstructure for safe, honest, and auditable data management. In this paper, we\nintroduce the concept of Honest Computing as the practice and approach that\nemphasizes transparency, integrity, and ethical behaviour within the realm of\ncomputing and technology. It ensures that computer systems and software operate\nhonestly and reliably without hidden agendas, biases, or unethical practices.\nIt enables privacy and confidentiality of data and code by design and by\ndefault. We also introduce a reference framework to achieve demonstrable data\nlineage and provenance, contrasting it with Secure Computing, a related but\ndifferently-orientated form of computing. At its core, Honest Computing\nleverages Trustless Computing, Confidential Computing, Distributed Computing,\nCryptography and AAA security concepts. Honest Computing opens new ways of\ncreating technology-based processes and workflows which permit the migration of\nregulatory frameworks for data protection from principle-based approaches to\nrule-based ones. Addressing use cases in many fields, from AI model protection\nand ethical layering to digital currency formation for finance and banking,\ntrading, and healthcare, this foundational layer approach can help define new\nstandards for appropriate data custody and processing.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"qHdPH6POSygR8mxpejERwCD0y54uIijdV6I4aDuUe_k","pdfSize":"380098","objectId":"0x37f5726f5830882e16bdf26f86d3c03ac028fc3ba639281df17e42d17c1fccf7","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
