{"id":"2407.15716","title":"CrashEventLLM: Predicting System Crashes with Large Language Models","authors":"Priyanka Mudgal, Bijan Arbab, Swaathi Sampath Kumar","authorsParsed":[["Mudgal","Priyanka",""],["Arbab","Bijan",""],["Kumar","Swaathi Sampath",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 15:22:07 GMT"},{"version":"v2","created":"Sun, 28 Jul 2024 09:07:20 GMT"}],"updateDate":"2024-07-30","timestamp":1721661727000,"abstract":"  As the dependence on computer systems expands across various domains,\nfocusing on personal, industrial, and large-scale applications, there arises a\ncompelling need to enhance their reliability to sustain business operations\nseamlessly and ensure optimal user satisfaction. System logs generated by these\ndevices serve as valuable repositories of historical trends and past failures.\nThe use of machine learning techniques for failure prediction has become\ncommonplace, enabling the extraction of insights from past data to anticipate\nfuture behavior patterns. Recently, large language models have demonstrated\nremarkable capabilities in tasks including summarization, reasoning, and event\nprediction. Therefore, in this paper, we endeavor to investigate the potential\nof large language models in predicting system failures, leveraging insights\nlearned from past failure behavior to inform reasoning and decision-making\nprocesses effectively. Our approach involves leveraging data from the Intel\nComputing Improvement Program (ICIP) system crash logs to identify significant\nevents and develop CrashEventLLM. This model, built upon a large language model\nframework, serves as our foundation for crash event prediction. Specifically,\nour model utilizes historical data to forecast future crash events, informed by\nexpert annotations. Additionally, it goes beyond mere prediction, offering\ninsights into potential causes for each crash event. This work provides the\npreliminary insights into prompt-based large language models for the log-based\nevent prediction task.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"h_HR9UJ9YRvnJBjRTKxlUogbMkhJGuMJnME21sMch8M","pdfSize":"1258952"}