{"id":"2407.05341","title":"The Switch, the Ladder, and the Matrix: Models for Classifying AI\n  Systems","authors":"Jakob Mokander and Margi Sheth and David Watson and Luciano Floridi","authorsParsed":[["Mokander","Jakob",""],["Sheth","Margi",""],["Watson","David",""],["Floridi","Luciano",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 12:16:01 GMT"}],"updateDate":"2024-07-09","timestamp":1720354561000,"abstract":"  Organisations that design and deploy artificial intelligence (AI) systems\nincreasingly commit themselves to high-level, ethical principles. However,\nthere still exists a gap between principles and practices in AI ethics. One\nmajor obstacle organisations face when attempting to operationalise AI Ethics\nis the lack of a well-defined material scope. Put differently, the question to\nwhich systems and processes AI ethics principles ought to apply remains\nunanswered. Of course, there exists no universally accepted definition of AI,\nand different systems pose different ethical challenges. Nevertheless,\npragmatic problem-solving demands that things should be sorted so that their\ngrouping will promote successful actions for some specific end. In this\narticle, we review and compare previous attempts to classify AI systems for the\npurpose of implementing AI governance in practice. We find that attempts to\nclassify AI systems found in previous literature use one of three mental model.\nThe Switch, i.e., a binary approach according to which systems either are or\nare not considered AI systems depending on their characteristics. The Ladder,\ni.e., a risk-based approach that classifies systems according to the ethical\nrisks they pose. And the Matrix, i.e., a multi-dimensional classification of\nsystems that take various aspects into account, such as context, data input,\nand decision-model. Each of these models for classifying AI systems comes with\nits own set of strengths and weaknesses. By conceptualising different ways of\nclassifying AI systems into simple mental models, we hope to provide\norganisations that design, deploy, or regulate AI systems with the conceptual\ntools needed to operationalise AI governance in practice.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"NiVssgIwEkMymoV_Nc7stcIKF8fPGxxufrjT2Y1bRkQ","pdfSize":"525286"}