{"id":"2407.10869","title":"Hidden Markov models with an unknown number of states and a repulsive\n  prior on the state parameters","authors":"Ioannis Rotous, Alex Diana, Alessio Farcomeni, Eleni Matechou,\n  Andr\\'ea Thiebault","authorsParsed":[["Rotous","Ioannis",""],["Diana","Alex",""],["Farcomeni","Alessio",""],["Matechou","Eleni",""],["Thiebault","Andréa",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 16:18:06 GMT"},{"version":"v2","created":"Thu, 18 Jul 2024 15:33:48 GMT"}],"updateDate":"2024-07-19","timestamp":1721060286000,"abstract":"  Hidden Markov models (HMMs) offer a robust and efficient framework for\nanalyzing time series data, modelling both the underlying latent state\nprogression over time and the observation process, conditional on the latent\nstate. However, a critical challenge lies in determining the appropriate number\nof underlying states, often unknown in practice. In this paper, we employ a\nBayesian framework, treating the number of states as a random variable and\nemploying reversible jump Markov chain Monte Carlo to sample from the posterior\ndistributions of all parameters, including the number of states. Additionally,\nwe introduce repulsive priors for the state parameters in HMMs, and hence avoid\noverfitting issues and promote parsimonious models with dissimilar state\ncomponents. We perform an extensive simulation study comparing performance of\nmodels with independent and repulsive prior distributions on the state\nparameters, and demonstrate our proposed framework on two ecological case\nstudies: GPS tracking data on muskox in Antarctica and acoustic data on Cape\ngannets in South Africa. Our results highlight how our framework effectively\nexplores the model space, defined by models with different latent state\ndimensions, while leading to latent states that are distinguished better and\nhence are more interpretable, enabling better understanding of complex dynamic\nsystems.\n","subjects":["Statistics/Applications","Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"QWgK5jO2gDFqUfdI33p_Pwyrns1t1lhQvwn4tenel1o","pdfSize":"3436048"}