{"id":"2407.12966","title":"Nanophotonic-Enhanced Thermal Circular Dichroism for Chiral Sensing","authors":"Ershad Mohammadi, Giulia Tagliabue","authorsParsed":[["Mohammadi","Ershad",""],["Tagliabue","Giulia",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 19:14:56 GMT"}],"updateDate":"2024-07-19","timestamp":1721243696000,"abstract":"  Circular Dichroism (CD) can distinguish the handedness of chiral molecules.\nHowever, it is typically very weak due to vanishing absorption at low molecular\nconcentrations. Here, we suggest Thermal Circular Dichroism (TCD) for chiral\ndetection, leveraging the temperature difference in the chiral sample when\nsubjected to right and left-circularly polarized excitations. The TCD combines\nthe enantiospecificity of circular dichroism with the higher sensitivity of\nthermal measurements, while introducing new opportunities in the thermal domain\nthat can be synergistically combined with optical approaches. We propose a\ntheoretical framework to understand the TCD of individual and arrays of\nresonators covered by chiral molecules. To enhance the weak TCD of chiral\nsamples, we first use individual dielectric Mie resonators and identify\nchirality transfer and self-heating as the underlying mechanisms giving rise to\nthe differential temperature. However, inherent limitations imposed by the\nmaterials and geometries of such resonators make it challenging to surpass a\ncertain level in enhancements. To overcome this, we suggest nonlocal thermal\nand electromagnetic interactions in arrays. We predict that a combination of\nchirality transfer to Mie resonators, collective thermal effects, and optical\nlattice resonance could, in principle, offer more than 4 orders of magnitude\nenhancement in TCD. Our thermonanophotonic-based approach thus establishes key\nconcepts for ultrasensitive chiral detection.\n","subjects":["Physics/Optics","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"dAWf_DfpFREtDQzW0HraPLU5glfFRMY8PZnm5uRKQmo","pdfSize":"3728291"}