{"id":"2407.14564","title":"APS-USCT: Ultrasound Computed Tomography on Sparse Data via AI-Physic\n  Synergy","authors":"Yi Sheng, Hanchen Wang, Yipei Liu, Junhuan Yang, Weiwen Jiang, Youzuo\n  Lin, and Lei Yang","authorsParsed":[["Sheng","Yi",""],["Wang","Hanchen",""],["Liu","Yipei",""],["Yang","Junhuan",""],["Jiang","Weiwen",""],["Lin","Youzuo",""],["Yang","Lei",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 20:30:41 GMT"}],"updateDate":"2024-07-23","timestamp":1721334641000,"abstract":"  Ultrasound computed tomography (USCT) is a promising technique that achieves\nsuperior medical imaging reconstruction resolution by fully leveraging waveform\ninformation, outperforming conventional ultrasound methods. Despite its\nadvantages, high-quality USCT reconstruction relies on extensive data\nacquisition by a large number of transducers, leading to increased costs,\ncomputational demands, extended patient scanning times, and manufacturing\ncomplexities. To mitigate these issues, we propose a new USCT method called\nAPS-USCT, which facilitates imaging with sparse data, substantially reducing\ndependence on high-cost dense data acquisition. Our APS-USCT method consists of\ntwo primary components: APS-wave and APS-FWI. The APS-wave component, an\nencoder-decoder system, preprocesses the waveform data, converting sparse data\ninto dense waveforms to augment sample density prior to reconstruction. The\nAPS-FWI component, utilizing the InversionNet, directly reconstructs the speed\nof sound (SOS) from the ultrasound waveform data. We further improve the\nmodel's performance by incorporating Squeeze-and-Excitation (SE) Blocks and\nsource encoding techniques. Testing our method on a breast cancer dataset\nyielded promising results. It demonstrated outstanding performance with an\naverage Structural Similarity Index (SSIM) of 0.8431. Notably, over 82% of\nsamples achieved an SSIM above 0.8, with nearly 61% exceeding 0.85,\nhighlighting the significant potential of our approach in improving USCT image\nreconstruction by efficiently utilizing sparse data.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"c3elB-cndKR8bPAhlCaD6bt1Gy9yiLJUzL7IvQGbQPk","pdfSize":"793413"}