{"id":"2407.08844","title":"Parameter Estimation and Identifiability in Kinetic Flux Profiling\n  Models of Metabolism","authors":"Breanna Guppy, Colleen Mitchell, Eric Taylor","authorsParsed":[["Guppy","Breanna",""],["Mitchell","Colleen",""],["Taylor","Eric",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 20:02:30 GMT"}],"updateDate":"2024-07-15","timestamp":1720728150000,"abstract":"  Metabolic fluxes are the rates of life-sustaining chemical reactions within a\ncell and metabolites are the components. Determining the changes in these\nfluxes is crucial to understanding diseases with metabolic causes and\nconsequences. Kinetic flux profiling (KFP) is a method for estimating flux that\nutilizes data from isotope tracing experiments. In these experiments, the\nisotope-labeled nutrient is metabolized through a pathway and integrated into\nthe downstream metabolite pools. Measurements of proportion labeled for each\nmetabolite in the pathway are taken at multiple time points and used to fit an\nordinary differential equations model with fluxes as parameters. We begin by\ngeneralizing the process of converting diagrams of metabolic pathways into\nmathematical models composed of differential equations and algebraic\nconstraints. The scaled differential equations for proportions of unlabeled\nmetabolite contain parameters related to the metabolic fluxes in the pathway.\nWe investigate flux parameter identifiability given data collected only at the\nsteady state of the differential equation. Next, we give criteria for valid\nparameter estimations in the case of a large separation of timescales with\nfast-slow analysis. Bayesian parameter estimation on simulated data from KFP\nexperiments containing both irreversible and reversible reactions illustrates\nthe accuracy and reliability of flux estimations. These analyses provide\nconstraints that serve as guidelines for the design of KFP experiments to\nestimate metabolic fluxes.\n","subjects":["Mathematics/Dynamical Systems","Quantitative Biology/Quantitative Methods"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"pFz0y8BLfkqFwdweb3KVSLqP9K6CINnXHbND0aqY9LE","pdfSize":"1862755"}