{"id":"2407.20861","title":"What are the Pillars of Reionization? Revising the AGN Luminosity\n  Function at z~5","authors":"Andrea Grazian, Emanuele Giallongo, Konstantina Boutsia, Stefano\n  Cristiani, Fabio Fontanot, Manuela Bischetti, Laura Bisigello, Angela\n  Bongiorno, Giorgio Calderone, Francesco Chiti Tegli, Guido Cupani, Gabriella\n  De Lucia, Valentina D'Odorico, Chiara Feruglio, Fabrizio Fiore, Giovanni\n  Gandolfi, Giorgia Girardi, Francesco Guarneri, Michaela Hirschmann, Matteo\n  Porru, Giulia Rodighiero, Ivano Saccheo, Matteo Simioni, Andrea Trost, Akke\n  Viitanen","authorsParsed":[["Grazian","Andrea",""],["Giallongo","Emanuele",""],["Boutsia","Konstantina",""],["Cristiani","Stefano",""],["Fontanot","Fabio",""],["Bischetti","Manuela",""],["Bisigello","Laura",""],["Bongiorno","Angela",""],["Calderone","Giorgio",""],["Tegli","Francesco Chiti",""],["Cupani","Guido",""],["De Lucia","Gabriella",""],["D'Odorico","Valentina",""],["Feruglio","Chiara",""],["Fiore","Fabrizio",""],["Gandolfi","Giovanni",""],["Girardi","Giorgia",""],["Guarneri","Francesco",""],["Hirschmann","Michaela",""],["Porru","Matteo",""],["Rodighiero","Giulia",""],["Saccheo","Ivano",""],["Simioni","Matteo",""],["Trost","Andrea",""],["Viitanen","Akke",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 14:35:33 GMT"}],"updateDate":"2024-07-31","timestamp":1722350133000,"abstract":"  In the past, high-z AGNs were given a minor role as possible drivers of\nreionization, despite initial evidences in favor of their large space densities\nat low luminosities by Chandra and HST. Recent observations from JWST are\nfinding relatively large numbers of faint AGNs at z>4, convincingly confirming\nthese early results. We present a sample of z~5 AGNs (both from wide, shallow\nground-based surveys and from deep, pencil-beam observations from JWST),\nallowing to estimate their space densities with unprecedented accuracy. The\nbright end (M1450<-26) of the z~5 AGN luminosity function is well constrained,\nwith a rather steep slope. The faint end (M1450>-22) indicates a high space\ndensity, the scatter is significant and the knee (M1450~-24) is mostly\nundetermined. Comparisons with state-of-the-art models find reasonable\nagreement with the observed AGN luminosity function at z=5, while the predicted\nspace density evolution at higher redshifts appears to be too fast with respect\nto observational constraints. Given the large variance at the faint end, we\nconsider different options in fitting the luminosity functions and deriving the\nionizing emissivity. Even in the most conservative scenario, the\nphoto-ionization rate produced by z~5 AGNs is consistent with the UV background\nmeasurements. A slow evolution of the space density of faint AGNs is observed,\nindicating that active SMBHs are probably producing large amounts of ionizing\nphotons at z>6, well into the epoch of reionization. This is an important\nindication that high-z AGNs could be the major contributors to the reionization\nof the Universe.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"yY3qBkcqHtucZ1UCIVLMMLT47Vyqag7m57ldQaSufQ0","pdfSize":"826588"}