{"id":"2407.02291","title":"Multiwavelength Study of on-disk Coronal Hole Jets with IRIS and SDO\n  observations","authors":"Myrto Koletti, Costis Gontikakis, Spiros Patsourakos and Kanaris\n  Tsinganos","authorsParsed":[["Koletti","Myrto",""],["Gontikakis","Costis",""],["Patsourakos","Spiros",""],["Tsinganos","Kanaris",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 14:26:53 GMT"},{"version":"v2","created":"Sat, 20 Jul 2024 10:46:38 GMT"}],"updateDate":"2024-07-23","timestamp":1719930413000,"abstract":"  Solar jets are an important field of study, as they may contribute to the\nmass and energy transfer from the lower to the upper atmosphere. We use the\nInterface Region Imaging Spectrograph (IRIS) and Solar Dynamic Observatory\n(SDO) observations to study two small-scale jets originating in the same\non-disk coronal hole observed in October 2013. We combine dopplergrams,\nintensity maps, and line width maps derived from IRIS Si IV 1393.755{\\AA}\nspectra along with images from the Atmospheric Imaging Assembly (AIA) on SDO to\ndescribe the dynamics of the jets. Images from AIA, with the use of the\nemission measure loci technique and rectangular differential emission measure\n(DEM) distributions, provide estimations of the plasma temperatures. We used\nthe O \\textsc{IV} 1399.77 \\AA, 1401.16~\\AA\\ spectral lines from IRIS to derive\nelectron densities. For jet 1, the SDO images show a small mini-filament 2\nminutes before the jet eruption, while jet 2 originates at a pre-existing\ncoronal bright point. The analysis of asymmetric spectral profiles of the Si\n\\textsc{IV} 1393.755~\\AA\\ and 1402.770~\\AA\\ lines reveals the existence of two\nspectral components with inversely dependant 1393.755~\\AA/1402.770~\\AA\\ ratios\nat both regions. One of the components can be related to the background plasma\nemission originating outside the jet, while the secondary component represents\nhigher-energy plasma flows associated with the jets. Both jets exhibit high\ndensities of the order of 10$^{11}$ cm$^{-3}$ at their base and 10$^{10}$\ncm$^{-3}$ at the spire, respectively, as well as similar average nonthermal\nvelocities of $\\sim$ 50-60 km/s. However, the two jets show differences in\ntheir length, duration, and plane-of-sky velocity. Finally, the DEM analysis\nreveals that both jets exhibit multithermal distributions.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"tRwFY_51tqZhrS5-aEEHezF1Ui0wRcPJS0LFSQ4bbSE","pdfSize":"2791826"}