{"id":"2407.02281","title":"Linearization of optimal rates for independent zero-error source and\n  channel problems","authors":"Nicolas Charpenay, Ma\\\"el Le Treust, Aline Roumy","authorsParsed":[["Charpenay","Nicolas",""],["Treust","Maël Le",""],["Roumy","Aline",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 14:11:58 GMT"}],"updateDate":"2024-07-03","timestamp":1719929518000,"abstract":"  Zero-error coding encompasses a variety of source and channel problems where\nthe probability of error must be exactly zero. The zero-error constraint\ndiffers from the vanishing-error constraint, the latter only requires the\nprobability of error to go to zero when the block length of the code goes to\ninfinity. Here, many problems change from a statistical nature to a\ncombinatorial one, which is tied to the encoder's lack of knowledge about what\nis observed by the decoder. In this paper, we investigate two unsolved\nzero-error problems: the source coding with side information and the channel\ncoding. We focus our attention on families of independent problems for which\nthe distribution decomposes into a product of distributions, corresponding to\nsolved zero-error problems. A crucial step is the linearization property of the\noptimal rate, which does not always hold in the zero-error regime, unlike in\nthe vanishing error regime. By generalizing recent results of Wigderson and\nZuiddam, and of Schrijver, we derive a condition under which the linearization\nproperties of the complementary graph entropy H and of the zero-error capacity\nC0 for the AND product of graph and for the disjoint union of graphs are all\nequivalent. This provides new single-letter characterization of H and C0, for\nexample when the graph is a product of perfect graphs, which is not perfect in\ngeneral, and for the class of graphs obtain by the product of a perfect graph G\nwith the pentagon graph C5. By building on Haemers result, we also show that\nthe linearization of the complementary graph entropy does not hold for the\nproduct of the Schl\\\"afli graph with its complementary graph.\n","subjects":["Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"AP8wNORKQcnvp-1kb89J0qJXCn2l7ZxyFydmoUmd2M4","pdfSize":"425375"}