{"id":"2407.12803","title":"Bosch Street Dataset: A Multi-Modal Dataset with Imaging Radar for\n  Automated Driving","authors":"Karim Armanious, Maurice Quach, Michael Ulrich, Timo Winterling,\n  Johannes Friesen, Sascha Braun, Daniel Jenet, Yuri Feldman, Eitan Kosman,\n  Philipp Rapp, Volker Fischer, Marc Sons, Lukas Kohns, Daniel Eckstein,\n  Daniela Egbert, Simone Letsch, Corinna Voege, Felix Huttner, Alexander\n  Bartler, Robert Maiwald, Yancong Lin, Ulf R\\\"uegg, Claudius Gl\\\"aser, Bastian\n  Bischoff, Jascha Freess, Karsten Haug, Kathrin Klee, and Holger Caesar","authorsParsed":[["Armanious","Karim",""],["Quach","Maurice",""],["Ulrich","Michael",""],["Winterling","Timo",""],["Friesen","Johannes",""],["Braun","Sascha",""],["Jenet","Daniel",""],["Feldman","Yuri",""],["Kosman","Eitan",""],["Rapp","Philipp",""],["Fischer","Volker",""],["Sons","Marc",""],["Kohns","Lukas",""],["Eckstein","Daniel",""],["Egbert","Daniela",""],["Letsch","Simone",""],["Voege","Corinna",""],["Huttner","Felix",""],["Bartler","Alexander",""],["Maiwald","Robert",""],["Lin","Yancong",""],["Rüegg","Ulf",""],["Gläser","Claudius",""],["Bischoff","Bastian",""],["Freess","Jascha",""],["Haug","Karsten",""],["Klee","Kathrin",""],["Caesar","Holger",""]],"versions":[{"version":"v1","created":"Mon, 24 Jun 2024 14:40:56 GMT"}],"updateDate":"2024-07-19","timestamp":1719240056000,"abstract":"  This paper introduces the Bosch street dataset (BSD), a novel multi-modal\nlarge-scale dataset aimed at promoting highly automated driving (HAD) and\nadvanced driver-assistance systems (ADAS) research. Unlike existing datasets,\nBSD offers a unique integration of high-resolution imaging radar, lidar, and\ncamera sensors, providing unprecedented 360-degree coverage to bridge the\ncurrent gap in high-resolution radar data availability. Spanning urban, rural,\nand highway environments, BSD enables detailed exploration into radar-based\nobject detection and sensor fusion techniques. The dataset is aimed at\nfacilitating academic and research collaborations between Bosch and current and\nfuture partners. This aims to foster joint efforts in developing cutting-edge\nHAD and ADAS technologies. The paper describes the dataset's key attributes,\nincluding its scalability, radar resolution, and labeling methodology. Key\nofferings also include initial benchmarks for sensor modalities and a\ndevelopment kit tailored for extensive data analysis and performance\nevaluation, underscoring our commitment to contributing valuable resources to\nthe HAD and ADAS research community.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"u_zTHZz2T7ziQVhkaMQAD69qtmD6dNAnef445nP-CZA","pdfSize":"2286467"}