{"id":"2407.15004","title":"Incorporating lane-change prediction into energy-efficient speed control\n  of connected autonomous vehicles at intersections","authors":"Maziar Zamanpour, Suiyi He, Michael W. Levin and Zongxuan Sun","authorsParsed":[["Zamanpour","Maziar",""],["He","Suiyi",""],["Levin","Michael W.",""],["Sun","Zongxuan",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 23:17:10 GMT"}],"updateDate":"2024-07-23","timestamp":1721517430000,"abstract":"  Connected and autonomous vehicles (CAVs) possess the capability of perception\nand information broadcasting with other CAVs and connected intersections.\nAdditionally, they exhibit computational abilities and can be controlled\nstrategically, offering energy benefits. One potential control strategy is\nreal-time speed control, which adjusts the vehicle speed by taking advantage of\nbroadcasted traffic information, such as signal timings. However, the optimal\ncontrol is likely to increase the gap in front of the controlled CAV, which\ninduces lane changing by other drivers. This study proposes a modified traffic\nflow model that aims to predict lane-changing occurrences and assess the impact\nof lane changes on future traffic states. The primary objective is to improve\nenergy efficiency. The prediction model is based on a cell division platform\nand is derived considering the additional flow during lane changing. An optimal\ncontrol strategy is then developed, subject to the predicted trajectory\ngenerated for the preceding vehicle. Lane change prediction estimates future\nspeed and gap of vehicles, based on predicted traffic states. The proposed\nframework outperforms the non-lane change traffic model, resulting in up to 13%\nenergy savings when lane changing is predicted 4-6 seconds in advance.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"h-ozLaW-3bb2_OWNn8FyFhxggsSfn5tKCfcvjG8HABM","pdfSize":"1706401"}