{"id":"2407.12851","title":"ISPO: An Integrated Ontology of Symptom Phenotypes for Semantic\n  Integration of Traditional Chinese Medical Data","authors":"Zixin Shu, Rui Hua, Dengying Yan, Chenxia Lu, Ning Xu, Jun Li, Hui\n  Zhu, Jia Zhang, Dan Zhao, Chenyang Hui, Junqiu Ye, Chu Liao, Qi Hao, Wen Ye,\n  Cheng Luo, Xinyan Wang, Chuang Cheng, Xiaodong Li, Baoyan Liu, Xiaji Zhou,\n  Runshun Zhang, Min Xu, Xuezhong Zhou","authorsParsed":[["Shu","Zixin",""],["Hua","Rui",""],["Yan","Dengying",""],["Lu","Chenxia",""],["Xu","Ning",""],["Li","Jun",""],["Zhu","Hui",""],["Zhang","Jia",""],["Zhao","Dan",""],["Hui","Chenyang",""],["Ye","Junqiu",""],["Liao","Chu",""],["Hao","Qi",""],["Ye","Wen",""],["Luo","Cheng",""],["Wang","Xinyan",""],["Cheng","Chuang",""],["Li","Xiaodong",""],["Liu","Baoyan",""],["Zhou","Xiaji",""],["Zhang","Runshun",""],["Xu","Min",""],["Zhou","Xuezhong",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 15:23:50 GMT"}],"updateDate":"2024-07-19","timestamp":1720452230000,"abstract":"  Symptom phenotypes are one of the key types of manifestations for diagnosis\nand treatment of various disease conditions. However, the diversity of symptom\nterminologies is one of the major obstacles hindering the analysis and\nknowledge sharing of various types of symptom-related medical data particularly\nin the fields of Traditional Chinese Medicine (TCM). Objective: This study\naimed to construct an Integrated Ontology of symptom phenotypes (ISPO) to\nsupport the data mining of Chinese EMRs and real-world study in TCM field.\nMethods: To construct an integrated ontology of symptom phenotypes (ISPO), we\nmanually annotated classical TCM textbooks and large-scale Chinese electronic\nmedical records (EMRs) to collect symptom terms with support from a medical\ntext annotation system. Furthermore, to facilitate the semantic\ninteroperability between different terminologies, we incorporated public\navailable biomedical vocabularies by manual mapping between Chinese terms and\nEnglish terms with cross-references to source vocabularies. In addition, we\nevaluated the ISPO using independent clinical EMRs to provide a high-usable\nmedical ontology for clinical data analysis. Results: By integrating 78,696\ninpatient cases of EMRs, 5 biomedical vocabularies, 21 TCM books and\ndictionaries, ISPO provides 3,147 concepts, 23,475 terms, and 55,552 definition\nor contextual texts. Adhering to the taxonomical structure of the related\nanatomical systems of symptom phenotypes, ISPO provides 12 top-level categories\nand 79 middle-level sub-categories. The validation of data analysis showed the\nISPO has a coverage rate of 95.35%, 98.53% and 92.66% for symptom terms with\noccurrence rates of 0.5% in additional three independent curated clinical\ndatasets, which can demonstrate the significant value of ISPO in mapping\nclinical terms to ontologies.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"G5QvUBfFSC04fRO0BMJR4229J5fhuOnTcaIsq-R6-i8","pdfSize":"2065499"}