{"id":"2407.00929","title":"High-sensitivity multichannel zero-to-ultralow field NMR with atomic\n  magnetometer arrays","authors":"Blake Andrews, Matthew Lai, Zhen Wang, Norihisa Kato, Michael Tayler,\n  Emanuel Druga, and Ashok Ajoy","authorsParsed":[["Andrews","Blake",""],["Lai","Matthew",""],["Wang","Zhen",""],["Kato","Norihisa",""],["Tayler","Michael",""],["Druga","Emanuel",""],["Ajoy","Ashok",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 03:18:50 GMT"}],"updateDate":"2024-07-02","timestamp":1719803930000,"abstract":"  Despite its versatility and high chemical specificity, conventional NMR\nspectroscopy is limited in measurement throughput due to the need for\nhigh-homogeneity magnetic fields, necessitating sequential sample analysis, and\nbulky devices. Here, we propose a multichannel NMR device that overcomes these\nlimitations that leverages the zero-to-ultralow field (ZULF) regime, where\nsimultaneous detection of multiple samples is carried out via an array of\ncompact optically pumped magnetometers (OPMs). A magnetic field is used only\nfor pre-polarization, permitting the use of large-bore, high-field,\ninhomogeneous magnets that can accommodate many samples concurrently. Through\nsystematic advances, we demonstrate high-sensitivity, high resolution ZULF NMR\nspectroscopy with sensitivity comparable to benchtop NMR systems. The\nspectroscopy remains robust without the need for field shimming for periods on\nthe order of weeks. We show the detection of ZULF NMR signals from organic\nmolecules without isotopic enrichment, and demonstrate the parallelized\ndetection of three distinct samples simultaneously as a proof-of-concept, with\nthe potential to scale further to over 100 channels at a cost comparable to\nhigh-resolution liquid state NMR systems. This work sets the stage for using\nmultichannel \"NMR camera\" devices for inline reaction monitoring, robotic\nchemistry, quality control, and high-throughput assays.\n","subjects":["Physics/Instrumentation and Detectors","Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ekNKsOywUScVJ-mtGopqh_I1MfEJrNMjdLWRuuIhvLQ","pdfSize":"18263517"}