{"id":"2407.17816","title":"NC-NCD: Novel Class Discovery for Node Classification","authors":"Yue Hou, Xueyuan Chen, He Zhu, Romei Liu, Bowen Shi, Jiaheng Liu,\n  Junran Wu, Ke Xu","authorsParsed":[["Hou","Yue",""],["Chen","Xueyuan",""],["Zhu","He",""],["Liu","Romei",""],["Shi","Bowen",""],["Liu","Jiaheng",""],["Wu","Junran",""],["Xu","Ke",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 07:10:08 GMT"}],"updateDate":"2024-07-26","timestamp":1721891408000,"abstract":"  Novel Class Discovery (NCD) involves identifying new categories within\nunlabeled data by utilizing knowledge acquired from previously established\ncategories. However, existing NCD methods often struggle to maintain a balance\nbetween the performance of old and new categories. Discovering unlabeled new\ncategories in a class-incremental way is more practical but also more\nchallenging, as it is frequently hindered by either catastrophic forgetting of\nold categories or an inability to learn new ones. Furthermore, the\nimplementation of NCD on continuously scalable graph-structured data remains an\nunder-explored area. In response to these challenges, we introduce for the\nfirst time a more practical NCD scenario for node classification (i.e.,\nNC-NCD), and propose a novel self-training framework with prototype replay and\ndistillation called SWORD, adopted to our NC-NCD setting. Our approach enables\nthe model to cluster unlabeled new category nodes after learning labeled nodes\nwhile preserving performance on old categories without reliance on old category\nnodes. SWORD achieves this by employing a self-training strategy to learn new\ncategories and preventing the forgetting of old categories through the joint\nuse of feature prototypes and knowledge distillation. Extensive experiments on\nfour common benchmarks demonstrate the superiority of SWORD over other\nstate-of-the-art methods.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"9QQNq2BuWPOoeO7HzCL8yIuNtKIvHwZMXrvH3543Rmk","pdfSize":"7648278"}