{"id":"2407.10336","title":"Thyroidiomics: An Automated Pipeline for Segmentation and Classification\n  of Thyroid Pathologies from Scintigraphy Images","authors":"Maziar Sabouri, Shadab Ahamed, Azin Asadzadeh, Atlas Haddadi Avval,\n  Soroush Bagheri, Mohsen Arabi, Seyed Rasoul Zakavi, Emran Askari, Ali\n  Rasouli, Atena Aghaee, Mohaddese Sehati, Fereshteh Yousefirizi, Carlos Uribe,\n  Ghasem Hajianfar, Habib Zaidi, Arman Rahmim","authorsParsed":[["Sabouri","Maziar",""],["Ahamed","Shadab",""],["Asadzadeh","Azin",""],["Avval","Atlas Haddadi",""],["Bagheri","Soroush",""],["Arabi","Mohsen",""],["Zakavi","Seyed Rasoul",""],["Askari","Emran",""],["Rasouli","Ali",""],["Aghaee","Atena",""],["Sehati","Mohaddese",""],["Yousefirizi","Fereshteh",""],["Uribe","Carlos",""],["Hajianfar","Ghasem",""],["Zaidi","Habib",""],["Rahmim","Arman",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 21:29:28 GMT"},{"version":"v2","created":"Mon, 22 Jul 2024 19:39:07 GMT"}],"updateDate":"2024-07-24","timestamp":1720992568000,"abstract":"  The objective of this study was to develop an automated pipeline that\nenhances thyroid disease classification using thyroid scintigraphy images,\naiming to decrease assessment time and increase diagnostic accuracy. Anterior\nthyroid scintigraphy images from 2,643 patients were collected and categorized\ninto diffuse goiter (DG), multinodal goiter (MNG), and thyroiditis (TH) based\non clinical reports, and then segmented by an expert. A ResUNet model was\ntrained to perform auto-segmentation. Radiomic features were extracted from\nboth physician (scenario 1) and ResUNet segmentations (scenario 2), followed by\nomitting highly correlated features using Spearman's correlation, and feature\nselection using Recursive Feature Elimination (RFE) with XGBoost as the core.\nAll models were trained under leave-one-center-out cross-validation (LOCOCV)\nscheme, where nine instances of algorithms were iteratively trained and\nvalidated on data from eight centers and tested on the ninth for both scenarios\nseparately. Segmentation performance was assessed using the Dice similarity\ncoefficient (DSC), while classification performance was assessed using metrics,\nsuch as precision, recall, F1-score, accuracy, area under the Receiver\nOperating Characteristic (ROC AUC), and area under the precision-recall curve\n(PRC AUC). ResUNet achieved DSC values of 0.84$\\pm$0.03, 0.71$\\pm$0.06, and\n0.86$\\pm$0.02 for MNG, TH, and DG, respectively. Classification in scenario 1\nachieved an accuracy of 0.76$\\pm$0.04 and a ROC AUC of 0.92$\\pm$0.02 while in\nscenario 2, classification yielded an accuracy of 0.74$\\pm$0.05 and a ROC AUC\nof 0.90$\\pm$0.02. The automated pipeline demonstrated comparable performance to\nphysician segmentations on several classification metrics across different\nclasses, effectively reducing assessment time while maintaining high diagnostic\naccuracy. Code available at: https://github.com/ahxmeds/thyroidiomics.git.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning","Physics/Medical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"aiT8xOGShN5NozJ_QJlxSlb8vJhMGZgVhCCYNYpHgLE","pdfSize":"4933679"}