{"id":"2407.19326","title":"Accounting for plasticity: An extension of inelastic Constitutive\n  Artificial Neural Networks","authors":"Birte Boes, Jaan-Willem Simon, Hagen Holthusen","authorsParsed":[["Boes","Birte",""],["Simon","Jaan-Willem",""],["Holthusen","Hagen",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 19:19:42 GMT"}],"updateDate":"2024-07-30","timestamp":1722107982000,"abstract":"  The class of Constitutive Artificial Neural Networks (CANNs) represents a new\napproach of neural networks in the field of constitutive modeling. So far,\nCANNs have proven to be a powerful tool in predicting elastic and inelastic\nmaterial behavior. However, the specification of inelastic constitutive\nartificial neural networks (iCANNs) to capture plasticity remains to be\ndiscussed. We present the extension and application of an iCANN to the\ninelastic phenomena of plasticity. This includes the prediction of a\nformulation for the elastic and plastic Helmholtz free energies, the inelastic\nflow rule, and the yield condition that defines the onset of plasticity. Thus,\nwe learn four feed-forward networks in combination with a recurrent neural\nnetwork and use the second Piola-Kirchhoff stress measure for training. The\npresented formulation captures both, associative and non-associative\nplasticity. In addition, the formulation includes kinematic hardening effects\nby introducing the plastic Helmholtz free energy. This opens the range of\napplication to a wider class of materials. The capabilities of the presented\nframework are demonstrated by training on artificially generated data of models\nfor perfect plasticity of von-Mises type, tension-compression asymmetry, and\nkinematic hardening. We observe already satisfactory results for training on\none load case only while extremely precise agreement is found for an increase\nin load cases. In addition, the performance of the specified iCANN was\nvalidated using experimental data of X10CrMoVNb9-1 steel. Training has been\nperformed on both, uniaxial tension and cyclic loading, separately and the\npredicted results are then validated on the opposing set. The results underline\nthat the autonomously discovered material model is capable to describe and\npredict the underlying experimental data.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"kqf78_P_27doksvLFsb2wUGZUk3o2Ul-MufcIFo9lM8","pdfSize":"3201075"}