{"id":"2407.05089","title":"Bayesian network-guided sparse regression with flexible varying effects","authors":"Yangfan Ren, Christine B. Peterson and Marina Vannucci","authorsParsed":[["Ren","Yangfan",""],["Peterson","Christine B.",""],["Vannucci","Marina",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 14:41:29 GMT"}],"updateDate":"2024-07-09","timestamp":1720276889000,"abstract":"  In this paper, we propose Varying Effects Regression with Graph Estimation\n(VERGE), a novel Bayesian method for feature selection in regression. Our model\nhas key aspects that allow it to leverage the complex structure of data sets\narising from genomics or imaging studies. We distinguish between the\npredictors, which are the features utilized in the outcome prediction model,\nand the subject-level covariates, which modulate the effects of the predictors\non the outcome. We construct a varying coefficients modeling framework where we\ninfer a network among the predictor variables and utilize this network\ninformation to encourage the selection of related predictors. We employ\nvariable selection spike-and-slab priors that enable the selection of both\nnetwork-linked predictor variables and covariates that modify the predictor\neffects. We demonstrate through simulation studies that our method outperforms\nexisting alternative methods in terms of both feature selection and predictive\naccuracy. We illustrate VERGE with an application to characterizing the\ninfluence of gut microbiome features on obesity, where we identify a set of\nmicrobial taxa and their ecological dependence relations. We allow\nsubject-level covariates including sex and dietary intake variables to modify\nthe coefficients of the microbiome predictors, providing additional insight\ninto the interplay between these factors.\n","subjects":["Statistics/Methodology","Statistics/Applications"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"geoLadVOZWLVbJAVYVwSQOmJnfbRq-Gxj5iH5Y-FVBg","pdfSize":"842440"}