{"id":"2407.02075","title":"Label Anything: Multi-Class Few-Shot Semantic Segmentation with Visual\n  Prompts","authors":"Pasquale De Marinis, Nicola Fanelli, Raffaele Scaringi, Emanuele\n  Colonna, Giuseppe Fiameni, Gennaro Vessio and Giovanna Castellano","authorsParsed":[["De Marinis","Pasquale",""],["Fanelli","Nicola",""],["Scaringi","Raffaele",""],["Colonna","Emanuele",""],["Fiameni","Giuseppe",""],["Vessio","Gennaro",""],["Castellano","Giovanna",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 09:08:06 GMT"}],"updateDate":"2024-07-03","timestamp":1719911286000,"abstract":"  We present Label Anything, an innovative neural network architecture designed\nfor few-shot semantic segmentation (FSS) that demonstrates remarkable\ngeneralizability across multiple classes with minimal examples required per\nclass. Diverging from traditional FSS methods that predominantly rely on masks\nfor annotating support images, Label Anything introduces varied visual prompts\n-- points, bounding boxes, and masks -- thereby enhancing the framework's\nversatility and adaptability. Unique to our approach, Label Anything is\nengineered for end-to-end training across multi-class FSS scenarios,\nefficiently learning from diverse support set configurations without\nretraining. This approach enables a \"universal\" application to various FSS\nchallenges, ranging from $1$-way $1$-shot to complex $N$-way $K$-shot\nconfigurations while remaining agnostic to the specific number of class\nexamples. This innovative training strategy reduces computational requirements\nand substantially improves the model's adaptability and generalization across\ndiverse segmentation tasks. Our comprehensive experimental validation,\nparticularly achieving state-of-the-art results on the COCO-$20^i$ benchmark,\nunderscores Label Anything's robust generalization and flexibility. The source\ncode is publicly available at: https://github.com/pasqualedem/LabelAnything.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"AgoDDbMOWy6Pp_kJBR4uTvnNtOQVglUURCbYwhzYw6g","pdfSize":"25684393"}