{"id":"2407.01265","title":"OSL-ActionSpotting: A Unified Library for Action Spotting in Sports\n  Videos","authors":"Yassine Benzakour, Bruno Cabado, Silvio Giancola, Anthony Cioppa,\n  Bernard Ghanem, Marc Van Droogenbroeck","authorsParsed":[["Benzakour","Yassine",""],["Cabado","Bruno",""],["Giancola","Silvio",""],["Cioppa","Anthony",""],["Ghanem","Bernard",""],["Van Droogenbroeck","Marc",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 13:17:37 GMT"}],"updateDate":"2024-07-02","timestamp":1719839857000,"abstract":"  Action spotting is crucial in sports analytics as it enables the precise\nidentification and categorization of pivotal moments in sports matches,\nproviding insights that are essential for performance analysis and tactical\ndecision-making. The fragmentation of existing methodologies, however, impedes\nthe progression of sports analytics, necessitating a unified codebase to\nsupport the development and deployment of action spotting for video analysis.\nIn this work, we introduce OSL-ActionSpotting, a Python library that unifies\ndifferent action spotting algorithms to streamline research and applications in\nsports video analytics. OSL-ActionSpotting encapsulates various\nstate-of-the-art techniques into a singular, user-friendly framework, offering\nstandardized processes for action spotting and analysis across multiple\ndatasets. We successfully integrated three cornerstone action spotting methods\ninto OSL-ActionSpotting, achieving performance metrics that match those of the\noriginal, disparate codebases. This unification within a single library\npreserves the effectiveness of each method and enhances usability and\naccessibility for researchers and practitioners in sports analytics. By\nbridging the gaps between various action spotting techniques,\nOSL-ActionSpotting significantly contributes to the field of sports video\nanalysis, fostering enhanced analytical capabilities and collaborative research\nopportunities. The scalable and modularized design of the library ensures its\nlong-term relevance and adaptability to future technological advancements in\nthe domain.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"S94pQqg7i80Dl0CGSVzWJdSzyPPaCNacHJbwwLcYYB0","pdfSize":"5852375"}