{"id":"2407.18245","title":"VGGHeads: A Large-Scale Synthetic Dataset for 3D Human Heads","authors":"Orest Kupyn, Eugene Khvedchenia, Christian Rupprecht","authorsParsed":[["Kupyn","Orest",""],["Khvedchenia","Eugene",""],["Rupprecht","Christian",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 17:58:17 GMT"}],"updateDate":"2024-07-26","timestamp":1721930297000,"abstract":"  Human head detection, keypoint estimation, and 3D head model fitting are\nimportant tasks with many applications. However, traditional real-world\ndatasets often suffer from bias, privacy, and ethical concerns, and they have\nbeen recorded in laboratory environments, which makes it difficult for trained\nmodels to generalize. Here, we introduce VGGHeads -- a large scale synthetic\ndataset generated with diffusion models for human head detection and 3D mesh\nestimation. Our dataset comprises over 1 million high-resolution images, each\nannotated with detailed 3D head meshes, facial landmarks, and bounding boxes.\nUsing this dataset we introduce a new model architecture capable of\nsimultaneous heads detection and head meshes reconstruction from a single image\nin a single step. Through extensive experimental evaluations, we demonstrate\nthat models trained on our synthetic data achieve strong performance on real\nimages. Furthermore, the versatility of our dataset makes it applicable across\na broad spectrum of tasks, offering a general and comprehensive representation\nof human heads. Additionally, we provide detailed information about the\nsynthetic data generation pipeline, enabling it to be re-used for other tasks\nand domains.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"RxZ_PIpt0w-TCebvUj1HQz0ExlziIga-dAqfWOIaA-o","pdfSize":"24073692","objectId":"0x9c18355cdfe75466cc8a084e15a07d6d8853193ae492df8007b6adbbeab09eb4","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
