{"id":"2407.16301","title":"MHD activity induced coherent mode excitation in the edge plasma region\n  of ADITYA-U Tokamak","authors":"Kaushlender Singh, Suman Dolui, Bharat Hegde, Lavkesh Lachhvani,\n  Sharvil Patel, Injamul Hoque, Ashok K. Kumawat, Ankit Kumar, Tanmay Macwan,\n  Harshita Raj, Soumitra Banerjee, Komal Yadav, Abha Kanik, Pramila Gautam,\n  Rohit Kumar, Suman Aich, Laxmikanta Pradhan, Ankit Patel, Kalpesh Galodiya,\n  Daniel Raju, S.K. Jha, K. A. Jadeja, K. M. Patel, S. N. Pandya, M.B.\n  Chaudhary, R.L. Tanna, P. K. Chattopadhyay, R. Pal, Y. C. Saxena, Abhijit Sen\n  and Joydeep Ghosh","authorsParsed":[["Singh","Kaushlender",""],["Dolui","Suman",""],["Hegde","Bharat",""],["Lachhvani","Lavkesh",""],["Patel","Sharvil",""],["Hoque","Injamul",""],["Kumawat","Ashok K.",""],["Kumar","Ankit",""],["Macwan","Tanmay",""],["Raj","Harshita",""],["Banerjee","Soumitra",""],["Yadav","Komal",""],["Kanik","Abha",""],["Gautam","Pramila",""],["Kumar","Rohit",""],["Aich","Suman",""],["Pradhan","Laxmikanta",""],["Patel","Ankit",""],["Galodiya","Kalpesh",""],["Raju","Daniel",""],["Jha","S. K.",""],["Jadeja","K. A.",""],["Patel","K. M.",""],["Pandya","S. N.",""],["Chaudhary","M. B.",""],["Tanna","R. L.",""],["Chattopadhyay","P. K.",""],["Pal","R.",""],["Saxena","Y. C.",""],["Sen","Abhijit",""],["Ghosh","Joydeep",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 08:56:08 GMT"}],"updateDate":"2024-07-24","timestamp":1721724968000,"abstract":"  In this paper, we report the excitation of coherent density and potential\nfluctuations induced by magnetohydrodynamic (MHD) activity in the edge plasma\nregion of ADITYA-U Tokamak. When the amplitude of the MHD mode, mainly the m/n\n= 2/1, increases beyond a threshold value of 0.3-0.4 %, coherent oscillations\nin the density and potential fluctuations are observed having the same\nfrequency as that of the MHD mode. The mode numbers of these MHD induced\ndensity and potential fluctuations are obtained by Langmuir probes placed at\ndifferent radial, poloidal, and toroidal locations in the edge plasma region.\nDetailed analyses of these Langmuir probe measurements reveal that the coherent\nmode in edge potential fluctuation has a mode structure of m/n = 2/1 whereas\nthe edge density fluctuation has an m/n = 1/1 structure. It is further observed\nthat beyond the threshold, the coupled power fraction scales almost linearly\nwith the magnitude of magnetic fluctuations. Furthermore, the rise rates of the\ncoupled power fraction for coherent modes in density and potential fluctuations\nare also found to be dependent on the growth rate of magnetic fluctuations. The\ndisparate mode structures of the excited modes in density and plasma potential\nfluctuations suggest that the underlying mechanism for their existence is most\nlikely due to the excitation of the global high-frequency branch of zonal flows\noccurring through the coupling of even harmonics of potential to the odd\nharmonics of pressure due to 1/R dependence of the toroidal magnetic field.\n","subjects":["Physics/Plasma Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"owp0kkcJRZ6UQ_MqSnfY6mfKYcLuoe300D6wSuY5RFQ","pdfSize":"2081768"}