{"id":"2407.03406","title":"Efficient Stochastic Template Bank using Inner Product Inequalities","authors":"Keisi Kacanja, Alexander H. Nitz, Shichao Wu, Marco Cusinato, Rahul\n  Dhurkunde, Ian Harry, Tito Dal Canton, Francesco Pannarale","authorsParsed":[["Kacanja","Keisi",""],["Nitz","Alexander H.",""],["Wu","Shichao",""],["Cusinato","Marco",""],["Dhurkunde","Rahul",""],["Harry","Ian",""],["Canton","Tito Dal",""],["Pannarale","Francesco",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 18:00:02 GMT"}],"updateDate":"2024-07-08","timestamp":1720029602000,"abstract":"  Gravitational wave searches are crucial for studying compact sources like\nneutron stars and black holes. Many sensitive modeled searches use matched\nfiltering to compare gravitational strain data to a set of waveform models\nknown as template banks. We introduce a new stochastic placement method for\nconstructing template banks, offering efficiency and flexibility to handle\narbitrary parameter spaces, including orbital eccentricity, tidal\ndeformability, and other extrinsic parameters. This method can be\ncomputationally limited by the ability to compare proposal templates with the\naccepted templates in the bank. To alleviate this computational load, we\nintroduce the use of inner product inequalities to reduce the number of\nrequired comparisons. We also introduce a novel application of Gaussian Kernel\nDensity Estimation to enhance waveform coverage in sparser regions. Our\napproach has been employed to search for eccentric binary neutron stars,\nlow-mass neutron stars, primordial black holes, supermassive black hole\nbinaries. We demonstrate that our method produces self-consistent banks that\nrecover the required minimum fraction of signals. For common parameter spaces,\nour method shows comparable computational performance and similar template bank\nsizes to geometric placement methods and stochastic methods, while easily\nextending to higher-dimensional problems. The time to run a search exceeds the\ntime to generate the bank by a factor of $\\mathcal{O}(10^5)$ for dedicated\ntemplate banks, such as geometric, mass-only stochastic, and aligned spin\ncases, $\\mathcal{O}(10^4)$ for eccentric and $\\mathcal{O}(10^3)$ for the tidal\ndeformable bank. With the advent of efficient template bank generation, the\nprimary area for improvement is developing more efficient search methodologies.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"DhLtNZt9ojwYGtZtmG5iufGPZNFFl8zsLeGfuJ2QOWg","pdfSize":"1837138"}