{"id":"2407.01848","title":"UniFIDES: Universal Fractional Integro-Differential Equation Solvers","authors":"Milad Saadat, Deepak Mangal and Safa Jamali","authorsParsed":[["Saadat","Milad",""],["Mangal","Deepak",""],["Jamali","Safa",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 23:16:34 GMT"},{"version":"v2","created":"Mon, 8 Jul 2024 13:18:17 GMT"}],"updateDate":"2024-07-09","timestamp":1719875794000,"abstract":"  The development of data-driven approaches for solving differential equations\nhas been followed by a plethora of applications in science and engineering\nacross a multitude of disciplines and remains a central focus of active\nscientific inquiry. However, a large body of natural phenomena incorporates\nmemory effects that are best described via fractional integro-differential\nequations (FIDEs), in which the integral or differential operators accept\nnon-integer orders. Addressing the challenges posed by nonlinear FIDEs is a\nrecognized difficulty, necessitating the application of generic methods with\nimmediate practical relevance. This work introduces the Universal Fractional\nIntegro-Differential Equation Solvers (UniFIDES), a comprehensive machine\nlearning platform designed to expeditiously solve a variety of FIDEs in both\nforward and inverse directions, without the need for ad hoc manipulation of the\nequations. The effectiveness of UniFIDES is demonstrated through a collection\nof integer-order and fractional problems in science and engineering. Our\nresults highlight UniFIDES' ability to accurately solve a wide spectrum of\nintegro-differential equations and offer the prospect of using machine learning\nplatforms universally for discovering and describing dynamical and complex\nsystems.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"gbfkxQ_tJ18DzkIblQ5cB3hq8_KDD-9hWzhpzyBdlIo","pdfSize":"16460283","objectId":"0x7f9ca1d5f57ef112df0c2b76c7fb97f7a2863b2e606cd86334a3ba34fa7530a8","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
