{"id":"2407.16912","title":"Cross-Domain Policy Transfer by Representation Alignment via\n  Multi-Domain Behavioral Cloning","authors":"Hayato Watahiki, Ryo Iwase, Ryosuke Unno, Yoshimasa Tsuruoka","authorsParsed":[["Watahiki","Hayato",""],["Iwase","Ryo",""],["Unno","Ryosuke",""],["Tsuruoka","Yoshimasa",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 00:13:00 GMT"}],"updateDate":"2024-07-25","timestamp":1721779980000,"abstract":"  Transferring learned skills across diverse situations remains a fundamental\nchallenge for autonomous agents, particularly when agents are not allowed to\ninteract with an exact target setup. While prior approaches have predominantly\nfocused on learning domain translation, they often struggle with handling\nsignificant domain gaps or out-of-distribution tasks. In this paper, we present\na simple approach for cross-domain policy transfer that learns a shared latent\nrepresentation across domains and a common abstract policy on top of it. Our\napproach leverages multi-domain behavioral cloning on unaligned trajectories of\nproxy tasks and employs maximum mean discrepancy (MMD) as a regularization term\nto encourage cross-domain alignment. The MMD regularization better preserves\nstructures of latent state distributions than commonly used\ndomain-discriminative distribution matching, leading to higher transfer\nperformance. Moreover, our approach involves training only one multi-domain\npolicy, which makes extension easier than existing methods. Empirical\nevaluations demonstrate the efficacy of our method across various domain\nshifts, especially in scenarios where exact domain translation is challenging,\nsuch as cross-morphology or cross-viewpoint settings. Our ablation studies\nfurther reveal that multi-domain behavioral cloning implicitly contributes to\nrepresentation alignment alongside domain-adversarial regularization.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"RR2yiaMuSSjQ247TQOc4eByAdkpjPQ7vamEbeed-7fk","pdfSize":"5550850"}