{"id":"2407.00163","title":"Pressure Tuning the Mixture of Eu$^{2+}$ and Eu$^{3+}$ in\n  Eu$_4$Bi$_6$Se$_{13}$","authors":"Mingyu Xu, Jose L. Gonzalez Jimenez, Greeshma C. Jose, Artittaya\n  Boonkird, Chengkun Xing, Chelsea Harrod, Xinle Li, Haidong Zhou, Alyssa\n  Gaiser, Xianglin Ke, Wenli Bi, Mingda Li, Weiwei Xie","authorsParsed":[["Xu","Mingyu",""],["Jimenez","Jose L. Gonzalez",""],["Jose","Greeshma C.",""],["Boonkird","Artittaya",""],["Xing","Chengkun",""],["Harrod","Chelsea",""],["Li","Xinle",""],["Zhou","Haidong",""],["Gaiser","Alyssa",""],["Ke","Xianglin",""],["Bi","Wenli",""],["Li","Mingda",""],["Xie","Weiwei",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 18:01:28 GMT"}],"updateDate":"2024-07-02","timestamp":1719597688000,"abstract":"  The investigation of crystallographic, electronic, and magnetic\ncharacteristics, especially the mixed valences of Eu$^{2+}$ and Eu$^{3+}$ under\npressure of a novel europium-based bismuth selenide compound,\nEu$_4$Bi$_6$Se$_{13}$, presented. This new compound adopts a monoclinic crystal\nstructure classified under the P$2_1$/m space group (#11). It exhibits\ndistinctive structural features, including substantial Eu-Se coordination\nnumbers, Bi-Se ladders, and linear chains of Eu atoms that propagate along the\nb-axis. Electronic resistivity assessments indicate that\nEu$_{4}$Bi$_{6}$Se$_{13}$ exhibits weak metallic behaviors. Magnetic\ncharacterization reveals uniaxial magnetic anisotropy, with a notable spin\ntransition at approximately 1.2 T when the magnetic field is oriented along the\nb-axis. This behavior, coupled with the specific Eu-Eu interatomic distances\nand the magnetic saturation observed at low fields, supports the identification\nof metamagnetic properties attributable to the flipping of europium spins. The\nCurie-Weiss analysis of the magnetic susceptibility measured both perpendicular\nand parallel to the b-axis and high-pressure partial fluorescence yield (PFY)\nresults detected by X-ray absorption spectroscopy (XAS) reveal the tendency of\nthe material to enter a mixed valent state where the trivalent state becomes\nmore prominent with the pressure increase or temperature decrease.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"1IyFk1T0x-wSdFymDktj_snO3hk1ReYmozmPx6CZj7g","pdfSize":"1165041"}