{"id":"2407.08215","title":"Enhancing Performance and User Engagement in Everyday Stress Monitoring:\n  A Context-Aware Active Reinforcement Learning Approach","authors":"Seyed Amir Hossein Aqajari, Ziyu Wang, Ali Tazarv, Sina Labbaf, Salar\n  Jafarlou, Brenda Nguyen, Nikil Dutt, Marco Levorato, Amir M. Rahmani","authorsParsed":[["Aqajari","Seyed Amir Hossein",""],["Wang","Ziyu",""],["Tazarv","Ali",""],["Labbaf","Sina",""],["Jafarlou","Salar",""],["Nguyen","Brenda",""],["Dutt","Nikil",""],["Levorato","Marco",""],["Rahmani","Amir M.",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 06:33:11 GMT"}],"updateDate":"2024-07-12","timestamp":1720679591000,"abstract":"  In today's fast-paced world, accurately monitoring stress levels is crucial.\nSensor-based stress monitoring systems often need large datasets for training\neffective models. However, individual-specific models are necessary for\npersonalized and interactive scenarios. Traditional methods like Ecological\nMomentary Assessments (EMAs) assess stress but struggle with efficient data\ncollection without burdening users. The challenge is to timely send EMAs,\nespecially during stress, balancing monitoring efficiency and user convenience.\nThis paper introduces a novel context-aware active reinforcement learning (RL)\nalgorithm for enhanced stress detection using Photoplethysmography (PPG) data\nfrom smartwatches and contextual data from smartphones. Our approach\ndynamically selects optimal times for deploying EMAs, utilizing the user's\nimmediate context to maximize label accuracy and minimize intrusiveness.\nInitially, the study was executed in an offline environment to refine the label\ncollection process, aiming to increase accuracy while reducing user burden.\nLater, we integrated a real-time label collection mechanism, transitioning to\nan online methodology. This shift resulted in an 11% improvement in stress\ndetection efficiency. Incorporating contextual data improved model accuracy by\n4%. Personalization studies indicated a 10% enhancement in AUC-ROC scores,\ndemonstrating better stress level differentiation. This research marks a\nsignificant move towards personalized, context-driven real-time stress\nmonitoring methods.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_96l4pZRJH7pBBlvIRHf9JTqaY3IA31RfcWluEAbTH0","pdfSize":"1853155"}