{"id":"2407.14451","title":"From Instruction to Insight: Exploring the Functional and Semantic Roles\n  of Text in Interactive Dashboards","authors":"Nicole Sultanum, Vidya Setlur","authorsParsed":[["Sultanum","Nicole",""],["Setlur","Vidya",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 16:48:00 GMT"},{"version":"v2","created":"Tue, 6 Aug 2024 23:48:14 GMT"}],"updateDate":"2024-08-08","timestamp":1721407680000,"abstract":"  There is increased interest in the interplay between text and visuals in the\nfield of data visualization. However, this attention has predominantly been on\nthe use of text in standalone visualizations or augmenting text stories\nsupported by a series of independent views. In this paper, we shift from the\ntraditional focus on single-chart annotations to characterize the nuanced but\ncrucial communication role of text in the complex environment of interactive\ndashboards. Through a survey and analysis of 190 dashboards in the wild, plus\n13 expert interview sessions with experienced dashboard authors, we highlight\nthe distinctive nature of text as an integral component of the dashboard\nexperience, while delving into the categories, semantic levels, and functional\nroles of text, and exploring how these text elements are coalesced by dashboard\nauthors to guide and inform dashboard users.\n  Our contributions are: 1) we distill qualitative and quantitative findings\nfrom our studies to characterize current practices of text use in dashboards,\nincluding a categorization of text-based components and design patterns; 2) we\nleverage current practices and existing literature to propose, discuss, and\nvalidate recommended practices for text in dashboards, embodied as 12\nheuristics that underscore the semantic and functional role of text in offering\nnavigational cues, contextualizing data insights, supporting reading order,\netc; 3) we reflect on our findings to identify gaps and propose opportunities\nfor data visualization researchers to push the boundaries on text usage for\ndashboards, from authoring support and interactivity to text generation and\ncontent personalization.\n  Our research underscores the significance of elevating text as a first-class\ncitizen in data visualization, and the need to support the inclusion of textual\ncomponents and their interactive affordances in dashboard design.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"a4xSzENMrD5nmShI88nstTHmn6vssc1ZLBsCaNYehto","pdfSize":"9582519"}