{"id":"2407.15586","title":"Data driven weather forecasts trained and initialised directly from\n  observations","authors":"Anthony McNally and Christian Lessig and Peter Lean and Eulalie\n  Boucher and Mihai Alexe and Ewan Pinnington, and Matthew Chantry and Simon\n  Lang and Chris Burrows and Marcin Chrust and Florian Pinault and Ethel\n  Villeneuve and Niels Bormann and Sean Healy","authorsParsed":[["McNally","Anthony",""],["Lessig","Christian",""],["Lean","Peter",""],["Boucher","Eulalie",""],["Alexe","Mihai",""],["Pinnington","Ewan",""],["Chantry","Matthew",""],["Lang","Simon",""],["Burrows","Chris",""],["Chrust","Marcin",""],["Pinault","Florian",""],["Villeneuve","Ethel",""],["Bormann","Niels",""],["Healy","Sean",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 12:23:26 GMT"}],"updateDate":"2024-07-23","timestamp":1721651006000,"abstract":"  Skilful Machine Learned weather forecasts have challenged our approach to\nnumerical weather prediction, demonstrating competitive performance compared to\ntraditional physics-based approaches. Data-driven systems have been trained to\nforecast future weather by learning from long historical records of past\nweather such as the ECMWF ERA5. These datasets have been made freely available\nto the wider research community, including the commercial sector, which has\nbeen a major factor in the rapid rise of ML forecast systems and the levels of\naccuracy they have achieved. However, historical reanalyses used for training\nand real-time analyses used for initial conditions are produced by data\nassimilation, an optimal blending of observations with a physics-based forecast\nmodel. As such, many ML forecast systems have an implicit and unquantified\ndependence on the physics-based models they seek to challenge. Here we propose\na new approach, training a neural network to predict future weather purely from\nhistorical observations with no dependence on reanalyses. We use raw\nobservations to initialise a model of the atmosphere (in observation space)\nlearned directly from the observations themselves. Forecasts of crucial weather\nparameters (such as surface temperature and wind) are obtained by predicting\nweather parameter observations (e.g. SYNOP surface data) at future times and\narbitrary locations. We present preliminary results on forecasting observations\n12-hours into the future. These already demonstrate successful learning of time\nevolutions of the physical processes captured in real observations. We argue\nthat this new approach, by staying purely in observation space, avoids many of\nthe challenges of traditional data assimilation, can exploit a wider range of\nobservations and is readily expanded to simultaneous forecasting of the full\nEarth system (atmosphere, land, ocean and composition).\n","subjects":["Physics/Atmospheric and Oceanic Physics","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"HC7DYMSicsnhtw450dr8oqUspGY0txhSNXUOlLuTHmM","pdfSize":"14696404"}