{"id":"2407.19900","title":"Practical and Reproducible Symbolic Music Generation by Large Language\n  Models with Structural Embeddings","authors":"Seungyeon Rhyu, Kichang Yang, Sungjun Cho, Jaehyeon Kim, Kyogu Lee,\n  and Moontae Lee","authorsParsed":[["Rhyu","Seungyeon",""],["Yang","Kichang",""],["Cho","Sungjun",""],["Kim","Jaehyeon",""],["Lee","Kyogu",""],["Lee","Moontae",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 11:24:10 GMT"}],"updateDate":"2024-07-30","timestamp":1722252250000,"abstract":"  Music generation introduces challenging complexities to large language\nmodels. Symbolic structures of music often include vertical harmonization as\nwell as horizontal counterpoint, urging various adaptations and enhancements\nfor large-scale Transformers. However, existing works share three major\ndrawbacks: 1) their tokenization requires domain-specific annotations, such as\nbars and beats, that are typically missing in raw MIDI data; 2) the pure impact\nof enhancing token embedding methods is hardly examined without domain-specific\nannotations; and 3) existing works to overcome the aforementioned drawbacks,\nsuch as MuseNet, lack reproducibility. To tackle such limitations, we develop a\nMIDI-based music generation framework inspired by MuseNet, empirically studying\ntwo structural embeddings that do not rely on domain-specific annotations. We\nprovide various metrics and insights that can guide suitable encoding to\ndeploy. We also verify that multiple embedding configurations can selectively\nboost certain musical aspects. By providing open-source implementations via\nHuggingFace, our findings shed light on leveraging large language models toward\npractical and reproducible music generation.\n","subjects":["Computing Research Repository/Sound","Computing Research Repository/Artificial Intelligence","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"LiePyHT1ddLkI2KAvzpB0i3ftg-IevLpzgMNcYgpQGQ","pdfSize":"1271115","objectId":"0x160dda7b42bf42a163974b6bcdb530ebfed5946b2cd8189f2777456db65076fa","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
