{"id":"2407.06040","title":"Enabling Performant and Secure EDA as a Service in Public Clouds Using\n  Confidential Containers","authors":"Mengmei Ye, Derren Dunn, Daniele Buono, Angelo Ruocco, Claudio\n  Carvalho, Tobin Feldman-fitzthum, Hubertus Franke, James Bottomley","authorsParsed":[["Ye","Mengmei",""],["Dunn","Derren",""],["Buono","Daniele",""],["Ruocco","Angelo",""],["Carvalho","Claudio",""],["Feldman-fitzthum","Tobin",""],["Franke","Hubertus",""],["Bottomley","James",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 15:36:30 GMT"}],"updateDate":"2024-07-09","timestamp":1720452990000,"abstract":"  Increasingly, business opportunities available to fabless design teams in the\nsemiconductor industry far exceed those addressable with on-prem compute\nresources. An attractive option to capture these electronic design automation\n(EDA) design opportunities is through public cloud bursting. However, security\nconcerns with public cloud bursting arise from having to protect process design\nkits, third party intellectual property, and new design data for semiconductor\ndevices and chips. One way to address security concerns for public cloud\nbursting is to leverage confidential containers for EDA workloads. Confidential\ncontainers add zero trust computing elements to significantly reduce the\nprobability of intellectual property escapes. A key concern that often follows\nsecurity discussions is whether EDA workload performance will suffer with\nconfidential computing. In this work we demonstrate a full set of EDA\nconfidential containers and their deployment and characterize performance\nimpacts of confidential elements of the flow including storage and networking.\nA complete end-to-end confidential container-based EDA workload exhibits 7.13%\nand 2.05% performance overheads over bare-metal container and VM based\nsolutions, respectively.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"VXdSaBlU56V9bw6DB0aZ69D-SGOA33sQB6XXxtxrAp4","pdfSize":"648715"}