{"id":"2407.01444","title":"Wind line variability and intrinsic errors in observational mass loss\n  rates","authors":"Derck Massa, Raman K. Prinja and Lidia Oskinova","authorsParsed":[["Massa","Derck",""],["Prinja","Raman K.",""],["Oskinova","Lidia",""]],"versions":[{"version":"v1","created":"Sun, 16 Jun 2024 20:50:22 GMT"}],"updateDate":"2024-07-02","timestamp":1718571022000,"abstract":"  UV wind line variability in OB stars appears to be universal. To quantify\nthis variation and to estimate its effect on a mass loss rate determined from a\nsingle observation, we use the IUE archive to identify non-peculiar OB stars\nwith well developed but unsaturated Si IV 1400 doublets and at least 10\nindependent observations. This resulted in 1699 spectra of 25 stars. We use SEI\nmodelling to translate the profile variations into optical depth variations\nand, hence, variations in measured mass loss rates. These variations quantify\nthe intrinsic error inherent in any mass loss rate derived from a single\nobservation. The derived rates have an overall RMS variation of about 22%, but\nthis differs with effective temperature, being as small at 8% for the hottest\nstars and up to 45% for the cooler ones. Furthermore, any single determination\ncan differ from the mean by a factor of 2 or more. Our results also imply that\nmass loss rates determined from non-simultaneous observations (such as UV and\nground based data) need not agree. We also use our results to examine the\nnature of the wind structures responsible for the variability. Our findings\nsuggest that the optical depth variations result from optically very thick\nstructures occulting more or less of the line of sight to the stellar disk.\nFurther, the smaller optical depth variations in the hottest stars suggests\nthat the responsible structures are disrupted in their more powerful winds.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"TARJHPmHq6fQMnvxvAgTyFh6YBaLKxrgcH8jC6BP5dg","pdfSize":"1047709"}