{"id":"2407.00811","title":"A Novel Design of Capacitive Plasmonic Near Field Transducer","authors":"Tianxiang Du, David E Laughlin, Jian-Gang (Jimmy) Zhu","authorsParsed":[["Du","Tianxiang","","Jimmy"],["Laughlin","David E","","Jimmy"],["Jian-Gang","","","Jimmy"],["Zhu","",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 19:46:05 GMT"}],"updateDate":"2024-07-02","timestamp":1719776765000,"abstract":"  A near field transducer (NFT) is a key photonics component in heat assisted\nmagnetic recording (HAMR) for the localized heating of the magnetic medium. In\nthis work, we present a novel NFT design through capacitive coupling. In our\ndesign, tapered metal bars separated by thin dielectric materials with gap\ndistance G are used to create the plasmonic resonance and focus the\nelectromagnetic field. The design is motivated by the intention to improve\nthermal stability, which can be achieved through segmentation using thermally\nstable dielectric material between the plasmonic metal bars. Using COMSOL\nMultiphysics software, the performance of this capacitive-coupled NFT is\nsystematically modeled. It is shown that the electromagnetic field could\ngradually be focused through the tapering towards the air bearing surface\n(ABS). In addition, the focusing effect could be enhanced with a smaller NFT\npeg size at the resonant wavelength. The material selection for the NFT tip\nmaterial will be discussed to further address the thermal stability of the\ndevice. In conclusion, this capacitive-coupled NFT with dielectric separation\ngaps and tapering yields an enhanced |E| field intensity at the tip with the\npotential for an enhanced material thermal stability. Such a design can also\nexhibit applications in other energy delivery systems as well as plasmonic\nwaveguides and sensors.\n","subjects":["Physics/Optics","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"LAULoNvo_ZILT5TB7f7GM5ZLOZxyZZyhMKuot1n5XVg","pdfSize":"983286"}