{"id":"2407.06658","title":"TriQXNet: Forecasting Dst Index from Solar Wind Data Using an\n  Interpretable Parallel Classical-Quantum Framework with Uncertainty\n  Quantification","authors":"Md Abrar Jahin, M. F. Mridha, Zeyar Aung, Nilanjan Dey, and R. Simon\n  Sherratt","authorsParsed":[["Jahin","Md Abrar",""],["Mridha","M. F.",""],["Aung","Zeyar",""],["Dey","Nilanjan",""],["Sherratt","R. Simon",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 08:30:42 GMT"},{"version":"v2","created":"Wed, 10 Jul 2024 16:53:38 GMT"}],"updateDate":"2024-07-11","timestamp":1720513842000,"abstract":"  Geomagnetic storms, caused by solar wind energy transfer to Earth's magnetic\nfield, can disrupt critical infrastructure like GPS, satellite communications,\nand power grids. The disturbance storm-time (Dst) index measures storm\nintensity. Despite advancements in empirical, physics-based, and\nmachine-learning models using real-time solar wind data, accurately forecasting\nextreme geomagnetic events remains challenging due to noise and sensor\nfailures. This research introduces TriQXNet, a novel hybrid classical-quantum\nneural network for Dst forecasting. Our model integrates classical and quantum\ncomputing, conformal prediction, and explainable AI (XAI) within a hybrid\narchitecture. To ensure high-quality input data, we developed a comprehensive\npreprocessing pipeline that included feature selection, normalization,\naggregation, and imputation. TriQXNet processes preprocessed solar wind data\nfrom NASA's ACE and NOAA's DSCOVR satellites, predicting the Dst index for the\ncurrent hour and the next, providing vital advance notice to mitigate\ngeomagnetic storm impacts. TriQXNet outperforms 13 state-of-the-art hybrid\ndeep-learning models, achieving a root mean squared error of 9.27 nanoteslas\n(nT). Rigorous evaluation through 10-fold cross-validated paired t-tests\nconfirmed its superior performance with 95% confidence. Conformal prediction\ntechniques provide quantifiable uncertainty, which is essential for operational\ndecisions, while XAI methods like ShapTime enhance interpretability.\nComparative analysis shows TriQXNet's superior forecasting accuracy, setting a\nnew level of expectations for geomagnetic storm prediction and highlighting the\npotential of classical-quantum hybrid models in space weather forecasting.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7D-dpNa77acVDkBrhItNvFZJfe2ge7AOmjk_8olQ7Rw","pdfSize":"1928569"}
