{"id":"2407.11448","title":"cDP-MIL: Robust Multiple Instance Learning via Cascaded Dirichlet\n  Process","authors":"Yihang Chen, Tsai Hor Chan, Guosheng Yin, Yuming Jiang, Lequan Yu","authorsParsed":[["Chen","Yihang",""],["Chan","Tsai Hor",""],["Yin","Guosheng",""],["Jiang","Yuming",""],["Yu","Lequan",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 07:28:39 GMT"},{"version":"v2","created":"Fri, 19 Jul 2024 07:25:29 GMT"}],"updateDate":"2024-07-22","timestamp":1721114919000,"abstract":"  Multiple instance learning (MIL) has been extensively applied to whole slide\nhistopathology image (WSI) analysis. The existing aggregation strategy in MIL,\nwhich primarily relies on the first-order distance (e.g., mean difference)\nbetween instances, fails to accurately approximate the true feature\ndistribution of each instance, leading to biased slide-level representations.\nMoreover, the scarcity of WSI observations easily leads to model overfitting,\nresulting in unstable testing performance and limited generalizability. To\ntackle these challenges, we propose a new Bayesian nonparametric framework for\nmultiple instance learning, which adopts a cascade of Dirichlet processes (cDP)\nto incorporate the instance-to-bag characteristic of the WSIs. We perform\nfeature aggregation based on the latent clusters formed by the Dirichlet\nprocess, which incorporates the covariances of the patch features and forms\nmore representative clusters. We then perform bag-level prediction with another\nDirichlet process model on the bags, which imposes a natural regularization on\nlearning to prevent overfitting and enhance generalizability. Moreover, as a\nBayesian nonparametric method, the cDP model can accurately generate posterior\nuncertainty, which allows for the detection of outlier samples and tumor\nlocalization. Extensive experiments on five WSI benchmarks validate the\nsuperior performance of our method, as well as its generalizability and ability\nto estimate uncertainties. Codes are available at\nhttps://github.com/HKU-MedAI/cDPMIL.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"80NaenTkJLK7MBIFmQMGnc8uQRduSXiQa7x3WWphgJg","pdfSize":"3544740"}