{"id":"2407.11941","title":"Beyond Spatial Explanations: Explainable Face Recognition in the\n  Frequency Domain","authors":"Marco Huber, Naser Damer","authorsParsed":[["Huber","Marco",""],["Damer","Naser",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 17:29:24 GMT"}],"updateDate":"2024-07-17","timestamp":1721150964000,"abstract":"  The need for more transparent face recognition (FR), along with other\nvisual-based decision-making systems has recently attracted more attention in\nresearch, society, and industry. The reasons why two face images are matched or\nnot matched by a deep learning-based face recognition system are not obvious\ndue to the high number of parameters and the complexity of the models. However,\nit is important for users, operators, and developers to ensure trust and\naccountability of the system and to analyze drawbacks such as biased behavior.\nWhile many previous works use spatial semantic maps to highlight the regions\nthat have a significant influence on the decision of the face recognition\nsystem, frequency components which are also considered by CNNs, are neglected.\nIn this work, we take a step forward and investigate explainable face\nrecognition in the unexplored frequency domain. This makes this work the first\nto propose explainability of verification-based decisions in the frequency\ndomain, thus explaining the relative influence of the frequency components of\neach input toward the obtained outcome. To achieve this, we manipulate face\nimages in the spatial frequency domain and investigate the impact on\nverification outcomes. In extensive quantitative experiments, along with\ninvestigating two special scenarios cases, cross-resolution FR and morphing\nattacks (the latter in supplementary material), we observe the applicability of\nour proposed frequency-based explanations.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"euUocTew1EM_Y6DVnBaQ0Nb3pLp_oEB10UbsM9Jp9pI","pdfSize":"47630165"}