{"id":"2407.04134","title":"The evaluation of the CUSP scientific performance by a GEANT4 Monte\n  Carlo simulation","authors":"Giovanni De Cesare, Sergio Fabiani, Riccardo Campana, Giovanni\n  Lombardi, Ettore Del Monte, Enrico Costa, Ilaria Baffo, Sergio Bonomo,\n  Daniele Brienza, Mauro Centrone, Gessica Contini, Giovanni Cucinella, Andrea\n  Curatolo, Nicolas De Angelis, Andrea Del Re, Sergio Di Cosimo, Simone Di\n  Filippo, Alessandro Di Marco, Giuseppe Di Persio, Immacolata Donnarumma,\n  Pierluigi Fanelli, Paolo Leonetti, Alfredo Locarini, Pasqualino Loffredo,\n  Gabriele Minervini, Dario Modenini, Fabio Muleri, Silvia Natalucci, Andrea\n  Negri, Massimo Perelli, Monia Rossi, Alda Rubini, Emanuele Scalise, Paolo\n  Soffitta, Andrea Terracciano, Paolo Tortora, Emauele Zaccagnino, Alessandro\n  Zambardi","authorsParsed":[["De Cesare","Giovanni",""],["Fabiani","Sergio",""],["Campana","Riccardo",""],["Lombardi","Giovanni",""],["Del Monte","Ettore",""],["Costa","Enrico",""],["Baffo","Ilaria",""],["Bonomo","Sergio",""],["Brienza","Daniele",""],["Centrone","Mauro",""],["Contini","Gessica",""],["Cucinella","Giovanni",""],["Curatolo","Andrea",""],["De Angelis","Nicolas",""],["Del Re","Andrea",""],["Di Cosimo","Sergio",""],["Di Filippo","Simone",""],["Di Marco","Alessandro",""],["Di Persio","Giuseppe",""],["Donnarumma","Immacolata",""],["Fanelli","Pierluigi",""],["Leonetti","Paolo",""],["Locarini","Alfredo",""],["Loffredo","Pasqualino",""],["Minervini","Gabriele",""],["Modenini","Dario",""],["Muleri","Fabio",""],["Natalucci","Silvia",""],["Negri","Andrea",""],["Perelli","Massimo",""],["Rossi","Monia",""],["Rubini","Alda",""],["Scalise","Emanuele",""],["Soffitta","Paolo",""],["Terracciano","Andrea",""],["Tortora","Paolo",""],["Zaccagnino","Emauele",""],["Zambardi","Alessandro",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 19:40:04 GMT"}],"updateDate":"2024-07-08","timestamp":1720122004000,"abstract":"  The CUbesat Solar Polarimeter (CUSP) project is a CubeSat mission orbiting\nthe Earth aimed to measure the linear polarization of solar flares in the hard\nX-ray band by means of a Compton scattering polarimeter. CUSP will allow to\nstudy the magnetic reconnection and particle acceleration in the flaring\nmagnetic structures of our star. CUSP is a project in the framework of the\nAlcor Program of the Italian Space Agency aimed to develop new CubeSat\nmissions. It is approved for a Phase B study. In this work, we report on the\naccurate simulation of the detector's response to evaluate the scientific\nperformance. A GEANT4 Monte Carlo simulation is used to assess the physical\ninteractions of the source photons with the detector and the passive materials.\nUsing this approach, we implemented a detailed CUSP Mass Model. In this work,\nwe report on the evaluation of the detector's effective area as a function of\nthe beam energy.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/Solar and Stellar Astrophysics","Physics/Space Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"NMwsWW_VEKaSwCQQISrYfFwWfP-4H2_2lhkSZFAOvcs","pdfSize":"995903"}
