{"id":"2407.15524","title":"Towards Efficient Transferable Preemptive Adversarial Defense","authors":"Hanrui Wang, Ching-Chun Chang, Chun-Shien Lu, Isao Echizen","authorsParsed":[["Wang","Hanrui",""],["Chang","Ching-Chun",""],["Lu","Chun-Shien",""],["Echizen","Isao",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 10:23:44 GMT"},{"version":"v2","created":"Fri, 13 Sep 2024 05:21:20 GMT"}],"updateDate":"2024-09-16","timestamp":1721643824000,"abstract":"  Deep learning technology has brought convenience and advanced developments\nbut has become untrustworthy because of its sensitivity to inconspicuous\nperturbations (i.e., adversarial attacks). Attackers may utilize this\nsensitivity to manipulate predictions. To defend against such attacks, we have\ndevised a proactive strategy for \"attacking\" the medias before it is attacked\nby the third party, so that when the protected medias are further attacked, the\nadversarial perturbations are automatically neutralized. This strategy, dubbed\nFast Preemption, provides an efficient transferable preemptive defense by using\ndifferent models for labeling inputs and learning crucial features. A\nforward-backward cascade learning algorithm is used to compute protective\nperturbations, starting with forward propagation optimization to achieve rapid\nconvergence, followed by iterative backward propagation learning to alleviate\noverfitting. This strategy offers state-of-the-art transferability and\nprotection across various systems. With the running of only three steps, our\nFast Preemption framework outperforms benchmark training-time, test-time, and\npreemptive adversarial defenses. We have also devised the first to our\nknowledge effective white-box adaptive reversion attack and demonstrate that\nthe protection added by our defense strategy is irreversible unless the\nbackbone model, algorithm, and settings are fully compromised. This work\nprovides a new direction to developing proactive defenses against adversarial\nattacks. The proposed methodology will be made available on GitHub.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"Mde0ajNgBnHFNnnw9-GXvSg3op--xlAhkSpbpabIzX4","pdfSize":"6293169"}