{"id":"2407.08890","title":"DeepCodeProbe: Towards Understanding What Models Trained on Code Learn","authors":"Vahid Majdinasab, Amin Nikanjam, Foutse Khomh","authorsParsed":[["Majdinasab","Vahid",""],["Nikanjam","Amin",""],["Khomh","Foutse",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 23:16:44 GMT"}],"updateDate":"2024-07-15","timestamp":1720739804000,"abstract":"  Machine learning models trained on code and related artifacts offer valuable\nsupport for software maintenance but suffer from interpretability issues due to\ntheir complex internal variables. These concerns are particularly significant\nin safety-critical applications where the models' decision-making processes\nmust be reliable. The specific features and representations learned by these\nmodels remain unclear, adding to the hesitancy in adopting them widely. To\naddress these challenges, we introduce DeepCodeProbe, a probing approach that\nexamines the syntax and representation learning abilities of ML models designed\nfor software maintenance tasks. Our study applies DeepCodeProbe to\nstate-of-the-art models for code clone detection, code summarization, and\ncomment generation. Findings reveal that while small models capture abstract\nsyntactic representations, their ability to fully grasp programming language\nsyntax is limited. Increasing model capacity improves syntax learning but\nintroduces trade-offs such as increased training time and overfitting.\nDeepCodeProbe also identifies specific code patterns the models learn from\ntheir training data. Additionally, we provide best practices for training\nmodels on code to enhance performance and interpretability, supported by an\nopen-source replication package for broader application of DeepCodeProbe in\ninterpreting other code-related models.\n","subjects":["Computing Research Repository/Software Engineering","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"skKmOtzf_un5TJ3cWqDqNQGost4SVbAKnU0y976TxdE","pdfSize":"1480663"}