{"id":"2407.15318","title":"Modified Bat Algorithm: A Newly Proposed Approach for Solving Complex\n  and Real-World Problems","authors":"Shahla U. Umar, Tarik A. Rashid, Aram M. Ahmed, Bryar A. Hassan,\n  Mohammed Rashad Baker","authorsParsed":[["Umar","Shahla U.",""],["Rashid","Tarik A.",""],["Ahmed","Aram M.",""],["Hassan","Bryar A.",""],["Baker","Mohammed Rashad",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 09:25:07 GMT"}],"updateDate":"2024-07-23","timestamp":1720257907000,"abstract":"  Bat Algorithm (BA) is a nature-inspired metaheuristic search algorithm\ndesigned to efficiently explore complex problem spaces and find near-optimal\nsolutions. The algorithm is inspired by the echolocation behavior of bats,\nwhich acts as a signal system to estimate the distance and hunt prey. Although\nthe BA has proven effective for various optimization problems, it exhibits\nlimited exploration ability and susceptibility to local optima. The algorithm\nupdates velocities and positions based on the current global best solution,\ncausing all agents to converge towards a specific location, potentially leading\nto local optima issues in optimization problems. On this premise, this paper\nproposes the Modified Bat Algorithm (MBA) as an enhancement to address the\nlocal optima limitation observed in the original BA. MBA incorporates the\nfrequency and velocity of the current best solution, enhancing convergence\nspeed to the optimal solution and preventing local optima entrapment. While the\noriginal BA faces diversity issues, both the original BA and MBA are\nintroduced. To assess MBAs performance, three sets of test functions (classical\nbenchmark functions, CEC2005, and CEC2019) are employed, with results compared\nto those of the original BA, Particle Swarm Optimization (PSO), Genetic\nAlgorithm (GA), and Dragonfly Algorithm (DA). The outcomes demonstrate the MBAs\nsignificant superiority over other algorithms. Additionally, MBA successfully\naddresses a real-world assignment problem (call center problem), traditionally\nsolved using linear programming methods, with satisfactory results.\n","subjects":["Computing Research Repository/Neural and Evolutionary Computing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"eNws-cuY5QqJR3NZbDxVSccTxWIwUMD4CSVBbcuCVxg","pdfSize":"760589"}