{"id":"2407.11382","title":"Segment, Lift and Fit: Automatic 3D Shape Labeling from 2D Prompts","authors":"Jianhao Li, Tianyu Sun, Zhongdao Wang, Enze Xie, Bailan Feng, Hongbo\n  Zhang, Ze Yuan, Ke Xu, Jiaheng Liu, and Ping Luo","authorsParsed":[["Li","Jianhao",""],["Sun","Tianyu",""],["Wang","Zhongdao",""],["Xie","Enze",""],["Feng","Bailan",""],["Zhang","Hongbo",""],["Yuan","Ze",""],["Xu","Ke",""],["Liu","Jiaheng",""],["Luo","Ping",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 04:53:28 GMT"},{"version":"v2","created":"Wed, 17 Jul 2024 06:32:53 GMT"}],"updateDate":"2024-07-18","timestamp":1721105608000,"abstract":"  This paper proposes an algorithm for automatically labeling 3D objects from\n2D point or box prompts, especially focusing on applications in autonomous\ndriving. Unlike previous arts, our auto-labeler predicts 3D shapes instead of\nbounding boxes and does not require training on a specific dataset. We propose\na Segment, Lift, and Fit (SLF) paradigm to achieve this goal. Firstly, we\nsegment high-quality instance masks from the prompts using the Segment Anything\nModel (SAM) and transform the remaining problem into predicting 3D shapes from\ngiven 2D masks. Due to the ill-posed nature of this problem, it presents a\nsignificant challenge as multiple 3D shapes can project into an identical mask.\nTo tackle this issue, we then lift 2D masks to 3D forms and employ gradient\ndescent to adjust their poses and shapes until the projections fit the masks\nand the surfaces conform to surrounding LiDAR points. Notably, since we do not\ntrain on a specific dataset, the SLF auto-labeler does not overfit to biased\nannotation patterns in the training set as other methods do. Thus, the\ngeneralization ability across different datasets improves. Experimental results\non the KITTI dataset demonstrate that the SLF auto-labeler produces\nhigh-quality bounding box annotations, achieving an AP@0.5 IoU of nearly 90\\%.\nDetectors trained with the generated pseudo-labels perform nearly as well as\nthose trained with actual ground-truth annotations. Furthermore, the SLF\nauto-labeler shows promising results in detailed shape predictions, providing a\npotential alternative for the occupancy annotation of dynamic objects.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"KdLUYnw9IifIPS7TFeIwJOHic_mUyhAvJFlrUrCTZE0","pdfSize":"1882372"}