{"id":"2407.05469","title":"Smart Camera Parking System With Auto Parking Spot Detection","authors":"Tuan T. Nguyen, Mina Sartipi","authorsParsed":[["Nguyen","Tuan T.",""],["Sartipi","Mina",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 19:00:11 GMT"}],"updateDate":"2024-07-09","timestamp":1720378811000,"abstract":"  Given the rising urban population and the consequential rise in traffic\ncongestion, the implementation of smart parking systems has emerged as a\ncritical matter of concern. Smart parking solutions use cameras, sensors, and\nalgorithms like computer vision to find available parking spaces. This method\nimproves parking place recognition, reduces traffic and pollution, and\noptimizes travel time. In recent years, computer vision-based approaches have\nbeen widely used. However, most existing studies rely on manually labeled\nparking spots, which has implications for the cost and practicality of\nimplementation. To solve this problem, we propose a novel approach PakLoc,\nwhich automatically localize parking spots. Furthermore, we present the PakSke\nmodule, which automatically adjust the rotation and the size of detected\nbounding box. The efficacy of our proposed methodology on the PKLot dataset\nresults in a significant reduction in human labor of 94.25\\%. Another\nfundamental aspect of a smart parking system is its capacity to accurately\ndetermine and indicate the state of parking spots within a parking lot. The\nconventional approach involves employing classification techniques to forecast\nthe condition of parking spots based on the bounding boxes derived from\nmanually labeled grids. In this study, we provide a novel approach called\nPakSta for identifying the state of parking spots automatically. Our method\nutilizes object detector from PakLoc to simultaneously determine the occupancy\nstatus of all parking lots within a video frame. Our proposed method PakSta\nexhibits a competitive performance on the PKLot dataset when compared to other\nclassification methods.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"3iv4OMaArZJ_Yg72w-bnMxwp5KEL7W-3_t5jv6TXoaQ","pdfSize":"4483913"}