{"id":"2407.14851","title":"Observational and theoretical aspects of Superspinars","authors":"Ramon Torres","authorsParsed":[["Torres","Ramon",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 11:36:26 GMT"}],"updateDate":"2024-07-23","timestamp":1721475386000,"abstract":"  This article delves into the observational signatures and theoretical\nunderpinnings of rotating astrophysical objects, with a particular focus on\nsuperspinars -exotic objects characterized by preventing the formation of event\nhorizons due to their high angular momentum.\n  While solutions within General Relativity (Kerr superspinars) predict such\nobjects, their classical forms harbor naked singularities, violate causality,\nand exhibit problematic repulsive gravitational effects. These characteristics\nrender classical superspinars theoretically objectionable, leading to the\nconsideration of them as physically implausible. On the other hand, the\nincompatibility between General Relativity and Quantum Mechanics suggests the\nexploration of alternative models, particularly those in which Quantum Gravity\ndominates the core, yielding regular superspinars.\n  This work demonstrates that regular superspinars avoid all the complications\nassociated with Kerr superspinars. From a phenomenological standpoint, it is\nshown that the silhouettes of regular superspinars are markedly distinct from\nthose of black holes and classical Kerr superspinars. To substantiate these\ndifferences, we perform a comprehensive analysis of inner null geodesics and\ninvestigate the structure of the Planckian region within regular superspinars.\nOur study reveals that only regular superspinars provide the potential for\ndistant observers to directly observe the extremely high curvature regions\nwithin their interiors.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Astrophysics/High Energy Astrophysical Phenomena","Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"jk0sRoAqLSPKJfiFWqHq64apW0KKTo0G-k9j0JYzn7c","pdfSize":"22641566"}