{"id":"2407.15743","title":"Cache-Aided MIMO Communications: DoF Analysis and Transmitter\n  Optimization","authors":"Mohammad NaseriTehrani, MohammadJavad Salehi, and Antti T\\\"olli","authorsParsed":[["NaseriTehrani","Mohammad",""],["Salehi","MohammadJavad",""],["Tölli","Antti",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 15:42:59 GMT"},{"version":"v2","created":"Tue, 13 Aug 2024 13:56:14 GMT"}],"updateDate":"2024-08-14","timestamp":1721662979000,"abstract":"  Cache-aided MIMO communications aims to jointly exploit both coded\ncaching~(CC) and spatial multiplexing gains to enhance communication\nefficiency. In this paper, we first analyze the achievable degrees of\nfreedom~(DoF) in a MIMO-CC system with CC gain \\(t\\), where a server with \\(L\\)\ntransmit antennas communicates with \\(K\\) users, each equipped with \\(G\\)\nreceive antennas. We demonstrate that the enhanced achievable DoF is\n\\(\\max_{\\beta, \\Omega} \\Omega \\beta\\), where the number of users \\(\\Omega\\)\nserved in each transmission is fine-tuned to maximize DoF, and \\(\\beta \\le\n\\min\\big(G, \\nicefrac{L \\binom{\\Omega-1}{t}}{1 + (\\Omega - t -\n1)\\binom{\\Omega-1}{t}}\\big)\\) represents the number of parallel streams decoded\nby each user. Second, we introduce an effective transmit covariance matrix\ndesign aimed at maximizing the symmetric rate, solved iteratively via\nsuccessive convex approximation. Third, we propose a new class of MIMO-CC\nschemes using a novel scheduling mechanism leveraging maximal multicasting\nopportunities to maximize delivery rates at given SNR levels while adhering to\nlinear processing constraints. Lastly, we devise linear multicast beamforming\nstrategies tailored for the flexible scheduling schemes in MIMO-CC systems and\npresent an iterative solution for the efficient design of beamformers.\nExtensive numerical simulations are used to verify the results of the paper.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"-s8kLqCcyk25gmaP2MFK8WDCTcbJdmqdrqvzIEbXjxA","pdfSize":"1008518"}