{"id":"2407.16739","title":"Forecasting Automotive Supply Chain Shortfalls with Heterogeneous Time\n  Series","authors":"Bach Viet Do, Xingyu Li, Chaoye Pan, Oleg Gusikhin","authorsParsed":[["Do","Bach Viet",""],["Li","Xingyu",""],["Pan","Chaoye",""],["Gusikhin","Oleg",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 17:28:10 GMT"},{"version":"v2","created":"Fri, 26 Jul 2024 17:59:02 GMT"}],"updateDate":"2024-07-30","timestamp":1721755690000,"abstract":"  Operational disruptions can significantly impact companies performance. Ford,\nwith its 37 plants globally, uses 17 billion parts annually to manufacture six\nmillion cars and trucks. With up to ten tiers of suppliers between the company\nand raw materials, any extended disruption in this supply chain can cause\nsubstantial financial losses. Therefore, the ability to forecast and identify\nsuch disruptions early is crucial for maintaining seamless operations. In this\nstudy, we demonstrate how we construct a dataset consisting of many\nmultivariate time series to forecast first-tier supply chain disruptions,\nutilizing features related to capacity, inventory, utilization, and processing,\nas outlined in the classical Factory Physics framework. This dataset is\ntechnically challenging due to its vast scale of over five hundred thousand\ntime series. Furthermore, these time series, while exhibiting certain\nsimilarities, also display heterogeneity within specific subgroups. To address\nthese challenges, we propose a novel methodology that integrates an enhanced\nAttention Sequence to Sequence Deep Learning architecture, using Neural Network\nEmbeddings to model group effects, with a Survival Analysis model. This model\nis designed to learn intricate heterogeneous data patterns related to\noperational disruptions. Our model has demonstrated a strong performance,\nachieving 0.85 precision and 0.8 recall during the Quality Assurance (QA) phase\nacross Ford's five North American plants. Additionally, to address the common\ncriticism of Machine Learning models as black boxes, we show how the SHAP\nframework can be used to generate feature importance from the model\npredictions. It offers valuable insights that can lead to actionable strategies\nand highlights the potential of advanced machine learning for managing and\nmitigating supply chain risks in the automotive industry.\n","subjects":["Statistics/Machine Learning","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"iU2HVb4uMw0O9TF67QocgJjQ52yEqj63Zte2eqB5NgM","pdfSize":"309130"}