{"id":"2407.18363","title":"KI-Bilder und die Widerst\\\"andigkeit der Medienkonvergenz: Von\n  prim\\\"arer zu sekund\\\"arer Intermedialit\\\"at?","authors":"Lukas R.A. Wilde","authorsParsed":[["Wilde","Lukas R. A.",""]],"versions":[{"version":"v1","created":"Fri, 21 Jun 2024 09:15:19 GMT"}],"updateDate":"2024-07-29","timestamp":1718961319000,"abstract":"  The article presents some current observations (as of April 10, 2024) on the\nintegration of AI-generated images within processes of media convergence. It\ndraws on two different concepts of intermediality. Primary intermediality\nconcepts are motivated by the object when a new type of technology develops the\npotential to become socially relevant as a media form and thus a socially,\npolitically, or culturally important communicative factor. Due to their\nuncertain 'measurements' within the wider media ecology, however, the new,\nstill potential media form appears hybrid. The \"inter-\" or \"between-\" of this\ninitial intermediality moment thus refers to the questionable \"site\" and the\nquestionable description of the potential media form between already existing\ntechnologies and cultural forms and their conceptual measurements. For\nsecondary concepts of intermediality, in contrast, it can be assumed that the\nboundaries of media forms and their application have already been drawn and are\nreasonably undisputed. This then raises the question of intentional and staged\nreferences to AI imagery within other media forms and pictures. The article\ndiscusses indicators of both intermediality moments using current examples and\ncontroversies surrounding AI images. The thesis is that there can be no talk of\na seamless 'integration' of AI images into the wider media landscape at the\nmoment (within films, comic books, or video games, for example) - as one of\ncountless other image production techniques - and that the medial 'site' of AI\nimage circulation - at least where it is not a matter of deception, but rather\ntheir conscious use as AI images - especially in social media communication and\nin fan cultures, but with repercussions for the more general media ecology and\nimage interpretation, insofar as the suspicion that an image could be\nAI-generated is now increasingly present as a \"hermeneutics of suspicion\".\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Multimedia"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"5M5TklC5op9iTv6iFoZoWfxKiJOIjc68eqpgWGqw62I","pdfSize":"1098874"}