{"id":"2407.14725","title":"CrowdMAC: Masked Crowd Density Completion for Robust Crowd Density\n  Forecasting","authors":"Ryo Fujii, Ryo Hachiuma, Hideo Saito","authorsParsed":[["Fujii","Ryo",""],["Hachiuma","Ryo",""],["Saito","Hideo",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 02:18:43 GMT"}],"updateDate":"2024-07-23","timestamp":1721441923000,"abstract":"  A crowd density forecasting task aims to predict how the crowd density map\nwill change in the future from observed past crowd density maps. However, the\npast crowd density maps are often incomplete due to the miss-detection of\npedestrians, and it is crucial to develop a robust crowd density forecasting\nmodel against the miss-detection. This paper presents a MAsked crowd density\nCompletion framework for crowd density forecasting (CrowdMAC), which is\nsimultaneously trained to forecast future crowd density maps from partially\nmasked past crowd density maps (i.e., forecasting maps from past maps with\nmiss-detection) while reconstructing the masked observation maps (i.e.,\nimputing past maps with miss-detection). Additionally, we propose\nTemporal-Density-aware Masking (TDM), which non-uniformly masks tokens in the\nobserved crowd density map, considering the sparsity of the crowd density maps\nand the informativeness of the subsequent frames for the forecasting task.\nMoreover, we introduce multi-task masking to enhance training efficiency. In\nthe experiments, CrowdMAC achieves state-of-the-art performance on seven\nlarge-scale datasets, including SDD, ETH-UCY, inD, JRDB, VSCrowd, FDST, and\ncroHD. We also demonstrate the robustness of the proposed method against both\nsynthetic and realistic miss-detections.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"g9ICu1toVLv29UHM0SQa5qMESbQlZ9XHp6y1zEcDQys","pdfSize":"13823854"}