{"id":"2407.11578","title":"UP-Diff: Latent Diffusion Model for Remote Sensing Urban Prediction","authors":"Zeyu Wang, Zecheng Hao, Jingyu Lin, Yuchao Feng, and Yufei Guo","authorsParsed":[["Wang","Zeyu",""],["Hao","Zecheng",""],["Lin","Jingyu",""],["Feng","Yuchao",""],["Guo","Yufei",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 10:40:21 GMT"},{"version":"v2","created":"Wed, 17 Jul 2024 03:47:08 GMT"}],"updateDate":"2024-07-18","timestamp":1721126421000,"abstract":"  This study introduces a novel Remote Sensing (RS) Urban Prediction (UP) task\nfocused on future urban planning, which aims to forecast urban layouts by\nutilizing information from existing urban layouts and planned change maps. To\naddress the proposed RS UP task, we propose UP-Diff, which leverages a Latent\nDiffusion Model (LDM) to capture positionaware embeddings of pre-change urban\nlayouts and planned change maps. In specific, the trainable cross-attention\nlayers within UP-Diff's iterative diffusion modules enable the model to\ndynamically highlight crucial regions for targeted modifications. By utilizing\nour UP-Diff, designers can effectively refine and adjust future urban city\nplans by making modifications to the change maps in a dynamic and adaptive\nmanner. Compared with conventional RS Change Detection (CD) methods, the\nproposed UP-Diff for the RS UP task avoids the requirement of paired prechange\nand post-change images, which enhances the practical usage in city development.\nExperimental results on LEVIRCD and SYSU-CD datasets show UP-Diff's ability to\naccurately predict future urban layouts with high fidelity, demonstrating its\npotential for urban planning. Code and model weights are available at\nhttps://github.com/zeyuwang-zju/UP-Diff.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"izrvhnrThw3_4jnglbY3NBvsj_UOhcGXcXKuF-ZRwOI","pdfSize":"1251061"}