{"id":"2407.11706","title":"Tracking Advanced Planetary Systems (TAPAS) with HARPS-N VIII. A\n  wide-orbit planetary companion in the hot-Jupiter system HD 118203","authors":"G. Maciejewski, A. Niedzielski, K. Gozdziewski, A. Wolszczan, E.\n  Villaver, M. Fernandez, M. Adamow, J. Sierzputowska","authorsParsed":[["Maciejewski","G.",""],["Niedzielski","A.",""],["Gozdziewski","K.",""],["Wolszczan","A.",""],["Villaver","E.",""],["Fernandez","M.",""],["Adamow","M.",""],["Sierzputowska","J.",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 13:25:33 GMT"}],"updateDate":"2024-07-17","timestamp":1721136333000,"abstract":"  The star HD 118203, classified as a K0 subgiant, was known to harbour a\ntransiting hot Jupiter planet on a 6.1-day eccentric orbit. Previous studies\nalso revealed a linear trend in the radial velocity (RV) domain, indicative of\na companion on a wide orbit. Such a hierarchical orbital architecture could be\nhelpful in studies of the origins of hot Jupiters. We acquired precise RV\nmeasurements over 17 years using the 9.2 m Hobby-Eberly Telescope and the 3.6 m\nTelescopio Nazionale Galileo. Combining these observations with space-born\nphotometric time series from the Transiting Exoplanet Survey Satellite, we\nconstructed a two-planetary model for the system. Astrometric observations from\nHipparcos and Gaia were used to constrain the orbital inclination of the\nwide-orbit companion and its mass. Numerical simulations were used to\ninvestigate the dynamics of the system. The photometric data were searched for\nadditional transit-like flux drops. We found that the additional companion is\nan 11-Jupiter mass planet orbiting HD 118203 on a 14-year moderately eccentric\norbit, constituting a hierarchical planetary system with the hot Jupiter. Both\nplanets were found to be dynamically decoupled mainly due to the general\nrelativistic apsidal precession of the inner planet, marginalising secular\ninteractions. The orbits of both planets might have a relatively low mutual\ninclination unless the longitudes of the ascending node differ substantially.\nThis configuration favours the coplanar high-eccentricity migration as a path\nto the present-day orbital configuration. No other transiting planets with\nradii down to 2 Earth radii and orbital periods less than 100 days were found\nin the system.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"o0ad1eUcVMBBhRXTFHN3fPRXspNsdYhkjQTPZNR3r5I","pdfSize":"4668379"}