{"id":"2407.14977","title":"Multifractal analysis of racially-constrained population patterns and\n  residential segregation in the US cities","authors":"Tomasz F. Stepinski and Anna Dmowska","authorsParsed":[["Stepinski","Tomasz F.",""],["Dmowska","Anna",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 20:43:38 GMT"}],"updateDate":"2024-07-23","timestamp":1721508218000,"abstract":"  A phenomenon of racial segregation in U.S. cities is a multifaceted area of\nstudy. A recent advancement in this field is the development of a methodology\nthat transforms census population count-by-race data into a grid of monoracial\ncells. This format enables assessment of heterogeneity of segregation within a\ncity. This paper leverages such a grid for the quantification of\nrace-constrained population patterns, allowing for the calculation and mapping\nof binary segregation patterns within arbitrary region. A key innovation is the\napplication of Multifractal Analysis (MFA) to quantify the residency patterns\nof race-constrained populations. The residency pattern is characterized by a\nmultifractal spectrum function, where the independent variable is a local\nmetric of pattern's \"gappiness\", and the dependent variable is proportional to\nthe size of the sub-pattern consisting of all locations having the same value\nof this metric. In the context of binary populations, the gappiness of the\nrace-constrained population's pattern is intrinsically linked to its\nsegregation. This paper provides a comprehensive description of the\nmethodology, illustrated with examples focusing on the residency pattern of\nBlack population in the central region of Washington, DC. Further, the\nmethodology is demonstrated using a sample of residency patterns of Black\npopulation in fourteen large U.S. cities. By numerically describing each\npattern through a multifractal spectrum, the fourteen patterns are clustered\ninto three distinct categories, each having unique characteristics. Maps of\nlocal gappiness and segregation for each city are provided to show the\nconnection between the nature of the multifractal spectrum and the\ncorresponding residency and segregation patterns. This method offers an\nexcellent quantification of race-restricted residency and residential\nsegregation patterns within U.S. cities.\n","subjects":["Physics/Physics and Society"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"8OKSQWITlV-L4kLvHNR7y8WkGc2ixL9yHOSLSrswW-U","pdfSize":"1059704"}