{"id":"2407.07081","title":"Pathways to Interstellar Amides via Carbamoyl (NH2CO) Isomers by\n  Radical-Neutral Reactions on Ice Grain Mantles","authors":"Gabriela Silva-Vera, Giulia M. Bovolenta, Namrata Rani, Sebastian\n  Vera, and Stefan Vogt-Geisse","authorsParsed":[["Silva-Vera","Gabriela",""],["Bovolenta","Giulia M.",""],["Rani","Namrata",""],["Vera","Sebastian",""],["Vogt-Geisse","Stefan",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 17:51:45 GMT"}],"updateDate":"2024-07-10","timestamp":1720547505000,"abstract":"  Explaining the formation pathways of amides on ice-grain mantels is crucial\nto understanding the prebiotic chemistry in an interstellar medium. In this\ncomputational study, we explore different radical-neutral formation pathways\nfor some of the observed amides (formamide, acetamide, urea, and\nN-methylformamide) via intermediate carbamoyl (NH2CO) radical precursors and\ntheir isomers. We assess the relative energy of four NH2CO isomers in the gas\nphase and evaluate their binding energy on small water clusters to discern the\naffinity that the isomers present to an ice model. We consider three possible\nreaction pathways for the formation of the carbamoyl radicals, namely, the OH +\nHCN, CN + H2O, and NH2 + CO reaction channels. We computed the binding energy\ndistribution for the HCN and CH3CN precursors on an ice model consisting of a\nset of clusters of 22 water molecules each to serve as a starting point for the\nreactivity study on the ice surface. The computations revealed that the lowest\nbarrier to the formation of an NH2CO isomer corresponds to the NH2 + CO\nreaction (12.6 kJ/mol). The OH + HCN reaction pathway results in the exothermic\nformation of the N-radical form of carbamoyl HN(C=O)H with a reaction barrier\nof 26.7 kJ/mol. We found that the CN + H2O reaction displays a high energy\nbarrier of 70.6 kJ/mol. Finally, we also probed the direct formation of the\nacetamide radical precursor via the OH + CH3CN reaction and found that the most\nprobable outcome on interstellar ices is the H-abstraction reaction to yield\nCH2CN and H2O. Based on these results, we believe that including alternative\nreaction pathways, leading to the formation of amides via the N-radical form of\ncarbamoyl, would provide an improvement in the prediction of the amide\nabundances in astrochemical models, especially regarding the chemistry of\nstar-forming regions.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"RfE8wxtg5tlFHNIlIIshc01oq44fDqZp3uJclg5Pc5g","pdfSize":"7320458"}