{"id":"2407.01282","title":"Data After Death: Australian User Preferences and Future Solutions to\n  Protect Posthumous User Data","authors":"Andrew Reeves, Arash Shaghaghi, Shiri Krebs, Debi Ashenden","authorsParsed":[["Reeves","Andrew",""],["Shaghaghi","Arash",""],["Krebs","Shiri",""],["Ashenden","Debi",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 13:38:45 GMT"}],"updateDate":"2024-07-02","timestamp":1719841125000,"abstract":"  The digital footprints of today's internet-active individuals are a testament\nto their lives, and have the potential to become digital legacies once they\npass on. Future descendants of those alive today will greatly appreciate the\nunprecedented insight into the lives of their long since deceased ancestors,\nbut this can only occur if today we have a process for data preservation and\nhandover after death. Many prominent online platforms offer nebulous or\naltogether absent policies regarding posthumous data handling, and despite\nrecent advances it is currently unclear who the average Australian would like\ntheir data to be managed after their death (i.e., social media platforms, a\ntrusted individual, or another digital executor). While at present the\nmanagement of deceased accounts is largely performed by the platform (e.g.,\nFacebook), it is conceivable that many Australians may not trust such platforms\nto do so with integrity. This study aims to further the academic conversation\naround posthumous data by delving deeper into the preferences of the Australian\nPublic regarding the management of their data after death, ultimately to inform\nfuture development of research programs and industry solutions. A survey of\n1020 Australians revealed that most desired a level of control over how their\ndata is managed after death. Australians currently prefer to entrust the\nmanagement of their data to a trusted close individual or third party software\nthat they can administrate themselves. As expected, social media companies\nranked low regarding both trust and convenience to manage data after death.\nFuture research focus should be to conceptualise and develop a third-party\nsolution that enables these preferences to be realised. Such a solution could\ninterface with the major online vendors (social media, cloud hosting etc.) to\naction the deceased's will.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"QsHTOVi-DjujyV1splV7wX-eUQ9GOzdJqNn0zDkjOig","pdfSize":"700914"}