{"id":"2407.18396","title":"Galaxy Mergers in UNIONS -- I: A Simulation-driven Hybrid Deep Learning\n  Ensemble for Pure Galaxy Merger Classification","authors":"Leonardo Ferreira, Robert W. Bickley, Sara L. Ellison, David R.\n  Patton, Shoshannah Byrne-Mamahit, Scott Wilkinson, Connor Bottrell,\n  S\\'ebastien Fabbro, Stephen D. J. Gwyn, Alan McConnachie","authorsParsed":[["Ferreira","Leonardo",""],["Bickley","Robert W.",""],["Ellison","Sara L.",""],["Patton","David R.",""],["Byrne-Mamahit","Shoshannah",""],["Wilkinson","Scott",""],["Bottrell","Connor",""],["Fabbro","Sébastien",""],["Gwyn","Stephen D. J.",""],["McConnachie","Alan",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 21:03:13 GMT"}],"updateDate":"2024-07-29","timestamp":1721941393000,"abstract":"  Merging and interactions can radically transform galaxies. However,\nidentifying these events based solely on structure is challenging as the status\nof observed mergers is not easily accessible. Fortunately, cosmological\nsimulations are now able to produce more realistic galaxy morphologies,\nallowing us to directly trace galaxy transformation throughout the merger\nsequence. To advance the potential of observational analysis closer to what is\npossible in simulations, we introduce a supervised deep learning Convolutional\nNeural Network (CNN) and Vision Transformer (ViT) hybrid framework, Mummi\n(MUlti Model Merger Identifier). Mummi is trained on realism-added synthetic\ndata from IllustrisTNG100-1, and is comprised of a multi-step ensemble of\nmodels to identify mergers and non-mergers, and to subsequently classify the\nmergers as interacting pairs or post-mergers. To train this ensemble of models,\nwe generate a large imaging dataset of 6.4 million images targeting UNIONS with\nRealSimCFIS. We show that Mummi offers a significant improvement over many\nprevious machine learning classifiers, achieving 95% pure classifications even\nat Gyr long timescales when using a jury-based decision making process,\nmitigating class imbalance issues that arise when identifying real galaxy\nmergers from $z=0$ to $0.3$. Additionally, we can divide the identified mergers\ninto pairs and post-mergers at 96% success rate. We drastically decrease the\nfalse positive rate in galaxy merger samples by 75%. By applying Mummi to the\nUNIONS DR5-SDSS DR7 overlap, we report a catalog of 13,448 high confidence\ngalaxy merger candidates. Finally, we demonstrate that Mummi produces powerful\nrepresentations solely using supervised learning, which can be used to bridge\ngalaxy morphologies in simulations and observations.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ntXV4fUvloGrA_FOpjwDSJ4nOk3Ify8uYRcYeE8np5Q","pdfSize":"29919838"}