{"id":"2407.12565","title":"SigDLA: A Deep Learning Accelerator Extension for Signal Processing","authors":"Fangfa Fu, Wenyu Zhang, Zesong Jiang, Zhiyu Zhu, Guoyu Li, Bing Yang,\n  Cheng Liu, Liyi Xiao, Jinxiang Wang, Huawei Li, Xiaowei Li","authorsParsed":[["Fu","Fangfa",""],["Zhang","Wenyu",""],["Jiang","Zesong",""],["Zhu","Zhiyu",""],["Li","Guoyu",""],["Yang","Bing",""],["Liu","Cheng",""],["Xiao","Liyi",""],["Wang","Jinxiang",""],["Li","Huawei",""],["Li","Xiaowei",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 13:48:07 GMT"}],"updateDate":"2024-07-18","timestamp":1721224087000,"abstract":"  Deep learning and signal processing are closely correlated in many IoT\nscenarios such as anomaly detection to empower intelligence of things. Many IoT\nprocessors utilize digital signal processors (DSPs) for signal processing and\nbuild deep learning frameworks on this basis. While deep learning is usually\nmuch more computing-intensive than signal processing, the computing efficiency\nof deep learning on DSPs is limited due to the lack of native hardware support.\nIn this case, we present a contrary strategy and propose to enable signal\nprocessing on top of a classical deep learning accelerator (DLA). With the\nobservation that irregular data patterns such as butterfly operations in FFT\nare the major barrier that hinders the deployment of signal processing on DLAs,\nwe propose a programmable data shuffling fabric and have it inserted between\nthe input buffer and computing array of DLAs such that the irregular data is\nreorganized and the processing is converted to be regular. With the online data\nshuffling, the proposed architecture, SigDLA, can adapt to various signal\nprocessing tasks without affecting the deep learning processing. Moreover, we\nbuild a reconfigurable computing array to suit the various data width\nrequirements of both signal processing and deep learning. According to our\nexperiments, SigDLA achieves an average performance speedup of 4.4$\\times$,\n1.4$\\times$, and 1.52$\\times$, and average energy reduction of 4.82$\\times$,\n3.27$\\times$, and 2.15$\\times$ compared to an embedded ARM processor with\ncustomized DSP instructions, a DSP processor, and an independent DSP-DLA\narchitecture respectively with 17% more chip area over the original DLAs.\n","subjects":["Computing Research Repository/Hardware Architecture"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"S64BW2hKGOYrtiAdaqoJh19N6pLr9ZIHWnBbvQ5lNIM","pdfSize":"3702366"}