{"id":"2407.01807","title":"Internodal excitonic state in a Weyl semimetal in a strong magnetic\n  field","authors":"Ren\\'e C\\^ot\\'e, Gautier D. Duchesne and Santiago F. Lopez","authorsParsed":[["Côté","René",""],["Duchesne","Gautier D.",""],["Lopez","Santiago F.",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 21:11:54 GMT"}],"updateDate":"2024-07-03","timestamp":1719868314000,"abstract":"  The simplest Weyl semimetal with broken time-reversal symmetry consists of a\npair of Weyl nodes located at wave vectors $\\mathbf{K}_{\\tau }=\\tau \\mathbf{b}$\nin momentum space with $\\tau =\\pm 1$ the node index and chirality. The\nelectronic dispersion near each node is linear. In a magnetic field\n$\\mathbf{B}$ along $\\mathbf{b}$, this dispersion is modified into a series of\npositive and negative energy Landau levels $n=\\pm 1,\\pm 2,\\ldots ,$which\ndisperse along the direction of the magnetic field, and a chiral Landau level,\n$n=0$, with a linear dispersion given by $e_{\\tau ,n=0}\\left( k_{z}\\right)\n=-\\tau \\hslash v_{F}k_{z},$ where $k_{z}$ is the component of the wave vector\n$\\mathbf{k}$ along the magnetic field and $v_{F}$ is the Fermi velocity. In the\nextreme quantum limit, the Fermi level is in the chiral levels near the Dirac\npoint. When Coulomb interaction is considered, a Weyl semimetal may be unstable\ntowards the formation of a condensate of internodal electron-hole pairs. In\nthis article we use the full long-range Coulomb interaction and the\nself-consistent Hartree-Fock approximation to generate the condensed state. We\nstudy its stability with respect to a change in the Fermi velocity, doping and\nstrength of the Coulomb interaction and also consider Weyl nodes with higher\nChern number $C=2,3$. We derive the response functions of the excitonic state\nin the generalized random-phase approximation (GRPA). We show that, in the\nmean-field gap induced by the internodal coherence, there is, in the GRPA\nexcitonic response, a series of bound electron-hole states with a binding\nenergy that decreases until the Hartree-Fock energy gap is reached. In\naddition, there is a collective mode gapped at exactly the plasmon frequency:\nthe gapless mode present in the proper excitonic response function is pushed to\nthe plasmon frequency by the long-range Coulomb interaction.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"2ydmhCSlz_NsenbPGrF3Q7KkyEP0wBVRvGU_qQw9Q4Y","pdfSize":"679583"}