{"id":"2407.21537","title":"Modelling competition for space: Emergent inefficiency and inequality\n  due to spatial self-organization among a group of crowd-avoiding agents","authors":"Ann Mary Mathew and V Sasidevan","authorsParsed":[["Mathew","Ann Mary",""],["Sasidevan","V",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 11:52:14 GMT"}],"updateDate":"2024-08-01","timestamp":1722426734000,"abstract":"  Competition for a limited resource is the hallmark of many complex systems,\nand often, that resource turns out to be the physical space itself. In this\nwork, we study a novel model designed to elucidate the dynamics and emergence\nin complex adaptive systems in which agents compete for some spatially spread\nresource. Specifically, in the model, the dynamics result from the agents\ntrying to position themselves in the quest to avoid physical crowding\nexperienced locally. We characterize in detail the dependence of the emergent\nbehavior of the model on the population density of the system and the\nindividual-level agent traits such as the extent of space an agent considers as\nher neighborhood, the limit of occupation density one tolerates within that\nneighborhood, and the information accessibility of the agents about\nneighborhood occupancy. We show that the efficiency with which the agents\nutilize the physical space shows transitions at two values of densities. The\nfirst of these transitions demarcates efficient and inefficient phases of the\nsystem, and the second one signifies the density at which the inefficiency is\nmaximum. We show that the variation of inefficiency with respect to the\ninformation accessible to the agents shows opposing behavior above and below\nthis second transition density. We also look into the inequality of resource\nsharing in the model and show that although inefficiency can be a non-monotonic\nfunction of information depending upon the parameters of the model, inequality,\nin general, decreases with information. Our study sheds light on the role of\ncompetition, spatial constraints, and agent traits within complex adaptive\nsystems, offering insights into their emergent behaviors.\n","subjects":["Physics/Physics and Society","Condensed Matter/Statistical Mechanics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"qFJ6LJ7wI3iFh_xFXvn-VxQMvei6omIEDz9GyL_LuAw","pdfSize":"1780189"}