{"id":"2407.06180","title":"Coherent Acoustic Phonons in Plasmonic Nanoparticles: Elastic Properties\n  and Dissipation at Low Temperatures","authors":"Hilario D. Boggiano (1), Thomas Possmayer (2), Luis Morguet (2), Lin\n  Nan (2), Luca Sortino (2), Stefan A. Maier (3,4), Emiliano Cort\\'es (2),\n  Gustavo Grinblat (1,5), Andrea V. Bragas (1,5), Leonardo de S. Menezes (2,6)\n  ((1) Universidad de Buenos Aires, Facultad de Ciencias Exactas y Naturales,\n  Departamento de F\\'isica, Buenos Aires, Argentina, (2) Chair in Hybrid\n  Nanosystems, Nanoinstitute Munich, Faculty of Physics,\n  Ludwig-Maximilians-Universit\\\"at M\\\"unchen, M\\\"unchen, Germany, (3) School of\n  Physics and Astronomy, Monash University, Clayton, Victoria, Australia, (4)\n  Department of Physics, Imperial College London, London, U.K., (5) CONICET -\n  Universidad de Buenos Aires, Instituto de F\\'isica de Buenos Aires (IFIBA),\n  Buenos Aires, Argentina, (6) Departamento de F\\'isica, Universidade Federal\n  de Pernambuco, Recife, Brazil)","authorsParsed":[["Boggiano","Hilario D.",""],["Possmayer","Thomas",""],["Morguet","Luis",""],["Nan","Lin",""],["Sortino","Luca",""],["Maier","Stefan A.",""],["Cortés","Emiliano",""],["Grinblat","Gustavo",""],["Bragas","Andrea V.",""],["Menezes","Leonardo de S.",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 17:53:32 GMT"}],"updateDate":"2024-07-09","timestamp":1720461212000,"abstract":"  We studied the frequency and quality factor of mechanical plasmonic\nnanoresonators as a function of temperature, ranging from ambient to 4 K. Our\ninvestigation focused on individual gold nanorods and nanodisks of various\nsizes. We observed that oscillation frequencies increase linearly as\ntemperature decreases until saturation is reached at cryogenic temperatures.\nThis behavior is explained by the temperature dependence of the elastic\nmodulus, with a Debye temperature compatible with reported bulk values for\ngold. To describe the behavior of the quality factor, we developed a model\nconsidering the nanostructures as anelastic solids, identifying a dissipation\npeak around 150 K due to a thermally activated process, likely of the\nNiblett-Wilks mechanism type. Importantly, our findings suggest that external\ndissipation factors are more critical to improving quality factors than\ninternal friction, which can be increased by modifying the nanoresonator's\nenvironment. Our results enable the design of structures with high vibration\nfrequencies and quality factors by effectively controlling external losses.\n","subjects":["Physics/Optics","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"zQsilU0FUIJjdqHUQxUjkYZDPBSp76yWdjejWHGWQ98","pdfSize":"9157395"}
