{"id":"2407.10371","title":"The Silent Curriculum: How Does LLM Monoculture Shape Educational\n  Content and Its Accessibility?","authors":"Aman Priyanshu and Supriti Vijay","authorsParsed":[["Priyanshu","Aman",""],["Vijay","Supriti",""]],"versions":[{"version":"v1","created":"Sat, 11 May 2024 12:02:44 GMT"}],"updateDate":"2024-07-16","timestamp":1715428964000,"abstract":"  As Large Language Models (LLMs) ascend in popularity, offering information\nwith unprecedented convenience compared to traditional search engines, we delve\ninto the intriguing possibility that a new, singular perspective is being\npropagated. We call this the \"Silent Curriculum,\" where our focus shifts\ntowards a particularly impressionable demographic: children, who are drawn to\nthe ease and immediacy of acquiring knowledge through these digital oracles. In\nthis exploration, we delve into the sociocultural ramifications of LLMs, which,\nthrough their nuanced responses, may be subtly etching their own stereotypes,\nan algorithmic or AI monoculture. We hypothesize that the convergence of\npre-training data, fine-tuning datasets, and analogous guardrails across models\nmay have birthed a distinct cultural lens. We unpack this concept through a\nshort experiment navigating children's storytelling, occupational-ethnic\nbiases, and self-diagnosed annotations, to find that there exists strong cosine\nsimilarity (0.87) of biases across these models, suggesting a similar\nperspective of ethnic stereotypes in occupations. This paper invites a\nreimagining of LLMs' societal role, especially as the new information\ngatekeepers, advocating for a paradigm shift towards diversity-rich landscapes\nover unintended monocultures.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"b7vRgaFqsDEe-21vKwW2I2Xt2pHRiBv1hG_wAZRmHHc","pdfSize":"306571","objectId":"0xaef8be329dc40bfe2a32476c7886ce66cea66a06c484245be02dabca2622e84d","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
