{"id":"2407.02312","title":"Dynamics and solar wind control of the recovery of strong geomagnetic\n  storms","authors":"O. Ahmed, B. Badruddin, M. Derouich","authorsParsed":[["Ahmed","O.",""],["Badruddin","B.",""],["Derouich","M.",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 14:45:46 GMT"}],"updateDate":"2024-07-03","timestamp":1719931546000,"abstract":"  In this work, we studied the characteristics and dynamical changes during the\nrecovery time of moderate and strong geomagnetic storms (Dst $<-50$ nT).\nInvestigating 57 storms triggered by CMEs/CIRs, we focused on the solar wind's\ninfluence on their decay phases. Selected storms were classified into distinct\ngroups based on their recovery characteristics. Using superposed epoch analysis\nand best fit methods, we scrutinized several interplanetary solar wind plasma\nand field parameters/functions. The analysis included single, dual, and\nmultiple interplanetary plasma and field parameters/functions. We determined\nthe most representative characteristic time for the storm's recovery profile by\nfitting an exponential curve. A correlation analysis between Dst and solar wind\nparameters/functions isolated a coupling function ($\\rho^{1/2}$Ey) best\ndescribing the decay rate of the ring current. This shows that the electric\nfield term (Ey) coupled with a viscous term ($\\rho^{1/2}$) plays a pivotal role\nin determining the recovery rate of geomagnetic storms. Additionally, we\nmodeled the complex patterns of Dst recovery in relation to solar wind\nparameters/functions using a second-order polynomial. During the recovery\nphase, a dynamic correlation between Dst and solar wind parameters/functions\nwas revealed. The three-parameter solar wind-magnetosphere electrodynamical\ncoupling function, combining the viscous term ($\\rho^{1/2}$) and the electric\nfield-related function (v$^{4/3}$B) ($\\rho^{1/2}$v$^{4/3}$B), significantly\nimpacts the recovery phase of geomagnetic disturbances. Our investigation\nextended to the relationship between main and recovery phase durations,\nproviding valuable insights into the solar wind's control over the decay of\ngeomagnetic disturbances. These findings advance our comprehension of the\ncomplex relationship between solar wind dynamics and the evolution of\ngeomagnetic disturbances.\n","subjects":["Physics/Space Physics","Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"YRUYCnficAc1y4N1xCH_a371XLYQDWBweBDdSjXLYeg","pdfSize":"16111116"}