{"id":"2407.04237","title":"GSD: View-Guided Gaussian Splatting Diffusion for 3D Reconstruction","authors":"Yuxuan Mu, Xinxin Zuo, Chuan Guo, Yilin Wang, Juwei Lu, Xiaofeng Wu,\n  Songcen Xu, Peng Dai, Youliang Yan, Li Cheng","authorsParsed":[["Mu","Yuxuan",""],["Zuo","Xinxin",""],["Guo","Chuan",""],["Wang","Yilin",""],["Lu","Juwei",""],["Wu","Xiaofeng",""],["Xu","Songcen",""],["Dai","Peng",""],["Yan","Youliang",""],["Cheng","Li",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 03:43:08 GMT"},{"version":"v2","created":"Wed, 10 Jul 2024 06:41:49 GMT"},{"version":"v3","created":"Fri, 19 Jul 2024 16:30:59 GMT"}],"updateDate":"2024-07-22","timestamp":1720150988000,"abstract":"  We present GSD, a diffusion model approach based on Gaussian Splatting (GS)\nrepresentation for 3D object reconstruction from a single view. Prior works\nsuffer from inconsistent 3D geometry or mediocre rendering quality due to\nimproper representations. We take a step towards resolving these shortcomings\nby utilizing the recent state-of-the-art 3D explicit representation, Gaussian\nSplatting, and an unconditional diffusion model. This model learns to generate\n3D objects represented by sets of GS ellipsoids. With these strong generative\n3D priors, though learning unconditionally, the diffusion model is ready for\nview-guided reconstruction without further model fine-tuning. This is achieved\nby propagating fine-grained 2D features through the efficient yet flexible\nsplatting function and the guided denoising sampling process. In addition, a 2D\ndiffusion model is further employed to enhance rendering fidelity, and improve\nreconstructed GS quality by polishing and re-using the rendered images. The\nfinal reconstructed objects explicitly come with high-quality 3D structure and\ntexture, and can be efficiently rendered in arbitrary views. Experiments on the\nchallenging real-world CO3D dataset demonstrate the superiority of our\napproach. Project page: $\\href{https://yxmu.foo/GSD/}{\\text{this https URL}}$\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Graphics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"X2yJ28y5OF-y1R9xukl8Zfu19KD9TZfX0G9RfOiymxw","pdfSize":"9669181"}
