{"id":"2407.11091","title":"SENTINEL: Securing Indoor Localization against Adversarial Attacks with\n  Capsule Neural Networks","authors":"Danish Gufran, Pooja Anandathirtha, Sudeep Pasricha","authorsParsed":[["Gufran","Danish",""],["Anandathirtha","Pooja",""],["Pasricha","Sudeep",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 21:40:12 GMT"}],"updateDate":"2024-07-17","timestamp":1720993212000,"abstract":"  With the increasing demand for edge device powered location-based services in\nindoor environments, Wi-Fi received signal strength (RSS) fingerprinting has\nbecome popular, given the unavailability of GPS indoors. However, achieving\nrobust and efficient indoor localization faces several challenges, due to RSS\nfluctuations from dynamic changes in indoor environments and heterogeneity of\nedge devices, leading to diminished localization accuracy. While advances in\nmachine learning (ML) have shown promise in mitigating these phenomena, it\nremains an open problem. Additionally, emerging threats from adversarial\nattacks on ML-enhanced indoor localization systems, especially those introduced\nby malicious or rogue access points (APs), can deceive ML models to further\nincrease localization errors. To address these challenges, we present SENTINEL,\na novel embedded ML framework utilizing modified capsule neural networks to\nbolster the resilience of indoor localization solutions against adversarial\nattacks, device heterogeneity, and dynamic RSS fluctuations. We also introduce\nRSSRogueLoc, a novel dataset capturing the effects of rogue APs from several\nreal-world indoor environments. Experimental evaluations demonstrate that\nSENTINEL achieves significant improvements, with up to 3.5x reduction in mean\nerror and 3.4x reduction in worst-case error compared to state-of-the-art\nframeworks using simulated adversarial attacks. SENTINEL also achieves\nimprovements of up to 2.8x in mean error and 2.7x in worst-case error compared\nto state-of-the-art frameworks when evaluated with the real-world RSSRogueLoc\ndataset.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Cryptography and Security","Computing Research Repository/Distributed, Parallel, and Cluster Computing","Computing Research Repository/Machine Learning","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"Jmw-RwvEocQloDV2SM-oOJfI5A1QiOYNWmsvMe1t2PM","pdfSize":"3866354"}