{"id":"2407.04216","title":"Safe MPC Alignment with Human Directional Feedback","authors":"Zhixian Xie, Wenlong Zhang, Yi Ren, Zhaoran Wang, George J. Pappas,\n  Wanxin Jin","authorsParsed":[["Xie","Zhixian",""],["Zhang","Wenlong",""],["Ren","Yi",""],["Wang","Zhaoran",""],["Pappas","George J.",""],["Jin","Wanxin",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 02:00:47 GMT"}],"updateDate":"2024-07-08","timestamp":1720144847000,"abstract":"  In safety-critical robot planning or control, manually specifying safety\nconstraints or learning them from demonstrations can be challenging. In this\npaper, we propose a certifiable alignment method for a robot to learn a safety\nconstraint in its model predictive control (MPC) policy with human online\ndirectional feedback. To our knowledge, it is the first method to learn safety\nconstraints from human feedback. The proposed method is based on an empirical\nobservation: human directional feedback, when available, tends to guide the\nrobot toward safer regions. The method only requires the direction of human\nfeedback to update the learning hypothesis space. It is certifiable, providing\nan upper bound on the total number of human feedback in the case of successful\nlearning of safety constraints, or declaring the misspecification of the\nhypothesis space, i.e., the true implicit safety constraint cannot be found\nwithin the specified hypothesis space. We evaluated the proposed method using\nnumerical examples and user studies in two developed simulation games.\nAdditionally, we implemented and tested the proposed method on a real-world\nFranka robot arm performing mobile water-pouring tasks in a user study. The\nsimulation and experimental results demonstrate the efficacy and efficiency of\nour method, showing that it enables a robot to successfully learn safety\nconstraints with a small handful (tens) of human directional corrections.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Oqwv37Fb1RKdTt3nR8_wa169i3yyKcR8lFT6j_fdHsA","pdfSize":"3460908"}