{"id":"2407.06215","title":"Robust Routing and Scheduling of Home Healthcare Workers: A Nested\n  Branch-and-Price Approach","authors":"Carolin Bauerhenne, Jonathan Bard, Rainer Kolisch","authorsParsed":[["Bauerhenne","Carolin",""],["Bard","Jonathan",""],["Kolisch","Rainer",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 17:11:14 GMT"}],"updateDate":"2024-07-10","timestamp":1720113074000,"abstract":"  The global home healthcare market is growing rapidly due to aging\npopulations, advancements in healthcare technology, and patient preference for\nhome-based care. In this paper, we study the multi-day planning problem of\nsimultaneously deciding patient acceptance, assignment, routing, and scheduling\nunder uncertain travel and service times. Our approach ensures\ncardinality-constrained robustness with respect to timely patient care and the\nprevention of overtime. We take into account a wide range of criteria including\npatient time windows, caregiver availability and compatibility, a minimum time\ninterval between two visits of a patient, the total number of required visits,\ncontinuity of care, and profit. We use a novel systematic modeling scheme that\nprioritizes health-related criteria as hard constraints and optimizes cost and\npreference-related criteria as part of the objective function. We present a\nmixed-integer linear program formulation, along with a nested branch-and-price\ntechnique. Results from a case study in Austin, Texas demonstrate that\ninstances of realistic size can be solved to optimality within reasonable\nruntimes. The price of robustness primarily results from reduced patient load\nper caregiver. Interestingly, the criterion of geographical proximity appears\nto be of secondary priority when selecting new patients and assigning them to\ncaregivers.\n","subjects":["Mathematics/Optimization and Control","Economics/General Economics","Quantitative Finance/Economics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"qbRLf59et9eZfKG1z6OfE_T0e0L3dXBlq_yRmuSXkcQ","pdfSize":"1530321"}