{"id":"2407.04939","title":"Balance of Number of Embedding and their Dimensions in Vector\n  Quantization","authors":"Hang Chen, Sankepally Sainath Reddy, Ziwei Chen, Dianbo Liu","authorsParsed":[["Chen","Hang",""],["Reddy","Sankepally Sainath",""],["Chen","Ziwei",""],["Liu","Dianbo",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 03:07:31 GMT"}],"updateDate":"2024-07-09","timestamp":1720235251000,"abstract":"  The dimensionality of the embedding and the number of available embeddings (\nalso called codebook size) are critical factors influencing the performance of\nVector Quantization(VQ), a discretization process used in many models such as\nthe Vector Quantized Variational Autoencoder (VQ-VAE) architecture. This study\nexamines the balance between the codebook sizes and dimensions of embeddings in\nVQ, while maintaining their product constant. Traditionally, these hyper\nparameters are static during training; however, our findings indicate that\naugmenting the codebook size while simultaneously reducing the embedding\ndimension can significantly boost the effectiveness of the VQ-VAE. As a result,\nthe strategic selection of codebook size and embedding dimensions, while\npreserving the capacity of the discrete codebook space, is critically\nimportant. To address this, we propose a novel adaptive dynamic quantization\napproach, underpinned by the Gumbel-Softmax mechanism, which allows the model\nto autonomously determine the optimal codebook configuration for each data\ninstance. This dynamic discretizer gives the VQ-VAE remarkable flexibility.\nThorough empirical evaluations across multiple benchmark datasets validate the\nnotable performance enhancements achieved by our approach, highlighting the\nsignificant potential of adaptive dynamic quantization to improve model\nperformance.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"dj7lqtBtrbcmjb6NtKmgLF5zb_fiUNP5RhcEAe_wMOo","pdfSize":"3630062"}