{"id":"2407.02666","title":"Commonsense Reasoning for Legged Robot Adaptation with Vision-Language\n  Models","authors":"Annie S. Chen, Alec M. Lessing, Andy Tang, Govind Chada, Laura Smith,\n  Sergey Levine, Chelsea Finn","authorsParsed":[["Chen","Annie S.",""],["Lessing","Alec M.",""],["Tang","Andy",""],["Chada","Govind",""],["Smith","Laura",""],["Levine","Sergey",""],["Finn","Chelsea",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 21:00:30 GMT"}],"updateDate":"2024-07-04","timestamp":1719954030000,"abstract":"  Legged robots are physically capable of navigating a diverse variety of\nenvironments and overcoming a wide range of obstructions. For example, in a\nsearch and rescue mission, a legged robot could climb over debris, crawl\nthrough gaps, and navigate out of dead ends. However, the robot's controller\nneeds to respond intelligently to such varied obstacles, and this requires\nhandling unexpected and unusual scenarios successfully. This presents an open\nchallenge to current learning methods, which often struggle with generalization\nto the long tail of unexpected situations without heavy human supervision. To\naddress this issue, we investigate how to leverage the broad knowledge about\nthe structure of the world and commonsense reasoning capabilities of\nvision-language models (VLMs) to aid legged robots in handling difficult,\nambiguous situations. We propose a system, VLM-Predictive Control (VLM-PC),\ncombining two key components that we find to be crucial for eliciting\non-the-fly, adaptive behavior selection with VLMs: (1) in-context adaptation\nover previous robot interactions and (2) planning multiple skills into the\nfuture and replanning. We evaluate VLM-PC on several challenging real-world\nobstacle courses, involving dead ends and climbing and crawling, on a Go1\nquadruped robot. Our experiments show that by reasoning over the history of\ninteractions and future plans, VLMs enable the robot to autonomously perceive,\nnavigate, and act in a wide range of complex scenarios that would otherwise\nrequire environment-specific engineering or human guidance.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"y3q5Eof2Vw9WCRYd_AYRjDArOYJb5BiuDre_UdMYlj0","pdfSize":"5241609"}