{"id":"2407.17165","title":"Explainable Artificial Intelligence Techniques for Irregular Temporal\n  Classification of Multidrug Resistance Acquisition in Intensive Care Unit\n  Patients","authors":"\\'Oscar Escudero-Arnanz, Cristina Soguero-Ruiz, Joaqu\\'in\n  \\'Alvarez-Rodr\\'iguez and Antonio G. Marques","authorsParsed":[["Escudero-Arnanz","Óscar",""],["Soguero-Ruiz","Cristina",""],["Álvarez-Rodríguez","Joaquín",""],["Marques","Antonio G.",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 11:12:01 GMT"}],"updateDate":"2024-07-25","timestamp":1721819521000,"abstract":"  Antimicrobial Resistance represents a significant challenge in the Intensive\nCare Unit (ICU), where patients are at heightened risk of Multidrug-Resistant\n(MDR) infections-pathogens resistant to multiple antimicrobial agents. This\nstudy introduces a novel methodology that integrates Gated Recurrent Units\n(GRUs) with advanced intrinsic and post-hoc interpretability techniques for\ndetecting the onset of MDR in patients across time. Within interpretability\nmethods, we propose Explainable Artificial Intelligence (XAI) approaches to\nhandle irregular Multivariate Time Series (MTS), introducing Irregular Time\nShapley Additive Explanations (IT-SHAP), a modification of Shapley Additive\nExplanations designed for irregular MTS with Recurrent Neural Networks focused\non temporal outputs. Our methodology aims to identify specific risk factors\nassociated with MDR in ICU patients. GRU with Hadamard's attention demonstrated\nhigh initial specificity and increasing sensitivity over time, correlating with\nincreased nosocomial infection risks during prolonged ICU stays. XAI analysis,\nenhanced by Hadamard attention and IT-SHAP, identified critical factors such as\nprevious non-resistant cultures, specific antibiotic usage patterns, and\nhospital environment dynamics. These insights suggest that early detection of\nat-risk patients can inform interventions such as preventive isolation and\ncustomized treatments, significantly improving clinical outcomes. The proposed\nGRU model for temporal classification achieved an average Receiver Operating\nCharacteristic Area Under the Curve of 78.27 +- 1.26 over time, indicating\nstrong predictive performance. In summary, this study highlights the clinical\nutility of our methodology, which combines predictive accuracy with\ninterpretability, thereby facilitating more effective healthcare interventions\nby professionals.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"5gFuYIQkhBKbH5NAjMHehyUtZ3g3NYhV7S2O6ywwymc","pdfSize":"1033000"}