{"id":"2407.12145","title":"Adoption and Impact of ChatGPT in Computer Science Education: A Case\n  Study on a Database Administration Course","authors":"Daniel L\\'opez-Fern\\'andez, Ricardo Vergaz","authorsParsed":[["López-Fernández","Daniel",""],["Vergaz","Ricardo",""]],"versions":[{"version":"v1","created":"Sun, 26 May 2024 20:51:28 GMT"}],"updateDate":"2024-07-18","timestamp":1716756688000,"abstract":"  Contribution: The combination of ChatGPT with traditional learning resources\nis very effective in computer science education. High-performing students are\nthe ones who are using ChatGPT the most. So, a new digital trench could be\nrising between these students and those with lower degree of fundamentals and\nworse prompting skills, who may not take advantage of all the ChatGPT\npossibilities. Background: The irruption of GenAI such as ChatGPT has changed\nthe educational landscape. Therefore, methodological guidelines and more\nempirical experiences in computer science education are needed to better\nunderstand these tools and know how to use them to their fullest potential.\nResearch Questions: This article addresses three questions. The first two\nexplore the degree of use and perceived usefulness of ChatGPT among computer\nscience students to learn database administration, where as the third one\nexplore how the utilization of ChatGPT can impact academic performance.\nMethodology: This contribution presents an exploratory and correlational study\nconducted with 37 students who used ChatGPT as a support tool to learn database\nadministration. The student grades and a comprehensive questionnaire were\nemployed as research instruments. Findings: The obtained results indicate that\ntraditional learning resources, such as teacher explanations and student\nreports, were widely used and correlated positively with student grade. The\nusage and perceived utility of ChatGPT were moderate, but positive correlations\nbetween student grade and ChatGPT usage were found. Indeed, a significantly\nhigher use of this tool was identified among the group of outstanding students.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"zsONt9e_Ya3c3uxjEj6T6jkhOeaTvXDjqbLcF4yyNc4","pdfSize":"931212"}