{"id":"2407.01619","title":"TabSketchFM: Sketch-based Tabular Representation Learning for Data\n  Discovery over Data Lakes","authors":"Aamod Khatiwada, Harsha Kokel, Ibrahim Abdelaziz, Subhajit Chaudhury,\n  Julian Dolby, Oktie Hassanzadeh, Zhenhan Huang, Tejaswini Pedapati, Horst\n  Samulowitz, Kavitha Srinivas","authorsParsed":[["Khatiwada","Aamod",""],["Kokel","Harsha",""],["Abdelaziz","Ibrahim",""],["Chaudhury","Subhajit",""],["Dolby","Julian",""],["Hassanzadeh","Oktie",""],["Huang","Zhenhan",""],["Pedapati","Tejaswini",""],["Samulowitz","Horst",""],["Srinivas","Kavitha",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 17:28:53 GMT"},{"version":"v2","created":"Wed, 21 Aug 2024 01:58:00 GMT"}],"updateDate":"2024-08-22","timestamp":1719595733000,"abstract":"  Enterprises have a growing need to identify relevant tables in data lakes;\ne.g. tables that are unionable, joinable, or subsets of each other. Tabular\nneural models can be helpful for such data discovery tasks. In this paper, we\npresent TabSketchFM, a neural tabular model for data discovery over data lakes.\nFirst, we propose novel pre-training: a sketch-based approach to enhance the\neffectiveness of data discovery in neural tabular models. Second, we finetune\nthe pretrained model for identifying unionable, joinable, and subset table\npairs and show significant improvement over previous tabular neural models.\nThird, we present a detailed ablation study to highlight which sketches are\ncrucial for which tasks. Fourth, we use these finetuned models to perform table\nsearch; i.e., given a query table, find other tables in a corpus that are\nunionable, joinable, or that are subsets of the query. Our results demonstrate\nsignificant improvements in F1 scores for search compared to state-of-the-art\ntechniques. Finally, we show significant transfer across datasets and tasks\nestablishing that our model can generalize across different tasks and over\ndifferent data lakes.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Databases"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"WiN-hLFsP2GNGFkK4FDROZSzM--EhsBDy_5iRGn0_UA","pdfSize":"3928353"}