{"id":"2407.14104","title":"On the streamwise velocity variance in the near-wall region of turbulent\n  flows","authors":"Sergio Pirozzoli","authorsParsed":[["Pirozzoli","Sergio",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 08:17:20 GMT"}],"updateDate":"2024-07-22","timestamp":1721377040000,"abstract":"  We study the behaviour of the streamwise velocity variance in turbulent\nwall-bounded flows using a DNS database of pipe flow up to $Re_{\\tau} \\approx\n12000$. The analysis of the spanwise spectra in the viscous near-wall region\nstrongly hints to the presence of an overlap layer between the inner- and the\nouter-scaled spectral ranges, featuring a $k_{\\theta}^{-1+\\alpha}$ decay (with\n$k_{\\theta}$ the wavenumber in the azimuthal direction, and $\\alpha \\approx\n0.18$), hence shallower than suggested by the classical formulation of the\nattached-eddy model. The key implication is that the contribution to the\nstreamwise velocity variance from the largest scales of motion\n(superstructures) slowly declines as $Re_{\\tau}^{-\\alpha}$, and the integrated\nvariance follows a defect power law of the type $\\left< u^2 \\right>^+ = A - B\n\\, Re_{\\tau}^{-\\alpha}$, with constants $A$ and $B$ depending on $y^+$. The DNS\ndata very well support this behaviour, which implies that strict wall scaling\nis restored in the infinite Reynolds number limit. The extrapolated limit\ndistribution of the streamwise velocity variance features a buffer-layer peak\nvalue of $\\left< u^2 \\right>^+ \\approx 12.1$, and an additional outer peak with\nlarger magnitude. The analysis of the velocity spectra also suggests a similar\nbehaviour of the dissipation rate of the streamwise velocity variance at the\nwall, which is expected to attain a limiting value of about $0.28$, hence\nslightly exceeding the value $0.25$ which was assumed in previous\nanalyses~\\citep{chen_21}. We have found evidence suggesting that the reduced\nnear-wall influence of wall-attached eddies is likely linked to the formation\nof underlying turbulent Stokes layers.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"1IB6TXd0VZkh8CrsqFlHq9tFlUceLmcsmu6eHPv119U","pdfSize":"16373209"}