{"id":"2407.19102","title":"The Computational Complexity of Factored Graphs","authors":"Shreya Gupta, Boyang Huang, Russell Impagliazzo, Stanley Woo,\n  Christopher Ye","authorsParsed":[["Gupta","Shreya",""],["Huang","Boyang",""],["Impagliazzo","Russell",""],["Woo","Stanley",""],["Ye","Christopher",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 21:51:49 GMT"},{"version":"v2","created":"Thu, 5 Sep 2024 21:01:45 GMT"}],"updateDate":"2024-09-09","timestamp":1722030709000,"abstract":"  While graphs and abstract data structures can be large and complex, practical\ninstances are often regular or highly structured. If the instance has\nsufficient structure, we might hope to compress the object into a more succinct\nrepresentation. An efficient algorithm (with respect to the compressed input\nsize) could then lead to more efficient computations than algorithms taking the\nexplicit, uncompressed object as input. This leads to a natural question: when\ndoes knowing the input instance has a more succinct representation make\ncomputation easier?\n  We initiate the study of the computational complexity of problems on factored\ngraphs: graphs that are given as a formula of products and unions on smaller\ngraphs. For any graph problem, we define a parameterized version that takes\nfactored graphs as input, parameterized by the number of smaller graphs used to\nconstruct the factored graph. In this setting, we characterize the\nparameterized complexity of several natural graph problems, exhibiting a\nvariety of complexities. We show that a decision version of lexicographically\nfirst maximal independent set is unconditionally XP-complete, and therefore not\nfixed parameter tractable (FPT). On the other hand, we show that clique\ncounting is FPT. Finally, we show that reachability is FPT if and only if\n$\\mathbf{NL}$ is in some fixed polynomial time.\n","subjects":["Computing Research Repository/Computational Complexity"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"UsHz8vxTTpT7LWFtug_S56Ku3PfbL0Uddrp-62VeppY","pdfSize":"491656","objectId":"0x103c9174887bc81051c7806d08ad428602868055b78d0234337930e961b759b4","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
