{"id":"2407.12355","title":"Are Educational Escape Rooms More Effective Than Traditional Lectures\n  for Teaching Software Engineering? A Randomized Controlled Trial","authors":"Aldo Gordillo, Daniel L\\'opez-Fern\\'andez","authorsParsed":[["Gordillo","Aldo",""],["López-Fernández","Daniel",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 07:17:23 GMT"}],"updateDate":"2024-07-18","timestamp":1721200643000,"abstract":"  Contribution: This article analyzes the learning effectiveness of a virtual\neducational escape room for teaching software engineering and compares this\nactivity with traditional teaching through a randomized controlled trial.\nBackground: Educational escape rooms have been used across a wide variety of\ndisciplines at all levels of education and they are becoming increasingly\npopular among teachers. Nevertheless, there is a clear general need for more\nrobust empirical evidence on the learning effectiveness of these novel\nactivities and, particularly, on their application in software engineering\neducation. Research Questions: Is game-based learning using educational escape\nrooms more effective than traditional lectures for teaching software\nengineering? What are the perceptions of software engineering students toward\ngame-based learning using educational escape rooms? Methodology: The study\npresented in this article is a randomized controlled trial with a pre-and\npost-test design that was completed by a total of 326 software engineering\nstudents. The 164 students belonging to the experimental group learned software\nmodeling by playing an educational escape room whereas the 162 students\nbelonging to the control group learned the same subject matter through a\ntraditional lecture. Findings: The results of the randomized controlled trial\nshow that the students who learned software modeling through the educational\nescape room had very positive perceptions toward this activity, significantly\nincreased their knowledge, and outperformed those students who learned through\na traditional lecture in terms of knowledge acquisition.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"6I-yM44khDyyRSATVQ--U4YApcEM3Bj8W0anVuTVRAs","pdfSize":"2735472"}