{"id":"2407.20523","title":"Wireless Multi-User Interactive Virtual Reality in Metaverse with\n  Edge-Device Collaborative Computing","authors":"Caolu Xu, Zhiyong Chen, Meixia Tao, and Wenjun Zhang","authorsParsed":[["Xu","Caolu",""],["Chen","Zhiyong",""],["Tao","Meixia",""],["Zhang","Wenjun",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 03:45:04 GMT"}],"updateDate":"2024-07-31","timestamp":1722311104000,"abstract":"  The immersive nature of the metaverse presents significant challenges for\nwireless multi-user interactive virtual reality (VR), such as ultra-low\nlatency, high throughput and intensive computing, which place substantial\ndemands on the wireless bandwidth and rendering resources of mobile edge\ncomputing (MEC). In this paper, we propose a wireless multi-user interactive VR\nwith edge-device collaborative computing framework to overcome the\nmotion-to-photon (MTP) threshold bottleneck. Specifically, we model the\nserial-parallel task execution in queues within a foreground and background\nseparation architecture. The rendering indices of background tiles within the\nprediction window are determined, and both the foreground and selected\nbackground tiles are loaded into respective processing queues based on the\nrendering locations. To minimize the age of sensor information and the power\nconsumption of mobile devices, we optimize rendering decisions and MEC resource\nallocation subject to the MTP constraint. To address this optimization problem,\nwe design a safe reinforcement learning (RL) algorithm, active queue\nmanagement-constrained updated projection (AQM-CUP). AQM-CUP constructs an\nenvironment suitable for queues, incorporating expired tiles actively discarded\nin processing buffers into its state and reward system. Experimental results\ndemonstrate that the proposed framework significantly enhances user immersion\nwhile reducing device power consumption, and the superiority of the proposed\nAQM-CUP algorithm over conventional methods in terms of the training\nconvergence and performance metrics.\n","subjects":["Computing Research Repository/Information Theory","Computing Research Repository/Multimedia","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"C3CLMxqhnffMpceoglgfazLCUyscOe2GDNKDeHZ9nUw","pdfSize":"2157628"}