{"id":"2407.18274","title":"Adaptive Differentially Private Structural Entropy Minimization for\n  Unsupervised Social Event Detection","authors":"Zhiwei Yang, Yuecen Wei, Haoran Li, Qian Li, Lei Jiang, Li Sun,\n  Xiaoyan Yu, Chunming Hu, Hao Peng","authorsParsed":[["Yang","Zhiwei",""],["Wei","Yuecen",""],["Li","Haoran",""],["Li","Qian",""],["Jiang","Lei",""],["Sun","Li",""],["Yu","Xiaoyan",""],["Hu","Chunming",""],["Peng","Hao",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 11:19:22 GMT"}],"updateDate":"2024-07-29","timestamp":1721733562000,"abstract":"  Social event detection refers to extracting relevant message clusters from\nsocial media data streams to represent specific events in the real world.\nSocial event detection is important in numerous areas, such as opinion\nanalysis, social safety, and decision-making. Most current methods are\nsupervised and require access to large amounts of data. These methods need\nprior knowledge of the events and carry a high risk of leaking sensitive\ninformation in the messages, making them less applicable in open-world\nsettings. Therefore, conducting unsupervised detection while fully utilizing\nthe rich information in the messages and protecting data privacy remains a\nsignificant challenge. To this end, we propose a novel social event detection\nframework, ADP-SEMEvent, an unsupervised social event detection method that\nprioritizes privacy. Specifically, ADP-SEMEvent is divided into two stages,\ni.e., the construction stage of the private message graph and the clustering\nstage of the private message graph. In the first stage, an adaptive\ndifferential privacy approach is used to construct a private message graph. In\nthis process, our method can adaptively apply differential privacy based on the\nevents occurring each day in an open environment to maximize the use of the\nprivacy budget. In the second stage, to address the reduction in data utility\ncaused by noise, a novel 2-dimensional structural entropy minimization\nalgorithm based on optimal subgraphs is used to detect events in the message\ngraph. The highlight of this process is unsupervised and does not compromise\ndifferential privacy. Extensive experiments on two public datasets demonstrate\nthat ADP-SEMEvent can achieve detection performance comparable to\nstate-of-the-art methods while maintaining reasonable privacy budget\nparameters.\n","subjects":["Computing Research Repository/Social and Information Networks","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"fyD--3ZhWTGIAhIVB9aXTbLF1d5kmZ2R6x7NvBL5a8E","pdfSize":"1174551"}