{"id":"2407.18772","title":"Learning production functions for supply chains with graph neural\n  networks","authors":"Serina Chang, Zhiyin Lin, Benjamin Yan, Swapnil Bembde, Qi Xiu, Chi\n  Heem Wong, Yu Qin, Frank Kloster, Alex Luo, Raj Palleti, Jure Leskovec","authorsParsed":[["Chang","Serina",""],["Lin","Zhiyin",""],["Yan","Benjamin",""],["Bembde","Swapnil",""],["Xiu","Qi",""],["Wong","Chi Heem",""],["Qin","Yu",""],["Kloster","Frank",""],["Luo","Alex",""],["Palleti","Raj",""],["Leskovec","Jure",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 14:32:18 GMT"}],"updateDate":"2024-07-29","timestamp":1722004338000,"abstract":"  The global economy relies on the flow of goods over supply chain networks,\nwith nodes as firms and edges as transactions between firms. While we may\nobserve these external transactions, they are governed by unseen production\nfunctions, which determine how firms internally transform the input products\nthey receive into output products that they sell. In this setting, it can be\nextremely valuable to infer these production functions, to better understand\nand improve supply chains, and to forecast future transactions more accurately.\nHowever, existing graph neural networks (GNNs) cannot capture these hidden\nrelationships between nodes' inputs and outputs. Here, we introduce a new class\nof models for this setting, by combining temporal GNNs with a novel inventory\nmodule, which learns production functions via attention weights and a special\nloss function. We evaluate our models extensively on real supply chains data,\nalong with data generated from our new open-source simulator, SupplySim. Our\nmodels successfully infer production functions, with a 6-50% improvement over\nbaselines, and forecast future transactions on real and synthetic data,\noutperforming baselines by 11-62%.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computers and Society","Computing Research Repository/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"B7X7cNvNE1RB9ir7oxWR9dNpgCL4LtPU_YsiISuH-vg","pdfSize":"850209"}