{"id":"2407.08826","title":"The CDAWG Index and Pattern Matching on Grammar-Compressed Strings","authors":"Alan M. Cleary and Joseph Winjum and Jordan Dood and Shunsuke Inenaga","authorsParsed":[["Cleary","Alan M.",""],["Winjum","Joseph",""],["Dood","Jordan",""],["Inenaga","Shunsuke",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 19:16:19 GMT"}],"updateDate":"2024-07-15","timestamp":1720725379000,"abstract":"  The compact directed acyclic word graph (CDAWG) is the minimal compact\nautomaton that recognizes all the suffixes of a string. Classically the CDAWG\nhas been implemented as an index of the string it recognizes, requiring $o(n)$\nspace for a copy of the string $T$ being indexed, where $n=|T|$. In this work,\nwe propose using the CDAWG as an index for grammar-compressed strings. While\nthis enables all analyses supported by the CDAWG on any grammar-compressed\nstring, in this work we specifically consider pattern matching. Using the CDAWG\nindex, pattern matching can be performed on any grammar-compressed string in\n$\\mathcal{O}(\\text{ra}(m)+\\text{occ})$ time while requiring only\n$\\mathcal{O}(\\text{er}(T))$ additional space, where $m$ is the length of the\npattern, $\\text{ra}(m)$ is the grammar random access time, $\\text{occ}$ is the\nnumber of occurrences of the pattern in $T$, and $\\text{er}(T)$ is the number\nof right-extensions of the maximal repeats in $T$. Our experiments show that\neven when using a na\\\"ive random access algorithm, the CDAWG index achieves\nstate of the art run-time performance for pattern matching on\ngrammar-compressed strings. Additionally, we find that all of the grammars\ncomputed for our experiments are smaller than the number of right-extensions in\nthe string they produce and, thus, their CDAWGs are within the best known\n$\\mathcal{O}(\\text{er}(T))$ space asymptotic bound.\n","subjects":["Computing Research Repository/Data Structures and Algorithms"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"K8eHgkTeAsuYeavj2FuvFi6HtlgXjFuYcDavQNvXePs","pdfSize":"220694"}