{"id":"2407.00011","title":"Enhancing Computational Efficiency in Multiscale Systems Using Deep\n  Learning of Coordinates and Flow Maps","authors":"Asif Hamid, Danish Rafiq, Shahkar Ahmad Nahvi, Mohammad Abid Bazaz","authorsParsed":[["Hamid","Asif",""],["Rafiq","Danish",""],["Nahvi","Shahkar Ahmad",""],["Bazaz","Mohammad Abid",""]],"versions":[{"version":"v1","created":"Sun, 28 Apr 2024 14:05:13 GMT"}],"updateDate":"2024-07-02","timestamp":1714313113000,"abstract":"  Complex systems often show macroscopic coherent behavior due to the\ninteractions of microscopic agents like molecules, cells, or individuals in a\npopulation with their environment. However, simulating such systems poses\nseveral computational challenges during simulation as the underlying dynamics\nvary and span wide spatiotemporal scales of interest. To capture the\nfast-evolving features, finer time steps are required while ensuring that the\nsimulation time is long enough to capture the slow-scale behavior, making the\nanalyses computationally unmanageable. This paper showcases how deep learning\ntechniques can be used to develop a precise time-stepping approach for\nmultiscale systems using the joint discovery of coordinates and flow maps.\nWhile the former allows us to represent the multiscale dynamics on a\nrepresentative basis, the latter enables the iterative time-stepping estimation\nof the reduced variables. The resulting framework achieves state-of-the-art\npredictive accuracy while incurring lesser computational costs. We demonstrate\nthis ability of the proposed scheme on the large-scale Fitzhugh Nagumo neuron\nmodel and the 1D Kuramoto-Sivashinsky equation in the chaotic regime.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing","Computing Research Repository/Machine Learning","Computing Research Repository/Neural and Evolutionary Computing","Nonlinear Sciences/Chaotic Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"YvMRx7iDzVXJ26p5nedMU7cZCmSlcru480Ctcmc0sx0","pdfSize":"2692404"}