{"id":"2407.21080","title":"Artificial Intelligence Enhanced Digital Nucleic Acid Amplification\n  Testing for Precision Medicine and Molecular Diagnostics","authors":"Yuanyuan Wei, Xianxian Liu, Changran Xu, Guoxun Zhang, Wu Yuan, Ho-Pui\n  Ho, and Mingkun Xu","authorsParsed":[["Wei","Yuanyuan",""],["Liu","Xianxian",""],["Xu","Changran",""],["Zhang","Guoxun",""],["Yuan","Wu",""],["Ho","Ho-Pui",""],["Xu","Mingkun",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 01:17:29 GMT"}],"updateDate":"2024-08-01","timestamp":1722302249000,"abstract":"  The precise quantification of nucleic acids is pivotal in molecular biology,\nunderscored by the rising prominence of nucleic acid amplification tests (NAAT)\nin diagnosing infectious diseases and conducting genomic studies. This review\nexamines recent advancements in digital Polymerase Chain Reaction (dPCR) and\ndigital Loop-mediated Isothermal Amplification (dLAMP), which surpass the\nlimitations of traditional NAAT by offering absolute quantification and\nenhanced sensitivity. In this review, we summarize the compelling advancements\nof dNNAT in addressing pressing public health issues, especially during the\nCOVID-19 pandemic. Further, we explore the transformative role of artificial\nintelligence (AI) in enhancing dNAAT image analysis, which not only improves\nefficiency and accuracy but also addresses traditional constraints related to\ncost, complexity, and data interpretation. In encompassing the state-of-the-art\n(SOTA) development and potential of both software and hardware, the\nall-encompassing Point-of-Care Testing (POCT) systems cast new light on\nbenefits including higher throughput, label-free detection, and expanded\nmultiplex analyses. While acknowledging the enhancement of AI-enhanced dNAAT\ntechnology, this review aims to both fill critical gaps in the existing\ntechnologies through comparative assessments and offer a balanced perspective\non the current trajectory, including attendant challenges and future\ndirections. Leveraging AI, next-generation dPCR and dLAMP technologies promises\nintegration into clinical practice, improving personalized medicine, real-time\nepidemic surveillance, and global diagnostic accessibility.\n","subjects":["Quantitative Biology/Quantitative Methods","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"fghU3NRTb9Bc4fu10-aBbG0r9RsDbVbDv7oYbOYYPWw","pdfSize":"2420259"}