{"id":"2407.10282","title":"High-speed synchrotron X-ray imaging of melt pool dynamics during\n  ultrasonic melt processing of Al6061","authors":"Lovejoy Mutswatiwa, Lauren Katch, Nathan J. Kizer, Judith A. Todd, Tao\n  Sun, Samuel J. Clark, Kamel Fezzaa, Jordan Lum, David M. Stobbe, Griffin T.\n  Jones, Kenneth C. Meinert, Andrea P. Arguelles, Christopher M. Kube","authorsParsed":[["Mutswatiwa","Lovejoy",""],["Katch","Lauren",""],["Kizer","Nathan J.",""],["Todd","Judith A.",""],["Sun","Tao",""],["Clark","Samuel J.",""],["Fezzaa","Kamel",""],["Lum","Jordan",""],["Stobbe","David M.",""],["Jones","Griffin T.",""],["Meinert","Kenneth C.",""],["Arguelles","Andrea P.",""],["Kube","Christopher M.",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 17:41:39 GMT"}],"updateDate":"2024-07-16","timestamp":1720978899000,"abstract":"  Ultrasonic processing of solidifying metals in additive manufacturing can\nprovide grain refinement and advantageous mechanical properties. However, the\nspecific physical mechanisms of microstructural refinement relevant to\nlaser-based additive manufacturing have not been directly observed because of\nsub-millimeter length scales and rapid solidification rates associated with\nmelt pools. Here, high-speed synchrotron X-ray imaging is used to observe the\neffect of ultrasonic vibration directly on melt pool dynamics and\nsolidification of Al6061 alloy. The high temporal and spatial resolution\nenabled direct observation of cavitation effects driven by a 20.2 kHz\nultrasonic source. We utilized multiphysics simulations to validate the\npostulated connection between ultrasonic treatment and solidification. The\nX-ray results show a decrease in melt pool and keyhole depth fluctuations\nduring melting and promotion of pore migration toward the melt pool surface\nwith applied sonication. Additionally, the simulation results reveal increased\nlocalized melt pool flow velocity, cooling rates, and thermal gradients with\napplied sonication. This work shows how ultrasonic treatment can impact melt\npools and its potential for improving part quality.\n","subjects":["Physics/Applied Physics","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"CzojK48qTUQGXstzC5aXfA9dGPH1zwzov_6p0Vsg2cQ","pdfSize":"5990502","objectId":"0xa06c744233b4c928ddb8062a479122a8ea9b57407065890f727fad6533d52329","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
