{"id":"2407.19787","title":"SciPostLayout: A Dataset for Layout Analysis and Layout Generation of\n  Scientific Posters","authors":"Shohei Tanaka, Hao Wang, Yoshitaka Ushiku","authorsParsed":[["Tanaka","Shohei",""],["Wang","Hao",""],["Ushiku","Yoshitaka",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 08:32:27 GMT"}],"updateDate":"2024-07-30","timestamp":1722241947000,"abstract":"  Scientific posters are used to present the contributions of scientific papers\neffectively in a graphical format. However, creating a well-designed poster\nthat efficiently summarizes the core of a paper is both labor-intensive and\ntime-consuming. A system that can automatically generate well-designed posters\nfrom scientific papers would reduce the workload of authors and help readers\nunderstand the outline of the paper visually. Despite the demand for poster\ngeneration systems, only a limited research has been conduced due to the lack\nof publicly available datasets. Thus, in this study, we built the SciPostLayout\ndataset, which consists of 7,855 scientific posters and manual layout\nannotations for layout analysis and generation. SciPostLayout also contains 100\nscientific papers paired with the posters. All of the posters and papers in our\ndataset are under the CC-BY license and are publicly available. As benchmark\ntests for the collected dataset, we conducted experiments for layout analysis\nand generation utilizing existing computer vision models and found that both\nlayout analysis and generation of posters using SciPostLayout are more\nchallenging than with scientific papers. We also conducted experiments on\ngenerating layouts from scientific papers to demonstrate the potential of\nutilizing LLM as a scientific poster generation system. The dataset is publicly\navailable at https://huggingface.co/datasets/omron-sinicx/scipostlayout_v2. The\ncode is also publicly available at\nhttps://github.com/omron-sinicx/scipostlayout.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"6S_-fGmUadP0OztkMVtiiuu-WjLOQ6ah4Ce57dfHTQY","pdfSize":"8085820"}