{"id":"2407.07408","title":"STONE: Self-supervised Tonality Estimator","authors":"Yuexuan Kong, Vincent Lostanlen, Gabriel Meseguer-Brocal, Stella Wong,\n  Mathieu Lagrange, Romain Hennequin","authorsParsed":[["Kong","Yuexuan",""],["Lostanlen","Vincent",""],["Meseguer-Brocal","Gabriel",""],["Wong","Stella",""],["Lagrange","Mathieu",""],["Hennequin","Romain",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 07:09:56 GMT"},{"version":"v2","created":"Wed, 17 Jul 2024 21:52:45 GMT"},{"version":"v3","created":"Thu, 8 Aug 2024 09:31:44 GMT"}],"updateDate":"2024-08-09","timestamp":1720595396000,"abstract":"  Although deep neural networks can estimate the key of a musical piece, their\nsupervision incurs a massive annotation effort. Against this shortcoming, we\npresent STONE, the first self-supervised tonality estimator. The architecture\nbehind STONE, named ChromaNet, is a convnet with octave equivalence which\noutputs a key signature profile (KSP) of 12 structured logits. First, we train\nChromaNet to regress artificial pitch transpositions between any two unlabeled\nmusical excerpts from the same audio track, as measured as cross-power spectral\ndensity (CPSD) within the circle of fifths (CoF). We observe that this\nself-supervised pretext task leads KSP to correlate with tonal key signature.\nBased on this observation, we extend STONE to output a structured KSP of 24\nlogits, and introduce supervision so as to disambiguate major versus minor keys\nsharing the same key signature. Applying different amounts of supervision\nyields semi-supervised and fully supervised tonality estimators: i.e.,\nSemi-TONEs and Sup-TONEs. We evaluate these estimators on FMAK, a new dataset\nof 5489 real-world musical recordings with expert annotation of 24 major and\nminor keys. We find that Semi-TONE matches the classification accuracy of\nSup-TONE with reduced supervision and outperforms it with equal supervision.\n","subjects":["Computing Research Repository/Sound","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"1YP5atYC95egL_7UWcVsbgigMgx3NtjODGnKPvEx5zA","pdfSize":"2350646","objectId":"0x2e2be636d60c8db30e13f8055a3c1f153532ab1e88a7b27fcfa66413c873a931","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
