{"id":"2407.14713","title":"Potential Distribution Theory of Alchemical Transfer","authors":"Solmaz Azimi, Emilio Gallicchio","authorsParsed":[["Azimi","Solmaz",""],["Gallicchio","Emilio",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 00:41:39 GMT"}],"updateDate":"2024-07-23","timestamp":1721436099000,"abstract":"  We present an analytical description of the Alchemical Transfer Method (ATM)\nfor molecular binding using the Potential Distribution Theory (PDT) formalism.\nATM models the binding free energy by mapping the bound and unbound states of\nthe complex by translating the ligand coordinates. PDT relates the free energy\nand the probability densities of the perturbation energy along the alchemical\npath to the probability density at the initial state, which is the unbound\nstate of the complex in the case of a binding process. Hence, the ATM\nprobability density of the transfer energy at the unbound state is first\nrelated by a convolution operation to the probability densities for coupling\nthe ligand to the solvent and coupling it to the solvated receptor, for which\nanalytical descriptions are available with parameters obtained from maximum\nlikelihood analysis of data from double-decoupling alchemical calculations. PDT\nis then used to extend this analytical description along the alchemical\ntransfer pathway. We tested the theory on the alchemical binding of five guests\nto the TEMOA host from the SAMPL8 benchmark set. In each case, the probability\ndensities of the perturbation energy for transfer along the alchemical transfer\npathway obtained from numerical calculations match those predicted from the\ntheory and double-decoupling simulations. The work provides a solid theoretical\nfoundation for alchemical transfer, offers physical insights on the form of the\nprobability densities observed in alchemical transfer calculations, and\nconfirms the conceptual and numerical equivalence between the alchemical\ntransfer and double-decoupling processes.\n","subjects":["Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"uxWSyn2g65kwEgLF8GyN_rrJSg1wtrABZHhrkhUZPXE","pdfSize":"4612705"}