{"id":"2407.02580","title":"A Precise Fitting Formula for Gravitational Wave Spectra from Phase\n  Transitions","authors":"Huai-ke Guo, Fazlollah Hajkarim, Kuver Sinha, Graham White, Yang Xiao","authorsParsed":[["Guo","Huai-ke",""],["Hajkarim","Fazlollah",""],["Sinha","Kuver",""],["White","Graham",""],["Xiao","Yang",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 18:02:21 GMT"}],"updateDate":"2024-07-04","timestamp":1719943341000,"abstract":"  Obtaining a precise form for the predicted gravitational wave (GW) spectrum\nfrom a phase transition is a topic of great relevance for beyond Standard Model\n(BSM) physicists. Currently, the most sophisticated semi-analytic framework for\nestimating the dominant contribution to the spectrum is the sound shell model;\nhowever, full calculations within this framework can be computationally\nexpensive, especially for large-scale scans. The community therefore generally\nmanages with fit functions to the GW spectrum, the most widely used of which is\na single broken power law. We provide a more precise fit function based on the\nsound shell model: our fit function features a double broken power law with two\nfrequency breaks corresponding to the two characteristic length scales of the\nproblem -- inter-bubble spacing and thickness of sound shells, the second of\nwhich is neglected in the single broken power law fit. Compared to previously\nproposed fits, we demonstrate that our fit function more faithfully captures\nthe GW spectrum coming from a full calculation of the sound shell model, over\nmost of the space of the thermodynamic parameters governing the phase\ntransition. The physical origins of the fit parameters and their dependence on\nthe thermodynamic parameters are studied in the underlying sound shell model:\nin particular, we perform a series of detailed scans for these quantities over\nthe plane of the strength of the phase transition ($\\alpha$) and the bubble\nwall velocity ($v_w$). Wherever possible, we comment on the physical\ninterpretations of these scans. The result of our study can be used to generate\naccurate GW spectra with our fit function, given initial inputs of $\\alpha$,\n$v_w$, $\\beta/H$ (nucleation rate parameter) and $T_n$ (nucleation temperature)\nfor the relevant BSM scenario.\n","subjects":["Physics/High Energy Physics - Phenomenology","Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"KJ9k3wBWcxdxr0nOoTxChQdTE7J1BB_Vj8D9Uw-5Udo","pdfSize":"11225278"}