{"id":"2407.13960","title":"Using Artificial Intelligence to Accelerate Collective Intelligence:\n  Policy Synth and Smarter Crowdsourcing","authors":"R\\'obert Bjarnason, Dane Gambrell, Joshua Lanthier-Welch","authorsParsed":[["Bjarnason","Róbert",""],["Gambrell","Dane",""],["Lanthier-Welch","Joshua",""]],"versions":[{"version":"v1","created":"Mon, 3 Jun 2024 11:27:23 GMT"}],"updateDate":"2024-07-22","timestamp":1717414043000,"abstract":"  In an era characterized by rapid societal changes and complex challenges,\ninstitutions' traditional methods of problem-solving in the public sector are\nincreasingly proving inadequate. In this study, we present an innovative and\neffective model for how institutions can use artificial intelligence to enable\ngroups of people to generate effective solutions to urgent problems more\nefficiently. We describe a proven collective intelligence method, called\nSmarter Crowdsourcing, which is designed to channel the collective intelligence\nof those with expertise about a problem into actionable solutions through\ncrowdsourcing. Then we introduce Policy Synth, an innovative toolkit which\nleverages AI to make the Smarter Crowdsourcing problem-solving approach both\nmore scalable, more effective and more efficient. Policy Synth is crafted using\na human-centric approach, recognizing that AI is a tool to enhance human\nintelligence and creativity, not replace it. Based on a real-world case study\ncomparing the results of expert crowdsourcing alone with expert sourcing\nsupported by Policy Synth AI agents, we conclude that Smarter Crowdsourcing\nwith Policy Synth presents an effective model for integrating the collective\nwisdom of human experts and the computational power of AI to enhance and scale\nup public problem-solving processes. While many existing approaches view AI as\na tool to make crowdsourcing and deliberative processes better and more\nefficient, Policy Synth goes a step further, recognizing that AI can also be\nused to synthesize the findings from engagements together with research to\ndevelop evidence-based solutions and policies. The study offers practical tools\nand insights for institutions looking to engage communities effectively in\naddressing urgent societal challenges.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"sXlLQbDxYjyPKe6AyoRDiHoazuU1FXwEDl6p04ApNSQ","pdfSize":"4150376"}