{"id":"2407.09567","title":"On the nature of information -- an evolutionary perspective","authors":"Wouter van der Wijngaart","authorsParsed":[["van der Wijngaart","Wouter",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 16:37:01 GMT"}],"updateDate":"2024-07-16","timestamp":1720283821000,"abstract":"  This Perspective explores the origins and persistence of recurrent structures\nand patterns throughout the known Universe. We start with a first fundamental\nquestion: 1. Considering that all information consists of patterns in physical\nstructure but not all physical patterns constitute information, what is the\nfundamental relation between these two? We first explore the materialistic\nnature of structures and information, detailing how they can form through\nspontaneous or templated processes and evolve into complex structures,\nincluding self-replicators. We posit that all recurring structures emerge\neither spontaneously de novo or based on underlying information. A main\nimplication is that all information must be understood as both a product and a\ndriver of evolution. We further observe that the three carriers of information\nunderpin the emergence of three main layers of self-organisation: genes coded\nin DNA for the biological layer, ideas stored in neural structure for the\ncultural layer, and records written on innate objects for the civilisation\nlayer. This gives rise to two additional questions, which we subsequently\naddress: 2. What can we anticipate about the future development of\nself-organizing layers given the role of information in their emergence? 3.\nWhat is the universality of information and its evolution throughout the\nUniverse? This manuscript aims to offer a fresh perspective and a universal\nframework for information and the origin of structures by extending and\nunifying concepts from physics, biology, and information theory.\n","subjects":["Quantitative Biology/Neurons and Cognition","Computing Research Repository/Information Theory","Mathematics/Information Theory","Physics/History and Philosophy of Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"IdOJpfKzsf13DUDqmfUDNosHRd58MLU-DuHO6H5z2L8","pdfSize":"125684"}