{"id":"2407.15874","title":"Spatially-clustered spatial autoregressive models with application to\n  agricultural market concentration in Europe","authors":"Roy Cerqueti (Department of Social and Economic Sciences, Sapienza\n  University of Rome, Italy & GRANEM, University of Angers, France) and Paolo\n  Maranzano (Department Economics, Management and Statistics (DEMS), University\n  of Milano-Bicocca, Italy & Fondazione Eni Enrico Mattei (FEEM), Milano,\n  Italy) and Raffaele Mattera (Department of Social and Economic Sciences,\n  Sapienza University of Rome, Italy)","authorsParsed":[["Cerqueti","Roy","","Department of Social and Economic Sciences, Sapienza\n  University of Rome, Italy & GRANEM, University of Angers, France"],["Maranzano","Paolo","","Department Economics, Management and Statistics"],["Mattera","Raffaele","","Department of Social and Economic Sciences,\n  Sapienza University of Rome, Italy"]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 08:42:34 GMT"}],"updateDate":"2024-07-24","timestamp":1721378554000,"abstract":"  In this paper, we present an extension of the spatially-clustered linear\nregression models, namely, the spatially-clustered spatial autoregression\n(SCSAR) model, to deal with spatial heterogeneity issues in clustering\nprocedures. In particular, we extend classical spatial econometrics models,\nsuch as the spatial autoregressive model, the spatial error model, and the\nspatially-lagged model, by allowing the regression coefficients to be spatially\nvarying according to a cluster-wise structure. Cluster memberships and\nregression coefficients are jointly estimated through a penalized maximum\nlikelihood algorithm which encourages neighboring units to belong to the same\nspatial cluster with shared regression coefficients. Motivated by the increase\nof observed values of the Gini index for the agricultural production in Europe\nbetween 2010 and 2020, the proposed methodology is employed to assess the\npresence of local spatial spillovers on the market concentration index for the\nEuropean regions in the last decade. Empirical findings support the hypothesis\nof fragmentation of the European agricultural market, as the regions can be\nwell represented by a clustering structure partitioning the continent into\nthree-groups, roughly approximated by a division among Western, North Central\nand Southeastern regions. Also, we detect heterogeneous local effects induced\nby the selected explanatory variables on the regional market concentration. In\nparticular, we find that variables associated with social, territorial and\neconomic relevance of the agricultural sector seem to act differently\nthroughout the spatial dimension, across the clusters and with respect to the\npooled model, and temporal dimension.\n","subjects":["Statistics/Methodology","Statistics/Applications","Statistics/Computation"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"rtToahAgyAodkgU5t6eZxccNekjHNirT8ordqlzEYO0","pdfSize":"608695","objectId":"0xbca4e53462a3e90c606aa58496fd21ef2d973d6d2bd1591128915b4060887539","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
