{"id":"2407.20750","title":"JaColBERTv2.5: Optimising Multi-Vector Retrievers to Create\n  State-of-the-Art Japanese Retrievers with Constrained Resources","authors":"Benjamin Clavi\\'e","authorsParsed":[["Clavié","Benjamin",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 11:42:19 GMT"}],"updateDate":"2024-07-31","timestamp":1722339739000,"abstract":"  Neural Information Retrieval has advanced rapidly in high-resource languages,\nbut progress in lower-resource ones such as Japanese has been hindered by data\nscarcity, among other challenges. Consequently, multilingual models have\ndominated Japanese retrieval, despite their computational inefficiencies and\ninability to capture linguistic nuances. While recent multi-vector monolingual\nmodels like JaColBERT have narrowed this gap, they still lag behind\nmultilingual methods in large-scale evaluations. This work addresses the\nsuboptimal training methods of multi-vector retrievers in lower-resource\nsettings, focusing on Japanese. We systematically evaluate and improve key\naspects of the inference and training settings of JaColBERT, and more broadly,\nmulti-vector models. We further enhance performance through a novel checkpoint\nmerging step, showcasing it to be an effective way of combining the benefits of\nfine-tuning with the generalization capabilities of the original checkpoint.\nBuilding on our analysis, we introduce a novel training recipe, resulting in\nthe JaColBERTv2.5 model. JaColBERTv2.5, with only 110 million parameters and\ntrained in under 15 hours on 4 A100 GPUs, significantly outperforms all\nexisting methods across all common benchmarks, reaching an average score of\n0.754, significantly above the previous best of 0.720. To support future\nresearch, we make our final models, intermediate checkpoints and all data used\npublicly available.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"6Uuzvb7yil9yZJuoJqTc80QoB-Z6mFo4rQG2Ln3jFfc","pdfSize":"375021","objectId":"0xd0a01205fec6a0c75a5802a54bcfd5d4fdecc20c880bb0f0e06ac14f94490fa5","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
