{"id":"2407.20597","title":"Joint Diffusion Processes as an Inductive Bias in Sheaf Neural Networks","authors":"Ferran Hernandez Caralt, Guillermo Bern\\'ardez Gil, Iulia Duta, Pietro\n  Li\\`o, Eduard Alarc\\'on Cot","authorsParsed":[["Caralt","Ferran Hernandez",""],["Gil","Guillermo Bernárdez",""],["Duta","Iulia",""],["Liò","Pietro",""],["Cot","Eduard Alarcón",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 07:17:46 GMT"}],"updateDate":"2024-07-31","timestamp":1722323866000,"abstract":"  Sheaf Neural Networks (SNNs) naturally extend Graph Neural Networks (GNNs) by\nendowing a cellular sheaf over the graph, equipping nodes and edges with vector\nspaces and defining linear mappings between them. While the attached geometric\nstructure has proven to be useful in analyzing heterophily and oversmoothing,\nso far the methods by which the sheaf is computed do not always guarantee a\ngood performance in such settings. In this work, drawing inspiration from\nopinion dynamics concepts, we propose two novel sheaf learning approaches that\n(i) provide a more intuitive understanding of the involved structure maps, (ii)\nintroduce a useful inductive bias for heterophily and oversmoothing, and (iii)\ninfer the sheaf in a way that does not scale with the number of features, thus\nusing fewer learnable parameters than existing methods. In our evaluation, we\nshow the limitations of the real-world benchmarks used so far on SNNs, and\ndesign a new synthetic task -- leveraging the symmetries of n-dimensional\nellipsoids -- that enables us to better assess the strengths and weaknesses of\nsheaf-based models. Our extensive experimentation on these novel datasets\nreveals valuable insights into the scenarios and contexts where SNNs in general\n-- and our proposed approaches in particular -- can be beneficial.\n","subjects":["Computing Research Repository/Machine Learning","Mathematics/Dynamical Systems"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"tBram2ll_dKR0xH7XnJgPt4rQj266Ix3-LBLH1x4_ls","pdfSize":"1089095"}