{"id":"2407.14792","title":"FedPartWhole: Federated domain generalization via consistent part-whole\n  hierarchies","authors":"Ahmed Radwan, Mohamed S. Shehata","authorsParsed":[["Radwan","Ahmed",""],["Shehata","Mohamed S.",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 07:43:52 GMT"}],"updateDate":"2024-07-23","timestamp":1721461432000,"abstract":"  Federated Domain Generalization (FedDG), aims to tackle the challenge of\ngeneralizing to unseen domains at test time while catering to the data privacy\nconstraints that prevent centralized data storage from different domains\noriginating at various clients. Existing approaches can be broadly categorized\ninto four groups: domain alignment, data manipulation, learning strategies, and\noptimization of model aggregation weights. This paper proposes a novel approach\nto Federated Domain Generalization that tackles the problem from the\nperspective of the backbone model architecture. The core principle is that\nobjects, even under substantial domain shifts and appearance variations,\nmaintain a consistent hierarchical structure of parts and wholes. For instance,\na photograph and a sketch of a dog share the same hierarchical organization,\nconsisting of a head, body, limbs, and so on. The introduced architecture\nexplicitly incorporates a feature representation for the image parse tree. To\nthe best of our knowledge, this is the first work to tackle Federated Domain\nGeneralization from a model architecture standpoint. Our approach outperforms a\nconvolutional architecture of comparable size by over 12\\%, despite utilizing\nfewer parameters. Additionally, it is inherently interpretable, contrary to the\nblack-box nature of CNNs, which fosters trust in its predictions, a crucial\nasset in federated learning.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"rfiL6x8ELR8szv22cHt74aE3B9NYliKCZY5_hsiEa1k","pdfSize":"2076925"}