{"id":"2407.04636","title":"Surface-Functionalization of Oleate-Capped Nano-Emitters for Stable\n  Dispersion in 3D-Printable Polymers","authors":"Akhilesh Kumar Pathak, Sachin Prashant Kulkarni, Rachel R. Chan, Chad\n  A. Mirkin, Koray Aydin, Sridhar Krishnaswamy","authorsParsed":[["Pathak","Akhilesh Kumar",""],["Kulkarni","Sachin Prashant",""],["Chan","Rachel R.",""],["Mirkin","Chad A.",""],["Aydin","Koray",""],["Krishnaswamy","Sridhar",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 16:48:19 GMT"}],"updateDate":"2024-07-08","timestamp":1720198099000,"abstract":"  Two-photon polymerization (2PP) 3D printing is a well-known technique for\nfabricating passive micro/nanoscale structures, such as microlenses and\ninversely designed polarization splitters. The integration of light emitting\nnanoparticle (NP) dopants, such as quantum dots (QDs) and rare-earth doped\nnanoparticles (RENPs), into a polymer resist would enable 3D printing of active\npolymer micro-photonic devices, including sensors, lasers, and solid-state\ndisplays. Many NPs are stabilized with oleic acid ligands to prevent\ndegradation, but oleate-capped NPs (oc-NPs) tend to agglomerate in nonpolar\nmedia despite the hydrophobicity of the ligand. This results in an uneven\ndistribution of NPs in polymers and increased optical extinction properties. In\nthis work, we propose a general approach for dispersing various oc-NPs in\ncommercial 3D printable polymers. We achieve controlled growth of small carbon\nchains around the oc-NPs by functionalizing the NPs with methyl-methacrylate\nmonomers. The proposed approach is validated on RENPs (~65 nm) and CdSe/ZnS\nquantum dots (~12 nm) using different commercial polymer resists (IP-Dip and\nIP-Visio). Dispersions of functionalized NPs (f-NPs) have improved NP density\nby an order of magnitude and are shown to be stable for several weeks with\nminimal impact on printing quality. Our approach is generalizable to a variety\nof oc-NPs and ultimately leads to higher quality polymer-based optical and\nelectronic devices.\n","subjects":["Physics/Applied Physics","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"zVZCwah74bxEVC8tx3-4n5eZWb9npaSeRo9dWZMdi6Y","pdfSize":"1792897"}
