{"id":"2407.03893","title":"Do Generalised Classifiers really work on Human Drawn Sketches?","authors":"Hmrishav Bandyopadhyay, Pinaki Nath Chowdhury, Aneeshan Sain,\n  Subhadeep Koley, Tao Xiang, Ayan Kumar Bhunia, Yi-Zhe Song","authorsParsed":[["Bandyopadhyay","Hmrishav",""],["Chowdhury","Pinaki Nath",""],["Sain","Aneeshan",""],["Koley","Subhadeep",""],["Xiang","Tao",""],["Bhunia","Ayan Kumar",""],["Song","Yi-Zhe",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 12:37:08 GMT"}],"updateDate":"2024-07-08","timestamp":1720096628000,"abstract":"  This paper, for the first time, marries large foundation models with human\nsketch understanding. We demonstrate what this brings -- a paradigm shift in\nterms of generalised sketch representation learning (e.g., classification).\nThis generalisation happens on two fronts: (i) generalisation across unknown\ncategories (i.e., open-set), and (ii) generalisation traversing abstraction\nlevels (i.e., good and bad sketches), both being timely challenges that remain\nunsolved in the sketch literature. Our design is intuitive and centred around\ntransferring the already stellar generalisation ability of CLIP to benefit\ngeneralised learning for sketches. We first \"condition\" the vanilla CLIP model\nby learning sketch-specific prompts using a novel auxiliary head of raster to\nvector sketch conversion. This importantly makes CLIP \"sketch-aware\". We then\nmake CLIP acute to the inherently different sketch abstraction levels. This is\nachieved by learning a codebook of abstraction-specific prompt biases, a\nweighted combination of which facilitates the representation of sketches across\nabstraction levels -- low abstract edge-maps, medium abstract sketches in\nTU-Berlin, and highly abstract doodles in QuickDraw. Our framework surpasses\npopular sketch representation learning algorithms in both zero-shot and\nfew-shot setups and in novel settings across different abstraction boundaries.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"gqjr41-wGFVv_zTHL-gY16u1_ofxf3sxPcwGgLJCi4Q","pdfSize":"6798434"}