{"id":"2407.05318","title":"Vulnerability-Hunter: An Adaptive Feature Perception Attention Network\n  for Smart Contract Vulnerabilities","authors":"Yizhou Chen","authorsParsed":[["Chen","Yizhou",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 10:13:41 GMT"}],"updateDate":"2024-07-09","timestamp":1720347221000,"abstract":"  Smart Contract Vulnerability Detection (SCVD) is crucial to guarantee the\nquality of blockchain-based systems. Graph neural networks have been shown to\nbe effective in learning semantic representations of smart contract code and\nare commonly adopted by existing deep learning-based SCVD. However, the current\nmethods still have limitations in their utilization of graph sampling or\nsubgraph pooling based on predefined rules for extracting crucial components\nfrom structure graphs of smart contract code. These predefined rule-based\nstrategies, typically designed using static rules or heuristics, demonstrate\nlimited adaptability to dynamically adjust extraction strategies according to\nthe structure and content of the graph in heterogeneous topologies of smart\ncontract code. Consequently, these strategies may not possess universal\napplicability to all smart contracts, potentially leading to false positives or\nomissions. To address these problems, we propose AFPNet, a novel vulnerability\ndetection model equipped with a feature perception module that has dynamic\nweights for comprehensive scanning of the entire smart contract code and\nautomatic extraction of crucial code snippets (the $P$ snippets with the\nlargest weights). Subsequently, the relationship perception attention module\nemploys an attention mechanism to learn dependencies among these code snippets\nand detect smart contract vulnerabilities. The efforts made by AFPNet\nconsistently enable the capture of crucial code snippets and enhance the\nperformance of SCVD optimization. We conduct an evaluation of AFPNet in the\nseveral large-scale datasets with vulnerability labels. The experimental\nresults show that our AFPNet significantly outperforms the state-of-the-art\napproach by 6.38\\%-14.02\\% in term of F1-score. The results demonstrate the\neffectiveness of AFPNet in dynamically extracting valuable information and\nvulnerability detection.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"EntJlBULfmTfw2HEyNz26QmlMdAGUok7RDOY_DurQU0","pdfSize":"1217419"}
