{"id":"2407.12451","title":"Across Platforms and Languages: Dutch Influencers and Legal Disclosures\n  on Instagram, YouTube and TikTok","authors":"Haoyang Gui and Thales Bertaglia and Catalina Goanta and Sybe de Vries\n  and Gerasimos Spanakis","authorsParsed":[["Gui","Haoyang",""],["Bertaglia","Thales",""],["Goanta","Catalina",""],["de Vries","Sybe",""],["Spanakis","Gerasimos",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 09:59:52 GMT"},{"version":"v2","created":"Mon, 12 Aug 2024 15:44:26 GMT"}],"updateDate":"2024-08-13","timestamp":1721210392000,"abstract":"  Content monetization on social media fuels a growing influencer economy.\nInfluencer marketing remains largely undisclosed or inappropriately disclosed\non social media. Non-disclosure issues have become a priority for national and\nsupranational authorities worldwide, who are starting to impose increasingly\nharsher sanctions on them. This paper proposes a transparent methodology for\nmeasuring whether and how influencers comply with disclosures based on legal\nstandards. We introduce a novel distinction between disclosures that are\nlegally sufficient (green) and legally insufficient (yellow). We apply this\nmethodology to an original dataset reflecting the content of 150 Dutch\ninfluencers publicly registered with the Dutch Media Authority based on\nrecently introduced registration obligations. The dataset consists of 292,315\nposts and is multi-language (English and Dutch) and cross-platform (Instagram,\nYouTube and TikTok). We find that influencer marketing remains generally\nunderdisclosed on social media, and that bigger influencers are not necessarily\nmore compliant with disclosure standards.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Computation and Language","Computing Research Repository/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"L3wDeCRKBGGZ2WPX64Pg5dvtemT3ySu1vqDR0KxDLeE","pdfSize":"1040821"}