{"id":"2407.21029","title":"Data-Driven Abstractions via Binary-Tree Gaussian Processes for Formal\n  Verification","authors":"Oliver Sch\\\"on, Shammakh Naseer, Ben Wooding, Sadegh Soudjani","authorsParsed":[["Schön","Oliver",""],["Naseer","Shammakh",""],["Wooding","Ben",""],["Soudjani","Sadegh",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 11:49:44 GMT"}],"updateDate":"2024-08-01","timestamp":1721044184000,"abstract":"  To advance formal verification of stochastic systems against temporal logic\nrequirements for handling unknown dynamics, researchers have been designing\ndata-driven approaches inspired by breakthroughs in the underlying machine\nlearning techniques. As one promising research direction, abstraction-based\nsolutions based on Gaussian process (GP) regression have become popular for\ntheir ability to learn a representation of the latent system from data with a\nquantified error. Results obtained based on this model are then translated to\nthe true system via various methods. In a recent publication, GPs using a\nso-called binary-tree kernel have demonstrated a polynomial speedup w.r.t. the\nsize of the data compared to their vanilla version, outcompeting all existing\nsparse GP approximations. Incidentally, the resulting binary-tree Gaussian\nprocess (BTGP) is characteristic for its piecewise-constant posterior mean and\ncovariance functions, naturally abstracting the input space into discrete\npartitions. In this paper, we leverage this natural abstraction of the BTGP for\nformal verification, eliminating the need for cumbersome abstraction and error\nquantification procedures. We show that the BTGP allows us to construct an\ninterval Markov chain model of the unknown system with a speedup that is\npolynomial w.r.t. the size of the abstraction compared to alternative\napproaches. We provide a delocalized error quantification via a unified formula\neven when the true dynamics do not live in the function space of the BTGP. This\nallows us to compute upper and lower bounds on the probability of satisfying\nreachability specifications that are robust to both aleatoric and epistemic\nuncertainties.\n","subjects":["Computing Research Repository/Logic in Computer Science","Computing Research Repository/Formal Languages and Automata Theory","Computing Research Repository/Machine Learning","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"7PDCcNf0mNppt82RlRZh7ngufhYQVh1Xz50xkEMi2QM","pdfSize":"583186"}