{"id":"2407.08848","title":"GCS*: Forward Heuristic Search on Implicit Graphs of Convex Sets","authors":"Shao Yuan Chew Chia, Rebecca H. Jiang, Bernhard Paus Graesdal, Leslie\n  Pack Kaelbling, Russ Tedrake","authorsParsed":[["Chia","Shao Yuan Chew",""],["Jiang","Rebecca H.",""],["Graesdal","Bernhard Paus",""],["Kaelbling","Leslie Pack",""],["Tedrake","Russ",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 20:15:00 GMT"},{"version":"v2","created":"Wed, 18 Sep 2024 00:00:01 GMT"}],"updateDate":"2024-09-19","timestamp":1720728900000,"abstract":"  We consider large-scale, implicit-search-based solutions to Shortest Path\nProblems on Graphs of Convex Sets (GCS). We propose GCS*, a forward heuristic\nsearch algorithm that generalizes A* search to the GCS setting, where a\ncontinuous-valued decision is made at each graph vertex, and constraints across\ngraph edges couple these decisions, influencing costs and feasibility. Such\nmixed discrete-continuous planning is needed in many domains, including motion\nplanning around obstacles and planning through contact. This setting provides a\nunique challenge for best-first search algorithms: the cost and feasibility of\na path depend on continuous-valued points chosen along the entire path. We show\nthat by pruning paths that are cost-dominated over their entire terminal\nvertex, GCS* can search efficiently while still guaranteeing cost-optimality\nand completeness. To find satisficing solutions quickly, we also present a\ncomplete but suboptimal variation, pruning instead reachability-dominated\npaths. We implement these checks using polyhedral-containment or sampling-based\nmethods. The former implementation is complete and cost-optimal, while the\nlatter is probabilistically complete and asymptotically cost-optimal and\nperforms effectively even with minimal samples in practice. We demonstrate GCS*\non planar pushing tasks where the combinatorial explosion of contact modes\nrenders prior methods intractable and show it performs favorably compared to\nthe state-of-the-art. Project website: https://shaoyuan.cc/research/gcs-star/\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"wqvKs0Z5btoRaswkv7yshyVHQfItzw70mkR_V7P5b9I","pdfSize":"1257496"}