{"id":"2407.21575","title":"Cloud Collision Signatures in the Central Molecular Zone","authors":"Rees A. Barnes, Felix D. Priestley","authorsParsed":[["Barnes","Rees A.",""],["Priestley","Felix D.",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 13:04:06 GMT"}],"updateDate":"2024-08-01","timestamp":1722431046000,"abstract":"  Molecular cloud collisions are a prominent theory for the formation of stars.\nObservational studies into cloud collisions identify the collision via a\nbridging feature: a continuous strip of line emission that connects two\nintensity peaks that are related in position space and separated in velocity\nspace. Currently, most observations of collisions and these bridging features\ntake place in the Milky Way disc. They are also theorized to take place in the\nCentral Molecular Zone (CMZ), where temperatures and densities are both\nsignificantly higher than in the disc. For studies in the Milky Way Disc, the\nmost commonly-used tracer tends to be CO. However, for studies in the CMZ,\nwhere the density and temperature are significantly higher, CO becomes so\nabundant that it loses its ability to adequately highlight the bridging feature\nof cloud collisions. As a result, studies have begun using other tracers, whose\nphysical and chemical behavior has not been studied under CMZ conditions. We\nperform combined hydrodynamical, chemical and radiative transfer simulations of\ncloud collisions under both disc- and CMZ-like conditions, and investigate\ncollision signatures in a number of commonly-observed molecular lines. Under\nthe Milky Way disc conditions \\( \\co \\) has the standard bridging feature;\nhowever, the other tracers, CS, HCO$^{+}$, N$_2$H$^{+}$ only emit in the\nintermediate-velocity bridge region, making the feature itself non-existent. In\nthe CMZ, the higher density and temperature make the bridging feature far more\nindistinct for CO, but the other tracers have morphologically similar bridging\nfeatures to the CO disc model, validating their use as tracers of cloud\ncollisions under these conditions.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"WKr3ZJxhX4mRH-0QF7eObxLWS2TjVTJSvbDJ1mwcxpc","pdfSize":"1160382"}