{"id":"2407.04855","title":"Towards Enhancing Coherence in Extractive Summarization: Dataset and\n  Experiments with LLMs","authors":"Mihir Parmar, Hanieh Deilamsalehy, Franck Dernoncourt, Seunghyun Yoon,\n  Ryan A. Rossi, Trung Bui","authorsParsed":[["Parmar","Mihir",""],["Deilamsalehy","Hanieh",""],["Dernoncourt","Franck",""],["Yoon","Seunghyun",""],["Rossi","Ryan A.",""],["Bui","Trung",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 20:25:04 GMT"}],"updateDate":"2024-07-09","timestamp":1720211104000,"abstract":"  Extractive summarization plays a pivotal role in natural language processing\ndue to its wide-range applications in summarizing diverse content efficiently,\nwhile also being faithful to the original content. Despite significant\nadvancement achieved in extractive summarization by Large Language Models\n(LLMs), these summaries frequently exhibit incoherence. An important aspect of\nthe coherent summary is its readability for intended users. Although there have\nbeen many datasets and benchmarks proposed for creating coherent extractive\nsummaries, none of them currently incorporate user intent to improve coherence\nin extractive summarization. Motivated by this, we propose a systematically\ncreated human-annotated dataset consisting of coherent summaries for five\npublicly available datasets and natural language user feedback, offering\nvaluable insights into how to improve coherence in extractive summaries. We\nutilize this dataset for aligning LLMs through supervised fine-tuning with\nnatural language human feedback to enhance the coherence of their generated\nsummaries. Preliminary experiments with Falcon-40B and Llama-2-13B show\nsignificant performance improvements (~10% Rouge-L) in terms of producing\ncoherent summaries. We further utilize human feedback to benchmark results over\ninstruction-tuned models such as FLAN-T5 which resulted in several interesting\nfindings. Data and source code are available at\nhttps://github.com/Mihir3009/Extract-AI.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"CDwBaK1VCwJdkxCdGCK1_9xq0l5ExE8n3TVDb6ztSPw","pdfSize":"457624"}