{"id":"2407.05342","title":"Mind the Interference: Retaining Pre-trained Knowledge in Parameter\n  Efficient Continual Learning of Vision-Language Models","authors":"Longxiang Tang, Zhuotao Tian, Kai Li, Chunming He, Hantao Zhou,\n  Hengshuang Zhao, Xiu Li, Jiaya Jia","authorsParsed":[["Tang","Longxiang",""],["Tian","Zhuotao",""],["Li","Kai",""],["He","Chunming",""],["Zhou","Hantao",""],["Zhao","Hengshuang",""],["Li","Xiu",""],["Jia","Jiaya",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 12:19:37 GMT"}],"updateDate":"2024-07-09","timestamp":1720354777000,"abstract":"  This study addresses the Domain-Class Incremental Learning problem, a\nrealistic but challenging continual learning scenario where both the domain\ndistribution and target classes vary across tasks. To handle these diverse\ntasks, pre-trained Vision-Language Models (VLMs) are introduced for their\nstrong generalizability. However, this incurs a new problem: the knowledge\nencoded in the pre-trained VLMs may be disturbed when adapting to new tasks,\ncompromising their inherent zero-shot ability. Existing methods tackle it by\ntuning VLMs with knowledge distillation on extra datasets, which demands heavy\ncomputation overhead. To address this problem efficiently, we propose the\nDistribution-aware Interference-free Knowledge Integration (DIKI) framework,\nretaining pre-trained knowledge of VLMs from a perspective of avoiding\ninformation interference. Specifically, we design a fully residual mechanism to\ninfuse newly learned knowledge into a frozen backbone, while introducing\nminimal adverse impacts on pre-trained knowledge. Besides, this residual\nproperty enables our distribution-aware integration calibration scheme,\nexplicitly controlling the information implantation process for test data from\nunseen distributions. Experiments demonstrate that our DIKI surpasses the\ncurrent state-of-the-art approach using only 0.86% of the trained parameters\nand requiring substantially less training time. Code is available at:\nhttps://github.com/lloongx/DIKI .\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"Sb6xuXY8I7LriK9Igv1uDTihqvN269rYRPC24fZTcug","pdfSize":"1459052"}
