{"id":"2407.15940","title":"Is Gamma-ray Burst 221009A Really a Once-in-10,000 Year Event?","authors":"Justin Finke and Soebur Razzaque","authorsParsed":[["Finke","Justin",""],["Razzaque","Soebur",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 18:00:08 GMT"}],"updateDate":"2024-07-24","timestamp":1721671208000,"abstract":"  Gamma-ray bursts (GRBs) brighter than the GRB 221009A, the brightest yet\nobserved, have previously been estimated to occur at a rate of 1 per 10,000\nyears, based on the extrapolation of the distribution of fluences of the Long\nGRB population. We show that bursts this bright could instead have a rate as\nhigh as approximately one per 200 years if they are from a separate population\nof narrow-jet GRBs. This population must have a maximum redshift of about\n$z\\approx 0.38$ in order to avoid over-producing the observed rate of fainter\nGRBs. We show that it will take $> 100$ years to confirm this new population\nbased on observing another GRB from it with a $\\gamma$-ray detector; observing\nan orphan optical afterglow from this population with Vera Rubin Observatory or\nan orphan radio afterglow with the Square Kilometer Array will also take\nsimilarly long times to observe, and it is unclear if they could be\ndistinguished from the standard GRB population. We show that the nearby\nnarrow-jet population has more favorable energetics for producing ultra-high\nenergy cosmic rays than standard GRBs. The rate of bursts in the Milky Way\nbright enough to cause mass extinctions of life on Earth from the narrow jet\npopulation is estimated to be approximately 1 per 500 Myr. This GRB population\ncould make life in the Milky Way less likely, with implications for future\nsearches for life on exoplanets.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"SpluQ0Ky8hC_fycA0P0cy2eERV75LEdOsKy57Y4y_5g","pdfSize":"673876","objectId":"0x63da97d64ac9d59c3490ee5085c1dbcac659626cf47926448821e79c3a97fe16","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
