{"id":"2407.09016","title":"OVExp: Open Vocabulary Exploration for Object-Oriented Navigation","authors":"Meng Wei, Tai Wang, Yilun Chen, Hanqing Wang, Jiangmiao Pang, Xihui\n  Liu","authorsParsed":[["Wei","Meng",""],["Wang","Tai",""],["Chen","Yilun",""],["Wang","Hanqing",""],["Pang","Jiangmiao",""],["Liu","Xihui",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 06:07:49 GMT"}],"updateDate":"2024-07-15","timestamp":1720764469000,"abstract":"  Object-oriented embodied navigation aims to locate specific objects, defined\nby category or depicted in images. Existing methods often struggle to\ngeneralize to open vocabulary goals without extensive training data. While\nrecent advances in Vision-Language Models (VLMs) offer a promising solution by\nextending object recognition beyond predefined categories, efficient\ngoal-oriented exploration becomes more challenging in an open vocabulary\nsetting. We introduce OVExp, a learning-based framework that integrates VLMs\nfor Open-Vocabulary Exploration. OVExp constructs scene representations by\nencoding observations with VLMs and projecting them onto top-down maps for\ngoal-conditioned exploration. Goals are encoded in the same VLM feature space,\nand a lightweight transformer-based decoder predicts target locations while\nmaintaining versatile representation abilities. To address the impracticality\nof fusing dense pixel embeddings with full 3D scene reconstruction for\ntraining, we propose constructing maps using low-cost semantic categories and\ntransforming them into CLIP's embedding space via the text encoder. The simple\nbut effective design of OVExp significantly reduces computational costs and\ndemonstrates strong generalization abilities to various navigation settings.\nExperiments on established benchmarks show OVExp outperforms previous zero-shot\nmethods, can generalize to diverse scenes, and handle different goal\nmodalities.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"AKhAGEKlqpOh_2O6HcyGK6T4rm35NrDVdWlfNYu7_bg","pdfSize":"3558881"}