{"id":"2407.10712","title":"A Proposal for a Fast Infrared Bursts Detector","authors":"Alessandro Drago, Simone Bini, Mariangela Cestelli Guidi, Augusto\n  Marcelli, Valerio Bocci, Emanuele Pace","authorsParsed":[["Drago","Alessandro",""],["Bini","Simone",""],["Guidi","Mariangela Cestelli",""],["Marcelli","Augusto",""],["Bocci","Valerio",""],["Pace","Emanuele",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 13:32:08 GMT"}],"updateDate":"2024-07-16","timestamp":1721050328000,"abstract":"  The gravitational wave GW170817 from a binary neutron star merger and the\nsimultaneous electromagnetic detection of the GRB170817A by Fermi Gamma-Ray\nSpace Telescope, opened a new era in the multi-messenger astronomy.\nFurthermore, the GRBs (Gamma-Ray Bursts) and the mysterious FRBs (Fast Radio\nBursts) have sparked interest in the development of new detectors and\ntelescopes dedicated to the time-domain astronomy across the electromagnetic\nspectrum. Time-domain astronomy aims to acquire fast astronomical bursts in\ntemporal range between a few seconds down to 1 ns. Fast InfraRed Bursts (FIRBs)\nhave been relatively understudied, often due to the lack of appropriate tools\nfor observation and analysis. In this scientific scenario, the present\ncontribution proposes a new detection system for ground-based reflecting\ntelescopes working in the mid-infrared (mid-IR) range to search for\nastronomical FIRBs. Experience developed in the diagnostics for lepton circular\naccelerators can be used to design temporal devices for astronomy. Longitudinal\ndiagnostic instruments acquire bunch-by-bunch particle shifts in the direction\nof flight, that is equivalent to temporal. Transverse device integrates the\nbeam signal in the horizontal and vertical coordinates, as standard telescopes.\nThe proposed instrument aims to work in temporal mode. Feasibility study tests\nhave been carried out at SINBAD, infrared beam line of DAFNE, the $e^+e^-$\ncollider of INFN. SINBAD releases pulsed infrared synchrotron light with 2.7 ns\nseparation. The frontend detector system has been evaluated to detect temporal\nfast infrared signals with 2-12 micron wavelengths and 1 ns rise times. The\npresent contribute aims to be a step toward a feasibility study report.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"XVj77G12M9irHw4KQPChgkuerdj8giO6pxPCxrtwCdQ","pdfSize":"857860"}