{"id":"2407.10077","title":"Transferable 3D Adversarial Shape Completion using Diffusion Models","authors":"Xuelong Dai, Bin Xiao","authorsParsed":[["Dai","Xuelong",""],["Xiao","Bin",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 04:51:32 GMT"}],"updateDate":"2024-07-16","timestamp":1720932692000,"abstract":"  Recent studies that incorporate geometric features and transformers into 3D\npoint cloud feature learning have significantly improved the performance of 3D\ndeep-learning models. However, their robustness against adversarial attacks has\nnot been thoroughly explored. Existing attack methods primarily focus on\nwhite-box scenarios and struggle to transfer to recently proposed 3D\ndeep-learning models. Even worse, these attacks introduce perturbations to 3D\ncoordinates, generating unrealistic adversarial examples and resulting in poor\nperformance against 3D adversarial defenses. In this paper, we generate\nhigh-quality adversarial point clouds using diffusion models. By using partial\npoints as prior knowledge, we generate realistic adversarial examples through\nshape completion with adversarial guidance. The proposed adversarial shape\ncompletion allows for a more reliable generation of adversarial point clouds.\nTo enhance attack transferability, we delve into the characteristics of 3D\npoint clouds and employ model uncertainty for better inference of model\nclassification through random down-sampling of point clouds. We adopt ensemble\nadversarial guidance for improved transferability across different network\narchitectures. To maintain the generation quality, we limit our adversarial\nguidance solely to the critical points of the point clouds by calculating\nsaliency scores. Extensive experiments demonstrate that our proposed attacks\noutperform state-of-the-art adversarial attack methods against both black-box\nmodels and defenses. Our black-box attack establishes a new baseline for\nevaluating the robustness of various 3D point cloud classification models.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ROl6FW97mM7PNneKuHimtPnXj4bSKBZwAKg7AYwz7RQ","pdfSize":"8175221","objectId":"0xbd07334ab9e882dad1271e3257fd704f3d65e479b322d0b3b2741928bc7ddaf9","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
