{"id":"2407.06852","title":"TE-SSL: Time and Event-aware Self Supervised Learning for Alzheimer's\n  Disease Progression Analysis","authors":"Jacob Thrasher, Alina Devkota, Ahmed Tafti, Binod Bhattarai, Prashnna\n  Gyawali","authorsParsed":[["Thrasher","Jacob",""],["Devkota","Alina",""],["Tafti","Ahmed",""],["Bhattarai","Binod",""],["Gyawali","Prashnna",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 13:41:32 GMT"}],"updateDate":"2024-07-10","timestamp":1720532492000,"abstract":"  Alzheimer's Dementia (AD) represents one of the most pressing challenges in\nthe field of neurodegenerative disorders, with its progression analysis being\ncrucial for understanding disease dynamics and developing targeted\ninterventions. Recent advancements in deep learning and various representation\nlearning strategies, including self-supervised learning (SSL), have shown\nsignificant promise in enhancing medical image analysis, providing innovative\nways to extract meaningful patterns from complex data. Notably, the computer\nvision literature has demonstrated that incorporating supervisory signals into\nSSL can further augment model performance by guiding the learning process with\nadditional relevant information. However, the application of such supervisory\nsignals in the context of disease progression analysis remains largely\nunexplored. This gap is particularly pronounced given the inherent challenges\nof incorporating both event and time-to-event information into the learning\nparadigm. Addressing this, we propose a novel framework, Time and Even-aware\nSSL (TE-SSL), which integrates time-to-event and event data as supervisory\nsignals to refine the learning process. Our comparative analysis with existing\nSSL-based methods in the downstream task of survival analysis shows superior\nperformance across standard metrics.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"yj1CpDywJBskyQ9FLVYIsXRRgyCpUnuAe26Kvr_93fw","pdfSize":"1863841"}