{"id":"2407.05075","title":"Signature of high-amplitude pulsations in seven Delta Sct stars via TESS\n  observations","authors":"Fatemeh Vasigh, Elham Ziaali, and Hossein Safari","authorsParsed":[["Vasigh","Fatemeh",""],["Ziaali","Elham",""],["Safari","Hossein",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 13:35:26 GMT"}],"updateDate":"2024-07-09","timestamp":1720272926000,"abstract":"  The regular behavior of the pulsations of high-amplitude Delta Sct (HADS)\nstars gives a greater chance to investigate the interiors of stars. We analyzed\nseven HADS stars showing peak-to-peak amplitudes of more than 0.3 mag that were\nnewly observed by TESS. We obtained that TIC374753270, TIC710783, and\nTIC187386415 pulsate in fundamental radial mode, also, TIC130474019 and\nTIC160120432 show double radial modes. On the other hand, TIC148357344 and TIC\n278119167 demonstrate triple-mode behavior. Our analysis shows that these seven\nstars are close to the red edge of the (inside) instability strip in the\nHertzsprung Russell diagram. The fundamental mode of these seven targets\nfollows the period-luminosity (PL) relation for Delta Sct stars. However,\nTIC278119167 deviates slightly from the fundamental PL relation. The\ndouble-mode and triple-mode HADS stars (TIC130474019, TIC160120432,\nTIC148357344, and TIC278119167) are in agreement with the period ratio ranges\n(fundamental to first and second overtones). Using the information of 176 HADS\nstars (Netzel and Smolec), we find a scaling relation ([Fe/H]\n~log((M**7.95+-0.15)(L**-1.83+-0.11)(P0**0.79+-0.14)(Teff**0.047+-0.02)))\nbetween the metallicity ([Fe/H]) and mass (M), luminosity (L), effective\ntemperature (Teff), and the fundamental period (P0). We estimate the\nmetallicity of the seven newly identified HADS stars ranging from -0.62 to 0.37\ndex.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"vfOShHO-Bsj8nlnVX8ybwdCNbYsFqU80Pv5dt1pm_eo","pdfSize":"1707329"}