{"id":"2407.19563","title":"Criticality enhances the reinforcement of disordered networks by rigid\n  inclusions","authors":"Jordan L. Shivers, Jingchen Feng, and Fred C. MacKintosh","authorsParsed":[["Shivers","Jordan L.",""],["Feng","Jingchen",""],["MacKintosh","Fred C.",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 19:14:42 GMT"}],"updateDate":"2024-07-30","timestamp":1722194082000,"abstract":"  The mechanical properties of biological materials are spatially\nheterogeneous. Typical tissues are made up of a spanning fibrous extracellular\nmatrix in which various inclusions, such as living cells, are embedded. While\nthe influence of inclusions on the stiffness of common elastic materials such\nas rubber has been studied for decades and can be understood in terms of the\nvolume fraction and shape of inclusions, the same is not true for disordered\nfilamentous and fibrous networks. Recent work has shown that, in isolation,\nsuch networks exhibit unusual viscoelastic behavior indicative of an underlying\nmechanical phase transition controlled by network connectivity and strain. How\nthis behavior is modified when inclusions are present is unclear. Here, we\npresent a theoretical and computational study of the influence of rigid\ninclusions on the mechanics of disordered elastic networks near the\nconnectivity-controlled central force rigidity transition. Combining scaling\ntheory and coarse-grained simulations, we predict and confirm an anomalously\nstrong dependence of the composite stiffness on inclusion volume fraction,\nbeyond that seen in ordinary composites. This stiffening exceeds the\nwell-established volume fraction-dependent stiffening expected in conventional\ncomposites, e.g., as an elastic analogue of the classic volume fraction\ndependent increase in the viscosity of liquids first identified by Einstein. We\nshow that this enhancement is a consequence of the interplay between\ninter-particle spacing and an emergent correlation length, leading to an\neffective finite-size scaling imposed by the presence of inclusions. We outline\nthe expected scaling of the shear modulus and strain fluctuations with the\ninclusion volume fraction and network connectivity, confirm these predictions\nin simulations, and discuss potential experimental tests and implications for\nour predictions in real systems.\n","subjects":["Condensed Matter/Soft Condensed Matter","Physics/Biological Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"o0Us_QcJDD-VBpEZGclw6C3YFvxpS01tLBBpiaC_KEc","pdfSize":"3359782"}