{"id":"2407.11083","title":"Empowering Graph Invariance Learning with Deep Spurious Infomax","authors":"Tianjun Yao, Yongqiang Chen, Zhenhao Chen, Kai Hu, Zhiqiang Shen, Kun\n  Zhang","authorsParsed":[["Yao","Tianjun",""],["Chen","Yongqiang",""],["Chen","Zhenhao",""],["Hu","Kai",""],["Shen","Zhiqiang",""],["Zhang","Kun",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 14:18:47 GMT"}],"updateDate":"2024-07-17","timestamp":1720880327000,"abstract":"  Recently, there has been a surge of interest in developing graph neural\nnetworks that utilize the invariance principle on graphs to generalize the\nout-of-distribution (OOD) data. Due to the limited knowledge about OOD data,\nexisting approaches often pose assumptions about the correlation strengths of\nthe underlying spurious features and the target labels. However, this prior is\noften unavailable and will change arbitrarily in the real-world scenarios,\nwhich may lead to severe failures of the existing graph invariance learning\nmethods. To bridge this gap, we introduce a novel graph invariance learning\nparadigm, which induces a robust and general inductive bias. The paradigm is\nbuilt upon the observation that the infomax principle encourages learning\nspurious features regardless of spurious correlation strengths. We further\npropose the EQuAD framework that realizes this learning paradigm and employs\ntailored learning objectives that provably elicit invariant features by\ndisentangling them from the spurious features learned through infomax. Notably,\nEQuAD shows stable and enhanced performance across different degrees of bias in\nsynthetic datasets and challenging real-world datasets up to $31.76\\%$. Our\ncode is available at \\url{https://github.com/tianyao-aka/EQuAD}.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"fZdOtnBBKSBU3mxhLxP3004J8moGTSiTOHY0Yy005fc","pdfSize":"6813397","objectId":"0x1706d5ad435816efa1c781663f747592a769e025ff16d73c45914c70dc9f7ae9","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
