{"id":"2407.20414","title":"ToF-SIMS data analysis of Shewanella oneidensis MR-1 biofilms","authors":"Gabriel D. Parker, Andrew Plymale, Luke Hanley, and Xiao-Ying Yu","authorsParsed":[["Parker","Gabriel D.",""],["Plymale","Andrew",""],["Hanley","Luke",""],["Yu","Xiao-Ying",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 20:55:22 GMT"}],"updateDate":"2024-07-31","timestamp":1722286522000,"abstract":"  Analysis of bacterial biofilms is particularly challenging and important with\ndiverse applications from systems biology to biotechnology. Among the variety\nof techniques that have been applied, time-of-flight secondary ion mass\nspectrometry (ToF-SIMS) has many promising features in studying the surface\ncharacteristics of biofilms. ToF-SIMS offers high spatial resolution and high\nmass accuracy, which permit surface sensitive analysis of biofilm components.\nThus, ToF-SIMS provides a powerful solution to addressing the challenge of\nbacterial biofilm analysis. This dataset covers ToF-SIMS analysis of Shewanella\noneidensis MR-1 isolated from freshwater lake sediment in New York state. The\nMR-1 strain is known to have metal and sulfur reducing properties and it can be\nused for bioremediation and wastewater treatment. There is a current need to\nidentify small molecules and fragments produced from bacterial biofilms. Static\nToF-SIMS spectra of MR-1 were obtained using an IONTOF TOF.SIMS V instrument\nequipped with a 25 keV Bi3+ metal ion gun. Identified molecules and molecular\nfragments are compared against known biological databases and the reported\npeaks have at least 65 ppm mass accuracy. These molecules range from lipids and\nfatty acids to flavonoids, quinolones, and other naturally occurring organic\ncompounds. It is anticipated that the spectral identification of key peaks will\nassist detection of metabolites, extracellular polymeric substance molecules\nlike polysaccharides, and biologically relevant small molecules using ToF-SIMS\nin future surface and interface research.\n","subjects":["Quantitative Biology/Biomolecules"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"FUXx64hfAZSQZhpdwWEqMeDJjnvbTpbx1cESj311lRs","pdfSize":"615816"}