{"id":"2407.15573","title":"Machine Learning-Enhanced Design of Lead-Free Halide Perovskite\n  Materials Using Density Functional Theory","authors":"Upendra Kumar, Hyeon Woo Kim, Gyanendra Kumar Maurya, Bincy Babu Raj,\n  Sobhit Singh, Ajay Kumar Kushwaha, and Sung Beom Cho and Hyunseok Ko","authorsParsed":[["Kumar","Upendra",""],["Kim","Hyeon Woo",""],["Maurya","Gyanendra Kumar",""],["Raj","Bincy Babu",""],["Singh","Sobhit",""],["Kushwaha","Ajay Kumar",""],["Cho","Sung Beom",""],["Ko","Hyunseok",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 11:59:36 GMT"}],"updateDate":"2024-07-23","timestamp":1721649576000,"abstract":"  The investigation of emerging non-toxic perovskite materials has been\nundertaken to advance the fabrication of environmentally sustainable lead-free\nperovskite solar cells. This study introduces a machine learning methodology\naimed at predicting innovative halide perovskite materials that hold promise\nfor use in photovoltaic applications. The seven newly predicted materials are\nas follows: CsMnCl$_4$, Rb$_3$Mn$_2$Cl$_9$, Rb$_4$MnCl$_6$, Rb$_3$MnCl$_5$,\nRbMn$_2$Cl$_7$, RbMn$_4$Cl$_9$, and CsIn$_2$Cl$_7$. The predicted compounds are\nfirst screened using a machine learning approach, and their validity is\nsubsequently verified through density functional theory calculations.\nCsMnCl$_4$ is notable among them, displaying a bandgap of 1.37 eV, falling\nwithin the Shockley-Queisser limit, making it suitable for photovoltaic\napplications. Through the integration of machine learning and density\nfunctional theory, this study presents a methodology that is more effective and\nthorough for the discovery and design of materials.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"bZWURzQJlcfvl2-QSNyODikDSGt__p3iZQEuY4dyBEg","pdfSize":"13486079","objectId":"0xe90982e340521e4ba31fe859a55bef288f4cbf9fd2094a0910df0cef513427be","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
