{"id":"2407.20167","title":"Measurement-based uncomputation of quantum circuits for modular\n  arithmetic","authors":"Alessandro Luongo, Antonio Michele Miti, Varun Narasimhachar, Adithya\n  Sireesh","authorsParsed":[["Luongo","Alessandro",""],["Miti","Antonio Michele",""],["Narasimhachar","Varun",""],["Sireesh","Adithya",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 16:56:42 GMT"}],"updateDate":"2024-07-30","timestamp":1722272202000,"abstract":"  Measurement-based uncomputation (MBU) is a technique used to perform\nprobabilistic uncomputation of quantum circuits. We formalize this technique\nfor the case of single-qubit registers, and we show applications to modular\narithmetic. First, we present formal statements for several variations of\nquantum circuits performing non-modular addition: controlled addition, addition\nby a constant, and controlled addition by a constant. We do the same for\nsubtraction and comparison circuits. This addresses gaps in the current\nliterature, where some of these variants were previously unexplored. Then, we\nshift our attention to modular arithmetic, where again we present formal\nstatements for modular addition, controlled modular addition, modular addition\nby a constant, and controlled modular addition by a constant, using different\nkinds of plain adders and combinations thereof. We introduce and prove a \"MBU\nlemma\" in the context of single-qubit registers, which we apply to all\naforementioned modular arithmetic circuits. Using MBU, we reduce the Toffoli\ncount and depth by $10\\%$ to $15\\%$ for modular adders based on the\narchitecture of [VBE96], and by almost $25\\%$ for modular adders based on the\narchitecture of [Bea02]. Our results have the potential to improve other\ncircuits for modular arithmetic, such as modular multiplication and modular\nexponentiation, and can find applications in quantum cryptanalysis.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"CbF9WcUd8I09RAgibKr6PHgv_jOu0Tpyclxx31GYAyA","pdfSize":"1350633","objectId":"0x8be669ae1ced5bd3abfb6de1400e894680b31029ac90ff932937a53a75a26fc6","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
