{"id":"2407.04720","title":"Laser driven miniature diamond implant for wireless retinal prostheses","authors":"Arman Ahnood, Ross Cheriton, Anne Bruneau, James A. Belcourt, Jean\n  Pierre Ndabakuranye, William Lemaire, Rob Hilkes, R\\'ejean Fontaine, John\n  P.D. Cook, Karin Hinzer, Steven Prawer","authorsParsed":[["Ahnood","Arman",""],["Cheriton","Ross",""],["Bruneau","Anne",""],["Belcourt","James A.",""],["Ndabakuranye","Jean Pierre",""],["Lemaire","William",""],["Hilkes","Rob",""],["Fontaine","Réjean",""],["Cook","John P. D.",""],["Hinzer","Karin",""],["Prawer","Steven",""]],"versions":[{"version":"v1","created":"Fri, 21 Jun 2024 01:45:58 GMT"}],"updateDate":"2024-07-09","timestamp":1718934358000,"abstract":"  The design and benchtop operation of a wireless miniature epiretinal\nstimulator implant is reported. The implant is optically powered and controlled\nusing safe illumination at near-infrared wavelengths. An application-specific\nintegrated circuit (ASIC) hosting a digital control unit is used to control the\nimplant's electrodes. The ASIC is powered using an advanced photovoltaic (PV)\ncell and programmed using a single photodiode. Diamond packaging technology is\nutilized to achieve high-density integration of the implant optoelectronic\ncircuitry, as well as individual connections between a stimulator chip and 256\nelectrodes, within a 4.6 mm x 3.7 mm x 0.9 mm implant package. An ultrahigh\nefficiency PV cell with a monochromatic power conversion efficiency of 55% is\nused to power the implant. On-board photodetection circuity with a bandwidth of\n3.7 MHz is used for forward data telemetry of stimulation parameters. In\ncomparison to implants which utilize inductively coupled coils, laser power\ndelivery enables a high degree of miniaturization and lower surgical\ncomplexity. The device presented combines the benefits of implant\nminiaturization and a flexible stimulation strategy provided by a dedicated\nstimulator chip. This development provides a route to fully wireless\nminiaturized minimally invasive implants with sophisticated functionalities.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Physics/Medical Physics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"rR5ob76GqKtiOHr3oyr72lCedWuDjk_o4DsTvmm8vwA","pdfSize":"1586746"}