{"id":"2407.19701","title":"Measuring the Adhesion of Graphene Flake Networks via Button Shear Tests","authors":"Jorge Eduardo Adatti Est\\'evez, Josef Sch\\\"atz, Jasper Ruhkopf, Annika\n  Weber, David Tumpold, Alexander Z\\\"opfl, Ulrich Krumbein, Max Christian Lemme","authorsParsed":[["Estévez","Jorge Eduardo Adatti",""],["Schätz","Josef",""],["Ruhkopf","Jasper",""],["Weber","Annika",""],["Tumpold","David",""],["Zöpfl","Alexander",""],["Krumbein","Ulrich",""],["Lemme","Max Christian",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 04:47:31 GMT"}],"updateDate":"2024-07-30","timestamp":1722228451000,"abstract":"  Graphene flake-based dispersions are attractive materials for various\napplications in microelectronics because of their ease of fabrication and the\npotential to deposit them on diverse substrates. The integration of these\nmaterials into conductive networks and microdevices requires thorough knowledge\nof their mechanical material properties, including adhesion. This paper\npresents quantitative adhesion measurements of graphene flake networks on\nsilicon dioxide (SiO${_2}$) via button shear testing (BST). In this method,\nshear forces are applied to prefabricated micrometric buttons until they\ndelaminate, providing information about the shear strength of the underlying\ngraphene. We applied BST to graphene flake networks with different flake\nstructures and defect densities. Flat flakes, a flat network structure, and a\nhigh flake defect density improve adhesion. We further demonstrate that\ngraphene flake networks have stronger adhesion than chemical vapor deposited\nmonolayer graphene grown on copper and transferred to SiO${_2}$.\nHexamethyldisilazane (HMDS) increases the total adhesion force by improving\nflake network formation. Finally, we provide flake-type-specific delamination\npatterns by combining BST, optical microscopy, and Raman spectroscopy. We\nestablish BST as a quantitative technique for measuring the adhesion of\ngraphene dispersions and show the crucial role of interflake junctions in the\noverall adhesion of graphene flake networks.\n","subjects":["Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"c9xGc79FeZKZtMey_Vk14vepq1QRBfG4ssfgQXeSn88","pdfSize":"2421130"}