{"id":"2407.21609","title":"Ironing the Graphs: Toward a Correct Geometric Analysis of Large-Scale\n  Graphs","authors":"Saloua Naama, Kav\\'e Salamatian, Francesco Bronzino","authorsParsed":[["Naama","Saloua",""],["Salamatian","Kavé",""],["Bronzino","Francesco",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 13:47:53 GMT"}],"updateDate":"2024-08-01","timestamp":1722433673000,"abstract":"  Graph embedding approaches attempt to project graphs into geometric entities,\ni.e, manifolds. The idea is that the geometric properties of the projected\nmanifolds are helpful in the inference of graph properties. However, if the\nchoice of the embedding manifold is incorrectly performed, it can lead to\nincorrect geometric inference. In this paper, we argue that the classical\nembedding techniques cannot lead to correct geometric interpretation as they\nmiss the curvature at each point, of manifold. We advocate that for doing\ncorrect geometric interpretation the embedding of graph should be done over\nregular constant curvature manifolds. To this end, we present an embedding\napproach, the discrete Ricci flow graph embedding (dRfge) based on the discrete\nRicci flow that adapts the distance between nodes in a graph so that the graph\ncan be embedded onto a constant curvature manifold that is homogeneous and\nisotropic, i.e., all directions are equivalent and distances comparable,\nresulting in correct geometric interpretations. A major contribution of this\npaper is that for the first time, we prove the convergence of discrete Ricci\nflow to a constant curvature and stable distance metrics over the edges. A\ndrawback of using the discrete Ricci flow is the high computational complexity\nthat prevented its usage in large-scale graph analysis. Another contribution of\nthis paper is a new algorithmic solution that makes it feasible to calculate\nthe Ricci flow for graphs of up to 50k nodes, and beyond. The intuitions behind\nthe discrete Ricci flow make it possible to obtain new insights into the\nstructure of large-scale graphs. We demonstrate this through a case study on\nanalyzing the internet connectivity structure between countries at the BGP\nlevel.\n","subjects":["Computing Research Repository/Computational Geometry","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"QZeoQw7AMhJjz2u_pK1_9CR0cfCqzEh75HnSl9oU8xw","pdfSize":"999384"}