{"id":"2407.21489","title":"Maverick: Efficient and Accurate Coreference Resolution Defying Recent\n  Trends","authors":"Giuliano Martinelli, Edoardo Barba and Roberto Navigli","authorsParsed":[["Martinelli","Giuliano",""],["Barba","Edoardo",""],["Navigli","Roberto",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 09:58:48 GMT"}],"updateDate":"2024-08-01","timestamp":1722419928000,"abstract":"  Large autoregressive generative models have emerged as the cornerstone for\nachieving the highest performance across several Natural Language Processing\ntasks. However, the urge to attain superior results has, at times, led to the\npremature replacement of carefully designed task-specific approaches without\nexhaustive experimentation. The Coreference Resolution task is no exception;\nall recent state-of-the-art solutions adopt large generative autoregressive\nmodels that outperform encoder-based discriminative systems. In this work,we\nchallenge this recent trend by introducing Maverick, a carefully designed - yet\nsimple - pipeline, which enables running a state-of-the-art Coreference\nResolution system within the constraints of an academic budget, outperforming\nmodels with up to 13 billion parameters with as few as 500 million parameters.\nMaverick achieves state-of-the-art performance on the CoNLL-2012 benchmark,\ntraining with up to 0.006x the memory resources and obtaining a 170x faster\ninference compared to previous state-of-the-art systems. We extensively\nvalidate the robustness of the Maverick framework with an array of diverse\nexperiments, reporting improvements over prior systems in data-scarce,\nlong-document, and out-of-domain settings. We release our code and models for\nresearch purposes at https://github.com/SapienzaNLP/maverick-coref.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"ppBj1Rhcrful_Vl56iF7tWkSqBw065sdH_UKJ50xHew","pdfSize":"428104","objectId":"0x500c5b8a98a7d5ae26ec1610539e753e5fc18d32c5d4ec65fb86ffb47113e2ec","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
