{"id":"2407.16876","title":"Associations Between Scattering Screens and Interstellar Medium\n  Filaments","authors":"Ashley M. Stock and Marten H. van Kerkwijk","authorsParsed":[["Stock","Ashley M.",""],["van Kerkwijk","Marten H.",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 22:48:09 GMT"}],"updateDate":"2024-07-25","timestamp":1721774889000,"abstract":"  Pulsar scintillation can be used to measure small scale structure in the\nGalaxy, but little is known about the specific interstellar medium features\nthat cause scintillation. We searched for interstellar medium counterparts to\nall scintillation screens for which absolute distances and scattering\norientations have been measured - a sample of 12 pulsars and 22 screens. For\none pulsar, PSR J0737-3039A, we re-analyze its scintillation screen and find\nevidence for a highly anisotropic screen. Among the screens, we found that\neight are located inside of the Local Bubble, and a further six are less than\n100 pc farther than its inner edge. Comparisons with tracers of ionized and\nmagnetized media did not find any new associations. Instead, for seven of the\npulsars analyzed, aligned HI filaments are seen for at least one of their\nscreens, for a total of 12 out of 22 screens. This result seems unlikely to be\ndue to chance: comparing with random trials, we estimate a likelihood of\nfinding 12 or more screens with aligned emission by chance of only 0.004%.\nEstimating the significance of the amount of aligned emission (in standard\ndeviations over the mean), the probability of finding as much observed aligned\nemission by chance is larger, at 1.7%, but still indicative of a real\ncorrelation. Since HI filaments are preferentially associated with cold neutral\ngas, and thus unlikely to cause scintillation, this may indicate both the\nfilaments and the screens are aligned preferentially by the same mechanisms\nsuch as magnetic fields or shocks.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"wTrgylJtzy7zEvdAbCrNfZdqEauKyybJGQZQrfcU_gs","pdfSize":"4384473"}