{"id":"2407.16804","title":"Multimodal Machine Learning in Mental Health: A Survey of Data,\n  Algorithms, and Challenges","authors":"Zahraa Al Sahili, Ioannis Patras, Matthew Purver","authorsParsed":[["Sahili","Zahraa Al",""],["Patras","Ioannis",""],["Purver","Matthew",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 19:07:56 GMT"}],"updateDate":"2024-07-25","timestamp":1721761676000,"abstract":"  The application of machine learning (ML) in detecting, diagnosing, and\ntreating mental health disorders is garnering increasing attention.\nTraditionally, research has focused on single modalities, such as text from\nclinical notes, audio from speech samples, or video of interaction patterns.\nRecently, multimodal ML, which combines information from multiple modalities,\nhas demonstrated significant promise in offering novel insights into human\nbehavior patterns and recognizing mental health symptoms and risk factors.\nDespite its potential, multimodal ML in mental health remains an emerging\nfield, facing several complex challenges before practical applications can be\neffectively developed. This survey provides a comprehensive overview of the\ndata availability and current state-of-the-art multimodal ML applications for\nmental health. It discusses key challenges that must be addressed to advance\nthe field. The insights from this survey aim to deepen the understanding of the\npotential and limitations of multimodal ML in mental health, guiding future\nresearch and development in this evolving domain.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computers and Society","Computing Research Repository/Emerging Technologies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ftAX3HNsjM-G_GYiM2Qq51ti58U9-rH10rnKhYKyM-Y","pdfSize":"508634","objectId":"0xe06f7fe63a0af14d54f759684dd0dc12e7f613c122952e5c69886d30a93fda6f","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
