{"id":"2407.04993","title":"Laminar-Turbulent Patterns in Shear Flows : Evasion of Tipping,\n  Saddle-Loop Bifurcation and Log scaling of the Turbulent Fraction","authors":"Pavan V. Kashyap, Juan F. Mar\\`in, Yohann Duguet, and Olivier Dauchot","authorsParsed":[["Kashyap","Pavan V.",""],["Marìn","Juan F.",""],["Duguet","Yohann",""],["Dauchot","Olivier",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 08:05:03 GMT"}],"updateDate":"2024-07-09","timestamp":1720253103000,"abstract":"  We analyze a one-dimensional two-scalar fields reaction advection diffusion\nmodel for the globally subcritical transition to turbulence. In this model, the\nhomogeneous turbulent state is disconnected from the laminar one and disappears\nin a tipping catastrophe scenario. The model however exhibits a linear\ninstability of the turbulent homogeneous state, mimicking the onset of the\nlaminar-turbulent patterns observed in the transitional regime of wall shear\nflows. Numerically continuing the solutions obtained at large Reynolds numbers,\nwe construct the Busse balloon associated with the multistability of the\nnonlinear solutions emerging from the instability. In the core of the balloon,\nthe turbulent fluctuations, encoded into a multiplicative noise, select the\npattern wavelength. On the lower Reynolds number side of the balloon, the\npattern follows a cascade of destabilizations towards larger and larger,\neventually infinite wavelengths. In that limit, the periodic limit cycle\nassociated with the spatial pattern hits the laminar fixed point, resulting in\na saddle-loop global bifurcation and the emergence of solitary pulse solutions.\nThis saddle-loop scenario predicts a logarithmic divergence of the wavelength,\nwhich captures experimental and numerical data in two representative shear\nflows.\n","subjects":["Physics/Fluid Dynamics","Condensed Matter/Soft Condensed Matter"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"-HfIXDZE4ckxLAf8matdTbzPQ1Cuwgx5ZxeWLX0Xn0U","pdfSize":"44687532"}