{"id":"2407.06192","title":"Multi-Object Hallucination in Vision-Language Models","authors":"Xuweiyi Chen, Ziqiao Ma, Xuejun Zhang, Sihan Xu, Shengyi Qian, Jianing\n  Yang, David F. Fouhey, Joyce Chai","authorsParsed":[["Chen","Xuweiyi",""],["Ma","Ziqiao",""],["Zhang","Xuejun",""],["Xu","Sihan",""],["Qian","Shengyi",""],["Yang","Jianing",""],["Fouhey","David F.",""],["Chai","Joyce",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 17:59:57 GMT"}],"updateDate":"2024-07-09","timestamp":1720461597000,"abstract":"  Large vision language models (LVLMs) often suffer from object hallucination,\nproducing objects not present in the given images. While current benchmarks for\nobject hallucination primarily concentrate on the presence of a single object\nclass rather than individual entities, this work systematically investigates\nmulti-object hallucination, examining how models misperceive (e.g., invent\nnonexistent objects or become distracted) when tasked with focusing on multiple\nobjects simultaneously. We introduce Recognition-based Object Probing\nEvaluation (ROPE), an automated evaluation protocol that considers the\ndistribution of object classes within a single image during testing and uses\nvisual referring prompts to eliminate ambiguity. With comprehensive empirical\nstudies and analysis of potential factors leading to multi-object\nhallucination, we found that (1) LVLMs suffer more hallucinations when focusing\non multiple objects compared to a single object. (2) The tested object class\ndistribution affects hallucination behaviors, indicating that LVLMs may follow\nshortcuts and spurious correlations.(3) Hallucinatory behaviors are influenced\nby data-specific factors, salience and frequency, and model intrinsic\nbehaviors. We hope to enable LVLMs to recognize and reason about multiple\nobjects that often occur in realistic visual scenes, provide insights, and\nquantify our progress towards mitigating the issues.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"L5OznWVHx5IFGH9nfVzHBSTxbcCywhDzzUpTrNJ_pf8","pdfSize":"1675992"}