{"id":"2407.11457","title":"Decision-Based vs. Distribution-Driven Clustering for Stochastic Energy\n  System Design Optimization","authors":"Boyung J\\\"urgens, Hagen Seele, Hendrik Schricker, Christiane Reinert,\n  Niklas von der Assen","authorsParsed":[["Jürgens","Boyung",""],["Seele","Hagen",""],["Schricker","Hendrik",""],["Reinert","Christiane",""],["von der Assen","Niklas",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 07:47:50 GMT"}],"updateDate":"2024-07-17","timestamp":1721116070000,"abstract":"  Stochastic programming is widely used for energy system design optimization\nunder uncertainty but can exponentially increase the computational complexity\nwith the number of scenarios. Common scenario reduction techniques, like\nmoments-matching or distribution-driven clustering, pre-select representative\nscenarios based on input parameters. In contrast, decision-based clustering\ngroups scenarios by similarity in resulting model decisions. Decision-based\nclustering has shown potential in network design and fleet planning. However,\nits potential in energy system design remains unexplored.\n  In our work, we examine the effectiveness of decision-based clustering in\nenergy system design using a four-step method: 1) Determine the optimal design\nfor each scenario; 2) Aggregate and normalize installed capacities as features\nreflecting optimal decisions; 3) Use these features for k-medoids clustering to\nidentify representative scenarios; 4) Utilize these scenarios to optimize cost\nin stochastic programming.\n  We apply our method to a real-world industrial energy system modeled as a\nmixed-integer linear program. We incorporate uncertainty by scaling time series\nwith representative factors. We generate 500 single-year scenarios via Monte\nCarlo sampling, which we reduce using decision-based clustering. For\nbenchmarking, we conduct distribution-driven k-medoids clustering based on the\nrepresentative factors. In our case studies, both clustering methods yield\ndesigns with similar cost efficiency, although decision-based clustering\nrequires substantially more computational resources. To our knowledge, this is\nthe first application of decision-based clustering on energy system design\noptimization. Future research should investigate the conditions under which\ndecision-based clustering yields more cost-efficient designs compared to\ndistribution-driven clustering.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"mvlYgKYEXL9DpSL1c7CwgJq5bxqhcDjRZkAlgI94CEg","pdfSize":"1934435","objectId":"0xafa43b8ff6d9114a8c9fa3d810b5f9654aa5c619045500d3a78c78e2c9a55e49","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
