{"id":"2407.03653","title":"reBEN: Refined BigEarthNet Dataset for Remote Sensing Image Analysis","authors":"Kai Norman Clasen, Leonard Hackel, Tom Burgert, Gencer Sumbul, Beg\\\"um\n  Demir, Volker Markl","authorsParsed":[["Clasen","Kai Norman",""],["Hackel","Leonard",""],["Burgert","Tom",""],["Sumbul","Gencer",""],["Demir","Begüm",""],["Markl","Volker",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 05:48:28 GMT"},{"version":"v2","created":"Mon, 29 Jul 2024 12:53:20 GMT"}],"updateDate":"2024-07-30","timestamp":1720072108000,"abstract":"  This paper presents refined BigEarthNet (reBEN) that is a large-scale,\nmulti-modal remote sensing dataset constructed to support deep learning (DL)\nstudies for remote sensing image analysis. The reBEN dataset consists of\n549,488 pairs of Sentinel-1 and Sentinel-2 image patches. To construct reBEN,\nwe initially consider the Sentinel-1 and Sentinel-2 tiles used to construct the\nBigEarthNet dataset and then divide them into patches of size 1200 m x 1200 m.\nWe apply atmospheric correction to the Sentinel-2 patches using the latest\nversion of the sen2cor tool, resulting in higher-quality patches compared to\nthose present in BigEarthNet. Each patch is then associated with a pixel-level\nreference map and scene-level multi-labels. This makes reBEN suitable for\npixel- and scene-based learning tasks. The labels are derived from the most\nrecent CORINE Land Cover (CLC) map of 2018 by utilizing the 19-class\nnomenclature as in BigEarthNet. The use of the most recent CLC map results in\novercoming the label noise present in BigEarthNet. Furthermore, we introduce a\nnew geographical-based split assignment algorithm that significantly reduces\nthe spatial correlation among the train, validation, and test sets with respect\nto those present in BigEarthNet. This increases the reliability of the\nevaluation of DL models. To minimize the DL model training time, we introduce\nsoftware tools that convert the reBEN dataset into a DL-optimized data format.\nIn our experiments, we show the potential of reBEN for multi-modal multi-label\nimage classification problems by considering several state-of-the-art DL\nmodels. The pre-trained model weights, associated code, and complete dataset\nare available at https://bigearth.net.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"TdW6-ZkJ8iQjTQuwaMfp6ojV126tXequzoxXCoh0Br4","pdfSize":"498701"}