{"id":"2407.06728","title":"3D Imaging of directional multi-scale cellulose nanostructures through\n  multi-directional dark-field neutron tomography","authors":"Matteo Busi, Elisabetta Nocerino, Agnes {\\AA}hl, Lennart Bergstr\\\"om,\n  Markus Strobl","authorsParsed":[["Busi","Matteo",""],["Nocerino","Elisabetta",""],["Åhl","Agnes",""],["Bergström","Lennart",""],["Strobl","Markus",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 10:08:59 GMT"}],"updateDate":"2024-07-10","timestamp":1720519739000,"abstract":"  Hierarchical biomaterials embody nature's intricate design principles,\noffering advanced functionalities through the complex, multi-level organization\nof their molecular and nanosized building blocks. However, the comprehensive\ncharacterization of their 3D structure remains a challenge, particularly due to\nradiation damage caused by conventional X-ray- and electron-based imaging\ntechniques, as well as due to the length scale limitations of scattering-based\ninvestigation methods. Here, we present a study utilizing multi-directional\ndark-field neutron imaging in tomographic mode to visualize the 3D\nnanoarchitecture of nanocellulose solid foams, a class of sustainable materials\npossessing complex and highly tunable hierarchical structures. By exploiting\nthe unique properties of neutrons as a probe, this non-destructive method\ncircumvents the inherent limitations of damage-inducing ionizing radiation,\npreserving the structural and chemical integrity of the biomaterials, and\nallowing for truly multiscale characterization of the spatial orientation and\ndistribution of cellulose nano fibrils within large-volume samples. In\nparticular, the study showcases the 3-dimensional anisotropic orientation and\ndegree of alignment of nanofibrils with different crystallinity, across various\nlength scales, from nanometers to centimeters. This approach offers a valuable\nand generally applicable tool for multi-scale characterisation of biobased\nmaterials where complex nanoscale arrangements inform macroscopic properties.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science","Condensed Matter/Soft Condensed Matter"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"AUqaOsnjjYXEPS3JALt1A9SO-NDF4udvMQBdyvafUfk","pdfSize":"12290271"}