{"id":"2407.11281","title":"High-Resolution Dayside Spectroscopy of WASP-189b: Detection of Iron\n  during the GHOST/Gemini South System Verification Run","authors":"Emily K. Deibert, Adam B. Langeveld, Mitchell E. Young, Laura Flagg,\n  Jake D. Turner, Peter C. B. Smith, Ernst J. W. de Mooij, Ray Jayawardhana,\n  Kristin Chiboucas, Roberto Gamen, Christian R. Hayes, Jeong-Eun Heo, Miji\n  Jeong, Venu Kalari, Eder Martioli, Vinicius M. Placco, Siyi Xu, Ruben Diaz,\n  Manuel Gomez-Jimenez, Carlos Quiroz, Roque Ruiz-Carmona, Chris Simpson, Alan\n  W. McConnachie, John Pazder, Gregory Burley, Michael Ireland, Fletcher\n  Waller, Trystyn A. M. Berg, J. Gordon Robertson, David O. Jones, Kathleen\n  Labrie, Susan Ridgway and Joanna Thomas-Osip","authorsParsed":[["Deibert","Emily K.",""],["Langeveld","Adam B.",""],["Young","Mitchell E.",""],["Flagg","Laura",""],["Turner","Jake D.",""],["Smith","Peter C. B.",""],["de Mooij","Ernst J. W.",""],["Jayawardhana","Ray",""],["Chiboucas","Kristin",""],["Gamen","Roberto",""],["Hayes","Christian R.",""],["Heo","Jeong-Eun",""],["Jeong","Miji",""],["Kalari","Venu",""],["Martioli","Eder",""],["Placco","Vinicius M.",""],["Xu","Siyi",""],["Diaz","Ruben",""],["Gomez-Jimenez","Manuel",""],["Quiroz","Carlos",""],["Ruiz-Carmona","Roque",""],["Simpson","Chris",""],["McConnachie","Alan W.",""],["Pazder","John",""],["Burley","Gregory",""],["Ireland","Michael",""],["Waller","Fletcher",""],["Berg","Trystyn A. M.",""],["Robertson","J. Gordon",""],["Jones","David O.",""],["Labrie","Kathleen",""],["Ridgway","Susan",""],["Thomas-Osip","Joanna",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 23:37:16 GMT"}],"updateDate":"2024-07-17","timestamp":1721086636000,"abstract":"  With high equilibrium temperatures and tidally locked rotation, ultra-hot\nJupiters (UHJs) are unique laboratories within which to probe extreme\natmospheric physics and chemistry. In this paper, we present high-resolution\ndayside spectroscopy of the UHJ WASP-189b obtained with the new Gemini\nHigh-resolution Optical SpecTrograph (GHOST) at the Gemini South Observatory.\nThe observations, which cover three hours of post-eclipse orbital phases, were\nobtained during the instrument's System Verification run. We detect the\nplanet's atmosphere via the Doppler cross-correlation technique, and recover a\ndetection of neutral iron in the planet's dayside atmosphere at a significance\nof 7.5$\\sigma$ in the red-arm of the data, verifying the presence of a thermal\ninversion. We also investigate the presence of other species in the atmosphere\nand discuss the implications of model injection/recovery tests. These results\nrepresent the first atmospheric characterization of an exoplanet with GHOST's\nhigh-resolution mode, and demonstrate the potential of this new instrument in\ndetecting and studying ultra-hot exoplanet atmospheres.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"TnlzR71HDIGJEniBI5_KX-o00mwh_auoSr9deAsujD4","pdfSize":"2535284"}