{"id":"2407.02961","title":"Towards a Scalable Reference-Free Evaluation of Generative Models","authors":"Azim Ospanov, Jingwei Zhang, Mohammad Jalali, Xuenan Cao, Andrej\n  Bogdanov, Farzan Farnia","authorsParsed":[["Ospanov","Azim",""],["Zhang","Jingwei",""],["Jalali","Mohammad",""],["Cao","Xuenan",""],["Bogdanov","Andrej",""],["Farnia","Farzan",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 09:54:58 GMT"}],"updateDate":"2024-07-04","timestamp":1720000498000,"abstract":"  While standard evaluation scores for generative models are mostly\nreference-based, a reference-dependent assessment of generative models could be\ngenerally difficult due to the unavailability of applicable reference datasets.\nRecently, the reference-free entropy scores, VENDI and RKE, have been proposed\nto evaluate the diversity of generated data. However, estimating these scores\nfrom data leads to significant computational costs for large-scale generative\nmodels. In this work, we leverage the random Fourier features framework to\nreduce the computational price and propose the Fourier-based Kernel Entropy\nApproximation (FKEA) method. We utilize FKEA's approximated eigenspectrum of\nthe kernel matrix to efficiently estimate the mentioned entropy scores.\nFurthermore, we show the application of FKEA's proxy eigenvectors to reveal the\nmethod's identified modes in evaluating the diversity of produced samples. We\nprovide a stochastic implementation of the FKEA assessment algorithm with a\ncomplexity $O(n)$ linearly growing with sample size $n$. We extensively\nevaluate FKEA's numerical performance in application to standard image, text,\nand video datasets. Our empirical results indicate the method's scalability and\ninterpretability applied to large-scale generative models. The codebase is\navailable at https://github.com/aziksh-ospanov/FKEA.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"JyP0sycU3ZG_3yrDCVhll1zLAndnlbd6fFkNgZeixQg","pdfSize":"42222567"}