{"id":"2407.18529","title":"A variational front-tracking method for multiphase flow with triple\n  junctions","authors":"Harald Garcke, Robert N\\\"urnberg and Quan Zhao","authorsParsed":[["Garcke","Harald",""],["Nürnberg","Robert",""],["Zhao","Quan",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 06:22:43 GMT"}],"updateDate":"2024-07-29","timestamp":1721974963000,"abstract":"  We present and analyze a variational front-tracking method for a\nsharp-interface model of multiphase flow. The fluid interfaces between\ndifferent phases are represented by curve networks in two space dimensions (2d)\nor surface clusters in three space dimensions (3d) with triple junctions where\nthree interfaces meet, and boundary points/lines where an interface meets a\nfixed planar boundary. The model is described by the incompressible\nNavier--Stokes equations in the bulk domains, with classical interface\nconditions on the fluid interfaces, and appropriate boundary conditions at the\ntriple junctions and boundary points/lines. We propose a weak formulation for\nthe model, which combines a parametric formulation for the evolving interfaces\nand an Eulerian formulation for the bulk equations. We employ an unfitted\ndiscretization of the coupled formulation to obtain a fully discrete finite\nelement method, where the existence and uniqueness of solutions can be shown\nunder weak assumptions. The constructed method admits an unconditional\nstability result in terms of the discrete energy. Furthermore, we adapt the\nintroduced method so that an exact volume preservation for each phase can be\nachieved for the discrete solutions. Numerical examples for three-phase flow\nand four-phase flow are presented to show the robustness and accuracy of the\nintroduced methods.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis","Physics/Computational Physics","Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"_NnsTDS3yTxk4IUOWgBFa2DTMi_oa3jgVOvNepD4ogg","pdfSize":"3600845"}