{"id":"2407.06951","title":"RoboCAS: A Benchmark for Robotic Manipulation in Complex Object\n  Arrangement Scenarios","authors":"Liming Zheng and Feng Yan and Fanfan Liu and Chengjian Feng and\n  Zhuoliang Kang and Lin Ma","authorsParsed":[["Zheng","Liming",""],["Yan","Feng",""],["Liu","Fanfan",""],["Feng","Chengjian",""],["Kang","Zhuoliang",""],["Ma","Lin",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 15:32:17 GMT"}],"updateDate":"2024-07-10","timestamp":1720539137000,"abstract":"  Foundation models hold significant potential for enabling robots to perform\nlong-horizon general manipulation tasks. However, the simplicity of tasks and\nthe uniformity of environments in existing benchmarks restrict their effective\ndeployment in complex scenarios. To address this limitation, this paper\nintroduces the \\textit{RoboCAS} benchmark, the first benchmark specifically\ndesigned for complex object arrangement scenarios in robotic manipulation. This\nbenchmark employs flexible and concise scripted policies to efficiently collect\na diverse array of demonstrations, showcasing scattered, orderly, and stacked\nobject arrangements within a highly realistic physical simulation environment.\nIt includes complex processes such as target retrieval, obstacle clearance, and\nrobot manipulation, testing agents' abilities to perform long-horizon planning\nfor spatial reasoning and predicting chain reactions under ambiguous\ninstructions. Extensive experiments on multiple baseline models reveal their\nlimitations in managing complex object arrangement scenarios, underscoring the\nurgent need for intelligent agents capable of performing long-horizon\noperations in practical deployments and providing valuable insights for future\nresearch directions. Project website:\n\\url{https://github.com/notFoundThisPerson/RoboCAS-v0}.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"rb7KUDMnmPSVaU4_5qhXhD4jK8IyafOkh2bmNyqHY4Q","pdfSize":"8361711"}