{"id":"2407.00919","title":"Effects of polydispersity and concentration on elastocapillary thinning\n  of dilute polymer solutions","authors":"Vincenzo Calabrese, Amy Q. Shen and Simon J. Haward","authorsParsed":[["Calabrese","Vincenzo",""],["Shen","Amy Q.",""],["Haward","Simon J.",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 02:51:28 GMT"}],"updateDate":"2024-07-02","timestamp":1719802288000,"abstract":"  The thinning of liquid bridges under capillary stress occurs in widespread\nprocesses like jetting, dripping, and spraying, and creates a strong\nextensional flow capable of stretching dissolved polymers. If the elastic\nstress exceeds the viscous stress, an exponential `elastocapillary' (EC)\nthinning regime arises, yielding a timescale $\\tau_{EC}$ commonly considered to\nbe the longest relaxation time of the polymer $\\lambda$. A longstanding\nquestion is why $\\tau_{EC}$ depends on the polymer concentration, even at high\ndilutions where $\\lambda$ should be constant in theory. To date this is\nunderstood in terms of intermolecular interactions that arise as polymers\nstretch. However, we show how the concentration dependence of $\\tau_{EC}$ can\nbe explained by considering the molecular weight distribution (MWD) inherent in\nreal polymer samples. We demonstrate this by blending low-$M$ and high-$M$\npolymer samples with narrow MWDs at dilute concentrations and in different\nproportions, and by measuring $\\tau_{EC}$ for each blend in capillary thinning\nexperiments. A simple model qualitatively reproduces the experimental results,\nshowing how elastic stresses generated by the polymer build up prior to the EC\nregime due to sequential stretching of decreasing molecular weight species in\nthe MWD. Since the elastic stress generated by each species depends on its\nconcentration, the fraction of the MWD that is required to stretch in order to\ninduce the EC regime depends on the total polymer concentration $c$. For higher\n$c$ the EC regime is induced by stretching of a higher-$M$ (longer $\\lambda$)\nfraction of the MWD, and results in a longer measurement of $\\tau_{EC}$. Our\nresults have significant implications for the application of capillary thinning\nmeasurements to extensional rheometry, for the interpretation of such\nmeasurements, and for the understanding of elastocapillary thinning dynamics in\ngeneral.\n","subjects":["Condensed Matter/Soft Condensed Matter"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"LRa3KfB7r2bkUBBY1NFQvcCQLP5n-c5CyVBgPTIp7AQ","pdfSize":"7407814","objectId":"0x5a39522fceac0dc8829c70983c4ea4bfa3473b8d16c532b8e79c2a278d0d723d","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
