{"id":"2407.15877","title":"Gaussian Process Model with Tensorial Inputs and Its Application to the\n  Design of 3D Printed Antennas","authors":"Xi Chen, Yashika Sharma, Hao Helen Zhang, Xin Hao, Qiang Zhou","authorsParsed":[["Chen","Xi",""],["Sharma","Yashika",""],["Zhang","Hao Helen",""],["Hao","Xin",""],["Zhou","Qiang",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 15:51:03 GMT"}],"updateDate":"2024-07-24","timestamp":1721404263000,"abstract":"  In simulation-based engineering design with time-consuming simulators,\nGaussian process (GP) models are widely used as fast emulators to speed up the\ndesign optimization process. In its most commonly used form, the input of GP is\na simple list of design parameters. With rapid development of additive\nmanufacturing (also known as 3D printing), design inputs with 2D/3D spatial\ninformation become prevalent in some applications, for example, neighboring\nrelations between pixels/voxels and material distributions in heterogeneous\nmaterials. Such spatial information, vital to 3D printed designs, is hard to\nincorporate into existing GP models with common kernels such as squared\nexponential or Mat\\'ern. In this work, we propose to embed a generalized\ndistance measure into a GP kernel, offering a novel and convenient technique to\nincorporate spatial information from freeform 3D printed designs into the GP\nframework. The proposed method allows complex design problems for 3D printed\nobjects to take advantage of a plethora of tools available from the GP\nsurrogate-based simulation optimization such as designed experiments and\nGP-based optimizations including Bayesian optimization. We investigate the\nproperties of the proposed method and illustrate its performance by several\nnumerical examples of 3D printed antennas. The dataset is publicly available\nat: https://github.com/xichennn/GP_dataset.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"MYAJ5M5IwWeXImn4hCBa4u88FFtY8uZ4JLzJgUPuvPI","pdfSize":"2490769"}