{"id":"2407.13700","title":"Cross-Task Attack: A Self-Supervision Generative Framework Based on\n  Attention Shift","authors":"Qingyuan Zeng, Yunpeng Gong, Min Jiang","authorsParsed":[["Zeng","Qingyuan",""],["Gong","Yunpeng",""],["Jiang","Min",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 17:01:10 GMT"}],"updateDate":"2024-07-19","timestamp":1721322070000,"abstract":"  Studying adversarial attacks on artificial intelligence (AI) systems helps\ndiscover model shortcomings, enabling the construction of a more robust system.\nMost existing adversarial attack methods only concentrate on single-task\nsingle-model or single-task cross-model scenarios, overlooking the multi-task\ncharacteristic of artificial intelligence systems. As a result, most of the\nexisting attacks do not pose a practical threat to a comprehensive and\ncollaborative AI system. However, implementing cross-task attacks is highly\ndemanding and challenging due to the difficulty in obtaining the real labels of\ndifferent tasks for the same picture and harmonizing the loss functions across\ndifferent tasks. To address this issue, we propose a self-supervised Cross-Task\nAttack framework (CTA), which utilizes co-attention and anti-attention maps to\ngenerate cross-task adversarial perturbation. Specifically, the co-attention\nmap reflects the area to which different visual task models pay attention,\nwhile the anti-attention map reflects the area that different visual task\nmodels neglect. CTA generates cross-task perturbations by shifting the\nattention area of samples away from the co-attention map and closer to the\nanti-attention map. We conduct extensive experiments on multiple vision tasks\nand the experimental results confirm the effectiveness of the proposed design\nfor adversarial attacks.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ob9hsi3BWO5PV6QVcxP8XK6kRsOq7khG72r-EUqcRnc","pdfSize":"4022979"}