{"id":"2407.09281","title":"Predicting and Understanding Human Action Decisions: Insights from Large\n  Language Models and Cognitive Instance-Based Learning","authors":"Thuy Ngoc Nguyen, Kasturi Jamale, Cleotilde Gonzalez","authorsParsed":[["Nguyen","Thuy Ngoc",""],["Jamale","Kasturi",""],["Gonzalez","Cleotilde",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 14:13:06 GMT"},{"version":"v2","created":"Mon, 5 Aug 2024 16:16:27 GMT"}],"updateDate":"2024-08-06","timestamp":1720793586000,"abstract":"  Large Language Models (LLMs) have demonstrated their capabilities across\nvarious tasks, from language translation to complex reasoning. Understanding\nand predicting human behavior and biases are crucial for artificial\nintelligence (AI) assisted systems to provide useful assistance, yet it remains\nan open question whether these models can achieve this. This paper addresses\nthis gap by leveraging the reasoning and generative capabilities of the LLMs to\npredict human behavior in two sequential decision-making tasks. These tasks\ninvolve balancing between exploitative and exploratory actions and handling\ndelayed feedback, both essential for simulating real-life decision processes.\nWe compare the performance of LLMs with a cognitive instance-based learning\n(IBL) model, which imitates human experiential decision-making. Our findings\nindicate that LLMs excel at rapidly incorporating feedback to enhance\nprediction accuracy. In contrast, the cognitive IBL model better accounts for\nhuman exploratory behaviors and effectively captures loss aversion bias, i.e.,\nthe tendency to choose a sub-optimal goal with fewer step-cost penalties rather\nthan exploring to find the optimal choice, even with limited experience. The\nresults highlight the benefits of integrating LLMs with cognitive\narchitectures, suggesting that this synergy could enhance the modeling and\nunderstanding of complex human decision-making patterns.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"pIGwbl61hZL-x1KSfTQT4jZ_vtuomEB58X6_A8d5bPc","pdfSize":"1198896","objectId":"0x99acb0560f4239670f9c732370170ff615d2b9b2255098a684ef600f4ef7a137","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
