{"id":"2407.11763","title":"Enhancing Split Computing and Early Exit Applications through Predefined\n  Sparsity","authors":"Luigi Capogrosso, Enrico Fraccaroli, Giulio Petrozziello, Francesco\n  Setti, Samarjit Chakraborty, Franco Fummi, Marco Cristani","authorsParsed":[["Capogrosso","Luigi",""],["Fraccaroli","Enrico",""],["Petrozziello","Giulio",""],["Setti","Francesco",""],["Chakraborty","Samarjit",""],["Fummi","Franco",""],["Cristani","Marco",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 14:24:04 GMT"}],"updateDate":"2024-07-17","timestamp":1721139844000,"abstract":"  In the past decade, Deep Neural Networks (DNNs) achieved state-of-the-art\nperformance in a broad range of problems, spanning from object classification\nand action recognition to smart building and healthcare. The flexibility that\nmakes DNNs such a pervasive technology comes at a price: the computational\nrequirements preclude their deployment on most of the resource-constrained edge\ndevices available today to solve real-time and real-world tasks. This paper\nintroduces a novel approach to address this challenge by combining the concept\nof predefined sparsity with Split Computing (SC) and Early Exit (EE). In\nparticular, SC aims at splitting a DNN with a part of it deployed on an edge\ndevice and the rest on a remote server. Instead, EE allows the system to stop\nusing the remote server and rely solely on the edge device's computation if the\nanswer is already good enough. Specifically, how to apply such a predefined\nsparsity to a SC and EE paradigm has never been studied. This paper studies\nthis problem and shows how predefined sparsity significantly reduces the\ncomputational, storage, and energy burdens during the training and inference\nphases, regardless of the hardware platform. This makes it a valuable approach\nfor enhancing the performance of SC and EE applications. Experimental results\nshowcase reductions exceeding 4x in storage and computational complexity\nwithout compromising performance. The source code is available at\nhttps://github.com/intelligolabs/sparsity_sc_ee.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"xv4cTR1M0ZfxR7Bk5gK1lAFpb-98q2eK2NXOpO0yvxk","pdfSize":"365322"}