{"id":"2407.17198","title":"Wind-farm wake recovery mechanisms in conventionally neutral boundary\n  layers","authors":"Luca Lanzilao and Johan Meyers","authorsParsed":[["Lanzilao","Luca",""],["Meyers","Johan",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 11:58:35 GMT"}],"updateDate":"2024-07-25","timestamp":1721822315000,"abstract":"  Synthetic-aperture radar images and mesoscale model results show that\nwind-farm wakes behave very differently than single-turbine wakes, e.g. with\nwakes that seemingly narrow and do not disperse over long distances. In the\ncurrent work, we aim at better understanding the physical mechanisms that\ngovern wind-farm wake behaviour and recovery. Hence, we study the wake\nproperties of a 1.6 GW wind-farm operating in conventionally neutral boundary\nlayers with four capping-inversion heights, i.e. 203, 319, 507 and 1001 m. In\nshallow boundary layers, we find strong flow decelerations which reduce the\nCoriolis force magnitude, leading to an anticlockwise wake deflection in the\nNorthern Hemisphere. In deep boundary layers, the vertical turbulent\nentrainment of momentum adds clockwise-turning flow from aloft into the wake\nregion, leading to a faster recovery rate and a clockwise wake deflection. To\nestimate the wake properties, we develop a simple model that fits the velocity\nmagnitude profiles along the spanwise direction. Based on this, we observe that\nthe wake narrows along the downstream direction in all cases. Further, a\ndetailed momentum budget analysis shows that the wake is mostly replenished by\nturbulent vertical entrainment in deep boundary layers. In shallow boundary\nlayers, the capping inversion limits vertical motions and wakes are mostly\nreplenished by mean flow entrainment in the spanwise direction. Moreover, in\nthese cases, we observe a counterclockwise flow rotation near the left edge of\nthe wake, which persists at each location downstream of the farm, giving rise\nto local strong streamwise velocity gradients along the spanwise direction.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"4T1TBzy16gBq_ogRDul4kTrGAl17N-BeMi2V5svogiE","pdfSize":"21918805"}