{"id":"2407.21373","title":"An all-sky catalogue of stellar reddening values","authors":"E. Paunzen, M. Netopil, M. Prisegen, N. Faltova","authorsParsed":[["Paunzen","E.",""],["Netopil","M.",""],["Prisegen","M.",""],["Faltova","N.",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 06:55:46 GMT"}],"updateDate":"2024-08-01","timestamp":1722408946000,"abstract":"  When observing astronomical objects, we must deal with extinction (i.e. the\nabsorption and scattering of the emitted radiation by dust and gas between the\nsource and the observer). Interstellar extinction depends on the location of\nthe object and the wavelength. The different extinction laws describing these\neffects are difficult to estimate for a small sample of stars. Many\nsophisticated and automatic methods have recently been developed for estimating\nastrophysical parameters (age and metallicity, for example) depending on the\nreddening, which is usually treated as a free parameter within the\ncorresponding estimations. However, many reddening values for stars have been\npublished over the last few decades, most of which include observations in the\nultraviolet, which are essential for a good estimation but are essentially no\nlonger considered. We searched the literature through the end of 2022 for\npublished independent reddening values of stellar objects based on various\nmethods that exclude estimates from reddening maps. In addition, we present new\nreddening estimates based on the classical photometric indices in the Geneva,\nJohnson, and Stromgren-Crawford systems. These are based on well-established\nand reliable calibrations. After a careful identification procedure and quality\nassessment of the data, we calculated the mean reddening values of 157 631\nindividual available measurements for 97 826 objects. We find several\nstatistically significant offsets and trends within the different references\nand discuss possible explanations for them.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"EHvq-A3uJKq6a8dKTsB1yja9l7vt47tSBRnSqGmDxzs","pdfSize":"1199354","objectId":"0x40d3ca307c3d63a46299c4706f5c38ab4c8045ef674bf4a3626634640e6f681e","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
