{"id":"2407.06859","title":"All known Type Ia supernovae models fail to reproduce the observed\n  bolometric luminosity-width correlation","authors":"Amir Sharon and Doron Kushnir","authorsParsed":[["Sharon","Amir",""],["Kushnir","Doron",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 13:45:58 GMT"}],"updateDate":"2024-07-10","timestamp":1720532758000,"abstract":"  Type Ia supernovae (SNe Ia) are widely believed to arise from thermonuclear\nexplosions of white dwarfs (WDs). However, ongoing debate surrounds their\nprogenitor systems and the mechanisms triggering these explosions. Recently,\nSharon \\& Kushnir showed that existing models do not reproduce the observed\npositive correlation between the $\\gamma$-ray escape time, $t_0$, and the\nsynthesized $^{56}$Ni mass, $M_\\mathrm{Ni56}$. Their analysis, while avoiding\ncomplex radiation transfer (RT) calculations, did not account for the\nviewing-angle dependence of the derived $t_0$ and $M_\\mathrm{Ni56}$ in\nmulti-dimensional (multi-D) models during pre-nebular phases, where most\nobservations performed. Here, we aim to identify an observational\nwidth-luminosity relation, similar to the $t_0$-$M_\\mathrm{Ni56}$ relation to\nconstrain multi-D models during pre-nebular phases while minimizing RT\ncalculation uncertainties. We show that the bolometric luminosity at $t\\le30$\ndays since explosion can be accurately computed without non-thermal ionization\nconsiderations, which are computationally expensive and uncertain. We find that\nthe ratio of the bolometric luminosity at 30 days since explosion to the peak\nluminosity, $L_{30}/Lp$, correlates strongly with $t_0$. Using a sample of\nwell-observed SNe Ia, we show that this parameter tightly correlates with the\npeak luminosity, $L_p$. We compare the observed $L_{30}/Lp$-$L_p$ distribution\nwith models from the literature, including non-spherical models consisting of\nhead-on WD collisions and off-centered ignitions of sub-Chandrasekhar mass WDs.\nWe find that all known SNe Ia models fail to reproduce the observed bolometric\nluminosity-width correlation.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"JjjaJTgPLH7vu2XooyYGLl21BjN_yNGdLaMC1YlwmiY","pdfSize":"1727514"}