{"id":"2407.13117","title":"SOMONITOR: Explainable Marketing Data Processing and Analysis with Large\n  Language Models","authors":"Qi Yang, Sergey Nikolenko, Marlo Ongpin, Ilia Gossoudarev, Yu-Yi\n  Chu-Farseeva, Aleksandr Farseev","authorsParsed":[["Yang","Qi",""],["Nikolenko","Sergey",""],["Ongpin","Marlo",""],["Gossoudarev","Ilia",""],["Chu-Farseeva","Yu-Yi",""],["Farseev","Aleksandr",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 02:55:52 GMT"}],"updateDate":"2024-07-19","timestamp":1721271352000,"abstract":"  Online marketing faces formidable challenges in managing and interpreting\nimmense volumes of data necessary for competitor analysis, content research,\nand strategic branding. It is impossible to review hundreds to thousands of\ntransient online content items by hand, and partial analysis often leads to\nsuboptimal outcomes and poorly performing campaigns. We introduce an\nexplainable AI framework SoMonitor that aims to synergize human intuition with\nAI-based efficiency, helping marketers across all stages of the marketing\nfunnel, from strategic planning to content creation and campaign execution.\nSoMonitor incorporates a CTR prediction and ranking model for advertising\ncontent and uses large language models (LLMs) to process high-performing\ncompetitor content, identifying core content pillars such as target audiences,\ncustomer needs, and product features. These pillars are then organized into\nbroader categories, including communication themes and targeted customer\npersonas. By integrating these insights with data from the brand's own\nadvertising campaigns, SoMonitor constructs a narrative for addressing new\ncustomer personas and simultaneously generates detailed content briefs in the\nform of user stories that can be directly applied by marketing teams to\nstreamline content production and campaign execution. The adoption of SoMonitor\nin daily operations allows digital marketers to quickly parse through extensive\ndatasets, offering actionable insights that significantly enhance campaign\neffectiveness and overall job satisfaction\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Multimedia"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"67LndHlWgN6Sgp8CE0WKF4jyAF4bEZPKIgI5xGRf0lU","pdfSize":"10605583","objectId":"0x3692f62a119ccb9c177afee824565735812b68fd6ca900004b22802839349116","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
