{"id":"2407.09387","title":"Meta-Analysis with Untrusted Data","authors":"Shiva Kaul,Geoffrey J. Gordon","authorsParsed":[["Kaul","Shiva",""],["Gordon","Geoffrey J.",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 16:07:53 GMT"}],"updateDate":"2024-07-15","timestamp":1720800473000,"abstract":"  [See paper for full abstract] Meta-analysis is a crucial tool for answering\nscientific questions. It is usually conducted on a relatively small amount of\n``trusted'' data -- ideally from randomized, controlled trials -- which allow\ncausal effects to be reliably estimated with minimal assumptions. We show how\nto answer causal questions much more precisely by making two changes. First, we\nincorporate untrusted data drawn from large observational databases, related\nscientific literature and practical experience -- without sacrificing rigor or\nintroducing strong assumptions. Second, we train richer models capable of\nhandling heterogeneous trials, addressing a long-standing challenge in\nmeta-analysis. Our approach is based on conformal prediction, which\nfundamentally produces rigorous prediction intervals, but doesn't handle\nindirect observations: in meta-analysis, we observe only noisy effects due to\nthe limited number of participants in each trial. To handle noise, we develop a\nsimple, efficient version of fully-conformal kernel ridge regression, based on\na novel condition called idiocentricity. We introduce noise-correcting terms in\nthe residuals and analyze their interaction with a ``variance shaving''\ntechnique. In multiple experiments on healthcare datasets, our algorithms\ndeliver tighter, sounder intervals than traditional ones. This paper charts a\nnew course for meta-analysis and evidence-based medicine, where heterogeneity\nand untrusted data are embraced for more nuanced and precise predictions.\n","subjects":["Statistics/Machine Learning","Computing Research Repository/Machine Learning","Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"C1RXeRfEIwInsu8W_kOCvFQDAVr_oHuGr-9T-dtfBYM","pdfSize":"835648"}