{"id":"2407.16996","title":"Quotient complex (QC)-based machine learning for 2D perovskite design","authors":"Chuan-Shen Hu, Rishikanta Mayengbam, Kelin Xia, Tze Chien Sum","authorsParsed":[["Hu","Chuan-Shen",""],["Mayengbam","Rishikanta",""],["Xia","Kelin",""],["Sum","Tze Chien",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 04:37:00 GMT"}],"updateDate":"2024-07-25","timestamp":1721795820000,"abstract":"  With remarkable stability and exceptional optoelectronic properties,\ntwo-dimensional (2D) halide layered perovskites hold immense promise for\nrevolutionizing photovoltaic technology. Presently, inadequate representations\nhave substantially impeded the design and discovery of 2D perovskites. In this\ncontext, we introduce a novel computational topology framework termed the\nquotient complex (QC), which serves as the foundation for the material\nrepresentation. Our QC-based features are seamlessly integrated with learning\nmodels for the advancement of 2D perovskite design. At the heart of this\nframework lies the quotient complex descriptors (QCDs), representing a quotient\nvariation of simplicial complexes derived from materials unit cell and periodic\nboundary conditions. Differing from prior material representations, this\napproach encodes higher-order interactions and periodicity information\nsimultaneously. Based on the well-established New Materials for Solar\nEnergetics (NMSE) databank, our QC-based machine learning models exhibit\nsuperior performance against all existing counterparts. This underscores the\nparamount role of periodicity information in predicting material functionality,\nwhile also showcasing the remarkable efficiency of the QC-based model in\ncharacterizing materials structural attributes.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science","Mathematics/Algebraic Topology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"IJ-4iDVb9Oy5MHzATsdRWdfqKPkU32MVZ572flNN9pU","pdfSize":"9662604"}