{"id":"2407.05134","title":"Solving for X and Beyond: Can Large Language Models Solve Complex Math\n  Problems with More-Than-Two Unknowns?","authors":"Kuei-Chun Kao, Ruochen Wang, Cho-Jui Hsieh","authorsParsed":[["Kao","Kuei-Chun",""],["Wang","Ruochen",""],["Hsieh","Cho-Jui",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 17:01:04 GMT"}],"updateDate":"2024-07-09","timestamp":1720285264000,"abstract":"  Large Language Models (LLMs) have demonstrated remarkable performance in\nsolving math problems, a hallmark of human intelligence. Despite high success\nrates on current benchmarks; however, these often feature simple problems with\nonly one or two unknowns, which do not sufficiently challenge their reasoning\ncapacities. This paper introduces a novel benchmark, BeyondX, designed to\naddress these limitations by incorporating problems with multiple unknowns.\nRecognizing the challenges in proposing multi-unknown problems from scratch, we\ndeveloped BeyondX using an innovative automated pipeline that progressively\nincreases complexity by expanding the number of unknowns in simpler problems.\nEmpirical study on BeyondX reveals that the performance of existing LLMs, even\nthose fine-tuned specifically on math tasks, significantly decreases as the\nnumber of unknowns increases - with a performance drop of up to 70\\% observed\nin GPT-4. To tackle these challenges, we propose the Formulate-and-Solve\nstrategy, a generalized prompting approach that effectively handles problems\nwith an arbitrary number of unknowns. Our findings reveal that this strategy\nnot only enhances LLM performance on the BeyondX benchmark but also provides\ndeeper insights into the computational limits of LLMs when faced with more\ncomplex mathematical challenges.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"I3layL1SqIVPaziUkcdPl-Ych_FkNsjQxtmRJNFS9bk","pdfSize":"2476206"}