{"id":"2407.04345","title":"CanonicalFusion: Generating Drivable 3D Human Avatars from Multiple\n  Images","authors":"Jisu Shin, Junmyeong Lee, Seongmin Lee, Min-Gyu Park, Ju-Mi Kang, Ju\n  Hong Yoon, Hae-Gon Jeon","authorsParsed":[["Shin","Jisu",""],["Lee","Junmyeong",""],["Lee","Seongmin",""],["Park","Min-Gyu",""],["Kang","Ju-Mi",""],["Yoon","Ju Hong",""],["Jeon","Hae-Gon",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 08:36:26 GMT"},{"version":"v2","created":"Mon, 15 Jul 2024 07:07:16 GMT"}],"updateDate":"2024-07-16","timestamp":1720168586000,"abstract":"  We present a novel framework for reconstructing animatable human avatars from\nmultiple images, termed CanonicalFusion. Our central concept involves\nintegrating individual reconstruction results into the canonical space. To be\nspecific, we first predict Linear Blend Skinning (LBS) weight maps and depth\nmaps using a shared-encoder-dual-decoder network, enabling direct\ncanonicalization of the 3D mesh from the predicted depth maps. Here, instead of\npredicting high-dimensional skinning weights, we infer compressed skinning\nweights, i.e., 3-dimensional vector, with the aid of pre-trained MLP networks.\nWe also introduce a forward skinning-based differentiable rendering scheme to\nmerge the reconstructed results from multiple images. This scheme refines the\ninitial mesh by reposing the canonical mesh via the forward skinning and by\nminimizing photometric and geometric errors between the rendered and the\npredicted results. Our optimization scheme considers the position and color of\nvertices as well as the joint angles for each image, thereby mitigating the\nnegative effects of pose errors. We conduct extensive experiments to\ndemonstrate the effectiveness of our method and compare our CanonicalFusion\nwith state-of-the-art methods. Our source codes are available at\nhttps://github.com/jsshin98/CanonicalFusion.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"8StnHN1zxuMJOlENmNpuNZ9ua_e_NjqBc2z0VvDw_-Y","pdfSize":"4501772"}