{"id":"2407.12131","title":"Improving Health Information Access in the World's Largest Maternal\n  Mobile Health Program via Bandit Algorithms","authors":"Arshika Lalan, Shresth Verma, Paula Rodriguez Diaz, Panayiotis\n  Danassis, Amrita Mahale, Kumar Madhu Sudan, Aparna Hegde, Milind Tambe,\n  Aparna Taneja","authorsParsed":[["Lalan","Arshika",""],["Verma","Shresth",""],["Diaz","Paula Rodriguez",""],["Danassis","Panayiotis",""],["Mahale","Amrita",""],["Sudan","Kumar Madhu",""],["Hegde","Aparna",""],["Tambe","Milind",""],["Taneja","Aparna",""]],"versions":[{"version":"v1","created":"Tue, 14 May 2024 07:21:49 GMT"}],"updateDate":"2024-07-18","timestamp":1715671309000,"abstract":"  Harnessing the wide-spread availability of cell phones, many nonprofits have\nlaunched mobile health (mHealth) programs to deliver information via voice or\ntext to beneficiaries in underserved communities, with maternal and infant\nhealth being a key area of such mHealth programs. Unfortunately, dwindling\nlistenership is a major challenge, requiring targeted interventions using\nlimited resources. This paper focuses on Kilkari, the world's largest mHealth\nprogram for maternal and child care - with over 3 million active subscribers at\na time - launched by India's Ministry of Health and Family Welfare (MoHFW) and\nrun by the non-profit ARRMAN. We present a system called CHAHAK that aims to\nreduce automated dropouts as well as boost engagement with the program through\nthe strategic allocation of interventions to beneficiaries. Past work in a\nsimilar domain has focused on a much smaller scale mHealth program and used\nmarkovian restless multiarmed bandits to optimize a single limited intervention\nresource. However this paper demonstrates the challenges in adopting a\nmarkovian approach in Kilkari; therefore CHAHAK instead relies on non-markovian\ntime-series restless bandits, and optimizes multiple interventions to improve\nlistenership. We use real Kilkari data from the Odisha state in India to show\nCHAHAK's effectiveness in harnessing multiple interventions to boost\nlistenership, benefiting marginalized communities. When deployed CHAHAK will\nassist the largest maternal mHealth program to date.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning","Computing Research Repository/Multiagent Systems"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"62mCOrfnB-H5iKwBo1cD9FKq0LLJFkJF8JGRs_t6r1Y","pdfSize":"854073"}