{"id":"2407.09009","title":"Probing Cold-to-Temperate Exoplanetary Atmospheres: The Role of Water\n  Condensation on Surface Identification with JWST","authors":"Ziyu Huang, Xinting Yu, Shang-Min Tsai, Julianne I. Moses, Kazumasa\n  Ohno, Joshua Krissansen-Totton, Xi Zhang, and Jonathan Fortney","authorsParsed":[["Huang","Ziyu",""],["Yu","Xinting",""],["Tsai","Shang-Min",""],["Moses","Julianne I.",""],["Ohno","Kazumasa",""],["Krissansen-Totton","Joshua",""],["Zhang","Xi",""],["Fortney","Jonathan",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 05:58:28 GMT"},{"version":"v2","created":"Tue, 3 Sep 2024 18:18:51 GMT"}],"updateDate":"2024-09-05","timestamp":1720763908000,"abstract":"  Understanding the surface temperature and interior structure of\ncold-to-temperate sub-Neptunes is critical for assessing their habitability,\nyet direct observations are challenging. In this study, we investigate the\nimpact of water condensation on the atmospheric compositions of sub-Neptunes,\nfocusing on the implications for JWST spectroscopic observations. By modeling\nthe atmospheric photochemistry of two canonical sub-Neptunes, K2-18 b and LHS\n1140 b, both with and without water condensation and with and without thick\natmospheres, we demonstrate that water condensation can significantly affect\nthe predicted atmospheric compositions. This effect is driven by oxygen\ndepletion from the condensation of water vapor and primarily manifests as an\nincrease in the C/O ratio within the photochemically active regions of the\natmosphere. This change in composition particularly affects planets with thin\nH2-dominated atmospheres, leading to a transition in dominant nitrogen and\ncarbon carriers from N2 and oxygen-rich species like CO/CO2 towards heavier\nhydrocarbons and nitriles. While our models do not fully account for the loss\nmechanisms of these higher-order species, such molecules can go on to form more\nrefractory molecules or hazes. Planets with thin H2-rich atmospheres undergoing\nsignificant water condensation are thus likely to exhibit very hazy\natmospheres. The relatively flat JWST spectra observed for LHS 1140 b could be\nconsistent with such a scenario, suggesting a shallow surface with extensive\nwater condensation or a high atmospheric C/O ratio. Conversely, the JWST\nobservations of K2-18 b are better aligned with a volatile-rich mini-Neptune\nwith a thick atmosphere.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"qhPz43NJJ64gQvpMSkn-CrM1TkFs_HY5ONli20BNKmY","pdfSize":"3515039"}