{"id":"2407.16291","title":"TAPTRv2: Attention-based Position Update Improves Tracking Any Point","authors":"Hongyang Li, Hao Zhang, Shilong Liu, Zhaoyang Zeng, Feng Li, Tianhe\n  Ren, Bohan Li, Lei Zhang","authorsParsed":[["Li","Hongyang",""],["Zhang","Hao",""],["Liu","Shilong",""],["Zeng","Zhaoyang",""],["Li","Feng",""],["Ren","Tianhe",""],["Li","Bohan",""],["Zhang","Lei",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 08:46:14 GMT"}],"updateDate":"2024-07-24","timestamp":1721724374000,"abstract":"  In this paper, we present TAPTRv2, a Transformer-based approach built upon\nTAPTR for solving the Tracking Any Point (TAP) task. TAPTR borrows designs from\nDEtection TRansformer (DETR) and formulates each tracking point as a point\nquery, making it possible to leverage well-studied operations in DETR-like\nalgorithms. TAPTRv2 improves TAPTR by addressing a critical issue regarding its\nreliance on cost-volume,which contaminates the point query\\'s content feature\nand negatively impacts both visibility prediction and cost-volume computation.\nIn TAPTRv2, we propose a novel attention-based position update (APU) operation\nand use key-aware deformable attention to realize. For each query, this\noperation uses key-aware attention weights to combine their corresponding\ndeformable sampling positions to predict a new query position. This design is\nbased on the observation that local attention is essentially the same as\ncost-volume, both of which are computed by dot-production between a query and\nits surrounding features. By introducing this new operation, TAPTRv2 not only\nremoves the extra burden of cost-volume computation, but also leads to a\nsubstantial performance improvement. TAPTRv2 surpasses TAPTR and achieves\nstate-of-the-art performance on many challenging datasets, demonstrating the\nsuperiority\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"hHEnrC4kpJ3sTibW2oLbrPEy2h2rusROq3KuMFRlGHA","pdfSize":"10554146","objectId":"0x71e8ae986254424e366ede00c2dbfd50876ed7d1d507a8365ca4a850414e4730","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
