{"id":"2407.03823","title":"Role of clustered nuclear geometry in particle production through p-C\n  and p-O collisions at the Large Hadron Collider","authors":"Aswathy Menon K R, Suraj Prasad, Neelkamal Mallick, and Raghunath\n  Sahoo","authorsParsed":[["R","Aswathy Menon K",""],["Prasad","Suraj",""],["Mallick","Neelkamal",""],["Sahoo","Raghunath",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 10:49:13 GMT"}],"updateDate":"2024-07-08","timestamp":1720090153000,"abstract":"  Long-range multi-particle correlations in heavy-ion collisions have shown\nconclusive evidence of the hydrodynamic behavior of strongly interacting\nmatter, and are associated with the final-state azimuthal momentum anisotropy.\nIn small collision systems, azimuthal anisotropy can be influenced by the\nhadronization mechanism and residual jet-like correlations. Thus, one of the\nmotives of the planned p--O and O--O collisions at the LHC and RHIC is to\nunderstand the origin of small system collectivity. As the anisotropic flow\ncoefficients ($v_n$) are sensitive to the initial-state effects including\nnuclear shape, deformation, and charge density profiles, studies involving\n$^{12}$C and $^{16}$O nuclei are transpiring due to the presence of exotic\n$\\alpha$ ($^{4}$He) clusters in such nuclei. In this study, for the first time,\nwe investigate the effects of nuclear $\\alpha$--clusters on the azimuthal\nanisotropy of the final-state hadrons in p--C and p--O collisions at\n$\\sqrt{s_{\\rm NN}}= 9.9$ TeV within a multi-phase transport model framework. We\nreport the transverse momentum ($p_{\\rm T}$) and pseudorapidity ($\\eta$)\nspectra, participant eccentricity ($\\epsilon_2$) and triangularity\n($\\epsilon_3$), and estimate the elliptic flow ($v_2$) and triangular flow\n($v_3$) of the final-state hadrons using the two-particle cumulant method.\nThese results are compared with a model-independent Sum of Gaussians (SOG) type\nnuclear density profile for $^{12}$C and $^{16}$O nuclei.\n","subjects":["Physics/Nuclear Theory","Physics/High Energy Physics - Experiment","Physics/High Energy Physics - Phenomenology","Physics/Nuclear Experiment"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"pSca7kaVq8s7i3moun4zhfJuRwN0sZ2qSWzLvLUhPXU","pdfSize":"1281119"}
