{"id":"2407.11066","title":"Quantum inverse scattering for the 20-vertex model up to Dynkin\n  automorphism: crossing probabilities, 3D Poisson structure, triangular height\n  functions, weak integrability","authors":"Pete Rigas","authorsParsed":[["Rigas","Pete",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 04:16:43 GMT"},{"version":"v2","created":"Wed, 7 Aug 2024 12:47:06 GMT"}],"updateDate":"2024-08-08","timestamp":1720757803000,"abstract":"  We initiate a novel application of the quantum-inverse scattering method for\nthe 20-vertex model, building upon seminal work from Faddeev and Takhtajan on\nthe study of Hamiltonian systems, with applications to crossing probabilities,\n3D Poisson structure, triangular height functions, and integrability. In\ncomparison to a previous work of the author in late $2023$ which characterized\nintegrability of a Hamiltonian flow for the 6-vertex model from integrability\nof inhomogeneous limit shapes, formalized in a work of Keating, Reshetikhin and\nSridhar, notions similar to those of integrability can be realized for the\n20-vertex model by studying new classes of higher-dimensional L-operators. In\ncomparison to two-dimensional L-operators expressed in terms of Pauli basis\nelements, three-dimensional L-operators provided by Boos and colleagues have\nalgebraic, combinatorial, and geometric, qualities, all of which impact leading\norder approximations of correlations, products of L-operators, the transfer\nmatrix, and the quantum monodromy matrix in finite volume. In comparison to the\ninhomogeneous 6-vertex model, the 20-vertex model does not enjoy as strong of\nan integrability property through the existence of suitable action-angle\nvariables, which is of interest to further explore, possibly from information\non limit shapes given solutions to the three-dimensional Euler-Lagrange\nequations.\n","subjects":["Physics/Mathematical Physics","Condensed Matter/Statistical Mechanics","Mathematics/Mathematical Physics","Mathematics/Probability"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"mKocL0z2U45zQRNKgYaF2qDWaYLs_chjnHOGIV_bAzE","pdfSize":"1860724"}