{"id":"2407.14068","title":"A \"Rosetta Stone\" for Studies of Spatial Variation in Astrophysical\n  Data: Power Spectra, Semivariograms, and Structure Functions","authors":"Benjamin Metha and Sabrina Berger","authorsParsed":[["Metha","Benjamin",""],["Berger","Sabrina",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 06:53:49 GMT"}],"updateDate":"2024-07-22","timestamp":1721372029000,"abstract":"  From the turbulent interstellar medium to the cosmic web, astronomers in many\ndifferent fields have needed to make sense of spatial data describing our\nUniverse, spanning centimetre to Gigaparsec scales. Through different\nhistorical choices for mathematical conventions, many different subfields of\nspatial data analysis have evolved their own language for analysing structures\nand quantifying correlation in spatial data. Because of this history,\nterminology from a myriad of different fields is used, often to describe two\ndata products that are mathematically identical. In this Note, we define and\ndescribe the differences and similarities between the power spectrum, the\ntwo-point correlation function, the covariance function, the semivariogram, and\nthe structure functions, in an effort to unify the languages used to study\nspatial correlation. We also highlight under which conditions these data\nproducts are useful and describe how the results found using one method can be\ntranslated to those found using another, allowing for easier comparison between\ndifferent subfields' native methods. We hope for this document to be a\n``Rosetta Stone\" for translating between different statistical approaches,\nallowing results to be shared between researchers from different backgrounds,\nfacilitating more cross-disciplinary approaches to data analysis.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7JCrZfCDj3tbnd7Sd0JKl_79jcIXC3xwnjzsPz7bD0E","pdfSize":"1707265","objectId":"0x319c5052662b2cac5c68acbd5e2b3abc7e0c5e8f458e4da455b871130a62ce3e","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
