{"id":"2407.01073","title":"No More Potentially Dynamic Objects: Static Point Cloud Map Generation\n  based on 3D Object Detection and Ground Projection","authors":"Soojin Woo, Donghwi Jung, and Seong-Woo Kim","authorsParsed":[["Woo","Soojin",""],["Jung","Donghwi",""],["Kim","Seong-Woo",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 08:25:27 GMT"}],"updateDate":"2024-07-02","timestamp":1719822327000,"abstract":"  In this paper, we propose an algorithm to generate a static point cloud map\nbased on LiDAR point cloud data. Our proposed pipeline detects dynamic objects\nusing 3D object detectors and projects points of dynamic objects onto the\nground. Typically, point cloud data acquired in real-time serves as a snapshot\nof the surrounding areas containing both static objects and dynamic objects.\nThe static objects include buildings and trees, otherwise, the dynamic objects\ncontain objects such as parked cars that change their position over time.\nRemoving dynamic objects from the point cloud map is crucial as they can\ndegrade the quality and localization accuracy of the map. To address this\nissue, in this paper, we propose an algorithm that creates a map only\nconsisting of static objects. We apply a 3D object detection algorithm to the\npoint cloud data which are obtained from LiDAR to implement our pipeline. We\nthen stack the points to create the map after performing ground segmentation\nand projection. As a result, not only we can eliminate currently dynamic\nobjects at the time of map generation but also potentially dynamic objects such\nas parked vehicles. We validate the performance of our method using two kinds\nof datasets collected on real roads: KITTI and our dataset. The result\ndemonstrates the capability of our proposal to create an accurate static map\nexcluding dynamic objects from input point clouds. Also, we verified the\nimproved performance of localization using a generated map based on our method.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"ah-lOeDdYUmBO27WMIfjJWeA_YrMylXegHwD24IdAfs","pdfSize":"4835324"}