{"id":"2407.17531","title":"Subaru/CHARIS High-Resolution Mode Spectroscopy of the Brown Dwarf\n  Companion HD 33632 Ab","authors":"Aidan Gibbs, Briley Lewis, Michael Fitzgerald, Timothy Brandt, Minghan\n  Chen, Yiting Li, Rachel Bowens-Rubin, Rebecca Jensen-Clem, Benjamin Mazin","authorsParsed":[["Gibbs","Aidan",""],["Lewis","Briley",""],["Fitzgerald","Michael",""],["Brandt","Timothy",""],["Chen","Minghan",""],["Li","Yiting",""],["Bowens-Rubin","Rachel",""],["Jensen-Clem","Rebecca",""],["Mazin","Benjamin",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 23:01:10 GMT"}],"updateDate":"2024-07-26","timestamp":1721775670000,"abstract":"  Brown dwarfs (BD) are model degenerate in age and mass. High-contrast imaging\nand spectroscopy of BD companions to host stars where the mass and age can be\nindependently constrained by dynamics and stellar age indicators respectively\nprovide valuable tests of BD evolution models. In this paper, we present a new\nepoch of Subaru/CHARIS H- and K-band observations of one such previously\ndiscovered system, HD 33632 Ab. We reanalyze the mass and orbit using our new\nepoch of extracted relative astrometry, and fit extracted spectra to the newest\ngeneration of equilibrium, disequilibrium, and cloudy spectral and evolution\nmodels for BDs. No spectral model perfectly agrees with evolutionary tracks and\nthe derived mass and age, instead favoring a somewhat younger BD than the host\nstar's inferred age. This tension can potentially be resolved using atmosphere\nand evolution models that consider both clouds and disequilibrium chemistry\nsimultaneously, or by additional future spectra at higher resolution or in\nother band passes. Photometric measurements alone remain consistent with the\nluminosity predicted by evolutionary tracks. Our work highlights the importance\nof considering complexities like clouds, disequilibrium chemistry, and\ncomposition when comparing spectral models to evolutionary tracks.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"wLmKPmJ50pHPO2YYWgF7mSVdcUzP27NIhZN0m5Ywhts","pdfSize":"2826283"}