{"id":"2407.10596","title":"An evaluation of CNN models and data augmentation techniques in\n  hierarchical localization of mobile robots","authors":"J.J. Cabrera, O. J. C\\'espedes, S. Cebollada, O. Reinoso, L. Pay\\'a","authorsParsed":[["Cabrera","J. J.",""],["Céspedes","O. J.",""],["Cebollada","S.",""],["Reinoso","O.",""],["Payá","L.",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 10:20:00 GMT"}],"updateDate":"2024-07-16","timestamp":1721038800000,"abstract":"  This work presents an evaluation of CNN models and data augmentation to carry\nout the hierarchical localization of a mobile robot by using omnidireccional\nimages. In this sense, an ablation study of different state-of-the-art CNN\nmodels used as backbone is presented and a variety of data augmentation visual\neffects are proposed for addressing the visual localization of the robot. The\nproposed method is based on the adaption and re-training of a CNN with a dual\npurpose: (1) to perform a rough localization step in which the model is used to\npredict the room from which an image was captured, and (2) to address the fine\nlocalization step, which consists in retrieving the most similar image of the\nvisual map among those contained in the previously predicted room by means of a\npairwise comparison between descriptors obtained from an intermediate layer of\nthe CNN. In this sense, we evaluate the impact of different state-of-the-art\nCNN models such as ConvNeXt for addressing the proposed localization. Finally,\na variety of data augmentation visual effects are separately employed for\ntraining the model and their impact is assessed. The performance of the\nresulting CNNs is evaluated under real operation conditions, including changes\nin the lighting conditions. Our code is publicly available on the project\nwebsite https://github.com/juanjo-cabrera/IndoorLocalizationSingleCNN.git\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"SXGP3LyVgFXoQOzNoJSrIYbfLydGhTJDpQStbQqbGSw","pdfSize":"1040310","objectId":"0xf6c4ccac5ae54336951d3f70af8aa6f4c9a1c111a52003baa01b808abaf872b1","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
