{"id":"2407.01955","title":"S2D: Sorted Speculative Decoding For More Efficient Deployment of Nested\n  Large Language Models","authors":"Parsa Kavehzadeh, Mohammadreza Pourreza, Mojtaba Valipour, Tinashu\n  Zhu, Haoli Bai, Ali Ghodsi, Boxing Chen, Mehdi Rezagholizadeh","authorsParsed":[["Kavehzadeh","Parsa",""],["Pourreza","Mohammadreza",""],["Valipour","Mojtaba",""],["Zhu","Tinashu",""],["Bai","Haoli",""],["Ghodsi","Ali",""],["Chen","Boxing",""],["Rezagholizadeh","Mehdi",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 05:14:15 GMT"}],"updateDate":"2024-07-03","timestamp":1719897255000,"abstract":"  Deployment of autoregressive large language models (LLMs) is costly, and as\nthese models increase in size, the associated costs will become even more\nconsiderable. Consequently, different methods have been proposed to accelerate\nthe token generation process and reduce costs. Speculative decoding (SD) is\namong the most promising approaches to speed up the LLM decoding process by\nverifying multiple tokens in parallel and using an auxiliary smaller draft\nmodel to generate the possible tokens. In SD, usually, one draft model is used\nto serve a specific target model; however, in practice, LLMs are diverse, and\nwe might need to deal with many target models or more than one target model\nsimultaneously. In this scenario, it is not clear which draft model should be\nused for which target model, and searching among different draft models or\ntraining customized draft models can further increase deployment costs. In this\npaper, we first introduce a novel multi-target scenario for the deployment of\ndraft models for faster inference. Then, we present a novel, more efficient\nsorted speculative decoding mechanism that outperforms regular baselines in\nmulti-target settings. We evaluated our method on Spec-Bench in different\nsettings, including base models such as Vicuna 7B, 13B, and LLama Chat 70B. Our\nresults suggest that our draft models perform better than baselines for\nmultiple target models at the same time.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"sTRF7-aDtqxoD_Xuq96NG5Ht1FPBpXW7yYhFSrt0fhk","pdfSize":"585067"}