{"id":"2407.07937","title":"Rising from the ashes: evidence of old stellar populations and\n  rejuvenation events in the very early Universe","authors":"Callum Witten, William McClymont, Nicolas Laporte, Guido\n  Roberts-Borsani, Debora Sijacki, Sandro Tacchella, Charlotte Simmonds, Harley\n  Katz, Richard S. Ellis, Joris Witstok, Roberto Maiolino, Xihan Ji, Billy R.\n  Hayes, Tobias J. Looser, Francesco D'Eugenio","authorsParsed":[["Witten","Callum",""],["McClymont","William",""],["Laporte","Nicolas",""],["Roberts-Borsani","Guido",""],["Sijacki","Debora",""],["Tacchella","Sandro",""],["Simmonds","Charlotte",""],["Katz","Harley",""],["Ellis","Richard S.",""],["Witstok","Joris",""],["Maiolino","Roberto",""],["Ji","Xihan",""],["Hayes","Billy R.",""],["Looser","Tobias J.",""],["D'Eugenio","Francesco",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 18:00:00 GMT"}],"updateDate":"2024-07-12","timestamp":1720634400000,"abstract":"  While JWST has observed galaxies assembling as early as $z\\sim14$, evidence\nof galaxies with significant old stellar populations in the Epoch of\nReionisation (EoR) -- the descendants of these earliest galaxies -- are few and\nfar between. Bursty star-formation histories (SFHs) have been invoked to\nexplain the detectability of the earliest UV-bright galaxies, but also to\ninterpret galaxies showing Balmer breaks without nebular emission lines. We\npresent the first spectroscopic evidence of a $z\\sim7.9$ galaxy, A2744-YD4,\nwhich shows a Balmer break and emission lines, indicating the presence of both\na mature and young stellar population. The spectrum of A2744-YD4 shows peculiar\nemission line ratios suggesting a relatively low ionisation parameter and high\ngas-phase metallicity. A median stack of galaxies with similar emission line\nratios reveals a clear Balmer break in their stacked spectrum. This suggests\nthat a mature stellar population ($\\sim 80$ Myr old) has produced a chemically\nenriched, disrupted interstellar medium. Based on SED-fitting and comparison to\nsimulations, we conclude that the observed young stellar population is in fact\nthe result of a rejuvenation event following a lull in star formation lasting\n$\\sim 20$ Myr, making A2744-YD4 and our stack the first spectroscopic\nconfirmation of galaxies that have rejuvenated following a mini-quenched phase.\nThese rejuvenating galaxies appear to be in an exceptional evolutionary moment\nwhere they can be identified. Our analysis shows that a young stellar\npopulation of just $\\sim 30 \\%$ of the total stellar mass would erase the\nBalmer break. Hence, 'outshining' through bursty SFHs of galaxies in the early\nUniverse is likely plaguing attempts to measure their stellar ages and masses\naccurately.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"YWNB-FY6UX27KRTurWT4Vkuk_72i8NWKbEN7OoUZv0o","pdfSize":"1117840"}