{"id":"2407.19247","title":"Experiments and phenomenology of electric dipole moments","authors":"Joan Ruiz-Vidal","authorsParsed":[["Ruiz-Vidal","Joan",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 12:58:53 GMT"}],"updateDate":"2024-07-30","timestamp":1722085133000,"abstract":"  The Standard Model (SM) is the best description of fundamental particles and\ntheir interactions we have to date. From this theory, all phenomena in the\nmacroscopic world (except for gravity) can be explained, and it has\nsuccessfully predicted all outcomes of particle experiments on Earth. However,\ncosmological observations of the early Universe yield a large imbalance between\nits content of matter and antimatter, which is several orders of magnitude\nabove the SM prediction. To explain these observations, new interactions that\ndo not respect the charge-parity symmetry must exist beyond the SM. Such\ninteractions would induce electric dipole moments (EDMs) in known particles.\n  In Part I of this thesis, we propose to extend the active experimental\nprogram of EDM searches to charm and bottom baryons, $\\tau$ leptons, and\n$\\Lambda$ hyperons; also allowing the measurement of their corresponding\nmagnetic dipole moments (MDMs). The EDM and MDM of short-lived particles can be\naccessed with a bent-crystal experiment to be installed in the Large Hadron\nCollider (LHC), while longer-lived $\\Lambda$ particles can be measured at the\nLHCb experiment with no additional instrumentation. In Part II, an analysis of\nLHCb data to measure the $\\Lambda$ polarization in $\\Lambda_c^+ \\to \\Lambda\n\\pi^+ \\pi^+ \\pi^-$ decays, essential ingredient for the proposed measurement,\nis presented. In the last part of the thesis, we derive new indirect bounds on\nheavy quark EDMs with already available data and explore the phenomenological\nimplications of these and other EDM limits on New Physics models, with special\nemphasis on extensions of the SM with colour-octet scalars.\n","subjects":["Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Experiment"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"-NUNjZ6fN4XLqtdr82GIjNCn5VlKAVYFSLrNVPN2VdE","pdfSize":"19265052","objectId":"0x24a001c7b03d9abba85f1b3488086350289ec3d780252bfc60caa5f663cb5141","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
