{"id":"2407.18574","title":"Learning to Enhance Aperture Phasor Field for Non-Line-of-Sight Imaging","authors":"In Cho, Hyunbo Shim, Seon Joo Kim","authorsParsed":[["Cho","In",""],["Shim","Hyunbo",""],["Kim","Seon Joo",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 07:57:07 GMT"},{"version":"v2","created":"Mon, 29 Jul 2024 03:33:47 GMT"}],"updateDate":"2024-07-30","timestamp":1721980627000,"abstract":"  This paper aims to facilitate more practical NLOS imaging by reducing the\nnumber of samplings and scan areas. To this end, we introduce a phasor-based\nenhancement network that is capable of predicting clean and full measurements\nfrom noisy partial observations. We leverage a denoising autoencoder scheme to\nacquire rich and noise-robust representations in the measurement space. Through\nthis pipeline, our enhancement network is trained to accurately reconstruct\ncomplete measurements from their corrupted and partial counterparts. However,\nwe observe that the \\naive application of denoising often yields degraded and\nover-smoothed results, caused by unnecessary and spurious frequency signals\npresent in measurements. To address this issue, we introduce a phasor-based\npipeline designed to limit the spectrum of our network to the frequency range\nof interests, where the majority of informative signals are detected. The\nphasor wavefronts at the aperture, which are band-limited signals, are employed\nas inputs and outputs of the network, guiding our network to learn from the\nfrequency range of interests and discard unnecessary information. The\nexperimental results in more practical acquisition scenarios demonstrate that\nwe can look around the corners with $16\\times$ or $64\\times$ fewer samplings\nand $4\\times$ smaller apertures. Our code is available at\nhttps://github.com/join16/LEAP.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"z1XKq6nRiwEiRcHGK4XBLZWuQrzrA_vIy2QHjWg6Nuo","pdfSize":"7117743"}