{"id":"2407.01214","title":"Revisiting Random Walks for Learning on Graphs","authors":"Jinwoo Kim, Olga Zaghen, Ayhan Suleymanzade, Youngmin Ryou, Seunghoon\n  Hong","authorsParsed":[["Kim","Jinwoo",""],["Zaghen","Olga",""],["Suleymanzade","Ayhan",""],["Ryou","Youngmin",""],["Hong","Seunghoon",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 11:59:59 GMT"}],"updateDate":"2024-07-02","timestamp":1719835199000,"abstract":"  We revisit a simple idea for machine learning on graphs, where a random walk\non a graph produces a machine-readable record, and this record is processed by\na deep neural network to directly make vertex-level or graph-level predictions.\nWe refer to these stochastic machines as random walk neural networks, and show\nthat we can design them to be isomorphism invariant while capable of universal\napproximation of graph functions in probability. A useful finding is that\nalmost any kind of record of random walk guarantees probabilistic invariance as\nlong as the vertices are anonymized. This enables us to record random walks in\nplain text and adopt a language model to read these text records to solve graph\ntasks. We further establish a parallelism to message passing neural networks\nusing tools from Markov chain theory, and show that over-smoothing in message\npassing is alleviated by construction in random walk neural networks, while\nover-squashing manifests as probabilistic under-reaching. We show that random\nwalk neural networks based on pre-trained language models can solve several\nhard problems on graphs, such as separating strongly regular graphs where the\n3-WL test fails, counting substructures, and transductive classification on\narXiv citation network without training. Code is available at\nhttps://github.com/jw9730/random-walk.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_OIyfySeWLsn4by4GrP6ZBTJ2e4loLIoFY-RvyMcXd4","pdfSize":"1250708"}