{"id":"2407.00616","title":"DADEE: Well-calibrated uncertainty quantification in neural networks for\n  barriers-based robot safety","authors":"Masoud Ataei and Vikas Dhiman","authorsParsed":[["Ataei","Masoud",""],["Dhiman","Vikas",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 07:55:32 GMT"}],"updateDate":"2024-07-02","timestamp":1719734132000,"abstract":"  Uncertainty-aware controllers that guarantee safety are critical for safety\ncritical applications. Among such controllers, Control Barrier Functions (CBFs)\nbased approaches are popular because they are fast, yet safe. However, most\nsuch works depend on Gaussian Processes (GPs) or MC-Dropout for learning and\nuncertainty estimation, and both approaches come with drawbacks: GPs are\nnon-parametric methods that are slow, while MC-Dropout does not capture\naleatoric uncertainty. On the other hand, modern Bayesian learning algorithms\nhave shown promise in uncertainty quantification. The application of modern\nBayesian learning methods to CBF-based controllers has not yet been studied. We\naim to fill this gap by surveying uncertainty quantification algorithms and\nevaluating them on CBF-based safe controllers. We find that model\nvariance-based algorithms (for example, Deep ensembles, MC-dropout, etc.) and\ndirect estimation-based algorithms (such as DEUP) have complementary strengths.\nAlgorithms in the former category can only estimate uncertainty accurately\nout-of-domain, while those in the latter category can only do so in-domain. We\ncombine the two approaches to obtain more accurate uncertainty estimates both\nin- and out-of-domain. As measured by the failure rate of a simulated robot,\nthis results in a safer CBF-based robot controller.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Machine Learning","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"naNc_mWIj_IqhRO4BRWN6TPuOTo_8hNR62Ihoi8iHfQ","pdfSize":"962996"}