{"id":"2407.02984","title":"Semantically Rich Local Dataset Generation for Explainable AI in\n  Genomics","authors":"Pedro Barbosa, Rosina Savisaar, Alcides Fonseca","authorsParsed":[["Barbosa","Pedro",""],["Savisaar","Rosina",""],["Fonseca","Alcides",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 10:31:30 GMT"},{"version":"v2","created":"Fri, 5 Jul 2024 10:48:27 GMT"},{"version":"v3","created":"Wed, 17 Jul 2024 09:30:42 GMT"}],"updateDate":"2024-07-18","timestamp":1720002690000,"abstract":"  Black box deep learning models trained on genomic sequences excel at\npredicting the outcomes of different gene regulatory mechanisms. Therefore,\ninterpreting these models may provide novel insights into the underlying\nbiology, supporting downstream biomedical applications. Due to their\ncomplexity, interpretable surrogate models can only be built for local\nexplanations (e.g., a single instance). However, accomplishing this requires\ngenerating a dataset in the neighborhood of the input, which must maintain\nsyntactic similarity to the original data while introducing semantic\nvariability in the model's predictions. This task is challenging due to the\ncomplex sequence-to-function relationship of DNA.\n  We propose using Genetic Programming to generate datasets by evolving\nperturbations in sequences that contribute to their semantic diversity. Our\ncustom, domain-guided individual representation effectively constrains\nsyntactic similarity, and we provide two alternative fitness functions that\npromote diversity with no computational effort. Applied to the RNA splicing\ndomain, our approach quickly achieves good diversity and significantly\noutperforms a random baseline in exploring the search space, as shown by our\nproof-of-concept, short RNA sequence. Furthermore, we assess its\ngeneralizability and demonstrate scalability to larger sequences, resulting in\na ~30% improvement over the baseline.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Neural and Evolutionary Computing","Quantitative Biology/Genomics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"rGC6mpJKWtjlEZdOVcyyZoLXRmBQ7HkKXdp-I2sqsiY","pdfSize":"3422665"}