{"id":"2407.09654","title":"A foundational framework for the mesoscale modeling of dynamic\n  elastomers and gels","authors":"Robert J. Wagner and Meredith N. Silberstein","authorsParsed":[["Wagner","Robert J.",""],["Silberstein","Meredith N.",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 19:22:37 GMT"}],"updateDate":"2024-07-16","timestamp":1720812157000,"abstract":"  Discrete mesoscale network models, in which explicitly modeled polymer chains\nare replaced by implicit pairwise potentials, are capable of predicting the\nmacroscale mechanical response of polymeric materials such as elastomers and\ngels, while offering greater insight into microstructural phenomena than\nconstitutive theory or macroscale experiments alone. However, whether such\nmesoscale models accurately represent the molecular structures of polymer\nnetworks requires investigation during their development, particularly in the\ncase of dynamic polymers that restructure in time. We here introduce and\ncompare the topological and mechanical predictions of an idealized,\nreduced-order mesoscale approach in which only tethered dynamic bonding sites\nand crosslinks in a polymer's backbone are explicitly modeled, to those of\nmolecular theory and a Kremer-Grest, coarse-grained molecular dynamics\napproach. We find that for short chain networks at intermediate polymer packing\nfractions, undergoing relatively slow loading rates, the mesoscale approach\nreasonably reproduces the chain conformations, bond kinetic rates, and ensemble\nstress responses predicted by molecular theory and the bead-spring model.\nFurther, it does so with a 90% reduction in computational cost. These savings\ngrant the mesoscale model access to larger spatiotemporal domains than\nconventional molecular dynamics, enabling simulation of large deformations as\nwell as durations approaching experimental timescales (e.g., those utilized in\nDMA). While the model investigated is for monodisperse polymer networks in\ntheta-solvent, without entanglement, charge interactions, long-range dynamic\nbond interactions, or other confounding physical effects, this work highlights\nthe utility of these models and lays a foundational groundwork for the\nincorporation of such phenomena moving forward.\n","subjects":["Condensed Matter/Soft Condensed Matter","Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Statistical Mechanics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"tgSGdpWzoUEw_zDw5cm5FzFwykT5lUTJagw8tHvMkXM","pdfSize":"10145729"}