{"id":"2407.03690","title":"Robust CATE Estimation Using Novel Ensemble Methods","authors":"Oshri Machluf, Tzviel Frostig, Gal Shoham, Tomer Milo, Elad Berkman,\n  Raviv Pryluk","authorsParsed":[["Machluf","Oshri",""],["Frostig","Tzviel",""],["Shoham","Gal",""],["Milo","Tomer",""],["Berkman","Elad",""],["Pryluk","Raviv",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 07:23:02 GMT"},{"version":"v2","created":"Mon, 8 Jul 2024 04:48:07 GMT"},{"version":"v3","created":"Thu, 11 Jul 2024 09:28:04 GMT"}],"updateDate":"2024-07-12","timestamp":1720077782000,"abstract":"  The estimation of Conditional Average Treatment Effects (CATE) is crucial for\nunderstanding the heterogeneity of treatment effects in clinical trials. We\nevaluate the performance of common methods, including causal forests and\nvarious meta-learners, across a diverse set of scenarios, revealing that each\nof the methods struggles in one or more of the tested scenarios. Given the\ninherent uncertainty of the data-generating process in real-life scenarios, the\nrobustness of a CATE estimator to various scenarios is critical for its\nreliability. To address this limitation of existing methods, we propose two new\nensemble methods that integrate multiple estimators to enhance prediction\nstability and performance - Stacked X-Learner which uses the X-Learner with\nmodel stacking for estimating the nuisance functions, and Consensus Based\nAveraging (CBA), which averages only the models with highest internal\nagreement. We show that these models achieve good performance across a wide\nrange of scenarios varying in complexity, sample size and structure of the\nunderlying-mechanism, including a biologically driven model for PD-L1\ninhibition pathway for cancer treatment. Furthermore, we demonstrate improved\nperformance by the Stacked X-Learner also when comparing to other ensemble\nmethods, including R-Stacking, Causal-Stacking and others.\n","subjects":["Statistics/Methodology","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"XW-p4JT6ocbVsjFLtZfalTIWr3BWG9edgm7zeTdiaug","pdfSize":"555407"}
