{"id":"2407.09496","title":"Physics-Informed Neural Network based inverse framework for\n  time-fractional differential equations for rheology","authors":"Sukirt Thakur, Harsa Mitra, and Arezoo M. Ardekani","authorsParsed":[["Thakur","Sukirt",""],["Mitra","Harsa",""],["Ardekani","Arezoo M.",""]],"versions":[{"version":"v1","created":"Thu, 6 Jun 2024 01:29:17 GMT"}],"updateDate":"2024-07-16","timestamp":1717637357000,"abstract":"  Time-fractional differential equations offer a robust framework for capturing\nintricate phenomena characterized by memory effects, particularly in fields\nlike biotransport and rheology. However, solving inverse problems involving\nfractional derivatives presents notable challenges, including issues related to\nstability and uniqueness. While Physics-Informed Neural Networks (PINNs) have\nemerged as effective tools for solving inverse problems, most existing PINN\nframeworks primarily focus on integer-ordered derivatives.\n  In this study, we extend the application of PINNs to address inverse problems\ninvolving time-fractional derivatives, specifically targeting two problems: 1)\nanomalous diffusion and 2) fractional viscoelastic constitutive equation.\nLeveraging both numerically generated datasets and experimental data, we\ncalibrate the concentration-dependent generalized diffusion coefficient and\nparameters for the fractional Maxwell model. We devise a tailored residual loss\nfunction that scales with the standard deviation of observed data.\n  We rigorously test our framework's efficacy in handling anomalous diffusion.\nEven after introducing 25% Gaussian noise to the concentration dataset, our\nframework demonstrates remarkable robustness. Notably, the relative error in\npredicting the generalized diffusion coefficient and the order of the\nfractional derivative is less than 10% for all cases, underscoring the\nresilience and accuracy of our approach. In another test case, we predict\nrelaxation moduli for three pig tissue samples, consistently achieving relative\nerrors below 10%. Furthermore, our framework exhibits promise in modeling\nanomalous diffusion and non-linear fractional viscoelasticity.\n","subjects":["Computing Research Repository/Neural and Evolutionary Computing","Computing Research Repository/Machine Learning","Computing Research Repository/Numerical Analysis","Mathematics/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"iEa0MpdOxHdeDqpC5OfMWBKtCm1qRuaStRG8eGtgQdA","pdfSize":"1456006"}