{"id":"2407.14957","title":"Strongly Isomorphic Neural Optimal Transport Across Incomparable Spaces","authors":"Athina Sotiropoulou, David Alvarez-Melis","authorsParsed":[["Sotiropoulou","Athina",""],["Alvarez-Melis","David",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 18:27:11 GMT"}],"updateDate":"2024-07-23","timestamp":1721500031000,"abstract":"  Optimal Transport (OT) has recently emerged as a powerful framework for\nlearning minimal-displacement maps between distributions. The predominant\napproach involves a neural parametrization of the Monge formulation of OT,\ntypically assuming the same space for both distributions. However, the setting\nacross ``incomparable spaces'' (e.g., of different dimensionality),\ncorresponding to the Gromov- Wasserstein distance, remains underexplored, with\nexisting methods often imposing restrictive assumptions on the cost function.\nIn this paper, we present a novel neural formulation of the Gromov-Monge (GM)\nproblem rooted in one of its fundamental properties: invariance to strong\nisomorphisms. We operationalize this property by decomposing the learnable OT\nmap into two components: (i) an approximate strong isomorphism between the\nsource distribution and an intermediate reference distribution, and (ii) a\nGM-optimal map between this reference and the target distribution. Our\nformulation leverages and extends the Monge gap regularizer of Uscidda & Cuturi\n(2023) to eliminate the need for complex architectural requirements of other\nneural OT methods, yielding a simple but practical method that enjoys favorable\ntheoretical guarantees. Our preliminary empirical results show that our\nframework provides a promising approach to learn OT maps across diverse spaces.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"UCJQi7275PCTzijF3zf8wer2EUeCt2WM4J_ufJFse7g","pdfSize":"3100427","objectId":"0xfdbb671c1f734d926843d3a32361b11adceac526cd885443c70de2ad14b18fe3","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
