{"id":"2407.19074","title":"Parsimonious Universal Function Approximator for Elastic and\n  Elasto-Plastic Cavity Expansion Problems","authors":"Xiao-Xuan Chen, Pin Zhang, Hai-Sui Yu, Zhen-Yu Yin and Brian Sheil","authorsParsed":[["Chen","Xiao-Xuan",""],["Zhang","Pin",""],["Yu","Hai-Sui",""],["Yin","Zhen-Yu",""],["Sheil","Brian",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 14:05:14 GMT"}],"updateDate":"2024-07-30","timestamp":1720447514000,"abstract":"  Cavity expansion is a canonical problem in geotechnics, which can be\ndescribed by partial differential equations (PDEs) and ordinary differential\nequations (ODEs). This study explores the potential of using a new solver, a\nphysics-informed neural network (PINN), to calculate the stress field in an\nexpanded cavity in the elastic and elasto-plastic regimes. Whilst PINNs have\nemerged as an effective universal function approximator for deriving the\nsolutions of a wide range of governing PDEs/ODEs, their ability to solve\nelasto-plastic problems remains uncertain. A novel parsimonious loss function\nis first proposed to balance the simplicity and accuracy of PINN. The proposed\nmethod is applied to diverse material behaviours in the cavity expansion\nproblem including isotropic, anisotropic elastic media, and elastic-perfectly\nplastic media with Tresca and Mohr-Coulomb yield criteria. The results indicate\nthat the use of a parsimonious prior information-based loss function is highly\nbeneficial to deriving the approximate solutions of complex PDEs with high\naccuracy. The present method allows for accurate derivation of solutions for\nboth elastic and plastic mechanical responses of an expanded cavity. It also\nprovides insights into how PINNs can be further advanced to solve more complex\nproblems in geotechnical practice.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"b45ECWUB9jWLEa2WcqWFSySb03dempjeAkrdD6rPFNw","pdfSize":"2115577"}