{"id":"2407.00598","title":"Direct Observation of Morphological and Chemical Changes During the\n  Oxidation of Model Inorganic Ligand-Capped Particles","authors":"Maximilian Jaugstetter, Xiao Qi, Emory Chan, Miquel Salmeron, Kevin R.\n  Wilson, Slavom\\'ir Nem\\v{s}\\'ak, Hendrik Bluhm","authorsParsed":[["Jaugstetter","Maximilian",""],["Qi","Xiao",""],["Chan","Emory",""],["Salmeron","Miquel",""],["Wilson","Kevin R.",""],["Nemšák","Slavomír",""],["Bluhm","Hendrik",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 05:49:58 GMT"}],"updateDate":"2024-07-02","timestamp":1719726598000,"abstract":"  Functionalization and volatilization are competing reactions during the\noxidation of carbonaceous materials and are important processes in many\ndifferent areas of science and technology. Here we present a combined ambient\npressure X-ray photoelectron spectroscopy (APXPS) and grazing incidence X-ray\nscattering (GIXS) investigation of the oxidation of oleic acid ligands\nsurrounding NaYF4 nanoparticles (NPs) deposited onto SiOx/Si substrates. While\nAPXPS monitors the evolution of the oxidation products, GIXS provides insight\ninto the morphology of the ligands and particles before and after the\noxidation. Our investigation shows that the oxidation of the oleic acid ligands\nproceeds at O2 partial pressures of below 1 mbar in the presence of X-rays,\nwith the oxidation eventually reaching a steady state in which mainly CHx and\n-COOH functional groups are observed. The scattering data reveal that the\noxidation and volatilization reaction proceeds preferentially on the side of\nthe particle facing the gas phase, leading to the formation of a chemically and\nmorphologically asymmetric ligand layer. This comprehensive picture of the\noxidation process could only be obtained by combining the X-ray scattering and\nAPXPS data. The investigation presented here lays the foundation for further\nstudies of the stability of NP layers in the presence of reactive trace gasses\nand ionizing radiation, and for other nanoscale systems where chemical and\nmorphological changes happen simultaneously and cannot be understood in\nisolation.\n","subjects":["Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"tjXAWkaj4owrFIFt9dxItpgahWT7ZSFBSJ8z0ELpclY","pdfSize":"2908573"}