{"id":"2407.06244","title":"Neural population dynamics in songbird RA and HVC during learned\n  motor-vocal behavior","authors":"Pablo Tostado-Marcos, Ezequiel M. Arneodo, Lauren Ostrowski, Daril E.\n  Brown II, Xavier A. Perez, Adam Kadwory, Lauren L. Stanwicks, Abdullah\n  Alothman, Timothy Q. Gentner and Vikash Gilja","authorsParsed":[["Tostado-Marcos","Pablo",""],["Arneodo","Ezequiel M.",""],["Ostrowski","Lauren",""],["Brown","Daril E.","II"],["Perez","Xavier A.",""],["Kadwory","Adam",""],["Stanwicks","Lauren L.",""],["Alothman","Abdullah",""],["Gentner","Timothy Q.",""],["Gilja","Vikash",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 12:03:10 GMT"}],"updateDate":"2024-08-09","timestamp":1720440190000,"abstract":"  Complex, learned motor behaviors involve the coordination of large-scale\nneural activity across multiple brain regions, but our understanding of the\npopulation-level dynamics within different regions tied to the same behavior\nremains limited. Here, we investigate the neural population dynamics underlying\nlearned vocal production in awake-singing songbirds. We use Neuropixels probes\nto record the simultaneous extracellular activity of populations of neurons in\ntwo regions of the vocal motor pathway. In line with observations made in\nnon-human primates during limb-based motor tasks, we show that the\npopulation-level activity in both the premotor nucleus HVC and the motor\nnucleus RA is organized on low-dimensional neural manifolds upon which\ncoordinated neural activity is well described by temporally structured\ntrajectories during singing behavior. Both the HVC and RA latent trajectories\nprovide relevant information to predict vocal sequence transitions between song\nsyllables. However, the dynamics of these latent trajectories differ between\nregions. Our state-space models suggest a unique and continuous-over-time\ncorrespondence between the latent space of RA and vocal output, whereas the\ncorresponding relationship for HVC exhibits a higher degree of neural\nvariability. We then demonstrate that comparable high-fidelity reconstruction\nof continuous vocal outputs can be achieved from HVC and RA neural latents and\nspiking activity. Unlike those that use spiking activity, however, decoding\nmodels using neural latents generalize to novel sub-populations in each region,\nconsistent with the existence of preserved manifolds that confine vocal-motor\nactivity in HVC and RA.\n","subjects":["Quantitative Biology/Neurons and Cognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"aZ1ouhS3E5m88hxVRshfwJcH2-FRtAbJvAMDPe1lG0k","pdfSize":"16152668"}