{"id":"2407.17383","title":"A Comprehensive Approach to Misspelling Correction with BERT and\n  Levenshtein Distance","authors":"Amirreza Naziri, Hossein Zeinali","authorsParsed":[["Naziri","Amirreza",""],["Zeinali","Hossein",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 16:07:11 GMT"}],"updateDate":"2024-07-25","timestamp":1721837231000,"abstract":"  Writing, as an omnipresent form of human communication, permeates nearly\nevery aspect of contemporary life. Consequently, inaccuracies or errors in\nwritten communication can lead to profound consequences, ranging from financial\nlosses to potentially life-threatening situations. Spelling mistakes, among the\nmost prevalent writing errors, are frequently encountered due to various\nfactors. This research aims to identify and rectify diverse spelling errors in\ntext using neural networks, specifically leveraging the Bidirectional Encoder\nRepresentations from Transformers (BERT) masked language model. To achieve this\ngoal, we compiled a comprehensive dataset encompassing both non-real-word and\nreal-word errors after categorizing different types of spelling mistakes.\nSubsequently, multiple pre-trained BERT models were employed. To ensure optimal\nperformance in correcting misspelling errors, we propose a combined approach\nutilizing the BERT masked language model and Levenshtein distance. The results\nfrom our evaluation data demonstrate that the system presented herein exhibits\nremarkable capabilities in identifying and rectifying spelling mistakes, often\nsurpassing existing systems tailored for the Persian language.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"DqezC5VeK9YivfM_2vuykOxWNyT1DzsRpLDvXK-gSs4","pdfSize":"306122","objectId":"0xcec191261eb0d1c8f4a37673d28e0db15d234bb540ff4e59662849ad825c172f","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
