{"id":"2407.07795","title":"Multiple split approach -- multidimensional probabilistic forecasting of\n  electricity markets","authors":"Katarzyna Maciejowska and Weronika Nitka","authorsParsed":[["Maciejowska","Katarzyna",""],["Nitka","Weronika",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 16:12:35 GMT"}],"updateDate":"2024-07-11","timestamp":1720627955000,"abstract":"  In this article, a multiple split method is proposed that enables\nconstruction of multidimensional probabilistic forecasts of a selected set of\nvariables. The method uses repeated resampling to estimate uncertainty of\nsimultaneous multivariate predictions. This nonparametric approach links the\ngap between point and probabilistic predictions and can be combined with\ndifferent point forecasting methods. The performance of the method is evaluated\nwith data describing the German short-term electricity market. The results show\nthat the proposed approach provides highly accurate predictions. The gains from\nmultidimensional forecasting are the largest when functions of variables, such\nas price spread or residual load, are considered.\n  Finally, the method is used to support a decision process of a moderate\ngeneration utility that produces electricity from wind energy and sells it on\neither a day-ahead or an intraday market. The company makes decisions under\nhigh uncertainty because it knows neither the future production level nor the\nprices. We show that joint forecasting of both market prices and fundamentals\ncan be used to predict the distribution of a profit, and hence helps to design\na strategy that balances a level of income and a trading risk.\n","subjects":["Quantitative Finance/Risk Management","Quantitative Finance/Statistical Finance"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"5PyP07wC-9TKRtRO-yYAveWea0pOCzEQ5S0-olw9KC8","pdfSize":"782554","objectId":"0x0fa5e5987666a1149baeb3c3d703e40daeafc1ad349326ffb2528735a70b0411","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
