{"id":"2407.03540","title":"Comics Datasets Framework: Mix of Comics datasets for detection\n  benchmarking","authors":"Emanuele Vivoli, Irene Campaioli, Mariateresa Nardoni, Niccol\\`o\n  Biondi, Marco Bertini, Dimosthenis Karatzas","authorsParsed":[["Vivoli","Emanuele",""],["Campaioli","Irene",""],["Nardoni","Mariateresa",""],["Biondi","Niccolò",""],["Bertini","Marco",""],["Karatzas","Dimosthenis",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 23:07:57 GMT"}],"updateDate":"2024-07-08","timestamp":1720048077000,"abstract":"  Comics, as a medium, uniquely combine text and images in styles often\ndistinct from real-world visuals. For the past three decades, computational\nresearch on comics has evolved from basic object detection to more\nsophisticated tasks. However, the field faces persistent challenges such as\nsmall datasets, inconsistent annotations, inaccessible model weights, and\nresults that cannot be directly compared due to varying train/test splits and\nmetrics. To address these issues, we aim to standardize annotations across\ndatasets, introduce a variety of comic styles into the datasets, and establish\nbenchmark results with clear, replicable settings. Our proposed Comics Datasets\nFramework standardizes dataset annotations into a common format and addresses\nthe overrepresentation of manga by introducing Comics100, a curated collection\nof 100 books from the Digital Comics Museum, annotated for detection in our\nuniform format. We have benchmarked a variety of detection architectures using\nthe Comics Datasets Framework. All related code, model weights, and detailed\nevaluation processes are available at https://github.com/emanuelevivoli/cdf,\nensuring transparency and facilitating replication. This initiative is a\nsignificant advancement towards improving object detection in comics, laying\nthe groundwork for more complex computational tasks dependent on precise object\nrecognition.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"hWH_J-JmeL9ciOjM6Mdj6qWec-zK3EXUFSF-hwrkZjg","pdfSize":"693253"}