{"id":"2407.04823","title":"Path-based Algebraic Foundations of Graph Query Languages","authors":"Renzo Angles and Angela Bonifati and Roberto Garc\\'ia and Domagoj\n  Vrgo\\v{c}","authorsParsed":[["Angles","Renzo",""],["Bonifati","Angela",""],["García","Roberto",""],["Vrgoč","Domagoj",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 19:20:27 GMT"}],"updateDate":"2024-07-09","timestamp":1720207227000,"abstract":"  Graph databases are gaining momentum thanks to the flexibility and\nexpressiveness of their data model and query languages. A standardization\nactivity driven by the ISO/IEC standardization body is also ongoing and has\nalready conducted to the specification of the first versions of two standard\ngraph query languages, namely SQL/PGQ and GQL, respectively in 2023 and 2024.\nApart from the standards, there exists a panoply of concrete graph query\nlanguages in commercial and open-source graph databases, each of which exhibits\ndifferent features and modes. In this paper, we tackle the heterogeneity\nproblem of graph query languages by laying the foundations of a unifying\npath-oriented algebraic framework. Such a theoretical framework is currently\nmissing in the graph databases landscape, thus impeding a lingua franca in\nwhich different graph query language implementations can be expressed and\ncross-compared. Our framework gives a blueprint for correct implementation of\ngraph queries of different expressiveness. It allows to overcome the boundaries\nof current versions of standard query languages, thus paving the way to future\nextensions including query composability. It also allows, when the path-based\nsemantics is stripped off, to express classical Codd's relational algebra\nenhanced with a recursive operator, thus proving its utility for a wide range\nof queries in database management systems.\n","subjects":["Computing Research Repository/Databases"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"4eqXCetKOq8-GDuYZHL5XUfHSP1VHYm4T3Tf9zNLWyI","pdfSize":"604658"}