{"id":"2407.13918","title":"Improving Malware Detection with Adversarial Domain Adaptation and\n  Control Flow Graphs","authors":"Adrian Shuai Li, Arun Iyengar, Ashish Kundu, Elisa Bertino","authorsParsed":[["Li","Adrian Shuai",""],["Iyengar","Arun",""],["Kundu","Ashish",""],["Bertino","Elisa",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 22:06:20 GMT"}],"updateDate":"2024-07-22","timestamp":1721340380000,"abstract":"  In the application of deep learning for malware classification, it is crucial\nto account for the prevalence of malware evolution, which can cause trained\nclassifiers to fail on drifted malware. Existing solutions to combat concept\ndrift use active learning: they select new samples for analysts to label, and\nthen retrain the classifier with the new labels. Our key finding is, the\ncurrent retraining techniques do not achieve optimal results. These models\noverlook that updating the model with scarce drifted samples requires learning\nfeatures that remain consistent across pre-drift and post-drift data.\nFurthermore, the model should be capable of disregarding specific features\nthat, while beneficial for classification of pre-drift data, are absent in\npost-drift data, thereby preventing prediction degradation.\n  In this paper, we propose a method that learns retained information in\nmalware control flow graphs post-drift by leveraging graph neural network with\nadversarial domain adaptation. Our approach considers drift-invariant features\nwithin assembly instructions and flow of code execution. We further propose\nbuilding blocks for more robust evaluation of drift adaptation techniques that\ncomputes statistically distant malware clusters. Our approach is compared with\nthe previously published training methods in active learning systems, and the\nother domain adaptation technique. Our approach demonstrates a significant\nenhancement in predicting unseen malware family in a binary classification task\nand predicting drifted malware families in a multi-class setting. In addition,\nwe assess alternative malware representations. The best results are obtained\nwhen our adaptation method is applied to our graph representations.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"1TFfSMp9jB6l_8lXN66zmzTwUuCETvk6gJZo8c9AGrU","pdfSize":"6636645"}