{"id":"2407.14770","title":"SLInterpreter: An Exploratory and Iterative Human-AI Collaborative\n  System for GNN-based Synthetic Lethal Prediction","authors":"Haoran Jiang, Shaohan Shi, Shuhao Zhang, Jie Zheng, Quan Li","authorsParsed":[["Jiang","Haoran",""],["Shi","Shaohan",""],["Zhang","Shuhao",""],["Zheng","Jie",""],["Li","Quan",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 06:22:51 GMT"}],"updateDate":"2024-07-23","timestamp":1721456571000,"abstract":"  Synthetic Lethal (SL) relationships, though rare among the vast array of gene\ncombinations, hold substantial promise for targeted cancer therapy. Despite\nadvancements in AI model accuracy, there is still a significant need among\ndomain experts for interpretive paths and mechanism explorations that align\nbetter with domain-specific knowledge, particularly due to the high costs of\nexperimentation. To address this gap, we propose an iterative Human-AI\ncollaborative framework with two key components: 1) Human-Engaged Knowledge\nGraph Refinement based on Metapath Strategies, which leverages insights from\ninterpretive paths and domain expertise to refine the knowledge graph through\nmetapath strategies with appropriate granularity. 2) Cross-Granularity SL\nInterpretation Enhancement and Mechanism Analysis, which aids experts in\norganizing and comparing predictions and interpretive paths across different\ngranularities, uncovering new SL relationships, enhancing result\ninterpretation, and elucidating potential mechanisms inferred by Graph Neural\nNetwork (GNN) models. These components cyclically optimize model predictions\nand mechanism explorations, enhancing expert involvement and intervention to\nbuild trust. Facilitated by SLInterpreter, this framework ensures that newly\ngenerated interpretive paths increasingly align with domain knowledge and\nadhere more closely to real-world biological principles through iterative\nHuman-AI collaboration. We evaluate the framework's efficacy through a case\nstudy and expert interviews.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"U0mXwJL0P4QL-A7XnHUWkXNjhZ-IvSvNSyI5a2qEPUw","pdfSize":"8745586"}