{"id":"2407.17324","title":"Enhanced Deep Learning Methodologies and MRI Selection Techniques for\n  Dementia Diagnosis in the Elderly Population","authors":"Nikolaos Ntampakis, Konstantinos Diamantaras, Ioanna Chouvarda,\n  Vasileios Argyriou, Panagiotis Sarigianndis","authorsParsed":[["Ntampakis","Nikolaos",""],["Diamantaras","Konstantinos",""],["Chouvarda","Ioanna",""],["Argyriou","Vasileios",""],["Sarigianndis","Panagiotis",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 14:48:40 GMT"},{"version":"v2","created":"Thu, 25 Jul 2024 09:50:03 GMT"}],"updateDate":"2024-07-26","timestamp":1721832520000,"abstract":"  Dementia, a debilitating neurological condition affecting millions worldwide,\npresents significant diagnostic challenges. In this work, we introduce a novel\nmethodology for the classification of demented and non-demented elderly\npatients using 3D brain Magnetic Resonance Imaging (MRI) scans. Our approach\nfeatures a unique technique for selectively processing MRI slices, focusing on\nthe most relevant brain regions and excluding less informative sections. This\nmethodology is complemented by a confidence-based classification committee\ncomposed of three custom deep learning models: Dem3D ResNet, Dem3D CNN, and\nDem3D EfficientNet. These models work synergistically to enhance\ndecision-making accuracy, leveraging their collective strengths. Tested on the\nOpen Access Series of Imaging Studies(OASIS) dataset, our method achieved an\nimpressive accuracy of 94.12%, surpassing existing methodologies. Furthermore,\nvalidation on the Alzheimer's Disease Neuroimaging Initiative (ADNI) dataset\nconfirmed the robustness and generalizability of our approach. The use of\nexplainable AI (XAI) techniques and comprehensive ablation studies further\nsubstantiate the effectiveness of our techniques, providing insights into the\ndecision-making process and the importance of our methodology. This research\noffers a significant advancement in dementia diagnosis, providing a highly\naccurate and efficient tool for clinical applications.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"Whn7tS8-xmQSOGmIuFNU6aMdwN5vcGnB7CDNhhPQpvQ","pdfSize":"7403572"}