{"id":"2407.03683","title":"Exact cosmological solutions with magnetic field in the theory of\n  gravity with non-minimal kinetic coupling","authors":"Ruslan K. Muharlyamov, Tatiana N. Pankratyeva, Shehabaldeen O.A.\n  Bashir","authorsParsed":[["Muharlyamov","Ruslan K.",""],["Pankratyeva","Tatiana N.",""],["Bashir","Shehabaldeen O. A.",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 07:10:33 GMT"}],"updateDate":"2024-07-08","timestamp":1720077033000,"abstract":"  We investigate anisotropic and homogeneous cosmological models in the\nscalar-tensor theory of gravity with non-minimal kinetic coupling of a scalar\nfield to the curvature given by the function $\\eta\\cdot(\\phi/2)\\cdot\nG_{\\mu\\nu}\\,\\nabla^\\mu \\nabla^\\nu \\phi$ in the Lagrangian. We assume that the\nspace-times are filled a global unidirectional electromagnetic field that\nminimally interacts with the scalar field. The Horndeski theory allows\nanisotropy to grow over time. The question arises about isotropization. In the\ntheory under consideration, a zero scalar charge imposes a condition on the\nanisotropy level, namely its dynamics develops in a limited region. This\ncondition uniquely determines a viable branch of solutions of the field\nequations. The magnetic energy density that corresponds to this branch is a\nbounded function of time. The sign of parameter $l=1+8\\pi \\varepsilon\\eta\n\\Lambda$ determines the properties of cosmological models, where $\\Lambda$ is\nthe cosmological constant. The sign $\\varepsilon=\\pm 1$ defines the canonical\nscalar field and the phantom field, respectively. An inequality\n$\\varepsilon/\\eta>0$ is a necessary condition for isotropization of models, but\nnot sufficient. Three cases were considered: $l=0$, the isotropization does not\noccur; $l>0$, there is isotropization; $l<0$, there are two branches, one of\nwhich has the property of isotropization, and the other describes the Universe\nwith collapse. The model with $l<0$ has an anisotropic bounce and the Universe\nevolution begins with a non-zero volume value. Models of an infinitely\nexpanding Universe eventually go into inflation mode with the scale factor\n$a(t)\\propto e^{h_\\eta\\cdot t}$, $h_\\eta=\\sqrt{\\frac{\\varepsilon}{3\\eta}}$.\n","subjects":["Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"wDOKYJCmKY8ILMFSv2ZaRs6sIVtEevTD_U0cL14_SCQ","pdfSize":"920994"}
