{"id":"2407.04767","title":"High-energy neutrino signatures from pulsar remnants of binary\n  neutron-star mergers: coincident detection prospects with gravitational waves","authors":"Mainak Mukhopadhyay, Shigeo S. Kimura, Brian D. Metzger","authorsParsed":[["Mukhopadhyay","Mainak",""],["Kimura","Shigeo S.",""],["Metzger","Brian D.",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 18:00:00 GMT"}],"updateDate":"2024-07-09","timestamp":1720202400000,"abstract":"  Binary neutron-star (BNS) mergers are accompanied by multi-messenger\nemissions, including gravitational wave (GW), neutrino, and electromagnetic\nsignals. Some fraction of BNS mergers may result in a rapidly spinning magnetar\nas a remnant, which can enhance both the EM and neutrino emissions. In this\nstudy, we model the neutrino emissions from such systems and discuss the\nprospects for detecting the neutrinos coincident with GW signatures. We\nconsider a scenario where a magnetar remnant drives a pulsar wind using its\nspin energy. The wind interacts with the surrounding kilonova ejecta, forming a\nnebula filled with non-thermal photons. Ions and nuclei extracted from the\nmagnetar's surface can be accelerated in the polar-cap and the\ntermination-shock regions. We investigate the neutrino fluences resulting from\nphotomeson interactions, where accelerated CR protons interact with the photons\nin the nebula. Our findings indicate that the peak neutrino fluence is $\\sim\n10^{-2}\\rm GeV~cm^{-2}$ for a source at $40$ Mpc, which is reached\napproximately $\\mathcal{O}( 1-10\\ {\\rm days})$ post merger. Finally, we examine\nthe potential for GW-triggered stacking searches with IceCube-Gen2 using\nnext-generation GW detectors such as the Cosmic Explorer (CE) and the Einstein\nTelescope (ET). We conclude that, assuming an optimistic neutrino emission\nmodel, a combination of CE+ET would offer a high probability of neutrino\ndetection from these sources within an operational timescale of $\\sim 20$\nyears. In case of non-detection, $2 \\sigma$ level constraints on model\nparameters can be established within similar joint operation timescales.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"tipThab5NaFP6VIDhC6Q4ZOKGZIBIgfwNjUT9PLhhOM","pdfSize":"3355707"}