{"id":"2407.13910","title":"Social Capital and Persistence in Computer Science of Google's Computer\n  Science Summer Institute (CSSI) Students","authors":"Marjan Naghshbandi, Sharon Ferguson, Alison Olechowski","authorsParsed":[["Naghshbandi","Marjan",""],["Ferguson","Sharon",""],["Olechowski","Alison",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 21:50:21 GMT"}],"updateDate":"2024-07-22","timestamp":1721339421000,"abstract":"  While a lucrative and growing field, low levels of gender and racial\ndiversity in CS remain prevalent. Education and workforce support programs with\nthe intention to promote underrepresented students' persistence in CS exist,\nwhich teach skills, inform of career options, and grow students' network in CS.\nStudies demonstrate these programs' effectiveness as it relates to changes in\naffective outcomes, such as participants' confidence in CS skills and attitudes\ntowards CS jobs. However, programs' longitudinal impact on participants'\nbuild-up of social capital in CS, and the resulting social capital's influence\non their persistence in CS, remain unexplored. Motivated by the literature that\nassociates demographic identifiers with access to social capital, and students'\naccess to developmental relationships and career resources (social capital) in\nCS with their persistence, this study explores a CS support program's impact on\npersistence through capital building. We focus on Google's CSSI, which provided\ngraduating high school students with a 3-week-long introduction to CS. We use\ninterviews with participants who are now 2-5 years out of the program to study\nCSSI's impact on their social capital and long-term CS persistence. Thematic\nanalysis reveals three program elements that influenced students' build-up of\nsocial capital, and that the resulting persistence was realized through\nstudents' progress towards internships and goals for paying-it-forward in CS.\nThese findings inform our recommendations that future support programs and\neducational settings consider mentorship centered on socioemotional support,\nopportunities for collaboration, and time for fun social activities. Additional\nsuggestions center on engaging socially-oriented individuals with CS support\nprograms. These insights inform CS educators on design choices that can\nencourage the persistence of underrepresented students in CS.\n","subjects":["Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"QMwQu_WwFOewB9RJu0WtHPQqCvhjvAKfFMk_ODFjMtY","pdfSize":"253084"}