{"id":"2407.07674","title":"Feasibility Study on Active Learning of Smart Surrogates for Scientific\n  Simulations","authors":"Pradeep Bajracharya, Javier Quetzalc\\'oatl Toledo-Mar\\'in, Geoffrey\n  Fox, Shantenu Jha, Linwei Wang","authorsParsed":[["Bajracharya","Pradeep",""],["Toledo-Marín","Javier Quetzalcóatl",""],["Fox","Geoffrey",""],["Jha","Shantenu",""],["Wang","Linwei",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 14:00:20 GMT"},{"version":"v2","created":"Fri, 12 Jul 2024 15:10:53 GMT"}],"updateDate":"2024-07-15","timestamp":1720620020000,"abstract":"  High-performance scientific simulations, important for comprehension of\ncomplex systems, encounter computational challenges especially when exploring\nextensive parameter spaces. There has been an increasing interest in developing\ndeep neural networks (DNNs) as surrogate models capable of accelerating the\nsimulations. However, existing approaches for training these DNN surrogates\nrely on extensive simulation data which are heuristically selected and\ngenerated with expensive computation -- a challenge under-explored in the\nliterature. In this paper, we investigate the potential of incorporating active\nlearning into DNN surrogate training. This allows intelligent and objective\nselection of training simulations, reducing the need to generate extensive\nsimulation data as well as the dependency of the performance of DNN surrogates\non pre-defined training simulations. In the problem context of constructing DNN\nsurrogates for diffusion equations with sources, we examine the efficacy of\ndiversity- and uncertainty-based strategies for selecting training simulations,\nconsidering two different DNN architecture. The results set the groundwork for\ndeveloping the high-performance computing infrastructure for Smart Surrogates\nthat supports on-the-fly generation of simulation data steered by active\nlearning strategies to potentially improve the efficiency of scientific\nsimulations.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"3oJ5hc5tV_10F4rQ6J9Vv3LpCnoNrOwx6KqThw8q60w","pdfSize":"3354355"}