{"id":"2407.07067","title":"Aggregate Bayesian Causal Forests: The ABCs of Flexible Causal Inference\n  for Hierarchically Structured Data","authors":"Dan R. C. Thal, Lauren V. Forrow, Erin R. Lipman, Jennifer E.\n  Starling, Mariel M. Finucane","authorsParsed":[["Thal","Dan R. C.",""],["Forrow","Lauren V.",""],["Lipman","Erin R.",""],["Starling","Jennifer E.",""],["Finucane","Mariel M.",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 17:42:54 GMT"}],"updateDate":"2024-07-10","timestamp":1720546974000,"abstract":"  This paper introduces aggregate Bayesian Causal Forests (aBCF), a new\nBayesian model for causal inference using aggregated data. Aggregated data are\ncommon in policy evaluations where we observe individuals such as students, but\nparticipation in an intervention is determined at a higher level of\naggregation, such as schools implementing a curriculum. Interventions often\nhave millions of individuals but far fewer higher-level units, making\naggregation computationally attractive. To analyze aggregated data, a model\nmust account for heteroskedasticity and intraclass correlation (ICC). Like\nBayesian Causal Forests (BCF), aBCF estimates heterogeneous treatment effects\nwith minimal parametric assumptions, but accounts for these aggregated data\nfeatures, improving estimation of average and aggregate unit-specific effects.\n  After introducing the aBCF model, we demonstrate via simulation that aBCF\nimproves performance for aggregated data over BCF. We anchor our simulation on\nan evaluation of a large-scale Medicare primary care model. We demonstrate that\naBCF produces treatment effect estimates with a lower root mean squared error\nand narrower uncertainty intervals while achieving the same level of coverage.\nWe show that aBCF is not sensitive to the prior distribution used and that\nestimation improvements relative to BCF decline as the ICC approaches one. Code\nis available at https://github.com/mathematica-mpr/bcf-1.\n","subjects":["Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"dlZLgr-U_3tCJ_iwNbeOXYdNJvIQYNxurTTW2E1Jzds","pdfSize":"896587"}