{"id":"2407.07244","title":"Characterisation of Supernovae Interacting with Dense Circumstellar\n  Matter with a Flat Density Profile","authors":"Ryotaro Chiba and Takashi J. Moriya","authorsParsed":[["Chiba","Ryotaro",""],["Moriya","Takashi J.",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 21:47:28 GMT"},{"version":"v2","created":"Tue, 6 Aug 2024 01:40:41 GMT"}],"updateDate":"2024-08-07","timestamp":1720561648000,"abstract":"  Interaction between supernova (SN) ejecta and dense circumstellar medium\n(CSM) with a flat density structure ($\\rho \\propto r^{-s}, s < 1.5$) was\nrecently proposed as a possible mechanism behind interacting SNe that exhibit\nexceptionally long rise times exceeding 100 days. In such a configuration, the\ninteraction luminosity keeps rising until the reverse shock propagates into the\ninner layers of the SN ejecta. We investigate the light curves of SNe\ninteracting with a flatly distributed CSM in detail, incorporating the effects\nof photon diffusion inside the CSM into the model. We show that three physical\nprocesses - the shock breakout, the propagation of the reverse shock into the\ninner ejecta, and the departure of the shock from the dense CSM - predominantly\ndetermine the qualitative behaviour of the light curves. Based on the presence\nand precedence of these processes, the light curves of SNe interacting with\nflatly distributed CSM can be classified into five distinct morphological\nclasses. We also show that our model can qualitatively reproduce doubly peaked\nSNe whose peaks are a few tens of days apart, such as SN 2005bf and SN 2022xxf.\nOur results show that the density distribution of the CSM is an important\nproperty of CSM that contributes to the diversity in light curves of\ninteracting SNe.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"aR-6N9tGsyBqxeUFWDwb2vDDnRYR_p7ggmeXytbxiow","pdfSize":"1057511"}