{"id":"2407.11615","title":"Graph Dimension Attention Networks for Enterprise Credit Assessment","authors":"Shaopeng Wei, Beni Egressy, Xingyan Chen, Yu Zhao, Fuzhen Zhuang,\n  Roger Wattenhofer, Gang Kou","authorsParsed":[["Wei","Shaopeng",""],["Egressy","Beni",""],["Chen","Xingyan",""],["Zhao","Yu",""],["Zhuang","Fuzhen",""],["Wattenhofer","Roger",""],["Kou","Gang",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 11:24:28 GMT"}],"updateDate":"2024-07-17","timestamp":1721129068000,"abstract":"  Enterprise credit assessment is critical for evaluating financial risk, and\nGraph Neural Networks (GNNs), with their advanced capability to model\ninter-entity relationships, are a natural tool to get a deeper understanding of\nthese financial networks. However, existing GNN-based methodologies\npredominantly emphasize entity-level attention mechanisms for contagion risk\naggregation, often overlooking the heterogeneous importance of different\nfeature dimensions, thus falling short in adequately modeling credit risk\nlevels. To address this issue, we propose a novel architecture named Graph\nDimension Attention Network (GDAN), which incorporates a dimension-level\nattention mechanism to capture fine-grained risk-related characteristics.\nFurthermore, we explore the interpretability of the GNN-based method in\nfinancial scenarios and propose a simple but effective data-centric explainer\nfor GDAN, called GDAN-DistShift. DistShift provides edge-level interpretability\nby quantifying distribution shifts during the message-passing process.\nMoreover, we collected a real-world, multi-source Enterprise Credit Assessment\nDataset (ECAD) and have made it accessible to the research community since\nhigh-quality datasets are lacking in this field. Extensive experiments\nconducted on ECAD demonstrate the effectiveness of our methods. In addition, we\nran GDAN on the well-known datasets SMEsD and DBLP, also with excellent\nresults.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"FvdEluUxKzwovkSr4sXAjlvHj-ae3TcO5qvaQx5HsFE","pdfSize":"12075274"}