{"id":"2407.08027","title":"Fish-Vista: A Multi-Purpose Dataset for Understanding & Identification\n  of Traits from Images","authors":"Kazi Sajeed Mehrab, M. Maruf, Arka Daw, Harish Babu Manogaran,\n  Abhilash Neog, Mridul Khurana, Bahadir Altintas, Yasin Bakis, Elizabeth G\n  Campolongo, Matthew J Thompson, Xiaojun Wang, Hilmar Lapp, Wei-Lun Chao,\n  Paula M. Mabee, Henry L. Bart Jr., Wasila Dahdul, Anuj Karpatne","authorsParsed":[["Mehrab","Kazi Sajeed",""],["Maruf","M.",""],["Daw","Arka",""],["Manogaran","Harish Babu",""],["Neog","Abhilash",""],["Khurana","Mridul",""],["Altintas","Bahadir",""],["Bakis","Yasin",""],["Campolongo","Elizabeth G",""],["Thompson","Matthew J",""],["Wang","Xiaojun",""],["Lapp","Hilmar",""],["Chao","Wei-Lun",""],["Mabee","Paula M.",""],["Bart","Henry L.","Jr."],["Dahdul","Wasila",""],["Karpatne","Anuj",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 20:10:56 GMT"}],"updateDate":"2024-07-12","timestamp":1720642256000,"abstract":"  Fishes are integral to both ecological systems and economic sectors, and\nstudying fish traits is crucial for understanding biodiversity patterns and\nmacro-evolution trends. To enable the analysis of visual traits from fish\nimages, we introduce the Fish-Visual Trait Analysis (Fish-Vista) dataset - a\nlarge, annotated collection of about 60K fish images spanning 1900 different\nspecies, supporting several challenging and biologically relevant tasks\nincluding species classification, trait identification, and trait segmentation.\nThese images have been curated through a sophisticated data processing pipeline\napplied to a cumulative set of images obtained from various museum collections.\nFish-Vista provides fine-grained labels of various visual traits present in\neach image. It also offers pixel-level annotations of 9 different traits for\n2427 fish images, facilitating additional trait segmentation and localization\ntasks. The ultimate goal of Fish-Vista is to provide a clean, carefully\ncurated, high-resolution dataset that can serve as a foundation for\naccelerating biological discoveries using advances in AI. Finally, we provide a\ncomprehensive analysis of state-of-the-art deep learning techniques on\nFish-Vista.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"ApKanPGMBhxMaTXg4grjFYFEM9dUHE5381szD1ZPkxI","pdfSize":"4613128"}