{"id":"2407.12136","title":"Molecular Topological Profile (MOLTOP) -- Simple and Strong Baseline for\n  Molecular Graph Classification","authors":"Jakub Adamczyk, Wojciech Czech","authorsParsed":[["Adamczyk","Jakub",""],["Czech","Wojciech",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 19:45:34 GMT"},{"version":"v2","created":"Sun, 21 Jul 2024 06:54:53 GMT"},{"version":"v3","created":"Tue, 23 Jul 2024 17:58:52 GMT"}],"updateDate":"2024-07-24","timestamp":1721159134000,"abstract":"  We revisit the effectiveness of topological descriptors for molecular graph\nclassification and design a simple, yet strong baseline. We demonstrate that a\nsimple approach to feature engineering - employing histogram aggregation of\nedge descriptors and one-hot encoding for atomic numbers and bond types - when\ncombined with a Random Forest classifier, can establish a strong baseline for\nGraph Neural Networks (GNNs). The novel algorithm, Molecular Topological\nProfile (MOLTOP), integrates Edge Betweenness Centrality, Adjusted Rand Index\nand SCAN Structural Similarity score. This approach proves to be remarkably\ncompetitive when compared to modern GNNs, while also being simple, fast,\nlow-variance and hyperparameter-free. Our approach is rigorously tested on\nMoleculeNet datasets using fair evaluation protocol provided by Open Graph\nBenchmark. We additionally show out-of-domain generation capabilities on\npeptide classification task from Long Range Graph Benchmark. The evaluations\nacross eleven benchmark datasets reveal MOLTOP's strong discriminative\ncapabilities, surpassing the $1$-WL test and even $3$-WL test for some classes\nof graphs. Our conclusion is that descriptor-based baselines, such as the one\nwe propose, are still crucial for accurately assessing advancements in the GNN\ndomain.\n","subjects":["Computing Research Repository/Machine Learning","Quantitative Biology/Quantitative Methods"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"UiERkgBekVTbXKxxy3MXJhobnlUzE6-hyyUmwZt_uWk","pdfSize":"543319"}