{"id":"2407.08075","title":"Temperature-Dependent Photoluminescence of PEDOT:PSS for use as\n  Transparent Electrodes in the DarkSide-20k Time Projection Chamber","authors":"Nicholas Swidinsky, Emma Ellingwood, Jonathan Hucker, Peter Skensved,\n  Philippe Di Stefano, Jeffery Mason, Mark Boulay, Ashlea Kemp, Frederick\n  Schuckman, Yi Wang","authorsParsed":[["Swidinsky","Nicholas",""],["Ellingwood","Emma",""],["Hucker","Jonathan",""],["Skensved","Peter",""],["Di Stefano","Philippe",""],["Mason","Jeffery",""],["Boulay","Mark",""],["Kemp","Ashlea",""],["Schuckman","Frederick",""],["Wang","Yi",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 22:40:47 GMT"}],"updateDate":"2024-07-12","timestamp":1720651247000,"abstract":"  Dual-phase time-projection chambers (TPCs) filled with noble elements are\nused for particle detection, with many focusing on rare-event searches. These\ndetectors measure two signals: one from scintillation light, and another from\ndrifting ionized electrons. The DarkSide-20k design uses a transparent vessel\nwith external photodetectors. Electrodes, used to drift the electrons, are\nlocated between the active medium and the photodetectors, requiring them to be\ntransparent to allow scintillation light to transmit through them. The\ntransparent electrode coating for DarkSide-20k is\npoly(3,4-ethylenedioxythiophene) poly(styrene sulfonate) (PEDOT:PSS) or\nClevios. For rare-event search detectors, the fluorescence of materials that\nare between the active volume and the photodetectors may lead to backgrounds in\nthe data. Since Clevios is a new material for TPC electrodes, its fluorescent\nproperties need to be characterized to understand their potential impact on\nbackgrounds. Previous studies have indicated that Clevios can fluoresce, with\nmaximal fluorescence produced using UV-excitation. Our study analyzes the\nfluorescence of Clevios, under UV-excitation, using both time-resolved and\nspectral techniques between 4 K and 300 K. We find that the fluorescence of\nClevios is negligible when compared to the fluorescence of common fluorescent\nmaterials used in TPCs, such as 1,1,4,4-tetraphenyl-1,3-butadiene (TPB).\n","subjects":["Physics/Instrumentation and Detectors"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"wXnJUYfQINRUzV2ATEUNlw5jWZahsfSbUNNtzjnyVDM","pdfSize":"962494","objectId":"0x8dd033f18e7d600e317eea35bc9b69223565532eb034ec4be4c1384a4bb744aa","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
