{"id":"2407.00165","title":"High-energy spectra of LTT 1445A and GJ 486 reveal flares and activity","authors":"H. Diamond-Lowe, G. W. King, A. Youngblood, A. Brown, W. S. Howard, J.\n  G. Winters, D. J. Wilson, K. France, J. M. Mendon\\c{c}a, L. A. Buchhave, L.\n  Corrales, L. Kreidberg, A. A. Medina, J. L. Bean, Z. K. Berta-Thompson, T. M.\n  Evans-Soma, C. Froning, G. M. Duvvuri, E. M.-R. Kempton, Y. Miguel, J. S.\n  Pineda, and C. Schneider","authorsParsed":[["Diamond-Lowe","H.",""],["King","G. W.",""],["Youngblood","A.",""],["Brown","A.",""],["Howard","W. S.",""],["Winters","J. G.",""],["Wilson","D. J.",""],["France","K.",""],["Mendonça","J. M.",""],["Buchhave","L. A.",""],["Corrales","L.",""],["Kreidberg","L.",""],["Medina","A. A.",""],["Bean","J. L.",""],["Berta-Thompson","Z. K.",""],["Evans-Soma","T. M.",""],["Froning","C.",""],["Duvvuri","G. M.",""],["Kempton","E. M. -R.",""],["Miguel","Y.",""],["Pineda","J. S.",""],["Schneider","C.",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 18:04:49 GMT"},{"version":"v2","created":"Fri, 30 Aug 2024 09:02:09 GMT"}],"updateDate":"2024-09-04","timestamp":1719597889000,"abstract":"  The high-energy radiative output, from the X-ray to the ultraviolet, of\nexoplanet host stars drives photochemical reactions and mass loss in the upper\nregions of planetary atmospheres. In order to place constraints on the\natmospheric properties of the three closest terrestrial exoplanets transiting M\ndwarfs, we observe the high-energy spectra of the host stars LTT1445A and GJ486\nin the X-ray with XMM-Newton and Chandra and in the ultraviolet with HST/COS\nand STIS. We combine these observations with estimates of extreme ultraviolet\nflux, reconstructions of the Ly-a lines, and stellar models at optical and\ninfrared wavelengths to produce panchromatic spectra from 1A--20um for each\nstar. While LTT1445Ab, LTT1445Ac, and GJ486b do not possess primordial\nhydrogen-dominated atmospheres, we calculate that they are able to retain pure\nCO2 atmospheres if starting with 10, 15, and 50% of Earth's total CO2 budget,\nrespectively, in the presence of their host stars' stellar wind. We use\nage-activity relationships to place lower limits of 2.2 and 6.6 Gyr on the ages\nof the host stars LTT1445A and GJ486. Despite both LTT1445A and GJ486 appearing\ninactive at optical wavelengths, we detect flares at ultraviolet and X-ray\nwavelengths for both stars. In particular, GJ486 exhibits two flares with\nabsolute energies of 10^29.5 and 10^30.1 erg (equivalent durations of 4357+/-96\nand 19724+/-169 s) occurring three hours apart, captured with HST/COS G130M.\nBased on the timing of the observations, we suggest that these high-energy\nflares are related and indicative of heightened flaring activity that lasts for\na period of days, but our interpretations are limited by sparse time-sampling.\nConsistent high-energy monitoring is needed to determine the duration and\nextent of high-energy activity on individual M dwarfs, as well as the\npopulation as a whole.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Cb44pIMp-FZe2jt2rBN1uMssNXoj-_msh9WqEys65Vs","pdfSize":"2818374"}