{"id":"2407.18706","title":"Structural Reorganizations and Nanodomain Emergence in Lipid Membrane\n  Driven by Ionic Liquids","authors":"J. Gupta, V. K. Sharma, P. Hitaishi, H. Srinivasan, S. Kumar, S. K.\n  Ghosh, S. Mitra","authorsParsed":[["Gupta","J.",""],["Sharma","V. K.",""],["Hitaishi","P.",""],["Srinivasan","H.",""],["Kumar","S.",""],["Ghosh","S. K.",""],["Mitra","S.",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 12:44:00 GMT"}],"updateDate":"2024-07-29","timestamp":1721997840000,"abstract":"  The exceptional physicochemical properties and versatile biological\nactivities of ionic liquids (ILs) have propelled their potential applications\nin various industries, including pharmaceuticals and green chemistry. However,\ntheir widespread use is limited by concerns over toxicity, particularly due to\ninteractions with cell membranes. This study examines the effects of\nimidazolium-based ILs on the microscopic structure and phase behavior of a\nmodel cell membrane composed of zwitterionic dipalmitoylphosphatidylcholine\n(DPPC) lipid. Small-angle neutron scattering and dynamic light scattering\nreveal that the shorter chain IL, 1-hexyl-3-methylimidazolium bromide\n(HMIM[Br]), induces aggregation of DPPC unilamellar vesicles. In contrast, this\naggregation is absent with the longer alkyl chain IL,\n1-decyl-3-methylimidazolium bromide (DMIM[Br]). Instead, DMIM[Br] incorporation\nleads to the formation of distinct IL-poor and IL-rich nanodomains within the\nDPPC membrane, as evidenced by X-ray reflectivity, differential scanning\ncalorimetry, and molecular dynamics simulation. The less evident nanodomain\nformation with HMIM[Br] underscores the role of hydrophobic interactions\nbetween lipid alkyl tails and ILs. Our findings demonstrate that longer alkyl\nchains in ILs significantly enhance their propensity to form membrane\nnanodomains and increase membrane permeability, directly correlating with\nhigher cytotoxicity. This crucial link between nanodomains and toxicity\nprovides valuable insights for designing safer, more environmentally friendly\nILs, and promoting their use in biomedical applications and sustainable\nindustrial processes.\n","subjects":["Condensed Matter/Soft Condensed Matter"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"W15I5sMtJXXL-s4ibmsaSXtvs8KtP1ytTbnTQNPH4aE","pdfSize":"1723616"}