{"id":"2407.04691","title":"Exceptional Points and Braiding Topology in Non-Hermitian Systems with\n  long-range coupling","authors":"S. M. Rafi-Ul-Islam, Zhuo Bin Siu, Md. Saddam Hossain Razo, and\n  Mansoor B.A. Jalil","authorsParsed":[["Rafi-Ul-Islam","S. M.",""],["Siu","Zhuo Bin",""],["Razo","Md. Saddam Hossain",""],["Jalil","Mansoor B. A.",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 17:55:48 GMT"}],"updateDate":"2024-07-08","timestamp":1720202148000,"abstract":"  We present a study of complex energy braiding in a 1D non-Hermitian system\nwith $n$th order long range asymmetrical coupling. Our work highlights the\nemergence of novel topological phenomena in such systems beyond the\nconventional nearest-neighbor interaction. The modified SSH model displays $n$\ndistinct knots and links combinations in the complex energy-momentum space\nunder periodic boundary conditions (PBC), which can be controlled by varying\nthe coupling strengths. A topological invariant, namely the braiding index, is\nintroduced to characterize the different complex energy braiding profiles,\nwhich depends on the zeros and poles of the characteristic polynomials.\nFurthermore, we demonstrate that the non-Hermitian skin effect can be localized\nat one or both ends, signifying conventional or bipolar localization, depending\non the sign of the braiding index. Phase transitions between different braiding\nphases with the same (opposite) sign of the topological invariant occur at\nType-1 (Type-2) exceptional points, with Type-1 (Type-2) phase transitions\naccompanied by single (multiple) exceptional points. We propose an experimental\nset-up to realize the various braiding schemes based on the RLC circuit\nframework, which provides an accessible avenue for implementation without\nrecourse to high-dimensional momentum space required in most other platforms.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"sPRQLBQ905lUJUNK0GZlCQbGLQmTQ9UgtUcJJrtHjRU","pdfSize":"2557398"}