{"id":"2407.00590","title":"Evaluating Learned Indexes for External-Memory Joins","authors":"Yuvaraj Chesetti and Prashant Pandey","authorsParsed":[["Chesetti","Yuvaraj",""],["Pandey","Prashant",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 05:06:25 GMT"},{"version":"v2","created":"Sun, 7 Jul 2024 19:53:57 GMT"}],"updateDate":"2024-07-09","timestamp":1719723985000,"abstract":"  In this paper, we investigate the effectiveness of utilizing CDF-based\nlearned indexes in indexed-nested loop joins for both sorted and unsorted data\nin external memory. Our experimental study seeks to determine whether the\nadvantages of learned indexes observed in in-memory joins by Sabek and Kraska\n(VLDB 2023) extend to the external memory context. First, we introduce two\noptimizations for integrating learned indexes into external-memory joins.\nSubsequently, we conduct an extensive evaluation, employing hash join, sort\njoin, and indexed-nested loop join with real-world and simulated datasets.\nFurthermore, we independently assess the learned index-based join across\nvarious dimensions, including storage device types, key types, data sorting,\nparallelism, constrained memory settings, and increasing model error. Our\nexperiments indicate that B-trees and learned indexes exhibit largely similar\nperformance in external-memory joins. Learned indexes offer advantages in terms\nof smaller index size and faster lookup performance. However, their\nconstruction time is approximately $1000\\times$ higher. While learned indexes\ncan be significantly smaller ($2\\times$-$4\\times$) than the internal nodes of a\nB-tree index, these internal nodes constitute only 0.4 to 1% of the data size\nand typically fit in main memory in most practical scenarios. Additionally,\nunlike in the in-memory setting, learned indexes can prioritize faster\nconstruction over accuracy (larger error window) without significantly\naffecting query performance.\n","subjects":["Computing Research Repository/Databases"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"qarIVhUWtAVlbmYsNa0Tued9DFtXn2neuAVXrOx0e-Q","pdfSize":"914335","objectId":"0x1b4caf62d5741b6b032ea7f5e4b96f393fe3eff9e2be435920c7d7f0572e3118","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
