{"id":"2407.21630","title":"TAROT: Task-Oriented Authorship Obfuscation Using Policy Optimization\n  Methods","authors":"Gabriel Loiseau, Damien Sileo, Damien Riquet, Maxime Meyer, Marc\n  Tommasi","authorsParsed":[["Loiseau","Gabriel",""],["Sileo","Damien",""],["Riquet","Damien",""],["Meyer","Maxime",""],["Tommasi","Marc",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 14:24:01 GMT"}],"updateDate":"2024-08-01","timestamp":1722435841000,"abstract":"  Authorship obfuscation aims to disguise the identity of an author within a\ntext by altering the writing style, vocabulary, syntax, and other linguistic\nfeatures associated with the text author. This alteration needs to balance\nprivacy and utility. While strong obfuscation techniques can effectively hide\nthe author's identity, they often degrade the quality and usefulness of the\ntext for its intended purpose. Conversely, maintaining high utility tends to\nprovide insufficient privacy, making it easier for an adversary to de-anonymize\nthe author. Thus, achieving an optimal trade-off between these two conflicting\nobjectives is crucial. In this paper, we propose TAROT: Task-Oriented\nAuthorship Obfuscation Using Policy Optimization, a new unsupervised authorship\nobfuscation method whose goal is to optimize the privacy-utility trade-off by\nregenerating the entire text considering its downstream utility. Our approach\nleverages policy optimization as a fine-tuning paradigm over small language\nmodels in order to rewrite texts by preserving author identity and downstream\ntask utility. We show that our approach largely reduce the accuracy of\nattackers while preserving utility. We make our code and models publicly\navailable.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"GI8209o_Fdwt52nnakpTaNSskJ5w7BJLLv7O4PIAtEs","pdfSize":"407618","objectId":"0x814abe49c8e16d0cc42c3d09712b7c0f120ac0b1dcb5a2afbc183e21a2f1a389","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
