{"id":"2407.16834","title":"A Multi-Level Hierarchical Framework for the Classification of Weather\n  Conditions and Hazard Prediction","authors":"Harish Neelam","authorsParsed":[["Neelam","Harish",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 20:55:25 GMT"}],"updateDate":"2024-07-25","timestamp":1721768125000,"abstract":"  This paper presents a multilevel hierarchical framework for the\nclassification of weather conditions and hazard prediction. In recent years,\nthe importance of data has grown significantly, with various types like text,\nnumbers, images, audio, and videos playing a key role. Among these, images make\nup a large portion of the data available. This application shows promise for\nvarious purposes, especially when combined with decision support systems for\ntraffic management, afforestation, and weather forecasting. It's particularly\nuseful in situations where traditional weather predictions are not very\naccurate, such as ensuring the safe operation of self driving cars in dangerous\nweather. While previous studies have looked at this topic with fewer\ncategories, this paper focuses on eleven specific types of weather images. The\ngoal is to create a model that can accurately predict weather conditions after\nbeing trained on a large dataset of images. Accuracy is crucial in real-life\nsituations to prevent accidents, making it the top priority for this paper.\nThis work lays the groundwork for future applications in weather prediction,\nespecially in situations where human expertise is not available or may be\nbiased. The framework, capable of classifying images into eleven weather\ncategories: dew, frost, glaze, rime, snow, hail, rain, lightning, rainbow, and\nsandstorm, provides real-time weather information with an accuracy of 0.9329.\nThe proposed framework addresses the growing need for accurate weather\nclassification and hazard prediction, offering a robust solution for various\napplications in the field.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"4Yd9gWCngDNSuuZSpAl1T3jxvVLR8EjI3WdTKQuSX6M","pdfSize":"550985"}