{"id":"2407.10553","title":"Formation of human kinship structures depending on population size and\n  cultural mutation rate","authors":"Kenji Itao and Kunihiko Kaneko","authorsParsed":[["Itao","Kenji",""],["Kaneko","Kunihiko",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 09:05:33 GMT"}],"updateDate":"2024-07-16","timestamp":1721034333000,"abstract":"  How does social complexity depend on population size and cultural\ntransmission? Kinship structures in traditional societies provide a fundamental\nillustration, where cultural rules between clans determine people's marriage\npossibilities. Here we propose a simple model of kinship interactions that\nconsiders kin and in-law cooperation and sexual rivalry. In this model,\nmultiple societies compete. Societies consist of multiple families with\ndifferent cultural traits and mating preferences. These values determine\ninteractions and hence the growth rate of families and are transmitted to\noffspring with mutations. Through a multilevel evolutionary simulation, family\ntraits and preferences are grouped into multiple clans with inter-clan mating\npreferences. It illustrates the emergence of kinship structures as the\nspontaneous formation of interdependent cultural associations. Emergent kinship\nstructures are characterized by the cycle length of marriage exchange and the\nnumber of cycles in society. We numerically and analytically clarify their\nparameter dependence. The relative importance of cooperation versus rivalry\ndetermines whether attraction or repulsion exists between families. Different\nstructures evolve as locally stable attractors. The probabilities of formation\nand collapse of complex structures depend on the number of families and the\nmutation rate, showing characteristic scaling relationships. It is now possible\nto explore macroscopic kinship structures based on microscopic interactions,\ntogether with their environmental dependence and the historical causality of\ntheir evolution. We propose the basic causal mechanism of the formation of\ntypical human social structures by referring to ethnographic observations and\nconcepts from statistical physics and multilevel evolution. Such\ninterdisciplinary collaboration will unveil universal features in human\nsocieties.\n","subjects":["Physics/Physics and Society","Quantitative Biology/Populations and Evolution"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"yUZcuYs3cbI2iBKPU2b80Sk402w2n1Ckvjnec8jA2MQ","pdfSize":"2370923"}