{"id":"2407.16718","title":"Towards an Improved Taxonomy of Attacks related to Digital Identities\n  and Identity Management Systems","authors":"Daniela P\\\"ohn and Wolfgang Hommel","authorsParsed":[["Pöhn","Daniela",""],["Hommel","Wolfgang",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 07:46:40 GMT"}],"updateDate":"2024-07-25","timestamp":1721720800000,"abstract":"  Digital transformation with the adoption of cloud technologies, outsourcing,\nand working-from-home possibilities permits flexibility for organizations and\npersons. At the same time, it makes it more difficult to secure the IT\ninfrastructure as the IT team needs to keep track of who is accessing what data\nfrom where and when on which device. With these changes, identity management as\na key element of security becomes more important. Identity management relates\nto the technologies and policies for the identification, authentication, and\nauthorization of users (humans, devices) in computer networks. Due to the\ndiversity of identity management (i.e., models, protocols, and\nimplementations), different requirements, problems, and attack vectors need to\nbe taken into account. In order to secure identity management systems with\ntheir identities, a systematic approach is required. In this article, we\npropose the improved framework Taxonomy for Identity Management related to\nAttacks (TaxIdMA). The purpose of TaxIdMA is to classify existing attacks,\nattack vectors, and vulnerabilities associated with system identities, identity\nmanagement systems, and end-user identities. In addition, the background of\nthese attacks can be described in a structured and systematic way. The taxonomy\nis applied to the Internet of Things and self-sovereign identities. It is\nenhanced by a description language for threat intelligence sharing. Last but\nnot least, TaxIdMA is evaluated and improved based on expert interviews,\nstatistics, and discussions. This step enables broader applicability and level\nof detail at the same time. The combination of TaxIdMA, which allows a\nstructured way to outline attacks and is applicable to different scenarios, and\na description language for threat intelligence help to improve the security\nidentity management systems and processes.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_1R6myS-gJOlT5M8-8jur_5ar68AK2x2JPP9mKZTF-Q","pdfSize":"735568"}