{"id":"2407.08717","title":"WhisperNetV2: SlowFast Siamese Network For Lip-Based Biometrics","authors":"Abdollah Zakeri, Hamid Hassanpour, Mohammad Hossein Khosravi and Amir\n  Masoud Nourollah","authorsParsed":[["Zakeri","Abdollah",""],["Hassanpour","Hamid",""],["Khosravi","Mohammad Hossein",""],["Nourollah","Amir Masoud",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 17:51:49 GMT"}],"updateDate":"2024-07-12","timestamp":1720720309000,"abstract":"  Lip-based biometric authentication (LBBA) has attracted many researchers\nduring the last decade. The lip is specifically interesting for biometric\nresearchers because it is a twin biometric with the potential to function both\nas a physiological and a behavioral trait. Although much valuable research was\nconducted on LBBA, none of them considered the different emotions of the client\nduring the video acquisition step of LBBA, which can potentially affect the\nclient's facial expressions and speech tempo. We proposed a novel network\nstructure called WhisperNetV2, which extends our previously proposed network\ncalled WhisperNet. Our proposed network leverages a deep Siamese structure with\ntriplet loss having three identical SlowFast networks as embedding networks.\nThe SlowFast network is an excellent candidate for our task since the fast\npathway extracts motion-related features (behavioral lip movements) with a high\nframe rate and low channel capacity. The slow pathway extracts visual features\n(physiological lip appearance) with a low frame rate and high channel capacity.\nUsing an open-set protocol, we trained our network using the CREMA-D dataset\nand acquired an Equal Error Rate (EER) of 0.005 on the test set. Considering\nthat the acquired EER is less than most similar LBBA methods, our method can be\nconsidered as a state-of-the-art LBBA method.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"2OnV5CYYA4RiRjk9k1570MWHyXGNR-Ee9jM01RR8_Gc","pdfSize":"819373"}