{"id":"2407.00287","title":"Even- and odd-parity stabilities of black holes in Einstein-Aether\n  gravity","authors":"Antonio De Felice, Shinji Mukohyama, Shinji Tsujikawa, Anzhong Wang,\n  Chao Zhang","authorsParsed":[["De Felice","Antonio",""],["Mukohyama","Shinji",""],["Tsujikawa","Shinji",""],["Wang","Anzhong",""],["Zhang","Chao",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 02:45:47 GMT"}],"updateDate":"2024-07-02","timestamp":1719629147000,"abstract":"  In Einstein-Aether theories with a timelike unit vector field, we study the\nlinear stability of static and spherically symmetric black holes against both\neven- and odd-parity perturbations. For this purpose, we formulate a\ngauge-invariant black hole perturbation theory in the background\nAether-orthogonal frame where the spacelike property of hypersurfaces\northogonal to the timelike Aether field is always maintained even inside the\nmetric horizon. Using a short-wavelength approximation with large radial and\nangular momenta, we show that, in general, there are three dynamical degrees of\nfreedom arising from the even-parity sector besides two propagating degrees of\nfreedom present in the odd-parity sector. The propagation speeds of even-parity\nperturbations and their no-ghost conditions coincide with those of tensor,\nvector, and scalar perturbations on the Minkowski background, while the odd\nsector contains tensor and vector modes with the same propagation speeds as\nthose in the even-parity sector (and hence as those on the Minkowski\nbackground). Thus, the consistent study of black hole perturbations in the\nAether-orthogonal frame on static and spherically symmetric backgrounds does\nnot add new small-scale stability conditions to those known for the Minkowski\nbackground in the literature.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"g0SNhelr1PEcyMMe_SRTu7mHdFI2LM5w5tqbjZO1psM","pdfSize":"277511"}