{"id":"2407.00733","title":"CSPBench: a benchmark and critical evaluation of Crystal Structure\n  Prediction","authors":"Lai Wei, Sadman Sadeed Omee, Rongzhi Dong, Nihang Fu, Yuqi Song,\n  Edirisuriya M. D. Siriwardane, Meiling Xu, Chris Wolverton, Jianjun Hu","authorsParsed":[["Wei","Lai",""],["Omee","Sadman Sadeed",""],["Dong","Rongzhi",""],["Fu","Nihang",""],["Song","Yuqi",""],["Siriwardane","Edirisuriya M. D.",""],["Xu","Meiling",""],["Wolverton","Chris",""],["Hu","Jianjun",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 15:39:09 GMT"}],"updateDate":"2024-07-02","timestamp":1719761949000,"abstract":"  Crystal structure prediction (CSP) is now increasingly used in discovering\nnovel materials with applications in diverse industries. However, despite\ndecades of developments and significant progress in this area, there lacks a\nset of well-defined benchmark dataset, quantitative performance metrics, and\nstudies that evaluate the status of the field. We aim to fill this gap by\nintroducing a CSP benchmark suite with 180 test structures along with our\nrecently implemented CSP performance metric set. We benchmark a collection of\n13 state-of-the-art (SOTA) CSP algorithms including template-based CSP\nalgorithms, conventional CSP algorithms based on DFT calculations and global\nsearch such as CALYPSO, CSP algorithms based on machine learning (ML)\npotentials and global search, and distance matrix based CSP algorithms. Our\nresults demonstrate that the performance of the current CSP algorithms is far\nfrom being satisfactory. Most algorithms cannot even identify the structures\nwith the correct space groups except for the template-based algorithms when\napplied to test structures with similar templates. We also find that the ML\npotential based CSP algorithms are now able to achieve competitive performances\ncompared to the DFT-based algorithms. These CSP algorithms' performance is\nstrongly determined by the quality of the neural potentials as well as the\nglobal optimization algorithms. Our benchmark suite comes with a comprehensive\nopen-source codebase and 180 well-selected benchmark crystal structures, making\nit convenient to evaluate the advantages and disadvantages of CSP algorithms\nfrom future studies. All the code and benchmark data are available at\nhttps://github.com/usccolumbia/cspbenchmark\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"9r0gfukQjjcsQ_2xEq7c1ltkkebxUybse7IFexj-JU4","pdfSize":"9088222"}