{"id":"2407.18164","title":"The Emergence of Mem-Emitters","authors":"Victor Lopez-Richard, Igor Ricardo Filgueira e Silva, Alessandra Ames,\n  Frederico B. Sousa, Marcio Daldin Teodoro, Ingrid David Barcelos, Raphaela de\n  Oliveira, Alisson Ronieri Cadore","authorsParsed":[["Lopez-Richard","Victor",""],["Silva","Igor Ricardo Filgueira e",""],["Ames","Alessandra",""],["Sousa","Frederico B.",""],["Teodoro","Marcio Daldin",""],["Barcelos","Ingrid David",""],["de Oliveira","Raphaela",""],["Cadore","Alisson Ronieri",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 16:27:38 GMT"}],"updateDate":"2024-07-26","timestamp":1721924858000,"abstract":"  The advent of memristors and resistive switching has transformed solid state\nphysics, enabling advanced applications such as neuromorphic computing.\nInspired by these developments, we introduce the concept of Mem-emitters,\ndevices that manipulate light emission properties of semiconductors to achieve\nmemory functionalities. Mem-emitters, influenced by past exposure to stimuli,\noffer a new approach to optoelectronic computing with potential for enhanced\nspeed, efficiency, and integration. This study explores the unique properties\nof transition metal dichalcogenides-based heterostructures as a promising\nplatform for Mem-emitter functionalities due to their atomic-scale thickness,\ntunable electronic properties, and strong light-matter interaction. By\ndistinguishing between population-driven and transition rate-driven\nMem-emitters, we highlight their potential for various applications, including\noptoelectronic switches, variable light sources, and advanced communication\nsystems. Understanding these mechanisms paves the way for innovative\ntechnologies in memory and computation, offering insights into the intrinsic\ndynamics of complex systems.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"TL2w_3WDuH6PPUsmkwUdcGgK85TQOBOmdz-u_1e2tgI","pdfSize":"475009"}