{"id":"2407.18466","title":"A Progressive Single-Modality to Multi-Modality Classification Framework\n  for Alzheimer's Disease Sub-type Diagnosis","authors":"Yuxiao Liu, Mianxin Liu, Yuanwang Zhang, Kaicong Sun, Dinggang Shen","authorsParsed":[["Liu","Yuxiao",""],["Liu","Mianxin",""],["Zhang","Yuanwang",""],["Sun","Kaicong",""],["Shen","Dinggang",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 02:25:45 GMT"}],"updateDate":"2024-07-29","timestamp":1721960745000,"abstract":"  The current clinical diagnosis framework of Alzheimer's disease (AD) involves\nmultiple modalities acquired from multiple diagnosis stages, each with distinct\nusage and cost. Previous AD diagnosis research has predominantly focused on how\nto directly fuse multiple modalities for an end-to-end one-stage diagnosis,\nwhich practically requires a high cost in data acquisition. Moreover, a\nsignificant part of these methods diagnose AD without considering clinical\nguideline and cannot offer accurate sub-type diagnosis. In this paper, by\nexploring inter-correlation among multiple modalities, we propose a novel\nprogressive AD sub-type diagnosis framework, aiming to give diagnosis results\nbased on easier-to-access modalities in earlier low-cost stages, instead of\nmodalities from all stages. Specifically, first, we design 1) a text\ndisentanglement network for better processing tabular data collected in the\ninitial stage, and 2) a modality fusion module for fusing multi-modality\nfeatures separately. Second, we align features from modalities acquired in\nearlier low-cost stage(s) with later high-cost stage(s) to give accurate\ndiagnosis without actual modality acquisition in later-stage(s) for saving\ncost. Furthermore, we follow the clinical guideline to align features at each\nstage for achieving sub-type diagnosis. Third, we leverage a progressive\nclassifier that can progressively include additional acquired modalities (if\nneeded) for diagnosis, to achieve the balance between diagnosis cost and\ndiagnosis performance. We evaluate our proposed framework on large diverse\npublic and in-home datasets (8280 in total) and achieve superior performance\nover state-of-the-art methods. Our codes will be released after the acceptance.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"tK6rzx7rRR3GAKcWpHrEgtifYGFtO5Zsg-5wzA7Pl_I","pdfSize":"452251"}