{"id":"2407.06555","title":"Comparison of Models for the Warm-Hot Circumgalactic Medium around Milky\n  Way-like Galaxies","authors":"Priyanka Singh, Erwin T. Lau, Yakov Faerman, Jonathan Stern, Daisuke\n  Nagai","authorsParsed":[["Singh","Priyanka",""],["Lau","Erwin T.",""],["Faerman","Yakov",""],["Stern","Jonathan",""],["Nagai","Daisuke",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 05:20:09 GMT"}],"updateDate":"2024-07-10","timestamp":1720502409000,"abstract":"  A systematic comparison of the models of the circumgalactic medium (CGM) and\ntheir observables is crucial to understanding the predictive power of the\nmodels and constraining physical processes that affect the thermodynamics of\nCGM. This paper compares four analytic CGM models: precipitation, isentropic,\ncooling flow, and baryon pasting models for the hot, volume-filling CGM phase,\nall assuming hydrostatic or quasi-hydrostatic equilibrium. We show that for\nfiducial parameters of the CGM of a Milky-Way (MW) like galaxy ($\\rm M_{vir}\n\\sim 10^{12}~M_{\\odot}$ at $z\\sim 0$), the thermodynamic profiles -- entropy,\ndensity, temperature, and pressure -- show most significant differences between\ndifferent models at small ($r\\lesssim 30$ kpc) and large scales ($r\\gtrsim 100$\nkpc) while converging at intermediate scales. The slope of the entropy profile,\nwhich is one of the most important differentiators between models, is $\\approx\n0.8$ for the precipitation and cooling flow models, while it is $\\approx0.6$\nand 0 for the baryon pasting and isentropic models, respectively. We make\npredictions for various observational quantities for an MW mass halo for the\ndifferent models, including the projected Sunyaev-Zeldovich (SZ) effect, soft\nX-ray emission (0.5--2 keV), dispersion measure, and column densities of oxygen\nions (OVI, OVII, and OVIII) observable in absorption.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"E9B0MqFQmwVqUOkHenRf35PcSKBRrBYDyoEZM-8Y6ns","pdfSize":"2328796"}