{"id":"2407.16564","title":"Audio Prompt Adapter: Unleashing Music Editing Abilities for\n  Text-to-Music with Lightweight Finetuning","authors":"Fang-Duo Tsai, Shih-Lun Wu, Haven Kim, Bo-Yu Chen, Hao-Chung Cheng,\n  Yi-Hsuan Yang","authorsParsed":[["Tsai","Fang-Duo",""],["Wu","Shih-Lun",""],["Kim","Haven",""],["Chen","Bo-Yu",""],["Cheng","Hao-Chung",""],["Yang","Yi-Hsuan",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 15:16:18 GMT"},{"version":"v2","created":"Wed, 24 Jul 2024 11:12:15 GMT"}],"updateDate":"2024-07-25","timestamp":1721747778000,"abstract":"  Text-to-music models allow users to generate nearly realistic musical audio\nwith textual commands. However, editing music audios remains challenging due to\nthe conflicting desiderata of performing fine-grained alterations on the audio\nwhile maintaining a simple user interface. To address this challenge, we\npropose Audio Prompt Adapter (or AP-Adapter), a lightweight addition to\npretrained text-to-music models. We utilize AudioMAE to extract features from\nthe input audio, and construct attention-based adapters to feedthese features\ninto the internal layers of AudioLDM2, a diffusion-based text-to-music model.\nWith 22M trainable parameters, AP-Adapter empowers users to harness both global\n(e.g., genre and timbre) and local (e.g., melody) aspects of music, using the\noriginal audio and a short text as inputs. Through objective and subjective\nstudies, we evaluate AP-Adapter on three tasks: timbre transfer, genre\ntransfer, and accompaniment generation. Additionally, we demonstrate its\neffectiveness on out-of-domain audios containing unseen instruments during\ntraining.\n","subjects":["Computing Research Repository/Sound","Computing Research Repository/Artificial Intelligence","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"IbTuwGOfbBnCY7kZWKOfziM3CIPtCzQaoDHeN538zEY","pdfSize":"632862","objectId":"0xd279a5ffb56e35f806f47ee234a8d230971961906529a223451c895e4de708e9","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
