{"id":"2407.12772","title":"LMMs-Eval: Reality Check on the Evaluation of Large Multimodal Models","authors":"Kaichen Zhang, Bo Li, Peiyuan Zhang, Fanyi Pu, Joshua Adrian Cahyono,\n  Kairui Hu, Shuai Liu, Yuanhan Zhang, Jingkang Yang, Chunyuan Li, Ziwei Liu","authorsParsed":[["Zhang","Kaichen",""],["Li","Bo",""],["Zhang","Peiyuan",""],["Pu","Fanyi",""],["Cahyono","Joshua Adrian",""],["Hu","Kairui",""],["Liu","Shuai",""],["Zhang","Yuanhan",""],["Yang","Jingkang",""],["Li","Chunyuan",""],["Liu","Ziwei",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 17:51:53 GMT"}],"updateDate":"2024-07-18","timestamp":1721238713000,"abstract":"  The advances of large foundation models necessitate wide-coverage, low-cost,\nand zero-contamination benchmarks. Despite continuous exploration of language\nmodel evaluations, comprehensive studies on the evaluation of Large Multi-modal\nModels (LMMs) remain limited. In this work, we introduce LMMS-EVAL, a unified\nand standardized multimodal benchmark framework with over 50 tasks and more\nthan 10 models to promote transparent and reproducible evaluations. Although\nLMMS-EVAL offers comprehensive coverage, we find it still falls short in\nachieving low cost and zero contamination. To approach this evaluation\ntrilemma, we further introduce LMMS-EVAL LITE, a pruned evaluation toolkit that\nemphasizes both coverage and efficiency. Additionally, we present Multimodal\nLIVEBENCH that utilizes continuously updating news and online forums to assess\nmodels' generalization abilities in the wild, featuring a low-cost and\nzero-contamination evaluation approach. In summary, our work highlights the\nimportance of considering the evaluation trilemma and provides practical\nsolutions to navigate the trade-offs in evaluating large multi-modal models,\npaving the way for more effective and reliable benchmarking of LMMs. We\nopensource our codebase and maintain leaderboard of LIVEBENCH at\nhttps://github.com/EvolvingLMMs-Lab/lmms-eval and\nhttps://huggingface.co/spaces/lmms-lab/LiveBench.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"UabRutU30Ysyb4zJUSYPYkWBR-LGr5vSNzFDcE1AJtU","pdfSize":"14144858"}