{"id":"2407.00938","title":"MalAlgoQA: A Pedagogical Approach for Evaluating Counterfactual\n  Reasoning Abilities","authors":"Naiming Liu, Shashank Sonkar, Myco Le, Richard Baraniuk","authorsParsed":[["Liu","Naiming",""],["Sonkar","Shashank",""],["Le","Myco",""],["Baraniuk","Richard",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 03:39:13 GMT"}],"updateDate":"2024-07-02","timestamp":1719805153000,"abstract":"  This paper introduces MalAlgoQA, a novel dataset designed to evaluate the\ncounterfactual reasoning capabilities of Large Language Models (LLMs) through a\npedagogical approach. The dataset comprises mathematics and reading\ncomprehension questions, each accompanied by four answer choices and their\ncorresponding rationales. We focus on the incorrect answer rationales, termed\n\"malgorithms\", which highlights flawed reasoning steps leading to incorrect\nanswers and offers valuable insights into erroneous thought processes. We also\npropose the Malgorithm Identification task, where LLMs are assessed based on\ntheir ability to identify corresponding malgorithm given an incorrect answer\nchoice. To evaluate the model performance, we introduce two metrics: Algorithm\nIdentification Accuracy (AIA) for correct answer rationale identification, and\nMalgorithm Identification Accuracy (MIA) for incorrect answer rationale\nidentification. The task is challenging since state-of-the-art LLMs exhibit\nsignificant drops in MIA as compared to AIA. Moreover, we find that the\nchain-of-thought prompting technique not only fails to consistently enhance\nMIA, but can also lead to underperformance compared to simple prompting. These\nfindings hold significant implications for the development of more\ncognitively-inspired LLMs to improve their counterfactual reasoning abilities,\nparticularly through a pedagogical perspective where understanding and\nrectifying student misconceptions are crucial.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"HBHfoPRR80MESYG09wLh47cGHguN57XVN2wYKLUlTTI","pdfSize":"846277"}