{"id":"2407.05988","title":"Minimum-regret hydrogen supply chain strategies to foster the energy\n  transition of European hard-to-abate industries","authors":"Alissa Ganter, Paolo Gabrielli, Hanne Goericke, Giovanni Sansavini","authorsParsed":[["Ganter","Alissa",""],["Gabrielli","Paolo",""],["Goericke","Hanne",""],["Sansavini","Giovanni",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 14:28:37 GMT"}],"updateDate":"2024-07-09","timestamp":1720448917000,"abstract":"  Low-carbon hydrogen (H2) is envisioned to play a central role in\ndecarbonizing European hard-to-abate industries, such as refineries, ammonia,\nmethanol, steel, and cement. To enable its widespread use, H2 supply chain\n(HSC) infrastructure is required. Mature and economically viable low-carbon H2\nproduction pathways include steam methane reforming (SMR) of natural gas\ncoupled with carbon dioxide capture and storage (CCS), water-electrolysis from\nrenewable electricity, biomethane reforming, and biomass gasification. However,\nuncertainties surrounding demand and feedstock availabilities hamper their\nproliferation. Here, we investigate the impact of uncertainty in H2 demand and\nbiomass availability on the optimal HSC design. The HSC is modeled as a network\nof H2 production and consumption sites that are interconnected with H2 and\nbiomass transport technologies. A CCS supply chain is modeled alongside the\nHSC. The cost-optimal HSC design is determined based on a linear optimization\nproblem that considers a regional resolution and a multi-year time horizon\n(2022-2050). We adopt a scenario-based uncertainty quantification approach and\ndefine discrete H2 demand and biomass availability scenarios. Applying a\nminimum-regret strategy, we show that sufficiently large low-carbon H2\nproduction capacities (about 9.6 Mt/a by 2030) are essential to flexibly scale\nup HSCs and accommodate H2 demands of up to 35 Mt/a by 2050. While\nbiomass-based H2 production emerges as the most cost-efficient low-carbon H2\nproduction pathway, investments are not recommended unless the availability of\nbiomass feedstocks is guaranteed. Instead, investments in SMR-CCS and\nelectrolysis often offer greater flexibility. In addition, we highlight the\nimportance of CCS infrastructure, which is required across scenarios.\n","subjects":["Physics/Physics and Society","Computing Research Repository/Emerging Technologies"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"hDG8OAjmrlKZ2nMo5a8YPqy4_82QCVFUwxJHa3EaeQs","pdfSize":"8023465"}