{"id":"2407.18602","title":"Testing Lyman Alpha Emitters and Lyman-Break Galaxies as Tracers of\n  Large-Scale Structures at High Redshifts","authors":"Sang Hyeok Im, Ho Seong Hwang, Jaehong Park, Jaehyun Lee, Hyunmi Song,\n  Stephen Appleby, Yohan Dubois, C. Gareth Few, Brad K. Gibson, Juhan Kim,\n  Yonghwi Kim, Changbom Park, Christophe Pichon, Jihye Shin, Owain N. Snaith,\n  Maria Celeste Artale, Eric Gawiser, Lucia Guaita, Woong-Seob Jeong,\n  Kyoung-Soo Lee, Nelson Padilla, Vandana Ramakrishnan, Paulina Troncoso, Yujin\n  Yang","authorsParsed":[["Im","Sang Hyeok",""],["Hwang","Ho Seong",""],["Park","Jaehong",""],["Lee","Jaehyun",""],["Song","Hyunmi",""],["Appleby","Stephen",""],["Dubois","Yohan",""],["Few","C. Gareth",""],["Gibson","Brad K.",""],["Kim","Juhan",""],["Kim","Yonghwi",""],["Park","Changbom",""],["Pichon","Christophe",""],["Shin","Jihye",""],["Snaith","Owain N.",""],["Artale","Maria Celeste",""],["Gawiser","Eric",""],["Guaita","Lucia",""],["Jeong","Woong-Seob",""],["Lee","Kyoung-Soo",""],["Padilla","Nelson",""],["Ramakrishnan","Vandana",""],["Troncoso","Paulina",""],["Yang","Yujin",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 08:54:22 GMT"}],"updateDate":"2024-07-29","timestamp":1721984062000,"abstract":"  We test whether Lyman alpha emitters (LAEs) and Lyman-break galaxies (LBGs)\ncan be good tracers of high-z large-scale structures, using the Horizon Run 5\ncosmological hydrodynamical simulation. We identify LAEs using the Ly{\\alpha}\nemission line luminosity and its equivalent width, and LBGs using the\nbroad-band magnitudes at z~2.4, 3.1, and 4.5. We first compare the spatial\ndistributions of LAEs, LBGs, all galaxies, and dark matter around the\nfilamentary structures defined by dark matter. The comparison shows that both\nLAEs and LBGs are more concentrated toward the dark matter filaments than dark\nmatter. We also find an empirical fitting formula for the vertical density\nprofile of filaments as a binomial power-law relation of the distance to the\nfilaments. We then compare the spatial distributions of the samples around the\nfilaments defined by themselves. LAEs and LBGs are again more concentrated\ntoward their filaments than dark matter. We also find the overall consistency\nbetween filamentary structures defined by LAEs, LBGs, and dark matter, with the\nmedian spatial offsets that are smaller than the mean separation of the sample.\nThese results support the idea that the LAEs and LBGs could be good tracers of\nlarge-scale structures of dark matter at high redshifts.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"lYIFl9rpxvdxD-b7VRd-vWp1J8yYxhHvFUYjy1omLK8","pdfSize":"9322430","objectId":"0x07ef8c35b257b5aa02de5026ebe2f7ebd479150adb6e78eb7ae992b61f762f31","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
