{"id":"2407.05150","title":"Data-centric challenges with the application and adoption of artificial\n  intelligence for drug discovery","authors":"Ghita Ghislat, Saiveth Hernandez-Hernandez, Chayanit Piwajanusorn,\n  Pedro J. Ballester","authorsParsed":[["Ghislat","Ghita",""],["Hernandez-Hernandez","Saiveth",""],["Piwajanusorn","Chayanit",""],["Ballester","Pedro J.",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 18:37:33 GMT"},{"version":"v2","created":"Mon, 19 Aug 2024 16:24:12 GMT"},{"version":"v3","created":"Fri, 6 Sep 2024 23:30:34 GMT"}],"updateDate":"2024-09-10","timestamp":1720291053000,"abstract":"  Introduction: Artificial intelligence (AI) is exhibiting tremendous potential\nto reduce the massive costs and long timescales of drug discovery. There are\nhowever important challenges currently limiting the impact and scope of AI\nmodels.\n  Areas covered: In this perspective, the authors discuss a range of data\nissues (bias, inconsistency, skewness, irrelevance, small size, high\ndimensionality), how they challenge AI models, and which issue-specific\nmitigations have been effective. Next, they point out the challenges faced by\nuncertainty quantification techniques aimed at enhancing and trusting the\npredictions from these AI models. They also discuss how conceptual errors,\nunrealistic benchmarks and performance misestimation can confound the\nevaluation of models and thus their development. Lastly, the authors explain\nhow human bias, whether from AI experts or drug discovery experts, constitutes\nanother challenge that can be alleviated by gaining more prospective\nexperience.\n  Expert opinion: AI models are often developed to excel on retrospective\nbenchmarks unlikely to anticipate their prospective performance. As a result,\nonly a few of these models are ever reported to have prospective value (e.g. by\ndiscovering potent and innovative drug leads for a therapeutic target). The\nauthors have discussed what can go wrong in practice with AI for drug\ndiscovery. We hope that this will help inform the decisions of editors, funders\ninvestors and researchers working in this area.\n","subjects":["Quantitative Biology/Other Quantitative Biology"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"1NudKr2GqbBNl4vIparxHa3EqeA3j9pONDVXwQaNmsQ","pdfSize":"595096"}