{"id":"2407.05135","title":"Theory and Explicit Design of a Path Planner for an SE(3) Robot","authors":"Zhaoqi Zhang, Yi-Jen Chiang, Chee Yap","authorsParsed":[["Zhang","Zhaoqi",""],["Chiang","Yi-Jen",""],["Yap","Chee",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 17:19:53 GMT"}],"updateDate":"2024-07-09","timestamp":1720286393000,"abstract":"  We consider path planning for a rigid spatial robot with 6 degrees of freedom\n(6 DOFs), moving amidst polyhedral obstacles. A correct, complete and practical\npath planner for such a robot has never been achieved, although this is widely\nrecognized as a key challenge in robotics. This paper provides a complete\n\"explicit\" design, down to explicit geometric primitives that are easily\nimplementable.\n  Our design is within an algorithmic framework for path planners, called Soft\nSubdivision Search (SSS). The framework is based on the twin foundations of\n$\\epsilon$-exactness and soft predicates, which are critical for rigorous\nnumerical implementations. The practicality of SSS has been previously\ndemonstrated for various robots including 5-DOF spatial robots.\n  In this paper, we solve several significant technical challenges for SE(3)\nrobots: (1) We first ensure the correct theory by proving a general form of the\nFundamental Theorem of the SSS theory. We prove this within an axiomatic\nframework, thus making it easy for future applications of this theory. (2) One\ncomponent of $SE(3) = R^3 \\times SO(3)$ is the non-Euclidean, non-orientable\nspace SO(3). We design a novel topologically correct data structure for SO(3).\nUsing the concept of subdivision charts and atlases for SO(3), we can now carry\nout subdivision of SO(3). (3) The geometric problem of collision detection\ntakes place in $R^3$, via the footprint map. Unlike sampling-based approaches,\nwe must reason with the notion of footprints of configuration boxes, which is\nmuch harder to characterize. Exploiting the theory of soft predicates, we\ndesign suitable approximate footprints which, when combined with the highly\neffective feature-set technique, lead to soft predicates. (4) Finally, we make\nthe underlying geometric computation \"explicit\", i.e., avoiding a general\nsolver of polynomial systems, in order to allow a direct implementation.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Computational Geometry"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"uJbGtAxzqczj76AcChFL_d4Z0A6eaLwcJe4vdu_lP64","pdfSize":"1705081"}