{"id":"2407.10132","title":"Optimal Kernel Choice for Score Function-based Causal Discovery","authors":"Wenjie Wang, Biwei Huang, Feng Liu, Xinge You, Tongliang Liu, Kun\n  Zhang and Mingming Gong","authorsParsed":[["Wang","Wenjie",""],["Huang","Biwei",""],["Liu","Feng",""],["You","Xinge",""],["Liu","Tongliang",""],["Zhang","Kun",""],["Gong","Mingming",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 09:32:20 GMT"}],"updateDate":"2024-07-16","timestamp":1720949540000,"abstract":"  Score-based methods have demonstrated their effectiveness in discovering\ncausal relationships by scoring different causal structures based on their\ngoodness of fit to the data. Recently, Huang et al. proposed a generalized\nscore function that can handle general data distributions and causal\nrelationships by modeling the relations in reproducing kernel Hilbert space\n(RKHS). The selection of an appropriate kernel within this score function is\ncrucial for accurately characterizing causal relationships and ensuring precise\ncausal discovery. However, the current method involves manual heuristic\nselection of kernel parameters, making the process tedious and less likely to\nensure optimality. In this paper, we propose a kernel selection method within\nthe generalized score function that automatically selects the optimal kernel\nthat best fits the data. Specifically, we model the generative process of the\nvariables involved in each step of the causal graph search procedure as a\nmixture of independent noise variables. Based on this model, we derive an\nautomatic kernel selection method by maximizing the marginal likelihood of the\nvariables involved in each search step. We conduct experiments on both\nsynthetic data and real-world benchmarks, and the results demonstrate that our\nproposed method outperforms heuristic kernel selection methods.\n","subjects":["Computing Research Repository/Machine Learning","Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"p74ELgjCOndy7RFjK0GI1LdBmpluPV7F2Ev7B3lSK1E","pdfSize":"828469","objectId":"0x1dcba38bd69adeeb9516a0e9af0af3765115355ffda5503e10d938309b767c36","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
