{"id":"2407.15572","title":"FEASTS Combined with Interferometry (II): Significantly Changed HI\n  Surface Densities and Even More Inefficient Star Formation in Galaxy Outer\n  Disks","authors":"Jing Wang, Xuchen Lin, Lister Staveley-Smith, Dong Yang, Fabian\n  Walter, Zezhong Liang, Yong Shi, Jian Fu, Hong Guo, Luis C. Ho, Shu-Ichiro\n  Inutsuka, Fangzhou Jiang, Peng Jiang, Zhijie Qu, and Li Shao","authorsParsed":[["Wang","Jing",""],["Lin","Xuchen",""],["Staveley-Smith","Lister",""],["Yang","Dong",""],["Walter","Fabian",""],["Liang","Zezhong",""],["Shi","Yong",""],["Fu","Jian",""],["Guo","Hong",""],["Ho","Luis C.",""],["Inutsuka","Shu-Ichiro",""],["Jiang","Fangzhou",""],["Jiang","Peng",""],["Qu","Zhijie",""],["Shao","Li",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 11:58:10 GMT"}],"updateDate":"2024-07-23","timestamp":1721649490000,"abstract":"  We update the HI surface density measurements for a subset of 17 THINGS\ngalaxies by dealing with the short-spacing problem of the original VLA HI\nimages. It is the same sample that Bigiel et al. (2010) used to study the\nrelation between HI surface densities and star formation rate surface densities\nin galaxy outer disks, which are beyond the optical radius r25. For ten\ngalaxies, the update is based on combining original THINGS VLA HI images with\nHI images taken by the single-dish FAST in the FEASTS program. The median\nincrement of HI surface densities in outer disks is 0.15 to 0.4 dex at a given\nnew HI surface density. Several galaxies change significantly in the shape of\nradial profiles HI surface densities, and seven galaxies are now more than\n1-$\\sigma$ below the HI size-mass relation. We update the HI star formation\nlaws in outer disks. The median relation between HI surface densities and star\nformation rate surface densities based on pixelwise measurements shifts\ndownward by around 0.15 dex because the HI surface density values shift\nrightward, and the scatter increases significantly. The scatter of the\nrelation, indicating the star forming efficiency, exhibits a much stronger\npositive correlation with the stellar mass surface density than before. Thus,\ndetecting the previously missed, diffuse HI due to short-spacing problem of the\nVLA observation is important in revealing the true condition and variation of\nstar formation possibly regulated by stellar feedbacks in localized environment\nof outer disks.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"FdM5XZR-u7VTD6Y4jkF8lRgTj_LTPcggM8S6nnHDj8k","pdfSize":"2451574"}