{"id":"2407.12645","title":"Effect of strong confinement on the order parameter dynamics in\n  fermionic superfluids","authors":"Cesar R. Cabrera, Ren\\'e Henke, Lukas Broers, Jim Skulte, H.P. Ojeda\n  Collado, Hauke Biss, Ludwig Mathey, Henning Moritz","authorsParsed":[["Cabrera","Cesar R.",""],["Henke","René",""],["Broers","Lukas",""],["Skulte","Jim",""],["Collado","H. P. Ojeda",""],["Biss","Hauke",""],["Mathey","Ludwig",""],["Moritz","Henning",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 15:15:38 GMT"}],"updateDate":"2024-07-18","timestamp":1721229338000,"abstract":"  Fermionic pairing and the superfluid order parameter change dramatically in\nlow-dimensional systems such as high-T$_c$ superconductors. Here we show how\nthe order parameter dynamics, which defines essential collective properties, is\nmodified by strong confinement. Using a model system for strongly correlated\nsuperfluidity, an ultracold fermionic gas, we study the response to a weak\nmodulation of the confinement. Surprisingly, we observe a well-defined\ncollective mode throughout the entire crossover from the\nBardeen-Cooper-Schrieffer (BCS) state to Bose-Einstein condensation (BEC) of\nmolecules. Starting in the BCS regime, the excitation energy follows twice the\npairing gap, then drops below it in the strongly correlated regime, and finally\napproaches twice the harmonic level spacing imposed by the confinement in the\nBEC regime. Its spectral weight vanishes when approaching the superfluid\ncritical temperature. The experimental results are in excellent agreement with\nan effective field theory, providing strong evidence that amplitude\noscillations of the order parameter hybridize with and eventually transform\ninto spatial excitations along the confined direction. The strong modification\nof the excitation spectrum highlights the relevance of confinement to fermionic\nsuperfluids and superconductors, and raises questions about its influence on\nother fundamental quantities.\n","subjects":["Condensed Matter/Quantum Gases"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"z736KUH452SJ01Z76MufHoLRK_EGa2o26y1l5ZUZfTk","pdfSize":"10662738"}