{"id":"2407.15748","title":"MoRSE: Bridging the Gap in Cybersecurity Expertise with Retrieval\n  Augmented Generation","authors":"Marco Simoni, Andrea Saracino, Vinod P. and Mauro Conti","authorsParsed":[["Simoni","Marco",""],["Saracino","Andrea",""],["P.","Vinod",""],["Conti","Mauro",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 15:53:27 GMT"}],"updateDate":"2024-07-23","timestamp":1721663607000,"abstract":"  In this paper, we introduce MoRSE (Mixture of RAGs Security Experts), the\nfirst specialised AI chatbot for cybersecurity. MoRSE aims to provide\ncomprehensive and complete knowledge about cybersecurity. MoRSE uses two RAG\n(Retrieval Augmented Generation) systems designed to retrieve and organize\ninformation from multidimensional cybersecurity contexts. MoRSE differs from\ntraditional RAGs by using parallel retrievers that work together to retrieve\nsemantically related information in different formats and structures. Unlike\ntraditional Large Language Models (LLMs) that rely on Parametric Knowledge\nBases, MoRSE retrieves relevant documents from Non-Parametric Knowledge Bases\nin response to user queries. Subsequently, MoRSE uses this information to\ngenerate accurate answers. In addition, MoRSE benefits from real-time updates\nto its knowledge bases, enabling continuous knowledge enrichment without\nretraining. We have evaluated the effectiveness of MoRSE against other\nstate-of-the-art LLMs, evaluating the system on 600 cybersecurity specific\nquestions. The experimental evaluation has shown that the improvement in terms\nof relevance and correctness of the answer is more than 10\\% compared to known\nsolutions such as GPT-4 and Mixtral 7x8.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Information Retrieval"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"YAjVoQaaMHDBgyKrbJtqIJT6s0YVB-Um_q8GJAoI3YE","pdfSize":"1820230","objectId":"0x1193ac48fbd44586aadb9003d50c6079a9b8c0ddd68fca0110dc5def7fa09f58","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
