{"id":"2407.02044","title":"The interface of gravity and dark energy","authors":"Kristen Lackeos, Richard Lieu","authorsParsed":[["Lackeos","Kristen",""],["Lieu","Richard",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 08:17:21 GMT"}],"updateDate":"2024-07-03","timestamp":1719908241000,"abstract":"  At sufficiently large radii dark energy modifies the behavior of (a) bound\norbits around a galaxy and (b) virialized gas in a cluster of galaxies. Dark\nenergy also provides a natural cutoff to a cluster's dark matter halo. In (a)\nthere exists a maximum circular orbit beyond which periodic motion is no longer\npossible, and orbital evolution near critical binding is analytically\ncalculable using an adiabatic invariant integral. The finding implicates the\nstudy of wide galaxy pairs. In (b), dark energy necessitates the use of a\ngeneralized Virial Theorem to describe gas at the outskirts of a cluster. When\ncoupled to the baryonic escape condition, aided by dark energy, the results is\na radius beyond which the continued establishment of a hydrostatic halo of\nthermalized baryons is untenable. This leads to a theoretically motivated\nvirial radius. We use this theory to probe the structure of a cluster's\nbaryonic halo and apply it to X-ray and weak-lensing data collected on cluster\nAbell 1835. We find that gas in its outskirts deviates significantly from\nhydrostatic equilibrium beginning at $\\sim 1.3\\ {\\rm Mpc}$, the `inner' virial\nradius. We also define a model dependent dark matter halo cutoff radius to\nA1835. The dark matter cutoff gives an upper limit to the cluster's total mass\nof $\\sim7\\times 10^{15}M_{\\odot}$. Moreover, it is possible to derive an\n`outer' hydrostatic equilibrium cutoff radius given a dark matter cutoff\nradius. A region of cluster gas transport and turbulence occurs between the\ninner and outer cutoff radii.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"akVcqrjMEwh5LxiZNcZ7P2WGOAdIw7zO5TaIMN3b1tw","pdfSize":"698273"}