{"id":"2407.01039","title":"Flaires: A Comprehensive Catalog of Dust-Echo-like Infrared Flares","authors":"Jannis Necker and Eleni Graikou and Marek Kowalski and Anna\n  Franckowiak and Jakob Nordin and Teresa Pernice and Sjoert van Velzen and\n  Patrik M. Veres","authorsParsed":[["Necker","Jannis",""],["Graikou","Eleni",""],["Kowalski","Marek",""],["Franckowiak","Anna",""],["Nordin","Jakob",""],["Pernice","Teresa",""],["van Velzen","Sjoert",""],["Veres","Patrik M.",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 07:50:36 GMT"}],"updateDate":"2024-07-02","timestamp":1719820236000,"abstract":"  Context: Observations of transient emission from extreme accretion events\nonto supermassive black holes can reveal conditions in the center of galaxies\nand the black hole itself. Most recently, they have been suggested to be\nemitters of high-energy neutrinos. If it is suddenly rejuvenated accretion or a\ntidal disruption event (TDE) is not clear in most cases. Aims: We expanded on\nexisting samples of infrared flares to compile the largest and most complete\nlist available. A large sample size is necessary to provide high enough\nstatistics for far away and faint objects to estimate their rate. Our catalog\nis large enough to facilitate a preliminary study of the rate evolution with\nredshift for the first time. Methods: We compiled a sample of 40 million\ngalaxies, and, using a custom, publicly available pipeline, analyzed the WISE\nlight curves for these 40 million objects using the Bayesian Blocks algorithm.\nWe selected promising candidates for dust echos of transient accretion events\nand inferred the luminosity, extension, and temperature of the hot dust by\nfitting a blackbody spectrum. Results: We established a clean sample of 823\ndust-echo-like infrared flares, of which we can estimate the dust properties\nfor 568. After removing 70 objects with possible contribution by synchrotron\nemission, the luminosity, extension, and temperature are consistent with dust\nechos. Estimating the dust extension from the light curve shape revealed that\nthe duration of the incident flare is broadly compatible with the duration of\nTDEs. The resulting rate per galaxy is consistent with the latest measurements\nof infrared-detected TDEs and appears to decline at increasing redshift.\nConclusions: Although systematic uncertainties may impact the calculation of\nthe rate evolution, this catalog will enable further research in phenomena\nrelated to dust-echos from TDEs and extreme accretion flares.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"WhfKT8NeenBx_k836mFIW_IgFmYKAJzy8qG_6ePckwE","pdfSize":"1514082"}