{"id":"2407.07105","title":"Modeling of Hot-Carrier Degradation driven by silicon-hydrogen bond\n  dissociation in SPADs","authors":"Mathieu Sicre, Xavier Federspiel, Bastien Mamdy, David Roy, and\n  Francis Calmon","authorsParsed":[["Sicre","Mathieu",""],["Federspiel","Xavier",""],["Mamdy","Bastien",""],["Roy","David",""],["Calmon","Francis",""]],"versions":[{"version":"v1","created":"Sun, 23 Jun 2024 16:23:28 GMT"},{"version":"v2","created":"Mon, 15 Jul 2024 17:38:01 GMT"},{"version":"v3","created":"Sat, 3 Aug 2024 15:24:36 GMT"}],"updateDate":"2024-08-06","timestamp":1719159808000,"abstract":"  A novel approach for modeling Dark Count Rate (DCR) drift in Single-Photon\nAvalanche Diodes (SPADs) is proposed based on Hot-Carrier Degradation (HCD)\ninducing silicon-hydrogen bond dissociation at the Si/SiO2 interface. The\nenergy and the quantity of hot-carriers are modeled by the interplay of carrier\nenergy distribution and current density. The carrier energy distribution,\nachieved by a Full-Band Monte-Carlo simulation considering the band structure\nand the scattering mechanisms, establishes a crucial link to the degradation of\nthe top SPAD interface, primarily influenced by hot electrons due to their\nbroader energy spread. The current density is determined by analyzing the\ngeneration rates of carriers under dark and photo conditions, along with the\nmultiplication rate, through a combination of experimental data and modeling\ntechniques. Subsequently,these hot carriers are correlated with the\ndistribution of bond dissociation energy, which is modeled by the\ndisorder-induced local variations among the Si-H bond energy at the Si/SiO2\ninterface. The impact-ionization probability between hot carriers and Si-H\nbonds is then calculated by differentiating their energies, thereby determining\nthe degradation kinetics. This enables the capture of the rise in dark current\ndensity with stress duration by the increasing number of defects, which in turn\naffects the modeling of degradation rate. For the first time, a direct\ncorrelation between the dark current and DCR, along with their drift over\nstress time, has been established, relying on the carrier generation rate\noriginating from these defects together with the position-dependent breakdown\nprobability Pt.This physic-based model allows to predict DCR for unprecedented\nlong-term stress measurement time up to 10e6s, covering a whole set of\ncharacterization and stress conditions for SPAD devices.\n","subjects":["Condensed Matter/Materials Science","Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Wee0fAqmUXSAK0HAWZ370LE47MwOHVkYQalDBlA73bQ","pdfSize":"5728394"}