{"id":"2407.07573","title":"Mapping Local Green Hydrogen Cost-Potentials by a Multidisciplinary\n  Approach","authors":"Shitab Ishmam, Heidi Heinrichs, Christoph Winkler, Bagher Bayat, Amin\n  Lahnaoui, Solomon Agbo, Edgar Ubaldo Pena Sanchez, David Franzmann, Nathan\n  Ojieabu, Celine Koerner, Youpele Micheal, Bamidele Oloruntoba, Carsten\n  Montzka, Harry Vereecken, Harrie-Jan Hendricks-Franssen, Jeerawan Brendt,\n  Simon Brauner, Wilhelm Kuckshinrichs, Sandra Venghaus, Daouda Kone, Bruno\n  Korgo, Kehinde Ogunjobi, Vasco Chiteculo, Jane Olwoch, Zachary Getenga,\n  Jochen Lin{\\ss}en, Detlef Stolten","authorsParsed":[["Ishmam","Shitab",""],["Heinrichs","Heidi",""],["Winkler","Christoph",""],["Bayat","Bagher",""],["Lahnaoui","Amin",""],["Agbo","Solomon",""],["Sanchez","Edgar Ubaldo Pena",""],["Franzmann","David",""],["Ojieabu","Nathan",""],["Koerner","Celine",""],["Micheal","Youpele",""],["Oloruntoba","Bamidele",""],["Montzka","Carsten",""],["Vereecken","Harry",""],["Hendricks-Franssen","Harrie-Jan",""],["Brendt","Jeerawan",""],["Brauner","Simon",""],["Kuckshinrichs","Wilhelm",""],["Venghaus","Sandra",""],["Kone","Daouda",""],["Korgo","Bruno",""],["Ogunjobi","Kehinde",""],["Chiteculo","Vasco",""],["Olwoch","Jane",""],["Getenga","Zachary",""],["Linßen","Jochen",""],["Stolten","Detlef",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 12:01:38 GMT"}],"updateDate":"2024-09-17","timestamp":1720612898000,"abstract":"  For fast-tracking climate change response, green hydrogen is key for\nachieving greenhouse gas neutral energy systems. Especially Sub-Saharan Africa\ncan benefit from it enabling an increased access to clean energy through\nutilizing its beneficial conditions for renewable energies. However, developing\ngreen hydrogen strategies for Sub-Saharan Africa requires highly detailed and\nconsistent information ranging from technical, environmental, economic, and\nsocial dimensions, which is currently lacking in literature. Therefore, this\npaper provides a comprehensive novel approach embedding the required range of\ndisciplines to analyze green hydrogen cost-potentials in Sub-Saharan Africa.\nThis approach stretches from a dedicated land eligibility based on local\npreferences, a location specific renewable energy simulation, locally derived\nsustainable groundwater limitations under climate change, an optimization of\nlocal hydrogen energy systems, and a socio-economic indicator-based impact\nanalysis. The capability of the approach is shown for case study regions in\nSub-Saharan Africa highlighting the need for a unified, interdisciplinary\napproach.\n","subjects":["Economics/General Economics","Quantitative Finance/Economics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"9Iy3PzrdfUdXu8gksdD1fgdgPX4vxPkJIG5rGpq1bgM","pdfSize":"1867775","objectId":"0xe9583a1779bfba58539ae16c67836b9167d4b22636277605f94df8d9cd4ae6eb","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
