{"id":"2407.20462","title":"Graphite: A Graph-based Extreme Multi-Label Short Text Classifier for\n  Keyphrase Recommendation","authors":"Ashirbad Mishra, Soumik Dey, Jinyu Zhao, Marshall Wu, Binbin Li and\n  Kamesh Madduri","authorsParsed":[["Mishra","Ashirbad",""],["Dey","Soumik",""],["Zhao","Jinyu",""],["Wu","Marshall",""],["Li","Binbin",""],["Madduri","Kamesh",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 23:41:26 GMT"}],"updateDate":"2024-07-31","timestamp":1722296486000,"abstract":"  Keyphrase Recommendation has been a pivotal problem in advertising and\ne-commerce where advertisers/sellers are recommended keyphrases (search\nqueries) to bid on to increase their sales. It is a challenging task due to the\nplethora of items shown on online platforms and various possible queries that\nusers search while showing varying interest in the displayed items. Moreover,\nquery/keyphrase recommendations need to be made in real-time and in a\nresource-constrained environment. This problem can be framed as an Extreme\nMulti-label (XML) Short text classification by tagging the input text with\nkeywords as labels. Traditional neural network models are either infeasible or\nhave slower inference latency due to large label spaces. We present Graphite, a\ngraph-based classifier model that provides real-time keyphrase recommendations\nthat are on par with standard text classification models. Furthermore, it\ndoesn't utilize GPU resources, which can be limited in production environments.\nDue to its lightweight nature and smaller footprint, it can train on very large\ndatasets, where state-of-the-art XML models fail due to extreme resource\nrequirements. Graphite is deterministic, transparent, and intrinsically more\ninterpretable than neural network-based models. We present a comprehensive\nanalysis of our model's performance across forty categories spanning eBay's\nEnglish-speaking sites.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"QBpdaRVuMvkfXaLLpiQpqbWZCz-xdqOzNylEzmXjUu8","pdfSize":"779252"}