{"id":"2407.01396","title":"Manipulating crack formation in air-dried clay suspensions with tunable\n  elasticity","authors":"Vaibhav Raj Singh Parmar and Ranjini Bandyopadhyay","authorsParsed":[["Parmar","Vaibhav Raj Singh",""],["Bandyopadhyay","Ranjini",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 15:48:04 GMT"},{"version":"v2","created":"Fri, 13 Sep 2024 10:33:26 GMT"}],"updateDate":"2024-09-16","timestamp":1719848884000,"abstract":"  Clay, the major ingredient of natural soils, is often used as a rheological\nmodifier while formulating paints and coatings. When subjected to desiccation,\ncolloidal clay suspensions and clayey soils crack due to the accumulation of\ndrying-induced stresses. Even when desiccation is suppressed, aqueous clay\nsuspensions exhibit physical aging, with their elastic and viscous moduli\nincreasing over time as their microscopic structures evolve due to\ntime-dependent inter-particle screened electrostatic interactions. The rate at\nwhich aging progresses is estimated from the rate of evolution of the\nmechanical moduli and can be controlled by changing clay concentration or by\nincorporating additives. Since physical aging and evaporation should both\ncontribute to the consolidation of drying clay suspensions, we attempt to\nmanipulate the desiccation process \\textit{via} alterations of clay and\nadditive concentrations. For a desiccating sample with an accelerated rate of\naging, we observe faster consolidation into a semi-solid state and earlier\nonset of cracks. We estimate the crack onset time, $t_c$, in direct\nvisualization experiments and the elasticity of the drying sample layer, $E$,\nusing microindentation in an atomic force microscope. We demonstrate that $t_c\n\\propto \\sqrt{\\frac{G_c}{E}}$, where $G_c$, the fracture energy, is estimated\nby fitting our experimental data to a linear poroelastic model that\nincorporates the Griffith's criterion for crack formation. Our work\ndemonstrates that early crack onset is associated with lower sample ductility.\nThe correlation between crack onset in a sample and its mechanical properties\nas uncovered here is potentially useful in preparing crack-resistant coatings\nand diverse clay structures.\n","subjects":["Condensed Matter/Soft Condensed Matter","Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"S6UT6CzktT0WrPJxAngzeQVBOGejA8fQF6TtIWDn-8Q","pdfSize":"6370906"}