{"id":"2407.12863","title":"Token-Supervised Value Models for Enhancing Mathematical Reasoning\n  Capabilities of Large Language Models","authors":"Jung Hyun Lee, June Yong Yang, Byeongho Heo, Dongyoon Han, Kang Min\n  Yoo","authorsParsed":[["Lee","Jung Hyun",""],["Yang","June Yong",""],["Heo","Byeongho",""],["Han","Dongyoon",""],["Yoo","Kang Min",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 13:16:50 GMT"}],"updateDate":"2024-07-19","timestamp":1720790210000,"abstract":"  Large Language Models (LLMs) have demonstrated impressive problem-solving\ncapabilities in mathematics through step-by-step reasoning chains. However,\nthey are susceptible to reasoning errors that impact the quality of subsequent\nreasoning chains and the final answer due to language models' autoregressive\ntoken-by-token generating nature. Recent works have proposed adopting external\nverifiers to guide the generation of reasoning paths, but existing works\nutilize models that have been trained with step-by-step labels to assess the\ncorrectness of token-by-token reasoning chains. Consequently, they struggle to\nrecognize discriminative details of tokens within a reasoning path and lack the\nability to evaluate whether an intermediate reasoning path is on a promising\ntrack toward the correct final answer. To amend the lack of sound and\ntoken-grained math-verification signals, we devise a novel training scheme for\nverifiers that apply token-level supervision with the expected cumulative\nreward (i.e., value). Furthermore, we propose a practical formulation of the\ncumulative reward by reducing it to finding the probability of future\ncorrectness of the final answer and thereby enabling the empirical estimation\nof the value. Experimental results on mathematical reasoning benchmarks show\nthat Token-Supervised Value Model (TVM) can outperform step-by-step verifiers\non GSM8K and MATH with Mistral and Llama.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"FG-xRXN-ih4qgMhkQyFe9pZ9b3pxd0O67heAJ01_73w","pdfSize":"878568"}