{"id":"2407.18232","title":"LION: Linear Group RNN for 3D Object Detection in Point Clouds","authors":"Zhe Liu, Jinghua Hou, Xinyu Wang, Xiaoqing Ye, Jingdong Wang,\n  Hengshuang Zhao, Xiang Bai","authorsParsed":[["Liu","Zhe",""],["Hou","Jinghua",""],["Wang","Xinyu",""],["Ye","Xiaoqing",""],["Wang","Jingdong",""],["Zhao","Hengshuang",""],["Bai","Xiang",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 17:50:32 GMT"}],"updateDate":"2024-07-26","timestamp":1721929832000,"abstract":"  The benefit of transformers in large-scale 3D point cloud perception tasks,\nsuch as 3D object detection, is limited by their quadratic computation cost\nwhen modeling long-range relationships. In contrast, linear RNNs have low\ncomputational complexity and are suitable for long-range modeling. Toward this\ngoal, we propose a simple and effective window-based framework built on LInear\ngrOup RNN (i.e., perform linear RNN for grouped features) for accurate 3D\nobject detection, called LION. The key property is to allow sufficient feature\ninteraction in a much larger group than transformer-based methods. However,\neffectively applying linear group RNN to 3D object detection in highly sparse\npoint clouds is not trivial due to its limitation in handling spatial modeling.\nTo tackle this problem, we simply introduce a 3D spatial feature descriptor and\nintegrate it into the linear group RNN operators to enhance their spatial\nfeatures rather than blindly increasing the number of scanning orders for voxel\nfeatures. To further address the challenge in highly sparse point clouds, we\npropose a 3D voxel generation strategy to densify foreground features thanks to\nlinear group RNN as a natural property of auto-regressive models. Extensive\nexperiments verify the effectiveness of the proposed components and the\ngeneralization of our LION on different linear group RNN operators including\nMamba, RWKV, and RetNet. Furthermore, it is worth mentioning that our\nLION-Mamba achieves state-of-the-art on Waymo, nuScenes, Argoverse V2, and ONCE\ndataset. Last but not least, our method supports kinds of advanced linear RNN\noperators (e.g., RetNet, RWKV, Mamba, xLSTM and TTT) on small but popular KITTI\ndataset for a quick experience with our linear RNN-based framework.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"G1KXn6NqtCoKXPAwnBf_qazC-shNf7PdbtlIfsm-MRY","pdfSize":"1385854","objectId":"0xe26aad15489687a35ae328abfc208171e7f8a716df21716645681c2d677141a0","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
