{"id":"2407.05280","title":"Perpetual Exploration of a Ring in Presence of Byzantine Black Hole","authors":"Pritam Goswami, Adri Bhattacharya, Raja Das and Partha Sarathi Mandal","authorsParsed":[["Goswami","Pritam",""],["Bhattacharya","Adri",""],["Das","Raja",""],["Mandal","Partha Sarathi",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 06:41:17 GMT"}],"updateDate":"2024-07-09","timestamp":1720334477000,"abstract":"  Perpetual exploration is a fundamental problem in the domain of mobile\nagents, where an agent needs to visit each node infinitely often. This issue\nhas received lot of attention, mainly for ring topologies, presence of black\nholes adds more complexity. A black hole can destroy any incoming agent without\nany observable trace. In\n\\cite{BampasImprovedPeriodicDataRetrieval,KralovivcPeriodicDataRetrievalFirst},\nthe authors considered this problem in the context of \\textit{ Periodic data\nretrieval}. They introduced a variant of black hole called gray hole (where the\nadversary chooses whether to destroy an agent or let it pass) among others and\nshowed that 4 asynchronous and co-located agents are essential to solve this\nproblem (hence perpetual exploration) in presence of such a gray hole if each\nnode of the ring has a whiteboard. This paper investigates the exploration of a\nring in presence of a ``byzantine black hole''. In addition to the capabilities\nof a gray hole, in this variant, the adversary chooses whether to erase any\npreviously stored information on that node. Previously, one particular initial\nscenario (i.e., agents are co-located) and one particular communication model\n(i.e., whiteboard) are investigated. Now, there can be other initial scenarios\nwhere all agents may not be co-located. Also, there are many weaker models of\ncommunications (i.e., Face-to-Face, Pebble) where this problem is yet to be\ninvestigated. The agents are synchronous. The main results focus on minimizing\nthe agent number while ensuring that perpetual exploration is achieved even in\npresence of such a node under various communication models and starting\npositions. Further, we achieved a better upper and lower bound result (i.e., 3\nagents) for this problem (where the malicious node is a generalized version of\na gray hole), by trading-off scheduler capability, for co-located and in\npresence of a whiteboard.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"99YY8_NiyaFyYBf8VEi2wPrUeXzkRoHenP3wRSNYQHw","pdfSize":"1072296"}