{"id":"2407.11146","title":"Data Analysis on Credit Card Debt: Rate of Consumption and Impact on\n  Individuals and the US Economy","authors":"Mayowa Akinwande, Alexander Lopez, Tobi Yusuf, Austine Unuriode,\n  Babatunde Yusuf, Toyyibat Yussuph, Stanley Okoro","authorsParsed":[["Akinwande","Mayowa",""],["Lopez","Alexander",""],["Yusuf","Tobi",""],["Unuriode","Austine",""],["Yusuf","Babatunde",""],["Yussuph","Toyyibat",""],["Okoro","Stanley",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 18:09:26 GMT"}],"updateDate":"2024-07-17","timestamp":1721066966000,"abstract":"  This paper provides a comprehensive examination of the evolution of credit\ncards in the United States, tracing their historical development, causes,\nconsequences, and impact on both individuals and the economy. It delves into\nthe transformation of credit cards from specialized merchant cards to\nubiquitous financial tools, driven by legal changes like the Marquette\ndecision. Credit card debt has emerged as a significant financial challenge for\nmany Americans due to economic factors, consumerism, high healthcare costs, and\nfinancial illiteracy. The consequences of this debt on individuals are\nextensive, affecting their financial well-being, credit scores, savings, and\neven their physical and mental health. On a larger scale, credit cards\nstimulate consumer spending, drive e-commerce growth, and generate revenue for\nfinancial institutions, but they can also contribute to economic instability if\nnot managed responsibly. The paper emphasizes various strategies to prevent and\nmanage credit card debt, including financial education, budgeting, responsible\ncredit card uses, and professional counselling. Empirical studies support the\nrelationship between credit card debt and factors such as financial literacy\nand consumer behavior. Regression analysis reveals that personal consumption\nand GDP positively impacts credit card debt indicating that responsible\nmanagement is essential. The paper offers comprehensive recommendations for\naddressing credit card debt challenges and maximizing the benefits of credit\ncard usage, encompassing financial education, policy reforms, and public\nawareness campaigns. These recommendations aim to transform credit cards into\ntools that empower individuals financially and contribute to economic\nstability, rather than sources of financial stress.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"n1M8ZJoZgW1sRr1dJgdnQLXPvUxWnoc2cvsp-92jkbA","pdfSize":"364573"}