{"id":"2407.15979","title":"Modeling Multiple Radius Valley Emergence Mechanisms With\n  Multi-Transiting Systems","authors":"Madison VanWyngarden, Ryan Cloutier","authorsParsed":[["VanWyngarden","Madison",""],["Cloutier","Ryan",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 18:44:23 GMT"}],"updateDate":"2024-07-24","timestamp":1721673863000,"abstract":"  Close-in planets smaller than Neptune form two distinct populations composed\nof rocky super-Earths and sub-Neptunes that may host primordial H/He envelopes.\nThe origin of the radius valley separating these two planet populations remains\nan open question and has been posited to emerge either directly from the planet\nformation process or via subsequent atmospheric escape. Multi-transiting\nsystems that span the radius valley are known to be useful diagnostics of\nXUV-driven mass loss. Here, we extend this framework to test XUV-driven\nphotoevaporation, core-powered mass loss, and an accretion-limited primordial\nradius valley model. Focusing on multi-transiting systems allows us to\neliminate unobservable quantities that are shared within individual systems\nsuch as stellar XUV luminosity histories and the properties of the\nprotoplanetary disk. We test each proposed radius valley emergence mechanism on\nall 221 known multi-transiting systems and calculate the minimum masses of the\nsystems' enveloped planets to be consistent with the models. We compare our\nmodel predictions to 75 systems with measured masses and find that the majority\nof systems can be explained by any of the three proposed mechanisms. We also\nexamine model consistency as a function of stellar mass and stellar metallicity\nbut find no significant trends. More multi-transiting systems with mass\ncharacterizations are required before multi-transiting systems can serve as a\nviable diagnostic of radius valley emergence models. Our software for the model\nevaluations presented herein is available on GitHub and may be applied to\nfuture multi-transiting system discoveries.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"D9mwv83LvkTf4VPBRsQNQE8l7hP1yHdRrB7MAb08cRQ","pdfSize":"3725883","objectId":"0x4c02bf226fd347c70f7f7c34b446aa1d7c33014f7900e7860a66434148d9aa5f","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
