{"id":"2407.09618","title":"The Heterophilic Graph Learning Handbook: Benchmarks, Models,\n  Theoretical Analysis, Applications and Challenges","authors":"Sitao Luan, Chenqing Hua, Qincheng Lu, Liheng Ma, Lirong Wu, Xinyu\n  Wang, Minkai Xu, Xiao-Wen Chang, Doina Precup, Rex Ying, Stan Z. Li, Jian\n  Tang, Guy Wolf, Stefanie Jegelka","authorsParsed":[["Luan","Sitao",""],["Hua","Chenqing",""],["Lu","Qincheng",""],["Ma","Liheng",""],["Wu","Lirong",""],["Wang","Xinyu",""],["Xu","Minkai",""],["Chang","Xiao-Wen",""],["Precup","Doina",""],["Ying","Rex",""],["Li","Stan Z.",""],["Tang","Jian",""],["Wolf","Guy",""],["Jegelka","Stefanie",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 18:04:32 GMT"}],"updateDate":"2024-07-16","timestamp":1720807472000,"abstract":"  Homophily principle, \\ie{} nodes with the same labels or similar attributes\nare more likely to be connected, has been commonly believed to be the main\nreason for the superiority of Graph Neural Networks (GNNs) over traditional\nNeural Networks (NNs) on graph-structured data, especially on node-level tasks.\nHowever, recent work has identified a non-trivial set of datasets where GNN's\nperformance compared to the NN's is not satisfactory. Heterophily, i.e. low\nhomophily, has been considered the main cause of this empirical observation.\nPeople have begun to revisit and re-evaluate most existing graph models,\nincluding graph transformer and its variants, in the heterophily scenario\nacross various kinds of graphs, e.g. heterogeneous graphs, temporal graphs and\nhypergraphs. Moreover, numerous graph-related applications are found to be\nclosely related to the heterophily problem. In the past few years, considerable\neffort has been devoted to studying and addressing the heterophily issue.\n  In this survey, we provide a comprehensive review of the latest progress on\nheterophilic graph learning, including an extensive summary of benchmark\ndatasets and evaluation of homophily metrics on synthetic graphs, meticulous\nclassification of the most updated supervised and unsupervised learning\nmethods, thorough digestion of the theoretical analysis on\nhomophily/heterophily, and broad exploration of the heterophily-related\napplications. Notably, through detailed experiments, we are the first to\ncategorize benchmark heterophilic datasets into three sub-categories:\nmalignant, benign and ambiguous heterophily. Malignant and ambiguous datasets\nare identified as the real challenging datasets to test the effectiveness of\nnew models on the heterophily challenge. Finally, we propose several challenges\nand future directions for heterophilic graph representation learning.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"f29gNvmbcuOLXV9KLk-LTUWcUofzNTl8-ZVCMZoe9Fg","pdfSize":"2845140","objectId":"0xf44edf0e320b3f1a466bf9e66c1b2f8ec8a0b4ff28f03801673ec7aff4031e0e","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
