{"id":"2407.04965","title":"Beyond Perplexity: Multi-dimensional Safety Evaluation of LLM\n  Compression","authors":"Zhichao Xu, Ashim Gupta, Tao Li, Oliver Bentham, Vivek Srikumar","authorsParsed":[["Xu","Zhichao",""],["Gupta","Ashim",""],["Li","Tao",""],["Bentham","Oliver",""],["Srikumar","Vivek",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 05:56:22 GMT"},{"version":"v2","created":"Wed, 10 Jul 2024 21:31:11 GMT"}],"updateDate":"2024-07-12","timestamp":1720245382000,"abstract":"  Large language models (LLMs) are increasingly deployed in real-world\nscenarios with the help of recent model compression techniques. Such momentum\ntowards local deployment means the use of compressed LLMs will widely impact a\nlarge population. However, prior analysis works often prioritize on preserving\nperplexity which is a direct analogy to training loss. The impact of\ncompression method on other critical aspects of model behavior, particularly\nsafety, still calls for a systematic assessment. To this end, we investigate\nthe impact of model compression on four dimensions: (1) degeneration harm,\ni.e., bias and toxicity in generation; (2) representational harm, i.e., biases\nin discriminative tasks; (3) dialect bias; (4) language modeling and downstream\ntask performance. We cover a wide spectrum of LLM compression techniques,\nincluding unstructured pruning, semi-structured pruning and quantization. Our\nanalysis reveals that compression can lead to unexpected consequences. Although\ncompression may unintentionally remedy LLMs' degeneration harm, it can still\nexacerbate on the representational harm axis. Although compression may\nunintentionally remedy LLMs' degeneration harm, it can still exacerbate on the\nrepresentational harm axis. Moreover, there is a divergent impact on different\nprotected groups as the compression rate grows. Finally, different compression\nmethods have drastically different safety impacts, e.g., quantization mostly\npreserves bias while pruning degrades quickly. Our findings underscore the\nimportance of integrating safety assessments into the development of compressed\nLLMs to ensure their reliability across real-world applications. Our full\nresults are available here:\n\\url{https://github.com/zhichaoxu-shufe/Beyond-Perplexity-Compression-Safety-Eval}\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"U84bfyId7Ru_vPh304EEGPtGOjMfmIaGEFqQsJOGCrk","pdfSize":"3388950"}