{"id":"2407.16566","title":"Alleviating Non-identifiability: a High-fidelity Calibration Objective\n  for Financial Market Simulation with Multivariate Time Series Data","authors":"Chenkai Wang, Junji Ren, Peng Yang","authorsParsed":[["Wang","Chenkai",""],["Ren","Junji",""],["Yang","Peng",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 15:18:59 GMT"},{"version":"v2","created":"Wed, 24 Jul 2024 08:05:34 GMT"},{"version":"v3","created":"Thu, 29 Aug 2024 08:33:54 GMT"}],"updateDate":"2024-08-30","timestamp":1721747939000,"abstract":"  The non-identifiability issue has been frequently reported in the social\nsimulation works, where different parameters of an agent-based simulation model\nyield indistinguishable simulated time series data under certain discrepancy\nmetrics. This issue largely undermines the simulation fidelity yet lacks\ndedicated investigations. This paper theoretically analyzes that incorporating\nmultiple time series data features in the model calibration phase can alleviate\nthe non-identifiability exponentially with the increasing number of features.\nTo implement this theoretical finding, a maximization-based aggregation\nfunction is proposed based on existing discrepancy metrics to form a new\ncalibration objective function. For verification, the task of calibrating the\nFinancial Market Simulation (FMS), a typical yet complex social simulation, is\nconsidered. Empirical studies confirm the significant improvements in\nalleviating the non-identifiability of calibration tasks. Furthermore, as a\nmodel-agnostic method, it achieves much higher simulation fidelity of the\nchosen FMS model on both synthetic and real market data. Hence, this work is\nexpected to provide not only a rigorous understanding of non-identifiability in\nsocial simulation, but an off-the-shelf high-fidelity calibration objective\nfunction for FMS.\n","subjects":["Quantitative Finance/Computational Finance"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7SbnaKh2iPd-tUzb5G_8XIaDgeInYjKCNbQe03IXWfo","pdfSize":"1048663"}