{"id":"2407.08365","title":"Photometric and Spectroscopic study of Ten Low Mass Ratio Contact Binary\n  Systems: Orbital Stability, O'Connell Effect and Infra-red Calcium Line\n  Filling","authors":"Surjit S. Wadhwa, Adam Popowicz, Raul Michel, Petar Kostic, Oliver\n  Vince, Nick F. H. Tothill, Ain Y. De Horta and Miroslav D. Filipovic","authorsParsed":[["Wadhwa","Surjit S.",""],["Popowicz","Adam",""],["Michel","Raul",""],["Kostic","Petar",""],["Vince","Oliver",""],["Tothill","Nick F. H.",""],["De Horta","Ain Y.",""],["Filipovic","Miroslav D.",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 10:19:24 GMT"}],"updateDate":"2024-07-12","timestamp":1720693164000,"abstract":"  Low mass ratio contact binary systems are more likely to have unstable orbits\nand potentially merge. In addition, such systems exhibit characteristics such\nas starspots and high energy emissions (UV) suggestive of chromospheric and\nmagnetic activity. Light curve modelling of ten contact binary systems is\nreported. All were found to be of extreme low mass ratio ranging from 0.122 to\n0.24 and three were found to be potentially unstable and possible merger\ncandidates. Filling of the infrared Calcium absorption lines is a marker of\nincreased chromospheric activity. We use the available LAMOST spectra along\nwith matched standard spectra (broadened for rotation) to measure the excess\nfilling of the central core depression flux of the two main infrared Calcium\nabsorption lines at 8542 and 8662 angstroms. We find that all reported contact\nbinaries have excess filling of the core flux in the infrared Calcium lines.\nThree of the systems reported were also observed by the GALEX mission and we\nfind that all three have features of excess ultraviolet emissions further\nadding evidence for increased chromospheric activity in low mass ratio contact\nbinaries. Analysis of both orbital stability and absorption line filling is\ndependent on the determination of geometric and absolute parameters from light\ncurve modelling. Not an insignificant number of contact binary light curves\nexhibit the O'Connell effect, usually attributed to starspots. We discuss the\ninclusion of starspots in light curve solutions and how they influence the\ngeometric and absolute parameters\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"iXKB5ZfrHHMhC14ReiBwPCm3jdI9r1yW6eJfAryTQMw","pdfSize":"3635330"}