{"id":"2407.17825","title":"Blockchain Takeovers in Web 3.0: An Empirical Study on the TRON-Steem\n  Incident","authors":"Chao Li, Runhua Xu, Balaji Palanisamy, Li Duan, Meng Shen, Jiqiang Liu\n  and Wei Wang","authorsParsed":[["Li","Chao",""],["Xu","Runhua",""],["Palanisamy","Balaji",""],["Duan","Li",""],["Shen","Meng",""],["Liu","Jiqiang",""],["Wang","Wei",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 07:31:15 GMT"}],"updateDate":"2024-07-26","timestamp":1721892675000,"abstract":"  A fundamental goal of Web 3.0 is to establish a decentralized network and\napplication ecosystem, thereby enabling users to retain control over their data\nwhile promoting value exchange. However, the recent Tron-Steem takeover\nincident poses a significant threat to this vision. In this paper, we present a\nthorough empirical analysis of the Tron-Steem takeover incident. By conducting\na fine-grained reconstruction of the stake and election snapshots within the\nSteem blockchain, one of the most prominent social-oriented blockchains, we\nquantify the marked shifts in decentralization pre and post the takeover\nincident, highlighting the severe threat that blockchain network takeovers pose\nto the decentralization principle of Web 3.0. Moreover, by employing heuristic\nmethods to identify anomalous voters and conducting clustering analyses on\nvoter behaviors, we unveil the underlying mechanics of takeover strategies\nemployed in the Tron-Steem incident and suggest potential mitigation\nstrategies, which contribute to the enhanced resistance of Web 3.0 networks\nagainst similar threats in the future. We believe the insights gleaned from\nthis research help illuminate the challenges imposed by blockchain network\ntakeovers in the Web 3.0 era, suggest ways to foster the development of\ndecentralized technologies and governance, as well as to enhance the protection\nof Web 3.0 user rights.\n","subjects":["Computing Research Repository/Social and Information Networks","Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"DS4rt0LkyrwqHBg1t000dj6Z9jtFhTSk1pwr4sCZDeQ","pdfSize":"4449058"}