{"id":"2407.12662","title":"Tuning Magnetism in Ising-type van der Waals Magnet FePS3 by Lithium\n  Intercalation","authors":"Dinesh Upreti, Rabindra Basnet, M. M. Sharma, Santosh Karki Chhetri,\n  Gokul Acharya, Md Rafique Un Nabi, Josh Sakon, Bo Da, Mansour Mortazavi, Jin\n  Hu","authorsParsed":[["Upreti","Dinesh",""],["Basnet","Rabindra",""],["Sharma","M. M.",""],["Chhetri","Santosh Karki",""],["Acharya","Gokul",""],["Nabi","Md Rafique Un",""],["Sakon","Josh",""],["Da","Bo",""],["Mortazavi","Mansour",""],["Hu","Jin",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 15:46:54 GMT"}],"updateDate":"2024-07-18","timestamp":1721231214000,"abstract":"  Recently, layered materials transition metal thiophosphate MPX3 (M =\ntransition metals, X = S or Se) have gained significant attention because of\ntheir rich magnetic, optical, and electronic properties. Specifically, the\ndiverse magnetic structures and the robustness of magnetism in the\ntwo-dimensional limit have made them prominent candidates to study\ntwo-dimensional magnetism. Numerous efforts such as substitutions and\ninterlayer intercalations have been made to tune the properties of these\nmaterials, which has greatly deepened the understanding of the underlying\nmechanisms that govern the properties. In this work, we focus on modifying the\nmagnetism of Ising-type antiferromagnet FePS3 using electrochemical lithium\nintercalation. Our work unveils the effectiveness of electrochemical\nintercalation as a controllable tool to modulating magnetism, including tuning\nmagnetic ordering temperature and inducing low temperature spin-glass state,\noffering an approach for implementing this material into applications.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"4acydBIawKLKSGHSntgCiflAq1ZdeBiozAB_Kqqj-CI","pdfSize":"1014014","objectId":"0x0416f728f5cceba39cd08ada314e9aaf3d58f700282dcb62244675be7090945b","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
