{"id":"2407.17341","title":"Mathematical Programming Algorithms for Convex Hull Approximation with a\n  Hyperplane Budget","authors":"Michele Barbato, Alberto Ceselli, Rosario Messana","authorsParsed":[["Barbato","Michele",""],["Ceselli","Alberto",""],["Messana","Rosario",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 15:08:52 GMT"},{"version":"v2","created":"Fri, 26 Jul 2024 19:34:11 GMT"}],"updateDate":"2024-07-30","timestamp":1721833732000,"abstract":"  We consider the following problem in computational geometry: given, in the\nd-dimensional real space, a set of points marked as positive and a set of\npoints marked as negative, such that the convex hull of the positive set does\nnot intersect the negative set, find K hyperplanes that separate, if possible,\nall the positive points from the negative ones. That is, we search for a convex\npolyhedron with at most K faces, containing all the positive points and no\nnegative point. The problem is known in the literature for pure convex\npolyhedral approximation; our interest stems from its possible applications in\nconstraint learning, where points are feasible or infeasible solutions of a\nMixed Integer Program, and the K hyperplanes are linear constraints to be\nfound. We cast the problem as an optimization one, minimizing the number of\nnegative points inside the convex polyhedron, whenever exact separation cannot\nbe achieved. We introduce models inspired by support vector machines and we\ndesign two mathematical programming formulations with binary variables. We\nexploit Dantzig-Wolfe decomposition to obtain extended formulations, and we\ndevise column generation algorithms with ad-hoc pricing routines. We compare\ncomputing time and separation error values obtained by all our approaches on\nsynthetic datasets, with number of points from hundreds up to a few thousands,\nshowing our approaches to perform better than existing ones from the\nliterature. Furthermore, we observe that key computational differences arise,\ndepending on whether the budget K is sufficient to completely separate the\npositive points from the negative ones or not. On 8-dimensional instances (and\nover), existing convex hull algorithms become computational inapplicable, while\nour algorithms allow to identify good convex hull approximations in minutes of\ncomputation.\n","subjects":["Mathematics/Optimization and Control","Computing Research Repository/Computational Geometry","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"1k6WyDR56EJxM8fprKNxg8fWSOdw4yjYz04W7nKdhiA","pdfSize":"1145281"}