{"id":"2407.05005","title":"Personalized Federated Domain-Incremental Learning based on Adaptive\n  Knowledge Matching","authors":"Yichen Li, Wenchao Xu, Haozhao Wang, Ruixuan Li, Yining Qi, Jingcai\n  Guo","authorsParsed":[["Li","Yichen",""],["Xu","Wenchao",""],["Wang","Haozhao",""],["Li","Ruixuan",""],["Qi","Yining",""],["Guo","Jingcai",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 08:57:22 GMT"},{"version":"v2","created":"Thu, 18 Jul 2024 05:37:49 GMT"}],"updateDate":"2024-07-19","timestamp":1720256242000,"abstract":"  This paper focuses on Federated Domain-Incremental Learning (FDIL) where each\nclient continues to learn incremental tasks where their domain shifts from each\nother. We propose a novel adaptive knowledge matching-based personalized FDIL\napproach (pFedDIL) which allows each client to alternatively utilize\nappropriate incremental task learning strategy on the correlation with the\nknowledge from previous tasks. More specifically, when a new task arrives, each\nclient first calculates its local correlations with previous tasks. Then, the\nclient can choose to adopt a new initial model or a previous model with similar\nknowledge to train the new task and simultaneously migrate knowledge from\nprevious tasks based on these correlations. Furthermore, to identify the\ncorrelations between the new task and previous tasks for each client, we\nseparately employ an auxiliary classifier to each target classification model\nand propose sharing partial parameters between the target classification model\nand the auxiliary classifier to condense model parameters. We conduct extensive\nexperiments on several datasets of which results demonstrate that pFedDIL\noutperforms state-of-the-art methods by up to 14.35\\% in terms of average\naccuracy of all tasks.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"kr6NLxTVdxcLAFI7OH94-SMOEc31zaAX5tAmlLJ13js","pdfSize":"822425"}