{"id":"2407.04654","title":"Metastability of the contact process on slowly evolving scale-free\n  networks","authors":"Emmanuel Jacob, Amitai Linker and Peter M\\\"orters","authorsParsed":[["Jacob","Emmanuel",""],["Linker","Amitai",""],["Mörters","Peter",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 17:10:22 GMT"},{"version":"v2","created":"Tue, 17 Sep 2024 14:57:32 GMT"}],"updateDate":"2024-09-18","timestamp":1720199422000,"abstract":"  We investigate the contact process on scale-free networks evolving by a\nstationary dynamics whereby each vertex independently updates its connections\nwith a rate depending on its power. This rate can be slowed down or speeded up\nby virtue of decreasing or increasing a parameter $\\eta$, with\n$\\eta\\downarrow-\\infty$ approaching the static and $\\eta\\uparrow\\infty$ the\nmean-field case. We identify the regimes of slow, fast and ultra-fast\nextinction of the contact process. Slow extinction occurs in the form of\nmetastability, when the contact process maintains a certain density of infected\nstates for a time exponential in the network size. In our main result we\nidentify the metastability exponents, which describe the decay of metastable\ndensities as the infection rate goes to zero, in dependence on $\\eta$ and the\npower-law exponent $\\tau$. While the fast evolution cases have been treated in\na companion paper, Jacob, Linker, M\\\"orters (2019), the present paper looks at\nthe significantly more difficult cases of slow network evolution. We describe\nvarious effects, like degradation, regeneration and depletion, which lead to a\nrich picture featuring numerous first-order phase transitions for the\nmetastable exponents. To capture these effects in our upper bounds we develop a\nnew martingale based proof technique combining a local and global analysis of\nthe process.\n","subjects":["Mathematics/Probability"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"entx3DNWiaGYyyWpNcfzPOYfaYr1O1QZfo5FsBFmlaI","pdfSize":"1380284"}