{"id":"2407.20283","title":"Spatial Temporal Approach for High-Resolution Gridded Wind Forecasting\n  across Southwest Western Australia","authors":"Fuling Chen, Kevin Vinsen, Arthur Filoche","authorsParsed":[["Chen","Fuling",""],["Vinsen","Kevin",""],["Filoche","Arthur",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 05:44:27 GMT"}],"updateDate":"2024-07-31","timestamp":1721972667000,"abstract":"  Accurate wind speed and direction forecasting is paramount across many\nsectors, spanning agriculture, renewable energy generation, and bushfire\nmanagement. However, conventional forecasting models encounter significant\nchallenges in precisely predicting wind conditions at high spatial resolutions\nfor individual locations or small geographical areas (< 20 km2) and capturing\nmedium to long-range temporal trends and comprehensive spatio-temporal\npatterns. This study focuses on a spatial temporal approach for high-resolution\ngridded wind forecasting at the height of 3 and 10 metres across large areas of\nthe Southwest of Western Australia to overcome these challenges. The model\nutilises the data that covers a broad geographic area and harnesses a diverse\narray of meteorological factors, including terrain characteristics, air\npressure, 10-metre wind forecasts from the European Centre for Medium-Range\nWeather Forecasts, and limited observation data from sparsely distributed\nweather stations (such as 3-metre wind profiles, humidity, and temperature),\nthe model demonstrates promising advancements in wind forecasting accuracy and\nreliability across the entire region of interest. This paper shows the\npotential of our machine learning model for wind forecasts across various\nprediction horizons and spatial coverage. It can help facilitate more informed\ndecision-making and enhance resilience across critical sectors.\n","subjects":["Computing Research Repository/Machine Learning","Physics/Atmospheric and Oceanic Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"I5K5F_yFejwjn7z-O_ycVOsrkfU0NLU8mdy0lWMsDU0","pdfSize":"20115447"}