{"id":"2407.15433","title":"Spatial-Division Augmented Occupancy Field for Bone Shape Reconstruction\n  from Biplanar X-Rays","authors":"Jixiang Chen, Yiqun Lin, Haoran Sun, Xiaomeng Li","authorsParsed":[["Chen","Jixiang",""],["Lin","Yiqun",""],["Sun","Haoran",""],["Li","Xiaomeng",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 07:28:17 GMT"}],"updateDate":"2024-07-23","timestamp":1721633297000,"abstract":"  Retrieving 3D bone anatomy from biplanar X-ray images is crucial since it can\nsignificantly reduce radiation exposure compared to traditional CT-based\nmethods. Although various deep learning models have been proposed to address\nthis complex task, they suffer from two limitations: 1) They employ voxel\nrepresentation for bone shape and exploit 3D convolutional layers to capture\nanatomy prior, which are memory-intensive and limit the reconstruction\nresolution. 2) They overlook the prevalent occlusion effect within X-ray images\nand directly extract features using a simple loss, which struggles to fully\nexploit complex X-ray information. To tackle these concerns, we present\nSpatial-division Augmented Occupancy Field~(SdAOF). SdAOF adopts the continuous\noccupancy field for shape representation, reformulating the reconstruction\nproblem as a per-point occupancy value prediction task. Its implicit and\ncontinuous nature enables memory-efficient training and fine-scale surface\nreconstruction at different resolutions during the inference. Moreover, we\npropose a novel spatial-division augmented distillation strategy to provide\nfeature-level guidance for capturing the occlusion relationship. Extensive\nexperiments on the pelvis reconstruction dataset show that SdAOF outperforms\nstate-of-the-art methods and reconstructs fine-scale bone surfaces.The code is\navailable at https://github.com/xmed-lab/SdAOF\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"7RnRd3JNMxM9trGFwgs8SUmfklHTR4ltkdyIpd-f7aA","pdfSize":"1032870"}