{"id":"2407.08574","title":"Non-maximal entanglement of photons from positron-electron annihilation\n  demonstrated using a novel plastic PET scanner","authors":"P. Moskal, D. Kumar, S. Sharma, E.Y. Beyene, N. Chug, A. Coussat, C.\n  Curceanu, E. Czerwinski, M. Das, K. Dulski, M. Gorgol, B. Jasinska, K.\n  Kacprzak, T. Kaplanoglu, L. Kaplon, K. Klimaszewski, T. Kozik, E. Lisowski,\n  F. Lisowski, W. Mryka, S. Niedzwiecki, S. Parzych, E.P. del Rio, L.\n  Raczynski, M. Radler, R.Y. Shopa, M. Skurzok, E. L. Stepien, P. Tanty, K.\n  Tayefi Ardebili, K. Valsan Eliyan, and W. Wislicki","authorsParsed":[["Moskal","P.",""],["Kumar","D.",""],["Sharma","S.",""],["Beyene","E. Y.",""],["Chug","N.",""],["Coussat","A.",""],["Curceanu","C.",""],["Czerwinski","E.",""],["Das","M.",""],["Dulski","K.",""],["Gorgol","M.",""],["Jasinska","B.",""],["Kacprzak","K.",""],["Kaplanoglu","T.",""],["Kaplon","L.",""],["Klimaszewski","K.",""],["Kozik","T.",""],["Lisowski","E.",""],["Lisowski","F.",""],["Mryka","W.",""],["Niedzwiecki","S.",""],["Parzych","S.",""],["del Rio","E. P.",""],["Raczynski","L.",""],["Radler","M.",""],["Shopa","R. Y.",""],["Skurzok","M.",""],["Stepien","E. L.",""],["Tanty","P.",""],["Ardebili","K. Tayefi",""],["Eliyan","K. Valsan",""],["Wislicki","W.",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 15:01:31 GMT"},{"version":"v2","created":"Wed, 18 Sep 2024 14:11:16 GMT"}],"updateDate":"2024-09-19","timestamp":1720710091000,"abstract":"  In the state-of-the-art Positron Emission Tomography (PET), information about\nthe polarization of annihilation photons is not available. Current PET systems\ntrack molecules labeled with positron-emitting radioisotopes by detecting the\npropagation direction of two photons from positron-electron annihilation.\nHowever, annihilation photons carry more information than just the site where\nthey originated. Here we present a novel J-PET scanner built from plastic\nscintillators, in which annihilation photons interact predominantly via the\nCompton effect, providing information about photon polarization in addition to\ninformation on photon direction of propagation. Theoretically, photons from the\ndecay of positronium in a vacuum are maximally entangled in polarization.\nHowever, in matter, when the positron from positronium annihilates with the\nelectron bound to the atom, the question arises whether the photons from such\nannihilation are maximally entangled. In this work, we determine the\ndistribution of the relative angle between polarization orientations of two\nphotons from positron-electron annihilation in a porous polymer. Contrary to\nprior results for positron annihilation in aluminum and copper, where the\nstrength of observed correlations is as expected for maximally entangled\nphotons, our results show a significant deviation. We demonstrate that in\nporous polymer, photon polarization correlation is weaker than for maximally\nentangled photons but stronger than for separable photons. The data indicate\nthat more than 40% of annihilations in Amberlite resin lead to a non-maximally\nentangled state. Our result indicates the degree of correlation depends on the\nannihilation mechanism and the molecular arrangement. We anticipate that the\nintroduced Compton interaction-based PET system opens a promising perspective\nfor exploring polarization correlations in PET as a novel diagnostic indicator.\n","subjects":["Physics/Nuclear Experiment","Physics/Medical Physics","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"UVsLqA90vPDgGI69C7m7Yql3im54MYk3PtV8KGu24mo","pdfSize":"4070022"}