{"id":"2407.06392","title":"Effects of Small-Scale User Mobility on Highly Directional XR\n  Communications","authors":"Asad Ali, Olga Galinina, Jiri Hosek, and Sergey Andreev","authorsParsed":[["Ali","Asad",""],["Galinina","Olga",""],["Hosek","Jiri",""],["Andreev","Sergey",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 21:05:11 GMT"}],"updateDate":"2024-07-10","timestamp":1720472711000,"abstract":"  The development of next-generation communication systems promises to enable\nextended reality (XR) applications, such as XR gaming with ultra-realistic\ncontent and human-grade sensory feedback. These demanding applications impose\nstringent performance requirements on the underlying wireless communication\ninfrastructure. To meet the expected Quality of Experience (QoE) for XR\napplications, high-capacity connections are necessary, which can be achieved by\nusing millimeter-wave (mmWave) frequency bands and employing highly directional\nbeams. However, these narrow beams are susceptible to even minor misalignments\ncaused by small-scale user mobility, such as changes in the orientation of the\nXR head-mounted device (HMD) or minor shifts in user body position. This\narticle explores the impact of small-scale user mobility on mmWave connectivity\nfor XR and reviews approaches to resolve the challenges arising due to\nsmall-scale mobility. To deepen our understanding of small-scale mobility\nduring XR usage, we prepared a dataset of user mobility during XR gaming. We\nuse this dataset to study the effects of user mobility on highly directional\ncommunication, identifying specific aspects of user mobility that significantly\naffect the performance of narrow-beam wireless communication systems. Our\nresults confirm the substantial influence of small-scale mobility on beam\nmisalignment, highlighting the need for enhanced mechanisms to effectively\nmanage the consequences of small-scale mobility.\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"mZBOk2rilu7FEiCwphJNPoVzDyUb2_N-10NHCTkZSdc","pdfSize":"557279"}