{"id":"2407.09995","title":"MOAT: Securely Mitigating Rowhammer with Per-Row Activation Counters","authors":"Moinuddin Qureshi, Salman Qazi","authorsParsed":[["Qureshi","Moinuddin",""],["Qazi","Salman",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 20:28:02 GMT"}],"updateDate":"2024-07-16","timestamp":1720902482000,"abstract":"  The security vulnerabilities due to Rowhammer have worsened over the last\ndecade, with existing in-DRAM solutions, such as TRR, getting broken with\nsimple patterns. In response, the DDR5 specifications have been extended to\nsupport Per-Row Activation Counting (PRAC), with counters inlined with each\nrow, and ALERT-Back-Off (ABO) to stop the memory controller if the DRAM needs\nmore time to mitigate. Although PRAC+ABO represents a strong advance in\nRowhammer protection, they are just a framework, and the actual security is\ndependent on the implementation.\n  In this paper, we first show that a prior work, Panopticon (which formed the\nbasis for PRAC+ABO), is insecure, as our Jailbreak pattern can cause 1150\nactivations on an attack row for Panopticon configured for a threshold of 128.\nWe then propose MOAT, a provably secure design, which uses two internal\nthresholds: ETH, an \"Eligibility Threshold\" for mitigating a row, and ATH, an\n\"ALERT Threshold\" for initiating an ABO. As JEDEC specifications permit a few\nactivations between consecutive ALERTs, we also study how an attacker can\nexploit such activations to inflict more activations than ATH on an attack row\nand thus increase the tolerated Rowhammer threshold. Our analysis shows that\nMOAT configured with ATH=64 can safely tolerate a Rowhammer threshold of 99.\nFinally, we also study performance attacks and denial-of-service due to ALERTs.\nOur evaluations, with SPEC and GAP workloads, show that MOAT with ATH=64 incurs\nan average slowdown of 0.28\\% and 7 bytes of SRAM per bank.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Hardware Architecture"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"OcTFetM7EkvuwqJSlCFys3Wbbdf7kGCb8vIBqpJxumc","pdfSize":"1099489"}