{"id":"2407.04610","title":"Gamification of Motor Imagery Brain-Computer Interface Training\n  Protocols: a systematic review","authors":"Fred Atilla, Marie Postma, Maryam Alimardani","authorsParsed":[["Atilla","Fred",""],["Postma","Marie",""],["Alimardani","Maryam",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 16:03:58 GMT"}],"updateDate":"2024-07-08","timestamp":1720195438000,"abstract":"  Current Motor Imagery Brain-Computer Interfaces (MI-BCI) require a lengthy\nand monotonous training procedure to train both the system and the user.\nConsidering many users struggle with effective control of MI-BCI systems, a\nmore user-centered approach to training might help motivate users and\nfacilitate learning, alleviating inefficiency of the BCI system. With the\nincrease of BCI-controlled games, researchers have suggested using game\nprinciples for BCI training, as games are naturally centered on the player.\nThis review identifies and evaluates the application of game design elements to\nMI-BCI training, a process known as gamification. Through a systematic\nliterature search, we examined how MI-BCI training protocols have been gamified\nand how specific game elements impacted the training outcomes. We identified 86\nstudies that employed gamified MI-BCI protocols in the past decade. The\nprevalence and reported effects of individual game elements on user experience\nand performance were extracted and synthesized. Results reveal that MI-BCI\ntraining protocols are most often gamified by having users move an avatar in a\nvirtual environment that provides visual feedback. Furthermore, in these\nvirtual environments, users were provided with goals that guided their actions.\nUsing gamification, the reviewed protocols allowed users to reach effective\nMI-BCI control, with studies reporting positive effects of four individual\nelements on user performance and experience, namely: feedback, avatars,\nassistance, and social interaction. Based on these elements, this review makes\ncurrent and future recommendations for effective gamification, such as the use\nof virtual reality and adaptation of game difficulty to user skill level.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"q6TdC715RcvpBmBwZ9EauCc3HL5XggbAJLD340d-OBo","pdfSize":"1663956"}