{"id":"2407.20989","title":"Contrasting Deep Learning Models for Direct Respiratory Insufficiency\n  Detection Versus Blood Oxygen Saturation Estimation","authors":"Marcelo Matheus Gauy, Natalia Hitomi Koza, Ricardo Mikio Morita,\n  Gabriel Rocha Stanzione, Arnaldo Candido Junior, Larissa Cristina Berti, Anna\n  Sara Shafferman Levin, Ester Cerdeira Sabino, Flaviane Romani Fernandes\n  Svartman, Marcelo Finger","authorsParsed":[["Gauy","Marcelo Matheus",""],["Koza","Natalia Hitomi",""],["Morita","Ricardo Mikio",""],["Stanzione","Gabriel Rocha",""],["Junior","Arnaldo Candido",""],["Berti","Larissa Cristina",""],["Levin","Anna Sara Shafferman",""],["Sabino","Ester Cerdeira",""],["Svartman","Flaviane Romani Fernandes",""],["Finger","Marcelo",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 17:26:16 GMT"}],"updateDate":"2024-08-06","timestamp":1722360376000,"abstract":"  We contrast high effectiveness of state of the art deep learning\narchitectures designed for general audio classification tasks, refined for\nrespiratory insufficiency (RI) detection and blood oxygen saturation (SpO$_2$)\nestimation and classification through automated audio analysis. Recently,\nmultiple deep learning architectures have been proposed to detect RI in COVID\npatients through audio analysis, achieving accuracy above 95% and F1-score\nabove 0.93. RI is a condition associated with low SpO$_2$ levels, commonly\ndefined as the threshold SpO$_2$ <92%. While SpO$_2$ serves as a crucial\ndeterminant of RI, a medical doctor's diagnosis typically relies on multiple\nfactors. These include respiratory frequency, heart rate, SpO$_2$ levels, among\nothers. Here we study pretrained audio neural networks (CNN6, CNN10 and CNN14)\nand the Masked Autoencoder (Audio-MAE) for RI detection, where these models\nachieve near perfect accuracy, surpassing previous results. Yet, for the\nregression task of estimating SpO$_2$ levels, the models achieve root mean\nsquare error values exceeding the accepted clinical range of 3.5% for finger\noximeters. Additionally, Pearson correlation coefficients fail to surpass 0.3.\nAs deep learning models perform better in classification than regression, we\ntransform SpO$_2$-regression into a SpO$_2$-threshold binary classification\nproblem, with a threshold of 92%. However, this task still yields an F1-score\nbelow 0.65. Thus, audio analysis offers valuable insights into a patient's RI\nstatus, but does not provide accurate information about actual SpO$_2$ levels,\nindicating a separation of domains in which voice and speech biomarkers may and\nmay not be useful in medical diagnostics under current technologies.\n","subjects":["Computing Research Repository/Sound","Computing Research Repository/Machine Learning","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"m_mSagJdwlQhwVYPh7iVHUCAsHFBz055NJPggAWt-fI","pdfSize":"442816"}