{"id":"2407.16755","title":"The stellar distribution in ultra-faint dwarf galaxies suggests\n  deviations from the collision-less cold dark matter paradigm","authors":"Jorge Sanchez Almeida (1 and 2), Ignacio Trujillo (1 and 2), Angel R.\n  Plastino (3) ((1) Instituto de Astrofisica de Canarias, La Laguna, Tenerife,\n  Spain, (2) Departamento de Astrofisica, Universidad de La Laguna, Spain, (3)\n  CeBio y Departamento de Ciencias Basicas, UNNOBA, CONICET, Junin, Argentina)","authorsParsed":[["Almeida","Jorge Sanchez","","1 and 2"],["Trujillo","Ignacio","","1 and 2"],["Plastino","Angel R.",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 18:00:04 GMT"}],"updateDate":"2024-07-25","timestamp":1721757604000,"abstract":"  Unraveling the nature of dark matter (DM) stands as a primary objective in\nmodern physics. Here we present evidence suggesting deviations from the\ncollisionless Cold DM (CDM) paradigm. It arises from the radial distribution of\nstars in six Ultra Faint Dwarf (UFD) galaxies measured with the Hubble Space\nTelescope (HST). After a trivial renormalization in size and central density,\nthe six UFDs show the same stellar distribution, which happens to have a\ncentral plateau or core. Assuming spherical symmetry and isotropic velocities,\nthe Eddington inversion method proves the observed distribution to be\ninconsistent with potentials characteristic of CDM particles. Under such\nassumptions, the observed innermost slope of the stellar profile discards the\nUFDs to reside in a CDM potential at a > 97% confidence level. The extremely\nlow stellar mass of these galaxies, 10**3-10**4 Msun , prevents stellar\nfeedback from modifying the shape of a CDM potential. Other conceivable\nexplanations for the observed cores, like deviations from spherical symmetry\nand isotropy, tidal forces, and the exact form of the used CDM potential, are\ndisfavored by simulations and/or observations. Thus, the evidence suggests that\ncollisions among DM particles or other alternatives to CDM are likely shaping\nthese galaxies. Many of these alternatives produce cored gravitational\npotentials, shown here to be consistent with the observed stellar distribution.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"U3RqG8tn3Anq0t077K_26ubgty4vPW6E0zLaiq5STfA","pdfSize":"1458375"}