{"id":"2407.03438","title":"Lagrangian vs Eulerian view on the mean drift and streaming flows in\n  orbital sloshing","authors":"Alessandro Bongarzone and Fran\\c{c}ois Gallaire","authorsParsed":[["Bongarzone","Alessandro",""],["Gallaire","François",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 18:31:13 GMT"}],"updateDate":"2024-07-08","timestamp":1720031473000,"abstract":"  Orbital sloshing is a technique to gently mix a container's liquid content\nand it is commonly used in fermentation and cell cultivation processes. Besides\nthe rich wave dynamics observed at the interface, Bouvard et al. (2017) [1]\nunveiled the structure of the Lagrangian mean flow hiding in the fluid bulk.\nThe latter flow shows a global toroidal (azimuthal) rotation co-directed with\nthe wave and nontrivial poloidal vortices near the contact line. Rotating\nsloshing waves are known to induce a net motion of fluid particles and hence a\nwave-averaged difference between the Eulerian flow - viscous streaming - and\nthe Lagrangian flow, that is commonly referred to as Stokes drift.\nNevertheless, discerning these two components in an experiment is challenging\nas they scale similarly with the forcing amplitude and frequency. Their\nrelative contributions remain therefore unquantified, particularly for highly\nviscous fluids, for which prior analysis, based on inviscid arguments, fails.\nIn this work, we construct a truncated asymptotic approximation of the problem,\nwhere the solution at each order is computed numerically to describe as\naccurately as possible the contact line region, otherwise analytically\nuntractable. The results of this weakly nonlinear analysis in terms of\nfirst-order wave and second-order mean flow are then thoroughly compared with\nthe experiments by Bouvard et al. (2017) [1], showing a remarkable agreement\nfor off-resonance frequencies. When viscosity matters, our findings suggest\nthat it is incorrect to attribute the poloidal patterns solely to the Eulerian\nstreaming flow and that viscous corrections to the Stokes drift are equally\nimportant in the resulting mean Lagrangian flow.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"PpVtnMBuSkl7WVRyXN9qGzapgwL8z7hD3tM_1Z9q30Q","pdfSize":"14069368"}