{"id":"2407.19465","title":"Comparative studies of plastic scintillator strips with high technical\n  attenuation length for the total-body J-PET scanner","authors":"L. Kaplon, J. Baran, N. Chug, A. Coussat, C. Curceanu, E. Czerwinski,\n  M. Dadgar, K. Dulski, J. Gajewski, A. Gajos, B. Hiesmayr, E. Kavya Valsan, K.\n  Klimaszewski, G. Korcyl, T. Kozik, W. Krzemien, D. Kumar, G. Moskal, S.\n  Niedzwiecki, D. Panek, S. Parzych, E. Perez del Rio, L. Raczynski, A.\n  Rucinski, S. Sharma, S. Shivani, R. Shopa, M. Silarski, M. Skurzok, E.\n  Stepien, F. Tayefi Ardebili, K. Tayefi Ardebili, W. Wislicki, P. Moskal","authorsParsed":[["Kaplon","L.",""],["Baran","J.",""],["Chug","N.",""],["Coussat","A.",""],["Curceanu","C.",""],["Czerwinski","E.",""],["Dadgar","M.",""],["Dulski","K.",""],["Gajewski","J.",""],["Gajos","A.",""],["Hiesmayr","B.",""],["Valsan","E. Kavya",""],["Klimaszewski","K.",""],["Korcyl","G.",""],["Kozik","T.",""],["Krzemien","W.",""],["Kumar","D.",""],["Moskal","G.",""],["Niedzwiecki","S.",""],["Panek","D.",""],["Parzych","S.",""],["del Rio","E. Perez",""],["Raczynski","L.",""],["Rucinski","A.",""],["Sharma","S.",""],["Shivani","S.",""],["Shopa","R.",""],["Silarski","M.",""],["Skurzok","M.",""],["Stepien","E.",""],["Ardebili","F. Tayefi",""],["Ardebili","K. Tayefi",""],["Wislicki","W.",""],["Moskal","P.",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 11:16:49 GMT"},{"version":"v2","created":"Sat, 3 Aug 2024 12:54:30 GMT"}],"updateDate":"2024-08-06","timestamp":1722165409000,"abstract":"  Plastic scintillator strips are considered as one of the promising solutions\nfor the cost-effective construction of total-body positron emission tomography,\n(PET) system. The purpose of the performed measurements is to compare the\ntransparency of long plastic scintillators with dimensions 6 mm x 24 mm x 1000\nmm and with all surfaces polished. Six different types of commercial, general\npurpose, blue-emitting plastic scintillators with low attenuation of visible\nlight were tested, namely: polyvinyl toluene-based BC-408, EJ-200, RP-408, and\npolystyrene-based Epic, SP32 and UPS-923A. For determination of the best type\nof plastic scintillator for totalbody Jagiellonian positron emission tomograph\n(TB-J-PET) construction, emission and transmission spectra, and technical\nattenuation length (TAL) of blue light-emitting by the scintillators were\nmeasured and compared. The TAL values were determined with the use of UV lamp\nas excitation source, and photodiode as light detector. Emission spectra of\ninvestigated scintillators have maxima in the range from 420 nm to 429 nm. The\nBC-408 and EJ-200 have the highest transmittance values of about 90% at the\nmaximum emission wavelength measured through a 6 mm thick scintillator strip\nand the highest technical attenuation length reaching about 2000 mm, allowing\nassembly of long detection modules for time-of-flight (TOF) J-PET scanners.\nInfluence of the 6 mm x 6 mm, 12 mm x 6 mm, 24 mm x 6 mm cross-sections of the\n1000 mm long EJ-200 plastic scintillator on the TAL and signal intensity was\nmeasured. The highest TAL value was determined for samples with 24 mm x 6 mm\ncross-section.\n","subjects":["Physics/Instrumentation and Detectors","Physics/Nuclear Experiment"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"pYMugu-6As2DCuoFPrmIeM0aLC-weUgQJiLgQskzoI0","pdfSize":"1163679"}