{"id":"2407.06761","title":"Spectro-polarimetric view of the gamma-ray emitting NLS1 1H0323+342","authors":"Jincen Jose, Suvendu Rakshit, Swayamtrupta Panda, Jong-Hak Woo, C. S.\n  Stalin, Neha Sharma and Shivangi Pandey","authorsParsed":[["Jose","Jincen",""],["Rakshit","Suvendu",""],["Panda","Swayamtrupta",""],["Woo","Jong-Hak",""],["Stalin","C. S.",""],["Sharma","Neha",""],["Pandey","Shivangi",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 11:15:31 GMT"},{"version":"v2","created":"Thu, 11 Jul 2024 05:38:14 GMT"}],"updateDate":"2024-07-12","timestamp":1720523731000,"abstract":"  The gamma-ray emitting narrow-line Seyfert 1 galaxies are a unique class of\nobjects that launch powerful jets from relatively lower-mass black hole systems\ncompared to the Blazars. However, the black hole masses estimated from the\ntotal flux spectrum suffer from the projection effect, making the mass\nmeasurement highly uncertain. The polarized spectrum provides a unique view of\nthe central engine through scattered light. We performed spectro-polarimetric\nobservations of the gamma-ray emitting narrow-line Seyfert 1 galaxy 1H0323+342\nusing SPOL/MMT. The degree of polarization and polarization angle is 0.122\n$\\pm$ 0.040 % and 142 $\\pm$ 9 degrees, while the H$\\alpha$ line is polarized at\n0.265 $\\pm$ 0.280 %. We decomposed the total flux spectrum and estimated broad\nH$\\alpha$ FWHM of 1015 km/s. The polarized flux spectrum shows a broadening\nsimilar to the total flux spectrum, with a broadening ratio of 1.22. The Monte\nCarlo radiative transfer code `STOKES' applied to the data provides the best\nfit for a small viewing angle of 9-24 degrees and a small optical depth ratio\nbetween the polar and the equatorial scatters. A thick BLR with significant\nscale height can explain a similar broadening of the polarized spectrum\ncompared to the total flux spectrum with a small viewing angle.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"1pcJuyPm3bBpAC2wPehDQfS3yb4GUNfublJzsYwNPtg","pdfSize":"934423"}
