{"id":"2407.15788","title":"Extracting Structured Insights from Financial News: An Augmented LLM\n  Driven Approach","authors":"Rian Dolphin, Joe Dursun, Jonathan Chow, Jarrett Blankenship, Katie\n  Adams, Quinton Pike","authorsParsed":[["Dolphin","Rian",""],["Dursun","Joe",""],["Chow","Jonathan",""],["Blankenship","Jarrett",""],["Adams","Katie",""],["Pike","Quinton",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 16:47:31 GMT"}],"updateDate":"2024-07-23","timestamp":1721666851000,"abstract":"  Financial news plays a crucial role in decision-making processes across the\nfinancial sector, yet the efficient processing of this information into a\nstructured format remains challenging. This paper presents a novel approach to\nfinancial news processing that leverages Large Language Models (LLMs) to\novercome limitations that previously prevented the extraction of structured\ndata from unstructured financial news. We introduce a system that extracts\nrelevant company tickers from raw news article content, performs sentiment\nanalysis at the company level, and generates summaries, all without relying on\npre-structured data feeds. Our methodology combines the generative capabilities\nof LLMs, and recent prompting techniques, with a robust validation framework\nthat uses a tailored string similarity approach. Evaluation on a dataset of\n5530 financial news articles demonstrates the effectiveness of our approach,\nwith 90% of articles not missing any tickers compared with current data\nproviders, and 22% of articles having additional relevant tickers. In addition\nto this paper, the methodology has been implemented at scale with the resulting\nprocessed data made available through a live API endpoint, which is updated in\nreal-time with the latest news. To the best of our knowledge, we are the first\ndata provider to offer granular, per-company sentiment analysis from news\narticles, enhancing the depth of information available to market participants.\nWe also release the evaluation dataset of 5530 processed articles as a static\nfile, which we hope will facilitate further research leveraging financial news.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ojehcu8x7rWsMIteeRTThJsXyThV_OkVjtxYbHhM2i8","pdfSize":"2364386"}