{"id":"2407.03008","title":"Align and Aggregate: Compositional Reasoning with Video Alignment and\n  Answer Aggregation for Video Question-Answering","authors":"Zhaohe Liao, Jiangtong Li, Li Niu, Liqing Zhang","authorsParsed":[["Liao","Zhaohe",""],["Li","Jiangtong",""],["Niu","Li",""],["Zhang","Liqing",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 11:07:21 GMT"}],"updateDate":"2024-07-04","timestamp":1720004841000,"abstract":"  Despite the recent progress made in Video Question-Answering (VideoQA), these\nmethods typically function as black-boxes, making it difficult to understand\ntheir reasoning processes and perform consistent compositional reasoning. To\naddress these challenges, we propose a \\textit{model-agnostic} Video Alignment\nand Answer Aggregation (VA$^{3}$) framework, which is capable of enhancing both\ncompositional consistency and accuracy of existing VidQA methods by integrating\nvideo aligner and answer aggregator modules. The video aligner hierarchically\nselects the relevant video clips based on the question, while the answer\naggregator deduces the answer to the question based on its sub-questions, with\ncompositional consistency ensured by the information flow along question\ndecomposition graph and the contrastive learning strategy. We evaluate our\nframework on three settings of the AGQA-Decomp dataset with three baseline\nmethods, and propose new metrics to measure the compositional consistency of\nVidQA methods more comprehensively. Moreover, we propose a large language model\n(LLM) based automatic question decomposition pipeline to apply our framework to\nany VidQA dataset. We extend MSVD and NExT-QA datasets with it to evaluate our\nVA$^3$ framework on broader scenarios. Extensive experiments show that our\nframework improves both compositional consistency and accuracy of existing\nmethods, leading to more interpretable real-world VidQA models.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"F5rtMMfYK7DxSDRV7BXAizYHlcpxkSOf5U34_Oan4ys","pdfSize":"6215314"}