{"id":"2407.09071","title":"Origin and properties of the flat band in NbOCl2 monolayer","authors":"Mohammad Ali Mohebpour, Sahar Izadi Vishkayi, Valerio Vitale, Nicola\n  Seriani, and Meysam Bagheri Tagani","authorsParsed":[["Mohebpour","Mohammad Ali",""],["Vishkayi","Sahar Izadi",""],["Vitale","Valerio",""],["Seriani","Nicola",""],["Tagani","Meysam Bagheri",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 07:51:05 GMT"}],"updateDate":"2024-07-15","timestamp":1720770665000,"abstract":"  The existence of a flat band near the Fermi level can be a suitable platform\nfor the emergence of interesting phenomena in condensed matter physics.\nRecently, NbOCl2 monolayer has been experimentally synthesized [Nature 613\n(2023) 53], which has a flat and isolated valence band. We show that monolayers\nbased on other elements of group 5 of the periodic table, including the V and\nTa atoms, also have a flat band. Motivated by the recent experiment, we\ninvestigate the origin of the flat band as well as the electronic, optical,\nphotocatalytic, and magnetic properties of the monolayer by combining density\nfunctional theory and many-body quantum perturbation theory. Our results show\nthat the flat and isolated band of this monolayer is caused by the interplay\nbetween the Peierls distortion and the electronic configuration of Nb atoms.\nThe investigation of the bandwidth of the monolayer under the biaxial and\nuniaxial strains reveals that this material can be grown on substrates with a\nlarger lattice constant by maintaining the flat band.\n  Examining the material's response to the linearly polarized light not only\nreveals the presence of weak optical anisotropy, but also shows the existence\nof a bright exciton with a binding energy of about 0.94 eV. Hole doping can\nresult in a flat band-induced phase transition from semiconductor to\nferromagnet. By adjusting the amount of doping, a bipolar magnetic\nsemiconductor or a half-metal can be created. The interaction between the\nnearest Nb atoms is ferromagnetic, while an antiferromagnetic interaction\nappears between the second neighbors, which grows significantly with increasing\ndoping. Our results demonstrate that NbOCl2 monolayer has suitable potential\nfor spintronic applications in addition to electronic and optoelectronic\napplications.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"hB0vREKC6yxxEzl4ZI01aqjp9tc1JDxJP885PCgEHkk","pdfSize":"1731020"}