{"id":"2407.20016","title":"Stability and topological nature of charged Gauss-Bonnet AdS black holes\n  in five dimensions","authors":"Imtak Jeon, Bum-Hoon Lee, Wonwoo Lee, and Madhu Mishra","authorsParsed":[["Jeon","Imtak",""],["Lee","Bum-Hoon",""],["Lee","Wonwoo",""],["Mishra","Madhu",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 13:50:15 GMT"}],"updateDate":"2024-07-30","timestamp":1722261015000,"abstract":"  We examine the thermodynamic characteristics and phase structures of a black\nhole, where the black hole horizon could be a hypersurface with positive, zero,\nor negative constant curvature, within the framework of Einstein-Maxwell\ntheory, incorporating a negative cosmological constant and a Gauss-Bonnet\ncorrection. Our research follows the topological approach to black hole\nthermodynamics where we treat anti-de Sitter (AdS) black holes as topological\ndefects in thermodynamic space. We study the nature of the black hole's\ncritical points and local stability by computing the winding\nnumbers/topological charge associated with the zero point of the vector field,\nderived from the temperature of extremal points and generalized off-shell Gibbs\nfree energy, respectively. Black holes are classified into different\ntopological classes based on their topological number. In this study, we found\nunlike the charged AdS black hole, the charged GB AdS black hole exhibits a\ncritical point. Our findings reveal the occurrence of a liquid/gas-like\nfirst-order phase transition between small-large black hole phases of the\nspherical charged GB AdS black hole. We conclude that the charged GB AdS and\ncharged AdS black holes belong to different topological classes in the grand\ncanonical ensemble. Furthermore, connecting with the previous studies, we\nconclude that the charged AdS and charged GB AdS black holes in canonical and\ncharged GB in the grand canonical ensemble belong to the same topological\nclasses.\n","subjects":["Physics/High Energy Physics - Theory","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"d9efk2dfV6QHd_SH3tBr2AzvfBgXoQJUTtavzRD_0GQ","pdfSize":"2889104","objectId":"0x0d8a6bf21b44137ebfc2b466585d5695f87e4208f10cf7cb0faee0264b449079","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
