{"id":"2407.12291","title":"JointDreamer: Ensuring Geometry Consistency and Text Congruence in\n  Text-to-3D Generation via Joint Score Distillation","authors":"Chenhan Jiang and Yihan Zeng and Tianyang Hu and Songcun Xu and Wei\n  Zhang and Hang Xu and Dit-Yan Yeung","authorsParsed":[["Jiang","Chenhan",""],["Zeng","Yihan",""],["Hu","Tianyang",""],["Xu","Songcun",""],["Zhang","Wei",""],["Xu","Hang",""],["Yeung","Dit-Yan",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 03:23:47 GMT"}],"updateDate":"2024-07-18","timestamp":1721186627000,"abstract":"  Score Distillation Sampling (SDS) by well-trained 2D diffusion models has\nshown great promise in text-to-3D generation. However, this paradigm distills\nview-agnostic 2D image distributions into the rendering distribution of 3D\nrepresentation for each view independently, overlooking the coherence across\nviews and yielding 3D inconsistency in generations. In this work, we propose\n\\textbf{J}oint \\textbf{S}core \\textbf{D}istillation (JSD), a new paradigm that\nensures coherent 3D generations. Specifically, we model the joint image\ndistribution, which introduces an energy function to capture the coherence\namong denoised images from the diffusion model. We then derive the joint score\ndistillation on multiple rendered views of the 3D representation, as opposed to\na single view in SDS. In addition, we instantiate three universal view-aware\nmodels as energy functions, demonstrating compatibility with JSD. Empirically,\nJSD significantly mitigates the 3D inconsistency problem in SDS, while\nmaintaining text congruence. Moreover, we introduce the Geometry Fading scheme\nand Classifier-Free Guidance (CFG) Switching strategy to enhance generative\ndetails. Our framework, JointDreamer, establishes a new benchmark in text-to-3D\ngeneration, achieving outstanding results with an 88.5\\% CLIP R-Precision and\n27.7\\% CLIP Score. These metrics demonstrate exceptional text congruence, as\nwell as remarkable geometric consistency and texture fidelity.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"vCItvTTSxaHCPENs5fmQ69bvsBD1nXiFouZiSd6KrbU","pdfSize":"31663259"}