{"id":"2407.02247","title":"Hypermultiplexed off-chip hologram by on-chip integrated metasurface","authors":"Xianjin Liu, Zhanying Ma, Dasen Zhang, Qiwen Bao, Zhenzhen Liu, and\n  Jun-Jun Xiao","authorsParsed":[["Liu","Xianjin",""],["Ma","Zhanying",""],["Zhang","Dasen",""],["Bao","Qiwen",""],["Liu","Zhenzhen",""],["Xiao","Jun-Jun",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 13:11:55 GMT"}],"updateDate":"2024-07-03","timestamp":1719925915000,"abstract":"  The waveguide-integrated metasurface introduces a novel photonic chip capable\nof converting guided modes into free-space light. This enables functions such\nas off-chip beam focusing, steering, and imaging. The challenge lies in\nachieving hypermultiplexing across diverse parameters, including guided-wave\nmode type, direction, polarization, and notably, multiple wavelengths. Here, we\nintroduce a comprehensive end-to-end inverse design framework, rooted in a\nphysical model, for the multifunctional design of on-chip metasurfaces. This\nframework allows for metasurface optimization through a target-field-driven\niteration process. We demonstrate a hypermultiplexed on-chip metasurface\ncapable of generating red-green-blue holograms at multiple target planes, with\nboth independent and cooperative control over guided-wave direction.\nSignificantly, the proposed method streamlines the design process utilizing\nonly the positions of meta-atoms as the design variable. We demonstrate 9\nindependent holographic channels through a combination of wavelength and\ndistance multiplexing. Moreover, by incorporating the excitation direction into\nthe design, the metasurface produces a total of 36 distinct holograms. The\nrobustness of these results against fabrication discrepancies is validated\nthrough 3D full-wave electromagnetic simulations, aligning well with advanced\nmanufacturing techniques. Our research presents a universal design framework\nfor the development of multifunctional on-chip metasurfaces, opening up new\navenues for a wide range of applications.\n","subjects":["Physics/Optics","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"h9v1Neiq3FNUjQJu8sFx239tNngS6RSAcVHKPYWJYfA","pdfSize":"7783515","objectId":"0xb68bcb2ac1bf492324a2c685ace226b2f65218404b04bb93a97b7c0edd9b88bc","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
