{"id":"2407.03816","title":"Compact ultra-broadband light coupling on chip via nonadiabatic pumping","authors":"Weiwei Liu, Chijun Li, Bing Wang, Tianyan Chai, Lingzhi Zheng,\n  Zhuoxiong Liu, Haoru Zhang, Shuaifei Ren, Xiaohong Li, Cheng Zeng, Jinsong\n  Xia, Peixiang Lu","authorsParsed":[["Liu","Weiwei",""],["Li","Chijun",""],["Wang","Bing",""],["Chai","Tianyan",""],["Zheng","Lingzhi",""],["Liu","Zhuoxiong",""],["Zhang","Haoru",""],["Ren","Shuaifei",""],["Li","Xiaohong",""],["Zeng","Cheng",""],["Xia","Jinsong",""],["Lu","Peixiang",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 10:41:21 GMT"}],"updateDate":"2024-07-08","timestamp":1720089681000,"abstract":"  Enlarging bandwidth capacity of the integrated photonic systems demands\nefficient and broadband light coupling among optical elements, which has been a\nvital issue in integrated photonics. Here, we have developed a compact\nultra-broadband light coupling strategy based on nonadiabatic pumping in\ncoupled optical waveguides, and experimentally demonstrated the designs in\nthin-film lithium niobate on insulator (LNOI) platform. We found that\nnonadiabatic transition would produce a decreased dispersion of the phases\nrelated to eigenstates in the waveguides. As a consequence, we realized\nhigh-efficiency directional transfer between edgestates for various wavelengths\ncovering a 1-dB bandwidth of ~320 nm in experiment (>400 nm in simulation),\nwith a coupling length (~50 {\\mu}m) approximately 1/10 of that required in the\nadiabatic regime. Furthermore, we have constructed complex functional devices\nincluding beamsplitter and multiple-level cascaded networks for broadband light\nrouting and splitting. Our work preserves significant advantages simultaneously\nin extending the operation bandwidth and minimizing the footprint, which\ndemonstrates great potential for large-scale and compact photonic integration\non chip.\n","subjects":["Physics/Optics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"MY6JC-5DCrP3x8LkSyjJO21kErZkpd2BQptSbtNFlZQ","pdfSize":"4145109"}