{"id":"2407.03627","title":"DSLR: Document Refinement with Sentence-Level Re-ranking and\n  Reconstruction to Enhance Retrieval-Augmented Generation","authors":"Taeho Hwang, Soyeong Jeong, Sukmin Cho, SeungYoon Han, Jong C. Park","authorsParsed":[["Hwang","Taeho",""],["Jeong","Soyeong",""],["Cho","Sukmin",""],["Han","SeungYoon",""],["Park","Jong C.",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 04:30:04 GMT"},{"version":"v2","created":"Mon, 8 Jul 2024 03:13:12 GMT"},{"version":"v3","created":"Tue, 13 Aug 2024 12:27:10 GMT"},{"version":"v4","created":"Tue, 20 Aug 2024 10:27:56 GMT"},{"version":"v5","created":"Sun, 8 Sep 2024 15:01:56 GMT"}],"updateDate":"2024-09-10","timestamp":1720067404000,"abstract":"  Recent advancements in Large Language Models (LLMs) have significantly\nimproved their performance across various Natural Language Processing (NLP)\ntasks. However, LLMs still struggle with generating non-factual responses due\nto limitations in their parametric memory. Retrieval-Augmented Generation (RAG)\nsystems address this issue by incorporating external knowledge with a retrieval\nmodule. Despite their successes, however, current RAG systems face challenges\nwith retrieval failures and the limited ability of LLMs to filter out\nirrelevant information. Therefore, in this work, we propose DSLR (Document\nRefinement with Sentence-Level Re-ranking and Reconstruction), an unsupervised\nframework that decomposes retrieved documents into sentences, filters out\nirrelevant sentences, and reconstructs them again into coherent passages. We\nexperimentally validate DSLR on multiple open-domain QA datasets and the\nresults demonstrate that DSLR significantly enhances the RAG performance over\nconventional fixed-size passage. Furthermore, our DSLR enhances performance in\nspecific, yet realistic scenarios without the need for additional training,\nproviding an effective and efficient solution for refining retrieved documents\nin RAG systems.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"2ZxAdYO6z8YmsqnrRpJg1uhE3cmIEXPdPxVajXLHNFQ","pdfSize":"651232"}
