{"id":"2407.01615","title":"Edge-DIRECT: A Deep Reinforcement Learning-based Method for Solving\n  Heterogeneous Electric Vehicle Routing Problem with Time Window Constraints","authors":"Arash Mozhdehi, Mahdi Mohammadizadeh, Xin Wang","authorsParsed":[["Mozhdehi","Arash",""],["Mohammadizadeh","Mahdi",""],["Wang","Xin",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 03:18:12 GMT"}],"updateDate":"2024-07-03","timestamp":1719544692000,"abstract":"  In response to carbon-neutral policies in developed countries, electric\nvehicles route optimization has gained importance for logistics companies. With\nthe increasing focus on customer expectations and the shift towards more\ncustomer-oriented business models, the integration of delivery time-windows has\nbecome essential in logistics operations. Recognizing the critical nature of\nthese developments, this article studies the heterogeneous electric vehicle\nrouting problem with time-window constraints (HEVRPTW). To solve this variant\nof vehicle routing problem (VRP), we propose a DRL-based approach, named\nEdge-enhanced Dual attentIon encoderR and feature-EnhanCed dual aTtention\ndecoder (Edge-DIRECT). Edge-DIRECT features an extra graph representation, the\nnode connectivity of which is based on the overlap of customer time-windows.\nEdge-DIRECT's self-attention encoding mechanism is enhanced by exploiting the\nenergy consumption and travel time between the locations. To effectively\naccount for the heterogeneity of the EVs' fleet, a dual attention decoder has\nbeen introduced. Experimental results based on two real-world datasets reveal\nthat Edge-DIRECT outperforms a state-of-the-art DRL-based method and a\nwell-established heuristic approach in solution quality and execution time.\nFurthermore, it exhibits competitive performance when compared to another\nleading heuristic method.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"dpsmLRr7KMg3mTqtNlZ7fTjJUez2iQmXWgO-6sTFKL4","pdfSize":"668247"}