{"id":"2407.21030","title":"Cluster and Separate: a GNN Approach to Voice and Staff Prediction for\n  Score Engraving","authors":"Francesco Foscarin, Emmanouil Karystinaios, Eita Nakamura and Gerhard\n  Widmer","authorsParsed":[["Foscarin","Francesco",""],["Karystinaios","Emmanouil",""],["Nakamura","Eita",""],["Widmer","Gerhard",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 14:36:13 GMT"}],"updateDate":"2024-08-01","timestamp":1721054173000,"abstract":"  This paper approaches the problem of separating the notes from a quantized\nsymbolic music piece (e.g., a MIDI file) into multiple voices and staves. This\nis a fundamental part of the larger task of music score engraving (or score\ntypesetting), which aims to produce readable musical scores for human\nperformers. We focus on piano music and support homophonic voices, i.e., voices\nthat can contain chords, and cross-staff voices, which are notably difficult\ntasks that have often been overlooked in previous research. We propose an\nend-to-end system based on graph neural networks that clusters notes that\nbelong to the same chord and connects them with edges if they are part of a\nvoice. Our results show clear and consistent improvements over a previous\napproach on two datasets of different styles. To aid the qualitative analysis\nof our results, we support the export in symbolic music formats and provide a\ndirect visualization of our outputs graph over the musical score. All code and\npre-trained models are available at https://github.com/CPJKU/piano_svsep\n","subjects":["Electrical Engineering and Systems Science/Audio and Speech Processing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ktZJU4K-VYb4eSpr5LeI2FHVEJW0FOqEpqV-rpUZhqg","pdfSize":"2530153","objectId":"0x5690519d4e7d98274a9b77a627374acd81b6947c2113c98e47b325171d932e63","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
