{"id":"2407.04286","title":"Limitations and rotation of the two-armed phase spiral in the Milky Way\n  stellar disc","authors":"Simon Alinder, Paul McMillan, Thomas Bensby","authorsParsed":[["Alinder","Simon",""],["McMillan","Paul",""],["Bensby","Thomas",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 06:40:57 GMT"}],"updateDate":"2024-07-08","timestamp":1720161657000,"abstract":"  Context: The Milky Way's history of recent disturbances is vividly\ndemonstrated by a structure in the vertical phase-space distribution known as\nthe Gaia phase spiral. A one-armed phase spiral has been seen widely across the\nMilky Way disc, while a two-armed one has only been observed in the solar\nneighbourhood. Aims: This study aims to determine the properties of the\ntwo-armed phase spiral and to put it in a Galactic context, with the ultimate\ngoal of understanding the structure and history of the Milky Way disc. Methods:\nThe Gaia DR3 data is used to trace and characterise the two-armed phase spiral.\nSpecial focus is put on the phase spiral's spatial distribution, rotational\nbehaviour, and chemical characteristics. To quantify the properties of the\nphase spiral we use a model that fits a spiral pattern to the phase space\ndistribution of the stars. Results: We find that the two-armed phase spiral is\ndetectable only within a narrow range of galactocentric distances and angular\nmomenta in the solar neighbourhood, $R = 8 \\pm 0.5 $ kpc, $L_Z = 1450 \\pm 50$\nkpc km s$^{-1}$. Outside this region, the phase spiral is one-armed. The\ntwo-armed phase spiral rotates with the phase angle, like the one-armed phase\nspiral, and changes axis ratio with phase angle. Additionally, stars within the\nphase-space overdensity caused by the two-armed phase spiral pattern have\nslightly higher mean metallicity than stars in the underdense regions of the\npattern at equivalent galactocentric distances, angular momenta, and vertical\norbit extents. Conclusions: The two-armed phase spiral rotates with phase angle\nand its effect can be seen in metallicity, like the one-armed phase spiral.\nHowever, the limited range over which it can be found, and its variation in\nshape are quite different from the one-armed version, suggesting it is a much\nmore localised phenomenon in the Galactic disc.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ezxpLCuq1ek5i6YstU3C55RQVlaf_Jg1_1v1dBy8ESg","pdfSize":"5634000"}