{"id":"2407.04052","title":"Signatures of dark and baryonic structures on weakly lensed\n  gravitational waves","authors":"Guilherme Brando, Srashti Goyal, Stefano Savastano, Hector\n  Villarrubia-Rojo and Miguel Zumalac\\'arregui","authorsParsed":[["Brando","Guilherme",""],["Goyal","Srashti",""],["Savastano","Stefano",""],["Villarrubia-Rojo","Hector",""],["Zumalacárregui","Miguel",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 16:50:19 GMT"}],"updateDate":"2024-07-08","timestamp":1720111819000,"abstract":"  Gravitational lensing offers a powerful tool for exploring the matter\ndistribution in the Universe. Thanks to their low frequencies and phase\ncoherence, gravitational waves (GWs) allow for the observation of novel\nwave-optics features (WOFs) in lensing, inaccessible to electromagnetic\nsignals. Combined with the existing accurate source models, lensed GWs can be\nused to infer the properties of gravitational lenses. The prospect is\nparticularly compelling for space-borne detectors, where the high\nsignal-to-noise ratio expected from massive black hole binary mergers allows\nWOFs to be distinguished deep into the weak lensing regime, drastically\nincreasing the detection probability. Here, we investigate in detail the\ncapacity of the LISA mission to detect WOFs caused by dark matter halos,\ngalaxies and the supermassive black holes (SMBHs) within them. We estimate the\ntotal optical depth to be $\\lambda_{\\rm tot} \\sim 6 \\times 10 ^{-3}$ for the\nloudest binaries of total mass $M_{\\rm BBH} \\sim 10^6 M_{\\odot}$, with the\ndominant contribution coming from SMBHs. We also find that WOFs in low-mass\nbinaries $M_{\\rm BBH} \\sim 10^4 M_{\\odot}$ are more likely due to the central\ngalaxies. Within our model of gravitational lenses, we predict\n$\\mathcal{O}(0.1)-\\mathcal{O}(1)$ weakly-lensed events to be detectable during\nthe 5 years of LISA mission, depending on the source population models. We show\nthat WOFs signatures are very sensitive to the properties of dark-matter halos\nwith $M_{\\rm vir}\\in (10^6-10^8)M_\\odot$: increasing the compactness parameter\nby $\\sim 3$ in that range raises the detection rate by $\\sim 26$. Additionally,\nwe show that collective effects from the complex inner halo structure can\nfurther enhance detectability. This suggests that lensed GWs in LISA will be an\nexcellent probe of dark-matter theories, baryonic and halo sub-structures.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"9fhM0UANZj-D5JRoLIAwGWUoLJ_wQf_o278fFcq2ilU","pdfSize":"3401953"}