{"id":"2407.08649","title":"Confidence-based Estimators for Predictive Performance in Model\n  Monitoring","authors":"Juhani Kivim\\\"aki, Jakub Bia{\\l}ek, Jukka K. Nurminen and Wojtek\n  Kuberski","authorsParsed":[["Kivimäki","Juhani",""],["Białek","Jakub",""],["Nurminen","Jukka K.",""],["Kuberski","Wojtek",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 16:28:31 GMT"}],"updateDate":"2024-07-12","timestamp":1720715311000,"abstract":"  After a machine learning model has been deployed into production, its\npredictive performance needs to be monitored. Ideally, such monitoring can be\ncarried out by comparing the model's predictions against ground truth labels.\nFor this to be possible, the ground truth labels must be available relatively\nsoon after inference. However, there are many use cases where ground truth\nlabels are available only after a significant delay, or in the worst case, not\nat all. In such cases, directly monitoring the model's predictive performance\nis impossible.\n  Recently, novel methods for estimating the predictive performance of a model\nwhen ground truth is unavailable have been developed. Many of these methods\nleverage model confidence or other uncertainty estimates and are experimentally\ncompared against a naive baseline method, namely Average Confidence (AC), which\nestimates model accuracy as the average of confidence scores for a given set of\npredictions. However, until now the theoretical properties of the AC method\nhave not been properly explored. In this paper, we try to fill this gap by\nreviewing the AC method and show that under certain general assumptions, it is\nan unbiased and consistent estimator of model accuracy with many desirable\nproperties. We also compare this baseline estimator against some more complex\nestimators empirically and show that in many cases the AC method is able to\nbeat the others, although the comparative quality of the different estimators\nis heavily case-dependent.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"jdMBFcZhtIDJfE85BRxUoLsjxHLtlr8_Urddc8cJkoI","pdfSize":"3722715"}