{"id":"2407.20666","title":"Steps Towards an Infrastructure for Scholarly Synthesis","authors":"Joel Chan, Matthew Akamatsu, David Vargas, Lukas Kawerau, Michael\n  Gartner","authorsParsed":[["Chan","Joel",""],["Akamatsu","Matthew",""],["Vargas","David",""],["Kawerau","Lukas",""],["Gartner","Michael",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 09:03:42 GMT"},{"version":"v2","created":"Wed, 31 Jul 2024 00:53:04 GMT"}],"updateDate":"2024-08-01","timestamp":1722330222000,"abstract":"  Sharing, reusing, and synthesizing knowledge is central to the research\nprocess, both individually, and with others. These core functions are not\nsupported by our formal scholarly publishing infrastructure: instead of the\nsmooth functioning of functional infrastructure, researchers resort to\nlaborious \"hacks\" and workarounds to \"mine\" publications for what they need,\nand struggle to efficiently share the resulting information with others.\nInformation scientists have proposed an alternative infrastructure based on the\nmore appropriately granular model of a discourse graph of claims, and evidence,\nalong with key rhetorical relationships between them. However, despite\nsignificant technical progress on standards and platforms, the predominant\ninfrastructure remains steadfastly document-based. Drawing from infrastructure\nstudies, we locate the current infrastructural bottlenecks in the lack of local\nsystems that integrate discourse-centric models to augment synthesis work, from\nwhich an infrastructure for synthesis can be grown. Through 3 years of research\nthrough design and field deployment in a distributed community of hypertext\nnotebook users, we elaborate a design vision of what can and should be built in\norder to grow a discourse-centric synthesis infrastructure: a thriving\n\"installed base\" of researchers authoring local, shareable discourse graphs to\nimprove synthesis work, enhance primary research and research training, and\naugment collaborative research. We discuss how this design vision -- and our\nempirical work -- contributes steps towards a new infrastructure for synthesis,\nand increases HCI's capacity to advance collective intelligence and solve\ninfrastructure-level problems.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"pbhjN0C-_rf_F7mD0K-MXyy_jhghnvAsK6mRIcN61ek","pdfSize":"10816484"}