{"id":"2407.06171","title":"Fast and spectrally accurate construction of adaptive diagonal basis\n  sets for electronic structure","authors":"Michael Lindsey, Sandeep Sharma","authorsParsed":[["Lindsey","Michael",""],["Sharma","Sandeep",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 17:48:40 GMT"}],"updateDate":"2024-07-09","timestamp":1720460920000,"abstract":"  In this article, we combine the periodic sinc basis set with a curvilinear\ncoordinate system for electronic structure calculations. This extension allows\nfor variable resolution across the computational domain, with higher resolution\nclose to the nuclei and lower resolution in the inter-atomic regions. We\naddress two key challenges that arise while using basis sets obtained by such a\ncoordinate transformation. First, we use pseudospectral methods to evaluate the\nintegrals needed to construct the Hamiltonian in this basis. Second, we\ndemonstrate how to construct an appropriate coordinate transformation by\nsolving the Monge-Amp\\`ere equation using a new approach that we call the\ncyclic Knothe-Rosenblatt flow. The solution of both of these challenges enables\nmean-field calculations at a cost that is log-linear in the number of basis\nfunctions. We demonstrate that our method approaches the complete basis set\nlimit faster than basis sets with uniform resolution. We also emphasize how\nthese basis sets satisfy the diagonal approximation, which is shown to be a\nconsequence of the pseudospectral method. The diagonal approximation is highly\ndesirable for the solution of the electronic structure problem in many\nframeworks, including mean field theories, tensor network methods, quantum\ncomputing, and quantum Monte Carlo.\n","subjects":["Physics/Computational Physics","Condensed Matter/Strongly Correlated Electrons","Physics/Chemical Physics","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"nZZdIqOEPXp-6QVh5yg2DvimnlUcscww5almz917yRM","pdfSize":"1354283"}