{"id":"2407.17788","title":"PenHeal: A Two-Stage LLM Framework for Automated Pentesting and Optimal\n  Remediation","authors":"Junjie Huang, Quanyan Zhu","authorsParsed":[["Huang","Junjie",""],["Zhu","Quanyan",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 05:42:14 GMT"}],"updateDate":"2024-07-26","timestamp":1721886134000,"abstract":"  Recent advances in Large Language Models (LLMs) have shown significant\npotential in enhancing cybersecurity defenses against sophisticated threats.\nLLM-based penetration testing is an essential step in automating system\nsecurity evaluations by identifying vulnerabilities. Remediation, the\nsubsequent crucial step, addresses these discovered vulnerabilities. Since\ndetails about vulnerabilities, exploitation methods, and software versions\noffer crucial insights into system weaknesses, integrating penetration testing\nwith vulnerability remediation into a cohesive system has become both intuitive\nand necessary.\n  This paper introduces PenHeal, a two-stage LLM-based framework designed to\nautonomously identify and mitigate security vulnerabilities. The framework\nintegrates two LLM-enabled components: the Pentest Module, which detects\nmultiple vulnerabilities within a system, and the Remediation Module, which\nrecommends optimal remediation strategies. The integration is facilitated\nthrough Counterfactual Prompting and an Instructor module that guides the LLMs\nusing external knowledge to explore multiple potential attack paths\neffectively. Our experimental results demonstrate that PenHeal not only\nautomates the identification and remediation of vulnerabilities but also\nsignificantly improves vulnerability coverage by 31%, increases the\neffectiveness of remediation strategies by 32%, and reduces the associated\ncosts by 46% compared to baseline models. These outcomes highlight the\ntransformative potential of LLMs in reshaping cybersecurity practices, offering\nan innovative solution to defend against cyber threats.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"vxSkj_HFsXABy4P3V-Ce2uCBnTtDVDf6_ueq1Gmkqlw","pdfSize":"2336576","objectId":"0x6c40a7f291bae4ca0dce4dc02c0981dbe486f23a5a3cdb1cd45bad5d04ed95af","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
