{"id":"2407.14908","title":"PREVis: Perceived Readability Evaluation for Visualizations","authors":"Anne-Flore Cabouat, Tingying He, Petra Isenberg, Tobias Isenberg","authorsParsed":[["Cabouat","Anne-Flore",""],["He","Tingying",""],["Isenberg","Petra",""],["Isenberg","Tobias",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 15:39:42 GMT"}],"updateDate":"2024-07-23","timestamp":1721489982000,"abstract":"  We developed and validated an instrument to measure the perceived readability\nin data visualization: PREVis. Researchers and practitioners can easily use\nthis instrument as part of their evaluations to compare the perceived\nreadability of different visual data representations. Our instrument can\ncomplement results from controlled experiments on user task performance or\nprovide additional data during in-depth qualitative work such as design\niterations when developing a new technique. Although readability is recognized\nas an essential quality of data visualizations, so far there has not been a\nunified definition of the construct in the context of visual representations.\nAs a result, researchers often lack guidance for determining how to ask people\nto rate their perceived readability of a visualization. To address this issue,\nwe engaged in a rigorous process to develop the first validated instrument\ntargeted at the subjective readability of visual data representations. Our\nfinal instrument consists of 11 items across 4 dimensions: understandability,\nlayout clarity, readability of data values, and readability of data patterns.\nWe provide the questionnaire as a document with implementation guidelines on\nosf.io/9cg8j. Beyond this instrument, we contribute a discussion of how\nresearchers have previously assessed visualization readability, and an analysis\nof the factors underlying perceived readability in visual data representations.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Graphics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Dl_LobqmkCtMo1NbzZ7AGlFqtff0DjsgPz6yyHu8284","pdfSize":"7235770"}