{"id":"2407.07346","title":"INSIGHT: Universal Neural Simulator for Analog Circuits Harnessing\n  Autoregressive Transformers","authors":"Souradip Poddar, Youngmin Oh, Yao Lai, Hanqing Zhu, Bosun Hwang and\n  David Z. Pan","authorsParsed":[["Poddar","Souradip",""],["Oh","Youngmin",""],["Lai","Yao",""],["Zhu","Hanqing",""],["Hwang","Bosun",""],["Pan","David Z.",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 03:52:53 GMT"},{"version":"v2","created":"Sat, 13 Jul 2024 21:29:36 GMT"},{"version":"v3","created":"Tue, 6 Aug 2024 18:14:17 GMT"}],"updateDate":"2024-08-08","timestamp":1720583573000,"abstract":"  Analog front-end design heavily relies on specialized human expertise and\ncostly trial-and-error simulations, which motivated many prior works on analog\ndesign automation. However, efficient and effective exploration of the vast and\ncomplex design space remains constrained by the time-consuming nature of SPICE\nsimulations, making effective design automation a challenging endeavor. In this\npaper, we introduce INSIGHT, a GPU-powered, technology-agnostic, effective\nuniversal neural simulator in the analog front-end design automation loop.\nINSIGHT accurately predicts the performance metrics of analog circuits across\nvarious technologies with just a few microseconds of inference time. Notably,\nits autoregressive capabilities enable INSIGHT to accurately predict\nsimulation-costly critical transient specifications leveraging less expensive\nperformance metric information. The low cost and high fidelity feature make\nINSIGHT a good substitute for standard simulators in analog front-end\noptimization frameworks. INSIGHT is compatible with any optimization framework,\nfacilitating enhanced design space exploration for sample efficiency through\nsophisticated offline learning and adaptation techniques. Our experiments\ndemonstrate that INSIGHT-M, a model-based batch reinforcement learning sizing\nframework with INSIGHT as the accurate surrogate, only requires < 20 real-time\nsimulations with 100-1000x lower simulation costs and significant speedup over\nexisting sizing methods.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"q5m4fRZosrw034JOQSJ7_lCRtQSHSKIs-AnNoxPOaKU","pdfSize":"657546"}