{"id":"2407.05336","title":"Artificial intelligence, rationalization, and the limits of control in\n  the public sector: the case of tax policy optimization","authors":"Jakob Mokander and Ralph Schroeder","authorsParsed":[["Mokander","Jakob",""],["Schroeder","Ralph",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 11:54:14 GMT"}],"updateDate":"2024-07-09","timestamp":1720353254000,"abstract":"  The use of artificial intelligence (AI) in the public sector is best\nunderstood as a continuation and intensification of long standing\nrationalization and bureaucratization processes. Drawing on Weber, we take the\ncore of these processes to be the replacement of traditions with instrumental\nrationality, i.e., the most calculable and efficient way of achieving any given\npolicy objective. In this article, we demonstrate how much of the criticisms,\nboth among the public and in scholarship, directed towards AI systems spring\nfrom well known tensions at the heart of Weberian rationalization. To\nillustrate this point, we introduce a thought experiment whereby AI systems are\nused to optimize tax policy to advance a specific normative end, reducing\neconomic inequality. Our analysis shows that building a machine-like tax system\nthat promotes social and economic equality is possible. However, it also\nhighlights that AI driven policy optimization (i) comes at the exclusion of\nother competing political values, (ii) overrides citizens sense of their\nnoninstrumental obligations to each other, and (iii) undermines the notion of\nhumans as self-determining beings. Contemporary scholarship and advocacy\ndirected towards ensuring that AI systems are legal, ethical, and safe build on\nand reinforce central assumptions that underpin the process of rationalization,\nincluding the modern idea that science can sweep away oppressive systems and\nreplace them with a rule of reason that would rescue humans from moral\ninjustices. That is overly optimistic. Science can only provide the means, they\ncannot dictate the ends. Nonetheless, the use of AI in the public sector can\nalso benefit the institutions and processes of liberal democracies. Most\nimportantly, AI driven policy optimization demands that normative ends are made\nexplicit and formalized, thereby subjecting them to public scrutiny and debate.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"O2__KZzyNCnoGuylGvEL1vMtJXPmO1bFETZMq6YwkMw","pdfSize":"457761"}