{"id":"2407.02986","title":"Numerical analysis of a porous natural convection system with vorticity\n  and viscous dissipation","authors":"Russel Demos, Rashmi Dubey, Ricardo Ruiz-Baier, Segundo Villa-Fuentes","authorsParsed":[["Demos","Russel",""],["Dubey","Rashmi",""],["Ruiz-Baier","Ricardo",""],["Villa-Fuentes","Segundo",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 10:34:37 GMT"}],"updateDate":"2024-07-04","timestamp":1720002877000,"abstract":"  In this paper we propose and analyse a new formulation and pointwise\ndivergence-free mixed finite element methods for the numerical approximation of\nDarcy--Brinkman equations in vorticity--velocity--pressure form, coupled with a\ntransport equation for thermal energy with viscous dissipative effect and mixed\nNavier-type boundary conditions. The solvability analysis of the continuous and\ndiscrete problems is significantly more involved than usual as it hinges on\nBanach spaces needed to properly control the advective and dissipative terms in\nthe non-isothermal energy balance equation. We proceed by decoupling the set of\nequations and use the Banach fixed-point theorem in combination with the\nabstract theory for perturbed saddle-point problems. Some of the necessary\nestimates are straightforward modifications of well-known results, while other\ntechnical tools require a more elaborated analysis. The velocity is\napproximated by Raviart--Thomas elements, the vorticity uses N\\'ed\\'elec spaces\nof the first kind, the pressure is approximated by piecewise polynomials, and\nthe temperature by continuous and piecewise polynomials of one degree higher\nthan pressure. Special care is needed to establish discrete inf-sup conditions\nsince the curl of the discrete vorticity is not necessarily contained in the\ndiscrete velocity space, therefore suggesting to use two different\nRaviart--Thomas interpolants. A discrete fixed-point argument is used to show\nwell-posedness of the Galerkin scheme. Error estimates in appropriate norms are\nderived, and a few representative numerical examples in 2D and 3D and with\nmixed boundary conditions are provided.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"wJ_dYKtMx-6QUvQAYKKeVgvE6UWSKQPvtQfWXWzefqk","pdfSize":"1787524"}