{"id":"2407.08214","title":"Towards stable training of parallel continual learning","authors":"Li Yuepan, Fan Lyu, Yuyang Li, Wei Feng, Guangcan Liu, Fanhua Shang","authorsParsed":[["Yuepan","Li",""],["Lyu","Fan",""],["Li","Yuyang",""],["Feng","Wei",""],["Liu","Guangcan",""],["Shang","Fanhua",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 06:31:04 GMT"}],"updateDate":"2024-07-12","timestamp":1720679464000,"abstract":"  Parallel Continual Learning (PCL) tasks investigate the training methods for\ncontinual learning with multi-source input, where data from different tasks are\nlearned as they arrive. PCL offers high training efficiency and is well-suited\nfor complex multi-source data systems, such as autonomous vehicles equipped\nwith multiple sensors. However, at any time, multiple tasks need to be trained\nsimultaneously, leading to severe training instability in PCL. This instability\nmanifests during both forward and backward propagation, where features are\nentangled and gradients are conflict. This paper introduces Stable Parallel\nContinual Learning (SPCL), a novel approach that enhances the training\nstability of PCL for both forward and backward propagation. For the forward\npropagation, we apply Doubly-block Toeplit (DBT) Matrix based orthogonality\nconstraints to network parameters to ensure stable and consistent propagation.\nFor the backward propagation, we employ orthogonal decomposition for gradient\nmanagement stabilizes backpropagation and mitigates gradient conflicts across\ntasks. By optimizing gradients by ensuring orthogonality and minimizing the\ncondition number, SPCL effectively stabilizing the gradient descent in complex\noptimization tasks. Experimental results demonstrate that SPCL outperforms\nstate-of-the-art methjods and achieve better training stability.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ilnCHycLqTwsuVSWi5ICeKXapFXJvgnFzl1oq8CTapg","pdfSize":"1242997","objectId":"0x55edfda934fc113485c2a553df35006169a7d7d31dde626fbb0451d923fe40fa","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
