{"id":"2407.16759","title":"X-ray speed reading with the MCRC: prototype success and next generation\n  upgrades","authors":"Peter Orel, Abigail Y. Pan, Sven Herrmann, Tanmoy Chattopadhyay, Glenn\n  Morris, Haley Stueber, Steven W. Allen, Daniel Wilkins, Gregory Prigozhin,\n  Beverly LaMarr, Richard Foster, Andrew Malonis, Marshall W. Bautz, Michael J.\n  Cooper, and Kevan Donlon","authorsParsed":[["Orel","Peter",""],["Pan","Abigail Y.",""],["Herrmann","Sven",""],["Chattopadhyay","Tanmoy",""],["Morris","Glenn",""],["Stueber","Haley",""],["Allen","Steven W.",""],["Wilkins","Daniel",""],["Prigozhin","Gregory",""],["LaMarr","Beverly",""],["Foster","Richard",""],["Malonis","Andrew",""],["Bautz","Marshall W.",""],["Cooper","Michael J.",""],["Donlon","Kevan",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 18:00:07 GMT"}],"updateDate":"2024-07-25","timestamp":1721757607000,"abstract":"  The Advanced X-ray Imaging Satellite (AXIS) is a NASA probe class mission\nconcept designed to deliver arcsecond resolution with an effective area ten\ntimes that of Chandra (at launch). The AXIS focal plane features an MIT Lincoln\nLaboratory (MIT-LL) X-ray charge-coupled device (CCD) detector working in\nconjunction with an application specific integrated circuit (ASIC), denoted the\nMulti-Channel Readout Chip (MCRC). While this readout ASIC targets the AXIS\nmission, it is applicable to a range of potential X-ray missions with\ncomparable readout requirements. Designed by the X-ray astronomy and\nObservational Cosmology (XOC) group at Stanford University, the MCRC ASIC\nprototype (MCRC-V1.0) uses a 350 nm technology node and provides 8 channels of\nhigh speed, low noise, low power consumption readout electronics. Each channel\nimplements a current source to bias the detector output driver, a preamplifier\nto provide gain, and an output buffer to interface directly to an\nanalog-to-digital (ADC) converter. The MCRC-V1 ASIC exhibits comparable\nperformance to our best discrete electronics implementations, but with ten\ntimes less power consumption and a fraction of the footprint area. In a total\nionizing dose (TID) test, the chip demonstrated a radiation hardness equal or\ngreater to 25 krad, confirming the suitability of the process technology and\nlayout techniques used in its design. The next iteration of the ASIC (MCRC-V2)\nwill expand the channel count and extend the interfaces to external circuits,\nadvancing its readiness as a readout-on-a-chip solution for next generation\nX-ray CCD-like detectors. This paper summarizes our most recent\ncharacterization efforts, including the TID radiation campaign and results from\nthe first operation of the MCRC ASIC in combination with a representative\nMIT-LL CCD.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/High Energy Astrophysical Phenomena","Physics/Instrumentation and Detectors"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"HqKz2Uf-hi0LBGYWqnLjPsa8bV45XLkyLzeN3ovixA8","pdfSize":"20724360"}