{"id":"2407.15591","title":"FAIR evaluation of ten widely used chemical datasets: Lessons learned\n  and recommendations","authors":"Marcos Da Silveira and Oona Freudenthal and Louis Deladiennee","authorsParsed":[["Da Silveira","Marcos",""],["Freudenthal","Oona",""],["Deladiennee","Louis",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 12:26:41 GMT"}],"updateDate":"2024-07-23","timestamp":1721651201000,"abstract":"  This document focuses on databases disseminating data on (hazardous)\nsubstances found on the North American and the European (EU) market. The goal\nis to analyse the FAIRness (Findability, Accessibility, Interoperability and\nReusability) of published open data on these substances and to qualitatively\nevaluate to what extend the selected databases already fulfil the criteria set\nout in the commission draft regulation on a common data chemicals platform. We\nimplemented two complementary approaches: Manual, and Automatic. The manual\napproach is based on online questionnaires. These questionnaires provide a\nstructured approach to evaluating FAIRness by guiding users through a series of\nquestions related to the FAIR principles. They are particularly useful for\ninitiating discussions on FAIR implementation within research teams and for\nidentifying areas that require further attention. Automated tools for FAIRness\nassessment, such as F-UJI and FAIR Checker, are gaining prominence and are\ncontinuously under development. Unlike manual tools, automated tools perform a\nseries of tests automatically starting from a dereferenceable URL to the data\nresource to be evaluated. We analysed ten widely adopted datasets managed in\nEurope and North America. The highest score from automatic analysis was 54/100.\nThe manual analysis shows that several FAIR metrics were satisfied, but not\ndetectable by automatic tools because there is no metadata, or the format of\nthe information was not a standard one. Thus, it was not interpretable by the\ntool. We present the details of the analysis and tables summarizing the\noutcomes, the issues, and the suggestions to address these issues.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Databases"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"IcN4K5f-i02LzIxyLApq7iL3w6gARFnOM7pP2wuW3V0","pdfSize":"683388"}