{"id":"2407.03079","title":"Strong Charge-Photon Coupling in Planar Germanium Enabled by Granular\n  Aluminium Superinductors","authors":"Mari\\'an Jan\\'ik, Kevin Roux, Carla Borja Espinosa, Oliver Sagi,\n  Abdulhamid Baghdadi, Thomas Adletzberger, Stefano Calcaterra, Marc Botifoll,\n  Alba Garz\\'on Manj\\'on, Jordi Arbiol, Daniel Chrastina, Giovanni Isella, Ioan\n  M. Pop, Georgios Katsaros","authorsParsed":[["Janík","Marián",""],["Roux","Kevin",""],["Espinosa","Carla Borja",""],["Sagi","Oliver",""],["Baghdadi","Abdulhamid",""],["Adletzberger","Thomas",""],["Calcaterra","Stefano",""],["Botifoll","Marc",""],["Manjón","Alba Garzón",""],["Arbiol","Jordi",""],["Chrastina","Daniel",""],["Isella","Giovanni",""],["Pop","Ioan M.",""],["Katsaros","Georgios",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 12:53:01 GMT"}],"updateDate":"2024-07-04","timestamp":1720011181000,"abstract":"  High kinetic inductance superconductors are gaining increasing interest for\nthe realisation of qubits, amplifiers and detectors. Moreover, thanks to their\nhigh impedance, quantum buses made of such materials enable large zero-point\nfluctuations of the voltage, boosting the coupling rates to spin and charge\nqubits. However, fully exploiting the potential of disordered or granular\nsuperconductors is challenging, as their inductance and, therefore, impedance\nat high values are difficult to control. Here we have integrated a granular\naluminium resonator, having a characteristic impedance exceeding the resistance\nquantum, with a germanium double quantum dot and demonstrate strong\ncharge-photon coupling with a rate of $g_\\text{c}/2\\pi= (566 \\pm 2)$ MHz. This\nwas achieved due to the realisation of a wireless ohmmeter, which allows\n\\emph{in situ} measurements during film deposition and, therefore, control of\nthe kinetic inductance of granular aluminium films. Reproducible fabrication of\ncircuits with impedances (inductances) exceeding 13 k$\\Omega$ (1 nH per square)\nis now possible. This broadly applicable method opens the path for novel qubits\nand high-fidelity, long-distance two-qubit gates.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8iHV1Omv-QTErhaY3U13DjVzRpCnWwNib7dnfqHvgyI","pdfSize":"13850731"}