{"id":"2407.06163","title":"Hydrogen sulfide and metal-enriched atmosphere for a Jupiter-mass\n  exoplanet","authors":"Guangwei Fu, Luis Welbanks, Drake Deming, Julie Inglis, Michael Zhang,\n  Joshua Lothringer, Jegug Ih, Julianne I. Moses, Everett Schlawin, Heather A.\n  Knutson, Gregory Henry, Thomas Greene, David K. Sing, Arjun B. Savel, Eliza\n  M.-R. Kempton, Dana R. Louie, Michael Line, Matt Nixon","authorsParsed":[["Fu","Guangwei",""],["Welbanks","Luis",""],["Deming","Drake",""],["Inglis","Julie",""],["Zhang","Michael",""],["Lothringer","Joshua",""],["Ih","Jegug",""],["Moses","Julianne I.",""],["Schlawin","Everett",""],["Knutson","Heather A.",""],["Henry","Gregory",""],["Greene","Thomas",""],["Sing","David K.",""],["Savel","Arjun B.",""],["Kempton","Eliza M. -R.",""],["Louie","Dana R.",""],["Line","Michael",""],["Nixon","Matt",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 17:39:23 GMT"}],"updateDate":"2024-07-09","timestamp":1720460363000,"abstract":"  As the closest transiting hot Jupiter to Earth, HD 189733b has been the\nbenchmark planet for atmospheric characterization. It has also been the anchor\npoint for much of our theoretical understanding of exoplanet atmospheres from\ncomposition, chemistry, aerosols to atmospheric dynamics, escape, and modeling\ntechniques. Prior studies of HD 189733b have detected carbon and oxygen-bearing\nmolecules H2O and CO in the atmosphere. The presence of CO2 and CH4 has been\nclaimed but later disputed. The inferred metallicity based on these\nmeasurements, a key parameter in tracing planet formation locations, varies\nfrom depletion to enhancement, hindered by limited wavelength coverage and\nprecision of the observations. Here we report detections of H2O (13.4 sigma),\nCO2 (11.2 sigma), CO (5 sigma), and H2S (4.5 sigma) in the transmission\nspectrum (2.4-5 micron) of HD 189733b. With an equilibrium temperature of\n~1200K, H2O, CO, and H2S are the main reservoirs for oxygen, carbon, and\nsulfur. Based on the measured abundances of these three major volatile\nelements, we infer an atmospheric metallicity of 3-5 times stellar. The upper\nlimit on the methane abundance at 5 sigma is 0.1 ppm which indicates a low\ncarbon-to-oxygen ratio (<0.2), suggesting formation through the accretion of\nwater-rich icy planetesimals. The low oxygen-to-sulfur and carbon-to-sulfur\nratios also support the planetesimal accretion formation pathway.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"HthjOk3JFWmGDN9VB61CoaapuqSCfVI8MCvlNMIlp2M","pdfSize":"21196125"}