{"id":"2407.09132","title":"The MICADO first light imager for the ELT: the PSF Reconstruction\n  Software","authors":"Andrea Grazian, Elisa Portaluri, Matteo Simioni, Carmelo Arcidiacono,\n  Marco Gullieuszik, Johanna Hartke, Daniel Jodlbauer, Fernando Pedichini,\n  Roberto Piazzesi, Piero Vaccari, Benedetta Vulcani, Roland Wagner, Anita\n  Zanella","authorsParsed":[["Grazian","Andrea",""],["Portaluri","Elisa",""],["Simioni","Matteo",""],["Arcidiacono","Carmelo",""],["Gullieuszik","Marco",""],["Hartke","Johanna",""],["Jodlbauer","Daniel",""],["Pedichini","Fernando",""],["Piazzesi","Roberto",""],["Vaccari","Piero",""],["Vulcani","Benedetta",""],["Wagner","Roland",""],["Zanella","Anita",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 09:59:45 GMT"}],"updateDate":"2024-07-15","timestamp":1720778385000,"abstract":"  MICADO is the first-light camera of the ESO ELT, allowing NIR imaging and\nlong-slit spectroscopy assisted by adaptive optics. MICADO is now entering its\nconstruction phase, and the software for data reduction is reaching an adequate\nmaturity level. The PSF Reconstruction (PSF-R) of MICADO is a software tool for\nthe blind derivation of the PSF, only using adaptive optics telemetry data. An\nupdate of the status of the PSF-R service is provided here. The PSF-R prototype\nhas been tested on ERIS@VLT data in order to check the reconstruction of on-\nand off-axis PSFs. The on-axis PSF-R is accurate at a few percent level on\nStrehl, FWHM, Encircled Energy, and half light radius, while for the off-axis\ncase the match is within 10-15 percent at a distance of half isoplanatic angle.\nThe first version of the workflow for the PSF-R pipeline has been developed and\nverified using the latest release of the ESO data processing system. A set of\nsimulations has been implemented on the morphological analysis of distant\ngalaxies, showing that the accuracy of the PSF-R matches the goals needed to\nstudy their morphology. In summary, the PSF-R team is on the right track\ntowards the ELT first light.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Wm4n08Y_I2j8DZ4oNXa89cjJUaOo07hBtDOTe6uuf-4","pdfSize":"349784"}