{"id":"2407.02127","title":"Control theory and splitting methods","authors":"Karine Beauchard, Adrien Laurent, Fr\\'ed\\'eric Marbach","authorsParsed":[["Beauchard","Karine",""],["Laurent","Adrien",""],["Marbach","Frédéric",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 10:17:33 GMT"}],"updateDate":"2024-07-03","timestamp":1719915453000,"abstract":"  Our goal is to highlight some of the deep links between numerical splitting\nmethods and control theory. We consider evolution equations of the form\n$\\dot{x} = f_0(x) + f_1(x)$, where $f_0$ encodes a non-reversible dynamic, so\nthat one is interested in schemes only involving forward flows of $f_0$. In\nthis context, a splitting method can be interpreted as a trajectory of the\ncontrol-affine system $\\dot{x}(t)=f_0(x(t))+u(t)f_1(x(t))$, associated with a\ncontrol~$u$ which is a finite sum of Dirac masses. The general goal is then to\nfind a control such that the flow of $f_0 + u(t) f_1$ is as close as possible\nto the flow of $f_0+f_1$.\n  Using this interpretation and classical tools from control theory, we revisit\nwell-known results concerning numerical splitting methods, and we prove a\nhandful of new ones, with an emphasis on splittings with additional positivity\nconditions on the coefficients. First, we show that there exist numerical\nschemes of any arbitrary order involving only forward flows of $f_0$ if one\nallows complex coefficients for the flows of $f_1$. Equivalently, for\ncomplex-valued controls, we prove that the Lie algebra rank condition is\nequivalent to the small-time local controllability of a system. Second, for\nreal-valued coefficients, we show that the well-known order restrictions are\nlinked with so-called \"bad\" Lie brackets from control theory, which are known\nto yield obstructions to small-time local controllability. We use our recent\nbasis of the free Lie algebra to precisely identify the conditions under which\nhigh-order methods exist.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis","Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Xnso7GX184dc4PdW3-VU-1gDoPx_D5l8PYSbIPvyLAY","pdfSize":"498248"}