{"id":"2407.10990","title":"MedBench: A Comprehensive, Standardized, and Reliable Benchmarking\n  System for Evaluating Chinese Medical Large Language Models","authors":"Mianxin Liu, Jinru Ding, Jie Xu, Weiguo Hu, Xiaoyang Li, Lifeng Zhu,\n  Zhian Bai, Xiaoming Shi, Benyou Wang, Haitao Song, Pengfei Liu, Xiaofan\n  Zhang, Shanshan Wang, Kang Li, Haofen Wang, Tong Ruan, Xuanjing Huang, Xin\n  Sun, Shaoting Zhang","authorsParsed":[["Liu","Mianxin",""],["Ding","Jinru",""],["Xu","Jie",""],["Hu","Weiguo",""],["Li","Xiaoyang",""],["Zhu","Lifeng",""],["Bai","Zhian",""],["Shi","Xiaoming",""],["Wang","Benyou",""],["Song","Haitao",""],["Liu","Pengfei",""],["Zhang","Xiaofan",""],["Wang","Shanshan",""],["Li","Kang",""],["Wang","Haofen",""],["Ruan","Tong",""],["Huang","Xuanjing",""],["Sun","Xin",""],["Zhang","Shaoting",""]],"versions":[{"version":"v1","created":"Mon, 24 Jun 2024 02:25:48 GMT"}],"updateDate":"2024-07-17","timestamp":1719195948000,"abstract":"  Ensuring the general efficacy and goodness for human beings from medical\nlarge language models (LLM) before real-world deployment is crucial. However, a\nwidely accepted and accessible evaluation process for medical LLM, especially\nin the Chinese context, remains to be established. In this work, we introduce\n\"MedBench\", a comprehensive, standardized, and reliable benchmarking system for\nChinese medical LLM. First, MedBench assembles the currently largest evaluation\ndataset (300,901 questions) to cover 43 clinical specialties and performs\nmulti-facet evaluation on medical LLM. Second, MedBench provides a standardized\nand fully automatic cloud-based evaluation infrastructure, with physical\nseparations for question and ground truth. Third, MedBench implements dynamic\nevaluation mechanisms to prevent shortcut learning and answer remembering.\nApplying MedBench to popular general and medical LLMs, we observe unbiased,\nreproducible evaluation results largely aligning with medical professionals'\nperspectives. This study establishes a significant foundation for preparing the\npractical applications of Chinese medical LLMs. MedBench is publicly accessible\nat https://medbench.opencompass.org.cn.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"lv25NVlqg98Q7nP45HExMQQeAN3oBoSX9x-SVMxk8vg","pdfSize":"2289496","objectId":"0x40f1f6b1dfba3788f7446091c75e9cec116e9ee860faa9d094739b020be0c11b","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
