{"id":"2407.04062","title":"Single-mode emission by phase-delayed coupling between nano-lasers","authors":"T. V. Raziman, Anna Fischer, Riccardo Nori, Anthony Chan, Wai Kit Ng,\n  Dhruv Saxena, Ortwin Hess, Korneel Molkens, Ivo Tanghe, Pieter Geiregat,\n  Dries Van Thourhout, Mauricio Barahona, Riccardo Sapienza","authorsParsed":[["Raziman","T. V.",""],["Fischer","Anna",""],["Nori","Riccardo",""],["Chan","Anthony",""],["Ng","Wai Kit",""],["Saxena","Dhruv",""],["Hess","Ortwin",""],["Molkens","Korneel",""],["Tanghe","Ivo",""],["Geiregat","Pieter",""],["Van Thourhout","Dries",""],["Barahona","Mauricio",""],["Sapienza","Riccardo",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 17:07:13 GMT"}],"updateDate":"2024-07-08","timestamp":1720112833000,"abstract":"  Near-field coupling between nanolasers enables collective high-power lasing\nbut leads to complex spectral reshaping and multimode operation, limiting the\nemission brightness, spatial coherence and temporal stability. Many lasing\narchitectures have been proposed to circumvent this limitation, based on\nsymmetries, topology, or interference. We show that a much simpler and robust\nmethod exploiting phase-delayed coupling, where light exchanged by the lasers\ncarries a phase, can enable stable single-mode operation. Phase-delayed\ncoupling changes the modal amplification: for pump powers close to the anyonic\nparity-time (PT) symmetric exceptional point, a high phase delay completely\nseparates the mode thresholds, leading to single mode operation. This is shown\nby stability analysis with nonlinear coupled mode theory and stochastic\ndifferential equations for two coupled nanolasers and confirmed by realistic\nsemi-analytical treatment of a dimer of lasing nanospheres. Finally, we extend\nthe mode control to large arrays of nanolasers, featuring lowered thresholds\nand higher power. Our work promises a novel solution to engineer bright and\nstable single-mode lasing from nanolaser arrays with important applications in\nphotonic chips for communication and lidars.\n","subjects":["Physics/Optics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"2TaxV5ZCJAz2bPBhxpvQgpePLFpiEO0X8N2J6EGRqnY","pdfSize":"864132"}
