{"id":"2407.04031","title":"Towards reproducible machine learning-based process monitoring and\n  quality prediction research for additive manufacturing","authors":"Jiarui Xie, Mutahar Safdar, Andrei Mircea, Yan Lu, Hyunwoong Ko, Zhuo\n  Yang, Yaoyao Fiona Zhao","authorsParsed":[["Xie","Jiarui",""],["Safdar","Mutahar",""],["Mircea","Andrei",""],["Lu","Yan",""],["Ko","Hyunwoong",""],["Yang","Zhuo",""],["Zhao","Yaoyao Fiona",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 16:15:52 GMT"}],"updateDate":"2024-07-08","timestamp":1720109752000,"abstract":"  Machine learning (ML)-based monitoring systems have been extensively\ndeveloped to enhance the print quality of additive manufacturing (AM). In-situ\nand in-process data acquired using sensors can be used to train ML models that\ndetect process anomalies, predict part quality, and adjust process parameters.\nHowever, the reproducibility of the proposed AM monitoring systems has not been\ninvestigated. There has not been a method to evaluate and improve\nreproducibility in the joint domain of AM and ML. Consequently, some crucial\ninformation for reproducing the research is usually missing from the\npublications; thus, systems reproduced based on the publications often cannot\nachieve the claimed performance. This paper establishes the definition of\nreproducibility in this domain, proposes a reproducibility investigation\npipeline, and composes a reproducibility checklist. A research is reproducible\nif a performance comparable to the original research can be obtained when\nreproduced by a different team using a different experiment setup. The\nreproducibility investigation pipeline sequentially guides the readers through\nall the necessary reproduction steps, during which the reproducibility\nchecklist will help extract the reproducibility information from the\npublication. A case study that reproduced a vision-based warping detection\nsystem demonstrated the usage and validated the efficacy of the proposed\npipeline and checklist. It has been observed that the reproducibility checklist\ncan help the authors verify that all the information critical to\nreproducibility is provided in the publications. The investigation pipeline can\nhelp identify the missing reproducibility information, which should be acquired\nfrom the original authors to achieve the claimed performance.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"_WiRjS0Yk4oOkXvTf8C1bsoLhCZZ-v9Qj2C2xfztLRU","pdfSize":"1705246"}
