{"id":"2407.13317","title":"Gravitation as a Statistical Theory on the Light Cone","authors":"Jos\\'e M. Isidro, Claudio F. Paganini, and Alessandro Pesci","authorsParsed":[["Isidro","José M.",""],["Paganini","Claudio F.",""],["Pesci","Alessandro",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 09:18:53 GMT"}],"updateDate":"2024-07-19","timestamp":1721294333000,"abstract":"  In this paper, we will explore Padmanabhan's mesoscopic, statistical approach\nto gravity [62] with a twist. The general picture of his approach is that\nspacetime is made of large numbers of localized quantum degrees of freedom.\nPadmanabhan assumed that the degrees of freedom of a given quantum state of\ngeometry contribute, after averaging over fluctuations, a vector degree of\nfreedom for space-time at a point. For null vectors, this can be regarded as\ncorresponding to one single vector, i.e. a pure state, for the statistical\nensemble on the light cone at every point. In the present paper, we consider\ninstead the case where the states of the gravitational degrees of freedom are\nspread out and overlap, with only probabilistic information on which of them\ndetermines the actual spacetime at a point. In the continuum limit, this\ncorresponds to a mixed state for the statistical ensemble on the light cone at\nevery point. This change in assumptions leads to some interesting observations.\nWhen we define a statistical ensemble on the light cone, its variance \"knows\"\nabout the interior of the light cone. As an intriguing consequence, we find\nthat the cosmological constant can be related to the variance over the light\ncone. With a mixed state, we can no longer derive the gravitational field\nequations from an entropy functional. Here, instead, we show that a naive\nimplementation of the measure of a mixed state on the light cone in the\nvariation principle leads to modified measure theories (MMT) as the grand\ncanonical ensemble and allows one to reframe unimodular gravity as the\ncanonical ensemble of a statistical theory on the light cone.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Physics/Mathematical Physics","Mathematics/Mathematical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"UddjtlxMyS2d3eFfvCUwrxN8j6rxwmEqSlG0o7u9XIY","pdfSize":"313875"}