{"id":"2407.02159","title":"SparseSSP: 3D Subcellular Structure Prediction from Sparse-View\n  Transmitted Light Images","authors":"Jintu Zheng, Yi Ding, Qizhe Liu, Yi Cao, Ying Hu, Zenan Wang","authorsParsed":[["Zheng","Jintu",""],["Ding","Yi",""],["Liu","Qizhe",""],["Cao","Yi",""],["Hu","Ying",""],["Wang","Zenan",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 11:08:51 GMT"},{"version":"v2","created":"Wed, 3 Jul 2024 10:00:34 GMT"}],"updateDate":"2024-07-04","timestamp":1719918531000,"abstract":"  Traditional fluorescence staining is phototoxic to live cells, slow, and\nexpensive; thus, the subcellular structure prediction (SSP) from transmitted\nlight (TL) images is emerging as a label-free, faster, low-cost alternative.\nHowever, existing approaches utilize 3D networks for one-to-one voxel level\ndense prediction, which necessitates a frequent and time-consuming Z-axis\nimaging process. Moreover, 3D convolutions inevitably lead to significant\ncomputation and GPU memory overhead. Therefore, we propose an efficient\nframework, SparseSSP, predicting fluorescent intensities within the target\nvoxel grid in an efficient paradigm instead of relying entirely on 3D\ntopologies. In particular, SparseSSP makes two pivotal improvements to prior\nworks. First, SparseSSP introduces a one-to-many voxel mapping paradigm, which\npermits the sparse TL slices to reconstruct the subcellular structure.\nSecondly, we propose a hybrid dimensions topology, which folds the Z-axis\ninformation into channel features, enabling the 2D network layers to tackle SSP\nunder low computational cost. We conduct extensive experiments to validate the\neffectiveness and advantages of SparseSSP on diverse sparse imaging ratios, and\nour approach achieves a leading performance compared to pure 3D topologies.\nSparseSSP reduces imaging frequencies compared to previous dense-view SSP\n(i.e., the number of imaging is reduced up to 87.5% at most), which is\nsignificant in visualizing rapid biological dynamics on low-cost devices and\nsamples.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"yFVRyPHaKbVJ-zmPldZB-LZzZiNUZr9mNZ4w4n54jm0","pdfSize":"2371580"}