{"id":"2407.20404","title":"Functional Analytic Derivation and CP2K Implementation of the SCCS Model\n  Based on the Solvent-Aware Interface","authors":"Ziwei Chai, Sandra Luber","authorsParsed":[["Chai","Ziwei",""],["Luber","Sandra",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 20:14:34 GMT"}],"updateDate":"2024-07-31","timestamp":1722284074000,"abstract":"  In the self-consistent continuum solvation (SCCS) approach ($\\textit{J. Chem.\nPhys.}$ 136, 064102 (2012)), the analytical expressions of the local\nsolute-solvent interface functions determine the interface function and\ndielectric function values at a given real space position based solely on the\nelectron density at that position, completely disregarding the surrounding\nelectron density distribution. Therefore, the low electron density areas inside\nthe solute will be identified by the algorithm as regions where implicit\nsolvent exists, resulting in the emergence of non-physical implicit solvent\nregions within the solute and even potentially leading to the divergence\ncatastrophe of Kohn-Sham SCF calculations. We present a new and efficient SCCS\nimplementation based on the solvent-aware interface ($\\textit{J. Chem. Theory\nComput.}$ 15, 3, 1996-2009 (2019)) which addresses this issue by utilizing a\nsolute-solvent interface function based on convolution of electron density in\nthe CP2K software package, which is based on the mixed Gaussian and plane waves\n(GPW) approach. Starting with the foundational formulas of SCCS, we have\nrigorously and meticulously derived the contributions of the newly defined\nelectrostatic energy to the Kohn-Sham potential and the analytical forces. This\ncomprehensive derivation utilizes the updated versions of the solute-solvent\ninterface function and the dielectric function, tailored to align with the\nspecifics of the GPW implementation. Our implementation has been tested to\nsuccessfully eliminate non-physical implicit solvent regions within the solute\nand achieve good SCF convergence, as demonstrated by test results for both bulk\nand surface models, namely liquid $H_2O$, titanium dioxide, and platinum.\n","subjects":["Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"99ul5hpKPdLfyOJFgXgbrQhg9KMudDQV_FGglzFkf3E","pdfSize":"8302962"}