{"id":"2407.06133","title":"Hebrew letters Detection and Cuneiform tablets Classification by using\n  the yolov8 computer vision model","authors":"Elaf A. Saeed, Ammar D. Jasim, Munther A. Abdul Malik","authorsParsed":[["Saeed","Elaf A.",""],["Jasim","Ammar D.",""],["Malik","Munther A. Abdul",""]],"versions":[{"version":"v1","created":"Sun, 19 May 2024 09:37:19 GMT"}],"updateDate":"2024-07-09","timestamp":1716111439000,"abstract":"  Cuneiform writing, an old art style, allows us to see into the past. Aside\nfrom Egyptian hieroglyphs, the cuneiform script is one of the oldest writing\nsystems. Many historians place Hebrew's origins in antiquity. For example, we\nused the same approach to decipher the cuneiform languages; after learning how\nto decipher one old language, we would visit an archaeologist to learn how to\ndecipher any other ancient language. We propose a deep-learning-based sign\ndetector method to speed up this procedure to identify and group cuneiform\ntablet images according to Hebrew letter content. The Hebrew alphabet is\nnotoriously difficult and costly to gather the training data needed for deep\nlearning, which entails enclosing Hebrew characters in boxes. We solve this\nproblem using pre-existing transliterations and a sign-by-sign representation\nof the tablet's content in Latin characters. We recommend one of the supervised\napproaches because these do not include sign localization: We Find the\ntransliteration signs in the tablet photographs by comparing them to their\ncorresponding transliterations. Then, retrain the sign detector using these\nlocalized signs instead of utilizing annotations. Afterward, a more effective\nsign detector enhances the alignment quality. Consequently, this research aims\nto use the Yolov8 object identification pretraining model to identify Hebrew\ncharacters and categorize the cuneiform tablets.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"DTzsFHuMRyIpCA7KHBkU-KO_Ygp2MGCQLxkHDD6AdSo","pdfSize":"1404472"}