{"id":"2407.11485","title":"Scientific QA System with Verifiable Answers","authors":"Adela Ljaji\\'c, Milo\\v{s} Ko\\v{s}prdi\\'c, Bojana Ba\\v{s}aragin, Darija\n  Medvecki, Lorenzo Cassano, Nikola Milo\\v{s}evi\\'c","authorsParsed":[["Ljajić","Adela",""],["Košprdić","Miloš",""],["Bašaragin","Bojana",""],["Medvecki","Darija",""],["Cassano","Lorenzo",""],["Milošević","Nikola",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 08:21:02 GMT"}],"updateDate":"2024-07-17","timestamp":1721118062000,"abstract":"  In this paper, we introduce the VerifAI project, a pioneering open-source\nscientific question-answering system, designed to provide answers that are not\nonly referenced but also automatically vetted and verifiable. The components of\nthe system are (1) an Information Retrieval system combining semantic and\nlexical search techniques over scientific papers (PubMed), (2) a\nRetrieval-Augmented Generation (RAG) module using fine-tuned generative model\n(Mistral 7B) and retrieved articles to generate claims with references to the\narticles from which it was derived, and (3) a Verification engine, based on a\nfine-tuned DeBERTa and XLM-RoBERTa models on Natural Language Inference task\nusing SciFACT dataset. The verification engine cross-checks the generated claim\nand the article from which the claim was derived, verifying whether there may\nhave been any hallucinations in generating the claim. By leveraging the\nInformation Retrieval and RAG modules, Verif.ai excels in generating factual\ninformation from a vast array of scientific sources. At the same time, the\nVerification engine rigorously double-checks this output, ensuring its accuracy\nand reliability. This dual-stage process plays a crucial role in acquiring and\nconfirming factual information, significantly enhancing the information\nlandscape. Our methodology could significantly enhance scientists'\nproductivity, concurrently fostering trust in applying generative language\nmodels within scientific domains, where hallucinations and misinformation are\nunacceptable.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"pIi9CNdHfBAm-ZN6iH1t2aMSAoV4gSLgm5O9-qHfEQ4","pdfSize":"563750"}