{"id":"2407.15013","title":"Teaching Digital Accessibility in Computing Education: Views of\n  Educators in India","authors":"Parthasarathy and Swaroop","authorsParsed":[["Parthasarathy","",""],["Swaroop","",""]],"versions":[{"version":"v1","created":"Sun, 16 Jun 2024 17:39:38 GMT"}],"updateDate":"2024-09-09","timestamp":1718559578000,"abstract":"  In recent years, there has been rising interest from both governments and\nprivate industry in developing software that is accessible to all, including\npeople with disabilities. However, the computer science (CS) courses that ought\nto prepare future professionals to develop such accessible software hardly\ncover topics related to accessibility. While there is growing literature on\nincorporating accessibility topics in computing education in the West, there is\nlittle work on this in the Global South, particularly in India, which has a\nlarge number of computing students and software professionals. In this\nreplication report, we present (A) our findings from a replication of surveys\nused in the US and Switzerland on who teaches accessibility and barriers to\nteaching accessibility and (B) a qualitative analysis of perceptions of CS\nfaculty in India about digital accessibility and teaching accessibility. Our\nstudy corroborates the findings of the earlier surveys: very few CS faculty\nteach accessibility, and the top barriers they perceive are the same. The\nqualitative analysis further reveals that the faculty in India need training on\naccessibility concepts and disabilities sensitization, and exposure to existing\nand ongoing CS education research and pedagogies. In light of these findings,\nwe present recommendations aimed at addressing these challenges and enhancing\nthe integration of accessibility into computing education.\n","subjects":["Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"4kjSzhX5DkhSOPnorbkalk05ExgkwBLXM4LRZ2W2sUQ","pdfSize":"986862","objectId":"0xdd61bd1c7ef7ccb82df9480ce25970505cacbaf148c63b90f065c1421906dbb9","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
