{"id":"2407.11227","title":"Magnetic skin effect in Pb(Fe$_{1/2}$Nb$_{1/2}$)O$_3$","authors":"N. Giles-Donovan, A. D. Hillier, K. Ishida, B. V. Hampshire, S. R.\n  Giblin, B. Roessli, P. M. Gehring, G. Xu, X. Li, H. Luo, S. Cochran, C. Stock","authorsParsed":[["Giles-Donovan","N.",""],["Hillier","A. D.",""],["Ishida","K.",""],["Hampshire","B. V.",""],["Giblin","S. R.",""],["Roessli","B.",""],["Gehring","P. M.",""],["Xu","G.",""],["Li","X.",""],["Luo","H.",""],["Cochran","S.",""],["Stock","C.",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 20:25:52 GMT"}],"updateDate":"2024-08-01","timestamp":1721075152000,"abstract":"  Relaxor-ferroelectrics display exceptional dielectric properties resulting\nfrom the underlying random dipolar fields induced by strong chemical\ninhomogeneity. An unusual structural aspect of relaxors is a skin-effect where\nthe near-surface region in single crystals exhibit structures and critical\nphenomena that differ from the bulk. Relaxors are unique in that this skin\neffect extends over a macroscopic lengthscale of $\\sim$ 100$\\mu$m whereas usual\nsurface layers only extend over a few unit cells (or $\\sim$ nm). We present a\nmuon spectroscopy study of Pb(Fe$_{1/2}$Nb$_{1/2}$)O$_{3}$ (PFN) which displays\nferroelectric order, including many relaxor-like dielectric properties such as\na frequency broadened dielectric response, and antiferromagnetism with\nspatially short-range polar correlations and hence can be termed a\nmultiferroic. In terms of the magnetic behavior determined by the Fe$^{3+}$\n($S=5/2$, $L\\approx0$) ions, PFN has been characterized as a unique example of\na \"cluster spin-glass\". We use variable momentum muon spectroscopy to study the\ndepth dependence of the slow magnetic relaxations in a large 1 cm$^{3}$ crystal\nof PFN. Zero-field positive muon spin relaxation is parameterized using a\nstretched exponential, indicative of a distribution of relaxation rates of the\nFe$^{3+}$ spins. This bandwidth of frequencies changes as a function of muon\nmomentum, indicative of a change in the Fe$^{3+}$ relaxation rates as a\nfunction of muon implantation depth in our single crystal. Using negative muon\nelemental analysis, we find small-to-no measurable change in the\nFe$^{3+}$/Nb$^{5+}$ concentration with depth implying that chemical\nconcentration alone cannot account for the change in the relaxational dynamics.\nPFN displays an analogous magnetic skin effect reported to exist in the\nstructural properties of relaxor-ferroelectrics.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Disordered Systems and Neural Networks"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Oe9Q_XKuNYMNjpz2aOyPfb3L-ErDiJjjSs3TMOqyhb0","pdfSize":"1762420"}