{"id":"2407.10862","title":"R3D-AD: Reconstruction via Diffusion for 3D Anomaly Detection","authors":"Zheyuan Zhou, Le Wang, Naiyu Fang, Zili Wang, Lemiao Qiu, Shuyou Zhang","authorsParsed":[["Zhou","Zheyuan",""],["Wang","Le",""],["Fang","Naiyu",""],["Wang","Zili",""],["Qiu","Lemiao",""],["Zhang","Shuyou",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 16:10:58 GMT"}],"updateDate":"2024-07-16","timestamp":1721059858000,"abstract":"  3D anomaly detection plays a crucial role in monitoring parts for localized\ninherent defects in precision manufacturing. Embedding-based and\nreconstruction-based approaches are among the most popular and successful\nmethods. However, there are two major challenges to the practical application\nof the current approaches: 1) the embedded models suffer the prohibitive\ncomputational and storage due to the memory bank structure; 2) the\nreconstructive models based on the MAE mechanism fail to detect anomalies in\nthe unmasked regions. In this paper, we propose R3D-AD, reconstructing\nanomalous point clouds by diffusion model for precise 3D anomaly detection. Our\napproach capitalizes on the data distribution conversion of the diffusion\nprocess to entirely obscure the input's anomalous geometry. It step-wisely\nlearns a strict point-level displacement behavior, which methodically corrects\nthe aberrant points. To increase the generalization of the model, we further\npresent a novel 3D anomaly simulation strategy named Patch-Gen to generate\nrealistic and diverse defect shapes, which narrows the domain gap between\ntraining and testing. Our R3D-AD ensures a uniform spatial transformation,\nwhich allows straightforwardly generating anomaly results by distance\ncomparison. Extensive experiments show that our R3D-AD outperforms previous\nstate-of-the-art methods, achieving 73.4% Image-level AUROC on the Real3D-AD\ndataset and 74.9% Image-level AUROC on the Anomaly-ShapeNet dataset with an\nexceptional efficiency.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7OPZTLP5KbiITsDeWAe1cGricG6ZyqzaJHp-4JgcITw","pdfSize":"14420100"}