{"id":"2407.11803","title":"Antiferromagnetic pseudogap in the two-dimensional Hubbard model deep in\n  the renormalized classical regime","authors":"Y.M. Vilk, Camille Lahaie, A.-M.S. Tremblay","authorsParsed":[["Vilk","Y. M.",""],["Lahaie","Camille",""],["Tremblay","A. -M. S.",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 14:53:59 GMT"}],"updateDate":"2024-07-17","timestamp":1721141639000,"abstract":"  Long-wavelength spin fluctuations prohibit antiferromagnetic long-range order\nat finite temperature in two dimensions. Nevertheless, the correlation length\nstarts to grow rapidly at a crossover temperature, leading to critical slowing\ndown and to a renormalized-classical regime over a wide range of temperature,\nbetween a fraction of the mean-field transition temperature and the\nzero-temperature ordered state. This leads to a single-particle pseudogap of\nthe kind observed in electron-doped cuprates. Very few theoretical methods can\nclaim an accurate description of this regime. The challenge is that in this\nregime Fermi-liquid quasiparticles are already destroyed and new quasiparticles\nof the ordered state are not fully formed yet. Here, we study this problem for\nthe two-dimensional Hubbard model by first generalizing the two-particle\nself-consistent approach. Using a special algorithm, spin fluctuations are\ntreated in the thermodynamic limit even for large correlation lengths. The\neffects of Kanamori-Br\\\"uckner screening, of classical and of quantum\nfluctuations are taken into account. Results are presented at half-filling for\nthe one-band Hubbard model with nearest-neighbor hopping. They agree well with\navailable benchmark diagrammatic quantum Monte Carlo at high temperature where\nthe pseudogap opens up. In addition to temperature-dependent spectral\nproperties, we find quantum corrections to the zero-temperature renormalized\nmean-field antiferromagnetic gap. Finally, analytic continuation of the\nMatsubara results for spectral functions show that the pseudogap opens up at\nsignificantly higher temperature than was previously identified based on the\nMatsubara data only.\n","subjects":["Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"VC-TCrphhDM4puPK6ypKE6sCMZ9e0BRvJjCZj9rO2oI","pdfSize":"823004"}