{"id":"2407.06703","title":"HERMES: Holographic Equivariant neuRal network model for Mutational\n  Effect and Stability prediction","authors":"Gian Marco Visani, Michael N. Pun, William Galvin, Eric Daniel, Kevin\n  Borisiak, Utheri Wagura, Armita Nourmohammad","authorsParsed":[["Visani","Gian Marco",""],["Pun","Michael N.",""],["Galvin","William",""],["Daniel","Eric",""],["Borisiak","Kevin",""],["Wagura","Utheri",""],["Nourmohammad","Armita",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 09:31:05 GMT"}],"updateDate":"2024-07-10","timestamp":1720517465000,"abstract":"  Predicting the stability and fitness effects of amino acid mutations in\nproteins is a cornerstone of biological discovery and engineering. Various\nexperimental techniques have been developed to measure mutational effects,\nproviding us with extensive datasets across a diverse range of proteins. By\ntraining on these data, traditional computational modeling and more recent\nmachine learning approaches have advanced significantly in predicting\nmutational effects. Here, we introduce HERMES, a 3D rotationally equivariant\nstructure-based neural network model for mutational effect and stability\nprediction. Pre-trained to predict amino acid propensity from its surrounding\n3D structure, HERMES can be fine-tuned for mutational effects using our\nopen-source code. We present a suite of HERMES models, pre-trained with\ndifferent strategies, and fine-tuned to predict the stability effect of\nmutations. Benchmarking against other models shows that HERMES often\noutperforms or matches their performance in predicting mutational effect on\nstability, binding, and fitness. HERMES offers versatile tools for evaluating\nmutational effects and can be fine-tuned for specific predictive objectives.\n","subjects":["Quantitative Biology/Biomolecules","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"dXeOhurMsMSqrbI_vdRdy5BbK1UJrsJiKxiRNJOyRVc","pdfSize":"2496906"}