{"id":"2407.16051","title":"ElectionRumors2022: A Dataset of Election Rumors on Twitter During the\n  2022 US Midterms","authors":"Joseph S Schafer, Kayla Duskin, Stephen Prochaska, Morgan Wack, Anna\n  Beers, Lia Bozarth, Taylor Agajanian, Mike Caulfield, Emma S Spiro, and Kate\n  Starbird","authorsParsed":[["Schafer","Joseph S",""],["Duskin","Kayla",""],["Prochaska","Stephen",""],["Wack","Morgan",""],["Beers","Anna",""],["Bozarth","Lia",""],["Agajanian","Taylor",""],["Caulfield","Mike",""],["Spiro","Emma S",""],["Starbird","Kate",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 21:02:26 GMT"}],"updateDate":"2024-07-24","timestamp":1721682146000,"abstract":"  Understanding the spread of online rumors is a pressing societal challenge\nand an active area of research across domains. In the context of the 2022 U.S.\nmidterm elections, one influential social media platform for sharing\ninformation -- including rumors that may be false, misleading, or\nunsubstantiated -- was Twitter (now renamed X). To increase understanding of\nthe dynamics of online rumors about elections, we present and analyze a dataset\nof 1.81 million Twitter posts corresponding to 135 distinct rumors which spread\nonline during the midterm election season (September 5 to December 1, 2022). We\ndescribe how this data was collected, compiled, and supplemented, and provide a\nseries of exploratory analyses along with comparisons to a previously-published\ndataset on 2020 election rumors. We also conduct a mixed-methods analysis of\nthree distinct rumors about the election in Arizona, a particularly prominent\nfocus of 2022 election rumoring. Finally, we provide a set of potential future\ndirections for how this dataset could be used to facilitate future research\ninto online rumors, misinformation, and disinformation.\n","subjects":["Computing Research Repository/Social and Information Networks","Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"v5OR3w6ZIFh60pBweouehWCf8qqS9iRpvI8xR0WW-Mo","pdfSize":"1384510"}