{"id":"2407.17002","title":"KMT-2021-BLG-2609Lb and KMT-2022-BLG-0303Lb: Microlensing planets\n  identified through signals produced by major-image perturbations","authors":"Cheongho Han, Michael D. Albrow, Chung-Uk Lee, Sun-Ju Chung, Andrew\n  Gould, Kyu-Ha Hwang, Youn Kil Jung, Chung-Uk Lee, Yoon-Hyun Ryu, Yossi\n  Shvartzvald, In-Gu Shin, Jennifer C. Yee, Hongjing Yang, Weicheng Zang,\n  Sang-Mok Cha, Doeon Kim, Dong-Jin Kim, Seung-Lee Kim, Dong-Joo Lee, Yongseok\n  Lee, Byeong-Gon Park, Richard W. Pogge","authorsParsed":[["Han","Cheongho",""],["Albrow","Michael D.",""],["Lee","Chung-Uk",""],["Chung","Sun-Ju",""],["Gould","Andrew",""],["Hwang","Kyu-Ha",""],["Jung","Youn Kil",""],["Lee","Chung-Uk",""],["Ryu","Yoon-Hyun",""],["Shvartzvald","Yossi",""],["Shin","In-Gu",""],["Yee","Jennifer C.",""],["Yang","Hongjing",""],["Zang","Weicheng",""],["Cha","Sang-Mok",""],["Kim","Doeon",""],["Kim","Dong-Jin",""],["Kim","Seung-Lee",""],["Lee","Dong-Joo",""],["Lee","Yongseok",""],["Park","Byeong-Gon",""],["Pogge","Richard W.",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 04:49:45 GMT"}],"updateDate":"2024-07-25","timestamp":1721796585000,"abstract":"  We investigate microlensing data collected by the Korea Microlensing\nTelescope Network (KMTNet) survey. Our investigation reveals that the light\ncurves of two lensing events, KMT-2021-BLG-2609 and KMT-2022-BLG-0303, exhibit\na similar anomaly, in which short-term positive deviations appear on the sides\nof the low-magnification lensing light curves. To unravel the nature of these\nanomalies, we meticulously analyze each of the lensing events. Our\ninvestigations reveal that these anomalies stem from a shared channel, wherein\nthe source passed near the planetary caustic induced by a planet with projected\nseparations from the host star exceeding the Einstein radius. We find that\ninterpreting the anomaly of KMT-2021-BLG-2609 is complicated by the\n\"inner--outer\" degeneracy, whereas for KMT-2022-BLG-0303, there is no such\nissue despite similar lens-system configurations. In addition to this\ndegeneracy, interpreting the anomaly in KMT-2021-BLG-2609 involves an\nadditional degeneracy between a pair of solutions, in which the source\npartially envelops the caustic and the other three solutions in which the\nsource fully envelopes the caustic. As in an earlier case of this so-called von\nSchlieffen--Cannae degeneracy, the former solutions have substantially higher\nmass ratio. Through Bayesian analyses conducted based on the measured lensing\nobservables of the event time scale and angular Einstein radius, the host of\nKMT-2021-BLG-2609L is determined to be a low-mass star with a mass $\\sim\n0.2~M_\\odot$ in terms of a median posterior value, while the planet's mass\nranges from approximately 0.032 to 0.112 times that of Jupiter, depending on\nthe solutions. For the planetary system KMT-2022-BLG-0303L, it features a\nplanet with a mass of approximately $0.51~M_{\\rm J}$ and a host star with a\nmass of about $0.37~M_\\odot$. In both cases, the lenses are most likely\nsituated in the bulge.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Astrophysics of Galaxies","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"GBvae9AmhLjQeBToRB2Q8peSMUwvcUBcJUd0b01pa5g","pdfSize":"2476410","objectId":"0x54b6a6386d17c9e4ba24dc1649127cc9cba7ccabced06c1684726628fdaad9f7","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
