{"id":"2407.04026","title":"SDSSJ0018-0939: A Clear Signature of Sub-Chandrasekhar Mass Type 1a\n  Supernova","authors":"S. K. Jeena and Projjwal Banerjee","authorsParsed":[["Jeena","S. K.",""],["Banerjee","Projjwal",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 16:10:36 GMT"},{"version":"v2","created":"Fri, 2 Aug 2024 10:04:20 GMT"}],"updateDate":"2024-08-05","timestamp":1720109436000,"abstract":"  Very metal-poor (VMP) stars (${\\rm [Fe/H]}\\leq -2$) that have sub-solar\nvalues of ${\\rm [X/Fe]}$ for $\\alpha$ elements such as Mg, Si, and Ca, are\nreferred to as $\\alpha$-poor VMP stars. They are quite rare among VMP stars and\nare thought to have formed from gas enriched predominantly by a single Type Ia\nsupernovae (SN1a) in contrast to most VMP stars which are $\\alpha$-enhanced and\nusually associated with core-collapse supernovae. The observed abundance\npattern in such stars can provide a direct way to probe the nucleosynthesis in\nindividual SN1a. Although the abundance patterns in some $\\alpha$-poor VMP\nstars have been shown to be consistent with SN1a ejecta, a clear\nnucleosynthetic signature for SN1a resulting from the explosion of a near\nChandrasekhar mass (near-${\\rm M_{Ch}}$) or a sub-Chandrasekhar mass (sub-${\\rm\nM_{Ch}}$) white dwarf, has not been unambiguously detected. We perform a\ndetailed analysis of various formation channels of VMP stars and find that the\n$\\alpha$-poor VMP star SDSSJ0018-0939, which was earlier reported as a star\nwith potential pair-instability supernova origin, provides almost a smoking-gun\nsignature of a sub-${\\rm M_{Ch}}$ SN1a resulting from He detonation. We find\nthat compared to other $\\alpha$-poor VMP stars that were previously identified\nwith SN1a, SDSSJ0018-0939 is the only star that has a clear and unambiguous\nsignature of SN1a. Interestingly, our results are consistent with constraints\non SN1a from recent galactic chemical evolution studies that indicate that\nsub-${\\rm M_{Ch}}$ SN1a account for $\\sim 50\\hbox{--}75\\,\\%$ of all SN1a and\nare possibly the dominant channel in the early Galaxy.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"OxK-5Ru4_s_WT-Ris2NcVOCA1IiMYByCpQ0bJWJpz4Q","pdfSize":"752347"}