{"id":"2407.20487","title":"An empirical consistent redshift bias: A possible direct reproducible\n  observation of Zwicky's TL theory","authors":"Lior Shamir","authorsParsed":[["Shamir","Lior",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 01:15:26 GMT"},{"version":"v2","created":"Wed, 14 Aug 2024 18:00:45 GMT"}],"updateDate":"2024-08-16","timestamp":1722302126000,"abstract":"  Recent advancements have shown tensions between observations and our current\nunderstanding of the Universe. Such observations may include the $H_o$ tension\nand massive galaxies at high redshifts that are older than what traditional\ngalaxy formation models predicted. Since these observations are based on the\nredshift as the primary distance indicator, a bias in the redshift may explain\nthese tensions. While the redshift follows an established model, when applied\nto astronomy it is based on the assumption that the rotational velocity of the\nMilky Way galaxy relative to the observed galaxies has a negligible effect on\nthe redshift. But given the mysterious nature of the physics of galaxy\nrotation, that assumption should be tested. The test is done by comparing the\nredshift of galaxies rotating in the same direction relative to the Milky Way\nto the redshift of galaxies rotating in the opposite direction relative to the\nMilky Way. The results show that the mean redshift of galaxies that rotate in\nthe same direction relative to the Milky Way is higher than the mean redshift\nof galaxies that rotate in the opposite direction. Additionally, the redshift\ndifference becomes larger as the redshift gets higher. The consistency of the\nanalysis was verified by comparing data collected by three different\ntelescopes, annotated using four different methods, released by three different\nresearch teams, and cover both the Northern and Southern ends of the galactic\npole. All datasets are in excellent agreement with each other, showing\nconsistency in the observed redshift bias. Given the \"reproducibility crisis\"\nin science, all datasets used in this study are publicly available, and the\nresults can be easily reproduced. The observation could be a first direct\nempirical reproducible observation for the Zwicky's \"tired-light\" model.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"bZZMlu6xLlshI7XWVTZRkmtMC-N-QGIzkWjAkX6OjEM","pdfSize":"571166"}