{"id":"2407.09427","title":"Flow-Based Generative Emulation of Grids of Stellar Evolutionary Models","authors":"Marc Hon, Yaguang Li, Joel Ong","authorsParsed":[["Hon","Marc",""],["Li","Yaguang",""],["Ong","Joel",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 16:54:17 GMT"}],"updateDate":"2024-07-15","timestamp":1720803257000,"abstract":"  We present a flow-based generative approach to emulate grids of stellar\nevolutionary models. By interpreting the input parameters and output properties\nof these models as multi-dimensional probability distributions, we train\nconditional normalizing flows to learn and predict the complex relationships\nbetween grid inputs and outputs in the form of conditional joint distributions.\nLeveraging the expressive power and versatility of these flows, we showcase\ntheir ability to emulate a variety of evolutionary tracks and isochrones across\na continuous range of input parameters. In addition, we describe a simple\nBayesian approach for estimating stellar parameters using these flows and\ndemonstrate its application to asteroseismic datasets of red giants observed by\nthe Kepler mission. By applying this approach to red giants in open clusters\nNGC 6791 and NGC 6819, we illustrate how large age uncertainties can arise when\nfitting only to global asteroseismic and spectroscopic parameters without prior\ninformation on initial helium abundances and mixing length parameter values. We\nalso conduct inference using the flow at a large scale by determining revised\nestimates of masses and radii for 15,388 field red giants. These estimates show\nimproved agreement with results from existing grid-based modelling, reveal\ndistinct population-level features in the red clump, and suggest that the\nmasses of Kepler red giants previously determined using the corrected\nasteroseismic scaling relations have been overestimated by 5-10%.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"chySYP-KUo3yfgigrukAMMuSXqbUuIMat-ypeSSfGcc","pdfSize":"20903343"}