{"id":"2407.20360","title":"Evaluating Large Language Models for automatic analysis of teacher\n  simulations","authors":"David de-Fitero-Dominguez, Mariano Albaladejo-Gonz\\'alez, Antonio\n  Garcia-Cabot, Eva Garcia-Lopez, Antonio Moreno-Cediel, Erin Barno, Justin\n  Reich","authorsParsed":[["de-Fitero-Dominguez","David",""],["Albaladejo-González","Mariano",""],["Garcia-Cabot","Antonio",""],["Garcia-Lopez","Eva",""],["Moreno-Cediel","Antonio",""],["Barno","Erin",""],["Reich","Justin",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 18:19:17 GMT"}],"updateDate":"2024-07-31","timestamp":1722277157000,"abstract":"  Digital Simulations (DS) provide safe environments where users interact with\nan agent through conversational prompts, providing engaging learning\nexperiences that can be used to train teacher candidates in realistic classroom\nscenarios. These simulations usually include open-ended questions, allowing\nteacher candidates to express their thoughts but complicating an automatic\nresponse analysis. To address this issue, we have evaluated Large Language\nModels (LLMs) to identify characteristics (user behaviors) in the responses of\nDS for teacher education. We evaluated the performance of DeBERTaV3 and Llama\n3, combined with zero-shot, few-shot, and fine-tuning. Our experiments\ndiscovered a significant variation in the LLMs' performance depending on the\ncharacteristic to identify. Additionally, we noted that DeBERTaV3 significantly\nreduced its performance when it had to identify new characteristics. In\ncontrast, Llama 3 performed better than DeBERTaV3 in detecting new\ncharacteristics and showing more stable performance. Therefore, in DS where\nteacher educators need to introduce new characteristics because they change\ndepending on the simulation or the educational objectives, it is more\nrecommended to use Llama 3. These results can guide other researchers in\nintroducing LLMs to provide the highly demanded automatic evaluations in DS.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"SXl6FKYLyoaebQ_5dHMEPpPY6lsPyggqQjQk8CfjVKo","pdfSize":"403983"}