{"id":"2407.08618","title":"Tamil Language Computing: the Present and the Future","authors":"Kengatharaiyer Sarveswaran","authorsParsed":[["Sarveswaran","Kengatharaiyer",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 15:56:02 GMT"},{"version":"v2","created":"Mon, 12 Aug 2024 09:50:12 GMT"}],"updateDate":"2024-08-13","timestamp":1720713362000,"abstract":"  This paper delves into the text processing aspects of Language Computing,\nwhich enables computers to understand, interpret, and generate human language.\nFocusing on tasks such as speech recognition, machine translation, sentiment\nanalysis, text summarization, and language modelling, language computing\nintegrates disciplines including linguistics, computer science, and cognitive\npsychology to create meaningful human-computer interactions. Recent\nadvancements in deep learning have made computers more accessible and capable\nof independent learning and adaptation. In examining the landscape of language\ncomputing, the paper emphasises foundational work like encoding, where Tamil\ntransitioned from ASCII to Unicode, enhancing digital communication. It\ndiscusses the development of computational resources, including raw data,\ndictionaries, glossaries, annotated data, and computational grammars, necessary\nfor effective language processing. The challenges of linguistic annotation, the\ncreation of treebanks, and the training of large language models are also\ncovered, emphasising the need for high-quality, annotated data and advanced\nlanguage models. The paper underscores the importance of building practical\napplications for languages like Tamil to address everyday communication needs,\nhighlighting gaps in current technology. It calls for increased research\ncollaboration, digitization of historical texts, and fostering digital usage to\nensure the comprehensive development of Tamil language processing, ultimately\nenhancing global communication and access to digital services.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"PtNyjG2epw5WQ0JH6cW_Fh0ZuYySeReBUTSQlR3bD7c","pdfSize":"1251078","objectId":"0x17a50a6a74efb4605d47f0da5d7b1f6db64dad0d94a23329b802a7266b95dc57","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
