{"id":"2407.07233","title":"A kinematical study of the launching region of the blueshifted HH 46/47\n  outflow with SINFONI K-band observations","authors":"M. Birney, C. Dougados, E.T. Whelan, B. Nisini, S. Cabrit, Y. Zhang","authorsParsed":[["Birney","M.",""],["Dougados","C.",""],["Whelan","E. T.",""],["Nisini","B.",""],["Cabrit","S.",""],["Zhang","Y.",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 21:14:23 GMT"}],"updateDate":"2024-07-11","timestamp":1720559663000,"abstract":"  Studying outflows is important as they may significantly contribute to\nangular momentum removal from the star/disk system, affecting disk evolution\nand planet formation. To investigate the different outflow components; the\ncollimated jet, wide-angled molecular outflow, and outflow cavity, of the Class\nI HH 46/47 outflow system. We focus on their kinematics. We present Near\nInfrared (NIR) K-band integral field observations of the blue-shifted HH 46/47\noutflow base obtained using VLT/SINFONI with an angular resolution of 0\".81.\nOur analysis focuses on [Fe II], H2 1-0 S(1), and, Br-gamma emission. We employ\na wavelength recalibration technique based on OH telluric lines to probe the\nkinematics of the wide-angled flow with an accuracy of 1 km/s - 3 km/s. A\nvelocity gradient of 10 km/s transverse to the outflow direction is confirmed\nin the wide-angled H2 outflow cavity. The H2 cavity peaks at radial velocities\nof -15 km/s to -30 km/s, and the atomic jet at v = -210 km/s. The outflow\nexhibits a layered structure; the high-velocity [Fe II] and Br-gamma jet is\nsurrounded by a wide-angled H2 outflow cavity, which is in turn nested within\nthe continuum emission and CO molecular outflow. The continuum emission and H2\noutflow cavity are asymmetric with respect to the jet axis. We propose that the\norigin of the asymmetries and the velocity gradient detected in the wide-angled\nH2 cavity, is due to a wide-angled outflow or successive jet bowshocks\nexpanding into an inhomogeneous ambient medium, or the presence of a secondary\noutflow. We eliminate outflow rotation as an exclusive origin of this velocity\ngradient due to large specific angular momenta values, J(r)= 3000 - 4000 km/s\nau calculated from 1\" to 2\" along the outflow. The observations reveal the\ncomplexities inherent in outflow systems, and the risk of attributing\ntransverse velocity gradients solely to rotation.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"5MeWLSjLorVsAMJmFcE2hqVuPL4bgL_E9QW0wu22JJk","pdfSize":"9211921"}
