{"id":"2407.08728","title":"The Potential Impact of Noise Correlation in Next-generation\n  Gravitational Wave Detectors","authors":"Isaac C. F. Wong, Peter T. H. Pang, Milan Wils, Francesco Cireddu,\n  Walter Del Pozzo, Tjonnie G. F. Li","authorsParsed":[["Wong","Isaac C. F.",""],["Pang","Peter T. H.",""],["Wils","Milan",""],["Cireddu","Francesco",""],["Del Pozzo","Walter",""],["Li","Tjonnie G. F.",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 17:57:50 GMT"}],"updateDate":"2024-07-12","timestamp":1720720670000,"abstract":"  Building upon the statistical formulation for parameter estimation in the\npresence of correlated noise proposed by Cireddu et al., we present an initial\nstudy to incorporate the effects of correlated noise into the analyses of\nvarious detector designs' performance. We consider a two L-shaped detector\nconfiguration located in the European Union, and compare the expectation of\nparameter estimation between the non-colocated and a hypothetical colocated\nconfigurations. In our study, we posit the existence of low-frequency\ncorrelated noise within the $5\\text{ Hz}$ to $10\\text{ Hz}$ range for the\ncolocated detector configuration, with a varying degree of correlation. In this\nspecific detector setup, our observations indicate an enhancement in the\nprecision of intrinsic parameter measurements as the degree of correlation\nincreases. This trend suggests that higher degrees of noise correlation may\nbeneficially influence the accuracy of parameter estimation. In particular,\nwhen the noise is highly correlated, the uncertainty on chirp mass decreases by\nup to $30\\%$. The absence of an inter-European baseline does hinder the\nestimation of the extrinsic parameters. However, given a realistic global\nnetwork with the additional detector located in the United States, the\nuncertainty of extrinsic parameters is significantly reduced. This reduction is\nfurther amplified as the degree of noise correlation increases. When noise\ncorrelation exceeds a certain level, the colocated configuration outperforms\nthe non-colocated one, reducing the $90\\%$ credible area of sky location by up\nto $10\\%$. We conclude that noise correlation significantly impacts detector\nperformance, potentially altering both quantitative and qualitative outcomes.\nThus, we recommend including noise correlation in comprehensive assessments of\nthird-generation gravitational wave detector designs.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"gWng6qQ0dl-ovHujTfXHruWGCZh3KKE6N8GUTAr7d-c","pdfSize":"760398"}