{"id":"2407.01686","title":"Everything that can be learned about a causal structure with latent\n  variables by observational and interventional probing schemes","authors":"Marina Maciel Ansanelli, Elie Wolfe, Robert W. Spekkens","authorsParsed":[["Ansanelli","Marina Maciel",""],["Wolfe","Elie",""],["Spekkens","Robert W.",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 18:01:07 GMT"}],"updateDate":"2024-07-03","timestamp":1719856867000,"abstract":"  What types of differences among causal structures with latent variables are\nimpossible to distinguish by statistical data obtained by probing each visible\nvariable? If the probing scheme is simply passive observation, then it is\nwell-known that many different causal structures can realize the same joint\nprobability distributions. Even for the simplest case of two visible variables,\nfor instance, one cannot distinguish between one variable being a causal parent\nof the other and the two variables sharing a latent common cause. However, it\nis possible to distinguish between these two causal structures if we have\nrecourse to more powerful probing schemes, such as the possibility of\nintervening on one of the variables and observing the other. Herein, we address\nthe question of which causal structures remain indistinguishable even given the\nmost informative types of probing schemes on the visible variables. We find\nthat two causal structures remain indistinguishable if and only if they are\nboth associated with the same mDAG structure (as defined by Evans (2016)). We\nalso consider the question of when one causal structure dominates another in\nthe sense that it can realize all of the joint probability distributions that\ncan be realized by the other using a given probing scheme. (Equivalence of\ncausal structures is the special case of mutual dominance.) Finally, we\ninvestigate to what extent one can weaken the probing schemes implemented on\nthe visible variables and still have the same discrimination power as a\nmaximally informative probing scheme.\n","subjects":["Statistics/Machine Learning","Computing Research Repository/Machine Learning","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"aZBbRoO3rocvAcxX15UiEfWC4nkssGFTWy4i9wUApz4","pdfSize":"1892966"}