{"id":"2407.05915","title":"Harnessing Federated Generative Learning for Green and Sustainable\n  Internet of Things","authors":"Yuanhang Qi, M. Shamim Hossain","authorsParsed":[["Qi","Yuanhang",""],["Hossain","M. Shamim",""]],"versions":[{"version":"v1","created":"Tue, 30 Apr 2024 17:15:26 GMT"}],"updateDate":"2024-07-09","timestamp":1714497326000,"abstract":"  The rapid proliferation of devices in the Internet of Things (IoT) has\nushered in a transformative era of data-driven connectivity across various\ndomains. However, this exponential growth has raised pressing concerns about\nenvironmental sustainability and data privacy. In response to these challenges,\nthis paper introduces One-shot Federated Learning (OSFL), an innovative\nparadigm that harmonizes sustainability and machine learning within IoT\necosystems. OSFL revolutionizes the traditional Federated Learning (FL)\nworkflow by condensing multiple iterative communication rounds into a single\noperation, thus significantly reducing energy consumption, communication\noverhead, and latency. This breakthrough is coupled with the strategic\nintegration of generative learning techniques, ensuring robust data privacy\nwhile promoting efficient knowledge sharing among IoT devices. By curtailing\nresource utilization, OSFL aligns seamlessly with the vision of green and\nsustainable IoT, effectively extending device lifespans and mitigating their\nenvironmental footprint. Our research underscores the transformative potential\nof OSFL, poised to reshape the landscape of IoT applications across domains\nsuch as energy-efficient smart cities and groundbreaking healthcare solutions.\nThis contribution marks a pivotal step towards a more responsible, sustainable,\nand technologically advanced future.\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"wb3_g-pYQ7EauP4z23yIEZta87O6PGttioBOsaMvfMU","pdfSize":"776638"}