{"id":"2407.12725","title":"Is Sarcasm Detection A Step-by-Step Reasoning Process in Large Language\n  Models?","authors":"Ben Yao, Yazhou Zhang, Qiuchi Li, Jing Qin","authorsParsed":[["Yao","Ben",""],["Zhang","Yazhou",""],["Li","Qiuchi",""],["Qin","Jing",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 16:42:03 GMT"},{"version":"v2","created":"Sat, 24 Aug 2024 14:44:11 GMT"}],"updateDate":"2024-08-27","timestamp":1721234523000,"abstract":"  Elaborating a series of intermediate reasoning steps significantly improves\nthe ability of large language models (LLMs) to solve complex problems, as such\nsteps would evoke LLMs to think sequentially. However, human sarcasm\nunderstanding is often considered an intuitive and holistic cognitive process,\nin which various linguistic, contextual, and emotional cues are integrated to\nform a comprehensive understanding, in a way that does not necessarily follow a\nstep-by-step fashion. To verify the validity of this argument, we introduce a\nnew prompting framework (called SarcasmCue) containing four sub-methods, viz.\nchain of contradiction (CoC), graph of cues (GoC), bagging of cues (BoC) and\ntensor of cues (ToC), which elicits LLMs to detect human sarcasm by considering\nsequential and non-sequential prompting methods. Through a comprehensive\nempirical comparison on four benchmarks, we highlight three key findings: (1)\nCoC and GoC show superior performance with more advanced models like GPT-4 and\nClaude 3.5, with an improvement of 3.5%. (2) ToC significantly outperforms\nother methods when smaller LLMs are evaluated, boosting the F1 score by 29.7%\nover the best baseline. (3) Our proposed framework consistently pushes the\nstate-of-the-art (i.e., ToT) by 4.2%, 2.0%, 29.7%, and 58.2% in F1 scores\nacross four datasets. This demonstrates the effectiveness and stability of the\nproposed framework.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"EffIolB7e2ScWBAaxnUZblMGeqMR9-PAD2ZxEqx8bSs","pdfSize":"1498413","objectId":"0xdd12c09613daabbbe94bec304548dfd3010af0d52cdef4515dd7c60290cad27d","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
