{"id":"2407.03027","title":"Differentially Processed Optimized Collaborative Rich Text Editor","authors":"Nishtha Jatana, Mansehej Singh, Charu Gupta, Geetika Dhand, Shaily\n  Malik, Pankaj Dadheech, Nagender Aneja, Sandhya Aneja","authorsParsed":[["Jatana","Nishtha",""],["Singh","Mansehej",""],["Gupta","Charu",""],["Dhand","Geetika",""],["Malik","Shaily",""],["Dadheech","Pankaj",""],["Aneja","Nagender",""],["Aneja","Sandhya",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 11:36:58 GMT"}],"updateDate":"2024-07-04","timestamp":1720006618000,"abstract":"  A collaborative real-time text editor is an application that allows multiple\nusers to edit a document simultaneously and merge their contributions\nautomatically. It can be made collaborative by implementing a conflict\nresolution algorithm either on the client side (in peer-to-peer collaboration)\nor on the server side (when using web sockets and a central server to monitor\nstate changes). Although web sockets are ideal for real-time text editors,\nusing multiple collaborative editors on one connection can create problems.\nThis is because a single web connection cannot monitor which user is\ncollaborating on which application state, leading to unnecessary network\nqueries and data being delivered to the wrong state. To address this issue, the\ncurrent solution is to open multiple web socket connections, with one web\nsocket per collaboration application. However, this can add significant\noverhead proportional to the number of apps utilized. In this study, we\ndemonstrate an algorithm that enables using a single web socket for multiple\ncollaborative applications in a collaborative editor. Our method involves\nmodifying the socket's code to track which application's shared state is being\nworked on and by whom. This allows for the simultaneous collaboration of\nmultiple states in real-time, with infinite users, without opening a different\nsocket for each application. Our optimized editor showed an efficiency\nimprovement of over 96% in access time duration. This approach can be\nimplemented in other collaborative editors and web applications with similar\narchitecture to improve performance and eliminate issues arising from network\noverload.\n","subjects":["Computing Research Repository/Multimedia"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"4w3KdYj652x41vyLYyBs8hUkHjjQDNBXzSqgn6Df-8U","pdfSize":"611393"}
