{"id":"2407.15668","title":"SLVideo: A Sign Language Video Moment Retrieval Framework","authors":"Gon\\c{c}alo Vinagre Martins, Afonso Quinaz, Carla Viegas, Sofia\n  Cavaco, Jo\\~ao Magalh\\~aes","authorsParsed":[["Martins","Gonçalo Vinagre",""],["Quinaz","Afonso",""],["Viegas","Carla",""],["Cavaco","Sofia",""],["Magalhães","João",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 14:29:36 GMT"}],"updateDate":"2024-07-23","timestamp":1721658576000,"abstract":"  Sign Language Recognition has been studied and developed throughout the years\nto help the deaf and hard-of-hearing people in their day-to-day lives. These\ntechnologies leverage manual sign recognition algorithms, however, most of them\nlack the recognition of facial expressions, which are also an essential part of\nSign Language as they allow the speaker to add expressiveness to their dialogue\nor even change the meaning of certain manual signs. SLVideo is a video moment\nretrieval software for Sign Language videos with a focus on both hands and\nfacial signs. The system extracts embedding representations for the hand and\nface signs from video frames to capture the language signs in full. This will\nthen allow the user to search for a specific sign language video segment with\ntext queries, or to search by similar sign language videos. To test this\nsystem, a collection of five hours of annotated Sign Language videos is used as\nthe dataset, and the initial results are promising in a zero-shot\nsetting.SLVideo is shown to not only address the problem of searching sign\nlanguage videos but also supports a Sign Language thesaurus with a search by\nsimilarity technique.\n  Project web page: https://novasearch.github.io/SLVideo/\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"tjuF7NbKh2uzXn21tx2GkwfC_6XfkfNWnSjKfolfhMU","pdfSize":"4360474","objectId":"0xe18141d636612f4aa888c772f61c5f5094ce8ba2d870b6c001e123400e341004","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
