{"id":"2407.03883","title":"Protecting Deep Learning Model Copyrights with Adversarial Example-Free\n  Reuse Detection","authors":"Xiaokun Luan, Xiyue Zhang, Jingyi Wang, Meng Sun","authorsParsed":[["Luan","Xiaokun",""],["Zhang","Xiyue",""],["Wang","Jingyi",""],["Sun","Meng",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 12:21:59 GMT"}],"updateDate":"2024-07-08","timestamp":1720095719000,"abstract":"  Model reuse techniques can reduce the resource requirements for training\nhigh-performance deep neural networks (DNNs) by leveraging existing models.\nHowever, unauthorized reuse and replication of DNNs can lead to copyright\ninfringement and economic loss to the model owner. This underscores the need to\nanalyze the reuse relation between DNNs and develop copyright protection\ntechniques to safeguard intellectual property rights. Existing white-box\ntesting-based approaches cannot address the common heterogeneous reuse case\nwhere the model architecture is changed, and DNN fingerprinting approaches\nheavily rely on generating adversarial examples with good transferability,\nwhich is known to be challenging in the black-box setting. To bridge the gap,\nwe propose NFARD, a Neuron Functionality Analysis-based Reuse Detector, which\nonly requires normal test samples to detect reuse relations by measuring the\nmodels' differences on a newly proposed model characterization, i.e., neuron\nfunctionality (NF). A set of NF-based distance metrics is designed to make\nNFARD applicable to both white-box and black-box settings. Moreover, we devise\na linear transformation method to handle heterogeneous reuse cases by\nconstructing the optimal projection matrix for dimension consistency,\nsignificantly extending the application scope of NFARD. To the best of our\nknowledge, this is the first adversarial example-free method that exploits\nneuron functionality for DNN copyright protection. As a side contribution, we\nconstructed a reuse detection benchmark named Reuse Zoo that covers various\npractical reuse techniques and popular datasets. Extensive evaluations on this\ncomprehensive benchmark show that NFARD achieves F1 scores of 0.984 and 1.0 for\ndetecting reuse relationships in black-box and white-box settings,\nrespectively, while generating test suites 2 ~ 99 times faster than previous\nmethods.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Machine Learning","Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_klMVvY47aRfzk335PltTKdsa3xfYwFRfdr45jRIwqw","pdfSize":"629106"}