{"id":"2407.03923","title":"CRiM-GS: Continuous Rigid Motion-Aware Gaussian Splatting from Motion\n  Blur Images","authors":"Junghe Lee, Donghyeong Kim, Dogyoon Lee, Suhwan Cho, Sangyoun Lee","authorsParsed":[["Lee","Junghe",""],["Kim","Donghyeong",""],["Lee","Dogyoon",""],["Cho","Suhwan",""],["Lee","Sangyoun",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 13:37:04 GMT"}],"updateDate":"2024-07-08","timestamp":1720100224000,"abstract":"  Neural radiance fields (NeRFs) have received significant attention due to\ntheir high-quality novel view rendering ability, prompting research to address\nvarious real-world cases. One critical challenge is the camera motion blur\ncaused by camera movement during exposure time, which prevents accurate 3D\nscene reconstruction. In this study, we propose continuous rigid motion-aware\ngaussian splatting (CRiM-GS) to reconstruct accurate 3D scene from blurry\nimages with real-time rendering speed. Considering the actual camera motion\nblurring process, which consists of complex motion patterns, we predict the\ncontinuous movement of the camera based on neural ordinary differential\nequations (ODEs). Specifically, we leverage rigid body transformations to model\nthe camera motion with proper regularization, preserving the shape and size of\nthe object. Furthermore, we introduce a continuous deformable 3D transformation\nin the \\textit{SE(3)} field to adapt the rigid body transformation to\nreal-world problems by ensuring a higher degree of freedom. By revisiting\nfundamental camera theory and employing advanced neural network training\ntechniques, we achieve accurate modeling of continuous camera trajectories. We\nconduct extensive experiments, demonstrating state-of-the-art performance both\nquantitatively and qualitatively on benchmark datasets.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"85o3vNI6WVziAm8GZzjhQ6DoKkLE1mQbEfp-MsfXfEU","pdfSize":"6156378"}