{"id":"2407.10900","title":"Accelerated by Dark Matter: a High-redshift Pathway to Efficient\n  Galaxy-scale Star Formation","authors":"Michael Boylan-Kolchin (The University of Texas at Austin)","authorsParsed":[["Boylan-Kolchin","Michael","","The University of Texas at Austin"]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 16:50:48 GMT"}],"updateDate":"2024-07-16","timestamp":1721062248000,"abstract":"  In the local Universe, star formation is typically inefficient both globally\nand when considered as the fraction of gas converted into stars per local\nfree-fall time. An important exception to this inefficiency is regions of high\ngravitational accelerations $g$, or equivalently surface densities $\\Sigma =\ng/(\\pi\\,G)$, where stellar feedback is insufficient to overcome the\nself-gravity of dense gas clouds. In this paper, I explore whether dark matter\ncan play an analogous role in providing the requisite accelerations on the\nscale of entire galaxies in the early cosmos. The key insight is that\ncharacteristic accelerations in dark matter halos scale as $(1+z)^2$ at fixed\nhalo mass. I show this is sufficient to make dark matter the source of intense\naccelerations that might induce efficient star formation on galactic scales at\ncosmic dawn in sufficiently massive halos. The mass characterizing this regime\nscales as $(1+z)^{-6}$ and corresponds to a relatively constant comoving number\ndensity of $n(>\\!M_{\\rm vir}) \\approx 10^{-4}\\,{\\rm Mpc}^{-3}$ at $z \\gtrsim\n8$. For somewhat rarer halos, this model predicts stellar masses of $M_{\\star}\n\\sim 10^{9}\\,M_{\\odot}$ can form in regions that end up with sizes\n$\\mathcal{O}(100\\,{\\rm pc})$ over $40\\,{\\rm Myr}$ time-scales at $z\\approx\n12-14$; these numbers compare well to measurements for some of the brightest\ngalaxies at that epoch from James Webb Space Telescope (JWST) observations.\nDark matter and standard cosmological evolution may therefore be crucial for\nexplaining the surprisingly high levels of star formation in the early Universe\nrevealed by JWST.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"9xQwOrNnY8SpQPCAk2dYAG7KBgiWRugAdZAGw4ppQ8o","pdfSize":"632484"}