{"id":"2407.17082","title":"A Coupled Diffusion Approximation for Spatiotemporal Hemodynamic\n  Response and Deoxygenated Blood Volume Fraction in Microcirculation","authors":"Maryam Samavaki, Santtu S\\\"oderholm, Arash Zarrin Nia, Sampsa\n  Pursiainen","authorsParsed":[["Samavaki","Maryam",""],["Söderholm","Santtu",""],["Nia","Arash Zarrin",""],["Pursiainen","Sampsa",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 08:18:52 GMT"}],"updateDate":"2024-07-25","timestamp":1721809132000,"abstract":"  Background and Objective: This article concerns a diffusion-based\nmathematical model for analyzing blood flow and oxygen transport within the\ncapillaries, emphasizing its significance in understanding the physiological\nand biochemical dynamics of the cerebrovascular system and brain tissue. The\nfocus of this study is, in particular, on neurovascular coupling and the\nspatiotemporal aspects of blood flow and oxygen transport in microcirculation.\nMethods: By adopting a coupled modelling approach that integrates the\nhemodynamic response function (HRF) with Fick's law and the Navier-Stokes\nequations (NSEs), we provide a computational framework for the diffusion-driven\ntransport of deoxygenated and total blood volume fractions (DBV and TBV),\nessential for understanding blood oxygenation level-dependent functional\nmagnetic resonance imaging (fMRI) and near-infrared spectroscopy (NIRS)\napplications. Results: The applicability of the model is further demonstrated\nthrough numerical experiments utilizing a 7 Tesla magnetic resonance imaging\n(MRI) dataset for head segmentation, which facilitates the differentiation of\narterial blood vessels and various brain tissue compartments. By simulating\nhemodynamical responses and analyzing their impact on volumetric DBV and TBV,\nthis study offers valuable insights into spatiotemporal modelling of brain\ntissue and blood flow. Conclusions: By integrating spatiotemporal modelling\nwithin a realistic head model derived from high-resolution 7 Tesla-MRI, we\nanalyze the complex interplay between blood flow, oxygen transport, and brain\ntissue dynamics. This inclusion of a realistic head model not only enriches the\naccuracy of our simulations but is also beneficial for understanding the\nphysiological and hemodynamic responses within the human brain.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis","Mathematics/Analysis of PDEs"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"r0ECvcHkp9-p6hdOrQbWaG6sMWgV5d3_hD-cMJcVGoQ","pdfSize":"2206568","objectId":"0x4c0c79df4020c3b38b05379e075bd6e68930da8f65e04644286bbe432feb41a3","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
