{"id":"2407.13949","title":"BRSR-OpGAN: Blind Radar Signal Restoration using Operational Generative\n  Adversarial Network","authors":"Muhammad Uzair Zahid, Serkan Kiranyaz, Alper Yildirim, and Moncef\n  Gabbouj","authorsParsed":[["Zahid","Muhammad Uzair",""],["Kiranyaz","Serkan",""],["Yildirim","Alper",""],["Gabbouj","Moncef",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 23:55:48 GMT"}],"updateDate":"2024-07-22","timestamp":1721346948000,"abstract":"  Objective: Many studies on radar signal restoration in the literature focus\non isolated restoration problems, such as denoising over a certain type of\nnoise, while ignoring other types of artifacts. Additionally, these approaches\nusually assume a noisy environment with a limited set of fixed signal-to-noise\nratio (SNR) levels. However, real-world radar signals are often corrupted by a\nblend of artifacts, including but not limited to unwanted echo, sensor noise,\nintentional jamming, and interference, each of which can vary in type,\nseverity, and duration. This study introduces Blind Radar Signal Restoration\nusing an Operational Generative Adversarial Network (BRSR-OpGAN), which uses a\ndual domain loss in the temporal and spectral domains. This approach is\ndesigned to improve the quality of radar signals, regardless of the diversity\nand intensity of the corruption. Methods: The BRSR-OpGAN utilizes 1D\nOperational GANs, which use a generative neuron model specifically optimized\nfor blind restoration of corrupted radar signals. This approach leverages GANs'\nflexibility to adapt dynamically to a wide range of artifact characteristics.\nResults: The proposed approach has been extensively evaluated using a\nwell-established baseline and a newly curated extended dataset called the Blind\nRadar Signal Restoration (BRSR) dataset. This dataset was designed to simulate\nreal-world conditions and includes a variety of artifacts, each varying in\nseverity. The evaluation shows an average SNR improvement over 15.1 dB and 14.3\ndB for the baseline and BRSR datasets, respectively. Finally, even on\nresource-constrained platforms, the proposed approach can be applied in\nreal-time.\n","subjects":["Computing Research Repository/Machine Learning","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"YqJobSLCtvR9NHRWq5EFeLhPYPJ9vM0ke9znSm_HLmA","pdfSize":"17200568"}