{"id":"2407.00137","title":"Understanding and Modeling the Dynamics of Storm-time Atmospheric\n  Neutral Density using Random Forests","authors":"Kyle R. Murphy, Alexa J. Halford, Vivian Liu, Jeffery Klenzing,\n  Jonathon Smith, Katherine Garcia-Sage, Joshua Pettit, I. Jonathan Rae","authorsParsed":[["Murphy","Kyle R.",""],["Halford","Alexa J.",""],["Liu","Vivian",""],["Klenzing","Jeffery",""],["Smith","Jonathon",""],["Garcia-Sage","Katherine",""],["Pettit","Joshua",""],["Rae","I. Jonathan",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 14:05:47 GMT"}],"updateDate":"2024-07-02","timestamp":1719583547000,"abstract":"  Atmospheric neutral density is a crucial component to accurately predict and\ntrack the motion of satellites. During periods of elevated solar and\ngeomagnetic activity atmospheric neutral density becomes highly variable and\ndynamic. This variability and enhanced dynamics make it difficult to accurately\nmodel neutral density leading to increased errors which propagate from neutral\ndensity models through to orbit propagation models. In this paper we\ninvestigate the dynamics of neutral density during geomagnetic storms. We use a\ncombination of solar and geomagnetic variables to develop three Random Forest\nmachine learning models of neutral density. These models are based on (1) slow\nsolar indices, (2) high cadence solar irradiance, and (3) combined high-cadence\nsolar irradiance and geomagnetic indices. Each model is validated using an\nout-of-sample dataset using analysis of residuals and typical metrics. During\nquiet-times, all three models perform well; however, during geomagnetic storms,\nthe combined high cadence solar irradiance/geomagnetic model performs\nsignificantly better than the models based solely on solar activity. The\ncombined model capturing an additional 10\\% in the variability of density and\nhaving an error up to six times smaller during geomagnetic storms then the\nsolar models. Overall, this work demonstrates the importance of including\ngeomagnetic activity in the modeling of atmospheric density and serves as a\nproof of concept for using machine learning algorithms to model, and in the\nfuture forecast atmospheric density for operational use.\n","subjects":["Physics/Space Physics","Physics/Atmospheric and Oceanic Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"eHSz2HtiHpaT4Vp5ViAegkaCAm_4cuPyBthE34i01VU","pdfSize":"1197074"}