{"id":"2407.18879","title":"Utilizing TTS Synthesized Data for Efficient Development of Keyword\n  Spotting Model","authors":"Hyun Jin Park, Dhruuv Agarwal, Neng Chen, Rentao Sun, Kurt Partridge,\n  Justin Chen, Harry Zhang, Pai Zhu, Jacob Bartel, Kyle Kastner, Gary Wang,\n  Andrew Rosenberg, Quan Wang","authorsParsed":[["Park","Hyun Jin",""],["Agarwal","Dhruuv",""],["Chen","Neng",""],["Sun","Rentao",""],["Partridge","Kurt",""],["Chen","Justin",""],["Zhang","Harry",""],["Zhu","Pai",""],["Bartel","Jacob",""],["Kastner","Kyle",""],["Wang","Gary",""],["Rosenberg","Andrew",""],["Wang","Quan",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 17:24:50 GMT"}],"updateDate":"2024-07-29","timestamp":1722014690000,"abstract":"  This paper explores the use of TTS synthesized training data for KWS (keyword\nspotting) task while minimizing development cost and time. Keyword spotting\nmodels require a huge amount of training data to be accurate, and obtaining\nsuch training data can be costly. In the current state of the art, TTS models\ncan generate large amounts of natural-sounding data, which can help reducing\ncost and time for KWS model development. Still, TTS generated data can be\nlacking diversity compared to real data. To pursue maximizing KWS model\naccuracy under the constraint of limited resources and current TTS capability,\nwe explored various strategies to mix TTS data and real human speech data, with\na focus on minimizing real data use and maximizing diversity of TTS output. Our\nexperimental results indicate that relatively small amounts of real audio data\nwith speaker diversity (100 speakers, 2k utterances) and large amounts of TTS\nsynthesized data can achieve reasonably high accuracy (within 3x error rate of\nbaseline), compared to the baseline (trained with 3.8M real positive\nutterances).\n","subjects":["Computing Research Repository/Sound","Computing Research Repository/Machine Learning","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"bIGSiAClBHDSjjLEb0MuuL9kP1vjaR_ZBAJRuLkiaeQ","pdfSize":"334858","objectId":"0x9946642b674d2a1786b8402bc2d5234aa897ac65091ee3ecae9ce2600902375b","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
