{"id":"2407.08187","title":"ScaleDepth: Decomposing Metric Depth Estimation into Scale Prediction\n  and Relative Depth Estimation","authors":"Ruijie Zhu, Chuxin Wang, Ziyang Song, Li Liu, Tianzhu Zhang, Yongdong\n  Zhang","authorsParsed":[["Zhu","Ruijie",""],["Wang","Chuxin",""],["Song","Ziyang",""],["Liu","Li",""],["Zhang","Tianzhu",""],["Zhang","Yongdong",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 05:11:56 GMT"}],"updateDate":"2024-07-12","timestamp":1720674716000,"abstract":"  Estimating depth from a single image is a challenging visual task. Compared\nto relative depth estimation, metric depth estimation attracts more attention\ndue to its practical physical significance and critical applications in\nreal-life scenarios. However, existing metric depth estimation methods are\ntypically trained on specific datasets with similar scenes, facing challenges\nin generalizing across scenes with significant scale variations. To address\nthis challenge, we propose a novel monocular depth estimation method called\nScaleDepth. Our method decomposes metric depth into scene scale and relative\ndepth, and predicts them through a semantic-aware scale prediction (SASP)\nmodule and an adaptive relative depth estimation (ARDE) module, respectively.\nThe proposed ScaleDepth enjoys several merits. First, the SASP module can\nimplicitly combine structural and semantic features of the images to predict\nprecise scene scales. Second, the ARDE module can adaptively estimate the\nrelative depth distribution of each image within a normalized depth space.\nThird, our method achieves metric depth estimation for both indoor and outdoor\nscenes in a unified framework, without the need for setting the depth range or\nfine-tuning model. Extensive experiments demonstrate that our method attains\nstate-of-the-art performance across indoor, outdoor, unconstrained, and unseen\nscenes. Project page: https://ruijiezhu94.github.io/ScaleDepth\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"lmCssC9580b1a2jnipCVh2mHsC3v-3_YXf5pVim15Nk","pdfSize":"12781163"}