{"id":"2407.14831","title":"Toward Efficient Convolutional Neural Networks With Structured Ternary\n  Patterns","authors":"Christos Kyrkou","authorsParsed":[["Kyrkou","Christos",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 10:18:42 GMT"}],"updateDate":"2024-07-23","timestamp":1721470722000,"abstract":"  High-efficiency deep learning (DL) models are necessary not only to\nfacilitate their use in devices with limited resources but also to improve\nresources required for training. Convolutional neural networks (ConvNets)\ntypically exert severe demands on local device resources and this\nconventionally limits their adoption within mobile and embedded platforms. This\nbrief presents work toward utilizing static convolutional filters generated\nfrom the space of local binary patterns (LBPs) and Haar features to design\nefficient ConvNet architectures. These are referred to as Structured Ternary\nPatterns (STePs) and can be generated during network initialization in a\nsystematic way instead of having learnable weight parameters thus reducing the\ntotal weight updates. The ternary values require significantly less storage and\nwith the appropriate low-level implementation, can also lead to inference\nimprovements. The proposed approach is validated using four image\nclassification datasets, demonstrating that common network backbones can be\nmade more efficient and provide competitive results. It is also demonstrated\nthat it is possible to generate completely custom STeP-based networks that\nprovide good trade-offs for on-device applications such as unmanned aerial\nvehicle (UAV)-based aerial vehicle detection. The experimental results show\nthat the proposed method maintains high detection accuracy while reducing the\ntrainable parameters by 40-80%. This work motivates further research toward\ngood priors for non-learnable weights that can make DL architectures more\nefficient without having to alter the network during or after training.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"A4mmrUX9c5U8VV5aFIOuc1hStL9V-n0YtrvGKSaPM3A","pdfSize":"2514170"}