{"id":"2407.20903","title":"A first systematic characterization of cataclysmic variables in\n  SRG/eROSITA surveys","authors":"Axel Schwope, Kira Knauff, Jan Kurpas, Mara Salvato, Beate Stelzer,\n  Laurent St\\\"utz, Dusan Tub\\'in-Arenas","authorsParsed":[["Schwope","Axel",""],["Knauff","Kira",""],["Kurpas","Jan",""],["Salvato","Mara",""],["Stelzer","Beate",""],["Stütz","Laurent",""],["Tubín-Arenas","Dusan",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 15:24:28 GMT"}],"updateDate":"2024-07-31","timestamp":1722353068000,"abstract":"  (abridged) We present an account of known cataclysmic variables (CVs) that\nwere detected as X-ray sources in eROSITA X-ray surveys and have Gaia DR3\ncounterparts. We address standard CVs with main sequence donors and white\ndwarfs accreting via Roche-lobe overflow (RLOF) and related objects, the double\ndegenerates (DDs), and the symbiotic stars (SySts). We discern between\nnonmagnetic (dwarf novae and nova-like objects) and magnetic CVs (polars and\nintermediate polars (IPs)). In the publically available eROSITA catalog from\nthe recent DR1, typically 65\\% of known cataloged and classified CVs are\ndetected. This fraction rises to over 90\\% if the stack of all \\ero X-ray\nsurveys (called S45 in this paper) is considered and the search volume is\nrestricted to a radius of 500\\,pc. We examine the various classes of CVs in\nvarious diagnostic diagrams relating X-ray and optical properties (luminosity,\nabsolute magnitude, color, X-ray spectral hardness, and optical variability)\nand establish their average class properties. We derive spectral properties for\nthe 22 brightest polars and confirm an increase in the ratio of soft to hard\nX-rays with increasing magnetic field in the accretion region. We report three\nnew soft IPs and present a spectral analysis of all soft IPs. Their blackbody\ntemperatures agree well with published values. The DDs represent the bluest and\nfaintest subcategory but reach the same identification fraction as the standard\nCVs. The SySts are the most distant systems; only 20 (13\\%) were detected as\nX-ray sources in S45, and 7 of those are first-time detections. We investigate\ntheir mean properties using an upper limit on the flux of the nondetected CVs.\nTheir X-ray nondetection is indeed a distance effect.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"oWhGX34kl4mnBPlzAUxsjcxZ51iyRm87K2pL5YnLrrI","pdfSize":"1741945"}