{"id":"2407.06165","title":"Tumor likelihood estimation on MRI prostate data by utilizing k-Space\n  information","authors":"M. Rempe, F. H\\\"orst, C. Seibold, B. Hadaschik, M. Schlimbach, J.\n  Egger, K. Kr\\\"oninger, F. Breuer, M. Blaimer, J. Kleesiek","authorsParsed":[["Rempe","M.",""],["Hörst","F.",""],["Seibold","C.",""],["Hadaschik","B.",""],["Schlimbach","M.",""],["Egger","J.",""],["Kröninger","K.",""],["Breuer","F.",""],["Blaimer","M.",""],["Kleesiek","J.",""]],"versions":[{"version":"v1","created":"Tue, 4 Jun 2024 12:05:20 GMT"}],"updateDate":"2024-07-09","timestamp":1717502720000,"abstract":"  We present a novel preprocessing and prediction pipeline for the\nclassification of magnetic resonance imaging (MRI) that takes advantage of the\ninformation rich complex valued k-Space. Using a publicly available MRI raw\ndataset with 312 subject and a total of 9508 slices, we show the advantage of\nutilizing the k-Space for better prostate cancer likelihood estimation in\ncomparison to just using the magnitudinal information in the image domain, with\nan AUROC of $86.1\\%\\pm1.8\\%$. Additionally, by using high undersampling rates\nand a simple principal component analysis (PCA) for coil compression, we reduce\nthe time needed for reconstruction by avoiding the time intensive GRAPPA\nreconstruction algorithm. By using digital undersampling for our experiments,\nwe show that scanning and reconstruction time could be reduced. Even with an\nundersampling factor of 16, our approach achieves meaningful results, with an\nAUROC of $71.4\\%\\pm2.9\\%$, using the PCA coil combination and taking into\naccount the k-Space information. With this study, we were able to show the\nfeasibility of preserving phase and k-Space information, with consistent\nresults. Besides preserving valuable information for further diagnostics, this\napproach can work without the time intensive ADC and reconstruction\ncalculations, greatly reducing the post processing, as well as potential\nscanning time, increasing patient comfort and allowing a close to real-time\nprediction.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Physics/Medical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"eyzbhhUPNPZP0hnZs13ZNyqSJnru983EoVIbiBAvBdc","pdfSize":"6633087"}