{"id":"2407.15532","title":"Large-scale Time-Varying Portfolio Optimisation using Graph Attention\n  Networks","authors":"Kamesh Korangi, Christophe Mues and Cristi\\'an Bravo","authorsParsed":[["Korangi","Kamesh",""],["Mues","Christophe",""],["Bravo","Cristián",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 10:50:47 GMT"}],"updateDate":"2024-07-23","timestamp":1721645447000,"abstract":"  Apart from assessing individual asset performance, investors in financial\nmarkets also need to consider how a set of firms performs collectively as a\nportfolio. Whereas traditional Markowitz-based mean-variance portfolios are\nwidespread, network-based optimisation techniques have built upon these\ndevelopments. However, most studies do not contain firms at risk of default and\nremove any firms that drop off indices over a certain time. This is the first\nstudy to incorporate risky firms and use all the firms in portfolio\noptimisation. We propose and empirically test a novel method that leverages\nGraph Attention networks (GATs), a subclass of Graph Neural Networks (GNNs).\nGNNs, as deep learning-based models, can exploit network data to uncover\nnonlinear relationships. Their ability to handle high-dimensional features and\naccommodate customised layers for specific purposes makes them particularly\nappealing for large-scale problems such as mid- and small-cap portfolio\noptimization. This study utilises 30 years of data on mid-cap firms, creating\ngraphs of firms using distance correlation and the Triangulated Maximally\nFiltered Graph approach. These graphs are the inputs to a GAT model that we\ntrain using custom layers which impose weight and allocation constraints and a\nloss function derived from the Sharpe ratio, thus directly maximising portfolio\nrisk-adjusted returns. This new model is benchmarked against a network\ncharacteristic-based portfolio, a mean variance-based portfolio, and an\nequal-weighted portfolio. The results show that the portfolio produced by the\nGAT-based model outperforms all benchmarks and is consistently superior to\nother strategies over a long period while also being informative of market\ndynamics.\n","subjects":["Quantitative Finance/Portfolio Management","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Social and Information Networks","Quantitative Finance/Risk Management","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"5CoNTlytjkKvxs2AFhYIPtH4jSx79QfwGhVBlfFKGvg","pdfSize":"9739687"}