{"id":"2407.15551","title":"MoXIchecker: An Extensible Model Checker for MoXI","authors":"Salih Ates, Dirk Beyer, Po-Chun Chien, and Nian-Ze Lee","authorsParsed":[["Ates","Salih",""],["Beyer","Dirk",""],["Chien","Po-Chun",""],["Lee","Nian-Ze",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 11:26:04 GMT"}],"updateDate":"2024-07-23","timestamp":1721647564000,"abstract":"  MoXI is a new intermediate verification language introduced in 2024 to\npromote the standardization and open-source implementations for symbolic model\nchecking by extending the SMT-LIB 2 language with constructs to define\nstate-transition systems. The tool suite of MoXI provides a translator from\nMoXI to Btor2, which is a lower-level intermediate language for hardware\nverification, and a translation-based model checker, which invokes mature\nhardware model checkers for Btor2 to analyze the translated verification tasks.\nThe extensibility of such a translation-based model checker is restricted\nbecause more complex theories, such as integer or real arithmetics, cannot be\nprecisely expressed with bit-vectors of fixed lengths in Btor2. We present\nMoXIchecker, the first model checker that solves MoXI verification tasks\ndirectly. Instead of translating MoXI to lower-level languages, MoXIchecker\nuses the solver-agnostic library PySMT for SMT solvers as backend for its\nverification algorithms. MoXIchecker is extensible because it accommodates\nverification tasks involving more complex theories, not limited by lower-level\nlanguages, facilitates the implementation of new algorithms, and is\nsolver-agnostic by using the API of PySMT. In our evaluation, MoXIchecker\nuniquely solved tasks that use integer or real arithmetics, and achieved a\ncomparable performance against the translation-based model checker from the\nMoXI tool suite.\n","subjects":["Computing Research Repository/Software Engineering","Computing Research Repository/Programming Languages"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"DXXHuqdwl-aT3thECbCoNzAq7z316gx442-VlBlwyZ8","pdfSize":"793329"}