{"id":"2407.18986","title":"TERIME: An improved RIME algorithm with enhanced exploration and\n  exploitation for robust parameter extraction of photovoltaic models","authors":"Shi-Shun Chen, Yu-Tong Jiang, Wen-Bin Chen, Xiao-Yang Li","authorsParsed":[["Chen","Shi-Shun",""],["Jiang","Yu-Tong",""],["Chen","Wen-Bin",""],["Li","Xiao-Yang",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 02:47:14 GMT"},{"version":"v2","created":"Thu, 1 Aug 2024 15:59:39 GMT"}],"updateDate":"2024-08-02","timestamp":1721875634000,"abstract":"  Parameter extraction of photovoltaic (PV) models is crucial for the planning,\noptimization, and control of PV systems. Although some methods using\nmeta-heuristic algorithms have been proposed to determine these parameters, the\nrobustness of solutions obtained by these methods faces great challenges when\nthe complexity of the PV model increases. The unstable results will affect the\nreliable operation and maintenance strategies of PV systems. In response to\nthis challenge, an improved RIME algorithm with enhanced exploration and\nexploitation is proposed for robust and accurate parameter identification for\nvarious PV models. Specifically, the differential evolution mutation operator\nis integrated in the exploration phase to enhance the population diversity.\nMeanwhile, a new exploitation strategy incorporating randomization and\nneighborhood strategies simultaneously is developed to maintain the balance of\nexploitation width and depth. The improved RIME algorithm is applied to\nestimate the optimal parameters of the single-diode model (SDM), double-diode\nmodel (DDM), and triple-diode model (TDM) combined with the Lambert-W function\nfor three PV cell and module types including RTC France, Photo Watt-PWP 201 and\nS75. According to the statistical analysis in 100 runs, the TEIMRE achieves\nmore accurate and robust parameter estimations than other techniques to various\nPV models in varying environmental conditions. All of our source codes are\npublicly available at https://github.com/dirge1/TERIME.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"sjwFr8tK-CivuhbO4YXp8dJAKpmjEQjeVhWbeC4fSAw","pdfSize":"3904119","objectId":"0xf4b6de9c4e83e17faf85e8f78283d8937ebd6091fe7f4c566b0baae16346f30b","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
