{"id":"2407.20313","title":"Observations of Extremely Metal-Poor O Stars: Weak Winds and Constraints\n  for Evolution Models","authors":"O. Grace Telford, John Chisholm, Andreas A. C. Sander, Varsha\n  Ramachandran, Kristen B. W. McQuinn, Danielle A. Berg","authorsParsed":[["Telford","O. Grace",""],["Chisholm","John",""],["Sander","Andreas A. C.",""],["Ramachandran","Varsha",""],["McQuinn","Kristen B. W.",""],["Berg","Danielle A.",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 18:00:00 GMT"}],"updateDate":"2024-07-31","timestamp":1722276000000,"abstract":"  Metal-poor massive stars drive the evolution of low-mass galaxies, both\nlocally and at high redshift. However, quantifying the feedback they impart to\ntheir local surroundings remains uncertain because models of stellar evolution,\nmass loss, and ionizing spectra are unconstrained by observations below 20%\nsolar metallicity ($Z_\\odot$). We present new Keck Cosmic Web Imager optical\nspectroscopy of three O stars in the nearby dwarf galaxies Leo P, Sextans A,\nand WLM, which have gas-phase oxygen abundances of 3-14% $Z_\\odot$. To\ncharacterize their fundamental stellar properties and radiation-driven winds,\nwe fit PoWR atmosphere models to the optical spectra simultaneously with Hubble\nSpace Telescope far-ultraviolet (FUV) spectra and multi-wavelength photometry.\nWe find that all three stars have effective temperatures consistent with their\nspectral types and surface gravities typical of main-sequence dwarf stars. Yet,\nthe combination of those inferred parameters and luminosity for the two\nlower-$Z$ stars is not reproduced by stellar evolution models, even those that\ninclude rotation or binary interactions. The scenario of multiple-star systems\nis difficult to reconcile with all available data, suggesting that these\nobservations pose a challenge to current evolution models. We highlight the\nimportance of validating the relationship between stellar mass, temperature,\nand luminosity at very low $Z$ for accurate estimates of ionizing photon\nproduction and spectral hardness. Finally, all three stars' FUV wind profiles\nreveal low mass-loss rates and terminal wind velocities in tension with\nexpectations from widely adopted radiation-driven wind models. These results\nprovide empirical benchmarks for future development of mass-loss and evolution\nmodels for metal-poor stellar populations.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"4jQO2P4Cakxhax5WtJ_SPRNsc-1eIekDHV40LmYhWAM","pdfSize":"3176915"}