{"id":"2407.21701","title":"Private and Robust States for Distributed Quantum Sensing","authors":"Lu\\'is Bugalho, Majid Hassani, Yasser Omar and Damian Markham","authorsParsed":[["Bugalho","Luís",""],["Hassani","Majid",""],["Omar","Yasser",""],["Markham","Damian",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 15:46:50 GMT"}],"updateDate":"2024-08-01","timestamp":1722440810000,"abstract":"  Distributed quantum sensing enables the estimation of multiple parameters\nencoded in spatially separated probes. While traditional quantum sensing is\noften focused on estimating a single parameter with maximum precision,\ndistributed quantum sensing seeks to estimate some function of multiple\nparameters that are only locally accessible for each party involved. In such\nsettings it is natural to not want to give away more information than is\nnecessary. To address this, we use the concept of privacy with respect to a\nfunction, ensuring that only information about the target function is available\nto all the parties, and no other information. We define a measure of privacy\n(essentially how close we are to this condition being satisfied), and show it\nsatisfies a set of naturally desirable properties of such a measure. Using this\nprivacy measure, we identify and construct entangled resources states that\nensure privacy for a given function under different resource distributions and\nencoding dynamics, characterized by Hamiltonian evolution. For separable and\nparallel Hamiltonians, we prove that the GHZ state is the only private state\nfor certain linear functions, with the minimum amount of required resources, up\nto SLOCC. Recognizing the vulnerability of this state to particle loss, we\ncreate families of private states, that remain robust even against loss of\nqubits, by incorporating additional resources. We then extend our findings to\ndifferent resource distribution scenarios and Hamiltonians, resulting in a\ncomprehensive set of private and robust states for distributed quantum\nestimation. These results advance the understanding of privacy and robustness\nin multi-parameter quantum sensing.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"atkChbOjX8zYOSDGK-F_VwR5D3bObKNvc46w9SU2328","pdfSize":"1084808"}