{"id":"2407.10754","title":"An Autonomous Drone Swarm for Detecting and Tracking Anomalies among\n  Dense Vegetation","authors":"Rakesh John Amala Arokia Nathan, Sigrid Strand, Daniel Mehrwald,\n  Dmitriy Shutin, Oliver Bimber","authorsParsed":[["Nathan","Rakesh John Amala Arokia",""],["Strand","Sigrid",""],["Mehrwald","Daniel",""],["Shutin","Dmitriy",""],["Bimber","Oliver",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 14:31:21 GMT"}],"updateDate":"2024-07-16","timestamp":1721053881000,"abstract":"  Swarms of drones offer an increased sensing aperture, and having them mimic\nbehaviors of natural swarms enhances sampling by adapting the aperture to local\nconditions. We demonstrate that such an approach makes detecting and tracking\nheavily occluded targets practically feasible. While object classification\napplied to conventional aerial images generalizes poorly the randomness of\nocclusion and is therefore inefficient even under lightly occluded conditions,\nanomaly detection applied to synthetic aperture integral images is robust for\ndense vegetation, such as forests, and is independent of pre-trained classes.\nOur autonomous swarm searches the environment for occurrences of the unknown or\nunexpected, tracking them while continuously adapting its sampling pattern to\noptimize for local viewing conditions. In our real-life field experiments with\na swarm of six drones, we achieved an average positional accuracy of 0.39 m\nwith an average precision of 93.2% and an average recall of 95.9%. Here,\nadapted particle swarm optimization considers detection confidences and\npredicted target appearance. We show that sensor noise can effectively be\nincluded in the synthetic aperture image integration process, removing the need\nfor a computationally costly optimization of high-dimensional parameter spaces.\nFinally, we present a complete hard- and software framework that supports\nlow-latency transmission (approx. 80 ms round-trip time) and fast processing\n(approx. 600 ms per formation step) of extensive (70-120 Mbit/s) video and\ntelemetry data, and swarm control for swarms of up to ten drones.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"mX57DhjvOnnfFj6JgQixbktlBQxsaoKnKBvCR5Db4Z0","pdfSize":"2450913"}