{"id":"2407.14600","title":"Conformal line defects at finite temperature","authors":"Julien Barrat, Bartomeu Fiol, Enrico Marchetto, Alessio Miscioscia and\n  Elli Pomoni","authorsParsed":[["Barrat","Julien",""],["Fiol","Bartomeu",""],["Marchetto","Enrico",""],["Miscioscia","Alessio",""],["Pomoni","Elli",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 18:00:10 GMT"}],"updateDate":"2024-07-23","timestamp":1721412010000,"abstract":"  We study conformal field theories at finite temperature in the presence of a\ntemporal conformal line defect, wrapping the thermal circle, akin to a Polyakov\nloop in gauge theories. Although several symmetries of the conformal group are\nbroken, the model can still be highly constrained from its features at\nzero-temperature. In this work we show that the defect and bulk one and\ntwo-point correlators can be written as functions of zero-temperature data and\nthermal one-point functions (defect and bulk). The defect one-point functions\nare new data and they are induced by thermal effects of the bulk. For this new\nset of data we derive novel sum rules and establish a bootstrap problem for the\nthermal defect one-point functions from the KMS condition. We also comment on\nthe behaviour of operators with large scaling dimensions. Additionally, we\nrelate the free energy and entropy density to the OPE data through the\none-point function of the stress-energy tensor. Our formalism is validated\nthrough analytical computations in generalized free scalar field theory, and we\npresent new predictions for the O(N) model with a magnetic impurity in the\n$\\varepsilon$-expansion and the large N limit.\n","subjects":["Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8AtS9ZxfEy5wqyOV-AV4o_ETxVReFUwylYG-E6KRysk","pdfSize":"710088","objectId":"0x1dbef9d9a071e383e29f8b657ce8fb76ead9fa0c1a305bac921d0057234b0b7b","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
