{"id":"2407.16859","title":"Role of magnetic arcades in explaining the puzzle of the gamma-ray\n  emission from the solar disk","authors":"Eleonora Puzzoni, Federico Fraschetti, J\\'ozsef K\\'ota, Joe Giacalone","authorsParsed":[["Puzzoni","Eleonora",""],["Fraschetti","Federico",""],["Kóta","József",""],["Giacalone","Joe",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 21:59:04 GMT"}],"updateDate":"2024-07-25","timestamp":1721771944000,"abstract":"  The interpretation of gamma-ray emission originating from the solar disk\n($0.5^\\circ$ in angular size) as due to the interaction of Galactic Cosmic Rays\n(GCRs) with the solar atmosphere has remained a central challenge in solar\nphysics. After the seminal work by Seckel, Stanev, and Gaisser (SSG91) based on\nGCRs magnetic mirroring, discrepancies between models and observations persist,\nindicating the need for a novel approach. The present work focuses on exploring\nthe impact of a closed magnetic field geometry in the low photosphere on the\nobserved gamma-ray flux. We track numerically with the PLUTO code the\ntrajectories of test-particle protons within a static $\\sim 20$ Mm scale height\nmagnetic arcade adjacent to jets. By making use of numerical vertical density\nprofiles we inject particles at distinct chromospheric/photospheric altitudes,\nmimicking the migration of GCRs from neighboring flux tubes into closed\narcades. Remarkably, our model reproduces a flat gamma-ray spectrum below $\\sim\n33$ GeV, a nearly-isotropic emission at $\\sim 10$ GeV, both consistent with\nFermi-LAT observations, and a near-limb emission at $\\sim 1$ TeV. Our model can\nalso reproduce the flux-drop detected by HAWC ($\\sim 1$ TeV). Finally, we argue\nthat the spectral dip observed at $\\sim$ 40 GeV may result from the flux\nsuppression at low energy due to the cross-field diffusion, which would produce\na cutoff. These findings underscore the pivotal role of closed magnetic field\nstructures in shaping the solar disk gamma-ray emission.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"vg8wm-n1XclOaqbkMDdjkEHfkaBlXYaR10uhJQoiLJI","pdfSize":"2168637","objectId":"0xcaf8ee5e3230b2f07c3a483bde34fc842d20893daf2823eabae8abda9288403f","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
