{"id":"2407.00706","title":"Sum-of-norms regularized Nonnegative Matrix Factorization","authors":"Andersen Ang, Waqas Bin Hamed, Hans De Sterck","authorsParsed":[["Ang","Andersen",""],["Hamed","Waqas Bin",""],["De Sterck","Hans",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 14:16:27 GMT"}],"updateDate":"2024-07-02","timestamp":1719756987000,"abstract":"  When applying nonnegative matrix factorization (NMF), generally the rank\nparameter is unknown. Such rank in NMF, called the nonnegative rank, is usually\nestimated heuristically since computing the exact value of it is NP-hard. In\nthis work, we propose an approximation method to estimate such rank while\nsolving NMF on-the-fly. We use sum-of-norm (SON), a group-lasso structure that\nencourages pairwise similarity, to reduce the rank of a factor matrix where the\nrank is overestimated at the beginning. On various datasets, SON-NMF is able to\nreveal the correct nonnegative rank of the data without any prior knowledge nor\ntuning.\n  SON-NMF is a nonconvx nonsmmoth non-separable non-proximable problem, solving\nit is nontrivial. First, as rank estimation in NMF is NP-hard, the proposed\napproach does not enjoy a lower computational complexity. Using a\ngraph-theoretic argument, we prove that the complexity of the SON-NMF is almost\nirreducible. Second, the per-iteration cost of any algorithm solving SON-NMF is\npossibly high, which motivated us to propose a first-order BCD algorithm to\napproximately solve SON-NMF with a low per-iteration cost, in which we do so by\nthe proximal average operator. Lastly, we propose a simple greedy method for\npost-processing.\n  SON-NMF exhibits favourable features for applications. Beside the ability to\nautomatically estimate the rank from data, SON-NMF can deal with rank-deficient\ndata matrix, can detect weak component with small energy. Furthermore, on the\napplication of hyperspectral imaging, SON-NMF handle the issue of spectral\nvariability naturally.\n","subjects":["Computing Research Repository/Machine Learning","Mathematics/Optimization and Control","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Eyb9IaCBx6nyFF1LXK37wDwGCMPYRsmDMqkOdtyHcdk","pdfSize":"17042284"}