{"id":"2407.01862","title":"Autonomous Ground Navigation in Highly Constrained Spaces: Lessons\n  learned from The 3rd BARN Challenge at ICRA 2024","authors":"Xuesu Xiao, Zifan Xu, Aniket Datar, Garrett Warnell, Peter Stone,\n  Joshua Julian Damanik, Jaewon Jung, Chala Adane Deresa, Than Duc Huy, Chen\n  Jinyu, Chen Yichen, Joshua Adrian Cahyono, Jingda Wu, Longfei Mo, Mingyang\n  Lv, Bowen Lan, Qingyang Meng, Weizhi Tao, Li Cheng","authorsParsed":[["Xiao","Xuesu",""],["Xu","Zifan",""],["Datar","Aniket",""],["Warnell","Garrett",""],["Stone","Peter",""],["Damanik","Joshua Julian",""],["Jung","Jaewon",""],["Deresa","Chala Adane",""],["Huy","Than Duc",""],["Jinyu","Chen",""],["Yichen","Chen",""],["Cahyono","Joshua Adrian",""],["Wu","Jingda",""],["Mo","Longfei",""],["Lv","Mingyang",""],["Lan","Bowen",""],["Meng","Qingyang",""],["Tao","Weizhi",""],["Cheng","Li",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 00:22:31 GMT"}],"updateDate":"2024-07-03","timestamp":1719879751000,"abstract":"  The 3rd BARN (Benchmark Autonomous Robot Navigation) Challenge took place at\nthe 2024 IEEE International Conference on Robotics and Automation (ICRA 2024)\nin Yokohama, Japan and continued to evaluate the performance of\nstate-of-the-art autonomous ground navigation systems in highly constrained\nenvironments. Similar to the trend in The 1st and 2nd BARN Challenge at ICRA\n2022 and 2023 in Philadelphia (North America) and London (Europe), The 3rd BARN\nChallenge in Yokohama (Asia) became more regional, i.e., mostly Asian teams\nparticipated. The size of the competition has slightly shrunk (six simulation\nteams, four of which were invited to the physical competition). The competition\nresults, compared to last two years, suggest that the field has adopted new\nmachine learning approaches while at the same time slightly converged to a few\ncommon practices. However, the regional nature of the physical participants\nsuggests a challenge to promote wider participation all over the world and\nprovide more resources to travel to the venue. In this article, we discuss the\nchallenge, the approaches used by the three winning teams, and lessons learned\nto direct future research and competitions.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"p6X3bdaTQirqhmGK80Z2eAfyMisqRXbZAl9slixY6PA","pdfSize":"1617663"}