{"id":"2407.06646","title":"Variational Learning ISTA","authors":"Fabio Valerio Massoli, Christos Louizos, Arash Behboodi","authorsParsed":[["Massoli","Fabio Valerio",""],["Louizos","Christos",""],["Behboodi","Arash",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 08:17:06 GMT"}],"updateDate":"2024-07-10","timestamp":1720513026000,"abstract":"  Compressed sensing combines the power of convex optimization techniques with\na sparsity-inducing prior on the signal space to solve an underdetermined\nsystem of equations. For many problems, the sparsifying dictionary is not\ndirectly given, nor its existence can be assumed. Besides, the sensing matrix\ncan change across different scenarios. Addressing these issues requires solving\na sparse representation learning problem, namely dictionary learning, taking\ninto account the epistemic uncertainty of the learned dictionaries and,\nfinally, jointly learning sparse representations and reconstructions under\nvarying sensing matrix conditions. We address both concerns by proposing a\nvariant of the LISTA architecture. First, we introduce Augmented Dictionary\nLearning ISTA (A-DLISTA), which incorporates an augmentation module to adapt\nparameters to the current measurement setup. Then, we propose to learn a\ndistribution over dictionaries via a variational approach, dubbed Variational\nLearning ISTA (VLISTA). VLISTA exploits A-DLISTA as the likelihood model and\napproximates a posterior distribution over the dictionaries as part of an\nunfolded LISTA-based recovery algorithm. As a result, VLISTA provides a\nprobabilistic way to jointly learn the dictionary distribution and the\nreconstruction algorithm with varying sensing matrices. We provide theoretical\nand experimental support for our architecture and show that our model learns\ncalibrated uncertainties.\n","subjects":["Computing Research Repository/Machine Learning","Electrical Engineering and Systems Science/Signal Processing","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ZW61kikIYM8n_sBzvGMpoUp8y_Z2K2Vvhinj4BWTb1A","pdfSize":"2533929"}