{"id":"2407.05559","title":"Testing the cosmic distance duality relation using Type Ia supernovae\n  and radio quasars through model-independent methods","authors":"Fan Yang, Xiangyun Fu, Bing Xu, Kaituo Zhang, Yang Huang, and Ying\n  Yang","authorsParsed":[["Yang","Fan",""],["Fu","Xiangyun",""],["Xu","Bing",""],["Zhang","Kaituo",""],["Huang","Yang",""],["Yang","Ying",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 02:29:33 GMT"},{"version":"v2","created":"Wed, 10 Jul 2024 08:41:57 GMT"},{"version":"v3","created":"Thu, 18 Jul 2024 16:09:38 GMT"}],"updateDate":"2024-07-19","timestamp":1720405773000,"abstract":"  In this work, we perform a cosmological-model-independent test on the cosmic\ndistance duality relation (CDDR) by comparing the angular diameter distance\n(ADD) obtained from the compact radio quasars (QSOs) with the luminosity\ndistance (LD) from the Pantheon Type Ia supernovae (SNIa) sample. The binning\nmethod and Artificial Neural Network (ANN) are employed to match ADD data with\nLD data at the same redshift, and three different parameterizations are adopted\nto quantify the possible deviations from the CDDR. We initially investigate the\nimpacts of the specific prior values for the absolute magnitude $M_{\\rm B}$\nfrom SNIa and the linear size scaling factor $l$ from QSOs on the CDDR test,\ndemonstrating that these prior values introduce significant biases in the CDDR\ntest. To avoid the biases, we propose a method independent of $M_{\\rm B}$ and\n$l$ to test CDDR, which treats the fiducial value of a new variable\n$\\kappa\\equiv10^{M_{\\rm B} \\over 5}\\,l$ as a nuisance parameter and then\nmarginalize its impact with a flat prior in the statistical analysis. The\nresults show that the CDDR is consistent with the observational data, and QSOs\ncan serve as a powerful tool for testing the CDDR independent of cosmological\nmodels.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"pgEo57gNCSnzjRyFfJ0-0sFfJLtsvMgMi7cH6K-KB1o","pdfSize":"1629871"}
