{"id":"2407.18867","title":"Catalog of outbursts of neutron star LMXBs","authors":"Craig O. Heinke, Junwen Zheng, Thomas J. Maccarone, Nathalie Degenaar,\n  Arash Bahramian, Gregory R. Sivakoff","authorsParsed":[["Heinke","Craig O.",""],["Zheng","Junwen",""],["Maccarone","Thomas J.",""],["Degenaar","Nathalie",""],["Bahramian","Arash",""],["Sivakoff","Gregory R.",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 16:55:17 GMT"}],"updateDate":"2024-07-29","timestamp":1722012917000,"abstract":"  Many X-ray binaries are transiently accreting. Having statistics on their\nrecurrence times is helpful to address questions related to binary evolution\nand populations, as well as the physics of binary systems. We compile a catalog\nof known outbursts of neutron star (identified through bursts or pulsations)\nlow-mass X-ray binaries, until late 2023. Most outbursts are taken from the\nliterature, but we also identify some outbursts from public X-ray monitoring\nlightcurves. We find 109 outbursts not previously identified in the literature;\nmost are from the frequent transients GRS 1747-312 and the Rapid Burster MXB\n1730-335, though we suspect that two outbursts from Liller 1 may be from\nanother transient, besides the Rapid Burster. We also find new outbursts for 10\nother systems, and verify substantial quiescent intervals for XMM\nJ174457-2850.3, XMMU J174716.1-281048, and AX J1754.2-2754. Outburst detection\nhas been relatively efficient since 1996 for outbursts above\n$F_X$(2-10)$=3\\times10^{-10}$ ergs/s/cm$^2$. While several systems have many\nknown outbursts, 40 of the 85 systems we track have zero or one recorded\noutburst between 1996 and 2023. This suggests that faint Galactic Center X-ray\nbinaries may be neutron star X-ray binaries, though we cannot completely rule\nout the proposition that most neutron star X-ray binaries undergo frequent\noutbursts below all-sky monitor detection limits.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"eSSkNUrm-wGQnauzoQI03Wpwt0fC3oPyX7cIGD5lwNU","pdfSize":"3573827"}