{"id":"2407.09542","title":"Multi-object Data Integration in the Study of Primary Progressive\n  Aphasia","authors":"Rene Gutierrez, Rajarshi Guhaniyogi, Aaron Scheffler, Maria Luisa\n  Gorno-Tempini, Maria Luisa Mandelli, Giovanni Battistella","authorsParsed":[["Gutierrez","Rene",""],["Guhaniyogi","Rajarshi",""],["Scheffler","Aaron",""],["Gorno-Tempini","Maria Luisa",""],["Mandelli","Maria Luisa",""],["Battistella","Giovanni",""]],"versions":[{"version":"v1","created":"Wed, 26 Jun 2024 21:21:03 GMT"}],"updateDate":"2024-07-16","timestamp":1719436863000,"abstract":"  This article focuses on a multi-modal imaging data application where\nstructural/anatomical information from gray matter (GM) and brain connectivity\ninformation in the form of a brain connectome network from functional magnetic\nresonance imaging (fMRI) are available for a number of subjects with different\ndegrees of primary progressive aphasia (PPA), a neurodegenerative disorder (ND)\nmeasured through a speech rate measure on motor speech loss. The\nclinical/scientific goal in this study becomes the identification of brain\nregions of interest significantly related to the speech rate measure to gain\ninsight into ND patterns. Viewing the brain connectome network and GM images as\nobjects, we develop an integrated object response regression framework of\nnetwork and GM images on the speech rate measure. A novel integrated prior\nformulation is proposed on network and structural image coefficients in order\nto exploit network information of the brain connectome while leveraging the\ninterconnections among the two objects. The principled Bayesian framework\nallows the characterization of uncertainty in ascertaining a region being\nactively related to the speech rate measure. Our framework yields new insights\ninto the relationship of brain regions associated with PPA, offering a deeper\nunderstanding of neuro-degenerative patterns of PPA. The supplementary file\nadds details about posterior computation and additional empirical results.\n","subjects":["Quantitative Biology/Neurons and Cognition","Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_BFPpBJT_iRliRnhOadwCsdKVSFAI8FcVPo01hFqbYg","pdfSize":"3923131"}