{"id":"2407.04295","title":"Jailbreak Attacks and Defenses Against Large Language Models: A Survey","authors":"Sibo Yi, Yule Liu, Zhen Sun, Tianshuo Cong, Xinlei He, Jiaxing Song,\n  Ke Xu, Qi Li","authorsParsed":[["Yi","Sibo",""],["Liu","Yule",""],["Sun","Zhen",""],["Cong","Tianshuo",""],["He","Xinlei",""],["Song","Jiaxing",""],["Xu","Ke",""],["Li","Qi",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 06:57:30 GMT"},{"version":"v2","created":"Fri, 30 Aug 2024 11:57:47 GMT"}],"updateDate":"2024-09-02","timestamp":1720162650000,"abstract":"  Large Language Models (LLMs) have performed exceptionally in various\ntext-generative tasks, including question answering, translation, code\ncompletion, etc. However, the over-assistance of LLMs has raised the challenge\nof \"jailbreaking\", which induces the model to generate malicious responses\nagainst the usage policy and society by designing adversarial prompts. With the\nemergence of jailbreak attack methods exploiting different vulnerabilities in\nLLMs, the corresponding safety alignment measures are also evolving. In this\npaper, we propose a comprehensive and detailed taxonomy of jailbreak attack and\ndefense methods. For instance, the attack methods are divided into black-box\nand white-box attacks based on the transparency of the target model. Meanwhile,\nwe classify defense methods into prompt-level and model-level defenses.\nAdditionally, we further subdivide these attack and defense methods into\ndistinct sub-classes and present a coherent diagram illustrating their\nrelationships. We also conduct an investigation into the current evaluation\nmethods and compare them from different perspectives. Our findings aim to\ninspire future research and practical implementations in safeguarding LLMs\nagainst adversarial attacks. Above all, although jailbreak remains a\nsignificant concern within the community, we believe that our work enhances the\nunderstanding of this domain and provides a foundation for developing more\nsecure LLMs.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"QwxnFyDTg7Uszb4-VrZZmzwJ8oAE_fVTtdYlmcnW708","pdfSize":"1547534"}
