{"id":"2407.06064","title":"Pan-denoising: Guided Hyperspectral Image Denoising via Weighted\n  Represent Coefficient Total Variation","authors":"Shuang Xu and Qiao Ke and Jiangjun Peng and Xiangyong Cao and Zixiang\n  Zhao","authorsParsed":[["Xu","Shuang",""],["Ke","Qiao",""],["Peng","Jiangjun",""],["Cao","Xiangyong",""],["Zhao","Zixiang",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 16:05:56 GMT"},{"version":"v2","created":"Mon, 9 Sep 2024 08:34:03 GMT"}],"updateDate":"2024-09-10","timestamp":1720454756000,"abstract":"  This paper introduces a novel paradigm for hyperspectral image (HSI)\ndenoising, which is termed \\textit{pan-denoising}. In a given scene,\npanchromatic (PAN) images capture similar structures and textures to HSIs but\nwith less noise. This enables the utilization of PAN images to guide the HSI\ndenoising process. Consequently, pan-denoising, which incorporates an\nadditional prior, has the potential to uncover underlying structures and\ndetails beyond the internal information modeling of traditional HSI denoising\nmethods. However, the proper modeling of this additional prior poses a\nsignificant challenge. To alleviate this issue, the paper proposes a novel\nregularization term, Panchromatic Weighted Representation Coefficient Total\nVariation (PWRCTV). It employs the gradient maps of PAN images to automatically\nassign different weights of TV regularization for each pixel, resulting in\nlarger weights for smooth areas and smaller weights for edges. This\nregularization forms the basis of a pan-denoising model, which is solved using\nthe Alternating Direction Method of Multipliers. Extensive experiments on\nsynthetic and real-world datasets demonstrate that PWRCTV outperforms several\nstate-of-the-art methods in terms of metrics and visual quality. Furthermore,\nan HSI classification experiment confirms that PWRCTV, as a preprocessing\nmethod, can enhance the performance of downstream classification tasks. The\ncode and data are available at https://github.com/shuangxu96/PWRCTV.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_wlgfNEogDXaVtTVAjOYwrNtxUhm91s0deYO98rCbOw","pdfSize":"6910396"}