{"id":"2407.18151","title":"ArtA: Automating Design Space Exploration of Spin Qubit Architectures","authors":"Nikiforos Paraskevopoulos, David Hamel, Aritra Sarkar, Carmen G.\n  Almudever, and Sebastian Feld","authorsParsed":[["Paraskevopoulos","Nikiforos",""],["Hamel","David",""],["Sarkar","Aritra",""],["Almudever","Carmen G.",""],["Feld","Sebastian",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 16:02:44 GMT"},{"version":"v2","created":"Wed, 31 Jul 2024 17:28:19 GMT"}],"updateDate":"2024-08-01","timestamp":1721923364000,"abstract":"  In the fast-paced field of quantum computing, identifying the architectural\ncharacteristics that will enable quantum processors to achieve high performance\nacross a diverse range of quantum algorithms continues to pose a significant\nchallenge. Given the extensive and costly nature of experimentally testing\ndifferent designs, this paper introduces the first Design Space Exploration\n(DSE) for quantum-dot spin-qubit architectures. Utilizing the upgraded SpinQ\ncompilation framework, this study explores a substantial design space\ncomprising 29,312 spin-qubit-based architectures and applies an innovative\noptimization tool, ArtA (Artificial Architect), to speed up the design space\ntraversal. ArtA can leverage 17 optimization configurations, significantly\nreducing exploration times by up to 99.1% compared to a traditional brute force\napproach while maintaining the same result quality. After a comprehensive\nevaluation of best-matching optimization configurations per quantum circuit,\nArtA suggests specific and universal architectural features that provide\noptimal performance across the examined circuits. Our work demonstrates that\nthe synergy between DSE methodologies and optimization algorithms can\neffectively be deployed to provide useful suggestions to quantum processor\ndesigners.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"VVlx4LacqCJEdAFJTz34cSRw38uOxosQstxEZhbZRDo","pdfSize":"667511"}