{"id":"2407.01824","title":"Empathic Grounding: Explorations using Multimodal Interaction and Large\n  Language Models with Conversational Agents","authors":"Mehdi Arjmand, Farnaz Nouraei, Ian Steenstra, Timothy Bickmore","authorsParsed":[["Arjmand","Mehdi",""],["Nouraei","Farnaz",""],["Steenstra","Ian",""],["Bickmore","Timothy",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 21:46:30 GMT"}],"updateDate":"2024-07-03","timestamp":1719870390000,"abstract":"  We introduce the concept of \"empathic grounding\" in conversational agents as\nan extension of Clark's conceptualization of grounding in conversation in which\nthe grounding criterion includes listener empathy for the speaker's affective\nstate. Empathic grounding is generally required whenever the speaker's emotions\nare foregrounded and can make the grounding process more efficient and reliable\nby communicating both propositional and affective understanding. Both speaker\nexpressions of affect and listener empathic grounding can be multimodal,\nincluding facial expressions and other nonverbal displays. Thus, models of\nempathic grounding for embodied agents should be multimodal to facilitate\nnatural and efficient communication. We describe a multimodal model that takes\nas input user speech and facial expression to generate multimodal grounding\nmoves for a listening agent using a large language model. We also describe a\ntestbed to evaluate approaches to empathic grounding, in which a humanoid robot\ninterviews a user about a past episode of pain and then has the user rate their\nperception of the robot's empathy. We compare our proposed model to one that\nonly generates non-affective grounding cues in a between-subjects experiment.\nFindings demonstrate that empathic grounding increases user perceptions of\nempathy, understanding, emotional intelligence, and trust. Our work highlights\nthe role of emotion awareness and multimodality in generating appropriate\ngrounding moves for conversational agents.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Computation and Language","Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"aZZYMN-_ie0S9vAui0Igs0Mu-xTUqM93yfiiMFe3opU","pdfSize":"1789249"}