{"id":"2407.09779","title":"Layout-and-Retouch: A Dual-stage Framework for Improving Diversity in\n  Personalized Image Generation","authors":"Kangyeol Kim, Wooseok Seo, Sehyun Nam, Bodam Kim, Suhyeon Jeong,\n  Wonwoo Cho, Jaegul Choo, Youngjae Yu","authorsParsed":[["Kim","Kangyeol",""],["Seo","Wooseok",""],["Nam","Sehyun",""],["Kim","Bodam",""],["Jeong","Suhyeon",""],["Cho","Wonwoo",""],["Choo","Jaegul",""],["Yu","Youngjae",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 05:28:45 GMT"}],"updateDate":"2024-07-16","timestamp":1720848525000,"abstract":"  Personalized text-to-image (P-T2I) generation aims to create new, text-guided\nimages featuring the personalized subject with a few reference images. However,\nbalancing the trade-off relationship between prompt fidelity and identity\npreservation remains a critical challenge. To address the issue, we propose a\nnovel P-T2I method called Layout-and-Retouch, consisting of two stages: 1)\nlayout generation and 2) retouch. In the first stage, our step-blended\ninference utilizes the inherent sample diversity of vanilla T2I models to\nproduce diversified layout images, while also enhancing prompt fidelity. In the\nsecond stage, multi-source attention swapping integrates the context image from\nthe first stage with the reference image, leveraging the structure from the\ncontext image and extracting visual features from the reference image. This\nachieves high prompt fidelity while preserving identity characteristics.\nThrough our extensive experiments, we demonstrate that our method generates a\nwide variety of images with diverse layouts while maintaining the unique\nidentity features of the personalized objects, even with challenging text\nprompts. This versatility highlights the potential of our framework to handle\ncomplex conditions, significantly enhancing the diversity and applicability of\npersonalized image synthesis.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"FiUhWTVMS5jmXBHVb7aNfMP0YZKAMyWUxe8oWOjpGQg","pdfSize":"29914539"}