{"id":"2407.04356","title":"Gravitational waves from inflation in LISA: reconstruction pipeline and\n  physics interpretation","authors":"Matteo Braglia, Gianluca Calcagni, Gabriele Franciolini, Jacopo\n  Fumagalli, Germano Nardini, Marco Peloso, Mauro Pieroni, S\\'ebastien\n  Renaux-Petel, Angelo Ricciardone, Gianmassimo Tasinato, Ville Vaskonen","authorsParsed":[["Braglia","Matteo",""],["Calcagni","Gianluca",""],["Franciolini","Gabriele",""],["Fumagalli","Jacopo",""],["Nardini","Germano",""],["Peloso","Marco",""],["Pieroni","Mauro",""],["Renaux-Petel","Sébastien",""],["Ricciardone","Angelo",""],["Tasinato","Gianmassimo",""],["Vaskonen","Ville",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 08:51:25 GMT"}],"updateDate":"2024-07-08","timestamp":1720169485000,"abstract":"  Various scenarios of cosmic inflation enhance the amplitude of the stochastic\ngravitational wave background (SGWB) at frequencies detectable by the LISA\ndetector. We develop tools for a template-based analysis of the SGWB and\nintroduce a template databank to describe well-motivated signals from\ninflation, prototype their template-based searches, and forecast their\nreconstruction with LISA. Specifically, we classify seven templates based on\ntheir signal frequency shape, and we identify representative fundamental\nphysics models leading to them. By running a template-based analysis, we\nforecast the accuracy with which LISA can reconstruct the template parameters\nof representative benchmark signals, with and without galactic and\nextragalactic foregrounds. We identify the parameter regions that can be probed\nby LISA within each template. Finally, we investigate how our signal\nreconstructions shed light on fundamental physics models of inflation: we\ndiscuss their impact for measurements of \\emph{e.g.,} ~the couplings of\ninflationary axions to gauge fields; the graviton mass during inflation; the\nfluctuation seeds of primordial black holes; the consequences of excited states\nduring inflation, and the presence of small-scale spectral features.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"evkOc9ZcinW3kC7cinxammPLEgjAhXXESXnW6hI3w4Q","pdfSize":"13634210"}