{"id":"2407.04712","title":"Sensing technologies and machine learning methods for emotion\n  recognition in autism: Systematic review","authors":"Oresti Banos, Zhoe Comas-Gonz\\'alez, Javier Medina, Aurora\n  Polo-Rodr\\'iguez, David Gil, Jes\\'us Peral, Sandra Amador, Claudia Villalonga","authorsParsed":[["Banos","Oresti",""],["Comas-González","Zhoe",""],["Medina","Javier",""],["Polo-Rodríguez","Aurora",""],["Gil","David",""],["Peral","Jesús",""],["Amador","Sandra",""],["Villalonga","Claudia",""]],"versions":[{"version":"v1","created":"Wed, 15 May 2024 19:48:04 GMT"}],"updateDate":"2024-07-09","timestamp":1715802484000,"abstract":"  Background: Human Emotion Recognition (HER) has been a popular field of study\nin the past years. Despite the great progresses made so far, relatively little\nattention has been paid to the use of HER in autism. People with autism are\nknown to face problems with daily social communication and the prototypical\ninterpretation of emotional responses, which are most frequently exerted via\nfacial expressions. This poses significant practical challenges to the\napplication of regular HER systems, which are normally developed for and by\nneurotypical people. Objective: This study reviews the literature on the use of\nHER systems in autism, particularly with respect to sensing technologies and\nmachine learning methods, as to identify existing barriers and possible future\ndirections. Methods: We conducted a systematic review of articles published\nbetween January 2011 and June 2023 according to the 2020 PRISMA guidelines.\nManuscripts were identified through searching Web of Science and Scopus\ndatabases. Manuscripts were included when related to emotion recognition, used\nsensors and machine learning techniques, and involved children with autism,\nyoung, or adults. Results: The search yielded 346 articles. A total of 65\npublications met the eligibility criteria and were included in the review.\nConclusions: Studies predominantly used facial expression techniques as the\nemotion recognition method. Consequently, video cameras were the most widely\nused devices across studies, although a growing trend in the use of\nphysiological sensors was observed lately. Happiness, sadness, anger, fear,\ndisgust, and surprise were most frequently addressed. Classical supervised\nmachine learning techniques were primarily used at the expense of unsupervised\napproaches or more recent deep learning models.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"AwhL0HsMRaxakyWbBoH0gvO7g04mpumzJuB-7SgDvg8","pdfSize":"2160752"}