{"id":"2407.07869","title":"High-resolution Elemental Abundance Measurements of Cool JWST Planet\n  Hosts Using AutoSpecFit: An Application to the Sub-Neptune K2-18b's Host M\n  dwarf","authors":"Neda Hejazi, Ian J. M. Crossfield, Diogo Souto, Jonathan Brande,\n  Thomas Nordlander, Emilio Marfil, Katia Cunha, David R. Coria, Zachary G.\n  Maas, Alex S. Polanski, Natalie R. Hinkel, Joseph E. Hand","authorsParsed":[["Hejazi","Neda",""],["Crossfield","Ian J. M.",""],["Souto","Diogo",""],["Brande","Jonathan",""],["Nordlander","Thomas",""],["Marfil","Emilio",""],["Cunha","Katia",""],["Coria","David R.",""],["Maas","Zachary G.",""],["Polanski","Alex S.",""],["Hinkel","Natalie R.",""],["Hand","Joseph E.",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 17:33:32 GMT"}],"updateDate":"2024-07-11","timestamp":1720632812000,"abstract":"  We present an in-depth, high-resolution spectroscopic analysis of the M dwarf\nK2-18 that hosts a sub-Neptune exoplanet in its habitable zone. We show our\ntechnique to accurately normalize the observed spectrum, which is crucial for a\nproper spectral fitting. We also introduce a new automatic, line-by-line\nmodel-fitting code, AutoSpecFit, that performs an iterative ${\\chi}^{2}$\nminimization process to measure individual elemental abundances of cool dwarfs.\nWe apply this code to the star K2-18, and measure the abundance of 10 elements\n- C, O, Na, Mg, Al, K, Ca, Sc, Ti, and Fe. We find these abundances moderately\nsupersolar, except for Fe with a slightly subsolar abundance. The accuracy of\nthe inferred abundances is limited by the systematic errors due to uncertain\nstellar parameters. We also derive the abundance ratios associated with several\nplanet-building elements such as Al/Mg, Ca/Mg, Fe/Mg, and (a solar-like)\nC/O=0.568 $\\pm$ 0.026, which can be used to constrain the chemical composition\nand the formation location of the exoplanet. On the other hand, the planet\nK2-18 b has attracted considerable interest, given the JWST measurements of its\natmospheric composition. Early JWST studies reveal an unusual chemistry for the\natmosphere of this planet, which is unlikely to be driven by formation in a\ndisk of unusual composition. The comparison between the chemical abundances of\nK2-18 b from future JWST analyses and those of the host star can provide\nfundamental insights into the formation of this planetary system.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"kTYeiTYOYg4YwkJEy1SW0Z7UCr7nYeyHOnEUGtP3ZfU","pdfSize":"3148409"}