{"id":"2407.05803","title":"Multimodal Machine Learning for Automated Assessment of\n  Attention-Related Processes during Learning","authors":"Babette B\\\"uhler","authorsParsed":[["Bühler","Babette",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 10:22:12 GMT"}],"updateDate":"2024-07-09","timestamp":1720434132000,"abstract":"  Attention is a key factor for successful learning, with research indicating\nstrong associations between (in)attention and learning outcomes. This\ndissertation advanced the field by focusing on the automated detection of\nattention-related processes using eye tracking, computer vision, and machine\nlearning, offering a more objective, continuous, and scalable assessment than\ntraditional methods such as self-reports or observations. It introduced novel\ncomputational approaches for assessing various dimensions of (in)attention in\nonline and classroom learning settings and addressing the challenges of precise\nfine-granular assessment, generalizability, and in-the-wild data quality.\nFirst, this dissertation explored the automated detection of mind-wandering, a\nshift in attention away from the learning task. Aware and unaware mind\nwandering were distinguished employing a novel multimodal approach that\nintegrated eye tracking, video, and physiological data. Further, the\ngeneralizability of scalable webcam-based detection across diverse tasks,\nsettings, and target groups was examined. Second, this thesis investigated\nattention indicators during online learning. Eye-tracking analyses revealed\nsignificantly greater gaze synchronization among attentive learners. Third, it\naddressed attention-related processes in classroom learning by detecting\nhand-raising as an indicator of behavioral engagement using a novel\nview-invariant and occlusion-robust skeleton-based approach. This thesis\nadvanced the automated assessment of attention-related processes within\neducational settings by developing and refining methods for detecting mind\nwandering, on-task behavior, and behavioral engagement. It bridges educational\ntheory with advanced methods from computer science, enhancing our understanding\nof attention-related processes that significantly impact learning outcomes and\neducational practices.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"f8cwmzwPnIUr70jfVU0HL0oWM9pZNQaphcCSx-OUnwM","pdfSize":"17388067"}