{"id":"2407.18892","title":"SHANGUS: Deep Reinforcement Learning Meets Heuristic Optimization for\n  Speedy Frontier-Based Exploration of Autonomous Vehicles in Unknown Spaces","authors":"Seunghyeop Nam, Tuan Anh Nguyen, Eunmi Choi, Dugki Min","authorsParsed":[["Nam","Seunghyeop",""],["Nguyen","Tuan Anh",""],["Choi","Eunmi",""],["Min","Dugki",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 17:42:18 GMT"}],"updateDate":"2024-07-29","timestamp":1722015738000,"abstract":"  This paper introduces SHANGUS, an advanced framework combining Deep\nReinforcement Learning (DRL) with heuristic optimization to improve\nfrontier-based exploration efficiency in unknown environments, particularly for\nintelligent vehicles in autonomous air services, search and rescue operations,\nand space exploration robotics. SHANGUS harnesses DRL's adaptability and\nheuristic prioritization, markedly enhancing exploration efficiency, reducing\ncompletion time, and minimizing travel distance. The strategy involves a\nfrontier selection node to identify unexplored areas and a DRL navigation node\nusing the Twin Delayed Deep Deterministic Policy Gradient (TD3) algorithm for\nrobust path planning and dynamic obstacle avoidance. Extensive experiments in\nROS2 and Gazebo simulation environments show SHANGUS surpasses representative\ntraditional methods like the Nearest Frontier (NF), Novel Frontier-Based\nExploration Algorithm (CFE), and Goal-Driven Autonomous Exploration (GDAE)\nalgorithms, especially in complex scenarios, excelling in completion time,\ntravel distance, and exploration rate. This scalable solution is suitable for\nreal-time autonomous navigation in fields such as industrial automation,\nautonomous driving, household robotics, and space exploration. Future research\nwill integrate additional sensory inputs and refine heuristic functions to\nfurther boost SHANGUS's efficiency and robustness.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"bTzvgnPwPp8VwbW-YvAxLB1FZG8hHpKnnRewtkBkLXA","pdfSize":"12379806"}