{"id":"2407.13035","title":"Pre-Trained Foundation Model representations to uncover Breathing\n  patterns in Speech","authors":"Vikramjit Mitra, Anirban Chatterjee, Ke Zhai, Helen Weng, Ayuko Hill,\n  Nicole Hay, Christopher Webb, Jamie Cheng, Erdrin Azemi","authorsParsed":[["Mitra","Vikramjit",""],["Chatterjee","Anirban",""],["Zhai","Ke",""],["Weng","Helen",""],["Hill","Ayuko",""],["Hay","Nicole",""],["Webb","Christopher",""],["Cheng","Jamie",""],["Azemi","Erdrin",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 21:57:18 GMT"}],"updateDate":"2024-07-19","timestamp":1721253438000,"abstract":"  The process of human speech production involves coordinated respiratory\naction to elicit acoustic speech signals. Typically, speech is produced when\nair is forced from the lungs and is modulated by the vocal tract, where such\nactions are interspersed by moments of breathing in air (inhalation) to refill\nthe lungs again. Respiratory rate (RR) is a vital metric that is used to assess\nthe overall health, fitness, and general well-being of an individual. Existing\napproaches to measure RR (number of breaths one takes in a minute) are\nperformed using specialized equipment or training. Studies have demonstrated\nthat machine learning algorithms can be used to estimate RR using bio-sensor\nsignals as input. Speech-based estimation of RR can offer an effective approach\nto measure the vital metric without requiring any specialized equipment or\nsensors. This work investigates a machine learning based approach to estimate\nRR from speech segments obtained from subjects speaking to a close-talking\nmicrophone device. Data were collected from N=26 individuals, where the\ngroundtruth RR was obtained through commercial grade chest-belts and then\nmanually corrected for any errors. A convolutional long-short term memory\nnetwork (Conv-LSTM) is proposed to estimate respiration time-series data from\nthe speech signal. We demonstrate that the use of pre-trained representations\nobtained from a foundation model, such as Wav2Vec2, can be used to estimate\nrespiration-time-series with low root-mean-squared error and high correlation\ncoefficient, when compared with the baseline. The model-driven time series can\nbe used to estimate $RR$ with a low mean absolute error (MAE) ~ 1.6\nbreaths/min.\n","subjects":["Computing Research Repository/Sound","Computing Research Repository/Computation and Language","Computing Research Repository/Machine Learning","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"WhuOHaraKGkMPc2-h_XrVFgwIJYPL9q2wKlsATdxilM","pdfSize":"4965061","objectId":"0x32b8cdd600832e2277638d7101206d342c093285c646325bf207ffbff1cb11f6","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
