{"id":"2407.20730","title":"Autogenic Language Embedding for Coherent Point Tracking","authors":"Zikai Song, Ying Tang, Run Luo, Lintao Ma, Junqing Yu, Yi-Ping Phoebe\n  Chen, Wei Yang","authorsParsed":[["Song","Zikai",""],["Tang","Ying",""],["Luo","Run",""],["Ma","Lintao",""],["Yu","Junqing",""],["Chen","Yi-Ping Phoebe",""],["Yang","Wei",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 11:02:45 GMT"}],"updateDate":"2024-07-31","timestamp":1722337365000,"abstract":"  Point tracking is a challenging task in computer vision, aiming to establish\npoint-wise correspondence across long video sequences. Recent advancements have\nprimarily focused on temporal modeling techniques to improve local feature\nsimilarity, often overlooking the valuable semantic consistency inherent in\ntracked points. In this paper, we introduce a novel approach leveraging\nlanguage embeddings to enhance the coherence of frame-wise visual features\nrelated to the same object. Our proposed method, termed autogenic language\nembedding for visual feature enhancement, strengthens point correspondence in\nlong-term sequences. Unlike existing visual-language schemes, our approach\nlearns text embeddings from visual features through a dedicated mapping\nnetwork, enabling seamless adaptation to various tracking tasks without\nexplicit text annotations. Additionally, we introduce a consistency decoder\nthat efficiently integrates text tokens into visual features with minimal\ncomputational overhead. Through enhanced visual consistency, our approach\nsignificantly improves tracking trajectories in lengthy videos with substantial\nappearance variations. Extensive experiments on widely-used tracking benchmarks\ndemonstrate the superior performance of our method, showcasing notable\nenhancements compared to trackers relying solely on visual cues.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"B2llrwzA-TWrun8eKPxlAGuWofjdehmAixH-u9CO6iw","pdfSize":"3838399"}