{"id":"2407.19028","title":"Axion signals from neutron star populations","authors":"U. Bhura, R. A. Battye, J. I. McDonald, S. Srinivasan","authorsParsed":[["Bhura","U.",""],["Battye","R. A.",""],["McDonald","J. I.",""],["Srinivasan","S.",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 18:12:46 GMT"}],"updateDate":"2024-07-30","timestamp":1722017566000,"abstract":"  Neutron stars provide a powerful probe of axion dark matter, especially in\nhigher frequency ranges where there remain fewer laboratory constraints.\nPopulations of neutron stars near the Galactic Centre have been proposed as a\nmeans to place strong constraints on axion dark matter. One downside of this\napproach is that there are very few direct observations of neutron stars in\nthis region, introducing uncertainties in the total number of neutron stars in\nthis ``invisible\" population at the Galactic Centre, whose size must be\ninferred through birth rate modelling. We suggest this number could also be\nreduced due to stellar dynamics carrying stars away from the Galactic Centre\nvia large kick velocities at birth. We attempt to circumvent the uncertainty on\nthe Galactic Centre population size by modelling the axion signal from better\nunderstood populations outside the Galactic Centre using {\\tt PsrPopPy} which\nis normalised against pulsar observations. We consider lower-frequency,\nwider-angle searches for this signal via a range of instruments including\nMeerKAT and SKA-low but find that the sensitivity is not competitive with\nexisting constraints. Finally, returning to the Galactic Centre, we compare\npopulations to single objects as targets for axion detection. Using the latest\nmodelling of axion-photon conversion in the Galactic Centre magnetar, we\nconclude that within astrophysical uncertainties, the Galactic Centre\npopulation and the magnetar could give comparable sensitivities to axion dark\nmatter, suggesting one should continue to search for both signals in future\nsurveys.\n","subjects":["Physics/High Energy Physics - Phenomenology","Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_bstsZQZ9sFwGO_rUUm5NAteYmbC3FyOqWT4mnyMB_g","pdfSize":"10842796","objectId":"0xcafde3220649dc82a15c806b44d6af223132a41a8cf387dad569e2a88994477e","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
