{"id":"2407.20258","title":"An Efficient and Flexible Deep Learning Method for Signal Delineation\n  via Keypoints Estimation","authors":"Adrian Atienza, Jakob Bardram, Sadasivan Puthusserypady","authorsParsed":[["Atienza","Adrian",""],["Bardram","Jakob",""],["Puthusserypady","Sadasivan",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 08:13:10 GMT"}],"updateDate":"2024-07-31","timestamp":1721808790000,"abstract":"  Deep Learning (DL) methods have been used for electrocardiogram (ECG)\nprocessing in a wide variety of tasks, demonstrating good performance compared\nwith traditional signal processing algorithms. These methods offer an efficient\nframework with a limited need for apriori data pre-processing and feature\nengineering. While several studies use this approach for ECG signal\ndelineation, a significant gap persists between the expected and the actual\noutcome. Existing methods rely on a sample-to-sample classifier. However, the\nclinical expected outcome consists of a set of onset, offset, and peak for the\ndifferent waves that compose each R-R interval. To align the actual with the\nexpected output, it is necessary to incorporate post-processing algorithms.\nThis counteracts two of the main advantages of DL models, since these\nalgorithms are based on assumptions and slow down the method's performance. In\nthis paper, we present Keypoint Estimation for Electrocardiogram Delineation\n(KEED), a novel DL model designed for keypoint estimation, which organically\noffers an output aligned with clinical expectations. By standing apart from the\nconventional sample-to-sample classifier, we achieve two benefits: (i)\nEliminate the need for additional post-processing, and (ii) Establish a\nflexible framework that allows the adjustment of the threshold value\nconsidering the sensitivity-specificity tradeoff regarding the particular\nclinical requirements. The proposed method's performance is compared with\nstate-of-the-art (SOTA) signal processing methods. Remarkably, KEED\nsignificantly outperforms despite being optimized with an extremely limited\nannotated data. In addition, KEED decreases the inference time by a factor\nranging from 52x to 703x.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"jtChlm0kaUgfpj9hopYiA7Avkqryt4NZil9UfxADKE8","pdfSize":"471550"}