{"id":"2407.05221","title":"Ensemble Boost: Greedy Selection for Superior Recommender Systems","authors":"Zainil Mehta, Tobias Vente","authorsParsed":[["Mehta","Zainil",""],["Vente","Tobias",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 00:50:52 GMT"}],"updateDate":"2024-07-09","timestamp":1720313452000,"abstract":"  Ensemble techniques have demonstrated remarkable success in improving\npredictive performance across various domains by aggregating predictions from\nmultiple models [1]. In the realm of recommender systems, this research\nexplores the application of ensemble technique to enhance recommendation\nquality. Specifically, we propose a novel approach to combine top-k\nrecommendations from ten diverse recommendation models resulting in superior\ntop-n recommendations using this novel ensemble technique. Our method leverages\na Greedy Ensemble Selection(GES) strategy, effectively harnessing the\ncollective intelligence of multiple models. We conduct experiments on five\ndistinct datasets to evaluate the effectiveness of our approach. Evaluation\nacross five folds using the NDCG metric reveals significant improvements in\nrecommendation accuracy across all datasets compared to single best performing\nmodel. Furthermore, comprehensive comparisons against existing models\nunderscore the efficacy of our ensemble approach in enhancing recommendation\nquality. Our ensemble approach yielded an average improvement of 21.67% across\ndifferent NDCG@N metrics and the five datasets, compared to single best model.\nThe popularity recommendation model serves as the baseline for comparison. This\nresearch contributes to the advancement of ensemble-based recommender systems,\noffering insights into the potential of combining diverse recommendation\nstrategies to enhance user experience and satisfaction. By presenting a novel\napproach and demonstrating its superiority over existing methods, we aim to\ninspire further exploration and innovation in this domain.\n","subjects":["Computing Research Repository/Information Retrieval"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"UFcHroHoxobbX8c76wElgWjsaDxOiL5c8883J5f9Pxk","pdfSize":"1221537"}