{"id":"2407.00377","title":"The Factuality Tax of Diversity-Intervened Text-to-Image Generation:\n  Benchmark and Fact-Augmented Intervention","authors":"Yixin Wan, Di Wu, Haoran Wang, Kai-Wei Chang","authorsParsed":[["Wan","Yixin",""],["Wu","Di",""],["Wang","Haoran",""],["Chang","Kai-Wei",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 09:09:42 GMT"}],"updateDate":"2024-07-02","timestamp":1719652182000,"abstract":"  Prompt-based \"diversity interventions\" are commonly adopted to improve the\ndiversity of Text-to-Image (T2I) models depicting individuals with various\nracial or gender traits. However, will this strategy result in nonfactual\ndemographic distribution, especially when generating real historical figures?\nIn this work, we propose DemOgraphic FActualIty Representation (DoFaiR), a\nbenchmark to systematically quantify the trade-off between using diversity\ninterventions and preserving demographic factuality in T2I models. DoFaiR\nconsists of 756 meticulously fact-checked test instances to reveal the\nfactuality tax of various diversity prompts through an automated\nevidence-supported evaluation pipeline. Experiments on DoFaiR unveil that\ndiversity-oriented instructions increase the number of different gender and\nracial groups in DALLE-3's generations at the cost of historically inaccurate\ndemographic distributions. To resolve this issue, we propose Fact-Augmented\nIntervention (FAI), which instructs a Large Language Model (LLM) to reflect on\nverbalized or retrieved factual information about gender and racial\ncompositions of generation subjects in history, and incorporate it into the\ngeneration context of T2I models. By orienting model generations using the\nreflected historical truths, FAI significantly improves the demographic\nfactuality under diversity interventions while preserving diversity.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"pYKSGhSe0QzLRi5z-RuVLmnDYzWM5sRJx5bGzOd8moc","pdfSize":"13219402"}