{"id":"2407.04200","title":"Are Scientists Changing their Research Productivity Classes When They\n  Move Up the Academic Ladder?","authors":"Marek Kwiek, Wojciech Roszka","authorsParsed":[["Kwiek","Marek",""],["Roszka","Wojciech",""]],"versions":[{"version":"v1","created":"Sun, 23 Jun 2024 18:04:19 GMT"},{"version":"v2","created":"Tue, 30 Jul 2024 17:59:55 GMT"},{"version":"v3","created":"Wed, 21 Aug 2024 17:48:10 GMT"},{"version":"v4","created":"Sun, 8 Sep 2024 19:02:02 GMT"}],"updateDate":"2024-09-10","timestamp":1719165859000,"abstract":"  We approach productivity in science in a longitudinal fashion: We track\ncareers over time, up to 40 years. We first allocate scientists to decile-based\npublishing productivity classes, from the bottom 10% to the top 10%. Then, we\nseek patterns of mobility between the classes in two career stages: assistant\nprofessorship and associate professorship. Our findings confirm that radically\nchanging publishing productivity levels (upward or downward) almost never\nhappens. Scientists with a very weak past track record in publications emerge\nas having marginal chances of becoming scientists with a very strong future\ntrack record across all science, technology, engineering, mathematics, and\nmedicine (STEMM) fields. Hence, our research shows a long-term character of\ncareers in science, with publishing productivity during the apprenticeship\nperiod of assistant professorship heavily influencing productivity during the\nmore independent period of associate professorship. We use individual-level\nmicrodata on academic careers (from a national registry of scientists) and\nindividual-level metadata on publications (from the Scopus raw dataset). Polish\nassociate professors tend to be stuck in their productivity classes for years:\nHigh performers tend to remain high performers, and low performers tend to\nremain low performers over their careers. Logistic regression analysis\npowerfully supports our two-dimensional results. We examine all internationally\nvisible Polish associate professors in five fields of science in STEMM fields\n(N = 4,165 with N art = 71,841 articles).\n","subjects":["Computing Research Repository/Digital Libraries"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"JDf36s1AY2O443CfaFNJGQCVeGJvIdU-Jc-Apf--BMQ","pdfSize":"1012367"}
