{"id":"2407.19136","title":"Planar structured materials with extreme elastic anisotropy","authors":"Jagannadh Boddapati, Chiara Daraio","authorsParsed":[["Boddapati","Jagannadh",""],["Daraio","Chiara",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 00:51:49 GMT"},{"version":"v2","created":"Fri, 2 Aug 2024 18:47:34 GMT"}],"updateDate":"2024-08-06","timestamp":1722041509000,"abstract":"  Designing anisotropic structured materials by reducing symmetry results in\nunique behaviors, such as shearing under uniaxial compression or tension. This\ndirection-dependent coupled mechanical phenomenon is crucial for applications\nsuch as energy redirection. While rank-deficient materials such as hierarchical\nlaminates have been shown to exhibit extreme elastic anisotropy, there is\nlimited knowledge about the fully anisotropic elasticity tensors achievable\nwith single-scale fabrication techniques. No established upper and lower bounds\non anisotropic moduli achieving extreme elastic anisotropy exist, similar to\nHashin-Shtrikman bounds in isotropic composites. In this paper, we estimate the\nrange of anisotropic stiffness tensors achieved by single-scale two-dimensional\nstructured materials. To achieve this, we first develop a database of periodic\nanisotropic single-scale unit cell geometries using linear combinations of\nperiodic cosine functions. The database covers a wide range of anisotropic\nelasticity tensors, which are then compared with the elasticity tensors of\nhierarchical laminates. Through this comparison, we identify the regions in the\nproperty space where hierarchical design is necessary to achieve extremal\nproperties. We demonstrate a method to construct various 2D functionally graded\nstructures using this cosine function representation for the unit cells. These\ngraded structures seamlessly interpolate between unit cells with distinct\npatterns, allowing for independent control of several functional gradients,\nsuch as porosity, anisotropic moduli, and symmetry. The graded structures\nexhibit unique mechanical behaviors when designed with unit cells positioned at\nextreme parts of the property space. Specific graded designs are numerically\nstudied to observe behaviors such as selective strain energy localization,\ncompressive strains under tension, and localized rotations.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"oJN-Wh9QQRfwoXk5h90OFS9feKKeJBKjwpHBSfqicms","pdfSize":"40176086"}