{"id":"2407.18103","title":"Fine-Tuning Large Language Models for Stock Return Prediction Using\n  Newsflow","authors":"Tian Guo, Emmanuel Hauptmann","authorsParsed":[["Guo","Tian",""],["Hauptmann","Emmanuel",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 15:07:35 GMT"},{"version":"v2","created":"Mon, 5 Aug 2024 11:13:57 GMT"}],"updateDate":"2024-08-06","timestamp":1721920055000,"abstract":"  Large language models (LLMs) and their fine-tuning techniques have\ndemonstrated superior performance in various language understanding and\ngeneration tasks. This paper explores fine-tuning LLMs for stock return\nforecasting with financial newsflow. In quantitative investing, return\nforecasting is fundamental for subsequent tasks like stock picking, portfolio\noptimization, etc. We formulate the model to include text representation and\nforecasting modules. We propose to compare the encoder-only and decoder-only\nLLMs, considering they generate text representations in distinct ways. The\nimpact of these different representations on forecasting performance remains an\nopen question. Meanwhile, we compare two simple methods of integrating LLMs'\ntoken-level representations into the forecasting module. The experiments on\nreal news and investment universes reveal that: (1) aggregated representations\nfrom LLMs' token-level embeddings generally produce return predictions that\nenhance the performance of long-only and long-short portfolios; (2) in the\nrelatively large investment universe, the decoder LLMs-based prediction model\nleads to stronger portfolios, whereas in the small universes, there are no\nconsistent winners. Among the three LLMs studied (DeBERTa, Mistral, Llama),\nMistral performs more robustly across different universes; (3) return\npredictions derived from LLMs' text representations are a strong signal for\nportfolio construction, outperforming conventional sentiment scores.\n","subjects":["Quantitative Finance/Computational Finance","Computing Research Repository/Machine Learning","Quantitative Finance/Portfolio Management"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"iz5b647Qghi1PWeSAz37OE1zC1GweMW7WaLxAcxUNu0","pdfSize":"883299"}