{"id":"2407.18348","title":"Ordinary and exotic mesons in the extended Linear Sigma Model","authors":"Francesco Giacosa, P\\'eter Kov\\'acs, Shahriyar Jafarzade","authorsParsed":[["Giacosa","Francesco",""],["Kovács","Péter",""],["Jafarzade","Shahriyar",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 19:30:58 GMT"}],"updateDate":"2024-07-29","timestamp":1721935858000,"abstract":"  The extended Linear Sigma Model (eLSM) is a hadronic model based on the\nglobal symmetries of QCD and the corresponding explicit, anomalous, and\nspontaneous breaking patterns. In its basic three-flavor form, its mesonic part\ncontains the dilaton/glueball as well as the nonets of (pseudo)scalar and\n(axial-)vector mesons, thus chiral symmetry is linearly realized. In the chiral\nlimit and neglecting the chiral anomaly, only one term -- within the dilaton\npotential -- breaks dilatation invariance. Spontaneous symmetry breaking is\nimplemented by a generalization of the Mexican-hat potential, with explicit\nsymmetry breaking responsible for its tilting. The overall mesonic\nphenomenology up to 2 GeV is in agreement with the PDG compilation of masses\nand decay widths. The eLSM was enlarged to include other conventional\nquark-antiquark nonets (pseudovector and orbitally excited vector mesons,\n(axial-)tensor mesons, etc.), as well as two nonets of hybrid mesons, the\nlightest one with exotic quantum numbers $J^{PC} = 1^{-+}$ not allowed for\n$\\bar{q}q$ objects such as the resonance $\\pi_1(1600)$ and the recently\ndiscovered $\\eta_1(1855)$. In doing so, different types of chiral multiplets\nare introduced: heterochiral and homochiral multiplets, which differ in the way\nthey transform under chiral transformations. Moreover, besides the scalar\nglueball, the tensor, the pseudoscalar and the vector glueballs were coupled to\nthe eLSM: the scalar $f_0(1710)$ turns out to be mostly gluonic, the tensor\nglueball couples strongly to vector mesons, and the pseudoscalar glueball\ncouples can be assigned to $X(2370)$ or $X(2600)$. The eLSM contains chiral\npartners on an equal footing and is therefore well suited for studies of chiral\nsymmetry restoration at nonzero temperature and densities. The QCD phase\ndiagram and the location of the critical endpoint were investigated within this\nframework.\n","subjects":["Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Lattice","Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"6pI7ly-YQL9JV10CqKYXZeFWtuHPf3l-GrEMzu2DMA4","pdfSize":"2624297"}