{"id":"2407.00856","title":"Drone-Based Antenna Beam Calibration in the High Arctic","authors":"Lawrence Herman, Christopher Barbarie, Mohan Agrawal, Vlad Calinescu,\n  Simon Chen, H. Cynthia Chiang, Cherie K. Day, Eamon Egan, Stephen Fay, Kit\n  Gerodias, Maya Goss, Michael H\\'etu, Daniel C. Jacobs, Marc-Olivier R.\n  Lalonde, Francis McGee, Lo\\\"ic Miara, John Orlowski-Scherer, and Jonathan\n  Sievers","authorsParsed":[["Herman","Lawrence",""],["Barbarie","Christopher",""],["Agrawal","Mohan",""],["Calinescu","Vlad",""],["Chen","Simon",""],["Chiang","H. Cynthia",""],["Day","Cherie K.",""],["Egan","Eamon",""],["Fay","Stephen",""],["Gerodias","Kit",""],["Goss","Maya",""],["Hétu","Michael",""],["Jacobs","Daniel C.",""],["Lalonde","Marc-Olivier R.",""],["McGee","Francis",""],["Miara","Loïc",""],["Orlowski-Scherer","John",""],["Sievers","Jonathan",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 23:38:35 GMT"}],"updateDate":"2024-07-02","timestamp":1719790715000,"abstract":"  The development of low-frequency radio astronomy experiments for detecting\n21-cm line emission from hydrogen presents new opportunities for creative\nsolutions to the challenge of characterizing an antenna beam pattern. The Array\nof Long Baseline Antennas for Taking Radio Observations from the Seventy-ninth\nparallel (ALBATROS) is a new radio interferometer sited in the Canadian high\nArctic that aims to map Galactic foregrounds at frequencies below $\\sim$30 MHz.\nWe present PteroSoar, a custom-built hexacopter outfitted with a transmitter,\nthat will be used to characterize the beam patterns of ALBATROS and other\nexperiments. The PteroSoar drone hardware is motivated by the need for\nuser-servicing at remote sites and environmental factors that are unique to the\nhigh Arctic. In particular, magnetic heading is unreliable because the magnetic\nfield lines near the north pole are almost vertical. We therefore implement\nmoving baseline real time kinematic (RTK) positioning with two GPS units to\nobtain heading solutions with $\\sim$1$^\\circ$ accuracy. We present a\npreliminary beam map of an ALBATROS antenna, thus demonstrating successful\nPteroSoar operation in the high Arctic.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"ggiWr3OScCCf4uT01RM_GdX-zs6zwfHMX-rmoQMXOxc","pdfSize":"15517223","objectId":"0x7f863a76e5809715f92bdf6844f55f81720322f223a0371dc680436e0427521e","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
