{"id":"2407.06238","title":"Stability Analysis Of Fractional Relativistic Polytropes","authors":"Mohamed S. Aboueisha, A. S. Saad, Mohamed I. Nouh, Tarek M. Kamel, M.\n  M. Beheary and Kamel A. K. Gadallah","authorsParsed":[["Aboueisha","Mohamed S.",""],["Saad","A. S.",""],["Nouh","Mohamed I.",""],["Kamel","Tarek M.",""],["Beheary","M. M.",""],["Gadallah","Kamel A. K.",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 20:07:50 GMT"}],"updateDate":"2024-07-10","timestamp":1720382870000,"abstract":"  In astrophysics, the gravitational stability of a self-gravitating polytropic\nfluid sphere is an intriguing subject, especially when trying to comprehend the\ngenesis and development of celestial bodies like planets and stars. This\nstability is the sphere's capacity to stay in balance in the face of\ndisruptions. We utilize fractional calculus to explore self-gravitating,\nhydrostatic spheres governed by a polytropic equation of state\n\\P=K\\rho^{1+1/n}. We focus on structures with polytropic indices ranging from 1\nto 3 and consider relativistic and fractional parameters, denoted by \\sigma and\n\\alpha, respectively. The stability of these relativistic polytropes is\nevaluated using the critical point method, which is associated with the\nenergetic principles developed in 1964 by Tooper. This approach enables us to\npinpoint the critical mass and radius at which where polytropic spheres shift\nfrom stable to unstable states. The results highlight the critical relativistic\nparameter where the polytrope's mass peaks, signaling the onset of radial\ninstability. For polytropic indices of 1, 1.5, 2, and 3 with a fractional\nparameter \\alpha, we observe stable relativistic polytropes for \\sigma values\nbelow the critical thresholds of \\sigma= 0.42, 0.20, 0.10, and 0.0,\nrespectively. Conversely, instability emerges as \\sigma surpasses these\ncritical values. Our comprehensive calculations reveal that the critical\nrelativistic value (\\sigma_{CR}) for the onset of instability tends to increase\nas the fractional parameter {\\alpha} decreases.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"x09vzX_pENvTcWvB2Slkl22e_MGt9Tl9H3gdEd3ROf4","pdfSize":"1024634"}