{"id":"2407.01054","title":"Joint Pruning and Channel-wise Mixed-Precision Quantization for\n  Efficient Deep Neural Networks","authors":"Beatrice Alessandra Motetti, Matteo Risso, Alessio Burrello, Enrico\n  Macii, Massimo Poncino, Daniele Jahier Pagliari","authorsParsed":[["Motetti","Beatrice Alessandra",""],["Risso","Matteo",""],["Burrello","Alessio",""],["Macii","Enrico",""],["Poncino","Massimo",""],["Pagliari","Daniele Jahier",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 08:07:02 GMT"}],"updateDate":"2024-07-02","timestamp":1719821222000,"abstract":"  The resource requirements of deep neural networks (DNNs) pose significant\nchallenges to their deployment on edge devices. Common approaches to address\nthis issue are pruning and mixed-precision quantization, which lead to latency\nand memory occupation improvements. These optimization techniques are usually\napplied independently. We propose a novel methodology to apply them jointly via\na lightweight gradient-based search, and in a hardware-aware manner, greatly\nreducing the time required to generate Pareto-optimal DNNs in terms of accuracy\nversus cost (i.e., latency or memory). We test our approach on three\nedge-relevant benchmarks, namely CIFAR-10, Google Speech Commands, and Tiny\nImageNet. When targeting the optimization of the memory footprint, we are able\nto achieve a size reduction of 47.50% and 69.54% at iso-accuracy with the\nbaseline networks with all weights quantized at 8 and 2-bit, respectively. Our\nmethod surpasses a previous state-of-the-art approach with up to 56.17% size\nreduction at iso-accuracy. With respect to the sequential application of\nstate-of-the-art pruning and mixed-precision optimizations, we obtain\ncomparable or superior results, but with a significantly lowered training time.\nIn addition, we show how well-tailored cost models can improve the cost versus\naccuracy trade-offs when targeting specific hardware for deployment.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"yyaL73J3tNyy0oAStYtXnHxx-k5LhmsSRyQa9xV29sM","pdfSize":"1518473"}