{"id":"2407.18568","title":"Learning Spectral-Decomposed Tokens for Domain Generalized Semantic\n  Segmentation","authors":"Jingjun Yi and Qi Bi and Hao Zheng and Haolan Zhan and Wei Ji and\n  Yawen Huang and Yuexiang Li and Yefeng Zheng","authorsParsed":[["Yi","Jingjun",""],["Bi","Qi",""],["Zheng","Hao",""],["Zhan","Haolan",""],["Ji","Wei",""],["Huang","Yawen",""],["Li","Yuexiang",""],["Zheng","Yefeng",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 07:50:48 GMT"},{"version":"v2","created":"Mon, 29 Jul 2024 02:05:19 GMT"}],"updateDate":"2024-07-30","timestamp":1721980248000,"abstract":"  The rapid development of Vision Foundation Model (VFM) brings inherent\nout-domain generalization for a variety of down-stream tasks. Among them,\ndomain generalized semantic segmentation (DGSS) holds unique challenges as the\ncross-domain images share common pixel-wise content information but vary\ngreatly in terms of the style. In this paper, we present a novel\nSpectral-dEcomposed Token (SET) learning framework to advance the frontier.\nDelving into further than existing fine-tuning token & frozen backbone\nparadigm, the proposed SET especially focuses on the way learning\nstyle-invariant features from these learnable tokens. Particularly, the frozen\nVFM features are first decomposed into the phase and amplitude components in\nthe frequency space, which mainly contain the information of content and style,\nrespectively, and then separately processed by learnable tokens for\ntask-specific information extraction. After the decomposition, style variation\nprimarily impacts the token-based feature enhancement within the amplitude\nbranch. To address this issue, we further develop an attention optimization\nmethod to bridge the gap between style-affected representation and static\ntokens during inference. Extensive cross-domain experiments show its\nstate-of-the-art performance.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"rZ5W0nVQWNVk_IdqoHmkcPAT127z1qYJK1oU1j6oryo","pdfSize":"4537561"}