{"id":"2407.07978","title":"Symmetries of the gravitational scattering in the absence of peeling","authors":"Marc Geiller, Alok Laddha, C\\'eline Zwikel","authorsParsed":[["Geiller","Marc",""],["Laddha","Alok",""],["Zwikel","Céline",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 18:18:42 GMT"}],"updateDate":"2024-07-12","timestamp":1720635522000,"abstract":"  The symmetries of the gravitational scattering are intimately tied to the\nsymmetries which preserve asymptotic flatness at null infinity. In Penrose's\ndefinition of asymptotic flatness, a central role is played by the notion of\nasymptotic simplicity and the ensuing peeling behavior which dictates the decay\nrate of the Weyl tensor. However, there is now accumulating evidence that in a\ngeneric gravitational scattering the peeling property is broken, so that the\nspacetime is not asymptotically-flat in the usual sense. These obstructions to\npeeling can be traced back to the existence of universal radiative low\nfrequency observables called ''tails to the displacement memory''. The\nuniversality of these tail modes is the statement of the classical logarithmic\nsoft graviton theorem of Sahoo, Saha and Sen. Four-dimensional gravitation\nscattering therefore exhibits a rich infrared interplay between tail to the\nmemory, loss of peeling, and universal logarithmic soft theorems. In this paper\nwe study the solution space and the asymptotic symmetries for\nlogarithmically-asymptotically-flat spacetimes. These are defined by a\npolyhomogeneous expansion of the Bondi metric which gives rise to a loss of\npeeling, and represent the classical arena which can accommodate a generic\ngravitational scattering containing tails to the memory. We show that while the\ncodimension-two generalized BMS charges are sensitive to the loss of peeling at\n$\\mathcal{I}^+$, the flux is insensitive to the fate of peeling. Due to the\ntail to the memory, the soft superrotation flux contains a logarithmic\ndivergence whose coefficient is the quantity which is conserved in the\nscattering by virtue of the logarithmic soft theorem. In our analysis we also\nexhibit new logarithmic evolution equations and flux-balance laws, whose\npresence suggests the existence of an infinite tower of subleading logarithmic\nsoft graviton theorems.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"YKtExF8UKNpnnnu0G8RZwv54reIgFLArDW3RbzW4HUw","pdfSize":"568964"}