{"id":"2407.08743","title":"Genetic Bottleneck and the Emergence of High Intelligence by Scaling-out\n  and High Throughput","authors":"Arifa Khan, Saravanan P, and Venkatesan S.K.","authorsParsed":[["Khan","Arifa",""],["P","Saravanan",""],["K.","Venkatesan S.",""]],"versions":[{"version":"v1","created":"Wed, 29 May 2024 14:35:39 GMT"}],"updateDate":"2024-07-15","timestamp":1716993339000,"abstract":"  We study the biological evolution of low-latency natural neural networks for\nshort-term survival, and its parallels in the development of low latency\nhigh-performance Central Processing Unit in computer design and architecture.\nThe necessity of accurate high-quality display of motion picture led to the\nspecial processing units known as the GPU, just as how special visual cortex\nregions of animals produced such low-latency computational capacity. The human\nbrain, especially considered as nothing but a scaled-up version of a primate\nbrain evolved in response to genomic bottleneck, producing a brain that is\ntrainable and prunable by society, and as a further extension, invents\nlanguage, writing and storage of narratives displaced in time and space. We\nconclude that this modern digital invention of social media and the archived\ncollective common corpus has further evolved from just simple CPU-based\nlow-latency fast retrieval to high-throughput parallel processing of data using\nGPUs to train Attention based Deep Learning Neural Networks producing\nGenerative AI with aspects like toxicity, bias, memorization, hallucination,\nwith intriguing close parallels in humans and their society. We show how this\npaves the way for constructive approaches to eliminating such drawbacks from\nhuman society and its proxy and collective large-scale mirror, the Generative\nAI of the LLMs.\n","subjects":["Computing Research Repository/Other Computer Science"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"JvYm3n_wg81bHvTT6iRcrUcdEBasdJqPEuJXQc8USkE","pdfSize":"347365","objectId":"0x30650cd8f2f2f26b80e8118e2255d62ae6caf141b87acd6eea0c01256b8127cf","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
