{"id":"2407.12721","title":"Unlocking planetesimal magnetic field histories: a refined, versatile\n  model for thermal evolution and dynamo generation","authors":"Hannah R. Sanderson, James F.J. Bryson, Claire I.O. Nichols,\n  Christopher J. Davies","authorsParsed":[["Sanderson","Hannah R.",""],["Bryson","James F. J.",""],["Nichols","Claire I. O.",""],["Davies","Christopher J.",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 16:40:14 GMT"}],"updateDate":"2024-07-18","timestamp":1721234414000,"abstract":"  The thermal and magnetic histories of planetesimals provide unique insights\ninto the formation and evolution of Earth's building blocks. These histories\ncan be gleaned from meteorites by using numerical models to translate measured\nproperties into planetesimal behaviour. In this paper, we present a new 1D\nplanetesimal thermal evolution and dynamo generation model. This magnetic field\ngeneration model is the first of a differentiated, mantled planetesimal that\nincludes both mantle convection and non-eutectic core solidification. We have\nimproved fundamental aspects of mantle heat transport by including a more\ndetailed viscosity model and stagnant lid convection parametrisations\nconsistent with internal heating. We have also added radiogenic heating from\n$^{60}Fe$ in the metallic Fe-FeS core. Additionally, we implement a combined\nthermal and compositional buoyancy flux, as well as the latest magnetic field\nscaling laws to predict magnetic field strengths during the planetesimal's\nthermal evolution until core solidification is complete. We illustrate the\nconsequences of our model changes with an example run for a 500 km radius\nplanetesimal. These effects include more rapid erosion of core thermal\nstratification and longer duration of mantle convection compared to previous\nstudies. The additional buoyancy from core solidification has a marginal effect\non dynamo strength, but for some initial core sulfur contents it can prevent\ncessation of the dynamo when mantle convection ends. Our model can be used to\ninvestigate the effects of individual parameters on dynamo generation and\nconstrain properties of specific meteorite parent bodies. Combined, these\nupdates mean this model can predict the most reliable and complete magnetic\nfield history for a planetesimal to date, so is a valuable tool for deciphering\nplanetesimal behaviour from meteorite properties.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"DaEIUMgdx9Xs2eHbmhoiIUFcGXocf_xEt32Yu7qzfU4","pdfSize":"28247695","objectId":"0xfb64992ae856e813807faa53653df46336726922650c1938332f46e308104660","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
