{"id":"2407.05861","title":"Dynamical Swirl Structures Powered by Microswimmers in Active Nematics","authors":"Partha Sarathi Mondal, Pawan Kumar Mishra, Tam\\'as Vicsek, Shradha\n  Mishra","authorsParsed":[["Mondal","Partha Sarathi",""],["Mishra","Pawan Kumar",""],["Vicsek","Tamás",""],["Mishra","Shradha",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 12:27:19 GMT"}],"updateDate":"2024-07-09","timestamp":1720441639000,"abstract":"  Active nematics, in their pure form, have demonstrated a plethora of dynamic\nand steady state behaviors, including large-scale dynamic structures,\ncollective flows, and intricate multi-spatial temporal dynamics. This\ncomplexity further increases in the presence of external polar agents. We\ninvestigate active nematics interspersed with polar microswimmers, akin to\nactive apolar cells infused with active impurities, microswimmers. Our\ncomprehensive numerical study reveals that varying the microswimmers' motility\ninduces a novel spatiotemporal state in the active nematics backdrop. This\nstate is marked by macroscopic swirl-like structures and a reduction in the\noverall order of the active nematics. Interestingly, this state emerges at\nintermediate motility levels, where microswimmers form local clusters and\nexhibit coherent motion. However, at higher motility levels, the swirls become\nless coherent, and microswimmer clustering intensifies. We show that the effect\nof the polar microswimmers on active nematics can be interpreted as a\nspatiotemporally correlated colored noise on active nematics, which promotes\nbend instability in active nematics, leading to the observed swirling dynamics.\nOur findings indicate that the spatiotemporal states are highly sensitive to\nthe microswimmers' motility, offering potential avenues for pathogen\nidentification based on known motility characteristics\n","subjects":["Condensed Matter/Statistical Mechanics","Condensed Matter/Soft Condensed Matter"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"00NH71FWwLjmbiUEtymhjF-m_5FSlhs3d5gk_Q0U5TA","pdfSize":"46901855"}