{"id":"2407.15311","title":"Polarized cold-neutron reflectometry at JRR-3/MINE2 for the development\n  of ultracold-neutron spin analyzers for a neutron EDM experiment at TRIUMF","authors":"Takashi Higuchi, Hiroaki Akatsuka, Alexis Brossard, Derek Fujimoto,\n  Pietro Giampa, Sean Hansen-Romu, Kichiji Hatanaka, Masahiro Hino, Go\n  Ichikawa, Sohei Imajo, Blair Jamieson, Shinsuke Kawasaki, Masaaki Kitaguchi,\n  Russell Mammei, Ryohei Matsumiya, Kenji Mishima, R\\\"udiger Picker, Wolfgang\n  Schreyer, Hirohiko M. Shimizu, Steve Sidhu, Sean Vanbergen","authorsParsed":[["Higuchi","Takashi",""],["Akatsuka","Hiroaki",""],["Brossard","Alexis",""],["Fujimoto","Derek",""],["Giampa","Pietro",""],["Hansen-Romu","Sean",""],["Hatanaka","Kichiji",""],["Hino","Masahiro",""],["Ichikawa","Go",""],["Imajo","Sohei",""],["Jamieson","Blair",""],["Kawasaki","Shinsuke",""],["Kitaguchi","Masaaki",""],["Mammei","Russell",""],["Matsumiya","Ryohei",""],["Mishima","Kenji",""],["Picker","Rüdiger",""],["Schreyer","Wolfgang",""],["Shimizu","Hirohiko M.",""],["Sidhu","Steve",""],["Vanbergen","Sean",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 00:45:47 GMT"},{"version":"v2","created":"Wed, 4 Sep 2024 10:59:10 GMT"}],"updateDate":"2024-09-05","timestamp":1721609147000,"abstract":"  The neutron electric dipole moment (EDM) is a sensitive probe for currently\nundiscovered sources of charge-parity symmetry violation. As part of the TRIUMF\nUltracold Advanced Neutron (TUCAN) collaboration, we are developing spin\nanalyzers for ultracold neutrons (UCNs) to be used for a next-generation\nexperiment to measure the neutron EDM with unprecedented precision. Spin-state\nanalysis of UCNs constitutes an essential part of the neutron EDM measurement\nsequence. Magnetized iron films used as spin filters of UCNs are crucial\nexperimental components, whose performance directly influences the statistical\nsensitivity of the measurement. To test such iron film spin filters, we propose\nthe use of polarized cold-neutron reflectometry, in addition to conventional\nUCN transmission experiments. The new method provides information on iron film\nsamples complementary to the UCN tests and accelerates the development cycles.\nWe developed a collaborative effort to produce iron film spin filters and test\nthem with cold and ultracold neutrons available at JRR-3/MINE2 and J-PARC/MLF\nBL05. In this article, we review the methods of neutron EDM measurements,\ndiscuss the complementarity of this new approach to test UCN spin filters,\nprovide an overview of our related activities, and present the first results of\npolarized cold-neutron reflectometry recently conducted at the MINE2 beamline.\n","subjects":["Physics/Instrumentation and Detectors","Physics/Nuclear Experiment"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"w6iG7GCZMSYZdKh-r-eexr4xFGeJACT8xBnpm7xhqek","pdfSize":"5923542"}