{"id":"2407.13945","title":"FANTAstic SEquences and Where to Find Them: Faithful and Efficient API\n  Call Generation through State-tracked Constrained Decoding and Reranking","authors":"Zhuoer Wang, Leonardo F. R. Ribeiro, Alexandros Papangelis, Rohan\n  Mukherjee, Tzu-Yen Wang, Xinyan Zhao, Arijit Biswas, James Caverlee, Angeliki\n  Metallinou","authorsParsed":[["Wang","Zhuoer",""],["Ribeiro","Leonardo F. R.",""],["Papangelis","Alexandros",""],["Mukherjee","Rohan",""],["Wang","Tzu-Yen",""],["Zhao","Xinyan",""],["Biswas","Arijit",""],["Caverlee","James",""],["Metallinou","Angeliki",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 23:44:02 GMT"}],"updateDate":"2024-07-22","timestamp":1721346242000,"abstract":"  API call generation is the cornerstone of large language models' tool-using\nability that provides access to the larger world. However, existing supervised\nand in-context learning approaches suffer from high training costs, poor data\nefficiency, and generated API calls that can be unfaithful to the API\ndocumentation and the user's request. To address these limitations, we propose\nan output-side optimization approach called FANTASE. Two of the unique\ncontributions of FANTASE are its State-Tracked Constrained Decoding (SCD) and\nReranking components. SCD dynamically incorporates appropriate API constraints\nin the form of Token Search Trie for efficient and guaranteed generation\nfaithfulness with respect to the API documentation. The Reranking component\nefficiently brings in the supervised signal by leveraging a lightweight model\nas the discriminator to rerank the beam-searched candidate generations of the\nlarge language model. We demonstrate the superior performance of FANTASE in API\ncall generation accuracy, inference efficiency, and context efficiency with\nDSTC8 and API Bank datasets.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"-HFaSBvYbl2zmqrAmCfxMA8W-FnZrEiJmdCh0J458Oo","pdfSize":"720194"}