{"id":"2407.03961","title":"Leveraging Latent Diffusion Models for Training-Free In-Distribution\n  Data Augmentation for Surface Defect Detection","authors":"Federico Girella, Ziyue Liu, Franco Fummi, Francesco Setti, Marco\n  Cristani, Luigi Capogrosso","authorsParsed":[["Girella","Federico",""],["Liu","Ziyue",""],["Fummi","Franco",""],["Setti","Francesco",""],["Cristani","Marco",""],["Capogrosso","Luigi",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 14:28:52 GMT"},{"version":"v2","created":"Thu, 11 Jul 2024 14:14:22 GMT"}],"updateDate":"2024-07-12","timestamp":1720103332000,"abstract":"  Defect detection is the task of identifying defects in production samples.\nUsually, defect detection classifiers are trained on ground-truth data formed\nby normal samples (negative data) and samples with defects (positive data),\nwhere the latter are consistently fewer than normal samples. State-of-the-art\ndata augmentation procedures add synthetic defect data by superimposing\nartifacts to normal samples to mitigate problems related to unbalanced training\ndata. These techniques often produce out-of-distribution images, resulting in\nsystems that learn what is not a normal sample but cannot accurately identify\nwhat a defect looks like. In this work, we introduce DIAG, a training-free\nDiffusion-based In-distribution Anomaly Generation pipeline for data\naugmentation. Unlike conventional image generation techniques, we implement a\nhuman-in-the-loop pipeline, where domain experts provide multimodal guidance to\nthe model through text descriptions and region localization of the possible\nanomalies. This strategic shift enhances the interpretability of results and\nfosters a more robust human feedback loop, facilitating iterative improvements\nof the generated outputs. Remarkably, our approach operates in a zero-shot\nmanner, avoiding time-consuming fine-tuning procedures while achieving superior\nperformance. We demonstrate the efficacy and versatility of DIAG with respect\nto state-of-the-art data augmentation approaches on the challenging KSDD2\ndataset, with an improvement in AP of approximately 18% when positive samples\nare available and 28% when they are missing. The source code is available at\nhttps://github.com/intelligolabs/DIAG.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"zI6jT6uGXEXNNslm68btDBTAkKVGJ6ozKV0I9Dhb2zw","pdfSize":"9363136"}