{"id":"2407.21202","title":"Rolling in the deep of cognitive and AI biases","authors":"Athena Vakali and Nicoleta Tantalaki","authorsParsed":[["Vakali","Athena",""],["Tantalaki","Nicoleta",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 21:34:04 GMT"}],"updateDate":"2024-08-01","timestamp":1722375244000,"abstract":"  Nowadays, we delegate many of our decisions to Artificial Intelligence (AI)\nthat acts either in solo or as a human companion in decisions made to support\nseveral sensitive domains, like healthcare, financial services and law\nenforcement. AI systems, even carefully designed to be fair, are heavily\ncriticized for delivering misjudged and discriminated outcomes against\nindividuals and groups. Numerous work on AI algorithmic fairness is devoted on\nMachine Learning pipelines which address biases and quantify fairness under a\npure computational view. However, the continuous unfair and unjust AI outcomes,\nindicate that there is urgent need to understand AI as a sociotechnical system,\ninseparable from the conditions in which it is designed, developed and\ndeployed. Although, the synergy of humans and machines seems imperative to make\nAI work, the significant impact of human and societal factors on AI bias is\ncurrently overlooked. We address this critical issue by following a radical new\nmethodology under which human cognitive biases become core entities in our AI\nfairness overview. Inspired by the cognitive science definition and taxonomy of\nhuman heuristics, we identify how harmful human actions influence the overall\nAI lifecycle, and reveal human to AI biases hidden pathways. We introduce a new\nmapping, which justifies the human heuristics to AI biases reflections and we\ndetect relevant fairness intensities and inter-dependencies. We envision that\nthis approach will contribute in revisiting AI fairness under deeper\nhuman-centric case studies, revealing hidden biases cause and effects.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"uiC0d5S8pf2FSQn_gPyTA34ZcBJl8YQmR_ka83wFnTM","pdfSize":"326889"}