{"id":"2407.17870","title":"Is the Digital Forensics and Incident Response Pipeline Ready for\n  Text-Based Threats in LLM Era?","authors":"Avanti Bhandarkar, Ronald Wilson, Anushka Swarup, Mengdi Zhu, Damon\n  Woodard","authorsParsed":[["Bhandarkar","Avanti",""],["Wilson","Ronald",""],["Swarup","Anushka",""],["Zhu","Mengdi",""],["Woodard","Damon",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 08:42:53 GMT"}],"updateDate":"2024-07-26","timestamp":1721896973000,"abstract":"  In the era of generative AI, the widespread adoption of Neural Text\nGenerators (NTGs) presents new cybersecurity challenges, particularly within\nthe realms of Digital Forensics and Incident Response (DFIR). These challenges\nprimarily involve the detection and attribution of sources behind advanced\nattacks like spearphishing and disinformation campaigns. As NTGs evolve, the\ntask of distinguishing between human and NTG-authored texts becomes critically\ncomplex. This paper rigorously evaluates the DFIR pipeline tailored for\ntext-based security systems, specifically focusing on the challenges of\ndetecting and attributing authorship of NTG-authored texts. By introducing a\nnovel human-NTG co-authorship text attack, termed CS-ACT, our study uncovers\nsignificant vulnerabilities in traditional DFIR methodologies, highlighting\ndiscrepancies between ideal scenarios and real-world conditions. Utilizing 14\ndiverse datasets and 43 unique NTGs, up to the latest GPT-4, our research\nidentifies substantial vulnerabilities in the forensic profiling phase,\nparticularly in attributing authorship to NTGs. Our comprehensive evaluation\npoints to factors such as model sophistication and the lack of distinctive\nstyle within NTGs as significant contributors for these vulnerabilities. Our\nfindings underscore the necessity for more sophisticated and adaptable\nstrategies, such as incorporating adversarial learning, stylizing NTGs, and\nimplementing hierarchical attribution through the mapping of NTG lineages to\nenhance source attribution. This sets the stage for future research and the\ndevelopment of more resilient text-based security systems.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"oKOxDzDFtl1sSqVk24ll9kilcjmARxp1Uj1xj2CQy_o","pdfSize":"1775355"}