{"id":"2407.01754","title":"Error-rate reduction in network-based biocomputation","authors":"Pradheebha Surendiran, Marko U\\v{s}aj, Till Korten, Alf M{\\aa}nsson,\n  Heiner Linke","authorsParsed":[["Surendiran","Pradheebha",""],["Ušaj","Marko",""],["Korten","Till",""],["Månsson","Alf",""],["Linke","Heiner",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 19:32:33 GMT"}],"updateDate":"2024-07-03","timestamp":1719862353000,"abstract":"  Network-based biocomputation (NBC) is an alternative parallel computing\nparadigm that encodes combinatorial problems into a nanofabricated device's\ngraphical network of channels, enabling cytoskeletal filaments propelled by\nmolecular motors to explore the problems' solution space. NBC promises to\nrequire significantly less energy than traditional computers due to the high\nenergy efficiency of molecular motors. However, error rates associated with the\npass junction crossing, the primary path-regulating geometry, pose a bottleneck\nfor scaling up this technology. Here, we optimize the geometry of the pass\njunction for low error rates for the actin-myosin system. To do so, we evaluate\nvarious pass junction designs that differ in features, such as the nanochannel\nwidth, junction crossing area, and angles of a funnel-shaped output part of the\njunction. Error rates were measured experimentally by using gliding motility\nassay and as well as by simulation methods. The final optimized design\ndisplayed a decreased error rate of under 1 percent compared to the previous\n2-4 percent. We anticipate this improvement will enable scaling up NBC networks\nfrom tens to hundreds of pass junctions. However, the results of 2D junction\noptimizations also suggest that further drastic reduction of error rates in\ntwo-dimensional pass junctions is unlikely, necessitating three-dimensional\njunctions, such as bridges or tunnels, for complete error rate mitigation.\nFurthermore, the simulation results demonstrate that including a layer of\nmyosin motor on the channel provides a better fit between simulation and\nexperimental results.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"zOUQPkpN2Q6pm9L3nFh4oEP-odHB3aEZVTxyXTPyRRw","pdfSize":"1326934"}