{"id":"2407.15767","title":"Reinterpretation of the Fermi acceleration of cosmic rays in terms of\n  the ballistic surfing acceleration in supernova shocks","authors":"Krzysztof Stasiewicz","authorsParsed":[["Stasiewicz","Krzysztof",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 16:18:11 GMT"}],"updateDate":"2024-07-23","timestamp":1721665091000,"abstract":"  The applicability of first-order Fermi acceleration in explaining the cosmic\nray spectrum has been reexamined using recent results on shock acceleration\nmechanisms from the Multiscale Magnetospheric mission in Earth's bow shock. It\nis demonstrated that the Fermi mechanism is a crude approximation of the\nballistic surfing acceleration (BSA) mechanism. While both mechanisms yield\nsimilar expressions for the energy gain of a particle after encountering a\nshock once, leading to similar power-law distributions of the cosmic ray energy\nspectrum, the Fermi mechanism is found to be inconsistent with fundamental\nequations of electrodynamics.\n  It is shown that the spectral index of cosmic rays is determined by the\naverage magnetic field compression rather than the density compression, as in\nthe Fermi model. It is shown that the knee observed in the spectrum at an\nenergy of 5x10^{15} eV could correspond to ions with a gyroradius comparable to\nthe size of shocks in supernova remnants. The BSA mechanism can accurately\nreproduce the observed spectral index s = -2.5 below the knee energy, as well\nas a steeper spectrum, s = -3, above the knee. The acceleration time up to the\nknee, as implied by BSA, is on the order of 300 years.\n  First-order Fermi acceleration does not represent a physically valid\nmechanism and should be replaced by ballistic surfing acceleration in\napplications or models related to quasi-perpendicular shocks in space. It is\nnoted that BSA, which operates outside of shocks, was previously misattributed\nto shock drift acceleration (SDA), which operates within shocks.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Physics/Space Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_U6BEC-OutRHW8xUSPpk7TOb3O6dxq3imCrzZBpbh8I","pdfSize":"483770","objectId":"0x8c0e2e5ed020667e2d1a21dd88fd8ba7380d40f74afe9e326cbf502896fbf44c","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
