{"id":"2407.01511","title":"CRAB: Cross-environment Agent Benchmark for Multimodal Language Model\n  Agents","authors":"Tianqi Xu, Linyao Chen, Dai-Jie Wu, Yanjun Chen, Zecheng Zhang, Xiang\n  Yao, Zhiqiang Xie, Yongchao Chen, Shilong Liu, Bochen Qian, Philip Torr,\n  Bernard Ghanem, Guohao Li","authorsParsed":[["Xu","Tianqi",""],["Chen","Linyao",""],["Wu","Dai-Jie",""],["Chen","Yanjun",""],["Zhang","Zecheng",""],["Yao","Xiang",""],["Xie","Zhiqiang",""],["Chen","Yongchao",""],["Liu","Shilong",""],["Qian","Bochen",""],["Torr","Philip",""],["Ghanem","Bernard",""],["Li","Guohao",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 17:55:04 GMT"}],"updateDate":"2024-07-02","timestamp":1719856504000,"abstract":"  The development of autonomous agents increasingly relies on Multimodal\nLanguage Models (MLMs) to perform tasks described in natural language with GUI\nenvironments, such as websites, desktop computers, or mobile phones. Existing\nbenchmarks for MLM agents in interactive environments are limited by their\nfocus on a single environment, lack of detailed and generalized evaluation\nmethods, and the complexities of constructing tasks and evaluators. To overcome\nthese limitations, we introduce Crab, the first agent benchmark framework\ndesigned to support cross-environment tasks, incorporating a graph-based\nfine-grained evaluation method and an efficient mechanism for task and\nevaluator construction. Our framework supports multiple devices and can be\neasily extended to any environment with a Python interface. Leveraging Crab, we\ndeveloped a cross-platform Crab Benchmark-v0 comprising 100 tasks in computer\ndesktop and mobile phone environments. We evaluated four advanced MLMs using\ndifferent single and multi-agent system configurations on this benchmark. The\nexperimental results demonstrate that the single agent with GPT-4o achieves the\nbest completion ratio of 35.26%. All framework code, agent code, and task\ndatasets are publicly available at https://github.com/camel-ai/crab.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"CvfjGrVZwLgiRfZDPQBBoP9qc9N7UjvUX-cGVmrZo6M","pdfSize":"28074853","objectId":"0x5eef407ef0f8682f953264ff901bcdd69cf9d1fd62b6377a53af0ba9dcecb463","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
