{"id":"2407.15653","title":"Mobile-to-Mobile Uncorrelated Scatter Channels","authors":"Michael Walter, Martin Schmidhammer, Miguel A. Bellido-Manganell,\n  Thomas Wiedemann and Dmitriy Shutin","authorsParsed":[["Walter","Michael",""],["Schmidhammer","Martin",""],["Bellido-Manganell","Miguel A.",""],["Wiedemann","Thomas",""],["Shutin","Dmitriy",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 14:14:22 GMT"}],"updateDate":"2024-07-23","timestamp":1721657662000,"abstract":"  In this paper, we present a complete analytic probability based description\nof mobile-to-mobile uncorrelated scatter channels. The correlation based\ndescription introduced by Bello and Matz is thus complemented by the presented\nprobabilistic description leading to a common theoretical description of\nuncorrelated scatter channels. Furthermore, we introduce novel twodimensional\nhybrid characteristic probability density functions, which remain a probability\ndensity in one of the variables and a characteristic function in the other\nvariable. Such a probability based description allows us to derive a\nmathematical model, in which the attenuation of the scattering components is\ninherently included in these two-dimensional functions. Therefore, there is no\nneed to determine the path loss exponent. Additionally, the Doppler probability\ndensity function with the inclusion of the path loss leads to a concave\nfunction of the Doppler spectrum, which is quite different from the Jakes and\nDoppler spectra and can be directly parameterized by the velocity vectors and\ngeometry of the scattering plane. Thus, knowing those parameters permits the\ntheoretical computation of the Doppler spectra and temporal characteristic\nfunctions. Finally, we present a comparison between the computed probability\nbased theoretical results and measurement data for a generic mobile-to-mobile\nchannel. The agreement between the two shows the usefulness of the probability\nbased description and confirms new shapes of the Doppler power spectra.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0sax2BCJJb7IVWJ2HiKH1EoSPa4GBh409d2mNUCp9hY","pdfSize":"17815517"}