{"id":"2407.00900","title":"MathCAMPS: Fine-grained Synthesis of Mathematical Problems From Human\n  Curricula","authors":"Shubhra Mishra, Gabriel Poesia, Belinda Mo, Noah D. Goodman","authorsParsed":[["Mishra","Shubhra",""],["Poesia","Gabriel",""],["Mo","Belinda",""],["Goodman","Noah D.",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 01:56:28 GMT"}],"updateDate":"2024-07-02","timestamp":1719798988000,"abstract":"  Mathematical problem solving is an important skill for Large Language Models\n(LLMs), both as an important capability and a proxy for a range of reasoning\nabilities. Existing benchmarks probe a diverse set of skills, but they yield\naggregate accuracy metrics, obscuring specific abilities or weaknesses.\nFurthermore, they are difficult to extend with new problems, risking data\ncontamination over time. To address these challenges, we propose MathCAMPS: a\nmethod to synthesize high-quality mathematical problems at scale, grounded on\n44 fine-grained \"standards\" from the Mathematics Common Core (CC) Standard for\nK-8 grades. We encode each standard in a formal grammar, allowing us to sample\ndiverse symbolic problems and their answers. We then use LLMs to realize the\nsymbolic problems into word problems. We propose a cycle-consistency method for\nvalidating problem faithfulness. Finally, we derive follow-up questions from\nsymbolic structures and convert them into follow-up word problems - a novel\ntask of mathematical dialogue that probes for robustness in understanding.\nExperiments on 23 LLMs show surprising failures even in the strongest models\n(in particular when asked simple follow-up questions). Moreover, we evaluate\ntraining checkpoints of Pythia 12B on MathCAMPS, allowing us to analyze when\nparticular mathematical skills develop during its training. Our framework\nenables the community to reproduce and extend our pipeline for a fraction of\nthe typical cost of building new high-quality datasets.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"B_vjJw00FmgGQXIDhQaVNJK4FlaJoVXOZT-RND8Qft4","pdfSize":"718532"}