{"id":"2407.06405","title":"AI-driven multi-omics integration for multi-scale predictive modeling of\n  causal genotype-environment-phenotype relationships","authors":"You Wu (1), Lei Xie (1,2,3,4) ((1) Ph.D. Program in Computer Science,\n  The Graduate Center, The City University of New York, New York, New York,\n  USA, (2) Ph.D. Program in Biology and Biochemistry, The Graduate Center, The\n  City University of New York, New York, New York, USA, (3) Department of\n  Computer Science, Hunter College, The City University of New York, New York,\n  New York, USA, (4) Helen and Robert Appel Alzheimers Disease Research\n  Institute, Feil Family Brain and Mind Research Institute, Weill Cornell\n  Medicine, Cornell University, New York, New York, USA)","authorsParsed":[["Wu","You",""],["Xie","Lei",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 21:23:25 GMT"}],"updateDate":"2024-07-10","timestamp":1720473805000,"abstract":"  Despite the wealth of single-cell multi-omics data, it remains challenging to\npredict the consequences of novel genetic and chemical perturbations in the\nhuman body. It requires knowledge of molecular interactions at all biological\nlevels, encompassing disease models and humans. Current machine learning\nmethods primarily establish statistical correlations between genotypes and\nphenotypes but struggle to identify physiologically significant causal factors,\nlimiting their predictive power. Key challenges in predictive modeling include\nscarcity of labeled data, generalization across different domains, and\ndisentangling causation from correlation. In light of recent advances in\nmulti-omics data integration, we propose a new artificial intelligence\n(AI)-powered biology-inspired multi-scale modeling framework to tackle these\nissues. This framework will integrate multi-omics data across biological\nlevels, organism hierarchies, and species to predict causal\ngenotype-environment-phenotype relationships under various conditions. AI\nmodels inspired by biology may identify novel molecular targets, biomarkers,\npharmaceutical agents, and personalized medicines for presently unmet medical\nneeds.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"BIRcZcUDpFnelqzuQopZxOBn3zPsCL0TTefj8mT7FUU","pdfSize":"15533253"}