{"id":"2407.17691","title":"System-Level Simulation Framework for NB-IoT: Key Features and\n  Performance Evaluation","authors":"Shutao Zhang, Wenkun Wen, Peiran Wu, Hongqing Huang, Liya Zhu, Yijia\n  Guo, Tingting Yang, and Minghua Xia","authorsParsed":[["Zhang","Shutao",""],["Wen","Wenkun",""],["Wu","Peiran",""],["Huang","Hongqing",""],["Zhu","Liya",""],["Guo","Yijia",""],["Yang","Tingting",""],["Xia","Minghua",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 01:24:53 GMT"},{"version":"v2","created":"Wed, 14 Aug 2024 03:43:23 GMT"}],"updateDate":"2024-08-15","timestamp":1721870693000,"abstract":"  Narrowband Internet of Things (NB-IoT) is a technology specifically\ndesignated by the 3rd Generation Partnership Project (3GPP) to meet the\nexplosive demand for massive machine-type communications (mMTC), and it is\nevolving to RedCap. Industrial companies have increasingly adopted NB-IoT as\nthe solution for mMTC due to its lightweight design and comprehensive technical\nspecifications released by 3GPP. This paper presents a system-level simulation\nframework for NB-IoT networks to evaluate their performance. The system-level\nsimulator is structured into four parts: initialization, pre-generation, main\nsimulation loop, and post-processing. Additionally, three essential features\nare investigated to enhance coverage, support massive connections, and ensure\nlow power consumption, respectively. Simulation results demonstrate that the\ncumulative distribution function curves of the signal-to-interference-and-noise\nratio fully comply with industrial standards. Furthermore, the throughput\nperformance explains how NB-IoT networks realize massive connections at the\ncost of data rate. This work highlights its practical utility and paves the way\nfor developing NB-IoT networks.\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"tn0weKOq-bXw9-uMgmlcRhGe11Jt9IiL4CMrJFsAQ1I","pdfSize":"3719020","objectId":"0x8a30c6947de9faeaf1d9977122f48ce846ea684b4bbbe1bd6b7ef2be9839dcbb","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
