{"id":"2407.02776","title":"A Framework for Quantum Finite-State Languages with Density Mapping","authors":"SeungYeop Baik, Sicheol Sung, Yo-Sub Han","authorsParsed":[["Baik","SeungYeop",""],["Sung","Sicheol",""],["Han","Yo-Sub",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 03:06:37 GMT"}],"updateDate":"2024-07-04","timestamp":1719975997000,"abstract":"  A quantum finite-state automaton (QFA) is a theoretical model designed to\nsimulate the evolution of a quantum system with finite memory in response to\nsequential input strings. We define the language of a QFA as the set of strings\nthat lead the QFA to an accepting state when processed from its initial state.\nQFAs exemplify how quantum computing can achieve greater efficiency compared to\nclassical computing. While being one of the simplest quantum models, QFAs are\nstill notably challenging to construct from scratch due to the preliminary\nknowledge of quantum mechanics required for superimposing unitary constraints\non the automata. Furthermore, even when QFAs are correctly assembled, the\nlimitations of a current quantum computer may cause fluctuations in the\nsimulation results depending on how an assembled QFA is translated into a\nquantum circuit.\n  We present a framework that provides a simple and intuitive way to build QFAs\nand maximize the simulation accuracy. Our framework relies on two methods:\nFirst, it offers a predefined construction for foundational types of QFAs that\nrecognize special languages MOD and EQU. They play a role of basic building\nblocks for more complex QFAs. In other words, one can obtain more complex QFAs\nfrom these foundational automata using standard language operations. Second, we\nimprove the simulation accuracy by converting these QFAs into quantum circuits\nsuch that the resulting circuits perform well on noisy quantum computers.\n  Our framework is available at https://github.com/sybaik1/qfa-toolkit.\n","subjects":["Computing Research Repository/Computation and Language","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"jnb_ZGENL2gJP2cnpDBHBCPVDM4QTIsYfWt0OYnSpvM","pdfSize":"847500"}