{"id":"2407.06579","title":"NoisyAG-News: A Benchmark for Addressing Instance-Dependent Noise in\n  Text Classification","authors":"Hongfei Huang and Tingting Liang and Xixi Sun and Zikang Jin and Yuyu\n  Yin","authorsParsed":[["Huang","Hongfei",""],["Liang","Tingting",""],["Sun","Xixi",""],["Jin","Zikang",""],["Yin","Yuyu",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 06:18:40 GMT"}],"updateDate":"2024-07-10","timestamp":1720505920000,"abstract":"  Existing research on learning with noisy labels predominantly focuses on\nsynthetic label noise. Although synthetic noise possesses well-defined\nstructural properties, it often fails to accurately replicate real-world noise\npatterns. In recent years, there has been a concerted effort to construct\ngeneralizable and controllable instance-dependent noise datasets for image\nclassification, significantly advancing the development of noise-robust\nlearning in this area. However, studies on noisy label learning for text\nclassification remain scarce. To better understand label noise in real-world\ntext classification settings, we constructed the benchmark dataset NoisyAG-News\nthrough manual annotation. Initially, we analyzed the annotated data to gather\nobservations about real-world noise. We qualitatively and quantitatively\ndemonstrated that real-world noisy labels adhere to instance-dependent\npatterns. Subsequently, we conducted comprehensive learning experiments on\nNoisyAG-News and its corresponding synthetic noise datasets using pre-trained\nlanguage models and noise-handling techniques. Our findings reveal that while\npre-trained models are resilient to synthetic noise, they struggle against\ninstance-dependent noise, with samples of varying confusion levels showing\ninconsistent performance during training and testing. These real-world noise\npatterns pose new, significant challenges, prompting a reevaluation of noisy\nlabel handling methods. We hope that NoisyAG-News will facilitate the\ndevelopment and evaluation of future solutions for learning with noisy labels.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"uENVVF2tI927uqLF1LuHHPWGqp4Z0MbU6NdPCFSoCUA","pdfSize":"11480688"}