{"id":"2407.14611","title":"The Smallsat Technology Accelerated Maturation Platform-1 (STAMP-1): A\n  Proposal to Advance Ultraviolet Science, Workforce, and Technology for the\n  Habitable Worlds Observatory","authors":"Kevin France, Jason Tumlinson, Brian Fleming, Mario Gennaro, Erika\n  Hamden, Stephan R. McCandliss, Paul Scowen, Evgenya Shkolnik, Sarah Tuttle,\n  Carlos J. Vargas, and Allison Youngblood","authorsParsed":[["France","Kevin",""],["Tumlinson","Jason",""],["Fleming","Brian",""],["Gennaro","Mario",""],["Hamden","Erika",""],["McCandliss","Stephan R.",""],["Scowen","Paul",""],["Shkolnik","Evgenya",""],["Tuttle","Sarah",""],["Vargas","Carlos J.",""],["Youngblood","Allison",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 18:11:45 GMT"}],"updateDate":"2024-07-23","timestamp":1721412705000,"abstract":"  NASA's Great Observatories Maturation Program (GOMAP) will advance the\nscience definition, technology, and workforce needed for the Habitable Worlds\nObservatory (HWO) with the goal of a Phase A start by the end of the current\ndecade. GOMAP offers long-term cost and schedule savings compared to the 'TRL 6\nby Preliminary Design Review' paradigm historically adopted by large NASA\nmissions. Many of the key technologies in the development queue for HWO require\nthe combined activities of 1) facility and process development for validation\nof technologies at the scale required for HWO and 2) deployment in the 'real\nworld' environment of mission Integration & Test prior to on-orbit operations.\nWe present a concept for the Smallsat Technology Accelerated Maturation\nPlatform (STAMP), an integrated facility, laboratory, and instrument prototype\ndevelopment program that could be supported through the GOMAP framework and\napplied to any of NASA's Future Great Observatories (FGOs). This brief\ndescribes the recommendation for the first entrant into this program,\n\"STAMP-1\", an ESPA Grande-class mission advancing key technologies to enable\nthe ultraviolet capabilities of HWO. STAMP-1 would advance new broadband\noptical coatings, high-sensitivity ultraviolet detector systems, and\nmulti-object target selection technology to TRL 6 with a flight demonstration.\nSTAMP-1 advances HWO technology on an accelerated timescale, building on\ncurrent ROSES SAT+APRA programs, reducing cost and schedule risk for HWO while\nconducting a compelling program of preparatory science and workforce\ndevelopment with direct benefits for HWO mission implementation in the 2030s.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"wY7hucpc_aIAX9GEZ1kY7eNjUV4rQocz3i5Jsgq5rCg","pdfSize":"787422"}