{"id":"2407.04405","title":"Discovering symbolic expressions with parallelized tree search","authors":"Kai Ruan, Ze-Feng Gao, Yike Guo, Hao Sun, Ji-Rong Wen, Yang Liu","authorsParsed":[["Ruan","Kai",""],["Gao","Ze-Feng",""],["Guo","Yike",""],["Sun","Hao",""],["Wen","Ji-Rong",""],["Liu","Yang",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 10:41:15 GMT"}],"updateDate":"2024-07-08","timestamp":1720176075000,"abstract":"  Symbolic regression plays a crucial role in modern scientific research thanks\nto its capability of discovering concise and interpretable mathematical\nexpressions from data. A grand challenge lies in the arduous search for\nparsimonious and generalizable mathematical formulas, in an infinite search\nspace, while intending to fit the training data. Existing algorithms have faced\na critical bottleneck of accuracy and efficiency over a decade when handling\nproblems of complexity, which essentially hinders the pace of applying symbolic\nregression for scientific exploration across interdisciplinary domains. To this\nend, we introduce a parallelized tree search (PTS) model to efficiently distill\ngeneric mathematical expressions from limited data. Through a series of\nextensive experiments, we demonstrate the superior accuracy and efficiency of\nPTS for equation discovery, which greatly outperforms the state-of-the-art\nbaseline models on over 80 synthetic and experimental datasets (e.g., lifting\nits performance by up to 99% accuracy improvement and one-order of magnitude\nspeed up). PTS represents a key advance in accurate and efficient data-driven\ndiscovery of symbolic, interpretable models (e.g., underlying physical laws)\nand marks a pivotal transition towards scalable symbolic learning.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"jfsYNFXl91QR_S3faem5ApQgAYHRN-Ys8QS2nzOZhDQ","pdfSize":"4207504"}