{"id":"2407.05451","title":"Speeding-up Large-scale LP Energy System Models: Using Graph-theory to\n  Remove the Overhead Cost of Flexible Modeling","authors":"Diego A. Tejada-Arango, German Morales-Espana, Juha Kiviluoma","authorsParsed":[["Tejada-Arango","Diego A.",""],["Morales-Espana","German",""],["Kiviluoma","Juha",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 17:25:33 GMT"}],"updateDate":"2024-07-09","timestamp":1720373133000,"abstract":"  Energy system models are crucial for planning, supporting, and understanding\nenergy transition pathways. Flexible energy modelling tools have emerged to\nprovide practitioners, planners, and decision-makers with various alternatives\nto represent diverse energy systems, including green hydrogen or exclusively\nrenewable-powered storage assets. The increased interaction between energy\nsectors, temporal resolution, and extensive geographical scopes have led to\nlarge-scale problems posing significant computational challenges. Despite\nimprovements in computing power and linear programming (LP) solvers,\nlarge-scale LP models are often simplified, sacrificing fidelity to speed up\nsolutions. This paper aims to debunk the misconception that an LP model's\nsimplicity cannot be improved without sacrificing fidelity. We propose\nexploiting the graph nature of energy systems using a single building block,\nthe Energy Asset, to reduce computational complexity. By using only one\nbuilding block, the Energy Asset, we avoid intermediary assets and connections,\nthus reducing the number of variables by 26% and constraints by 35%. This\napproach naturally speeds up solving times by 1.27 times without sacrificing\nmodel fidelity. Our illustrative case study demonstrates these improvements\ncompared to traditional two-building-block approaches. This paper raises\nawareness in the energy modelling community about the quality of LP models and\nshows that not all LPs are created equal. Our proposed method speeds up energy\nsystem models regardless of anticipated advances in software and hardware,\nallowing for the solution of larger and more detailed models with existing\ntechnology.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"cAJJhPG0H-GY5uJ_0Euv1zdBBbMjeFMlxxOcWoDxYgA","pdfSize":"1214226"}
