{"id":"2407.16742","title":"Quantum coherence in neutrino spin-flavor oscillations","authors":"Ashutosh Kumar Alok, Trambak Jyoti Chall, Neetu Raj Singh Chundawat,\n  Shireen Gangal and Gaetano Lambiase","authorsParsed":[["Alok","Ashutosh Kumar",""],["Chall","Trambak Jyoti",""],["Chundawat","Neetu Raj Singh",""],["Gangal","Shireen",""],["Lambiase","Gaetano",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 17:53:33 GMT"}],"updateDate":"2024-07-25","timestamp":1721757213000,"abstract":"  Coherence, which represents the superposition of orthogonal states, is a\nfundamental concept in quantum mechanics and can also be precisely defined\nwithin quantum resource theory. Thus exploring quantum coherence in neutrino\noscillations can not only help in examining the intrinsic quantum nature but\ncan also explore their potential applications in quantum information\ntechnologies. Previous studies on quantum coherence have focused on neutrino\nflavor oscillations (FO). However, FO imply that neutrinos have mass and this\ncan lead to the generation of a tiny but finite magnetic dipole moment of\nneutrinos through quantum loop diagrams at higher orders of perturbative\nexpansion of the interaction. This electromagnetic property of neutrinos can\ninduce spin flavor oscillations (SFO) in the presence of an external magnetic\nfield and hence is expected to enrich the study of coherence. In this work, we\ninvestigate quantum coherence in neutrino SFO with three flavor mixing within\nthe interstellar as well as intergalactic magnetic fields, quantified by the\n$l_1$ norm and the relative entropy of coherence, and express these measures in\nterms of neutrino SFO probabilities. For FO, coherence measures can sustain\nhigher values (say, within 50% of the maximum) over distances of several\nkilometers, which are relevant for terrestrial experiments like reactor and\naccelerator neutrinos. However, for SFO, we find that the coherence scale can\nextend to astrophysical distances, spanning from kiloparsecs to gigaparsecs.\n","subjects":["Physics/High Energy Physics - Phenomenology","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"x6dzR2zLg3Lt8VpzSmfLl5__1vtYgZPUOSZC6x9J8WI","pdfSize":"558986"}