{"id":"2407.15322","title":"Molecular design for cardiac cell differentiation using a small dataset\n  and decorated shape features","authors":"Fatemeh Etezadi, Shunichi Ito, Kosuke Yasui, Rodi Kado Abdalkader,\n  Itsunari Minami, Motonari Uesugi, Ganesh Pandian Namasivayam, Haruko Nakano,\n  Atsushi Nakano, Daniel M. Packwood","authorsParsed":[["Etezadi","Fatemeh",""],["Ito","Shunichi",""],["Yasui","Kosuke",""],["Abdalkader","Rodi Kado",""],["Minami","Itsunari",""],["Uesugi","Motonari",""],["Namasivayam","Ganesh Pandian",""],["Nakano","Haruko",""],["Nakano","Atsushi",""],["Packwood","Daniel M.",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 01:31:29 GMT"}],"updateDate":"2024-07-23","timestamp":1721611889000,"abstract":"  The discovery of small organic compounds for inducing stem cell\ndifferentiation is a time- and resource-intensive process. While data science\ncould, in principle, facilitate the discovery of these compounds, novel\napproaches are required due to the difficulty of acquiring training data from\nlarge numbers of example compounds. In this paper, we demonstrate the design of\na new compound for inducing cardiomyocyte differentiation using simple\nregression models trained with a data set containing only 80 examples. We\nintroduce decorated shape descriptors, an information-rich molecular feature\nrepresentation that integrates both molecular shape and hydrophilicity\ninformation. These models demonstrate improved performance compared to ones\nusing standard molecular descriptors based on shape alone. Model overtraining\nis diagnosed using a new type of sensitivity analysis. Our new compound is\ndesigned using a conservative molecular design strategy, and its effectiveness\nis confirmed through expression profiles of cardiomyocyte-related marker genes\nusing real-time polymerase chain reaction experiments on human iPS cell lines.\nThis work demonstrates a viable data-driven strategy for designing new\ncompounds for stem cell differentiation protocols and will be useful in\nsituations where training data is limited.\n","subjects":["Quantitative Biology/Biomolecules"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"4VUQGYirSr3vkTurBmvihavnOmPwnb6qDJc_jTb0sJ0","pdfSize":"6637707","objectId":"0x8b769f0c59faf9e98e7e1faac784ecf64229a54c46af3cef6dfc983bc8c79ba8","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
