{"id":"2407.08205","title":"OPIMA: Optical Processing-In-Memory for Convolutional Neural Network\n  Acceleration","authors":"Febin Sunny, Amin Shafiee, Abhishek Balasubramaniam, Mahdi Nikdast,\n  Sudeep Pasricha","authorsParsed":[["Sunny","Febin",""],["Shafiee","Amin",""],["Balasubramaniam","Abhishek",""],["Nikdast","Mahdi",""],["Pasricha","Sudeep",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 06:12:04 GMT"}],"updateDate":"2024-07-12","timestamp":1720678324000,"abstract":"  Recent advances in machine learning (ML) have spotlighted the pressing need\nfor computing architectures that bridge the gap between memory bandwidth and\nprocessing power. The advent of deep neural networks has pushed traditional Von\nNeumann architectures to their limits due to the high latency and energy\nconsumption costs associated with data movement between the processor and\nmemory for these workloads. One of the solutions to overcome this bottleneck is\nto perform computation within the main memory through processing-in-memory\n(PIM), thereby limiting data movement and the costs associated with it.\nHowever, DRAM-based PIM struggles to achieve high throughput and energy\nefficiency due to internal data movement bottlenecks and the need for frequent\nrefresh operations. In this work, we introduce OPIMA, a PIM-based ML\naccelerator, architected within an optical main memory. OPIMA has been designed\nto leverage the inherent massive parallelism within main memory while\nperforming high-speed, low-energy optical computation to accelerate ML models\nbased on convolutional neural networks. We present a comprehensive analysis of\nOPIMA to guide design choices and operational mechanisms. Additionally, we\nevaluate the performance and energy consumption of OPIMA, comparing it with\nconventional electronic computing systems and emerging photonic PIM\narchitectures. The experimental results show that OPIMA can achieve 2.98x\nhigher throughput and 137x better energy efficiency than the best-known prior\nwork.\n","subjects":["Computing Research Repository/Hardware Architecture","Computing Research Repository/Emerging Technologies","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"VnT3my6chEHdZrgTd_o3edQHTS_qNrLwNh01BUsPpug","pdfSize":"2199194"}