{"id":"2407.04335","title":"Geometrically Inspired Kernel Machines for Collaborative Learning Beyond\n  Gradient Descent","authors":"Mohit Kumar, Alexander Valentinitsch, Magdalena Fuchs, Mathias\n  Brucker, Juliana Bowles, Adnan Husakovic, Ali Abbas, and Bernhard A. Moser\n  (Institute of Signal Processing)","authorsParsed":[["Kumar","Mohit","","Institute of Signal Processing"],["Valentinitsch","Alexander","","Institute of Signal Processing"],["Fuchs","Magdalena","","Institute of Signal Processing"],["Brucker","Mathias","","Institute of Signal Processing"],["Bowles","Juliana","","Institute of Signal Processing"],["Husakovic","Adnan","","Institute of Signal Processing"],["Abbas","Ali","","Institute of Signal Processing"],["Moser","Bernhard A.","","Institute of Signal Processing"]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 08:20:27 GMT"}],"updateDate":"2024-07-08","timestamp":1720167627000,"abstract":"  This paper develops a novel mathematical framework for collaborative learning\nby means of geometrically inspired kernel machines which includes statements on\nthe bounds of generalisation and approximation errors, and sample complexity.\nFor classification problems, this approach allows us to learn bounded geometric\nstructures around given data points and hence solve the global model learning\nproblem in an efficient way by exploiting convexity properties of the related\noptimisation problem in a Reproducing Kernel Hilbert Space (RKHS). In this way,\nwe can reduce classification problems to determining the closest bounded\ngeometric structure from a given data point. Further advantages that come with\nour solution is that our approach does not require clients to perform multiple\nepochs of local optimisation using stochastic gradient descent, nor require\nrounds of communication between client/server for optimising the global model.\nWe highlight that numerous experiments have shown that the proposed method is a\ncompetitive alternative to the state-of-the-art.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"z1NQvEB-QDLUwQzEMixTAP26nntcFN40hDlqawQOs30","pdfSize":"3937521"}
