{"id":"2407.04888","title":"Unraveling Radiomics Complexity: Strategies for Optimal Simplicity in\n  Predictive Modeling","authors":"Mahdi Ait Lhaj Loutfi, Teodora Boblea Podasca, Alex Zwanenburg, Taman\n  Upadhaya, Jorge Barrios, David R. Raleigh, William C. Chen, Dante P.I.\n  Capaldi, Hong Zheng, Olivier Gevaert, Jing Wu, Alvin C. Silva, Paul J. Zhang,\n  Harrison X. Bai, Jan Seuntjens, Steffen L\\\"ock, Patrick O. Richard, Olivier\n  Morin, Caroline Reinhold, Martin Lepage, Martin Valli\\`eres","authorsParsed":[["Loutfi","Mahdi Ait Lhaj",""],["Podasca","Teodora Boblea",""],["Zwanenburg","Alex",""],["Upadhaya","Taman",""],["Barrios","Jorge",""],["Raleigh","David R.",""],["Chen","William C.",""],["Capaldi","Dante P. I.",""],["Zheng","Hong",""],["Gevaert","Olivier",""],["Wu","Jing",""],["Silva","Alvin C.",""],["Zhang","Paul J.",""],["Bai","Harrison X.",""],["Seuntjens","Jan",""],["Löck","Steffen",""],["Richard","Patrick O.",""],["Morin","Olivier",""],["Reinhold","Caroline",""],["Lepage","Martin",""],["Vallières","Martin",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 23:14:46 GMT"}],"updateDate":"2024-07-09","timestamp":1720221286000,"abstract":"  Background: The high dimensionality of radiomic feature sets, the variability\nin radiomic feature types and potentially high computational requirements all\nunderscore the need for an effective method to identify the smallest set of\npredictive features for a given clinical problem. Purpose: Develop a\nmethodology and tools to identify and explain the smallest set of predictive\nradiomic features. Materials and Methods: 89,714 radiomic features were\nextracted from five cancer datasets: low-grade glioma, meningioma, non-small\ncell lung cancer (NSCLC), and two renal cell carcinoma cohorts (n=2104).\nFeatures were categorized by computational complexity into morphological,\nintensity, texture, linear filters, and nonlinear filters. Models were trained\nand evaluated on each complexity level using the area under the curve (AUC).\nThe most informative features were identified, and their importance was\nexplained. The optimal complexity level and associated most informative\nfeatures were identified using systematic statistical significance analyses and\na false discovery avoidance procedure, respectively. Their predictive\nimportance was explained using a novel tree-based method. Results: MEDimage, a\nnew open-source tool, was developed to facilitate radiomic studies.\nMorphological features were optimal for MRI-based meningioma (AUC: 0.65) and\nlow-grade glioma (AUC: 0.68). Intensity features were optimal for CECT-based\nrenal cell carcinoma (AUC: 0.82) and CT-based NSCLC (AUC: 0.76). Texture\nfeatures were optimal for MRI-based renal cell carcinoma (AUC: 0.72). Tuning\nthe Hounsfield unit range improved results for CECT-based renal cell carcinoma\n(AUC: 0.86). Conclusion: Our proposed methodology and software can estimate the\noptimal radiomics complexity level for specific medical outcomes, potentially\nsimplifying the use of radiomics in predictive modeling across various\ncontexts.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"i__34Vu_YUXSngnHfKCNXS4GMucQnzdYWKLLdbrHW1E","pdfSize":"4695006"}