{"id":"2407.02888","title":"Joint Optimization of Resource Allocation and Data Selection for Fast\n  and Cost-Efficient Federated Edge Learning","authors":"Yunjian Jia, Zhen Huang, Jiping Yan, Yulu Zhang, Kun Luo, and Wanli\n  Wen","authorsParsed":[["Jia","Yunjian",""],["Huang","Zhen",""],["Yan","Jiping",""],["Zhang","Yulu",""],["Luo","Kun",""],["Wen","Wanli",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 08:03:59 GMT"}],"updateDate":"2024-07-04","timestamp":1719993839000,"abstract":"  Deploying federated learning at the wireless edge introduces federated edge\nlearning (FEEL). Given FEEL's limited communication resources and potential\nmislabeled data on devices, improper resource allocation or data selection can\nhurt convergence speed and increase training costs. Thus, to realize an\nefficient FEEL system, this paper emphasizes jointly optimizing resource\nallocation and data selection. Specifically, in this work, through rigorously\nmodeling the training process and deriving an upper bound on FEEL's one-round\nconvergence rate, we establish a problem of joint resource allocation and data\nselection, which, unfortunately, cannot be solved directly. Toward this end, we\nequivalently transform the original problem into a solvable form via a variable\nsubstitution and then break it into two subproblems, that is, the resource\nallocation problem and the data selection problem. The two subproblems are\nmixed-integer non-convex and integer non-convex problems, respectively, and\nachieving their optimal solutions is a challenging task. Based on the matching\ntheory and applying the convex-concave procedure and gradient projection\nmethods, we devise a low-complexity suboptimal algorithm for the two\nsubproblems, respectively. Finally, the superiority of our proposed scheme of\njoint resource allocation and data selection is validated by numerical results.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"1w9nA5n4eSPdRT9jiryieqmwcfyXGho7CStEddaXPfY","pdfSize":"1016698","objectId":"0x97b077f86491299bae8d11f3af4706ba729c6447f4b95b9d8acd053f176aa2f9","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
