{"id":"2407.15934","title":"Emulation of $f(R)$ modified gravity from $\\Lambda$CDM using conditional\n  GANs","authors":"Yash Gondhalekar, Sownak Bose, Baojiu Li, Carolina Cuesta-Lazaro","authorsParsed":[["Gondhalekar","Yash",""],["Bose","Sownak",""],["Li","Baojiu",""],["Cuesta-Lazaro","Carolina",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 18:00:03 GMT"}],"updateDate":"2024-07-24","timestamp":1721671203000,"abstract":"  A major aim of current and upcoming cosmological surveys is testing\ndeviations from the standard $\\Lambda$CDM model, but the full scientific value\nof these surveys will only be realised through efficient simulation methods\nthat keep up with the increasing volume and precision of observational data.\n$N$-body simulations of modified gravity (MG) theories are computationally\nexpensive since highly non-linear equations need to be solved to model the\nnon-linear matter evolution; this represents a significant bottleneck in the\npath to reach the data volume and resolution attained by equivalent\n$\\Lambda$CDM simulations. We develop a field-level, neural-network-based\nemulator that generates density and velocity divergence fields under the $f(R)$\ngravity MG model from the corresponding $\\Lambda$CDM simulated fields. Using\nattention mechanisms and a complementary frequency-based loss function, our\nmodel is able to learn this intricate mapping. We further use the idea of\nlatent space extrapolation to generalise our emulator to $f(R)$ models with\ndiffering field strengths. The predictions of our emulator agree with the\n$f(R)$ simulations to within 5% for matter density and to within 10% for\nvelocity divergence power spectra up to $k \\sim 2\\,h$ $\\mathrm{Mpc}^{-1}$. But\nfor a few select cases, higher-order statistics are reproduced with\n$\\lesssim$10% agreement with the $f(R)$ simulations. Latent extrapolation\nallows our emulator to generalise to different $f(R)$ model variants without\nexplicitly training on those variants. Given a $\\Lambda$CDM simulation, the\nGPU-based emulator is able to reproduce the equivalent $f(R)$ realisation\n$\\sim$600 times faster than full $N$-body simulations. This lays the\nfoundations for a valuable tool for realistic yet rapid mock field generation\nand robust cosmological analyses.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"1EbcAANWcDHvK5yZNIccxBHY0upqvnmk9pKJ1Ey5QfA","pdfSize":"6162241"}