{"id":"2407.00167","title":"Can GPT-4 Help Detect Quit Vaping Intentions? An Exploration of\n  Automatic Data Annotation Approach","authors":"Sai Krishna Revanth Vuruma, Dezhi Wu, Saborny Sen Gupta, Lucas Aust,\n  Valerie Lookingbill, Wyatt Bellamy, Yang Ren, Erin Kasson, Li-Shiun Chen,\n  Patricia Cavazos-Rehg, Dian Hu and Ming Huang","authorsParsed":[["Vuruma","Sai Krishna Revanth",""],["Wu","Dezhi",""],["Gupta","Saborny Sen",""],["Aust","Lucas",""],["Lookingbill","Valerie",""],["Bellamy","Wyatt",""],["Ren","Yang",""],["Kasson","Erin",""],["Chen","Li-Shiun",""],["Cavazos-Rehg","Patricia",""],["Hu","Dian",""],["Huang","Ming",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 18:06:48 GMT"}],"updateDate":"2024-07-02","timestamp":1719598008000,"abstract":"  In recent years, the United States has witnessed a significant surge in the\npopularity of vaping or e-cigarette use, leading to a notable rise in cases of\ne-cigarette and vaping use-associated lung injury (EVALI) that caused\nhospitalizations and fatalities during the EVALI outbreak in 2019, highlighting\nthe urgency to comprehend vaping behaviors and develop effective strategies for\ncessation. Due to the ubiquity of social media platforms, over 4.7 billion\nusers worldwide use them for connectivity, communications, news, and\nentertainment with a significant portion of the discourse related to health,\nthereby establishing social media data as an invaluable organic data resource\nfor public health research. In this study, we extracted a sample dataset from\none vaping sub-community on Reddit to analyze users' quit-vaping intentions.\nLeveraging OpenAI's latest large language model GPT-4 for sentence-level quit\nvaping intention detection, this study compares the outcomes of this model\nagainst layman and clinical expert annotations. Using different prompting\nstrategies such as zero-shot, one-shot, few-shot and chain-of-thought\nprompting, we developed 8 prompts with varying levels of detail to explain the\ntask to GPT-4 and also evaluated the performance of the strategies against each\nother. These preliminary findings emphasize the potential of GPT-4 in social\nmedia data analysis, especially in identifying users' subtle intentions that\nmay elude human detection.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Emerging Technologies","Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"NvEJ5EzSUNGEm48rBBeKa4QlJKcftk2sxLzKZzIqbv8","pdfSize":"875762","objectId":"0xda1935f48e27b9af2b3b57432ace8fa89bb8f303e2a0f9408f392cd1ccf18ed1","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
