{"id":"2407.09392","title":"Open-Canopy: A Country-Scale Benchmark for Canopy Height Estimation at\n  Very High Resolution","authors":"Fajwel Fogel, Yohann Perron, Nikola Besic, Laurent Saint-Andr\\'e,\n  Agn\\`es Pellissier-Tanon, Martin Schwartz, Thomas Boudras, Ibrahim Fayad,\n  Alexandre d'Aspremont, Loic Landrieu, Philippe Ciais","authorsParsed":[["Fogel","Fajwel",""],["Perron","Yohann",""],["Besic","Nikola",""],["Saint-André","Laurent",""],["Pellissier-Tanon","Agnès",""],["Schwartz","Martin",""],["Boudras","Thomas",""],["Fayad","Ibrahim",""],["d'Aspremont","Alexandre",""],["Landrieu","Loic",""],["Ciais","Philippe",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 16:16:24 GMT"},{"version":"v2","created":"Thu, 18 Jul 2024 11:03:59 GMT"}],"updateDate":"2024-07-19","timestamp":1720800984000,"abstract":"  Estimating canopy height and canopy height change at meter resolution from\nsatellite imagery has numerous applications, such as monitoring forest health,\nlogging activities, wood resources, and carbon stocks. However, many existing\nforest datasets are based on commercial or closed data sources, restricting the\nreproducibility and evaluation of new approaches. To address this gap, we\nintroduce Open-Canopy, the first open-access and country-scale benchmark for\nvery high resolution (1.5 m) canopy height estimation. Covering more than\n87,000 km$^2$ across France, Open-Canopy combines SPOT satellite imagery with\nhigh resolution aerial LiDAR data. We also propose Open-Canopy-$\\Delta$, the\nfirst benchmark for canopy height change detection between two images taken at\ndifferent years, a particularly challenging task even for recent models. To\nestablish a robust foundation for these benchmarks, we evaluate a comprehensive\nlist of state-of-the-art computer vision models for canopy height estimation.\nThe dataset and associated codes can be accessed at\nhttps://github.com/fajwel/Open-Canopy.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"MlnmrXXd-Pf4z2UB2i8QIWyszNb329cF2yjhUaeINqE","pdfSize":"6184201"}