{"id":"2407.15494","title":"On the Particle Approximation of Lagged Feynman-Kac Formulae","authors":"Elsiddig Awadelkarim, Michel Caffarel, Pierre Del Moral, Ajay Jasra","authorsParsed":[["Awadelkarim","Elsiddig",""],["Caffarel","Michel",""],["Del Moral","Pierre",""],["Jasra","Ajay",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 09:21:16 GMT"}],"updateDate":"2024-07-23","timestamp":1721640076000,"abstract":"  In this paper we examine the numerical approximation of the limiting\ninvariant measure associated with Feynman-Kac formulae. These are expressed in\na discrete time formulation and are associated with a Markov chain and a\npotential function. The typical application considered here is the computation\nof eigenvalues associated with non-negative operators as found, for example, in\nphysics or particle simulation of rare-events. We focus on a novel\n\\emph{lagged} approximation of this invariant measure, based upon the\nintroduction of a ratio of time-averaged Feynman-Kac marginals associated with\na positive operator iterated $l \\in\\mathbb{N}$ times; a lagged Feynman-Kac\nformula. This estimator and its approximation using Diffusion Monte Carlo (DMC)\nhave been extensively employed in the physics literature. In short, DMC is an\niterative algorithm involving $N\\in\\mathbb{N}$ particles or walkers simulated\nin parallel, that undergo sampling and resampling operations. In this work, it\nis shown that for the DMC approximation of the lagged Feynman-Kac formula, one\nhas an almost sure characterization of the $\\mathbb{L}_1$-error as the time\nparameter (iteration) goes to infinity and this is at most of\n$\\mathcal{O}(\\exp\\{-\\kappa l\\}/N)$, for $\\kappa>0$. In addition a\nnon-asymptotic in time, and time uniform $\\mathbb{L}_1-$bound is proved which\nis $\\mathcal{O}(l/\\sqrt{N})$. We also prove a novel central limit theorem to\ngive a characterization of the exact asymptotic in time variance. This analysis\ndemonstrates that the strategy used in physics, namely, to run DMC with $N$ and\n$l$ small and, for long time enough, is mathematically justified. Our results\nalso suggest how one should choose $N$ and $l$ in practice. We emphasize that\nthese results are not restricted to physical applications; they have broad\nrelevance to the general problem of particle simulation of the Feynman-Kac\nformula.\n","subjects":["Mathematics/Probability"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"LxdOEI8-CtuvcaVGRNygG9LLpH_9A6ev0VqKDJh7HYw","pdfSize":"711563","objectId":"0x3543b5a5242614f4e52819fd4a7f4e3cde51a3c047e0d53089457f92d6057c9c","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
