{"id":"2407.08713","title":"GTA: A Benchmark for General Tool Agents","authors":"Jize Wang, Zerun Ma, Yining Li, Songyang Zhang, Cailian Chen, Kai\n  Chen, Xinyi Le","authorsParsed":[["Wang","Jize",""],["Ma","Zerun",""],["Li","Yining",""],["Zhang","Songyang",""],["Chen","Cailian",""],["Chen","Kai",""],["Le","Xinyi",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 17:50:09 GMT"}],"updateDate":"2024-07-12","timestamp":1720720209000,"abstract":"  Significant focus has been placed on integrating large language models (LLMs)\nwith various tools in developing general-purpose agents. This poses a challenge\nto LLMs' tool-use capabilities. However, there are evident gaps between\nexisting tool-use evaluations and real-world scenarios. Current evaluations\noften use AI-generated queries, single-step tasks, dummy tools, and text-only\ninteractions, failing to reveal the agents' real-world problem-solving\nabilities effectively. To address this, we propose GTA, a benchmark for General\nTool Agents, featuring three main aspects: (i) Real user queries: human-written\nqueries with simple real-world objectives but implicit tool-use, requiring the\nLLM to reason the suitable tools and plan the solution steps. (ii) Real\ndeployed tools: an evaluation platform equipped with tools across perception,\noperation, logic, and creativity categories to evaluate the agents' actual task\nexecution performance. (iii) Real multimodal inputs: authentic image files,\nsuch as spatial scenes, web page screenshots, tables, code snippets, and\nprinted/handwritten materials, used as the query contexts to align with\nreal-world scenarios closely. We design 229 real-world tasks and executable\ntool chains to evaluate mainstream LLMs. Our findings show that real-world user\nqueries are challenging for existing LLMs, with GPT-4 completing less than 50%\nof the tasks and most LLMs achieving below 25%. This evaluation reveals the\nbottlenecks in the tool-use capabilities of current LLMs in real-world\nscenarios, which provides future direction for advancing general-purpose tool\nagents. The code and dataset are available at\nhttps://github.com/open-compass/GTA.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"zn2hIPwoiVCNvkzVjQfEpQagvp1YSKIgrJYDa17HoCM","pdfSize":"25805290"}