{"id":"2407.09949","title":"The formation of supermassive black holes from Population III.1 seeds.\n  III. Galaxy evolution and black hole growth from semi-analytic modelling","authors":"Vieri Cammelli, Pierluigi Monaco, Jonathan C. Tan, Jasbir Singh, Fabio\n  Fontanot, Gabriella De Lucia, Michaela Hirschmann, and Lizhi Xie","authorsParsed":[["Cammelli","Vieri",""],["Monaco","Pierluigi",""],["Tan","Jonathan C.",""],["Singh","Jasbir",""],["Fontanot","Fabio",""],["De Lucia","Gabriella",""],["Hirschmann","Michaela",""],["Xie","Lizhi",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 17:08:04 GMT"}],"updateDate":"2024-07-16","timestamp":1720890484000,"abstract":"  We present an implementation of Pop III.1 seeding of supermassive black holes\n(SMBHs) in a theoretical model of galaxy formation and evolution to assess the\ngrowth the SMBH population and the properties of the host galaxies. The model\nof Pop III.1 seeding involves SMBH formation at redshifts $z\\gtrsim 20$ in dark\nmatter minihalos that are isolated from external radiative feedback,\nparameterized by isolation distance $d_{\\rm iso}$. Within a standard\n$\\Lambda$CDM cosmology, we generate dark matter halos using the code\n\\textsc{pinocchio} and seed them according to the Pop III.1 scenario, exploring\nvalues of $d_{\\rm iso}$ from 50 to 100~kpc (proper distance). We consider two\nalternative cases of SMBH seeding: a Halo Mass Threshold (HMT) model in which\nall halos $>7\\times10^{10}\\:M_\\odot$ are seeded with $\\sim 10^5\\:M_\\odot$ black\nholes; an All Light Seed (ALS) model in which all halos are seeded with low,\nstellar-mass black holes. We follow the redshift evolution of the halos,\npopulating them with galaxies using the GAlaxy Evolution and Assembly\ntheoretical model of galaxy formation, including accretion on SMBHs and related\nfeedback processes. Here we present predictions for the properties of galaxy\npopulations, focusing on stellar masses, star formation rates, and black hole\nmasses. The local, $z\\sim0$ metrics of occupation fraction as a function of the\ngalaxy stellar mass, galaxy stellar mass function (GSMF), and black hole mass\nfunction (BHMF) all suggest a constraint of $d_{\\rm iso}<75\\:$kpc. We discuss\nthe implications of this result for the Pop III.1 seeding mechanism.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0NxG-rKZPTQ-y1qornJ5tpr7pMqXs8mbMEWOs75wZHg","pdfSize":"2853072"}