{"id":"2407.10755","title":"Socioeconomic factors of national representation in the global film\n  festival circuit: skewed toward the large and wealthy, but small countries\n  can beat the odds","authors":"Andres Karjus","authorsParsed":[["Karjus","Andres",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 14:31:23 GMT"},{"version":"v2","created":"Tue, 16 Jul 2024 09:35:53 GMT"}],"updateDate":"2024-07-17","timestamp":1721053883000,"abstract":"  This study analyzes how economic, demographic, and geographic factors predict\nthe representation of different countries in the global film festival circuit.\nIt relies on the combination of several open access datasets, including\nfestival programming information from the Cinando platform of the Cannes Film\nMarket, covering more than 30,000 screenings of over 20,000 films in almost 600\nfestivals across the world over a decade. It is shown that while the festival\nscreen is indeed dominated by films from large affluent countries, the bias is\nnevertheless not fully proportional to the large demographic and economic\ndisparities across the world, and that several small countries perform better\nthan expected. It is further analyzed via computational simulations how much\nincluding films from smaller countries contributes to cultural diversity, and\nhow countries differ in cultural \"trade balance\" dynamics, revealing\ndifferences between net exporters and importers of festival films. This\nresearch underscores the importance of balanced representation in film\nfestivals and the public value of increasing cultural diversity. The\ndata-driven insights and approaches to quantitative festival program and\ncultural event analytics are hoped to be useful for both the academic community\nas well as film festival organizers and policymakers aiming to foster more\ninclusive and diverse cultural landscapes.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"egmf9pZdfVPX0snhVqrV3ZtDv_j4BtSOo7SUXvE7qTw","pdfSize":"3566679"}