{"id":"2407.13213","title":"Leveraging Machine Learning for High-Dimensional Option Pricing within\n  the Uncertain Volatility Model","authors":"Ludovic Goudenege, Andrea Molent, Antonino Zanette","authorsParsed":[["Goudenege","Ludovic",""],["Molent","Andrea",""],["Zanette","Antonino",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 06:53:50 GMT"}],"updateDate":"2024-07-19","timestamp":1721285630000,"abstract":"  This paper explores the application of Machine Learning techniques for\npricing high-dimensional options within the framework of the Uncertain\nVolatility Model (UVM). The UVM is a robust framework that accounts for the\ninherent unpredictability of market volatility by setting upper and lower\nbounds on volatility and the correlation among underlying assets. By leveraging\nhistorical data and extreme values of estimated volatilities and correlations,\nthe model establishes a confidence interval for future volatility and\ncorrelations, thus providing a more realistic approach to option pricing. By\nintegrating advanced Machine Learning algorithms, we aim to enhance the\naccuracy and efficiency of option pricing under the UVM, especially when the\noption price depends on a large number of variables, such as in basket or\npath-dependent options. Our approach evolves backward in time, dynamically\nselecting at each time step the most expensive volatility and correlation for\neach market state. Specifically, it identifies the particular values of\nvolatility and correlation that maximize the expected option value at the next\ntime step. This is achieved through the use of Gaussian Process regression, the\ncomputation of expectations via a single step of a multidimensional tree and\nthe Sequential Quadratic Programming optimization algorithm. The numerical\nresults demonstrate that the proposed approach can significantly improve the\nprecision of option pricing and risk management strategies compared with\nmethods already in the literature, particularly in high-dimensional contexts.\n","subjects":["Quantitative Finance/Computational Finance"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"W0jhplWt9NE3gr0By7YgUIxiVr2og1NRiRpHEEcI_-s","pdfSize":"285610","objectId":"0xee1a24e6e67e220f0b8c7486ef492f30bffad0287bc02282926be366f699493a","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
