{"id":"2407.04809","title":"Freeze-in as a Complementary Process to Freeze-Out","authors":"Rodrigo Capucha, Karim Elyaouti, Margarete M\\\"uhlleitner, Johann\n  Plotnikov, Rui Santos","authorsParsed":[["Capucha","Rodrigo",""],["Elyaouti","Karim",""],["Mühlleitner","Margarete",""],["Plotnikov","Johann",""],["Santos","Rui",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 18:46:05 GMT"}],"updateDate":"2024-07-09","timestamp":1720205165000,"abstract":"  There are many extensions of the Standard Model with a dark matter (DM)\ncandidate obtained via the freeze-out mechanism. It can happen that after all\nexperimental and theoretical constraints are taken into account, all parameter\npoints have a relic density below the experimentally measured value. This means\nthat the models solve only partially the DM problem, and at least one more\ncandidate is needed. In this work we show that it is possible to further extend\nthe model with a DM candidate obtained via the freeze-in mechanism to be in\nagreement with the relic density experimental measurement. Once the relic\ndensity problem is solved with this addition, new questions are raised. This\nnew model with at least two DM candidates could have a freeze-out undetectable\nDM particle both in direct and indirect detection. This could happen if the\nfreeze-out DM particle would have a very low density. Hence, a collider DM hint\nvia excess in the missing energy with no correspondence in direct and indirect\ndetection experiments, could signal the existence of a Feebly Interacting\nMassive Particle (FIMP). Conversely, if a DM particle is found and a particular\nmodel can explain all observables except the correct relic density, an\nextension with an extra FIMP would solve the problem. The freeze-in DM\ncandidate, due to the small portal couplings, will not change the remaining\nphenomenology.\n","subjects":["Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"1q5XHNneRPu4udIfQoQaGFp0IEhZpnT7ZPVadL-Zq9I","pdfSize":"11079630"}