{"id":"2407.02728","title":"Validation of Theoretical Estimation Methods and Maximum Value\n  Distribution Calculation for Parametric Roll Amplitude in Long-Crested\n  Irregular Waves","authors":"Keiji Katsumura, Leo Dostal, Taiga Kono, Yuuki Maruyama, Masahiro\n  Sakai, Atsuo Maki","authorsParsed":[["Katsumura","Keiji",""],["Dostal","Leo",""],["Kono","Taiga",""],["Maruyama","Yuuki",""],["Sakai","Masahiro",""],["Maki","Atsuo",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 00:55:30 GMT"}],"updateDate":"2024-07-04","timestamp":1719968130000,"abstract":"  Parametric rolling is a parametric excitation phenomenon caused by GM\nvariation in waves. There are a lot of studies of the estimation the\nconditions, the occurrence, and the amplitude of parametric rolling. On the\nother hand, there are relatively few cases in which theoretical methods for\nestimating parametric roll amplitudes in irregular waves have been validated in\ntank tests. The primary objective of this study is to validate theoretical\nestimation methods for the parametric roll amplitude in irregular waves and\nimprove their accuracy. First, the probability density functions (PDF) of the\nparametric roll amplitude obtained from the model ship motion experiment in\nirregular waves are compared with that obtained from theoretical estimation\nmethods. Second, the method to improve the accuracy of estimation of the roll\nrestoring variation in irregular waves is suggested. Third, the method to\nestimate the distribution of the maximum amplitude of parametric rolling in\nirregular waves. As a result, the PDFs of the roll amplitude obtained from the\nexperiments differ from the results of theoretical estimation. After that, by\ncorrecting GM variation, the results of theoretical estimation are closer to\nthe experimental results. Moreover, by the theoretical estimation method using\nthe moment equation, the qualitative estimation for the PDF of the maximum roll\namplitude is succeeded.\n","subjects":["Physics/Fluid Dynamics","Mathematics/Dynamical Systems","Physics/Atmospheric and Oceanic Physics","Physics/Data Analysis, Statistics and Probability"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"VghSp973gRKklPfGTtDuveVrmFk-kwhD_w9QL3nAZh8","pdfSize":"2421687"}