{"id":"2407.05203","title":"Toward a Unified Metadata Schema for Ecological Momentary Assessment\n  with Voice-First Virtual Assistants","authors":"Chen Chen and Khalil Mrini and Kemeberly Charles and Ella T. Lifset\n  and Michael Hogarth and Alison A. Moore and Nadir Weibel and Emilia Farcas","authorsParsed":[["Chen","Chen",""],["Mrini","Khalil",""],["Charles","Kemeberly",""],["Lifset","Ella T.",""],["Hogarth","Michael",""],["Moore","Alison A.",""],["Weibel","Nadir",""],["Farcas","Emilia",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 22:51:03 GMT"}],"updateDate":"2024-07-09","timestamp":1720306263000,"abstract":"  Ecological momentary assessment (EMA) is used to evaluate subjects' behaviors\nand moods in their natural environments, yet collecting real-time and\nself-report data with EMA is challenging due to user burden. Integrating voice\ninto EMA data collection platforms through today's intelligent virtual\nassistants (IVAs) is promising due to hands-free and eye-free nature. However,\nefficiently managing conversations and EMAs is non-trivial and time consuming\ndue to the ambiguity of the voice input. We approach this problem by rethinking\nthe data modeling of EMA questions and what is needed to deploy them on\nvoice-first user interfaces. We propose a unified metadata schema that models\nEMA questions and the necessary attributes to effectively and efficiently\nintegrate voice as a new EMA modality. Our schema allows user experience\nresearchers to write simple rules that can be rendered at run-time, instead of\nhaving to edit the source code. We showcase an example EMA survey implemented\nwith our schema, which can run on multiple voice-only and voice-first devices.\nWe believe that our work will accelerate the iterative prototyping and design\nprocess of real-world voice-based EMA data collection platforms.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"wdWo_QaiwGJ7zfwHeEP_hBn4VjljDqrUuI87_BG1fHM","pdfSize":"22708414"}