{"id":"2407.05322","title":"Correlated Systematic Uncertainties and Errors-on-Errors in Measurement\n  Combinations: Methodology and Application to the 7-8 TeV ATLAS-CMS Top Quark\n  Mass Combination","authors":"Enzo Canonero and Glen Cowan","authorsParsed":[["Canonero","Enzo",""],["Cowan","Glen",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 10:17:40 GMT"},{"version":"v2","created":"Mon, 9 Sep 2024 19:29:25 GMT"}],"updateDate":"2024-09-11","timestamp":1720347460000,"abstract":"  The Gamma Variance Model (GVM) is a statistical model that incorporates\nuncertainties in the assignment of systematic errors (informally called\nerrors-on-errors). The model is of particular use in analyses that combine the\nresults of several measurements. In the past, combinations have been carried\nout using two alternative approaches: the Best Linear Unbiased Estimator (BLUE)\nmethod or what we will call the nuisance-parameter method. In this paper we\nderive useful relations that allow one to connect the BLUE and\nnuisance-parameter methods when the correlations induced by systematic\nuncertainties are non-trivial (1, -1 or 0), and we generalise the\nnuisance-parameter approach to include errors-on-errors. We then illustrate\nsome of the properties of the GVM by applying it to the 7-8 TeV ATLAS-CMS top\nquark mass combination. We present results by considering the largest\nsystematic uncertainties as uncertain, one at a time, and we vary their\nassociated error-on-error parameters. This procedure is useful for identifying\nthe systematic uncertainties to which a combination is sensitive when they are\nthemselves uncertain. We also explore the hypothetical scenario of including an\noutlier in the combination, which could become relevant for future\ncombinations, by artificially adding a fictitious measurement to it. This\nexample highlights a key feature of the GVM: its sensitivity to the internal\nconsistency of the input data.\n","subjects":["Physics/High Energy Physics - Experiment"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Dpcy6CemGvo5XkfE6nSANSBk6--bqsqpCbfKAko6sT0","pdfSize":"538555"}