{"id":"2407.18405","title":"Computational Phase Transitions in Two-Dimensional Antiferromagnetic\n  Melting","authors":"Zack Weinstein, Jalal Abu Ahmad, Daniel Podolsky, and Ehud Altman","authorsParsed":[["Weinstein","Zack",""],["Ahmad","Jalal Abu",""],["Podolsky","Daniel",""],["Altman","Ehud",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 21:38:31 GMT"}],"updateDate":"2024-07-29","timestamp":1721943511000,"abstract":"  A computational phase transition in a classical or quantum system is a\nnon-analytic change in behavior of an order parameter which can only be\nobserved with the assistance of a nontrivial classical computation. Such phase\ntransitions, and the computational observables which detect them, play a\ncrucial role in the optimal decoding of quantum error-correcting codes and in\nthe scalable detection of measurement-induced phenomena. In this work we show\nthat computational phase transitions and observables can also provide important\nphysical insight on the phase diagram of a classical statistical physics\nsystem, specifically in the context of the dislocation-mediated melting of a\ntwo-dimensional antiferromagnetic (AF) crystal. In the solid phase, elementary\ndislocations disrupt the bipartiteness of the underlying square lattice, and as\na result, pairs of dislocations are linearly confined by string-like AF domain\nwalls. It has previously been argued that a novel AF tetratic phase can arise\nwhen double dislocations proliferate while elementary dislocations remain\nbound. However, since elementary dislocations carry AF Ising gauge flux, no\nlocal order parameter can distinguish between AF and paramagnetic (PM) tetratic\nregimes, and consequently there is no thermodynamic phase transition separating\nthe two regimes. Nonetheless, we demonstrate that it is possible to\nalgorithmically construct a staggered magnetization which distinguishes the AF\nand PM tetratic regimes by \"pairing\" dislocations, which requires an\nincreasingly nontrivial classical computation as elementary dislocation pairs\nincrease in density and unbind. We discuss both algorithm-dependent and\n\"intrinsic\" algorithm-independent computational phase transitions in this\nsetting, the latter of which includes a transition in one's ability to\nconsistently sort atoms into two sublattices to construct a well-defined\nstaggered magnetization.\n","subjects":["Condensed Matter/Statistical Mechanics","Condensed Matter/Soft Condensed Matter"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Clw9mSGLKOqZK85EaOVYypa8l357VU-BmkJU3zKlook","pdfSize":"1970825"}