{"id":"2407.13667","title":"Kinematic constraints on the ages and kick velocities of Galactic\n  neutron star binaries","authors":"Paul Disberg, Nicola Gaspari, Andrew J. Levan","authorsParsed":[["Disberg","Paul",""],["Gaspari","Nicola",""],["Levan","Andrew J.",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 16:43:14 GMT"}],"updateDate":"2024-07-19","timestamp":1721320994000,"abstract":"  The systems creating binary neutron stars (BNSs) experience systemic kicks\nwhen one of the components goes supernova. The combined magnitude of these\nkicks is still a topic of debate, and has implications for the eventual\nlocation of the transient resulting from the merger of the binary. For example,\nthe offsets of short-duration gamma-ray bursts (SGRBs) resulting from BNS\nmergers depend on the BNS kicks. We investigated Galactic BNSs, and traced\ntheir motion through the Galaxy. This enabled us to estimate their kinematic\nages and construct a BNS kick distribution, based on their Galactic\ntrajectories. We used the pulsar periods and their derivatives to estimate the\ncharacteristic spin-down ages of the binaries. Moreover, we used a Monte Carlo\nestimation of their present-day velocity vector in order to trace back their\ntrajectory and estimate their kinematic ages. These trajectories, in turn, were\nused to determine the eccentricity of their Galactic orbit. Based on\nsimulations of kicked objects in the Galactic potential, we investigated the\nrelationship between this eccentricity and kick velocity, in order to constrain\nthe kicks imparted to the binaries at birth. We find that the Galactic BNSs are\nlikely older than $\\sim40$ Myr, which means their current (scalar)\ngalactocentric speeds are not representative of their initial kicks. However,\nwe find a close relationship between the eccentricity of a Galactic trajectory\nand the experienced kick. Using this relation, we constrained the kicks of the\nGalactic BNSs, depending on the kind of isotropy assumed in estimating their\nvelocity vectors. These kick velocities are well-described by a log-normal\ndistribution peaking around $\\sim40-50$ km/s, and coincide with the peculiar\nvelocities of the binaries at their last disc crossing.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Astrophysics of Galaxies","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"hLq0Uw6VX3sMAkF5SbIoppGVoqX39_SJUdc0Z09dpHk","pdfSize":"22979894"}