{"id":"2407.05176","title":"Towards Socially and Environmentally Responsible AI","authors":"Pengfei Li, Yejia Liu, Jianyi Yang, Shaolei Ren","authorsParsed":[["Li","Pengfei",""],["Liu","Yejia",""],["Yang","Jianyi",""],["Ren","Shaolei",""]],"versions":[{"version":"v1","created":"Tue, 23 Apr 2024 00:41:41 GMT"}],"updateDate":"2024-07-09","timestamp":1713832901000,"abstract":"  The sharply increasing sizes of artificial intelligence (AI) models come with\nsignificant energy consumption and environmental footprints, which can\ndisproportionately impact certain (often marginalized) regions and hence create\nenvironmental inequity concerns. Moreover, concerns with social inequity have\nalso emerged, as AI computing resources may not be equitably distributed across\nthe globe and users from certain disadvantaged regions with severe resource\nconstraints can consistently experience inferior model performance.\nImportantly, the inequity concerns that encompass both social and environmental\ndimensions still remain unexplored and have increasingly hindered responsible\nAI. In this paper, we leverage the spatial flexibility of AI inference\nworkloads and propose equitable geographical load balancing (GLB) to fairly\nbalance AI's regional social and environmental costs. Concretely, to penalize\nthe disproportionately high social and environmental costs for equity, we\nintroduce $L_q$ norms as novel regularization terms into the optimization\nobjective for GLB decisions. Our empirical results based on real-world AI\ninference traces demonstrate that while the existing GLB algorithms result in\ndisproportionately large social and environmental costs in certain regions, our\nproposed equitable GLB can fairly balance AI's negative social and\nenvironmental costs across all the regions.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"TIo24umwfEpPs6AUDNV21TFkLmq2qo2I73kIjr4ts-c","pdfSize":"144097"}