{"id":"2407.02220","title":"Embodied AI in Mobile Robots: Coverage Path Planning with Large Language\n  Models","authors":"Xiangrui Kong, Wenxiao Zhang, Jin Hong, Thomas Braunl","authorsParsed":[["Kong","Xiangrui",""],["Zhang","Wenxiao",""],["Hong","Jin",""],["Braunl","Thomas",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 12:38:46 GMT"},{"version":"v2","created":"Thu, 4 Jul 2024 01:42:58 GMT"}],"updateDate":"2024-07-08","timestamp":1719923926000,"abstract":"  In recent years, Large Language Models (LLMs) have demonstrated remarkable\ncapabilities in understanding and solving mathematical problems, leading to\nadvancements in various fields. We propose an LLM-embodied path planning\nframework for mobile agents, focusing on solving high-level coverage path\nplanning issues and low-level control. Our proposed multi-layer architecture\nuses prompted LLMs in the path planning phase and integrates them with the\nmobile agents' low-level actuators. To evaluate the performance of various\nLLMs, we propose a coverage-weighted path planning metric to assess the\nperformance of the embodied models. Our experiments show that the proposed\nframework improves LLMs' spatial inference abilities. We demonstrate that the\nproposed multi-layer framework significantly enhances the efficiency and\naccuracy of these tasks by leveraging the natural language understanding and\ngenerative capabilities of LLMs. Our experiments show that this framework can\nimprove LLMs' 2D plane reasoning abilities and complete coverage path planning\ntasks. We also tested three LLM kernels: gpt-4o, gemini-1.5-flash, and\nclaude-3.5-sonnet. The experimental results show that claude-3.5 can complete\nthe coverage planning task in different scenarios, and its indicators are\nbetter than those of the other models.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"YdXii3yJsfipu81GTsv35CWIbfhkzp_03col1rDTFnI","pdfSize":"4019890"}