{"id":"2407.19843","title":"The Second Joint Workshop on Cross Reality","authors":"Nanjia Wang, Yue Li, Francesco Chiossi, Fabian Pointecker, Lixiang\n  Zhao, Daniel Zielasko","authorsParsed":[["Wang","Nanjia",""],["Li","Yue",""],["Chiossi","Francesco",""],["Pointecker","Fabian",""],["Zhao","Lixiang",""],["Zielasko","Daniel",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 09:55:40 GMT"}],"updateDate":"2024-07-30","timestamp":1722246940000,"abstract":"  The 2nd Joint Workshop on Cross Reality (JWCR'24), organized as part of ISMAR\n2024, seeks to explore the burgeoning field of Cross Reality (CR), which\nencompasses the seamless integration and transition between various points on\nthe reality-virtuality continuum (RVC) such as Virtual Reality (VR), Augmented\nVirtuality (AV), and Augmented Reality (AR). This hybrid workshop aims to build\nupon the foundation laid by the inaugural JWCR at ISMAR 2023, which\nsuccessfully unified diverse CR research communities. The workshop will address\nkey themes including CR visualization, interaction, user behavior, design,\ndevelopment, engineering, and collaboration. CR Visualization focuses on\ncreating and displaying spatial data across the RVC, enabling users to navigate\nand interpret information fluidly. CR Interaction delves into natural user\nengagements using gestures, voice commands, and other advanced techniques to\nenhance immersion. The study of CR User Behavior and Experience investigates\nhow users perceive and interact within these hybrid environments. Furthermore,\nCR Design and Development emphasizes creating effective CR applications using\ninnovative processes and tools, while CR Collaboration examines methods for\nfostering teamwork in mixed reality settings.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"2_ux2QAqZ7tGwlGOUBgonefuUU2rZcRks9r7SXwZlFc","pdfSize":"181594","objectId":"0xb51b693028a833c497e13289157e90b03d031dbb4564d976e025fd28cf9c8138","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
