{"id":"2407.12689","title":"Propagation of Interplanetary Shocks in the Heliosphere","authors":"Munkhjargal Lkhagvadorj, Gabor Facsko, Andrea Opitz, Peter Kovacs,\n  David G. Sibeck","authorsParsed":[["Lkhagvadorj","Munkhjargal",""],["Facsko","Gabor",""],["Opitz","Andrea",""],["Kovacs","Peter",""],["Sibeck","David G.",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 16:10:47 GMT"}],"updateDate":"2024-07-18","timestamp":1721232647000,"abstract":"  Interplanetary shocks are one of the crucial dynamic phenomena in the\nHeliosphere. They accelerate particles to high energies, generate plasma waves,\nand can trigger geomagnetic storms in the terrestrial magnetosphere disturbing\nsignificantly our technological infrastructures. In this study, two IP shock\nevents are selected to study the temporal variations of the shock parameters\nusing magnetometer and ion plasma measurements of the STEREO$-$A and B, the\nWind, Cluster fleet, and the ACE spacecraft. The shock normal vectors are\ndetermined using the minimum variance analysis (MVA) and the magnetic\ncoplanarity methods. During the May 7, 2007 event, the shock parameters and the\nshock normal direction are consistent. The shock surface appears to be tilted\nalmost the same degree as the Parker spiral, and the driver could be a\nCo--Rotating Interacting Region (CIR). During the April 23, 2007 event, the\nshock parameters do not change significantly except for the shock $\\theta_{Bn}$\nangle, however, the shape of the IP shock appears to be twisted along the\nperpendicular direction to the Sun-Earth line as well. The driver of this\nrippled shock is Stream Interaction Regions (SIRs)/CISs as well.\n","subjects":["Physics/Space Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"aFUsQRbHUdTK799UFCO6EApLcvNGU1-awqnQNwiPP3k","pdfSize":"11145962","objectId":"0x7bd17bf2ab0c1431b13606e52d6bae143e7c4dd5b76f745cf89307dc35bce656","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
