{"id":"2407.06354","title":"High-Throughput Phenotyping using Computer Vision and Machine Learning","authors":"Vivaan Singhvi, Langalibalele Lunga, Pragya Nidhi, Chris Keum, Varrun\n  Prakash","authorsParsed":[["Singhvi","Vivaan",""],["Lunga","Langalibalele",""],["Nidhi","Pragya",""],["Keum","Chris",""],["Prakash","Varrun",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 19:46:31 GMT"},{"version":"v2","created":"Wed, 10 Jul 2024 02:28:14 GMT"}],"updateDate":"2024-07-11","timestamp":1720467991000,"abstract":"  High-throughput phenotyping refers to the non-destructive and efficient\nevaluation of plant phenotypes. In recent years, it has been coupled with\nmachine learning in order to improve the process of phenotyping plants by\nincreasing efficiency in handling large datasets and developing methods for the\nextraction of specific traits. Previous studies have developed methods to\nadvance these challenges through the application of deep neural networks in\ntandem with automated cameras; however, the datasets being studied often\nexcluded physical labels. In this study, we used a dataset provided by Oak\nRidge National Laboratory with 1,672 images of Populus Trichocarpa with white\nlabels displaying treatment (control or drought), block, row, position, and\ngenotype. Optical character recognition (OCR) was used to read these labels on\nthe plants, image segmentation techniques in conjunction with machine learning\nalgorithms were used for morphological classifications, machine learning models\nwere used to predict treatment based on those classifications, and analyzed\nencoded EXIF tags were used for the purpose of finding leaf size and\ncorrelations between phenotypes. We found that our OCR model had an accuracy of\n94.31% for non-null text extractions, allowing for the information to be\naccurately placed in a spreadsheet. Our classification models identified leaf\nshape, color, and level of brown splotches with an average accuracy of 62.82%,\nand plant treatment with an accuracy of 60.08%. Finally, we identified a few\ncrucial pieces of information absent from the EXIF tags that prevented the\nassessment of the leaf size. There was also missing information that prevented\nthe assessment of correlations between phenotypes and conditions. However,\nfuture studies could improve upon this to allow for the assessment of these\nfeatures.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Fy6--lUq2-f5AKvEmv8xXSSr-mc-yhWZbpPzeHKxKaY","pdfSize":"6921670"}