{"id":"2407.19436","title":"X-Fake: Juggling Utility Evaluation and Explanation of Simulated SAR\n  Images","authors":"Zhongling Huang, Yihan Zhuang, Zipei Zhong, Feng Xu, Gong Cheng,\n  Junwei Han","authorsParsed":[["Huang","Zhongling",""],["Zhuang","Yihan",""],["Zhong","Zipei",""],["Xu","Feng",""],["Cheng","Gong",""],["Han","Junwei",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 09:27:53 GMT"}],"updateDate":"2024-07-30","timestamp":1722158873000,"abstract":"  SAR image simulation has attracted much attention due to its great potential\nto supplement the scarce training data for deep learning algorithms.\nConsequently, evaluating the quality of the simulated SAR image is crucial for\npractical applications. The current literature primarily uses image quality\nassessment techniques for evaluation that rely on human observers' perceptions.\nHowever, because of the unique imaging mechanism of SAR, these techniques may\nproduce evaluation results that are not entirely valid. The distribution\ninconsistency between real and simulated data is the main obstacle that\ninfluences the utility of simulated SAR images. To this end, we propose a novel\ntrustworthy utility evaluation framework with a counterfactual explanation for\nsimulated SAR images for the first time, denoted as X-Fake. It unifies a\nprobabilistic evaluator and a causal explainer to achieve a trustworthy utility\nassessment. We construct the evaluator using a probabilistic Bayesian deep\nmodel to learn the posterior distribution, conditioned on real data.\nQuantitatively, the predicted uncertainty of simulated data can reflect the\ndistribution discrepancy. We build the causal explainer with an introspective\nvariational auto-encoder to generate high-resolution counterfactuals. The\nlatent code of IntroVAE is finally optimized with evaluation indicators and\nprior information to generate the counterfactual explanation, thus revealing\nthe inauthentic details of simulated data explicitly. The proposed framework is\nvalidated on four simulated SAR image datasets obtained from electromagnetic\nmodels and generative artificial intelligence approaches. The results\ndemonstrate the proposed X-Fake framework outperforms other IQA methods in\nterms of utility. Furthermore, the results illustrate that the generated\ncounterfactual explanations are trustworthy, and can further improve the data\nutility in applications.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"C0VhzvpyB2NlFaPT4g2duFsDBORzbyfvK0SmNSZpMxc","pdfSize":"5063387","objectId":"0x6c0b9531ba547c51a26155225a0661ff0d6595ff2572245c3756054f4fdb9a06","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
