{"id":"2407.19193","title":"A collaborative ensemble construction method for federated random forest","authors":"Penjan Antonio Eng Lim and Cheong Hee Park","authorsParsed":[["Lim","Penjan Antonio Eng",""],["Park","Cheong Hee",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 07:21:45 GMT"}],"updateDate":"2024-07-30","timestamp":1722064905000,"abstract":"  Random forests are considered a cornerstone in machine learning for their\nrobustness and versatility. Despite these strengths, their conventional\ncentralized training is ill-suited for the modern landscape of data that is\noften distributed, sensitive, and subject to privacy concerns. Federated\nlearning (FL) provides a compelling solution to this problem, enabling models\nto be trained across a group of clients while maintaining the privacy of each\nclient's data. However, adapting tree-based methods like random forests to\nfederated settings introduces significant challenges, particularly when it\ncomes to non-identically distributed (non-IID) data across clients, which is a\ncommon scenario in real-world applications. This paper presents a federated\nrandom forest approach that employs a novel ensemble construction method aimed\nat improving performance under non-IID data. Instead of growing trees\nindependently in each client, our approach ensures each decision tree in the\nensemble is iteratively and collectively grown across clients. To preserve the\nprivacy of the client's data, we confine the information stored in the leaf\nnodes to the majority class label identified from the samples of the client's\nlocal data that reach each node. This limited disclosure preserves the\nconfidentiality of the underlying data distribution of clients, thereby\nenhancing the privacy of the federated learning process. Furthermore, our\ncollaborative ensemble construction strategy allows the ensemble to better\nreflect the data's heterogeneity across different clients, enhancing its\nperformance on non-IID data, as our experimental results confirm.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Cryptography and Security","Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"IDadJPR3T7NwIegJhcn-ott4-ngH6r0cc2YmDmKIges","pdfSize":"886317"}