{"id":"2407.13864","title":"Chandra Survey in the AKARI North Ecliptic Pole Deep Field\n  Optical/Infrared Identifications of X-ray Sources","authors":"T. Miyaji, B. A. Bravo-Navarro, J. D\\'iaz Tello, M. Krumpe, M.\n  Herrera-Endoqui, H. Ikeda, T. Takagi, N. Oi, A. Shogaki, S. Matsuura, H. Kim,\n  M. A. Malkan, H. S. Hwang, T. Kim, T. Ishigaki, H. Hanami, S. J. Kim, Y.\n  Ohyama, T. Goto, H. Matsuhara","authorsParsed":[["Miyaji","T.",""],["Bravo-Navarro","B. A.",""],["Tello","J. Díaz",""],["Krumpe","M.",""],["Herrera-Endoqui","M.",""],["Ikeda","H.",""],["Takagi","T.",""],["Oi","N.",""],["Shogaki","A.",""],["Matsuura","S.",""],["Kim","H.",""],["Malkan","M. A.",""],["Hwang","H. S.",""],["Kim","T.",""],["Ishigaki","T.",""],["Hanami","H.",""],["Kim","S. J.",""],["Ohyama","Y.",""],["Goto","T.",""],["Matsuhara","H.",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 19:18:36 GMT"},{"version":"v2","created":"Mon, 22 Jul 2024 19:32:52 GMT"}],"updateDate":"2024-09-04","timestamp":1721330316000,"abstract":"  We present a catalog of optical and infrared identifications (ID) of X-ray\nsources in the AKARI North Ecliptic Pole (NEP) Deep field detected with Chandra\ncovering $\\sim 0.34\\,{\\rm deg^{2}}$ with 0.5-2 keV flux limits ranging $\\sim 2\n\\mathrm{-} 20\\times 10^{-16}\\,{\\rm erg\\,s^{-1}\\,cm^{-2}}$. The\noptical/near-infrared counterparts of the X-ray sources are taken from our\nHyper Suprime Cam (HSC)/Subaru and Wide-Field InfraRed Camera\n(WIRCam)/Canada-France-Hawaii Telescope (CFHT) data because these have much\nmore accurate source positions due to their spatial resolution than that of\n{Chandra} and longer wavelength infrared data. We concentrate our\nidentifications in the HSC $g$ band and WIRCam $K_{\\rm s}$ band-based catalogs.\nTo select the best counterpart, we utilize a novel extension of the\nlikelihood-ratio (LR) analysis, where we use the X-ray flux as well as $g -\nK_{\\rm s}$ colors to calculate the likelihood ratio. Spectroscopic and\nphotometric redshifts of the counterparts are summarized. Also, simple X-ray\nspectroscopy is made on the sources with sufficient source counts.\n  We present the resulting catalog in an electronic form. The main ID catalog\ncontains 403 X-ray sources and includes X-ray fluxes, luminosities, $g$ and\n$K_{\\rm s}$ band magnitudes, redshifts, and their sources, optical\nspectroscopic properties, as well as intrinsic absorption column densities and\npower-law indices from simple X-ray spectroscopy. The identified X-ray sources\ninclude 27 Milky-Way objects, 57 type I AGNs, 131 other AGNs, and 15 galaxies.\nThe catalog serves as a basis for further investigations of the properties of\nthe X-ray and near-infrared sources in this field. (Abridged)\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"W4qTLWuZe6CWLq4-hz351aTSjKSkdufoUYmRRTMczZg","pdfSize":"947561","objectId":"0x94668cc6fbecee8e4892833e4b91ac9de423f6bd8c74a8cbb1dd9a376f4add0c","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
