{"id":"2407.14825","title":"3D-printed axicon enables extended depth-of-focus intravascular optical\n  coherence tomography","authors":"Pavel Ruchka, Alok Kushwaha, Jessica A. Marathe, Lei Xiang, Rouyan\n  Chen, Rodney Kirk, Joanne T. M. Tan, Christina A. Bursill, Johan Verjans,\n  Simon Thiele, Robert Fitridge, Robert A. McLaughlin, Peter J. Psaltis, Harald\n  Giessen, and Jiawen Li","authorsParsed":[["Ruchka","Pavel",""],["Kushwaha","Alok",""],["Marathe","Jessica A.",""],["Xiang","Lei",""],["Chen","Rouyan",""],["Kirk","Rodney",""],["Tan","Joanne T. M.",""],["Bursill","Christina A.",""],["Verjans","Johan",""],["Thiele","Simon",""],["Fitridge","Robert",""],["McLaughlin","Robert A.",""],["Psaltis","Peter J.",""],["Giessen","Harald",""],["Li","Jiawen",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 10:05:40 GMT"}],"updateDate":"2024-07-23","timestamp":1721469940000,"abstract":"  A fundamental challenge in endoscopy is how to fabricate a small fiber-optic\nprobe that can achieve comparable function to probes with large, complicated\noptics (e.g., high resolution and extended depth of focus). To achieve high\nresolution over an extended depth of focus (DOF), the application of\nneedle-like beams has been proposed. However, existing methods using\nminiaturized needle beam designs fail to adequately correct astigmatism and\nother monochromatic aberrations, limiting the resolution of at least one axis.\nHere, we describe a novel approach to realize freeform beam-shaping endoscopic\nprobes via two-photon direct laser writing, also known as micro 3D-printing. We\npresent a design achieving approximately 8-micron resolution with a DOF of >0.8\nmm at a central wavelength of 1310 nm. The probe has a diameter of 0.25 mm\n(without the catheter sheaths) and is fabricated using a single printing step\ndirectly on the optical fiber. We demonstrate our device in intravascular\nimaging of living atherosclerotic pigs at multiple time points, as well as\nhuman arteries with plaques ex vivo. This is the first step to enable\nbeam-tailoring endoscopic probes which achieve diffraction-limited resolution\nover a large DOF.\n","subjects":["Physics/Optics","Physics/Biological Physics","Physics/Medical Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"qadXWZNvAP0bguBtndxWrXDZXhHxmPvRBj0nvMkwYVk","pdfSize":"989334"}