{"id":"2407.20776","title":"Evaporation limited spreading of ethanol on rectangular porous strips:\n  an experimental and theoretical investigation","authors":"Rampally Srirama Chandra Murthy and Navneet Kumar","authorsParsed":[["Murthy","Rampally Srirama Chandra",""],["Kumar","Navneet",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 12:23:28 GMT"}],"updateDate":"2024-07-31","timestamp":1722342208000,"abstract":"  Wicking is a widely studied process across various natural and artificial\nsystems. A more industrially relevant configuration is when the wicking liquid\nis allowed to evaporate, such as in the heat pipes and the variants, in order\nto regulate the operating temperature effectively. We consider a simpler case\nfor investigation where liquid ethanol (kept in a container) climbs onto a thin\nfilter paper oriented vertically and is exposed to laboratory conditions,\nfacilitating mass loss via evaporation, thereby inducing the cooling effect. We\nuse three filter papers having different permeability values and three\ndiagnostics concurrently for each case in order to understand the entire\ndynamics; these are optical imaging, thermal imaging, and precision weighing\nscale. Results revealed a steady-state height considerably below Jurin's limit\nfor all the cases, indicating evaporative mass loss as the primary limiting\nparameter rather than the conventional gravitational effect in such a process.\nFurther, thermal imaging unveiled a non-uniform temperature distribution along\nthe filter paper with a very peculiar temperature inversion near the mid-way of\nthe wicking liquid. We use this feature to improve the Constant Evaporation\nModel (CEM by Fries et al) by addressing this non-linear behaviour as a\nconsequence of the evaporation rate being a function of the vertical position;\nwe term this newly proposed model Non-Constant Evaporation Model, (NCEM). In\nthe NCEM, we test two different power-law relations for the evaporation rate\nand both seemingly capture the essential features of this dynamic process.\nHowever, both the models do not capture the process completely and further\nrefinement is needed for complete understanding. Since evaporation rate is the\nlimiting factor, we included it in defining two new non-dimensional numbers\n(Evaporation Height Number, EHN and Evaporation Time Number, ETN).\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"kSPrCN1O8e7Bm82ArnEtlKr6xwDTwRr6wTCTuzDwOZk","pdfSize":"2282230","objectId":"0x724c58b933be5b4b48ba175b4f5a2c8195923642cdf30a26e25f8fa35b2c61c8","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
