{"id":"2407.17820","title":"Analytic Number Theory and Algebraic Asymptotic Analysis","authors":"Jesse Elliott","authorsParsed":[["Elliott","Jesse",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 07:20:23 GMT"}],"updateDate":"2024-07-26","timestamp":1721892023000,"abstract":"  This monograph elucidates and extends many theorems and conjectures in\nanalytic number theory and algebraic asymptotic analysis via the natural\nnotions of degree and logexponential degree. The Riemann hypothesis, for\nexample, is equivalent to the statement that the degree of the function\n$\\pi(x)- \\operatorname{li}(x)$ is $1/2$, where $\\pi(x)$ is the prime counting\nfunction and $\\operatorname{li}(x)$ is the logarithmic integral function. Part\n1 of the text is a survey of analytic number theory, Part 2 introduces the\nnotion of logexponential degree and uses it to extend results in algebraic\nasymptotic analysis, and Part 3 applies the results of Part 2 to the various\nfunctions that figure most prominently in analytic number theory.\n  Central to the notion of logexponential degree are Hardy's\nlogarithmico-exponential functions, which are real functions defined in a\nneighborhood of $\\infty$ that can be built from $\\operatorname{id}$, $\\exp$,\nand $\\log$ using the operations $+$, $\\cdot$, $/$, and $\\circ$. Such functions\nare natural benchmarks for the orders of growth of functions in analytic number\ntheory. The main goal of Part 3 is to express the logexponential degree of\nvarious functions in analytic number theory in terms of as few \"logexponential\nprimitives\" as possible. The logexponential degree of the function $e^\\gamma\n\\prod_{p\\leq x}(1-1/p) -1/\\log x$, for example, can be expressed in terms of\nthat of $\\pi(x)- \\operatorname{li}(x)$ and vice versa (where $\\gamma \\approx\n0.5772$ is the Euler-Mascheroni constant), despite the fact that very little is\nknown about the logexponential degree of either function separately, even on\ncondition of the Riemann hypothesis.\n","subjects":["Mathematics/Number Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ZN2S81e4k8wRFABmg4YZrmBnGKulj7swiSIs2I_4wf0","pdfSize":"6632188"}