{"id":"2407.14633","title":"ELEQTRONeX: A GPU-Accelerated Exascale Framework for Non-Equilibrium\n  Quantum Transport in Nanomaterials","authors":"Saurabh Sawant, Fran\\c{c}ois L\\'eonard, Jackie (Zhi) Yao, Andrew\n  Nonaka","authorsParsed":[["Sawant","Saurabh","","Zhi"],["Léonard","François","","Zhi"],["Jackie","","","Zhi"],["Yao","",""],["Nonaka","Andrew",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 19:11:51 GMT"}],"updateDate":"2024-07-23","timestamp":1721416311000,"abstract":"  Non-equilibrium electronic quantum transport is crucial for the operation of\nexisting and envisioned electronic, optoelectronic, and spintronic devices. The\nultimate goal of encompassing atomistic to mesoscopic length scales in the same\nnonequilibrium device simulation approach has traditionally been challenging\ndue to the computational cost of high-fidelity coupled multiphysics and\nmultiscale requirements. In this work, we present ELEQTRONeX (ELEctrostatic\nQuantum TRansport modeling Of Nanomaterials at eXascale), a massively-parallel\nGPU-accelerated framework for self-consistently solving the nonequilibrium\nGreen's function formalism and electrostatics in complex device geometries. By\ncustomizing algorithms for GPU multithreading, we achieve orders of magnitude\nimprovement in computational time, and excellent scaling on up to 512 GPUs and\nbillions of spatial grid cells. We validate our code by computing band\nstructures, current-voltage characteristics, conductance, and drain-induced\nbarrier lowering for various 3D configurations of carbon nanotube field-effect\ntransistors. We also demonstrate that ELEQTRONeX is suitable for complex\ndevice/material geometries where periodic approaches are not feasible, such as\nmodeling of arrays of misaligned carbon nanotubes requiring fully 3D\nsimulations.\n","subjects":["Physics/Computational Physics","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"C2uXRm7J_ewlYrqWao9pxfDMWT2hXz1mGRPVbtm7has","pdfSize":"10867576"}