{"id":"2407.04206","title":"Computational Graph Representation of Equations System Constructors in\n  Hierarchical Circuit Simulation","authors":"Zichao Long, Lin Li, Lei Han, Xianglong Meng, Chongjun Ding, Ruiyan\n  Li, Wu Jiang, Fuchen Ding, Jiaqing Yue, Zhichao Li, Yisheng Hu, Ding Li, Heng\n  Liao","authorsParsed":[["Long","Zichao",""],["Li","Lin",""],["Han","Lei",""],["Meng","Xianglong",""],["Ding","Chongjun",""],["Li","Ruiyan",""],["Jiang","Wu",""],["Ding","Fuchen",""],["Yue","Jiaqing",""],["Li","Zhichao",""],["Hu","Yisheng",""],["Li","Ding",""],["Liao","Heng",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 01:28:13 GMT"}],"updateDate":"2024-07-08","timestamp":1720142893000,"abstract":"  Equations system constructors of hierarchical circuits play a central role in\ndevice modeling, nonlinear equations solving, and circuit design automation.\nHowever, existing constructors present limitations in applications to different\nextents. For example, the costs of developing and reusing device models --\nespecially coarse-grained equivalent models of circuit modules -- remain high\nwhile parameter sensitivity analysis is complex and inefficient. Inspired by\ndifferentiable programming and leveraging the ecosystem benefits of open-source\nsoftware, we propose an equations system constructor using the computational\ngraph representation, along with its JSON format netlist, to address these\nlimitations. This representation allows for runtime dependencies between\nsignals and subcircuit/device parameters. The proposed method streamlines the\nmodel development process and facilitates end-to-end computation of gradients\nof equations remainders with respect to parameters. This paper discusses in\ndetail the overarching concept of hierarchical subcircuit/device decomposition\nand nested invocation by drawing parallels to functions in programming\nlanguages, and introduces rules for parameters passing and gradient propagation\nacross hierarchical circuit modules. The presented numerical examples,\nincluding (1) an uncoupled CMOS model representation using \"equivalent circuit\ndecomposition+dynamic parameters\" and (2) operational amplifier (OpAmp) auto\ndevice sizing, have demonstrated that the proposed method supports circuit\nsimulation and design and particularly subcircuit modeling with improved\nefficiency, simplicity, and decoupling compared to existing techniques.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Computational Engineering, Finance, and Science","Computing Research Repository/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"rKTtwFklR1kFyYuda4M_Gza3T_vRvZtRSYItmMTxpkc","pdfSize":"979521"}