{"id":"2407.13099","title":"Asymmetric Hard X-ray Radiation of Two Ribbons in a Thermal-Dominated\n  C-Class Flare","authors":"Guanglu Shi, Li Feng, Jun Chen, Beili Ying, Shuting Li, Qiao Li, Hui\n  Li, Ying Li, Kaifan Ji, Yu Huang, Weiqun Gan, the LST team","authorsParsed":[["Shi","Guanglu",""],["Feng","Li",""],["Chen","Jun",""],["Ying","Beili",""],["Li","Shuting",""],["Li","Qiao",""],["Li","Hui",""],["Li","Ying",""],["Ji","Kaifan",""],["Huang","Yu",""],["Gan","Weiqun",""],["team","the LST",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 02:16:09 GMT"}],"updateDate":"2024-07-19","timestamp":1721268969000,"abstract":"  The asymmetry in hard X-ray (HXR) emission at the footpoints (FPs) of flare\nloops is a ubiquitous feature closely associated with nonthermal electron\ntransport. We analyze the asymmetric HXR radiation at two flare ribbons which\nis thermal-dominated during a long-duration C4.4 flare that occurred on March\n20, 2023, combining multi-view and multi-waveband observations from the ASO-S,\nSolO, and SDO spacecraft. We find that the H I Ly$\\alpha$ emission captures\nsimilar features to the He II $\\lambda$304 in both light curve and\nspatio-temporal evolution of a pair of conjugate flare ribbons. The spectra and\nimaging analysis of the HXR emission, detected by STIX in 4-18 keV, reveal that\nthe two-ribbon flare radiation is thermal dominated by over 95%, and the\nradiation source mainly concentrates on the northern ribbon, leading to an\nasymmetric distribution. To understand the underlying reasons for the HXR\nradiation asymmetry, we extrapolate the magnetic field within the active region\nusing the NLFFF model. For 78% of the magnetic field lines starting from the\nnorthern flare ribbon, their lengths from the loop-tops (LTs) to the northern\nFPs are shorter than those to the southern FPs. For 62% of the field lines,\ntheir magnetic field strengths at the southern FPs exceed those at the northern\nFPs. In addition, considering the larger density, $\\approx1.0\\times10^{10}$\ncm$^{-3}$, of the low-lying flare loops (< 32 Mm), we find the shorter path\nfrom the LT to the northern FP enables more electrons to reach the northern FP\nmore easily after collisions with the surrounding plasma. Therefore, in this\nthermal-dominated C-class flare, the asymmetric location of the flare LT\nrelative to its two FPs plays a dominant role in the HXR radiation asymmetry,\nwhile such asymmetry is also slightly influenced by the magnetic mirror effect\nresulting in larger HXR radiation at the FPs with weaker magnetic strength.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Physics/Plasma Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"eI35BCd-PX0oybwOiXnth9i_D0KY4DCvbaJt2vJdtAc","pdfSize":"8692113"}