{"id":"2407.02708","title":"Estimated Heating Rates Due to Cyclotron Damping of Ion-scale Waves\n  Observed by Parker Solar Probe","authors":"Niranjana Shankarappa, Kristopher Klein, Mihailo Martinovic, Trevor\n  Bowen","authorsParsed":[["Shankarappa","Niranjana",""],["Klein","Kristopher",""],["Martinovic","Mihailo",""],["Bowen","Trevor",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 23:02:38 GMT"},{"version":"v2","created":"Sat, 13 Jul 2024 00:31:29 GMT"},{"version":"v3","created":"Sat, 10 Aug 2024 21:10:23 GMT"}],"updateDate":"2024-08-13","timestamp":1719961358000,"abstract":"  Circularly polarized waves consistent with parallel-propagating ion cyclotron\nwaves (ICWs) and fast magnetosonic waves (FMWs) are often observed by Parker\nSolar Probe (PSP) at ion kinetic scales. Such waves damp energy via the\ncyclotron resonance, with such damping expected to play a significant role in\nthe enhanced, anisotropic heating of the solar wind observed in the inner\nheliosphere. We employ a linear plasma dispersion solver, PLUME, to evaluate\nfrequencies of ICWs and FMWs in the plasma rest frame and Doppler-shift them to\nthe spacecraft frame, calculating their damping rates at frequencies where\npersistently high values of circular polarization are observed. We find such\nion-scale waves are observed during $20.37\\%$ of PSP Encounters 1 and 2\nobservations and their plasma frame frequencies are consistent with them being\ntransient ICWs. We estimate significant ICW dissipation onto protons,\nconsistent with previous empirical estimates for the total turbulent damping\nrates, indicating that ICW dissipation could account for the observed\nenhancements in the proton temperature and its anisotropy with respect to the\nmean magnetic field.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Physics/Plasma Physics","Physics/Space Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"I6pAP5lcJOUqxLQyOlZwBAPvS2ReKifbzrrLhb6XsOY","pdfSize":"6127278"}