{"id":"2407.20051","title":"Estimating risk factors for pathogenic dose accrual from longitudinal\n  data","authors":"Daniel K. Sewell and Kelly K. Baker","authorsParsed":[["Sewell","Daniel K.",""],["Baker","Kelly K.",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 14:36:29 GMT"}],"updateDate":"2024-07-30","timestamp":1722263789000,"abstract":"  Estimating risk factors for incidence of a disease is crucial for\nunderstanding its etiology. For diseases caused by enteric pathogens,\noff-the-shelf statistical model-based approaches do not provide biological\nplausibility and ignore important sources of variability. We propose a new\napproach to estimating incidence risk factors built on established work in\nquantitative microbiological risk assessment. Excepting those risk factors\nwhich affect both dose accrual and within-host pathogen survival rates, our\nmodel's regression parameters are easily interpretable as the dose accrual rate\nratio due to the risk factors under study. % So long as risk factors do not\naffect both dose accrual and within-host pathogen survival rates, our model\nparameters are easily interpretable as the dose accrual rate ratio due to the\nrisk factors under study. We also describe a method for leveraging information\nacross multiple pathogens. The proposed methods are available as an R package\nat \\url{https://github.com/dksewell/ladie}. Our simulation study shows\nunacceptable coverage rates from generalized linear models, while the proposed\napproach maintains the nominal rate even when the model is misspecified.\nFinally, we demonstrated our proposed approach by applying our method to\nNairobian infant data obtained through the PATHOME study\n(\\url{https://reporter.nih.gov/project-details/10227256}), discovering the\nimpact of various environmental factors on infant enteric infections.\n","subjects":["Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"BKcCpLb2yI0AIUxeoD9ZCP6LOuVf4DYnWE3DCeZscy8","pdfSize":"456854","objectId":"0x58975c0ff429db9444a5052bd1c2711eb2eaeb2bb0c37b14b23a58ee3cd09685","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
