{"id":"2407.04106","title":"MiniGPT-Med: Large Language Model as a General Interface for Radiology\n  Diagnosis","authors":"Asma Alkhaldi, Raneem Alnajim, Layan Alabdullatef, Rawan Alyahya, Jun\n  Chen, Deyao Zhu, Ahmed Alsinan, Mohamed Elhoseiny","authorsParsed":[["Alkhaldi","Asma",""],["Alnajim","Raneem",""],["Alabdullatef","Layan",""],["Alyahya","Rawan",""],["Chen","Jun",""],["Zhu","Deyao",""],["Alsinan","Ahmed",""],["Elhoseiny","Mohamed",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 18:21:10 GMT"}],"updateDate":"2024-07-08","timestamp":1720117270000,"abstract":"  Recent advancements in artificial intelligence (AI) have precipitated\nsignificant breakthroughs in healthcare, particularly in refining diagnostic\nprocedures. However, previous studies have often been constrained to limited\nfunctionalities. This study introduces MiniGPT-Med, a vision-language model\nderived from large-scale language models and tailored for medical applications.\nMiniGPT-Med demonstrates remarkable versatility across various imaging\nmodalities, including X-rays, CT scans, and MRIs, enhancing its utility. The\nmodel is capable of performing tasks such as medical report generation, visual\nquestion answering (VQA), and disease identification within medical imagery.\nIts integrated processing of both image and textual clinical data markedly\nimproves diagnostic accuracy. Our empirical assessments confirm MiniGPT-Med's\nsuperior performance in disease grounding, medical report generation, and VQA\nbenchmarks, representing a significant step towards reducing the gap in\nassisting radiology practice. Furthermore, it achieves state-of-the-art\nperformance on medical report generation, higher than the previous best model\nby 19\\% accuracy. MiniGPT-Med promises to become a general interface for\nradiology diagnoses, enhancing diagnostic efficiency across a wide range of\nmedical imaging applications.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"bavuHU1gc3d30bAeuS3fyXn6VHNysw058MTQ_HUOjkY","pdfSize":"4312144"}