{"id":"2407.01822","title":"Science DMZ Networks: How Different are They Really?","authors":"Emily Mutter and Susmit Shannigrahi","authorsParsed":[["Mutter","Emily",""],["Shannigrahi","Susmit",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 21:43:41 GMT"}],"updateDate":"2024-07-04","timestamp":1719870221000,"abstract":"  The Science Demilitarized Zone (Science DMZ) is a network environment\noptimized for scientific applications. A Science DMZ provides an environment\nmostly free from competing traffic flows and complex security middleware such\nas firewalls or intrusion detection systems that often impede data transfer\nperformance. The Science DMZ model provides a reference set of network design\npatterns, tuned hosts and protocol stacks dedicated to large data transfers and\nstreamlined security postures that significantly improve data transfer\nperformance, accelerating scientific collaborations and discovery.\n  Over the past decade, many universities and organizations have adopted this\nmodel for their research computing. Despite becoming increasingly popular,\nthere is a lack of quantitative studies comparing such a specialized network to\nconventional production networks regarding network characteristics and data\ntransfer performance. We strive to answer the following research questions in\nthis study: Does a Science DMZ exhibit significantly different behavior than a\ngeneral-purpose campus network? Does it improve application performance\ncompared to such general-purpose networks? Through a two-year-long quantitative\nnetwork measurement study, we find that a Science DMZ exhibits lower latency,\nhigher throughput, and lower jitter behaviors. However, we also see several\nnon-intuitive results. For example, a DMZ may take a longer route to external\ndestinations and experience higher latency than the campus network. While the\nDMZ model benefits researchers, the benefits are not automatic - careful\nnetwork tuning based on specific use cases is required to realize the full\npotential of such infrastructure.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis","Computing Research Repository/Networking and Internet Architecture"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"kHhVVVaR3JoP4JDqW_Pe6O5svXCJb0Aq4PUGn4Bdcds","pdfSize":"1276320"}