{"id":"2407.08370","title":"Nonlinear vibration and stability of a dielectric elastomer balloon\n  based on a strain-stiffening model","authors":"Amin Alibakhshi, Weiqiu Chen, Michel Destrade","authorsParsed":[["Alibakhshi","Amin",""],["Chen","Weiqiu",""],["Destrade","Michel",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 10:30:23 GMT"}],"updateDate":"2024-07-12","timestamp":1720693823000,"abstract":"  Limiting chain extensibility is a characteristic that plays a vital role in\nthe stretching of highly elastic materials. The Gent model has been widely used\nto capture this behaviour, as it performs very well in fitting stress-stretch\ndata in simple tension, and involves two material parameters only. Recently,\nAnssari-Benam and Bucchi [Int. J. Non. Linear. Mech. 2021, 128, 103626]\nintroduced a different form of generalised neo-Hookean model, focusing on the\nmolecular structure of elastomers, and showed that their model encompasses all\nranges of deformations, performing better than the Gent model in many respects,\nalso with only two parameters. Here we investigate the nonlinear vibration and\nstability of a dielectric elastomer balloon modelled by that strain energy\nfunction. We derive the deformation field in spherical coordinates and the\ngoverning equations by the Euler-Lagrange method, assuming that the balloon\nretains its spherical symmetry as it inflates. We consider in turn that the\nballoon is under two types of voltages, a pure DC voltage and a DC voltage\nsuperimposed on an AC voltage. We analyse the dynamic response of the balloon\nand identify the influential parameters in the model. We find that the\nmolecular structure of the material, as tracked by the number of segments in a\nsingle chain, can control the instability and the pull-in/snap-through critical\nvoltage, as well as chaos and quasi-periodicity. The main result is that\nballoons made of materials exhibiting early strain-stiffening effects are more\nstable and less prone to generate chaotic nonlinear vibrations than softer\nmaterials, such as those modelled by the neo-Hookean strain-energy density\nfunction.\n","subjects":["Nonlinear Sciences/Chaotic Dynamics","Condensed Matter/Soft Condensed Matter"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"r9X79RUXroemULiOMeR0u_TOCd-jKtGxbkz1U4qvSEI","pdfSize":"2560237"}