{"id":"2407.09508","title":"Focused State Recognition Using EEG with Eye Movement-Assisted\n  Annotation","authors":"Tian-Hua Li, Tian-Fang Ma, Dan Peng, Wei-Long Zheng, and Bao-Liang Lu","authorsParsed":[["Li","Tian-Hua",""],["Ma","Tian-Fang",""],["Peng","Dan",""],["Zheng","Wei-Long",""],["Lu","Bao-Liang",""]],"versions":[{"version":"v1","created":"Sat, 15 Jun 2024 14:06:00 GMT"}],"updateDate":"2024-07-16","timestamp":1718460360000,"abstract":"  With the rapid advancement in machine learning, the recognition and analysis\nof brain activity based on EEG and eye movement signals have attained a high\nlevel of sophistication. Utilizing deep learning models for learning EEG and\neye movement features proves effective in classifying brain activities. A\nfocused state indicates intense concentration on a task or thought.\nDistinguishing focused and unfocused states can be achieved through eye\nmovement behaviors, reflecting variations in brain activities. By calculating\nbinocular focusing point disparity in eye movement signals and integrating\nrelevant EEG features, we propose an annotation method for focused states. The\nresulting comprehensive dataset, derived from raw data processed through a\nbio-acquisition device, includes both EEG features and focused labels annotated\nby eye movements. Extensive training and testing on several deep learning\nmodels, particularly the Transformer, yielded a 90.16% accuracy on the\nsubject-dependent experiments. The validity of this approach was demonstrated,\nwith cross-subject experiments, key frequency band and brain region analyses\nconfirming its generalizability and providing physiological explanations.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"i-C3dF-eyCRkKggRGXfkhEi_lPPrebnMLEFPIBO6vNg","pdfSize":"548994","objectId":"0x03172f0bc3abb5e9123c4fc15ad4d22da2be4d75cd64addb04442e46afa5d7f8","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
