{"id":"2407.20050","title":"$\\Delta$-Machine Learning to Elevate DFT-based Potentials and a Force\n  Field to the CCSD(T) Level Illustrated for Ethanol","authors":"Apurba Nandi, Priyanka Pandey, Paul L. Houston, Chen Qu, Qi Yu,\n  Riccardo Conte, Alexandre Tkatchenko, and Joel M. Bowman","authorsParsed":[["Nandi","Apurba",""],["Pandey","Priyanka",""],["Houston","Paul L.",""],["Qu","Chen",""],["Yu","Qi",""],["Conte","Riccardo",""],["Tkatchenko","Alexandre",""],["Bowman","Joel M.",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 14:33:06 GMT"}],"updateDate":"2024-07-30","timestamp":1722263586000,"abstract":"  Progress in machine learning has facilitated the development of potentials\nthat offer both the accuracy of first-principles techniques and vast increases\nin the speed of evaluation. Recently,\"$\\Delta$-machine learning\" has been used\nto elevate the quality of a potential energy surface (PES) based on low-level,\ne.g., density functional theory (DFT) energies and gradients to close to the\ngold-standard coupled cluster level of accuracy. We have demonstrated the\nsuccess of this approach for molecules, ranging in size from H$_3$O$^+$ to\n15-atom acetyl-acetone and tropolone. These were all done using the B3LYP\nfunctional. Here we investigate the generality of this approach for the PBE,\nM06, M06-2X, and PBE0+MBD functionals, using ethanol as the example molecule.\nLinear regression with permutationally invariant polynomials is used to fit\nboth low-level and correction PESs. These PESs are employed for standard RMSE\nanalysis for training and test datasets, and then general fidelity tests such\nas energetics of stationary points, normal mode frequencies, and torsional\npotentials are examined. We achieve similar improvements in all cases.\nInterestingly, we obtained significant improvement over DFT gradients where\ncoupled cluster gradients were not used to correct the low-level PES. Finally,\nwe present some results for correcting a recent molecular mechanics force field\nfor ethanol and comment on the possible generality of this approach.\n","subjects":["Physics/Chemical Physics"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"tTNS6x8Vg0hZrqFW6Q0KPw4sL4zfQVQDfgYgVTGKjSk","pdfSize":"5886705"}