{"id":"2407.15143","title":"Rethinking Feature Backbone Fine-tuning for Remote Sensing Object\n  Detection","authors":"Yechan Kim and JongHyun Park and SooYeon Kim and Moongu Jeon","authorsParsed":[["Kim","Yechan",""],["Park","JongHyun",""],["Kim","SooYeon",""],["Jeon","Moongu",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 12:32:00 GMT"},{"version":"v2","created":"Thu, 8 Aug 2024 05:15:07 GMT"}],"updateDate":"2024-08-09","timestamp":1721565120000,"abstract":"  Recently, numerous methods have achieved impressive performance in remote\nsensing object detection, relying on convolution or transformer architectures.\nSuch detectors typically have a feature backbone to extract useful features\nfrom raw input images. For the remote sensing domain, a common practice among\ncurrent detectors is to initialize the backbone with pre-training on ImageNet\nconsisting of natural scenes. Fine-tuning the backbone is then typically\nrequired to generate features suitable for remote-sensing images. However, this\ncould hinder the extraction of basic visual features in long-term training,\nthus restricting performance improvement. To mitigate this issue, we propose a\nnovel method named DBF (Dynamic Backbone Freezing) for feature backbone\nfine-tuning on remote sensing object detection. Our method aims to handle the\ndilemma of whether the backbone should extract low-level generic features or\npossess specific knowledge of the remote sensing domain, by introducing a\nmodule called 'Freezing Scheduler' to dynamically manage the update of backbone\nfeatures during training. Extensive experiments on DOTA and DIOR-R show that\nour approach enables more accurate model learning while substantially reducing\ncomputational costs. Our method can be seamlessly adopted without additional\neffort due to its straightforward design.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"J-MdqLDvxQ2EnpH_0Cv99PV4DUzT0Hbchxjelh1uAZs","pdfSize":"1400599"}