{"id":"2407.14014","title":"Asymmetric interaction preference induces cooperation in human-agent\n  hybrid game","authors":"Danyang Jia, Xiangfeng Dai, Junliang Xing, Pin Tao, Yuanchun Shi and\n  Zhen Wang","authorsParsed":[["Jia","Danyang",""],["Dai","Xiangfeng",""],["Xing","Junliang",""],["Tao","Pin",""],["Shi","Yuanchun",""],["Wang","Zhen",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 04:10:29 GMT"}],"updateDate":"2024-07-22","timestamp":1721362229000,"abstract":"  With the development of artificial intelligence, human beings are\nincreasingly interested in human-agent collaboration, which generates a series\nof problems about the relationship between agents and humans, such as trust and\ncooperation. This inevitably induces the inherent human characteristic that\nthere are subjective interaction preferences for different groups, especially\nin human-agent hybrid systems where human-human interaction, agent-agent\ninteraction, and human-agent interaction coexist. However, understanding how\nindividual interaction preferences affect the cooperation of the system remains\na major challenge. Therefore, this paper proposes a human-agent hybrid\nprisoner's dilemma game system under the framework of evolutionary game. In\nspatial networks, the most significant difference between agents and humans is\nthe flexibility of decision, where humans have higher adaptive capabilities,\nfollow link dynamics, and adopt free decision rules, which enable them to\nchoose different strategies for different neighbors. However, agents follow\nnode dynamics and adopt consistent decision rules, applying the same strategy\nto different neighbors. We give the subjective preferences of any individual to\ndifferent groups, involving the interaction preferences between homogeneous\ngroups and heterogeneous groups respectively. The simulation results show that\nboth human and agent have asymmetric interaction preferences for groups with\ndifferent identities, which can significantly improve the cooperative behavior\nof the system. In the hybrid system, human groups show more stable prosocial\nbehavior. Agent groups can form highly cooperative clusters under the condition\nof strong interaction preference for human groups. In addition, giving agents\nthe ability to identify opponents can effectively alleviate the interaction\ndilemma of agents.\n","subjects":["Physics/Physics and Society"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"WbntU3J0fKpXSMOavCKqCuexEehVtjXedSj60H3IWQ4","pdfSize":"2848363"}