{"id":"2407.08923","title":"A Bistatic ISAC Framework for LEO Satellite Systems: A Rate-Splitting\n  Approach","authors":"Juha Park, Jaehyup Seong, Jaehak Ryu, Yijie Mao, Wonjae Shin","authorsParsed":[["Park","Juha",""],["Seong","Jaehyup",""],["Ryu","Jaehak",""],["Mao","Yijie",""],["Shin","Wonjae",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 02:07:36 GMT"}],"updateDate":"2024-07-15","timestamp":1720750056000,"abstract":"  Aiming to achieve ubiquitous global connectivity and target detection on the\nsame platform with improved spectral/energy efficiency and reduced onboard\nhardware cost, low Earth orbit (LEO) satellite systems capable of\nsimultaneously performing communications and radar have attracted significant\nattention. Designing such a joint system should address not only the challenges\nof integrating two functions but also the unique propagation characteristics of\nthe satellites. To overcome severe echo signal path loss due to the high\naltitude of the satellite, we put forth a bistatic integrated sensing and\ncommunication (ISAC) framework with a radar receiver separated from the\nsatellite. For robust and effective interference management, we employ\nrate-splitting multiple access (RSMA), which splits and encodes users messages\ninto private and common streams. We optimize the dual-functional precoders to\nmaximize the minimum rate among all users while satisfying the Cramer-Rao bound\n(CRB) constraints. Given the challenge of acquiring instantaneous channel state\ninformation (iCSI) for LEO satellites, we exploit the geometrical and\nstatistical characteristics of the satellite channel. To develop an efficient\noptimization algorithm, semidefinite relaxation (SDR), sequential rank-1\nconstraint relaxation (SROCR), and successive convex approximation (SCA) are\nutilized. Numerical results show that the proposed framework efficiently\nperforms both communication and radar, demonstrating superior interference\ncontrol capabilities. Furthermore, it is validated that the common stream plays\nthree vital roles: i) beamforming towards the radar target, ii) interference\nmanagement between communications and radar, and iii) interference management\namong communication users.\n","subjects":["Computing Research Repository/Information Theory","Computing Research Repository/Networking and Internet Architecture","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"RPucAoX_OynxdnaBuX_A6f36MChhFTmDfPR1Sf8k7iM","pdfSize":"4964650"}