{"id":"2407.14204","title":"Bucketed Ranking-based Losses for Efficient Training of Object Detectors","authors":"Feyza Yavuz, Baris Can Cam, Adnan Harun Dogan, Kemal Oksuz, Emre\n  Akbas, Sinan Kalkan","authorsParsed":[["Yavuz","Feyza",""],["Cam","Baris Can",""],["Dogan","Adnan Harun",""],["Oksuz","Kemal",""],["Akbas","Emre",""],["Kalkan","Sinan",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 11:01:30 GMT"}],"updateDate":"2024-07-22","timestamp":1721386890000,"abstract":"  Ranking-based loss functions, such as Average Precision Loss and Rank&Sort\nLoss, outperform widely used score-based losses in object detection. These loss\nfunctions better align with the evaluation criteria, have fewer\nhyperparameters, and offer robustness against the imbalance between positive\nand negative classes. However, they require pairwise comparisons among $P$\npositive and $N$ negative predictions, introducing a time complexity of\n$\\mathcal{O}(PN)$, which is prohibitive since $N$ is often large (e.g., $10^8$\nin ATSS). Despite their advantages, the widespread adoption of ranking-based\nlosses has been hindered by their high time and space complexities.\n  In this paper, we focus on improving the efficiency of ranking-based loss\nfunctions. To this end, we propose Bucketed Ranking-based Losses which group\nnegative predictions into $B$ buckets ($B \\ll N$) in order to reduce the number\nof pairwise comparisons so that time complexity can be reduced. Our method\nenhances the time complexity, reducing it to $\\mathcal{O}(\\max (N \\log(N),\nP^2))$. To validate our method and show its generality, we conducted\nexperiments on 2 different tasks, 3 different datasets, 7 different detectors.\nWe show that Bucketed Ranking-based (BR) Losses yield the same accuracy with\nthe unbucketed versions and provide $2\\times$ faster training on average. We\nalso train, for the first time, transformer-based object detectors using\nranking-based losses, thanks to the efficiency of our BR. When we train CoDETR,\na state-of-the-art transformer-based object detector, using our BR Loss, we\nconsistently outperform its original results over several different backbones.\nCode is available at https://github.com/blisgard/BucketedRankingBasedLosses\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"3GybKp9O_5tdxGRT1Fp1sLOfA5XLWIgiosqJYrmVZLA","pdfSize":"1265359","objectId":"0x0c18c93ec84e46e59c8ba0392bb1fbbe953fa60db56722cf6eec1231720b2124","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
