{"id":"2407.18597","title":"Reinforcement Learning for Sustainable Energy: A Survey","authors":"Koen Ponse, Felix Kleuker, M\\'arton Fej\\'er, \\'Alvaro Serra-G\\'omez,\n  Aske Plaat, Thomas Moerland","authorsParsed":[["Ponse","Koen",""],["Kleuker","Felix",""],["Fejér","Márton",""],["Serra-Gómez","Álvaro",""],["Plaat","Aske",""],["Moerland","Thomas",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 08:37:14 GMT"}],"updateDate":"2024-07-29","timestamp":1721983034000,"abstract":"  The transition to sustainable energy is a key challenge of our time,\nrequiring modifications in the entire pipeline of energy production, storage,\ntransmission, and consumption. At every stage, new sequential decision-making\nchallenges emerge, ranging from the operation of wind farms to the management\nof electrical grids or the scheduling of electric vehicle charging stations.\nAll such problems are well suited for reinforcement learning, the branch of\nmachine learning that learns behavior from data. Therefore, numerous studies\nhave explored the use of reinforcement learning for sustainable energy. This\npaper surveys this literature with the intention of bridging both the\nunderlying research communities: energy and machine learning. After a brief\nintroduction of both fields, we systematically list relevant sustainability\nchallenges, how they can be modeled as a reinforcement learning problem, and\nwhat solution approaches currently exist in the literature. Afterwards, we zoom\nout and identify overarching reinforcement learning themes that appear\nthroughout sustainability, such as multi-agent, offline, and safe reinforcement\nlearning. Lastly, we also cover standardization of environments, which will be\ncrucial for connecting both research fields, and highlight potential directions\nfor future work. In summary, this survey provides an extensive overview of\nreinforcement learning methods for sustainable energy, which may play a vital\nrole in the energy transition.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computers and Society","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"KFdbaHflMPk30hR0g6dz8U3WOgNwVHgEWL6q0mui3eI","pdfSize":"2181696"}