{"id":"2407.19000","title":"Reinforcement learning for anisotropic p-adaptation and error estimation\n  in high-order solvers","authors":"David Huergo, Mart\\'in de Frutos, Eduardo Jan\\'e, Oscar A. Marino,\n  Gonzalo Rubio and Esteban Ferrer","authorsParsed":[["Huergo","David",""],["de Frutos","Martín",""],["Jané","Eduardo",""],["Marino","Oscar A.",""],["Rubio","Gonzalo",""],["Ferrer","Esteban",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 17:55:23 GMT"}],"updateDate":"2024-07-30","timestamp":1722016523000,"abstract":"  We present a novel approach to automate and optimize anisotropic p-adaptation\nin high-order h/p solvers using Reinforcement Learning (RL). The dynamic RL\nadaptation uses the evolving solution to adjust the high-order polynomials. We\ndevelop an offline training approach, decoupled from the main solver, which\nshows minimal overcost when performing simulations. In addition, we derive a\nRL-based error estimation approach that enables the quantification of local\ndiscretization errors. The proposed methodology is agnostic to both the\ncomputational mesh and the partial differential equation being solved.\n  The application of RL to mesh adaptation offers several benefits. It enables\nautomated, adaptive mesh refinement, reducing the need for manual intervention.\nIt optimizes computational resources by dynamically allocating high-order\npolynomials where necessary and minimizing refinement in stable regions. This\nleads to computational cost savings while maintaining solution accuracy.\nFurthermore, RL allows for the exploration of unconventional mesh adaptations,\npotentially enhancing the accuracy and robustness of simulations. This work\nextends our original research, offering a more robust, reproducible, and\ngeneralizable approach applicable to complex three-dimensional problems. We\nprovide validation for laminar and turbulent cases: circular cylinders, Taylor\nGreen Vortex and a 10MW wind turbine to illustrate the flexibility of the\nproposed approach.\n","subjects":["Physics/Fluid Dynamics","Computing Research Repository/Machine Learning","Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"NUXCSJ-258R6z_UMnYuUt_x1832R1K9BYoqvof_EtOE","pdfSize":"9268343"}