{"id":"2407.18845","title":"Gravitational waves from a curvature-induced phase transition of a\n  Higgs-portal dark matter sector","authors":"Andreas Mantziris and Orfeu Bertolami","authorsParsed":[["Mantziris","Andreas",""],["Bertolami","Orfeu",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 16:11:45 GMT"}],"updateDate":"2024-07-29","timestamp":1722010305000,"abstract":"  The study of interactions between dark matter and the Higgs field opens an\nexciting connection between cosmology and particle physics, since such\nscenarios can impact the features of dark matter as well as interfering with\nthe spontaneous breaking of the electroweak symmetry. Furthermore, such\nHiggs-portal models of dark matter should be suitably harmonised with the\nvarious epochs of the universe and the phenomenological constraints imposed by\ncollider experiments. At the same time, the prospect of a stochastic\ngravitational wave background offers a promising new window into the primordial\nuniverse, which can complement the insights gained from accelerators. In this\nstudy, we examined whether gravitational waves can be generated from a\ncurvature-induced phase transition of a non-minimally coupled dark scalar field\nwith a portal coupling to the Higgs field. The main requirement is that the\nphase transition is of first order, which can be achieved through the\nintroduction of a cubic term on the scalar potential and the sign change of the\ncurvature scalar. This mechanism was investigated in the context of a dynamical\nspacetime during the transition from inflation to kination, while also\nconsidering the possibility for inducing electroweak symmetry breaking in this\nmanner for a sufficiently low reheating temperature when the Higgs-portal\ncoupling is extremely weak. We considered a large range of inflationary scales\nand both cases of positive and negative values for the non-minimal coupling,\nwhile taking into account the bound imposed by Big Bang Nucleosythesis. The\nresulting gravitational wave amplitudes are boosted by kination and thus\nconstrain the parameter space of the couplings significantly. Even though the\nspectra lie at high frequencies for the standard high inflationary scales,\nthere are combinations of parameter space where they could be probed with\nfuture experiments.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"gudKGIJ21bbxfz64d0vivfk9GrRszbPcPgDNiUOpQ-M","pdfSize":"1402080"}