{"id":"2407.03413","title":"Simulations of cluster ultra-diffuse galaxies in MOND","authors":"Srikanth T. Nagesh, Jonathan Freundlich, Benoit Famaey, Michal\n  B\\'ilek, Graeme Candlish, Rodrigo Ibata, Oliver M\\\"uller","authorsParsed":[["Nagesh","Srikanth T.",""],["Freundlich","Jonathan",""],["Famaey","Benoit",""],["Bílek","Michal",""],["Candlish","Graeme",""],["Ibata","Rodrigo",""],["Müller","Oliver",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 18:00:05 GMT"}],"updateDate":"2024-07-08","timestamp":1720029605000,"abstract":"  Ultra-diffuse galaxies (UDGs) in the Coma cluster have velocity dispersion\nprofiles that are in full agreement with the predictions of Modified Newtonian\nDynamics (MOND) in isolation. However, the external field effect (EFE) from the\ncluster seriously deteriorates this agreement. It has been suggested that this\ncould be related to the fact that UDGs are out-of-equilibrium objects whose\nstars have been heated by the cluster tides or that they recently fell onto the\ncluster on radial orbits, such that their velocity dispersion may not reflect\nthe EFE at their instantaneous distance from the cluster center. Here, we\nsimulate UDGs within the Coma cluster in MOND, using the Phantom of Ramses\n(\\textsc{por}) code, and show that if UDGs are initially at equilibrium within\nthe cluster, tides are not sufficient to increase their velocity dispersions to\nvalues as high as the observed ones. On the other hand, if they are on a first\nradial infall onto the cluster, they can keep high velocity dispersions without\nbeing destroyed until their first pericentric passage. We conclude that,\nwithout alterations such as a screening of the EFE in galaxy clusters or much\nhigher baryonic masses than currently estimated, in the MOND context UDGs must\nbe out-of-equilibrium objects on their first infall onto the cluster.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"EbiCSH5vu3uX8rE1qE5iC_cMtCkFJPv8vygeRDTmu8o","pdfSize":"1827451"}