{"id":"2407.05616","title":"Explainable Image Recognition via Enhanced Slot-attention Based\n  Classifier","authors":"Bowen Wang, Liangzhi Li, Jiahao Zhang, Yuta Nakashima, Hajime Nagahara","authorsParsed":[["Wang","Bowen",""],["Li","Liangzhi",""],["Zhang","Jiahao",""],["Nakashima","Yuta",""],["Nagahara","Hajime",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 05:05:43 GMT"}],"updateDate":"2024-07-09","timestamp":1720415143000,"abstract":"  The imperative to comprehend the behaviors of deep learning models is of\nutmost importance. In this realm, Explainable Artificial Intelligence (XAI) has\nemerged as a promising avenue, garnering increasing interest in recent years.\nDespite this, most existing methods primarily depend on gradients or input\nperturbation, which often fails to embed explanations directly within the\nmodel's decision-making process. Addressing this gap, we introduce ESCOUTER, a\nvisually explainable classifier based on the modified slot attention mechanism.\nESCOUTER distinguishes itself by not only delivering high classification\naccuracy but also offering more transparent insights into the reasoning behind\nits decisions. It differs from prior approaches in two significant aspects: (a)\nESCOUTER incorporates explanations into the final confidence scores for each\ncategory, providing a more intuitive interpretation, and (b) it offers positive\nor negative explanations for all categories, elucidating \"why an image belongs\nto a certain category\" or \"why it does not.\" A novel loss function specifically\nfor ESCOUTER is designed to fine-tune the model's behavior, enabling it to\ntoggle between positive and negative explanations. Moreover, an area loss is\nalso designed to adjust the size of the explanatory regions for a more precise\nexplanation. Our method, rigorously tested across various datasets and XAI\nmetrics, outperformed previous state-of-the-art methods, solidifying its\neffectiveness as an explanatory tool.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"C8ckPrkHBcYMji-VbZw8hWFe_kS_Mrw4Htkz9OJKAjk","pdfSize":"35437366"}
