{"id":"2407.00041","title":"Accelerating Lattice QCD Simulations using GPUs","authors":"Tilmann Matthaei","authorsParsed":[["Matthaei","Tilmann",""]],"versions":[{"version":"v1","created":"Wed, 29 May 2024 16:17:27 GMT"}],"updateDate":"2024-07-02","timestamp":1716999447000,"abstract":"  Solving discretized versions of the Dirac equation represents a large share\nof execution time in lattice Quantum Chromodynamics (QCD) simulations. Many\nhigh-performance computing (HPC) clusters use graphics processing units (GPUs)\nto offer more computational resources. Our solver program, DDalphaAMG,\npreviously was unable to fully take advantage of GPUs to accelerate its\ncomputations. Making use of GPUs for DDalphaAMG is an ongoing development, and\nwe will present some current progress herein. Through a detailed description of\nour development, this thesis should offer valuable insights into using GPUs to\naccelerate a memory-bound CPU implementation.\n  We developed a storage scheme for multiple tuples, which allows much more\nefficient memory access on GPUs, given that the element at the same index is\nread from multiple tuples simultaneously. Still, our implementation of a\ndiscrete Dirac operator is memory-bound, and we only achieved improvements for\nlarge linear systems on few nodes at the JUWELS cluster. These improvements do\nnot currently overcome additional introduced overheads. However, the results\nfor the application of the Wilson-Dirac operator show a speedup of around 3 for\nlarge lattices. If the additional overheads can be eliminated in the future,\nGPUs could reduce the DDalphaAMG execution time significantly for large\nlattices.\n  We also found that a previous publication on the GPU acceleration of\nDDalphaAMG, underrepresented the achieved speedup, because small lattices were\nused. This further highlights that GPUs often require large-scale problems to\nsolve in order to be faster than CPUs\n","subjects":["Physics/High Energy Physics - Lattice","Computing Research Repository/Distributed, Parallel, and Cluster Computing","Computing Research Repository/Data Structures and Algorithms"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"5cMyRkf-Dj8K82U34qF0HLYNd1unG9_37EapN7VCHBw","pdfSize":"776487"}