{"id":"2407.12162","title":"Estimate of water and hydroxyl abundance on asteroid (16) Psyche from\n  JWST data","authors":"Stephanie G. Jarmak, Tracy M. Becker, Charles E. Woodward, Casey I.\n  Honniball, Andrew S. Rivkin, Margaret M. McAdam, Zoe A. Landsman, Saverio\n  Cambioni, Thomas G. M\\\"uller, Driss Takir, Kurt D. Retherford, Anicia\n  Arredondo, Linda T. Elkins-Tanton","authorsParsed":[["Jarmak","Stephanie G.",""],["Becker","Tracy M.",""],["Woodward","Charles E.",""],["Honniball","Casey I.",""],["Rivkin","Andrew S.",""],["McAdam","Margaret M.",""],["Landsman","Zoe A.",""],["Cambioni","Saverio",""],["Müller","Thomas G.",""],["Takir","Driss",""],["Retherford","Kurt D.",""],["Arredondo","Anicia",""],["Elkins-Tanton","Linda T.",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 20:40:06 GMT"}],"updateDate":"2024-07-18","timestamp":1721162406000,"abstract":"  Our understanding of Solar System evolution is closely tied to\ninterpretations of asteroid composition, particularly the M-class asteroids.\nThese asteroids were initially thought to be the exposed cores of\ndifferentiated planetesimals, a hypothesis based on their spectral similarity\nto iron meteorites. However, recent astronomical observations have revealed\nhydration on their surface through the detection of 3-$\\mu$m absorption\nfeatures associated with OH and potentially H2O. We present evidence of\nhydration due mainly to OH on asteroid (16) Psyche, the largest M-class\nasteroid, using data from the James Webb Space Telescope (JWST) spanning 1.1 -\n6.63 $\\mu$m. Our observations include two detections of the full 3-$\\mu$m\nfeature associated with OH and H2O resembling those found in CY-, CH-, and\nCB-type carbonaceous chondrites, and no 6-$\\mu$m feature uniquely associated\nwith H2O across two observations. We observe 3-$\\mu$m depths of between 4.3 and\n6% across two observations, values consistent with hydrogen abundance estimates\non other airless bodies of 250 - 400 ppm. We place an upper limit of 39 ppm on\nthe water abundance from the standard deviation around the 6-$\\mu$m feature\nregion. The presence of hydrated minerals suggests a complex history for\nPsyche. Exogenous sources of OH-bearing minerals could come from hydrated\nimpactors. Endogenous OH-bearing minerals would indicate a composition more\nsimilar to E-or P-class asteroids. If the hydration is endogenous, it supports\nthe theory that Psyche originated beyond the snow line and later migrated to\nthe outer main belt.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"-DsWAgg1bD_UmF8iYGUzviOET59iQPAUPskWcGeS--w","pdfSize":"3752965"}