{"id":"2407.17703","title":"Context-aware knowledge graph framework for traffic speed forecasting\n  using graph neural network","authors":"Yatao Zhang, Yi Wang, Song Gao, Martin Raubal","authorsParsed":[["Zhang","Yatao",""],["Wang","Yi",""],["Gao","Song",""],["Raubal","Martin",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 01:52:12 GMT"}],"updateDate":"2024-07-26","timestamp":1721872332000,"abstract":"  Human mobility is intricately influenced by urban contexts spatially and\ntemporally, constituting essential domain knowledge in understanding traffic\nsystems. While existing traffic forecasting models primarily rely on raw\ntraffic data and advanced deep learning techniques, incorporating contextual\ninformation remains underexplored due to the lack of effective integration\nframeworks and the complexity of urban contexts. This study proposes a novel\ncontext-aware knowledge graph (CKG) framework to enhance traffic speed\nforecasting by effectively modeling spatial and temporal contexts. Employing a\nrelation-dependent integration strategy, the framework generates context-aware\nrepresentations from the spatial and temporal units of CKG to capture\nspatio-temporal dependencies of urban contexts. A CKG-GNN model, combining the\nCKG, dual-view multi-head self-attention (MHSA), and graph neural network\n(GNN), is then designed to predict traffic speed using these context-aware\nrepresentations. Our experiments demonstrate that CKG's configuration\nsignificantly influences embedding performance, with ComplEx and KG2E emerging\nas optimal for embedding spatial and temporal units, respectively. The CKG-GNN\nmodel surpasses benchmark models, achieving an average MAE of $3.46\\pm0.01$ and\na MAPE of $14.76\\pm0.09\\%$ for traffic speed predictions from 10 to 120\nminutes. The dual-view MHSA analysis reveals the crucial role of\nrelation-dependent features from the context-based view and the model's ability\nto prioritize recent time slots in prediction from the sequence-based view. The\nCKG framework's model-agnostic nature suggests its potential applicability in\nvarious applications of intelligent transportation systems. Overall, this study\nunderscores the importance of incorporating domain-specific contexts into\ntraffic forecasting and merging context-aware knowledge graphs with neural\nnetworks to enhance accuracy.\n","subjects":["Computing Research Repository/Machine Learning","Physics/Physics and Society"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"svAcoiR14WPrOW9HZB8V5lDVdFIgY_7NptvTtYR9Gcc","pdfSize":"4598704","objectId":"0x5f65b36ec9f261c4ceb49ee904dbb6ddae750e608453e8ee94ce4dddd3de7ad1","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
