{"id":"2407.18386","title":"Leveraging Core and Uncore Frequency Scaling for Power-Efficient\n  Serverless Workflows","authors":"Achilleas Tzenetopoulos, Dimosthenis Masouros, Sotirios Xydis,\n  Dimitrios Soudris","authorsParsed":[["Tzenetopoulos","Achilleas",""],["Masouros","Dimosthenis",""],["Xydis","Sotirios",""],["Soudris","Dimitrios",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 20:40:43 GMT"},{"version":"v2","created":"Mon, 5 Aug 2024 21:06:50 GMT"}],"updateDate":"2024-08-07","timestamp":1721940043000,"abstract":"  Serverless workflows have emerged in FaaS platforms to represent the\noperational structure of traditional applications. With latency propagation\neffects becoming increasingly prominent, step-wise resource tuning is required\nto address the end-to-end Quality-of-Service (QoS) requirements. Modern\nprocessors' allowance for fine-grained Dynamic Voltage and Frequency Scaling\n(DVFS), coupled with the intermittent nature of serverless workflows presents a\nunique opportunity to reduce power while meeting QoS.\n  In this paper, we introduce a QoS-aware DVFS framework for serverless\nworkflows. {\\Omega}kypous regulates the end-to-end latency of serverless\nworkflows by supplying the system with the Core/Uncore frequency combination\nthat minimizes power consumption. With Uncore DVFS enriching the efficient\npower configurations space, we devise a grey-box model that accurately projects\nfunctions' execution latency and power, to the applied Core and Uncore\nfrequency combination. To the best of our knowledge, {\\Omega}kypous is the\nfirst work that leverages Core and Uncore DVFS as an integral part of\nserverless workflows. Our evaluation on the analyzed Azure Trace, against\nstate-of-the-art (SotA) power managers, demonstrates a power consumption\nreduction of 20\\% while minimizing QoS violations.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"fU7NoWiWibAUBP2Y4vNbSHU16k6ogfqC5AAt9BM2cMw","pdfSize":"2095379"}