{"id":"2407.14474","title":"Contrastive Learning with Counterfactual Explanations for Radiology\n  Report Generation","authors":"Mingjie Li, Haokun Lin, Liang Qiu, Xiaodan Liang, Ling Chen,\n  Abdulmotaleb Elsaddik, and Xiaojun Chang","authorsParsed":[["Li","Mingjie",""],["Lin","Haokun",""],["Qiu","Liang",""],["Liang","Xiaodan",""],["Chen","Ling",""],["Elsaddik","Abdulmotaleb",""],["Chang","Xiaojun",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 17:24:25 GMT"}],"updateDate":"2024-07-22","timestamp":1721409865000,"abstract":"  Due to the common content of anatomy, radiology images with their\ncorresponding reports exhibit high similarity. Such inherent data bias can\npredispose automatic report generation models to learn entangled and spurious\nrepresentations resulting in misdiagnostic reports. To tackle these, we propose\na novel \\textbf{Co}unter\\textbf{F}actual \\textbf{E}xplanations-based framework\n(CoFE) for radiology report generation. Counterfactual explanations serve as a\npotent tool for understanding how decisions made by algorithms can be changed\nby asking ``what if'' scenarios. By leveraging this concept, CoFE can learn\nnon-spurious visual representations by contrasting the representations between\nfactual and counterfactual images. Specifically, we derive counterfactual\nimages by swapping a patch between positive and negative samples until a\npredicted diagnosis shift occurs. Here, positive and negative samples are the\nmost semantically similar but have different diagnosis labels. Additionally,\nCoFE employs a learnable prompt to efficiently fine-tune the pre-trained large\nlanguage model, encapsulating both factual and counterfactual content to\nprovide a more generalizable prompt representation. Extensive experiments on\ntwo benchmarks demonstrate that leveraging the counterfactual explanations\nenables CoFE to generate semantically coherent and factually complete reports\nand outperform in terms of language generation and clinical efficacy metrics.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Y16119AEe6vkxDaBuQ2MpBYdJGjuD-MhKfQ65gCQ_X4","pdfSize":"6749086"}