{"id":"2407.20536","title":"Single-BS Simultaneous Environment Sensing and UE Localization without\n  LoS Path by Exploiting Near-Field Scatterers","authors":"Zhiwen Zhou, Zhiqiang Xiao and Yong Zeng","authorsParsed":[["Zhou","Zhiwen",""],["Xiao","Zhiqiang",""],["Zeng","Yong",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 04:38:46 GMT"},{"version":"v2","created":"Tue, 20 Aug 2024 07:33:31 GMT"},{"version":"v3","created":"Fri, 23 Aug 2024 07:37:58 GMT"}],"updateDate":"2024-08-26","timestamp":1722314326000,"abstract":"  As the mobile communication network evolves over the past few decades,\nlocalizing user equipment (UE) has become an important network service. While\nlocalization in line-of-sight (LoS) scenarios has reached a level of maturity,\nit is known that in far-field scenarios without a LoS path nor any prior\ninformation about the scatterers, accurately localizing the UE is impossible.\nIn this letter, we show that this becomes possible if there are scatterers in\nthe near-field region of the base station (BS) antenna arrays. Specifically, by\nexploiting the additional distance sensing capability of extremely large-scale\nantenna arrays (XL-arrays) provided by near-field effects, we propose a novel\nmethod that simultaneously performs environment sensing and non-line-of-sight\n(NLoS) UE localization using one single BS. In the proposed method, the BS\nleverages the near-field characteristics of XL-arrays to directly estimate the\nlocations of the near-field scatterers with array signal processing, which then\nserves as virtual anchors for UE localization. Then, the propagation delay for\neach path is estimated and the position of the UE is obtained based on the\npositions of scatterers and the path delays. Simulation results demonstrate\nthat the proposed method achieves superior accuracy and robustness with similar\ncomplexity compared with benchmark methods.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"6eqLCFgkfly-T4G1CeZ1OyfCGzB1FxYNZrjWIR5XCbg","pdfSize":"257967"}