{"id":"2407.04525","title":"Enhancing learning in spiking neural networks through neuronal\n  heterogeneity and neuromodulatory signaling","authors":"Alejandro Rodriguez-Garcia, Jie Mei and Srikanth Ramaswamy","authorsParsed":[["Rodriguez-Garcia","Alejandro",""],["Mei","Jie",""],["Ramaswamy","Srikanth",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 14:11:28 GMT"},{"version":"v2","created":"Mon, 16 Sep 2024 13:49:32 GMT"}],"updateDate":"2024-09-17","timestamp":1720188688000,"abstract":"  Recent progress in artificial intelligence (AI) has been driven by insights\nfrom neuroscience, particularly with the development of artificial neural\nnetworks (ANNs). This has significantly enhanced the replication of complex\ncognitive tasks such as vision and natural language processing. Despite these\nadvances, ANNs struggle with continual learning, adaptable knowledge transfer,\nrobustness, and resource efficiency - capabilities that biological systems\nhandle seamlessly. Specifically, ANNs often overlook the functional and\nmorphological diversity of the brain, hindering their computational\ncapabilities. Furthermore, incorporating cell-type specific neuromodulatory\neffects into ANNs with neuronal heterogeneity could enable learning at two\nspatial scales: spiking behavior at the neuronal level, and synaptic plasticity\nat the circuit level, thereby potentially enhancing their learning abilities.\nIn this article, we summarize recent bio-inspired models, learning rules and\narchitectures and propose a biologically-informed framework for enhancing ANNs.\nOur proposed dual-framework approach highlights the potential of spiking neural\nnetworks (SNNs) for emulating diverse spiking behaviors and dendritic\ncompartments to simulate morphological and functional diversity of neuronal\ncomputations. Finally, we outline how the proposed approach integrates\nbrain-inspired compartmental models and task-driven SNNs, balances\nbioinspiration and complexity, and provides scalable solutions for pressing AI\nchallenges, such as continual learning, adaptability, robustness, and\nresource-efficiency.\n","subjects":["Quantitative Biology/Neurons and Cognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"pcW5Mx0DFNcworgBX0qp4Fa6vgocBGLLsllJLM-Iqu4","pdfSize":"608525"}