{"id":"2407.21247","title":"X-ray Emission of Nearby Low-mass and Sun-like Stars with Directly\n  Imageable Habitable Zones","authors":"Breanna A. Binder, Sarah Peacock, Edward W. Schwieterman, Margaret C.\n  Turnbull, Azariel Y. Virgen, Stephen R. Kane, Alison Farrish, Katherine\n  Garcia-Sage","authorsParsed":[["Binder","Breanna A.",""],["Peacock","Sarah",""],["Schwieterman","Edward W.",""],["Turnbull","Margaret C.",""],["Virgen","Azariel Y.",""],["Kane","Stephen R.",""],["Farrish","Alison",""],["Garcia-Sage","Katherine",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 23:42:25 GMT"}],"updateDate":"2024-08-01","timestamp":1722382945000,"abstract":"  Stellar X-ray and UV radiation can significantly affect the survival,\ncomposition, and long-term evolution of the atmospheres of planets in or near\ntheir host star's habitable zone (HZ). Especially interesting are planetary\nsystems in the solar neighborhood that may host temperate and potentially\nhabitable surface conditions, which may be analyzed by future ground and\nspace-based direct-imaging surveys for signatures of habitability and life. To\nadvance our understanding of the radiation environment in these systems, we\nleverage $\\sim$3 Msec of XMM-Newton and Chandra observations in order to\nmeasure three fundamental stellar properties at X-ray energies for 57 nearby\nFGKM stellar systems: the shape of the stellar X-ray spectrum, the luminosity,\nand the timescales over which the stars vary (e.g., due to flares). These\nsystems possess HZs that will be directly imageable to next-generation\ntelescopes such as the Habitable Worlds Observatory and ground-based Extremely\nLarge Telescopes (ELTs). We identify 29 stellar systems with $L_X/L_{\\rm bol}$\nratios similar to (or less than) that of the Sun; any potential planets in the\nhabitable zones of these stars therefore reside in present day X-ray radiation\nenvironments similar to (or less hostile than) modern Earth, though a broader\nset of these targets could host habitable planets. An additional 19 stellar\nsystems have been observed with the Swift X-ray Telescope; in total, only\n$\\sim$30% of potential direct imaging target stars has been observed with\nXMM-Newton, Chandra, or Swift. The data products from this work (X-ray light\ncurves and spectra) are available via a public Zenodo repository (doi:\n10.5281/zenodo.11490574).\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"guObB-Dnr3ZrHVO3Xm_kNiV2r-oBupyDU3gSDfVquKw","pdfSize":"9040574"}