{"id":"2407.02095","title":"TIGER: A Generating-Then-Ranking Framework for Practical Python Type\n  Inference","authors":"Chong Wang, Jian Zhang, Yiling Lou, Mingwei Liu, Weisong Sun, Yang\n  Liu, and Xin Peng","authorsParsed":[["Wang","Chong",""],["Zhang","Jian",""],["Lou","Yiling",""],["Liu","Mingwei",""],["Sun","Weisong",""],["Liu","Yang",""],["Peng","Xin",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 09:29:02 GMT"},{"version":"v2","created":"Tue, 16 Jul 2024 15:26:45 GMT"},{"version":"v3","created":"Tue, 13 Aug 2024 14:21:47 GMT"}],"updateDate":"2024-08-14","timestamp":1719912542000,"abstract":"  Python's dynamic typing system offers flexibility and expressiveness but can\nlead to type-related errors, prompting the need for automated type inference to\nenhance type hinting. While existing learning-based approaches show promising\ninference accuracy, they struggle with practical challenges in comprehensively\nhandling various types, including complex generic types and (unseen)\nuser-defined types.\n  In this paper, we introduce TIGER, a two-stage generating-then-ranking (GTR)\nframework, designed to effectively handle Python's diverse type categories.\nTIGER leverages fine-tuned pre-trained code models to train a generative model\nwith a span masking objective and a similarity model with a contrastive\ntraining objective. This approach allows TIGER to generate a wide range of type\ncandidates, including complex generics in the generating stage, and accurately\nrank them with user-defined types in the ranking stage. Our evaluation on the\nManyTypes4Py dataset shows TIGER's advantage over existing methods in various\ntype categories, notably improving accuracy in inferring user-defined and\nunseen types by 11.2% and 20.1% respectively in Top-5 Exact Match. Moreover,\nthe experimental results not only demonstrate TIGER's superior performance and\nefficiency, but also underscore the significance of its generating and ranking\nstages in enhancing automated type inference.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"DXggC0crIrOSkKAnlShIg7TbxYcn0F1ZnZif0OcI_Q0","pdfSize":"1580603"}