{"id":"2407.15732","title":"A fast frequency-domain expression for the time-dependent detector\n  response of ground-based gravitational-wave detectors to compact binary\n  signals","authors":"Anson Chen and Nathan K Johnson-McDaniel","authorsParsed":[["Chen","Anson",""],["Johnson-McDaniel","Nathan K",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 15:36:01 GMT"}],"updateDate":"2024-07-23","timestamp":1721662561000,"abstract":"  For proposed third-generation gravitational-wave detectors such as the\nEinstein Telescope and Cosmic Explorer, whose sensitive bands are proposed to\nextend down to 5 Hz or below, the signals of low-mass compact binaries such as\nbinary neutron stars remain in the detector's sensitive band long enough (up to\na few days for the smallest proposed low-frequency cutoff of 1 Hz) that one\ncannot neglect the effects of the Earth's rotation on the detector's response\nand the changing Doppler shift of the signal. In the latter case, one also\nneeds to consider the effects of the Earth's orbital motion, which is currently\nonly included in analyses of compact binary signals using continuous wave\ntechniques. These effects are also relevant for current detectors and signals\nfrom putative subsolar-mass binaries. Here we present simple Fourier series\nmethods for computing these effects in the frequency domain, giving explicit\nexpressions for the Earth's orbital motion in terms of low-order Fourier\nseries, which will be sufficiently accurate for all compact binary signals\nexcept for those from very low-mass subsolar-mass binaries. The expression for\nthe effects of the Earth's rotation on the antenna pattern functions does not\nuse the stationary phase approximation (SPA), so we are able to show that the\nSPA is indeed quite accurate in these situations and present a Fourier series\nexpression equivalent to it which is an order of magnitude faster. We also\nprovide illustrations of these effects on detector sensitivity and the\naccumulation of information about various binary parameters with frequency.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_gAqqrefVLLFh_aLyjuxWyyaDwQJAfSZLei9twlxyDE","pdfSize":"2745180"}