{"id":"2407.00187","title":"SMPLOlympics: Sports Environments for Physically Simulated Humanoids","authors":"Zhengyi Luo, Jiashun Wang, Kangni Liu, Haotian Zhang, Chen Tessler,\n  Jingbo Wang, Ye Yuan, Jinkun Cao, Zihui Lin, Fengyi Wang, Jessica Hodgins,\n  Kris Kitani","authorsParsed":[["Luo","Zhengyi",""],["Wang","Jiashun",""],["Liu","Kangni",""],["Zhang","Haotian",""],["Tessler","Chen",""],["Wang","Jingbo",""],["Yuan","Ye",""],["Cao","Jinkun",""],["Lin","Zihui",""],["Wang","Fengyi",""],["Hodgins","Jessica",""],["Kitani","Kris",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 18:53:05 GMT"}],"updateDate":"2024-07-02","timestamp":1719600785000,"abstract":"  We present SMPLOlympics, a collection of physically simulated environments\nthat allow humanoids to compete in a variety of Olympic sports. Sports\nsimulation offers a rich and standardized testing ground for evaluating and\nimproving the capabilities of learning algorithms due to the diversity and\nphysically demanding nature of athletic activities. As humans have been\ncompeting in these sports for many years, there is also a plethora of existing\nknowledge on the preferred strategy to achieve better performance. To leverage\nthese existing human demonstrations from videos and motion capture, we design\nour humanoid to be compatible with the widely-used SMPL and SMPL-X human models\nfrom the vision and graphics community. We provide a suite of individual sports\nenvironments, including golf, javelin throw, high jump, long jump, and\nhurdling, as well as competitive sports, including both 1v1 and 2v2 games such\nas table tennis, tennis, fencing, boxing, soccer, and basketball. Our analysis\nshows that combining strong motion priors with simple rewards can result in\nhuman-like behavior in various sports. By providing a unified sports benchmark\nand baseline implementation of state and reward designs, we hope that\nSMPLOlympics can help the control and animation communities achieve human-like\nand performant behaviors.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Graphics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"0oV5bjG5aFsnCaML3zMBXz6fKSltKG_lnkv2S5-2iPc","pdfSize":"4707913","objectId":"0x36b69def58b07e2c521be659c420f106bba32c52d265950ea6c1913bde37ddea","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
