{"id":"2407.14629","title":"Astronomy's relationship with the lands and communities of Maunakea","authors":"Jean-Gabriel Cuby (1), Christine Matsuda (2), Rich Matsuda (3), Andy\n  Adamson (4), John O'Meara (3), Nadine Manset (1) ((1) Canada-France-Hawai'i\n  Telescope, Waimea, Hawai'i, (2) Maunakea Observatories, Hawai'i, (3) W. M.\n  Keck Observatory, Hawai'i, (4) The Gemini International Observatory, Hawai'i)","authorsParsed":[["Cuby","Jean-Gabriel",""],["Matsuda","Christine",""],["Matsuda","Rich",""],["Adamson","Andy",""],["O'Meara","John",""],["Manset","Nadine",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 18:57:33 GMT"}],"updateDate":"2024-07-23","timestamp":1721415453000,"abstract":"  Astronomy is at a turning point in its history and in its relations with the\nIndigenous peoples who are the generational stewards of land where several of\nour main observatories are located. The controversy regarding the further\ndevelopment of astronomy facilities on Maunakea is probably the most\nsignificant and publicized conflict about the use of such land in the name of\nscience. Thousands have stood in resistance, elders were arrested, and the\ncommunity is divided. Astronomy's access to one of its most emblematic sites is\nat risk. This situation challenges our professional practice, the projects we\nbuild on Indigenous lands, and our relationships with the people who live\nwithin these lands and with society in general. This paper attempts to share\nthe perspective of the authors on the historical events, including the very\nrecent past, through the lens of our understanding and opinions; to provide\ntransparency, with humility, into our process of introspection and\ntransformation; and to share our hopes and ambitions as leaders from Maunakea\nObservatories for the future of astronomy in Hawai'i, as advocated by the\nAstro2020 report from the U.S. National Academies of Sciences, Engineering, and\nMedicine; and to suggest ways for the profession to commit to this long-term\nvision.\n","subjects":["Physics/Physics and Society","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ooz3ZElVb9eoyvUzy7u0zinqhL7upv5E6wgn63ksMDA","pdfSize":"2670359"}