{"id":"2407.21580","title":"Voxel Scene Graph for Intracranial Hemorrhage","authors":"Antoine P. Sanner, Nils F. Grauhan, Marc A. Brockmann, Ahmed E.\n  Othman, Anirban Mukhopadhyay","authorsParsed":[["Sanner","Antoine P.",""],["Grauhan","Nils F.",""],["Brockmann","Marc A.",""],["Othman","Ahmed E.",""],["Mukhopadhyay","Anirban",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 13:10:59 GMT"}],"updateDate":"2024-08-01","timestamp":1722431459000,"abstract":"  Patients with Intracranial Hemorrhage (ICH) face a potentially\nlife-threatening condition, and patient-centered individualized treatment\nremains challenging due to possible clinical complications. Deep-Learning-based\nmethods can efficiently analyze the routinely acquired head CTs to support the\nclinical decision-making. The majority of early work focuses on the detection\nand segmentation of ICH, but do not model the complex relations between ICH and\nadjacent brain structures. In this work, we design a tailored object detection\nmethod for ICH, which we unite with segmentation-grounded Scene Graph\nGeneration (SGG) methods to learn a holistic representation of the clinical\ncerebral scene. To the best of our knowledge, this is the first application of\nSGG for 3D voxel images. We evaluate our method on two head-CT datasets and\ndemonstrate that our model can recall up to 74% of clinically relevant\nrelations. This work lays the foundation towards SGG for 3D voxel data. The\ngenerated Scene Graphs can already provide insights for the clinician, but are\nalso valuable for all downstream tasks as a compact and interpretable\nrepresentation.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Mdod8u3Eduuztdeuya95m2s5JGZ9rrceoikYQnvS94o","pdfSize":"2511774","objectId":"0xbd2c989a480d863f02010428440cac9eb577f1c1a221342c46c6c6cbb3e2c35a","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
