{"id":"2407.06253","title":"Unsupervised machine learning for detecting mutual independence among\n  eigenstate regimes in interacting quasiperiodic chains","authors":"Colin Beveridge, Kathleen Hart, Cassio Rodrigo Cristani, Xiao Li,\n  Enrico Barbierato, Yi-Ting Hsu","authorsParsed":[["Beveridge","Colin",""],["Hart","Kathleen",""],["Cristani","Cassio Rodrigo",""],["Li","Xiao",""],["Barbierato","Enrico",""],["Hsu","Yi-Ting",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 18:00:00 GMT"},{"version":"v2","created":"Mon, 9 Sep 2024 02:01:28 GMT"}],"updateDate":"2024-09-10","timestamp":1720461600000,"abstract":"  Many-body eigenstates that are neither thermal nor many-body-localized (MBL)\nwere numerically found in certain interacting chains with moderate\nquasiperiodic potentials. The energy regime consisting of these non-ergodic but\nextended (NEE) eigenstates has been extensively studied for being a possible\nmany-body mobility edge between the energy-resolved MBL and thermal phases.\nRecently, the NEE regime was further proposed to be a prethermal phenomenon\nthat generally occurs when different operators spread at sizably different\ntimescales. Here, we numerically examine the mutual independence among the NEE,\nMBL, and thermal regimes in the lens of eigenstate entanglement spectra (ES).\nGiven the complexity and rich information embedded in ES, we develop an\nunsupervised learning approach that is designed to quantify the mutual\nindependence among general phases. Our method is first demonstrated on an\nillustrative toy example that uses RGB color data to represent phases, then\napplied to the ES of an interacting generalized Aubry Andre model from weak to\nstrong potential strength. We find that while the MBL and thermal regimes are\nmutually independent, the NEE regime is dependent on the former two and\nsmoothly appears as the potential strength decreases. We attribute our\nnumerically finding to the fact that the ES data in the NEE regime exhibits\nboth an MBL-like fast decay and a thermal-like long tail.\n","subjects":["Condensed Matter/Disordered Systems and Neural Networks","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"jyyEGrcQj7FQFjj8smyb1uQUfOYQDgYnQ2JtI78lcbc","pdfSize":"5274345"}