{"id":"2407.01773","title":"An Image-Based Search for Pulsar Candidates in the MeerKAT Bulge Survey","authors":"Dale A. Frail, Emil Polisensky, Scott D. Hyman, W. M. Cotton, Namir E.\n  Kassim, Michele L. Silverstein, Rahul Sengar, David L. Kaplan, Francesca\n  Calore, Joanna Berteaud, Maica Clavel, Marisa Geyer, Samuel Legodi, Vasaant\n  Krishnan, Sarah Buchner, and Fernando Camilo","authorsParsed":[["Frail","Dale A.",""],["Polisensky","Emil",""],["Hyman","Scott D.",""],["Cotton","W. M.",""],["Kassim","Namir E.",""],["Silverstein","Michele L.",""],["Sengar","Rahul",""],["Kaplan","David L.",""],["Calore","Francesca",""],["Berteaud","Joanna",""],["Clavel","Maica",""],["Geyer","Marisa",""],["Legodi","Samuel",""],["Krishnan","Vasaant",""],["Buchner","Sarah",""],["Camilo","Fernando",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 20:04:56 GMT"}],"updateDate":"2024-07-03","timestamp":1719864296000,"abstract":"  We report on the results of an image-based search for pulsar candidates\ntoward the Galactic bulge. We used mosaic images from the MeerKAT radio\ntelescope, that were taken as part of a 173 deg**2 survey of the bulge and\nGalactic center of our Galaxy at L band (856-1712 MHz) in all four Stokes I, Q,\nU and V. The image root-mean-square noise levels of 12-17 uJy/ba represent a\nsignificant increase in sensitivity over past image-based pulsar searches. Our\nprimary search criterion was circular polarization, but we used other criteria\nincluding linear polarization, in-band spectral index, compactness, variability\nand multi-wavelength counterparts to select pulsar candidates. We first\ndemonstrate the efficacy of this technique by searching for polarized emission\nfrom known pulsars, and comparing our results with measurements from the\nliterature. Our search resulted in a sample of 75 polarized pulsar candidates.\nBright stars or young stellar objects were associated with 28 of these sources,\nincluding a small sample of highly polarized dwarf stars with pulsar-like steep\nspectra. Comparing the properties of this sample with the known pulsars, we\nidentified 30 compelling candidates for pulsation follow-up, including two\nsources with both strong circular and linear polarization. The remaining 17\nsources are either pulsars or stars, but we cannot rule out an extragalactic\norigin or image artifacts among the brighter, flat spectrum objects.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_MAoYmpLshwa_zakPHav0dum9ymop8OBJSRrrOhR_AU","pdfSize":"9208968"}