{"id":"2407.15490","title":"Rb2Ti2O5 : a layered ionic conductor at the sub-micrometer scale","authors":"Valerio Digiorgio, Karen Sobnath, Maria Luisa Della Rocca, Cl\\'ement\n  Barraud, R\\'emi Federicci, Armel Descamps-Mandine, Brigitte Leridon","authorsParsed":[["Digiorgio","Valerio",""],["Sobnath","Karen",""],["Della Rocca","Maria Luisa",""],["Barraud","Clément",""],["Federicci","Rémi",""],["Descamps-Mandine","Armel",""],["Leridon","Brigitte",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 09:18:06 GMT"}],"updateDate":"2024-07-23","timestamp":1721639886000,"abstract":"  Over the past few years, ionic conductors have gained a lot of attention\ngiven the possibility to implement them in various applications such as\nsupercapacitors, batteries or fuel cells as well as for resistive memories.\nEspecially, layered two-dimensional (2D) crystals such as h-BN, graphene oxide\nand MoSe2 have shown to provide unique properties originating from the specific\n2D confinement of moving ions. Two important parameters are the ion\nconductivity and the chemical stability over a wide range of operating\nconditions. In this vein, Rb2Ti2O5 has been recently found displaying\nremarkable properties such as superionic conduction and colossal equivalent\ndielectric constant. Here, a first approach to the study of the electrical\nproperties of layered Rb2Ti2O5 at the 100-nanometer scale is presented.\nCharacterizations by means of micro-Raman spectroscopy and atomic force\nmicroscope (AFM) measurements of mechanically exfoliated RTO nanocrystals via\nthe so-called adhesive-tape technique are reported. Finally, the results of\nelectrical measurements performed on an exfoliated RTO nanocrystals are\npresented, and are found to be consistent with the results obtained on\nmacroscopic crystals. 4\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"gkrbkHseML3trNJ2-cIqgGZTkk6ALqUquF6m6cBrAkQ","pdfSize":"5861550"}