{"id":"2407.14188","title":"TaGAT: Topology-Aware Graph Attention Network For Multi-modal Retinal\n  Image Fusion","authors":"Xin Tian, Nantheera Anantrasirichai, Lindsay Nicholson, Alin Achim","authorsParsed":[["Tian","Xin",""],["Anantrasirichai","Nantheera",""],["Nicholson","Lindsay",""],["Achim","Alin",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 10:32:06 GMT"}],"updateDate":"2024-07-22","timestamp":1721385126000,"abstract":"  In the realm of medical image fusion, integrating information from various\nmodalities is crucial for improving diagnostics and treatment planning,\nespecially in retinal health, where the important features exhibit differently\nin different imaging modalities. Existing deep learning-based approaches\ninsufficiently focus on retinal image fusion, and thus fail to preserve enough\nanatomical structure and fine vessel details in retinal image fusion. To\naddress this, we propose the Topology-Aware Graph Attention Network (TaGAT) for\nmulti-modal retinal image fusion, leveraging a novel Topology-Aware Encoder\n(TAE) with Graph Attention Networks (GAT) to effectively enhance spatial\nfeatures with retinal vasculature's graph topology across modalities. The TAE\nencodes the base and detail features, extracted via a Long-short Range (LSR)\nencoder from retinal images, into the graph extracted from the retinal vessel.\nWithin the TAE, the GAT-based Graph Information Update (GIU) block dynamically\nrefines and aggregates the node features to generate topology-aware graph\nfeatures. The updated graph features with base and detail features are combined\nand decoded as a fused image. Our model outperforms state-of-the-art methods in\nFluorescein Fundus Angiography (FFA) with Color Fundus (CF) and Optical\nCoherence Tomography (OCT) with confocal microscopy retinal image fusion. The\nsource code can be accessed via https://github.com/xintian-99/TaGAT.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"FF32tzVx0UDe67O42X6-DO760nBosRaK2Ua-Ei9AV80","pdfSize":"1266142"}