{"id":"2407.05278","title":"HyperKAN: Kolmogorov-Arnold Networks make Hyperspectral Image\n  Classificators Smarter","authors":"Valeriy Lobanov, Nikita Firsov, Evgeny Myasnikov, Roman Khabibullin\n  and Artem Nikonorov","authorsParsed":[["Lobanov","Valeriy",""],["Firsov","Nikita",""],["Myasnikov","Evgeny",""],["Khabibullin","Roman",""],["Nikonorov","Artem",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 06:36:09 GMT"},{"version":"v2","created":"Wed, 7 Aug 2024 11:33:21 GMT"},{"version":"v3","created":"Fri, 6 Sep 2024 05:56:39 GMT"}],"updateDate":"2024-09-09","timestamp":1720334169000,"abstract":"  In traditional neural network architectures, a multilayer perceptron (MLP) is\ntypically employed as a classification block following the feature extraction\nstage. However, the Kolmogorov-Arnold Network (KAN) presents a promising\nalternative to MLP, offering the potential to enhance prediction accuracy. In\nthis paper, we propose the replacement of linear and convolutional layers of\ntraditional networks with KAN-based counterparts. These modifications allowed\nus to significantly increase the per-pixel classification accuracy for\nhyperspectral remote-sensing images. We modified seven different neural network\narchitectures for hyperspectral image classification and observed a substantial\nimprovement in the classification accuracy across all the networks. The\narchitectures considered in the paper include baseline MLP, state-of-the-art 1D\n(1DCNN) and 3D convolutional (two different 3DCNN, NM3DCNN), and transformer\n(SSFTT) architectures, as well as newly proposed M1DCNN. The greatest effect\nwas achieved for convolutional networks working exclusively on spectral data,\nand the best classification quality was achieved using a KAN-based transformer\narchitecture. All the experiments were conducted using seven openly available\nhyperspectral datasets. Our code is available at\nhttps://github.com/f-neumann77/HyperKAN.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"IaSasqP9sXjVGQVTGIwGzcdf0lUvEPAjkEBHtwh7xKY","pdfSize":"949132"}