{"id":"2407.11164","title":"Seiberg-Witten curves of $\\widehat{D}$-type Little Strings","authors":"Baptiste Filoche, Stefan Hohenegger and Taro Kimura","authorsParsed":[["Filoche","Baptiste",""],["Hohenegger","Stefan",""],["Kimura","Taro",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 18:37:37 GMT"}],"updateDate":"2024-07-17","timestamp":1721068657000,"abstract":"  Little Strings are a type of non-gravitational quantum theories that contain\nextended degrees of freedom, but behave like ordinary Quantum Field Theories at\nlow energies. A particular class of such theories in six dimensions is\nengineered as the world-volume theory of an M5-brane on a circle that probes a\ntransverse orbifold geometry. Its low energy limit is a supersymmetric gauge\ntheory that is described by a quiver in the shape of the Dynkin diagram of the\naffine extension of an ADE-group. While the so-called $\\widehat{A}$-type Little\nString Theories (LSTs) are very well studied, much less is known about the\n$\\widehat{D}$-type, where for example the Seiberg-Witten curve (SWC) is only\nknown in the case of the $\\widehat{D}_4$ theory. In this work, we provide a\ngeneral construction of this curve for arbitrary $\\widehat{D}_{M}$ that\nrespects all symmetries and dualities of the LST and is compatible with\nlower-dimensional results in the literature. For $M=4$ our construction\nreproduces the same curve as previously obtained by other methods. The form in\nwhich we cast the SWC for generic $\\widehat{D}_M$ allows to study the behaviour\nof the LST under modular transformations and provides insights into a dual\nformulation as a circular quiver gauge theory with nodes of $Sp(M-4)$ and\n$SO(2M)$.\n","subjects":["Physics/High Energy Physics - Theory","Physics/Mathematical Physics","Mathematics/Mathematical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"dd-xqi-0dBUSblNIbAKSMA2OnYXvxmfffkQiJLJOgFc","pdfSize":"466449","objectId":"0xfc9fb22d3a80bb26392782148a9809b2e726d30429e409a354495bc8c5e14f62","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
