{"id":"2407.02605","title":"Exact Quantum Fisher Matrix Results for Distributed Phases Using\n  Multiphoton Polarization Greenberger Horne Zeilinger States","authors":"Jiaxuan Wang and Girish Agarwal","authorsParsed":[["Wang","Jiaxuan",""],["Agarwal","Girish",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 18:44:25 GMT"},{"version":"v2","created":"Mon, 9 Sep 2024 00:06:38 GMT"}],"updateDate":"2024-09-10","timestamp":1719945865000,"abstract":"  In recent times, distributed sensing has been extensively studied using\nsqueezed states. While this is an excellent development, it is desirable to\ninvestigate the use of other quantum probes, such as entangled states of light.\nIn this study, we focus on distributed sensing, i.e., estimating multiple\nunknown phases at different spatial nodes using multiphoton\npolarization-entangled Greenberger Horne Zeilinger (GHZ) states distributed\nacross different nodes.We utilize tools of quantum metrology and calculate the\nquantum Fisher information matrix (QFIM). However, the QFIM turns out to be\nsingular, hindering the determination of quantum Cramer-Rao bounds for the\nparameters of interest. Recent experiments have contended with a weaker form of\nthe Cram\\'er-Rao bound, which does not require the inversion of the QFIM. It is\ndesirable to understand how relevant these weaker bounds are and how closely\nthey approach the exact Cramer-Rao bounds. We thus analyze the reason for this\nsingularity and, by removing a redundant phase, obtain a nonsingular QFIM,\nallowing us to derive exact quantum Cramer-Rao bounds. Using the nonsingular\nQFIM, we show that the arithmetic average of the distributed phases is\nHeisenberg-limited. We demonstrate that the quantum metrological bounds can be\nsaturated by projective measurements, enabling us to determine the Fisher\ninformation matrix (FIM), which is also singular. We then show how this\nsingularity can be resolved.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"BVzoJzGdLBWtMU2_EPa1WnAAPciyIg256rXLnZQFjAo","pdfSize":"313382"}