{"id":"2407.10408","title":"Latency Minimization for IRS-enhanced Wideband MEC Networks with\n  Practical Reflection Model","authors":"N. Li, W. Hao, X. Li, Z. Zhu, Z. Tang, S. Yang","authorsParsed":[["Li","N.",""],["Hao","W.",""],["Li","X.",""],["Zhu","Z.",""],["Tang","Z.",""],["Yang","S.",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 03:00:12 GMT"}],"updateDate":"2024-07-16","timestamp":1721012412000,"abstract":"  Intelligent reflecting surface (IRS) has been considered as an efficient way\nto boost the computation capability of mobile edge computing (MEC) system,\nespecially when the communication links is blocked or the communication signal\nis weak. However, most existing works are restricted to narrow-band channel and\nideal IRS reflection model, which is not practical and may lead to significant\nperformance degradation in realistic systems. To further exploit the benefits\nof IRS in MEC system, we consider an IRS-enhanced wideband MEC system with\npractical IRS reflection model. With the aim of minimizing the weighted latency\nof all devices, the offloading data volume, edge computing resource, BS's\nreceiving vector, and IRS passive beamforming are jointly optimized. Since the\nformulated problem is non-convex, we employ the block coordinate descent (BCD)\ntechnique to decouple it into two subproblems for alternatively optimizing\ncomputing and communication settings. The effectiveness and convergence of the\nproposed algorithm are validate via numerical analyses. In addition, simulation\nresults demonstrate that the proposed algorithm can achieve lower latency\ncompared to that based on the ideal IRS reflection model, which confirms the\nnecessary of considering practical model when designing an IRS-enhanced\nwideband MEC system.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"FgDVA8a8FxzJP_IPgUDEC01sfcQVhFSiHKVa3g1Uh48","pdfSize":"872866","objectId":"0x028dbe90fb798b893692463f7b73316a62b19d2f53496d2bff23c63f809883d9","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
