{"id":"2407.00959","title":"Tokenize the World into Object-level Knowledge to Address Long-tail\n  Events in Autonomous Driving","authors":"Ran Tian, Boyi Li, Xinshuo Weng, Yuxiao Chen, Edward Schmerling, Yue\n  Wang, Boris Ivanovic, and Marco Pavone","authorsParsed":[["Tian","Ran",""],["Li","Boyi",""],["Weng","Xinshuo",""],["Chen","Yuxiao",""],["Schmerling","Edward",""],["Wang","Yue",""],["Ivanovic","Boris",""],["Pavone","Marco",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 04:34:50 GMT"}],"updateDate":"2024-07-02","timestamp":1719808490000,"abstract":"  The autonomous driving industry is increasingly adopting end-to-end learning\nfrom sensory inputs to minimize human biases in system design. Traditional\nend-to-end driving models, however, suffer from long-tail events due to rare or\nunseen inputs within their training distributions. To address this, we propose\nTOKEN, a novel Multi-Modal Large Language Model (MM-LLM) that tokenizes the\nworld into object-level knowledge, enabling better utilization of LLM's\nreasoning capabilities to enhance autonomous vehicle planning in long-tail\nscenarios. TOKEN effectively alleviates data scarcity and inefficient\ntokenization by leveraging a traditional end-to-end driving model to produce\ncondensed and semantically enriched representations of the scene, which are\noptimized for LLM planning compatibility through deliberate representation and\nreasoning alignment training stages. Our results demonstrate that TOKEN excels\nin grounding, reasoning, and planning capabilities, outperforming existing\nframeworks with a 27% reduction in trajectory L2 error and a 39% decrease in\ncollision rates in long-tail scenarios. Additionally, our work highlights the\nimportance of representation alignment and structured reasoning in sparking the\ncommon-sense reasoning capabilities of MM-LLMs for effective planning.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"PCtYGmsuNqCw9S6IQ3ZHW1U4ZSOgjLkEhzHt1tKuKM0","pdfSize":"13294104"}