{"id":"2407.04527","title":"Superballistic conduction in hydrodynamic antidot graphene superlattices","authors":"Jorge Estrada-\\'Alvarez, Juan Salvador-S\\'anchez, Ana\n  P\\'erez-Rodr\\'iguez, Carlos S\\'anchez-S\\'anchez, Vito Cleric\\`o, Daniel\n  Vaquero, Kenji Watanabe, Takashi Taniguchi, Enrique Diez, Francisco\n  Dom\\'inguez-Adame, Mario Amado, Elena D\\'iaz","authorsParsed":[["Estrada-Álvarez","Jorge",""],["Salvador-Sánchez","Juan",""],["Pérez-Rodríguez","Ana",""],["Sánchez-Sánchez","Carlos",""],["Clericò","Vito",""],["Vaquero","Daniel",""],["Watanabe","Kenji",""],["Taniguchi","Takashi",""],["Diez","Enrique",""],["Domínguez-Adame","Francisco",""],["Amado","Mario",""],["Díaz","Elena",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 14:15:20 GMT"}],"updateDate":"2024-07-08","timestamp":1720188920000,"abstract":"  Viscous electron flow exhibits exotic signatures such as superballistic\nconduction. Bending the geometry of the device is a must to observe\nhydrodynamic effects. To this end, we build three antidot graphene\nsuperlattices with different hole diameters. We measure their electrical\nproperties at various temperatures and under the effect of a perpendicular\nmagnetic field. We find an enhanced superballistic effect, suggesting the\neffectiveness of the geometry at bending the electron flow. In addition,\nsuperballistic conduction behaves non-monotonically with the magnetic field,\nwhich is related with the ballistic-hydrodynamic transition. We also analyze\nthe device resistance as a function of the size of the antidot superlattice to\nfind characteristic scaling laws describing the different transport regimes. We\nprove that the antidot superlattice is a convenient geometry for realizing\nhydrodynamic flow, and the experiment provides valuable explanations for the\ntechnologically relevant effects of superballistic conduction and scaling laws.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"pnXz2rFCIWSsvG_vk90A9bXpHh0_ra_CipE8V_nLvIo","pdfSize":"15758117"}
