{"id":"2407.01329","title":"Nonparametric signal separation in very-high-energy gamma ray\n  observations with probabilistic neural networks","authors":"Marion Ullmo, Emmanuel Moulin","authorsParsed":[["Ullmo","Marion",""],["Moulin","Emmanuel",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 14:35:53 GMT"}],"updateDate":"2024-07-02","timestamp":1719844553000,"abstract":"  An intriguing challenge in observational astronomy is the separation signals\nin areas where multiple signals intersect. A typical instance of this in\nvery-high-energy (VHE, E$\\gtrsim$100 GeV) gamma-ray astronomy is the issue of\nresidual background in observations. This background arises when cosmic-ray\nprotons are mistakenly identified as gamma-rays from sources of interest,\nthereby blending with signals from astrophysical sources of interest. We\nintroduce a deep ensemble approach to determine a non-parametric estimation of\nsource and background signals in VHE gamma observations, as well as a\nlikelihood-derived epistemic uncertainty on these estimations. We rely on\nminimal assumptions, exploiting the separability of space and energy components\nin the signals, and defining a small region in coordinate space where the\nsource signal is assumed to be negligible compared to background signal. The\nmodel is applied both on mock observations, including a simple toy case and a\nrealistic simulation of dark matter annihilation in the Galactic center, as\nwell as true observations from the public H.E.S.S. data release, specifically\ndatasets of the Crab nebula and the pulsar wind nebula MSH 15-52. Our method\nperforms well in mock cases, where the ground truth is known, and compares\nfavorably against conventional physical analysis approaches when applied to\ntrue observations. In the case of the mock dark matter signal in the Galactic\ncenter, our work opens new avenues for component separation in this complex\nregion of the VHE sky.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"lZAyOesDvSidiNxIz7HPAuxE_tanDDKnW_ttZQq3fNk","pdfSize":"2459855"}