{"id":"2407.04342","title":"A $\\frac{4}{3}$-Approximation for the Maximum Leaf Spanning Arborescence\n  Problem in DAGs","authors":"Meike Neuwohner","authorsParsed":[["Neuwohner","Meike",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 08:33:52 GMT"}],"updateDate":"2024-07-08","timestamp":1720168432000,"abstract":"  The Maximum Leaf Spanning Arborescence problem (MLSA) is defined as follows:\nGiven a directed graph $G$ and a vertex $r\\in V(G)$ from which every other\nvertex is reachable, find a spanning arborescence rooted at $r$ maximizing the\nnumber of leaves (vertices with out-degree zero). The MLSA has applications in\nbroadcasting, where a message needs to be transferred from a source vertex to\nall other vertices along the arcs of an arborescence in a given network. In\ndoing so, it is desirable to have as many vertices as possible that only need\nto receive, but not pass on messages since they are inherently cheaper to\nbuild.\n  We study polynomial-time approximation algorithms for the MLSA. For general\ndigraphs, the state-of-the-art is a\n$\\min\\{\\sqrt{\\mathrm{OPT}},92\\}$-approximation. In the (still APX-hard) special\ncase where the input graph is acyclic, the best known approximation guarantee\nof $\\frac{7}{5}$ is due to Fernandes and Lintzmayer: They prove that any\n$\\alpha$-approximation for the \\emph{hereditary $3$-set packing problem}, a\nspecial case of weighted $3$-set packing, yields a\n$\\max\\{\\frac{4}{3},\\alpha\\}$-approximation for the MLSA in acyclic digraphs\n(dags), and provide a $\\frac{7}{5}$-approximation for the hereditary $3$-set\npacking problem. In this paper, we obtain a $\\frac{4}{3}$-approximation for the\nhereditary $3$-set packing problem, and, thus, also for the MLSA in dags. In\ndoing so, we manage to leverage the full potential of the reduction provided by\nFernandes and Lintzmayer. The algorithm that we study is a simple local search\nprocedure considering swaps of size up to $10$. Its analysis relies on a\ntwo-stage charging argument.\n","subjects":["Computing Research Repository/Data Structures and Algorithms"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"uDdC3z32yOzUVI4dfydaI_NdTSgZcZ0BkIAe8kYIiWg","pdfSize":"357684"}
