{"id":"2407.09996","title":"Quenching of Tearing Mode Instability by Transverse Magnetic Fields in\n  Reconnection Current Sheets","authors":"Grzegorz Kowal and Diego A. Falceta-Gon\\c{c}alves","authorsParsed":[["Kowal","Grzegorz",""],["Falceta-Gonçalves","Diego A.",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 20:33:03 GMT"}],"updateDate":"2024-07-16","timestamp":1720902783000,"abstract":"  The tearing mode instability is a key process for magnetic energy conversion\nin magnetohydrodynamics, once anti-parallel components are allowed to\nreconnect, leading to the formation of magnetic islands. It has been employed\nto explain phenomena at different scales in nature, from galactic nuclei, to\nsolar flares and laboratory fusion devices. In this study, we investigate the\ndynamics of a current sheet in the presence of a transverse magnetic field\ncomponent, in the framework of viscoresistive, incompressible\nmagnetohydrodynamics (MHD), both analytically and by means of direct numerical\nsimulations. Firstly, we obtain analytical solution for the time-varying\none-dimensional profile of an initial Harris current sheet in the presence of a\ntransverse field. We find that the introduction of a transverse magnetic field\ndisrupts the system's equilibrium, leading to the natural development of a\nneutral layer with shear flows within the current sheet, one along the\nantiparallel magnetic component and another along the guide field direction.\nSecondly, through numerical analysis, we examine the dispersion relation of the\nincompressible MHD equations in the context of a modified equilibrium profile\ndue to the transverse field. Our findings indicate a rapid suppression of\nunstable modes of tearing instability with the width of the neutral layer,\nconfirming the analytical predictions. These results offer new insightful\nunderstanding on the interplay between transverse magnetic fields, shear flows,\nand tearing mode instabilities in current sheet environments.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Physics/Plasma Physics","Physics/Space Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"j_uynA-HnQZdEeGyyRJuD-Xm6-yBTOHGAcX2QTTytKY","pdfSize":"2002507"}