{"id":"2407.07141","title":"Nuclear Spin Metrology with Nitrogen Vacancy Center in Diamond for Axion\n  Dark Matter Detection","authors":"So Chigusa, Masashi Hazumi, Ernst David Herbschleb, Yuichiro\n  Matsuzaki, Norikazu Mizuochi, Kazunori Nakayama","authorsParsed":[["Chigusa","So",""],["Hazumi","Masashi",""],["Herbschleb","Ernst David",""],["Matsuzaki","Yuichiro",""],["Mizuochi","Norikazu",""],["Nakayama","Kazunori",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 18:00:00 GMT"}],"updateDate":"2024-07-11","timestamp":1720548000000,"abstract":"  We present a method to directly detect the axion dark matter using nitrogen\nvacancy centers in diamonds. In particular, we use metrology leveraging the\nnuclear spin of nitrogen to detect axion-nucleus couplings. This is achieved\nthrough protocols designed for dark matter searches, which introduce a novel\napproach of quantum sensing techniques based on the nitrogen vacancy center.\nAlthough the coupling strength of the magnetic fields with nuclear spins is\nthree orders of magnitude smaller than that with electron spins for\nconventional magnetometry, the axion interaction strength with nuclear spins is\nthe same order of magnitude as that with electron spins. Furthermore, we can\ntake advantage of the long coherence time by using the nuclear spins for the\naxion dark matter detection. We show that our method is sensitive to a broad\nfrequency range $\\lesssim 100\\,\\mathrm{Hz}$ corresponding to the axion mass\n$m_a \\lesssim 4\\times 10^{-13}\\,\\mathrm{eV}$. We present the detection limit of\nour method for both the axion-neutron and the axion-proton couplings and\ndiscuss its significance in comparison with other proposed ideas.\n","subjects":["Physics/High Energy Physics - Phenomenology","Condensed Matter/Mesoscale and Nanoscale Physics","Physics/High Energy Physics - Experiment","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"fSsxs2yr4_HDEpnwHZLgyt9j0V4EL197grjPNLELpXE","pdfSize":"1635519"}