{"id":"2407.05595","title":"Cognitive Process during Palpation and Basic Concept of Remote Palpation\n  System","authors":"Matti Itkonen, Shotaro Okajima, Sayako Ueda, Alvaro Costa-Garcia, Yang\n  Ningjia, Tadatoshi Kurogi, Takeshi Fujiwara, Shigeru Kurimoto, Shintaro\n  Oyama, Masaomi Saeki, Michiro Yamamoto, Hidemasa Yoneda, Hitoshi Hirata, and\n  Shingo Shimoda","authorsParsed":[["Itkonen","Matti",""],["Okajima","Shotaro",""],["Ueda","Sayako",""],["Costa-Garcia","Alvaro",""],["Ningjia","Yang",""],["Kurogi","Tadatoshi",""],["Fujiwara","Takeshi",""],["Kurimoto","Shigeru",""],["Oyama","Shintaro",""],["Saeki","Masaomi",""],["Yamamoto","Michiro",""],["Yoneda","Hidemasa",""],["Hirata","Hitoshi",""],["Shimoda","Shingo",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 04:16:11 GMT"}],"updateDate":"2024-07-09","timestamp":1720412171000,"abstract":"  This paper will examine the cognitive processes involved in palpation in\norder to develop an appropriate remote palpation system. In a conventional\nremote palpation system, the tactile condition of the patient is conveyed to\nthe doctors using a force feedback system. A clarification of the cognitive\nprocess during palpation suggests that the purpose of palpation is to formulate\na clear idea about the patient's medical problems using the tactile sensation\nas a trigger to combine the results of other assessments, past experience and\nmemory, and patient reactions to the doctor's touch. This is in contrast to the\nobjective of acquiring the detailed tactile condition of the affected body\npart. In order to demonstrate this purpose, we will describe the two\nsignificant signal pathways for the perception of tactile sensation, both in\ndoctors and patients. The perception of doctors progresses as the result of\nactive touch to the affected part, thereby implying that the simultaneous\nstimulation of kinaesthetic and tactile sensation is necessary. Conversely, the\ntactile sensation experienced by patients is the result of passive touch, which\nevokes a more subjective and emotional response. Patients both explicitly and\nimplicitly perceive the stimulation, and doctors use these perceptions as\nreactions of the pain to the doctors' touch. This paper proposes the\nfundamental concept of a remote palpation system, ``Palpation Reality beyond\nReal'', to achieve the purpose of palpation. Palpation reality implies a system\nin which the whole cognitive process progresses at the same level or better\nthan palpation in the standard examination, rather than presenting the real\ntactile sensation.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"eH1RLGkgaWU5e7DwnzjZ3fqotfCK5SYKmH-kVo8XbLA","pdfSize":"1069481"}