{"id":"2407.14277","title":"Patch-based Intuitive Multimodal Prototypes Network (PIMPNet) for\n  Alzheimer's Disease classification","authors":"Lisa Anita De Santi, J\\\"org Schl\\\"otterer, Meike Nauta, Vincenzo\n  Positano, Christin Seifert","authorsParsed":[["De Santi","Lisa Anita",""],["Schlötterer","Jörg",""],["Nauta","Meike",""],["Positano","Vincenzo",""],["Seifert","Christin",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 12:58:18 GMT"},{"version":"v2","created":"Mon, 22 Jul 2024 15:02:24 GMT"}],"updateDate":"2024-07-23","timestamp":1721393898000,"abstract":"  Volumetric neuroimaging examinations like structural Magnetic Resonance\nImaging (sMRI) are routinely applied to support the clinical diagnosis of\ndementia like Alzheimer's Disease (AD). Neuroradiologists examine 3D sMRI to\ndetect and monitor abnormalities in brain morphology due to AD, like global\nand/or local brain atrophy and shape alteration of characteristic structures.\nThere is a strong research interest in developing diagnostic systems based on\nDeep Learning (DL) models to analyse sMRI for AD. However, anatomical\ninformation extracted from an sMRI examination needs to be interpreted together\nwith patient's age to distinguish AD patterns from the regular alteration due\nto a normal ageing process. In this context, part-prototype neural networks\nintegrate the computational advantages of DL in an interpretable-by-design\narchitecture and showed promising results in medical imaging applications. We\npresent PIMPNet, the first interpretable multimodal model for 3D images and\ndemographics applied to the binary classification of AD from 3D sMRI and\npatient's age. Despite age prototypes do not improve predictive performance\ncompared to the single modality model, this lays the foundation for future work\nin the direction of the model's design and multimodal prototype training\nprocess\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"KXA1CPghqM3ss47fPWoJFGVH13LCB_skXlBfMIqYC7c","pdfSize":"1200304"}