{"id":"2407.12318","title":"Information Compression in Dynamic Games","authors":"Dengwang Tang, Vijay Subramanian, Demosthenis Teneketzis","authorsParsed":[["Tang","Dengwang",""],["Subramanian","Vijay",""],["Teneketzis","Demosthenis",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 05:08:47 GMT"}],"updateDate":"2024-07-18","timestamp":1721192927000,"abstract":"  One of the reasons why stochastic dynamic games with an underlying dynamic\nsystem are challenging is since strategic players have access to enormous\namount of information which leads to the use of extremely complex strategies at\nequilibrium. One approach to resolve this challenge is to simplify players'\nstrategies by identifying appropriate compression of information maps so that\nthe players can make decisions solely based on the compressed version of\ninformation, called the information state. For finite dynamic games with\nasymmetric information, inspired by the notion of information state for\nsingle-agent control problems, we propose two notions of information states,\nnamely mutually sufficient information (MSI) and unilaterally sufficient\ninformation (USI). Both these information states are obtained with information\ncompression maps independent of the strategy profile. We show that Bayes-Nash\nEquilibria (BNE) and Sequential Equilibria (SE) exist when all players use\nMSI-based strategies. We prove that when all players employ USI-based\nstrategies the resulting sets of BNE and SE payoff profiles are the same as the\nsets of BNE and SE payoff profiles resulting when all players use full\ninformation-based strategies. We prove that when all players use USI-based\nstrategies the resulting set of weak Perfect Bayesian Equilibrium (wPBE) payoff\nprofiles can be a proper subset of all wPBE payoff profiles. We identify MSI\nand USI in specific models of dynamic games in the literature. We end by\npresenting an open problem: Do there exist strategy-dependent information\ncompression maps that guarantee the existence of at least one equilibrium or\nmaintain all equilibria that exist under perfect recall? We show, by a\ncounterexample, that a well-known strategy-dependent information compression\nmap used in the literature does not possess any of the properties of MSI or\nUSI.\n","subjects":["Computing Research Repository/Computer Science and Game Theory","Computing Research Repository/Multiagent Systems","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control","Mathematics/Optimization and Control","Mathematics/Statistics Theory","Statistics/Statistics Theory"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"j1id_gopOL-q12eTcJ2xUzH7q2RbG5gxPrzZPqineBU","pdfSize":"640840","objectId":"0x2de0a0133a47a3d5b2982bf67d4197aed59a9266bd94ec7602a3f7fe5c5994dc","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
