{"id":"2407.06250","title":"FairDiff: Fair Segmentation with Point-Image Diffusion","authors":"Wenyi Li, Haoran Xu, Guiyu Zhang, Huan-ang Gao, Mingju Gao, Mengyu\n  Wang, Hao Zhao","authorsParsed":[["Li","Wenyi",""],["Xu","Haoran",""],["Zhang","Guiyu",""],["Gao","Huan-ang",""],["Gao","Mingju",""],["Wang","Mengyu",""],["Zhao","Hao",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 17:59:58 GMT"}],"updateDate":"2024-07-10","timestamp":1720461598000,"abstract":"  Fairness is an important topic for medical image analysis, driven by the\nchallenge of unbalanced training data among diverse target groups and the\nsocietal demand for equitable medical quality. In response to this issue, our\nresearch adopts a data-driven strategy-enhancing data balance by integrating\nsynthetic images. However, in terms of generating synthetic images, previous\nworks either lack paired labels or fail to precisely control the boundaries of\nsynthetic images to be aligned with those labels. To address this, we formulate\nthe problem in a joint optimization manner, in which three networks are\noptimized towards the goal of empirical risk minimization and fairness\nmaximization. On the implementation side, our solution features an innovative\nPoint-Image Diffusion architecture, which leverages 3D point clouds for\nimproved control over mask boundaries through a point-mask-image synthesis\npipeline. This method outperforms significantly existing techniques in\nsynthesizing scanning laser ophthalmoscopy (SLO) fundus images. By combining\nsynthetic data with real data during the training phase using a proposed Equal\nScale approach, our model achieves superior fairness segmentation performance\ncompared to the state-of-the-art fairness learning models. Code is available at\nhttps://github.com/wenyi-li/FairDiff.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"9h7s3MKcIslp7bXno2KnBLZSRfifFDJx9tK3Pn771FU","pdfSize":"1238876"}