{"id":"2407.13050","title":"Decolonial AI as Disenclosure","authors":"W. J. T. Mollema","authorsParsed":[["Mollema","W. J. T.",""]],"versions":[{"version":"v1","created":"Thu, 23 May 2024 09:45:37 GMT"}],"updateDate":"2024-07-19","timestamp":1716457537000,"abstract":"  The development and deployment of machine learning and AI engender 'AI\ncolonialism', a term that conceptually overlaps with 'data colonialism', as a\nform of injustice. AI colonialism is in need of decolonization for three\nreasons. Politically, because it enforces digital capitalism's hegemony.\nEcologically, as it negatively impacts the environment and intensifies the\nextraction of natural resources and consumption of energy. Epistemically, since\nthe social systems within which AI is embedded reinforce Western universalism\nby imposing Western colonial values on the global South when these manifest in\nthe digital realm is a form of digital capitalism. These reasons require a new\nconceptualization of AI decolonization. First this paper draws from the\nhistorical debates on the concepts of colonialism and decolonization. Secondly\nit retrieves Achille Mbembe's notion of decolonization as disenclosure to argue\nthat the decolonization of AI will have to be the abolishment of political,\necological and epistemic borders erected and reinforced in the phases of its\ndesign, production, development of AI in the West and drawing from the\nknowledge from the global South. In conclusion, it is discussed how conceiving\nof decolonial AI as form of disenclosure opens up new ways to think about and\nintervene in colonial instantiations of AI development and deployment, in order\nto empower 'the wretched of AI', re-ecologise the unsustainable ecologies AI\ndepends on and to counter the colonial power structures unreflective AI\ndeployment risks to reinforce.\n","subjects":["Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"-JMApeLCUlifI7lkOFGpiAiwjR_lwLd_atjQwscXOaM","pdfSize":"438999"}