{"id":"2407.05926","title":"Statistical study and parallelisation of multiplexed single-electron\n  sources","authors":"S. Norimoto, P. See, N. Schoinas, I. Rungger, T. O. Boykin II, M. D.\n  Stewart Jr, J. P. Griffiths, C. Chen, D. A. Ritchie, and M. Kataoka","authorsParsed":[["Norimoto","S.",""],["See","P.",""],["Schoinas","N.",""],["Rungger","I.",""],["Boykin","T. O.","II"],["Stewart","M. D.","Jr"],["Griffiths","J. P.",""],["Chen","C.",""],["Ritchie","D. A.",""],["Kataoka","M.",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 13:32:26 GMT"}],"updateDate":"2024-07-09","timestamp":1720445546000,"abstract":"  Increasing electric current from a single-electron source is a main challenge\nin an effort to establish the standard of the ampere defined by the fixed value\nof the elementary charge $e$ and operation frequency $f$. While the current\nscales with $f$, due to an operation frequency limit for maintaining accurate\nsingle-electron transfer, parallelisation of singleelectron sources is expected\nto be a more practical solution to increase the generated electric current $I =\nNef$, where $N$ is a number of parallelised devices. One way to parallelise\nsingle-electron sources without increasing the complexity in device operation\nis to use a common gate. Such a scheme will require each device to have the\nsame operation parameters for single-electron transfer. In order to investigate\nthis possibility, we study the statistics for operation gate voltages using\nsingle-electron sources embedded in a multiplexer circuit. The multiplexer\ncircuit allows us to measure 64 single-electron sources individually in a\nsingle cooldown. We also demonstrate the parallelisation of three\nsingle-electron sources and observe the generated current enhanced by a factor\nof three.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"tR29x-721F9TT1lj5nwoBvlY-qHUJB1P83rmQqsT0jQ","pdfSize":"838916"}