{"id":"2407.20654","title":"Prompting Encoder Models for Zero-Shot Classification: A Cross-Domain\n  Study in Italian","authors":"Serena Auriemma, Martina Miliani, Mauro Madeddu, Alessandro Bondielli,\n  Lucia Passaro, Alessandro Lenci","authorsParsed":[["Auriemma","Serena",""],["Miliani","Martina",""],["Madeddu","Mauro",""],["Bondielli","Alessandro",""],["Passaro","Lucia",""],["Lenci","Alessandro",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 08:50:16 GMT"}],"updateDate":"2024-07-31","timestamp":1722329416000,"abstract":"  Addressing the challenge of limited annotated data in specialized fields and\nlow-resource languages is crucial for the effective use of Language Models\n(LMs). While most Large Language Models (LLMs) are trained on general-purpose\nEnglish corpora, there is a notable gap in models specifically tailored for\nItalian, particularly for technical and bureaucratic jargon. This paper\nexplores the feasibility of employing smaller, domain-specific encoder LMs\nalongside prompting techniques to enhance performance in these specialized\ncontexts. Our study concentrates on the Italian bureaucratic and legal\nlanguage, experimenting with both general-purpose and further pre-trained\nencoder-only models. We evaluated the models on downstream tasks such as\ndocument classification and entity typing and conducted intrinsic evaluations\nusing Pseudo-Log-Likelihood. The results indicate that while further\npre-trained models may show diminished robustness in general knowledge, they\nexhibit superior adaptability for domain-specific tasks, even in a zero-shot\nsetting. Furthermore, the application of calibration techniques and in-domain\nverbalizers significantly enhances the efficacy of encoder models. These\ndomain-specialized models prove to be particularly advantageous in scenarios\nwhere in-domain resources or expertise are scarce. In conclusion, our findings\noffer new insights into the use of Italian models in specialized contexts,\nwhich may have a significant impact on both research and industrial\napplications in the digital transformation era.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"O83m196-p9lKiT9G-otTcusgPQ0Zz3nSETncUaop77o","pdfSize":"568238"}