{"id":"2407.07179","title":"TrackFormers: In Search of Transformer-Based Particle Tracking for the\n  High-Luminosity LHC Era","authors":"Sascha Caron, Nadezhda Dobreva, Antonio Ferrer S\\'anchez, Jos\\'e D.\n  Mart\\'in-Guerrero, Uraz Odyurt, Roberto Ruiz de Austri Bazan, Zef Wolffs, Yue\n  Zhao","authorsParsed":[["Caron","Sascha",""],["Dobreva","Nadezhda",""],["Sánchez","Antonio Ferrer",""],["Martín-Guerrero","José D.",""],["Odyurt","Uraz",""],["Bazan","Roberto Ruiz de Austri",""],["Wolffs","Zef",""],["Zhao","Yue",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 18:47:25 GMT"}],"updateDate":"2024-07-11","timestamp":1720550845000,"abstract":"  High-Energy Physics experiments are facing a multi-fold data increase with\nevery new iteration. This is certainly the case for the upcoming\nHigh-Luminosity LHC upgrade. Such increased data processing requirements forces\nrevisions to almost every step of the data processing pipeline. One such step\nin need of an overhaul is the task of particle track reconstruction, a.k.a.,\ntracking. A Machine Learning-assisted solution is expected to provide\nsignificant improvements, since the most time-consuming step in tracking is the\nassignment of hits to particles or track candidates. This is the topic of this\npaper.\n  We take inspiration from large language models. As such, we consider two\napproaches: the prediction of the next word in a sentence (next hit point in a\ntrack), as well as the one-shot prediction of all hits within an event. In an\nextensive design effort, we have experimented with three models based on the\nTransformer architecture and one model based on the U-Net architecture,\nperforming track association predictions for collision event hit points. In our\nevaluation, we consider a spectrum of simple to complex representations of the\nproblem, eliminating designs with lower metrics early on. We report extensive\nresults, covering both prediction accuracy (score) and computational\nperformance. We have made use of the REDVID simulation framework, as well as\nreductions applied to the TrackML data set, to compose five data sets from\nsimple to complex, for our experiments. The results highlight distinct\nadvantages among different designs in terms of prediction accuracy and\ncomputational performance, demonstrating the efficiency of our methodology.\nMost importantly, the results show the viability of a one-shot\nencoder-classifier based Transformer solution as a practical approach for the\ntask of tracking.\n","subjects":["Physics/High Energy Physics - Experiment","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"5l-vzMkvdpqzsNLGHWL1YFLW7QHpKcTcRb3r3J1JYzA","pdfSize":"1070640"}
