{"id":"2407.01059","title":"Nonequilibrium relaxation of soft responsive colloids","authors":"Jos\\'e L\\'opez-Molina, Sebastien Groh, Joachim Dzubiella and Arturo\n  Moncho-Jord\\'a","authorsParsed":[["López-Molina","José",""],["Groh","Sebastien",""],["Dzubiella","Joachim",""],["Moncho-Jordá","Arturo",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 08:10:48 GMT"}],"updateDate":"2024-07-02","timestamp":1719821448000,"abstract":"  Stimuli-responsive macromolecules display large conformational changes during\ntheir dynamics, sometimes switching states, and are an integral property for\nthe development of soft functional materials. Here, we introduce a mean-field\ndynamical density functional theory (DDFT) for a model of responsive colloids\n(RCs) to study the nonequilibrium dynamics of a colloidal dispersion in\ntime-dependent external fields, with a focus on the coupling of translational\nand conformational dynamics during their relaxation. Specifically, we consider\nsoft Gaussian particles with a bimodal size distribution between two confining\nwalls with time-dependent (switching-on and off) external gravitational and\nosmotic fields. We find a rich relaxation behavior of the systems in excellent\nagreement with particle-based Brownian dynamics (BD) computer simulations. In\nparticular, we find time-asymmetric relaxations of integrated observables (wall\npressures, mean size, liquid center-of-mass) for activation/deactivation of\nexternal potentials, respectively, which are tuneable by the ratio of\ntranslational and conformational diffusion time scales. Our work paves thus the\nway for studying the nonequilibrium relaxation dynamics of complex soft matter\nwith multiple degrees of freedom and hierarchical relaxations.\n","subjects":["Condensed Matter/Soft Condensed Matter"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"l9mSGolYfuE2odRFUS0vuUNJYKRri7I2aTK5Ufx3drw","pdfSize":"1973480","objectId":"0xc490664fdb5b14ee288d60dc2cdd6b87f00f0b94a6463c967c2b26843b4d9888","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
