{"id":"2407.14201","title":"The interstellar medium conditions of a strong Lya emitter at z = 8.279\n  revealed by JWST: a robust LyC leaker candidate at the Epoch of Reionization","authors":"Rafael Navarro-Carrera, Karina I. Caputi, Edoardo Iani, Pierluigi\n  Rinaldi, Vasily Kokorev, Josephine Kerutt","authorsParsed":[["Navarro-Carrera","Rafael",""],["Caputi","Karina I.",""],["Iani","Edoardo",""],["Rinaldi","Pierluigi",""],["Kokorev","Vasily",""],["Kerutt","Josephine",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 10:58:37 GMT"}],"updateDate":"2024-07-22","timestamp":1721386717000,"abstract":"  Making use of JWST NIRSpec and NIRCam data, we conduct a detailed analysis of\nthe spectroscopic and photometric properties of GN-z8-LAE, a strong Lya emitter\nat z=8.279. Our goal is to investigate the interstellar medium (ISM) physical\nconditions that enable the Lya detection in this source at the Epoch of\nReionization (EoR) and scrutinize GN-z8-LAE as an early reionizer. In broad\nagreement with previous results, we find that GN-z8-LAE is a young galaxy (age\n~ 10 Myr) with a low stellar mass (M* ~ 10^7.66 Msun), significantly lower than\nthose of most Lya emitters known at similarly high redshifts. The derived\nstellar mass and star formation rate surface densities are 355 Msun/pc^2 and 88\nMsun/yr/kpc^2, respectively. Our spectral analysis indicates that: the Lya line\npeak has a small velocity offset 133+-72 km/s with respect to the galaxy\nsystemic redshift; CIV] / CIII] ~ 3.3; the ISM is characterized by a hard\nionization field, although no signature of AGN is present. Moreover, we report\nthe presence of NIII]1750 emission with super-solar N abundance, which makes\nGN-z8-LAE one of the first known cases of a simultaneous strong Lya and\nnitrogen emitter at the EoR. Based on all these properties, we apply a wide\nrange of methods to constrain the absolute Lyman continuum escape fraction of\nGN-z8-LAE, and find that it is >14% in all cases. Therefore, we conclude that\nGN-z8-LAE is a robust candidate for a Lyman continuum (LyC) leaker at the EoR\nwhich is being caught at the moment of efficiently reionizing its surrounding\nmedium.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_VXmUjLbSUa6dbRa31h0gVw3A_opvEYUMbs0cWhwlFY","pdfSize":"3029289"}