{"id":"2407.00710","title":"Directly Handling Missing Data in Linear Discriminant Analysis for\n  Enhancing Classification Accuracy and Interpretability","authors":"Tuan L. Vo, Uyen Dang, Thu Nguyen","authorsParsed":[["Vo","Tuan L.",""],["Dang","Uyen",""],["Nguyen","Thu",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 14:21:32 GMT"},{"version":"v2","created":"Mon, 2 Sep 2024 07:01:31 GMT"}],"updateDate":"2024-09-04","timestamp":1719757292000,"abstract":"  As the adoption of Artificial Intelligence (AI) models expands into critical\nreal-world applications, ensuring the explainability of these models becomes\nparamount, particularly in sensitive fields such as medicine and finance.\nLinear Discriminant Analysis (LDA) remains a popular choice for classification\ndue to its interpretable nature, derived from its capacity to model class\ndistributions and enhance class separation through linear combinations of\nfeatures. However, real-world datasets often suffer from incomplete data,\nposing substantial challenges for both classification accuracy and model\ninterpretability. In this paper, we introduce a novel and robust classification\nmethod, termed Weighted missing Linear Discriminant Analysis (WLDA), which\nextends LDA to handle datasets with missing values without the need for\nimputation. Our approach innovatively incorporates a weight matrix that\npenalizes missing entries, thereby refining parameter estimation directly on\nincomplete data. This methodology not only preserves the interpretability of\nLDA but also significantly enhances classification performance in scenarios\nplagued by missing data. We conduct an in-depth theoretical analysis to\nestablish the properties of WLDA and thoroughly evaluate its explainability.\nExperimental results across various datasets demonstrate that WLDA consistently\noutperforms traditional methods, especially in challenging environments where\nmissing values are prevalent in both training and test datasets. This\nadvancement provides a critical tool for improving classification accuracy and\nmaintaining model transparency in the face of incomplete data.\n","subjects":["Computing Research Repository/Machine Learning","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"kjZCx-37NCXjrdSQnpwrf68cAVCUXK7sBlNs_xa4gKU","pdfSize":"1898141"}