{"id":"2407.16472","title":"Sub-milliwatt threshold power and tunable-bias all-optical nonlinear\n  activation function using vanadium dioxide for wavelength-division\n  multiplexing photonic neural networks","authors":"Jorge Parra, Juan Navarro-Arenas, and Pablo Sanchis","authorsParsed":[["Parra","Jorge",""],["Navarro-Arenas","Juan",""],["Sanchis","Pablo",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 13:43:29 GMT"}],"updateDate":"2024-07-24","timestamp":1721742209000,"abstract":"  The increasing demand for efficient hardware in neural computation highlights\nthe limitations of electronic-based systems in terms of speed, energy\nefficiency, and scalability. Wavelength-division multiplexing (WDM) photonic\nneural networks offer a high-bandwidth, low-latency alternative but require\neffective photonic activation functions. Here, we propose a power-efficient and\ntunable-bias all-optical nonlinear activation function using vanadium dioxide\n(VO2) for WDM photonic neural networks. We engineered a SiN/BTO waveguide with\na VO2 patch to exploit the phase-change material's reversible\ninsulator-to-metal transition (IMT) for nonlinear activation. We conducted\nnumerical simulations to optimize the waveguide geometry and VO2 parameters,\nminimizing propagation and coupling losses while achieving a strong nonlinear\nresponse and low-threshold activation power. Our proposed device features a\nsub-milliwatt threshold power, a footprint of 5 $\\mu$m, and an ELU-like\nactivation function. Temporal dynamics show a rise time as low as 5 $\\mu$s.\nMoreover, the bias of our device could be thermally tuned, improving the speed\nand power efficiency. On the other hand, performance evaluations using the\nCIFAR-10 dataset confirmed the device's potential for convolutional neural\nnetworks (CNN). Our results show that a hybrid VO2/SiN/BTO platform could play\na prominent role in the path towards the development of high-performance\nphotonic neural networks.\n","subjects":["Physics/Optics","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"6tSQUGp9lY-zmm5legseR0hzmVsElbXmPQWjRj7pUWg","pdfSize":"3335717","objectId":"0x07c819cfa91d644ecf9f14b8ce4ba00fb9b139c6df35edbedcf1b781f1a4b5ad","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
