{"id":"2407.06187","title":"JeDi: Joint-Image Diffusion Models for Finetuning-Free Personalized\n  Text-to-Image Generation","authors":"Yu Zeng, Vishal M. Patel, Haochen Wang, Xun Huang, Ting-Chun Wang,\n  Ming-Yu Liu, Yogesh Balaji","authorsParsed":[["Zeng","Yu",""],["Patel","Vishal M.",""],["Wang","Haochen",""],["Huang","Xun",""],["Wang","Ting-Chun",""],["Liu","Ming-Yu",""],["Balaji","Yogesh",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 17:59:02 GMT"}],"updateDate":"2024-07-09","timestamp":1720461542000,"abstract":"  Personalized text-to-image generation models enable users to create images\nthat depict their individual possessions in diverse scenes, finding\napplications in various domains. To achieve the personalization capability,\nexisting methods rely on finetuning a text-to-image foundation model on a\nuser's custom dataset, which can be non-trivial for general users,\nresource-intensive, and time-consuming. Despite attempts to develop\nfinetuning-free methods, their generation quality is much lower compared to\ntheir finetuning counterparts. In this paper, we propose Joint-Image Diffusion\n(\\jedi), an effective technique for learning a finetuning-free personalization\nmodel. Our key idea is to learn the joint distribution of multiple related\ntext-image pairs that share a common subject. To facilitate learning, we\npropose a scalable synthetic dataset generation technique. Once trained, our\nmodel enables fast and easy personalization at test time by simply using\nreference images as input during the sampling process. Our approach does not\nrequire any expensive optimization process or additional modules and can\nfaithfully preserve the identity represented by any number of reference images.\nExperimental results show that our model achieves state-of-the-art generation\nquality, both quantitatively and qualitatively, significantly outperforming\nboth the prior finetuning-based and finetuning-free personalization baselines.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Graphics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"D3biOh-cq-E6yGQKw1SUMYdf4AwRmH0TQG6J1Iz8SRo","pdfSize":"13852189"}