{"id":"2407.02028","title":"Why does in-context learning fail sometimes? Evaluating in-context\n  learning on open and closed questions","authors":"Xiang Li, Haoran Tang, Siyu Chen, Ziwei Wang, Ryan Chen, and Marcin\n  Abram","authorsParsed":[["Li","Xiang",""],["Tang","Haoran",""],["Chen","Siyu",""],["Wang","Ziwei",""],["Chen","Ryan",""],["Abram","Marcin",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 07:52:30 GMT"}],"updateDate":"2024-07-03","timestamp":1719906750000,"abstract":"  We measure the performance of in-context learning as a function of task\nnovelty and difficulty for open and closed questions. For that purpose, we\ncreated a novel benchmark consisting of hard scientific questions, each paired\nwith a context of various relevancy. We show that counter-intuitively, a\ncontext that is more aligned with the topic does not always help more than a\nless relevant context. This effect is especially visible for open questions and\nquestions of high difficulty or novelty. This result reveals a fundamental\ndifference between the treatment of close-form and open-form questions by\nlarge-language models and shows a need for a more robust evaluation of\nin-context learning on the variety of different types of questions. It also\nposes a new question of how to optimally select a context for large language\nmodels, especially in the context of Retrieval Augmented Generation (RAG)\nsystems. Our results suggest that the answer to this question can be highly\napplication-dependent and might be contingent on factors including the format\nof the question, the perceived difficulty level of the questions, and the\nnovelty or popularity of the information we seek.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Information Retrieval","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"vnC9ZjiZPmKJ4eG3EMQk5m3sJ8rvVTZ9lOPyZaCT11U","pdfSize":"1849569"}