{"id":"2407.18901","title":"AppWorld: A Controllable World of Apps and People for Benchmarking\n  Interactive Coding Agents","authors":"Harsh Trivedi, Tushar Khot, Mareike Hartmann, Ruskin Manku, Vinty\n  Dong, Edward Li, Shashank Gupta, Ashish Sabharwal, Niranjan Balasubramanian","authorsParsed":[["Trivedi","Harsh",""],["Khot","Tushar",""],["Hartmann","Mareike",""],["Manku","Ruskin",""],["Dong","Vinty",""],["Li","Edward",""],["Gupta","Shashank",""],["Sabharwal","Ashish",""],["Balasubramanian","Niranjan",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 17:55:45 GMT"}],"updateDate":"2024-07-29","timestamp":1722016545000,"abstract":"  Autonomous agents that address day-to-day digital tasks (e.g., ordering\ngroceries for a household), must not only operate multiple apps (e.g., notes,\nmessaging, shopping app) via APIs, but also generate rich code with complex\ncontrol flow in an iterative manner based on their interaction with the\nenvironment. However, existing benchmarks for tool use are inadequate, as they\nonly cover tasks that require a simple sequence of API calls.\n  To remedy this gap, we built $\\textbf{AppWorld Engine}$, a high-quality\nexecution environment (60K lines of code) of 9 day-to-day apps operable via 457\nAPIs and populated with realistic digital activities simulating the lives of\n~100 fictitious users. We then created $\\textbf{AppWorld Benchmark}$ (40K lines\nof code), a suite of 750 natural, diverse, and challenging autonomous agent\ntasks requiring rich and interactive code generation. It supports robust\nprogrammatic evaluation with state-based unit tests, allowing for different\nways of completing a task while also checking for unexpected changes, i.e.,\ncollateral damage. The state-of-the-art LLM, GPT-4o, solves only ~49% of our\n'normal' tasks and ~30% of 'challenge' tasks, while other models solve at least\n16% fewer. This highlights the benchmark's difficulty and AppWorld's potential\nto push the frontiers of interactive coding agents. The project website is\navailable at https://appworld.dev/.\n","subjects":["Computing Research Repository/Software Engineering","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"vOURdAUh-s3IS6UYFXuHAYAllRzZyiGOF2KZ40WUBUE","pdfSize":"4802218","objectId":"0x2de480d04a94bf22e22635ef8cfd3d60fa47d1e33a07b5b5daec01dad90059d6","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
