{"id":"2407.12165","title":"Building AI Agents for Autonomous Clouds: Challenges and Design\n  Principles","authors":"Manish Shetty, Yinfang Chen, Gagan Somashekar, Minghua Ma, Yogesh\n  Simmhan, Xuchao Zhang, Jonathan Mace, Dax Vandevoorde, Pedro Las-Casas,\n  Shachee Mishra Gupta, Suman Nath, Chetan Bansal, Saravan Rajmohan","authorsParsed":[["Shetty","Manish",""],["Chen","Yinfang",""],["Somashekar","Gagan",""],["Ma","Minghua",""],["Simmhan","Yogesh",""],["Zhang","Xuchao",""],["Mace","Jonathan",""],["Vandevoorde","Dax",""],["Las-Casas","Pedro",""],["Gupta","Shachee Mishra",""],["Nath","Suman",""],["Bansal","Chetan",""],["Rajmohan","Saravan",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 20:40:43 GMT"},{"version":"v2","created":"Wed, 31 Jul 2024 06:01:15 GMT"}],"updateDate":"2024-08-01","timestamp":1721162443000,"abstract":"  The rapid growth in the use of Large Language Models (LLMs) and AI Agents as\npart of software development and deployment is revolutionizing the information\ntechnology landscape. While code generation receives significant attention, a\nhigher-impact application lies in using AI agents for operational resilience of\ncloud services, which currently require significant human effort and domain\nknowledge. There is a growing interest in AI for IT Operations (AIOps) which\naims to automate complex operational tasks, like fault localization and root\ncause analysis, thereby reducing human intervention and customer impact.\nHowever, achieving the vision of autonomous and self-healing clouds through\nAIOps is hampered by the lack of standardized frameworks for building,\nevaluating, and improving AIOps agents. This vision paper lays the groundwork\nfor such a framework by first framing the requirements and then discussing\ndesign decisions that satisfy them. We also propose AIOpsLab, a prototype\nimplementation leveraging agent-cloud-interface that orchestrates an\napplication, injects real-time faults using chaos engineering, and interfaces\nwith an agent to localize and resolve the faults. We report promising results\nand lay the groundwork to build a modular and robust framework for building,\nevaluating, and improving agents for autonomous clouds.\n","subjects":["Computing Research Repository/Software Engineering","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"bx2ZAx8f8kkqaG3GtmAITFO5BjOJ7v--QHQlFl2nMB8","pdfSize":"860632"}