{"id":"2407.15752","title":"Broad and Spectral-Efficient Beamforming for the Uni-polarized\n  Reconfigurable Intelligent Surfaces","authors":"Mohammad Javad-Kalbasi, Mohammed Saif, and Shahrokh Valaee","authorsParsed":[["Javad-Kalbasi","Mohammad",""],["Saif","Mohammed",""],["Valaee","Shahrokh",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 15:58:43 GMT"}],"updateDate":"2024-07-23","timestamp":1721663923000,"abstract":"  A reconfigurable intelligent surface (RIS) is composed of low-cost elements\nthat manipulate the propagation environment from a transmitter by intelligently\napplying phase shifts to incoming signals before they are reflected. This paper\nexplores a uni-polarized RIS with linear shape aimed at transmitting a common\nsignal to multiple user equipments (UEs) spread across a wide angular region.\nTo achieve uniform coverage, the uni-polarized RIS is designed to emit a broad\nand spectral-efficient beam featuring a spatially flat-like array factor,\ndiverging from the conventional narrow beam approach. To achieve this\nobjective, we start by deriving probabilistic lower and upper bounds for the\naverage spectral efficiency (SE) delivered to the UEs. Leveraging the insights\nfrom the lower bound, we focus on optimizing the minimum value of the power\ndomain array factor (PDAF) across a range of azimuth angles from\n\\(-\\frac{\\pi}{2}\\) to \\(\\frac{\\pi}{2}\\). We employ the continuous genetic\nalgorithm (CGA) for this optimization task, aiming to improve the SE delivered\nto the UEs while also creating a wide beam. Extensive simulation experiments\nare carried out to assess the performance of the proposed code, focusing on key\nmetrics such as the minimum and average values of the PDAF and the SE delivered\nto the UEs. Our findings demonstrate that the proposed code enhances the\nminimum SE delivered to the UEs while maintaining the desired attribute of a\nbroad beam. This performance is notably superior to that of established codes,\nincluding the Barker, Frank, and Chu codes.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"dGy7GdPYIwy_ftnt1mjvyGyUQcwCcdOUweCQqRR7hCE","pdfSize":"1545034"}