{"id":"2407.10810","title":"FabGPT: An Efficient Large Multimodal Model for Complex Wafer Defect\n  Knowledge Queries","authors":"Yuqi Jiang, Xudong Lu, Qian Jin, Qi Sun, Hanming Wu, Cheng Zhuo","authorsParsed":[["Jiang","Yuqi",""],["Lu","Xudong",""],["Jin","Qian",""],["Sun","Qi",""],["Wu","Hanming",""],["Zhuo","Cheng",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 15:25:45 GMT"}],"updateDate":"2024-07-16","timestamp":1721057145000,"abstract":"  Intelligence is key to advancing integrated circuit (IC) fabrication. Recent\nbreakthroughs in Large Multimodal Models (LMMs) have unlocked unparalleled\nabilities in understanding images and text, fostering intelligent fabrication.\nLeveraging the power of LMMs, we introduce FabGPT, a customized IC fabrication\nlarge multimodal model for wafer defect knowledge query. FabGPT manifests\nexpertise in conducting defect detection in Scanning Electron Microscope (SEM)\nimages, performing root cause analysis, and providing expert question-answering\n(Q&A) on fabrication processes. FabGPT matches enhanced multimodal features to\nautomatically detect minute defects under complex wafer backgrounds and reduce\nthe subjectivity of manual threshold settings. Besides, the proposed modulation\nmodule and interactive corpus training strategy embed wafer defect knowledge\ninto the pre-trained model, effectively balancing Q&A queries related to defect\nknowledge and original knowledge and mitigating the modality bias issues.\nExperiments on in-house fab data (SEM-WaD) show that our FabGPT achieves\nsignificant performance improvement in wafer defect detection and knowledge\nquerying.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Hardware Architecture","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"nKm0qupd8bUdJ6SZwQ5x6WGcYBd9yNA3nRsc40UBHbY","pdfSize":"5638549","objectId":"0x3d11e510a6166b71df7ad279b1d7d7b08d01acef4bdc3c5d9d87f9e74d3ee80b","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
