{"id":"2407.18344","title":"Not So Fast: A New Catalog of Meteor Persistent Trains","authors":"L. E. Cordonnier, K. S. Obenberger, J. M. Holmes, G. B. Taylor, D.\n  Vida","authorsParsed":[["Cordonnier","L. E.",""],["Obenberger","K. S.",""],["Holmes","J. M.",""],["Taylor","G. B.",""],["Vida","D.",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 19:09:14 GMT"}],"updateDate":"2024-07-29","timestamp":1721934554000,"abstract":"  This paper presents the results of a nearly two year long campaign to detect\nand analyze meteor persistent trains (PTs) - self-emitting phenomena which can\nlinger up to an hour after their parent meteor. The modern understanding of PTs\nhas been primarily developed from the Leonid storms at the turn of the century;\nour goal was to assess the validity of these conclusions using a diverse sample\nof meteors with a wide range of velocities and magnitudes. To this end,\nyear-round observations were recorded by the Widefield Persistent Train camera,\n2nd edition (WiPT2) and were passed through a pipeline to filter out airplanes\nand flag potential meteors. These were classified by visual inspection based on\nthe presence and duration of trains. Observed meteors were cross-referenced\nwith the Global Meteor Network (GMN) database, which independently detects and\ncalculates meteor parameters, enabling statistical analysis of PT-leaving\nmeteors. There were 4726 meteors codetected by the GMN, with 636 of these\nleaving trains. Among these were a large population of slow, dim meteors that\nleft PTs; these slower meteors had a greater train production rate relative to\ntheir faster counterparts. Unlike prior research, we did not find a clear\nmagnitude cutoff or a strong association with fast meteor showers.\nAdditionally, we note several interesting trends not previously reported, which\ninclude PT eligibility being primarily determined by a meteor's terminal height\nand an apparent dynamical origin dependence that likely reflects physical\nmeteoroid properties.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics","Physics/Atmospheric and Oceanic Physics","Physics/Space Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"EcfvKux81S0XJGa65jghmY4DvXZKyed2S78Ne6VNQO0","pdfSize":"8579116"}