{"id":"2407.10086","title":"Rapid Biomedical Research Classification: The Pandemic PACT Advanced\n  Categorisation Engine","authors":"Omid Rohanian, Mohammadmahdi Nouriborji, Olena Seminog, Rodrigo Furst,\n  Thomas Mendy, Shanthi Levanita, Zaharat Kadri-Alabi, Nusrat Jabin, Daniela\n  Toale, Georgina Humphreys, Emilia Antonio, Adrian Bucher, Alice Norton, David\n  A. Clifton","authorsParsed":[["Rohanian","Omid",""],["Nouriborji","Mohammadmahdi",""],["Seminog","Olena",""],["Furst","Rodrigo",""],["Mendy","Thomas",""],["Levanita","Shanthi",""],["Kadri-Alabi","Zaharat",""],["Jabin","Nusrat",""],["Toale","Daniela",""],["Humphreys","Georgina",""],["Antonio","Emilia",""],["Bucher","Adrian",""],["Norton","Alice",""],["Clifton","David A.",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 05:22:53 GMT"},{"version":"v2","created":"Fri, 19 Jul 2024 14:28:26 GMT"}],"updateDate":"2024-07-22","timestamp":1720934573000,"abstract":"  This paper introduces the Pandemic PACT Advanced Categorisation Engine\n(PPACE) along with its associated dataset. PPACE is a fine-tuned model\ndeveloped to automatically classify research abstracts from funded biomedical\nprojects according to WHO-aligned research priorities. This task is crucial for\nmonitoring research trends and identifying gaps in global health preparedness\nand response. Our approach builds on human-annotated projects, which are\nallocated one or more categories from a predefined list. A large language model\nis then used to generate `rationales' explaining the reasoning behind these\nannotations. This augmented data, comprising expert annotations and rationales,\nis subsequently used to fine-tune a smaller, more efficient model. Developed as\npart of the Pandemic PACT project, which aims to track and analyse research\nfunding and clinical evidence for a wide range of diseases with outbreak\npotential, PPACE supports informed decision-making by research funders,\npolicymakers, and independent researchers. We introduce and release both the\ntrained model and the instruction-based dataset used for its training. Our\nevaluation shows that PPACE significantly outperforms its baselines. The\nrelease of PPACE and its associated dataset offers valuable resources for\nresearchers in multilabel biomedical document classification and supports\nadvancements in aligning biomedical research with key global health priorities.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"wMDwa20DOYFensxYkPc_rtRbX7YotVvxqV11m_VJ-FU","pdfSize":"554835"}