{"id":"2407.21504","title":"Room-temperature efficient single-photon generation from CdSe/ZnS\n  nanoplateletes","authors":"M. D'Amato, Ningyuan Fu, Quentin Glorieux, Elisabeth Giacobino, Hanna\n  Le Jeannic, Sandrine Ithurria, Emmanuel Lhuillier and Alberto Bramati","authorsParsed":[["D'Amato","M.",""],["Fu","Ningyuan",""],["Glorieux","Quentin",""],["Giacobino","Elisabeth",""],["Jeannic","Hanna Le",""],["Ithurria","Sandrine",""],["Lhuillier","Emmanuel",""],["Bramati","Alberto",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 10:21:56 GMT"}],"updateDate":"2024-08-01","timestamp":1722421316000,"abstract":"  In the search for materials for quantum information science applications,\ncolloidal semiconductor nanoplatelets (NPLs) have emerged as a highly promising\nnew class of materials due to their interesting optical properties, such as\nnarrow emission linewidth and fast photoluminescence (PL) lifetimes at room\ntemperature. So far only few works focused on the quantum properties of their\nemission, however, NPLs, with their atomic-scale thickness and one-dimensional\nquantum confinement, are promising candidates for single-photon sources. Here,\nwe demonstrate room-temperature single-photon emission from core/shell CdSe/ZnS\nNPLs, which feature 8$x$20 nm$^2$ surface area and 1 nm shell. The limited\nsurface area ensures effective Auger non-radiative recombination, resulting in\nhighly efficient single-photon generation with values of photon purity as low\nas $g^{(2)}(\\tau)=0.04$. The observed long-period blinking and bleaching,\ntypical of such thin shells, can be easily reduced by increasing the shell\nthickness. This work establishes NPLs as new single-photon sources very well\nsuited for integration into quantum photonic systems.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Mesoscale and Nanoscale Physics","Physics/Applied Physics","Physics/Optics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"-bl5ckNn56-yNU4IVZdDfFj1fJlcr2TZd8rYjPQcp_I","pdfSize":"31791586"}