{"id":"2407.20801","title":"AhmedML: High-Fidelity Computational Fluid Dynamics Dataset for\n  Incompressible, Low-Speed Bluff Body Aerodynamics","authors":"Neil Ashton, Danielle C. Maddix, Samuel Gundry, Parisa M. Shabestari","authorsParsed":[["Ashton","Neil",""],["Maddix","Danielle C.",""],["Gundry","Samuel",""],["Shabestari","Parisa M.",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 13:07:51 GMT"}],"updateDate":"2024-07-31","timestamp":1722344871000,"abstract":"  The development of Machine Learning (ML) methods for Computational Fluid\nDynamics (CFD) is currently limited by the lack of openly available training\ndata. This paper presents a new open-source dataset comprising of high\nfidelity, scale-resolving CFD simulations of 500 geometric variations of the\nAhmed Car Body - a simplified car-like shape that exhibits many of the flow\ntopologies that are present on bluff bodies such as road vehicles. The dataset\ncontains simulation results that exhibit a broad set of fundamental flow\nphysics such as geometry and pressure-induced flow separation as well as 3D\nvortical structures. Each variation of the Ahmed car body were run using a\nhigh-fidelity, time-accurate, hybrid Reynolds-Averaged Navier-Stokes (RANS) -\nLarge-Eddy Simulation (LES) turbulence modelling approach using the open-source\nCFD code OpenFOAM. The dataset contains boundary, volume, geometry, and\ntime-averaged forces/moments in widely used open-source formats. In addition,\nthe OpenFOAM case setup is provided so that others can reproduce or extend the\ndataset. This represents to the authors knowledge, the first open-source\nlarge-scale dataset using high-fidelity CFD methods for the widely used Ahmed\ncar body that is available to freely download with a permissive license\n(CC-BY-SA).\n","subjects":["Physics/Fluid Dynamics","Computing Research Repository/Computational Engineering, Finance, and Science","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"UuuFfLS8lHABboteNjsl-WZ8Kpq2KmwSa-L5lco2PEA","pdfSize":"12311848"}