{"id":"2407.00335","title":"Journey of X-ray astronomy: Indian perspectives","authors":"A R Rao","authorsParsed":[["Rao","A R",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 06:40:59 GMT"}],"updateDate":"2024-07-02","timestamp":1719643259000,"abstract":"  X-ray astronomy is a mature area of observational astronomy. After the\ndiscovery of the first non-solar X-ray source in 1962, X-ray astronomy\nproliferated during the Apollo era's space race. Then, it matured as an\nestablished area of research during the period of Great Observatories, and now\nit has become an indispensable tool to understand a wide variety of\nastrophysical phenomena. Consequently, in recent times, niche observational\nareas in X-ray astronomy have been explored, and attempts have been made to\nexpand the sensitivity of observations vastly. India was an active partner in\nthe growth of X-ray astronomy. In the initial years, India leveraged its\nexpertise in balloon technology to get significant results in the research area\nof hard X-ray astronomy. During the rapid growth phase of X-ray astronomy,\nIndia made divergent all-round efforts. Later on, however, the technical\nexpertise available in India was insufficient to compete with the highly\nsophisticated satellite experiments from around the world. During this phase,\nwork in X-ray astronomy continued in a few low-key experiments, eventually\nresulting in the launch of India's first multi-wavelength astronomical\nsatellite, AstroSat, in 2015. In this article, I will trace the journey of\nX-ray astronomy and the developments in the Indian context. I will also explore\nthe sociological aspects of the growth of X-ray astronomy, and, in the end, I\nwill present a speculative sketch of the future of X-ray astronomy with an\nemphasis on the Indian contribution.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0oLbPt3blgmDR6ulg87hJeczSpvLjOgh-TkGiNf24dI","pdfSize":"712510"}