{"id":"2407.12161","title":"Interpretability in Action: Exploratory Analysis of VPT, a Minecraft\n  Agent","authors":"Karolis Jucys, George Adamopoulos, Mehrab Hamidi, Stephanie Milani,\n  Mohammad Reza Samsami, Artem Zholus, Sonia Joseph, Blake Richards, Irina\n  Rish, \\\"Ozg\\\"ur \\c{S}im\\c{s}ek","authorsParsed":[["Jucys","Karolis",""],["Adamopoulos","George",""],["Hamidi","Mehrab",""],["Milani","Stephanie",""],["Samsami","Mohammad Reza",""],["Zholus","Artem",""],["Joseph","Sonia",""],["Richards","Blake",""],["Rish","Irina",""],["Şimşek","Özgür",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 20:38:08 GMT"}],"updateDate":"2024-07-18","timestamp":1721162288000,"abstract":"  Understanding the mechanisms behind decisions taken by large foundation\nmodels in sequential decision making tasks is critical to ensuring that such\nsystems operate transparently and safely. In this work, we perform exploratory\nanalysis on the Video PreTraining (VPT) Minecraft playing agent, one of the\nlargest open-source vision-based agents. We aim to illuminate its reasoning\nmechanisms by applying various interpretability techniques. First, we analyze\nthe attention mechanism while the agent solves its training task - crafting a\ndiamond pickaxe. The agent pays attention to the last four frames and several\nkey-frames further back in its six-second memory. This is a possible mechanism\nfor maintaining coherence in a task that takes 3-10 minutes, despite the short\nmemory span. Secondly, we perform various interventions, which help us uncover\na worrying case of goal misgeneralization: VPT mistakenly identifies a villager\nwearing brown clothes as a tree trunk when the villager is positioned\nstationary under green tree leaves, and punches it to death.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"s1s85aokJTlY3jPPKo-OU0LzsWYsEDTPk4v0qN0eRLU","pdfSize":"15300377","objectId":"0xc23c83bc64bc9c1ed099db62751f1734da5de8133b52ea717eeb95e32d696a1e","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
