{"id":"2407.18019","title":"Irreducible decompositions of tensors via the Brauer algebra and\n  applications to metric-affine gravity","authors":"Thomas Helpin","authorsParsed":[["Helpin","Thomas",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 13:13:10 GMT"}],"updateDate":"2024-07-26","timestamp":1721913190000,"abstract":"  In the first part of this thesis, we make use of representation theory of\ngroups and algebras to perform an irreducible decomposition of tensors in the\ncontext of metric-affine gravity. In particular, we consider the action of the\northogonal group O(1, d$-1$) on the Riemann tensor associated with an affine\nconnection defined on a d-dimensional pseudo-Riemannian manifold. This\nconnection, with torsion and non-metricity, is the characteristic ingredient of\nmetric-affine theories of gravity.\n  In the second part of this thesis, we construct the projection operators used\nfor the aforementioned decomposition. They are realized in terms of the\nsymmetric group algebra $\\mathbb{C}\\mathfrak{S}_n$ and of the Brauer algebra\nB$_n$(d) which are related respectively to the action of GL(d,$\\mathbb{C}$)\n(and its real form GL(d,$\\mathbb{R}$)) and to the action of O(d,$\\mathbb{C}$)\n(and its real form O(1 , d$-1$)) on tensors via the Schur-Weyl duality. First\nof all, we give an alternative approach to the known formulas for the central\nidempotents of $\\mathbb{C}\\mathfrak{S}_n$. These elements provide a unique\nreducible decomposition, known as the isotypic decomposition. For our purposes,\nthis decomposition is remarkably handy to arrive at the sought after\nirreducible decomposition with respect to GL(d,$\\mathbb{R}$). Then, we\nconstruct the elements in B$_n$(d) which realize the isotypic decomposition of\na tensor under the action of O(d,$\\mathbb{C}$). This decomposition is\nirreducible under O(d,$\\mathbb{C}$) when applied to an irreducible\nGL(d,$\\mathbb{C}$) tensor of order $5$ or less. As a by product of the\nconstruction, we give a solution to the problem of decomposing an arbitrary\ntensor into its traceless part, doubly traceless part and so on. These results\nled to the development of several Mathematica packages linked to the\n\\textit{xAct} bundle for tensor calculus in field theory.\n","subjects":["Physics/High Energy Physics - Theory","Physics/General Relativity and Quantum Cosmology","Physics/Mathematical Physics","Mathematics/Mathematical Physics","Mathematics/Representation Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"l_jyXMZ2sf0Ydn3axQkjWnGzAP6fDf_XDaJZDW3Pon4","pdfSize":"7872065"}