{"id":"2407.20609","title":"Coupling 3D geodynamics and dynamic earthquake rupture: fault geometry,\n  rheology and stresses across timescales","authors":"Anthony Jourdon, Jorge Nicolas Hayek, Dave A. May, Alice-Agnes Gabriel","authorsParsed":[["Jourdon","Anthony",""],["Hayek","Jorge Nicolas",""],["May","Dave A.",""],["Gabriel","Alice-Agnes",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 07:34:54 GMT"}],"updateDate":"2024-07-31","timestamp":1722324894000,"abstract":"  Tectonic deformation crucially shapes the Earth's surface, with strain\nlocalization resulting in the formation of shear zones and faults that\naccommodate significant tectonic displacement. Earthquake dynamic rupture\nmodels, which provide valuable insights into earthquake mechanics and seismic\nground motions, rely on initial conditions such as pre-stress states and fault\ngeometry. However, these are often inadequately constrained due to\nobservational limitations. To address these challenges, we develop a new method\nthat loosely couples 3D geodynamic models to 3D dynamic rupture simulations,\nproviding a mechanically consistent framework for earthquake analysis. Our\napproach does not prescribe fault geometry but derives it from the underlying\nlithospheric rheology and tectonic velocities using the medial axis transform.\nWe perform three long-term geodynamics models of a strike-slip geodynamic\nsystem, each involving different continental crust rheology. We link these with\nnine dynamic rupture models, in which we investigate the role of varying\nfracture energy and plastic strain energy dissipation in the dynamic rupture\nbehavior. These simulations suggest that for our fault, long-term rheology, and\ngeodynamic system, a plausible critical linear slip weakening distance falls\nwithin Dc in [0.6,1.5]. Our results indicate that the long-term 3D stress field\nfavors slip on fault segments better aligned with the regional plate motion and\nthat minor variations in the long-term 3D stress field can strongly affect\nrupture dynamics, providing a physical mechanism for arresting earthquake\npropagation. Our geodynamically informed earthquake models highlight the need\nfor detailed 3D fault modeling across time scales for a comprehensive\nunderstanding of earthquake mechanics.\n","subjects":["Physics/Geophysics","Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"fbPTIBFvVdcFWj1UqTUFcgri4pxo51AuJpmFHvZ7YEU","pdfSize":"5631217"}