{"id":"2407.10434","title":"Evaluation and statistical correction of area-based heat index forecasts\n  that drive a heatwave warning service","authors":"Nicholas Loveday and Maree Carroll","authorsParsed":[["Loveday","Nicholas",""],["Carroll","Maree",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 04:27:33 GMT"}],"updateDate":"2024-07-16","timestamp":1721017653000,"abstract":"  This study evaluates the performance of the area-based, district heatwave\nforecasts that drive the Australian heatwave warning service. The analysis\ninvolves using a recently developed approach of scoring multicategorical\nforecasts using the FIxed Risk Multicategorical (FIRM) scoring framework.\nAdditionally, we quantify the stability of the district forecasts between\nforecast updates. Notably, at longer lead times, a discernible overforecast\nbias exists that leads to issuing severe and extreme heatwave district\nforecasts too frequently. Consequently, at shorter lead times forecast heatwave\ncategories are frequently downgraded with subsequent revisions. To address\nthese issues, we demonstrate how isotonic regression can be used to\nconditionally bias correct the district forecasts. Finally, using synthetic\nexperiments, we illustrate that even if an area warning is derived from a\nperfectly calibrated gridded forecast, the area warning will be biased in most\nsituations. We show how these biases can also be corrected using isotonic\nregression which could lead to a better heatwave warning service. Importantly,\nthe evaluation and bias correction approaches demonstrated in this paper are\nrelevant to forecast parameters other than heat indices.\n","subjects":["Physics/Atmospheric and Oceanic Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"SQwM-283g-Hp6t0N0emen4gjGxp7nJg_eWRaNibeRB4","pdfSize":"891184","objectId":"0xf002b1fc4bd3bd865eb683b18b069dfe3dff1ed2a8d260653e67839f31084ab6","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
