{"id":"2407.03696","title":"Control of friction: shortcuts and optimization for the rate- and\n  state-variable equation","authors":"Andrea Plati, Alberto Petri, Marco Baldovin","authorsParsed":[["Plati","Andrea",""],["Petri","Alberto",""],["Baldovin","Marco",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 07:32:02 GMT"}],"updateDate":"2024-07-08","timestamp":1720078322000,"abstract":"  Frictional forces are a key ingredient of any physical description of the\nmacroscopic world, as they account for the phenomena causing transformation of\nmechanical energy into heat. They are ubiquitous in nature, and a wide range of\npractical applications involve the manipulation of physical systems where\nfriction plays a crucial role. In this paper, we apply control theory to\ndynamics governed by the paradigmatic rate- and state-variable law for\nsolid-on-solid friction. Several control problems are considered for the case\nof a slider dragged on a surface by an elastic spring. By using swift\nstate-to-state protocols, we show how to drive the system between two arbitrary\nstationary states characterized by different constant sliding velocities in a\ngiven time. Remarkably, this task proves to be feasible even when specific\nconstraints are imposed on the dynamics, such as preventing the instantaneous\nsliding velocity or the frictional force from exceeding a prescribed bound. The\nderived driving protocols also allow to avoid a stick-slip instability, which\ninstead occurs when velocity is suddenly switched. By exploiting variational\nmethods, we also address the functional minimization problem of finding the\noptimal protocol that connects two steady states in a specified time, while\nminimizing the work done by the friction. We find that the optimal strategy can\nchange qualitatively depending on the time imposed for the duration of the\nprocess. Our results mark a significant step forward in establishing a\ntheoretical framework for control problems in the presence of friction and\nnaturally pave the way for future experiments.\n","subjects":["Condensed Matter/Soft Condensed Matter","Condensed Matter/Other Condensed Matter"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"FTjltjE1dIyrUrVs2jtEq9KYREGmGenZiNO151aP6GA","pdfSize":"1346881"}