{"id":"2407.09069","title":"Holographic Einstein Ring of Deformed AdS-Schwarzschild Black Holes","authors":"Jin-Yu Gui, Xiao-Xiong Zeng, Ke-Jian He, Huan Ye","authorsParsed":[["Gui","Jin-Yu",""],["Zeng","Xiao-Xiong",""],["He","Ke-Jian",""],["Ye","Huan",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 07:50:11 GMT"}],"updateDate":"2024-07-15","timestamp":1720770611000,"abstract":"  The Einstein ring of a deformed AdS-Schwarzschild black hole (BH) is\ninvestigated under the wave optics framework. When the source is fixed on the\nAdS boundary, we can obtain the corresponding response function generated on\nthe opposite side of the boundary. Utilizing a specialized optical system\nequipped with a convex lens enables us to capture an image of the BH's\nholographic Einstein ring on the screen. The influence of the relevant physical\nparameters and the observed inclination on the characteristics of the Einstein\nring can also be studied, which found that the alteration of the observer's\nposition, the image displayed on the screen changes from an axisymmetric ring\nto an arc, ultimately becoming a solitary point of luminosity. Furthermore,\nvariations in the relevant physical parameters naturally exert an influence on\nthe Einstein ring, resulting in various changes to both its radius and\nbrightness. We also discover the photon ring of the BH from the perspective of\nthe geometric optics, and the numerical results demonstrate that the incident\nangle of the photon ring is consistent with that of the Einstein ring. It is\nfound that the validity of studying the Einstein ring by wave optics. The\ninvestigation on the Einstein rings formed by the deformed AdS-Schwarzschild\nBHs is anticipated to yield more comprehensive insights into the spacetime\ngeometry, enabling its distinction from Schwarzschild BH.\n","subjects":["Physics/High Energy Physics - Theory","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"RRxkfAbDYF5zeFrK7rMPfUoORsF3ZztJ97neNME310Q","pdfSize":"44969963"}