{"id":"2407.02651","title":"Improving Steering and Verification in AI-Assisted Data Analysis with\n  Interactive Task Decomposition","authors":"Majeed Kazemitabaar, Jack Williams, Ian Drosos, Tovi Grossman, Austin\n  Henley, Carina Negreanu, Advait Sarkar","authorsParsed":[["Kazemitabaar","Majeed",""],["Williams","Jack",""],["Drosos","Ian",""],["Grossman","Tovi",""],["Henley","Austin",""],["Negreanu","Carina",""],["Sarkar","Advait",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 20:33:50 GMT"},{"version":"v2","created":"Thu, 1 Aug 2024 15:56:00 GMT"}],"updateDate":"2024-08-02","timestamp":1719952430000,"abstract":"  LLM-powered tools like ChatGPT Data Analysis, have the potential to help\nusers tackle the challenging task of data analysis programming, which requires\nexpertise in data processing, programming, and statistics. However, our\nformative study (n=15) uncovered serious challenges in verifying AI-generated\nresults and steering the AI (i.e., guiding the AI system to produce the desired\noutput). We developed two contrasting approaches to address these challenges.\nThe first (Stepwise) decomposes the problem into step-by-step subgoals with\npairs of editable assumptions and code until task completion, while the second\n(Phasewise) decomposes the entire problem into three editable, logical phases:\nstructured input/output assumptions, execution plan, and code. A controlled,\nwithin-subjects experiment (n=18) compared these systems against a\nconversational baseline. Users reported significantly greater control with the\nStepwise and Phasewise systems, and found intervention, correction, and\nverification easier, compared to the baseline. The results suggest design\nguidelines and trade-offs for AI-assisted data analysis tools.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"I3e2Qin3cg-gXM-LgIYO_tBnMSlUQpLkCOhzs29egLg","pdfSize":"6047159"}