{"id":"2407.08381","title":"Einasto profile as the halo model solution coupled to the depletion\n  radius","authors":"Yifeng Zhou and Jiaxin Han","authorsParsed":[["Zhou","Yifeng",""],["Han","Jiaxin",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 10:43:27 GMT"}],"updateDate":"2024-07-12","timestamp":1720694607000,"abstract":"  We constrain the halo profiles outside the halo boundaries by solving for the\nmatching profiles required by the halo model. In the halo model framework, the\nmatter distribution in the universe can be decomposed into the spatial\ndistribution of halos convolved with their internal structures. This leads to a\nset of linear equations in Fourier space which uniquely determines the optimal\nhalo profiles for any given halo catalog. In this work, we construct three halo\ncatalogs with different boundary definitions, and solve for the optimal\nprofiles in each case using measurements of halo-matter and halo-halo power\nspectra. Our results show that for a given halo field, there is always a set of\nmatching profiles to accurately reconstruct the input statistics of the matter\nfield, even though it might be complex to model the profiles analytically.\nComparing the solutions from different halo catalogs, we find their mass\ndistributions inside the inner depletion radii are nearly identical, while they\ndeviate from each other on larger scales, with a larger boundary resulting in a\nmore extended profile. For the depletion radius based catalog, the numerical\nsolution agrees well with the Einasto profile. Coupling the Einasto profile\nwith the depletion catalog, the resulting halo model can simultaneously predict\nthe halo-matter power spectra to $10\\%$ and matter-matter power spectrum to\n$5\\%$, improving over conventional models in both the interpretability and\nversatility.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"aoz3TGwT3Ji0dopJK2h83zDFl_NeM5K1xSnbsJyuvGE","pdfSize":"14309392"}