{"id":"2407.07009","title":"Explainable AI for Enhancing Efficiency of DL-based Channel Estimation","authors":"Abdul Karim Gizzini, Yahia Medjahdi, Ali J. Ghandour, Laurent Clavier","authorsParsed":[["Gizzini","Abdul Karim",""],["Medjahdi","Yahia",""],["Ghandour","Ali J.",""],["Clavier","Laurent",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 16:24:21 GMT"}],"updateDate":"2024-07-10","timestamp":1720542261000,"abstract":"  The support of artificial intelligence (AI) based decision-making is a key\nelement in future 6G networks, where the concept of native AI will be\nintroduced. Moreover, AI is widely employed in different critical applications\nsuch as autonomous driving and medical diagnosis. In such applications, using\nAI as black-box models is risky and challenging. Hence, it is crucial to\nunderstand and trust the decisions taken by these models. Tackling this issue\ncan be achieved by developing explainable AI (XAI) schemes that aim to explain\nthe logic behind the black-box model behavior, and thus, ensure its efficient\nand safe deployment. Recently, we proposed a novel perturbation-based XAI-CHEST\nframework that is oriented toward channel estimation in wireless\ncommunications. The core idea of the XAI-CHEST framework is to identify the\nrelevant model inputs by inducing high noise on the irrelevant ones. This\nmanuscript provides the detailed theoretical foundations of the XAI-CHEST\nframework. In particular, we derive the analytical expressions of the XAI-CHEST\nloss functions and the noise threshold fine-tuning optimization problem. Hence\nthe designed XAI-CHEST delivers a smart input feature selection methodology\nthat can further improve the overall performance while optimizing the\narchitecture of the employed model. Simulation results show that the XAI-CHEST\nframework provides valid interpretations, where it offers an improved bit error\nrate performance while reducing the required computational complexity in\ncomparison to the classical DL-based channel estimation.\n","subjects":["Computing Research Repository/Artificial Intelligence","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"eqpN5QXRoBvtjm62xcUaJYjxDOYXXhgJD3S6dMv-ac4","pdfSize":"1002193"}