{"id":"2407.00197","title":"Tradeoffs When Considering Deep Reinforcement Learning for Contingency\n  Management in Advanced Air Mobility","authors":"Luis E. Alvarez and Marc W. Brittain and Steven D. Young","authorsParsed":[["Alvarez","Luis E.",""],["Brittain","Marc W.",""],["Young","Steven D.",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 19:09:55 GMT"}],"updateDate":"2024-07-02","timestamp":1719601795000,"abstract":"  Air transportation is undergoing a rapid evolution globally with the\nintroduction of Advanced Air Mobility (AAM) and with it comes novel challenges\nand opportunities for transforming aviation. As AAM operations introduce\nincreasing heterogeneity in vehicle capabilities and density, increased levels\nof automation are likely necessary to achieve operational safety and efficiency\ngoals. This paper focuses on one example where increased automation has been\nsuggested. Autonomous operations will need contingency management systems that\ncan monitor evolving risk across a span of interrelated (or interdependent)\nhazards and, if necessary, execute appropriate control interventions via\nsupervised or automated decision making. Accommodating this complex environment\nmay require automated functions (autonomy) that apply artificial intelligence\n(AI) techniques that can adapt and respond to a quickly changing environment.\nThis paper explores the use of Deep Reinforcement Learning (DRL) which has\nshown promising performance in complex and high-dimensional environments where\nthe objective can be constructed as a sequential decision-making problem. An\nextension of a prior formulation of the contingency management problem as a\nMarkov Decision Process (MDP) is presented and uses a DRL framework to train\nagents that mitigate hazards present in the simulation environment. A\ncomparison of these learning-based agents and classical techniques is presented\nin terms of their performance, verification difficulties, and development\nprocess.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"wsVYfXycSqvDIYtmcPMAoVIgDsoF_2703oh8E6pu108","pdfSize":"17968113"}