{"id":"2407.13066","title":"Fast and Scalable FFT-Based GPU-Accelerated Algorithms for Hessian\n  Actions Arising in Linear Inverse Problems Governed by Autonomous Dynamical\n  Systems","authors":"Sreeram Venkat, Milinda Fernando, Stefan Henneking, Omar Ghattas","authorsParsed":[["Venkat","Sreeram",""],["Fernando","Milinda",""],["Henneking","Stefan",""],["Ghattas","Omar",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 00:23:38 GMT"}],"updateDate":"2024-07-19","timestamp":1721262218000,"abstract":"  We present an efficient and scalable algorithm for performing matrix-vector\nmultiplications (\"matvecs\") for block Toeplitz matrices. Such matrices, which\nare shift-invariant with respect to their blocks, arise in the context of\nsolving inverse problems governed by autonomous systems, and time-invariant\nsystems in particular. In this article, we consider inverse problems that are\nsolved for inferring unknown parameters from observational data of a linear\ntime-invariant dynamical system given in the form of partial differential\nequations (PDEs). Matrix-free Newton-conjugate-gradient methods are often the\ngold standard for solving these inverse problems, but they require numerous\nactions of the Hessian on a vector. Matrix-free adjoint-based Hessian matvecs\nrequire solution of a pair of linearized forward/adjoint PDE solves per Hessian\naction, which may be prohibitive for large-scale inverse problems, especially\nwhen efficient low-rank approximations of the Hessian are not readily\navailable, such as for hyperbolic PDE operators. Time invariance of the forward\nPDE problem leads to a block Toeplitz structure of the discretized\nparameter-to-observable (p2o) map defining the mapping from inputs (parameters)\nto outputs (observables) of the PDEs. This block Toeplitz structure enables us\nto exploit two key properties: (1) compact storage of the p2o map and its\nadjoint; and (2) efficient fast Fourier transform (FFT)-based Hessian matvecs.\nThe proposed algorithm is mapped onto large multi-GPU clusters and achieves\nmore than 80 percent of peak bandwidth on an NVIDIA A100 GPU. Excellent weak\nscaling is shown for up to 48 A100 GPUs. For the targeted problems, the\nimplementation executes Hessian matvecs within fractions of a second, orders of\nmagnitude faster than can be achieved by the conventional matrix-free Hessian\nmatvecs via forward/adjoint PDE solves.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"LhjxPk0V381nO1MJ_T2W7CENw46G_kOBmWaQOW4rnds","pdfSize":"824757"}