{"id":"2407.07527","title":"Low temperature conductivity of BaFe$_{0.5}$Nb$_{0.5}$O$_3$ double\n  perovskite structure ceramics","authors":"Vijay Khopkar and Balaram Sahoo","authorsParsed":[["Khopkar","Vijay",""],["Sahoo","Balaram",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 10:29:29 GMT"}],"updateDate":"2024-07-11","timestamp":1720607369000,"abstract":"  In this work, we explore the origin and type of charge carriers, and their\ntransport mechanism in polycrystalline barium-iron-niobate (BFN,\nBaFe$_{0.5}$Nb$_{0.5}$O$_3$) ceramics, at lower temperatures between 20K and\n300K. The observed point defects at grain andsurface defects at grain boundary\nregion are responsible for the electronic conductivity, whereas dipoles at\ngrain boundary region are responsible for the ionic conductivity, these\nindependent electronic and ionic conductivity were responsible for the total\nconductivity of our BFN sample. The required activation energy for conduction\nof electrons in grain boundary region and ions in grain region were calculated\nto be 317 meV and 17 meV respectively. The electronic conductivity of grain\nregion obey Jonscher's power law. Analysis of the temperature dependent\nfrequency exponent suggest that the electronic conductivity of grain follows\nthe overlapping large polaron tunneling (OLP) model. The temperature dependent\nconductivity follows the Mott variable range hopping model(VRH), showing\nhopping range increases with decreasing temeprature. The defect density of the\ngrain obtained to be $3.17 \\times 10^{17}$ eV/cm$^3$. The contribution of\nphonon to the conductivity understood by considering Schankenberg model,\nactivation energy of 110 meV corresponds to the multiphonon (both optical and\nacoustic) and 1.6 meV corresponds to acoustic phonon only. Our systematic study\nprovides in-depth understanding of the low temperature conductivity mechanism\nof polycrystalline BFN ceramics.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"Rt0m5nDp46TqHLvcJNpSG3lErtL8HHnYx4-3L5vWBwA","pdfSize":"2429727"}