{"id":"2407.04418","title":"Enabling On-Device LLMs Personalization with Smartphone Sensing","authors":"Shiquan Zhang, Ying Ma, Le Fang, Hong Jia, Simon D'Alfonso, Vassilis\n  Kostakos","authorsParsed":[["Zhang","Shiquan",""],["Ma","Ying",""],["Fang","Le",""],["Jia","Hong",""],["D'Alfonso","Simon",""],["Kostakos","Vassilis",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 11:09:05 GMT"},{"version":"v2","created":"Wed, 24 Jul 2024 01:32:05 GMT"}],"updateDate":"2024-07-25","timestamp":1720177745000,"abstract":"  This demo presents a novel end-to-end framework that combines on-device large\nlanguage models (LLMs) with smartphone sensing technologies to achieve\ncontext-aware and personalized services. The framework addresses critical\nlimitations of current personalization solutions via cloud LLMs, such as\nprivacy concerns, latency and cost, and limited personal information. To\nachieve this, we innovatively proposed deploying LLMs on smartphones with\nmultimodal sensor data through context-aware sensing and customized prompt\nengineering, ensuring privacy and enhancing personalization performance. A case\nstudy involving a university student demonstrated the capability of the\nframework to provide tailored recommendations. In addition, we show that the\nframework achieves the best trade-off in privacy, performance, latency, cost,\nbattery and energy consumption between on-device and cloud LLMs. To the best of\nour knowledge, this is the first framework to provide on-device LLMs\npersonalization with smartphone sensing. Future work will incorporate more\ndiverse sensor data and involve extensive user studies to enhance\npersonalization. Our proposed framework has the potential to substantially\nimprove user experiences across domains including healthcare, productivity, and\nentertainment.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"y3EMQLGHhRdEN4VU3HLp2rJfnh4Nk5LFMJGt-eHMhUs","pdfSize":"3200063"}