{"id":"2407.12063","title":"Unveiling Scaling Laws in the Regulatory Functions of Reddit","authors":"Shambhobi Bhattacharya, Jisung Yoon and Hyejin Youn","authorsParsed":[["Bhattacharya","Shambhobi",""],["Yoon","Jisung",""],["Youn","Hyejin",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 23:36:56 GMT"}],"updateDate":"2024-07-18","timestamp":1721086616000,"abstract":"  Online platforms like Reddit, Wikipedia, and Facebook are integral to modern\nlife, enabling content creation and sharing through posts, comments, and\ndiscussions. Despite their virtual and often anonymous nature, these platforms\nneed rules and oversight to maintain a safe and productive environment. As\nthese communities grow, a key question arises: how does the need for regulatory\nfunctions scale? Do larger groups require more regulatory actions and oversight\nper person, or can they manage with less? Our analysis of Reddit's regulatory\nfunctions reveals robust scaling relationships across different subreddits,\nsuggesting universal patterns between community size and the amount of\nregulation needed. We found that the number of comments and moderator actions,\nsuch as comment removals, grew faster than the community size, with superlinear\nexponents of 1.12 and 1.18, respectively. However, bot-based rule enforcement\ndid not keep pace with community growth, exhibiting a slightly sublinear\nexponent of 0.95. Further analysis of the residuals from these scaling\nbehaviors identified a 'trade-off axis,' where one-way coordination mechanisms\n(bots and moderators) counteract two-way interactions (comments) and vice\nversa. Our findings suggest that a more proactive moderation approach,\ncharacterized by increased bot activity and moderator comment removals, tends\nto result in less user engagement under the scaling framework. Understanding\nthese natural scaling patterns and interactions can help platform\nadministrators and policymakers foster healthy online communities while\nmitigating harmful behaviors such as harassment, doxxing, and misinformation.\nWithout proper regulation, these negative behaviors can proliferate and cause\nsignificant damage. Targeted interventions based on these insights are key to\nensuring online platforms remain safe and beneficial spaces.\n","subjects":["Physics/Physics and Society","Computing Research Repository/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"metB9KicnxdnJ-w05lpGkEUrEdUyMzqOkDKViDp6O10","pdfSize":"931985","objectId":"0xef4aca237f752b8fb139903f8799faf2831fd64b96762aae0a133d5dba4bebcb","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
