{"id":"2407.15175","title":"${\\it Asparagus}$: A Toolkit for Autonomous, User-Guided Construction of\n  Machine-Learned Potential Energy Surfaces","authors":"Kai T\\\"opfer, Luis Itza Vazquez-Salazar, Markus Meuwly","authorsParsed":[["Töpfer","Kai",""],["Vazquez-Salazar","Luis Itza",""],["Meuwly","Markus",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 14:22:47 GMT"}],"updateDate":"2024-07-23","timestamp":1721571767000,"abstract":"  With the establishment of machine learning (ML) techniques in the scientific\ncommunity, the construction of ML potential energy surfaces (ML-PES) has become\na standard process in physics and chemistry. So far, improvements in the\nconstruction of ML-PES models have been conducted independently, creating an\ninitial hurdle for new users to overcome and complicating the reproducibility\nof results. Aiming to reduce the bar for the extensive use of ML-PES, we\nintroduce ${\\it Asparagus}$, a software package encompassing the different\nparts into one coherent implementation that allows an autonomous, user-guided\nconstruction of ML-PES models. ${\\it Asparagus}$ combines capabilities of\ninitial data sampling with interfaces to ${\\it ab\n  initio}$ calculation programs, ML model training, as well as model evaluation\nand its application within other codes such as ASE or CHARMM. The\nfunctionalities of the code are illustrated in different examples, including\nthe dynamics of small molecules, the representation of reactive potentials in\norganometallic compounds, and atom diffusion on periodic surface structures.\nThe modular framework of ${\\it Asparagus}$ is designed to allow simple\nimplementations of further ML-related methods and models to provide constant\nuser-friendly access to state-of-the-art ML techniques.\n","subjects":["Physics/Chemical Physics","Computing Research Repository/Computational Engineering, Finance, and Science","Computing Research Repository/Machine Learning","Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"wCBc0Zy5Q1gWOGdcyfpDMbziWInenreKFaQGwqTfuLU","pdfSize":"3554972"}