{"id":"2407.06727","title":"Towards Physics-informed Cyclic Adversarial Multi-PSF Lensless Imaging","authors":"Abeer Banerjee, Sanjay Singh","authorsParsed":[["Banerjee","Abeer",""],["Singh","Sanjay",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 10:07:28 GMT"}],"updateDate":"2024-07-10","timestamp":1720519648000,"abstract":"  Lensless imaging has emerged as a promising field within inverse imaging,\noffering compact, cost-effective solutions with the potential to revolutionize\nthe computational camera market. By circumventing traditional optical\ncomponents like lenses and mirrors, novel approaches like mask-based lensless\nimaging eliminate the need for conventional hardware. However, advancements in\nlensless image reconstruction, particularly those leveraging Generative\nAdversarial Networks (GANs), are hindered by the reliance on data-driven\ntraining processes, resulting in network specificity to the Point Spread\nFunction (PSF) of the imaging system. This necessitates a complete retraining\nfor minor PSF changes, limiting adaptability and generalizability across\ndiverse imaging scenarios. In this paper, we introduce a novel approach to\nmulti-PSF lensless imaging, employing a dual discriminator cyclic adversarial\nframework. We propose a unique generator architecture with a sparse\nconvolutional PSF-aware auxiliary branch, coupled with a forward model\nintegrated into the training loop to facilitate physics-informed learning to\nhandle the substantial domain gap between lensless and lensed images.\nComprehensive performance evaluation and ablation studies underscore the\neffectiveness of our model, offering robust and adaptable lensless image\nreconstruction capabilities. Our method achieves comparable performance to\nexisting PSF-agnostic generative methods for single PSF cases and demonstrates\nresilience to PSF changes without the need for retraining.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"vWZTF1iiOytWp3viLGM4j-bjuBZPkL1QiwcFLNfj1YE","pdfSize":"19358907"}