{"id":"2407.18677","title":"Experimentally mapping the scattering phases and amplitudes of a finite\n  object by optical mutual scattering","authors":"Alfredo Rates, Ad Lagendijk, Minh Duy Truong and Willem L. Vos","authorsParsed":[["Rates","Alfredo",""],["Lagendijk","Ad",""],["Truong","Minh Duy",""],["Vos","Willem L.",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 11:44:01 GMT"}],"updateDate":"2024-07-29","timestamp":1721994241000,"abstract":"  Mutual scattering arises when multiple waves intersect within a finite\nscattering object, resulting in cross-interference between the incident and\nscattered waves. By measuring mutual scattering, we determine the\ncomplex-valued scattering amplitude $f$ - both amplitude and phase - of the\nfinite object, which holds information on its scattering properties by linking\nincident and outgoing waves from any arbitrary direction. Mutual scattering is\npresent for any coherent wave - acoustic, electromagnetic, particle - and we\nhere demonstrate the effect using optical experiments. We propose an\nexperimental technique for characterization that utilizes mutual scattering and\nwe present our results for four distinct finite objects: a polystyrene sphere\n(diameter $59\\ \\mu$m), a single black human hair (diameter $92\\ \\mu$m), a strip\nof pultruded carbon (edge length $140\\ \\mu$m), and a block of ZnO$_2$ (edge\nlength $64\\ \\mu$m). Our measurements exhibit qualitative agreement with Mie\nscattering calculations where the model is applicable. Deviations from the\nmodel indicate the complexity of the objects, both in terms of their\ngeometrical structure and scattering properties. Our results offer new insights\ninto mutual scattering and have significant implications for future\napplications of sample characterization in fields such as metrology,\nmicroscopy, and nanofabrication.\n","subjects":["Physics/Optics","Condensed Matter/Mesoscale and Nanoscale Physics","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"mVX6oWX3LtXr37gKfF4tNNteQgiSSpahXSEt29ZOHTI","pdfSize":"7462384","objectId":"0xbf40ea5252e784298690f213e2faf125ac81aee2543246e7ca638d0420716be2","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
