{"id":"2407.15445","title":"Primordial black holes in SB SUSY Gauss-Bonnet inflation","authors":"A. Ashrafzadeh, M. Solbi, S. Heydari and K. Karami","authorsParsed":[["Ashrafzadeh","A.",""],["Solbi","M.",""],["Heydari","S.",""],["Karami","K.",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 07:58:24 GMT"},{"version":"v2","created":"Tue, 20 Aug 2024 20:56:19 GMT"}],"updateDate":"2024-08-22","timestamp":1721635104000,"abstract":"  Here, we explore the formation of primordial black holes (PBHs) within a\nscalar field inflationary model coupled to the Gauss-Bonnet (GB) term,\nincorporating low-scale spontaneously broken supersymmetric (SB SUSY)\npotential. The coupling function amplifies the curvature perturbations,\nconsequently leading to the formation of PBHs and the production of detectable\nsecondary gravitational waves (GWs). Through the adjustment of model\nparameters, the inflaton can be decelerated during the ultra-slow-roll (USR)\nphase, thereby augmenting curvature perturbations. Swampland criteria are also\ninvestigated. Our computations forecast the formation of PBHs with masses on\nthe order of ${\\cal O}(10)M_{\\odot}$, aligning with observational data from\nLIGO-Virgo and PBHs with masses ${\\cal O}(10^{-6})M_{\\odot}$, offering\npotential explanation for ultrashort-timescale microlensing events recorded in\nOGLE data. Additionally, our proposed mechanism can generate PBHs with masses\naround ${\\cal O}(10^{-13})M_{\\odot}$, constituting roughly 99$\\%$ of the dark\nmatter. The density parameter of produced GWs ($\\Omega_{\\rm GW_0}$) intersects\nwith the sensitivity curves of GW detectors. Two cases of our model fall within\nthe nano-Hz regime. One of these satisfies the $\\Omega_{\\rm{GW}}(f) \\sim\nf^{5-\\gamma}$ fit, with the derived $\\gamma = 3.51$ matching the NANOGrav\n15-year data.\n","subjects":["Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8Big0etE7QkiFmnb5S0q4hLER08EA7sSR0q7YYkTDuM","pdfSize":"1190744"}