{"id":"2407.07161","title":"Electrically tunable spin-orbit coupled photonic lattice in a liquid\n  crystal microcavity","authors":"Marcin Muszy\\'nski, Przemys{\\l}aw Oliwa, Pavel Kokhanchik, Piotr\n  Kapu\\'sci\\'nski, Eva Oton, Rafa{\\l} Mazur, Przemys{\\l}aw Morawiak, Wiktor\n  Piecek, Przemys{\\l}aw Kula, Witold Bardyszewski, Barbara Pi\\k{e}tka, Daniil\n  Bobylev, Dmitry Solnyshkov, Guillaume Malpuech, and Jacek Szczytko","authorsParsed":[["Muszyński","Marcin",""],["Oliwa","Przemysław",""],["Kokhanchik","Pavel",""],["Kapuściński","Piotr",""],["Oton","Eva",""],["Mazur","Rafał",""],["Morawiak","Przemysław",""],["Piecek","Wiktor",""],["Kula","Przemysław",""],["Bardyszewski","Witold",""],["Piętka","Barbara",""],["Bobylev","Daniil",""],["Solnyshkov","Dmitry",""],["Malpuech","Guillaume",""],["Szczytko","Jacek",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 18:01:29 GMT"}],"updateDate":"2024-07-11","timestamp":1720548089000,"abstract":"  We create a one-dimensional photonic crystal with strong polarization\ndependence and tunable by an applied electric field. We accomplish this in a\nplanar microcavity by embedding a cholesteric liquid crystal (LC), which\nspontaneously forms a uniform lying helix (ULH). The applied voltage controls\nthe orientation of the LC molecules and, consequently, the strength of a\npolarization-dependent periodic potential. It leads to opening or closing of\nphotonic band gaps in the dispersion of the massive photons in the microcavity.\nIn addition, when the ULH structure possesses a molecular tilt, it induces a\nspin-orbit coupling between the lattice bands of different parity. This\ninterband spin-orbit coupling (ISOC) is analogous to optical activity and can\nbe treated as a synthetic non-Abelian gauge potential. Finally, we show that\ndoping the LC with dyes allows us to achieve lasing that inherits all the\nabove-mentioned tunable properties of LC microcavity, including dual and\ncircularly-polarized lasing.\n","subjects":["Physics/Optics","Condensed Matter/Soft Condensed Matter"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"aXzANFOSb5qf9YGxNC9IwW3RFKlwNhDVkquYNsS3zPM","pdfSize":"18692100"}
