{"id":"2407.10164","title":"LabelDistill: Label-guided Cross-modal Knowledge Distillation for\n  Camera-based 3D Object Detection","authors":"Sanmin Kim, Youngseok Kim, Sihwan Hwang, Hyeonjun Jeong and Dongsuk\n  Kum","authorsParsed":[["Kim","Sanmin",""],["Kim","Youngseok",""],["Hwang","Sihwan",""],["Jeong","Hyeonjun",""],["Kum","Dongsuk",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 11:18:00 GMT"}],"updateDate":"2024-07-16","timestamp":1720955880000,"abstract":"  Recent advancements in camera-based 3D object detection have introduced\ncross-modal knowledge distillation to bridge the performance gap with LiDAR 3D\ndetectors, leveraging the precise geometric information in LiDAR point clouds.\nHowever, existing cross-modal knowledge distillation methods tend to overlook\nthe inherent imperfections of LiDAR, such as the ambiguity of measurements on\ndistant or occluded objects, which should not be transferred to the image\ndetector. To mitigate these imperfections in LiDAR teacher, we propose a novel\nmethod that leverages aleatoric uncertainty-free features from ground truth\nlabels. In contrast to conventional label guidance approaches, we approximate\nthe inverse function of the teacher's head to effectively embed label inputs\ninto feature space. This approach provides additional accurate guidance\nalongside LiDAR teacher, thereby boosting the performance of the image\ndetector. Additionally, we introduce feature partitioning, which effectively\ntransfers knowledge from the teacher modality while preserving the distinctive\nfeatures of the student, thereby maximizing the potential of both modalities.\nExperimental results demonstrate that our approach improves mAP and NDS by 5.1\npoints and 4.9 points compared to the baseline model, proving the effectiveness\nof our approach. The code is available at\nhttps://github.com/sanmin0312/LabelDistill\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"DYhOzMr0_GE9iu_vKZudPghdGmLDFjPeilm1m-sxYd4","pdfSize":"10466385"}