{"id":"2407.16984","title":"scGHSOM: Hierarchical clustering and visualization of single-cell and\n  CRISPR data using growing hierarchical SOM","authors":"Shang-Jung Wen, Jia-Ming Chang and Fang Yu","authorsParsed":[["Wen","Shang-Jung",""],["Chang","Jia-Ming",""],["Yu","Fang",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 04:01:09 GMT"}],"updateDate":"2024-07-25","timestamp":1721793669000,"abstract":"  High-dimensional single-cell data poses significant challenges in identifying\nunderlying biological patterns due to the complexity and heterogeneity of\ncellular states. We propose a comprehensive gene-cell dependency visualization\nvia unsupervised clustering, Growing Hierarchical Self-Organizing Map (GHSOM),\nspecifically designed for analyzing high-dimensional single-cell data like\nsingle-cell sequencing and CRISPR screens. GHSOM is applied to cluster samples\nin a hierarchical structure such that the self-growth structure of clusters\nsatisfies the required variations between and within. We propose a novel\nSignificant Attributes Identification Algorithm to identify features that\ndistinguish clusters. This algorithm pinpoints attributes with minimal\nvariation within a cluster but substantial variation between clusters. These\nkey attributes can then be used for targeted data retrieval and downstream\nanalysis. Furthermore, we present two innovative visualization tools: Cluster\nFeature Map and Cluster Distribution Map. The Cluster Feature Map highlights\nthe distribution of specific features across the hierarchical structure of\nGHSOM clusters. This allows for rapid visual assessment of cluster uniqueness\nbased on chosen features. The Cluster Distribution Map depicts leaf clusters as\ncircles on the GHSOM grid, with circle size reflecting cluster data size and\ncolor customizable to visualize features like cell type or other attributes. We\napply our analysis to three single-cell datasets and one CRISPR dataset\n(cell-gene database) and evaluate clustering methods with internal and external\nCH and ARI scores. GHSOM performs well, being the best performer in internal\nevaluation (CH=4.2). In external evaluation, GHSOM has the third-best\nperformance of all methods.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Information Retrieval","Quantitative Biology/Genomics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"H59jXN1L89WtKcnKN1KvwkuxjdaLihSMSiuDTXAw6v8","pdfSize":"7250331","objectId":"0x16e87aeffe5582f5fc20c9fc23eb8581bd7b4ebf825972d3c6471954a1fbb2d2","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
