{"id":"2407.05255","title":"Estimation of the Area and Precipitation Associated with a Tropical\n  Cyclone Biparjoy by using Image Processing","authors":"Shikha Verma, Kuldeep Srivastava, Akhilesh Tiwari, Shekhar Verma","authorsParsed":[["Verma","Shikha",""],["Srivastava","Kuldeep",""],["Tiwari","Akhilesh",""],["Verma","Shekhar",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 04:41:27 GMT"}],"updateDate":"2024-07-09","timestamp":1720327287000,"abstract":"  The rainfall associated with Topical Cyclone(TC) contributes a major amount\nto the annual rainfall in India. Due to the limited research on the\nquantitative precipitation associated with Tropical Cyclones (TC), the\nprediction of the amount of precipitation and area that it may cover remains a\nchallenge. This paper proposes an approach to estimate the accumulated\nprecipitation and impact on affected area using Remote Sensing data. For this\nstudy, an instance of Extremely Severe Cyclonic Storm, Biparjoy that formed\nover the Arabian Sea and hit India in 2023 is considered in which we have used\nthe satellite images of IMERG-Late Run of Global Precipitation Measurement\n(GPM). Image processing techniques were employed to identify and extract\nprecipitation clusters linked to the cyclone. The results indicate that\nBiparjoy contributed a daily average rainfall of 53.14 mm/day across India and\nthe Arabian Sea, with the Indian boundary receiving 11.59 mm/day, covering an\nextensive 411.76 thousand square kilometers. The localized intensity and\nvariability observed in states like Gujarat, Rajasthan, Madhya Pradesh, and\nUttar Pradesh highlight the need for tailored response measures, emphasizing\nthe importance of further research to enhance predictive models and disaster\nreadiness, crucial for building resilience against the diverse impacts of\ntropical cyclones.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"qdND29lHmGR1iZv40B58sLeWrbSDknJUZq8lEp4-AKI","pdfSize":"4893414"}