{"id":"2407.15982","title":"Agile Minds, Innovative Solutions, and Industry-Academia Collaboration:\n  Lean R&D Meets Problem-Based Learning in Software Engineering Education","authors":"Lucas Romao, Marcos Kalinowski, Clarissa Barbosa, Allysson Allex\n  Ara\\'ujo, Simone D.J. Barbosa, Helio Lopes","authorsParsed":[["Romao","Lucas",""],["Kalinowski","Marcos",""],["Barbosa","Clarissa",""],["Araújo","Allysson Allex",""],["Barbosa","Simone D. J.",""],["Lopes","Helio",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 18:47:14 GMT"}],"updateDate":"2024-07-24","timestamp":1721674034000,"abstract":"  [Context] Software Engineering (SE) education constantly seeks to bridge the\ngap between academic knowledge and industry demands, with active learning\nmethods like Problem-Based Learning (PBL) gaining prominence. Despite these\nefforts, recent graduates struggle to align skills with industry needs.\nRecognizing the relevance of Industry-Academia Collaboration (IAC), Lean R&D\nhas emerged as a successful agile-based research and development approach,\nemphasizing business and software development synergy. [Goal] This paper aims\nto extend Lean R&D with PBL principles, evaluating its application in an\neducational program designed by ExACTa PUC- Rio for Americanas S.A., a large\nBrazilian retail company. [Method] The educational program engaged 40 part-time\nstudents receiving lectures and mentoring while working on real problems,\ncoordinators and mentors, and company stakeholders in industry projects.\nEmpirical evaluation, through a case study approach, utilized structured\nquestionnaires based on the Technology Acceptance Model (TAM). [Results]\nStakeholders were satisfied with Lean R&D PBL for problem-solving. Students\nreported increased knowledge proficiency and perceived working on real problems\nas contributing the most to their learning. [Conclusion] This research\ncontributes to academia by sharing Lean R&D PBL as an educational IAC approach.\nFor industry, we discuss the implementation of this proposal in an IAC program\nthat promotes workforce skill development and innovative solutions.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"QMQNfsGe7yBGgOATXJE0tJwwtdWvZh-46oBgG0RFLvU","pdfSize":"995680"}