{"id":"2407.12952","title":"Denoising Diffusions in Latent Space for Medical Image Segmentation","authors":"Fahim Ahmed Zaman, Mathews Jacob, Amanda Chang, Kan Liu, Milan Sonka\n  and Xiaodong Wu","authorsParsed":[["Zaman","Fahim Ahmed",""],["Jacob","Mathews",""],["Chang","Amanda",""],["Liu","Kan",""],["Sonka","Milan",""],["Wu","Xiaodong",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 18:44:38 GMT"}],"updateDate":"2024-07-19","timestamp":1721241878000,"abstract":"  Diffusion models (DPMs) have demonstrated remarkable performance in image\ngeneration, often times outperforming other generative models. Since their\nintroduction, the powerful noise-to-image denoising pipeline has been extended\nto various discriminative tasks, including image segmentation. In case of\nmedical imaging, often times the images are large 3D scans, where segmenting\none image using DPMs become extremely inefficient due to large memory\nconsumption and time consuming iterative sampling process. In this work, we\npropose a novel conditional generative modeling framework (LDSeg) that performs\ndiffusion in latent space for medical image segmentation. Our proposed\nframework leverages the learned inherent low-dimensional latent distribution of\nthe target object shapes and source image embeddings. The conditional diffusion\nin latent space not only ensures accurate n-D image segmentation for\nmulti-label objects, but also mitigates the major underlying problems of the\ntraditional DPM based segmentation: (1) large memory consumption, (2) time\nconsuming sampling process and (3) unnatural noise injection in forward/reverse\nprocess. LDSeg achieved state-of-the-art segmentation accuracy on three medical\nimage datasets with different imaging modalities. Furthermore, we show that our\nproposed model is significantly more robust to noises, compared to the\ntraditional deterministic segmentation models, which can be potential in\nsolving the domain shift problems in the medical imaging domain. Codes are\navailable at: https://github.com/LDSeg/LDSeg.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"E5mSBnXk-BtE8K4PvZwcSw4lbsk6iik0jooBE2XSY1M","pdfSize":"1355200","objectId":"0xd91e7e90eb1b7ac0d1620c39a1ba6c72880cd3eccd1914cb3c550709c58effa1","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
