{"id":"2407.00421","title":"Multi-wavelength switchable single-frequency hyper Raman microlasers","authors":"Chuntao Li, Ni Yao, Jintian Lin, Renhong Gao, Jianglin Guan, Guanghui\n  Zhao, Minghui Li, Min Wang, Lingling Qiao, Ya Cheng","authorsParsed":[["Li","Chuntao",""],["Yao","Ni",""],["Lin","Jintian",""],["Gao","Renhong",""],["Guan","Jianglin",""],["Zhao","Guanghui",""],["Li","Minghui",""],["Wang","Min",""],["Qiao","Lingling",""],["Cheng","Ya",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 12:10:33 GMT"}],"updateDate":"2024-07-02","timestamp":1719663033000,"abstract":"  Multi-wavelength switchable single-frequency microlasers in a broad spectral\nrange are highly desirable for integrated photonic applications due to their\ndynamic switching functionality, narrow linewidth, and high\nside-mode-suppression-ratio (SMSR). Here, a strategy based on highly efficient\nsuccessive excitation of different stimulated multi-photon hyper-Raman\nscattering (SMPHRS) processes is proposed to generate multi-wavelength\nswitchable single-frequency hyper-Raman microlasers. This is achieved through\ncollective precise dispersion management for arranging excitation wavelengths\nto trigger different phase-matched SMPHRS processes in order, mode-hopping-free\ntuning of the pump wavelength within a wide range of 0.75 nm by leveraging\nstrong thermo-optical broadening of ultra-high Q modes, and simultaneously\nsuppressing harmonics generation in a lithium niobate microcavity with high\nsecond-order nonlinearity. As a result, under continuous-wave laser pump at a\nlow level of only 3.9 mW, SMPHRS processes from two- to five-photons emerged\nstep by step and almost depleted previously generated multi-photon Raman\nsignal. Consequently, four-wavelength dynamically switchable single-mode lasing\nfrom near infrared (857 nm) to ultraviolet (350 nm) spanning beyond the record\nrange (~500 nm) with high SMSRs >35 dB is reported.\n","subjects":["Physics/Optics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"eDyDSsimXyLI6kuqyeI463aeZalW-yEg2G7dDqq-YS0","pdfSize":"1095249"}