{"id":"2407.12392","title":"Influence of different mutual friction models on two-way coupled\n  quantized vortices and normal fluid in superfluid $^4$He","authors":"Hiromichi Kobayashi, Satoshi Yui, Makoto Tsubota","authorsParsed":[["Kobayashi","Hiromichi",""],["Yui","Satoshi",""],["Tsubota","Makoto",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 08:12:46 GMT"}],"updateDate":"2024-07-18","timestamp":1721203966000,"abstract":"  We study the influence of two mutual friction models on quantized vortices\nand normal fluid using two-way coupled simulations of superfluid $^4$He. The\nnormal fluid is affected by quantized vortices via mutual friction. A previous\nstudy [Y. Tang, et al. Nat. Commun. 14, 2941 (2023)] compared the time\nevolutions of the vortex ring radius and determined that the self-consistent\ntwo-way coupled mutual friction (S2W) model yielded better agreement with the\nexperimental results than the two-way coupled mutual friction (2W) model whose\nmodel parameters were determined through experiments with rotating superfluid\nhelium. In this study, we compare the two models in more detail in terms of the\nquantized vortex ring propagation, reconnection, and thermal counterflow. We\nfound that the S2W model exhibits better results than the 2W model on the\nmicroscopic scale near a quantized vortex, such as during quantized vortex ring\npropagation and reconnection, although the S2W model requires a higher spatial\nresolution. For complex flows such as a thermal counterflow, the 2W model can\nbe applied even to a low-resolution flow while maintaining the anisotropic\nnormal fluid velocity fluctuations. In contrast, the 2W model predicts lower\nnormal fluid velocity fluctuations than the S2W model. The two models show\nprobability density functions with $- 3$ power-law tails for the normal fluid\nvelocity fluctuations.\n","subjects":["Condensed Matter/Other Condensed Matter"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"WdDdwaGgsn76ojO-PZXVLiXUz4WsjCrFSVBgFfnLoqw","pdfSize":"2553488","objectId":"0xdd2bda9dbbc3c49802d922576c111322d1927c6b461fc6468527394239b14484","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
