{"id":"2407.12263","title":"A difference-free conservative phase-field lattice Boltzmann method","authors":"Chunheng Zhao, Saumil Patel, Taehun Lee","authorsParsed":[["Zhao","Chunheng",""],["Patel","Saumil",""],["Lee","Taehun",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 02:18:28 GMT"}],"updateDate":"2024-07-18","timestamp":1721182708000,"abstract":"  We propose an innovative difference-free scheme that combines the one-fluid\nlattice Boltzmann method (lBM) with the conservative phase-field (CPF) lBM to\neffectively solve large-scale two-phase fluid flow problems. The\ndifference-free scheme enables the derivation of the derivative of the order\nparameter and the normal vector through the moments of the particle\ndistribution function (PDF). We further incorporate the surface tension force\nin a continuous surface stress form into the momentum equations by modifying\nthe equilibrium PDF to eliminate the divergence operator. Consequently, the\nentire computation process, executed without any inter-grid finite difference\nformulation, demonstrates improved efficiency, making it an ideal choice for\nhigh-performance computing applications. We conduct simulations of a single\nstatic droplet to evaluate the intensity of spurious currents and assess the\naccuracy of the scheme. We then introduce the density or viscosity ratio and\napply an external body force to model the Rayleigh-Taylor instability and the\nbehavior of a single rising bubble, respectively. Finally, we employ our method\nto study the phenomenon of a single bubble breaking up in a Taylor-Green\nvortex. The comparison between the difference-free scheme and the finite\ndifference method demonstrates the scheme's capability to yield accurate\nresults. Furthermore, based on the performance evaluation, the current scheme\nexhibits an impressive $47\\% $ increase in efficiency compared to the previous\nmethod.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"QQrcTfjj5Q841PhiOFaCW4y9EMexOCvzZhu5zdeGev8","pdfSize":"5351767"}