{"id":"2407.06881","title":"Efficient Stochastic Routing in Path-Centric Uncertain Road Networks --\n  Extended Version","authors":"Chenjuan Guo, Ronghui Xu, Bin Yang, Ye Yuan, Tung Kieu, Yan Zhao and\n  Christian S. Jensen","authorsParsed":[["Guo","Chenjuan",""],["Xu","Ronghui",""],["Yang","Bin",""],["Yuan","Ye",""],["Kieu","Tung",""],["Zhao","Yan",""],["Jensen","Christian S.",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 14:09:51 GMT"}],"updateDate":"2024-07-10","timestamp":1720534191000,"abstract":"  The availability of massive vehicle trajectory data enables the modeling of\nroad-network constrained movement as travel-cost distributions rather than just\nsingle-valued costs, thereby capturing the inherent uncertainty of movement and\nenabling improved routing quality. Thus, stochastic routing has been studied\nextensively in the edge-centric model, where such costs are assigned to the\nedges in a graph representation of a road network. However, as this model still\ndisregards important information in trajectories and fails to capture\ndependencies among cost distributions, a path-centric model, where costs are\nassigned to paths, has been proposed that captures dependencies better and\nprovides an improved foundation for routing. Unfortunately, when applied in\nthis model, existing routing algorithms are inefficient due to two shortcomings\nthat we eliminate. First, when exploring candidate paths, existing algorithms\nonly consider the costs of candidate paths from the source to intermediate\nvertices, while disregarding the costs of travel from the intermediate vertices\nto the destination, causing many non-competitive paths to be explored. We\npropose two heuristics for estimating the cost from an intermediate vertex to\nthe destination, thus improving routing efficiency. Second, the edge-centric\nmodel relies on stochastic dominance-based pruning to improve efficiency. This\npruning assumes that costs are independent and is therefore inapplicable in the\npath-centric model that takes dependencies into account. We introduce a notion\nof virtual path that effectively enables stochastic dominance-based pruning in\nthe path-based model, thus further improving efficiency. Empirical studies\nusing two real-world trajectory sets offer insight into the properties of the\nproposed solution, indicating that it enables efficient stochastic routing in\nthe path-centric model.\n","subjects":["Computing Research Repository/Data Structures and Algorithms"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"6doGcriuD9iUGC-eNk2sOrRCVJFnQ9LVkEQ0HVLYcl4","pdfSize":"3794793"}