{"id":"2407.04204","title":"The Gaia-ESO Survey DR5.1 and Gaia DR3 GSP-Spec: a comparative analysis","authors":"M. Van der Swaelmen, C. Viscasillas Vazquez, L. Magrini, A.\n  Recio-Blanco, P. A. Palicio, C. Worley, A. Vallenari, L. Spina, P.\n  Fran\\c{c}ois, G. Tautvai\\v{s}iene, G. G. Sacco, S. Randich, P. de Laverny","authorsParsed":[["Van der Swaelmen","M.",""],["Vazquez","C. Viscasillas",""],["Magrini","L.",""],["Recio-Blanco","A.",""],["Palicio","P. A.",""],["Worley","C.",""],["Vallenari","A.",""],["Spina","L.",""],["François","P.",""],["Tautvaišiene","G.",""],["Sacco","G. G.",""],["Randich","S.",""],["de Laverny","P.",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 01:02:42 GMT"}],"updateDate":"2024-07-08","timestamp":1720141362000,"abstract":"  (abridged) The third data release of Gaia, has provided stellar parameters,\nmetallicity [M/H], [{\\alpha}/Fe], individual abundances, broadening parameter\nfrom its RVS spectra for about 5.6 million objects thanks to the GSP-Spec\nmodule. The catalogue publishes the radial velocity of 33 million sources. We\ntook advantage of the intersections between Gaia RVS and Gaia-ESO to compare\ntheir stellar parameters, abundances and radial and rotational velocities. We\naimed at verifying the overall agreement between the two datasets, considering\nthe various calibrations and the quality-control flag system suggested for the\nGaia GSP-Spec parameters. For the targets in common between Gaia RVS and\nGaia-ESO, we performed several statistical checks on the distributions of their\nstellar parameters, abundances and velocities of targets in common. For the\nGaia surface gravity and metallicity we considered both the uncalibrated and\ncalibrated values. We find an excellent agreement between the Gaia and Gaia-ESO\nradial velocities given the uncertainties affecting each dataset. Less than 25\nof ~2100 Gaia-ESO spectroscopic binaries are flagged as non-single stars by\nGaia. The temperature scales are in good agreement. The calibrated GSP-Spec\ngravity should be preferred. We note that the quality (accuracy, precision) of\nthe GSP-Spec parameters degrades quickly for objects fainter than G~11. We find\nthat the somewhat imprecise GSP-Spec abundances due to its medium-resolution\nspectroscopy over a short wavelength window and the faint G regime of the\nsample under study can be counterbalanced by working with averaged quantities.\nWe studied some properties of the open-cluster population: our combined sample\ntraces very well the radial [Fe/H] and [Ca/Fe] gradients, the age-metallicity\nrelations in different radial regions, and it places the clusters in the thin\ndisc.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"-0JuExNEvMRJPGgvYCKoGCkWfcyr3PReFRYGh9ZEhpM","pdfSize":"5328657"}
