{"id":"2407.00272","title":"Theory of Refraction, Ray-Wave Tilt, Hidden Momentum, and Apparent\n  Topological Phases in Isotropy-Broken Materials based on Electromagnetism of\n  Moving Media","authors":"Maxim Durach","authorsParsed":[["Durach","Maxim",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 01:24:48 GMT"}],"updateDate":"2024-07-02","timestamp":1719624288000,"abstract":"  One of the problems of physics arguably greater in stature than even\nmathematical Hilberts problems is the mysterious nature of electromagnetic\nmomentum in materials. In this paper we show that the difference between the\nMinkowski and Abraham momenta, which is composed of the Roentgen and Shockley\nhidden momenta, is directly related to the phenomenon of refraction and the\ntilt of rays from the wavefront propagation direction. We demonstrate that\nindividual electromagnetic waves with non-unit indices of refraction n appear\nas quasistatic high-k waves to an observer in the proper frames of the waves.\nWhen Lorentz transformed into the material rest frames these high-k waves are\nFresnel-Fizeau dragged from rest to their phase velocities and acquire\nlongitudinal hidden momentum and related refractive properties. On the material\nlevel all electromagnetic waves belong to Fresnel wave surfaces topologically\nclassified according to hyperbolic phases by Durach and determined from the\nelectromagnetic material parameters. To moving observers, material parameters\nappear modified, which leads not only to the alterations of Fresnel wave\nsurfaces, but even the topological classes of the materials may appear\ndifferently in moving frames. We discuss the phenomenon of the electromagnetic\nmomentum tilt, defined as non-zero angle between Abraham and Minkowski momenta\nor equivalently between the rays and the wavefront propagation direction. We\nshow that momentum tilt is only possible in isotropy-broken media, where E and\nH fields can be longitudinally polarized in presence of electric and magnetic\nbound charge waves. The momentum tilt can be understood as differential\naberration of rays and waves when observed in material rest frame.\n","subjects":["Physics/Optics","Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"PJecgs1bAMr_D97n6eJ7om1jFQ_5lLspVAkhQ-cOi9w","pdfSize":"1411572"}