{"id":"2407.01783","title":"Preconditioning of the generalized Stokes problem arising from the\n  approximation of the time-dependent Navier-Stokes equations","authors":"Melvin Creff and Jean-Luc Guermond","authorsParsed":[["Creff","Melvin",""],["Guermond","Jean-Luc",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 20:21:33 GMT"}],"updateDate":"2024-07-03","timestamp":1719865293000,"abstract":"  The paper considers standard iterative methods for solving the generalized\nStokes problem arising from the time and space approximation of the\ntime-dependent incompressible Navier-Stokes equations. Various preconditioning\ntechniques are considered (Cahouet&Chabard and augmented Lagrangian), and one\ninvestigates whether these methods can compete with traditional\npressure-correction and velocity-correction methods in terms of CPU time per\ndegree of freedom and per time step. Numerical tests on fine unstructured\nmeshes (68 millions degrees of freedoms) demonstrate convergence rates that are\nindependent of the mesh size and improve with the Reynolds number. Three\nconclusions are drawn from the paper: (1) Although very good parallel\nscalability is observed for the augmented Lagrangian method, thorough tests on\nlarge problems reveal that the overall CPU time per degree of freedom and per\ntime step is best for the standard Cahouet&Chabar preconditioner. (2) Whether\nsolving the pressure Schur complement problem or solving the full couple system\nat once does not make any significant difference in term of CPU time per degree\nof freedom and per time step. (3) All the methods tested in the paper, whether\nmatrix-free or not, are on average 30 times slower than traditional\npressure-correction and velocity-correction methods. Hence, although all these\nmethods are very efficient for solving steady state problems, they are not yet\ncompetitive for solving time-dependent problems.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Qx5bIJl5m4ZXuITE_Lb-yPy3bcOem71zh9cgfc1c_jA","pdfSize":"650968"}