{"id":"2407.12284","title":"Blue supergiants as a progenitor of intermediate-luminosity red\n  transients","authors":"Takashi J. Moriya, Athira Menon","authorsParsed":[["Moriya","Takashi J.",""],["Menon","Athira",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 03:12:01 GMT"},{"version":"v2","created":"Wed, 18 Sep 2024 01:58:00 GMT"}],"updateDate":"2024-09-19","timestamp":1721185921000,"abstract":"  The current perspective about the explosions of massive hydrogen-rich blue\nsupergiants is that they resemble SN 1987A. These so-called peculiar Type II\nsupernovae, however, are one of the rarest types of supernovae and may not\nhence be the fate of all blue supergiants. In this work, we explore other\nexplosion scenarios for blue supergiants. We create synthetic light curves from\nthe explosions of blue supergiant models born from binary mergers, over a range\nof explosion energies and 56Ni masses. We find that blue supergiant explosions\nmay also lead to intermediate-luminosity red transients. We thus identify two\ncategories of supernovae possible from blue supergiant explosions: those with\nhigh 56Ni masses (> ~ 0.01 Msun) result in slow-rising, dome-shaped light\ncurves like SN 1987A. Lower 56Ni masses result in low-luminosity, short-plateau\nlight curves resembling some intermediate-luminosity red transients and Type II\nsupernovae like SN 2008bp, which are possible from the explosions of compact\nblue supergiants and not from the far more extended red supergiants. Our\nresults indicate that blue supergiant explosions are more diverse than SN\n1987A-like events and may be hidden among different kinds of transients,\nexplaining the possible discrepancies between the expected fraction of blue\nsupergiants born from binary mergers and the observed fraction of SN 1987A-like\nsupernovae.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"vLbvHFLBXvCw-fzcImR184BHo2rPJeXTYeTwIliCCL0","pdfSize":"1267533"}