{"id":"2407.05443","title":"Imaging reconstruction method on X-ray data of CMOS polarimeter combined\n  with coded aperture","authors":"Tsubasa Tamba, Hirokazu Odaka, Taihei Watanabe, Toshiya Iwata, Tomoaki\n  Kasuga, Atsushi Tanimoto, Satoshi Takashima, Masahiro Ichihashi, Hiromasa\n  Suzuki, Aya Bamba","authorsParsed":[["Tamba","Tsubasa",""],["Odaka","Hirokazu",""],["Watanabe","Taihei",""],["Iwata","Toshiya",""],["Kasuga","Tomoaki",""],["Tanimoto","Atsushi",""],["Takashima","Satoshi",""],["Ichihashi","Masahiro",""],["Suzuki","Hiromasa",""],["Bamba","Aya",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 17:10:31 GMT"}],"updateDate":"2024-07-09","timestamp":1720372231000,"abstract":"  X-ray polarization is a powerful tool for unveiling the anisotropic\ncharacteristics of high-energy celestial objects. We present a novel imaging\nreconstruction method designed for hard X-ray polarimeters employing a Si CMOS\nsensor and coded apertures, which function as a photoelectron tracker and\nimaging optics, respectively. Faced with challenges posed by substantial\nartifacts and background noise in the coded aperture imaging associated with\nthe conventional balanced correlation method, we adopt the\nExpectation-Maximization (EM) algorithm as the foundation of our imaging\nreconstruction method. The newly developed imaging reconstruction method is\nvalidated with imaging polarimetry and a series of X-ray beam experiments. The\nmethod demonstrates the capability to accurately reproduce an extended source\ncomprising multiple segments with distinct polarization degrees. Comparative\nanalysis exhibits a significant enhancement in imaging reconstruction accuracy\ncompared to the balanced correlation method, with the background noise levels\nreduced to 17%. The outcomes of this study enhance the feasibility of Cube-Sat\nimaging polarimetry missions in the hard X-ray band, as the combination of Si\nCMOS sensors and coded apertures is a promising approach for realizing it.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Physics/Instrumentation and Detectors"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"EATZD-ZLNkTSXRTNJiwtyKrchFY-iet8Muat4VFc_7g","pdfSize":"8137901"}