{"id":"2407.19747","title":"Ultrafast bursts of tailored spatiotemporal vortex pulses","authors":"Xin Liu, Chunhao Liang, Qian Cao, Yangjian Cai, Qiwen Zhan","authorsParsed":[["Liu","Xin",""],["Liang","Chunhao",""],["Cao","Qian",""],["Cai","Yangjian",""],["Zhan","Qiwen",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 07:18:31 GMT"}],"updateDate":"2024-07-30","timestamp":1722237511000,"abstract":"  Orbital angular momentums (OAMs) of light can be categorized into\nlongitudinal OAM (L-OAM) and transverse OAM (T-OAM). Light carrying\ntime-varying L-OAM, known as self-torqued light, was recently discovered during\nharmonic generation and has been extensively developed within the context of\noptical frequency combs (OFCs). Meanwhile, ultrafast bursts of optical pulses,\nanalogous to OFCs, are sought for various light-matter interaction,\nspectroscopic and nonlinear applications. However, achieving transiently\nswitchable T-OAM of light on request, namely spatiotemporal vortex pulse\nbursts, with independently controlled spatiotemporal profile of each comb\ntooth, remain unrealized thus far. In this work, the experimental generation of\nspatiotemporal vortex bursts featured with controllable time-dependent\ncharacteristics is reported. The resultant bursts comprised of spatiotemporal\noptical vortex comb teeth have picosecond timescale switchable T-OAMs with\ndefined arrangement, manifesting as spatiotemporal torquing of light. We also\nshow ultrafast control of T-OAM chirality, yielding pulse bursts with staggered\nazimuthal local momentum density, resembling K\\'arm\\'an vortex streets. This\napproach enables the tailoring of more intricate spatiotemporal wavepacket\nbursts, such as high-purity modes variation in both radial and azimuthal\nquantum numbers of spatiotemporal Laguerre-Gaussian wavepackets over time,\nwhich may facilitate a host of novel applications in ultrafast light-mater\ninteractions, high-dimensional quantum entanglements, space-time photonic\ntopologies as well as spatiotemporal metrology and photography.\n","subjects":["Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"U_rZ3ZWqCQ6JPTbrGj0BPczFo8jM7GjM-YQhBw6H24o","pdfSize":"2010532"}