{"id":"2407.06406","title":"Unveiling mussel plaque core ductility: the role of pore distribution\n  and hierarchical structure","authors":"Yulan Lyu, Mengting Tan, Yong Pang, Wei Sun, Shuguang Li, Tao Liu","authorsParsed":[["Lyu","Yulan",""],["Tan","Mengting",""],["Pang","Yong",""],["Sun","Wei",""],["Li","Shuguang",""],["Liu","Tao",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 21:26:29 GMT"}],"updateDate":"2024-07-10","timestamp":1720473989000,"abstract":"  The mussel thread-plaque system exhibits strong adhesion and high ductility,\nallowing it to adhere to various surfaces. While the microstructure of plaques\nhas been thoroughly studied, the effect of their unique porous structure on\nductility remains unclear. This study firstly investigated the porous structure\nof mussel plaque cores using scanning electron microscopy (SEM).\nTwo-dimensional (2D) porous representative volume elements (RVEs) with scaled\ndistribution parameters were generated, and the calibrated phase-field\nmodelling method was applied to analyse the effect of the pore distribution and\nmulti-scale porous structure on the failure mechanism of porous RVEs. The SEM\nanalysis revealed that large-scale pores exhibited a lognormal size\ndistribution and a uniform spatial distribution. Simulations showed that\nincreasing the normalised mean radius value of the large-scale pore\ndistribution can statistically lead to a decreasing trend in ductility,\nstrength and strain energy, but cannot solely determine their values. The\ninteraction between pores can lead to two different failure modes under the\nsame pore distribution: progressive failure mode and sudden failure mode.\nAdditionally, the hierarchical structure of multi-scale porous RVEs can further\nincrease ductility by 40%-60% compared to single-scale porous RVEs by reducing\nstiffness, highlighting the hierarchical structure could be another key factor\ncontributing to the high ductility. These findings deepen our understanding of\nhow the pore distribution and multi-scale porous structure in mussel plaques\ncontribute to their high ductility and affect other mechanical properties,\nproviding valuable insights for the future design of highly ductile biomimetic\nmaterials.\n","subjects":["Physics/Applied Physics","Condensed Matter/Soft Condensed Matter","Physics/Biological Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"iIHEWfo_bNOlZ-5__guDgBeHti_GBfnVklA2yx7KmZk","pdfSize":"24690593"}
