{"id":"2407.07967","title":"The Lowell Observatory Solar Telescope: A fiber feed into the EXtreme\n  PREcision Spectrometer","authors":"Joe Llama, Lily L. Zhao, John M. Brewer, Andrew Szymkowiak, Debra A.\n  Fischer, Michael Collins, Jake Tiegs, Frank Cornelius","authorsParsed":[["Llama","Joe",""],["Zhao","Lily L.",""],["Brewer","John M.",""],["Szymkowiak","Andrew",""],["Fischer","Debra A.",""],["Collins","Michael",""],["Tiegs","Jake",""],["Cornelius","Frank",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 18:06:33 GMT"}],"updateDate":"2024-07-12","timestamp":1720634793000,"abstract":"  The signal induced by a temperate, terrestrial planet orbiting a Sun-like\nstar is an order of magnitude smaller than the host stars' intrinsic\nvariability. Understanding stellar activity is, therefore, a fundamental\nobstacle in confirming the smallest exoplanets. We present the Lowell\nObservatory Solar Telescope (LOST), a solar feed for the EXtreme PREcision\nSpectrometer (EXPRES) at the 4.3-m Lowell Discovery Telescope (LDT). EXPRES is\none of the newest high-resolution spectrographs that accurately measure extreme\nradial velocity. With LOST/EXPRES, we observe disk-integrated sunlight\nautonomously throughout the day. In clear conditions, we achieve a ~137,500\noptical spectrum of the Sun with a signal-to-noise of 500 in ~150s. Data is\nreduced using the standard EXPRES pipeline with minimal modification to ensure\nthe data are comparable to the observations of other stars with the LDT. During\nthe first three years of operation, we find a daily RMS of 71 cm/s.\nAdditionally, having two EPRV spectrometers located in Arizona gives us an\nunprecedented opportunity to benchmark the performance of these planet-finders.\nWe find a RMS of just 55 cm/s when comparing data taken simultaneously with\nEXPRES and NEID.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7yDh3SknboAgJGYqmGUjKDjsLV-193c3f02llxq3DOc","pdfSize":"9485826"}