{"id":"2407.10506","title":"Coherence of a non-equilibrium polariton condensate across the\n  interaction-mediated phase transition","authors":"P. Comaron, E. Estrecho, M. Wurdack, M. Pieczarka, M. Steger, D. W.\n  Snoke, K. West, L. N. Pfeiffer, A. G. Truscott, M. Matuszewski, M. Szymanska,\n  and E. A. Ostrovskaya","authorsParsed":[["Comaron","P.",""],["Estrecho","E.",""],["Wurdack","M.",""],["Pieczarka","M.",""],["Steger","M.",""],["Snoke","D. W.",""],["West","K.",""],["Pfeiffer","L. N.",""],["Truscott","A. G.",""],["Matuszewski","M.",""],["Szymanska","M.",""],["Ostrovskaya","E. A.",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 07:57:14 GMT"}],"updateDate":"2024-07-16","timestamp":1721030234000,"abstract":"  The emergence of spatial coherence in a confined two-dimensional Bose gas of\nexciton-polaritons with tuneable interactions offers a unique opportunity to\nexplore the role of interactions in a phase transition in a driven-dissipative\nquantum system, where both the phase transition and thermalisation are mediated\nby interactions. We investigate, experimentally and numerically, the phase\ncorrelations and steady-state properties of the gas over a wide range of\ninteraction strengths by varying the photonic/excitonic fraction of the\npolaritons and their density. We find that the first order spatial coherence\nfunction exhibits algebraic decay consistent with the\nBerezinskii-Kosterlitz-Thouless (BKT) phase transition. Surprisingly, the\nexponent of the algebraic decay is inversely proportional to the coherent\ndensity of polaritons, in analogy to equilibrium superfluids above the BKT\ntransition, but with a different proportionality constant. Our work paves the\nway for future investigations of the phenomenon of phase transitions and\nsuperfluidity in a driven-dissipative setting\n","subjects":["Condensed Matter/Quantum Gases","Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Other Condensed Matter"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"xXOqEz1bRS-KYXvkO7d5RNJiUVi7OnSFmGLbhXMNOvI","pdfSize":"4402983"}