{"id":"2407.19902","title":"A Differential Dynamic Programming Framework for Inverse Reinforcement\n  Learning","authors":"Kun Cao, Xinhang Xu, Wanxin Jin, Karl H. Johansson, Lihua Xie","authorsParsed":[["Cao","Kun",""],["Xu","Xinhang",""],["Jin","Wanxin",""],["Johansson","Karl H.",""],["Xie","Lihua",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 11:26:17 GMT"}],"updateDate":"2024-07-30","timestamp":1722252377000,"abstract":"  A differential dynamic programming (DDP)-based framework for inverse\nreinforcement learning (IRL) is introduced to recover the parameters in the\ncost function, system dynamics, and constraints from demonstrations. Different\nfrom existing work, where DDP was used for the inner forward problem with\ninequality constraints, our proposed framework uses it for efficient\ncomputation of the gradient required in the outer inverse problem with equality\nand inequality constraints. The equivalence between the proposed method and\nexisting methods based on Pontryagin's Maximum Principle (PMP) is established.\nMore importantly, using this DDP-based IRL with an open-loop loss function, a\nclosed-loop IRL framework is presented. In this framework, a loss function is\nproposed to capture the closed-loop nature of demonstrations. It is shown to be\nbetter than the commonly used open-loop loss function. We show that the\nclosed-loop IRL framework reduces to a constrained inverse optimal control\nproblem under certain assumptions. Under these assumptions and a rank\ncondition, it is proven that the learning parameters can be recovered from the\ndemonstration data. The proposed framework is extensively evaluated through\nfour numerical robot examples and one real-world quadrotor system. The\nexperiments validate the theoretical results and illustrate the practical\nrelevance of the approach.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control","Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"WNYY60cQLNMZrlKzmVCvW0MsDAYOLXuKBrB2Zxdd-OE","pdfSize":"8781836","objectId":"0x864ff0057232a4e5b15351009545216e7c3f297c2bb409026f9648bd1413db21","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
