{"id":"2407.21028","title":"Antibody DomainBed: Out-of-Distribution Generalization in Therapeutic\n  Protein Design","authors":"Nata\\v{s}a Tagasovska, Ji Won Park, Matthieu Kirchmeyer, Nathan C.\n  Frey, Andrew Martin Watkins, Aya Abdelsalam Ismail, Arian Rokkum Jamasb,\n  Edith Lee, Tyler Bryson, Stephen Ra, Kyunghyun Cho","authorsParsed":[["Tagasovska","Nataša",""],["Park","Ji Won",""],["Kirchmeyer","Matthieu",""],["Frey","Nathan C.",""],["Watkins","Andrew Martin",""],["Ismail","Aya Abdelsalam",""],["Jamasb","Arian Rokkum",""],["Lee","Edith",""],["Bryson","Tyler",""],["Ra","Stephen",""],["Cho","Kyunghyun",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 09:46:25 GMT"}],"updateDate":"2024-08-01","timestamp":1721036785000,"abstract":"  Machine learning (ML) has demonstrated significant promise in accelerating\ndrug design. Active ML-guided optimization of therapeutic molecules typically\nrelies on a surrogate model predicting the target property of interest. The\nmodel predictions are used to determine which designs to evaluate in the lab,\nand the model is updated on the new measurements to inform the next cycle of\ndecisions. A key challenge is that the experimental feedback from each cycle\ninspires changes in the candidate proposal or experimental protocol for the\nnext cycle, which lead to distribution shifts. To promote robustness to these\nshifts, we must account for them explicitly in the model training. We apply\ndomain generalization (DG) methods to classify the stability of interactions\nbetween an antibody and antigen across five domains defined by design cycles.\nOur results suggest that foundational models and ensembling improve predictive\nperformance on out-of-distribution domains. We publicly release our codebase\nextending the DG benchmark ``DomainBed,'' and the associated dataset of\nantibody sequences and structures emulating distribution shifts across design\ncycles.\n","subjects":["Quantitative Biology/Biomolecules","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"B_w32K5-SIFrgFBrNzbN_dU8HcxnYiIyiw4Y8lj1d7Y","pdfSize":"8977367"}