{"id":"2407.14865","title":"An Explainable Fast Deep Neural Network for Emotion Recognition","authors":"Francesco Di Luzio, Antonello Rosato, Massimo Panella","authorsParsed":[["Di Luzio","Francesco",""],["Rosato","Antonello",""],["Panella","Massimo",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 12:59:08 GMT"}],"updateDate":"2024-07-23","timestamp":1721480348000,"abstract":"  In the context of artificial intelligence, the inherent human attribute of\nengaging in logical reasoning to facilitate decision-making is mirrored by the\nconcept of explainability, which pertains to the ability of a model to provide\na clear and interpretable account of how it arrived at a particular outcome.\nThis study explores explainability techniques for binary deep neural\narchitectures in the framework of emotion classification through video\nanalysis. We investigate the optimization of input features to binary\nclassifiers for emotion recognition, with face landmarks detection using an\nimproved version of the Integrated Gradients explainability method. The main\ncontribution of this paper consists in the employment of an innovative\nexplainable artificial intelligence algorithm to understand the crucial facial\nlandmarks movements during emotional feeling, using this information also for\nimproving the performances of deep learning-based emotion classifiers. By means\nof explainability, we can optimize the number and the position of the facial\nlandmarks used as input features for facial emotion recognition, lowering the\nimpact of noisy landmarks and thus increasing the accuracy of the developed\nmodels. In order to test the effectiveness of the proposed approach, we\nconsidered a set of deep binary models for emotion classification trained\ninitially with a complete set of facial landmarks, which are progressively\nreduced based on a suitable optimization procedure. The obtained results prove\nthe robustness of the proposed explainable approach in terms of understanding\nthe relevance of the different facial points for the different emotions, also\nimproving the classification accuracy and diminishing the computational cost.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"e3i5S7aiZ9lPhu5vWPrAkXToGyRZKGr_8NG3fsg2CqQ","pdfSize":"6796496","objectId":"0xb2e35442b412af23e4296cce90a6da2cb481ac35136a2d690b5a65322a107001","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
