{"id":"2407.03424","title":"Supernova Shocks Cannot Explain the Inflated State of Hypervelocity\n  Runaways from White Dwarf Binaries","authors":"Aakash Bhat, Evan B. Bauer, R\\\"udiger Pakmor, Ken J. Shen, Ilaria\n  Caiazzo, Abinaya Swaruba Rajamuthukumar, Kareem El-Badry, Wolfgang E.\n  Kerzendorf","authorsParsed":[["Bhat","Aakash",""],["Bauer","Evan B.",""],["Pakmor","Rüdiger",""],["Shen","Ken J.",""],["Caiazzo","Ilaria",""],["Rajamuthukumar","Abinaya Swaruba",""],["El-Badry","Kareem",""],["Kerzendorf","Wolfgang E.",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 18:06:21 GMT"}],"updateDate":"2024-07-08","timestamp":1720029981000,"abstract":"  Recent observations have found a growing number of hypervelocity stars with\nspeeds of $\\approx 1500-2500\\,$km\\,s$^{-1}$ which could have only been produced\nthrough thermonuclear supernovae in white dwarf binaries. Most of the observed\nhypervelocity runaways in this class display a surprising inflated structure:\ntheir current radii are roughly an order of magnitude greater than they would\nhave been as white dwarfs filling their Roche lobe. While many simulations\nexist studying the dynamical phase leading to supernova detonation in these\nsystems, no detailed calculations of the long-term structure of the runaways\nhave yet been performed. We use an existing \\textsc{Arepo} hydrodynamical\nsimulation of a supernova in a white dwarf binary as a starting point for the\nevolution of these stars with the 1 dimensional stellar evolution code MESA. We\nshow that the supernova shock is not enough to inflate the white dwarf over\ntimescales longer than a few thousand years, significantly shorter than the\n$10^{5-6}$ year lifetimes inferred for observed hypervelocity runaways. Despite\nexperiencing a shock from a supernova less than $\\approx 0.02\\,R_\\odot$ away,\nour models do not experience significant interior heating, and all contract\nback to radii around $0.01\\,R_\\odot$ within about $10^4$\\,years. Explaining the\nobserved inflated states requires either an additional source of significant\nheating or some other physics that is not yet accounted for in the subsequent\nevolution.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"q29ySRFlGuKnzsr_RM7b2Fi_tZt6ZLTRHCtUbLzoIj4","pdfSize":"1625768"}