{"id":"2407.16493","title":"Complementary Speckle STED Microscopy","authors":"Payvand Arjmand, Samlan Chandran Thodika, Elsa Bivas, Haoyang Li,\n  Martin Oheim, Hiroyuki Yoshida, Etienne Brasselet, and Marc Guillon","authorsParsed":[["Arjmand","Payvand",""],["Thodika","Samlan Chandran",""],["Bivas","Elsa",""],["Li","Haoyang",""],["Oheim","Martin",""],["Yoshida","Hiroyuki",""],["Brasselet","Etienne",""],["Guillon","Marc",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 14:09:19 GMT"}],"updateDate":"2024-07-24","timestamp":1721743759000,"abstract":"  Stimulated Emission Depletion (STED) microscopy has emerged as a powerful\ntechnique providing visualization of biological structures at the molecular\nlevel in living samples. In this technique, the diffraction limit is broken by\nselectively depleting the fluorophore's excited state by stimulated emission,\ntypically using a donut-shaped optical vortex beam. STED microscopy performs\nunrivalably well in degraded optical conditions such as living tissues.\nNevertheless, photo-bleaching and acquisition time are among the main\nchallenges for imaging large volumetric field of views. In this regard, random\nlight beams like speckle patterns have proved to be especially promising for\nthree-dimensional imaging in compressed sensing schemes. Taking advantage of\nthe high spatial density of intrisic optical vortices in speckles -- the most\ncommonly used beam spatial structure used in STED microscopy -- we propose here\na novel scheme consisting in performing STED microscopy using speckles. Two\nspeckle patterns are generated at the excitation and the depletion wavelengths,\nrespectively, exhibiting inverted intensity contrasts. We illustrate spatial\nresolution enhancement using complementary speckles as excitation and depletion\nbeam on both fluorescent beads and biological samples. Our results establish a\nrobust method for super-resolved three-dimensional imaging with promising\nperspectives in terms of temporal resolution and photobleaching.\n","subjects":["Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"QBRZBaNtmU_V-UNOY8Ow1fcfmkOYoncQ-l3XYg8EQmQ","pdfSize":"9781709"}