{"id":"2407.00830","title":"DroBoost: An Intelligent Score and Model Boosting Method for Drone\n  Detection","authors":"Ogulcan Eryuksel, Kamil Anil Ozfuttu, Fatih Cagatay Akyon, Kadir\n  Sahin, Efe Buyukborekci, Devrim Cavusoglu, Sinan Altinuc","authorsParsed":[["Eryuksel","Ogulcan",""],["Ozfuttu","Kamil Anil",""],["Akyon","Fatih Cagatay",""],["Sahin","Kadir",""],["Buyukborekci","Efe",""],["Cavusoglu","Devrim",""],["Altinuc","Sinan",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 20:49:56 GMT"}],"updateDate":"2024-07-02","timestamp":1719780596000,"abstract":"  Drone detection is a challenging object detection task where visibility\nconditions and quality of the images may be unfavorable, and detections might\nbecome difficult due to complex backgrounds, small visible objects, and hard to\ndistinguish objects. Both provide high confidence for drone detections, and\neliminating false detections requires efficient algorithms and approaches. Our\nprevious work, which uses YOLOv5, uses both real and synthetic data and a\nKalman-based tracker to track the detections and increase their confidence\nusing temporal information. Our current work improves on the previous approach\nby combining several improvements. We used a more diverse dataset combining\nmultiple sources and combined with synthetic samples chosen from a large\nsynthetic dataset based on the error analysis of the base model. Also, to\nobtain more resilient confidence scores for objects, we introduced a\nclassification component that discriminates whether the object is a drone or\nnot. Finally, we developed a more advanced scoring algorithm for object\ntracking that we use to adjust localization confidence. Furthermore, the\nproposed technique won 1st Place in the Drone vs. Bird Challenge (Workshop on\nSmall-Drone Surveillance, Detection and Counteraction Techniques at ICIAP\n2021).\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"ZoOjtZOmRH5Xyu2A6BlG7Kcjk8qhvAWGhTbV5p10glc","pdfSize":"2548000","objectId":"0xd7b82bb7988f7aee1e2a6612bf98ebbced12dc055d5f08caf462a3e6c18b8fd2","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
