{"id":"2407.02010","title":"Feynman-Kac Operator Expectation Estimator","authors":"Jingyuan Li, Wei Liu","authorsParsed":[["Li","Jingyuan",""],["Liu","Wei",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 07:29:02 GMT"}],"updateDate":"2024-07-03","timestamp":1719905342000,"abstract":"  The Feynman-Kac Operator Expectation Estimator (FKEE) is an innovative method\nfor estimating the target Mathematical Expectation $\\mathbb{E}_{X\\sim P}[f(X)]$\nwithout relying on a large number of samples, in contrast to the commonly used\nMarkov Chain Monte Carlo (MCMC) Expectation Estimator. FKEE comprises diffusion\nbridge models and approximation of the Feynman-Kac operator. The key idea is to\nuse the solution to the Feynmann-Kac equation at the initial time\n$u(x_0,0)=\\mathbb{E}[f(X_T)|X_0=x_0]$. We use Physically Informed Neural\nNetworks (PINN) to approximate the Feynman-Kac operator, which enables the\nincorporation of diffusion bridge models into the expectation estimator and\nsignificantly improves the efficiency of using data while substantially\nreducing the variance. Diffusion Bridge Model is a more general MCMC method. In\norder to incorporate extensive MCMC algorithms, we propose a new diffusion\nbridge model based on the Minimum Wasserstein distance. This diffusion bridge\nmodel is universal and reduces the training time of the PINN. FKEE also reduces\nthe adverse impact of the curse of dimensionality and weakens the assumptions\non the distribution of $X$ and performance function $f$ in the general MCMC\nexpectation estimator. The theoretical properties of this universal diffusion\nbridge model are also shown. Finally, we demonstrate the advantages and\npotential applications of this method through various concrete experiments,\nincluding the challenging task of approximating the partition function in the\nrandom graph model such as the Ising model.\n","subjects":["Statistics/Machine Learning","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"K84ApWUgNBcuMLqvc0myg_FbBQmqitGHoKLWBBnHDWw","pdfSize":"937470","objectId":"0xeff9e53d435af21ffb81e3146eeb54ef75ea6fccecd3bd40ed0062b4ac4f1b28","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
