{"id":"2407.12964","title":"Learning Long-Horizon Predictions for Quadrotor Dynamics","authors":"Pratyaksh Prabhav Rao, Alessandro Saviolo, Tommaso Castiglione\n  Ferrari, and Giuseppe Loianno","authorsParsed":[["Rao","Pratyaksh Prabhav",""],["Saviolo","Alessandro",""],["Ferrari","Tommaso Castiglione",""],["Loianno","Giuseppe",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 19:06:47 GMT"}],"updateDate":"2024-07-19","timestamp":1721243207000,"abstract":"  Accurate modeling of system dynamics is crucial for achieving\nhigh-performance planning and control of robotic systems. Although existing\ndata-driven approaches represent a promising approach for modeling dynamics,\ntheir accuracy is limited to a short prediction horizon, overlooking the impact\nof compounding prediction errors over longer prediction horizons. Strategies to\nmitigate these cumulative errors remain underexplored. To bridge this gap, in\nthis paper, we study the key design choices for efficiently learning\nlong-horizon prediction dynamics for quadrotors. Specifically, we analyze the\nimpact of multiple architectures, historical data, and multi-step loss\nformulation. We show that sequential modeling techniques showcase their\nadvantage in minimizing compounding errors compared to other types of\nsolutions. Furthermore, we propose a novel decoupled dynamics learning\napproach, which further simplifies the learning process while also enhancing\nthe approach modularity. Extensive experiments and ablation studies on\nreal-world quadrotor data demonstrate the versatility and precision of the\nproposed approach. Our outcomes offer several insights and methodologies for\nenhancing long-term predictive accuracy of learned quadrotor dynamics for\nplanning and control.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"urO5CNbGLxtBPDzQDCuLaDDYNCUI9mLCoWqg9OlCeCc","pdfSize":"674183"}