{"id":"2407.03585","title":"Zero-shot Persuasive Chatbots with LLM-Generated Strategies and\n  Information Retrieval","authors":"Kazuaki Furumai, Roberto Legaspi, Julio Vizcarra, Yudai Yamazaki,\n  Yasutaka Nishimura, Sina J. Semnani, Kazushi Ikeda, Weiyan Shi, Monica S. Lam","authorsParsed":[["Furumai","Kazuaki",""],["Legaspi","Roberto",""],["Vizcarra","Julio",""],["Yamazaki","Yudai",""],["Nishimura","Yasutaka",""],["Semnani","Sina J.",""],["Ikeda","Kazushi",""],["Shi","Weiyan",""],["Lam","Monica S.",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 02:28:21 GMT"}],"updateDate":"2024-07-08","timestamp":1720060101000,"abstract":"  Persuasion plays a pivotal role in a wide range of applications from health\nintervention to the promotion of social good. Persuasive chatbots can\naccelerate the positive effects of persuasion in such applications. Existing\nmethods rely on fine-tuning persuasive chatbots with task-specific training\ndata which is costly, if not infeasible, to collect. To address this issue, we\npropose a method to leverage the generalizability and inherent persuasive\nabilities of large language models (LLMs) in creating effective and truthful\npersuasive chatbot for any given domain in a zero-shot manner. Unlike previous\nstudies which used pre-defined persuasion strategies, our method first uses an\nLLM to generate responses, then extracts the strategies used on the fly, and\nreplaces any unsubstantiated claims in the response with retrieved facts\nsupporting the strategies. We applied our chatbot, PersuaBot, to three\nsignificantly different domains needing persuasion skills: donation\nsolicitation, recommendations, and health intervention. Our experiments on\nsimulated and human conversations show that our zero-shot approach is more\npersuasive than prior work, while achieving factual accuracy surpassing\nstate-of-the-art knowledge-oriented chatbots. Our study demonstrated that when\npersuasive chatbots are employed responsibly for social good, it is an enabler\nof positive individual and social change.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"okiv5WJbOtLCJBJz-Y3udOzeTCCA7TXLyrg6H0Uk8DE","pdfSize":"1327378"}