{"id":"2407.01916","title":"Sequential Manipulation Against Rank Aggregation: Theory and Algorithm","authors":"Ke Ma, Qianqian Xu, Jinshan Zeng, Wei Liu, Xiaochun Cao, Yingfei Sun,\n  Qingming Huang","authorsParsed":[["Ma","Ke",""],["Xu","Qianqian",""],["Zeng","Jinshan",""],["Liu","Wei",""],["Cao","Xiaochun",""],["Sun","Yingfei",""],["Huang","Qingming",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 03:31:21 GMT"}],"updateDate":"2024-07-03","timestamp":1719891081000,"abstract":"  Rank aggregation with pairwise comparisons is widely encountered in\nsociology, politics, economics, psychology, sports, etc . Given the enormous\nsocial impact and the consequent incentives, the potential adversary has a\nstrong motivation to manipulate the ranking list. However, the ideal attack\nopportunity and the excessive adversarial capability cause the existing methods\nto be impractical. To fully explore the potential risks, we leverage an online\nattack on the vulnerable data collection process. Since it is independent of\nrank aggregation and lacks effective protection mechanisms, we disrupt the data\ncollection process by fabricating pairwise comparisons without knowledge of the\nfuture data or the true distribution. From the game-theoretic perspective, the\nconfrontation scenario between the online manipulator and the ranker who takes\ncontrol of the original data source is formulated as a distributionally robust\ngame that deals with the uncertainty of knowledge. Then we demonstrate that the\nequilibrium in the above game is potentially favorable to the adversary by\nanalyzing the vulnerability of the sampling algorithms such as Bernoulli and\nreservoir methods. According to the above theoretical analysis, different\nsequential manipulation policies are proposed under a Bayesian decision\nframework and a large class of parametric pairwise comparison models. For\nattackers with complete knowledge, we establish the asymptotic optimality of\nthe proposed policies. To increase the success rate of the sequential\nmanipulation with incomplete knowledge, a distributionally robust estimator,\nwhich replaces the maximum likelihood estimation in a saddle point problem,\nprovides a conservative data generation solution. Finally, the corroborating\nempirical evidence shows that the proposed method manipulates the results of\nrank aggregation methods in a sequential manner.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Ag7Q1urFWIgmGx51to3FWozimxaSW1gyVGPqEOYGf1I","pdfSize":"8107933"}