{"id":"2407.13025","title":"From Principles to Practices: Lessons Learned from Applying Partnership\n  on AI's (PAI) Synthetic Media Framework to 11 Use Cases","authors":"Claire R. Leibowicz and Christian H. Cardona","authorsParsed":[["Leibowicz","Claire R.",""],["Cardona","Christian H.",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 21:27:56 GMT"},{"version":"v2","created":"Fri, 19 Jul 2024 15:57:35 GMT"}],"updateDate":"2024-07-22","timestamp":1721251676000,"abstract":"  2023 was the year the world woke up to generative AI, and 2024 is the year\npolicymakers are responding more firmly. Importantly, this policy momentum is\ntaking place alongside real world creation and distribution of synthetic media.\nSocial media platforms, news organizations, dating apps, image generation\ncompanies, and more are already navigating a world of AI-generated visuals and\nsounds, already changing hearts and minds, as policymakers try to catch up.\nHow, then, can AI governance capture the complexity of the synthetic media\nlandscape? How can it attend to synthetic media's myriad uses, ranging from\nstorytelling to privacy preservation, to deception, fraud, and defamation,\ntaking into account the many stakeholders involved in its development,\ncreation, and distribution? And what might it mean to govern synthetic media in\na manner that upholds the truth while bolstering freedom of expression? What\nfollows is the first known collection of diverse examples of the implementation\nof synthetic media governance that responds to these questions, specifically\nthrough Partnership on AI's (PAI) Responsible Practices for Synthetic Media - a\nvoluntary, normative Framework for creating, distributing, and building\ntechnology for synthetic media responsibly, launched in February 2023. In this\npaper, we present a case bank of real world examples that help operationalize\nthe Framework - highlighting areas synthetic media governance can be applied,\naugmented, expanded, and refined for use, in practice. Read together, the cases\nemphasize distinct elements of AI policymaking and seven emergent best\npractices supporting transparency, safety, expression, and digital dignity\nonline: consent, disclosure, and differentiation between harmful and creative\nuse cases.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"gTwgH-X7QiBBstgYzE7D4iXKRXWV0VvPxeGqcvOxXkI","pdfSize":"287000"}