{"id":"2407.18485","title":"Non-chiral non-Bloch invariants and topological phase diagram in\n  non-unitary quantum dynamics without chiral symmetry","authors":"Yue Zhang, Shuai Li, Yingchao Xu, Rui Tian, Miao Zhang, Hongrong Li,\n  Hong Gao, M.Suhail Zubairy, Fuli Li, Bo Liu","authorsParsed":[["Zhang","Yue",""],["Li","Shuai",""],["Xu","Yingchao",""],["Tian","Rui",""],["Zhang","Miao",""],["Li","Hongrong",""],["Gao","Hong",""],["Zubairy","M. Suhail",""],["Li","Fuli",""],["Liu","Bo",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 03:29:30 GMT"}],"updateDate":"2024-07-29","timestamp":1721964570000,"abstract":"  The non-Bloch topology leads to the emergence of various counter-intuitive\nphenomena in non-Hermitian systems under the open boundary condition (OBC),\nwhich can not find a counterpart in Hermitian systems. However, in the\nnon-Hermitian system without chiral symmetry, being ubiquitous in nature,\nexploring its non-Bloch topology has so far eluded experimental effort. Here by\nintroducing the concept of non-chiral non-Bloch invariants, we theoretically\npredict and experimentally identify the non-Bloch topological phase diagram of\na one-dimensional (1D) non-Hermitian system without chiral symmetry in\ndiscrete-time non-unitary quantum walks of single photons. Interestingly, we\nfind that such topological invariants not only can distinguish topologically\ndistinct gapped phases, but also faithfully capture the corresponding gap\nclosing in open-boundary spectrum at the phase boundary. Different topological\nregions are experimentally identified by measuring the featured discontinuities\nof the higher moments of the walker's displacement, which amazingly match\nexcellently with our defined non-Bloch invariants. Our work provides a useful\nplatform to study the interplay among topology, symmetries and the\nnon-Hermiticity.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Quantum Gases","Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"JKudP0i3NjqJM8dd8N5NsoL6ap2mZ4Hx9oSLNXutsIc","pdfSize":"4951273","objectId":"0x73820f954b84643f0faaf01352f7dc4477a8a534271725714cf541fc590da0cc","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
