{"id":"2407.13953","title":"Kinetic control of ferroelectricity in ultrathin epitaxial Barium\n  Titanate capacitors","authors":"Harish Kumarasubramanian, Prasanna Venkat Ravindran, Ting-Ran Liu,\n  Taeyoung Song, Mythili Surendran, Huandong Chen, Pratyush Buragohain, I-Cheng\n  Tung, Arnab Sen Gupta, Rachel Steinhardt, Ian A. Young, Yu-Tsun Shao, Asif\n  Islam Khan and Jayakanth Ravichandran","authorsParsed":[["Kumarasubramanian","Harish",""],["Ravindran","Prasanna Venkat",""],["Liu","Ting-Ran",""],["Song","Taeyoung",""],["Surendran","Mythili",""],["Chen","Huandong",""],["Buragohain","Pratyush",""],["Tung","I-Cheng",""],["Gupta","Arnab Sen",""],["Steinhardt","Rachel",""],["Young","Ian A.",""],["Shao","Yu-Tsun",""],["Khan","Asif Islam",""],["Ravichandran","Jayakanth",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 00:03:32 GMT"}],"updateDate":"2024-07-22","timestamp":1721347412000,"abstract":"  Ferroelectricity is characterized by the presence of spontaneous and\nswitchable macroscopic polarization. Scaling limits of ferroelectricity have\nbeen of both fundamental and technological importance, but the probes of\nferroelectricity have often been indirect due to confounding factors such as\nleakage in the direct electrical measurements. Recent interest in low-voltage\nswitching electronic devices squarely puts the focus on ultrathin limits of\nferroelectricity in an electronic device form, specifically on the robustness\nof ferroelectric characteristics such as retention and endurance for practical\napplications. Here, we illustrate how manipulating the kinetic energy of the\nplasma plume during pulsed laser deposition can yield ultrathin ferroelectric\ncapacitor heterostructures with high bulk and interface quality, significantly\nlow leakage currents and a broad \"growth window\". These heterostructures\nventure into previously unexplored aspects of ferroelectric properties,\nshowcasing ultralow switching voltages ($<$0.3 V), long retention times\n($>$10$^{4}$s), and high endurance ($>$10$^{11}$cycles) in 20 nm films of the\nprototypical perovskite ferroelectric, BaTiO$_{3}$. Our work demonstrates that\nmaterials engineering can push the envelope of performance for ferroelectric\nmaterials and devices at the ultrathin limit and opens a direct, reliable and\nscalable pathway to practical applications of ferroelectrics in ultralow\nvoltage switches for logic and memory technologies.\n","subjects":["Physics/Applied Physics","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"XJVVBUHbPs2PAK4y2uI6HvO-2kKcjU9UPdcykzmoiE8","pdfSize":"60621416"}