{"id":"2407.03701","title":"Bayesian inference of physics-based models of acoustically-forced\n  laminar premixed conical flames","authors":"Alessandro Giannotta, Matthew Yoko, Stefania Cherubini, Pietro De\n  Palma, Matthew P. Juniper","authorsParsed":[["Giannotta","Alessandro",""],["Yoko","Matthew",""],["Cherubini","Stefania",""],["De Palma","Pietro",""],["Juniper","Matthew P.",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 07:40:14 GMT"}],"updateDate":"2024-07-08","timestamp":1720078814000,"abstract":"  We perform twenty experiments on an acoustically-forced laminar premixed\nBunsen flame and assimilate high-speed footage of the natural emission into a\nphysics-based model containing seven parameters. The experimental rig is a\nducted Bunsen flame supplied by a mixture of methane and ethylene. A high-speed\ncamera captures the natural emission of the flame, from which we extract the\nposition of the flame front. We use Bayesian inference to combine this\nexperimental data with our prior knowledge of this flame's behaviour. This\nprior knowledge is expressed through (i) a model of the kinematics of a flame\nfront moving through a model of the perturbed velocity field, and (ii) a priori\nestimates of the parameters of the above model with quantified uncertainties.\nWe find the most probable a posteriori model parameters using Bayesian\nparameter inference, and quantify their uncertainties using Laplace's method\ncombined with first-order adjoint methods. This is substantially cheaper than\nother common Bayesian inference frameworks, such as Markov Chain Monte Carlo.\nThis process results in a quantitatively-accurate physics-based reduced-order\nmodel of the acoustically forced Bunsen flame for injection velocities ranging\nfrom 1.75 m/s to 2.99 m/s and equivalence ratio values ranging from 1.26 to\n1.47, using seven parameters. We use this model to evaluate the heat release\nrate between experimental snapshots, to extrapolate to different experimental\nconditions, and to calculate the flame transfer function and its uncertainty\nfor all the flames. Since the proposed model relies on only seven parameters,\nit can be trained with little data and successfully extrapolates beyond the\ntraining dataset. Matlab code is provided so that the reader can apply it to\nassimilate further flame images into the model.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"X8lDNALzQf3WM-Jz97mMGq7RhyjtQ05tBbDe8wQ6Syc","pdfSize":"22517644"}