{"id":"2407.03117","title":"A 72h exploration of the co-evolution of food insecurity and\n  international migration","authors":"Duncan Cassells, Lorenzo Costantini, Ariel Flint Ashery, Shreyas\n  Gadge, Diogo L. Pires, Miguel \\'A. S\\'anchez-Cort\\'es, Arnaldo Santoro, Elisa\n  Omodei","authorsParsed":[["Cassells","Duncan",""],["Costantini","Lorenzo",""],["Ashery","Ariel Flint",""],["Gadge","Shreyas",""],["Pires","Diogo L.",""],["Sánchez-Cortés","Miguel Á.",""],["Santoro","Arnaldo",""],["Omodei","Elisa",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 14:03:21 GMT"}],"updateDate":"2024-07-04","timestamp":1720015401000,"abstract":"  Food insecurity, defined as the lack of physical or economic access to safe,\nnutritious and sufficient food, remains one of the main challenges of the 2030\nAgenda for Sustainable Development. Food insecurity is a complex phenomenon,\nresulting from the interplay of environmental, socio-demographic, and political\nevents. Previous work has investigated the nexus between climate change,\nconflict, migration and food security at the household level, however these\nrelations are still largely unexplored at national scales. In this context,\nduring the Complexity72h workshop, held at the Universidad Carlos III de Madrid\nin June 2024, we explored the co-evolution of international migration flows and\nfood insecurity at the national scale, accounting for remittances, as well as\nfor changes in the economic, conflict, and climate situation. To this aim, we\ngathered data from several publicly available sources (Food and Agriculture\nOrganization, World Bank, and UN Department of Economic and Social Affairs) and\nanalyzed the association between food insecurity and migration, migration and\nremittances, and remittances and food insecurity. We then propose a framework\nlinking together these associations to model the co-evolution of food\ninsecurity and international migrations.\n","subjects":["Physics/Physics and Society","Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"SRv8aqRBarKk5FHWTSegvsloRnBmL5KDWYeXwj0c_0w","pdfSize":"5900125"}
