{"id":"2407.05499","title":"Towards Reliable Neural Optimizers: A Permutation Equivariant Neural\n  Approximation for Information Processing Applications","authors":"Meiyi Li, Javad Mohammadi","authorsParsed":[["Li","Meiyi",""],["Mohammadi","Javad",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 21:12:18 GMT"}],"updateDate":"2024-07-09","timestamp":1720386738000,"abstract":"  The complexities of information processing across Dynamic Data Driven\nApplications Systems drive the development and adoption of Artificial\nIntelligence-based optimization solutions. Traditional solvers often suffer\nfrom slow response times and an inability to adapt swiftly to real-time input\nvariations. To address these deficiencies, we will expand on our previous\nresearch in neural-based optimizers by introducing a machine learning-enabled\nneural approximation model called LOOP-PE (Learning to Optimize the\nOptimization Process -- Permutation Equivariance version). This model not only\nenhances decision-making efficiency but also dynamically adapts to variations\nof data collections from sensor networks. In this work, we focus on mitigating\nthe heterogeneity issues of data collection from sensor networks, including\nsensor dropout and failures, communication delays, and the complexities\ninvolved in integrating new sensors during system scaling. The proposed LOOP-PE\nmodel specifically overcomes these issues with a unique structure that is\npermutation equivariant, allowing it to accommodate inputs from a varying\nnumber of sensors and directly linking these inputs to their optimal\noperational outputs. This design significantly boosts the system's flexibility\nand adaptability, especially in scenarios characterized by unordered,\ndistributed, and asynchronous data collections. Moreover, our approach\nincreases the robustness of decision-making by integrating physical constraints\nthrough the generalized gauge map method, which theoretically ensures the\ndecisions' practical feasibility and operational viability under dynamic\nconditions. We use a DDDAS case study to demonstrate that LOOP-PE model\nreliably delivers near-optimal and adaptable solutions, significantly\noutperforming traditional methods in managing the complexities of multi-sensor\nenvironments for real-time deployments.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"ez7aWf7nJa21V7pns1GxVE6llaBHMFz7a3lA_MR7Pjk","pdfSize":"1087509"}