{"id":"2407.14571","title":"DataStorm-EM: Exploration of Alternative Timelines within\n  Continuous-Coupled Simulation Ensembles","authors":"Fahim Tasneema Azad, Javier Redondo Anton, Shubhodeep Mitra, Fateh\n  Singh, Hans Behrens, Mao-Lin Li, Bilgehan Arslan, K. Sel\\c{c}uk Candan, Maria\n  Luisa Sapino","authorsParsed":[["Azad","Fahim Tasneema",""],["Anton","Javier Redondo",""],["Mitra","Shubhodeep",""],["Singh","Fateh",""],["Behrens","Hans",""],["Li","Mao-Lin",""],["Arslan","Bilgehan",""],["Candan","K. Selçuk",""],["Sapino","Maria Luisa",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 09:12:59 GMT"}],"updateDate":"2024-07-23","timestamp":1721380379000,"abstract":"  Many socio-economical critical domains (such as sustainability, public\nhealth, and disasters) are characterized by highly complex and dynamic systems,\nrequiring data and model-driven simulations to support decision-making. Due to\na large number of unknowns, decision-makers usually need to generate ensembles\nof stochastic scenarios, requiring hundreds or thousands of individual\nsimulation instances, each with different parameter settings corresponding to\ndistinct scenarios, As the number of model parameters increases, the number of\npotential timelines one can simulate increases exponentially. Consequently,\nsimulation ensembles are inherently sparse, even when they are extremely large.\nThis necessitates a platform for (a) deciding which simulation instances to\nexecute and (b) given a large simulation ensemble, enabling decision-makers to\nexplore the resulting alternative timelines, by extracting and visualizing\nconsistent, yet diverse timelines from continuous-coupled simulation ensembles.\nIn this article, we present DataStorm-EM platform for data- and model-driven\nsimulation ensemble management, optimization, analysis, and exploration,\ndescribe underlying challenges and present our solution.\n","subjects":["Computing Research Repository/Multiagent Systems"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"j8UCJXJhIZlynr3zWub17pNhlyupdGMc_QR57GSIGlA","pdfSize":"1546557"}