{"id":"2407.10274","title":"Enhancing Weakly-Supervised Histopathology Image Segmentation with\n  Knowledge Distillation on MIL-Based Pseudo-Labels","authors":"Yinsheng He, Xingyu Li, and Roger J. Zemp","authorsParsed":[["He","Yinsheng",""],["Li","Xingyu",""],["Zemp","Roger J.",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 17:15:47 GMT"}],"updateDate":"2024-07-16","timestamp":1720977347000,"abstract":"  Segmenting tumors in histological images is vital for cancer diagnosis. While\nfully supervised models excel with pixel-level annotations, creating such\nannotations is labor-intensive and costly. Accurate histopathology image\nsegmentation under weakly-supervised conditions with coarse-grained image\nlabels is still a challenging problem. Although multiple instance learning\n(MIL) has shown promise in segmentation tasks, surprisingly, no previous\npseudo-supervision methods have used MIL-based outputs as pseudo-masks for\ntraining. We suspect this stems from concerns over noises in MIL results\naffecting pseudo supervision quality. To explore the potential of leveraging\nMIL-based segmentation for pseudo supervision, we propose a novel distillation\nframework for histopathology image segmentation. This framework introduces a\niterative fusion-knowledge distillation strategy, enabling the student model to\nlearn directly from the teacher's comprehensive outcomes. Through dynamic role\nreversal between the fixed teacher and learnable student models and the\nincorporation of weighted cross-entropy loss for model optimization, our\napproach prevents performance deterioration and noise amplification during\nknowledge distillation. Experimental results on public histopathology datasets,\nCamelyon16 and Digestpath2019, demonstrate that our approach not only\ncomplements various MIL-based segmentation methods but also significantly\nenhances their performance. Additionally, our method achieves new SOTA in the\nfield.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"rUX7IvaRvJSvQd6kIacRTwr1ySigowOCilKIl-cREvY","pdfSize":"4057197"}