{"id":"2407.00436","title":"A Recipe of Parallel Corpora Exploitation for Multilingual Large\n  Language Models","authors":"Peiqin Lin, Andr\\'e F. T. Martins, Hinrich Sch\\\"utze","authorsParsed":[["Lin","Peiqin",""],["Martins","André F. T.",""],["Schütze","Hinrich",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 13:12:39 GMT"}],"updateDate":"2024-07-02","timestamp":1719666759000,"abstract":"  Recent studies have highlighted the potential of exploiting parallel corpora\nto enhance multilingual large language models, improving performance in both\nbilingual tasks, e.g., machine translation, and general-purpose tasks, e.g.,\ntext classification. Building upon these findings, our comprehensive study aims\nto identify the most effective strategies for leveraging parallel corpora. We\ninvestigate the impact of parallel corpora quality and quantity, training\nobjectives, and model size on the performance of multilingual large language\nmodels enhanced with parallel corpora across diverse languages and tasks. Our\nanalysis reveals several key insights: (i) filtering noisy translations is\nessential for effectively exploiting parallel corpora, while language\nidentification and short sentence filtering have little effect; (ii) even a\ncorpus containing just 10K parallel sentences can yield results comparable to\nthose obtained from much larger datasets; (iii) employing only the machine\ntranslation objective yields the best results among various training objectives\nand their combinations; (iv) larger multilingual language models benefit more\nfrom parallel corpora than smaller models due to their stronger capacity for\ncross-task transfer. Our study offers valuable insights into the optimal\nutilization of parallel corpora to enhance multilingual large language models,\nextending the generalizability of previous findings from limited languages and\ntasks to a broader range of scenarios.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"dxtEbC21REuyMUpKetQ-WI-DA74H3J2FAdCTWoWCApI","pdfSize":"410454","objectId":"0xedf921b8b1a81c9b02890ea5adeb49622d25a39f91415edc4d6f933ffa30ec63","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
