{"id":"2407.05604","title":"A comparative study of ultraluminous infrared galaxies in the IRAS and\n  SDSS Surveys","authors":"Shaohua Zhang (ShNU), Zhijian Luo (ShNU), Xiheng Shi (PRIC), Chenggan\n  Shu (ShNU), Hubing Xiao (ShNU) and Hongyan Zhou (PRIC)","authorsParsed":[["Zhang","Shaohua","","ShNU"],["Luo","Zhijian","","ShNU"],["Shi","Xiheng","","PRIC"],["Shu","Chenggan","","ShNU"],["Xiao","Hubing","","ShNU"],["Zhou","Hongyan","","PRIC"]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 04:38:50 GMT"}],"updateDate":"2024-07-09","timestamp":1720413530000,"abstract":"  We present a comprehensive study of Ultraluminous Infrared Galaxies (ULIRGs),\nleveraging data from the IRAS Faint Source Catalogue (FSC) and the\nspectroscopic catalog in the Sloan Digital Sky Survey (SDSS) DR16. Our\nmeticulous cross-matching technique significantly enhances the reliability of\nULIRG identification, resulting in the identification of 283 reliable ULIRGs,\nincluding 102 new detections, while discarding 120 previously reported false\nsources. Covering a redshift range of $z = 0.018 - 0.996$, with a median\nredshift of $\\bar{z} = 0.259$, our uniform sample reveals apparent interaction\nfeatures in approximately 40\\% of ULIRGs, increasing to 92\\% for those with $z\n< 0.1$. Through optical spectra analysis, it is indicated that over 58\\% of\nULIRGs host an AGN, which is twice as high as the detections based solely on\ninfrared colors. Moreover, a pronounced excess of radio emissions associated\nwith AGN activity results in a steeper radio-far-infrared correlation. Notably,\nType I ULIRGs exhibit properties similar to those of narrow-line Seyfert 1\ngalaxies (NLS1s), with an elevated incidence rate of \\ion{Mg}{2} BALs (16.7\\%),\nsurpassing that of typical optically selected quasars by over tenfold,\nconsistent with current evolutionary models. We anticipate that forthcoming\ntelescopes such as the China Space Station Telescope (CSST) and Leighton\nChajnantor Telescope (LCT) will provide deeper insights into ULIRG morphology,\ndust distribution, molecular gas, and AGN activity.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"vaDgKP11wy2PGw84phXk2qOKHD6Y4YuC3TvV--siHbA","pdfSize":"25292090"}