{"id":"2407.17386","title":"Data-driven stellar intrinsic colors and dust reddenings for\n  spectro-photometric data: From the blue-edge method to a machine-learning\n  approach","authors":"He Zhao, Shu Wang, Biwei Jiang, Jun Li, Dongwei Fan, Yi Ren, Xiaoxiao\n  Ma","authorsParsed":[["Zhao","He",""],["Wang","Shu",""],["Jiang","Biwei",""],["Li","Jun",""],["Fan","Dongwei",""],["Ren","Yi",""],["Ma","Xiaoxiao",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 16:11:28 GMT"}],"updateDate":"2024-07-25","timestamp":1721837488000,"abstract":"  Intrinsic colors (ICs) of stars are essential for the studies on both stellar\nphysics and dust reddening. In this work, we developed an XGBoost model to\npredict the ICs with the atmospheric parameters $T_{\\rm eff}$, ${\\rm log}\\,g$,\nand $\\rm [M/H]$. The model was trained and tested for three colors at Gaia and\n2MASS bands with 1,040,446 low-reddening sources. The atmospheric parameters\nwere determined by the Gaia DR3 GSP-phot module and were validated by comparing\nwith APOGEE and LAMOST. We further confirmed that the biases in GSP-phot\nparameters, especially for $\\rm [M/H]$, do not present a significant impact on\nthe IC prediction. The generalization error of the model estimated by the test\nset is 0.014 mag for $(G_{\\rm BP}\\,{-}\\,G_{\\rm RP})_0$, 0.050 mag for $(G_{\\rm\nBP}\\,{-}\\,K_{\\rm S})_0$, and 0.040 mag for $(J\\,{-}\\,K_{\\rm S})_0$. The model\nwas applied to a sample containing 5,714,528 reddened stars with stellar\nparameters from Andrae et al. (2023) to calculate ICs and reddenings. The high\nconsistency in the comparison of $E(J\\,{-}\\,K_{\\rm S})$ between our results and\nliterature values further validates the accuracy of the XGBoost model. The\nvariation of $E(G_{\\rm BP}\\,{-}\\,K_{\\rm S})/E(G_{\\rm BP}\\,{-}\\,G_{\\rm RP})$, a\nrepresentation of the extinction law, with Galactic longitude is found on large\nscales. This work preliminarily presents the feasibility and the accuracy of\nthe machine-learning approach for IC and dust reddening calculation, whose\nproducts could be widely applied to spectro-photometric data. The data sets and\ntrained model can be accessed via\n\\url{https://doi.org/10.5281/zenodo.12787594}. The models for more bands will\nbe completed in the following works.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"-08b5rjA2xI63CmriO1x7G09ehZj59mR3oKOJiEFWiY","pdfSize":"5751698"}