{"id":"2407.06350","title":"A Surrogate Endpoint Based Provisional Approval Causal Roadmap","authors":"Peter B. Gilbert, James Peng, Larry Han, Theis Lange, Yun Lu, Lei Nie,\n  Mei-Chiung Shih, Salina P. Waddy, Ken Wiley, Margot Yann, Zafar Zafari,\n  Debashis Ghosh, Dean Follmann, Michal Juraska, Iv\\'an D\\'iaz","authorsParsed":[["Gilbert","Peter B.",""],["Peng","James",""],["Han","Larry",""],["Lange","Theis",""],["Lu","Yun",""],["Nie","Lei",""],["Shih","Mei-Chiung",""],["Waddy","Salina P.",""],["Wiley","Ken",""],["Yann","Margot",""],["Zafari","Zafar",""],["Ghosh","Debashis",""],["Follmann","Dean",""],["Juraska","Michal",""],["Díaz","Iván",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 19:41:14 GMT"}],"updateDate":"2024-07-10","timestamp":1720467674000,"abstract":"  For many rare diseases with no approved preventive interventions, promising\ninterventions exist, yet it has been difficult to conduct a pivotal phase 3\ntrial that could provide direct evidence demonstrating a beneficial effect on\nthe target disease outcome. When a promising putative surrogate endpoint(s) for\nthe target outcome is available, surrogate-based provisional approval of an\nintervention may be pursued. We apply the Causal Roadmap rubric to define a\nsurrogate endpoint based provisional approval causal roadmap, which combines\nobservational study data that estimates the relationship between the putative\nsurrogate and the target outcome, with a phase 3 surrogate endpoint study that\ncollects the same data but is very under-powered to assess the treatment effect\n(TE) on the target outcome. The objective is conservative estimation/inference\nfor the TE with an estimated lower uncertainty bound that allows (through two\nbias functions) for an imperfect surrogate and imperfect transport of the\nconditional target outcome risk in the untreated between the observational and\nphase 3 studies. Two estimators of TE (plug-in, nonparametric efficient\none-step) with corresponding inference procedures are developed. Finite-sample\nperformance of the plug-in estimator is evaluated in two simulation studies,\nwith R code provided. The roadmap is illustrated with contemporary Group B\nStreptococcus vaccine development.\n","subjects":["Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Y1liOF7v09LIbwVMgx_8lTTBbJn-JMOJNczqDE_w8NU","pdfSize":"994195"}