{"id":"2407.06824","title":"Full Identification of a Growing and Branching Network's Spatio-Temporal\n  Structures","authors":"Thibault Chassereau, Florence Chapeland-Leclerc and Eric Herbert","authorsParsed":[["Chassereau","Thibault",""],["Chapeland-Leclerc","Florence",""],["Herbert","Eric",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 12:58:11 GMT"}],"updateDate":"2024-07-10","timestamp":1720529891000,"abstract":"  Experimentally monitoring the kinematics of branching network growth is a\ntricky task, given the complexity of the structures generated in three\ndimensions. One option is to drive the network in such a way as to obtain\ntwo-dimensional growth, enabling a collection of independent images to be\nobtained. The density of the network generates ambiguous structures, such as\noverlaps and meetings, which hinder the reconstruction of the chronology of\nconnections. In this paper, we propose a general method for global network\nreconstruction. Each network connection is defined by a unique label, enabling\nit to be tracked in time and space. In this work, we distinguish between\nlateral and apical branches on the one hand, and extremities on the other.\nFinally, we reconstruct the network after identifying and eliminating overlaps.\nThis method is then applied to the model filamentous fungus Podospora anserina\nto reconstruct its growing thallus. We derive criteria for differentiating\nbetween apical and lateral branches. We find that the outer ring is favorably\ncomposed of apical branches, while densification within the network comes from\nlateral branches. From this, we derive the specific dynamics of each of the two\ntypes. Finally, in the absence of any latency phase during growth initiation,\nwe can reconstruct a time based on the equality of apical and lateral branching\ncollections. This makes it possible to directly compare the growth dynamics of\ndifferent thalli.\n","subjects":["Physics/Biological Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"oSjvRILyqrnRpeNVoeuTpFaS2KgH_ScRkutnU6-RjSw","pdfSize":"2123929"}