{"id":"2407.14165","title":"Evolution of stars with 60 and 200 Msun: predictions for WNh stars in\n  the Milky Way","authors":"Alex Camilo Gormaz-Matamala, Amedeo Romagnolo, Krzysztof Belczynski","authorsParsed":[["Gormaz-Matamala","Alex Camilo",""],["Romagnolo","Amedeo",""],["Belczynski","Krzysztof",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 09:50:47 GMT"},{"version":"v2","created":"Wed, 18 Sep 2024 15:47:08 GMT"}],"updateDate":"2024-09-19","timestamp":1721382647000,"abstract":"  We study in detail the evolution of two massive stars at solar metallicity\n(Z=0.014) taken from Romagnolo et al. (2024, Paper I); by running evolution\nmodels for initial masses 60 and 200 Msun, using MESA and GENEC. For the mass\nloss, we adopt the self-consistent m-CAK prescription for the optically thin\nwinds of OB-stars, a semi-empirical formula for H-rich thick wind of WNh stars,\nand a hydrodynamically consistent formula for the H-poor thick wind of\nclassical Wolf-Rayet stars. We set initial rotation as 40% of the critical\nangular velocity, overshooting =0.5, Tayler-Spruit for the angular momentum\ntransport, and Ledoux criterion for the convective layers. Both codes predict\ndifferent tracks across the HRD. For the 60 Msun case, Genec models predict a\nmore efficient rotational mixing and more chemically homogeneous evolution,\nwhereas MESA model predicts a large radial expansion post-MS reaching the LBV\nphase. For the 200 Msun case, differences are less relevant because their\nevolution is dominated by wind mass loss with a weaker dependence on internal\nmixing, and only the treatment for superadiabacity creates an impact during the\nHe-burning stage. The switch of the mass loss based on the proximity to the\nEddington factor instead of the removal of outer layers, implies the existence\nof WNh stars with a large mass fraction of hydrogen at the surface formed from\ninitial masses $\\gtrsim60$ Msun. These stars are constrained in a Teff range of\nthe HR diagram which corresponds to the MS band, in agreement with the\nobservations of Galactic WNh stars. While our models employ a fixed $\\Gamma_e$\nthreshold for the switch to thick winds, rather than a continuous thin-to-thick\nwind model, the good reproduction of observations supports the robustness of\nthe wind model upgrades introduced in Paper I, allowing its application to\nstudies of late-stage stellar evolution before core collapse.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"eqLRDbQcWtE9gTqQ6F-EPofnrA8mVzFixriIviZcwAQ","pdfSize":"1297466"}