{"id":"2407.02711","title":"AI in Action: Accelerating Progress Towards the Sustainable Development\n  Goals","authors":"Brigitte Hoyer Gosselink, Kate Brandt, Marian Croak, Karen DeSalvo,\n  Ben Gomes, Lila Ibrahim, Maggie Johnson, Yossi Matias, Ruth Porat, Kent\n  Walker, James Manyika","authorsParsed":[["Gosselink","Brigitte Hoyer",""],["Brandt","Kate",""],["Croak","Marian",""],["DeSalvo","Karen",""],["Gomes","Ben",""],["Ibrahim","Lila",""],["Johnson","Maggie",""],["Matias","Yossi",""],["Porat","Ruth",""],["Walker","Kent",""],["Manyika","James",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 23:25:27 GMT"}],"updateDate":"2024-07-04","timestamp":1719962727000,"abstract":"  Advances in Artificial Intelligence (AI) are helping tackle a growing number\nof societal challenges, demonstrating technology's increasing capability to\naddress complex issues, including those outlined in the United Nations (UN)\nSustainable Development Goals (SDGs). Despite global efforts, 80 percent of SDG\ntargets have deviated, stalled, or regressed, and only 15 percent are on track\nas of 2023, illustrating the urgency of accelerating efforts to meet the goals\nby 2030. We draw on Google's internal and collaborative research, technical\nwork, and social impact initiatives to show AI's potential to accelerate action\non the SDGs and make substantive progress to help address humanity's most\npressing challenges. The paper highlights AI capabilities (including computer\nvision, generative AI, natural language processing, and multimodal AI) and\nshowcases how AI is altering how we approach problem-solving across all 17 SDGs\nthrough use cases, with a spotlight on AI-powered innovation in health,\neducation, and climate. We then offer insights on AI development and deployment\nto drive bold and responsible innovation, enhance impact, close the\naccessibility gap, and ensure that everyone, everywhere, can benefit from AI.\n","subjects":["Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"OyaZSn2MQYy1MlfmJCPQROy4TvYFW3e09bTYqliD14U","pdfSize":"345025"}