{"id":"2407.01638","title":"LASSI: An LLM-based Automated Self-Correcting Pipeline for Translating\n  Parallel Scientific Codes","authors":"Matthew T. Dearing, Yiheng Tao, Xingfu Wu, Zhiling Lan, Valerie Taylor","authorsParsed":[["Dearing","Matthew T.",""],["Tao","Yiheng",""],["Wu","Xingfu",""],["Lan","Zhiling",""],["Taylor","Valerie",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 19:36:04 GMT"}],"updateDate":"2024-07-03","timestamp":1719776164000,"abstract":"  This paper addresses the problem of providing a novel approach to sourcing\nsignificant training data for LLMs focused on science and engineering. In\nparticular, a crucial challenge is sourcing parallel scientific codes in the\nranges of millions to billions of codes. To tackle this problem, we propose an\nautomated pipeline framework, called LASSI, designed to translate between\nparallel programming languages by bootstrapping existing closed- or open-source\nLLMs. LASSI incorporates autonomous enhancement through self-correcting loops\nwhere errors encountered during compilation and execution of generated code are\nfed back to the LLM through guided prompting for debugging and refactoring. We\nhighlight the bi-directional translation of existing GPU benchmarks between\nOpenMP target offload and CUDA to validate LASSI.\n  The results of evaluating LASSI with different application codes across four\nLLMs demonstrate the effectiveness of LASSI for generating executable parallel\ncodes, with 80% of OpenMP to CUDA translations and 85% of CUDA to OpenMP\ntranslations producing the expected output. We also observe approximately 78%\nof OpenMP to CUDA translations and 62% of CUDA to OpenMP translations execute\nwithin 10% of or at a faster runtime than the original benchmark code in the\nsame language.\n","subjects":["Computing Research Repository/Software Engineering","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Distributed, Parallel, and Cluster Computing","Computing Research Repository/Programming Languages"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"6o5l5IM5GyZyUxBTJ_p3fX9ONC5SEVwy5qOKGf1ROwc","pdfSize":"272743"}