{"id":"2407.18544","title":"Utilising Explainable Techniques for Quality Prediction in a Complex\n  Textiles Manufacturing Use Case","authors":"Briony Forsberg, Dr Henry Williams, Prof Bruce MacDonald, Tracy Chen,\n  Dr Reza Hamzeh, Dr Kirstine Hulse","authorsParsed":[["Forsberg","Briony",""],["Williams","Dr Henry",""],["MacDonald","Prof Bruce",""],["Chen","Tracy",""],["Hamzeh","Dr Reza",""],["Hulse","Dr Kirstine",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 06:50:17 GMT"}],"updateDate":"2024-07-29","timestamp":1721976617000,"abstract":"  This paper develops an approach to classify instances of product failure in a\ncomplex textiles manufacturing dataset using explainable techniques. The\ndataset used in this study was obtained from a New Zealand manufacturer of\nwoollen carpets and rugs. In investigating the trade-off between accuracy and\nexplainability, three different tree-based classification algorithms were\nevaluated: a Decision Tree and two ensemble methods, Random Forest and XGBoost.\nAdditionally, three feature selection methods were also evaluated: the\nSelectKBest method, using chi-squared as the scoring function, the Pearson\nCorrelation Coefficient, and the Boruta algorithm. Not surprisingly, the\nensemble methods typically produced better results than the Decision Tree\nmodel. The Random Forest model yielded the best results overall when combined\nwith the Boruta feature selection technique. Finally, a tree ensemble\nexplaining technique was used to extract rule lists to capture necessary and\nsufficient conditions for classification by a trained model that could be\neasily interpreted by a human. Notably, several features that were in the\nextracted rule lists were statistical features and calculated features that\nwere added to the original dataset. This demonstrates the influence that\nbringing in additional information during the data preprocessing stages can\nhave on the ultimate model performance.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"-QuJ4cAtREfFEPVtaHlpYc9zBAJ1qjzwaf6Kx8PU3D0","pdfSize":"2274675"}