{"id":"2407.17535","title":"LAMBDA: A Large Model Based Data Agent","authors":"Maojun Sun, Ruijian Han, Binyan Jiang, Houduo Qi, Defeng Sun, Yancheng\n  Yuan, and Jian Huang","authorsParsed":[["Sun","Maojun",""],["Han","Ruijian",""],["Jiang","Binyan",""],["Qi","Houduo",""],["Sun","Defeng",""],["Yuan","Yancheng",""],["Huang","Jian",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 06:26:36 GMT"},{"version":"v2","created":"Sat, 14 Sep 2024 08:03:43 GMT"}],"updateDate":"2024-09-17","timestamp":1721802396000,"abstract":"  We introduce LArge Model Based Data Agent (LAMBDA), a novel open-source,\ncode-free multi-agent data analysis system that leverages the power of large\nmodels. LAMBDA is designed to address data analysis challenges in complex\ndata-driven applications through innovatively designed data agents that operate\niteratively and generatively using natural language. At the core of LAMBDA are\ntwo key agent roles: the programmer and the inspector, which are engineered to\nwork together seamlessly. Specifically, the programmer generates code based on\nthe user's instructions and domain-specific knowledge, enhanced by advanced\nmodels. Meanwhile, the inspector debugs the code when necessary. To ensure\nrobustness and handle adverse scenarios, LAMBDA features a user interface that\nallows direct user intervention in the operational loop. Additionally, LAMBDA\ncan flexibly integrate external models and algorithms through our proposed\nKnowledge Integration Mechanism, catering to the needs of customized data\nanalysis. LAMBDA has demonstrated strong performance on various data analysis\ntasks. It has the potential to enhance data analysis paradigms by seamlessly\nintegrating human and artificial intelligence, making it more accessible,\neffective, and efficient for users from diverse backgrounds. The strong\nperformance of LAMBDA in solving data analysis problems is demonstrated using\nreal-world data examples. Videos of several case studies are available at\nhttps://xxxlambda.github.io/lambda_webpage.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning","Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"9F3gfPwXcKmAIIwOmpZlcLUGfxc_uReTWrT1Um58ot0","pdfSize":"5438477","objectId":"0xf276ea7d53d5ced9433572effe0ef8c51ca3319e141dc0b9b34a22daed279bec","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
