{"id":"2407.15531","title":"Double Deep Learning-based Event Data Coding and Classification","authors":"Abdelrahman Seleem (1, 2, 3), Andr\\'e F. R. Guarda (2), Nuno M. M.\n  Rodrigues (2, 4), Fernando Pereira (1, 2) ((1) Instituto Superior T\\'ecnico -\n  Universidade de Lisboa, Lisbon, Portugal, (2) Instituto de\n  Telecomunica\\c{c}\\~oes, Portugal, (3) Faculty of Computers and Information,\n  South Valley University, Qena, Egypt, (4) ESTG, Polit\\'ecnico de Leiria,\n  Leiria, Portugal)","authorsParsed":[["Seleem","Abdelrahman",""],["Guarda","André F. R.",""],["Rodrigues","Nuno M. M.",""],["Pereira","Fernando",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 10:45:55 GMT"}],"updateDate":"2024-07-23","timestamp":1721645155000,"abstract":"  Event cameras have the ability to capture asynchronous per-pixel brightness\nchanges, called \"events\", offering advantages over traditional frame-based\ncameras for computer vision applications. Efficiently coding event data is\ncritical for transmission and storage, given the significant volume of events.\nThis paper proposes a novel double deep learning-based architecture for both\nevent data coding and classification, using a point cloud-based representation\nfor events. In this context, the conversions from events to point clouds and\nback to events are key steps in the proposed solution, and therefore its impact\nis evaluated in terms of compression and classification performance.\nExperimental results show that it is possible to achieve a classification\nperformance of compressed events which is similar to one of the original\nevents, even after applying a lossy point cloud codec, notably the recent\nlearning-based JPEG Pleno Point Cloud Coding standard, with a clear rate\nreduction. Experimental results also demonstrate that events coded using JPEG\nPCC achieve better classification performance than those coded using the\nconventional lossy MPEG Geometry-based Point Cloud Coding standard.\nFurthermore, the adoption of learning-based coding offers high potential for\nperforming computer vision tasks in the compressed domain, which allows\nskipping the decoding stage while mitigating the impact of coding artifacts.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"VpYGL9bAhvsjAlUOHEvysgQiMlacpz5U8BgikMHauKw","pdfSize":"4359719"}