{"id":"2407.11983","title":"Generative AI as a Learning Buddy and Teaching Assistant: Pre-service\n  Teachers' Uses and Attitudes","authors":"Matthew Nyaaba, Lehong Shi, Macharious Nabang, Xiaoming Zhai, Patrick\n  Kyeremeh, Samuel Arthur Ayoberd, Bismark Nyaaba Akanzire","authorsParsed":[["Nyaaba","Matthew",""],["Shi","Lehong",""],["Nabang","Macharious",""],["Zhai","Xiaoming",""],["Kyeremeh","Patrick",""],["Ayoberd","Samuel Arthur",""],["Akanzire","Bismark Nyaaba",""]],"versions":[{"version":"v1","created":"Mon, 3 Jun 2024 20:38:29 GMT"}],"updateDate":"2024-07-18","timestamp":1717447109000,"abstract":"  To uncover pre-service teachers' (PSTs') user experience and perceptions of\ngenerative artificial intelligence (GenAI) applications, we surveyed 167 Ghana\nPSTs' specific uses of GenAI as a learning buddy and teaching assistant, and\ntheir attitudes towards these applications. Employing exploratory factor\nanalysis (EFA), we identified three key factors shaping PSTs' attitudes towards\nGenAI: teaching, learning, and ethical and advocacy factors. The mean scores of\nthese factors revealed a generally positive attitude towards GenAI, indicating\nhigh levels of agreement on its potential to enhance PSTs' content knowledge\nand access to learning and teaching resources, thereby reducing their need for\nassistance from colleagues. Specifically, PSTs use GenAI as a learning buddy to\naccess reading materials, in-depth content explanations, and practical\nexamples, and as a teaching assistant to enhance teaching resources, develop\nassessment strategies, and plan lessons. A regression analysis showed that\nbackground factors such as age, gender, and year of study do not predict PSTs'\nattitudes towards GenAI, but age and year of study significantly predict the\nfrequency of their use of GenAI, while gender does not. These findings suggest\nthat older PSTs and those further along in their teacher education programs may\nuse GenAI more frequently, but their perceptions of the application remain\nunchanged. However, PSTs expressed concerns about the accuracy and\ntrustworthiness of the information provided by GenAI applications. We,\ntherefore, suggest addressing these concerns to ensure PSTs can confidently\nrely on these applications in their teacher preparation programs. Additionally,\nwe recommend targeted strategies to integrate GenAI more effectively into both\nlearning and teaching processes for PSTs.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"XjT6VL08PzpdZ9wiefEZFQBReh5TEdR_IfCLZ8iKTlk","pdfSize":"413491"}