{"id":"2407.15617","title":"Norface: Improving Facial Expression Analysis by Identity Normalization","authors":"Hanwei Liu, Rudong An, Zhimeng Zhang, Bowen Ma, Wei Zhang, Yan Song,\n  Yujing Hu, Wei Chen, Yu Ding","authorsParsed":[["Liu","Hanwei",""],["An","Rudong",""],["Zhang","Zhimeng",""],["Ma","Bowen",""],["Zhang","Wei",""],["Song","Yan",""],["Hu","Yujing",""],["Chen","Wei",""],["Ding","Yu",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 13:24:32 GMT"}],"updateDate":"2024-07-23","timestamp":1721654672000,"abstract":"  Facial Expression Analysis remains a challenging task due to unexpected\ntask-irrelevant noise, such as identity, head pose, and background. To address\nthis issue, this paper proposes a novel framework, called Norface, that is\nunified for both Action Unit (AU) analysis and Facial Emotion Recognition (FER)\ntasks. Norface consists of a normalization network and a classification\nnetwork. First, the carefully designed normalization network struggles to\ndirectly remove the above task-irrelevant noise, by maintaining facial\nexpression consistency but normalizing all original images to a common identity\nwith consistent pose, and background. Then, these additional normalized images\nare fed into the classification network. Due to consistent identity and other\nfactors (e.g. head pose, background, etc.), the normalized images enable the\nclassification network to extract useful expression information more\neffectively. Additionally, the classification network incorporates a Mixture of\nExperts to refine the latent representation, including handling the input of\nfacial representations and the output of multiple (AU or emotion) labels.\nExtensive experiments validate the carefully designed framework with the\ninsight of identity normalization. The proposed method outperforms existing\nSOTA methods in multiple facial expression analysis tasks, including AU\ndetection, AU intensity estimation, and FER tasks, as well as their\ncross-dataset tasks. For the normalized datasets and code please visit\n{https://norface-fea.github.io/}.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"iQNRoPthaWLdoFpPPcyMWU5zp0_IxXwo6PqJGpMSyu0","pdfSize":"42193727"}