{"id":"2407.20012","title":"Investigation of kaonic atom optical potential by the high precision\n  data of kaonic $^3$He and $^4$He atoms","authors":"J. Yamagata-Sekihara (Kyoto Sangyo U.), Y. Iizawa (Tokyo Inst. Tech.),\n  D. Jido (Tokyo Inst. Tech.), N. Ikeno (Tottori U.), T. Hashimoto (Nishina\n  Car., RIKEN and RIKEN), S. Okada (Chubu U. and RIKEN), S. Hirenzaki (Nara\n  Women's U.)","authorsParsed":[["Yamagata-Sekihara","J.","","Kyoto Sangyo U."],["Iizawa","Y.","","Tokyo Inst. Tech."],["Jido","D.","","Tokyo Inst. Tech."],["Ikeno","N.","","Tottori U."],["Hashimoto","T.","","Nishina\n  Car., RIKEN and RIKEN"],["Okada","S.","","Chubu U. and RIKEN"],["Hirenzaki","S.","","Nara\n  Women's U."]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 13:44:09 GMT"}],"updateDate":"2024-07-30","timestamp":1722260649000,"abstract":"  We theoretically investigate kaonic atom states based on the latest high\nprecision data of the $2p$ states of the kaonic atoms in $^3$He and $^4$He\n(J-PARC E62). We consider the phenomenological form for the optical potential\nproportional to the nuclear density distributions and determine the potential\nparameters by the latest data. We find two sets of potential parameters for\neach of $K^--^3$He and $K^--^4$He that reproduce the data. We then extract the\npotential parameters consistent with the data of $^3$He and $^4$He atoms\nsimultaneously. Using the potential, we investigate the structure of the kaonic\natoms and kaonic nuclei for various nuclei up to Sn. We also report the optical\npotential parameters suited for the global description of the atomic data, the\npossible strong isospin dependence of the potential, and the different strength\nof the data of $K^--^3$He and $K^--^4$He in the restrictions on the potential\nparameters. In addition, we find that the study of the $1s$ states of the\nkaonic helium atom is very interesting as a next step, and the determination of\nthe orbital angular momenta of the kaonic nuclear states is helpful for the\nunified understandings of the atomic and nuclear bound states of kaon because\nof the mutual influence between the atomic and the nuclear states of kaon with\nthe same orbital angular momentum.\n","subjects":["Physics/Nuclear Theory","Physics/High Energy Physics - Experiment","Physics/High Energy Physics - Phenomenology","Physics/Nuclear Experiment"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"dhq8x6MNBv2BUJRHc4CLnbrpt4Ui4U-jIxVN9CxOxhE","pdfSize":"624914"}