{"id":"2407.08563","title":"Vox Populi, Vox AI? Using Language Models to Estimate German Public\n  Opinion","authors":"Leah von der Heyde, Anna-Carolina Haensch, Alexander Wenz","authorsParsed":[["von der Heyde","Leah",""],["Haensch","Anna-Carolina",""],["Wenz","Alexander",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 14:52:18 GMT"}],"updateDate":"2024-07-12","timestamp":1720709538000,"abstract":"  The recent development of large language models (LLMs) has spurred\ndiscussions about whether LLM-generated \"synthetic samples\" could complement or\nreplace traditional surveys, considering their training data potentially\nreflects attitudes and behaviors prevalent in the population. A number of\nmostly US-based studies have prompted LLMs to mimic survey respondents, with\nsome of them finding that the responses closely match the survey data. However,\nseveral contextual factors related to the relationship between the respective\ntarget population and LLM training data might affect the generalizability of\nsuch findings. In this study, we investigate the extent to which LLMs can\nestimate public opinion in Germany, using the example of vote choice. We\ngenerate a synthetic sample of personas matching the individual characteristics\nof the 2017 German Longitudinal Election Study respondents. We ask the LLM\nGPT-3.5 to predict each respondent's vote choice and compare these predictions\nto the survey-based estimates on the aggregate and subgroup levels. We find\nthat GPT-3.5 does not predict citizens' vote choice accurately, exhibiting a\nbias towards the Green and Left parties. While the LLM captures the tendencies\nof \"typical\" voter subgroups, such as partisans, it misses the multifaceted\nfactors swaying individual voter choices. By examining the LLM-based prediction\nof voting behavior in a new context, our study contributes to the growing body\nof research about the conditions under which LLMs can be leveraged for studying\npublic opinion. The findings point to disparities in opinion representation in\nLLMs and underscore the limitations in applying them for public opinion\nestimation.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computers and Society","Statistics/Applications"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"bxsEPbG4zW-jpMK3a5wixdB4brjg-Vhy60H4p2ZuiLo","pdfSize":"3028925"}