{"id":"2407.04099","title":"SUPER VIII. Fast and Furious at $z\\sim2$: obscured type-2 active nuclei\n  host faster ionised winds than type-1 systems","authors":"G. Tozzi, G. Cresci, M. Perna, V. Mainieri, F. Mannucci, A. Marconi,\n  D. Kakkad, A. Marasco, M. Brusa, E. Bertola, M. Bischetti, S. Carniani, C.\n  Cicone, C. Circosta, F. Fiore, C. Feruglio, C. M. Harrison, I. Lamperti, H.\n  Netzer, E. Piconcelli, A. Puglisi, J. Scholtz, G. Vietri, C. Vignali, and G.\n  Zamorani","authorsParsed":[["Tozzi","G.",""],["Cresci","G.",""],["Perna","M.",""],["Mainieri","V.",""],["Mannucci","F.",""],["Marconi","A.",""],["Kakkad","D.",""],["Marasco","A.",""],["Brusa","M.",""],["Bertola","E.",""],["Bischetti","M.",""],["Carniani","S.",""],["Cicone","C.",""],["Circosta","C.",""],["Fiore","F.",""],["Feruglio","C.",""],["Harrison","C. M.",""],["Lamperti","I.",""],["Netzer","H.",""],["Piconcelli","E.",""],["Puglisi","A.",""],["Scholtz","J.",""],["Vietri","G.",""],["Vignali","C.",""],["Zamorani","G.",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 18:00:45 GMT"}],"updateDate":"2024-07-08","timestamp":1720116045000,"abstract":"  We present spatially resolved VLT/SINFONI spectroscopy with adaptive optics\nof type-2 active galactic nuclei (AGN) from the SINFONI Survey for Unveiling\nthe Physics and Effect of Radiative feedback (SUPER), which targeted X-ray\nbright ($L_{2-10 keV}\\gtrsim10^{42}$ erg s$^{-1}$) AGN at Cosmic Noon\n($z\\sim2$). Our analysis of the rest-frame optical spectra unveils ionised\noutflows in all seven examined targets, as traced via [OIII]$\\lambda$5007 line\nemission, moving at $v\\gtrsim600$ km s$^{-1}$. In six objects these outflows\nare clearly spatially resolved and extend on 2-4 kpc scales, whereas marginally\nresolved in the remaining one. Interestingly, these SUPER type-2 AGN are all\nheavily obscured sources ($N_{H}\\gtrsim10^{23}$ cm$^{-2}$) and host faster\nionised outflows than their type-1 counterparts within the same range of\nbolometric luminosity ($L_{bol} \\sim 10^{44.8-46.5}$ erg s$^{-1}$). SUPER has\nhence provided observational evidence that the type-1/type-2 dichotomy at\n$z\\sim2$ might not be driven simply by projection effects, but might reflect\ntwo distinct obscuring life stages of active galaxies, as predicted by\nevolutionary models. Within this picture, SUPER type-2 AGN might be undergoing\nthe 'blow-out' phase, where the large amount of obscuring material efficiently\naccelerates large-scale outflows via radiation pressure on dust, eventually\nunveiling the central active nucleus and signal the start of the bright,\nunobscured type-1 AGN phase. Moreover, the overall population of ionised\noutflows detected in SUPER has velocities comparable with the escape speed of\ntheir dark matter halos, and in general high enough to reach 30-50 kpc\ndistances from the centre. These outflows are hence likely to sweep away the\ngas (at least) out of the baryonic disk and/or to heat the host gas reservoir,\nthus reducing and possibly quenching star formation.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"54Ilp10B1_pKY-SG0dQVvykHabFUqq46TUnQFQsi3iQ","pdfSize":"3173258"}