{"id":"2407.21189","title":"Multi-task Photonic Reservoir Computing: Wavelength Division\n  Multiplexing for Parallel Computing with a Silicon Microring Resonator","authors":"Bernard J. Giron Castro, Christophe Peucheret, Darko Zibar and\n  Francesco Da Ros","authorsParsed":[["Castro","Bernard J. Giron",""],["Peucheret","Christophe",""],["Zibar","Darko",""],["Da Ros","Francesco",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 20:54:07 GMT"}],"updateDate":"2024-08-01","timestamp":1722372847000,"abstract":"  Nowadays, as the ever-increasing demand for more powerful computing resources\ncontinues, alternative advanced computing paradigms are under extensive\ninvestigation. Significant effort has been made to deviate from conventional\nVon Neumann architectures. In-memory computing has emerged in the field of\nelectronics as a possible solution to the infamous bottleneck between memory\nand computing processors, which reduces the effective throughput of data. In\nphotonics, novel schemes attempt to collocate the computing processor and\nmemory in a single device. Photonics offers the flexibility of multiplexing\nstreams of data not only spatially and in time, but also in frequency or,\nequivalently, in wavelength, which makes it highly suitable for parallel\ncomputing. Here, we numerically show the use of time and wavelength division\nmultiplexing (WDM) to solve four independent tasks at the same time in a single\nphotonic chip, serving as a proof of concept for our proposal. The system is a\ntime-delay reservoir computing (TDRC) based on a microring resonator (MRR). The\naddressed tasks cover different applications: Time-series prediction, waveform\nsignal classification, wireless channel equalization, and radar signal\nprediction. The system is also tested for simultaneous computing of up to 10\ninstances of the same task, exhibiting excellent performance. The footprint of\nthe system is reduced by using time-division multiplexing of the nodes that act\nas the neurons of the studied neural network scheme. WDM is used for the\nparallelization of wavelength channels, each addressing a single task. By\nadjusting the input power and frequency of each optical channel, we can achieve\nlevels of performance for each of the tasks that are comparable to those quoted\nin state-of-the-art reports focusing on single-task operation...\n","subjects":["Computing Research Repository/Neural and Evolutionary Computing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning","Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"pkNQzoyJT7zpqnp6NVMx60IsK9ClotFIqPy-2WsjEJA","pdfSize":"7766484"}