{"id":"2407.03444","title":"Fault-Tolerant Decentralized Control for Large-scale Inverter-based\n  Resources for Active Power Tracking","authors":"Satish Vedula, Ayobami Olajube and Olugbenga Anubi","authorsParsed":[["Vedula","Satish",""],["Olajube","Ayobami",""],["Anubi","Olugbenga",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 18:41:58 GMT"},{"version":"v2","created":"Mon, 29 Jul 2024 18:40:06 GMT"}],"updateDate":"2024-07-31","timestamp":1720032118000,"abstract":"  Integration of Inverter Based Resources (IBRs) which lack the intrinsic\ncharacteristics such as the inertial response of the traditional\nsynchronous-generator (SG) based sources presents a new challenge in the form\nof analyzing the grid stability under their presence. While the dynamic\ncomposition of IBRs differs from that of the SGs, the control objective remains\nsimilar in terms of tracking the desired active power. This letter presents a\ndecentralized primal-dual-based fault-tolerant control framework for the power\nallocation in IBRs. Overall, a hierarchical control algorithm is developed with\na lower level addressing the current control and the parameter estimation for\nthe IBRs and the higher level acting as the reference power generator to the\nlow level based on the desired active power profile. The decentralized\nnetwork-based algorithm adaptively splits the desired power between the IBRs\ntaking into consideration the health of the IBRs transmission lines. The\nproposed framework is tested through a simulation on the network of IBRs and\nthe high-level controller performance is compared against the existing\nframework in the literature. The proposed algorithm shows significant\nperformance improvement in the magnitude of power deviation and settling time\nto the nominal value under faulty conditions as compared to the algorithm in\nthe literature.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"wL0EfguVSbUBu_JECHKOGWcM_t88jSoiuds4F9r60z0","pdfSize":"1135073"}