{"id":"2407.14061","title":"Signatures of Massive Black Hole Merger Host Galaxies from Cosmological\n  Simulations II: Unique Stellar Kinematics in Integral Field Unit Spectroscopy","authors":"Jaeden Bardati, John J. Ruan, Daryl Haggard, Michael Tremmel, Patrick\n  Horlaville","authorsParsed":[["Bardati","Jaeden",""],["Ruan","John J.",""],["Haggard","Daryl",""],["Tremmel","Michael",""],["Horlaville","Patrick",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 06:39:35 GMT"}],"updateDate":"2024-07-22","timestamp":1721371175000,"abstract":"  Secure methods for identifying the host galaxies of individual massive black\nhole (MBH) binaries and mergers detected by gravitational wave experiments such\nas LISA and Pulsar Timing Arrays are currently lacking, but will be critical to\na variety of science goals. Recently in Bardati et al. (2024, Paper I), we used\nthe Romulus25 cosmological simulation to show that MBH merger host galaxies\nhave unique morphologies in imaging, due to their stronger bulges. Here, we use\nthe same sample of simulated MBH merger host galaxies to investigate their\nstellar kinematics, as probed by optical integral field unit (IFU)\nspectroscopy. We perform stellar population synthesis and dust radiative\ntransfer to generate synthetic 3D optical spectral datacubes of each simulated\ngalaxy, and produce mock stellar kinematic maps. Based on a linear discriminant\nanalysis of a combination of kinematic parameters derived from these maps, we\nshow that this approach can identify MBH binary and merger host galaxies with\naccuracies that increase with chirp mass and mass ratio. For mergers with high\nchirp masses (>10^8.2 Msun) and high mass ratios (>0.5), the accuracies reach\n>85%, and their host galaxies are uniquely characterized by slower rotation and\nstronger stellar kinematic misalignments. These kinematic properties are\ncommonly associated with massive early-type galaxies that have experienced\nmajor mergers, and naturally act as signposts for MBH binaries and mergers with\nhigh chirp masses and mass ratios. These results suggest that IFU spectroscopy\nshould also play a role in telescope follow-up of future MBH binaries and\nmergers detected in gravitational waves\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"vk1DOroqxTBU-wUAWZqG9mGJ5gqvXmBgJWbUNW3dXVo","pdfSize":"1247091"}