{"id":"2407.03852","title":"Low-latency machine learning FPGA accelerator for multi-qubit-state\n  discrimination","authors":"Pradeep Kumar Gautam, Shantharam Kalipatnapu, Shankaranarayanan H,\n  Ujjawal Singhal, Benjamin Lienhard, Vibhor Singh and Chetan Singh Thakur","authorsParsed":[["Gautam","Pradeep Kumar",""],["Kalipatnapu","Shantharam",""],["H","Shankaranarayanan",""],["Singhal","Ujjawal",""],["Lienhard","Benjamin",""],["Singh","Vibhor",""],["Thakur","Chetan Singh",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 11:34:43 GMT"},{"version":"v2","created":"Wed, 14 Aug 2024 18:00:57 GMT"}],"updateDate":"2024-08-16","timestamp":1720092883000,"abstract":"  Measuring a qubit state is a fundamental yet error-prone operation in quantum\ncomputing. These errors can arise from various sources, such as crosstalk,\nspontaneous state transitions, and excitations caused by the readout pulse.\nHere, we utilize an integrated approach to deploy neural networks onto\nfield-programmable gate arrays (FPGA). We demonstrate that implementing a fully\nconnected neural network accelerator for multi-qubit readout is advantageous,\nbalancing computational complexity with low latency requirements without\nsignificant loss in accuracy. The neural network is implemented by quantizing\nweights, activation functions, and inputs. The hardware accelerator performs\nfrequency-multiplexed readout of five superconducting qubits in less than 50 ns\non a radio frequency system on chip (RFSoC) ZCU111 FPGA, marking the advent of\nRFSoC-based low-latency multi-qubit readout using neural networks. These\nmodules can be implemented and integrated into existing quantum control and\nreadout platforms, making the RFSoC ZCU111 ready for experimental deployment.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Hardware Architecture","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"U8R63K6OZRdokYiYK5uJnNyAb8nIK878_Yd0VGEvNfU","pdfSize":"2567629"}