{"id":"2407.20779","title":"Phase Transition Dynamics of Black Holes Influenced by Kaniadakis and\n  Barrow Statistics","authors":"Jafar Sadeghi, Mohammad Ali S. Afshar, Mohammad Reza Alipour, Saeed\n  Noori Gashti","authorsParsed":[["Sadeghi","Jafar",""],["Afshar","Mohammad Ali S.",""],["Alipour","Mohammad Reza",""],["Gashti","Saeed Noori",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 12:33:04 GMT"}],"updateDate":"2024-07-31","timestamp":1722342784000,"abstract":"  In this study, we investigate the dynamics and frame-by-frame phase\ntransition of the first order in black hole thermodynamics. For our analysis,\nwe will utilize the Kramers escape rate. Our focus is on charged anti-de Sitter\n(AdS) black holes influenced by Kaniadakis and Barrow statistics. The selection\nof these black holes aims to examine the effects of entropy variation on the\ndynamics of phase transition and to demonstrate that the Kramers escape rate,\nas an efficient tool, can effectively represent the dynamic transition from a\nsmall to a large black hole within the domain of first-order phase transitions.\nIt is noteworthy that while the transition from small to large black holes\nshould ostensibly dominate the entire process, our results indicate that the\nescape rate undergoes changes as it passes through the midpoint of the phase\ntransition, leading to a reverse escape phenomenon. The findings suggest that\nthe dynamic phase transition in charged AdS black holes affected by entropy\nchange bears a significant resemblance to the outcomes of models influenced by\nBekenstein-Hawking entropy\\cite{23}. This similarity in results could serve as\nan additional motivation to further explore the potential capabilities of\nKaniadakis and Barrow statistics in related cosmological fields. These\ncapabilities could enhance our understanding of other cosmological properties\n","subjects":["Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"5CXtregs1TlgpvrNCj5Fmx3nafpUyE-gmp9A67AM5QE","pdfSize":"1008197"}