{"id":"2407.01064","title":"Magnetic Polarisability of Octet Baryons via Lattice QCD","authors":"Thomas Kabelitz (1), Ryan Bignell (2), Waseem Kamleh (1), Derek\n  Leinweber (1) ((1) University of Adelaide, (2) Trinity College)","authorsParsed":[["Kabelitz","Thomas","","University of Adelaide"],["Bignell","Ryan","","Trinity College"],["Kamleh","Waseem","","University of Adelaide"],["Leinweber","Derek","","University of Adelaide"]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 08:13:05 GMT"},{"version":"v2","created":"Thu, 4 Jul 2024 06:45:57 GMT"}],"updateDate":"2024-07-08","timestamp":1719821585000,"abstract":"  Drawing on recent advances in lattice-QCD background-field techniques, the\nmagnetic polarisability of octet baryons is calculated from the first\nprinciples of QCD. The results are presented in the context of new constituent\nquark-model calculations providing a framework for understanding the lattice\nresults and a direct comparison with simulation results at unphysical quark\nmasses. Using smeared quark sources, low-lying Laplacian eigenmode projection\nand final-state Landau mode projection, considerable attention is devoted to\nensuring single-state isolation in the lattice correlation functions. We also\nintroduce new weighting methods to reduce the sensitivity to\ncorrelation-function fits, averaging over many fits based on merit drawn from\nthe full correlated $\\chi^2$ of the fits. The techniques are implemented on the\n$32^3 \\times 64$, 2+1-flavour dynamical-fermion lattices provided by the\nPACS-CS collaboration following the introduction of uniform magnetic fields\nquantised to the lowest nontrivial values available. After some fine tuning of\nthe constituent quark model parameters, we find the model captures the patterns\nobserved in the lattice QCD results very well, providing important insights\ninto the physics underpinning the magnetic polarisabilities. Finally,\ncomparison with the most recent results from experiment proceeds through an\neffective field theory formalism which incorporates estimates of finite-volume\ncorrections and small electro-quenching corrections as the results are brought\nto the physical point. We find excellent agreement with experiment where\navailable, including the proton and neutron polarisabilities.\n","subjects":["Physics/High Energy Physics - Lattice","Physics/High Energy Physics - Phenomenology","Physics/Nuclear Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0BIHtEHNHtw845eF_OaDs6lsZLS67G0y_PMmUAHd_qo","pdfSize":"5565906","objectId":"0x2960c6567c7c29c474dc5022848fbec4cd3be37ee7f1aa239ca924d99a1aa7a6","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
