{"id":"2407.11268","title":"Heterogenous Multi-Source Data Fusion Through Input Mapping and Latent\n  Variable Gaussian Process","authors":"Yigitcan Comlek, Sandipp Krishnan Ravi, Piyush Pandita, Sayan Ghosh,\n  Liping Wang, Wei Chen","authorsParsed":[["Comlek","Yigitcan",""],["Ravi","Sandipp Krishnan",""],["Pandita","Piyush",""],["Ghosh","Sayan",""],["Wang","Liping",""],["Chen","Wei",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 22:27:04 GMT"}],"updateDate":"2024-07-17","timestamp":1721082424000,"abstract":"  Artificial intelligence and machine learning frameworks have served as\ncomputationally efficient mapping between inputs and outputs for engineering\nproblems. These mappings have enabled optimization and analysis routines that\nhave warranted superior designs, ingenious material systems and optimized\nmanufacturing processes. A common occurrence in such modeling endeavors is the\nexistence of multiple source of data, each differentiated by fidelity,\noperating conditions, experimental conditions, and more. Data fusion frameworks\nhave opened the possibility of combining such differentiated sources into\nsingle unified models, enabling improved accuracy and knowledge transfer.\nHowever, these frameworks encounter limitations when the different sources are\nheterogeneous in nature, i.e., not sharing the same input parameter space.\nThese heterogeneous input scenarios can occur when the domains differentiated\nby complexity, scale, and fidelity require different parametrizations. Towards\naddressing this void, a heterogeneous multi-source data fusion framework is\nproposed based on input mapping calibration (IMC) and latent variable Gaussian\nprocess (LVGP). In the first stage, the IMC algorithm is utilized to transform\nthe heterogeneous input parameter spaces into a unified reference parameter\nspace. In the second stage, a multi-source data fusion model enabled by LVGP is\nleveraged to build a single source-aware surrogate model on the transformed\nreference space. The proposed framework is demonstrated and analyzed on three\nengineering case studies (design of cantilever beam, design of ellipsoidal void\nand modeling properties of Ti6Al4V alloy). The results indicate that the\nproposed framework provides improved predictive accuracy over a single source\nmodel and transformed but source unaware model.\n","subjects":["Statistics/Machine Learning","Computing Research Repository/Computational Engineering, Finance, and Science","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"LPfp-VV06N64rz7uONWNVHhDjfe9epeNyCJNDxz8_F4","pdfSize":"5814508"}