{"id":"2407.07300","title":"From Principles to Rules: A Regulatory Approach for Frontier AI","authors":"Jonas Schuett, Markus Anderljung, Alexis Carlier, Leonie Koessler, Ben\n  Garfinkel","authorsParsed":[["Schuett","Jonas",""],["Anderljung","Markus",""],["Carlier","Alexis",""],["Koessler","Leonie",""],["Garfinkel","Ben",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 01:45:15 GMT"}],"updateDate":"2024-07-11","timestamp":1720575915000,"abstract":"  Several jurisdictions are starting to regulate frontier artificial\nintelligence (AI) systems, i.e. general-purpose AI systems that match or exceed\nthe capabilities present in the most advanced systems. To reduce risks from\nthese systems, regulators may require frontier AI developers to adopt safety\nmeasures. The requirements could be formulated as high-level principles (e.g.\n'AI systems should be safe and secure') or specific rules (e.g. 'AI systems\nmust be evaluated for dangerous model capabilities following the protocol set\nforth in...'). These regulatory approaches, known as 'principle-based' and\n'rule-based' regulation, have complementary strengths and weaknesses. While\nspecific rules provide more certainty and are easier to enforce, they can\nquickly become outdated and lead to box-ticking. Conversely, while high-level\nprinciples provide less certainty and are more costly to enforce, they are more\nadaptable and more appropriate in situations where the regulator is unsure\nexactly what behavior would best advance a given regulatory objective. However,\nrule-based and principle-based regulation are not binary options. Policymakers\nmust choose a point on the spectrum between them, recognizing that the right\nlevel of specificity may vary between requirements and change over time. We\nrecommend that policymakers should initially (1) mandate adherence to\nhigh-level principles for safe frontier AI development and deployment, (2)\nensure that regulators closely oversee how developers comply with these\nprinciples, and (3) urgently build up regulatory capacity. Over time, the\napproach should likely become more rule-based. Our recommendations are based on\na number of assumptions, including (A) risks from frontier AI systems are\npoorly understood and rapidly evolving, (B) many safety practices are still\nnascent, and (C) frontier AI developers are best placed to innovate on safety\npractices.\n","subjects":["Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"48PdiSDal8DO1l-Iby71WAlB_VmLC2b7VXCx8V1AlGQ","pdfSize":"1419251"}