{"id":"2407.16993","title":"LoFormer: Local Frequency Transformer for Image Deblurring","authors":"Xintian Mao, Jiansheng Wang, Xingran Xie, Qingli Li, Yan Wang","authorsParsed":[["Mao","Xintian",""],["Wang","Jiansheng",""],["Xie","Xingran",""],["Li","Qingli",""],["Wang","Yan",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 04:27:03 GMT"}],"updateDate":"2024-07-25","timestamp":1721795223000,"abstract":"  Due to the computational complexity of self-attention (SA), prevalent\ntechniques for image deblurring often resort to either adopting localized SA or\nemploying coarse-grained global SA methods, both of which exhibit drawbacks\nsuch as compromising global modeling or lacking fine-grained correlation. In\norder to address this issue by effectively modeling long-range dependencies\nwithout sacrificing fine-grained details, we introduce a novel approach termed\nLocal Frequency Transformer (LoFormer). Within each unit of LoFormer, we\nincorporate a Local Channel-wise SA in the frequency domain (Freq-LC) to\nsimultaneously capture cross-covariance within low- and high-frequency local\nwindows. These operations offer the advantage of (1) ensuring equitable\nlearning opportunities for both coarse-grained structures and fine-grained\ndetails, and (2) exploring a broader range of representational properties\ncompared to coarse-grained global SA methods. Additionally, we introduce an MLP\nGating mechanism complementary to Freq-LC, which serves to filter out\nirrelevant features while enhancing global learning capabilities. Our\nexperiments demonstrate that LoFormer significantly improves performance in the\nimage deblurring task, achieving a PSNR of 34.09 dB on the GoPro dataset with\n126G FLOPs. https://github.com/DeepMed-Lab-ECNU/Single-Image-Deblur\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"icY28HWZftJWj3KHJFJHkViPMwv6XtFM7ofridXKOS4","pdfSize":"40900675","objectId":"0x26fbc13802f0e28eb01d0ff359aef80ab70852b2d0d7bf26be080645cd072b98","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
