{"id":"2407.07778","title":"WorldAPIs: The World Is Worth How Many APIs? A Thought Experiment","authors":"Jiefu Ou, Arda Uzunoglu, Benjamin Van Durme, Daniel Khashabi","authorsParsed":[["Ou","Jiefu",""],["Uzunoglu","Arda",""],["Van Durme","Benjamin",""],["Khashabi","Daniel",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 15:52:44 GMT"}],"updateDate":"2024-07-11","timestamp":1720626764000,"abstract":"  AI systems make decisions in physical environments through primitive actions\nor affordances that are accessed via API calls. While deploying AI agents in\nthe real world involves numerous high-level actions, existing embodied\nsimulators offer a limited set of domain-salient APIs. This naturally brings up\nthe questions: how many primitive actions (APIs) are needed for a versatile\nembodied agent, and what should they look like? We explore this via a thought\nexperiment: assuming that wikiHow tutorials cover a wide variety of\nhuman-written tasks, what is the space of APIs needed to cover these\ninstructions? We propose a framework to iteratively induce new APIs by\ngrounding wikiHow instruction to situated agent policies. Inspired by recent\nsuccesses in large language models (LLMs) for embodied planning, we propose a\nfew-shot prompting to steer GPT-4 to generate Pythonic programs as agent\npolicies and bootstrap a universe of APIs by 1) reusing a seed set of APIs; and\nthen 2) fabricate new API calls when necessary. The focus of this thought\nexperiment is on defining these APIs rather than their executability. We apply\nthe proposed pipeline on instructions from wikiHow tutorials. On a small\nfraction (0.5%) of tutorials, we induce an action space of 300+ APIs necessary\nfor capturing the rich variety of tasks in the physical world. A detailed\nautomatic and human analysis of the induction output reveals that the proposed\npipeline enables effective reuse and creation of APIs. Moreover, a manual\nreview revealed that existing simulators support only a small subset of the\ninduced APIs (9 of the top 50 frequent APIs), motivating the development of\naction-rich embodied environments.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"JFWFWxyThqEbLaybXfNsnZfti82q1oBViZX7mxGFpD4","pdfSize":"1146798"}