{"id":"2407.19533","title":"FreeShell: A Context-Free 4D Printing Technique for Fabricating Complex\n  3D Triangle Mesh Shells","authors":"Chao Yuan, Nan Cao, Xuejiao Ma, and Shengqi Dang","authorsParsed":[["Yuan","Chao",""],["Cao","Nan",""],["Ma","Xuejiao",""],["Dang","Shengqi",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 16:47:17 GMT"}],"updateDate":"2024-07-30","timestamp":1722185237000,"abstract":"  Freeform thin-shell surfaces are critical in various fields, but their\nfabrication is complex and costly. Traditional methods are wasteful and require\ncustom molds, while 3D printing needs extensive support structures and\npost-processing. Thermoshrinkage actuated 4D printing is an effective method\nthrough flat structures fabricating 3D shell. However, existing research faces\nissues related to precise deformation and limited robustness. Addressing these\nissues is challenging due to three key factors: (1) Difficulty in finding a\nuniversal method to control deformation across different materials; (2)\nVariability in deformation influenced by factors such as printing speed, layer\nthickness, and heating temperature; (3) Environmental factors affecting the\ndeformation process. To overcome these challenges, we introduce FreeShell, a\nrobust 4D printing technique that uses thermoshrinkage to create precise 3D\nshells. This method prints triangular tiles connected by shrinkable connectors\nfrom a single material. Upon heating, the connectors shrink, moving the tiles\nto form the desired 3D shape, simplifying fabrication and reducing material and\nenvironment dependency. An optimized algorithm for flattening 3D meshes ensures\nprecision in printing. FreeShell demonstrates its effectiveness through various\nexamples and experiments, showcasing accuracy, robustness, and strength,\nrepresenting advancement in fabricating complex freeform surfaces.\n","subjects":["Computing Research Repository/Graphics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"lbZsPBvp8CVoqLNWDFPtaEqlkslKjCDOU4R-kJzt2rc","pdfSize":"4381272"}