{"id":"2407.06235","title":"Auditing of AI: Legal, Ethical and Technical Approaches","authors":"Jakob Mokander","authorsParsed":[["Mokander","Jakob",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 12:49:58 GMT"}],"updateDate":"2024-07-10","timestamp":1720356598000,"abstract":"  AI auditing is a rapidly growing field of research and practice. This review\narticle, which doubles as an editorial to Digital Societys topical collection\non Auditing of AI, provides an overview of previous work in the field. Three\nkey points emerge from the review. First, contemporary attempts to audit AI\nsystems have much to learn from how audits have historically been structured\nand conducted in areas like financial accounting, safety engineering and the\nsocial sciences. Second, both policymakers and technology providers have an\ninterest in promoting auditing as an AI governance mechanism. Academic\nresearchers can thus fill an important role by studying the feasibility and\neffectiveness of different AI auditing procedures. Third, AI auditing is an\ninherently multidisciplinary undertaking, to which substantial contributions\nhave been made by computer scientists and engineers as well as social\nscientists, philosophers, legal scholars and industry practitioners. Reflecting\nthis diversity of perspectives, different approaches to AI auditing have\ndifferent affordances and constraints. Specifically, a distinction can be made\nbetween technology-oriented audits, which focus on the properties and\ncapabilities of AI systems, and process oriented audits, which focus on\ntechnology providers governance structures and quality management systems. The\nnext step in the evolution of auditing as an AI governance mechanism, this\narticle concludes, should be the interlinking of these available (and\ncomplementary) approaches into structured and holistic procedures to audit not\nonly how AI systems are designed and used but also how they impact users,\nsocieties and the natural environment in applied settings over time.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"rfWGUHwrXOFqUiq0z0x_f4J2GGMrT7TWrCflJ-SvNVs","pdfSize":"637499"}