{"id":"2407.05739","title":"Multi-Bit Mechanism: A Novel Information Transmission Paradigm for\n  Spiking Neural Networks","authors":"Yongjun Xiao, Xianlong Tian, Yongqi Ding, Pei He, Mengmeng Jing, Lin\n  Zuo","authorsParsed":[["Xiao","Yongjun",""],["Tian","Xianlong",""],["Ding","Yongqi",""],["He","Pei",""],["Jing","Mengmeng",""],["Zuo","Lin",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 08:46:31 GMT"}],"updateDate":"2024-07-09","timestamp":1720428391000,"abstract":"  Since proposed, spiking neural networks (SNNs) gain recognition for their\nhigh performance, low power consumption and enhanced biological\ninterpretability. However, while bringing these advantages, the binary nature\nof spikes also leads to considerable information loss in SNNs, ultimately\ncausing performance degradation. We claim that the limited expressiveness of\ncurrent binary spikes, resulting in substantial information loss, is the\nfundamental issue behind these challenges. To alleviate this, our research\nintroduces a multi-bit information transmission mechanism for SNNs. This\nmechanism expands the output of spiking neurons from the original single bit to\nmultiple bits, enhancing the expressiveness of the spikes and reducing\ninformation loss during the forward process, while still maintaining the low\nenergy consumption advantage of SNNs. For SNNs, this represents a new paradigm\nof information transmission. Moreover, to further utilize the limited spikes,\nwe extract effective signals from the previous layer to re-stimulate the\nneurons, thus encouraging full spikes emission across various bit levels. We\nconducted extensive experiments with our proposed method using both direct\ntraining method and ANN-SNN conversion method, and the results show consistent\nperformance improvements.\n","subjects":["Computing Research Repository/Neural and Evolutionary Computing","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"irfdzDhQcGhOvGkjhy6B1MlF4En4LOgmfvPaEfuLDgg","pdfSize":"743090"}