{"id":"2407.08620","title":"History-Determinism vs Fair Simulation","authors":"Udi Boker, Thomas A. Henzinger, Karoliina Lehtinen, Aditya Prakash","authorsParsed":[["Boker","Udi",""],["Henzinger","Thomas A.",""],["Lehtinen","Karoliina",""],["Prakash","Aditya",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 15:57:08 GMT"}],"updateDate":"2024-07-12","timestamp":1720713428000,"abstract":"  An automaton is history-deterministic if its nondeterminism can be resolved\non the fly, only using the prefix of the word read so far. This mild form of\nnondeterminism has attracted particular attention for its applications in\nsynthesis problems. An automaton $A$ is guidable with respect to a class $C$ of\nautomata if it can fairly simulate every automaton in $C$ whose language is\ncontained in that of $A$. In other words, guidable automata are those for which\ninclusion and simulation coincide, making them particularly interesting for\nmodel-checking.\n  We study the connection between these two notions, and specifically the\nquestion of when they coincide. For classes of automata on which they do,\ndeciding guidability, an otherwise challenging decision problem, reduces to\ndeciding history-determinism, a problem that is starting to be well-understood\nfor many classes.\n  We provide a selection of sufficient criteria for a class of automata to\nguarantee the coincidence of the notions, and use them to show that the notions\ncoincide for the most common automata classes, among which are $\\omega$-regular\nautomata and many infinite-state automata with safety and reachability\nacceptance conditions, including vector addition systems with states,\none-counter nets, pushdown-, Parikh-, and timed-automata.\n  We also demonstrate that history-determinism and guidability do not always\ncoincide, for example, for the classes of timed automata with a fixed number of\nclocks.\n","subjects":["Computing Research Repository/Formal Languages and Automata Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"32HE0IQABquwLkyRHbwVzqGeS6alnEgvzJGC1YNcFlE","pdfSize":"827892","objectId":"0x642b80981438a861e5b037462c905bb96fa84642dfb71c904d6aeec10671457c","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
