{"id":"2407.20212","title":"Distributed Quantum Approximate Optimization Algorithm on Integrated\n  High-Performance Computing and Quantum Computing Systems for Large-Scale\n  Optimization","authors":"Seongmin Kim, Tengfei Luo, Eungkyu Lee, and In-Saeng Suh","authorsParsed":[["Kim","Seongmin",""],["Luo","Tengfei",""],["Lee","Eungkyu",""],["Suh","In-Saeng",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 17:42:25 GMT"}],"updateDate":"2024-07-31","timestamp":1722274945000,"abstract":"  Quantum approximated optimization algorithm (QAOA) has shown promise for\nsolving combinatorial optimization problems by providing quantum speedup on\nnear-term gate-based quantum computing systems. However, QAOA faces challenges\nin optimizing variational parameters for high-dimensional problems due to the\nlarge number of qubits required and the complexity of deep circuits, which\nlimit its scalability for real-world applications. In this study, we propose a\ndistributed QAOA (DQAOA), which leverages a high-performance computing-quantum\ncomputing (HPC-QC) integrated system. DQAOA leverages distributed computing\nstrategies to decompose a large job into smaller tasks, which are then\nprocessed on the HPC-QC system. The global solution is iteratively updated by\naggregating sub-solutions obtained from DQAOA, allowing convergence toward the\noptimal solution. We demonstrate that DQAOA can handle considerably large-scale\noptimization problems (e.g., 1,000-bit problem) achieving high accuracy (~99%)\nand short time-to-solution (~276 s). To apply this algorithm to material\nscience, we further develop an active learning algorithm integrated with our\nDQAOA (AL-DQAOA), which involves machine learning, DQAOA, and active data\nproduction in an iterative loop. We successfully optimize photonic structures\nusing AL-DQAOA, indicating that solving real-world optimization problems using\ngate-based quantum computing is feasible with our strategies. We expect the\nproposed DQAOA to be applicable to a wide range of optimization problems and\nAL-DQAOA to find broader applications in material design.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing","Computing Research Repository/Computational Engineering, Finance, and Science","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"FNAYpn7gWldunqW1Kvd-wuF1wPwSVxgwM8zqfVa9IRI","pdfSize":"10585443"}