{"id":"2407.03925","title":"Reduced-Order Neural Operators: Learning Lagrangian Dynamics on Highly\n  Sparse Graphs","authors":"Hrishikesh Viswanath, Yue Chang, Julius Berner, Peter Yichen Chen,\n  Aniket Bera","authorsParsed":[["Viswanath","Hrishikesh",""],["Chang","Yue",""],["Berner","Julius",""],["Chen","Peter Yichen",""],["Bera","Aniket",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 13:37:26 GMT"}],"updateDate":"2024-07-08","timestamp":1720100246000,"abstract":"  We present a neural operator architecture to simulate Lagrangian dynamics,\nsuch as fluid flow, granular flows, and elastoplasticity. Traditional numerical\nmethods, such as the finite element method (FEM), suffer from long run times\nand large memory consumption. On the other hand, approaches based on graph\nneural networks are faster but still suffer from long computation times on\ndense graphs, which are often required for high-fidelity simulations. Our\nmodel, GIOROM or Graph Interaction Operator for Reduced-Order Modeling, learns\ntemporal dynamics within a reduced-order setting, capturing spatial features\nfrom a highly sparse graph representation of the input and generalizing to\narbitrary spatial locations during inference. The model is geometry-aware and\ndiscretization-agnostic and can generalize to different initial conditions,\nvelocities, and geometries after training. We show that point clouds of the\norder of 100,000 points can be inferred from sparse graphs with $\\sim$1000\npoints, with negligible change in computation time. We empirically evaluate our\nmodel on elastic solids, Newtonian fluids, Non-Newtonian fluids, Drucker-Prager\ngranular flows, and von Mises elastoplasticity. On these benchmarks, our\napproach results in a 25$\\times$ speedup compared to other neural network-based\nphysics simulators while delivering high-fidelity predictions of complex\nphysical systems and showing better performance on most benchmarks. The code\nand the demos are provided at https://github.com/HrishikeshVish/GIOROM.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"cULbGiLeZV7pB2dC7h-8_L1wZfjFt2UUQCYjDwFaa3U","pdfSize":"27034060"}