{"id":"2407.15171","title":"Assessing Sample Quality via the Latent Space of Generative Models","authors":"Jingyi Xu, Hieu Le, Dimitris Samaras","authorsParsed":[["Xu","Jingyi",""],["Le","Hieu",""],["Samaras","Dimitris",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 14:05:06 GMT"}],"updateDate":"2024-07-23","timestamp":1721570706000,"abstract":"  Advances in generative models increase the need for sample quality\nassessment. To do so, previous methods rely on a pre-trained feature extractor\nto embed the generated samples and real samples into a common space for\ncomparison. However, different feature extractors might lead to inconsistent\nassessment outcomes. Moreover, these methods are not applicable for domains\nwhere a robust, universal feature extractor does not yet exist, such as medical\nimages or 3D assets. In this paper, we propose to directly examine the latent\nspace of the trained generative model to infer generated sample quality. This\nis feasible because the quality a generated sample directly relates to the\namount of training data resembling it, and we can infer this information by\nexamining the density of the latent space. Accordingly, we use a latent density\nscore function to quantify sample quality. We show that the proposed score\ncorrelates highly with the sample quality for various generative models\nincluding VAEs, GANs and Latent Diffusion Models. Compared with previous\nquality assessment methods, our method has the following advantages: 1)\npre-generation quality estimation with reduced computational cost, 2)\ngeneralizability to various domains and modalities, and 3) applicability to\nlatent-based image editing and generation methods. Extensive experiments\ndemonstrate that our proposed methods can benefit downstream tasks such as\nfew-shot image classification and latent face image editing. Code is available\nat https://github.com/cvlab-stonybrook/LS-sample-quality.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"qeWVCk9Pksr1sYBaPrF9eV5nUWE_3XYHJshRSOXgpVE","pdfSize":"30506847"}