{"id":"2407.03817","title":"Markerless Multi-view 3D Human Pose Estimation: a survey","authors":"Ana Filipa Rodrigues Nogueira, H\\'elder P. Oliveira, Lu\\'is F.\n  Teixeira","authorsParsed":[["Nogueira","Ana Filipa Rodrigues",""],["Oliveira","Hélder P.",""],["Teixeira","Luís F.",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 10:44:35 GMT"}],"updateDate":"2024-07-08","timestamp":1720089875000,"abstract":"  3D human pose estimation aims to reconstruct the human skeleton of all the\nindividuals in a scene by detecting several body joints. The creation of\naccurate and efficient methods is required for several real-world applications\nincluding animation, human-robot interaction, surveillance systems or sports,\namong many others. However, several obstacles such as occlusions, random camera\nperspectives, or the scarcity of 3D labelled data, have been hampering the\nmodels' performance and limiting their deployment in real-world scenarios. The\nhigher availability of cameras has led researchers to explore multi-view\nsolutions due to the advantage of being able to exploit different perspectives\nto reconstruct the pose.\n  Thus, the goal of this survey is to present an overview of the methodologies\nused to estimate the 3D pose in multi-view settings, understand what were the\nstrategies found to address the various challenges and also, identify their\nlimitations. Based on the reviewed articles, it was possible to find that no\nmethod is yet capable of solving all the challenges associated with the\nreconstruction of the 3D pose. Due to the existing trade-off between complexity\nand performance, the best method depends on the application scenario.\nTherefore, further research is still required to develop an approach capable of\nquickly inferring a highly accurate 3D pose with bearable computation cost. To\nthis goal, techniques such as active learning, methods that learn with a low\nlevel of supervision, the incorporation of temporal consistency, view\nselection, estimation of depth information and multi-modal approaches might be\ninteresting strategies to keep in mind when developing a new methodology to\nsolve this task.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_z4JokwAUyUwtC5OsWDLL2_4PTQcXCGcL_khgZCOsiU","pdfSize":"2168049"}