{"id":"2407.06137","title":"OMuSense-23: A Multimodal Dataset for Contactless Breathing Pattern\n  Recognition and Biometric Analysis","authors":"Manuel Lage Ca\\~nellas, Le Nguyen, Anirban Mukherjee, Constantino\n  \\'Alvarez Casado, Xiaoting Wu, Praneeth Susarla, Sasan Sharifipour, Dinesh B.\n  Jayagopi, Miguel Bordallo L\\'opez","authorsParsed":[["Cañellas","Manuel Lage",""],["Nguyen","Le",""],["Mukherjee","Anirban",""],["Casado","Constantino Álvarez",""],["Wu","Xiaoting",""],["Susarla","Praneeth",""],["Sharifipour","Sasan",""],["Jayagopi","Dinesh B.",""],["López","Miguel Bordallo",""]],"versions":[{"version":"v1","created":"Wed, 22 May 2024 14:47:29 GMT"}],"updateDate":"2024-07-09","timestamp":1716389249000,"abstract":"  In the domain of non-contact biometrics and human activity recognition, the\nlack of a versatile, multimodal dataset poses a significant bottleneck. To\naddress this, we introduce the Oulu Multi Sensing (OMuSense-23) dataset that\nincludes biosignals obtained from a mmWave radar, and an RGB-D camera. The\ndataset features data from 50 individuals in three distinct poses -- standing,\nsitting, and lying down -- each featuring four specific breathing pattern\nactivities: regular breathing, reading, guided breathing, and apnea,\nencompassing both typical situations (e.g., sitting with normal breathing) and\ncritical conditions (e.g., lying down without breathing). In our work, we\npresent a detailed overview of the OMuSense-23 dataset, detailing the data\nacquisition protocol, describing the process for each participant. In addition,\nwe provide, a baseline evaluation of several data analysis tasks related to\nbiometrics, breathing pattern recognition and pose identification. Our results\nachieve a pose identification accuracy of 87\\% and breathing pattern activity\nrecognition of 83\\% using features extracted from biosignals. The OMuSense-23\ndataset is publicly available as resource for other researchers and\npractitioners in the field.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"CRllM6m30c3lfM7ZP5p6ELpoWlZ9NYKA1AyB9yxw1WY","pdfSize":"667104"}