{"id":"2407.15722","title":"MicroCam: Leveraging Smartphone Microscope Camera for Context-Aware\n  Contact Surface Sensing","authors":"Yongquan Hu, Hui-Shyong Yeo, Mingyue Yuan, Haoran Fan, Don Samitha\n  Elvitigala, Wen Hu, Aaron Quigley","authorsParsed":[["Hu","Yongquan",""],["Yeo","Hui-Shyong",""],["Yuan","Mingyue",""],["Fan","Haoran",""],["Elvitigala","Don Samitha",""],["Hu","Wen",""],["Quigley","Aaron",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 15:25:49 GMT"}],"updateDate":"2024-07-23","timestamp":1721661949000,"abstract":"  The primary focus of this research is the discreet and subtle everyday\ncontact interactions between mobile phones and their surrounding surfaces. Such\ninteractions are anticipated to facilitate mobile context awareness,\nencompassing aspects such as dispensing medication updates, intelligently\nswitching modes (e.g., silent mode), or initiating commands (e.g., deactivating\nan alarm). We introduce MicroCam, a contact-based sensing system that employs\nsmartphone IMU data to detect the routine state of phone placement and utilizes\na built-in microscope camera to capture intricate surface details. In\nparticular, a natural dataset is collected to acquire authentic surface\ntextures in situ for training and testing. Moreover, we optimize the deep\nneural network component of the algorithm, based on continual learning, to\naccurately discriminate between object categories (e.g., tables) and material\nconstituents (e.g., wood). Experimental results highlight the superior\naccuracy, robustness and generalization of the proposed method. Lastly, we\nconducted a comprehensive discussion centered on our prototype, encompassing\ntopics such as system performance and potential applications and scenarios.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ZbykZ9fc3bBKtwpS0f3tqJ_g7jDSpqn6Dlujyl3rH34","pdfSize":"21116168","objectId":"0xf2e4777941a3dc6776d6b066b25b715657e09c45ebeafc1f5cdcc44af94d5f40","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
