{"id":"2407.06909","title":"Intercepting Unauthorized Aerial Robots in Controlled Airspace Using\n  Reinforcement Learning","authors":"Francisco Giral, Ignacio G\\'omez, Soledad Le Clainche","authorsParsed":[["Giral","Francisco",""],["Gómez","Ignacio",""],["Clainche","Soledad Le",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 14:45:47 GMT"}],"updateDate":"2024-07-10","timestamp":1720536347000,"abstract":"  The proliferation of unmanned aerial vehicles (UAVs) in controlled airspace\npresents significant risks, including potential collisions, disruptions to air\ntraffic, and security threats. Ensuring the safe and efficient operation of\nairspace, particularly in urban environments and near critical infrastructure,\nnecessitates effective methods to intercept unauthorized or non-cooperative\nUAVs. This work addresses the critical need for robust, adaptive systems\ncapable of managing such threats through the use of Reinforcement Learning\n(RL). We present a novel approach utilizing RL to train fixed-wing UAV pursuer\nagents for intercepting dynamic evader targets. Our methodology explores both\nmodel-based and model-free RL algorithms, specifically DreamerV3, Truncated\nQuantile Critics (TQC), and Soft Actor-Critic (SAC). The training and\nevaluation of these algorithms were conducted under diverse scenarios,\nincluding unseen evasion strategies and environmental perturbations. Our\napproach leverages high-fidelity flight dynamics simulations to create\nrealistic training environments. This research underscores the importance of\ndeveloping intelligent, adaptive control systems for UAV interception,\nsignificantly contributing to the advancement of secure and efficient airspace\nmanagement. It demonstrates the potential of RL to train systems capable of\nautonomously achieving these critical tasks.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"eTOaWPbAkI811alKdvLDLJjoKpeUgvTpa1gnEiyJ4Vs","pdfSize":"1776955"}