{"id":"2407.06955","title":"ICLGuard: Controlling In-Context Learning Behavior for Applicability\n  Authorization","authors":"Wai Man Si and Michael Backes and Yang Zhang","authorsParsed":[["Si","Wai Man",""],["Backes","Michael",""],["Zhang","Yang",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 15:35:06 GMT"}],"updateDate":"2024-07-10","timestamp":1720539306000,"abstract":"  In-context learning (ICL) is a recent advancement in the capabilities of\nlarge language models (LLMs). This feature allows users to perform a new task\nwithout updating the model. Concretely, users can address tasks during the\ninference time by conditioning on a few input-label pair demonstrations along\nwith the test input. It is different than the conventional fine-tuning paradigm\nand offers more flexibility. However, this capability also introduces potential\nissues. For example, users may use the model on any data without restriction,\nsuch as performing tasks with improper or sensitive content, which might\nviolate the model policy or conflict with the model owner's interests. As a\nmodel owner, it is crucial to establish a mechanism to control the model's\nbehavior under ICL, depending on the model owner's requirements for various\ncontent. To this end, we introduce the concept of \"applicability authorization\"\ntailored for LLMs, particularly for ICL behavior, and propose a simple\napproach, ICLGuard. It is a fine-tuning framework designed to allow the model\nowner to regulate ICL behavior on different data. ICLGuard preserves the\noriginal LLM and fine-tunes only a minimal set of additional trainable\nparameters to \"guard\" the LLM. Empirical results show that the guarded LLM can\ndeactivate its ICL ability on target data without affecting its ICL ability on\nother data and its general functionality across all data.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"IkZsgfVbIYtp3NFqvqTArt8AyiaBEPm4pc1Zo3W7YN8","pdfSize":"611014"}