{"id":"2407.01310","title":"Multi-State-Action Tokenisation in Decision Transformers for\n  Multi-Discrete Action Spaces","authors":"Perusha Moodley, Pramod Kaushik, Dhillu Thambi, Mark Trovinger,\n  Praveen Paruchuri, Xia Hong, Benjamin Rosman","authorsParsed":[["Moodley","Perusha",""],["Kaushik","Pramod",""],["Thambi","Dhillu",""],["Trovinger","Mark",""],["Paruchuri","Praveen",""],["Hong","Xia",""],["Rosman","Benjamin",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 14:18:15 GMT"}],"updateDate":"2024-07-02","timestamp":1719843495000,"abstract":"  Decision Transformers, in their vanilla form, struggle to perform on\nimage-based environments with multi-discrete action spaces. Although enhanced\nDecision Transformer architectures have been developed to improve performance,\nthese methods have not specifically addressed this problem of multi-discrete\naction spaces which hampers existing Decision Transformer architectures from\nlearning good representations. To mitigate this, we propose Multi-State Action\nTokenisation (M-SAT), an approach for tokenising actions in multi-discrete\naction spaces that enhances the model's performance in such environments. Our\napproach involves two key changes: disentangling actions to the individual\naction level and tokenising the actions with auxiliary state information. These\ntwo key changes also improve individual action level interpretability and\nvisibility within the attention layers. We demonstrate the performance gains of\nM-SAT on challenging ViZDoom environments with multi-discrete action spaces and\nimage-based state spaces, including the Deadly Corridor and My Way Home\nscenarios, where M-SAT outperforms the baseline Decision Transformer without\nany additional data or heavy computational overheads. Additionally, we find\nthat removing positional encoding does not adversely affect M-SAT's performance\nand, in some cases, even improves it.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"4JgNkgeQRODhJrgaB_mmXEkLD5INDDUB7iICucmPQvg","pdfSize":"12634942"}