{"id":"2407.06928","title":"Shifts in Brain Dynamics and Drivers of Consciousness State Transitions","authors":"Joseph Bodenheimer, Paul Bogdan, S\\'ergio Pequito, Arian Ashourvan","authorsParsed":[["Bodenheimer","Joseph",""],["Bogdan","Paul",""],["Pequito","Sérgio",""],["Ashourvan","Arian",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 15:05:30 GMT"}],"updateDate":"2024-07-10","timestamp":1720537530000,"abstract":"  Understanding the neural mechanisms underlying the transitions between\ndifferent states of consciousness is a fundamental challenge in neuroscience.\nThus, we investigate the underlying drivers of changes during the resting-state\ndynamics of the human brain, as captured by functional magnetic resonance\nimaging (fMRI) across varying levels of consciousness (awake, light sedation,\ndeep sedation, and recovery). We deploy a model-based approach relying on\nlinear time-invariant (LTI) dynamical systems under unknown inputs (UI). Our\nfindings reveal distinct changes in the spectral profile of brain dynamics -\nparticularly regarding the stability and frequency of the system's oscillatory\nmodes during transitions between consciousness states. These models further\nenable us to identify external drivers influencing large-scale brain activity\nduring naturalistic auditory stimulation. Our findings suggest that these\nidentified inputs delineate how stimulus-induced co-activity propagation\ndiffers across consciousness states. Notably, our approach showcases the\neffectiveness of LTI models under UI in capturing large-scale brain dynamic\nchanges and drivers in complex paradigms, such as naturalistic stimulation,\nwhich are not conducive to conventional general linear model analysis.\nImportantly, our findings shed light on how brain-wide dynamics and drivers\nevolve as the brain transitions towards conscious states, holding promise for\ndeveloping more accurate biomarkers of consciousness recovery in disorders of\nconsciousness.\n","subjects":["Quantitative Biology/Neurons and Cognition","Quantitative Biology/Quantitative Methods"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"wUNOhc0AmxdvYTUNjvtpOkuPuv86YB8XMLjx1l1Gwko","pdfSize":"39568400"}