{"id":"2407.13341","title":"Hybrid Deep Learning-Based for Enhanced Occlusion Segmentation in PICU\n  Patient Monitoring","authors":"Mario Francisco Munoz, Hoang Vu Huy, Thanh-Dung Le","authorsParsed":[["Munoz","Mario Francisco",""],["Huy","Hoang Vu",""],["Le","Thanh-Dung",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 09:37:55 GMT"}],"updateDate":"2024-07-19","timestamp":1721295475000,"abstract":"  Remote patient monitoring has emerged as a prominent non-invasive method,\nusing digital technologies and computer vision (CV) to replace traditional\ninvasive monitoring. While neonatal and pediatric departments embrace this\napproach, Pediatric Intensive Care Units (PICUs) face the challenge of\nocclusions hindering accurate image analysis and interpretation.\n\\textit{Objective}: In this study, we propose a hybrid approach to effectively\nsegment common occlusions encountered in remote monitoring applications within\nPICUs. Our approach centers on creating a deep-learning pipeline for limited\ntraining data scenarios. \\textit{Methods}: First, a combination of the\nwell-established Google DeepLabV3+ segmentation model with the\ntransformer-based Segment Anything Model (SAM) is devised for occlusion\nsegmentation mask proposal and refinement. We then train and validate this\npipeline using a small dataset acquired from real-world PICU settings with a\nMicrosoft Kinect camera, achieving an Intersection-over-Union (IoU) metric of\n85\\%. \\textit{Results}: Both quantitative and qualitative analyses underscore\nthe effectiveness of our proposed method. The proposed framework yields an\noverall classification performance with 92.5\\% accuracy, 93.8\\% recall, 90.3\\%\nprecision, and 92.0\\% F1-score. Consequently, the proposed method consistently\nimproves the predictions across all metrics, with an average of 2.75\\% gain in\nperformance compared to the baseline CNN-based framework. \\textit{Conclusions}:\nOur proposed hybrid approach significantly enhances the segmentation of\nocclusions in remote patient monitoring within PICU settings. This advancement\ncontributes to improving the quality of care for pediatric patients, addressing\na critical need in clinical practice by ensuring more accurate and reliable\nremote monitoring.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"UMJ5KCtWxX3mTWOJv3_ee3SfynHqA_fcyI0r8eDZp2Y","pdfSize":"5671901"}