{"id":"2407.14663","title":"The Role of Quantum Metastability and the Perspective of Quantum\n  Glassiness in Kitaev Fractional Spin Dynamics: An NMR Study","authors":"Wassilios Papawassiliou, Nicolas Lazaridis, Eunice Mumba Mpanga, Jonas\n  Koppe, Nikolaos Panopoulos, Marina Karagianni, Lydia Gkoura, Romain\n  Berthelot, Michael Fardis, Andrew J. Pell, and Georgios Papavassiliou","authorsParsed":[["Papawassiliou","Wassilios",""],["Lazaridis","Nicolas",""],["Mpanga","Eunice Mumba",""],["Koppe","Jonas",""],["Panopoulos","Nikolaos",""],["Karagianni","Marina",""],["Gkoura","Lydia",""],["Berthelot","Romain",""],["Fardis","Michael",""],["Pell","Andrew J.",""],["Papavassiliou","Georgios",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 21:00:31 GMT"},{"version":"v2","created":"Tue, 3 Sep 2024 07:04:04 GMT"}],"updateDate":"2024-09-04","timestamp":1721422831000,"abstract":"  The suppression of magnetic order and the detection of a half-quantized\nthermal Hall effect in {\\alpha}-RuCl3 under an external magnetic field have\nsparked significant debate, whether these phenomena point to spin\nfractionalization, as posited by the Kitaev quantum spin liquid (QSL) model, or\nif they arise from a more conventional mechanism in an antiferromagnetically\nordered spin state. Here, through 23Na NMR relaxation measurements on the\nlayered cobaltate Na2Co2TeO6 at two distinct magnetic fields (4.7 and 9.4\nTesla), we provide compelling evidence supporting a variant interpretation.\nWhile upon cooling, the NMR relaxation times align with the temperature\ndependence predicted by Kitaev fractional spin excitations, below 10 K, a\ndynamically heterogeneous state is detected with Quantum Spin Glass (QSG)\ncharacteristics. In this state, the spin fractionalization dynamics unfold over\nmarkedly different time scales, and are characterized by quantum metastability,\ninducing prolonged equilibration as T->0. This observation challenges the\nprevailing view of a primarily homogeneous QSL state, as the ground state of\ntangible Kitaev systems.\n","subjects":["Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"2qX5JKFnB4mBxfAb9Bl6ojCk3eWxsu_3OQO5h_MaDPA","pdfSize":"2248750"}