{"id":"2407.01745","title":"Adaptive control of reaction-diffusion PDEs via neural\n  operator-approximated gain kernels","authors":"Luke Bhan, Yuanyuan Shi, Miroslav Krstic","authorsParsed":[["Bhan","Luke",""],["Shi","Yuanyuan",""],["Krstic","Miroslav",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 19:24:36 GMT"}],"updateDate":"2024-07-03","timestamp":1719861876000,"abstract":"  Neural operator approximations of the gain kernels in PDE backstepping has\nemerged as a viable method for implementing controllers in real time. With such\nan approach, one approximates the gain kernel, which maps the plant coefficient\ninto the solution of a PDE, with a neural operator. It is in adaptive control\nthat the benefit of the neural operator is realized, as the kernel PDE solution\nneeds to be computed online, for every updated estimate of the plant\ncoefficient. We extend the neural operator methodology from adaptive control of\na hyperbolic PDE to adaptive control of a benchmark parabolic PDE (a\nreaction-diffusion equation with a spatially-varying and unknown reaction\ncoefficient). We prove global stability and asymptotic regulation of the plant\nstate for a Lyapunov design of parameter adaptation. The key technical\nchallenge of the result is handling the 2D nature of the gain kernels and\nproving that the target system with two distinct sources of perturbation terms,\ndue to the parameter estimation error and due to the neural approximation\nerror, is Lyapunov stable. To verify our theoretical result, we present\nsimulations achieving calculation speedups up to 45x relative to the\ntraditional finite difference solvers for every timestep in the simulation\ntrajectory.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning","Computing Research Repository/Systems and Control","Mathematics/Analysis of PDEs","Mathematics/Dynamical Systems"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7RpXpVKwKqrb8STesTSWj0R-SmojE3jbqtKMkOaedwc","pdfSize":"1126862","objectId":"0x46401bd2b6ba33aa0477cb37a694b785581829aeef4ea99c51c085f49c1a1c20","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
