{"id":"2407.04836","title":"K-Nearest Neighbor Classification over Semantically Secure Encrypted\n  Relational Data","authors":"Gunjan Mishra, Kalyani Pathak, Yash Mishra, Pragati Jadhav, Vaishali\n  Keshervani","authorsParsed":[["Mishra","Gunjan",""],["Pathak","Kalyani",""],["Mishra","Yash",""],["Jadhav","Pragati",""],["Keshervani","Vaishali",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 19:44:17 GMT"}],"updateDate":"2024-07-09","timestamp":1720208657000,"abstract":"  Data mining has various real-time applications in fields such as finance\ntelecommunications, biology, and government. Classification is a primary task\nin data mining. With the rise of cloud computing, users can outsource and\naccess their data from anywhere, offloading data and it is processing to the\ncloud. However, in public cloud environments while data is often encrypted, the\ncloud service provider typically controls the encryption keys, meaning they can\npotentially access the data at any time. This situation makes traditional\nprivacy-preserving classification systems inadequate. The recommended protocol\nensures data privacy, protects user queries, and conceals access patterns.\nGiven that encrypted data on the cloud cannot be directly mined, we focus on a\nsecure k nearest neighbor classification algorithm for encrypted, outsourced\ndata. This approach maintains the privacy of user queries and data access\npatterns while allowing effective data mining operations to be conducted\nsecurely in the cloud. With cloud computing, particularly in public cloud\nenvironments, the encryption of data necessitates advanced methods like secure\nk nearest neighbor algorithms to ensure privacy and functionality in data\nmining. This innovation protects sensitive information and user privacy,\naddressing the challenges posed by traditional systems where cloud providers\ncontrol encryption keys.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"4aEcmJVH-ZM4ZYE6Ry2nkl_DRVviz4RAmsHdnDolIBw","pdfSize":"165693"}