{"id":"2407.04119","title":"An Autoencoder Architecture for L-band Passive Microwave Retrieval of\n  Landscape Freeze-Thaw Cycle","authors":"Divya Kumawat, Ardeshir Ebtehaj, Xiaolan Xu, Andreas Colliander, and\n  Vipin Kumar","authorsParsed":[["Kumawat","Divya",""],["Ebtehaj","Ardeshir",""],["Xu","Xiaolan",""],["Colliander","Andreas",""],["Kumar","Vipin",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 18:40:50 GMT"}],"updateDate":"2024-07-08","timestamp":1720118450000,"abstract":"  Estimating the landscape and soil freeze-thaw (FT) dynamics in the Northern\nHemisphere is crucial for understanding permafrost response to global warming\nand changes in regional and global carbon budgets. A new framework is presented\nfor surface FT-cycle retrievals using L-band microwave radiometry based on a\ndeep convolutional autoencoder neural network. This framework defines the\nlandscape FT-cycle retrieval as a time series anomaly detection problem\nconsidering the frozen states as normal and thawed states as anomalies. The\nautoencoder retrieves the FT-cycle probabilistically through supervised\nreconstruction of the brightness temperature (TB) time series using a\ncontrastive loss function that minimizes (maximizes) the reconstruction error\nfor the peak winter (summer). Using the data provided by the Soil Moisture\nActive Passive (SMAP) satellite, it is demonstrated that the framework learns\nto isolate the landscape FT states over different land surface types with\nvarying complexities related to the radiometric characteristics of snow cover,\nlake-ice phenology, and vegetation canopy. The consistency of the retrievals is\nevaluated over Alaska, against in situ ground-based observations, showing\nreduced uncertainties compared to the traditional methods that use thresholding\nof the normalized polarization ratio.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"VVCebRRvwD4z77o08K6ZZ6jY61Sk_TGB_tAgkcNLxwM","pdfSize":"5691380"}