{"id":"2407.04763","title":"TESS Investigation -- Demographics of Young Exoplanets (TI-DYE) II: a\n  second giant planet in the 17-Myr system HIP 67522","authors":"Madyson G. Barber, Pa Chia Thao, Andrew W. Mann, Andrew Vanderburg,\n  Mayuko Mori, John H. Livingston, Akihiko Fukui, Norio Narita, Adam L. Kraus,\n  Benjamin M. Tofflemire, Elisabeth R. Newton, Joshua N. Winn, Jon M. Jenkins,\n  Sara Seager, Karen A. Collins, Joseph D. Twicken","authorsParsed":[["Barber","Madyson G.",""],["Thao","Pa Chia",""],["Mann","Andrew W.",""],["Vanderburg","Andrew",""],["Mori","Mayuko",""],["Livingston","John H.",""],["Fukui","Akihiko",""],["Narita","Norio",""],["Kraus","Adam L.",""],["Tofflemire","Benjamin M.",""],["Newton","Elisabeth R.",""],["Winn","Joshua N.",""],["Jenkins","Jon M.",""],["Seager","Sara",""],["Collins","Karen A.",""],["Twicken","Joseph D.",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 18:00:00 GMT"}],"updateDate":"2024-07-09","timestamp":1720202400000,"abstract":"  The youngest ($<$50 Myr) planets are vital to understand planet formation and\nearly evolution. The 17 Myr system HIP 67522 is already known to host a giant\n($\\simeq$10$R_\\oplus$) planet on a tight orbit. In the discovery paper, Rizzuto\net al. 2020 reported a tentative single transit detection of an additional\nplanet in the system using TESS. Here, we report the discovery of HIP 67522 c\nwhich matches with that single transit event. We confirm the signal with\nground-based multi-wavelength photometry from Sinistro and MuSCAT4. At a period\nof 14.33 days, planet c is close to a 2:1 mean motion resonance with b (6.96\ndays or 2.06:1). The light curve shows distortions during many of the transits,\nwhich are consistent with spot crossing events and/or flares. Fewer stellar\nactivity events are seen in the transits of planet b, suggesting that planet c\nis crossing a more active latitude. Such distortions, combined with systematics\nin the TESS light curve extraction, likely explain why planet c was previously\nmissed.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"LRsAVvDcKOzPJyHdp9k3Wev4yqjnq-2HeE1mFhsNV-U","pdfSize":"17158903"}