{"id":"2407.04087","title":"Advanced Artificial Intelligence Strategy for Optimizing Urban Rail\n  Network Design using Nature-Inspired Algorithms","authors":"Hariram Sampath Kumar, Archana Singh, and Manish Kumar Ojha","authorsParsed":[["Kumar","Hariram Sampath",""],["Singh","Archana",""],["Ojha","Manish Kumar",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 17:57:39 GMT"}],"updateDate":"2024-07-08","timestamp":1720115859000,"abstract":"  This study introduces an innovative methodology for the planning of metro\nnetwork routes within the urban environment of Chennai, Tamil Nadu, India. A\ncomparative analysis of the modified Ant Colony Optimization (ACO) method\n(previously developed) with recent breakthroughs in nature-inspired algorithms\ndemonstrates the modified ACO's superiority over modern techniques. By\nutilizing the modified ACO algorithm, the most efficient routes connecting the\norigin and destination of the metro route are generated. Additionally, the\nmodel is applied to the existing metro network to highlight variations between\nthe model's results and the current network. The Google Maps platform,\nintegrated with Python, handles real-time data, including land utilization,\nGeographical Information Systems (GIS) data, census information, and points of\ninterest. This processing enables the identification of stops within the city\nand along the chosen routes. The resulting metro network showcases substantial\nbenefits compared to conventional route planning methods, with noteworthy\nenhancements in workforce productivity, decreased planning time, and\ncost-efficiency. This study significantly enhances the efficiency of urban\ntransport systems, specifically in rapidly changing metropolitan settings such\nas chennai.\n","subjects":["Computing Research Repository/Neural and Evolutionary Computing","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"mw89ZFioTF6NPGDbM7-WJryp4uy7AXKtMsc_pSJ9pW4","pdfSize":"11000383"}