{"id":"2407.15407","title":"A Solution toward Transparent and Practical AI Regulation: Privacy\n  Nutrition Labels for Open-source Generative AI-based Applications","authors":"Meixue Si, Shidong Pan, Dianshu Liao, Xiaoyu Sun, Zhen Tao, Wenchang\n  Shi, Zhenchang Xing","authorsParsed":[["Si","Meixue",""],["Pan","Shidong",""],["Liao","Dianshu",""],["Sun","Xiaoyu",""],["Tao","Zhen",""],["Shi","Wenchang",""],["Xing","Zhenchang",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 06:24:13 GMT"}],"updateDate":"2024-07-23","timestamp":1721629453000,"abstract":"  The rapid development and widespread adoption of Generative Artificial\nIntelligence-based (GAI) applications have greatly enriched our daily lives,\nbenefiting people by enhancing creativity, personalizing experiences, improving\naccessibility, and fostering innovation and efficiency across various domains.\nHowever, along with the development of GAI applications, concerns have been\nraised about transparency in their privacy practices. Traditional privacy\npolicies often fail to effectively communicate essential privacy information\ndue to their complexity and length, and open-source community developers often\nneglect privacy practices even more. Only 12.2% of examined open-source GAI\napps provide a privacy policy. To address this, we propose a regulation-driven\nGAI Privacy Label and introduce Repo2Label, a novel framework for automatically\ngenerating these labels based on code repositories. Our user study indicates a\ncommon endorsement of the proposed GAI privacy label format. Additionally,\nRepo2Label achieves a precision of 0.81, recall of 0.88, and F1-score of 0.84\nbased on the benchmark dataset, significantly outperforming the developer\nself-declared privacy notices. We also discuss the common regulatory\n(in)compliance of open-source GAI apps, comparison with other privacy notices,\nand broader impacts to different stakeholders. Our findings suggest that\nRepo2Label could serve as a significant tool for bolstering the privacy\ntransparency of GAI apps and make them more practical and responsible.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"-bLlZQd77P6lvO7imXXu_V74tsHJUs0d3owGLSzOX6Y","pdfSize":"1764150"}