{"id":"2407.04040","title":"Multiomics-based Outcome Prediction for the Treatment of Brain\n  Metastases with Personalized Ultra-fractionated Stereotactic Adaptive\n  Radiotherapy (PULSAR)","authors":"Haozhao Zhang, Michael Dohopolski, Strahinja Stojadinovic, Luiza\n  Giuliani, Soummitra Anand, Heejung Kim, Arnold Pompos, Andrew Godley, Steve\n  Jiang, Tu Dan, Zabi Wardak, Robert Timmerman, Hao Peng","authorsParsed":[["Zhang","Haozhao",""],["Dohopolski","Michael",""],["Stojadinovic","Strahinja",""],["Giuliani","Luiza",""],["Anand","Soummitra",""],["Kim","Heejung",""],["Pompos","Arnold",""],["Godley","Andrew",""],["Jiang","Steve",""],["Dan","Tu",""],["Wardak","Zabi",""],["Timmerman","Robert",""],["Peng","Hao",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 16:28:28 GMT"}],"updateDate":"2024-07-08","timestamp":1720110508000,"abstract":"  Purpose: We aimed to develop a data-driven multiomics approach integrating\nradiomics, dosiomics, and delta features to predict treatment response at an\nearlier stage (intra-treatment) for brain metastases (BMs) patients treated\nwith PULSAR. Methods: We conducted a retrospective study of 39 patients with 69\nBMs treated with PULSAR. Radiomics, dosiomics, and delta features were\nextracted from pretreatment and intra-treatment MRI scans and dose\ndistributions. Six individual models and an ensemble feature selection (EFS)\nmodel were constructed using SVM and evaluated via stratified 5-fold\ncross-validation. The classification task distinguished lesions with >20%\nvolume reduction at follow-up. We assessed performance metrics including\nsensitivity, specificity, accuracy, precision, F1 score, and AUC. Various\nfeature extraction and ensemble selection scenarios were explored to enhance\nmodel robustness and reduce overfitting. Results: The EFS model, integrating\nfeatures from pre-treatment radiomics and dosiomics, intra-treatment radiomics,\nand delta-radiomics, outperformed six individual models. It achieved an AUC of\n0.979, accuracy of 0.917, and F1 score of 0.821. Among the top 9 features, six\nwere derived from post-wavelet transformation, and three from original images.\nThe discrete wavelet transform decomposes volumetric images into\nmulti-resolution components, offering a more comprehensive characterization of\nunderlying structures. Conclusion: Our study demonstrated the feasibility of\nemploying a data-driven multiomics approach to predict tumor volume changes in\nBMs patients with PULSAR. The EFS model demonstrates enhanced performance\ncompared with six individual models, emphasizing the importance of integrating\nboth pretreatment and intra-treatment data. This application holds promise for\noptimizing BMs management, potentially mitigating risks associated with under-\nor over-treatment.\n","subjects":["Physics/Medical Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"oZpZ-d8bhe4Sb0HeXOw_KDWVvfAFIp3rn78Npb5v3F0","pdfSize":"2875964"}