{"id":"2407.07077","title":"ConceptExpress: Harnessing Diffusion Models for Single-image\n  Unsupervised Concept Extraction","authors":"Shaozhe Hao, Kai Han, Zhengyao Lv, Shihao Zhao, Kwan-Yee K. Wong","authorsParsed":[["Hao","Shaozhe",""],["Han","Kai",""],["Lv","Zhengyao",""],["Zhao","Shihao",""],["Wong","Kwan-Yee K.",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 17:50:28 GMT"}],"updateDate":"2024-07-10","timestamp":1720547428000,"abstract":"  While personalized text-to-image generation has enabled the learning of a\nsingle concept from multiple images, a more practical yet challenging scenario\ninvolves learning multiple concepts within a single image. However, existing\nworks tackling this scenario heavily rely on extensive human annotations. In\nthis paper, we introduce a novel task named Unsupervised Concept Extraction\n(UCE) that considers an unsupervised setting without any human knowledge of the\nconcepts. Given an image that contains multiple concepts, the task aims to\nextract and recreate individual concepts solely relying on the existing\nknowledge from pretrained diffusion models. To achieve this, we present\nConceptExpress that tackles UCE by unleashing the inherent capabilities of\npretrained diffusion models in two aspects. Specifically, a concept\nlocalization approach automatically locates and disentangles salient concepts\nby leveraging spatial correspondence from diffusion self-attention; and based\non the lookup association between a concept and a conceptual token, a\nconcept-wise optimization process learns discriminative tokens that represent\neach individual concept. Finally, we establish an evaluation protocol tailored\nfor the UCE task. Extensive experiments demonstrate that ConceptExpress is a\npromising solution to the UCE task. Our code and data are available at:\nhttps://github.com/haoosz/ConceptExpress\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"KZJeIxpjv2nXGCsnv_XVKqAoTAeskbkWTTNEdQcsfY8","pdfSize":"21808069"}