{"id":"2407.03174","title":"$\\nu_\\mu$ and $\\nu_\\tau$ elastic scattering in Borexino","authors":"Kevin J. Kelly, Nityasa Mishra, Mudit Rai, Louis E. Strigari","authorsParsed":[["Kelly","Kevin J.",""],["Mishra","Nityasa",""],["Rai","Mudit",""],["Strigari","Louis E.",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 14:50:03 GMT"}],"updateDate":"2024-07-04","timestamp":1720018203000,"abstract":"  We perform a detailed study of neutrino-electron elastic scattering using the\nmono-energetic $^{7}$Be neutrinos in Borexino, with an emphasis on exploring\nthe differences between the contributions of $\\nu_e$, $\\nu_\\mu$, and\n$\\nu_\\tau$. We find that current data are capable of measuring these components\nsuch that the contributions from $\\nu_\\mu$ and $\\nu_\\tau$ cannot be zero,\nalthough distinguishing between them is challenging -- the differences stemming\nfrom Standard Model radiative corrections are insufficient without\nsignificantly more precise measurements. In studying these components, we\ncompare predicted neutrino-electron scattering event rates within the Standard\nModel (accounting for neutrino oscillations), as well as going beyond the\nStandard Model in two ways. We allow for non-unitary evolution to modify\nneutrino oscillations, and find that with a larger exposure (${\\sim}30$x),\nBorexino may provide relevant information for constraining non-unitarity, and\nthat JUNO may be able to accomplish this with its data collection of $^{7}$Be\nneutrinos. We also consider novel $\\nu_\\mu$- and $\\nu_\\tau$-electron scattering\nfrom a gauged $U(1)_{L_\\mu - L_\\tau}$ model, showing consistency with previous\nanalyses of Borexino and this scenario, but also demonstrating the impact of\nuncertainties on Standard Model mixing parameters on these results.\n","subjects":["Physics/High Energy Physics - Phenomenology","Astrophysics/Solar and Stellar Astrophysics","Physics/High Energy Physics - Experiment"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Leh91rR4WxAQk22UYUa94OfVTzWSnTDKZrdbEtn8Maw","pdfSize":"817108"}