{"id":"2407.06384","title":"Unveiling the Electronic, Transport, and Migration Properties of the\n  Te-Defect Lattice in DyTe$_{1.8}$","authors":"Jinwoong Kim and Nicholas Kioussis","authorsParsed":[["Kim","Jinwoong",""],["Kioussis","Nicholas",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 20:52:54 GMT"}],"updateDate":"2024-07-10","timestamp":1720471974000,"abstract":"  The rare-earth ditellurides are known to form two-dimensional square lattice\nwhere the strong Fermi surface nesting leads to structural modulation. In\ncontrast to charge density waves, the supercell modulation is accompanied by\nthe formation of the periodic Te vacancy network, where the Te deficiency\naffects the nesting vector (i.e. the supercell size) via tuning the chemical\npotential. In this work, first principles electronic structure calculations for\nthe $\\sqrt{5}\\times\\sqrt{5}$ supercell, that commonly appears in this family of\ntellurides, unveil interesting electronic, transport, and migration properties\nof the Te defect lattice in DyTe$_{1.8}$. The reconstruction of the\nTe-deficient square lattice, consisting of a single Te-dimer and a pair\nTe-trimers per unit cell, gives rise to an out-of-plane polarization, whose\ndirection depends on the position of the dimer. This results in various\nclose-in-energy parallel and antiparallel polarization configurations of\nsuccessive Te layers depending on the dimer positions. We predict that the\norientation of the Te dimers, and hence the corresponding structural motifs,\ncan be reversibly switched between two in-plane perpendicular directions under\ntensile epitaxial strain via a piezoelectric substrate, resulting in a colossal\nconductivity switching. Furthermore, the Te-dimer orientations result in\nasymmetric Fermi surface which can be confirmed by quantum oscillations\nmeasurements. Finally, we present numerical results for the migration paths and\nenergy landscape through various divacancy configurations in the presence or\nabsence of epitaxial strain.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Sh9NUJ41Ck4k58ntQmz3cWmLx4IPZRxEgU4wc9Q-L6k","pdfSize":"9324796"}