{"id":"2407.07328","title":"CATP: Context-Aware Trajectory Prediction with Competition Symbiosis","authors":"Jiang Wu, Dongyu Liu, Yuchen Lin, Yingcai Wu","authorsParsed":[["Wu","Jiang",""],["Liu","Dongyu",""],["Lin","Yuchen",""],["Wu","Yingcai",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 02:51:35 GMT"}],"updateDate":"2024-07-11","timestamp":1720579895000,"abstract":"  Contextual information is vital for accurate trajectory prediction. For\ninstance, the intricate flying behavior of migratory birds hinges on their\nanalysis of environmental cues such as wind direction and air pressure.\nHowever, the diverse and dynamic nature of contextual information renders it an\narduous task for AI models to comprehend its impact on trajectories and\nconsequently predict them accurately. To address this issue, we propose a\n``manager-worker'' framework to unleash the full potential of contextual\ninformation and construct CATP model, an implementation of the framework for\nContext-Aware Trajectory Prediction. The framework comprises a manager model,\nseveral worker models, and a tailored training mechanism inspired by\ncompetition symbiosis in nature. Taking CATP as an example, each worker needs\nto compete against others for training data and develop an advantage in\npredicting specific moving patterns. The manager learns the workers'\nperformance in different contexts and selects the best one in the given context\nto predict trajectories, enabling CATP as a whole to operate in a symbiotic\nmanner. We conducted two comparative experiments and an ablation study to\nquantitatively evaluate the proposed framework and CATP model. The results\nshowed that CATP could outperform SOTA models, and the framework could be\ngeneralized to different context-aware tasks.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"m6tJ80aY4Cmh8Pe0QzuB_giXxAOam3z2s4jb-olvU8g","pdfSize":"1299016","objectId":"0x626984cc0eb07426d6d1f9241e3cb1bcc99cd2749a5c8ff26a96c5637379a8e7","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
