{"id":"2407.04438","title":"Statistical reduced order modelling for the parametric Helmholtz\n  equation","authors":"Lucas Hermann, Matthias Bollh\\\"ofer, Ulrich R\\\"omer","authorsParsed":[["Hermann","Lucas",""],["Bollhöfer","Matthias",""],["Römer","Ulrich",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 11:39:59 GMT"}],"updateDate":"2024-07-08","timestamp":1720179599000,"abstract":"  Predictive modeling involving simulation and sensor data at the same time, is\na growing challenge in computational science. Even with large-scale finite\nelement models, a mismatch to the sensor data often remains, which can be\nattributed to different sources of uncertainty. For such a scenario, the\nstatistical finite element method (statFEM) can be used to condition a\nsimulated field on given sensor data. This yields a posterior solution which\nresembles the data much better and additionally provides consistent estimates\nof uncertainty, including model misspecification. For frequency or parameter\ndependent problems, occurring, e.g. in acoustics or electromagnetism, solving\nthe full order model at the frequency grid and conditioning it on data quickly\nresults in a prohibitive computational cost. In this case, the introduction of\na surrogate in form of a reduced order model yields much smaller systems of\nequations. In this paper, we propose a reduced order statFEM framework relying\non Krylov-based moment matching. We introduce a data model which explicitly\nincludes the bias induced by the reduced approximation, which is estimated by\nan inexpensive error indicator. The results of the new statistical reduced\norder method are compared to the standard statFEM procedure applied to a ROM\nprior, i.e. without explicitly accounting for the reduced order bias. The\nproposed method yields better accuracy and faster convergence throughout a\ngiven frequency range for different numerical examples.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"mUSSEyrmz-DBX_kAMJIZ-vCnVILWNhPnz-Vf9bpzKP4","pdfSize":"3359600"}