{"id":"2407.19650","title":"Practical Video Object Detection via Feature Selection and Aggregation","authors":"Yuheng Shi, Tong Zhang, Xiaojie Guo","authorsParsed":[["Shi","Yuheng",""],["Zhang","Tong",""],["Guo","Xiaojie",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 02:12:11 GMT"}],"updateDate":"2024-07-30","timestamp":1722219131000,"abstract":"  Compared with still image object detection, video object detection (VOD)\nneeds to particularly concern the high across-frame variation in object\nappearance, and the diverse deterioration in some frames. In principle, the\ndetection in a certain frame of a video can benefit from information in other\nframes. Thus, how to effectively aggregate features across different frames is\nkey to the target problem. Most of contemporary aggregation methods are\ntailored for two-stage detectors, suffering from high computational costs due\nto the dual-stage nature. On the other hand, although one-stage detectors have\nmade continuous progress in handling static images, their applicability to VOD\nlacks sufficient exploration. To tackle the above issues, this study invents a\nvery simple yet potent strategy of feature selection and aggregation, gaining\nsignificant accuracy at marginal computational expense. Concretely, for cutting\nthe massive computation and memory consumption from the dense prediction\ncharacteristic of one-stage object detectors, we first condense candidate\nfeatures from dense prediction maps. Then, the relationship between a target\nframe and its reference frames is evaluated to guide the aggregation.\nComprehensive experiments and ablation studies are conducted to validate the\nefficacy of our design, and showcase its advantage over other cutting-edge VOD\nmethods in both effectiveness and efficiency. Notably, our model reaches\n\\emph{a new record performance, i.e., 92.9\\% AP50 at over 30 FPS on the\nImageNet VID dataset on a single 3090 GPU}, making it a compelling option for\nlarge-scale or real-time applications. The implementation is simple, and\naccessible at \\url{https://github.com/YuHengsss/YOLOV}.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"PSEGvhfwAnveDPPmUOijtWLB6byjZlC2Wbu8kQuv0nc","pdfSize":"30235737"}