{"id":"2407.04717","title":"Classical and Quantum Physical Reservoir Computing for Onboard\n  Artificial Intelligence Systems: A Perspective","authors":"A. H. Abbas, Hend Abdel-Ghani and Ivan S. Maksymov","authorsParsed":[["Abbas","A. H.",""],["Abdel-Ghani","Hend",""],["Maksymov","Ivan S.",""]],"versions":[{"version":"v1","created":"Fri, 14 Jun 2024 06:55:09 GMT"}],"updateDate":"2024-07-09","timestamp":1718348109000,"abstract":"  Artificial intelligence (AI) systems of autonomous systems such as drones,\nrobots and self-driving cars may consume up to 50% of total power available\nonboard, thereby limiting the vehicle's range of functions and considerably\nreducing the distance the vehicle can travel on a single charge.\nNext-generation onboard AI systems need an even higher power since they collect\nand process even larger amounts of data in real time. This problem cannot be\nsolved using the traditional computing devices since they become more and more\npower-consuming. In this review article, we discuss the perspectives of\ndevelopment of onboard neuromorphic computers that mimic the operation of a\nbiological brain using nonlinear-dynamical properties of natural physical\nenvironments surrounding autonomous vehicles. Previous research also\ndemonstrated that quantum neuromorphic processors (QNPs) can conduct\ncomputations with the efficiency of a standard computer while consuming less\nthan 1% of the onboard battery power. Since QNPs is a semi-classical\ntechnology, their technical simplicity and low, compared with quantum\ncomputers, cost make them ideally suitable for application in autonomous AI\nsystem. Providing a perspective view on the future progress in unconventional\nphysical reservoir computing and surveying the outcomes of more than 200\ninterdisciplinary research works, this article will be of interest to a broad\nreadership, including both students and experts in the fields of physics,\nengineering, quantum technologies and computing.\n","subjects":["Computing Research Repository/Emerging Technologies","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Neural and Evolutionary Computing","Computing Research Repository/Robotics","Nonlinear Sciences/Chaotic Dynamics","Physics/Fluid Dynamics","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"FVqfDZ1xONmA6lw4yhwRePjxZ6vFAk3bwcGEEHfR550","pdfSize":"9275674"}
