{"id":"2407.09994","title":"Distributed computing for physics-based data-driven reduced modeling at\n  scale: Application to a rotating detonation rocket engine","authors":"Ionut-Gabriel Farcas, Rayomand P. Gundevia, Ramakanth Munipalli, Karen\n  E. Willcox","authorsParsed":[["Farcas","Ionut-Gabriel",""],["Gundevia","Rayomand P.",""],["Munipalli","Ramakanth",""],["Willcox","Karen E.",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 20:17:41 GMT"}],"updateDate":"2024-07-16","timestamp":1720901861000,"abstract":"  High-performance computing (HPC) has revolutionized our ability to perform\ndetailed simulations of complex real-world processes. A prominent contemporary\nexample is from aerospace propulsion, where HPC is used for rotating detonation\nrocket engine (RDRE) simulations in support of the design of next-generation\nrocket engines; however, these simulations take millions of core hours even on\npowerful supercomputers, which makes them impractical for engineering tasks\nlike design exploration and risk assessment. Reduced-order models (ROMs)\naddress this limitation by constructing computationally cheap yet sufficiently\naccurate approximations that serve as surrogates for the high-fidelity model.\nThis paper contributes a new distributed algorithm that achieves fast and\nscalable construction of predictive physics-based ROMs trained from sparse\ndatasets of extremely large state dimension. The algorithm learns structured\nphysics-based ROMs that approximate the dynamical systems underlying those\ndatasets. This enables model reduction for problems at a scale and complexity\nthat exceeds the capabilities of existing approaches. We demonstrate our\nalgorithm's scalability using up to $2,048$ cores on the Frontera supercomputer\nat the Texas Advanced Computing Center. We focus on a real-world\nthree-dimensional RDRE for which one millisecond of simulated physical time\nrequires one million core hours on a supercomputer. Using a training dataset of\n$2,536$ snapshots each of state dimension $76$ million, our distributed\nalgorithm enables the construction of a predictive data-driven reduced model in\njust $13$ seconds on $2,048$ cores on Frontera.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Distributed, Parallel, and Cluster Computing","Computing Research Repository/Machine Learning","Computing Research Repository/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"d6dqKnqcPrsQ_mhg3q9P698EoNnZKzsh4StSGEoRx8o","pdfSize":"6938722","objectId":"0x8fc4f6678e0f17c420f067c1aeec4de388973c602b25fb4490997b9ebae7908f","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
