{"id":"2407.07807","title":"Revisiting the dead time effects of Insight-HXMT/ME on timing analysis","authors":"Youli Tuo, Xiaobo Li, Ying Tan, Baiyang Wu, Weichun Jiang, Liming\n  Song, Jinlu Qu, Sudeep Gogate, Shuang-Nan Zhang and Andrea Santangelo","authorsParsed":[["Tuo","Youli",""],["Li","Xiaobo",""],["Tan","Ying",""],["Wu","Baiyang",""],["Jiang","Weichun",""],["Song","Liming",""],["Qu","Jinlu",""],["Gogate","Sudeep",""],["Zhang","Shuang-Nan",""],["Santangelo","Andrea",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 16:26:19 GMT"}],"updateDate":"2024-07-11","timestamp":1720628779000,"abstract":"  Dead time is a common instrumental effect of X-ray detectors which would\nalter the behavior of timing properties of astronomical signals, such as\ndistorting the shape of power density spectra (PDS), affecting the\nroot-mean-square of potential quasi-periodic oscillation signals, etc. We\nrevisit the effects of the dead time of Medium Energy X-ray telescope (ME)\nonboard Insight-HXMT, based on the simulation of electronic read-out mechanism\nthat causes the dead time, and the real data. We investigate dead time effects\non the pulse profile as well as the Quasi-Periodic Oscillation (QPO) signals.\nThe dead time coefficient suggests a linear correlation with the observed count\nrate in each phase bin of the pulse profile according to the simulation of\nperiodic signal as well as the real data observed on Swift J0243.6+6124. The\nFourier-amplitude-difference (FAD) method could well recover the intrinsic\nshape of the observed PDS in the case that the PDS is from two identical\ndetectors. We apply this technique on ME, by splitting the 9 FPGA modules into\n2 groups. The results indicate that the FAD technique suits the case when two\ngroups of detectors are not largely different; and the recovered PDS of Sco X-1\nobserved by ME slightly enhances the significance of the previously known QPO\nsignal, meanwhile the root-mean-square of QPO is significantly improved. We\nprovide the FAD correction tool implemented in HXMTDAS for users in the future\nto better analyze QPO signals.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"i5B8RK52XzF6PYkBkjqFQrQWM3OWsjSt7t-QaFPtIBQ","pdfSize":"1012980"}