{"id":"2407.11174","title":"iHuman: Instant Animatable Digital Humans From Monocular Videos","authors":"Pramish Paudel, Anubhav Khanal, Ajad Chhatkuli, Danda Pani Paudel,\n  Jyoti Tandukar","authorsParsed":[["Paudel","Pramish",""],["Khanal","Anubhav",""],["Chhatkuli","Ajad",""],["Paudel","Danda Pani",""],["Tandukar","Jyoti",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 18:51:51 GMT"}],"updateDate":"2024-07-17","timestamp":1721069511000,"abstract":"  Personalized 3D avatars require an animatable representation of digital\nhumans. Doing so instantly from monocular videos offers scalability to broad\nclass of users and wide-scale applications. In this paper, we present a fast,\nsimple, yet effective method for creating animatable 3D digital humans from\nmonocular videos. Our method utilizes the efficiency of Gaussian splatting to\nmodel both 3D geometry and appearance. However, we observed that naively\noptimizing Gaussian splats results in inaccurate geometry, thereby leading to\npoor animations. This work achieves and illustrates the need of accurate 3D\nmesh-type modelling of the human body for animatable digitization through\nGaussian splats. This is achieved by developing a novel pipeline that benefits\nfrom three key aspects: (a) implicit modelling of surface's displacements and\nthe color's spherical harmonics; (b) binding of 3D Gaussians to the respective\ntriangular faces of the body template; (c) a novel technique to render normals\nfollowed by their auxiliary supervision. Our exhaustive experiments on three\ndifferent benchmark datasets demonstrates the state-of-the-art results of our\nmethod, in limited time settings. In fact, our method is faster by an order of\nmagnitude (in terms of training time) than its closest competitor. At the same\ntime, we achieve superior rendering and 3D reconstruction performance under the\nchange of poses.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"k3tppU4_JsOkv1DFmYwOSByxS4Sx8gsKdZ5IgSwqrSs","pdfSize":"16166145"}