{"id":"2407.04464","title":"On the overlap reduction function of pulsar timing array searches for\n  gravitational waves in modified gravity","authors":"Nina Cordes, Andrea Mitridate, Kai Schmitz, Tobias Schr\\\"oder, Kim\n  Wassner","authorsParsed":[["Cordes","Nina",""],["Mitridate","Andrea",""],["Schmitz","Kai",""],["Schröder","Tobias",""],["Wassner","Kim",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 12:21:04 GMT"}],"updateDate":"2024-07-08","timestamp":1720182064000,"abstract":"  Pulsar Timing Array (PTA) searches for gravitational waves (GWs) aim to\ndetect a characteristic correlation pattern in the timing residuals of galactic\nmillisecond pulsars. This pattern is described by the PTA overlap reduction\nfunction (ORF) \\Gamma_ab(\\xi_ab), which is known as the Hellings--Downs (HD)\ncurve in general relativity (GR). In theories of modified gravity, the HD curve\noften receives corrections. Assuming, e.g., a subluminal GW phase velocity, one\nfinds a drastically enhanced ORF in the limit of small angular separations\nbetween pulsar a and pulsar b in the sky, \\xi_ab --> 0. In particular, working\nin harmonic space and performing an approximate resummation of all multipole\ncontributions, the auto correlation coefficient \\Gamma_aa seems to diverge. In\nthis paper, we confirm that this divergence is unphysical and provide an exact\nand analytical expression for \\Gamma_aa in dependence of the pulsar distance\nL_a and the GW phase velocity v_ph. In the GR limit and assuming a large pulsar\ndistance, our expression reduces to \\Gamma_aa = 1. In the case of subluminal\nphase velocity, we show that the regularization of the naive divergent result\nis a finite-distance effect, meaning that \\Gamma_aa scales linearly with fL_a,\nwhere f is the GW frequency. For superluminal phase velocity (subluminal group\nvelocity), which is relevant in the case of massive gravity, we correct an\nearlier analytical result for \\Gamma_ab. Our results pave the way for fitting\nmodified-gravity theories with nonstandard phase velocity to PTA data, which\nrequires a proper understanding of the auto correlation coefficient \\Gamma_aa.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/High Energy Astrophysical Phenomena","Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"gEFjiPOVCYyd6KeYPV8ZoE050c0WV9WDMOBCeX9WfI8","pdfSize":"617725"}