{"id":"2407.06053","title":"Learning local equivariant representations for quantum operators","authors":"Zhanghao Zhouyin and Zixi Gan and Shishir Kumar Pandey and Linfeng\n  Zhang and Qiangqiang Gu","authorsParsed":[["Zhouyin","Zhanghao",""],["Gan","Zixi",""],["Pandey","Shishir Kumar",""],["Zhang","Linfeng",""],["Gu","Qiangqiang",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 15:55:12 GMT"},{"version":"v2","created":"Wed, 10 Jul 2024 15:20:10 GMT"},{"version":"v3","created":"Tue, 16 Jul 2024 16:52:49 GMT"}],"updateDate":"2024-07-17","timestamp":1720454112000,"abstract":"  Predicting quantum operator matrices such as Hamiltonian, overlap, and\ndensity matrices in the density functional theory (DFT) framework is crucial\nfor understanding material properties. Current methods often focus on\nindividual operators and struggle with efficiency and scalability for large\nsystems. Here we introduce a novel deep learning model, SLEM (strictly\nlocalized equivariant message-passing) for predicting multiple quantum\noperators, that achieves state-of-the-art accuracy while dramatically improving\ncomputational efficiency. SLEM's key innovation is its strict locality-based\ndesign, constructing local, equivariant representations for quantum tensors\nwhile preserving physical symmetries. This enables complex many-body dependence\nwithout expanding the effective receptive field, leading to superior data\nefficiency and transferability. Using an innovative SO(2) convolution\ntechnique, SLEM reduces the computational complexity of high-order tensor\nproducts and is therefore capable of handling systems requiring the $f$ and $g$\norbitals in their basis sets. We demonstrate SLEM's capabilities across diverse\n2D and 3D materials, achieving high accuracy even with limited training data.\nSLEM's design facilitates efficient parallelization, potentially extending DFT\nsimulations to systems with device-level sizes, opening new possibilities for\nlarge-scale quantum simulations and high-throughput materials discovery.\n","subjects":["Condensed Matter/Materials Science","Computing Research Repository/Machine Learning","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"QWbLx-g5CPAXyYfK5sn4Xxb-TDVdjtt4Uy4ELcEajMI","pdfSize":"2035935"}