{"id":"2407.00224","title":"Multimodal Prototyping for cancer survival prediction","authors":"Andrew H. Song, Richard J. Chen, Guillaume Jaume, Anurag J. Vaidya,\n  Alexander S. Baras, Faisal Mahmood","authorsParsed":[["Song","Andrew H.",""],["Chen","Richard J.",""],["Jaume","Guillaume",""],["Vaidya","Anurag J.",""],["Baras","Alexander S.",""],["Mahmood","Faisal",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 20:37:01 GMT"}],"updateDate":"2024-07-02","timestamp":1719607021000,"abstract":"  Multimodal survival methods combining gigapixel histology whole-slide images\n(WSIs) and transcriptomic profiles are particularly promising for patient\nprognostication and stratification. Current approaches involve tokenizing the\nWSIs into smaller patches (>10,000 patches) and transcriptomics into gene\ngroups, which are then integrated using a Transformer for predicting outcomes.\nHowever, this process generates many tokens, which leads to high memory\nrequirements for computing attention and complicates post-hoc interpretability\nanalyses. Instead, we hypothesize that we can: (1) effectively summarize the\nmorphological content of a WSI by condensing its constituting tokens using\nmorphological prototypes, achieving more than 300x compression; and (2)\naccurately characterize cellular functions by encoding the transcriptomic\nprofile with biological pathway prototypes, all in an unsupervised fashion. The\nresulting multimodal tokens are then processed by a fusion network, either with\na Transformer or an optimal transport cross-alignment, which now operates with\na small and fixed number of tokens without approximations. Extensive evaluation\non six cancer types shows that our framework outperforms state-of-the-art\nmethods with much less computation while unlocking new interpretability\nanalyses.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Statistics/Applications"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"kbxk4dcXzFDLV24EDZpn1nCgrjS3uRUUHQX-n_yFmW8","pdfSize":"5852875"}