{"id":"2407.14730","title":"FedDM: Enhancing Communication Efficiency and Handling Data\n  Heterogeneity in Federated Diffusion Models","authors":"Jayneel Vora, Nader Bouacida, Aditya Krishnan and Prasant Mohapatra","authorsParsed":[["Vora","Jayneel",""],["Bouacida","Nader",""],["Krishnan","Aditya",""],["Mohapatra","Prasant",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 02:54:41 GMT"}],"updateDate":"2024-07-23","timestamp":1721444081000,"abstract":"  We introduce FedDM, a novel training framework designed for the federated\ntraining of diffusion models. Our theoretical analysis establishes the\nconvergence of diffusion models when trained in a federated setting, presenting\nthe specific conditions under which this convergence is guaranteed. We propose\na suite of training algorithms that leverage the U-Net architecture as the\nbackbone for our diffusion models. These include a basic Federated Averaging\nvariant, FedDM-vanilla, FedDM-prox to handle data heterogeneity among clients,\nand FedDM-quant, which incorporates a quantization module to reduce the model\nupdate size, thereby enhancing communication efficiency across the federated\nnetwork.\n  We evaluate our algorithms on FashionMNIST (28x28 resolution), CIFAR-10\n(32x32 resolution), and CelebA (64x64 resolution) for DDPMs, as well as LSUN\nChurch Outdoors (256x256 resolution) for LDMs, focusing exclusively on the\nimaging modality. Our evaluation results demonstrate that FedDM algorithms\nmaintain high generation quality across image resolutions. At the same time,\nthe use of quantized updates and proximal terms in the local training objective\nsignificantly enhances communication efficiency (up to 4x) and model\nconvergence, particularly in non-IID data settings, at the cost of increased\nFID scores (up to 1.75x).\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"vr15YfbZRYyaame-Nu4bQnhtqraCs4WJqu2Y8-uB9J4","pdfSize":"4286663"}