{"id":"2407.00553","title":"Cooperative Advisory Residual Policies for Congestion Mitigation","authors":"Aamir Hasan, Neeloy Chakraborty, Haonan Chen, Jung-Hoon Cho, Cathy Wu,\n  Katherine Driggs-Campbell","authorsParsed":[["Hasan","Aamir",""],["Chakraborty","Neeloy",""],["Chen","Haonan",""],["Cho","Jung-Hoon",""],["Wu","Cathy",""],["Driggs-Campbell","Katherine",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 01:10:13 GMT"}],"updateDate":"2024-07-02","timestamp":1719709813000,"abstract":"  Fleets of autonomous vehicles can mitigate traffic congestion through simple\nactions, thus improving many socioeconomic factors such as commute time and gas\ncosts. However, these approaches are limited in practice as they assume precise\ncontrol over autonomous vehicle fleets, incur extensive installation costs for\na centralized sensor ecosystem, and also fail to account for uncertainty in\ndriver behavior. To this end, we develop a class of learned residual policies\nthat can be used in cooperative advisory systems and only require the use of a\nsingle vehicle with a human driver. Our policies advise drivers to behave in\nways that mitigate traffic congestion while accounting for diverse driver\nbehaviors, particularly drivers' reactions to instructions, to provide an\nimproved user experience. To realize such policies, we introduce an improved\nreward function that explicitly addresses congestion mitigation and driver\nattitudes to advice. We show that our residual policies can be personalized by\nconditioning them on an inferred driver trait that is learned in an\nunsupervised manner with a variational autoencoder. Our policies are trained in\nsimulation with our novel instruction adherence driver model, and evaluated in\nsimulation and through a user study (N=16) to capture the sentiments of human\ndrivers. Our results show that our approaches successfully mitigate congestion\nwhile adapting to different driver behaviors, with up to 20% and 40%\nimprovement as measured by a combination metric of speed and deviations in\nspeed across time over baselines in our simulation tests and user study,\nrespectively. Our user study further shows that our policies are\nhuman-compatible and personalize to drivers.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"pO7cvdIlpzNq1FSBGot-OzNXc1EZLm14de1lloevSVA","pdfSize":"77939817"}