{"id":"2407.14364","title":"Towards Assessing Data Replication in Music Generation with Music\n  Similarity Metrics on Raw Audio","authors":"Roser Batlle-Roca, Wei-Hisang Liao, Xavier Serra, Yuki Mitsufuji and\n  Emilia G\\'omez","authorsParsed":[["Batlle-Roca","Roser",""],["Liao","Wei-Hisang",""],["Serra","Xavier",""],["Mitsufuji","Yuki",""],["Gómez","Emilia",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 14:52:11 GMT"},{"version":"v2","created":"Thu, 1 Aug 2024 11:16:30 GMT"}],"updateDate":"2024-08-02","timestamp":1721400731000,"abstract":"  Recent advancements in music generation are raising multiple concerns about\nthe implications of AI in creative music processes, current business models and\nimpacts related to intellectual property management. A relevant discussion and\nrelated technical challenge is the potential replication and plagiarism of the\ntraining set in AI-generated music, which could lead to misuse of data and\nintellectual property rights violations. To tackle this issue, we present the\nMusic Replication Assessment (MiRA) tool: a model-independent open evaluation\nmethod based on diverse audio music similarity metrics to assess data\nreplication. We evaluate the ability of five metrics to identify exact\nreplication by conducting a controlled replication experiment in different\nmusic genres using synthetic samples. Our results show that the proposed\nmethodology can estimate exact data replication with a proportion higher than\n10%. By introducing the MiRA tool, we intend to encourage the open evaluation\nof music-generative models by researchers, developers, and users concerning\ndata replication, highlighting the importance of the ethical, social, legal,\nand economic consequences. Code and examples are available for reproducibility\npurposes.\n","subjects":["Computing Research Repository/Sound","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Multimedia","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ay97Ek2llzQ2CNDyLyI49BGssND5QuHfyKF-8_mzojk","pdfSize":"445713"}