{"id":"2407.05626","title":"A Stochastic Interacting Particle-Field Algorithm for a Haptotaxis\n  Advection-Diffusion System Modeling Cancer Cell Invasion","authors":"Boyi Hu, Zhongjian Wang, Jack Xin, Zhiwen Zhang","authorsParsed":[["Hu","Boyi",""],["Wang","Zhongjian",""],["Xin","Jack",""],["Zhang","Zhiwen",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 05:40:21 GMT"}],"updateDate":"2024-07-09","timestamp":1720417221000,"abstract":"  The investigation of tumor invasion and metastasis dynamics is crucial for\nadvancements in cancer biology and treatment. Many mathematical models have\nbeen developed to study the invasion of host tissue by tumor cells. In this\npaper, we develop a novel stochastic interacting particle-field (SIPF)\nalgorithm that accurately simulates the cancer cell invasion process within the\nhaptotaxis advection-diffusion (HAD) system. Our approach approximates\nsolutions using empirical measures of particle interactions, combined with a\nsmoother field variable - the extracellular matrix concentration (ECM) -\ncomputed by the spectral method. We derive a one-step time recursion for both\nthe positions of stochastic particles and the field variable using the implicit\nEuler discretization, which is based on the explicit Green's function of an\nelliptic operator characterized by the Laplacian minus a positive constant. Our\nnumerical experiments demonstrate the superior performance of the proposed\nalgorithm, especially in computing cancer cell growth with thin free boundaries\nin three-dimensional (3D) space. Numerical results show that the SIPF algorithm\nis mesh-free, self-adaptive, and low-cost. Moreover, it is more accurate and\nefficient than traditional numerical techniques such as the finite difference\nmethod (FDM) and spectral methods.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"jBp_e9M79_dBnL1O4TU8zCgajCa_MZ7nt-OnO5Pf6ak","pdfSize":"1713801"}