{"id":"2407.02304","title":"Information Flow Control in Cyclic Process Networks","authors":"Bas van den Heuvel, Farzaneh Derakhshan, Stephanie Balzer","authorsParsed":[["Heuvel","Bas van den",""],["Derakhshan","Farzaneh",""],["Balzer","Stephanie",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 14:37:17 GMT"}],"updateDate":"2024-07-03","timestamp":1719931037000,"abstract":"  Protection of confidential data is an important security consideration of\ntoday's applications. Of particular concern is to guard against unintentional\nleakage to a (malicious) observer, who may interact with the program and draw\ninference from made observations. Information flow control (IFC) type systems\naddress this concern by statically ruling out such leakage. This paper\ncontributes an IFC type system for message-passing concurrent programs, the\ncomputational model of choice for many of today's applications such as cloud\ncomputing and IoT applications. Such applications typically either implicitly\nor explicitly codify protocols according to which message exchange must happen,\nand to statically ensure protocol safety, behavioral type systems such as\nsession types can be used. This paper marries IFC with session typing and\ncontributes over prior work in the following regards: (1) support of realistic\ncyclic process networks as opposed to the restriction to tree-shaped networks,\n(2) more permissive, yet entirely secure, IFC control, exploiting cyclic\nprocess networks, and (3) considering deadlocks as another form of side\nchannel, and asserting deadlock-sensitive noninterference (DSNI) for well-typed\nprograms. To prove DSNI, the paper develops a novel logical relation that\naccounts for cyclic process networks. The logical relation is rooted in linear\nlogic, but drops the tree-topology restriction imposed by prior work.\n","subjects":["Computing Research Repository/Logic in Computer Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"OVCvuFu-gB6bYf9LDNR7wkt650OVna63w5OPmA5OvTs","pdfSize":"978356","objectId":"0x5b15c755d471352617458de8c21496dfd956fd8901e5aaa9dc435d29ee6d74cb","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
