{"id":"2407.17880","title":"DAM: Towards A Foundation Model for Time Series Forecasting","authors":"Luke Darlow, Qiwen Deng, Ahmed Hassan, Martin Asenov, Rajkarn Singh,\n  Artjom Joosen, Adam Barker, Amos Storkey","authorsParsed":[["Darlow","Luke",""],["Deng","Qiwen",""],["Hassan","Ahmed",""],["Asenov","Martin",""],["Singh","Rajkarn",""],["Joosen","Artjom",""],["Barker","Adam",""],["Storkey","Amos",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 08:48:07 GMT"}],"updateDate":"2024-07-26","timestamp":1721897287000,"abstract":"  It is challenging to scale time series forecasting models such that they\nforecast accurately for multiple distinct domains and datasets, all with\npotentially different underlying collection procedures (e.g., sample\nresolution), patterns (e.g., periodicity), and prediction requirements (e.g.,\nreconstruction vs. forecasting). We call this general task universal\nforecasting. Existing methods usually assume that input data is regularly\nsampled, and they forecast to pre-determined horizons, resulting in failure to\ngeneralise outside of the scope of their training. We propose the DAM - a\nneural model that takes randomly sampled histories and outputs an adjustable\nbasis composition as a continuous function of time for forecasting to non-fixed\nhorizons. It involves three key components: (1) a flexible approach for using\nrandomly sampled histories from a long-tail distribution, that enables an\nefficient global perspective of the underlying temporal dynamics while\nretaining focus on the recent history; (2) a transformer backbone that is\ntrained on these actively sampled histories to produce, as representational\noutput, (3) the basis coefficients of a continuous function of time. We show\nthat a single univariate DAM, trained on 25 time series datasets, either\noutperformed or closely matched existing SoTA models at multivariate long-term\nforecasting across 18 datasets, including 8 held-out for zero-shot transfer,\neven though these models were trained to specialise for each dataset-horizon\ncombination. This single DAM excels at zero-shot transfer and very-long-term\nforecasting, performs well at imputation, is interpretable via basis function\ncomposition and attention, can be tuned for different inference-cost\nrequirements, is robust to missing and irregularly sampled data {by design}.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"JVOu4ODBZKabqsgOMQcComVVYiLInQhhbe5d1LKOB88","pdfSize":"8143158"}