{"id":"2407.13019","title":"MagAO-X Phase II Upgrades: Implementation and First On-Sky Results of a\n  New Post-AO 1000 Actuator Deformable Mirror","authors":"Jay K. Kueny, Kyle Van Gorkom, Maggie Kautz, Sebastiaan Haffert, Jared\n  R. Males, Alex Hedglen, Laird Close, Eden McEwen, Jialin Li, Joseph D. Long,\n  Warren Foster, Logan Pearce, Avalon McLeod, Jhen Lumbres, Olivier Guyon,\n  Joshua Liberman","authorsParsed":[["Kueny","Jay K.",""],["Van Gorkom","Kyle",""],["Kautz","Maggie",""],["Haffert","Sebastiaan",""],["Males","Jared R.",""],["Hedglen","Alex",""],["Close","Laird",""],["McEwen","Eden",""],["Li","Jialin",""],["Long","Joseph D.",""],["Foster","Warren",""],["Pearce","Logan",""],["McLeod","Avalon",""],["Lumbres","Jhen",""],["Guyon","Olivier",""],["Liberman","Joshua",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 21:14:33 GMT"}],"updateDate":"2024-07-19","timestamp":1721250873000,"abstract":"  MagAO-X is the extreme coronagraphic adaptive optics (AO) instrument for the\n6.5-meter Magellan Clay telescope and is currently undergoing a comprehensive\nbatch of upgrades. One innovation that the instrument features is a deformable\nmirror (DM) dedicated for non-common path aberration correction (NCPC) within\nthe coronagraph arm. We recently upgraded the 97 actuator NCPC DM with a 1000\nactuator Boston Micromachines Kilo-DM which serves to (1) correct non-common\npath aberrations which hamper performance at small inner-working angles, (2)\nfacilitate focal-plane wavefront control algorithms (e.g., electric field\nconjugation) and (3) enable 10 kHz correction speeds (up from 2 kHz) to assist\npost-AO, real-time low-order wavefront control. We present details on the\ncharacterization and installation of this new DM on MagAO-X as part of our\nefforts to improve deep contrast performance for imaging circumstellar objects\nin reflected light. Pre-installation procedures included use of a Twyman-Green\ninterferometer to build an interaction matrix for commanding the DM surface, in\nclosed-loop, to a flat state for seamless integration into the instrument. With\nthis new NCPC DM now installed, we report on-sky results from the MagAO-X\nobserving run in March -- May 2024 for the Focus Diversity Phase Retrieval and\nimplicit Electric Field Conjugation algorithms for quasistatic speckle removal\nand in-situ Strehl ratio optimization, respectively.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"M_nYef9Y4RTdmjdnWzVF7xCzOhFSAy2kybhghvHRO9I","pdfSize":"1968641"}