{"id":"2407.04353","title":"Segmenting Medical Images: From UNet to Res-UNet and nnUNet","authors":"Lina Huang, Alina Miron, Kate Hone and Yongmin Li","authorsParsed":[["Huang","Lina",""],["Miron","Alina",""],["Hone","Kate",""],["Li","Yongmin",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 08:46:39 GMT"}],"updateDate":"2024-07-08","timestamp":1720169199000,"abstract":"  This study provides a comparative analysis of deep learning models including\nUNet, Res-UNet, Attention Res-UNet, and nnUNet, and evaluates their performance\nin brain tumour, polyp, and multi-class heart segmentation tasks. The analysis\nfocuses on precision, accuracy, recall, Dice Similarity Coefficient (DSC), and\nIntersection over Union (IoU) to assess their clinical applicability. In brain\ntumour segmentation, Res-UNet and nnUNet significantly outperformed UNet, with\nRes-UNet leading in DSC and IoU scores, indicating superior accuracy in tumour\ndelineation. Meanwhile, nnUNet excelled in recall and accuracy, which are\ncrucial for reliable tumour detection in clinical diagnosis and planning. In\npolyp detection, nnUNet was the most effective, achieving the highest metrics\nacross all categories and proving itself as a reliable diagnostic tool in\nendoscopy. In the complex task of heart segmentation, Res-UNet and Attention\nRes-UNet were outstanding in delineating the left ventricle, with Res-UNet also\nleading in right ventricle segmentation. nnUNet was unmatched in myocardium\nsegmentation, achieving top scores in precision, recall, DSC, and IoU. The\nconclusion notes that although Res-UNet occasionally outperforms nnUNet in\nspecific metrics, the differences are quite small. Moreover, nnUNet\nconsistently shows superior overall performance across the experiments.\nParticularly noted for its high recall and accuracy, which are crucial in\nclinical settings to minimize misdiagnosis and ensure timely treatment,\nnnUNet's robust performance in crucial metrics across all tested categories\nestablishes it as the most effective model for these varied and complex\nsegmentation tasks.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"gk4pH3k1vbZ94bSywp0B-6iy3Eew1iv2oliSqGLZNEI","pdfSize":"1894381"}