{"id":"2407.05504","title":"Multimedia and Immersive Training Materials Influence Impressions of\n  Learning But Not Learning Outcomes","authors":"Benjamin A. Clegg, Alex Karduna, Ethan Holen, Jason Garcia, Matthew G.\n  Rhodes, Francisco R. Ortega","authorsParsed":[["Clegg","Benjamin A.",""],["Karduna","Alex",""],["Holen","Ethan",""],["Garcia","Jason",""],["Rhodes","Matthew G.",""],["Ortega","Francisco R.",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 21:58:03 GMT"}],"updateDate":"2024-07-09","timestamp":1720389483000,"abstract":"  Although the use of technologies like multimedia and virtual reality (VR) in\ntraining offer the promise of improved learning, these richer and potentially\nmore engaging materials do not consistently produce superior learning outcomes.\nDefault approaches to such training may inadvertently mimic concepts like naive\nrealism in display design, and desirable difficulties in the science of\nlearning - fostering an impression of greater learning dissociated from actual\ngains in memory. This research examined the influence of format of instructions\nin learning to assemble items from components. Participants in two experiments\nwere trained on the steps to assemble a series of bars, that resembled Meccano\npieces, into eight different shapes. After training on pairs of shapes,\nparticipants rated the likelihood they would remember the shapes and then were\nadministered a recognition test. Relative to viewing a static diagram, viewing\nvideos of shapes being constructed in a VR environment (Experiment 1) or\nviewing within an immersive VR system (Experiment 2) elevated participants'\nassessments of their learning but without enhancing learning outcomes. Overall,\nthese findings illustrate how future workers might mistakenly come to believe\nthat technologically advanced support improves learning and prefer\ninstructional designs that integrate similarly complex cues into training.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"EVBhoiV29TCegfYtBy5ATF8tgDmRLqcAIZLehwpRZw0","pdfSize":"884407"}