{"id":"2407.02807","title":"Regional and Temporal Patterns of Partisan Polarization during the\n  COVID-19 Pandemic in the United States and Canada","authors":"Zachary Yang, Anne Imouza, Maximilian Puelma Touzel, Cecile Amadoro,\n  Gabrielle Desrosiers-Brisebois, Kellin Pelrine, Sacha Levy, Jean-Francois\n  Godbout, Reihaneh Rabbany","authorsParsed":[["Yang","Zachary",""],["Imouza","Anne",""],["Touzel","Maximilian Puelma",""],["Amadoro","Cecile",""],["Desrosiers-Brisebois","Gabrielle",""],["Pelrine","Kellin",""],["Levy","Sacha",""],["Godbout","Jean-Francois",""],["Rabbany","Reihaneh",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 04:55:04 GMT"}],"updateDate":"2024-07-04","timestamp":1719982504000,"abstract":"  Public health measures were among the most polarizing topics debated online\nduring the COVID-19 pandemic. Much of the discussion surrounded specific\nevents, such as when and which particular interventions came into practise. In\nthis work, we develop and apply an approach to measure subnational and\nevent-driven variation of partisan polarization and explore how these dynamics\nvaried both across and within countries. We apply our measure to a dataset of\nover 50 million tweets posted during late 2020, a salient period of polarizing\ndiscourse in the early phase of the pandemic. In particular, we examine\nregional variations in both the United States and Canada, focusing on three\nspecific health interventions: lockdowns, masks, and vaccines. We find that\nmore politically conservative regions had higher levels of partisan\npolarization in both countries, especially in the US where a strong negative\ncorrelation exists between regional vaccination rates and degree of\npolarization in vaccine related discussions. We then analyze the timing,\ncontext, and profile of spikes in polarization, linking them to specific events\ndiscussed on social media across different regions in both countries. These\ntypically last only a few days in duration, suggesting that online discussions\nreflect and could even drive changes in public opinion, which in the context of\npandemic response impacts public health outcomes across different regions and\nover time.\n","subjects":["Computing Research Repository/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"kwHYmuoXVgDJKFcz39TAXICkjx4zprQpuTvWiaiCbn8","pdfSize":"7050749","objectId":"0xa9137922cd258a176b7d3683fdbc5cdb88b934c856662e0aea0857744bb7e6ba","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
