{"id":"2407.04173","title":"Quantifying Prediction Consistency Under Model Multiplicity in Tabular\n  LLMs","authors":"Faisal Hamman, Pasan Dissanayake, Saumitra Mishra, Freddy Lecue,\n  Sanghamitra Dutta","authorsParsed":[["Hamman","Faisal",""],["Dissanayake","Pasan",""],["Mishra","Saumitra",""],["Lecue","Freddy",""],["Dutta","Sanghamitra",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 22:22:09 GMT"}],"updateDate":"2024-07-08","timestamp":1720131729000,"abstract":"  Fine-tuning large language models (LLMs) on limited tabular data for\nclassification tasks can lead to \\textit{fine-tuning multiplicity}, where\nequally well-performing models make conflicting predictions on the same inputs\ndue to variations in the training process (i.e., seed, random weight\ninitialization, retraining on additional or deleted samples). This raises\ncritical concerns about the robustness and reliability of Tabular LLMs,\nparticularly when deployed for high-stakes decision-making, such as finance,\nhiring, education, healthcare, etc. This work formalizes the challenge of\nfine-tuning multiplicity in Tabular LLMs and proposes a novel metric to\nquantify the robustness of individual predictions without expensive model\nretraining. Our metric quantifies a prediction's stability by analyzing\n(sampling) the model's local behavior around the input in the embedding space.\nInterestingly, we show that sampling in the local neighborhood can be leveraged\nto provide probabilistic robustness guarantees against a broad class of\nfine-tuned models. By leveraging Bernstein's Inequality, we show that\npredictions with sufficiently high robustness (as defined by our measure) will\nremain consistent with high probability. We also provide empirical evaluation\non real-world datasets to support our theoretical results. Our work highlights\nthe importance of addressing fine-tuning instabilities to enable trustworthy\ndeployment of LLMs in high-stakes and safety-critical applications.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computers and Society","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Cw54AKn_-6UdWZYGeohtIpQBRMsck7qgu3q3qAyX_tg","pdfSize":"1348983"}