{"id":"2407.06494","title":"A Generative Approach to Control Complex Physical Systems","authors":"Long Wei, Peiyan Hu, Ruiqi Feng, Haodong Feng, Yixuan Du, Tao Zhang,\n  Rui Wang, Yue Wang, Zhi-Ming Ma, Tailin Wu","authorsParsed":[["Wei","Long",""],["Hu","Peiyan",""],["Feng","Ruiqi",""],["Feng","Haodong",""],["Du","Yixuan",""],["Zhang","Tao",""],["Wang","Rui",""],["Wang","Yue",""],["Ma","Zhi-Ming",""],["Wu","Tailin",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 01:56:23 GMT"}],"updateDate":"2024-07-10","timestamp":1720490183000,"abstract":"  Controlling the evolution of complex physical systems is a fundamental task\nacross science and engineering. Classical techniques suffer from limited\napplicability or huge computational costs. On the other hand, recent deep\nlearning and reinforcement learning-based approaches often struggle to optimize\nlong-term control sequences under the constraints of system dynamics. In this\nwork, we introduce Diffusion Physical systems Control (DiffPhyCon), a new class\nof method to address the physical systems control problem. DiffPhyCon excels by\nsimultaneously minimizing both the learned generative energy function and the\npredefined control objectives across the entire trajectory and control\nsequence. Thus, it can explore globally and identify near-optimal control\nsequences. Moreover, we enhance DiffPhyCon with prior reweighting, enabling the\ndiscovery of control sequences that significantly deviate from the training\ndistribution. We test our method in 1D Burgers' equation and 2D jellyfish\nmovement control in a fluid environment. Our method outperforms widely applied\nclassical approaches and state-of-the-art deep learning and reinforcement\nlearning methods. Notably, DiffPhyCon unveils an intriguing\nfast-close-slow-open pattern observed in the jellyfish, aligning with\nestablished findings in the field of fluid dynamics.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"xndg1SuMXxmbT5PlrYHhItCyuGrtDckLJHPJK3dUs5Y","pdfSize":"5038614"}