{"id":"2407.12892","title":"Comments concerning the paper \"On the calibration of ultra-high energy\n  EASs at the Yakutsk array and Telescope Array\" by A.V.Glushkov et. al","authors":"John N. Matthews, Yoshiki Tsunesada (on behalf of the Telescope Array\n  Collaboration)","authorsParsed":[["Matthews","John N.","","on behalf of the Telescope Array\n  Collaboration"],["Tsunesada","Yoshiki","","on behalf of the Telescope Array\n  Collaboration"]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 10:10:20 GMT"}],"updateDate":"2024-07-19","timestamp":1721211020000,"abstract":"  In a recent review of a paper by the Yakutsk Group, submitted to the Journal\nPhysics of Atomic Nuclei and arXiv, the energy scales of the Yakutsk and\nTelescope Array (TA) experiments were examined. The authors developed a custom\ndetector response simulator incorporating ionization, bremsstrahlung, pair\nproduction, and Compton scattering. Applying this simulator to both Yakutsk and\nTA surface detectors, they concluded that the TA energy scale might be\nincorrect due to a misdefined ``response unit.'' They referenced the TA's\n``energy deposit formula'' from the literature, scaling it by two factors\nattributed to the thickness and density of the TA scintillator. Their\nsimulations, using the QGSJET-II-04 hadronic interaction model, agreed with\nTA's calculations for vertical showers but not for inclined showers, suggesting\nan incorrect VEM unit of 2.05 MeV. However, this conclusion was found to be\nincorrect. The TA's energy deposit formula, derived from detailed Monte Carlo\nsimulations using GEANT4, accurately represents the most probable energy\ndeposit by a charged particle in the TA scintillator. The value of 2.05 MeV\naccounts for the scintillator's thickness and density and is validated by\nexcellent agreement between TA's simulated and observed data. The Yakutsk\nGroup's misinterpretation and incorrect application of the TA formula led to\ntheir erroneous conclusion.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"k-sIUnARW-UTnfvrPpP30VQ3co3Wjfbo5_qXUQPYoR4","pdfSize":"44743"}