{"id":"2407.21433","title":"i-CardiAx: Wearable IoT-Driven System for Early Sepsis Detection Through\n  Long-Term Vital Sign Monitoring","authors":"Kanika Dheman, Marco Giordano, Cyriac Thomas, Philipp Schilk, Michele\n  Magno","authorsParsed":[["Dheman","Kanika",""],["Giordano","Marco",""],["Thomas","Cyriac",""],["Schilk","Philipp",""],["Magno","Michele",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 08:36:35 GMT"}],"updateDate":"2024-08-01","timestamp":1722414995000,"abstract":"  Sepsis is a significant cause of early mortality, high healthcare costs, and\ndisability-adjusted life years. Digital interventions like continuous cardiac\nmonitoring can help detect early warning signs and facilitate effective\ninterventions. This paper introduces i-CardiAx, a wearable sensor utilizing\nlow-power high-sensitivity accelerometers to measure vital signs crucial for\ncardiovascular health: heart rate (HR), blood pressure (BP), and respiratory\nrate (RR). Data collected from 10 healthy subjects using the i-CardiAx chest\npatch were used to develop and evaluate lightweight vital sign measurement\nalgorithms. The algorithms demonstrated high performance: RR (-0.11 $\\pm$ 0.77\nbreaths\\min), HR (0.82 $\\pm$ 2.85 beats\\min), and systolic BP (-0.08 $\\pm$\n6.245 mmHg). These algorithms are embedded in an ARM Cortex-M33 processor with\nBluetooth Low Energy (BLE) support, achieving inference times of 4.2 ms for HR\nand RR, and 8.5 ms for BP. Additionally, a multi-channel quantized Temporal\nConvolutional Neural (TCN) Network, trained on the open-source HiRID dataset,\nwas developed to detect sepsis onset using digitally acquired vital signs from\ni-CardiAx. The quantized TCN, deployed on i-CardiAx, predicted sepsis with a\nmedian time of 8.2 hours and an energy per inference of 1.29 mJ. The i-CardiAx\nwearable boasts a sleep power of 0.152 mW and an average power consumption of\n0.77 mW, enabling a 100 mAh battery to last approximately two weeks (432 hours)\nwith continuous monitoring of HR, BP, and RR at 30 measurements per hour and\nrunning inference every 30 minutes. In conclusion, i-CardiAx offers an\nenergy-efficient, high-sensitivity method for long-term cardiovascular\nmonitoring, providing predictive alerts for sepsis and other life-threatening\nevents.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"yxXKuRrSWTYaEUQL2lv4fTkkrCELCAGaofQ8Eq-KAHk","pdfSize":"6835396"}