{"id":"2407.13648","title":"COMCAT: Leveraging Human Judgment to Improve Automatic Documentation and\n  Summarization","authors":"Skyler Grandel (1), Scott Thomas Andersen (2), Yu Huang (1), Kevin\n  Leach (1) ((1) Vanderbilt University, (2) Universidad Nacional Aut\\`onoma de\n  M\\`exico)","authorsParsed":[["Grandel","Skyler",""],["Andersen","Scott Thomas",""],["Huang","Yu",""],["Leach","Kevin",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 16:26:31 GMT"}],"updateDate":"2024-07-19","timestamp":1721319991000,"abstract":"  Software maintenance constitutes a substantial portion of the total lifetime\ncosts of software, with a significant portion attributed to code comprehension.\nSoftware comprehension is eased by documentation such as comments that\nsummarize and explain code. We present COMCAT, an approach to automate comment\ngeneration by augmenting Large Language Models (LLMs) with expertise-guided\ncontext to target the annotation of source code with comments that improve\ncomprehension. Our approach enables the selection of the most relevant and\ninformative comments for a given snippet or file containing source code. We\ndevelop the COMCAT pipeline to comment C/C++ files by (1) automatically\nidentifying suitable locations in which to place comments, (2) predicting the\nmost helpful type of comment for each location, and (3) generating a comment\nbased on the selected location and comment type. In a human subject evaluation,\nwe demonstrate that COMCAT-generated comments significantly improve developer\ncode comprehension across three indicative software engineering tasks by up to\n12% for 87% of participants. In addition, we demonstrate that COMCAT-generated\ncomments are at least as accurate and readable as human-generated comments and\nare preferred over standard ChatGPT-generated comments for up to 92% of\nsnippets of code. Furthermore, we develop and release a dataset containing\nsource code snippets, human-written comments, and human-annotated comment\ncategories. COMCAT leverages LLMs to offer a significant improvement in code\ncomprehension across a variety of human software engineering tasks.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"t3-ww88sX-t7t3Ts8asTLWWpPrs0kjmkeic6emdLs3Y","pdfSize":"2087805"}