{"id":"2407.21034","title":"Watermarking Recommender Systems","authors":"Sixiao Zhang, Cheng Long, Wei Yuan, Hongxu Chen, Hongzhi Yin","authorsParsed":[["Zhang","Sixiao",""],["Long","Cheng",""],["Yuan","Wei",""],["Chen","Hongxu",""],["Yin","Hongzhi",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 06:51:24 GMT"},{"version":"v2","created":"Wed, 14 Aug 2024 08:52:29 GMT"}],"updateDate":"2024-08-15","timestamp":1721199084000,"abstract":"  Recommender systems embody significant commercial value and represent crucial\nintellectual property. However, the integrity of these systems is constantly\nchallenged by malicious actors seeking to steal their underlying models.\nSafeguarding against such threats is paramount to upholding the rights and\ninterests of the model owner. While model watermarking has emerged as a potent\ndefense mechanism in various domains, its direct application to recommender\nsystems remains unexplored and non-trivial. In this paper, we address this gap\nby introducing Autoregressive Out-of-distribution Watermarking (AOW), a novel\ntechnique tailored specifically for recommender systems. Our approach entails\nselecting an initial item and querying it through the oracle model, followed by\nthe selection of subsequent items with small prediction scores. This iterative\nprocess generates a watermark sequence autoregressively, which is then\ningrained into the model's memory through training. To assess the efficacy of\nthe watermark, the model is tasked with predicting the subsequent item given a\ntruncated watermark sequence. Through extensive experimentation and analysis,\nwe demonstrate the superior performance and robust properties of AOW. Notably,\nour watermarking technique exhibits high-confidence extraction capabilities and\nmaintains effectiveness even in the face of distillation and fine-tuning\nprocesses.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Cryptography and Security","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"NCgPa-F_YDZo2ZoNv_gE4p14LAGb0g5jFues9f2EJxU","pdfSize":"744891"}