{"id":"2407.18917","title":"Spatio-temporal Structure of Excitation and Inhibition Emerges in\n  Spiking Neural Networks with and without Biologically Plausible Constraints","authors":"Bal\\'azs M\\'esz\\'aros and James Knight and Thomas Nowotny","authorsParsed":[["Mészáros","Balázs",""],["Knight","James",""],["Nowotny","Thomas",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 11:55:48 GMT"}],"updateDate":"2024-07-30","timestamp":1720353348000,"abstract":"  We present a Spiking Neural Network (SNN) model that incorporates learnable\nsynaptic delays using Dilated Convolution with Learnable Spacings (DCLS). We\ntrain this model on the Raw Heidelberg Digits keyword spotting benchmark using\nBackpropagation Through Time with surrogate gradients. Analysing the\nspatio-temporal structure of synaptic interactions in the network we observe\nthat after training excitation and inhibition are grouped together both in\nspace and time. To further enhance the efficiency and biological realism of our\nmodel, we implemented a dynamic pruning strategy that combines DEEP R for\nconnection removal and RigL for connection reintroduction, ensuring that the\nnetwork maintains optimal connectivity throughout training. Additionally, we\nincorporated Dale's Principle, enforcing each neuron to be exclusively\nexcitatory or inhibitory -- aligning our model closer to biological neural\nnetworks. We observed that, after training, the spatio-temporal patterns of\nexcitation and inhibition appeared in the more biologically plausible model as\nwell. Our research demonstrates the potential of integrating learnable delays,\ndynamic pruning, and biological constraints to develop efficient SNN models for\ntemporal data processing. Furthermore, our results enhance the understanding of\nspatio-temporal dynamics in SNNs -- suggesting that the spatio-temporal\nfeatures which emerge from training are robust to both pruning and rewiring\nprocesses -- providing a solid foundation for future work in neuromorphic\ncomputing applications.\n","subjects":["Computing Research Repository/Neural and Evolutionary Computing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"TSrVdcezq16lgzKsjoetAxb-nhfEYgEcOLHaNqQtoUU","pdfSize":"3536751"}