{"id":"2407.10885","title":"A physical reinterpretation of heat capacity discontinuities for static\n  black holes","authors":"Pedro Bargue\\~no, Diego Fern\\'andez-Silvestre, Juan Antonio Miralles","authorsParsed":[["Bargueño","Pedro",""],["Fernández-Silvestre","Diego",""],["Miralles","Juan Antonio",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 16:37:05 GMT"}],"updateDate":"2024-07-16","timestamp":1721061425000,"abstract":"  A generic characteristic of self-graviting systems is that they have a\nnegative heat capacity. An important example of this behaviour is given by the\nSchwarzschild black hole. The case of charged and rotating black holes is even\nmore interesting, since a change of sign of the specific heat takes place\nthrough an infinite discontinuity. This has been usually associated with a\nblack hole thermodynamic phase transition appearing at the points where the\nheat capacity diverges, the so-called Davies points. This aspect of black hole\nthermodynamics has been addressed from different perspectives, motivating\ndifferent interpretations since its discovery in the 1970s. In this paper, a\nphysical reinterpretation of the heat capacity is provided for spherically\nsymmetric and static black holes. Our analysis is partially based on a\nreformulation of the black hole heat capacity using the Newman--Penrose\nformalism. The application to the Reissner--Nordstr\\\"om--de Sitter black hole\ncase reveals a clear physical interpretation of the Newman--Penrose scalars\nevaluated at the event horizon. This allows us to write the heat capacity as a\nbalance of pressures defined at the horizon. In particular, a matter pressure\n(coming from the energy-momentum tensor) and a thermal pressure (coming from\nthe holographic energy equipartition of the horizon). The Davies point is\nidentified with the point where the Komar thermal energy density matches the\nmatter pressure at the horizon. We also compare the black hole case with the\ncase of self-graviting objects and their corresponding thermal evolutions. We\nconclude that the heat capacity of black holes and self-graviting systems can\nbe understood qualitatively in similar terms.\n","subjects":["Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"bg5M76V5WDgOajw_IzlI4N4OQpRYG2KgukR1K7KA7QA","pdfSize":"1204571"}