{"id":"2407.01091","title":"M2QA: Multi-domain Multilingual Question Answering","authors":"Leon Engl\\\"ander, Hannah Sterz, Clifton Poth, Jonas Pfeiffer, Ilia\n  Kuznetsov and Iryna Gurevych","authorsParsed":[["Engländer","Leon",""],["Sterz","Hannah",""],["Poth","Clifton",""],["Pfeiffer","Jonas",""],["Kuznetsov","Ilia",""],["Gurevych","Iryna",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 08:48:49 GMT"}],"updateDate":"2024-07-02","timestamp":1719823729000,"abstract":"  Generalization and robustness to input variation are core desiderata of\nmachine learning research. Language varies along several axes, most\nimportantly, language instance (e.g. French) and domain (e.g. news). While\nadapting NLP models to new languages within a single domain, or to new domains\nwithin a single language, is widely studied, research in joint adaptation is\nhampered by the lack of evaluation datasets. This prevents the transfer of NLP\nsystems from well-resourced languages and domains to non-dominant\nlanguage-domain combinations. To address this gap, we introduce M2QA, a\nmulti-domain multilingual question answering benchmark. M2QA includes 13,500\nSQuAD 2.0-style question-answer instances in German, Turkish, and Chinese for\nthe domains of product reviews, news, and creative writing. We use M2QA to\nexplore cross-lingual cross-domain performance of fine-tuned models and\nstate-of-the-art LLMs and investigate modular approaches to domain and language\nadaptation. We witness 1) considerable performance variations across\ndomain-language combinations within model classes and 2) considerable\nperformance drops between source and target language-domain combinations across\nall model sizes. We demonstrate that M2QA is far from solved, and new methods\nto effectively transfer both linguistic and domain-specific information are\nnecessary. We make M2QA publicly available at https://github.com/UKPLab/m2qa.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"kOiUOFNdPxe24BVHPiw5Dejnx-S7U5e5oSY1htBszCk","pdfSize":"844545"}