{"id":"2407.08987","title":"Parameter inference from a non-stationary unknown process","authors":"Kieran S. Owens and Ben D. Fulcher","authorsParsed":[["Owens","Kieran S.",""],["Fulcher","Ben D.",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 04:44:29 GMT"}],"updateDate":"2024-07-15","timestamp":1720759469000,"abstract":"  Non-stationary systems are found throughout the world, from climate patterns\nunder the influence of variation in carbon dioxide concentration, to brain\ndynamics driven by ascending neuromodulation. Accordingly, there is a need for\nmethods to analyze non-stationary processes, and yet most time-series analysis\nmethods that are used in practice, on important problems across science and\nindustry, make the simplifying assumption of stationarity. One important\nproblem in the analysis of non-stationary systems is the problem class that we\nrefer to as Parameter Inference from a Non-stationary Unknown Process (PINUP).\nGiven an observed time series, this involves inferring the parameters that\ndrive non-stationarity of the time series, without requiring knowledge or\ninference of a mathematical model of the underlying system. Here we review and\nunify a diverse literature of algorithms for PINUP. We formulate the problem,\nand categorize the various algorithmic contributions. This synthesis will allow\nresearchers to identify gaps in the literature and will enable systematic\ncomparisons of different methods. We also demonstrate that the most common\nsystems that existing methods are tested on - notably the non-stationary Lorenz\nprocess and logistic map - are surprisingly easy to perform well on using\nsimple statistical features like windowed mean and variance, undermining the\npractice of using good performance on these systems as evidence of algorithmic\nperformance. We then identify more challenging problems that many existing\nmethods perform poorly on and which can be used to drive methodological\nadvances in the field. Our results unify disjoint scientific contributions to\nanalyzing non-stationary systems and suggest new directions for progress on the\nPINUP problem and the broader study of non-stationary phenomena.\n","subjects":["Physics/Data Analysis, Statistics and Probability","Computing Research Repository/Machine Learning","Nonlinear Sciences/Chaotic Dynamics","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"E2U_z5VaiBEVZTBw4nsLbpJd2U4Fya1lT1BB6psr94M","pdfSize":"3872982","objectId":"0x7a083630d7004fbd77df8700287c5fbd5c591f7223ff78287569349dadf48e34","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
