{"id":"2407.03264","title":"Anomaly-based Framework for Detecting Power Overloading Cyberattacks in\n  Smart Grid AMI","authors":"Abdelaziz Amara Korba, Nouredine Tamani, Yacine Ghamri-Doudane, Nour\n  El Islem karabadji","authorsParsed":[["Korba","Abdelaziz Amara",""],["Tamani","Nouredine",""],["Ghamri-Doudane","Yacine",""],["karabadji","Nour El Islem",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 16:52:23 GMT"}],"updateDate":"2024-07-04","timestamp":1720025543000,"abstract":"  The Advanced Metering Infrastructure (AMI) is one of the key components of\nthe smart grid. It provides interactive services for managing billing and\nelectricity consumption, but it also introduces new vectors for cyberattacks.\nAlthough, the devastating and severe impact of power overloading cyberattacks\non smart grid AMI, few researches in the literature have addressed them. In the\npresent paper, we propose a two-level anomaly detection framework based on\nregression decision trees. The introduced detection approach leverages the\nregularity and predictability of energy consumption to build reference\nconsumption patterns for the whole neighborhood and each household within it.\nUsing a reference consumption pattern enables detecting power overloading\ncyberattacks regardless of the attacker's strategy as they cause a drastic\nchange in the consumption pattern. The continuous two-level monitoring of\nenergy consumption load allows efficient and early detection of cyberattacks.\nWe carried out an extensive experiment on a real-world publicly available\nenergy consumption dataset of 500 customers in Ireland. We extracted, from the\nraw data, the relevant attributes for training the energy consumption patterns.\nThe evaluation shows that our approach achieves a high detection rate, a low\nfalse alarm rate, and superior performances compared to existing solutions.\n","subjects":["Computing Research Repository/Cryptography and Security","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"RUXEEwYtV1faRVHvZViV5hmZX7rU7uadDMO_CSIEikc","pdfSize":"2183100"}