{"id":"2407.15766","title":"Analyzing selected cryptocurrencies spillover effects on global\n  financial indices: Comparing risk measures using conventional and\n  eGARCH-EVT-Copula approaches","authors":"Shafique Ur Rehman, Touqeer Ahmad, Wu Dash Desheng, and Amirhossein\n  Karamoozian","authorsParsed":[["Rehman","Shafique Ur",""],["Ahmad","Touqeer",""],["Desheng","Wu Dash",""],["Karamoozian","Amirhossein",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 16:18:10 GMT"}],"updateDate":"2024-07-23","timestamp":1721665090000,"abstract":"  This study examines the interdependence between cryptocurrencies and\ninternational financial indices, such as MSCI World and MSCI Emerging Markets.\nWe compute the value at risk, expected shortfall (ES), and range value at risk\n(RVaR) and investigate the dynamics of risk spillover. We employ a hybrid\napproach to derive these risk measures that integrate GARCH models, extreme\nvalue models, and copula functions. This framework uses a bivariate portfolio\napproach involving cryptocurrency data and traditional financial indices. To\nestimate the above risks of these portfolio structures, we employ symmetric and\nasymmetric GARCH and both tail flexible EVT models as marginal to model the\nmarginal distribution of each return series and apply different copula\nfunctions to connect the pairs of marginal distributions into a multivariate\ndistribution. The empirical findings indicate that the eGARCH EVT-based copula\nmodel adeptly captures intricate dependencies, surpassing conventional\nmethodologies like Historical simulations and t-distributed parametric in VaR\nestimation. At the same time, the HS method proves superior for ES, and the\nt-distributed parametric method outperforms RVaR. Eventually, the\nDiebold-Yilmaz approach will be applied to compute risk spillovers between four\nsets of asset sequences. This phenomenon implies that cryptocurrencies reveal\nsubstantial spillover effects among themselves but minimal impact on other\nassets. From this, it can be concluded that cryptocurrencies propose\ndiversification benefits and do not provide hedging advantages within an\ninvestor's portfolio. Our results underline RVaR superiority over ES regarding\nregulatory arbitrage and model misspecification. The conclusions of this study\nwill benefit investors and financial market professionals who aspire to\ncomprehend digital currencies as a novel asset class and attain perspicuity in\nregulatory arbitrage.\n","subjects":["Quantitative Finance/Risk Management"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"c6XKzsop9rYJBJ4CaYFYckJzp466SF1AB5YM3iujOSM","pdfSize":"1001417"}