{"id":"2407.13561","title":"Research on Tibetan Tourism Viewpoints information generation system\n  based on LLM","authors":"Jinhu Qi, Shuai Yan, Wentao Zhang, Yibo Zhang, Zirui Liu, Ke Wang","authorsParsed":[["Qi","Jinhu",""],["Yan","Shuai",""],["Zhang","Wentao",""],["Zhang","Yibo",""],["Liu","Zirui",""],["Wang","Ke",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 14:31:53 GMT"}],"updateDate":"2024-07-19","timestamp":1721313113000,"abstract":"  Tibet, ensconced within China's territorial expanse, is distinguished by its\nlabyrinthine and heterogeneous topography, a testament to its profound\nhistorical heritage, and the cradle of a unique religious ethos. The very\nessence of these attributes, however, has impeded the advancement of Tibet's\ntourism service infrastructure, rendering existing smart tourism services\ninadequate for the region's visitors. This study delves into the ramifications\nof informational disparities at tourist sites on Tibetan tourism and addresses\nthe challenge of establishing the Large Language Model (LLM) evaluation\ncriteria. It introduces an innovative approach, the DualGen Bridge AI system,\nemploying supervised fine-tuning techniques to bolster model functionality and\nenhance optimization processes. Furthermore, it pioneers a multi-structured\ngenerative results assessment framework. Empirical validation confirms the\nefficacy of this framework. The study also explores the application of the\nsupervised fine-tuning method within the proprietary DualGen Bridge AI, aimed\nat refining the generation of tourist site information. The study's findings\noffer valuable insights for optimizing system performance and provide support\nand inspiration for the application of LLM technology in Tibet's tourism\nservices and beyond, potentially revolutionizing the smart tourism industry\nwith advanced, tailored information generation capabilities.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"GKaO-QCVrY3h0tW3zf4BcJ4DbqUplKqkKYE9w7dLUpc","pdfSize":"591705"}