{"id":"2407.09624","title":"Noncontextuality inequalities for prepare-transform-measure scenarios","authors":"David Schmid, Roberto D. Baldij\\~ao, John H. Selby, Ana Bel\\'en Sainz,\n  Robert W. Spekkens","authorsParsed":[["Schmid","David",""],["Baldijão","Roberto D.",""],["Selby","John H.",""],["Sainz","Ana Belén",""],["Spekkens","Robert W.",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 18:20:41 GMT"}],"updateDate":"2024-07-16","timestamp":1720808441000,"abstract":"  We provide the first systematic technique for deriving witnesses of\ncontextuality in prepare-transform-measure scenarios. More specifically, we\nshow how linear quantifier elimination can be used to compute a polytope of\ncorrelations consistent with generalized noncontextuality in such scenarios.\nThis polytope is specified as a set of noncontextuality inequalities that are\nnecessary and sufficient conditions for observed data in the scenario to admit\nof a classical explanation relative to any linear operational identities, if\none ignores some constraints from diagram preservation. While including these\nlatter constraints generally leads to tighter inequalities, it seems that\nnonlinear quantifier elimination would be required to systematically include\nthem. We also provide a linear program which can certify the nonclassicality of\na set of numerical data arising in a prepare-transform-measure experiment. We\napply our results to get a robust noncontextuality inequality for\ntransformations that can be violated within the stabilizer subtheory. Finally,\nwe give a simple algorithm for computing all the linear operational identities\nholding among a given set of states, of transformations, or of measurements.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"fiBmgUdTBwqzZW-Qve3C7NrTXINCZRb1AY26DPBdmBM","pdfSize":"849591","objectId":"0xbeaf5f3bc7482bfd22e7daacea7de437f82feaeec9e198134810933d5851a55a","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
