{"id":"2407.11135","title":"An efficient pipeline for joint gravitational wave searches from\n  individual binaries and a gravitational wave background with Hamiltonian\n  sampling","authors":"Gabriel E. Freedman, Sarah J. Vigeland","authorsParsed":[["Freedman","Gabriel E.",""],["Vigeland","Sarah J.",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 18:00:21 GMT"}],"updateDate":"2024-07-17","timestamp":1721066421000,"abstract":"  The pulsar timing array community has recently reported the first evidence of\na low-frequency stochastic gravitational wave background. With longer\nobservational timespans we expect to be able to resolve individual\ngravitational wave sources in our data alongside the background signal. The\nstatistical modeling and Bayesian searches for such individual signals is a\ncomputationally taxing task that is the focus of many different avenues of\nmethods development. We present a pipeline for performing efficient joint\nsearches for gravitational waves originating from individual supermassive black\nhole binaries as well as a gravitational wave background using a Hamiltonian\nMonte Carlo sampling scheme. Hamiltonian sampling proposes samples based on the\ngradients of the model likelihood, and can both converge faster to more\ncomplicated and high-dimensional distributions as well as efficiently explore\nhighly covariant parameter spaces such as the joint gravitational wave\nbackground and individual binary model. We show the effectiveness of our scheme\nby demonstrating accurate parameter estimation for simulated datasets\ncontaining low- (6 nHz) or high- (60 nHz) frequency binary sources.\nAdditionally we show that our method is capable at more efficiently generating\nskymaps for individual binary sources -- maps displaying the upper limits on\nthe gravitational wave strain of the source, $h_{0}$, as a function of sky\nlocation -- by sampling over larger portions of the full sky. Comparing against\nresults for the NANOGrav 12.5-year dataset, we find similar reconstructed upper\nlimits on the gravitational wave strain while simultaneously reducing the\nnumber of required analyses from 72 independent binned searches down to a\nsingle run.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"uPmb9sZQ317CPemY0HqkXFseegj2axoKv0eLp6rs4A0","pdfSize":"4981218"}