{"id":"2407.16754","title":"Demonstrating sub-electron noise performance in Single electron\n  Sensitive Readout (SiSeRO) devices","authors":"Tanmoy Chattopadhyay, Sven Herrmann, Peter Orel, Kevan Donlon, Steven\n  W. Allen, Marshall W. Bautz, Brianna Cantrall, Michael Cooper, Beverly\n  LaMarr, Chris Leitz, Eric Miller, R. Glenn Morris, Abigail Y. Pan, Gregory\n  Prigozhin, Ilya Prigozhin, Haley R. Stueber, and Daniel R. Wilkins","authorsParsed":[["Chattopadhyay","Tanmoy",""],["Herrmann","Sven",""],["Orel","Peter",""],["Donlon","Kevan",""],["Allen","Steven W.",""],["Bautz","Marshall W.",""],["Cantrall","Brianna",""],["Cooper","Michael",""],["LaMarr","Beverly",""],["Leitz","Chris",""],["Miller","Eric",""],["Morris","R. Glenn",""],["Pan","Abigail Y.",""],["Prigozhin","Gregory",""],["Prigozhin","Ilya",""],["Stueber","Haley R.",""],["Wilkins","Daniel R.",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 18:00:03 GMT"}],"updateDate":"2024-07-25","timestamp":1721757603000,"abstract":"  Single electron Sensitive Read Out (SiSeRO) is a novel on-chip charge\ndetection technology that can, in principle, provide significantly greater\nresponsivity and improved noise performance than traditional charge coupled\ndevice (CCD) readout circuitry. The SiSeRO, developed by MIT Lincoln\nLaboratory, uses a p-MOSFET transistor with a depleted back-gate region under\nthe transistor channel; as charge is transferred into the back gate region, the\ntransistor current is modulated. With our first generation SiSeRO devices, we\npreviously achieved a responsivity of around 800 pA per electron, an equivalent\nnoise charge (ENC) of 4.5 electrons root mean square (RMS), and a full width at\nhalf maximum (FWHM) spectral resolution of 130 eV at 5.9 keV, at a readout\nspeed of 625 Kpixel/s and for a detector temperature of 250 K. Importantly,\nsince the charge signal remains unaffected by the SiSeRO readout process, we\nhave also been able to implement Repetitive Non-Destructive Readout (RNDR),\nachieving an improved ENC performance. In this paper, we demonstrate\nsub-electron noise sensitivity with these devices, utilizing an enhanced test\nsetup optimized for RNDR measurements, with excellent temperature control,\nimproved readout circuitry, and advanced digital filtering techniques. We are\ncurrently fabricating new SiSeRO detectors with more sensitive and\nRNDR-optimized amplifier designs, which will help mature the SiSeRO technology\nin the future and eventually lead to the pathway to develop active pixel sensor\n(APS) arrays using sensitive SiSeRO amplifiers on each pixel. Active pixel\ndevices with sub-electron sensitivity and fast readout present an exciting\noption for next generation, large area astronomical X-ray telescopes requiring\nfast, low-noise megapixel imagers.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/High Energy Astrophysical Phenomena","Physics/Instrumentation and Detectors"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"bljw2QmDGADbufSryAVeeZYN3Cp3LBTLa9q_ECveLfY","pdfSize":"4967674","objectId":"0xc01e705c5ece88c01b70e7a76da1a0e3d21e900e4334965ee92e5a9bfe703d1c","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
