{"id":"2407.09935","title":"LeRF: Learning Resampling Function for Adaptive and Efficient Image\n  Interpolation","authors":"Jiacheng Li, Chang Chen, Fenglong Song, Youliang Yan, Zhiwei Xiong","authorsParsed":[["Li","Jiacheng",""],["Chen","Chang",""],["Song","Fenglong",""],["Yan","Youliang",""],["Xiong","Zhiwei",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 16:09:45 GMT"}],"updateDate":"2024-07-16","timestamp":1720886985000,"abstract":"  Image resampling is a basic technique that is widely employed in daily\napplications, such as camera photo editing. Recent deep neural networks (DNNs)\nhave made impressive progress in performance by introducing learned data\npriors. Still, these methods are not the perfect substitute for interpolation,\ndue to the drawbacks in efficiency and versatility. In this work, we propose a\nnovel method of Learning Resampling Function (termed LeRF), which takes\nadvantage of both the structural priors learned by DNNs and the locally\ncontinuous assumption of interpolation. Specifically, LeRF assigns spatially\nvarying resampling functions to input image pixels and learns to predict the\nhyper-parameters that determine the shapes of these resampling functions with a\nneural network. Based on the formulation of LeRF, we develop a family of\nmodels, including both efficiency-orientated and performance-orientated ones.\nTo achieve interpolation-level efficiency, we adopt look-up tables (LUTs) to\naccelerate the inference of the learned neural network. Furthermore, we design\na directional ensemble strategy and edge-sensitive indexing patterns to better\ncapture local structures. On the other hand, to obtain DNN-level performance,\nwe propose an extension of LeRF to enable it in cooperation with pre-trained\nupsampling models for cascaded resampling. Extensive experiments show that the\nefficiency-orientated version of LeRF runs as fast as interpolation,\ngeneralizes well to arbitrary transformations, and outperforms interpolation\nsignificantly, e.g., up to 3dB PSNR gain over Bicubic for x2 upsampling on\nManga109. Besides, the performance-orientated version of LeRF reaches\ncomparable performance with existing DNNs at much higher efficiency, e.g., less\nthan 25% running time on a desktop GPU.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Multimedia","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"zHHfH2_vcj9-BialSMHA6zA-4389nExuohdrXBmQMvI","pdfSize":"8404090"}