{"id":"2407.00035","title":"Achieving Observability on Fog Computing with the use of open-source\n  tools","authors":"Breno Costa, Abhik Banerjee, Prem Prakash Jayaraman, Leonardo R.\n  Carvalho, Jo\\~ao Bachiega Jr., Aleteia Araujo","authorsParsed":[["Costa","Breno",""],["Banerjee","Abhik",""],["Jayaraman","Prem Prakash",""],["Carvalho","Leonardo R.",""],["Bachiega","João","Jr."],["Araujo","Aleteia",""]],"versions":[{"version":"v1","created":"Sat, 25 May 2024 17:02:18 GMT"}],"updateDate":"2024-07-02","timestamp":1716656538000,"abstract":"  Fog computing can provide computational resources and low-latency\ncommunication at the network edge. But with it comes uncertainties that must be\nmanaged in order to guarantee Service Level Agreements. Service observability\ncan help the environment better deal with uncertainties, delivering relevant\nand up-to-date information in a timely manner to support decision making.\nObservability is considered a superset of monitoring since it uses not only\nperformance metrics, but also other instrumentation domains such as logs and\ntraces. However, as Fog Computing is typically characterised by\nresource-constrained nodes and network uncertainties, increasing observability\nin fog can be risky due to the additional load injected into a restricted\nenvironment. There is no work in the literature that evaluated fog\nobservability. In this paper, we first outline the challenges of achieving\nobservability in a Fog environment, based on which we present a formal\ndefinition of fog observability. Subsequently, a real-world Fog Computing\ntestbed running a smart city use case is deployed, and an empirical evaluation\nof fog observability using open-source tools is presented. The results show\nthat under certain conditions, it is viable to provide observability in a Fog\nComputing environment using open-source tools, although it is necessary to\ncontrol the overhead modifying their default configuration according to the\napplication characteristics.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"nLYmdtWEcCf1sJtnMMRImZnmWQcMsfO0bJVVI37qABI","pdfSize":"2222054"}