{"id":"2407.16990","title":"Region-based Content Enhancement for Efficient Video Analytics at the\n  Edge","authors":"Weijun Wang, Liang Mi, Shaowei Cen, Haipeng Dai, Yuanchun Li, Xiaoming\n  Fu, Yunxin Liu","authorsParsed":[["Wang","Weijun",""],["Mi","Liang",""],["Cen","Shaowei",""],["Dai","Haipeng",""],["Li","Yuanchun",""],["Fu","Xiaoming",""],["Liu","Yunxin",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 04:17:32 GMT"}],"updateDate":"2024-07-25","timestamp":1721794652000,"abstract":"  Video analytics is widespread in various applications serving our society.\nRecent advances of content enhancement in video analytics offer significant\nbenefits for the bandwidth saving and accuracy improvement. However, existing\ncontent-enhanced video analytics systems are excessively computationally\nexpensive and provide extremely low throughput. In this paper, we present\nregion-based content enhancement, that enhances only the important regions in\nvideos, to improve analytical accuracy. Our system, RegenHance, enables\nhigh-accuracy and high-throughput video analytics at the edge by 1) a\nmacroblock-based region importance predictor that identifies the important\nregions fast and precisely, 2) a region-aware enhancer that stitches sparsely\ndistributed regions into dense tensors and enhances them efficiently, and 3) a\nprofile-based execution planer that allocates appropriate resources for\nenhancement and analytics components. We prototype RegenHance on five\nheterogeneous edge devices. Experiments on two analytical tasks reveal that\nregion-based enhancement improves the overall accuracy of 10-19% and achieves\n2-3x throughput compared to the state-of-the-art frame-based enhancement\nmethods.\n","subjects":["Computing Research Repository/Networking and Internet Architecture"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"mDDgPCWCo1zZVTJcnU6Y2fdOIZZR89cYejyit3xIJ48","pdfSize":"9003906","objectId":"0xf1fb2d7c8292b75900598d759d63f1f1554e667c1641680174986f1448016728","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
