{"id":"2407.03835","title":"7th ABAW Competition: Multi-Task Learning and Compound Expression\n  Recognition","authors":"Dimitrios Kollias and Stefanos Zafeiriou and Irene Kotsia and Abhinav\n  Dhall and Shreya Ghosh and Chunchang Shao and Guanyu Hu","authorsParsed":[["Kollias","Dimitrios",""],["Zafeiriou","Stefanos",""],["Kotsia","Irene",""],["Dhall","Abhinav",""],["Ghosh","Shreya",""],["Shao","Chunchang",""],["Hu","Guanyu",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 11:04:29 GMT"},{"version":"v2","created":"Mon, 8 Jul 2024 10:40:53 GMT"}],"updateDate":"2024-07-09","timestamp":1720091069000,"abstract":"  This paper describes the 7th Affective Behavior Analysis in-the-wild (ABAW)\nCompetition, which is part of the respective Workshop held in conjunction with\nECCV 2024. The 7th ABAW Competition addresses novel challenges in understanding\nhuman expressions and behaviors, crucial for the development of human-centered\ntechnologies. The Competition comprises of two sub-challenges: i) Multi-Task\nLearning (the goal is to learn at the same time, in a multi-task learning\nsetting, to estimate two continuous affect dimensions, valence and arousal, to\nrecognise between the mutually exclusive classes of the 7 basic expressions and\n'other'), and to detect 12 Action Units); and ii) Compound Expression\nRecognition (the target is to recognise between the 7 mutually exclusive\ncompound expression classes). s-Aff-Wild2, which is a static version of the A/V\nAff-Wild2 database and contains annotations for valence-arousal, expressions\nand Action Units, is utilized for the purposes of the Multi-Task Learning\nChallenge; a part of C-EXPR-DB, which is an A/V in-the-wild database with\ncompound expression annotations, is utilized for the purposes of the Compound\nExpression Recognition Challenge. In this paper, we introduce the two\nchallenges, detailing their datasets and the protocols followed for each. We\nalso outline the evaluation metrics, and highlight the baseline systems and\ntheir results. Additional information about the competition can be found at\n\\url{https://affective-behavior-analysis-in-the-wild.github.io/7th}.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"3PV_HacY_HpdkNl_eVyYUzhGoWYge7a6NQgzPtRJzjE","pdfSize":"420497"}