{"id":"2407.01392","title":"Diffusion Forcing: Next-token Prediction Meets Full-Sequence Diffusion","authors":"Boyuan Chen, Diego Marti Monso, Yilun Du, Max Simchowitz, Russ\n  Tedrake, Vincent Sitzmann","authorsParsed":[["Chen","Boyuan",""],["Monso","Diego Marti",""],["Du","Yilun",""],["Simchowitz","Max",""],["Tedrake","Russ",""],["Sitzmann","Vincent",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 15:43:25 GMT"},{"version":"v2","created":"Tue, 2 Jul 2024 15:39:29 GMT"},{"version":"v3","created":"Thu, 4 Jul 2024 04:51:10 GMT"}],"updateDate":"2024-07-08","timestamp":1719848605000,"abstract":"  This paper presents Diffusion Forcing, a new training paradigm where a\ndiffusion model is trained to denoise a set of tokens with independent\nper-token noise levels. We apply Diffusion Forcing to sequence generative\nmodeling by training a causal next-token prediction model to generate one or\nseveral future tokens without fully diffusing past ones. Our approach is shown\nto combine the strengths of next-token prediction models, such as\nvariable-length generation, with the strengths of full-sequence diffusion\nmodels, such as the ability to guide sampling to desirable trajectories. Our\nmethod offers a range of additional capabilities, such as (1) rolling-out\nsequences of continuous tokens, such as video, with lengths past the training\nhorizon, where baselines diverge and (2) new sampling and guiding schemes that\nuniquely profit from Diffusion Forcing's variable-horizon and causal\narchitecture, and which lead to marked performance gains in decision-making and\nplanning tasks. In addition to its empirical success, our method is proven to\noptimize a variational lower bound on the likelihoods of all subsequences of\ntokens drawn from the true joint distribution. Project website:\nhttps://boyuan.space/diffusion-forcing\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"L8DcMPJCTTNlFkLCLExFRnWJk9DX6wBZRC9Qi1Ezy5s","pdfSize":"18922612"}