{"id":"2407.06773","title":"Evaluating Quantum Optimization for Dynamic Self-Reliant Community\n  Detection","authors":"David Bucher, Daniel Porawski, Benedikt Wimmer, Jonas N\\\"u{\\ss}lein,\n  Corey O'Meara, Naeimeh Mohseni, Giorgio Cortiana and Claudia Linnhoff-Popien","authorsParsed":[["Bucher","David",""],["Porawski","Daniel",""],["Wimmer","Benedikt",""],["Nüßlein","Jonas",""],["O'Meara","Corey",""],["Mohseni","Naeimeh",""],["Cortiana","Giorgio",""],["Linnhoff-Popien","Claudia",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 11:44:58 GMT"}],"updateDate":"2024-07-10","timestamp":1720525498000,"abstract":"  Power grid partitioning is an important requirement for resilient\ndistribution grids. Since electricity production is progressively shifted to\nthe distribution side, dynamic identification of self-reliant grid subsets\nbecomes crucial for operation. This problem can be represented as a\nmodification to the well-known NP-hard Community Detection (CD) problem. We\nformulate it as a Quadratic Unconstrained Binary Optimization (QUBO) problem\nsuitable for solving using quantum computation{\\color{blue}, which is expected\nto find better-quality partitions faster. The formulation aims to find\ncommunities with maximal self-sufficiency and minimal power flowing between\nthem}. To assess quantum optimization for sizeable problems, we develop a\nhierarchical divisive method that solves sub-problem QUBOs to perform grid\nbisections. Furthermore, we propose a customization of the Louvain heuristic\nthat includes self-reliance. In the evaluation, we first demonstrate that this\nproblem examines exponential runtime scaling classically. Then, using different\nIEEE power system test cases, we benchmark the solution quality for multiple\napproaches: D-Wave's hybrid quantum-classical solvers, classical heuristics,\nand a branch-and-bound solver. As a result, we observe that the hybrid solvers\nprovide very promising results, both with and without the divisive algorithm,\nregarding solution quality achieved within a given time frame. Directly\nutilizing D-Wave's Quantum Annealing (QA) hardware shows inferior partitioning.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"A1ysBhbyynGgmW5kdXxTyzThaRw271Ph6u8Cu0KwCC0","pdfSize":"682610"}