{"id":"2407.18877","title":"Code Structure-Aware through Line-level Semantic Learning for Code\n  Vulnerability Detection","authors":"Ziliang Wang, Ge Li, Jia Li, Yihong Dong, Yingfei Xiong, Zhi Jin","authorsParsed":[["Wang","Ziliang",""],["Li","Ge",""],["Li","Jia",""],["Dong","Yihong",""],["Xiong","Yingfei",""],["Jin","Zhi",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 17:15:58 GMT"}],"updateDate":"2024-07-29","timestamp":1722014158000,"abstract":"  Different from the flow semantics of natural languages, programming languages\nare inherently rigid in structure and grammar. Existing fine-tuning\nmethodologies for code vulnerability detection generally treat code as long\ntext sequences, stripping away structural elements such as newlines ('/n') and\nwhitespace. However, this approach inadvertently results in the loss of crucial\nstructural information, diminishing the distinct characteristics of code and\nimpairing the accuracy of vulnerability detection. To address these challenges,\nwe propose a novel network architecture method based on pre-trained code\nmodels, which incorporates structural information awareness. We propose an\nenhanced code text processing workflow that retains structural elements prior\nto modeling. This refinement allows the model to retain and exploit line-level\nstructural information and semantic information during the modeling process.\nFurthermore, we introduce a new network architecture, the Code Structure-Aware\nNetwork through Line-level Semantic Learning (CSLS), which integrates three key\ncomponents: global vulnerability awareness, line-structural awareness, and\nsensitive-line awareness. We have conducted comprehensive experiments using\nvulnerability detection datasets from real-world projects. Extensive\nexperiments were conducted on vulnerability detection datasets derived from\nreal-world projects. The results demonstrate that our new code pre-processing\nflow significantly improves existing baselines (e.g., a 3\\% accuracy\nimprovement on the Devign dataset when applied to popular models such as\nCoderBert and UniXcoder). The proposed network architecture also demonstrates\nsuperior accuracy in detecting vulnerabilities, surpassing newly established\nbenchmarks. These findings underscore the importance of structural information\nin enhancing the efficacy of code vulnerability detection models.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"cRCBhbrqQP1LdcXxAGJcZmKhBNfUWDBWtcpdPbjfY80","pdfSize":"818189"}