{"id":"2407.13752","title":"LogoSticker: Inserting Logos into Diffusion Models for Customized\n  Generation","authors":"Mingkang Zhu, Xi Chen, Zhongdao Wang, Hengshuang Zhao, Jiaya Jia","authorsParsed":[["Zhu","Mingkang",""],["Chen","Xi",""],["Wang","Zhongdao",""],["Zhao","Hengshuang",""],["Jia","Jiaya",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 17:54:49 GMT"}],"updateDate":"2024-07-19","timestamp":1721325289000,"abstract":"  Recent advances in text-to-image model customization have underscored the\nimportance of integrating new concepts with a few examples. Yet, these\nprogresses are largely confined to widely recognized subjects, which can be\nlearned with relative ease through models' adequate shared prior knowledge. In\ncontrast, logos, characterized by unique patterns and textual elements, are\nhard to establish shared knowledge within diffusion models, thus presenting a\nunique challenge. To bridge this gap, we introduce the task of logo insertion.\nOur goal is to insert logo identities into diffusion models and enable their\nseamless synthesis in varied contexts. We present a novel two-phase pipeline\nLogoSticker to tackle this task. First, we propose the actor-critic relation\npre-training algorithm, which addresses the nontrivial gaps in models'\nunderstanding of the potential spatial positioning of logos and interactions\nwith other objects. Second, we propose a decoupled identity learning algorithm,\nwhich enables precise localization and identity extraction of logos.\nLogoSticker can generate logos accurately and harmoniously in diverse contexts.\nWe comprehensively validate the effectiveness of LogoSticker over customization\nmethods and large models such as DALLE~3.\n\\href{https://mingkangz.github.io/logosticker}{Project page}.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"jFKgC2-GwoZnvUynvxC9F0X0KXXGZjv56iRIetGh5cQ","pdfSize":"10558342"}