{"id":"2407.17053","title":"Automated Code-centric Software Vulnerability Assessment: How Far Are\n  We? An Empirical Study in C/C++","authors":"Anh The Nguyen, Triet Huynh Minh Le, M. Ali Babar","authorsParsed":[["Nguyen","Anh The",""],["Le","Triet Huynh Minh",""],["Babar","M. Ali",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 07:26:58 GMT"},{"version":"v2","created":"Thu, 25 Jul 2024 03:02:12 GMT"},{"version":"v3","created":"Sun, 28 Jul 2024 18:00:05 GMT"},{"version":"v4","created":"Sat, 3 Aug 2024 18:31:37 GMT"}],"updateDate":"2024-08-06","timestamp":1721806018000,"abstract":"  Background: The C and C++ languages hold significant importance in Software\nEngineering research because of their widespread use in practice. Numerous\nstudies have utilized Machine Learning (ML) and Deep Learning (DL) techniques\nto detect software vulnerabilities (SVs) in the source code written in these\nlanguages. However, the application of these techniques in function-level SV\nassessment has been largely unexplored. SV assessment is increasingly crucial\nas it provides detailed information on the exploitability, impacts, and\nseverity of security defects, thereby aiding in their prioritization and\nremediation. Aims: We conduct the first empirical study to investigate and\ncompare the performance of ML and DL models, many of which have been used for\nSV detection, for function-level SV assessment in C/C++. Method: Using 9,993\nvulnerable C/C++ functions, we evaluated the performance of six multi-class ML\nmodels and five multi-class DL models for the SV assessment at the function\nlevel based on the Common Vulnerability Scoring System (CVSS). We further\nexplore multi-task learning, which can leverage common vulnerable code to\npredict all SV assessment outputs simultaneously in a single model, and compare\nthe effectiveness and efficiency of this model type with those of the original\nmulti-class models. Results: We show that ML has matching or even better\nperformance compared to the multi-class DL models for function-level SV\nassessment with significantly less training time. Employing multi-task learning\nallows the DL models to perform significantly better, with an average of 8-22%\nincrease in Matthews Correlation Coefficient (MCC). Conclusions: We distill the\npractices of using data-driven techniques for function-level SV assessment in\nC/C++, including the use of multi-task DL to balance efficiency and\neffectiveness. This can establish a strong foundation for future work in this\narea.\n","subjects":["Computing Research Repository/Software Engineering","Computing Research Repository/Cryptography and Security","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"udtJdbkDFcDfGy9uMd-u1sA9sbv3odbNmlKZ0nh1T0c","pdfSize":"884339"}