{"id":"2407.21392","title":"Anomalous strain rate sensitivity of a Cu/Al$_2$O$_3$ multi-layered thin\n  film","authors":"Szilvia Kal\\'acska, L\\'aszl\\'o Peth\\H{o}, Guillaume Kermouche, Johann\n  Michler, P\\'eter Dus\\'an Isp\\'anovity","authorsParsed":[["Kalácska","Szilvia",""],["Pethő","László",""],["Kermouche","Guillaume",""],["Michler","Johann",""],["Ispánovity","Péter Dusán",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 07:31:32 GMT"}],"updateDate":"2024-08-01","timestamp":1722411092000,"abstract":"  To study the size and strain rate dependency of copper polycrystalline\nmicrostructures, a multi-layered copper/Al$_2$O$_3$ thin film was deposited on\na Si substrate using a hybrid deposition system (combining physical vapour and\natomic layer deposition). High temperature treatment was applied on the \"As\nDeposited\" material with ultrafine-grained structure to increase the average\ngrain size, resulting in a \"Heat Treated\" state with microcrystalline\nstructure. Focused ion beam milling was employed to create square shaped\nmicropillars with two different sizes, that were subjected to compressive\nloading at various (0.001/s - 1000/s) strain rates. The detected two distinct\nanomalies in the strain rate sensitivity behavior appearing at high strain\nrates could be related to the pillar diameter and the grain size of the\ndeformed samples. The Al$_2$O$_3$ interlayer studied by transmission electron\nmicroscopy showed excellent thermal stability and grain boundary pinning by\nprecipitation, also resulting in the homogeneous deformation of the pillars and\npreventing shear localization. Geometrically necessary dislocation densities\nestimated by high (angular) resolution electron backscatter diffraction\npresented inhomogeneous dislocation distribution within the deformed pillar\nvolumes, that is attributed to the proximity of the sample edges. Finally, the\nAl$_2$O$_3$ interlayers successfully suppressed any possible recrystallization\nprocesses, contributing to the excellent film stability, that makes the\nproposed coating ideal to be operating under extreme conditions.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"Kq5S46Qu4urIKwWGAcjEThuhhg9-ce4h79F9yvlAN9Y","pdfSize":"38325164"}