{"id":"2407.12193","title":"ClaimCompare: A Data Pipeline for Evaluation of Novelty Destroying\n  Patent Pairs","authors":"Arav Parikh and Shiri Dori-Hacohen","authorsParsed":[["Parikh","Arav",""],["Dori-Hacohen","Shiri",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 21:38:45 GMT"}],"updateDate":"2024-07-18","timestamp":1721165925000,"abstract":"  A fundamental step in the patent application process is the determination of\nwhether there exist prior patents that are novelty destroying. This step is\nroutinely performed by both applicants and examiners, in order to assess the\nnovelty of proposed inventions among the millions of applications filed\nannually. However, conducting this search is time and labor-intensive, as\nsearchers must navigate complex legal and technical jargon while covering a\nlarge amount of legal claims. Automated approaches using information retrieval\nand machine learning approaches to detect novelty destroying patents present a\npromising avenue to streamline this process, yet research focusing on this\nspace remains limited. In this paper, we introduce a novel data pipeline,\nClaimCompare, designed to generate labeled patent claim datasets suitable for\ntraining IR and ML models to address this challenge of novelty destruction\nassessment. To the best of our knowledge, ClaimCompare is the first pipeline\nthat can generate multiple novelty destroying patent datasets. To illustrate\nthe practical relevance of this pipeline, we utilize it to construct a sample\ndataset comprising of over 27K patents in the electrochemical domain: 1,045\nbase patents from USPTO, each associated with 25 related patents labeled\naccording to their novelty destruction towards the base patent. Subsequently,\nwe conduct preliminary experiments showcasing the efficacy of this dataset in\nfine-tuning transformer models to identify novelty destroying patents,\ndemonstrating 29.2% and 32.7% absolute improvement in MRR and P@1,\nrespectively.\n","subjects":["Computing Research Repository/Information Retrieval"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0d7Mj8G_LSuam4JHwbVaGV5u_bDkO9lyVyV-WEqGAfg","pdfSize":"692231"}