{"id":"2407.04660","title":"COBRA: Optimal Factorization of Cosmological Observables","authors":"Thomas Bakx, Nora Elisa Chisari and Zvonimir Vlah","authorsParsed":[["Bakx","Thomas",""],["Chisari","Nora Elisa",""],["Vlah","Zvonimir",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 17:17:38 GMT"}],"updateDate":"2024-07-08","timestamp":1720199858000,"abstract":"  We introduce COBRA (Cosmology with Optimally factorized Bases of Radial\nApproximants), a novel framework for rapid computation of large-scale structure\nobservables. COBRA separates scale dependence from cosmological parameters in\nthe linear matter power spectrum while also minimising the number of necessary\nbasis terms $N_b$, thus enabling direct and efficient computation of derived\nand nonlinear observables. Moreover, the dependence on cosmological parameters\nis efficiently approximated using radial basis function interpolation. We apply\nour framework to decompose the linear matter power spectrum in the standard\n$\\Lambda$CDM scenario, as well as by adding curvature, dynamical dark energy\nand massive neutrinos, covering all redshifts relevant for Stage IV surveys.\nWith only a dozen basis terms $N_b$, COBRA reproduces exact Boltzmann solver\ncalculations to $\\sim 0.1\\%$ precision, which improves further to $0.02\\%$ in\nthe pure $\\Lambda$CDM scenario. Using our decomposition, we recast the one-loop\nredshift space galaxy power spectrum in a separable minimal-basis form,\nenabling $\\sim 4000$ model evaluations per second at $0.02\\%$ precision on a\nsingle thread. This constitutes a considerable improvement over previously\nexisting methods (e.g., FFTLog) opening a window for efficient computations of\nhigher loop and higher order correlators involving multiple powers of the\nlinear matter power spectra. The resulting factorisation can also be utilised\nin clustering, weak lensing and CMB analyses. Our implementation will be made\npublic upon publication.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"03wcZHu0j73jsifDPGgldGIHtA6KCsmG4DyhIX0S-Wo","pdfSize":"1697405"}