{"id":"2407.21426","title":"Nonsingular universe through zero-point length cosmology","authors":"Ahmad Sheykhi, Leila Liravi, Kimet Jusufi","authorsParsed":[["Sheykhi","Ahmad",""],["Liravi","Leila",""],["Jusufi","Kimet",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 08:20:52 GMT"}],"updateDate":"2024-08-01","timestamp":1722414052000,"abstract":"  Taking into account the zero-point length correction to the gravitational\npotential and using the entropic force scenario, we derive a modified\nexpression for entropy that includes zero-point length correction terms. We\nthen apply the thermodynamics-gravity conjecture and the emergent gravity\nscenario to derive the modified Friedmann equations. These equations describe\nthe evolution of the universe with zero-point length corrections included in\nthe entropy expression. Further, we examine the time evolution of the total\nentropy, including the entropy of the apparent horizon and the matter field\nentropy inside the horizon and find that the generalized second law of\nthermodynamics is satisfied. Besides, we investigate cosmological implications\nof the modified cosmology through zero-point length. We study several cases,\nincluding radiation dominated era, matter dominated era and universe filled\nwith matter and cosmological constant. We observe that the zero-point length\ncorrection does not change the general profile of the universe evolution,\nhowever, it shifts the time of the phase transition in a universe filled with\nmatter and cosmological constant. We explore the age of the universe for our\nmodel and observe that the predicted age of the universe becomes larger\ncompared to the standard cosmology. By calculating the explicit form of Ricci\nand Kretchmann invariants, we confirm that in our model, the initial\nsingularity of the universe is removed. This is an expected result, because the\nmain motivation for considering zero-point length correction in the\ngravitational potential is to remove singularity at the origin.\n","subjects":["Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"C6RseG9V_gjPO4AJMIW2iuaF5VC7PwiLwpISTi4DfCw","pdfSize":"387825"}