{"id":"2407.20325","title":"Probing the Magnetised Gas Distribution in Galaxy Groups and the Cosmic\n  Web with POSSUM Faraday Rotation Measures","authors":"Craig S. Anderson, N. M. McClure-Griffiths, L. Rudnick, B. M.\n  Gaensler, S. P. O'Sullivan, S. Bradbury, T. Akahori, L. Baidoo, M. Bruggen,\n  E. Carretti, S. Duchesne, G. Heald, S. L. Jung, J. Kaczmarek, D. Leahy, F.\n  Loi, Y. K. Ma, E. Osinga, A. Seta, C. Stuardi, A. J. M. Thomson, C. Van Eck,\n  T. Vernstrom, J. West","authorsParsed":[["Anderson","Craig S.",""],["McClure-Griffiths","N. M.",""],["Rudnick","L.",""],["Gaensler","B. M.",""],["O'Sullivan","S. P.",""],["Bradbury","S.",""],["Akahori","T.",""],["Baidoo","L.",""],["Bruggen","M.",""],["Carretti","E.",""],["Duchesne","S.",""],["Heald","G.",""],["Jung","S. L.",""],["Kaczmarek","J.",""],["Leahy","D.",""],["Loi","F.",""],["Ma","Y. K.",""],["Osinga","E.",""],["Seta","A.",""],["Stuardi","C.",""],["Thomson","A. J. M.",""],["Van Eck","C.",""],["Vernstrom","T.",""],["West","J.",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 18:00:01 GMT"}],"updateDate":"2024-07-31","timestamp":1722276001000,"abstract":"  We present initial results from the Polarisation Sky Survey of the Universe's\nMagnetism (POSSUM), analysing 22,817 Faraday Rotation Measures (RMs) with\nmedian uncertainties of 1.2 rad m^-2 across 1,520 square degrees to study\nmagnetised gas associated with 55 nearby galaxy groups (z less than 0.025) with\nhalo masses between 10^12.5 and 10^14.0 M_sun. We identify two distinct gas\nphases: the Intragroup Medium (IGrM) within 0-2 splashback radii and the\nWarm-Hot Intergalactic Medium (WHIM) extending from 2 to 7 splashback radii.\nThese phases enhance the standard deviation of residual (i.e., Galactic\nforeground RM-subtracted) RMs by 6.9 +/- 1.8 rad m^-2 and 4.2 +/- 1.2 rad m^-2,\nrespectively. Estimated magnetic field strengths are several microGauss within\nthe IGrM and 0.1-1 microGauss in the WHIM. We estimate the plasma beta in both\nphases and show that magnetic pressure might be more dynamically important than\nin the ICM of more massive clusters or sparse cosmic web filaments. Our\nfindings indicate that \"missing baryons\" in the WHIM likely extend beyond the\ngravitational radii of group-mass halos to Mpc scales, consistent with\nlarge-scale, outflow-driven \"magnetised bubbles\" seen in cosmological\nsimulations. We demonstrate that RM grids are an effective method for detecting\nmagnetised thermal gas at galaxy group interfaces and within the cosmic web.\nThis approach complements X-ray and Sunyaev-Zel'dovich effect methods, and when\ncombined with Fast Radio Burst Dispersion Measures, data from the full POSSUM\nsurvey, comprising approximately a million RMs, will allow direct magnetic\nfield measurements to further our understanding of baryon circulation in these\nenvironments and the magnetised universe.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"MsMC5vSuD1ZSnxU6LxeyYyytefW5UYfm2XDeFJ5MAcM","pdfSize":"1832222"}