{"id":"2407.19300","title":"CoLiDR: Concept Learning using Aggregated Disentangled Representations","authors":"Sanchit Sinha, Guangzhi Xiong, Aidong Zhang","authorsParsed":[["Sinha","Sanchit",""],["Xiong","Guangzhi",""],["Zhang","Aidong",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 16:55:14 GMT"}],"updateDate":"2024-07-30","timestamp":1722099314000,"abstract":"  Interpretability of Deep Neural Networks using concept-based models offers a\npromising way to explain model behavior through human-understandable concepts.\nA parallel line of research focuses on disentangling the data distribution into\nits underlying generative factors, in turn explaining the data generation\nprocess. While both directions have received extensive attention, little work\nhas been done on explaining concepts in terms of generative factors to unify\nmathematically disentangled representations and human-understandable concepts\nas an explanation for downstream tasks. In this paper, we propose a novel\nmethod CoLiDR - which utilizes a disentangled representation learning setup for\nlearning mutually independent generative factors and subsequently learns to\naggregate the said representations into human-understandable concepts using a\nnovel aggregation/decomposition module. Experiments are conducted on datasets\nwith both known and unknown latent generative factors. Our method successfully\naggregates disentangled generative factors into concepts while maintaining\nparity with state-of-the-art concept-based approaches. Quantitative and visual\nanalysis of the learned aggregation procedure demonstrates the advantages of\nour work compared to commonly used concept-based models over four challenging\ndatasets. Lastly, our work is generalizable to an arbitrary number of concepts\nand generative factors - making it flexible enough to be suitable for various\ntypes of data.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"o8hH7E6BexJfmnpE_Aj676R39gJz1sfTRyyFRAZ2IHo","pdfSize":"1448121"}