{"id":"2407.01866","title":"Image-GS: Content-Adaptive Image Representation via 2D Gaussians","authors":"Yunxiang Zhang, Alexandr Kuznetsov, Akshay Jindal, Kenneth Chen, Anton\n  Sochenov, Anton Kaplanyan, Qi Sun","authorsParsed":[["Zhang","Yunxiang",""],["Kuznetsov","Alexandr",""],["Jindal","Akshay",""],["Chen","Kenneth",""],["Sochenov","Anton",""],["Kaplanyan","Anton",""],["Sun","Qi",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 00:45:21 GMT"}],"updateDate":"2024-07-03","timestamp":1719881121000,"abstract":"  Neural image representations have recently emerged as a promising technique\nfor storing, streaming, and rendering visual data. Coupled with learning-based\nworkflows, these novel representations have demonstrated remarkable visual\nfidelity and memory efficiency. However, existing neural image representations\noften rely on explicit uniform data structures without content adaptivity or\ncomputation-intensive implicit models, limiting their adoption in real-time\ngraphics applications.\n  Inspired by recent advances in radiance field rendering, we propose Image-GS,\na content-adaptive image representation. Using anisotropic 2D Gaussians as the\nbasis, Image-GS shows high memory efficiency, supports fast random access, and\noffers a natural level of detail stack. Leveraging a tailored differentiable\nrenderer, Image-GS fits a target image by adaptively allocating and\nprogressively optimizing a set of 2D Gaussians. The generalizable efficiency\nand fidelity of Image-GS are validated against several recent neural image\nrepresentations and industry-standard texture compressors on a diverse set of\nimages. Notably, its memory and computation requirements solely depend on and\nlinearly scale with the number of 2D Gaussians, providing flexible controls\nover the trade-off between visual fidelity and run-time efficiency. We hope\nthis research offers insights for developing new applications that require\nadaptive quality and resource control, such as machine perception, asset\nstreaming, and content generation.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Graphics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"X77F-zyye7rFI0VMD780I3gNgB5FKaJzKzQde8Adb1U","pdfSize":"36750620"}