{"id":"2407.07076","title":"MADE-for-ASD: A Multi-Atlas Deep Ensemble Network for Diagnosing Autism\n  Spectrum Disorder","authors":"Xuehan Liu, Md Rakibul Hasan, Tom Gedeon, Md Zakir Hossain","authorsParsed":[["Liu","Xuehan",""],["Hasan","Md Rakibul",""],["Gedeon","Tom",""],["Hossain","Md Zakir",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 17:49:23 GMT"},{"version":"v2","created":"Wed, 4 Sep 2024 01:59:59 GMT"}],"updateDate":"2024-09-05","timestamp":1720547363000,"abstract":"  In response to the global need for efficient early diagnosis of Autism\nSpectrum Disorder (ASD), this paper bridges the gap between traditional,\ntime-consuming diagnostic methods and potential automated solutions. We propose\na multi-atlas deep ensemble network, MADE-for-ASD, that integrates multiple\natlases of the brain's functional magnetic resonance imaging (fMRI) data\nthrough a weighted deep ensemble network. Our approach integrates demographic\ninformation into the prediction workflow, which enhances ASD diagnosis\nperformance and offers a more holistic perspective on patient profiling. We\nexperiment with the well-known publicly available ABIDE (Autism Brain Imaging\nData Exchange) I dataset, consisting of resting state fMRI data from 17\ndifferent laboratories around the globe. Our proposed system achieves 75.20%\naccuracy on the entire dataset and 96.40% on a specific subset $-$ both\nsurpassing reported ASD diagnosis accuracy in ABIDE I fMRI studies.\nSpecifically, our model improves by 4.4 percentage points over prior works on\nthe same amount of data. The model exhibits a sensitivity of 82.90% and a\nspecificity of 69.70% on the entire dataset, and 91.00% and 99.50%,\nrespectively, on the specific subset. We leverage the F-score to pinpoint the\ntop 10 ROI in ASD diagnosis, such as precuneus and anterior\ncingulate/ventromedial. The proposed system can potentially pave the way for\nmore cost-effective, efficient and scalable strategies in ASD diagnosis. Codes\nand evaluations are publicly available at\nhttps://github.com/hasan-rakibul/MADE-for-ASD.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"yeDHXZ0s-is-852j-OsjNHvF24caItE1XmLZoyiaAwQ","pdfSize":"2262732"}