{"id":"2407.20886","title":"A Stochastic Precipitating Quasi-Geostrophic Model","authors":"Nan Chen, Changhong Mou, Leslie M. Smith, Yeyu Zhang","authorsParsed":[["Chen","Nan",""],["Mou","Changhong",""],["Smith","Leslie M.",""],["Zhang","Yeyu",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 15:01:25 GMT"}],"updateDate":"2024-07-31","timestamp":1722351685000,"abstract":"  Efficient and effective modeling of complex systems, incorporating cloud\nphysics and precipitation, is essential for accurate climate modeling and\nforecasting. However, simulating these systems is computationally demanding\nsince microphysics has crucial contributions to the dynamics of moisture and\nprecipitation. In this paper, appropriate stochastic models are developed for\nthe phase-transition dynamics of water, focusing on the precipitating\nquasi-geostrophic (PQG) model as a prototype. By treating the moisture, phase\ntransitions, and latent heat release as integral components of the system, the\nPQG model constitutes a set of partial differential equations (PDEs) that\ninvolve Heaviside nonlinearities due to phase changes of water. Despite\nsystematically characterizing the precipitation physics, expensive iterative\nalgorithms are needed to find a PDE inversion at each numerical integration\ntime step. As a crucial step toward building an effective stochastic model, a\ncomputationally efficient Markov jump process is designed to randomly simulate\ntransitions between saturated and unsaturated states that avoids using the\nexpensive iterative solver. The transition rates, which are deterministic, are\nderived from the physical fields, guaranteeing physical and statistical\nconsistency with nature. Furthermore, to maintain the consistent spatial\npattern of precipitation, the stochastic model incorporates an adaptive\nparameterization that automatically adjusts the transitions based on spatial\ninformation. Numerical tests show the stochastic model retains critical\nproperties of the original PQG system while significantly reducing\ncomputational demands. It accurately captures observed precipitation patterns,\nincluding the spatial distribution and temporal variability of rainfall,\nalongside reproducing essential dynamic features such as potential vorticity\nfields and zonal mean flows.\n","subjects":["Physics/Fluid Dynamics","Computing Research Repository/Numerical Analysis","Mathematics/Numerical Analysis","Physics/Geophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Go54V4BO_IJTiAxmoA5mxnGo7TKEodqHR9Z_mjMBWB4","pdfSize":"20332889"}