{"id":"2407.07800","title":"Jump Plus AM-FM Mode Decomposition","authors":"Mojtaba Nazari, Anders Rosendal Korsh{\\o}j, Naveed ur Rehman","authorsParsed":[["Nazari","Mojtaba",""],["Korshøj","Anders Rosendal",""],["Rehman","Naveed ur",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 16:17:27 GMT"}],"updateDate":"2024-07-11","timestamp":1720628247000,"abstract":"  A novel method for decomposing a nonstationary signal into amplitude- and\nfrequency-modulated (AM-FM) oscillations and discontinuous (jump) components is\nproposed. Current nonstationary signal decomposition methods are designed to\neither obtain constituent AM-FM oscillatory modes or the discontinuous and\nresidual components from the data, separately. Yet, many real-world signals of\ninterest simultaneously exhibit both behaviors i.e., jumps and oscillations.\nCurrently, no available method can extract jumps and AM-FM oscillatory\ncomponents directly from the data. In our novel approach, we design and solve a\nvariational optimization problem to accomplish this task. The optimization\nformulation includes a regularization term to minimize the bandwidth of all\nsignal modes for effective oscillation modeling, and a prior for extracting the\njump component. Our method addresses the limitations of conventional AM-FM\nsignal decomposition methods in extracting jumps, as well as the limitations of\nexisting jump extraction methods in decomposing multiscale oscillations. By\nemploying an optimization framework that accounts for both multiscale\noscillatory components and discontinuities, our methods show superior\nperformance compared to existing decomposition techniques. We demonstrate the\neffectiveness of our approaches on synthetic, real-world, single-channel, and\nmultivariate data, highlighting their utility in three specific applications:\nEarth's electric field signals, electrocardiograms (ECG), and\nelectroencephalograms (EEG).\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"NbuRelGX_oWzFTFPQCf_xnRLtz-V9vZUr7DF_9cvvcs","pdfSize":"1669538"}