{"id":"2407.09658","title":"BoBa: Boosting Backdoor Detection through Data Distribution Inference in\n  Federated Learning","authors":"Ning Wang, Shanghao Shi, Yang Xiao, Yimin Chen, Y. Thomas Hou, Wenjing\n  Lou","authorsParsed":[["Wang","Ning",""],["Shi","Shanghao",""],["Xiao","Yang",""],["Chen","Yimin",""],["Hou","Y. Thomas",""],["Lou","Wenjing",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 19:38:42 GMT"}],"updateDate":"2024-07-16","timestamp":1720813122000,"abstract":"  Federated learning, while being a promising approach for collaborative model\ntraining, is susceptible to poisoning attacks due to its decentralized nature.\nBackdoor attacks, in particular, have shown remarkable stealthiness, as they\nselectively compromise predictions for inputs containing triggers. Previous\nendeavors to detect and mitigate such attacks are based on the Independent and\nIdentically Distributed (IID) data assumption where benign model updates\nexhibit high-level similarity in multiple feature spaces due to IID data. Thus,\noutliers are detected as backdoor attacks. Nevertheless, non-IID data presents\nsubstantial challenges in backdoor attack detection, as the data variety\nintroduces variance among benign models, making outlier detection-based\nmechanisms less effective.\n  We propose a novel distribution-aware anomaly detection mechanism, BoBa, to\naddress this problem. In order to differentiate outliers arising from data\nvariety versus backdoor attack, we propose to break down the problem into two\nsteps: clustering clients utilizing their data distribution followed by a\nvoting-based detection. Based on the intuition that clustering and subsequent\nbackdoor detection can drastically benefit from knowing client data\ndistributions, we propose a novel data distribution inference mechanism. To\nimprove detection robustness, we introduce an overlapping clustering method,\nwhere each client is associated with multiple clusters, ensuring that the\ntrustworthiness of a model update is assessed collectively by multiple clusters\nrather than a single cluster. Through extensive evaluations, we demonstrate\nthat BoBa can reduce the attack success rate to lower than 0.001 while\nmaintaining high main task accuracy across various attack strategies and\nexperimental settings.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"wY-e1OhY-4vmmyujUxZXlVJ8PRsF0HCXZgjRYHcqUoc","pdfSize":"2768646"}