{"id":"2407.08326","title":"Topological AdS black holes surrounded by Chaplygin dark fluid: from\n  stability to geometrothermodynamic analysis","authors":"Y. Sekhmani, G. G. Luciano, J. Rayimbaev, M. K. Jasim, A. Al-Badawi\n  and S.K. Maurya","authorsParsed":[["Sekhmani","Y.",""],["Luciano","G. G.",""],["Rayimbaev","J.",""],["Jasim","M. K.",""],["Al-Badawi","A.",""],["Maurya","S. K.",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 09:24:48 GMT"}],"updateDate":"2024-07-12","timestamp":1720689888000,"abstract":"  Implementing the concept of Dark Fluid with a Chaplygin-like equation of\nstate within General Relativity, we construct a new higher-dimensional, static,\nand spherically symmetric anti-de Sitter (AdS) black hole solution. Energy\nconditions are explored alongside curvature singularity tools. The inspection\nat the level of the phase structure and $P-v$ critical behavior is carried out\nin the context of the extended phase space, where the cosmological constant\nappears as pressure. Our findings disclose non-trivial similarities between the\nsmall/large phase transition of AdS black holes surrounded by Chaplygin dark\nfluid and van der Waals systems' liquid/gas phase transition. This analysis\noffers insights into the physical interpretation of the $P-v$ diagram and\nidentifies critical exponents that reveal the scaling behavior of thermodynamic\nquantities close to criticality in a universal manner. We finally deepen our\nunderstanding of the thermodynamic properties and microstructure of AdS black\nholes by leveraging the geometrothermodynamic formalism. Specifically, we\nemploy tools, including Weinhold, Ruppeiner, Hendi-Panahiyan-Eslam-Momennia\n(HPEM) and Quevedo classes I and II. We show that each class of metrics\npredicts either the physical limitation point and/or the phase-transition\ncritical points, with HPEM and Quevedo formulations providing richer\ninformation about the phase transitions. Altogether, this study contributes to\nadvancing our knowledge of the role of Chaplygin gas in General Relativity and\nthoroughly examining the thermodynamic phase structure of high-dimensional AdS\nblack holes under extreme conditions.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"-wvderMklCtxnCLgOZl9kOSvikdHfPLWkU9S0fXRPTg","pdfSize":"1465629","objectId":"0xfb1a24c3d8ab9e0574b83d8c68f90dcd84744d2f3209ced761f09ad773e108ce","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
