{"id":"2407.04818","title":"Thermalization in Trapped Bosonic Systems With Disorder","authors":"Javier de la Cruz, Carlos Diaz-Mejia, Sergio Lerma-Hernandez, and\n  Jorge G. Hirsch","authorsParsed":[["de la Cruz","Javier",""],["Diaz-Mejia","Carlos",""],["Lerma-Hernandez","Sergio",""],["Hirsch","Jorge G.",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 19:00:02 GMT"}],"updateDate":"2024-07-09","timestamp":1720206002000,"abstract":"  A detailed study of thermalization is conducted on experimentally accessible\nstates in a system of bosonic atoms trapped in an open linear chain with\ndisorder. When the disorder parameter is large, the system exhibits regularity\nand localization. In contrast, weak disorder introduces chaos and raises\nquestions about the validity of the Eigenstate Thermalization Hypothesis (ETH),\nespecially for states at the extremes of the energy spectrum which remain\nregular and non-thermalizing. The validity of ETH is assessed by examining the\ndispersion of entanglement entropy and the number of bosons on the first site\nacross various dimensions, while maintaining a constant particle density of\none. Experimentally accessible states in the occupation basis are categorized\nusing a crowding parameter that linearly correlates with their mean energy.\nUsing full exact diagonalization to simulate temporal evolution, we study the\nequilibration of entanglement entropy, the number of bosons, and the reduced\ndensity matrix of the first site for all states in the occupation basis.\nComparing equilibrium values of these observables with those predicted by\nmicrocanonical ensembles, we find that, within certain tolerances, most states\nin the chaotic region thermalize. However, states with low participation ratios\nin the energy eigenstate basis show greater deviations from thermal equilibrium\nvalues.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Other Condensed Matter"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"F_ewzKAKQXqeAIBnX9O3kJYqCQ69eSCnF9cVrUPDV8Y","pdfSize":"10644829"}