{"id":"2407.18763","title":"Fundamental Tests of White Dwarf Cooling Physics with Wide Binaries","authors":"Manuel Barrientos, Mukremin Kilic, Pierre Bergeron, Simon Blouin,\n  Warren R. Brown and Jeff J. Andrews","authorsParsed":[["Barrientos","Manuel",""],["Kilic","Mukremin",""],["Bergeron","Pierre",""],["Blouin","Simon",""],["Brown","Warren R.",""],["Andrews","Jeff J.",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 14:22:18 GMT"}],"updateDate":"2024-07-29","timestamp":1722003738000,"abstract":"  We present follow-up spectroscopy and a detailed model atmosphere analysis of\n29 wide double white dwarfs, including eight systems with a crystallized C/O\ncore member. We use state-of-the-art evolutionary models to constrain the\nphysical parameters of each star, including the total age. Assuming that the\nmembers of wide binaries are coeval, any age difference between the binary\nmembers can be used to test the cooling physics for white dwarf stars,\nincluding potential delays due to crystallization and $^{22}$Ne distillation.\nWe use our control sample of 14 wide binaries with non-crystallized members to\nshow that this method works well; the control sample shows an age difference of\nonly $\\Delta$Age = $-0.03 \\pm$ 0.15 Gyr between its members. For the eight\ncrystallized C/O core systems we find a cooling anomaly of $\\Delta$Age=\n1.13$^{+1.20}_{-1.07}$ Gyr. Even though our results are consistent with a small\nadditional cooling delay ($\\sim1$ Gyr) from $^{22}$Ne distillation and other\nneutron-rich impurities, the large uncertainties make this result not\nstatistically significant. Nevertheless, we rule out cooling delays longer than\n3.6 Gyr at the 99.7% ($3\\sigma$) confidence level for 0.6-0.9 $M_{\\odot}$ white\ndwarfs. Further progress requires larger samples of wide binaries with\ncrystallized massive white dwarf members. We provide a list of subgiant + white\ndwarf binaries that could be used for this purpose in the future.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"kbKbTX8PJ2zltYlHDb1wmHq9VeZe_4D4xNefWs7ZFKw","pdfSize":"978977"}