{"id":"2407.08943","title":"A Deployable Quantum Access Points Selection Algorithm for Large-Scale\n  Localization","authors":"Ahmed Shokry and Moustafa Youssef","authorsParsed":[["Shokry","Ahmed",""],["Youssef","Moustafa",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 02:59:37 GMT"}],"updateDate":"2024-07-15","timestamp":1720753177000,"abstract":"  Effective access points (APs) selection is a crucial step in localization\nsystems. It directly affects both localization accuracy and computational\nefficiency. Classical APs selection algorithms are usually computationally\nexpensive, hindering the deployment of localization systems in a large\nworldwide scale.\n  In this paper, we introduce a quantum APs selection algorithm for large-scale\nlocalization systems. The proposed algorithm leverages quantum annealing to\neliminate redundant and noisy APs. We explain how to formulate the APs\nselection problem as a quadratic unconstrained binary optimization (QUBO)\nproblem, suitable for quantum annealing, and how to select the minimum number\nof APs that maintain the same overall localization system accuracy as the\ncomplete APs set. Based on this, we further propose a logarithmic-complexity\nalgorithm to select the optimal number of APs.\n  We implement our quantum algorithm on a real D-Wave Systems quantum machine\nand assess its performance in a real test environment for a floor localization\nproblem. Our findings reveal that by selecting fewer than 14% of the available\nAPs in the environment, our quantum algorithm achieves the same floor\nlocalization accuracy as utilizing the entire set of APs and a superior\naccuracy over utilizing the reduced dataset by classical APs selection\ncounterparts. Moreover, the proposed quantum algorithm achieves more than an\norder of magnitude speedup over the corresponding classical APs selection\nalgorithms, emphasizing the efficiency of the proposed quantum algorithm for\nlarge-scale localization systems.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"GGEQKrShys_fvVqpnfSzum3d-O4tXAmyVGXTdQK-DD4","pdfSize":"746231"}