{"id":"2407.07177","title":"Protein Design by Integrating Machine Learning with Quantum Annealing\n  and Quantum-inspired Optimization","authors":"Veronica Panizza, Philipp Hauke, Cristian Micheletti, Pietro Faccioli","authorsParsed":[["Panizza","Veronica",""],["Hauke","Philipp",""],["Micheletti","Cristian",""],["Faccioli","Pietro",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 18:42:45 GMT"}],"updateDate":"2024-07-11","timestamp":1720550565000,"abstract":"  The protein design problem involves finding polypeptide sequences folding\ninto a given threedimensional structure. Its rigorous algorithmic solution is\ncomputationally demanding, involving a nested search in sequence and structure\nspaces. Structure searches can now be bypassed thanks to recent machine\nlearning breakthroughs, which have enabled accurate and rapid structure\npredictions. Similarly, sequence searches might be entirely transformed by the\nadvent of quantum annealing machines and by the required new encodings of the\nsearch problem, which could be performative even on classical machines. In this\nwork, we introduce a general protein design scheme where algorithmic and\ntechnological advancements in machine learning and quantum-inspired algorithms\ncan be integrated, and an optimal physics-based scoring function is iteratively\nlearned. In this first proof-of-concept application, we apply the iterative\nmethod to a lattice protein model amenable to exhaustive benchmarks, finding\nthat it can rapidly learn a physics-based scoring function and achieve\npromising design performances. Strikingly, our quantum-inspired reformulation\noutperforms conventional sequence optimization even when adopted on classical\nmachines. The scheme is general and can be easily extended, e.g., to encompass\noff-lattice models, and it can integrate progress on various computational\nplatforms, thus representing a new paradigm approach for protein design.\n","subjects":["Physics/Quantum Physics","Physics/Biological Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"5C68wILB6HqoNh6vESlocsraBdpotG1mMSXzDMbsh_w","pdfSize":"2313042"}