{"id":"2407.14427","title":"Reasoning About Internet Connectivity","authors":"Guillermo Baltra, Tarang Saluja, Yuri Pradkin, John Heidemann","authorsParsed":[["Baltra","Guillermo",""],["Saluja","Tarang",""],["Pradkin","Yuri",""],["Heidemann","John",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 15:54:03 GMT"}],"updateDate":"2024-07-22","timestamp":1721404443000,"abstract":"  Innovation in the Internet requires a global Internet core to enable\ncommunication between users in ISPs and services in the cloud. Today, this\nInternet core is challenged by partial reachability: political pressure\nthreatens fragmentation by nationality, architectural changes such as\ncarrier-grade NAT make connectivity conditional, and operational problems and\ncommercial disputes make reachability incomplete for months. We assert that\npartial reachability is a fundamental part of the Internet core. While other\nstudies address partial reachability, this paper is the first to provide a\nconceptual definition of the Internet core so we can reason about reachability\nfrom principles first. Following the Internet design, our definition is guided\nby reachability, not authority. Its corollaries are peninsulas: persistent\nregions of partial connectivity; and islands: when networks are partitioned\nfrom the Internet core. We show that the concept of peninsulas and islands can\nimprove existing measurement systems. In one example, they show that RIPE's\nDNSmon suffers misconfiguration and persistent network problems that are\nimportant, but risk obscuring operationally important connectivity changes\nbecause they are $5\\times$ to $9.7\\times$ larger. Our evaluation also informs\npolicy questions, showing no single country or organization can unilaterally\ncontrol the Internet core.\n","subjects":["Computing Research Repository/Networking and Internet Architecture"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"KXq-Xug4klam9FgtW9r0OsW_I6I69__CpjBWDePqAYk","pdfSize":"748538"}