{"id":"2407.20829","title":"Exocomet orbital distribution around $\\beta$ Pictoris","authors":"Ren\\'e Heller (Max Planck Institute for Solar System Research,\n  G\\\"ottingen, Germany)","authorsParsed":[["Heller","René","","Max Planck Institute for Solar System Research,\n  Göttingen, Germany"]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 13:55:40 GMT"}],"updateDate":"2024-09-11","timestamp":1722347740000,"abstract":"  The 23 Myr young star $\\beta$ Pictoris is a laboratory for planet formation\nstudies given its observed debris disk, its two directly imaged super-Jovian\nplanets, and the evidence of transiting extrasolar comets. The most recent\nevidence of exocometary transits around $\\beta$ Pic came from the TESS space\nmission. Previous analyses of these transits constrained the orbital\ndistribution of the underlying exocomet population to range between about 0.03\nand 1.3 AU assuming a fixed transit impact parameter. Here we examine the\ndistribution of the observed transit durations (${\\Delta}t$) to infer the\norbital surface density distribution ($\\delta$) of the underlying exocomet\nsample. We show that a narrow belt of exocomets around $\\beta$ Pic, in which\nthe transit impact parameters are randomized but the orbital semimajor axes are\nequal, results in a pile-up of long transit durations. This is contrary to\nobservations, which reveal a pile-up of short transit durations (${\\Delta}t\n\\approx 0.1$ d) and a tail of only a few transits with ${\\Delta}t > 0.4$ d. A\nflat density distribution of exocomets between about 0.03 and 2.5 AU results in\na better match between the resulting ${\\Delta}t$ distribution and the\nobservations but the slope of the predicted ${\\Delta}t$ histogram is not\nsufficiently steep. An even better match to the observations can be produced\nwith a $\\delta \\propto a^{\\beta}$ power law. Our modeling reveals a best fit\nbetween the observed and predicted ${\\Delta}t$ distribution for $\\beta =\n-0.15_{-0.10}^{+0.05}$. A more reasonable scenario in which the exocometary\ntrajectories are modeled as hyperbolic orbits can also reproduce the observed\n${\\Delta}t$ distribution to some extent. Our results imply that cometary\nmaterial exists on highly eccentric orbits with a more extended range of\nsemimajor axes than suggested by previous spectroscopic observations.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"BNF6NpLD_WY4CGRPT7GJ7yzMrk46--98e8Ql6RZZqFA","pdfSize":"761697"}