{"id":"2407.06532","title":"Efficient estimation of partially linear additive Cox models and\n  variance estimation under shape restrictions","authors":"Junjun Lang and Yukun Liu and Jing Qin","authorsParsed":[["Lang","Junjun",""],["Liu","Yukun",""],["Qin","Jing",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 04:06:15 GMT"}],"updateDate":"2024-07-10","timestamp":1720497975000,"abstract":"  Shape-restricted inferences have exhibited empirical success in various\napplications with survival data. However, certain works fall short in providing\na rigorous theoretical justification and an easy-to-use variance estimator with\ntheoretical guarantee. Motivated by Deng et al. (2023), this paper delves into\nan additive and shape-restricted partially linear Cox model for right-censored\ndata, where each additive component satisfies a specific shape restriction,\nencompassing monotonic increasing/decreasing and convexity/concavity. We\nsystematically investigate the consistencies and convergence rates of the\nshape-restricted maximum partial likelihood estimator (SMPLE) of all the\nunderlying parameters. We further establish the aymptotic normality and\nsemiparametric effiency of the SMPLE for the linear covariate shift. To\nestimate the asymptotic variance, we propose an innovative data-splitting\nvariance estimation method that boasts exceptional versatility and broad\napplicability. Our simulation results and an analysis of the Rotterdam Breast\nCancer dataset demonstrate that the SMPLE has comparable performance with the\nmaximum likelihood estimator under the Cox model when the Cox model is correct,\nand outperforms the latter and Huang (1999)'s method when the Cox model is\nviolated or the hazard is nonsmooth. Meanwhile, the proposed variance\nestimation method usually leads to reliable interval estimates based on the\nSMPLE and its competitors.\n","subjects":["Mathematics/Statistics Theory","Statistics/Statistics Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"lOdtVdOpAWIi8PUYMi3hf14bGStcIZ13yg1azn-2q94","pdfSize":"549206"}