{"id":"2407.14281","title":"QuOp: A Quantum Operator Representation for Nodes","authors":"Andrew Vlasic and Salvador Aguinaga","authorsParsed":[["Vlasic","Andrew",""],["Aguinaga","Salvador",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 13:10:04 GMT"}],"updateDate":"2024-07-22","timestamp":1721394604000,"abstract":"  We derive an intuitive and novel method to represent nodes in a graph with\nspecial unitary operators, or quantum operators, which does not require\nparameter training and is competitive with classical methods on scoring\nsimilarity between nodes. This method opens up future possibilities to apply\nquantum algorithms for NLP or other applications that need to detect anomalies\nwithin a network structure. Specifically, this technique leverages the\nadvantage of quantum computation, representing nodes in higher dimensional\nHilbert spaces. To create the representations, the local topology around each\nnode with a predetermined number of hops is calculated and the respective\nadjacency matrix is used to derive the Hamiltonian. While using the local\ntopology of a node to derive a Hamiltonian is a natural extension of a graph\ninto a quantum circuit, our method differs by not assuming the quantum\noperators in the representation a priori, but letting the adjacency matrix\ndictate the representation. As a consequence of this simplicity, the set of\nadjacency matrices of size $2^n \\times 2^n$ generates a sub-vector space of the\nLie algebra of the special unitary operators, $\\mathfrak{su}(2^n)$. This\nsub-vector space in turn generates a subgroup of the Lie group of special\nunitary operators, $\\mathrm{SU}(2^n)$. Applications of our quantum embedding\nmethod, in comparison with the classical algorithms GloVe (a natural language\nprocessing embedding method) and FastRP (a general graph embedding method,\ndisplay superior performance in measuring similarity between nodes in graph\nstructures.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_CphoN3mY8kGFdCrl9LyKNzoIuV-RVF92WwICQ0lrlM","pdfSize":"6584583","objectId":"0x0da476cf5a90dc38cac89b2e3f75fcb782ac3609923f1de983e9b9c9e9424534","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
