{"id":"2407.09832","title":"Molecular clouds: do they deserve a non-Gaussian description?","authors":"Pablo Richard, Erwan Allys, Fran\\c{c}ois Levrier, Antoine Gusdorf,\n  Constant Auclair","authorsParsed":[["Richard","Pablo",""],["Allys","Erwan",""],["Levrier","François",""],["Gusdorf","Antoine",""],["Auclair","Constant",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 10:01:00 GMT"}],"updateDate":"2024-07-16","timestamp":1720864860000,"abstract":"  Molecular clouds show complex structures reflecting their non-linear\ndynamics. Many studies, investigating the bridge between their morphology and\nphysical properties, have shown the interest provided by non-Gaussian\nhigher-order statistics to grasp physical information. Yet, as this bridge is\nusually characterized in the supervised world of simulations, transferring it\nonto observations can be hazardous, especially when the discrepancy between\nsimulations and observations remains unknown. In this paper, we aim at\nidentifying relevant summary statistics directly from the observation data. To\ndo so, we develop a test that compares the informative power of two sets of\nsummary statistics for a given dataset. Contrary to supervised approaches, this\ntest does not require the knowledge of any data label or parameter, but focuses\ninstead on comparing the degeneracy levels of these descriptors, relying on a\nnotion of statistical compatibility. We apply this test to column density maps\nof 14 nearby molecular clouds observed by Herschel, and iteratively compare\ndifferent sets of usual summary statistics. We show that a standard Gaussian\ndescription of these clouds is highly degenerate but can be substantially\nimproved when being estimated on the logarithm of the maps. This illustrates\nthat low-order statistics, properly used, remain a very powerful tool. We then\nfurther show that such descriptions still exhibit a small quantity of\ndegeneracies, some of which are lifted by the higher order statistics provided\nby reduced wavelet scattering transforms. This property of observations\nquantitatively differs from state-of-the-art simulations of dense molecular\ncloud collapse and is not reproduced by logfBm models. Finally we show how the\nsummary statistics identified can be cooperatively used to build a\nmorphological distance, which is evaluated visually, and gives very\nsatisfactory results.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Instrumentation and Methods for Astrophysics","Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"wcthtdgwQikUZOgC6NegBwhdCX4EnmliPFmTGFr026E","pdfSize":"10904773","objectId":"0x09e2d6a0543001cd7696f0282ad8737b765a3ba70ae576d33d89b0d8616b565f","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
