{"id":"2407.00420","title":"Cement Dust Exposure and Risk of Hyperglycemia and Overweight among\n  Artisans and Residents Close to a Cement Factory in Sokoto, Nigeria","authors":"T Yahaya, KA Sani, E Oladele, E Yawa, M Musa, M Abubakar, R Sulaiman,\n  M Bilyaminu","authorsParsed":[["Yahaya","T",""],["Sani","KA",""],["Oladele","E",""],["Yawa","E",""],["Musa","M",""],["Abubakar","M",""],["Sulaiman","R",""],["Bilyaminu","M",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 12:00:17 GMT"}],"updateDate":"2024-07-02","timestamp":1719662417000,"abstract":"  The potential health risks of cement dust exposure are increasingly raising\nconcern worldwide as the cement industry expands in response to rising cement\ndemand. This necessitates the need to determine the nature of the risks in\norder to develop appropriate measures. This study determined the effects of\ncement dust exposure on the weight and blood glucose levels of people residing\nor working around a cement company in Sokoto, Nigeria. Demographic information\nwas obtained using questionnaires from 72 participants, which included age,\ngender, educational level, exposure hours, occupation, and lifestyle. The blood\nglucose levels and body mass index (BMI) were measured using a Fine Test\nglucometer and a mechanical scale, respectively. The results showed that most\nof the people living or working around the cement company were middle-aged men\n(31-40; 42.06%) with a primary (33.33%) or secondary (45.83%) school education.\nIt showed that 30 (41.69%) of the participants were overweight while 5 (6.94%)\nwere obese. Additionally, 52.78% of the participants were diabetic while 31.94%\nwere prediabetic. Participants that were exposed for long hours (> 15 hours per\nday) were the most diabetic (20% of the participants), followed by smokers\n(15%), and artisans (7%). It can be concluded that exposure to cement dust from\nthe company increased the risk of overweight, obesity, and hyperglycemia among\nthe participants. These health risks were worsened by daily long hours of\nexposure, smoking, and artisanal pollutant exposure. Human settlements and\nartisans should not be located near the cement company, and the company should\nminimize pollutant emissions.\n","subjects":["Quantitative Biology/Other Quantitative Biology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"UlYKM2Imid_AuWI1nmwH-LvK3YOyxvYd6UrLkCIj1L4","pdfSize":"618756","objectId":"0x4e5abca47882a4aa3ca74b50532df0a72862d43a595b701a4be53c0acf260977","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
