{"id":"2407.20452","title":"Quantum HodgeRank: Topology-Based Rank Aggregation on Quantum Computers","authors":"Caesnan M. G. Leditto, Angus Southwell, Behnam Tonekaboni, Muhammad\n  Usman, and Kavan Modi","authorsParsed":[["Leditto","Caesnan M. G.",""],["Southwell","Angus",""],["Tonekaboni","Behnam",""],["Usman","Muhammad",""],["Modi","Kavan",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 23:16:23 GMT"}],"updateDate":"2024-07-31","timestamp":1722294983000,"abstract":"  Rank aggregation techniques play a crucial role in identifying the best\nalternatives, but the inherent imbalance and incompleteness of real-world data\npose significant challenges. The HodgeRank algorithm, which utilizes discrete\nexterior calculus on a graph, can overcome these issues and output a consistent\nglobal ranking of alternatives. Recently, higher-order networks have been\nemployed to analyze complex multipartite interactions in network data.\nExtending HodgeRank to ranking on higher-order networks, however, requires\ncomputational costs that are exponential in the network dimension. To address\nthis challenge, we develop a quantum algorithm that outputs a quantum state\nproportional to the HodgeRank solution. By incorporating quantum singular value\ntransformation and tools from quantum topological data analysis, our approach\nachieves time complexity independent of the network dimension, avoiding the\nneed for quantum random access memory or sparse access input models. We also\npresent efficient algorithms and heuristics to extract meaningful information\nfrom the output quantum state, including an algorithm to compute the\nconsistency of the ranking. Using our algorithm, the consistency measure\nestimation has the potential to achieve superpolynomial quantum speedups for\nhigher-order network data with specific structures. Beyond ranking tasks, our\nmethods suggest that quantum computing could find fruitful applications in\nstudying higher-order networks and discrete exterior calculus.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"mL57zHcMv7oXX8meLl-qcs8urjxJADnrzWwNWVlU6OQ","pdfSize":"899024"}