{"id":"2407.03103","title":"Cactus: Towards Psychological Counseling Conversations using Cognitive\n  Behavioral Theory","authors":"Suyeon Lee, Sunghwan Kim, Minju Kim, Dongjin Kang, Dongil Yang, Harim\n  Kim, Minseok Kang, Dayi Jung, Min Hee Kim, Seungbeen Lee, Kyoung-Mee Chung,\n  Youngjae Yu, Dongha Lee, Jinyoung Yeo","authorsParsed":[["Lee","Suyeon",""],["Kim","Sunghwan",""],["Kim","Minju",""],["Kang","Dongjin",""],["Yang","Dongil",""],["Kim","Harim",""],["Kang","Minseok",""],["Jung","Dayi",""],["Kim","Min Hee",""],["Lee","Seungbeen",""],["Chung","Kyoung-Mee",""],["Yu","Youngjae",""],["Lee","Dongha",""],["Yeo","Jinyoung",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 13:41:31 GMT"}],"updateDate":"2024-07-04","timestamp":1720014091000,"abstract":"  Recently, the demand for psychological counseling has significantly increased\nas more individuals express concerns about their mental health. This surge has\naccelerated efforts to improve the accessibility of counseling by using large\nlanguage models (LLMs) as counselors. To ensure client privacy, training\nopen-source LLMs faces a key challenge: the absence of realistic counseling\ndatasets. To address this, we introduce Cactus, a multi-turn dialogue dataset\nthat emulates real-life interactions using the goal-oriented and structured\napproach of Cognitive Behavioral Therapy (CBT). We create a diverse and\nrealistic dataset by designing clients with varied, specific personas, and\nhaving counselors systematically apply CBT techniques in their interactions. To\nassess the quality of our data, we benchmark against established psychological\ncriteria used to evaluate real counseling sessions, ensuring alignment with\nexpert evaluations. Experimental results demonstrate that Camel, a model\ntrained with Cactus, outperforms other models in counseling skills,\nhighlighting its effectiveness and potential as a counseling agent. We make our\ndata, model, and code publicly available.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Dl-uWYZyJuVcZ4ojyLjrha2maEEe08iUVpZcAqM7Fio","pdfSize":"6707890"}