{"id":"2407.12475","title":"Amplitude analysis of $B^+ \\to \\psi(2S) K^+ \\pi^+ \\pi^-$ decays","authors":"LHCb collaboration: R. Aaij, A.S.W. Abdelmotteleb, C. Abellan Beteta,\n  F. Abudin\\'en, T. Ackernley, A. A. Adefisoye, B. Adeva, M. Adinolfi, P.\n  Adlarson, C. Agapopoulou, C.A. Aidala, Z. Ajaltouni, S. Akar, K. Akiba, P.\n  Albicocco, J. Albrecht, F. Alessio, M. Alexander, Z. Aliouche, P. Alvarez\n  Cartelle, R. Amalric, S. Amato, J.L. Amey, Y. Amhis, L. An, L. Anderlini, M.\n  Andersson, A. Andreianov, P. Andreola, M. Andreotti, D. Andreou, A. Anelli,\n  D. Ao, F. Archilli, M. Argenton, S. Arguedas Cuendis, A. Artamonov, M.\n  Artuso, E. Aslanides, R. Ataide Da Silva, M. Atzeni, B. Audurier, D. Bacher,\n  I. Bachiller Perea, S. Bachmann, M. Bachmayer, J.J. Back, P. Baladron\n  Rodriguez, V. Balagura, W. Baldini, L. Balzani, H. Bao, J. Baptista de Souza\n  Leite, C. Barbero Pretel, M. Barbetti, I. R. Barbosa, R.J. Barlow, M.\n  Barnyakov, S. Barsuk, W. Barter, M. Bartolini, J. Bartz, J.M. Basels, S.\n  Bashir, G. Bassi, B. Batsukh, P. B. Battista, A. Bay, A. Beck, M. Becker, F.\n  Bedeschi, I.B. Bediaga, N. B. Behling, S. Belin, V. Bellee, K. Belous, I.\n  Belov, G. Benane, G. Bencivenni, E. Ben-Haim, A. Berezhnoy, R. Bernet, S.\n  Bernet Andres, A. Bertolin, C. Betancourt, F. Betti, J. Bex, Ia. Bezshyiko,\n  J. Bhom, M.S. Bieker, N.V. Biesuz, P. Billoir, A. Biolchini, M. Birch, F.C.R.\n  Bishop, A. Bitadze, A. Bizzeti, T. Blake, F. Blanc, J.E. Blank, S. Blusk, V.\n  Bocharnikov, J.A. Boelhauve, O. Boente Garcia, T. Boettcher, A. Bohare, A.\n  Boldyrev, C.S. Bolognani, R. Bolzonella, N. Bondar, F. Borgato, S. Borghi, M.\n  Borsato, J.T. Borsuk, S.A. Bouchiba, M. Bovill, T.J.V. Bowcock, A. Boyer, C.\n  Bozzi, A. Brea Rodriguez, N. Breer, J. Brodzicka, A. Brossa Gonzalo, J.\n  Brown, D. Brundu, E. Buchanan, A. Buonaura, L. Buonincontri, A.T. Burke, C.\n  Burr, A. Butkevich, J.S. Butter, J. Buytaert, W. Byczynski, S. Cadeddu, H.\n  Cai, A. C. Caillet, R. Calabrese, S. Calderon Ramirez, L. Calefice, S. Cali,\n  M. Calvi, M. Calvo Gomez, P. Camargo Magalhaes, J. I. Cambon Bouzas, P.\n  Campana, D.H. Campora Perez, A.F. Campoverde Quezada, S. Capelli, L.\n  Capriotti, R. Caravaca-Mora, A. Carbone, L. Carcedo Salgado, R. Cardinale, A.\n  Cardini, P. Carniti, L. Carus, A. Casais Vidal, R. Caspary, G. Casse, J.\n  Castro Godinez, M. Cattaneo, G. Cavallero, V. Cavallini, S. Celani, D.\n  Cervenkov, S. Cesare, A.J. Chadwick, I. Chahrour, M. Charles, Ph.\n  Charpentier, E. Chatzianagnostou, C.A. Chavez Barajas, M. Chefdeville, C.\n  Chen, S. Chen, Z. Chen, A. Chernov, S. Chernyshenko, X. Chiotopoulos, V.\n  Chobanova, S. Cholak, M. Chrzaszcz, A. Chubykin, V. Chulikov, P. Ciambrone,\n  X. Cid Vidal, G. Ciezarek, P. Cifra, P.E.L. Clarke, M. Clemencic, H.V. Cliff,\n  J. Closier, C. Cocha Toapaxi, V. Coco, J. Cogan, E. Cogneras, L. Cojocariu,\n  P. Collins, T. Colombo, M. C. Colonna, A. Comerma-Montells, L. Congedo, A.\n  Contu, N. Cooke, I. Corredoira, A. Correia, G. Corti, J.J. Cottee Meldrum, B.\n  Couturier, D.C. Craik, M. Cruz Torres, E. Curras Rivera, R. Currie, C.L. Da\n  Silva, S. Dadabaev, L. Dai, X. Dai, E. Dall'Occo, J. Dalseno, C. D'Ambrosio,\n  J. Daniel, A. Danilina, P. d'Argent, A. Davidson, J.E. Davies, A. Davis, O.\n  De Aguiar Francisco, C. De Angelis, F. De Benedetti, J. de Boer, K. De Bruyn,\n  S. De Capua, M. De Cian, U. De Freitas Carneiro Da Graca, E. De Lucia, J.M.\n  De Miranda, L. De Paula, M. De Serio, P. De Simone, F. De Vellis, J.A. de\n  Vries, F. Debernardis, D. Decamp, V. Dedu, L. Del Buono, B. Delaney, H.-P.\n  Dembinski, J. Deng, V. Denysenko, O. Deschamps, F. Dettori, B. Dey, P. Di\n  Nezza, I. Diachkov, S. Didenko, S. Ding, L. Dittmann, V. Dobishuk, A. D.\n  Docheva, C. Dong, A.M. Donohoe, F. Dordei, A.C. dos Reis, A. D. Dowling, W.\n  Duan, P. Duda, M.W. Dudek, L. Dufour, V. Duk, P. Durante, M. M. Duras, J.M.\n  Durham, O. D. Durmus, A. Dziurda, A. Dzyuba, S. Easo, E. Eckstein, U. Egede,\n  A. Egorychev, V. Egorychev, S. Eisenhardt, E. Ejopu, L. Eklund, M. Elashri,\n  J. Ellbracht, S. Ely, A. Ene, E. Epple, J. Eschle, S. Esen, T. Evans, F.\n  Fabiano, L.N. Falcao, Y. Fan, B. Fang, L. Fantini, M. Faria, K. Farmer, D.\n  Fazzini, L. Felkowski, M. Feng, M. Feo, A. Fernandez Casani, M. Fernandez\n  Gomez, A.D. Fernez, F. Ferrari, F. Ferreira Rodrigues, M. Ferrillo, M.\n  Ferro-Luzzi, S. Filippov, R.A. Fini, M. Fiorini, K.M. Fischer, D.S.\n  Fitzgerald, C. Fitzpatrick, F. Fleuret, M. Fontana, L. F. Foreman, R. Forty,\n  D. Foulds-Holt, M. Franco Sevilla, M. Frank, E. Franzoso, G. Frau, C. Frei,\n  D.A. Friday, J. Fu, Q. Fuehring, Y. Fujii, T. Fulghesu, E. Gabriel, G.\n  Galati, M.D. Galati, A. Gallas Torreira, D. Galli, S. Gambetta, M. Gandelman,\n  P. Gandini, B. Ganie, H. Gao, R. Gao, Y. Gao, Y. Gao, Y. Gao, M. Garau, L.M.\n  Garcia Martin, P. Garcia Moreno, J. Garc\\'ia Pardi\\~nas, K. G. Garg, L.\n  Garrido, C. Gaspar, R.E. Geertsema, L.L. Gerken, E. Gersabeck, M. Gersabeck,\n  T. Gershon, Z. Ghorbanimoghaddam, L. Giambastiani, F. I. Giasemis, V. Gibson,\n  H.K. Giemza, A.L. Gilman, M. Giovannetti, A. Giovent\\`u, L. Girardey, P.\n  Gironella Gironell, C. Giugliano, M.A. Giza, E.L. Gkougkousis, F.C. Glaser,\n  V.V. Gligorov, C. G\\\"obel, E. Golobardes, D. Golubkov, A. Golutvin, A. Gomes,\n  S. Gomez Fernandez, F. Goncalves Abrantes, M. Goncerz, G. Gong, J. A.\n  Gooding, I.V. Gorelov, C. Gotti, J.P. Grabowski, L.A. Granado Cardoso, E.\n  Graug\\'es, E. Graverini, L. Grazette, G. Graziani, A. T. Grecu, L.M. Greeven,\n  N.A. Grieser, L. Grillo, S. Gromov, C. Gu, M. Guarise, M. Guittiere, V.\n  Guliaeva, P. A. G\\\"unther, A.-K. Guseinov, E. Gushchin, Y. Guz, T. Gys, K.\n  Habermann, T. Hadavizadeh, C. Hadjivasiliou, G. Haefeli, C. Haen, J.\n  Haimberger, M. Hajheidari, G. H. Hallett, M.M. Halvorsen, P.M. Hamilton, J.\n  Hammerich, Q. Han, X. Han, S. Hansmann-Menzemer, L. Hao, N. Harnew, M.\n  Hartmann, S. Hashmi, J. He, F. Hemmer, C. Henderson, R.D.L. Henderson, A.M.\n  Hennequin, K. Hennessy, L. Henry, J. Herd, P. Herrero Gascon, J. Heuel, A.\n  Hicheur, G. Hijano Mendizabal, D. Hill, S.E. Hollitt, J. Horswill, R. Hou, Y.\n  Hou, N. Howarth, J. Hu, J. Hu, W. Hu, X. Hu, W. Huang, W. Hulsbergen, R.J.\n  Hunter, M. Hushchyn, D. Hutchcroft, D. Ilin, P. Ilten, A. Inglessi, A.\n  Iniukhin, A. Ishteev, K. Ivshin, R. Jacobsson, H. Jage, S.J. Jaimes Elles, S.\n  Jakobsen, E. Jans, B.K. Jashal, A. Jawahery, V. Jevtic, E. Jiang, X. Jiang,\n  Y. Jiang, Y. J. Jiang, M. John, A. John Rubesh Rajan, D. Johnson, C.R. Jones,\n  T.P. Jones, S. Joshi, B. Jost, J. Juan Castella, N. Jurik, I. Juszczak, D.\n  Kaminaris, S. Kandybei, M. Kane, Y. Kang, C. Kar, M. Karacson, D. Karpenkov,\n  A. Kauniskangas, J.W. Kautz, F. Keizer, M. Kenzie, T. Ketel, B. Khanji, A.\n  Kharisova, S. Kholodenko, G. Khreich, T. Kirn, V.S. Kirsebom, O. Kitouni, S.\n  Klaver, N. Kleijne, K. Klimaszewski, M.R. Kmiec, S. Koliiev, L. Kolk, A.\n  Konoplyannikov, P. Kopciewicz, P. Koppenburg, M. Korolev, I. Kostiuk, O. Kot,\n  S. Kotriakhova, A. Kozachuk, P. Kravchenko, L. Kravchuk, M. Kreps, P.\n  Krokovny, W. Krupa, W. Krzemien, O.K. Kshyvanskyi, J. Kubat, S. Kubis, M.\n  Kucharczyk, V. Kudryavtsev, E. Kulikova, A. Kupsc, B. K. Kutsenko, D.\n  Lacarrere, A. Lai, A. Lampis, D. Lancierini, C. Landesa Gomez, J.J. Lane, R.\n  Lane, C. Langenbruch, J. Langer, O. Lantwin, T. Latham, F. Lazzari, C.\n  Lazzeroni, R. Le Gac, H. Lee, R. Lef\\`evre, A. Leflat, S. Legotin, M.\n  Lehuraux, E. Lemos Cid, O. Leroy, T. Lesiak, B. Leverington, A. Li, C. Li, H.\n  Li, K. Li, L. Li, P. Li, P.-R. Li, Q. Li, S. Li, T. Li, T. Li, Y. Li, Y. Li,\n  Z. Lian, X. Liang, S. Libralon, C. Lin, T. Lin, R. Lindner, V. Lisovskyi, R.\n  Litvinov, F. L. Liu, G. Liu, K. Liu, S. Liu, W. Liu, Y. Liu, Y. Liu, Y. L.\n  Liu, A. Lobo Salvia, A. Loi, J. Lomba Castro, T. Long, J.H. Lopes, A. Lopez\n  Huertas, S. L\\'opez Soli\\~no, C. Lucarelli, D. Lucchesi, M. Lucio Martinez,\n  V. Lukashenko, Y. Luo, A. Lupato, E. Luppi, K. Lynch, X.-R. Lyu, G. M. Ma, R.\n  Ma, S. Maccolini, F. Machefert, F. Maciuc, B. Mack, I. Mackay, L. M. Mackey,\n  L.R. Madhan Mohan, M. M. Madurai, A. Maevskiy, D. Magdalinski, D. Maisuzenko,\n  M.W. Majewski, J.J. Malczewski, S. Malde, L. Malentacca, A. Malinin, T.\n  Maltsev, G. Manca, G. Mancinelli, C. Mancuso, R. Manera Escalero, D. Manuzzi,\n  D. Marangotto, J.F. Marchand, R. Marchevski, U. Marconi, S. Mariani, C. Marin\n  Benito, J. Marks, A.M. Marshall, L. Martel, G. Martelli, G. Martellotti, L.\n  Martinazzoli, M. Martinelli, D. Martinez Santos, F. Martinez Vidal, A.\n  Massafferri, R. Matev, A. Mathad, V. Matiunin, C. Matteuzzi, K.R. Mattioli,\n  A. Mauri, E. Maurice, J. Mauricio, P. Mayencourt, J. Mazorra de Cos, M.\n  Mazurek, M. McCann, L. Mcconnell, T.H. McGrath, N.T. McHugh, A. McNab, R.\n  McNulty, B. Meadows, G. Meier, D. Melnychuk, F. M. Meng, M. Merk, A. Merli,\n  L. Meyer Garcia, D. Miao, H. Miao, M. Mikhasenko, D.A. Milanes, A. Minotti,\n  E. Minucci, T. Miralles, B. Mitreska, D.S. Mitzel, A. Modak, R.A. Mohammed,\n  R.D. Moise, S. Mokhnenko, T. Momb\\\"acher, M. Monk, S. Monteil, A. Morcillo\n  Gomez, G. Morello, M.J. Morello, M.P. Morgenthaler, A.B. Morris, A.G. Morris,\n  R. Mountain, H. Mu, Z. M. Mu, E. Muhammad, F. Muheim, M. Mulder, K. M\\\"uller,\n  F. Mu\\~noz-Rojas, R. Murta, P. Naik, T. Nakada, R. Nandakumar, T. Nanut, I.\n  Nasteva, M. Needham, N. Neri, S. Neubert, N. Neufeld, P. Neustroev, J.\n  Nicolini, D. Nicotra, E.M. Niel, N. Nikitin, P. Nogarolli, P. Nogga, N.S.\n  Nolte, C. Normand, J. Novoa Fernandez, G. Nowak, C. Nunez, H. N. Nur, A.\n  Oblakowska-Mucha, V. Obraztsov, T. Oeser, S. Okamura, A. Okhotnikov, O.\n  Okhrimenko, R. Oldeman, F. Oliva, M. Olocco, C.J.G. Onderwater, R.H. O'Neil,\n  D. Osthues, J.M. Otalora Goicochea, P. Owen, A. Oyanguren, O. Ozcelik, A.\n  Padee, K.O. Padeken, B. Pagare, P.R. Pais, T. Pajero, A. Palano, M. Palutan,\n  G. Panshin, L. Paolucci, A. Papanestis, M. Pappagallo, L.L. Pappalardo, C.\n  Pappenheimer, C. Parkes, B. Passalacqua, G. Passaleva, D. Passaro, A.\n  Pastore, M. Patel, J. Patoc, C. Patrignani, A. Paul, C.J. Pawley, A.\n  Pellegrino, J. Peng, M. Pepe Altarelli, S. Perazzini, D. Pereima, H. Pereira\n  Da Costa, A. Pereiro Castro, P. Perret, A. Perro, K. Petridis, A. Petrolini,\n  J. P. Pfaller, H. Pham, L. Pica, M. Piccini, B. Pietrzyk, G. Pietrzyk, D.\n  Pinci, F. Pisani, M. Pizzichemi, V. Placinta, M. Plo Casasus, T. Poeschl, F.\n  Polci, M. Poli Lener, A. Poluektov, N. Polukhina, I. Polyakov, E. Polycarpo,\n  S. Ponce, D. Popov, S. Poslavskii, K. Prasanth, C. Prouve, V. Pugatch, G.\n  Punzi, S. Qasim, Q. Q. Qian, W. Qian, N. Qin, S. Qu, R. Quagliani, R.I.\n  Rabadan Trejo, J.H. Rademacker, M. Rama, M. Ram\\'irez Garc\\'ia, V. Ramos De\n  Oliveira, M. Ramos Pernas, M.S. Rangel, F. Ratnikov, G. Raven, M. Rebollo De\n  Miguel, F. Redi, J. Reich, F. Reiss, Z. Ren, P.K. Resmi, R. Ribatti, G. R.\n  Ricart, D. Riccardi, S. Ricciardi, K. Richardson, M. Richardson-Slipper, K.\n  Rinnert, P. Robbe, G. Robertson, E. Rodrigues, E. Rodriguez Fernandez, J.A.\n  Rodriguez Lopez, E. Rodriguez Rodriguez, J. Roensch, A. Rogovskiy, D.L. Rolf,\n  P. Roloff, V. Romanovskiy, M. Romero Lamas, A. Romero Vidal, G. Romolini, F.\n  Ronchetti, T. Rong, M. Rotondo, S. R. Roy, M.S. Rudolph, M. Ruiz Diaz, R.A.\n  Ruiz Fernandez, J. Ruiz Vidal, A. Ryzhikov, J. Ryzka, J. J. Saavedra-Arias,\n  J.J. Saborido Silva, R. Sadek, N. Sagidova, D. Sahoo, N. Sahoo, B. Saitta, M.\n  Salomoni, C. Sanchez Gras, I. Sanderswood, R. Santacesaria, C. Santamarina\n  Rios, M. Santimaria, L. Santoro, E. Santovetti, A. Saputi, D. Saranin, A. S.\n  Sarnatskiy, G. Sarpis, M. Sarpis, C. Satriano, A. Satta, M. Saur, D. Savrina,\n  H. Sazak, L.G. Scantlebury Smead, A. Scarabotto, S. Schael, S. Scherl, M.\n  Schiller, H. Schindler, M. Schmelling, B. Schmidt, S. Schmitt, H. Schmitz, O.\n  Schneider, A. Schopper, N. Schulte, S. Schulte, M.H. Schune, R. Schwemmer, G.\n  Schwering, B. Sciascia, A. Sciuccati, S. Sellam, A. Semennikov, T. Senger, M.\n  Senghi Soares, A. Sergi, N. Serra, L. Sestini, A. Seuthe, Y. Shang, D.M.\n  Shangase, M. Shapkin, R. S. Sharma, I. Shchemerov, L. Shchutska, T. Shears,\n  L. Shekhtman, Z. Shen, S. Sheng, V. Shevchenko, B. Shi, Q. Shi, Y. Shimizu,\n  E. Shmanin, R. Shorkin, J.D. Shupperd, R. Silva Coutinho, G. Simi, S. Simone,\n  N. Skidmore, T. Skwarnicki, M.W. Slater, J.C. Smallwood, E. Smith, K. Smith,\n  M. Smith, A. Snoch, L. Soares Lavra, M.D. Sokoloff, F.J.P. Soler, A. Solomin,\n  A. Solovev, I. Solovyev, R. Song, Y. Song, Y. Song, Y. S. Song, F.L. Souza De\n  Almeida, B. Souza De Paula, E. Spadaro Norella, E. Spedicato, J.G. Speer, E.\n  Spiridenkov, P. Spradlin, V. Sriskaran, F. Stagni, M. Stahl, S. Stahl, S.\n  Stanislaus, E.N. Stein, O. Steinkamp, O. Stenyakin, H. Stevens, D.\n  Strekalina, Y. Su, F. Suljik, J. Sun, L. Sun, Y. Sun, D. Sundfeld, W.\n  Sutcliffe, P.N. Swallow, F. Swystun, A. Szabelski, T. Szumlak, Y. Tan, M.D.\n  Tat, A. Terentev, F. Terzuoli, F. Teubert, E. Thomas, D.J.D. Thompson, H.\n  Tilquin, V. Tisserand, S. T'Jampens, M. Tobin, L. Tomassetti, G. Tonani, X.\n  Tong, D. Torres Machado, L. Toscano, D.Y. Tou, C. Trippl, G. Tuci, N. Tuning,\n  L.H. Uecker, A. Ukleja, D.J. Unverzagt, E. Ursov, A. Usachov, A. Ustyuzhanin,\n  U. Uwer, V. Vagnoni, G. Valenti, N. Valls Canudas, H. Van Hecke, E. van\n  Herwijnen, C.B. Van Hulse, R. Van Laak, M. van Veghel, G. Vasquez, R. Vazquez\n  Gomez, P. Vazquez Regueiro, C. V\\'azquez Sierra, S. Vecchi, J.J. Velthuis, M.\n  Veltri, A. Venkateswaran, M. Vesterinen, D. Vico Benet, M. Vieites Diaz, X.\n  Vilasis-Cardona, E. Vilella Figueras, A. Villa, P. Vincent, F.C. Volle, D.\n  vom Bruch, N. Voropaev, K. Vos, G. Vouters, C. Vrahas, J. Wagner, J. Walsh,\n  E.J. Walton, G. Wan, C. Wang, G. Wang, J. Wang, J. Wang, J. Wang, J. Wang, M.\n  Wang, N. W. Wang, R. Wang, X. Wang, X. Wang, X. W. Wang, Y. Wang, Z. Wang, Z.\n  Wang, Z. Wang, J.A. Ward, M. Waterlaat, N.K. Watson, D. Websdale, Y. Wei, J.\n  Wendel, B.D.C. Westhenry, C. White, M. Whitehead, E. Whiter, A.R. Wiederhold,\n  D. Wiedner, G. Wilkinson, M.K. Wilkinson, M. Williams, M.R.J. Williams, R.\n  Williams, Z. Williams, F.F. Wilson, W. Wislicki, M. Witek, L. Witola, C.P.\n  Wong, G. Wormser, S.A. Wotton, H. Wu, J. Wu, Y. Wu, Z. Wu, K. Wyllie, S.\n  Xian, Z. Xiang, Y. Xie, A. Xu, J. Xu, L. Xu, L. Xu, M. Xu, Z. Xu, Z. Xu, Z.\n  Xu, D. Yang, K. Yang, S. Yang, X. Yang, Y. Yang, Z. Yang, Z. Yang, V.\n  Yeroshenko, H. Yeung, H. Yin, C. Y. Yu, J. Yu, X. Yuan, Y Yuan, E. Zaffaroni,\n  M. Zavertyaev, M. Zdybal, C. Zeng, M. Zeng, C. Zhang, D. Zhang, J. Zhang, L.\n  Zhang, S. Zhang, S. Zhang, Y. Zhang, Y. Z. Zhang, Y. Zhao, A. Zharkova, A.\n  Zhelezov, S. Z. Zheng, X. Z. Zheng, Y. Zheng, T. Zhou, X. Zhou, Y. Zhou, V.\n  Zhovkovska, L. Z. Zhu, X. Zhu, X. Zhu, V. Zhukov, J. Zhuo, Q. Zou, D.\n  Zuliani, G. Zunica","authorsParsed":[["LHCb collaboration","",""],["Aaij","R.",""],["Abdelmotteleb","A. S. W.",""],["Beteta","C. Abellan",""],["Abudinén","F.",""],["Ackernley","T.",""],["Adefisoye","A. A.",""],["Adeva","B.",""],["Adinolfi","M.",""],["Adlarson","P.",""],["Agapopoulou","C.",""],["Aidala","C. A.",""],["Ajaltouni","Z.",""],["Akar","S.",""],["Akiba","K.",""],["Albicocco","P.",""],["Albrecht","J.",""],["Alessio","F.",""],["Alexander","M.",""],["Aliouche","Z.",""],["Cartelle","P. Alvarez",""],["Amalric","R.",""],["Amato","S.",""],["Amey","J. L.",""],["Amhis","Y.",""],["An","L.",""],["Anderlini","L.",""],["Andersson","M.",""],["Andreianov","A.",""],["Andreola","P.",""],["Andreotti","M.",""],["Andreou","D.",""],["Anelli","A.",""],["Ao","D.",""],["Archilli","F.",""],["Argenton","M.",""],["Cuendis","S. Arguedas",""],["Artamonov","A.",""],["Artuso","M.",""],["Aslanides","E.",""],["Da Silva","R. Ataide",""],["Atzeni","M.",""],["Audurier","B.",""],["Bacher","D.",""],["Perea","I. Bachiller",""],["Bachmann","S.",""],["Bachmayer","M.",""],["Back","J. J.",""],["Rodriguez","P. Baladron",""],["Balagura","V.",""],["Baldini","W.",""],["Balzani","L.",""],["Bao","H.",""],["Leite","J. Baptista de Souza",""],["Pretel","C. Barbero",""],["Barbetti","M.",""],["Barbosa","I. R.",""],["Barlow","R. J.",""],["Barnyakov","M.",""],["Barsuk","S.",""],["Barter","W.",""],["Bartolini","M.",""],["Bartz","J.",""],["Basels","J. M.",""],["Bashir","S.",""],["Bassi","G.",""],["Batsukh","B.",""],["Battista","P. B.",""],["Bay","A.",""],["Beck","A.",""],["Becker","M.",""],["Bedeschi","F.",""],["Bediaga","I. B.",""],["Behling","N. B.",""],["Belin","S.",""],["Bellee","V.",""],["Belous","K.",""],["Belov","I.",""],["Benane","G.",""],["Bencivenni","G.",""],["Ben-Haim","E.",""],["Berezhnoy","A.",""],["Bernet","R.",""],["Andres","S. Bernet",""],["Bertolin","A.",""],["Betancourt","C.",""],["Betti","F.",""],["Bex","J.",""],["Bezshyiko","Ia.",""],["Bhom","J.",""],["Bieker","M. S.",""],["Biesuz","N. V.",""],["Billoir","P.",""],["Biolchini","A.",""],["Birch","M.",""],["Bishop","F. C. R.",""],["Bitadze","A.",""],["Bizzeti","A.",""],["Blake","T.",""],["Blanc","F.",""],["Blank","J. E.",""],["Blusk","S.",""],["Bocharnikov","V.",""],["Boelhauve","J. A.",""],["Garcia","O. Boente",""],["Boettcher","T.",""],["Bohare","A.",""],["Boldyrev","A.",""],["Bolognani","C. S.",""],["Bolzonella","R.",""],["Bondar","N.",""],["Borgato","F.",""],["Borghi","S.",""],["Borsato","M.",""],["Borsuk","J. T.",""],["Bouchiba","S. A.",""],["Bovill","M.",""],["Bowcock","T. J. V.",""],["Boyer","A.",""],["Bozzi","C.",""],["Rodriguez","A. Brea",""],["Breer","N.",""],["Brodzicka","J.",""],["Gonzalo","A. Brossa",""],["Brown","J.",""],["Brundu","D.",""],["Buchanan","E.",""],["Buonaura","A.",""],["Buonincontri","L.",""],["Burke","A. T.",""],["Burr","C.",""],["Butkevich","A.",""],["Butter","J. S.",""],["Buytaert","J.",""],["Byczynski","W.",""],["Cadeddu","S.",""],["Cai","H.",""],["Caillet","A. C.",""],["Calabrese","R.",""],["Ramirez","S. Calderon",""],["Calefice","L.",""],["Cali","S.",""],["Calvi","M.",""],["Gomez","M. Calvo",""],["Magalhaes","P. Camargo",""],["Bouzas","J. I. Cambon",""],["Campana","P.",""],["Perez","D. H. Campora",""],["Quezada","A. F. Campoverde",""],["Capelli","S.",""],["Capriotti","L.",""],["Caravaca-Mora","R.",""],["Carbone","A.",""],["Salgado","L. Carcedo",""],["Cardinale","R.",""],["Cardini","A.",""],["Carniti","P.",""],["Carus","L.",""],["Vidal","A. Casais",""],["Caspary","R.",""],["Casse","G.",""],["Godinez","J. Castro",""],["Cattaneo","M.",""],["Cavallero","G.",""],["Cavallini","V.",""],["Celani","S.",""],["Cervenkov","D.",""],["Cesare","S.",""],["Chadwick","A. J.",""],["Chahrour","I.",""],["Charles","M.",""],["Charpentier","Ph.",""],["Chatzianagnostou","E.",""],["Barajas","C. A. Chavez",""],["Chefdeville","M.",""],["Chen","C.",""],["Chen","S.",""],["Chen","Z.",""],["Chernov","A.",""],["Chernyshenko","S.",""],["Chiotopoulos","X.",""],["Chobanova","V.",""],["Cholak","S.",""],["Chrzaszcz","M.",""],["Chubykin","A.",""],["Chulikov","V.",""],["Ciambrone","P.",""],["Vidal","X. Cid",""],["Ciezarek","G.",""],["Cifra","P.",""],["Clarke","P. E. L.",""],["Clemencic","M.",""],["Cliff","H. V.",""],["Closier","J.",""],["Toapaxi","C. Cocha",""],["Coco","V.",""],["Cogan","J.",""],["Cogneras","E.",""],["Cojocariu","L.",""],["Collins","P.",""],["Colombo","T.",""],["Colonna","M. C.",""],["Comerma-Montells","A.",""],["Congedo","L.",""],["Contu","A.",""],["Cooke","N.",""],["Corredoira","I.",""],["Correia","A.",""],["Corti","G.",""],["Meldrum","J. J. Cottee",""],["Couturier","B.",""],["Craik","D. C.",""],["Torres","M. Cruz",""],["Rivera","E. Curras",""],["Currie","R.",""],["Da Silva","C. L.",""],["Dadabaev","S.",""],["Dai","L.",""],["Dai","X.",""],["Dall'Occo","E.",""],["Dalseno","J.",""],["D'Ambrosio","C.",""],["Daniel","J.",""],["Danilina","A.",""],["d'Argent","P.",""],["Davidson","A.",""],["Davies","J. E.",""],["Davis","A.",""],["Francisco","O. De Aguiar",""],["De Angelis","C.",""],["De Benedetti","F.",""],["de Boer","J.",""],["De Bruyn","K.",""],["De Capua","S.",""],["De Cian","M.",""],["Da Graca","U. De Freitas Carneiro",""],["De Lucia","E.",""],["De Miranda","J. M.",""],["De Paula","L.",""],["De Serio","M.",""],["De Simone","P.",""],["De Vellis","F.",""],["de Vries","J. A.",""],["Debernardis","F.",""],["Decamp","D.",""],["Dedu","V.",""],["Del Buono","L.",""],["Delaney","B.",""],["Dembinski","H. -P.",""],["Deng","J.",""],["Denysenko","V.",""],["Deschamps","O.",""],["Dettori","F.",""],["Dey","B.",""],["Di Nezza","P.",""],["Diachkov","I.",""],["Didenko","S.",""],["Ding","S.",""],["Dittmann","L.",""],["Dobishuk","V.",""],["Docheva","A. D.",""],["Dong","C.",""],["Donohoe","A. M.",""],["Dordei","F.",""],["Reis","A. C. dos",""],["Dowling","A. D.",""],["Duan","W.",""],["Duda","P.",""],["Dudek","M. W.",""],["Dufour","L.",""],["Duk","V.",""],["Durante","P.",""],["Duras","M. M.",""],["Durham","J. M.",""],["Durmus","O. D.",""],["Dziurda","A.",""],["Dzyuba","A.",""],["Easo","S.",""],["Eckstein","E.",""],["Egede","U.",""],["Egorychev","A.",""],["Egorychev","V.",""],["Eisenhardt","S.",""],["Ejopu","E.",""],["Eklund","L.",""],["Elashri","M.",""],["Ellbracht","J.",""],["Ely","S.",""],["Ene","A.",""],["Epple","E.",""],["Eschle","J.",""],["Esen","S.",""],["Evans","T.",""],["Fabiano","F.",""],["Falcao","L. N.",""],["Fan","Y.",""],["Fang","B.",""],["Fantini","L.",""],["Faria","M.",""],["Farmer","K.",""],["Fazzini","D.",""],["Felkowski","L.",""],["Feng","M.",""],["Feo","M.",""],["Casani","A. Fernandez",""],["Gomez","M. Fernandez",""],["Fernez","A. D.",""],["Ferrari","F.",""],["Rodrigues","F. Ferreira",""],["Ferrillo","M.",""],["Ferro-Luzzi","M.",""],["Filippov","S.",""],["Fini","R. A.",""],["Fiorini","M.",""],["Fischer","K. M.",""],["Fitzgerald","D. S.",""],["Fitzpatrick","C.",""],["Fleuret","F.",""],["Fontana","M.",""],["Foreman","L. F.",""],["Forty","R.",""],["Foulds-Holt","D.",""],["Sevilla","M. Franco",""],["Frank","M.",""],["Franzoso","E.",""],["Frau","G.",""],["Frei","C.",""],["Friday","D. A.",""],["Fu","J.",""],["Fuehring","Q.",""],["Fujii","Y.",""],["Fulghesu","T.",""],["Gabriel","E.",""],["Galati","G.",""],["Galati","M. D.",""],["Torreira","A. Gallas",""],["Galli","D.",""],["Gambetta","S.",""],["Gandelman","M.",""],["Gandini","P.",""],["Ganie","B.",""],["Gao","H.",""],["Gao","R.",""],["Gao","Y.",""],["Gao","Y.",""],["Gao","Y.",""],["Garau","M.",""],["Martin","L. M. Garcia",""],["Moreno","P. Garcia",""],["Pardiñas","J. García",""],["Garg","K. G.",""],["Garrido","L.",""],["Gaspar","C.",""],["Geertsema","R. E.",""],["Gerken","L. L.",""],["Gersabeck","E.",""],["Gersabeck","M.",""],["Gershon","T.",""],["Ghorbanimoghaddam","Z.",""],["Giambastiani","L.",""],["Giasemis","F. I.",""],["Gibson","V.",""],["Giemza","H. K.",""],["Gilman","A. L.",""],["Giovannetti","M.",""],["Gioventù","A.",""],["Girardey","L.",""],["Gironell","P. Gironella",""],["Giugliano","C.",""],["Giza","M. A.",""],["Gkougkousis","E. L.",""],["Glaser","F. C.",""],["Gligorov","V. V.",""],["Göbel","C.",""],["Golobardes","E.",""],["Golubkov","D.",""],["Golutvin","A.",""],["Gomes","A.",""],["Fernandez","S. Gomez",""],["Abrantes","F. Goncalves",""],["Goncerz","M.",""],["Gong","G.",""],["Gooding","J. A.",""],["Gorelov","I. V.",""],["Gotti","C.",""],["Grabowski","J. P.",""],["Cardoso","L. A. Granado",""],["Graugés","E.",""],["Graverini","E.",""],["Grazette","L.",""],["Graziani","G.",""],["Grecu","A. T.",""],["Greeven","L. M.",""],["Grieser","N. A.",""],["Grillo","L.",""],["Gromov","S.",""],["Gu","C.",""],["Guarise","M.",""],["Guittiere","M.",""],["Guliaeva","V.",""],["Günther","P. A.",""],["Guseinov","A. -K.",""],["Gushchin","E.",""],["Guz","Y.",""],["Gys","T.",""],["Habermann","K.",""],["Hadavizadeh","T.",""],["Hadjivasiliou","C.",""],["Haefeli","G.",""],["Haen","C.",""],["Haimberger","J.",""],["Hajheidari","M.",""],["Hallett","G. H.",""],["Halvorsen","M. M.",""],["Hamilton","P. M.",""],["Hammerich","J.",""],["Han","Q.",""],["Han","X.",""],["Hansmann-Menzemer","S.",""],["Hao","L.",""],["Harnew","N.",""],["Hartmann","M.",""],["Hashmi","S.",""],["He","J.",""],["Hemmer","F.",""],["Henderson","C.",""],["Henderson","R. D. L.",""],["Hennequin","A. M.",""],["Hennessy","K.",""],["Henry","L.",""],["Herd","J.",""],["Gascon","P. Herrero",""],["Heuel","J.",""],["Hicheur","A.",""],["Mendizabal","G. Hijano",""],["Hill","D.",""],["Hollitt","S. E.",""],["Horswill","J.",""],["Hou","R.",""],["Hou","Y.",""],["Howarth","N.",""],["Hu","J.",""],["Hu","J.",""],["Hu","W.",""],["Hu","X.",""],["Huang","W.",""],["Hulsbergen","W.",""],["Hunter","R. J.",""],["Hushchyn","M.",""],["Hutchcroft","D.",""],["Ilin","D.",""],["Ilten","P.",""],["Inglessi","A.",""],["Iniukhin","A.",""],["Ishteev","A.",""],["Ivshin","K.",""],["Jacobsson","R.",""],["Jage","H.",""],["Elles","S. J. Jaimes",""],["Jakobsen","S.",""],["Jans","E.",""],["Jashal","B. K.",""],["Jawahery","A.",""],["Jevtic","V.",""],["Jiang","E.",""],["Jiang","X.",""],["Jiang","Y.",""],["Jiang","Y. J.",""],["John","M.",""],["Rajan","A. John Rubesh",""],["Johnson","D.",""],["Jones","C. R.",""],["Jones","T. P.",""],["Joshi","S.",""],["Jost","B.",""],["Castella","J. Juan",""],["Jurik","N.",""],["Juszczak","I.",""],["Kaminaris","D.",""],["Kandybei","S.",""],["Kane","M.",""],["Kang","Y.",""],["Kar","C.",""],["Karacson","M.",""],["Karpenkov","D.",""],["Kauniskangas","A.",""],["Kautz","J. W.",""],["Keizer","F.",""],["Kenzie","M.",""],["Ketel","T.",""],["Khanji","B.",""],["Kharisova","A.",""],["Kholodenko","S.",""],["Khreich","G.",""],["Kirn","T.",""],["Kirsebom","V. S.",""],["Kitouni","O.",""],["Klaver","S.",""],["Kleijne","N.",""],["Klimaszewski","K.",""],["Kmiec","M. R.",""],["Koliiev","S.",""],["Kolk","L.",""],["Konoplyannikov","A.",""],["Kopciewicz","P.",""],["Koppenburg","P.",""],["Korolev","M.",""],["Kostiuk","I.",""],["Kot","O.",""],["Kotriakhova","S.",""],["Kozachuk","A.",""],["Kravchenko","P.",""],["Kravchuk","L.",""],["Kreps","M.",""],["Krokovny","P.",""],["Krupa","W.",""],["Krzemien","W.",""],["Kshyvanskyi","O. K.",""],["Kubat","J.",""],["Kubis","S.",""],["Kucharczyk","M.",""],["Kudryavtsev","V.",""],["Kulikova","E.",""],["Kupsc","A.",""],["Kutsenko","B. K.",""],["Lacarrere","D.",""],["Lai","A.",""],["Lampis","A.",""],["Lancierini","D.",""],["Gomez","C. Landesa",""],["Lane","J. J.",""],["Lane","R.",""],["Langenbruch","C.",""],["Langer","J.",""],["Lantwin","O.",""],["Latham","T.",""],["Lazzari","F.",""],["Lazzeroni","C.",""],["Gac","R. Le",""],["Lee","H.",""],["Lefèvre","R.",""],["Leflat","A.",""],["Legotin","S.",""],["Lehuraux","M.",""],["Cid","E. Lemos",""],["Leroy","O.",""],["Lesiak","T.",""],["Leverington","B.",""],["Li","A.",""],["Li","C.",""],["Li","H.",""],["Li","K.",""],["Li","L.",""],["Li","P.",""],["Li","P. -R.",""],["Li","Q.",""],["Li","S.",""],["Li","T.",""],["Li","T.",""],["Li","Y.",""],["Li","Y.",""],["Lian","Z.",""],["Liang","X.",""],["Libralon","S.",""],["Lin","C.",""],["Lin","T.",""],["Lindner","R.",""],["Lisovskyi","V.",""],["Litvinov","R.",""],["Liu","F. L.",""],["Liu","G.",""],["Liu","K.",""],["Liu","S.",""],["Liu","W.",""],["Liu","Y.",""],["Liu","Y.",""],["Liu","Y. L.",""],["Salvia","A. Lobo",""],["Loi","A.",""],["Castro","J. Lomba",""],["Long","T.",""],["Lopes","J. H.",""],["Huertas","A. Lopez",""],["Soliño","S. López",""],["Lucarelli","C.",""],["Lucchesi","D.",""],["Martinez","M. Lucio",""],["Lukashenko","V.",""],["Luo","Y.",""],["Lupato","A.",""],["Luppi","E.",""],["Lynch","K.",""],["Lyu","X. -R.",""],["Ma","G. M.",""],["Ma","R.",""],["Maccolini","S.",""],["Machefert","F.",""],["Maciuc","F.",""],["Mack","B.",""],["Mackay","I.",""],["Mackey","L. M.",""],["Mohan","L. R. Madhan",""],["Madurai","M. M.",""],["Maevskiy","A.",""],["Magdalinski","D.",""],["Maisuzenko","D.",""],["Majewski","M. W.",""],["Malczewski","J. J.",""],["Malde","S.",""],["Malentacca","L.",""],["Malinin","A.",""],["Maltsev","T.",""],["Manca","G.",""],["Mancinelli","G.",""],["Mancuso","C.",""],["Escalero","R. Manera",""],["Manuzzi","D.",""],["Marangotto","D.",""],["Marchand","J. F.",""],["Marchevski","R.",""],["Marconi","U.",""],["Mariani","S.",""],["Benito","C. Marin",""],["Marks","J.",""],["Marshall","A. M.",""],["Martel","L.",""],["Martelli","G.",""],["Martellotti","G.",""],["Martinazzoli","L.",""],["Martinelli","M.",""],["Santos","D. Martinez",""],["Vidal","F. Martinez",""],["Massafferri","A.",""],["Matev","R.",""],["Mathad","A.",""],["Matiunin","V.",""],["Matteuzzi","C.",""],["Mattioli","K. R.",""],["Mauri","A.",""],["Maurice","E.",""],["Mauricio","J.",""],["Mayencourt","P.",""],["de Cos","J. Mazorra",""],["Mazurek","M.",""],["McCann","M.",""],["Mcconnell","L.",""],["McGrath","T. H.",""],["McHugh","N. T.",""],["McNab","A.",""],["McNulty","R.",""],["Meadows","B.",""],["Meier","G.",""],["Melnychuk","D.",""],["Meng","F. M.",""],["Merk","M.",""],["Merli","A.",""],["Garcia","L. Meyer",""],["Miao","D.",""],["Miao","H.",""],["Mikhasenko","M.",""],["Milanes","D. A.",""],["Minotti","A.",""],["Minucci","E.",""],["Miralles","T.",""],["Mitreska","B.",""],["Mitzel","D. S.",""],["Modak","A.",""],["Mohammed","R. A.",""],["Moise","R. D.",""],["Mokhnenko","S.",""],["Mombächer","T.",""],["Monk","M.",""],["Monteil","S.",""],["Gomez","A. Morcillo",""],["Morello","G.",""],["Morello","M. J.",""],["Morgenthaler","M. P.",""],["Morris","A. B.",""],["Morris","A. G.",""],["Mountain","R.",""],["Mu","H.",""],["Mu","Z. M.",""],["Muhammad","E.",""],["Muheim","F.",""],["Mulder","M.",""],["Müller","K.",""],["Muñoz-Rojas","F.",""],["Murta","R.",""],["Naik","P.",""],["Nakada","T.",""],["Nandakumar","R.",""],["Nanut","T.",""],["Nasteva","I.",""],["Needham","M.",""],["Neri","N.",""],["Neubert","S.",""],["Neufeld","N.",""],["Neustroev","P.",""],["Nicolini","J.",""],["Nicotra","D.",""],["Niel","E. M.",""],["Nikitin","N.",""],["Nogarolli","P.",""],["Nogga","P.",""],["Nolte","N. S.",""],["Normand","C.",""],["Fernandez","J. Novoa",""],["Nowak","G.",""],["Nunez","C.",""],["Nur","H. N.",""],["Oblakowska-Mucha","A.",""],["Obraztsov","V.",""],["Oeser","T.",""],["Okamura","S.",""],["Okhotnikov","A.",""],["Okhrimenko","O.",""],["Oldeman","R.",""],["Oliva","F.",""],["Olocco","M.",""],["Onderwater","C. J. G.",""],["O'Neil","R. H.",""],["Osthues","D.",""],["Goicochea","J. M. Otalora",""],["Owen","P.",""],["Oyanguren","A.",""],["Ozcelik","O.",""],["Padee","A.",""],["Padeken","K. O.",""],["Pagare","B.",""],["Pais","P. R.",""],["Pajero","T.",""],["Palano","A.",""],["Palutan","M.",""],["Panshin","G.",""],["Paolucci","L.",""],["Papanestis","A.",""],["Pappagallo","M.",""],["Pappalardo","L. L.",""],["Pappenheimer","C.",""],["Parkes","C.",""],["Passalacqua","B.",""],["Passaleva","G.",""],["Passaro","D.",""],["Pastore","A.",""],["Patel","M.",""],["Patoc","J.",""],["Patrignani","C.",""],["Paul","A.",""],["Pawley","C. J.",""],["Pellegrino","A.",""],["Peng","J.",""],["Altarelli","M. Pepe",""],["Perazzini","S.",""],["Pereima","D.",""],["Da Costa","H. Pereira",""],["Castro","A. Pereiro",""],["Perret","P.",""],["Perro","A.",""],["Petridis","K.",""],["Petrolini","A.",""],["Pfaller","J. P.",""],["Pham","H.",""],["Pica","L.",""],["Piccini","M.",""],["Pietrzyk","B.",""],["Pietrzyk","G.",""],["Pinci","D.",""],["Pisani","F.",""],["Pizzichemi","M.",""],["Placinta","V.",""],["Casasus","M. Plo",""],["Poeschl","T.",""],["Polci","F.",""],["Lener","M. Poli",""],["Poluektov","A.",""],["Polukhina","N.",""],["Polyakov","I.",""],["Polycarpo","E.",""],["Ponce","S.",""],["Popov","D.",""],["Poslavskii","S.",""],["Prasanth","K.",""],["Prouve","C.",""],["Pugatch","V.",""],["Punzi","G.",""],["Qasim","S.",""],["Qian","Q. Q.",""],["Qian","W.",""],["Qin","N.",""],["Qu","S.",""],["Quagliani","R.",""],["Trejo","R. I. Rabadan",""],["Rademacker","J. H.",""],["Rama","M.",""],["García","M. Ramírez",""],["De Oliveira","V. Ramos",""],["Pernas","M. Ramos",""],["Rangel","M. S.",""],["Ratnikov","F.",""],["Raven","G.",""],["De Miguel","M. Rebollo",""],["Redi","F.",""],["Reich","J.",""],["Reiss","F.",""],["Ren","Z.",""],["Resmi","P. K.",""],["Ribatti","R.",""],["Ricart","G. R.",""],["Riccardi","D.",""],["Ricciardi","S.",""],["Richardson","K.",""],["Richardson-Slipper","M.",""],["Rinnert","K.",""],["Robbe","P.",""],["Robertson","G.",""],["Rodrigues","E.",""],["Fernandez","E. Rodriguez",""],["Lopez","J. A. Rodriguez",""],["Rodriguez","E. Rodriguez",""],["Roensch","J.",""],["Rogovskiy","A.",""],["Rolf","D. L.",""],["Roloff","P.",""],["Romanovskiy","V.",""],["Lamas","M. Romero",""],["Vidal","A. Romero",""],["Romolini","G.",""],["Ronchetti","F.",""],["Rong","T.",""],["Rotondo","M.",""],["Roy","S. R.",""],["Rudolph","M. S.",""],["Diaz","M. Ruiz",""],["Fernandez","R. A. Ruiz",""],["Vidal","J. Ruiz",""],["Ryzhikov","A.",""],["Ryzka","J.",""],["Saavedra-Arias","J. J.",""],["Silva","J. J. Saborido",""],["Sadek","R.",""],["Sagidova","N.",""],["Sahoo","D.",""],["Sahoo","N.",""],["Saitta","B.",""],["Salomoni","M.",""],["Gras","C. Sanchez",""],["Sanderswood","I.",""],["Santacesaria","R.",""],["Rios","C. Santamarina",""],["Santimaria","M.",""],["Santoro","L.",""],["Santovetti","E.",""],["Saputi","A.",""],["Saranin","D.",""],["Sarnatskiy","A. S.",""],["Sarpis","G.",""],["Sarpis","M.",""],["Satriano","C.",""],["Satta","A.",""],["Saur","M.",""],["Savrina","D.",""],["Sazak","H.",""],["Smead","L. G. Scantlebury",""],["Scarabotto","A.",""],["Schael","S.",""],["Scherl","S.",""],["Schiller","M.",""],["Schindler","H.",""],["Schmelling","M.",""],["Schmidt","B.",""],["Schmitt","S.",""],["Schmitz","H.",""],["Schneider","O.",""],["Schopper","A.",""],["Schulte","N.",""],["Schulte","S.",""],["Schune","M. H.",""],["Schwemmer","R.",""],["Schwering","G.",""],["Sciascia","B.",""],["Sciuccati","A.",""],["Sellam","S.",""],["Semennikov","A.",""],["Senger","T.",""],["Soares","M. Senghi",""],["Sergi","A.",""],["Serra","N.",""],["Sestini","L.",""],["Seuthe","A.",""],["Shang","Y.",""],["Shangase","D. M.",""],["Shapkin","M.",""],["Sharma","R. S.",""],["Shchemerov","I.",""],["Shchutska","L.",""],["Shears","T.",""],["Shekhtman","L.",""],["Shen","Z.",""],["Sheng","S.",""],["Shevchenko","V.",""],["Shi","B.",""],["Shi","Q.",""],["Shimizu","Y.",""],["Shmanin","E.",""],["Shorkin","R.",""],["Shupperd","J. D.",""],["Coutinho","R. Silva",""],["Simi","G.",""],["Simone","S.",""],["Skidmore","N.",""],["Skwarnicki","T.",""],["Slater","M. W.",""],["Smallwood","J. C.",""],["Smith","E.",""],["Smith","K.",""],["Smith","M.",""],["Snoch","A.",""],["Lavra","L. Soares",""],["Sokoloff","M. D.",""],["Soler","F. J. P.",""],["Solomin","A.",""],["Solovev","A.",""],["Solovyev","I.",""],["Song","R.",""],["Song","Y.",""],["Song","Y.",""],["Song","Y. S.",""],["De Almeida","F. L. Souza",""],["De Paula","B. Souza",""],["Norella","E. Spadaro",""],["Spedicato","E.",""],["Speer","J. G.",""],["Spiridenkov","E.",""],["Spradlin","P.",""],["Sriskaran","V.",""],["Stagni","F.",""],["Stahl","M.",""],["Stahl","S.",""],["Stanislaus","S.",""],["Stein","E. N.",""],["Steinkamp","O.",""],["Stenyakin","O.",""],["Stevens","H.",""],["Strekalina","D.",""],["Su","Y.",""],["Suljik","F.",""],["Sun","J.",""],["Sun","L.",""],["Sun","Y.",""],["Sundfeld","D.",""],["Sutcliffe","W.",""],["Swallow","P. N.",""],["Swystun","F.",""],["Szabelski","A.",""],["Szumlak","T.",""],["Tan","Y.",""],["Tat","M. D.",""],["Terentev","A.",""],["Terzuoli","F.",""],["Teubert","F.",""],["Thomas","E.",""],["Thompson","D. J. D.",""],["Tilquin","H.",""],["Tisserand","V.",""],["T'Jampens","S.",""],["Tobin","M.",""],["Tomassetti","L.",""],["Tonani","G.",""],["Tong","X.",""],["Machado","D. Torres",""],["Toscano","L.",""],["Tou","D. Y.",""],["Trippl","C.",""],["Tuci","G.",""],["Tuning","N.",""],["Uecker","L. H.",""],["Ukleja","A.",""],["Unverzagt","D. J.",""],["Ursov","E.",""],["Usachov","A.",""],["Ustyuzhanin","A.",""],["Uwer","U.",""],["Vagnoni","V.",""],["Valenti","G.",""],["Canudas","N. Valls",""],["Van Hecke","H.",""],["van Herwijnen","E.",""],["Van Hulse","C. B.",""],["Van Laak","R.",""],["van Veghel","M.",""],["Vasquez","G.",""],["Gomez","R. Vazquez",""],["Regueiro","P. Vazquez",""],["Sierra","C. Vázquez",""],["Vecchi","S.",""],["Velthuis","J. J.",""],["Veltri","M.",""],["Venkateswaran","A.",""],["Vesterinen","M.",""],["Benet","D. Vico",""],["Diaz","M. Vieites",""],["Vilasis-Cardona","X.",""],["Figueras","E. Vilella",""],["Villa","A.",""],["Vincent","P.",""],["Volle","F. C.",""],["Bruch","D. vom",""],["Voropaev","N.",""],["Vos","K.",""],["Vouters","G.",""],["Vrahas","C.",""],["Wagner","J.",""],["Walsh","J.",""],["Walton","E. J.",""],["Wan","G.",""],["Wang","C.",""],["Wang","G.",""],["Wang","J.",""],["Wang","J.",""],["Wang","J.",""],["Wang","J.",""],["Wang","M.",""],["Wang","N. W.",""],["Wang","R.",""],["Wang","X.",""],["Wang","X.",""],["Wang","X. W.",""],["Wang","Y.",""],["Wang","Z.",""],["Wang","Z.",""],["Wang","Z.",""],["Ward","J. A.",""],["Waterlaat","M.",""],["Watson","N. K.",""],["Websdale","D.",""],["Wei","Y.",""],["Wendel","J.",""],["Westhenry","B. D. C.",""],["White","C.",""],["Whitehead","M.",""],["Whiter","E.",""],["Wiederhold","A. R.",""],["Wiedner","D.",""],["Wilkinson","G.",""],["Wilkinson","M. K.",""],["Williams","M.",""],["Williams","M. R. J.",""],["Williams","R.",""],["Williams","Z.",""],["Wilson","F. F.",""],["Wislicki","W.",""],["Witek","M.",""],["Witola","L.",""],["Wong","C. P.",""],["Wormser","G.",""],["Wotton","S. A.",""],["Wu","H.",""],["Wu","J.",""],["Wu","Y.",""],["Wu","Z.",""],["Wyllie","K.",""],["Xian","S.",""],["Xiang","Z.",""],["Xie","Y.",""],["Xu","A.",""],["Xu","J.",""],["Xu","L.",""],["Xu","L.",""],["Xu","M.",""],["Xu","Z.",""],["Xu","Z.",""],["Xu","Z.",""],["Yang","D.",""],["Yang","K.",""],["Yang","S.",""],["Yang","X.",""],["Yang","Y.",""],["Yang","Z.",""],["Yang","Z.",""],["Yeroshenko","V.",""],["Yeung","H.",""],["Yin","H.",""],["Yu","C. Y.",""],["Yu","J.",""],["Yuan","X.",""],["Yuan","Y",""],["Zaffaroni","E.",""],["Zavertyaev","M.",""],["Zdybal","M.",""],["Zeng","C.",""],["Zeng","M.",""],["Zhang","C.",""],["Zhang","D.",""],["Zhang","J.",""],["Zhang","L.",""],["Zhang","S.",""],["Zhang","S.",""],["Zhang","Y.",""],["Zhang","Y. Z.",""],["Zhao","Y.",""],["Zharkova","A.",""],["Zhelezov","A.",""],["Zheng","S. Z.",""],["Zheng","X. Z.",""],["Zheng","Y.",""],["Zhou","T.",""],["Zhou","X.",""],["Zhou","Y.",""],["Zhovkovska","V.",""],["Zhu","L. Z.",""],["Zhu","X.",""],["Zhu","X.",""],["Zhukov","V.",""],["Zhuo","J.",""],["Zou","Q.",""],["Zuliani","D.",""],["Zunica","G.",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 11:03:10 GMT"}],"updateDate":"2024-07-18","timestamp":1721214190000,"abstract":"  The first full amplitude analysis of $B^+ \\to \\psi(2S) K^+ \\pi^+ \\pi^-$\ndecays is performed using proton-proton collision data corresponding to an\nintegrated luminosity of $9\\,\\text{fb}^{-1}$ recorded with the LHCb detector.\nThe rich $K^+ \\pi^+ \\pi^-$ spectrum is studied and the branching fractions of\nthe resonant substructure associated with the prominent $K_1(1270)^+$\ncontribution are measured. The data cannot be described by conventional strange\nand charmonium resonances only. An amplitude model with 53 components is\ndeveloped comprising 11 hidden-charm exotic hadrons. New production mechanisms\nfor charged charmonium-like states are observed. Significant resonant activity\nwith spin-parity $J^P = 1^+$ in the $\\psi(2S) \\pi^+$ system is confirmed and a\nmulti-pole structure is demonstrated. The spectral decomposition of the\n$\\psi(2S) \\pi^+ \\pi^-$ invariant-mass structure, dominated by $X^0 \\to \\psi(2S)\n\\rho(770)^0$ decays, broadly resembles the $J/\\psi \\phi$ spectrum observed in\n$B^+ \\to J/\\psi \\phi K^+$ decays. Exotic $\\psi(2S) K^+ \\pi^-$ resonances are\nobserved for the first time.\n","subjects":["Physics/High Energy Physics - Experiment"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"o5VYHtu1hQ0mN8he9XQUa9G87tspPeYrypkFGPEGV0s","pdfSize":"4718133"}