{"id":"2407.00129","title":"Multimodal Learning and Cognitive Processes in Radiology: MedGaze for\n  Chest X-ray Scanpath Prediction","authors":"Akash Awasthi, Ngan Le, Zhigang Deng, Rishi Agrawal, Carol C. Wu, Hien\n  Van Nguyen","authorsParsed":[["Awasthi","Akash",""],["Le","Ngan",""],["Deng","Zhigang",""],["Agrawal","Rishi",""],["Wu","Carol C.",""],["Van Nguyen","Hien",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 06:38:58 GMT"}],"updateDate":"2024-07-02","timestamp":1719556738000,"abstract":"  Predicting human gaze behavior within computer vision is integral for\ndeveloping interactive systems that can anticipate user attention, address\nfundamental questions in cognitive science, and hold implications for fields\nlike human-computer interaction (HCI) and augmented/virtual reality (AR/VR)\nsystems. Despite methodologies introduced for modeling human eye gaze behavior,\napplying these models to medical imaging for scanpath prediction remains\nunexplored. Our proposed system aims to predict eye gaze sequences from\nradiology reports and CXR images, potentially streamlining data collection and\nenhancing AI systems using larger datasets. However, predicting human scanpaths\non medical images presents unique challenges due to the diverse nature of\nabnormal regions. Our model predicts fixation coordinates and durations\ncritical for medical scanpath prediction, outperforming existing models in the\ncomputer vision community. Utilizing a two-stage training process and large\npublicly available datasets, our approach generates static heatmaps and eye\ngaze videos aligned with radiology reports, facilitating comprehensive\nanalysis. We validate our approach by comparing its performance with\nstate-of-the-art methods and assessing its generalizability among different\nradiologists, introducing novel strategies to model radiologists' search\npatterns during CXR image diagnosis. Based on the radiologist's evaluation,\nMedGaze can generate human-like gaze sequences with a high focus on relevant\nregions over the CXR images. It sometimes also outperforms humans in terms of\nredundancy and randomness in the scanpaths.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"rA5qzeEcQuh-z1aifd8it1aDc9f-owWJsOBTvvFgCRM","pdfSize":"4515158","objectId":"0x4011cc58b4b2c5809698f28d7106af68a7bbc9f9e19cbd334c5a186925200cc4","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
