{"id":"2407.04454","title":"On the characteristics of helium filled nano-pores in amorphous silicon\n  thin films","authors":"Bertrand Lacroix, Asunci\\'on Fern\\'andez, N. C. Pyper, Alex J. W.\n  Thom, and Colm T. Whelan","authorsParsed":[["Lacroix","Bertrand",""],["Fernández","Asunción",""],["Pyper","N. C.",""],["Thom","Alex J. W.",""],["Whelan","Colm T.",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 12:06:56 GMT"}],"updateDate":"2024-07-08","timestamp":1720181216000,"abstract":"  The properties of helium-filled nanopores in amorphous silicon are elucidated\nby combining theoretical knowledge of helium electronic structure with the\nresults of Scanning Transmission electron microscopy/electron energy loss\nspectroscopy (STEM/EELS). Two of the properties determined are the density and\npressure of the confined helium, these being key properties which are needed\nfor application. The experimental data consists, firstly of the shift of the\nhelium 1s^2-> 1s2p(^1P) excitation energy from that of a free atom upon\nentering a condensed phase, and secondly, the intensities of both the\nelastically and inelastically scattered electron beams. Analysis uniting theory\nwith the STEM/EELS measurements for both the helium-filled pores and earlier\nsimilar studies of helium encapsulated as bubbles in solid silicon is combined\nwith fully trustworthy and closely related data for helium in its bulk\ncondensed phases. The non-empirical theory used, containing no free parameters,\nis validated by the excellent agreement between the energy shifts predicted for\nbulk condensed helium with the entirely independently measured values. The\nabove comparisons between the pores and bubbles with the bulk material show\nthat the helium behaviour is essentially the same in all three of these\nenvironments. This means that, although the pressure is clearly temperature\ndependent, the other important properties are governed solely by the helium\ndensity. Although the energy of the electron beam used for the pore\nmeasurements differs from that in the bubble experiments, it is shown that\nscaling the results of either the pore or bubbles results using standard\nscattering theory almost exactly reproduces the experimental results for the\nother system. This provides confirmatory evidence that the behaviour of the\nhelium in the pores is essentially the same as that in the bubbles.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"NkCGkh7moOAdZrpmCRLuEw1WaR6msWs2enzSDln6jDE","pdfSize":"750305"}
