{"id":"2407.07110","title":"Foundation Models for Electrocardiograms","authors":"Junho Song, Jong-Hwan Jang, Byeong Tak Lee, DongGyun Hong, Joon-myoung\n  Kwon, and Yong-Yeon Jo","authorsParsed":[["Song","Junho",""],["Jang","Jong-Hwan",""],["Lee","Byeong Tak",""],["Hong","DongGyun",""],["Kwon","Joon-myoung",""],["Jo","Yong-Yeon",""]],"versions":[{"version":"v1","created":"Wed, 26 Jun 2024 02:24:13 GMT"}],"updateDate":"2024-07-11","timestamp":1719368653000,"abstract":"  Foundation models, enhanced by self-supervised learning (SSL) techniques,\nrepresent a cutting-edge frontier in biomedical signal analysis, particularly\nfor electrocardiograms (ECGs), crucial for cardiac health monitoring and\ndiagnosis. This study conducts a comprehensive analysis of foundation models\nfor ECGs by employing and refining innovative SSL methodologies - namely,\ngenerative and contrastive learning - on a vast dataset of over 1.1 million ECG\nsamples. By customizing these methods to align with the intricate\ncharacteristics of ECG signals, our research has successfully developed\nfoundation models that significantly elevate the precision and reliability of\ncardiac diagnostics. These models are adept at representing the complex, subtle\nnuances of ECG data, thus markedly enhancing diagnostic capabilities. The\nresults underscore the substantial potential of SSL-enhanced foundation models\nin clinical settings and pave the way for extensive future investigations into\ntheir scalable applications across a broader spectrum of medical diagnostics.\nThis work sets a benchmark in the ECG field, demonstrating the profound impact\nof tailored, data-driven model training on the efficacy and accuracy of medical\ndiagnostics.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7yJPJaR0MbnT-R3Mflu-37FzimvSyGMLLaCbivdKhPc","pdfSize":"1807563"}