{"id":"2407.05116","title":"Automatic Prediction of the Performance of Every Parser","authors":"Ergun Bi\\c{c}ici","authorsParsed":[["Biçici","Ergun",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 15:49:24 GMT"}],"updateDate":"2024-07-09","timestamp":1720280964000,"abstract":"  We present a new parser performance prediction (PPP) model using machine\ntranslation performance prediction system (MTPPS), statistically independent of\nany language or parser, relying only on extrinsic and novel features based on\ntextual, link structural, and bracketing tree structural information. This new\nsystem, MTPPS-PPP, can predict the performance of any parser in any language\nand can be useful for estimating the grammatical difficulty when understanding\na given text, for setting expectations from parsing output, for parser\nselection for a specific domain, and for parser combination systems. We obtain\nSoA results in PPP of bracketing $F_1$ with better results over textual\nfeatures and similar performance with previous results that use parser and\nlinguistic label specific information. Our results show the contribution of\ndifferent types of features as well as rankings of individual features in\ndifferent experimental settings (cased vs. uncased), in different learning\ntasks (in-domain vs. out-of-domain), with different training sets, with\ndifferent learning algorithms, and with different dimensionality reduction\ntechniques. We achieve $0.0678$ MAE and $0.85$ RAE in setting +Link, which\ncorresponds to about $7.4\\%$ error when predicting the bracketing $F_1$ score\nfor the Charniak and Johnson parser on the WSJ23 test set. MTPPS-PPP system can\npredict without parsing using only the text, without a supervised parser using\nonly an unsupervised parser, without any parser or language dependent\ninformation, without using a reference parser output, and can be used to\npredict the performance of any parser in any language.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Ett9zKQgdanNqmXqraRvUnHTW0exJgHVEQgFrolrA-Q","pdfSize":"500052"}