{"id":"2407.19965","title":"Simply Trainable Nearest Neighbour Machine Translation with GPU\n  Inference","authors":"Hossam Amer, Abdelrahman Abouelenin, Mohamed Maher, Evram Narouz,\n  Mohamed Afify, and Hany Awadallah","authorsParsed":[["Amer","Hossam",""],["Abouelenin","Abdelrahman",""],["Maher","Mohamed",""],["Narouz","Evram",""],["Afify","Mohamed",""],["Awadallah","Hany",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 12:55:40 GMT"},{"version":"v2","created":"Mon, 19 Aug 2024 08:48:59 GMT"}],"updateDate":"2024-08-20","timestamp":1722257740000,"abstract":"  Nearest neighbor machine translation is a successful approach for fast domain\nadaption, which interpolates the pre-trained transformers with domain-specific\ntoken-level k-nearest-neighbor (kNN) retrieval without retraining. Despite kNN\nMT's success, searching large reference corpus and fixed interpolation between\nthe kNN and pre-trained model led to computational complexity and translation\nquality challenges. Among other papers, Dai et al. proposed methods to obtain a\nsmall number of reference samples dynamically for which they introduced a\ndistance-aware interpolation method using an equation that includes free\nparameters. This paper proposes a simply trainable nearest neighbor machine\ntranslation and carry out inference experiments on GPU. Similar to Dai et al.,\nwe first adaptively construct a small datastore for each input sentence.\nSecond, we train a single-layer network for the interpolation coefficient\nbetween the knnMT and pre-trained result to automatically interpolate in\ndifferent domains. Experimental results on different domains show that our\nproposed method either improves or sometimes maintain the translation quality\nof methods in Dai et al. while being automatic. In addition, our GPU inference\nresults demonstrate that knnMT can be integrated into GPUs with a drop of only\n5% in terms of speed.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"fsf0Tv-SxJQoiYj4EpPttdOZl5CS_Bx2dVR9wyOy5SQ","pdfSize":"117612"}