{"id":"2407.12767","title":"Helical Spin Dynamics in Commensurate Magnets: a Study on Brochantite,\n  Cu$_4$SO$_4$(OH)$_6$","authors":"S. E. Nikitin, Tao Xie, A. Gazizulina, B. Ouladdiaf, J. A. Rodr\\'iguez\n  Velamaz\\'an, I.~F.~D\\'iaz-Ortega, H. Nojiri, L. M. Anovitz, A. M. dos Santos,\n  O. Prokhnenko, and A. Podlesnyak","authorsParsed":[["Nikitin","S. E.",""],["Xie","Tao",""],["Gazizulina","A.",""],["Ouladdiaf","B.",""],["Velamazán","J. A. Rodríguez",""],["~Díaz-Ortega","I. ~F.",""],["Nojiri","H.",""],["Anovitz","L. M.",""],["Santos","A. M. dos",""],["Prokhnenko","O.",""],["Podlesnyak","A.",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 17:46:04 GMT"}],"updateDate":"2024-07-18","timestamp":1721238364000,"abstract":"  We report the direct observation of a commensurate-ordered antiferromagnetic\n(AFM) state but incommensurate helical spin dynamics in the natural mineral\nbrochantite Cu$_4$SO$_4$(OH)$_6$ through neutron diffraction and neutron\nspectroscopy measurements. Inelastic neutron scattering measurements reveal\nmagnon-like excitations with considerable dispersion along the c-axis and\nalmost flat branches in other principal directions, indicating the strong\none-dimensional character of the magnetic correlations. We experimentally\nobserve the effect of the uniform Dzyaloshinskii-Moriya (DM) interaction, which\nelevates the degeneracy of the spin-wave modes shifting them in opposite\ndirections in reciprocal space. The system has a commensurate AFM ground state,\nstabilized by the anisotropic symmetric Heisenberg exchange interactions, and\nquasi-one-dimensional chiral spin dynamics due to the antisymmetric DM\ninteraction. Employing linear spin-wave theory, we were able to construct an\neffective Heisenberg Hamiltonian. We quantify both the symmetric exchange\nparameters and the DM vector components in Cu$_4$SO$_4$(OH)$_6$ and determine\nthe mechanism of the magnetic frustration. Our work provides detailed insights\ninto the complex dynamics of the spin chain in the presence of uniform DM\ninteraction.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"jzY4tp2tDYnsiCOBs_Ib5fbFSeVFXdRPpGsvxYJd0nE","pdfSize":"3237664","objectId":"0x4303b0e7b6f6065494302289f9a4817386728e0e6c49d3a90994b35802a93ba5","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
