{"id":"2407.09950","title":"PSO Fuzzy XGBoost Classifier Boosted with Neural Gas Features on EEG\n  Signals in Emotion Recognition","authors":"Seyed Muhammad Hossein Mousavi","authorsParsed":[["Mousavi","Seyed Muhammad Hossein",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 17:15:23 GMT"},{"version":"v2","created":"Fri, 30 Aug 2024 21:17:11 GMT"}],"updateDate":"2024-09-04","timestamp":1720890923000,"abstract":"  Emotion recognition is the technology-driven process of identifying and\ncategorizing human emotions from various data sources, such as facial\nexpressions, voice patterns, body motion, and physiological signals, such as\nEEG. These physiological indicators, though rich in data, present challenges\ndue to their complexity and variability, necessitating sophisticated feature\nselection and extraction methods. NGN, an unsupervised learning algorithm,\neffectively adapts to input spaces without predefined grid structures,\nimproving feature extraction from physiological data. Furthermore, the\nincorporation of fuzzy logic enables the handling of fuzzy data by introducing\nreasoning that mimics human decision-making. The combination of PSO with\nXGBoost aids in optimizing model performance through efficient hyperparameter\ntuning and decision process optimization. This study explores the integration\nof Neural-Gas Network (NGN), XGBoost, Particle Swarm Optimization (PSO), and\nfuzzy logic to enhance emotion recognition using physiological signals. Our\nresearch addresses three critical questions concerning the improvement of\nXGBoost with PSO and fuzzy logic, NGN's effectiveness in feature selection, and\nthe performance comparison of the PSO-fuzzy XGBoost classifier with standard\nbenchmarks. Acquired results indicate that our methodologies enhance the\naccuracy of emotion recognition systems and outperform other feature selection\ntechniques using the majority of classifiers, offering significant implications\nfor both theoretical advancement and practical application in emotion\nrecognition technology.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Neural and Evolutionary Computing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"yYC4uhZvJN0SVGkbQv9LUXOSQgJRgo8FOxb2Yxruvlk","pdfSize":"1101416"}