{"id":"2407.12553","title":"End-to-end Stroke imaging analysis, using reservoir computing-based\n  effective connectivity, and interpretable Artificial intelligence","authors":"Wojciech Ciezobka, Joan Falco-Roget, Cemal Koba, Alessandro Crimi","authorsParsed":[["Ciezobka","Wojciech",""],["Falco-Roget","Joan",""],["Koba","Cemal",""],["Crimi","Alessandro",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 13:34:05 GMT"}],"updateDate":"2024-07-18","timestamp":1721223245000,"abstract":"  In this paper, we propose a reservoir computing-based and directed graph\nanalysis pipeline. The goal of this pipeline is to define an efficient brain\nrepresentation for connectivity in stroke data derived from magnetic resonance\nimaging. Ultimately, this representation is used within a directed graph\nconvolutional architecture and investigated with explainable artificial\nintelligence (AI) tools.\n  Stroke is one of the leading causes of mortality and morbidity worldwide, and\nit demands precise diagnostic tools for timely intervention and improved\npatient outcomes. Neuroimaging data, with their rich structural and functional\ninformation, provide a fertile ground for biomarker discovery. However, the\ncomplexity and variability of information flow in the brain requires advanced\nanalysis, especially if we consider the case of disrupted networks as those\ngiven by the brain connectome of stroke patients. To address the needs given by\nthis complex scenario we proposed an end-to-end pipeline. This pipeline begins\nwith reservoir computing causality, to define effective connectivity of the\nbrain. This allows directed graph network representations which have not been\nfully investigated so far by graph convolutional network classifiers. Indeed,\nthe pipeline subsequently incorporates a classification module to categorize\nthe effective connectivity (directed graphs) of brain networks of patients\nversus matched healthy control. The classification led to an area under the\ncurve of 0.69 with the given heterogeneous dataset. Thanks to explainable\ntools, an interpretation of disrupted networks across the brain networks was\npossible. This elucidates the effective connectivity biomarker's contribution\nto stroke classification, fostering insights into disease mechanisms and\ntreatment responses.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"P6oQmHxYQDCHdKe0SzsIeTHNJ0HiX-NmEe2yu81M4eA","pdfSize":"6629350"}