{"id":"2407.06136","title":"Mamba-FSCIL: Dynamic Adaptation with Selective State Space Model for\n  Few-Shot Class-Incremental Learning","authors":"Xiaojie Li, Yibo Yang, Jianlong Wu, Bernard Ghanem, Liqiang Nie, Min\n  Zhang","authorsParsed":[["Li","Xiaojie",""],["Yang","Yibo",""],["Wu","Jianlong",""],["Ghanem","Bernard",""],["Nie","Liqiang",""],["Zhang","Min",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 17:09:39 GMT"},{"version":"v2","created":"Wed, 21 Aug 2024 15:32:26 GMT"}],"updateDate":"2024-08-22","timestamp":1720458579000,"abstract":"  Few-shot class-incremental learning (FSCIL) confronts the challenge of\nintegrating new classes into a model with minimal training samples while\npreserving the knowledge of previously learned classes. Traditional methods\nwidely adopt static adaptation relying on a fixed parameter space to learn from\ndata that arrive sequentially, prone to overfitting to the current session.\nExisting dynamic strategies require the expansion of the parameter space\ncontinually, leading to increased complexity. In this study, we explore the\npotential of Selective State Space Models (SSMs) for FSCIL, leveraging its\ndynamic weights and strong ability in sequence modeling to address these\nchallenges. Concretely, we propose a dual selective SSM projector that\ndynamically adjusts the projection parameters based on the intermediate\nfeatures for dynamic adaptation. The dual design enables the model to maintain\nthe robust features of base classes, while adaptively learning distinctive\nfeature shifts for novel classes. Additionally, we develop a class-sensitive\nselective scan mechanism to guide dynamic adaptation. It minimizes the\ndisruption to base-class representations caused by training on novel data, and\nmeanwhile, forces the selective scan to perform in distinct patterns between\nbase and novel classes. Experiments on miniImageNet, CUB-200, and CIFAR-100\ndemonstrate that our framework outperforms the existing state-of-the-art\nmethods. The code is available at\n\\url{https://github.com/xiaojieli0903/Mamba-FSCIL}.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"xaBewfX2aZgQFZbnltA-jqlAH8lx12yqRO5_ZeJjoEw","pdfSize":"4511557"}