{"id":"2407.00229","title":"SemUV: Deep Learning based semantic manipulation over UV texture map of\n  virtual human heads","authors":"Anirban Mukherjee, Venkat Suprabath Bitra, Vignesh Bondugula, Tarun\n  Reddy Tallapureddy and Dinesh Babu Jayagopi","authorsParsed":[["Mukherjee","Anirban",""],["Bitra","Venkat Suprabath",""],["Bondugula","Vignesh",""],["Tallapureddy","Tarun Reddy",""],["Jayagopi","Dinesh Babu",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 20:58:59 GMT"}],"updateDate":"2024-07-02","timestamp":1719608339000,"abstract":"  Designing and manipulating virtual human heads is essential across various\napplications, including AR, VR, gaming, human-computer interaction and VFX.\nTraditional graphic-based approaches require manual effort and resources to\nachieve accurate representation of human heads. While modern deep learning\ntechniques can generate and edit highly photorealistic images of faces, their\nfocus remains predominantly on 2D facial images. This limitation makes them\nless suitable for 3D applications. Recognizing the vital role of editing within\nthe UV texture space as a key component in the 3D graphics pipeline, our work\nfocuses on this aspect to benefit graphic designers by providing enhanced\ncontrol and precision in appearance manipulation. Research on existing methods\nwithin the UV texture space is limited, complex, and poses challenges. In this\npaper, we introduce SemUV: a simple and effective approach using the FFHQ-UV\ndataset for semantic manipulation directly within the UV texture space. We\ntrain a StyleGAN model on the publicly available FFHQ-UV dataset, and\nsubsequently train a boundary for interpolation and semantic feature\nmanipulation. Through experiments comparing our method with 2D manipulation\ntechnique, we demonstrate its superior ability to preserve identity while\neffectively modifying semantic features such as age, gender, and facial hair.\nOur approach is simple, agnostic to other 3D components such as structure,\nlighting, and rendering, and also enables seamless integration into standard 3D\ngraphics pipelines without demanding extensive domain expertise, time, or\nresources.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"AyC6gAcNXwdSL98gLWzJTV7KUpYHw05-lB1v99lm9GM","pdfSize":"5234338"}