{"id":"2407.11686","title":"CCoE: A Compact LLM with Collaboration of Experts","authors":"Shaomang Huang, Jianfeng Pan, Hanzhong Zheng","authorsParsed":[["Huang","Shaomang",""],["Pan","Jianfeng",""],["Zheng","Hanzhong",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 13:03:58 GMT"},{"version":"v2","created":"Wed, 17 Jul 2024 02:26:12 GMT"},{"version":"v3","created":"Thu, 25 Jul 2024 03:34:56 GMT"}],"updateDate":"2024-07-26","timestamp":1721135038000,"abstract":"  In the domain of Large Language Model (LLM), LLMs demonstrate significant\ncapabilities in natural language understanding and generation. With the growing\nneeds of applying LLMs on various domains, it is a research question that how\nto efficiently train and build a model that has expertise in different domains\nbut with a low training cost. We propose CCoE architecture, a framework of\neasily coupling multiple strong domain experts together to fuse into a big LLM,\nprovides a collective way of utilizing the different domain expert LLMs.\nBesides, training a large collaborative of multiple expert LLMs requires a high\nrequirements on training sources. CCoE bypasses this problem through isolating\nother experts and train each expert separately. The design of CCoE assembles\nmultiple expert LLMs through the CoE (Collaboration of Experts) layer. Each CoE\nlayer could have one or more expert LLMs. Expert LLMs have different number of\nlayers and have been well-trained for different domain tasks. Each expert is\nfine-tuned to be able to achieve the comparable results with SOTA domain LLMs.\nWe start from 5 experts in the domain of Code, Math, Law, text-to-SQL and\nMedical. The results indicate that our CCoE framework can easily and\nefficiently boost nearly 10%-20% performance on original base model in\ndifferent domains but using less resources on training, as well as inference.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"3UE2g2MVeom2og_-_Rr-3AB69mwxUYOUOAkOUIj2eNQ","pdfSize":"568044"}