{"id":"2407.03144","title":"Venomancer: Towards Imperceptible and Target-on-Demand Backdoor Attacks\n  in Federated Learning","authors":"Son Nguyen, Thinh Nguyen, Khoa D Doan, and Kok-Seng Wong","authorsParsed":[["Nguyen","Son",""],["Nguyen","Thinh",""],["Doan","Khoa D",""],["Wong","Kok-Seng",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 14:22:51 GMT"},{"version":"v2","created":"Thu, 11 Jul 2024 06:29:06 GMT"}],"updateDate":"2024-07-12","timestamp":1720016571000,"abstract":"  Federated Learning (FL) is a distributed machine learning approach that\nmaintains data privacy by training on decentralized data sources. Similar to\ncentralized machine learning, FL is also susceptible to backdoor attacks, where\nan attacker can compromise some clients by injecting a backdoor trigger into\nlocal models of those clients, leading to the global model's behavior being\nmanipulated as desired by the attacker. Most backdoor attacks in FL assume a\npredefined target class and require control over a large number of clients or\nknowledge of benign clients' information. Furthermore, they are not\nimperceptible and are easily detected by human inspection due to clear\nartifacts left on the poison data. To overcome these challenges, we propose\nVenomancer, an effective backdoor attack that is imperceptible and allows\ntarget-on-demand. Specifically, imperceptibility is achieved by using a visual\nloss function to make the poison data visually indistinguishable from the\noriginal data. Target-on-demand property allows the attacker to choose\narbitrary target classes via conditional adversarial training. Additionally,\nexperiments showed that the method is robust against state-of-the-art defenses\nsuch as Norm Clipping, Weak DP, Krum, Multi-Krum, RLR, FedRAD, Deepsight, and\nRFLBAT. The source code is available at\nhttps://github.com/nguyenhongson1902/Venomancer.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"9Lze_t3RXCg5LEu1GsUlng8Qz83H53SA6hl8T0yjj1M","pdfSize":"3116596"}