{"id":"2407.18754","title":"Deep learning interpretable analysis for carbon star identification in\n  Gaia DR3","authors":"Shuo Ye, Wen-Yuan Cui, Yin-Bi Li, A-Li Luo, R.A. Hugh Jones","authorsParsed":[["Ye","Shuo",""],["Cui","Wen-Yuan",""],["Li","Yin-Bi",""],["Luo","A-Li",""],["Jones","R. A. Hugh",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 14:09:04 GMT"}],"updateDate":"2024-07-29","timestamp":1722002944000,"abstract":"  Context. A large fraction of Asymptotic Giant Branch (AGB) stars develop\ncarbon-rich atmospheres during their evolution. Based on their color and\nluminosity, these carbon stars can be easily distinguished from many other\nkinds of stars. However, a large number of G, K, and M giants are also\ndistributed in the same region as carbon stars on the HR diagram. Their spectra\nhave differences,especially in the prominent CN molecular bands. Aims. We aim\nto distinguish carbon stars from other kinds of stars using Gaia's XP spectra,\nwhile providing attribution explanations of key features necessary for\nidentification, and even discovering additional new spectral key features.\nMethods. We proposed a classification model named `GaiaNet', an improved\none-dimensional convolutional neural network specifically designed for handling\nGaia's XP spectra. We utilized the SHAP interpretability model to calculate the\nSHAP value for each feature point in a spectrum, enabling us to explain the\noutput of the `GaiaNet' model and provide further meaningful analysis Results.\nCompared to four traditional machine-learning methods, the `GaiaNet' model\nexhibits an average classification accuracy improvement of approximately 0.3%\non the validation set, with the highest accuracy even reaching 100%. Utilizing\nthe SHAP algorithm, we present a clear spectroscopic heatmap highlighting\nmolecular band absorption features primarily distributed mainly around CN773.3\nand CN895.0, and summarize five crucial feature regions for carbon star\nidentification. Upon applying the trained classification model to the CSTAR\nsample with Gaia `xp_sampled_mean' spectra, we obtained 451 new candidate\ncarbon stars as a by-product.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/Astrophysics of Galaxies","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"b4waR2slsnusetO1BEwhD-zMnrcpQFLSH-Ur_xGrfJw","pdfSize":"6800258","objectId":"0x03d59c882fe6da14bbaed15589edc23ac5882fe7a5bfe2dcebde3ee4beb9fd4b","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
