{"id":"2407.05736","title":"TransMA: an explainable multi-modal deep learning model for predicting\n  properties of ionizable lipid nanoparticles in mRNA delivery","authors":"Kun Wu, Zixu Wang, Xiulong Yang, Yangyang Chen, Zhenqi Han, Jialu\n  Zhang, Lizhuang Liu","authorsParsed":[["Wu","Kun",""],["Wang","Zixu",""],["Yang","Xiulong",""],["Chen","Yangyang",""],["Han","Zhenqi",""],["Zhang","Jialu",""],["Liu","Lizhuang",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 08:43:32 GMT"}],"updateDate":"2024-07-09","timestamp":1720428212000,"abstract":"  As the primary mRNA delivery vehicles, ionizable lipid nanoparticles (LNPs)\nexhibit excellent safety, high transfection efficiency, and strong immune\nresponse induction. However, the screening process for LNPs is time-consuming\nand costly. To expedite the identification of high-transfection-efficiency mRNA\ndrug delivery systems, we propose an explainable LNPs transfection efficiency\nprediction model, called TransMA. TransMA employs a multi-modal molecular\nstructure fusion architecture, wherein the fine-grained atomic spatial\nrelationship extractor named molecule 3D Transformer captures three-dimensional\nspatial features of the molecule, and the coarse-grained atomic sequence\nextractor named molecule Mamba captures one-dimensional molecular features. We\ndesign the mol-attention mechanism block, enabling it to align coarse and\nfine-grained atomic features and captures relationships between atomic spatial\nand sequential structures. TransMA achieves state-of-the-art performance in\npredicting transfection efficiency using the scaffold and cliff data splitting\nmethods on the current largest LNPs dataset, including Hela and RAW cell lines.\nMoreover, we find that TransMA captures the relationship between subtle\nstructural changes and significant transfection efficiency variations,\nproviding valuable insights for LNPs design. Additionally, TransMA's\npredictions on external transfection efficiency data maintain a consistent\norder with actual transfection efficiencies, demonstrating its robust\ngeneralization capability. The code, model and data are made publicly available\nat https://github.com/wklix/TransMA/tree/master. We hope that high-accuracy\ntransfection prediction models in the future can aid in LNPs design and initial\nscreening, thereby assisting in accelerating the mRNA design process.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_zZtX7IccJAoY8ehpNbik65jLnf2qiVBeGg_3OYwb2g","pdfSize":"16688613"}
