{"id":"2407.15125","title":"The dark side of the metaverse: The role of gamification in event\n  virtualization","authors":"Carlos Flavian, Sergio Ibanez-Sanchez, Carlos Orus and Sergio Barta","authorsParsed":[["Flavian","Carlos",""],["Ibanez-Sanchez","Sergio",""],["Orus","Carlos",""],["Barta","Sergio",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 11:31:12 GMT"}],"updateDate":"2024-07-23","timestamp":1721561472000,"abstract":"  The virtualization of cultural events in the metaverse creates opportunities\nto generate valuable and innovative experiences that replicate and extend\nin-person events; but the process faces associated challenges. In the absence\nof relevant empirical studies, the aim of this article is to analyze the\npositive and negative aspects of the user experience in a cultural event held\nin the metaverse. A mixed-methods approach is employed to test the proposed\nhypotheses. The results from three focus groups demonstrated the difficulty\nthat users face in focusing their attention on the main elements of the\nmetaverse, and the inability of this virtual sphere to convey the authenticity\nof a cultural event. Based on these findings, a metaverse-focused quantitative\nstudy was conducted to examine whether perceived gamification mitigate the\nnegative effects of users failing to pay attention in their metaverse\nexperiences. When users increased their attention levels, their ability to\nimagine the real experience and their perceptions of the authenticity of the\ncultural event increased, which produced positive behavioral intentions. This\nis one of the first studies to empirically analyze the tourist experience in\nthe metaverse; managers and policymakers can benefit from the results to hold\nvaluable virtual cultural events.\n","subjects":["Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"mN2pOjOhyxg_b6dOprMtnOonpl8oPqihQPPmtzlVMt4","pdfSize":"1218872","objectId":"0x82d034d83593c3140e42532b4646d46addc9ca6bbd794d6641f69a59820c8ff9","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
