{"id":"2407.05450","title":"Understanding Professional Needs to Create Privacy-Preserving and Secure\n  Emergent Digital Artworks","authors":"Kathryn Lichlyter, Urvashi Kishnani, Kate Hollenbach, Sanchari Das","authorsParsed":[["Lichlyter","Kathryn",""],["Kishnani","Urvashi",""],["Hollenbach","Kate",""],["Das","Sanchari",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 17:21:38 GMT"}],"updateDate":"2024-07-09","timestamp":1720372898000,"abstract":"  In recent years, immersive art installations featuring interactive artworks\nhave been on the rise. These installations are an integral part of museums and\nart centers like selfie museums, teamLab Borderless, ARTECHOUSE, and Meow Wolf.\nMoreover, immersive art have also been increasingly incorporated into\ntraditional museums as well. However, immersive art requires active user\nparticipation and often captures information from viewers and participants\nthrough cameras, sensors, microphones, embodied interaction devices,\nsurveillance, and kinetic mirrors. Therefore, we propose a new line of research\nto examine the security and privacy postures of immersive artworks. In our\npilot study, we conducted a semi-structured interview with five experienced\npractitioners from either the art (2) or cybersecurity (3) fields. Our aim was\nto understand their current security and privacy practices, along with their\nneeds when it comes to immersive art. From their responses, we created a list\nof security and privacy parameters, such as, providing opt-in mechanics for\ndata collection, knowledge of data collection tools such as proximity sensors,\nand creating security awareness amongst participants by communicating security\nprotocols and threat models. These parameters allow us to build\nprivacy-preserving, secure, and accessible software for individuals working in\nmedia arts, who often have no background on security and privacy. In the\nfuture, we plan to utilize these parameters to develop software in response to\nthose needs and then host an art exhibition of immersive artworks utilizing the\nplatform.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"xLy-UxLLH8k3k-TPpcOhWmDOUqXe7GBDQyMfe0C83M4","pdfSize":"108928"}
