{"id":"2407.15383","title":"Is user feedback always informative? Retrieval Latent Defending for\n  Semi-Supervised Domain Adaptation without Source Data","authors":"Junha Song and Tae Soo Kim and Junha Kim and Gunhee Nam and Thijs Kooi\n  and Jaegul Choo","authorsParsed":[["Song","Junha",""],["Kim","Tae Soo",""],["Kim","Junha",""],["Nam","Gunhee",""],["Kooi","Thijs",""],["Choo","Jaegul",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 05:15:41 GMT"}],"updateDate":"2024-07-23","timestamp":1721625341000,"abstract":"  This paper aims to adapt the source model to the target environment,\nleveraging small user feedback (i.e., labeled target data) readily available in\nreal-world applications. We find that existing semi-supervised domain\nadaptation (SemiSDA) methods often suffer from poorly improved adaptation\nperformance when directly utilizing such feedback data, as shown in Figure 1.\nWe analyze this phenomenon via a novel concept called Negatively Biased\nFeedback (NBF), which stems from the observation that user feedback is more\nlikely for data points where the model produces incorrect predictions. To\nleverage this feedback while avoiding the issue, we propose a scalable adapting\napproach, Retrieval Latent Defending. This approach helps existing SemiSDA\nmethods to adapt the model with a balanced supervised signal by utilizing\nlatent defending samples throughout the adaptation process. We demonstrate the\nproblem caused by NBF and the efficacy of our approach across various\nbenchmarks, including image classification, semantic segmentation, and a\nreal-world medical imaging application. Our extensive experiments reveal that\nintegrating our approach with multiple state-of-the-art SemiSDA methods leads\nto significant performance improvements.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8qJViwQvceJDZRArWyzwj4R9ijJ6N1mFh2wxsa5NuCE","pdfSize":"10852352"}