{"id":"2407.07912","title":"ITEM: Improving Training and Evaluation of Message-Passing based GNNs\n  for top-k recommendation","authors":"Yannis Karmim and Elias Ramzi and Rapha\\\"el Fournier-S'niehotta and\n  Nicolas Thome","authorsParsed":[["Karmim","Yannis",""],["Ramzi","Elias",""],["Fournier-S'niehotta","Raphaël",""],["Thome","Nicolas",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 13:35:23 GMT"}],"updateDate":"2024-07-12","timestamp":1720013723000,"abstract":"  Graph Neural Networks (GNNs), especially message-passing-based models, have\nbecome prominent in top-k recommendation tasks, outperforming matrix\nfactorization models due to their ability to efficiently aggregate information\nfrom a broader context. Although GNNs are evaluated with ranking-based metrics,\ne.g NDCG@k and Recall@k, they remain largely trained with proxy losses, e.g the\nBPR loss. In this work we explore the use of ranking loss functions to directly\noptimize the evaluation metrics, an area not extensively investigated in the\nGNN community for collaborative filtering. We take advantage of smooth\napproximations of the rank to facilitate end-to-end training of GNNs and\npropose a Personalized PageRank-based negative sampling strategy tailored for\nranking loss functions. Moreover, we extend the evaluation of GNN models for\ntop-k recommendation tasks with an inductive user-centric protocol, providing a\nmore accurate reflection of real-world applications. Our proposed method\nsignificantly outperforms the standard BPR loss and more advanced losses across\nfour datasets and four recent GNN architectures while also exhibiting faster\ntraining. Demonstrating the potential of ranking loss functions in improving\nGNN training for collaborative filtering tasks.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7ENpcj0QndiVWqR6342XQjFMpxqkkdDH9HvxYKvDKqA","pdfSize":"3582191","objectId":"0x9cef4e01820921f2385d3775dcda99b8c10b90ff554b41b27424a7a883cd98fc","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
