{"id":"2407.16917","title":"TelescopeML -- I. An End-to-End Python Package for Interpreting\n  Telescope Datasets through Training Machine Learning Models, Generating\n  Statistical Reports, and Visualizing Results","authors":"Ehsan (Sam) Gharib-Nezhad, Natasha E. Batalha, Hamed Valizadegan,\n  Miguel J. S. Martinho, Mahdi Habibi, and Gopal Nookula","authorsParsed":[["Ehsan","","","Sam"],["Gharib-Nezhad","",""],["Batalha","Natasha E.",""],["Valizadegan","Hamed",""],["Martinho","Miguel J. S.",""],["Habibi","Mahdi",""],["Nookula","Gopal",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 00:44:52 GMT"}],"updateDate":"2024-07-25","timestamp":1721781892000,"abstract":"  We are on the verge of a revolutionary era in space exploration, thanks to\nadvancements in telescopes such as the James Webb Space Telescope\n(\\textit{JWST}). High-resolution, high signal-to-noise spectra from exoplanet\nand brown dwarf atmospheres have been collected over the past few decades,\nrequiring the development of accurate and reliable pipelines and tools for\ntheir analysis. Accurately and swiftly determining the spectroscopic parameters\nfrom the observational spectra of these objects is crucial for understanding\ntheir atmospheric composition and guiding future follow-up observations.\n\\texttt{TelescopeML} is a Python package developed to perform three main tasks:\n1. Process the synthetic astronomical datasets for training a CNN model and\nprepare the observational dataset for later use for prediction; 2. Train a CNN\nmodel by implementing the optimal hyperparameters; and 3. Deploy the trained\nCNN models on the actual observational data to derive the output spectroscopic\nparameters.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/Earth and Planetary Astrophysics","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Gz28N0mfvDl63ZpSnlFcOTc0C_2QbNBLtzRONqd-Oas","pdfSize":"2146261"}