{"id":"2407.09260","title":"Evaluation of Encoding Schemes on Ubiquitous Sensor Signal for Spiking\n  Neural Network","authors":"Sizhen Bian and Elisa Donati and Michele Magno","authorsParsed":[["Bian","Sizhen",""],["Donati","Elisa",""],["Magno","Michele",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 13:42:41 GMT"}],"updateDate":"2024-07-15","timestamp":1720791761000,"abstract":"  Spiking neural networks (SNNs), a brain-inspired computing paradigm, are\nemerging for their inference performance, particularly in terms of energy\nefficiency and latency attributed to the plasticity in signal processing. To\ndeploy SNNs in ubiquitous computing systems, signal encoding of sensors is\ncrucial for achieving high accuracy and robustness. Using inertial sensor\nreadings for gym activity recognition as a case study, this work\ncomprehensively evaluates four main encoding schemes and deploys the\ncorresponding SNN on the neuromorphic processor Loihi2 for post-deployment\nencoding assessment. Rate encoding, time-to-first-spike encoding, binary\nencoding, and delta modulation are evaluated using metrics like average fire\nrate, signal-to-noise ratio, classification accuracy, robustness, and inference\nlatency and energy. In this case study, the time-to-first-spike encoding\nrequired the lowest firing rate (2%) and achieved a comparative accuracy (89%),\nalthough it was the least robust scheme against error spikes (over 20% accuracy\ndrop with 0.1 noisy spike rate). Rate encoding with optimal\nvalue-to-probability mapping achieved the highest accuracy (91.7%). Binary\nencoding provided a balance between information reconstruction and noise\nresistance. Multi-threshold delta modulation showed the best robustness, with\nonly a 0.7% accuracy drop at a 0.1 noisy spike rate. This work serves\nresearchers in selecting the best encoding scheme for SNN-based ubiquitous\nsensor signal processing, tailored to specific performance requirements.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"DcvWleggADjbVhu5Hzd9YBy9wyiOE-OWMOKRCMHSmgI","pdfSize":"1054302"}