{"id":"2407.14737","title":"Early Detection of Coffee Leaf Rust Through Convolutional Neural\n  Networks Trained on Low-Resolution Images","authors":"Angelly Cabrera, Kleanthis Avramidis, Shrikanth Narayanan","authorsParsed":[["Cabrera","Angelly",""],["Avramidis","Kleanthis",""],["Narayanan","Shrikanth",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 03:24:25 GMT"}],"updateDate":"2024-07-23","timestamp":1721445865000,"abstract":"  Coffee leaf rust, a foliar disease caused by the fungus Hemileia vastatrix,\nposes a major threat to coffee production, especially in Central America.\nClimate change further aggravates this issue, as it shortens the latency period\nbetween initial infection and the emergence of visible symptoms in diseases\nlike leaf rust. Shortened latency periods can lead to more severe plant\nepidemics and faster spread of diseases. There is, hence, an urgent need for\neffective disease management strategies. To address these challenges, we\nexplore the potential of deep learning models for enhancing early disease\ndetection. However, deep learning models require extensive processing power and\nlarge amounts of data for model training, resources that are typically scarce.\nTo overcome these barriers, we propose a preprocessing technique that involves\nconvolving training images with a high-pass filter to enhance lesion-leaf\ncontrast, significantly improving model efficacy in resource-limited\nenvironments. This method and our model demonstrated a strong performance,\nachieving over 90% across all evaluation metrics--including precision, recall,\nF1-score, and the Dice coefficient. Our experiments show that this approach\noutperforms other methods, including two different image preprocessing\ntechniques and using unaltered, full-color images.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"AbXaiCXPYDaw0lxq4-A-cach__TRtP5OMVSOXR4IyHk","pdfSize":"1724873"}