{"id":"2407.14116","title":"AuditNet: A Conversational AI-based Security Assistant [DEMO]","authors":"Shohreh Deldari, Mohammad Goudarzi, Aditya Joshi, Arash Shaghaghi,\n  Simon Finn, Flora D. Salim, Sanjay Jha","authorsParsed":[["Deldari","Shohreh",""],["Goudarzi","Mohammad",""],["Joshi","Aditya",""],["Shaghaghi","Arash",""],["Finn","Simon",""],["Salim","Flora D.",""],["Jha","Sanjay",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 08:33:07 GMT"}],"updateDate":"2024-07-22","timestamp":1721377987000,"abstract":"  In the age of information overload, professionals across various fields face\nthe challenge of navigating vast amounts of documentation and ever-evolving\nstandards. Ensuring compliance with standards, regulations, and contractual\nobligations is a critical yet complex task across various professional fields.\nWe propose a versatile conversational AI assistant framework designed to\nfacilitate compliance checking on the go, in diverse domains, including but not\nlimited to network infrastructure, legal contracts, educational standards,\nenvironmental regulations, and government policies. By leveraging\nretrieval-augmented generation using large language models, our framework\nautomates the review, indexing, and retrieval of relevant, context-aware\ninformation, streamlining the process of verifying adherence to established\nguidelines and requirements. This AI assistant not only reduces the manual\neffort involved in compliance checks but also enhances accuracy and efficiency,\nsupporting professionals in maintaining high standards of practice and ensuring\nregulatory compliance in their respective fields. We propose and demonstrate\nAuditNet, the first conversational AI security assistant designed to assist IoT\nnetwork security experts by providing instant access to security standards,\npolicies, and regulations.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"nMuBqvKRrUNKpseV4dcXMbsJCVPbUB7wsL-6oF_UV2E","pdfSize":"705625"}