{"id":"2407.00001","title":"Enhancing Regression Models for Complex Systems Using Evolutionary\n  Techniques for Feature Engineering","authors":"Patricia Arroba, Jos\\'e L. Risco-Mart\\'in, Marina Zapater, Jos\\'e M.\n  Moya and Jos\\'e L. Ayala","authorsParsed":[["Arroba","Patricia",""],["Risco-Martín","José L.",""],["Zapater","Marina",""],["Moya","José M.",""],["Ayala","José L.",""]],"versions":[{"version":"v1","created":"Thu, 14 Mar 2024 18:37:31 GMT"}],"updateDate":"2024-07-02","timestamp":1710441451000,"abstract":"  This work proposes an automatic methodology for modeling complex systems. Our\nmethodology is based on the combination of Grammatical Evolution and classical\nregression to obtain an optimal set of features that take part of a linear and\nconvex model. This technique provides both Feature Engineering and Symbolic\nRegression in order to infer accurate models with no effort or designer's\nexpertise requirements. As advanced Cloud services are becoming mainstream, the\ncontribution of data centers in the overall power consumption of modern cities\nis growing dramatically. These facilities consume from 10 to 100 times more\npower per square foot than typical office buildings. Modeling the power\nconsumption for these infrastructures is crucial to anticipate the effects of\naggressive optimization policies, but accurate and fast power modeling is a\ncomplex challenge for high-end servers not yet satisfied by analytical\napproaches. For this case study, our methodology minimizes error in power\nprediction. This work has been tested using real Cloud applications resulting\non an average error in power estimation of 3.98%. Our work improves the\npossibilities of deriving Cloud energy efficient policies in Cloud data centers\nbeing applicable to other computing environments with similar characteristics.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing","Computing Research Repository/Hardware Architecture"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"pgkZ4b0NGBelSRVSxFXuYNZiB9G36K9RdMB4KYnLqAw","pdfSize":"401634"}