{"id":"2407.03867","title":"Elemental noncentrosymmetric superconductors","authors":"Hu Zhang","authorsParsed":[["Zhang","Hu",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 11:58:04 GMT"}],"updateDate":"2024-07-08","timestamp":1720094284000,"abstract":"  Superconductivity has been discovered in many materials including elements,\ncuprates and nickelates. Noncentrosymmetric superconductors get attention due\nto their physical properties results from spatial inversion symmetry breaking.\nHere we propose the existence of elemental noncentrosymmetric superconductors\nwhich needs to break spatial inversion symmetry in single element phases\nrealized by occupations of more than one Wyckoff positions. Elemental\nnoncentrosymmetric superconductors allow us to study the admixture of\nspin-singlet and spin-triplet pairing states in elements with simple crystal\nstructures and chemical conditions. We find that four-layer La thin films\ncoming from bulk {\\alpha}-La with a double hexagonal close-packed structure are\nelemental noncentrosymmetric superconductors since the dimension reduction\nbreaks the spatial inversion symmetry. In the normal state, four-layer La is a\npolar rare-earth metal with a spontaneous polarization having a polar layer\ngroup like ferroelectrics. Hence, to be more precise, four-layer La can also be\ncalled the elemental polar superconductor in the superconductivity state. Based\non this method of breaking inversion symmetry, we discovery polar rare-earth\nmetals, polar transition metals, polar alkali metals and polar alkali earth\nmetals. Other candidate materials are bulk polar materials formed with group 15\nelements, Bi thin films with polar stacking, polar double layer plumbene and Al\nthin films. The question of building the periodic table of elemental\nnoncentrosymmetric superconductors is raised.\n","subjects":["Condensed Matter/Superconductivity"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"vJ4MVp-QVyDt698mnRtU67L3jDvYVIM93kdqsZASgFo","pdfSize":"1585476"}