{"id":"2407.02230","title":"PINNs-MPF: A Physics-Informed Neural Network Framework for\n  Multi-Phase-Field Simulation of Interface Dynamics","authors":"Seifallah Elfetni and Reza Darvishi Kamachali","authorsParsed":[["Elfetni","Seifallah",""],["Kamachali","Reza Darvishi",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 12:55:01 GMT"},{"version":"v2","created":"Fri, 30 Aug 2024 18:07:34 GMT"}],"updateDate":"2024-09-04","timestamp":1719924901000,"abstract":"  We present an application of Physics-Informed Neural Networks to handle\nMultiPhase-Field simulations of microstructure evolution. It has been showcased\nthat a combination of optimization techniques extended and adapted from the\nPINNs literature, and the introduction of specific techniques inspired by the\nMPF Method background, is required. The numerical resolution is realized\nthrough a multi-variable time-series problem by using fully discrete\nresolution. Within each interval, space, time, and phases are treated\nseparately, constituting discrete subdomains. An extended multi-networking\nconcept is implemented to subdivide the simulation domain into multiple\nbatches, with each batch associated with an independent Neural Network trained\nto predict the solution. To ensure efficient interaction across different\nphasesand in the spatio-temporal-phasic subdomain, a Master NN handles\nefficient interaction among the multiple networks, as well as the transfer of\nlearning in different directions. A set of systematic simulations with\nincreasing complexity was performed, that benchmarks various critical aspects\nof MPF simulations, including different geometries, types of interface dynamics\nand the evolution of an interfacial triple junction. A comprehensive approach\nis adopted to specifically focus the attention on the interfacial regions\nthrough an automatic and dynamic meshing process, significantly simplifying the\ntuning of hyper-parameters and serving as a fundamental key for addressing MPF\nproblems using Machine Learning. The pyramidal training approach is proposed to\nthe PINN community as a dual-impact method: it facilitates the initialization\nof training and allows an extended transfer of learning. The proposed PINNs-MPF\nframework successfully reproduces benchmark tests with high fidelity and Mean\nSquared Error loss values ranging from 10$^{-4}$ to 10$^{-6}$ compared to\nground truth solutions.\n","subjects":["Condensed Matter/Materials Science","Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"kvsfygbUb6GnWobAZephcSX0CntS3gQyzG8JZvWVpa4","pdfSize":"25507233"}