{"id":"2407.21695","title":"Unveiling land use dynamics: Insights from a hierarchical Bayesian\n  spatio-temporal modelling of Compositional Data","authors":"Mario Figueira and Carmen Guarner and David Conesa and Antonio\n  L\\'opez-Qu\\'ilez and Tam\\'as Krisztin","authorsParsed":[["Figueira","Mario",""],["Guarner","Carmen",""],["Conesa","David",""],["López-Quílez","Antonio",""],["Krisztin","Tamás",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 15:39:44 GMT"},{"version":"v2","created":"Sat, 3 Aug 2024 08:44:05 GMT"}],"updateDate":"2024-08-06","timestamp":1722440384000,"abstract":"  Changes in land use patterns have significant environmental and socioeconomic\nimpacts, making it crucial for policymakers to understand their causes and\nconsequences. This study, part of the European LAMASUS (Land Management for\nSustainability) project, aims to support the EU's climate neutrality target by\ndeveloping a governance model through collaboration between policymakers, land\nusers, and researchers. We present a methodological synthesis for treating land\nuse data using a Bayesian approach within spatial and spatio-temporal modeling\nframeworks.\n  The study tackles the challenges of analyzing land use changes, particularly\nthe presence of zero values and computational issues with large datasets. It\nintroduces joint model structures to address zeros and employs sequential\ninference and consensus methods for Big Data problems. Spatial downscaling\nmodels approximate smaller scales from aggregated data, circumventing\nhigh-resolution data complications.\n  We explore Beta regression and Compositional Data Analysis (CoDa) for land\nuse data, review relevant spatial and spatio-temporal models, and present\nstrategies for handling zeros. The paper demonstrates the implementation of key\nmodels, downscaling techniques, and solutions to Big Data challenges with\nexamples from simulated data and the LAMASUS project, providing a comprehensive\nframework for understanding and managing land use changes.\n","subjects":["Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"KyerjyeRTuxjDH0dsNScs8kmcJMJIq7OBM23NWWFYM0","pdfSize":"10846051","objectId":"0xf0aeafc94ccedc009939c076574806b8a59dbb07bacf818a8ded13a7ee64920f","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
