{"id":"2407.09515","title":"Rethinking Knee Osteoarthritis Severity Grading: A Few Shot\n  Self-Supervised Contrastive Learning Approach","authors":"Niamh Belton and Misgina Tsighe Hagos and Aonghus Lawlor and Kathleen\n  M. Curran","authorsParsed":[["Belton","Niamh",""],["Hagos","Misgina Tsighe",""],["Lawlor","Aonghus",""],["Curran","Kathleen M.",""]],"versions":[{"version":"v1","created":"Tue, 18 Jun 2024 19:36:18 GMT"}],"updateDate":"2024-07-16","timestamp":1718739378000,"abstract":"  Knee Osteoarthritis (OA) is a debilitating disease affecting over 250 million\npeople worldwide. Currently, radiologists grade the severity of OA on an\nordinal scale from zero to four using the Kellgren-Lawrence (KL) system. Recent\nstudies have raised concern in relation to the subjectivity of the KL grading\nsystem, highlighting the requirement for an automated system, while also\nindicating that five ordinal classes may not be the most appropriate approach\nfor assessing OA severity. This work presents preliminary results of an\nautomated system with a continuous grading scale. This system, namely\nSS-FewSOME, uses self-supervised pre-training to learn robust representations\nof the features of healthy knee X-rays. It then assesses the OA severity by the\nX-rays' distance to the normal representation space. SS-FewSOME initially\ntrains on only 'few' examples of healthy knee X-rays, thus reducing the\nbarriers to clinical implementation by eliminating the need for large training\nsets and costly expert annotations that existing automated systems require. The\nwork reports promising initial results, obtaining a positive Spearman Rank\nCorrelation Coefficient of 0.43, having had access to only 30 ground truth\nlabels at training time.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7aAeUFSVG2VnqmDAbbfYxgWFG7tKG82TRWLOklTom-8","pdfSize":"792734"}