{"id":"2407.19857","title":"PO-QA: A Framework for Portfolio Optimization using Quantum Algorithms","authors":"Kamila Zaman and Alberto Marchisio and Muhammad Kashif and Muhammad\n  Shafique","authorsParsed":[["Zaman","Kamila",""],["Marchisio","Alberto",""],["Kashif","Muhammad",""],["Shafique","Muhammad",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 10:26:28 GMT"}],"updateDate":"2024-07-30","timestamp":1722248788000,"abstract":"  Portfolio Optimization (PO) is a financial problem aiming to maximize the net\ngains while minimizing the risks in a given investment portfolio. The novelty\nof Quantum algorithms lies in their acclaimed potential and capability to solve\ncomplex problems given the underlying Quantum Computing (QC) infrastructure.\nUtilizing QC's applicable strengths to the finance industry's problems, such as\nPO, allows us to solve these problems using quantum-based algorithms such as\nVariational Quantum Eigensolver (VQE) and Quantum Approximate Optimization\nAlgorithm (QAOA). While the Quantum potential for finance is highly impactful,\nthe architecture and composition of the quantum circuits have not yet been\nproperly defined as robust financial frameworks/algorithms as state of the art\nin present literature for research and design development purposes. In this\nwork, we propose a novel scalable framework, denoted PO-QA, to systematically\ninvestigate the variation of quantum parameters (such as rotation blocks,\nrepetitions, and entanglement types) to observe their subtle effect on the\noverall performance. In our paper, the performance is measured and dictated by\nconvergence to similar ground-state energy values for resultant optimal\nsolutions by each algorithm variation set for QAOA and VQE to the exact\neigensolver (classical solution). Our results provide effective insights into\ncomprehending PO from the lens of Quantum Machine Learning in terms of\nconvergence to the classical solution, which is used as a benchmark. This study\npaves the way for identifying efficient configurations of quantum circuits for\nsolving PO and unveiling their inherent inter-relationships.\n","subjects":["Physics/Quantum Physics","Quantitative Finance/Portfolio Management"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"TbNDvBnUAsb_kkPyPtDcJODHrHjS1sVsDCo1BB6KwnU","pdfSize":"1130888"}