{"id":"2407.09460","title":"Collider Tests of Flavored Resonant Leptogenesis in the $U(1)_X$ Model","authors":"Garv Chauhan","authorsParsed":[["Chauhan","Garv",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 17:44:12 GMT"}],"updateDate":"2024-07-15","timestamp":1720806252000,"abstract":"  We study the generation of baryon asymmetry through the flavored resonant\nleptogenesis in the $U(1)_X$ extension of the Standard Model. Being a\ngeneralization of the $U(1)_{B\\text{-}L}$, $U(1)_X$ is an ultraviolet-complete\nmodel of the right-handed neutrinos (RHNs), whose CP violating\nout-of-equilibrium decays lead to the generation of baryon asymmetry via\nleptogenesis. We can also explain the neutrino masses via the seesaw mechanism\nin this model. We consider three different cases for different $U(1)_X$ charges\nof the scalar particle responsible for $U(1)_X$ breaking at TeV-scale. These\ninclude the popular $U(1)_{B\\text{-}L}$ and $U(1)_{R}$ models, as well as a\n$U(1)_C$ model which maximizes the collider signal. We numerically solve the\nflavored Boltzmann transport equations to calculate the total baryon asymmetry.\nWe show that all three cases considered here can naturally explain the observed\nbaryon asymmetry of the Universe in a large portion of the available parameter\nspace, while satisfying the neutrino oscillation data. We find that the\n$U(1)_C$ case offers successful leptogenesis in a larger portion of the\nparameter space as compared to $U(1)_{B\\text{-}L}$ and $U(1)_{R}$. We also\nperform a comparative study between the flavored and unflavored leptogenesis\nparameter space. Finally, we also study the collider prospects for all these\nscenarios using the lepton number violating signal of $pp\\to \\ell^\\pm\n\\ell^\\pm+$jets mediated by the $Z'$ boson associated with $U(1)_X$. We find\nthat HL-LHC may be able to probe a small portion of the relevant parameter\nspace having successful leptogenesis, if neutrinos have normal mass ordering,\nwhile a $\\sqrt s=100$ TeV future collider can access a much larger region of\nthe parameter space, thereby offering an opportunity to test resonant\nleptogenesis in the $U(1)_X$ model.\n","subjects":["Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"oAbilVHXvPewjjTB1h2zp5FhW0FEQz8h-QK3TIiRM38","pdfSize":"976582"}