{"id":"2407.12777","title":"Generalizable Human Gaussians for Sparse View Synthesis","authors":"Youngjoong Kwon, Baole Fang, Yixing Lu, Haoye Dong, Cheng Zhang,\n  Francisco Vicente Carrasco, Albert Mosella-Montoro, Jianjin Xu, Shingo\n  Takagi, Daeil Kim, Aayush Prakash, Fernando De la Torre","authorsParsed":[["Kwon","Youngjoong",""],["Fang","Baole",""],["Lu","Yixing",""],["Dong","Haoye",""],["Zhang","Cheng",""],["Carrasco","Francisco Vicente",""],["Mosella-Montoro","Albert",""],["Xu","Jianjin",""],["Takagi","Shingo",""],["Kim","Daeil",""],["Prakash","Aayush",""],["De la Torre","Fernando",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 17:56:30 GMT"}],"updateDate":"2024-07-18","timestamp":1721238990000,"abstract":"  Recent progress in neural rendering has brought forth pioneering methods,\nsuch as NeRF and Gaussian Splatting, which revolutionize view rendering across\nvarious domains like AR/VR, gaming, and content creation. While these methods\nexcel at interpolating {\\em within the training data}, the challenge of\ngeneralizing to new scenes and objects from very sparse views persists.\nSpecifically, modeling 3D humans from sparse views presents formidable hurdles\ndue to the inherent complexity of human geometry, resulting in inaccurate\nreconstructions of geometry and textures. To tackle this challenge, this paper\nleverages recent advancements in Gaussian Splatting and introduces a new method\nto learn generalizable human Gaussians that allows photorealistic and accurate\nview-rendering of a new human subject from a limited set of sparse views in a\nfeed-forward manner. A pivotal innovation of our approach involves\nreformulating the learning of 3D Gaussian parameters into a regression process\ndefined on the 2D UV space of a human template, which allows leveraging the\nstrong geometry prior and the advantages of 2D convolutions. In addition, a\nmulti-scaffold is proposed to effectively represent the offset details. Our\nmethod outperforms recent methods on both within-dataset generalization as well\nas cross-dataset generalization settings.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Graphics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8kILoZlaFwfCAH2BaxO86xBirc96JwKmqKL0wRdKvUo","pdfSize":"19207102","objectId":"0x61791c57d6bfc7161dd3f573b2a5ee72c4865a74749eac1d2425bd13c5ff0884","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
