{"id":"2407.00656","title":"Multiple-GPU accelerated high-order gas-kinetic scheme on\n  three-dimensional unstructured meshes","authors":"Yuhang Wang, Waixiang Cao, Liang Pan","authorsParsed":[["Wang","Yuhang",""],["Cao","Waixiang",""],["Pan","Liang",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 10:56:19 GMT"}],"updateDate":"2024-07-02","timestamp":1719744979000,"abstract":"  Recently, successes have been achieved for the high-order gas-kinetic schemes\n(HGKS) on unstructured meshes for compressible flows. In this paper, to\naccelerate the computation, HGKS is implemented with the graphical processing\nunit (GPU) using the compute unified device architecture (CUDA). HGKS on\nunstructured meshes is a fully explicit scheme, and the acceleration framework\ncan be developed based on the cell-level parallelism. For single-GPU\ncomputation, the connectivity of geometric information is generated for the\nrequirement of data localization and independence. Based on such data\nstructure, the kernels and corresponding girds of CUDA are set. With the\none-to-one mapping between the indices of cells and CUDA threads, the\nsingle-GPU computation using CUDA can be implemented for HGKS. For multiple-GPU\ncomputation, the domain decomposition and data exchange need to be taken into\naccount. The domain is decomposed into subdomains by METIS, and the MPI\nprocesses are created for the control of each process and communication among\nGPUs. With reconstruction of connectivity and adding ghost cells, the main\nconfiguration of CUDA for single-GPU can be inherited by each GPU. The\nbenchmark cases for compressible flows, including accuracy test and flow\npassing through a sphere, are presented to assess the numerical performance of\nHGKS with Nvidia RTX A5000 and Tesla V100 GPUs. For single-GPU computation,\ncompared with the parallel central processing unit (CPU) code running on the\nIntel Xeon Gold 5120 CPU with open multi-processing (OpenMP) directives, 5x\nspeedup is achieved by RTX A5000 and 9x speedup is achieved by Tesla V100. For\nmultiple-GPU computation, HGKS code scales properly with the increasing number\nof GPU. Numerical results confirm the excellent performance of multiple-GPU\naccelerated HGKS on unstructured meshes.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"IAO7qld6dH69CAWCtWMggcuaBnDlLaANwxPkkCBlsWs","pdfSize":"3662119"}