{"id":"2407.09313","title":"In-situ Analysis of the Effect of Residual fcc Phase and Special Grain\n  Boundaries on the Deformation Dynamics in Pure Cobalt","authors":"Michal Knapek, Peter Min\\'arik, Adam Gre\\v{s}, Patrik Dobro\\v{n}, Petr\n  Harcuba, Tom\\'a\\v{s} Tayari, Franti\\v{s}ek Chmel\\'ik","authorsParsed":[["Knapek","Michal",""],["Minárik","Peter",""],["Greš","Adam",""],["Dobroň","Patrik",""],["Harcuba","Petr",""],["Tayari","Tomáš",""],["Chmelík","František",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 14:53:53 GMT"},{"version":"v2","created":"Sat, 20 Jul 2024 09:11:29 GMT"}],"updateDate":"2024-07-23","timestamp":1720796033000,"abstract":"  Polycrystalline hcp metals - an important class of engineering materials -\ntypically exhibit complex plasticity because of a limited number of slip\nsystems. Among these metals, deformation is even more complicated in cobalt as\nit commonly contains residual fcc phase due to the incomplete martensitic\nfcc$\\rightarrow$hcp transformation upon cooling. In this work, we employ a\ncombination of in-situ (acoustic emission, AE) and ex-situ (scanning electron\nmicroscopy, SEM) techniques in order to examine deformation dynamics in pure\npolycrystalline cobalt varying in grain size and the content of residual fcc\nphase prepared using systematic thermal treatment and cycling. We reveal that\nthe presence of the fcc phase and special ~71{\\deg} grain boundaries between\ndifferent hcp martensite variants brings about higher deformability and\nstrength. The fcc phase provides additional slip systems and also accommodates\ndeformation via the stress-induced fcc$\\rightarrow$hcp transformation during\nloading. On the other hand, special boundaries enhance structural integrity and\nsuppress the formation of critical defects. Both these non-trivial effects can\ndominate over the influence of grain size, being a traditional microstructural\nvariable. The ex-situ SEM experiments further reveal that the stress-induced\nfcc$\\rightarrow$hcp transformation is sluggish and only partial even at high\nstrains, and it does not give rise to detectable AE signals, unlike in other\nmaterials exhibiting martensitic transformation. In turn, these insights into\ncobalt plasticity provide new avenues for the microstructure and performance\noptimization towards the desired applications through the modern concept of\ngrain boundary engineering.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"SKbhT_cuxAp5icQihyRqj1Io14u7FfBrdhKMfKWxblM","pdfSize":"19477094"}