{"id":"2407.17572","title":"CityX: Controllable Procedural Content Generation for Unbounded 3D\n  Cities","authors":"Shougao Zhang, Mengqi Zhou, Yuxi Wang, Chuanchen Luo, Rongyu Wang,\n  Yiwei Li, Xucheng Yin, Zhaoxiang Zhang, Junran Peng","authorsParsed":[["Zhang","Shougao",""],["Zhou","Mengqi",""],["Wang","Yuxi",""],["Luo","Chuanchen",""],["Wang","Rongyu",""],["Li","Yiwei",""],["Yin","Xucheng",""],["Zhang","Zhaoxiang",""],["Peng","Junran",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 18:05:13 GMT"},{"version":"v2","created":"Mon, 29 Jul 2024 14:55:33 GMT"},{"version":"v3","created":"Tue, 6 Aug 2024 07:36:21 GMT"}],"updateDate":"2024-08-07","timestamp":1721844313000,"abstract":"  Generating a realistic, large-scale 3D virtual city remains a complex\nchallenge due to the involvement of numerous 3D assets, various city styles,\nand strict layout constraints. Existing approaches provide promising attempts\nat procedural content generation to create large-scale scenes using Blender\nagents. However, they face crucial issues such as difficulties in scaling up\ngeneration capability and achieving fine-grained control at the semantic layout\nlevel. To address these problems, we propose a novel multi-modal controllable\nprocedural content generation method, named CityX, which enhances realistic,\nunbounded 3D city generation guided by multiple layout conditions, including\nOSM, semantic maps, and satellite images. Specifically, the proposed method\ncontains a general protocol for integrating various PCG plugins and a\nmulti-agent framework for transforming instructions into executable Blender\nactions. Through this effective framework, CityX shows the potential to build\nan innovative ecosystem for 3D scene generation by bridging the gap between the\nquality of generated assets and industrial requirements. Extensive experiments\nhave demonstrated the effectiveness of our method in creating high-quality,\ndiverse, and unbounded cities guided by multi-modal conditions. Our project\npage: https://cityx-lab.github.io.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"DgdXvQZiGEqxCR1ROKBkKbhvKlVkpGaTYHVWLysCD24","pdfSize":"2685662"}