{"id":"2407.03198","title":"BOWIE-ALIGN: A JWST comparative survey of aligned vs misaligned hot\n  Jupiters to test the dependence of atmospheric composition on migration\n  history","authors":"James Kirk, Eva-Maria Ahrer, Anna B.T. Penzlin, James E. Owen, Richard\n  A. Booth, Lili Alderson, Duncan A. Christie, Alastair B. Claringbold, Emma\n  Esparza-Borges, Chloe E. Fisher, Mercedes L\\'opez-Morales, N. J. Mayne, Mason\n  McCormack, Annabella Meech, Vatsal Panwar, Diana Powell, Jake Taylor, Denis\n  E. Sergeev, Daniel Valentine, Hannah R. Wakeford, Peter J. Wheatley, Maria\n  Zamyatina","authorsParsed":[["Kirk","James",""],["Ahrer","Eva-Maria",""],["Penzlin","Anna B. T.",""],["Owen","James E.",""],["Booth","Richard A.",""],["Alderson","Lili",""],["Christie","Duncan A.",""],["Claringbold","Alastair B.",""],["Esparza-Borges","Emma",""],["Fisher","Chloe E.",""],["López-Morales","Mercedes",""],["Mayne","N. J.",""],["McCormack","Mason",""],["Meech","Annabella",""],["Panwar","Vatsal",""],["Powell","Diana",""],["Taylor","Jake",""],["Sergeev","Denis E.",""],["Valentine","Daniel",""],["Wakeford","Hannah R.",""],["Wheatley","Peter J.",""],["Zamyatina","Maria",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 15:29:21 GMT"}],"updateDate":"2024-07-04","timestamp":1720020561000,"abstract":"  A primary objective of exoplanet atmosphere characterisation is to learn\nabout planet formation and evolution, however, this is challenged by\ndegeneracies. To determine whether differences in atmospheric composition can\nbe reliably traced to differences in evolution, we are undertaking a new survey\nwith JWST to compare the compositions of a sample of hot Jupiters that orbit F\nstars above the Kraft break with different orbital alignments. Under the\nassumption that aligned planets migrate through the inner disc, while\nmisaligned planets migrate after disc dispersal, the act of migrating through\nthe inner disc should lead to a measurable difference in the C/O between\naligned and misaligned planets. We expect the amplitude and sign of this\ndifference to depend on the amount of planetesimal accretion and whether\nsilicates accreted from the inner disc release their oxygen. Here, we identify\nall known exoplanets that are suitable for testing this hypothesis, describe\nour JWST survey, and use noise simulations and atmospheric retrievals to\nestimate our survey's sensitivity. With the selected sample of four aligned and\nfour misaligned hot Jupiters, we will be sensitive to the predicted differences\nin C/O between aligned and misaligned hot Jupiters for a wide range of model\nscenarios.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"AseElOm6j-FbfxjGJm741dmDT3leU2b8tUHurYMX0m8","pdfSize":"1134447"}