{"id":"2407.06844","title":"Dynamic Correlation Learning and Regularization for Multi-Label\n  Confidence Calibration","authors":"Tianshui Chen, Weihang Wang, Tao Pu, Jinghui Qin, Zhijing Yang, Jie\n  Liu, Liang Lin","authorsParsed":[["Chen","Tianshui",""],["Wang","Weihang",""],["Pu","Tao",""],["Qin","Jinghui",""],["Yang","Zhijing",""],["Liu","Jie",""],["Lin","Liang",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 13:26:21 GMT"}],"updateDate":"2024-07-10","timestamp":1720531581000,"abstract":"  Modern visual recognition models often display overconfidence due to their\nreliance on complex deep neural networks and one-hot target supervision,\nresulting in unreliable confidence scores that necessitate calibration. While\ncurrent confidence calibration techniques primarily address single-label\nscenarios, there is a lack of focus on more practical and generalizable\nmulti-label contexts. This paper introduces the Multi-Label Confidence\nCalibration (MLCC) task, aiming to provide well-calibrated confidence scores in\nmulti-label scenarios. Unlike single-label images, multi-label images contain\nmultiple objects, leading to semantic confusion and further unreliability in\nconfidence scores. Existing single-label calibration methods, based on label\nsmoothing, fail to account for category correlations, which are crucial for\naddressing semantic confusion, thereby yielding sub-optimal performance. To\novercome these limitations, we propose the Dynamic Correlation Learning and\nRegularization (DCLR) algorithm, which leverages multi-grained semantic\ncorrelations to better model semantic confusion for adaptive regularization.\nDCLR learns dynamic instance-level and prototype-level similarities specific to\neach category, using these to measure semantic correlations across different\ncategories. With this understanding, we construct adaptive label vectors that\nassign higher values to categories with strong correlations, thereby\nfacilitating more effective regularization. We establish an evaluation\nbenchmark, re-implementing several advanced confidence calibration algorithms\nand applying them to leading multi-label recognition (MLR) models for fair\ncomparison. Through extensive experiments, we demonstrate the superior\nperformance of DCLR over existing methods in providing reliable confidence\nscores in multi-label scenarios.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_JTLGpbL6XOhWUTmMcYRXLj9dmLcr04g1PmjtC8zpHo","pdfSize":"14870002"}