{"id":"2407.07878","title":"The Cosmological Preference for Negative Neutrino Mass","authors":"Daniel Green and Joel Meyers","authorsParsed":[["Green","Daniel",""],["Meyers","Joel",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 17:46:41 GMT"}],"updateDate":"2024-07-11","timestamp":1720633601000,"abstract":"  The most precise determination of the sum of neutrino masses from\ncosmological data, derived from analysis of the cosmic microwave background\n(CMB) and baryon acoustic acoustic oscillations (BAO) from the Dark Energy\nSpectroscopic Instrument (DESI), favors a value below the minimum inferred from\nneutrino flavor oscillation experiments. We explore which data is most\nresponsible of this puzzling aspect of the current constraints on neutrino mass\nand whether it is related to other anomalies in cosmology. We demonstrate\nconclusively that the preference for negative neutrino masses is a consequence\nof larger than expected lensing of the CMB in both the two- and four-point\nlensing statistics. Furthermore, we show that this preference is robust to\nchanges in likelihoods of the BAO and CMB optical depth analyses given the\navailable data. We then show that this excess clustering is not easily\nexplained by changes to the expansion history and is likely distinct from the\npreference for for dynamical dark energy in DESI BAO data. Finally, we discuss\nhow future data may impact these results, including an analysis of Planck CMB\nwith mock DESI 5-year data. We conclude that the negative neutrino mass\npreference is likely to persist even as more cosmological data is collected in\nthe near future.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"6V91XqROCvBjpvuu1Y6VCKeZFgLRW6rL1lnTRxfR3kU","pdfSize":"3169267","objectId":"0x1a1b49cd4e11215bab913e2705067206294a4d5ab3b2feb2c318f7dad3233453","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
