{"id":"2407.09027","title":"Exploring the role of criticality in the quantum Otto cycle fueled by\n  the anisotropic quantum Rabi-Stark model","authors":"He-Guang Xu, Jiasen Jin, Norton G. de Almeida, and G. D. de Moraes\n  Neto","authorsParsed":[["Xu","He-Guang",""],["Jin","Jiasen",""],["de Almeida","Norton G.",""],["Neto","G. D. de Moraes",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 06:36:57 GMT"}],"updateDate":"2024-07-15","timestamp":1720766217000,"abstract":"  Quantum heat machines, encompassing heat engines, refrigerators, heaters, and\naccelerators, represent the forefront of quantum thermodynamics, offering a\nnovel paradigm for converting heat energy into useful mechanical work.\nLeveraging quantum mechanical principles, these machines promise superior\nefficiency and performance compared to classical counterparts, with potential\napplications in renewable energy and quantum computing. This paper investigates\na quantum Otto engine operating in both ideal and finite-time scenarios,\nemploying a two-level system interacting with a harmonic oscillator within the\nframework of the anisotropic quantum Rabi-Stark model (AQRSM) as the working\nmedium. This model is notable for exhibiting both first-order and continuous\nquantum phase transitions. By focusing on quantum heat engines, our study\nreveals that these phase transitions critically modulate the efficiency and\npower of AQRSM-based engines, outperforming quantum engines fueled by working\nmedium with harmonic spectrum. Additionally, we explore the impacts of quantum\nfriction and conduct limit cycle analysis in finite-time operations, providing\ninsights into optimizing quantum heat engines for practical implementation.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"1AXHZL_CTz3vuIZb0gVHt-eHcRYZxoRMsA-QWHiZpyI","pdfSize":"3777585","objectId":"0x04061fb05afa72d19f7ea44a990808ef56e033d49a3b5254114525398194b82b","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
