{"id":"2407.15411","title":"Scalable Dynamic Embedding Size Search for Streaming Recommendation","authors":"Yunke Qu, Liang Qu, Tong Chen, Xiangyu Zhao, Quoc Viet Hung Nguyen,\n  Hongzhi Yin","authorsParsed":[["Qu","Yunke",""],["Qu","Liang",""],["Chen","Tong",""],["Zhao","Xiangyu",""],["Nguyen","Quoc Viet Hung",""],["Yin","Hongzhi",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 06:37:24 GMT"},{"version":"v2","created":"Wed, 31 Jul 2024 05:46:09 GMT"}],"updateDate":"2024-08-01","timestamp":1721630244000,"abstract":"  Recommender systems typically represent users and items by learning their\nembeddings, which are usually set to uniform dimensions and dominate the model\nparameters. However, real-world recommender systems often operate in streaming\nrecommendation scenarios, where the number of users and items continues to\ngrow, leading to substantial storage resource consumption for these embeddings.\nAlthough a few methods attempt to mitigate this by employing embedding size\nsearch strategies to assign different embedding dimensions in streaming\nrecommendations, they assume that the embedding size grows with the frequency\nof users/items, which eventually still exceeds the predefined memory budget\nover time. To address this issue, this paper proposes to learn Scalable\nLightweight Embeddings for streaming recommendation, called SCALL, which can\nadaptively adjust the embedding sizes of users/items within a given memory\nbudget over time. Specifically, we propose to sample embedding sizes from a\nprobabilistic distribution, with the guarantee to meet any predefined memory\nbudget. By fixing the memory budget, the proposed embedding size sampling\nstrategy can increase and decrease the embedding sizes in accordance to the\nfrequency of the corresponding users or items. Furthermore, we develop a\nreinforcement learning-based search paradigm that models each state with mean\npooling to keep the length of the state vectors fixed, invariant to the\nchanging number of users and items. As a result, the proposed method can\nprovide embedding sizes to unseen users and items. Comprehensive empirical\nevaluations on two public datasets affirm the advantageous effectiveness of our\nproposed method.\n","subjects":["Computing Research Repository/Information Retrieval"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"G7ifS0dCyGj4NdC9Vc92fSxyRmIswqx3-NQNLhMDZKA","pdfSize":"962125","objectId":"0x93506cfde109c0263db83dee2c592c410e626018a27a34632428980e0a06e314","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
