{"id":"2407.21233","title":"TMA-Grid: An open-source, zero-footprint web application for FAIR Tissue\n  MicroArray De-arraying","authors":"Aaron Ge, Monjoy Saha, Maire A. Duggan, Petra Lenz, Mustapha Abubakar,\n  Montserrat Garc\\'ia-Closas, Jeya Balasubramanian, Jonas S. Almeida, Praphulla\n  MS Bhawsar","authorsParsed":[["Ge","Aaron",""],["Saha","Monjoy",""],["Duggan","Maire A.",""],["Lenz","Petra",""],["Abubakar","Mustapha",""],["García-Closas","Montserrat",""],["Balasubramanian","Jeya",""],["Almeida","Jonas S.",""],["Bhawsar","Praphulla MS",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 22:40:32 GMT"}],"updateDate":"2024-08-01","timestamp":1722379232000,"abstract":"  Background:\n  Tissue Microarrays (TMAs) significantly increase analytical efficiency in\nhistopathology and large-scale epidemiologic studies by allowing multiple\ntissue cores to be scanned on a single slide. The individual cores can be\ndigitally extracted and then linked to metadata for analysis in a process known\nas de-arraying. However, TMAs often contain core misalignments and artifacts\ndue to assembly errors, which can adversely affect the reliability of the\nextracted cores during the de-arraying process. Moreover, conventional\napproaches for TMA de-arraying rely on desktop solutions.Therefore, a robust\nyet flexible de-arraying method is crucial to account for these inaccuracies\nand ensure effective downstream analyses.\n  Results:\n  We developed TMA-Grid, an in-browser, zero-footprint, interactive web\napplication for TMA de-arraying. This web application integrates a\nconvolutional neural network for precise tissue segmentation and a grid\nestimation algorithm to match each identified core to its expected location.\nThe application emphasizes interactivity, allowing users to easily adjust\nsegmentation and gridding results. Operating entirely in the web-browser,\nTMA-Grid eliminates the need for downloads or installations and ensures data\nprivacy. Adhering to FAIR principles (Findable, Accessible, Interoperable, and\nReusable), the application and its components are designed for seamless\nintegration into TMA research workflows.\n  Conclusions:\n  TMA-Grid provides a robust, user-friendly solution for TMA dearraying on the\nweb. As an open, freely accessible platform, it lays the foundation for\ncollaborative analyses of TMAs and similar histopathology imaging data.\nAvailability: Web application: https://episphere.github.io/tma-grid Code:\nhttps://github.com/episphere/tma-grid Tutorial: https://youtu.be/miajqyw4BVk\n","subjects":["Quantitative Biology/Tissues and Organs","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"iYwYNGLM-A39GYpFtdfTu4bNPbPjyAp37gbTK4wjClk","pdfSize":"2906032"}