{"id":"2407.09342","title":"MIXED-SENSE: A Mixed Reality Sensor Emulation Framework for Test and\n  Evaluation of UAVs Against False Data Injection Attacks","authors":"Kartik A. Pant, Li-Yu Lin, Jaehyeok Kim, Worawis Sribunma, James M.\n  Goppert, Inseok Hwang","authorsParsed":[["Pant","Kartik A.",""],["Lin","Li-Yu",""],["Kim","Jaehyeok",""],["Sribunma","Worawis",""],["Goppert","James M.",""],["Hwang","Inseok",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 15:16:44 GMT"}],"updateDate":"2024-07-15","timestamp":1720797404000,"abstract":"  We present a high-fidelity Mixed Reality sensor emulation framework for\ntesting and evaluating the resilience of Unmanned Aerial Vehicles (UAVs)\nagainst false data injection (FDI) attacks. The proposed approach can be\nutilized to assess the impact of FDI attacks, benchmark attack detector\nperformance, and validate the effectiveness of mitigation/reconfiguration\nstrategies in single-UAV and UAV swarm operations. Our Mixed Reality framework\nleverages high-fidelity simulations of Gazebo and a Motion Capture system to\nemulate proprioceptive (e.g., GNSS) and exteroceptive (e.g., camera) sensor\nmeasurements in real-time. We propose an empirical approach to faithfully\nrecreate signal characteristics such as latency and noise in these\nmeasurements. Finally, we illustrate the efficacy of our proposed framework\nthrough a Mixed Reality experiment consisting of an emulated GNSS attack on an\nactual UAV, which (i) demonstrates the impact of false data injection attacks\non GNSS measurements and (ii) validates a mitigation strategy utilizing a\ndistributed camera network developed in our previous work. Our open-source\nimplementation is available at\n\\href{https://github.com/CogniPilot/mixed\\_sense}{\\texttt{https://github.com/CogniPilot/mixed\\_sense}}\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"VbaZirZOodKB5CYa9gU6hpSk4TkJPLAXtm2R4QO_upM","pdfSize":"4924359"}