{"id":"2407.11316","title":"BUSClean: Open-source software for breast ultrasound image\n  pre-processing and knowledge extraction for medical AI","authors":"Arianna Bunnell, Kailee Hung, John A. Shepherd, Peter Sadowski","authorsParsed":[["Bunnell","Arianna",""],["Hung","Kailee",""],["Shepherd","John A.",""],["Sadowski","Peter",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 02:02:51 GMT"},{"version":"v2","created":"Sun, 28 Jul 2024 16:56:41 GMT"}],"updateDate":"2024-07-30","timestamp":1721095371000,"abstract":"  Development of artificial intelligence (AI) for medical imaging demands\ncuration and cleaning of large-scale clinical datasets comprising hundreds of\nthousands of images. Some modalities, such as mammography, contain highly\nstandardized imaging. In contrast, breast ultrasound imaging (BUS) can contain\nmany irregularities not indicated by scan metadata, such as enhanced scan\nmodes, sonographer annotations, or additional views. We present an open-source\nsoftware solution for automatically processing clinical BUS datasets. The\nalgorithm performs BUS scan filtering, cleaning, and knowledge extraction from\nsonographer annotations. Its modular design enables users to adapt it to new\nsettings. Experiments on an internal testing dataset of 430 clinical BUS images\nachieve >95% sensitivity and >98% specificity in detecting every type of text\nannotation, >98% sensitivity and specificity in detecting scans with blood flow\nhighlighting, alternative scan modes, or invalid scans. A case study on a\ncompletely external, public dataset of BUS scans found that BUSClean identified\ntext annotations and scans with blood flow highlighting with 88.6% and 90.9%\nsensitivity and 98.3% and 99.9% specificity, respectively. Adaptation of the\nlesion caliper detection method to account for a type of caliper specific to\nthe case study demonstrates intended use of BUSClean in new data distributions\nand improved performance in lesion caliper detection from 43.3% and 93.3%\nout-of-the-box to 92.1% and 92.3% sensitivity and specificity, respectively.\nSource code, example notebooks, and sample data are available at\nhttps://github.com/hawaii-ai/bus-cleaning.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0PQFeSopq3amv0rYl1IMj1RZDBI9WDazeyW9y4J9SpY","pdfSize":"868737"}