{"id":"2407.02883","title":"CoIR: A Comprehensive Benchmark for Code Information Retrieval Models","authors":"Xiangyang Li, Kuicai Dong, Yi Quan Lee, Wei Xia, Yichun Yin, Hao\n  Zhang, Yong Liu, Yasheng Wang, Ruiming Tang","authorsParsed":[["Li","Xiangyang",""],["Dong","Kuicai",""],["Lee","Yi Quan",""],["Xia","Wei",""],["Yin","Yichun",""],["Zhang","Hao",""],["Liu","Yong",""],["Wang","Yasheng",""],["Tang","Ruiming",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 07:58:20 GMT"}],"updateDate":"2024-07-04","timestamp":1719993500000,"abstract":"  Despite the substantial success of Information Retrieval (IR) in various NLP\ntasks, most IR systems predominantly handle queries and corpora in natural\nlanguage, neglecting the domain of code retrieval. Code retrieval is critically\nimportant yet remains under-explored, with existing methods and benchmarks\ninadequately representing the diversity of code in various domains and tasks.\nAddressing this gap, we present \\textbf{\\name} (\\textbf{Co}de\n\\textbf{I}nformation \\textbf{R}etrieval Benchmark), a robust and comprehensive\nbenchmark specifically designed to assess code retrieval capabilities. \\name\ncomprises \\textbf{ten} meticulously curated code datasets, spanning\n\\textbf{eight} distinctive retrieval tasks across \\textbf{seven} diverse\ndomains. We first discuss the construction of \\name and its diverse dataset\ncomposition. Further, we evaluate nine widely used retrieval models using\n\\name, uncovering significant difficulties in performing code retrieval tasks\neven with state-of-the-art systems. To facilitate easy adoption and integration\nwithin existing research workflows, \\name has been developed as a user-friendly\nPython framework, readily installable via pip. It shares same data schema as\nother popular benchmarks like MTEB and BEIR, enabling seamless cross-benchmark\nevaluations. Through \\name, we aim to invigorate research in the code retrieval\ndomain, providing a versatile benchmarking tool that encourages further\ndevelopment and exploration of code retrieval systems\\footnote{\\url{\nhttps://github.com/CoIR-team/coir}}.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"80jiZVq3EprKnqroaJeF7T8tknajtN9C67uW56inZDU","pdfSize":"1516169"}