{"id":"2407.15799","title":"Adaptive Extensions of Unbiased Risk Estimators for Unsupervised\n  Magnetic Resonance Image Denoising","authors":"Reeshad Khan, John Gauch and Ukash Nakarmi","authorsParsed":[["Khan","Reeshad",""],["Gauch","John",""],["Nakarmi","Ukash",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 17:04:21 GMT"},{"version":"v2","created":"Tue, 23 Jul 2024 19:09:23 GMT"}],"updateDate":"2024-08-31","timestamp":1721667861000,"abstract":"  The application of Deep Neural Networks (DNNs) to image denoising has notably\nchallenged traditional denoising methods, particularly within complex noise\nscenarios prevalent in medical imaging. Despite the effectiveness of\ntraditional and some DNN-based methods, their reliance on high-quality,\nnoiseless ground truth images limits their practical utility. In response to\nthis, our work introduces and benchmarks innovative unsupervised learning\nstrategies, notably Stein's Unbiased Risk Estimator (SURE), its extension\n(eSURE), and our novel implementation, the Extended Poisson Unbiased Risk\nEstimator (ePURE), within medical imaging frameworks.\n  This paper presents a comprehensive evaluation of these methods on MRI data\nafflicted with Gaussian and Poisson noise types, a scenario typical in medical\nimaging but challenging for most denoising algorithms. Our main contribution\nlies in the effective adaptation and implementation of the SURE, eSURE, and\nparticularly the ePURE frameworks for medical images, showcasing their\nrobustness and efficacy in environments where traditional noiseless ground\ntruth cannot be obtained.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"TQbFZJLTIoqNpJrmmPPE_Rz5Soo63bikbCx9Tlo7jzs","pdfSize":"1139951","objectId":"0x8c49cd7566c54e0bca3e9bbec4b47c5d267717ef59d7063becc86751227e0c9e","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
