{"id":"2407.14087","title":"Score Normalization for Demographic Fairness in Face Recognition","authors":"Yu Linghu, Tiago de Freitas Pereira, Christophe Ecabert, S\\'ebastien\n  Marcel, and Manuel G\\\"unther","authorsParsed":[["Linghu","Yu",""],["Pereira","Tiago de Freitas",""],["Ecabert","Christophe",""],["Marcel","Sébastien",""],["Günther","Manuel",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 07:51:51 GMT"},{"version":"v2","created":"Mon, 22 Jul 2024 13:59:10 GMT"}],"updateDate":"2024-07-23","timestamp":1721375511000,"abstract":"  Fair biometric algorithms have similar verification performance across\ndifferent demographic groups given a single decision threshold. Unfortunately,\nfor state-of-the-art face recognition networks, score distributions differ\nbetween demographics. Contrary to work that tries to align those distributions\nby extra training or fine-tuning, we solely focus on score post-processing\nmethods. As proved, well-known sample-centered score normalization techniques,\nZ-norm and T-norm, do not improve fairness for high-security operating points.\nThus, we extend the standard Z/T-norm to integrate demographic information in\nnormalization. Additionally, we investigate several possibilities to\nincorporate cohort similarities for both genuine and impostor pairs per\ndemographic to improve fairness across different operating points. We run\nexperiments on two datasets with different demographics (gender and ethnicity)\nand show that our techniques generally improve the overall fairness of five\nstate-of-the-art pre-trained face recognition networks, without downgrading\nverification performance. We also indicate that an equal contribution of False\nMatch Rate (FMR) and False Non-Match Rate (FNMR) in fairness evaluation is\nrequired for the highest gains. Code and protocols are available.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"USKV8ogaj1p9Y_8W5V_sAFo9Q5iv6lqnuc5v7hN6ZZM","pdfSize":"894983"}