{"id":"2407.19419","title":"Accurate background velocity model building method based on iterative\n  deep learning in sparse transform domain","authors":"Guoxin Chen","authorsParsed":[["Chen","Guoxin",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 07:41:42 GMT"}],"updateDate":"2024-07-30","timestamp":1722152502000,"abstract":"  Whether it is oil and gas exploration or geological science research, it is\nnecessary to accurately grasp the structural information of underground media.\nFull waveform inversion is currently the most popular seismic wave inversion\nmethod, but it is highly dependent on a high-quality initial model. Artificial\nintelligence algorithm deep learning is completely data-driven and can get rid\nof the dependence on the initial model. However, the prediction accuracy of\ndeep learning algorithms depends on the scale and diversity of training data\nsets. How to improve the prediction accuracy of deep learning without\nincreasing the size of the training set while also improving computing\nefficiency is a worthy issue to study. In this paper, an iterative deep\nlearning algorithm in the sparse transform domain is proposed based on the\ncharacteristics of deep learning: first, based on the computational efficiency\nand the effect of sparse transform, the cosine transform is selected as the\nsparse transform method, and the seismic data and the corresponding velocity\nmodel are cosine transformed to obtain their corresponding sparse expressions,\nwhich are then used as the input data and corresponding label data for deep\nlearning; then we give an iterative deep learning algorithm in the cosine\ntransform domain, that is, after obtaining the seismic data residuals and\nvelocity model residuals of the previous round of test results, they are used\nagain as new input data and label data, and re-trained in the cosine domain to\nobtain a new network, and the prediction results of the previous round are\ncorrected, and then the cycle is repeated until the termination condition is\nreached. The algorithm effect was verified on the SEG/EAGE salt model and the\nseabed sulfide physical model site data.\n","subjects":["Physics/Geophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8BKH6DH5RTGe1f3B5MFvWrcPI9N2MWC95Sa3oRznPqo","pdfSize":"2430194"}