{"id":"2407.09872","title":"A Systematic Literature Review on Task Recommendation Systems for\n  Crowdsourced Software Engineering","authors":"Shashiwadana Nirmani, Mojtaba Shahin, Hourieh Khalajzadeh, Xiao Liu","authorsParsed":[["Nirmani","Shashiwadana",""],["Shahin","Mojtaba",""],["Khalajzadeh","Hourieh",""],["Liu","Xiao",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 12:46:57 GMT"}],"updateDate":"2024-07-16","timestamp":1720874817000,"abstract":"  Context: Crowdsourced Software Engineering CSE offers outsourcing work to\nsoftware practitioners by leveraging a global online workforce. However these\nsoftware practitioners struggle to identify suitable tasks due to the variety\nof options available. Hence there have been a growing number of studies on\nintroducing recommendation systems to recommend CSE tasks to software\npractitioners. Objective: The goal of this study is to analyze the existing CSE\ntask recommendation systems, investigating their extracted data, recommendation\nmethods, key advantages and limitations, recommended task types, the use of\nhuman factors in recommendations, popular platforms, and features used to make\nrecommendations. Method: This SLR was conducted according to the Kitchenham and\nCharters guidelines. We used both manual and automatic search strategies\nwithout putting any time limitation for searching the relevant papers. Results:\nWe selected 63 primary studies for data extraction, analysis, and synthesis\nbased on our predefined inclusion and exclusion criteria. From the results of\nthe data analysis, we classified the extracted data into 4 categories based on\nthe data extraction source, categorized the proposed recommendation systems to\nfit into a taxonomy, and identified the key advantages and limitations of these\nsystems. Our results revealed that human factors play a major role in CSE task\nrecommendation. Further we identified five popular task types recommended,\npopular platforms, and their features used in task recommendation. We also\nprovided recommendations for future research directions. Conclusion: This SLR\nprovides insights into current trends gaps and future research directions in\nCSE task recommendation systems.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ARAxx2FdJDPzaoTDFuf05RPInzg-eyU2aUX6N33ky0A","pdfSize":"627306"}