{"id":"2407.11580","title":"Extension of a phase-field KKS model to predict the microstructure\n  evolution in LPBF AlSi10Mg alloy submitted to non isothermal processes","authors":"Seifallah Fetni, Jocelyn Delahaye, H\\'ector Sep\\'ulveda, Laurent\n  Duch\\^ene, Anne Marie Habraken and Anne Mertens","authorsParsed":[["Fetni","Seifallah",""],["Delahaye","Jocelyn",""],["Sepúlveda","Héctor",""],["Duchêne","Laurent",""],["Habraken","Anne Marie",""],["Mertens","Anne",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 10:41:23 GMT"}],"updateDate":"2024-07-17","timestamp":1721126483000,"abstract":"  The out-of-equilibrium heterogeneous microstructure typical of AlSi10Mg\nprocessed by Laser Powder Bed Fusion (LPBF) is often modified by further heat\ntreatment to improve its ductility. According to literature, extensive\nexperimental investigations are generally required in order to optimize these\nheat treatments. In the present work, a phase-field approach is developed based\non an extended Kim-Kim-Suzuki (KKS) model to guide and accelerate the\npost-treatment optimization. Combined with CALculation of PHAse Diagrams\n(CALPHAD) data, this extended KKS model predicts microstructural changes under\nanisothermal conditions. To ensure a more physical approach, it takes into\naccount the enhanced diffusion by quenched-in excess vacancies as well as the\nelastic energy due to matrix/precipitate lattice mismatch. As the developed\nmodel includes the computation of the evolution of the thermo-physical\nproperties, its results are validated through comparison with experimental DSC\ncurves measured during the non-isothermal loading of as-built LPBF AlSi10Mg.\nThe computed microstructure evolution reproduces the microstructural\nobservation and successfully explains the peaks in the DSC heat flow curve. It\nthus elucidates the detailed microstructural evolution inside the eutectic\nsilicon phase by considering the growth and coalescence of silicon precipitates\nand the matrix desaturation.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"3dSc5F_51G7906aM0fcJ8Qs1EGOs_d8P-NH40RVdFS4","pdfSize":"4300417"}