{"id":"2407.06233","title":"AI and Social Theory","authors":"Jakob Mokander and Ralph Schroeder","authorsParsed":[["Mokander","Jakob",""],["Schroeder","Ralph",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 12:26:16 GMT"}],"updateDate":"2024-07-10","timestamp":1720355176000,"abstract":"  In this paper, we sketch a programme for AI driven social theory. We begin by\ndefining what we mean by artificial intelligence (AI) in this context. We then\nlay out our model for how AI based models can draw on the growing availability\nof digital data to help test the validity of different social theories based on\ntheir predictive power. In doing so, we use the work of Randall Collins and his\nstate breakdown model to exemplify that, already today, AI based models can\nhelp synthesize knowledge from a variety of sources, reason about the world,\nand apply what is known across a wide range of problems in a systematic way.\nHowever, we also find that AI driven social theory remains subject to a range\nof practical, technical, and epistemological limitations. Most critically,\nexisting AI systems lack three essential capabilities needed to advance social\ntheory in ways that are cumulative, holistic, open-ended, and purposeful. These\nare (1) semanticization, i.e., the ability to develop and operationalize verbal\nconcepts to represent machine-manipulable knowledge, (2) transferability, i.e.,\nthe ability to transfer what has been learned in one context to another, and\n(3) generativity, i.e., the ability to independently create and improve on\nconcepts and models. We argue that if the gaps identified here are addressed by\nfurther research, there is no reason why, in the future, the most advanced\nprogramme in social theory should not be led by AI-driven cumulative advances.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"dIoY1Bum3Mrt0hgq0YWedkfmPFbr9PmWJZaSzWsT3Ck","pdfSize":"450060"}