{"id":"2407.16290","title":"When Knots are Plectonemes","authors":"Fei Zheng, Antonio Suma, Christopher Maffeo, Kaikai Chen, Mohammed\n  Alawami, Jingjie Sha, Aleksei Aksimentiev, Cristian Micheletti, Ulrich F\n  Keyser","authorsParsed":[["Zheng","Fei",""],["Suma","Antonio",""],["Maffeo","Christopher",""],["Chen","Kaikai",""],["Alawami","Mohammed",""],["Sha","Jingjie",""],["Aksimentiev","Aleksei",""],["Micheletti","Cristian",""],["Keyser","Ulrich F",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 08:45:23 GMT"}],"updateDate":"2024-07-24","timestamp":1721724323000,"abstract":"  The transport of DNA polymers through nanoscale pores is central to many\nbiological processes, from bacterial gene exchange to viral infection. In\nsingle-molecule nanopore sensing, the detection of nucleic acid and protein\nanalytes relies on the passage of a long biopolymer through a nanoscale\naperture. Understanding the dynamics of polymer translocation through\nnanopores, especially the relation between ionic current signal and polymer\nconformations is thus essential for the successful identification of targets.\nHere, by analyzing ionic current traces of dsDNA translocation, we reveal that\nfeatures up to now uniquely associated with knots are instead different\nstructural motifs: plectonemes. By combining experiments and simulations, we\ndemonstrate that such plectonemes form because of the solvent flow that induces\nrotation of the helical DNA fragment in the nanopore, causing torsion\npropagation outwards from the pore. Molecular dynamic simulations reveal that\nplectoneme initialization is dominated by the applied torque while the\ntranslocation time and size of the plectonemes depend on the coupling of torque\nand pulling force, a mechanism that might also be relevant for in vivo DNA\norganization. Experiments with nicked DNA constructs show that the number of\nplectonemes depends on the rotational constraints of the translocating\nmolecules. Thus, our work introduces plectonemes as essential structural\nfeatures that must be considered for accurate analysis of polymer transport in\nthe nanopore.\n","subjects":["Condensed Matter/Soft Condensed Matter","Condensed Matter/Mesoscale and Nanoscale Physics","Physics/Biological Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"z7bmzwl3VqXs8t8UvhPbsI9wT5oZaVyzZCgTaiTSXIQ","pdfSize":"2046565"}