{"id":"2407.07354","title":"Asymmetric Fluid Flow in Helical Pipes Inspired by Shark Intestines","authors":"Ido Levin, Naroa Sadaba, Alshakim Nelson and Sarah L. Keller\n  (Department of Chemistry, University of Washington - Seattle)","authorsParsed":[["Levin","Ido","","Department of Chemistry, University of Washington - Seattle"],["Sadaba","Naroa","","Department of Chemistry, University of Washington - Seattle"],["Nelson","Alshakim","","Department of Chemistry, University of Washington - Seattle"],["Keller","Sarah L.","","Department of Chemistry, University of Washington - Seattle"]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 04:18:57 GMT"}],"updateDate":"2024-07-11","timestamp":1720585137000,"abstract":"  Unlike human intestines, which are long, hollow tubes, the intestines of\nsharks and rays contain interior helical structures surrounding a cylindrical\nhole. One function of these structures may be to create asymmetric flow,\nfavoring passage of fluid down the digestive tract, from anterior to posterior.\nHere, we design and 3D print biomimetic models of shark intestines, in both\nrigid and deformable materials. We use the rigid models to test which physical\nparameters of the interior helices (the pitch, the hole radius, the tilt angle,\nand the number of turns) yield the largest flow asymmetries. These asymmetries\nexceed those of traditional Tesla valves, structures specifically designed to\ncreate flow asymmetry without any moving parts. When we print the biomimetic\nmodels in elastomeric materials so that flow can couple to the structure's\nshape, flow asymmetry is significantly amplified; it is 7-fold larger in\ndeformable structures than in rigid structures. Last, we 3D-print deformable\nversions of the intestine of a dogfish shark, based on a tomogram of a\nbiological sample. This biomimic produces flow asymmetry comparable to\ntraditional Tesla valves. The ability to influence the direction of a flow\nthrough a structure has applications in biological tissues and artificial\ndevices across many scales, from large industrial pipelines to small\nmicrofluidic devices.\n","subjects":["Physics/Fluid Dynamics","Condensed Matter/Soft Condensed Matter"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"nZOGC1HsMtiHVkPhiSkYN8Ft8PHfYMxo7mDE4tr3_yk","pdfSize":"7330240"}