{"id":"2407.02018","title":"A Proposal for a FAIR Management of 3D Data in Cultural Heritage: The\n  Aldrovandi Digital Twin Case","authors":"Sebastian Barzaghi, Alice Bordignon, Bianca Gualandi, Ivan Heibi,\n  Arcangelo Massari, Arianna Moretti, Silvio Peroni, Giulia Renda","authorsParsed":[["Barzaghi","Sebastian",""],["Bordignon","Alice",""],["Gualandi","Bianca",""],["Heibi","Ivan",""],["Massari","Arcangelo",""],["Moretti","Arianna",""],["Peroni","Silvio",""],["Renda","Giulia",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 07:39:12 GMT"},{"version":"v2","created":"Fri, 13 Sep 2024 18:56:23 GMT"}],"updateDate":"2024-09-17","timestamp":1719905952000,"abstract":"  In this article we analyse 3D models of cultural heritage with the aim of\nanswering three main questions: what processes can be put in place to create a\nFAIR-by-design digital twin of a temporary exhibition? What are the main\nchallenges in applying FAIR principles to 3D data in cultural heritage studies\nand how are they different from other types of data (e.g. images) from a data\nmanagement perspective? We begin with a comprehensive literature review\ntouching on: FAIR principles applied to cultural heritage data; representation\nmodels; both Object Provenance Information (OPI) and Metadata Record Provenance\nInformation (MRPI), respectively meant as, on the one hand, the detailed\nhistory and origin of an object, and - on the other hand - the detailed history\nand origin of the metadata itself, which describes the primary object (whether\nphysical or digital); 3D models as cultural heritage research data and their\ncreation, selection, publication, archival and preservation. We then describe\nthe process of creating the Aldrovandi Digital Twin, by collecting, storing and\nmodelling data about cultural heritage objects and processes. We detail the\nmany steps from the acquisition of the Digital Cultural Heritage Objects\n(DCHO), through to the upload of the optimised DCHO onto a web-based framework\n(ATON), with a focus on open technologies and standards for interoperability\nand preservation. Using the FAIR Principles for Heritage Library, Archive and\nMuseum Collections as a framework, we look in detail at how the Digital Twin\nimplements FAIR principles at the object and metadata level. We then describe\nthe main challenges we encountered and we summarise what seem to be the\npeculiarities of 3D cultural heritage data and the possible directions for\nfurther research in this field.\n","subjects":["Computing Research Repository/Digital Libraries","Computing Research Repository/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"cQ7VIGIV46VnzF4OtLLGJzsMxkQPHmmA41mARQ4PD7E","pdfSize":"609059"}