{"id":"2407.16519","title":"Application of the Eddington inversion method to constrain the dark\n  matter halo of galaxies using only observed surface brightness profiles","authors":"Jorge Sanchez Almeida (1 and 2), Angel R. Plastino (3), Ignacio\n  Trujillo (1 and 2) ((1) Instituto de Astrofisica de Canarias, La Laguna,\n  Tenerife, Spain, (2) Universidad de La Laguna, Spain, (3) CeBio y\n  Departamento de Ciencias Basicas, UNNOBA, CONICET, Junin, Argentina)","authorsParsed":[["Almeida","Jorge Sanchez","","1 and 2"],["Plastino","Angel R.","","1 and 2"],["Trujillo","Ignacio","","1 and 2"]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 14:32:50 GMT"}],"updateDate":"2024-07-24","timestamp":1721745170000,"abstract":"  *** Context: The halos of low-mass galaxies may allow us to constrain the\nnature of dark matter (DM), but the kinematic measurements to diagnose the\nrequired properties are technically extremely challenging. However, the\nphotometry of these systems is doable. Aims. Using only stellar photometry,\nconstrain key properties of the DM haloes in low-mass galaxies. *** Methods:\nUnphysical pairs of DM gravitational potentials and starlight distributions can\nbe identified if the pair requires a distribution function f that is negative\nsomewhere in the phase space. We use the classical Eddington inversion method\n(EIM) to compute f for a battery of DM gravitational potentials and around 100\nobserved low-mass galaxies with Mstar between 10**6 and 10**8 Msun. The battery\nincludes NFW potentials (expected from cold DM) and potentials stemming from\ncored mass distributions (expected in many alternatives to cold DM). The method\nassumes spherical symmetry and isotropic velocity distribution and requires\nfitting the observed profiles with analytic functions, for which we use\npolytropes (with zero inner slope, a.k.a. core) and profiles with variable\ninner and outer slopes. The validity of all these assumptions is analyzed. ***\nResults: In general, the polytropes fit well the observed starlight profiles.\nIf they were the correct fits (which could be the case) then all galaxies are\ninconsistent with NFW-like potentials. Alternatively, when the inner slope is\nallowed to vary for fitting, between 40% and 70% of the galaxies are consistent\nwith cores in the stellar mass distribution and thus inconsistent with NFW-like\npotentials. *** Conclusions: Even though the stellar mass of the observed\ngalaxies is still not low enough to constrain the nature of DM, this work shows\nthe practical feasibility of the EIM technique to infer DM properties only from\nphotometry.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_JoboUvW-vK7GQXDesyQArfnqQFTwdqM9TS5zrbPALk","pdfSize":"1185131"}