{"id":"2407.03025","title":"XMM-Newton and NuSTAR discovery of a likely IP candidate XMMU\n  J173029.8-330920 in the Galactic Disk","authors":"Samaresh Mondal, Gabriele Ponti, Luke Filor, Tong Bao, Frank Haberl,\n  Ciro Salcedo, Sergio Campana, Charles J. Hailey, Kaya Mori, and Nanda Rea","authorsParsed":[["Mondal","Samaresh",""],["Ponti","Gabriele",""],["Filor","Luke",""],["Bao","Tong",""],["Haberl","Frank",""],["Salcedo","Ciro",""],["Campana","Sergio",""],["Hailey","Charles J.",""],["Mori","Kaya",""],["Rea","Nanda",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 11:35:26 GMT"}],"updateDate":"2024-09-18","timestamp":1720006526000,"abstract":"  We aim at characterizing the population of low-luminosity X-ray sources in\nthe Galactic plane by studying their X-ray spectra and periodic signals in the\nlight curves. We are performing an X-ray survey of the Galactic disk using\nXMM-Newton, and the source XMMU J173029.8-330920 was serendipitously discovered\nin our campaign. We performed a follow-up observation of the source using our\npre-approved NuSTAR target of opportunity time. We used various\nphenomenological models in xspec for the X-ray spectral modeling. We also\ncomputed the Lomb-Scargle periodogram to search for X-ray periodicity. A Monte\nCarlo method was used to simulate 1000 artificial light curves to estimate the\nsignificance of the detected period. We also searched for X-ray, optical, and\ninfrared counterparts of the source in various catalogs. The spectral modeling\nindicates the presence of an intervening cloud with $N_{\\rm\nH}\\sim(1.5-2.3)\\times10^{23}\\ \\rm cm^{-2}$ that partially absorbs the incoming\nX-ray photons. The X-ray spectra are best fit by a model representing emission\nfrom a collisionally ionized diffuse gas with plasma temperature\n$kT=26^{+11}_{-5}$ keV. Furthermore, an Fe $K_{\\alpha}$ line at\n$6.47^{+0.13}_{-0.06}$ keV was detected with an equivalent width of the line of\n$312\\pm104$ eV. We discovered a coherent pulsation with a period of\n$521.7\\pm0.8$ s. The 3-10 keV pulsed fraction of the source is around\n$\\sim$50-60\\%. The hard X-ray emission with plasma temperature\n$kT=26^{+11}_{-5}$ keV, iron $K_{\\alpha}$ emission at 6.4 keV and a periodic\nbehavior of $521.7\\pm0.8$ s suggest XMMU J173029.8-33092 to be an intermediate\npolar. We estimated the mass of the central white dwarf to be $0.94-1.4\\\nM_{\\odot}$ by assuming a distance to the source of $\\sim1.4-5$ kpc.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"v2LZ2O-zphQ1P0lU6wYI1H4SUq6bcsaZfA4Mk8Ev2Ys","pdfSize":"476178"}