{"id":"2407.10090","title":"ReactAIvate: A Deep Learning Approach to Predicting Reaction Mechanisms\n  and Unmasking Reactivity Hotspots","authors":"Ajnabiul Hoque, Manajit Das, Mayank Baranwal and Raghavan B. Sunoj","authorsParsed":[["Hoque","Ajnabiul",""],["Das","Manajit",""],["Baranwal","Mayank",""],["Sunoj","Raghavan B.",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 05:53:18 GMT"}],"updateDate":"2024-07-16","timestamp":1720936398000,"abstract":"  A chemical reaction mechanism (CRM) is a sequence of molecular-level events\ninvolving bond-breaking/forming processes, generating transient intermediates\nalong the reaction pathway as reactants transform into products. Understanding\nsuch mechanisms is crucial for designing and discovering new reactions. One of\nthe currently available methods to probe CRMs is quantum mechanical (QM)\ncomputations. The resource-intensive nature of QM methods and the scarcity of\nmechanism-based datasets motivated us to develop reliable ML models for\npredicting mechanisms. In this study, we created a comprehensive dataset with\nseven distinct classes, each representing uniquely characterized elementary\nsteps. Subsequently, we developed an interpretable attention-based GNN that\nachieved near-unity and 96% accuracy, respectively for reaction step\nclassification and the prediction of reactive atoms in each such step,\ncapturing interactions between the broader reaction context and local active\nregions. The near-perfect classification enables accurate prediction of both\nindividual events and the entire CRM, mitigating potential drawbacks of Seq2Seq\napproaches, where a wrongly predicted character leads to incoherent CRM\nidentification. In addition to interpretability, our model adeptly identifies\nkey atom(s) even from out-of-distribution classes. This generalizabilty allows\nfor the inclusion of new reaction types in a modular fashion, thus will be of\nvalue to experts for understanding the reactivity of new molecules.\n","subjects":["Physics/Chemical Physics","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"fjIqQWEm4LcP-g36r9zg6LPGFqiFjj_iuAC2lZYsvSg","pdfSize":"11222805","objectId":"0xdcedae25b9c3509d1b904164d614a756d6f038173d3df4d52f6163364565c611","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
