{"id":"2407.21428","title":"Deformable 3D Shape Diffusion Model","authors":"Dengsheng Chen, Jie Hu, Xiaoming Wei, Enhua Wu","authorsParsed":[["Chen","Dengsheng",""],["Hu","Jie",""],["Wei","Xiaoming",""],["Wu","Enhua",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 08:24:42 GMT"}],"updateDate":"2024-08-01","timestamp":1722414282000,"abstract":"  The Gaussian diffusion model, initially designed for image generation, has\nrecently been adapted for 3D point cloud generation. However, these adaptations\nhave not fully considered the intrinsic geometric characteristics of 3D shapes,\nthereby constraining the diffusion model's potential for 3D shape manipulation.\nTo address this limitation, we introduce a novel deformable 3D shape diffusion\nmodel that facilitates comprehensive 3D shape manipulation, including point\ncloud generation, mesh deformation, and facial animation. Our approach\ninnovatively incorporates a differential deformation kernel, which deconstructs\nthe generation of geometric structures into successive non-rigid deformation\nstages. By leveraging a probabilistic diffusion model to simulate this\nstep-by-step process, our method provides a versatile and efficient solution\nfor a wide range of applications, spanning from graphics rendering to facial\nexpression animation. Empirical evidence highlights the effectiveness of our\napproach, demonstrating state-of-the-art performance in point cloud generation\nand competitive results in mesh deformation. Additionally, extensive visual\ndemonstrations reveal the significant potential of our approach for practical\napplications. Our method presents a unique pathway for advancing 3D shape\nmanipulation and unlocking new opportunities in the realm of virtual reality.\n","subjects":["Computing Research Repository/Graphics","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"C3S0ee66TTA-Gl5Is9LGzJJ-fOtbId0EUytofvJjpgA","pdfSize":"18944666"}