{"id":"2407.11677","title":"Video-Language Alignment via Spatio-Temporal Graph Transformer","authors":"Shi-Xue Zhang, Hongfa Wang, Xiaobin Zhu, Weibo Gu, Tianjin Zhang, Chun\n  Yang, Wei Liu, Xu-Cheng Yin","authorsParsed":[["Zhang","Shi-Xue",""],["Wang","Hongfa",""],["Zhu","Xiaobin",""],["Gu","Weibo",""],["Zhang","Tianjin",""],["Yang","Chun",""],["Liu","Wei",""],["Yin","Xu-Cheng",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 12:52:32 GMT"},{"version":"v2","created":"Tue, 23 Jul 2024 18:48:06 GMT"}],"updateDate":"2024-07-25","timestamp":1721134352000,"abstract":"  Video-language alignment is a crucial multi-modal task that benefits various\ndownstream applications, e.g., video-text retrieval and video question\nanswering. Existing methods either utilize multi-modal information in\nvideo-text pairs or apply global and local alignment techniques to promote\nalignment precision. However, these methods often fail to fully explore the\nspatio-temporal relationships among vision tokens within video and across\ndifferent video-text pairs. In this paper, we propose a novel Spatio-Temporal\nGraph Transformer module to uniformly learn spatial and temporal contexts for\nvideo-language alignment pre-training (dubbed STGT). Specifically, our STGT\ncombines spatio-temporal graph structure information with attention in\ntransformer block, effectively utilizing the spatio-temporal contexts. In this\nway, we can model the relationships between vision tokens, promoting video-text\nalignment precision for benefiting downstream tasks. In addition, we propose a\nself-similarity alignment loss to explore the inherent self-similarity in the\nvideo and text. With the initial optimization achieved by contrastive learning,\nit can further promote the alignment accuracy between video and text.\nExperimental results on challenging downstream tasks, including video-text\nretrieval and video question answering, verify the superior performance of our\nmethod.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"6bHU7RhL6YGBY5XJNf2Kgt6ws7T3xyxAUWtHtEpa6S8","pdfSize":"10800165"}