{"id":"2407.19205","title":"Faster Image2Video Generation: A Closer Look at CLIP Image Embedding's\n  Impact on Spatio-Temporal Cross-Attentions","authors":"Ashkan Taghipour, Morteza Ghahremani, Mohammed Bennamoun, Aref Miri\n  Rekavandi, Zinuo Li, Hamid Laga, Farid Boussaid","authorsParsed":[["Taghipour","Ashkan",""],["Ghahremani","Morteza",""],["Bennamoun","Mohammed",""],["Rekavandi","Aref Miri",""],["Li","Zinuo",""],["Laga","Hamid",""],["Boussaid","Farid",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 08:21:14 GMT"}],"updateDate":"2024-07-30","timestamp":1722068474000,"abstract":"  This paper investigates the role of CLIP image embeddings within the Stable\nVideo Diffusion (SVD) framework, focusing on their impact on video generation\nquality and computational efficiency. Our findings indicate that CLIP\nembeddings, while crucial for aesthetic quality, do not significantly\ncontribute towards the subject and background consistency of video outputs.\nMoreover, the computationally expensive cross-attention mechanism can be\neffectively replaced by a simpler linear layer. This layer is computed only\nonce at the first diffusion inference step, and its output is then cached and\nreused throughout the inference process, thereby enhancing efficiency while\nmaintaining high-quality outputs. Building on these insights, we introduce the\nVCUT, a training-free approach optimized for efficiency within the SVD\narchitecture. VCUT eliminates temporal cross-attention and replaces spatial\ncross-attention with a one-time computed linear layer, significantly reducing\ncomputational load. The implementation of VCUT leads to a reduction of up to\n322T Multiple-Accumulate Operations (MACs) per video and a decrease in model\nparameters by up to 50M, achieving a 20% reduction in latency compared to the\nbaseline. Our approach demonstrates that conditioning during the Semantic\nBinding stage is sufficient, eliminating the need for continuous computation\nacross all inference steps and setting a new standard for efficient video\ngeneration.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"j5bIY4qIkVEoV5PkJ2ddSfGpyitBTNxO6GqCIyD0obM","pdfSize":"1247965"}