{"id":"2407.15469","title":"Numerical simulations of attachment-line boundary layer in hypersonic\n  flow, Part II: the features of three-dimensional turbulent boundary layer","authors":"Youcheng Xi, Bowen Yan, Guangwen Yang and Song Fu","authorsParsed":[["Xi","Youcheng",""],["Yan","Bowen",""],["Yang","Guangwen",""],["Fu","Song",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 08:29:16 GMT"}],"updateDate":"2024-07-23","timestamp":1721636956000,"abstract":"  In this study,we investigate the characteristics of three-dimensional\nturbulent boundary layers influenced by transverse flow and pressure gradients.\nOur findings reveal that even without assuming an infinite sweep, a fully\ndeveloped turbulent boundary layer over the present swept blunt body maintains\nspanwise homogeneity, consistent with infinite sweep assumptions.We critically\nexamine the law-of-the and temperature-velocity relationships, typically\napplied two-dimensional turbulent boundary layers, in three-dimensional\ncontexts. Results show that with transverse velocity and pressure gradient,\nstreamwise velocity adheres to classical velocity transformation relationships\nand the predictive accuracy of classical temperaturevelocity relationships\ndiminishes because of pressure gradient. We show that near-wall streak\nstructures persist and correspond with energetic structures in the outer\nregion, though three-dimensional effects redistribute energy to align more with\nthe external flow direction. Analysis of shear Reynolds stress and mean flow\nshear directions reveals in near-wall regions with low transverse flow\nvelocity, but significant deviations at higher transverse velocities.\nIntroduction of transverse pressure gradients together with the transverse\nvelocities alter the velocity profile and mean flow shear directions, with\nshear Reynolds stress experiencing similar changes but with a lag increasing\nwith transverse. Consistent directional alignment in outer regions suggests a\npartitioned relationship between shear Reynolds stress and mean flow shear:\nnonlinear in the inner region and approximately linear in the outer region.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"CdN2XDZADZHQRqBvYsLgk6mZacCHWakJok9X9dvby7k","pdfSize":"17135106","objectId":"0x144fc5ef8f5115f83307f4cd4737af5d89eb2e382009c70d758fc6be8606c01b","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
