{"id":"2407.04102","title":"Uncovering low-frequency vibrations in surface-enhanced Raman of organic\n  molecules","authors":"Alexandra Boehmke, Roberto A Boto, Eoin Elliot, Bart de Nijs, Ruben\n  Esteban, Tam\\'as F\\\"oldes, Fernando Aguilar-Galindo, Edina Rosta, Javier\n  Aizpurua, Jeremy J Baumberg","authorsParsed":[["Boehmke","Alexandra",""],["Boto","Roberto A",""],["Elliot","Eoin",""],["de Nijs","Bart",""],["Esteban","Ruben",""],["Földes","Tamás",""],["Aguilar-Galindo","Fernando",""],["Rosta","Edina",""],["Aizpurua","Javier",""],["Baumberg","Jeremy J",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 18:06:46 GMT"}],"updateDate":"2024-07-08","timestamp":1720116406000,"abstract":"  Accessing the terahertz (THz) spectral domain through surface-enhanced Raman\nspectroscopy (SERS) is challenging and opens up the study of low-frequency\nmolecular and electronic excitations. Compared to direct THz probing of\nheterogenous ensembles, the extreme plasmonic confinement of visible light to\ndeep sub-wavelength scales allows the study of hundreds or even single\nmolecules. We show that self-assembled molecular monolayers of a set of simple\naromatic thiols confined inside single-particle plasmonic nanocavities can be\ndistinguished by their low-wavenumber spectral peaks below 200 cm-1, after\nremoval of a bosonic inelastic contribution and an exponential background from\nthe spectrum Developing environment-dependent density-functional-theory\nsimulations of the metal-molecule configuration enables the assignment and\nclassification of their THz vibrations as well as the identification of\nintermolecular coupling effects and of the influence of the gold surface\nconfiguration Furthermore, we show dramatically narrower THz SERS spectra from\nindividual molecules at picocavities, which indicates the possibility to study\nintrinsic vibrational properties beyond inhomogeneous broadening further\nsupporting the key role of local environment.\n","subjects":["Physics/Optics","Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"V2zTCHrm_2ULi6At6b3TRNkzul2__FUphCxGjlomzjY","pdfSize":"857634"}
