{"id":"2407.20500","title":"An analog of topological entanglement entropy for mixed states","authors":"Ting-Tung Wang, Menghan Song, Zi Yang Meng, Tarun Grover","authorsParsed":[["Wang","Ting-Tung",""],["Song","Menghan",""],["Meng","Zi Yang",""],["Grover","Tarun",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 02:26:45 GMT"}],"updateDate":"2024-07-31","timestamp":1722306405000,"abstract":"  We propose the convex-roof extension of quantum conditional mutual\ninformation (\"co(QCMI)\") as a diagnostic of long-range entanglement in a mixed\nstate. We focus primarily on topological states subjected to local decoherence,\nand employ the Levin-Wen scheme to define co(QCMI), so that for a pure state,\nco(QCMI) equals topological entanglement entropy (TEE). By construction,\nco(QCMI) is zero if and only if a mixed state can be decomposed as a convex sum\nof pure states with zero TEE. We show that co(QCMI) is non-increasing with\nincreasing decoherence when Kraus operators are proportional to the product of\nonsite unitaries. This implies that unlike a pure state transition between a\ntopologically trivial and a non-trivial phase, the long-range entanglement at a\ndecoherence-induced topological phase transition as quantified by co(QCMI) is\nless than or equal to that in the proximate topological phase. For the 2d toric\ncode decohered by onsite bit/phase-flip noise, we show that co(QCMI) is\nnon-zero below the error-recovery threshold and zero above it. Relatedly, the\ndecohered state cannot be written as a convex sum of short-range entangled pure\nstates below the threshold. We conjecture and provide evidence that in this\nexample, co(QCMI) equals TEE of a recently introduced pure state. In\nparticular, we develop a tensor-assisted Monte Carlo (TMC) computation method\nto efficiently evaluate the R\\'enyi TEE for the aforementioned pure state and\nprovide non-trivial consistency checks for our conjecture. We use TMC to also\ncalculate the universal scaling dimension of the anyon-condensation order\nparameter at this transition.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Statistical Mechanics","Condensed Matter/Strongly Correlated Electrons","Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"FHuUiNyIXER2CpLcOU4uUaQOXTE0l3GGeFtCaHekOxU","pdfSize":"5955141"}