{"id":"2407.11218","title":"Walk along: An Experiment on Controlling the Mobile Robot 'Spot' with\n  Voice and Gestures","authors":"Renchi Zhang, Jesse van der Linden, Dimitra Dodou, Harleigh Seyffert,\n  Yke Bauke Eisma, Joost C. F. de Winter","authorsParsed":[["Zhang","Renchi",""],["van der Linden","Jesse",""],["Dodou","Dimitra",""],["Seyffert","Harleigh",""],["Eisma","Yke Bauke",""],["de Winter","Joost C. F.",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 20:07:33 GMT"},{"version":"v2","created":"Wed, 17 Jul 2024 07:48:45 GMT"}],"updateDate":"2024-07-18","timestamp":1721074053000,"abstract":"  Robots are becoming increasingly intelligent and can autonomously perform\ntasks such as navigating between locations. However, human oversight remains\ncrucial. This study compared two hands-free methods for directing mobile\nrobots: voice control and gesture control. These methods were tested with the\nhuman stationary and walking freely. We hypothesized that walking with the\nrobot would lead to higher intuitiveness ratings and better task performance\ndue to increased stimulus-response compatibility, assuming humans align\nthemselves with the robot. In a 2x2 within-subject design, 218 participants\nguided the quadrupedal robot Spot using 90 degrees rotation and walk-forward\ncommands. After each trial, participants rated the intuitiveness of the command\nmapping, while post-experiment interviews were used to gather the participants'\npreferences. Results showed that voice control combined with walking with Spot\nwas the most favored and intuitive, while gesture control while standing caused\nconfusion for left/right commands. Despite this, 29% of participants preferred\ngesture control, citing task engagement and visual congruence as reasons. An\nodometry-based analysis revealed that participants aligned behind Spot,\nparticularly in the gesture control condition, when allowed to walk. In\nconclusion, voice control with walking produced the best outcomes. Improving\nphysical ergonomics and adjusting gesture types could improve the effectiveness\nof gesture control.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"ePTgCU6FNhj3gAr36yv23-mRqslojpzrK2JXHm6qq3c","pdfSize":"12520746"}