{"id":"2407.03381","title":"SeqMate: A Novel Large Language Model Pipeline for Automating RNA\n  Sequencing","authors":"Devam Mondal, Atharva Inamdar","authorsParsed":[["Mondal","Devam",""],["Inamdar","Atharva",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 20:28:30 GMT"}],"updateDate":"2024-07-08","timestamp":1719952110000,"abstract":"  RNA sequencing techniques, like bulk RNA-seq and Single Cell (sc) RNA-seq,\nare critical tools for the biologist looking to analyze the genetic\nactivity/transcriptome of a tissue or cell during an experimental procedure.\nPlatforms like Illumina's next-generation sequencing (NGS) are used to produce\nthe raw data for this experimental procedure. This raw FASTQ data must then be\nprepared via a complex series of data manipulations by bioinformaticians. This\nprocess currently takes place on an unwieldy textual user interface like a\nterminal/command line that requires the user to install and import multiple\nprogram packages, preventing the untrained biologist from initiating data\nanalysis. Open-source platforms like Galaxy have produced a more user-friendly\npipeline, yet the visual interface remains cluttered and highly technical,\nremaining uninviting for the natural scientist. To address this, SeqMate is a\nuser-friendly tool that allows for one-click analytics by utilizing the power\nof a large language model (LLM) to automate both data preparation and analysis\n(differential expression, trajectory analysis, etc). Furthermore, by utilizing\nthe power of generative AI, SeqMate is also capable of analyzing such findings\nand producing written reports of upregulated/downregulated/user-prompted genes\nwith sources cited from known repositories like PubMed, PDB, and Uniprot.\n","subjects":["Quantitative Biology/Genomics","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"XOd1AL6Rk276wYsgNEmoBDY4JIavXcBZLuDDjTHpA5s","pdfSize":"172271"}
