{"id":"2407.16815","title":"Local subcell monolithic DG/FV convex property preserving scheme on\n  unstructured grids and entropy consideration","authors":"Fran\\c{c}ois Vilar","authorsParsed":[["Vilar","François",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 19:59:29 GMT"}],"updateDate":"2024-07-25","timestamp":1721764769000,"abstract":"  This article aims at presenting a new local subcell monolithic\nDiscontinuous-Galerkin/Finite-Volume (DG/FV) convex property preserving scheme\nsolving system of conservation laws on 2D unstructured grids. This is known\nthat DG method needs some sort of nonlinear limiting to avoid spurious\noscillations or nonlinear instabilities which may lead to the crash of the\ncode. The main idea motivating the present work is to improve the robustness of\nDG schemes, while preserving as much as possible its high accuracy and very\nprecise subcell resolution. To do so, a convex blending of high-order DG and\nfirst-order FV scheme will be locally performed, at the subcell scale, where it\nis needed. To this end, by means of the theory developed in our previous work,\nwe first recall that it is possible to rewrite DG scheme as a subcell FV scheme\non a subgrid provided with some specific numerical fluxes referred to as DG\nreconstructed fluxes. Then, the monolithic DG/FV method will be defined as\nfollowing: each face of each subcell will be assigned with two fluxes, a\n1st-order FV one and a high-order reconstructed one, that in the end will be\nblended in a convex way. The goal is then to determine, through analysis,\noptimal blending coefficients to achieve the desire properties. Numerical\nresults on various type problems will be presented to assess the very good\nperformance of the design method. A particular emphasis will be put on entropy\nconsideration. By means of this subcell monolithic framework, we will attempt\nto address the following questions: is this possible through this monolithic\nframework to ensure any entropy stability? what do we mean by entropy\nstability? What is the cost of such constraints? Is this absolutely needed\nwhile aiming for high-order accuracy?\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"erldgQSVr2bFD88pLUR9enhYasDcIZGkHXsAgRT0cEo","pdfSize":"12596508"}