{"id":"2407.08919","title":"Redefinition of Digital Twin and its Situation Awareness Framework\n  Designing Towards Fourth Paradigm for Energy Internet of Things","authors":"Xing He, Yuezhong Tang, Shuyan Ma, Qian Ai, Fei Tao, Robert Qiu","authorsParsed":[["He","Xing",""],["Tang","Yuezhong",""],["Ma","Shuyan",""],["Ai","Qian",""],["Tao","Fei",""],["Qiu","Robert",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 01:49:27 GMT"}],"updateDate":"2024-07-15","timestamp":1720748967000,"abstract":"  Traditional knowledge-based situation awareness (SA) modes struggle to adapt\nto the escalating complexity of today's Energy Internet of Things (EIoT),\nnecessitating a pivotal paradigm shift. In response, this work introduces a\npioneering data-driven SA framework, termed digital twin-based situation\nawareness (DT-SA), aiming to bridge existing gaps between data and demands, and\nfurther to enhance SA capabilities within the complex EIoT landscape. First, we\nredefine the concept of digital twin (DT) within the EIoT context, aligning it\nwith data-intensive scientific discovery paradigm (the Fourth Paradigm) so as\nto waken EIoT's sleeping data; this contextual redefinition lays the\ncornerstone of our DT-SA framework for EIoT. Then, the framework is\ncomprehensively explored through its four fundamental steps: digitalization,\nsimulation, informatization, and intellectualization. These steps initiate a\nvirtual ecosystem conducive to a continuously self-adaptive, self-learning, and\nself-evolving big model (BM), further contributing to the evolution and\neffectiveness of DT-SA in engineering. Our framework is characterized by the\nincorporation of system theory and Fourth Paradigm as guiding ideologies, DT as\ndata engine, and BM as intelligence engine. This unique combination forms the\nbackbone of our approach. This work extends beyond engineering, stepping into\nthe domain of data science -- DT-SA not only enhances management practices for\nEIoT users/operators, but also propels advancements in pattern analysis and\nmachine intelligence (PAMI) within the intricate fabric of a complex system.\nNumerous real-world cases validate our DT-SA framework.\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Computing Research Repository/Emerging Technologies","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"QAWhZonVwGY9ene7Eb46ArKaigdtsrlTaXVtoG2yTAw","pdfSize":"8620607"}