{"id":"2407.11289","title":"In-lab and On-sky Closed-loop Results of Adaptive Secondary Mirrors with\n  TNO's Hybrid Variable Reluctance Actuators","authors":"Ruihan Zhang, Max Baeten, Mark R. Chun, Ellen Lee, Michael Connelley,\n  Olivier Lai, Stefan Kuiper, Alan Ryan, Arjo Bos, Rachel Bowens-Rubin, and\n  Philip M. Hinz","authorsParsed":[["Zhang","Ruihan",""],["Baeten","Max",""],["Chun","Mark R.",""],["Lee","Ellen",""],["Connelley","Michael",""],["Lai","Olivier",""],["Kuiper","Stefan",""],["Ryan","Alan",""],["Bos","Arjo",""],["Bowens-Rubin","Rachel",""],["Hinz","Philip M.",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 00:18:39 GMT"}],"updateDate":"2024-07-17","timestamp":1721089119000,"abstract":"  We performed closed-loop lab testing of large-format deformable mirrors (DMs)\nwith hybrid variable reluctance actuators. TNO has been developing the hybrid\nvariable reluctance actuators in support for a new generation of adaptive\nsecondary mirrors (ASMs), which aim to be more robust and reliable. Compared to\nthe voice coil actuators, this new actuator technology has a higher current to\nforce efficiency, and thus can support DMs with thicker facesheets. Before\nputting this new technology on-sky, it is necessary to understand how to\ncontrol it and how it behaves in closed-loop. We performed closed-loop tests\nwith the Shack-Hartmann wavefront sensor with three large-format deformable\nmirrors that use the TNO actuators: DM3, FLASH, and IRTF-ASM-1 ASM. The\nwavefront sensor and the real-time control systems were developed for the NASA\nInfrared Telescope Facility (IRTF) and the UH 2.2-meter telescope ASMs. We\ntested IRTF-ASM-1 on-sky and proved that it meets all of our performance\nrequirements. This work presents our lab setup for the experiments, the\ntechniques we have employed to drive these new ASMs, the results of our\nclosed-loop lab tests for FLASH and IRTF-ASM-1, and the on-sky closed-loop\nresults of IRTF-ASM-1 ASM.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ND7Cg-t0j1mCoxYUl-1hFFrMzszgq8cJU0TKT8QkK2M","pdfSize":"1552811"}