{"id":"2407.18231","title":"Line Segment Tracking: Improving the Phase 2 CMS High Level Trigger\n  Tracking with a Novel, Hardware-Agnostic Pattern Recognition Algorithm","authors":"Emmanouil Vourliotis, Philip Chang, Peter Elmer, Yanxi Gu, Jonathan\n  Guiang, Vyacheslav Krutelyov, Balaji Venkat Sathia Narayanan, Gavin Niendorf,\n  Michael Reid, Mayra Silva, Andres Rios Tascon, Matev\\v{z} Tadel, Peter\n  Wittich, Avraham Yagil (on behalf of the CMS Collaboration)","authorsParsed":[["Vourliotis","Emmanouil","","on behalf of the CMS Collaboration"],["Chang","Philip","","on behalf of the CMS Collaboration"],["Elmer","Peter","","on behalf of the CMS Collaboration"],["Gu","Yanxi","","on behalf of the CMS Collaboration"],["Guiang","Jonathan","","on behalf of the CMS Collaboration"],["Krutelyov","Vyacheslav","","on behalf of the CMS Collaboration"],["Narayanan","Balaji Venkat Sathia","","on behalf of the CMS Collaboration"],["Niendorf","Gavin","","on behalf of the CMS Collaboration"],["Reid","Michael","","on behalf of the CMS Collaboration"],["Silva","Mayra","","on behalf of the CMS Collaboration"],["Tascon","Andres Rios","","on behalf of the CMS Collaboration"],["Tadel","Matevž","","on behalf of the CMS Collaboration"],["Wittich","Peter","","on behalf of the CMS Collaboration"],["Yagil","Avraham","","on behalf of the CMS Collaboration"]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 17:50:29 GMT"}],"updateDate":"2024-07-26","timestamp":1721929829000,"abstract":"  Charged particle reconstruction is one the most computationally heavy\ncomponents of the full event reconstruction of Large Hadron Collider (LHC)\nexperiments. Looking to the future, projections for the High Luminosity LHC\n(HL-LHC) indicate a superlinear growth for required computing resources for\nsingle-threaded CPU algorithms that surpass the computing resources that are\nexpected to be available. The combination of these facts creates the need for\nefficient and computationally performant pattern recognition algorithms that\nwill be able to run in parallel and possibly on other hardware, such as GPUs,\ngiven that these become more and more available in LHC experiments and\nhigh-performance computing centres. Line Segment Tracking (LST) is a novel such\nalgorithm which has been developed to be fully parallelizable and hardware\nagnostic. The latter is achieved through the usage of the Alpaka library. The\nLST algorithm has been tested with the CMS central software as an external\npackage and has been used in the context of the CMS HL-LHC High Level Trigger\n(HLT). When employing LST for pattern recognition in the HLT tracking, the\nphysics and timing performances are shown to improve with respect to the ones\nutilizing the current pattern recognition algorithms. The latest results on the\nusage of the LST algorithm within the CMS HL-LHC HLT are presented, along with\nprospects for further improvements of the algorithm and its CMS central\nsoftware integration.\n","subjects":["Physics/High Energy Physics - Experiment","Physics/Instrumentation and Detectors"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"EX7qk_ap-l00QbDhyXxEHn0I7VYgpnsjfyamy1aW5pM","pdfSize":"524138"}