{"id":"2407.01218","title":"Universal properties of residual moments in heavy-fermion metals","authors":"Ewan Scott and Michal Kwasigroch","authorsParsed":[["Scott","Ewan",""],["Kwasigroch","Michal",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 12:04:08 GMT"}],"updateDate":"2024-07-02","timestamp":1719835448000,"abstract":"  We identify common features, seen across a wide range of actinide and\nlanthanide based heavy-fermion metals, that we associate with the universal\nproperties of the residual moments generated by Kondo hybridisation. The\nfeatures include the opposing anisotropies of the effective moments and\nCurie-Weiss constants, the reorientation of the magnetic easy axis, the\nhard-axis susceptibility maximum and the hard-axis metamagnetic transition. The\nextension of large-$N$ Read-Newns theory to the underscreened Kondo lattice\nallows us to study large magnetic fluctuations of residual local moments in the\npresence of strong $f$-$d$ hybridisation. We derive an effective Hamiltonian\nfor the residual moments and show that competing single-ion and exchange\nanisotropies are responsible for the easy-axis reorientation. We identify a\nstrong-coupling regime, where the temperature of the easy-axis reorientation is\n{\\it directly proportional} to the coherence temperature and find good\nagreement across several Eu and U based heavy-fermion families, as well as a\nweak-coupling regime, where the easy axis flips just before the onset of\nmagnetic order, as is seen in many Ce and Yb heavy-fermion compounds. We show\nthat the exchange anisotropy of the residual moments can also generate a\nmaximum in the hard-axis susceptibility, and find good agreement with UTe$_2$\nat low pressures, suggesting that this material is particularly well described\nby the single-channel $S=1$ model. Finally, we speculate on the possible\npairing interactions generated by the fluctuations of the residual moments.\n","subjects":["Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"3b5Cuv5BT0vcYrF0rA5oZ82NZ9a21xKWOtNYn4DPzRM","pdfSize":"1075971"}