{"id":"2407.12547","title":"Existence and Stability of Dissipative Solitons in a Dual-Waveguide\n  Lattice with Linear Gain and Nonlinear Losses","authors":"Zhenfen Huang, Changming Huang, Chunyan Li, Pengcheng Liu, Liangwei\n  Dong","authorsParsed":[["Huang","Zhenfen",""],["Huang","Changming",""],["Li","Chunyan",""],["Liu","Pengcheng",""],["Dong","Liangwei",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 13:29:25 GMT"}],"updateDate":"2024-08-02","timestamp":1721222965000,"abstract":"  In this study, we investigate the existence and stability of in-phase and\nout-of-phase dissipative solitons in a dual-waveguide lattice with linear\nlocalized gain and nonlinear losses under both focusing and defocusing\nnonlinearities. Numerical results reveal that both types of dissipative\nsolitons bifurcate from the linear amplified modes, and their nonlinear\npropagation constant changes to a real value when nonlinearity, linear\nlocalized gain, and nonlinear losses coexist. We find that increasing the\nlinear gain coefficient leads to an increase in the power and propagation\nconstant of both types of dissipative solitons. For defocusing nonlinearity,\nin-phase solitons are stable across their entire existence region, while\nfocusing nonlinearity confines them to a small stable region near the lower\ncutoff value in the propagation constant. In contrast, out-of-phase solitons\nhave a significantly larger stable region under focusing nonlinearity compared\nto defocusing nonlinearity. The stability regions of both types of dissipative\nsolitons increase with increasing nonlinear losses coefficient. Additionally,\nwe validate the results of linear stability analysis for dissipative solitons\nusing propagation simulations, showing perfect agreement between the two\nmethods.\n","subjects":["Physics/Optics","Nonlinear Sciences/Pattern Formation and Solitons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"EGop5xljXWi5XnegQsWqNZQKjYzLGgQ6z5qSgiHSJ8M","pdfSize":"960916","objectId":"0x1065a9a00e73ce70fc76267c63edd933011445d6079adb9ddc94e67656c976f7","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
