{"id":"2407.13676","title":"Aligning Sight and Sound: Advanced Sound Source Localization Through\n  Audio-Visual Alignment","authors":"Arda Senocak, Hyeonggon Ryu, Junsik Kim, Tae-Hyun Oh, Hanspeter\n  Pfister, Joon Son Chung","authorsParsed":[["Senocak","Arda",""],["Ryu","Hyeonggon",""],["Kim","Junsik",""],["Oh","Tae-Hyun",""],["Pfister","Hanspeter",""],["Chung","Joon Son",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 16:51:15 GMT"}],"updateDate":"2024-07-19","timestamp":1721321475000,"abstract":"  Recent studies on learning-based sound source localization have mainly\nfocused on the localization performance perspective. However, prior work and\nexisting benchmarks overlook a crucial aspect: cross-modal interaction, which\nis essential for interactive sound source localization. Cross-modal interaction\nis vital for understanding semantically matched or mismatched audio-visual\nevents, such as silent objects or off-screen sounds. In this paper, we first\ncomprehensively examine the cross-modal interaction of existing methods,\nbenchmarks, evaluation metrics, and cross-modal understanding tasks. Then, we\nidentify the limitations of previous studies and make several contributions to\novercome the limitations. First, we introduce a new synthetic benchmark for\ninteractive sound source localization. Second, we introduce new evaluation\nmetrics to rigorously assess sound source localization methods, focusing on\naccurately evaluating both localization performance and cross-modal interaction\nability. Third, we propose a learning framework with a cross-modal alignment\nstrategy to enhance cross-modal interaction. Lastly, we evaluate both\ninteractive sound source localization and auxiliary cross-modal retrieval tasks\ntogether to thoroughly assess cross-modal interaction capabilities and\nbenchmark competing methods. Our new benchmarks and evaluation metrics reveal\npreviously overlooked issues in sound source localization studies. Our proposed\nnovel method, with enhanced cross-modal alignment, shows superior sound source\nlocalization performance. This work provides the most comprehensive analysis of\nsound source localization to date, with extensive validation of competing\nmethods on both existing and new benchmarks using new and standard evaluation\nmetrics.\n","subjects":["Computing Research Repository/Multimedia","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Sound","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"JgVrgWREWgzKMltYE8nFQWDA_1Ryt1Rs1tChtHxOwgE","pdfSize":"12770934"}