{"id":"2407.20905","title":"Confined Trions and Mott-Wigner States in a Purely Electrostatic Moir\\'e\n  Potential","authors":"Natasha Kiper, Haydn S. Adlong, Arthur Christianen, Martin Kroner,\n  Kenji Watanabe, Takashi Taniguchi, Atac Imamoglu","authorsParsed":[["Kiper","Natasha",""],["Adlong","Haydn S.",""],["Christianen","Arthur",""],["Kroner","Martin",""],["Watanabe","Kenji",""],["Taniguchi","Takashi",""],["Imamoglu","Atac",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 15:25:56 GMT"}],"updateDate":"2024-07-31","timestamp":1722353156000,"abstract":"  Moir\\'e heterostructures consisting of transition metal dichalcogenide (TMD)\nhetero- and homobilayers have emerged as a promising material platform to study\ncorrelated electronic states. Optical signatures of strong correlations in the\nform of Mott-Wigner states and fractional Chern insulators have already been\nobserved in TMD monolayers and their twisted bilayers. In this work, we use a\nmoir\\'e substrate containing a twisted hexagonal boron nitride (h-BN) interface\nto externally generate a superlattice potential for the TMD layer: the periodic\nstructure of ferroelectric domains in h-BN effects a purely electrostatic\npotential for charge carriers. We find direct evidence for the induced moir\\'e\npotential in the emergence of new excitonic resonances at integer fillings, and\nour observation of an enhancement of the trion binding energy by $\\simeq$ 3\nmeV. A theoretical model for exciton-electron interactions allows us to\ndirectly determine the moir\\'e potential modulation of 30$\\pm$5 meV from the\nmeasured trion binding energy shift. We obtain direct evidence for charge order\nlinked to electronic Mott-Wigner states at filling factors $\\nu$ = 1/3 and\n$\\nu$ = 2/3 through the associated exciton Umklapp resonances.\n","subjects":["Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"ImkOpe7f0Ra3dyWmOKUhNwNNrrmHvtnMtY5o_aDX5rY","pdfSize":"22024932","objectId":"0x5b6f5064e0ad1b8ad2288d76ac06e2009ce6610b9c6504777647cc3490d53474","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
