{"id":"2407.14403","title":"ALF: an asymmetric Lyot wavefront sensor for the ELT/METIS vortex\n  coronagraph","authors":"Gilles Orban de Xivry, Olivier Absil, Christian Delacroix, Prashant\n  Pathak, Maxime Quesnel, Thomas Bertram","authorsParsed":[["de Xivry","Gilles Orban",""],["Absil","Olivier",""],["Delacroix","Christian",""],["Pathak","Prashant",""],["Quesnel","Maxime",""],["Bertram","Thomas",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 15:32:10 GMT"}],"updateDate":"2024-07-22","timestamp":1721403130000,"abstract":"  Non-common path quasi-static and differential aberrations are one of the big\nhurdles of direct imaging for current and future high-contrast imaging\ninstruments. They increase speckle and photon noise thus reducing the\nachievable contrast and lead to a significant hit in HCI performance. The\nMid-infrared ELT Imager and Spectrograph (METIS) will provide high-contrast\nimaging, including vortex coronagraphy in L, M and N bands, with the ultimate\ngoal of directly imaging temperate rocky planets around the nearest stars.\nGround-based mid-infrared observations are however also impacted by water vapor\ninhomogeneities in the atmosphere, which generate additional chromatic\nturbulence not corrected by the near-infrared adaptive optics. This additional\nsource of wavefront error (WFE) significantly impacts HCI performance, and even\ndominates the WFE budget in N band. Instantaneous focal plane wavefront sensing\nis thus required to mitigate its impact. In this context, we propose to\nimplement a novel wavefront sensing approach for the vortex coronagraph using\nan asymmetric Lyot stop and machine learning. The asymmetric pupil stop allows\nfor the problem to become solvable, lifting the ambiguity on the sign of even\nZernike modes. Choosing the Lyot plane instead of the entrance pupil for this\nmask is also not arbitrary: it preserves the rejection efficiency of the\ncoronagraph and minimizes the impact of the asymmetry on the throughput. Last\nbut not least, machine learning allows us to solve this inversion problem which\nis non-linear and lacks an analytical solution. In this contribution, we\npresent our concept, our simulation framework, our results and a first\nlaboratory demonstration of the technique.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"f7chns1smavgHN8cksZPvgYYmjd6BPN5IgRdsI1WVn0","pdfSize":"827985"}