{"id":"2407.13731","title":"Predictive Low Rank Matrix Learning under Partial Observations:\n  Mixed-Projection ADMM","authors":"Dimitris Bertsimas and Nicholas A. G. Johnson","authorsParsed":[["Bertsimas","Dimitris",""],["Johnson","Nicholas A. G.",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 17:33:14 GMT"}],"updateDate":"2024-07-19","timestamp":1721323994000,"abstract":"  We study the problem of learning a partially observed matrix under the low\nrank assumption in the presence of fully observed side information that depends\nlinearly on the true underlying matrix. This problem consists of an important\ngeneralization of the Matrix Completion problem, a central problem in\nStatistics, Operations Research and Machine Learning, that arises in\napplications such as recommendation systems, signal processing, system\nidentification and image denoising. We formalize this problem as an\noptimization problem with an objective that balances the strength of the fit of\nthe reconstruction to the observed entries with the ability of the\nreconstruction to be predictive of the side information. We derive a\nmixed-projection reformulation of the resulting optimization problem and\npresent a strong semidefinite cone relaxation. We design an efficient, scalable\nalternating direction method of multipliers algorithm that produces high\nquality feasible solutions to the problem of interest. Our numerical results\ndemonstrate that in the small rank regime ($k \\leq 15$), our algorithm outputs\nsolutions that achieve on average $79\\%$ lower objective value and $90.1\\%$\nlower $\\ell_2$ reconstruction error than the solutions returned by the\nexperiment-wise best performing benchmark method. The runtime of our algorithm\nis competitive with and often superior to that of the benchmark methods. Our\nalgorithm is able to solve problems with $n = 10000$ rows and $m = 10000$\ncolumns in less than a minute.\n","subjects":["Statistics/Machine Learning","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"rcim4U82UP1PiMezHukiV45vzDr3l8Qm40OWYyrxA68","pdfSize":"836170"}