{"id":"2407.05060","title":"Volume-optimal persistence homological scaffolds of hemodynamic networks\n  covary with MEG theta-alpha aperiodic dynamics","authors":"Nghi Nguyen, Tao Hou, Enrico Amico, Jingyi Zheng, Huajun Huang, Alan\n  D. Kaplan, Giovanni Petri, Joaqu\\'in Go\\~ni, Ralph Kaufmann, Yize Zhao, Duy\n  Duong-Tran and Li Shen","authorsParsed":[["Nguyen","Nghi",""],["Hou","Tao",""],["Amico","Enrico",""],["Zheng","Jingyi",""],["Huang","Huajun",""],["Kaplan","Alan D.",""],["Petri","Giovanni",""],["Goñi","Joaquín",""],["Kaufmann","Ralph",""],["Zhao","Yize",""],["Duong-Tran","Duy",""],["Shen","Li",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 12:14:16 GMT"},{"version":"v2","created":"Tue, 23 Jul 2024 22:40:39 GMT"}],"updateDate":"2024-07-25","timestamp":1720268056000,"abstract":"  Higher-order properties of functional magnetic resonance imaging (fMRI)\ninduced connectivity have been shown to unravel many exclusive topological and\ndynamical insights beyond pairwise interactions. Nonetheless, whether these\nfMRI-induced higher-order properties play a role in disentangling other\nneuroimaging modalities' insights remains largely unexplored and poorly\nunderstood. In this work, by analyzing fMRI data from the Human Connectome\nProject Young Adult dataset using persistent homology, we discovered that the\nvolume-optimal persistence homological scaffolds of fMRI-based functional\nconnectomes exhibited conservative topological reconfigurations from the\nresting state to attentional task-positive state. Specifically, while\nreflecting the extent to which each cortical region contributed to functional\ncycles following different cognitive demands, these reconfigurations were\nconstrained such that the spatial distribution of cavities in the connectome is\nrelatively conserved. Most importantly, such level of contributions covaried\nwith powers of aperiodic activities mostly within the theta-alpha (4-12 Hz)\nband measured by magnetoencephalography (MEG). This comprehensive result\nsuggests that fMRI-induced hemodynamics and MEG theta-alpha aperiodic\nactivities are governed by the same functional constraints specific to each\ncortical morpho-structure. Methodologically, our work paves the way toward an\ninnovative computing paradigm in multimodal neuroimaging topological learning.\n","subjects":["Quantitative Biology/Neurons and Cognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"LYC6Iw7vtIDLB4_XEe_IDRn35Xwk_vDJIAERx5MVXkE","pdfSize":"5947252"}
