{"id":"2407.17512","title":"Green and Safe 6G Wireless Networks: A Hybrid Approach","authors":"Haneet Kour, Rakesh Kumar Jha, Sanjeev Jain","authorsParsed":[["Kour","Haneet",""],["Jha","Rakesh Kumar",""],["Jain","Sanjeev",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 11:37:09 GMT"}],"updateDate":"2024-07-26","timestamp":1720438629000,"abstract":"  With the wireless internet access being increasingly popular with services\nsuch as HD video streaming and so on, the demand for high data consuming\napplications is also rising. This increment in demand is coupled with a\nproportional rise in the power consumption. It is required that the internet\ntraffic is offloaded to technologies that serve the users and contribute in\nenergy consumption. There is a need to decrease the carbon footprint in the\natmosphere and also make the network safe and reliable. In this article we\npropose a hybrid system of RF (Radio Frequency) and VLC (Visible Light\nCommunication) for indoor communication that can provide communication along\nwith illumination with least power consumption. The hybrid network is viable as\nit utilizes power with respect to the user demand and maintains the required\nQuality of ServiceQoS and Quality of Experience QoE for a particular\napplication in use. This scheme aims for Green Communication and reduction in\nElectromagnetic EM Radiation. A comparative analysis for RF communication,\nHybrid RF+ VLC and pure VLC is made and simulations are carried out using\nPython, Scilab and MathWorks tool. The proposal achieves high energy efficiency\nof about 37% low Specific Absorption Rate (SAR) lower incident and absorbed\npower density complexity and temperature elevation in human body tissues\nexposed to the radiation. It also enhances the battery lifetime of the mobile\ndevice in use by increasing the lifetime approximately by 7 hours as validated\nfrom the obtained results. Thus the overall network reliability and safety\nfactor is enhanced with the proposed approach.\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"dCoeTyU2DNEkuuxNqofQezYBkAiv6D6jpJmanKhIKmE","pdfSize":"1692802"}