{"id":"2407.02528","title":"Actionable Cyber Threat Intelligence using Knowledge Graphs and Large\n  Language Models","authors":"Romy Fieblinger, Md Tanvirul Alam, Nidhi Rastogi","authorsParsed":[["Fieblinger","Romy",""],["Alam","Md Tanvirul",""],["Rastogi","Nidhi",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 13:02:03 GMT"}],"updateDate":"2024-07-04","timestamp":1719752523000,"abstract":"  Cyber threats are constantly evolving. Extracting actionable insights from\nunstructured Cyber Threat Intelligence (CTI) data is essential to guide\ncybersecurity decisions. Increasingly, organizations like Microsoft, Trend\nMicro, and CrowdStrike are using generative AI to facilitate CTI extraction.\nThis paper addresses the challenge of automating the extraction of actionable\nCTI using advancements in Large Language Models (LLMs) and Knowledge Graphs\n(KGs). We explore the application of state-of-the-art open-source LLMs,\nincluding the Llama 2 series, Mistral 7B Instruct, and Zephyr for extracting\nmeaningful triples from CTI texts. Our methodology evaluates techniques such as\nprompt engineering, the guidance framework, and fine-tuning to optimize\ninformation extraction and structuring. The extracted data is then utilized to\nconstruct a KG, offering a structured and queryable representation of threat\nintelligence. Experimental results demonstrate the effectiveness of our\napproach in extracting relevant information, with guidance and fine-tuning\nshowing superior performance over prompt engineering. However, while our\nmethods prove effective in small-scale tests, applying LLMs to large-scale data\nfor KG construction and Link Prediction presents ongoing challenges.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"BVMV2qCfNn229Z6hmGsUv2ggqOe6CWqbDxeDbqRFIyc","pdfSize":"534743"}