{"id":"2407.09828","title":"Enhancing Semantic Segmentation with Adaptive Focal Loss: A Novel\n  Approach","authors":"Md Rakibul Islam, Riad Hassan, Abdullah Nazib, Kien Nguyen, Clinton\n  Fookes, Md Zahidul Islam","authorsParsed":[["Islam","Md Rakibul",""],["Hassan","Riad",""],["Nazib","Abdullah",""],["Nguyen","Kien",""],["Fookes","Clinton",""],["Islam","Md Zahidul",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 09:41:20 GMT"}],"updateDate":"2024-07-16","timestamp":1720863680000,"abstract":"  Deep learning has achieved outstanding accuracy in medical image\nsegmentation, particularly for objects like organs or tumors with smooth\nboundaries or large sizes. Whereas, it encounters significant difficulties with\nobjects that have zigzag boundaries or are small in size, leading to a notable\ndecrease in segmentation effectiveness. In this context, using a loss function\nthat incorporates smoothness and volume information into a model's predictions\noffers a promising solution to these shortcomings. In this work, we introduce\nan Adaptive Focal Loss (A-FL) function designed to mitigate class imbalance by\ndown-weighting the loss for easy examples that results in up-weighting the loss\nfor hard examples and giving greater emphasis to challenging examples, such as\nsmall and irregularly shaped objects. The proposed A-FL involves dynamically\nadjusting a focusing parameter based on an object's surface smoothness, size\ninformation, and adjusting the class balancing parameter based on the ratio of\ntargeted area to total area in an image. We evaluated the performance of the\nA-FL using ResNet50-encoded U-Net architecture on the Picai 2022 and BraTS 2018\ndatasets. On the Picai 2022 dataset, the A-FL achieved an Intersection over\nUnion (IoU) of 0.696 and a Dice Similarity Coefficient (DSC) of 0.769,\noutperforming the regular Focal Loss (FL) by 5.5% and 5.4% respectively. It\nalso surpassed the best baseline Dice-Focal by 2.0% and 1.2%. On the BraTS 2018\ndataset, A-FL achieved an IoU of 0.883 and a DSC of 0.931. The comparative\nstudies show that the proposed A-FL function surpasses conventional methods,\nincluding Dice Loss, Focal Loss, and their hybrid variants, in IoU, DSC,\nSensitivity, and Specificity metrics. This work highlights A-FL's potential to\nimprove deep learning models for segmenting clinically significant regions in\nmedical images, leading to more precise and reliable diagnostic tools.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"dMfR1SgBGeBnzgeoe0lqRI3R4G6FURJACkgjaonu7RI","pdfSize":"2446373"}