{"id":"2407.01327","title":"Gradient-based Class Weighting for Unsupervised Domain Adaptation in\n  Dense Prediction Visual Tasks","authors":"Roberto Alcover-Couso, Marcos Escudero-Vi\\~nolo, Juan C. SanMiguel,\n  Jesus Besc\\'os","authorsParsed":[["Alcover-Couso","Roberto",""],["Escudero-Viñolo","Marcos",""],["SanMiguel","Juan C.",""],["Bescós","Jesus",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 14:34:25 GMT"}],"updateDate":"2024-07-02","timestamp":1719844465000,"abstract":"  In unsupervised domain adaptation (UDA), where models are trained on source\ndata (e.g., synthetic) and adapted to target data (e.g., real-world) without\ntarget annotations, addressing the challenge of significant class imbalance\nremains an open issue. Despite considerable progress in bridging the domain\ngap, existing methods often experience performance degradation when confronted\nwith highly imbalanced dense prediction visual tasks like semantic and panoptic\nsegmentation. This discrepancy becomes especially pronounced due to the lack of\nequivalent priors between the source and target domains, turning class\nimbalanced techniques used for other areas (e.g., image classification)\nineffective in UDA scenarios. This paper proposes a class-imbalance mitigation\nstrategy that incorporates class-weights into the UDA learning losses, but with\nthe novelty of estimating these weights dynamically through the loss gradient,\ndefining a Gradient-based class weighting (GBW) learning. GBW naturally\nincreases the contribution of classes whose learning is hindered by\nlarge-represented classes, and has the advantage of being able to automatically\nand quickly adapt to the iteration training outcomes, avoiding explicitly\ncurricular learning patterns common in loss-weighing strategies. Extensive\nexperimentation validates the effectiveness of GBW across architectures\n(convolutional and transformer), UDA strategies (adversarial, self-training and\nentropy minimization), tasks (semantic and panoptic segmentation), and datasets\n(GTA and Synthia). Analysing the source of advantage, GBW consistently\nincreases the recall of low represented classes.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"H-Xgib8OUj5B1w3ov160AuSUUVR0emiNKEaY5HkAtd8","pdfSize":"17229297","objectId":"0x539ef8e943178ff221c41877de79d5bb67811b7d53b350ef533792f799b3d91a","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
