{"id":"2407.11605","title":"Interactions with Generative Information Retrieval Systems","authors":"Mohammad Aliannejadi, Jacek Gwizdka, Hamed Zamani","authorsParsed":[["Aliannejadi","Mohammad",""],["Gwizdka","Jacek",""],["Zamani","Hamed",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 11:12:22 GMT"}],"updateDate":"2024-07-17","timestamp":1721128342000,"abstract":"  At its core, information access and seeking is an interactive process. In\nexisting search engines, interactions are limited to a few pre-defined actions,\nsuch as \"requery\", \"click on a document\", \"scrolling up/down\", \"going to the\nnext result page\", \"leaving the search engine\", etc. A major benefit of moving\ntowards generative IR systems is enabling users with a richer expression of\ninformation need and feedback and free-form interactions in natural language\nand beyond. In other words, the actions users take are no longer limited by the\nclickable links and buttons available on the search engine result page and\nusers can express themselves freely through natural language. This can go even\nbeyond natural language, through images, videos, gestures, and sensors using\nmulti-modal generative IR systems. This chapter briefly discusses the role of\ninteraction in generative IR systems. We will first discuss different ways\nusers can express their information needs by interacting with generative IR\nsystems. We then explain how users can provide explicit or implicit feedback to\ngenerative IR systems and how they can consume such feedback. Next, we will\ncover how users interactively can refine retrieval results. We will expand upon\nmixed-initiative interactions and discuss clarification and preference\nelicitation in more detail. We then discuss proactive generative IR systems,\nincluding context-aware recommendation, following up past conversations,\ncontributing to multi-party conversations, and feedback requests. Providing\nexplanation is another interaction type that we briefly discuss in this\nchapter. We will also briefly describe multi-modal interactions in generative\ninformation retrieval. Finally, we describe emerging frameworks and solutions\nfor user interfaces with generative AI systems.\n","subjects":["Computing Research Repository/Information Retrieval"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Xbg7iMleUTxyBKMiahgo9-byz-HsAhi7jh3yVv5U7hc","pdfSize":"1683491"}