{"id":"2407.11219","title":"TLRN: Temporal Latent Residual Networks For Large Deformation Image\n  Registration","authors":"Nian Wu, Jiarui Xing, and Miaomiao Zhang","authorsParsed":[["Wu","Nian",""],["Xing","Jiarui",""],["Zhang","Miaomiao",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 20:07:45 GMT"},{"version":"v2","created":"Wed, 24 Jul 2024 02:45:37 GMT"}],"updateDate":"2024-07-25","timestamp":1721074065000,"abstract":"  This paper presents a novel approach, termed {\\em Temporal Latent Residual\nNetwork (TLRN)}, to predict a sequence of deformation fields in time-series\nimage registration. The challenge of registering time-series images often lies\nin the occurrence of large motions, especially when images differ significantly\nfrom a reference (e.g., the start of a cardiac cycle compared to the peak\nstretching phase). To achieve accurate and robust registration results, we\nleverage the nature of motion continuity and exploit the temporal smoothness in\nconsecutive image frames. Our proposed TLRN highlights a temporal residual\nnetwork with residual blocks carefully designed in latent deformation spaces,\nwhich are parameterized by time-sequential initial velocity fields. We treat a\nsequence of residual blocks over time as a dynamic training system, where each\nblock is designed to learn the residual function between desired deformation\nfeatures and current input accumulated from previous time frames. We validate\nthe effectivenss of TLRN on both synthetic data and real-world cine cardiac\nmagnetic resonance (CMR) image videos. Our experimental results shows that TLRN\nis able to achieve substantially improved registration accuracy compared to the\nstate-of-the-art. Our code is publicly available at\nhttps://github.com/nellie689/TLRN.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"BmwUH4X2m-eBBbZl8H_w_Jz7Oh-rRisjzIV1BOsqDCo","pdfSize":"9068224","objectId":"0xf3eff57d46ed5f03bc5562ab8c2993854c8fd9b4d20eaae13ebc81789a051259","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
