{"id":"2407.13891","title":"Uncovering Political Bias in Emotion Inference Models: Implications for\n  sentiment analysis in social science research","authors":"Hubert Plisiecki, Pawe{\\l} Lenartowicz, Maria Flakus, Artur Pokropek","authorsParsed":[["Plisiecki","Hubert",""],["Lenartowicz","Paweł",""],["Flakus","Maria",""],["Pokropek","Artur",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 20:31:07 GMT"}],"updateDate":"2024-07-22","timestamp":1721334667000,"abstract":"  This paper investigates the presence of political bias in emotion inference\nmodels used for sentiment analysis (SA) in social science research. Machine\nlearning models often reflect biases in their training data, impacting the\nvalidity of their outcomes. While previous research has highlighted gender and\nrace biases, our study focuses on political bias - an underexplored yet\npervasive issue that can skew the interpretation of text data across a wide\narray of studies. We conducted a bias audit on a Polish sentiment analysis\nmodel developed in our lab. By analyzing valence predictions for names and\nsentences involving Polish politicians, we uncovered systematic differences\ninfluenced by political affiliations. Our findings indicate that annotations by\nhuman raters propagate political biases into the model's predictions. To\nmitigate this, we pruned the training dataset of texts mentioning these\npoliticians and observed a reduction in bias, though not its complete\nelimination. Given the significant implications of political bias in SA, our\nstudy emphasizes caution in employing these models for social science research.\nWe recommend a critical examination of SA results and propose using\nlexicon-based systems as a more ideologically neutral alternative. This paper\nunderscores the necessity for ongoing scrutiny and methodological adjustments\nto ensure the reliability and impartiality of the use of machine learning in\nacademic and applied contexts.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"IpzekJMD6eh_H-ZRSwcZaiwHHQYi8s-g5HS_td75yws","pdfSize":"778700"}