{"id":"2407.07206","title":"Plasmonic Vortices Host Magnetoelectric Interactions","authors":"Atreyie Ghosh, Sena Yang, Yanan Dai, W. Vincent Liu, Hrvoje Petek","authorsParsed":[["Ghosh","Atreyie",""],["Yang","Sena",""],["Dai","Yanan",""],["Liu","W. Vincent",""],["Petek","Hrvoje",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 19:51:10 GMT"}],"updateDate":"2024-07-11","timestamp":1720554670000,"abstract":"  The vector cross product and pseudoscalar dot products of electric (E) and\nmagnetic (H) fields are separately finite in vacuum transverse electric and\nmagnetic (TEM) plane waves, and angular momentum structured light. Current\ntheories of interactions beyond the standard model of particle physics invoke\nnon-zero dot(E,H) as the source term in the axion law that describes\ninteractions with the cosmological dark matter axion particles outside of the\nquartet of Maxwells equations. The non-zero dot(E,H) also drives relativistic\nspin-charge magnetoelectric excitations of axion quasiparticles at a\ndistinctively higher condensed matter scale in magnetic and topological\nmaterials. Yet, how to drive coherent dot(E,H) responses is unknown, and\nprovides motivation to examine the field polarizations in structured light on a\ndeep sub-diffraction limited spatial scale and sub-optical cycle temporal scale\nby ultrafast nonlinear photoemission electron microscopy. By analytical theory\nand ultrafast coherent photoemission electron microscopy, we image dot(E,H)\nfields in surface plasmon polariton vortex cores at subwavelength scales, where\nwe find that the magnetoelectric relative to the dipole density is intensified\non a ~10 nm diameter scale as a universal property of plasmonic vortex fields.\nThe generation and nanoscale localization of dot(E,H) fields introduces the\nmagnetoelectric symmetry class, having the parity and time reversal broken, but\nthe joint parity-time reversal symmetry preserved. The ability to image the\noptical fields of plasmonic vortex cores opens the research of ultrafast\nmicroscopy of magnetoelectric responses and interactions with axion\nquasiparticles in solid state materials.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science","Physics/High Energy Physics - Experiment"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Fbm6DQBo12kzVW0Il4pjHAHv2_ccIy9F9DhfcjIMmmw","pdfSize":"958596"}