{"id":"2407.19202","title":"Mesoscale properties of biomolecular condensates emerging from protein\n  chain dynamics","authors":"Nicola Galvanetto, Milo\\v{s} T. Ivanovi\\'c, Simone A. Del Grosso,\n  Aritra Chowdhury, Andrea Sottini, Daniel Nettels, Robert B. Best and Benjamin\n  Schuler","authorsParsed":[["Galvanetto","Nicola",""],["Ivanović","Miloš T.",""],["Del Grosso","Simone A.",""],["Chowdhury","Aritra",""],["Sottini","Andrea",""],["Nettels","Daniel",""],["Best","Robert B.",""],["Schuler","Benjamin",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 08:12:12 GMT"}],"updateDate":"2024-07-30","timestamp":1722067932000,"abstract":"  Biomolecular condensates form by phase separation of biological polymers. The\ncellular functions of the resulting membraneless organelles are closely linked\nto their physical properties over a wide range of length- and timescales: From\nthe nanosecond dynamics of individual molecules and their interactions, to the\nmicrosecond translational diffusion of molecules in the condensates, to their\nviscoelastic properties at the mesoscopic scale. However, it has remained\nunclear how to quantitatively link these properties across scales. Here we\naddress this question by combining single-molecule fluorescence, correlation\nspectroscopy, microrheology, and large-scale molecular dynamics simulations on\ndifferent condensates that are formed by complex coacervation and span about\ntwo orders of magnitude in viscosity and their dynamics at the molecular scale.\nRemarkably, we find that the absolute timescale of protein chain dynamics in\nthe dense phases can be quantitatively and accurately related to translational\ndiffusion and condensate viscosities by Rouse theory of polymer solutions\nincluding entanglement. The simulations indicate that the observed wide range\nof dynamics arises from different contact lifetimes between amino acid\nresidues, which in the mean-field description of the polymer model cause\ndifferences in the friction acting on the chains. These results suggest that\nremarkably simple physical principles can relate the mesoscale properties of\nbiomolecular condensates to their dynamics at the nanoscale.\n","subjects":["Physics/Biological Physics","Condensed Matter/Soft Condensed Matter","Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"r0D8-MWrVQcjAhFw40FSem56Aif7ZxwDY4cQBqpcO0Y","pdfSize":"4054924"}