{"id":"2407.04424","title":"Benchmarking structure-based three-dimensional molecular generative\n  models using GenBench3D: ligand conformation quality matters","authors":"Benoit Baillif, Jason Cole, Patrick McCabe, Andreas Bender","authorsParsed":[["Baillif","Benoit",""],["Cole","Jason",""],["McCabe","Patrick",""],["Bender","Andreas",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 11:17:18 GMT"}],"updateDate":"2024-07-08","timestamp":1720178238000,"abstract":"  Three-dimensional (3D) deep molecular generative models offer the advantage\nof goal-directed generation based on 3D-dependent properties, such as binding\naffinity for structure-based design within binding pockets. Traditional\nbenchmarks created to evaluate SMILES or molecular graphs generators, such as\nGuacaMol or MOSES, are limited to evaluate 3D generators as they do not assess\nthe quality of the generated molecular conformation. In this work, we hence\ndeveloped GenBench3D, which implements a new benchmark for models producing\nmolecules within a binding pocket. Our main contribution is the Validity3D\nmetric, evaluating the conformation quality using the likelihood of bond\nlengths and valence angles based on reference values observed in the Cambridge\nStructural Database. The LiGAN, 3D-SBDD, Pocket2Mol, TargetDiff, DiffSBDD and\nResGen models were benchmarked. We show that only between 0% and 11% of\ngenerated molecules have valid conformations. Performing local relaxation of\ngenerated molecules in the pocket considerably improved the Validity3D for all\nmodels by a minimum increase of 40%. For LiGAN, 3D-SBDD, or TargetDiff, the set\nof valid relaxed molecules shows on average higher Vina score (i.e. worse) than\nthe set of raw generated molecules, indicating that the binding affinity of raw\ngenerated molecules might be overestimated. Using the other scoring functions,\nthat give higher importance to ligand strain, only yield improved scores when\nusing valid relaxed molecules. Using valid relaxed molecules, TargetDiff and\nPocket2Mol show better median Vina, Glide and Gold PLP scores than other\nmodels. We have publicly released GenBench3D on GitHub for broader use:\nhttps://github.com/bbaillif/genbench3d\n","subjects":["Quantitative Biology/Quantitative Methods","Quantitative Biology/Biomolecules"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"zMw0A-ulAwHnUXKJVDMB32SO2u1R_HB7sRCetyS3Pus","pdfSize":"4032287"}