{"id":"2407.19089","title":"Many-Shot In-Context Learning for Molecular Inverse Design","authors":"Saeed Moayedpour, Alejandro Corrochano-Navarro, Faryad Sahneh,\n  Shahriar Noroozizadeh, Alexander Koetter, Jiri Vymetal, Lorenzo Kogler-Anele,\n  Pablo Mas, Yasser Jangjou, Sizhen Li, Michael Bailey, Marc Bianciotto, Hans\n  Matter, Christoph Grebner, Gerhard Hessler, Ziv Bar-Joseph, Sven Jager","authorsParsed":[["Moayedpour","Saeed",""],["Corrochano-Navarro","Alejandro",""],["Sahneh","Faryad",""],["Noroozizadeh","Shahriar",""],["Koetter","Alexander",""],["Vymetal","Jiri",""],["Kogler-Anele","Lorenzo",""],["Mas","Pablo",""],["Jangjou","Yasser",""],["Li","Sizhen",""],["Bailey","Michael",""],["Bianciotto","Marc",""],["Matter","Hans",""],["Grebner","Christoph",""],["Hessler","Gerhard",""],["Bar-Joseph","Ziv",""],["Jager","Sven",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 21:10:50 GMT"}],"updateDate":"2024-07-30","timestamp":1722028250000,"abstract":"  Large Language Models (LLMs) have demonstrated great performance in few-shot\nIn-Context Learning (ICL) for a variety of generative and discriminative\nchemical design tasks. The newly expanded context windows of LLMs can further\nimprove ICL capabilities for molecular inverse design and lead optimization. To\ntake full advantage of these capabilities we developed a new semi-supervised\nlearning method that overcomes the lack of experimental data available for\nmany-shot ICL. Our approach involves iterative inclusion of LLM generated\nmolecules with high predicted performance, along with experimental data. We\nfurther integrated our method in a multi-modal LLM which allows for the\ninteractive modification of generated molecular structures using text\ninstructions. As we show, the new method greatly improves upon existing ICL\nmethods for molecular design while being accessible and easy to use for\nscientists.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"KqYm4ibIgNAvlFcBq7XDzv5DRwnoWLkNbZQql6ZYGmM","pdfSize":"7343470"}