{"id":"2407.03273","title":"Global Out of Time Order Correlators as a Signature of Scrambling\n  Dynamics of Local Observables","authors":"Fabricio S. Lozano-Negro, Claudia M. S\\'anchez, Ana K. Chattah,\n  Gonzalo A. \\'Alvarez, Horacio M. Pastawski","authorsParsed":[["Lozano-Negro","Fabricio S.",""],["Sánchez","Claudia M.",""],["Chattah","Ana K.",""],["Álvarez","Gonzalo A.",""],["Pastawski","Horacio M.",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 16:59:30 GMT"},{"version":"v2","created":"Fri, 13 Sep 2024 13:22:25 GMT"}],"updateDate":"2024-09-16","timestamp":1720025970000,"abstract":"  Out-of-Time-Order Correlators (OTOCs) serve as a proxy for quantum\ninformation scrambling, which refers to the process where information stored\nlocally disperses across the many-body degrees of freedom in a quantum system,\nrendering it inaccessible to local probes. Most experimental implementations of\nOTOCs to probe information scrambling rely on indirect measurements based on\nglobal observables, using techniques such as Loschmidt echoes and Multiple\nQuantum Coherences, via time reversal evolutions. In this article, we establish\na direct connection between OTOCs with global and local observables in the\ncontext of NMR experiments, where the observable is the total magnetization of\nthe system. We conduct a numerical analysis to quantify the differences in the\nevolution of both magnitudes, evaluating the excitation dynamics in spin ring\nsystems with 8 to 16 spins, using a many-body Hamiltonian and long-range\ninteractions. Our analysis decomposes the global echo into a sum of local\nechoes and cross-contributions, leading to local and global OTOCs. The results\nindicate that, after an initial transient period, local OTOCs determine the\nglobal ones. We observe that the difference between the average of local OTOCs\nand the global one, as well as their fluctuations, becomes negligible as the\nsystem size increases. Thus, for large homogeneous systems, global and local\nOTOCs become equivalent. This behavior aligns with that observed in highly\ninteracting or chaotic systems in several experiments.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"BjuxLgNwl5xAVd8UsRvDh-Vr6LhG5WBnIC6CnOTuLuI","pdfSize":"1269305"}