{"id":"2407.13067","title":"Large Language Model Agents for Improving Engagement with Behavior\n  Change Interventions: Application to Digital Mindfulness","authors":"Harsh Kumar, Suhyeon Yoo, Angela Zavaleta Bernuy, Jiakai Shi, Huayin\n  Luo, Joseph Williams, Anastasia Kuzminykh, Ashton Anderson, Rachel Kornfield","authorsParsed":[["Kumar","Harsh",""],["Yoo","Suhyeon",""],["Bernuy","Angela Zavaleta",""],["Shi","Jiakai",""],["Luo","Huayin",""],["Williams","Joseph",""],["Kuzminykh","Anastasia",""],["Anderson","Ashton",""],["Kornfield","Rachel",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 15:43:16 GMT"}],"updateDate":"2024-07-19","timestamp":1720021396000,"abstract":"  Although engagement in self-directed wellness exercises typically declines\nover time, integrating social support such as coaching can sustain it. However,\ntraditional forms of support are often inaccessible due to the high costs and\ncomplex coordination. Large Language Models (LLMs) show promise in providing\nhuman-like dialogues that could emulate social support. Yet, in-depth, in situ\ninvestigations of LLMs to support behavior change remain underexplored. We\nconducted two randomized experiments to assess the impact of LLM agents on user\nengagement with mindfulness exercises. First, a single-session study, involved\n502 crowdworkers; second, a three-week study, included 54 participants. We\nexplored two types of LLM agents: one providing information and another\nfacilitating self-reflection. Both agents enhanced users' intentions to\npractice mindfulness. However, only the information-providing LLM, featuring a\nfriendly persona, significantly improved engagement with the exercises. Our\nfindings suggest that specific LLM agents may bridge the social support gap in\ndigital health interventions.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"eeeuTEmpEAIueUYExOnyYMV5IdEdL0YOfyZJdoZVnX4","pdfSize":"2274256"}