{"id":"2407.15816","title":"Efficient and generalizable prediction of molecular alterations in\n  multiple cancer cohorts using H&E whole slide images","authors":"Kshitij Ingale, Sun Hae Hong, Qiyuan Hu, Renyu Zhang, Bo Osinski, Mina\n  Khoshdeli, Josh Och, Kunal Nagpal, Martin C. Stumpe, Rohan P. Joshi","authorsParsed":[["Ingale","Kshitij",""],["Hong","Sun Hae",""],["Hu","Qiyuan",""],["Zhang","Renyu",""],["Osinski","Bo",""],["Khoshdeli","Mina",""],["Och","Josh",""],["Nagpal","Kunal",""],["Stumpe","Martin C.",""],["Joshi","Rohan P.",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 17:31:57 GMT"}],"updateDate":"2024-07-23","timestamp":1721669517000,"abstract":"  Molecular testing of tumor samples for targetable biomarkers is restricted by\na lack of standardization, turnaround-time, cost, and tissue availability\nacross cancer types. Additionally, targetable alterations of low prevalence may\nnot be tested in routine workflows. Algorithms that predict DNA alterations\nfrom routinely generated hematoxylin and eosin (H&E)-stained images could\nprioritize samples for confirmatory molecular testing. Costs and the necessity\nof a large number of samples containing mutations limit approaches that train\nindividual algorithms for each alteration. In this work, models were trained\nfor simultaneous prediction of multiple DNA alterations from H&E images using a\nmulti-task approach. Compared to biomarker-specific models, this approach\nperformed better on average, with pronounced gains for rare mutations. The\nmodels reasonably generalized to independent temporal-holdout,\nexternally-stained, and multi-site TCGA test sets. Additionally, whole slide\nimage embeddings derived using multi-task models demonstrated strong\nperformance in downstream tasks that were not a part of training. Overall, this\nis a promising approach to develop clinically useful algorithms that provide\nmultiple actionable predictions from a single slide.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"uQb94VE0ifDoBbZlUS5fiS9ja6KbAG2pNC2-h1hf35A","pdfSize":"9915434"}