{"id":"2407.06189","title":"Video-STaR: Self-Training Enables Video Instruction Tuning with Any\n  Supervision","authors":"Orr Zohar, Xiaohan Wang, Yonatan Bitton, Idan Szpektor, Serena\n  Yeung-Levy","authorsParsed":[["Zohar","Orr",""],["Wang","Xiaohan",""],["Bitton","Yonatan",""],["Szpektor","Idan",""],["Yeung-Levy","Serena",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 17:59:42 GMT"}],"updateDate":"2024-07-09","timestamp":1720461582000,"abstract":"  The performance of Large Vision Language Models (LVLMs) is dependent on the\nsize and quality of their training datasets. Existing video instruction tuning\ndatasets lack diversity as they are derived by prompting large language models\nwith video captions to generate question-answer pairs, and are therefore mostly\ndescriptive. Meanwhile, many labeled video datasets with diverse labels and\nsupervision exist - however, we find that their integration into LVLMs is\nnon-trivial. Herein, we present Video Self-Training with augmented Reasoning\n(Video-STaR), the first video self-training approach. Video-STaR allows the\nutilization of any labeled video dataset for video instruction tuning. In\nVideo-STaR, an LVLM cycles between instruction generation and finetuning, which\nwe show (I) improves general video understanding and (II) adapts LVLMs to novel\ndownstream tasks with existing supervision. During generation, an LVLM is\nprompted to propose an answer. The answers are then filtered only to those that\ncontain the original video labels, and the LVLM is then re-trained on the\ngenerated dataset. By only training on generated answers that contain the\ncorrect video labels, Video-STaR utilizes these existing video labels as weak\nsupervision for video instruction tuning. Our results demonstrate that\nVideo-STaR-enhanced LVLMs exhibit improved performance in (I) general video QA,\nwhere TempCompass performance improved by 10%, and (II) on downstream tasks,\nwhere Video-STaR improved Kinetics700-QA accuracy by 20% and action quality\nassessment on FineDiving by 15%.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"NfmyJf-9MYtU15if28GvtfML5XHrLOF_GmC5eS-95Uc","pdfSize":"7438700"}