{"id":"2407.12888","title":"Explainable Biomedical Hypothesis Generation via Retrieval Augmented\n  Generation enabled Large Language Models","authors":"Alexander R. Pelletier, Joseph Ramirez, Irsyad Adam, Simha Sankar, Yu\n  Yan, Ding Wang, Dylan Steinecke, Wei Wang, Peipei Ping","authorsParsed":[["Pelletier","Alexander R.",""],["Ramirez","Joseph",""],["Adam","Irsyad",""],["Sankar","Simha",""],["Yan","Yu",""],["Wang","Ding",""],["Steinecke","Dylan",""],["Wang","Wei",""],["Ping","Peipei",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 07:44:18 GMT"}],"updateDate":"2024-07-19","timestamp":1721202258000,"abstract":"  The vast amount of biomedical information available today presents a\nsignificant challenge for investigators seeking to digest, process, and\nunderstand these findings effectively. Large Language Models (LLMs) have\nemerged as powerful tools to navigate this complex and challenging data\nlandscape. However, LLMs may lead to hallucinatory responses, making Retrieval\nAugmented Generation (RAG) crucial for achieving accurate information. In this\nprotocol, we present RUGGED (Retrieval Under Graph-Guided Explainable disease\nDistinction), a comprehensive workflow designed to support investigators with\nknowledge integration and hypothesis generation, identifying validated paths\nforward. Relevant biomedical information from publications and knowledge bases\nare reviewed, integrated, and extracted via text-mining association analysis\nand explainable graph prediction models on disease nodes, forecasting potential\nlinks among drugs and diseases. These analyses, along with biomedical texts,\nare integrated into a framework that facilitates user-directed mechanism\nelucidation as well as hypothesis exploration through RAG-enabled LLMs. A\nclinical use-case demonstrates RUGGED's ability to evaluate and recommend\ntherapeutics for Arrhythmogenic Cardiomyopathy (ACM) and Dilated Cardiomyopathy\n(DCM), analyzing prescribed drugs for molecular interactions and unexplored\nuses. The platform minimizes LLM hallucinations, offers actionable insights,\nand improves the investigation of novel therapeutics.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"uXq4NjUStbSHErIlZqHe4kx_3hT-g2_l9Qc86DsMpJk","pdfSize":"3488941","objectId":"0x3154f13225af64b17b511abf8755cb0c10ec59b511b524219fd8b7ab2db2ccaa","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
