{"id":"2407.17196","title":"Metal accretion scars may be common on magnetic, polluted white dwarfs","authors":"S. Bagnulo, J.D. Landstreet, J. Farihi, C.P. Folsom, M.A. Hollands, L.\n  Fossati","authorsParsed":[["Bagnulo","S.",""],["Landstreet","J. D.",""],["Farihi","J.",""],["Folsom","C. P.",""],["Hollands","M. A.",""],["Fossati","L.",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 11:55:48 GMT"}],"updateDate":"2024-07-25","timestamp":1721822148000,"abstract":"  More than 30% of white dwarfs exhibit atmospheric metals, which are\nunderstood to be from recent or ongoing accretion of circumstellar debris. In\ncool white dwarfs, surface motions should rapidly homogenise photospheric\nabundances, and the accreted heavy elements should diffuse inward on a\ntimescale much longer than that for surface mixing. The recent discovery of a\nmetal scar on WD0816-310 implies its magnetic field has impeded surface mixing\nof metals near the visible magnetic pole. Here, we report the discovery of a\nsecond magnetic, metal-polluted white dwarf, WD2138-332, which exhibits\nperiodic variability in longitudinal field, metal line strength, and broadband\nphotometry. All three variable quantities have the same period, and show\nremarkable correlations: the published light curves have a brightness minimum\nexactly when the longitudinal field and line strength have a maximum, and a\nmaximum when the longitudinal field and line strength have a minimum. The\nsimplest interpretation of the line strength variability is that there is an\nenhanced metal concentration around one pole of the magnetic field; however,\nthe variable line-blanketing cannot account for the observed multi-band light\ncurves. More theoretical work is required to understand the efficiency of\nhorizontal mixing of the accreted metal atoms, and the origin of photometric\nvariability. Because both magnetic, metal-polluted white dwarfs that have been\nmonitored to date show that metal line strengths vary in phase with the\nlongitudinal field, we suggest that metal scars around magnetic poles may be a\ncommon feature of metal-polluted white dwarfs.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"cCZMe-E2oiOn4B4z9vCpMkJ5_czYjvkr_EJffHGcqYY","pdfSize":"342876"}