{"id":"2407.03318","title":"Fair Division of Indivisible Chores via Earning Restricted Equilibria","authors":"Jugal Garg, Aniket Murhekar, John Qin","authorsParsed":[["Garg","Jugal",""],["Murhekar","Aniket",""],["Qin","John",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 17:58:22 GMT"},{"version":"v2","created":"Fri, 5 Jul 2024 17:40:47 GMT"},{"version":"v3","created":"Tue, 27 Aug 2024 17:49:28 GMT"}],"updateDate":"2024-08-28","timestamp":1720029502000,"abstract":"  We study fair division of $m$ indivisible chores among $n$ agents with\nadditive preferences. We consider the desirable fairness notions of\nenvy-freeness up to any chore (EFX) and envy-freeness up to $k$ chores (EF$k$),\nalongside the efficiency notion of Pareto optimality (PO). We present the first\nconstant approximations of these notions, showing the existence of:\n  - 4-EFX allocations, which improves the best-known factor of $O(n^2)$-EFX.\n  - 2-EF2 and PO allocations, which improves the best-known factor of EF$m$ and\nPO. In particular, we show the existence of an allocation that is PO and for\nevery agent, either EF2 or 2-EF1.\n  - 3-EFX and PO allocations for the special case of bivalued instances, which\nimproves the best-known factor of $O(n)$-EFX without any efficiency guarantees.\n  A notable contribution of our work is the introduction of the novel concept\nof earning-restricted (ER) competitive equilibrium for fractional allocations,\nwhich limits agents' earnings from each chore. Technically, our work addresses\ntwo main challenges: proving the existence of an ER equilibrium and designing\nalgorithms that leverage ER equilibria to achieve the above results. To tackle\nthe first challenge, we formulate a linear complementarity problem (LCP)\nformulation that captures all ER equilibria and show that the classic\ncomplementary pivot algorithm on the LCP must terminate at an ER equilibrium.\nFor the second challenge, we carefully set the earning limits and use\nproperties of ER equilibria to design sophisticated procedures that involve\nswapping and merging bundles to meet the desired fairness and efficiency\ncriteria. We expect that the concept of ER equilibrium will be instrumental in\nderiving further results on related problems.\n","subjects":["Computing Research Repository/Computer Science and Game Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"03KpqYLBPGnJyVjy_uU1IOLO10J3s3TXTBj9v-Uhn6E","pdfSize":"888409"}