{"id":"2407.05680","title":"Fine-Grained Multi-View Hand Reconstruction Using Inverse Rendering","authors":"Qijun Gan, Wentong Li, Jinwei Ren, Jianke Zhu","authorsParsed":[["Gan","Qijun",""],["Li","Wentong",""],["Ren","Jinwei",""],["Zhu","Jianke",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 07:28:24 GMT"},{"version":"v2","created":"Tue, 9 Jul 2024 03:39:45 GMT"}],"updateDate":"2024-07-10","timestamp":1720423704000,"abstract":"  Reconstructing high-fidelity hand models with intricate textures plays a\ncrucial role in enhancing human-object interaction and advancing real-world\napplications. Despite the state-of-the-art methods excelling in texture\ngeneration and image rendering, they often face challenges in accurately\ncapturing geometric details. Learning-based approaches usually offer better\nrobustness and faster inference, which tend to produce smoother results and\nrequire substantial amounts of training data. To address these issues, we\npresent a novel fine-grained multi-view hand mesh reconstruction method that\nleverages inverse rendering to restore hand poses and intricate details.\nFirstly, our approach predicts a parametric hand mesh model through Graph\nConvolutional Networks (GCN) based method from multi-view images. We further\nintroduce a novel Hand Albedo and Mesh (HAM) optimization module to refine both\nthe hand mesh and textures, which is capable of preserving the mesh topology.\nIn addition, we suggest an effective mesh-based neural rendering scheme to\nsimultaneously generate photo-realistic image and optimize mesh geometry by\nfusing the pre-trained rendering network with vertex features. We conduct the\ncomprehensive experiments on InterHand2.6M, DeepHandMesh and dataset collected\nby ourself, whose promising results show that our proposed approach outperforms\nthe state-of-the-art methods on both reconstruction accuracy and rendering\nquality. Code and dataset are publicly available at\nhttps://github.com/agnJason/FMHR.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"h0F0GdE1QMsjsI7doMysOMu3HVnPA6b11tHxYHA_NEQ","pdfSize":"7512532"}