{"id":"2407.18806","title":"Exploiting Device Heterogeneity in Grant-Free Random Access: A\n  Data-Driven Approach","authors":"Alix Jeannerot, Malcolm Egan and Jean-Marie Gorce","authorsParsed":[["Jeannerot","Alix",""],["Egan","Malcolm",""],["Gorce","Jean-Marie",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 15:11:41 GMT"}],"updateDate":"2024-07-29","timestamp":1722006701000,"abstract":"  Grant-free random access (GFRA) is now a popular protocol for large-scale\nwireless multiple access systems in order to reduce control signaling. Resource\nallocation in GFRA can be viewed as a form of frame slotted ALOHA, where a\nubiquitous design assumption is device homogeneity. In particular, the\nprobability that a device seeks to transmit data is common to all devices.\nRecently, there has been an interest in designing frame slotted ALOHA\nalgorithms for networks with heterogeneous activity probabilities. These works\nhave established that the throughput can be significantly improved over the\nstandard uniform allocation. However, the algorithms for optimizing the\nprobability a device accesses each slot require perfect knowledge of the active\ndevices within each frame. In practice, this assumption is limiting as device\nidentification algorithms in GFRA rarely provide activity estimates with zero\nerrors. In this paper, we develop a new algorithm based on stochastic gradient\ndescent for optimizing slot allocation probabilities in the presence of\nactivity estimation errors. Our algorithm exploits importance weighted bias\nmitigation for stochastic gradient estimates, which is shown to provably\nconverge to a stationary point of the throughput optimization problem. In\nmoderate size systems, our simulations show that the performance of our\nalgorithm depends on the type of error distribution. We study symmetric bit\nflipping, asymmetric bit flipping and errors resulting from a generalized\napproximate message passing (GAMP) algorithm. In these scenarios, we observe\ngains up to 40\\%, 66\\%, and 19\\%, respectively.\n","subjects":["Computing Research Repository/Information Theory","Computing Research Repository/Networking and Internet Architecture","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"5g7JmC4KOMVXqQFFWlWJjDtglLEZ6Osz9LzGxPU5a50","pdfSize":"857671"}