{"id":"2407.18189","title":"Unlocking Discovery Potential for Decaying Dark Matter and Faint X-ray\n  Sources with XRISM","authors":"Yu Zhou, Volodymyr Takhistov, Kazuhisa Mitsuda","authorsParsed":[["Zhou","Yu",""],["Takhistov","Volodymyr",""],["Mitsuda","Kazuhisa",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 16:56:31 GMT"}],"updateDate":"2024-07-26","timestamp":1721926591000,"abstract":"  Astrophysical emission lines arising from particle decays can offer unique\ninsights into the nature of dark matter (DM). Using dedicated simulations with\nbackground and foreground modeling, we comprehensively demonstrate that the\nrecently launched XRISM space telescope with powerful X-ray spectroscopy\ncapabilities is particularly well-suited to probe decaying DM, such as sterile\nneutrinos and axion-like particles, in the mass range of few to tens of keV. We\nanalyze and map XRISM's DM discovery potential parameter space by considering\nMilky Way Galactic DM halo, including establishing an optimal line-of-sight\nsearch, as well as dwarf galaxies where we identify Segue 1 as a remarkably\npromising target. We demonstrate that with only 100 ks exposure XRISM/Resolve\ninstrument is capable of probing the underexplored DM parameter window around\nfew keV and testing DM couplings with sensitivity that exceeds by two orders\nexisting Segue 1 limits. Further, we demonstrate that XRISM/Xtend instrument\nsensitivity enables discovery of the nature of faint astrophysical X-ray\nsources, especially in Segue 1, which could shed light on star-formation\nhistory. We discuss implications for decaying DM searches with improved\ndetector energy resolution in future experiments.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/Astrophysics of Galaxies","Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"otvUstQ4RKL6XljScgV7g79CJujUDt9FYgiif98YepM","pdfSize":"9155390"}