{"id":"2407.13981","title":"Decomposed Direct Preference Optimization for Structure-Based Drug\n  Design","authors":"Xiwei Cheng, Xiangxin Zhou, Yuwei Yang, Yu Bao, Quanquan Gu","authorsParsed":[["Cheng","Xiwei",""],["Zhou","Xiangxin",""],["Yang","Yuwei",""],["Bao","Yu",""],["Gu","Quanquan",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 02:12:25 GMT"}],"updateDate":"2024-07-22","timestamp":1721355145000,"abstract":"  Diffusion models have achieved promising results for Structure-Based Drug\nDesign (SBDD). Nevertheless, high-quality protein subpocket and ligand data are\nrelatively scarce, which hinders the models' generation capabilities. Recently,\nDirect Preference Optimization (DPO) has emerged as a pivotal tool for the\nalignment of generative models such as large language models and diffusion\nmodels, providing greater flexibility and accuracy by directly aligning model\noutputs with human preferences. Building on this advancement, we introduce DPO\nto SBDD in this paper. We tailor diffusion models to pharmaceutical needs by\naligning them with elaborately designed chemical score functions. We propose a\nnew structure-based molecular optimization method called DecompDPO, which\ndecomposes the molecule into arms and scaffolds and performs preference\noptimization at both local substructure and global molecule levels, allowing\nfor more precise control with fine-grained preferences. Notably, DecompDPO can\nbe effectively used for two main purposes: (1) fine-tuning pretrained diffusion\nmodels for molecule generation across various protein families, and (2)\nmolecular optimization given a specific protein subpocket after generation.\nExtensive experiments on the CrossDocked2020 benchmark show that DecompDPO\nsignificantly improves model performance in both molecule generation and\noptimization, with up to 100% Median High Affinity and a 54.9% Success Rate.\n","subjects":["Quantitative Biology/Biomolecules","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"8efCiAbG-NO1__hJcAxHEVYfGKonyYOs1VFxqUhgfxo","pdfSize":"9964716"}