{"id":"2407.00092","title":"Visual Reasoning and Multi-Agent Approach in Multimodal Large Language\n  Models (MLLMs): Solving TSP and mTSP Combinatorial Challenges","authors":"Mohammed Elhenawy, Ahmad Abutahoun, Taqwa I.Alhadidi, Ahmed Jaber,\n  Huthaifa I. Ashqar, Shadi Jaradat, Ahmed Abdelhay, Sebastien Glaser, and\n  Andry Rakotonirainy","authorsParsed":[["Elhenawy","Mohammed",""],["Abutahoun","Ahmad",""],["Alhadidi","Taqwa I.",""],["Jaber","Ahmed",""],["Ashqar","Huthaifa I.",""],["Jaradat","Shadi",""],["Abdelhay","Ahmed",""],["Glaser","Sebastien",""],["Rakotonirainy","Andry",""]],"versions":[{"version":"v1","created":"Wed, 26 Jun 2024 07:12:06 GMT"}],"updateDate":"2024-07-02","timestamp":1719385926000,"abstract":"  Multimodal Large Language Models (MLLMs) harness comprehensive knowledge\nspanning text, images, and audio to adeptly tackle complex problems, including\nzero-shot in-context learning scenarios. This study explores the ability of\nMLLMs in visually solving the Traveling Salesman Problem (TSP) and Multiple\nTraveling Salesman Problem (mTSP) using images that portray point distributions\non a two-dimensional plane. We introduce a novel approach employing multiple\nspecialized agents within the MLLM framework, each dedicated to optimizing\nsolutions for these combinatorial challenges. Our experimental investigation\nincludes rigorous evaluations across zero-shot settings and introduces\ninnovative multi-agent zero-shot in-context scenarios. The results demonstrated\nthat both multi-agent models. Multi-Agent 1, which includes the Initializer,\nCritic, and Scorer agents, and Multi-Agent 2, which comprises only the\nInitializer and Critic agents; significantly improved solution quality for TSP\nand mTSP problems. Multi-Agent 1 excelled in environments requiring detailed\nroute refinement and evaluation, providing a robust framework for sophisticated\noptimizations. In contrast, Multi-Agent 2, focusing on iterative refinements by\nthe Initializer and Critic, proved effective for rapid decision-making\nscenarios. These experiments yield promising outcomes, showcasing the robust\nvisual reasoning capabilities of MLLMs in addressing diverse combinatorial\nproblems. The findings underscore the potential of MLLMs as powerful tools in\ncomputational optimization, offering insights that could inspire further\nadvancements in this promising field. Project link:\nhttps://github.com/ahmed-abdulhuy/Solving-TSP-and-mTSP-Combinatorial-Challenges-using-Visual-Reasoning-and-Multi-Agent-Approach-MLLMs-.git\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Emerging Technologies","Computing Research Repository/Computer Science and Game Theory","Computing Research Repository/Multiagent Systems"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"g31gnJrGOVti85gkfcSO2VgMHWn_6uuau7XFVPoiUn8","pdfSize":"8427758","objectId":"0xecbdf54e5ffc0467fc8c6a670274b9b934e6296fb2d9d148d9f774c7a0c77322","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
