{"id":"2407.08423","title":"Finding Quantum Codes via Riemannian Optimization","authors":"Miguel Casanova, Kentaro Ohki, Francesco Ticozzi","authorsParsed":[["Casanova","Miguel",""],["Ohki","Kentaro",""],["Ticozzi","Francesco",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 12:03:41 GMT"}],"updateDate":"2024-07-12","timestamp":1720699421000,"abstract":"  We propose a novel optimization scheme designed to find optimally correctable\nsubspace codes for a known quantum noise channel. To each candidate subspace\ncode we first associate a universal recovery map, as if the code was perfectly\ncorrectable, and aim to maximize a performance functional that combines a\nmodified channel fidelity with a tuneable regularization term that promotes\nsimpler codes. With this choice optimization is performed only over the set of\ncodes, and not over the set of recovery operators. The set of codes of fixed\ndimensions is parametrized as the complex-valued Stiefel manifold of the same\ndimension: the resulting non-convex optimization problem is then solved by\ngradient-based local algorithms. When perfectly correctable codes cannot be\nfound, a second optimization routine is run on the recovery Kraus map, also\nparametrized in a suitable Stiefel manifold via Stinespring representation. To\ntest the approach, correctable codes are sought in different scenarios and\ncompared to existing ones: three qubits subjected to bit-flip errors (single\nand correlated), four qubits undergoing local amplitude damping and five qubits\nsubjected to local depolarizing channels. Approximate codes are found and\ntested for the previous examples as well pure non-Markovian dephasing noise\nacting on a $7/2$ spin, induced by a $1/2$ spin bath, and the noise of the\nfirst three qubits of IBM's \\texttt{ibm\\_kyoto} quantum computer. The fidelity\nresults are competitive with existing iterative optimization algorithms, with\nrespect to which we maintain a strong computational advantage, while obtaining\nsimpler codes.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"2pK8z7VquJFfsJRNqZL-eVAqgcnjATs_OKfcT0mhSgo","pdfSize":"746217","objectId":"0x44fc7a068ed8e6f55dfa30eec30894f143482302b616cf9370ef26a4a9cc09c2","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
