{"id":"2407.15673","title":"IDA: Breaking Barriers in No-code UI Automation Through Large Language\n  Models and Human-Centric Design","authors":"Segev Shlomov, Avi Yaeli, Sami Marreed, Sivan Schwartz, Netanel Eder,\n  Offer Akrabi, Sergey Zeltyn","authorsParsed":[["Shlomov","Segev",""],["Yaeli","Avi",""],["Marreed","Sami",""],["Schwartz","Sivan",""],["Eder","Netanel",""],["Akrabi","Offer",""],["Zeltyn","Sergey",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 14:41:32 GMT"},{"version":"v2","created":"Tue, 23 Jul 2024 05:48:51 GMT"},{"version":"v3","created":"Sun, 18 Aug 2024 09:02:43 GMT"}],"updateDate":"2024-08-20","timestamp":1721659292000,"abstract":"  Business users dedicate significant amounts of time to repetitive tasks\nwithin enterprise digital platforms, highlighting a critical need for\nautomation. Despite advancements in low-code tools for UI automation, their\ncomplexity remains a significant barrier to adoption among non-technical\nbusiness users. However, recent advancements in large language models (LLMs)\nhave created new opportunities to overcome this barrier by offering more\npowerful, yet simpler and more human-centric programming environments. This\npaper presents IDA (Intelligent Digital Apprentice), a novel no-code Web UI\nautomation tool designed specifically to empower business users with no\ntechnical background. IDA incorporates human-centric design principles,\nincluding guided programming by demonstration, semantic programming model, and\nteacher-student learning metaphor which is tailored to the skill set of\nbusiness users. By leveraging LLMs, IDA overcomes some of the key technical\nbarriers that have traditionally limited the possibility of no-code solutions.\nWe have developed a prototype of IDA and conducted a user study involving real\nworld business users and enterprise applications. The promising results\nindicate that users could effectively utilize IDA to create automation. The\nqualitative feedback indicates that IDA is perceived as user-friendly and\ntrustworthy. This study contributes to unlocking the potential of AI assistants\nto enhance the productivity of business users through no-code user interface\nautomation.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"n4DeRn3E8Y7K4KGo8nryynC4t73ZFS7l4Fhv58Q75s4","pdfSize":"3101248"}