{"id":"2407.06492","title":"Using Graph Neural Networks and Frequency Domain Data for Automated\n  Operational Modal Analysis of Populations of Structures","authors":"Xudong Jian, Yutong Xia, Gregory Duth\\'e, Kiran Bacsa, Wei Liu, Eleni\n  Chatzi","authorsParsed":[["Jian","Xudong",""],["Xia","Yutong",""],["Duthé","Gregory",""],["Bacsa","Kiran",""],["Liu","Wei",""],["Chatzi","Eleni",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 01:50:59 GMT"}],"updateDate":"2024-07-10","timestamp":1720489859000,"abstract":"  The Population-Based Structural Health Monitoring (PBSHM) paradigm has\nrecently emerged as a promising approach to enhance data-driven assessment of\nengineering structures by facilitating transfer learning between structures\nwith some degree of similarity. In this work, we apply this concept to the\nautomated modal identification of structural systems. We introduce a Graph\nNeural Network (GNN)-based deep learning scheme to identify modal properties,\nincluding natural frequencies, damping ratios, and mode shapes of engineering\nstructures based on the Power Spectral Density (PSD) of spatially-sparse\nvibration measurements. Systematic numerical experiments are conducted to\nevaluate the proposed model, employing two distinct truss populations that\npossess similar topological characteristics but varying geometric (size, shape)\nand material (stiffness) properties. The results demonstrate that, once\ntrained, the proposed GNN-based model can identify modal properties of unseen\nstructures within the same structural population with good efficiency and\nacceptable accuracy, even in the presence of measurement noise and sparse\nmeasurement locations. The GNN-based model exhibits advantages over the classic\nFrequency Domain Decomposition (FDD) method in terms of identification speed,\nas well as against an alternate Multi-Layer Perceptron (MLP) architecture in\nterms of identification accuracy, rendering this a promising tool for PBSHM\npurposes.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"rdU3_ZvGXNEzq7ufzZnh7_EvYodV8y7xfdjp3hlwn0Y","pdfSize":"1845715"}