{"id":"2407.05551","title":"Read, Watch and Scream! Sound Generation from Text and Video","authors":"Yujin Jeong, Yunji Kim, Sanghyuk Chun, Jiyoung Lee","authorsParsed":[["Jeong","Yujin",""],["Kim","Yunji",""],["Chun","Sanghyuk",""],["Lee","Jiyoung",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 01:59:17 GMT"}],"updateDate":"2024-07-09","timestamp":1720403957000,"abstract":"  Multimodal generative models have shown impressive advances with the help of\npowerful diffusion models. Despite the progress, generating sound solely from\ntext poses challenges in ensuring comprehensive scene depiction and temporal\nalignment. Meanwhile, video-to-sound generation limits the flexibility to\nprioritize sound synthesis for specific objects within the scene. To tackle\nthese challenges, we propose a novel video-and-text-to-sound generation method,\ncalled ReWaS, where video serves as a conditional control for a text-to-audio\ngeneration model. Our method estimates the structural information of audio\n(namely, energy) from the video while receiving key content cues from a user\nprompt. We employ a well-performing text-to-sound model to consolidate the\nvideo control, which is much more efficient for training multimodal diffusion\nmodels with massive triplet-paired (audio-video-text) data. In addition, by\nseparating the generative components of audio, it becomes a more flexible\nsystem that allows users to freely adjust the energy, surrounding environment,\nand primary sound source according to their preferences. Experimental results\ndemonstrate that our method shows superiority in terms of quality,\ncontrollability, and training efficiency. Our demo is available at\nhttps://naver-ai.github.io/rewas\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Multimedia","Computing Research Repository/Sound","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0cH9HzhpsOEgGVcpFbJdiGkn2aKgcr2uFLWkQSq24a4","pdfSize":"10130462"}
