{"id":"2407.00196","title":"Multi-Satellite MIMO Systems for Direct User-Satellite Communications: A\n  Survey","authors":"Zohre Mashayekh Bakhsh, Yasaman Omid, Gaojie Chen, Farbod Kayhan, Yi\n  Ma, Rahim Tafazolli","authorsParsed":[["Bakhsh","Zohre Mashayekh",""],["Omid","Yasaman",""],["Chen","Gaojie",""],["Kayhan","Farbod",""],["Ma","Yi",""],["Tafazolli","Rahim",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 19:09:13 GMT"}],"updateDate":"2024-07-02","timestamp":1719601753000,"abstract":"  Advancements in satellite technology have made direct-to-device connectivity\na viable solution for ensuring global access. This method is designed to\nprovide internet connectivity to remote, rural, or underserved areas where\ntraditional cellular or broadband networks are lacking or insufficient. This\npaper is a survey providing an in-depth review of multi-satellite Multiple\nInput Multiple Output (MIMO) systems as a potential solution for addressing the\nlink budget challenge in direct user-satellite communication. Special attention\nis given to works considering multi-satellite MIMO systems, both with and\nwithout satellite collaboration. In this context, collaboration refers to\nsharing data between satellites to improve the performance of the system. This\nsurvey begins by explaining several fundamental aspects of satellite\ncommunications (SatComs), which are vital prerequisites before investigating\nthe multi-satellite MIMO systems. These aspects encompass satellite orbits, the\nstructure of satellite systems, SatCom links, including the inter-satellite\nlinks (ISL) which facilitate satellite cooperation, satellite frequency bands,\nsatellite antenna design, and satellite channel models, which should be known\nor estimated for effective data transmission to and from multiple satellites.\nFurthermore, this survey distinguishes itself by providing more comprehensive\ninsights in comparison to other surveys. It specifically delves into the\nOrthogonal Time Frequency Space (OTFS) within the channel model section. It\ngoes into detail about ISL noise and channel models, and it extends the ISL\nsection by thoroughly investigating hybrid FSO/RF ISLs. Furthermore, analytical\ncomparisons of simulation results from these works are presented to highlight\nthe advantages of employing multi-satellite MIMO systems.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"4TSqF8GdQXZzlMrel2ARwWIYNSYXzd8dUaEz0xI3Exc","pdfSize":"1725045"}