{"id":"2407.00815","title":"A Deep Learning-based Pest Insect Monitoring System for Ultra-low Power\n  Pocket-sized Drones","authors":"Luca Crupi, Luca Butera, Alberto Ferrante, Daniele Palossi","authorsParsed":[["Crupi","Luca",""],["Butera","Luca",""],["Ferrante","Alberto",""],["Palossi","Daniele",""]],"versions":[{"version":"v1","created":"Tue, 2 Apr 2024 10:39:54 GMT"}],"updateDate":"2024-07-02","timestamp":1712054394000,"abstract":"  Smart farming and precision agriculture represent game-changer technologies\nfor efficient and sustainable agribusiness. Miniaturized palm-sized drones can\nact as flexible smart sensors inspecting crops, looking for early signs of\npotential pest outbreaking. However, achieving such an ambitious goal requires\nhardware-software codesign to develop accurate deep learning (DL) detection\nmodels while keeping memory and computational needs under an ultra-tight\nbudget, i.e., a few MB on-chip memory and a few 100s mW power envelope. This\nwork presents a novel vertically integrated solution featuring two ultra-low\npower System-on-Chips (SoCs), i.e., the dual-core STM32H74 and a multi-core GWT\nGAP9, running two State-of-the-Art DL models for detecting the Popillia\njaponica bug. We fine-tune both models for our image-based detection task,\nquantize them in 8-bit integers, and deploy them on the two SoCs. On the\nSTM32H74, we deploy a FOMO-MobileNetV2 model, achieving a mean average\nprecision (mAP) of 0.66 and running at 16.1 frame/s within 498 mW. While on the\nGAP9 SoC, we deploy a more complex SSDLite-MobileNetV3, which scores an mAP of\n0.79 and peaks at 6.8 frame/s within 33 mW. Compared to a top-notch\nRetinaNet-ResNet101-FPN full-precision baseline, which requires 14.9x more\nmemory and 300x more operations per inference, our best model drops only 15\\%\nin mAP, paving the way toward autonomous palm-sized drones capable of\nlightweight and precise pest detection.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"CWO1IHd_t-pt5IzLNNDyL7ziFzoZL-Du417sTcaUhRI","pdfSize":"9421887"}