{"id":"2407.12585","title":"A global view on star formation: The GLOSTAR Galactic plane survey. XI.\n  Radio source catalog IV: $2^\\circ < \\ell < 28^\\circ$, $36^\\circ < \\ell <\n  60^\\circ$ and $|b| < 1^\\circ$","authors":"S.-N. X. Medina, S. A. Dzib, J. S. Urquhart, A. Y. Yang, A.\n  Brunthaler, K. M. Menten, F. Wyrowski, W. D. Cotton, A. Cheema, R. Dokara, Y.\n  Gong, S. Khan, H. Nguyen, G. N. Ortiz-Leon, M. R. Rugel, V. S. Veena, H.\n  Beuther, T. Csengeri, J. D. Pandian and N. Roy","authorsParsed":[["Medina","S. -N. X.",""],["Dzib","S. A.",""],["Urquhart","J. S.",""],["Yang","A. Y.",""],["Brunthaler","A.",""],["Menten","K. M.",""],["Wyrowski","F.",""],["Cotton","W. D.",""],["Cheema","A.",""],["Dokara","R.",""],["Gong","Y.",""],["Khan","S.",""],["Nguyen","H.",""],["Ortiz-Leon","G. N.",""],["Rugel","M. R.",""],["Veena","V. S.",""],["Beuther","H.",""],["Csengeri","T.",""],["Pandian","J. D.",""],["Roy","N.",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 14:10:19 GMT"},{"version":"v2","created":"Thu, 8 Aug 2024 09:31:39 GMT"}],"updateDate":"2024-09-18","timestamp":1721225419000,"abstract":"  The GLOSTAR survey studies star formation with the VLA and the Effelsberg\n100m telescope in the Galactic plane (-2d<l<60d; |b|<1d) and the Cygnus X\nregion with unprecedented sensitivity in both flux density (~50uJy/beam) and\nthe capability of detecting emission with angular scales in the range from 1\"\nto the largest radio structures in the Galaxy.\n  We provide a complete GLOSTAR-VLA D-configuration radio source catalog for\nthe covered part of the Galactic disk. A catalog for the pilot region\n(28d<l<36d) has been published in a previous paper and here we present the\ncomplementary catalog for the area within 2d<l<28d, 36d<l<60d and |b|<1d.\n  Observations were taken with the VLA in a 4-8GHz band to image 100\ndegrees$^2$ of the inner Galactic disk at a reference frequency of 5.8GHz,\nusing 260h of telescope time. We determined spectral indices inside the\nobserved band and in the frequency range 1.4-5.8GHz by complementing our\nresults with those from the THOR survey (1-2GHz).\n  The final images have an angular resolution of 18\" and an average sensitivity\nof 123uJy/beam. The sensitivity is better (~60uJy/beam) in areas free of\nextended emission. The Galactic disk catalog presented in this work, consists\nof 11211 radio sources. Of these, 1965 are known large-scale structure sources\nsuch as star-forming region complexes, well-known SNRs, SNR candidates or parts\nthereof. The remaining 9227 are discrete individual sources. Source parameters,\nnamely flux densities, sizes, spectral indices, and classifications are\nreported. We identify 769 HII region candidates, 359 are newly classified as\nsuch. The mean value of spectral indices of 225 HII regions is 0.14$\\pm$0.02,\nconsistent with most of them emitting optically thin thermal radio emission.\nCombining our results with the previously published catalog of the pilot\nregion, the final GLOSTAR-VLA D-configuration catalog contains 12981 radio\nsources.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"BrA2yWKJOOjW2boYdXNjeUWEVABTmFxnV85518LELdo","pdfSize":"13818692"}