{"id":"2407.02172","title":"RETINA: a hardware-in-the-loop optical facility with reduced optical\n  aberrations","authors":"Paolo Panicucci and Fabio Ornati and Francesco Topputo","authorsParsed":[["Panicucci","Paolo",""],["Ornati","Fabio",""],["Topputo","Francesco",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 11:26:37 GMT"}],"updateDate":"2024-07-03","timestamp":1719919597000,"abstract":"  The increasing interest in spacecraft autonomy and the complex tasks to be\naccomplished by the spacecraft raise the need for a trustworthy approach to\nperform Verification & Validation of Guidance, Navigation, and Control\nalgorithms. In the context of autonomous operations, vision-based navigation\nalgorithms have established themselves as effective solutions to determine the\nspacecraft state in orbit with low-cost and versatile sensors. Nevertheless,\ndetailed testing must be performed on ground to understand the algorithm's\nrobustness and performance on flight hardware. Given the impossibility of\ntesting directly on orbit these algorithms, a dedicated simulation framework\nmust be developed to emulate the orbital environment in a laboratory setup.\nThis paper presents the design of a low-aberration optical facility called\nRETINA to perform this task. RETINA is designed to accommodate cameras with\ndifferent characteristics (e.g., sensor size and focal length) while ensuring\nthe correct stimulation of the camera detector. A preliminary design is\nperformed to identify the range of possible components to be used in the\nfacility according to the facility requirements. Then, a detailed optical\ndesign is performed in Zemax OpticStudio to optimize the number and\ncharacteristics of the lenses composing the facility's optical systems. The\nfinal design is compared against the preliminary design to show the superiority\nof the optical performance achieved with this approach. This work presents also\na calibration procedure to estimate the misalignment and the centering errors\nin the facility. These estimated parameters are used in a dedicated\ncompensation algorithm, enabling the stimulation of the camera at tens of\narcseconds of precision. Finally, two different applications are presented to\nshow the versatility of RETINA in accommodating different cameras and in\nsimulating different mission scenarios.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"pTEtPqZf2cX_RyVeOvM48tUxXJalhqq26IorPSpb7y0","pdfSize":"6184672"}