{"id":"2407.02311","title":"Hypersonic Boundary Layer Transition and Heat Loading","authors":"Ahmad Peyvan, Luis Bravo, Anindya Ghoshal, Olaf Marxen, George\n  Karniadakis","authorsParsed":[["Peyvan","Ahmad",""],["Bravo","Luis",""],["Ghoshal","Anindya",""],["Marxen","Olaf",""],["Karniadakis","George",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 14:45:03 GMT"}],"updateDate":"2024-07-03","timestamp":1719931503000,"abstract":"  Hypersonic boundary layer transition using high-order methods for direct\nnumerical simulations (DNS) is largely unexplored, although a few references\nexist in the literature. Experimental data in the hypersonic regime are scarce,\nwhile almost all existing hypersonic codes have low-order accuracy, which could\nlead to erroneous results in long-time integration and at high Reynolds\nnumbers. Here, we focus on the transition from laminar to turbulent flow, where\nthe Nusselt number may be five times or higher than the Nusselt number in the\nturbulent regime. The hypersonic flow regime must be modeled accurately using\nrealistic chemistry to predict heat flux on the surface correctly. In this\nstudy, we simulate hypersonic boundary layer transition on a flat plate to\ncompute the thermal and shear stresses on the wall. The domain is initialized\nwith a laminar Blasius solution of compressible boundary layer equations. The\ntransition to turbulence is induced using suction and blowing from a thin strip\non the wall. Sponge regions are defined at the inflow and outflow boundaries to\neliminate the solution contamination due to the reflections of the boundary\nconditions. In the spanwise direction, periodic boundary conditions are\nimposed. The numerical method applied here is a sixth-order compact finite\ndifference in the interior of the domain coupled with a fourth-order\nRunge-Kutta time-stepping scheme for a structured Cartesian grid using\nstaggered variables. The base finite difference code can perform simulations of\nnon-equilibrium hypersonic flows. The numerical scheme is stabilized using the\napproximate deconvolution model (ADM) and artificial diffusion coefficients. We\ninvestigated the effect of non-equilibrium chemistry on the non-linear\ninstability growth with hypersonic boundary layers. We also quantify thermal\nloads during the boundary layer laminar to turbulent transition for Mach number\n10.\n","subjects":["Physics/Fluid Dynamics","Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"pqVZlCDnxNxU_6erfXH86WW_h2vJrfzlJ-06Sn20p2Y","pdfSize":"4889129"}