{"id":"2407.10662","title":"XEQ Scale for Evaluating XAI Experience Quality Grounded in Psychometric\n  Theory","authors":"Anjana Wijekoon, Nirmalie Wiratunga, David Corsar, Kyle Martin,\n  Ikechukwu Nkisi-Orji, Belen D\\'iaz-Agudo, Derek Bridge","authorsParsed":[["Wijekoon","Anjana",""],["Wiratunga","Nirmalie",""],["Corsar","David",""],["Martin","Kyle",""],["Nkisi-Orji","Ikechukwu",""],["Díaz-Agudo","Belen",""],["Bridge","Derek",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 12:25:49 GMT"},{"version":"v2","created":"Sun, 21 Jul 2024 13:54:35 GMT"},{"version":"v3","created":"Fri, 23 Aug 2024 09:51:43 GMT"}],"updateDate":"2024-08-26","timestamp":1721046349000,"abstract":"  Explainable Artificial Intelligence (XAI) aims to improve the transparency of\nautonomous decision-making through explanations. Recent literature has\nemphasised users' need for holistic \"multi-shot\" explanations and the ability\nto personalise their engagement with XAI systems. We refer to this user-centred\ninteraction as an XAI Experience. Despite advances in creating XAI experiences,\nevaluating them in a user-centred manner has remained challenging. To address\nthis, we introduce the XAI Experience Quality (XEQ) Scale (pronounced \"Seek\"\nScale), for evaluating the user-centred quality of XAI experiences.\nFurthermore, XEQ quantifies the quality of experiences across four evaluation\ndimensions: learning, utility, fulfilment and engagement. These contributions\nextend the state-of-the-art of XAI evaluation, moving beyond the\none-dimensional metrics frequently developed to assess single-shot\nexplanations. In this paper, we present the XEQ scale development and\nvalidation process, including content validation with XAI experts as well as\ndiscriminant and construct validation through a large-scale pilot study. Out\npilot study results offer strong evidence that establishes the XEQ Scale as a\ncomprehensive framework for evaluating user-centred XAI experiences.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"1xjRk6Xp9TgzeTEko4jMZ9Rum-JTEwiGDENmqAfgr5s","pdfSize":"27401987"}