{"id":"2407.17657","title":"My Ontologist: Evaluating BFO-Based AI for Definition Support","authors":"Carter Benson, Alec Sculley, Austin Liebers, and John Beverley","authorsParsed":[["Benson","Carter",""],["Sculley","Alec",""],["Liebers","Austin",""],["Beverley","John",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 21:50:36 GMT"},{"version":"v2","created":"Tue, 20 Aug 2024 13:39:51 GMT"}],"updateDate":"2024-08-21","timestamp":1721857836000,"abstract":"  Generative artificial intelligence (AI), exemplified by the release of\nGPT-3.5 in 2022, has significantly advanced the potential applications of large\nlanguage models (LLMs), including in the realms of ontology development and\nknowledge graph creation. Ontologies, which are structured frameworks for\norganizing information, and knowledge graphs, which combine ontologies with\nactual data, are essential for enabling interoperability and automated\nreasoning. However, current research has largely overlooked the generation of\nontologies extending from established upper-level frameworks like the Basic\nFormal Ontology (BFO), risking the creation of non-integrable ontology silos.\nThis study explores the extent to which LLMs, particularly GPT-4, can support\nontologists trained in BFO. Through iterative development of a specialized GPT\nmodel named \"My Ontologist,\" we aimed to generate BFO-conformant ontologies.\nInitial versions faced challenges in maintaining definition conventions and\nleveraging foundational texts effectively. My Ontologist 3.0 showed promise by\nadhering to structured rules and modular ontology suites, yet the release of\nGPT-4o disrupted this progress by altering the model's behavior. Our findings\nunderscore the importance of aligning LLM-generated ontologies with top-level\nstandards and highlight the complexities of integrating evolving AI\ncapabilities in ontology engineering.\n","subjects":["Computing Research Repository/Databases"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"t0yJr0-2bkfvGjtatgWd3WSxvhu73XoirsFGbuGs0Q0","pdfSize":"318940"}