{"id":"2407.13832","title":"Can light-rings self-gravitate?","authors":"Francesco Di Filippo, Luciano Rezzolla","authorsParsed":[["Di Filippo","Francesco",""],["Rezzolla","Luciano",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 18:05:39 GMT"}],"updateDate":"2024-07-22","timestamp":1721325939000,"abstract":"  In a spherically symmetric and static spacetime of a compact object, such as\nthat of a Schwarzschild black hole, the light-ring is a 2-sphere where photons\nexperience the only possible circular orbits. As a \"Gedankenexperiment\", we\nimagine an advanced civilisation able to populate the light-ring of a\nnonrotating black hole of mass $M$ with photons having a fine-tuned impact\nparameter that allows their orbits to be exactly circular with radius $r=3M$.\nAs the number of photons in the light-ring increases in time, its mass will no\nlonger be negligible and hence it will impact on the background spacetime, that\nis, it will \"self-gravitate\". We here consider two different routes to assign a\nnonzero mass to the light-ring that are either based on a discrete\nconcentration of photons on a specific radial location or on a suitable\ndistribution of photons in a given region. In both cases, and using the\nEinstein equations, we find that the inclusion of the energy from the\naccumulated photons leads to the generation of new light-rings. Such new\nlight-rings can either appear at well-defined but discrete locations, or be\nfused in a well-defined region. In either case, we show that such light-ring\nconfigurations are dynamically unstable and a small perturbation, either via\nthe inclusion of an additional photon onto the light-ring or via the absorption\nof a photon by the black hole, leads to a catastrophic destruction of the\nlight-ring structures.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"rAq5YFIUUF5wdH7L228qNFRmgHsOihUEAIbZwkTwYlE","pdfSize":"440766"}