{"id":"2407.13666","title":"Non-Asymptotic Uncertainty Quantification in High-Dimensional Learning","authors":"Frederik Hoppe, Claudio Mayrink Verdun, Hannah Laus, Felix Krahmer and\n  Holger Rauhut","authorsParsed":[["Hoppe","Frederik",""],["Verdun","Claudio Mayrink",""],["Laus","Hannah",""],["Krahmer","Felix",""],["Rauhut","Holger",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 16:42:10 GMT"}],"updateDate":"2024-07-19","timestamp":1721320930000,"abstract":"  Uncertainty quantification (UQ) is a crucial but challenging task in many\nhigh-dimensional regression or learning problems to increase the confidence of\na given predictor. We develop a new data-driven approach for UQ in regression\nthat applies both to classical regression approaches such as the LASSO as well\nas to neural networks. One of the most notable UQ techniques is the debiased\nLASSO, which modifies the LASSO to allow for the construction of asymptotic\nconfidence intervals by decomposing the estimation error into a Gaussian and an\nasymptotically vanishing bias component. However, in real-world problems with\nfinite-dimensional data, the bias term is often too significant to be\nneglected, resulting in overly narrow confidence intervals. Our work rigorously\naddresses this issue and derives a data-driven adjustment that corrects the\nconfidence intervals for a large class of predictors by estimating the means\nand variances of the bias terms from training data, exploiting high-dimensional\nconcentration phenomena. This gives rise to non-asymptotic confidence\nintervals, which can help avoid overestimating uncertainty in critical\napplications such as MRI diagnosis. Importantly, our analysis extends beyond\nsparse regression to data-driven predictors like neural networks, enhancing the\nreliability of model-based deep learning. Our findings bridge the gap between\nestablished theory and the practical applicability of such debiased methods.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Image and Video Processing","Mathematics/Information Theory","Statistics/Applications","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"yiYEDPYACrU5SekqzOo9yTN_DzfTRC-U8P2arVA_hmU","pdfSize":"1576250","objectId":"0xfb1f911e1feb465c3d4eb6a01a697e8ead412338e85022f542b2eb853dad84a1","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
