{"id":"2407.04192","title":"KAN-ODEs: Kolmogorov-Arnold Network Ordinary Differential Equations for\n  Learning Dynamical Systems and Hidden Physics","authors":"Benjamin C. Koenig, Suyong Kim, Sili Deng","authorsParsed":[["Koenig","Benjamin C.",""],["Kim","Suyong",""],["Deng","Sili",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 00:38:49 GMT"},{"version":"v2","created":"Fri, 19 Jul 2024 01:36:34 GMT"}],"updateDate":"2024-07-22","timestamp":1720139929000,"abstract":"  Kolmogorov-Arnold networks (KANs) as an alternative to multi-layer\nperceptrons (MLPs) are a recent development demonstrating strong potential for\ndata-driven modeling. This work applies KANs as the backbone of a neural\nordinary differential equation (ODE) framework, generalizing their use to the\ntime-dependent and temporal grid-sensitive cases often seen in dynamical\nsystems and scientific machine learning applications. The proposed KAN-ODEs\nretain the flexible dynamical system modeling framework of Neural ODEs while\nleveraging the many benefits of KANs compared to MLPs, including higher\naccuracy and faster neural scaling, stronger interpretability and\ngeneralizability, and lower parameter counts. First, we quantitatively\ndemonstrated these improvements in a comprehensive study of the classical\nLotka-Volterra predator-prey model. We then showcased the KAN-ODE framework's\nability to learn symbolic source terms and complete solution profiles in\nhigher-complexity and data-lean scenarios including wave propagation and shock\nformation, the complex Schr\\\"odinger equation, and the Allen-Cahn phase\nseparation equation. The successful training of KAN-ODEs, and their improved\nperformance compared to traditional Neural ODEs, implies significant potential\nin leveraging this novel network architecture in myriad scientific machine\nlearning applications for discovering hidden physics and predicting dynamic\nevolution.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"m3LW-bEgapT9t-CVttIg3DBZcJVyAoLoKH0vLX6Dedc","pdfSize":"12209412"}