{"id":"2407.16745","title":"She's Got Her Mother's Hair: End-to-End Collapsar Simulations Unveil the\n  Origin of Black Holes' Magnetic Field","authors":"Ore Gottlieb, Mathieu Renzo, Brian D. Metzger, Jared A. Goldberg,\n  Matteo Cantiello","authorsParsed":[["Gottlieb","Ore",""],["Renzo","Mathieu",""],["Metzger","Brian D.",""],["Goldberg","Jared A.",""],["Cantiello","Matteo",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 18:00:00 GMT"}],"updateDate":"2024-07-25","timestamp":1721757600000,"abstract":"  Relativistic jets from a black hole (BH) following the core-collapse of a\nmassive star (''collapsar'') is a leading model for gamma-ray bursts (GRBs).\nHowever, the two key ingredients for a Blandford-Znajek (BZ) powered jet $-$\nrapid rotation and a strong magnetic field $-$ seem mutually exclusive. Strong\nfields in the progenitor star's core transport angular momentum outwards more\nquickly, slowing down the core before collapse. Using MESA stellar evolution\nmodels followed to core-collapse, we explicitly show that the small\nlength-scale of the instabilities, likely responsible for angular momentum\ntransport in the core (e.g., Tayler-Spruit), results in a low net magnetic flux\nfed to the BH horizon, far too small to power GRB jets. Instead, we propose a\nnovel scenario in which collapsar BHs acquire their magnetic ''hair'' from\ntheir progenitor proto-neutron star (PNS), which is likely highly magnetized\nfrom an internal dynamo. We evaluate the conditions for the BH accretion disk\nto pin the PNS magnetosphere to its horizon immediately after the collapse. Our\nresults show that the PNS's pre-collapse energy matches the excess energy in\nIc-BL supernovae, while the nascent BH's spin and magnetic flux produce jets\nconsistent with observed GRB characteristics. We map our MESA models to 3D\ngeneral-relativistic magnetohydrodynamic simulations and confirm that accretion\ndisks confine the strong magnetic flux initiated near a rotating BH, enabling\nthe launch of successful GRB jets, whereas a slower spinning BH or one without\na disk fails to do so. Our model indicates that standard GRB jets emerge\nwhenever an accretion disk forms.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"wzn3a3NXvxGPuOssmznCSKv8bM9a4E6X8Hm_AhEjmxI","pdfSize":"9388053"}