{"id":"2407.03348","title":"Jacobi Set Simplification for Tracking Topological Features in\n  Time-Varying Scalar Fields","authors":"Dhruv Meduri, Mohit Sharma and Vijay Natarajan","authorsParsed":[["Meduri","Dhruv",""],["Sharma","Mohit",""],["Natarajan","Vijay",""]],"versions":[{"version":"v1","created":"Fri, 7 Jun 2024 04:31:29 GMT"}],"updateDate":"2024-07-08","timestamp":1717734689000,"abstract":"  The Jacobi set of a bivariate scalar field is the set of points where the\ngradients of the two constituent scalar fields align with each other. It\ncaptures the regions of topological changes in the bivariate field. The Jacobi\nset is a bivariate analog of critical points, and may correspond to features of\ninterest. In the specific case of time-varying fields and when one of the\nscalar fields is time, the Jacobi set corresponds to temporal tracks of\ncritical points, and serves as a feature-tracking graph. The Jacobi set of a\nbivariate field or a time-varying scalar field is complex, resulting in\ncluttered visualizations that are difficult to analyze. This paper addresses\nthe problem of Jacobi set simplification. Specifically, we use the time-varying\nscalar field scenario to introduce a method that computes a reduced Jacobi set.\nThe method is based on a stability measure called robustness that was\noriginally developed for vector fields and helps capture the structural\nstability of critical points. We also present a mathematical analysis for the\nmethod, and describe an implementation for 2D time-varying scalar fields.\nApplications to both synthetic and real-world datasets demonstrate the\neffectiveness of the method for tracking features.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Computational Geometry","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Graphics","Computing Research Repository/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"eYi4MxUtohDhopJINXD0eJ77yTrSm0KBHxvOaeqU7N8","pdfSize":"17434946"}
