{"id":"2407.09393","title":"A Numerical Study of WENO Approximations to Sharp Propagating Fronts for\n  Reaction-Diffusion Systems","authors":"Jiaxi Gu, Daniel Olmos-Liceaga, Jae-Hun Jung","authorsParsed":[["Gu","Jiaxi",""],["Olmos-Liceaga","Daniel",""],["Jung","Jae-Hun",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 16:17:37 GMT"}],"updateDate":"2024-07-15","timestamp":1720801057000,"abstract":"  Many reaction-diffusion systems in various applications exhibit traveling\nwave solutions that evolve on multiple spatio-temporal scales. These traveling\nwave solutions are crucial for understanding the underlying dynamics of the\nsystem. In this work, we present sixth-order weighted essentially\nnon-oscillatory (WENO) methods within the finite difference framework to solve\nreaction-diffusion systems. The WENO method allows us to use fewer grid points\nand larger time steps compared to classical finite difference methods. Our\nfocus is on solving the reaction-diffusion system for the traveling wave\nsolution with the sharp front. Although the WENO method is popular for\nhyperbolic conservation laws, especially for problems with discontinuity, it\ncan be adapted for the equations of parabolic type, such as reaction-diffusion\nsystems, to effectively handle sharp wave fronts. Thus, we employed the WENO\nmethods specifically developed for equations of parabolic type. We considered\nvarious reaction-diffusion equations, including Fisher's, Zeldovich,\nNewell-Whitehead-Segel, bistable equations, and the Lotka-Volterra\ncompetition-diffusion system, all of which yield traveling wave solutions with\nsharp wave fronts. Numerical examples in this work demonstrate that the central\nWENO method is highly more accurate and efficient than the commonly used finite\ndifference method. We also provide an analysis related to the numerical speed\nof the sharp propagating front in the Newell-Whitehead-Segel equation. The\noverall results confirm that the central WENO method is highly efficient and is\nrecommended for solving reaction-diffusion equations with sharp wave fronts.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"mtbrE8uab6k0_gt2X7NLUFZuCZK1ERMWb6Rg5tmHX-g","pdfSize":"1141275","objectId":"0x200e6355a24aa6d9211600164d661abf129a7e93a7522b0773fe226c66b72cb8","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
