{"id":"2407.11676","title":"SKADA-Bench: Benchmarking Unsupervised Domain Adaptation Methods with\n  Realistic Validation","authors":"Yanis Lalou, Th\\'eo Gnassounou, Antoine Collas, Antoine de Mathelin,\n  Oleksii Kachaiev, Ambroise Odonnat, Alexandre Gramfort, Thomas Moreau, R\\'emi\n  Flamary","authorsParsed":[["Lalou","Yanis",""],["Gnassounou","Théo",""],["Collas","Antoine",""],["de Mathelin","Antoine",""],["Kachaiev","Oleksii",""],["Odonnat","Ambroise",""],["Gramfort","Alexandre",""],["Moreau","Thomas",""],["Flamary","Rémi",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 12:52:29 GMT"}],"updateDate":"2024-07-17","timestamp":1721134349000,"abstract":"  Unsupervised Domain Adaptation (DA) consists of adapting a model trained on a\nlabeled source domain to perform well on an unlabeled target domain with some\ndata distribution shift. While many methods have been proposed in the\nliterature, fair and realistic evaluation remains an open question,\nparticularly due to methodological difficulties in selecting hyperparameters in\nthe unsupervised setting. With SKADA-Bench, we propose a framework to evaluate\nDA methods and present a fair evaluation of existing shallow algorithms,\nincluding reweighting, mapping, and subspace alignment. Realistic\nhyperparameter selection is performed with nested cross-validation and various\nunsupervised model selection scores, on both simulated datasets with controlled\nshifts and real-world datasets across diverse modalities, such as images, text,\nbiomedical, and tabular data with specific feature extraction. Our benchmark\nhighlights the importance of realistic validation and provides practical\nguidance for real-life applications, with key insights into the choice and\nimpact of model selection approaches. SKADA-Bench is open-source, reproducible,\nand can be easily extended with novel DA methods, datasets, and model selection\ncriteria without requiring re-evaluating competitors. SKADA-Bench is available\non GitHub at https://github.com/scikit-adaptation/skada-bench.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Statistics/Methodology","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"RaShZsPEdYWYDfvHFuahJ5DOR-fNvdOGK09vynT1xyM","pdfSize":"1322093"}