{"id":"2407.17506","title":"Free Energy Difference Fluctuations in Short-Range Spin Glasses","authors":"C.M. Newman and D.L. Stein","authorsParsed":[["Newman","C. M.",""],["Stein","D. L.",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 18:40:34 GMT"}],"updateDate":"2024-07-26","timestamp":1720377634000,"abstract":"  It is generally believed (but not yet proved) that Ising spin glasses with\nnearest-neighbor interactions have a phase transition in three and higher\ndimensions to a low-temperature spin glass phase, but the nature of this phase\nremains controversial, especially whether it is characterized by multiple\nincongruent Gibbs states. Of particular relevance to this question is the\nbehavior of the typical free energy difference restricted to a finite volume\nbetween two such putative Gibbs states, as well as the nature of the\nfluctuations of their free energy difference as the couplings within the volume\nvary. In this paper we investigate these free energy difference fluctuations by\nintroducing a new kind of metastate which classifies Gibbs states through their\nedge overlap values with a reference Gibbs state randomly chosen from the\nsupport of the periodic boundary condition (PBC) metastate. We find that the\nfree energy difference between any two incongruent pure states, regardless of\nthe details of how they're organized into mixed states within the PBC\nmetastate, converges to a Gaussian (or Gaussian-like) distribution whose\nvariance scales with the volume, proving a decades-old conjecture of Fisher and\nHuse. The same conclusion applies, though with some additional restrictions, to\nboth mixed Gibbs states and ground states. We discuss some implications of\nthese results.\n","subjects":["Condensed Matter/Disordered Systems and Neural Networks","Condensed Matter/Statistical Mechanics","Physics/Mathematical Physics","Mathematics/Mathematical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"l3th7kN3nFT6A8IlXCXWDlOwIK_ATCizxyjRYeL6fk8","pdfSize":"309484"}