{"id":"2407.18094","title":"Nonlinear magneto-optical response across van Hove singularity in a\n  non-centrosymmetric magnetic Weyl semimetal","authors":"Jian Li, Kai-He Ding, and Lijun Tang","authorsParsed":[["Li","Jian",""],["Ding","Kai-He",""],["Tang","Lijun",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 15:01:32 GMT"}],"updateDate":"2024-07-26","timestamp":1721919692000,"abstract":"  We investigate the nonlinear magneto-optical response in non-centrosymmetric\nmagnetic Weyl semimetals featuring a quadratic tilt, focusing particularly on\nthe influence of the van Hove singularity (VHS). In the absence of a magnetic\nfield, the second-order nonlinear Drude conductivity components exhibit\ninflection or dip behavior across the VHS. In contrast, the second-order\nnonlinear anomalous Hall conductivity, primarily governed by the Berry\ncurvature dipole, manifests a subtle plateau-like structure. As the tilt\nstrength increases, the VHS energy escalates, thereby amplifying the\nVHS-induced characteristics within these second-order conductivity components.\nHowever, in the presence of a magnetic field, we show that the resultant\nmagnetic moment suppresses nonlinear electron transport while enhancing\nnonlinear hole transport. %both suppresses and notably enhances nonlinear\nmagnetic-optical transport in the electron and hole regions, respectively. This\neffect serves to mitigate the impact of the VHS, resulting specifically in an\nasymmetric peak or a kinked-like structure in the magnetic field-induced\ncontribution to the second-order nonlinear conductivity near the Weyl nodes.\nThese findings provide new insights into the intricate interplay among the VHS,\nBerry curvature, and magnetic moment in nonlinear magneto-optical transport\nthrough non-centrosymmetric magnetic Weyl semimetals.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"AmLJLnhkHdXlKuEhNcm4WGEkdmxyeyJoq-uoaX_KLbg","pdfSize":"2474766"}