{"id":"2407.01047","title":"Development of Cognitive Intelligence in Pre-trained Language Models","authors":"Raj Sanjay Shah, Khushi Bhardwaj, Sashank Varma","authorsParsed":[["Shah","Raj Sanjay",""],["Bhardwaj","Khushi",""],["Varma","Sashank",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 07:56:36 GMT"},{"version":"v2","created":"Sun, 7 Jul 2024 07:54:05 GMT"},{"version":"v3","created":"Fri, 12 Jul 2024 05:47:31 GMT"}],"updateDate":"2024-07-15","timestamp":1719820596000,"abstract":"  Recent studies show evidence for emergent cognitive abilities in Large\nPre-trained Language Models (PLMs). The increasing cognitive alignment of these\nmodels has made them candidates for cognitive science theories. Prior research\ninto the emergent cognitive abilities of PLMs has largely been path-independent\nto model training, i.e., has focused on the final model weights and not the\nintermediate steps. However, building plausible models of human cognition using\nPLMs would benefit from considering the developmental alignment of their\nperformance during training to the trajectories of children's thinking. Guided\nby psychometric tests of human intelligence, we choose four sets of tasks to\ninvestigate the alignment of ten popular families of PLMs and evaluate their\navailable intermediate and final training steps. These tasks are Numerical\nability, Linguistic abilities, Conceptual understanding, and Fluid reasoning.\nWe find a striking regularity: regardless of model size, the developmental\ntrajectories of PLMs consistently exhibit a window of maximal alignment to\nhuman cognitive development. Before that window, training appears to endow\n\"blank slate\" models with the requisite structure to be poised to rapidly learn\nfrom experience. After that window, training appears to serve the engineering\ngoal of reducing loss but not the scientific goal of increasing alignment with\nhuman cognition.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"3kMGILSwkjbVocmn48tZ6BNEnMd6yqoMFpG7ysTaWd8","pdfSize":"4371000"}