{"id":"2407.04676","title":"Is plantar thermography a valid digital biomarker for characterising\n  diabetic foot ulceration risk?","authors":"Akshay Jagadeesh, Chanchanok Aramrat, Aqsha Nur, Poppy Mallinson,\n  Sanjay Kinra","authorsParsed":[["Jagadeesh","Akshay",""],["Aramrat","Chanchanok",""],["Nur","Aqsha",""],["Mallinson","Poppy",""],["Kinra","Sanjay",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 17:39:03 GMT"}],"updateDate":"2024-07-08","timestamp":1720201143000,"abstract":"  Background: In the absence of prospective data on diabetic foot ulcers (DFU),\ncross-sectional associations with causal risk factors (peripheral neuropathy,\nand peripheral arterial disease (PAD)) could be used to establish the validity\nof plantar thermography for DFU risk stratification.\n  Methods: First, we investigated the associations between the intrinsic\nclusters of plantar thermographic images with several DFU risk factors using an\nunsupervised deep-learning framework. We then studied associations between\nobtained thermography clusters and DFU risk factors. Second, to identify those\nassociations with predictive power, we used supervised learning to train\nConvolutional Neural Network (CNN) regression/classification models that\npredicted the risk factor based on the thermograph (and visual) input.\n  Findings: Our dataset comprised 282 thermographs from type 2 diabetes\nmellitus patients (aged 56.31 +- 9.18 years, 51.42 % males). On clustering, we\nfound two overlapping clusters (silhouette score = 0.10, indicating weak\nseparation). There was strong evidence for associations between assigned\nclusters and several factors related to diabetic foot ulceration such as\nperipheral neuropathy, PAD, number of diabetes complications, and composite DFU\nrisk prediction scores such as Martins-Mendes, PODUS-2020, and SIGN. However,\nmodels predicting said risk factors had poor performances.\n  Interpretation: The strong associations between intrinsic thermography\nclusters and several DFU risk factors support the validity of using\nthermography for characterising DFU risk. However, obtained associations did\nnot prove to be predictive, likely due to, spectrum bias, or because\nthermography and classical risk factors characterise incompletely overlapping\nportions of the DFU risk construct. Our findings highlight the challenges in\nstandardising ground truths when defining novel digital biomarkers.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"aF2D4CPQZElrkKk0awowzEQcmdBWDRg6DtO9PYg0rtA","pdfSize":"549839"}