{"id":"2407.08163","title":"Probing outbursts of the transient neutron star low mass X-ray binary\n  Aql X-1 with NICER: a study of spectral evolution","authors":"Karthik Gananath Putha (UofSC, USA), Yash Bhargava (TIFR, INDIA),\n  Sudip Bhattacharyya (TIFR, India)","authorsParsed":[["Putha","Karthik Gananath","","UofSC, USA"],["Bhargava","Yash","","TIFR, INDIA"],["Bhattacharyya","Sudip","","TIFR, India"]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 03:52:53 GMT"}],"updateDate":"2024-07-12","timestamp":1720669973000,"abstract":"  X-ray observations of neutron star (NS) low mass X-ray binaries (LMXBs) are\nuseful to probe physical processes close to the NS and to constrain source\nparameters. Aql X-1 is a transient NS LMXB which frequently undergoes outbursts\nprovides an excellent opportunity to study source properties and accretion\nmechanism in strong gravity regime over a wide range of accretion rates. In\nthis work, we systematically investigate the spectral evolution of Aql X-1\nusing NICER observations during the source outbursts in 2019 and 2020. The\nNICER observations cover the complete transition of the source from its\ncanonical hard state to soft state and back. The spectra extracted from most\nobservations can be explained by a partially Comptonised accretion disc. We\nfind that the system can be described by an accretion disk with an inner\ntemperature of $\\approx0.7$ keV and a Comptonising medium of thermal electrons\nat $\\approx2$ keV, while the photon index is strongly degenerate with the\ncovering fraction of the medium. We also find evidence of Fe K$\\alpha$\nfluorescence emission in the spectra indicating reprocessing of the Comptonised\nphotons. We observe an absorption column density higher than the Galactic\ncolumn density for most of the observations indicating a significant local\nabsorption. But for some of the observations in 2020 outburst, the local\nabsorption is negligible.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_TWkTCgZPYL2x6opTqDhbEl3apsAOXvu1uUOvtjf5yc","pdfSize":"674018","objectId":"0x38e78d37164296000f38fdc7e952ead75bdbdd0bdb4b1a8ccf56f671c6ee8d83","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
