{"id":"2407.16212","title":"Optimal experimental design: Formulations and computations","authors":"Xun Huan, Jayanth Jagalur, Youssef Marzouk","authorsParsed":[["Huan","Xun",""],["Jagalur","Jayanth",""],["Marzouk","Youssef",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 06:33:37 GMT"}],"updateDate":"2024-07-24","timestamp":1721716417000,"abstract":"  Questions of `how best to acquire data' are essential to modeling and\nprediction in the natural and social sciences, engineering applications, and\nbeyond. Optimal experimental design (OED) formalizes these questions and\ncreates computational methods to answer them. This article presents a\nsystematic survey of modern OED, from its foundations in classical design\ntheory to current research involving OED for complex models. We begin by\nreviewing criteria used to formulate an OED problem and thus to encode the goal\nof performing an experiment. We emphasize the flexibility of the Bayesian and\ndecision-theoretic approach, which encompasses information-based criteria that\nare well-suited to nonlinear and non-Gaussian statistical models. We then\ndiscuss methods for estimating or bounding the values of these design criteria;\nthis endeavor can be quite challenging due to strong nonlinearities, high\nparameter dimension, large per-sample costs, or settings where the model is\nimplicit. A complementary set of computational issues involves optimization\nmethods used to find a design; we discuss such methods in the discrete\n(combinatorial) setting of observation selection and in settings where an exact\ndesign can be continuously parameterized. Finally we present emerging methods\nfor sequential OED that build non-myopic design policies, rather than explicit\ndesigns; these methods naturally adapt to the outcomes of past experiments in\nproposing new experiments, while seeking coordination among all experiments to\nbe performed. Throughout, we highlight important open questions and challenges.\n","subjects":["Statistics/Methodology","Computing Research Repository/Numerical Analysis","Mathematics/Numerical Analysis","Statistics/Computation"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"JgZNAAguHvQFvBZNM9DwbR0Xef4Ji1SFg3L5UqLc9_4","pdfSize":"5425439"}