{"id":"2407.11728","title":"Evolution of complexity and the origins of biochemical life","authors":"Praful Gagrani","authorsParsed":[["Gagrani","Praful",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 13:49:39 GMT"}],"updateDate":"2024-07-17","timestamp":1721137779000,"abstract":"  While modern physics and biology satisfactorily explain the passage from the\nBig Bang to the formation of Earth and the first cells to present-day life,\nrespectively, the origins of biochemical life still remain an open question.\nSince life, as we know it, requires extremely long genetic polymers, any answer\nto the question must explain how an evolving system of polymers of\never-increasing length could come about on a planet that otherwise consisted\nonly of small molecular building blocks. In this work, we show that, under\nrealistic constraints, an abstract polymer model can exhibit dynamics such that\nattractors in the polymer population space with a higher average polymer length\nare also more probable. We generalize from the model and formalize the notions\nof complexity and evolution for chemical reaction networks with multiple\nattractors. The complexity of a species is defined as the minimum number of\nreactions needed to produce it from a set of building blocks, which in turn is\nused to define a measure of complexity for an attractor. A transition between\nattractors is considered to be a progressive evolution if the attractor with\nthe higher probability also has a higher complexity. In an environment where\nonly monomers are readily available, the attractor with a higher average\npolymer length is more complex. Thus, our abstract polymer model can exhibit\nprogressive evolution for a range of thermodynamically plausible rate\nconstants. We also formalize criteria for open-ended and\nhistorically-contingent evolution and explain the role of autocatalysis in\nobtaining them. Our work provides a basis for searching for prebiotically\nplausible scenarios in which long polymers can emerge and yield populations\nwith even longer polymers.\n","subjects":["Quantitative Biology/Populations and Evolution","Nonlinear Sciences/Adaptation and Self-Organizing Systems"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"uXB6-HKnCeIcb3T7hhWxHHqb1hBgDk8Wf93wZowtuFM","pdfSize":"2644505"}