{"id":"2407.03170","title":"On a classification of planar functions in characteristic three","authors":"Samuele Andreoli, Lilya Budaghyan, Robert Coulter, Alise Haukenes,\n  Nikolay Kaleyski, Enrico Piccione","authorsParsed":[["Andreoli","Samuele",""],["Budaghyan","Lilya",""],["Coulter","Robert",""],["Haukenes","Alise",""],["Kaleyski","Nikolay",""],["Piccione","Enrico",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 14:43:35 GMT"}],"updateDate":"2024-07-04","timestamp":1720017815000,"abstract":"  Planar functions are functions over a finite field that have optimal\ncombinatorial properties and they have applications in several branches of\nmathematics, including algebra, projective geometry and cryptography. There are\ntwo relevant equivalence relations for planar functions, that are isotopic\nequivalence and CCZ-equivalence. Classification of planar functions is\nperformed via CCZ-equivalence which arises from cryptographic applications. In\nthe case of quadratic planar functions, isotopic equivalence, coming from\nconnections to commutative semifields, is more general than CCZ-equivalence and\nisotopic transformations can be considered as a construction method providing\nup to two CCZ-inequivalent mappings. In this paper, we first survey known\ninfinite classes and sporadic cases of planar functions up to CCZ-equivalence,\naiming to exclude equivalent cases and to identify those with the potential to\nprovide additional functions via isotopic equivalence. In particular, for\nfields of order $3^n$ with $n\\le 11$, we completely resolve if and when\nisotopic equivalence provides different CCZ-classes for all currently known\nplanar functions. Further, we perform an extensive computational investigation\non some of these fields and find seven new sporadic planar functions over\n$\\mathbb{F}_{3^6}$ and two over $\\mathbb{F}_{3^9}$. Finally, we give new simple\nquadrinomial representatives for the Dickson family of planar functions.\n","subjects":["Mathematics/Combinatorics","Mathematics/Algebraic Geometry"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_S_ba7VQJtjhAp_B6lHC31_OhuV9gBVyuCbomcCBeFM","pdfSize":"355932"}