{"id":"2407.09913","title":"Emotion Detection through Body Gesture and Face","authors":"Haoyang Liu","authorsParsed":[["Liu","Haoyang",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 15:15:50 GMT"}],"updateDate":"2024-07-16","timestamp":1720883750000,"abstract":"  The project leverages advanced machine and deep learning techniques to\naddress the challenge of emotion recognition by focusing on non-facial cues,\nspecifically hands, body gestures, and gestures. Traditional emotion\nrecognition systems mainly rely on facial expression analysis and often ignore\nthe rich emotional information conveyed through body language. To bridge this\ngap, this method leverages the Aff-Wild2 and DFEW databases to train and\nevaluate a model capable of recognizing seven basic emotions (angry, disgust,\nfear, happiness, sadness, surprise, and neutral) and estimating valence and\ncontinuous scales wakeup descriptor.\n  Leverage OpenPose for pose estimation to extract detailed body posture and\nposture features from images and videos. These features serve as input to\nstate-of-the-art neural network architectures, including ResNet, and ANN for\nemotion classification, and fully connected layers for valence arousal\nregression analysis. This bifurcation strategy can solve classification and\nregression problems in the field of emotion recognition.\n  The project aims to contribute to the field of affective computing by\nenhancing the ability of machines to interpret and respond to human emotions in\na more comprehensive and nuanced way. By integrating multimodal data and\ncutting-edge computational models, I aspire to develop a system that not only\nenriches human-computer interaction but also has potential applications in\nareas as diverse as mental health support, educational technology, and\nautonomous vehicle systems.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"XWu3s5qSnz38Zhb_3z26CY-R3-wfi5Ko77vued_MtGM","pdfSize":"529518","objectId":"0x62694eaffd26538b711e3dcae8216c4eb2411ecb3c7f35f1c579e31819b2f258","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
