{"id":"2407.15310","title":"Can all variations within the unified mask-based beamformer framework\n  achieve identical peak extraction performance?","authors":"Atsuo Hiroe, Katsutoshi Itoyama, Kazuhiro Nakadai","authorsParsed":[["Hiroe","Atsuo",""],["Itoyama","Katsutoshi",""],["Nakadai","Kazuhiro",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 00:37:40 GMT"}],"updateDate":"2024-07-23","timestamp":1721608660000,"abstract":"  This study investigates mask-based beamformers (BFs), which estimate filters\nfor target sound extraction (TSE) using time-frequency masks. Although multiple\nmask-based BFs have been proposed, no consensus has been established on the\nbest one for target-extracting performance. Previously, we found that maximum\nsignal-to-noise ratio and minimum mean square error (MSE) BFs can achieve the\nsame extraction performance as the theoretical upper-bound performance, with\neach BF containing a different optimal mask. However, these remarkable findings\nleft two issues unsolved: only two BFs were covered, excluding the minimum\nvariance distortionless response BF; and ideal scaling (IS) was employed to\nideally adjust the output scale, which is not applicable to realistic\nscenarios. To address these coverage and scaling issues, this study proposes a\nunified framework for mask-based BFs comprising two processes: filter\nestimation that can cover all BFs and scaling applicable to realistic scenarios\nby employing a mask to generate a scaling reference. We also propose a\nmethodology to enumerate all possible BFs and derive 12 variations. Optimal\nmasks for both processes are obtained by minimizing the MSE between the target\nand BF output. The experimental results using the CHiME-4 dataset suggested\nthat 1) all 12 variations can achieve the theoretical upper-bound performance,\nand 2) mask-based scaling can behave as IS. These results can be explained by\nconsidering the practical parameter count of the masks. These findings\ncontribute to 1) designing a TSE system, 2) estimating the extraction\nperformance of a BF, and 3) improving scaling accuracy combined with mask-based\nscaling. The contributions also apply to TSE methods based on independent\ncomponent analysis, as the unified framework covers them too.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Sound","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"rCXJMsh_EusAyWYNncufVL_Wy1j_0Q2D5cxUpkLvrCw","pdfSize":"8954514","objectId":"0xa3ae5cac132dd80ae8f5f1daef596e16f1295dea59e0b7982125fe427b758fca","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
