{"id":"2407.02391","title":"A neural networks method to search for long transient gravitational\n  waves","authors":"Francesca Attadio, Leonardo Ricca, Marco Serra, Cristiano Palomba, Pia\n  Astone, Simone Dall'Osso, Stefano Dal Pra, Sabrina D'Antonio, Matteo Di\n  Giovanni, Luca D'Onofrio, Paola Leaci, Federico Muciaccia, Lorenzo Pierini,\n  Francesco Safai Tehrani","authorsParsed":[["Attadio","Francesca",""],["Ricca","Leonardo",""],["Serra","Marco",""],["Palomba","Cristiano",""],["Astone","Pia",""],["Dall'Osso","Simone",""],["Pra","Stefano Dal",""],["D'Antonio","Sabrina",""],["Di Giovanni","Matteo",""],["D'Onofrio","Luca",""],["Leaci","Paola",""],["Muciaccia","Federico",""],["Pierini","Lorenzo",""],["Tehrani","Francesco Safai",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 16:05:26 GMT"},{"version":"v2","created":"Wed, 3 Jul 2024 13:25:48 GMT"}],"updateDate":"2024-07-04","timestamp":1719936326000,"abstract":"  We present a new method to search for long transient gravitational waves\nsignals, like those expected from fast spinning newborn magnetars, in\ninterferometric detector data. Standard search techniques are computationally\nunfeasible (matched filtering) or very demanding (sub-optimal semi-coherent\nmethods). We explored a different approach by means of machine learning\nparadigms, to define a fast and inexpensive procedure. We used convolutional\nneural networks to develop a classifier that is able to discriminate between\nthe presence or the absence of a signal. To complement the classification and\nenhance its effectiveness, we also developed a denoiser. We studied the\nperformance of both networks with simulated colored noise, according to the\ndesign noise curve of LIGO interferometers. We show that the combination of the\ntwo models is crucial to increase the chance of detection. Indeed, as we\ndecreased the signal initial amplitude (from $10^{-22}$ down to $10^{-23}$) the\nclassification task became more difficult. In particular, we could not\ncorrectly tag signals with an initial amplitude of $2 \\times 10^{-23}$ without\nusing the denoiser. By studying the performance of the combined networks, we\nfound a good compromise between the search false alarm rate (2$\\%$) and\nefficiency (90$\\%$) for a single interferometer. In addition, we demonstrated\nthat our method is robust with respect to changes in the power law describing\nthe time evolution of the signal frequency. Our results highlight the\ncomputationally low cost of this method to generate triggers for long transient\nsignals. The study carried out in this work lays the foundations for further\nimprovements, with the purpose of developing a pipeline able to perform\nsystematic searches of long transient signals.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"6IWbdZ7CWud4-KhLfdZNaoOz0beMFcXtT_8_wcD278E","pdfSize":"2433895","objectId":"0x0c2dfbb0c396e4f0327f8127034e24b0b7ed94e79079e833f492dab7269e2963","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
