{"id":"2407.08141","title":"A Framework of FAS-RIS Systems: Performance Analysis and Throughput\n  Optimization","authors":"Junteng Yao, Xiazhi Lai, Kangda Zhi, Tuo Wu, Ming Jin, Cunhua Pan,\n  Maged Elkashlan, Chau Yuen, Kai-Kit Wong","authorsParsed":[["Yao","Junteng",""],["Lai","Xiazhi",""],["Zhi","Kangda",""],["Wu","Tuo",""],["Jin","Ming",""],["Pan","Cunhua",""],["Elkashlan","Maged",""],["Yuen","Chau",""],["Wong","Kai-Kit",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 02:46:55 GMT"}],"updateDate":"2024-07-12","timestamp":1720666015000,"abstract":"  In this paper, we investigate reconfigurable intelligent surface\n(RIS)-assisted communication systems which involve a fixed-antenna base station\n(BS) and a mobile user (MU) that is equipped with fluid antenna system (FAS).\nSpecifically, the RIS is utilized to enable communication for the user whose\ndirect link from the base station is blocked by obstacles. We propose a\ncomprehensive framework that provides transmission design for both static\nscenarios with the knowledge of channel state information (CSI) and harsh\nenvironments where CSI is hard to acquire. It leads to two approaches: a\nCSI-based scheme where CSI is available, and a CSI-free scheme when CSI is\ninaccessible. Given the complex spatial correlations in FAS, we employ\nblock-diagonal matrix approximation and independent antenna equivalent models\nto simplify the derivation of outage probabilities in both cases. Based on the\nderived outage probabilities, we then optimize the throughput of the FAS-RIS\nsystem. For the CSI-based scheme, we first propose a gradient ascent-based\nalgorithm to obtain a near-optimal solution. Then, to address the possible high\ncomputational complexity in the gradient algorithm, we approximate the\nobjective function and confirm a unique optimal solution accessible through a\nbisection search method. For the CSI-free scheme, we apply the partial gradient\nascent algorithm, reducing complexity further than full gradient algorithms. We\nalso approximate the objective function and derive a locally optimal\nclosed-form solution to maximize throughput. Simulation results validate the\neffectiveness of the proposed framework for the transmission design in FAS-RIS\nsystems.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"4wuTJX5zUbVBGOaR4B9tGO-gHjsTfZErsm6RhrgMXp0","pdfSize":"525635"}