{"id":"2407.12122","title":"Observable and ionizing properties of star-forming galaxies with very\n  massive stars and different IMFs","authors":"D. Schaerer, J. Guibert, R. Marques-Chaves, F. Martins","authorsParsed":[["Schaerer","D.",""],["Guibert","J.",""],["Marques-Chaves","R.",""],["Martins","F.",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 19:18:50 GMT"}],"updateDate":"2024-07-18","timestamp":1721157530000,"abstract":"  The presence of very massive stars (VMS, masses $>100$ M$_{\\odot}$) is now\nfirmly established in the local group, nearby galaxies, and out to cosmological\ndistances. If present, these stars could boost the UV luminosity and ionizing\nphoton production of galaxies, helping thus to alleviate the overabundance of\nUV-bright galaxies found with the JWST at high-redshift. Combing consistent\nstellar evolution and atmosphere models tailored to VMS we compute spectral\nenergy distributions (SEDs) for a large set of models. We find that VMS\ncontribute significantly to the UV luminosity and Lyman continuum of young\nstellar populations, and they are characterized by strong stellar HeII1640\nemission, with EW(HeII) up to 4-8 Ang at young ages or $\\sim 2.5-4$ Ang for\nconstant SFR. For IMFs with a Salpeter slope, the boost of the UV luminosity is\nrelatively modest. However, small changes in the IMF slope (e.g.~from\n$\\alpha_2=-2.35$ to $-2$) lead to large increases in $L_{UV}$ and the ionizing\nphoton production $Q$. Emission line strengths and the ionizing photon\nefficiency $\\xi_{\\rm ion}$ are also increased with VMS. Interestingly, SEDs\nincluding VMS show smaller Lyman breaks, and the shape of the ionizing spectra\nremain unaltered up to $\\sim 35$ eV, but becomes softer at higher energies. We\nderive and discuss the maximum values quantities such as $L_{UV}$ per stellar\nmass or unit SFR, and $\\xi_{\\rm ion}$, $Q$ can reach when VMS are included, and\nwe show that these values become essentially independent of the IMF. We propose\nobservational methods to test for VMS and constrain the IMF. Finally, using\nJWST observations, we examine if high-redshift galaxies show some evidence of\nthe presence of VMS and signs of non-standard IMFs. Very top-heavy IMFs can be\nexcluded on average, but the IMF could well extend into the regime of VMS and\nbe flatter than Salpeter in the bulk of high-$z$ galaxies. (abridged)\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"SHyQ4i7n1FW1QQ25--C9Ba48bwcgWT4Ff1T6auG3rUc","pdfSize":"780026"}