{"id":"2407.09720","title":"Characterization of the forcing and sub-filter scale terms in the\n  volume-filtering immersed boundary method","authors":"Dave Himanshu and Herrmann Marcus and Brady Peter and M. Houssem\n  Kasbaoui","authorsParsed":[["Himanshu","Dave",""],["Marcus","Herrmann",""],["Peter","Brady",""],["Kasbaoui","M. Houssem",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 23:27:52 GMT"}],"updateDate":"2024-07-16","timestamp":1720826872000,"abstract":"  We present a characterization of the forcing and the sub-filter scale terms\nproduced in the volume-filtering immersed boundary (VF-IB) method by Dave et\nal, JCP, 2023. The process of volume-filtering produces bodyforces in the form\nof surface integrals to describe the boundary conditions at the interface.\nFurthermore, the approach also produces unclosed subfilter scale (SFS) terms.\nThe level of contribution from SFS terms on the numerical solution depends on\nthe filter width. In order to understand these terms better, we take a 2\ndimensional, varying coefficient hyperbolic equation shown by Brady & Liverscu,\nJCP, 2021. This case is chosen for two reasons. First, the case involves 2\ndistinct regions seperated by an interface, making it an ideal case for the\nVF-IB method. Second, an existing analytical solution allows us to properly\ninvestigate the contribution from SFS term for varying filter sizes. The latter\ncontrols how well resolved the interface is. The smaller the filter size, the\nmore resolved the interface will be. A thorough numerical analysis of the\nmethod is presented, as well as the effect of the SFS term on the numerical\nsolution. In order to perform a direct comparison, the numerical solution is\ncompared to the filtered analytical solution. Through this, we highlight three\nimportant points. First, we present a methodical approach to volume filtering a\nhyperbolic PDE. Second, we show that the VF-IB method exhibits second order\nconvergence with respect to decreasing filter size (i.e. making the interface\nsharper). Finally, we show that the SFS term scales with square the filter\nsize. Large filter sizes require modeling the SFS term. However, for\nsufficiently finer filters, the SFS term can be ignored without any significant\nreduction in the accuracy of solution.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis","Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"EnksvgMbvMB8hF0y59oMU3PmdwYqY4ChkIEEBbMhs2s","pdfSize":"25267075"}