{"id":"2407.19588","title":"A pair of small Fermi surfaces, chiral charge-density-wave quantum\n  criticality, and BEC-type finite-momentum pairing instabilities in TiSe$_2$","authors":"Jin Mo Bok, B. J. Kim, Ki-Seok Kim","authorsParsed":[["Bok","Jin Mo",""],["Kim","B. J.",""],["Kim","Ki-Seok",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 21:13:46 GMT"}],"updateDate":"2024-07-30","timestamp":1722201226000,"abstract":"  SC near CDW quantum criticality in materials with small Fermi surfaces\nsuggests a novel mechanism of SC such as PDW SC and BEC beyond the conventional\nBCS mechanism of SC. Recent research by Kim $\\textit{et al}$.\n[arXiv:2312.11979] proposes how chiral CDW ordering arises in TiSe$_2$,\ncharacterized by a pair of small Fermi surfaces. Interaction-driven electronic\nquantum fluctuations described by a polarization bubble between the pair of\nsmall Fermi surfaces give rise to UV symmetry forbidden but dynamically\ngenerated linear electron-lattice couplings at IR, resulting in a chiral\nsymmetry breaking without chiral instability in either the charge or the\nlattice sector. This mechanism has been substantiated through Raman\nspectroscopy, inelastic x-ray scattering, group theory, and many-body\ncalculations in the random phase approximation. The emergence of SC in this\nmaterial, induced by pressure or doping, particularly, combined with the pair\nof small Fermi surfaces and the possible chiral CDW quantum criticality,\nindicates that conventional interpretations on thermodynamics and magnetic\nresponses based on the BCS theory may not be sufficient. In this study, we\npropose that BEC-type SC appears, driven by chiral CDW quantum critical\nfluctuations, which provides a robust explanatory framework for this\nphenomenon. As an inevitable consequence, we demonstrate that electrons in the\n$p$ and $d$ orbitals form interorbital Cooper pairs with finite center-of-mass\nmomentum, reminiscent of FFLO or PDW state. Employing a group theoretical and\ntight-binding approach to the interorbital pairing, we find that the\npossibility of unconventional pairing symmetries is restricted, except for the\norbital-selective $s$-wave pairing symmetry. These findings suggest that a\ndistinct superconducting mechanism, behaving conventionally, may operate in\nmaterials exhibiting exotic CDW with small Fermi surfaces.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Superconductivity"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"jazd4RIyneDRqiLsp_iSIOw17TutfmNM_TGNAxU9_j0","pdfSize":"2484688"}