{"id":"2407.00832","title":"Boxer: FaaSt Ephemeral Elasticity for Off-the-Shelf Cloud Applications","authors":"Michael Wawrzoniak, Rodrigo Bruno, Ana Klimovic, Gustavo Alonso","authorsParsed":[["Wawrzoniak","Michael",""],["Bruno","Rodrigo",""],["Klimovic","Ana",""],["Alonso","Gustavo",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 21:03:43 GMT"}],"updateDate":"2024-07-02","timestamp":1719781423000,"abstract":"  Elasticity is a key property of cloud computing. However, elasticity is\noffered today at the granularity of virtual machines, which take tens of\nseconds to start. This is insufficient to react to load spikes and sudden\nfailures in latency sensitive applications, leading users to resort to\nexpensive overprovisioning. Function-as-a-Service (FaaS) provides significantly\nhigher elasticity than VMs, but comes coupled with an event-triggered\nprogramming model and a constrained execution environment that makes them\nunsuitable for off-the-shelf applications. Previous work tries to overcome\nthese obstacles but often requires re-architecting the applications. In this\npaper, we show how off-the-shelf applications can transparently benefit from\nephemeral elasticity with FaaS. We built Boxer, an interposition layer spanning\nVMs and AWS Lambda, that intercepts application execution and emulates the\nnetwork-of-hosts environment that applications expect when deployed in a\nconventional VM/container environment. The ephemeral elasticity of Boxer\nenables significant performance and cost savings for off-the-shelf applications\nwith, e.g., recovery times over 5x faster than EC2 instances and absorbing load\nspikes comparable to overprovisioned EC2 VM instances.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing","Computing Research Repository/Networking and Internet Architecture","Computing Research Repository/Operating Systems"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"tLi36Z9lMxATVUNBmS-CzqK_pxEMMfU1BlvAI99eyHo","pdfSize":"1167714","objectId":"0x4c31297ccd2c6cb15d6ab9565c8c55eb52dc81da5bcd81fdbdaa1e663be542d9","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
