{"id":"2407.12180","title":"A UAV-assisted Wireless Localization Challenge on AERPAW","authors":"Paul Kudyba, Jaya Sravani Mandapaka, Weijie Wang, Logan McCorkendale,\n  Zachary McCorkendale, Mathias Kidane, Haijian Sun, Eric Adams, Kamesh\n  Namuduri, Fraida Fund, Mihail Sichitiu, Ozgur Ozdemir","authorsParsed":[["Kudyba","Paul",""],["Mandapaka","Jaya Sravani",""],["Wang","Weijie",""],["McCorkendale","Logan",""],["McCorkendale","Zachary",""],["Kidane","Mathias",""],["Sun","Haijian",""],["Adams","Eric",""],["Namuduri","Kamesh",""],["Fund","Fraida",""],["Sichitiu","Mihail",""],["Ozdemir","Ozgur",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 21:18:19 GMT"}],"updateDate":"2024-07-18","timestamp":1721164699000,"abstract":"  As wireless researchers are tasked to enable wireless communication as\ninfrastructure in more dynamic aerial settings, there is a growing need for\nlarge-scale experimental platforms that provide realistic, reproducible, and\nreliable experimental validation. To bridge the research-to-implementation gap,\nthe Aerial Experimentation and Research Platform for Advanced Wireless (AERPAW)\noffers open-source tools, reference experiments, and hardware to facilitate and\nevaluate the development of wireless research in controlled digital twin\nenvironments and live testbed flights. The inaugural AERPAW Challenge, \"Find a\nRover,\" was issued to spark collaborative efforts and test the platform's\ncapabilities. The task involved localizing a narrowband wireless signal, with\nteams given ten minutes to find the \"rover\" within a twenty-acre area. By\nengaging in this exercise, researchers can validate the platform's value as a\ntool for innovation in wireless communications research within aerial robotics.\nThis paper recounts the methods and experiences of the top three teams in\nautomating and rapidly locating a wireless signal by automating and controlling\nan aerial drone in a realistic testbed scenario.\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"l9hpI6nk7Qaia3pevpQHEfStND8D8MfUHbpeP-p2mcs","pdfSize":"4753027"}