{"id":"2407.12065","title":"Data selection method for assessment of autonomous vehicles","authors":"Linh Trinh, Ali Anwar, Siegfried Mercelis","authorsParsed":[["Trinh","Linh",""],["Anwar","Ali",""],["Mercelis","Siegfried",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 05:35:38 GMT"}],"updateDate":"2024-07-18","timestamp":1721108138000,"abstract":"  As the popularity of autonomous vehicles has grown, many standards and\nregulators, such as ISO, NHTSA, and Euro NCAP, require safety validation to\nensure a sufficient level of safety before deploying them in the real world.\nManufacturers gather a large amount of public road data for this purpose.\nHowever, the majority of these validation activities are done manually by\nhumans. Furthermore, the data used to validate each driving feature may differ.\nAs a result, it is essential to have an efficient data selection method that\ncan be used flexibly and dynamically for verification and validation while also\naccelerating the validation process. In this paper, we present a data selection\nmethod that is practical, flexible, and efficient for assessment of autonomous\nvehicles. Our idea is to optimize the similarity between the metadata\ndistribution of the selected data and a predefined metadata distribution that\nis expected for validation. Our experiments on the large dataset BDD100K show\nthat our method can perform data selection tasks efficiently. These results\ndemonstrate that our methods are highly reliable and can be used to select\nappropriate data for the validation of various safety functions.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"EsHbsUF_7qcuTbOsWcEqCmIecDDgVGTsTMr3jvkTJ28","pdfSize":"7093189","objectId":"0xfbee3aebf8f3304413a3b44553ce7f1d8c7901340db3a63e1e8a5a31d8021b15","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
