{"id":"2407.01432","title":"$\\mathcal{PT}$-Symmetry induced Bi-Stability in Non-Hermitian Cavity\n  Magnomechanics","authors":"Chaoyi Lai, Shah Fahad, Kashif Ammar Yasir","authorsParsed":[["Lai","Chaoyi",""],["Fahad","Shah",""],["Yasir","Kashif Ammar",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 16:23:16 GMT"}],"updateDate":"2024-07-02","timestamp":1719850996000,"abstract":"  We study the steady-state non-Hermitian magnomechanical system driven by a\ntransverse magnetic field directly interacting with YIG sphere and excites\ncavity magnons and photons. To make the system non-Hermitian, we use a\ntraveling field directly interacting with magnons generating gain to the\nsystem. We start by illustrating PT-configuration of the system, which contains\ntwo PT broken region around exceptional point and PT protected region along the\naxis of exceptional point. Late, we discover that the numbers of cavity photons\nand magnons show bistable behavior depending upon the PT configuration, which\nbecomes more significant as the values of the magnon-photon coupling and\ntraveling field strength increases. We illustrate that steady-state photon only\nshows bistable behavior when the system in in lossy PT broken configuration,\nmeans strength of traveling field is less than the magnon-photon coupling.\nOtherwise, it will just contain a single stable state because of bistability\nsuppression with gain in the system, which is unlike with any other\ninvestigation in this direction. Further, a larger magnon-photon coupling\nincreases photon intensity and decreases magnon intensity, because of photon\nand magnon energy exchange, leading to enhanced photon bistablity and decreased\nmagnon bistability. However, in case of increasing strength of traveling field,\nboth photon as well as magnon bistability is appeared to be decreasing. We also\nstudy the steady-state effective potential of the system and illustrate the\noccurrence of bistability with nonlinear interactions between contour\ntrajectories, which similarly depends on the PT broken configuration of the\nsystem.\n","subjects":["Physics/Quantum Physics","Physics/Applied Physics","Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"z0Ms5T6MUSl4hw5gc60xUdL98JC-L1ngoSG1t17Az2M","pdfSize":"23349702"}