{"id":"2407.06451","title":"Analytical Aberration Theory for Plane-symmetric Optical Systems and its\n  Application in the Analysis of Distortion in Freeform Spectrometers","authors":"Yuxuan Liu","authorsParsed":[["Liu","Yuxuan",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 23:22:51 GMT"}],"updateDate":"2024-07-10","timestamp":1720480971000,"abstract":"  The recent history of optical design saw a progressive trend of also\ndesigning without rotational symmetry, especially spectrometers due to the use\nof reflective and diffractive elements in their designs. A freeform\nhyperspectral imager design in CubeSat format is presented in this work, which\nhas large deviation from rotational symmetry. Based on a generalization of\nparaxial optics and wavefront aberration expansion applicable to\nplane-symmetric systems, in this dissertation we derived the aberration\ncoefficients of aberration types in the third group for plane-symmetric systems\nthat include the second order effects of the light beam footprint on optical\nsurfaces. We also expanded the theory to include the contributions from\nfreeform surfaces and induced aberrations. For the application to\nplane-symmetric spectrometers, the aberration coefficients related to\ndistortion are of special interest. Comparisons between the distortion results\npredicted by the aberration coefficients and simulated from real raytracing\nshow good consistency in example systems of a Dyson spectrometer and freeform\nspectrometers that share the three-mirror double-pass structure, which is\nsimilar to the spectrometer component of the hyperspectral imager we designed.\nIn comparison to real raytracing, results of the theory applied to the\nspectrometer of the hyperspectral imager we designed show the limits of the\ntheory that is limited to the third group of aberrations, while in this design,\nhigh-order groups also significantly contribute. In all cases, the analytical\nformulae of the aberration coefficients contain the information on surface\ncontributions, induced aberrations, and the relation between the aberration\nbehavior and system parameters, which provide valuable insights in the analysis\nof plane-symmetric systems.\n","subjects":["Physics/Optics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"JzxP1rkv9TlZVFn0drTQVA1IC8LjPojmgDK4_UVyV6Q","pdfSize":"13409319"}
