{"id":"2407.02709","title":"Regimes of Near-Inertial Wave Dynamics","authors":"Scott Conn, J\\\"orn Callies, and Albion Lawrence","authorsParsed":[["Conn","Scott",""],["Callies","Jörn",""],["Lawrence","Albion",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 23:04:14 GMT"}],"updateDate":"2024-07-04","timestamp":1719961454000,"abstract":"  When atmospheric storms pass over the ocean, they resonantly force\nnear-inertial waves (NIWs); internal waves with a frequency close to the local\nCoriolis frequency $f$. It has long been recognised that the evolution of NIWs\nis modulated by the ocean's mesoscale eddy field. This can result in NIWs being\nconcentrated into anticyclones and provide an efficient pathway for their\npropagation to depth. Whether mesoscale eddies are effective at modulating the\nbehaviour of NIWs depends on the wave dispersiveness $\\varepsilon^2 =\nf\\lambda^2/\\Psi$, where $\\lambda$ is the deformation radius and $\\Psi$ is a\nscaling for the eddy streamfunction. If $\\varepsilon\\gg1$, NIWs are strongly\ndispersive, and the waves are only weakly affected by the eddies. We calculate\nthe perturbations away from a uniform wave field and the frequency shift away\nfrom $f$. If $\\varepsilon\\ll1$, NIWs are weakly dispersive, and the wave\nevolution is strongly modulated by the eddy field. In this weakly dispersive\nlimit, ray-tracing emerges as a valid description of the NIW evolution even if\nthe large-scale atmospheric forcing apparently violates the requisite\nassumption of a scale separation between the waves and the eddies. The\nlarge-scale forcing excites many wave modes, each of which varies on a short\nspatial scale and is amenable to asymptotic analysis analogous to the\nsemi-classical analysis of quantum systems. The strong modulation of weakly\ndispersive NIWs by eddies has the potential to modulate the energy input into\nNIWs from the wind, but under oceanic conditions, this effect should be small.\n","subjects":["Physics/Atmospheric and Oceanic Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"vnOiHMnREQ-WcVz6GYjtbWXPaAh8V4i-vpZVPap2--w","pdfSize":"8590092"}