{"id":"2407.00045","title":"Streamline Intelligent Crowd Monitoring with IoT Cloud Computing\n  Middleware","authors":"Alexandros Gazis, Eleftheria Katsiri","authorsParsed":[["Gazis","Alexandros",""],["Katsiri","Eleftheria",""]],"versions":[{"version":"v1","created":"Tue, 4 Jun 2024 14:48:22 GMT"}],"updateDate":"2024-07-02","timestamp":1717512502000,"abstract":"  This article introduces a novel middleware that utilizes cost-effective,\nlow-power computing devices like Raspberry Pi to analyze data from wireless\nsensor networks (WSNs). It is designed for indoor settings like historical\nbuildings and museums, tracking visitors and identifying points of interest. It\nserves as an evacuation aid by monitoring occupancy and gauging the popularity\nof specific areas, subjects, or art exhibitions. The middleware employs a basic\nform of the MapReduce algorithm to gather WSN data and distribute it across\navailable computer nodes. Data collected by RFID sensors on visitor badges is\nstored on mini-computers placed in exhibition rooms and then transmitted to a\nremote database after a preset time frame. Utilizing MapReduce for data\nanalysis and a leader election algorithm for fault tolerance, this middleware\nshowcases its viability through metrics, demonstrating applications like swift\nprototyping and accurate validation of findings. Despite using simpler\nhardware, its performance matches resource-intensive methods involving\naudiovisual and AI techniques. This design's innovation lies in its\nfault-tolerant, distributed setup using budget-friendly, low-power devices\nrather than resource-heavy hardware or methods. Successfully tested at a\nhistorical building in Greece (M. Hatzidakis' residence), it is tailored for\nindoor spaces. This paper compares its algorithmic application layer with other\nimplementations, highlighting its technical strengths and advantages.\nParticularly relevant in the wake of the COVID-19 pandemic and general\nmonitoring middleware for indoor locations, this middleware holds promise in\ntracking visitor counts and overall building occupancy.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"CZ-CzH8Qe0TUP6kbSnRUDPfZVWgzOmnaySjwpq1C-w8","pdfSize":"1899485"}