{"id":"2407.17244","title":"SOXS NIR: Optomechanical integration and alignment, optical performance\n  verification before full instrument assembly","authors":"M. Genoni, M. Aliverti, G. Pariani, L. Oggioni, F. Vitali, F.\n  D'Alessio, P. D'Avanzo, S. Campana, M. Munari, R. Zanmar Sanchez, A. Scaudo,\n  M. Landoni, D. Young, S. Scuderi, P. Schipani, M. Riva, R. Claudi, K.\n  Radhakrishnan, F. Battaini, A. Rubin, A. Baruffolo, G. Capasso, R. Cosentino,\n  O. Hershko, H. Kuncarayakti, G. Pignata, S. Ben-Ami, A. Brucalassi, J.\n  Achren, J.A. Araiza-Duran, I. Arcavi, L. Asquini, R. Bruch, E. Cappellaro, M.\n  Colapietro, M. Della Valle, M. De Pascale, R. Di Benedetto, S. D'Orsi, A.\n  Gal-Yam, M. Hernandez Diaz, J. Kotilainen, G. Li Causi, L. Marty, S. Mattila,\n  M. Rappaport, D. Ricci, B. Salasnich, S. Smartt, M. Stritzinger, H. Ventura","authorsParsed":[["Genoni","M.",""],["Aliverti","M.",""],["Pariani","G.",""],["Oggioni","L.",""],["Vitali","F.",""],["D'Alessio","F.",""],["D'Avanzo","P.",""],["Campana","S.",""],["Munari","M.",""],["Sanchez","R. Zanmar",""],["Scaudo","A.",""],["Landoni","M.",""],["Young","D.",""],["Scuderi","S.",""],["Schipani","P.",""],["Riva","M.",""],["Claudi","R.",""],["Radhakrishnan","K.",""],["Battaini","F.",""],["Rubin","A.",""],["Baruffolo","A.",""],["Capasso","G.",""],["Cosentino","R.",""],["Hershko","O.",""],["Kuncarayakti","H.",""],["Pignata","G.",""],["Ben-Ami","S.",""],["Brucalassi","A.",""],["Achren","J.",""],["Araiza-Duran","J. A.",""],["Arcavi","I.",""],["Asquini","L.",""],["Bruch","R.",""],["Cappellaro","E.",""],["Colapietro","M.",""],["Della Valle","M.",""],["De Pascale","M.",""],["Di Benedetto","R.",""],["D'Orsi","S.",""],["Gal-Yam","A.",""],["Diaz","M. Hernandez",""],["Kotilainen","J.",""],["Causi","G. Li",""],["Marty","L.",""],["Mattila","S.",""],["Rappaport","M.",""],["Ricci","D.",""],["Salasnich","B.",""],["Smartt","S.",""],["Stritzinger","M.",""],["Ventura","H.",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 13:02:40 GMT"}],"updateDate":"2024-07-25","timestamp":1721826160000,"abstract":"  This paper presents the opto-mechanical integration and alignment, functional\nand optical performance verification of the NIR arm of Son Of X-Shooter (SOXS)\ninstrument. SOXS will be a single object spectroscopic facility for the ESO-NTT\n3.6-m telescope, made by two arms high efficiency spectrographs, able to cover\nthe spectral range 350 2050 nm with a mean resolving power R~4500. In\nparticular the NIR arm is a cryogenic echelle cross-dispersed spectrograph\nspanning the 780-2050 nm range. We describe the integration and alignment\nmethod performed to assemble the different opto-mechanical elements and their\ninstallation on the NIR vacuum vessel, which mostly relies on mechanical\ncharacterization. The tests done to assess the image quality, linear dispersion\nand orders trace in laboratory conditions are summarized. The full optical\nperformance verification, namely echellogram format, image quality and\nresulting spectral resolving power in the whole NIR arm (optical path and\nscience detector) is detailed. Such verification is one of the most relevant\nprerequisites for the subsequent full instrument assembly and provisional\nacceptance in Europe milestone, foreseen in 2024.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"A-HqK8XJIBumSjFdDiIpiXSYk1O4MhkoaatdXrT0OxI","pdfSize":"10273394"}