{"id":"2407.10331","title":"3D Foundation Models Enable Simultaneous Geometry and Pose Estimation of\n  Grasped Objects","authors":"Weiming Zhi and Haozhan Tang and Tianyi Zhang and Matthew\n  Johnson-Roberson","authorsParsed":[["Zhi","Weiming",""],["Tang","Haozhan",""],["Zhang","Tianyi",""],["Johnson-Roberson","Matthew",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 21:02:55 GMT"}],"updateDate":"2024-07-16","timestamp":1720990975000,"abstract":"  Humans have the remarkable ability to use held objects as tools to interact\nwith their environment. For this to occur, humans internally estimate how hand\nmovements affect the object's movement. We wish to endow robots with this\ncapability. We contribute methodology to jointly estimate the geometry and pose\nof objects grasped by a robot, from RGB images captured by an external camera.\nNotably, our method transforms the estimated geometry into the robot's\ncoordinate frame, while not requiring the extrinsic parameters of the external\ncamera to be calibrated. Our approach leverages 3D foundation models, large\nmodels pre-trained on huge datasets for 3D vision tasks, to produce initial\nestimates of the in-hand object. These initial estimations do not have\nphysically correct scales and are in the camera's frame. Then, we formulate,\nand efficiently solve, a coordinate-alignment problem to recover accurate\nscales, along with a transformation of the objects to the coordinate frame of\nthe robot. Forward kinematics mappings can subsequently be defined from the\nmanipulator's joint angles to specified points on the object. These mappings\nenable the estimation of points on the held object at arbitrary configurations,\nenabling robot motion to be designed with respect to coordinates on the grasped\nobjects. We empirically evaluate our approach on a robot manipulator holding a\ndiverse set of real-world objects.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Machine Learning","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"nKpxWyeoFxcWtzowK9oCufEB9LLF99nO2JpReI-__m4","pdfSize":"48536957","objectId":"0x0a27f4d7a773e5a58f03933fb27abf4fc6e35bf6b9626d6c690f3d35756ba983","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
