{"id":"2407.14847","title":"Integrated BIM and Machine Learning System for Circularity Prediction of\n  Construction Demolition Waste","authors":"Abdullahi Saka, Ridwan Taiwo, Nurudeen Saka, Benjamin Oluleye, Jamiu\n  Dauda, and Lukman Akanbi","authorsParsed":[["Saka","Abdullahi",""],["Taiwo","Ridwan",""],["Saka","Nurudeen",""],["Oluleye","Benjamin",""],["Dauda","Jamiu",""],["Akanbi","Lukman",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 11:32:46 GMT"}],"updateDate":"2024-07-23","timestamp":1721475166000,"abstract":"  Effective management of construction and demolition waste (C&DW) is crucial\nfor sustainable development, as the industry accounts for 40% of the waste\ngenerated globally. The effectiveness of the C&DW management relies on the\nproper quantification of C&DW to be generated. Despite demolition activities\nhaving larger contributions to C&DW generation, extant studies have focused on\nconstruction waste. The few extant studies on demolition are often from the\nregional level perspective and provide no circularity insights. Thus, this\nstudy advances demolition quantification via Variable Modelling (VM) with\nMachine Learning (ML). The demolition dataset of 2280 projects were leveraged\nfor the ML modelling, with XGBoost model emerging as the best (based on the\nCopeland algorithm), achieving R2 of 0.9977 and a Mean Absolute Error of 5.0910\non the testing dataset. Through the integration of the ML model with Building\nInformation Modelling (BIM), the study developed a system for predicting\nquantities of recyclable and landfill materials from building demolitions. This\nprovides detailed insights into the circularity of demolition waste and\nfacilitates better planning and management. The SHapley Additive exPlanations\n(SHAP) method highlighted the implications of the features for demolition waste\ncircularity. The study contributes to empirical studies on pre-demolition\nauditing at the project level and provides practical tools for implementation.\nIts findings would benefit stakeholders in driving a circular economy in the\nindustry.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"dRnTz0P9I2NPUtjzvaEtIFb0VbAaO3kVueKxX1y7y6M","pdfSize":"1746203","objectId":"0xf8bc9ac12650484a22a2261ba833264e5df6ab3c16b5060d66b2fe4d1de66a34","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
