{"id":"2407.19144","title":"Collaborative Adaptation for Recovery from Unforeseen Malfunctions in\n  Discrete and Continuous MARL Domains","authors":"Yasin Findik, Hunter Hasenfus, Reza Azadeh","authorsParsed":[["Findik","Yasin",""],["Hasenfus","Hunter",""],["Azadeh","Reza",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 02:04:58 GMT"}],"updateDate":"2024-07-30","timestamp":1722045898000,"abstract":"  Cooperative multi-agent learning plays a crucial role for developing\neffective strategies to achieve individual or shared objectives in multi-agent\nteams. In real-world settings, agents may face unexpected failures, such as a\nrobot's leg malfunctioning or a teammate's battery running out. These\nmalfunctions decrease the team's ability to accomplish assigned task(s),\nespecially if they occur after the learning algorithms have already converged\nonto a collaborative strategy. Current leading approaches in Multi-Agent\nReinforcement Learning (MARL) often recover slowly -- if at all -- from such\nmalfunctions. To overcome this limitation, we present the Collaborative\nAdaptation (CA) framework, highlighting its unique capability to operate in\nboth continuous and discrete domains. Our framework enhances the adaptability\nof agents to unexpected failures by integrating inter-agent relationships into\ntheir learning processes, thereby accelerating the recovery from malfunctions.\nWe evaluated our framework's performance through experiments in both discrete\nand continuous environments. Empirical results reveal that in scenarios\ninvolving unforeseen malfunction, although state-of-the-art algorithms often\nconverge on sub-optimal solutions, the proposed CA framework mitigates and\nrecovers more effectively.\n","subjects":["Computing Research Repository/Multiagent Systems","Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"-iNq5znm4U6yZ6wuYADpOnTzclRiVs1dpZUpU5vXfCw","pdfSize":"1412495","objectId":"0xe3c621a1911a62733a1a6fbeb3c38e53c3c65b797dbe0969d4ac25023ed8b9fc","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
