{"id":"2407.20284","title":"MLtoGAI: Semantic Web based with Machine Learning for Enhanced Disease\n  Prediction and Personalized Recommendations using Generative AI","authors":"Shyam Dongre, Ritesh Chandra, Sonali Agarwal","authorsParsed":[["Dongre","Shyam",""],["Chandra","Ritesh",""],["Agarwal","Sonali",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 06:32:06 GMT"}],"updateDate":"2024-07-31","timestamp":1721975526000,"abstract":"  In modern healthcare, addressing the complexities of accurate disease\nprediction and personalized recommendations is both crucial and challenging.\nThis research introduces MLtoGAI, which integrates Semantic Web technology with\nMachine Learning (ML) to enhance disease prediction and offer user-friendly\nexplanations through ChatGPT. The system comprises three key components: a\nreusable disease ontology that incorporates detailed knowledge about various\ndiseases, a diagnostic classification model that uses patient symptoms to\ndetect specific diseases accurately, and the integration of Semantic Web Rule\nLanguage (SWRL) with ontology and ChatGPT to generate clear, personalized\nhealth advice. This approach significantly improves prediction accuracy and\nensures results that are easy to understand, addressing the complexity of\ndiseases and diverse symptoms. The MLtoGAI system demonstrates substantial\nadvancements in accuracy and user satisfaction, contributing to developing more\nintelligent and accessible healthcare solutions. This innovative approach\ncombines the strengths of ML algorithms with the ability to provide\ntransparent, human-understandable explanations through ChatGPT, achieving\nsignificant improvements in prediction accuracy and user comprehension. By\nleveraging semantic technology and explainable AI, the system enhances the\naccuracy of disease prediction and ensures that the recommendations are\nrelevant and easily understood by individual patients. Our research highlights\nthe potential of integrating advanced technologies to overcome existing\nchallenges in medical diagnostics, paving the way for future developments in\nintelligent healthcare systems. Additionally, the system is validated using 200\nsynthetic patient data records, ensuring robust performance and reliability.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"j5X0XtUgIkcaFD7eg1feJSPnLfvu-FvDuZPrxxB6atI","pdfSize":"2363576"}