{"id":"2407.04625","title":"On the nature of ensembles from gravitational path integrals","authors":"Donald Marolf","authorsParsed":[["Marolf","Donald",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 16:33:59 GMT"}],"updateDate":"2024-07-08","timestamp":1720197239000,"abstract":"  Spacetime wormholes in gravitational path integrals have long been\ninterpreted in terms of ensembles of theories. Here we probe what sort of\ntheories such ensembles might contain. Careful consideration of a simple $d=2$\ntopological model indicates that the Hilbert space structure of a general\nensemble element fails to factorize over disconnected Cauchy-surface\nboundaries, and in particular that its Hilbert space ${\\cal\nH}_{N_{CS\\partial}}$ for $N_{CS\\partial}$ Cauchy-surface boundaries fails to be\npositive definite when the number $N_{CS\\partial}$ of disconnected such\nboundaries is large. This suggests a generalization of the AdS/CFT\ncorrespondence in which a bulk theory is dual to an ensemble of theories that\ndeviate from standard CFTs by violating both locality and positivity (at least\nunder certain circumstances). Since violations of positivity are undesirable,\nwe propose that positivity-violating elements of the ensemble be removed when\nstudying physics in asymptotically AdS spacetimes (or in other contexts in\nwhich Cauchy surfaces have asymptotic boundaries), perhaps reducing the\nensemble to a single standard CFT. Nevertheless, properties of any remaining\nCFTs that are uncorrelated with positivity of ${\\cal H}_{N_{CS\\partial}}$ at\nlarge $N_{CS\\partial}$will agree with those of typical elements of the full\nensemble and may be computed using the ensemble average.\n  On the other hand, elements that violate positivity at large $N_{CS\\partial}$\ncan still have a positive-definite cosmological sector with $N_{CS\\partial}=0$.\nSuch elements then define a basis for a Hilbert space describing such\ncosmologies. In contrast to the cases in which Cauchy-surfaces are allowed to\nhave boundaries, we argue that the resulting Hilbert space need not decohere\ninto single-state theories. As a result, familiar physics might be more easily\nrecovered from this new scenario.\n","subjects":["Physics/High Energy Physics - Theory","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"L1QcYeB-N7hPep0Hd-KTP5TGQyLwrzyZTxn-3nmL_OQ","pdfSize":"713375"}