{"id":"2407.11139","title":"Globular cluster orbital decay in dwarf galaxies with MOND and CDM:\n  Impact of supernova feedback","authors":"M. B\\'ilek, F. Combes, S. T. Nagesh, M. Hilker","authorsParsed":[["Bílek","M.",""],["Combes","F.",""],["Nagesh","S. T.",""],["Hilker","M.",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 18:04:34 GMT"}],"updateDate":"2024-07-17","timestamp":1721066674000,"abstract":"  Dynamical friction works very differently for Newtonian gravity with dark\nmatter and in modified Newtonian dynamics (MOND). While the absence of dark\nmatter considerably reduces the friction in major galaxy mergers, analytic\ncalculations indicate the opposite for very small perturbations, such as\nglobular clusters (GCs) sinking in dwarf galaxies. Here, we study the decay of\nGCs in isolated gas-rich dwarf galaxies using simulations with the Phantom of\nRamses code, which enables both the Newtonian and the QUMOND MOND gravity. We\nmodeled the GCs as point masses, and we simulated the full hydrodynamics, with\nstar formation and supernovae feedback. We explored whether the fluctuations in\ngravitational potential caused by the supernovae can prevent GCs from sinking\ntoward the nucleus. For GCs of typical mass or lighter, we find that this\nindeed works in both Newtonian and MOND simulations. The GC can even make a\nrandom walk. However, we find that supernovae cannot prevent massive GCs\n($M\\geq 4\\times10^5\\,M_\\odot$) from sinking in MOND. The resulting object looks\nsimilar to a galaxy with an offset core, which embeds the sunk GC. The problem\nis much milder in the Newtonian simulations. This result thus favors Newtonian\nover QUMOND gravity, but we note that it relies on the correctness of the\ndifficult modeling of baryonic feedback. We propose that the fluctuations in\nthe gravitational potential could be responsible for the thickness of the\nstellar disks of dwarf galaxies and that strong supernova winds in modified\ngravity can transform dwarf galaxies into ultra-diffuse galaxies.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"D4ITsx6v30m5uHrkmUS2uND2TakQIRGaHVFeiiUmnec","pdfSize":"1138822"}