{"id":"2407.07052","title":"Latent Space Imaging","authors":"Matheus Souza, Yidan Zheng, Kaizhang Kang, Yogeshwar Nath Mishra,\n  Qiang Fu, Wolfgang Heidrich","authorsParsed":[["Souza","Matheus",""],["Zheng","Yidan",""],["Kang","Kaizhang",""],["Mishra","Yogeshwar Nath",""],["Fu","Qiang",""],["Heidrich","Wolfgang",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 17:17:03 GMT"}],"updateDate":"2024-07-10","timestamp":1720545423000,"abstract":"  Digital imaging systems have classically been based on brute-force measuring\nand processing of pixels organized on regular grids. The human visual system,\non the other hand, performs a massive data reduction from the number of\nphoto-receptors to the optic nerve, essentially encoding the image information\ninto a low bandwidth latent space representation suitable for processing by the\nhuman brain. In this work, we propose to follow a similar approach for the\ndevelopment of artificial vision systems. Latent Space Imaging is a new\nparadigm that, through a combination of optics and software, directly encodes\nthe image information into the semantically rich latent space of a generative\nmodel, thus substantially reducing bandwidth and memory requirements during the\ncapture process. We demonstrate this new principle through an initial hardware\nprototype based on the single pixel camera. By designing an amplitude\nmodulation scheme that encodes into the latent space of a generative model, we\nachieve compression ratios from 1:100 to 1:1,000 during the imaging process,\nillustrating the potential of latent space imaging for highly efficient imaging\nhardware, to enable future applications in high speed imaging, or task-specific\ncameras with substantially reduced hardware complexity.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Xjm8vsSWA-EzZZ7vHSNrfXb-x-rSw_u6WJD6nYeWbIo","pdfSize":"8316612"}