{"id":"2407.18000","title":"Investigation to answer three key questions concerning plant pest\n  identification and development of a practical identification framework","authors":"Ryosuke Wayama, Yuki Sasaki, Satoshi Kagiwada, Nobusuke Iwasaki, and\n  Hitoshi Iyatomi","authorsParsed":[["Wayama","Ryosuke",""],["Sasaki","Yuki",""],["Kagiwada","Satoshi",""],["Iwasaki","Nobusuke",""],["Iyatomi","Hitoshi",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 12:49:24 GMT"}],"updateDate":"2024-07-26","timestamp":1721911764000,"abstract":"  The development of practical and robust automated diagnostic systems for\nidentifying plant pests is crucial for efficient agricultural production. In\nthis paper, we first investigate three key research questions (RQs) that have\nnot been addressed thus far in the field of image-based plant pest\nidentification. Based on the knowledge gained, we then develop an accurate,\nrobust, and fast plant pest identification framework using 334K images\ncomprising 78 combinations of four plant portions (the leaf front, leaf back,\nfruit, and flower of cucumber, tomato, strawberry, and eggplant) and 20 pest\nspecies captured at 27 farms. The results reveal the following. (1) For an\nappropriate evaluation of the model, the test data should not include images of\nthe field from which the training images were collected, or other\nconsiderations to increase the diversity of the test set should be taken into\naccount. (2) Pre-extraction of ROIs, such as leaves and fruits, helps to\nimprove identification accuracy. (3) Integration of closely related species\nusing the same control methods and cross-crop training methods for the same\npests, are effective. Our two-stage plant pest identification framework,\nenabling ROI detection and convolutional neural network (CNN)-based\nidentification, achieved a highly practical performance of 91.0% and 88.5% in\nmean accuracy and macro F1 score, respectively, for 12,223 instances of test\ndata of 21 classes collected from unseen fields, where 25 classes of images\nfrom 318,971 samples were used for training; the average identification time\nwas 476 ms/image.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"0lKi7Z4wkRH0_yaYgq4ax1NwQWIL4DBBEKHiNHGl7jE","pdfSize":"25888484"}