{"id":"2407.05088","title":"Leveraging Task-Specific Knowledge from LLM for Semi-Supervised 3D\n  Medical Image Segmentation","authors":"Suruchi Kumari, Aryan Das, Swalpa Kumar Roy, Indu Joshi, Pravendra\n  Singh","authorsParsed":[["Kumari","Suruchi",""],["Das","Aryan",""],["Roy","Swalpa Kumar",""],["Joshi","Indu",""],["Singh","Pravendra",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 14:23:16 GMT"}],"updateDate":"2024-07-09","timestamp":1720275796000,"abstract":"  Traditional supervised 3D medical image segmentation models need voxel-level\nannotations, which require huge human effort, time, and cost. Semi-supervised\nlearning (SSL) addresses this limitation of supervised learning by facilitating\nlearning with a limited annotated and larger amount of unannotated training\nsamples. However, state-of-the-art SSL models still struggle to fully exploit\nthe potential of learning from unannotated samples. To facilitate effective\nlearning from unannotated data, we introduce LLM-SegNet, which exploits a large\nlanguage model (LLM) to integrate task-specific knowledge into our co-training\nframework. This knowledge aids the model in comprehensively understanding the\nfeatures of the region of interest (ROI), ultimately leading to more efficient\nsegmentation. Additionally, to further reduce erroneous segmentation, we\npropose a Unified Segmentation loss function. This loss function reduces\nerroneous segmentation by not only prioritizing regions where the model is\nconfident in predicting between foreground or background pixels but also\neffectively addressing areas where the model lacks high confidence in\npredictions. Experiments on publicly available Left Atrium, Pancreas-CT, and\nBrats-19 datasets demonstrate the superior performance of LLM-SegNet compared\nto the state-of-the-art. Furthermore, we conducted several ablation studies to\ndemonstrate the effectiveness of various modules and loss functions leveraged\nby LLM-SegNet.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"zGst09O_BguvWz8u-5ZfkrjmX10azNBhKMrAa81LpoM","pdfSize":"1539697"}