{"id":"2407.03901","title":"DiCTI: Diffusion-based Clothing Designer via Text-guided Input","authors":"Ajda Lampe (2), Julija Stopar (1), Deepak Kumar Jain (4), Shinichiro\n  Omachi (3), Peter Peer (2), Vitomir \\v{S}truc (1) ((1) University of\n  Ljubljana, Faculty of Electrical Engineering, Ljubljana, Slovenia, (2)\n  University of Ljubljana, Faculty of Computer and Information Science,\n  Ljubljana, Slovenia, (3) Tohoku University, Graduate School of Engineering,\n  Sendai, Japan, (4) Dalian University of Technology, China)","authorsParsed":[["Lampe","Ajda",""],["Stopar","Julija",""],["Jain","Deepak Kumar",""],["Omachi","Shinichiro",""],["Peer","Peter",""],["Štruc","Vitomir",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 12:48:36 GMT"}],"updateDate":"2024-07-08","timestamp":1720097316000,"abstract":"  Recent developments in deep generative models have opened up a wide range of\nopportunities for image synthesis, leading to significant changes in various\ncreative fields, including the fashion industry. While numerous methods have\nbeen proposed to benefit buyers, particularly in virtual try-on applications,\nthere has been relatively less focus on facilitating fast prototyping for\ndesigners and customers seeking to order new designs. To address this gap, we\nintroduce DiCTI (Diffusion-based Clothing Designer via Text-guided Input), a\nstraightforward yet highly effective approach that allows designers to quickly\nvisualize fashion-related ideas using text inputs only. Given an image of a\nperson and a description of the desired garments as input, DiCTI automatically\ngenerates multiple high-resolution, photorealistic images that capture the\nexpressed semantics. By leveraging a powerful diffusion-based inpainting model\nconditioned on text inputs, DiCTI is able to synthesize convincing,\nhigh-quality images with varied clothing designs that viably follow the\nprovided text descriptions, while being able to process very diverse and\nchallenging inputs, captured in completely unconstrained settings. We evaluate\nDiCTI in comprehensive experiments on two different datasets (VITON-HD and\nFashionpedia) and in comparison to the state-of-the-art (SoTa). The results of\nour experiments show that DiCTI convincingly outperforms the SoTA competitor in\ngenerating higher quality images with more elaborate garments and superior text\nprompt adherence, both according to standard quantitative evaluation measures\nand human ratings, generated as part of a user study.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"aJPSJN2VOqbXX5RE9Iv_6pOAF9ocQjGBX2HBc9uU-78","pdfSize":"17415650"}
