{"id":"2407.10234","title":"Understanding the non-trivial isoscalar pseudoscalar structures in the\n  $K_S K_S\\pi^0$ spectra in the $J/\\psi$ radiative decay","authors":"Yin Cheng, Lin Qiu and Qiang Zhao","authorsParsed":[["Cheng","Yin",""],["Qiu","Lin",""],["Zhao","Qiang",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 15:03:40 GMT"}],"updateDate":"2024-07-16","timestamp":1720969420000,"abstract":"  Initiated by the recent observation of a flattened lineshape of\n$IJ^{PC}=00^{-+}$ around $1.4\\sim 1.5$ GeV in the $K_S K_S \\pi^0$ invariant\nmass spectrum by BESIII, we make a systematic partial wave analysis of $J/\\psi\n\\to\\gamma\\eta_X\\to \\gamma K\\bar{K}\\pi$ based on an isobaric approach. We\ndemonstrate that in the scenario of the first radial excitations of the\nisoscalar pseudoscalar from the $K\\bar{K}\\pi$ threshold to about 1.6 GeV the\nnon-trivial $K_S K_S \\pi^0$ invariant mass spectrum can be explained by the\ncoupled-channel effects with the presence of the triangle singularity\nmechanism. It shows that a combined fit of the three-body and two-body spectra\ncan be achieved which suggests that the one-state solution around $1.4\\sim 1.5$\nGeV proposed before still holds well. In particular, we show that the\ncoupled-channel effects between the two most important quasi-two-body decay\nchannels, $K^*\\bar{K}+c.c.$ and $a_0(980)\\pi$, can be well described by taking\ninto account the one-loop corrections in the isobaric approach. This is because\nthe isoscalar pseudoscalar states are coupled to the $K^*\\bar{K}+c.c.$ and\n$a_0(980)\\pi$ channels via the $P$ and $S$ waves, respectively. As a\nconsequence, the coupled-channel effects can be largely absorbed into the\nredefinition of the tree-level effective couplings with the transition\namplitudes computed to the order of one-loop corrections. Then, the\ncoupled-channel effects can be estimated by the contributions from the one-loop\nrescattering amplitudes in comparison with the tree-level ones, where we find\nthat the rescattering contributions from the $P$-wave into the $S$-wave, or\nvice verse, are apparently suppressed in the kinematic region near threshold.\n","subjects":["Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"lQbq5Wu6Q2gLye18enfQ294P_w6wQCnWvQAECsfz63w","pdfSize":"645321","objectId":"0x99e52ef4ff735bf4a47c35a2988f3a8bf1aec8d7646a5b13c76bba70d163f685","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
