{"id":"2407.19338","title":"Semantic Communication Enhanced by Knowledge Graph Representation\n  Learning","authors":"Nour Hello, Paolo Di Lorenzo, Emilio Calvanese Strinati","authorsParsed":[["Hello","Nour",""],["Di Lorenzo","Paolo",""],["Strinati","Emilio Calvanese",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 20:57:10 GMT"}],"updateDate":"2024-07-31","timestamp":1722113830000,"abstract":"  This paper investigates the advantages of representing and processing\nsemantic knowledge extracted into graphs within the emerging paradigm of\nsemantic communications. The proposed approach leverages semantic and pragmatic\naspects, incorporating recent advances on large language models (LLMs) to\nachieve compact representations of knowledge to be processed and exchanged\nbetween intelligent agents. This is accomplished by using the cascade of LLMs\nand graph neural networks (GNNs) as semantic encoders, where information to be\nshared is selected to be meaningful at the receiver. The embedding vectors\nproduced by the proposed semantic encoder represent information in the form of\ntriplets: nodes (semantic concepts entities), edges(relations between\nconcepts), nodes. Thus, semantic information is associated with the\nrepresentation of relationships among elements in the space of semantic concept\nabstractions. In this paper, we investigate the potential of achieving high\ncompression rates in communication by incorporating relations that link\nelements within graph embeddings. We propose sending semantic symbols solely\nequivalent to node embeddings through the wireless channel and inferring the\ncomplete knowledge graph at the receiver. Numerical simulations illustrate the\neffectiveness of leveraging knowledge graphs to semantically compress and\ntransmit information.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"blBWybsPxt4bZTYNTEEXU2MD34__96-gkhxEt4kEJPM","pdfSize":"392128"}