{"id":"2407.21146","title":"Low dimensional fragment-based descriptors for property predictions in\n  inorganic materials with machine learning","authors":"Md Mohaiminul Islam","authorsParsed":[["Islam","Md Mohaiminul",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 19:19:45 GMT"}],"updateDate":"2024-08-01","timestamp":1722367185000,"abstract":"  In recent times, the use of machine learning in materials design and\ndiscovery has aided to accelerate the discovery of innovative materials with\nextraordinary properties, which otherwise would have been driven by a laborious\nand time-consuming trial-and-error process. In this study, a simple yet\npowerful fragment-based descriptor, Low Dimensional Fragment Descriptors\n(LDFD), is proposed to work in conjunction with machine learning models to\npredict important properties of a wide range of inorganic materials such as\nperovskite oxides, metal halide perovskites, alloys, semiconductor, and other\nmaterials system and can also be extended to work with interfaces. To predict\nproperties, the generation of descriptors requires only the structural formula\nof the materials and, in presence of identical structure in the dataset,\nadditional system properties as input. And the generation of descriptors\ninvolves few steps, encoding the formula in binary space and reduction of\ndimensionality, allowing easy implementation and prediction. To evaluate\ndescriptor performance, six known datasets with up to eight components were\ncompared. The method was applied to properties such as band gaps of perovskites\nand semiconductors, lattice constant of magnetic alloys, bulk/shear modulus of\nsuperhard alloys, critical temperature of superconductors, formation enthalpy\nand energy above hull convex of perovskite oxides. An advanced python-based\ndata mining tool matminer was utilized for the collection of data. The\nprediction accuracies are equivalent to the quality of the training data and\nshow comparable effectiveness as previous studies. This method should be\nextendable to any inorganic material systems which can be subdivided into\nlayers or crystal structures with more than one atom site, and with the\nprogress of data mining the performance should get better with larger and\nunbiased datasets.\n","subjects":["Condensed Matter/Materials Science","Physics/Data Analysis, Statistics and Probability"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"qVlp8xpdIkuxpvRKfgo9H6wwyTnXpLUEepFbYUfhIL4","pdfSize":"1927711"}