{"id":"2407.10362","title":"LAB-Bench: Measuring Capabilities of Language Models for Biology\n  Research","authors":"Jon M. Laurent, Joseph D. Janizek, Michael Ruzo, Michaela M. Hinks,\n  Michael J. Hammerling, Siddharth Narayanan, Manvitha Ponnapati, Andrew D.\n  White, Samuel G. Rodriques","authorsParsed":[["Laurent","Jon M.",""],["Janizek","Joseph D.",""],["Ruzo","Michael",""],["Hinks","Michaela M.",""],["Hammerling","Michael J.",""],["Narayanan","Siddharth",""],["Ponnapati","Manvitha",""],["White","Andrew D.",""],["Rodriques","Samuel G.",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 23:52:25 GMT"},{"version":"v2","created":"Tue, 16 Jul 2024 15:54:55 GMT"},{"version":"v3","created":"Wed, 17 Jul 2024 17:28:36 GMT"}],"updateDate":"2024-07-18","timestamp":1721001145000,"abstract":"  There is widespread optimism that frontier Large Language Models (LLMs) and\nLLM-augmented systems have the potential to rapidly accelerate scientific\ndiscovery across disciplines. Today, many benchmarks exist to measure LLM\nknowledge and reasoning on textbook-style science questions, but few if any\nbenchmarks are designed to evaluate language model performance on practical\ntasks required for scientific research, such as literature search, protocol\nplanning, and data analysis. As a step toward building such benchmarks, we\nintroduce the Language Agent Biology Benchmark (LAB-Bench), a broad dataset of\nover 2,400 multiple choice questions for evaluating AI systems on a range of\npractical biology research capabilities, including recall and reasoning over\nliterature, interpretation of figures, access and navigation of databases, and\ncomprehension and manipulation of DNA and protein sequences. Importantly, in\ncontrast to previous scientific benchmarks, we expect that an AI system that\ncan achieve consistently high scores on the more difficult LAB-Bench tasks\nwould serve as a useful assistant for researchers in areas such as literature\nsearch and molecular cloning. As an initial assessment of the emergent\nscientific task capabilities of frontier language models, we measure\nperformance of several against our benchmark and report results compared to\nhuman expert biology researchers. We will continue to update and expand\nLAB-Bench over time, and expect it to serve as a useful tool in the development\nof automated research systems going forward. A public subset of LAB-Bench is\navailable for use at the following URL:\nhttps://huggingface.co/datasets/futurehouse/lab-bench\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"_j6o8B0niqevEuP9W7BBABxwg8UAt6OfVcy6h61Mb9E","pdfSize":"9890877"}