{"id":"2407.15438","title":"Integrated Mode-Hop-Free Tunable Lasers at 780 nm for Chip-Scale\n  Classical and Quantum Photonic Applications","authors":"Joshua E. Castro, Eber Nolasco-Martinez, Paolo Pintus, Zeyu Zhang,\n  Boqiang Shen, Theodore Morin, Lillian Thiel, Trevor J. Steiner, Nicholas\n  Lewis, Sahil D. Patel, John E. Bowers, David M. Weld, Galan Moody","authorsParsed":[["Castro","Joshua E.",""],["Nolasco-Martinez","Eber",""],["Pintus","Paolo",""],["Zhang","Zeyu",""],["Shen","Boqiang",""],["Morin","Theodore",""],["Thiel","Lillian",""],["Steiner","Trevor J.",""],["Lewis","Nicholas",""],["Patel","Sahil D.",""],["Bowers","John E.",""],["Weld","David M.",""],["Moody","Galan",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 07:33:34 GMT"}],"updateDate":"2024-07-23","timestamp":1721633614000,"abstract":"  In the last decade, remarkable advances in integrated photonic technologies\nhave enabled table-top experiments and instrumentation to be scaled down to\ncompact chips with significant reduction in size, weight, power consumption,\nand cost. Here, we demonstrate an integrated continuously tunable laser in a\nheterogeneous gallium arsenide-on-silicon nitride (GaAs-on-SiN) platform that\nemits in the far-red radiation spectrum near 780 nm, with 20 nm tuning range,\n<6 kHz intrinsic linewidth, and a >40 dB side-mode suppression ratio. The GaAs\noptical gain regions are heterogeneously integrated with low-loss SiN\nwaveguides. The narrow linewidth lasing is achieved with an extended cavity\nconsisting of a resonator-based Vernier mirror and a phase shifter. Utilizing\nsynchronous tuning of the integrated heaters, we show mode-hop-free wavelength\ntuning over a range larger than 100 GHz (200 pm). To demonstrate the potential\nof the device, we investigate two illustrative applications: (i) the linear\ncharacterization of a silicon nitride microresonator designed for\nentangled-photon pair generation, and (ii) the absorption spectroscopy and\nlocking to the D1 and D2 transition lines of 87-Rb. The performance of the\nproposed integrated laser holds promise for a broader spectrum of both\nclassical and quantum applications in the visible range, encompassing\ncommunication, control, sensing, and computing.\n","subjects":["Physics/Optics","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"e6lYhmR8UB0-932dO3hTncSryDnU7E55hT0f5hWigdM","pdfSize":"4854603"}