{"id":"2407.11996","title":"From Top-Right to User-Right: Perceptual Prioritization of Point-Feature\n  Label Positions","authors":"Petr Bob\\'ak, Ladislav \\v{C}mol\\'ik, Martin \\v{C}ad\\'ik","authorsParsed":[["Bobák","Petr",""],["Čmolík","Ladislav",""],["Čadík","Martin",""]],"versions":[{"version":"v1","created":"Wed, 12 Jun 2024 15:00:25 GMT"},{"version":"v2","created":"Thu, 29 Aug 2024 13:20:25 GMT"}],"updateDate":"2024-08-30","timestamp":1718204425000,"abstract":"  In cartography, Geographic Information Systems (GIS), and visualization, the\nposition of a label relative to its point feature is crucial for readability\nand user experience. Alongside other factors, the point-feature label placement\n(PFLP) is typically governed by the Position Priority Order (PPO), a systematic\nraking of potential label positions around a point feature according to\npredetermined priorities. While there is a broad consensus on factors such as\navoiding label conflicts and ensuring clear label-to-feature associations,\nthere is no agreement on PPO. Most PFLP techniques rely on traditional PPOs\ngrounded in typographic and cartographic conventions established decades ago,\nwhich may no longer meet today's user expectations. In contrast, commercial\nproducts like Google Maps and Mapbox use non-traditional PPOs for unreported\nreasons. Our extensive user study introduces the Perceptual Position Priority\nOrder (PerceptPPO), a user-validated PPO that significantly departs from\ntraditional conventions. A key finding is that labels placed above point\nfeatures are significantly preferred by users, contrary to the conventional\ntop-right position. We also conducted a supplementary study on the preferred\nlabel density, an area scarcely explored in prior research. Finally, we\nperformed a comparative user study assessing the perceived quality of\nPerceptPPO over existing PPOs, advocating its adoption in cartographic and GIS\napplications, as well as in other types of visualizations. Our research,\nsupported by nearly 800 participants from 48 countries and over 45,500 pairwise\ncomparisons, offers practical guidance for designers and application developers\naiming to optimize user engagement and comprehension, paving the way for more\nintuitive and accessible visualizations.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Graphics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"NWLr_7XzErLU8fH5J1IATbmDDwIk_RJoPY7TA0T51EQ","pdfSize":"45877190"}