{"id":"2407.21235","title":"The OATMEAL Survey. I. Low Stellar Obliquity in the Transiting Brown\n  Dwarf System GPX-1","authors":"Steven Giacalone, Fei Dai, J. J. Zanazzi, Andrew W. Howard, Courtney\n  D. Dressing, Joshua N. Winn, Ryan A. Rubenzahl, Theron W. Carmichael, Noah\n  Vowell, Aurora Kesseli, Samuel Halverson, Howard Isaacson, Max Brodheim,\n  William Deich, Benjamin J. Fulton, Steven R. Gibson, Grant M. Hill, Bradford\n  Holden, Aaron Householder, Stephen Kaye, Russ R. Laher, Kyle Lanclos, Joel\n  Payne, Erik A. Petigura, Arpita Roy, Christian Schwab, Abby P. Shaum, Martin\n  M. Sirk, Chris Smith, Gu{\\dh}mundur Stef\\'ansson, Josh Walawender, Sharon X.\n  Wang, Lauren M. Weiss, Sherry Yeh","authorsParsed":[["Giacalone","Steven",""],["Dai","Fei",""],["Zanazzi","J. J.",""],["Howard","Andrew W.",""],["Dressing","Courtney D.",""],["Winn","Joshua N.",""],["Rubenzahl","Ryan A.",""],["Carmichael","Theron W.",""],["Vowell","Noah",""],["Kesseli","Aurora",""],["Halverson","Samuel",""],["Isaacson","Howard",""],["Brodheim","Max",""],["Deich","William",""],["Fulton","Benjamin J.",""],["Gibson","Steven R.",""],["Hill","Grant M.",""],["Holden","Bradford",""],["Householder","Aaron",""],["Kaye","Stephen",""],["Laher","Russ R.",""],["Lanclos","Kyle",""],["Payne","Joel",""],["Petigura","Erik A.",""],["Roy","Arpita",""],["Schwab","Christian",""],["Shaum","Abby P.",""],["Sirk","Martin M.",""],["Smith","Chris",""],["Stefánsson","Guðmundur",""],["Walawender","Josh",""],["Wang","Sharon X.",""],["Weiss","Lauren M.",""],["Yeh","Sherry",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 22:44:45 GMT"}],"updateDate":"2024-08-01","timestamp":1722379485000,"abstract":"  We introduce the OATMEAL survey, an effort to measure the obliquities of\nstars with transiting brown dwarf companions. We observed a transit of the\nclose-in ($P_{\\rm orb} = 1.74 \\,$ days) brown dwarf GPX-1 b using the Keck\nPlanet Finder (KPF) spectrograph to measure the sky-projected angle between its\norbital axis and the spin axis of its early F-type host star ($\\lambda$). We\nmeasured $\\lambda = 6.88 \\pm 1.72 ^\\circ$ (with additional unquantified\nsystematic uncertainty), suggesting an orbit that is prograde and well aligned\nwith the stellar equator. Hot Jupiters around early F stars are frequently\nfound to have highly misaligned orbits, with polar and retrograde orbits being\ncommonplace. It has been theorized that these misalignments stem from dynamical\ninteractions, such as von Zeipel-Kozai-Lidov cycles, and are retained over long\ntimescales due to weak tidal dissipation in stars with radiative envelopes. By\ncomparing GPX-1 to similar systems under the frameworks of different tidal\nevolution theories, we argued that the rate of tidal dissipation is too slow to\nhave re-aligned the system. This suggests that GPX-1 may have arrived at its\nclose-in orbit via coplanar high-eccentricity migration or migration through an\naligned protoplanetary disk. Our result for GPX-1 is the fifth measurement of\nthe obliquity of a star with a transiting brown dwarf. By enlarging the number\nof such measurements and comparing them with hot Jupiter systems, we will more\nclearly discern the differences between the mechanisms that dictate the\nformation and evolution of both classes of objects.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"BEFljCJC0o84fx0w16_tt9gBANrdOWkK5rOe0wesqrQ","pdfSize":"648799"}