{"id":"2407.03428","title":"NEBULA: Neural Empirical Bayes Under Latent Representations for\n  Efficient and Controllable Design of Molecular Libraries","authors":"Ewa M. Nowara, Pedro O. Pinheiro, Sai Pooja Mahajan, Omar Mahmood,\n  Andrew Martin Watkins, Saeed Saremi, Michael Maser","authorsParsed":[["Nowara","Ewa M.",""],["Pinheiro","Pedro O.",""],["Mahajan","Sai Pooja",""],["Mahmood","Omar",""],["Watkins","Andrew Martin",""],["Saremi","Saeed",""],["Maser","Michael",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 18:10:43 GMT"}],"updateDate":"2024-07-08","timestamp":1720030243000,"abstract":"  We present NEBULA, the first latent 3D generative model for scalable\ngeneration of large molecular libraries around a seed compound of interest.\nSuch libraries are crucial for scientific discovery, but it remains challenging\nto generate large numbers of high quality samples efficiently. 3D-voxel-based\nmethods have recently shown great promise for generating high quality samples\nde novo from random noise (Pinheiro et al., 2023). However, sampling in\n3D-voxel space is computationally expensive and use in library generation is\nprohibitively slow. Here, we instead perform neural empirical Bayes sampling\n(Saremi & Hyvarinen, 2019) in the learned latent space of a vector-quantized\nvariational autoencoder. NEBULA generates large molecular libraries nearly an\norder of magnitude faster than existing methods without sacrificing sample\nquality. Moreover, NEBULA generalizes better to unseen drug-like molecules, as\ndemonstrated on two public datasets and multiple recently released drugs. We\nexpect the approach herein to be highly enabling for machine learning-based\ndrug discovery. The code is available at\nhttps://github.com/prescient-design/nebula\n","subjects":["Computing Research Repository/Machine Learning","Quantitative Biology/Biomolecules"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"RZL1xi2eK7MGwOmFGbXQ-IX5tIaXpSXhQm-bHQ-fYn8","pdfSize":"7403873"}