{"id":"2407.10598","title":"X-ray diffraction reveals the consequences of strong deformation in thin\n  smectic films: dilation and chevron formation","authors":"Jean de Dieu Niyonzima, Haifa Jeridi, Lamya Essaoui, Caterina\n  Tosarelli, Alina Vlad, Alessandro Coati, Sebastien Royer, Isabelle Trimaille,\n  Michel Goldmann, Bruno Gallas, Doru Constantin, David Babonneau, Yves\n  Garreau, Bernard Croset, Samo Kralj, Randall D. Kamien, and Emmanuelle Lacaze","authorsParsed":[["Niyonzima","Jean de Dieu",""],["Jeridi","Haifa",""],["Essaoui","Lamya",""],["Tosarelli","Caterina",""],["Vlad","Alina",""],["Coati","Alessandro",""],["Royer","Sebastien",""],["Trimaille","Isabelle",""],["Goldmann","Michel",""],["Gallas","Bruno",""],["Constantin","Doru",""],["Babonneau","David",""],["Garreau","Yves",""],["Croset","Bernard",""],["Kralj","Samo",""],["Kamien","Randall D.",""],["Lacaze","Emmanuelle",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 10:21:13 GMT"}],"updateDate":"2024-07-16","timestamp":1721038873000,"abstract":"  Smectic liquid crystals can be viewed as model systems for lamellar\nstructures for which there has been extensive theoretical development. We\ndemonstrate that a nonlinear energy description is required with respect to the\nusual Landau-de Gennes elasticity in order to explain the observed layer\nspacing of highly curved smectic layers. Using X-ray diffraction we have\nquantitatively determined the dilation of bent layers distorted by antagonistic\nanchoring (as high as 1.8% of dilation for the most bent smectic layers) and\naccurately described it by the minimal nonlinear expression for energy. We\nobserve a 1{\\deg} tilt of planar layers that are connected to the curved\nlayers. This value is consistent with simple energetic calculations,\ndemonstrating how the bending energy impacts the overall structure of a thin\ndistorted smectic film. Finally, we show that combined X-ray measurements and\ntheoretical modeling allow for the quantitative determination of the number of\ncurved smectic layers and of the resulting thickness of the dilated region with\nunprecedented precision.\n","subjects":["Condensed Matter/Soft Condensed Matter","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"87Fig82uzcP4uJi17m4oGyx19doi3MjewJm1KkV89xI","pdfSize":"4969361"}