{"id":"2407.07026","title":"Resolving Sentiment Discrepancy for Multimodal Sentiment Detection via\n  Semantics Completion and Decomposition","authors":"Daiqing Wu, Dongbao Yang, Huawen Shen, Can Ma, Yu Zhou","authorsParsed":[["Wu","Daiqing",""],["Yang","Dongbao",""],["Shen","Huawen",""],["Ma","Can",""],["Zhou","Yu",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 16:46:58 GMT"}],"updateDate":"2024-07-10","timestamp":1720543618000,"abstract":"  With the proliferation of social media posts in recent years, the need to\ndetect sentiments in multimodal (image-text) content has grown rapidly. Since\nposts are user-generated, the image and text from the same post can express\ndifferent or even contradictory sentiments, leading to potential\n\\textbf{sentiment discrepancy}. However, existing works mainly adopt a\nsingle-branch fusion structure that primarily captures the consistent sentiment\nbetween image and text. The ignorance or implicit modeling of discrepant\nsentiment results in compromised unimodal encoding and limited performances. In\nthis paper, we propose a semantics Completion and Decomposition (CoDe) network\nto resolve the above issue. In the semantics completion module, we complement\nimage and text representations with the semantics of the OCR text embedded in\nthe image, helping bridge the sentiment gap. In the semantics decomposition\nmodule, we decompose image and text representations with exclusive projection\nand contrastive learning, thereby explicitly capturing the discrepant sentiment\nbetween modalities. Finally, we fuse image and text representations by\ncross-attention and combine them with the learned discrepant sentiment for\nfinal classification. Extensive experiments conducted on four multimodal\nsentiment datasets demonstrate the superiority of CoDe against SOTA methods.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Computation and Language","Computing Research Repository/Multimedia","Computing Research Repository/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"L1nnyK1cGcbmjL4TVenO7ukeonEhSMq277Tgzp-1OcU","pdfSize":"1740164"}