{"id":"2407.14312","title":"Flares from plasmoids and current sheets around Sgr A*","authors":"I. Dimitropoulos, A. Nathanail, M. Petropoulou, I. Contopoulos, C. M.\n  Fromm","authorsParsed":[["Dimitropoulos","I.",""],["Nathanail","A.",""],["Petropoulou","M.",""],["Contopoulos","I.",""],["Fromm","C. M.",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 13:45:42 GMT"},{"version":"v2","created":"Wed, 24 Jul 2024 13:22:49 GMT"},{"version":"v3","created":"Tue, 10 Sep 2024 09:14:32 GMT"}],"updateDate":"2024-09-11","timestamp":1721396742000,"abstract":"  The supermassive black hole Sgr A* at the center of our galaxy produces\nrepeating near-infrared flares that are observed by ground and space based\ninstruments. This activity has been simulated in the past with Magnetically\nArrested Disk (MAD) models which include stable jet formations. The present\nstudy uses a different approach in that it considers a Standard and Normal\nEvolution (SANE) multi-loop model that lacks a stable jet structure. The main\nobjective of this research is to identify regions that contain current sheets\nand high magnetic turbulence, and to subsequently generate a 2.2 micron light\ncurve generated from non-thermal particles. Additionally, we investigate the\nproperties of the flares, in particular, their evolution during flare events,\nand the similarity of flare characteristics between the generated and observed\nlight curves. 2D GRMHD simulation data from a SANE multi-loop model is\nemployed, and thermal radiation is introduced to generate a 230 GHz light\ncurve. Physical variables are calibrated to align with the 230 GHz\nobservations. Current sheets are identified by analyzing toroidal currents,\nmagnetization, plasma beta, density, and dimensionless temperatures. The\nevolution of current sheets during flare events is studied, and higher-energy\nnon-thermal light curves are calculated, focusing on the 2.2 micron\nnear-infrared range. We obtain promising 2.2 micron light curves whose flare\nduration and spectral index behavior align well with observations. Our findings\nsupport the association of flares with particle acceleration and nonthermal\nemission in current sheet plasmoid chains and in the boundary of the disk\ninside the funnel above and below the central black hole.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"zEPHbDMLd54y60MaI2Ev3BD5tT_LTEn6_bMS7XsEuWI","pdfSize":"4766777"}