{"id":"2407.02501","title":"Data-driven Power Flow Linearization: Theory","authors":"Mengshuo Jia, Gabriela Hug, Ning Zhang, Zhaojian Wang, Yi Wang,\n  Chongqing Kang","authorsParsed":[["Jia","Mengshuo",""],["Hug","Gabriela",""],["Zhang","Ning",""],["Wang","Zhaojian",""],["Wang","Yi",""],["Kang","Chongqing",""]],"versions":[{"version":"v1","created":"Mon, 10 Jun 2024 22:22:41 GMT"}],"updateDate":"2024-07-04","timestamp":1718058161000,"abstract":"  This two-part tutorial dives into the field of data-driven power flow\nlinearization (DPFL), a domain gaining increased attention. DPFL stands out for\nits higher approximation accuracy, wide adaptability, and better ability to\nimplicitly incorporate the latest system attributes. This renders DPFL a\npotentially superior option for managing the significant fluctuations from\nrenewable energy sources, a step towards realizing a more sustainable energy\nfuture, by translating the higher model accuracy into increased economic\nefficiency and less energy losses. To conduct a deep and rigorous\nreexamination, this tutorial first classifies existing DPFL methods into DPFL\ntraining algorithms and supportive techniques. Their mathematical models,\nanalytical solutions, capabilities, limitations, and generalizability are\nsystematically examined, discussed, and summarized. In addition, this tutorial\nreviews existing DPFL experiments, examining the settings of test systems, the\nfidelity of datasets, and the comparison made among a limited number of DPFL\nmethods. Further, this tutorial implements extensive numerical comparisons of\nall existing DPFL methods (40 methods in total) and four classic physics-driven\napproaches, focusing on their generalizability, applicability, accuracy, and\ncomputational efficiency. Through these simulationmethodss, this tutorial aims\nto reveal the actual performance of all the methods (including the performances\nexposed to data noise or outliers), guiding the selection of appropriate\nlinearization methods. Furthermore, this tutorial discusses future directions\nbased on the theoretical and numerical insights gained. As the first part, this\npaper reexamines DPFL theories, covering all the training algorithms and\nsupportive techniques. Capabilities, limitations, and aspects of\ngeneralizability, which were previously unmentioned in the literature, have\nbeen identified.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computational Engineering, Finance, and Science","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control","Statistics/Applications"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"Wrv0ylEhhQxap3-lU60WHt3AGx5Wi1PO_USHFViRLhU","pdfSize":"1675343"}