{"id":"2407.07101","title":"Mean-field derived IBM-1 Hamiltonian with intrinsic triaxial deformation","authors":"Polytimos Vasileiou (1), Dennis Bonatsos (2), Theo J. Mertzimekis (1)\n  ((1) Department of Physics, National & Kapodistrian University of Athens,\n  Zografou Campus, Greece, (2) Institute of Nuclear and Particle Physics,\n  National Center for Scientific Research \"Demokritos'', Aghia Paraskevi,\n  Greece)","authorsParsed":[["Vasileiou","Polytimos",""],["Bonatsos","Dennis",""],["Mertzimekis","Theo J.",""]],"versions":[{"version":"v1","created":"Sat, 22 Jun 2024 16:17:21 GMT"}],"updateDate":"2024-07-11","timestamp":1719073041000,"abstract":"  An interacting-boson-model-1 (IBM-1) Hamiltonian, derived from\nself-consistent mean-field calculations using a Skyrme energy density\nfunctional is employed for the study of energy spectra and $B(E2)$ transition\nstrengths in the even-even $^{162-184}\\mathrm{Hf}$ and $^{168-186}\\mathrm{W}$.\nAn intrinsic triaxial deformation, derived from fermionic proxy-SU(3) irreps,\nis incorporated into the IBM-1 potential energy curve, which is subsequently\nmapped to the fermionic one, in order to derive the parameters of the IBM-1\nHamiltonian. It is shown that the inclusion of the intrinsic triaxial\ndeformation derived from the proxy-SU(3) irreps leads to a significantly\nimproved agreement between the theoretical predictions and experimental data\nfor the low-lying quadrupole bands in the examined isotopes, without the need\nof higher-order terms in the IBM-1 Hamiltonian. The calculated $B(E2)$\ntransition strengths are also improved, compared to the axially symmetric case.\nThe recently suggested preponderance of triaxial deformation over extended\nregions of the nuclear chart is obtained as a by-product. Future potential\nimprovements and extensions to this mapping approach are also discussed.\n","subjects":["Physics/Nuclear Theory"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"yPpg_nfw4mH28ZXUolvVuAI5Mr69LH2eRcXLwTFgbLQ","pdfSize":"2536345"}