{"id":"2407.06746","title":"Maximum stress minimization via data-driven multifidelity topology\n  design","authors":"Misato Kato, Taisei Kii, Kentaro Yaji, Kikuo Fujita","authorsParsed":[["Kato","Misato",""],["Kii","Taisei",""],["Yaji","Kentaro",""],["Fujita","Kikuo",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 10:50:08 GMT"}],"updateDate":"2024-07-10","timestamp":1720522208000,"abstract":"  The maximum stress minimization problem is among the most important topics\nfor structural design. The conventional gradient-based topology optimization\nmethods require transforming the original problem into a pseudo-problem by\nrelaxation techniques. Since their parameters significantly influence\noptimization, accurately solving the maximum stress minimization problem\nwithout using relaxation techniques is expected to achieve extreme performance.\nThis paper focuses on this challenge and investigates whether designs with more\navoided stress concentrations can be obtained by solving the original maximum\nstress minimization problem without relaxation techniques, compared to the\nsolutions obtained by gradient-based topology optimization. We employ\ndata-driven multifidelity topology design (MFTD), a gradient-free topology\noptimization based on evolutionary algorithms. The basic framework involves\ngenerating candidate solutions by solving a low-fidelity optimization problem,\nevaluating these solutions through high-fidelity forward analysis, and\niteratively updating them using a deep generative model without sensitivity\nanalysis. In this study, data-driven MFTD incorporates the optimized designs\nobtained by solving a gradient-based topology optimization problem with the\np-norm stress measure in the initial solutions and solves the original maximum\nstress minimization problem based on a high-fidelity analysis with a\nbody-fitted mesh. We demonstrate the effectiveness of our proposed approach\nthrough the benchmark of L-bracket. As a result of solving the original maximum\nstress minimization problem with data-driven MFTD, a volume reduction of up to\n22.6% was achieved under the same maximum stress value, compared to the initial\nsolution.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"oI-NaOWYyOxz5Af7Lp2yowqLHR3qO67IB9Lcq8WGHPc","pdfSize":"6243158"}