{"id":"2407.06607","title":"UAV Formation and Resource Allocation Optimization for\n  Communication-Assisted 3D InSAR Sensing","authors":"Mohamed-Amine Lahmeri, V\\'ictor Mustieles-P\\'erez, Martin Vossiek,\n  Gerhard Krieger, and Robert Schober","authorsParsed":[["Lahmeri","Mohamed-Amine",""],["Mustieles-Pérez","Víctor",""],["Vossiek","Martin",""],["Krieger","Gerhard",""],["Schober","Robert",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 07:22:13 GMT"}],"updateDate":"2024-07-10","timestamp":1720509733000,"abstract":"  In this paper, we investigate joint unmanned aerial vehicle (UAV) formation\nand resource allocation optimization for communication-assisted\nthree-dimensional (3D) synthetic aperture radar (SAR) sensing. We consider a\nsystem consisting of two UAVs that perform bistatic interferometric SAR (InSAR)\nsensing for generation of a digital elevation model (DEM) and transmit the\nradar raw data to a ground station (GS) in real time. To account for practical\n3D sensing requirements, we use non-conventional sensing performance metrics,\nsuch as the SAR interferometric coherence, i.e., the local cross-correlation\nbetween the two co-registered UAV SAR images, the point-to-point InSAR relative\nheight error, and the height of ambiguity, which together characterize the\naccuracy with which the InSAR system can determine the height of ground\ntargets. Our objective is to jointly optimize the UAV formation, speed, and\ncommunication power allocation for maximization of the InSAR coverage while\nsatisfying energy, communication, and InSAR-specific sensing constraints. To\nsolve the formulated non-smooth and non-convex optimization problem, we divide\nit into three sub-problems and propose a novel alternating optimization (AO)\nframework that is based on classical, monotonic, and stochastic optimization\ntechniques. The effectiveness of the proposed algorithm is validated through\nextensive simulations and compared to several benchmark schemes. Furthermore,\nour simulation results highlight the impact of the UAV-GS communication link on\nthe flying formation and sensing performance and show that the DEM of a large\narea of interest can be mapped and offloaded to ground successfully, while the\nground topography can be estimated with centimeter-scale precision. Lastly, we\ndemonstrate that a low UAV velocity is preferable for InSAR applications as it\nleads to better sensing accuracy.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Tc8ThKG9d0TBEASfTTXAZWrwV762gSo2xraZF_Z3uqA","pdfSize":"2480145"}