{"id":"2407.06769","title":"Investigating the interplay between the coronal properties and the hard\n  X-ray variability of active galactic nuclei with NuSTAR","authors":"Roberto Serafinelli, Alessandra De Rosa, Alessia Tortosa, Luigi\n  Stella, Fausto Vagnetti, Stefano Bianchi, Claudio Ricci, Elias Kammoun,\n  Pierre-Olivier Petrucci, Riccardo Middei, Giorgio Lanzuisi, Andrea Marinucci,\n  Francesco Ursini, Giorgio Matt","authorsParsed":[["Serafinelli","Roberto",""],["De Rosa","Alessandra",""],["Tortosa","Alessia",""],["Stella","Luigi",""],["Vagnetti","Fausto",""],["Bianchi","Stefano",""],["Ricci","Claudio",""],["Kammoun","Elias",""],["Petrucci","Pierre-Olivier",""],["Middei","Riccardo",""],["Lanzuisi","Giorgio",""],["Marinucci","Andrea",""],["Ursini","Francesco",""],["Matt","Giorgio",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 11:38:40 GMT"},{"version":"v2","created":"Wed, 24 Jul 2024 15:01:11 GMT"}],"updateDate":"2024-07-25","timestamp":1720525120000,"abstract":"  Active galactic nuclei (AGN) are extremely variable in the X-ray band down to\nvery short timescales. However, the driver behind the X-ray variability is\nstill poorly understood. Previous results suggest that the hot corona\nresponsible for the primary Comptonized emission observed in AGN is expected to\nplay an important role in driving the X-ray variability. In this work, we\ninvestigate the connection between the X-ray amplitude variability and the\ncoronal physical parameters; namely, the temperature ($kT$) and optical depth\n($\\tau$). We present the spectral and timing analysis of 46 {\\it NuSTAR}\nobservations corresponding to a sample of 20 AGN. For each source, we derived\nthe coronal temperature and optical depth through X-ray spectroscopy and\ncomputed the normalized excess variance for different energy bands on a\ntimescale of $10$ ks. We find a strong inverse correlation between $kT$ and\n$\\tau$, with correlation coefficient of $r<-0.9$ and negligible null\nprobability. No clear dependence was found among the temperature and physical\nproperties, such as the black hole mass or the Eddington ratio. We also see\nthat the observed X-ray variability is not correlated with either the coronal\ntemperature or optical depth under the thermal equilibrium assumption, whereas\nit is anticorrelated with the black hole mass. These results can be interpreted\nthrough a scenario where the observed X-ray variability could primarily be\ndriven by variations in the coronal physical properties on a timescale of less\nthan $10$~ks; whereas we assume thermal equilibrium on such timescales in this\nwork, given the capability of the currently available hard X-ray telescopes.\nAlternatively, it is also possible that the X-ray variability is mostly driven\nby the absolute size of the corona, which depends on the supermassive black\nhole mass, rather than resulting from any of its physical properties.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"HtoQr8hgM679PRw8WLgs0isTOHgV4dBwfCQ_bvLwy0c","pdfSize":"6877063"}