{"id":"2407.07023","title":"HiSAC: High-Resolution Sensing with Multiband Communication Signals","authors":"Jacopo Pegoraro, Jesus O. Lacruz, Michele Rossi, Joerg Widmer","authorsParsed":[["Pegoraro","Jacopo",""],["Lacruz","Jesus O.",""],["Rossi","Michele",""],["Widmer","Joerg",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 16:43:41 GMT"}],"updateDate":"2024-07-10","timestamp":1720543421000,"abstract":"  Integrated Sensing And Communication (ISAC ) systems are expected to perform\naccurate radar sensing while having minimal impact on communication. Ideally,\nsensing should only reuse communication resources, especially for spectrum\nwhich is contended by many applications. However, this poses a great challenge\nin that communication systems often operate on narrow subbands with low sensing\nresolution. Combining contiguous subbands has shown significant resolution gain\nin active localization. However, multiband ISAC remains unexplored due to\ncommunication subbands being highly sparse (non-contiguous) and affected by\nphase offsets that prevent their aggregation (incoherent). To tackle these\nproblems, we design HiSAC, the first multiband ISAC system that combines\ndiverse subbands across a wide frequency range to achieve super-resolved\npassive ranging. To solve the non-contiguity and incoherence of subbands, HiSAC\ncombines them progressively, exploiting an anchor propagation path between\ntransmitter and receiver in an optimization problem to achieve phase coherence.\nHiSAC fully reuses pilot signals in communication systems, it applies to\ndifferent frequencies and can combine diverse technologies, e.g., 5G-NR and\nWiGig. We implement HiSAC on an experimental platform in the millimeter-wave\nunlicensed band and test it on objects and humans. Our results show it enhances\nthe sensing resolution by up to 20 times compared to single-band processing\nwhile occupying the same spectrum.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"Ehcv_MEERqXMhL2YDRlPknUYJ_9sGsQLrQb4NgwL6-I","pdfSize":"10810441"}