{"id":"2407.06961","title":"Combined Fit of Spectrum and Composition for FR0 Radio Galaxy Emitted\n  Ultra-High-Energy Cosmic Rays with Resulting Secondary Photons and Neutrinos","authors":"Jon Paul Lundquist, Serguei Vorobiov, Lukas Merten, Anita Reimer,\n  Margot Boughelilba, Paolo Da Vela, Fabrizio Tavecchio, Giacomo Bonnoli,\n  Chiara Righi","authorsParsed":[["Lundquist","Jon Paul",""],["Vorobiov","Serguei",""],["Merten","Lukas",""],["Reimer","Anita",""],["Boughelilba","Margot",""],["Da Vela","Paolo",""],["Tavecchio","Fabrizio",""],["Bonnoli","Giacomo",""],["Righi","Chiara",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 15:40:53 GMT"}],"updateDate":"2024-07-10","timestamp":1720539653000,"abstract":"  This study comprehensively investigates the gamma-ray dim population of\nFanaroff-Riley Type 0 (FR0) radio galaxies as potentially significant sources\nof ultra-high-energy cosmic rays (UHECRs, E $>$ 10$^{18}$ eV) detected on\nEarth. While individual FR0 luminosities are relatively low compared to the\nmore powerful Fanaroff-Riley Type 1 and Type 2 galaxies, FR0s are substantially\nmore prevalent in the local universe, outnumbering the more energetic galaxies\nby a factor of $\\sim$5 within a redshift of z $\\leq$ 0.05.\n  Employing CRPropa3 simulations, we estimate the mass composition and energy\nspectra of UHECRs originating from FR0 galaxies for energies above 10$^{18.6}$\neV. This estimation fits data from the Pierre Auger Observatory (Auger) using\nthree extensive air shower models; both constant and energy-dependent observed\nelemental fractions are considered. The simulation integrates an isotropic\ndistribution of FR0 galaxies, extrapolated from observed characteristics, with\nUHECR propagation in the intergalactic medium, incorporating various plausible\nconfigurations of extragalactic magnetic fields, both random and structured. We\nthen compare the resulting emission spectral indices, rigidity cutoffs, and\nelemental fractions with recent Auger results. In total, 25 combined energy\nspectrum and mass composition fits are considered.\n  Beyond the cosmic ray fluxes emitted by FR0 galaxies, this study predicts the\nsecondary photon and neutrino fluxes from UHECR interactions with intergalactic\ncosmic photon backgrounds. The multi-messenger approach, encompassing\nobservational data and theoretical models, helps elucidate the contribution of\nlow luminosity FR0 radio galaxies to the total cosmic ray energy density.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"c-UzSBbj5GMuajyZh0KoSSnVyp5i6Ud2B7hr-00jbmM","pdfSize":"4035767"}