{"id":"2407.01874","title":"Simultaneous semiparametric inference for single-index models","authors":"Jiajun Tang, Holger Dette","authorsParsed":[["Tang","Jiajun",""],["Dette","Holger",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 01:28:24 GMT"}],"updateDate":"2024-07-03","timestamp":1719883704000,"abstract":"  In the common partially linear single-index model we establish a Bahadur\nrepresentation for a smoothing spline estimator of all model parameters and use\nthis result to prove the joint weak convergence of the estimator of the index\nlink function at a given point, together with the estimators of the parametric\nregression coefficients. We obtain the surprising result that, despite of the\nnature of single-index models where the link function is evaluated at a linear\ncombination of the index-coefficients, the estimator of the link function and\nthe estimator of the index-coefficients are asymptotically independent. Our\napproach leverages a delicate analysis based on reproducing kernel Hilbert\nspace and empirical process theory.\n  We show that the smoothing spline estimator achieves the minimax optimal rate\nwith respect to the $L^2$-risk and consider several statistical applications\nwhere joint inference on all model parameters is of interest. In particular, we\ndevelop a simultaneous confidence band for the link function and propose\ninference tools to investigate if the maximum absolute deviation between the\n(unknown) link function and a given function exceeds a given threshold. We also\nconstruct tests for joint hypotheses regarding model parameters which involve\nboth the nonparametric and parametric components and propose novel multiplier\nbootstrap procedures to avoid the estimation of unknown asymptotic quantities.\n","subjects":["Mathematics/Statistics Theory","Statistics/Methodology","Statistics/Statistics Theory"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"ki3V3AN88N-RJrnuGy20GsXWEFNUitJQn8pUWp2UXds","pdfSize":"1140134"}