{"id":"2407.12261","title":"Voltage-Controlled Magnetoelectric Devices for Neuromorphic Diffusion\n  Process","authors":"Yang Cheng, Qingyuan Shu, Albert Lee, Haoran He, Ivy Zhu, Haris\n  Suhail, Minzhang Chen, Renhe Chen, Zirui Wang, Hantao Zhang, Chih-Yao Wang,\n  Shan-Yi Yang, Yu-Chen Hsin, Cheng-Yi Shih, Hsin-Han Lee, Ran Cheng, Sudhakar\n  Pamarti, Xufeng Kou and Kang L. Wang","authorsParsed":[["Cheng","Yang",""],["Shu","Qingyuan",""],["Lee","Albert",""],["He","Haoran",""],["Zhu","Ivy",""],["Suhail","Haris",""],["Chen","Minzhang",""],["Chen","Renhe",""],["Wang","Zirui",""],["Zhang","Hantao",""],["Wang","Chih-Yao",""],["Yang","Shan-Yi",""],["Hsin","Yu-Chen",""],["Shih","Cheng-Yi",""],["Lee","Hsin-Han",""],["Cheng","Ran",""],["Pamarti","Sudhakar",""],["Kou","Xufeng",""],["Wang","Kang L.",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 02:14:22 GMT"}],"updateDate":"2024-07-18","timestamp":1721182462000,"abstract":"  Stochastic diffusion processes are pervasive in nature, from the seemingly\nerratic Brownian motion to the complex interactions of synaptically-coupled\nspiking neurons. Recently, drawing inspiration from Langevin dynamics,\nneuromorphic diffusion models were proposed and have become one of the major\nbreakthroughs in the field of generative artificial intelligence. Unlike\ndiscriminative models that have been well developed to tackle classification or\nregression tasks, diffusion models as well as other generative models such as\nChatGPT aim at creating content based upon contexts learned. However, the more\ncomplex algorithms of these models result in high computational costs using\ntoday's technologies, creating a bottleneck in their efficiency, and impeding\nfurther development. Here, we develop a spintronic voltage-controlled\nmagnetoelectric memory hardware for the neuromorphic diffusion process. The\nin-memory computing capability of our spintronic devices goes beyond current\nVon Neumann architecture, where memory and computing units are separated.\nTogether with the non-volatility of magnetic memory, we can achieve high-speed\nand low-cost computing, which is desirable for the increasing scale of\ngenerative models in the current era. We experimentally demonstrate that the\nhardware-based true random diffusion process can be implemented for image\ngeneration and achieve comparable image quality to software-based training as\nmeasured by the Frechet inception distance (FID) score, achieving ~10^3 better\nenergy-per-bit-per-area over traditional hardware.\n","subjects":["Computing Research Repository/Neural and Evolutionary Computing","Computing Research Repository/Emerging Technologies","Computing Research Repository/Machine Learning","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Jwbqs_kv6WO0GwZvYgZkY1oOlOvT1VbFaWEkPSAMpTM","pdfSize":"2445227","objectId":"0xbe61b0cb00f2132878406ba80475a3ea8612d4e8158daa2bf26b5213cfbb3166","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
