{"id":"2407.02557","title":"Weak-Lensing Characterization of the Dark Matter in 29 Merging Clusters\n  that Exhibit Radio Relics","authors":"Kyle Finner, M. James Jee, Hyejeon Cho, Kim Hyeonghan, Wonki Lee,\n  Reinout J. van Weeren, David Wittman, Mijin Yoon","authorsParsed":[["Finner","Kyle",""],["Jee","M. James",""],["Cho","Hyejeon",""],["Hyeonghan","Kim",""],["Lee","Wonki",""],["van Weeren","Reinout J.",""],["Wittman","David",""],["Yoon","Mijin",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 18:00:00 GMT"}],"updateDate":"2024-07-04","timestamp":1719943200000,"abstract":"  We present a multiwavelength analysis of 29 merging galaxy clusters that\nexhibit radio relics. For each merging system, we perform a weak-lensing\nanalysis on Subaru optical imaging. We generate high-resolution mass maps of\nthe dark matter distributions, which are critical for discerning the merging\nconstituents. Combining the weak-lensing detections with X-ray emission, radio\nemission, and galaxy redshifts, we discuss the formation of radio relics from\nthe past collision. For each subcluster, we obtain mass estimates by fitting a\nmulti-component NFW model with and without a concentration-mass relation.\nComparing the two mass estimate techniques, we find that the concentration-mass\nrelation underestimates (overestimates) the mass relative to fitting both\nparameters for high- (low-) mass subclusters. We compare the mass estimates of\neach subcluster to their velocity dispersion measurements and find that they\npreferentially lie below the expected velocity dispersion scaling relation,\nespecially at the low-mass end (~$10^{14}\\ M_\\odot$). We show that the majority\nof the clusters that exhibit radio relics are in major mergers with a mass\nratio below 1:4. We investigate the position of the mass peak relative to the\ngalaxy luminosity peak, number density peak, and BCG locations and find that\nthe BCG tends to better trace the mass peak position. Finally, we update a\ngolden sample of 8 galaxy clusters that have the simplest geometries and can\nprovide the cleanest picture of the past merger, which we recommend for further\ninvestigation to constrain the nature of dark matter and the acceleration\nprocess that leads to radio relics.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"k8gvE-nsk4-tHKN_EaneVBgRA6QYvwvhc7ql4jX0wNg","pdfSize":"8407358"}