{"id":"2407.08002","title":"Approximations in first-principles volumetric thermal expansion\n  determination","authors":"Samare Rostami and Xavier Gonze","authorsParsed":[["Rostami","Samare",""],["Gonze","Xavier",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 19:16:35 GMT"}],"updateDate":"2024-07-12","timestamp":1720638995000,"abstract":"  In the realm of thermal expansion determination, the quasiharmonic\napproximation (QHA) stands as a widely embraced method for discerning minima of\nfree energies across diverse temperatures such that the temperature dependence\nof lattice parameters as well as internal atomic positions can be determined.\nHowever, this methodology often imposes substantial computational demand,\nnecessitating numerous costly calculations of full phonon spectra in a possibly\nmany-dimensional geometry parameter space. Focusing on the volumetric thermal\nexpansion only, the volume-constrained zero static internal stress\napproximation (v-ZSISA) within QHA allows one to limit significantly the number\nof phonon spectra determinations to typically less than 10. The linear\nGruneisen approach goes even further with only two phonon spectra\ndeterminations to find the volumetric thermal expansion, but a deterioration of\nthe accuracy of the computed thermal expansion is observed, except at low\ntemperatures. We streamline this process by introducing further intermediate\napproximations between the linear Gruneisen and the v-ZSISA-QHA, corresponding\nto different orders of the Taylor expansion. The minimal number of phonon\nspectra calculations that is needed to maintain precise outcomes is\ninvestigated. The different approximations are tested on a representative set\nof 12 materials. For the majority of materials, three full phonon spectra,\ncorresponding to quadratic order, is enough to determine the thermal expansion\nin reasonable agreement with the v-ZSISA-QHA method up to 800 K. Near perfect\nagreement is obtained with five phonon spectra. This study paves the way to\nmultidimensional generalizations, beyond the volumetric case, with the\nexpectation of much bigger benefits.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"bBRO-cFanURiP7F2qMsCpBTuWphWgHFZS6npgJwfFCc","pdfSize":"4746439"}