{"id":"2407.12421","title":"SafePowerGraph: Safety-aware Evaluation of Graph Neural Networks for\n  Transmission Power Grids","authors":"Salah Ghamizi, Aleksandar Bojchevski, Aoxiang Ma and Jun Cao","authorsParsed":[["Ghamizi","Salah",""],["Bojchevski","Aleksandar",""],["Ma","Aoxiang",""],["Cao","Jun",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 09:01:38 GMT"}],"updateDate":"2024-07-18","timestamp":1721206898000,"abstract":"  Power grids are critical infrastructures of paramount importance to modern\nsociety and their rapid evolution and interconnections has heightened the\ncomplexity of power systems (PS) operations. Traditional methods for grid\nanalysis struggle with the computational demands of large-scale RES and ES\nintegration, prompting the adoption of machine learning (ML) techniques,\nparticularly Graph Neural Networks (GNNs). GNNs have proven effective in\nsolving the alternating current (AC) Power Flow (PF) and Optimal Power Flow\n(OPF) problems, crucial for operational planning. However, existing benchmarks\nand datasets completely ignore safety and robustness requirements in their\nevaluation and never consider realistic safety-critical scenarios that most\nimpact the operations of the power grids. We present SafePowerGraph, the first\nsimulator-agnostic, safety-oriented framework and benchmark for GNNs in PS\noperations. SafePowerGraph integrates multiple PF and OPF simulators and\nassesses GNN performance under diverse scenarios, including energy price\nvariations and power line outages. Our extensive experiments underscore the\nimportance of self-supervised learning and graph attention architectures for\nGNN robustness. We provide at https://github.com/yamizi/SafePowerGraph our\nopen-source repository, a comprehensive leaderboard, a dataset and model zoo\nand expect our framework to standardize and advance research in the critical\nfield of GNN for power systems.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"VVNebZN3RLHcz0B2bGkORUx0AMr4z0FuwZVJVNFqUZE","pdfSize":"2923393"}