{"id":"2407.14232","title":"Adapted Swin Transformer-based Real-Time Plasma Shape Detection and\n  Control in HL-3","authors":"Qianyun Dong, Zhengwei Chen, Rongpeng Li, Zongyu Yang, Feng Gao,\n  Yihang Chen, Fan Xia, Wulyu Zhong, Zhifeng Zhao","authorsParsed":[["Dong","Qianyun",""],["Chen","Zhengwei",""],["Li","Rongpeng",""],["Yang","Zongyu",""],["Gao","Feng",""],["Chen","Yihang",""],["Xia","Fan",""],["Zhong","Wulyu",""],["Zhao","Zhifeng",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 11:59:42 GMT"}],"updateDate":"2024-07-22","timestamp":1721390382000,"abstract":"  In the field of magnetic confinement plasma control, the accurate feedback of\nplasma position and shape primarily relies on calculations derived from\nmagnetic measurements through equilibrium reconstruction or matrix mapping\nmethod. However, under harsh conditions like high-energy neutron radiation and\nelevated temperatures, the installation of magnetic probes within the device\nbecomes challenging. Relying solely on external magnetic probes can compromise\nthe precision of EFIT in determining the plasma shape. To tackle this issue, we\nintroduce a real-time, non-magnetic measurement method on the HL-3 tokamak,\nwhich diagnoses the plasma position and shape via imaging. Particularly, we put\nforward an adapted Swin Transformer model, the Poolformer Swin Transformer\n(PST), to accurately and fastly interpret the plasma shape from the\nCharge-Coupled Device Camera (CCD) images. By adopting multi-task learning and\nknowledge distillation techniques, the model is capable of robustly detecting\nsix shape parameters under disruptive conditions such as a divertor shape and\ngas injection, circumventing global brightness changes and cumbersome manual\nlabeling. Specifically, the well-trained PST model capably infers R and Z\nwithin the mean average error below 1.1 cm and 1.8 cm, respectively, while\nrequiring less than 2 ms for end-to-end feedback, an 80 improvement over the\nsmallest Swin Transformer model, laying the foundation for real-time control.\nFinally, we deploy the PST model in the Plasma Control System (PCS) using\nTensorRT, and achieve 500 ms stable PID feedback control based on the\nPST-computed horizontal displacement information. In conclusion, this research\nopens up new avenues for the practical application of image-computing plasma\nshape diagnostic methods in the realm of real-time feedback control.\n","subjects":["Physics/Plasma Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"UvbhxembGGnL8w-0jl0bGJ9DbUjYM6jHMwZZc3mToT8","pdfSize":"2845779"}