{"id":"2407.17139","title":"A Reduced Order Model conditioned on monitoring features for estimation\n  and uncertainty quantification in engineered systems","authors":"Konstantinos Vlachas, Thomas Simpson, Anthony Garland, D. Dane Quinn,\n  Charbel Farhat, Eleni Chatzi","authorsParsed":[["Vlachas","Konstantinos",""],["Simpson","Thomas",""],["Garland","Anthony",""],["Quinn","D. Dane",""],["Farhat","Charbel",""],["Chatzi","Eleni",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 10:18:47 GMT"}],"updateDate":"2024-07-25","timestamp":1721816327000,"abstract":"  Reduced Order Models (ROMs) form essential tools across engineering domains\nby virtue of their function as surrogates for computationally intensive digital\ntwinning simulators. Although purely data-driven methods are available for ROM\nconstruction, schemes that allow to retain a portion of the physics tend to\nenhance the interpretability and generalization of ROMs. However, physics-based\ntechniques can adversely scale when dealing with nonlinear systems that feature\nparametric dependencies. This study introduces a generative physics-based ROM\nthat is suited for nonlinear systems with parametric dependencies and is\nadditionally able to quantify the confidence associated with the respective\nestimates. A main contribution of this work is the conditioning of these\nparametric ROMs to features that can be derived from monitoring measurements,\nfeasibly in an online fashion. This is contrary to most existing ROM schemes,\nwhich remain restricted to the prescription of the physics-based, and usually a\npriori unknown, system parameters. Our work utilizes conditional Variational\nAutoencoders to continuously map the required reduction bases to a feature\nvector extracted from limited output measurements, while additionally allowing\nfor a probabilistic assessment of the ROM-estimated Quantities of Interest. An\nauxiliary task using a neural network-based parametrization of suitable\nprobability distributions is introduced to re-establish the link with physical\nmodel parameters. We verify the proposed scheme on a series of simulated case\nstudies incorporating effects of geometric and material nonlinearity under\nparametric dependencies related to system properties and input load\ncharacteristics.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"S2eWzcIUpQRnqiHUOKEmrtPeJnHja0qqjNYKEDs9Gn8","pdfSize":"1409125"}