{"id":"2407.10958","title":"InVi: Object Insertion In Videos Using Off-the-Shelf Diffusion Models","authors":"Nirat Saini, Navaneeth Bodla, Ashish Shrivastava, Avinash\n  Ravichandran, Xiao Zhang, Abhinav Shrivastava, Bharat Singh","authorsParsed":[["Saini","Nirat",""],["Bodla","Navaneeth",""],["Shrivastava","Ashish",""],["Ravichandran","Avinash",""],["Zhang","Xiao",""],["Shrivastava","Abhinav",""],["Singh","Bharat",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 17:55:09 GMT"}],"updateDate":"2024-07-16","timestamp":1721066109000,"abstract":"  We introduce InVi, an approach for inserting or replacing objects within\nvideos (referred to as inpainting) using off-the-shelf, text-to-image latent\ndiffusion models. InVi targets controlled manipulation of objects and blending\nthem seamlessly into a background video unlike existing video editing methods\nthat focus on comprehensive re-styling or entire scene alterations. To achieve\nthis goal, we tackle two key challenges. Firstly, for high quality control and\nblending, we employ a two-step process involving inpainting and matching. This\nprocess begins with inserting the object into a single frame using a\nControlNet-based inpainting diffusion model, and then generating subsequent\nframes conditioned on features from an inpainted frame as an anchor to minimize\nthe domain gap between the background and the object. Secondly, to ensure\ntemporal coherence, we replace the diffusion model's self-attention layers with\nextended-attention layers. The anchor frame features serve as the keys and\nvalues for these layers, enhancing consistency across frames. Our approach\nremoves the need for video-specific fine-tuning, presenting an efficient and\nadaptable solution. Experimental results demonstrate that InVi achieves\nrealistic object insertion with consistent blending and coherence across\nframes, outperforming existing methods.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"S9l7q7wYEsc5uXp_-LqLN84Am2JavmPIo5g2_Uez7BE","pdfSize":"20645363"}