{"id":"2407.17084","title":"Effect of Austerity Measures on Infant Mortality: Evidence from Greece","authors":"Robert J. Kolesar, Rok Spruk","authorsParsed":[["Kolesar","Robert J.",""],["Spruk","Rok",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 08:21:18 GMT"}],"updateDate":"2024-07-25","timestamp":1721809278000,"abstract":"  This study examines the effect of fiscal austerity measures on infant\nmortality in Greece. Austerity measures were initiated by the tripartite\ncommittee and implemented between 2010 and 2017 to counteract deep fiscal\ndeficit and large public debt. By comparing Greece with a plausible donor pool\nof OECD and Mediterranean member states in the period 1991-2020, we estimate a\nseries of missing counterfactual scenarios to evaluate the infant mortality\neffects of large-scale reduction in spending on health care. A series of hybrid\nsynthetic control and difference-in-differences estimates indicate a unique and\npervasive increase in infant mortality after the implementation of austerity\nmeasures. Compared to a plausible OECD and Mediterranean counterfactual\nscenario, pro-cyclical austerity measures are associated with derailed and\npermanently increased infant mortality up to the present day. Our estimates\nsuggest that compared to a plausible counterfactual scenario, the cumulative\ninfant mortality cost of austerity policies exceeds 10,000 infant deaths or\nslightly less than 850 deaths for each year of the austerity policies. Notably,\nmortality increases are concentrated among boys. The estimated impacts survive\na battery of rigorous robustness and placebo tests.\n","subjects":["Economics/General Economics","Quantitative Finance/Economics","Statistics/Applications"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"qfoJgKruEuflr3eH4gWACmWq3SveYOzZKm1v-w-OyMc","pdfSize":"1816289","objectId":"0x1c603da655503e737584e226a25ac18659678f3f30763014f21c69f1755d978c","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
