{"id":"2407.11899","title":"Impact of coherent mode coupling on noise performance in elliptical\n  aperture VCSELs for datacom","authors":"Cristina Rimoldi, Lorenzo L. Columbo, Alberto Tibaldi, Pierluigi\n  Debernardi, Sebastian Romero Garc\\'ia, Christian Raabe, Mariangela Gioannini","authorsParsed":[["Rimoldi","Cristina",""],["Columbo","Lorenzo L.",""],["Tibaldi","Alberto",""],["Debernardi","Pierluigi",""],["García","Sebastian Romero",""],["Raabe","Christian",""],["Gioannini","Mariangela",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 16:32:38 GMT"}],"updateDate":"2024-09-18","timestamp":1721147558000,"abstract":"  We study the dynamical behavior of medium-size multimode VCSELs with an\nelliptical oxide aperture, selected for the best trade-off between high output\npower and modulation speed for datacom applications, with a focus on their\nrelative intensity noise (RIN) performance. Our experimental results, collected\nfor various VCSELs, outline the presence of several peaks in the RIN spectra\nwithin the bandwidth of the transmission system, which can limit the eye\nopening under direct current modulation. Here, we present a rigorous model to\nexplain for the first time the origin of these peaks. In particular, the\nfrequencies of the spectral RIN peaks are analytically described as the result\nof the non-trivial interaction among transverse modes by addressing the laser\ndynamics and the related noise features through a time-domain mode expansion\napproach, accounting for coherent effects in multimode competition, spatial\nhole burning, and carrier diffusion. The laser modulation performance is\naddressed through dynamical simulations with PAM2 and PAM4 modulations, which\nclearly demonstrate the potential for high-bitrate optical interconnects.\nFinally, we address the effect of the oxide aperture aspect ratio via\nelectromagnetic simulations, demonstrating how the ellipticity affects the\nmodal frequency detuning and the RIN, thus providing design guidelines for\nVCSELs with low RIN performance and outlining a clear roadmap for a\nsubstantially improved bandwidth-power trade-off in these devices.\n","subjects":["Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"GdICpoL_Z1bHLL-b_aoAgd3jmiEFNJrqJseaJtsEjd8","pdfSize":"6540982"}