{"id":"2407.21101","title":"The evolution of the $M_{\\mathrm{d}}-M_{\\star}$ and $\\dot M-M_{\\star}$\n  correlations traces protoplanetary disc dispersal","authors":"Alice Somigliana, Leonardo Testi, Giovanni Rosotti, Claudia Toci,\n  Giuseppe Lodato, Rossella Anania, Beno\\^it Tabone, Marco Tazzari, Ralf\n  Klessen, Ugo Lebreuilly, Patrick Hennebelle, Sergio Molinari","authorsParsed":[["Somigliana","Alice",""],["Testi","Leonardo",""],["Rosotti","Giovanni",""],["Toci","Claudia",""],["Lodato","Giuseppe",""],["Anania","Rossella",""],["Tabone","Benoît",""],["Tazzari","Marco",""],["Klessen","Ralf",""],["Lebreuilly","Ugo",""],["Hennebelle","Patrick",""],["Molinari","Sergio",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 18:00:01 GMT"}],"updateDate":"2024-08-01","timestamp":1722362401000,"abstract":"  (Abridged) Observational surveys of entire star-forming regions have provided\nevidence of power-law correlations between the disc properties and the stellar\nmass, especially the disc mass (${M_d \\propto M_*}^{\\lambda_m}$) and the\naccretion rate ($\\dot M \\propto {M_*}^{\\lambda_{acc}}$). Whether the secular\ndisc evolution affects said correlations is still debated: while the purely\nviscous scenario has been probed, other mechanisms could impact differently. We\nstudy the evolution of the slopes $\\lambda_m$ and $\\lambda_{acc}$ in the\nwind-driven and hybrid case and compare it to the viscous prediction, using a\ncombination of analytical calculations and numerical simulations (performed\nwith the 1D population synthesis code Diskpop, that we also present and\nrelease). Assuming $M_d(0) \\propto {M_*}^{\\lambda_{m, 0}}$ and $\\dot M(0)\n\\propto {M_*}^{\\lambda_{acc, 0}}$ as initial conditions, we find that viscous\nand hybrid accretion preserve the shape of the correlations and evolve their\nslope; on the other hand, MHD winds change the shape of the correlations,\nbending them according to the scaling of the accretion timescale with the\nstellar mass. We also show how a spread in the initial conditions conceals this\nbehaviour. We then analyse the impact of disc dispersal, and find that the\ncurrently available sample sizes ($\\sim 30$ discs at 5 Myr) introduce\nstochastic oscillations in the slopes evolution, which dominate over the\nphysical signatures. Increasing the sample size could mitigate this issue:\n$\\sim 140$ discs at 5 Myr, corresponding to the complete Upper Sco sample,\nwould give small enough error bars to use the evolution of the slopes as a\nproxy for the driving mechanism of disc evolution. Finally, we discuss how the\nobservational claim of steepening slopes necessarily leads to an initially\nsteeper $M_d - M_*$ correlation with respect to $\\dot M - M_*$.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"S48GmHqcViJmKEvvl4DhODoNDUY8r1rLuEIdz-180JY","pdfSize":"945723"}