{"id":"2407.04639","title":"Quantized circular dichroism on the edge of quantum Hall systems: The\n  many-body Chern number as seen from the edge","authors":"F. Nur \\\"Unal, A. Nardin and N. Goldman","authorsParsed":[["Ünal","F. Nur",""],["Nardin","A.",""],["Goldman","N.",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 16:51:36 GMT"}],"updateDate":"2024-07-08","timestamp":1720198296000,"abstract":"  Quantum Hall states are characterized by a topological invariant, the\nmany-body Chern number, which determines the quantized value of the Hall\nconductivity. Interestingly, this topological property can also be accessed\nthrough a dissipative response, by subjecting the system to a circular drive\nand comparing excitation rates obtained for opposite orientations of the drive.\nThis quantized circular dichroism assumes that only the bulk contributes to the\nresponse. Indeed, in a confined and isolated system, the edge contribution\nexactly cancels the bulk response. This work explores an important corollary of\nthe latter observation: If properly isolated, the circular dichroic response\nstemming from the edge of a quantum Hall droplet must be quantized, thus\nproviding an appealing way to probe the many-body Chern number. Importantly, we\ndemonstrate that this quantized edge response is entirely captured by\nlow-energy chiral edge modes, allowing for a universal description of this\neffect based on Wen's edge theory. Its low-energy nature implies that the\nquantized edge response can be distinguished from the bulk response in the\nfrequency domain. We illustrate our findings using realistic models of integer\nand fractional Chern insulators, with different edge geometries, and propose\ndetection schemes suitable for ultracold atoms. Edge dichroic responses emerge\nas a practical probe for strongly-correlated topological phases, accessible in\ncold-atom experiments.\n","subjects":["Condensed Matter/Quantum Gases","Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Strongly Correlated Electrons","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"eu2ZmAFuJzd_GdVhQPyhtXJ7hHzYywgPBvGI68Z38bs","pdfSize":"1201290"}