{"id":"2407.07797","title":"The positioning of stress fibers in contractile cells minimizes internal\n  mechanical stress","authors":"Lukas Riedel, Valentin W\\\"ossner, Dominic Kempf, Falko Ziebert, Peter\n  Bastian and Ulrich S. Schwarz (Heidelberg University)","authorsParsed":[["Riedel","Lukas","","Heidelberg University"],["Wössner","Valentin","","Heidelberg University"],["Kempf","Dominic","","Heidelberg University"],["Ziebert","Falko","","Heidelberg University"],["Bastian","Peter","","Heidelberg University"],["Schwarz","Ulrich S.","","Heidelberg University"]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 16:15:07 GMT"}],"updateDate":"2024-07-11","timestamp":1720628107000,"abstract":"  The mechanics of animal cells is strongly determined by stress fibers, which\nare contractile filament bundles that form dynamically in response to\nextracellular cues. Stress fibers allow the cell to adapt its mechanics to\nenvironmental conditions and to protect it from structural damage. While the\nphysical description of single stress fibers is well-developed, much less is\nknown about their spatial distribution on the level of whole cells. Here, we\ncombine a finite element method for one-dimensional fibers embedded in an\nelastic bulk medium with dynamical rules for stress fiber formation based on\ngenetic algorithms. We postulate that their main goal is to achieve minimal\nmechanical stress in the bulk material with as few fibers as possible. The\nfiber positions and configurations resulting from this optimization task alone\nare in good agreement with those found in experiments where cells in\n3D-scaffolds were mechanically strained at one attachment point. For optimized\nconfigurations, we find that stress fibers typically run through the cell in a\ndiagonal fashion, similar to reinforcement strategies used for composite\nmaterial.\n","subjects":["Physics/Biological Physics","Condensed Matter/Soft Condensed Matter","Quantitative Biology/Cell Behavior","Quantitative Biology/Subcellular Processes"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"ZXV9v3kA4T3ZVRvnA-MFWPSkazOQGoDXlkNWkcAD_wk","pdfSize":"8910493"}