{"id":"2407.07583","title":"Extended gamma-ray emission from particle escape in pulsar wind nebulae\n  -- Application to HESS J1809-193 and HESS J1825-137","authors":"Pierrick Martin, Louis de Guillebon, Eliot Collard, In\\`es Mertz, Lars\n  Mohrmann, Giacomo Principe, Marianne Lemoine-Goumard, Alexandre Marcowith,\n  R\\'egis Terrier, Miroslav Filipovi\\'c","authorsParsed":[["Martin","Pierrick",""],["de Guillebon","Louis",""],["Collard","Eliot",""],["Mertz","Inès",""],["Mohrmann","Lars",""],["Principe","Giacomo",""],["Lemoine-Goumard","Marianne",""],["Marcowith","Alexandre",""],["Terrier","Régis",""],["Filipović","Miroslav",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 12:16:19 GMT"}],"updateDate":"2024-07-11","timestamp":1720613779000,"abstract":"  There is growing evidence from gamma-ray observations at high and very high\nenergies that particle escape is a key aspect shaping the morphological\nproperties of pulsar wind nebulae (PWNe) at various evolutionary stages. We aim\nto provide a simple model for the gamma-ray emission from these objects\nincluding the transport of particles across the different components of the\nsystem. We applied it to sources HESS J1809-193 and HESS J1825-137. We\ndeveloped a multi-zone framework applicable to dynamically young PWNe, taking\ninto account the diffusive escape of relativistic electron-positron pairs out\nof the nebula into the parent supernova remnant (SNR) and their confinement\ndownstream of the magnetic barrier of the forward shock until an eventual\nrelease into the surrounding interstellar medium (ISM). For a wide range of\nturbulence properties in the nebula, the GeV-TeV inverse-Compton radiation from\npairs that escaped into the remnant can be a significant if not dominant\ncontribution to the emission from the system. It may dominate the pion-decay\nradiation from cosmic rays accelerated at the forward shock and advected\ndownstream of it. In the TeV-PeV range, the contribution from particles escaped\ninto the ISM can exceed by far that of the SNR+PWN components. Applied to HESS\nJ1809-193 and HESS J1825-137, we found that spatially extended GeV-TeV emission\ncomponents can be accounted for mostly from particles escaped into the ISM,\nwhile morphologically more compact components above 50-100TeV are ascribed to\nthe PWNe. In these two cases, the model suggests high turbulence in the nebula\nand a forward shock accelerating cosmic rays up to ~100TeV at most. The model\nprovides the temporal and spectral properties of the flux of particles\noriginally energized by the pulsar wind and ultimately released in the ISM.\n(Abridged).\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"xmj-Jl1AxFVuw3wUHlUoIbjXmH05fHydGBPkcBqhSsM","pdfSize":"984465"}