{"id":"2407.09294","title":"SS-SfP:Neural Inverse Rendering for Self Supervised Shape from (Mixed)\n  Polarization","authors":"Ashish Tiwari and Shanmuganathan Raman","authorsParsed":[["Tiwari","Ashish",""],["Raman","Shanmuganathan",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 14:29:00 GMT"}],"updateDate":"2024-07-15","timestamp":1720794540000,"abstract":"  We present a novel inverse rendering-based framework to estimate the 3D shape\n(per-pixel surface normals and depth) of objects and scenes from single-view\npolarization images, the problem popularly known as Shape from Polarization\n(SfP). The existing physics-based and learning-based methods for SfP perform\nunder certain restrictions, i.e., (a) purely diffuse or purely specular\nreflections, which are seldom in the real surfaces, (b) availability of the\nground truth surface normals for direct supervision that are hard to acquire\nand are limited by the scanner's resolution, and (c) known refractive index. To\novercome these restrictions, we start by learning to separate the\npartially-polarized diffuse and specular reflection components, which we call\nreflectance cues, based on a modified polarization reflection model and then\nestimate shape under mixed polarization through an inverse-rendering based\nself-supervised deep learning framework called SS-SfP, guided by the\npolarization data and estimated reflectance cues. Furthermore, we also obtain\nthe refractive index as a non-linear least squares solution. Through extensive\nquantitative and qualitative evaluation, we establish the efficacy of the\nproposed framework over simple single-object scenes from DeepSfP dataset and\ncomplex in-the-wild scenes from SPW dataset in an entirely self-supervised\nsetting. To the best of our knowledge, this is the first learning-based\napproach to address SfP under mixed polarization in a completely\nself-supervised framework.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"6yxTQXYXSd_IXCmEX82df65FDI0oU-FNLxAkN8k-A3Q","pdfSize":"8192692"}