{"id":"2407.03393","title":"Corvus A: A low-mass, isolated galaxy at 3.5 Mpc","authors":"Michael G. Jones, David J. Sand, Burcin Mutlu-Pakdil, Catherine E.\n  Fielder, Denija Crnojevic, Paul Bennet, Kristine Spekkens, Richard\n  Donnerstein, Amandine Doliva-Dolinsky, Ananthan Karunakaran, Jay Strader,\n  Dennis Zaritsky","authorsParsed":[["Jones","Michael G.",""],["Sand","David J.",""],["Mutlu-Pakdil","Burcin",""],["Fielder","Catherine E.",""],["Crnojevic","Denija",""],["Bennet","Paul",""],["Spekkens","Kristine",""],["Donnerstein","Richard",""],["Doliva-Dolinsky","Amandine",""],["Karunakaran","Ananthan",""],["Strader","Jay",""],["Zaritsky","Dennis",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 18:00:00 GMT"},{"version":"v2","created":"Thu, 25 Jul 2024 15:20:36 GMT"}],"updateDate":"2024-07-26","timestamp":1720029600000,"abstract":"  We report the discovery of Corvus A, a low-mass, gas-rich galaxy at a\ndistance of approximately 3.5 Mpc, identified in DR10 of the Dark Energy Camera\nLegacy Imaging Survey during the initial phase of our ongoing SEmi-Automated\nMachine LEarning Search for Semi-resolved galaxies (SEAMLESS). Jansky Very\nLarge Array observations of Corvus A detect HI line emission at a radial\nvelocity of $523\\pm2$ km/s. Magellan/Megacam imaging reveals an irregular and\ncomplex stellar population with both young and old stars. We detect UV emission\nin Neil Gehrels Swift observations, indicative of recent star formation.\nHowever, there are no signs of HII regions in H$\\alpha$ imaging from Steward\nObservatory's Kuiper telescope. Based on the Megacam color magnitude diagram we\nmeasure the distance to Corvus A via the tip-of-the-red-giant-branch standard\ncandle as $3.48\\pm0.24$ Mpc. This makes Corvus A remarkably isolated, with no\nknown galaxy within $\\sim$1 Mpc. Based on this distance, we estimate the HI and\nstellar mass of Corvus A to be $\\log M_\\mathrm{HI}/\\mathrm{M_\\odot} = 6.59$ and\n$\\log M_\\ast/\\mathrm{M_\\odot} = 6.0$. Although there are some signs of\nrotation, the HI distribution of Corvus A appears to be close to face-on,\nanalogous to that of Leo T, and we therefore do not attempt to infer a\ndynamical mass from its HI line width. Higher resolution synthesis imaging is\nrequired to confirm this morphology and to draw robust conclusions from its gas\nkinematics.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"51cEJBAwJh_T6-8CK0-uRDzeA3Imet8seijvEJ6U16w","pdfSize":"5602504"}