{"id":"2407.08227","title":"DALL-M: Context-Aware Clinical Data Augmentation with LLMs","authors":"Chihcheng Hsieh, Catarina Moreira, Isabel Blanco Nobre, Sandra Costa\n  Sousa, Chun Ouyang, Margot Brereton, Joaquim Jorge and Jacinto C. Nascimento","authorsParsed":[["Hsieh","Chihcheng",""],["Moreira","Catarina",""],["Nobre","Isabel Blanco",""],["Sousa","Sandra Costa",""],["Ouyang","Chun",""],["Brereton","Margot",""],["Jorge","Joaquim",""],["Nascimento","Jacinto C.",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 07:01:50 GMT"}],"updateDate":"2024-07-12","timestamp":1720681310000,"abstract":"  X-ray images are vital in medical diagnostics, but their effectiveness is\nlimited without clinical context. Radiologists often find chest X-rays\ninsufficient for diagnosing underlying diseases, necessitating comprehensive\nclinical features and data integration. We present a novel technique to enhance\nthe clinical context through augmentation techniques with clinical tabular\ndata, thereby improving its applicability and reliability in AI medical\ndiagnostics. To address this, we introduce a pioneering approach to clinical\ndata augmentation that employs large language models (LLMs) to generate patient\ncontextual synthetic data. This methodology is crucial for training more robust\ndeep learning models in healthcare. It preserves the integrity of real patient\ndata while enriching the dataset with contextually relevant synthetic features,\nsignificantly enhancing model performance. DALL-M uses a three-phase feature\ngeneration process: (i) clinical context storage, (ii) expert query generation,\nand (iii) context-aware feature augmentation. DALL-M generates new, clinically\nrelevant features by synthesizing chest X-ray images and reports. Applied to\n799 cases using nine features from the MIMIC-IV dataset, it created an\naugmented set of 91 features. This is the first work to generate contextual\nvalues for existing and new features based on patients' X-ray reports, gender,\nand age and to produce new contextual knowledge during data augmentation.\nEmpirical validation with machine learning models, including Decision Trees,\nRandom Forests, XGBoost, and TabNET, showed significant performance\nimprovements. Incorporating augmented features increased the F1 score by 16.5%\nand Precision and Recall by approximately 25%. DALL-M addresses a critical gap\nin clinical data augmentation, offering a robust framework for generating\ncontextually enriched datasets.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Information Retrieval","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"27oceXRjfsDgIaGJ61c58xCVNb1lOoltLlOd_C3sqas","pdfSize":"3137511"}