{"id":"2407.16535","title":"Microwave Signatures of Topological Superconductivity in Planar\n  Josephson Junctions","authors":"Bar{\\i}\\c{s} Pekerten, David Brand\\~ao, Bassel Heiba Elfeky, Tong\n  Zhou, Jong E. Han, Javad Shabani, Igor \\v{Z}uti\\'c","authorsParsed":[["Pekerten","Barış",""],["Brandão","David",""],["Elfeky","Bassel Heiba",""],["Zhou","Tong",""],["Han","Jong E.",""],["Shabani","Javad",""],["Žutić","Igor",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 14:46:48 GMT"},{"version":"v2","created":"Wed, 24 Jul 2024 02:36:04 GMT"},{"version":"v3","created":"Thu, 25 Jul 2024 13:04:00 GMT"},{"version":"v4","created":"Tue, 20 Aug 2024 01:03:35 GMT"}],"updateDate":"2024-08-21","timestamp":1721746008000,"abstract":"  Planar Josephson junctions provide a platform to host topological\nsuperconductivity which, through manipulating Majorana bound states (MBS),\ncould enable fault-tolerant quantum computing. However, what constitutes\nexperimental signatures of topological superconductivity and how MBS can be\ndetected remains strongly debated. In addition to spurious effects that mimic\nMBS, there is a challenge to discern the inherent topological signals in\nrealistic systems with many topologically-trivial Andreev bound states,\ndetermining the transport properties of Josephson junctions. Guided by the\nadvances in microwave spectroscopy, we theoretically study Al/InAs-based planar\nJosephson junction embedded into a radio-frequency superconducting quantum\ninterference device to identify microwave signatures of topological\nsuperconductivity. Remarkably, by exploring the closing and reopening of a\ntopological gap, we show that even in a wide planar Josephson junction with\nmany Andreev bound states, such a topological signature is distinguishable in\nthe resonance frequency shift of a microwave drive and the ``half-slope''\nfeature of the microwave absorption spectrum. Our findings provide an important\nstep towards experimental detection of non-Abelian statistics and implementing\nscalable topological quantum computing.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Superconductivity"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"16pIdybf_nM9_TmgmA1Bk0jOQe-yNPb5mNkSzbTW6T4","pdfSize":"29852095"}