{"id":"2407.18923","title":"Towards a Novel Privacy-Preserving Distributed Multiparty Data\n  Outsourcing Scheme for Cloud Computing with Quantum Key Distribution","authors":"D. Dhinakaran, D. Selvaraj, N. Dharini, S. Edwin Raja, C. Sakthi\n  Lakshmi Priya","authorsParsed":[["Dhinakaran","D.",""],["Selvaraj","D.",""],["Dharini","N.",""],["Raja","S. Edwin",""],["Priya","C. Sakthi Lakshmi",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 15:53:04 GMT"}],"updateDate":"2024-07-30","timestamp":1720540384000,"abstract":"  The intersection of cloud computing, blockchain technology, and the impending\nera of quantum computing presents a critical juncture for data security. This\nresearch addresses the escalating vulnerabilities by proposing a comprehensive\nframework that integrates Quantum Key Distribution (QKD), CRYSTALS Kyber, and\nZero-Knowledge Proofs (ZKPs) for securing data in cloud-based blockchain\nsystems. The primary objective is to fortify data against quantum threats\nthrough the implementation of QKD, a quantum-safe cryptographic protocol. We\nleverage the lattice-based cryptographic mechanism, CRYSTALS Kyber, known for\nits resilience against quantum attacks. Additionally, ZKPs are introduced to\nenhance data privacy and verification processes within the cloud and blockchain\nenvironment. A significant focus of this research is the performance evaluation\nof the proposed framework. Rigorous analyses encompass encryption and\ndecryption processes, quantum key generation rates, and overall system\nefficiency. Practical implications are scrutinized, considering factors such as\nfile size, response time, and computational overhead. The evaluation sheds\nlight on the framework's viability in real-world cloud environments,\nemphasizing its efficiency in mitigating quantum threats. The findings\ncontribute a robust quantum-safe and ZKP-integrated security framework tailored\nfor cloud-based blockchain storage. By addressing critical gaps in theoretical\nadvancements, this research offers practical insights for organizations seeking\nto secure their data against quantum threats. The framework's efficiency and\nscalability underscore its practical feasibility, serving as a guide for\nimplementing enhanced data security in the evolving landscape of quantum\ncomputing and blockchain integration within cloud environments.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"hVOD9KmdEXH5ItD3zwJ7Tc9rzI7oo8o0xJxHjER2jGk","pdfSize":"542218"}