{"id":"2407.17833","title":"Multicriteria Adjustable Regret Robust Optimization for Building Energy\n  Supply Design","authors":"Elisabeth Halser, Elisabeth Finhold, Neele Leith\\\"auser, Tobias\n  Seidel, Karl-Heinz K\\\"ufer","authorsParsed":[["Halser","Elisabeth",""],["Finhold","Elisabeth",""],["Leithäuser","Neele",""],["Seidel","Tobias",""],["Küfer","Karl-Heinz",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 07:45:23 GMT"}],"updateDate":"2024-07-26","timestamp":1721893523000,"abstract":"  Optimizing a building's energy supply design is a task with multiple\ncompeting criteria, where not only monetary but also, for example, an\nenvironmental objective shall be taken into account. Moreover, when deciding\nwhich storages and heating and cooling units to purchase\n(here-and-now-decisions), there is uncertainty about future developments of\nprices for energy, e.g. electricity and gas. This can be accounted for later by\noperating the units accordingly (wait-and-see-decisions), once the uncertainty\nrevealed itself. Therefore, the problem can be modeled as an adjustable robust\noptimization problem. We combine adjustable robustness and multicriteria\noptimization for the case of building energy supply design and solve the\nresulting problem using a column and constraint generation algorithm in\ncombination with an $\\varepsilon$-constraint approach.\n  In the multicriteria adjustable robust problem, we simultaneously minimize\nworst-case cost regret and carbon emissions. We take into account future price\nuncertainties and consider the results in the light of information gap decision\ntheory to find a trade-off between security against price fluctuations and\nover-conservatism. We present the model, a solution strategy and discuss\ndifferent application scenarios for a case study building.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"jCssrlNbkhTRjEvtEMzZN2zn8df3TlxF_g9tohdkqsE","pdfSize":"623912"}