{"id":"2407.17262","title":"Automated scheduler for the SOXS instrument: design and performance","authors":"Laura Asquini, Marco Landoni, Dave Young, Laurent Marty, Stephen J.\n  Smartt, Sergio Campana, Riccardo Claudi, Pietro Schipani, Jani Achren, Matteo\n  Aliverti, Jose A. Araiza Duran, Iair Arcavi, Federico Battaini, Andrea\n  Baruffolo, Sagi Ben Ami, Andrea Bianco, Alex Bichkovsky, Anna Brucalassi,\n  Rachel Bruch, Giulio Capasso, Enrico Cappellaro, Mirko Colapietro, Rosario\n  Cosentino, Francesco D\\'Alessio, Paolo D'Avanzo, Massimo Della Valle, Sergio\n  D'Orsi, Rosario Di Benedetto, Simone Di Filippo, Avishay Gal Yam, Matteo\n  Genoni, Marcos Hernandez, Ofir Hershko, Jari Kotilainen, Hanindyo\n  Kuncarayakti, Gianluca Li Causi, Seppo Mattila, Matteo Munari, Giorgio\n  Pariani, Hector Perez Ventura, Giuliano Pignata, Kalyan Radhakrishnan,\n  Michael Rappaport, Davide Ricci, Marco Riva, Adam Rubin, Bernardo Salasnich,\n  Salvatore Savarese, Maximilian Stritzinger, Salvatore Scuderi, Fabrizio\n  Vitali and Ricardo Zanmar Sanchez","authorsParsed":[["Asquini","Laura",""],["Landoni","Marco",""],["Young","Dave",""],["Marty","Laurent",""],["Smartt","Stephen J.",""],["Campana","Sergio",""],["Claudi","Riccardo",""],["Schipani","Pietro",""],["Achren","Jani",""],["Aliverti","Matteo",""],["Duran","Jose A. Araiza",""],["Arcavi","Iair",""],["Battaini","Federico",""],["Baruffolo","Andrea",""],["Ami","Sagi Ben",""],["Bianco","Andrea",""],["Bichkovsky","Alex",""],["Brucalassi","Anna",""],["Bruch","Rachel",""],["Capasso","Giulio",""],["Cappellaro","Enrico",""],["Colapietro","Mirko",""],["Cosentino","Rosario",""],["DÁlessio","Francesco",""],["D'Avanzo","Paolo",""],["Della Valle","Massimo",""],["D'Orsi","Sergio",""],["Di Benedetto","Rosario",""],["Di Filippo","Simone",""],["Yam","Avishay Gal",""],["Genoni","Matteo",""],["Hernandez","Marcos",""],["Hershko","Ofir",""],["Kotilainen","Jari",""],["Kuncarayakti","Hanindyo",""],["Causi","Gianluca Li",""],["Mattila","Seppo",""],["Munari","Matteo",""],["Pariani","Giorgio",""],["Ventura","Hector Perez",""],["Pignata","Giuliano",""],["Radhakrishnan","Kalyan",""],["Rappaport","Michael",""],["Ricci","Davide",""],["Riva","Marco",""],["Rubin","Adam",""],["Salasnich","Bernardo",""],["Savarese","Salvatore",""],["Stritzinger","Maximilian",""],["Scuderi","Salvatore",""],["Vitali","Fabrizio",""],["Sanchez","Ricardo Zanmar",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 13:26:00 GMT"},{"version":"v2","created":"Thu, 25 Jul 2024 14:05:13 GMT"}],"updateDate":"2024-07-26","timestamp":1721827560000,"abstract":"  We present the advancements in the development of the scheduler for the Son\nOf X-shooter instrument at the ESO-NTT 3.58-m telescope in La Silla, Chile.\nSOXS is designed as a single-object spectroscopic facility and features a\nhigh-efficiency spectrograph with two arms covering the spectral range of\n350-2000 nm and a mean resolving power of approximately R=4500. It will conduct\nUV-visible and near-infrared follow-up observations of astrophysical\ntransients, drawing from a broad pool of targets accessible through the\nstreaming services of wide-field telescopes, both current and future, as well\nas high-energy satellites. The instrument will cater to various scientific\nobjectives within the astrophysical community, each entailing specific\nrequirements for observation planning. SOXS will operate at the European\nSouthern Observatory (ESO) in La Silla, without the presence of astronomers on\nthe mountain. This poses a unique challenge for the scheduling process,\ndemanding a fully automated algorithm that is autonomously interacting with the\nappropriate databases and the La Silla Weather API, and is capable of\npresenting the operator not only with an ordered list of optimal targets (in\nterms of observing constraints) but also with optimal backups in the event of\nchanging weather conditions. This imposes the necessity for a scheduler with\nrapid-response capabilities without compromising the optimization process,\nensuring the high quality of observations and best use of the time at the\ntelescope. We thus developed a new highly available and scalable architecture,\nimplementing API Restful applications like Docker Containers, API Gateway, and\nPython-based Flask frameworks. We provide an overview of the current state of\nthe scheduler, which is now ready for the approaching on-site testing during\nCommissioning phase, along with insights into its web interface and preliminary\nperformance tests.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Y4qlMJOVrtcWeoTtk0huBfU-vX-qKs8nxF-N3S8QaqY","pdfSize":"665384"}