{"id":"2407.03231","title":"Dimensionality Engineering of Magnetic Anisotropy from Anomalous Hall\n  Effect in Synthetic SrRuO3 Crystals","authors":"Seung Gyo Jeong, Seong Won Cho, Sehwan Song, Jin Young Oh, Do Gyeom\n  Jeong, Gyeongtak Han, Hu Young Jeong, Ahmed Yousef Mohamed, Woo-suk Noh,\n  Sungkyun Park, Jong Seok Lee, Suyoun Lee, Young-Min Kim, Deok-Yong Cho, and\n  Woo Seok Choi","authorsParsed":[["Jeong","Seung Gyo",""],["Cho","Seong Won",""],["Song","Sehwan",""],["Oh","Jin Young",""],["Jeong","Do Gyeom",""],["Han","Gyeongtak",""],["Jeong","Hu Young",""],["Mohamed","Ahmed Yousef",""],["Noh","Woo-suk",""],["Park","Sungkyun",""],["Lee","Jong Seok",""],["Lee","Suyoun",""],["Kim","Young-Min",""],["Cho","Deok-Yong",""],["Choi","Woo Seok",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 15:59:47 GMT"}],"updateDate":"2024-07-04","timestamp":1720022387000,"abstract":"  Magnetic anisotropy in atomically thin correlated heterostructures is\nessential for exploring quantum magnetic phases for next-generation\nspintronics. Whereas previous studies have mostly focused on van der Waals\nsystems, here, we investigate the impact of dimensionality of epitaxially-grown\ncorrelated oxides down to the monolayer limit on structural, magnetic, and\norbital anisotropies. By designing oxide superlattices with a correlated\nferromagnetic SrRuO3 and nonmagnetic SrTiO3 layers, we observed modulated\nferromagnetic behavior with the change of the SrRuO3 thickness. Especially, for\nthree-unit-cell-thick layers, we observe a significant 1,500% improvement of\ncoercive field in the anomalous Hall effect, which cannot be solely attributed\nto the dimensional crossover in ferromagnetism. The atomic-scale\nheterostructures further reveal the systematic modulation of anisotropy for the\nlattice structure and orbital hybridization, explaining the enhanced magnetic\nanisotropy. Our findings provide valuable insights into engineering the\nanisotropic hybridization of synthetic magnetic crystals, offering a tunable\nspin order for various applications.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ddWL9cqhTWYNMTPY0oiWoElahhovpNcOWqsc66gCD4E","pdfSize":"1328748"}