{"id":"2407.07676","title":"Competing aggregation and iso-density equilibrium lead to band pattern\n  formation in density gradients","authors":"Felix Maurer (1), Camila Romero (1), Nikolas Lerch (1), Thomas John\n  (1), Lars Kaestner (1 and 2), Christian Wagner (1 and 3), Alexis Darras (1)\n  ((1) Experimental Physics, Saarland University, Saarbruecken, Germany, (2)\n  Department of Theoretical Medicine and Biosciences, Saarland University,\n  Homburg, Germany, (3) Physics and Materials Science Research Unit, University\n  of Luxembourg, Luxembourg)","authorsParsed":[["Maurer","Felix","","1 and 2"],["Romero","Camila","","1 and 2"],["Lerch","Nikolas","","1 and 2"],["John","Thomas","","1 and 2"],["Kaestner","Lars","","1 and 2"],["Wagner","Christian","","1 and 3"],["Darras","Alexis",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 14:04:51 GMT"}],"updateDate":"2024-07-11","timestamp":1720620291000,"abstract":"  Centrifugation of erythrocytes (aka Red Blood Cells, RBCs) in a self-forming\nPercoll gradient is a protocol often used as a way to sort RBCs by age.\nHowever, a pattern formation of discrete bands is systematically observed along\nthe continuous density gradient. Although early studies mentioned that\naggregation between cells might modify their spatial distribution, it is\ndebated whether a population with continuous density distribution can form\ndiscrete bands. Here, we develop a continuity equation, considering the\naggregation of cells with a continuous density distribution, which describes\nthe macroscopic evolution of the RBC volume concentration in a density\ngradient. The numerical solutions demonstrate that the competition between\niso-density distribution and aggregation is sufficient to create band patterns.\nOur model reproduces the temporal evolution observed in the conventional\nexperimental protocol, but also predicts several types of bifurcation-like\nbehaviors for the steady-state patterns in constant gradients, when the volume\nfraction and aggregation energy of the cells are varied. We threrefore\ndiscovered that the competition between RBC aggregation and iso-density\ndistribution is a novel physical mechanism leading to pattern formation.\n","subjects":["Condensed Matter/Soft Condensed Matter","Nonlinear Sciences/Adaptation and Self-Organizing Systems"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"MbNvmvreGo7WXvNNo6utAVynJLGQ1XMLpjU4DWo9iIU","pdfSize":"16646406"}