{"id":"2407.15051","title":"Prior Knowledge Integration via LLM Encoding and Pseudo Event Regulation\n  for Video Moment Retrieval","authors":"Yiyang Jiang and Wengyu Zhang and Xulu Zhang and Xiaoyong Wei and\n  Chang Wen Chen and Qing Li","authorsParsed":[["Jiang","Yiyang",""],["Zhang","Wengyu",""],["Zhang","Xulu",""],["Wei","Xiaoyong",""],["Chen","Chang Wen",""],["Li","Qing",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 04:39:06 GMT"},{"version":"v2","created":"Tue, 23 Jul 2024 03:51:43 GMT"},{"version":"v3","created":"Mon, 16 Sep 2024 12:01:22 GMT"}],"updateDate":"2024-09-17","timestamp":1721536746000,"abstract":"  In this paper, we investigate the feasibility of leveraging large language\nmodels (LLMs) for integrating general knowledge and incorporating pseudo-events\nas priors for temporal content distribution in video moment retrieval (VMR)\nmodels. The motivation behind this study arises from the limitations of using\nLLMs as decoders for generating discrete textual descriptions, which hinders\ntheir direct application to continuous outputs like salience scores and\ninter-frame embeddings that capture inter-frame relations. To overcome these\nlimitations, we propose utilizing LLM encoders instead of decoders. Through a\nfeasibility study, we demonstrate that LLM encoders effectively refine\ninter-concept relations in multimodal embeddings, even without being trained on\ntextual embeddings. We also show that the refinement capability of LLM encoders\ncan be transferred to other embeddings, such as BLIP and T5, as long as these\nembeddings exhibit similar inter-concept similarity patterns to CLIP\nembeddings. We present a general framework for integrating LLM encoders into\nexisting VMR architectures, specifically within the fusion module. Through\nexperimental validation, we demonstrate the effectiveness of our proposed\nmethods by achieving state-of-the-art performance in VMR. The source code can\nbe accessed at https://github.com/fletcherjiang/LLMEPET.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"01_BHGSdHmTAShX-ZSpPUB8NE66AEN513Rx8MQIuDi0","pdfSize":"11239637","objectId":"0x05ee20d5b8d0680dd4bd2b81fbd91c1f98a29eddaecf4e004ffe9ad7866d7419","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
