{"id":"2407.08356","title":"Event-based vision on FPGAs -- a survey","authors":"Tomasz Kryjak","authorsParsed":[["Kryjak","Tomasz",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 10:07:44 GMT"}],"updateDate":"2024-07-12","timestamp":1720692464000,"abstract":"  In recent years there has been a growing interest in event cameras, i.e.\nvision sensors that record changes in illumination independently for each\npixel. This type of operation ensures that acquisition is possible in very\nadverse lighting conditions, both in low light and high dynamic range, and\nreduces average power consumption. In addition, the independent operation of\neach pixel results in low latency, which is desirable for robotic solutions.\nNowadays, Field Programmable Gate Arrays (FPGAs), along with general-purpose\nprocessors (GPPs/CPUs) and programmable graphics processing units (GPUs), are\npopular architectures for implementing and accelerating computing tasks. In\nparticular, their usefulness in the embedded vision domain has been repeatedly\ndemonstrated over the past 30 years, where they have enabled fast data\nprocessing (even in real-time) and energy efficiency. Hence, the combination of\nevent cameras and reconfigurable devices seems to be a good solution,\nespecially in the context of energy-efficient real-time embedded systems. This\npaper gives an overview of the most important works, where FPGAs have been used\nin different contexts to process event data. It covers applications in the\nfollowing areas: filtering, stereovision, optical flow, acceleration of\nAI-based algorithms (including spiking neural networks) for object\nclassification, detection and tracking, and applications in robotics and\ninspection systems. Current trends and challenges for such systems are also\ndiscussed.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ojU_8hYw1cgsdG8mc5hIqXh_WBAF2eA-iZHeJmPmFJA","pdfSize":"348982"}