{"id":"2407.03070","title":"Federated Learning for Zero-Day Attack Detection in 5G and Beyond V2X\n  Networks","authors":"Abdelaziz Amara korba, Abdelwahab Boualouache, Bouziane Brik, Rabah\n  Rahal, Yacine Ghamri-Doudane, Sidi Mohammed Senouci","authorsParsed":[["korba","Abdelaziz Amara",""],["Boualouache","Abdelwahab",""],["Brik","Bouziane",""],["Rahal","Rabah",""],["Ghamri-Doudane","Yacine",""],["Senouci","Sidi Mohammed",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 12:42:31 GMT"}],"updateDate":"2024-07-04","timestamp":1720010551000,"abstract":"  Deploying Connected and Automated Vehicles (CAVs) on top of 5G and Beyond\nnetworks (5GB) makes them vulnerable to increasing vectors of security and\nprivacy attacks. In this context, a wide range of advanced machine/deep\nlearning based solutions have been designed to accurately detect security\nattacks. Specifically, supervised learning techniques have been widely applied\nto train attack detection models. However, the main limitation of such\nsolutions is their inability to detect attacks different from those seen during\nthe training phase, or new attacks, also called zero-day attacks. Moreover,\ntraining the detection model requires significant data collection and labeling,\nwhich increases the communication overhead, and raises privacy concerns. To\naddress the aforementioned limits, we propose in this paper a novel detection\nmechanism that leverages the ability of the deep auto-encoder method to detect\nattacks relying only on the benign network traffic pattern. Using federated\nlearning, the proposed intrusion detection system can be trained with large and\ndiverse benign network traffic, while preserving the CAVs privacy, and\nminimizing the communication overhead. The in-depth experiment on a recent\nnetwork traffic dataset shows that the proposed system achieved a high\ndetection rate while minimizing the false positive rate, and the detection\ndelay.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"fOBAJff4jLaeacQKCBhCKABHZ5_gOg3jELL0ohVhqUI","pdfSize":"446202"}