{"id":"2407.09836","title":"The worldsheet skein D-module and basic curves on Lagrangian fillings of\n  the Hopf link conormal","authors":"Tobias Ekholm, Pietro Longhi, Lukas Nakamura","authorsParsed":[["Ekholm","Tobias",""],["Longhi","Pietro",""],["Nakamura","Lukas",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 10:16:27 GMT"},{"version":"v2","created":"Tue, 16 Jul 2024 07:22:59 GMT"}],"updateDate":"2024-07-17","timestamp":1720865787000,"abstract":"  HOMFLYPT polynomials of knots in the 3-sphere in symmetric representations\nsatisfy recursion relations. Their geometric origin is holomorphic curves at\ninfinity on knot conormals that determine a $D$-module with characteristic\nvariety the Legendrian knot conormal augmention variety and with the recursion\nrelations as operator polynomial generators [arXiv:1304.5778,\narXiv:1803.04011]. We consider skein lifts of recursions and $D$-modules\ncorresponding to skein valued open curve counts [arXiv:1901.08027] that encode\nHOMFLYPT polynomials colored by arbitrary partitions. We define a worldsheet\nskein module which is the universal target for skein curve counts and a\ncorresponding $D$-module.\n  We then consider the concrete example of the Legendrian conormal of the Hopf\nlink. We show that the worldsheet skein $D$-module for the Hopf link conormal\nis generated by three operator polynomials that annihilate the skein valued\npartition function for any choice of Lagrangian filling and recursively\ndetermine it uniquely. We find Lagrangian fillings for any point in the\naugmentation variety and show that their skein valued partition functions admit\nquiver-like expansions where all holomorphic curves are generated by a small\nnumber of basic holomorphic disks and annuli and their multiple covers.\n","subjects":["Computing Research Repository/Artificial Intelligence","Physics/High Energy Physics - Theory","Mathematics/Geometric Topology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"TjXjyEUlxcRatiPw0po5ouxL7avTHr1Bmvm9BfbWifE","pdfSize":"1286751"}