{"id":"2407.13831","title":"Living at the Edge: A Critical Look at the Cosmological Neutrino Mass\n  Bound","authors":"Daniel Naredo-Tuero, Miguel Escudero, Enrique Fern\\'andez-Mart\\'inez,\n  Xabier Marcano, Vivian Poulin","authorsParsed":[["Naredo-Tuero","Daniel",""],["Escudero","Miguel",""],["Fernández-Martínez","Enrique",""],["Marcano","Xabier",""],["Poulin","Vivian",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 18:05:32 GMT"}],"updateDate":"2024-07-22","timestamp":1721325932000,"abstract":"  Cosmological neutrino mass bounds are becoming increasingly stringent. The\nlatest limit within $\\Lambda$CDM from Planck 2018+ACT lensing+DESI is $\\sum\nm_\\nu < 0.072\\,{\\rm eV}$ at 95% CL, very close to the minimum possible sum of\nneutrino masses ($\\sum m_\\nu > 0.06\\,{\\rm eV}$), hinting at vanishing or even\n''negative'' cosmological neutrino masses. In this context, it is urgent to\ncarefully evaluate the origin of these cosmological constraints. In this paper,\nwe investigate the robustness of these results in three ways: i) we check the\nrole of potential anomalies in Planck CMB and DESI BAO data; ii) we compare the\nresults for frequentist and Bayesian techniques, as very close to physical\nboundaries subtleties in the derivation and interpretation of constraints can\narise; iii) we investigate how deviations from $\\Lambda$CDM, potentially\nalleviating these anomalies, can alter the constraints. From a profile\nlikelihood analysis, we derive constraints in agreement at the $\\sim 10\\%$\nlevel with Bayesian posteriors. We find that the weak preference for negative\nneutrino masses is mostly present for Planck 18 data, affected by the\nwell-known `lensing anomaly'. It disappears when the new Planck 2020 HiLLiPoP\nis used, leading to significantly weaker constraints. Additionally, the pull\ntowards negative masses in DESI data stems from the $z=0.7$ bin, which is in\n$\\sim 3\\sigma$ tension with Planck expectations. Without these outliers, and in\ncombination with HiLLiPoP, the bound relaxes to $\\sum m_\\nu < 0.11\\,{\\rm eV}$\nat 95% CL. The recent preference for dynamical dark energy alleviates this\ntension and further weakens the bound. As we are at the dawn of a neutrino mass\ndiscovery from cosmology, it will be very exciting to see if this trend is\nconfirmed by future data.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/High Energy Physics - Experiment","Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"I7L2c6pnx2wkONBh8CzmleGdG7nGKjhIb2RZjMA0S08","pdfSize":"1995681"}