{"id":"2407.16999","title":"SepsisLab: Early Sepsis Prediction with Uncertainty Quantification and\n  Active Sensing","authors":"Changchang Yin, Pin-Yu Chen, Bingsheng Yao, Dakuo Wang, Jeffrey\n  Caterino, Ping Zhang","authorsParsed":[["Yin","Changchang",""],["Chen","Pin-Yu",""],["Yao","Bingsheng",""],["Wang","Dakuo",""],["Caterino","Jeffrey",""],["Zhang","Ping",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 04:47:36 GMT"}],"updateDate":"2024-07-25","timestamp":1721796456000,"abstract":"  Sepsis is the leading cause of in-hospital mortality in the USA. Early sepsis\nonset prediction and diagnosis could significantly improve the survival of\nsepsis patients. Existing predictive models are usually trained on high-quality\ndata with few missing information, while missing values widely exist in\nreal-world clinical scenarios (especially in the first hours of admissions to\nthe hospital), which causes a significant decrease in accuracy and an increase\nin uncertainty for the predictive models. The common method to handle missing\nvalues is imputation, which replaces the unavailable variables with estimates\nfrom the observed data. The uncertainty of imputation results can be propagated\nto the sepsis prediction outputs, which have not been studied in existing works\non either sepsis prediction or uncertainty quantification. In this study, we\nfirst define such propagated uncertainty as the variance of prediction output\nand then introduce uncertainty propagation methods to quantify the propagated\nuncertainty. Moreover, for the potential high-risk patients with low confidence\ndue to limited observations, we propose a robust active sensing algorithm to\nincrease confidence by actively recommending clinicians to observe the most\ninformative variables. We validate the proposed models in both publicly\navailable data (i.e., MIMIC-III and AmsterdamUMCdb) and proprietary data in The\nOhio State University Wexner Medical Center (OSUWMC). The experimental results\nshow that the propagated uncertainty is dominant at the beginning of admissions\nto hospitals and the proposed algorithm outperforms state-of-the-art active\nsensing methods. Finally, we implement a SepsisLab system for early sepsis\nprediction and active sensing based on our pre-trained models. Clinicians and\npotential sepsis patients can benefit from the system in early prediction and\ndiagnosis of sepsis.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"wnUZuXyot_ZbnLHPaLv9cHMWn-cVOKKfRSbRFy9G_OM","pdfSize":"3393027"}