{"id":"2407.14958","title":"Temporal Residual Jacobians For Rig-free Motion Transfer","authors":"Sanjeev Muralikrishnan, Niladri Shekhar Dutt, Siddhartha Chaudhuri,\n  Noam Aigerman, Vladimir Kim, Matthew Fisher, Niloy J. Mitra","authorsParsed":[["Muralikrishnan","Sanjeev",""],["Dutt","Niladri Shekhar",""],["Chaudhuri","Siddhartha",""],["Aigerman","Noam",""],["Kim","Vladimir",""],["Fisher","Matthew",""],["Mitra","Niloy J.",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 18:29:22 GMT"}],"updateDate":"2024-07-23","timestamp":1721500162000,"abstract":"  We introduce Temporal Residual Jacobians as a novel representation to enable\ndata-driven motion transfer. Our approach does not assume access to any rigging\nor intermediate shape keyframes, produces geometrically and temporally\nconsistent motions, and can be used to transfer long motion sequences. Central\nto our approach are two coupled neural networks that individually predict local\ngeometric and temporal changes that are subsequently integrated, spatially and\ntemporally, to produce the final animated meshes. The two networks are jointly\ntrained, complement each other in producing spatial and temporal signals, and\nare supervised directly with 3D positional information. During inference, in\nthe absence of keyframes, our method essentially solves a motion extrapolation\nproblem. We test our setup on diverse meshes (synthetic and scanned shapes) to\ndemonstrate its superiority in generating realistic and natural-looking\nanimations on unseen body shapes against SoTA alternatives. Supplemental video\nand code are available at https://temporaljacobians.github.io/ .\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Graphics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"GK-A-FkXKILrTO-NGnaAWrIbWCh5s_PKCXWPQsJkJnw","pdfSize":"30721094","objectId":"0x8fed2d9ebf5aef9ee3cb2d4c5d1dfc029577bc16ea507b1c48fa357cb4badbe9","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
