{"id":"2407.04482","title":"Controlling Whisper: Universal Acoustic Adversarial Attacks to Control\n  Speech Foundation Models","authors":"Vyas Raina and Mark Gales","authorsParsed":[["Raina","Vyas",""],["Gales","Mark",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 13:04:31 GMT"}],"updateDate":"2024-07-08","timestamp":1720184671000,"abstract":"  Speech enabled foundation models, either in the form of flexible speech\nrecognition based systems or audio-prompted large language models (LLMs), are\nbecoming increasingly popular. One of the interesting aspects of these models\nis their ability to perform tasks other than automatic speech recognition (ASR)\nusing an appropriate prompt. For example, the OpenAI Whisper model can perform\nboth speech transcription and speech translation. With the development of\naudio-prompted LLMs there is the potential for even greater control options. In\nthis work we demonstrate that with this greater flexibility the systems can be\nsusceptible to model-control adversarial attacks. Without any access to the\nmodel prompt it is possible to modify the behaviour of the system by\nappropriately changing the audio input. To illustrate this risk, we demonstrate\nthat it is possible to prepend a short universal adversarial acoustic segment\nto any input speech signal to override the prompt setting of an ASR foundation\nmodel. Specifically, we successfully use a universal adversarial acoustic\nsegment to control Whisper to always perform speech translation, despite being\nset to perform speech transcription. Overall, this work demonstrates a new form\nof adversarial attack on multi-tasking speech enabled foundation models that\nneeds to be considered prior to the deployment of this form of model.\n","subjects":["Computing Research Repository/Sound","Computing Research Repository/Computation and Language","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"cS2bmMxo3-EwMdwwEN_vZ4TgMtdWrsVkKeG9fmKQono","pdfSize":"567850"}