{"id":"2407.00784","title":"CSUM: A Novel Mechanism for Updating CubeSat while Preserving\n  Authenticity and Integrity","authors":"Ankit Gangwal, Aashish Paliwal","authorsParsed":[["Gangwal","Ankit",""],["Paliwal","Aashish",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 18:01:37 GMT"}],"updateDate":"2024-07-02","timestamp":1719770497000,"abstract":"  The recent rise of CubeSat has revolutionized global space explorations, as\nit offers cost-effective solutions for low-orbit space applications (including\nclimate monitoring, weather measurements, communications, and earth\nobservation). A salient feature of CubeSat is that applications currently\non-boarded can either be updated or entirely replaced by new applications via\nsoftware updates, which allows reusing in-orbit hardware, reduces space debris,\nand saves cost as well as time. Securing software updates employing traditional\nmethods (e.g., encryption) remains impractical mainly due to the low-resource\ncapabilities of CubeSat. Therefore, the security of software updates for\nCubeSats remains a critical issue.\n  In this paper, we propose CubeSat Update Mechanism (CSUM), a lightweight\nscheme to provide integrity, authentication, and data freshness guarantees for\nsoftware update broadcasts to CubeSats using a hash chain. We empirically\nevaluate our proof of concept implementation to demonstrate the feasibility and\neffectiveness of our approach. CSUM can validate 50,000 consecutive updates\nsuccessfully in less than a second. We also perform a comparative analysis of\ndifferent cryptographic primitives. Our empirical evaluations show that the\nhash-based approach is at least 61$\\times$ faster than the conventional\nmechanisms, even in resource-constrained environments. Finally, we discuss the\nlimitations, challenges, and potential future research directions for CubeSat\nsoftware update procedures.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"vWHkQ6NthZ3RBquEWwJPKpII2ptM5deFz-9EnDSZ2KM","pdfSize":"975714"}