{"id":"2407.02386","title":"OpenSlot: Mixed Open-set Recognition with Object-centric Learning","authors":"Xu Yin, Fei Pan, Guoyuan An, Yuchi Huo, Zixuan Xie and Sung-Eui Yoon","authorsParsed":[["Yin","Xu",""],["Pan","Fei",""],["An","Guoyuan",""],["Huo","Yuchi",""],["Xie","Zixuan",""],["Yoon","Sung-Eui",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 16:00:55 GMT"}],"updateDate":"2024-07-03","timestamp":1719936055000,"abstract":"  Existing open-set recognition (OSR) studies typically assume that each image\ncontains only one class label, and the unknown test set (negative) has a\ndisjoint label space from the known test set (positive), a scenario termed\nfull-label shift. This paper introduces the mixed OSR problem, where test\nimages contain multiple class semantics, with known and unknown classes\nco-occurring in negatives, leading to a more challenging super-label shift.\nAddressing the mixed OSR requires classification models to accurately\ndistinguish different class semantics within images and measure their\n\"knowness\". In this study, we propose the OpenSlot framework, built upon\nobject-centric learning. OpenSlot utilizes slot features to represent diverse\nclass semantics and produce class predictions. Through our proposed\nanti-noise-slot (ANS) technique, we mitigate the impact of noise (invalid and\nbackground) slots during classification training, effectively addressing the\nsemantic misalignment between class predictions and the ground truth. We\nconduct extensive experiments with OpenSlot on mixed & conventional OSR\nbenchmarks. Without elaborate designs, OpenSlot not only exceeds existing OSR\nstudies in detecting super-label shifts across single & multi-label mixed OSR\ntasks but also achieves state-of-the-art performance on conventional\nbenchmarks. Remarkably, our method can localize class objects without using\nbounding boxes during training. The competitive performance in open-set object\ndetection demonstrates OpenSlot's ability to explicitly explain label shifts\nand benefits in computational efficiency and generalization.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"i7wb4ZLArssc4cSECStP7oJ4KkYdT7E-hYC2hfI8520","pdfSize":"1733925"}