{"id":"2407.13463","title":"End-To-End Clinical Trial Matching with Large Language Models","authors":"Dyke Ferber, Lars Hilgers, Isabella C. Wiest, Marie-Elisabeth\n  Le{\\ss}mann, Jan Clusmann, Peter Neidlinger, Jiefu Zhu, Georg W\\\"olflein,\n  Jacqueline Lammert, Maximilian Tschochohei, Heiko B\\\"ohme, Dirk J\\\"ager,\n  Mihaela Aldea, Daniel Truhn, Christiane H\\\"oper, Jakob Nikolas Kather","authorsParsed":[["Ferber","Dyke",""],["Hilgers","Lars",""],["Wiest","Isabella C.",""],["Leßmann","Marie-Elisabeth",""],["Clusmann","Jan",""],["Neidlinger","Peter",""],["Zhu","Jiefu",""],["Wölflein","Georg",""],["Lammert","Jacqueline",""],["Tschochohei","Maximilian",""],["Böhme","Heiko",""],["Jäger","Dirk",""],["Aldea","Mihaela",""],["Truhn","Daniel",""],["Höper","Christiane",""],["Kather","Jakob Nikolas",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 12:36:26 GMT"}],"updateDate":"2024-07-19","timestamp":1721306186000,"abstract":"  Matching cancer patients to clinical trials is essential for advancing\ntreatment and patient care. However, the inconsistent format of medical free\ntext documents and complex trial eligibility criteria make this process\nextremely challenging and time-consuming for physicians. We investigated\nwhether the entire trial matching process - from identifying relevant trials\namong 105,600 oncology-related clinical trials on clinicaltrials.gov to\ngenerating criterion-level eligibility matches - could be automated using Large\nLanguage Models (LLMs). Using GPT-4o and a set of 51 synthetic Electronic\nHealth Records (EHRs), we demonstrate that our approach identifies relevant\ncandidate trials in 93.3% of cases and achieves a preliminary accuracy of 88.0%\nwhen matching patient-level information at the criterion level against a\nbaseline defined by human experts. Utilizing LLM feedback reveals that 39.3%\ncriteria that were initially considered incorrect are either ambiguous or\ninaccurately annotated, leading to a total model accuracy of 92.7% after\nrefining our human baseline. In summary, we present an end-to-end pipeline for\nclinical trial matching using LLMs, demonstrating high precision in screening\nand matching trials to individual patients, even outperforming the performance\nof qualified medical doctors. Our fully end-to-end pipeline can operate\nautonomously or with human supervision and is not restricted to oncology,\noffering a scalable solution for enhancing patient-trial matching in real-world\nsettings.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"Pbyw3rUeOTfEKB6_ZUNyEqX8DMHNsuZFWfk4JxWrQgQ","pdfSize":"3259184"}