{"id":"2407.09541","title":"MATE: Meet At The Embedding -- Connecting Images with Long Texts","authors":"Young Kyun Jang, Junmo Kang, Yong Jae Lee, Donghyun Kim","authorsParsed":[["Jang","Young Kyun",""],["Kang","Junmo",""],["Lee","Yong Jae",""],["Kim","Donghyun",""]],"versions":[{"version":"v1","created":"Wed, 26 Jun 2024 14:10:00 GMT"}],"updateDate":"2024-07-16","timestamp":1719411000000,"abstract":"  While advancements in Vision Language Models (VLMs) have significantly\nimproved the alignment of visual and textual data, these models primarily focus\non aligning images with short descriptive captions. This focus limits their\nability to handle complex text interactions, particularly with longer texts\nsuch as lengthy captions or documents, which have not been extensively explored\nyet. In this paper, we introduce Meet At The Embedding (MATE), a novel approach\nthat combines the capabilities of VLMs with Large Language Models (LLMs) to\novercome this challenge without the need for additional image-long text pairs.\nSpecifically, we replace the text encoder of the VLM with a pretrained\nLLM-based encoder that excels in understanding long texts. To bridge the gap\nbetween VLM and LLM, MATE incorporates a projection module that is trained in a\nmulti-stage manner. It starts by aligning the embeddings from the VLM text\nencoder with those from the LLM using extensive text pairs. This module is then\nemployed to seamlessly align image embeddings closely with LLM embeddings. We\npropose two new cross-modal retrieval benchmarks to assess the task of\nconnecting images with long texts (lengthy captions / documents). Extensive\nexperimental results demonstrate that MATE effectively connects images with\nlong texts, uncovering diverse semantic relationships.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"m0ejnb0ddSASt6ioSJm-1jEQJWTyPuDMQfhvAD8LFbE","pdfSize":"3376050"}