{"id":"2407.17474","title":"\"My Kind of Woman\": Analysing Gender Stereotypes in AI through The\n  Averageness Theory and EU Law","authors":"Miriam Doh and and Anastasia Karagianni","authorsParsed":[["Doh","Miriam",""],["Karagianni","and Anastasia",""]],"versions":[{"version":"v1","created":"Thu, 27 Jun 2024 20:03:27 GMT"}],"updateDate":"2024-07-26","timestamp":1719518607000,"abstract":"  This study delves into gender classification systems, shedding light on the\ninteraction between social stereotypes and algorithmic determinations. Drawing\non the \"averageness theory,\" which suggests a relationship between a face's\nattractiveness and the human ability to ascertain its gender, we explore the\npotential propagation of human bias into artificial intelligence (AI) systems.\nUtilising the AI model Stable Diffusion 2.1, we have created a dataset\ncontaining various connotations of attractiveness to test whether the\ncorrelation between attractiveness and accuracy in gender classification\nobserved in human cognition persists within AI. Our findings indicate that akin\nto human dynamics, AI systems exhibit variations in gender classification\naccuracy based on attractiveness, mirroring social prejudices and stereotypes\nin their algorithmic decisions. This discovery underscores the critical need to\nconsider the impacts of human perceptions on data collection and highlights the\nnecessity for a multidisciplinary and intersectional approach to AI development\nand AI data training. By incorporating cognitive psychology and feminist legal\ntheory, we examine how data used for AI training can foster gender diversity\nand fairness under the scope of the AI Act and GDPR, reaffirming how\npsychological and feminist legal theories can offer valuable insights for\nensuring the protection of gender equality and non-discrimination in AI\nsystems.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8PI8V3LT4R4YgRnMYVM2evREkIHxsbBxVPRnZB898LM","pdfSize":"2372293"}