{"id":"2407.09330","title":"Enhance students learning outcomes by redesigning individual learning\n  activities into group activities for introductory level Physics courses","authors":"Kalani Hettiarachchilage and Neel Haldolaarachchige","authorsParsed":[["Hettiarachchilage","Kalani",""],["Haldolaarachchige","Neel",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 15:08:03 GMT"}],"updateDate":"2024-07-15","timestamp":1720796883000,"abstract":"  The evolution of science education is a dynamic process driven by advances in\npedagogy, technology, and especially, our understanding of how students learn.\nEducators are exploring innovative teaching and learning methodologies such as\nactive learning, incorporated technology, interdisciplinary approach, flipped\nclassrooms, personalized teaching, and many more. The goal of all these\nevolving methodologies is to empower students with not only a strong foundation\nin scientific knowledge but also with the skills and mindset required to thrive\nin the future world. By adopting these innovative approaches, educators can\nhelp students become effective problem solvers, critical thinkers, and life\nlearning citizens. Our focus is redesigning individual student learning\nactivities into group learning activities that will benefit various ways of\neducation by building each others support, connection, and communication.\nUnloading individual homework and loading in-class group work during a\nsynchronous classroom setting will benefit all levels of learnings effectively.\nAssigning most of the classwork to be completed during class time has potential\nbenefits since students are more likely to be engaged and focused individually\nand jointly by sharing and communicating subject matter effectively. We are\ndiscussing how to facilitate the group work effectively by creating group\nassignments for personalized classrooms, setting specific rules and class\nethics to follow for the best learning practice, imposing a list of roles to\neach group member, introducing a list of ground rules related to justice,\nequity, and diversity inclusion (JDEI) within the group. The students\nperformances, progress and effectiveness are analyzed and compared.\n","subjects":["Physics/Physics Education"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"DklIYNjn9mGAkStTE8IQsfnBDpug147e4ensgpU2uNQ","pdfSize":"722691"}