{"id":"2407.17477","title":"Toward Automated Detection of Biased Social Signals from the Content of\n  Clinical Conversations","authors":"Feng Chen, Manas Satish Bedmutha, Ray-Yuan Chung, Janice Sabin, Wanda\n  Pratt, Brian R. Wood, Nadir Weibel, Andrea L. Hartzler, Trevor Cohen","authorsParsed":[["Chen","Feng",""],["Bedmutha","Manas Satish",""],["Chung","Ray-Yuan",""],["Sabin","Janice",""],["Pratt","Wanda",""],["Wood","Brian R.",""],["Weibel","Nadir",""],["Hartzler","Andrea L.",""],["Cohen","Trevor",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 17:20:37 GMT"},{"version":"v2","created":"Tue, 30 Jul 2024 18:47:31 GMT"}],"updateDate":"2024-08-01","timestamp":1719854437000,"abstract":"  Implicit bias can impede patient-provider interactions and lead to inequities\nin care. Raising awareness is key to reducing such bias, but its manifestations\nin the social dynamics of patient-provider communication are difficult to\ndetect. In this study, we used automated speech recognition (ASR) and natural\nlanguage processing (NLP) to identify social signals in patient-provider\ninteractions. We built an automated pipeline to predict social signals from\naudio recordings of 782 primary care visits that achieved 90.1% average\naccuracy across codes, and exhibited fairness in its predictions for white and\nnon-white patients. Applying this pipeline, we identified statistically\nsignificant differences in provider communication behavior toward white versus\nnon-white patients. In particular, providers expressed more patient-centered\nbehaviors towards white patients including more warmth, engagement, and\nattentiveness. Our study underscores the potential of automated tools in\nidentifying subtle communication signals that may be linked with bias and\nimpact healthcare quality and equity.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Computation and Language","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_P5lqk8am8ne3tjQps6OxEZ4o4rYPTn2TXaU2LPdkFU","pdfSize":"518018","objectId":"0x2255dfa2f08f19d70f1eeab7ae7ae6c61e5b8a38de8073cbdb04ce00444630de","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
