{"id":"2407.21598","title":"Advancing quantum technology workforce: industry insights into\n  qualification and training needs","authors":"Franziska Greinert, Malte S. Ubben, Ismet N. Dogan, Dagmar\n  Hilfert-R\\\"uppell and Rainer M\\\"uller","authorsParsed":[["Greinert","Franziska",""],["Ubben","Malte S.",""],["Dogan","Ismet N.",""],["Hilfert-Rüppell","Dagmar",""],["Müller","Rainer",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 13:33:27 GMT"}],"updateDate":"2024-08-01","timestamp":1722432807000,"abstract":"  The transition of second-generation quantum technologies from a research\ntopic to a topic of industrial relevance has led to a growing number of quantum\ncompanies and companies that are exploring quantum technologies. Examples would\ninclude a start-up building a quantum key distribution device, a large company\nworking on integrating a quantum sensing core into a product, or a company\nproviding quantum computing consultancy. They all face different challenges and\nneeds in terms of building their quantum workforce and training in quantum\nconcepts, technologies and how to derive value from them.\n  With the study documented in this paper, we aim to identify these needs and\nprovide a picture of the industry's requirements in terms of workforce\ndevelopment and (external) training and materials. We discuss, for example, the\nshortage of engineers and jobs relevant to the quantum industry, the challenge\nof getting people interested in quantum, and the need for training at different\nlevels and in different formats - from awareness raising and self-learning\nmaterials to university courses in quantum systems engineering. The findings\nare based on 34 semi-structured interviews with industry representatives and a\nfollow-up questionnaire to validate some of the issues raised in the\ninterviews. These results have influenced activities in EU projects, including\nan update of the European Competence Framework for Quantum Technologies.\n","subjects":["Physics/Physics Education"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"edPx6J04R7skHuF-GLqD8l-AuVhwjuW8TurHlOsaZMs","pdfSize":"3809730"}