{"id":"2407.16002","title":"Stress Engineering of Thermal Fluctuation of Magnetization and Noise\n  Spectra in Low Barrier Nanomagnets Used as Analog and Binary Stochastic\n  Neurons","authors":"Rahnuma Rahman and Supriyo Bandyopadhyay","authorsParsed":[["Rahman","Rahnuma",""],["Bandyopadhyay","Supriyo",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 19:17:55 GMT"}],"updateDate":"2024-07-24","timestamp":1721675875000,"abstract":"  A single-domain nanomagnet, shaped like a thin elliptical disk with small\neccentricity, has a double well potential profile with two degenerate energy\nminima separated by a small barrier of a few kT (k = Boltzmann constant and T =\nabsolute temperature). The two minima correspond to the magnetization pointing\nalong the two mutually anti-parallel directions along the major axis. At room\ntemperature, the magnetization fluctuates between the two minima mimicking\ntelegraph noise. This makes the nanomagnet act as a \"binary\" stochastic neuron\n(BSN) with the neuronal state encoded in the magnetization orientation. If the\nnanomagnet is magnetostrictive, then the barrier can be depressed further by\napplying (electrically generated) uniaxial stress along the ellipse's major\naxis, thereby gradually eroding the double well shape. When the barrier almost\nvanishes, the magnetization begins to randomly assume any arbitrary orientation\n(not just along the major axis), making the nanomagnet act as an \"analog\"\nstochastic neuron (ASN). The magnetization fluctuation then begins to\nincreasingly resemble white noise. The full-width-at-half-maximum (FWHM) of the\nnoise auto-correlation function decreases with increasing stress, as the\nfluctuation gradually transforms from telegraph noise to white noise. The noise\nspectral density exhibits a 1/f^(beta) spectrum (at high frequencies) with\n\"beta\" decreasing with increasing stress, which is again characteristic of the\ntransition from telegraph to white noise. Stress can thus not only reconfigure\na BSN to an ASN, which has its own applications, but it can also perform \"noise\nengineering\", i.e., tune the auto-correlation function and power spectral\ndensity. That can have applications in signal processing.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"J0mDF2GVokmTnoO29NXAWcoLsmF-JCfqtU1tRnKtJLM","pdfSize":"1769578"}