{"id":"2407.11921","title":"IPA-NeRF: Illusory Poisoning Attack Against Neural Radiance Fields","authors":"Wenxiang Jiang, Hanwei Zhang, Shuo Zhao, Zhongwen Guo, Hao Wang","authorsParsed":[["Jiang","Wenxiang",""],["Zhang","Hanwei",""],["Zhao","Shuo",""],["Guo","Zhongwen",""],["Wang","Hao",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 17:11:43 GMT"},{"version":"v2","created":"Thu, 18 Jul 2024 16:10:19 GMT"}],"updateDate":"2024-07-19","timestamp":1721149903000,"abstract":"  Neural Radiance Field (NeRF) represents a significant advancement in computer\nvision, offering implicit neural network-based scene representation and novel\nview synthesis capabilities. Its applications span diverse fields including\nrobotics, urban mapping, autonomous navigation, virtual reality/augmented\nreality, etc., some of which are considered high-risk AI applications. However,\ndespite its widespread adoption, the robustness and security of NeRF remain\nlargely unexplored. In this study, we contribute to this area by introducing\nthe Illusory Poisoning Attack against Neural Radiance Fields (IPA-NeRF). This\nattack involves embedding a hidden backdoor view into NeRF, allowing it to\nproduce predetermined outputs, i.e. illusory, when presented with the specified\nbackdoor view while maintaining normal performance with standard inputs. Our\nattack is specifically designed to deceive users or downstream models at a\nparticular position while ensuring that any abnormalities in NeRF remain\nundetectable from other viewpoints. Experimental results demonstrate the\neffectiveness of our Illusory Poisoning Attack, successfully presenting the\ndesired illusory on the specified viewpoint without impacting other views.\nNotably, we achieve this attack by introducing small perturbations solely to\nthe training set. The code can be found at\nhttps://github.com/jiang-wenxiang/IPA-NeRF.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"SBBOhdxdurgGGni5Yk1e012Zk46dwRx2ZH0Ylrhf3Nc","pdfSize":"32717049"}