{"id":"2407.15900","title":"Improving probabilistic forecasts of extreme wind speeds by training\n  statistical post-processing models with weighted scoring rules","authors":"Jakob Benjamin Wessel, Christopher A. T. Ferro, Gavin R. Evans, Frank\n  Kwasniok","authorsParsed":[["Wessel","Jakob Benjamin",""],["Ferro","Christopher A. T.",""],["Evans","Gavin R.",""],["Kwasniok","Frank",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 11:07:52 GMT"},{"version":"v2","created":"Thu, 25 Jul 2024 10:39:15 GMT"}],"updateDate":"2024-07-26","timestamp":1721646472000,"abstract":"  Accurate forecasts of extreme wind speeds are of high importance for many\napplications. Such forecasts are usually generated by ensembles of numerical\nweather prediction (NWP) models, which however can be biased and have errors in\ndispersion, thus necessitating the application of statistical post-processing\ntechniques. In this work we aim to improve statistical post-processing models\nfor probabilistic predictions of extreme wind speeds. We do this by adjusting\nthe training procedure used to fit ensemble model output statistics (EMOS)\nmodels - a commonly applied post-processing technique - and propose estimating\nparameters using the so-called threshold-weighted continuous ranked probability\nscore (twCRPS), a proper scoring rule that places special emphasis on\npredictions over a threshold. We show that training using the twCRPS leads to\nimproved extreme event performance of post-processing models for a variety of\nthresholds. We find a distribution body-tail trade-off where improved\nperformance for probabilistic predictions of extreme events comes with worse\nperformance for predictions of the distribution body. However, we introduce\nstrategies to mitigate this trade-off based on weighted training and linear\npooling. Finally, we consider some synthetic experiments to explain the\ntraining impact of the twCRPS and derive closed-form expressions of the twCRPS\nfor a number of distributions, giving the first such collection in the\nliterature. The results will enable researchers and practitioners alike to\nimprove the performance of probabilistic forecasting models for extremes and\nother events of interest.\n","subjects":["Computing Research Repository/Machine Learning","Statistics/Applications"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"VP2zE4c2uJ6XBFybmHV8wq2zmNOElKD59C99YQE3CJ4","pdfSize":"3179756"}