{"id":"2407.08319","title":"Telescope control software and proto-model siderostat for the SDSS-V\n  Local Volume Mapper","authors":"Hojae Ahn (1), Florian Briegel (2), Jimin Han (1), Mingyu Jeon (1),\n  Thomas M. Herbst (2), Sumin Lee (1), Woojin Park (3), Sunwoo Lee (1), Inhwan\n  Jung (4), Tae-Geun Ji (1), Changgon Kim (1), Geon Hee Kim (5), Wolfgang\n  Gaessler (2), Markus Kuhlberg (2), Hyun Chul Park (6), Soojong Pak (1),\n  Nicholas P. Konidaris (7), Niv Drory (8), Jos\\'e R. S\\'anchez-Gallego (9),\n  Cynthia S. Froning (8), Solange Ramirez (7), Juna A. Kollmeier (7) ((1)\n  School of space research, Kyung Hee University, Yongin, Republic of Korea,\n  (2) Max Planck Institute for Astronomy, Heidelberg, Germany, (3) Korea\n  Astronomy and Space Science Institute, Daejeon, Republic of Korea, (4)\n  Graduate school of Physics Education, Kyung Hee University, Seoul, Republic\n  of Korea, (5) Hanbat University, Daejeon, Republic of Korea, (6) Konkuk\n  University, Seoul, Republic of Korea, (7) Carnegie Institution for Science,\n  CA, USA, (8) The University of Texas at Austin, TX, USA, (9) University of\n  Washington, Seattle WA, USA)","authorsParsed":[["Ahn","Hojae",""],["Briegel","Florian",""],["Han","Jimin",""],["Jeon","Mingyu",""],["Herbst","Thomas M.",""],["Lee","Sumin",""],["Park","Woojin",""],["Lee","Sunwoo",""],["Jung","Inhwan",""],["Ji","Tae-Geun",""],["Kim","Changgon",""],["Kim","Geon Hee",""],["Gaessler","Wolfgang",""],["Kuhlberg","Markus",""],["Park","Hyun Chul",""],["Pak","Soojong",""],["Konidaris","Nicholas P.",""],["Drory","Niv",""],["Sánchez-Gallego","José R.",""],["Froning","Cynthia S.",""],["Ramirez","Solange",""],["Kollmeier","Juna A.",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 09:09:26 GMT"}],"updateDate":"2024-07-12","timestamp":1720688966000,"abstract":"  The fifth Sloan Digital Sky Survey (SDSS-V) Local Volume Mapper (LVM) is a\nwide-field integral field unit (IFU) survey that uses an array of four 160 mm\nfixed telescopes with siderostats to minimize the number of moving parts.\nIndividual telescope observes the science field or calibration field\nindependently and is synchronized with the science exposure. We developed the\nLVM Acquisition and Guiding Package (LVMAGP) optimized telescope control\nsoftware program for LVM observations, which can simultaneously control four\nfocusers, three K-mirrors, one fiber selector, four mounts (siderostats), and\nseven guide cameras. This software is built on a hierarchical architecture and\nthe SDSS framework and provides three key sequences: autofocus, field\nacquisition, and autoguide. We designed and fabricated a proto-model siderostat\nto test the telescope pointing model and LVMAGP software. The mirrors of the\nproto-model were designed as an isogrid open-back type, which reduced the\nweight by 46% and enabled reaching thermal equilibrium quickly. Additionally,\ndeflection due to bolting torque, self-gravity, and thermal deformation was\nsimulated, and the maximum scatter of the pointing model induced by the tilt of\noptomechanics was predicted to be $4'.4$, which can be compensated for by the\nfield acquisition sequence. We performed a real sky test of LVMAGP with the\nproto-model siderostat and obtained field acquisition and autoguide accuracies\nof $0''.38$ and $1''.5$, respectively. It met all requirements except for the\nautoguide specification, which will be resolved by more precise alignment among\nthe hardware components at Las Campanas Observatory.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"zfPTnPMn1eLsdAKNVGTiGdSzP6Kx9pzS8l9Kzv1L0Vk","pdfSize":"15947170","objectId":"0x0f37989b3875f420b7769e1f405432b316350162282f44e4b969938858bbaa2c","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
