{"id":"2407.05195","title":"Subgap-state-mediated transport in superconductor--semiconductor hybrid\n  islands: Weak and strong coupling regimes","authors":"Marco Valentini, Rub\\'en Seoane Souto, Maksim Borovkov, Peter\n  Krogstrup, Yigal Meir, Martin Leijnse, Jeroen Danon and Georgios Katsaros","authorsParsed":[["Valentini","Marco",""],["Souto","Rubén Seoane",""],["Borovkov","Maksim",""],["Krogstrup","Peter",""],["Meir","Yigal",""],["Leijnse","Martin",""],["Danon","Jeroen",""],["Katsaros","Georgios",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 21:43:51 GMT"}],"updateDate":"2024-07-09","timestamp":1720302231000,"abstract":"  Superconductor-semiconductor hybrid systems play a crucial role in realizing\nnanoscale quantum devices, including hybrid qubits, Majorana bound states, and\nKitaev chains. For such hybrid devices, subgap states play a prominent role in\ntheir operation. In this work, we study such subgap states via Coulomb and\ntunneling spectroscopy through a superconducting island defined in a\nsemiconductor nanowire fully coated by a superconductor. We systematically\nexplore regimes ranging from an almost decoupled island to the open\nconfiguration. In the weak coupling regime, the experimental observations are\nvery similar in the absence of a magnetic field and when one flux quantum is\npiercing the superconducting shell. Conversely, in the strong coupling regime,\nsignificant distinctions emerge between the two cases. We ascribe this\ndifferent behavior to the existence of subgap states at one flux quantum, which\nbecome observable only for sufficiently strong coupling to the leads. We\nsupport our interpretation using a simple model to describe transport through\nthe island. Our study highlights the importance of studying a broad range of\ntunnel couplings for understanding the rich physics of hybrid devices.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"EXj1C-Erha_o6PonMo2nMv69Qbn-kEWNHdcRhKkmLJA","pdfSize":"2317633"}