{"id":"2407.04573","title":"VRSD: Rethinking Similarity and Diversity for Retrieval in Large\n  Language Models","authors":"Hang Gao and Yongfeng Zhang","authorsParsed":[["Gao","Hang",""],["Zhang","Yongfeng",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 15:08:44 GMT"}],"updateDate":"2024-07-08","timestamp":1720192124000,"abstract":"  Vector retrieval algorithms are vital for semantic queries in the evolving\nlandscape of Large Language Models (LLMs). Retrieving vectors that\nsimultaneously meet criteria for both similarity and diversity significantly\nenhances the capabilities of LLM-based agents. Despite the widespread use of\nthe Maximal Marginal Relevance (MMR) in retrieval scenarios with relevance and\ndiversity requirements, fluctuations caused by variations in the parameter $\n\\lambda $ within the MMR complicate the determination of the optimization\ntrajectory in vector spaces, thus obscuring the direction of enhancement.\nMoreover, there is a lack of a robust theoretical analysis for the constraints\nof similarity and diversity in retrieval processes. This paper introduces a\nnovel approach to characterizing both constraints through the relationship\nbetween the sum vector and the query vector. The proximity of these vectors\naddresses the similarity constraint, while necessitating that individual\nvectors within the sum vector divergently align with the query vector to\nsatisfy the diversity constraint. We also formulate a new combinatorial\noptimization challenge, taking a selection of $k$ vectors from a set of\ncandidates such that their sum vector maximally aligns with the query vector, a\nproblem we demonstrate to be NP-complete. This establishes the profound\ndifficulty of pursuing similarity and diversity simultaneously in vector\nretrieval and lays a theoretical groundwork for further research. Additionally,\nwe present the heuristic algorithm Vectors Retrieval with Similarity and\nDiversity (VRSD) which not only has a definitive optimization goal and eschews\nthe need for preset parameters but also offers a modest reduction in time\ncomplexity compared to MMR. Empirical validation further confirm that VRSD\nsignificantly surpasses MMR across various datasets.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"hW6FZ6DijxiRZHl-eybfpxTwzZSYL6u2fdIpOyfS038","pdfSize":"356236"}