{"id":"2407.03729","title":"Charging Ahead: A Hierarchical Adversarial Framework for Counteracting\n  Advanced Cyber Threats in EV Charging Stations","authors":"Mohammed Al-Mehdhar, Abdullatif Albaseer, Mohamed Abdallah, Ala\n  Al-Fuqaha","authorsParsed":[["Al-Mehdhar","Mohammed",""],["Albaseer","Abdullatif",""],["Abdallah","Mohamed",""],["Al-Fuqaha","Ala",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 08:23:03 GMT"}],"updateDate":"2024-07-08","timestamp":1720081383000,"abstract":"  The increasing popularity of electric vehicles (EVs) necessitates robust\ndefenses against sophisticated cyber threats. A significant challenge arises\nwhen EVs intentionally provide false information to gain higher charging\npriority, potentially causing grid instability. While various approaches have\nbeen proposed in existing literature to address this issue, they often overlook\nthe possibility of attackers using advanced techniques like deep reinforcement\nlearning (DRL) or other complex deep learning methods to achieve such attacks.\nIn response to this, this paper introduces a hierarchical adversarial framework\nusing DRL (HADRL), which effectively detects stealthy cyberattacks on EV\ncharging stations, especially those leading to denial of charging. Our approach\nincludes a dual approach, where the first scheme leverages DRL to develop\nadvanced and stealthy attack methods that can bypass basic intrusion detection\nsystems (IDS). Second, we implement a DRL-based scheme within the IDS at EV\ncharging stations, aiming to detect and counter these sophisticated attacks.\nThis scheme is trained with datasets created from the first scheme, resulting\nin a robust and efficient IDS. We evaluated the effectiveness of our framework\nagainst the recent literature approaches, and the results show that our IDS can\naccurately detect deceptive EVs with a low false alarm rate, even when\nconfronted with attacks not represented in the training dataset.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Networking and Internet Architecture"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"uX9xvDWFQ0nEkH9VGTXIVk5yefMG2R4VzRoA6etxXZU","pdfSize":"1536945"}