{"id":"2407.10667","title":"DUCPS: Deep Unfolding the Cauchy Proximal Splitting Algorithm for\n  B-Lines Quantification in Lung Ultrasound Images","authors":"Tianqi Yang, Oktay Karaku\\c{s}, Nantheera Anantrasirichai, Marco\n  Allinovi and Alin Achim","authorsParsed":[["Yang","Tianqi",""],["Karakuş","Oktay",""],["Anantrasirichai","Nantheera",""],["Allinovi","Marco",""],["Achim","Alin",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 12:30:05 GMT"},{"version":"v2","created":"Tue, 16 Jul 2024 09:55:08 GMT"}],"updateDate":"2024-07-17","timestamp":1721046605000,"abstract":"  The identification of artefacts, particularly B-lines, in lung ultrasound\n(LUS), is crucial for assisting clinical diagnosis, prompting the development\nof innovative methodologies. While the Cauchy proximal splitting (CPS)\nalgorithm has demonstrated effective performance in B-line detection, the\nprocess is slow and has limited generalization. This paper addresses these\nissues with a novel unsupervised deep unfolding network structure (DUCPS). The\nframework utilizes deep unfolding procedures to merge traditional model-based\ntechniques with deep learning approaches. By unfolding the CPS algorithm into a\ndeep network, DUCPS enables the parameters in the optimization algorithm to be\nlearnable, thus enhancing generalization performance and facilitating rapid\nconvergence. We conducted entirely unsupervised training using the\nNeighbor2Neighbor (N2N) and the Structural Similarity Index Measure (SSIM)\nlosses. When combined with an improved line identification method proposed in\nthis paper, state-of-the-art performance is achieved, with the recall and F2\nscore reaching 0.70 and 0.64, respectively. Notably, DUCPS significantly\nimproves computational efficiency eliminating the need for extensive data\nlabeling, representing a notable advancement over both traditional algorithms\nand existing deep learning approaches.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"wyPH2dcigE_3uerB05fo3QWoqtHOIf-YcWKO7EF_g-E","pdfSize":"15696311","objectId":"0x0ab7ecf8b6aebc9b059cea23313d7de6d1876c26be9d8974be7cfb63afea1fee","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
