{"id":"2407.21475","title":"Fine-gained Zero-shot Video Sampling","authors":"Dengsheng Chen, Jie Hu, Xiaoming Wei, Enhua Wu","authorsParsed":[["Chen","Dengsheng",""],["Hu","Jie",""],["Wei","Xiaoming",""],["Wu","Enhua",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 09:36:58 GMT"}],"updateDate":"2024-08-01","timestamp":1722418618000,"abstract":"  Incorporating a temporal dimension into pretrained image diffusion models for\nvideo generation is a prevalent approach. However, this method is\ncomputationally demanding and necessitates large-scale video datasets. More\ncritically, the heterogeneity between image and video datasets often results in\ncatastrophic forgetting of the image expertise. Recent attempts to directly\nextract video snippets from image diffusion models have somewhat mitigated\nthese problems. Nevertheless, these methods can only generate brief video clips\nwith simple movements and fail to capture fine-grained motion or non-grid\ndeformation. In this paper, we propose a novel Zero-Shot video Sampling\nalgorithm, denoted as $\\mathcal{ZS}^2$, capable of directly sampling\nhigh-quality video clips from existing image synthesis methods, such as Stable\nDiffusion, without any training or optimization. Specifically, $\\mathcal{ZS}^2$\nutilizes the dependency noise model and temporal momentum attention to ensure\ncontent consistency and animation coherence, respectively. This ability enables\nit to excel in related tasks, such as conditional and context-specialized video\ngeneration and instruction-guided video editing. Experimental results\ndemonstrate that $\\mathcal{ZS}^2$ achieves state-of-the-art performance in\nzero-shot video generation, occasionally outperforming recent supervised\nmethods.\n  Homepage: \\url{https://densechen.github.io/zss/}.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"434F0ba3JfiPybFJCO3OyUytRo41hHUCZVv8Pvk0gPM","pdfSize":"25508150"}