{"id":"2407.06450","title":"Enhanced Model Robustness to Input Corruptions by Per-corruption\n  Adaptation of Normalization Statistics","authors":"Elena Camuffo, Umberto Michieli, Simone Milani, Jijoong Moon, Mete\n  Ozay","authorsParsed":[["Camuffo","Elena",""],["Michieli","Umberto",""],["Milani","Simone",""],["Moon","Jijoong",""],["Ozay","Mete",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 23:20:18 GMT"}],"updateDate":"2024-07-10","timestamp":1720480818000,"abstract":"  Developing a reliable vision system is a fundamental challenge for robotic\ntechnologies (e.g., indoor service robots and outdoor autonomous robots) which\ncan ensure reliable navigation even in challenging environments such as adverse\nweather conditions (e.g., fog, rain), poor lighting conditions (e.g.,\nover/under exposure), or sensor degradation (e.g., blurring, noise), and can\nguarantee high performance in safety-critical functions. Current solutions\nproposed to improve model robustness usually rely on generic data augmentation\ntechniques or employ costly test-time adaptation methods. In addition, most\napproaches focus on addressing a single vision task (typically, image\nrecognition) utilising synthetic data. In this paper, we introduce\nPer-corruption Adaptation of Normalization statistics (PAN) to enhance the\nmodel robustness of vision systems. Our approach entails three key components:\n(i) a corruption type identification module, (ii) dynamic adjustment of\nnormalization layer statistics based on identified corruption type, and (iii)\nreal-time update of these statistics according to input data. PAN can integrate\nseamlessly with any convolutional model for enhanced accuracy in several robot\nvision tasks. In our experiments, PAN obtains robust performance improvement on\nchallenging real-world corrupted image datasets (e.g., OpenLoris, ExDark,\nACDC), where most of the current solutions tend to fail. Moreover, PAN\noutperforms the baseline models by 20-30% on synthetic benchmarks in object\nrecognition tasks.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"PFsNELC-KLz8sz4YkJjyPYGF_TbxwQqnoHSafVaLzXs","pdfSize":"1877767"}