{"id":"2407.05907","title":"Five-stage ordering to a topological-defect-mediated ground state in a\n  buckyball artificial spin ice","authors":"Gavin M. Macauley, Luca Berchialla, Peter M. Derlet, Laura J.\n  Heyderman","authorsParsed":[["Macauley","Gavin M.",""],["Berchialla","Luca",""],["Derlet","Peter M.",""],["Heyderman","Laura J.",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 13:13:03 GMT"}],"updateDate":"2024-07-09","timestamp":1720444383000,"abstract":"  Artificial spin ices are arrays of coupled nanomagnets, which exhibit a\nvariety of fascinating collective behaviour including emergent magnetic\nmonopoles, charge screening, and novel phase transitions. However, they have\nmainly been confined to two dimensions due to the challenges inherent to their\nfabrication and characterisation in three dimensions. Exploiting the third\ndimension offers new degrees of freedom leading to, for example, topological\neffects that arise from the curvature. Here, using numerical simulations, we\nuncover the low-temperature magnetic behaviour of a finite three-dimensional\nspin lattice: the buckyball artificial spin ice, where the spins are located on\nthe edges of a regular buckyball. This frustrated system has a non-trivial\nstructural topology that results in a rich spectrum of thermal magnetic\nbehaviour, beginning with a crossover from paramagnetism to a Spin-Ice sector\nfollowed by the formation of an imperfect charge crystal, before partial spin\norder is established in three separate steps. The final ground state\nconfiguration is described by a pair of robust topological magnetic defects\nthat arise because of the finite curved nature of the spatial-spin interaction.\nOur work uncovers the intricate thermodynamics of the buckyball artificial spin\nice. In doing so, we pave the way to designing unusual magnetic textures in\nother curved three-dimensional nanomagnetic systems by exploiting the interplay\nbetween structural topology and the dipolar interaction.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"koPZRS-HOYqBZTjZ97FzZXuDesCmYgu73peicvyNZs8","pdfSize":"5567718"}