{"id":"2407.08034","title":"Spatial-Temporal Generative AI for Traffic Flow Estimation with Sparse\n  Data of Connected Vehicles","authors":"Jianzhe Xue, Yunting Xu, Dongcheng Yuan, Caoyi Zha, Hongyang Du, Haibo\n  Zhou, and Dusit Niyato","authorsParsed":[["Xue","Jianzhe",""],["Xu","Yunting",""],["Yuan","Dongcheng",""],["Zha","Caoyi",""],["Du","Hongyang",""],["Zhou","Haibo",""],["Niyato","Dusit",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 20:26:04 GMT"}],"updateDate":"2024-07-12","timestamp":1720643164000,"abstract":"  Traffic flow estimation (TFE) is crucial for intelligent transportation\nsystems. Traditional TFE methods rely on extensive road sensor networks and\ntypically incur significant costs. Sparse mobile crowdsensing enables a\ncost-effective alternative by utilizing sparsely distributed probe vehicle data\n(PVD) provided by connected vehicles. However, as pointed out by the central\nlimit theorem, the sparsification of PVD leads to the degradation of TFE\naccuracy. In response, this paper introduces a novel and cost-effective TFE\nframework that leverages sparse PVD and improves accuracy by applying the\nspatial-temporal generative artificial intelligence (GAI) framework. Within\nthis framework, the conditional encoder mines spatial-temporal correlations in\nthe initial TFE results derived from averaging vehicle speeds of each region,\nand the generative decoder generates high-quality and accurate TFE outputs.\nAdditionally, the design of the spatial-temporal neural network is discussed,\nwhich is the backbone of the conditional encoder for effectively capturing\nspatial-temporal correlations. The effectiveness of the proposed TFE approach\nis demonstrated through evaluations based on real-world connected vehicle data.\nThe experimental results affirm the feasibility of our sparse PVD-based TFE\nframework and highlight the significant role of the spatial-temporal GAI\nframework in enhancing the accuracy of TFE.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"pVtDDwpGa430aJUiBFT3R1WxowmWxlomReFHmMYEUJk","pdfSize":"1193283"}