{"id":"2407.15972","title":"H-infinity Optimization for Active Seismic Isolation Systems in\n  Gravitational-Wave Detectors","authors":"Terrence Tsang, Fabi\\'an Erasmo Pe\\~na Arellano, Takafumi Ushiba,\n  Ryutaro Takahashi, Yoichi Aso, Katherine Dooley","authorsParsed":[["Tsang","Terrence",""],["Arellano","Fabián Erasmo Peña",""],["Ushiba","Takafumi",""],["Takahashi","Ryutaro",""],["Aso","Yoichi",""],["Dooley","Katherine",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 18:34:56 GMT"}],"updateDate":"2024-07-24","timestamp":1721673296000,"abstract":"  Low-frequency seismic noise poses a significant challenge in\ngravitational-wave detectors, prompting the use of active seismic isolation\nsystems. These systems employ advanced control configurations, including\nfeedback control, sensor correction, and sensor fusion, to mitigate seismic\ndisturbances. Optimal performance of these systems is achieved through the\napplication of the H-infinity method, which optimizes control filters. The\nH-infinity method was employed to optimize a sensor correction filter and\ncomplementary filters for sensor fusion for a KAGRA Type-B suspension,\nresulting in the development of an instrumentation-optimal ``super sensor''.\nThe super sensor exhibits comparable overall displacement noise RMS performance\nto a relative sensor, yet offers significantly better band-limited RMS\nperformance around the secondary microseism frequency, making it highly robust\nto seismic noise. This highlights the efficacy of the H-infinity method in\ngenerating seismic isolation filters tailored to instrument limitations,\nthereby transforming the system into a fully functional active seismic\nisolation system.\n","subjects":["Physics/Instrumentation and Detectors","Astrophysics/Instrumentation and Methods for Astrophysics","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"vIQJ8ApG_samgSKdkkAV6V3iiE4o8AWKD1Sg2mhLOBg","pdfSize":"1935484"}