{"id":"2407.04574","title":"A nonlinear room mode determines the operating conditions of a\n  large-cavity synthetic jet actuator at low frequencies","authors":"L.F. Olivera-Reyes, E.S. Palacios de Paz, S. S\\'anchez, J.F.\n  Hern\\'andez-S\\'anchez","authorsParsed":[["Olivera-Reyes","L. F.",""],["de Paz","E. S. Palacios",""],["Sánchez","S.",""],["Hernández-Sánchez","J. F.",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 15:08:45 GMT"}],"updateDate":"2024-07-08","timestamp":1720192125000,"abstract":"  Synthetic Jet (SJ) actuators are an intrinsically complex combination of\nelectronics, electric and mechanical systems. When studied theoretically, these\nelements are often simplified to coupled damped harmonic oscillators (DHO) that\ninduce a pressure field within the cavity and drive momentum exchange. Thus,\nthe performance of an SJ actuator results from coupling these DHOs, naturally\nleading to a few resonant modes. There is good evidence in the specialized\nliterature of two resonant modes developing in SJ actuators: the\nmembrane/piezoelectric mode and the Helmholtz resonance. In this work, we\nreport on the effect of a third resonant mode that develops at very low\nfrequencies due to a cavity much larger than the volume displaced by the\nactuator. We present evidence that the large-cavity dynamics determine the SJ\nperformance in combination with the well-described formation criteria. We\ncompare the intensity of this resonant mode with the first room modes using\nstandard frequency analysis. Unlike typical room modes, the distribution of\nthis resonant mode is very biased to lower frequencies. We also show that the\nresonant mode may be dimmed and focused by adding an obstacle in different\ncavity positions for the lower sound intensities. This mode overcomes the\nHelmholtz resonance, dominating the dynamics for higher sound intensities. We\nshow that jet and vortex velocities mimic the sound pressure curve for the\nlow-frequency range. Its effect mitigates for the higher range due to a delve\nthrough smaller stroke lengths, characterized as a fixed relation between the\nReynolds and the Stokes numbers. We consider that the large-cavity dynamics is\nan additional element that, if integrated as design criteria, could extend the\noptimum frequency response of SJs.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"hFAyAHhMjiyrapUDwVcStDfH6dAIZ5nw9rjr-9cNcfA","pdfSize":"2259933"}