{"id":"2407.12309","title":"MEDFuse: Multimodal EHR Data Fusion with Masked Lab-Test Modeling and\n  Large Language Models","authors":"Thao Minh Nguyen Phan, Cong-Tinh Dao, Chenwei Wu, Jian-Zhe Wang, Shun\n  Liu, Jun-En Ding, David Restrepo, Feng Liu, Fang-Ming Hung, Wen-Chih Peng","authorsParsed":[["Phan","Thao Minh Nguyen",""],["Dao","Cong-Tinh",""],["Wu","Chenwei",""],["Wang","Jian-Zhe",""],["Liu","Shun",""],["Ding","Jun-En",""],["Restrepo","David",""],["Liu","Feng",""],["Hung","Fang-Ming",""],["Peng","Wen-Chih",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 04:17:09 GMT"}],"updateDate":"2024-07-18","timestamp":1721189829000,"abstract":"  Electronic health records (EHRs) are multimodal by nature, consisting of\nstructured tabular features like lab tests and unstructured clinical notes. In\nreal-life clinical practice, doctors use complementary multimodal EHR data\nsources to get a clearer picture of patients' health and support clinical\ndecision-making. However, most EHR predictive models do not reflect these\nprocedures, as they either focus on a single modality or overlook the\ninter-modality interactions/redundancy. In this work, we propose MEDFuse, a\nMultimodal EHR Data Fusion framework that incorporates masked lab-test modeling\nand large language models (LLMs) to effectively integrate structured and\nunstructured medical data. MEDFuse leverages multimodal embeddings extracted\nfrom two sources: LLMs fine-tuned on free clinical text and masked tabular\ntransformers trained on structured lab test results. We design a disentangled\ntransformer module, optimized by a mutual information loss to 1) decouple\nmodality-specific and modality-shared information and 2) extract useful joint\nrepresentation from the noise and redundancy present in clinical notes. Through\ncomprehensive validation on the public MIMIC-III dataset and the in-house FEMH\ndataset, MEDFuse demonstrates great potential in advancing clinical\npredictions, achieving over 90% F1 score in the 10-disease multi-label\nclassification task.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"FwTRZgbfJOcGSaGJdg9FC7aPbt_exOaVeidE1itYq4M","pdfSize":"734509"}