{"id":"2407.10393","title":"New Paradigm for Secure Full-Duplex Transmission: Movable Antenna-Aided\n  Multi-User Systems","authors":"Jingze Ding, Zijian Zhou, and Bingli Jiao","authorsParsed":[["Ding","Jingze",""],["Zhou","Zijian",""],["Jiao","Bingli",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 02:10:20 GMT"}],"updateDate":"2024-07-16","timestamp":1721009420000,"abstract":"  In this paper, we investigate physical layer security (PLS) for full-duplex\n(FD) multi-user systems. To simultaneously protect uplink (UL) and downlink\n(DL) transmissions and ensure efficient use of time-frequency resources, we\nconsider a base station (BS) that operates in FD mode and enables to emit the\nartificial noise (AN). Conventional fixed-position antennas (FPAs) at the BS\nstruggle to fully exploit spatial degrees of freedom (DoFs). Therefore, we\npropose a new paradigm for secure FD multi-user systems, where multiple\ntransmit and receive movable antennas (MAs) are deployed at the BS to serve UL\nand DL users and effectively counter the cooperative interception by multiple\neavesdroppers (Eves). Specifically, the MA positions, the transmit, receive,\nand AN beamformers at the BS, and the UL powers are jointly optimized to\nmaximize the sum of secrecy rates (SSR). To solve the challenging non-convex\noptimization problem with highly coupled variables, we propose an alternating\noptimization (AO) algorithm. This algorithm decomposes the original problem\ninto three sub-problems, which are iteratively solved by the proposed\nmulti-velocity particle swarm optimization (MVPSO) and successive convex\napproximation (SCA). Simulation results demonstrate that the proposed scheme\nfor MA-aided secure FD multi-user systems can significantly enhance security\nperformance compared to conventional FPA systems.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"uINViKyR83-9KcuzIT8gSKbbMmIKCo3Xm9YU57Mc0Uc","pdfSize":"2971979"}