{"id":"2407.02441","title":"Relativistic Linear Response in Quantum-Electrodynamical Density\n  Functional Theory","authors":"Lukas Konecny, Valeriia P. Kosheleva, Heiko Appel, Michael\n  Ruggenthaler, Angel Rubio","authorsParsed":[["Konecny","Lukas",""],["Kosheleva","Valeriia P.",""],["Appel","Heiko",""],["Ruggenthaler","Michael",""],["Rubio","Angel",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 17:15:54 GMT"},{"version":"v2","created":"Mon, 8 Jul 2024 09:01:49 GMT"}],"updateDate":"2024-07-09","timestamp":1719940554000,"abstract":"  We present the theoretical derivation and numerical implementation of the\nlinear response equations for relativistic quantum electrodynamical density\nfunctional theory (QEDFT). In contrast to previous works based on the\nPauli-Fierz Hamiltonian, our approach describes electrons interacting with\nphotonic cavity modes at the four-component Dirac-Kohn-Sham level, derived from\nfully relativistic QED through a series of established approximations.\nMoreover, we show that a new type of spin-orbit-like (SO) cavity-mediated\ninteraction appears under the relativistic description of the coupling of\nmatter with quantized cavity modes. Benchmark calculations performed for atoms\nof group 12 elements (Zn, Cd, Hg) demonstrate how a relativistic treatment\nenables the description of exciton polaritons which arise from the\nhybridization of formally forbidden singlet-triplet transitions with cavity\nmodes. For atoms in cavities tuned on resonance with a singlet-triplet\ntransition we discover a significant interplay between SO effects and coupling\nto an off-resonant intense singlet-singlet transition. This dynamic\nrelationship highlights the crucial role of ab initio approaches in\nunderstanding cavity quantum electrodynamics. Finally, using the mercury\nporphyrin complex as an example, we show that relativistic linear response\nQEDFT provides computationally feasible first-principles calculations of\npolaritonic states in large heavy element-containing molecules of chemical\ninterest.\n","subjects":["Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"xVYpM1YTjiknxMXTKwaTJ3TgY08YYn3wRNBa2BE6mGw","pdfSize":"10290844"}