{"id":"2407.09657","title":"Analyzing X's Web of Influence: Dissecting News Sharing Dynamics through\n  Credibility and Popularity with Transfer Entropy and Multiplex Network\n  Measures","authors":"Sina Abdidizaji, Alexander Baekey, Chathura Jayalath, Alexander\n  Mantzaris, Ozlem Ozmen Garibay, Ivan Garibay","authorsParsed":[["Abdidizaji","Sina",""],["Baekey","Alexander",""],["Jayalath","Chathura",""],["Mantzaris","Alexander",""],["Garibay","Ozlem Ozmen",""],["Garibay","Ivan",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 19:37:23 GMT"}],"updateDate":"2024-07-16","timestamp":1720813043000,"abstract":"  The dissemination of news articles on social media platforms significantly\nimpacts the public's perception of global issues, with the nature of these\narticles varying in credibility and popularity. The challenge of measuring this\ninfluence and identifying key propagators is formidable. Traditional\ngraph-based metrics such as different centrality measures and node degree\nmethods offer some insights into information flow but prove insufficient for\nidentifying hidden influencers in large-scale social media networks such as X\n(previously known as Twitter). This study adopts and enhances a non-parametric\nframework based on Transfer Entropy to elucidate the influence relationships\namong X users. It further categorizes the distribution of influence exerted by\nthese actors through the innovative use of multiplex network measures within a\nsocial media context, aiming to pinpoint influential actors during significant\nworld events. The methodology was applied to three distinct events, and the\nfindings revealed that actors in different events leveraged different types of\nnews articles and influenced distinct sets of actors based on the news\ncategory. Notably, we found that actors disseminating trustworthy news articles\nto influence others occasionally resort to untrustworthy sources. However, the\nconverse scenario, wherein actors predominantly using untrustworthy news types\nswitch to trustworthy sources for influence, is less prevalent. This asymmetry\nsuggests a discernible pattern in the strategic use of news articles for\ninfluence across social media networks, highlighting the nuanced roles of\ntrustworthiness and popularity in the spread of information and influence.\n","subjects":["Computing Research Repository/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"FAtKB4wamtoTjTTikGm9xvwyz25Wdf97RKXl4DyzeVw","pdfSize":"3320643","objectId":"0xd552be7652e4449272c03baee01cd8de032dff17fc585c1c079544cc88648817","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
