{"id":"2407.16956","title":"Long-Term, Store-Front Robotics: Interactive Music for Robotic Arm,\n  Caxixi and Frame Drums","authors":"Richard Savery, Fouad Sukkar","authorsParsed":[["Savery","Richard",""],["Sukkar","Fouad",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 02:44:45 GMT"}],"updateDate":"2024-07-25","timestamp":1721789085000,"abstract":"  This paper presents an innovative exploration into the integration of\ninteractive robotic musicianship within a commercial retail environment,\nspecifically through a three-week-long in-store installation featuring a UR3\nrobotic arm, custom-built frame drums, and an adaptive music generation system.\nSituated in a prominent storefront in one of the world's largest cities, this\nproject aimed to enhance the shopping experience by creating dynamic, engaging\nmusical interactions that respond to the store's ambient soundscape. Key\ncontributions include the novel application of industrial robotics in artistic\nexpression, the deployment of interactive music to enrich retail ambiance, and\nthe demonstration of continuous robotic operation in a public setting over an\nextended period. Challenges such as system reliability, variation in musical\noutput, safety in interactive contexts, and brand alignment were addressed to\nensure the installation's success. The project not only showcased the technical\nfeasibility and artistic potential of robotic musicianship in retail spaces but\nalso offered insights into the practical implications of such integration,\nincluding system reliability, the dynamics of human-robot interaction, and the\nimpact on store operations. This exploration opens new avenues for enhancing\nconsumer retail experiences through the intersection of technology, music, and\ninteractive art, suggesting a future where robotic musicianship contributes\nmeaningfully to public and commercial spaces.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Sound","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"mOeeG-ixvsKDYCTEH11mvb86plGKPm9v0Wdswqo3GI0","pdfSize":"5552767"}