{"id":"2407.17017","title":"Chemistry-informed Machine Learning Explains Calcium-binding Proteins\n  Fuzzy Shape for Communicating Changes in the Atomic States of Calcium Ions","authors":"Pengzhi Zhang, Jules Nde, Yossi Eliaz, Nathaniel Jennings, Piotr\n  Cieplak, Margaret. S. Cheung","authorsParsed":[["Zhang","Pengzhi",""],["Nde","Jules",""],["Eliaz","Yossi",""],["Jennings","Nathaniel",""],["Cieplak","Piotr",""],["Cheung","Margaret. S.",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 05:53:01 GMT"}],"updateDate":"2024-07-25","timestamp":1721800381000,"abstract":"  Proteins' fuzziness are features for communicating changes in cell signaling\ninstigated by binding with secondary messengers, such as calcium ions,\nassociated with the coordination of muscle contraction, neurotransmitter\nrelease, and gene expression. Binding with the disordered parts of a protein,\ncalcium ions must balance their charge states with the shape of calcium-binding\nproteins and their versatile pool of partners depending on the circumstances\nthey transmit, but it is unclear whether the limited experimental data\navailable can be used to train models to accurately predict the charges of\ncalcium-binding protein variants. Here, we developed a chemistry-informed,\nmachine-learning algorithm that implements a game theoretic approach to explain\nthe output of a machine-learning model without the prerequisite of an\nexcessively large database for high-performance prediction of atomic charges.\nWe used the ab initio electronic structure data representing calcium ions and\nthe structures of the disordered segments of calcium-binding peptides with\nsurrounding water molecules to train several explainable models. Network theory\nwas used to extract the topological features of atomic interactions in the\nstructurally complex data dictated by the coordination chemistry of a calcium\nion, a potent indicator of its charge state in protein. With our designs, we\nprovided a framework of explainable machine learning model to annotate atomic\ncharges of calcium ions in calcium-binding proteins with domain knowledge in\nresponse to the chemical changes in an environment based on the limited size of\nscientific data in a genome space.\n","subjects":["Quantitative Biology/Quantitative Methods"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"aVBWQjsdsfnKDX62dmJak0U56o6c9lvvtyS8kMMFQC4","pdfSize":"3234156"}