{"id":"2407.05366","title":"An activity transition in FRB 20201124A: methodological rigor, detection\n  of frequency-dependent cessation, and a geometric magnetar model","authors":"A. V. Bilous and J. van Leeuwen and Y. Maan and I.Pastor-Marazuela and\n  L. C. Oostrum and K. M. Rajwade and Y. Y. Wang","authorsParsed":[["Bilous","A. V.",""],["van Leeuwen","J.",""],["Maan","Y.",""],["Pastor-Marazuela","I.",""],["Oostrum","L. C.",""],["Rajwade","K. M.",""],["Wang","Y. Y.",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 13:40:43 GMT"}],"updateDate":"2024-07-09","timestamp":1720359643000,"abstract":"  We report detections of fast radio bursts (FRBs) from the repeating source\nFRB 20201124A with Apertif/WSRT and GMRT, and measurements of basic burst\nproperties, especially the dispersion measure (DM) and fluence. Based on\ncomparisons of these properties with previously published larger samples, we\nargue that the excess DM reported earlier for pulses with integrated signal to\nnoise ratio $\\lesssim 1000$ is due to incompletely accounting for the so-called\nsad trombone effect, even when using structure-maximizing DM algorithms. Our\ninvestigations of fluence distributions next lead us to advise against formal\npower-law fitting, especially dissuading the use of the least-square method,\nand we demonstrate the large biases involved. A maximum likelihood estimator\n(MLE) provides a much more accurate estimate of the power law and we provide\naccessible code for direct inclusion in future research. Our GMRT observations\nwere fortuitously scheduled around the end of the activity cycle as recorded by\nFAST. We detected several bursts (one of them very strong) at 400/600 MHz, a\nfew hours after sensitive FAST non-detections already showed the 1.3 GHz FRB\nemission to have ceased. After FRB 20180916B, this is a second example of a\nfrequency-dependent activity window identified in a repeating FRB source. Since\nnumerous efforts have so-far failed to determine a spin period for FRB\n20201124A, we conjecture it to be an ultra-long period magnetar, with a period\non the scale of months, and with a very wide, highly irregular duty cycle.\nAssuming the emission comes from closed field lines, we use radius-to-frequency\nmapping and polarization information from other studies to constrain the\nmagnetospheric geometry and location of the emission region. Our initial\nfindings are consistent with a possible connection between FRBs and crustal\nmotion events.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"a-A_p_ovwg3nTWcuRmbvmfNfXHvtNww6uA60CPjwDUA","pdfSize":"4271589"}