{"id":"2407.05416","title":"Cross Prompting Consistency with Segment Anything Model for\n  Semi-supervised Medical Image Segmentation","authors":"Juzheng Miao, Cheng Chen, Keli Zhang, Jie Chuai, Quanzheng Li and\n  Pheng-Ann Heng","authorsParsed":[["Miao","Juzheng",""],["Chen","Cheng",""],["Zhang","Keli",""],["Chuai","Jie",""],["Li","Quanzheng",""],["Heng","Pheng-Ann",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 15:43:20 GMT"}],"updateDate":"2024-07-09","timestamp":1720367000000,"abstract":"  Semi-supervised learning (SSL) has achieved notable progress in medical image\nsegmentation. To achieve effective SSL, a model needs to be able to efficiently\nlearn from limited labeled data and effectively exploiting knowledge from\nabundant unlabeled data. Recent developments in visual foundation models, such\nas the Segment Anything Model (SAM), have demonstrated remarkable adaptability\nwith improved sample efficiency. To harness the power of foundation models for\napplication in SSL, we propose a cross prompting consistency method with\nsegment anything model (CPC-SAM) for semi-supervised medical image\nsegmentation. Our method employs SAM's unique prompt design and innovates a\ncross-prompting strategy within a dual-branch framework to automatically\ngenerate prompts and supervisions across two decoder branches, enabling\neffectively learning from both scarce labeled and valuable unlabeled data. We\nfurther design a novel prompt consistency regularization, to reduce the prompt\nposition sensitivity and to enhance the output invariance under different\nprompts. We validate our method on two medical image segmentation tasks. The\nextensive experiments with different labeled-data ratios and modalities\ndemonstrate the superiority of our proposed method over the state-of-the-art\nSSL methods, with more than 9% Dice improvement on the breast cancer\nsegmentation task.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"BbK_PEHAqpHLbdq2sn17UfzmFAiJeXVli0tYmsCLVMo","pdfSize":"2040738"}