{"id":"2407.02161","title":"A Tax-Subsidy Scheme for Efficient Investment in Renewable Generation\n  Capacity","authors":"Mohammad Reza Karimi Gharigh, Lamia Varawala, Mohammad Reza\n  Hesamzadeh, Gy\\\"orgy D\\'an","authorsParsed":[["Gharigh","Mohammad Reza Karimi",""],["Varawala","Lamia",""],["Hesamzadeh","Mohammad Reza",""],["Dán","György",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 11:10:57 GMT"}],"updateDate":"2024-07-03","timestamp":1719918657000,"abstract":"  The impact of energy production significantly affects system sustainability,\nwhich has enabled a shift towards renewable energy sources. Thus, producer\nbehavior is crucial in electricity markets to achieve sustainability goals. In\nthis paper, we address two key challenges comprising electricity markets and\ngeneration investment. Firstly, electricity markets typically are operated with\ncompetitive market clearing and merit-order dispatch, which neglects negative\nexternalities from pollution. A Pigouvian tax is proposed in order to\ninvestigate the impacts of these externalities on electricity prices and\nresolve this issue. Secondly, renewable energy sources entail low operational\ncosts, which result in lower system prices and reduced profits for producers.\nFurthermore, producers face high investment costs when moving into renewable\nenergy resources, which leads to strategic investment decisions. In order to\nmitigate this strategic behavior, subsidies are proposed equal to producers'\ncontribution to consumer surplus. These subsidies incentivize producers to\ndecrease prices and increase consumer surplus, so, producers would be motivated\nto invest in socially optimal generation capacity. Finally, we demonstrate that\nimplementing the proposed tax and subsidy does not increase the regulator's\ninformation burden.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"SlfYf9zcZvTjcUFjjQdgnuwiYVMugZINHhUrTlLeKSI","pdfSize":"4523332"}