{"id":"2407.04334","title":"Learning Geometric Invariant Features for Classification of Vector\n  Polygons with Graph Message-passing Neural Network","authors":"Zexian Huang, Kourosh Khoshelham and Martin Tomko","authorsParsed":[["Huang","Zexian",""],["Khoshelham","Kourosh",""],["Tomko","Martin",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 08:19:36 GMT"}],"updateDate":"2024-07-08","timestamp":1720167576000,"abstract":"  Geometric shape classification of vector polygons remains a non-trivial\nlearning task in spatial analysis. Previous studies mainly focus on devising\ndeep learning approaches for representation learning of rasterized vector\npolygons, whereas the study of discrete representations of polygons and\nsubsequent deep learning approaches have not been fully investigated. In this\nstudy, we investigate a graph representation of vector polygons and propose a\nnovel graph message-passing neural network (PolyMP) to learn the\ngeometric-invariant features for shape classification of polygons. Through\nextensive experiments, we show that the graph representation of polygons\ncombined with a permutation-invariant graph message-passing neural network\nachieves highly robust performances on benchmark datasets (i.e., synthetic\nglyph and real-world building footprint datasets) as compared to baseline\nmethods. We demonstrate that the proposed graph-based PolyMP network enables\nthe learning of expressive geometric features invariant to geometric\ntransformations of polygons (i.e., translation, rotation, scaling and shearing)\nand is robust to trivial vertex removals of polygons. We further show the\nstrong generalizability of PolyMP, which enables generalizing the learned\ngeometric features from the synthetic glyph polygons to the real-world building\nfootprints.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7zWLREHsXFpfpGW2DEGEx5KqsUuTEFGYaXSpdTYo9Fs","pdfSize":"2376662"}