{"id":"2407.11202","title":"Actuation without production bias","authors":"James Kirby and Morgan Sonderegger","authorsParsed":[["Kirby","James",""],["Sonderegger","Morgan",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 19:38:03 GMT"}],"updateDate":"2024-07-17","timestamp":1721072283000,"abstract":"  Phonetic production bias is the external force most commonly invoked in\ncomputational models of sound change, despite the fact that it is not\nresponsible for all, or even most, sound changes. Furthermore, the existence of\nproduction bias alone cannot account for how changes do or do not propagate\nthroughout a speech community. While many other factors have been invoked by\n(socio)phoneticians, including but not limited to contact (between\nsubpopulations) and differences in social evaluation (of variants, groups, or\nindividuals), these are not typically modeled in computational simulations of\nsound change. In this paper, we consider whether production biases have a\nunique dynamics in terms of how they impact the population-level spread of\nchange in a setting where agents learn from multiple teachers. We show that,\nwhile the dynamics conditioned by production bias are not unique, it is not the\ncase that all perturbing forces have the same dynamics: in particular, if\nsocial weight is a function of individual teachers and the correlation between\na teacher's social weight and the extent to which they realize a production\nbias is weak, change is unlikely to propagate. Nevertheless, it remains the\ncase that changes initiated from different sources may display a similar\ndynamics. A more nuanced understanding of how population structure interacts\nwith individual biases can thus provide a (partial) solution to the\n`non-phonologization problem'.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"iZhdhsA5U6f_r915qK7245BJ0TEp57iYNit9ExLj5XE","pdfSize":"1498209"}