{"id":"2407.07544","title":"Disentangling Masked Autoencoders for Unsupervised Domain Generalization","authors":"An Zhang, Han Wang, Xiang Wang, Tat-Seng Chua","authorsParsed":[["Zhang","An",""],["Wang","Han",""],["Wang","Xiang",""],["Chua","Tat-Seng",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 11:11:36 GMT"}],"updateDate":"2024-07-11","timestamp":1720609896000,"abstract":"  Domain Generalization (DG), designed to enhance out-of-distribution (OOD)\ngeneralization, is all about learning invariance against domain shifts\nutilizing sufficient supervision signals. Yet, the scarcity of such labeled\ndata has led to the rise of unsupervised domain generalization (UDG) - a more\nimportant yet challenging task in that models are trained across diverse\ndomains in an unsupervised manner and eventually tested on unseen domains. UDG\nis fast gaining attention but is still far from well-studied. To close the\nresearch gap, we propose a novel learning framework designed for UDG, termed\nthe Disentangled Masked Auto Encoder (DisMAE), aiming to discover the\ndisentangled representations that faithfully reveal the intrinsic features and\nsuperficial variations without access to the class label. At its core is the\ndistillation of domain-invariant semantic features, which cannot be\ndistinguished by domain classifier, while filtering out the domain-specific\nvariations (for example, color schemes and texture patterns) that are unstable\nand redundant. Notably, DisMAE co-trains the asymmetric dual-branch\narchitecture with semantic and lightweight variation encoders, offering dynamic\ndata manipulation and representation level augmentation capabilities. Extensive\nexperiments on four benchmark datasets (i.e., DomainNet, PACS, VLCS, Colored\nMNIST) with both DG and UDG tasks demonstrate that DisMAE can achieve\ncompetitive OOD performance compared with the state-of-the-art DG and UDG\nbaselines, which shed light on potential research line in improving the\ngeneralization ability with large-scale unlabeled data.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"lwqI9dJrti1Vd7Jn_nck5nSGCxcqOasXumrj26c4zy0","pdfSize":"6963849","objectId":"0x75950939f4e167df0eaf309e6c614520e439b3d4c0f9e707f3a1235ae061b573","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
