{"id":"2407.10476","title":"Kinetic Typography Diffusion Model","authors":"Seonmi Park, Inhwan Bae, Seunghyun Shin, Hae-Gon Jeon","authorsParsed":[["Park","Seonmi",""],["Bae","Inhwan",""],["Shin","Seunghyun",""],["Jeon","Hae-Gon",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 07:04:45 GMT"}],"updateDate":"2024-07-16","timestamp":1721027085000,"abstract":"  This paper introduces a method for realistic kinetic typography that\ngenerates user-preferred animatable 'text content'. We draw on recent advances\nin guided video diffusion models to achieve visually-pleasing text appearances.\nTo do this, we first construct a kinetic typography dataset, comprising about\n600K videos. Our dataset is made from a variety of combinations in 584\ntemplates designed by professional motion graphics designers and involves\nchanging each letter's position, glyph, and size (i.e., flying, glitches,\nchromatic aberration, reflecting effects, etc.). Next, we propose a video\ndiffusion model for kinetic typography. For this, there are three requirements:\naesthetic appearances, motion effects, and readable letters. This paper\nidentifies the requirements. For this, we present static and dynamic captions\nused as spatial and temporal guidance of a video diffusion model, respectively.\nThe static caption describes the overall appearance of the video, such as\ncolors, texture and glyph which represent a shape of each letter. The dynamic\ncaption accounts for the movements of letters and backgrounds. We add one more\nguidance with zero convolution to determine which text content should be\nvisible in the video. We apply the zero convolution to the text content, and\nimpose it on the diffusion model. Lastly, our glyph loss, only minimizing a\ndifference between the predicted word and its ground-truth, is proposed to make\nthe prediction letters readable. Experiments show that our model generates\nkinetic typography videos with legible and artistic letter motions based on\ntext prompts.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"xLgN73aS2ibJBhKMYGjiAKkyg0sNLtNV2O1T5jTvjDs","pdfSize":"9332328"}