{"id":"2407.11852","title":"Schema Matching with Large Language Models: an Experimental Study","authors":"Marcel Parciak, Brecht Vandevoort, Frank Neven, Liesbet M. Peeters,\n  Stijn Vansummeren","authorsParsed":[["Parciak","Marcel",""],["Vandevoort","Brecht",""],["Neven","Frank",""],["Peeters","Liesbet M.",""],["Vansummeren","Stijn",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 15:33:00 GMT"}],"updateDate":"2024-07-17","timestamp":1721143980000,"abstract":"  Large Language Models (LLMs) have shown useful applications in a variety of\ntasks, including data wrangling. In this paper, we investigate the use of an\noff-the-shelf LLM for schema matching. Our objective is to identify semantic\ncorrespondences between elements of two relational schemas using only names and\ndescriptions. Using a newly created benchmark from the health domain, we\npropose different so-called task scopes. These are methods for prompting the\nLLM to do schema matching, which vary in the amount of context information\ncontained in the prompt. Using these task scopes we compare LLM-based schema\nmatching against a string similarity baseline, investigating matching quality,\nverification effort, decisiveness, and complementarity of the approaches. We\nfind that matching quality suffers from a lack of context information, but also\nfrom providing too much context information. In general, using newer LLM\nversions increases decisiveness. We identify task scopes that have acceptable\nverification effort and succeed in identifying a significant number of true\nsemantic matches. Our study shows that LLMs have potential in bootstrapping the\nschema matching process and are able to assist data engineers in speeding up\nthis task solely based on schema element names and descriptions without the\nneed for data instances.\n","subjects":["Computing Research Repository/Databases","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"2udBAS6DXqiX38nxFO9iiwSdhZ5uwrIUz-3x-TFKHMk","pdfSize":"1499430"}