{"id":"2407.09242","title":"An Adaptive Indoor Localization Approach Using WiFi RSSI Fingerprinting\n  with SLAM-Enabled Robotic Platform and Deep Neural Networks","authors":"Seyed Alireza Rahimi Azghadi, Atah Nuh Mih, Asfia Kawnine, Monica\n  Wachowicz, Francis Palma, Hung Cao","authorsParsed":[["Azghadi","Seyed Alireza Rahimi",""],["Mih","Atah Nuh",""],["Kawnine","Asfia",""],["Wachowicz","Monica",""],["Palma","Francis",""],["Cao","Hung",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 13:14:31 GMT"},{"version":"v2","created":"Tue, 30 Jul 2024 11:49:21 GMT"}],"updateDate":"2024-07-31","timestamp":1720790071000,"abstract":"  Indoor localization plays a vital role in the era of the IoT and robotics,\nwith WiFi technology being a prominent choice due to its ubiquity. We present a\nmethod for creating WiFi fingerprinting datasets to enhance indoor localization\nsystems and address the gap in WiFi fingerprinting dataset creation. We used\nthe Simultaneous Localization And Mapping (SLAM) algorithm and employed a\nrobotic platform to construct precise maps and localize robots in indoor\nenvironments. We developed software applications to facilitate data\nacquisition, fingerprinting dataset collection, and accurate ground truth map\nbuilding. Subsequently, we aligned the spatial information generated via the\nSLAM with the WiFi scans to create a comprehensive WiFi fingerprinting dataset.\nThe created dataset was used to train a deep neural network (DNN) for indoor\nlocalization, which can prove the usefulness of grid density. We conducted\nexperimental validation within our office environment to demonstrate the\nproposed method's effectiveness, including a heatmap from the dataset\nshowcasing the spatial distribution of WiFi signal strengths for the testing\naccess points placed within the environment. Notably, our method offers\ndistinct advantages over existing approaches as it eliminates the need for a\npredefined map of the environment, requires no preparatory steps, lessens human\nintervention, creates a denser fingerprinting dataset, and reduces the WiFi\nfingerprinting dataset creation time. Our method achieves 26% more accurate\nlocalization than the other methods and can create a six times denser\nfingerprinting dataset in one-third of the time compared to the traditional\nmethod. In summary, using WiFi RSSI Fingerprinting data surveyed by the\nSLAM-Enabled Robotic Platform, we can adapt our trained DNN model to indoor\nlocalization in any dynamic environment and enhance its scalability and\napplicability in real-world scenarios.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Emerging Technologies","Computing Research Repository/Networking and Internet Architecture"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"lExjbwGuVFXwTy5BHO4M15lwDHNPrEOwpAPqnKK53Vo","pdfSize":"1054430"}