{"id":"2407.12953","title":"Using satellite imagery to monitor remote rural economies at high\n  frequency","authors":"Tillmann von Carnap (1), Reza M. Asiyabi (2 and 3), Paul Dingus (1),\n  Anna Tompsett (4 and 5) ((1) Center on Food Security and the Environment,\n  Stanford University, Stanford, United States of America, (2) Mistra Center\n  for Sustainable Markets, Stockholm School of Economics, Stockholm, Sweden,\n  (3) School of GeoScience, University of Edinburgh, Edinburgh, United Kingdom,\n  (4) Beijer Institute of Ecological Economics, The Royal Swedish Academy of\n  Sciences, Stockholm, Sweden, (5) Institute for International Economic\n  Studies, Stockholm University, Stockholm, Sweden)","authorsParsed":[["von Carnap","Tillmann","","2 and 3"],["Asiyabi","Reza M.","","2 and 3"],["Dingus","Paul","","4 and 5"],["Tompsett","Anna","","4 and 5"]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 18:47:49 GMT"},{"version":"v2","created":"Fri, 23 Aug 2024 07:19:47 GMT"}],"updateDate":"2024-08-26","timestamp":1721242069000,"abstract":"  Despite global progress in reducing extreme poverty, stubborn pockets remain,\noften in remote and fragile regions. A fundamental obstacle to further progress\nis that remoteness and fragility also constrain our ability to monitor economic\nconditions. Using satellite imagery, we develop a new approach to monitor\neconomic activity at periodic markets, focal points for rural trade throughout\nhistory and much of the world today. We describe how to detect marketplaces\nwithout pre-existing maps and how to construct an up-to-weekly measure of their\nactivity. We show that we successfully detect marketplaces and that activity\ncorrelates with other measures of economic activity, captures seasonal\npatterns, and responds to local weather and conflict. Drawing on high\nfrequency, globally available imagery, our approach enables real-time\nmonitoring of economic activity independent of ground conditions. .\n","subjects":["Economics/General Economics","Quantitative Finance/Economics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"AFu9qX3Dsxld2RQzutWGwfvJ3bF-RvPb3SPKCIvM97Q","pdfSize":"2018758"}