{"id":"2407.08701","title":"Live2Diff: Live Stream Translation via Uni-directional Attention in\n  Video Diffusion Models","authors":"Zhening Xing, Gereon Fox, Yanhong Zeng, Xingang Pan, Mohamed Elgharib,\n  Christian Theobalt, Kai Chen","authorsParsed":[["Xing","Zhening",""],["Fox","Gereon",""],["Zeng","Yanhong",""],["Pan","Xingang",""],["Elgharib","Mohamed",""],["Theobalt","Christian",""],["Chen","Kai",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 17:34:51 GMT"}],"updateDate":"2024-07-12","timestamp":1720719291000,"abstract":"  Large Language Models have shown remarkable efficacy in generating streaming\ndata such as text and audio, thanks to their temporally uni-directional\nattention mechanism, which models correlations between the current token and\nprevious tokens. However, video streaming remains much less explored, despite a\ngrowing need for live video processing. State-of-the-art video diffusion models\nleverage bi-directional temporal attention to model the correlations between\nthe current frame and all the surrounding (i.e. including future) frames, which\nhinders them from processing streaming videos. To address this problem, we\npresent Live2Diff, the first attempt at designing a video diffusion model with\nuni-directional temporal attention, specifically targeting live streaming video\ntranslation. Compared to previous works, our approach ensures temporal\nconsistency and smoothness by correlating the current frame with its\npredecessors and a few initial warmup frames, without any future frames.\nAdditionally, we use a highly efficient denoising scheme featuring a KV-cache\nmechanism and pipelining, to facilitate streaming video translation at\ninteractive framerates. Extensive experiments demonstrate the effectiveness of\nthe proposed attention mechanism and pipeline, outperforming previous methods\nin terms of temporal smoothness and/or efficiency.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"dEHJ5WZ5pQS3FEN29CO6BNeiisF8QDSQIb-s8laUUhc","pdfSize":"9850963"}