{"id":"2407.00846","title":"Estimating the cognitive effects of statins from observational data\n  using the survival-incorporated median: a summary measure for clinical\n  outcomes in the presence of death","authors":"Qingyan Xiang, Paola Sebastiani, Thomas Perls, Stacy L. Andersen,\n  Svetlana Ukraintseva, Mikael Thinggaard, Judith J. Lok","authorsParsed":[["Xiang","Qingyan",""],["Sebastiani","Paola",""],["Perls","Thomas",""],["Andersen","Stacy L.",""],["Ukraintseva","Svetlana",""],["Thinggaard","Mikael",""],["Lok","Judith J.",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 22:50:54 GMT"}],"updateDate":"2024-07-02","timestamp":1719787854000,"abstract":"  The issue of \"truncation by death\" commonly arises in clinical research:\nsubjects may die before their follow-up assessment, resulting in undefined\nclinical outcomes. This article addresses truncation by death by analyzing the\nLong Life Family Study (LLFS), a multicenter observational study involving over\n4000 older adults with familial longevity. We are interested in the cognitive\neffects of statins in LLFS participants, as the impact of statins on cognition\nremains unclear despite their widespread use. In this application, rather than\ntreating death as a mechanism through which clinical outcomes are missing, we\nadvocate treating death as part of the outcome measure. We focus on the\nsurvival-incorporated median, the median of a composite outcome combining death\nand cognitive scores, to summarize the effect of statins. We propose an\nestimator for the survival-incorporated median from observational data,\napplicable in both point-treatment settings and time-varying treatment\nsettings. Simulations demonstrate the survival-incorporated median as a simple\nand useful summary measure. We apply this method to estimate the effect of\nstatins on the change in cognitive function (measured by the Digit Symbol\nSubstitution Test), incorporating death. Our results indicate no significant\ndifference in cognitive decline between participants with a similar age\ndistribution on and off statins from baseline. Through this application, we aim\nto not only contribute to this clinical question but also offer insights into\nanalyzing clinical outcomes in the presence of death.\n","subjects":["Statistics/Methodology","Statistics/Applications"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"K9Tszjvp6a6jspfoLtICEiG_WTv5Ypwbgk9W5IT1dVw","pdfSize":"761847"}