{"id":"2407.01603","title":"A Review of Large Language Models and Autonomous Agents in Chemistry","authors":"Mayk Caldas Ramos, Christopher J. Collison, Andrew D. White","authorsParsed":[["Ramos","Mayk Caldas",""],["Collison","Christopher J.",""],["White","Andrew D.",""]],"versions":[{"version":"v1","created":"Wed, 26 Jun 2024 17:33:21 GMT"},{"version":"v2","created":"Thu, 25 Jul 2024 21:23:15 GMT"}],"updateDate":"2024-07-29","timestamp":1719423201000,"abstract":"  Large language models (LLMs) have emerged as powerful tools in chemistry,\nsignificantly impacting molecule design, property prediction, and synthesis\noptimization. This review highlights LLM capabilities in these domains and\ntheir potential to accelerate scientific discovery through automation. We also\nreview LLM-based autonomous agents: LLMs with a broader set of tools to\ninteract with their surrounding environment. These agents perform diverse tasks\nsuch as paper scraping, interfacing with automated laboratories, and synthesis\nplanning. As agents are an emerging topic, we extend the scope of our review of\nagents beyond chemistry and discuss across any scientific domains. This review\ncovers the recent history, current capabilities, and design of LLMs and\nautonomous agents, addressing specific challenges, opportunities, and future\ndirections in chemistry. Key challenges include data quality and integration,\nmodel interpretability, and the need for standard benchmarks, while future\ndirections point towards more sophisticated multi-modal agents and enhanced\ncollaboration between agents and experimental methods. Due to the quick pace of\nthis field, a repository has been built to keep track of the latest studies:\nhttps://github.com/ur-whitelab/LLMs-in-science.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language","Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"dEIFF7GRwtgCd8WoalubDXgK9ymwlsUdlrlZ16xUCc8","pdfSize":"3115724"}