{"id":"2407.16133","title":"Open-Set Biometrics: Beyond Good Closed-Set Models","authors":"Yiyang Su, Minchul Kim, Feng Liu, Anil Jain and Xiaoming Liu","authorsParsed":[["Su","Yiyang",""],["Kim","Minchul",""],["Liu","Feng",""],["Jain","Anil",""],["Liu","Xiaoming",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 02:34:39 GMT"}],"updateDate":"2024-07-24","timestamp":1721702079000,"abstract":"  Biometric recognition has primarily addressed closed-set identification,\nassuming all probe subjects are in the gallery. However, most practical\napplications involve open-set biometrics, where probe subjects may or may not\nbe present in the gallery. This poses distinct challenges in effectively\ndistinguishing individuals in the gallery while minimizing false detections.\nWhile it is commonly believed that powerful biometric models can excel in both\nclosed- and open-set scenarios, existing loss functions are inconsistent with\nopen-set evaluation. They treat genuine (mated) and imposter (non-mated)\nsimilarity scores symmetrically and neglect the relative magnitudes of imposter\nscores. To address these issues, we simulate open-set evaluation using\nminibatches during training and introduce novel loss functions: (1) the\nidentification-detection loss optimized for open-set performance under\nselective thresholds and (2) relative threshold minimization to reduce the\nmaximum negative score for each probe. Across diverse biometric tasks,\nincluding face recognition, gait recognition, and person re-identification, our\nexperiments demonstrate the effectiveness of the proposed loss functions,\nsignificantly enhancing open-set performance while positively impacting\nclosed-set performance. Our code and models are available at\nhttps://github.com/prevso1088/open-set-biometrics.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"LI9K0vlQPKOCp96Io7VSJsU1AO-RMB6w2XTY9AR41RA","pdfSize":"1922447","objectId":"0x790394b3e5b87564f563b1e33447e61764d45a002f4d8da3664844dca6a5a3dd","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
