{"id":"2407.08697","title":"Patterns of link reciprocity in directed, signed networks","authors":"Anna Gallo, Fabio Saracco, Renaud Lambiotte, Diego Garlaschelli,\n  Tiziano Squartini","authorsParsed":[["Gallo","Anna",""],["Saracco","Fabio",""],["Lambiotte","Renaud",""],["Garlaschelli","Diego",""],["Squartini","Tiziano",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 17:31:49 GMT"}],"updateDate":"2024-07-12","timestamp":1720719109000,"abstract":"  Most of the analyses concerning signed networks have focused on the balance\ntheory, hence identifying frustration with undirected, triadic motifs having an\nodd number of negative edges; much less attention has been paid to their\ndirected counterparts. To fill this gap, we focus on signed, directed\nconnections, with the aim of exploring the notion of frustration in such a\ncontext. When dealing with signed, directed edges, frustration is a\nmulti-faceted concept, admitting different definitions at different scales: if\nwe limit ourselves to consider cycles of length two, frustration is related to\nreciprocity, i.e. the tendency of edges to admit the presence of partners\npointing in the opposite direction. As the reciprocity of signed networks is\nstill poorly understood, we adopt a principled approach for its study, defining\nquantities and introducing models to consistently capture empirical patterns of\nthe kind. In order to quantify the tendency of empirical networks to form\neither mutualistic or antagonistic cycles of length two, we extend the\nExponential Random Graphs framework to binary, directed, signed networks with\nglobal and local constraints and, then, compare the empirical abundance of the\naforementioned patterns with the one expected under each model. We find that\nthe (directed extension of the) balance theory is not capable of providing a\nconsistent explanation of the patterns characterising the directed, signed\nnetworks considered in this work. Although part of the ambiguities can be\nsolved by adopting a coarser definition of balance, our results call for a\ndifferent theory, accounting for the directionality of edges in a coherent\nmanner. In any case, the evidence that the empirical, signed networks can be\nhighly reciprocated leads us to recommend to explicitly account for the role\nplayed by bidirectional dyads in determining frustration at higher levels (e.g.\nthe triadic one).\n","subjects":["Physics/Physics and Society","Physics/Applied Physics","Physics/Data Analysis, Statistics and Probability"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"88hd2xXkkAgOiueksQtOrzDbvO2B-o1fLijmfI2fXXs","pdfSize":"8089409"}