{"id":"2407.02774","title":"Quantum microwave photonic mixer with a large spurious-free dynamic\n  range","authors":"Xinghua Li, Yifan Guo, Xiao Xiang, Runai Quan, Mingtao Cao, Ruifang\n  Dong, Tao Liu, Ming Li and Shougang Zhang","authorsParsed":[["Li","Xinghua",""],["Guo","Yifan",""],["Xiang","Xiao",""],["Quan","Runai",""],["Cao","Mingtao",""],["Dong","Ruifang",""],["Liu","Tao",""],["Li","Ming",""],["Zhang","Shougang",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 03:03:03 GMT"}],"updateDate":"2024-07-04","timestamp":1719975783000,"abstract":"  As one of the most fundamental functionalities of microwave photonics,\nmicrowave frequency mixing plays an essential role in modern radars and\nwireless communication systems. However, the commonly utilized intensity\nmodulation in the systems often leads to inadequate spurious-free dynamic range\n(SFDR) for many sought-after applications. Quantum microwave photonics\ntechnique offers a promising solution for improving SFDR in terms of\nhigher-order harmonic distortion. In this paper, we demonstrate two types of\nquantum microwave photonic mixers based on the configuration of the intensity\nmodulators: cascade-type and parallel-type. Leveraging the nonlocal RF signal\nencoding capability, both types of quantum microwave photonic mixers not only\nexhibit the advantage of dual-channel output but also present significant\nimprovement in SFDR. Specifically, the parallel-type quantum microwave photonic\nmixer achieves a remarkable SFDR value of 113.6 dB.Hz1/2, which is 30 dB better\nthan that of the cascade-type quantum microwave photonic mixer. When compared\nto the classical microwave photonic mixer, this enhancement reaches a notable\n53.6 dB at the expense of 8 dB conversion loss. These results highlight the\nsuperiority of quantum microwave photonic mixers in the fields of microwave and\nmillimeter-wave systems. Further applying multi-photon frequency entangled\nsources as optical carriers, the dual-channel microwave frequency conversion\ncapability endowed by the quantum microwave photonic mixer can be extended to\nenhance the performance of multiple-paths microwave mixing which is essential\nfor radar net systems.\n","subjects":["Physics/Optics","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"QuKoNJT9iohjYIxjT4sUkEuG57tOFyFQ7NqUrJtd9qM","pdfSize":"916925","objectId":"0xea9b0e72d3fd238bf28d6501a4328f508ef9932ff6e69ff2cf85e03a95de378e","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
