{"id":"2407.07013","title":"Bow-shock structure of Sgr B molecular-cloud complex in the Galactic\n  Centre inferred from 3D CO-line kinematics","authors":"Yoshiaki Sofue","authorsParsed":[["Sofue","Yoshiaki",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 16:33:26 GMT"},{"version":"v2","created":"Fri, 12 Jul 2024 20:33:32 GMT"}],"updateDate":"2024-07-16","timestamp":1720542806000,"abstract":"  Three-dimensional (3D) bubble structure of the Sgr-B molecular-cloud complex\nis derived by a kinematical analysis of CO-line archival cube data of the\nGalactic Centre (GC) observed with the Nobeyama 45-m telescope. The\nline-of-sight depth is estimated by applying the face-on transformation method\nof radial velocity to the projected distance on the Galactic plane considering\nthe Galactic rotation of the central molecular zone (CMZ). The 3D complex\nexhibits a conical-horn structure with the Sgr-B2 cloud located in the farthest\nend on the line of sight at radial velocity $v_{\\rm lsr} \\sim 70$ km s$^{-1}$,\nand the entire complex composes a lopsided bubble opening toward the Sun at\n$v_{\\rm lsr}\\sim 50$ to 30 km s$^{-1}$. The line-of-sight extent of the complex\nis $\\sim 100$ pc according to the large velocity extent for several tens of km\ns$^{-1}$ from Sgr B2 to the outskirts. The entire complex exhibits a flattened\nconical bubble with full sizes $\\sim 40 {\\rm pc} \\times 20 {\\rm pc} \\times 100\n{\\rm pc}$ in the $l$, $b$ and line-of-sight directions, respectively. Based on\nthe 3D analysis, we propose a formation scenario of the giant molecular bubble\nstructure due to a galactic bow shock, and suggest that the star formation in\nSgr B2 was enhanced by dual-side compression of the B2 cloud by the Galactic\nshock wave from up-stream and expanding HII region from the down-stream side of\nthe GC Arm I in Galactic rotation.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"gQzj2tuY8xpmd-uftUOgb1s7mRJEU4Nx5UTV7bTwsBk","pdfSize":"8301505"}