{"id":"2407.20111","title":"Enhancing Anti-spoofing Countermeasures Robustness through Joint\n  Optimization and Transfer Learning","authors":"Yikang Wang, Xingming Wang, Hiromitsu Nishizaki, Ming Li","authorsParsed":[["Wang","Yikang",""],["Wang","Xingming",""],["Nishizaki","Hiromitsu",""],["Li","Ming",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 15:39:25 GMT"}],"updateDate":"2024-07-30","timestamp":1722267565000,"abstract":"  Current research in synthesized speech detection primarily focuses on the\ngeneralization of detection systems to unknown spoofing methods of noise-free\nspeech. However, the performance of anti-spoofing countermeasures (CM) system\nis often don't work as well in more challenging scenarios, such as those\ninvolving noise and reverberation. To address the problem of enhancing the\nrobustness of CM systems, we propose a transfer learning-based speech\nenhancement front-end joint optimization (TL-SEJ) method, investigating its\neffectiveness in improving robustness against noise and reverberation. We\nevaluated the proposed method's performance through a series of comparative and\nablation experiments. The experimental results show that, across different\nsignal-to-noise ratio test conditions, the proposed TL-SEJ method improves\nrecognition accuracy by 2.7% to 15.8% compared to the baseline. Compared to\nconventional data augmentation methods, our system achieves an accuracy\nimprovement ranging from 0.7% to 5.8% in various noisy conditions and from 1.7%\nto 2.8% under different RT60 reverberation scenarios. These experiments\ndemonstrate that the proposed method effectively enhances system robustness in\nnoisy and reverberant conditions.\n","subjects":["Computing Research Repository/Sound","Electrical Engineering and Systems Science/Audio and Speech Processing","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"cw636hESFb05Ps7QKqpCdQReWwicvZTJrZ52nF0jABE","pdfSize":"675320"}