{"id":"2407.08073","title":"NDST: Neural Driving Style Transfer for Human-Like Vision-Based\n  Autonomous Driving","authors":"Donghyun Kim, Aws Khalil, Haewoon Nam, Jaerock Kwon","authorsParsed":[["Kim","Donghyun",""],["Khalil","Aws",""],["Nam","Haewoon",""],["Kwon","Jaerock",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 22:26:45 GMT"}],"updateDate":"2024-07-12","timestamp":1720650405000,"abstract":"  Autonomous Vehicles (AV) and Advanced Driver Assistant Systems (ADAS)\nprioritize safety over comfort. The intertwining factors of safety and comfort\nemerge as pivotal elements in ensuring the effectiveness of Autonomous Driving\n(AD). Users often experience discomfort when AV or ADAS drive the vehicle on\ntheir behalf. Providing a personalized human-like AD experience, tailored to\nmatch users' unique driving styles while adhering to safety prerequisites,\npresents a significant opportunity to boost the acceptance of AVs. This paper\nproposes a novel approach, Neural Driving Style Transfer (NDST), inspired by\nNeural Style Transfer (NST), to address this issue. NDST integrates a\nPersonalized Block (PB) into the conventional Baseline Driving Model (BDM),\nallowing for the transfer of a user's unique driving style while adhering to\nsafety parameters. The PB serves as a self-configuring system, learning and\nadapting to an individual's driving behavior without requiring modifications to\nthe BDM. This approach enables the personalization of AV models, aligning the\ndriving style more closely with user preferences while ensuring baseline safety\ncritical actuation. Two contrasting driving styles (Style A and Style B) were\nused to validate the proposed NDST methodology, demonstrating its efficacy in\ntransferring personal driving styles to the AV system. Our work highlights the\npotential of NDST to enhance user comfort in AVs by providing a personalized\nand familiar driving experience. The findings affirm the feasibility of\nintegrating NDST into existing AV frameworks to bridge the gap between safety\nand individualized driving styles, promoting wider acceptance and improved user\nexperiences.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"XzyMej8goftiAuxKyw8Za-qyNyoP-yPPg4hvGHfjHY4","pdfSize":"8988858"}