{"id":"2407.05390","title":"Magnetic fields in star forming environments: how does field strength\n  affect gas on spiral arm and cloud scales?","authors":"Nicholas P. Herrington, Clare L. Dobbs and Thomas J. R. Bending","authorsParsed":[["Herrington","Nicholas P.",""],["Dobbs","Clare L.",""],["Bending","Thomas J. R.",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 14:36:30 GMT"}],"updateDate":"2024-07-09","timestamp":1720362990000,"abstract":"  We investigate star formation from subparsec to kpc scales with\nmagnetohydrodynamic (MHD) models of a cloud structure and a section of galactic\nspiral arm. We aim to understand how magnetic fields affect star formation,\ncloud formation and how feedback couples with magnetic fields on scales of\nclouds and clumps. We find that magnetic fields overall suppress star formation\nby $\\sim$10% with a weak field (5 $\\mu$G), and $\\sim50$% with a stronger field\n(50 $\\mu$G). Cluster masses are reduced by about 40% with a strong field but\nshow little change with a weak field. We find that clouds tend to be aligned\nparallel to the field with a weak field, and become perpendicularly aligned\nwith a stronger field, whereas on clump scales the alignment is more random.\nThe magnetic fields and densities of clouds and clumps in our models agree with\nthe Zeeman measurements of the Crutcher relation $B-\\rho$ in the weaker field\nmodels, whilst the strongest field models show a relation which is too flat\ncompared to the observations. In all our models, we find both subcritical and\nsupercritical clouds and clumps are present. We also find that if using a line\nof sight (1D) measure of the magnetic field to determine the critical\nparameter, the magnetic field, and thereby also criticality, can vary by a\nfactor of 3-4 depending on whether the direction the field is measured along\ncorresponds to the direction of the ordered component of the magnetic field.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"v2NXemwEVq7t5kc4La8iYPriuRhUtNovVr_PPSar7Ew","pdfSize":"4297883"}