{"id":"2407.12001","title":"The Elephant in the Room: Software and Hardware Security Vulnerabilities\n  of Portable Sequencing Devices","authors":"Carson Stillman, Jonathan E. Bravo, Christina Boucher, Sara Rampazzi","authorsParsed":[["Stillman","Carson",""],["Bravo","Jonathan E.",""],["Boucher","Christina",""],["Rampazzi","Sara",""]],"versions":[{"version":"v1","created":"Fri, 14 Jun 2024 18:02:01 GMT"}],"updateDate":"2024-07-18","timestamp":1718388121000,"abstract":"  Portable genome sequencing technology is revolutionizing genomic research by\nproviding a faster, more flexible method of sequencing DNA and RNA [1, 2]. The\nunprecedented shift from bulky stand-alone benchtop equipment confined in a\nlaboratory setting to small portable devices which can be easily carried\nanywhere outside the laboratory network and connected to untrusted external\ncomputers to perform sequencing raises new security and privacy threats not\nconsidered before. Current research primarily addresses the privacy of DNA/RNA\ndata in online databases [3] and the security of stand-alone sequencing devices\nsuch as Illumina [4]. However, it overlooks the security risks arising from\ncompromises of computer devices directly connected to portable sequencers as\nillustrated in Fig. 1. While highly sensitive data, such as the human genome,\nhas become easier to sequence, the networks connecting to these smaller devices\nand the hardware running basecalling can no longer implicitly be trusted, and\ndoing so can deteriorate the confidentiality and integrity of the genomic data\nbeing processed.\n  Here, we present new security and privacy threats of portable sequencing\ntechnology and recommendations to aid in ensuring sequencing data is kept\nprivate and secure. First, to prevent unauthorized access to sequencing\ndevices, IP addresses should not be considered a sufficient authentication\nmechanism. Second, integrity checks are necessary for all data passed from the\nsequencer to external computers to avoid data manipulation. Finally, encryption\nshould be considered as data is passed from the sequencer to such external\ncomputers to prevent eavesdropping on data as it is sent and stored. As devices\nand technology rapidly change, it becomes paramount to reevaluate security\nrequirements alongside them or risk leaving some of our most sensitive data\nexposed.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"zepjcZAGmLtS6kf_sKJmZ-PYTztgOY8jHm38bHt9Ssc","pdfSize":"302526"}