{"id":"2407.14639","title":"A multi-body finite element model for hydrogel packings: Linear response\n  to shear","authors":"Ahmed Elgailani, Craig E Maloney","authorsParsed":[["Elgailani","Ahmed",""],["Maloney","Craig E",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 19:28:54 GMT"}],"updateDate":"2024-07-23","timestamp":1721417334000,"abstract":"  We study a multi-body finite element model of a packing of hydrogel particles\nusing the Flory-Rehner constitutive law to model the deformation of the swollen\npolymer network. We show that while the dependence of the pressure, $\\Pi$, on\nthe effective volume fraction, $\\phi$, is virtually identical to a monolithic\nFlory material, the shear modulus, $\\mu$, behaves in a non-trivial way. $\\mu$\nincreases monotonically with $\\Pi$ from zero and remains below about $80\\%$ of\nthe monolithic Flory value at the largest $\\Pi$ we study here. The local shear\nstrain in the particles has a large spatial variation. Local strains near the\ncenters of the particles are all roughly equal to the applied shear strain, but\nthe local strains near the contact facets are much smaller and depend on the\norientation of the facet. We show that the slip between particles at the facets\ndepends strongly on the orientation of the facet and is, on average,\nproportional to the component of the applied shear strain resolved onto the\nfacet orientation. This slip screens the stress transmission and results in a\nreduction of the shear modulus relative to what one would obtain if the\nparticles were welded together at the facet. Surprisingly, given the reduction\nin the shear modulus arising from the facet slip, and the spatial variations in\nthe local shear strain inside the particles themselves, the deformation of the\nparticle centroids is rather homogeneous with the strains of the Delaunay\ntriangles having fluctuations of only order $\\pm 5\\%$. These results should\nopen the way to construction of quantitative estimates of the shear modulus in\nhighly compressed packings via mean-field, effective-medium type approaches.\n","subjects":["Condensed Matter/Soft Condensed Matter","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"b-qRZdmy9AOq9z-EqZFJWqgdqQFxbahNq6TMvcmxkrA","pdfSize":"7802399"}