{"id":"2407.12564","title":"Shackling Uncertainty using Mixed Criticality in Monte-Carlo Tree Search","authors":"Franco Cordeiro, Samuel Tardieu, Laurent Pautet","authorsParsed":[["Cordeiro","Franco",""],["Tardieu","Samuel",""],["Pautet","Laurent",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 13:48:05 GMT"}],"updateDate":"2024-07-18","timestamp":1721224085000,"abstract":"  In the world of embedded systems, optimizing actions with the uncertain costs\nof multiple resources is a complex challenge. Existing methods include plan\nbuilding based on Monte Carlo Tree Search (MCTS), an approach that thrives in\nmultiple online planning scenarios. However, these methods often overlook\nuncertainty in worst-case cost estimations. A system can fail to operate before\nachieving a critical objective when actual costs exceed optimistic worst-case\nestimates. Conversely, a system based on pessimistic worst-case estimates would\nlead to resource over-provisioning even for less critical objectives. To solve\nsimilar issues, the Mixed Criticality (MC) approach has been developed in the\nreal-time systems community. In this paper, we propose to extend the MCTS\nheuristic in three directions.\n  Firstly, we reformulate the concept of MC to account for uncertain worst-case\ncosts. High-criticality tasks must be executed regardless of their uncertain\ncosts. Low-criticality tasks are either executed in low-criticality mode\nutilizing resources up-to their optimistic worst-case estimates, or executed in\nhigh-criticality mode by degrading them, or discarded when resources are\nscarce.\n  Secondly, although the MC approach was originally developed for real-time\nsystems, focusing primarily on worst-case execution time as the only uncertain\nresource, our approach extends the concept of resources to deal with several\nresources at once, such as the time and energy required to perform an action.\n  Finally, we propose an extension of MCTS with MC concepts, which we refer to\nas $(MC)^2TS$, to efficiently adjust resource allocation to uncertain costs\naccording to the criticality of actions. We demonstrate our approach in an\nactive perception scenario. Our evaluation shows $(MC)^2TS$ outperforms the\ntraditional MCTS regardless of whether the worst case estimates are optimistic\nor pessimistic.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"kimci-krPrOi0CuSpJ5a_dEohpfm5nuydAx8-TJvNCQ","pdfSize":"305951"}