{"id":"2407.04048","title":"Time-bin entangled Bell state generation and tomography on thin-film\n  lithium niobate","authors":"Giovanni Finco, Filippo Miserocchi, Andreas Maeder, Jost Kellner,\n  Alessandra Sabatti, Robert J. Chapman, and Rachel Grange","authorsParsed":[["Finco","Giovanni",""],["Miserocchi","Filippo",""],["Maeder","Andreas",""],["Kellner","Jost",""],["Sabatti","Alessandra",""],["Chapman","Robert J.",""],["Grange","Rachel",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 16:43:36 GMT"}],"updateDate":"2024-07-08","timestamp":1720111416000,"abstract":"  Optical quantum communication technologies are making the prospect of\nunconditionally secure and efficient information transfer a reality. The\npossibility of generating and reliably detecting quantum states of light, with\nthe further need of increasing the private data-rate is where most research\nefforts are focusing. The physical concept of entanglement is a solution\nguaranteeing the highest degree of security in device-independent schemes, yet\nits implementation and preservation over long communication links is hard to\nachieve. Lithium niobate-on-insulator has emerged as a revolutionising platform\nfor high-speed classical telecommunication and is equally suited for quantum\ninformation applications owing to the large second-order nonlinearities that\ncan efficiently produce entangled photon pairs. In this work, we generate\nmaximally entangled quantum states in the time-bin basis using lithium\nniobate-on-insulator photonics at the fibre optics telecommunication\nwavelength, and reconstruct the density matrix by quantum tomography on a\nsingle photonic integrated circuit. We use on-chip periodically-poled lithium\nniobate as source of entangled qubits with a brightness of 242 MHz/mW and\nperform quantum tomography with a fidelity of 91.9+-1.0 %. Our results,\ncombined with the established large electro-optic bandwidth of lithium niobate,\nshowcase the platform as perfect candidate to realise fibre-coupled, high-speed\ntime-bin quantum communication modules that exploit entanglement to achieve\ninformation security.\n","subjects":["Physics/Quantum Physics","Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"hYeCHEyUfZd37e2IlPeSqa_zPBt60Qvis0XFMVVIEvM","pdfSize":"33361487"}