{"id":"2407.18681","title":"A Lyapunov Analysis of Accelerated PDHG Algorithms","authors":"Xueying Zeng, Bin Shi","authorsParsed":[["Zeng","Xueying",""],["Shi","Bin",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 11:52:11 GMT"}],"updateDate":"2024-07-29","timestamp":1721994731000,"abstract":"  The generalized Lasso is a remarkably versatile and extensively utilized\nmodel across a broad spectrum of domains, including statistics, machine\nlearning, and image science. Among the optimization techniques employed to\naddress the challenges posed by this model, saddle-point methods stand out for\ntheir effectiveness. In particular, the primal-dual hybrid gradient (PDHG)\nalgorithm has emerged as a highly popular choice, celebrated for its robustness\nand efficiency in finding optimal solutions. Recently, the underlying mechanism\nof the PDHG algorithm has been elucidated through the high-resolution ordinary\ndifferential equation (ODE) and the implicit-Euler scheme as detailed in [Li\nand Shi, 2024a]. This insight has spurred the development of several\naccelerated variants of the PDHG algorithm, originally proposed by [Chambolle\nand Pock, 2011]. By employing discrete Lyapunov analysis, we establish that the\nPDHG algorithm with iteration-varying step sizes, converges at a rate near\n$O(1/k^2)$. Furthermore, for the specific setting where $\\tau_{k+1}\\sigma_k =\ns^2$ and $\\theta_k = \\tau_{k+1}/\\tau_k \\in (0, 1)$ as proposed in [Chambolle\nand Pock, 2011], an even faster convergence rate of $O(1/k^2)$ can be achieved.\nTo substantiate these findings, we design a novel discrete Lyapunov function.\nThis function is distinguished by its succinctness and straightforwardness,\nproviding a clear and elegant proof of the enhanced convergence properties of\nthe PDHG algorithm under the specified conditions. Finally, we utilize the\ndiscrete Lyapunov function to establish the optimal linear convergence rate\nwhen both the objective functions are strongly convex.\n","subjects":["Mathematics/Optimization and Control","Computing Research Repository/Numerical Analysis","Mathematics/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"9LAHHHzK8q6TFp86u81eLiwmCRzQPH-T7T4OEU7aY4o","pdfSize":"235137"}