{"id":"2407.03080","title":"Artificial Inductive Bias for Synthetic Tabular Data Generation in\n  Data-Scarce Scenarios","authors":"Patricia A. Apell\\'aniz and Ana Jim\\'enez and Borja Arroyo Galende and\n  Juan Parras and Santiago Zazo","authorsParsed":[["Apellániz","Patricia A.",""],["Jiménez","Ana",""],["Galende","Borja Arroyo",""],["Parras","Juan",""],["Zazo","Santiago",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 12:53:42 GMT"}],"updateDate":"2024-07-04","timestamp":1720011222000,"abstract":"  While synthetic tabular data generation using Deep Generative Models (DGMs)\noffers a compelling solution to data scarcity and privacy concerns, their\neffectiveness relies on substantial training data, often unavailable in\nreal-world applications. This paper addresses this challenge by proposing a\nnovel methodology for generating realistic and reliable synthetic tabular data\nwith DGMs in limited real-data environments. Our approach proposes several ways\nto generate an artificial inductive bias in a DGM through transfer learning and\nmeta-learning techniques. We explore and compare four different methods within\nthis framework, demonstrating that transfer learning strategies like\npre-training and model averaging outperform meta-learning approaches, like\nModel-Agnostic Meta-Learning, and Domain Randomized Search. We validate our\napproach using two state-of-the-art DGMs, namely, a Variational Autoencoder and\na Generative Adversarial Network, to show that our artificial inductive bias\nfuels superior synthetic data quality, as measured by Jensen-Shannon\ndivergence, achieving relative gains of up to 50\\% when using our proposed\napproach. This methodology has broad applicability in various DGMs and machine\nlearning tasks, particularly in areas like healthcare and finance, where data\nscarcity is often a critical issue.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"qX_4ynPRHwTQZS0YQ84vZSrDreZVonCqs5ePe20qPas","pdfSize":"1372358"}