{"id":"2407.15887","title":"Separable DeepONet: Breaking the Curse of Dimensionality in\n  Physics-Informed Machine Learning","authors":"Luis Mandl, Somdatta Goswami, Lena Lambers, Tim Ricken","authorsParsed":[["Mandl","Luis",""],["Goswami","Somdatta",""],["Lambers","Lena",""],["Ricken","Tim",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 16:33:56 GMT"},{"version":"v2","created":"Thu, 25 Jul 2024 20:16:50 GMT"}],"updateDate":"2024-07-29","timestamp":1721579636000,"abstract":"  The deep operator network (DeepONet) is a popular neural operator\narchitecture that has shown promise in solving partial differential equations\n(PDEs) by using deep neural networks to map between infinite-dimensional\nfunction spaces. In the absence of labeled datasets, we utilize the PDE\nresidual loss to learn the physical system, an approach known as\nphysics-informed DeepONet. This method faces significant computational\nchallenges, primarily due to the curse of dimensionality, as the computational\ncost increases exponentially with finer discretization. In this paper, we\nintroduce the Separable DeepONet framework to address these challenges and\nimprove scalability for high-dimensional PDEs. Our approach involves a\nfactorization technique where sub-networks handle individual one-dimensional\ncoordinates, thereby reducing the number of forward passes and the size of the\nJacobian matrix. By using forward-mode automatic differentiation, we further\noptimize the computational cost related to the Jacobian matrix. As a result,\nour modifications lead to a linear scaling of computational cost with\ndiscretization density, making Separable DeepONet suitable for high-dimensional\nPDEs. We validate the effectiveness of the separable architecture through three\nbenchmark PDE models: the viscous Burgers equation, Biot's consolidation\ntheory, and a parametrized heat equation. In all cases, our proposed framework\nachieves comparable or improved accuracy while significantly reducing\ncomputational time compared to conventional DeepONet. These results demonstrate\nthe potential of Separable DeepONet in efficiently solving complex,\nhigh-dimensional PDEs, advancing the field of physics-informed machine\nlearning.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"BeZrxYc_6NX94oCpcaWzTs3jiJtGLWN1KzQmik1Stsg","pdfSize":"1588075"}