{"id":"2407.02015","title":"Robust First and Second-Order Differentiation for Regularized Optimal\n  Transport","authors":"Xingjie Li, Fei Lu, Molei Tao and Felix X.-F. Ye","authorsParsed":[["Li","Xingjie",""],["Lu","Fei",""],["Tao","Molei",""],["Ye","Felix X. -F.",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 07:37:04 GMT"}],"updateDate":"2024-07-03","timestamp":1719905824000,"abstract":"  Applications such as unbalanced and fully shuffled regression can be\napproached by optimizing regularized optimal transport (OT) distances, such as\nthe entropic OT and Sinkhorn distances. A common approach for this optimization\nis to use a first-order optimizer, which requires the gradient of the OT\ndistance. For faster convergence, one might also resort to a second-order\noptimizer, which additionally requires the Hessian. The computations of these\nderivatives are crucial for efficient and accurate optimization. However, they\npresent significant challenges in terms of memory consumption and numerical\ninstability, especially for large datasets and small regularization strengths.\nWe circumvent these issues by analytically computing the gradients for OT\ndistances and the Hessian for the entropic OT distance, which was not\npreviously used due to intricate tensor-wise calculations and the complex\ndependency on parameters within the bi-level loss function. Through analytical\nderivation and spectral analysis, we identify and resolve the numerical\ninstability caused by the singularity and ill-posedness of a key linear system.\nConsequently, we achieve scalable and stable computation of the Hessian,\nenabling the implementation of the stochastic gradient descent (SGD)-Newton\nmethods. Tests on shuffled regression examples demonstrate that the second\nstage of the SGD-Newton method converges orders of magnitude faster than the\ngradient descent-only method while achieving significantly more accurate\nparameter estimations.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"Uk1JnT4i0WuEROX70v31pIyc_kcvSsZbQTN5wYGq6eo","pdfSize":"5836434","objectId":"0x1c3da1f03e3148241dfacaf817659dabfc43e1be01f20165c36fe6fcf4400f3f","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
