{"id":"2407.11084","title":"A Survey of Distance-Based Vessel Trajectory Clustering: Data\n  Pre-processing, Methodologies, Applications, and Experimental Evaluation","authors":"Maohan Liang, Ryan Wen Liu, Ruobin Gao, Zhe Xiao, Xiaocai Zhang, and\n  Hua Wang","authorsParsed":[["Liang","Maohan",""],["Liu","Ryan Wen",""],["Gao","Ruobin",""],["Xiao","Zhe",""],["Zhang","Xiaocai",""],["Wang","Hua",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 17:02:44 GMT"},{"version":"v2","created":"Fri, 19 Jul 2024 05:27:50 GMT"}],"updateDate":"2024-07-22","timestamp":1720890164000,"abstract":"  Vessel trajectory clustering, a crucial component of the maritime intelligent\ntransportation systems, provides valuable insights for applications such as\nanomaly detection and trajectory prediction. This paper presents a\ncomprehensive survey of the most prevalent distance-based vessel trajectory\nclustering methods, which encompass two main steps: trajectory similarity\nmeasurement and clustering. Initially, we conducted a thorough literature\nreview using relevant keywords to gather and summarize pertinent research\npapers and datasets. Then, this paper discussed the principal methods of data\npre-processing that prepare data for further analysis. The survey progresses to\ndetail the leading algorithms for measuring vessel trajectory similarity and\nthe main clustering techniques used in the field today. Furthermore, the\nvarious applications of trajectory clustering within the maritime context are\nexplored. Finally, the paper evaluates the effectiveness of different algorithm\ncombinations and pre-processing methods through experimental analysis, focusing\non their impact on the performance of distance-based trajectory clustering\nalgorithms. The experimental results demonstrate the effectiveness of various\ntrajectory clustering algorithms and notably highlight the significant\nimprovements that trajectory compression techniques contribute to the\nefficiency and accuracy of trajectory clustering. This comprehensive approach\nensures a deep understanding of current capabilities and future directions in\nvessel trajectory clustering.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"yMSzzsvYNNsUercJtjxvFuEa1lwLWXEzrkzuITvuxWY","pdfSize":"4570932","objectId":"0x68018b3b8b7b8996090973836caef25f6b8f4782715e9408f87f912e203184da","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
