{"id":"2407.19016","title":"A Data-driven Spectral Model of Main Sequence Stars in Gaia DR3","authors":"Isabel Angelo, Megan Bedell, Erik Petigura, Melissa Ness","authorsParsed":[["Angelo","Isabel",""],["Bedell","Megan",""],["Petigura","Erik",""],["Ness","Melissa",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 18:00:25 GMT"}],"updateDate":"2024-07-30","timestamp":1722016825000,"abstract":"  Precise spectroscopic classification of planet hosts is an important tool of\nexoplanet research at both the population and individual system level. In the\nera of large-scale surveys, data-driven methods offer an efficient approach to\nspectroscopic classification that leverages the fact that a subset of stars in\nany given survey has stellar properties that are known with high fidelity.\nHere, we use The Cannon, a data-driven framework for modeling stellar spectra,\nto train a generative model of spectra from the Gaia Data Release 3 Radial\nVelocity Spectrometer. Our model derives stellar labels with precisions of 72 K\nin Teff , 0.09 dex in log g, 0.06 dex in [Fe/H], 0.05 dex in [{\\alpha}/Fe] and\n1.9 km/s in vbroad for main-sequence stars observed by Gaia DR3 by transferring\nGALAH labels, and is publicly available at\nhttps://github.com/isabelangelo/gaiaspec. We validate our model performance on\nplanet hosts with available Gaia RVS spectra at SNR>50 by showing that our\nmodel is able to recover stellar parameters at {\\geq}20% improved accuracy over\nthe existing Gaia stellar parameter catalogs, measured by the agreement with\nhigh-fidelity labels from the Spectroscopic Observations of Cool Stars (SPOCS)\nsurvey. We also provide metrics to test for stellar activity, binarity, and\nreliability of our model outputs and provide instructions for interpreting\nthese metrics. Finally, we publish updated stellar labels and metrics that flag\nsuspected binaries and active stars for Kepler Input Catalog objects with\npublished Gaia RVS spectra.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"yxS-GcTASUn3cFhK-0XDLV5kJbSjwKBaK0ZgmBu429Q","pdfSize":"3557130"}