{"id":"2407.20402","title":"Channel Estimation for Beyond Diagonal RIS via Tensor Decomposition","authors":"Andr\\'e L. F. de Almeida, Bruno Sokal, Hongyu Li, and Bruno Clerckx","authorsParsed":[["de Almeida","André L. F.",""],["Sokal","Bruno",""],["Li","Hongyu",""],["Clerckx","Bruno",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 20:05:58 GMT"}],"updateDate":"2024-07-31","timestamp":1722283558000,"abstract":"  This paper addresses the channel estimation problem for beyond diagonal\nreconfigurable intelligent surface (BD-RIS) from a tensor decomposition\nperspective. We first show that the received pilot signals can be arranged as a\nthree-way tensor, allowing us to recast the cascaded channel estimation problem\nas a block Tucker decomposition problem that yields decoupled estimates for the\ninvolved channel matrices while offering a substantial performance gain over\nthe conventional (matrix-based) least squares (LS) estimation method. More\nspecifically, we develop two solutions to solve the problem. The first one is a\nclosed-form solution that extracts the channel estimates via a block Tucker\nKronecker factorization (BTKF), which boils down to solving a set of parallel\nrank-one matrix approximation problems. Exploiting such a low-rank property\nyields a noise rejection gain compared to the standard LS estimation scheme\nwhile allowing the two involved channels to be estimated separately. The second\nsolution is based on a block Tucker alternating least squares (BTALS) algorithm\nthat directly estimates the involved channel matrices using an iterative\nestimation procedure. We discuss the uniqueness and identifiability issues and\ntheir implications for training design. We also propose a tensor-based design\nof the BD-RIS training tensor for each algorithm that ensures unique decoupled\nchannel estimates under trivial scaling ambiguities. Our numerical results shed\nlight on the tradeoffs offered by BTKF and BTALS methods. Specifically, while\nthe first enjoys fast and parallel extraction of the channel estimates in\nclosed form, the second has a more flexible training design, allowing for a\nsignificantly reduced training overhead compared to the state-of-the-art LS\nmethod.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"PtHK4TRZA0AxzHXB3FoVBsja9O86AT5dORKJbQFJk-M","pdfSize":"1463660"}