{"id":"2407.00976","title":"ODIN: Open Data In Neurophysiology: Advancements, Solutions & Challenges","authors":"Colleen J. Gillon, Cody Baker, Ryan Ly, Edoardo Balzani, Bingni W.\n  Brunton, Manuel Schottdorf, Satrajit Ghosh, Nima Dehghani","authorsParsed":[["Gillon","Colleen J.",""],["Baker","Cody",""],["Ly","Ryan",""],["Balzani","Edoardo",""],["Brunton","Bingni W.",""],["Schottdorf","Manuel",""],["Ghosh","Satrajit",""],["Dehghani","Nima",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 05:26:30 GMT"}],"updateDate":"2024-07-02","timestamp":1719811590000,"abstract":"  Across the life sciences, an ongoing effort over the last 50 years has made\ndata and methods more reproducible and transparent. This openness has led to\ntransformative insights and vastly accelerated scientific progress. For\nexample, structural biology and genomics have undertaken systematic collection\nand publication of protein sequences and structures over the past half-century,\nand these data have led to scientific breakthroughs that were unthinkable when\ndata collection first began. We believe that neuroscience is poised to follow\nthe same path, and that principles of open data and open science will transform\nour understanding of the nervous system in ways that are impossible to predict\nat the moment.\n  To this end, new social structures along with active and open scientific\ncommunities are essential to facilitate and expand the still limited adoption\nof open science practices in our field. Unified by shared values of openness,\nwe set out to organize a symposium for Open Data in Neuroscience (ODIN) to\nstrengthen our community and facilitate transformative neuroscience research at\nlarge. In this report, we share what we learned during this first ODIN event.\nWe also lay out plans for how to grow this movement, document emerging\nconversations, and propose a path toward a better and more transparent science\nof tomorrow.\n","subjects":["Quantitative Biology/Neurons and Cognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"DyoTVG4540TF03YykVG7lmgQD0Vxnq5A3uQ3r49_kwg","pdfSize":"1425091"}