{"id":"2407.03629","title":"Random walk with horizontal and cyclic currents","authors":"Joanna Li, Matthew Gerry, Israel Klich, Dvira Segal","authorsParsed":[["Li","Joanna",""],["Gerry","Matthew",""],["Klich","Israel",""],["Segal","Dvira",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 04:44:06 GMT"}],"updateDate":"2024-07-08","timestamp":1720068246000,"abstract":"  We construct a minimal two-chain random walk model and study the information\nthat fluctuations of the flux and higher cumulants can reveal about the model:\nits structure, parameters, and whether it operates under nonequilibrium\nconditions. The two coupled chains allow for both horizontal and cyclic\ntransport. We capture these processes by deriving the cumulant generating\nfunction of the system, which characterizes both horizontal and cyclic\ntransport in the long time limit. First, we show that either the horizontal or\nthe cyclic currents, along with their higher-order cumulants, can be used to\nunravel the intrinsic structure and parameters of the model. Second, we\ninvestigate the \"zero current\" situation, in which the {\\it horizontal} current\nvanishes. We find that fluctuations of the horizontal current reveal the\nnonequilibrium condition at intermediate bias, while the cyclic current remains\nnonzero throughout. We also show that in nonequilibrium scenarios close to the\nzero {\\it horizontal} current limit, the entropy production rate is more\ntightly lower-bounded by the relative noise of the {\\it cyclic} current, and\nvice versa. Finally, simulations of transport before the steady state sets in\nallow for the extraction of the interchain hopping rate. Our study,\nillustrating the information concealed in fluctuations, could see applications\nin chemical networks, cellular processes, and charge and energy transport\nmaterials.\n","subjects":["Condensed Matter/Statistical Mechanics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ll9EAQh11_XQnaI_PhykeOlyyrJTflIhRkSSNHn0Uqw","pdfSize":"5386865"}