{"id":"2407.21299","title":"Who should I trust? A Visual Analytics Approach for Comparing Net Load\n  Forecasting Models","authors":"Kaustav Bhattacharjee, Soumya Kundu, Indrasis Chakraborty, and Aritra\n  Dasgupta","authorsParsed":[["Bhattacharjee","Kaustav",""],["Kundu","Soumya",""],["Chakraborty","Indrasis",""],["Dasgupta","Aritra",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 02:57:21 GMT"}],"updateDate":"2024-08-01","timestamp":1722394641000,"abstract":"  Net load forecasting is crucial for energy planning and facilitating informed\ndecision-making regarding trade and load distributions. However, evaluating\nforecasting models' performance against benchmark models remains challenging,\nthereby impeding experts' trust in the model's performance. In this context,\nthere is a demand for technological interventions that allow scientists to\ncompare models across various timeframes and solar penetration levels. This\npaper introduces a visual analytics-based application designed to compare the\nperformance of deep-learning-based net load forecasting models with other\nmodels for probabilistic net load forecasting. This application employs\ncarefully selected visual analytic interventions, enabling users to discern\ndifferences in model performance across different solar penetration levels,\ndataset resolutions, and hours of the day over multiple months. We also present\nobservations made using our application through a case study, demonstrating the\neffectiveness of visualizations in aiding scientists in making informed\ndecisions and enhancing trust in net load forecasting models.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Signal Processing","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"ykiQGqKGdZpvTxKdhfzbF-QljH8Vl0i1Yni8CQ4_hUo","pdfSize":"4493528"}