{"id":"2407.11280","title":"Intelligent Cross-Organizational Process Mining: A Survey and New\n  Perspectives","authors":"Yiyuan Yang, Zheshun Wu, Yong Chu, Zhenghua Chen, Zenglin Xu, Qingsong\n  Wen","authorsParsed":[["Yang","Yiyuan",""],["Wu","Zheshun",""],["Chu","Yong",""],["Chen","Zhenghua",""],["Xu","Zenglin",""],["Wen","Qingsong",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 23:30:34 GMT"}],"updateDate":"2024-07-17","timestamp":1721086234000,"abstract":"  Process mining, as a high-level field in data mining, plays a crucial role in\nenhancing operational efficiency and decision-making across organizations. In\nthis survey paper, we delve into the growing significance and ongoing trends in\nthe field of process mining, advocating a specific viewpoint on its contents,\napplication, and development in modern businesses and process management,\nparticularly in cross-organizational settings. We first summarize the framework\nof process mining, common industrial applications, and the latest advances\ncombined with artificial intelligence, such as workflow optimization,\ncompliance checking, and performance analysis. Then, we propose a holistic\nframework for intelligent process analysis and outline initial methodologies in\ncross-organizational settings, highlighting both challenges and opportunities.\nThis particular perspective aims to revolutionize process mining by leveraging\nartificial intelligence to offer sophisticated solutions for complex,\nmulti-organizational data analysis. By integrating advanced machine learning\ntechniques, we can enhance predictive capabilities, streamline processes, and\nfacilitate real-time decision-making. Furthermore, we pinpoint avenues for\nfuture investigations within the research community, encouraging the\nexploration of innovative algorithms, data integration strategies, and\nprivacy-preserving methods to fully harness the potential of process mining in\ndiverse, interconnected business environments.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computational Engineering, Finance, and Science","Computing Research Repository/Databases","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"SCTSZfQNxE8_K9wrfXtiroUOGWal_ioxQz900_zPPrc","pdfSize":"993040"}