{"id":"2407.20728","title":"Neural Fields for Continuous Periodic Motion Estimation in 4D\n  Cardiovascular Imaging","authors":"Simone Garzia, Patryk Rygiel, Sven Dummer, Filippo Cademartiri, Simona\n  Celi, and Jelmer M. Wolterink","authorsParsed":[["Garzia","Simone",""],["Rygiel","Patryk",""],["Dummer","Sven",""],["Cademartiri","Filippo",""],["Celi","Simona",""],["Wolterink","Jelmer M.",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 10:50:51 GMT"}],"updateDate":"2024-07-31","timestamp":1722336651000,"abstract":"  Time-resolved three-dimensional flow MRI (4D flow MRI) provides a unique\nnon-invasive solution to visualize and quantify hemodynamics in blood vessels\nsuch as the aortic arch. However, most current analysis methods for arterial 4D\nflow MRI use static artery walls because of the difficulty in obtaining a full\ncycle segmentation. To overcome this limitation, we propose a neural\nfields-based method that directly estimates continuous periodic wall\ndeformations throughout the cardiac cycle. For a 3D + time imaging dataset, we\noptimize an implicit neural representation (INR) that represents a\ntime-dependent velocity vector field (VVF). An ODE solver is used to integrate\nthe VVF into a deformation vector field (DVF), that can deform images,\nsegmentation masks, or meshes over time, thereby visualizing and quantifying\nlocal wall motion patterns. To properly reflect the periodic nature of 3D +\ntime cardiovascular data, we impose periodicity in two ways. First, by\nperiodically encoding the time input to the INR, and hence VVF. Second, by\nregularizing the DVF. We demonstrate the effectiveness of this approach on\nsynthetic data with different periodic patterns, ECG-gated CT, and 4D flow MRI\ndata. The obtained method could be used to improve 4D flow MRI analysis.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"2E3DBSgYiBb4VSywqa3bcwKPl7hdcgRS4SHszy6QLys","pdfSize":"3414342"}