{"id":"2407.21016","title":"Add-SD: Rational Generation without Manual Reference","authors":"Lingfeng Yang, Xinyu Zhang, Xiang Li, Jinwen Chen, Kun Yao, Gang\n  Zhang, Errui Ding, Lingqiao Liu, Jingdong Wang, Jian Yang","authorsParsed":[["Yang","Lingfeng",""],["Zhang","Xinyu",""],["Li","Xiang",""],["Chen","Jinwen",""],["Yao","Kun",""],["Zhang","Gang",""],["Ding","Errui",""],["Liu","Lingqiao",""],["Wang","Jingdong",""],["Yang","Jian",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 17:58:13 GMT"}],"updateDate":"2024-07-31","timestamp":1722362293000,"abstract":"  Diffusion models have exhibited remarkable prowess in visual generalization.\nBuilding on this success, we introduce an instruction-based object addition\npipeline, named Add-SD, which automatically inserts objects into realistic\nscenes with rational sizes and positions. Different from layout-conditioned\nmethods, Add-SD is solely conditioned on simple text prompts rather than any\nother human-costly references like bounding boxes. Our work contributes in\nthree aspects: proposing a dataset containing numerous instructed image pairs;\nfine-tuning a diffusion model for rational generation; and generating synthetic\ndata to boost downstream tasks. The first aspect involves creating a\nRemovalDataset consisting of original-edited image pairs with textual\ninstructions, where an object has been removed from the original image while\nmaintaining strong pixel consistency in the background. These data pairs are\nthen used for fine-tuning the Stable Diffusion (SD) model. Subsequently, the\npretrained Add-SD model allows for the insertion of expected objects into an\nimage with good rationale. Additionally, we generate synthetic instances for\ndownstream task datasets at scale, particularly for tail classes, to alleviate\nthe long-tailed problem. Downstream tasks benefit from the enriched dataset\nwith enhanced diversity and rationale. Experiments on LVIS val demonstrate that\nAdd-SD yields an improvement of 4.3 mAP on rare classes over the baseline. Code\nand models are available at https://github.com/ylingfeng/Add-SD.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"3QTPagmBEAY1oId0xYvHGbRrtMVHwRWIoJ7TZpIh_Oo","pdfSize":"24042424"}