{"id":"2407.02568","title":"Probing Dust and Gas Properties Using Ringed Disks","authors":"Eve J. Lee","authorsParsed":[["Lee","Eve J.",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 18:00:04 GMT"}],"updateDate":"2024-07-04","timestamp":1719943204000,"abstract":"  How rapidly a planet grows in mass and how far they may park from the host\nstar depend sensitively on two non-dimensional parameters: Stokes number St and\nturbulent $\\alpha$. Yet, these parameters remain highly uncertain being\ndifficult or impossible to measure directly. Here, we demonstrate how the\nringed disks can be leveraged to obtain St and $\\alpha$ separately by\nconstructing a simple toy model that combines dust radial equation of motion\nunder aerodynamic drag and coupling to gas motion with the measured\ndistribution of dust masses in Class 0/I disks. Focusing on known systems with\nwell-resolved dust rings, we find that the range of St and $\\alpha$ that are\nconsistent with the measured properties of the rings are small: $10^{-4}\n\\lesssim {\\rm St} \\lesssim 10^{-2}$ and $10^{-5} \\lesssim \\alpha \\lesssim\n10^{-3}$. These low St and $\\alpha$ ensure the observed rings are stable\nagainst clumping. Even in one marginal case where the formation of bound clumps\nis possible, further mass growth by pebble accretion is inhibited. Furthermore,\nthe derived low $\\alpha$ is consistent with the nearly inviscid regime where\nType I migration can be prematurely halted. Our analysis predicts minimal\nplanet population beyond $\\sim$10s of au where we observe dust rings and\nsignificantly more vigorous planet formation inside $\\sim$10 AU, consistent\nwith current exo-giant statistics. We close with discussions on the\nimplications of our results on small planet statistics at large orbital\ndistances.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0YM6UQDaB8reSmGE9BF4tG_yCEn4M7-zpcXGzVxotzA","pdfSize":"1058446"}