{"id":"2407.04385","title":"Impact of LRG1 and LRG2 in DESI 2024 BAO data on dark energy evolution","authors":"Guanlin Liu, Yu Wang, Wen Zhao","authorsParsed":[["Liu","Guanlin",""],["Wang","Yu",""],["Zhao","Wen",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 09:43:53 GMT"},{"version":"v2","created":"Fri, 12 Jul 2024 10:45:03 GMT"}],"updateDate":"2024-07-15","timestamp":1720172633000,"abstract":"  Recent measurements of baryon acoustic oscillations (BAO) by the Dark Energy\nSpectroscopic Instrument (DESI) suggest a preference for a dynamic dark energy\nmodel over a cosmological constant. This conclusion emerges from the\ncombination of DESI's BAO data with observations of the Cosmic Microwave\nBackground (CMB) and various type Ia supernova (SN Ia) catalogues. The\ndeviation observed in the cosmological constant ($\\Lambda$) reflects a\ndeparture from the standard cosmological model. Testing this deviation involves\nexamining the consistency between cosmological parameters derived from early\nand late-time observations. Specifically, we focus on the matter density\nparameter $\\omega_m = \\Omega_mh^2$ and introduce ${\\rm ratio}(\\omega_m)$ to\nassess consistency, which is defined as the ratio of $\\omega_m$ values\nconstrained by high and low-redshift measurements. This ratio serves as a\nmetric for quantifying deviations from the $\\Lambda$CDM model. In this paper,\nwe find that the DESI BAO+CMB yields ${\\rm ratio}(\\omega_m)=1.0171\\pm0.0066$.\nUpon excluding the LRG1 and LRG2 data in DESI BAO, this ratio adjusts to ${\\rm\nratio}(\\omega_m)=1.0100\\pm0.0082$. This shift, corresponding to a change from\n$2.6\\sigma$ to $1.2\\sigma$, indicates that the deviation from the $\\Lambda$CDM\nmodel is predominantly driven by these two samples from the DESI BAO\nmeasurements. To substantiate this conclusion, we utilized two cosmological\nmodel-independent methods to reconstruct the cosmic expansion history. Both\nreconstructions of the Hubble parameter $H(z)$ indicate that the evolving\nfeatures of dark energy are determined by the combined LRG1 and LRG2 data.\nTherefore, different methods have reached the same conclusion, namely the\nimportance of accurately measuring the BAO feature in LRG1 and LRG2 data.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"pvJSrb4INcoZqxjukFNNemfPAOlCn-h5jy6gWrHgb-g","pdfSize":"3039663"}