{"id":"2407.09247","title":"Constrained Intrinsic Motivation for Reinforcement Learning","authors":"Xiang Zheng,Xingjun Ma,Chao Shen,Cong Wang","authorsParsed":[["Zheng","Xiang",""],["Ma","Xingjun",""],["Shen","Chao",""],["Wang","Cong",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 13:20:52 GMT"}],"updateDate":"2024-07-15","timestamp":1720790452000,"abstract":"  This paper investigates two fundamental problems that arise when utilizing\nIntrinsic Motivation (IM) for reinforcement learning in Reward-Free\nPre-Training (RFPT) tasks and Exploration with Intrinsic Motivation (EIM)\ntasks: 1) how to design an effective intrinsic objective in RFPT tasks, and 2)\nhow to reduce the bias introduced by the intrinsic objective in EIM tasks.\nExisting IM methods suffer from static skills, limited state coverage, sample\ninefficiency in RFPT tasks, and suboptimality in EIM tasks. To tackle these\nproblems, we propose \\emph{Constrained Intrinsic Motivation (CIM)} for RFPT and\nEIM tasks, respectively: 1) CIM for RFPT maximizes the lower bound of the\nconditional state entropy subject to an alignment constraint on the state\nencoder network for efficient dynamic and diverse skill discovery and state\ncoverage maximization; 2) CIM for EIM leverages constrained policy optimization\nto adaptively adjust the coefficient of the intrinsic objective to mitigate the\ndistraction from the intrinsic objective. In various MuJoCo robotics\nenvironments, we empirically show that CIM for RFPT greatly surpasses fifteen\nIM methods for unsupervised skill discovery in terms of skill diversity, state\ncoverage, and fine-tuning performance. Additionally, we showcase the\neffectiveness of CIM for EIM in redeeming intrinsic rewards when task rewards\nare exposed from the beginning. Our code is available at\nhttps://github.com/x-zheng16/CIM.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"MPk3U8Z4WbmUeIr4bkL_1zv4EQp11orUq4EHXg055I4","pdfSize":"2585305","objectId":"0x37f9a9a81c75d66e6949df25ca760ca634eb2f89c2eac632f113664ca67e0c68","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
