{"id":"2407.02929","title":"A Hybrid Reactive Routing Protocol for Decentralized UAV Networks","authors":"Shivam Garg, Alexander Ihler, Elizabeth Serena Bentley, Sunil Kumar","authorsParsed":[["Garg","Shivam",""],["Ihler","Alexander",""],["Bentley","Elizabeth Serena",""],["Kumar","Sunil",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 08:59:49 GMT"}],"updateDate":"2024-07-04","timestamp":1719997189000,"abstract":"  Wireless networks consisting of low SWaP, FW-UAVs are used in many\napplications, such as monitoring, search and surveillance of inaccessible\nareas. A decentralized and autonomous approach ensures robustness to failures;\nthe UAVs explore and sense within the area and forward their information, in a\nmultihop manner, to nearby aerial gateway nodes. However, the unpredictable\nnature of the events, relatively high speed of UAVs, and dynamic UAV\ntrajectories cause the network topology to change significantly over time,\nresulting in frequent route breaks. A holistic routing approach is needed to\nsupport multiple traffic flows in these networks to provide mobility- and\ncongestion-aware, high-quality routes when needed, with low control and\ncomputational overheads, using the information collected in a distributed\nmanner. Existing routing schemes do not address all the mentioned issues.\n  We present a hybrid reactive routing protocol for decentralized UAV networks.\nOur scheme searches routes on-demand, monitors a region around the selected\nroute (the pipe), and proactively switches to an alternative route before the\ncurrent route's quality degrades below a threshold. We empirically evaluate the\nimpact of pipe width and node density on our ability to find alternate\nhigh-quality routes within the pipe and the overhead required to maintain the\npipe. Compared to existing reactive routing schemes, our approach achieves\nhigher throughput and reduces the number of route discoveries, overhead, and\nresulting flow interruptions at different traffic loads, node densities and\nspeeds. Despite having limited network topology information, and low overhead\nand route computation complexity, our proposed scheme achieves superior\nthroughput to proactive optimized link state routing scheme at different\nnetwork and traffic settings. We also evaluate the relative performance of\nreactive and proactive routing schemes.\n","subjects":["Computing Research Repository/Networking and Internet Architecture"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"dUogiE8yfr7qUmZu_9Gb3X70jRUd3Jk9RhFrFVstQg4","pdfSize":"992099"}