{"id":"2407.18347","title":"Explicit block encodings of boundary value problems for many-body\n  elliptic operators","authors":"Tyler Kharazi, Ahmad M. Alkadri, Jin-Peng Liu, Kranthi K. Mandadapu,\n  K. Birgitta Whaley","authorsParsed":[["Kharazi","Tyler",""],["Alkadri","Ahmad M.",""],["Liu","Jin-Peng",""],["Mandadapu","Kranthi K.",""],["Whaley","K. Birgitta",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 19:29:33 GMT"}],"updateDate":"2024-07-29","timestamp":1721935773000,"abstract":"  Simulation of physical systems is one of the most promising use cases of\nfuture digital quantum computers. In this work we systematically analyze the\nquantum circuit complexities of block encoding the discretized elliptic\noperators that arise extensively in numerical simulations for partial\ndifferential equations, including high-dimensional instances for many-body\nsimulations. When restricted to rectangular domains with separable boundary\nconditions, we provide explicit circuits to block encode the many-body\nLaplacian with separable periodic, Dirichlet, Neumann, and Robin boundary\nconditions, using standard discretization techniques from low-order finite\ndifference methods. To obtain high-precision, we introduce a scheme based on\nperiodic extensions to solve Dirichlet and Neumann boundary value problems\nusing a high-order finite difference method, with only a constant increase in\ntotal circuit depth and subnormalization factor. We then present a scheme to\nimplement block encodings of differential operators acting on more arbitrary\ndomains, inspired by Cartesian immersed boundary methods. We then block encode\nthe many-body convective operator, which describes interacting particles\nexperiencing a force generated by a pair-wise potential given as an inverse\npower law of the interparticle distance. This work provides concrete recipes\nthat are readily translated into quantum circuits, with depth logarithmic in\nthe total Hilbert space dimension, that block encode operators arising broadly\nin applications involving the quantum simulation of quantum and classical\nmany-body mechanics.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"mCnXt5LST81dTfdoxc2m_m22Ss3lsM2Sv1nocbmo8mI","pdfSize":"925356","objectId":"0x5b7fa11e94f8b5a682b904a2976f67790f13f833200a887e1d9b9ce5e70721c7","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
