{"id":"2407.11275","title":"M18K: A Comprehensive RGB-D Dataset and Benchmark for Mushroom Detection\n  and Instance Segmentation","authors":"Abdollah Zakeri, Mulham Fawakherji, Jiming Kang, Bikram Koirala,\n  Venkatesh Balan, Weihang Zhu, Driss Benhaddou, Fatima A. Merchant","authorsParsed":[["Zakeri","Abdollah",""],["Fawakherji","Mulham",""],["Kang","Jiming",""],["Koirala","Bikram",""],["Balan","Venkatesh",""],["Zhu","Weihang",""],["Benhaddou","Driss",""],["Merchant","Fatima A.",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 22:50:06 GMT"}],"updateDate":"2024-07-17","timestamp":1721083806000,"abstract":"  Automating agricultural processes holds significant promise for enhancing\nefficiency and sustainability in various farming practices. This paper\ncontributes to the automation of agricultural processes by providing a\ndedicated mushroom detection dataset related to automated harvesting, growth\nmonitoring, and quality control of the button mushroom produced using Agaricus\nBisporus fungus. With over 18,000 mushroom instances in 423 RGB-D image pairs\ntaken with an Intel RealSense D405 camera, it fills the gap in\nmushroom-specific datasets and serves as a benchmark for detection and instance\nsegmentation algorithms in smart mushroom agriculture. The dataset, featuring\nrealistic growth environment scenarios with comprehensive annotations, is\nassessed using advanced detection and instance segmentation algorithms. The\npaper details the dataset's characteristics, evaluates algorithmic performance,\nand for broader applicability, we have made all resources publicly available\nincluding images, codes, and trained models via our GitHub repository\nhttps://github.com/abdollahzakeri/m18k\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"FWlnN14UcMT3ZZ46tvgwcYsz3c1NhKmZNKcJeuzp0j4","pdfSize":"8821903","objectId":"0xd1b13794f48319612aa3085a601ff36f576dd608db81af14d7207f61f3e90a92","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
