{"id":"2407.01060","title":"Search for MeV Gamma-ray emission from TeV bright red dwarfs with\n  COMPTEL","authors":"Niharika Shrivastava, Siddhant Manna, Shantanu Desai","authorsParsed":[["Shrivastava","Niharika",""],["Manna","Siddhant",""],["Desai","Shantanu",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 08:11:14 GMT"},{"version":"v2","created":"Fri, 30 Aug 2024 13:46:44 GMT"}],"updateDate":"2024-09-13","timestamp":1719821474000,"abstract":"  The SHALON atmospheric Cherenkov telescope has detected very high energy\ngamma-ray emission at TeV energies from eight red dwarfs, namely, V388 Cas,\nV547 Cas, V780 Tau, V962 Tau, V1589 Cyg, GJ 1078, GJ 3684 and GL 851.1.\nConsequently, these red dwarfs have been suggested as sources of ultra-high\nenergy cosmic rays. In this work, we search for soft gamma-ray emission from\nthese TeV bright red dwarfs between 0.75-30 MeV using archival data from the\nCOMPTEL gamma-ray imaging telescope, as a follow-up to a similar search for GeV\ngamma-ray emission using the Fermi-LAT telescope. Although, prima-facie, we\ndetect non-zero photon flux from three red dwarfs with high significance, these\nsignals can attributed to contamination from nearby sources such as Crab and\nCygnus, which are within the angular resolution of COMPTEL, and have been\npreviously detected as very bright point sources at MeV energies. Therefore, we\ncould not detect any statistically significant signal ($>3\\sigma$) from any of\nthese eight red dwarfs from 0.75-30 MeV. We then report the 95% confidence\nlevel upper limits on the differential photon flux (at 30 MeV), integral photon\nflux and integral energy flux for all of the eight red dwarfs. The integral\nenergy flux limits range between $10^{-11}-10^{-10} \\rm{ergs/cm^2/s}$.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"c-PNs1dV0HAPjD1wWMvN3BFvsyEuYDGHy32tUseAT9Y","pdfSize":"579588"}