{"id":"2407.02944","title":"Control Flow Management in Modern GPUs","authors":"Mojtaba Abaie Shoushtary, Jordi Tubella Murgadas, Antonio Gonzalez","authorsParsed":[["Shoushtary","Mojtaba Abaie",""],["Murgadas","Jordi Tubella",""],["Gonzalez","Antonio",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 09:21:28 GMT"}],"updateDate":"2024-07-04","timestamp":1719998488000,"abstract":"  In GPUs, the control flow management mechanism determines which threads in a\nwarp are active at any point in time. This mechanism monitors the control flow\nof scalar threads within a warp to optimize thread scheduling and plays a\ncritical role in the utilization of execution resources. The control flow\nmanagement mechanism can be controlled or assisted by software through\ninstructions. However, GPU vendors do not disclose details about their\ncompiler, ISA, or hardware implementations. This lack of transparency makes it\nchallenging for researchers to understand how the control flow management\nmechanism functions, is implemented, or is assisted by software, which is\ncrucial when it significantly affects their research. It is also problematic\nfor performance modeling of GPUs, as one can only rely on traces from real\nhardware for control flow and cannot model or modify the functionality of the\nmechanism altering it.\n  This paper addresses this issue by defining a plausible semantic for control\nflow instructions in the Turing native ISA based on insights gleaned from\nexperimental data using various benchmarks. Based on these definitions, we\npropose a low-cost mechanism for efficient control flow management named Hanoi.\nHanoi ensures correctness and generates a control flow that is very close to\nreal hardware. Our evaluation shows that the discrepancy between the control\nflow trace of real hardware and our mechanism is only 1.03% on average.\nFurthermore, when comparing the Instructions Per Cycle (IPC) of GPUs employing\nHanoi with the native control flow management of actual hardware, the average\ndifference is just 0.19%.\n","subjects":["Computing Research Repository/Hardware Architecture"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"glYO2WSBgtXsE9UiXrRm3hQjoZ-8X0Vfd2qlVPtGVak","pdfSize":"709693"}