{"id":"2407.12461","title":"Compatibility of Fairness and Nash Welfare under Subadditive Valuations","authors":"Siddharth Barman and Mashbat Suzuki","authorsParsed":[["Barman","Siddharth",""],["Suzuki","Mashbat",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 10:21:53 GMT"},{"version":"v2","created":"Tue, 23 Jul 2024 10:39:53 GMT"}],"updateDate":"2024-07-24","timestamp":1721211713000,"abstract":"  We establish a compatibility between fairness and efficiency, captured via\nNash Social Welfare (NSW), under the broad class of subadditive valuations. We\nprove that, for subadditive valuations, there always exists a partial\nallocation that is envy-free up to the removal of any good (EFx) and has NSW at\nleast half of the optimal; here, optimality is considered across all\nallocations, fair or otherwise. We also prove, for subadditive valuations, the\nuniversal existence of complete allocations that are envy-free up to one good\n(EF1) and also achieve a factor $1/2$ approximation to the optimal NSW. Our EF1\nresult resolves an open question posed by Garg et al. (STOC 2023).\n  In addition, we develop a polynomial-time algorithm which, given an arbitrary\nallocation \\~A as input, returns an EF1 allocation with NSW at least $1/3$\ntimes that of \\~A. Therefore, our results imply that the EF1 criterion can be\nattained simultaneously with a constant-factor approximation to optimal NSW in\npolynomial time (with demand queries), for subadditive valuations. The\npreviously best-known approximation factor for optimal NSW, under EF1 and among\n$n$ agents, was $O(n)$ - we improve this bound to $O(1)$.\n  It is known that EF1 and exact Pareto efficiency (PO) are incompatible with\nsubadditive valuations. Complementary to this negative result, the current work\nshows that we regain compatibility by just considering a factor $1/2$\napproximation: EF1 can be achieved in conjunction with $\\frac{1}{2}$-PO under\nsubadditive valuations. As such, our results serve as a general tool that can\nbe used as a black box to convert any efficient outcome into a fair one, with\nonly a marginal decrease in efficiency.\n","subjects":["Computing Research Repository/Computer Science and Game Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8tIsVl7dp21yogtSRbrA-48htuDMOvql3x4_syBazTw","pdfSize":"312616"}