{"id":"2407.17073","title":"Contrastive Learning Is Not Optimal for Quasiperiodic Time Series","authors":"Adrian Atienza, Jakob Bardram, Sadasivan Puthusserypady","authorsParsed":[["Atienza","Adrian",""],["Bardram","Jakob",""],["Puthusserypady","Sadasivan",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 08:02:41 GMT"}],"updateDate":"2024-07-25","timestamp":1721808161000,"abstract":"  Despite recent advancements in Self-Supervised Learning (SSL) for time series\nanalysis, a noticeable gap persists between the anticipated achievements and\nactual performance. While these methods have demonstrated formidable\ngeneralization capabilities with minimal labels in various domains, their\neffectiveness in distinguishing between different classes based on a limited\nnumber of annotated records is notably lacking. Our hypothesis attributes this\nbottleneck to the prevalent use of Contrastive Learning, a shared training\nobjective in previous state-of-the-art (SOTA) methods. By mandating\ndistinctiveness between representations for negative pairs drawn from separate\nrecords, this approach compels the model to encode unique record-based patterns\nbut simultaneously neglects changes occurring across the entire record. To\novercome this challenge, we introduce Distilled Embedding for Almost-Periodic\nTime Series (DEAPS) in this paper, offering a non-contrastive method tailored\nfor quasiperiodic time series, such as electrocardiogram (ECG) data. By\navoiding the use of negative pairs, we not only mitigate the model's blindness\nto temporal changes but also enable the integration of a \"Gradual Loss (Lgra)\"\nfunction. This function guides the model to effectively capture dynamic\npatterns evolving throughout the record. The outcomes are promising, as DEAPS\ndemonstrates a notable improvement of +10% over existing SOTA methods when just\na few annotated records are presented to fit a Machine Learning (ML) model\nbased on the learned representation.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"BEs50FPI4dBO5wvW0FYi-WEsfx79DAcS9CQNfkD8JrM","pdfSize":"1587499","objectId":"0x8e8ccdd2246f58498c62f7f9e24f9de1ba67d2cfdad07cb23ef8324287807488","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
