{"id":"2407.00148","title":"Localizing Anomalies via Multiscale Score Matching Analysis","authors":"Ahsan Mahmood, Junier Oliva, Martin Styner","authorsParsed":[["Mahmood","Ahsan",""],["Oliva","Junier",""],["Styner","Martin",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 17:57:12 GMT"},{"version":"v2","created":"Thu, 18 Jul 2024 17:07:17 GMT"}],"updateDate":"2024-07-19","timestamp":1719597432000,"abstract":"  Anomaly detection and localization in medical imaging remain critical\nchallenges in healthcare. This paper introduces Spatial-MSMA (Multiscale Score\nMatching Analysis), a novel unsupervised method for anomaly localization in\nvolumetric brain MRIs. Building upon the MSMA framework, our approach\nincorporates spatial information and conditional likelihoods to enhance anomaly\ndetection capabilities. We employ a flexible normalizing flow model conditioned\non patch positions and global image features to estimate patch-wise anomaly\nscores. The method is evaluated on a dataset of 1,650 T1- and T2-weighted brain\nMRIs from typically developing children, with simulated lesions added to the\ntest set. Spatial-MSMA significantly outperforms existing methods, including\nreconstruction-based, generative-based, and interpretation-based approaches, in\nlesion detection and segmentation tasks. Our model achieves superior\nperformance in both distance-based metrics (99th percentile Hausdorff Distance:\n$7.05 \\pm 0.61$, Mean Surface Distance: $2.10 \\pm 0.43$) and component-wise\nmetrics (True Positive Rate: $0.83 \\pm 0.01$, Positive Predictive Value: $0.96\n\\pm 0.01$). These results demonstrate Spatial-MSMA's potential for accurate and\ninterpretable anomaly localization in medical imaging, with implications for\nimproved diagnosis and treatment planning in clinical settings. Our code is\navailable at~\\url{https://github.com/ahsanMah/sade/}.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"kvMndAEDR5y1MPngsgthgfmCJ1kYi-l31Mciy_Dm2j0","pdfSize":"1169261"}