{"id":"2407.17891","title":"Role of NH3 Binding Energy in the Early Evolution of Protostellar Cores","authors":"S. Kakkenpara Suresh, O. Sipila, P. Caselli, F. Dulieu","authorsParsed":[["Suresh","S. Kakkenpara",""],["Sipila","O.",""],["Caselli","P.",""],["Dulieu","F.",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 09:24:33 GMT"}],"updateDate":"2024-07-26","timestamp":1721899473000,"abstract":"  NH$_{3}$(ammonia) plays a critical role in the chemistry of star and planet\nformation, yet uncertainties in its binding energy (BE) values complicate\naccurate estimates of its abundances. Recent research suggests a multi-binding\nenergy approach, challenging the previous single-value notion. In this work, we\nuse different values of NH$_{3}$ binding energy to examine its effects on the\nNH$_{3}$ abundances and, consequently, in the early evolution of protostellar\ncores. Using a gas-grain chemical network, we systematically vary the values of\nNH$_{3}$ binding energies in a model Class 0 protostellar core and study the\neffects of these binding energies on the NH$_{3}$ abundances. Our simulations\nindicate that abundance profiles of NH$_{3}$ are highly sensitive to the\nbinding energy used, particularly in the warmer inner regions of the core.\nHigher binding energies lead to lower gas-phase NH$_{3}$ abundances, while\nlower values of binding energy have the opposite effect. Furthermore, this\nBE-dependent abundance variation of NH$_{3}$ significantly affects the\nformation pathways and abundances of key species such as HNC, HCN, and CN. Our\ntests also reveal that the size variation of the emitting region due to binding\nenergy becomes discernible only with beam sizes of 10 arcsec or less. These\nfindings underscore the importance of considering a range of binding energies\nin astrochemical models and highlight the need for higher resolution\nobservations to better understand the subtleties of molecular cloud chemistry\nand star formation processes.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"aqHkGgCGAHM4Xbqw0Arta06N03ZpVEq9Xhf-kB-E5EU","pdfSize":"532354"}