{"id":"2407.05004","title":"The S-PLUS Ultra-Short Survey: first data release","authors":"H\\'elio D. Perottoni, Vinicius M. Placco, Felipe Almeida-Fernandes,\n  F\\'abio R. Herpich, Silvia Rossi, Timothy C. Beers, Rodolfo Smiljanic, Jo\\~ao\n  A. S. Amarante, Guilherme Limberg, Ariel Werle, Helio J. Rocha-Pinto, Leandro\n  Beraldo e Silva, Simone Daflon, Alvaro Alvarez-Candal, Gustavo B Oliveira\n  Schwarz, William Schoenell, Tiago Ribeiro, Antonio Kanaan","authorsParsed":[["Perottoni","Hélio D.",""],["Placco","Vinicius M.",""],["Almeida-Fernandes","Felipe",""],["Herpich","Fábio R.",""],["Rossi","Silvia",""],["Beers","Timothy C.",""],["Smiljanic","Rodolfo",""],["Amarante","João A. S.",""],["Limberg","Guilherme",""],["Werle","Ariel",""],["Rocha-Pinto","Helio J.",""],["Silva","Leandro Beraldo e",""],["Daflon","Simone",""],["Alvarez-Candal","Alvaro",""],["Schwarz","Gustavo B Oliveira",""],["Schoenell","William",""],["Ribeiro","Tiago",""],["Kanaan","Antonio",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 08:56:05 GMT"}],"updateDate":"2024-07-09","timestamp":1720256165000,"abstract":"  This paper presents the first public data release of the S-PLUS Ultra-Short\nSurvey (USS), a photometric survey with short exposure times, covering\napproximately 9300 deg$^{2}$ of the Southern sky. The USS utilizes the\nJavalambre 12-band magnitude system, including narrow and medium-band and\nbroad-band filters targeting prominent stellar spectral features. The primary\nobjective of the USS is to identify bright, extremely metal-poor (EMP; [Fe/H]\n$\\leq -3$) and ultra metal-poor (UMP; [Fe/H] $\\leq -4$) stars for further\nanalysis using medium- and high-resolution spectroscopy.}{This paper provides\nan overview of the survey observations, calibration method, data quality, and\ndata products. Additionally, it presents the selection of EMP and UMP\ncandidates.}{The data from the USS were reduced and calibrated using the same\nmethods as presented in the S-PLUS DR2. An additional step was introduced,\naccounting for the offset between the observed magnitudes off the USS and the\npredicted magnitudes from the very low-resolution Gaia XP spectra.}{This first\nrelease contains data for 163 observed fields totaling $\\sim$324 deg$^{2}$\nalong the Celestial Equator. The magnitudes obtained from the USS are\nwell-calibrated, showing a difference of $\\sim 15$ mmag compared to the\npredicted magnitudes by the GaiaXPy toolkit. By combining colors and\nmagnitudes, 140 candidates for EMP or UMP have been identified for follow-up\nstudies.}{The S-PLUS USS DR1 is an important milestone in the search for bright\nmetal-poor stars, with magnitudes in the range 10 $ < r \\leq 14$. The USS is an\nongoing survey; in the near future, it will provide many more bright metal-poor\ncandidate stars for spectroscopic follow-up.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"CXwg7Tpn2JOZFqU_fD_R5kX-6j0y5DtYYIzxDU1tYf4","pdfSize":"8377557"}