{"id":"2407.00271","title":"Minimum Reduced-Order Models via Causal Inference","authors":"Nan Chen and Honghu Liu","authorsParsed":[["Chen","Nan",""],["Liu","Honghu",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 01:24:41 GMT"}],"updateDate":"2024-07-02","timestamp":1719624281000,"abstract":"  Enhancing the sparsity of data-driven reduced-order models (ROMs) has gained\nincreasing attention in recent years. In this work, we analyze an efficient\napproach to identifying skillful ROMs with a sparse structure using an\ninformation-theoretic indicator called causation entropy. The causation entropy\nquantifies in a statistical way the additional contribution of each term to the\nunderlying dynamics beyond the information already captured by all the other\nterms in the ansatz. By doing so, the causation entropy assesses the importance\nof each term to the dynamics before a parameter estimation procedure is\nperformed. Thus, the approach can be utilized to eliminate terms with little\ndynamic impact, leading to a parsimonious structure that retains the essential\nphysics. To circumvent the difficulty of estimating high-dimensional\nprobability density functions (PDFs) involved in the causation entropy\ncomputation, we leverage Gaussian approximations for such PDFs, which are\ndemonstrated to be sufficient even in the presence of highly non-Gaussian\ndynamics. The effectiveness of the approach is illustrated by the\nKuramoto-Sivashinsky equation by building sparse causation-based ROMs for\nvarious purposes, such as recovering long-term statistics and inferring\nunobserved dynamics via data assimilation with partial observations.\n","subjects":["Mathematics/Dynamical Systems","Physics/Data Analysis, Statistics and Probability","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"MCc2u_hKQDXkPT4fqFnjf1ZmQDxaK7UCbPklS0ZBNJk","pdfSize":"6945417","objectId":"0x2c09a4f68752b8eaf5acf6b881e1f8ade991d1fea3f64c6da05d3f2593557be4","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
