{"id":"2407.06768","title":"Reconfigurable classifier based on spin torque driven magnetization\n  switching in electrically connected magnetic tunnel junctions","authors":"A. Lopez, D. Costa, T. Bohnert, P. P. Freitas, R. Ferreira, I.\n  Barbero, J. Camarero, C. Leon, J. Grollier and M. Romera","authorsParsed":[["Lopez","A.",""],["Costa","D.",""],["Bohnert","T.",""],["Freitas","P. P.",""],["Ferreira","R.",""],["Barbero","I.",""],["Camarero","J.",""],["Leon","C.",""],["Grollier","J.",""],["Romera","M.",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 11:38:21 GMT"}],"updateDate":"2024-07-10","timestamp":1720525101000,"abstract":"  A promising branch of neuromorphic computing aims to perform cognitive\noperations in hardware leveraging the physics of efficient and well-established\nnano-devices. In this work, we present a reconfigurable classifier based on a\nnetwork of electrically connected magnetic tunnel junctions that categorizes\ninformation encoded in the amplitude of input currents through the spin torque\ndriven magnetization switching output configuration. The network can be trained\nto classify new data by adjusting additional programming currents applied\nselectively to the junctions. We experimentally demonstrate that a network\ncomposed of three magnetic tunnel junctions can learn to classify spoken vowels\nwith a recognition rate that surpasses the performance of software multilayer\nneural networks with the same number of trained parameters in this task. These\nresults, obtained with the same nano-devices and working principle employed in\nindustrial spin-transfer torque magnetic random-access memories (STT-MRAM),\nconstitute an important step towards the development of large-scale\nneuromorphic networks based on well-established technology.\n","subjects":["Physics/Applied Physics","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"bwvC7u3J4RtXwmUoqogJvYFVopdzHr7xUx7-Ykq_Q7M","pdfSize":"1007303"}