{"id":"2407.00266","title":"Vector-valued robust stochastic control","authors":"Igor Cialenco and Gabriela Kov\\'a\\v{c}ov\\'a","authorsParsed":[["Cialenco","Igor",""],["Kováčová","Gabriela",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 00:03:09 GMT"}],"updateDate":"2024-07-02","timestamp":1719619389000,"abstract":"  We study a dynamic stochastic control problem subject to Knightian\nuncertainty with multi-objective (vector-valued) criteria. Assuming the\npreferences across expected multi-loss vectors are represented by a given, yet\ngeneral, preorder, we address the model uncertainty by adopting a robust or\nminimax perspective, minimizing expected loss across the worst-case model. For\nloss functions taking real (or scalar) values, there is no ambiguity in\ninterpreting supremum and infimum. In contrast to the scalar case, major\nchallenges for multi-loss control problems include properly defining and\ninterpreting the notions of supremum and infimum, and addressing the\nnon-uniqueness of these suprema and infima. To deal with these, we employ the\nnotion of an ideal point vector-valued supremum for the robust part of the\nproblem, while we view the control part as a multi-objective (or vector)\noptimization problem. Using a set-valued framework, we derive both a weak and\nstrong version of the dynamic programming principle (DPP) or Bellman equations\nby taking the value function as the collection of all worst expected losses\nacross all feasible actions. The weak version of Bellman's principle is proved\nunder minimal assumptions. To establish a stronger version of DPP, we introduce\nthe rectangularity property with respect to a general preorder. We also further\nstudy a particular, but important, case of component-wise partial order of\nvectors, for which we additionally derive DPP under a different set-valued\nnotion for the value function, the so-called upper image of the multi-objective\nproblem. Finally, we provide illustrative examples motivated by financial\nproblems.\n  These results will serve as a foundation for addressing time-inconsistent\nproblems subject to model uncertainty through the lens of a set-valued\nframework, as well as for studying multi-portfolio allocation problems under\nmodel uncertainty.\n","subjects":["Mathematics/Optimization and Control","Quantitative Finance/Portfolio Management"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"S_o_dPENqC114OIlGHI6A2sRMhz-8Q2Yd4jKeqVfxco","pdfSize":"923929"}