{"id":"2407.21737","title":"An open-source framework for quantum hardware control","authors":"Edoardo Pedicillo, Alessandro Candido, Stavros Efthymiou, Hayk\n  Sargsyan, Yuanzheng Paul Tan, Juan Cereijo, Jun Yong Khoo, Andrea Pasquale,\n  Matteo Robbiati, Stefano Carrazza","authorsParsed":[["Pedicillo","Edoardo",""],["Candido","Alessandro",""],["Efthymiou","Stavros",""],["Sargsyan","Hayk",""],["Tan","Yuanzheng Paul",""],["Cereijo","Juan",""],["Khoo","Jun Yong",""],["Pasquale","Andrea",""],["Robbiati","Matteo",""],["Carrazza","Stefano",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 16:44:31 GMT"},{"version":"v2","created":"Mon, 12 Aug 2024 16:42:03 GMT"}],"updateDate":"2024-08-13","timestamp":1722444271000,"abstract":"  The development of quantum computers needs reliable quantum hardware and\ntailored software for controlling electronics specific to various quantum\nplatforms. Middleware is a type of computer software program that aims to\nprovide standardized software tools across the entire pipeline, from high level\nexecution of quantum computing algorithms to low level driver instructions\ntailored to specific experimental setups, including instruments. This paper\npresents updates to Qibolab, a software library that leverages Qibo\ncapabilities to execute quantum algorithms on self hosted quantum hardware\nplatforms. Qibolab offers an application programming interface (API) for\ninstrument control through arbitrary pulses and driver operations including\nsweepers. This paper offers an overview of the new features implemented in\nQibolab, including the redefined boundaries between platform and channel\nclasses, the integration of an emulator for simulating quantum hardware\nbehaviour, and it shows updated execution times benchmarks for superconducting\nsingle qubit calibration routines.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"479VnfeFlv_3riIKyxnWL0ccPsoblf2CPjkxI91ST18","pdfSize":"279340","objectId":"0x04773db3b93a990b03521d40fcdcf5f2565114d052be2eef89cdc05f1ab2ae45","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
