{"id":"2407.01973","title":"Mid-Infrared Hyperspectral Microscopy with Broadband 1-GHz Dual\n  Frequency Combs","authors":"Peter Chang, Ragib Ishrak, Nazanin Hoghooghi, Scott Egbert, Daniel\n  Lesko, Stephanie Swartz, Jens Biegert, Gregory B. Rieker, Rohith Reddy, and\n  Scott A. Diddams","authorsParsed":[["Chang","Peter",""],["Ishrak","Ragib",""],["Hoghooghi","Nazanin",""],["Egbert","Scott",""],["Lesko","Daniel",""],["Swartz","Stephanie",""],["Biegert","Jens",""],["Rieker","Gregory B.",""],["Reddy","Rohith",""],["Diddams","Scott A.",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 06:11:32 GMT"}],"updateDate":"2024-07-03","timestamp":1719900692000,"abstract":"  Mid-infrared microscopy is an important tool for biological analyses,\nallowing a direct probe of molecular bonds in their low energy landscape. In\naddition to the label-free extraction of spectroscopic information, the\napplication of broadband sources can provide a third dimension of chemical\nspecificity. However, to enable widespread deployment, mid-infrared microscopy\nplatforms need to be compact and robust while offering high speed, broad\nbandwidth and high signal-to-noise ratio (SNR). In this study, we\nexperimentally showcase the integration of a broadband, high-repetition-rate\ndual-comb spectrometer (DCS) in the mid-infrared range with a scanning\nmicroscope. We employ a set of 1-GHz mid-infrared frequency combs,\ndemonstrating their capability for high-speed and broadband hyperspectral\nimaging of polymers and ovarian tissue. The system covers 1000\n$\\mathrm{cm^{-1}}$ at $\\mathrm{\\nu_c=2941 \\; cm^{-1}}$ with 12.86 kHz spectra\nacquisition rate and 5 $\\mathrm{\\mu m}$ spatial resolution. Taken together, our\nexperiments and analysis elucidate the trade-off between bandwidth and speed in\nDCS as it relates to microscopy. This provides a roadmap for the future\nadvancement and application of high-repetition-rate DCS hyperspectral imaging.\n","subjects":["Physics/Optics","Physics/Biological Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Hy6fJJOz4souMIyb6EGiBzlg4sibwPcXvYf6tFdUQuM","pdfSize":"7929015"}