{"id":"2407.16292","title":"Visual Stereotypes of Autism Spectrum in DALL-E, Stable Diffusion, SDXL,\n  and Midjourney","authors":"Maciej Wodzi\\'nski, Marcin Rz\\k{a}deczka, Anastazja Szu{\\l}a, Marta\n  Sok\\'o{\\l}, Marcin Moskalewicz","authorsParsed":[["Wodziński","Maciej",""],["Rządeczka","Marcin",""],["Szuła","Anastazja",""],["Sokół","Marta",""],["Moskalewicz","Marcin",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 08:48:09 GMT"},{"version":"v2","created":"Wed, 24 Jul 2024 07:15:26 GMT"}],"updateDate":"2024-07-25","timestamp":1721724489000,"abstract":"  Avoiding systemic discrimination requires investigating AI models' potential\nto propagate stereotypes resulting from the inherent biases of training\ndatasets. Our study investigated how text-to-image models unintentionally\nperpetuate non-rational beliefs regarding autism. The research protocol\ninvolved generating images based on 53 prompts aimed at visualizing concrete\nobjects and abstract concepts related to autism across four models: DALL-E,\nStable Diffusion, SDXL, and Midjourney (N=249). Expert assessment of results\nwas performed via a framework of 10 deductive codes representing common\nstereotypes contested by the community regarding their presence and spatial\nintensity, quantified on ordinal scales and subject to statistical analysis of\ninter-rater reliability and size effects. The models frequently utilised\ncontroversial themes and symbols which were unevenly distributed, however, with\nstriking homogeneity in terms of skin colour, gender, and age, with autistic\nindividuals portrayed as engaged in solitary activities, interacting with\nobjects rather than people, and displaying stereotypical emotional expressions\nsuch as pale, anger, or sad. Secondly we observed representational\ninsensitivity regarding autism images despite directional prompting aimed at\nfalsifying the above results. Additionally, DALL-E explicitly denied\nperpetuating stereotypes. We interpret this as ANNs mirroring the human\ncognitive architecture regarding the discrepancy between background and\nreflective knowledge, as justified by our previous research on autism-related\nstereotypes in humans.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"waIVdrThrcsrOYH2J7You5zqdn-hx-0gmwfoqeiqZlU","pdfSize":"2520489"}