{"id":"2407.19112","title":"Mitosis, Cytoskeleton Regulation, and Drug Resistance in Receptor Triple\n  Negative Breast Cancer","authors":"Alexandre Matov","authorsParsed":[["Matov","Alexandre",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 22:20:36 GMT"},{"version":"v2","created":"Thu, 1 Aug 2024 07:31:21 GMT"},{"version":"v3","created":"Mon, 5 Aug 2024 01:58:14 GMT"},{"version":"v4","created":"Wed, 7 Aug 2024 16:11:10 GMT"},{"version":"v5","created":"Fri, 16 Aug 2024 16:55:12 GMT"},{"version":"v6","created":"Sat, 24 Aug 2024 02:15:28 GMT"}],"updateDate":"2024-08-27","timestamp":1722032436000,"abstract":"  During cell division, the receptor triple-negative MDA-MB-231 mitotic\nspindles are the largest in comparison to other BC cell lines. Many of the\nMDA-MB-231 spindles exhibit rapid lateral twisting during metaphase, which\nremains unaffected by knockdown of the oncogene Myc and treatment with\ninhibitors of the serine/threonine-protein kinase B-Raf and the epidermal\ngrowth factor receptor (EGFR), alone or in any combination. The MDA-MB-231\ncells are the most aggressive and rapidly form metastatic tumors in xenograft\ntransplant models, and exhibited very high proliferation rates when plated as\nthree-dimensional cultures in Matrigel. Quantitative image analysis of\nmicrotubules (MTs) in six BC cell lines - MDA-MB-231 (receptor negative),\nHCC-1143 (receptor negative), HCC-3153 (receptor negative), ZR75B (estrogen\nreceptor-positive), LY2 (progesterone receptor-positive), HCC-1428 (estrogen\nreceptor-positive, progesterone receptor-positive) - demonstrated that the\nrotational spindle rocking of MDA-MB-231 cells during metaphase appears coupled\nwith a significant increase in MT polymerization rates during interphase, which\nlikely shortens interphase and accelerates cell cycle progression and mitotic\nentry. Unlike the uniform treadmilling rates of about 21 um/min in kinetochore\nMTs during metaphase we measured across cell lines, MDA-MB-231 cells in\ninterphase exhibit the fastest MT polymerization dynamics of about 19 um/min\nand this is coupled with abnormal mitotic spindle oscillations of almost 30\num/min. This aberrant behavior in MDA-MB-231 spindles may represent a\ntherapeutically targetable disrupted mechanism of spindle positioning in\nreceptor triple-negative breast cancer (TNBC) cells leading to tumor\naggressiveness. In this manuscript, we outline a strategy for the selection of\nthe most optimal tubulin inhibitor based on the ability to affect MT dynamics.\n","subjects":["Quantitative Biology/Quantitative Methods"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"sbodWwWajYAWaD9e_3NE9sD_e1mNGp9IthkJeoyUBBI","pdfSize":"861072","objectId":"0xe33200dc666b476c41d57a1134d4582e99685e313b4c43188ca7af6ffa55f69d","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
