{"id":"2407.17719","title":"A new moment-independent uncertainty importance measure based on\n  cumulative residual entropy for developing uncertainty reduction strategies","authors":"Shi-Shun Chen, Xiao-Yang Li","authorsParsed":[["Chen","Shi-Shun",""],["Li","Xiao-Yang",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 02:43:04 GMT"}],"updateDate":"2024-07-26","timestamp":1721875384000,"abstract":"  Uncertainty reduction is vital for improving system reliability and reducing\nrisks. To identify the best target for uncertainty reduction, uncertainty\nimportance measure is commonly used to prioritize the significance of input\nvariable uncertainties. Then, designers will take steps to reduce the\nuncertainties of variables with high importance. However, for variables with\nminimal uncertainty, the cost of controlling their uncertainties can be\nunacceptable. Therefore, uncertainty magnitude should also be considered in\ndeveloping uncertainty reduction strategies. Although variance-based methods\nhave been developed for this purpose, they are dependent on statistical moments\nand have limitations when dealing with highly-skewed distributions that are\ncommonly encountered in practical applications. Motivated by this problem, we\npropose a new uncertainty importance measure based on cumulative residual\nentropy. The proposed measure is moment-independent based on the cumulative\ndistribution function, which can handle the highly-skewed distributions\nproperly. Numerical implementations for estimating the proposed measure are\ndevised and verified. A real-world engineering case considering highly-skewed\ndistributions is introduced to show the procedure of developing uncertainty\nreduction strategies considering uncertainty magnitude and corresponding cost.\nThe results demonstrate that the proposed measure can present a different\nuncertainty reduction recommendation compared to the variance-based approach\nbecause of its moment-independent characteristic.\n","subjects":["Statistics/Applications"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"KP4OiQbWH2RT-hFUk506aqUEae63PQpMh8ngiq-zZsk","pdfSize":"1312243"}