{"id":"2407.16910","title":"Operando probing of nanocracking in CuO-derived Cu during CO$_2$\n  electroreduction","authors":"Jiawei Wan, Ershuai Liu, Woong Choi, Jiayun Liang, Buyu Zhang,\n  Keon-Han Kim, Xianhu Sun, Meng Zhang, Han Xue, Yi Chen, Qiubo Zhang,\n  Changlian Wen, Ji Yang, Karen C. Bustillo, Peter Ercius, Denis Leshchev, Ji\n  Su, Zakaria Y. Al Balushi, Adam Z. Weber, Mark Asta, Alexis T. Bell, Walter\n  S. Drisdell, Haimei Zheng","authorsParsed":[["Wan","Jiawei",""],["Liu","Ershuai",""],["Choi","Woong",""],["Liang","Jiayun",""],["Zhang","Buyu",""],["Kim","Keon-Han",""],["Sun","Xianhu",""],["Zhang","Meng",""],["Xue","Han",""],["Chen","Yi",""],["Zhang","Qiubo",""],["Wen","Changlian",""],["Yang","Ji",""],["Bustillo","Karen C.",""],["Ercius","Peter",""],["Leshchev","Denis",""],["Su","Ji",""],["Balushi","Zakaria Y. Al",""],["Weber","Adam Z.",""],["Asta","Mark",""],["Bell","Alexis T.",""],["Drisdell","Walter S.",""],["Zheng","Haimei",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 00:03:16 GMT"}],"updateDate":"2024-07-25","timestamp":1721779396000,"abstract":"  Identifying and controlling active sites in electrocatalysis remains a grand\nchallenge due to restructuring of catalysts in the complex chemical\nenvironments during operation. Inactive precatalysts can transform into active\ncatalysts under reaction conditions, such as oxide-derived Cu (OD-Cu) for\nCO$_2$ electroreduction displaying improved production of multicarbon\n(C$_{2+}$) chemicals. Revealing the mechanism of active site origin in OD-Cu\ncatalysts requires in situ/operando characterizations of structure, morphology,\nand valence state evolution with high spatial and temporal resolution. Applying\nnewly developed electrochemical liquid cell transmission electron microscopy\ncombined with X-ray absorption spectroscopy, our multimodal operando techniques\nunveil the formation pathways of OD-Cu active sites from CuO bicrystal nanowire\nprecatalysts. Rapid reduction of CuO directly to Cu within 60 seconds generates\na nanocrack network throughout the nanowire, via formation of \"boundary\nnanocracks\" along the twin boundary and \"transverse nanocracks\" propagating\nfrom the surface to the center of the nanowire. The nanocrack network further\nreconstructs, leading to a highly porous structure rich in Cu nanograins, with\na boosted specific surface area and density of active sites for C$_{2+}$\nproducts. These findings suggest a means to optimize active OD-Cu\nnanostructures through nanocracking by tailoring grain boundaries in CuO\nprecatalysts. More generally, our advanced operando approach opens new\nopportunities for mechanistic insights to enable improved control of catalyst\nstructure and performance.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"JrSwa0x3EbZvAT4kIbF4QXR7_yrwE0u9cpxzBAnRbTw","pdfSize":"1637243"}