{"id":"2407.14520","title":"Tiling Spaces and the Expanding Universe: Bridging Quantum Mechanics and\n  Cosmology","authors":"Aman Yadav and Marcelo Maciel Amaral","authorsParsed":[["Yadav","Aman",""],["Amaral","Marcelo Maciel",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 08:09:02 GMT"}],"updateDate":"2024-07-23","timestamp":1720166942000,"abstract":"  We propose a heuristic model of the universe as a growing quasicrystal\nprojected from a higher-dimensional lattice. By extending the Schr\\\"{o}dinger\nequation for a particle in a box with time-dependent boundaries, we derive an\nequation that resembles the Friedmann equation, addressing the Hubble tension.\nThis model incorporates phonons and phasons, providing insights into\ncosmic-scale dynamics and the universe's expansion. We outline a pre-inflation\ntiling space phase with quantum error correction, a radiation phase dominated\nby quasiparticles, and a post-radiation phase with the emergence of matter. Our\nhypothesis, which posits that the universe is a growing quasicrystal, suggests\nthat the necessity for an inflationary period may be obviated. Furthermore,\nphonon arising from this quasicrystalline structure could act as dark matter,\ninfluencing the dynamics of ordinary matter while remaining mostly undetectable\nby electromagnetic interactions. This hypothesis draws parallels with other\ncrystalline matter at atomic scales that are fundamentally quantum in nature.\nWe also explore how the notion of tiling space can support continuous symmetry\natop a discrete structure, providing a novel framework for understanding the\nuniverse's expansion and underlying structure. Consequently, it is logical to\nstart with quantum mechanics as the foundation of our model. Further\ndevelopment could enhance our understanding of cosmic expansion and the\nunderlying structure of the universe.\n","subjects":["Physics/General Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"d9y1yILjFAnFa72lMm7TYuB7eD37UCujzqg4Ry430jY","pdfSize":"576403"}