{"id":"2407.04077","title":"Enhancing Physical Layer Security in LEO Satellite-Enabled IoT Network\n  Communications","authors":"Anna Talgat, Ruibo Wang, Mustafa A. Kishk, and Mohamed-Slim Alouini","authorsParsed":[["Talgat","Anna",""],["Wang","Ruibo",""],["Kishk","Mustafa A.",""],["Alouini","Mohamed-Slim",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 17:35:13 GMT"}],"updateDate":"2024-07-08","timestamp":1720114513000,"abstract":"  The extensive deployment of Low Earth Orbit (LEO) satellites introduces\nsignificant security challenges for communication security issues in Internet\nof Things (IoT) networks. With the rising number of satellites potentially\nacting as eavesdroppers, integrating Physical Layer Security (PLS) into\nsatellite communications has become increasingly critical. However, these\nstudies are facing challenges such as dealing with dynamic topology\ndifficulties, limitations in interference analysis, and the high complexity of\nperformance evaluation. To address these challenges, for the first time, we\ninvestigate PLS strategies in satellite communications using the Stochastic\nGeometry (SG) analytical framework. We consider the uplink communication\nscenario in an LEO-enabled IoT network, where multi-tier satellites from\ndifferent operators respectively serve as legitimate receivers and\neavesdroppers. In this scenario, we derive low-complexity analytical\nexpressions for the security performance metrics, namely availability\nprobability, successful communication probability, and secure communication\nprobability. By introducing the power allocation parameters, we incorporate the\nArtificial Noise (AN) technique, which is an important PLS strategy, into this\nanalytical framework and evaluate the gains it brings to secure transmission.\nIn addition to the AN technique, we also analyze the impact of constellation\nconfiguration, physical layer parameters, and network layer parameters on the\naforementioned metrics.\n","subjects":["Computing Research Repository/Networking and Internet Architecture"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"hZ-fj3OVMay3cRwLzWJZq2JP69C8KZ9Fi9g2_OuX2Ys","pdfSize":"2951227"}
