{"id":"2407.21671","title":"A study in scarlet -- I. Photometric properties of a sample of\n  Intermediate Luminosity Red Transients","authors":"G. Valerin, A. Pastorello, A. Reguitti, S. Benetti, Y.-Z. Cai, T.-W.\n  Chen, D. Eappachen, N. Elias-Rosa, M. Fraser, A. Gangopadhyay, E. Y. Hsiao,\n  D. A. Howell, C. Inserra, L. Izzo, J. Jencson, E. Kankare, R. Kotak, P. A.\n  Mazzali, K. Misra, G. Pignata, S. J. Prentice, D. J. Sand, S. J. Smartt, M.\n  D. Stritzinger, L. Tartaglia, S. Valenti, J. P. Anderson, J. E. Andrews, R.\n  C. Amaro, S. Brennan, F. Bufano, E. Callis, E. Cappellaro, R. Dastidar, M.\n  Della Valle, A. Fiore, M. D. Fulton, L. Galbany, T. Heikkil\\\"a, D. Hiramatsu,\n  E. Karamehmetoglu, H. Kuncarayakti, G. Leloudas, M. Lundquist, C. McCully, T.\n  E. M\\\"uller-Bravo, M. Nicholl, P. Ochner, E. Padilla Gonzalez, E. Paraskeva,\n  C. Pellegrino, D. E. Reichart, T. M. Reynolds, R. Roy, I. Salmaso, M. Singh,\n  M. Turatto, L. Tomasella, S. Wyatt, D. R. Young","authorsParsed":[["Valerin","G.",""],["Pastorello","A.",""],["Reguitti","A.",""],["Benetti","S.",""],["Cai","Y. -Z.",""],["Chen","T. -W.",""],["Eappachen","D.",""],["Elias-Rosa","N.",""],["Fraser","M.",""],["Gangopadhyay","A.",""],["Hsiao","E. Y.",""],["Howell","D. A.",""],["Inserra","C.",""],["Izzo","L.",""],["Jencson","J.",""],["Kankare","E.",""],["Kotak","R.",""],["Mazzali","P. A.",""],["Misra","K.",""],["Pignata","G.",""],["Prentice","S. J.",""],["Sand","D. J.",""],["Smartt","S. J.",""],["Stritzinger","M. D.",""],["Tartaglia","L.",""],["Valenti","S.",""],["Anderson","J. P.",""],["Andrews","J. E.",""],["Amaro","R. C.",""],["Brennan","S.",""],["Bufano","F.",""],["Callis","E.",""],["Cappellaro","E.",""],["Dastidar","R.",""],["Della Valle","M.",""],["Fiore","A.",""],["Fulton","M. D.",""],["Galbany","L.",""],["Heikkilä","T.",""],["Hiramatsu","D.",""],["Karamehmetoglu","E.",""],["Kuncarayakti","H.",""],["Leloudas","G.",""],["Lundquist","M.",""],["McCully","C.",""],["Müller-Bravo","T. E.",""],["Nicholl","M.",""],["Ochner","P.",""],["Gonzalez","E. Padilla",""],["Paraskeva","E.",""],["Pellegrino","C.",""],["Reichart","D. E.",""],["Reynolds","T. M.",""],["Roy","R.",""],["Salmaso","I.",""],["Singh","M.",""],["Turatto","M.",""],["Tomasella","L.",""],["Wyatt","S.",""],["Young","D. R.",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 15:13:53 GMT"}],"updateDate":"2024-08-01","timestamp":1722438833000,"abstract":"  We investigate the photometric characteristics of a sample of Intermediate\nLuminosity Red Transients (ILRTs), a class of elusive objects with peak\nluminosity between that of classical novae and standard supernovae. We present\nthe multi-wavelength photometric follow-up of four ILRTs, namely NGC 300\n2008OT-1, AT 2019abn, AT 2019ahd and AT 2019udc. Through the analysis and\nmodelling of their spectral energy distribution and bolometric light curves we\ninfer the physical parameters associated with these transients. All four\nobjects display a single peaked light curve which ends in a linear decline in\nmagnitudes at late phases. A flux excess with respect to a single black body\nemission is detected in the infrared domain for three objects in our sample, a\nfew months after maximum. This feature, commonly found in ILRTs, is interpreted\nas a sign of dust formation. Mid infrared monitoring of NGC 300 2008OT-1 761\ndays after maximum allows us to infer the presence of $\\sim$10$^{-3}$-10$^{-5}$\nM$_{\\odot}$ of dust, depending on the chemical composition and the grain size\nadopted. The late time decline of the bolometric light curves of the considered\nILRTs is shallower than expected for $^{56}$Ni decay, hence requiring an\nadditional powering mechanism. James Webb Space Telescope observations of AT\n2019abn prove that the object has faded below its progenitor luminosity in the\nmid-infrared domain, five years after its peak. Together with the disappearance\nof NGC 300 2008OT-1 in Spitzer images seven years after its discovery, this\nsupports the terminal explosion scenario for ILRTs. With a simple\nsemi-analytical model we try to reproduce the observed bolometric light curves\nin the context of few M$_{\\odot}$ of material ejected at few 10$^{3}$ km\ns$^{-1}$ and enshrouded in an optically thick circumstellar medium.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"5bst81qutbdrKg3rx9EKk36UCvyCKIDWOy_6KNFhXTM","pdfSize":"11916967"}