{"id":"2407.13589","title":"Functional Renormalization Group analysis of the quark-condensation\n  pattern on the Fermi surface: A simple effective-model approach","authors":"Kie Sang Jeong, Fabrizio Murgana, Ashutosh Dash, Dirk H. Rischke","authorsParsed":[["Jeong","Kie Sang",""],["Murgana","Fabrizio",""],["Dash","Ashutosh",""],["Rischke","Dirk H.",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 15:28:01 GMT"}],"updateDate":"2024-07-19","timestamp":1721316481000,"abstract":"  A simple effective model for the intermediate-density regime is constructed\nfrom the high-density effective theory of quantum chromodynamics (QCD). In the\neffective model, under a renormalization-group (RG) scaling towards low\nmomenta, the original QCD interactions lead to four-quark contact interactions\nfor the relevant quark and hole modes around the Fermi surface. The contact\ninteraction in the scalar channel can be traced back to zero-sound-type\ncollinear quark scattering near the Fermi surface in an instanton background.\nThe quark and hole states in opposite directions of a given Fermi velocity form\nthe collective scalar bosonic mode $\\sigma$. The magnitude of $\\sigma$ is\ninvestigated via the non-perturbative Functional Renormalization Group (FRG)\nevolution of the effective average action from the ultraviolet (UV) to the\ninfrared (IR). In the mean background-field approximation for $\\sigma$,\nnontrivial minima ($\\bar{\\sigma} \\neq 0$) are found in the IR limit of the\neffective average action. A nonvanishing $\\bar{\\sigma}$ corresponds to\ncondensation of quark and hole states in opposite directions of a given Fermi\nvelocity, in a thin shell-like structure in momentum space around the Fermi\nsurface. This looks similar to the shell-like baryon distribution in momentum\nspace assumed in the quarkyonic-matter concept. However, when including a\ndynamic bosonic $\\sigma$-mode in the RG flow, we find that its diffusive nature\ndestroys the quark-hole condensate, i.e., the IR potential does not show any\nminima beyond the trivial one.\n","subjects":["Physics/Nuclear Theory","Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"QetjA4noBwMjkt6GeQllMd0NHd-xKbiMSiy8qBXxc78","pdfSize":"1145781","objectId":"0xdc8d2c30c419452147f94608a9ad94cd1bbf0a4b7e9e022a969705a32db9e6d2","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
