{"id":"2407.20442","title":"The GPT Dilemma: Foundation Models and the Shadow of Dual-Use","authors":"Alan Hickey","authorsParsed":[["Hickey","Alan",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 22:36:27 GMT"}],"updateDate":"2024-07-31","timestamp":1722292587000,"abstract":"  This paper examines the dual-use challenges of foundation models and the\nconsequent risks they pose for international security. As artificial\nintelligence (AI) models are increasingly tested and deployed across both\ncivilian and military sectors, distinguishing between these uses becomes more\ncomplex, potentially leading to misunderstandings and unintended escalations\namong states. The broad capabilities of foundation models lower the cost of\nrepurposing civilian models for military uses, making it difficult to discern\nanother state's intentions behind developing and deploying these models. As\nmilitary capabilities are increasingly augmented by AI, this discernment is\ncrucial in evaluating the extent to which a state poses a military threat.\nConsequently, the ability to distinguish between military and civilian\napplications of these models is key to averting potential military escalations.\nThe paper analyzes this issue through four critical factors in the development\ncycle of foundation models: model inputs, capabilities, system use cases, and\nsystem deployment. This framework helps elucidate the points at which ambiguity\nbetween civilian and military applications may arise, leading to potential\nmisperceptions. Using the Intermediate-Range Nuclear Forces (INF) Treaty as a\ncase study, this paper proposes several strategies to mitigate the associated\nrisks. These include establishing red lines for military competition, enhancing\ninformation-sharing protocols, employing foundation models to promote\ninternational transparency, and imposing constraints on specific weapon\nplatforms. By managing dual-use risks effectively, these strategies aim to\nminimize potential escalations and address the trade-offs accompanying\nincreasingly general AI models.\n","subjects":["Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Eq3gZ-WxgE7USCQ2Pm6UUyWlQSWFw3J1tPlq2zFFi2o","pdfSize":"274288","objectId":"0xf286f43ec326ff9adfd657fe013bf4b76e599d96a39543669d11c17bf846da56","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
