{"id":"2407.07567","title":"Pilot-Based SFO Estimation for Bistatic Integrated Sensing and\n  Communication","authors":"Lucas Giroto de Oliveira, Yueheng Li, Silvio Mandelli, David Brunner,\n  Marcus Henninger, Xiang Wan, Tie Jun Cui, Thomas Zwick, and Benjamin Nuss","authorsParsed":[["de Oliveira","Lucas Giroto",""],["Li","Yueheng",""],["Mandelli","Silvio",""],["Brunner","David",""],["Henninger","Marcus",""],["Wan","Xiang",""],["Cui","Tie Jun",""],["Zwick","Thomas",""],["Nuss","Benjamin",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 11:52:09 GMT"}],"updateDate":"2024-07-11","timestamp":1720612329000,"abstract":"  Enabling bistatic radar sensing within the context of integrated sensing and\ncommunication (ISAC) for future sixth generation mobile networks demands strict\nsynchronization accuracy, which is particularly challenging to be achieved with\nover-the-air synchronization. Existing algorithms handle time and frequency\noffsets adequately, but provide insufficiently accurate sampling frequency\noffset (SFO) estimates that result in degradation of obtained radar images in\nthe form of signal-to-noise ratio loss and migration of range and Doppler\nshift. This article introduces an SFO estimation algorithm named tilt inference\nof time offset (TITO) for orthogonal frequency-division multiplexing\n(OFDM)-based ISAC. Using available pilot subcarriers, TITO obtains channel\nimpulse response estimates and extracts information on the SFO-induced delay\nmigration to a dominant reference path with constant range, Doppler shift, and\nangle between transmit and receive ISAC nodes. TITO then adaptively selects the\ndelay estimates that are only negligibly impaired by SFO-induced intersymbol\ninterference, ultimately employing them to estimate the SFO. Assuming a\nscenario without a direct line-of-sight (LoS) between the aforementioned\ntransmitting and receiving ISAC nodes, a system concept with a relay reflective\nintelligent surface (RIS) is used to create the aforementioned reference path\nis proposed. Besides a mathematical derivation of accuracy bounds, simulation\nand measurements at 26.2 GHz are presented to demonstrate TITO's superiority\nover existing methods in terms of SFO estimation accuracy and robustness.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"eQtdObprgjAPNnFRuflXIjUp5MHL4rMbzwkcalxVCbE","pdfSize":"5596237"}