{"id":"2407.09282","title":"Secondary bias through cosmic time II: Reconstructing halo properties\n  using clustering information","authors":"Andres Balaguera-Antolinez, Antonio D. Montero-Dorta","authorsParsed":[["Balaguera-Antolinez","Andres",""],["Montero-Dorta","Antonio D.",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 14:13:45 GMT"}],"updateDate":"2024-07-15","timestamp":1720793625000,"abstract":"  When constructing galaxy mock catalogs based on suits of dark matter halo\ncatalogs generated with approximated, calibrated or machine-learning\napproaches, the assignment of intrinsic properties for such tracers is a step\nof paramount relevance, given that these can shape the abundance of mock galaxy\ncluster and the spatial distribution of mock galaxies. We explore the\npossibility to assign properties of dark matter halos within the context of\ncalibrated/learning approaches, explicitly using clustering information. The\ngoal is to retrieve the correct signal of primary and secondary large-effective\nbias as a function of properties reconstructed solely based on phase-space\nproperties of the halo distribution and dark matter density field. The\nalgorithm reconstructs a set halo properties (such as virial mass, maximum\ncircular velocity, concentration and spin) constraint to reproduce both primary\nand secondary (or assembly) bias. The key ingredients of the algorithm are the\nimplementation of individually-assigned large-scale effective bias, a\nmulti-scale approach to account for halo exclusion and a hierarchical\nassignment of halo properties. The method facilitates the assignment of halo\nproperties aiming at replicating the large-scale effective bias, both primary\nand secondary. This improves over over previous methods found in the\nliterature, especially at the high mass population. We have designed an\nstrategy to reconstruct the main properties of dark matter halos obtained by\ncalibrated/learning algorithms, in a way that the expected one and two-point\nstatistics (on large scales) replicates the signal from detailed N-body\nsimulations. We encourage the application of this strategy (or the\nimplementation of our algorithm) for the generation of mock catalogs of dark\nmatter halos based on approximated methods.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"DMRXMagcoiaX_4jafqqUCPM6rY_u9y542fHLxmZXIIU","pdfSize":"2111211"}