{"id":"2407.04669","title":"Two methods to analyse radial diffusion ensembles: the peril of space-\n  and time- dependent diffusion","authors":"Sarah N. Bentley and J. Stout and Rhys Thompson and Daniel J. Ratliff\n  and Clare E. J. Watt","authorsParsed":[["Bentley","Sarah N.",""],["Stout","J.",""],["Thompson","Rhys",""],["Ratliff","Daniel J.",""],["Watt","Clare E. J.",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 17:24:14 GMT"},{"version":"v2","created":"Wed, 4 Sep 2024 12:44:09 GMT"}],"updateDate":"2024-09-05","timestamp":1720200254000,"abstract":"  Particle dynamics in Earth's outer radiation belt can be modelled using a\ndiffusion framework, where large-scale electron movements are captured by a\ndiffusion equation across a single adiabatic invariant, $L^{*}$ $``(L)\"$. While\nensemble models are promoted to represent physical uncertainty, as yet there is\nno validated method to analyse radiation belt ensembles. Comparisons are\ncomplicated by the domain dependent diffusion, since diffusion coefficient\n$D_{LL}$ is dependent on $L$. We derive two tools to analyse ensemble members:\ntime to monotonicity $t_m$ and mass/energy moment quantities $\\mathcal{N},\n\\mathcal{E}$. We find that the Jacobian ($1/L^2$) is necessary for radiation\nbelt error metrics. Components of $\\partial\\mathcal{E}/\\partial t$ are\nexplicitly calculated to compare the effects of outer and inner boundary\nconditions, and loss, on the ongoing diffusion. Using $t_m$, $\\mathcal{N}$ and\n$\\mathcal{E}$, we find that: (a) different physically motivated choices of\nouter boundary condition and location result in different final states and\ndifferent rates of evolution; (b) the gradients of the particle distribution\naffect evolution more significantly than $D_{LL}$; (c) the enhancement\nlocation, and the amount of initial background particles, are both significant\nfactors determining system evolution; (d) loss from pitch-angle scattering is\ngenerally dominant; it mitigates but does not remove the influence of both\ninitial conditions and outer boundary settings, which are due to the\n$L$-dependence of $D_{LL}$. We anticipate this study will promote renewed focus\non the distribution gradients, on the location and nature of the outer boundary\nin radiation belt modelling, and provide a foundation for systematic ensemble\nmodelling.\n","subjects":["Physics/Plasma Physics","Astrophysics/Earth and Planetary Astrophysics","Physics/Mathematical Physics","Mathematics/Mathematical Physics","Physics/Geophysics","Physics/Space Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"Gnoxv4p438jTfldd9E2_kiHbIU3AWcQ2Itq3yy0qjag","pdfSize":"2381112"}