{"id":"2407.14128","title":"OCTolyzer: Fully automatic analysis toolkit for segmentation and feature\n  extracting in optical coherence tomography (OCT) and scanning laser\n  ophthalmoscopy (SLO) data","authors":"Jamie Burke, Justin Engelmann, Samuel Gibbon, Charlene Hamid, Diana\n  Moukaddem, Dan Pugh, Tariq Farrah, Niall Strang, Neeraj Dhaun, Tom\n  MacGillivray, Stuart King and Ian J.C. MacCormick","authorsParsed":[["Burke","Jamie",""],["Engelmann","Justin",""],["Gibbon","Samuel",""],["Hamid","Charlene",""],["Moukaddem","Diana",""],["Pugh","Dan",""],["Farrah","Tariq",""],["Strang","Niall",""],["Dhaun","Neeraj",""],["MacGillivray","Tom",""],["King","Stuart",""],["MacCormick","Ian J. C.",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 08:56:12 GMT"}],"updateDate":"2024-07-22","timestamp":1721379372000,"abstract":"  Purpose: To describe OCTolyzer: an open-source toolkit for retinochoroidal\nanalysis in optical coherence tomography (OCT) and scanning laser\nophthalmoscopy (SLO) images.\n  Method: OCTolyzer has two analysis suites, for SLO and OCT images. The former\nenables anatomical segmentation and feature measurement of the en face retinal\nvessels. The latter leverages image metadata for retinal layer segmentations\nand deep learning-based choroid layer segmentation to compute retinochoroidal\nmeasurements such as thickness and volume. We introduce OCTolyzer and assess\nthe reproducibility of its OCT analysis suite for choroid analysis.\n  Results: At the population-level, choroid region metrics were highly\nreproducible (Mean absolute error/Pearson/Spearman correlation for macular\nvolume choroid thickness (CT):6.7$\\mu$m/0.9933/0.9969, macular B-scan\nCT:11.6$\\mu$m/0.9858/0.9889, peripapillary CT:5.0$\\mu$m/0.9942/0.9940). Macular\nchoroid vascular index (CVI) had good reproducibility (volume\nCVI:0.0271/0.9669/0.9655, B-scan CVI:0.0130/0.9090/0.9145). At the eye-level,\nmeasurement error in regional and vessel metrics were below 5% and 20% of the\npopulation's variability, respectively. Major outliers were from poor quality\nB-scans with thick choroids and invisible choroid-sclera boundary.\n  Conclusions: OCTolyzer is the first open-source pipeline to convert OCT/SLO\ndata into reproducible and clinically meaningful retinochoroidal measurements.\nOCT processing on a standard laptop CPU takes under 2 seconds for macular or\nperipapillary B-scans and 85 seconds for volume scans. OCTolyzer can help\nimprove standardisation in the field of OCT/SLO image analysis and is freely\navailable here: https://github.com/jaburke166/OCTolyzer.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Ume2z_yH7CSwcQxXgGIAy2F7RStSjtxuFhu29uaYRwA","pdfSize":"8410764"}