{"id":"2407.08740","title":"Reimagining AI: Exploring Speculative Design Workshops for Supporting\n  BIPOC Youth Critical AI Literacies","authors":"Sadhbh Kenny and Alissa N. Antle","authorsParsed":[["Kenny","Sadhbh",""],["Antle","Alissa N.",""]],"versions":[{"version":"v1","created":"Tue, 7 May 2024 15:53:35 GMT"}],"updateDate":"2024-07-15","timestamp":1715097215000,"abstract":"  As Artificial Intelligence ecosystems become increasingly entangled within\nour everyday lives, designing systems that are ethical, inclusive and socially\njust is more vital than ever. It is well known that AI can algorithmic biases\nthat reflect, extend and exacerbate our existing systemic injustices. Yet,\ndespite most teenagers interacting with AI daily, only few have the opportunity\nto learn how it works and its socio-technical complexities. This is a\nparticularly salient issue for marginalized communities. BIPOC teens are often\nmisrepresented throughout AI development and implementation, but they are also\nless likely to receive STEM education.In response to these unprecedented\nsocio-technical challenges and calls for more critical approaches to\nchild-centered AI design and education, we explore how we can leverage\nco-speculative design practices to help scaffold BIPOC youth (ages 14-17)\ncritiques of existing AI systems and support the re-imagining of more just AI\nfutures. Drawing on Harway's Situated Knowledges and Speculative Fabulations,\nthese workshops highlight the unique ways marginalized youth perceive AI as\nhaving social and ethical implications and how they envision alternative worlds\nwith AI. Our case study describes three 2 hour sessions of a larger 8 week\nblack-led AI STEM program. Analysis includes, data from pre-post surveys,\nworkshop recordings, focus group discussions, learning artifacts, and field\nnotes. We contribute 1) a discussion of how youth perceive AI as having social\nand ethical implications, 2) a nuanced understanding of how speculative\napproaches can be leveraged to support youth engagement with complex\nsocio-technical issues and 3) enable youth to open up new AI possibilities in a\nworld absent of techno-capitalist values.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"bsLpKqcvJRW6oUMK7wYtk8CkqYUdxQ4k7J9P6Lzc8zw","pdfSize":"2661496"}