{"id":"2407.21570","title":"Vision and Contact based Optimal Control for Autonomous Trocar Docking","authors":"Christopher E. Mower, Martin Huber, Huanyu Tian, Ayoob Davoodi,\n  Emmanuel Vander Poorten, Tom Vercauteren, Christos Bergeles","authorsParsed":[["Mower","Christopher E.",""],["Huber","Martin",""],["Tian","Huanyu",""],["Davoodi","Ayoob",""],["Poorten","Emmanuel Vander",""],["Vercauteren","Tom",""],["Bergeles","Christos",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 12:53:49 GMT"}],"updateDate":"2024-08-01","timestamp":1722430429000,"abstract":"  Future operating theatres will be equipped with robots to perform various\nsurgical tasks including, for example, endoscope control. Human-in-the-loop\nsupervisory control architectures where the surgeon selects from several\nautonomous sequences is already being successfully applied in preclinical\ntests. Inserting an endoscope into a trocar or introducer is a key step for\nevery keyhole surgical procedure -- hereafter we will only refer to this device\nas a \"trocar\". Our goal is to develop a controller for autonomous trocar\ndocking.\n  Autonomous trocar docking is a version of the peg-in-hole problem. Extensive\nwork in the robotics literature addresses this problem. The peg-in-hole problem\nhas been widely studied in the context of assembly where, typically, the hole\nis considered static and rigid to interaction. In our case, however, the trocar\nis not fixed and responds to interaction. We consider a variety of surgical\nprocedures where surgeons will utilize contact between the endoscope and trocar\nin order to complete the insertion successfully. To the best of our knowledge,\nwe have not found literature that explores this particular generalization of\nthe problem directly.\n  Our primary contribution in this work is an optimal control formulation for\nautomated trocar docking. We use a nonlinear optimization program to model the\ntask, minimizing a cost function subject to constraints to find optimal joint\nconfigurations. The controller incorporates a geometric model for insertion and\na force-feedback (FF) term to ensure patient safety by preventing excessive\ninteraction forces with the trocar. Experiments, demonstrated on a real\nhardware lab setup, validate the approach. Our method successfully achieves\ntrocar insertion on our real robot lab setup, and simulation trials demonstrate\nits ability to reduce interaction forces.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"MKJenG2RPj2HU44nO0NXZju_jBVzij9629Ci5Dkup-U","pdfSize":"96351"}