{"id":"2407.10192","title":"Going beyond Landauer scattering theory to describe spatially-resolved\n  non-local heating and cooling in quantum thermoelectrics","authors":"Nico G. Leumer, Denis M. Basko, Rodolfo A. Jalabert, Dietmar Weinmann\n  and Robert S. Whitney","authorsParsed":[["Leumer","Nico G.",""],["Basko","Denis M.",""],["Jalabert","Rodolfo A.",""],["Weinmann","Dietmar",""],["Whitney","Robert S.",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 13:22:55 GMT"},{"version":"v2","created":"Fri, 26 Jul 2024 13:03:22 GMT"}],"updateDate":"2024-07-29","timestamp":1720963375000,"abstract":"  Spatially-resolved heating and cooling in nanostructures is nowadays measured\nwith various nanoscale thermometry techniques, including scanning thermometry.\nYet the most commonly used theory of nanoscale heating and thermoelectricity --\nLandauer scattering theory -- is not appropriate to model such measurements.\nHence, we analyze a minimal model of spatially-resolved heat transfer between\nelectrons and phonons in simple thermoelectric nanostructures. This combines\nLandauer scattering formalism with a Boltzmann equation for transport,\nrevealing the non-locality of Joule heating and Peltier cooling induced by a\nscatterer in a nanowire. The corresponding heating or cooling of the phonons is\ncaused by the voltage drop at the scatterer, but is often maximal at a certain\ndistance from the scatterer. This distance is of the order of the\nelectron-phonon scattering length. Scanning thermal microscopy, such as\nSQUID-on-tip thermometers, should detect this non-locality as phonon hot spots\nand cold spots, spatially separated from the scatterer. We provide physical\narguments explaining the thermoelectric response of the combined system of wire\nand scatterer, and in particular, why the resulting heating and cooling is\nsometimes the opposite to that predicted by the standard Landauer scattering\ntheory.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"SxaLvoNeESKFgEWMoSljVHDPCT7A8LSpXttaLFV797o","pdfSize":"1563171","objectId":"0x52f6dad0e15f64f1621a5f16b0515f179972c72a80f1e58ca1013b8cd9868061","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
