{"id":"2407.20658","title":"Quantum and thermal pressures from light scalar fields","authors":"Hauke Fischer, Christian K\\\"ading, Mario Pitschmann","authorsParsed":[["Fischer","Hauke",""],["Käding","Christian",""],["Pitschmann","Mario",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 08:52:19 GMT"}],"updateDate":"2024-07-31","timestamp":1722329539000,"abstract":"  Light scalar fields play a variety of roles in modern physics, especially in\ncosmology and modified theories of gravity. For this reason, there is a zoo of\nexperiments actively trying to find evidence for many scalar field models that\nhave been proposed in theoretical considerations. Among those are setups in\nwhich the pressures expected to be induced by light scalar fields between two\nparallel plates are studied, for example, Casimir force experiments. While it\nis known that classical and quantum pressures caused by light scalar fields\ncould have significant impacts on such experiments, in this article, we show\nthat this can also be the case for thermal pressure. More specifically, we\nderive expressions for the quantum and thermal pressures induced by exchanges\nof light scalar field fluctuations between two thin parallel plates. As\nparticular examples, we then look at screened scalar fields. For chameleon,\nsymmetron and environment-dependent dilaton models, we find large regions in\ntheir parameter spaces that allow for thermal pressures to equal or exceed the\nquantum pressures. By comparing with earlier constraints from quantum pressure\ncalculations, we conclude that thermal pressures induced by chameleons are\nactually of experimental significance.\n","subjects":["Physics/High Energy Physics - Phenomenology","Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Theory","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"cuesMO3nWcjFzEa3jaTarA5mXhqP6Fxb5TuM-Sbw0NI","pdfSize":"625296"}