{"id":"2407.04937","title":"A Deep Learning Approach for Modeling and Hindcasting Lake Michigan Ice\n  Cover","authors":"Hazem Abdelhady and Cary Troy","authorsParsed":[["Abdelhady","Hazem",""],["Troy","Cary",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 03:01:11 GMT"}],"updateDate":"2024-07-09","timestamp":1720234871000,"abstract":"  In large lakes, ice cover plays an important role in shipping and navigation,\ncoastal erosion, regional weather and climate, and aquatic ecosystem function.\nIn this study, a novel deep learning model for ice cover concentration\nprediction in Lake Michigan is introduced. The model uses hindcasted\nmeteorological variables, water depth, and shoreline proximity as inputs, and\nNOAA ice charts for training, validation, and testing. The proposed framework\nleverages Convolution Long Short-Term Memory (ConvLSTM) and Convolution Neural\nNetwork (CNN) to capture both spatial and temporal dependencies between model\ninput and output to simulate daily ice cover at 0.1{\\deg} resolution. The model\nperformance was assessed through lake-wide average metrics and local error\nmetrics, with detailed evaluations conducted at six distinct locations in Lake\nMichigan. The results demonstrated a high degree of agreement between the\nmodel's predictions and ice charts, with an average RMSE of 0.029 for the daily\nlake-wide average ice concentration. Local daily prediction errors were\ngreater, with an average RMSE of 0.102. Lake-wide and local errors for weekly\nand monthly averaged ice concentrations were reduced by almost 50% from daily\nvalues. The accuracy of the proposed model surpasses currently available\nphysics-based models in the lake-wide ice concentration prediction, offering a\npromising avenue for enhancing ice prediction and hindcasting in large lakes.\n","subjects":["Physics/Atmospheric and Oceanic Physics","Physics/Data Analysis, Statistics and Probability"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"i3esJKmmTF6ZYPBFjOUfhXL8uxQWssy_q3brwVS6tww","pdfSize":"1611968"}