{"id":"2407.10246","title":"CourseAssist: Pedagogically Appropriate AI Tutor for Computer Science\n  Education","authors":"Ty Feng, Sa Liu, Dipak Ghosal","authorsParsed":[["Feng","Ty",""],["Liu","Sa",""],["Ghosal","Dipak",""]],"versions":[{"version":"v1","created":"Wed, 1 May 2024 20:43:06 GMT"},{"version":"v2","created":"Sat, 20 Jul 2024 01:21:02 GMT"},{"version":"v3","created":"Mon, 29 Jul 2024 23:01:18 GMT"}],"updateDate":"2024-07-31","timestamp":1714596186000,"abstract":"  The growing enrollments in computer science courses and increase in class\nsizes necessitate scalable, automated tutoring solutions to adequately support\nstudent learning. While Large Language Models (LLMs) like GPT-4 have\ndemonstrated potential in assisting students through question-answering,\neducators express concerns over student overreliance, miscomprehension of\ngenerated code, and the risk of inaccurate answers. Rather than banning these\ntools outright, we advocate for a constructive approach that harnesses the\ncapabilities of AI while mitigating potential risks. This poster introduces\nCourseAssist, a novel LLM-based tutoring system tailored for computer science\neducation. Unlike generic LLM systems, CourseAssist uses retrieval-augmented\ngeneration, user intent classification, and question decomposition to align AI\nresponses with specific course materials and learning objectives, thereby\nensuring pedagogical appropriateness of LLMs in educational settings. We\nevaluated CourseAssist against a baseline of GPT-4 using a dataset of 50\nquestion-answer pairs from a programming languages course, focusing on the\ncriteria of usefulness, accuracy, and pedagogical appropriateness. Evaluation\nresults show that CourseAssist significantly outperforms the baseline,\ndemonstrating its potential to serve as an effective learning assistant. We\nhave also deployed CourseAssist in 6 computer science courses at a large public\nR1 research university reaching over 500 students. Interviews with 20 student\nusers show that CourseAssist improves computer science instruction by\nincreasing the accessibility of course-specific tutoring help and shortening\nthe feedback loop on their programming assignments. Future work will include\nextensive pilot testing at more universities and exploring better collaborative\nrelationships between students, educators, and AI that improve computer science\nlearning experiences.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"xut6JIUnzMtPI_8jLczxvxXsXLVoJe48-uIsY66zy6o","pdfSize":"78955"}