{"id":"2407.01222","title":"Deep Learning Models for Flapping Fin Unmanned Underwater Vehicle\n  Control System Gait Optimization","authors":"Brian Zhou, Kamal Viswanath, Jason Geder, Alisha Sharma, Julian Lee","authorsParsed":[["Zhou","Brian",""],["Viswanath","Kamal",""],["Geder","Jason",""],["Sharma","Alisha",""],["Lee","Julian",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 12:11:17 GMT"}],"updateDate":"2024-07-02","timestamp":1719835877000,"abstract":"  The last few decades have led to the rise of research focused on propulsion\nand control systems for bio-inspired unmanned underwater vehicles (UUVs), which\nprovide more maneuverable alternatives to traditional UUVs in underwater\nmissions. Recent work has explored the use of time-series neural network\nsurrogate models to predict thrust and power from vehicle design and fin\nkinematics. We develop a search-based inverse model that leverages\nkinematics-to-thrust and kinematics-to-power neural network models for control\nsystem design. Our inverse model finds a set of fin kinematics with the\nmulti-objective goal of reaching a target thrust under power constraints while\ncreating a smooth kinematics transition between flapping cycles. We demonstrate\nhow a control system integrating this inverse model can make online,\ncycle-to-cycle adjustments to prioritize different system objectives, with\nimprovements in increasing thrust generation or reducing power consumption of\nany given movement upwards of 0.5 N and 3.0 W in a range of 2.2 N and 9.0 W. As\npropulsive efficiency is of utmost importance for flapping-fin UUVs in order to\nextend their range and endurance for essential operations but lacks prior\nresearch, we develop a non-dimensional figure of merit (FOM), derived from\nmeasures of propulsive efficiency, that is able to evaluate different fin\ndesigns and kinematics, and allow for comparison with other bio-inspired\nplatforms. We use the developed FOM to analyze optimal gaits and compare the\nperformance between different fin materials, providing a better understanding\nof how fin materials affect thrust generation and propulsive efficiency and\nallowing us to inform control systems and weight for efficiency on the\ndeveloped inverse gait-selector model.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"f9qsycGh7aQ1nUs08ft23PEzXsk9zLEV4cHQqPsD89w","pdfSize":"33367604"}