{"id":"2407.00234","title":"Medium-scale thermospheric gravity waves in the high-resolution Whole\n  Atmosphere Model: Seasonal, local time, and longitudinal variations","authors":"Garima Malhotra, Timothy Fuller-Rowell, Tzu-Wei Fang, Valery Yudin,\n  Svetlana Karol, Erich Becker, Adam Marshall Kubaryk","authorsParsed":[["Malhotra","Garima",""],["Fuller-Rowell","Timothy",""],["Fang","Tzu-Wei",""],["Yudin","Valery",""],["Karol","Svetlana",""],["Becker","Erich",""],["Kubaryk","Adam Marshall",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 21:11:09 GMT"}],"updateDate":"2024-07-02","timestamp":1719609069000,"abstract":"  This paper presents a study of the global medium-scale (scales<620 km)\ngravity wave (GW) activity (in terms of zonal wind variance) and its seasonal,\nlocal time and longitudinal variations by employing the enhanced-resolution\n(~50 km) Whole Atmosphere Model (WAMT254) and space-based observations for\ngeomagnetically quiet conditions. It is found that the GW hotspots produced by\nWAMT254 in the troposphere and stratosphere agree well with previously\nwell-studied orographic and non-orographic sources. In the\nionosphere-thermosphere (IT) region, GWs spread out forming latitudinal\nband-like hotspots. During solstices, a primary maximum in GW activity is\nobserved in WAMT254 and GOCE over winter mid-high latitudes, likely associated\nwith higher-order waves with primary sources in polar night jet, fronts and\npolar vortex. During all the seasons, the enhancement of GWs around the\ngeomagnetic poles as observed by GOCE (at ~250 km) is well captured by\nsimulations. WAMT254 GWs in the IT region also show dependence on local time\ndue to their interaction with migrating tides leading to diurnal and\nsemidiurnal variations. The GWs are more likely to propagate up from the MLT\nregion during westward/weakly-eastward phase of thermospheric tides, signifying\nthe dominance of eastward GW momentum flux in the MLT. Additionally, as a novel\nfinding, a wavenumber-4 signature in GW activity is predicted by WAMT254\nbetween 6-12 LT in the tropics at ~250 km, which propagates eastward with local\ntime. This behavior is likely associated with the modulation of GWs by wave-4\nsignal of non-migrating tides in the lower thermospheric zonal winds.\n","subjects":["Physics/Space Physics","Physics/Atmospheric and Oceanic Physics","Physics/Data Analysis, Statistics and Probability","Physics/Geophysics","Physics/Plasma Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"XUcL-EZXFDNfrSFOrP13dEDI3VkDExRAI6edGEafl8Y","pdfSize":"18721815"}