{"id":"2407.05973","title":"Active Label Refinement for Robust Training of Imbalanced Medical Image\n  Classification Tasks in the Presence of High Label Noise","authors":"Bidur Khanal, Tianhong Dai, Binod Bhattarai, Cristian Linte","authorsParsed":[["Khanal","Bidur",""],["Dai","Tianhong",""],["Bhattarai","Binod",""],["Linte","Cristian",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 14:16:05 GMT"}],"updateDate":"2024-07-09","timestamp":1720448165000,"abstract":"  The robustness of supervised deep learning-based medical image classification\nis significantly undermined by label noise. Although several methods have been\nproposed to enhance classification performance in the presence of noisy labels,\nthey face some challenges: 1) a struggle with class-imbalanced datasets,\nleading to the frequent overlooking of minority classes as noisy samples; 2) a\nsingular focus on maximizing performance using noisy datasets, without\nincorporating experts-in-the-loop for actively cleaning the noisy labels. To\nmitigate these challenges, we propose a two-phase approach that combines\nLearning with Noisy Labels (LNL) and active learning. This approach not only\nimproves the robustness of medical image classification in the presence of\nnoisy labels, but also iteratively improves the quality of the dataset by\nrelabeling the important incorrect labels, under a limited annotation budget.\nFurthermore, we introduce a novel Variance of Gradients approach in LNL phase,\nwhich complements the loss-based sample selection by also sampling\nunder-represented samples. Using two imbalanced noisy medical classification\ndatasets, we demonstrate that that our proposed technique is superior to its\npredecessors at handling class imbalance by not misidentifying clean samples\nfrom minority classes as mostly noisy samples.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ZxoOQHDEeWAt0QbptLaOpp3ZADUmFlsogaAdoonOGqo","pdfSize":"7224875"}