{"id":"2407.12880","title":"Cross-Modal Augmentation for Few-Shot Multimodal Fake News Detection","authors":"Ye Jiang, Taihang Wang, Xiaoman Xu, Yimin Wang, Xingyi Song, Diana\n  Maynard","authorsParsed":[["Jiang","Ye",""],["Wang","Taihang",""],["Xu","Xiaoman",""],["Wang","Yimin",""],["Song","Xingyi",""],["Maynard","Diana",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 09:32:11 GMT"}],"updateDate":"2024-07-19","timestamp":1721122331000,"abstract":"  The nascent topic of fake news requires automatic detection methods to\nquickly learn from limited annotated samples. Therefore, the capacity to\nrapidly acquire proficiency in a new task with limited guidance, also known as\nfew-shot learning, is critical for detecting fake news in its early stages.\nExisting approaches either involve fine-tuning pre-trained language models\nwhich come with a large number of parameters, or training a complex neural\nnetwork from scratch with large-scale annotated datasets. This paper presents a\nmultimodal fake news detection model which augments multimodal features using\nunimodal features. For this purpose, we introduce Cross-Modal Augmentation\n(CMA), a simple approach for enhancing few-shot multimodal fake news detection\nby transforming n-shot classification into a more robust (n $\\times$ z)-shot\nproblem, where z represents the number of supplementary features. The proposed\nCMA achieves SOTA results over three benchmark datasets, utilizing a\nsurprisingly simple linear probing method to classify multimodal fake news with\nonly a few training samples. Furthermore, our method is significantly more\nlightweight than prior approaches, particularly in terms of the number of\ntrainable parameters and epoch times. The code is available here:\n\\url{https://github.com/zgjiangtoby/FND_fewshot}\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"1aGViWjNzoS9H1MeTf0vXk8TXNvPEjBfS3CbGf8gu-s","pdfSize":"2024375","objectId":"0xd00aea9c0df70514f995d943a6f328ec6cbf5243165238001707b1fcff5b2e23","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
