{"id":"2407.04902","title":"In situ observation of thermally activated and localized Li leaching\n  from lithiated graphite","authors":"Harrison Szeto, Vijay Kumar and Yangying Zhu","authorsParsed":[["Szeto","Harrison",""],["Kumar","Vijay",""],["Zhu","Yangying",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 00:37:52 GMT"}],"updateDate":"2024-07-09","timestamp":1720226272000,"abstract":"  Temperature is known to impact Li-ion battery performance and safety,\nhowever, understanding its effect on Li-ion batteries has largely been limited\nto uniform high or low temperatures. While the insights gathered from such\nresearch are important, much less information is available on the effects of\nnon-uniform temperatures which more accurately reflect the environments that\nLi-ion batteries are exposed to in real world applications. In this paper, we\ncharacterize the impact of a microscale, temperature hotspot on a Li-ion\nbattery using a combination of in situ micro-Raman spectroscopy, in situ\noptical microscopy and COMSOL Multiphysics thermal simulations. Our results\nshow that mild temperature heterogeneity induced by the micro-Raman laser can\ncause lithium to locally leach out from different lithiated graphite phases\n(LiC6 and LiC12) in the absence of an applied current. The Li metal is found to\nbe largely localized to the region heated by the micro-Raman laser and is not\nobserved upon uniform heating to comparable temperatures suggesting that\ntemperature heterogeneity is uniquely responsible for causing Li to leach out\nfrom lithiated graphite phases. A mechanism whereby localized temperature\nheterogeneity induced by the laser induces heterogeneity in the degree of\nlithiation across the graphite anode is proposed to explain the localized Li\nleaching. This study highlights the sensitivity of lithiated graphite phases to\nminor temperature heterogeneity in the absence of an applied current.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"29aNPrBUr7U9aVkQhhBMylz-_0PeV1firG_4CohbH7s","pdfSize":"1810334"}