{"id":"2407.00550","title":"Challenging the Need for Packet Spraying in Large-Scale Distributed\n  Training","authors":"Vamsi Addanki, Prateesh Goyal, Ilias Marinos","authorsParsed":[["Addanki","Vamsi",""],["Goyal","Prateesh",""],["Marinos","Ilias",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 00:45:58 GMT"}],"updateDate":"2024-07-02","timestamp":1719708358000,"abstract":"  Large-scale distributed training in production datacenters constitutes a\nchallenging workload bottlenecked by network communication. In response, both\nmajor industry players (e.g., Ultra Ethernet Consortium) and parts of academia\nhave surprisingly, and almost unanimously, agreed that packet spraying is\nnecessary to improve the performance of large-scale distributed training\nworkloads.\n  In this paper, we challenge this prevailing belief and pose the question: How\nclose can a singlepath transport approach an optimal multipath transport? We\ndemonstrate that singlepath transport (from a NIC's perspective) is sufficient\nand can perform nearly as well as an ideal multipath transport with packet\nspraying, particularly in the context of distributed training in leaf-spine\ntopologies. Our assertion is based on four key observations about workloads\ndriven by collective communication patterns: (i) flows within a collective\nstart almost simultaneously, (ii) flow sizes are nearly equal, (iii) the\ncompletion time of a collective is more crucial than individual flow completion\ntimes, and (iv) flows can be split upon arrival. We analytically prove that\nsinglepath transport, using minimal flow splitting (at the application layer),\nis equivalent to an ideal multipath transport with packet spraying in terms of\nmaximum congestion. Our preliminary evaluations support our claims. This paper\nsuggests an alternative agenda for developing next-generation transport\nprotocols tailored for large-scale distributed training.\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"PZmqWLREEu9PL4JXB109PMA--5VwFIEctjemA0y4lqY","pdfSize":"890081"}