{"id":"2407.13759","title":"Streetscapes: Large-scale Consistent Street View Generation Using\n  Autoregressive Video Diffusion","authors":"Boyang Deng, Richard Tucker, Zhengqi Li, Leonidas Guibas, Noah\n  Snavely, Gordon Wetzstein","authorsParsed":[["Deng","Boyang",""],["Tucker","Richard",""],["Li","Zhengqi",""],["Guibas","Leonidas",""],["Snavely","Noah",""],["Wetzstein","Gordon",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 17:56:30 GMT"},{"version":"v2","created":"Thu, 25 Jul 2024 17:47:20 GMT"}],"updateDate":"2024-07-26","timestamp":1721325390000,"abstract":"  We present a method for generating Streetscapes-long sequences of views\nthrough an on-the-fly synthesized city-scale scene. Our generation is\nconditioned by language input (e.g., city name, weather), as well as an\nunderlying map/layout hosting the desired trajectory. Compared to recent models\nfor video generation or 3D view synthesis, our method can scale to much\nlonger-range camera trajectories, spanning several city blocks, while\nmaintaining visual quality and consistency. To achieve this goal, we build on\nrecent work on video diffusion, used within an autoregressive framework that\ncan easily scale to long sequences. In particular, we introduce a new temporal\nimputation method that prevents our autoregressive approach from drifting from\nthe distribution of realistic city imagery. We train our Streetscapes system on\na compelling source of data-posed imagery from Google Street View, along with\ncontextual map data-which allows users to generate city views conditioned on\nany desired city layout, with controllable camera poses. Please see more\nresults at our project page at https://boyangdeng.com/streetscapes.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Graphics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"mb4eJ7-79klyzyHPozWTG961U1LtUKICR74FAN6wFuU","pdfSize":"28220209","objectId":"0x01ca1561c6fd9c55c998cce1cea27524b265e1f5bfb5ae21ff3f1563f3a5a8e4","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
