{"id":"2407.14950","title":"Ferrimagnetic hexagonal Mn$_2$CuGe Heusler alloy with a low-temperature\n  spin-glass state","authors":"Abhinav Kumar Khorwal, Sonu Vishvakarma, Sujoy Saha, Debashish Patra,\n  Akriti Singh, Surajit Saha, V. Srinivas, and Ajit K. Patra","authorsParsed":[["Khorwal","Abhinav Kumar",""],["Vishvakarma","Sonu",""],["Saha","Sujoy",""],["Patra","Debashish",""],["Singh","Akriti",""],["Saha","Surajit",""],["Srinivas","V.",""],["Patra","Ajit K.",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 17:54:02 GMT"}],"updateDate":"2024-07-23","timestamp":1721498042000,"abstract":"  An extensive experimental investigation on the structural, static magnetic,\nand non-equilibrium dynamical properties of polycrystalline Mn$_2$CuGe Heusler\nalloy using powder X-ray diffraction, DC magnetization, magnetic relaxation,\nmagnetic memory effect, and specific heat measurements is presented. Structural\nstudies reveal that the alloy crystallizes in a mixed hexagonal crystal\nstructure (space groups P3c1 (no. 158) and P6$_3$/mmc (no. 194)) with lattice\nparameters a = b = 7.18(4) $\\mathring{A}$ and c = 13.12(4) $\\mathring{A}$ for\nthe majority phase. The DC magnetization analysis reveals a paramagnetic to\nferrimagnetic phase transition around T$_C$ $\\approx$ 682 K with a compensation\nof magnetization at $\\approx$ 250 K, and a spin-glass transition around T$_P$\n$\\approx$ 25.6 K. The N\\'eel theory of ferrimagnets supports the ferrimagnetic\nnature of the studied alloy and the estimated T$_C$ ($\\approx$ 687 K) from this\ntheory is consistent with that obtained from the DC magnetization data. A\ndetailed study of non-equilibrium spin dynamics via magnetic relaxation and\nmemory effect experiments shows the evolution of the system through a number of\nintermediate states and striking magnetic memory effect. Furthermore, heat\ncapacity measurements suggest a large electronic contribution to the specific\nheat capacity suggesting strong spin fluctuations, due to competing magnetic\ninteractions. All the observations render a spin-glass behavior in Mn$_2$CuGe,\nattributed to the magnetic frustration possibly arising out of the competing\nferromagnetic and antiferromagnetic interactions.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ejR5zCJlwjkmEox_zKt7BIAP9Mw1jrqgJcY4YPNfN1Q","pdfSize":"14217195"}