{"id":"2407.05111","title":"Noncommutative wormhole in de Rham-Gabadadze-Tolley like massive gravity","authors":"Piyali Bhar, Allah Ditta, and Abdelghani Errehymy","authorsParsed":[["Bhar","Piyali",""],["Ditta","Allah",""],["Errehymy","Abdelghani",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 15:41:17 GMT"}],"updateDate":"2024-07-30","timestamp":1720280477000,"abstract":"  The wormhole solution in dRGT massive gravity is examined in this paper in\nthe background of non-commutative geometry. In order to derive the wormhole\nmodel, along with the zero tidal force, we assume that the matter distribution\nis given by the Gaussian and Lorentzian distributions. The shape function in\nboth models involves the massive gravity parameters m2c1 and m2c2. But the\nspacetime loses its asymptotic flatness due to the action of the massive\ngravity parameter. It is noticed that the asymptotic flatness is affected by\nthe repulsive effect induced in the massive gravitons that push the spacetime\ngeometry very strongly. We observed that each model violates the null energy\ncriteria, indicating the presence of exotic matter which is necessary to\nsustain the wormholes. The exotic matter is measured using the volume integral\nquantifier. Moreover, it is discovered that the model is stable under the\nhydrostatic equilibrium condition by utilizing the TOV equation. Finally, our\nresearch encompassed an exploration of the repulsive influence exerted by\ngravity. Our findings demonstrated that the presence of repulsive gravity\nresults in a negative deflection angle for photons following null geodesics.\nRemarkably, we consistently observed negative values for the deflection angle\nacross all values of r0 in the two scenarios examined. This consistent\nnegativity unequivocally signifies the manifestation of the repulsive gravity\neffect.\n","subjects":["Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_AybDUANKgblaXbJ9B3Y-bfeNv0AVj0DbbGDMd9Fp34","pdfSize":"4348901"}
