{"id":"2407.13638","title":"A Comparative Study on Automatic Coding of Medical Letters with\n  Explainability","authors":"Jamie Glen, Lifeng Han, Paul Rayson, Goran Nenadic","authorsParsed":[["Glen","Jamie",""],["Han","Lifeng",""],["Rayson","Paul",""],["Nenadic","Goran",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 16:12:47 GMT"}],"updateDate":"2024-07-19","timestamp":1721319167000,"abstract":"  This study aims to explore the implementation of Natural Language Processing\n(NLP) and machine learning (ML) techniques to automate the coding of medical\nletters with visualised explainability and light-weighted local computer\nsettings. Currently in clinical settings, coding is a manual process that\ninvolves assigning codes to each condition, procedure, and medication in a\npatient's paperwork (e.g., 56265001 heart disease using SNOMED CT code). There\nare preliminary research on automatic coding in this field using\nstate-of-the-art ML models; however, due to the complexity and size of the\nmodels, the real-world deployment is not achieved. To further facilitate the\npossibility of automatic coding practice, we explore some solutions in a local\ncomputer setting; in addition, we explore the function of explainability for\ntransparency of AI models. We used the publicly available MIMIC-III database\nand the HAN/HLAN network models for ICD code prediction purposes. We also\nexperimented with the mapping between ICD and SNOMED CT knowledge bases. In our\nexperiments, the models provided useful information for 97.98\\% of codes. The\nresult of this investigation can shed some light on implementing automatic\nclinical coding in practice, such as in hospital settings, on the local\ncomputers used by clinicians , project page\n\\url{https://github.com/Glenj01/Medical-Coding}.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"fR_yuqwu1OIeSzL4wiJTD6lp4miCfPaRU_CEKeI2T3E","pdfSize":"6094316"}