{"id":"2407.17732","title":"Photon-resolved Floquet theory I: Full-Counting statistics of the\n  driving field in Floquet systems","authors":"Georg Engelhardt, JunYan Luo, Victor M. Bastidas, Gloria Platero","authorsParsed":[["Engelhardt","Georg",""],["Luo","JunYan",""],["Bastidas","Victor M.",""],["Platero","Gloria",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 03:07:40 GMT"}],"updateDate":"2024-07-26","timestamp":1721876860000,"abstract":"  Floquet theory and other established semiclassical approaches are widely used\nmethods to predict the state of externally-driven quantum systems, yet, they do\nnot allow to predict the state of the photonic driving field. To overcome this\nshortcoming, the photon-resolved Floquet theory (PRFT) has been developed\nrecently [Phys. Rev. Research 6, 013116], which deploys concepts from\nfull-counting statistics to predict the statistics of the photon flux between\nseveral coherent driving modes. In this paper, we study in detail the scaling\nproperties of the PRFT in the semiclassical regime. We find that there is an\nambiguity in the definition of the moment-generating function, such that\ndifferent versions of the moment-generating function produce the same photonic\nprobability distribution in the semiclassical limit, and generate the same\nleading-order terms of the moments and cumulants. Using this ambiguity, we\nestablish a simple expression for the Kraus operators, which describe the\ndecoherence dynamics of the driven quantum system appearing as a consequence of\nthe light-matter interaction. The PRFT will pave the way for improved quantum\nsensing methods, e.g., for spectroscopic quantum sensing protocols,\nreflectometry in semiconductor nanostructures and other applications, where the\ndetailed knowledge of the photonic probability distribution is necessary.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"CbzrQLe2KpqUeDLhCAt_McNGzQ1owBb8EvoOhrg-aow","pdfSize":"12648506","objectId":"0xcbc65db3dc6195fc7202064a929ce838c43ff42c374a3ae7a7404bbd41e04df5","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
