{"id":"2407.19813","title":"Improving Retrieval Augmented Language Model with Self-Reasoning","authors":"Yuan Xia, Jingbo Zhou, Zhenhui Shi, Jun Chen, Haifeng Huang","authorsParsed":[["Xia","Yuan",""],["Zhou","Jingbo",""],["Shi","Zhenhui",""],["Chen","Jun",""],["Huang","Haifeng",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 09:05:10 GMT"},{"version":"v2","created":"Fri, 2 Aug 2024 12:11:17 GMT"}],"updateDate":"2024-08-05","timestamp":1722243910000,"abstract":"  The Retrieval-Augmented Language Model (RALM) has shown remarkable\nperformance on knowledge-intensive tasks by incorporating external knowledge\nduring inference, which mitigates the factual hallucinations inherited in large\nlanguage models (LLMs). Despite these advancements, challenges persist in the\nimplementation of RALMs, particularly concerning their reliability and\ntraceability. To be specific, the irrelevant document retrieval may result in\nunhelpful response generation or even deteriorate the performance of LLMs,\nwhile the lack of proper citations in generated outputs complicates efforts to\nverify the trustworthiness of the models. To this end, we propose a novel\nself-reasoning framework aimed at improving the reliability and traceability of\nRALMs, whose core idea is to leverage reasoning trajectories generated by the\nLLM itself. The framework involves constructing self-reason trajectories with\nthree processes: a relevance-aware process, an evidence-aware selective\nprocess, and a trajectory analysis process. We have evaluated our framework\nacross four public datasets (two short-form QA datasets, one long-form QA\ndataset, and one fact verification dataset) to demonstrate the superiority of\nour method, which can outperform existing state-of-art models and can achieve\ncomparable performance with GPT-4, while only using 2,000 training samples.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"aZs_9lL62LRqTiGiIzpiOmzBDdFKoT5BW8ltMuH3zkY","pdfSize":"2024955"}