{"id":"2407.18656","title":"Auto DragGAN: Editing the Generative Image Manifold in an Autoregressive\n  Manner","authors":"Pengxiang Cai, Zhiwei Liu, Guibo Zhu, Yunfang Niu, Jinqiao Wang","authorsParsed":[["Cai","Pengxiang",""],["Liu","Zhiwei",""],["Zhu","Guibo",""],["Niu","Yunfang",""],["Wang","Jinqiao",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 10:45:57 GMT"}],"updateDate":"2024-07-29","timestamp":1721990757000,"abstract":"  Pixel-level fine-grained image editing remains an open challenge. Previous\nworks fail to achieve an ideal trade-off between control granularity and\ninference speed. They either fail to achieve pixel-level fine-grained control,\nor their inference speed requires optimization. To address this, this paper for\nthe first time employs a regression-based network to learn the variation\npatterns of StyleGAN latent codes during the image dragging process. This\nmethod enables pixel-level precision in dragging editing with little time cost.\nUsers can specify handle points and their corresponding target points on any\nGAN-generated images, and our method will move each handle point to its\ncorresponding target point. Through experimental analysis, we discover that a\nshort movement distance from handle points to target points yields a\nhigh-fidelity edited image, as the model only needs to predict the movement of\na small portion of pixels. To achieve this, we decompose the entire movement\nprocess into multiple sub-processes. Specifically, we develop a transformer\nencoder-decoder based network named 'Latent Predictor' to predict the latent\ncode motion trajectories from handle points to target points in an\nautoregressive manner. Moreover, to enhance the prediction stability, we\nintroduce a component named 'Latent Regularizer', aimed at constraining the\nlatent code motion within the distribution of natural images. Extensive\nexperiments demonstrate that our method achieves state-of-the-art (SOTA)\ninference speed and image editing performance at the pixel-level granularity.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"SIcgAfX2LevzsRS0OcNVUrtsObxqqBuih5tpTXcoL8w","pdfSize":"42255590"}