{"id":"2407.06505","title":"Not all explicit cues help communicate: Pedestrians' perceptions,\n  fixations, and decisions toward automated vehicles with varied appearance","authors":"Wei Lyu, Yaqin Cao, Yi Ding, Jingyu Li, Kai Tian, Hui Zhang","authorsParsed":[["Lyu","Wei",""],["Cao","Yaqin",""],["Ding","Yi",""],["Li","Jingyu",""],["Tian","Kai",""],["Zhang","Hui",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 02:23:49 GMT"}],"updateDate":"2024-07-10","timestamp":1720491829000,"abstract":"  Given pedestrians' vulnerability in road traffic, it remains unclear how\nnovel AV appearances will impact pedestrians crossing behaviour. To address\nthis gap, this study pioneers an investigation into the influence of AVs'\nexterior design, correlated with their kinematics, on pedestrians'\nroad-crossing perception and decision-making. A video-based eye-tracking\nexperimental study was conducted with 61 participants who responded to video\nstimuli depicting a manipulated vehicle approaching a predefined road-crossing\nlocation on an unsignalized, two-way road. The vehicle's kinematic pattern was\nmanipulated into yielding and non-yielding, and its external appearances were\nvaried across five types: with a human driver (as a conventional vehicle), with\nno driver (as an AV), with text-based identity indications, with roof radar\nsensors, with dynamic eHMIs adjusted to vehicle kinematics. Participants'\nperceived clarity, crossing initiation distance (CID), crossing decision time\n(CDT), and gaze behaviour, during interactions were recorded and reported. The\nresults indicated that AVs' kinematic profiles play a dominant role in\npedestrians' road-crossing decisions, supported by their subjective\nevaluations, CID, CDT, and gaze patterns during interactions. Moreover, the use\nof clear eHMI, such as dynamic pedestrian icons, reduced pedestrians' visual\nload, enhanced their perceptual clarity, expedited road-crossing decisions, and\nthereby improved overall crossing efficiency. However, it was found that both\ntextual identity indications and roof radar sensors have no significant effect\non pedestrians' decisions but negatively impact pedestrians' visual attention,\nas evidenced by heightened fixation counts and prolonged fixation durations,\nparticularly under yielding conditions. Excessive visual and cognitive resource\noccupation suggests that not all explicit cues facilitate human-vehicle\ncommunication.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"2YQYEeZ7RdSMbWqQ7V8qYlEf_-5Xx-seVh_kEMv2rNM","pdfSize":"2197503"}