{"id":"2407.16576","title":"Exploring Automatic Cryptographic API Misuse Detection in the Era of\n  LLMs","authors":"Yifan Xia, Zichen Xie, Peiyu Liu, Kangjie Lu, Yan Liu, Wenhai Wang,\n  Shouling Ji","authorsParsed":[["Xia","Yifan",""],["Xie","Zichen",""],["Liu","Peiyu",""],["Lu","Kangjie",""],["Liu","Yan",""],["Wang","Wenhai",""],["Ji","Shouling",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 15:31:26 GMT"}],"updateDate":"2024-07-24","timestamp":1721748686000,"abstract":"  While the automated detection of cryptographic API misuses has progressed\nsignificantly, its precision diminishes for intricate targets due to the\nreliance on manually defined patterns. Large Language Models (LLMs), renowned\nfor their contextual understanding, offer a promising avenue to address\nexisting shortcomings. However, applying LLMs in this security-critical domain\npresents challenges, particularly due to the unreliability stemming from LLMs'\nstochastic nature and the well-known issue of hallucination. To explore the\nprevalence of LLMs' unreliable analysis and potential solutions, this paper\nintroduces a systematic evaluation framework to assess LLMs in detecting\ncryptographic misuses, utilizing a comprehensive dataset encompassing both\nmanually-crafted samples and real-world projects. Our in-depth analysis of\n11,940 LLM-generated reports highlights that the inherent instabilities in LLMs\ncan lead to over half of the reports being false positives. Nevertheless, we\ndemonstrate how a constrained problem scope, coupled with LLMs' self-correction\ncapability, significantly enhances the reliability of the detection. The\noptimized approach achieves a remarkable detection rate of nearly 90%,\nsurpassing traditional methods and uncovering previously unknown misuses in\nestablished benchmarks. Moreover, we identify the failure patterns that\npersistently hinder LLMs' reliability, including both cryptographic knowledge\ndeficiency and code semantics misinterpretation. Guided by these insights, we\ndevelop an LLM-based workflow to examine open-source repositories, leading to\nthe discovery of 63 real-world cryptographic misuses. Of these, 46 have been\nacknowledged by the development community, with 23 currently being addressed\nand 6 resolved. Reflecting on developers' feedback, we offer recommendations\nfor future research and the development of LLM-based security tools.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"dmX5m5QdiBm3dBEm5hcZlpejL_IF93hTz5q8ViFgLsw","pdfSize":"970808"}