{"id":"2407.05796","title":"Poisson Ordinal Network for Gleason Group Estimation Using Bi-Parametric\n  MRI","authors":"Yinsong Xu, Yipei Wang, Ziyi Shen, Iani J.M.B. Gayo, Natasha Thorley,\n  Shonit Punwani, Aidong Men, Dean Barratt, Qingchao Chen, Yipeng Hu","authorsParsed":[["Xu","Yinsong",""],["Wang","Yipei",""],["Shen","Ziyi",""],["Gayo","Iani J. M. B.",""],["Thorley","Natasha",""],["Punwani","Shonit",""],["Men","Aidong",""],["Barratt","Dean",""],["Chen","Qingchao",""],["Hu","Yipeng",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 09:56:30 GMT"}],"updateDate":"2024-07-09","timestamp":1720432590000,"abstract":"  The Gleason groups serve as the primary histological grading system for\nprostate cancer, providing crucial insights into the cancer's potential for\ngrowth and metastasis. In clinical practice, pathologists determine the Gleason\ngroups based on specimens obtained from ultrasound-guided biopsies. In this\nstudy, we investigate the feasibility of directly estimating the Gleason groups\nfrom MRI scans to reduce otherwise required biopsies. We identify two\ncharacteristics of this task, ordinality and the resulting dependent yet\nunknown variances between Gleason groups. In addition to the inter- / intra-\nobserver variability in a multi-step Gleason scoring process based on the\ninterpretation of Gleason patterns, our MR-based prediction is also subject to\nspecimen sampling variance and, to a lesser degree, varying MR imaging\nprotocols. To address this challenge, we propose a novel Poisson ordinal\nnetwork (PON). PONs model the prediction using a Poisson distribution and\nleverages Poisson encoding and Poisson focal loss to capture a learnable\ndependency between ordinal classes (here, Gleason groups), rather than relying\nsolely on the numerical ground-truth (e.g. Gleason Groups 1-5 or Gleason Scores\n6-10). To improve this modelling efficacy, PONs also employ contrastive\nlearning with a memory bank to regularise intra-class variance, decoupling the\nmemory requirement of contrast learning from the batch size. Experimental\nresults based on the images labelled by saturation biopsies from 265\nprior-biopsy-blind patients, across two tasks demonstrate the superiority and\neffectiveness of our proposed method.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"-Ivr22K6RnpyPZY-Og4fqt-GfcpWoS5S6iONiLEmwyA","pdfSize":"1119896"}