{"id":"2407.10745","title":"What distinguishes conspiracy from critical narratives? A computational\n  analysis of oppositional discourse","authors":"Damir Koren\\v{c}i\\'c, Berta Chulvi, Xavier Bonet Casals, Alejandro\n  Toselli, Mariona Taul\\'e, Paolo Rosso","authorsParsed":[["Korenčić","Damir",""],["Chulvi","Berta",""],["Casals","Xavier Bonet",""],["Toselli","Alejandro",""],["Taulé","Mariona",""],["Rosso","Paolo",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 14:18:47 GMT"}],"updateDate":"2024-07-16","timestamp":1721053127000,"abstract":"  The current prevalence of conspiracy theories on the internet is a\nsignificant issue, tackled by many computational approaches. However, these\napproaches fail to recognize the relevance of distinguishing between texts\nwhich contain a conspiracy theory and texts which are simply critical and\noppose mainstream narratives. Furthermore, little attention is usually paid to\nthe role of inter-group conflict in oppositional narratives. We contribute by\nproposing a novel topic-agnostic annotation scheme that differentiates between\nconspiracies and critical texts, and that defines span-level categories of\ninter-group conflict. We also contribute with the multilingual\nXAI-DisInfodemics corpus (English and Spanish), which contains a high-quality\nannotation of Telegram messages related to COVID-19 (5,000 messages per\nlanguage). We also demonstrate the feasibility of an NLP-based automatization\nby performing a range of experiments that yield strong baseline solutions.\nFinally, we perform an analysis which demonstrates that the promotion of\nintergroup conflict and the presence of violence and anger are key aspects to\ndistinguish between the two types of oppositional narratives, i.e., conspiracy\nvs. critical.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"71x2K9FOV0QSVO3eTeF6OgbSt447Gcu-pRFJDTc7VnM","pdfSize":"1596503"}