{"id":"2407.10637","title":"Quantum Skyrmion Liquid","authors":"Dhiman Bhowmick, Andreas Haller, Deepak S. Kathyat, Thomas L. Schmidt,\n  Pinaki Sengupta","authorsParsed":[["Bhowmick","Dhiman",""],["Haller","Andreas",""],["Kathyat","Deepak S.",""],["Schmidt","Thomas L.",""],["Sengupta","Pinaki",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 11:53:00 GMT"}],"updateDate":"2024-07-16","timestamp":1721044380000,"abstract":"  Skyrmions are topological magnetic textures, mostly treated classically,\nstudied extensively due to their potential spintronics applications due to\ntheir topological stability. However, it remains unclear what physical\nphenomena differentiate a classical from a quantum skyrmion. We present\nnumerical evidence for the existence of a quantum skyrmion liquid (SkL) phase\nin quasi-one-dimensional lattices which has no classical counterpart. The\ntransition from a conventional quantum skyrmion crystal (SkX) to a\nfield-polarized phase (FP) is found to be of second order while the analogous\nclassical transition near zero temperature is first-order due to a missing SkL\nphase. As an indicator of the quantum mechanical origin of the SkL phase, we\nfind concentrated entanglement (indicated by the concurrence) around the\nskyrmion center, which we attribute to the uncertainty in the skyrmion position\nresulting from the non-commutativity of the skyrmion coordinate operators. The\nlatter also gives rise to a nontrivial kinetic energy in the presence of an\natomic lattice. The SkL phase emerges when the kinetic energy dominates over\nthe skyrmion-skyrmion interaction energy. It is tied to the breaking of\ndiscrete translational invariance of the skyrmion crystal and occurs when the\nskyrmion radius is comparable with the size of the magnetic unit cell. In\ncontrast to the long-range order present in the SkX phase, spin-spin\ncorrelations in the SkL phase exponentially decay with distance, indicating the\nfluid-like behavior of uncorrelated skyrmions. The emergence of kinetic\nenergy-induced quantum SkL phase serves as a strong indication of the possible\nBose-Einstein condensation of skyrmions in higher-dimensional systems. Our\nfindings are effectively explained by microscopic theories like collective\ncoordinate formalism and trial wave functions, effectively enhancing our\nunderstanding of the numerical findings.\n","subjects":["Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"9eOSSSmgDQ2xT9eE-Bx3bFkIbeDSrVGY85XMiwXSNms","pdfSize":"18135467"}