{"id":"2407.02163","title":"Formation Mission Design for Commercial Aircraft Using Switched Optimal\n  Control Techniques","authors":"Mar\\'ia Cerezo-Maga\\~na, Alberto Olivares, and Ernesto Staffetti","authorsParsed":[["Cerezo-Magaña","María",""],["Olivares","Alberto",""],["Staffetti","Ernesto",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 11:14:23 GMT"}],"updateDate":"2024-07-03","timestamp":1719918863000,"abstract":"  In this article, the formation mission design problem for commercial aircraft\nis studied. Given the departure times and the departure and arrival locations\nof several commercial flights, the relevant weather forecast, and the expected\nfuel savings during formation flight, the problem consists in establishing how\nto organize them in formation or solo flights and in finding the trajectories\nthat minimize the overall direct operating cost of the flights. Each aircraft\ncan fly solo or in different positions inside a formation. Therefore, the\nmission is modeled as a switched dynamical system, in which the discrete state\ndescribes the combination of flight modes of the individual aircraft and\nlogical constraints in disjunctive form establish the switching logic among the\ndiscrete states of the system. The formation mission design problem has been\nformulated as an optimal control problem of a switched dynamical system and\nsolved using an embedding approach, which allows switching decision among\ndiscrete states to be modeled without relying on binary variables. The\nresulting problem is a classical optimal control problem which has been solved\nusing a knotting pseudospectral method. Several numerical experiments have been\nconducted to demonstrate the effectiveness of this approach. The obtained\nresults show that formation flight has great potential to reduce fuel\nconsumption and emissions.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"gPrRWn9g997NDk8lLhYlvoDkguf9SQCqYVfPtJxhM6Q","pdfSize":"4793848"}