{"id":"2407.16737","title":"A Survey of Text Style Transfer: Applications and Ethical Implications","authors":"Sourabrata Mukherjee, Mateusz Lango, Zdenek Kasner, Ondrej Du\\v{s}ek","authorsParsed":[["Mukherjee","Sourabrata",""],["Lango","Mateusz",""],["Kasner","Zdenek",""],["Dušek","Ondrej",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 17:15:23 GMT"}],"updateDate":"2024-07-25","timestamp":1721754923000,"abstract":"  Text style transfer (TST) is an important task in controllable text\ngeneration, which aims to control selected attributes of language use, such as\npoliteness, formality, or sentiment, without altering the style-independent\ncontent of the text. The field has received considerable research attention in\nrecent years and has already been covered in several reviews, but the focus has\nmostly been on the development of new algorithms and learning from different\ntypes of data (supervised, unsupervised, out-of-domain, etc.) and not so much\non the application side. However, TST-related technologies are gradually\nreaching a production- and deployment-ready level, and therefore, the inclusion\nof the application perspective in TST research becomes crucial. Similarly, the\noften overlooked ethical considerations of TST technology have become a\npressing issue. This paper presents a comprehensive review of TST applications\nthat have been researched over the years, using both traditional linguistic\napproaches and more recent deep learning methods. We discuss current\nchallenges, future research directions, and ethical implications of TST\napplications in text generation. By providing a holistic overview of the\nlandscape of TST applications, we hope to stimulate further research and\ncontribute to a better understanding of the potential as well as ethical\nconsiderations associated with TST.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"HBeSqZPATL84gkiLU66Xi19iukLbQ3F9VFt-8Hh2adk","pdfSize":"550568"}