{"id":"2407.07238","title":"Chemistry in the GG Tau A Disk: Constraints from H2D+, N2H+, and DCO+\n  High Angular Resolution ALMA Observations","authors":"Parashmoni Kashyap, Liton Majumdar, Anne Dutrey, St\\'ephane\n  Guilloteau, Karen Willacy, Edwige Chapillon, Richard Teague, Dmitry Semenov,\n  Thomas Henning, Neal Turner, Raghvendra Sahai, \\'Agnes K\\'osp\\'al, Audrey\n  Coutens, V. Pi\\'etu, Pierre Gratier, Maxime Ruaud, N. T. Phuong, E. Di Folco,\n  Chin-Fei Lee, Y.-W. Tang","authorsParsed":[["Kashyap","Parashmoni",""],["Majumdar","Liton",""],["Dutrey","Anne",""],["Guilloteau","Stéphane",""],["Willacy","Karen",""],["Chapillon","Edwige",""],["Teague","Richard",""],["Semenov","Dmitry",""],["Henning","Thomas",""],["Turner","Neal",""],["Sahai","Raghvendra",""],["Kóspál","Ágnes",""],["Coutens","Audrey",""],["Piétu","V.",""],["Gratier","Pierre",""],["Ruaud","Maxime",""],["Phuong","N. T.",""],["Di Folco","E.",""],["Lee","Chin-Fei",""],["Tang","Y. -W.",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 21:37:33 GMT"}],"updateDate":"2024-07-11","timestamp":1720561053000,"abstract":"  Resolved molecular line observations are essential for gaining insight into\nthe physical and chemical structure of protoplanetary disks, particularly in\ncold, dense regions where planets form and acquire compositions. However,\ntracing these regions is challenging because most molecules freeze onto grain\nsurfaces and are not observable in the gas phase. We investigated cold\nmolecular chemistry in the triple stellar T Tauri disk GG Tau A, which harbours\na massive gas and dust ring and an outer disk, using ALMA Band 7 observations.\nWe present high angular resolution maps of N2H+ and DCO+ emission, with upper\nlimits reported for H2D+, 13CS, and SO2. The radial intensity profile of N2H+\nshows most emission near the ring outer edge, while DCO+ exhibits double peaks,\none near the ring inner edge and the other in the outer disk. With\ncomplementary observations of lower-lying transitions, we constrained the\nmolecular surface densities and rotation temperatures. We compared the derived\nquantities with model predictions across different cosmic ray ionization (CRI)\nrates, carbon-to-oxygen (C/O) ratios, and stellar UV fluxes. Cold molecular\nchemistry, affecting N2H+, DCO+, and H2D+ abundances, is most sensitive to CRI\nrates, while stellar UV flux and C/O ratios have minimal impact on these three\nions. Our best model requires a low cosmic ray ionization rate of 1e-18 s-1.\nHowever, it fails to match the low temperatures derived from N2H+ and DCO+, 12\nto 16 K, which are much lower than the CO freezing temperature.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"hVZ9ZxG0JJBFKAf7XQIh4E5CHr2_kTxY13O-_YvuYOM","pdfSize":"4183428"}