{"id":"2407.04249","title":"FeatureSORT: Essential Features for Effective Tracking","authors":"Hamidreza Hashempoor, Rosemary Koikara, Yu Dong Hwang","authorsParsed":[["Hashempoor","Hamidreza",""],["Koikara","Rosemary",""],["Hwang","Yu Dong",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 04:37:39 GMT"}],"updateDate":"2024-07-08","timestamp":1720154259000,"abstract":"  In this work, we introduce a novel tracker designed for online multiple\nobject tracking with a focus on being simple, while being effective. we provide\nmultiple feature modules each of which stands for a particular appearance\ninformation. By integrating distinct appearance features, including clothing\ncolor, style, and target direction, alongside a ReID network for robust\nembedding extraction, our tracker significantly enhances online tracking\naccuracy. Additionally, we propose the incorporation of a stronger detector and\nalso provide an advanced post processing methods that further elevate the\ntracker's performance. During real time operation, we establish measurement to\ntrack associated distance function which includes the IoU, direction, color,\nstyle, and ReID features similarity information, where each metric is\ncalculated separately. With the design of our feature related distance\nfunction, it is possible to track objects through longer period of occlusions,\nwhile keeping the number of identity switches comparatively low. Extensive\nexperimental evaluation demonstrates notable improvement in tracking accuracy\nand reliability, as evidenced by reduced identity switches and enhanced\nocclusion handling. These advancements not only contribute to the state of the\nart in object tracking but also open new avenues for future research and\npractical applications demanding high precision and reliability.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"-s1Y79YGHtGov_mgSvXG2vMyEw6l8YXfCvguxZ7fnSk","pdfSize":"5709437"}