{"id":"2407.20086","title":"Segmenting Fetal Head with Efficient Fine-tuning Strategies in\n  Low-resource Settings: an empirical study with U-Net","authors":"Fangyijie Wang, Gu\\'enol\\'e Silvestre, Kathleen M. Curran","authorsParsed":[["Wang","Fangyijie",""],["Silvestre","Guénolé",""],["Curran","Kathleen M.",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 15:16:08 GMT"}],"updateDate":"2024-07-30","timestamp":1722266168000,"abstract":"  Accurate measurement of fetal head circumference is crucial for estimating\nfetal growth during routine prenatal screening. Prior to measurement, it is\nnecessary to accurately identify and segment the region of interest,\nspecifically the fetal head, in ultrasound images. Recent advancements in deep\nlearning techniques have shown significant progress in segmenting the fetal\nhead using encoder-decoder models. Among these models, U-Net has become a\nstandard approach for accurate segmentation. However, training an\nencoder-decoder model can be a time-consuming process that demands substantial\ncomputational resources. Moreover, fine-tuning these models is particularly\nchallenging when there is a limited amount of data available. There are still\nno \"best-practice\" guidelines for optimal fine-tuning of U-net for fetal\nultrasound image segmentation. This work summarizes existing fine-tuning\nstrategies with various backbone architectures, model components, and\nfine-tuning strategies across ultrasound data from Netherlands, Spain, Malawi,\nEgypt and Algeria. Our study shows that (1) fine-tuning U-Net leads to better\nperformance than training from scratch, (2) fine-tuning strategies in decoder\nare superior to other strategies, (3) network architecture with less number of\nparameters can achieve similar or better performance. We also demonstrate the\neffectiveness of fine-tuning strategies in low-resource settings and further\nexpand our experiments into few-shot learning. Lastly, we publicly released our\ncode and specific fine-tuned weights.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"4xEd6PQxSS5LJiEvpfwZku1xXgBrdP89iapkuR3AgSs","pdfSize":"2397313"}