{"id":"2407.12627","title":"Entropy-Stable Model Reduction of One-Dimensional Hyperbolic Systems\n  using Rational Quadratic Manifolds","authors":"Robin Klein, Benjamin Sanderse, Pedro Costa, Rene Pecnik, Ruud Henkes","authorsParsed":[["Klein","Robin",""],["Sanderse","Benjamin",""],["Costa","Pedro",""],["Pecnik","Rene",""],["Henkes","Ruud",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 14:55:15 GMT"}],"updateDate":"2024-07-18","timestamp":1721228115000,"abstract":"  In this work we propose a novel method to ensure important entropy\ninequalities are satisfied semi-discretely when constructing reduced order\nmodels (ROMs) on nonlinear reduced manifolds. We are in particular interested\nin ROMs of systems of nonlinear hyperbolic conservation laws. The so-called\nentropy stability property endows the semi-discrete ROMs with physically\nadmissible behaviour. The method generalizes earlier results on entropy-stable\nROMs constructed on linear spaces. The ROM works by evaluating the projected\nsystem on a well-chosen approximation of the state that ensures entropy\nstability. To ensure accuracy of the ROM after this approximation we locally\nenrich the tangent space of the reduced manifold with important quantities.\nUsing numerical experiments on some well-known equations (the inviscid Burgers\nequation, shallow water equations and compressible Euler equations) we show the\nimproved structure-preserving properties of our ROM compared to standard\napproaches and that our approximations have minimal impact on the accuracy of\nthe ROM. We additionally generalize the recently proposed polynomial reduced\nmanifolds to rational polynomial manifolds and show that this leads to an\nincrease in accuracy for our experiments.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis","Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"YtbkP2h5uGsTvCT7J9n_FRXd0Bn_l956B_SaTKOHWPM","pdfSize":"1175621"}