{"id":"2407.04982","title":"Microstructural and Micromechanical Evolution of Olivine Aggregates\n  During Transient Creep","authors":"Harison S. Wiesman, Thomas Breithaupt, David Wallis, Lars N. Hansen","authorsParsed":[["Wiesman","Harison S.",""],["Breithaupt","Thomas",""],["Wallis","David",""],["Hansen","Lars N.",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 07:21:53 GMT"}],"updateDate":"2024-07-09","timestamp":1720250513000,"abstract":"  To examine the microstructural evolution that occurs during transient creep,\nwe deformed olivine aggregates to different strains that spanned the initial\ntransient deformation. Two sets of samples with different initial grain sizes\nof 5 $\\mu$m and 20 $\\mu$m were deformed in torsion at T = 1523 K, P = 300 MPa,\nand a constant shear strain rate of 1.5 $\\times$ 10$^{-4}$ s$^{-1}$. Both sets\nof samples experienced strain hardening during deformation. We characterized\nthe microstructures at the end of each experiment using high-angular resolution\nelectron backscatter diffraction (HR-EBSD) and dislocation decoration. In the\ncoarse-grained samples, dislocation density increased from 1.5 $\\times$\n10$^{11}$ m$^{-2}$ to 3.6 $\\times$ 10$^{12}$ m$^{-2}$ with strain. Although the\nsame final dislocation density was reached in the fine-grained samples, it did\nnot vary significantly at small strains, potentially due to concurrent grain\ngrowth during deformation. In both sets of samples, HR-EBSD analysis revealed\nthat intragranular stress heterogeneity increased in magnitude with strain and\nthat elevated stresses are associated with regions of high geometrically\nnecessary dislocation density. Further analysis of the stresses and their\nprobability distributions indicate that the stresses are imparted by long-range\nelastic interactions among dislocations. These characteristics indicate that\ndislocation interactions were the primary cause of strain hardening during\ntransient creep. A comparison of the results to predictions from three recent\nmodels reveals that the models do not correctly predict the evolution in stress\nand dislocation density with strain for our experiments due to a lack of\nprevious such data in their calibrations.\n","subjects":["Condensed Matter/Materials Science","Physics/Geophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"59T_ABJYfHeSaNdNvh6xA95Robjg3a1pWt5rsddSyLE","pdfSize":"8251675"}