{"id":"2407.11109","title":"Additional Doppler Monitoring Corroborates HAT-P-11 c as a Planet","authors":"Samuel W. Yee, Erik A. Petigura, Howard Isaacson, Andrew W. Howard,\n  Sarah Blunt, Paul A. Dalba, Fei Dai, Benjamin J. Fulton, Steven Giacalone,\n  Stephen R. Kane, Molly Kosiarek, Teo Mocnik, Malena Rice, Ryan Rubenzahl,\n  Nicholas Saunders, Dakotah Tyler, Lauren M. Weiss, Jingwen Zhang","authorsParsed":[["Yee","Samuel W.",""],["Petigura","Erik A.",""],["Isaacson","Howard",""],["Howard","Andrew W.",""],["Blunt","Sarah",""],["Dalba","Paul A.",""],["Dai","Fei",""],["Fulton","Benjamin J.",""],["Giacalone","Steven",""],["Kane","Stephen R.",""],["Kosiarek","Molly",""],["Mocnik","Teo",""],["Rice","Malena",""],["Rubenzahl","Ryan",""],["Saunders","Nicholas",""],["Tyler","Dakotah",""],["Weiss","Lauren M.",""],["Zhang","Jingwen",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 16:45:43 GMT"}],"updateDate":"2024-07-17","timestamp":1721061943000,"abstract":"  In 2010, Bakos and collaborators discovered a Neptune-sized planet transiting\nthe K-dwarf HAT-P-11 every five days. Later in 2018, Yee and collaborators\nreported an additional Jovian-mass companion on a nine year orbit based on a\ndecade of Doppler monitoring. The eccentric outer giant HAT-P-11c may be\nresponsible for the peculiar polar orbit of the inner planet HAT-P-11b.\nHowever, Basilicata et al. (2024) recently suggested that the HAT-P-11c Doppler\nsignal could be caused by stellar activity. In this research note, we extend\nthe Yee et al. (2018) Doppler time series by six years. The combined dataset\nspanning 17 years covers nearly two orbits of the outer planet. Importantly, we\nobserve two periastron passages of planet c and do not observe a coherent\nactivity signature. Together with the previously reported astrometric\nacceleration of HAT-P-11 from Hipparcos and Gaia, we believe there is strong\nevidence for HAT-P-11c as a bona fide planet.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"3xcheNxvuHtkF73NszrZQPWyUUIfiuNJnxidkhHuOnI","pdfSize":"346150"}