{"id":"2407.20624","title":"Spatial verification of global precipitation forecasts","authors":"Gregor Skok and Lloren\\c{c} Lled\\'o","authorsParsed":[["Skok","Gregor",""],["Lledó","Llorenç",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 07:59:39 GMT"}],"updateDate":"2024-07-31","timestamp":1722326379000,"abstract":"  Spatial verification of global high-resolution weather forecasts remains a\nconsiderable challenge. Most existing spatial verification techniques either do\nnot properly account for the non-planar geometry of a global domain or their\ncomputation complexity becomes too large. We present an adaptation of the\nrecently developed Precipitation Attribution Distance (PAD) metric, designed\nfor verifying precipitation, enabling its use on the Earth's spherical\ngeometry. PAD estimates the magnitude of location errors in the forecasts and\nis related to the mathematical theory of Optimal Transport as it provides a\nclose upper bound for the Wasserstein distance. The method is fast and flexible\nwith time complexity $O(n \\log(n))$. Its behavior is analyzed using a set of\nidealized cases and 7 years of operational global high-resolution deterministic\n6-hourly precipitation forecasts from the Integrated Forecasting System (IFS)\nof the European Centre for Medium-Range Weather Forecasts. The summary results\nfor the whole period show how location errors in the IFS model grow steadily\nwith increasing lead time for all analyzed regions. Moreover, by examining the\ntime evolution of the results, we can determine the trends in the score's value\nand identify the regions where there is a statistically significant improvement\n(or worsening) of the forecast performance. The results can also be analyzed\nseparately for different intensities of precipitation. Overall, the PAD\nprovides meaningful results for estimating location errors in global\nhigh-resolution precipitation forecasts at an affordable computational cost.\n","subjects":["Physics/Atmospheric and Oceanic Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"QhfuR1Y1H24nyDR-pipAcT5graxWLpVcNYKNzbAthOM","pdfSize":"37223987","objectId":"0x10bf578ca1847254a5a9aae40308b9e1c79555e222209ba0ad6d0d67355464c9","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
