{"id":"2407.10400","title":"Assessment of Continuous-Time Transmission-Distribution-Interface Active\n  and Reactive Flexibility for Flexible Distribution Networks","authors":"Shuo Yang, Zhengshuo Li, Ye Tian","authorsParsed":[["Yang","Shuo",""],["Li","Zhengshuo",""],["Tian","Ye",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 02:39:59 GMT"}],"updateDate":"2024-07-16","timestamp":1721011199000,"abstract":"  With the widespread use of power electronic devices, modern distribution\nnetworks are turning into flexible distribution networks (FDNs), which have\nenhanced active and reactive power flexibility at the\ntransmission-distribution-interface (TDI). However, owing to the stochastics\nand volatility of distributed generation, the flexibility can change in real\ntime and can hardly be accurately captured using conventional discrete-time\n(DT) assessment methods. This paper first proposes the notion of\ncontinuous-time (CT) TDI active and reactive flexibility and establishes its\nmathematical model. This model comprehensively considers the flexible devices\nin the FDN and the impact of uncertainty of photovoltaic power generation and\nload. In particular, a novel direction-factor-based metric is proposed to model\nCT-TDI PQ flexibility. Moreover, an efficient solution method is designed to\naddress the difficulties in handling the infinite dimension of CT model and the\ncomplexity of bi-objectivity from assessing both active and reactive\nflexibility to be assessed. The solution successfully transforms the infinite\ndimensional optimization into a finite dimensional problem and effectively\nexplores the PQ plane in a parallel pattern. Case studies show that the method\ncan more effectively assess the real-time TDI flexibility of an FDN relative to\nconventional DT counterparts, and also reveals the impact of the relevant\nfactors, such as penetrations of flexible devices and levels of uncertainty.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"rehK9g1716oq6tqLQY7TtVqUJ04aD4DQPaNDtqfmetI","pdfSize":"1279814"}