{"id":"2407.10689","title":"Classification of Heart Sounds Using Multi-Branch Deep Convolutional\n  Network and LSTM-CNN","authors":"Seyed Amir Latifi, Hassan Ghassemian, Maryam Imani","authorsParsed":[["Latifi","Seyed Amir",""],["Ghassemian","Hassan",""],["Imani","Maryam",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 13:02:54 GMT"},{"version":"v2","created":"Mon, 2 Sep 2024 08:38:37 GMT"},{"version":"v3","created":"Sun, 8 Sep 2024 12:20:57 GMT"}],"updateDate":"2024-09-10","timestamp":1721048574000,"abstract":"  This paper presents a fast and cost-effective method for diagnosing cardiac\nabnormalities with high accuracy and reliability using low-cost systems in\nclinics. The primary limitation of automatic diagnosing of cardiac diseases is\nthe rarity of correct and acceptable labeled samples, which can be expensive to\nprepare. To address this issue, two methods are proposed in this work. The\nfirst method is a unique Multi-Branch Deep Convolutional Neural Network (MBDCN)\narchitecture inspired by human auditory processing, specifically designed to\noptimize feature extraction by employing various sizes of convolutional filters\nand audio signal power spectrum as input. In the second method, called as Long\nshort-term memory-Convolutional Neural (LSCN) model, Additionally, the network\narchitecture includes Long Short-Term Memory (LSTM) network blocks to improve\nfeature extraction in the time domain. The innovative approach of combining\nmultiple parallel branches consisting of the one-dimensional convolutional\nlayers along with LSTM blocks helps in achieving superior results in audio\nsignal processing tasks. The experimental results demonstrate superiority of\nthe proposed methods over the state-of-the-art techniques. The overall\nclassification accuracy of heart sounds with the LSCN network is more than 96%.\nThe efficiency of this network is significant compared to common feature\nextraction methods such as Mel Frequency Cepstral Coefficients (MFCC) and\nwavelet transform. Therefore, the proposed method shows promising results in\nthe automatic analysis of heart sounds and has potential applications in the\ndiagnosis and early detection of cardiovascular diseases.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Sound","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"0dqKlRE8Z7E0NZPMDsxK-m96OFN9xaG1dZL2ekeGtvg","pdfSize":"1112038"}