{"id":"2407.05505","title":"Dynamic Position Transformation and Boundary Refinement Network for Left\n  Atrial Segmentation","authors":"Fangqiang Xu, Wenxuan Tu, Fan Feng, Malitha Gunawardhana, Jiayuan\n  Yang, Yun Gu and Jichao Zhao","authorsParsed":[["Xu","Fangqiang",""],["Tu","Wenxuan",""],["Feng","Fan",""],["Gunawardhana","Malitha",""],["Yang","Jiayuan",""],["Gu","Yun",""],["Zhao","Jichao",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 22:09:35 GMT"}],"updateDate":"2024-07-09","timestamp":1720390175000,"abstract":"  Left atrial (LA) segmentation is a crucial technique for irregular heartbeat\n(i.e., atrial fibrillation) diagnosis. Most current methods for LA segmentation\nstrictly assume that the input data is acquired using object-oriented center\ncropping, while this assumption may not always hold in practice due to the high\ncost of manual object annotation. Random cropping is a straightforward data\npre-processing approach. However, it 1) introduces significant irregularities\nand incompleteness in the input data and 2) disrupts the coherence and\ncontinuity of object boundary regions. To tackle these issues, we propose a\nnovel Dynamic Position transformation and Boundary refinement Network (DPBNet).\nThe core idea is to dynamically adjust the relative position of irregular\ntargets to construct their contextual relationships and prioritize difficult\nboundary pixels to enhance foreground-background distinction. Specifically, we\ndesign a shuffle-then-reorder attention module to adjust the position of\ndisrupted objects in the latent space using dynamic generation ratios, such\nthat the vital dependencies among these random cropping targets could be well\ncaptured and preserved. Moreover, to improve the accuracy of boundary\nlocalization, we introduce a dual fine-grained boundary loss with\nscenario-adaptive weights to handle the ambiguity of the dual boundary at a\nfine-grained level, promoting the clarity and continuity of the obtained\nresults. Extensive experimental results on benchmark dataset have demonstrated\nthat DPBNet consistently outperforms existing state-of-the-art methods.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"wEBAw7wUib-lRnN31vium3rK0KP0vsbCZgQIpR0Wxr8","pdfSize":"2869591"}