{"id":"2407.03292","title":"Biomechanics-informed Non-rigid Medical Image Registration and its\n  Inverse Material Property Estimation with Linear and Nonlinear Elasticity","authors":"Zhe Min, Zachary M.C. Baum, Shaheer U. Saeed, Mark Emberton, Dean C.\n  Barratt, Zeike A. Taylor, Yipeng Hu","authorsParsed":[["Min","Zhe",""],["Baum","Zachary M. C.",""],["Saeed","Shaheer U.",""],["Emberton","Mark",""],["Barratt","Dean C.",""],["Taylor","Zeike A.",""],["Hu","Yipeng",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 17:26:07 GMT"},{"version":"v2","created":"Tue, 9 Jul 2024 13:05:32 GMT"}],"updateDate":"2024-07-10","timestamp":1720027567000,"abstract":"  This paper investigates both biomechanical-constrained non-rigid medical\nimage registrations and accurate identifications of material properties for\nsoft tissues, using physics-informed neural networks (PINNs). The complex\nnonlinear elasticity theory is leveraged to formally establish the partial\ndifferential equations (PDEs) representing physics laws of biomechanical\nconstraints that need to be satisfied, with which registration and\nidentification tasks are treated as forward (i.e., data-driven solutions of\nPDEs) and inverse (i.e., parameter estimation) problems under PINNs\nrespectively. Two net configurations (i.e., Cfg1 and Cfg2) have also been\ncompared for both linear and nonlinear physics model. Two sets of experiments\nhave been conducted, using pairs of undeformed and deformed MR images from\nclinical cases of prostate cancer biopsy.\n  Our contributions are summarised as follows. 1) We developed a learning-based\nbiomechanical-constrained non-rigid registration algorithm using PINNs, where\nlinear elasticity is generalised to the nonlinear version. 2) We demonstrated\nextensively that nonlinear elasticity shows no statistical significance against\nlinear models in computing point-wise displacement vectors but their respective\nbenefits may depend on specific patients, with finite-element (FE) computed\nground-truth. 3) We formulated and solved the inverse parameter estimation\nproblem, under the joint optimisation scheme of registration and parameter\nidentification using PINNs, whose solutions can be accurately found by locating\nsaddle points.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"gj0_mP8m_VAuPZ-Ke4f2SpccGObe4EADZTnBY_8Xndc","pdfSize":"2011126"}