{"id":"2407.18610","title":"Direct observation of quantum vortex fractionalization in multiband\n  superconductors","authors":"Yu Zheng, Quanxin Hu, Haijiao Ji, Igor Timoshuk, Hanxiang Xu, Yongwei\n  Li, Ye Gao, Xin Yu, Rui Wu, Xingye Lu, Vadim Grinenko, Egor Babaev, Noah F.\n  Q. Yuan, Baiqing Lv, Chi-Ming Yim, Hong Ding","authorsParsed":[["Zheng","Yu",""],["Hu","Quanxin",""],["Ji","Haijiao",""],["Timoshuk","Igor",""],["Xu","Hanxiang",""],["Li","Yongwei",""],["Gao","Ye",""],["Yu","Xin",""],["Wu","Rui",""],["Lu","Xingye",""],["Grinenko","Vadim",""],["Babaev","Egor",""],["Yuan","Noah F. Q.",""],["Lv","Baiqing",""],["Yim","Chi-Ming",""],["Ding","Hong",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 09:11:19 GMT"},{"version":"v2","created":"Mon, 29 Jul 2024 15:00:17 GMT"},{"version":"v3","created":"Wed, 28 Aug 2024 03:00:28 GMT"}],"updateDate":"2024-08-29","timestamp":1721985079000,"abstract":"  Magnetic field is expelled from a superconductor, unless it forms quantum\nvortices, consisting of a core singularity with current circulating around it.\nThe London quantization condition implies that there is one core singularity\nper quantum of magnetic flux in single-component superconductors, while in\nmultiband materials fractional vortices are possible. Here, we report the first\nobservation of quantum vortex core fractionalization on the potassium\nterminated surface of multiband superconductor KFe2As2 by scanning tunneling\nmicroscopy. We observe splitting of an integer-flux vortex into several\nfractional vortices, leading to disparity between numbers of flux quanta and\nvortex cores. Our findings demonstrate that fractionalized core singularities\nare possible in a multiband superconductor, opening avenue for new experimental\nplatforms with quasiparticles with fractional statistics.\n","subjects":["Condensed Matter/Superconductivity"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"LdrZzOvUfy7hAAm1AOxAuqF5ZREbZ8qOse4YAbULWD4","pdfSize":"17609265"}