{"id":"2407.11680","title":"Population synthesis of Thorne-\\.Zytkow objects: Rejuvenated donors and\n  unexplored progenitors in the common envelope formation channel","authors":"K. Nathaniel, A. Vigna-G\\'omez, A. Grichener, R. Farmer, M. Renzo, R.\n  W. Everson","authorsParsed":[["Nathaniel","K.",""],["Vigna-Gómez","A.",""],["Grichener","A.",""],["Farmer","R.",""],["Renzo","M.",""],["Everson","R. W.",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 12:59:35 GMT"}],"updateDate":"2024-07-17","timestamp":1721134775000,"abstract":"  Context. Common envelope evolution of a massive star and a neutron star\ncompanion has two possible outcomes: formation of a short-period binary (a\npotential gravitational wave source progenitor) or a merger of the massive star\nwith the neutron star. If the binary merges, a structure with a neutron star\ncore surrounded by a large diffuse envelope, a so-called Thorne-\\.Zytkow object\n(T\\.ZO), may form. The predicted appearance of this hypothetical class of star\nis very similar to red supergiants, making observational identification\ndifficult.\n  Aims. Our objective is to understand the properties of systems that are\npotential T\\.ZO progenitors, e.g., binary systems that enter a common envelope\nphase with a neutron star companion. We also aim to distinguish those that have\nbeen through a previous stable mass transfer phase, which can rejuvenate the\naccretor. We estimate the number of T\\.ZOs in the Milky Way and assess the\nimpact of uncertainties in their formation.\n  Methods. We use the rapid population synthesis code COMPAS at Solar\nmetallicity and with common envelope efficiency parameter set to unity to\ndetermine the population demographics of T\\.ZOs. We use one-dimensional\nevolutionary T\\.ZO models from the literature to determine a fit for T\\.ZO\nlifetime in order to estimate the current number of T\\.ZOs in the Galaxy as\nwell as to assess core disruption during the merger.\n  Results. We explore the progenitors in the Hertzsprung-Russell diagram,\ncalculate formation rates, and investigate kinematics of the progenitor stars.\nWe find that the vast majority ($\\approx 92\\%$) of T\\.ZO progenitors in our\npopulation have experienced mass transfer and become rejuvenated before their\nformation event. Using a constant star formation rate we estimate $\\approx\n2\\times 10 ^{-4}$ T\\.ZOs per $M_\\odot$ in our Galaxy, corresponding to $\\approx\n5\\pm 1$ T\\.ZOs in the Milky Way at present.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"OOmwrJgLwKmvZjFlK3YYdsMYl8ObyZFD2sS83uDFnfk","pdfSize":"1806361"}