{"id":"2407.02029","title":"Jetted Subgalactic-Size Radio Sources in Merging Galaxies -- A Jet\n  Redirection Scenario","authors":"C. Stanghellini, M. Orienti, C. Spingola, A. Zanichelli, D. Dallacasa,\n  P. Cassaro, C.P. O'Dea, S.A. Baum, M. P\\'erez-Torres","authorsParsed":[["Stanghellini","C.",""],["Orienti","M.",""],["Spingola","C.",""],["Zanichelli","A.",""],["Dallacasa","D.",""],["Cassaro","P.",""],["O'Dea","C. P.",""],["Baum","S. A.",""],["Pérez-Torres","M.",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 07:55:16 GMT"}],"updateDate":"2024-07-03","timestamp":1719906916000,"abstract":"  The long-standing question concerning Jetted Sub-Galactic Size (JSS) radio\nsources is whether they will evolve into large radio galaxies, die before\nescaping the host galaxy, or remain indefinitely confined to their compact\nsize. Our main goal is to propose a scenario that explains the relative number\nof JSS radio sources and their general properties. We studied the parsec-scale\nradio morphology of a complete sample of 21 objects using Very Long Baseline\nInterferometry (VLBI) observations at various frequencies and analyzed the\nmorphological characteristics of their optical hosts. Many of these radio\nsources exhibit radio morphologies consistent with transverse motions of their\nbright edges and are located in dynamically disturbed galaxies. VLBI images\nprovide evidence for large-angle, short-period precessing jets, and the orbital\nmotion of the radio-loud AGN in a dual or binary system. The majority of JSS\nradio sources are in systems in different stages of their merging evolution. We\npropose a scenario where the rapid jet redirection, through precession or\norbital motion, prevents the jet from penetrating the interstellar medium (ISM)\nsufficiently to escape the host galaxy. Most JSS radio sources remain compact\ndue to their occurrence in merging galaxies\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"G0sLIod2olQEovRP3S50m3xaX4fyAArIUcsARacvFx0","pdfSize":"4205221"}