{"id":"2407.16761","title":"Continued developments in X-ray speed reading: fast, low noise readout\n  for next-generation wide-field imagers","authors":"Sven Herrmann, Peter Orel, Tanmoy Chattopadhyay, Glenn Morris, Gregory\n  Prigozhin, Haley R. Stueber, Steven W. Allen, Marshall W. Bautz, Kevan\n  Donlon, Beverly LaMarr, Chris Leitz, Eric Miller, Abigail Pan, Artem\n  Poliszczuk, and Daniel R. Wilkins","authorsParsed":[["Herrmann","Sven",""],["Orel","Peter",""],["Chattopadhyay","Tanmoy",""],["Morris","Glenn",""],["Prigozhin","Gregory",""],["Stueber","Haley R.",""],["Allen","Steven W.",""],["Bautz","Marshall W.",""],["Donlon","Kevan",""],["LaMarr","Beverly",""],["Leitz","Chris",""],["Miller","Eric",""],["Pan","Abigail",""],["Poliszczuk","Artem",""],["Wilkins","Daniel R.",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 18:00:11 GMT"},{"version":"v2","created":"Tue, 30 Jul 2024 06:49:35 GMT"}],"updateDate":"2024-07-31","timestamp":1721757611000,"abstract":"  Future strategic X-ray astronomy missions will require unprecedentedly\nsensitive wide-field imagers providing high frame rates, low readout noise and\nexcellent soft energy response. To meet these needs, our team is employing a\nmulti-pronged approach to advance several key areas of technology. Our first\nfocus is on advanced readout electronics, specifically integrated electronics,\nwhere we are collaborating on the VERITAS readout chip for the Athena Wide\nField Imager, and have developed the Multi-Channel Readout Chip (MCRC), which\nenables fast readout and high frame rates for MIT-LL JFET (junction field\neffect transistor) CCDs. Second, we are contributing to novel detector\ndevelopment, specifically the SiSeRO (Single electron Sensitive Read Out)\ndevices fabricated at MIT Lincoln Laboratory, and their advanced readout, to\nachieve sub-electron noise performance. Hardware components set the stage for\nperformance, but their efficient utilization relies on software and algorithms\nfor signal and event processing. Our group is developing digital waveform\nfiltering and AI methods to augment detector performance, including enhanced\nparticle background screening and improved event characterization. All of these\nefforts make use of an efficient, new X-ray beamline facility at Stanford,\nwhere components and concepts can be tested and characterized.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"qp8IAtXOY27VMMKx88pndtVJGPpiLEe-F9_abpICY0U","pdfSize":"4322986"}