{"id":"2407.08625","title":"Histopathological Image Classification with Cell Morphology Aware Deep\n  Neural Networks","authors":"Andrey Ignatov, Josephine Yates, Valentina Boeva","authorsParsed":[["Ignatov","Andrey",""],["Yates","Josephine",""],["Boeva","Valentina",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 16:03:59 GMT"}],"updateDate":"2024-07-12","timestamp":1720713839000,"abstract":"  Histopathological images are widely used for the analysis of diseased (tumor)\ntissues and patient treatment selection. While the majority of microscopy image\nprocessing was previously done manually by pathologists, recent advances in\ncomputer vision allow for accurate recognition of lesion regions with deep\nlearning-based solutions. Such models, however, usually require extensive\nannotated datasets for training, which is often not the case in the considered\ntask, where the number of available patient data samples is very limited. To\ndeal with this problem, we propose a novel DeepCMorph model pre-trained to\nlearn cell morphology and identify a large number of different cancer types.\nThe model consists of two modules: the first one performs cell nuclei\nsegmentation and annotates each cell type, and is trained on a combination of 8\npublicly available datasets to ensure its high generalizability and robustness.\nThe second module combines the obtained segmentation map with the original\nmicroscopy image and is trained for the downstream task. We pre-trained this\nmodule on the Pan-Cancer TCGA dataset consisting of over 270K tissue patches\nextracted from 8736 diagnostic slides from 7175 patients. The proposed solution\nachieved a new state-of-the-art performance on the dataset under consideration,\ndetecting 32 cancer types with over 82% accuracy and outperforming all\npreviously proposed solutions by more than 4%. We demonstrate that the\nresulting pre-trained model can be easily fine-tuned on smaller microscopy\ndatasets, yielding superior results compared to the current top solutions and\nmodels initialized with ImageNet weights. The codes and pre-trained models\npresented in this paper are available at: https://github.com/aiff22/DeepCMorph\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition","Quantitative Biology/Quantitative Methods"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"iOPGx3qa0DZEd60ReI7EbK4o7EUCp6vv-ub72crntO0","pdfSize":"5006328"}