{"id":"2407.09343","title":"Thermodynamics of Giant Molecular Clouds: The Effects of Dust Grain Size","authors":"Nadine H. Soliman, Philip F. Hopkins, and Michael Y. Grudi\\'c","authorsParsed":[["Soliman","Nadine H.",""],["Hopkins","Philip F.",""],["Grudić","Michael Y.",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 15:18:03 GMT"}],"updateDate":"2024-07-15","timestamp":1720797483000,"abstract":"  The dust grain size distribution (GSD) likely varies significantly across\ndifferent star-forming environments in the Universe, but the overall impact of\nthis variation on star formation remains unclear. This ambiguity arises because\nthe GSD interacts non-linearly with processes like heating/cooling, radiation,\nand chemistry, which have competing effects and different environmental\ndependencies. In this study, we investigate the effects of GSD variation on the\nthermochemistry and evolution of giant molecular clouds (GMCs). To achieve\nthis, we conducted radiation-dust-magnetohydrodynamic simulations spanning a\nrange of cloud masses and grain sizes, which explicitly incorporate the\ndynamics of dust grains within the full-physics framework of the STARFORGE\nproject. We find that differences in grain size significantly alter the\nthermochemistry of GMCs. Specifically, we show that the leading-order effect is\nthat larger grains, under fixed dust mass and dust-to-gas ratio conditions,\nresult in lower dust opacities. This reduced opacity permits ISRF photons to\npenetrate more deeply and allows internal radiation field photons to permeate\nmore extensively into the cloud, resulting in rapid gas heating and the\ninhibition of star formation. We find that star formation efficiency is highly\nsensitive to grain size, with an order of magnitude reduction in efficiency\nwhen grain size increases from 0.1 $\\rm\\mu m$ to 10 $\\rm\\mu m$. Additionally,\nwe note that warmer gas suppresses the formation of low-mass stars. Moreover,\nas a consequence of the decreased opacities, we observe a greater proportion of\ngas residing in diffuse ionized structures.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"YSNdppWlHfUzjOOF622_S_2zgjo37FdS8GdjO0We5fo","pdfSize":"16356136"}