{"id":"2407.02186","title":"Data-Driven Probabilistic Methodology for Aircraft Conflict Detection\n  Under Wind Uncertainty","authors":"Jaime de la Mota, Mar\\'ia Cerezo-Maga\\~na, Alberto Olivares, and\n  Ernesto Staffetti","authorsParsed":[["de la Mota","Jaime",""],["Cerezo-Magaña","María",""],["Olivares","Alberto",""],["Staffetti","Ernesto",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 11:44:39 GMT"},{"version":"v2","created":"Tue, 16 Jul 2024 07:02:06 GMT"}],"updateDate":"2024-07-17","timestamp":1719920679000,"abstract":"  Assuming the availability of a reliable aircraft trajectory planner, this\npaper presents a probabilistic methodology to detect conflicts between\naircraft, in the cruise phase of the flight, in the presence of wind prediction\nuncertainties quantified by ensemble weather forecasts, which are regarded as\nrealizations of correlated random processes and employed to derive the eastward\nand northward components of the wind velocity. First, the Karhunen-Lo`eve\nexpansion is used to obtain a series expansion of the wind components in terms\nof a set of uncorrelated random variables and deterministic coefficients. Then,\nthe uncertainty induced by these uncorrelated random variables in the outputs\nof the aircraft trajectory planner is quantified by means of the arbitrary\npolynomial chaos technique. Finally, the probability density function of the\ngreat circle distance between each pair of aircraft is derived from the\npolynomial expansions using a Gaussian kernel density estimator and employed to\nestimate the probability of conflict. The arbitrary polynomial chaos technique\nallows the effects of uncertainties in complex nonlinear dynamical system, such\nas those underlying aircraft trajectory planners, to be quantified with high\ncomputational efficiency, only requiring the existence of a finite number of\nstatistical moments of the random variables of the Karhunen-Lo`eve expansion,\nwhile avoiding any assumption on their probability distributions. In order to\ndemonstrate the effectiveness of the proposed conflict detection method,\nnumerical experiments are conducted through an optimal control based aircraft\ntrajectory planner for a given wind forecast represented by an ensemble\nprediction system.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"3ue05pdsY-zdZ8gZ7NynFSQBejSitJ-V70xi97HIddY","pdfSize":"16170907","objectId":"0xf6b55b32560d37e9cfdaf86a702fdc4908848ad6de434974e72ad9c0f551e19d","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
