{"id":"2407.14599","title":"Pumping Iron: How turbulent metal diffusion impacts multiphase galactic\n  outflows","authors":"Ulrich P. Steinwandel, Douglas Rennehan, Matthew E. Orr, Drummond B.\n  Fielding, Chang-Goo Kim","authorsParsed":[["Steinwandel","Ulrich P.",""],["Rennehan","Douglas",""],["Orr","Matthew E.",""],["Fielding","Drummond B.",""],["Kim","Chang-Goo",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 18:00:05 GMT"}],"updateDate":"2024-07-23","timestamp":1721412005000,"abstract":"  Most numerical simulations of galaxy formation and evolution are unable to\nproperly resolve the turbulent cascade at or below the resolution scale and\nturbulence models are required to capture the motion of eddies on those\nunresolved scales. In this study, we investigate the impact of turbulent metal\ndiffusion models on multiphase outflows originating from dwarf galaxies\n($M_{\\rm halo} \\sim 10^{10} - 10^{11}$ M$_\\odot$). We use our state-of-the-art\nnumerical model for the formation of single stars and non-equilibrium cooling\nand hydrogen chemistry. Our simulations are carried out at a mass resolution of\n$\\sim$1 M$_{\\odot}$, where the individual supernova explosions are resolved in\nterms of hot-phase generation and momentum input. We find that mass, energy,\nand metal loading factors are only weakly affected by the inclusion of a metal\ndiffusion model. The metal enrichment factor at low altitude above the galactic\ndisk is higher by around 20 per cent when the metal diffusion model is\nincluded. Specifically, we find more efficient cooling in the cold interstellar\nmedium, as higher amounts of metals are kept in the cold dense phase. The most\nstriking effect of the metal diffusion model is that, without metal diffusion,\nthere is more rapid cooling in the hot phase and a reduced sound speed by a\nfactor of two. Specifically, we find that the hot phase is more metal enriched\nin the case without metal diffusion leading to more rapid (over) cooling of\nthat phase which is consistent with the higher sound speed we find in the runs\nwith metal diffusion.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"zXZ02gYB2kViU6hOZDZ-xIxC8DmoZn_O7zWHRQ8JKrk","pdfSize":"5591914"}