{"id":"2407.05981","title":"Towards Understanding the Bugs in Solidity Compiler","authors":"Haoyang Ma, Wuqi Zhang, Qingchao Shen, Yongqiang Tian, Junjie Chen,\n  Shing-Chi Cheung","authorsParsed":[["Ma","Haoyang",""],["Zhang","Wuqi",""],["Shen","Qingchao",""],["Tian","Yongqiang",""],["Chen","Junjie",""],["Cheung","Shing-Chi",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 14:22:50 GMT"},{"version":"v2","created":"Tue, 23 Jul 2024 05:47:18 GMT"},{"version":"v3","created":"Fri, 9 Aug 2024 04:12:46 GMT"}],"updateDate":"2024-08-12","timestamp":1720448570000,"abstract":"  Solidity compiler plays a key role in enabling the development of smart\ncontract applications on Ethereum by governing the syntax of a domain-specific\nlanguage called Solidity and performing compilation and optimization of\nSolidity code. The correctness of Solidity compiler is critical in fostering\ntransparency, efficiency, and trust in industries reliant on smart contracts.\nHowever, like other software systems, Solidity compiler is prone to bugs, which\nmay produce incorrect bytecodes on blockchain platforms, resulting in severe\nsecurity concerns. As a domain-specific compiler for smart contracts, Solidity\ncompiler differs from other compilers in many perspectives, posing unique\nchallenges to detect its bugs. To understand the bugs in Solidity compiler and\nbenefit future research, in this paper, we present the first systematic study\non 533 Solidity compiler bugs. We carefully examined their characteristics\n(including symptoms, root causes, and distribution), and their triggering test\ncases. Our study leads to seven bug-revealing takeaways for Solidity compiler.\nMoreover, to study the limitations of Solidity compiler fuzzers and bring our\nfindings into practical scenarios, we evaluate three Solidity compiler fuzzers\non our constructed benchmark. The results show that these fuzzers are\ninefficient in detecting Solidity compiler bugs. The inefficiency arises from\ntheir failure to consider the interesting bug-inducing features, bug-related\ncompilation flags, and test oracles\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"p6eFfJv8RUj1yOIj-0oDMiOfKsdwe5TeAhuVqmeQNOk","pdfSize":"1224011"}