{"id":"2407.20461","title":"Weakly Supervised Intracranial Hemorrhage Segmentation with YOLO and an\n  Uncertainty Rectified Segment Anything Model","authors":"Pascal Spiegler, Amirhossein Rasoulian, Yiming Xiao","authorsParsed":[["Spiegler","Pascal",""],["Rasoulian","Amirhossein",""],["Xiao","Yiming",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 23:40:13 GMT"},{"version":"v2","created":"Wed, 31 Jul 2024 07:00:31 GMT"},{"version":"v3","created":"Wed, 4 Sep 2024 03:17:22 GMT"}],"updateDate":"2024-09-05","timestamp":1722296413000,"abstract":"  Intracranial hemorrhage (ICH) is a life-threatening condition that requires\nrapid and accurate diagnosis to improve treatment outcomes and patient survival\nrates. Recent advancements in supervised deep learning have greatly improved\nthe analysis of medical images, but often rely on extensive datasets with\nhigh-quality annotations, which are costly, time-consuming, and require medical\nexpertise to prepare. To mitigate the need for large amounts of expert-prepared\nsegmentation data, we have developed a novel weakly supervised ICH segmentation\nmethod that utilizes the YOLO object detection model and an\nuncertainty-rectified Segment Anything Model (SAM). In addition, we have\nproposed a novel point prompt generator for this model to further improve\nsegmentation results with YOLO-predicted bounding box prompts. Our approach\nachieved a high accuracy of 0.933 and an AUC of 0.796 in ICH detection, along\nwith a mean Dice score of 0.629 for ICH segmentation, outperforming existing\nweakly supervised and popular supervised (UNet and Swin-UNETR) approaches.\nOverall, the proposed method provides a robust and accurate alternative to the\nmore commonly used supervised techniques for ICH quantification without\nrequiring refined segmentation ground truths during model training.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"HltwXRbRWK9CTmz7BUgYSUgxTpDg7LSq5RxnCpAuVAA","pdfSize":"7765388"}