{"id":"2407.16598","title":"A tale of three approaches: dynamical phase transitions for weakly bound\n  Brownian particles","authors":"Lucianno Defaveri, Eli Barkai, David A. Kessler","authorsParsed":[["Defaveri","Lucianno",""],["Barkai","Eli",""],["Kessler","David A.",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 16:00:17 GMT"}],"updateDate":"2024-07-24","timestamp":1721750417000,"abstract":"  We investigate a system of Brownian particles weakly bound by attractive\nparity-symmetric potentials that grow at large distances as $V(x) \\sim\n|x|^\\alpha$, with $0 < \\alpha < 1$. The probability density function $P(x,t)$\nat long times reaches the Boltzmann-Gibbs equilibrium state, with all moments\nfinite. However, the system's relaxation is not exponential, as is usual for a\nconfining system with a well-defined equilibrium, but instead follows a\nstretched exponential $e^{- \\mathrm{const} \\, t^\\nu}$ with exponent\n$\\nu=\\alpha/(2+\\alpha)$. This problem is studied from three perspectives.\nFirst, we propose a straightforward and general scaling rate-function solution\nfor $P(x,t)$. This rate-function, which is an important tool from large\ndeviation theory, also displays anomalous time scaling and a dynamical phase\ntransition. Second, through the eigenfunctions of the Fokker-Planck operator,\nwe obtain, using the WKB method, more complete solutions that reproduce the\nrate function approach. Finally, we show how the alternative path-integral\nformalism allows us to recover the same results, with the above rate-function\nbeing the solution of the classical Hamilton-Jacobi equation describing the\nmost probable path. Properties such as parity, the role of initial conditions,\nand the dynamical phase transition are thoroughly studied in all three\napproaches.\n","subjects":["Condensed Matter/Statistical Mechanics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"9vmnm8ciIKgqtknWsLGyhqwmWo-cOCUYvlOuWrpS3g0","pdfSize":"1246288","objectId":"0xafb68f09f41046f06762ba67c50c3efea99e562aac1bc3704689d0086134dfe0","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
