{"id":"2407.20238","title":"Impact of COVID-19 post lockdown on eating habits and lifestyle changes\n  among university students in Bangladesh: a web based cross sectional study","authors":"Faysal Ahmed Imran (1), Mst Eshita Khatun (2) ((1) Department of\n  Nursing, Tairunnessa Memorial Medical College and Hospital, Gazipur,\n  Bangladesh (2) Department of Computer Science and Engineering, Daffodil\n  International University, Dhaka, Bangladesh)","authorsParsed":[["Imran","Faysal Ahmed",""],["Khatun","Mst Eshita",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 03:08:32 GMT"}],"updateDate":"2024-07-31","timestamp":1721012912000,"abstract":"  Background:Since the confinement of the lockdown, universities transferred\ntheir teaching and learning activities in online as an all-out intention to\nprevent the transmission of the infection. This study aimed to determine the\nsignificant changes in food habits, physical activity, sleeping hours, shopping\nhabits, Internet use time and mental status of the students and investigate the\nassociations between variables. Methods:The study participants were 307\nUndergraduate students, between 18 and 25 years of age completed a structured\nquestionnaire from January 3, 2022 to February 13, 2022. The questionnaire\nincluded demographic information of the students, questionnaire of dietary\npattern, physical activity, sleep quality index, Shopping practice and Internet\nuse time.Chi-square tests were used to associate the baseline information with\nlifestyle changes in post lockdown. Results:The study reveals that 21.5% of\nrespondents gained weight, 23.8% lost their weight and 41.7% controlled their\nweight. Eating of homemade food decreased after lockdown 76.5% and eating of\nrestaurant food increased after lockdown 23.5%. A number of major meals 3-4\nmeals per day decreased after lockdown 61.9%. Physical exercise significantly\nincreased after lockdown (p=0.001). Sleeping hours per day significantly\ndecreased after lockdown (p=0.001), sleep quality was almost the same and\nenergy level increased more in post lockdown. Respondents felt mentally tired\nafter lockdown 60.9%. Respondents spending time on the Internet in chat rooms\nwas 88.3%. Conclusions: This study represents the significant impact on food\nhabits, mental health, and daily routine of students after lockdown, suggesting\nthat we should maintain a balanced diet, physical exercise to sleep quality and\nmental health.\n","subjects":["Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"vW5VOahiXhvFVO5-QdsrveqBMYG9RQzqGAVV5PMZziU","pdfSize":"371230"}