{"id":"2407.18744","title":"Environments of luminous low-frequency radio galaxies since cosmic noon:\n  jet-mode feedback dominates in groups","authors":"Grayson C. Petter, Ryan C. Hickox, Leah K. Morabito, David M.\n  Alexander","authorsParsed":[["Petter","Grayson C.",""],["Hickox","Ryan C.",""],["Morabito","Leah K.",""],["Alexander","David M.",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 13:56:55 GMT"}],"updateDate":"2024-07-29","timestamp":1722002215000,"abstract":"  Coupling between relativistic jets launched by accreting supermassive black\nholes and the surrounding gaseous media is a vital ingredient in galaxy\nevolution models. To constrain the environments in which this feedback takes\nplace over cosmic time, we study the host halo properties of luminous\nlow-frequency radio galaxies ($L_{150 \\ \\mathrm{MHz}} \\gtrsim$ 25.25 W/Hz)\nselected with the International LOFAR Telescope out to $z \\sim 2$ through\ntomographic clustering and cosmic microwave background lensing measurements. We\nfind that these systems occupy halos characteristic of galaxy groups ($M_h =\n10^{13} - 10^{14} h^{-1} M_{\\odot}$), evolving at a rate consistent with the\nmean growth rate of halos over the past $\\sim$10 Gyr. The coevolution of the\nclustering and the luminosity function reveals that the duty cycle of these\nsystems is of order $\\sim 10\\%$ but has been mildly increasing since $z\\sim 2$,\nwhile the duty cycle of quasars has been declining. We estimate the\ncharacteristic kinetic heating power injected by powerful jets per halo as a\nfunction of mass, and compare to the same quantity injected by quasar winds. We\nfind that powerful jet heating dominates over quasar winds in halos $M_h\n\\gtrsim 10^{13} h^{-1} M_{\\odot}$ at $z < 2$. These results conform to the\nparadigm of galaxy evolution in which mechanical jet power feedback is the\ndominant heating mechanism of the gas content of groups and clusters.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"syOwyK4njp-PqBU4uBO0I_IZxFpd1IdnC79BVDmMYZc","pdfSize":"1100707"}