{"id":"2407.03607","title":"Efficient Inverse Design of Plasmonic Patch Nanoantennas using Deep\n  Learning","authors":"Saeed Hemayat, Sina Moayed Baharlou, Alexander Sergienko, and\n  Abdoulaye Ndao","authorsParsed":[["Hemayat","Saeed",""],["Baharlou","Sina Moayed",""],["Sergienko","Alexander",""],["Ndao","Abdoulaye",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 03:35:25 GMT"}],"updateDate":"2024-07-08","timestamp":1720064125000,"abstract":"  Plasmonic nanoantennas with suitable far-field characteristics are of huge\ninterest for utilization in optical wireless links, inter-/intra-chip\ncommunications, LiDARs, and photonic integrated circuits due to their\nexceptional modal confinement. Despite its success in shaping robust antenna\ndesign theories in radio frequency and millimeter-wave regimes, conventional\ntransmission line theory finds its validity diminished in the optical\nfrequencies, leading to a noticeable void in a generalized theory for antenna\ndesign in the optical domain. By utilizing neural networks and through a\none-time training of the network, one can transform the plasmonic nanoantennas\ndesign into an automated, data-driven task. In this work, we have developed a\nmulti-head deep convolutional neural network serving as an efficient\ninverse-design framework for plasmonic patch nanoantennas. Our framework is\ndesigned with the main goal of determining the optimal geometries of\nnanoantennas to achieve the desired (inquired by the designer) S 11 and\nradiation pattern simultaneously. The proposed approach preserves the\none-to-many mappings, enabling us to generate diverse designs. In addition,\napart from the primary fabrication limitations that were considered while\ngenerating the dataset, further design and fabrication constraints can also be\napplied after the training process. In addition to possessing an exceptionally\nrapid surrogate solver capable of predicting S 11 and radiation patterns\nthroughout the entire design frequency spectrum, we are introducing what we\nbelieve to be the pioneering inverse design network.\n","subjects":["Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"yPSb1S_o_IFVKflwEuC1Xhiqay4FPQqlphgMsR5LXfU","pdfSize":"10066950"}
