{"id":"2407.10740","title":"TME-Box: Scalable In-Process Isolation through Intel TME-MK Memory\n  Encryption","authors":"Martin Unterguggenberger, Lukas Lamster, David Schrammel, Martin\n  Schwarzl, Stefan Mangard","authorsParsed":[["Unterguggenberger","Martin",""],["Lamster","Lukas",""],["Schrammel","David",""],["Schwarzl","Martin",""],["Mangard","Stefan",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 14:09:00 GMT"}],"updateDate":"2024-07-16","timestamp":1721052540000,"abstract":"  Efficient cloud computing relies on in-process isolation to optimize\nperformance by running workloads within a single process. Without heavy-weight\nprocess isolation, memory safety errors pose a significant security threat by\nallowing an adversary to extract or corrupt the private data of other\nco-located tenants. Existing in-process isolation mechanisms are not suitable\nfor modern cloud requirements, e.g., MPK's 16 protection domains are\ninsufficient to isolate thousands of cloud workers per process. Consequently,\ncloud service providers have a strong need for lightweight in-process isolation\non commodity x86 machines.\n  This paper presents TME-Box, a novel isolation technique that enables\nfine-grained and scalable sandboxing on commodity x86 CPUs. By repurposing\nIntel TME-MK, which is intended for the encryption of virtual machines, TME-Box\noffers lightweight and efficient in-process isolation. TME-Box enforces that\nsandboxes use their designated encryption keys for memory interactions through\ncompiler instrumentation. This cryptographic isolation enables fine-grained\naccess control, from single cache lines to full pages, and supports flexible\ndata relocation. In addition, the design of TME-Box allows the efficient\nisolation of up to 32K concurrent sandboxes. We present a performance-optimized\nTME-Box prototype, utilizing x86 segment-based addressing, that showcases\ngeomean performance overheads of 5.2 % for data isolation and 9.7 % for code\nand data isolation, evaluated with the SPEC CPU2017 benchmark suite.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ECJ10XTlPZkfqqoimqK5hTW3vGZ0c4ioSdcowG0KHlo","pdfSize":"331885"}