{"id":"2407.10479","title":"Unified Implementation of Relativistic Wave Function Methods: 4C-iCIPT2\n  as a Showcase","authors":"Ning Zhang and Wenjian Liu","authorsParsed":[["Zhang","Ning",""],["Liu","Wenjian",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 07:05:47 GMT"},{"version":"v2","created":"Thu, 25 Jul 2024 04:18:03 GMT"}],"updateDate":"2024-07-26","timestamp":1721027147000,"abstract":"  In parallel to the unified construction of relativistic Hamiltonians based\nsolely on physical arguments [J. Chem. Phys. 160, 084111 (2024)], a unified\nimplementation of relativistic wave function methods is achieved here via\nprogramming techniques (e.g., template metaprogramming and polymorphism in\nC++). That is, once the code for constructing the Hamiltonian matrix is made\nready, all the rest can be generated automatically from existing templates used\nfor the nonrelativistic counterparts. This is facilitated by breaking a\nsecond-quantized relativistic Hamiltonian down to diagrams that are\ntopologically the same as those required for computing the basic coupling\ncoefficients between spin-free configuration state functions (CSF). Moreover,\nboth time reversal and binary double point group symmetries can readily be\nincorporated into molecular integrals and Hamiltonian matrix elements. The\nlatter can first be evaluated in the space of (randomly selected)\nspin-dependent determinants and then transformed to that of spin-dependent\nCSFs, thanks to simple relations in between. As a showcase, we consider here\nthe no-pair four-component relativistic iterative configuration interaction\nwith selection and perturbation correction (4C-iCIPT2), which is a natural\nextension of the spin-free iCIPT2 [J. Chem. Theory Comput. 17, 949 (2021)], and\ncan provide near-exact numerical results within the manifold of positive energy\nstates (PES), as demonstrated by numerical examples.\n","subjects":["Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"x_C1c4k6AE5vADUfYcLdISQrEFnia2SS8liUi_kZSBQ","pdfSize":"889360"}