{"id":"2407.17126","title":"SDoH-GPT: Using Large Language Models to Extract Social Determinants of\n  Health (SDoH)","authors":"Bernardo Consoli, Xizhi Wu, Song Wang, Xinyu Zhao, Yanshan Wang,\n  Justin Rousseau, Tom Hartvigsen, Li Shen, Huanmei Wu, Yifan Peng, Qi Long,\n  Tianlong Chen, Ying Ding","authorsParsed":[["Consoli","Bernardo",""],["Wu","Xizhi",""],["Wang","Song",""],["Zhao","Xinyu",""],["Wang","Yanshan",""],["Rousseau","Justin",""],["Hartvigsen","Tom",""],["Shen","Li",""],["Wu","Huanmei",""],["Peng","Yifan",""],["Long","Qi",""],["Chen","Tianlong",""],["Ding","Ying",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 09:57:51 GMT"}],"updateDate":"2024-07-25","timestamp":1721815071000,"abstract":"  Extracting social determinants of health (SDoH) from unstructured medical\nnotes depends heavily on labor-intensive annotations, which are typically\ntask-specific, hampering reusability and limiting sharing. In this study we\nintroduced SDoH-GPT, a simple and effective few-shot Large Language Model (LLM)\nmethod leveraging contrastive examples and concise instructions to extract SDoH\nwithout relying on extensive medical annotations or costly human intervention.\nIt achieved tenfold and twentyfold reductions in time and cost respectively,\nand superior consistency with human annotators measured by Cohen's kappa of up\nto 0.92. The innovative combination of SDoH-GPT and XGBoost leverages the\nstrengths of both, ensuring high accuracy and computational efficiency while\nconsistently maintaining 0.90+ AUROC scores. Testing across three distinct\ndatasets has confirmed its robustness and accuracy. This study highlights the\npotential of leveraging LLMs to revolutionize medical note classification,\ndemonstrating their capability to achieve highly accurate classifications with\nsignificantly reduced time and cost.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"9K1BzreTdIpR3RDuT8F1tUSaZ3oNUMhOebFva5ec9rA","pdfSize":"1725508","objectId":"0x6f472ecdebcf35645191a5629e519d8b8b2ae1891780d33b941743b459050b26","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
