{"id":"2407.09911","title":"SensEmo: Enabling Affective Learning through Real-time Emotion\n  Recognition with Smartwatches","authors":"Kushan Choksi, Hongkai Chen, Karan Joshi, Sukrutha Jade, Shahriar\n  Nirjon, Shan Lin","authorsParsed":[["Choksi","Kushan",""],["Chen","Hongkai",""],["Joshi","Karan",""],["Jade","Sukrutha",""],["Nirjon","Shahriar",""],["Lin","Shan",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 15:10:58 GMT"}],"updateDate":"2024-07-16","timestamp":1720883458000,"abstract":"  Recent research has demonstrated the capability of physiological signals to\ninfer both user emotional and attention responses. This presents an opportunity\nfor leveraging widely available physiological sensors in smartwatches, to\ndetect real-time emotional cues in users, such as stress and excitement. In\nthis paper, we introduce SensEmo, a smartwatch-based system designed for\naffective learning. SensEmo utilizes multiple physiological sensor data,\nincluding heart rate and galvanic skin response, to recognize a student's\nmotivation and concentration levels during class. This recognition is\nfacilitated by a personalized emotion recognition model that predicts emotional\nstates based on degrees of valence and arousal. With real-time emotion and\nattention feedback from students, we design a Markov decision process-based\nalgorithm to enhance student learning effectiveness and experience by by\noffering suggestions to the teacher regarding teaching content and pacing. We\nevaluate SensEmo with 22 participants in real-world classroom environments.\nEvaluation results show that SensEmo recognizes student emotion with an average\nof 88.9% accuracy. More importantly, SensEmo assists students to achieve better\nonline learning outcomes, e.g., an average of 40.0% higher grades in quizzes,\nover the traditional learning without student emotional feedback.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"odAd3qZH_HznO9NfrEoMmeCVWxmfeffsUuSfMPaV6lk","pdfSize":"1301746","objectId":"0xc203c056f9f88c621ee38c50cb6ba84f4b1769f3faa3f72c4e05778e7f1f3168","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
