{"id":"2407.06741","title":"In-field phasing at the upgraded GMRT","authors":"Sanjay Kudale, Jayanta Roy, Jayaram N. Chengalur, Shyam Sharma,\n  Sangita Kumari","authorsParsed":[["Kudale","Sanjay",""],["Roy","Jayanta",""],["Chengalur","Jayaram N.",""],["Sharma","Shyam",""],["Kumari","Sangita",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 10:42:05 GMT"},{"version":"v2","created":"Wed, 10 Jul 2024 05:46:12 GMT"}],"updateDate":"2024-07-11","timestamp":1720521725000,"abstract":"  In time-domain radio astronomy with arrays, voltages from individual antennas\nare added together with proper delay and fringe correction to form the beam in\nreal-time. In order to achieve the correct phased addition of antenna voltages\none has to also correct for the ionospheric and instrumental gains.\nConventionally this is done using observations of a calibrator source located\nnear to the target field. This scheme is sub-optimal since it does not correct\nfor the variation of the gains with time and position in the sky. Further,\nsince the ionospheric phase variation is typically most rapid at the longest\nbaselines, the most distant antennas are often excluded while forming the beam.\nWe present here a different methodology (\"in-field phasing\"), in which the\ngains are obtained in real-time using a model of the intensity distribution in\nthe target field, which overcomes all of these drawbacks. We present\nobservations with the upgraded Giant Metrewave Radio Telescope (uGMRT) which\ndemonstrates that in-field phasing does lead to a significant improvement in\nsensitivity. We also show, using observations of the millisecond pulsar\nJ1120$-$3618 that this in turn leads to a significant improvement of\nmeasurements of the Dispersion Measure and Time of Arrival. Finally, we present\ntest observations of the GMRT discovered eclipsing black widow pulsar\nJ1544+4937 showing that in-field phasing leads to improvement in the\nmeasurement of the cut-off frequency of the eclipse.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ykOxpHFQITxeLJwYdJw6q6H3HXoBWhVhETq_dA41uug","pdfSize":"339309"}