{"id":"2407.04707","title":"BushraDBR: An Automatic Approach to Retrieving Duplicate Bug Reports","authors":"Ra'Fat Al-Msie'deen","authorsParsed":[["Al-Msie'deen","Ra'Fat",""]],"versions":[{"version":"v1","created":"Sat, 4 May 2024 11:22:35 GMT"}],"updateDate":"2024-07-09","timestamp":1714821755000,"abstract":"  A Bug Tracking System (BTS), such as Bugzilla, is generally utilized to track\nsubmitted Bug Reports (BRs) for a particular software system. Duplicate Bug\nReport (DBR) retrieval is the process of obtaining a DBR in the BTS. This\nprocess is important to avoid needless work from engineers on DBRs. To prevent\nwasting engineer resources, such as effort and time, on previously submitted\n(or duplicate) BRs, it is essential to find and retrieve DBRs as soon as they\nare submitted by software users. Thus, this paper proposes an automatic\napproach (called BushraDBR) that aims to assist an engineer (called a triager)\nto retrieve DBRs and stop the duplicates before they start. Where BushraDBR\nstands for Bushra Duplicate Bug Reports retrieval process. Therefore, when a\nnew BR is sent to the Bug Repository (BRE), an engineer checks whether it is a\nduplicate of an existing BR in BRE or not via BushraDBR approach. If it is, the\nengineer marks it as DBR, and the BR is excluded from consideration for any\nadditional work; otherwise, the BR is added to the BRE. BushraDBR approach\nrelies on Textual Similarity (TS) between the newly submitted BR and the rest\nof the BRs in BRE to retrieve DBRs. BushraDBR exploits unstructured data from\nBRs to apply Information Retrieval (IR) methods in an efficient way. BushraDBR\napproach uses two techniques to retrieve DBRs: Latent Semantic Indexing (LSI)\nand Formal Concept Analysis (FCA). The originality of BushraDBR is to stop DBRs\nbefore they occur by comparing the newly reported BR with the rest of the BRs\nin the BTS, thus saving time and effort during the Software Maintenance (SM)\nprocess. BushraDBR also uniquely retrieves DBR through the use of LSI and FCA\ntechniques. BushraDBR approach had been validated and evaluated on several\npublicly available data sets from Bugzilla. Experiments show the ability of\nBushraDBR approach to retrieve DBRs in an efficient manner.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"lx_dBV9k9_f7dPCbGr7QKyGBYgcZRfqiM2Ep-kZxnBc","pdfSize":"1706293"}
