{"id":"2407.02233","title":"Synthetic Multimodal Question Generation","authors":"Ian Wu, Sravan Jayanthi, Vijay Viswanathan, Simon Rosenberg, Sina\n  Pakazad, Tongshuang Wu, Graham Neubig","authorsParsed":[["Wu","Ian",""],["Jayanthi","Sravan",""],["Viswanathan","Vijay",""],["Rosenberg","Simon",""],["Pakazad","Sina",""],["Wu","Tongshuang",""],["Neubig","Graham",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 12:57:42 GMT"}],"updateDate":"2024-07-03","timestamp":1719925062000,"abstract":"  Multimodal Retrieval Augmented Generation (MMRAG) is a powerful approach to\nquestion-answering over multimodal documents. A key challenge with evaluating\nMMRAG is the paucity of high-quality datasets matching the question styles and\nmodalities of interest. In light of this, we propose SMMQG, a synthetic data\ngeneration framework. SMMQG leverages interplay between a retriever, large\nlanguage model (LLM) and large multimodal model (LMM) to generate question and\nanswer pairs directly from multimodal documents, with the questions conforming\nto specified styles and modalities. We use SMMQG to generate an MMRAG dataset\nof 1024 questions over Wikipedia documents and evaluate state-of-the-art models\nusing it, revealing insights into model performance that are attainable only\nthrough style- and modality-specific evaluation data. Next, we measure the\nquality of data produced by SMMQG via a human study. We find that the quality\nof our synthetic data is on par with the quality of the crowdsourced benchmark\nMMQA and that downstream evaluation results using both datasets strongly\nconcur.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"IqTgz8yUh7Dx7ale978srpJyRVhtj4psxswMdX3wODw","pdfSize":"5916844","objectId":"0xc2b842cca2caf1f3fa03dd0da9160b13cddf52d320d5bdb7b5438b9b95d4b108","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
