{"id":"2407.07415","title":"On examining the predictive capabilities of two variants of PINN in\n  validating localised wave solutions in the generalized nonlinear\n  Schr\\\"{o}dinger equation","authors":"Thulasidharan K., Sinthuja N., Vishnu Priya N. and Senthilvelan M","authorsParsed":[["K.","Thulasidharan",""],["N.","Sinthuja",""],["N.","Vishnu Priya",""],["M","Senthilvelan",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 07:16:36 GMT"}],"updateDate":"2024-07-11","timestamp":1720595796000,"abstract":"  We introduce a novel neural network structure called Strongly Constrained\nTheory-Guided Neural Network (SCTgNN), to investigate the behaviours of the\nlocalized solutions of the generalized nonlinear Schr\\\"{o}dinger (NLS)\nequation. This equation comprises four physically significant nonlinear\nevolution equations, namely, (i) NLS equation, Hirota equation\nLakshmanan-Porsezian-Daniel (LPD) equation and fifth-order NLS equation. The\ngeneralized NLS equation demonstrates nonlinear effects up to quintic order,\nindicating rich and complex dynamics in various fields of physics. By combining\nconcepts from the Physics-Informed Neural Network (PINN) and Theory-Guided\nNeural Network (TgNN) models, SCTgNN aims to enhance our understanding of\ncomplex phenomena, particularly within nonlinear systems that defy conventional\npatterns. To begin, we employ the TgNN method to predict the behaviours of\nlocalized waves, including solitons, rogue waves, and breathers, within the\ngeneralized NLS equation. We then use SCTgNN to predict the aforementioned\nlocalized solutions and calculate the mean square errors in both SCTgNN and\nTgNN in predicting these three localized solutions. Our findings reveal that\nboth models excel in understanding complex behaviours and provide predictions\nacross a wide variety of situations.\n","subjects":["Nonlinear Sciences/Pattern Formation and Solitons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"iUgmcGb0GWYSNt290hmPOPHZVcq_fHMwyCrro68Gic8","pdfSize":"10127272"}