{"id":"2407.01887","title":"Beyond Numeric Awards: In-Context Dueling Bandits with LLM Agents","authors":"Fanzeng Xia, Hao Liu, Yisong Yue, Tongxin Li","authorsParsed":[["Xia","Fanzeng",""],["Liu","Hao",""],["Yue","Yisong",""],["Li","Tongxin",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 02:18:14 GMT"}],"updateDate":"2024-07-03","timestamp":1719886694000,"abstract":"  In-context decision-making is an important capability of artificial general\nintelligence, which Large Language Models (LLMs) have effectively demonstrated\nin various scenarios. However, LLMs often face challenges when dealing with\nnumerical contexts, and limited attention has been paid to evaluating their\nperformance through preference feedback generated by the environment. This\npaper investigates the performance of LLMs as decision-makers in the context of\nDueling Bandits (DB). We first evaluate the performance of LLMs by comparing\nGPT-3.5-Turbo, GPT-4, and GPT-4-Turbo against established DB algorithms. Our\nresults reveal that LLMs, particularly GPT-4 Turbo, quickly identify the\nCondorcet winner, thus outperforming existing state-of-the-art algorithms in\nterms of weak regret. Nevertheless, LLMs struggle to converge even when\nexplicitly prompted to do so, and are sensitive to prompt variations. To\novercome these issues, we introduce an LLM-augmented algorithm, IF-Enhanced\nLLM, which takes advantage of both in-context decision-making capabilities of\nLLMs and theoretical guarantees inherited from classic DB algorithms. The\ndesign of such an algorithm sheds light on how to enhance trustworthiness for\nLLMs used in decision-making tasks where performance robustness matters. We\nshow that IF-Enhanced LLM has theoretical guarantees on both weak and strong\nregret. Our experimental results validate that IF-Enhanced LLM is robust even\nwith noisy and adversarial prompts.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"E8sI596e0A1mZDGmzdAor_2u_Qj9BJVWAiY78eijLv4","pdfSize":"4559123","objectId":"0x5f846f342b700a860a8ff55d1a665ff79cac09add86731371da89f3b88db299f","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
