{"id":"2407.03720","title":"Query-oriented Data Augmentation for Session Search","authors":"Haonan Chen, Zhicheng Dou, Yutao Zhu, Ji-Rong Wen","authorsParsed":[["Chen","Haonan",""],["Dou","Zhicheng",""],["Zhu","Yutao",""],["Wen","Ji-Rong",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 08:08:33 GMT"}],"updateDate":"2024-07-08","timestamp":1720080513000,"abstract":"  Modeling contextual information in a search session has drawn more and more\nattention when understanding complex user intents. Recent methods are all\ndata-driven, i.e., they train different models on large-scale search log data\nto identify the relevance between search contexts and candidate documents. The\ncommon training paradigm is to pair the search context with different candidate\ndocuments and train the model to rank the clicked documents higher than the\nunclicked ones. However, this paradigm neglects the symmetric nature of the\nrelevance between the session context and document, i.e., the clicked documents\ncan also be paired with different search contexts when training. In this work,\nwe propose query-oriented data augmentation to enrich search logs and empower\nthe modeling. We generate supplemental training pairs by altering the most\nimportant part of a search context, i.e., the current query, and train our\nmodel to rank the generated sequence along with the original sequence. This\napproach enables models to learn that the relevance of a document may vary as\nthe session context changes, leading to a better understanding of users' search\npatterns. We develop several strategies to alter the current query, resulting\nin new training data with varying degrees of difficulty. Through\nexperimentation on two extensive public search logs, we have successfully\ndemonstrated the effectiveness of our model.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"To5Ro2RefZecRYkfG3zbWHphQl1UwCmxUIY8XfpCtwo","pdfSize":"2572054"}