{"id":"2407.11589","title":"Improve Variational Quantum Eigensolver by Many-Body Localization","authors":"Li Xin and Zhang-qi Yin","authorsParsed":[["Xin","Li",""],["Yin","Zhang-qi",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 10:49:40 GMT"},{"version":"v2","created":"Thu, 5 Sep 2024 12:15:25 GMT"}],"updateDate":"2024-09-06","timestamp":1721126980000,"abstract":"  Variational quantum algorithms have been widely demonstrated in both\nexperimental and theoretical contexts to have extensive applications in quantum\nsimulation, optimization, and machine learning. However, the exponential growth\nin the dimension of the Hilbert space results in the phenomenon of vanishing\nparameter gradients in the circuit as the number of qubits and circuit depth\nincrease, known as the barren plateau phenomena. In recent years, research in\nnon-equilibrium statistical physics has led to the discovery of the realization\nof many-body localization. As a type of floquet system, many-body localized\nfloquet system has phase avoiding thermalization with an extensive parameter\nspace coverage and have been experimentally demonstrated can produce time\ncrystals. We applied this circuit to the variational quantum algorithms for the\ncalculation of many-body ground states and studied the variance of gradient for\nparameter updates under this circuit. We found that this circuit structure can\neffectively avoid barren plateaus. We also analyzed the entropy growth,\ninformation scrambling, and optimizer dynamics of this circuit. Leveraging this\ncharacteristic, we designed a new type of variational ansatz, called the\n'many-body localization ansatz'. We applied it to solve quantum many-body\nground states and examined its circuit properties. Our numerical results show\nthat our ansatz significantly improved the variational quantum algorithm.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"WLAb3TmCxG9NyLLyqpU7rlpOLULED5LV72_WM9fJEok","pdfSize":"1407377","objectId":"0x418ca407825948b0d0787e5f52d410fd29b555dea09dde52ca6044eb8240a317","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
