{"id":"2407.12949","title":"Effects of Proton Irradiation on the Performance of Skipper CCDs","authors":"Brandon Roach (1), Brenda A. Cervantes Vergara (2), Santiago Perez (2,\n  4 and 5), Alex Drlica-Wagner (1, 2 and 3), Juan Estrada (2), and Abhishek\n  Bakshi (2) ((1) Kavli Institute for Cosmological Physics, University of\n  Chicago, Chicago, IL, USA, (2) Fermi National Accelerator Laboratory,\n  Batavia, IL, USA, (3) Department of Astronomy and Astrophysics, University of\n  Chicago, Chicago, IL, USA, (4) Facultad de Ciencias Exactas y Naturales,\n  Departamento de Fisica, Universidad de Buenos Aires, Buenos Aires, Argentina,\n  (5) CONICET - Universidad de Buenos Aires, Instituto de Fisica de Buenos\n  Aires (IFIBA), Buenos Aires, Argentina)","authorsParsed":[["Roach","Brandon","","2,\n  4 and 5"],["Vergara","Brenda A. Cervantes","","2,\n  4 and 5"],["Perez","Santiago","","2,\n  4 and 5"],["Drlica-Wagner","Alex","","1, 2 and 3"],["Estrada","Juan",""],["Bakshi","Abhishek",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 18:32:31 GMT"}],"updateDate":"2024-07-19","timestamp":1721241151000,"abstract":"  Skipper CCDs are a mature detector technology that has been suggested for\nfuture space telescope instruments requiring sub-electron readout noise in the\nnear-ultraviolet to the near-infrared. While modern skipper CCDs inherit from\nthe radiation-tolerant p-channel detectors developed by LBNL, the effects of\nhigh doses of ionizing radiation on skipper CCDs (such as those expected in\nspace) remains largely unmeasured. We report preliminary results on the\nperformance of p-channel skipper CCDs following irradiation with 217-MeV\nprotons at the Northwestern Medicine Proton Center. The total nonionizing\nenergy loss (NIEL) experienced by the detectors exceeds 6 years at the\nSun-Earth Lagrange Point 2 (L2). We demonstrate that the skipper amplifier\ncontinues to function as expected following this irradiation. Owing to the low\nreadout noise of these detectors, controlled irradiation tests can be used to\nsensitively characterize the charge transfer inefficiency, dark current, and\nthe density and time constants of charge traps as a function of proton fluence.\nWe conclude with a brief outlook toward future tests of these detectors at\nother proton and gamma-ray facilities.\n","subjects":["Physics/Instrumentation and Detectors"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Iz9tABLk28dAYEF-xtbMgJiJkKB54kvNSaXWG06nAac","pdfSize":"7473922"}