{"id":"2407.18268","title":"Spatial analysis of tails of air pollution PDFs in Europe","authors":"Hankun He, Benjamin Sch\\\"afer and Christian Beck","authorsParsed":[["He","Hankun",""],["Schäfer","Benjamin",""],["Beck","Christian",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 22:17:05 GMT"}],"updateDate":"2024-07-29","timestamp":1721254625000,"abstract":"  Outdoor air pollution is estimated to cause a huge number of premature deaths\nworldwide, it catalyses many diseases on a variety of time scales, and it has a\ndetrimental effect on the environment. In light of these impacts it is\nnecessary to obtain a better understanding of the dynamics and statistics of\nmeasured air pollution concentrations, including temporal fluctuations of\nobserved concentrations and spatial heterogeneities. Here we present an\nextensive analysis for measured data from Europe. The observed probability\ndensity functions (PDFs) of air pollution concentrations depend very much on\nthe spatial location and on the pollutant substance. We analyse a large number\nof time series data from 3544 different European monitoring sites and show that\nthe PDFs of nitric oxide ($NO$), nitrogen dioxide ($NO_{2}$) and particulate\nmatter ($PM_{10}$ and $PM_{2.5}$) concentrations generically exhibit heavy\ntails. These are asymptotically well approximated by $q$-exponential\ndistributions with a given entropic index $q$ and width parameter $\\lambda$. We\nobserve that the power-law parameter $q$ and the width parameter $\\lambda$ vary\nwidely for the different spatial locations. We present the results of our data\nanalysis in the form of a map that shows which parameters $q$ and $\\lambda$ are\nmost relevant in a given region. A variety of interesting spatial patterns is\nobserved that correlate to properties of the geographical region. We also\npresent results on typical time scales associated with the dynamical behaviour.\n","subjects":["Physics/Atmospheric and Oceanic Physics","Mathematics/Dynamical Systems","Statistics/Applications"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"TRrw5GnhrG-awZnTNwZWtC6E8TkgTMyuzk1cMeSY1o0","pdfSize":"2721885"}