{"id":"2407.04953","title":"Effective-LDAM: An Effective Loss Function To Mitigate Data Imbalance\n  for Robust Chest X-Ray Disease Classification","authors":"Sree Rama Vamsidhar S, Bhargava Satya, and Rama Krishna Gorthi","authorsParsed":[["S","Sree Rama Vamsidhar",""],["Satya","Bhargava",""],["Gorthi","Rama Krishna",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 04:24:07 GMT"}],"updateDate":"2024-07-09","timestamp":1720239847000,"abstract":"  Deep Learning (DL) approaches have gained prominence in medical imaging for\ndisease diagnosis. Chest X-ray (CXR) classification has emerged as an effective\nmethod for detecting various diseases. Among these methodologies, Chest X-ray\n(CXR) classification has proven to be an effective approach for detecting and\nanalyzing various diseases. However, the reliable performance of DL\nclassification algorithms is dependent upon access to large and balanced\ndatasets, which pose challenges in medical imaging due to the impracticality of\nacquiring sufficient data for every disease category. To tackle this problem,\nwe propose an algorithmic-centric approach called Effective-Label Distribution\nAware Margin (E-LDAM), which modifies the margin of the widely adopted Label\nDistribution Aware Margin (LDAM) loss function using an effective number of\nsamples in each class. Experimental evaluations on the COVIDx CXR dataset focus\non Normal, Pneumonia, and COVID-19 classification. The experimental results\ndemonstrate the effectiveness of the proposed E-LDAM approach, achieving a\nremarkable recall score of 97.81% for the minority class (COVID-19) in CXR\nimage prediction. Furthermore, the overall accuracy of the three-class\nclassification task attains an impressive level of 95.26%.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"OjEXIedtAIFqGeLDywdf1oQkGgtW-cB-Zkqc2dP6Q2o","pdfSize":"376842"}