{"id":"2407.06733","title":"Causes and Electoral Consequences of Political Assassinations: The Role\n  of Organized Crime in Mexico","authors":"Roxana Guti\\'errez-Romero and Nayely Iturbe","authorsParsed":[["Gutiérrez-Romero","Roxana",""],["Iturbe","Nayely",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 10:21:07 GMT"}],"updateDate":"2024-07-10","timestamp":1720520467000,"abstract":"  Mexico has experienced a notable surge in assassinations of political\ncandidates and mayors. This article argues that these killings are largely\ndriven by organized crime, aiming to influence candidate selection, control\nlocal governments for rent-seeking, and retaliate against government\ncrackdowns. Using a new dataset of political assassinations in Mexico from 2000\nto 2021 and instrumental variables, we address endogeneity concerns in the\nlocation and timing of government crackdowns. Our instruments include\nhistorical Chinese immigration patterns linked to opium cultivation in Mexico,\nlocal corn prices, and U.S. illicit drug prices. The findings reveal that\ncandidates in municipalities near oil pipelines face an increased risk of\nassassination due to drug trafficking organizations expanding into oil theft,\nparticularly during elections and fuel price hikes. Government arrests or\nkillings of organized crime members trigger retaliatory violence, further\nendangering incumbent mayors. This political violence has a negligible impact\non voter turnout, as it targets politicians rather than voters. However, voter\nturnout increases in areas where authorities disrupt drug smuggling, raising\nthe chances of the local party being re-elected. These results offer new\ninsights into how criminal groups attempt to capture local governments and the\nimplications for democracy under criminal governance.\n","subjects":["Economics/Econometrics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"dxrIIpYwdkUQoPnzpsyxmNk1gUlSnwmJKbEe9C0BSzk","pdfSize":"910260"}
