{"id":"2407.21035","title":"Direct Unlearning Optimization for Robust and Safe Text-to-Image Models","authors":"Yong-Hyun Park, Sangdoo Yun, Jin-Hwa Kim, Junho Kim, Geonhui Jang,\n  Yonghyun Jeong, Junghyo Jo, Gayoung Lee","authorsParsed":[["Park","Yong-Hyun",""],["Yun","Sangdoo",""],["Kim","Jin-Hwa",""],["Kim","Junho",""],["Jang","Geonhui",""],["Jeong","Yonghyun",""],["Jo","Junghyo",""],["Lee","Gayoung",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 08:19:11 GMT"}],"updateDate":"2024-08-01","timestamp":1721204351000,"abstract":"  Recent advancements in text-to-image (T2I) models have greatly benefited from\nlarge-scale datasets, but they also pose significant risks due to the potential\ngeneration of unsafe content. To mitigate this issue, researchers have\ndeveloped unlearning techniques to remove the model's ability to generate\npotentially harmful content. However, these methods are easily bypassed by\nadversarial attacks, making them unreliable for ensuring the safety of\ngenerated images. In this paper, we propose Direct Unlearning Optimization\n(DUO), a novel framework for removing Not Safe For Work (NSFW) content from T2I\nmodels while preserving their performance on unrelated topics. DUO employs a\npreference optimization approach using curated paired image data, ensuring that\nthe model learns to remove unsafe visual concepts while retaining unrelated\nfeatures. Furthermore, we introduce an output-preserving regularization term to\nmaintain the model's generative capabilities on safe content. Extensive\nexperiments demonstrate that DUO can robustly defend against various\nstate-of-the-art red teaming methods without significant performance\ndegradation on unrelated topics, as measured by FID and CLIP scores. Our work\ncontributes to the development of safer and more reliable T2I models, paving\nthe way for their responsible deployment in both closed-source and open-source\nscenarios.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"80pa-NQ0jKVYMPnQ_zTw1sBSFvHL6apXsl3YzozSuJE","pdfSize":"5054486"}