{"id":"2407.19973","title":"Spontaneous spin superconductor state in ABCA-stacked tetralayer\n  graphene","authors":"Shuai Li, Yuan-Hang Ren, Ao-Long Li, Hua Jiang","authorsParsed":[["Li","Shuai",""],["Ren","Yuan-Hang",""],["Li","Ao-Long",""],["Jiang","Hua",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 13:06:12 GMT"}],"updateDate":"2024-07-30","timestamp":1722258372000,"abstract":"  We theoretically demonstrate a spontaneous spin superconductor (SC) state in\nABCA-stacked tetralayer graphene, under sequential effects of electron-electron\n(e-e) and electron-hole (e-h) interactions. First of all, we examine the\nferromagnetic (FM) exchange instability and phase diagram of the system induced\nby the long-range e-e interaction. At non- or low-doping levels, the\ninteraction trends to stabilize a FM phase with the coexisting electron and\nhole carriers. Superior to bilayer and trilayer systems, tetralayer graphene\nhas a larger FM phase region and spin splitting, making it more advantageous to\nrealize the spin SC state. Subsequently, we prove that the FM phase becomes\nunstable when attractive e-h interaction is considered. As a consequence, the\nspin SC state can be spontaneously formed at low temperature, where\nspin-triplet exciton pairs act as the equivalent of Cooper pairs. We further\ndevelop a consistent BCS-type theory for the spin SC state in ABCA-stacked\ngraphene. The predicted spin superconducting gap can reach about $7.0$ meV,\nwith a critical temperature of about 45 K for non-doping system. At last, we\ndemonstrated a spin-current Josephson effect in the ABCA-stacked graphene spin\nSC heterojunction. Our findings enrich the prospective spin SC candidate\nmaterials, illuminating more possibilities for achieving non-dissipative\nsuper-spintronics.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"WFvtEhERvP5bWUVhl9QgZozT-d7NoOp0Ko_3alMb0gg","pdfSize":"1594526"}