{"id":"2407.16253","title":"Unique magnetic structure of the vdW antiferromagnet VBr$_3$","authors":"Milan Klicpera, Ondrej Michal, David Hovancik, Karel Carva, Oscar\n  Ramon Fabelo Rosa, M. Orlita, Vladimir Sechovsky, and Jiri Pospisil","authorsParsed":[["Klicpera","Milan",""],["Michal","Ondrej",""],["Hovancik","David",""],["Carva","Karel",""],["Rosa","Oscar Ramon Fabelo",""],["Orlita","M.",""],["Sechovsky","Vladimir",""],["Pospisil","Jiri",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 07:43:15 GMT"}],"updateDate":"2024-07-24","timestamp":1721720595000,"abstract":"  VBr$_3$ is a van der Waals antiferromagnet below the N\\'eel temperature of\n26.5 K with a saturation moment of 1.2 mB/f.u. above the metamagnetic\ntransitions detected in the in-plane and out-of-plane directions. To reveal the\nAFM structure of VBr$_3$ experimentally, we performed a single-crystal neutron\ndiffraction study on a large high-quality crystal. The collected data confirmed\na slight monoclinic distortion of the high-temperature rhombohedral structure\nbelow 90 K. The magnetic structure was, nevertheless, investigated within the\nR-3 model. The antiferromagnetic structure propagation vector k = (1, 0, 0.5)\nwas revealed. In an attempt to determine the magnetic structure, 72\nnon-equivalent magnetic reflections were recorded. The experimental data were\nconfronted with the magnetic space groups dictated by the R-3 lattice symmetry\nand propagation vector. The best agreement between the experimental data and\nthe magnetic structure model was obtained for the space group P-1.1'_c. The\nmagnetic unit cell of the proposed unique antiferromagnetic structure with\nperiodicity 6c is built from two identical triple layers antiferromagnetically\ncoupled along the c axis. Each triple layer comprises a N\\'eel\nantiferromagnetic monolayer sandwiched between two antiferromagnetically\ncoupled ferromagnetic monolayers.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"T66acrVXOtMsfmyWehvQuU29eCBjKfFfeEYeREhZv-E","pdfSize":"691822"}