{"id":"2407.04371","title":"Exploiting the equivalence between quantum neural networks and\n  perceptrons","authors":"Chris Mingard and Jessica Pointing and Charles London and Yoonsoo Nam\n  and Ard A. Louis","authorsParsed":[["Mingard","Chris",""],["Pointing","Jessica",""],["London","Charles",""],["Nam","Yoonsoo",""],["Louis","Ard A.",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 09:19:58 GMT"}],"updateDate":"2024-07-08","timestamp":1720171198000,"abstract":"  Quantum machine learning models based on parametrized quantum circuits, also\ncalled quantum neural networks (QNNs), are considered to be among the most\npromising candidates for applications on near-term quantum devices. Here we\nexplore the expressivity and inductive bias of QNNs by exploiting an exact\nmapping from QNNs with inputs $x$ to classical perceptrons acting on $x \\otimes\nx$ (generalised to complex inputs). The simplicity of the perceptron\narchitecture allows us to provide clear examples of the shortcomings of current\nQNN models, and the many barriers they face to becoming useful general-purpose\nlearning algorithms. For example, a QNN with amplitude encoding cannot express\nthe Boolean parity function for $n\\geq 3$, which is but one of an exponential\nnumber of data structures that such a QNN is unable to express. Mapping a QNN\nto a classical perceptron simplifies training, allowing us to systematically\nstudy the inductive biases of other, more expressive embeddings on Boolean\ndata. Several popular embeddings primarily produce an inductive bias towards\nfunctions with low class balance, reducing their generalisation performance\ncompared to deep neural network architectures which exhibit much richer\ninductive biases. We explore two alternate strategies that move beyond standard\nQNNs. In the first, we use a QNN to help generate a classical DNN-inspired\nkernel. In the second we draw an analogy to the hierarchical structure of deep\nneural networks and construct a layered non-linear QNN that is provably fully\nexpressive on Boolean data, while also exhibiting a richer inductive bias than\nsimple QNNs. Finally, we discuss characteristics of the QNN literature that may\nobscure how hard it is to achieve quantum advantage over deep learning\nalgorithms on classical data.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"6zjJgfDzUxbUn4JEEdeU4Bh5cckw6uhDlj-WQtdUKE0","pdfSize":"5412242"}