{"id":"2407.07162","title":"Exploring a primordial solution for early black holes detected with the\n  JWST","authors":"Pratika Dayal","authorsParsed":[["Dayal","Pratika",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 18:01:30 GMT"},{"version":"v2","created":"Sun, 14 Jul 2024 09:57:50 GMT"}],"updateDate":"2024-07-16","timestamp":1720548090000,"abstract":"  The James Webb Space Telescope (JWST) has unearthed black holes as massive as\n$10^{6.2-8.1}M_\\odot$ at redshifts of $z \\sim 8.5-10.6$ with many systems\nshowing unexpectedly high black hole to stellar mass ratios >=30%, posing a\ncrucial challenge for theoretical models. Using analytic calculations, we\nexplore the combination of {\\it astrophysical} seeding mechanisms and Eddington\naccretion rates that can explain the observed objects. We then appeal to {\\it\ncosmological} primordial black hole (PBH) seeds and show how these present an\nalternative path for \"seeding\" early structures and their baryonic contents.\nAssuming seeding (via astrophysical means) at a redshift of $z_{\\rm seed}=25$\nand continuous accretion, all of the black holes studied here can either be\nexplained through super-Eddington accretion (at an Eddington fraction of\n$f_{\\rm Edd}<= 2.1 $) onto low-mass ($100M_\\odot$) seeds or Eddington-limited\naccretion onto high-mass ($10^5 M_\\odot$) seeds. The upper limit, where we\nassume a primordial origin for all of these black holes, yields a continuous\nprimordial black hole mass function (between $10^{-5.25}$ and $10^{3.75}\nM_\\odot$) and a fractional PBH value $<= 10^{-12}$, in good agreement with\nobservational constraints. Starting at the redshift of matter-radiation\nequality ($z \\sim 3400$), we show how PBH-driven structure formation can\nreproduce the observed stellar and black hole masses for two of the highest\nredshift black holes (UHZ1 and GHZ9 at $z \\sim 10.3$) with the same parameters\ngoverning star formation, black hole accretion and their feedbacks. Exploring a\nwide swathe of model parameter space for GHZ9, we find black hole-to-stellar\nmass ratios ranging between $0.1-1.86$ i.e. in some cases (of high supernova\nfeedback), the black hole grows to be more massive than the stellar mass of its\nhost, presenting an attractive alternative to seeding these puzzling early\nsystems.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ksmeNz6sCVbPWLxFKNH1PV0v-Ma18q-fufkDdmqCWrA","pdfSize":"526977"}