{"id":"2407.02983","title":"Current-induced motion of nanoscale magnetic torons over the wide range\n  of the Hall angle","authors":"Kotaro Shimizu, Shun Okumura, Yasuyuki Kato, and Yukitoshi Motome","authorsParsed":[["Shimizu","Kotaro",""],["Okumura","Shun",""],["Kato","Yasuyuki",""],["Motome","Yukitoshi",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 10:29:30 GMT"}],"updateDate":"2024-07-04","timestamp":1720002570000,"abstract":"  Current-driven dynamics of spin textures plays a pivotal role in potential\napplications for electronic devices. While two-dimensional magnetic skyrmions\nwith topologically nontrivial spin textures have garnered significant interest,\ntheir practical use is hindered by the skyrmion Hall effect $\\unicode{x2014}$ a\ntransverse motion to the current direction that occurs as a counteraction to\nthe topological Hall effect of electrons by an emergent magnetic field arising\nfrom the Berry phase effect. Here, we explore current-driven dynamics of\nthree-dimensional topological spin textures known as magnetic torons, composed\nof layered skyrmions with two singularities called Bloch points at their ends.\nThrough extensive numerical simulations, we show that the torons also exhibit a\nHall motion, but surprisingly over a wide range spanning from the zero Hall\neffect, a purely longitudinal motion, to the perfect Hall effect, a purely\ntransverse motion accompanied by no longitudinal motion. Such flexible and\ncontrollable behaviors stem from anisotropic potential barriers on the discrete\nlattice, which can be particularly relevant for nanoscale torons recently\ndiscovered. Our results not only provide an experimental method to probe\ntopology of three-dimensional magnetic textures but also pave the way for\nfuture developments in topological spintronics beyond the realm of skyrmions.\n","subjects":["Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"c2aGPbHiFIkPooMs2vpDKyfTJvbmekeAAwhRSub3dow","pdfSize":"3852201"}