{"id":"2407.19212","title":"Collaborative CP-NIZKs: Modular, Composable Proofs for Distributed\n  Secrets","authors":"Mohammed Alghazwi, Tariq Bontekoe, Leon Visscher, Fatih Turkmen","authorsParsed":[["Alghazwi","Mohammed",""],["Bontekoe","Tariq",""],["Visscher","Leon",""],["Turkmen","Fatih",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 08:45:34 GMT"}],"updateDate":"2024-07-30","timestamp":1722069934000,"abstract":"  Non-interactive zero-knowledge (NIZK) proofs of knowledge have proven to be\nhighly relevant for securely realizing a wide array of applications that rely\non both privacy and correctness. They enable a prover to convince any party of\nthe correctness of a public statement for a secret witness. However, most NIZKs\ndo not natively support proving knowledge of a secret witness that is\ndistributed over multiple provers. Previously, collaborative proofs [51] have\nbeen proposed to overcome this limitation. We investigate the notion of\ncomposability in this setting, following the Commit-and-Prove design of\nLegoSNARK [17]. Composability allows users to combine different, specialized\nNIZKs (e.g., one arithmetic circuit, one boolean circuit, and one for range\nproofs) with the aim of reducing the prove generation time. Moreover, it opens\nthe door to efficient realizations of many applications in the collaborative\nsetting such as mutually exclusive prover groups, combining collaborative and\nsingle-party proofs and efficiently implementing publicly auditable MPC\n(PA-MPC).\n  We present the first, general definition for collaborative commit-and-prove\nNIZK (CP-NIZK) proofs of knowledge and construct distributed protocols to\nenable their realization. We implement our protocols for two commonly used\nNIZKs, Groth16 and Bulletproofs, and evaluate their practicality in a variety\nof computational settings. Our findings indicate that composability adds only\nminor overhead, especially for large circuits. We experimented with our\nconstruction in an application setting, and when compared to prior works, our\nprotocols reduce latency by 18-55x while requiring only a fraction (0.2%) of\nthe communication.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_krGjvTMELeze6onYSyBNlwJ27UIscNToIjv4JQVbm8","pdfSize":"1049712"}