{"id":"2407.06486","title":"Optimal Decision Making Through Scenario Simulations Using Large\n  Language Models","authors":"Sumedh Rasal and E. J. Hauer","authorsParsed":[["Rasal","Sumedh",""],["Hauer","E. J.",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 01:23:09 GMT"},{"version":"v2","created":"Wed, 10 Jul 2024 02:57:49 GMT"}],"updateDate":"2024-07-11","timestamp":1720488189000,"abstract":"  The rapid evolution of Large Language Models (LLMs) has markedly expanded\ntheir application across diverse domains, transforming how complex problems are\napproached and solved. Initially conceived to predict subsequent words in\ntexts, these models have transcended their original design to comprehend and\nrespond to the underlying contexts of queries. Today, LLMs routinely perform\ntasks that once seemed formidable, such as writing essays, poems, stories, and\neven developing software code. As their capabilities continue to grow, so too\ndo the expectations of their performance in even more sophisticated domains.\n  Despite these advancements, LLMs still encounter significant challenges,\nparticularly in scenarios requiring intricate decision-making, such as planning\ntrips or choosing among multiple viable options. These tasks often demand a\nnuanced understanding of various outcomes and the ability to predict the\nconsequences of different choices, which are currently outside the typical\noperational scope of LLMs.\n  This paper proposes an innovative approach to bridge this capability gap. By\nenabling LLMs to request multiple potential options and their respective\nparameters from users, our system introduces a dynamic framework that\nintegrates an optimization function within the decision-making process. This\nfunction is designed to analyze the provided options, simulate potential\noutcomes, and determine the most advantageous solution based on a set of\npredefined criteria. By harnessing this methodology, LLMs can offer tailored,\noptimal solutions to complex, multi-variable problems, significantly enhancing\ntheir utility and effectiveness in real-world applications. This approach not\nonly expands the functional envelope of LLMs but also paves the way for more\nautonomous and intelligent systems capable of supporting sophisticated\ndecision-making tasks.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"SbAFynCz2z4r9Ih0JiSaRfHT1fML9GdKCKEqWKbbgmE","pdfSize":"115321"}