{"id":"2407.10760","title":"Little Red Dots: Rapidly Growing Black Holes Reddened by Extended Dusty\n  Flows","authors":"Zhengrong Li, Kohei Inayoshi, Kejian Chen, Kohei Ichikawa and Luis C.\n  Ho","authorsParsed":[["Li","Zhengrong",""],["Inayoshi","Kohei",""],["Chen","Kejian",""],["Ichikawa","Kohei",""],["Ho","Luis C.",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 14:38:12 GMT"}],"updateDate":"2024-07-16","timestamp":1721054292000,"abstract":"  The James Webb Space Telescope (JWST) observations have revolutionized\nextragalactic research, particularly with the discovery of little red dots\n(LRD), which we propose are dust-reddened broad-line active galactic nuclei\n(AGNs). Their unique v-shape spectral feature observed through JWST/NIRCam\nchallenges us to discern the relative contributions of the galaxy and AGN. We\nstudy a spectral energy distribution (SED) model for LRDs from rest-frame UV to\ninfrared bands. We hypothesize that the incident radiation from an AGN,\ncharacterized by a typical SED, is embedded in an extended dusty medium with an\nextinction law similar to those seen in dense regions such as Orion Nebula or\ncertain AGN environments. The UV-optical spectrum is described by\ndust-attenuated AGN emission, featuring a red optical continuum at\n$\\lambda>4000$ A and a flat UV spectral shape established through a gray\nextinction curve at $\\lambda<3000$ A, due to the absence of small-size grains.\nThere is no need for additional stellar emission or AGN scattered light. In the\ninfrared, the SED is shaped by an extended dust and gas distribution\n($\\gamma<1$; $\\rho\\propto r^{-\\gamma}$) with a characteristic gas density of\n$\\simeq 10-10^3~{\\rm cm}^{-3}$, which allows relatively cool dust temperatures\nto dominate the radiation, thereby shifting the energy peak from near- to\nmid-infrared bands. This model, unlike the typical AGN hot torus models, can\nproduce an infrared SED flattening that is consistent with LRD observations\nthrough JWST MIRI. Such a density structure can arise from the coexistence of\ninflows and outflows during the early assembly of galactic nuclei. This might\nbe the reason why LRDs emerge preferentially in the high-redshift universe\nyounger than one billion years.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"dAJY-xKyzq1vNOnF3sJP4eL8-FfPVLpIRkRNRRwsyMY","pdfSize":"5256140","objectId":"0xa693326092b76114cd73a4a15b1b01d767d141c570eee5cbb5da865950fa7c66","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
