{"id":"2407.04876","title":"Swimming Cylinder Wake Control with Plasma Actuator","authors":"Javad Omidi","authorsParsed":[["Omidi","Javad",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 22:07:36 GMT"},{"version":"v2","created":"Sun, 14 Jul 2024 16:12:48 GMT"}],"updateDate":"2024-07-16","timestamp":1720217256000,"abstract":"  In this research, the effect of utilizing a micro plasma actuator on\ncontrolling the flow through a two-dimensional cylinder is investigated using\nan advanced electrostatic model. Within this model, by solving two elliptic\nequations, the potential distribution and plasma distribution in the solution\ndomain are determined, leading to the generation of a volumetric force. This\nforce is added to the momentum equations as a source term. The Reynolds number\nof the flow is set at 20,000, and the plasma actuator operates in a steady\nmanner. Due to the high Reynolds number, the flow is turbulent, and its\ntime-dependent nature is modeled as unsteady. Plasma actuators are\nsymmetrically mounted at 45 and 90 degrees with respect to the free stream,\nboth above and below the cylinder surfaces. The influence of the actuator\nplacement angle on the flow quality downstream of the cylinder is examined. The\nresults indicate an enhancement of flow quality by 8% to 15% downstream of the\ncylinder. Moreover, improvements of 40% to 55% in the variation of the lift\ncoefficient and 75% to 90% in the drag coefficient are reported. The findings\nreveal superior performance of the actuator positioned at 90 degrees compared\nto the 45-degree orientation. This can be attributed to the proximity of the\n90-degree actuator position to the point of boundary layer separation\ninitiation. Furthermore, using the actuator positioned at 90 degrees and\napplying three different voltages of 10, 13, and 16 kV, the impact of flow\ncontrol on the first cylinder in a tandem arrangement on the downstream flow of\nthe second cylinder is examined. The results demonstrate an enhancement in\ndownstream flow quality of 20% to 26%.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"cCKG_G_JzBgtyRnu3Du7E0TMoI8LgqKr9F890EA4gVc","pdfSize":"9327383"}