{"id":"2407.03970","title":"Overdispersion in gate tomography: Experiments and continuous, two-scale\n  random walk model on the Bloch sphere","authors":"Wolfgang Nowak, Tim Br\\\"unnette, Merel Schalkers, Matthias M\\\"oller","authorsParsed":[["Nowak","Wolfgang",""],["Brünnette","Tim",""],["Schalkers","Merel",""],["Möller","Matthias",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 14:44:53 GMT"}],"updateDate":"2024-07-08","timestamp":1720104293000,"abstract":"  Noisy intermediate-scale quantum computers (NISQ) are in their childhood, but\nshowing high promise. One main concern for NISQ machines is their inherent\nnoisiness, as the qubit states are subject to disturbances with each\nalgorithmic operation applied. In this study, we conduct experiments on quantum\nnoise. Based on our data, we show that existing noise models fail to properly\ncapture the aggregation of noise effects over an algorithm's runtime. They are\nunderdispersed, meaning that observable frequencies scatter much more between\nrepeated experiments than what the standard assumptions of the binomial\ndistribution allow for. We develop noise model for the readout probabilities as\na function of the number of gate operations. The model is based on a continuous\nrandom walk on the (Bloch) sphere, where the angular diffusion coefficient\ncharacterizes the noisiness of gate operations. We superimpose a second random\nwalk at the scale of multiple readouts to account for overdispersion. The\ninteraction of these two random walks predicts theoretical, runtime-dependent\nbounds for probabilities. Overall, it is a three-parameter distributional model\nthat fits the data better than the corresponding one-scale model (without\noverdispersion). We demonstrate the fit and the plausibility of the predicted\nbounds via Bayesian data-model analysis.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"s2fTo-j69Cnf6LvtKthrBHdxVpHFU8iu63-4vwq4h90","pdfSize":"561937"}