{"id":"2407.17994","title":"Discursive Patinas: Anchoring Discussions in Data Visualizations","authors":"Tobias Kauer, Derya Akbaba, Marian D\\\"ork, Benjamin Bach","authorsParsed":[["Kauer","Tobias",""],["Akbaba","Derya",""],["Dörk","Marian",""],["Bach","Benjamin",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 12:40:20 GMT"}],"updateDate":"2024-07-26","timestamp":1721911220000,"abstract":"  This paper presents discursive patinas, a technique to visualize discussions\nonto data visualizations, inspired by how people leave traces in the physical\nworld. While data visualizations are widely discussed in online communities and\nsocial media, comments tend to be displayed separately from the visualization\nand we lack ways to relate these discussions back to the content of the\nvisualization, e.g., to situate comments, explain visual patterns, or question\nassumptions. In our visualization annotation interface, users can designate\nareas within the visualization. Discursive patinas are made of overlaid visual\nmarks (anchors), attached to textual comments with category labels, likes, and\nreplies. By coloring and styling the anchors, a meta visualization emerges,\nshowing what and where people comment and annotate the visualization. These\npatinas show regions of heavy discussions, recent commenting activity, and the\ndistribution of questions, suggestions, or personal stories. We ran workshops\nwith 90 students, domain experts, and visualization researchers to study how\npeople use anchors to discuss visualizations and how patinas influence people's\nunderstanding of the discussion. Our results show that discursive patinas\nimprove the ability to navigate discussions and guide people to comments that\nhelp understand, contextualize, or scrutinize the visualization. We discuss the\npotential of anchors and patinas to support discursive engagements, including\ncritical readings of visualizations, design feedback, and feminist approaches\nto data visualization.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"sjFDFgCZQWvWKa2dXf90xtKfOXrYZaLk7Ts-d40Tb5s","pdfSize":"1614298","objectId":"0x8728c886e6cd2e3e28145fa66a039558238b3523228958583141ed8991b951b6","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
