{"id":"2407.17530","title":"Learning Instance-Specific Parameters of Black-Box Models Using\n  Differentiable Surrogates","authors":"Arnisha Khondaker, Nilanjan Ray","authorsParsed":[["Khondaker","Arnisha",""],["Ray","Nilanjan",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 20:57:12 GMT"}],"updateDate":"2024-07-26","timestamp":1721768232000,"abstract":"  Tuning parameters of a non-differentiable or black-box compute is\nchallenging. Existing methods rely mostly on random sampling or grid sampling\nfrom the parameter space. Further, with all the current methods, it is not\npossible to supply any input specific parameters to the black-box. To the best\nof our knowledge, for the first time, we are able to learn input-specific\nparameters for a black box in this work. As a test application we choose a\npopular image denoising method BM3D as our black-box compute. Then, we use a\ndifferentiable surrogate model (a neural network) to approximate the black-box\nbehaviour. Next, another neural network is used in an end-to-end fashion to\nlearn input instance-specific parameters for the black-box. Drawing inspiration\nfrom the work of Tseng et al. [1] , we applied our method to the Smartphone\nImage Denoising Dataset (SIDD) for image denoising. The results are compelling,\ndemonstrating a significant increase in PSNR and a notable improvement in SSIM\nnearing 0.93. Experimental results underscore the effectiveness of our approach\nin achieving substantial improvements in both model performance and\noptimization efficiency. For code and implementation details, please refer to\nour GitHub repository.\n  [1] Ethan Tseng, Felix Yu, Yuting Yang, Fahim Mannan, Karl St. Arnaud, Derek\nNowrouzezahrai, Jean-Francois Lalonde, and Felix Heide. Hyperparameter\noptimization in black-box image processing using differentiable proxies. ACM\nTransactions on Graphics (TOG), 38(4), 7 2019.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"J-oiTz7SrgJLVDUAMFjhAJQJtl78rHVrtOzHDgIapdQ","pdfSize":"3236056"}