{"id":"2407.03173","title":"A meshless method to compute the proper orthogonal decomposition and its\n  variants from scattered data","authors":"Iacopo Tirelli, Miguel Alfonso Mendez, Andrea Ianiro, Stefano Discetti","authorsParsed":[["Tirelli","Iacopo",""],["Mendez","Miguel Alfonso",""],["Ianiro","Andrea",""],["Discetti","Stefano",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 14:49:07 GMT"}],"updateDate":"2024-07-04","timestamp":1720018147000,"abstract":"  Complex phenomena can be better understood when broken down into a limited\nnumber of simpler \"components\". Linear statistical methods such as the\nprincipal component analysis and its variants are widely used across various\nfields of applied science to identify and rank these components based on the\nvariance they represent in the data. These methods can be seen as\nfactorizations of the matrix collecting all the data, which are assumed to be a\ncollection of time series sampled from fixed points in space. However, when\ndata sampling locations vary over time, as with mobile monitoring stations in\nmeteorology and oceanography or with particle tracking velocimetry in\nexperimental fluid dynamics, advanced interpolation techniques are required to\nproject the data onto a fixed grid before carrying out the factorization. This\ninterpolation is often expensive and inaccurate. This work proposes a method to\ndecompose scattered data without interpolating. The approach is based on\nphysics-constrained radial basis function regression to compute inner products\nin space and time. The method provides an analytical and mesh-independent\ndecomposition in space and time, demonstrating higher accuracy than the\ntraditional approach. Our results show that it is possible to distill the most\nrelevant \"components\" even for measurements whose natural output is a\ndistribution of data scattered in space and time, maintaining high accuracy and\nmesh independence.\n","subjects":["Physics/Data Analysis, Statistics and Probability"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"5PS-4Be2f6Lro2JhAUTM79Cp9WvvDAjHRo_oImvijfc","pdfSize":"3140863"}
