{"id":"2407.15385","title":"Towards Robust Vision Transformer via Masked Adaptive Ensemble","authors":"Fudong Lin, Jiadong Lou, Xu Yuan, and Nian-Feng Tzeng","authorsParsed":[["Lin","Fudong",""],["Lou","Jiadong",""],["Yuan","Xu",""],["Tzeng","Nian-Feng",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 05:28:29 GMT"}],"updateDate":"2024-07-23","timestamp":1721626109000,"abstract":"  Adversarial training (AT) can help improve the robustness of Vision\nTransformers (ViT) against adversarial attacks by intentionally injecting\nadversarial examples into the training data. However, this way of adversarial\ninjection inevitably incurs standard accuracy degradation to some extent,\nthereby calling for a trade-off between standard accuracy and robustness.\nBesides, the prominent AT solutions are still vulnerable to adaptive attacks.\nTo tackle such shortcomings, this paper proposes a novel ViT architecture,\nincluding a detector and a classifier bridged by our newly developed adaptive\nensemble. Specifically, we empirically discover that detecting adversarial\nexamples can benefit from the Guided Backpropagation technique. Driven by this\ndiscovery, a novel Multi-head Self-Attention (MSA) mechanism is introduced to\nenhance our detector to sniff adversarial examples. Then, a classifier with two\nencoders is employed for extracting visual representations respectively from\nclean images and adversarial examples, with our adaptive ensemble to adaptively\nadjust the proportion of visual representations from the two encoders for\naccurate classification. This design enables our ViT architecture to achieve a\nbetter trade-off between standard accuracy and robustness. Besides, our\nadaptive ensemble technique allows us to mask off a random subset of image\npatches within input data, boosting our ViT's robustness against adaptive\nattacks, while maintaining high standard accuracy. Experimental results exhibit\nthat our ViT architecture, on CIFAR-10, achieves the best standard accuracy and\nadversarial robustness of 90.3% and 49.8%, respectively.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"usE5n9v1HL0SfcS3R7ZoPpB5CxVI4eebE-B-AQJyYuk","pdfSize":"29065171","objectId":"0x32620e35dc4eb8cab33053cc819456080fb7660b9e4e260580be71de0cc30eef","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
