{"id":"2407.14738","title":"Flatness-aware Sequential Learning Generates Resilient Backdoors","authors":"Hoang Pham, The-Anh Ta, Anh Tran, and Khoa D. Doan","authorsParsed":[["Pham","Hoang",""],["Ta","The-Anh",""],["Tran","Anh",""],["Doan","Khoa D.",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 03:30:05 GMT"}],"updateDate":"2024-07-23","timestamp":1721446205000,"abstract":"  Recently, backdoor attacks have become an emerging threat to the security of\nmachine learning models. From the adversary's perspective, the implanted\nbackdoors should be resistant to defensive algorithms, but some recently\nproposed fine-tuning defenses can remove these backdoors with notable efficacy.\nThis is mainly due to the catastrophic forgetting (CF) property of deep neural\nnetworks. This paper counters CF of backdoors by leveraging continual learning\n(CL) techniques. We begin by investigating the connectivity between a\nbackdoored and fine-tuned model in the loss landscape. Our analysis confirms\nthat fine-tuning defenses, especially the more advanced ones, can easily push a\npoisoned model out of the backdoor regions, making it forget all about the\nbackdoors. Based on this finding, we re-formulate backdoor training through the\nlens of CL and propose a novel framework, named Sequential Backdoor Learning\n(SBL), that can generate resilient backdoors. This framework separates the\nbackdoor poisoning process into two tasks: the first task learns a backdoored\nmodel, while the second task, based on the CL principles, moves it to a\nbackdoored region resistant to fine-tuning. We additionally propose to seek\nflatter backdoor regions via a sharpness-aware minimizer in the framework,\nfurther strengthening the durability of the implanted backdoor. Finally, we\ndemonstrate the effectiveness of our method through extensive empirical\nexperiments on several benchmark datasets in the backdoor domain. The source\ncode is available at https://github.com/mail-research/SBL-resilient-backdoors\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"DDoyeeKXvfUh7N2H_UgErDp7VsHnt2RxRQGRVEDDs34","pdfSize":"1294651"}