{"id":"2407.18293","title":"On the relation between magnetic field strength and gas density in the\n  interstellar medium: A multiscale analysis","authors":"David J. Whitworth, Sundar Srinivasan, Ralph E. Pudritz, Mordecai M.\n  Mac Low, Rowan J. Smith, Aina Palau, Kate Pattle, Gwendoline Eadie, Hector\n  Robinson, Rachel Pillsworth, James Wadsley, Noe Brucy, Ugo Lebreuilly,\n  Patrick Hennebelle, Philipp Girichidis, Fred A. Gent, Jessy Marin, Lylon\n  S\\'anchez Valido, Vianey Camacho, Ralf S. Klessen, and Enrique\n  V\\'azquez-Semadeni","authorsParsed":[["Whitworth","David J.",""],["Srinivasan","Sundar",""],["Pudritz","Ralph E.",""],["Mac Low","Mordecai M.",""],["Smith","Rowan J.",""],["Palau","Aina",""],["Pattle","Kate",""],["Eadie","Gwendoline",""],["Robinson","Hector",""],["Pillsworth","Rachel",""],["Wadsley","James",""],["Brucy","Noe",""],["Lebreuilly","Ugo",""],["Hennebelle","Patrick",""],["Girichidis","Philipp",""],["Gent","Fred A.",""],["Marin","Jessy",""],["Valido","Lylon Sánchez",""],["Camacho","Vianey",""],["Klessen","Ralf S.",""],["Vázquez-Semadeni","Enrique",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 18:00:00 GMT"}],"updateDate":"2024-07-29","timestamp":1721930400000,"abstract":"  The relation between magnetic field strength B and gas density n in the\ninterstellar medium is of fundamental importance to many areas of astrophysics,\nfrom protostellar disks to galaxy evolution. We present and compare Bayesian\nanalyses of the B - n relation for a comprehensive observational data set, as\nwell as a large body of numerical MHD simulations. We extend the original\nZeeman relation of Crutcher et al. (2010) with a large body of magnetic data\nthat includes 700 observations with the Davis-Chandrasekhar-Fermi method. By\nusing a new multiparameter Bayesian analysis we present a new, more general,\ntime-averaged observational relation: B \\propto n^{0.27 \\pm 0.017} for n \\leq\nn_0 and B \\propto n^{0.54 \\pm 0.18} for n \\geq n_0, with n_0 = 924^(+145-144)\ncm^-3. We perform a separate analysis on 19 numerical magnetohydrodynamics\nsimulations that cover a wide range of scales, resolutions, initial conditions,\nand completed with a variety of codes: arepo, flash, pencil, and ramses. The\npower law exponents derived from the simulations depend on several physical\nfactors including: dynamo effects, time scales, turbulence, and the initial\nseed field strength. In particular, early-time simulations where the density,\nvelocity and magnetic fields are unevolved do not match the observational\nscalings. The simulations that trace the observed density range best, the\nevolved dwarf galaxy and Milky Way like galaxy simulations, settle into a near\nconsistent exponent of = 0.5 in the dense gas, with variability in the diffuse\ngas exponent.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"JZhKf--H5BH_oPL5rAlcL7NwBVJWefnscuPoafI1ckA","pdfSize":"5327248"}