{"id":"2407.16549","title":"Impact of the transport of magnetospheric electrons on the composition\n  of the Triton atmosphere","authors":"B. Benne (1,2), B. Benmahi (3), M. Dobrijevic (1), T. Cavali\\'e (1,4),\n  J-C. Loison (5), K. M. Hickson (5), M. Barth\\'el\\'emy (6), J. Lilensten (6)\n  ((1) Laboratoire d'Astrophysique de Bordeaux, France, (2) The University of\n  Edinburgh, School of Geoscience, UK, (3) Laboratoire de Physique\n  Atmosph\\'erique et Plan\\'etaire, Belgium, (4) LESIA, France, (5) Institut des\n  Sciences Mol\\'eculaires, France, (6) IPAG, France)","authorsParsed":[["Benne","B.",""],["Benmahi","B.",""],["Dobrijevic","M.",""],["Cavalié","T.",""],["Loison","J-C.",""],["Hickson","K. M.",""],["Barthélémy","M.",""],["Lilensten","J.",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 15:00:22 GMT"}],"updateDate":"2024-07-24","timestamp":1721746822000,"abstract":"  Due to its inclined orbit and the complex geometry of the magnetic field of\nNeptune, Triton experiences a highly variable magnetic environment. As\nprecipitation of magnetospheric electrons is thought to have a large impact on\nthe Triton atmosphere, a better understanding of the interaction between its\natmosphere and the magnetosphere of Neptune is important. We aim to couple a\nmodel of the Triton atmosphere with an electron transport model to compute the\nimpact of a varying electron precipitation on the atmospheric composition. We\ncoupled a recent photochemical model of the Triton atmosphere with the electron\ntransport model TRANSPlanets. The inputs of this code were determined from\nVoyager 2 observations and previous studies. The main inputs were the electron\nprecipitation flux, the orbital scaling factor, and the magnetic field\nstrength. The electron-impact ionization and electron-impact dissociation rates\ncomputed by TRANSPlanets were then used in the photochemical model. We also\nanalyzed the model uncertainties. The coupling of the two models enabled us to\nfind an electron density profile, as well as N$_2$ and N number densities, that\nare consistent with the Voyager 2 observations. We found that photoionization\nand electron-impact ionization are of the same order, in contrast to the\nresults of previous photochemical models. However, we emphasize that this\nresult depends on the hypotheses we used to determine the input variables of\nTRANSPlanets. Our model would greatly benefit from new measurements of the\nmagnetic environment of Triton, as well as of the electron fluxes in the\nNeptune magnetosphere.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"MdSAGlLysRlIItDU-pfj5XKHLcypzsCqfj3B3eWEhX4","pdfSize":"23159492"}