{"id":"2407.03041","title":"Position and Altitude of the Nao Camera Head from Two Points on the\n  Soccer Field plus the Gravitational Direction","authors":"Stijn Oomes and Arnoud Visser","authorsParsed":[["Oomes","Stijn",""],["Visser","Arnoud",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 12:06:34 GMT"}],"updateDate":"2024-07-04","timestamp":1720008394000,"abstract":"  To be able to play soccer, a robot needs a good estimate of its current\nposition on the field. Ideally, multiple features are visible that have known\nlocations. By applying trigonometry we can estimate the viewpoint from where\nthis observation was actually made. Given that the Nao robots of the Standard\nPlatform League have quite a limited field of view, a given camera frame\ntypically only allows for one or two points to be recognized.\n  In this paper we propose a method for determining the (x, y) coordinates on\nthe field and the height h of the camera from the geometry of a simplified\ntetrahedron. This configuration is formed by two observed points on the ground\nplane plus the gravitational direction. When the distance between the two\npoints is known, and the directions to the points plus the gravitational\ndirection are measured, all dimensions of the tetrahedron can be determined.\n  By performing these calculations with rational trigonometry instead of\nclassical trigonometry, the computations turn out to be 28.7% faster, with\nequal numerical accuracy. The position of the head of the Nao can also be\nexternally measured with the OptiTrack system. The difference between\nexternally measured and internally predicted position from sensor data gives us\nmean absolute errors in the 3-6 centimeters range, when we estimated the\ngravitational direction from the vanishing point of the outer edges of the goal\nposts.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"bejp8olhGTbHMmR7UZrKBx-TY4IbekFhdqbFlZtC7HI","pdfSize":"2934226"}