{"id":"2407.00269","title":"High-power and narrow-linewidth laser on thin-film lithium niobate\n  enabled by photonic wire bonding","authors":"Cornelis A.A. Franken, Rebecca Cheng, Keith Powell, Georgios\n  Kyriazidis, Victoria Rosborough, Juergen Musolf, Maximilian Shah, David R.\n  Barton III, Gage Hills, Leif Johansson, Klaus-J. Boller, Marko Lon\\v{c}ar","authorsParsed":[["Franken","Cornelis A. A.",""],["Cheng","Rebecca",""],["Powell","Keith",""],["Kyriazidis","Georgios",""],["Rosborough","Victoria",""],["Musolf","Juergen",""],["Shah","Maximilian",""],["Barton","David R.","III"],["Hills","Gage",""],["Johansson","Leif",""],["Boller","Klaus-J.",""],["Lončar","Marko",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 00:52:40 GMT"},{"version":"v2","created":"Fri, 5 Jul 2024 22:41:23 GMT"}],"updateDate":"2024-07-09","timestamp":1719622360000,"abstract":"  Thin-film lithium niobate (TFLN) has emerged as a promising platform for the\nrealization of high performance chip-scale optical systems, spanning a range of\napplications from optical communications to microwave photonics. Such\napplications rely on the integration of multiple components onto a single\nplatform. However, while many of these components have already been\ndemonstrated on the TFLN platform, to date, a major bottleneck of the platform\nis the existence of a tunable, high-power, and narrow-linewidth on-chip laser.\nHere, we address this problem using photonic wire bonding to integrate optical\namplifiers with a thin-film lithium niobate feedback circuit, and demonstrate\nan extended cavity diode laser yielding high on-chip power of 78 mW, side mode\nsuppression larger than 60 dB and wide wavelength tunability over 43 nm. The\nlaser frequency stability over short timescales shows an ultra-narrow intrinsic\nlinewidth of 550 Hz. Long-term recordings indicate a high passive stability of\nthe photonic wire bonded laser with 58 hours of mode-hop-free operation, with a\ntrend in the frequency drift of only 4.4 MHz/h. This work verifies photonic\nwire bonding as a viable integration solution for high performance on-chip\nlasers, opening the path to system level upscaling and Watt-level output\npowers.\n","subjects":["Physics/Optics","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7R9InyZU7oIbL61f9fo-b5xle001TsT3EWq9gacKeRQ","pdfSize":"1311133","objectId":"0xd3a5705f9257205bb64fcf06b84551b4b3e22045920c2dc7d3147a7ab711e95f","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
