{"id":"2407.03779","title":"Functional Faithfulness in the Wild: Circuit Discovery with\n  Differentiable Computation Graph Pruning","authors":"Lei Yu, Jingcheng Niu, Zining Zhu, Gerald Penn","authorsParsed":[["Yu","Lei",""],["Niu","Jingcheng",""],["Zhu","Zining",""],["Penn","Gerald",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 09:42:25 GMT"}],"updateDate":"2024-07-08","timestamp":1720086145000,"abstract":"  In this paper, we introduce a comprehensive reformulation of the task known\nas Circuit Discovery, along with DiscoGP, a novel and effective algorithm based\non differentiable masking for discovering circuits. Circuit discovery is the\ntask of interpreting the computational mechanisms of language models (LMs) by\ndissecting their functions and capabilities into sparse subnetworks (circuits).\nWe identified two major limitations in existing circuit discovery efforts: (1)\na dichotomy between weight-based and connection-edge-based approaches forces\nresearchers to choose between pruning connections or weights, thereby limiting\nthe scope of mechanistic interpretation of LMs; (2) algorithms based on\nactivation patching tend to identify circuits that are neither functionally\nfaithful nor complete. The performance of these identified circuits is\nsubstantially reduced, often resulting in near-random performance in isolation.\nFurthermore, the complement of the circuit -- i.e., the original LM with the\nidentified circuit removed -- still retains adequate performance, indicating\nthat essential components of a complete circuits are missed by existing\nmethods.\n  DiscoGP successfully addresses the two aforementioned issues and demonstrates\nstate-of-the-art faithfulness, completeness, and sparsity. The effectiveness of\nthe algorithm and its novel structure open up new avenues of gathering new\ninsights into the internal workings of generative AI.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"yZQAoi0Ahn1ONozGQ68afGv8X5SWf8dzt8cu7j4EF5Q","pdfSize":"850483"}