{"id":"2407.06525","title":"UnmixingSR: Material-aware Network with Unsupervised Unmixing as\n  Auxiliary Task for Hyperspectral Image Super-resolution","authors":"Yang Yu","authorsParsed":[["Yu","Yang",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 03:41:02 GMT"}],"updateDate":"2024-07-10","timestamp":1720496462000,"abstract":"  Deep learning-based (DL-based) hyperspectral image (HIS) super-resolution\n(SR) methods have achieved remarkable performance and attracted attention in\nindustry and academia. Nonetheless, most current methods explored and learned\nthe mapping relationship between low-resolution (LR) and high-resolution (HR)\nHSIs, leading to the side effect of increasing unreliability and irrationality\nin solving the ill-posed SR problem. We find, quite interestingly, LR imaging\nis similar to the mixed pixel phenomenon. A single photodetector in sensor\narrays receives the reflectance signals reflected by a number of classes,\nresulting in low spatial resolution and mixed pixel problems. Inspired by this\nobservation, this paper proposes a component-aware HSI SR network called\nUnmixingSR, in which the unsupervised HU as an auxiliary task is used to\nperceive the material components of HSIs. We regard HU as an auxiliary task and\nincorporate it into the HSI SR process by exploring the constraints between LR\nand HR abundances. Instead of only learning the mapping relationship between LR\nand HR HSIs, we leverage the bond between LR abundances and HR abundances to\nboost the stability of our method in solving SR problems. Moreover, the\nproposed unmixing process can be embedded into existing deep SR models as a\nplug-in-play auxiliary task. Experimental results on hyperspectral experiments\nshow that unmixing process as an auxiliary task incorporated into the SR\nproblem is feasible and rational, achieving outstanding performance. The code\nis available at\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"abnW6I2BrdHBahV9DLyJXKKzbZ4danK5QMce--5cI70","pdfSize":"1677221"}