{"id":"2407.12612","title":"American cities are defined by isolated rings and pockets characterized\n  by limited socio-economic mixing","authors":"Andrew Renninger, Neave O'Clery and Elsa Arcaute","authorsParsed":[["Renninger","Andrew",""],["O'Clery","Neave",""],["Arcaute","Elsa",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 14:41:27 GMT"}],"updateDate":"2024-07-18","timestamp":1721227287000,"abstract":"  Cities generate gains from interaction, but citizens often experience\nsegregation as they move around the urban environment. Using GPS location data,\nwe identify four distinct patterns of experienced segregation across US cities.\nMost common are affluent or poor neighborhoods where visitors lack diversity\nand residents have limited exposure to diversity elsewhere. Less frequent are\nmajority-minority areas where residents must travel for diverse encounters, and\nwealthy urban zones with diverse visitors but where locals sort into\nhomogeneous amenities. By clustering areas with similar mobility signatures, we\nuncover rings around cities and internal pockets where intergroup interaction\nis limited. Using a decision tree, we show that demography and location\ninteract to create these zones. Our findings, persistent across time and\nprevalent across US cities, highlight the importance of considering both who is\nmixing and where in urban environments. Understanding the mesoscopic patterns\nthat define experienced segregation in America illuminates neighborhood\nadvantage and disadvantage, enabling interventions to foster economic\nopportunity and urban dynamism.\n","subjects":["Physics/Physics and Society","Computing Research Repository/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"xfwqzRdr1cV9yZBaw_i4i2N-wdKjpk9x16pK_D_PrtQ","pdfSize":"5446882","objectId":"0x8f3e7957230cf1369be23d6ab66e694d252d9212295792aa0df8ccdef0198dfd","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
