{"id":"2407.16497","title":"Dynamic Retraining-Updating Mean Teacher for Source-Free Object\n  Detection","authors":"Trinh Le Ba Khanh, Huy-Hung Nguyen, Long Hoang Pham, Duong Nguyen-Ngoc\n  Tran, Jae Wook Jeon","authorsParsed":[["Khanh","Trinh Le Ba",""],["Nguyen","Huy-Hung",""],["Pham","Long Hoang",""],["Tran","Duong Nguyen-Ngoc",""],["Jeon","Jae Wook",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 14:12:57 GMT"}],"updateDate":"2024-07-24","timestamp":1721743977000,"abstract":"  In object detection, unsupervised domain adaptation (UDA) aims to transfer\nknowledge from a labeled source domain to an unlabeled target domain. However,\nUDA's reliance on labeled source data restricts its adaptability in\nprivacy-related scenarios. This study focuses on source-free object detection\n(SFOD), which adapts a source-trained detector to an unlabeled target domain\nwithout using labeled source data. Recent advancements in self-training,\nparticularly with the Mean Teacher (MT) framework, show promise for SFOD\ndeployment. However, the absence of source supervision significantly\ncompromises the stability of these approaches. We identify two primary issues,\n(1) uncontrollable degradation of the teacher model due to inopportune updates\nfrom the student model, and (2) the student model's tendency to replicate\nerrors from incorrect pseudo labels, leading to it being trapped in a local\noptimum. Both factors contribute to a detrimental circular dependency,\nresulting in rapid performance degradation in recent self-training frameworks.\nTo tackle these challenges, we propose the Dynamic Retraining-Updating (DRU)\nmechanism, which actively manages the student training and teacher updating\nprocesses to achieve co-evolutionary training. Additionally, we introduce\nHistorical Student Loss to mitigate the influence of incorrect pseudo labels.\nOur method achieves state-of-the-art performance in the SFOD setting on\nmultiple domain adaptation benchmarks, comparable to or even surpassing\nadvanced UDA methods. The code will be released at\nhttps://github.com/lbktrinh/DRU\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"bOKS4ysNdCnTJyNdFzVzL5PpP0H7o52Hi6vDzK0hXOk","pdfSize":"6245434"}