{"id":"2407.19375","title":"Topological Phase Transition in Quasi-One-Dimensional Bismuth Iodide\n  Bi4I4","authors":"W. X. Zhao, M. Yang, X. Du, Y. D. Li, K. Y. Zhai, Y. Q. Hu, J. F. Han,\n  Y. Huang, Z. K. Liu, Y. G. Yao, J. C. Zhuang, Y. Du, J. J. Zhou, Y. L. Chen,\n  and L. X. Yang","authorsParsed":[["Zhao","W. X.",""],["Yang","M.",""],["Du","X.",""],["Li","Y. D.",""],["Zhai","K. Y.",""],["Hu","Y. Q.",""],["Han","J. F.",""],["Huang","Y.",""],["Liu","Z. K.",""],["Yao","Y. G.",""],["Zhuang","J. C.",""],["Du","Y.",""],["Zhou","J. J.",""],["Chen","Y. L.",""],["Yang","L. X.",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 03:09:05 GMT"}],"updateDate":"2024-07-30","timestamp":1722136145000,"abstract":"  The exploration of topological quantum materials and topological phase\ntransitions is at the forefront of modern condensed matter physics.\nQuasi-one-dimensional (quasi-1D) bismuth iodide Bi4I4 exhibits versatile\ntopological phases of matter including weak topological insulator (WTI) and\nhigher-order topological insulator (HOTI) phases with high tunability in\nresponse to external parameters. In this work, performing laser-based\nangle-resolved photoemission spectroscopy with submicron spatial resolution\n(micro-ARPES), we comprehensively investigate the fine electronic structure and\ntopological phase transition of Bi4I4. Our examination of the low-temperature\n{\\alpha}-phase reveals the presence of an energy gap on the (100) surface,\nproviding spectroscopic evidence for the HOTI phase. Conversely, the\nhigh-temperature {\\beta}-Bi4I4 harbors a gapless Dirac fermion on the (100)\nsurface alongside gapped states on the (001) surface, thereby establishing a\nWTI phase. By tracking the temperature evolution of the (100) surface states,\nwe unveil a thermal hysteresis of the surface gap in line with the\n{\\alpha}-{\\beta} structural phase transition. Our findings elucidate the\ntopological properties of Bi4I4 and directly evidence a temperature-induced\ntopological phase transition from WTI to HOTI, which paves the way to potential\napplications based on the room-temperature topological phase transition in the\nquasi-1D topological quantum material.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"4sL3U0njMi1I7KISwH674TbE0t2LANJEYDd4PdhzH0o","pdfSize":"1271468"}