{"id":"2407.09230","title":"Surgical Text-to-Image Generation","authors":"Chinedu Innocent Nwoye, Rupak Bose, Kareem Elgohary, Lorenzo Arboit,\n  Giorgio Carlino, Jo\\\"el L. Lavanchy, Pietro Mascagni, Nicolas Padoy","authorsParsed":[["Nwoye","Chinedu Innocent",""],["Bose","Rupak",""],["Elgohary","Kareem",""],["Arboit","Lorenzo",""],["Carlino","Giorgio",""],["Lavanchy","Joël L.",""],["Mascagni","Pietro",""],["Padoy","Nicolas",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 12:49:11 GMT"},{"version":"v2","created":"Tue, 30 Jul 2024 16:40:23 GMT"}],"updateDate":"2024-07-31","timestamp":1720788551000,"abstract":"  Acquiring surgical data for research and development is significantly\nhindered by high annotation costs and practical and ethical constraints.\nUtilizing synthetically generated images could offer a valuable alternative. In\nthis work, we explore adapting text-to-image generative models for the surgical\ndomain using the CholecT50 dataset, which provides surgical images annotated\nwith action triplets (instrument, verb, target). We investigate several\nlanguage models and find T5 to offer more distinct features for differentiating\nsurgical actions on triplet-based textual inputs, and showcasing stronger\nalignment between long and triplet-based captions. To address challenges in\ntraining text-to-image models solely on triplet-based captions without\nadditional inputs and supervisory signals, we discover that triplet text\nembeddings are instrument-centric in the latent space. Leveraging this insight,\nwe design an instrument-based class balancing technique to counteract data\nimbalance and skewness, improving training convergence. Extending Imagen, a\ndiffusion-based generative model, we develop Surgical Imagen to generate\nphotorealistic and activity-aligned surgical images from triplet-based textual\nprompts. We assess the model on quality, alignment, reasoning, and knowledge,\nachieving FID and CLIP scores of 3.7 and 26.8% respectively. Human expert\nsurvey shows that participants were highly challenged by the realistic\ncharacteristics of the generated samples, demonstrating Surgical Imagen's\neffectiveness as a practical alternative to real data collection.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"xoRq9Hfcy5u0rYLp2cptQqa8yFOiqqmbSlpdnSxZJbA","pdfSize":"2341920"}