{"id":"2407.03237","title":"Reconsidering utility: unveiling the limitations of synthetic mobility\n  data generation algorithms in real-life scenarios","authors":"Alexandra Kapp and Helena Mihaljevi\\'c","authorsParsed":[["Kapp","Alexandra",""],["Mihaljević","Helena",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 16:08:05 GMT"}],"updateDate":"2024-07-04","timestamp":1720022885000,"abstract":"  In recent years, there has been a surge in the development of models for the\ngeneration of synthetic mobility data. These models aim to facilitate the\nsharing of data while safeguarding privacy, all while ensuring high utility and\nflexibility regarding potential applications. However, current utility\nevaluation methods fail to fully account for real-life requirements. We\nevaluate the utility of five state-of-the-art synthesis approaches, each with\nand without the incorporation of differential privacy (DP) guarantees, in terms\nof real-world applicability. Specifically, we focus on so-called trip data that\nencode fine granular urban movements such as GPS-tracked taxi rides. Such data\nprove particularly valuable for downstream tasks at the road network level.\nThus, our initial step involves appropriately map matching the synthetic data\nand subsequently comparing the resulting trips with those generated by the\nrouting algorithm implemented in OpenStreetMap, which serves as an efficient\nand privacy-friendly baseline. Out of the five evaluated models, one fails to\nproduce data within reasonable computation time and another generates too many\njumps to meet the requirements for map matching. The remaining three models\nsucceed to a certain degree in maintaining spatial distribution, one even with\nDP guarantees. However, all models struggle to produce meaningful sequences of\ngeo-locations with reasonable trip lengths and to model traffic flow at\nintersections accurately. It is important to note that trip data encompasses\nvarious relevant characteristics beyond spatial distribution, such as temporal\ninformation, all of which are discarded by these models. Consequently, our\nresults imply that current synthesis models fall short in their promise of high\nutility and flexibility.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"kjw25Xn-8VY6f50yfk8e4CmV6D9cpcfwS-HV2Ym4rGU","pdfSize":"10947977"}