{"id":"2407.07064","title":"Prompting Techniques for Secure Code Generation: A Systematic\n  Investigation","authors":"Catherine Tony, Nicol\\'as E. D\\'iaz Ferreyra, Markus Mutas, Salem\n  Dhiff and Riccardo Scandariato","authorsParsed":[["Tony","Catherine",""],["Ferreyra","Nicolás E. Díaz",""],["Mutas","Markus",""],["Dhiff","Salem",""],["Scandariato","Riccardo",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 17:38:03 GMT"}],"updateDate":"2024-07-10","timestamp":1720546683000,"abstract":"  Large Language Models (LLMs) are gaining momentum in software development\nwith prompt-driven programming enabling developers to create code from natural\nlanguage (NL) instructions. However, studies have questioned their ability to\nproduce secure code and, thereby, the quality of prompt-generated software.\nAlongside, various prompting techniques that carefully tailor prompts have\nemerged to elicit optimal responses from LLMs. Still, the interplay between\nsuch prompting strategies and secure code generation remains under-explored and\ncalls for further investigations. OBJECTIVE: In this study, we investigate the\nimpact of different prompting techniques on the security of code generated from\nNL instructions by LLMs. METHOD: First we perform a systematic literature\nreview to identify the existing prompting techniques that can be used for code\ngeneration tasks. A subset of these techniques are evaluated on GPT-3, GPT-3.5,\nand GPT-4 models for secure code generation. For this, we used an existing\ndataset consisting of 150 NL security-relevant code-generation prompts.\nRESULTS: Our work (i) classifies potential prompting techniques for code\ngeneration (ii) adapts and evaluates a subset of the identified techniques for\nsecure code generation tasks and (iii) observes a reduction in security\nweaknesses across the tested LLMs, especially after using an existing technique\ncalled Recursive Criticism and Improvement (RCI), contributing valuable\ninsights to the ongoing discourse on LLM-generated code security.\n","subjects":["Computing Research Repository/Software Engineering","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Cryptography and Security","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Pf6mkhvtoTV-pDvfOkA6k_O1xCxSKtFEq2cbeSAqKxk","pdfSize":"2120923"}