{"id":"2407.02034","title":"TrAME: Trajectory-Anchored Multi-View Editing for Text-Guided 3D\n  Gaussian Splatting Manipulation","authors":"Chaofan Luo, Donglin Di, Xun Yang, Yongjia Ma, Zhou Xue, Chen Wei,\n  Yebin Liu","authorsParsed":[["Luo","Chaofan",""],["Di","Donglin",""],["Yang","Xun",""],["Ma","Yongjia",""],["Xue","Zhou",""],["Wei","Chen",""],["Liu","Yebin",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 08:06:58 GMT"},{"version":"v2","created":"Wed, 21 Aug 2024 02:15:52 GMT"}],"updateDate":"2024-08-22","timestamp":1719907618000,"abstract":"  Despite significant strides in the field of 3D scene editing, current methods\nencounter substantial challenge, particularly in preserving 3D consistency in\nmulti-view editing process. To tackle this challenge, we propose a progressive\n3D editing strategy that ensures multi-view consistency via a\nTrajectory-Anchored Scheme (TAS) with a dual-branch editing mechanism.\nSpecifically, TAS facilitates a tightly coupled iterative process between 2D\nview editing and 3D updating, preventing error accumulation yielded from\ntext-to-image process. Additionally, we explore the relationship between\noptimization-based methods and reconstruction-based methods, offering a unified\nperspective for selecting superior design choice, supporting the rationale\nbehind the designed TAS. We further present a tuning-free View-Consistent\nAttention Control (VCAC) module that leverages cross-view semantic and\ngeometric reference from the source branch to yield aligned views from the\ntarget branch during the editing of 2D views. To validate the effectiveness of\nour method, we analyze 2D examples to demonstrate the improved consistency with\nthe VCAC module. Further extensive quantitative and qualitative results in\ntext-guided 3D scene editing indicate that our method achieves superior editing\nquality compared to state-of-the-art methods. We will make the complete\ncodebase publicly available following the conclusion of the review process.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"gDXLlsoy7BZaABXiCyz6RU87ebpEIbYpHSje0VCLAFw","pdfSize":"33458543","objectId":"0xe0112b94bbb3da8b22fb4d5a5d5de2fca6f5d0c492cc1a578f96c608c9235123","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
