{"id":"2407.00566","title":"Frontiers in integrative structural biology: modeling disordered\n  proteins and utilizing in situ data","authors":"Kartik Majila, Shreyas Arvindekar, Muskaan Jindal, and Shruthi\n  Viswanath","authorsParsed":[["Majila","Kartik",""],["Arvindekar","Shreyas",""],["Jindal","Muskaan",""],["Viswanath","Shruthi",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 02:36:45 GMT"}],"updateDate":"2024-07-02","timestamp":1719715005000,"abstract":"  Integrative modeling enables structure determination for large macromolecular\nassemblies by combining data from multiple sources of experiment data with\ntheoretical and computational predictions. Recent advancements in AI-based\nstructure prediction and electron cryo-microscopy have sparked renewed\nenthusiasm for integrative modeling; structures from AI-based methods can be\nintegrated with in situ maps to characterize large assemblies. This approach\npreviously allowed us and others to determine the architectures of diverse\nmacromolecular assemblies, such as nuclear pore complexes, chromatin\nremodelers, and cell-cell junctions. Experimental data spanning several scales\nwas used in these studies, ranging from high-resolution data, such as X-ray\ncrystallography and Alphafold structures, to low-resolution data, such as\ncryo-electron tomography maps and data from co-immunoprecipitation experiments.\nTwo recurrent modeling challenges emerged across a range of studies. First,\nmodeling disordered regions, which constituted a significant portion of these\nassemblies, necessitated the development of new methods. Second, methods needed\nto be developed to utilize the information from cryo-electron tomography, a\ntimely challenge as structural biology is increasingly moving towards in situ\ncharacterization. Here, we recapitulate recent developments in the modeling of\ndisordered proteins and the analysis of cryo-electron tomography data and\nhighlight opportunities for method development in the context of integrative\nmodeling.\n","subjects":["Quantitative Biology/Biomolecules"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"n12p-yP58Gb64ZvmSdC9KohkT91Rb2AMLIIJM7A7jlc","pdfSize":"1515839","objectId":"0xf448928381fc057030a1e92653f4dfb57a5f32ef9ef1b9a179a009f4d1a6733a","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
