{"id":"2407.03866","title":"On Krylov Complexity","authors":"A. S\\'anchez-Garrido","authorsParsed":[["Sánchez-Garrido","A.",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 11:57:29 GMT"}],"updateDate":"2024-07-08","timestamp":1720094249000,"abstract":"  This Thesis explores the notion of Krylov complexity as a probe of quantum\nchaos and as a candidate for holographic complexity. The first Part is devoted\nto presenting the fundamental notions required to conduct research in this\narea. Namely, an extensive introduction to the Lanczos algorithm, its\nproperties and associated algebraic structures, as well as technical details\nrelated to its practical implementation, is given. Subsequently, an overview of\nthe seminal references and the main debates regarding Krylov complexity and its\nrelation to chaos and holography is provided. The text throughout this first\nPart combines review material with original analyses which either intend to\ncontextualize, compare and criticize results in the literature, or are the\nfruit of the investigations leading to the publications on which this Thesis is\nbased. These research projects are the subject of the second Part of the\nmanuscript. In them, methods for the efficient implementation of the Lanczos\nalgorithm in finite many-body systems were developed, allowing to compute\nnumerically the Krylov complexity of models like SYK or the XXZ spin chain up\nto time scales exponentially large in system size. It was observed that the\noperator Krylov complexity profile in SYK, a paradigmatic low-dimensional\nchaotic system with a holographic dual, agrees with holographic expectations,\nwhile in the case of integrable models like XXZ complexity is affected by a\nnovel localization effect in the so-called Krylov space which hinders its\ngrowth. Finally, an exact, analytical, correspondence between the Krylov\ncomplexity of the infinite-temperature thermofield double state in the\nlow-energy regime of the double-scaled SYK model and bulk length in the theory\nof JT gravity is established.\n","subjects":["Physics/High Energy Physics - Theory","Condensed Matter/Strongly Correlated Electrons","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"m6Yy3K_ey6ReWrVcZnQKg5dx2K0A_JNp0j8o8D0TiIQ","pdfSize":"26424910"}
