{"id":"2407.10152","title":"Mitigating Translationese in Low-resource Languages: The Storyboard\n  Approach","authors":"Garry Kuwanto, Eno-Abasi E. Urua, Priscilla Amondi Amuok, Shamsuddeen\n  Hassan Muhammad, Anuoluwapo Aremu, Verrah Otiende, Loice Emma Nanyanga,\n  Teresiah W. Nyoike, Aniefon D. Akpan, Nsima Ab Udouboh, Idongesit Udeme\n  Archibong, Idara Effiong Moses, Ifeoluwatayo A. Ige, Benjamin Ajibade,\n  Olumide Benjamin Awokoya, Idris Abdulmumin, Saminu Mohammad Aliyu, Ruqayya\n  Nasir Iro, Ibrahim Said Ahmad, Deontae Smith, Praise-EL Michaels, David\n  Ifeoluwa Adelani, Derry Tanti Wijaya, and Anietie Andy","authorsParsed":[["Kuwanto","Garry",""],["Urua","Eno-Abasi E.",""],["Amuok","Priscilla Amondi",""],["Muhammad","Shamsuddeen Hassan",""],["Aremu","Anuoluwapo",""],["Otiende","Verrah",""],["Nanyanga","Loice Emma",""],["Nyoike","Teresiah W.",""],["Akpan","Aniefon D.",""],["Udouboh","Nsima Ab",""],["Archibong","Idongesit Udeme",""],["Moses","Idara Effiong",""],["Ige","Ifeoluwatayo A.",""],["Ajibade","Benjamin",""],["Awokoya","Olumide Benjamin",""],["Abdulmumin","Idris",""],["Aliyu","Saminu Mohammad",""],["Iro","Ruqayya Nasir",""],["Ahmad","Ibrahim Said",""],["Smith","Deontae",""],["Michaels","Praise-EL",""],["Adelani","David Ifeoluwa",""],["Wijaya","Derry Tanti",""],["Andy","Anietie",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 10:47:03 GMT"}],"updateDate":"2024-07-16","timestamp":1720954023000,"abstract":"  Low-resource languages often face challenges in acquiring high-quality\nlanguage data due to the reliance on translation-based methods, which can\nintroduce the translationese effect. This phenomenon results in translated\nsentences that lack fluency and naturalness in the target language. In this\npaper, we propose a novel approach for data collection by leveraging\nstoryboards to elicit more fluent and natural sentences. Our method involves\npresenting native speakers with visual stimuli in the form of storyboards and\ncollecting their descriptions without direct exposure to the source text. We\nconducted a comprehensive evaluation comparing our storyboard-based approach\nwith traditional text translation-based methods in terms of accuracy and\nfluency. Human annotators and quantitative metrics were used to assess\ntranslation quality. The results indicate a preference for text translation in\nterms of accuracy, while our method demonstrates worse accuracy but better\nfluency in the language focused.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"a_CCP1S5d0hTeS86i0NRTx58VR8W6CgpFE48j9rE6Bc","pdfSize":"658380","objectId":"0x601d3a1a2bdef3a5ef64de20d162d9cfba65b621f59ef769b2183e93af6b1755","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
