{"id":"2407.14285","title":"PineAPPL Grids of Open Heavy-Flavor Production in the GM-VFNS","authors":"Jan Wissmann, Tom\\'a\\v{s} Je\\v{z}o, Ingo Schienbein, Hubert\n  Spiesberger and Michael Klasen","authorsParsed":[["Wissmann","Jan",""],["Ježo","Tomáš",""],["Schienbein","Ingo",""],["Spiesberger","Hubert",""],["Klasen","Michael",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 13:14:05 GMT"}],"updateDate":"2024-07-22","timestamp":1721394845000,"abstract":"  Many next-to-leading order QCD predictions are available through Monte Carlo\n(MC) simulations. Usually, multiple CPU hours are needed to calculate\npredictions at a required precision, which is unfeasible for global PDF\nanalyses. This problem is solved by a process known as gridding: The values of\nthe hard-scattering cross-section are calculated only once with the MC program,\nand then interpolated and stored in look-up tables (grids) of the kinematical\nvariables. To obtain the physical predictions, they are convolved with the PDFs\n(e.g. during the fitting stage in a PDF global analysis), which takes a tiny\nfraction of the time needed to calculate the MC results. This is possible with\nPineAPPL, a library tackling the aforementioned process of grid creation and\nconvolution. In this work, we use PineAPPL to grid the predictions for open\nheavy-flavor production in the general-mass variable-flavor-number scheme\n(GM-VFNS). In the GM-VFNS, the differential cross-section interpolates between\nthe fixed-flavor-number scheme (FFNS) and the zero-mass variable-flavor-number\nscheme (ZM-VFNS). These are each only valid in different kinematical regions,\nin which the GM-VFNS cross-section reproduces the FFNS and ZM-VFNS as the\nlimiting cases of high energies and small masses, respectively. Better than\npermille agreement is achieved between the grids and the MC predictions, while\nat the same time not substantially increasing the time of the MC calculations.\n","subjects":["Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"rqtLMIC6mmP3lAfMaxL9c8ZSTcZ709MD_vHyLWsFDDU","pdfSize":"482100"}