{"id":"2407.20565","title":"Theoretical analysis of stress perturbations from a partially-lubricated\n  viscous gravity current","authors":"Joshua H. Rines, Ching-Yao Lai, Yongji Wang","authorsParsed":[["Rines","Joshua H.",""],["Lai","Ching-Yao",""],["Wang","Yongji",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 05:40:49 GMT"}],"updateDate":"2024-07-31","timestamp":1722318049000,"abstract":"  We present a theoretical investigation into the dynamics of a viscous gravity\ncurrent subjected to spatially-finite lubrication (i.e., a `slippery patch').\nThe work is motivated by grounded ice sheets flowing across patches of basal\nmeltwater which reduce the ice-bed frictional coupling, causing perturbations\nenhancing ice motion, with implications for increased ice flux into the ocean\nand sea level rise. The flow is characterized by transitions between shear- and\nextension-dominated dynamics, which necessitates boundary-layer solutions at\nthe transition points. We develop a depth-integrated analytical model of\nNewtonian flow which concisely reveals fundamental relationships between ice\nsheet geometry (thickness, surface slope, and slippery patch length) and the\nmagnitude and spatial extent of resulting horizontal deviatoric stresses. This\nreduced-order analytical model shows good quantitative agreement with numerical\nsimulations using 2-D Newtonian Stokes equations, which are further extended to\nthe case of a non-Newtonian flow. From the reduced-order model, we rationalize\nthat the slippery patch-induced stress perturbations are exponentially-decaying\nfunctions of distance upstream away from the patch onset. We also show that the\namplitude of the perturbation scales linearly with the surface slope and patch\nlength while the decay lengthscale scales linearly with ice thickness. These\nfundamental relationships have implications for the response of the Greenland\nIce Sheet to the inland expansion of basal meltwater presence over the coming\nwarming decades.\n","subjects":["Physics/Fluid Dynamics","Physics/Geophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"LI-TBUXSdnsJs8fOHVn_B3WEqr3H3_VDLDwJi7ISFIA","pdfSize":"6185737"}