{"id":"2407.16217","title":"Characterization of the SCR-1 Stellarator Physics: Investigating Plasma\n  Discharge, MHD Equilibrium Calculations, and O-X-B Mode Conversion\n  Feasibility","authors":"R. Solano-Piedra (1 and 2), V. I. Vargas (1 and 2), L. A. Araya-Solano\n  (1 and 2), F. V\\'ilchez-Coto (2) ((1) School of Physics, Costa Rica Institute\n  of Technology, Campus Cartago, CR, (2) Plasma Laboratory for Fusion Energy\n  and Applications, Costa Rica Institute of Technology, Campus Cartago, CR)","authorsParsed":[["Solano-Piedra","R.","","1 and 2"],["Vargas","V. I.","","1 and 2"],["Araya-Solano","L. A.","","1 and 2"],["Vílchez-Coto","F.",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 06:46:38 GMT"}],"updateDate":"2024-07-24","timestamp":1721717198000,"abstract":"  The Stellarator de Costa Rica 1 (SCR-1) is a modular stellarator with a small\naspect ratio that serves as a valuable research and training tool for plasma\nmagnetic confinement. This study explored a new heating mechanism and the\nfactors that influence it. The current state of the device and plasma discharge\nare initially presented. Subsequently, the measurement process was utilized to\ndetermine radial profiles of electron density and electron temperature using a\nsingle Langmuir probe, and the results were compared with theoretical\npredictions based on the particle and energy balance. Additionally, the VMEC\ncode was employed to calculate magnetic flux surfaces with characteristics such\nas a low aspect ratio, low beta parameter, negative magnetic shear, and\ndecreasing rotational transform along magnetic flux surfaces. The Mercier\ncriterion was employed to conduct a linear stability analysis, which identified\na magnetic well that played a crucial role in the linear stability of the\nmajority of magnetic flux surfaces. Feasibility studies of electron Bernstein\nwaves were conducted using the IPF-FMDC full-wave code, with input files\ngenerated from the device and known plasma characteristics. The results\nobtained from the IPF-FMDC full-wave code revealed that the O-X conversion\npercentage reached a maximum of 63 % when considering radiation reflection in\nthe vacuum vessel. Significant effects of plasma curvature on the O-X wave\nconversion and normalized electron density scale length were observed, while\nthe change in the SCR-1 heating position did not produce a significant impact.\nThree damping mechanisms affecting O-X conversion were studied, and one of the\nprincipal effects was the SX-FX conversion due to steep electron density\ngradient. Additionally, stochastic electron heating showed a low electron field\namplitude, which is important for limiting the electron Bernstein wave\npropagation.\n","subjects":["Physics/Plasma Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"JWa75DfIQlFrmada-EDLGPiCj9UTETUMZfCMZV05r-w","pdfSize":"6417927"}