{"id":"2407.18809","title":"Joint Slot and Power Optimization for Grant Free Random Access with\n  Unknown and Heterogeneous Device Activity","authors":"Alix Jeannerot, Malcolm Egan and Jean-Marie Gorce","authorsParsed":[["Jeannerot","Alix",""],["Egan","Malcolm",""],["Gorce","Jean-Marie",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 15:20:31 GMT"}],"updateDate":"2024-07-29","timestamp":1722007231000,"abstract":"  Grant Free Random Access (GFRA) is a popular protocol in the Internet of\nThings (IoT) to reduce the control signaling. GFRA is a framed protocol where\neach frame is split into two parts: device identification; and data\ntransmission part which can be viewed as a form of Frame Slotted ALOHA (FSA). A\ncommon assumption in FSA is device homogeneity; that is the probability that a\ndevice seeks to transmit data in a particular frame is common for all devices\nand independent of the other devices. Recent work has investigated the\npossibility of tuning the FSA protocol to the statistics of the network by\nchanging the probability for a particular device to access a particular slot.\nHowever, power control with a successive interference cancellation (SIC)\nreceiver has not yet been considered to further increase the performance of the\ntuned FSA protocols. In this paper, we propose algorithms to jointly optimize\nboth the slot selection and the transmit power of the devices to minimize the\noutage of the devices in the network. We show via a simulation study that our\nalgorithms can outperform baselines (including slotted ALOHA) in terms of\nexpected number of devices transmitting without outage and in term of transmit\npower.\n","subjects":["Computing Research Repository/Information Theory","Computing Research Repository/Networking and Internet Architecture","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"kicDyX5VE6y0V2L29om5YPCIaudOVuuQ2dC2MrAPPYY","pdfSize":"349573","objectId":"0xc24c6e43e1620884466cfa3015e0adcfe63e592f009f03433c020f577db4dfdc","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
