{"id":"2407.14526","title":"A Random Matrix Model for a Family of Cusp Forms","authors":"Owen Barrett, Zo\\\"e X. Batterman, Aditya Jambhale, Steven J. Miller,\n  Akash L. Narayanan, Kishan Sharma, Chris Yao","authorsParsed":[["Barrett","Owen",""],["Batterman","Zoë X.",""],["Jambhale","Aditya",""],["Miller","Steven J.",""],["Narayanan","Akash L.",""],["Sharma","Kishan",""],["Yao","Chris",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 04:11:32 GMT"}],"updateDate":"2024-07-23","timestamp":1720411892000,"abstract":"  The Katz-Sarnak philosophy states that statistics of zeros of $L$-function\nfamilies near the central point as the conductors tend to infinity agree with\nthose of eigenvalues of random matrix ensembles as the matrix size tends to\ninfinity. While numerous results support this conjecture, S. J. Miller observed\nthat for finite conductors, very different behavior can occur for zeros near\nthe central point in elliptic curve $L$-function families. This led to the\ncreation of the excised model of Due\\~{n}ez, Huynh, Keating, Miller, and\nSnaith, whose predictions for quadratic twists of a given elliptic curve are\nwell fit by the data. The key ingredients are relating the discretization of\ncentral values of the $L$-functions to excising matrices based on the value of\nthe characteristic polynomials at 1 and using lower order terms (in statistics\nsuch as the one-level density and pair-correlation) to adjust the matrix size.\nWe extended this model for a family of twists of an $L$-function associated to\na given holomorphic cuspidal newform of odd prime level and arbitrary weight.\nWe derive the corresponding \"effective\" matrix size for a given form by\ncomputing the one-level density and pair-correlation statistics for a chosen\nfamily of twists, and we show there is no repulsion for forms with weight\ngreater than 2 and principal nebentype. We experimentally verify the accuracy\nof the model, and as expected, our model recovers the elliptic curve model.\n","subjects":["Mathematics/Number Theory"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"aRw5vL_yHCpPVXYnbdn-IcJI1N0pt2uizyCrAjZoC2c","pdfSize":"1093595"}