{"id":"2407.16234","title":"A Multi-view Mask Contrastive Learning Graph Convolutional Neural\n  Network for Age Estimation","authors":"Yiping Zhang, Yuntao Shou, Tao Meng, Wei Ai, and Keqin Li","authorsParsed":[["Zhang","Yiping",""],["Shou","Yuntao",""],["Meng","Tao",""],["Ai","Wei",""],["Li","Keqin",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 07:17:46 GMT"}],"updateDate":"2024-07-24","timestamp":1721719066000,"abstract":"  The age estimation task aims to use facial features to predict the age of\npeople and is widely used in public security, marketing, identification, and\nother fields. However, the features are mainly concentrated in facial\nkeypoints, and existing CNN and Transformer-based methods have inflexibility\nand redundancy for modeling complex irregular structures. Therefore, this paper\nproposes a Multi-view Mask Contrastive Learning Graph Convolutional Neural\nNetwork (MMCL-GCN) for age estimation. Specifically, the overall structure of\nthe MMCL-GCN network contains a feature extraction stage and an age estimation\nstage. In the feature extraction stage, we introduce a graph structure to\nconstruct face images as input and then design a Multi-view Mask Contrastive\nLearning (MMCL) mechanism to learn complex structural and semantic information\nabout face images. The learning mechanism employs an asymmetric siamese network\narchitecture, which utilizes an online encoder-decoder structure to reconstruct\nthe missing information from the original graph and utilizes the target encoder\nto learn latent representations for contrastive learning. Furthermore, to\npromote the two learning mechanisms better compatible and complementary, we\nadopt two augmentation strategies and optimize the joint losses. In the age\nestimation stage, we design a Multi-layer Extreme Learning Machine (ML-IELM)\nwith identity mapping to fully use the features extracted by the online\nencoder. Then, a classifier and a regressor were constructed based on ML-IELM,\nwhich were used to identify the age grouping interval and accurately estimate\nthe final age. Extensive experiments show that MMCL-GCN can effectively reduce\nthe error of age estimation on benchmark datasets such as Adience, MORPH-II,\nand LAP-2016.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"WmYZQVEOldtpmuZluL8qcSxVLoeD7dg7dk9JPREN1oQ","pdfSize":"1872150","objectId":"0x2735e14b7f870f88413274e53b5c849072e0eb4d7e2d44a33cd5d25d0ccbdc90","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
