{"id":"2407.19615","title":"Improving Pulsar Timing Precision with Single Pulse Fluence Clustering","authors":"Sofia V. Sosa Fiscella, Michael T. Lam, Maura A. McLaughlin","authorsParsed":[["Fiscella","Sofia V. Sosa",""],["Lam","Michael T.",""],["McLaughlin","Maura A.",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 00:17:23 GMT"}],"updateDate":"2024-07-30","timestamp":1722212243000,"abstract":"  Traditional pulsar timing techniques involve averaging large numbers of\nsingle pulses to obtain a high signal-to-noise (S/N) profile, which is matched\nto a template to measure a time of arrival (TOA). However, the morphology of\nindividual single pulses varies greatly due to pulse jitter. Pulses of\ndifferent fluence contribute differently to the S/N of the pulse average. Our\nstudy proposes a method that accounts for these variations by identifying a\nrange of states and timing each separately. We selected two 1-hour observations\nof PSR J2145-0750, each in a different frequency band with the Green Bank\nTelescope. We normalized the pulse amplitudes to account for scintillation\neffects and probed different excision algorithms to reduce radio-frequency\ninterference. We then measured four pulse parameters (amplitude, position,\nwidth, and energy) to classify the single pulses using automated clustering\nalgorithms. For each cluster, we calculated an average pulse profile and\ntemplate and used both to obtain a TOA and TOA error. Finally, we computed the\nweighted average TOA and TOA error, the latter as a metric of the total timing\nprecision for the epoch. The TOA is shifted relative to the one obtained\nwithout clustering, and we can estimate the shift with this weighting using the\nsame data. For the 820 MHz and 1400 MHz bands, we obtained TOA uncertainties of\n0.057 microseconds and 0.46 microseconds, compared to 0.066 microseconds and\n0.74 microseconds when no clustering is applied. We conclude that tailoring\nthis method could help improve the timing precision for certain bright pulsars\nin NANOGrav's dataset.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"wh76Ae1VyV2QAE1uqT07OR2JAHRAmJoKR2hFcEjz04o","pdfSize":"1756411"}