{"id":"2407.13632","title":"Data Alchemy: Mitigating Cross-Site Model Variability Through Test Time\n  Data Calibration","authors":"Abhijeet Parida, Antonia Alomar, Zhifan Jiang, Pooneh Roshanitabrizi,\n  Austin Tapp, Maria Ledesma-Carbayo, Ziyue Xu, Syed Muhammed Anwar, Marius\n  George Linguraru, Holger R. Roth","authorsParsed":[["Parida","Abhijeet",""],["Alomar","Antonia",""],["Jiang","Zhifan",""],["Roshanitabrizi","Pooneh",""],["Tapp","Austin",""],["Ledesma-Carbayo","Maria",""],["Xu","Ziyue",""],["Anwar","Syed Muhammed",""],["Linguraru","Marius George",""],["Roth","Holger R.",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 16:03:59 GMT"}],"updateDate":"2024-07-19","timestamp":1721318639000,"abstract":"  Deploying deep learning-based imaging tools across various clinical sites\nposes significant challenges due to inherent domain shifts and regulatory\nhurdles associated with site-specific fine-tuning. For histopathology, stain\nnormalization techniques can mitigate discrepancies, but they often fall short\nof eliminating inter-site variations. Therefore, we present Data Alchemy, an\nexplainable stain normalization method combined with test time data calibration\nvia a template learning framework to overcome barriers in cross-site analysis.\nData Alchemy handles shifts inherent to multi-site data and minimizes them\nwithout needing to change the weights of the normalization or classifier\nnetworks. Our approach extends to unseen sites in various clinical settings\nwhere data domain discrepancies are unknown. Extensive experiments highlight\nthe efficacy of our framework in tumor classification in hematoxylin and\neosin-stained patches. Our explainable normalization method boosts\nclassification tasks' area under the precision-recall curve(AUPR) by 0.165,\n0.545 to 0.710. Additionally, Data Alchemy further reduces the multisite\nclassification domain gap, by improving the 0.710 AUPR an additional 0.142,\nelevating classification performance further to 0.852, from 0.545. Our Data\nAlchemy framework can popularize precision medicine with minimal operational\noverhead by allowing for the seamless integration of pre-trained deep\nlearning-based clinical tools across multiple sites.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"ru4Mb5M9xOU4fvNGD4QQ9AzJstfXGMrbnHEHaPNAcm8","pdfSize":"11115193"}