{"id":"2407.03649","title":"Scale-Dependent Dynamic Alignment in MHD Turbulence: Insights into\n  Intermittency, Compressibility, and Imbalance Effects","authors":"Nikos Sioulas, Marco Velli, Alfred Mallet, Trevor A. Bowen, B. D. G.\n  Chandran, Chen Shi, S. S. Cerri, Ioannis Liodis, Tamar Ervin, Davin E. Larson","authorsParsed":[["Sioulas","Nikos",""],["Velli","Marco",""],["Mallet","Alfred",""],["Bowen","Trevor A.",""],["Chandran","B. D. G.",""],["Shi","Chen",""],["Cerri","S. S.",""],["Liodis","Ioannis",""],["Ervin","Tamar",""],["Larson","Davin E.",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 05:44:45 GMT"}],"updateDate":"2024-07-08","timestamp":1720071885000,"abstract":"  Scale-Dependent Dynamic Alignment (SDDA) in Els\\\"asser field fluctuations is\ntheorized to suppress nonlinearities and modulate the energy spectrum. Limited\nempirical evidence exists for SDDA within the solar wind turbulence's inertial\nrange. We analyzed data from the WIND mission to assess the effects of\ncompressibility, intermittency, and imbalance on SDDA. SDDA consistently\nappears at energy-containing scales, with a trend toward misalignment at\ninertial scales. Compressible fluctuations show no increased alignment;\nhowever, their impact on SDDA's overall behavior is minimal. The alignment\nangles inversely correlate with field gradient intensity, likely due to\n\"anomalous\" or \"counterpropagating\" wave packet interactions. This suggests\nthat SDDA originates from mutual shearing of Els\\\"asser fields during\nimbalanced ($\\delta \\boldsymbol{z}^{\\pm} \\gg \\delta \\boldsymbol{z}^{\\mp}$)\ninteractions. Rigorous thresholding on field gradient intensity reveals SDDA\nsignatures across much of the inertial range. The scaling of Els\\\"asser\nincrements' alignment angle, $\\Theta^{z}$, steepens with increasing global\nAlfv\\'enic imbalance, while the angle between magnetic and velocity field\nincrements, $\\Theta^{ub}$, becomes shallower. $\\Theta^{ub}$ only correlates\nwith global Els\\\"asser imbalance, steepening as the imbalance increases.\nFurthermore, increasing alignment in $\\Theta^{ub}$ persists deep into the\ninertial range of balanced intervals but collapses at large scales for\nimbalanced ones. Simplified theoretical analysis and modeling of\nhigh-frequency, low-amplitude noise in the velocity field indicate significant\nimpacts on alignment angle measurements even at very low frequencies, with\neffects growing as global imbalance increases.\n","subjects":["Physics/Space Physics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"sq1tou5fVeuWXZBlUm0f4LXX_kkTHZrG-THR8Ujn61k","pdfSize":"7807238"}