{"id":"2407.20357","title":"Are isolated compact galaxy groups special?","authors":"Matthieu Tricottet, Gary A. Mamon, Eugenia D\\'iaz-Gim\\'enez","authorsParsed":[["Tricottet","Matthieu",""],["Mamon","Gary A.",""],["Díaz-Giménez","Eugenia",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 18:16:05 GMT"},{"version":"v2","created":"Wed, 31 Jul 2024 11:24:00 GMT"},{"version":"v3","created":"Thu, 1 Aug 2024 10:11:15 GMT"}],"updateDate":"2024-08-02","timestamp":1722276965000,"abstract":"  It is often believed that isolated, compact groups of galaxies (CGs) are\nspecial systems. But CGs have rarely been compared to regular groups, which are\nselected very differently. We study the global properties of a subsample of 80\ngroups of four members (CG4s), as well as their correlations, within the HMCG\nHickson-like sample of compact groups, and compare them with those of the\nregular groups of Lim et al.. The latter are split into three control samples,\ncomplete in redshift and magnitude: one with the four brightest members, one\nwith the four closest members to the brightest group galaxy (BGG) with less\nthan three magnitudes in range (Control4Cs), and one with exactly four members\n(RG4s). The vast majority of CG4s are located within regular groups, and a\nlarge preponderance of the BGGs of these CG4s are the same as those of their\nhost groups. CG4s are smaller than the groups of all other samples and more\nluminous than RG4s, both results as expected from their selection as high\nsurface brightness systems. However, CG4s have similar luminosities as\nControl4Cs. CG4s also have higher velocity dispersions, probably because of a\ntoo permissive redshift accordance criterion. The BGGs of CG4s are not more\ndominant in luminosity than those of RG4s, but they are significantly more\noffset relative to the group size, because the Lim groups are built around\ntheir BGGs. In summary, compact groups have similar properties to the regular\ngroups of four galaxies and to the cores of regular groups, once selection\ncriteria of CGs are considered. A large fraction of CGs are the cores of\nregular groups, isolated on the sky by construction, but rarely isolated in\nreal space (from simulations), indicating that they are often plagued by chance\nalignments of host groups galaxies along the line of sight.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"MJuuDMGXi-lufQ2qGO9c54KtshqNDTBVNqSaug4t_78","pdfSize":"1392853"}