{"id":"2407.03604","title":"Lateralization LoRA: Interleaved Instruction Tuning with\n  Modality-Specialized Adaptations","authors":"Zhiyang Xu, Minqian Liu, Ying Shen, Joy Rimchala, Jiaxin Zhang, Qifan\n  Wang, Yu Cheng, Lifu Huang","authorsParsed":[["Xu","Zhiyang",""],["Liu","Minqian",""],["Shen","Ying",""],["Rimchala","Joy",""],["Zhang","Jiaxin",""],["Wang","Qifan",""],["Cheng","Yu",""],["Huang","Lifu",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 03:28:22 GMT"}],"updateDate":"2024-07-08","timestamp":1720063702000,"abstract":"  Recent advancements in Vision-Language Models (VLMs) have led to the\ndevelopment of Vision-Language Generalists (VLGs) capable of understanding and\ngenerating interleaved images and text. Despite these advances, VLGs still\nstruggle to follow user instructions for interleaved text and image generation.\nTo address this issue, we introduce LeafInstruct, the first open-sourced\ninterleaved instruction tuning data with over 30,000 high-quality instances\nacross more than 10 domains. Due to the extensive size of existing VLGs, we opt\nfor parameter-efficient tuning. However, we observe that VLGs tuned with a\nstandard LoRA typically exhibit inferior performance in interleaved text-image\ngeneration. We attribute this problem to modality interference and the lack of\nmodality-specialized adaptation design. Hence, we propose Lateralization LoRA,\na novel modality-specialized adaptation method inspired by the concept of brain\nlateralization. Lateralization LoRA employs a hybrid approach, combining the\ntraditional linear LoRA and a Convolutional LoRA for generating text and\nimages, enabling the generation of high-quality text and images by leveraging\nmodality-specific structures and parameter sets. We perform instruction tuning\nof the VLG (i.e., EMU2) using Lateralization LoRA on the LeafInstruct dataset.\nExtensive experiments demonstrate that EMU2 tuned with Lateralization LoRA\nachieve state-of-the-art performance, significantly surpassing baseline models\nin complex interleaved tasks.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"stUktyL8nJa9kG3Qn-1AUoCDFp5FJG4sh5qOaTP5XEk","pdfSize":"1916363"}