{"id":"2407.14055","title":"Quantum Hamiltonian Embedding of Images for Data Reuploading Classifiers","authors":"Peiyong Wang, Casey R. Myers, Lloyd C. L. Hollenberg, Udaya Parampalli","authorsParsed":[["Wang","Peiyong",""],["Myers","Casey R.",""],["Hollenberg","Lloyd C. L.",""],["Parampalli","Udaya",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 06:31:22 GMT"},{"version":"v2","created":"Thu, 1 Aug 2024 02:19:08 GMT"}],"updateDate":"2024-08-02","timestamp":1721370682000,"abstract":"  When applying quantum computing to machine learning tasks, one of the first\nconsiderations is the design of the quantum machine learning model itself.\nConventionally, the design of quantum machine learning algorithms relies on the\n``quantisation\" of classical learning algorithms, such as using quantum linear\nalgebra to implement important subroutines of classical algorithms, if not the\nentire algorithm, seeking to achieve quantum advantage through possible\nrun-time accelerations brought by quantum computing. However, recent research\nhas started questioning whether quantum advantage via speedup is the right goal\nfor quantum machine learning [1]. Research also has been undertaken to exploit\nproperties that are unique to quantum systems, such as quantum contextuality,\nto better design quantum machine learning models [2]. In this paper, we take an\nalternative approach by incorporating the heuristics and empirical evidences\nfrom the design of classical deep learning algorithms to the design of quantum\nneural networks. We first construct a model based on the data reuploading\ncircuit [3] with the quantum Hamiltonian data embedding unitary [4]. Through\nnumerical experiments on images datasets, including the famous MNIST and\nFashionMNIST datasets, we demonstrate that our model outperforms the quantum\nconvolutional neural network (QCNN)[5] by a large margin (up to over 40% on\nMNIST test set). Based on the model design process and numerical results, we\nthen laid out six principles for designing quantum machine learning models,\nespecially quantum neural networks.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"it41PP_2niPpnB1LN5xvh3WR-yRfHKoG95vO19oZrfU","pdfSize":"1413454"}