{"id":"2407.03136","title":"Ultra-Lightweight Collaborative Mapping for Robot Swarms","authors":"Vlad Niculescu, Tommaso Polonelli, Michele Magno, Luca Benini","authorsParsed":[["Niculescu","Vlad",""],["Polonelli","Tommaso",""],["Magno","Michele",""],["Benini","Luca",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 14:14:26 GMT"},{"version":"v2","created":"Mon, 26 Aug 2024 22:05:49 GMT"}],"updateDate":"2024-08-28","timestamp":1720016066000,"abstract":"  A key requirement in robotics is the ability to simultaneously self-localize\nand map a previously unknown environment, relying primarily on onboard sensing\nand computation. Achieving fully onboard accurate simultaneous localization and\nmapping (SLAM) is feasible for high-end robotic platforms, whereas small and\ninexpensive robots face challenges due to constrained hardware, therefore\nfrequently resorting to external infrastructure for sensing and computation.\nThe challenge is further exacerbated in swarms of robots, where coordination,\nscalability, and latency are crucial concerns. This work introduces a\ndecentralized and lightweight collaborative SLAM approach that enables mapping\non virtually any robot, even those equipped with low-cost hardware and only 1.5\nMB of memory, including miniaturized insect-size devices. Moreover, the\nproposed solution supports large swarm formations with the capability to\ncoordinate hundreds of agents. To substantiate our claims, we have successfully\nimplemented collaborative SLAM on centimeter-size drones weighing 46 g.\nRemarkably, we achieve a mapping accuracy below 30 cm, a result comparable to\nhigh-end state-of-the-art solutions while reducing the cost, memory, and\ncomputation requirements by two orders of magnitude. Our approach is innovative\nin three main aspects. First, it enables onboard infrastructure-less\ncollaborative mapping with a lightweight and cost-effective (\\$20) solution in\nterms of sensing and computation. Second, we optimize the data traffic within\nthe swarm to support hundreds of cooperative agents using standard wireless\nprotocols such as ultra-wideband (UWB), Bluetooth, or WiFi. Last, we implement\na distributed swarm coordination policy to decrease mapping latency and enhance\naccuracy.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"3BTWnhbKSRbE4h5hQwfb62oAOF4ziXHUtuDOxnablno","pdfSize":"11764886"}