{"id":"2407.08245","title":"Feature Diversification and Adaptation for Federated Domain\n  Generalization","authors":"Seunghan Yang, Seokeon Choi, Hyunsin Park, Sungha Choi, Simyung Chang,\n  Sungrack Yun","authorsParsed":[["Yang","Seunghan",""],["Choi","Seokeon",""],["Park","Hyunsin",""],["Choi","Sungha",""],["Chang","Simyung",""],["Yun","Sungrack",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 07:45:10 GMT"}],"updateDate":"2024-07-12","timestamp":1720683910000,"abstract":"  Federated learning, a distributed learning paradigm, utilizes multiple\nclients to build a robust global model. In real-world applications, local\nclients often operate within their limited domains, leading to a `domain shift'\nacross clients. Privacy concerns limit each client's learning to its own domain\ndata, which increase the risk of overfitting. Moreover, the process of\naggregating models trained on own limited domain can be potentially lead to a\nsignificant degradation in the global model performance. To deal with these\nchallenges, we introduce the concept of federated feature diversification. Each\nclient diversifies the own limited domain data by leveraging global feature\nstatistics, i.e., the aggregated average statistics over all participating\nclients, shared through the global model's parameters. This data\ndiversification helps local models to learn client-invariant representations\nwhile preserving privacy. Our resultant global model shows robust performance\non unseen test domain data. To enhance performance further, we develop an\ninstance-adaptive inference approach tailored for test domain data. Our\nproposed instance feature adapter dynamically adjusts feature statistics to\nalign with the test input, thereby reducing the domain gap between the test and\ntraining domains. We show that our method achieves state-of-the-art performance\non several domain generalization benchmarks within a federated learning\nsetting.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"1VAYUBtdZWEEEIjpI4_yd519iVgAnAVYa8nFsLo8x4Y","pdfSize":"1883593"}