{"id":"2407.19736","title":"Sensor Selection via GFlowNets: A Deep Generative Modeling Framework to\n  Navigate Combinatorial Complexity","authors":"Spilios Evmorfos, Zhaoyi Xu, Athina Petropulu","authorsParsed":[["Evmorfos","Spilios",""],["Xu","Zhaoyi",""],["Petropulu","Athina",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 06:56:57 GMT"}],"updateDate":"2024-07-30","timestamp":1722236217000,"abstract":"  The performance of sensor arrays in sensing and wireless communications\nimproves with more elements, but this comes at the cost of increased energy\nconsumption and hardware expense. This work addresses the challenge of\nselecting $k$ sensor elements from a set of $m$ to optimize a generic\nQuality-of-Service metric. Evaluating all $\\binom{m}{k}$ possible sensor\nsubsets is impractical, leading to prior solutions using convex relaxations,\ngreedy algorithms, and supervised learning approaches. The current paper\nproposes a new framework that employs deep generative modeling, treating sensor\nselection as a deterministic Markov Decision Process where sensor subsets of\nsize $k$ arise as terminal states. Generative Flow Networks (GFlowNets) are\nemployed to model an action distribution conditioned on the state. Sampling\nactions from the aforementioned distribution ensures that the probability of\narriving at a terminal state is proportional to the performance of the\ncorresponding subset. Applied to a standard sensor selection scenario, the\ndeveloped approach outperforms popular methods which are based on convex\noptimization and greedy algorithms. Finally, a multiobjective formulation of\nthe proposed approach is adopted and applied on the sparse antenna array design\nfor Integrated Sensing and Communication (ISAC) systems. The multiobjective\nvariation is shown to perform well in managing the trade-off between radar and\ncommunication performance.\n","subjects":["Computing Research Repository/Machine Learning","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"l1NKmoLTqVQnVzrTqBSBWtmOYtzFBkQhCt7vBWTkbZU","pdfSize":"1120492"}