{"id":"2407.11631","title":"A parallel batch greedy algorithm in reduced basis methods: Convergence\n  rates and numerical results","authors":"Niklas Reich, Karsten Urban, J\\\"urgen Vorloeper","authorsParsed":[["Reich","Niklas",""],["Urban","Karsten",""],["Vorloeper","Jürgen",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 11:50:04 GMT"},{"version":"v2","created":"Thu, 18 Jul 2024 11:28:24 GMT"}],"updateDate":"2024-07-19","timestamp":1721130604000,"abstract":"  The \"classical\" (weak) greedy algorithm is widely used within model order\nreduction in order to compute a reduced basis in the offline training phase: An\na posteriori error estimator is maximized and the snapshot corresponding to the\nmaximizer is added to the basis. Since these snapshots are determined by a\nsufficiently detailed discretization, the offline phase is often\ncomputationally extremely costly. We suggest to replace the serial\ndetermination of one snapshot after the other by a parallel approach. In order\nto do so, we introduce a batch size $b$ and add $b$ snapshots to the current\nbasis in every greedy iteration. These snapshots are computed in parallel. We\nprove convergence rates for this new batch greedy algorithm and compare them to\nthose of the classical (weak) greedy algorithm in the Hilbert and Banach space\ncase. Then, we present numerical results where we apply a (parallel)\nimplementation of the proposed algorithm to the linear elliptic thermal block\nproblem. We analyze the convergence rate as well as the offline and online\nwall-clock times for different batch sizes. We show that the proposed variant\ncan significantly speed-up the offline phase while the size of the reduced\nproblem is only moderately increased. The benefit of the parallel batch greedy\nincreases for more complicated problems.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"iSlwT08V47o1nzoDEETGmcbyD7Z4zR7eFGuN4GPU5V0","pdfSize":"344709"}