{"id":"2407.11378","title":"A flux-independent increase in outflows prior to the emergence of active\n  regions on the Sun","authors":"Hannah Schunker, William Roland-Batty, Aaron C. Birch, Douglas C.\n  Braun, Robert H. Cameron, L. Gizon","authorsParsed":[["Schunker","Hannah",""],["Roland-Batty","William",""],["Birch","Aaron C.",""],["Braun","Douglas C.",""],["Cameron","Robert H.",""],["Gizon","L.",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 04:45:05 GMT"}],"updateDate":"2024-07-17","timestamp":1721105105000,"abstract":"  Emerging active regions are associated with convective flows on the spatial\nscale and lifetimes of supergranules. To understand how these flows are\ninvolved in the formation of active regions, we aim to identify where active\nregions emerge in the supergranulation flow pattern. We computed\nsupergranulation scale flow maps at the surface for all active regions in the\nSolar Dynamics Observatory Helioseismic Emerging Active Region Survey. We\nclassified each of the active regions into four bins, based on the amplitude of\ntheir average surface flow divergence at emergence. We then averaged the flow\ndivergence over the active regions in each bin as a function of time. We also\nconsidered a corresponding set of control regions. We found that, on average,\nthe flow divergence increases during the day prior to emergence at a rate\nindependent of the amount of flux that emerges. By subtracting the averaged\nflow divergence of the control regions, we found that active region emergence\nis associated with a remaining converging flow at 0.5-1 days prior to\nemergence. This remnant flow, $\\Delta \\, \\mathrm{div} \\, \\mathbf{v_h} = (-4.9\n\\pm 1.7) \\times 10^{-6}$ 1/s, corresponds to a flow speed of 10-20 m/s (an\norder of magnitude less than supergranulation flows) out to a radius of about\n10 Mm. We show that these observational results are qualitatively supported by\nsimulations of a small bipole emerging through the near-surface convective\nlayers of the Sun. The question remains whether these flows are driving the\nemergence, or are caused by the emergence.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"5dlRgGeqcM_4_SoxnLh2F3FQA2NhtAeBGRxQqMHxPWE","pdfSize":"8308431"}