{"id":"2407.09020","title":"3M-Health: Multimodal Multi-Teacher Knowledge Distillation for Mental\n  Health Detection","authors":"Rina Carines Cabral, Siwen Luo, Josiah Poon, Soyeon Caren Han","authorsParsed":[["Cabral","Rina Carines",""],["Luo","Siwen",""],["Poon","Josiah",""],["Han","Soyeon Caren",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 06:22:45 GMT"},{"version":"v2","created":"Mon, 15 Jul 2024 03:53:12 GMT"},{"version":"v3","created":"Thu, 8 Aug 2024 06:19:10 GMT"}],"updateDate":"2024-08-09","timestamp":1720765365000,"abstract":"  The significance of mental health classification is paramount in contemporary\nsociety, where digital platforms serve as crucial sources for monitoring\nindividuals' well-being. However, existing social media mental health datasets\nprimarily consist of text-only samples, potentially limiting the efficacy of\nmodels trained on such data. Recognising that humans utilise cross-modal\ninformation to comprehend complex situations or issues, we present a novel\napproach to address the limitations of current methodologies. In this work, we\nintroduce a Multimodal and Multi-Teacher Knowledge Distillation model for\nMental Health Classification, leveraging insights from cross-modal human\nunderstanding. Unlike conventional approaches that often rely on simple\nconcatenation to integrate diverse features, our model addresses the challenge\nof appropriately representing inputs of varying natures (e.g., texts and\nsounds). To mitigate the computational complexity associated with integrating\nall features into a single model, we employ a multimodal and multi-teacher\narchitecture. By distributing the learning process across multiple teachers,\neach specialising in a particular feature extraction aspect, we enhance the\noverall mental health classification performance. Through experimental\nvalidation, we demonstrate the efficacy of our model in achieving improved\nperformance.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"RkpWeFY2zZPnn3oOi8ZbyiOidAOe5_I1g_PL3-XYxFo","pdfSize":"1069017"}