{"id":"2407.19266","title":"Interactive Learning in Computer Science Education Supported by a\n  Discord Chatbot","authors":"Santiago Berrezueta-Guzman, Ivan Parmacli, Stephan Krusche, Stefan\n  Wagner","authorsParsed":[["Berrezueta-Guzman","Santiago",""],["Parmacli","Ivan",""],["Krusche","Stephan",""],["Wagner","Stefan",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 14:22:40 GMT"}],"updateDate":"2024-07-30","timestamp":1722090160000,"abstract":"  Enhancing interaction and feedback collection in a first-semester computer\nscience course poses a significant challenge due to students' diverse needs and\nengagement levels. To address this issue, we created and integrated a\ncommand-based chatbot on the course communication server on Discord. The\nDiscordBot enables students to provide feedback on course activities through\nshort surveys, such as exercises, quizzes, and lectures, facilitating\nstress-free communication with instructors. It also supports attendance\ntracking and introduces lectures before they start.\n  The research demonstrates the effectiveness of the DiscordBot as a\ncommunication tool. The ongoing feedback allowed course instructors to\ndynamically adjust and improve the difficulty level of upcoming activities and\npromote discussion in subsequent tutor sessions. The data collected reveal that\nstudents can accurately perceive the activities' difficulty and expected\nresults, providing insights not possible through traditional end-of-semester\nsurveys. Students reported that interaction with the DiscordBot was easy and\nexpressed a desire to continue using it in future semesters. This responsive\napproach ensures the course meets the evolving needs of students, thereby\nenhancing their overall learning experience.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computers and Society","Computing Research Repository/Emerging Technologies"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"5cb8twYSduKzyFCNG_WYwTNQmHx2S3b9hoZHHjPODcA","pdfSize":"818458","objectId":"0xa266ccfa8f821a5f870283c75304e82201f9835b21b341fa0aa6479108cf6906","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
