{"id":"2407.02571","title":"Adaptive Habitability of Exoplanets: Thriving Under Extreme\n  Environmental Change","authors":"Itay Weintraub, Hagai B. Perets","authorsParsed":[["Weintraub","Itay",""],["Perets","Hagai B.",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 18:00:13 GMT"}],"updateDate":"2024-07-04","timestamp":1719943213000,"abstract":"  The dynamic nature of life's ability to thrive in diverse and changing\nplanetary environments suggests that habitability and survival depend on the\nevolutionary path and life adaptation to environmental conditions. Here we\nexplore such \"adaptive habitability\" through astro-ecological models. We study\nthe interplay between temperature adaptation and environmental fluctuations,\nparticularly those induced by solar activity and orbital dynamics. We present a\nsimplified ecological-evolutionary model to investigate the limits of life's\nadaptability on a planetary scale. By incorporating complexities such as\nmultiple niches, migration, species interactions, and realistic temperature\nvariations, we demonstrate the potential for adaptive habitability in the face\nof both gradual and abrupt environmental changes. Through simulations\nencompassing monotonic, periodic, and secular dynamical evolution-induced\ntemperature profiles, we identify critical thresholds for survival and\nextinction, highlighting the importance of phenotypic variance and dispersal\nrates in adapting to varying environmental conditions. These findings\nunderscore the significance of considering temporal variations in assessing\nexoplanet habitability and expanding the search space for potentially habitable\nworlds.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"at0AwxeRrHvFwDUh2J0OtpsVpAmLSeIMjE8E7JOfq5c","pdfSize":"1552253","objectId":"0x38bff809e77cda0c16848b6bb3f2bad52d643518076983ce1c3e615a033d4677","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
