{"id":"2407.14158","title":"Machine learning emulation of precipitation from km-scale regional\n  climate simulations using a diffusion model","authors":"Henry Addison, Elizabeth Kendon, Suman Ravuri, Laurence Aitchison,\n  Peter AG Watson","authorsParsed":[["Addison","Henry",""],["Kendon","Elizabeth",""],["Ravuri","Suman",""],["Aitchison","Laurence",""],["Watson","Peter AG",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 09:42:20 GMT"}],"updateDate":"2024-07-22","timestamp":1721382140000,"abstract":"  High-resolution climate simulations are very valuable for understanding\nclimate change impacts and planning adaptation measures. This has motivated use\nof regional climate models at sufficiently fine resolution to capture important\nsmall-scale atmospheric processes, such as convective storms. However, these\nregional models have very high computational costs, limiting their\napplicability. We present CPMGEM, a novel application of a generative machine\nlearning model, a diffusion model, to skilfully emulate precipitation\nsimulations from such a high-resolution model over England and Wales at much\nlower cost. This emulator enables stochastic generation of high-resolution\n(8.8km), daily-mean precipitation samples conditioned on coarse-resolution\n(60km) weather states from a global climate model. The output is fine enough\nfor use in applications such as flood inundation modelling. The emulator\nproduces precipitation predictions with realistic intensities and spatial\nstructures and captures most of the 21st century climate change signal. We show\nevidence that the emulator has skill for extreme events up to and including\n1-in-100 year intensities. Potential applications include producing\nhigh-resolution precipitation predictions for large-ensemble climate\nsimulations and downscaling different climate models and climate change\nscenarios to better sample uncertainty in climate changes at local-scale.\n","subjects":["Physics/Atmospheric and Oceanic Physics","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"rh-u3MI9xnn9Y-zczZIZfzxWWAhdnrbHwCR0gvAsMlA","pdfSize":"2802046"}