{"id":"2407.19634","title":"The evolution of cooperation with Q-learning: the impact of information\n  perception","authors":"Guozhong Zheng, Zhenwei Ding, Jiqiang Zhang, Shengfeng Deng, Weiran\n  Cai, Li Chen","authorsParsed":[["Zheng","Guozhong",""],["Ding","Zhenwei",""],["Zhang","Jiqiang",""],["Deng","Shengfeng",""],["Cai","Weiran",""],["Chen","Li",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 01:33:20 GMT"}],"updateDate":"2024-07-30","timestamp":1722216800000,"abstract":"  The inherent huge complexities in human beings show a remarkable diversity in\nresponse to complex surroundings, enabling us to tackle problems from different\nperspectives. In the realm of cooperation studies, however, existing work\nassumes that individuals get access to the same kind of information to make\ntheir decisions, in contrast to the facts that individuals often perceive\ndifferently. Here, within the reinforcement learning framework, we investigate\nthe impact of information perception on the evolution of cooperation in a\n2-person scenario when playing the prisoner's dilemma game. We demonstrate that\ndistinctly different evolution processes are observed in three information\nperception scenarios, revealing that the structure of information significantly\naffects the emergence of cooperation. Notably, the asymmetric information\nscenario exhibits a rich dynamical process, including the cooperation\nemergence, breakdown, and reconstruction, akin to psychological changes in\nhumans. Our findings indicate that the information structure is vital to the\nemergence of cooperation, shedding new light on establishing mutually stable\ncooperative relationships and understanding human behavioral complexities in\ngeneral.\n","subjects":["Quantitative Biology/Populations and Evolution","Condensed Matter/Statistical Mechanics","Nonlinear Sciences/Adaptation and Self-Organizing Systems"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ikRjgjVlhDYId3pClQpWVVbjE731aqAlULPi9kIwzWo","pdfSize":"5604743"}