{"id":"2407.14798","title":"An Information-Geometric Formulation of Pattern Separation and\n  Evaluation of Existing Indices","authors":"Harvey Wang, Selena Singh, Thomas Trappenberg, Abraham Nunes","authorsParsed":[["Wang","Harvey",""],["Singh","Selena",""],["Trappenberg","Thomas",""],["Nunes","Abraham",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 07:58:23 GMT"}],"updateDate":"2024-07-23","timestamp":1721462303000,"abstract":"  Pattern separation is a computational process by which dissimilar neural\npatterns are generated from similar input patterns. We present an\ninformation-geometric formulation of pattern separation, where a pattern\nseparator is modelled as a family of statistical distributions on a manifold.\nSuch a manifold maps an input (i.e. coordinates) to a probability distribution\nthat generates firing patterns. Pattern separation occurs when small coordinate\nchanges result in large distances between samples from the corresponding\ndistributions. Under this formulation, we implement a two-neuron system whose\nprobability law forms a 3-dimensional manifold with mutually orthogonal\ncoordinates representing the neurons' marginal and correlational firing rates.\nWe use this highly controlled system to examine the behaviour of spike train\nsimilarity indices commonly used in pattern separation research. We found that\nall indices (except scaling factor) were sensitive to relative differences in\nmarginal firing rates, but no index adequately captured differences in spike\ntrains that resulted from altering the correlation in activity between the two\nneurons. That is, existing pattern separation metrics appear (A) sensitive to\npatterns that are encoded by different neurons, but (B) insensitive to patterns\nthat differ only in relative spike timing (e.g. synchrony between neurons in\nthe ensemble).\n","subjects":["Quantitative Biology/Neurons and Cognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"TJATmWW7F7fAcCqnsnrZ6HVJWjtTVH8ns1aQ2Z5lnWQ","pdfSize":"3158798"}