{"id":"2407.00584","title":"Hyperparameter Optimization for Randomized Algorithms: A Case Study for\n  Random Features","authors":"Oliver R. A. Dunbar, Nicholas H. Nelsen, Maya Mutic","authorsParsed":[["Dunbar","Oliver R. A.",""],["Nelsen","Nicholas H.",""],["Mutic","Maya",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 04:15:03 GMT"},{"version":"v2","created":"Fri, 19 Jul 2024 23:38:10 GMT"}],"updateDate":"2024-07-23","timestamp":1719720903000,"abstract":"  Randomized algorithms exploit stochasticity to reduce computational\ncomplexity. One important example is random feature regression (RFR) that\naccelerates Gaussian process regression (GPR). RFR approximates an unknown\nfunction with a random neural network whose hidden weights and biases are\nsampled from a probability distribution. Only the final output layer is fit to\ndata. In randomized algorithms like RFR, the hyperparameters that characterize\nthe sampling distribution greatly impact performance, yet are not directly\naccessible from samples. This makes optimization of hyperparameters via\nstandard (gradient-based) optimization tools inapplicable. Inspired by Bayesian\nideas from GPR, this paper introduces a random objective function that is\ntailored for hyperparameter tuning of vector-valued random features. The\nobjective is minimized with ensemble Kalman inversion (EKI). EKI is a\ngradient-free particle-based optimizer that is scalable to high-dimensions and\nrobust to randomness in objective functions. A numerical study showcases the\nnew black-box methodology to learn hyperparameter distributions in several\nproblems that are sensitive to the hyperparameter selection: two global\nsensitivity analyses, integrating a chaotic dynamical system, and solving a\nBayesian inverse problem from atmospheric dynamics. The success of the proposed\nEKI-based algorithm for RFR suggests its potential for automated optimization\nof hyperparameters arising in other randomized algorithms.\n","subjects":["Computing Research Repository/Machine Learning","Statistics/Computation","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"iEB1D22W6fxM7dk6GGlpMTBhvpfuDWMPML1TFxf69nY","pdfSize":"11524424"}