{"id":"2407.15757","title":"Willingness to Pay for an Electricity Connection: A Choice Experiment\n  Among Rural Households and Enterprises in Nigeria","authors":"Pouya Janghorban, Temilade Sesan, Muhammad-Kabir Salihu, Olayinka\n  Ohunakin, Narges Chinichian","authorsParsed":[["Janghorban","Pouya",""],["Sesan","Temilade",""],["Salihu","Muhammad-Kabir",""],["Ohunakin","Olayinka",""],["Chinichian","Narges",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 16:08:02 GMT"}],"updateDate":"2024-07-23","timestamp":1721664482000,"abstract":"  Rural electrification initiatives worldwide frequently encounter financial\nplanning challenges due to a lack of reliable market insights. This research\ndelves into the preferences and marginal willingness to pay (mWTP) for upfront\nelectricity connections in rural and peri-urban areas of Nigeria. We\ninvestigate discrete choice experiment data gathered from 3,599 households and\n1,122 Small to Medium-sized Enterprises (SMEs) across three geopolitical zones\nof Nigeria, collected during the 2021 PeopleSuN project survey phase. Employing\nconditional logit modeling, we analyze this data to explore preferences and\nmarginal willingness to pay for electricity connection. Our findings show that\nhouseholds prioritize nighttime electricity access, while SMEs place a higher\nvalue on daytime electricity. When comparing improvements in electricity\ncapacity to medium or high-capacity, SMEs exhibit a sharp increase in\nwillingness to pay for high-capacity, while households value the two options\nmore evenly. Preferences for the electricity source vary among SMEs, but\nhouseholds display a reluctance towards diesel generators and a preference for\nthe grid or solar solutions. Moreover, households with older heads express\ngreater aversion to connection fees, and male-headed households show a stronger\npreference for nighttime electricity compared to their female-headed\ncounterparts. The outcomes of this study yield pivotal insights to tailor\nelectrification strategies for rural Nigeria, emphasizing the importance of\nconsidering the diverse preferences of households and SMEs.\n","subjects":["Economics/General Economics","Quantitative Finance/Economics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"A48lGoXnsuyvz8hycD-Y0GHrx08hsLMqdXEjZU1Q7fw","pdfSize":"5363004"}