{"id":"2407.05352","title":"Exploring Phrase-Level Grounding with Text-to-Image Diffusion Model","authors":"Danni Yang, Ruohan Dong, Jiayi Ji, Yiwei Ma, Haowei Wang, Xiaoshuai\n  Sun, and Rongrong Ji","authorsParsed":[["Yang","Danni",""],["Dong","Ruohan",""],["Ji","Jiayi",""],["Ma","Yiwei",""],["Wang","Haowei",""],["Sun","Xiaoshuai",""],["Ji","Rongrong",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 13:06:34 GMT"}],"updateDate":"2024-07-09","timestamp":1720357594000,"abstract":"  Recently, diffusion models have increasingly demonstrated their capabilities\nin vision understanding. By leveraging prompt-based learning to construct\nsentences, these models have shown proficiency in classification and visual\ngrounding tasks. However, existing approaches primarily showcase their ability\nto perform sentence-level localization, leaving the potential for leveraging\ncontextual information for phrase-level understanding largely unexplored. In\nthis paper, we utilize Panoptic Narrative Grounding (PNG) as a proxy task to\ninvestigate this capability further. PNG aims to segment object instances\nmentioned by multiple noun phrases within a given narrative text. Specifically,\nwe introduce the DiffPNG framework, a straightforward yet effective approach\nthat fully capitalizes on the diffusion's architecture for segmentation by\ndecomposing the process into a sequence of localization, segmentation, and\nrefinement steps. The framework initially identifies anchor points using\ncross-attention mechanisms and subsequently performs segmentation with\nself-attention to achieve zero-shot PNG. Moreover, we introduce a refinement\nmodule based on SAM to enhance the quality of the segmentation masks. Our\nextensive experiments on the PNG dataset demonstrate that DiffPNG achieves\nstrong performance in the zero-shot PNG task setting, conclusively proving the\ndiffusion model's capability for context-aware, phrase-level understanding.\nSource code is available at \\url{https://github.com/nini0919/DiffPNG}.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Multimedia"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"MA2qH63pMR_OmDqsv73BQJup0Id24PvU7ekW2Vx9DL0","pdfSize":"5754790"}
