{"id":"2407.17853","title":"Compilation of Commit Changes within Java Source Code Repositories","authors":"Stefan Schott, Wolfram Fischer, Serena Elisa Ponta, Jonas Klauke, Eric\n  Bodden","authorsParsed":[["Schott","Stefan",""],["Fischer","Wolfram",""],["Ponta","Serena Elisa",""],["Klauke","Jonas",""],["Bodden","Eric",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 08:14:33 GMT"}],"updateDate":"2024-07-26","timestamp":1721895273000,"abstract":"  Java applications include third-party dependencies as bytecode. To keep these\napplications secure, researchers have proposed tools to re-identify\ndependencies that contain known vulnerabilities. Yet, to allow such\nre-identification, one must obtain, for each vulnerability patch, the bytecode\nfixing the respective vulnerability at first. Such patches for dependencies are\ncurated in databases in the form of fix-commits. But fixcommits are in source\ncode, and automatically compiling whole Java projects to bytecode is\nnotoriously hard, particularly for non-current versions of the code. In this\npaper, we thus propose JESS, an approach that largely avoids this problem by\ncompiling solely the relevant code that was modified within a given commit.\nJESS reduces the code, retaining only those parts that the committed change\nreferences. To avoid name-resolution errors, JESS automatically infers stubs\nfor references to entities that are unavailable to the compiler. A challenge is\nhere that, to facilitate the above mentioned reidentification, JESS must seek\nto produce bytecode that is almost identical to the bytecode which one would\nobtain by a successful compilation of the full project. An evaluation on 347\nGitHub projects shows that JESS is able to compile, in isolation, 72% of\nmethods and constructors, of which 89% have bytecode equal to the original one.\nFurthermore, on the Project KB database of fix-commits, in which only 8% of\nfiles modified within the commits can be compiled with the provided build\nscripts, JESS is able to compile 73% of all files that these commits modify.\n","subjects":["Computing Research Repository/Software Engineering","Computing Research Repository/Programming Languages"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"6GWsiQztVugsS-zBga9sT9TNz5rsF5GFTZzOF9JlBSw","pdfSize":"378880"}