{"id":"2407.15765","title":"Skolem, G\\\"odel, and Hilbert fibrations","authors":"Davide Trotta, Jonathan Weinberger, Valeria de Paiva","authorsParsed":[["Trotta","Davide",""],["Weinberger","Jonathan",""],["de Paiva","Valeria",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 16:18:05 GMT"},{"version":"v2","created":"Sun, 4 Aug 2024 14:05:17 GMT"},{"version":"v3","created":"Mon, 12 Aug 2024 10:55:09 GMT"}],"updateDate":"2024-08-13","timestamp":1721665085000,"abstract":"  Grothendieck fibrations are fundamental in capturing the concept of\ndependency, notably in categorical semantics of type theory and programming\nlanguages. A relevant instance are Dialectica fibrations which generalise\nG\\\"odel's Dialectica proof interpretation and have been widely studied in\nrecent years.\n  We characterise when a given fibration is a generalised, dependent Dialectica\nfibration, namely an iterated completion of a fibration by dependent products\nand sums (along a given class of display maps). From a technical perspective,\nwe complement the work of Hofstra on Dialectica fibrations by an internal\nviewpoint, categorifying the classical notion of quantifier-freeness. We also\ngeneralise both Hofstra's and Trotta et al.'s work on G\\\"odel fibrations to the\ndependent case, replacing the class of cartesian projections in the base\ncategory by arbitrary display maps. We discuss how this recovers a range of\nrelevant examples in categorical logic and proof theory. Moreover, as another\ninstance, we introduce Hilbert fibrations, providing a categorical\nunderstanding of Hilbert's $\\epsilon$- and $\\tau$-operators well-known from\nproof theory.\n","subjects":["Mathematics/Category Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"AymrP-41rdswh0KW14xclruHgnq1e8-xTBOL3qOy-5k","pdfSize":"513655","objectId":"0x599a166697db092756865f0fe758cc446d3f963324e547118e4063d08a512595","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
