{"id":"2407.09365","title":"Tracking Patterns in Toxicity and Antisocial Behavior Over User\n  Lifetimes on Large Social Media Platforms","authors":"Katy Blumer and Jon Kleinberg","authorsParsed":[["Blumer","Katy",""],["Kleinberg","Jon",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 15:45:02 GMT"}],"updateDate":"2024-07-15","timestamp":1720799102000,"abstract":"  An increasing amount of attention has been devoted to the problem of \"toxic\"\nor antisocial behavior on social media. In this paper we analyze such behavior\nat very large scales: we analyze toxicity over a 14-year time span on nearly\n500 million comments from Reddit and Wikipedia, grounded in two different\nproxies for toxicity.\n  At the individual level, we analyze users' toxicity levels over the course of\ntheir time on the site, and find a striking reversal in trends: both Reddit and\nWikipedia users tended to become less toxic over their life cycles on the site\nin the early (pre-2013) history of the site, but more toxic over their life\ncycles in the later (post-2013) history of the site. We also find that toxicity\non Reddit and Wikipedia differ in a key way, with the most toxic behavior on\nReddit exhibited in aggregate by the most active users, and the most toxic\nbehavior on Wikipedia exhibited in aggregate by the least active users.\nFinally, we consider the toxicity of discussion around widely-shared pieces of\ncontent, and find that the trends for toxicity in discussion about content bear\ninteresting similarities with the trends for toxicity in discussion by users.\n","subjects":["Computing Research Repository/Social and Information Networks","Computing Research Repository/Computers and Society","Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"dVDxMlnrfhlKjCTGc2c7JREBfpWOJShoh6ydeTvJP7I","pdfSize":"14152741","objectId":"0x2d755a9ef5eac51aa8cae0c54979ab78ac0690352483b31067f5b05bf5fd65a7","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
