{"id":"2407.16831","title":"Networks of Networks: Complexity Class Principles Applied to Compound AI\n  Systems Design","authors":"Jared Quincy Davis, Boris Hanin, Lingjiao Chen, Peter Bailis, Ion\n  Stoica, Matei Zaharia","authorsParsed":[["Davis","Jared Quincy",""],["Hanin","Boris",""],["Chen","Lingjiao",""],["Bailis","Peter",""],["Stoica","Ion",""],["Zaharia","Matei",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 20:40:37 GMT"}],"updateDate":"2024-07-25","timestamp":1721767237000,"abstract":"  As practitioners seek to surpass the current reliability and quality frontier\nof monolithic models, Compound AI Systems consisting of many language model\ninference calls are increasingly employed. In this work, we construct systems,\nwhich we call Networks of Networks (NoNs) organized around the distinction\nbetween generating a proposed answer and verifying its correctness, a\nfundamental concept in complexity theory that we show empirically extends to\nLanguage Models (LMs). We introduce a verifier-based judge NoN with K\ngenerators, an instantiation of \"best-of-K\" or \"judge-based\" compound AI\nsystems. Through experiments on synthetic tasks such as prime factorization,\nand core benchmarks such as the MMLU, we demonstrate notable performance gains.\nFor instance, in factoring products of two 3-digit primes, a simple NoN\nimproves accuracy from 3.7\\% to 36.6\\%. On MMLU, a verifier-based judge\nconstruction with only 3 generators boosts accuracy over individual GPT-4-Turbo\ncalls by 2.8\\%. Our analysis reveals that these gains are most pronounced in\ndomains where verification is notably easier than generation--a\ncharacterization which we believe subsumes many reasoning and procedural\nknowledge tasks, but doesn't often hold for factual and declarative\nknowledge-based settings. For mathematical and formal logic reasoning-based\nsubjects of MMLU, we observe a 5-8\\% or higher gain, whilst no gain on others\nsuch as geography and religion. We provide key takeaways for ML practitioners,\nincluding the importance of considering verification complexity, the impact of\nwitness format on verifiability, and a simple test to determine the potential\nbenefit of this NoN approach for a given problem distribution. This work aims\nto inform future research and practice in the design of compound AI systems.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"LAlwILwDjilUmaLldmeWRcYyH8EeNhNoKvLb4xjxW0I","pdfSize":"154850"}