{"id":"2407.07765","title":"Ramsey Theorems for Trees and a General 'Private Learning Implies Online\n  Learning' Theorem","authors":"Simone Fioravanti, Steve Hanneke, Shay Moran, Hilla Schefler, Iska\n  Tsubari","authorsParsed":[["Fioravanti","Simone",""],["Hanneke","Steve",""],["Moran","Shay",""],["Schefler","Hilla",""],["Tsubari","Iska",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 15:43:30 GMT"},{"version":"v2","created":"Wed, 14 Aug 2024 09:52:09 GMT"}],"updateDate":"2024-08-15","timestamp":1720626210000,"abstract":"  This work continues to investigate the link between differentially private\n(DP) and online learning. Alon, Livni, Malliaris, and Moran (2019) showed that\nfor binary concept classes, DP learnability of a given class implies that it\nhas a finite Littlestone dimension (equivalently, that it is online learnable).\nTheir proof relies on a model-theoretic result by Hodges (1997), which\ndemonstrates that any binary concept class with a large Littlestone dimension\ncontains a large subclass of thresholds. In a follow-up work, Jung, Kim, and\nTewari (2020) extended this proof to multiclass PAC learning with a bounded\nnumber of labels. Unfortunately, Hodges's result does not apply in other\nnatural settings such as multiclass PAC learning with an unbounded label space,\nand PAC learning of partial concept classes.\n  This naturally raises the question of whether DP learnability continues to\nimply online learnability in more general scenarios: indeed, Alon, Hanneke,\nHolzman, and Moran (2021) explicitly leave it as an open question in the\ncontext of partial concept classes, and the same question is open in the\ngeneral multiclass setting. In this work, we give a positive answer to these\nquestions showing that for general classification tasks, DP learnability\nimplies online learnability. Our proof reasons directly about Littlestone\ntrees, without relying on thresholds. We achieve this by establishing several\nRamsey-type theorems for trees, which might be of independent interest.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Cryptography and Security","Computing Research Repository/Data Structures and Algorithms","Mathematics/Combinatorics","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_QpDYUjCqnCTIq2PakFlgzVS6KX-PwPggdywc_fn5As","pdfSize":"801532","objectId":"0xd88823c9be001db944f99c494755d19dc562a7079b9c55b7fbdd7c6349953965","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
