{"id":"2407.09110","title":"The Magic XRoom: A Flexible VR Platform for Controlled Emotion\n  Elicitation and Recognition","authors":"S. M. Hossein Mousavi, Matteo Besenzoni, Davide Andreoletti, Achille\n  Peternier, Silvia Giordano","authorsParsed":[["Mousavi","S. M. Hossein",""],["Besenzoni","Matteo",""],["Andreoletti","Davide",""],["Peternier","Achille",""],["Giordano","Silvia",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 09:21:19 GMT"}],"updateDate":"2024-07-15","timestamp":1720776079000,"abstract":"  Affective computing has recently gained popularity, especially in the field\nof human-computer interaction systems, where effectively evoking and detecting\nemotions is of paramount importance to enhance users experience. However,\nseveral issues are hindering progress in the field. In fact, the complexity of\nemotions makes it difficult to understand their triggers and control their\nelicitation. Additionally, effective emotion recognition requires analyzing\nmultiple sensor data, such as facial expressions and physiological signals.\nThese factors combined make it hard to collect high-quality datasets that can\nbe used for research purposes (e.g., development of emotion recognition\nalgorithms). Despite these challenges, Virtual Reality (VR) holds promise as a\nsolution. By providing a controlled and immersive environment, VR enables the\nreplication of real-world emotional experiences and facilitates the tracking of\nsignals indicative of emotional states. However, controlling emotion\nelicitation remains a challenging task also within VR. This research paper\nintroduces the Magic Xroom, a VR platform designed to enhance control over\nemotion elicitation by leveraging the theory of flow. This theory establishes a\nmapping between an individuals skill levels, task difficulty, and perceived\nemotions. In the Magic Xroom, the users skill level is continuously assessed,\nand task difficulty is adjusted accordingly to evoke specific emotions.\nFurthermore, user signals are collected using sensors, and virtual panels are\nutilized to determine the ground truth emotional states, making the Magic Xroom\nan ideal platform for collecting extensive datasets. The paper provides\ndetailed implementation information, highlights the main properties of the\nMagic Xroom, and presents examples of virtual scenarios to illustrate its\nabilities and capabilities.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"-pyV70Ml8uybYT8kQl4woQtxkB20l7hrdLo3w21gA98","pdfSize":"237102"}