{"id":"2407.09004","title":"Privacy-Preserving Collaborative Genomic Research: A Real-Life\n  Deployment and Vision","authors":"Zahra Rahmani, Nahal Shahini, Nadav Gat, Zebin Yun, Yuzhou Jiang, Ofir\n  Farchy, Yaniv Harel, Vipin Chaudhary, Mahmood Sharif, Erman Ayday","authorsParsed":[["Rahmani","Zahra",""],["Shahini","Nahal",""],["Gat","Nadav",""],["Yun","Zebin",""],["Jiang","Yuzhou",""],["Farchy","Ofir",""],["Harel","Yaniv",""],["Chaudhary","Vipin",""],["Sharif","Mahmood",""],["Ayday","Erman",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 05:43:13 GMT"}],"updateDate":"2024-07-15","timestamp":1720762993000,"abstract":"  The data revolution holds significant promise for the health sector. Vast\namounts of data collected from individuals will be transformed into knowledge,\nAI models, predictive systems, and best practices. One area of health that\nstands to benefit greatly is the genomic domain. Progress in AI, machine\nlearning, and data science has opened new opportunities for genomic research,\npromising breakthroughs in personalized medicine. However, increasing awareness\nof privacy and cybersecurity necessitates robust solutions to protect sensitive\ndata in collaborative research. This paper presents a practical deployment of a\nprivacy-preserving framework for genomic research, developed in collaboration\nwith Lynx$.$MD, a platform for secure health data collaboration. The framework\naddresses critical cybersecurity and privacy challenges, enabling the\nprivacy-preserving sharing and analysis of genomic data while mitigating risks\nassociated with data breaches. By integrating advanced privacy-preserving\nalgorithms, the solution ensures the protection of individual privacy without\ncompromising data utility. A unique feature of the system is its ability to\nbalance trade-offs between data sharing and privacy, providing stakeholders\ntools to quantify privacy risks and make informed decisions. Implementing the\nframework within Lynx$.$MD involves encoding genomic data into binary formats\nand applying noise through controlled perturbation techniques. This approach\npreserves essential statistical properties of the data, facilitating effective\nresearch and analysis. Moreover, the system incorporates real-time data\nmonitoring and advanced visualization tools, enhancing user experience and\ndecision-making. The paper highlights the need for tailored privacy attacks and\ndefenses specific to genomic data. Addressing these challenges fosters\ncollaboration in genomic research, advancing personalized medicine and public\nhealth.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"zHdE4S3WE1qJ7txwW1BWwH3lJ7r5FLl-HBwC4xNHnQ8","pdfSize":"1085965"}