{"id":"2407.11427","title":"Semi-Supervised Generative Models for Disease Trajectories: A Case Study\n  on Systemic Sclerosis","authors":"C\\'ecile Trottet, Manuel Sch\\\"urch, Ahmed Allam, Imon Barua, Liubov\n  Petelytska, David Launay, Paolo Air\\`o, Radim Be\\v{c}v\\'a\\v{r}, Christopher\n  Denton, Mislav Radic, Oliver Distler, Anna-Maria Hoffmann-Vold, Michael\n  Krauthammer, the EUSTAR collaborators","authorsParsed":[["Trottet","Cécile",""],["Schürch","Manuel",""],["Allam","Ahmed",""],["Barua","Imon",""],["Petelytska","Liubov",""],["Launay","David",""],["Airò","Paolo",""],["Bečvář","Radim",""],["Denton","Christopher",""],["Radic","Mislav",""],["Distler","Oliver",""],["Hoffmann-Vold","Anna-Maria",""],["Krauthammer","Michael",""],["collaborators","the EUSTAR",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 06:45:27 GMT"},{"version":"v2","created":"Thu, 8 Aug 2024 07:23:01 GMT"}],"updateDate":"2024-08-09","timestamp":1721112327000,"abstract":"  We propose a deep generative approach using latent temporal processes for\nmodeling and holistically analyzing complex disease trajectories, with a\nparticular focus on Systemic Sclerosis (SSc). We aim to learn temporal latent\nrepresentations of the underlying generative process that explain the observed\npatient disease trajectories in an interpretable and comprehensive way. To\nenhance the interpretability of these latent temporal processes, we develop a\nsemi-supervised approach for disentangling the latent space using established\nmedical knowledge. By combining the generative approach with medical\ndefinitions of different characteristics of SSc, we facilitate the discovery of\nnew aspects of the disease. We show that the learned temporal latent processes\ncan be utilized for further data analysis and clinical hypothesis testing,\nincluding finding similar patients and clustering SSc patient trajectories into\nnovel sub-types. Moreover, our method enables personalized online monitoring\nand prediction of multivariate time series with uncertainty quantification.\n","subjects":["Computing Research Repository/Machine Learning","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"GpBUA_F2i6hPyuV5jirXliPY6ELLndlE3nO9dIDKgzM","pdfSize":"4790272","objectId":"0x556bcb73cb2b0b27f585d03d46e0a395a6a1b4dc16777cb9bee5ce343dea311d","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
