{"id":"2407.10841","title":"On the Efficacy of Surface Codes in Compensating for Radiation Events in\n  Superconducting Devices","authors":"Marzio Vallero, Gioele Casagranda, Flavio Vella, Paolo Rech","authorsParsed":[["Vallero","Marzio",""],["Casagranda","Gioele",""],["Vella","Flavio",""],["Rech","Paolo",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 15:56:09 GMT"}],"updateDate":"2024-07-16","timestamp":1721058969000,"abstract":"  Reliability is fundamental for developing large-scale quantum computers.\nSince the benefit of technological advancements to the qubit's stability is\nsaturating, algorithmic solutions, such as quantum error correction (QEC)\ncodes, are needed to bridge the gap to reliable computation. Unfortunately, the\ndeployment of the first quantum computers has identified faults induced by\nnatural radiation as an additional threat to qubits reliability. The high\nsensitivity of qubits to radiation hinders the large-scale adoption of quantum\ncomputers, since the persistence and area-of-effect of the fault can\npotentially undermine the efficacy of the most advanced QEC.\n  In this paper, we investigate the resilience of various implementations of\nstate-of-the-art QEC codes to radiation-induced faults. We report data from\nover 400 million fault injections and correlate hardware faults with the\nlogical error observed after decoding the code output, extrapolating\nphysical-to-logical error rates. We compare the code's radiation-induced\nlogical error rate over the code distance, the number and role in the QEC of\nphysical qubits, the underlying quantum computer topology, and particle energy\nspread in the chip. We show that, by simply selecting and tuning properly the\nsurface code, thus without introducing any overhead, the probability of\ncorrecting a radiation-induced fault is increased by up to 10\\%. Finally, we\nprovide indications and guidelines for the design of future QEC codes to\nfurther increase their effectiveness against radiation-induced events.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Emerging Technologies"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"VkCgf0FEvU3WZx7da_qqWnFGXj4qGxihyc5D3UEySEs","pdfSize":"2770350"}