{"id":"2407.15296","title":"Weak-to-Strong Compositional Learning from Generative Models for\n  Language-based Object Detection","authors":"Kwanyong Park, Kuniaki Saito, Donghyun Kim","authorsParsed":[["Park","Kwanyong",""],["Saito","Kuniaki",""],["Kim","Donghyun",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 23:43:24 GMT"}],"updateDate":"2024-07-23","timestamp":1721605404000,"abstract":"  Vision-language (VL) models often exhibit a limited understanding of complex\nexpressions of visual objects (e.g., attributes, shapes, and their relations),\ngiven complex and diverse language queries. Traditional approaches attempt to\nimprove VL models using hard negative synthetic text, but their effectiveness\nis limited. In this paper, we harness the exceptional compositional\nunderstanding capabilities of generative foundational models. We introduce a\nnovel method for structured synthetic data generation aimed at enhancing the\ncompositional understanding of VL models in language-based object detection.\nOur framework generates densely paired positive and negative triplets (image,\ntext descriptions, and bounding boxes) in both image and text domains. By\nleveraging these synthetic triplets, we transform 'weaker' VL models into\n'stronger' models in terms of compositional understanding, a process we call\n\"Weak-to-Strong Compositional Learning\" (WSCL). To achieve this, we propose a\nnew compositional contrastive learning formulation that discovers semantics and\nstructures in complex descriptions from synthetic triplets. As a result, VL\nmodels trained with our synthetic data generation exhibit a significant\nperformance boost in the Omnilabel benchmark by up to +5AP and the D3 benchmark\nby +6.9AP upon existing baselines.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Computation and Language","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"OgoBRuSON5atm27PDYk15Vigb7KBEuWYqKl4g58m6qg","pdfSize":"3213122"}