{"id":"2407.10918","title":"PartImageNet++ Dataset: Scaling up Part-based Models for Robust\n  Recognition","authors":"Xiao Li, Yining Liu, Na Dong, Sitian Qin, Xiaolin Hu","authorsParsed":[["Li","Xiao",""],["Liu","Yining",""],["Dong","Na",""],["Qin","Sitian",""],["Hu","Xiaolin",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 17:19:50 GMT"}],"updateDate":"2024-07-16","timestamp":1721063990000,"abstract":"  Deep learning-based object recognition systems can be easily fooled by\nvarious adversarial perturbations. One reason for the weak robustness may be\nthat they do not have part-based inductive bias like the human recognition\nprocess. Motivated by this, several part-based recognition models have been\nproposed to improve the adversarial robustness of recognition. However, due to\nthe lack of part annotations, the effectiveness of these methods is only\nvalidated on small-scale nonstandard datasets. In this work, we propose PIN++,\nshort for PartImageNet++, a dataset providing high-quality part segmentation\nannotations for all categories of ImageNet-1K (IN-1K). With these annotations,\nwe build part-based methods directly on the standard IN-1K dataset for robust\nrecognition. Different from previous two-stage part-based models, we propose a\nMulti-scale Part-supervised Model (MPM), to learn a robust representation with\npart annotations. Experiments show that MPM yielded better adversarial\nrobustness on the large-scale IN-1K over strong baselines across various attack\nsettings. Furthermore, MPM achieved improved robustness on common corruptions\nand several out-of-distribution datasets. The dataset, together with these\nresults, enables and encourages researchers to explore the potential of\npart-based models in more real applications.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"aODiV_wK3asLVJus3GmUKD5roiL2bou5vwdIsFVdevw","pdfSize":"2654128"}