{"id":"2407.19379","title":"Innovative RIS Prototyping Enhancing Wireless Communication with\n  Real-Time Spot Beam Tracking and OAM Wavefront Manipulation","authors":"Yufei Zhao, Yuan Feng, Afkar Mohamed Ismail, Ziyue Wang, Yong Liang\n  Guan, Yongxin Guo, and Chau Yuen","authorsParsed":[["Zhao","Yufei",""],["Feng","Yuan",""],["Ismail","Afkar Mohamed",""],["Wang","Ziyue",""],["Guan","Yong Liang",""],["Guo","Yongxin",""],["Yuen","Chau",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 03:32:47 GMT"}],"updateDate":"2024-07-30","timestamp":1722137567000,"abstract":"  This paper presents a sophisticated reconfigurable metasurface architecture\nthat introduces an advanced concept of flexible full-array space-time wavefront\nmanipulation with enhanced dynamic capabilities. The practical 2-bit\nphase-shifting unit cell on the RIS is distinguished by its ability to maintain\nfour stable phase states, each with ${90^ \\circ }$ differences, and features an\ninsertion loss of less than 0.6 dB across a bandwidth of 200 MHz. All\nreconfigurable units are equipped with meticulously designed control circuits,\ngoverned by an intelligent core composed of multiple Micro-Controller Units\n(MCUs), enabling rapid control response across the entire RIS array. Owing to\nthe capability of each unit cell on the metasurface to independently switch\nstates, the entire RIS is not limited to controlling general beams with\nspecific directional patterns, but also generates beams with more complex\nstructures, including multi-focus 3D spot beams and vortex beams. This\ndevelopment substantially broadens its applicability across various industrial\nwireless transmission scenarios. Moreover, by leveraging the rapid-respond\nspace-time coding and the full-array independent programmability of the RIS\nprototyping operating at 10.7 GHz, we have demonstrated that: 1) The\nimplementation of 3D spot beams scanning facilitates dynamic beam tracking and\nreal-time communication under the indoor near-field scenario; 2) The rapid\nwavefront rotation of vortex beams enables precise modulation of signals within\nthe Doppler domain, showcasing an innovative approach to wireless signal\nmanipulation; 3) The beam steering experiments for blocking users under outdoor\nfar-field scenarios, verifying the beamforming capability of the RIS board.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"FRPmVMMgmF1-uiSh3OLyO4X2H00_I53tniSZ39wKcug","pdfSize":"6425572"}