{"id":"2407.12303","title":"Optical pumping through the Liouvillian skin effect","authors":"De-Huan Cai, Wei Yi, Chen-Xiao Dong","authorsParsed":[["Cai","De-Huan",""],["Yi","Wei",""],["Dong","Chen-Xiao",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 03:51:15 GMT"}],"updateDate":"2024-07-18","timestamp":1721188275000,"abstract":"  The Liouvillian skin effect describes the boundary affinity of Liouvillian\neignemodes that originates from the intrinsic non-Hermiticity of the\nLiouvillian superoperators. Dynamically, it manifests as directional flow in\nthe transient dynamics, and the accumulation of population near open boundaries\nat long times. Intriguingly, similar dynamic phenomena exist in the well-known\nprocess of optical pumping, where the system is driven into a desired state (or\na dark-state subspace) through the interplay of dissipation and optical drive.\nIn this work, we show that typical optical pumping processes can indeed be\nunderstood in terms of the Liouvillian skin effect. By studying the Liouvillian\nspectra under different boundary conditions, we reveal that the Liouvillian\nspectra of the driven-dissipative pumping process sensitively depend on the\nboundary conditions in the state space, a signature that lies at the origin of\nthe Liouvillian skin effect. Such a connection provides insights and practical\nmeans for designing efficient optical-pumping schemes through engineering\nLiouvillian gaps under the open-boundary condition. Based on these\nunderstandings, we show that the efficiency of a typical side-band cooling\nscheme for trapped ions can be dramatically enhanced by introducing\ncounterintuitive dissipative channels. Our results provide a useful perspective\nfor optical pumping, with interesting implications for state preparation and\ncooling.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Quantum Gases"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"C8946SFt4D4QTbGv58SO2I_SJ9Sm8Ps1Qr9sUx2HGsU","pdfSize":"6312634"}