{"id":"2407.12297","title":"WebAssembly and Security: a review","authors":"Gaetano Perrone and Simon Pietro Romano","authorsParsed":[["Perrone","Gaetano",""],["Romano","Simon Pietro",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 03:37:28 GMT"}],"updateDate":"2024-07-18","timestamp":1721187448000,"abstract":"  WebAssembly is revolutionizing the approach to developing modern\napplications. Although this technology was born to create portable and\nperformant modules in web browsers, currently, its capabilities are extensively\nexploited in multiple and heterogeneous use-case scenarios. With the extensive\neffort of the community, new toolkits make the use of this technology more\nsuitable for real-world applications. In this context, it is crucial to study\nthe liaisons between the WebAssembly ecosystem and software security. Indeed,\nWebAssembly can be a medium for improving the security of a system, but it can\nalso be exploited to evade detection systems or for performing cryptomining\nactivities. In addition, programs developed in low-level languages such as C\ncan be compiled in WebAssembly binaries, and it is interesting to evaluate the\nsecurity impacts of executing programs vulnerable to attacks against memory in\nthe WebAssembly sandboxed environment. Also, WebAssembly has been designed to\nprovide a secure and isolated environment, but such capabilities should be\nassessed in order to analyze their weaknesses and propose new mechanisms for\naddressing them. Although some research works have provided surveys of the most\nrelevant solutions aimed at discovering WebAssembly vulnerabilities or\ndetecting attacks, at the time of writing, there is no comprehensive review of\nsecurity-related literature in the WebAssembly ecosystem. We aim to fill this\ngap by proposing a comprehensive review of research works dealing with security\nin WebAssembly. We analyze 121 papers by identifying seven different security\ncategories.\n  We hope that our work will provide insights into the complex landscape of\nWebAssembly and guide researchers, developers, and security professionals\ntowards novel avenues in the realm of the WebAssembly ecosystem.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"vGTACRViUXJDRNzcel33kzrEpaJkP__UYuMs2BLRfUg","pdfSize":"729541"}