{"id":"2407.05051","title":"BrainMetDetect: Predicting Primary Tumor from Brain Metastasis MRI Data\n  Using Radiomic Features and Machine Learning Algorithms","authors":"Hamidreza Sadeghsalehi","authorsParsed":[["Sadeghsalehi","Hamidreza",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 11:34:00 GMT"}],"updateDate":"2024-07-09","timestamp":1720265640000,"abstract":"  Objective: Brain metastases (BMs) are common in cancer patients and\ndetermining the primary tumor site is crucial for effective treatment. This\nstudy aims to predict the primary tumor site from BM MRI data using radiomic\nfeatures and advanced machine learning algorithms. Methods: We utilized a\ncomprehensive dataset from Ocana-Tienda et al. (2023) comprising MRI and\nclinical data from 75 patients with BMs. Radiomic features were extracted from\npost-contrast T1-weighted MRI sequences. Feature selection was performed using\nthe GINI index, and data normalization was applied to ensure consistent\nscaling. We developed and evaluated Random Forest and XGBoost classifiers, both\nwith and without hyperparameter optimization using the FOX (Fox optimizer)\nalgorithm. Model interpretability was enhanced using SHAP (SHapley Additive\nexPlanations) values. Results: The baseline Random Forest model achieved an\naccuracy of 0.85, which improved to 0.93 with FOX optimization. The XGBoost\nmodel showed an initial accuracy of 0.96, increasing to 0.99 after\noptimization. SHAP analysis revealed the most influential radiomic features\ncontributing to the models' predictions. The FOX-optimized XGBoost model\nexhibited the best performance with a precision, recall, and F1-score of 0.99.\nConclusion: This study demonstrates the effectiveness of using radiomic\nfeatures and machine learning to predict primary tumor sites from BM MRI data.\nThe FOX optimization algorithm significantly enhanced model performance, and\nSHAP provided valuable insights into feature importance. These findings\nhighlight the potential of integrating radiomics and machine learning into\nclinical practice for improved diagnostic accuracy and personalized treatment\nplanning.\n","subjects":["Computing Research Repository/Machine Learning","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"KZwKN1C-4dUFAhfKOoxrm3LuUwpzVonqzV-GchzfgQk","pdfSize":"383583"}