{"id":"2407.05219","title":"Flood of Techniques and Drought of Theories: Emotion Mining in Disasters","authors":"Soheil Shapouri, Saber Soleymani, Saed Rezayi","authorsParsed":[["Shapouri","Soheil",""],["Soleymani","Saber",""],["Rezayi","Saed",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 00:43:05 GMT"},{"version":"v2","created":"Tue, 9 Jul 2024 21:51:09 GMT"},{"version":"v3","created":"Tue, 3 Sep 2024 02:10:16 GMT"}],"updateDate":"2024-09-04","timestamp":1720312985000,"abstract":"  Emotion mining has become a crucial tool for understanding human emotions\nduring disasters, leveraging the extensive data generated on social media\nplatforms. This paper aims to summarize existing research on emotion mining\nwithin disaster contexts, highlighting both significant discoveries and\npersistent issues. On the one hand, emotion mining techniques have achieved\nacceptable accuracy enabling applications such as rapid damage assessment and\nmental health surveillance. On the other hand, with many studies adopting\ndata-driven approaches, several methodological issues remain. These include\narbitrary emotion classification, ignoring biases inherent in data collection\nfrom social media, such as the overrepresentation of individuals from higher\nsocioeconomic status on Twitter, and the lack of application of theoretical\nframeworks like cross-cultural comparisons. These problems can be summarized as\na notable lack of theory-driven research and ignoring insights from social and\nbehavioral sciences. This paper underscores the need for interdisciplinary\ncollaboration between computer scientists and social scientists to develop more\nrobust and theoretically grounded approaches in emotion mining. By addressing\nthese gaps, we aim to enhance the effectiveness and reliability of emotion\nmining methodologies, ultimately contributing to improved disaster\npreparedness, response, and recovery.\n  Keywords: emotion mining, sentiment analysis, natural disasters, psychology,\ntechnological disasters\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"IUp_okIvge0pTkuR8UkNKslfgaXrF9x0FZAn1IPUmb4","pdfSize":"333303"}