{"id":"2407.09424","title":"TelecomGPT: A Framework to Build Telecom-Specfic Large Language Models","authors":"Hang Zou, Qiyang Zhao, Yu Tian, Lina Bariah, Faouzi Bader, Thierry\n  Lestable, and Merouane Debbah","authorsParsed":[["Zou","Hang",""],["Zhao","Qiyang",""],["Tian","Yu",""],["Bariah","Lina",""],["Bader","Faouzi",""],["Lestable","Thierry",""],["Debbah","Merouane",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 16:51:02 GMT"}],"updateDate":"2024-07-15","timestamp":1720803062000,"abstract":"  Large Language Models (LLMs) have the potential to revolutionize the Sixth\nGeneration (6G) communication networks. However, current mainstream LLMs\ngenerally lack the specialized knowledge in telecom domain. In this paper, for\nthe first time, we propose a pipeline to adapt any general purpose LLMs to a\ntelecom-specific LLMs. We collect and build telecom-specific pre-train dataset,\ninstruction dataset, preference dataset to perform continual pre-training,\ninstruct tuning and alignment tuning respectively. Besides, due to the lack of\nwidely accepted evaluation benchmarks in telecom domain, we extend existing\nevaluation benchmarks and proposed three new benchmarks, namely, Telecom Math\nModeling, Telecom Open QnA and Telecom Code Tasks. These new benchmarks provide\na holistic evaluation of the capabilities of LLMs including math modeling,\nOpen-Ended question answering, code generation, infilling, summarization and\nanalysis in telecom domain. Our fine-tuned LLM TelecomGPT outperforms state of\nthe art (SOTA) LLMs including GPT-4, Llama-3 and Mistral in Telecom Math\nModeling benchmark significantly and achieve comparable performance in various\nevaluation benchmarks such as TeleQnA, 3GPP technical documents classification,\ntelecom code summary and generation and infilling.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"Dmb5MOJIc36zhY5MmPUO4bHdcySW9wvr3lYupfQBvt8","pdfSize":"702550"}