{"id":"2407.05427","title":"MelodyVis: Visual Analytics for Melodic Patterns in Sheet Music","authors":"Matthias Miller, Daniel F\\\"urst, Maximilian T. Fischer, Hanna\n  Hauptmann, Daniel Keim, Mennatallah El-Assady","authorsParsed":[["Miller","Matthias",""],["Fürst","Daniel",""],["Fischer","Maximilian T.",""],["Hauptmann","Hanna",""],["Keim","Daniel",""],["El-Assady","Mennatallah",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 16:04:21 GMT"}],"updateDate":"2024-07-09","timestamp":1720368261000,"abstract":"  Manual melody detection is a tedious task requiring high expertise level,\nwhile automatic detection is often not expressive or powerful enough. Thus, we\npresent MelodyVis, a visual application designed in collaboration with\nmusicology experts to explore melodic patterns in digital sheet music.\nMelodyVis features five connected views, including a Melody Operator Graph and\na Voicing Timeline. The system utilizes eight atomic operators, such as\ntransposition and mirroring, to capture melody repetitions and variations.\nUsers can start their analysis by manually selecting patterns in the sheet\nview, and then identifying other patterns based on the selected samples through\nan interactive exploration process. We conducted a user study to investigate\nthe effectiveness and usefulness of our approach and its integrated melodic\noperators, including usability and mental load questions. We compared the\nanalysis executed by 25 participants with and without the operators. The study\nresults indicate that the participants could identify at least twice as many\npatterns with activated operators. MelodyVis allows analysts to steer the\nanalysis process and interpret results. Our study also confirms the usefulness\nof MelodyVis in supporting common analytical tasks in melodic analysis, with\nparticipants reporting improved pattern identification and interpretation.\nThus, MelodyVis addresses the limitations of fully-automated approaches,\nenabling music analysts to step into the analysis process and uncover and\nunderstand intricate melodic patterns and transformations in sheet music.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Information Retrieval"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"-Wejbn_t3d1EDFUtoKq1NWMiypBJynEnNjg_BasSjxs","pdfSize":"11901980"}