{"id":"2407.08810","title":"Quantum Plasma Creation near a Magnetar","authors":"Jonathan Zhang (University of Toronto) and Christopher Thompson (CITA)","authorsParsed":[["Zhang","Jonathan","","University of Toronto"],["Thompson","Christopher","","CITA"]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 18:38:39 GMT"}],"updateDate":"2024-07-15","timestamp":1720723119000,"abstract":"  Magnetars in quiescent states continue to emit hard X-rays with a power far\nexceeding the loss of rotational energy. It has recently been noted that this\nhard X-ray continuum may bear a direct signature of quantum electrodynamic\n(QED) effects in magnetic fields stronger than the Schwinger field ($B_{\\rm Q}\n= 4.4\\times 10^{13}$ G). When the current flowing into the magnetosphere is\ndriven by narrow structures in the solid crust, the $e^\\pm$ pair plasma\nsupporting the current relaxes to a collisional and trans-relativistic state.\nThe decay of a pair into two photons produces a broad, bremsstrahlung-like\nspectrum of hard X-rays, similar to that observed and extending up to $0.5-1$\nMeV. The conversion of two gamma rays to a pair is further enhanced by a factor\n$\\sim B/B_{\\rm Q}$. Monte Carlo calculations of pair creation in a dipole\nmagnetic field are presented. Non-local particle injection is found to be\nstrong enough to suppress the high voltage that otherwise would accompany polar\nmagnetic twist; the hard X-rays are mostly emitted away from the magnetic\npoles. Some of the pairs annihilate in an optically thin surface layer. The\nprototypical anomalous X-ray pulsar 1E 2259$+$586, which shows a hard X-ray\ncontinuum but relatively weak torque noise, slow spindown, and no radio\nemission, is a Rosetta Stone for understanding the magnetar circuit, consistent\nwith the picture advanced here. For a $15-60$ keV luminosity as low as\n$10^{34}$ erg s$^{-1}$, the polar flux of sub-relativistic pairs produces an\noptical depth $3-30$ to electron cyclotron scattering in the $1-10$ keV band,\nreducing the net X-ray polarization.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"LqZrNvFA44goRVwrJvfvkWT22ma_32eF5NWQ8tznqNk","pdfSize":"11070352"}