{"id":"2407.13866","title":"Asymptotic structure of scalar-Maxwell theory at the null boundary","authors":"Hern\\'an A. Gonz\\'alez, Oriana Labrin, Olivera Miskovic","authorsParsed":[["González","Hernán A.",""],["Labrin","Oriana",""],["Miskovic","Olivera",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 19:19:09 GMT"}],"updateDate":"2024-07-22","timestamp":1721330349000,"abstract":"  We apply the Hamiltonian formalism to investigate the massless sector of\nscalar field theory coupled with Maxwell electrodynamics through the Pontryagin\nterm. Specifically, we analyze asymptotic symmetries at the null infinity of\nthis theory, conserved charges, and their algebra. We find that the theory\npossesses asymptotic shift symmetries of the fields not present in the bulk\nmanifold coming from the zero modes of the symplectic matrix of constraints.\nConsequently, we conclude that the real scalar field also contains asymptotic\nsymmetries previously found in the literature by a different approach. We show\nthat these symmetries are the origin of the electric-magnetic duality in\nelectromagnetism with the topological Pontryagin term, and obtain non-trivial\ncentral extension between the electric and magnetic conserved charges. Finally,\nwe examine the full interacting theory and find that, due to the interaction,\nthe symmetry generators are more difficult to identify among the constraints,\nsuch that we obtain them in the weak-coupling limit. We find that the\nasymptotic structure of the theory simplifies due to a fast fall-off of the\nscalar field, leading to decoupled scalar and Maxwell asymptotic sectors, and\nlosing the electric-magnetic duality.\n","subjects":["Physics/High Energy Physics - Theory","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"RJhL_6hq8aENo9usU6LF4Ll6wCWaIGRpO-Tn-RHz9SE","pdfSize":"447570","objectId":"0x9b1a9f840371a60e79ff1771e981efb3253e1c21e04fd8bf34747a94614565cc","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
