{"id":"2407.07265","title":"Pseudo-perplexity in One Fell Swoop for Protein Fitness Estimation","authors":"Pranav Kantroo, G\\\"unter P. Wagner, Benjamin B. Machta","authorsParsed":[["Kantroo","Pranav",""],["Wagner","Günter P.",""],["Machta","Benjamin B.",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 22:46:08 GMT"}],"updateDate":"2024-07-11","timestamp":1720565168000,"abstract":"  Protein language models trained on the masked language modeling objective\nlearn to predict the identity of hidden amino acid residues within a sequence\nusing the remaining observable sequence as context. They do so by embedding the\nresidues into a high dimensional space that encapsulates the relevant\ncontextual cues. These embedding vectors serve as an informative\ncontext-sensitive representation that not only aids with the defined training\nobjective, but can also be used for other tasks by downstream models. We\npropose a scheme to use the embeddings of an unmasked sequence to estimate the\ncorresponding masked probability vectors for all the positions in a single\nforward pass through the language model. This One Fell Swoop (OFS) approach\nallows us to efficiently estimate the pseudo-perplexity of the sequence, a\nmeasure of the model's uncertainty in its predictions, that can also serve as a\nfitness estimate. We find that ESM2 OFS pseudo-perplexity performs nearly as\nwell as the true pseudo-perplexity at fitness estimation, and more notably it\ndefines a new state of the art on the ProteinGym Indels benchmark. The strong\nperformance of the fitness measure prompted us to investigate if it could be\nused to detect the elevated stability reported in reconstructed ancestral\nsequences. We find that this measure ranks ancestral reconstructions as more\nfit than extant sequences. Finally, we show that the computational efficiency\nof the technique allows for the use of Monte Carlo methods that can rapidly\nexplore functional sequence space.\n","subjects":["Quantitative Biology/Biomolecules","Quantitative Biology/Genomics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7ruEDz3OgKFD19usybPTITqQzTQxMohP1fcP0vZUOEk","pdfSize":"9070790"}