{"id":"2407.07961","title":"Unsupervised Beyond-Standard-Model Event Discovery at the LHC with a\n  Novel Quantum Autoencoder","authors":"Callum Duffy, Mohammad Hassanshah, Marcin Jastrzebski, Sarah Malik","authorsParsed":[["Duffy","Callum",""],["Hassanshah","Mohammad",""],["Jastrzebski","Marcin",""],["Malik","Sarah",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 18:01:11 GMT"}],"updateDate":"2024-07-12","timestamp":1720634471000,"abstract":"  This study explores the potential of unsupervised anomaly detection for\nidentifying physics beyond the Standard Model that may appear at proton\ncollisions at the Large Hadron Collider. We introduce a novel quantum\nautoencoder circuit ansatz that is specifically designed for this task and\ndemonstrates superior performance compared to previous approaches. To assess\nits robustness, we evaluate the quantum autoencoder on various types of new\nphysics 'signal' events and varying problem sizes. Additionally, we develop\nclassical autoencoders that outperform previously proposed quantum autoencoders\nbut remain outpaced by the new quantum ansatz, despite its significantly\nreduced number of trainable parameters. Finally, we investigate the properties\nof quantum autoencoder circuits, focusing on entanglement and magic. We\nintroduce a novel metric in the context of parameterised quantum circuits,\nstabilizer 2-R\\'enyi entropy to quantify magic, along with the previously\nstudied Meyer-Wallach measure for entanglement. Intriguingly, both metrics\ndecreased throughout the training process along with the decrease in the loss\nfunction. This appears to suggest that models preferentially learn parameters\nthat reduce these metrics. This study highlights the potential utility of\nquantum autoencoders in searching for physics beyond the Standard Model at the\nLarge Hadron Collider and opens exciting avenues for further research into the\nrole of entanglement and magic in quantum machine learning more generally.\n","subjects":["Physics/Quantum Physics","Physics/High Energy Physics - Experiment","Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"6k57fjIN8p3fo_KpkDWj098zoxOORvQvrS0A7YkMLeI","pdfSize":"8260078","objectId":"0x5237a23fc3cf646e4bd7641c25afac1758f15cbe77436600f918be2d17799937","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
