{"id":"2407.14421","title":"Short-period Heartbeat Binaries from TESS Full-Frame Images","authors":"Siddhant Solanki, Agnieszka M. Cieplak, Jeremy Schnittman, John G.\n  Baker, Thomas Barclay, Richard K. Barry, Veselin Kostov, Ethan Kruse, Greg\n  Olmschenk, Brian P. Powell, Stela Ishitani Silva and Guillermo Torres","authorsParsed":[["Solanki","Siddhant",""],["Cieplak","Agnieszka M.",""],["Schnittman","Jeremy",""],["Baker","John G.",""],["Barclay","Thomas",""],["Barry","Richard K.",""],["Kostov","Veselin",""],["Kruse","Ethan",""],["Olmschenk","Greg",""],["Powell","Brian P.",""],["Silva","Stela Ishitani",""],["Torres","Guillermo",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 15:43:41 GMT"},{"version":"v2","created":"Mon, 22 Jul 2024 21:00:07 GMT"}],"updateDate":"2024-07-24","timestamp":1721403821000,"abstract":"  We identify $240$ short-period ($P \\lesssim 10$ days) binary systems in the\nTESS data, $180$ of which are heartbeat binaries (HB). The sample is mostly a\nmix of A and B-type stars and primarily includes eclipsing systems, where over\n$30\\%$ of the sources with primary and secondary eclipses show a secular change\nin their inter-eclipse timings and relative eclipse depths over a multi-year\ntimescale, likely due to orbital precession. The orbital parameters of the\npopulation are estimated by fitting a heartbeat model to their phase curves and\nGaia magnitudes, where the model accounts for ellipsoidal variability, Doppler\nbeaming, reflection effects, and eclipses. We construct the sample's\nperiod-eccentricity distribution and find an eccentricity cutoff (where $e\n\\rightarrow 0$) at a period $1.7$ days. Additionally, we measure the periastron\nadvance rate for the $12$ of the precessing sources and find that they all\nexhibit prograde apsidal precession, which is as high as $9^{\\circ}$ yr$^{-1}$\nfor one of the systems. Using the inferred stellar parameters, we estimate the\ngeneral relativistic precession rate of the argument of periastron for the\npopulation and expect over $30$ systems to show a precession in excess of\n$0.3^{\\circ}$ yr$^{-1}$\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"MQ3QcyA1l6BoQg4X0c-hvaDbNODVPhJw_FyftiLFP2w","pdfSize":"8602681"}