{"id":"2407.02670","title":"Adversarial Magnification to Deceive Deepfake Detection through Super\n  Resolution","authors":"Davide Alessandro Coccomini, Roberto Caldelli, Giuseppe Amato,\n  Fabrizio Falchi, Claudio Gennaro","authorsParsed":[["Coccomini","Davide Alessandro",""],["Caldelli","Roberto",""],["Amato","Giuseppe",""],["Falchi","Fabrizio",""],["Gennaro","Claudio",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 21:17:36 GMT"}],"updateDate":"2024-07-04","timestamp":1719955056000,"abstract":"  Deepfake technology is rapidly advancing, posing significant challenges to\nthe detection of manipulated media content. Parallel to that, some adversarial\nattack techniques have been developed to fool the deepfake detectors and make\ndeepfakes even more difficult to be detected. This paper explores the\napplication of super resolution techniques as a possible adversarial attack in\ndeepfake detection. Through our experiments, we demonstrate that minimal\nchanges made by these methods in the visual appearance of images can have a\nprofound impact on the performance of deepfake detection systems. We propose a\nnovel attack using super resolution as a quick, black-box and effective method\nto camouflage fake images and/or generate false alarms on pristine images. Our\nresults indicate that the usage of super resolution can significantly impair\nthe accuracy of deepfake detectors, thereby highlighting the vulnerability of\nsuch systems to adversarial attacks. The code to reproduce our experiments is\navailable at:\nhttps://github.com/davide-coccomini/Adversarial-Magnification-to-Deceive-Deepfake-Detection-through-Super-Resolution\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"JA8l0sB1tDLUB2VOimojQztxUJzd7ZQJlvR5jBMDbXY","pdfSize":"1708814","objectId":"0x3d0ed54e967430f5f95c96bf18d4e8b05f9d437b5129372dca72767a3d785982","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
