{"id":"2407.05291","title":"WorkArena++: Towards Compositional Planning and Reasoning-based Common\n  Knowledge Work Tasks","authors":"L\\'eo Boisvert, Megh Thakkar, Maxime Gasse, Massimo Caccia, Thibault\n  Le Sellier De Chezelles, Quentin Cappart, Nicolas Chapados, Alexandre\n  Lacoste, Alexandre Drouin","authorsParsed":[["Boisvert","Léo",""],["Thakkar","Megh",""],["Gasse","Maxime",""],["Caccia","Massimo",""],["De Chezelles","Thibault Le Sellier",""],["Cappart","Quentin",""],["Chapados","Nicolas",""],["Lacoste","Alexandre",""],["Drouin","Alexandre",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 07:15:49 GMT"}],"updateDate":"2024-07-09","timestamp":1720336549000,"abstract":"  The ability of large language models (LLMs) to mimic human-like intelligence\nhas led to a surge in LLM-based autonomous agents. Though recent LLMs seem\ncapable of planning and reasoning given user instructions, their effectiveness\nin applying these capabilities for autonomous task solving remains\nunderexplored. This is especially true in enterprise settings, where automated\nagents hold the promise of a high impact. To fill this gap, we propose\nWorkArena++, a novel benchmark consisting of 682 tasks corresponding to\nrealistic workflows routinely performed by knowledge workers. WorkArena++ is\ndesigned to evaluate the planning, problem-solving, logical/arithmetic\nreasoning, retrieval, and contextual understanding abilities of web agents. Our\nempirical studies across state-of-the-art LLMs and vision-language models\n(VLMs), as well as human workers, reveal several challenges for such models to\nserve as useful assistants in the workplace. In addition to the benchmark, we\nprovide a mechanism to effortlessly generate thousands of ground-truth\nobservation/action traces, which can be used for fine-tuning existing models.\nOverall, we expect this work to serve as a useful resource to help the\ncommunity progress toward capable autonomous agents. The benchmark can be found\nat https://github.com/ServiceNow/WorkArena/tree/workarena-plus-plus.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"GtPINubXqK2SZWtlFzcgJLtobZoMQ1hR3bOKQUXFKRo","pdfSize":"24596237"}