{"id":"2407.03575","title":"DGR-MIL: Exploring Diverse Global Representation in Multiple Instance\n  Learning for Whole Slide Image Classification","authors":"Wenhui Zhu, Xiwen Chen, Peijie Qiu, Aristeidis Sotiras, Abolfazl Razi,\n  Yalin Wang","authorsParsed":[["Zhu","Wenhui",""],["Chen","Xiwen",""],["Qiu","Peijie",""],["Sotiras","Aristeidis",""],["Razi","Abolfazl",""],["Wang","Yalin",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 01:58:30 GMT"}],"updateDate":"2024-07-08","timestamp":1720058310000,"abstract":"  Multiple instance learning (MIL) stands as a powerful approach in weakly\nsupervised learning, regularly employed in histological whole slide image (WSI)\nclassification for detecting tumorous lesions. However, existing mainstream MIL\nmethods focus on modeling correlation between instances while overlooking the\ninherent diversity among instances. However, few MIL methods have aimed at\ndiversity modeling, which empirically show inferior performance but with a high\ncomputational cost. To bridge this gap, we propose a novel MIL aggregation\nmethod based on diverse global representation (DGR-MIL), by modeling diversity\namong instances through a set of global vectors that serve as a summary of all\ninstances. First, we turn the instance correlation into the similarity between\ninstance embeddings and the predefined global vectors through a cross-attention\nmechanism. This stems from the fact that similar instance embeddings typically\nwould result in a higher correlation with a certain global vector. Second, we\npropose two mechanisms to enforce the diversity among the global vectors to be\nmore descriptive of the entire bag: (i) positive instance alignment and (ii) a\nnovel, efficient, and theoretically guaranteed diversification learning\nparadigm. Specifically, the positive instance alignment module encourages the\nglobal vectors to align with the center of positive instances (e.g., instances\ncontaining tumors in WSI). To further diversify the global representations, we\npropose a novel diversification learning paradigm leveraging the determinantal\npoint process. The proposed model outperforms the state-of-the-art MIL\naggregation models by a substantial margin on the CAMELYON-16 and the TCGA-lung\ncancer datasets. The code is available at\n\\url{https://github.com/ChongQingNoSubway/DGR-MIL}.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"_dAHK1eGVPVHuObLgijc9V2VUA6eFVx01kiDnCwvfCY","pdfSize":"19447181"}