{"id":"2407.00658","title":"A Fast Online Omnidirectional Quadrupedal Jumping Framework Via\n  Virtual-Model Control and Minimum Jerk Trajectory Generation","authors":"Linzhu Yue, Lingwei Zhang, Zhitao Song, Hongbo Zhang, Jinhu Dong,\n  Xuanqi Zeng, Yun-Hui Liu","authorsParsed":[["Yue","Linzhu",""],["Zhang","Lingwei",""],["Song","Zhitao",""],["Zhang","Hongbo",""],["Dong","Jinhu",""],["Zeng","Xuanqi",""],["Liu","Yun-Hui",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 11:01:43 GMT"}],"updateDate":"2024-07-02","timestamp":1719745303000,"abstract":"  Exploring the limits of quadruped robot agility, particularly in the context\nof rapid and real-time planning and execution of omnidirectional jump\ntrajectories, presents significant challenges due to the complex dynamics\ninvolved, especially when considering significant impulse contacts. This paper\nintroduces a new framework to enable fast, omnidirectional jumping capabilities\nfor quadruped robots. Utilizing minimum jerk technology, the proposed framework\nefficiently generates jump trajectories that exploit its analytical solutions,\nensuring numerical stability and dynamic compatibility with minimal\ncomputational resources. The virtual model control is employed to formulate a\nQuadratic Programming (QP) optimization problem to accurately track the Center\nof Mass (CoM) trajectories during the jump phase. The whole-body control\nstrategies facilitate precise and compliant landing motion. Moreover, the\ndifferent jumping phase is triggered by time-schedule. The framework's efficacy\nis demonstrated through its implementation on an enhanced version of the\nopen-source Mini Cheetah robot. Omnidirectional jumps-including forward,\nbackward, and other directional-were successfully executed, showcasing the\nrobot's capability to perform rapid and consecutive jumps with an average\ntrajectory generation and tracking solution time of merely 50 microseconds.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8uK5KEOOihVUUD-mCpX03lCHaCT5XfdKByhgG1Xq1ww","pdfSize":"4559955","objectId":"0x35e0b5a0dd5fa36ee84f42489ea93496a39a0f8f7ac73f794aaef93de0cabc3d","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
