{"id":"2407.17087","title":"Assessing Non-Nested Configurations of Multifidelity Machine Learning\n  for Quantum-Chemical Properties","authors":"Vivin Vinod and Peter Zaspel","authorsParsed":[["Vinod","Vivin",""],["Zaspel","Peter",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 08:34:08 GMT"}],"updateDate":"2024-07-25","timestamp":1721810048000,"abstract":"  Multifidelity machine learning (MFML) for quantum chemical (QC) properties\nhas seen strong development in the recent years. The method has been shown to\nreduce the cost of generating training data for high-accuracy low-cost ML\nmodels. In such a set-up, the ML models are trained on molecular geometries and\nsome property of interest computed at various computational chemistry\naccuracies, or fidelities. These are then combined in training the MFML models.\nIn some multifidelity models, the training data is required to be nested, that\nis the same molecular geometries are included to calculate the property across\nall the fidelities. In these multifidelity models, the requirement of a nested\nconfiguration restricts the kind of sampling that can be performed while\nselection training samples at different fidelities.\n  This work assesses the use of non-nested training data for two of these\nmultifidelity methods, namely MFML and optimized MFML (o-MFML). The assessment\nis carried out for the prediction of ground state energies and first vertical\nexcitation energies of a diverse collection of molecules of the CheMFi dataset.\nResults indicate that the MFML method still requires a nested structure of\ntraining data across the fidelities. However, the o-MFML method shows promising\nresults for non-nested multifidelity training data with model errors comparable\nto the nested configurations.\n","subjects":["Physics/Chemical Physics","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"V4PlLwFcBKjeCjF3uJ4RJPCUj8ny5nP4EPcqfIqRBjU","pdfSize":"1115871"}