{"id":"2407.14664","title":"Is $F_1$ Score Suboptimal for Cybersecurity Models? Introducing\n  $C_{score}$, a Cost-Aware Alternative for Model Assessment","authors":"Manish Marwah, Asad Narayanan, Stephan Jou, Martin Arlitt, Maria\n  Pospelova","authorsParsed":[["Marwah","Manish",""],["Narayanan","Asad",""],["Jou","Stephan",""],["Arlitt","Martin",""],["Pospelova","Maria",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 21:01:19 GMT"},{"version":"v2","created":"Wed, 31 Jul 2024 15:03:57 GMT"}],"updateDate":"2024-08-01","timestamp":1721422879000,"abstract":"  The cost of errors related to machine learning classifiers, namely, false\npositives and false negatives, are not equal and are application dependent. For\nexample, in cybersecurity applications, the cost of not detecting an attack is\nvery different from marking a benign activity as an attack. Various design\nchoices during machine learning model building, such as hyperparameter tuning\nand model selection, allow a data scientist to trade-off between these two\nerrors. However, most of the commonly used metrics to evaluate model quality,\nsuch as $F_1$ score, which is defined in terms of model precision and recall,\ntreat both these errors equally, making it difficult for users to optimize for\nthe actual cost of these errors. In this paper, we propose a new cost-aware\nmetric, $C_{score}$ based on precision and recall that can replace $F_1$ score\nfor model evaluation and selection. It includes a cost ratio that takes into\naccount the differing costs of handling false positives and false negatives. We\nderive and characterize the new cost metric, and compare it to $F_1$ score.\nFurther, we use this metric for model thresholding for five cybersecurity\nrelated datasets for multiple cost ratios. The results show an average cost\nsavings of 49%.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"CMdOtczqXKWfxsbc5rc29kzEgJSCLqr1PHTWHDhSdI8","pdfSize":"3275098","objectId":"0xd036c0078c3138c5760a073247727200e21c0240feb912fd2c8c7d810d331c23","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
