{"id":"2407.05189","title":"Enhancing Language Learning through Technology: Introducing a New\n  English-Azerbaijani (Arabic Script) Parallel Corpus","authors":"Jalil Nourmohammadi Khiarak, Ammar Ahmadi, Taher Ak-bari Saeed, Meysam\n  Asgari-Chenaghlu, To\\u{g}rul Atabay, Mohammad Reza Baghban Karimi, Ismail\n  Ceferli, Farzad Hasanvand, Seyed Mahboub Mousavi, Morteza Noshad","authorsParsed":[["Khiarak","Jalil Nourmohammadi",""],["Ahmadi","Ammar",""],["Saeed","Taher Ak-bari",""],["Asgari-Chenaghlu","Meysam",""],["Atabay","Toğrul",""],["Karimi","Mohammad Reza Baghban",""],["Ceferli","Ismail",""],["Hasanvand","Farzad",""],["Mousavi","Seyed Mahboub",""],["Noshad","Morteza",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 21:23:20 GMT"}],"updateDate":"2024-07-09","timestamp":1720301000000,"abstract":"  This paper introduces a pioneering English-Azerbaijani (Arabic Script)\nparallel corpus, designed to bridge the technological gap in language learning\nand machine translation (MT) for under-resourced languages. Consisting of\n548,000 parallel sentences and approximately 9 million words per language, this\ndataset is derived from diverse sources such as news articles and holy texts,\naiming to enhance natural language processing (NLP) applications and language\neducation technology. This corpus marks a significant step forward in the realm\nof linguistic resources, particularly for Turkic languages, which have lagged\nin the neural machine translation (NMT) revolution. By presenting the first\ncomprehensive case study for the English-Azerbaijani (Arabic Script) language\npair, this work underscores the transformative potential of NMT in low-resource\ncontexts. The development and utilization of this corpus not only facilitate\nthe advancement of machine translation systems tailored for specific linguistic\nneeds but also promote inclusive language learning through technology. The\nfindings demonstrate the corpus's effectiveness in training deep learning MT\nsystems and underscore its role as an essential asset for researchers and\neducators aiming to foster bilingual education and multilingual communication.\nThis research covers the way for future explorations into NMT applications for\nlanguages lacking substantial digital resources, thereby enhancing global\nlanguage education frameworks. The Python package of our code is available at\nhttps://pypi.org/project/chevir-kartalol/, and we also have a website\naccessible at https://translate.kartalol.com/.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"hnPvs8BkzhKPEhMcrg1O0b1CyPuNRuXlK2zM3sQjeWg","pdfSize":"337663"}