{"id":"2407.05789","title":"CANDID DAC: Leveraging Coupled Action Dimensions with Importance\n  Differences in DAC","authors":"Philipp Bordne, M. Asif Hasan, Eddie Bergman, Noor Awad, Andr\\'e\n  Biedenkapp","authorsParsed":[["Bordne","Philipp",""],["Hasan","M. Asif",""],["Bergman","Eddie",""],["Awad","Noor",""],["Biedenkapp","André",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 09:51:02 GMT"},{"version":"v2","created":"Tue, 17 Sep 2024 09:32:15 GMT"}],"updateDate":"2024-09-18","timestamp":1720432262000,"abstract":"  High-dimensional action spaces remain a challenge for dynamic algorithm\nconfiguration (DAC). Interdependencies and varying importance between action\ndimensions are further known key characteristics of DAC problems. We argue that\nthese Coupled Action Dimensions with Importance Differences (CANDID) represent\naspects of the DAC problem that are not yet fully explored. To address this\ngap, we introduce a new white-box benchmark within the DACBench suite that\nsimulates the properties of CANDID. Further, we propose sequential policies as\nan effective strategy for managing these properties. Such policies factorize\nthe action space and mitigate exponential growth by learning a policy per\naction dimension. At the same time, these policies accommodate the\ninterdependence of action dimensions by fostering implicit coordination. We\nshow this in an experimental study of value-based policies on our new\nbenchmark. This study demonstrates that sequential policies significantly\noutperform independent learning of factorized policies in CANDID action spaces.\nIn addition, they overcome the scalability limitations associated with learning\na single policy across all action dimensions. The code used for our experiments\nis available under https://github.com/PhilippBordne/candidDAC.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"EYWCtO-2XsR7oeOtAFooqIzts7QcQidBeclDz-gK0gw","pdfSize":"2817831"}