{"id":"2407.04711","title":"MetaFruit Meets Foundation Models: Leveraging a Comprehensive\n  Multi-Fruit Dataset for Advancing Agricultural Foundation Models","authors":"Jiajia Li, Kyle Lammers, Xunyuan Yin, Xiang Yin, Long He, Renfu Lu,\n  Zhaojian Li","authorsParsed":[["Li","Jiajia",""],["Lammers","Kyle",""],["Yin","Xunyuan",""],["Yin","Xiang",""],["He","Long",""],["Lu","Renfu",""],["Li","Zhaojian",""]],"versions":[{"version":"v1","created":"Tue, 14 May 2024 00:13:47 GMT"}],"updateDate":"2024-07-09","timestamp":1715645627000,"abstract":"  Fruit harvesting poses a significant labor and financial burden for the\nindustry, highlighting the critical need for advancements in robotic harvesting\nsolutions. Machine vision-based fruit detection has been recognized as a\ncrucial component for robust identification of fruits to guide robotic\nmanipulation. Despite considerable progress in leveraging deep learning and\nmachine learning techniques for fruit detection, a common shortfall is the\ninability to swiftly extend the developed models across different orchards\nand/or various fruit species. Additionally, the limited availability of\npertinent data further compounds these challenges. In this work, we introduce\nMetaFruit, the largest publicly available multi-class fruit dataset, comprising\n4,248 images and 248,015 manually labeled instances across diverse U.S.\norchards. Furthermore, this study proposes an innovative open-set fruit\ndetection system leveraging advanced Vision Foundation Models (VFMs) for fruit\ndetection that can adeptly identify a wide array of fruit types under varying\norchard conditions. This system not only demonstrates remarkable adaptability\nin learning from minimal data through few-shot learning but also shows the\nability to interpret human instructions for subtle detection tasks. The\nperformance of the developed foundation model is comprehensively evaluated\nusing several metrics, which outperforms the existing state-of-the-art\nalgorithms in both our MetaFruit dataset and other open-sourced fruit datasets,\nthereby setting a new benchmark in the field of agricultural technology and\nrobotic harvesting. The MetaFruit dataset and detection framework are\nopen-sourced to foster future research in vision-based fruit harvesting,\nmarking a significant stride toward addressing the urgent needs of the\nagricultural sector.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"-SlFIeQqbiqNhydUueFj7upI4jb1_Prt61DZVtp4M2E","pdfSize":"14714013"}