{"id":"2407.16684","title":"AutoRG-Brain: Grounded Report Generation for Brain MRI","authors":"Jiayu Lei, Xiaoman Zhang, Chaoyi Wu, Lisong Dai, Ya Zhang, Yanyong\n  Zhang, Yanfeng Wang, Weidi Xie and Yuehua Li","authorsParsed":[["Lei","Jiayu",""],["Zhang","Xiaoman",""],["Wu","Chaoyi",""],["Dai","Lisong",""],["Zhang","Ya",""],["Zhang","Yanyong",""],["Wang","Yanfeng",""],["Xie","Weidi",""],["Li","Yuehua",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 17:50:00 GMT"},{"version":"v2","created":"Fri, 26 Jul 2024 07:58:24 GMT"},{"version":"v3","created":"Tue, 30 Jul 2024 02:15:03 GMT"}],"updateDate":"2024-07-31","timestamp":1721757000000,"abstract":"  Radiologists are tasked with interpreting a large number of images in a daily\nbase, with the responsibility of generating corresponding reports. This\ndemanding workload elevates the risk of human error, potentially leading to\ntreatment delays, increased healthcare costs, revenue loss, and operational\ninefficiencies. To address these challenges, we initiate a series of work on\ngrounded Automatic Report Generation (AutoRG), starting from the brain MRI\ninterpretation system, which supports the delineation of brain structures, the\nlocalization of anomalies, and the generation of well-organized findings. We\nmake contributions from the following aspects, first, on dataset construction,\nwe release a comprehensive dataset encompassing segmentation masks of anomaly\nregions and manually authored reports, termed as RadGenome-Brain MRI. This data\nresource is intended to catalyze ongoing research and development in the field\nof AI-assisted report generation systems. Second, on system design, we propose\nAutoRG-Brain, the first brain MRI report generation system with pixel-level\ngrounded visual clues. Third, for evaluation, we conduct quantitative\nassessments and human evaluations of brain structure segmentation, anomaly\nlocalization, and report generation tasks to provide evidence of its\nreliability and accuracy. This system has been integrated into real clinical\nscenarios, where radiologists were instructed to write reports based on our\ngenerated findings and anomaly segmentation masks. The results demonstrate that\nour system enhances the report-writing skills of junior doctors, aligning their\nperformance more closely with senior doctors, thereby boosting overall\nproductivity.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition","Quantitative Biology/Neurons and Cognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"pC15S1Q68phwaAxixaXOcqY4KwLEWn8HKbJixXjtX9Q","pdfSize":"4673809"}