{"id":"2407.11053","title":"Sampling and active learning methods for network reliability estimation\n  using K-terminal spanning tree","authors":"Chen Ding, Pengfei Wei, Yan Shi, Jinxing Liu, Matteo Broggi, Michael\n  Beer","authorsParsed":[["Ding","Chen",""],["Wei","Pengfei",""],["Shi","Yan",""],["Liu","Jinxing",""],["Broggi","Matteo",""],["Beer","Michael",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 08:51:53 GMT"}],"updateDate":"2024-07-17","timestamp":1720515113000,"abstract":"  Network reliability analysis remains a challenge due to the increasing size\nand complexity of networks. This paper presents a novel sampling method and an\nactive learning method for efficient and accurate network reliability\nestimation under node failure and edge failure scenarios. The proposed sampling\nmethod adopts Monte Carlo technique to sample component lifetimes and the\nK-terminal spanning tree algorithm to accelerate structure function\ncomputation. Unlike existing methods that compute only one structure function\nvalue per sample, our method generates multiple component state vectors and\ncorresponding structure function values from each sample. Network reliability\nis estimated based on survival signatures derived from these values. A\ntransformation technique extends this method to handle both node failure and\nedge failure. To enhance efficiency of proposed sampling method and achieve\nadaptability to network topology changes, we introduce an active learning\nmethod utilizing a random forest (RF) classifier. This classifier directly\npredicts structure function values, integrates network behaviors across diverse\ntopologies, and undergoes iterative refinement to enhance predictive accuracy.\nImportantly, the trained RF classifier can directly predict reliability for\nvariant networks, a capability beyond the sampling method alone. Through\ninvestigating several network examples and two practical applications, the\neffectiveness of both proposed methods is demonstrated.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"1bKMz7YbnDFhluQXDyq_-22TCRnV_HR4jnlY8pfPvv8","pdfSize":"2069342"}