{"id":"2407.16119","title":"Uncertainty-Aware Deep Neural Representations for Visual Analysis of\n  Vector Field Data","authors":"Atul Kumar and Siddharth Garg and Soumya Dutta","authorsParsed":[["Kumar","Atul",""],["Garg","Siddharth",""],["Dutta","Soumya",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 01:59:58 GMT"},{"version":"v2","created":"Sat, 10 Aug 2024 10:06:38 GMT"}],"updateDate":"2024-08-13","timestamp":1721699998000,"abstract":"  The widespread use of Deep Neural Networks (DNNs) has recently resulted in\ntheir application to challenging scientific visualization tasks. While advanced\nDNNs demonstrate impressive generalization abilities, understanding factors\nlike prediction quality, confidence, robustness, and uncertainty is crucial.\nThese insights aid application scientists in making informed decisions.\nHowever, DNNs lack inherent mechanisms to measure prediction uncertainty,\nprompting the creation of distinct frameworks for constructing robust\nuncertainty-aware models tailored to various visualization tasks. In this work,\nwe develop uncertainty-aware implicit neural representations to model\nsteady-state vector fields effectively. We comprehensively evaluate the\nefficacy of two principled deep uncertainty estimation techniques: (1) Deep\nEnsemble and (2) Monte Carlo Dropout, aimed at enabling uncertainty-informed\nvisual analysis of features within steady vector field data. Our detailed\nexploration using several vector data sets indicate that uncertainty-aware\nmodels generate informative visualization results of vector field features.\nFurthermore, incorporating prediction uncertainty improves the resilience and\ninterpretability of our DNN model, rendering it applicable for the analysis of\nnon-trivial vector field data sets.\n","subjects":["Computing Research Repository/Graphics","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"XkVEKG9ZuJcNvrwY7jG_t45ZvV9oF9xUCjFuaTCZ2ag","pdfSize":"26835074","objectId":"0xda818cbbcf2447819d363b46add1e1754cfb756a7964b3234be71d7ddddaf9d2","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
