{"id":"2407.03931","title":"LeDNet: Localization-enabled Deep Neural Network for Multi-Label\n  Radiography Image Classification","authors":"Lalit Pant and Shubham Arora","authorsParsed":[["Pant","Lalit",""],["Arora","Shubham",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 13:46:30 GMT"}],"updateDate":"2024-07-08","timestamp":1720100790000,"abstract":"  Multi-label radiography image classification has long been a topic of\ninterest in neural networks research. In this paper, we intend to classify such\nimages using convolution neural networks with novel localization techniques. We\nwill use the chest x-ray images to detect thoracic diseases for this purpose.\nFor accurate diagnosis, it is crucial to train the network with good quality\nimages. But many chest X-ray images have irrelevant external objects like\ndistractions created by faulty scans, electronic devices scanned next to lung\nregion, scans inadvertently capturing bodily air etc. To address these, we\npropose a combination of localization and deep learning algorithms called\nLeDNet to predict thoracic diseases with higher accuracy. We identify and\nextract the lung region masks from chest x-ray images through localization.\nThese masks are superimposed on the original X-ray images to create the mask\noverlay images. DenseNet-121 classification models are then used for feature\nselection to retrieve features of the entire chest X-ray images and the\nlocalized mask overlay images. These features are then used to predict disease\nclassification. Our experiments involve comparing classification results\nobtained with original CheXpert images and mask overlay images. The comparison\nis demonstrated through accuracy and loss curve analyses.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"PWDaiJqxz1Cc3Nv2ossvN2WzNlh_xI-c4AL92vJm7DY","pdfSize":"552460"}