{"id":"2407.07132","title":"The neutron star mass, distance, and inclination from precision timing\n  of the brilliant millisecond pulsar J0437$-$4715","authors":"Daniel J. Reardon, Matthew Bailes, Ryan M. Shannon, Chris Flynn, Jacob\n  Askew, N. D. Ramesh Bhat, Zu-Cheng Chen, Ma{\\l}gorzata Cury{\\l}o, Yi Feng,\n  George B. Hobbs, Agastya Kapur, Matthew Kerr, Xiaojin Liu, Richard N.\n  Manchester, Rami Mandow, Saurav Mishra, Christopher J. Russell, Mohsen\n  Shamohammadi, Lei Zhang, and Andrew Zic","authorsParsed":[["Reardon","Daniel J.",""],["Bailes","Matthew",""],["Shannon","Ryan M.",""],["Flynn","Chris",""],["Askew","Jacob",""],["Bhat","N. D. Ramesh",""],["Chen","Zu-Cheng",""],["Curyło","Małgorzata",""],["Feng","Yi",""],["Hobbs","George B.",""],["Kapur","Agastya",""],["Kerr","Matthew",""],["Liu","Xiaojin",""],["Manchester","Richard N.",""],["Mandow","Rami",""],["Mishra","Saurav",""],["Russell","Christopher J.",""],["Shamohammadi","Mohsen",""],["Zhang","Lei",""],["Zic","Andrew",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 12:00:42 GMT"},{"version":"v2","created":"Wed, 31 Jul 2024 00:08:22 GMT"}],"updateDate":"2024-08-01","timestamp":1720526442000,"abstract":"  The observation of neutron stars enables the otherwise impossible study of\nfundamental physical processes. The timing of binary radio pulsars is\nparticularly powerful, as it enables precise characterization of their\n(three-dimensional) positions and orbits. PSR~J0437$-$4715 is an important\nmillisecond pulsar for timing array experiments and is also a primary target\nfor the Neutron Star Interior Composition Explorer (NICER). The main aim of the\nNICER mission is to constrain the neutron star equation of state by inferring\nthe compactness ($M_p/R$) of the star. Direct measurements of the mass $M_p$\nfrom pulsar timing therefore substantially improve constraints on the radius\n$R$ and the equation of state. Here we use observations spanning 26 years from\nMurriyang, the 64-m Parkes radio telescope, to improve the timing model for\nthis pulsar. Among the new precise measurements are the pulsar mass\n$M_p=1.418\\pm 0.044$ $M_{\\odot}$, distance $D=156.96 \\pm 0.11$ pc, and orbital\ninclination angle $i=137.506 \\pm 0.016^\\circ$, which can be used to inform the\nX-ray pulse profile models inferred from NICER observations. We demonstrate\nthat these results are consistent between multiple data sets from the Parkes\nPulsar Timing Array (PPTA), each modeled with different noise assumptions.\nUsing the longest available PPTA data set, we measure an apparent second\nderivative of the pulsar spin frequency and discuss how this can be explained\neither by kinematic effects due to the proper motion and radial velocity of the\npulsar or excess low-frequency noise such as a gravitational-wave background.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Solar and Stellar Astrophysics","Physics/Nuclear Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"jG7DzeoVMpzabjt5Yqc81kVB1uTVitVItpjwvxocD0o","pdfSize":"2101071"}