{"id":"2407.05018","title":"Wrinkle formation during uniaxial compression of a graphene sheet lying\n  on a soft (polymer) substrate","authors":"Alexander V. Savin","authorsParsed":[["Savin","Alexander V.",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 09:21:44 GMT"}],"updateDate":"2024-07-09","timestamp":1720257704000,"abstract":"  Modeling of wrinkles and folds formation in single and multilayer graphene\nsheets lying on flat deformable (polymer) substrates has been carried out. It\nis shown that the deformability of the substrate leads to the appearance of\nsignificant features. In contrast to the flat surfaces of rigid crystals\nmolecules of soft polymer substrates can penetrate into wrinkles and folds of\nthe graphene sheet, completely filling the voids beneath the sheet. Moreover,\nthe vertical folds of the sheet can be directed not only upward from the\nsubstrate, but also down into the substrate, penetrating it. By modeling the\nuniaxial compression of the two-component graphene/polymer system, the external\npressure and thermal vibrations of the substrate molecules have been taken into\naccount. High external pressure $p\\ge 150$~bar leads to a noticeable additional\nstabilization of the initial ground state of the system. At uniaxial\ncompression above the critical value, a system of localized wrinkles whose\ninterior is filled with molecules of the substrate appears in the graphene\nsheet. Increasing temperature leads to an increase in the size of wrinkles and\nto a decrease in their number. The largest wrinkles form before the substrate\nbegins to melt. Melting leads to the complete disappearance of all wrinkles and\nsmall folds. Cooling of the melted substrate leads to its crystallization, but\nthe system of wrinkles in the graphene sheet on the surface is not restored.\nTherefore, melting of the polymer substrate and its subsequent cooling can\nserve as a method getting rid of localized wrinkles and folds of the graphene\nsheet.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"aEnhyM7AkrO8BP2nHchPv-qBGBiqIFda7bUPMgyuA-A","pdfSize":"4250980"}