{"id":"2407.14351","title":"Photon Generation in Double Superconducting Cavities: Quantum Circuits\n  Implementation","authors":"Jean Paul Louys Sans\\'o, Nicol\\'as F. Del Grosso, Fernando C.\n  Lombardo, Paula I. Villar","authorsParsed":[["Sansó","Jean Paul Louys",""],["Del Grosso","Nicolás F.",""],["Lombardo","Fernando C.",""],["Villar","Paula I.",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 14:33:45 GMT"}],"updateDate":"2024-07-22","timestamp":1721399625000,"abstract":"  In this work, we studied photon generation due to the Dynamical Casimir\nEffect (DCE) in a one dimensional (1+1) double superconducting cavity. The\ncavity consists of two perfectly conducting mirrors and a dielectric membrane\nof infinitesimal depth that effectively couples two cavities. The total length\nof the double cavity $L$, the difference in length between the two cavities\n$\\Delta L$, and the electric susceptibility $\\chi$ and conductivity $v$ of the\ndielectric membrane are tunable parameters. All four parameters are treated as\nindependent and are allowed to be tuned at the same time, even with different\nfrequencies. We analyzed the cavity's energy spectra under different\nconditions, finding a transition between two distinct regimes that is\naccurately described by $k_c=\\sqrt{v/\\chi}$. In particular, a lowest energy\nmode is forbidden in one of the regimes while it is allowed in the other. We\ncompared analytical approximations obtained through the Multiple Scale Analysis\nmethod with exact numeric solutions, obtaining the typical results when $\\chi$\nis not being tuned. However, when the susceptibility $\\chi$ is tuned, different\nbehaviours (such as oscillations in the number of photons of a cavity prepared\nin a vacuum state) might arise if the frequencies and amplitudes of all\nparameters are adequate. These oscillations can be considered as adiabatic\nshortcuts where all generated photons are eventually destroyed. Finally, we\npresent an equivalent quantum circuit that would allow to experimentally\nsimulate the DCE under the studied conditions.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Other Condensed Matter"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"EYmc2L1mlgCKjdevVUlxL3yfLFpisHVX-MA89LFd9_E","pdfSize":"1805848"}