{"id":"2407.14796","title":"PASSION: Towards Effective Incomplete Multi-Modal Medical Image\n  Segmentation with Imbalanced Missing Rates","authors":"Junjie Shi, Caozhi Shang, Zhaobin Sun, Li Yu, Xin Yang, and Zengqiang\n  Yan","authorsParsed":[["Shi","Junjie",""],["Shang","Caozhi",""],["Sun","Zhaobin",""],["Yu","Li",""],["Yang","Xin",""],["Yan","Zengqiang",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 07:53:20 GMT"}],"updateDate":"2024-07-23","timestamp":1721462000000,"abstract":"  Incomplete multi-modal image segmentation is a fundamental task in medical\nimaging to refine deployment efficiency when only partial modalities are\navailable. However, the common practice that complete-modality data is visible\nduring model training is far from realistic, as modalities can have imbalanced\nmissing rates in clinical scenarios. In this paper, we, for the first time,\nformulate such a challenging setting and propose Preference-Aware\nSelf-diStillatION (PASSION) for incomplete multi-modal medical image\nsegmentation under imbalanced missing rates. Specifically, we first construct\npixel-wise and semantic-wise self-distillation to balance the optimization\nobjective of each modality. Then, we define relative preference to evaluate the\ndominance of each modality during training, based on which to design task-wise\nand gradient-wise regularization to balance the convergence rates of different\nmodalities. Experimental results on two publicly available multi-modal datasets\ndemonstrate the superiority of PASSION against existing approaches for modality\nbalancing. More importantly, PASSION is validated to work as a plug-and-play\nmodule for consistent performance improvement across different backbones. Code\nis available at https://github.com/Jun-Jie-Shi/PASSION.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"EMnM5Xt6mr5dH4IQ3oAsv3qvOuoUL7K1IjNdRCMbbB4","pdfSize":"3977128"}