{"id":"2407.03891","title":"AutoBench: Automatic Testbench Generation and Evaluation Using LLMs for\n  HDL Design","authors":"Ruidi Qiu, Grace Li Zhang, Rolf Drechsler, Ulf Schlichtmann, Bing Li","authorsParsed":[["Qiu","Ruidi",""],["Zhang","Grace Li",""],["Drechsler","Rolf",""],["Schlichtmann","Ulf",""],["Li","Bing",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 12:33:56 GMT"},{"version":"v2","created":"Tue, 20 Aug 2024 09:19:07 GMT"}],"updateDate":"2024-08-21","timestamp":1720096436000,"abstract":"  In digital circuit design, testbenches constitute the cornerstone of\nsimulation-based hardware verification. Traditional methodologies for testbench\ngeneration during simulation-based hardware verification still remain partially\nmanual, resulting in inefficiencies in testing various scenarios and requiring\nexpensive time from designers. Large Language Models (LLMs) have demonstrated\ntheir potential in automating the circuit design flow. However, directly\napplying LLMs to generate testbenches suffers from a low pass rate. To address\nthis challenge, we introduce AutoBench, the first LLM-based testbench generator\nfor digital circuit design, which requires only the description of the design\nunder test (DUT) to automatically generate comprehensive testbenches. In\nAutoBench, a hybrid testbench structure and a self-checking system are realized\nusing LLMs. To validate the generated testbenches, we also introduce an\nautomated testbench evaluation framework to evaluate the quality of generated\ntestbenches from multiple perspectives. Experimental results demonstrate that\nAutoBench achieves a 57% improvement in the testbench pass@1 ratio compared\nwith the baseline that directly generates testbenches using LLMs. For 75\nsequential circuits, AutoBench successfully has a 3.36 times testbench pass@1\nratio compared with the baseline. The source codes and experimental results are\nopen-sourced at this link: https://github.com/AutoBench/AutoBench\n","subjects":["Computing Research Repository/Software Engineering","Computing Research Repository/Programming Languages"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"9-CYJjlxsG-7AvK1td2A0KlJxU1JKfgi1Srbw_uT6Jk","pdfSize":"1005314"}