{"id":"2407.17543","title":"Dataset Distribution Impacts Model Fairness: Single vs. Multi-Task\n  Learning","authors":"Ralf Raumanns, Gerard Schouten, Josien P. W. Pluim, Veronika\n  Cheplygina","authorsParsed":[["Raumanns","Ralf",""],["Schouten","Gerard",""],["Pluim","Josien P. W.",""],["Cheplygina","Veronika",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 15:23:26 GMT"}],"updateDate":"2024-07-26","timestamp":1721834606000,"abstract":"  The influence of bias in datasets on the fairness of model predictions is a\ntopic of ongoing research in various fields. We evaluate the performance of\nskin lesion classification using ResNet-based CNNs, focusing on patient sex\nvariations in training data and three different learning strategies. We present\na linear programming method for generating datasets with varying patient sex\nand class labels, taking into account the correlations between these variables.\nWe evaluated the model performance using three different learning strategies: a\nsingle-task model, a reinforcing multi-task model, and an adversarial learning\nscheme. Our observations include: 1) sex-specific training data yields better\nresults, 2) single-task models exhibit sex bias, 3) the reinforcement approach\ndoes not remove sex bias, 4) the adversarial model eliminates sex bias in cases\ninvolving only female patients, and 5) datasets that include male patients\nenhance model performance for the male subgroup, even when female patients are\nthe majority. To generalise these findings, in future research, we will examine\nmore demographic attributes, like age, and other possibly confounding factors,\nsuch as skin colour and artefacts in the skin lesions. We make all data and\nmodels available on GitHub.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"XhCv7CxGFLLFvraLI9Cu8rU2xGAhPo_TrQZ7HZAX3ao","pdfSize":"193872"}