{"id":"2407.13374","title":"A unifying modelling approach for hierarchical distributed lag models","authors":"Theo Economou, Daphne Parliari, Aurelio Tobias, Laura Dawkins, Oliver\n  Stoner, Hamish Steptoe, Rachel Lowe, Maria Athanasiadou, Christophe Sarran,\n  Jos Lelieveld","authorsParsed":[["Economou","Theo",""],["Parliari","Daphne",""],["Tobias","Aurelio",""],["Dawkins","Laura",""],["Stoner","Oliver",""],["Steptoe","Hamish",""],["Lowe","Rachel",""],["Athanasiadou","Maria",""],["Sarran","Christophe",""],["Lelieveld","Jos",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 10:30:46 GMT"}],"updateDate":"2024-07-19","timestamp":1721298646000,"abstract":"  We present a statistical modelling framework for implementing Distributed Lag\nModels (DLMs), encompassing several extensions of the approach to capture the\ntemporally distributed effect from covariates via regression. We place DLMs in\nthe context of penalised Generalized Additive Models (GAMs) and illustrate that\nimplementation via the R package \\texttt{mgcv}, which allows for flexible and\ninterpretable inference in addition to thorough model assessment. We show how\nthe interpretation of penalised splines as random quantities enables\napproximate Bayesian inference and hierarchical structures in the same\npractical setting. We focus on epidemiological studies and demonstrate the\napproach with application to mortality data from Cyprus and Greece. For the\nCyprus case study, we investigate for the first time, the joint lagged effects\nfrom both temperature and humidity on mortality risk with the unexpected result\nthat humidity severely increases risk during cold rather than hot conditions.\nAnother novel application is the use of the proposed framework for hierarchical\npooling, to estimate district-specific covariate-lag risk on morality and the\nuse of posterior simulation to compare risk across districts.\n","subjects":["Statistics/Methodology","Statistics/Applications"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Zuda7jigSlaDfwOa4-dFR2of8JVLStsrB2WIyl52Gt4","pdfSize":"5243077"}