{"id":"2407.10573","title":"Tidal Dissipation in Evolved Low and Intermediate Mass Stars","authors":"M. Esseldeurs, S. Mathis, and L. Decin","authorsParsed":[["Esseldeurs","M.",""],["Mathis","S.",""],["Decin","L.",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 09:42:43 GMT"}],"updateDate":"2024-07-16","timestamp":1721036563000,"abstract":"  As the observed occurrence for planets or stellar companions orbiting low and\nintermediate-mass evolved stars is increasing, so does the importance of\nunderstanding and evaluating the strength of their interactions. One of the\nfundamental mechanisms to understand this interaction is the tidal dissipation\nin these stars, as it is one of the engines of orbital/rotational evolution of\nstar-planet/star-star systems. This article builds on previous works studying\nthe evolution of the tidal dissipation along the pre-MS and the MS, which have\nshown the strong link between the structural and rotational evolution of stars\nand tidal dissipation. This article provides for the first time a complete\npicture of tidal dissipation along the entire evolution of low and\nintermediate-mass stars, including the advanced phases of evolution. Using\nstellar evolutionary models, the internal structure of the star is computed\nfrom the pre-MS all the way up to the white dwarf phase, for stars with initial\nmass between 1 and 4 Msun. Tidal dissipation is separated into two components:\nthe dissipation of the equilibrium (non-wavelike) tide and the dissipation of\nthe dynamical (wavelike) tide. For evolved stars the dynamical tide is\nconstituted by progressive internal gravity waves. The significance of both the\nequilibrium and dynamical tide dissipation becomes apparent within distinct\ndomains of the parameter space. The dissipation of the equilibrium tide is\ndominant when the star is large in size or the companion is far away from the\nstar. Conversely the dissipation of the dynamical tide is important when the\nstar is small in size or the companion is close to the star. Both the\nequilibrium and the dynamical tides are important in evolved stars, and\ntherefore both need to be taken into account when studying the tidal\ndissipation in evolved stars and the evolution of planetary or/and stellar\ncompanions orbiting them.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"mOe5RqMIBTMGJVxoJduh_pBuCtyS4Wnbyr9dDcUShKU","pdfSize":"10898161"}