{"id":"2407.19694","title":"Structural damage detection via hierarchical damage information with\n  volumetric assessment","authors":"Isaac Osei Agyemang, Jianwen Chen, Liaoyuan Zeng, Isaac Adjei-Mensah,\n  Daniel Acheampong, Gordon Owusu Boateng, Adu Asare Baffour","authorsParsed":[["Agyemang","Isaac Osei",""],["Chen","Jianwen",""],["Zeng","Liaoyuan",""],["Adjei-Mensah","Isaac",""],["Acheampong","Daniel",""],["Boateng","Gordon Owusu",""],["Baffour","Adu Asare",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 04:33:04 GMT"}],"updateDate":"2024-07-30","timestamp":1722227584000,"abstract":"  Image environments and noisy labels hinder deep learning-based inference\nmodels in structural damage detection. Post-detection, there is the challenge\nof reliance on manual assessments of detected damages. As a result,\nGuided-DetNet, characterized by Generative Attention Module (GAM), Hierarchical\nElimination Algorithm (HEA), and Volumetric Contour Visual Assessment (VCVA),\nis proposed to mitigate complex image environments, noisy labeling, and\npost-detection manual assessment of structural damages. GAM leverages\ncross-horizontal and cross-vertical patch merging and cross\nforeground-background feature fusion to generate varied features to mitigate\ncomplex image environments. HEA addresses noisy labeling using hierarchical\nrelationships among classes to refine instances given an image by eliminating\nunlikely class categories. VCVA assesses the severity of detected damages via\nvolumetric representation and quantification leveraging the Dirac delta\ndistribution. A comprehensive quantitative study, two robustness tests, and an\napplication scenario based on the PEER Hub Image-Net dataset substantiate\nGuided-DetNet's promising performances. Guided-DetNet outperformed the\nbest-compared models in a triple classification task by a difference of not\nless than 3% and not less than 2% in a dual detection task under varying\nmetrics.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"NxZYqPiN_UTlDVApsJHeu4zq88v8MCTCynv1CLdssUg","pdfSize":"5125115"}