{"id":"2407.15291","title":"Evidence-Based Temporal Fact Verification","authors":"Anab Maulana Barik, Wynne Hsu, Mong Li Lee","authorsParsed":[["Barik","Anab Maulana",""],["Hsu","Wynne",""],["Lee","Mong Li",""]],"versions":[{"version":"v1","created":"Sun, 21 Jul 2024 23:13:05 GMT"},{"version":"v2","created":"Mon, 19 Aug 2024 01:31:22 GMT"}],"updateDate":"2024-08-20","timestamp":1721603585000,"abstract":"  Automated fact verification plays an essential role in fostering trust in the\ndigital space. Despite the growing interest, the verification of temporal facts\nhas not received much attention in the community. Temporal fact verification\nbrings new challenges where cues of the temporal information need to be\nextracted and temporal reasoning involving various temporal aspects of the text\nmust be applied. In this work, we propose an end-to-end solution for temporal\nfact verification that considers the temporal information in claims to obtain\nrelevant evidence sentences and harness the power of large language model for\ntemporal reasoning. Recognizing that temporal facts often involve events, we\nmodel these events in the claim and evidence sentences. We curate two temporal\nfact datasets to learn time-sensitive representations that encapsulate not only\nthe semantic relationships among the events, but also their chronological\nproximity. This allows us to retrieve the top-k relevant evidence sentences and\nprovide the context for a large language model to perform temporal reasoning\nand outputs whether a claim is supported or refuted by the retrieved evidence\nsentences. Experiment results demonstrate that the proposed approach\nsignificantly enhances the accuracy of temporal claim verification, thereby\nadvancing current state-of-the-art in automated fact verification.\n","subjects":["Computing Research Repository/Information Retrieval"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8PMCyAWjuvouzxAQH-YUr3mC496_8-dDC-Z9cpOLonY","pdfSize":"2511763","objectId":"0xfbf4b40476d62ea17f4ee5cd50682c02c928030140916aebabf26a811271df0c","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
