{"id":"2407.21688","title":"Twirled worlds: symmetry-induced failures of tomographic locality","authors":"Daniel Centeno, Marco Erba, David Schmid, John H. Selby, Robert W.\n  Spekkens, Sina Soltani, Jacopo Surace, Alex Wilce, and Y\\`il\\`e Y\\=ing","authorsParsed":[["Centeno","Daniel",""],["Erba","Marco",""],["Schmid","David",""],["Selby","John H.",""],["Spekkens","Robert W.",""],["Soltani","Sina",""],["Surace","Jacopo",""],["Wilce","Alex",""],["Yīng","Yìlè",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 15:29:36 GMT"}],"updateDate":"2024-08-01","timestamp":1722439776000,"abstract":"  Tomographic locality is a principle commonly used in the program of finding\naxioms that pick out quantum theory within the landscape of possible theories.\nThe principle asserts the sufficiency of local measurements for achieving a\ntomographic characterization of any bipartite state. In this work, we explore\nthe meaning of the principle of tomographic locality by developing a simple\nscheme for generating a wide variety of theories that violate the principle. In\nthis scheme, one starts with a tomographically local theory -- which can be\nclassical, quantum or post-quantum -- and a physical symmetry, and one\nrestricts the processes in the theory to all and only those that are covariant\nwith respect to that symmetry. We refer to the resulting theories as twirled\nworlds. We show that failures of tomographic locality are ubiquitous in twirled\nworlds. From the possibility of such failures in classical twirled worlds, we\nargue that the failure of tomographic locality (i.e., tomographic nonlocality)\ndoes not imply ontological holism. Our results also demonstrate the need for\nresearchers seeking to axiomatize quantum theory to take a stand on the\nquestion of whether there are superselection rules that have a fundamental\nstatus.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"EutQX9kXNmQvjJzSyXfpYVa_l5rFEz75MbBDQCfm5Uw","pdfSize":"725827"}