{"id":"2407.18795","title":"Lectures on Parallel Computing","authors":"Jesper Larsson Tr\\\"aff","authorsParsed":[["Träff","Jesper Larsson",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 14:58:22 GMT"}],"updateDate":"2024-07-29","timestamp":1722005902000,"abstract":"  These lecture notes are designed to accompany an imaginary, virtual,\nundergraduate, one or two semester course on fundamentals of Parallel Computing\nas well as to serve as background and reference for graduate courses on\nHigh-Performance Computing, parallel algorithms and shared-memory\nmultiprocessor programming. They introduce theoretical concepts and tools for\nexpressing, analyzing and judging parallel algorithms and, in detail, cover the\ntwo most widely used concrete frameworks OpenMP and MPI as well as the\nthreading interface pthreads for writing parallel programs for either shared or\ndistributed memory parallel computers with emphasis on general concepts and\nprinciples. Code examples are given in a C-like style and many are actual,\ncorrect C code. The lecture notes deliberately do not cover GPU architectures\nand GPU programming, but the general concerns, guidelines and principles (time,\nwork, cost, efficiency, scalability, memory structure and bandwidth) will be\njust as relevant for efficiently utilizing various GPU architectures. Likewise,\nthe lecture notes focus on deterministic algorithms only and do not use\nrandomization. The student of this material will find it instructive to take\nthe time to understand concepts and algorithms visually. The exercises can be\nused for self-study and as inspiration for small implementation projects in\nOpenMP and MPI that can and should accompany any serious course on Parallel\nComputing. The student will benefit from actually implementing and carefully\nbenchmarking the suggested algorithms on the parallel computing system that may\nor should be made available as part of such a Parallel Computing course. In\nclass, the exercises can be used as basis for hand-ins and small programming\nprojects for which sufficient, additional detail and precision should be\nprovided by the instructor.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"INyRFw3Ap2ectjLEEcEDf1kQqgvoqc9YZnb21QpWRKY","pdfSize":"2745983"}