{"id":"2407.05525","title":"Advances in quantum metrology with dielectrically structured single\n  photon sources based on molecules","authors":"Pietro Lombardi, Hristina Georgieva, Franziska Hirt, Juergen Mony,\n  Rocco Duquennoy, Ramin Emadi, Maria Guadalupe Aparicio, Maja Colautti, Marco\n  L\\'opez, Stefan K\\\"uck and Costanza Toninelli","authorsParsed":[["Lombardi","Pietro",""],["Georgieva","Hristina",""],["Hirt","Franziska",""],["Mony","Juergen",""],["Duquennoy","Rocco",""],["Emadi","Ramin",""],["Aparicio","Maria Guadalupe",""],["Colautti","Maja",""],["López","Marco",""],["Kück","Stefan",""],["Toninelli","Costanza",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 00:19:27 GMT"}],"updateDate":"2024-07-09","timestamp":1720397967000,"abstract":"  In the realm of fundamental quantum science and technologies, non-classical\nstates of light, such as single-photon Fock states, are widely studied.\nHowever, current standards and metrological procedures are not optimized for\nlow light levels. Progress in this crucial scientific domain depends on\ninnovative metrology approaches, utilizing reliable devices based on quantum\neffects. We present a new generation of molecule-based single photon sources,\ncombining their integration in a polymeric micro-lens with pulsed excitation\nschemes, thereby realizing suitable resources in quantum radiometry. Our\nstrategy enhances the efficiency of generated single photon pulses and improves\nstability, providing a portable source at 784.7 nm that maintains consistent\nperformance even through a cooling and heating cycle. The calibration of a\nsingle photon avalanche detector is demonstrated using light sources with\ndifferent photon statistics, and the advantages of the single-molecule device\nare discussed. A relative uncertainty on the intrinsic detection efficiency\nwell below 1 % is attained, representing a new benchmark in the field.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"H553NFsbJRpM31UjUiTor4QIM2Nun0mNBYJnbw8rrqI","pdfSize":"1215915"}