{"id":"2407.18697","title":"Q-gen: A Parameterized Quantum Circuit Generator","authors":"Yikai Mao, Shaswot Shresthamali, Masaaki Kondo","authorsParsed":[["Mao","Yikai",""],["Shresthamali","Shaswot",""],["Kondo","Masaaki",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 12:22:40 GMT"}],"updateDate":"2024-07-29","timestamp":1721996560000,"abstract":"  Unlike most classical algorithms that take an input and give the solution\ndirectly as an output, quantum algorithms produce a quantum circuit that works\nas an indirect solution to computationally hard problems. In the full quantum\ncomputing workflow, most data processing remains in the classical domain except\nfor running the quantum circuit in the quantum processor. This leaves massive\nopportunities for classical automation and optimization toward future\nutilization of quantum computing. We kickstart the first step in this direction\nby introducing Q-gen, a high-level, parameterized quantum circuit generator\nincorporating 15 realistic quantum algorithms. Each customized generation\nfunction comes with algorithm-specific parameters beyond the number of qubits,\nproviding a large generation volume with high circuit variability. To\ndemonstrate the functionality of Q-gen, we organize the algorithms into 5\nhierarchical systems and generate a quantum circuit dataset accompanied by\ntheir measurement histograms and state vectors. This dataset enables\nresearchers to statistically analyze the structure, complexity, and performance\nof large-scale quantum circuits, or quickly train novel machine learning models\nwithout worrying about the exponentially growing simulation time. Q-gen is an\nopen-source and multipurpose project that serves as the entrance for users with\na classical computer science background to dive into the world of quantum\ncomputing.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Emerging Technologies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"OCkHp3JnykcsBxKeUlHhs9DyCHxB35XF6u8_VRaIUi0","pdfSize":"2691506","objectId":"0xeae6c3c15cf3d9a3f6f71334da0cb1ce8124f975e32cefc2b1842b63c110642e","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
