{"id":"2407.18664","title":"Assessment of environmental impacts from authorized discharges of\n  tritiated water from the Fukushima site to coastal and offshore regions","authors":"Jakub Kaizer, Katsumi Hirose, Pavel P. Povinec","authorsParsed":[["Kaizer","Jakub",""],["Hirose","Katsumi",""],["Povinec","Pavel P.",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 10:58:36 GMT"}],"updateDate":"2024-07-29","timestamp":1721991516000,"abstract":"  In August 2023, the long-planned discharging of radioactive wastewater from\nthe Fukushima Dai-ichi Nuclear Power Plant (FDNPP) started after the\nconfirmation of its feasibility and safety. As this water contains elevated\namounts of tritium even after being diluted, a lot of resources have been\ninvested in the monitoring of the Fukushima coastal region where the discharge\noutlet is located. We compare the first $^3$H surface activity concentrations\nfrom these measurements (up to the end of November 2023) with the available\nbackground values to evaluate a possible impact of the long-term discharging on\nhumans and environmental levels of the radionuclide of interest in the same or\nnearby area. From our results, we can conclude that the joint effect of\nhorizontal and vertical mixing has been significant enough to reduce tritium\nconcentrations at the monitored locations in the region close to the FDNPP port\ntwo days after the end of the respective phase of the discharging beyond the\ndetection limit of the applied analytical methods (~ 0.3 Bq L$^{-1}$) which is\nby five orders of magnitude lower than safety limit for drinking water set by\nthe World Health Organization (WHO). Moreover, the distant correlation analysis\nshowed that tritium concentrations at stations located further than 1.4 km were\nvery close to pre-discharge levels (~ 0.4 Bq L$^{-1}$). We also estimated that\nthe $^3$H activity concentration in the offshore Fukushima region would be\nelevated by 0.01 Bq L$^{-1}$ at maximum over a year of continuous discharging,\nwhich is in concordance with the already published modelling papers and much\nless than the impact of the FDNPP accident in 2011.\n","subjects":["Physics/Atmospheric and Oceanic Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"5bApJa17nPaZ_U3DMtWqQ8NfOxnVbupqXyNzFtnC4Yo","pdfSize":"1033114"}