{"id":"2407.18661","title":"Optimizing Design and Control Methods for Using Collaborative Robots in\n  Upper-Limb Rehabilitation","authors":"Dario Onfiani, Marco Caramaschi, Luigi Biagiotti, Fabio Pini","authorsParsed":[["Onfiani","Dario",""],["Caramaschi","Marco",""],["Biagiotti","Luigi",""],["Pini","Fabio",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 10:53:57 GMT"}],"updateDate":"2024-07-29","timestamp":1721991237000,"abstract":"  In this paper, we address the development of a robotic rehabilitation system\nfor the upper limbs based on collaborative end-effector solutions. The use of\ncommercial collaborative robots offers significant advantages for this task, as\nthey are optimized from an engineering perspective and ensure safe physical\ninteraction with humans. However, they also come with noticeable drawbacks,\nsuch as the limited range of sizes available on the market and the standard\ncontrol modes, which are primarily oriented towards industrial or service\napplications. To address these limitations, we propose an optimization-based\ndesign method to fully exploit the capability of the cobot in performing\nrehabilitation tasks. Additionally, we introduce a novel control architecture\nbased on an admittance-type Virtual Fixture method, which constrains the motion\nof the robot along a prescribed path. This approach allows for an intuitive\ndefinition of the task to be performed via Programming by Demonstration and\nenables the system to operate both passively and actively. In passive mode, the\nsystem supports the patient during task execution with additional force, while\nin active mode, it opposes the motion with a braking force. Experimental\nresults demonstrate the effectiveness of the proposed method.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"GoPDkQt-QhMZF3se9Arae33UoebS78_s3sjW57zWdPY","pdfSize":"2211450","objectId":"0x35b29d89eea032b9ad9dbb4347a0b278d7ff257fa08a4c6a4b8e54fd3077070f","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
