{"id":"2407.07992","title":"Exploring the Role of Expected Collision Feedback in Crowded Virtual\n  Environments","authors":"Haoran Yun, Jose Luis Ponton, Alejandro Beacco, Carlos Andujar, Nuria\n  Pelechano","authorsParsed":[["Yun","Haoran",""],["Ponton","Jose Luis",""],["Beacco","Alejandro",""],["Andujar","Carlos",""],["Pelechano","Nuria",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 18:48:56 GMT"}],"updateDate":"2024-07-12","timestamp":1720637336000,"abstract":"  An increasing number of virtual reality applications require environments\nthat emulate real-world conditions. These environments often involve dynamic\nvirtual humans showing realistic behaviors. Understanding user perception and\nnavigation among these virtual agents is key for designing realistic and\neffective environments featuring groups of virtual humans. While collision risk\nsignificantly influences human locomotion in the real world, this risk is\nlargely absent in virtual settings. This paper studies the impact of the\nexpected collision feedback on user perception and interaction with virtual\ncrowds. We examine the effectiveness of commonly used collision feedback\ntechniques (auditory cues and tactile vibrations) as well as inducing\nparticipants to expect that a physical bump with a real person might occur, as\nif some virtual humans actually correspond to real persons embodied into them\nand sharing the same physical space. Our results indicate that the expected\ncollision feedback significantly influences both participant behavior\n(encompassing global navigation and local movements) and subjective perceptions\nof presence and copresence. Specifically, the introduction of a perceived risk\nof actual collision was found to significantly impact global navigation\nstrategies and increase the sense of presence. Auditory cues had a similar\neffect on global navigation and additionally enhanced the sense of copresence.\nIn contrast, vibrotactile feedback was primarily effective in influencing local\nmovements.\n","subjects":["Computing Research Repository/Graphics","Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"BypledMjG_5BWWPYIDGT_6Dd98zFUyYwX07SALvVPo8","pdfSize":"14014360"}