{"id":"2407.04730","title":"The OPS-SAT benchmark for detecting anomalies in satellite telemetry","authors":"Bogdan Ruszczak and Krzysztof Kotowski and David Evans and Jakub\n  Nalepa","authorsParsed":[["Ruszczak","Bogdan",""],["Kotowski","Krzysztof",""],["Evans","David",""],["Nalepa","Jakub",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 11:12:22 GMT"}],"updateDate":"2024-07-09","timestamp":1719659542000,"abstract":"  Detecting anomalous events in satellite telemetry is a critical task in space\noperations. This task, however, is extremely time-consuming, error-prone and\nhuman dependent, thus automated data-driven anomaly detection algorithms have\nbeen emerging at a steady pace. However, there are no publicly available\ndatasets of real satellite telemetry accompanied with the ground-truth\nannotations that could be used to train and verify anomaly detection supervised\nmodels. In this article, we address this research gap and introduce the\nAI-ready benchmark dataset (OPSSAT-AD) containing the telemetry data acquired\non board OPS-SAT -- a CubeSat mission which has been operated by the European\nSpace Agency which has come to an end during the night of 22--23 May 2024\n(CEST). The dataset is accompanied with the baseline results obtained using 30\nsupervised and unsupervised classic and deep machine learning algorithms for\nanomaly detection. They were trained and validated using the training-test\ndataset split introduced in this work, and we present a suggested set of\nquality metrics which should be always calculated to confront the new\nalgorithms for anomaly detection while exploiting OPSSAT-AD. We believe that\nthis work may become an important step toward building a fair, reproducible and\nobjective validation procedure that can be used to quantify the capabilities of\nthe emerging anomaly detection techniques in an unbiased and fully transparent\nway.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"6L8Vga2acbq1DUIhdl8bXvmMNkVOfgdLvOmgj8BrHXI","pdfSize":"5449893"}