{"id":"2407.09296","title":"The effect of spectroscopic binning on atmospheric retrievals","authors":"Jack J. Davey, Kai Hou Yip, Ahmed F. Al-Refaie, Ingo P. Waldmann","authorsParsed":[["Davey","Jack J.",""],["Yip","Kai Hou",""],["Al-Refaie","Ahmed F.",""],["Waldmann","Ingo P.",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 14:30:24 GMT"}],"updateDate":"2024-07-15","timestamp":1720794624000,"abstract":"  With the James Webb Space Telescope (JWST) offering higher resolution data in\nspace-based transmission spectroscopy, understanding the capabilities of our\ncurrent atmospheric retrieval pipelines is essential. These new data cover\nwider wavelength ranges and at much higher spectral resolution than previous\ninstruments have been able to offer. Therefore, it is often appealing to bin\nspectra to fewer points, better constrained in their transit depth, before\nusing them as inputs for atmospheric retrievals. However, little quantitative\nanalysis of the trade-off between spectral resolution and signal-to-noise ratio\nhas been conducted thus far. As such, we produce a simulation replicating the\nobservations of WASP-39b by the NIRSpec PRISM instrument on board JWST and\nassess the accuracy and consistency of retrievals while varying resolution and\nthe average photometric error. While this probes a specific case we also plot\n`binning paths' in the resulting sensitivity maps to demonstrate the best\nattainable atmospheric parameter estimations starting from the position of the\nreal JWST Early Release Science observation. We repeat this analysis on three\ndifferent simulation setups where each includes an opaque cloud layer at a\ndifferent height in the atmosphere. We find that a much greater resolution is\nneeded in the case of a high cloud deck since features are already heavily\nmuted by the presence of the clouds. In the other two cases, there are large\n`safe zones' in the parameter space. If these maps can be generalised, binning\npaths could inform future observations on how to achieve the most accurate\nretrieval results.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"NlXrKHIRW_yp2lborm_wK6Z4XmcR3koYHn1RBsO348g","pdfSize":"9933067","objectId":"0x1eaf699969846f0ec826485b76b7fb23df8bffca63b3a4fdff33fc16ba112431","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
