{"id":"2407.04232","title":"A Unified Intracellular pH Landscape with SITE-pHorin: a\n  Quantum-Entanglement-Enhanced pH Probe","authors":"Shu-Ang Li, Xiao-Yan Meng, Su Zhang, Ying-Jie Zhang, Run-Zhou Yang,\n  Dian-Dian Wang, Yang Yang, Pei-Pei Liu, Jian-Sheng Kang","authorsParsed":[["Li","Shu-Ang",""],["Meng","Xiao-Yan",""],["Zhang","Su",""],["Zhang","Ying-Jie",""],["Yang","Run-Zhou",""],["Wang","Dian-Dian",""],["Yang","Yang",""],["Liu","Pei-Pei",""],["Kang","Jian-Sheng",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 03:19:49 GMT"}],"updateDate":"2024-07-08","timestamp":1720149589000,"abstract":"  An accurate map of intracellular organelle pH is crucial for comprehending\ncellular metabolism and organellar functions. However, a unified intracellular\npH spectrum using a single probe is still lack. Here, we developed a novel\nquantum entanglement-enhanced pH-sensitive probe called SITE-pHorin, which\nfeatured a wide pH-sensitive range and ratiometric quantitative measurement\ncapabilities. Subsequently, we measured the pH of various organelles and their\nsub-compartments, including mitochondrial sub-spaces, Golgi stacks, endoplasmic\nreticulum, lysosomes, peroxisomes, and endosomes in COS-7 cells. For the\nlong-standing debate on mitochondrial compartments pH, we measured the pH of\nmitochondrial cristae as 6.60 \\pm 0.40, the pH of mitochondrial intermembrane\nspace as 6.95 \\pm 0.30, and two populations of mitochondrial matrix pH at\napproximately 7.20 \\pm 0.27 and 7.50 \\pm 0.16, respectively. Notably, the\nlysosome pH exhibited a single, narrow Gaussian distribution centered at 4.79\n\\pm 0.17. Furthermore, quantum chemistry computations revealed that both the\ndeprotonation of the residue Y182 and the discrete curvature of deformed\nbenzene ring in chromophore are both necessary for the quantum entanglement\nmechanism of SITE-pHorin. Intriguingly, our findings reveal an accurate pH\ngradient (0.6-0.9 pH unit) between mitochondrial cristae and matrix, suggesting\nprior knowledge about \\Delta pH (0.4-0.6) and mitochondrial proton motive force\n(pmf) are underestimated.\n","subjects":["Quantitative Biology/Quantitative Methods","Physics/Biological Physics","Quantitative Biology/Biomolecules","Quantitative Biology/Subcellular Processes"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"w5JDTPZII0xuvf-LWH6Vz2hkrR02lyul0fVsWVaMJdQ","pdfSize":"15929075"}