{"id":"2407.00004","title":"Multi-objective generative AI for designing novel brain-targeting small\n  molecules","authors":"Ayush Noori, I\\~naki Arango, William E. Byrd, Nada Amin","authorsParsed":[["Noori","Ayush",""],["Arango","Iñaki",""],["Byrd","William E.",""],["Amin","Nada",""]],"versions":[{"version":"v1","created":"Tue, 16 Apr 2024 12:57:06 GMT"}],"updateDate":"2024-07-02","timestamp":1713272226000,"abstract":"  The strict selectivity of the blood-brain barrier (BBB) represents one of the\nmost formidable challenges to successful central nervous system (CNS) drug\ndelivery. Computational methods to generate BBB permeable drugs in silico may\nbe valuable tools in the CNS drug design pipeline. However, in real-world\napplications, BBB penetration alone is insufficient; rather, after transiting\nthe BBB, molecules must bind to a specific target or receptor in the brain and\nmust also be safe and non-toxic. To discover small molecules that concurrently\nsatisfy these constraints, we use multi-objective generative AI to synthesize\ndrug-like BBB-permeable small molecules. Specifically, we computationally\nsynthesize molecules with predicted binding affinity against dopamine receptor\nD2, the primary target for many clinically effective antipsychotic drugs. After\ntraining several graph neural network-based property predictors, we adapt\nSyntheMol (Swanson et al., 2024), a recently developed Monte Carlo Tree\nSearch-based algorithm for antibiotic design, to perform a multi-objective\nguided traversal over an easily synthesizable molecular space. We design a\nlibrary of 26,581 novel and diverse small molecules containing hits with high\npredicted BBB permeability and favorable predicted safety and toxicity\nprofiles, and that could readily be synthesized for experimental validation in\nthe wet lab. We also validate top scoring molecules with molecular docking\nsimulation against the D2 receptor and demonstrate predicted binding affinity\non par with risperidone, a clinically prescribed D2-targeting antipsychotic. In\nthe future, the SyntheMol-based computational approach described here may\nenable the discovery of novel neurotherapeutics for currently intractable\ndisorders of the CNS.\n","subjects":["Quantitative Biology/Biomolecules","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning","Quantitative Biology/Quantitative Methods"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"ESFM9NAgOEhESG4bYqYzGWYY_OQtbh-FFiwVP3SHUGY","pdfSize":"9970888","endEpoch":"101","objectId":"0x80c5d93cd51360380d70eab7339610aceeaf788fa77b6fad433543e52e17d686","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1"}
