{"id":"2407.15750","title":"Unified Description of Charge Density Waves in Electron- and Hole-doped\n  Cuprate Superconductors","authors":"Jaewon Choi, Sijia Tu, Abhishek Nag, Charles C. Tam, Sahil Tippireddy,\n  Stefano Agrestini, Zefeng Lin, Mirian Garcia-Fernandez, Kui Jin, Ke-Jin Zhou","authorsParsed":[["Choi","Jaewon",""],["Tu","Sijia",""],["Nag","Abhishek",""],["Tam","Charles C.",""],["Tippireddy","Sahil",""],["Agrestini","Stefano",""],["Lin","Zefeng",""],["Garcia-Fernandez","Mirian",""],["Jin","Kui",""],["Zhou","Ke-Jin",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 15:55:55 GMT"}],"updateDate":"2024-07-23","timestamp":1721663755000,"abstract":"  High-temperature cuprates superconductors are characterised by the complex\ninterplay between superconductivity (SC) and charge density wave (CDW) in the\ncontext of intertwined competing orders. In contrast to abundant studies for\nhole-doped cuprates, the exact nature of CDW and its relationship to SC was\nmuch less explored in electron-doped counterparts. Here, we performed resonant\ninelastic x-ray scattering (RIXS) experiments to investigate the relationship\nbetween CDW and SC in electron-doped La$_{2-x}$Ce$_x$CuO$_4$. The short-range\nCDW order with a correlation length $\\sim35$~\\AA~was found in a wide range of\ntemperature and doping concentration. Near the optimal doping, the CDW order is\nweakened inside the SC phase, implying an intimate relationship between the two\norders. This interplay has been commonly reported in hole-doped La-based\ncuprates near the optimal doping. We reconciled the diverging behaviour of CDW\nacross the superconducting phase in various cuprate materials by introducing\nthe CDW correlation length as a key parameter. Our study paves the way for\nestablishing a unified picture to describe the phenomenology of CDW and its\nrelationship with SC in the cuprate family.\n","subjects":["Condensed Matter/Superconductivity","Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Wfv79rKshq09GEDpJFXImepMJrF-SKueBn87FRo1L1I","pdfSize":"1650822"}