{"id":"2407.12870","title":"Revisiting Adaptive Cellular Recognition Under Domain Shifts: A\n  Contextual Correspondence View","authors":"Jianan Fan, Dongnan Liu, Canran Li, Hang Chang, Heng Huang, Filip\n  Braet, Mei Chen, and Weidong Cai","authorsParsed":[["Fan","Jianan",""],["Liu","Dongnan",""],["Li","Canran",""],["Chang","Hang",""],["Huang","Heng",""],["Braet","Filip",""],["Chen","Mei",""],["Cai","Weidong",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 04:41:16 GMT"},{"version":"v2","created":"Fri, 19 Jul 2024 05:26:06 GMT"}],"updateDate":"2024-07-22","timestamp":1720932076000,"abstract":"  Cellular nuclei recognition serves as a fundamental and essential step in the\nworkflow of digital pathology. However, with disparate source organs and\nstaining procedures among histology image clusters, the scanned tiles\ninherently conform to a non-uniform data distribution, which induces\ndeteriorated promises for general cross-cohort usages. Despite the latest\nefforts leveraging domain adaptation to mitigate distributional discrepancy,\nthose methods are subjected to modeling the morphological characteristics of\neach cell individually, disregarding the hierarchical latent structure and\nintrinsic contextual correspondences across the tumor micro-environment. In\nthis work, we identify the importance of implicit correspondences across\nbiological contexts for exploiting domain-invariant pathological composition\nand thereby propose to exploit the dependence over various biological\nstructures for domain adaptive cellular recognition. We discover those\nhigh-level correspondences via unsupervised contextual modeling and use them as\nbridges to facilitate adaptation over diverse organs and stains. In addition,\nto further exploit the rich spatial contexts embedded amongst nuclear\ncommunities, we propose self-adaptive dynamic distillation to secure\ninstance-aware trade-offs across different model constituents. The proposed\nmethod is extensively evaluated on a broad spectrum of cross-domain settings\nunder miscellaneous data distribution shifts and outperforms the\nstate-of-the-art methods by a substantial margin. Code is available at\nhttps://github.com/camwew/CellularRecognition_DA_CC.\n","subjects":["Quantitative Biology/Quantitative Methods","Computing Research Repository/Machine Learning","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"YC6eC6X8MYCSLJpu11qJeWXBRJqAua8AmhBlqdHUqbY","pdfSize":"3748129"}