{"id":"2407.02166","title":"Energetic proton losses reveal Io's extended and longitudinally\n  asymmetrical atmosphere","authors":"H.L.F. Huybrighs, C.P.A. van Buchem, A. Bl\\\"ocker, V. Dols, C.F.\n  Bowers, C.M. Jackman","authorsParsed":[["Huybrighs","H. L. F.",""],["van Buchem","C. P. A.",""],["Blöcker","A.",""],["Dols","V.",""],["Bowers","C. F.",""],["Jackman","C. M.",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 11:18:19 GMT"}],"updateDate":"2024-07-03","timestamp":1719919099000,"abstract":"  Along the I24, I27 and I31 flybys of Io (1999-2001), the Energetic Particle\nDetector (EPD) onboard the Galileo spacecraft observed localised regions of\nenergetic protons losses (155 keV-1250 keV). Using back-tracking particle\nsimulations combined with a prescribed atmospheric distribution and a\nmagnetohydrodynamics (MHD) model of the plasma/atmosphere interaction, we\ninvestigate the possible causes of these depletions. We focus on a limited\nregion within two Io radii, which is dominated by Io's SO$_2$ atmosphere. Our\nresults show that charge exchange of protons with the SO$_2$ atmosphere,\nabsorption by the surface and the configuration of the electromagnetic field\ncontribute to the observed proton depletion along the Galileo flybys. In the\n155-240 keV energy range, charge exchange is either a major or the dominant\nloss process, depending on the flyby altitude. In the 540-1250 keV range, as\nthe charge exchange cross sections are small, the observed decrease of the\nproton flux is attributed to absorption by the surface and the perturbed\nelectromagnetic fields, which divert the protons away from the detector. From a\ncomparison between the modelled losses and the data we find indications of an\nextended atmosphere on the day/downstream side of Io, a lack of atmospheric\ncollapse on the night/upstream side as well as a more global extended\natmospheric component ($> 1$ Io radius). Our results demonstrate that\nobservations and modeling of proton depletion around the moon constitute an\nimportant tool to constrain the electromagnetic field configuration around Io\nand the radial and longitudinal atmospheric distribution, which is still poorly\nunderstood.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Physics/Space Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"u9f70lxY7I_fwcsJYe28R2rT_7o-0McQnXLYglwFfPg","pdfSize":"29715339"}