{"id":"2407.08103","title":"Automata-based constraints for language model decoding","authors":"Terry Koo, Frederick Liu, Luheng He","authorsParsed":[["Koo","Terry",""],["Liu","Frederick",""],["He","Luheng",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 00:25:01 GMT"},{"version":"v2","created":"Fri, 12 Jul 2024 01:02:43 GMT"},{"version":"v3","created":"Mon, 5 Aug 2024 13:08:31 GMT"}],"updateDate":"2024-08-06","timestamp":1720657501000,"abstract":"  Language models (LMs) are often expected to generate strings in some formal\nlanguage; for example, structured data, API calls, or code snippets. Although\nLMs can be tuned to improve their adherence to formal syntax, this does not\nguarantee conformance, especially with smaller LMs suitable for large-scale\ndeployment. In addition, tuning requires significant resources, making it\nimpractical for uncommon or task-specific formats. To prevent downstream\nparsing errors we would ideally constrain the LM to only produce valid output,\nbut this is severely complicated by tokenization, which is typically both\nambiguous and misaligned with the formal grammar. We solve these issues through\nthe application of automata theory, deriving an efficient closed-form solution\nfor the regular languages, a broad class of formal languages with many\npractical applications, including API calls or schema-guided JSON and YAML. We\nalso discuss pragmatic extensions for coping with the issue of high branching\nfactor, and extend our techniques to deterministic context-free languages,\nwhich similarly admit an efficient closed-form solution. Previous work on this\ntopic (Willard and Louf, 2023) layers bespoke solutions onto automata, leading\nto problems with speed, correctness, and extensibility. Instead, we reformulate\nthe entire task in terms of automata so we can leverage well-studied and\nwell-optimized algorithms. Our system compiles constraints ~7,000x faster, is\nprovably correct, and can be extended in a modular fashion.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Formal Languages and Automata Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"fsvSbNQTldk-x7XKzsuyyJD8h1WLxz946PE8SBzonXs","pdfSize":"581483"}