{"id":"2407.19072","title":"Configural processing as an optimized strategy for robust object\n  recognition in neural networks","authors":"Hojin Jang, Pawan Sinha, and Xavier Boix","authorsParsed":[["Jang","Hojin",""],["Sinha","Pawan",""],["Boix","Xavier",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 10:39:14 GMT"}],"updateDate":"2024-07-30","timestamp":1721299154000,"abstract":"  Configural processing, the perception of spatial relationships among an\nobject's components, is crucial for object recognition. However, the teleology\nand underlying neurocomputational mechanisms of such processing are still\nelusive, notwithstanding decades of research. We hypothesized that processing\nobjects via configural cues provides a more robust means to recognizing them\nrelative to local featural cues. We evaluated this hypothesis by devising\nidentification tasks with composite letter stimuli and comparing different\nneural network models trained with either only local or configural cues\navailable. We found that configural cues yielded more robust performance to\ngeometric transformations such as rotation or scaling. Furthermore, when both\nfeatures were simultaneously available, configural cues were favored over local\nfeatural cues. Layerwise analysis revealed that the sensitivity to configural\ncues emerged later relative to local feature cues, possibly contributing to the\nrobustness to pixel-level transformations. Notably, this configural processing\noccurred in a purely feedforward manner, without the need for recurrent\ncomputations. Our findings with letter stimuli were successfully extended to\nnaturalistic face images. Thus, our study provides neurocomputational evidence\nthat configural processing emerges in a na\\\"ive network based on task\ncontingencies, and is beneficial for robust object processing under varying\nviewing conditions.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"HLQzs1f9wXFLsq_mRneNEWCVYck5sZO1NB2Znm3B_XQ","pdfSize":"1155300","objectId":"0x980be048308990019ce1433364127321b54524b77257799d05d00cee2e08b3d4","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
