{"id":"2407.06564","title":"Combining Knowledge Graphs and Large Language Models","authors":"Amanda Kau, Xuzeng He, Aishwarya Nambissan, Aland Astudillo, Hui Yin,\n  Amir Aryani","authorsParsed":[["Kau","Amanda",""],["He","Xuzeng",""],["Nambissan","Aishwarya",""],["Astudillo","Aland",""],["Yin","Hui",""],["Aryani","Amir",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 05:42:53 GMT"}],"updateDate":"2024-07-10","timestamp":1720503773000,"abstract":"  In recent years, Natural Language Processing (NLP) has played a significant\nrole in various Artificial Intelligence (AI) applications such as chatbots,\ntext generation, and language translation. The emergence of large language\nmodels (LLMs) has greatly improved the performance of these applications,\nshowing astonishing results in language understanding and generation. However,\nthey still show some disadvantages, such as hallucinations and lack of\ndomain-specific knowledge, that affect their performance in real-world tasks.\nThese issues can be effectively mitigated by incorporating knowledge graphs\n(KGs), which organise information in structured formats that capture\nrelationships between entities in a versatile and interpretable fashion.\nLikewise, the construction and validation of KGs present challenges that LLMs\ncan help resolve. The complementary relationship between LLMs and KGs has led\nto a trend that combines these technologies to achieve trustworthy results.\nThis work collected 28 papers outlining methods for KG-powered LLMs, LLM-based\nKGs, and LLM-KG hybrid approaches. We systematically analysed and compared\nthese approaches to provide a comprehensive overview highlighting key trends,\ninnovative techniques, and common challenges. This synthesis will benefit\nresearchers new to the field and those seeking to deepen their understanding of\nhow KGs and LLMs can be effectively combined to enhance AI applications\ncapabilities.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"cIQZVtat7VTyn0as4Fs-2oJD3EIHXcOzxVpGKryAtzk","pdfSize":"726958"}
