{"id":"2407.20343","title":"Observations of Kappa Distributions in Solar Energetic Protons and\n  Derived Thermodynamic Properties","authors":"M. E. Cuesta, A. T. Cummings, G. Livadiotis, D. J. McComas, C. M. S.\n  Cohen, L. Y. Khoo, T. Sharma, M. M. Shen, R. Bandyopadhyay, J. S. Rankin, J.\n  R. Szalay, H. A. Farooki, Z. Xu, G. D. Muro, M. L. Stevens, S. D. Bale","authorsParsed":[["Cuesta","M. E.",""],["Cummings","A. T.",""],["Livadiotis","G.",""],["McComas","D. J.",""],["Cohen","C. M. S.",""],["Khoo","L. Y.",""],["Sharma","T.",""],["Shen","M. M.",""],["Bandyopadhyay","R.",""],["Rankin","J. S.",""],["Szalay","J. R.",""],["Farooki","H. A.",""],["Xu","Z.",""],["Muro","G. D.",""],["Stevens","M. L.",""],["Bale","S. D.",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 18:00:36 GMT"}],"updateDate":"2024-07-31","timestamp":1722276036000,"abstract":"  In this paper we model the high-energy tail of observed solar energetic\nproton energy distributions with a kappa distribution function. We employ a\ntechnique for deriving the thermodynamic parameters of solar energetic proton\npopulations measured by the Parker Solar Probe (PSP) Integrated Science\nInvestigation of the Sun (IS$\\odot$IS) EPI-Hi high energy telescope (HET), over\nenergies from 10 - 60 MeV. With this technique we explore, for the first time,\nthe characteristic thermodynamic properties of the solar energetic protons\nassociated with an interplanetary coronal mass ejection (ICME) and its driven\nshock. We find that (1) the spectral index, or equivalently, the thermodynamic\nparameter kappa of solar energetic protons ($\\kappa_{\\rm EP}$) gradually\nincreases starting from the pre-ICME region (upstream of the CME-driven shock),\nreaching a maximum in the CME ejecta ($\\kappa_{\\rm EP} \\approx 3.5$), followed\nby a gradual decrease throughout the trailing portion of the CME; (2) solar\nenergetic proton temperature and density ($T_{\\rm EP}$ and $n_{\\rm EP}$) appear\nanti-correlated, a behavior consistent to sub-isothermal polytropic processes;\nand (3) values of $T_{\\rm EP}$ and $\\kappa_{\\rm EP}$ appear are positively\ncorrelated, indicating an increasing entropy with time. Therefore, these proton\npopulations are characterized by a complex and evolving thermodynamic behavior,\nconsisting of multiple sub-isothermal polytropic processes, and a large-scale\ntrend of increasing temperature, kappa, and entropy. This study and its\ncompanion study by Livadiotis et al. (2024) open a new set of procedures for\ninvestigating the thermodynamic behavior of energetic particles and their\nshared thermal properties.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"exSLzVfoFM_VkBJdzTcopE4FkFFhuJQco43K_WGqCms","pdfSize":"6160119"}