{"id":"2407.08802","title":"Generic data reduction for nulling interferometry package: the grip of a\n  single data reduction package on all the nulling interferometers","authors":"Marc-Antoine Martinod, Denis Defr\\`ere, Romain Laugier, Steve Ertel,\n  Olivier Absil, Barnaby Norris, Germain Garreau, Bertrand Mennesson","authorsParsed":[["Martinod","Marc-Antoine",""],["Defrère","Denis",""],["Laugier","Romain",""],["Ertel","Steve",""],["Absil","Olivier",""],["Norris","Barnaby",""],["Garreau","Germain",""],["Mennesson","Bertrand",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 18:21:47 GMT"}],"updateDate":"2024-07-15","timestamp":1720722107000,"abstract":"  Nulling interferometry is a powerful observing technique to reach exoplanets\nand circumstellar dust at separations too small for direct imaging with\nsingle-dish telescopes and too large for indirect methods. With near-future\ninstrumentation, it bears the potential to detect young, hot planets near the\nsnow lines of their host stars. A future space mission could detect and\ncharacterize a large number of rocky, habitable-zone planets around nearby\nstars at thermal-infrared wavelengths. The null self-calibration is a method\naiming at modelling the statistical distribution of the nulled signal. It has\nproven to be more sensitive and accurate than average-based data reduction\nmethods in nulling interferometry. This statistical approach opens the\npossibility of designing a GPU-based Python package to reduce the data from any\nof these instruments, by simply providing the data and a simulator of the\ninstrument. GRIP is a toolbox to reduce nulling and interferometric data based\non the statistical self-calibration method. In this article, we present the\nmain features of GRIP as well as applications on real data.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"_ZNA7s6dlaRMH8Ksf9ulSVYI7xxA91bm9AAgw9hBW4Q","pdfSize":"784563"}