{"id":"2407.11647","title":"Dataset Dictionary Learning in a Wasserstein Space for Federated Domain\n  Adaptation","authors":"Eduardo Fernandes Montesuma, Fabiola Espinoza Castellon, Fred Ngol\\`e\n  Mboula, Aur\\'elien Mayoue, Antoine Souloumiac, C\\'edric Gouy-Pailler","authorsParsed":[["Montesuma","Eduardo Fernandes",""],["Castellon","Fabiola Espinoza",""],["Mboula","Fred Ngolè",""],["Mayoue","Aurélien",""],["Souloumiac","Antoine",""],["Gouy-Pailler","Cédric",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 12:13:54 GMT"}],"updateDate":"2024-07-17","timestamp":1721132034000,"abstract":"  Multi-Source Domain Adaptation (MSDA) is a challenging scenario where\nmultiple related and heterogeneous source datasets must be adapted to an\nunlabeled target dataset. Conventional MSDA methods often overlook that data\nholders may have privacy concerns, hindering direct data sharing. In response,\ndecentralized MSDA has emerged as a promising strategy to achieve adaptation\nwithout centralizing clients' data. Our work proposes a novel approach,\nDecentralized Dataset Dictionary Learning, to address this challenge. Our\nmethod leverages Wasserstein barycenters to model the distributional shift\nacross multiple clients, enabling effective adaptation while preserving data\nprivacy. Specifically, our algorithm expresses each client's underlying\ndistribution as a Wasserstein barycenter of public atoms, weighted by private\nbarycentric coordinates. Our approach ensures that the barycentric coordinates\nremain undisclosed throughout the adaptation process. Extensive experimentation\nacross five visual domain adaptation benchmarks demonstrates the superiority of\nour strategy over existing decentralized MSDA techniques. Moreover, our method\nexhibits enhanced robustness to client parallelism while maintaining relative\nresilience compared to conventional decentralized MSDA methodologies.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"nWOeuNKH205gOqHuiAWghdTRNFVGimEnzEvCjtn_BwI","pdfSize":"6602106","objectId":"0x5d10efe3ac3d59ca823b43184d8f5c3af833f6ddf78f5f10b661f27ff312cc25","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
