{"id":"2407.03093","title":"Revisiting the Performance of Deep Learning-Based Vulnerability\n  Detection on Realistic Datasets","authors":"Partha Chakraborty, Krishna Kanth Arumugam, Mahmoud Alfadel, Meiyappan\n  Nagappan, and Shane McIntosh","authorsParsed":[["Chakraborty","Partha",""],["Arumugam","Krishna Kanth",""],["Alfadel","Mahmoud",""],["Nagappan","Meiyappan",""],["McIntosh","Shane",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 13:34:30 GMT"}],"updateDate":"2024-07-04","timestamp":1720013670000,"abstract":"  The impact of software vulnerabilities on everyday software systems is\nsignificant. Despite deep learning models being proposed for vulnerability\ndetection, their reliability is questionable. Prior evaluations show high\nrecall/F1 scores of up to 99%, but these models underperform in practical\nscenarios, particularly when assessed on entire codebases rather than just the\nfixing commit. This paper introduces Real-Vul, a comprehensive dataset\nrepresenting real-world scenarios for evaluating vulnerability detection\nmodels. Evaluating DeepWukong, LineVul, ReVeal, and IVDetect shows a\nsignificant drop in performance, with precision decreasing by up to 95\npercentage points and F1 scores by up to 91 points. Furthermore, Model\nperformance fluctuates based on vulnerability characteristics, with better F1\nscores for information leaks or code injection than for path resolution or\npredictable return values. The results highlight a significant performance gap\nthat needs addressing before deploying deep learning-based vulnerability\ndetection in practical settings. Overfitting is identified as a key issue, and\nan augmentation technique is proposed, potentially improving performance by up\nto 30%. Contributions include a dataset creation approach for better model\nevaluation, Real-Vul dataset, and empirical evidence of deep learning models\nstruggling in real-world settings.\n","subjects":["Computing Research Repository/Software Engineering","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Cryptography and Security","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"BVov6ubhew8jDVwDCrGMjTK0d07fcz_S-wOWbGc6mdA","pdfSize":"21321960"}