{"id":"2407.14554","title":"On the Distributions of Product and Quotient of two Independent\n  $\\hat{I}$-function variates","authors":"Vilma D'Souza, Shantha Kumari Kurumujji, Arjun K. Rathie","authorsParsed":[["D'Souza","Vilma",""],["Kurumujji","Shantha Kumari",""],["Rathie","Arjun K.",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 07:33:07 GMT"}],"updateDate":"2024-07-23","timestamp":1721287987000,"abstract":"  The study of probability distributions for random variables and their\nalgebraic combinations has been a central focus driving the advancement of\nprobability and statistics. Since the 1920s, the challenge of calculating the\nprobability distributions of sums, differences, products, and quotients of\nindependent random variables have drawn the attention of numerous statisticians\nand mathematicians who studied the algebraic properties and relationships of\nrandom variables. Statistical distributions are highly helpful in data science\nand machine learning, as they provide a range of possible values for the\nvariables, aiding in the development of a deeper understanding of the\nunderlying problem. In this paper, we have presented a new probability\ndistribution based on the $\\hat{I}$-function. Also, we have discussed the\napplications of the $\\hat{I}$ function, particularly in deriving the\ndistributions of product and the quotient involving two independent $\\hat{I}$\nfunction variates. Additionally, it has been shown that both the product and\nquotient of two independent $\\hat{I}$-function variates also follow the\n$\\hat{I}$-function distribution. Furthermore, the new distribution, known as\nthe $\\hat{I}$-function distribution, includes several well-known classical\ndistributions such as the gamma, beta, exponential, normal H-function, and\nG-function distributions, among others, as special cases. Therefore, the\n$\\hat{I}$-function distribution can be considered a characterization or\ngeneralization of the above-mentioned distributions.\n","subjects":["Mathematics/Classical Analysis and ODEs","Mathematics/Complex Variables","Mathematics/Statistics Theory","Statistics/Statistics Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"JT6SAPmgRWGiI4aha3BiIG6_LFZ2hc80B47H6mcvwPs","pdfSize":"179872"}