{"id":"2407.16808","title":"Convexification of the Quantum Network Utility Maximisation Problem","authors":"Sounak Kar and Stephanie Wehner","authorsParsed":[["Kar","Sounak",""],["Wehner","Stephanie",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 19:23:00 GMT"}],"updateDate":"2024-07-25","timestamp":1721762580000,"abstract":"  Network Utility Maximisation (NUM) addresses the problem of allocating\nresources fairly within a network and explores the ways to achieve optimal\nallocation in real-world networks. Although extensively studied in classical\nnetworks, NUM is an emerging area of research in the context of quantum\nnetworks. In this work, we consider the quantum network utility maximisation\n(QNUM) problem in a static setting, where a user's utility takes into account\nthe assigned quantum quality (fidelity) via a generic entanglement measure as\nwell as the corresponding rate of entanglement generation. Under certain\nassumptions, we demonstrate that the QNUM problem can be formulated as an\noptimisation problem with the rate allocation vector as the only decision\nvariable. Using a change of variable technique known in the field of geometric\nprogramming, we then establish sufficient conditions under which this\nformulation can be reduced to a convex problem, a class of optimisation\nproblems that can be solved efficiently and with certainty even in high\ndimensions. We further show that this technique preserves convexity, enabling\nus to formulate convex QNUM problems in networks where some routes have certain\nentanglement measures that do not readily admit convex formulation, while\nothers do. This allows us to compute the optimal resource allocation in\nnetworks where heterogeneous applications run over different routes.\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"uzZM1qpOs4J-lCE6vcNkzzEQ8-fGTNatwjF5qai-_6U","pdfSize":"5656704"}