{"id":"2407.02342","title":"Optimizing Age of Information in Vehicular Edge Computing with Federated\n  Graph Neural Network Multi-Agent Reinforcement Learning","authors":"Wenhua Wang, Qiong Wu, Pingyi Fan, Nan Cheng, Wen Chen, Jiangzhou\n  Wang, Khaled B. Letaief","authorsParsed":[["Wang","Wenhua",""],["Wu","Qiong",""],["Fan","Pingyi",""],["Cheng","Nan",""],["Chen","Wen",""],["Wang","Jiangzhou",""],["Letaief","Khaled B.",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 15:37:38 GMT"}],"updateDate":"2024-07-03","timestamp":1719848258000,"abstract":"  With the rapid development of intelligent vehicles and Intelligent Transport\nSystems (ITS), the sensors such as cameras and LiDAR installed on intelligent\nvehicles provides higher capacity of executing computation-intensive and\ndelay-sensitive tasks, thereby raising deployment costs. To address this issue,\nVehicular Edge Computing (VEC) has been proposed to process data through Road\nSide Units (RSUs) to support real-time applications. This paper focuses on the\nAge of Information (AoI) as a key metric for data freshness and explores task\noffloading issues for vehicles under RSU communication resource constraints. We\nadopt a Multi-agent Deep Reinforcement Learning (MADRL) approach, allowing\nvehicles to autonomously make optimal data offloading decisions. However, MADRL\nposes risks of vehicle information leakage during communication learning and\ncentralized training. To mitigate this, we employ a Federated Learning (FL)\nframework that shares model parameters instead of raw data to protect the\nprivacy of vehicle users. Building on this, we propose an innovative\ndistributed federated learning framework combining Graph Neural Networks (GNN),\nnamed Federated Graph Neural Network Multi-Agent Reinforcement Learning\n(FGNN-MADRL), to optimize AoI across the system. For the first time, road\nscenarios are constructed as graph data structures, and a GNN-based federated\nlearning framework is proposed, effectively combining distributed and\ncentralized federated aggregation. Furthermore, we propose a new MADRL\nalgorithm that simplifies decision making and enhances offloading efficiency,\nfurther reducing the decision complexity. Simulation results demonstrate the\nsuperiority of our proposed approach to other methods through simulations.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Distributed, Parallel, and Cluster Computing","Computing Research Repository/Multiagent Systems","Computing Research Repository/Networking and Internet Architecture"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"nLochosNShj52tMsNsGaYZ177hANyk2wHlRd_E9xeAc","pdfSize":"847908","objectId":"0xab095a8cc647b69322d19185c4f2a7f9f27cf10c18259909edfd9ef50438007a","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
