{"id":"2407.04452","title":"Precision cosmology with exact inhomogeneous solutions of General\n  Relativity: the Szekeres models","authors":"Marie-No\\\"elle C\\'el\\'erier","authorsParsed":[["Célérier","Marie-Noëlle",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 12:06:33 GMT"},{"version":"v2","created":"Fri, 19 Jul 2024 07:54:40 GMT"}],"updateDate":"2024-07-22","timestamp":1720181193000,"abstract":"  The exact Friedman solution to the field equations of General Relativity (GR)\ndescribing an homogeneous and isotropic universe together with its linear and\nhigher-order perturbations are the theoretical roots of the current standard\nmodel of cosmology. However, despite its global successes, this standard model\ncurrently faces a number of tensions and anomalies, which occur mostly from a\nmismatch between early and late cosmic time region depictions. Actually, in the\nera of precision cosmology, the late inhomogeneities in the densities of the\nUniverse components can no more be neglected. Moreover, since GR is\nfundamentally nonlinear, any linear perturbation theory is doomed to fail at\nreproducing precisely its features, while higher-order perturbed FLRW models\ncannot either claim the status of exact solution to Einstein's field equations.\nFortunately, other GR solutions exist which are best suited for this purpose,\ne. g., exact inhomogeneous solutions able to represent a matter-cosmological\nconstant dominated universe region. Among these, the Szekeres solution, which\nis devoid of any symmetry, appears as a proper tool for this purpose. Moreover,\nsince these solutions possess the FLRW model as a homogeneous limit, they can\nbe very smoothly matched to the standard representation at the\ninhomogeneity-homogeneity transition. In this paper, the Szekeres solution and\nits main interesting properties, as well as the equations needed to use this\nsolution in a cosmological context are presented. Then the prospects for a\nbroader use of its abilities are sketched out. In particular, the use of neural\nnetworks is proposed to allow, in the future, the fitting of the huge amount of\ndata becoming available to constrain the arbitrary functions and the constant\nparameters characterizing the Szekeres model, running for representing our late\nUniverse with an increased precision.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"snNt86lm3vY4dVjjfRQE0Z8QG0rhhaQMjS8hcNa1kqw","pdfSize":"369468"}