{"id":"2407.06956","title":"Domain theory in univalent foundations II: Continuous and algebraic\n  domains","authors":"Tom de Jong and Mart\\'in H\\\"otzel Escard\\'o","authorsParsed":[["de Jong","Tom",""],["Escardó","Martín Hötzel",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 15:35:22 GMT"},{"version":"v2","created":"Wed, 10 Jul 2024 09:41:18 GMT"},{"version":"v3","created":"Thu, 18 Jul 2024 11:46:43 GMT"}],"updateDate":"2024-07-19","timestamp":1720539322000,"abstract":"  We develop the theory of continuous and algebraic domains in constructive and\npredicative univalent foundations, building upon our earlier work on basic\ndomain theory in this setting. That we work predicatively means that we do not\nassume Voevodsky's propositional resizing axioms. Our work is constructive in\nthe sense that we do not rely on excluded middle or the axiom of (countable)\nchoice. To deal with size issues and give a predicatively suitable definition\nof continuity of a dcpo, we follow Johnstone and Joyal's work on continuous\ncategories. Adhering to the univalent perspective, we explicitly distinguish\nbetween data and property. To ensure that being continuous is a property of a\ndcpo, we turn to the propositional truncation, although we explain that some\ncare is needed to avoid needing the axiom of choice. We also adapt the notion\nof a domain-theoretic basis to the predicative setting by imposing suitable\nsmallness conditions, analogous to the categorical concept of an accessible\ncategory. All our running examples of continuous dcpos are then actually\nexamples of dcpos with small bases which we show to be well behaved\npredicatively. In particular, such dcpos are exactly those presented by small\nideals. As an application of the theory, we show that Scott's $D_\\infty$ model\nof the untyped $\\lambda$-calculus is an example of an algebraic dcpo with a\nsmall basis. Our work is formalised in the Agda proof assistant and its ability\nto infer universe levels has been invaluable for our purposes.\n","subjects":["Computing Research Repository/Logic in Computer Science","Mathematics/Logic"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"mKvLhixBFMM50ZN_UGK7DZtVnV8GaQi3q8kVJWmLifw","pdfSize":"757290"}