{"id":"2407.03334","title":"Linear model reduction using SPOD modes","authors":"Peter Frame, Cong Lin, Oliver Schmidt, Aaron Towne","authorsParsed":[["Frame","Peter",""],["Lin","Cong",""],["Schmidt","Oliver",""],["Towne","Aaron",""]],"versions":[{"version":"v1","created":"Fri, 10 May 2024 14:42:50 GMT"}],"updateDate":"2024-07-08","timestamp":1715352170000,"abstract":"  The majority of model reduction approaches use an efficient representation of\nthe state and then derive equations to temporally evolve the coefficients that\nencode the state in the representation. In this paper, we instead employ an\nefficient representation of the entire trajectory of the state over some time\ninterval and solve for the coefficients that define the trajectory on the\ninterval. We use spectral proper orthogonal decomposition (SPOD) modes, in\nparticular, which possess properties that make them suitable for model\nreduction and are known to provide an accurate representation of trajectories.\nIn fact, with the same number of total coefficients, the SPOD representation is\nsubstantially more accurate than any representation formed by specifying the\ncoefficients in a spatial (e.g., POD) basis for the many time steps that make\nup the interval. We develop a method to solve for the SPOD coefficients that\nencode the trajectories in forced linear dynamical systems given the forcing\nand initial condition, thereby obtaining the accurate representation of the\ntrajectory. We apply the method to two examples, a linearized Ginzburg-Landau\nproblem and an advection-diffusion problem. In both, the error of the proposed\nmethod is orders of magnitude lower than both POD-Galerkin and balanced\ntruncation applied to the same problem, as well as the most accurate solution\nwithin the span of the POD modes. The method is also fast, with CPU time\ncomparable to or lower than both benchmarks in the examples we present.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"qUhrboKKDKpe549RT6x5KK7Q-MlHTZFerIJ_3RA9S9M","pdfSize":"1272564"}
