{"id":"2407.12597","title":"Enhancing Wrist Fracture Detection with YOLO","authors":"Ammar Ahmed, Ali Shariq Imran, Abdul Manaf, Zenun Kastrati, and Sher\n  Muhammad Daudpota","authorsParsed":[["Ahmed","Ammar",""],["Imran","Ali Shariq",""],["Manaf","Abdul",""],["Kastrati","Zenun",""],["Daudpota","Sher Muhammad",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 14:21:53 GMT"},{"version":"v2","created":"Mon, 29 Jul 2024 23:26:11 GMT"}],"updateDate":"2024-07-31","timestamp":1721226113000,"abstract":"  Diagnosing and treating abnormalities in the wrist, specifically distal\nradius, and ulna fractures, is a crucial concern among children, adolescents,\nand young adults, with a higher incidence rate during puberty. However, the\nscarcity of radiologists and the lack of specialized training among medical\nprofessionals pose a significant risk to patient care. This problem is further\nexacerbated by the rising number of imaging studies and limited access to\nspecialist reporting in certain regions. This highlights the need for\ninnovative solutions to improve the diagnosis and treatment of wrist\nabnormalities. Automated wrist fracture detection using object detection has\nshown potential, but current studies mainly use two-stage detection methods\nwith limited evidence for single-stage effectiveness. This study employs\nstate-of-the-art single-stage deep neural network-based detection models\nYOLOv5, YOLOv6, YOLOv7, and YOLOv8 to detect wrist abnormalities. Through\nextensive experimentation, we found that these YOLO models outperform the\ncommonly used two-stage detection algorithm, Faster R-CNN, in fracture\ndetection. Additionally, compound-scaled variants of each YOLO model were\ncompared, with YOLOv8m demonstrating a highest fracture detection sensitivity\nof 0.92 and mean average precision (mAP) of 0.95. On the other hand, YOLOv6m\nachieved the highest sensitivity across all classes at 0.83. Meanwhile, YOLOv8x\nrecorded the highest mAP of 0.77 for all classes on the GRAZPEDWRI-DX pediatric\nwrist dataset, highlighting the potential of single-stage models for enhancing\npediatric wrist imaging.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"VBdWTwnnMgYPn2fln0DJV-_VLEm8bc-7aQl13d_a9is","pdfSize":"3637744"}