{"id":"2407.16736","title":"Inverse Design of Polaritonic Devices","authors":"Oliver Kuster, Yannick Augenstein, Carsten Rockstuhl, Thomas Jebb\n  Sturges","authorsParsed":[["Kuster","Oliver",""],["Augenstein","Yannick",""],["Rockstuhl","Carsten",""],["Sturges","Thomas Jebb",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 16:37:01 GMT"}],"updateDate":"2024-07-25","timestamp":1721752621000,"abstract":"  Polaritons, arising from the strong coupling between excitons and photons\nwithin microcavities, hold promise for optoelectronic and all-optical devices.\nThey have found applications in various domains, including low-threshold lasers\nand quantum information processing. To realize complex functionalities,\nnon-intuitive designs for polaritonic devices are required. In this\ncontribution, we use finite-difference time-domain simulations of the\ndissipative Gross-Pitaevskii equation, written in a differentiable manner, and\ncombine it with an adjoint formulation. Such a method allows us to use topology\noptimization to engineer the potential landscape experienced by polariton\ncondensates to tailor its characteristics on demand. The potential directly\ntranslates to a blueprint for a functional device, and various fabrication and\noptical control techniques can experimentally realize it. We inverse-design a\nselection of polaritonic devices, i.e., a structure that spatially shapes the\npolaritons into a flat-top distribution, a metalens that focuses a polariton,\nand a nonlinearly activated isolator. The functionalities are preserved when\nemploying realistic fabrication constraints such as minimum feature size and\ndiscretization of the potential. Our results demonstrate the utility of inverse\ndesign techniques for polaritonic devices, providing a stepping stone toward\nfuture research in optimizing systems with complex light-matter interactions.\n","subjects":["Physics/Optics","Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"a-wFpR6_dsG2gIINzfhwvgrkUDpyQyBd3jGZfsi-060","pdfSize":"818355"}