{"id":"2407.06219","title":"In Search of Excellence: SHOA as a Competitive Shrike Optimization\n  Algorithm for Multimodal Problems","authors":"Hanan K. AbdulKarim, Tarik A. Rashid","authorsParsed":[["AbdulKarim","Hanan K.",""],["Rashid","Tarik A.",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 11:19:37 GMT"}],"updateDate":"2024-07-10","timestamp":1720523977000,"abstract":"  In this paper, a swarm intelligence optimization algorithm is proposed as the\nShrike Optimization Algorithm (SHOA). Many creatures living in a group and\nsurviving for the next generation randomly search for food; they follow the\nbest one in the swarm, called swarm intelligence. Swarm-based algorithms are\ndesigned to mimic creatures' behaviours, but in multimodal problem competition,\nthey cannot find optimal solutions in some difficult cases. The main\ninspiration for the proposed algorithm is taken from the swarming behaviours of\nshrike birds in nature. The shrike birds are migrating from their territory to\nsurvive. However, the SHOA mimics the surviving behaviour of shrike birds for\nliving, adaptation, and breeding. Two parts of optimization exploration and\nexploitation are designed by modelling shrike breeding and searching for foods\nto feed nestlings until they get ready to fly and live independently. This\npaper is a mathematical model for the SHOA to perform optimization. The SHOA\nbenchmarked 19 well-known mathematical test functions, 10 from CEC-2019, and 12\nfrom CEC-2022 most recent test functions, a total of 41 competitive\nmathematical test functions benchmarked and four real-world engineering\nproblems with different conditions, both constrained and unconstrained. The\nstatistical results obtained from the Wilcoxon sum ranking and Fridman test\nshow that SHOA has a significant statistical superiority in handling the test\nbenchmarks compared to competitor algorithms in multi-modal problems. The\nresults for engineering optimization problems show the SHOA outperforms other\nnature-inspired algorithms in many cases.\n","subjects":["Computing Research Repository/Neural and Evolutionary Computing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"75aAIMdDCJp2MCHv9tGQzOeo3RqJFP7faksQN6l3IE0","pdfSize":"1660250"}
