{"id":"2407.12556","title":"Suppression and excitation condition of collision on instabilities of\n  electrostatic plasmas","authors":"Y. W. Hou, M. Y. Yu, J. F. Wang, C. Y. Liu, M. X. Chen, and B. Wu","authorsParsed":[["Hou","Y. W.",""],["Yu","M. Y.",""],["Wang","J. F.",""],["Liu","C. Y.",""],["Chen","M. X.",""],["Wu","B.",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 13:49:45 GMT"}],"updateDate":"2024-07-18","timestamp":1720619385000,"abstract":"  Two-stream (TS) and Bump-On-Tail (BOT) electron distributions can induce\ninstabilities in collisionless plasmas, which is closely related to phenomena\nin space and fusion plasmas. Collisions can lead to unexpected plasma behavior,\nespecially in dense and/or low temperature plasmas. In this work, the\nVlasov-Poisson system with Krook collisions are used to study the effect of\ncollisions. Normally, the collision can dissipate the system energy which\ncauses the suppression of the instabilities. Against the traditional\nsuppression effect of collision on the instability, it is found in our\nsimulation that the collision can also excite the instability even in the\nforbidden beam velocity range predicted by the cold-beam theory. With\ncollision, the beam velocity range can be divided into suppression area [vth/2,\nvc + vth], transition area [vc - vth, vc + vth], excitation area [vc + vth,\n2vc] and forbidden area [2vc, +infinity] for TS instability. where vc is the\ncritical velocity from cold-beam theory and vth is thermal velocity or the beam\nwidth in our simulation. The collision dissipation effect and the excitation of\nbeam instability can compete with each other, which evoked the excitation of\ncollision on TS instability. The collision can change the suppression and\nexcitation condition from beam theory. However, for BOT instability, there is\nonly suppression effect of collision on the instability. These results can\nexpand the view of collision effect on instability of electrostatic plasmas.\n","subjects":["Physics/Plasma Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"ayCHAGJIgeaPgDhc2_Dyu-sXxyXuA7oK4xRojvSJ40s","pdfSize":"24486217"}