{"id":"2407.13756","title":"Challenge of direct imaging of exoplanets within structures:\n  disentangling real signal from point source from background light","authors":"Jialin Li, Laird M. Close, Jared R. Males, Sebastiaan Y. Haffert,\n  Alycia Weinberger, Katherine Follette, Kevin Wagner, Daniel Apai, Ya-Lin Wu,\n  Joseph D. Long, Laura Perez, Logan A. Pearce, Jay K. Kueny, Eden A. McEwen,\n  Kyle Van Gorkom, Olivier Guyon, Maggie Y. Kautz, Alexander D. Hedglen, Warren\n  B. Foster, Roz Roberts, Jennifer Lumbres, and Lauren Schatz","authorsParsed":[["Li","Jialin",""],["Close","Laird M.",""],["Males","Jared R.",""],["Haffert","Sebastiaan Y.",""],["Weinberger","Alycia",""],["Follette","Katherine",""],["Wagner","Kevin",""],["Apai","Daniel",""],["Wu","Ya-Lin",""],["Long","Joseph D.",""],["Perez","Laura",""],["Pearce","Logan A.",""],["Kueny","Jay K.",""],["McEwen","Eden A.",""],["Van Gorkom","Kyle",""],["Guyon","Olivier",""],["Kautz","Maggie Y.",""],["Hedglen","Alexander D.",""],["Foster","Warren B.",""],["Roberts","Roz",""],["Lumbres","Jennifer",""],["Schatz","Lauren",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 17:55:35 GMT"}],"updateDate":"2024-07-19","timestamp":1721325335000,"abstract":"  The high contrast and spatial resolution requirements for directly imaging\nexoplanets requires effective coordination of wavefront control, coronagraphy,\nobservation techniques, and post-processing algorithms. However, even with this\nsuite of tools, identifying and retrieving exoplanet signals embedded in\nresolved scattered light regions can be extremely challenging due to the\nincreased noise from scattered light off the circumstellar disk and the\npotential misinterpretation of the true nature of the detected signal. This\nissue pertains not only to imaging terrestrial planets in habitable zones\nwithin zodiacal and exozodiacal emission but also to young planets embedded in\ncircumstellar, transitional, and debris disks. This is particularly true for\nH{\\alpha} detection of exoplanets in transitional disks. This work delves into\nrecent H{\\alpha} observations of three transitional disks systems with MagAO-X,\nan extreme adaptive optics system for the 6.5-meter Magellan Clay telescope. We\nemployed angular differential imaging (ADI) and simultaneous spectral\ndifferential imaging (SSDI) in combination with KLIP, a PCA algorithm in\npost-processing, for optimal starlight suppression and quasi-static noise\nremoval. We discuss the challenges in protoplanet identification with MagAO-X\nin environments rich with scattered and reflected light from disk structures\nand explore a potential solution for removing noise contributions from real\nastronomical objects with current observation and post-processing techniques.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"coFWKqeyzL3Lm5oHSfgnQglsVwjfujwmO-T_hSVfXSE","pdfSize":"4024125"}