{"id":"2407.17605","title":"Coupling Speech Encoders with Downstream Text Models","authors":"Ciprian Chelba and Johan Schalkwyk","authorsParsed":[["Chelba","Ciprian",""],["Schalkwyk","Johan",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 19:29:13 GMT"}],"updateDate":"2024-07-26","timestamp":1721849353000,"abstract":"  We present a modular approach to building cascade speech translation (AST)\nmodels that guarantees that the resulting model performs no worse than the\n1-best cascade baseline while preserving state-of-the-art speech recognition\n(ASR) and text translation (MT) performance for a given task. Our novel\ncontribution is the use of an ``exporter'' layer that is trained under L2-loss\nto ensure a strong match between ASR embeddings and the MT token embeddings for\nthe 1-best sequence. The ``exporter'' output embeddings are fed directly to the\nMT model in lieu of 1-best token embeddings, thus guaranteeing that the\nresulting model performs no worse than the 1-best cascade baseline, while\nallowing back-propagation gradient to flow from the MT model into the ASR\ncomponents. The matched-embeddings cascade architecture provide a significant\nimprovement over its 1-best counterpart in scenarios where incremental training\nof the MT model is not an option and yet we seek to improve quality by\nleveraging (speech, transcription, translated transcription) data provided with\nthe AST task. The gain disappears when the MT model is incrementally trained on\nthe parallel text data available with the AST task. The approach holds promise\nfor other scenarios that seek to couple ASR encoders and immutable text models,\nsuch at large language models (LLM).\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Machine Learning","Computing Research Repository/Sound","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"DAPPQtuk45MNK8HgOiqHrRJGjGhW3RZFyE4R7suqnXU","pdfSize":"206693","objectId":"0x3061026ebd0e3dd393a7151af3e3c39f4c4b7b56ce88bdee59d6d5a6d5b749ec","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
