{"id":"2407.12478","title":"Phase-Shift and Transmit Power Optimization for RIS-Aided Massive MIMO\n  SWIPT IoT Networks","authors":"Mohammadali Mohammadi and Hien Quoc Ngo and Michail Matthaiou","authorsParsed":[["Mohammadi","Mohammadali",""],["Ngo","Hien Quoc",""],["Matthaiou","Michail",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 11:04:20 GMT"}],"updateDate":"2024-07-18","timestamp":1721214260000,"abstract":"  We investigate reconfigurable intelligent surface (RIS)-assisted simultaneous\nwireless information and power transfer (SWIPT) Internet of Things (IoT)\nnetworks, where energy-limited IoT devices are overlaid with cellular\ninformation users (IUs). IoT devices are wirelessly powered by a RIS-assisted\nmassive multiple-input multiple-output (MIMO) base station (BS), which is\nsimultaneously serving a group of IUs. By leveraging a two-timescale\ntransmission scheme, precoding at the BS is developed based on the\ninstantaneous channel state information (CSI), while the passive beamforming at\nthe RIS is adapted to the slowly-changing statistical CSI. We derive\nclosed-form expressions for the achievable spectral efficiency of the IUs and\naverage harvested energy at the IoT devices, taking the channel estimation\nerrors and pilot contamination into account. Then, a non-convex max-min\nfairness optimization problem is formulated subject to the power budget at the\nBS and individual quality of service requirements of IUs, where the transmit\npower levels at the BS and passive RIS reflection coefficients are jointly\noptimized. Our simulation results show that the average harvested energy at the\nIoT devices can be improved by $132\\%$ with the proposed resource allocation\nalgorithm. Interestingly, IoT devices benefit from the pilot contamination,\nleading to a potential doubling of the harvested energy in certain network\nconfigurations.\n","subjects":["Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Y9xU8Oba5CORpG-KbKPrev__2NFQ21Y0hIWYMDRULxU","pdfSize":"3254426"}