{"id":"2407.15978","title":"BUFFALO Wild Wings: A High Precision Free-Form Lens Model of MACSJ0416\n  with Constraints on Dark Matter from Substructure and Highly Magnified Arcs","authors":"Derek Perera, Liliya L. R. Williams, Jori Liesenborgs, Patrick L.\n  Kelly, Sarah H. Taft, Sung Kei Li, Mathilde Jauzac, Jose M. Diego, Priyamvada\n  Natarajan, Charles L. Steinhardt, Andreas L. Faisst, R. Michael Rich","authorsParsed":[["Perera","Derek",""],["Williams","Liliya L. R.",""],["Liesenborgs","Jori",""],["Kelly","Patrick L.",""],["Taft","Sarah H.",""],["Li","Sung Kei",""],["Jauzac","Mathilde",""],["Diego","Jose M.",""],["Natarajan","Priyamvada",""],["Steinhardt","Charles L.",""],["Faisst","Andreas L.",""],["Rich","R. Michael",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 18:42:52 GMT"}],"updateDate":"2024-07-24","timestamp":1721673772000,"abstract":"  We present new free-form and hybrid mass reconstructions of the galaxy\ncluster lens MACS J0416.1-2403 at $z=0.396$ using the lens inversion method\nGRALE. The reconstructions use 237 spectroscopically confirmed multiple images\nfrom Bergamini et. al. 2023 as the main input. Our primary model reconstructs\nimages to a positional accuracy of 0.191\", thus representing one of the most\nprecise reconstructions of this lens to date. Our models find broad agreement\nwith previous reconstructions, and identify two $\\sim 10^{11} M_{\\odot}$\nlight-unaffiliated substructures. We focus on two highly magnified arcs: Spock\nand Mothra. Our model features a unique critical curve structure around the\nSpock arc with 2 crossings. This structure enables sufficient magnification\nacross this arc to potentially explain the large number of transients as\nmicrolensing events of supergiant stars. Additionally, we develop a model of\nthe millilens substructure expected to be magnifying Mothra, which may be a\nbinary pair of supergiants with $\\mu \\sim 6000$. This model accounts for\nflexibility in the millilens position while preserving the observed flux and\nminimizing image position displacements along the Mothra arc. We constrain the\nmillilens mass and core radius to $\\lesssim 10^6 M_{\\odot}$ and $\\lesssim 12$\npc, respectively, which would render it one of the smallest and most compact\nsubstructures constrained by lensing. If the millilens is dominated by wave\ndark matter, the axion mass is constrained to be $< 3.0 \\times 10^{-21}$ eV.\nFurther monitoring of this lens with JWST will uncover more transients,\npermitting tighter constraints on the structure surrounding these two arcs.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"jOph5y2FDlk_RHQZuQBZphEsu9OFRI5RVZPYdYfzoFo","pdfSize":"4994716","objectId":"0x3463555ce94f25dfed22097c5a989e8359da22b99d9d6526e7afb008e5bac09a","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
