{"id":"2407.06190","title":"4D Contrastive Superflows are Dense 3D Representation Learners","authors":"Xiang Xu and Lingdong Kong and Hui Shuai and Wenwei Zhang and Liang\n  Pan and Kai Chen and Ziwei Liu and Qingshan Liu","authorsParsed":[["Xu","Xiang",""],["Kong","Lingdong",""],["Shuai","Hui",""],["Zhang","Wenwei",""],["Pan","Liang",""],["Chen","Kai",""],["Liu","Ziwei",""],["Liu","Qingshan",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 17:59:54 GMT"},{"version":"v2","created":"Wed, 10 Jul 2024 01:32:28 GMT"}],"updateDate":"2024-07-11","timestamp":1720461594000,"abstract":"  In the realm of autonomous driving, accurate 3D perception is the foundation.\nHowever, developing such models relies on extensive human annotations -- a\nprocess that is both costly and labor-intensive. To address this challenge from\na data representation learning perspective, we introduce SuperFlow, a novel\nframework designed to harness consecutive LiDAR-camera pairs for establishing\nspatiotemporal pretraining objectives. SuperFlow stands out by integrating two\nkey designs: 1) a dense-to-sparse consistency regularization, which promotes\ninsensitivity to point cloud density variations during feature learning, and 2)\na flow-based contrastive learning module, carefully crafted to extract\nmeaningful temporal cues from readily available sensor calibrations. To further\nboost learning efficiency, we incorporate a plug-and-play view consistency\nmodule that enhances the alignment of the knowledge distilled from camera\nviews. Extensive comparative and ablation studies across 11 heterogeneous LiDAR\ndatasets validate our effectiveness and superiority. Additionally, we observe\nseveral interesting emerging properties by scaling up the 2D and 3D backbones\nduring pretraining, shedding light on the future research of 3D foundation\nmodels for LiDAR-based perception.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning","Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"iXCHTMt34G3TO1JRZwRnoLImH18gfpEWsUKGpE10s1Q","pdfSize":"10579796"}