{"id":"2407.15910","title":"Development of Multistage Machine Learning Classifier using Decision\n  Trees and Boosting Algorithms over Darknet Network Traffic","authors":"Anjali Sureshkumar Nair, Prashant Nitnaware","authorsParsed":[["Nair","Anjali Sureshkumar",""],["Nitnaware","Prashant",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 17:10:26 GMT"}],"updateDate":"2024-08-31","timestamp":1721668226000,"abstract":"  In recent years, the clandestine nature of darknet activities has presented\nan escalating challenge to cybersecurity efforts, necessitating sophisticated\nmethods for the detection and classification of network traffic associated with\nthese covert operations. The system addresses the significant challenge of\nclass imbalance within Darknet traffic datasets, where malicious traffic\nconstitutes a minority, hindering effective discrimination between normal and\nmalicious behavior. By leveraging boosting algorithms like AdaBoost and\nGradient Boosting coupled with decision trees, this study proposes a robust\nsolution for network traffic classification. Boosting algorithms ensemble\nlearning corrects errors iteratively and assigns higher weights to minority\nclass instances, complemented by the hierarchical structure of decision trees.\nThe additional Feature Selection which is a preprocessing method by utilizing\nInformation Gain metrics, Fisher's Score, and Chi-Square test selection for\nfeatures is employed. Rigorous experimentation with diverse Darknet traffic\ndatasets validates the efficacy of the proposed multistage classifier,\nevaluated through various performance metrics such as accuracy, precision,\nrecall, and F1-score, offering a comprehensive solution for accurate detection\nand classification of Darknet activities.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"dqlCVQ1hEPXa9WPXpv42FOxQbN6uVm4QMVkNbkR2tOc","pdfSize":"323719"}