{"id":"2407.10793","title":"GraphEval: A Knowledge-Graph Based LLM Hallucination Evaluation\n  Framework","authors":"Hannah Sansford, Nicholas Richardson, Hermina Petric Maretic, Juba\n  Nait Saada","authorsParsed":[["Sansford","Hannah",""],["Richardson","Nicholas",""],["Maretic","Hermina Petric",""],["Saada","Juba Nait",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 15:11:16 GMT"}],"updateDate":"2024-07-16","timestamp":1721056276000,"abstract":"  Methods to evaluate Large Language Model (LLM) responses and detect\ninconsistencies, also known as hallucinations, with respect to the provided\nknowledge, are becoming increasingly important for LLM applications. Current\nmetrics fall short in their ability to provide explainable decisions,\nsystematically check all pieces of information in the response, and are often\ntoo computationally expensive to be used in practice. We present GraphEval: a\nhallucination evaluation framework based on representing information in\nKnowledge Graph (KG) structures. Our method identifies the specific triples in\nthe KG that are prone to hallucinations and hence provides more insight into\nwhere in the response a hallucination has occurred, if at all, than previous\nmethods. Furthermore, using our approach in conjunction with state-of-the-art\nnatural language inference (NLI) models leads to an improvement in balanced\naccuracy on various hallucination benchmarks, compared to using the raw NLI\nmodels. Lastly, we explore the use of GraphEval for hallucination correction by\nleveraging the structure of the KG, a method we name GraphCorrect, and\ndemonstrate that the majority of hallucinations can indeed be rectified.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"XKLObUackC0hAuZUHJOB1Qr3GLwmBjz49ZbHYBwOpj0","pdfSize":"882149","objectId":"0x88773ee94358330b53c6cb6154deb13718eb18757de73f12df681e08f8e37c67","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
