{"id":"2407.20062","title":"SalNAS: Efficient Saliency-prediction Neural Architecture Search with\n  self-knowledge distillation","authors":"Chakkrit Termritthikun, Ayaz Umer, Suwichaya Suwanwimolkul, Feng Xia,\n  Ivan Lee","authorsParsed":[["Termritthikun","Chakkrit",""],["Umer","Ayaz",""],["Suwanwimolkul","Suwichaya",""],["Xia","Feng",""],["Lee","Ivan",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 14:48:34 GMT"}],"updateDate":"2024-07-30","timestamp":1722264514000,"abstract":"  Recent advancements in deep convolutional neural networks have significantly\nimproved the performance of saliency prediction. However, the manual\nconfiguration of the neural network architectures requires domain knowledge\nexpertise and can still be time-consuming and error-prone. To solve this, we\npropose a new Neural Architecture Search (NAS) framework for saliency\nprediction with two contributions. Firstly, a supernet for saliency prediction\nis built with a weight-sharing network containing all candidate architectures,\nby integrating a dynamic convolution into the encoder-decoder in the supernet,\ntermed SalNAS. Secondly, despite the fact that SalNAS is highly efficient\n(20.98 million parameters), it can suffer from the lack of generalization. To\nsolve this, we propose a self-knowledge distillation approach, termed Self-KD,\nthat trains the student SalNAS with the weighted average information between\nthe ground truth and the prediction from the teacher model. The teacher model,\nwhile sharing the same architecture, contains the best-performing weights\nchosen by cross-validation. Self-KD can generalize well without the need to\ncompute the gradient in the teacher model, enabling an efficient training\nsystem. By utilizing Self-KD, SalNAS outperforms other state-of-the-art\nsaliency prediction models in most evaluation rubrics across seven benchmark\ndatasets while being a lightweight model. The code will be available at\nhttps://github.com/chakkritte/SalNAS\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"ePFZV6PQ1nK4UHmD7nv0TYuvlWZSAmEbxwi-ZkqyKBI","pdfSize":"3567246"}