{"id":"2407.02515","title":"Functional variant of Polynomial Analogue of Gandy's Fixed Point Theorem","authors":"Andrey Nechesov","authorsParsed":[["Nechesov","Andrey",""]],"versions":[{"version":"v1","created":"Sun, 23 Jun 2024 10:07:49 GMT"}],"updateDate":"2024-07-04","timestamp":1719137269000,"abstract":"  In this work, a functional variant of the polynomial analogue of the\nclassical Gandy's fixed point theorem is obtained. Sufficient conditions have\nbeen found to ensure that the complexity of the recursive function does not go\nbeyond the polynomial. In 2021, we proved a polynomial analogue of the\nclassical Gandy's fixed point theorem. This became an important impetus for the\nconstruction of p-complete programming languages. And such a language was first\nbuilt by us in 2022. The main result of that work was: a solution of the\nproblem P=L. Next are the followers of the works on building a new high-level\nlanguage and the idea of building a general programming methodology. But there\nwas one gap in our research: classes of recursive functions whose complexity\nwas polynomial were not described. In this work we found sufficient conditions\nfor such functions. In many ways, the main ideas of this work are similar to\nthe ideas that we used in the proof of the polynomial analogue of Gandy's fixed\npoint theorem. But there are also striking differences. Functions, as such,\ndiffer quite strongly from predicates precisely in the multitude of their\nvalues. If a predicate is either true or false, then a function can generally\ntake on a variety of values. Moreover, even if there are not many values, but\nthere is recursion and simple multiplication, then powers and factorials may\narise during the calculations, which, of course, can violate the polynomial\ncomputational complexity of this function. Therefore, finding these\nrestrictions on recursive functions that would be soft enough for the class of\nfunctions to be large, and at the same time tough enough not to go beyond\npolynomiality, has been a problem for us for the last 3 years, after the proof\nof the polynomial analogue Gandy's fixed point theorem in the case of predicate\nextensions.\n","subjects":["Computing Research Repository/Logic in Computer Science","Computing Research Repository/Computational Complexity","Mathematics/Logic"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"jt90HlN_-glDw36KBJaB_8J_CCbJJICxsfv8asNI1Lo","pdfSize":"77998"}