{"id":"2407.01739","title":"Enabling Tactile Feedback for Robotic Strawberry Handling using AST Skin","authors":"Vishnu Rajendran, Kiyanoush Nazari, Simon Parsons, and Amir Ghalamzan","authorsParsed":[["Rajendran","Vishnu",""],["Nazari","Kiyanoush",""],["Parsons","Simon",""],["Ghalamzan","Amir",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 19:13:08 GMT"}],"updateDate":"2024-07-03","timestamp":1719861188000,"abstract":"  Acoustic Soft Tactile (AST) skin is a novel sensing technology which derives\ntactile information from the modulation of acoustic waves travelling through\nthe skin's embedded acoustic channels. A generalisable data-driven calibration\nmodel maps the acoustic modulations to the corresponding tactile information in\nthe form of contact forces with their contact locations and contact geometries.\nAST skin technology has been highlighted for its easy customisation. As a case\nstudy, this paper discusses the possibility of using AST skin on a custom-built\nrobotic end effector finger for strawberry handling. The paper delves into the\ndesign, prototyping, and calibration method to sensorise the end effector\nfinger with AST skin. A real-time force-controlled gripping experiment is\nconducted with the sensorised finger to handle strawberries by their peduncle.\nThe finger could successfully grip the strawberry peduncle by maintaining a\npreset force of 2 N with a maximum Mean Absolute Error (MAE) of 0.31 N over\nmultiple peduncle diameters and strawberry weight classes. Moreover, this study\nsets confidence in the usability of AST skin in generating real-time tactile\nfeedback for robot manipulation tasks.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"k6qZHBxNucaAp8GNRwBxxPQczSm_dg5jTrqg2a9iJ1o","pdfSize":"2559082","objectId":"0xb1a21a19f43ee1a218c1a447c6adc6e7143e91b50761d3ef3536f683c5c8d132","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
