{"id":"2407.21217","title":"NeuroSEM: A hybrid framework for simulating multiphysics problems by\n  coupling PINNs and spectral elements","authors":"Khemraj Shukla, Zongren Zou, Chi Hin Chan, Additi Pandey, Zhicheng\n  Wang, George Em Karniadakis","authorsParsed":[["Shukla","Khemraj",""],["Zou","Zongren",""],["Chan","Chi Hin",""],["Pandey","Additi",""],["Wang","Zhicheng",""],["Karniadakis","George Em",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 22:01:14 GMT"}],"updateDate":"2024-08-01","timestamp":1722376874000,"abstract":"  Multiphysics problems that are characterized by complex interactions among\nfluid dynamics, heat transfer, structural mechanics, and electromagnetics, are\ninherently challenging due to their coupled nature. While experimental data on\ncertain state variables may be available, integrating these data with numerical\nsolvers remains a significant challenge. Physics-informed neural networks\n(PINNs) have shown promising results in various engineering disciplines,\nparticularly in handling noisy data and solving inverse problems. However,\ntheir effectiveness in forecasting nonlinear phenomena in multiphysics regimes\nis yet to be fully established. This study introduces NeuroSEM, a hybrid\nframework integrating PINNs with the high-fidelity Spectral Element Method\n(SEM) solver, Nektar++. NeuroSEM leverages strengths of both PINNs and SEM,\nproviding robust solutions for multiphysics problems. PINNs are trained to\nassimilate data and model physical phenomena in specific subdomains, which are\nthen integrated into Nektar++. We demonstrate the efficiency and accuracy of\nNeuroSEM for thermal convection in cavity flow and flow past a cylinder. The\nframework effectively handles data assimilation by addressing those subdomains\nand state variables where data are available. We applied NeuroSEM to the\nRayleigh-B\\'enard convection system, including cases with missing thermal\nboundary conditions. Our results indicate that NeuroSEM accurately models the\nphysical phenomena and assimilates the data within the specified subdomains.\nThe framework's plug-and-play nature facilitates its extension to other\nmultiphysics or multiscale problems. Furthermore, NeuroSEM is optimized for an\nefficient execution on emerging integrated GPU-CPU architectures. This hybrid\napproach enhances the accuracy and efficiency of simulations, making it a\npowerful tool for tackling complex engineering challenges in various scientific\ndomains.\n","subjects":["Computing Research Repository/Machine Learning","Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"WDdJqn6JM-PaVHDqcZpGfb6aBY7YuiITkAM33USIV7o","pdfSize":"10035974"}