{"id":"2407.03098","title":"Magnetization nutation in magnetic semiconductors: Effective spin model\n  with anisotropic RKKY exchange interaction","authors":"H. Kachkachi","authorsParsed":[["Kachkachi","H.",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 13:37:14 GMT"},{"version":"v2","created":"Wed, 14 Aug 2024 16:40:02 GMT"},{"version":"v3","created":"Wed, 28 Aug 2024 10:47:57 GMT"}],"updateDate":"2024-08-29","timestamp":1720013834000,"abstract":"  We demonstrate that the magnetization in magnetic semiconductors exhibits\nnutational motion when subjected to an external magnetic field. This behavior\noriginates from the splitting of the conduction-electron band which induces\nanisotropic, distance-dependent exchange coupling between localized spins.\n  To investigate this phenomenon, we examine a general system that includes\nboth charge and spin degrees of freedom, characteristic of a magnetic\nsemiconductor. This system is composed of two subsystems: (1) a gas of\nnoninteracting conduction electrons and (2) a ferromagnetic array of localized\nspins, coupled through the Vonsovskii (\\textit{sd}) local interaction. The\nentire system is subject to external electrical and magnetic disturbances.\nThrough the Feynman-Schwinger formalism, we integrate out the faster\n(Grassmann) charge degrees of freedom associated with the conduction electrons\nto obtain the effective Hamiltonian for the localized spins in the form of an\nXXZ spin model. We then provide general analytical formulas for the\ncorresponding anisotropic exchange couplings, expressed in Fourier and direct\nspaces, as functions of the effective field that induces conduction-band\nsplitting.\n  ....\n  We hope this study will motivate further research into nutational phenomena\nin magnetic semiconductors, possibly resulting in improvements in the accurate\ncontrol of magnetization dynamics within spin-based electronic devices.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"zcoSRigXyRZVyTiEfXK47DZI31DLT939r47r6gBILlc","pdfSize":"513731"}
