{"id":"2407.06308","title":"Spin-3/2 nuclear magnetic resonance: Exact solutions for aligned systems\n  and implications for probing Fe-based superconductors","authors":"Jaafar N. Ansari, Karen L. Sauer","authorsParsed":[["Ansari","Jaafar N.",""],["Sauer","Karen L.",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 18:18:56 GMT"}],"updateDate":"2024-07-10","timestamp":1720462736000,"abstract":"  The nuclear magnetic resonance (NMR) spectrum of spin-3/2 nuclei in a static\nmagnetic field aligned with one of the electric field gradient (EFG) principal\naxes is developed analytically, based on fictitious spin-1/2 formalism. Compact\nclosed-form expressions for the eigenstates and transitions frequencies, as\nwell as the expectation value of the magnetic moment after resonant excitation,\nare derived. Emphasis is placed on defining and interpreting the associated\nRabi frequencies, as a function of excitation direction and ellipticity. It is\nfound transitions inherently fall into two subsets, depending on their\nsensitivity to excitation direction, with the Rabi frequency of one subset\ndirectly depending on the asymmetry of the EFG. A natural application is the\nstudy of Fe-based superconductors, whose antiferromagnetic ordering at low\ntemperatures leads to a strong intrinsic magnetic field aligned with the EFG\nprincipal axes. Zero external-field NMR spectra, from powder samples of two\nsuch Fe-based superconductors, BaFe$_2$As$_2$ and CaFe$_2$As$_2$, are analyzed\nand exemplify the simplicity in extracting the internal magnetic field, the\nquadrupole coupling constant, and the EFG asymmetry parameter, which are\nimportant for studying magnetic ordering, structural properties, phase\ntransitions, and NMR dynamics. Results compare favorably to conventional\nhigh-field NMR experiments done with the rotation of single crystals. Overall,\nthe physical insights, afforded by the exact and concise expressions, will lead\nto ready interpretation of spin-3/2 spectra as well as precipitate new\nexperimental directions.\n","subjects":["Condensed Matter/Superconductivity","Condensed Matter/Other Condensed Matter"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"UX5D2w5Q4lhbKpd4xyK06hB_uCN83ku6YWckcdGSLlg","pdfSize":"1709888"}