{"id":"2407.17435","title":"Joint Transmit and Jamming Power Optimization for Secrecy in Energy\n  Harvesting Networks: A Reinforcement Learning Approach","authors":"Shalini Tripathi and Chinmoy Kundu and Animesh Yadav and Ankur Bansal\n  and Holger Claussen and Lester Ho","authorsParsed":[["Tripathi","Shalini",""],["Kundu","Chinmoy",""],["Yadav","Animesh",""],["Bansal","Ankur",""],["Claussen","Holger",""],["Ho","Lester",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 17:11:19 GMT"}],"updateDate":"2024-07-25","timestamp":1721841079000,"abstract":"  In this paper, we address the problem of joint allocation of transmit and\njamming power at the source and destination, respectively, to enhance the\nlong-term cumulative secrecy performance of an energy-harvesting wireless\ncommunication system until it stops functioning in the presence of an\neavesdropper. The source and destination have energy-harvesting devices with\nlimited battery capacities. The destination also has a full-duplex transceiver\nto transmit jamming signals for secrecy. We frame the problem as an\ninfinite-horizon Markov decision process (MDP) problem and propose a\nreinforcement learning-based optimal joint power allocation (OJPA) algorithm\nthat employs a policy iteration (PI) algorithm. Since the optimal algorithm is\ncomputationally expensive, we develop a low-complexity sub-optimal joint power\nallocation (SJPA) algorithm, namely, reduced state joint power allocation\n(RSJPA). Two other SJPA algorithms, the greedy algorithm (GA) and the naive\nalgorithm (NA), are implemented as benchmarks. In addition, the OJPA algorithm\noutperforms the individual power allocation (IPA) algorithms termed individual\ntransmit power allocation (ITPA) and individual jamming power allocation\n(IJPA), where the transmit and jamming powers, respectively, are optimized\nindividually. The results show that the OJPA algorithm is also more energy\nefficient. Simulation results show that the OJPA algorithm significantly\nimproves the secrecy performance compared to all SJPA algorithms. The proposed\nRSJPA algorithm achieves nearly optimal performance with significantly less\ncomputational complexity marking it the balanced choice between the complexity\nand the performance. We find that the computational time for the RSJPA\nalgorithm is around 75 percent less than the OJPA algorithm.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"3olBAw6lj0ktNMWuhQ3H5J6VXHFy13TSEuGixlxsLqM","pdfSize":"737728","objectId":"0xbf5c627f3ec1ff1be8cafa3312287ae6774381ff6d3679a8a60a54ac21acaa3a","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
