{"id":"2407.06195","title":"Higher-Order Spatial Information for Self-Supervised Place Cell Learning","authors":"Jared Deighton, Wyatt Mackey, Ioannis Schizas, David L. Boothe Jr.,\n  Vasileios Maroulas","authorsParsed":[["Deighton","Jared",""],["Mackey","Wyatt",""],["Schizas","Ioannis",""],["Boothe","David L.","Jr."],["Maroulas","Vasileios",""]],"versions":[{"version":"v1","created":"Mon, 10 Jun 2024 15:03:54 GMT"}],"updateDate":"2024-07-10","timestamp":1718031834000,"abstract":"  Mammals navigate novel environments and exhibit resilience to sparse\nenvironmental sensory cues via place and grid cells, which encode position in\nspace. While the efficiency of grid cell coding has been extensively studied,\nthe computational role of place cells is less well understood. This gap arises\npartially because spatial information measures have, until now, been limited to\nsingle place cells. We derive and implement a higher-order spatial information\nmeasure, allowing for the study of the emergence of multiple place cells in a\nself-supervised manner. We show that emergent place cells have many desirable\nfeatures, including high-accuracy spatial decoding. This is the first work in\nwhich higher-order spatial information measures that depend solely on place\ncells' firing rates have been derived and which focuses on the emergence of\nmultiple place cells via self-supervised learning. By quantifying the spatial\ninformation of multiple place cells, we enhance our understanding of place cell\nformation and capabilities in recurrent neural networks, thereby improving the\npotential navigation capabilities of artificial systems in novel environments\nwithout objective location information.\n","subjects":["Quantitative Biology/Neurons and Cognition","Computing Research Repository/Information Theory","Computing Research Repository/Machine Learning","Computing Research Repository/Neural and Evolutionary Computing","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"AE2-cABZgZNfl0tG2UKpLXnVGZep6JU3vC32_zj1IoM","pdfSize":"34582666"}