{"id":"2407.09445","title":"Intensive broadband reverberation mapping of Fairall 9 with 1.8 years of\n  daily Swift monitoring","authors":"R. Edelson, B. M. Peterson, J. Gelbord, K. Horne, M. Goad, I. McHardy,\n  S. Vaughan, M. Vestergaard","authorsParsed":[["Edelson","R.",""],["Peterson","B. M.",""],["Gelbord","J.",""],["Horne","K.",""],["Goad","M.",""],["McHardy","I.",""],["Vaughan","S.",""],["Vestergaard","M.",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 17:29:48 GMT"}],"updateDate":"2024-07-15","timestamp":1720805388000,"abstract":"  We present 1.8 years of near-daily Swift monitoring of the bright, strongly\nvariable Type 1 AGN Fairall 9. Totaling 575 successful visits, this is the\nlargest such campaign reported to date. Variations within the UV/optical are\nwell-correlated, with longer wavelengths lagging shorter wavelengths in the\ndirection predicted by thin disk/lamp-post models. The correlations are\nimproved by detrending; subtracting a second-order polynomial fit to the\nUV/optical light curves to remove long-term trends that are not of interest to\nthis study. Extensive testing indicates detrending with higher-order\npolynomials removes too much intrinsic variability signal on reverberation\ntimescales. These data provide the clearest detection to date of interband lags\nwithin the UV, indicating that neither emission from a large disk nor diffuse\ncontinuum emission from the broad-line region can independently explain the\nfull observed lag spectrum. The observed X-ray flux variations are poorly\ncorrelated with those in the UV/optical. Further, subdivision of the data into\nfour ~160 day light curves shows that the UV/optical lag spectrum is highly\nstable throughout the four periods, but the X-ray to UV lags are unstable,\nsignificantly changing magnitude and even direction from one period to the\nnext. This indicates the X-ray to UV relationship is more complex than\npredicted by the simple reprocessing model often adopted for AGN. A bowl model\n(lamp-post irradiation and blackbody reprocessing on a disk with a steep rim)\nfit suggests the disk thickens at a distance (~10 lt-day) and temperature\n(~8000K) consistent with the inner edge of the BLR.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"U_2YoT7RyLuHZrTt9ZYeNoIKorjdDnh6Q3MgEyBhXXA","pdfSize":"2322170","objectId":"0x969c46c281ad225c8b90c54a4e0f31cb30becbc8c13d50f7327a52450f889f1f","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
