{"id":"2407.16298","title":"EffiSegNet: Gastrointestinal Polyp Segmentation through a Pre-Trained\n  EfficientNet-based Network with a Simplified Decoder","authors":"Ioannis A. Vezakis, Konstantinos Georgas, Dimitrios Fotiadis and\n  George K. Matsopoulos","authorsParsed":[["Vezakis","Ioannis A.",""],["Georgas","Konstantinos",""],["Fotiadis","Dimitrios",""],["Matsopoulos","George K.",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 08:54:55 GMT"}],"updateDate":"2024-07-24","timestamp":1721724895000,"abstract":"  This work introduces EffiSegNet, a novel segmentation framework leveraging\ntransfer learning with a pre-trained Convolutional Neural Network (CNN)\nclassifier as its backbone. Deviating from traditional architectures with a\nsymmetric U-shape, EffiSegNet simplifies the decoder and utilizes full-scale\nfeature fusion to minimize computational cost and the number of parameters. We\nevaluated our model on the gastrointestinal polyp segmentation task using the\npublicly available Kvasir-SEG dataset, achieving state-of-the-art results.\nSpecifically, the EffiSegNet-B4 network variant achieved an F1 score of 0.9552,\nmean Dice (mDice) 0.9483, mean Intersection over Union (mIoU) 0.9056, Precision\n0.9679, and Recall 0.9429 with a pre-trained backbone - to the best of our\nknowledge, the highest reported scores in the literature for this dataset.\nAdditional training from scratch also demonstrated exceptional performance\ncompared to previous work, achieving an F1 score of 0.9286, mDice 0.9207, mIoU\n0.8668, Precision 0.9311 and Recall 0.9262. These results underscore the\nimportance of a well-designed encoder in image segmentation networks and the\neffectiveness of transfer learning approaches.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_qi1kYipi9tQzr0HuhK734WEbv_8KEDqXEJsK0zeXeg","pdfSize":"232350"}