{"id":"2407.19422","title":"A Generic Review of Integrating Artificial Intelligence in Cognitive\n  Behavioral Therapy","authors":"Meng Jiang, Qing Zhao, Jianqiang Li, Fan Wang, Tianyu He, Xinyan\n  Cheng, Bing Xiang Yang, Grace W.K. Ho, and Guanghui Fu","authorsParsed":[["Jiang","Meng",""],["Zhao","Qing",""],["Li","Jianqiang",""],["Wang","Fan",""],["He","Tianyu",""],["Cheng","Xinyan",""],["Yang","Bing Xiang",""],["Ho","Grace W. K.",""],["Fu","Guanghui",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 08:09:46 GMT"}],"updateDate":"2024-07-30","timestamp":1722154186000,"abstract":"  Cognitive Behavioral Therapy (CBT) is a well-established intervention for\nmitigating psychological issues by modifying maladaptive cognitive and\nbehavioral patterns. However, delivery of CBT is often constrained by resource\nlimitations and barriers to access. Advancements in artificial intelligence\n(AI) have provided technical support for the digital transformation of CBT.\nParticularly, the emergence of pre-training models (PTMs) and large language\nmodels (LLMs) holds immense potential to support, augment, optimize and\nautomate CBT delivery. This paper reviews the literature on integrating AI into\nCBT interventions. We begin with an overview of CBT. Then, we introduce the\nintegration of AI into CBT across various stages: pre-treatment, therapeutic\nprocess, and post-treatment. Next, we summarized the datasets relevant to some\nCBT-related tasks. Finally, we discuss the benefits and current limitations of\napplying AI to CBT. We suggest key areas for future research, highlighting the\nneed for further exploration and validation of the long-term efficacy and\nclinical utility of AI-enhanced CBT. The transformative potential of AI in\nreshaping the practice of CBT heralds a new era of more accessible, efficient,\nand personalized mental health interventions.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"RRteIIvp2kLmbRGx7uEcnj76Y-dMTpWBFR3NCLYGRAM","pdfSize":"668569"}