{"id":"2407.20547","title":"Neuromorphic on-chip reservoir computing with spiking neural network\n  architectures","authors":"Samip Karki, Diego Chavez Arana, Andrew Sornborger, Francesco\n  Caravelli","authorsParsed":[["Karki","Samip",""],["Arana","Diego Chavez",""],["Sornborger","Andrew",""],["Caravelli","Francesco",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 05:05:09 GMT"}],"updateDate":"2024-07-31","timestamp":1722315909000,"abstract":"  Reservoir computing is a promising approach for harnessing the computational\npower of recurrent neural networks while dramatically simplifying training.\nThis paper investigates the application of integrate-and-fire neurons within\nreservoir computing frameworks for two distinct tasks: capturing chaotic\ndynamics of the H\\'enon map and forecasting the Mackey-Glass time series.\nIntegrate-and-fire neurons can be implemented in low-power neuromorphic\narchitectures such as Intel Loihi. We explore the impact of network topologies\ncreated through random interactions on the reservoir's performance. Our study\nreveals task-specific variations in network effectiveness, highlighting the\nimportance of tailored architectures for distinct computational tasks. To\nidentify optimal network configurations, we employ a meta-learning approach\ncombined with simulated annealing. This method efficiently explores the space\nof possible network structures, identifying architectures that excel in\ndifferent scenarios. The resulting networks demonstrate a range of behaviors,\nshowcasing how inherent architectural features influence task-specific\ncapabilities. We study the reservoir computing performance using a custom\nintegrate-and-fire code, Intel's Lava neuromorphic computing software\nframework, and via an on-chip implementation in Loihi. We conclude with an\nanalysis of the energy performance of the Loihi architecture.\n","subjects":["Computing Research Repository/Neural and Evolutionary Computing","Computing Research Repository/Emerging Technologies","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"of5aSIV5k--CBHcHO5EJv4SlkfqO4FwIHXM8v2Tb8eg","pdfSize":"2436564"}