{"id":"2407.15534","title":"One-dimensional quantum dot array integrated with charge sensors in an\n  InAs nanowire","authors":"Yi Luo, Xiao-Fei Liu, Zhi-Hai Liu, Weijie Li, Shili Yan, Han Gao,\n  Haitian Su, Dong Pan, Jianhua Zhao, Ji-Yin Wang and H. Q. Xu","authorsParsed":[["Luo","Yi",""],["Liu","Xiao-Fei",""],["Liu","Zhi-Hai",""],["Li","Weijie",""],["Yan","Shili",""],["Gao","Han",""],["Su","Haitian",""],["Pan","Dong",""],["Zhao","Jianhua",""],["Wang","Ji-Yin",""],["Xu","H. Q.",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 10:53:39 GMT"}],"updateDate":"2024-07-23","timestamp":1721645619000,"abstract":"  We report an experimental study of a one-dimensional quintuple-quantum-dot\narray integrated with two quantum dot charge sensors in an InAs nanowire. The\ndevice is studied by measuring double quantum dots formed consecutively in the\narray and corresponding charge stability diagrams are revealed with both direct\ncurrent measurements and charge sensor signals. The one-dimensional\nquintuple-quantum-dot array are then tuned up and its charge configurations are\nfully mapped out with the two charge sensors. The energy level of each dot in\nthe array can be controlled individually by using a compensated gate\narchitecture (i.e., \"virtual gate\"). After that, four dots in the array are\nselected to form two double quantum dots and ultra strong inter-double-dot\ninteraction is obtained. A theoretical simulation based on a 4-dimensional\nHamiltonian confirms the strong coupling strength between the two double\nquantum dots. The highly controllable one-dimensional quantum dot array\nachieved in this work is expected to be valuable for employing InAs nanowires\nto construct advanced quantum hardware in the future.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Physics/Applied Physics","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"A-cDUJQ-iKdjJJ6vGpi8XGNO6cKFu8Tzdpjshb8YFrk","pdfSize":"3731278"}