{"id":"2407.15770","title":"Examining Inequality in Park Quality for Promoting Health Across 35\n  Global Cities","authors":"Linus W. Dietz and Sanja \\v{S}\\'cepanovi\\'c and Ke Zhou and Andr\\'e\n  Felipe Zanella and Daniele Quercia","authorsParsed":[["Dietz","Linus W.",""],["Šćepanović","Sanja",""],["Zhou","Ke",""],["Zanella","André Felipe",""],["Quercia","Daniele",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 16:20:30 GMT"}],"updateDate":"2024-07-23","timestamp":1721665230000,"abstract":"  Urban parks provide significant health benefits by offering spaces and\nfacilities for various recreational and leisure activities. However, the\ncapacity of specific park spaces and elements to foster health remains\nunderexamined. Traditional studies have focused on parks' size, greenery, and\naccessibility, often overlooking their ability to facilitate specific\nhealth-promoting activities. To address this gap, we propose a taxonomy\nconsisting of six categories of health-promoting activities in parks: physical,\nmind-body, nature appreciation, environmental, social, and cultural. We\nestimate the capacity of parks in 35 global cities to promote health by\nestablishing a lexicon linking park spaces and elements with specific\nhealth-promoting activities from our taxonomy. Using this lexicon, we collected\ndata on elements and spaces in all parks in 35 cities from OpenStreetMap. Our\nanalysis covers 23,477 parks with a total of 827,038 elements and spaces. By\nfirst comparing similarly sized parks across cities, we found that North\nAmerican parks offer more spaces for physical activities, while European parks\nfocus more on nature appreciation. Second, by scoring parks based on both\nelements and spaces, we investigated the variability in their health-promoting\npotential. We found the most uniform provision across parks for physical\nactivities and the highest disparities regarding social activities.\nAdditionally, parks offering a variety of activities are usually located in\ncity centers, while offerings diminish in parks towards the suburbs. Lastly, we\nidentified significant inequalities in park standards across cities, regardless\nof their continental location: Tokyo and Paris offer the most uniform park\nstandards, while Copenhagen and Rio de Janeiro exhibit the most pronounced\ndisparities. Our study provides insights for making urban parks more equitable,\nengaging, and health-promoting.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"vxTd1OzfEUKyLit6j82QwvJOEEE48h6_ARXJkQCs9ag","pdfSize":"5576096"}