{"id":"2407.21565","title":"Multi-agent reinforcement learning for the control of three-dimensional\n  Rayleigh-B\\'enard convection","authors":"Joel Vasanth, Jean Rabault, Francisco Alc\\'antara-\\'Avila, Mikael\n  Mortensen and Ricardo Vinuesa","authorsParsed":[["Vasanth","Joel",""],["Rabault","Jean",""],["Alcántara-Ávila","Francisco",""],["Mortensen","Mikael",""],["Vinuesa","Ricardo",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 12:41:20 GMT"}],"updateDate":"2024-08-01","timestamp":1722429680000,"abstract":"  Deep reinforcement learning (DRL) has found application in numerous use-cases\npertaining to flow control. Multi-agent RL (MARL), a variant of DRL, has shown\nto be more effective than single-agent RL in controlling flows exhibiting\nlocality and translational invariance. We present, for the first time, an\nimplementation of MARL-based control of three-dimensional Rayleigh-B\\'enard\nconvection (RBC). Control is executed by modifying the temperature distribution\nalong the bottom wall divided into multiple control segments, each of which\nacts as an independent agent. Two regimes of RBC are considered at Rayleigh\nnumbers $\\mathrm{Ra}=500$ and $750$. Evaluation of the learned control policy\nreveals a reduction in convection intensity by $23.5\\%$ and $8.7\\%$ at\n$\\mathrm{Ra}=500$ and $750$, respectively. The MARL controller converts\nirregularly shaped convective patterns to regular straight rolls with lower\nconvection that resemble flow in a relatively more stable regime. We draw\ncomparisons with proportional control at both $\\mathrm{Ra}$ and show that MARL\nis able to outperform the proportional controller. The learned control strategy\nis complex, featuring different non-linear segment-wise actuator delays and\nactuation magnitudes. We also perform successful evaluations on a larger domain\nthan used for training, demonstrating that the invariant property of MARL\nallows direct transfer of the learnt policy.\n","subjects":["Physics/Fluid Dynamics","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"GaNv8EgAivIFa4SXQWZT6APCjwtIKVR1ZAa6t7hjt6o","pdfSize":"3076957"}