{"id":"2407.00681","title":"Safe Reinforcement Learning for Power System Control: A Review","authors":"Peipei Yu, Zhenyi Wang, Hongcai Zhang and Yonghua Song","authorsParsed":[["Yu","Peipei",""],["Wang","Zhenyi",""],["Zhang","Hongcai",""],["Song","Yonghua",""]],"versions":[{"version":"v1","created":"Sun, 30 Jun 2024 12:40:32 GMT"}],"updateDate":"2024-07-02","timestamp":1719751232000,"abstract":"  The large-scale integration of intermittent renewable energy resources\nintroduces increased uncertainty and volatility to the supply side of power\nsystems, thereby complicating system operation and control. Recently,\ndata-driven approaches, particularly reinforcement learning (RL), have shown\nsignificant promise in addressing complex control challenges in power systems,\nbecause RL can learn from interactive feedback without needing prior knowledge\nof the system model. However, the training process of model-free RL methods\nrelies heavily on random decisions for exploration, which may result in ``bad\"\ndecisions that violate critical safety constraints and lead to catastrophic\ncontrol outcomes. Due to the inability of RL methods to theoretically ensure\ndecision safety in power systems, directly deploying traditional RL algorithms\nin the real world is deemed unacceptable. Consequently, the safety issue in RL\napplications, known as safe RL, has garnered considerable attention in recent\nyears, leading to numerous important developments. This paper provides a\ncomprehensive review of the state-of-the-art safe RL techniques and discusses\nhow these techniques can be applied to power system control problems such as\nfrequency regulation, voltage control, and energy management. We then present\ndiscussions on key challenges and future research directions, related to\nconvergence and optimality, training efficiency, universality, and real-world\ndeployment.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"hc3q7reNok2m0GCwgw_BviFkc9FZ-t3czl4Xm9Td5ZY","pdfSize":"885993"}