{"id":"2407.21381","title":"Identity-Consistent Diffusion Network for Grading Knee Osteoarthritis\n  Progression in Radiographic Imaging","authors":"Wenhua Wu, Kun Hu, Wenxi Yue, Wei Li, Milena Simic, Changyang Li, Wei\n  Xiang, and Zhiyong Wang","authorsParsed":[["Wu","Wenhua",""],["Hu","Kun",""],["Yue","Wenxi",""],["Li","Wei",""],["Simic","Milena",""],["Li","Changyang",""],["Xiang","Wei",""],["Wang","Zhiyong",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 07:12:06 GMT"}],"updateDate":"2024-08-01","timestamp":1722409926000,"abstract":"  Knee osteoarthritis (KOA), a common form of arthritis that causes physical\ndisability, has become increasingly prevalent in society. Employing\ncomputer-aided techniques to automatically assess the severity and progression\nof KOA can greatly benefit KOA treatment and disease management. Particularly,\nthe advancement of X-ray technology in KOA demonstrates its potential for this\npurpose. Yet, existing X-ray prognosis research generally yields a singular\nprogression severity grade, overlooking the potential visual changes for\nunderstanding and explaining the progression outcome. Therefore, in this study,\na novel generative model is proposed, namely Identity-Consistent Radiographic\nDiffusion Network (IC-RDN), for multifaceted KOA prognosis encompassing a\npredicted future knee X-ray scan conditioned on the baseline scan.\nSpecifically, an identity prior module for the diffusion and a downstream\ngeneration-guided progression prediction module are introduced. Compared to\nconventional image-to-image generative models, identity priors regularize and\nguide the diffusion to focus more on the clinical nuances of the prognosis\nbased on a contrastive learning strategy. The progression prediction module\nutilizes both forecasted and baseline knee scans, and a more comprehensive\nformulation of KOA severity progression grading is expected. Extensive\nexperiments on a widely used public dataset, OAI, demonstrate the effectiveness\nof the proposed method.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"i6OZkvCVckblTJsxtQkLubyXGv6m2I_ZdH0lVOuvb9M","pdfSize":"3917674"}