{"id":"2407.09845","title":"Towards Understanding Epoch-wise Double descent in Two-layer Linear\n  Neural Networks","authors":"Amanda Olmin, Fredrik Lindsten","authorsParsed":[["Olmin","Amanda",""],["Lindsten","Fredrik",""]],"versions":[{"version":"v1","created":"Sat, 13 Jul 2024 10:45:21 GMT"},{"version":"v2","created":"Thu, 12 Sep 2024 08:45:41 GMT"},{"version":"v3","created":"Thu, 19 Sep 2024 08:05:48 GMT"}],"updateDate":"2024-09-20","timestamp":1720867521000,"abstract":"  Epoch-wise double descent is the phenomenon where generalisation performance\nimproves beyond the point of overfitting, resulting in a generalisation curve\nexhibiting two descents under the course of learning. Understanding the\nmechanisms driving this behaviour is crucial not only for understanding the\ngeneralisation behaviour of machine learning models in general, but also for\nemploying conventional selection methods, such as the use of early stopping to\nmitigate overfitting. While we ultimately want to draw conclusions of more\ncomplex models, such as deep neural networks, a majority of theoretical results\nregarding the underlying cause of epoch-wise double descent are based on simple\nmodels, such as standard linear regression. In this paper, to take a step\ntowards more complex models in theoretical analysis, we study epoch-wise double\ndescent in two-layer linear neural networks. First, we derive a gradient flow\nfor the linear two-layer model, that bridges the learning dynamics of the\nstandard linear regression model, and the linear two-layer diagonal network\nwith quadratic weights. Second, we identify additional factors of epoch-wise\ndouble descent emerging with the extra model layer, by deriving necessary\nconditions for the generalisation error to follow a double descent pattern.\nWhile epoch-wise double descent in linear regression has been attributed to\ndifferences in input variance, in the two-layer model, also the singular values\nof the input-output covariance matrix play an important role. This opens up for\nfurther questions regarding unidentified factors of epoch-wise double descent\nfor truly deep models.\n","subjects":["Statistics/Machine Learning","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"tEzKP3GOyqKrUfZeWcPJb6NTNHmjQ4Cvw47msS1Ii_I","pdfSize":"523220"}