{"id":"2407.08469","title":"A Comprehensive Convolutional Neural Network Architecture Design using\n  Magnetic Skyrmion and Domain Wall","authors":"Saumya Gupta (1), Venkatesh Vadde (1), Bhaskaran Muralidharan (1) and\n  Abhishek Sharma (2) ((1) Department of Electrical Engineering, Indian\n  Institute of Technology Bombay, Powai, Mumbai-400076, India, (2) Department\n  of Electrical Engineering, Indian Institute of Technology Ropar, Rupnagar,\n  Punjab-140001, India)","authorsParsed":[["Gupta","Saumya",""],["Vadde","Venkatesh",""],["Muralidharan","Bhaskaran",""],["Sharma","Abhishek",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 13:04:02 GMT"},{"version":"v2","created":"Wed, 28 Aug 2024 20:40:47 GMT"}],"updateDate":"2024-08-30","timestamp":1720703042000,"abstract":"  Spintronic-based neuromorphic hardware offers high-density and rapid data\nprocessing at nanoscale lengths by leveraging magnetic configurations like\nskyrmion and domain walls. Here, we present the maximal hardware implementation\nof a convolutional neural network (CNN) based on a compact multi-bit\nskyrmion-based synapse and a hybrid CMOS domain wall-based circuit for\nactivation and max-pooling functionalities. We demonstrate the micromagnetic\ndesign and operation of a circular bilayer skyrmion system mimicking a scalable\nartificial synapse, demonstrated up to 6-bit (64 states) with an ultra-low\nenergy consumption of 0.87 fJ per state update. We further show that the\nsynaptic weight modulation is achieved by the perpendicular current interaction\nwith the labyrinth-maze like uniaxial anisotropy profile, inducing skyrmionic\ngyration, thereby enabling long-term potentiation (LTP) and long-term\ndepression (LTD) operations. Furthermore, we present a simultaneous rectified\nlinear (ReLU) activation and max pooling circuitry featuring a SOT-based domain\nwall ReLU with a power consumption of 4.73 $\\mu$W. The ReLU function,\nstabilized by a parabolic uniaxial anisotropy profile, encodes domain wall\npositions into continuous resistance states coupled with the HSPICE circuit\nsimulator. Our integrated skyrmion and domain wall-based spintronic hardware\nachieves 98.07% accuracy in convolutional neural network (CNN) based pattern\nrecognition task, consuming 110 mW per image.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"mELRwn9QUGXhHZCWRp3NNY_UCj3chnZc5qfrOs-SzZQ","pdfSize":"9823933"}