{"id":"2407.05766","title":"Multi-agent Reinforcement Learning-based Network Intrusion Detection\n  System","authors":"Amine Tellache, Amdjed Mokhtari, Abdelaziz Amara Korba, Yacine\n  Ghamri-Doudane","authorsParsed":[["Tellache","Amine",""],["Mokhtari","Amdjed",""],["Korba","Abdelaziz Amara",""],["Ghamri-Doudane","Yacine",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 09:18:59 GMT"}],"updateDate":"2024-07-09","timestamp":1720430339000,"abstract":"  Intrusion Detection Systems (IDS) play a crucial role in ensuring the\nsecurity of computer networks. Machine learning has emerged as a popular\napproach for intrusion detection due to its ability to analyze and detect\npatterns in large volumes of data. However, current ML-based IDS solutions\noften struggle to keep pace with the ever-changing nature of attack patterns\nand the emergence of new attack types. Additionally, these solutions face\nchallenges related to class imbalance, where the number of instances belonging\nto different classes (normal and intrusions) is significantly imbalanced, which\nhinders their ability to effectively detect minor classes. In this paper, we\npropose a novel multi-agent reinforcement learning (RL) architecture, enabling\nautomatic, efficient, and robust network intrusion detection. To enhance the\ncapabilities of the proposed model, we have improved the DQN algorithm by\nimplementing the weighted mean square loss function and employing\ncost-sensitive learning techniques. Our solution introduces a resilient\narchitecture designed to accommodate the addition of new attacks and\neffectively adapt to changes in existing attack patterns. Experimental results\nrealized using CIC-IDS-2017 dataset, demonstrate that our approach can\neffectively handle the class imbalance problem and provide a fine grained\nclassification of attacks with a very low false positive rate. In comparison to\nthe current state-of-the-art works, our solution demonstrates a significant\nsuperiority in both detection rate and false positive rate.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"KnnKKHoTLhetdtHjqJ9OseJdd_MP_owebJ2ox13fdM4","pdfSize":"1331426"}