{"id":"2407.20335","title":"Delayed jet launching in binary neutron star mergers with realistic\n  initial magnetic fields","authors":"Ricard Aguilera-Miret, Carlos Palenzuela, Federico Carrasco, Stephan\n  Rosswog, Daniele Vigan\\`o","authorsParsed":[["Aguilera-Miret","Ricard",""],["Palenzuela","Carlos",""],["Carrasco","Federico",""],["Rosswog","Stephan",""],["Viganò","Daniele",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 18:00:09 GMT"}],"updateDate":"2024-07-31","timestamp":1722276009000,"abstract":"  We analyze a long-lived hyper-massive neutron star merger remnant\n(post-merger lifetime $>250$ ms) that has been obtained via large eddy\nsimulations with a gradient subgrid-scale model. We find a clear helicoidal\nmagnetic field structure that is governed by the toroidal component of the\nmagnetic field. Although no jet emerges during the simulation time, we observe\nat late times a significant increase of the poloidal component of the magnetic\nfield at all scales. We also compare with the results of several binary neutron\nstar simulations with moderate resolution of $120$~m, that are evolved up to\n$50$~ms after the merger, which differ in terms of the initial topology and\nstrength of the magnetic field. We find that the best choice is an isotropic\nsmall-scale magnetic field distribution that mimics the turbulent state that\ngenerically develops during the merger. This initial configuration reaches a\ncloser agreement with our high-resolution simulation results than the purely\ndipolar large-scale fields that are commonly employed in these type of\nsimulations. This provides a recipe to perform such simulations avoiding the\ncomputationally expensive grids required to faithfully capture the\namplification of the magnetic field by Kelvin-Helmholtz instabilities.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"j4ca7kcLH2S8lyGLa1v2WY79vKJdUlZYil-fotOy-mU","pdfSize":"8275802"}