{"id":"2407.05258","title":"Comparison of optical spectra between asteroids Ryugu and Bennu: II.\n  High-precision analysis for space weathering trends","authors":"K. Yumoto, E. Tatsumi, T. Kouyama, D. R. Golish, Y. Cho, T. Morota, S.\n  Kameda, H. Sato, B. Rizk, D. N. DellaGiustina, Y. Yokota, H. Suzuki, J. de\n  Le\\'on, H. Campins, J. Licandro, M. Popescu, J. L. Rizos, R. Honda, M.\n  Yamada, N. Sakatani, C. Honda, M. Matsuoka, M. Hayakawa, H. Sawada, K. Ogawa,\n  Y. Yamamoto, D. S. Lauretta, S. Sugita","authorsParsed":[["Yumoto","K.",""],["Tatsumi","E.",""],["Kouyama","T.",""],["Golish","D. R.",""],["Cho","Y.",""],["Morota","T.",""],["Kameda","S.",""],["Sato","H.",""],["Rizk","B.",""],["DellaGiustina","D. N.",""],["Yokota","Y.",""],["Suzuki","H.",""],["de León","J.",""],["Campins","H.",""],["Licandro","J.",""],["Popescu","M.",""],["Rizos","J. L.",""],["Honda","R.",""],["Yamada","M.",""],["Sakatani","N.",""],["Honda","C.",""],["Matsuoka","M.",""],["Hayakawa","M.",""],["Sawada","H.",""],["Ogawa","K.",""],["Yamamoto","Y.",""],["Lauretta","D. S.",""],["Sugita","S.",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 05:10:45 GMT"}],"updateDate":"2024-07-09","timestamp":1720329045000,"abstract":"  The influence of space weathering on the observed spectra of C-complex\nasteroids remains uncertain. This has long hindered our understanding of their\ncomposition through telescope observations. Multi-band imaging of Ryugu by\nONC-T on Hayabusa2 and that of Bennu by MapCam on OSIRIS-REx found opposite\nspectral trends of space weathering; Ryugu darkened/reddened while Bennu\nbrightened/blued. How the spectra of Ryugu and Bennu evolved relative to each\nother would place a constraint for understanding their origins and evolutions.\nIn this study, we compared the space weathering trends on Ryugu and Bennu by\napplying the results of cross calibration between ONC-T and MapCam. We show\nthat the average Bennu surface is brighter by 18.0 $\\pm$ 1.5% at 550 nm and\nbluer by 0.18 $\\pm$ 0.03 $\\mu$m$^{-1}$ (480-850 nm slope) than Ryugu. The\nspectral slopes of surface materials are more uniform on Bennu than on Ryugu at\nspatial scales $\\gtrsim$1 m, but Bennu is more heterogeneous at $\\lesssim$1 m.\nThis suggests that lateral mixing due to resurfacing may have been more\nefficient on Bennu. The reflectance-spectral slope distributions of craters on\nRyugu and Bennu appeared to follow two trend lines with an offset before cross\ncalibration, but they converged to a single straight trend without a bend after\ncross calibration. We show that the spectra of the freshest craters on Ryugu\nand Bennu are indistinguishable within the uncertainty of cross calibration.\nThese results suggest that Ryugu and Bennu initially had similar spectra before\nspace weathering and that they evolved in completely opposite directions along\nthe same trend line, subsequently evolving into asteroids with different\ndisk-averaged spectra. These findings further suggest that space weathering\nlikely expanded the spectral slope variation of C-complex asteroids, implying\nthat they may have formed from materials with more uniform spectral slopes.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Physics/Space Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"S0TLLBZy89bQ88NHJUQLgd6r-1nvyt_CHSI9fjVDQAI","pdfSize":"11810573"}