{"id":"2407.12473","title":"A Novel Dependency Framework for Enhancing Discourse Data Analysis","authors":"Kun Sun, Rong Wang","authorsParsed":[["Sun","Kun",""],["Wang","Rong",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 10:55:00 GMT"}],"updateDate":"2024-07-18","timestamp":1721213700000,"abstract":"  The development of different theories of discourse structure has led to the\nestablishment of discourse corpora based on these theories. However, the\nexistence of discourse corpora established on different theoretical bases\ncreates challenges when it comes to exploring them in a consistent and cohesive\nway. This study has as its primary focus the conversion of PDTB annotations\ninto dependency structures. It employs refined BERT-based discourse parsers to\ntest the validity of the dependency data derived from the PDTB-style corpora in\nEnglish, Chinese, and several other languages. By converting both PDTB and RST\nannotations for the same texts into dependencies, this study also applies\n``dependency distance'' metrics to examine the correlation between RST\ndependencies and PDTB dependencies in English. The results show that the PDTB\ndependency data is valid and that there is a strong correlation between the two\ntypes of dependency distance. This study presents a comprehensive approach for\nanalyzing and evaluating discourse corpora by employing discourse dependencies\nto achieve unified analysis. By applying dependency representations, we can\nextract data from PDTB, RST, and SDRT corpora in a coherent and unified manner.\nMoreover, the cross-linguistic validation establishes the framework's\ngeneralizability beyond English. The establishment of this comprehensive\ndependency framework overcomes limitations of existing discourse corpora,\nsupporting a diverse range of algorithms and facilitating further studies in\ncomputational discourse analysis and language sciences.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"pWunqfeWza5iP58MnbcbQxqwQAuKhDAYLKwgtUjHYiI","pdfSize":"794978"}