{"id":"2407.12490","title":"An extended Rice model for intergranular fracture","authors":"Kai Zhao, Yu Ding, Haiyang Yu, Jianying He, Zhiliang Zhang","authorsParsed":[["Zhao","Kai",""],["Ding","Yu",""],["Yu","Haiyang",""],["He","Jianying",""],["Zhang","Zhiliang",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 11:16:58 GMT"}],"updateDate":"2024-07-18","timestamp":1721215018000,"abstract":"  The plastic events occurring during the process of intergranular fracture in\nmetals is still not well understood due to the complexity of grain boundary\n(GB) structures and their interactions with crack-tip dislocation plasticity.\nBy considering the local GB structural transformation after dislocation\nemission from a GB in the Peierls-type Rice-Beltz model, herein we established\na semi-analytical transition-state-theory-based framework to predict the most\nprobable Mode-I stress intensity factor (SIF) for dislocation emission from a\ncracked GB. Using large-scale molecular dynamics (MD) simulations, we studied\nthe fracture behaviors of bi-crystalline Fe samples with 12 different symmetric\ntilt GBs inside. The MD results demonstrate that the presence of GB could\nsignificantly change the SIF required for the activation of plastic events,\nconfirming the theoretical predictions that attributes this to the energy\nchange caused by the transformation of GB structure. Both the atomistic\nsimulation and the theoretical model consistently indicate that, the critical\ndynamic SIF ($K_{I}^{c}(t)$) at which the dynamic SIF $K_{I}(t)$ deviates from\nthe linearity with respect to the strain ${\\epsilon}$, increases with the\nincreasing loading rate. However, the classical Rice model underestimates the\n$K_{I}^{c}(t)$ due to its failure to consider the effects of localized fields.\nThe present theoretical model provides a mechanism-based framework for the\napplication of grain boundary engineering in the design and fabrication of\nnano-grained metals.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"F1iL0pdXXbw4s4S8_2tDUyN91-vV0MGO1nMhPfSaF3E","pdfSize":"2834636"}