{"id":"2407.14171","title":"Current-Crowding-Free Superconducting Nanowire Single-Photon Detectors","authors":"Stefan Strohauer, Fabian Wietschorke, Christian Schmid, Stefanie\n  Grotowski, Lucio Zugliani, Bj\\\"orn Jonas, Kai M\\\"uller, Jonathan J. Finley","authorsParsed":[["Strohauer","Stefan",""],["Wietschorke","Fabian",""],["Schmid","Christian",""],["Grotowski","Stefanie",""],["Zugliani","Lucio",""],["Jonas","Björn",""],["Müller","Kai",""],["Finley","Jonathan J.",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 09:59:17 GMT"}],"updateDate":"2024-07-22","timestamp":1721383157000,"abstract":"  Detecting single photons is essential for applications such as dark matter\ndetection, quantum science and technology, and biomedical imaging.\nSuperconducting nanowire single-photon detectors (SNSPDs) excel in this task\ndue to their near-unity detection efficiency, sub-Hz dark count rates, and\npicosecond timing jitter. However, a local increase of current density (current\ncrowding) in the bends of meander-shaped SNSPDs limits these performance\nmetrics. By locally irradiating the straight segments of SNSPDs with helium\nions while leaving the bends unirradiated, we realize current-crowding-free\nSNSPDs with simultaneously enhanced sensitivity: after irradiation with 800\nions/nm$\\unicode{xB2}$, locally irradiated SNSPDs showed a relative saturation\nplateau width of 37% while fully irradiated SNSPDs reached only 10%. This\nlarger relative plateau width allows operation at lower relative bias currents,\nthereby reducing the dark count rate while still detecting single photons\nefficiently. We achieve an internal detection efficiency of 94% for a\nwavelength of 780 nm with a dark count rate of 7 mHz near the onset of\nsaturating detection efficiency.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Superconductivity","Physics/Instrumentation and Detectors","Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0_HJmLqF4ysEe-fGNk0IT2nwS3SFILlu_U-d3v7lNwQ","pdfSize":"2608486"}