{"id":"2407.11141","title":"UFQA: Utility guided Fingerphoto Quality Assessment","authors":"Amol S. Joshi, Ali Dabouei, Jeremy Dawson, Nasser Nasrabadi","authorsParsed":[["Joshi","Amol S.",""],["Dabouei","Ali",""],["Dawson","Jeremy",""],["Nasrabadi","Nasser",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 18:06:07 GMT"}],"updateDate":"2024-07-17","timestamp":1721066767000,"abstract":"  Quality assessment of fingerprints captured using digital cameras and\nsmartphones, also called fingerphotos, is a challenging problem in biometric\nrecognition systems. As contactless biometric modalities are gaining more\nattention, their reliability should also be improved. Many factors, such as\nillumination, image contrast, camera angle, etc., in fingerphoto acquisition\nintroduce various types of distortion that may render the samples useless.\nCurrent quality estimation methods developed for fingerprints collected using\ncontact-based sensors are inadequate for fingerphotos. We propose Utility\nguided Fingerphoto Quality Assessment (UFQA), a self-supervised dual encoder\nframework to learn meaningful feature representations to assess fingerphoto\nquality. A quality prediction model is trained to assess fingerphoto quality\nwith additional supervision of quality maps. The quality metric is a predictor\nof the utility of fingerphotos in matching scenarios. Therefore, we use a\nholistic approach by including fingerphoto utility and local quality when\nlabeling the training data. Experimental results verify that our approach\nperforms better than the widely used fingerprint quality metric NFIQ2.2 and\nstate-of-the-art image quality assessment algorithms on multiple publicly\navailable fingerphoto datasets.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"UN2REOMgtfNd6JJcqLOfTfDoenwTCdrEjczracSVdWg","pdfSize":"7290836","objectId":"0x1d5d8f29bfab199cd406ce358de45c702f0754bbfc62f9ab9b4dcacb3ea05527","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
