{"id":"2407.17793","title":"Use-dependent Biases as Optimal Action under Information Bottleneck","authors":"Hokin Deng and Adrian Haith","authorsParsed":[["Deng","Hokin",""],["Haith","Adrian",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 06:05:32 GMT"},{"version":"v2","created":"Sun, 4 Aug 2024 23:10:12 GMT"},{"version":"v3","created":"Tue, 6 Aug 2024 04:24:13 GMT"},{"version":"v4","created":"Thu, 15 Aug 2024 21:41:39 GMT"}],"updateDate":"2024-08-19","timestamp":1721887532000,"abstract":"  Use-dependent bias is a phenomenon in human sensorimotor behavior whereby\nmovements become biased towards previously repeated actions. Despite being\nwell-documented, the reason why this phenomenon occurs is not yet clearly\nunderstood. Here, we propose that use-dependent biases can be understood as a\nrational strategy for movement under limitations on the capacity to process\nsensory information to guide motor output. We adopt an information-theoretic\napproach to characterize sensorimotor information processing and determine how\nbehavior should be optimized given limitations to this capacity. We show that\nthis theory naturally predicts the existence of use-dependent biases. Our\nframework also generates two further predictions. The first prediction relates\nto handedness. The dominant hand is associated with enhanced dexterity and\nreduced movement variability compared to the non-dominant hand, which we\npropose relates to a greater capacity for information processing in regions\nthat control movement of the dominant hand. Consequently, the dominant hand\nshould exhibit smaller use-dependent biases compared to the non-dominant hand.\nThe second prediction relates to how use-dependent biases are affected by\nmovement speed. When moving faster, it is more challenging to correct for\ninitial movement errors online during the movement. This should exacerbate\ncosts associated with initial directional error and, according to our theory,\nreduce the extent of use-dependent biases compared to slower movements, and\nvice versa. We show that these two empirical predictions, the handedness effect\nand the speed-dependent effect, are confirmed by experimental data.\n","subjects":["Quantitative Biology/Neurons and Cognition","Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"kbwWft2adYvvVfzoFat2ecREya4VeQa5MGpYQW6LMIk","pdfSize":"539049"}