{"id":"2407.13000","title":"Novel Deep Neural Network Classifier Characterization Metrics with\n  Applications to Dataless Evaluation","authors":"Nathaniel Dean and Dilip Sarkar","authorsParsed":[["Dean","Nathaniel",""],["Sarkar","Dilip",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 20:40:46 GMT"}],"updateDate":"2024-07-19","timestamp":1721248846000,"abstract":"  The mainstream AI community has seen a rise in large-scale open-source\nclassifiers, often pre-trained on vast datasets and tested on standard\nbenchmarks; however, users facing diverse needs and limited, expensive test\ndata may be overwhelmed by available choices. Deep Neural Network (DNN)\nclassifiers undergo training, validation, and testing phases using example\ndataset, with the testing phase focused on determining the classification\naccuracy of test examples without delving into the inner working of the\nclassifier. In this work, we evaluate a DNN classifier's training quality\nwithout any example dataset. It is assumed that a DNN is a composition of a\nfeature extractor and a classifier which is the penultimate completely\nconnected layer. The quality of a classifier is estimated using its weight\nvectors. The feature extractor is characterized using two metrics that utilize\nfeature vectors it produces when synthetic data is fed as input. These\nsynthetic input vectors are produced by backpropagating desired outputs of the\nclassifier. Our empirical study of the proposed method for ResNet18, trained\nwith CAFIR10 and CAFIR100 datasets, confirms that data-less evaluation of DNN\nclassifiers is indeed possible.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Neural and Evolutionary Computing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"2iE5T9MW-3yDARijuKQHL3v8on0tfpOejuzzye1SuwY","pdfSize":"398449","objectId":"0x00173db798b033bde55daddd6c5c3e31ab5d3e9d3c09be89dfa5fb8ea143d8aa","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
