{"id":"2407.16721","title":"Machine Learning Models for the Identification of Cardiovascular\n  Diseases Using UK Biobank Data","authors":"Sheikh Mohammed Shariful Islam, Moloud Abrar, Teketo Tegegne, Liliana\n  Loranjo, Chandan Karmakar, Md Abdul Awal, Md. Shahadat Hossain, Muhammad\n  Ashad Kabir, Mufti Mahmud, Abbas Khosravi, George Siopis, Jeban C Moses,\n  Ralph Maddison","authorsParsed":[["Islam","Sheikh Mohammed Shariful",""],["Abrar","Moloud",""],["Tegegne","Teketo",""],["Loranjo","Liliana",""],["Karmakar","Chandan",""],["Awal","Md Abdul",""],["Hossain","Md. Shahadat",""],["Kabir","Muhammad Ashad",""],["Mahmud","Mufti",""],["Khosravi","Abbas",""],["Siopis","George",""],["Moses","Jeban C",""],["Maddison","Ralph",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 11:05:20 GMT"}],"updateDate":"2024-07-25","timestamp":1721732720000,"abstract":"  Machine learning models have the potential to identify cardiovascular\ndiseases (CVDs) early and accurately in primary healthcare settings, which is\ncrucial for delivering timely treatment and management. Although\npopulation-based CVD risk models have been used traditionally, these models\noften do not consider variations in lifestyles, socioeconomic conditions, or\ngenetic predispositions. Therefore, we aimed to develop machine learning models\nfor CVD detection using primary healthcare data, compare the performance of\ndifferent models, and identify the best models. We used data from the UK\nBiobank study, which included over 500,000 middle-aged participants from\ndifferent primary healthcare centers in the UK. Data collected at baseline\n(2006--2010) and during imaging visits after 2014 were used in this study.\nBaseline characteristics, including sex, age, and the Townsend Deprivation\nIndex, were included. Participants were classified as having CVD if they\nreported at least one of the following conditions: heart attack, angina,\nstroke, or high blood pressure. Cardiac imaging data such as electrocardiogram\nand echocardiography data, including left ventricular size and function,\ncardiac output, and stroke volume, were also used. We used 9 machine learning\nmodels (LSVM, RBFSVM, GP, DT, RF, NN, AdaBoost, NB, and QDA), which are\nexplainable and easily interpretable. We reported the accuracy, precision,\nrecall, and F-1 scores; confusion matrices; and area under the curve (AUC)\ncurves.\n","subjects":["Quantitative Biology/Quantitative Methods","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Txx_BhUuUZkoLuYq0dEWYnuBwdABtaTESxHr5osqwEo","pdfSize":"625592"}