{"id":"2407.12812","title":"Building Understandable Messaging for Policy and Evidence Review\n  (BUMPER) with AI","authors":"Katherine A. Rosenfeld, Maike Sonnewald, Sonia J. Jindal, Kevin A.\n  McCarthy, Joshua L. Proctor","authorsParsed":[["Rosenfeld","Katherine A.",""],["Sonnewald","Maike",""],["Jindal","Sonia J.",""],["McCarthy","Kevin A.",""],["Proctor","Joshua L.",""]],"versions":[{"version":"v1","created":"Thu, 27 Jun 2024 05:03:03 GMT"}],"updateDate":"2024-07-19","timestamp":1719464583000,"abstract":"  We introduce a framework for the use of large language models (LLMs) in\nBuilding Understandable Messaging for Policy and Evidence Review (BUMPER). LLMs\nare proving capable of providing interfaces for understanding and synthesizing\nlarge databases of diverse media. This presents an exciting opportunity to\nsupercharge the translation of scientific evidence into policy and action,\nthereby improving livelihoods around the world. However, these models also pose\nchallenges related to access, trust-worthiness, and accountability. The BUMPER\nframework is built atop a scientific knowledge base (e.g., documentation, code,\nsurvey data) by the same scientists (e.g., individual contributor, lab,\nconsortium). We focus on a solution that builds trustworthiness through\ntransparency, scope-limiting, explicit-checks, and uncertainty measures. LLMs\nare rapidly being adopted and consequences are poorly understood. The framework\naddresses open questions regarding the reliability of LLMs and their use in\nhigh-stakes applications. We provide a worked example in health policy for a\nmodel designed to inform measles control programs. We argue that this framework\ncan facilitate accessibility of and confidence in scientific evidence for\npolicymakers, drive a focus on policy-relevance and translatability for\nresearchers, and ultimately increase and accelerate the impact of scientific\nknowledge used for policy decisions.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"27O73wWCYiqv2_Oq8ezlIT-GO40B_4ME6uTcs-t8Eug","pdfSize":"6671224"}