{"id":"2407.12176","title":"GPT-4V Cannot Generate Radiology Reports Yet","authors":"Yuyang Jiang, Chacha Chen, Dang Nguyen, Benjamin M. Mervak and Chenhao\n  Tan","authorsParsed":[["Jiang","Yuyang",""],["Chen","Chacha",""],["Nguyen","Dang",""],["Mervak","Benjamin M.",""],["Tan","Chenhao",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 21:03:14 GMT"}],"updateDate":"2024-07-18","timestamp":1721163794000,"abstract":"  GPT-4V's purported strong multimodal abilities raise interests in using it to\nautomate radiology report writing, but there lacks thorough evaluations. In\nthis work, we perform a systematic evaluation of GPT-4V in generating radiology\nreports on two chest X-ray report datasets: MIMIC-CXR and IU X-Ray. We attempt\nto directly generate reports using GPT-4V through different prompting\nstrategies and find that it fails terribly in both lexical metrics and clinical\nefficacy metrics. To understand the low performance, we decompose the task into\ntwo steps: 1) the medical image reasoning step of predicting medical condition\nlabels from images; and 2) the report synthesis step of generating reports from\n(groundtruth) conditions. We show that GPT-4V's performance in image reasoning\nis consistently low across different prompts. In fact, the distributions of\nmodel-predicted labels remain constant regardless of which groundtruth\nconditions are present on the image, suggesting that the model is not\ninterpreting chest X-rays meaningfully. Even when given groundtruth conditions\nin report synthesis, its generated reports are less correct and less\nnatural-sounding than a finetuned LLaMA-2. Altogether, our findings cast doubt\non the viability of using GPT-4V in a radiology workflow.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"xWwfeV5jkvNvzv-_G6t5fGj1YHV1utm4Fo0v0Ms8Xgw","pdfSize":"697456"}