{"id":"2407.18291","title":"The X-ray Luminous Type Ibn SN 2022ablq: Estimates of Pre-explosion Mass\n  Loss and Constraints on Precursor Emission","authors":"C. Pellegrino, M. Modjaz, Y. Takei, D. Tsuna, M. Newsome, T.\n  Pritchard, R. Baer-Way, K. A. Bostroem, P. Chandra, P. Charalampopoulos, Y.\n  Dong, J. Farah, D. A. Howell, C. McCully, S. Mohamed, E. Padilla Gonzalez, G.\n  Terreran","authorsParsed":[["Pellegrino","C.",""],["Modjaz","M.",""],["Takei","Y.",""],["Tsuna","D.",""],["Newsome","M.",""],["Pritchard","T.",""],["Baer-Way","R.",""],["Bostroem","K. A.",""],["Chandra","P.",""],["Charalampopoulos","P.",""],["Dong","Y.",""],["Farah","J.",""],["Howell","D. A.",""],["McCully","C.",""],["Mohamed","S.",""],["Gonzalez","E. Padilla",""],["Terreran","G.",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 18:00:00 GMT"}],"updateDate":"2024-07-29","timestamp":1721930400000,"abstract":"  Type Ibn supernovae (SNe Ibn) are rare stellar explosions powered primarily\nby interaction between the SN ejecta and H-poor, He-rich material lost by their\nprogenitor stars. Multi-wavelength observations, particularly in the X-rays, of\nSNe Ibn constrain their poorly-understood progenitor channels and mass-loss\nmechanisms. Here we present Swift X-ray, ultraviolet, and ground-based optical\nobservations of the Type Ibn SN 2022ablq -- only the second SN Ibn with X-ray\ndetections to date. While similar to the prototypical Type Ibn SN 2006jc in the\noptical, SN 2022ablq is roughly an order of magnitude more luminous in the\nX-rays, reaching unabsorbed luminosities $L_X$ $\\sim$ 3$\\times$10$^{40}$ erg\ns$^{-1}$ between 0.2 - 10 keV. From these X-ray observations we infer\ntime-varying mass-loss rates between 0.05 - 0.5 $M_\\odot$ yr$^{-1}$ peaking 0.5\n- 2 yr before explosion. This complex mass-loss history and circumstellar\nenvironment disfavor steady-state winds as the primary progenitor mass-loss\nmechanism. We also search for precursor emission from alternative mass-loss\nmechanisms, such as eruptive outbursts, in forced photometry during the two\nyears before explosion. We find no statistically significant detections\nbrighter than M $\\approx$ -14 -- too shallow to rule out precursor events\nsimilar to those observed for other SNe Ibn. Finally, numerical models of the\nexplosion of a $\\sim$15 $M_\\odot$ helium star that undergoes an eruptive\noutburst $\\approx$1.8 years before explosion are consistent with the observed\nbolometric light curve. We conclude that our observations disfavor a Wolf-Rayet\nstar progenitor losing He-rich material via stellar winds and instead favor\nlower-mass progenitor models, including Roche-lobe overflow in helium stars\nwith compact binary companions or stars that undergo eruptive outbursts during\nlate-stage nucleosynthesis stages.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"jjeSyeC4kquWEP_Vaw4Qm26l8SQd1IGzv-1Rhr_1b80","pdfSize":"1685328"}