{"id":"2407.20383","title":"Appraisal-Guided Proximal Policy Optimization: Modeling Psychological\n  Disorders in Dynamic Grid World","authors":"Hari Prasad, Chinnu Jacob and Imthias Ahamed T. P","authorsParsed":[["Prasad","Hari",""],["Jacob","Chinnu",""],["P","Imthias Ahamed T.",""]],"versions":[{"version":"v1","created":"Mon, 29 Jul 2024 19:19:54 GMT"}],"updateDate":"2024-07-31","timestamp":1722280794000,"abstract":"  The integration of artificial intelligence across multiple domains has\nemphasized the importance of replicating human-like cognitive processes in AI.\nBy incorporating emotional intelligence into AI agents, their emotional\nstability can be evaluated to enhance their resilience and dependability in\ncritical decision-making tasks. In this work, we develop a methodology for\nmodeling psychological disorders using Reinforcement Learning (RL) agents. We\nutilized Appraisal theory to train RL agents in a dynamic grid world\nenvironment with an Appraisal-Guided Proximal Policy Optimization (AG-PPO)\nalgorithm. Additionally, we investigated numerous reward-shaping strategies to\nsimulate psychological disorders and regulate the behavior of the agents. A\ncomparison of various configurations of the modified PPO algorithm identified\nvariants that simulate Anxiety disorder and Obsessive-Compulsive Disorder\n(OCD)-like behavior in agents. Furthermore, we compared standard PPO with\nAG-PPO and its configurations, highlighting the performance improvement in\nterms of generalization capabilities. Finally, we conducted an analysis of the\nagents' behavioral patterns in complex test environments to evaluate the\nassociated symptoms corresponding to the psychological disorders. Overall, our\nwork showcases the benefits of the appraisal-guided PPO algorithm over the\nstandard PPO algorithm and the potential to simulate psychological disorders in\na controlled artificial environment and evaluate them on RL agents.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"jf_IUD3c9uj59gUUun7cvcJi0Q8k6wWGTh-xCcRw8HU","pdfSize":"3423021"}