{"id":"2407.02933","title":"Online Time-Informed Kinodynamic Motion Planning of Nonlinear Systems","authors":"Fei Meng, Jianbang Liu, Haojie Shi, Han Ma, Hongliang Ren, and Max\n  Q.-H. Meng","authorsParsed":[["Meng","Fei",""],["Liu","Jianbang",""],["Shi","Haojie",""],["Ma","Han",""],["Ren","Hongliang",""],["Meng","Max Q. -H.",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 09:05:59 GMT"}],"updateDate":"2024-07-04","timestamp":1719997559000,"abstract":"  Sampling-based kinodynamic motion planners (SKMPs) are powerful in finding\ncollision-free trajectories for high-dimensional systems under differential\nconstraints. Time-informed set (TIS) can provide the heuristic search domain to\naccelerate their convergence to the time-optimal solution. However, existing\nTIS approximation methods suffer from the curse of dimensionality,\ncomputational burden, and limited system applicable scope, e.g., linear and\npolynomial nonlinear systems. To overcome these problems, we propose a method\nby leveraging deep learning technology, Koopman operator theory, and random set\ntheory. Specifically, we propose a Deep Invertible Koopman operator with\ncontrol U model named DIKU to predict states forward and backward over a long\nhorizon by modifying the auxiliary network with an invertible neural network. A\nsampling-based approach, ASKU, performing reachability analysis for the DIKU is\ndeveloped to approximate the TIS of nonlinear control systems online.\nFurthermore, we design an online time-informed SKMP using a direct sampling\ntechnique to draw uniform random samples in the TIS. Simulation experiment\nresults demonstrate that our method outperforms other existing works,\napproximating TIS in near real-time and achieving superior planning performance\nin several time-optimal kinodynamic motion planning problems.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"zFvP3VLMl1wu-0bBHt_hzaPMmbZEfH8SdZo6enRBswg","pdfSize":"3753724"}