{"id":"2407.13976","title":"PlacidDreamer: Advancing Harmony in Text-to-3D Generation","authors":"Shuo Huang, Shikun Sun, Zixuan Wang, Xiaoyu Qin, Yanmin Xiong, Yuan\n  Zhang, Pengfei Wan, Di Zhang, Jia Jia","authorsParsed":[["Huang","Shuo",""],["Sun","Shikun",""],["Wang","Zixuan",""],["Qin","Xiaoyu",""],["Xiong","Yanmin",""],["Zhang","Yuan",""],["Wan","Pengfei",""],["Zhang","Di",""],["Jia","Jia",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 02:00:04 GMT"}],"updateDate":"2024-07-22","timestamp":1721354404000,"abstract":"  Recently, text-to-3D generation has attracted significant attention,\nresulting in notable performance enhancements. Previous methods utilize\nend-to-end 3D generation models to initialize 3D Gaussians, multi-view\ndiffusion models to enforce multi-view consistency, and text-to-image diffusion\nmodels to refine details with score distillation algorithms. However, these\nmethods exhibit two limitations. Firstly, they encounter conflicts in\ngeneration directions since different models aim to produce diverse 3D assets.\nSecondly, the issue of over-saturation in score distillation has not been\nthoroughly investigated and solved. To address these limitations, we propose\nPlacidDreamer, a text-to-3D framework that harmonizes initialization,\nmulti-view generation, and text-conditioned generation with a single multi-view\ndiffusion model, while simultaneously employing a novel score distillation\nalgorithm to achieve balanced saturation. To unify the generation direction, we\nintroduce the Latent-Plane module, a training-friendly plug-in extension that\nenables multi-view diffusion models to provide fast geometry reconstruction for\ninitialization and enhanced multi-view images to personalize the text-to-image\ndiffusion model. To address the over-saturation problem, we propose to view\nscore distillation as a multi-objective optimization problem and introduce the\nBalanced Score Distillation algorithm, which offers a Pareto Optimal solution\nthat achieves both rich details and balanced saturation. Extensive experiments\nvalidate the outstanding capabilities of our PlacidDreamer. The code is\navailable at \\url{https://github.com/HansenHuang0823/PlacidDreamer}.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"IGoxtsP7PFJNvoPZc11e1TnDUNvq85msV0q7fOunSuA","pdfSize":"6613726"}