{"id":"2407.08145","title":"A Comprehensive Study of Disaster Support Mobile Apps","authors":"Muhamad Syukron, Anuradha Madugalla, Mojtaba Shahin, John Grundy","authorsParsed":[["Syukron","Muhamad",""],["Madugalla","Anuradha",""],["Shahin","Mojtaba",""],["Grundy","John",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 02:58:12 GMT"}],"updateDate":"2024-07-12","timestamp":1720666692000,"abstract":"  Context: Disasters are a common global occurrence with climate change leading\nto increase both their frequency and intensity. To reduce the impact of these\ndisasters on lives and livelihoods it is important to provide accurate warnings\nand information about recovery and mitigation. Today most emergency management\nagencies deliver this information via mobile apps.\n  Objective: There is a large collection of disaster mobile apps available\nacross the globe. But a detailed study is not yet conducted on these apps and\ntheir reviews to understand their key features and user feedback. In this paper\nwe present a comprehensive analysis to address this research gap.\n  Method: We conducted a detailed analysis of 45 disaster apps and 28,161\nreviews on these apps. We manually analysed the features of these 45 apps and\nfor review analysis employed topic modelling and sentiment analysis techniques.\n  Results: We identified 13 key features in these apps and categorised them in\nto the 4 stages of disaster life cycle. Our analysis revealed 22 topics with\nhighest discussions being on apps alert functionality, app satisfaction and use\nof maps. Sentiment analysis of reviews showed that while 22\\% of users provided\npositive feedback, 9.5\\% were negative and 6.8\\% were neutral. It also showed\nthat signup/signin issues, network issues and app configuration issues were the\nmost frustrating to users. These impacted user safety as these prevented them\nfrom accessing the app when it mattered most.\n  Conclusions: We provide a set of practical recommendations for future\ndisaster app developers. Our findings will help emergency agencies develop\nbetter disaster apps by ensuring key features are supported in their apps, by\nunderstanding commonly discussed user issues. This will help to improve the\ndisaster app eco-system and lead to more user friendly and supportive disaster\nsupport apps in the future.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"1CpeC2F8cSu6D36lbvSTJsAWAMvQEKSXCv9bMbtzL00","pdfSize":"6312580"}