{"id":"2407.17552","title":"Preliminary Evidence for Lensing-Induced Alignments of High-Redshift\n  Galaxies in JWST-CEERS","authors":"Viraj Pandya, Abraham Loeb, Elizabeth J. McGrath, Guillermo Barro,\n  Steven L. Finkelstein, Henry C. Ferguson, Norman A. Grogin, Jeyhan S.\n  Kartaltepe, Anton M. Koekemoer, Casey Papovich, Nor Pirzkal, L. Y. Aaron Yung","authorsParsed":[["Pandya","Viraj",""],["Loeb","Abraham",""],["McGrath","Elizabeth J.",""],["Barro","Guillermo",""],["Finkelstein","Steven L.",""],["Ferguson","Henry C.",""],["Grogin","Norman A.",""],["Kartaltepe","Jeyhan S.",""],["Koekemoer","Anton M.",""],["Papovich","Casey",""],["Pirzkal","Nor",""],["Yung","L. Y. Aaron",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 18:00:01 GMT"}],"updateDate":"2024-07-26","timestamp":1721844001000,"abstract":"  The majority of low-mass ($\\log_{10} M_*/M_{\\odot}=9-10$) galaxies at high\nredshift ($z>1$) appear elongated in projection. We use JWST-CEERS observations\nto explore the role of gravitational lensing in this puzzle. The typical\ngalaxy-galaxy lensing shear $\\gamma\\sim1\\%$ is too low to explain the\npredominance of elongated early galaxies with ellipticity $e\\approx0.6$.\nHowever, non-parametric quantile regression with Bayesian Additive Regression\nTrees reveals hints of an excess of tangentially-aligned source-lens pairs with\n$\\gamma>10\\%$. On larger scales, we also find evidence for weak lensing shear.\nWe rule out the null hypothesis of randomly oriented galaxies at $\\gtrsim99\\%$\nsignificance in multiple NIRCam chips, modules and pointings. The number of\nsuch regions is small and attributable to chance, but coherent alignment\npatterns suggest otherwise. On the chip scale, the average complex ellipticity\n$\\langle e\\rangle\\sim10\\%$ is non-negligible and beyond the level of our PSF\nuncertainties. The shear variance\n$\\langle\\overline{\\gamma}^2\\rangle\\sim10^{-3}$ is an order of magnitude above\nthe conventional weak lensing regime but is more sensitive to PSF systematics,\nintrinsic alignments, cosmic variance and other biases. Taking it as an upper\nlimit, the maximum implied ``cosmic shear'' is only a few percent and cannot\nexplain the elongated shapes of early galaxies. The alignments themselves may\narise from lensing by a protocluster or filament at $z\\sim0.75$ where we find\nan overabundance of massive lens galaxies. We recommend a weak lensing search\nfor overdensities in ``blank'' deep fields with JWST and the Roman Space\nTelescope.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"pzlZYUDbH3zD-_F64B56H0Mwsmy51ltCakIlbi4GOnw","pdfSize":"14058396"}