{"id":"2407.09690","title":"Private Heterogeneous Federated Learning Without a Trusted Server\n  Revisited: Error-Optimal and Communication-Efficient Algorithms for Convex\n  Losses","authors":"Changyu Gao, Andrew Lowy, Xingyu Zhou, Stephen J. Wright","authorsParsed":[["Gao","Changyu",""],["Lowy","Andrew",""],["Zhou","Xingyu",""],["Wright","Stephen J.",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 21:20:44 GMT"},{"version":"v2","created":"Wed, 17 Jul 2024 23:25:57 GMT"},{"version":"v3","created":"Fri, 6 Sep 2024 16:29:25 GMT"}],"updateDate":"2024-09-10","timestamp":1720819244000,"abstract":"  We revisit the problem of federated learning (FL) with private data from\npeople who do not trust the server or other silos/clients. In this context,\nevery silo (e.g. hospital) has data from several people (e.g. patients) and\nneeds to protect the privacy of each person's data (e.g. health records), even\nif the server and/or other silos try to uncover this data. Inter-Silo\nRecord-Level Differential Privacy (ISRL-DP) prevents each silo's data from\nbeing leaked, by requiring that silo i's communications satisfy item-level\ndifferential privacy. Prior work arXiv:2106.09779 characterized the optimal\nexcess risk bounds for ISRL-DP algorithms with homogeneous (i.i.d.) silo data\nand convex loss functions. However, two important questions were left open: (1)\nCan the same excess risk bounds be achieved with heterogeneous (non-i.i.d.)\nsilo data? (2) Can the optimal risk bounds be achieved with fewer communication\nrounds? In this paper, we give positive answers to both questions. We provide\nnovel ISRL-DP FL algorithms that achieve the optimal excess risk bounds in the\npresence of heterogeneous silo data. Moreover, our algorithms are more\ncommunication-efficient than the prior state-of-the-art. For smooth loss\nfunctions, our algorithm achieves the optimal excess risk bound and has\ncommunication complexity that matches the non-private lower bound.\nAdditionally, our algorithms are more computationally efficient than the\nprevious state-of-the-art.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Cryptography and Security","Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"o_2rFpjpcODpkvd9RPY93dq0BBJkgYggtjILz0nUqQY","pdfSize":"1896114","objectId":"0x113779f966e1b8faec6160ed26653be3bf50f3b6bca0801204c5ba2dfb939fdc","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
