{"id":"2407.04174","title":"Gemini: Integrating Full-fledged Sensing upon Millimeter Wave\n  Communications","authors":"Yilong Li and Zhe Chen and Jun Luo and Suman Banerjee","authorsParsed":[["Li","Yilong",""],["Chen","Zhe",""],["Luo","Jun",""],["Banerjee","Suman",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 22:22:16 GMT"},{"version":"v2","created":"Sat, 27 Jul 2024 09:29:04 GMT"},{"version":"v3","created":"Wed, 11 Sep 2024 23:23:45 GMT"}],"updateDate":"2024-09-13","timestamp":1720131736000,"abstract":"  Integrating millimeter wave (mmWave)technology in both communication and\nsensing is promising as it enables the reuse of existing spectrum and\ninfrastructure without draining resources. Most existing systems piggyback\nsensing onto conventional communication modes without fully exploiting the\npotential of integrated sensing and communication (ISAC) in mmWave radios (not\nfull-fledged). In this paper, we design and implement a full-fledged mmWave\nISAC system Gemini; it delivers raw channel states to serve a broad category of\nsensing applications. We first propose the mmWave self-interference\ncancellation approach to extract the weak reflected signals for near-field\nsensing purposes. Then, we develop a joint optimization scheduling framework\nthat can be utilized in accurate radar sensing while maximizing the\ncommunication throughput. Finally, we design a united fusion sensing algorithm\nto offer a better sensing performance via combining monostatic and bistatic\nmodes. We evaluate our system in extensive experiments to demonstrate Gemini's\ncapability of simultaneously operating sensing and communication, enabling\nmmWave ISAC to perform better than the commercial off-the-shelf mmWave radar\nfor 5G cellular networks.\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"azihQXV8Xu4pE4VqAmiud7lUo22HYU6ZtRpijf1v8ts","pdfSize":"19460010"}