{"id":"2407.05386","title":"A Multiparty Quantum Private Equality Comparison scheme relying on\n  $\\ket{ GHZ_{ 3 } }$ states","authors":"Theodore Andronikos and Alla Sirokofskich","authorsParsed":[["Andronikos","Theodore",""],["Sirokofskich","Alla",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 14:21:22 GMT"}],"updateDate":"2024-07-09","timestamp":1720362082000,"abstract":"  This paper introduces an innovative entanglement-based protocol that\naccomplishes multiparty quantum private comparison leveraging maximally\nentangled GHZ3 triplets. The primary motivation is the design of a protocol\nthat can be executed by contemporary quantum computers. This is made possible\nbecause the protocol uses only GHZ3 triplets, irrespective of the number of\nmillionaires. While more complex multi-particle entangled states are possible,\nthey are challenging to produce with existing quantum apparatus, leading to\nextended preparation time and complexity, particularly in scenarios involving\nnumerous participants. By relying on GHZ3 states, which are the easiest to\nproduce after Bell states, we avoid these drawbacks, and take a step towards\nthe practical implementation of the protocol. An important quantitative\ncharacteristic of this protocol is that the required quantum resources are\nlinear both in the number of millionaires and the volume of information to be\ncompared. A notable aspect of the protocol is its suitability for both parallel\nand sequential execution. Although the execution of the quantum part of the\nprotocol is envisioned to take place completely in parallel, it is also\npossible to be implemented sequentially. So, if the quantum resources do not\nsuffice for the execution of the protocol in one go, it is possible to\npartition the millionaires into smaller groups and process these groups\nsequentially. Notably, our protocol involves two third parties; Trent is now\naccompanied by Sophia. This dual setup allows simultaneous processing of all n\nmillionaires' fortunes. Implementation-wise, uniformity is ensured as all\nmillionaires use similar private quantum circuits composed of Hadamard and CNOT\ngates. Lastly, the protocol is information-theoretically secure, preventing\noutside parties from learning about fortunes or inside players from knowing\neach other's secret numbers.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"1GwpficEvtKUkfIsCKMXt47DCZ-AE5y5xxGeQsoDAkM","pdfSize":"728896"}