{"id":"2407.01517","title":"Centerline Boundary Dice Loss for Vascular Segmentation","authors":"Pengcheng Shi, Jiesi Hu, Yanwu Yang, Zilve Gao, Wei Liu, Ting Ma","authorsParsed":[["Shi","Pengcheng",""],["Hu","Jiesi",""],["Yang","Yanwu",""],["Gao","Zilve",""],["Liu","Wei",""],["Ma","Ting",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 17:58:44 GMT"}],"updateDate":"2024-07-02","timestamp":1719856724000,"abstract":"  Vascular segmentation in medical imaging plays a crucial role in analysing\nmorphological and functional assessments. Traditional methods, like the\ncenterline Dice (clDice) loss, ensure topology preservation but falter in\ncapturing geometric details, especially under translation and deformation. The\ncombination of clDice with traditional Dice loss can lead to diameter\nimbalance, favoring larger vessels. Addressing these challenges, we introduce\nthe centerline boundary Dice (cbDice) loss function, which harmonizes\ntopological integrity and geometric nuances, ensuring consistent segmentation\nacross various vessel sizes. cbDice enriches the clDice approach by including\nboundary-aware aspects, thereby improving geometric detail recognition. It\nmatches the performance of the boundary difference over union (B-DoU) loss\nthrough a mask-distance-based approach, enhancing traslation sensitivity.\nCrucially, cbDice incorporates radius information from vascular skeletons,\nenabling uniform adaptation to vascular diameter changes and maintaining\nbalance in branch growth and fracture impacts. Furthermore, we conducted a\ntheoretical analysis of clDice variants (cl-X-Dice). We validated cbDice's\nefficacy on three diverse vascular segmentation datasets, encompassing both 2D\nand 3D, and binary and multi-class segmentation. Particularly, the method\nintegrated with cbDice demonstrated outstanding performance on the MICCAI 2023\nTopCoW Challenge dataset. Our code is made publicly available at:\nhttps://github.com/PengchengShi1220/cbDice.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"hgLdzju5iFUUCR_20MIJlUriFFWVfiBm0eAr1QAr7Rs","pdfSize":"2688803"}