{"id":"2407.17211","title":"Testing Large Language Models on Driving Theory Knowledge and Skills for\n  Connected Autonomous Vehicles","authors":"Zuoyin Tang, Jianhua He, Dashuai Pei, Kezhong Liu and Tao Gao","authorsParsed":[["Tang","Zuoyin",""],["He","Jianhua",""],["Pei","Dashuai",""],["Liu","Kezhong",""],["Gao","Tao",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 12:10:20 GMT"}],"updateDate":"2024-07-25","timestamp":1721823020000,"abstract":"  Handling long tail corner cases is a major challenge faced by autonomous\nvehicles (AVs). While large language models (LLMs) hold great potentials to\nhandle the corner cases with excellent generalization and explanation\ncapabilities and received increasing research interest on application to\nautonomous driving, there are still technical barriers to be tackled, such as\nstrict model performance and huge computing resource requirements of LLMs. In\nthis paper, we investigate a new approach of applying remote or edge LLMs to\nsupport autonomous driving. A key issue for such LLM assisted driving system is\nthe assessment of LLMs on their understanding of driving theory and skills,\nensuring they are qualified to undertake safety critical driving assistance\ntasks for CAVs. We design and run driving theory tests for several proprietary\nLLM models (OpenAI GPT models, Baidu Ernie and Ali QWen) and open-source LLM\nmodels (Tsinghua MiniCPM-2B and MiniCPM-Llama3-V2.5) with more than 500\nmultiple-choices theory test questions. Model accuracy, cost and processing\nlatency are measured from the experiments. Experiment results show that while\nmodel GPT-4 passes the test with improved domain knowledge and Ernie has an\naccuracy of 85% (just below the 86% passing threshold), other LLM models\nincluding GPT-3.5 fail the test. For the test questions with images, the\nmultimodal model GPT4-o has an excellent accuracy result of 96%, and the\nMiniCPM-Llama3-V2.5 achieves an accuracy of 76%. While GPT-4 holds stronger\npotential for CAV driving assistance applications, the cost of using model GPT4\nis much higher, almost 50 times of that of using GPT3.5. The results can help\nmake decision on the use of the existing LLMs for CAV applications and\nbalancing on the model performance and cost.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Networking and Internet Architecture","Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"ymNGayKra5PEmBPMTrVZ1vZvidDr9_w1U7aUiFc_F2s","pdfSize":"1164524"}