{"id":"2407.10630","title":"Brain Tumor Classification From MRI Images Using Machine Learning","authors":"Vidhyapriya Ranganathan, Celshiya Udaiyar, Jaisree Jayanth, Meghaa P\n  V, Srija B, Uthra S","authorsParsed":[["Ranganathan","Vidhyapriya",""],["Udaiyar","Celshiya",""],["Jayanth","Jaisree",""],["P","Meghaa","V"],["B","Srija",""],["S","Uthra",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 11:30:40 GMT"}],"updateDate":"2024-07-16","timestamp":1721043040000,"abstract":"  Brain tumor is a life-threatening problem and hampers the normal functioning\nof the human body. The average five-year relative survival rate for malignant\nbrain tumors is 35.6 percent. For proper diagnosis and efficient treatment\nplanning, it is necessary to detect the brain tumor in early stages. Due to\nadvancement in medical imaging technology, the brain images are taken in\ndifferent modalities. The ability to extract relevant characteristics from\nmagnetic resonance imaging (MRI) scans is a crucial step for brain tumor\nclassifiers. Several studies have proposed various strategies to extract\nrelevant features from different modalities of MRI to predict the growth of\nabnormal tumors. Most techniques used conventional methods of image processing\nfor feature extraction and machine learning for classification. More recently,\nthe use of deep learning algorithms in medical imaging has resulted in\nsignificant improvements in the classification and diagnosis of brain tumors.\nSince tumors are located at different regions of the brain, localizing the\ntumor and classifying it to a particular category is a challenging task. The\nobjective of this project is to develop a predictive system for brain tumor\ndetection using machine learning(ensembling).\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"lpQma80hwuHqxbhKBwjdS_QSk02xRFsdQgWgKW5gGws","pdfSize":"3535260"}