{"id":"2407.18598","title":"Disentangling thermal birefringence and strain in the all-optical\n  switching of ferroelectric polarization","authors":"Maarten Kwaaitaal, Daniel G. Lourens, Carl S. Davies, and Andrei\n  Kirilyuk","authorsParsed":[["Kwaaitaal","Maarten",""],["Lourens","Daniel G.",""],["Davies","Carl S.",""],["Kirilyuk","Andrei",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 08:39:48 GMT"}],"updateDate":"2024-07-29","timestamp":1721983188000,"abstract":"  Recent works have demonstrated that the optical excitation of crystalline\nmaterials with intense narrow-band infrared pulses, tailored to match the\nfrequencies at which the crystal's permittivity approaches close to zero, can\ndrive a permanent reversal of magnetic and ferroelectric ordering. However, the\nphysical mechanism that microscopically underpins this effect remains unclear,\nas well as the precise role of laser-induced heating and macroscopic strains.\nHere, we explore how infrared pulses can simultaneously give rise to strong\ntemperature-dependent birefringence and strain in ferroelectric barium\ntitanate. We develop a model of these two coexisting effects, allowing us to\nuse polarization microscopy to disentangle them through their spatial\ndistributions, temporal evolutions and spectral dependencies. We experimentally\nobserve strain-induced patterns that are an order of magnitude larger than that\nwhich can be accounted for by laser-induced heating alone, suggesting that\nnon-thermal effects must also play a role. Our results reveal the distinct\nfingerprints of heat- and strain-induced birefringence, shedding new light on\nthe process of all-optical switching of order parameters in the\nepsilon-near-zero regime.\n","subjects":["Condensed Matter/Materials Science","Physics/Optics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"QP0yoXWQNHo1XLTfyGmymFQprV03MQNac8w7CP9_z_w","pdfSize":"1336486","objectId":"0x38e0667648d0526f53d295fd9957c202fb379548d46b1adf5c58b861963e2d78","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
