{"id":"2407.06706","title":"Exploring Unstructured Environments using Minimal Sensing on Cooperative\n  Nano-Drones","authors":"Pedro Arias-Perez, Alvika Gautam, Miguel Fernandez-Cortizas, David\n  Perez-Saura, Srikanth Saripalli and Pascual Campoy","authorsParsed":[["Arias-Perez","Pedro",""],["Gautam","Alvika",""],["Fernandez-Cortizas","Miguel",""],["Perez-Saura","David",""],["Saripalli","Srikanth",""],["Campoy","Pascual",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 09:33:04 GMT"}],"updateDate":"2024-07-10","timestamp":1720517584000,"abstract":"  Recent advances have improved autonomous navigation and mapping under payload\nconstraints, but current multi-robot inspection algorithms are unsuitable for\nnano-drones due to their need for heavy sensors and high computational\nresources. To address these challenges, we introduce ExploreBug, a novel hybrid\nfrontier range bug algorithm designed to handle limited sensing capabilities\nfor a swarm of nano-drones. This system includes three primary components: a\nmapping subsystem, an exploration subsystem, and a navigation subsystem.\nAdditionally, an intra-swarm collision avoidance system is integrated to\nprevent collisions between drones. We validate the efficacy of our approach\nthrough extensive simulations and real-world exploration experiments involving\nup to seven drones in simulations and three in real-world settings, across\nvarious obstacle configurations and with a maximum navigation speed of 0.75\nm/s. Our tests demonstrate that the algorithm efficiently completes exploration\ntasks, even with minimal sensing, across different swarm sizes and obstacle\ndensities. Furthermore, our frontier allocation heuristic ensures an equal\ndistribution of explored areas and paths traveled by each drone in the swarm.\nWe publicly release the source code of the proposed system to foster further\ndevelopments in mapping and exploration using autonomous nano drones.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"OY-omASIHmlADGSXSJxUi85wyB2UBbMOSIyHTs872a4","pdfSize":"5220000"}