{"id":"2407.01935","title":"Power Domination and Resolving Power Domination of Fractal Cubic Network","authors":"S. Prabhu, A.K. Arulmozhi, Michael A. Henning, M. Arulperumjothi","authorsParsed":[["Prabhu","S.",""],["Arulmozhi","A. K.",""],["Henning","Michael A.",""],["Arulperumjothi","M.",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 04:10:02 GMT"}],"updateDate":"2024-07-03","timestamp":1719893402000,"abstract":"  In network theory, the domination parameter is vital in investigating several\nstructural features of the networks, including connectedness, their tendency to\nform clusters, compactness, and symmetry. In this context, various domination\nparameters have been created using several properties to determine where\nmachines should be placed to ensure that all the places are monitored. To\nensure efficient and effective operation, a piece of equipment must monitor\ntheir network (power networks) to answer whenever there is a change in the\ndemand and availability conditions. Consequently, phasor measurement units\n(PMUs) are utilised by numerous electrical companies to monitor their networks\nperpetually. Overseeing an electrical system which consists of minimum PMUs is\nthe same as the vertex covering the problem of graph theory, in which a subset\nD of a vertex set V is a power dominating set (PDS) if it monitors generators,\ncables, and all other components, in the electrical system using a few\nguidelines. Hypercube is one of the versatile, most popular, adaptable, and\nconvertible interconnection networks. Its appealing qualities led to the\ndevelopment of other hypercube variants. A fractal cubic network is a new\nvariant of the hypercube that can be used as a best substitute in case faults\noccur in the hypercube, which was wrongly defined in [Eng. Sci. Technol. 18(1)\n(2015) 32-41]. Arulperumjothi et al. have recently corrected this definition\nand redefined this variant with the exact definition in [Appl. Math. Comput.\n452 (2023) 128037]. This article determines the PDS of the fractal cubic\nnetwork. Further, we investigate the resolving power dominating set (RPDS),\nwhich contrasts starkly with hypercubes, where resolving power domination is\ninherently challenging.\n","subjects":["Mathematics/Combinatorics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"4XPuK1iMYkEggR235ZNhLhDN-r-PLcYwpAYiJvn90jo","pdfSize":"216012"}