{"id":"2407.17591","title":"Unified Prediction Model for Employability in Indian Higher Education\n  System","authors":"Pooja Thakar, Anil Mehta, Manisha","authorsParsed":[["Thakar","Pooja",""],["Mehta","Anil",""],["Manisha","",""]],"versions":[{"version":"v1","created":"Wed, 5 Jun 2024 06:23:15 GMT"}],"updateDate":"2024-07-26","timestamp":1717568595000,"abstract":"  Educational Data Mining has become extremely popular among researchers in\nlast decade. Prior effort in this area was only directed towards prediction of\nacademic performance of a student. Very less number of researches are directed\ntowards predicting employability of a student i.e. prediction of students\nperformance in campus placements at an early stage of enrollment. Furthermore,\nexisting researches on students employability prediction are not universal in\napproach and is either based upon only one type of course or\nUniversity/Institute. Henceforth, is not scalable from one context to another.\nWith the necessity of unification, data of professional technical courses\nnamely Bachelor in Engineering/Technology and Masters in Computer Applications\nstudents have been collected from 17 states of India. To deal with such a data,\na unified predictive model has been developed and applied on 17 states\ndatasets. The research done in this paper proves that model has universal\napplication and can be applied to various states and institutes pan India with\ndifferent cultural background and course structure. This paper also explores\nand proves statistically that there is no significant difference in Indian\nEducation System with respect to states as far as prediction of employability\nof students is concerned. Model provides a generalized solution for student\nemployability prediction in Indian Scenario.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"nhm3h20cH12O5jeuIqUPdg7-wSplPHDCSC-AB8TN-sw","pdfSize":"2537927"}