{"id":"2407.01587","title":"The single-photon steering and the quantum mechanical free-interaction\n  measurement are identical phenomena","authors":"LM Ar\\'evalo Aguilar and Rolando Vel\\'azquez Garc\\'ia","authorsParsed":[["Aguilar","LM Arévalo",""],["García","Rolando Velázquez",""]],"versions":[{"version":"v1","created":"Fri, 21 Jun 2024 12:01:18 GMT"}],"updateDate":"2024-07-03","timestamp":1718971278000,"abstract":"  In this work, firstly, we propose how to experimentally demonstrate the\nsingle photon steering phenomenon in a simple way. The quantum steering\nphenomenon was discovered by Erwin Schrodinger, who reason that the laws of\nquantum mechanics obliges us to admit that by suitable measurements taken on\none of two entangled system, then the state of the other system can be\ndetermined and steered. On the other hand, the first proposal about the\nnonlocal property of a single photon focus on showing the Bell nonlocality by\nusing the single-photon path entanglement. Here, we propose a new experimental\nscheme that, by incorporating and manipulating the internal degree of freedom\n(IDF) of the photon, easily demonstrate the nonlocal steering phenomenon of\nsingle-photon's states. The experimental set-up that we propose differs from\nthose published in the quantum optics' literature to shown the single photon\nnonlocality, which generally use the path entanglement of photons and homodyne\nmeasurements. Secondly, by incorporating its IDF, we show that the single\nphoton steering and the quantum mechanical interaction-free measurement\n(QM-IFM) are identical phenomena; we will argue that QM-IFM is just a\nparticular instance of the single-photon steering. In short, both the single\nphoton steering and QM-IFM (being identical phenomena) have a common cause: the\nnonlocality of the wave function. In conclusion, we have demonstrated that it\nis possible to produce a nonlocal phenomena by manipulating the single photon\ninternal degree of freedom. On the other hand, this unification between\nsteering and QM-IFM could establish a strong support to counterfactual quantum\ncommunication and computation.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"1pWmV3tJTTixGAw_-AkrSGobZB0hvOMvQmigFpt4E30","pdfSize":"1327326","objectId":"0x26e6fd3b914614d226d16364018b020b390a9325617d40e4a4309e7acd7710b8","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
