{"id":"2407.12239","title":"Motion and Structure from Event-based Normal Flow","authors":"Zhongyang Ren and Bangyan Liao and Delei Kong and Jinghang Li and\n  Peidong Liu and Laurent Kneip and Guillermo Gallego and Yi Zhou","authorsParsed":[["Ren","Zhongyang",""],["Liao","Bangyan",""],["Kong","Delei",""],["Li","Jinghang",""],["Liu","Peidong",""],["Kneip","Laurent",""],["Gallego","Guillermo",""],["Zhou","Yi",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 01:11:20 GMT"},{"version":"v2","created":"Fri, 19 Jul 2024 11:13:16 GMT"}],"updateDate":"2024-07-22","timestamp":1721178680000,"abstract":"  Recovering the camera motion and scene geometry from visual data is a\nfundamental problem in the field of computer vision. Its success in standard\nvision is attributed to the maturity of feature extraction, data association\nand multi-view geometry. The recent emergence of neuromorphic event-based\ncameras places great demands on approaches that use raw event data as input to\nsolve this fundamental problem.Existing state-of-the-art solutions typically\ninfer implicitly data association by iteratively reversing the event data\ngeneration process. However, the nonlinear nature of these methods limits their\napplicability in real-time tasks, and the constant-motion assumption leads to\nunstable results under agile motion. To this end, we rethink the problem\nformulation in a way that aligns better with the differential working principle\nof event cameras.We show that the event-based normal flow can be used, via the\nproposed geometric error term, as an alternative to the full flow in solving a\nfamily of geometric problems that involve instantaneous first-order kinematics\nand scene geometry. Furthermore, we develop a fast linear solver and a\ncontinuous-time nonlinear solver on top of the proposed geometric error\nterm.Experiments on both synthetic and real data show the superiority of our\nlinear solver in terms of accuracy and efficiency, and indicate its\ncomplementary feature as an initialization method for existing nonlinear\nsolvers. Besides, our continuous-time non-linear solver exhibits exceptional\ncapability in accommodating sudden variations in motion since it does not rely\non the constant-motion assumption.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"NmNrREOrQn3l4ev6A7utdPAWxeBPZ5Vz0LxrKt391A0","pdfSize":"8135097"}