{"id":"2407.09493","title":"Social AI and The Equation of Wittgenstein's Language User With\n  Calvino's Literature Machine","authors":"W.J.T. Mollema","authorsParsed":[["Mollema","W. J. T.",""]],"versions":[{"version":"v1","created":"Thu, 23 May 2024 09:51:44 GMT"}],"updateDate":"2024-07-16","timestamp":1716457904000,"abstract":"  Is it sensical to ascribe psychological predicates to AI systems like\nchatbots based on large language models (LLMs)? People have intuitively started\nascribing emotions or consciousness to social AI ('affective artificial\nagents'), with consequences that range from love to suicide. The philosophical\nquestion of whether such ascriptions are warranted is thus very relevant. This\npaper advances the argument that LLMs instantiate language users in Ludwig\nWittgenstein's sense but that ascribing psychological predicates to these\nsystems remains a functionalist temptation. Social AIs are not full-blown\nlanguage users, but rather more like Italo Calvino's literature machines. The\nideas of LLMs as Wittgensteinian language users and Calvino's\nliterature-producing writing machine are combined. This sheds light on the\nmisguided functionalist temptation inherent in moving from equating the two to\nthe ascription of psychological predicates to social AI. Finally, the framework\nof mortal computation is used to show that social AIs lack the basic\nautopoiesis needed for narrative fa\\c{c}ons de parler and their role in the\nsensemaking of human (inter)action. Such psychological predicate ascriptions\ncould make sense: the transition 'from quantity to quality' can take place, but\nits route lies somewhere between life and death, not between affective\nartifacts and emotion approximation by literature machines.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"VUkvmnBQkz1jl4l7IyQ0pc0s42C-GZ-4EC5yDIeDDUI","pdfSize":"386127"}