{"id":"2407.07349","title":"Ferromagnetic polar metals via epitaxial strain: a case study of\n  SrCoO$_3$","authors":"Zhiwei Liu, Qiuyue Li, Hanghui Chen","authorsParsed":[["Liu","Zhiwei",""],["Li","Qiuyue",""],["Chen","Hanghui",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 04:03:13 GMT"}],"updateDate":"2024-07-11","timestamp":1720584193000,"abstract":"  While polar metals are a metallic analogue of ferroelectrics, magnetic polar\nmetals can be considered as a metallic analogue of multiferroics. There have\nbeen a number of attempts to integrate magnetism into a polar metal by\nsynthesizing new materials or heterostructures. Here we use a simple yet widely\nused approach--epitaxial strain in the search for intrinsic magnetic polar\nmetals. Via first-principles calculations, we study strain engineering of a\nferromagnetic metallic oxide SrCoO$_3$, whose bulk form crystallizes in a cubic\nstructure. We find that under an experimentally feasible biaxial strain on the\n$ab$ plane, collective Co polar displacements are stabilized in SrCoO$_3$.\nSpecifically, a compressive strain stabilizes Co polar displacements along the\n$c$ axis, while a tensile strain stabilizes Co polar displacements along the\ndiagonal line in the $ab$ plane. In both cases, we find an intrinsic\nferromagnetic polar metallic state in SrCoO$_3$. In addition, we also find that\na sufficiently large biaxial strain ($> 4\\%$) can yield a\nferromagnetic-to-antiferromagnetic transition in SrCoO$_3$. Our work\ndemonstrates that in addition to yielding emergent multiferroics, epitaxial\nstrain is also a viable approach to inducing magnetic polar metallic states in\nquantum materials.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"54EB2hK_lKK6F-U1sk5cTa2kBdnEoi6axCrnPmSLWVI","pdfSize":"3187641","objectId":"0x3e7b306e84fac9b0ce94297ed8288073a1fc9dcd808d12918a2a32c90715b25f","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
