{"id":"2407.04677","title":"The TROY project III. Exploring co-orbitals around low-mass stars","authors":"O. Balsalobre-Ruza, J. Lillo-Box, D. Barrado, A. Correia, J. P. Faria,\n  P. Figueira, A. Leleu, P. Robutel, N. Santos, and E. Herrero-Cisneros","authorsParsed":[["Balsalobre-Ruza","O.",""],["Lillo-Box","J.",""],["Barrado","D.",""],["Correia","A.",""],["Faria","J. P.",""],["Figueira","P.",""],["Leleu","A.",""],["Robutel","P.",""],["Santos","N.",""],["Herrero-Cisneros","E.",""]],"versions":[{"version":"v1","created":"Fri, 5 Jul 2024 17:40:11 GMT"}],"updateDate":"2024-07-08","timestamp":1720201211000,"abstract":"  Co-orbital objects, also known as trojans, are frequently found in\nsimulations of planetary system formation. In these configurations, a planet\nshares its orbit with other massive bodies. It is still unclear why there have\nnot been any co-orbitals discovered thus far in exoplanetary systems or even\npairs of planets found in such a 1:1 mean motion resonance. Reconciling\nobservations and theory is an open subject in the field. The main objective of\nthe TROY project is to conduct an exhaustive search for exotrojans using\ndiverse observational techniques. In this work, we analyze the radial velocity\ntime series informed by transits, focusing the search around low-mass stars. We\nemployed the alpha-test method on confirmed planets searching for shifts\nbetween spectral and photometric mid-transit times. This technique is sensitive\nto mass imbalances within the planetary orbit, allowing us to identify\nnon-negligible co-orbital masses. Among the 95 transiting planets examined, we\nfind one robust exotrojan candidate with a significant 3-sigma detection.\nAdditionally, 25 exoplanets show compatibility with the presence of exotrojan\ncompanions at a 1-sigma level, requiring further observations to better\nconstrain their presence. For two of those weak candidates, we find dimmings in\ntheir light curves within the predicted Lagrangian region. We established upper\nlimits on the co-orbital masses for either the candidates and null detections.\nOur analysis reveals that current high-resolution spectrographs effectively\nrule out co-orbitals more massive than Saturn around low-mass stars. This work\npoints out to dozens of targets that have the potential to better constraint\ntheir exotrojan upper mass limit with dedicated radial velocity observations.\nWe also explored the potential of observing the secondary eclipses of the\nconfirmed exoplanets to enhance the exotrojan search.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"hmiVTsQtxqebHPwlAYVPBVkQzNiWEFXAtZM6888oTjI","pdfSize":"7546151"}