{"id":"2407.21012","title":"Uplink Wave-Domain Combiner for Stacked Intelligent Metasurfaces\n  Accounting for Hardware Limitations","authors":"Maryam Rezvani, Raviraj Adve, Akram bin Sediq, Amr El-Keyi","authorsParsed":[["Rezvani","Maryam",""],["Adve","Raviraj",""],["Sediq","Akram bin",""],["El-Keyi","Amr",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 17:57:56 GMT"}],"updateDate":"2024-07-31","timestamp":1722362276000,"abstract":"  Using refractive metasurfaces (RMTSs) as part of the antenna design offers a\npromising solution to the ever-increasing demand for improved energy efficiency\nof wireless communications. To overcome the limitations of using one RMTS\nlayer, a recent proposal is to cascade multiple layers, a structure called\nstacked intelligent metasurfaces (SIMs) where the desired precoder and combiner\nis formed in the wave domain. However, while proposing the antenna structure,\nthe analysis did not account for the attendant limitations imposed by the\nhardware used which has a significant impact on the performance of SIMs. In\nthis paper, we study the achievable sum-rate of a SIM antenna in an uplink\nwireless communication scenario accounting for hardware limitations. We begin\nby proposing a system model that captures both the effect of noise and hardware\nlimitations in these systems. We then formulate the achievable sum-rate\nproblem; since optimizing the rate is non-convex, we propose two approaches: a\ngradient ascent algorithm and an interior point method to find a\nclose-to-optimum combiner. To show the efficiency of using SIMs at a\nbasestation, we compare the achievable sum-rate with that of a digital phased\narray (DPA). We provide two comparisons: first, in Rayleigh fading and\nrealistic 3GPP channels and then under a constraint of an equal number of radio\nfrequency (RF) chains and equal physical aperture size constraint. Our results\nshow that SIM antennas can surpass DPA performance under an equal number of RF\nchains but has inferior performance under equal aperture size.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"n7fNH1pgMhbQezZD8WnrvKyYV54Xvfg4fgBj254gOAw","pdfSize":"751508","objectId":"0x7f6196202aa12ef41beee8d73af18c6d05c8556ddf9fe6ad7f3c90d3e8c8797b","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
