{"id":"2407.03749","title":"Examination of the evidence for a proton halo in $^{22}$Al","authors":"K. Y. Zhang, C. Pan, Sibo Wang","authorsParsed":[["Zhang","K. Y.",""],["Pan","C.",""],["Wang","Sibo",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 08:59:21 GMT"},{"version":"v2","created":"Tue, 23 Jul 2024 04:42:02 GMT"}],"updateDate":"2024-07-24","timestamp":1720083561000,"abstract":"  More and more halo nuclei or candidates have been identified or suggested in\nexperiments in recent years. It was declared that the halo structure of\n$^{22}$Al is revealed by the large isospin asymmetry in $^{22}$Si/$^{22}$O\nmirror Gamow-Teller transitions [Phys. Rev. Lett. 125, 192503 (2020)]. We\nhighlight that a significant mirror asymmetry already exists between wave\nfunctions of the likely unbound nucleus $^{22}$Si and the doubly-magic nucleus\n$^{22}$O, which largely explains the observed asymmetry in the transitions.\nFurthermore, these transitions involve only the $1^+$ excited states of the\ndaughter nuclei $^{22}$Al and $^{22}$F. The $1^+$ state of $^{22}$Al cannot be\nconsidered a halo state due to its proton-unbound nature. An analysis of the\nspin-parity suggests that a weakly bound $2s_{1/2}$ valence proton in the\nground state of $^{22}$Al is improbable. To investigate the shell structure for\nthe ground state of $^{22}$Al, we employ the state-of-the-art deformed and\ntriaxial relativistic Hartree-Bogoliubov theories in continuum. We find that a\nsmall $s$-wave component of $5\\%$ appears for the weakly bound valence proton\nin $^{22}$Al only when triaxial deformation is considered. While the\nexamination of densities and rms radii indicates that this small $s$-wave\ncomponent is insufficient to form a discernible proton halo in $^{22}$Al,\nslightly larger $2s_{1/2}$ occupations have been reported in other recent\ntheoretical results. The question of how many low-$\\ell$ components are\nsufficient to form a proton halo in the presence of the Coulomb barrier remains\nopen. Thus, future measurements of reaction or interaction cross sections and\nmomentum distributions of breakup fragments are highly desirable to verify\nwhether $^{22}$Al is a halo nucleus.\n","subjects":["Physics/Nuclear Theory","Physics/Nuclear Experiment"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"2j3f0DXO7y38GdXwSAQVDKYVoAaLGxUvMuVDLC8kO0Y","pdfSize":"528054"}