{"id":"2407.21244","title":"VITAL: Visual Teleoperation to Enhance Robot Learning through\n  Human-in-the-Loop Corrections","authors":"Hamidreza Kasaei, Mohammadreza Kasaei","authorsParsed":[["Kasaei","Hamidreza",""],["Kasaei","Mohammadreza",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 23:29:47 GMT"}],"updateDate":"2024-08-01","timestamp":1722382187000,"abstract":"  Imitation Learning (IL) has emerged as a powerful approach in robotics,\nallowing robots to acquire new skills by mimicking human actions. Despite its\npotential, the data collection process for IL remains a significant challenge\ndue to the logistical difficulties and high costs associated with obtaining\nhigh-quality demonstrations. To address these issues, we propose a low-cost\nvisual teleoperation system for bimanual manipulation tasks, called VITAL. Our\napproach leverages affordable hardware and visual processing techniques to\ncollect demonstrations, which are then augmented to create extensive training\ndatasets for imitation learning. We enhance the generalizability and robustness\nof the learned policies by utilizing both real and simulated environments and\nhuman-in-the-loop corrections. We evaluated our method through several rounds\nof experiments in simulated and real-robot settings, focusing on tasks of\nvarying complexity, including bottle collecting, stacking objects, and\nhammering. Our experimental results validate the effectiveness of our approach\nin learning robust robot policies from simulated data, significantly improved\nby human-in-the-loop corrections and real-world data integration. Additionally,\nwe demonstrate the framework's capability to generalize to new tasks, such as\nsetting a drink tray, showcasing its adaptability and potential for handling a\nwide range of real-world bimanual manipulation tasks. A video of the\nexperiments can be found at: https://youtu.be/YeVAMRqRe64?si=R179xDlEGc7nPu8i\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"b-mb8m_zMidAqKv8yRYVy_9D0mVyzgzsRQiuoYl-Imw","pdfSize":"38124479"}