{"id":"2407.16145","title":"Improved Few-Shot Image Classification Through Multiple-Choice Questions","authors":"Dipika Khullar, Emmett Goodman, Negin Sokhandan","authorsParsed":[["Khullar","Dipika",""],["Goodman","Emmett",""],["Sokhandan","Negin",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 03:09:42 GMT"}],"updateDate":"2024-07-24","timestamp":1721704182000,"abstract":"  Through a simple multiple choice language prompt a VQA model can operate as a\nzero-shot image classifier, producing a classification label. Compared to\ntypical image encoders, VQA models offer an advantage: VQA-produced image\nembeddings can be infused with the most relevant visual information through\ntailored language prompts. Nevertheless, for most tasks, zero-shot VQA\nperformance is lacking, either because of unfamiliar category names, or\ndissimilar pre-training data and test data distributions. We propose a simple\nmethod to boost VQA performance for image classification using only a handful\nof labeled examples and a multiple-choice question. This few-shot method is\ntraining-free and maintains the dynamic and flexible advantages of the VQA\nmodel. Rather than relying on the final language output, our approach uses\nmultiple-choice questions to extract prompt-specific latent representations,\nwhich are enriched with relevant visual information. These representations are\ncombined to create a final overall image embedding, which is decoded via\nreference to latent class prototypes constructed from the few labeled examples.\nWe demonstrate this method outperforms both pure visual encoders and zero-shot\nVQA baselines to achieve impressive performance on common few-shot tasks\nincluding MiniImageNet, Caltech-UCSD Birds, and CIFAR-100. Finally, we show our\napproach does particularly well in settings with numerous diverse visual\nattributes such as the fabric, article-style, texture, and view of different\narticles of clothing, where other few-shot approaches struggle, as we can\ntailor our image representations only on the semantic features of interest.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"2m38JrwTK7ScnCk2WlVvEWHroDCDbkUpb2ch7zeIcZE","pdfSize":"1658380"}