{"id":"2407.03343","title":"Accurate close interactions of Stokes spheres using lubrication-adapted\n  image systems","authors":"Anna Broms, Alex H. Barnett and Anna-Karin Tornberg","authorsParsed":[["Broms","Anna",""],["Barnett","Alex H.",""],["Tornberg","Anna-Karin",""]],"versions":[{"version":"v1","created":"Wed, 29 May 2024 14:21:30 GMT"}],"updateDate":"2024-07-08","timestamp":1716992490000,"abstract":"  Stokes flows with near-touching rigid particles induce near-singular\nlubrication forces under relative motion, making their accurate numerical\ntreatment challenging. With the aim of controlling the accuracy with a\ncomputationally cheap method, we present a new technique that combines the\nmethod of fundamental solutions (MFS) with the method of images. For rigid\nspheres, we propose to represent the flow using Stokeslet proxy sources on\ninterior spheres, augmented by lines of image sources adapted to each\nnear-contact to resolve lubrication. Source strengths are found by a\nleast-squares solve at contact-adapted boundary collocation nodes. We include\nextensive numerical tests, and validate against reference solutions from a\nwell-resolved boundary integral formulation. With less than 60 image sources\nper particle per contact, we show controlled uniform accuracy to three relative\ndigits in surface velocities, and up to five digits in particle forces and\ntorques, for all separations down to a thousandth of the radius. In the special\ncase of flows around fixed particles, the proxy sphere alone gives controlled\naccuracy. A one-body preconditioning strategy allows acceleration with the fast\nmultipole method, hence close to linear scaling in the number of particles.\nThis is demonstrated by solving problems of up to 2000 spheres on a workstation\nusing only 700 proxy sources per particle.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"08LWtm1N_rOms-hfmfcVQ5MlN1Nx3XpCKvK_yudwac4","pdfSize":"8882632"}