{"id":"2407.17659","title":"Discretized Quantum Exhaustive Search for Variational Quantum Algorithms","authors":"Dekel Meirom, Ittay Alfassi and Tal Mor","authorsParsed":[["Meirom","Dekel",""],["Alfassi","Ittay",""],["Mor","Tal",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 22:06:05 GMT"}],"updateDate":"2024-07-26","timestamp":1721858765000,"abstract":"  Quantum computers promise a great computational advantage over classical\ncomputers, yet currently available quantum devices have only a limited amount\nof qubits and a high level of noise, limiting the size of problems that can be\nsolved accurately with those devices. Variational Quantum Algorithms (VQAs)\nhave emerged as a leading strategy to address these limitations by optimizing\ncost functions based on measurement results of shallow-depth circuits. However,\nthe optimization process usually suffers from severe trainability issues as a\nresult of the exponentially large search space, mainly local minima and barren\nplateaus. Here we propose a novel method that can improve variational quantum\nalgorithms -- ``discretized quantum exhaustive search''. On classical\ncomputers, exhaustive search, also named brute force, solves small-size NP\ncomplete and NP hard problems. Exhaustive search and efficient partial\nexhaustive search help designing heuristics and exact algorithms for solving\nlarger-size problems by finding easy subcases or good approximations. We adopt\nthis method to the quantum domain, by relying on mutually unbiased bases for\nthe $2^n$-dimensional Hilbert space. We define a discretized quantum exhaustive\nsearch that works well for small size problems. We provide an example of an\nefficient partial discretized quantum exhaustive search for larger-size\nproblems, in order to extend classical tools to the quantum computing domain,\nfor near future and far future goals. Our method enables obtaining intuition on\nNP-complete and NP-hard problems as well as on Quantum Merlin Arthur\n(QMA)-complete and QMA-hard problems. We demonstrate our ideas in many simple\ncases, providing the energy landscape for various problems and presenting two\ntypes of energy curves via VQAs.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"jQOJojr0P34K4676q8efoDEnsuyfCPzOyhMLS9jaSbY","pdfSize":"5813682"}