{"id":"2407.07931","title":"Search, Examine and Early-Termination: Fake News Detection with\n  Annotation-Free Evidences","authors":"Yuzhou Yang, Yangming Zhou, Qichao Ying, Zhenxing Qian and Xinpeng\n  Zhang","authorsParsed":[["Yang","Yuzhou",""],["Zhou","Yangming",""],["Ying","Qichao",""],["Qian","Zhenxing",""],["Zhang","Xinpeng",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 07:22:30 GMT"}],"updateDate":"2024-07-12","timestamp":1720596150000,"abstract":"  Pioneer researches recognize evidences as crucial elements in fake news\ndetection apart from patterns. Existing evidence-aware methods either require\nlaborious pre-processing procedures to assure relevant and high-quality\nevidence data, or incorporate the entire spectrum of available evidences in all\nnews cases, regardless of the quality and quantity of the retrieved data. In\nthis paper, we propose an approach named \\textbf{SEE} that retrieves useful\ninformation from web-searched annotation-free evidences with an\nearly-termination mechanism. The proposed SEE is constructed by three main\nphases: \\textbf{S}earching online materials using the news as a query and\ndirectly using their titles as evidences without any annotating or filtering\nprocedure, sequentially \\textbf{E}xamining the news alongside with each piece\nof evidence via attention mechanisms to produce new hidden states with\nretrieved information, and allowing \\textbf{E}arly-termination within the\nexamining loop by assessing whether there is adequate confidence for producing\na correct prediction. We have conducted extensive experiments on datasets with\nunprocessed evidences, i.e., Weibo21, GossipCop, and pre-processed evidences,\nnamely Snopes and PolitiFact. The experimental results demonstrate that the\nproposed method outperforms state-of-the-art approaches.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Czlgp7Rw384DhsXfmI9P7UrhaM3dpkKcD3BmFeXyae0","pdfSize":"2669725"}