{"id":"2407.09467","title":"FairyLandAI: Personalized Fairy Tales utilizing ChatGPT and DALLE-3","authors":"Georgios Makridis, Athanasios Oikonomou, Vasileios Koukos","authorsParsed":[["Makridis","Georgios",""],["Oikonomou","Athanasios",""],["Koukos","Vasileios",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 17:46:58 GMT"}],"updateDate":"2024-07-15","timestamp":1720806418000,"abstract":"  In the diverse world of AI-driven storytelling, there is a unique opportunity\nto engage young audiences with customized, and personalized narratives. This\npaper introduces FairyLandAI an innovative Large Language Model (LLM) developed\nthrough OpenAI's API, specifically crafted to create personalized fairytales\nfor children. The distinctive feature of FairyLandAI is its dual capability: it\nnot only generates stories that are engaging, age-appropriate, and reflective\nof various traditions but also autonomously produces imaginative prompts\nsuitable for advanced image generation tools like GenAI and Dalle-3, thereby\nenriching the storytelling experience. FairyLandAI is expertly tailored to\nresonate with the imaginative worlds of children, providing narratives that are\nboth educational and entertaining and in alignment with the moral values\ninherent in different ages. Its unique strength lies in customizing stories to\nmatch individual children's preferences and cultural backgrounds, heralding a\nnew era in personalized storytelling. Further, its integration with image\ngeneration technology offers a comprehensive narrative experience that\nstimulates both verbal and visual creativity. Empirical evaluations of\nFairyLandAI demonstrate its effectiveness in crafting captivating stories for\nchildren, which not only entertain but also embody the values and teachings of\ndiverse traditions. This model serves as an invaluable tool for parents and\neducators, supporting them in imparting meaningful moral lessons through\nengaging narratives. FairyLandAI represents a pioneering step in using LLMs,\nparticularly through OpenAI's API, for educational and cultural enrichment,\nmaking complex moral narratives accessible and enjoyable for young, imaginative\nminds.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"-LiJnFp3znM_b52vlxdYnEX9eMlTMZFd1H52ESY-aUY","pdfSize":"2445164"}