{"id":"2407.06261","title":"The ALMA-ALPAKA survey II. Evolution of turbulence in galaxy disks\n  across cosmic time: difference between cold and warm gas","authors":"F. Rizzo, C. Bacchini, M. Kohandel, L. Di Mascolo, F. Fraternali, F.\n  Roman-Oliveira, A. Zanella, G. Popping, F. Valentino, G. Magdis, K. Whitaker","authorsParsed":[["Rizzo","F.",""],["Bacchini","C.",""],["Kohandel","M.",""],["Di Mascolo","L.",""],["Fraternali","F.",""],["Roman-Oliveira","F.",""],["Zanella","A.",""],["Popping","G.",""],["Valentino","F.",""],["Magdis","G.",""],["Whitaker","K.",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 18:00:01 GMT"},{"version":"v2","created":"Sat, 13 Jul 2024 17:21:01 GMT"}],"updateDate":"2024-07-16","timestamp":1720461601000,"abstract":"  The gas in the interstellar medium (ISM) of galaxies is supersonically\nturbulent. Measurements of turbulence typically rely on cold gas emission lines\nfor low-z galaxies and warm ionized gas observations for z>0 galaxies. Studies\nof warm gas kinematics at z>0 conclude that the turbulence strongly evolves as\na function of redshift, due to the increasing impact of gas accretion and\nmergers in the early Universe. However, recent findings suggest potential\nbiases in turbulence measurements derived from ionized gas at high-z, impacting\nour understanding of turbulence origin, ISM physics and disk formation. We\ninvestigate the evolution of turbulence using velocity dispersion ($\\sigma$)\nmeasurements from cold gas tracers (i.e., CO, [CI], [CII]) derived from a\nsample of 57 galaxy disks spanning the redshift range z=0-5. This sample\nconsists of main-sequence and starburst galaxies with stellar masses $\\gtrsim\n10^{10} M_{\\odot}$. The comparison with current H$\\alpha$ kinematic\nobservations and existing models demonstrates that the velocity dispersion\ninferred from cold gas tracers differ by a factor of $\\approx 3$ from those\nobtained using emission lines tracing warm gas. We show that stellar feedback\nis the main driver of turbulence measured from cold gas tracers. This is\nfundamentally different from the conclusions of studies based on warm gas,\nwhich had to consider additional turbulence drivers to explain the high values\nof $\\sigma$. We present a model predicting the redshift evolution of turbulence\nin galaxy disks, attributing the increase of $\\sigma$ with redshift to the\nhigher energy injected by supernovae due to the elevated star-formation rate in\nhigh-z galaxies. This supernova-driven model suggests that turbulence is lower\nin galaxies with lower stellar mass compared to those with higher stellar mass.\nAdditionally, it forecasts the evolution of $\\sigma$ in Milky-Way like\nprogenitors.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"rZTT1XIzQbZGu34EHIPDIt2fjpISmKu_NjSb42myQHo","pdfSize":"2776514"}