{"id":"2407.08328","title":"Unveiling Disparities in Maternity Care: A Topic Modelling Approach to\n  Analysing Maternity Incident Investigation Reports","authors":"Georgina Cosma, Mohit Kumar Singh, Patrick Waterson, Gyuchan Thomas\n  Jun, and Jonathan Back","authorsParsed":[["Cosma","Georgina",""],["Singh","Mohit Kumar",""],["Waterson","Patrick",""],["Jun","Gyuchan Thomas",""],["Back","Jonathan",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 09:26:05 GMT"}],"updateDate":"2024-07-12","timestamp":1720689965000,"abstract":"  This study applies Natural Language Processing techniques, including Latent\nDirichlet Allocation, to analyse anonymised maternity incident investigation\nreports from the Healthcare Safety Investigation Branch. The reports underwent\npreprocessing, annotation using the Safety Intelligence Research taxonomy, and\ntopic modelling to uncover prevalent topics and detect differences in maternity\ncare across ethnic groups. A combination of offline and online methods was\nutilised to ensure data protection whilst enabling advanced analysis, with\noffline processing for sensitive data and online processing for non-sensitive\ndata using the `Claude 3 Opus' language model. Interactive topic analysis and\nsemantic network visualisation were employed to extract and display thematic\ntopics and visualise semantic relationships among keywords. The analysis\nrevealed disparities in care among different ethnic groups, with distinct focus\nareas for the Black, Asian, and White British ethnic groups. The study\ndemonstrates the effectiveness of topic modelling and NLP techniques in\nanalysing maternity incident investigation reports and highlighting disparities\nin care. The findings emphasise the crucial role of advanced data analysis in\nimproving maternity care quality and equity.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7Wjn0_RJQNKOmpvL5njUdz1zeHlUWLgHKOe_XxMG9UQ","pdfSize":"386710"}