{"id":"2407.15602","title":"Flows, Circulations, and Energy Transport in the Outer and Deep\n  Atmospheres of Synchronous and Non-synchronous Hot Jupiters","authors":"Felix Sainsbury-Martinez and Pascal Tremblin","authorsParsed":[["Sainsbury-Martinez","Felix",""],["Tremblin","Pascal",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 12:51:43 GMT"},{"version":"v2","created":"Wed, 18 Sep 2024 14:18:10 GMT"}],"updateDate":"2024-09-19","timestamp":1721652703000,"abstract":"  Recent studies have shown that vertical enthalpy transport can explain the\ninflated radii of highly irradiated gaseous exoplanets. They have also shown\nthat rotation can influence this transport, leading to highly irradiated,\nrapidly rotating, objects that are uninflated. Here we explore the underlying\nflows, including the impact of (non)synchronous rotation. We use DYNAMICO to\nrun a series of long-timescale, HD209-like, atmospheric models at various\nsurface rotation rates. For models that are tidally-locked, we consider\nrotation rates between $1/16^\\mathrm{th}$ and $40$ times the rotation rate of\nHD209, whilst for non-synchronous models we consider the range\n$1/8^\\mathrm{th}$ to $4$x. We find that our synchronous models fall into one of\nthree $\\Omega$-dependent regimes: at low $\\Omega$, we find that the outer\natmosphere dynamics are driven by a divergent day-night wind, driving weak\nvertical transport and the formation of a night-side hot-spot. At intermediate\n$\\Omega$, we find classical hot Jupiter dynamics, whilst at high $\\Omega$ we\nfind a strong Coriolis effect that suppresses off-equator dynamics, including\nthe jet-driving standing waves, thus also reducing vertical transport. As for\nnon-synchronicity, when small, we find that it has little effect on dynamics.\nHowever as it grows, we find that temporal variations prevents the formation of\nthe persistent structures that drive global dynamics. We find that rotation can\nsignificantly impact the atmospheric dynamics of irradiated exoplanets,\nincluding vertical advection, which may explain the scatter in the\nradius-irradiation relation. We have also identified a seemingly robust feature\nat slow rotation: a night-side hot-spot. As this may have important\nimplications for both the phase curve and atmospheric chemistry, we suggest\nthat this study be followed up with next-generation GCMs that robustly model\nradiation/chemistry.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"lV-qnVIKClkJLCfLQfZaQ5jsGUgV19yzusKIw2h5BQ4","pdfSize":"15884811"}