{"id":"2407.08239","title":"An Unsupervised Domain Adaptation Method for Locating Manipulated Region\n  in partially fake Audio","authors":"Siding Zeng, Jiangyan Yi, Jianhua Tao, Yujie Chen, Shan Liang, Yong\n  Ren, Xiaohui Zhang","authorsParsed":[["Zeng","Siding",""],["Yi","Jiangyan",""],["Tao","Jianhua",""],["Chen","Yujie",""],["Liang","Shan",""],["Ren","Yong",""],["Zhang","Xiaohui",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 07:32:16 GMT"}],"updateDate":"2024-07-12","timestamp":1720683136000,"abstract":"  When the task of locating manipulation regions in partially-fake audio (PFA)\ninvolves cross-domain datasets, the performance of deep learning models drops\nsignificantly due to the shift between the source and target domains. To\naddress this issue, existing approaches often employ data augmentation before\ntraining. However, they overlook the characteristics in target domain that are\nabsent in source domain. Inspired by the mixture-of-experts model, we propose\nan unsupervised method named Samples mining with Diversity and Entropy (SDE).\nOur method first learns from a collection of diverse experts that achieve great\nperformance from different perspectives in the source domain, but with\nambiguity on target samples. We leverage these diverse experts to select the\nmost informative samples by calculating their entropy. Furthermore, we\nintroduced a label generation method tailored for these selected samples that\nare incorporated in the training process in source domain integrating the\ntarget domain information. We applied our method to a cross-domain partially\nfake audio detection dataset, ADD2023Track2. By introducing 10% of unknown\nsamples from the target domain, we achieved an F1 score of 43.84%, which\nrepresents a relative increase of 77.2% compared to the second-best method.\n","subjects":["Computing Research Repository/Sound","Computing Research Repository/Machine Learning","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7rWwwvkWz4isMsgfsuHdOOJSygoKiOI7jlxbpUZHc_c","pdfSize":"597189"}