{"id":"2407.15895","title":"Quantum Circuits for the heat equation with physical boundary conditions\n  via Schrodingerisation","authors":"Shi Jin, Nana Liu, Yue Yu","authorsParsed":[["Jin","Shi",""],["Liu","Nana",""],["Yu","Yue",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 03:52:14 GMT"},{"version":"v2","created":"Fri, 26 Jul 2024 06:12:24 GMT"}],"updateDate":"2024-07-29","timestamp":1721620334000,"abstract":"  This paper explores the explicit design of quantum circuits for quantum\nsimulation of partial differential equations (PDEs) with physical boundary\nconditions. These equations and/or their discretized forms usually do not\nevolve via unitary dynamics, thus are not suitable for quantum simulation.\nBoundary conditions (either time-dependent or independent) make the problem\nmore difficult. To tackle this challenge, the Schrodingerisation method can be\nemployed, which converts linear partial and ordinary differential equations\nwith non-unitary dynamics into systems of Schrodinger-type equations, via the\nso-called warped phase transformation that maps the equation into one higher\ndimension. Despite advancements in Schrodingerisation techniques, the explicit\nimplementation of quantum circuits for solving general PDEs, especially with\nphysical boundary conditions, remains underdeveloped. We present two methods\nfor handling the inhomogeneous terms arising from time-dependent physical\nboundary conditions. One approach utilizes Duhamel's principle to express the\nsolution in integral form and employs linear combination of unitaries (LCU) for\ncoherent state preparation. Another method applies an augmentation to transform\nthe inhomogeneous problem into a homogeneous one. We then apply the quantum\nsimulation technique from [CJL23] to transform the resulting non-autonomous\nsystem to an autonomous system in one higher dimension. We provide detailed\nimplementations of these two methods and conduct a comprehensive complexity\nanalysis in terms of queries to the time evolution input oracle.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Numerical Analysis","Mathematics/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"VV15jNKnPFsXkkMcycd47EOQtJoJZu-8o1txg-L8ui8","pdfSize":"948505","objectId":"0x4865f2f08b62aab0f59c1e3f9b0e02d4ae9d6c153c35ffdd198f58dd15ef6bc5","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
