{"id":"2407.11271","title":"An Analysis of European Data and AI Regulations for Automotive\n  Organizations","authors":"Charlotte A. Shahlaei and Nicholas Berente","authorsParsed":[["Shahlaei","Charlotte A.",""],["Berente","Nicholas",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 22:38:37 GMT"},{"version":"v2","created":"Thu, 18 Jul 2024 14:38:13 GMT"},{"version":"v3","created":"Fri, 19 Jul 2024 02:59:18 GMT"}],"updateDate":"2024-07-22","timestamp":1721083117000,"abstract":"  This report summarizes the European Union's series of data and AI regulations\nand analyzes them for managers in automotive vehicle manufacturing\norganizations. In particular, we highlight the relevant ideas of the\nregulations, including how they find their roots in earlier legislation, how\nthey contradict and complement each other, as well as the business\nopportunities that these regulations offer. The structure of the report is as\nfollows. First, we address the GDPR as the cornerstone against which the\nrequirements of other regulations are weighed and legislated. Second, we\nexplain the EU Data Act since it directly addresses Internet of Things (IoT)\nfor businesses in the private sector and imposes strict requirements on large\ndata generators such as vehicle manufacturers. For manufacturers, compliance\nwith the EU Data Act is a prerequisite for the subsequent legislation, in\nparticular the EU AI Act. Third, we explain the Data Governance Act, Digital\nServices Act, Digital Markets Act, and EU AI Act in chronological order.\nOverall, we characterize European Union data regulations as a wave set, rooted\nin historical precedent, with important implications for the automotive\nindustry.\n","subjects":["Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"I6XHR1wzmrdF3K1QoB5-wlbuE_2BopiDQWjUDC3jCpE","pdfSize":"2581276","objectId":"0xbffe92d257df3e75ec986e39a64db83539dce981c8147843ad6abcf14958a4b6","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
