{"id":"2407.21457","title":"Full Helicon thruster modeling","authors":"Daniele Iannarelli, Antonella Ingenito, Francesco Napoli, Filippo\n  Cichocki, Carmine Castaldo, Antonella De Ninno, Simone Mannori, Alessandro\n  Cardinali, Francesco Taccogna","authorsParsed":[["Iannarelli","Daniele",""],["Ingenito","Antonella",""],["Napoli","Francesco",""],["Cichocki","Filippo",""],["Castaldo","Carmine",""],["De Ninno","Antonella",""],["Mannori","Simone",""],["Cardinali","Alessandro",""],["Taccogna","Francesco",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 09:10:39 GMT"}],"updateDate":"2024-08-01","timestamp":1722417039000,"abstract":"  This research work is part of a PhD project aiming to design a new helicon\nplasma thruster for cargo space missions, within a collaboration between the\nSchool of Aerospace Engineering of La Sapienza University and the ENEA Frascati\nresearch center. A 0-D global design model of the thruster is first established\nto identify the main operational conditions of the thruster, starting from a\ntargeted performance in terms of specific impulse and thrust. These operational\nconditions are tested with dedicated simulations on the electromagnetic\nplasma-wave interaction within the ionization chamber, and on the electrostatic\nplasma acceleration within the magnetic nozzle. The former are carried out with\na finite element electromagnetic code and confirm the technical feasibility of\nthe identified operational RF power with a predefined chamber geometry. The\nlatter are obtained with an electrostatic particle-in-cell code, which allows\nto estimate more precisely the achieved thruster performance. A sub-optimal\nthruster with an absorbed plasma power of around 1 kW, a thrust of around 10 mN\nand a specific impulse higher than 1000 s is successfully simulated. The\nestablished simulation framework will serve as the basis for the next\noptimization of the thruster geometry and operational conditions, with the\nultimate goal of building and testing a new helicon thruster prototype.\n","subjects":["Physics/Plasma Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"opbqiJeazyMxaeL68GpbOsrPavvjb8hbxYAutbYoQMY","pdfSize":"869130"}