{"id":"2407.19153","title":"A Survey of Malware Detection Using Deep Learning","authors":"Ahmed Bensaoud, Jugal Kalita, Mahmoud Bensaoud","authorsParsed":[["Bensaoud","Ahmed",""],["Kalita","Jugal",""],["Bensaoud","Mahmoud",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 02:49:55 GMT"}],"updateDate":"2024-07-30","timestamp":1722048595000,"abstract":"  The problem of malicious software (malware) detection and classification is a\ncomplex task, and there is no perfect approach. There is still a lot of work to\nbe done. Unlike most other research areas, standard benchmarks are difficult to\nfind for malware detection. This paper aims to investigate recent advances in\nmalware detection on MacOS, Windows, iOS, Android, and Linux using deep\nlearning (DL) by investigating DL in text and image classification, the use of\npre-trained and multi-task learning models for malware detection approaches to\nobtain high accuracy and which the best approach if we have a standard\nbenchmark dataset. We discuss the issues and the challenges in malware\ndetection using DL classifiers by reviewing the effectiveness of these DL\nclassifiers and their inability to explain their decisions and actions to DL\ndevelopers presenting the need to use Explainable Machine Learning (XAI) or\nInterpretable Machine Learning (IML) programs. Additionally, we discuss the\nimpact of adversarial attacks on deep learning models, negatively affecting\ntheir generalization capabilities and resulting in poor performance on unseen\ndata. We believe there is a need to train and test the effectiveness and\nefficiency of the current state-of-the-art deep learning models on different\nmalware datasets. We examine eight popular DL approaches on various datasets.\nThis survey will help researchers develop a general understanding of malware\nrecognition using deep learning.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"QqBE9qLLETQ5CfV2fVBqE17UIUshvFnVfZNrKWZnH7g","pdfSize":"4791974"}