{"id":"2407.00217","title":"A flexured-gimbal 3-axis force-torque sensor reveals minimal cross-axis\n  coupling in an insect-sized flapping-wing robot","authors":"Aaron Weber, Daksh Dhingra, and Sawyer B. Fuller","authorsParsed":[["Weber","Aaron",""],["Dhingra","Daksh",""],["Fuller","Sawyer B.",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 19:59:39 GMT"}],"updateDate":"2024-07-02","timestamp":1719604779000,"abstract":"  The mechanical complexity of flapping wings, their unsteady aerodynamic flow,\nand challenge of making measurements at the scale of a sub-gram flapping-wing\nflying insect robot (FIR) make its behavior hard to predict. Knowing the\nprecise mapping from voltage input to torque output, however, can be used to\nimprove their mechanical and flight controller design. To address this\nchallenge, we created a sensitive force-torque sensor based on a flexured\ngimbal that only requires a standard motion capture system or accelerometer for\nreadout. Our device precisely and accurately measures pitch and roll torques\nsimultaneously, as well as thrust, on a tethered flapping-wing FIR in response\nto changing voltage input signals. With it, we were able to measure cross-axis\ncoupling of both torque and thrust input commands on a 180 mg FIR, the UW\nRobofly. We validated these measurements using free-flight experiments. Our\nresults showed that roll and pitch have maximum cross-axis coupling errors of\n8.58% and 17.24%, respectively, relative to the range of torque that is\npossible. Similarly, varying the pitch and roll commands resulted in up to a\n5.78% deviation from the commanded thrust, across the entire commanded torque\nrange. Our system, the first to measure two torque axes simultaneously, shows\nthat torque commands have a negligible cross-axis coupling on both torque and\nthrust.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"BCjZ2eFMqRBantEYfD_6QAK7hEv3VCoSizKBzOxyLPc","pdfSize":"698556"}