{"id":"2407.07412","title":"Pseudo-RIS: Distinctive Pseudo-supervision Generation for Referring\n  Image Segmentation","authors":"Seonghoon Yu, Paul Hongsuck Seo, Jeany Son","authorsParsed":[["Yu","Seonghoon",""],["Seo","Paul Hongsuck",""],["Son","Jeany",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 07:14:48 GMT"},{"version":"v2","created":"Mon, 15 Jul 2024 07:35:32 GMT"},{"version":"v3","created":"Wed, 17 Jul 2024 05:32:02 GMT"}],"updateDate":"2024-07-18","timestamp":1720595688000,"abstract":"  We propose a new framework that automatically generates high-quality\nsegmentation masks with their referring expressions as pseudo supervisions for\nreferring image segmentation (RIS). These pseudo supervisions allow the\ntraining of any supervised RIS methods without the cost of manual labeling. To\nachieve this, we incorporate existing segmentation and image captioning\nfoundation models, leveraging their broad generalization capabilities. However,\nthe naive incorporation of these models may generate non-distinctive\nexpressions that do not distinctively refer to the target masks. To address\nthis challenge, we propose two-fold strategies that generate distinctive\ncaptions: 1) 'distinctive caption sampling', a new decoding method for the\ncaptioning model, to generate multiple expression candidates with detailed\nwords focusing on the target. 2) 'distinctiveness-based text filtering' to\nfurther validate the candidates and filter out those with a low level of\ndistinctiveness. These two strategies ensure that the generated text\nsupervisions can distinguish the target from other objects, making them\nappropriate for the RIS annotations. Our method significantly outperforms both\nweakly and zero-shot SoTA methods on the RIS benchmark datasets. It also\nsurpasses fully supervised methods in unseen domains, proving its capability to\ntackle the open-world challenge within RIS. Furthermore, integrating our method\nwith human annotations yields further improvements, highlighting its potential\nin semi-supervised learning applications.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"xU8gfT-Jurj9xKrMw7IeVAQDDcHx2Nw2kmE_jc5bPE8","pdfSize":"9192405"}