{"id":"2407.09674","title":"Accelerating High-Throughput Phonon Calculations via Machine Learning\n  Universal Potentials","authors":"Huiju Lee, Vinay I. Hegde, Chris Wolverton, Yi Xia","authorsParsed":[["Lee","Huiju",""],["Hegde","Vinay I.",""],["Wolverton","Chris",""],["Xia","Yi",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 20:15:06 GMT"}],"updateDate":"2024-07-16","timestamp":1720815306000,"abstract":"  Phonons play a critical role in determining various material properties, but\nconventional methods for phonon calculations are computationally intensive,\nlimiting their broad applicability. In this study, we present an approach to\naccelerate high-throughput harmonic phonon calculations using machine learning\nuniversal potentials. We train a state-of-the-art machine learning interatomic\npotential, based on multi-atomic cluster expansion (MACE), on a comprehensive\ndataset of 2,738 crystal structures with 77 elements, totaling 15,670 supercell\nstructures, computed using high-fidelity density functional theory (DFT)\ncalculations. Our approach significantly reduces the number of required\nsupercells for phonon calculations while maintaining high accuracy in\npredicting harmonic phonon properties across diverse materials. The trained\nmodel is validated against phonon calculations for a held-out subset of 384\nmaterials, achieving a mean absolute error (MAE) of 0.18 THz for vibrational\nfrequencies from full phonon dispersions, 2.19 meV/atom for Helmholtz\nvibrational free energies at 300K, as well as a classification accuracy of\n86.2% for dynamical stability of materials. A thermodynamic analysis of\npolymorphic stability in 126 systems demonstrates good agreement with DFT\nresults at 300 K and 1000 K. In addition, the diverse and extensive\nhigh-quality DFT dataset curated in this study serves as a valuable resource\nfor researchers to train and improve other machine learning interatomic\npotential models.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Mf-3eXnGPGRfrByDm6biipYKNtbQueo52C5XTE9M0nY","pdfSize":"12366335"}