{"id":"2407.11071","title":"MonoSparse-CAM: Harnessing Monotonicity and Sparsity for Enhanced Tree\n  Model Processing on CAMs","authors":"Tergel Molom-Ochir, Brady Taylor, Hai Li, Yiran Chen","authorsParsed":[["Molom-Ochir","Tergel",""],["Taylor","Brady",""],["Li","Hai",""],["Chen","Yiran",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 20:34:59 GMT"}],"updateDate":"2024-07-19","timestamp":1720816499000,"abstract":"  Despite significant advancements in AI driven by neural networks, tree-based\nmachine learning (TBML) models excel on tabular data. These models exhibit\npromising energy efficiency, and high performance, particularly when\naccelerated on analog content-addressable memory (aCAM) arrays. However,\noptimizing their hardware deployment, especially in leveraging TBML model\nstructure and aCAM circuitry, remains challenging.\n  In this paper, we introduce MonoSparse-CAM, a novel content-addressable\nmemory (CAM) based computing optimization technique. MonoSparse-CAM efficiently\nleverages TBML model sparsity and CAM array circuits, enhancing processing\nperformance. Our experiments show that MonoSparse-CAM reduces energy\nconsumption by up to 28.56x compared to raw processing and 18.51x compared to\nexisting deployment optimization techniques. Additionally, it consistently\nachieves at least 1.68x computational efficiency over current methods.\n  By enabling energy-efficient CAM-based computing while preserving performance\nregardless of the array sparsity, MonoSparse-CAM addresses the high energy\nconsumption problem of CAM which hinders processing of large arrays. Our\ncontributions are twofold: we propose MonoSparse-CAM as an effective deployment\noptimization solution for CAM-based computing, and we investigate the impact of\nTBML model structure on array sparsity. This work provides crucial insights for\nenergy-efficient TBML on hardware, highlighting a significant advancement in\nsustainable AI technologies.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Hardware Architecture"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"raDXzaDeGSvB4fafToSeLaNcFHreUMFeB88aAylBvxE","pdfSize":"1325536"}