{"id":"2407.11436","title":"APriCoT: Action Primitives based on Contact-state Transition for In-Hand\n  Tool Manipulation","authors":"Daichi Saito, Atsushi Kanehira, Kazuhiro Sasabuchi, Naoki Wake, Jun\n  Takamatsu, Hideki Koike and Katsushi Ikeuchi","authorsParsed":[["Saito","Daichi",""],["Kanehira","Atsushi",""],["Sasabuchi","Kazuhiro",""],["Wake","Naoki",""],["Takamatsu","Jun",""],["Koike","Hideki",""],["Ikeuchi","Katsushi",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 07:02:39 GMT"}],"updateDate":"2024-07-17","timestamp":1721113359000,"abstract":"  In-hand tool manipulation is an operation that not only manipulates a tool\nwithin the hand (i.e., in-hand manipulation) but also achieves a grasp suitable\nfor a task after the manipulation. This study aims to achieve an in-hand tool\nmanipulation skill through deep reinforcement learning. The difficulty of\nlearning the skill arises because this manipulation requires (A) exploring\nlong-term contact-state changes to achieve the desired grasp and (B)\nhighly-varied motions depending on the contact-state transition. (A) leads to a\nsparsity of a reward on a successful grasp, and (B) requires an RL agent to\nexplore widely within the state-action space to learn highly-varied actions,\nleading to sample inefficiency. To address these issues, this study proposes\nAction Primitives based on Contact-state Transition (APriCoT). APriCoT\ndecomposes the manipulation into short-term action primitives by describing the\noperation as a contact-state transition based on three action representations\n(detach, crossover, attach). In each action primitive, fingers are required to\nperform short-term and similar actions. By training a policy for each\nprimitive, we can mitigate the issues from (A) and (B). This study focuses on a\nfundamental operation as an example of in-hand tool manipulation: rotating an\nelongated object grasped with a precision grasp by half a turn to achieve the\ninitial grasp. Experimental results demonstrated that ours succeeded in both\nthe rotation and the achievement of the desired grasp, unlike existing studies.\nAdditionally, it was found that the policy was robust to changes in object\nshape.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"1GkCxLKWoUtRrpIpWlc62CjpplM-HDk4Fcp03kupogw","pdfSize":"1601365"}