{"id":"2407.02255","title":"Measure and continuous vector field at a boundary I: propagation\n  equations and wave observability","authors":"Nicolas Burq, Belhassen Dehman and J\\'er\\^ome Le Rousseau","authorsParsed":[["Burq","Nicolas",""],["Dehman","Belhassen",""],["Rousseau","Jérôme Le",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 13:19:21 GMT"}],"updateDate":"2024-07-03","timestamp":1719926361000,"abstract":"  The celebrated geometric control condition of Bardos, Lebeau, and Rauch is\nnecessary and sufficient for wave observability [1,7] and exact\ncontrollability. It requires that any point in phase-space be transported by\nthe generalized geodesic flow to the region of observation in some finite time.\nThe initial smoothness (\\Cinf) required on the coefficients of the metric to\nprove that exact control and geometric control are essentially equivalent was\nsubsequently relaxed to \\Con2-metrics/coefficients and \\Con3-domains [2] which\nis close to the optimal smoothness required to preserve a generalized geodesic\nflow. In this article, we investigate a natural generalization of the geometric\ncontrol condition that makes sense for \\Con1-metrics and we prove that wave\nobservability holds under this condition. Moreover, we establish that the\nobservability property is stable under rougher (Lipschitz) perturbation of the\nmetric. We also provide a geometric necessary condition for wave observability\nto hold. Transport equations that describe the propagation of semi-classical\nmeasures are at the heart of the arguments. They are natural extensions to\ngeometries with boundaries of usual transport equations. This article is mainly\ndedicated to the proof of such propagation equations in this very rough\ncontext.\n","subjects":["Mathematics/Analysis of PDEs"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"vhZKVGUWXD6HSHL-ftxJfQy6uXnCmImDEIpsiBoGPA4","pdfSize":"1074816","objectId":"0xb1385c6149a93afc575ecdfdc9ef44d33dfc0fe19f6774cb8a2606fa6ba1af51","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
