{"id":"2407.20492","title":"The effects of surface fossil magnetic fields on massive star evolution:\n  V. Models at low metallicity","authors":"Z. Keszthelyi, J. Puls, G. Chiaki, H. Nagakura, A. ud-Doula, T.\n  Takiwaki, N. Tominaga","authorsParsed":[["Keszthelyi","Z.",""],["Puls","J.",""],["Chiaki","G.",""],["Nagakura","H.",""],["ud-Doula","A.",""],["Takiwaki","T.",""],["Tominaga","N.",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 01:26:12 GMT"}],"updateDate":"2024-07-31","timestamp":1722302772000,"abstract":"  At metallicities lower than that of the Small Magellanic Cloud, it remains\nessentially unexplored how fossil magnetic fields, forming large-scale\nmagnetospheres, could affect the evolution of massive stars, thereby impacting\nthe fundamental building blocks of the early Universe. We extend our stellar\nevolution model grid with representative calculations of main-sequence,\nsingle-star models with initial masses of 20 and 60 M$_\\odot$, including\nappropriate changes for low-metallicity environments ($Z = 10^{-3}-10^{-6}$).\nWe scrutinise the magnetic, rotational, and chemical properties of the models.\nWhen lowering the metallicity, the rotational velocities can become higher and\nthe tendency towards quasi-chemically homogeneous evolution increases. While\nmagnetic fields aim to prevent the development of this evolutionary channel,\nthe weakening stellar winds lead to less efficient magnetic braking in our\nmodels. Since the stellar radius is almost constant during a blueward evolution\ncaused by efficient chemical mixing, the surface magnetic field strength\nremains unchanged in some models. We find core masses at the terminal-age main\nsequence between 22 and 52 M$_\\odot$ for initially 60 M$_\\odot$ models. This\nlarge difference is due to the vastly different chemical and rotational\nevolution. We conclude that in order to explain chemical species and, in\nparticular, high nitrogen abundances in the early Universe, the adopted stellar\nmodels need to be under scrutiny. The assumptions regarding wind physics,\nchemical mixing, and magnetic fields will strongly impact the model\npredictions.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"qbZjhzI3uUzWGh20mH4bvEal5BwtqJxPti6h4V8O5ME","pdfSize":"5604915"}