{"id":"2407.03665","title":"Heterogeneous Hypergraph Embedding for Recommendation Systems","authors":"Darnbi Sakong and Viet Hung Vu and Thanh Trung Huynh and Phi Le Nguyen\n  and Hongzhi Yin and Quoc Viet Hung Nguyen and Thanh Tam Nguyen","authorsParsed":[["Sakong","Darnbi",""],["Vu","Viet Hung",""],["Huynh","Thanh Trung",""],["Nguyen","Phi Le",""],["Yin","Hongzhi",""],["Nguyen","Quoc Viet Hung",""],["Nguyen","Thanh Tam",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 06:09:11 GMT"}],"updateDate":"2024-07-08","timestamp":1720073351000,"abstract":"  Recent advancements in recommender systems have focused on integrating\nknowledge graphs (KGs) to leverage their auxiliary information. The core idea\nof KG-enhanced recommenders is to incorporate rich semantic information for\nmore accurate recommendations. However, two main challenges persist: i)\nNeglecting complex higher-order interactions in the KG-based user-item network,\npotentially leading to sub-optimal recommendations, and ii) Dealing with the\nheterogeneous modalities of input sources, such as user-item bipartite graphs\nand KGs, which may introduce noise and inaccuracies. To address these issues,\nwe present a novel Knowledge-enhanced Heterogeneous Hypergraph Recommender\nSystem (KHGRec). KHGRec captures group-wise characteristics of both the\ninteraction network and the KG, modeling complex connections in the KG. Using a\ncollaborative knowledge heterogeneous hypergraph (CKHG), it employs two\nhypergraph encoders to model group-wise interdependencies and ensure\nexplainability. Additionally, it fuses signals from the input graphs with\ncross-view self-supervised learning and attention mechanisms. Extensive\nexperiments on four real-world datasets show our model's superiority over\nvarious state-of-the-art baselines, with an average 5.18\\% relative\nimprovement. Additional tests on noise resilience, missing data, and cold-start\nproblems demonstrate the robustness of our KHGRec framework. Our model and\nevaluation datasets are publicly available at\n\\url{https://github.com/viethungvu1998/KHGRec}.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning","Computing Research Repository/Social and Information Networks","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"Pab2jvLHtmlIFiEAybSplrj6tVIC51ENdztAfbKmgvs","pdfSize":"8799855"}