{"id":"2407.08781","title":"JADES: Spectroscopic Confirmation and Proper Motion for a T-Dwarf at 2\n  Kiloparsecs","authors":"Kevin N. Hainline, Francesco D'Eugenio, Fengwu Sun, Jakob M. Helton,\n  Brittany E. Miles, MArk S. Marley, Ben W. P. Lew, Jarron M. Leisenring,\n  Andrew J. Bunker, Phillip A. Cargile, Stefano Carniani, Daniel J. Eisenstein,\n  Ignas Juodzbalis, Benjamin D. Johnson, Brant Robertson, Sandro Tacchella,\n  Christina C. Williams, Christopher N.A. Willmer","authorsParsed":[["Hainline","Kevin N.",""],["D'Eugenio","Francesco",""],["Sun","Fengwu",""],["Helton","Jakob M.",""],["Miles","Brittany E.",""],["Marley","MArk S.",""],["Lew","Ben W. P.",""],["Leisenring","Jarron M.",""],["Bunker","Andrew J.",""],["Cargile","Phillip A.",""],["Carniani","Stefano",""],["Eisenstein","Daniel J.",""],["Juodzbalis","Ignas",""],["Johnson","Benjamin D.",""],["Robertson","Brant",""],["Tacchella","Sandro",""],["Williams","Christina C.",""],["Willmer","Christopher N. A.",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 18:00:03 GMT"}],"updateDate":"2024-07-15","timestamp":1720720803000,"abstract":"  Large area observations of extragalactic deep fields with the James Webb\nSpace Telescope (JWST) have provided a wealth of candidate low-mass L- and\nT-class brown dwarfs. The existence of these sources, which are at derived\ndistances of hundreds of parsecs to several kiloparsecs from the Sun, has\nstrong implications for the low-mass end of the stellar initial mass function,\nand the link between stars and planets at low metallicities. In this letter, we\npresent a JWST/NIRSpec PRISM spectrum of brown dwarf JADES-GS-BD-9, confirming\nits photometric selection from observations taken as part of the JWST Advanced\nDeep Extragalactic Survey (JADES) program. Fits to this spectrum indicate that\nthe brown dwarf has an effective temperature of 800-900K (T5 - T6) at a\ndistance of $1.8 - 2.3$kpc from the Sun, with evidence of the source being at\nlow metallicity ([M/H] $\\leq -0.5$). Finally, because of the cadence of JADES\nNIRCam observations of this source, we additionally uncover a proper motion\nbetween the 2022 and 2023 centroids, and we measure a proper motion of $20 \\pm\n4$ mas yr$^{-1}$ (a transverse velocity of 214 km s$^{-1}$ at 2.25 kpc). At\nthis predicted metallicity, distance, and transverse velocity, it is likely\nthat this source belongs either to the edge of the Milky Way thick disk or the\ngalactic halo. This spectral confirmation demonstrates the efficacy of\nphotometric selection of these important sources across deep extragalactic JWST\nimaging.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"eEZPT3WcLJ344-vsUnxKa29aLMqEyRXNvZnJ3CEVKdE","pdfSize":"2016529","objectId":"0x45b0b4ea837958e3d7c716cbdaf2920c0387812d666c518caef0d5b90af4ddd9","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
