{"id":"2407.11029","title":"A Geometric Framework for Adversarial Vulnerability in Machine Learning","authors":"Brian Bell","authorsParsed":[["Bell","Brian",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 11:01:15 GMT"}],"updateDate":"2024-07-17","timestamp":1720004475000,"abstract":"  This work starts with the intention of using mathematics to understand the\nintriguing vulnerability observed by ~\\citet{szegedy2013} within artificial\nneural networks. Along the way, we will develop some novel tools with\napplications far outside of just the adversarial domain. We will do this while\ndeveloping a rigorous mathematical framework to examine this problem. Our goal\nis to build out theory which can support increasingly sophisticated conjecture\nabout adversarial attacks with a particular focus on the so called ``Dimpled\nManifold Hypothesis'' by ~\\citet{shamir2021dimpled}. Chapter one will cover the\nhistory and architecture of neural network architectures. Chapter two is\nfocused on the background of adversarial vulnerability. Starting from the\nseminal paper by ~\\citet{szegedy2013} we will develop the theory of adversarial\nperturbation and attack.\n  Chapter three will build a theory of persistence that is related to Ricci\nCurvature, which can be used to measure properties of decision boundaries. We\nwill use this foundation to make a conjecture relating adversarial attacks.\nChapters four and five represent a sudden and wonderful digression that\nexamines an intriguing related body of theory for spatial analysis of neural\nnetworks as approximations of kernel machines and becomes a novel theory for\nrepresenting neural networks with bilinear maps. These heavily mathematical\nchapters will set up a framework and begin exploring applications of what may\nbecome a very important theoretical foundation for analyzing neural network\nlearning with spatial and geometric information. We will conclude by setting up\nour new methods to address the conjecture from chapter 3 in continuing\nresearch.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Cryptography and Security","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"f3MBV3s76EIhGfHrooY196fOqH71R3b_LVOTbVxqxRs","pdfSize":"17984783"}