{"id":"2407.12197","title":"Towards Interpretable Visuo-Tactile Predictive Models for Soft Robot\n  Interactions","authors":"Enrico Donato, Thomas George Thuruthel, Egidio Falotico","authorsParsed":[["Donato","Enrico",""],["Thuruthel","Thomas George",""],["Falotico","Egidio",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 21:46:04 GMT"},{"version":"v2","created":"Thu, 25 Jul 2024 12:49:12 GMT"}],"updateDate":"2024-07-26","timestamp":1721166364000,"abstract":"  Autonomous systems face the intricate challenge of navigating unpredictable\nenvironments and interacting with external objects. The successful integration\nof robotic agents into real-world situations hinges on their perception\ncapabilities, which involve amalgamating world models and predictive skills.\nEffective perception models build upon the fusion of various sensory modalities\nto probe the surroundings. Deep learning applied to raw sensory modalities\noffers a viable option. However, learning-based perceptive representations\nbecome difficult to interpret. This challenge is particularly pronounced in\nsoft robots, where the compliance of structures and materials makes prediction\neven harder. Our work addresses this complexity by harnessing a generative\nmodel to construct a multi-modal perception model for soft robots and to\nleverage proprioceptive and visual information to anticipate and interpret\ncontact interactions with external objects. A suite of tools to interpret the\nperception model is furnished, shedding light on the fusion and prediction\nprocesses across multiple sensory inputs after the learning phase. We will\ndelve into the outlooks of the perception model and its implications for\ncontrol purposes.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"RgYv9rNar48aF3Fz9fOFx5r3Z6NxwsiiNHHoeyaiWYA","pdfSize":"10040677","objectId":"0x023a0326d63c21c97a8bc0628310968e46e31130dbd5494721ca4b5c68715156","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
