{"id":"2407.13231","title":"A data-flow oriented software architecture for heterogeneous marine data\n  streams","authors":"Keila Lima, Ngoc-Thanh Nguyen, Rogardt Heldal, Lars Michael\n  Kristensen, Tosin Daniel Oyetoyan, Patrizio Pelliccione, Eric Knauss","authorsParsed":[["Lima","Keila",""],["Nguyen","Ngoc-Thanh",""],["Heldal","Rogardt",""],["Kristensen","Lars Michael",""],["Oyetoyan","Tosin Daniel",""],["Pelliccione","Patrizio",""],["Knauss","Eric",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 07:40:19 GMT"}],"updateDate":"2024-07-19","timestamp":1721288419000,"abstract":"  Marine in-situ data is collected by sensors mounted on fixed or mobile\nsystems deployed into the ocean. This type of data is crucial both for the\nocean industries and public authorities, e.g., for monitoring and forecasting\nthe state of marine ecosystems and/or climate changes. Various public\norganizations have collected, managed, and openly shared in-situ marine data in\nthe past decade. Recently, initiatives like the Ocean Decade Corporate Data\nGroup have incentivized the sharing of marine data of public interest from\nprivate companies aiding in ocean management. However, there is no clear\nunderstanding of the impact of data quality in the engineering of systems, as\nwell as on how to manage and exploit the collected data.\n  In this paper, we propose main architectural decisions and a data\nflow-oriented component and connector view for marine in-situ data streams. Our\nresults are based on a longitudinal empirical software engineering process, and\ndriven by knowledge extracted from the experts in the marine domain from public\nand private organizations, and challenges identified in the literature. The\nproposed software architecture is instantiated and exemplified in a prototype\nimplementation.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"yPTrasEIGsazWQKikVMPxAdRgn_TgDNgZmVdLOW8R-c","pdfSize":"420239"}