{"id":"2407.10179","title":"CLIP-Guided Networks for Transferable Targeted Attacks","authors":"Hao Fang, Jiawei Kong, Bin Chen, Tao Dai, Hao Wu, Shu-Tao Xia","authorsParsed":[["Fang","Hao",""],["Kong","Jiawei",""],["Chen","Bin",""],["Dai","Tao",""],["Wu","Hao",""],["Xia","Shu-Tao",""]],"versions":[{"version":"v1","created":"Sun, 14 Jul 2024 12:30:32 GMT"},{"version":"v2","created":"Mon, 22 Jul 2024 09:41:57 GMT"}],"updateDate":"2024-07-23","timestamp":1720960232000,"abstract":"  Transferable targeted adversarial attacks aim to mislead models into\noutputting adversary-specified predictions in black-box scenarios. Recent\nstudies have introduced \\textit{single-target} generative attacks that train a\ngenerator for each target class to generate highly transferable perturbations,\nresulting in substantial computational overhead when handling multiple classes.\n\\textit{Multi-target} attacks address this by training only one\nclass-conditional generator for multiple classes. However, the generator simply\nuses class labels as conditions, failing to leverage the rich semantic\ninformation of the target class. To this end, we design a \\textbf{C}LIP-guided\n\\textbf{G}enerative \\textbf{N}etwork with \\textbf{C}ross-attention modules\n(CGNC) to enhance multi-target attacks by incorporating textual knowledge of\nCLIP into the generator. Extensive experiments demonstrate that CGNC yields\nsignificant improvements over previous multi-target generative attacks, e.g., a\n21.46\\% improvement in success rate from ResNet-152 to DenseNet-121. Moreover,\nwe propose a masked fine-tuning mechanism to further strengthen our method in\nattacking a single class, which surpasses existing single-target methods.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"xCbK4cz25zqP3Fmqep0nsG4BPtIv-zcMdV4Jo--VWSo","pdfSize":"3316524","objectId":"0x85e9d78bdfc0fb22a2b3b8a8e8b03d7a5507f0564761ba208320472a39b25bfe","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
