{"id":"2407.15931","title":"Measuring 60-pc-scale Star Formation Rate of the Nearby Seyfert Galaxy\n  NGC 1068 with ALMA, HST, VLT/MUSE, and VLA","authors":"Yuzuki Nagashima, Toshiki Saito, Soh Ikarashi, Shuro Takano, Kouichiro\n  Nakanishi, Nanase Harada, Taku Nakajima, Akio Taniguchi, Tomoka Tosaki,\n  Kazuharu Bamba","authorsParsed":[["Nagashima","Yuzuki",""],["Saito","Toshiki",""],["Ikarashi","Soh",""],["Takano","Shuro",""],["Nakanishi","Kouichiro",""],["Harada","Nanase",""],["Nakajima","Taku",""],["Taniguchi","Akio",""],["Tosaki","Tomoka",""],["Bamba","Kazuharu",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 18:00:02 GMT"},{"version":"v2","created":"Thu, 25 Jul 2024 03:44:12 GMT"}],"updateDate":"2024-07-26","timestamp":1721671202000,"abstract":"  Star formation rate (SFR) is a fundamental parameter for describing galaxies\nand inferring their evolutionary course. HII regions yield the best measure of\ninstantaneous SFR in galaxies, although the derived SFR can have large\nuncertainties depending on tracers and assumptions. We present an SFR\ncalibration for the entire molecular gas disk of the nearby Seyfert galaxy NGC\n1068, based on our new high-sensitivity ALMA 100GHz continuum data at 55pc\n(=0.\"8) resolution in combination with the HST Pa{\\alpha} line data. In this\ncalibration, we account for the spatial variations of dust extinction, electron\ntemperature of HII regions, AGN contamination, and diffuse ionized gas (DIG)\nbased on publicly available multi-wavelength data. Especially, given the\nextended nature and the possible non-negligible contribution to the total SFR,\na careful consideration of DIG is essential. With a cross-calibration between\ntwo corrected ionized gas tracers (free-free continuum&Pa{\\alpha}), the total\nSFR of the NGC 1068 disk is estimated to be 3.2\\pm0.5 Msol/yr, one-third of the\nSFR without accounting for DIG (9.1\\pm1.4 Msol/yr). We confirmed high SFR\naround the southern bar-end and the corotation radius, which is consistent with\nthe previous SFR measurements. In addition, our total SFR exceeds the total SFR\nbased on 8{\\mu}m dust emission by a factor of 1.5. We attribute this\ndiscrepancy to the differences in the young stars at different stages of\nevolution traced by each tracer and their respective timescales. This study\nprovides an example to address the various uncertainties in conventional SFR\nmeasurements and their potential to lead to significant SFR miscalculations.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"dJmXqyHdkb0thG1Pug1SgC6Fc7yTQUq_xpOd65zF7_4","pdfSize":"11165738","objectId":"0x5e3b9e77d01179d29cd84e2e3aefcc0fa498a60a936ddaef2e8b31597cdcac4a","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
