{"id":"2407.07340","title":"FALFormer: Feature-aware Landmarks self-attention for Whole-slide Image\n  Classification","authors":"Doanh C. Bui, Trinh Thi Le Vuong, Jin Tae Kwak","authorsParsed":[["Bui","Doanh C.",""],["Vuong","Trinh Thi Le",""],["Kwak","Jin Tae",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 03:24:40 GMT"},{"version":"v2","created":"Thu, 11 Jul 2024 09:36:49 GMT"}],"updateDate":"2024-07-12","timestamp":1720581880000,"abstract":"  Slide-level classification for whole-slide images (WSIs) has been widely\nrecognized as a crucial problem in digital and computational pathology. Current\napproaches commonly consider WSIs as a bag of cropped patches and process them\nvia multiple instance learning due to the large number of patches, which cannot\nfully explore the relationship among patches; in other words, the global\ninformation cannot be fully incorporated into decision making. Herein, we\npropose an efficient and effective slide-level classification model, named as\nFALFormer, that can process a WSI as a whole so as to fully exploit the\nrelationship among the entire patches and to improve the classification\nperformance. FALFormer is built based upon Transformers and self-attention\nmechanism. To lessen the computational burden of the original self-attention\nmechanism and to process the entire patches together in a WSI, FALFormer\nemploys Nystr\\\"om self-attention which approximates the computation by using a\nsmaller number of tokens or landmarks. For effective learning, FALFormer\nintroduces feature-aware landmarks to enhance the representation power of the\nlandmarks and the quality of the approximation. We systematically evaluate the\nperformance of FALFormer using two public datasets, including CAMELYON16 and\nTCGA-BRCA. The experimental results demonstrate that FALFormer achieves\nsuperior performance on both datasets, outperforming the state-of-the-art\nmethods for the slide-level classification. This suggests that FALFormer can\nfacilitate an accurate and precise analysis of WSIs, potentially leading to\nimproved diagnosis and prognosis on WSIs.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"MJzv7dAiTu-EueyGB7KCh_tADEDmaP6VElPZ2x1SdS0","pdfSize":"3795457"}