{"id":"2407.18705","title":"Who Let the Guards Out: Visual Support for Patrolling Games","authors":"Mat\\v{e}j Lang, Adam \\v{S}t\\v{e}p\\'anek, R\\'obert Zvara, Vojt\\v{e}ch\n  \\v{R}eh\\'ak, Barbora Kozl\\'ikov\\'a","authorsParsed":[["Lang","Matěj",""],["Štěpánek","Adam",""],["Zvara","Róbert",""],["Řehák","Vojtěch",""],["Kozlíková","Barbora",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 12:41:34 GMT"}],"updateDate":"2024-07-29","timestamp":1721997694000,"abstract":"  Effective security patrol management is critical for ensuring safety in\ndiverse environments such as art galleries, airports, and factories. The\nbehavior of patrols in these situations can be modeled by patrolling games.\nThey simulate the behavior of the patrol and adversary in the building, which\nis modeled as a graph of interconnected nodes representing rooms. The designers\nof algorithms solving the game face the problem of analyzing complex graph\nlayouts with temporal dependencies. Therefore, appropriate visual support is\ncrucial for them to work effectively. In this paper, we present a novel tool\nthat helps the designers of patrolling games explore the outcomes of the\nproposed algorithms and approaches, evaluate their success rate, and propose\nmodifications that can improve their solutions. Our tool offers an intuitive\nand interactive interface, featuring a detailed exploration of patrol routes\nand probabilities of taking them, simulation of patrols, and other requested\nfeatures. In close collaboration with experts in designing patrolling games, we\nconducted three case studies demonstrating the usage and usefulness of our\ntool. The prototype of the tool, along with exemplary datasets, is available at\nhttps://gitlab.fi.muni.cz/formela/strategy-vizualizer.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"rCwBXX9Ivk3h9-n9e4sZUtgWnJi4u9kGWPcqryp1oE0","pdfSize":"7800494","objectId":"0x27cf8334a32643d10e4ff33831335b0f9b916da6be57684f9380f5f4c8a9758f","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
