{"id":"2407.13738","title":"Dissecting polytopes: Landau singularities and asymptotic expansions in\n  $2\\to 2$ scattering","authors":"Einan Gardi, Franz Herzog, Stephen Jones, Yao Ma","authorsParsed":[["Gardi","Einan",""],["Herzog","Franz",""],["Jones","Stephen",""],["Ma","Yao",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 17:45:11 GMT"}],"updateDate":"2024-09-20","timestamp":1721324711000,"abstract":"  Parametric representations of Feynman integrals have a key property: many,\nfrequently all, of the Landau singularities appear as endpoint divergences.\nThis leads to a geometric interpretation of the singularities as faces of\nNewton polytopes, which facilitates algorithmic evaluation by sector\ndecomposition and asymptotic expansion by the method of regions. Here we\nidentify cases where some singularities appear instead as pinches in parametric\nspace for general kinematics, and we then extend the applicability of sector\ndecomposition and the method of regions algorithms to such integrals, by\ndissecting the Newton polytope on the singular locus. We focus on $2\\to 2$\nmassless scattering, where we show that pinches in parameter space occur\nstarting from three loops in particular nonplanar graphs due to cancellation\nbetween terms of opposite sign in the second Symanzik polynomial. While the\naffected integrals cannot be evaluated by standard sector decomposition, we\nshow how they can be computed by first linearising the graph polynomial and\nthen splitting the integration domain at the singularity, so as to turn it into\nan endpoint divergence. Furthermore, we demonstrate that obtaining the correct\nasymptotic expansion of such integrals by the method of regions requires the\nintroduction of new regions, which can be systematically identified as facets\nof the dissected polytope. In certain instances, these hidden regions\nexclusively govern the leading power behaviour of the integral. In momentum\nspace, we find that in the on-shell expansion for wide-angle scattering the new\nregions are characterised by having two or more connected hard subgraphs, while\nin the Regge limit they are characterised by Glauber modes.\n","subjects":["Physics/High Energy Physics - Theory","Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"efMaMYwoQl0InK1xOlJLLEzqlxIrIJeVeqb-DZ5W6KE","pdfSize":"1441029"}