{"id":"2407.05689","title":"Ten Years of Teaching Empirical Software Engineering in the context of\n  Energy-efficient Software","authors":"Ivano Malavolta, Vincenzo Stoico, Patricia Lago","authorsParsed":[["Malavolta","Ivano",""],["Stoico","Vincenzo",""],["Lago","Patricia",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 07:44:49 GMT"}],"updateDate":"2024-07-09","timestamp":1720424689000,"abstract":"  In this chapter we share our experience in running ten editions of the Green\nLab course at the Vrije Universiteit Amsterdam, the Netherlands. The course is\ngiven in the Software Engineering and Green IT track of the Computer Science\nMaster program of the VU. The course takes place every year over a 2-month\nperiod and teaches Computer Science students the fundamentals of Empirical\nSoftware Engineering in the context of energy-efficient software. The\npeculiarity of the course is its research orientation: at the beginning of the\ncourse the instructor presents a catalog of scientifically relevant goals, and\neach team of students signs up for one of them and works together for 2 months\non their own experiment for achieving the goal. Each team goes over the classic\nsteps of an empirical study, starting from a precise formulation of the goal\nand research questions to context definition, selection of experimental\nsubjects and objects, definition of experimental variables, experiment\nexecution, data analysis, and reporting. Over the years, the course became\nwell-known within the Software Engineering community since it led to several\nscientific studies that have been published at various scientific conferences\nand journals. Also, students execute their experiments using\n\\textit{open-source tools}, which are developed and maintained by researchers\nand other students within the program, thus creating a virtuous community of\nlearners where students exchange ideas, help each other, and learn how to\ncollaboratively contribute to open-source projects in a safe environment.\n","subjects":["Computing Research Repository/Software Engineering","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"z7MmqSNLL6x6ALCUnOojjW9LgekJTHw-8BqaPyecqkI","pdfSize":"8487228"}