{"id":"2407.10940","title":"Quantum Control of an Oscillator with a Kerr-cat Qubit","authors":"Andy Z. Ding, Benjamin L. Brock, Alec Eickbusch, Akshay Koottandavida,\n  Nicholas E. Frattini, Rodrigo G. Cortinas, Vidul R. Joshi, Stijn J. de Graaf,\n  Benjamin J. Chapman, Suhas Ganjam, Luigi Frunzio, Robert J. Schoelkopf,\n  Michel H. Devoret","authorsParsed":[["Ding","Andy Z.",""],["Brock","Benjamin L.",""],["Eickbusch","Alec",""],["Koottandavida","Akshay",""],["Frattini","Nicholas E.",""],["Cortinas","Rodrigo G.",""],["Joshi","Vidul R.",""],["de Graaf","Stijn J.",""],["Chapman","Benjamin J.",""],["Ganjam","Suhas",""],["Frunzio","Luigi",""],["Schoelkopf","Robert J.",""],["Devoret","Michel H.",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 17:38:34 GMT"}],"updateDate":"2024-07-16","timestamp":1721065114000,"abstract":"  Bosonic codes offer a hardware-efficient strategy for quantum error\ncorrection by redundantly encoding quantum information in the large Hilbert\nspace of a harmonic oscillator. However, experimental realizations of these\ncodes are often limited by ancilla errors propagating to the encoded logical\nqubit during syndrome measurements. The Kerr-cat qubit has been proposed as an\nancilla for these codes due to its theoretically-exponential noise bias, which\nwould enable fault-tolerant error syndrome measurements, but the coupling\nrequired to perform these syndrome measurements has not yet been demonstrated.\nIn this work, we experimentally realize driven parametric coupling of a\nKerr-cat qubit to a high-quality-factor microwave cavity and demonstrate a gate\nset enabling universal quantum control of the cavity. We measure the\ndecoherence of the cavity in the presence of the Kerr-cat and discover excess\ndephasing due to heating of the Kerr-cat to excited states. By engineering\nfrequency-selective dissipation to counteract this heating, we are able to\neliminate this dephasing, thereby demonstrating a high on-off ratio of control.\nOur results pave the way toward using the Kerr-cat to fault-tolerantly measure\nerror syndromes of bosonic codes.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0O0kqjPEB_iN6TOy8JUO6F2unRl_qhzdcXP1BrbHp-k","pdfSize":"15751371"}