{"id":"2407.14596","title":"A kiloparsec-scale ordered magnetic field in a galaxy at z=5.6","authors":"Jianhang Chen, Enrique Lopez-Rodriguez, R. J. Ivison, James E. Geach,\n  Simon Dye, Xiaohui Liu, and George Bendo","authorsParsed":[["Chen","Jianhang",""],["Lopez-Rodriguez","Enrique",""],["Ivison","R. J.",""],["Geach","James E.",""],["Dye","Simon",""],["Liu","Xiaohui",""],["Bendo","George",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 18:00:02 GMT"}],"updateDate":"2024-07-23","timestamp":1721412002000,"abstract":"  Magnetic fields are prevalent on almost all astronomical scales, but their\nimportance in different systems and over cosmic time is yet to be understood.\nOur current knowledge on the evolution of magnetic fields is limited by scarce\nobservations in the distant Universe, where galaxies have recently been found\nto be more evolved than most of our model predictions. In this study, we\nconduct rest-frame 131 $\\mu$m full-polarisation ALMA observations of dust\nemission in a strongly lensed dusty star-forming galaxy, SPT0346-52, at z=5.6,\nwhen the Universe was only 1 Gyr old. Dust grains can become aligned with local\nmagnetic fields, resulting in the emission of linearly polarised thermal\ninfrared radiation. Our observations have revealed a median polarisation level\nof 0.9$\\pm$0.2 per cent with a variation of $\\pm$0.4 per cent across the\nregions with polarisation detection, similar to that of local starburst\ngalaxies. The polarised dust emission is patchy. It mostly overlaps with the [C\nII] emission at a velocity of about -150 km/s, and extends over 3 kiloparsecs\nwith a bimodal distribution in position angles. Our analysis indicates that the\nkpc-scale polarised dust is most likely aligned by the large-scale magnetic\nfields associated with a galaxy merger. If the ordered fields are confirmed to\nbe coherent, such early detection of large-scale magnetic fields favours an\nefficient formation of magnetic fields in primordial galaxies, which highlights\nthe importance of magnetic fields in mediating galaxy evolution over long\ncosmic timescales. Future surveys towards a wider galaxy population are\nnecessary to test the ubiquitousness of large-scale magnetic fields in early\ngalaxies.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/High Energy Astrophysical Phenomena","Physics/Plasma Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"t3NTw7OruN_TvmX_OytT8xQ00b_lVRaSYTK7uXC99jA","pdfSize":"1078170"}