{"id":"2407.03434","title":"Predicting solvation free energies for neutral molecules in any solvent\n  with openCOSMO-RS","authors":"Simon M\\\"uller, Thomas Nevolianis, Miquel Garcia-Rat\\'es, Christoph\n  Riplinger, Kai Leonhard, Irina Smirnova","authorsParsed":[["Müller","Simon",""],["Nevolianis","Thomas",""],["Garcia-Ratés","Miquel",""],["Riplinger","Christoph",""],["Leonhard","Kai",""],["Smirnova","Irina",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 18:27:18 GMT"}],"updateDate":"2024-07-08","timestamp":1720031238000,"abstract":"  The accurate prediction of solvation free energies is critical for\nunderstanding various phenomena in the liquid phase, including reaction rates,\nequilibrium constants, activity coefficients, and partition coefficients.\nDespite extensive research, precise prediction of solvation free energies\nremains challenging. In this study, we introduce openCOSMO-RS 24a, an improved\nversion of the open-source COSMO-RS model, capable of predicting solvation free\nenergies alongside other liquid-phase properties. We parameterize openCOSMO-RS\n24a using quantum chemical calculations from ORCA 6.0, leveraging a\ncomprehensive dataset that includes solvation free energies, partition\ncoefficients, and infinite dilution activity coefficients for various solutes\nand solvents at 25 {\\deg}C. Additionally, we develop a Quantitative\nStructure-Property Relationships model to predict molar volumes of the\nsolvents, an essential requirement for predicting solvation free energies from\nstructure alone. Our results show that openCOSMO-RS 24a achieves an average\nabsolute deviation of 0.45 kcal/mol for solvation free energies, 0.76 for\npartition coefficients, and 0.51 for infinite dilution activity coefficients,\ndemonstrating improvements over the previous openCOSMO-RS 22 parameterization\nand comparable results to COSMOtherm 24 TZVP. A new command line interface for\nopenCOSMO-RS 24a was developed which allows easy acces to the solvation energy\nmodel directly from within ORCA 6.0. This represents a significant advancement\nin the predictive modeling of solvation free energies and other solution-phase\nproperties, providing researchers with a robust tool for applications in\nchemical and materials science.\n","subjects":["Physics/Chemical Physics","Condensed Matter/Soft Condensed Matter","Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"kCmgzU1P9f4T-hUL8j4_AUy5p8dQomQNN6VPUnDlyuA","pdfSize":"1616500"}