{"id":"2407.21295","title":"Kinetic development of low-temperature propane oxidation in a\n  repetitively-pulsed nanosecond discharge","authors":"Zhenyang Li, Bo Yin, Qifu Lin, Yifei Zhu, Yun Wu","authorsParsed":[["Li","Zhenyang",""],["Yin","Bo",""],["Lin","Qifu",""],["Zhu","Yifei",""],["Wu","Yun",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 02:38:18 GMT"},{"version":"v2","created":"Tue, 6 Aug 2024 00:26:18 GMT"}],"updateDate":"2024-08-07","timestamp":1722393498000,"abstract":"  The kinetics of plasma assisted low temperature oxidation of C3H8O2Ar\nmixtures have been studied in a wide specific deposition energy with the help\nof nanosecond repetitively pulsed discharge. Two types of nanosecond pulsed\nplasma sources, the nanosecond capillary discharge (nCD) and dielectric barrier\ndischarge (DBD) combined with the synchrotron photoionization mass spectrometry\nare investigated. The electron impact reaction rate of propane dissociation and\nsome combustion chemical reactions rate constants are updated according to the\nnCD and DBD experiment results,and uncertainty of the reactions are analyzed in\ndetail. Compared to the existing model, the updated model's prediction accuracy\nhas great improvement in species H2O, CO, CO2, CH4, CH2O, CH3OH, C2H2, C2H4,\nC2H6, C2H5OH, C2H5OOH, C3H4-A, C3H4-P, C2H5CHO, i-C3H7OH and C3H7OOH. The\npropane oxidation processes assisted by DBD and nCD were compared under\ndifferent single pulse deposition energy (SPDE) conditions while maintaining\nthe same total deposition energy. The reduced electric field in nCD is\nconcentrated at 150-200 Td and 450-500 Td, whereas in DBD it ranges from 0-25\nTd and 50-250 Td. Notably, SPDE shows minimal influence on the propane\noxidation process, which is primarily controlled by total deposition energy and\ndemonstrates little dependence on the discharge type (DBD or nCD).\n","subjects":["Physics/Plasma Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ymh0kYMtS72CUH5lpzRr_qiBdzNojEYSsNDSPbYwDqY","pdfSize":"3994451"}