{"id":"2407.07007","title":"Generative models of astrophysical fields with scattering transforms on\n  the sphere","authors":"Louise Mousset, Erwan Allys, Matthew A. Price, Jonathan Aumont,\n  Jean-Marc Delouis, Ludovic Montier, Jason D. McEwen","authorsParsed":[["Mousset","Louise",""],["Allys","Erwan",""],["Price","Matthew A.",""],["Aumont","Jonathan",""],["Delouis","Jean-Marc",""],["Montier","Ludovic",""],["McEwen","Jason D.",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 16:21:29 GMT"}],"updateDate":"2024-07-10","timestamp":1720542089000,"abstract":"  Scattering transforms are a new type of summary statistics recently developed\nfor the study of highly non-Gaussian processes, which have been shown to be\nvery promising for astrophysical studies. In particular, they allow one to\nbuild generative models of complex non-linear fields from a limited amount of\ndata, and have also been used as the basis of new statistical component\nseparation algorithms. In the context of upcoming cosmological surveys, such as\nLiteBIRD for the cosmic microwave background polarization or Rubin-LSST and\nEuclid for study of the large scale structures of the Universe, the extension\nof these tools to spherical data is necessary. We develop scattering transforms\non the sphere and focus on the construction of maximum-entropy generative\nmodels of several astrophysical fields. We construct, from a single target\nfield, generative models of homogeneous astrophysical and cosmological fields,\nwhose samples are quantitatively compared to the target fields using common\nstatistics (power spectrum, pixel probability density function and Minkowski\nfunctionals). Our sampled fields agree well with the target fields, both\nstatistically and visually. These generative models therefore open up a wide\nrange of new applications for future astrophysical and cosmological studies;\nparticularly those for which very little simulated data is available. We make\nour code available to the community so that this work can be easily reproduced\nand developed further.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"37dnPSpWXUZc_0BfN6iazXoVfRQ_8G2eDUmnKsoI6PU","pdfSize":"3198380"}