{"id":"2407.17124","title":"Twist-tunable spin control in twisted bilayer bismuthene","authors":"Ludovica Zullo, Domenico Ninno, Giovanni Cantele","authorsParsed":[["Zullo","Ludovica",""],["Ninno","Domenico",""],["Cantele","Giovanni",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 09:48:30 GMT"}],"updateDate":"2024-07-25","timestamp":1721814510000,"abstract":"  Twisted bilayer structures have emerged as a fascinating arena in condensed\nmatter thanks to their highly tunable physics. The role of spin-orbit coupling\n(SOC) in twisted bilayers has gained increasing attention due to its potential\nfor spintronics. Thus, it is appealing to propose new materials for\nconstructing twisted bilayers with substantial SOC. In this work, the\nintriguing effects induced by twisting two layers of two-dimensional bismuthene\nare unraveled from large-scale first-principles calculations. We show that\nspin-orbit coupling significantly affects the electronic properties of twisted\nbilayer bismuthene, even more than in its untwisted counterpart. We carefully\ninvestigate how the interplay between the spin-orbit coupling and the twist\nangle impacts the band structure and spin textures of twisted bilayer\nbismuthene. We find that the twist angle can be deemed a control knob to switch\nfrom a small-gap semiconductor to a metallic behavior. Most crucially, the\naccurate analysis of the energy bands close to Fermi energy reveals a\ntwist-tunable splitting in the mexican-hat shape of the bands that can\notherwise be obtained only by applying enormous electric fields. Our\npredictions provide insight into innovative bismuth-based technologies for\nfuture spintronic devices.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"fZJbE0vKO7VedJf7qHef2WER_ztC_vz3RTERq2OFXT0","pdfSize":"2990155","objectId":"0x1c1c8311b4b6e80e1182e804686dea4cfddcda3dff6fb7dfd40f73a0a5ff7d18","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
