{"id":"2407.00232","title":"On the Inorrect Use of Application Efficiency to Calculate Performance\n  Portability","authors":"Ami Marowka","authorsParsed":[["Marowka","Ami",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 21:04:32 GMT"},{"version":"v2","created":"Sat, 6 Jul 2024 20:38:26 GMT"}],"updateDate":"2024-07-09","timestamp":1719608672000,"abstract":"  The emergence of heterogeneity in high-performance computing, which harnesses\nunder one integrated system several platforms of different architectures, also\nled to the development of innovative cross-platform programming models. Along\nwith the expectation that these models will yield computationally intensive\nperformance, there is demand for them to provide a reasonable degree of\nperformance portability. Therefore, new tools and metrics are being developed\nto measure and calculate the level of performance portability of applications\nand programming models. The ultimate measure of performance portability is\nperformance efficiency. Performance efficiency refers to the achieved\nperformance as a fraction of some peak theoretical or practical baseline\nperformance. Application efficiency approaches are the most popular and\nattractive performance efficiency measures among researchers because they are\nsimple to measure and calculate. Unfortunately, the way they are used yields\nresults that do not make sense, while violating one of the basic criteria that\ndefines and characterizes the performance portability metrics. In this paper,\nwe demonstrate how researchers currently use application efficiency to\ncalculate the performance portability of applications and explain why this\nmethod deviates from its original definition. Then, we show why the obtained\nresults do not make sense and propose practical solutions that satisfy the\ndefinition and criteria of performance portability metrics.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"n9LApjuKuWDW_Q4xy3KUDdgFPlFCLOlgTOh8dWWc478","pdfSize":"160064","objectId":"0xc57e462ed993f38906e6956295c8f689497acac9e1da8e43859c0dc7d3fc1107","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
