{"id":"2407.18086","title":"Revealing urban area from mobile positioning data","authors":"Gerg\\H{o} Pint\\'er","authorsParsed":[["Pintér","Gergő",""]],"versions":[{"version":"v1","created":"Thu, 25 Jul 2024 14:49:12 GMT"}],"updateDate":"2024-07-26","timestamp":1721918952000,"abstract":"  Researchers face the trade-off between publishing mobility data along with\ntheir papers while simultaneously protecting the privacy of the individuals. In\naddition to the fundamental anonymization process, other techniques, such as\nspatial discretization and, in certain cases, location concealing or complete\nremoval, are applied to achieve these dual objectives. The primary research\nquestion is whether concealing the observation area is an adequate form of\nprotection or whether human mobility patterns in urban areas are inherently\nrevealing of location. The characteristics of the mobility data, such as the\nnumber of activity records or the number of unique users in a given spatial\nunit, reveal the silhouette of the urban landscape, which can be used to infer\nthe identity of the city in question. It was demonstrated that even without\ndisclosing the exact location, the patterns of human mobility can still reveal\nthe urban area from which the data was collected. The presented locating method\nwas tested on other cities using different open data sets and against coarser\nspatial discretization units. While publishing mobility data is essential for\nresearch, it was demonstrated that concealing the observation area is\ninsufficient to prevent the identification of the urban area. Furthermore,\nusing larger discretization units alone is an ineffective solution to the\nproblem of the observation area re-identification. Instead of obscuring the\nobservation area, noise should be added to the trajectories to prevent user\nidentification.\n","subjects":["Computing Research Repository/Social and Information Networks","Physics/Physics and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"WlEZwQpQQlTZ7PGbtTSgYb9SpI1kig67-rTfpWLmFhI","pdfSize":"13040352"}