{"id":"2407.00077","title":"Differentially Private Graph Diffusion with Applications in Personalized\n  PageRanks","authors":"Rongzhe Wei, Eli Chien, Pan Li","authorsParsed":[["Wei","Rongzhe",""],["Chien","Eli",""],["Li","Pan",""]],"versions":[{"version":"v1","created":"Sat, 22 Jun 2024 15:32:53 GMT"},{"version":"v2","created":"Tue, 2 Jul 2024 02:06:17 GMT"}],"updateDate":"2024-07-03","timestamp":1719070373000,"abstract":"  Graph diffusion, which iteratively propagates real-valued substances among\nthe graph, is used in numerous graph/network-involved applications. However,\nreleasing diffusion vectors may reveal sensitive linking information in the\ndata such as transaction information in financial network data. However,\nprotecting the privacy of graph data is challenging due to its interconnected\nnature. This work proposes a novel graph diffusion framework with edge-level\ndifferential privacy guarantees by using noisy diffusion iterates. The\nalgorithm injects Laplace noise per diffusion iteration and adopts a\ndegree-based thresholding function to mitigate the high sensitivity induced by\nlow-degree nodes. Our privacy loss analysis is based on Privacy Amplification\nby Iteration (PABI), which to our best knowledge, is the first effort that\nanalyzes PABI with Laplace noise and provides relevant applications. We also\nintroduce a novel Infinity-Wasserstein distance tracking method, which tightens\nthe analysis of privacy leakage and makes PABI more applicable in practice. We\nevaluate this framework by applying it to Personalized Pagerank computation for\nranking tasks. Experiments on real-world network data demonstrate the\nsuperiority of our method under stringent privacy conditions.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Cryptography and Security","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ZHpNz2cufrzlya8hPQ9CWIEYot7T0H31C_cDrRB5ZwU","pdfSize":"1436482"}