{"id":"2407.12646","title":"The role of precursor coverage in the synthesis and substrate transfer\n  of graphene nanoribbons","authors":"Rimah Darawish, Oliver Braun, Klaus Muellen, Michel Calame, Pascal\n  Ruffieux, Roman Fasel and Gabriela Borin Barin","authorsParsed":[["Darawish","Rimah",""],["Braun","Oliver",""],["Muellen","Klaus",""],["Calame","Michel",""],["Ruffieux","Pascal",""],["Fasel","Roman",""],["Barin","Gabriela Borin",""]],"versions":[{"version":"v1","created":"Wed, 17 Jul 2024 15:15:49 GMT"}],"updateDate":"2024-07-18","timestamp":1721229349000,"abstract":"  Graphene nanoribbons (GNRs) with atomically precise widths and edge\ntopologies have well-defined band gaps that depend on ribbon dimensions, making\nthem ideal for room-temperature switching applications like field-effect\ntransistors (FETs). For efficient device integration, it is crucial to optimize\ngrowth conditions to maximize GNR length and, consequently, device yield. Here,\nwe investigate the growth and alignment of 9-atom-wide armchair graphene\nnanoribbons (9-AGNRs) on a vicinal gold substrate, Au(788), with varying\nmolecular precursor doses (PD) and, therefore, different resulting GNR\ncoverages. Our investigation reveals that GNR growth location on the Au(788)\nsubstrate is coverage-dependent. Furthermore, scanning tunneling microscopy\nshows a strong correlation between the GNR length evolution and both the PD and\nthe GNR growth location on the substrate. Employing Raman spectroscopy, we\nanalyze samples with eight different PDs on Au(788). We find that GNR alignment\nimproves with length, achieving near-perfect alignment with an average GNR\nlength of ~40 nm for GNRs growing solely at Au(788) step edges. To fully\nexploit GNR properties in device architectures, GNRs need to be transferred\nfrom the gold to semiconducting or insulating substrates. Upon substrate\ntransfer, samples with higher PD present systematically better alignment\npreservation and less surface disorder, which we attribute to reduced GNR\nmobility during the transfer process. PD also affects the substrate transfer\nsuccess rate, with higher success rates observed for samples with higher GNR\ncoverages (77%) compared to those with lower GNR coverages (53%). Our findings\ncharacterize the important relationship between precursor dose, GNR length,\nalignment quality, and surface disorder during GNR growth and upon substrate\ntransfer, offering crucial insights for the further development of GNR-based\nnanoelectronic devices.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"PNp-QhosfbsrDj53nF6zmzRxwBsOqyNT-VmyjQelI0E","pdfSize":"1712276"}