{"id":"2407.15882","title":"Evaluation of deep learning models for Australian climate extremes:\n  prediction of streamflow and floods","authors":"Siddharth Khedkar, R. Willem Vervoort, Rohitash Chandra","authorsParsed":[["Khedkar","Siddharth",""],["Vervoort","R. Willem",""],["Chandra","Rohitash",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 23:45:04 GMT"}],"updateDate":"2024-07-24","timestamp":1721519104000,"abstract":"  In recent years, climate extremes such as floods have created significant\nenvironmental and economic hazards for Australia, causing damage to the\nenvironment and economy and losses of human and animal lives. An efficient\nmethod of forecasting floods is crucial to limit this damage. Techniques for\nflood prediction are currently based on hydrological, and hydrodynamic\n(physically-based) numerical models. Machine learning methods that include deep\nlearning offer certain advantages over conventional physically based\napproaches, including flexibility and accuracy. Deep learning methods have been\npromising for predicting small to medium-sized climate extreme events over a\nshort time horizon; however, large flooding events present a critical\nchallenge. We present an ensemble-based machine learning approach that\naddresses large-scale extreme flooding challenges using a switching mechanism\nmotivated by extreme-value theory for long-short-term-memory (LSTM) deep\nlearning models. We use a multivariate and multi-step time-series prediction\napproach to predict streamflow for multiple days ahead in the major catchments\nof Australia. The ensemble framework also employs static information to enrich\nthe time-series information, allowing for regional modelling across catchments.\nOur results demonstrate enhanced prediction of streamflow extremes, with\nnotable efficacy for large flooding scenarios in the selected Australian\ncatchments. Through comparative analysis, our methodology underscores the\npotential for deep learning models to revolutionise flood forecasting across\ndiverse regions.\n","subjects":["Computing Research Repository/Machine Learning","Physics/Atmospheric and Oceanic Physics","Statistics/Applications","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"eIB2xE2vmHLMw5dyRNHb1Ph_Za16f7e-PNUZCz2tZ-A","pdfSize":"1087625"}