{"id":"2407.20717","title":"Understanding the Impact of Synchronous, Asynchronous, and Hybrid\n  In-Situ Techniques in Computational Fluid Dynamics Applications","authors":"Yi Ju, Adalberto Perez, Stefano Markidis, Philipp Schlatter, Erwin\n  Laure","authorsParsed":[["Ju","Yi",""],["Perez","Adalberto",""],["Markidis","Stefano",""],["Schlatter","Philipp",""],["Laure","Erwin",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 10:24:25 GMT"}],"updateDate":"2024-07-31","timestamp":1722335065000,"abstract":"  High-Performance Computing (HPC) systems provide input/output (IO)\nperformance growing relatively slowly compared to peak computational\nperformance and have limited storage capacity. Computational Fluid Dynamics\n(CFD) applications aiming to leverage the full power of Exascale HPC systems,\nsuch as the solver Nek5000, will generate massive data for further processing.\nThese data need to be efficiently stored via the IO subsystem. However, limited\nIO performance and storage capacity may result in performance, and thus\nscientific discovery, bottlenecks. In comparison to traditional post-processing\nmethods, in-situ techniques can reduce or avoid writing and reading the data\nthrough the IO subsystem, promising to be a solution to these problems. In this\npaper, we study the performance and resource usage of three in-situ use cases:\ndata compression, image generation, and uncertainty quantification. We\nfurthermore analyze three approaches when these in-situ tasks and the\nsimulation are executed synchronously, asynchronously, or in a hybrid manner.\nIn-situ compression can be used to reduce the IO time and storage requirements\nwhile maintaining data accuracy. Furthermore, in-situ visualization and\nanalysis can save Terabytes of data from being routed through the IO subsystem\nto storage. However, the overall efficiency is crucially dependent on the\ncharacteristics of both, the in-situ task and the simulation. In some cases,\nthe overhead introduced by the in-situ tasks can be substantial. Therefore, it\nis essential to choose the proper in-situ approach, synchronous, asynchronous,\nor hybrid, to minimize overhead and maximize the benefits of concurrent\nexecution.\n","subjects":["Computing Research Repository/Performance","Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"4bZzjQFyQEu8RqO-l-5d44TjwXBJXy0K-glPpwquAEc","pdfSize":"2178436","objectId":"0xca032289fc281555ad203e1a9a249c9bc79fdc5545e966dccda0dc8cb6ee8410","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
