{"id":"2407.11026","title":"Precise and Efficient Orbit Prediction in LEO with Machine Learning\n  using Exogenous Variables","authors":"Francisco Caldas, Cl\\'audia Soares","authorsParsed":[["Caldas","Francisco",""],["Soares","Cláudia",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 07:12:33 GMT"},{"version":"v2","created":"Sat, 27 Jul 2024 22:07:42 GMT"}],"updateDate":"2024-07-30","timestamp":1719990753000,"abstract":"  The increasing volume of space objects in Earth's orbit presents a\nsignificant challenge for Space Situational Awareness (SSA). And in particular,\naccurate orbit prediction is crucial to anticipate the position and velocity of\nspace objects, for collision avoidance and space debris mitigation. When\nperforming Orbit Prediction (OP), it is necessary to consider the impact of\nnon-conservative forces, such as atmospheric drag and gravitational\nperturbations, that contribute to uncertainty around the future position of\nspacecraft and space debris alike. Conventional propagator methods like the\nSGP4 inadequately account for these forces, while numerical propagators are\nable to model the forces at a high computational cost. To address these\nlimitations, we propose an orbit prediction algorithm utilizing machine\nlearning. This algorithm forecasts state vectors on a spacecraft using past\npositions and environmental variables like atmospheric density from external\nsources. The orbital data used in the paper is gathered from precision\nephemeris data from the International Laser Ranging Service (ILRS), for the\nperiod of almost a year. We show how the use of machine learning and\ntime-series techniques can produce low positioning errors at a very low\ncomputational cost, thus significantly improving SSA capabilities by providing\nfaster and reliable orbit determination for an ever increasing number of space\nobjects.\n","subjects":["Computing Research Repository/Machine Learning","Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"GDJbbPyaLuj_tp4eTtXnhj0bKK29Div2xgII47kP2SU","pdfSize":"1658694"}