{"id":"2407.17329","title":"Low dimensional representation of multi-patient flow cytometry datasets\n  using optimal transport for minimal residual disease detection in leukemia","authors":"Erell Gachon, J\\'er\\'emie Bigot, Elsa Cazelles, Aguirre Mimoun,\n  Jean-Philippe Vial","authorsParsed":[["Gachon","Erell",""],["Bigot","Jérémie",""],["Cazelles","Elsa",""],["Mimoun","Aguirre",""],["Vial","Jean-Philippe",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 14:53:01 GMT"}],"updateDate":"2024-07-25","timestamp":1721832781000,"abstract":"  Representing and quantifying Minimal Residual Disease (MRD) in Acute Myeloid\nLeukemia (AML), a type of cancer that affects the blood and bone marrow, is\nessential in the prognosis and follow-up of AML patients. As traditional\ncytological analysis cannot detect leukemia cells below 5\\%, the analysis of\nflow cytometry dataset is expected to provide more reliable results. In this\npaper, we explore statistical learning methods based on optimal transport (OT)\nto achieve a relevant low-dimensional representation of multi-patient flow\ncytometry measurements (FCM) datasets considered as high-dimensional\nprobability distributions. Using the framework of OT, we justify the use of the\nK-means algorithm for dimensionality reduction of multiple large-scale point\nclouds through mean measure quantization by merging all the data into a single\npoint cloud. After this quantization step, the visualization of the intra and\ninter-patients FCM variability is carried out by embedding low-dimensional\nquantized probability measures into a linear space using either Wasserstein\nPrincipal Component Analysis (PCA) through linearized OT or log-ratio PCA of\ncompositional data. Using a publicly available FCM dataset and a FCM dataset\nfrom Bordeaux University Hospital, we demonstrate the benefits of our approach\nover the popular kernel mean embedding technique for statistical learning from\nmultiple high-dimensional probability distributions. We also highlight the\nusefulness of our methodology for low-dimensional projection and clustering\npatient measurements according to their level of MRD in AML from FCM. In\nparticular, our OT-based approach allows a relevant and informative\ntwo-dimensional representation of the results of the FlowSom algorithm, a\nstate-of-the-art method for the detection of MRD in AML using multi-patient\nFCM.\n","subjects":["Statistics/Machine Learning","Computing Research Repository/Machine Learning","Mathematics/Statistics Theory","Statistics/Methodology","Statistics/Statistics Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"YUACjH1Slx0BLf-s2Hacd0IRYYMyPWhbVwDFtR-DY_4","pdfSize":"1015082"}