{"id":"2407.15962","title":"Spontaneous and impulsive stimulated Raman scattering from two-magnon\n  modes in a cubic antiferromagnet","authors":"Anatolii E. Fedianin, Alexandra M. Kalashnikova, and Johan H. Mentink","authorsParsed":[["Fedianin","Anatolii E.",""],["Kalashnikova","Alexandra M.",""],["Mentink","Johan H.",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 18:23:39 GMT"}],"updateDate":"2024-07-24","timestamp":1721672619000,"abstract":"  Exchange interactions govern the ordering between microscopic spins and the\nhighest-frequency spin excitations - magnons at the edge of the Brillouin zone.\nAs well known from spontaneous Raman scattering (RS) experiments in\nantiferromagnets, such magnons couple to light in the form of two-magnon modes\n- pairs of magnon with opposite wavevectors. Experimental works on two-magnon\nmodes driven by exchange perturbation in impulsive stimulated Raman scattering\n(ISRS) experiment posed a question about consistency between spin dynamics\nmeasured in the ISRS and RS experiments. Here, based on an extended spin\ncorrelation pseudovector formalism, we derive the analytical expression for\nobservables in both types of experiments to determine a possibly fundamental\ndifferences between the detected two-magnon spectra. We find that in both cases\nthe magnons from the edge of the Brillouin zone give the largest contribution\nto the measured spectra. However, there is the difference in the spectra which\nstems from the fact that RS probes population of a continuum of incoherent\nmodes, while in the case of impulsively driven modes, they are coherent and\ntheir phase and amplitudes are detected. We show that for the continuum of\nmodes, the sensitivity to the phase results in a relative shift of the main\npeaks in the two spectra, and the spectrum of the ISRS is significantly\nbroadened and extends to the range above the maximum two-magnon mode frequency.\nFormally, this is manifested in the fact, that the RS is described by an\nimaginary part of the Green function only, while the ISRS is described by the\nabsolute value and hence additionally carries information about the real part\nof the Green function. We further derive two-magnon Raman tensor dispersion and\nthe weighting factors, which define the features of the coupling to light of\nthe modes from the different domains in the Brillouin zone.\n","subjects":["Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Jt14H93ZFS8dx3NmbNsuSDhpFNPS_BjARfyPQyA-uV8","pdfSize":"989406"}