{"id":"2407.11149","title":"BMR and BWR: Two simple metaphor-free optimization algorithms for\n  solving real-life non-convex constrained and unconstrained problems","authors":"Ravipudi Venkata Rao, Ravikumar shah","authorsParsed":[["Rao","Ravipudi Venkata",""],["shah","Ravikumar",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 18:11:47 GMT"},{"version":"v2","created":"Sun, 8 Sep 2024 07:36:59 GMT"}],"updateDate":"2024-09-10","timestamp":1721067107000,"abstract":"  Two simple yet powerful optimization algorithms, named the Best-Mean-Random\n(BMR) and Best-Worst-Random (BWR) algorithms, are developed and presented in\nthis paper to handle both constrained and unconstrained optimization problems.\nThese algorithms are free of metaphors and algorithm-specific parameters. The\nBMR algorithm is based on the best, mean, and random solutions of the\npopulation generated for solving a given problem, and the BWR algorithm is\nbased on the best, worst, and random solutions. The performances of the\nproposed two algorithms are investigated by implementing them on 26 real-life\nnonconvex constrained optimization problems given in the Congress on\nEvolutionary Computation (CEC) 2020 competition, and comparisons are made with\nthose of the other prominent optimization algorithms. The performances on 12\nconstrained engineering problems are also investigated, and the results are\ncompared with those of very recent algorithms (in some cases, compared with\nmore than 30 algorithms). Furthermore, computational experiments are conducted\non 30 unconstrained standard benchmark optimization problems, including 5\nrecently developed benchmark problems with distinct characteristics. The\nresults demonstrated the superior competitiveness and superiority of the\nproposed simple algorithms. The optimization research community may gain an\nadvantage by adapting these algorithms to solve various constrained and\nunconstrained real-life optimization problems across various scientific and\nengineering disciplines. The codes of the BMR and BWR algorithms are available\nat\nhttps://sites.google.com/view/bmr-bwr-optimization-algorithm/home?authuser=0.\n","subjects":["Computing Research Repository/Neural and Evolutionary Computing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Drpz-NIO4t6qXe0X2baUMlaa-0ALZ6qDrRKO09lKMdI","pdfSize":"3991742"}