{"id":"2407.10701","title":"DOCBENCH: A Benchmark for Evaluating LLM-based Document Reading Systems","authors":"Anni Zou, Wenhao Yu, Hongming Zhang, Kaixin Ma, Deng Cai, Zhuosheng\n  Zhang, Hai Zhao, Dong Yu","authorsParsed":[["Zou","Anni",""],["Yu","Wenhao",""],["Zhang","Hongming",""],["Ma","Kaixin",""],["Cai","Deng",""],["Zhang","Zhuosheng",""],["Zhao","Hai",""],["Yu","Dong",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 13:17:42 GMT"}],"updateDate":"2024-07-16","timestamp":1721049462000,"abstract":"  Recently, there has been a growing interest among large language model (LLM)\ndevelopers in LLM-based document reading systems, which enable users to upload\ntheir own documents and pose questions related to the document contents, going\nbeyond simple reading comprehension tasks. Consequently, these systems have\nbeen carefully designed to tackle challenges such as file parsing, metadata\nextraction, multi-modal information understanding and long-context reading.\nHowever, no current benchmark exists to evaluate their performance in such\nscenarios, where a raw file and questions are provided as input, and a\ncorresponding response is expected as output. In this paper, we introduce\nDocBench, a new benchmark designed to evaluate LLM-based document reading\nsystems. Our benchmark involves a meticulously crafted process, including the\nrecruitment of human annotators and the generation of synthetic questions. It\nincludes 229 real documents and 1,102 questions, spanning across five different\ndomains and four major types of questions. We evaluate both proprietary\nLLM-based systems accessible via web interfaces or APIs, and a parse-then-read\npipeline employing open-source LLMs. Our evaluations reveal noticeable gaps\nbetween existing LLM-based document reading systems and human performance,\nunderscoring the challenges of developing proficient systems. To summarize,\nDocBench aims to establish a standardized benchmark for evaluating LLM-based\ndocument reading systems under diverse real-world scenarios, thereby guiding\nfuture advancements in this research area.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"BuxofGVdEc4THWyos38oO23kAHVzaICU9oEtDm8KocA","pdfSize":"19478554"}