{"id":"2407.08336","title":"Inferring the iron K emissivity profiles of accretion discs irradiated\n  by extended coronae","authors":"Wenda Zhang, Michal Dov\\v{c}iak, Michal Bursa, Ji\\v{r}\\'i Svoboda,\n  Vladim\\'ir Karas","authorsParsed":[["Zhang","Wenda",""],["Dovčiak","Michal",""],["Bursa","Michal",""],["Svoboda","Jiří",""],["Karas","Vladimír",""]],"versions":[{"version":"v1","created":"Thu, 11 Jul 2024 09:37:30 GMT"}],"updateDate":"2024-07-12","timestamp":1720690650000,"abstract":"  One of the most promising methods to measure the spin of an accreting black\nhole is fitting the broad iron K$\\alpha$ line in the X-ray spectrum. The line\nprofile also depends on the geometry of the hard X-ray emitting corona. To put\nconstraints on the black hole spin and corona geometry, it is essential to\nunderstand how do they affect the iron K$\\alpha$ line emissivity profile. In\nthis work, we present calculations of the illumination and the iron K$\\alpha$\nemissivity profiles performed with the Monte-Carlo GR radiative transfer code\nMonk. We focus on distinction between the illumination and emissivity profiles,\nwhich is in most previous studies neglected. We show that especially for the\ncase of black hole X-ray binaries (BHXRBs), the difference is very large. For\nactive galactic nuclei (AGNs), the emissivity profile has a more similar shape\nas the illumination profile, but it is notably steeper in the innermost region\nwithin a few gravitational radii. We find out that the different behavior\nbetween AGN and black hole X-ray binary discs is due to the different energy\nspectra of the illuminating radiation. This suggests that the emissivity\nprofile of the iron K$\\alpha$ line cannot be determined by black hole spin and\ncorona geometry alone and the energy spectrum of the illuminating radiation has\nto be taken into account. We also examined the effect of including the\nself-irradiation, and find it to be more important than the corona emission in\nBHXRBs.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7rQ0MjKa690HcH9lUDcssowlXv_hO4KHNoui_j48sis","pdfSize":"826631","objectId":"0xb4ada23e58fe528ac299c28423e1bc41dcbf4a318c44639c6bd98fd12a9a333c","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
