{"id":"2407.19119","title":"Accuracy-Privacy Trade-off in the Mitigation of Membership Inference\n  Attack in Federated Learning","authors":"Sayyed Farid Ahamed, Soumya Banerjee, Sandip Roy, Devin Quinn, Marc\n  Vucovich, Kevin Choi, Abdul Rahman, Alison Hu, Edward Bowen, and Sachin\n  Shetty","authorsParsed":[["Ahamed","Sayyed Farid",""],["Banerjee","Soumya",""],["Roy","Sandip",""],["Quinn","Devin",""],["Vucovich","Marc",""],["Choi","Kevin",""],["Rahman","Abdul",""],["Hu","Alison",""],["Bowen","Edward",""],["Shetty","Sachin",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 22:44:41 GMT"}],"updateDate":"2024-07-30","timestamp":1722033881000,"abstract":"  Over the last few years, federated learning (FL) has emerged as a prominent\nmethod in machine learning, emphasizing privacy preservation by allowing\nmultiple clients to collaboratively build a model while keeping their training\ndata private. Despite this focus on privacy, FL models are susceptible to\nvarious attacks, including membership inference attacks (MIAs), posing a\nserious threat to data confidentiality. In a recent study, Rezaei \\textit{et\nal.} revealed the existence of an accuracy-privacy trade-off in deep ensembles\nand proposed a few fusion strategies to overcome it. In this paper, we aim to\nexplore the relationship between deep ensembles and FL. Specifically, we\ninvestigate whether confidence-based metrics derived from deep ensembles apply\nto FL and whether there is a trade-off between accuracy and privacy in FL with\nrespect to MIA. Empirical investigations illustrate a lack of a non-monotonic\ncorrelation between the number of clients and the accuracy-privacy trade-off.\nBy experimenting with different numbers of federated clients, datasets, and\nconfidence-metric-based fusion strategies, we identify and analytically justify\nthe clear existence of the accuracy-privacy trade-off.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"xGp_TISzlQEh7I4hHx1QwVrGRggHwEtt_D0kqIjD0So","pdfSize":"1343493"}