{"id":"2407.06367","title":"The Path-Label Reconciliation (PLR) Dissimilarity Measure for Gene Trees","authors":"Alitzel L\\'opez S\\'anchez, Jos\\'e Antonio Ram\\'irez-Rafael, Alejandro\n  Flores-Lamas, Maribel Hern\\'andez-Rosales, Manuel Lafond","authorsParsed":[["Sánchez","Alitzel López",""],["Ramírez-Rafael","José Antonio",""],["Flores-Lamas","Alejandro",""],["Hernández-Rosales","Maribel",""],["Lafond","Manuel",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 20:19:11 GMT"}],"updateDate":"2024-07-10","timestamp":1720469951000,"abstract":"  In this study, we investigate the problem of comparing gene trees reconciled\nwith the same species tree using a novel semi-metric, called the Path-Label\nReconciliation (PLR) dissimilarity measure. This approach not only quantifies\ndifferences in the topology of reconciled gene trees, but also considers\ndiscrepancies in predicted ancestral gene-species maps and\nspeciation/duplication events, offering a refinement of existing metrics such\nas Robinson-Foulds (RF) and their labeled extensions LRF and ELRF. A tunable\nparameter {\\alpha} also allows users to adjust the balance between its species\nmap and event labeling components. We show that PLR can be computed in linear\ntime and that it is a semi-metric. We also discuss the diameters of reconciled\ngene tree measures, which are important in practice for normalization, and\nprovide initial bounds on PLR, LRF, and ELRF. To validate PLR, we simulate\nreconciliations and perform comparisons with LRF and ELRF. The results show\nthat PLR provides a more evenly distributed range of distances, making it less\nsusceptible to overestimating differences in the presence of small topological\nchanges, while at the same time being computationally efficient. Our findings\nsuggest that the theoretical diameter is rarely reached in practice. The PLR\nmeasure advances phylogenetic reconciliation by combining theoretical rigor\nwith practical applicability. Future research will refine its mathematical\nproperties, explore its performance on different tree types, and integrate it\nwith existing bioinformatics tools for large-scale evolutionary analyses. The\nopen source code is available at: https://pypi.org/project/parle/.\n","subjects":["Computing Research Repository/Discrete Mathematics","Quantitative Biology/Populations and Evolution"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"qQmR1QncE4tMmN5QP2YoY_JZQQp1wvA8PmASgX3Vr-Y","pdfSize":"3783450"}