{"id":"2407.03339","title":"Stabilized Time Series Expansions for High-Order Finite Element\n  Solutions of Partial Differential Equations","authors":"Ahmad Deeb and Denys Dutykh","authorsParsed":[["Deeb","Ahmad",""],["Dutykh","Denys",""]],"versions":[{"version":"v1","created":"Thu, 16 May 2024 08:42:51 GMT"}],"updateDate":"2024-09-04","timestamp":1715848971000,"abstract":"  Over the past decade, Finite Element Method (FEM) has served as a\nfoundational numerical framework for approximating the terms of Time Series\nExpansion (TSE) as solutions to transient Partial Differential Equation (PDE).\nHowever, the application of high-order Finite Element (FE) to certain classes\nof PDEs, such as diffusion equations and the Navier-Stokes (NS) equations,\noften leads to numerical instabilities. These instabilities limit the number of\nvalid terms in the series, though the efficiency of time series integration\neven when resummation techniques like the Borel-Pad\\'e-Laplace (BPL)\nintegrators are employed. In this study, we introduce a novel variational\nformulation for computing the terms of a TSE associated with a given PDE using\nhigher-order FEs. Our approach involves the incorporation of artificial\ndiffusion terms on the left-hand side of the equations corresponding to each\npower in the series, serving as a stabilization technique. We demonstrate that\nthis method can be interpreted as a minimization of an energy functional,\nwherein the total variations of the unknowns are considered. Furthermore, we\nestablish that the coefficients of the artificial diffusion for each term in\nthe series obey a recurrence relation, which can be determined by minimizing\nthe condition number of the associated linear system. We highlight the link\nbetween the proposed technique and the Discrete Maximum Principle (DMP) of the\nheat equation. We show, via numerical experiments, how the proposed technique\nallows having additional valid terms of the series that will be substantial in\nenlarging the stability domain of the BPL integrators.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"TVs5UPamJ4HTfsp-jhjNIDNqT5luzOymAYtfArfSYeA","pdfSize":"1368835"}