{"id":"2407.17618","title":"Productive self/vulnerable body: self-tracking, overworking culture, and\n  conflicted data practices","authors":"Elise Li Zheng","authorsParsed":[["Zheng","Elise Li",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 20:11:26 GMT"}],"updateDate":"2024-07-26","timestamp":1721851886000,"abstract":"  Self-tracking, the collection, analysis, and interpretation of personal data,\nsignifies an individualized way of health governance as people are demanded to\nbuild a responsible self by internalizing norms. However, the technological\npromises often bear conflicts with various social factors such as a strenuous\nschedule, a lack of motivation, stress, and anxieties, which fail to deliver\nhealth outcomes. To re-problematize the phenomenon, this paper situates\nself-tracking in an overworking culture in China and draws on semi structured\nand in depth interviews with overworking individuals to reveal the patterns in\nusers interactions and interpretations with self-tracking data. It builds on\nthe current literature of self-tracking and engages with theories from Science\nand Technology Studies, especially sociomaterial assemblages (Lupton 2016) and\ntechnological mediation (Verbeek 2005), to study self-tracking in a\ncontextualized way which connects the micro (data reading, visualization, and\naffective elements in design) with the macro (work and workplaces,\nsocioeconomic and political background) contexts of self-tracking. Drawing on\ninvestigation of the social context that users of self-tracking technologies\ninternalize, reflect, or resist, the paper argues that the productivity and\nvalue oriented assumptions and workplace culture shape the imaginary of\nintensive (and sometimes impossible) self-care and health, an involution of\ncompetence embedded in the technological design and users affective\nexperiences. Users respond by enacting different design elements and social\ncontexts to frame two distinctive data practices of self-tracking.\n","subjects":["Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"rIsZ23XY1BWY2sZ2u4r4HzdYHPB7YyWyZI0LovKdSGY","pdfSize":"372058"}