{"id":"2407.01480","title":"How Land-Mass Distribution Influences the Atmospheric Dynamics of\n  Tidally Locked Terrestrial Exoplanets","authors":"F. Sainsbury-Martinez, C. Walsh, G. J. Cooke, and D. R. Marsh","authorsParsed":[["Sainsbury-Martinez","F.",""],["Walsh","C.",""],["Cooke","G. J.",""],["Marsh","D. R.",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 17:10:06 GMT"},{"version":"v2","created":"Tue, 2 Jul 2024 07:59:50 GMT"},{"version":"v3","created":"Wed, 7 Aug 2024 14:32:18 GMT"}],"updateDate":"2024-08-08","timestamp":1719853806000,"abstract":"  Interpretation of the ongoing efforts to simulate the atmospheres of\npotentially-habitable terrestrial exoplanets requires that we understand the\nunderlying dynamics and chemistry of such objects to a much greater degree than\n1D or even simple 3D models enable. Here, for the tidally-locked habitable-zone\nplanet TRAPPIST-1e, we explore one effect which can shape the dynamics and\nchemistry of terrestrial planets: the inclusion of an Earth-like land-ocean\ndistribution with orography. To do this we use the Earth-system model\nWACCM6/CESM2 to run a pair of TRAPPIST-1e models with N$_2$-O$_2$ atmospheres\nand with the sub-stellar point fixed over either land or ocean. The presence of\norography shapes atmospheric transport, and in the case of Earth-like\norography, breaks the symmetry between the northern and southern hemispheres\nwhich was previously found in slab ocean models. For example, peak zonal jet\nspeeds in the southern hemisphere are $50\\rightarrow100\\%$ faster than similar\njets in the northern hemisphere. This also affects the meridional circulation,\ntransporting equatorial material towards the south-pole. As a result we also\nfind significant changes in the atmospheric chemistry, including the\naccumulation of potentially lethal quantities of ozone at both the south pole\nand the surface. Future studies which investigate the effects of land-mass\ndistribution on the dynamics of exoplanetary atmospheres should pay close\nattention to both the day-side land-fraction as well as the orography of the\nland. Simply modelling a flat land-mass will not give a complete picture of its\ndynamical impact.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"aVRGYKwveuFFQwgDV1SoloyU9nUWBraHI6tyxgv9ezM","pdfSize":"17004261","objectId":"0xe897d177c48746c85847c41d36c1e134301e4a0547ff3cfe7707880f40f7c94e","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
