{"id":"2407.06893","title":"Measuring Sustainability Intention of ESG Fund Disclosure using Few-Shot\n  Learning","authors":"Mayank Singh, Nazia Nafis, Abhijeet Kumar, Mridul Mishra","authorsParsed":[["Singh","Mayank",""],["Nafis","Nazia",""],["Kumar","Abhijeet",""],["Mishra","Mridul",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 14:25:23 GMT"}],"updateDate":"2024-07-10","timestamp":1720535123000,"abstract":"  Global sustainable fund universe encompasses open-end funds and\nexchange-traded funds (ETF) that, by prospectus or other regulatory filings,\nclaim to focus on Environment, Social and Governance (ESG). Challengingly, the\nclaims can only be confirmed by examining the textual disclosures to check if\nthere is presence of intentionality and ESG focus on its investment strategy.\nCurrently, there is no regulation to enforce sustainability in ESG products\nspace. This paper proposes a unique method and system to classify and score the\nfund prospectuses in the sustainable universe regarding specificity and\ntransparency of language. We aim to employ few-shot learners to identify\nspecific, ambiguous, and generic sustainable investment-related language.\nAdditionally, we construct a ratio metric to determine language score and\nrating to rank products and quantify sustainability claims for US sustainable\nuniverse. As a by-product, we publish manually annotated quality training\ndataset on Hugging Face (ESG-Prospectus-Clarity-Category under cc-by-nc-sa-4.0)\nof more than 1K ESG textual statements. The performance of the few-shot\nfinetuning approach is compared with zero-shot models e.g., Llama-13B, GPT 3.5\nTurbo etc. We found that prompting large language models are not accurate for\ndomain specific tasks due to misalignment issues. The few-shot finetuning\ntechniques outperform zero-shot models by large margins of more than absolute\n~30% in precision, recall and F1 metrics on completely unseen ESG languages\n(test set). Overall, the paper attempts to establish a systematic and scalable\napproach to measure and rate sustainability intention quantitatively for\nsustainable funds using texts in prospectus. Regulatory bodies, investors, and\nadvisors may utilize the findings of this research to reduce cognitive load in\ninvestigating or screening of ESG funds which accurately reflects the ESG\nintention.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"S6fYt79u5rDs7wvrZ_inFnn2N7bu7h66S9EsEIMetCg","pdfSize":"314369"}
