{"id":"2407.03580","title":"Deep Pareto Reinforcement Learning for Multi-Objective Recommender\n  Systems","authors":"Pan Li, Alexander Tuzhilin","authorsParsed":[["Li","Pan",""],["Tuzhilin","Alexander",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 02:19:49 GMT"},{"version":"v2","created":"Tue, 9 Jul 2024 18:54:59 GMT"}],"updateDate":"2024-07-11","timestamp":1720059589000,"abstract":"  Optimizing multiple objectives simultaneously is an important task for\nrecommendation platforms to improve their performance. However, this task is\nparticularly challenging since the relationships between different objectives\nare heterogeneous across different consumers and dynamically fluctuating\naccording to different contexts. Especially in those cases when objectives\nbecome conflicting with each other, the result of recommendations will form a\npareto-frontier, where the improvements of any objective comes at the cost of a\nperformance decrease of another objective. Existing multi-objective recommender\nsystems do not systematically consider such dynamic relationships; instead,\nthey balance between these objectives in a static and uniform manner, resulting\nin only suboptimal multi-objective recommendation performance. In this paper,\nwe propose a Deep Pareto Reinforcement Learning (DeepPRL) approach, where we\n(1) comprehensively model the complex relationships between multiple objectives\nin recommendations; (2) effectively capture personalized and contextual\nconsumer preference for each objective to provide better recommendations; (3)\noptimize both the short-term and the long-term performance of multi-objective\nrecommendations. As a result, our method achieves significant pareto-dominance\nover the state-of-the-art baselines in the offline experiments. Furthermore, we\nconducted a controlled experiment at the video streaming platform of Alibaba,\nwhere our method simultaneously improved three conflicting business objectives\nover the latest production system significantly, demonstrating its tangible\neconomic impact in practice.\n","subjects":["Computing Research Repository/Information Retrieval"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"MkYqYX1EfmY35C0GADqMkfyvXEATxmj2Dbq9Oxzosdc","pdfSize":"1137865"}