{"id":"2407.18837","title":"Distributionally Robust Kalman Filtering over Finite and Infinite\n  Horizon","authors":"Taylan Kargin, Joudi Hajar, Vikrant Malik, Babak Hassibi","authorsParsed":[["Kargin","Taylan",""],["Hajar","Joudi",""],["Malik","Vikrant",""],["Hassibi","Babak",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 15:58:11 GMT"}],"updateDate":"2024-07-29","timestamp":1722009491000,"abstract":"  This paper investigates the distributionally robust filtering of signals\ngenerated by state-space models driven by exogenous disturbances with noisy\nobservations in finite and infinite horizon scenarios. The exact joint\nprobability distribution of the disturbances and noise is unknown but assumed\nto reside within a Wasserstein-2 ambiguity ball centered around a given nominal\ndistribution. We aim to derive a causal estimator that minimizes the worst-case\nmean squared estimation error among all possible distributions within this\nambiguity set. We remove the iid restriction in prior works by permitting\narbitrarily time-correlated disturbances and noises. In the finite horizon\nsetting, we reduce this problem to a semi-definite program (SDP), with\ncomputational complexity scaling with the time horizon. For infinite horizon\nsettings, we characterize the optimal estimator using Karush-Kuhn-Tucker (KKT)\nconditions. Although the optimal estimator lacks a rational form, i.e., a\nfinite-dimensional state-space realization, it can be fully described by a\nfinite-dimensional parameter. {Leveraging this parametrization, we propose\nefficient algorithms that compute the optimal estimator with arbitrary fidelity\nin the frequency domain.} Moreover, given any finite degree, we provide an\nefficient convex optimization algorithm that finds the finite-dimensional\nstate-space estimator that best approximates the optimal non-rational filter in\n${\\cal H}_\\infty$ norm. This facilitates the practical implementation of the\ninfinite horizon filter without having to grapple with the ill-scaled SDP from\nfinite time. Finally, numerical simulations demonstrate the effectiveness of\nour approach in practical scenarios.\n","subjects":["Mathematics/Optimization and Control","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Signal Processing","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"zKPj8BZqho2zmvbvhxMt5yPCmhhcG9VSA8f-Qj3AJWI","pdfSize":"1175228"}