{"id":"2407.03796","title":"Joint Beamforming Design and Bit Allocation in Massive MIMO with\n  Resolution-Adaptive ADCs","authors":"Mengyuan Ma, Nhan Thanh Nguyen, Italo Atzeni, and Markku Juntti","authorsParsed":[["Ma","Mengyuan",""],["Nguyen","Nhan Thanh",""],["Atzeni","Italo",""],["Juntti","Markku",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 10:01:21 GMT"}],"updateDate":"2024-07-08","timestamp":1720087281000,"abstract":"  Low-resolution analog-to-digital converters (ADCs) have emerged as a\npromising technology for reducing power consumption and complexity in massive\nmultiple-input multiple-output (MIMO) systems while maintaining satisfactory\nspectral and energy efficiencies (SE/EE). In this work, we first identify the\nessential properties of optimal quantization and leverage them to derive a\nclosed-form approximation of the covariance matrix of the quantization\ndistortion. The theoretical finding facilitates the system SE analysis in the\npresence of low-resolution ADCs. We then focus on the joint optimization of the\ntransmit-receive beamforming and bit allocation to maximize the SE under\nconstraints on the transmit power and the total number of active ADC bits. To\nsolve the resulting mixed-integer problem, we first develop an efficient\nbeamforming design for fixed ADC resolutions. Then, we propose a low-complexity\nheuristic algorithm to iteratively optimize the ADC resolutions and beamforming\nmatrices. Numerical results for a $64 \\times 64$ MIMO system demonstrate that\nthe proposed design offers $6\\%$ improvement in both SE and EE with $40\\%$\nfewer active ADC bits compared with the uniform bit allocation. Furthermore, we\nnumerically show that receiving more data streams with low-resolution ADCs can\nachieve higher SE and EE compared to receiving fewer data streams with\nhigh-resolution ADCs.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"IRZ_gufK5upkRziM4O3pv3gDWFV4qY3I_g9943-F7HA","pdfSize":"511999"}