{"id":"2407.04727","title":"Dynamical Embedding of Single Channel Electroencephalogram for Artifact\n  Subspace Reconstruction","authors":"Doli Hazarika, Vishnu KN, Ramdas Ransing and Cota Navin Gupta","authorsParsed":[["Hazarika","Doli",""],["KN","Vishnu",""],["Ransing","Ramdas",""],["Gupta","Cota Navin",""]],"versions":[{"version":"v1","created":"Fri, 28 Jun 2024 06:26:29 GMT"}],"updateDate":"2024-07-09","timestamp":1719555989000,"abstract":"  This study introduces a novel framework to apply Artifact Subspace\nReconstruction (ASR) algorithm on single-channel Electroencephalogram (EEG)\ndata. ASR, renowned for its automated capability to effectively eliminate\nvarious artifacts like eye-blinks and eye movements from EEG signals.\nImportantly it has been implemented on android smartphones, but relied on\nmultiple channels for principal component subspace calculations. To overcome\nthis limitation, we incorporate the established dynamical embedding approach\ninto the algorithm, naming it Embedded-ASR (E-ASR). In our proposed method, an\nembedded matrix is first constructed from a single-channel EEG data using\nseries of delay vectors. ASR is then applied to this embedded matrix, and the\nresulting cleaned single-channel EEG is reconstructed by removing the time lag\nand concatenating the rows of the embedded matrix. Data was collected from four\nsubjects in resting states with eyes open from pre-frontal (Fp1 and Fp2)\nelectrodes using CameraEEG app. To assess the effectiveness of the E-ASR\nalgorithm on an EEG dataset with artifacts, we employed performance metrics\nsuch as relative root mean square error (RRMSE), correlation coefficient (CC),\naverage power ratio as well as estimated the number of eye-blinks with and\nwithout the E-ASR approach. E-ASR was able to reduce artifacts from the\nsemi-simulated EEG data, with an RRMSE of 45.45% and a CC of 0.91. For real EEG\ndata, the counted eye-blinks were manually cross-checked with ground truth\nobtained from CameraEEG video data across all subjects for individual Fp1 and\nFp2 electrodes. In conclusion, our study suggests E-ASR framework can remove\nartifacts from single channel EEG data. This promising algorithm might have\npotential for smartphone-based natural environment EEG applications, where\nminimal number of electrodes is a critical factor.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"2e6hCuPir29FlHLmKViHlidp0w6CqGgzlIl2Az8gwdY","pdfSize":"1502129"}