{"id":"2407.07692","title":"Spectral Statistics, Hydrodynamics and Quantum Chaos","authors":"Michael Winer","authorsParsed":[["Winer","Michael",""]],"versions":[{"version":"v1","created":"Wed, 10 Jul 2024 14:20:47 GMT"}],"updateDate":"2024-07-11","timestamp":1720621247000,"abstract":"  One of the central problems in many-body physics, both classical and quantum,\nis the relations between different notions of chaos. Ergodicity, mixing,\noperator growth, the eigenstate thermalization hypothesis, and spectral chaos\nare defined in terms of completely different objects in different contexts,\ndon't necessarily co-occur, but still seem to be manifestations of closely\nrelated phenomena. In this dissertation, we study the relation between two\nnotions of chaos: thermalization and spectral chaos. We define a quantity\ncalled the Total Return Probability (TRP) which measures how a system forgets\nits initial state after time $T$, and show that it is closely connected to the\nSpectral Form Factor (SFF), a measure of chaos deriving from the energy level\nspectrum of a quantum system. The main thrust of this work concerns\nhydrodynamic systems -- systems where locality prevents charge or energy from\nspreading quickly, this putting a throttle on thermalization. We show that the\ndetailed spacings of energy levels closely capture the dynamics of these\nlocally conserved charges. We also study spin glasses, a phase of matter where\nthe obstacle to thermalization comes not from locality but from the presence of\ntoo many neighbors. Changing one region requires changing nearby regions which\nrequires changing nearby-to-nearby regions, until only catastrophic\nrealignments of the whole system can fully explore phase space. In spin glasses\nwe find our clearest analytic link between thermalization and spectral\nstatistics. We analytically calculate the spectral form factor in the limit of\nlarge system size and show it is equal to the TRP. Finally, in the conclusion,\nwe discuss some ideas for the future of both the SFF and the TRP.\n","subjects":["Condensed Matter/Statistical Mechanics","Condensed Matter/Strongly Correlated Electrons","Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"PLlFpmq9WY0osq2E0tqcPjbosWA94yyPHs_-7XsyqtE","pdfSize":"5717561"}