{"id":"2407.11317","title":"Hybrid physics-AI outperforms numerical weather prediction for extreme\n  precipitation nowcasting","authors":"Puja Das, August Posch, Nathan Barber, Michael Hicks, Thomas J.\n  Vandal, Kate Duffy, Debjani Singh, Katie van Werkhoven, Auroop R. Ganguly","authorsParsed":[["Das","Puja",""],["Posch","August",""],["Barber","Nathan",""],["Hicks","Michael",""],["Vandal","Thomas J.",""],["Duffy","Kate",""],["Singh","Debjani",""],["van Werkhoven","Katie",""],["Ganguly","Auroop R.",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 02:04:04 GMT"}],"updateDate":"2024-07-17","timestamp":1721095444000,"abstract":"  Precipitation nowcasting, critical for flood emergency and river management,\nhas remained challenging for decades, although recent developments in deep\ngenerative modeling (DGM) suggest the possibility of improvements. River\nmanagement centers, such as the Tennessee Valley Authority, have been using\nNumerical Weather Prediction (NWP) models for nowcasting but have struggled\nwith missed detections even from best-in-class NWP models. While decades of\nprior research achieved limited improvements beyond advection and localized\nevolution, recent attempts have shown progress from physics-free machine\nlearning (ML) methods and even greater improvements from physics-embedded ML\napproaches. Developers of DGM for nowcasting have compared their approaches\nwith optical flow (a variant of advection) and meteorologists' judgment but not\nwith NWP models. Further, they have not conducted independent co-evaluations\nwith water resources and river managers. Here, we show that the\nstate-of-the-art physics-embedded deep generative model, specifically\nNowcastNet, outperforms the High-Resolution Rapid Refresh (HRRR) model, the\nlatest generation of NWP, along with advection and persistence, especially for\nheavy precipitation events. For grid-cell extremes over 16 mm/h, NowcastNet\ndemonstrated a median critical success index (CSI) of 0.30, compared with a\nmedian CSI of 0.04 for HRRR. However, despite hydrologically relevant\nimprovements in point-by-point forecasts from NowcastNet, caveats include the\noverestimation of spatially aggregated precipitation over longer lead times.\nOur co-evaluation with ML developers, hydrologists, and river managers suggests\nthe possibility of improved flood emergency response and hydropower management.\n","subjects":["Physics/Atmospheric and Oceanic Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"e8FPGkyqnoiS0vQu4GBd0j1W18suFqBDjltHmifqQME","pdfSize":"18182829"}