{"id":"2407.02267","title":"Rotational dynamics of a disk in a thin film of weakly nematic fluid\n  subject to linear friction","authors":"Abdallah Daddi-Moussa-Ider, Elsen Tjhung, Marc Pradas, Thomas Richter,\n  Andreas M. Menzel","authorsParsed":[["Daddi-Moussa-Ider","Abdallah",""],["Tjhung","Elsen",""],["Pradas","Marc",""],["Richter","Thomas",""],["Menzel","Andreas M.",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 13:42:37 GMT"},{"version":"v2","created":"Tue, 13 Aug 2024 15:13:15 GMT"}],"updateDate":"2024-08-14","timestamp":1719927757000,"abstract":"  Dynamics at low Reynolds numbers experiences recent revival in the fields of\nbiophysics and active matter. While in bulk isotropic fluids it is exhaustively\nstudied, this is less so in anisotropic fluids and in confined situations.\nHere, we combine the latter two by studying the rotation of a disk-like\ninclusion in a uniaxially anisotropic, globally oriented, incompressible\ntwo-dimensional fluid film. In terms of a perturbative expansion in parameters\nthat quantify anisotropies in viscosity and in additional linear friction with\na supporting substrate or other type of confinement, we derive analytical\nexpressions for the resulting hydrodynamic flow and pressure fields as well as\nfor the resistance and mobility coefficients of the rotating disk. It turns out\nthat, in contrast to translational motion, the solutions remain well-behaved\nalso in the absence of the additional linear friction. Comparison with results\nfrom finite-element simulations show very good agreement with those from our\nanalytical calculations. Besides applications to describe technological\nsystems, for instance, in the area of microfluidics and thin cells of aligned\nnematic liquid crystals, our solutions are important for quantitative\ntheoretical approaches to fluid membranes and thin films in general featuring a\npreferred direction.\n","subjects":["Condensed Matter/Soft Condensed Matter","Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"tQZV10ZTBLGnV1Q_veSSkHtH258mxHbfB3v5v1Wv-sA","pdfSize":"1638568"}