{"id":"2407.00059","title":"Microheater hotspot engineering for repeatable multi-level switching in\n  foundry-processed phase change silicon photonics","authors":"Hongyi Sun, Chuanyu Lian, Francis V\\'asquez-Aza, Sadra Rahimi Kari,\n  Yi-Siou Huang, Alessandro Restelli, Steven A. Vitale, Ichiro Takeuchi, Juejun\n  Hu, Nathan Youngblood, Georges Pavlidis, Carlos A. R\\'ios Ocampo","authorsParsed":[["Sun","Hongyi",""],["Lian","Chuanyu",""],["Vásquez-Aza","Francis",""],["Kari","Sadra Rahimi",""],["Huang","Yi-Siou",""],["Restelli","Alessandro",""],["Vitale","Steven A.",""],["Takeuchi","Ichiro",""],["Hu","Juejun",""],["Youngblood","Nathan",""],["Pavlidis","Georges",""],["Ocampo","Carlos A. Ríos",""]],"versions":[{"version":"v1","created":"Sat, 15 Jun 2024 21:39:23 GMT"}],"updateDate":"2024-07-02","timestamp":1718487563000,"abstract":"  Nonvolatile photonic integrated circuits employing phase change materials\nhave relied either on optical switching mechanisms with precise multi-level\ncontrol but poor scalability or electrical switching with seamless integration\nand scalability but mostly limited to a binary response. Recent works have\ndemonstrated electrical multi-level switching; however, they relied on the\nstochastic nucleation process to achieve partial crystallization with low\ndemonstrated repeatability and cyclability. Here, we re-engineer\nwaveguide-integrated microheaters to achieve precise spatial control of the\ntemperature profile (i.e., hotspot) and, thus, switch deterministic areas of an\nembedded phase change material cell. We experimentally demonstrate this concept\nusing a variety of foundry-processed doped-silicon microheaters on a\nsilicon-on-insulator platform to trigger multi-step amorphization and\nreversible switching of Sb$_{2}$Se$_{3}$ and Ge$_{2}$Sb$_{2}$Se$_{4}$Te alloys.\nWe further characterize the response of our microheaters using Transient\nThermoreflectance Imaging. Our approach combines the deterministic control\nresulting from a spatially resolved glassy-crystalline distribution with the\nscalability of electro-thermal switching devices, thus paving the way to\nreliable multi-level switching towards robust reprogrammable phase-change\nphotonic devices for analog processing and computing.\n","subjects":["Physics/Applied Physics","Condensed Matter/Materials Science","Physics/Optics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"T16JQkv4XlPnj_C2PvdbjJelT3nsuyJaXr6ytjtARAo","pdfSize":"37991674","objectId":"0xd2d26d6e89b43391ccd77995010ddfded2d1eba2c2a624c96f077431e6a53301","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
