{"id":"2407.20684","title":"RevGNN: Negative Sampling Enhanced Contrastive Graph Learning for\n  Academic Reviewer Recommendation","authors":"Weibin Liao, Yifan Zhu, Yanyan Li, Qi Zhang, Zhonghong Ou, Xuesong Li","authorsParsed":[["Liao","Weibin",""],["Zhu","Yifan",""],["Li","Yanyan",""],["Zhang","Qi",""],["Ou","Zhonghong",""],["Li","Xuesong",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 09:25:40 GMT"}],"updateDate":"2024-07-31","timestamp":1722331540000,"abstract":"  Acquiring reviewers for academic submissions is a challenging recommendation\nscenario. Recent graph learning-driven models have made remarkable progress in\nthe field of recommendation, but their performance in the academic reviewer\nrecommendation task may suffer from a significant false negative issue. This\narises from the assumption that unobserved edges represent negative samples. In\nfact, the mechanism of anonymous review results in inadequate exposure of\ninteractions between reviewers and submissions, leading to a higher number of\nunobserved interactions compared to those caused by reviewers declining to\nparticipate. Therefore, investigating how to better comprehend the negative\nlabeling of unobserved interactions in academic reviewer recommendations is a\nsignificant challenge. This study aims to tackle the ambiguous nature of\nunobserved interactions in academic reviewer recommendations. Specifically, we\npropose an unsupervised Pseudo Neg-Label strategy to enhance graph contrastive\nlearning (GCL) for recommending reviewers for academic submissions, which we\ncall RevGNN. RevGNN utilizes a two-stage encoder structure that encodes both\nscientific knowledge and behavior using Pseudo Neg-Label to approximate review\npreference. Extensive experiments on three real-world datasets demonstrate that\nRevGNN outperforms all baselines across four metrics. Additionally, detailed\nfurther analyses confirm the effectiveness of each component in RevGNN.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Jy2gz4JLnMxSgi7hqBXsUDCbKw86G7yHmCocFeaAIMk","pdfSize":"1387872"}