{"id":"2407.05841","title":"An Empirical Comparison of Vocabulary Expansion and Initialization\n  Approaches for Language Models","authors":"Nandini Mundra, Aditya Nanda Kishore, Raj Dabre, Ratish Puduppully,\n  Anoop Kunchukuttan, Mitesh M. Khapra","authorsParsed":[["Mundra","Nandini",""],["Kishore","Aditya Nanda",""],["Dabre","Raj",""],["Puduppully","Ratish",""],["Kunchukuttan","Anoop",""],["Khapra","Mitesh M.",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 11:38:49 GMT"}],"updateDate":"2024-07-09","timestamp":1720438729000,"abstract":"  Language Models (LMs) excel in natural language processing tasks for English\nbut show reduced performance in most other languages. This problem is commonly\ntackled by continually pre-training and fine-tuning these models for said\nlanguages. A significant issue in this process is the limited vocabulary\ncoverage in the original model's tokenizer, leading to inadequate\nrepresentation of new languages and necessitating an expansion of the\ntokenizer. The initialization of the embeddings corresponding to new vocabulary\nitems presents a further challenge. Current strategies require cross-lingual\nembeddings and lack a solid theoretical foundation as well as comparisons with\nstrong baselines. In this paper, we first establish theoretically that\ninitializing within the convex hull of existing embeddings is a good\ninitialization, followed by a novel but simple approach, Constrained Word2Vec\n(CW2V), which does not require cross-lingual embeddings. Our study evaluates\ndifferent initialization methods for expanding RoBERTa and LLaMA 2 across four\nlanguages and five tasks. The results show that CW2V performs equally well or\neven better than more advanced techniques. Additionally, simpler approaches\nlike multivariate initialization perform on par with these advanced methods\nindicating that efficient large-scale multilingual continued pretraining can be\nachieved even with simpler initialization methods.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Q3kJW-Cio_l0FDinBFFsMaykTwN2XrAg9q2FSYVQ1uM","pdfSize":"3653569"}