{"id":"2407.03576","title":"Application of Magnus expansion for the quantum dynamics of\n  $\\Lambda$-systems under periodic driving and assessment of the rotating wave\n  approximation","authors":"Taner M. Ture, Changbong Hyeon, and Seogjoo J. Jang","authorsParsed":[["Ture","Taner M.",""],["Hyeon","Changbong",""],["Jang","Seogjoo J.",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 02:02:37 GMT"}],"updateDate":"2024-07-08","timestamp":1720058557000,"abstract":"  Employing a sixth order expression for the differential time evolution\noperator based on the Magnus expansion (ME), we conducted quantum dynamics\ncalculations of a $\\Lambda$-system driven by two sinusoidal time dependent\nfields. For a closed system dynamics, we confirmed the equivalence of the\ndynamics in the Hilbert space and the Liouville space numerically. We also\nconducted open system quantum dynamics calculation by generalizing the ME to\nthe non-Hermitian dynamics in the Liouville space for the case where the\neffects of photonic bath are represented by Lindblad operators. In both cases,\nthe accuracy of the rotating wave approximation (RWA) was assessed. We found\nsignificant errors of RWA during initial stages of the dynamics for\nrepresentative cases where electromagnetically induced transparency or coherent\npopulation trapping can be observed. The presence of bath for open system\nquantum dynamics reduces the errors of RWA, but significant errors for\noff-diagonal elements of the density operator can still be seen. We also found\nthat approaches to steady state limits of exact dynamics are slower than those\nfor RWA. These results demonstrate the utility of the ME as a general and\nreliable tool for closed and open system quantum dynamics for time dependent\nHamiltonians, and expose potential issues of drawing conclusions based solely\non RWA.\n","subjects":["Physics/Quantum Physics","Physics/Atomic Physics","Physics/Chemical Physics","Physics/Optics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"bfuZDhy4Y_R3G1kPJ8Dr--SKYjNJ7XaMnmrIGwCoJ8E","pdfSize":"11925349"}