{"id":"2407.01415","title":"Unveiling desert region in inert doublet model assisted by Peccei-Quinn\n  symmetry","authors":"Anupam Ghosh and Partha Konar","authorsParsed":[["Ghosh","Anupam",""],["Konar","Partha",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 16:07:16 GMT"},{"version":"v2","created":"Thu, 19 Sep 2024 15:05:42 GMT"}],"updateDate":"2024-09-20","timestamp":1719850036000,"abstract":"  The Inert Higgs Doublet model (IDM), assisted by Peccei-Quinn (PQ) symmetry,\noffers a simple but natural framework of a dark sector that accommodates Weakly\nInteracting Massive Particle (WIMP) and axion as dark matter components.\nSpontaneous breaking of $U(1)_{PQ}$ symmetry, which was originally proposed as\nan elegant solution to the strong charge-parity (CP) problem, also ensures the\nstability of WIMP through a residual $\\mathbb{Z}_2$ symmetry. Interestingly,\nadditional fields necessitated by PQ symmetry further enrich the dark sector.\nThese include a scalar field proprietor for axion DM and a vector-like quark\n(VLQ) that acts as a portal for the dark sector through Yukawa interactions.\nMoreover, this combination of the axion and WIMP components satisfies the\nobserved DM relic density and reopens the phenomenologically exciting region of\nthe IDM parameter space where the WIMP mass falls between 100 - 550 GeV. We\ninvestigate the model-independent pair production of VLQs exploring this region\nat the Large Hadron Collider (LHC), incorporating the effects of\nnext-to-leading order (NLO) QCD corrections. After production, each VLQ decays\ninto a top or bottom quark accompanied by an inert scalar, a consequence of the\nresidual $\\mathbb{Z}_2$ symmetry. Utilising relevant observables with a\nleptonic search channel and employing multivariate analysis, we demonstrate the\nability of this analysis to exclude a significant portion of the parameter\nspace with an integrated luminosity of 300 $\\text{fb}^{-1}$.\n","subjects":["Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"qX6hlelspSpp7b3-ze-zqDVqj0sNDDuteX-ETqtkgLU","pdfSize":"1670575"}