{"id":"2407.01107","title":"Quantitative evaluation method for magnetoelastic coupling between\n  surface acoustic waves and spin waves using electrical and optical\n  measurements","authors":"Haruka Komiyama, Ryusuke Hisatomi, Kotaro Taga, Hiroki Matsumoto,\n  Takahiro Moriyama, Hideki Narita, Shutaro Karube, Yoichi Shiota, and Teruo\n  Ono","authorsParsed":[["Komiyama","Haruka",""],["Hisatomi","Ryusuke",""],["Taga","Kotaro",""],["Matsumoto","Hiroki",""],["Moriyama","Takahiro",""],["Narita","Hideki",""],["Karube","Shutaro",""],["Shiota","Yoichi",""],["Ono","Teruo",""]],"versions":[{"version":"v1","created":"Mon, 1 Jul 2024 09:19:18 GMT"}],"updateDate":"2024-07-02","timestamp":1719825558000,"abstract":"  Coupling and hybridization of different elementary excitations leads to new\nfunctionalities. In phononics and spintronics, magnetoelastic coupling between\nRayleigh-type surface acoustic wave (SAW) and spin wave (SW) has recently\nattracted much attention. Quantitatively evaluating and comparing the coupled\nsystem are essential to develop the study of the magnetoelastic SAW-SW\ncoupling. So far, previous studies of SAW-SW coupling have employed a quantity\ncalled coupling strength. However, it is still challenging to compare the\ncoupling strength values among studies fairly because the quantity depends on\nthe device geometry and the applied magnetic field angle, which are not unified\namong the previous studies. Here, we focus on a practical constant composed of\na magnetoelastic constant and a strain amplitude that depends only on the\nmaterial properties. We demonstrate a versatile evaluation technique to\nevaluate the practical constant by combining electrical measurements and\noptical imaging. An essential part of the technique is an analysis that can be\nused under off-resonance conditions where SAW and SW resonance frequencies do\nnot match. Existing analysis can only handle the case under on-resonance\nconditions. Our analysis makes it possible to observe the magnetoelastic\ncouplings between SAW with resonance frequencies that can be imaged optically\nand SW with resonance frequencies in the gigahertz range. Our demonstrated\ntechnique, which uses electrical and optical measurements under off-resonance\nconditions, can significantly advance research on SAW-SW coupled systems.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science","Physics/Optics","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"VffjQHbQ9ypROfStw9AFqJgJg1DWUtMXoYFNwKXi3cU","pdfSize":"23112276"}