{"id":"2407.14326","title":"Panoptic Segmentation of Mammograms with Text-To-Image Diffusion Model","authors":"Kun Zhao, Jakub Prokop, Javier Montalt Tordera, and Sadegh Mohammadi","authorsParsed":[["Zhao","Kun",""],["Prokop","Jakub",""],["Tordera","Javier Montalt",""],["Mohammadi","Sadegh",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 14:04:05 GMT"}],"updateDate":"2024-07-22","timestamp":1721397845000,"abstract":"  Mammography is crucial for breast cancer surveillance and early diagnosis.\nHowever, analyzing mammography images is a demanding task for radiologists, who\noften review hundreds of mammograms daily, leading to overdiagnosis and\novertreatment. Computer-Aided Diagnosis (CAD) systems have been developed to\nassist in this process, but their capabilities, particularly in lesion\nsegmentation, remained limited. With the contemporary advances in deep learning\ntheir performance may be improved. Recently, vision-language diffusion models\nemerged, demonstrating outstanding performance in image generation and\ntransferability to various downstream tasks. We aim to harness their\ncapabilities for breast lesion segmentation in a panoptic setting, which\nencompasses both semantic and instance-level predictions. Specifically, we\npropose leveraging pretrained features from a Stable Diffusion model as inputs\nto a state-of-the-art panoptic segmentation architecture, resulting in accurate\ndelineation of individual breast lesions. To bridge the gap between natural and\nmedical imaging domains, we incorporated a mammography-specific MAM-E diffusion\nmodel and BiomedCLIP image and text encoders into this framework. We evaluated\nour approach on two recently published mammography datasets, CDD-CESM and\nVinDr-Mammo. For the instance segmentation task, we noted 40.25 AP0.1 and 46.82\nAP0.05, as well as 25.44 PQ0.1 and 26.92 PQ0.05. For the semantic segmentation\ntask, we achieved Dice scores of 38.86 and 40.92, respectively.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"TzNgx1fwY2z4BJa8IQ_9aZtZ4kiGrLvYBswnssi0wcU","pdfSize":"2615800"}