{"id":"2407.00056","title":"MMBee: Live Streaming Gift-Sending Recommendations via Multi-Modal\n  Fusion and Behaviour Expansion","authors":"Jiaxin Deng, Shiyao Wang, Yuchen Wang, Jiansong Qi, Liqin Zhao, Guorui\n  Zhou, Gaofeng Meng","authorsParsed":[["Deng","Jiaxin",""],["Wang","Shiyao",""],["Wang","Yuchen",""],["Qi","Jiansong",""],["Zhao","Liqin",""],["Zhou","Guorui",""],["Meng","Gaofeng",""]],"versions":[{"version":"v1","created":"Sat, 15 Jun 2024 04:59:00 GMT"}],"updateDate":"2024-07-02","timestamp":1718427540000,"abstract":"  Live streaming services are becoming increasingly popular due to real-time\ninteractions and entertainment. Viewers can chat and send comments or virtual\ngifts to express their preferences for the streamers. Accurately modeling the\ngifting interaction not only enhances users' experience but also increases\nstreamers' revenue. Previous studies on live streaming gifting prediction treat\nthis task as a conventional recommendation problem, and model users'\npreferences using categorical data and observed historical behaviors. However,\nit is challenging to precisely describe the real-time content changes in live\nstreaming using limited categorical information. Moreover, due to the sparsity\nof gifting behaviors, capturing the preferences and intentions of users is\nquite difficult. In this work, we propose MMBee based on real-time Multi-Modal\nFusion and Behaviour Expansion to address these issues. Specifically, we first\npresent a Multi-modal Fusion Module with Learnable Query (MFQ) to perceive the\ndynamic content of streaming segments and process complex multi-modal\ninteractions, including images, text comments and speech. To alleviate the\nsparsity issue of gifting behaviors, we present a novel Graph-guided Interest\nExpansion (GIE) approach that learns both user and streamer representations on\nlarge-scale gifting graphs with multi-modal attributes. Comprehensive\nexperiment results show that MMBee achieves significant performance\nimprovements on both public datasets and Kuaishou real-world streaming datasets\nand the effectiveness has been further validated through online A/B\nexperiments. MMBee has been deployed and is serving hundreds of millions of\nusers at Kuaishou.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"oyeG-woj5tKJws-SR2JqQf0ahg7TWUTjX2o-2l5Y3jg","pdfSize":"7094947","objectId":"0x3c5408e67b7f50335109bb4ce4961a0fb0bee0c86faed509e0d3e56ce13be7c5","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
