{"id":"2407.06232","title":"Operationalising AI governance through ethics-based auditing: An\n  industry case study","authors":"Jakob Mokander and Luciano Floridi","authorsParsed":[["Mokander","Jakob",""],["Floridi","Luciano",""]],"versions":[{"version":"v1","created":"Sun, 7 Jul 2024 12:22:38 GMT"}],"updateDate":"2024-07-10","timestamp":1720354958000,"abstract":"  Ethics based auditing (EBA) is a structured process whereby an entitys past\nor present behaviour is assessed for consistency with moral principles or\nnorms. Recently, EBA has attracted much attention as a governance mechanism\nthat may bridge the gap between principles and practice in AI ethics. However,\nimportant aspects of EBA (such as the feasibility and effectiveness of\ndifferent auditing procedures) have yet to be substantiated by empirical\nresearch. In this article, we address this knowledge gap by providing insights\nfrom a longitudinal industry case study. Over 12 months, we observed and\nanalysed the internal activities of AstraZeneca, a biopharmaceutical company,\nas it prepared for and underwent an ethics-based AI audit. While previous\nliterature concerning EBA has focused on proposing evaluation metrics or\nvisualisation techniques, our findings suggest that the main difficulties large\nmultinational organisations face when conducting EBA mirror classical\ngovernance challenges. These include ensuring harmonised standards across\ndecentralised organisations, demarcating the scope of the audit, driving\ninternal communication and change management, and measuring actual outcomes.\nThe case study presented in this article contributes to the existing literature\nby providing a detailed description of the organisational context in which EBA\nprocedures must be integrated to be feasible and effective.\n","subjects":["Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"YzPxcamRM3qDk1zIYYdJwwr60NIUOdaLfflEj8_hUlA","pdfSize":"526752"}