{"id":"2407.20477","title":"Photon counting statistics in Gaussian bosonic networks","authors":"Kalle S. U. Kansanen, Pedro Portugal, Christian Flindt, Peter\n  Samuelsson","authorsParsed":[["Kansanen","Kalle S. U.",""],["Portugal","Pedro",""],["Flindt","Christian",""],["Samuelsson","Peter",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 00:33:25 GMT"}],"updateDate":"2024-07-31","timestamp":1722299605000,"abstract":"  The statistics of transmitted photons in microwave cavities play a\nfoundational role in microwave quantum optics and its technological\napplications. By utilizing quantum mechanical phase-space methods, we here\ndevelop a general theory of the photon counting statistics in Gaussian bosonic\nnetworks consisting of driven cavities with beamsplitter interactions and\ntwo-mode-squeezing. The dynamics of the network can be captured by a Lyapunov\nequation for the covariance matrix of the cavity fields, which generalizes to a\nRiccati equation, when counting fields are included. By solving the Riccati\nequation, we obtain the statistics of emitted and absorbed photons as well as\nthe time-dependent correlations encoded in waiting time distributions and\nsecond-order coherence functions. To illustrate our theoretical framework, we\nfirst apply it to a simple linear network consisting of two coupled cavities,\nfor which we evaluate the photon cross-correlations and discuss connections\nbetween the photon emission statistics and the entanglement between the\ncavities. We then consider a bosonic circulator consisting of three coupled\ncavities, for which we investigate how a synthetic flux may affect the\ndirection of the photon flow, similarly to recent experiments. Our general\nframework paves the way for systematic investigations of the photon counting\nstatistics in Gaussian bosonic networks.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"AFJK5d1QJoaTzWdMDwuzrUj18hxbWSnUe0Uz7J0fzWM","pdfSize":"703037"}