{"id":"2407.03177","title":"EDPNet: An Efficient Dual Prototype Network for Motor Imagery EEG\n  Decoding","authors":"Can Han, Chen Liu, Crystal Cai, Jun Wang, Dahong Qian","authorsParsed":[["Han","Can",""],["Liu","Chen",""],["Cai","Crystal",""],["Wang","Jun",""],["Qian","Dahong",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 14:57:22 GMT"}],"updateDate":"2024-07-04","timestamp":1720018642000,"abstract":"  Motor imagery electroencephalograph (MI-EEG) decoding plays a crucial role in\ndeveloping motor imagery brain-computer interfaces (MI-BCIs). However, decoding\nintentions from MI remains challenging due to the inherent complexity of EEG\nsignals relative to the small-sample size. In this paper, we propose an\nEfficient Dual Prototype Network (EDPNet) to enable accurate and fast MI\ndecoding. EDPNet employs a lightweight adaptive spatial-spectral fusion module,\nwhich promotes more efficient information fusion between multiple EEG\nelectrodes. Subsequently, a parameter-free multi-scale variance pooling module\nextracts more comprehensive temporal features. Furthermore, we introduce dual\nprototypical learning to optimize the feature space distribution and training\nprocess, thereby improving the model's generalization ability on small-sample\nMI datasets. Our experimental results show that the EDPNet outperforms\nstate-of-the-art models with superior classification accuracy and kappa values\n(84.11% and 0.7881 for dataset BCI competition IV 2a, 86.65% and 0.7330 for\ndataset BCI competition IV 2b). Additionally, we use the BCI competition III\nIVa dataset with fewer training data to further validate the generalization\nability of the proposed EDPNet. We also achieve superior performance with\n82.03% classification accuracy. Benefiting from the lightweight parameters and\nsuperior decoding accuracy, our EDPNet shows great potential for MI-BCI\napplications. The code is publicly available at\nhttps://github.com/hancan16/EDPNet.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"fYyBptbmiHJOQw3XkSXURj00-LWFQ8hZMB2YYcz4DLM","pdfSize":"5911898"}
