{"id":"2407.13734","title":"Understanding Reinforcement Learning-Based Fine-Tuning of Diffusion\n  Models: A Tutorial and Review","authors":"Masatoshi Uehara, Yulai Zhao, Tommaso Biancalani, Sergey Levine","authorsParsed":[["Uehara","Masatoshi",""],["Zhao","Yulai",""],["Biancalani","Tommaso",""],["Levine","Sergey",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 17:35:32 GMT"}],"updateDate":"2024-07-19","timestamp":1721324132000,"abstract":"  This tutorial provides a comprehensive survey of methods for fine-tuning\ndiffusion models to optimize downstream reward functions. While diffusion\nmodels are widely known to provide excellent generative modeling capability,\npractical applications in domains such as biology require generating samples\nthat maximize some desired metric (e.g., translation efficiency in RNA, docking\nscore in molecules, stability in protein). In these cases, the diffusion model\ncan be optimized not only to generate realistic samples but also to explicitly\nmaximize the measure of interest. Such methods are based on concepts from\nreinforcement learning (RL). We explain the application of various RL\nalgorithms, including PPO, differentiable optimization, reward-weighted MLE,\nvalue-weighted sampling, and path consistency learning, tailored specifically\nfor fine-tuning diffusion models. We aim to explore fundamental aspects such as\nthe strengths and limitations of different RL-based fine-tuning algorithms\nacross various scenarios, the benefits of RL-based fine-tuning compared to\nnon-RL-based approaches, and the formal objectives of RL-based fine-tuning\n(target distributions). Additionally, we aim to examine their connections with\nrelated topics such as classifier guidance, Gflownets, flow-based diffusion\nmodels, path integral control theory, and sampling from unnormalized\ndistributions such as MCMC. The code of this tutorial is available at\nhttps://github.com/masa-ue/RLfinetuning_Diffusion_Bioseq\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Quantitative Biology/Quantitative Methods","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"KLo5wyPBSt8C6RTS6Hx-QvRei7Huhka1WYbIj-1gbwE","pdfSize":"2927265"}