{"id":"2407.03609","title":"Continuous-variable quantum digital signatures against coherent attacks","authors":"Yi-Fan Zhang, Wen-Bo Liu, Bing-Hong Li, Hua-Lei Yin, Zeng-Bing Chen","authorsParsed":[["Zhang","Yi-Fan",""],["Liu","Wen-Bo",""],["Li","Bing-Hong",""],["Yin","Hua-Lei",""],["Chen","Zeng-Bing",""]],"versions":[{"version":"v1","created":"Thu, 4 Jul 2024 03:39:59 GMT"}],"updateDate":"2024-07-08","timestamp":1720064399000,"abstract":"  Quantum digital signatures (QDS), which utilize correlated bit strings among\nsender and recipients, guarantee the authenticity, integrity and\nnon-repudiation of classical messages based on quantum laws.\nContinuous-variable (CV) quantum protocol with heterodyne and homodyne\nmeasurement has obvious advantages of low-cost implementation and easy\nwavelength division multiplexing. However, security analyses in previous\nresearches are limited to the proof against collective attacks in finite-size\nscenarios. Moreover, existing multi-bit CV QDS schemes have primarily focused\non adapting single-bit protocols for simplicity of security proof, often\nsacrificing signature efficiency. Here, we introduce a CV QDS protocol designed\nto withstand general coherent attacks through the use of a cutting-edge\nfidelity test function, while achieving high signature efficiency by employing\na refined one-time universal hashing signing technique. Our protocol is proved\nto be robust against finite-size effects and excess noise in quantum channels.\nIn simulation, results demonstrate a significant reduction of over 6 orders of\nmagnitude in signature length for a megabit message signing task compared to\nexisting CV QDS protocols and this advantage expands as the message size grows.\nOur work offers a solution with enhanced security and efficiency, paving the\nway for large-scale deployment of CV QDS in future quantum networks.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"V-QDK6h6L63LJhu2inEoDfoQtPcKyoZt-7ugBXwQLSc","pdfSize":"616752"}
