{"id":"2407.13665","title":"Quasi-optimal mesh generation for the virtual element method: A fully\n  adaptive remeshing procedure","authors":"Daniel van Huyssteen, Felipe Lopez Rivarola, Guillermo Etse, Paul\n  Steinmann","authorsParsed":[["van Huyssteen","Daniel",""],["Rivarola","Felipe Lopez",""],["Etse","Guillermo",""],["Steinmann","Paul",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 16:40:07 GMT"}],"updateDate":"2024-07-19","timestamp":1721320807000,"abstract":"  The mesh flexibility offered by the virtual element method through the\npermission of arbitrary element geometries, and the seamless incorporation of\n`hanging' nodes, has made the method increasingly attractive in the context of\nadaptive remeshing. There exists a healthy literature concerning error\nestimation and adaptive refinement techniques for virtual elements while the\ntopic of adaptive coarsening (i.e. de-refinement) is in its infancy. The\ncreation of a quasi-optimal mesh is based on the principle of quasi-even error\ndistribution over the elements which inherently relies on localized refinement\nand coarsening techniques. Thus, necessitating a fully adaptive remeshing\nprocedure. In this work a novel fully adaptive remeshing procedure for the\nvirtual element method is presented. Additionally, novel procedures are\nproposed for the identification of elements qualifying for refinement or\ncoarsening based on user-defined targets. Specifically, a target percentage\nerror, target number of elements, or target number of nodes can be selected.\nNumerical results demonstrate that the adaptive remeshing procedure can meet\nany prescribed target while creating a quasi-optimal mesh. The proposed fully\nadaptive procedure is of particular interest in engineering applications\nrequiring an efficient simulation of a given accuracy, or desiring a simulation\nwith the maximum possible accuracy for a given computational constraint.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Jiy1QKMHfEowmZI62fPp3xUuQ43JQIM0mV9tTOdXa4s","pdfSize":"42565676"}