{"id":"2407.02512","title":"Domain-Driven Design Representation of Monolith Candidate Decompositions\n  Based on Entity Accesses","authors":"Miguel Levezinho (1), Stefan Kapferer (2), Olaf Zimmermann (2),\n  Ant\\'onio Rito Silva (1) ((1) INESC, University of Lisbon Instituto Superior\n  T\\'ecnico, Lisbon, Portugal, (2) OST Eastern Switzerland University of\n  Applied Sciences, Rapperswil, Switzerland)","authorsParsed":[["Levezinho","Miguel",""],["Kapferer","Stefan",""],["Zimmermann","Olaf",""],["Silva","António Rito",""]],"versions":[{"version":"v1","created":"Fri, 21 Jun 2024 09:13:23 GMT"}],"updateDate":"2024-07-04","timestamp":1718961203000,"abstract":"  Microservice architectures have gained popularity as one of the preferred\narchitectural approaches to develop large-scale systems, replacing the monolith\narchitecture approach. Similarly, strategic Domain-Driven Design (DDD) gained\ntraction as the preferred architectural design approach for the development of\nmicroservices. However, DDD and its strategic patterns are open-ended by\ndesign, leading to a gap between the concepts of DDD and the design of\nmicroservices. This gap is especially evident in migration tools that identify\nmicroservices from monoliths, where candidate decompositions into microservices\nprovide little in terms of DDD refactoring and visualization. This paper\nproposes a solution to this problem by extending the operational pipeline of a\nmulti-strategy microservice identification tool, called Mono2Micro, with a DDD\nmodeling tool that provides a language, called Context Mapper DSL (CML), for\nformalizing the most relevant DDD concepts. The extension maps the content of\nthe candidate decompositions, which include clusters, entities, and\nfunctionalities, to CML constructs that represent DDD concepts such as Bounded\nContext, Aggregate, Entity, and Service, among others. The results are\nvalidated with a case study by comparing the candidate decompositions resulting\nfrom a real-world monolith application with and without CML translation.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"Qj8auEuVhIWuz59A_ujQolR_yPeyb9GPfPRpsmPwOsI","pdfSize":"2633376"}