{"id":"2407.02967","title":"Achieving High Throughput with a Trainable Neural-Network-Based\n  Equalizer for Communications on FPGA","authors":"Jonas Ney, Norbert Wehn","authorsParsed":[["Ney","Jonas",""],["Wehn","Norbert",""]],"versions":[{"version":"v1","created":"Wed, 3 Jul 2024 10:03:03 GMT"}],"updateDate":"2024-07-04","timestamp":1720000983000,"abstract":"  The ever-increasing data rates of modern communication systems lead to severe\ndistortions of the communication signal, imposing great challenges to\nstate-of-the-art signal processing algorithms. In this context, neural network\n(NN)-based equalizers are a promising concept since they can compensate for\nimpairments introduced by the channel. However, due to the large computational\ncomplexity, efficient hardware implementation of NNs is challenging. Especially\nthe backpropagation algorithm, required to adapt the NN's parameters to varying\nchannel conditions, is highly complex, limiting the throughput on\nresource-constrained devices like field programmable gate arrays (FPGAs). In\nthis work, we present an FPGA architecture of an NN-based equalizer that\nexploits batch-level parallelism of the convolutional layer to enable a custom\nmapping scheme of two multiplication to a single digital signal processor\n(DSP). Our implementation achieves a throughput of up to 20 GBd, which enables\nthe equalization of high-data-rate nonlinear optical fiber channels while\nproviding adaptation capabilities by retraining the NN using backpropagation.\nAs a result, our FPGA implementation outperforms an embedded graphics\nprocessing unit (GPU) in terms of throughput by two orders of magnitude.\nFurther, we achieve a higher energy efficiency and throughput as\nstate-of-the-art NN training FPGA implementations. Thus, this work fills the\ngap of high-throughput NN-based equalization while enabling adaptability by NN\ntraining on the edge FPGA.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"2rVTc3PIuBvQlepo6iSRWJ39lePW_d8E37BRH95HAl4","pdfSize":"230575"}