{"id":"2407.02640","title":"Subpath-Based Column Generation for the Electric Routing-Scheduling\n  Problem","authors":"Alexandre Jacquillat, Sean Lo","authorsParsed":[["Jacquillat","Alexandre",""],["Lo","Sean",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 20:13:27 GMT"}],"updateDate":"2024-07-04","timestamp":1719951207000,"abstract":"  Motivated by widespread electrification targets, this paper studies an\nelectric routing-scheduling problem (ERSP) that jointly optimizes\nrouting-scheduling and charging decisions. The ERSP is formulated as a\nsemi-infinite set-partitioning model, where continuous charging decisions\nresult in infinitely-many path-based variables. To solve it, we develop a\ncolumn generation algorithm with a bi-level label-setting algorithm to\ndecompose the pricing problem into (i) a first-level procedure to generate\nsubpaths between charging stations, and (ii) a second-level procedure to\ncombine subpaths into paths. We formalize subpath-based domination properties\nto establish the finite convergence and exactness of the column generation\nalgorithm. We prove that the methodology can handle modeling extensions with\nheterogeneous charging costs (via dynamic re-optimization of charging\ndecisions) and algorithm extensions to tighten the relaxation using ng-routes\nand limited-memory subset-row inequalities (via augmented domination criteria).\nComputational results show that the methodology scales to large instances,\noutperforming state-of-the-art column generation algorithms. From a practical\nstandpoint, the methodology achieves significant cost reductions by jointly\noptimizing routing-scheduling and charging decisions and by capturing\nheterogeneous charging costs.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"4yl6CCCEHTwFZlX94CTOYHBL8DDndpOoSt-5CcPx8bk","pdfSize":"1580208","objectId":"0xb831880e932ca5cc7f2fb4246ddb94b68e1809bf3fb0821f3b66b41df63089e5","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
