{"id":"2407.02031","title":"SwiftDiffusion: Efficient Diffusion Model Serving with Add-on Modules","authors":"Suyi Li, Lingyun Yang, Xiaoxiao Jiang, Hanfeng Lu, Zhipeng Di, Weiyi\n  Lu, Jiawei Chen, Kan Liu, Yinghao Yu, Tao Lan, Guodong Yang, Lin Qu, Liping\n  Zhang, Wei Wang","authorsParsed":[["Li","Suyi",""],["Yang","Lingyun",""],["Jiang","Xiaoxiao",""],["Lu","Hanfeng",""],["Di","Zhipeng",""],["Lu","Weiyi",""],["Chen","Jiawei",""],["Liu","Kan",""],["Yu","Yinghao",""],["Lan","Tao",""],["Yang","Guodong",""],["Qu","Lin",""],["Zhang","Liping",""],["Wang","Wei",""]],"versions":[{"version":"v1","created":"Tue, 2 Jul 2024 07:59:08 GMT"}],"updateDate":"2024-07-03","timestamp":1719907148000,"abstract":"  This paper documents our characterization study and practices for serving\ntext-to-image requests with stable diffusion models in production. We first\ncomprehensively analyze inference request traces for commercial text-to-image\napplications. It commences with our observation that add-on modules, i.e.,\nControlNets and LoRAs, that augment the base stable diffusion models, are\nubiquitous in generating images for commercial applications. Despite their\nefficacy, these add-on modules incur high loading overhead, prolong the serving\nlatency, and swallow up expensive GPU resources. Driven by our characterization\nstudy, we present SwiftDiffusion, a system that efficiently generates\nhigh-quality images using stable diffusion models and add-on modules. To\nachieve this, SwiftDiffusion reconstructs the existing text-to-image serving\nworkflow by identifying the opportunities for parallel computation and\ndistributing ControlNet computations across multiple GPUs. Further,\nSwiftDiffusion thoroughly analyzes the dynamics of image generation and\ndevelops techniques to eliminate the overhead associated with LoRA loading and\npatching while preserving the image quality. Last, SwiftDiffusion proposes\nspecialized optimizations in the backbone architecture of the stable diffusion\nmodels, which are also compatible with the efficient serving of add-on modules.\nCompared to state-of-the-art text-to-image serving systems, SwiftDiffusion\nreduces serving latency by up to 5x and improves serving throughput by up to 2x\nwithout compromising image quality.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"x5cPVT6RuJ3aIU42c5Zd1v89ahAw80sSu6SDtjD5VTw","pdfSize":"3761227"}