{"id":"2407.06422","title":"Exploring the Capability of ChatGPT to Reproduce Human Labels for Social\n  Computing Tasks (Extended Version)","authors":"Yiming Zhu, Peixian Zhang, Ehsan-Ul Haq, Pan Hui, Gareth Tyson","authorsParsed":[["Zhu","Yiming",""],["Zhang","Peixian",""],["Haq","Ehsan-Ul",""],["Hui","Pan",""],["Tyson","Gareth",""]],"versions":[{"version":"v1","created":"Mon, 8 Jul 2024 22:04:30 GMT"}],"updateDate":"2024-07-10","timestamp":1720476270000,"abstract":"  Harnessing the potential of large language models (LLMs) like ChatGPT can\nhelp address social challenges through inclusive, ethical, and sustainable\nmeans. In this paper, we investigate the extent to which ChatGPT can annotate\ndata for social computing tasks, aiming to reduce the complexity and cost of\nundertaking web research. To evaluate ChatGPT's potential, we re-annotate seven\ndatasets using ChatGPT, covering topics related to pressing social issues like\nCOVID-19 misinformation, social bot deception, cyberbully, clickbait news, and\nthe Russo-Ukrainian War. Our findings demonstrate that ChatGPT exhibits promise\nin handling these data annotation tasks, albeit with some challenges. Across\nthe seven datasets, ChatGPT achieves an average annotation F1-score of 72.00%.\nIts performance excels in clickbait news annotation, correctly labeling 89.66%\nof the data. However, we also observe significant variations in performance\nacross individual labels. Our study reveals predictable patterns in ChatGPT's\nannotation performance. Thus, we propose GPT-Rater, a tool to predict if\nChatGPT can correctly label data for a given annotation task. Researchers can\nuse this to identify where ChatGPT might be suitable for their annotation\nrequirements. We show that GPT-Rater effectively predicts ChatGPT's\nperformance. It performs best on a clickbait headlines dataset by achieving an\naverage F1-score of 95.00%. We believe that this research opens new avenues for\nanalysis and can reduce barriers to engaging in social computing research.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"eEosspJsPSXIKiZ-c16WSZYLOYgRl9guRNSyR879MBk","pdfSize":"900926"}
