{"id":"2407.09400","title":"Cosmic topology. Part IIIa. Microwave background parity violation\n  without parity-violating microphysics","authors":"Amirhossein Samandar, Javier Carr\\'on Duque, Craig J. Copi, Mikel\n  Martin Barandiaran, Deyan P. Mihaylov, Thiago S. Pereira, Glenn D. Starkman,\n  Yashar Akrami, Stefano Anselmi, Fernando Cornet-Gomez, Johannes R. Eskilt,\n  Andrew H. Jaffe, Arthur Kosowsky, Andrius Tamosiunas (COMPACT Collaboration)","authorsParsed":[["Samandar","Amirhossein","","COMPACT Collaboration"],["Duque","Javier Carrón","","COMPACT Collaboration"],["Copi","Craig J.","","COMPACT Collaboration"],["Barandiaran","Mikel Martin","","COMPACT Collaboration"],["Mihaylov","Deyan P.","","COMPACT Collaboration"],["Pereira","Thiago S.","","COMPACT Collaboration"],["Starkman","Glenn D.","","COMPACT Collaboration"],["Akrami","Yashar","","COMPACT Collaboration"],["Anselmi","Stefano","","COMPACT Collaboration"],["Cornet-Gomez","Fernando","","COMPACT Collaboration"],["Eskilt","Johannes R.","","COMPACT Collaboration"],["Jaffe","Andrew H.","","COMPACT Collaboration"],["Kosowsky","Arthur","","COMPACT Collaboration"],["Tamosiunas","Andrius","","COMPACT Collaboration"]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 16:23:17 GMT"}],"updateDate":"2024-07-15","timestamp":1720801397000,"abstract":"  The standard cosmological model, which assumes statistical isotropy and\nparity invariance, predicts the absence of correlations between even-parity and\nodd-parity observables of the cosmic microwave background (CMB). Contrary to\nthese predictions, large-angle CMB temperature anomalies generically involve\ncorrelations between even-$\\ell$ and odd-$\\ell$ angular power spectrum\n$C_\\ell$, while recent analyses of CMB polarization have revealed non-zero\nequal-$\\ell$ $EB$ correlations. These findings challenge the conventional\nunderstanding, suggesting deviations from statistical isotropy, violations of\nparity, or both. Cosmic topology, which involves changing only the boundary\nconditions of space relative to standard cosmology, offers a compelling\nframework to potentially account for such parity-violating observations.\nTopology inherently breaks statistical isotropy, and can also break homogeneity\nand parity, providing a natural paradigm for explaining observations of\nparity-breaking observables without the need to add parity violation to the\nunderlying microphysics. Our investigation delves into the harmonic space\nimplications of topology for CMB correlations, using as an illustrative example\n$EB$ correlations generated by tensor perturbations under both\nparity-preserving and parity-violating scenarios. Consequently, these findings\nnot only challenge the foundational assumptions of the standard cosmological\nmodel but also open new avenues for exploring the topological structure of the\nUniverse through CMB observations.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"sotJIell190OULmojma3AQ82eKYqv-_PdZzBCHJQ7Mg","pdfSize":"1537295"}