{"id":"2407.05200","title":"First Results from the Dragonfly Ultrawide Survey: the Largest Eleven\n  Quenched Diffuse Dwarf Galaxies in 3100 deg$^2$ with Spectroscopic\n  Confirmation","authors":"Zili Shen, William P. Bowman, Pieter van Dokkum, Roberto G. Abraham,\n  Imad Pasha, Michael A. Keim, Qing Liu, Deborah M. Lokhorst, Steven R.\n  Janssens, Seery Chen","authorsParsed":[["Shen","Zili",""],["Bowman","William P.",""],["van Dokkum","Pieter",""],["Abraham","Roberto G.",""],["Pasha","Imad",""],["Keim","Michael A.",""],["Liu","Qing",""],["Lokhorst","Deborah M.",""],["Janssens","Steven R.",""],["Chen","Seery",""]],"versions":[{"version":"v1","created":"Sat, 6 Jul 2024 22:29:34 GMT"}],"updateDate":"2024-07-09","timestamp":1720304974000,"abstract":"  The Dragonfly Telephoto Array employs a unique design to detect very large\nand diffuse galaxies, which might be missed with conventional telescopes. The\nDragonfly Ultrawide Survey (DFUWS) is a new wide-field survey which will cover\n10,000 deg$^2$ of the northern sky, and it provides an ideal dataset to find\nthese large diffuse galaxies. From 3100 deg$^2$ of DFUWS data, we identified\neleven large, low surface brightness galaxies as a pilot sample for\nspectroscopic follow-up. These are the largest galaxies in the examined area\nthat appear smooth and isolated, with effective radii of 12\"-27\". Eight are\nbelow 24 $\\mathrm{mag\\,arcsec^{-2}}$ in central $g$-band surface brightness.\nKeck Cosmic Web Imager (KCWI) spectra of the diffuse light show that all eleven\ngalaxies in this sample are quiescent, and seven qualify as ultra-diffuse\ngalaxies (UDGs). Eight galaxies have distances between 15 and 30 Mpc, while the\nother three are in the Pegasus cluster at 50 Mpc. Their spectra show evidence\nof a $\\sim 1$Gyr old stellar population in addition to an even older stellar\npopulation. The intermediate-age component is present in group and satellite\ngalaxies but not in the Pegasus cluster UDGs. All galaxies in this sample are\ndetected in both Dragonfly and Legacy imaging, and the sample partially\noverlaps with existing UDG catalogs. This pilot sample provides an excellent\ntraining set for our analysis of the upcoming full 10,000 deg$^2$ DFUWS data,\nfrom which we may expect to discover even larger, previously-unknown galaxies.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"mmR_GF38m-CQToLdXLbxuIdC5hC8kPzSmdxnymmMTBk","pdfSize":"4803596"}