{"id":"2407.07192","title":"The mouth speaks as much as the eyes: Free-ranging dogs depend on inner\n  facial features for human recognition","authors":"Rohan Sarkar, Tuhin Subhra Pal, Sandip Murmu, Anindita Bhadra","authorsParsed":[["Sarkar","Rohan",""],["Pal","Tuhin Subhra",""],["Murmu","Sandip",""],["Bhadra","Anindita",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 19:22:19 GMT"}],"updateDate":"2024-07-11","timestamp":1720552939000,"abstract":"  The human face is a multi-signal system continuously transmitting information\nof identity and emotion. In shared human-animal environments, the face becomes\na reliable tool of heterospecific recognition. Because humans display mixed\nbehaviour and pose differential risk to animals, adaptable decision-making\nbased on recognition and classification of humans confer a fitness benefit. The\nhuman-dog dyad is an ideal model to study heterospecific recognition due to\ntheir shared history, niche overlap, and cognitive co-evolution. Multiple\nstudies on pet dogs have examined their human facial information processing.\nHowever, no study has examined these perceptual abilities in free-living\npopulations in their natural habitat where the human-dog relationship is more\ncomplex and impacts survival. Comprehensive behavioural analysis of 416\nfree-ranging dogs in an approach-based task with differential facial occlusion\nof a human, demonstrated that these dogs recognize and discriminate between\nfamiliar and unfamiliar people. Negative behaviours like aggression and\navoidance were unlikely to be displayed. Inner facial components like eyes,\nnose and mouth were more important than outer components like hair in human\nrecognition. Unlike in pet dogs, the occlusion of even a single inner component\nof the face prevented recognition by facial cue alone. Personality and habitat\nconditions influenced the behavioural strategy adopted by the dogs too.\nConsidering the ambiguous nature of human interactions, recognition and\nresponse in free-ranging dogs relied on dual assessment of identity and intent\nof a human based, in part, on their ontogeny. Such a cue-processing system\nhighlights the selection pressures inherent in the unpredictable environment of\nfree-living populations.\n","subjects":["Quantitative Biology/Neurons and Cognition","Quantitative Biology/Quantitative Methods"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Zcf9iUI94KFoZxIiCP8O8XxaERpS3ufaY50jj_Ow1W8","pdfSize":"2039527"}