{"id":"2407.14337","title":"Do Slip-Weakening Laws Shapes Influence Rupture Dynamics?","authors":"Roxane Ferry and Jean-Fran\\c{c}ois Molinari","authorsParsed":[["Ferry","Roxane",""],["Molinari","Jean-François",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 14:16:50 GMT"}],"updateDate":"2024-07-22","timestamp":1721398610000,"abstract":"  To model rupture dynamics, a friction law must be assumed. Commonly used\nconstitutive laws for modeling friction include slip-weakening laws which are\ncharacterized by a drop from static to dynamic frictional stress. Within this\nframework, the prevailing understanding asserts that the frictional behavior is\nsolely controlled by the fracture energy -- the area beneath the frictional\nstress versus the cumulative slip curve. In particular, it is claimed that the\ncurve's shape itself has no influence on the system's response. Here we perform\nfully dynamic rupture simulations to challenge prevailing beliefs by\ndemonstrating that the constitutive law shape exerts an intimate control over\nrupture profiles. For a consistent fracture energy but varying constitutive law\nshapes, the velocity profile is different: each abrupt slope transition leads\nto the localization of a distinct velocity peak. For example, in the case of a\nbilinear slip-weakening law featuring two different slopes, the rupture\nexhibits two distinct velocity peaks. This phenomenon arises from the\ntransition between a constant weakening rate to another. However, this\ndistinction does not seem to influence how a rupture responds to a stress\nbarrier or the cumulative radiated energy emitted. These results are derived\nthrough two separate numerical schemes (spectral boundary integral and finite\nelement methods) ensuring their independence from the computational approach\nemployed.\n","subjects":["Physics/Geophysics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"5aIhoWvoFbQ5gbkNOIDZB7TkAjM4mYwbdd7JfpdlvuA","pdfSize":"568553","objectId":"0x4747e4c24e4ffb4aed51640cee9bcd8c9c76ce492ade24488e07a80b7a4c9969","registeredEpoch":"1","certifiedEpoch":"1","startEpoch":"1","endEpoch":"201"}
