{"id":"2407.00267","title":"Learning a Clinically-Relevant Concept Bottleneck for Lesion Detection\n  in Breast Ultrasound","authors":"Arianna Bunnell, Yannik Glaser, Dustin Valdez, Thomas Wolfgruber,\n  Aleen Altamirano, Carol Zamora Gonz\\'alez, Brenda Y. Hernandez, Peter\n  Sadowski and John A. Shepherd","authorsParsed":[["Bunnell","Arianna",""],["Glaser","Yannik",""],["Valdez","Dustin",""],["Wolfgruber","Thomas",""],["Altamirano","Aleen",""],["González","Carol Zamora",""],["Hernandez","Brenda Y.",""],["Sadowski","Peter",""],["Shepherd","John A.",""]],"versions":[{"version":"v1","created":"Sat, 29 Jun 2024 00:44:33 GMT"}],"updateDate":"2024-07-02","timestamp":1719621873000,"abstract":"  Detecting and classifying lesions in breast ultrasound images is a promising\napplication of artificial intelligence (AI) for reducing the burden of cancer\nin regions with limited access to mammography. Such AI systems are more likely\nto be useful in a clinical setting if their predictions can be explained to a\nradiologist. This work proposes an explainable AI model that provides\ninterpretable predictions using a standard lexicon from the American College of\nRadiology's Breast Imaging and Reporting Data System (BI-RADS). The model is a\ndeep neural network featuring a concept bottleneck layer in which known BI-RADS\nfeatures are predicted before making a final cancer classification. This\nenables radiologists to easily review the predictions of the AI system and\npotentially fix errors in real time by modifying the concept predictions. In\nexperiments, a model is developed on 8,854 images from 994 women with expert\nannotations and histological cancer labels. The model outperforms\nstate-of-the-art lesion detection frameworks with 48.9 average precision on the\nheld-out testing set, and for cancer classification, concept intervention is\nshown to increase performance from 0.876 to 0.885 area under the receiver\noperating characteristic curve. Training and evaluation code is available at\nhttps://github.com/hawaii-ai/bus-cbm.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"b9sYAJjqAK5ULvk1JnuOYnOzpVT7-49wYAhuAD1uyUw","pdfSize":"433823"}