{"id":"2407.08932","title":"Deep Attention Driven Reinforcement Learning (DAD-RL) for Autonomous\n  Vehicle Decision-Making in Dynamic Environment","authors":"Jayabrata Chowdhury, Venkataramanan Shivaraman, Sumit Dangi, Suresh\n  Sundaram and P.B.Sujit","authorsParsed":[["Chowdhury","Jayabrata",""],["Shivaraman","Venkataramanan",""],["Dangi","Sumit",""],["Sundaram","Suresh",""],["Sujit","P. B.",""]],"versions":[{"version":"v1","created":"Fri, 12 Jul 2024 02:34:44 GMT"}],"updateDate":"2024-07-15","timestamp":1720751684000,"abstract":"  Autonomous Vehicle (AV) decision making in urban environments is inherently\nchallenging due to the dynamic interactions with surrounding vehicles. For safe\nplanning, AV must understand the weightage of various spatiotemporal\ninteractions in a scene. Contemporary works use colossal transformer\narchitectures to encode interactions mainly for trajectory prediction,\nresulting in increased computational complexity. To address this issue without\ncompromising spatiotemporal understanding and performance, we propose the\nsimple Deep Attention Driven Reinforcement Learning (DADRL) framework, which\ndynamically assigns and incorporates the significance of surrounding vehicles\ninto the ego's RL driven decision making process. We introduce an AV centric\nspatiotemporal attention encoding (STAE) mechanism for learning the dynamic\ninteractions with different surrounding vehicles. To understand map and route\ncontext, we employ a context encoder to extract features from context maps. The\nspatiotemporal representations combined with contextual encoding provide a\ncomprehensive state representation. The resulting model is trained using the\nSoft Actor Critic (SAC) algorithm. We evaluate the proposed framework on the\nSMARTS urban benchmarking scenarios without traffic signals to demonstrate that\nDADRL outperforms recent state of the art methods. Furthermore, an ablation\nstudy underscores the importance of the context-encoder and spatio temporal\nattention encoder in achieving superior performance.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"-3K49KhljWtgeMnG-x2qfcosTy9Hcj_62ZyCAso7E4w","pdfSize":"618838","objectId":"0xd6f1e51de95202b6cd79d7d797b699ad5e3e2ef3ab015ad22db59ec49be18a24","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
