{"id":"2407.13495","title":"Identifying Research Hotspots and Future Development Trends in Current\n  Psychology: A Bibliometric Analysis of the Past Decade's Publications","authors":"Shen Liu, Yan Yang","authorsParsed":[["Liu","Shen",""],["Yang","Yan",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 13:24:48 GMT"}],"updateDate":"2024-07-19","timestamp":1721309088000,"abstract":"  By conducting a bibliometric analysis on 4,869 publications in Current\nPsychology from 2013 to 2022, this paper examined the annual publications and\nannual citations, as well as the leading institutions, countries, and keywords.\nCiteSpace, VOSviewer and SCImago Graphica were utilized for visualization\nanalysis. On one hand, this paper analyzed the academic influence of Current\nPsychology over the past decade. On the other hand, it explored the research\nhotspots and future development trends within the field of international\npsychology. The results revealed that the three main research areas covered in\nthe publications of Current Psychology were: the psychological well-being of\nyoung people, the negative emotions of adults, and self-awareness and\nmanagement. The latest research hotspots highlighted in the journal include\nnegative emotions, personality, and mental health. The three main development\ntrends of Current Psychology are: 1) exploring the personality psychology of\nboth adolescents and adults, 2) promoting the interdisciplinary research to\nstudy social psychological issues through the use of diversified research\nmethods, and 3) emphasizing the emotional psychology of individuals and their\ninteraction with social reality, from a people-oriented perspective.\n","subjects":["Computing Research Repository/Digital Libraries","Statistics/Methodology","Statistics/Other Statistics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_Pm6C_hkz0n5d2ykZOxWRiO_bN1sXaSWDFaSM-GwT1w","pdfSize":"1378316","objectId":"0x370ecd5d45ac1b7c4c8093b322828255cdff7bd4508b94b036b3476e87ab3dd6","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
