{"id":"2407.11621","title":"Kohn-Luttinger-like mechanism for unconventional charge density waves","authors":"Hannes Braun, Michael M. Scherer, Laura Classen","authorsParsed":[["Braun","Hannes",""],["Scherer","Michael M.",""],["Classen","Laura",""]],"versions":[{"version":"v1","created":"Tue, 16 Jul 2024 11:33:14 GMT"}],"updateDate":"2024-07-17","timestamp":1721129594000,"abstract":"  Interaction-induced charge orders with electronic origin occur as states of\nspontaneously broken symmetry in several materials platforms. An electronic\nmechanism for charge order requires an attractive component in the effective\ncharge vertex. We put forward such a mechanism for the formation of\nunconventional charge density waves in a metal. These states result from the\ncondensation of particle-hole pairs with finite wave vector and non-zero\nangular momentum and correspond to bond or loop current order on a lattice. The\nmechanism we describe can be viewed as Kohn Luttinger analysis in the\nparticle-hole channel with finite transferred momentum. It incorporates\none-loop spin and pairing correctionsn, which are then used as an input for a\nsummation in the charge channel triggering an instability. We extend our\nanalysis to a spin-fluctuation approach, where the effective charge interaction\nis dressed by the particle-hole ladder with exchanged momentum. We argue that\nthis mechanism works for weakly-interacting metals with nested Fermi surface\nand a large number of fermion flavors. We apply the Kohn-Luttinger-like\napproach to square- and triangular-lattice Hubbard models with SU($N_f$)\nflavour symmetry and show that it leads to different types of $p$-wave charge\ndensity waves. We also study effects beyond weak coupling at and away from Van\nHove filling in terms of a phenomenological model with additional exchange\ninteraction. In the vicinity of Van Hove filling, we obtain $d$-wave charge\ndensity waves with wave vectors determined by nesting as leading instabilities.\nIn addition, we find another charge density wave with wave vector $K/4$ on the\ntriangular lattice on both sides of Van Hove filling. We demonstrate that this\n$K/4$ instability can win the competition against pairing for $N_f=4$ via an\nunbiased functional renormalisation group calculation.\n","subjects":["Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"R1xn3zwUG-FfmZ5Frj0HwkNRk3OFKzMz9Z68gePbWQo","pdfSize":"8753004"}