{"id":"2407.11187","title":"The future looks dark: improving high contrast imaging with\n  hyper-parameter optimization for data-driven predictive wavefront control","authors":"J. Fowler, Rebecca Jensen-Clem, Maaike A. M. van Kooten, Vincent\n  Chambouleyron, Sylvain Cetre","authorsParsed":[["Fowler","J.",""],["Jensen-Clem","Rebecca",""],["van Kooten","Maaike A. M.",""],["Chambouleyron","Vincent",""],["Cetre","Sylvain",""]],"versions":[{"version":"v1","created":"Mon, 15 Jul 2024 19:19:56 GMT"}],"updateDate":"2024-07-17","timestamp":1721071196000,"abstract":"  The direct imaging and characterization of exoplanets requires extreme\nadaptive optics (XAO), achieving exquisite wavefront correction (upwards of\n90$\\%$ Strehl) over a narrow field of view (a few arcseconds). For these XAO\nsystems the temporal error is often a leading term in the error budget, wherein\nthe wavefront evolves faster than the lag between wavefront sensing and\ncontrol. For atmospheres with high-velocity wind layers, this can result in a\nwind-driven halo in the coronagraphic dark-zone, limiting sensitivity to faint,\nclose-in companions. The AO system's lag-time is often limited by the wavefront\nsensor exposure time, especially in the case of fainter guidestars. Predictive\ncontrol mitigates the temporal error by predicting the shape of the wavefront\nby time the system correction is applied. One such method of prediction is\nempirical orthogonal functions (EOF), wherein previous states in the wavefront\nsensor history are used to learn linear correlations with a minimization\nproblem. This method has been demonstrated on-sky at Subaru/SCExAO and\nKeck/NIRC2, but has yet to be optimized. With this work as a starting point, we\nexplore the optimal filter hyper-parameter space for implementing EOF on-sky,\nstudy its stability under varying atmospheric parameters, and discuss future\npaths for facilitization of predictive control. This work not only offers a\npathway to optimize Keck and Subaru observing, but also acts as a pathfinder\nfor predictive control methods with extremely large telescopes.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0K6ICiR1ZSvrMR7LUVC2Xd1FF5KDU-3DUm3YfC214VE","pdfSize":"2656148"}