{"id":"2407.07125","title":"Rapid Parameter Estimation for Merging Massive Black Hole Binaries Using\n  ODE-Based Generative Models","authors":"Bo Liang, Minghui Du, He Wang, Yuxiang Xu, Chang Liu, Xiaotong Wei,\n  Peng Xu, Li-e Qiang, Ziren Luo","authorsParsed":[["Liang","Bo",""],["Du","Minghui",""],["Wang","He",""],["Xu","Yuxiang",""],["Liu","Chang",""],["Wei","Xiaotong",""],["Xu","Peng",""],["Qiang","Li-e",""],["Luo","Ziren",""]],"versions":[{"version":"v1","created":"Tue, 9 Jul 2024 07:05:53 GMT"}],"updateDate":"2024-07-11","timestamp":1720508753000,"abstract":"  Detecting the coalescences of massive black hole binaries (MBHBs) is one of\nthe primary targets for space-based gravitational wave observatories such as\nLISA, Taiji, and Tianqin. The fast and accurate parameter estimation of merging\nMBHBs is of great significance for both astrophysics and the global fitting of\nall resolvable sources. However, such analyses entail significant computational\ncosts. To address these challenges, inspired by the latest progress in\ngenerative models, we proposed a novel artificial intelligence (AI) based\nparameter estimation method called Variance Preserving Flow Matching Posterior\nEstimation (VPFMPE). Specifically, we utilize triangular interpolation to\nmaintain variance over time, thereby constructing a transport path for training\ncontinuous normalization flows. Compared to the simple linear interpolation\nmethod used in flow matching to construct the optimal transport path, our\napproach better captures continuous temporal variations, making it more\nsuitable for the parameter estimation of MBHBs. Additionally, we creatively\nintroduce a parameter transformation method based on the symmetry in the\ndetector's response function. This transformation is integrated within VPFMPE,\nallowing us to train the model using a simplified dataset, and then perform\nparameter estimation on more general data, hence also acting as a crucial\nfactor in improving the training speed. In conclusion, for the first time,\nwithin a comprehensive and reasonable parameter range, we have achieved a\ncomplete and unbiased 11-dimensional rapid inference for MBHBs in the presence\nof astrophysical confusion noise using ODE-based generative models. In the\nexperiments based on simulated data, our model produces posterior distributions\ncomparable to those obtained by nested sampling.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Astrophysics/Instrumentation and Methods for Astrophysics","Physics/Data Analysis, Statistics and Probability"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"JfDc3HcyJ3K5PhI9k67scO3IdVbwB8qqDBSmDp1Ctro","pdfSize":"2300671"}