{"id":"2407.13867","title":"Nonmetricity and Poincare gauge gravity","authors":"James T. Wheeler","authorsParsed":[["Wheeler","James T.",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 19:25:17 GMT"}],"updateDate":"2024-07-22","timestamp":1721330717000,"abstract":"  We show that in a spacetime geometry with general connection, there exist\nfield redefinitions that replace the mixed-symmetry nonmetricity of the\nasymmetric connection with the sum of torsion and the field strength of special\nconformal transformations of a Lorentzian connection. In contrast to general\nrelativity, generic action functionals give different results for metric versus\nPalatini-style variations. We consider some of the resulting issues in\nPoincar\\`e gauge theory, where it is natural to vary both the solder form and\nthe spin connection, and where the action may differ from the Einstein-Hilbert\ncase. Independent variation may introduce nonmetricity as well as torsion.\nAppending the defining equation of nonmetricity to the Maurer-Cartan equations\nof the Poincar\\`e Lie algebra, we show that the mixed symmetry components of\nnonmetricity can be absorbed into an altered torsion tensor, restoring local\nLorentz symmetry and metric compatibility while including quadratic terms in\nthe redefined curvature. In order to recover the original torsion and nonmetric\nfields, we replace the definition of nonmetricity by an additional structure\nequation. We show that the maximal Lie algebra compatible with the enlarged set\nis isomorphic to the conformal Lie algebra. Therefore, in a Lorentzian\nconformal geometry the sum of torsion and the field strength of special\nconformal transformations is given by the mixed symmetry nonmetricity of an\nequivalent asymmetric system.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Theory","Physics/Mathematical Physics","Mathematics/Mathematical Physics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"PNwOHGH4biIE_c0WOpO8PS3pwcXMrt4WVsPeIVk3S2I","pdfSize":"206361","objectId":"0xcc3709cd7fd29e8a4adb56c91ba45d711c1940e63f5822365cf02b4fd7578460","registeredEpoch":"3","certifiedEpoch":"3","startEpoch":"3","endEpoch":"203"}
