{"id":"2407.14066","title":"360VFI: A Dataset and Benchmark for Omnidirectional Video Frame\n  Interpolation","authors":"Wenxuan Lu, Mengshun Hu, Yansheng Qiu, Liang Liao, Zheng Wang","authorsParsed":[["Lu","Wenxuan",""],["Hu","Mengshun",""],["Qiu","Yansheng",""],["Liao","Liang",""],["Wang","Zheng",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 06:50:24 GMT"},{"version":"v2","created":"Mon, 22 Jul 2024 13:50:55 GMT"},{"version":"v3","created":"Mon, 9 Sep 2024 03:06:21 GMT"}],"updateDate":"2024-09-10","timestamp":1721371824000,"abstract":"  Head-mounted 360{\\deg} displays and portable 360{\\deg} cameras have\nsignificantly progressed, providing viewers a realistic and immersive\nexperience. However, many omnidirectional videos have low frame rates that can\nlead to visual fatigue, and the prevailing plane frame interpolation\nmethodologies are unsuitable for omnidirectional video interpolation because\nthey are designed solely for traditional videos. This paper introduces the\nbenchmark dataset, 360VFI, for Omnidirectional Video Frame Interpolation. We\npresent a practical implementation that introduces a distortion prior from\nomnidirectional video into the network to modulate distortions. Specifically,\nwe propose a pyramid distortion-sensitive feature extractor that uses the\nunique characteristics of equirectangular projection (ERP) format as prior\ninformation. Moreover, we devise a decoder that uses an affine transformation\nto further facilitate the synthesis of intermediate frames. 360VFI is the first\ndataset and benchmark that explores the challenge of Omnidirectional Video\nFrame Interpolation. Through our benchmark analysis, we present four different\ndistortion condition scenes in the proposed 360VFI dataset to evaluate the\nchallenges triggered by distortion during interpolation. Besides, experimental\nresults demonstrate that Omnidirectional Video Interpolation can be effectively\nimproved by modeling for omnidirectional distortion.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning","Computing Research Repository/Multimedia"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"aNGKn1dOJqE1AoF6HvzYOXTcLq0lqgYBhfdltPAHya8","pdfSize":"3170300"}