{"id":"2407.17108","title":"Quanv4EO: Empowering Earth Observation by means of Quanvolutional Neural\n  Networks","authors":"Alessandro Sebastianelli, Francesco Mauro, Giulia Ciabatti, Dario\n  Spiller, Bertrand Le Saux, Paolo Gamba, Silvia Ullo","authorsParsed":[["Sebastianelli","Alessandro",""],["Mauro","Francesco",""],["Ciabatti","Giulia",""],["Spiller","Dario",""],["Saux","Bertrand Le",""],["Gamba","Paolo",""],["Ullo","Silvia",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 09:11:34 GMT"}],"updateDate":"2024-07-25","timestamp":1721812294000,"abstract":"  A significant amount of remotely sensed data is generated daily by many Earth\nobservation (EO) spaceborne and airborne sensors over different countries of\nour planet. Different applications use those data, such as natural hazard\nmonitoring, global climate change, urban planning, and more. Many challenges\nare brought by the use of these big data in the context of remote sensing\napplications. In recent years, employment of machine learning (ML) and deep\nlearning (DL)-based algorithms have allowed a more efficient use of these data\nbut the issues in managing, processing, and efficiently exploiting them have\neven increased since classical computers have reached their limits. This\narticle highlights a significant shift towards leveraging quantum computing\ntechniques in processing large volumes of remote sensing data. The proposed\nQuanv4EO model introduces a quanvolution method for preprocessing\nmulti-dimensional EO data. First its effectiveness is demonstrated through\nimage classification tasks on MNIST and Fashion MNIST datasets, and later on,\nits capabilities on remote sensing image classification and filtering are\nshown. Key findings suggest that the proposed model not only maintains high\nprecision in image classification but also shows improvements of around 5\\% in\nEO use cases compared to classical approaches. Moreover, the proposed framework\nstands out for its reduced parameter size and the absence of training quantum\nkernels, enabling better scalability for processing massive datasets. These\nadvancements underscore the promising potential of quantum computing in\naddressing the limitations of classical algorithms in remote sensing\napplications, offering a more efficient and effective alternative for image\ndata classification and analysis.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Emerging Technologies","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"zsqnzTOoD01anlmcLkDYfZRCQPFrO6Ee-ulQDqYJUco","pdfSize":"13581576"}