{"id":"2407.18570","title":"A new family of binary sequences with a low correlation via elliptic\n  curves","authors":"Lingfei Jin, Liming Ma, Chaoping Xing and Runtian Zhu","authorsParsed":[["Jin","Lingfei",""],["Ma","Liming",""],["Xing","Chaoping",""],["Zhu","Runtian",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 07:51:39 GMT"}],"updateDate":"2024-07-29","timestamp":1721980299000,"abstract":"  In the realm of modern digital communication, cryptography, and signal\nprocessing, binary sequences with a low correlation properties play a pivotal\nrole. In the literature, considerable efforts have been dedicated to\nconstructing good binary sequences of various lengths. As a consequence,\nnumerous constructions of good binary sequences have been put forward. However,\nthe majority of known constructions leverage the multiplicative cyclic group\nstructure of finite fields $\\mathbb{F}_{p^n}$, where $p$ is a prime and $n$ is\na positive integer. Recently, the authors made use of the cyclic group\nstructure of all rational places of the rational function field over the finite\nfield $\\mathbb{F}_{p^n}$, and firstly constructed good binary sequences of\nlength $p^n+1$ via cyclotomic function fields over $\\mathbb{F}_{p^n}$ for any\nprime $p$ \\cite{HJMX24,JMX22}. This approach has paved a new way for\nconstructing good binary sequences. Motivated by the above constructions, we\nexploit the cyclic group structure on rational points of elliptic curves to\ndesign a family of binary sequences of length $2^n+1+t$ with a low correlation\nfor many given integers $|t|\\le 2^{(n+2)/2}$. Specifically, for any positive\ninteger $d$ with $\\gcd(d,2^n+1+t)=1$, we introduce a novel family of binary\nsequences of length $2^n+1+t$, size $q^{d-1}-1$, correlation bounded by $(2d+1)\n\\cdot 2^{(n+2)/2}+ |t|$, and a large linear complexity via elliptic curves.\n","subjects":["Mathematics/Number Theory","Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"-hBOx3Qg0-vYqSxXJIEkAtmAcyPKCmQ3ChuEgxQQWss","pdfSize":"249094"}