{"id":"2407.16589","title":"Hyperbolic embedding of brain networks detects regions disrupted by\n  neurodegeneration","authors":"Alice Longhena, Martin Guillemaud, Fabrizio De Vico Fallani, Raffaella\n  Lara Migliaccio, Mario Chavez","authorsParsed":[["Longhena","Alice",""],["Guillemaud","Martin",""],["Fallani","Fabrizio De Vico",""],["Migliaccio","Raffaella Lara",""],["Chavez","Mario",""]],"versions":[{"version":"v1","created":"Tue, 23 Jul 2024 15:43:03 GMT"}],"updateDate":"2024-07-24","timestamp":1721749383000,"abstract":"  Graph theoretical methods have proven valuable for investigating alterations\nin both anatomical and functional brain connectivity networks during\nAlzheimer's disease (AD). Recent studies suggest that representing brain\nnetworks in a suitable geometric space can better capture their connectivity\nstructure. This study introduces a novel approach to characterize brain\nconnectivity changes using low-dimensional, informative representations of\nnetworks in a latent geometric space. Specifically, the networks are embedded\nin the Poincar\\'e disk model of hyperbolic geometry. Here, we define a local\nmeasure of distortion of the geometric neighborhood of a node following a\nperturbation. The method is applied to a brain networks dataset of patients\nwith AD and healthy participants, derived from DWI and fMRI scans. We show\nthat, compared with standard graph measures, our method identifies more\naccurately the brain regions most affected by neurodegeneration. Notably, the\nabnormality detection in memory-related and frontal areas are robust across\nmultiple brain parcellation scales. Finally, our findings suggest that the\ngeometric perturbation score could serve as a potential biomarker for\ncharacterizing disease progression.\n","subjects":["Quantitative Biology/Neurons and Cognition","Quantitative Biology/Quantitative Methods"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"HVP0ylF1QroUSTwYGvmWKLhiOZGMAqNBekTrZOsKjJQ","pdfSize":"2751000"}