{"id":"2407.21759","title":"Optimal price signal generation for demand-side energy management","authors":"Seyed Shahabaldin Tohidi, Henrik Madsen, Davide Cal\\`i, Tobias K. S.\n  Ritschel","authorsParsed":[["Tohidi","Seyed Shahabaldin",""],["Madsen","Henrik",""],["Calì","Davide",""],["Ritschel","Tobias K. S.",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 17:28:31 GMT"}],"updateDate":"2024-08-01","timestamp":1722446911000,"abstract":"  Renewable Energy Sources play a key role in smart energy systems. To achieve\n100% renewable energy, utilizing the flexibility potential on the demand side\nbecomes the cost-efficient option to balance the grid. However, it is not\ntrivial to exploit these available capacities and flexibility options\nprofitably. The amount of available flexibility is a complex and time-varying\nfunction of the price signal and weather forecasts. In this work, we use a\nFlexibility Function to represent the relationship between the price signal and\nthe demand and investigate optimization problems for the price signal\ncomputation. Consequently, this study considers the higher and lower levels in\nthe hierarchy from the markets to appliances, households, and districts. This\npaper investigates optimal price generation via the Flexibility Function and\nstudies its employment in controller design for demand-side management, its\ncapability to provide ancillary services for balancing throughout the Smart\nEnergy Operating System, and its effect on the physical level performance.\nSequential and simultaneous approaches for computing the price signal, along\nwith various cost functions are analyzed and compared. Simulation results\ndemonstrate the generated price/penalty signal and its employment in a model\npredictive controller.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"ohq9OGdZR_NLWKjBCFEHa-k5kllKCsOeKq3e9k-hePE","pdfSize":"1405349","objectId":"0xdec484927ba538192d28d8a5472e904047414712209bd48562088095f04a6d97","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
