{"id":"2409.11790","title":"Empowering Visual Artists with Tokenized Digital Assets with NFTs","authors":"Ruiqiang Li, Brian Yecies, Qin Wang, Shiping Chen, Jun Shen","authorsParsed":[["Li","Ruiqiang",""],["Yecies","Brian",""],["Wang","Qin",""],["Chen","Shiping",""],["Shen","Jun",""]],"versions":[{"version":"v1","created":"Wed, 18 Sep 2024 08:16:16 GMT"},{"version":"v2","created":"Fri, 20 Sep 2024 06:01:39 GMT"}],"updateDate":"2024-09-23","timestamp":1726647376000,"abstract":"  The Non-Fungible Tokens (NFTs) has the transformative impact on the visual\narts industry by examining the nexus between empowering art practices and\nleveraging blockchain technology. First, we establish the context for this\nstudy by introducing some basic but critical technological aspects and\naffordances of the blockchain domain. Second, we revisit the creative practices\ninvolved in producing traditional artwork, covering various types, production\nprocesses, trading, and monetization methods. Third, we introduce and define\nthe key fundamentals of the blockchain ecosystem, including its structure,\nconsensus algorithms, smart contracts, and digital wallets. Fourth, we narrow\nthe focus to NFTs, detailing their history, mechanics, lifecycle, and\nstandards, as well as their application in the art world. In particular, we\noutline the key processes for minting and trading NFTs in various marketplaces\nand discuss the relevant market dynamics and pricing. We also consider major\nsecurity concerns, such as wash trading, to underscore some of the central\ncybersecurity issues facing this domain. Finally, we conclude by considering\nfuture research directions, emphasizing improvements in user experience,\nsecurity, and privacy. Through this innovative research overview, which\nincludes input from creative industry and cybersecurity sdomain expertise, we\noffer some new insights into how NFTs can empower visual artists and reshape\nthe wider copyright industries.\n","subjects":["Computer Science/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"wxIyqC5DAWQZcucwVjyBS0RZ4NiPkTSTjRQ9N4hScJo","pdfSize":"2625795"}