{
  "id": "2412.09275",
  "title": "Size-Dependent Charging Energy Determines the Charge Transport in ZnO\n  Quantum Dot Solids",
  "authors": "Morteza Shokrani, Dorothea Scheunemann, Clemens G\\\"ohler, Martijn\n  Kemerink",
  "authorsParsed": [
    [
      "Shokrani",
      "Morteza",
      ""
    ],
    [
      "Scheunemann",
      "Dorothea",
      ""
    ],
    [
      "Göhler",
      "Clemens",
      ""
    ],
    [
      "Kemerink",
      "Martijn",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 13:36:41 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1734010601000,
  "abstract": "  Building up a solid-state material from quantum dots (QD), which are often\nreferred to as artificial atoms, offers the potential to create new materials\nwith unprecedented macroscopic properties. The investigation of the electronic\nproperties of such QD assemblies has attracted attention due to the increasing\napplications of QD solids in both electronics and optoelectronics. In the past,\ncharge transport in QD assemblies has been explained by a variety of mutually\nexclusive theories, with the Mott and Efros-Shklovskii variable range hopping\nmodels being most common. However, these theories fall short in explaining the\nanomalous exponents of the temperature-dependent conductivity observed in\nvarious QD materials. Here, we measure the temperature-dependent conductivity\nof semiconducting ZnO QDs under different UV illumination intensity. Regulating\nthe UV intensity allows us to systematically change the effective diameter of\nthe ZnO QDs without having to rely on cumbersome size control by synthesis.\nInstead, the UV level controls the width of the QD depletion shell and\ntherefore the size distribution in the overall material. We observe exponents\nthat systematically increase from {\\alpha}=0.25 to {\\alpha}=0.62 with\nincreasing illumination intensity, which we interpret in terms of a charge\ntransport being limited by the (size-dependent) charging energy of the QDs.\n",
  "subjects": [
    "Condensed Matter/Mesoscale and Nanoscale Physics",
    "Condensed Matter/Materials Science"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "J0_-PdLFEAL6IdIZPF0djG_l0Rwwxe0ntZAH1Nf8AaI",
  "pdfSize": "1564247"
}