{
  "id": "2412.14844",
  "title": "Astrometry-Only Detection of Microlensing Events with Gaia",
  "authors": "T. Jankovi\\v{c}, A. Gomboc, {\\L}. Wyrzykowski, U. Kosti\\'c, M.\n  Karlica, M. Larma, T. Petrushevska, M. Bronikowski, M. Jab{\\l}o\\'nska, Z.\n  Kaczmarek",
  "authorsParsed": [
    [
      "Jankovič",
      "T.",
      ""
    ],
    [
      "Gomboc",
      "A.",
      ""
    ],
    [
      "Wyrzykowski",
      "Ł.",
      ""
    ],
    [
      "Kostić",
      "U.",
      ""
    ],
    [
      "Karlica",
      "M.",
      ""
    ],
    [
      "Larma",
      "M.",
      ""
    ],
    [
      "Petrushevska",
      "T.",
      ""
    ],
    [
      "Bronikowski",
      "M.",
      ""
    ],
    [
      "Jabłońska",
      "M.",
      ""
    ],
    [
      "Kaczmarek",
      "Z.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 13:36:19 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734615379000,
  "abstract": "  Astrometric microlensing events occur when a massive object passes between a\ndistant source and the observer, causing a shift of the light centroid. The\nprecise astrometric measurements of the Gaia mission provide an unprecedented\nopportunity to detect and analyze these events, revealing properties of lensing\nobjects such as their mass and distance. We develop and test the Gaia\nAstrometric Microlensing Events (GAME) Filter, a software tool to identify\nastrometric microlensing events and derive lensing object properties. We\ngenerated mock Gaia observations for different magnitudes, number of Gaia\nvisits, and events extending beyond Gaia's observational run. We applied GAME\nFilter to these datasets and validated its performance. We also assessed the\nrate of false positives where binary astrometric systems are misidentified as\nmicrolensing events. GAME Filter successfully recovers microlensing parameters\nfor strong events. Parameters are more difficult to recover for short events\nand those extending beyond Gaia's run, where only a fraction of the events is\nobserved. The astrometric effect breaks the degeneracy in the microlensing\nparallax present in photometric microlensing. For fainter sources, the observed\nsignal weakens, reducing recovered events and increasing parameter errors.\nHowever, even for Gaia G-band magnitude 19, parameters can be recovered for\nEinstein radii above two mas. Observing regions with varying numbers of Gaia\nvisits has minimal impact on filter accuracy when the number of visits exceeds\n90. Additionally, even if the peak of a microlensing event lies outside Gaia's\nrun, microlensing parameters can still be recovered. We also tested the\nsensitivity to contamination and found that 5 percent of binary systems were\nmisclassified. GAME Filter characterizes lenses with astrometry-only data for\nlens masses from approximately 1 to 20 solar masses and distances up to 6 kpc.\n",
  "subjects": [
    "Astrophysics/Solar and Stellar Astrophysics",
    "Astrophysics/Instrumentation and Methods for Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "sN1_dj5LIs5Wd2T9Iy3WdZERmJW6AK9UNpl1364TGI4",
  "pdfSize": "4093097"
}