{
  "id": "2412.18541",
  "title": "PLD-Tree: Persistent Laplacian Decision Tree for Protein-Protein Binding\n  Free Energy Prediction",
  "authors": "Xingjian Xu, Jiahui Chen, Chunmei Wang",
  "authorsParsed": [
    [
      "Xu",
      "Xingjian",
      ""
    ],
    [
      "Chen",
      "Jiahui",
      ""
    ],
    [
      "Wang",
      "Chunmei",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 24 Dec 2024 16:44:00 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1735058640000,
  "abstract": "  Recent advances in topology-based modeling have accelerated progress in\nphysical modeling and molecular studies, including applications to\nprotein-ligand binding affinity. In this work, we introduce the Persistent\nLaplacian Decision Tree (PLD-Tree), a novel method designed to address the\nchallenging task of predicting protein-protein interaction (PPI) affinities.\nPLD-Tree focuses on protein chains at binding interfaces and employs the\npersistent Laplacian to capture topological invariants reflecting critical\ninter-protein interactions. These topological descriptors, derived from\npersistent homology, are further enhanced by incorporating evolutionary scale\nmodeling (ESM) from a large language model to integrate sequence-based\ninformation. We validate PLD-Tree on two benchmark datasets-PDBbind V2020 and\nSKEMPI v2 demonstrating a correlation coefficient ($R_p$) of 0.83 under the\nsophisticated leave-out-protein-out cross-validation. Notably, our approach\noutperforms all reported state-of-the-art methods on these datasets. These\nresults underscore the power of integrating machine learning techniques with\ntopology-based descriptors for molecular docking and virtual screening,\nproviding a robust and accurate framework for predicting protein-protein\nbinding affinities.\n",
  "subjects": [
    "Quantitative Biology/Biomolecules"
  ],
  "license": "http://creativecommons.org/publicdomain/zero/1.0/",
  "blobId": "jQWDx1rN5sUvPD--ReB8JrkT_rMVr6EBQ-kYb-GMwvM",
  "pdfSize": "1120909"
}