{
  "id": "2412.11109",
  "title": "SpearBot: Leveraging Large Language Models in a Generative-Critique\n  Framework for Spear-Phishing Email Generation",
  "authors": "Qinglin Qi, Yun Luo, Yijia Xu, Wenbo Guo, Yong Fang",
  "authorsParsed": [
    [
      "Qi",
      "Qinglin",
      ""
    ],
    [
      "Luo",
      "Yun",
      ""
    ],
    [
      "Xu",
      "Yijia",
      ""
    ],
    [
      "Guo",
      "Wenbo",
      ""
    ],
    [
      "Fang",
      "Yong",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 15 Dec 2024 08:13:12 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734250392000,
  "abstract": "  Large Language Models (LLMs) are increasingly capable, aiding in tasks such\nas content generation, yet they also pose risks, particularly in generating\nharmful spear-phishing emails. These emails, crafted to entice clicks on\nmalicious URLs, threaten personal information security. This paper proposes an\nadversarial framework, SpearBot, which utilizes LLMs to generate spear-phishing\nemails with various phishing strategies. Through specifically crafted jailbreak\nprompts, SpearBot circumvents security policies and introduces other LLM\ninstances as critics. When a phishing email is identified by the critic,\nSpearBot refines the generated email based on the critique feedback until it\ncan no longer be recognized as phishing, thereby enhancing its deceptive\nquality. To evaluate the effectiveness of SpearBot, we implement various\nmachine-based defenders and assess how well the phishing emails generated could\ndeceive them. Results show these emails often evade detection to a large\nextent, underscoring their deceptive quality. Additionally, human evaluations\nof the emails' readability and deception are conducted through questionnaires,\nconfirming their convincing nature and the significant potential harm of the\ngenerated phishing emails.\n",
  "subjects": [
    "Computer Science/Cryptography and Security"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "E6NGmNh6VBmH-IFS5uBrYxngDGrzdVisY4Zc0_2hg_Q",
  "pdfSize": "5291269"
}