{"id":"2412.06263","title":"iLLaVA: An Image is Worth Fewer Than 1/3 Input Tokens in Large\n  Multimodal Models","authors":"Lianyu Hu, Fanhua Shang, Liang Wan, Wei Feng","authorsParsed":[["Hu","Lianyu",""],["Shang","Fanhua",""],["Wan","Liang",""],["Feng","Wei",""]],"versions":[{"version":"v1","created":"Mon, 9 Dec 2024 07:22:19 GMT"}],"updateDate":"2024-12-10","timestamp":1733728939000,"abstract":"  In this paper, we introduce iLLaVA, a simple method that can be seamlessly\ndeployed upon current Large Vision-Language Models (LVLMs) to greatly increase\nthe throughput with nearly lossless model performance, without a further\nrequirement to train. iLLaVA achieves this by finding and gradually merging the\nredundant tokens with an accurate and fast algorithm, which can merge hundreds\nof tokens within only one step. While some previous methods have explored\ndirectly pruning or merging tokens in the inference stage to accelerate models,\nour method excels in both performance and throughput by two key designs. First,\nwhile most previous methods only try to save the computations of Large Language\nModels (LLMs), our method accelerates the forward pass of both image encoders\nand LLMs in LVLMs, which both occupy a significant part of time during\ninference. Second, our method recycles the beneficial information from the\npruned tokens into existing tokens, which avoids directly dropping context\ntokens like previous methods to cause performance loss. iLLaVA can nearly\n2$\\times$ the throughput, and reduce the memory costs by half with only a 0.2\\%\n- 0.5\\% performance drop across models of different scales including 7B, 13B\nand 34B. On tasks across different domains including single-image, multi-images\nand videos, iLLaVA demonstrates strong generalizability with consistently\npromising efficiency. We finally offer abundant visualizations to show the\nmerging processes of iLLaVA in each step, which show insights into the\ndistribution of computing resources in LVLMs. Code is available at\nhttps://github.com/hulianyuyy/iLLaVA.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"9zYg0IrBPZrYUxymTrlX7LJjNfPcB59yfRmauv_Fsik","pdfSize":"1153360"}