{
  "id": "2412.11884",
  "title": "A Route Toward the On-Surface Synthesis of Organic Ferromagnetic Quantum\n  Spin Chains",
  "authors": "Fabian Paschke, Ricardo Ortiz, Shantanu Mishra, Manuel Vilas-Varela,\n  Florian Albrecht, Diego Pe\\~na, Manuel Melle-Franco, Leo Gross",
  "authorsParsed": [
    [
      "Paschke",
      "Fabian",
      ""
    ],
    [
      "Ortiz",
      "Ricardo",
      ""
    ],
    [
      "Mishra",
      "Shantanu",
      ""
    ],
    [
      "Vilas-Varela",
      "Manuel",
      ""
    ],
    [
      "Albrecht",
      "Florian",
      ""
    ],
    [
      "Peña",
      "Diego",
      ""
    ],
    [
      "Melle-Franco",
      "Manuel",
      ""
    ],
    [
      "Gross",
      "Leo",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 15:33:04 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734363184000,
  "abstract": "  Engineering sublattice imbalance is an intuitive way to induce high-spin\nground states in bipartite polycyclic conjugated hydrocarbons (PCHs). Such\nhigh-spin molecules can be employed as building blocks of quantum spin chains,\nwhich are outstanding platforms to study many-body physics and fundamental\nmodels in quantum magnetism. Recent reports on the bottom-up synthesis of\nantiferromagnetic molecular spin chains provided insights into paradigmatic\nquantum phenomena such as fractionalization. In contrast to antiferromagnetism,\ndemonstration of ferromagnetic coupling between PCHs has been scarce. Previous\nattempts in this direction were limited by the formation of non-benzenoid rings\nleading to spin quenching, or the use of spacer motifs that considerably weaken\nthe magnitude of ferromagnetic exchange. Here, we demonstrate the on-surface\nsynthesis of short ferromagnetic spin chains based on dibenzotriangulene (DBT),\na PCH with a triplet ground state. Our synthetic strategy centers on achieving\na direct (that is, without a spacer motif) majority-minority sublattice\ncoupling between adjacent units. This leads to a global sublattice imbalance in\nspin chains scaling with the chain length, and therefore a ferromagnetic ground\nstate with a strong intermolecular ferromagnetic exchange. By means of scanning\nprobe measurements and multiconfigurational quantum chemistry calculations, we\nanalyze the electronic and magnetic properties of ferromagnetic dimers and\ntrimers of DBT, and confirm their quintet and septet ground states,\nrespectively, with an intermolecular ferromagnetic exchange of 7 meV.\nFurthermore, we elucidate the role of sublattice coupling on magnetism through\ncomplementary experiments on antiferromagnetic DBT dimers with\nmajority-majority and minority-minority couplings. We expect our\nproof-of-principle study to provide impetus for the design of purely organic\nferromagnetic materials.\n",
  "subjects": [
    "Condensed Matter/Mesoscale and Nanoscale Physics",
    "Physics/Chemical Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Vc7wr_rJyrZRHdn1mR9HFaYNvcG5zGsxOo2rkcdGEP8",
  "pdfSize": "2453583"
}