{"id":"2412.19591","title":"Theoretical Investigation of (Zn, Co) co-Doped BaTiO3 for Advanced\n  Energy and Photonic Applications","authors":"Zheng Kang, Mei Wu, Yiyu Feng, Jiahao Li, Jieming Zhang, Haiyi Tian,\n  Ancheng Wang, Yunkai Wu, Xu Wang","authorsParsed":[["Kang","Zheng",""],["Wu","Mei",""],["Feng","Yiyu",""],["Li","Jiahao",""],["Zhang","Jieming",""],["Tian","Haiyi",""],["Wang","Ancheng",""],["Wu","Yunkai",""],["Wang","Xu",""]],"versions":[{"version":"v1","created":"Fri, 27 Dec 2024 11:26:38 GMT"}],"updateDate":"2024-12-30","timestamp":1735298798000,"abstract":"  In light of recent advancements in energy technology, there is an urgent need\nfor lead-free barium titanate (BTO) -based materials that exhibit remarkable\nferroelectric and photoelectric properties. Notwithstanding the considerable\nexperimental advances, a theoretical understanding from the electron and atomic\nperspectives remains elusive. This study employs the generalized gradient\napproximation plane wave pseudopotential technique to investigate the\nstructural, electronic, ferroelectric, and optical properties of (Zn,Co)\nco-doped BaTiO3 (BZCT) based on density functional theory. The objective is to\nascertain the extent of performance enhancement and the underlying mechanism of\n(Zn,Co) co-doping on barium titanate. Our findings reveal that incorporating\n(Zn,Co) into the BaTiO3 lattice significantly augments the tetragonality of the\nunit cell. Moreover, the ferroelectric properties are enhanced, with a\nspontaneous polarization stronger than that observed in pure BTO, exhibiting\nexcellent ferroelectricity. The results of the Hubbard+U algorithm indicate\nthat the band gap of BZCT is reduced. Concurrently, the enhanced ferroelectric\npolarization increases the built-in electric field of the material,\nfacilitating the separation of photogenerated carriers and improving optical\nabsorption. Consequently, the optical absorption ability and photorefractive\nability are effectively enhanced. BZCT, with its high spontaneous polarization\nand outstanding optical properties, can be a promising candidate material in\nenergy storage and photovoltaics.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"PcWvYX1wcupfGutmYiYofhd4GS5TuX9U_1XveSqsYQM","pdfSize":"2156202"}