{
  "id": "2412.13957",
  "title": "Self-attentive Transformer for Fast and Accurate Postprocessing of\n  Temperature and Wind Speed Forecasts",
  "authors": "Aaron Van Poecke, Tobias Sebastian Finn, Ruoke Meng, Joris Van den\n  Bergh, Geert Smet, Jonathan Demaeyer, Piet Termonia, Hossein Tabari, Peter\n  Hellinckx",
  "authorsParsed": [
    [
      "Van Poecke",
      "Aaron",
      ""
    ],
    [
      "Finn",
      "Tobias Sebastian",
      ""
    ],
    [
      "Meng",
      "Ruoke",
      ""
    ],
    [
      "Bergh",
      "Joris Van den",
      ""
    ],
    [
      "Smet",
      "Geert",
      ""
    ],
    [
      "Demaeyer",
      "Jonathan",
      ""
    ],
    [
      "Termonia",
      "Piet",
      ""
    ],
    [
      "Tabari",
      "Hossein",
      ""
    ],
    [
      "Hellinckx",
      "Peter",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 15:37:09 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734536229000,
  "abstract": "  Current postprocessing techniques often require separate models for each lead\ntime and disregard possible inter-ensemble relationships by either correcting\neach member separately or by employing distributional approaches. In this work,\nwe tackle these shortcomings with an innovative, fast and accurate Transformer\nwhich postprocesses each ensemble member individually while allowing\ninformation exchange across variables, spatial dimensions and lead times by\nmeans of multi-headed self-attention. Weather foreacasts are postprocessed over\n20 lead times simultaneously while including up to twelve meteorological\npredictors. We use the EUPPBench dataset for training which contains ensemble\npredictions from the European Center for Medium-range Weather Forecasts'\nintegrated forecasting system alongside corresponding observations. The work\npresented here is the first to postprocess the ten and one hundred-meter wind\nspeed forecasts within this benchmark dataset, while also correcting the\ntwo-meter temperature. Our approach significantly improves the original\nforecasts, as measured by the CRPS, with 17.5 % for two-meter temperature,\nnearly 5% for ten-meter wind speed and 5.3 % for one hundred-meter wind speed,\noutperforming a classical member-by-member approach employed as competitive\nbenchmark. Furthermore, being up to 75 times faster, it fulfills the demand for\nrapid operational weather forecasts in various downstream applications,\nincluding renewable energy forecasting.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Physics/Atmospheric and Oceanic Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "EyUN0Sl3oiXPXGFAluzSOyGc1o3v71v9IUMywa1Gz_M",
  "pdfSize": "6414274"
}