{"id":"2412.12817","title":"Relativistic Low Angular Momentum Advective Flows onto Black Hole and\n  associated observational signatures","authors":"Jun-Xiang Huang, Chandra B. Singh","authorsParsed":[["Huang","Jun-Xiang",""],["Singh","Chandra B.",""]],"versions":[{"version":"v1","created":"Tue, 17 Dec 2024 11:32:45 GMT"}],"updateDate":"2024-12-18","timestamp":1734435165000,"abstract":"  We present simulation results examining the presence and behavior of standing\nshocks in zero-energy low angular momentum advective accretion flows and\nexplore their (in)stabilities properties taking into account various specific\nangular momentum, $\\lambda_0$. Within the range $10-50R_g$ (where $R_g$ denotes\nthe Schwarzschild radius), shocks are discernible for $\\lambda_0\\geq 1.75$. In\nthe special relativistic hydrodynamic (RHD) simulation when $\\lambda_0 = 1.80$,\nwe find the merger of two shocks resulted in a dramatic increase in luminosity.\nWe present the impact of external and internal flow collisions from the funnel\nregion on luminosity. Notably, oscillatory behavior characterizes shocks within\n$1.70 \\leq \\lambda_0 \\leq 1.80$. Using free-free emission as a proxy for\nanalysis, we shows that the luminosity oscillations between frequencies of\n$0.1-10$ Hz for $\\lambda_0$ range $1.7 \\leq \\lambda_0 \\leq 1.80$. These\nfindings offer insights into quasi-periodic oscillations emissions from certain\nblack hole X-ray binaries, exemplified by GX 339-4. Furthermore, for the\nsupermassive black hole at the Milky Way's center, Sgr A*, oscillation\nfrequencies between $10^{-6}$ and $10^{-5}$ Hz were observed. This frequency\nrange, translating to one cycle every few days, aligns with observational data\nfrom the X-ray telescopes such as Chandra, Swift, and XMM-Newton.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ug3SUgKgAlqMetqkK8cwD3hTj7bXewV_G_BNDy8JMEc","pdfSize":"6179489"}