{
  "id": "2412.03508",
  "title": "Design and Control of an Ultra-Slender Push-Pull Multisection Continuum\n  Manipulator for In-Situ Inspection of Aeroengine",
  "authors": "Weiheng Zhong, Yuancan Huang, Da Hong, Nianfeng Shao",
  "authorsParsed": [
    [
      "Zhong",
      "Weiheng",
      ""
    ],
    [
      "Huang",
      "Yuancan",
      ""
    ],
    [
      "Hong",
      "Da",
      ""
    ],
    [
      "Shao",
      "Nianfeng",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 17:50:51 GMT"
    }
  ],
  "updateDate": "2024-12-05",
  "timestamp": 1733334651000,
  "abstract": "  Since the shape of industrial endoscopes is passively altered according to\nthe contact around it, manual inspection approaches of aeroengines through the\ninspection ports have unreachable areas, and it's difficult to traverse\nmultistage blades and inspect them simultaneously, which requires engine\ndisassembly or the cooperation of multiple operators, resulting in efficiency\ndecline and increased costs. To this end, this paper proposes a novel continuum\nmanipulator with push-pull multisection structure which provides a potential\nsolution for the disadvantages mentioned above due to its higher flexibility,\npassability, and controllability in confined spaces. The ultra-slender design\ncombined with a tendon-driven mechanism makes the manipulator acquire enough\nworkspace and more flexible postures while maintaining a light weight.\nConsidering the coupling between the tendons in multisection, a innovative\nkinematics decoupling control method is implemented, which can realize\nreal-time control in the case of limited computational resources. A prototype\nis built to validate the capabilities of mechatronic design and the performance\nof the control algorithm. The experimental results demonstrate the advantages\nof our continuum manipulator in the in-situ inspection of aeroengines'\nmultistage blades, which has the potential to be a replacement solution for\nindustrial endoscopes.\n",
  "subjects": [
    "Computer Science/Robotics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "7YR2e4Yj3GgnlofvddVgLPPzYgEGlTwfa-BZGg7jAGo",
  "pdfSize": "6489548"
}