{
  "id": "2412.02394",
  "title": "PETAT -- An ASIC for Simple and Efficient Readout of Large PET Scanners",
  "authors": "Peter Fischer and Michael Ritzert and Thomas Kerschenbauer",
  "authorsParsed": [
    [
      "Fischer",
      "Peter",
      ""
    ],
    [
      "Ritzert",
      "Michael",
      ""
    ],
    [
      "Kerschenbauer",
      "Thomas",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 11:47:21 GMT"
    }
  ],
  "updateDate": "2024-12-04",
  "timestamp": 1733226441000,
  "abstract": "  Modern PET scanners based on scintillating crystals use solid state photo\ndetectors for light readout. The small area of these devices is beneficial for\nspatial resolution, but also leads to a large number of electronic channels to\nbe read out, mostly by application specific integrated circuits (ASICs)\ncontaining amplification, noise reduction, hit finding, time stamping and\namplitude measurement. Although each ASIC provides up to $\\approx 64$ channels,\na large number of chips is required with the need for auxiliary electronic\ncomponents like voltage regulators or FPGAs for control and data readout. The\nFPGAs in turn often require multiple supply voltages and configuration\ninfrastructure, so that PCBs get complicated, cumbersome and power-hungry, in\naddition to the significant power requirement of the front-end ASICs. We\naddress this issue in the latest generation of our PETA readout ASIC for SiPMs\nby a simplified control scheme and, in particular, by a hierarchical serial\ndata readout which does not require any additional FPGA. In addition, it\nprovides a time-sorted stream of hit data, allowing early on-detector data\nreduction and hit pre-processing like the removal of hits with no coincident\npartner. The simplicity of this readout facilitates a supply scheme where\npower/ground of multiple ASICs are connected in series instead of the standard\nparallel connection. This 'serial-powering' approach can reduce supply current\n(while increasing overall supply voltage) so that voltage drop issues in the\nsupply are alleviated.\n",
  "subjects": [
    "Physics/Instrumentation and Detectors",
    "Physics/Medical Physics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "XDPfYD1ZmxkVcDLNpLvw0YpJddBZkRAkpjOybGNiSGw",
  "pdfSize": "3823641"
}