{
  "id": "2412.07723",
  "title": "Multilevel randomized quasi-Monte Carlo estimator for nested integration",
  "authors": "Arved Bartuska, Andr\\'e Gustavo Carlon, Luis Espath, Sebastian\n  Krumscheid, Ra\\'ul Tempone",
  "authorsParsed": [
    [
      "Bartuska",
      "Arved",
      ""
    ],
    [
      "Carlon",
      "André Gustavo",
      ""
    ],
    [
      "Espath",
      "Luis",
      ""
    ],
    [
      "Krumscheid",
      "Sebastian",
      ""
    ],
    [
      "Tempone",
      "Raúl",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 18:16:25 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 14 Jan 2025 21:26:47 GMT"
    }
  ],
  "updateDate": "2025-01-16",
  "timestamp": 1733854585000,
  "abstract": "  Nested integration problems arise in various scientific and engineering\napplications, including Bayesian experimental design, financial risk\nassessment, and uncertainty quantification. These nested integrals take the\nform $\\int f\\left(\\int g(\\bs{y},\\bs{x})\\di{}\\bs{x}\\right)\\di{}\\bs{y}$, for\nnonlinear $f$, making them computationally challenging, particularly in\nhigh-dimensional settings. Although widely used for single integrals,\ntraditional Monte Carlo (MC) methods can be inefficient when encountering\ncomplexities of nested integration. This work introduces a novel multilevel\nestimator, combining deterministic and randomized quasi-MC (rQMC) methods to\nhandle nested integration problems efficiently. In this context, the inner\nnumber of samples and the discretization accuracy of the inner integrand\nevaluation constitute the level. We provide a comprehensive theoretical\nanalysis of the estimator, deriving error bounds demonstrating significant\nreductions in bias and variance compared with standard methods. The proposed\nestimator is particularly effective in scenarios where the integrand is\nevaluated approximately, as it adapts to different levels of resolution without\ncompromising precision. We verify the performance of our method via numerical\nexperiments, focusing on estimating the expected information gain of\nexperiments. When applied to Gaussian noise in the experiment, a truncation\nscheme ensures finite error bounds at the same computational complexity as in\nthe bounded noise case up to multiplicative logarithmic terms. The results\nreveal that the proposed multilevel rQMC estimator outperforms existing MC and\nrQMC approaches, offering a substantial reduction in computational costs and\noffering a powerful tool for practitioners dealing with complex, nested\nintegration problems across various domains.\n",
  "subjects": [
    "Mathematics/Numerical Analysis",
    "Computer Science/Numerical Analysis"
  ],
  "license": "http://creativecommons.org/publicdomain/zero/1.0/",
  "blobId": "8KbOi2qW7P1mJsMdDajei7dvza10nN1TWyS1htyutlU",
  "pdfSize": "1554823"
}