{"id":"2412.18795","title":"Unveiling the local elemental arrangements across the interfaces inside\n  CdSe/Cd1-xZnxS core-shell and CdSe/CdS/ Cd1-xZnxS core-crown-shell quantum\n  wells","authors":"Tatiana Lastovina, Oleg Usoltsev, Furkan Isik, Andriy Budnyk, Messaoud\n  Harfouche, Betul Canimkurbey, and Hilmi Volkan Demir","authorsParsed":[["Lastovina","Tatiana",""],["Usoltsev","Oleg",""],["Isik","Furkan",""],["Budnyk","Andriy",""],["Harfouche","Messaoud",""],["Canimkurbey","Betul",""],["Demir","Hilmi Volkan",""]],"versions":[{"version":"v1","created":"Wed, 25 Dec 2024 06:28:08 GMT"}],"updateDate":"2024-12-30","timestamp":1735108088000,"abstract":"  We report on a systematic study of the Cd, Zn, Se, and S elemental\ndistributions across the interfaces in CdSe/Cd1-xZnxS core-shell and\nCdSe/CdS/Cd1-xZnxS core-crown-shell quantum wells with the CdSe core thickness\nranging from 3.5 to 5.5 ML. By processing the XAS data, we observe that the\nCd-Se bonds dominate at the CdSe/Cd1-xZnxS core-shell interface of structures\nwith the 3.5 ML cores, while the Cd-Se bonds were more abundant in the cases of\nthe 4.5 and 5.5 ML cores. The complementary information about prevailing bonds\nwere extracted for other constituting elements, thus, describing the\ndistribution of the elements at the core-shell interface of CdSe-based NPLs.\nThe naked CdSe cores are covered with an organic shell via bridging oxygen\natoms. Also, we address the issue of stability of such core-shell systems over\nthe time. We demonstrate that after a half year of aging of the\ncommercial-ready 4.5 ML CdSe/CdxZn1-xS NPLs, the Cd-Se bonds become more\nevident due to the partial degradation of the Cd-S bonds. This is the first\nexperimental assessment of prevailing interatomic bonds at the core-shell\ninterface in the CdSe-based NPLs of incremental structural heterogeneity,\nproviding factual evidences about the elemental arrangement inside the\ncore-crown-shell NPLs and the growth path of crowns and shells.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"CUUeVXcdXOxiTbW5yH02JAdstD0XkIo7ZDKtRkvU4iw","pdfSize":"4488918"}