{"id":"2412.15589","title":"Pre-training Graph Neural Networks on Molecules by Using\n  Subgraph-Conditioned Graph Information Bottleneck","authors":"Van Thuy Hoang and O-Joun Lee","authorsParsed":[["Hoang","Van Thuy",""],["Lee","O-Joun",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 05:52:30 GMT"}],"updateDate":"2024-12-23","timestamp":1734673950000,"abstract":"  This study aims to build a pre-trained Graph Neural Network (GNN) model on\nmolecules without human annotations or prior knowledge. Although various\nattempts have been proposed to overcome limitations in acquiring labeled\nmolecules, the previous pre-training methods still rely on semantic subgraphs,\ni.e., functional groups. Only focusing on the functional groups could overlook\nthe graph-level distinctions. The key challenge to build a pre-trained GNN on\nmolecules is how to (1) generate well-distinguished graph-level representations\nand (2) automatically discover the functional groups without prior knowledge.\nTo solve it, we propose a novel Subgraph-conditioned Graph Information\nBottleneck, named S-CGIB, for pre-training GNNs to recognize core subgraphs\n(graph cores) and significant subgraphs. The main idea is that the graph cores\ncontain compressed and sufficient information that could generate\nwell-distinguished graph-level representations and reconstruct the input graph\nconditioned on significant subgraphs across molecules under the S-CGIB\nprinciple. To discover significant subgraphs without prior knowledge about\nfunctional groups, we propose generating a set of functional group candidates,\ni.e., ego networks, and using an attention-based interaction between the graph\ncore and the candidates. Despite being identified from self-supervised\nlearning, our learned subgraphs match the real-world functional groups.\nExtensive experiments on molecule datasets across various domains demonstrate\nthe superiority of S-CGIB.\n","subjects":["Computer Science/Machine Learning","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"iXNoV1OgmXmQRMETAEX0_V6Exyo0IndVEmK6XZCkZOM","pdfSize":"3748614"}