{"id":"2412.18878","title":"Dynamic tuning of ENZ wavelength in conductive polymer films via polaron\n  excitation","authors":"Hongqi Liu, Junjun Jia, Menghui Jia, Chengcan Han, Sanjun Zhang, Hui\n  Ye, Heping Zeng","authorsParsed":[["Liu","Hongqi",""],["Jia","Junjun",""],["Jia","Menghui",""],["Han","Chengcan",""],["Zhang","Sanjun",""],["Ye","Hui",""],["Zeng","Heping",""]],"versions":[{"version":"v1","created":"Wed, 25 Dec 2024 11:34:58 GMT"}],"updateDate":"2024-12-30","timestamp":1735126498000,"abstract":"  Traditional metal and n-type doped semiconductor materials serve as emerging\nepsilon-near-zero (ENZ) materials, showcasing great potential for nonlinear\nphotonic applications. However, a significant limitation for such materials is\nthe lack of versatile ENZ wavelength tuning, and thus dynamic tuning of the ENZ\nwavelength remains a technical challenge, thereby restricting their potential\napplications, such as multi-band communications. Here, dynamic tuning of the\nENZ wavelength in p-type organic PEDOT: PSS films is achieved through a\nreversible change in hole concentrations originated from the polaron\nformation/decoupling following optical excitation, and a tunable ENZ wavelength\nshift up to 150 nm is observed. Experimental investigations about ultrafast\ndynamics of polaron excitation reveal an approximately 80 fs time constant for\npolaron buildup and an approximately 280 fs time constant for polaron\ndecoupling, indicating the potential of reversal ultrafast switching for the\nENZ wavelength within subpicosecond time scale. These findings suggest that\n$p$--type organic semiconductors can serve as a novel platform for dynamically\ntuning the ENZ wavelength through polaron excitation, opening new possibilities\nfor ENZ--based nonlinear optical applications in flexible optoelectronics.\n","subjects":["Physics/Optics","Condensed Matter/Materials Science","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"cbAT0uw-mDmKdQ689CDpHUa6GQXXjXvrpQGyjPRhazI","pdfSize":"1146174"}