{"id":"2412.00821","title":"Improving Physics Reasoning in Large Language Models Using Mixture of\n  Refinement Agents","authors":"Raj Jaiswal, Dhruv Jain, Harsh Parimal Popat, Avinash Anand, Abhishek\n  Dharmadhikari, Atharva Marathe, Rajiv Ratn Shah","authorsParsed":[["Jaiswal","Raj",""],["Jain","Dhruv",""],["Popat","Harsh Parimal",""],["Anand","Avinash",""],["Dharmadhikari","Abhishek",""],["Marathe","Atharva",""],["Shah","Rajiv Ratn",""]],"versions":[{"version":"v1","created":"Sun, 1 Dec 2024 14:15:55 GMT"}],"updateDate":"2024-12-03","timestamp":1733062555000,"abstract":"  Large Language Models (LLMs) demonstrate remarkable capabilities in various\nreasoning tasks. However, they encounter significant challenges when it comes\nto scientific reasoning, particularly in physics, which requires not only\nmathematical reasoning but also factual and conceptual understanding. When\naddressing complex physics problems, LLMs typically face three key issues:\nproblem miscomprehension, incorrect concept application, and computational\nerrors. While each of these problems can be addressed individually, there is a\nneed for a generalized approach that can tackle all three issues\nsimultaneously. To address this, we introduce Mixture of Refinement Agents\n(MoRA), a novel agentic refinement framework that iteratively refines the LLM\ngenerated base solution by correcting the aforementioned errors, resulting in a\nsignificant performance improvement for open-source LLMs. Our approach aims to\nbridge the gap between opensource LLMs and GPT-4o by utilizing the latter as\nerror identifier to guide these refinement agents. We evaluate our approach on\nthe SciEval and MMLU subsets along with our own physics dataset (PhysicsQA).\nMoRA significantly improves the performance of Llama-3-70B and Gemma-2-27B on\nthese datasets, achieving up to a 16% increase in final answer accuracy.\n","subjects":["Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"KxYJit3EWz_uBfKWXRAg1JEhT0HnfsWBvv7XLedI2oY","pdfSize":"408020"}