{"id":"2412.14762","title":"A General Control Method for Human-Robot Integration","authors":"Maddalena Feder, Giorgio Grioli, Manuel G. Catalano and Antonio Bicchi","authorsParsed":[["Feder","Maddalena",""],["Grioli","Giorgio",""],["Catalano","Manuel G.",""],["Bicchi","Antonio",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 11:43:13 GMT"},{"version":"v2","created":"Fri, 10 Jan 2025 15:54:54 GMT"}],"updateDate":"2025-01-13","timestamp":1734608593000,"abstract":"  This paper introduces a new generalized control method designed for\nmulti-degrees-of-freedom devices to help people with limited motion\ncapabilities in their daily activities. The challenge lies in finding the most\nadapted strategy for the control interface to effectively map user's motions in\na low-dimensional space to complex robotic assistive devices, such as\nprostheses, supernumerary limbs, up to remote robotic avatars. The goal is a\nsystem which integrates the human and the robotic parts into a unique system,\nmoving so as to reach the targets decided by the human while autonomously\nreducing the user's effort and discomfort. We present a framework to control\ngeneral multi DoFs assistive systems, which translates user-performed\ncompensatory motions into the necessary robot commands for reaching targets\nwhile canceling or reducing compensation. The framework extends to prostheses\nof any number of DoF up to full robotic avatars, regarded here as a sort of\nwhole-body prosthesis of the person who sees the robot as an artificial\nextension of their own body without a physical link but with a sensory-motor\nintegration. We have validated and applied this control strategy through tests\nencompassing simulated scenarios and real-world trials involving a virtual twin\nof the robotic parts (prosthesis and robot) and a physical humanoid avatar.\n","subjects":["Computer Science/Robotics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"TBgpiw-P-OvxBDfMkejcjmxQ5a_b3LkesT4DEhZTDQw","pdfSize":"14668722"}