{"id":"2412.02900","title":"MACAW: A Causal Generative Model for Medical Imaging","authors":"Vibujithan Vigneshwaran, Erik Ohara, Matthias Wilms, Nils Forkert","authorsParsed":[["Vigneshwaran","Vibujithan",""],["Ohara","Erik",""],["Wilms","Matthias",""],["Forkert","Nils",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 23:05:41 GMT"}],"updateDate":"2024-12-05","timestamp":1733267141000,"abstract":"  Although deep learning techniques show promising results for many\nneuroimaging tasks in research settings, they have not yet found widespread use\nin clinical scenarios. One of the reasons for this problem is that many machine\nlearning models only identify correlations between the input images and the\noutputs of interest, which can lead to many practical problems, such as\nencoding of uninformative biases and reduced explainability. Thus, recent\nresearch is exploring if integrating a priori causal knowledge into deep\nlearning models is a potential avenue to identify these problems. This work\nintroduces a new causal generative architecture named Masked Causal Flow\n(MACAW) for neuroimaging applications. Within this context, three main\ncontributions are described. First, a novel approach that integrates complex\ncausal structures into normalizing flows is proposed. Second, counterfactual\nprediction is performed to identify the changes in effect variables associated\nwith a cause variable. Finally, an explicit Bayesian inference for\nclassification is derived and implemented, providing an inherent uncertainty\nestimation. The feasibility of the proposed method was first evaluated using\nsynthetic data and then using MRI brain data from more than 23000 participants\nof the UK biobank study. The evaluation results show that the proposed method\ncan (1) accurately encode causal reasoning and generate counterfactuals\nhighlighting the structural changes in the brain known to be associated with\naging, (2) accurately predict a subject's age from a single 2D MRI slice, and\n(3) generate new samples assuming other values for subject-specific indicators\nsuch as age, sex, and body mass index. The code for a toy dataset is available\nat the following link: https://github.com/vibujithan/macaw-2D.git.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"LVVqwpVjKKJGdX_yeORbTMoreVQ0i-QON9c4i2QL4WE","pdfSize":"2215795"}