{
  "id": "2412.10264",
  "title": "On The Lunar Origin of Near-Earth Asteroid 2024 PT5",
  "authors": "Theodore Kareta, Oscar Fuentes-Mu\\~noz, Nicholas Moskovitz, Davide\n  Farnocchia, Benjamin N.L. Sharkey",
  "authorsParsed": [
    [
      "Kareta",
      "Theodore",
      ""
    ],
    [
      "Fuentes-Muñoz",
      "Oscar",
      ""
    ],
    [
      "Moskovitz",
      "Nicholas",
      ""
    ],
    [
      "Farnocchia",
      "Davide",
      ""
    ],
    [
      "Sharkey",
      "Benjamin N. L.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 16:32:33 GMT"
    }
  ],
  "updateDate": "2024-12-16",
  "timestamp": 1734107553000,
  "abstract": "  The Near-Earth Asteroid (NEA) 2024 PT5 is on an Earth-like orbit which\nremained in Earth's immediate vicinity for several months at the end of 2024.\nPT5's orbit is challenging to populate with asteroids originating from the Main\nBelt and is more commonly associated with rocket bodies mistakenly identified\nas natural objects or with debris ejected from impacts on the Moon. We obtained\nvisible and near-infrared reflectance spectra of PT5 with the Lowell Discovery\nTelescope and NASA Infrared Telescope Facility on 2024 August 16. The combined\nreflectance spectrum matches lunar samples but does not match any known\nasteroid types -- it is pyroxene-rich while asteroids of comparable spectral\nredness are olivine-rich. Moreover, the amount of solar radiation pressure\nobserved on the PT5 trajectory is orders of magnitude lower than what would be\nexpected for an artificial object. We therefore conclude that 2024 PT5 is\nejecta from an impact on the Moon, thus making PT5 the second NEA suggested to\nbe sourced from the surface of the Moon. While one object might be an outlier,\ntwo suggest that there is an underlying population to be characterized.\nLong-term predictions of the position of 2024 PT5 are challenging due to the\nslow Earth encounters characteristic of objects in these orbits. A population\nof near-Earth objects which are sourced by the Moon would be important to\ncharacterize for understanding how impacts work on our nearest neighbor and for\nidentifying the source regions of asteroids and meteorites from this\nunder-studied population of objects on very Earth-like orbits.\n",
  "subjects": [
    "Astrophysics/Earth and Planetary Astrophysics"
  ],
  "license": "http://creativecommons.org/publicdomain/zero/1.0/",
  "blobId": "OMfd7kwfy0L4QUE2nWfRSZt_8rOoduw9oJ3TQZZC8g0",
  "pdfSize": "5001281"
}