{
  "id": "2412.02158",
  "title": "Agri-LLaVA: Knowledge-Infused Large Multimodal Assistant on Agricultural\n  Pests and Diseases",
  "authors": "Liqiong Wang, Teng Jin, Jinyu Yang, Ales Leonardis, Fangyi Wang, Feng\n  Zheng",
  "authorsParsed": [
    [
      "Wang",
      "Liqiong",
      ""
    ],
    [
      "Jin",
      "Teng",
      ""
    ],
    [
      "Yang",
      "Jinyu",
      ""
    ],
    [
      "Leonardis",
      "Ales",
      ""
    ],
    [
      "Wang",
      "Fangyi",
      ""
    ],
    [
      "Zheng",
      "Feng",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 04:34:23 GMT"
    },
    {
      "version": "v2",
      "created": "Wed, 4 Dec 2024 08:34:49 GMT"
    }
  ],
  "updateDate": "2024-12-05",
  "timestamp": 1733200463000,
  "abstract": "  In the general domain, large multimodal models (LMMs) have achieved\nsignificant advancements, yet challenges persist in applying them to specific\nfields, especially agriculture. As the backbone of the global economy,\nagriculture confronts numerous challenges, with pests and diseases being\nparticularly concerning due to their complexity, variability, rapid spread, and\nhigh resistance. This paper specifically addresses these issues. We construct\nthe first multimodal instruction-following dataset in the agricultural domain,\ncovering over 221 types of pests and diseases with approximately 400,000 data\nentries. This dataset aims to explore and address the unique challenges in pest\nand disease control. Based on this dataset, we propose a knowledge-infused\ntraining method to develop Agri-LLaVA, an agricultural multimodal conversation\nsystem. To accelerate progress in this field and inspire more researchers to\nengage, we design a diverse and challenging evaluation benchmark for\nagricultural pests and diseases. Experimental results demonstrate that\nAgri-LLaVA excels in agricultural multimodal conversation and visual\nunderstanding, providing new insights and approaches to address agricultural\npests and diseases. By open-sourcing our dataset and model, we aim to promote\nresearch and development in LMMs within the agricultural domain and make\nsignificant contributions to tackle the challenges of agricultural pests and\ndiseases. All resources can be found at https://github.com/Kki2Eve/Agri-LLaVA.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "bON10DN9dbnwHIShX56VLWCElbKl3z4yqPwE2Uwft_A",
  "pdfSize": "4677642"
}