{"id":"2412.04515","title":"Intertwining vectors, and Boltzmann weight matrices, of a Solid-on-Solid\n  model from the 20-vertex model","authors":"Pete Rigas","authorsParsed":[["Rigas","Pete",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 03:51:49 GMT"}],"updateDate":"2024-12-09","timestamp":1733370709000,"abstract":"  We initiate a new study on the correspondence between the 20-vertex model and\na SOS (Solid-on-Solid) model. In comparison to two previous works of the author\nin 2024 which characterized properties of the transfer, and quantum monodromy,\nmatrices of the 20-vertex model from the perspective of the quantum inverse\nscattering method, in addition to the structure of nonlocal correlations, the\nforthcoming approach is an adaptation of a study on the rational 7-vertex\nmodel. For the rational 7-vertex model, Antoenneko and Valinevich demonstrated\nthat the intertwining vectors can be used to transform the R-matrix of a vertex\nmodel into the Boltzman weight matrix of an SOS model. To further develop\nperspectives on classes of higher dimensional SOS models, by leveraging\nprevious computations with L-operators due to the author, and by also\nmanipulating q-exponentials, and other related factors from a factorization of\nthe universal R-matrix due to Boos et al, analogs of intertwining vectors for\nthe 20- vertex model can be obtained. In comparison to the system of equations\nthat have been obtained for the rational 7-vertex model, the system that one\nobtains for the 20-vertex model consists of 9 equations for each entry of the\nR-matrix. Furthermore, from the fact that the 20-vertex model contains more\npossible configurations in the sample space than the rational 7-vertex model\ndoes, the Boltzman weight matrix of the corresponding SOS model asymptotically\ndepends upon several contributions, a few of which include tensor products of\nbasis elements, and spectral parameters over the triangular lattice.\n","subjects":["Physics/Mathematical Physics","Mathematics/Mathematical Physics","Mathematics/Probability"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Glm3ZudkWOnLsBa0Yvcsya9N4V4PhlrNEAx4AkBHQbQ","pdfSize":"171945"}