{"id":"2412.03007","title":"Deteriorated Interlayer Coupling in Twisted Bilayer Cobaltites","authors":"Dongke Rong, Xiuqi Chen, Shengru Chen, Jingfeng Zhang, Yue Xu, Yanxing\n  Shang, Haitao Hong, Ting Cui, Qianying Wang, Chen Ge, Can Wang, Qiang Zheng,\n  Qinghua Zhang, Lingfei Wang, Yu Deng, Kuijuan Jin, Gang-Qin Liu, and Er-Jia\n  Guo","authorsParsed":[["Rong","Dongke",""],["Chen","Xiuqi",""],["Chen","Shengru",""],["Zhang","Jingfeng",""],["Xu","Yue",""],["Shang","Yanxing",""],["Hong","Haitao",""],["Cui","Ting",""],["Wang","Qianying",""],["Ge","Chen",""],["Wang","Can",""],["Zheng","Qiang",""],["Zhang","Qinghua",""],["Wang","Lingfei",""],["Deng","Yu",""],["Jin","Kuijuan",""],["Liu","Gang-Qin",""],["Guo","Er-Jia",""]],"versions":[{"version":"v1","created":"Wed, 4 Dec 2024 03:55:28 GMT"}],"updateDate":"2024-12-05","timestamp":1733284528000,"abstract":"  A wealth of remarkable behaviors is observed at the interfaces between\nmagnetic oxides due to the coexistence of Coulomb repulsion and interatomic\nexchange interactions. While previous research has focused on bonded oxide\nheterointerfaces, studies on magnetism in van der Waals interfaces remain rare.\nIn this study, we stacked two freestanding cobaltites with precisely controlled\ntwist angles. Scanning transmission electron microscopy revealed clear and\nordered moir\\'e patterns, which exhibit an inverse relationship with the twist\nangle. We found that the Curie temperature in the twisted region is reduced by\napproximately 13 K compared to the single-layer region using nitrogen-vacancy\n(NV) magnetometry. This phenomenon may be related to the weakening of the\norbital hybridization between oxygen ions and transition metal ions in the\nunbonded interfaces. Our findings suggest a potential avenue for modulating\nmagnetic interactions in correlated systems through twist, providing\nopportunities for the discovery of unknown quantum states.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Re9JU1vFStGN1Y1Hj68azH659P0Z2yEBb_zFcJvmswo","pdfSize":"2892990"}