{"id":"2412.16188","title":"A Decade of Deep Learning: A Survey on The Magnificent Seven","authors":"Dilshod Azizov, Muhammad Arslan Manzoor, Velibor Bojkovic, Yingxu\n  Wang, Zixiao Wang, Zangir Iklassov, Kailong Zhao, Liang Li, Siwei Liu, Yu\n  Zhong, Wei Liu, Shangsong Liang","authorsParsed":[["Azizov","Dilshod",""],["Manzoor","Muhammad Arslan",""],["Bojkovic","Velibor",""],["Wang","Yingxu",""],["Wang","Zixiao",""],["Iklassov","Zangir",""],["Zhao","Kailong",""],["Li","Liang",""],["Liu","Siwei",""],["Zhong","Yu",""],["Liu","Wei",""],["Liang","Shangsong",""]],"versions":[{"version":"v1","created":"Fri, 13 Dec 2024 17:55:39 GMT"}],"updateDate":"2024-12-24","timestamp":1734112539000,"abstract":"  Deep learning has fundamentally reshaped the landscape of artificial\nintelligence over the past decade, enabling remarkable achievements across\ndiverse domains. At the heart of these developments lie multi-layered neural\nnetwork architectures that excel at automatic feature extraction, leading to\nsignificant improvements in machine learning tasks. To demystify these advances\nand offer accessible guidance, we present a comprehensive overview of the most\ninfluential deep learning algorithms selected through a broad-based survey of\nthe field. Our discussion centers on pivotal architectures, including Residual\nNetworks, Transformers, Generative Adversarial Networks, Variational\nAutoencoders, Graph Neural Networks, Contrastive Language-Image Pre-training,\nand Diffusion models. We detail their historical context, highlight their\nmathematical foundations and algorithmic principles, and examine subsequent\nvariants, extensions, and practical considerations such as training\nmethodologies, normalization techniques, and learning rate schedules. Beyond\nhistorical and technical insights, we also address their applications,\nchallenges, and potential research directions. This survey aims to serve as a\npractical manual for both newcomers seeking an entry point into cutting-edge\ndeep learning methods and experienced researchers transitioning into this\nrapidly evolving domain.\n","subjects":["Computer Science/Machine Learning","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"tyWcBC4MZGYYoJL5xqISwnLniv-7T_slSCzpsrXumdc","pdfSize":"3107162"}