{"id":"2412.17616","title":"Facial Expression Analysis and Its Potentials in IoT Systems: A\n  Contemporary Survey","authors":"Zixuan Shanggua and Yanjie Dong and Song Guo and Victor C. M. Leung\n  and M. Jamal Deen and Xiping Hu","authorsParsed":[["Shanggua","Zixuan",""],["Dong","Yanjie",""],["Guo","Song",""],["Leung","Victor C. M.",""],["Deen","M. Jamal",""],["Hu","Xiping",""]],"versions":[{"version":"v1","created":"Mon, 23 Dec 2024 14:41:01 GMT"}],"updateDate":"2024-12-24","timestamp":1734964861000,"abstract":"  Facial expressions convey human emotions and can be categorized into\nmacro-expressions (MaEs) and micro-expressions (MiEs) based on duration and\nintensity. While MaEs are voluntary and easily recognized, MiEs are\ninvoluntary, rapid, and can reveal concealed emotions. The integration of\nfacial expression analysis with Internet-of-Thing (IoT) systems has significant\npotential across diverse scenarios. IoT-enhanced MaE analysis enables real-time\nmonitoring of patient emotions, facilitating improved mental health care in\nsmart healthcare. Similarly, IoT-based MiE detection enhances surveillance\naccuracy and threat detection in smart security. This work aims at providing a\ncomprehensive overview of research progress in facial expression analysis and\nexplores its integration with IoT systems. We discuss the distinctions between\nour work and existing surveys, elaborate on advancements in MaE and MiE\ntechniques across various learning paradigms, and examine their potential\napplications in IoT. We highlight challenges and future directions for the\nconvergence of facial expression-based technologies and IoT systems, aiming to\nfoster innovation in this domain. By presenting recent developments and\npractical applications, this study offers a systematic understanding of how\nfacial expression analysis can enhance IoT systems in healthcare, security, and\nbeyond.\n","subjects":["Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"MX8UE728-shjEIkTyaRi4HNDnjpy-T_dG3nAcdkRI9Q","pdfSize":"2308448"}