{"id":"2412.13198","title":"Why does time feel the way it does? Towards a principled account of\n  temporal experience","authors":"Renzo Comolatti, Matteo Grasso, Giulio Tononi","authorsParsed":[["Comolatti","Renzo",""],["Grasso","Matteo",""],["Tononi","Giulio",""]],"versions":[{"version":"v1","created":"Sat, 30 Nov 2024 01:51:44 GMT"}],"updateDate":"2024-12-19","timestamp":1732931504000,"abstract":"  Time flows, or at least the time of our experience does. Can we provide an\nobjective account of why experience, confined to the short window of the\nconscious present, encompasses a succession of moments that slip away from now\nto then--an account of why time feels flowing? Integrated Information Theory\n(IIT) aims to account for both the presence and quality of consciousness in\nobjective, physical terms. Given a substrate's architecture and current state,\nthe formalism of IIT allows one to unfold the cause-effect power of the\nsubstrate, yielding a cause-effect structure. According to IIT, this accounts\nin full for the presence and quality of experience, without any additional\ningredients. In previous work, we showed how unfolding the cause-effect\nstructure of non-directed grids, like those found in many posterior cortical\nareas, can account for the way space feels--namely, extended. Here we show that\nunfolding the cause-effect structure of directed grids can account for how time\nfeels--namely, flowing. First, we argue that the conscious present is\nexperienced as flowing because it is composed of phenomenal distinctions\n(moments) that are directed, and these distinctions are related in a way that\nsatisfies directed inclusion, connection, and fusion. We then show that\ndirected grids, which we conjecture constitute the substrate of temporal\nexperience, yield a cause-effect structure that accounts for these and other\nproperties of temporal experience. In this account, the experienced present\ndoes not correspond to a process unrolling in \"clock time,\" but to a\ncause-effect structure specified by a system in its current state: time is a\nstructure, not a process. We conclude by outlining similarities and differences\nbetween the experience of time and space, and some implications for the\nneuroscience, psychophysics, and philosophy of time.\n","subjects":["Quantitative Biology/Neurons and Cognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8PJotlTdEneXw_2pc4Zo50__yZxLmyHmFXCqHUCGA_c","pdfSize":"5253760"}