{"id":"2412.05697","title":"An Inexact Boosted Difference of Convex Algorithm for Nondifferentiable\n  Functions","authors":"Orizon P. Ferreira, Boris S. Mordukhovich, Wilkreffy M. S. Santos and\n  Jo\\~ao Carlos O. Souza","authorsParsed":[["Ferreira","Orizon P.",""],["Mordukhovich","Boris S.",""],["Santos","Wilkreffy M. S.",""],["Souza","João Carlos O.",""]],"versions":[{"version":"v1","created":"Sat, 7 Dec 2024 16:56:09 GMT"}],"updateDate":"2024-12-10","timestamp":1733590569000,"abstract":"  In this paper, we introduce an inexact approach to the Boosted Difference of\nConvex Functions Algorithm (BDCA) for solving nonconvex and nondifferentiable\nproblems involving the difference of two convex functions (DC functions).\nSpecifically, when the first DC component is differentiable and the second may\nbe nondifferentiable, BDCA utilizes the solution from the subproblem of the DC\nAlgorithm (DCA) to define a descent direction for the objective function. A\nmonotone linesearch is then performed to find a new point that improves the\nobjective function relative to the subproblem solution. This approach enhances\nthe performance of DCA. However, if the first DC component is\nnondifferentiable, the BDCA direction may become an ascent direction, rendering\nthe monotone linesearch ineffective. To address this, we propose an Inexact\nnonmonotone Boosted Difference of Convex Algorithm (InmBDCA). This algorithm\nincorporates two main features of inexactness: First, the subproblem therein is\nsolved approximately allowing us for a controlled relative error tolerance in\ndefining the linesearch direction. Second, an inexact nonmonotone linesearch\nscheme is used to determine the step size for the next iteration. Under\nsuitable assumptions, we demonstrate that InmBDCA is well-defined, with any\naccumulation point of the sequence generated by InmBDCA being a critical point\nof the problem. We also provide iteration-complexity bounds for the algorithm.\nNumerical experiments show that InmBDCA outperforms both the nonsmooth BDCA\n(nmBDCA) and the monotone version of DCA in practical scenarios.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ZV-zOG7xu9i9TQRfXoSTzgptMtrCwxutonN4vcP6PxY","pdfSize":"597687"}