{
  "id": "2412.17462",
  "title": "Sampling-Based Constrained Motion Planning with Products of Experts",
  "authors": "Amirreza Razmjoo, Teng Xue, Suhan Shetty, Sylvain Calinon",
  "authorsParsed": [
    [
      "Razmjoo",
      "Amirreza",
      ""
    ],
    [
      "Xue",
      "Teng",
      ""
    ],
    [
      "Shetty",
      "Suhan",
      ""
    ],
    [
      "Calinon",
      "Sylvain",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 10:39:59 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734950399000,
  "abstract": "  We present a novel approach to enhance the performance of sampling-based\nModel Predictive Control (MPC) in constrained optimization by leveraging\nproducts of experts. Our methodology divides the main problem into two\ncomponents: one focused on optimality and the other on feasibility. By\ncombining the solutions from each component, represented as distributions, we\napply products of experts to implement a project-then-sample strategy. In this\nstrategy, the optimality distribution is projected into the feasible area,\nallowing for more efficient sampling. This approach contrasts with the\ntraditional sample-then-project method, leading to more diverse exploration and\nreducing the accumulation of samples on the boundaries. We demonstrate an\neffective implementation of this principle using a tensor train-based\ndistribution model, which is characterized by its non-parametric nature, ease\nof combination with other distributions at the task level, and straightforward\nsampling technique. We adapt existing tensor train models to suit this purpose\nand validate the efficacy of our approach through experiments in various tasks,\nincluding obstacle avoidance, non-prehensile manipulation, and tasks involving\nstaying on manifolds. Our experimental results demonstrate that the proposed\nmethod consistently outperforms known baselines, providing strong empirical\nsupport for its effectiveness.\n",
  "subjects": [
    "Computer Science/Robotics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "41npOSs-RRO4UWgqkRduQG_02oxzVxXiyzpf-a5vfwU",
  "pdfSize": "9199560"
}