{
  "id": "2412.06372",
  "title": "Numerical simulations of internal shocks in spherical geometry:\n  hydrodynamics and prompt emission",
  "authors": "A. Charlet, J. Granot, P. Beniamini",
  "authorsParsed": [
    [
      "Charlet",
      "A.",
      ""
    ],
    [
      "Granot",
      "J.",
      ""
    ],
    [
      "Beniamini",
      "P.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 10:50:35 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733741435000,
  "abstract": "  Among the models used to explain the prompt emission of gamma-ray bursts\n(GRBs), internal shocks is a leading one. Its most basic ingredient is a\ncollision between two cold shells of different Lorentz factors in an\nultra-relativistic outflow, which forms a pair of shock fronts that accelerate\nelectrons in their wake. The optically-thin synchrotron emission from the\nhigh-energy electrons at both shock fronts explains key features of the prompt\nGRB emission and their diversity without fine-tuning of the physical\nconditions. We investigate the internal shocks model as mechanism for prompt\nemission based on a full hydrodynamical analytic derivation in planar geometry\nby Rahaman et al. (2024a,b), extending this approach to spherical geometry\nusing hydrodynamic simulations. We used the moving mesh relativistic\nhydrodynamics code GAMMA to study the collision of two ultra-relativistic cold\nshells of equal kinetic energy (and power). Using the built-in shock detection,\nwe calculate the corresponding synchrotron emission by the relativistic\nelectrons accelerated into a power-law energy distribution behind the shock, in\nthe fast cooling regime. During the first dynamical time after the collision,\nthe spherical effects cause the shock strength to decrease with radius. The\nobserved peak frequency decreases faster than expected by other models in the\nrising part of the pulse, and the peak flux saturates even for moderately short\npulses. This is likely caused by the very sharp edges of the shells in our\nmodel, while smoother edges will probably mitigate this effect. Our model\ntraces the evolution of the peak frequency back to the source activity time\nscales.\n",
  "subjects": [
    "Astrophysics/High Energy Astrophysical Phenomena"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "h-oRi1yXkvdBVJGimdf5a8vfsb3YwcesxkMDowl8eY8",
  "pdfSize": "1767179"
}