{
  "id": "2412.13003",
  "title": "Boosting Test Performance with Importance Sampling--a Subpopulation\n  Perspective",
  "authors": "Hongyu Shen and Zhizhen Zhao",
  "authorsParsed": [
    [
      "Shen",
      "Hongyu",
      ""
    ],
    [
      "Zhao",
      "Zhizhen",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 15:25:24 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734449124000,
  "abstract": "  Despite empirical risk minimization (ERM) is widely applied in the machine\nlearning community, its performance is limited on data with spurious\ncorrelation or subpopulation that is introduced by hidden attributes. Existing\nliterature proposed techniques to maximize group-balanced or worst-group\naccuracy when such correlation presents, yet, at the cost of lower average\naccuracy. In addition, many existing works conduct surveys on different\nsubpopulation methods without revealing the inherent connection between these\nmethods, which could hinder the technology advancement in this area. In this\npaper, we identify important sampling as a simple yet powerful tool for solving\nthe subpopulation problem. On the theory side, we provide a new systematic\nformulation of the subpopulation problem and explicitly identify the\nassumptions that are not clearly stated in the existing works. This helps to\nuncover the cause of the dropped average accuracy. We provide the first\ntheoretical discussion on the connections of existing methods, revealing the\ncore components that make them different. On the application side, we\ndemonstrate a single estimator is enough to solve the subpopulation problem. In\nparticular, we introduce the estimator in both attribute-known and -unknown\nscenarios in the subpopulation setup, offering flexibility in practical use\ncases. And empirically, we achieve state-of-the-art performance on commonly\nused benchmark datasets.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Statistics/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "EeM_YfZzFAGUKpkQHxT-eo9rnTGG4oCLvZeKkMY7VYM",
  "pdfSize": "361779"
}