{
  "id": "2412.17951",
  "title": "Hyperbolic Chamfer Distance for Point Cloud Completion and Beyond",
  "authors": "Fangzhou Lin, Songlin Hou, Haotian Liu, Shang Gao, Kazunori D Yamada,\n  Haichong K. Zhang, Ziming Zhang",
  "authorsParsed": [
    [
      "Lin",
      "Fangzhou",
      ""
    ],
    [
      "Hou",
      "Songlin",
      ""
    ],
    [
      "Liu",
      "Haotian",
      ""
    ],
    [
      "Gao",
      "Shang",
      ""
    ],
    [
      "Yamada",
      "Kazunori D",
      ""
    ],
    [
      "Zhang",
      "Haichong K.",
      ""
    ],
    [
      "Zhang",
      "Ziming",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 20:04:07 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1734984247000,
  "abstract": "  Chamfer Distance (CD) is widely used as a metric to quantify difference\nbetween two point clouds. In point cloud completion, Chamfer Distance (CD) is\ntypically used as a loss function in deep learning frameworks. However, it is\ngenerally acknowledged within the field that Chamfer Distance (CD) is\nvulnerable to the presence of outliers, which can consequently lead to the\nconvergence on suboptimal models. In divergence from the existing literature,\nwhich largely concentrates on resolving such concerns in the realm of Euclidean\nspace, we put forth a notably uncomplicated yet potent metric specifically\ndesigned for point cloud completion tasks: {Hyperbolic Chamfer Distance\n(HyperCD)}. This metric conducts Chamfer Distance computations within the\nparameters of hyperbolic space. During the backpropagation process, HyperCD\nsystematically allocates greater weight to matched point pairs exhibiting\nreduced Euclidean distances. This mechanism facilitates the preservation of\naccurate point pair matches while permitting the incremental adjustment of\nsuboptimal matches, thereby contributing to enhanced point cloud completion\noutcomes. Moreover, measure the shape dissimilarity is not solely work for\npoint cloud completion task, we further explore its applications in other\ngenerative related tasks, including single image reconstruction from point\ncloud, and upsampling. We demonstrate state-of-the-art performance on the point\ncloud completion benchmark datasets, PCN, ShapeNet-55, and ShapeNet-34, and\nshow from visualization that HyperCD can significantly improve the surface\nsmoothness, we also provide the provide experimental results beyond completion\ntask.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/publicdomain/zero/1.0/",
  "blobId": "BmQYwqDdUISDunJopLnRFDuDse3N9xYBW1S9W_f5WtM",
  "pdfSize": "4388136"
}