{
  "id": "2412.19023",
  "title": "Nuclear matter properties from chiral-scale effective theory including a\n  dilatonic scalar meson",
  "authors": "Lu-Qi Zhang, Yao Ma, Yong-Liang Ma",
  "authorsParsed": [
    [
      "Zhang",
      "Lu-Qi",
      ""
    ],
    [
      "Ma",
      "Yao",
      ""
    ],
    [
      "Ma",
      "Yong-Liang",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 26 Dec 2024 02:13:05 GMT"
    }
  ],
  "updateDate": "2025-01-03",
  "timestamp": 1735179185000,
  "abstract": "  Chiral effective theory has become a powerful tool for studying the\nlow-energy properties of QCD. In this work, we apply an extended chiral\neffective theory -- chiral-scale effective theory -- including a dilatonic\nscalar meson to study nuclear matter and find that the properties around\nsaturation density can be well reproduced. Compared to the traditionally used\nWalecka-type models in nuclear matter studies, our approach improves the\nbehavior of symmetry energy and the incompressibility coefficient in describing\nempirical data without introducing additional freedoms. Moreover, the predicted\nneutron star structures fall within the constraints of GW170817, PSR\nJ0740+6620, and PSR J0030+0451, while the maximum neutron star mass can reach\nabout $~3M_{\\odot}$ with a pure hadronic phase. Additionally, we find that\nsymmetry patterns of the effective theory significantly impact neutron star\nstructures. %In chiral-scale effective theory, effective operators are well\norganized by chiral-scale orders and freedoms induced by QCD symmetry patterns.\nWe believe that introducing this type of theory into nuclear matter studies can\nlead to a deeper understanding of QCD, nuclear matter, and compact\nastrophysical objects.\n",
  "subjects": [
    "Physics/Nuclear Theory",
    "Astrophysics/High Energy Astrophysical Phenomena",
    "Physics/High Energy Physics - Phenomenology"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "q8HNai9AbkbeUMgNX-P3kdGB8ptCgg4dKqlTrs4y1pI",
  "pdfSize": "1135961"
}