{
  "id": "2412.17859",
  "title": "The Unreasonable Effectiveness of Open Science in AI: A Replication\n  Study",
  "authors": "Odd Erik Gundersen, Odd Cappelen, Martin M{\\o}ln{\\aa}, Nicklas\n  Grimstad Nilsen",
  "authorsParsed": [
    [
      "Gundersen",
      "Odd Erik",
      ""
    ],
    [
      "Cappelen",
      "Odd",
      ""
    ],
    [
      "Mølnå",
      "Martin",
      ""
    ],
    [
      "Nilsen",
      "Nicklas Grimstad",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 12:33:27 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1734698007000,
  "abstract": "  A reproducibility crisis has been reported in science, but the extent to\nwhich it affects AI research is not yet fully understood. Therefore, we\nperformed a systematic replication study including 30 highly cited AI studies\nrelying on original materials when available. In the end, eight articles were\nrejected because they required access to data or hardware that was practically\nimpossible to acquire as part of the project. Six articles were successfully\nreproduced, while five were partially reproduced. In total, 50% of the articles\nincluded was reproduced to some extent. The availability of code and data\ncorrelate strongly with reproducibility, as 86% of articles that shared code\nand data were fully or partly reproduced, while this was true for 33% of\narticles that shared only data. The quality of the data documentation\ncorrelates with successful replication. Poorly documented or miss-specified\ndata will probably result in unsuccessful replication. Surprisingly, the\nquality of the code documentation does not correlate with successful\nreplication. Whether the code is poorly documented, partially missing, or not\nversioned is not important for successful replication, as long as the code is\nshared. This study emphasizes the effectiveness of open science and the\nimportance of properly documenting data work.\n",
  "subjects": [
    "Computer Science/Artificial Intelligence",
    "Computer Science/Machine Learning",
    "Computer Science/Software Engineering"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "4JX45AbcT6v_hzoCQ4pQI71vXiDqaupAOXd3A4Q5A2I",
  "pdfSize": "579076"
}