{
  "id": "2412.17821",
  "title": "The Rosetta Paradox: Domain-Specific Performance Inversions in Large\n  Language Models",
  "authors": "Basab Jha, Ujjwal Puri",
  "authorsParsed": [
    [
      "Jha",
      "Basab",
      ""
    ],
    [
      "Puri",
      "Ujjwal",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 11:59:32 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1733745572000,
  "abstract": "  While large language models, such as GPT and BERT, have already demonstrated\nunprecedented skills in everything from natural language processing to\ndomain-specific applications, there came an unexplored phenomenon we term the\nRosetta Paradox. The Rosetta Paradox characterizes the counterintuitive\nperformance inversions across domains of knowledge. This paradox captures how\nsuch LLMs can excel in highly specialized fields but do poorly on tasks which\nrequire general, everyday knowledge. This paper formalizes the definition of\nthe Rosetta Paradox and introduces a panoramic analysis framework that includes\nboth a Domain Specificity Index (DSI) and a Performance Inversion Metric (PIM)\nfor consistent quantification of domain-specific behavior in LLMs.\n  We adopt this paradox and conduct a series of investigations through\nextensive experiments across diverse models and knowledge domains, ranging from\nrich technical areas to common-sense reasoning. Our findings indicate that the\nRosetta Paradox is likely not a mere artifact of data distribution but an\nintrinsic architectural and emergent property of deep neural networks. We\npresent comparative analyses across different model architectures, sizes, and\ntraining methodologies that shed light into the peculiar ways this paradox\nmanifests itself and challenge the standard evaluation metrics.\n",
  "subjects": [
    "Computer Science/Computation and Language",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "mEdLxXbjAMEMFNgBKJDkcJ8S0eafNt82hAtZolD_N0Y",
  "pdfSize": "1119053"
}