{
  "id": "2412.14766",
  "title": "New Radio Observations of the Supernova Remnant CTA 1",
  "authors": "Tam Do, Roland Kothes, Alex S. Hill, Andrew Gray, Patricia Reich,\n  Wolfgang Reich",
  "authorsParsed": [
    [
      "Do",
      "Tam",
      ""
    ],
    [
      "Kothes",
      "Roland",
      ""
    ],
    [
      "Hill",
      "Alex S.",
      ""
    ],
    [
      "Gray",
      "Andrew",
      ""
    ],
    [
      "Reich",
      "Patricia",
      ""
    ],
    [
      "Reich",
      "Wolfgang",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 11:50:18 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734609018000,
  "abstract": "  We present new radio images of the supernova remnant (SNR) CTA 1 at 1420 and\n408 MHz, and in the 21 cm line of H I observed with the Dominion Radio\nAstrophysical Observatory Synthesis Telescope and at 1420 MHz observed with the\nEffelsberg 100 m telescope. We confirm previously described continuum features\nand elaborate further on filamentary features identified using the\nhigh-resolution (1') maps from these new observations. We investigate the\nabrupt change in sign of rotation measure (RM) across the SNR, using the linear\npolarization observations in the four bands around 1420 MHz. Following X. H.\nSun et al.'s (2011) investigation, we both confirm that the distribution of\nsigns of the RMs for extragalactic sources in the area appears to match that of\nthe shell, as well as combine the data from the four bands to estimate the\nrelative depolarization and the intrinsic rotation measure of the SNR. We do\nnot conclusively reject X. H. Sun et al.'s (2011) claim of a Faraday screen in\nthe foreground causing the distribution of RMs that we observe; however, we do\nsuggest an alternative explanation of a swept-up stellar wind from the\nprogenitor star with a toroidal magnetic field. Finally, we expand on the\nanalysis of the H I observations by applying the Rolling Hough Transform to\nisolate filamentary structure and better identify H I emission with the SNR.\nFurther constraining the H I velocity channels associated with CTA 1, we use\nmore recent Galactic rotation curves to calculate an updated kinematic distance\nof 1.09 +/- 0.2 kpc.\n",
  "subjects": [
    "Astrophysics/High Energy Astrophysical Phenomena",
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "kRzr6hr0ugS_ZWKliDfebpnnjcm86VsCO14eMtYXTd8",
  "pdfSize": "2121096"
}