{"id":"2412.19268","title":"Jet formation studies in AGN: a search for new targets","authors":"B. Boccardi, L. Ricci, E. Madika, V. Bartolini, U. Bach, P. Grandi, E.\n  Torresi, T.P. Krichbaum, J.A. Zensus","authorsParsed":[["Boccardi","B.",""],["Ricci","L.",""],["Madika","E.",""],["Bartolini","V.",""],["Bach","U.",""],["Grandi","P.",""],["Torresi","E.",""],["Krichbaum","T. P.",""],["Zensus","J. A.",""]],"versions":[{"version":"v1","created":"Thu, 26 Dec 2024 16:20:53 GMT"}],"updateDate":"2024-12-30","timestamp":1735230053000,"abstract":"  In recent years, the jet formation region in active galaxies has been imaged\nthrough mm-VLBI in few ideal targets, first and foremost M87. An important leap\nforward for understanding jet launching could be made by identifying a larger\nnumber of suitable objects, characterized by different accretion modes and jet\npowers. In this article, we present 1 cm and 7 mm VLBI data of a sample of 16\npoorly explored radio galaxies, comprising both High-Excitation (HEG) and\nLow-Excitation Galaxies (LEG) and spanning a large range in radio power. The\ncombination of the sources vicinity (z<0.1) with a large black hole mass\n($\\log{M_{\\rm BH}}$>8.5) results in a high spatial resolution in units of\nSchwarzschild radii ($<10^3-10^4$ $R_{\\rm S}$), necessary for probing the\nregion where the jet is initially accelerated and collimated. We aim at\nidentifying the best candidates for follow-up observations with current and\nfuture VLBI facilities. The observations were performed with the High\nSensitivity Array, including Effelsberg and the phased-VLA, which has allowed\nus to characterize the sub-parsec properties of these faint jets and to\nestimate their core brightness temperature and orientation. The number of\nsources imaged on scales $\\lesssim 10^3$ $R_{\\rm S}$ is more than doubled by\nour study. All targets were detected at both frequencies, and several present\ntwo-sided jet structures. Several LEG jets show hints of limb-brightening. The\ncore brightness temperatures are generally below the equipartition value,\nindicating that equipartition has not yet been reached and/or that the emission\nis de-boosted. Among LEG, we identify 3C31, 3C66B, and 3C465 as the most\npromising, combining a relatively high flux density (>50 mJy) with superb\nspatial resolution (<500 $R_{\\rm S}$) at 7 mm. The powerful HEG 3C452 is\ninteresting as well due to its highly symmetric, two-sided jet base.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8G7n8293rOomb8CMMb5C0fFyKWkkeqjvPgWCsm4nvJY","pdfSize":"9131002"}