{
  "id": "2412.16617",
  "title": "Dark photons and tachyonic instability induced by Barbero-Immirzi\n  parameter and axion-torsion transmutation",
  "authors": "Zhi-Fu Gao, Biaopeng Li, L.C. Garcia de Andrade",
  "authorsParsed": [
    [
      "Gao",
      "Zhi-Fu",
      ""
    ],
    [
      "Li",
      "Biaopeng",
      ""
    ],
    [
      "de Andrade",
      "L. C. Garcia",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 21 Dec 2024 13:21:23 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734787283000,
  "abstract": "  In this paper, we investigate Holst gravity by examining two distinct\nexamples. The first example involves minimal coupling to torsion, while the\nsecond explores non-minimal coupling. The motivation for the first example\nstems from the recent work by Dombriz, which utilized a technique of imposing\nconstraint constant coefficients to massive torsion in the model Lagrangian to\ndetermine parameters for the Einstein-Cartan-Holst gravity. We extend this\nmethodology to investigate dark photons, where axial torsion transforms into\naxions.Interest in elucidating the abundance of dark photons within the\nframework of general relativity was sparked by Agrawal. Building on the work of\nBarman, who explored minimal coupling of massive torsion mediated by dark\nmatter (DM) with light torsion on the order of 1.7 TeV, we have derived a\nBarbero-Immirzi (BI) parameter of approximately 0.775. This value falls within\nthe range established by Panza et al. at TeV scales, specifically\n$0\\le{\\beta}\\le{1.185}$. This seems to our knowledge the first time BI\nparameter is induced by dark photons on a minimal EC gravity. Very recently,\nimplications of findings of BI parameter in cosmological bounces has appeared\nin the literature. For a smaller BI parameter a higher torsion mass of 1.51 TeV\nis obtained. Nevertheless. this figure is still a signature of light torsion\nwhich can be compatible with light dark photon masses. Magnetic helicity\ninstability of dark photons is investigated. Axion oscillation frequency is\nshown to depend on the BI parameter and the BI spectra is determined by an\nhistogram. This study not only broadens the understanding of Holst gravity but\nalso provides crucial insights into the interplay between torsion, dark\nphotons, and axions in the cosmological context.\n",
  "subjects": [
    "Physics/High Energy Physics - Phenomenology",
    "Physics/General Relativity and Quantum Cosmology"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "L92VAWHgTSkfstRNVfSfL547MHaEdjid1iB4HY2iSbU",
  "pdfSize": "311655"
}