{"id":"2412.08240","title":"Unified HT-CNNs Architecture: Transfer Learning for Segmenting Diverse\n  Brain Tumors in MRI from Gliomas to Pediatric Tumors","authors":"Ramy A. Zeineldin, Franziska Mathis-Ullrich","authorsParsed":[["Zeineldin","Ramy A.",""],["Mathis-Ullrich","Franziska",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 09:52:01 GMT"}],"updateDate":"2024-12-12","timestamp":1733910721000,"abstract":"  Accurate segmentation of brain tumors from 3D multimodal MRI is vital for\ndiagnosis and treatment planning across diverse brain tumors. This paper\naddresses the challenges posed by the BraTS 2023, presenting a unified transfer\nlearning approach that applies to a broader spectrum of brain tumors. We\nintroduce HT-CNNs, an ensemble of Hybrid Transformers and Convolutional Neural\nNetworks optimized through transfer learning for varied brain tumor\nsegmentation. This method captures spatial and contextual details from MRI\ndata, fine-tuned on diverse datasets representing common tumor types. Through\ntransfer learning, HT-CNNs utilize the learned representations from one task to\nimprove generalization in another, harnessing the power of pre-trained models\non large datasets and fine-tuning them on specific tumor types. We preprocess\ndiverse datasets from multiple international distributions, ensuring\nrepresentativeness for the most common brain tumors. Our rigorous evaluation\nemploys standardized quantitative metrics across all tumor types, ensuring\nrobustness and generalizability. The proposed ensemble model achieves superior\nsegmentation results across the BraTS validation datasets over the previous\nwinning methods. Comprehensive quantitative evaluations using the DSC and HD95\ndemonstrate the effectiveness of our approach. Qualitative segmentation\npredictions further validate the high-quality outputs produced by our model.\nOur findings underscore the potential of transfer learning and ensemble\napproaches in medical image segmentation, indicating a substantial enhancement\nin clinical decision-making and patient care. Despite facing challenges related\nto post-processing and domain gaps, our study sets a new precedent for future\nresearch for brain tumor segmentation. The docker image for the code and models\nhas been made publicly available, https://hub.docker.com/r/razeineldin/ht-cnns.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computer Science/Computer Vision and Pattern Recognition","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"kO2qBSLJUn0HgZnQwyhWT4UE5QtCy90weVakGpx3ipQ","pdfSize":"2223466"}