{"id":"2412.00693","title":"Interacting quark matter and $f(Q)$ gravity: A new paradigm in exploring\n  the properties of quark stars","authors":"Debadri Bhattacharjee, Koushik Ballav Goswami and Pradip Kumar\n  Chattopadhyay","authorsParsed":[["Bhattacharjee","Debadri",""],["Goswami","Koushik Ballav",""],["Chattopadhyay","Pradip Kumar",""]],"versions":[{"version":"v1","created":"Sun, 1 Dec 2024 06:21:57 GMT"},{"version":"v2","created":"Tue, 21 Jan 2025 11:05:47 GMT"}],"updateDate":"2025-01-22","timestamp":1733034117000,"abstract":"  Perturbative Quantum Chromodynamics corrections and the colour\nsuperconductivity indicate that strongly interacting matter can manifest unique\nphysical behaviours under extreme conditions. Motivated by this notion, we\ninvestigate the interior structure and properties of quark stars composed of\ninteracting quark matter, which provides a comprehensive avenue to explore the\nstrong interaction effects, within the framework of $f(Q)$ gravity. A unified\nequation of state is formulated to describe various phases of quark matter,\nincluding up-down quark matter $(2SC)$, strange quark matter $(2SC+s)$, and the\nColour-Flavor Locked $(CFL)$ phase. By employing a systematic reparametrisation\nand rescaling, the number of degrees of freedom in the equation of state is\nsignificantly reduced. Utilising the Buchdahl-I metric ansatz and a linear\n$f(Q)$ functional form, $f(Q)=\\alpha_{0}+\\alpha_{1}Q$, we derive the exact\nsolutions of the Einstein field equations in presence of the unified\ninteracting quark matter equation of state. For the $2SC$ phase, we examine the\nproperties of quark stars composed of up-down quark matter. For the\n$(2SC+s)$and $CFL$ phases, we incorporate the effects of a finite strange quark\nmass $(m_{s}\\neq0)$. The Tolman-Oppenheimer-Volkoff equations are numerically\nsolved to determine the maximum mass-radius relations for each phase. Our\nresults indicate that the model satisfies key physical criteria, including\ncausality, energy conditions, and stability requirements, ensuring the\nviability of the configurations. Furthermore, the predicted radii for certain\ncompact star candidates align well with observational data. The study\nhighlights that quark stars composed of interacting quark matter within the\n$f(Q)$ gravity framework provide a robust and physically consistent stellar\nmodel across all considered phases.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Physics/Nuclear Theory"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"RHkcPPych26u6zZPMtxtyhjx6mhYQz238jYOB37lEHA","pdfSize":"2990486"}