{"id":"2412.08259","title":"VSD2M: A Large-scale Vision-language Sticker Dataset for Multi-frame\n  Animated Sticker Generation","authors":"Zhiqiang Yuan, Jiapei Zhang, Ying Deng, Yeshuang Zhu, Jie Zhou,\n  Jinchao Zhang","authorsParsed":[["Yuan","Zhiqiang",""],["Zhang","Jiapei",""],["Deng","Ying",""],["Zhu","Yeshuang",""],["Zhou","Jie",""],["Zhang","Jinchao",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 10:11:41 GMT"}],"updateDate":"2024-12-12","timestamp":1733911901000,"abstract":"  As a common form of communication in social media,stickers win users' love in\nthe internet scenarios, for their ability to convey emotions in a vivid, cute,\nand interesting way. People prefer to get an appropriate sticker through\nretrieval rather than creation for the reason that creating a sticker is\ntime-consuming and relies on rule-based creative tools with limited\ncapabilities. Nowadays, advanced text-to-video algorithms have spawned numerous\ngeneral video generation systems that allow users to customize high-quality,\nphoto-realistic videos by only providing simple text prompts. However, creating\ncustomized animated stickers, which have lower frame rates and more abstract\nsemantics than videos, is greatly hindered by difficulties in data acquisition\nand incomplete benchmarks. To facilitate the exploration of researchers in\nanimated sticker generation (ASG) field, we firstly construct the currently\nlargest vision-language sticker dataset named VSD2M at a two-million scale that\ncontains static and animated stickers. Secondly, to improve the performance of\ntraditional video generation methods on ASG tasks with discrete\ncharacteristics, we propose a Spatial Temporal Interaction (STI) layer that\nutilizes semantic interaction and detail preservation to address the issue of\ninsufficient information utilization. Moreover, we train baselines with several\nvideo generation methods (e.g., transformer-based, diffusion-based methods) on\nVSD2M and conduct a detailed analysis to establish systemic supervision on ASG\ntask. To the best of our knowledge, this is the most comprehensive large-scale\nbenchmark for multi-frame animated sticker generation, and we hope this work\ncan provide valuable inspiration for other scholars in intelligent creation.\n","subjects":["Computer Science/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"99oRkdNiJuEmxqWDa48uBTHQX1TAKyuijEAMmdJubxQ","pdfSize":"4613195"}