{"id":"2412.05002","title":"Eta-Earth Revisited II: Deriving a Maximum Number of Earth-like Habitats\n  in the Galactic Disk","authors":"Manuel Scherf, Helmut Lammer, Laurenz Spro{\\ss}","authorsParsed":[["Scherf","Manuel",""],["Lammer","Helmut",""],["Sproß","Laurenz",""]],"versions":[{"version":"v1","created":"Fri, 6 Dec 2024 12:58:14 GMT"}],"updateDate":"2024-12-09","timestamp":1733489894000,"abstract":"  In Lammer et al. 2024, we defined Earth-like Habitats (EH) as rocky planets\nin the habitable zone of complex life (HZCL) on which Earth-like\nN$_2$-O$_2$-dominated atmospheres with minor amounts of CO$_2$ can exist and\nderived a formula for estimating their maximum number in the Galaxy. Here, we\napply this formula by considering only requirements that are already\nscientifically quantifiable. By implementing models for star formation rate,\ninitial mass function, and galactic mass distribution, we calculate the spatial\ndistribution of disk stars as functions of stellar mass and birth age. We apply\nmodels for the GHZ and evaluate the thermal stability of Earth-like atmospheres\nwith various CO$_2$ mixing ratios by implementing the newest stellar evolution\nand upper atmosphere models. In addition, we include the rocky exoplanet\nfrequency, the availability of oceans and subaerial land, and the potential\nlarge moon requirement by evaluating their importance and implementing these\ncriteria from minima to maxima values. We also discuss factors that are not yet\nscientifically quantifiable but may be requirements for EHs to evolve. We find\nthat EHs are rare by obtaining maximum numbers of\n$2.5^{+71.6}_{-2.4}\\times10^{5}$ and $0.6^{+27.1}_{-0.59}\\times10^{5}$ planets\nthat can potentially host N$_2$-Earth-like atmospheres with maximum CO$_2$\nmixing ratios of 10\\% and 1\\%, respectively, implying that a minimum of $\\sim\n10^3 - 10^6$ rocky HZCL planets are needed for 1 EH to evolve. Their actual\nnumber, however, may be substantially lower as several requirements are not\nincluded in our model; this also implies ETIs are significantly rarer still.\nOur results illustrate that neither every star can host EHs, nor that each\nrocky HZCL planet evolves such that it may be able to host complex animal-like\nlife. The Copernican Principle therefore cannot be applied to infer that such\nlife is common in the Galaxy.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Astrophysics of Galaxies","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"M8ZumcQg12KGauFR3VDNXq-LiPTTv7XuQQHUlJJ4pS8","pdfSize":"28737294"}