{
  "id": "2412.12884",
  "title": "A 3D-1D Virtual Element Method for Modeling Root Water Uptake",
  "authors": "Stefano Berrone and Stefano Ferraris and Denise Grappein and Gioana\n  Teora and Fabio Vicini",
  "authorsParsed": [
    [
      "Berrone",
      "Stefano",
      ""
    ],
    [
      "Ferraris",
      "Stefano",
      ""
    ],
    [
      "Grappein",
      "Denise",
      ""
    ],
    [
      "Teora",
      "Gioana",
      ""
    ],
    [
      "Vicini",
      "Fabio",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 13:07:55 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734440875000,
  "abstract": "  An optimization-based strategy is proposed for coupling three-dimensional and\none-dimensional problems (3D-1D coupling) in the context of soil-root\ninteraction simulations. This strategy, originally designed to tackle generic\n3D-1D coupled problems with discontinuous solutions, is here extended to the\ncase of non-linear problems and applied, for the first time, along with a\nvirtual element discretization of the 3D soil sample. This further enhances the\ncapability of the method to handle geometrical complexities, allowing to easily\nmesh domains characterized, for instance, by the presence of stones and other\nimpervious obstacles of arbitrary shape. A discrete-hybrid tip-tracking\nstrategy is adopted to model both the root growth and the evolution in time of\nthe water flux, the pressure head and the water content, both in the roots and\nin the surrounding soil sample. By choosing proper rules for the generation of\nbranches, realistic root-network configurations are obtained. Several numerical\nexamples are proposed, proving both the accuracy of the adopted method and its\napplicability in realistic and large scale simulations.\n",
  "subjects": [
    "Mathematics/Numerical Analysis",
    "Computer Science/Numerical Analysis"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "1VVNayxkq-pSeCZ6YdIoV2aHyoLA08lsZZcV1q_mWSo",
  "pdfSize": "6924426"
}