{"id":"2412.02602","title":"CEGI: Measuring the trade-off between efficiency and carbon emissions\n  for SLMs and VLMs","authors":"Abhas Kumar, Kapil Pathak, Rajesh Kavuru, and Prabhakar Srinivasan","authorsParsed":[["Kumar","Abhas",""],["Pathak","Kapil",""],["Kavuru","Rajesh",""],["Srinivasan","Prabhakar",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 17:32:47 GMT"}],"updateDate":"2024-12-04","timestamp":1733247167000,"abstract":"  This paper analyzes the performance of Small Language Models (SLMs) and\nVision Language Models (VLMs) and evaluates the trade-off between model\nperformance and carbon emissions across 4 essential tasks: Image Captioning,\nVisual Question Answering (VQA), Dialogue Summarization and Text-to-SQL\nconversion. Various SLMs and VLMs belonging to the Qwen and LLaMA architecture\nfamily are chosen and variants based on model size in terms of the number of\nparameters, quantization level and fine-tuning parameters are evaluated. The\nmodel variant's performance and carbon emissions are calculated. To quantify\nthe trade-off between model performance and carbon emissions, we introduce a\nnovel metric called CEGI (Carbon Efficient Gain Index). This metric represents\nthe carbon emission per unit percentage gain per million trainable parameters .\nThis metric provides a normalized measure to compare model's efficiency in\nterms of performance improvement relative to their environmental cost. The\nexperiment's outcome demonstrates that fine-tuning SLMs and VLMs can achieve\nperformance levels comparable to Large Language Models (LLMs) while producing\nsignificantly less carbon emissions. Our findings suggest that the marginal\ngains in accuracy from larger models do not justify the substantial increase in\ncarbon emissions. Leveraging lower-bit quantization levels, the proposed metric\nfurther enhances energy efficiency without compromising performance. This study\nhighlights balancing high performance and environmental sustainability. It\noffers a valuable metric for selecting models suitable for\nenvironmentally-friendly AI development.\n","subjects":["Computer Science/Computation and Language","Computer Science/Artificial Intelligence","Computer Science/Computers and Society","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"y63Cp47SZGFKjs_mWN6s_g2o3UKilzhz2OO7AqInbZ4","pdfSize":"1356715"}