{"id":"2412.09739","title":"Agtech Framework for Cranberry-Ripening Analysis Using Vision Foundation\n  Models","authors":"Faith Johnson, Ryan Meegan, Jack Lowry, Peter Oudemans, Kristin Dana","authorsParsed":[["Johnson","Faith",""],["Meegan","Ryan",""],["Lowry","Jack",""],["Oudemans","Peter",""],["Dana","Kristin",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 22:03:33 GMT"}],"updateDate":"2024-12-16","timestamp":1734041013000,"abstract":"  Agricultural domains are being transformed by recent advances in AI and\ncomputer vision that support quantitative visual evaluation. Using aerial and\nground imaging over a time series, we develop a framework for characterizing\nthe ripening process of cranberry crops, a crucial component for precision\nagriculture tasks such as comparing crop breeds (high-throughput phenotyping)\nand detecting disease. Using drone imaging, we capture images from 20 waypoints\nacross multiple bogs, and using ground-based imaging (hand-held camera), we\nimage same bog patch using fixed fiducial markers. Both imaging methods are\nrepeated to gather a multi-week time series spanning the entire growing season.\nAerial imaging provides multiple samples to compute a distribution of albedo\nvalues. Ground imaging enables tracking of individual berries for a detailed\nview of berry appearance changes. Using vision transformers (ViT) for feature\ndetection after segmentation, we extract a high dimensional feature descriptor\nof berry appearance. Interpretability of appearance is critical for plant\nbiologists and cranberry growers to support crop breeding decisions (e.g.\\\ncomparison of berry varieties from breeding programs). For interpretability, we\ncreate a 2D manifold of cranberry appearance by using a UMAP dimensionality\nreduction on ViT features. This projection enables quantification of ripening\npaths and a useful metric of ripening rate. We demonstrate the comparison of\nfour cranberry varieties based on our ripening assessments. This work is the\nfirst of its kind and has future impact for cranberries and for other crops\nincluding wine grapes, olives, blueberries, and maize. Aerial and ground\ndatasets are made publicly available.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"FFpxFSBKrQZIU2WlRjxY8Eo4DouRvB3bFrj5TjKDlMc","pdfSize":"8716682"}