{
  "id": "2412.11869",
  "title": "Automated Detection of Inter-Language Design Smells in Multi-Language\n  Deep Learning Frameworks",
  "authors": "Zengyang Li, Xiaoyong Zhang, Wenshuo Wang, Peng Liang, Ran Mo, Jie\n  Tan, Hui Liu",
  "authorsParsed": [
    [
      "Li",
      "Zengyang",
      ""
    ],
    [
      "Zhang",
      "Xiaoyong",
      ""
    ],
    [
      "Wang",
      "Wenshuo",
      ""
    ],
    [
      "Liang",
      "Peng",
      ""
    ],
    [
      "Mo",
      "Ran",
      ""
    ],
    [
      "Tan",
      "Jie",
      ""
    ],
    [
      "Liu",
      "Hui",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 15:22:36 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734362556000,
  "abstract": "  Nowadays, most DL frameworks (DLFs) use multilingual programming of Python\nand C/C++, facilitating the flexibility and performance of the DLF. However,\ninappropriate interlanguage interaction may introduce design smells involving\nmultiple programming languages (PLs), i.e., Inter-Language Design Smells\n(ILDS). Despite the negative impact of ILDS on multi-language DLFs, there is a\nlack of an automated approach for detecting ILDS in multi-language DLFs and a\ncomprehensive understanding on ILDS in such DLFs. This work automatically\ndetects ILDS in multi-language DLFs written in the combination of Python and\nC/C++, and to obtain a understanding on such ILDS in DLFs. We first developed\nan approach to automatically detecting ILDS in the multi-language DLFs written\nin the combination of Python and C/C++, including a number of ILDS and their\ndetection rules defined based on inter-language communication mechanisms and\ncode analysis. We then developed the CPSMELL tool that implements detection\nrules for automatically detecting such ILDS, and manually validated the\naccuracy of the tool. Finally, we performed a study to evaluate the ILDS in\nmulti-language DLFs. We proposed seven ILDS and achieved an accuracy of 98.17%\nin the manual validation of CPSMELL in 5 popular multi-language DLFs. The study\nresults revealed that among the 5 DLFs, TensorFlow, PyTorch, and PaddlePaddle\nexhibit relatively high prevalence of ILDS; each smelly file contains around 5\nILDS instances on average, with ILDS Long Lambda Function For Inter-language\nBinding and Unused Native Entity being relatively prominent; throughout the\nevolution process of the 5 DLFs, some ILDS were resolved to a certain extent,\nbut the overall count of ILDS instances shows an upward trend. The automated\ndetection of the proposed ILDS achieved a high accuracy, and the study provides\na comprehensive understanding on ILDS in the multi-language DLFs.\n",
  "subjects": [
    "Computer Science/Software Engineering"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "esEcDPnkdWVHRtnoSZ5KJfGgGi5YZeXBCKg_YxTM1Dk",
  "pdfSize": "2451059"
}