{"id":"2412.15705","title":"Is the Spin of the Black Hole in GX 339-4 Negative?","authors":"Andrzej A. Zdziarski, Srimanta Banerjee, Michal Szanecki, Ranjeev\n  Misra, Gulab Dewangan","authorsParsed":[["Zdziarski","Andrzej A.",""],["Banerjee","Srimanta",""],["Szanecki","Michal",""],["Misra","Ranjeev",""],["Dewangan","Gulab",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 09:28:12 GMT"},{"version":"v2","created":"Tue, 11 Feb 2025 02:11:43 GMT"}],"updateDate":"2025-02-12","timestamp":1734686892000,"abstract":"  We have studied the accreting black hole binary GX 339--4 using two highly\naccurate broad-band X-ray data sets in very soft spectral states from\nsimultaneous NICER and NuSTAR observations. Joint fitting of both data sets\nwith relativistic models of the disk, its Comptonization and reflection allows\nus to relatively accurately determine the black-hole mass and spin, and the\ndistance and inclination. However, we find the measured values strongly depend\non the used disk model. With widely used Kerr disk models treating departures\nfrom local blackbody spectra using color corrections, we find relatively low\nblack-hole masses and strongly negative spins (i.e., retrograde accretion).\nThen, models employing radiative transfer calculations of the disk atmosphere\npredict moderately positive spins and high masses. When adding a warm corona\nabove the disk (as proposed before for both AGNs and accreting binaries), we\nfind the spin is weakly constrained, but consistent with zero. In all cases,\nthe fitted inclination is low, $\\approx 30$--$34^\\circ$. For the spin axis\naligned with the binary axis, the mass function for this source implies large\nvalues of the mass, consistent only with those obtained with either\ndisk-atmosphere models or the presence of a warm corona. We also test different\ndisk models for an assumed set of mass, distance and inclination. We find that\ndifferent models yield values of the spin parameter differing up to $\\sim$0.3.\nOur results confirm previously found strong model dependencies of the measured\nblack-hole spin, now by comparing different disk models and for a low-mass\nX-ray binary.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"1wl9AFzNOqxipsvv5WsoqjDg2KSIw12dSjOdRgRbW-0","pdfSize":"2017398"}