{"id":"2412.11551","title":"Region-Based Optimization in Continual Learning for Audio Deepfake\n  Detection","authors":"Yujie Chen, Jiangyan Yi, Cunhang Fan, Jianhua Tao, Yong Ren, Siding\n  Zeng, Chu Yuan Zhang, Xinrui Yan, Hao Gu, Jun Xue, Chenglong Wang, Zhao Lv,\n  Xiaohui Zhang","authorsParsed":[["Chen","Yujie",""],["Yi","Jiangyan",""],["Fan","Cunhang",""],["Tao","Jianhua",""],["Ren","Yong",""],["Zeng","Siding",""],["Zhang","Chu Yuan",""],["Yan","Xinrui",""],["Gu","Hao",""],["Xue","Jun",""],["Wang","Chenglong",""],["Lv","Zhao",""],["Zhang","Xiaohui",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 08:34:09 GMT"}],"updateDate":"2024-12-17","timestamp":1734338049000,"abstract":"  Rapid advancements in speech synthesis and voice conversion bring convenience\nbut also new security risks, creating an urgent need for effective audio\ndeepfake detection. Although current models perform well, their effectiveness\ndiminishes when confronted with the diverse and evolving nature of real-world\ndeepfakes. To address this issue, we propose a continual learning method named\nRegion-Based Optimization (RegO) for audio deepfake detection. Specifically, we\nuse the Fisher information matrix to measure important neuron regions for real\nand fake audio detection, dividing them into four regions. First, we directly\nfine-tune the less important regions to quickly adapt to new tasks. Next, we\napply gradient optimization in parallel for regions important only to real\naudio detection, and in orthogonal directions for regions important only to\nfake audio detection. For regions that are important to both, we use sample\nproportion-based adaptive gradient optimization. This region-adaptive\noptimization ensures an appropriate trade-off between memory stability and\nlearning plasticity. Additionally, to address the increase of redundant neurons\nfrom old tasks, we further introduce the Ebbinghaus forgetting mechanism to\nrelease them, thereby promoting the capability of the model to learn more\ngeneralized discriminative features. Experimental results show our method\nachieves a 21.3% improvement in EER over the state-of-the-art continual\nlearning approach RWM for audio deepfake detection. Moreover, the effectiveness\nof RegO extends beyond the audio deepfake detection domain, showing potential\nsignificance in other tasks, such as image recognition. The code is available\nat https://github.com/cyjie429/RegO\n","subjects":["Computer Science/Sound","Computer Science/Artificial Intelligence","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ggnbuGh_F1oITccq32fHF-_kICChD45Tn6CsbF2Zj1Y","pdfSize":"1009456"}