{
  "id": "2412.11974",
  "title": "Emma-X: An Embodied Multimodal Action Model with Grounded Chain of\n  Thought and Look-ahead Spatial Reasoning",
  "authors": "Qi Sun, Pengfei Hong, Tej Deep Pala, Vernon Toh, U-Xuan Tan, Deepanway\n  Ghosal, Soujanya Poria",
  "authorsParsed": [
    [
      "Sun",
      "Qi",
      ""
    ],
    [
      "Hong",
      "Pengfei",
      ""
    ],
    [
      "Pala",
      "Tej Deep",
      ""
    ],
    [
      "Toh",
      "Vernon",
      ""
    ],
    [
      "Tan",
      "U-Xuan",
      ""
    ],
    [
      "Ghosal",
      "Deepanway",
      ""
    ],
    [
      "Poria",
      "Soujanya",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 16:58:28 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 17 Dec 2024 14:12:56 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734368308000,
  "abstract": "  Traditional reinforcement learning-based robotic control methods are often\ntask-specific and fail to generalize across diverse environments or unseen\nobjects and instructions. Visual Language Models (VLMs) demonstrate strong\nscene understanding and planning capabilities but lack the ability to generate\nactionable policies tailored to specific robotic embodiments. To address this,\nVisual-Language-Action (VLA) models have emerged, yet they face challenges in\nlong-horizon spatial reasoning and grounded task planning. In this work, we\npropose the Embodied Multimodal Action Model with Grounded Chain of Thought and\nLook-ahead Spatial Reasoning, Emma-X. Emma-X leverages our constructed\nhierarchical embodiment dataset based on BridgeV2, containing 60,000 robot\nmanipulation trajectories auto-annotated with grounded task reasoning and\nspatial guidance. Additionally, we introduce a trajectory segmentation strategy\nbased on gripper states and motion trajectories, which can help mitigate\nhallucination in grounding subtask reasoning generation. Experimental results\ndemonstrate that Emma-X achieves superior performance over competitive\nbaselines, particularly in real-world robotic tasks requiring spatial\nreasoning.\n",
  "subjects": [
    "Computer Science/Robotics",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Computation and Language",
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "hgnl05pPIlDkjJO_6NncI_9fV_UzWwdfx_6iNDf_k2w",
  "pdfSize": "9217626"
}