{"id":"2412.03933","title":"Exploring AI Text Generation, Retrieval-Augmented Generation, and\n  Detection Technologies: a Comprehensive Overview","authors":"Fnu Neha, Deepshikha Bhati, Deepak Kumar Shukla, Angela Guercio, Ben\n  Ward","authorsParsed":[["Neha","Fnu",""],["Bhati","Deepshikha",""],["Shukla","Deepak Kumar",""],["Guercio","Angela",""],["Ward","Ben",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 07:23:14 GMT"}],"updateDate":"2024-12-06","timestamp":1733383394000,"abstract":"  The rapid development of Artificial Intelligence (AI) has led to the creation\nof powerful text generation models, such as large language models (LLMs), which\nare widely used for diverse applications. However, concerns surrounding\nAI-generated content, including issues of originality, bias, misinformation,\nand accountability, have become increasingly prominent. This paper offers a\ncomprehensive overview of AI text generators (AITGs), focusing on their\nevolution, capabilities, and ethical implications. This paper also introduces\nRetrieval-Augmented Generation (RAG), a recent approach that improves the\ncontextual relevance and accuracy of text generation by integrating dynamic\ninformation retrieval. RAG addresses key limitations of traditional models,\nincluding their reliance on static knowledge and potential inaccuracies in\nhandling real-world data. Additionally, the paper reviews detection tools that\nhelp differentiate AI-generated text from human-written content and discusses\nthe ethical challenges these technologies pose. The paper explores future\ndirections for improving detection accuracy, supporting ethical AI development,\nand increasing accessibility. The paper contributes to a more responsible and\nreliable use of AI in content creation through these discussions.\n","subjects":["Computer Science/Artificial Intelligence","Computer Science/Human-Computer Interaction","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"s_KNdjKCFcCOHuJi16BYHdnLgKcSS9Kisu07e-b2NHo","pdfSize":"866735"}