{"id":"2412.12396","title":"An accurate SUPG-stabilized continuous Galerkin discretization for\n  anisotropic heat flux in magnetic confinement fusion","authors":"Golo A. Wimmer, Ben S. Southworth, Koki Sagiyama, Xian-Zhu Tang","authorsParsed":[["Wimmer","Golo A.",""],["Southworth","Ben S.",""],["Sagiyama","Koki",""],["Tang","Xian-Zhu",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 23:08:02 GMT"}],"updateDate":"2024-12-18","timestamp":1734390482000,"abstract":"  We present a novel spatial discretization for the anisotropic heat conduction\nequation, aimed at improved accuracy at the high levels of anisotropy seen in a\nmagnetized plasma, for example, for magnetic confinement fusion. The new\ndiscretization is based on a mixed formulation, introducing a form of the\ndirectional derivative along the magnetic field as an auxiliary variable and\ndiscretizing both the temperature and auxiliary fields in a continuous Galerkin\n(CG) space. Both the temperature and auxiliary variable equations are\nstabilized using the streamline upwind Petrov-Galerkin (SUPG) method, ensuring\na better representation of the directional derivatives and therefore an overall\nmore accurate solution. This approach can be seen as the CG-based version of\nour previous work (Wimmer, Southworth, Gregory, Tang, 2024), where we\nconsidered a mixed discontinuous Galerkin (DG) spatial discretization including\nDG-upwind stabilization. We prove consistency of the novel discretization, and\ndemonstrate its improved accuracy over existing CG-based methods in test cases\nrelevant to magnetic confinement fusion. This includes a long-run tokamak\nequilibrium sustainment scenario, demonstrating a 35% and 32% spurious heat\nloss for existing primal and mixed CG-based formulations versus 4% for our\nnovel SUPG-stabilized discretization.\n","subjects":["Mathematics/Numerical Analysis","Computer Science/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"y-_I6dE-vQf8DnjvmSsNBwEoWxYLY6-9B-oAHL-xZSc","pdfSize":"8619873"}