{
  "id": "2412.04580",
  "title": "ARTeFACT: Benchmarking Segmentation Models on Diverse Analogue Media\n  Damage",
  "authors": "Daniela Ivanova, Marco Aversa, Paul Henderson, John Williamson",
  "authorsParsed": [
    [
      "Ivanova",
      "Daniela",
      ""
    ],
    [
      "Aversa",
      "Marco",
      ""
    ],
    [
      "Henderson",
      "Paul",
      ""
    ],
    [
      "Williamson",
      "John",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 19:52:25 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733428345000,
  "abstract": "  Accurately detecting and classifying damage in analogue media such as\npaintings, photographs, textiles, mosaics, and frescoes is essential for\ncultural heritage preservation. While machine learning models excel in\ncorrecting degradation if the damage operator is known a priori, we show that\nthey fail to robustly predict where the damage is even after supervised\ntraining; thus, reliable damage detection remains a challenge. Motivated by\nthis, we introduce ARTeFACT, a dataset for damage detection in diverse types\nanalogue media, with over 11,000 annotations covering 15 kinds of damage across\nvarious subjects, media, and historical provenance. Furthermore, we contribute\nhuman-verified text prompts describing the semantic contents of the images, and\nderive additional textual descriptions of the annotated damage. We evaluate\nCNN, Transformer, diffusion-based segmentation models, and foundation vision\nmodels in zero-shot, supervised, unsupervised and text-guided settings,\nrevealing their limitations in generalising across media types. Our dataset is\navailable at\n$\\href{https://daniela997.github.io/ARTeFACT/}{https://daniela997.github.io/ARTeFACT/}$\nas the first-of-its-kind benchmark for analogue media damage detection and\nrestoration.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "jUjKu3rjWbXozsbvjwwXruXPHUaZSGp7A5xZKJ30QjE",
  "pdfSize": "50662940"
}