{"id":"2412.12383","title":"Virtual Realities: Is there only one advanced image display that\n  astronomers need?","authors":"Christopher J. Fluke, Hugo K. Walsh, Lewis de Zoete Grundy, Brian\n  Brady","authorsParsed":[["Fluke","Christopher J.",""],["Walsh","Hugo K.",""],["Grundy","Lewis de Zoete",""],["Brady","Brian",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 22:35:46 GMT"}],"updateDate":"2024-12-18","timestamp":1734388546000,"abstract":"  Data visualisation is an essential ingredient of scientific analysis,\ndiscovery, and communication. Along with a human (to do the looking) and the\ndata (something to look at), an image display device is a key component of any\ndata visualisation workflow. For the purpose of this work, standard displays\ninclude combinations of laptop displays, peripheral monitors, tablet and\nsmartphone screens, while the main categories of advanced displays are\nstereoscopic displays, tiled display walls, digital domes, virtual/mixed\nreality (VR/MR) head-mounted displays, and CAVE/CAVE2-style immersive rooms. We\npresent the results of the second Advanced Image Displays for Astronomy (AIDA)\nsurvey, advertised to the membership of the Astronomical Society of Australia\n(ASA) during June-August 2021. The goal of this survey was to gather background\ninformation on the level of awareness and usage of advanced displays in\nastronomy and astrophysics research. From 17 complete survey responses, sampled\nfrom a population of ~750 ASA members, we infer that: (1) a high proportion of\nASA members use standard displays but do not use advanced displays; (2) a\nmoderate proportion have seen a VR/MR HMD, and may also have used one -- but\nnot for research activities; and (3) there is a need for improved knowledge in\ngeneral about advanced displays, along with relevant software or applications\nthat can target specific science needs. We expect that this is compatible with\nthe experiences of much of the international astronomy and astrophysics\nresearch community. We suggest that VR/MR head-mounted displays have now\nreached a level of technical maturity such that they could be used to replicate\nor replace the functionality of most other advanced displays.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"1prEL-8V26MsY5yG73Ct2qqgWPeXtLakxE0doQ9OKBk","pdfSize":"5605245"}