{"id":"2412.08151","title":"Improving cosmological constraints via galaxy intrinsic alignment in\n  full-shape analysis","authors":"Junsup Shim, Teppei Okumura, Atsushi Taruya","authorsParsed":[["Shim","Junsup",""],["Okumura","Teppei",""],["Taruya","Atsushi",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 07:11:41 GMT"}],"updateDate":"2024-12-12","timestamp":1733901101000,"abstract":"  The intrinsic alignment (IA) of galaxy shapes probes the underlying\ngravitational tidal field, thus offering cosmological information complementary\nto galaxy clustering. In this paper, we perform a Fisher forecast to assess the\nbenefit of IA in improving cosmological parameter constraints, for the first\ntime, leveraging the full-shape (FS) information of IA statistics. Our forecast\nis based on PFS-like and Euclid-like surveys as examples of deep and wide\ngalaxy surveys, respectively. We explore various cosmological models, with the\nmost comprehensive one simultaneously including dynamical dark energy,\ncurvature, massive neutrinos, and modified gravity (MG). We find that adding FS\nIA information significantly tightens cosmological constraints relative to the\nFS clustering-only cases, particularly for dynamical dark energy and nonflat-MG\nmodels. For a deep galaxy survey, the Figure-of-Merit for the dark energy\nequation of state parameters is improved by at least more than $40\\%$ in all\ndynamical dark energy models investigated. For nonflat-MG models, parameter\nconstraints are tightened by $6-28\\%$, except for the dark matter density and\nspectral index parameters. For a wide galaxy survey, improvements with IA\nbecome milder, although its joint constraints are tighter than those from the\ndeep survey. Our findings highlight the efficacy of the galaxy IA as a\ncomplementary cosmological probe to galaxy clustering.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"F77DJ50ZvW47O_vjQReFWyd0JhgkdodH2F18M_TeGQ8","pdfSize":"1095300"}