{
  "id": "2412.07182",
  "title": "An Enhancement of CNN Algorithm for Rice Leaf Disease Image\n  Classification in Mobile Applications",
  "authors": "Kayne Uriel K. Rodrigo, Jerriane Hillary Heart S. Marcial, Samuel C.\n  Brillo, Khatalyn E. Mata, Jonathan C. Morano",
  "authorsParsed": [
    [
      "Rodrigo",
      "Kayne Uriel K.",
      ""
    ],
    [
      "Marcial",
      "Jerriane Hillary Heart S.",
      ""
    ],
    [
      "Brillo",
      "Samuel C.",
      ""
    ],
    [
      "Mata",
      "Khatalyn E.",
      ""
    ],
    [
      "Morano",
      "Jonathan C.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 04:41:10 GMT"
    },
    {
      "version": "v2",
      "created": "Sun, 16 Feb 2025 12:20:40 GMT"
    }
  ],
  "updateDate": "2025-02-18",
  "timestamp": 1733805670000,
  "abstract": "  This study focuses on enhancing rice leaf disease image classification\nalgorithms, which have traditionally relied on Convolutional Neural Network\n(CNN) models. We employed transfer learning with MobileViTV2_050 using\nImageNet-1k weights, a lightweight model that integrates CNN's local feature\nextraction with Vision Transformers' global context learning through a\nseparable self-attention mechanism. Our approach resulted in a significant\n15.66% improvement in classification accuracy for MobileViTV2_050-A, our first\nenhanced model trained on the baseline dataset, achieving 93.14%. Furthermore,\nMobileViTV2_050-B, our second enhanced model trained on a broader rice leaf\ndataset, demonstrated a 22.12% improvement, reaching 99.6% test accuracy.\nAdditionally, MobileViTV2-A attained an F1-score of 93% across four rice labels\nand a Receiver Operating Characteristic (ROC) curve ranging from 87% to 97%. In\nterms of resource consumption, our enhanced models reduced the total parameters\nof the baseline CNN model by up to 92.50%, from 14 million to 1.1 million.\nThese results indicate that MobileViTV2_050 not only improves computational\nefficiency through its separable self-attention mechanism but also enhances\nglobal context learning. Consequently, it offers a lightweight and robust\nsolution suitable for mobile deployment, advancing the interpretability and\npracticality of models in precision agriculture.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Xlx4Ol6TaGN60vymT_lspjcb_GkNOs8jVAZWKtp6W3Y",
  "pdfSize": "983887"
}