{
  "id": "2412.18231",
  "title": "Towards Macro-AUC oriented Imbalanced Multi-Label Continual Learning",
  "authors": "Yan Zhang, Guoqiang Wu, Bingzheng Wang, Teng Pang, Haoliang Sun,\n  Yilong Yin",
  "authorsParsed": [
    [
      "Zhang",
      "Yan",
      ""
    ],
    [
      "Wu",
      "Guoqiang",
      ""
    ],
    [
      "Wang",
      "Bingzheng",
      ""
    ],
    [
      "Pang",
      "Teng",
      ""
    ],
    [
      "Sun",
      "Haoliang",
      ""
    ],
    [
      "Yin",
      "Yilong",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 24 Dec 2024 07:30:20 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1735025420000,
  "abstract": "  In Continual Learning (CL), while existing work primarily focuses on the\nmulti-class classification task, there has been limited research on Multi-Label\nLearning (MLL). In practice, MLL datasets are often class-imbalanced, making it\ninherently challenging, a problem that is even more acute in CL. Due to its\nsensitivity to imbalance, Macro-AUC is an appropriate and widely used measure\nin MLL. However, there is no research to optimize Macro-AUC in MLCL\nspecifically. To fill this gap, in this paper, we propose a new memory\nreplay-based method to tackle the imbalance issue for Macro-AUC-oriented MLCL.\nSpecifically, inspired by recent theory work, we propose a new Reweighted\nLabel-Distribution-Aware Margin (RLDAM) loss. Furthermore, to be compatible\nwith the RLDAM loss, a new memory-updating strategy named Weight Retain\nUpdating (WRU) is proposed to maintain the numbers of positive and negative\ninstances of the original dataset in memory. Theoretically, we provide superior\ngeneralization analyses of the RLDAM-based algorithm in terms of Macro-AUC,\nseparately in batch MLL and MLCL settings. This is the first work to offer\ntheoretical generalization analyses in MLCL to our knowledge. Finally, a series\nof experimental results illustrate the effectiveness of our method over several\nbaselines. Our codes are available at\nhttps://github.com/ML-Group-SDU/Macro-AUC-CL.\n",
  "subjects": [
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "H-aA7B_ghp-1dY58KOpMGyq-C-lTAPxFOavUVdQfCD4",
  "pdfSize": "561673"
}