{
  "id": "2412.09861",
  "title": "Data-Driven Transfer Learning Framework for Estimating Turning Movement\n  Counts",
  "authors": "Xiaobo Ma, Hyunsoo Noh, Ryan Hatch, James Tokishi, Zepu Wang",
  "authorsParsed": [
    [
      "Ma",
      "Xiaobo",
      ""
    ],
    [
      "Noh",
      "Hyunsoo",
      ""
    ],
    [
      "Hatch",
      "Ryan",
      ""
    ],
    [
      "Tokishi",
      "James",
      ""
    ],
    [
      "Wang",
      "Zepu",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 05:02:16 GMT"
    }
  ],
  "updateDate": "2024-12-16",
  "timestamp": 1734066136000,
  "abstract": "  Urban transportation networks are vital for the efficient movement of people\nand goods, necessitating effective traffic management and planning. An integral\npart of traffic management is understanding the turning movement counts (TMCs)\nat intersections, Accurate TMCs at intersections are crucial for traffic signal\ncontrol, congestion mitigation, and road safety. In general, TMCs are obtained\nusing physical sensors installed at intersections, but this approach can be\ncost-prohibitive and technically challenging, especially for cities with\nextensive road networks. Recent advancements in machine learning and\ndata-driven approaches have offered promising alternatives for estimating TMCs.\nTraffic patterns can vary significantly across different intersections due to\nfactors such as road geometry, traffic signal settings, and local driver\nbehaviors. This domain discrepancy limits the generalizability and accuracy of\nmachine learning models when applied to new or unseen intersections. In\nresponse to these limitations, this research proposes a novel framework\nleveraging transfer learning (TL) to estimate TMCs at intersections by using\ntraffic controller event-based data, road infrastructure data, and\npoint-of-interest (POI) data. Evaluated on 30 intersections in Tucson, Arizona,\nthe performance of the proposed TL model was compared with eight\nstate-of-the-art regression models and achieved the lowest values in terms of\nMean Absolute Error and Root Mean Square Error.\n",
  "subjects": [
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "TlVjYcEe4bDtQD6VK4GcNQgCn5wgQguDrSWG2X226S8",
  "pdfSize": "531143"
}