{
  "id": "2412.00904",
  "title": "On a revised concept of an event that allows linking nanodosimetry and\n  microdosimetry in nanometric sites with macroscopic dosimetry",
  "authors": "Hans Rabus, Leo Thomas",
  "authorsParsed": [
    [
      "Rabus",
      "Hans",
      ""
    ],
    [
      "Thomas",
      "Leo",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 1 Dec 2024 17:37:56 GMT"
    },
    {
      "version": "v2",
      "created": "Wed, 19 Feb 2025 15:42:11 GMT"
    }
  ],
  "updateDate": "2025-02-28",
  "timestamp": 1733074676000,
  "abstract": "  This work reviews the concepts of an event used in micro- and nanodosimetry\nand analyzes how single event distributions could theoretically be derived from\nprobability distributions related to interactions of the primary particle which\nproduce secondary electrons. It is shown that the corresponding mathematical\nexpressions of conditional ionization cluster size distributions are alike\nthose for the single event frequency distribution of energy imparted,\nparticularly when all tracks are considered which intersect the volume in which\ninteractions of the primary particle can result in energy deposits in the site.\nTrack structure simulations of proton with energies between 1 MeV and 100 MeV\nare used to study how the occurrence of events depends on site size, beam\nradius, and proton energy. The range of impact parameters of particle tracks\nthat contribute to energy imparted in a site appears not to depend on whether\nany energy deposits or only energy deposits by ionizations are considered.\nSince there is no longer a one-to-one correspondence between tracks passing a\nsite and the occurrence of an event, it is proposed to use the fluence for\nwhich on average one event occurs as a substitute for single events. For\nprotons, the product of this fluence and the site cross section or the average\nnumber of tracks necessary for an event shows an interesting dependence on site\nsize and particle energy with asymptotic values close to unity for large sites\nand proton energies below 10 MeV. For a proton energy of 1 MeV, a minimum of\nthe number of tracks is observed for sites between 5 nm and 10 nm diameter. The\nrelative differences between the numbers of track per event on average obtained\nwith different options of Geant4-DNA are in the order of 10 % and illustrate\nthe need for further investigations into cross-section datasets and their\nuncertainties.\n",
  "subjects": [
    "Physics/Medical Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "bYYqbgHWK_cxzevMwiaAQm-PPGpL1O0D-Lej4Yf3yeE",
  "pdfSize": "1395328"
}