{"id":"2412.10440","title":"Multi-level Matching Network for Multimodal Entity Linking","authors":"Zhiwei Hu, V\\'ictor Guti\\'errez-Basulto, Ru Li, Jeff Z. Pan","authorsParsed":[["Hu","Zhiwei",""],["Gutiérrez-Basulto","Víctor",""],["Li","Ru",""],["Pan","Jeff Z.",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 10:26:17 GMT"}],"updateDate":"2024-12-17","timestamp":1733912777000,"abstract":"  Multimodal entity linking (MEL) aims to link ambiguous mentions within\nmultimodal contexts to corresponding entities in a multimodal knowledge base.\nMost existing approaches to MEL are based on representation learning or\nvision-and-language pre-training mechanisms for exploring the complementary\neffect among multiple modalities. However, these methods suffer from two\nlimitations. On the one hand, they overlook the possibility of considering\nnegative samples from the same modality. On the other hand, they lack\nmechanisms to capture bidirectional cross-modal interaction. To address these\nissues, we propose a Multi-level Matching network for Multimodal Entity Linking\n(M3EL). Specifically, M3EL is composed of three different modules: (i) a\nMultimodal Feature Extraction module, which extracts modality-specific\nrepresentations with a multimodal encoder and introduces an intra-modal\ncontrastive learning sub-module to obtain better discriminative embeddings\nbased on uni-modal differences; (ii) an Intra-modal Matching Network module,\nwhich contains two levels of matching granularity: Coarse-grained\nGlobal-to-Global and Fine-grained Global-to-Local, to achieve local and global\nlevel intra-modal interaction; (iii) a Cross-modal Matching Network module,\nwhich applies bidirectional strategies, Textual-to-Visual and Visual-to-Textual\nmatching, to implement bidirectional cross-modal interaction. Extensive\nexperiments conducted on WikiMEL, RichpediaMEL, and WikiDiverse datasets\ndemonstrate the outstanding performance of M3EL when compared to the\nstate-of-the-art baselines.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"GpDvnSWlpR9BnhA9EZ2Fr3JRju9YILuHZZGbJSLdv6U","pdfSize":"1389312"}