{"id":"2412.19275","title":"Memory-Centric Computing: Recent Advances in Processing-in-DRAM","authors":"Onur Mutlu, Ataberk Olgun, Geraldo F. Oliveira, Ismail Emir Yuksel","authorsParsed":[["Mutlu","Onur",""],["Olgun","Ataberk",""],["Oliveira","Geraldo F.",""],["Yuksel","Ismail Emir",""]],"versions":[{"version":"v1","created":"Thu, 26 Dec 2024 16:31:40 GMT"}],"updateDate":"2024-12-30","timestamp":1735230700000,"abstract":"  Memory-centric computing aims to enable computation capability in and near\nall places where data is generated and stored. As such, it can greatly reduce\nthe large negative performance and energy impact of data access and data\nmovement, by 1) fundamentally avoiding data movement, 2) reducing data access\nlatency & energy, and 3) exploiting large parallelism of memory arrays. Many\nrecent studies show that memory-centric computing can largely improve system\nperformance & energy efficiency. Major industrial vendors and startup companies\nhave recently introduced memory chips with sophisticated computation\ncapabilities. Going forward, both hardware and software stack should be\nrevisited and designed carefully to take advantage of memory-centric computing.\n  This work describes several major recent advances in memory-centric\ncomputing, specifically in Processing-in-DRAM, a paradigm where the operational\ncharacteristics of a DRAM chip are exploited and enhanced to perform\ncomputation on data stored in DRAM. Specifically, we describe 1) new techniques\nthat slightly modify DRAM chips to enable both enhanced computation capability\nand easier programmability, 2) new experimental studies that demonstrate the\nfunctionally-complete bulk-bitwise computational capability of real commercial\noff-the-shelf DRAM chips, without any modifications to the DRAM chip or the\ninterface, and 3) new DRAM designs that improve access granularity &\nefficiency, unleashing the true potential of Processing-in-DRAM.\n","subjects":["Computer Science/Hardware Architecture","Computer Science/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"WRl0Y9EFcTeItluWayjyJ3hVgtkoQm97UXOLRecnqDk","pdfSize":"1534696"}