{
  "id": "2412.17192",
  "title": "Picosecond expansion in LaAlO3 resonantly driven by infrared-active\n  phonons",
  "authors": "Jakob Gollwitzer, Jeffrey Z. Kaaret, Y. Eren Suyolcu, Guru Khalsa,\n  Rylan C. Fernandes, Oleg Gorobtsov, S\\\"oren Buchenau, ChanJu You, Jayanti\n  Higgins, Ryan S. Russell, Ziming Shao, Yorick A. Birkh\\\"olzer, Takahiro Sato,\n  Matthieu Chollet, Giacomo Coslovich, Mario Br\\\"utzam, Christo Guguschev, John\n  W. Harter, Ankit S. Disa, Darrell G. Schlom, Nicole A. Benedek, and Andrej\n  Singer",
  "authorsParsed": [
    [
      "Gollwitzer",
      "Jakob",
      ""
    ],
    [
      "Kaaret",
      "Jeffrey Z.",
      ""
    ],
    [
      "Suyolcu",
      "Y. Eren",
      ""
    ],
    [
      "Khalsa",
      "Guru",
      ""
    ],
    [
      "Fernandes",
      "Rylan C.",
      ""
    ],
    [
      "Gorobtsov",
      "Oleg",
      ""
    ],
    [
      "Buchenau",
      "Sören",
      ""
    ],
    [
      "You",
      "ChanJu",
      ""
    ],
    [
      "Higgins",
      "Jayanti",
      ""
    ],
    [
      "Russell",
      "Ryan S.",
      ""
    ],
    [
      "Shao",
      "Ziming",
      ""
    ],
    [
      "Birkhölzer",
      "Yorick A.",
      ""
    ],
    [
      "Sato",
      "Takahiro",
      ""
    ],
    [
      "Chollet",
      "Matthieu",
      ""
    ],
    [
      "Coslovich",
      "Giacomo",
      ""
    ],
    [
      "Brützam",
      "Mario",
      ""
    ],
    [
      "Guguschev",
      "Christo",
      ""
    ],
    [
      "Harter",
      "John W.",
      ""
    ],
    [
      "Disa",
      "Ankit S.",
      ""
    ],
    [
      "Schlom",
      "Darrell G.",
      ""
    ],
    [
      "Benedek",
      "Nicole A.",
      ""
    ],
    [
      "Singer",
      "Andrej",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 22 Dec 2024 23:56:44 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734911804000,
  "abstract": "  We investigate the ultrafast structural dynamics of LaAlO3 thin films driven\nby short mid-infrared laser pulses at 20 THz. Time-resolved X-ray diffraction\nreveals an immediate lattice expansion and an acoustic breathing mode of the\nfilm. First-principles theory and a spring-mass model identify the direct\ncoupling between coherently driven infrared-active phonons and strain as the\nunderlying mechanism. Time-resolved optical birefringence measurements confirm\nthat the amplitude of this acoustic mode scales linearly with the pump fluence,\nwhich agrees with the theory. Furthermore, time-resolved X-ray diffuse\nscattering indicates that THz excitation enhances crystallinity by inducing a\nnon-thermal increase in structural symmetry originating from preexisting\ndefects. These findings highlight the potential of a multimodal\napproach-combining time-resolved X-ray and optical measurements and\nfirst-principles theory-to elucidate and control structural dynamics in\nnanoscale materials.\n",
  "subjects": [
    "Condensed Matter/Materials Science"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Cyc0HPYMyTQ6Qzrh1-sfuboaBl7DxsRuT5ezkeoH_L8",
  "pdfSize": "3063478"
}