{
  "id": "2412.03557",
  "title": "Freshness and Informativity Weighted Cognitive Extent and Its\n  Correlation with Cumulative Citation Count",
  "authors": "Zihe Wang, Jian Wu",
  "authorsParsed": [
    [
      "Wang",
      "Zihe",
      ""
    ],
    [
      "Wu",
      "Jian",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 18:52:32 GMT"
    },
    {
      "version": "v2",
      "created": "Sat, 28 Dec 2024 18:54:29 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1733338352000,
  "abstract": "  In this paper, we revisit cognitive extent, originally defined as the number\nof unique phrases in a quota. We introduce Freshness and Informative Weighted\nCognitive Extent (FICE), calculated based on two novel weighting factors, the\nlifetime ratio and informativity of scientific entities. We model the lifetime\nof each scientific entity as the time-dependent document frequency, which is\nfit by the composition of multiple Gaussian profiles. The lifetime ratio is\nthen calculated as the cumulative document frequency at the publication time\n$t_0$ divided by the cumulative document frequency over its entire lifetime.\nThe informativity is calculated by normalizing the document frequency across\nall scientific entities recognized in a title. Using the ACL Anthology, we\nverified the trend formerly observed in several other domains that the number\nof unique scientific entities per quota increased gradually at a slower rate.\nWe found that FICE exhibits a strong correlation with the average cumulative\ncitation count within a quota. Our code is available at\n\\href{https://github.com/ZiheHerzWang/Freshness-and-Informativity-Weighted-Cognitive-Extent}{https://github.com/ZiheHerzWang/Freshness-and-Informativity-Weighted-Cognitive-Extent}\n",
  "subjects": [
    "Computer Science/Digital Libraries",
    "Computer Science/Information Retrieval"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "KhqDLqY2giXqbKZTa7GGOUs7u6NA-7_Y3XPImxrmSLk",
  "pdfSize": "935511"
}