{"id":"2412.13662","title":"When Should We Prefer State-to-Visual DAgger Over Visual Reinforcement\n  Learning?","authors":"Tongzhou Mu, Zhaoyang Li, Stanis{\\l}aw Wiktor Strzelecki, Xiu Yuan,\n  Yunchao Yao, Litian Liang, Hao Su","authorsParsed":[["Mu","Tongzhou",""],["Li","Zhaoyang",""],["Strzelecki","Stanisław Wiktor",""],["Yuan","Xiu",""],["Yao","Yunchao",""],["Liang","Litian",""],["Su","Hao",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 09:39:12 GMT"}],"updateDate":"2024-12-19","timestamp":1734514752000,"abstract":"  Learning policies from high-dimensional visual inputs, such as pixels and\npoint clouds, is crucial in various applications. Visual reinforcement learning\nis a promising approach that directly trains policies from visual observations,\nalthough it faces challenges in sample efficiency and computational costs. This\nstudy conducts an empirical comparison of State-to-Visual DAgger, a two-stage\nframework that initially trains a state policy before adopting online imitation\nto learn a visual policy, and Visual RL across a diverse set of tasks. We\nevaluate both methods across 16 tasks from three benchmarks, focusing on their\nasymptotic performance, sample efficiency, and computational costs.\nSurprisingly, our findings reveal that State-to-Visual DAgger does not\nuniversally outperform Visual RL but shows significant advantages in\nchallenging tasks, offering more consistent performance. In contrast, its\nbenefits in sample efficiency are less pronounced, although it often reduces\nthe overall wall-clock time required for training. Based on our findings, we\nprovide recommendations for practitioners and hope that our results contribute\nvaluable perspectives for future research in visual policy learning.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Artificial Intelligence","Computer Science/Machine Learning","Computer Science/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ksCQ-5XIaNiQ-v-_FY8kOlTaSjlzZPZvzTY5AKDWIFY","pdfSize":"2147469"}