{
  "id": "2412.09285",
  "title": "Free-Energy Machine for Combinatorial Optimization",
  "authors": "Zi-Song Shen, Feng Pan, Yao Wang, Yi-Ding Men, Wen-Biao Xu, Man-Hong\n  Yung, Pan Zhang",
  "authorsParsed": [
    [
      "Shen",
      "Zi-Song",
      ""
    ],
    [
      "Pan",
      "Feng",
      ""
    ],
    [
      "Wang",
      "Yao",
      ""
    ],
    [
      "Men",
      "Yi-Ding",
      ""
    ],
    [
      "Xu",
      "Wen-Biao",
      ""
    ],
    [
      "Yung",
      "Man-Hong",
      ""
    ],
    [
      "Zhang",
      "Pan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 13:54:37 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1734011677000,
  "abstract": "  Finding optimal solutions to combinatorial optimization problems is pivotal\nin both scientific and technological domains, within academic research and\nindustrial applications. A considerable amount of effort has been invested in\nthe development of accelerated methods that leverage sophisticated models and\nharness the power of advanced computational hardware. Despite the advancements,\na critical challenge persists, the dual demand for both high efficiency and\nbroad generality in solving problems. In this work, we propose a general\nmethod, Free-Energy Machine (FEM), based on the ideas of free-energy\nminimization in statistical physics, combined with automatic differentiation\nand gradient-based optimization in machine learning. The algorithm is flexible,\nsolving various combinatorial optimization problems using a unified framework,\nand is efficient, naturally utilizing massive parallel computational devices\nsuch as graph processing units (GPUs) and field-programmable gate arrays\n(FPGAs). We benchmark our algorithm on various problems including the maximum\ncut problems, balanced minimum cut problems, and maximum $k$-satisfiability\nproblems, scaled to millions of variables, across both synthetic, real-world,\nand competition problem instances. The findings indicate that our algorithm not\nonly exhibits exceptional speed but also surpasses the performance of\nstate-of-the-art algorithms tailored for individual problems. This highlights\nthat the interdisciplinary fusion of statistical physics and machine learning\nopens the door to delivering cutting-edge methodologies that will have broad\nimplications across various scientific and industrial landscapes.\n",
  "subjects": [
    "Condensed Matter/Statistical Mechanics",
    "Condensed Matter/Disordered Systems and Neural Networks",
    "Mathematics/Optimization and Control",
    "Physics/Computational Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Rd14c69y1ltkPWU1mAiakD4V1OtSNRuMaAjn7VCkt9U",
  "pdfSize": "9512447"
}