{"id":"2412.18757","title":"Evaluating authorship disambiguation quality through anomaly analysis on\n  researchers' career transition","authors":"Huaxia Zhou and Mengyi Sun","authorsParsed":[["Zhou","Huaxia",""],["Sun","Mengyi",""]],"versions":[{"version":"v1","created":"Wed, 25 Dec 2024 03:04:46 GMT"}],"updateDate":"2024-12-30","timestamp":1735095886000,"abstract":"  Authorship disambiguation is crucial for advancing studies in science of\nscience. However, assessing the quality of authorship disambiguation in\nlarge-scale databases remains challenging since it is difficult to manually\ncurate a gold-standard dataset that contains disambiguated authors. Through\nestimating the timing of when 5.8 million biomedical researchers became\nindependent Principal Investigators (PIs) with authorship metadata extracted\nfrom the OpenAlex -- the largest open-source bibliometric database -- we\nunexpectedly discovered an anomaly: over 60% of researchers appeared as the\nlast authors in their first career year. We hypothesized that this improbable\nfinding results from poor name disambiguation, suggesting that such an anomaly\nmay serve as an indicator of low-quality authorship disambiguation. Our\nfindings indicated that authors who lack affiliation information, which makes\nit more difficult to disambiguate, were far more likely to exhibit this anomaly\ncompared to those who included their affiliation information. In contrast,\nauthors with Open Researcher and Contributor ID (ORCID) -- expected to have\nhigher quality disambiguation -- showed significantly lower anomaly rates. We\nfurther applied this approach to examine the authorship disambiguation quality\nby gender over time, and we found that the quality of disambiguation for female\nauthors was lower than that for male authors before 2010, suggesting that\ngender disparity findings based on pre-2010 data may require careful\nreexamination. Our results provide a framework for systematically evaluating\nauthorship disambiguation quality in various contexts, facilitating future\nimprovements in efforts to authorship disambiguation.\n","subjects":["Computer Science/Digital Libraries","Computer Science/Computational Engineering, Finance, and Science","Computer Science/Social and Information Networks","Physics/Data Analysis, Statistics and Probability"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0fXcxWP1tthwMr4egZ4BqSX5-dxw1zK5PbyGJFChrIw","pdfSize":"532087"}