{
  "id": "2412.12232",
  "title": "You Only Submit One Image to Find the Most Suitable Generative Model",
  "authors": "Zhi Zhou, Lan-Zhe Guo, Peng-Xiao Song, Yu-Feng Li",
  "authorsParsed": [
    [
      "Zhou",
      "Zhi",
      ""
    ],
    [
      "Guo",
      "Lan-Zhe",
      ""
    ],
    [
      "Song",
      "Peng-Xiao",
      ""
    ],
    [
      "Li",
      "Yu-Feng",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 14:46:57 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734360417000,
  "abstract": "  Deep generative models have achieved promising results in image generation,\nand various generative model hubs, e.g., Hugging Face and Civitai, have been\ndeveloped that enable model developers to upload models and users to download\nmodels. However, these model hubs lack advanced model management and\nidentification mechanisms, resulting in users only searching for models through\ntext matching, download sorting, etc., making it difficult to efficiently find\nthe model that best meets user requirements. In this paper, we propose a novel\nsetting called Generative Model Identification (GMI), which aims to enable the\nuser to identify the most appropriate generative model(s) for the user's\nrequirements from a large number of candidate models efficiently. To our best\nknowledge, it has not been studied yet. In this paper, we introduce a\ncomprehensive solution consisting of three pivotal modules: a weighted Reduced\nKernel Mean Embedding (RKME) framework for capturing the generated image\ndistribution and the relationship between images and prompts, a pre-trained\nvision-language model aimed at addressing dimensionality challenges, and an\nimage interrogator designed to tackle cross-modality issues. Extensive\nempirical results demonstrate the proposal is both efficient and effective. For\nexample, users only need to submit a single example image to describe their\nrequirements, and the model platform can achieve an average top-4\nidentification accuracy of more than 80%.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "UOWF9V5WU--fSdmj5ehnnAobLdXZ4icRmy3JR4c5FN8",
  "pdfSize": "20505220"
}