{"id":"2412.10209","title":"GAF: Gaussian Avatar Reconstruction from Monocular Videos via Multi-view\n  Diffusion","authors":"Jiapeng Tang, Davide Davoli, Tobias Kirschstein, Liam Schoneveld,\n  Matthias Niessner","authorsParsed":[["Tang","Jiapeng",""],["Davoli","Davide",""],["Kirschstein","Tobias",""],["Schoneveld","Liam",""],["Niessner","Matthias",""]],"versions":[{"version":"v1","created":"Fri, 13 Dec 2024 15:31:22 GMT"}],"updateDate":"2024-12-16","timestamp":1734103882000,"abstract":"  We propose a novel approach for reconstructing animatable 3D Gaussian avatars\nfrom monocular videos captured by commodity devices like smartphones.\nPhotorealistic 3D head avatar reconstruction from such recordings is\nchallenging due to limited observations, which leaves unobserved regions\nunder-constrained and can lead to artifacts in novel views. To address this\nproblem, we introduce a multi-view head diffusion model, leveraging its priors\nto fill in missing regions and ensure view consistency in Gaussian splatting\nrenderings. To enable precise viewpoint control, we use normal maps rendered\nfrom FLAME-based head reconstruction, which provides pixel-aligned inductive\nbiases. We also condition the diffusion model on VAE features extracted from\nthe input image to preserve details of facial identity and appearance. For\nGaussian avatar reconstruction, we distill multi-view diffusion priors by using\niteratively denoised images as pseudo-ground truths, effectively mitigating\nover-saturation issues. To further improve photorealism, we apply latent\nupsampling to refine the denoised latent before decoding it into an image. We\nevaluate our method on the NeRSemble dataset, showing that GAF outperforms the\nprevious state-of-the-art methods in novel view synthesis by a 5.34\\% higher\nSSIM score. Furthermore, we demonstrate higher-fidelity avatar reconstructions\nfrom monocular videos captured on commodity devices.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Artificial Intelligence","Computer Science/Graphics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"KIlkbex43Ro1wcefgSQ_4hRR0ZlBfuJyNEJN3iDDqFs","pdfSize":"9586252"}