{"id":"2412.12960","title":"Does the random nature of cell-virus interactions during in vitro\n  infections affect TCID$_{50}$ measurements and parameter estimation by\n  mathematical models?","authors":"Christian Quirouette, Risavarshni Thevakumaran, Kyosuke Adachi, and\n  Catherine A. A. Beauchemin","authorsParsed":[["Quirouette","Christian",""],["Thevakumaran","Risavarshni",""],["Adachi","Kyosuke",""],["Beauchemin","Catherine A. A.",""]],"versions":[{"version":"v1","created":"Tue, 17 Dec 2024 14:43:33 GMT"}],"updateDate":"2024-12-18","timestamp":1734446613000,"abstract":"  Endpoint dilution (TCID50) assays cannot count the number of infectious\nvirions (IVs), and instead are limited to counting the number of Specific\nINfections caused by the sample (SIN). The latter depends not only on whether\nvirions are infectious, but also on the cells and the experimental conditions\nunder which they interact. These interactions are random and controlled by\nparameters such as the rates at which IVs lose infectivity, enter cells, or\nfail to replicate following cell entry. Here, stochastic TCID50 assays are\nsimulated to determine how the random number of infected wells relates to the\nparameters and the number of IVs in a sample. We introduce a new parameter\nestimation method based on the likelihood of observing a given TCID50 assay\noutcome given the model-predicted number of IVs in the sample. We then\nsuccessively evaluate how parameter estimates are affected by the use of: 1)\nthe new likelihood function vs the typical assumption of Gaussian-distributed\nmeasurement errors; 2) IV vs SIN units to express virus in the model; and 3) a\nstochastic vs an ODE model to simulate the course of a virus infection. Unlike\nprevious methods, the new likelihood correctly handles measurements beyond the\ndetection limits, and results in non-Gaussian distributions. Expressing virus\nusing IV units makes it possible to impose physical constraints (e.g. one IV\ncannot infect more than one cell), and yields more biologically useful\nparameters (e.g. mutation emergence likelihood depends on the number of IVs,\nnot SIN, produced). Using a stochastic rather than an ODE model we show that\nthe variability observed between replicate in vitro virus infections is\nconsistent with the level of stochasticity introduced by the TCID50 assay,\nwhich can be reduced through better assay design. The framework introduced\nherein offers several important improvements over current methods and should be\nwidely adopted.\n","subjects":["Physics/Biological Physics","Quantitative Biology/Quantitative Methods"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"adMWTaM7KKNGA_TrgdNX_Lh03AcywYI4GUNH-tiG3Ig","pdfSize":"5110052"}