{"id":"2412.12450","title":"Investigating the Effect of Electrical and Thermal Transport Properties\n  on Oxide-Based Memristors Performance and Reliability","authors":"Armin Gooran-Shoorakchaly, Sarah Sharif, Yaser Banad","authorsParsed":[["Gooran-Shoorakchaly","Armin",""],["Sharif","Sarah",""],["Banad","Yaser",""]],"versions":[{"version":"v1","created":"Tue, 17 Dec 2024 01:31:07 GMT"}],"updateDate":"2024-12-18","timestamp":1734399067000,"abstract":"  Achieving reliable resistive switching in oxide-based memristive devices\nrequires precise control over conductive filament (CF) formation and behavior,\nyet the fundamental relationship between oxide material properties and\nswitching uniformity remains incompletely understood. Here, we develop a\ncomprehensive physical model to investigate how electrical and thermal\nconductivities influence CF dynamics in TaOx-based memristors. Our simulations\nreveal that higher electrical conductivity promotes oxygen vacancy generation\nand reduces forming voltage, while higher thermal conductivity enhances heat\ndissipation, leading to increased forming voltage. The uniformity of resistive\nswitching is strongly dependent on the interplay between these transport\nproperties. We identify two distinct pathways for achieving optimal High\nResistance State (HRS) uniformity with standard deviation-to-mean ratios as low\nas 0.045, each governed by different balances of electrical and thermal\ntransport mechanisms. For the Low Resistance State (LRS), high uniformity\n(0.009) can be maintained when either electrical or thermal conductivity is\nlow. The resistance ratio between HRS and LRS shows a strong dependence on\nthese conductivities, with higher ratios observed at lower conductivity values.\nThese findings provide essential guidelines for material selection in RRAM\ndevices, particularly for applications demanding high reliability and uniform\nswitching characteristics.\n","subjects":["Computer Science/Emerging Technologies","Computer Science/Hardware Architecture","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"4NEQ5Ob9cxTstcZZASi4IY0ja07r4Hq8Q-HJqyoXnKM","pdfSize":"982330"}