{"id":"2412.06030","title":"Frontier orbitals control dynamical disorder in molecular semiconductors","authors":"Alexander Neef, Sebastian Hammer, Yuxuan Yao, Shubham Sharma, Samuel\n  Beaulieu, Shuo Dong, Tommaso Pincelli, Maximillian Frank, Martin Wolf,\n  Mariana Rossi, Harld Oberhofer, Laurenz Rettig, Jens Pflaum and Ralph\n  Ernstorfer","authorsParsed":[["Neef","Alexander",""],["Hammer","Sebastian",""],["Yao","Yuxuan",""],["Sharma","Shubham",""],["Beaulieu","Samuel",""],["Dong","Shuo",""],["Pincelli","Tommaso",""],["Frank","Maximillian",""],["Wolf","Martin",""],["Rossi","Mariana",""],["Oberhofer","Harld",""],["Rettig","Laurenz",""],["Pflaum","Jens",""],["Ernstorfer","Ralph",""]],"versions":[{"version":"v1","created":"Sun, 8 Dec 2024 19:00:28 GMT"}],"updateDate":"2024-12-10","timestamp":1733684428000,"abstract":"  Charge transport in organic semiconductors is limited by dynamical disorder.\nDesign rules for new high-mobility materials have therefore focused on limiting\nits two foundations: structural fluctuations and the transfer integral\ngradient. However, it has remained unclear how these goals should be translated\ninto molecular structures. Here we show that a specific shape of the frontier\norbital, with a lack of nodes along the long molecular axis, reduces the\ntransfer integral gradient and therefore the dynamical disorder. We\ninvestigated single crystals of the prototypical molecular semiconductors\npentacene and picene by angle-resolved photoemission spectroscopy and dynamical\ndisorder calculations. We found that picene exhibits a remarkably low dynamical\ndisorder. By separating in- and out-of-plane components of dynamical disorder,\nwe identify the reason as a reduced out-of-plane disorder from a small transfer\nintegral derivative. Our results demonstrate that molecules with an armchair\n$\\pi$-electron topology and same-phase frontier orbitals like picene are\npromising molecular building blocks for the next generation of organic\nsemiconductors.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Disordered Systems and Neural Networks"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7uKEIimrrf4GbUM2xXOMkvF2lw3gamsVnOcxKJtCNJM","pdfSize":"22222934"}