{"id":"2412.02155","title":"CausalMob: Causal Human Mobility Prediction with LLMs-derived Human\n  Intentions toward Public Events","authors":"Xiaojie Yang and Hangli Ge and Jiawei Wang and Zipei Fan and Renhe\n  Jiang and Ryosuke Shibasaki and Noboru Koshizuka","authorsParsed":[["Yang","Xiaojie",""],["Ge","Hangli",""],["Wang","Jiawei",""],["Fan","Zipei",""],["Jiang","Renhe",""],["Shibasaki","Ryosuke",""],["Koshizuka","Noboru",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 04:29:27 GMT"},{"version":"v2","created":"Tue, 7 Jan 2025 06:30:24 GMT"}],"updateDate":"2025-01-08","timestamp":1733200167000,"abstract":"  Large-scale human mobility exhibits spatial and temporal patterns that can\nassist policymakers in decision making. Although traditional prediction models\nattempt to capture these patterns, they often interfered by non-periodic public\nevents, such as disasters and occasional celebrations. Since regular human\nmobility patterns are heavily affected by these events, estimating their causal\neffects is critical to accurate mobility predictions. Although news articles\nprovide unique perspectives on these events in an unstructured format,\nprocessing is a challenge. In this study, we propose a causality-augmented\nprediction model, called CausalMob, to analyze the causal effects of public\nevents. We first utilize large language models (LLMs) to extract human\nintentions from news articles and transform them into features that act as\ncausal treatments. Next, the model learns representations of spatio-temporal\nregional covariates from multiple data sources to serve as confounders for\ncausal inference. Finally, we present a causal effect estimation framework to\nensure event features remain independent of confounders during prediction.\nBased on large-scale real-world data, the experimental results show that the\nproposed model excels in human mobility prediction, outperforming\nstate-of-the-art models.\n","subjects":["Computer Science/Machine Learning","Computer Science/Artificial Intelligence","Computer Science/Information Retrieval","Computer Science/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"yxsKGG381raqm9I2RR6EseAGMHL86Pz-1OY407h2ve4","pdfSize":"4853201"}