{
  "id": "2412.16199",
  "title": "Stabilizing Machine Learning for Reproducible and Explainable Results: A\n  Novel Validation Approach to Subject-Specific Insights",
  "authors": "Gideon Vos, Liza van Eijk, Zoltan Sarnyai, Mostafa Rahimi Azghadi",
  "authorsParsed": [
    [
      "Vos",
      "Gideon",
      ""
    ],
    [
      "van Eijk",
      "Liza",
      ""
    ],
    [
      "Sarnyai",
      "Zoltan",
      ""
    ],
    [
      "Azghadi",
      "Mostafa Rahimi",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 23:14:26 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734390866000,
  "abstract": "  Machine Learning is transforming medical research by improving diagnostic\naccuracy and personalizing treatments. General ML models trained on large\ndatasets identify broad patterns across populations, but their effectiveness is\noften limited by the diversity of human biology. This has led to interest in\nsubject-specific models that use individual data for more precise predictions.\nHowever, these models are costly and challenging to develop. To address this,\nwe propose a novel validation approach that uses a general ML model to ensure\nreproducible performance and robust feature importance analysis at both group\nand subject-specific levels. We tested a single Random Forest (RF) model on\nnine datasets varying in domain, sample size, and demographics. Different\nvalidation techniques were applied to evaluate accuracy and feature importance\nconsistency. To introduce variability, we performed up to 400 trials per\nsubject, randomly seeding the ML algorithm for each trial. This generated 400\nfeature sets per subject, from which we identified top subject-specific\nfeatures. A group-specific feature importance set was then derived from all\nsubject-specific results. We compared our approach to conventional validation\nmethods in terms of performance and feature importance consistency. Our\nrepeated trials approach, with random seed variation, consistently identified\nkey features at the subject level and improved group-level feature importance\nanalysis using a single general model. Subject-specific models address\nbiological variability but are resource-intensive. Our novel validation\ntechnique provides consistent feature importance and improved accuracy within a\ngeneral ML model, offering a practical and explainable alternative for clinical\nresearch.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Statistics/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "jO-0-Xgg48ZyLluTP75gUJKGTKtxniQJ8oRG17qF0vo",
  "pdfSize": "1066536"
}