{
  "id": "2412.08293",
  "title": "SINERGYM -- A virtual testbed for building energy optimization with\n  Reinforcement Learning",
  "authors": "Alejandro Campoy-Nieves, Antonio Manjavacas, Javier Jim\\'enez-Raboso,\n  Miguel Molina-Solana, Juan G\\'omez-Romero",
  "authorsParsed": [
    [
      "Campoy-Nieves",
      "Alejandro",
      ""
    ],
    [
      "Manjavacas",
      "Antonio",
      ""
    ],
    [
      "Jiménez-Raboso",
      "Javier",
      ""
    ],
    [
      "Molina-Solana",
      "Miguel",
      ""
    ],
    [
      "Gómez-Romero",
      "Juan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 11:09:13 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733915353000,
  "abstract": "  Simulation has become a crucial tool for Building Energy Optimization (BEO)\nas it enables the evaluation of different design and control strategies at a\nlow cost. Machine Learning (ML) algorithms can leverage large-scale simulations\nto learn optimal control from vast amounts of data without supervision,\nparticularly under the Reinforcement Learning (RL) paradigm. Unfortunately, the\nlack of open and standardized tools has hindered the widespread application of\nML and RL to BEO. To address this issue, this paper presents Sinergym, an\nopen-source Python-based virtual testbed for large-scale building simulation,\ndata collection, continuous control, and experiment monitoring. Sinergym\nprovides a consistent interface for training and running controllers,\npredefined benchmarks, experiment visualization and replication support, and\ncomprehensive documentation in a ready-to-use software library. This paper 1)\nhighlights the main features of Sinergym in comparison to other existing\nframeworks, 2) describes its basic usage, and 3) demonstrates its applicability\nfor RL-based BEO through several representative examples. By integrating\nsimulation, data, and control, Sinergym supports the development of\nintelligent, data-driven applications for more efficient and responsive\nbuilding operations, aligning with the objectives of digital twin technology.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Systems and Control",
    "Electrical Engineering and Systems Science/Systems and Control"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "VGe1imh8D-_Ziahr0JSsDwP02DlcA1fsw_urtokpWWM",
  "pdfSize": "11132071"
}