{
  "id": "2412.17016",
  "title": "Probing the N\\'eel order in altermagnetic RuO2 films by X-ray magnetic\n  linear dichroism",
  "authors": "Yi-Chi Zhang, Hua Bai, Chong Chen, Lei Han, Shi-Xuan Liang, Rui-Yue\n  Chu, Jian-Kun Dai, Feng Pan, Cheng Song",
  "authorsParsed": [
    [
      "Zhang",
      "Yi-Chi",
      ""
    ],
    [
      "Bai",
      "Hua",
      ""
    ],
    [
      "Chen",
      "Chong",
      ""
    ],
    [
      "Han",
      "Lei",
      ""
    ],
    [
      "Liang",
      "Shi-Xuan",
      ""
    ],
    [
      "Chu",
      "Rui-Yue",
      ""
    ],
    [
      "Dai",
      "Jian-Kun",
      ""
    ],
    [
      "Pan",
      "Feng",
      ""
    ],
    [
      "Song",
      "Cheng",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 22 Dec 2024 13:37:45 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734874665000,
  "abstract": "  The emerging altermagnetic RuO2 with both compensated magnetic moments and\nbroken time-reversal symmetry possesses nontrivial magneto-electronic responses\nand nonrelativistic spin currents, which are closely related to magnetic easy\naxis. To probe the N\\'eel order in RuO2, we conducted Ru M3-edge X-ray magnetic\nlinear dichroism (XMLD) measurement. For epitaxial RuO2 films, characteristic\nXMLD signals can be observed in either RuO2(100) and RuO2(110) at normal\nincidence or RuO2(001) at oblique incidence, and the signals disappear when\ntest temperature exceeds N\\'eel temperature. For nonepitaxial RuO2 films, the\nflat lines in the XMLD patterns of RuO2(100) and RuO2(110) demonstrate that\nthere is no in-plane uniaxial alignment of N\\'eel order in these samples, due\nto the counterbalanced N\\'eel order of the twin crystals evidenced by X-ray\ndiffraction phi-scan measurements. Our experimental results unambiguously\ndemonstrate the antiferromagnetism in RuO2 films and reveal the spatial\nrelation of N\\'eel order to be parallel with RuO2 [001] crystalline axis. These\nresearch findings would deepen our understanding of RuO2 and other attractive\naltermagnetic materials applied in the field of spintronics.\n",
  "subjects": [
    "Condensed Matter/Materials Science"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "qrTQPbWANxnJWEWugOff_DeYxI_Hq0R18TrgWSMT1vk",
  "pdfSize": "1110365"
}