{
  "id": "2412.06132",
  "title": "Metasurface-enabled small-satellite polarisation imaging",
  "authors": "Sarah E. Dean, Josephine Munro, Neuton Li, Robert Sharp, Dragomir N.\n  Neshev, Andrey A. Sukhorukov",
  "authorsParsed": [
    [
      "Dean",
      "Sarah E.",
      ""
    ],
    [
      "Munro",
      "Josephine",
      ""
    ],
    [
      "Li",
      "Neuton",
      ""
    ],
    [
      "Sharp",
      "Robert",
      ""
    ],
    [
      "Neshev",
      "Dragomir N.",
      ""
    ],
    [
      "Sukhorukov",
      "Andrey A.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 01:27:14 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 10 Dec 2024 03:32:23 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733707634000,
  "abstract": "  Polarisation imaging is used to distinguish objects and surface\ncharacteristics that are otherwise not visible with black-and-white or colour\nimaging. Full-Stokes polarisation imaging allows complex image processing like\nwater glint filtering, which is particularly useful for remote Earth\nobservations. The relatively low cost of small-satellites makes their use in\nremote sensing more accessible. However, their size and weight limitations\ncannot accommodate the bulky conventional optics needed for full-Stokes\npolarisation imaging. We present the modelling of an ultra-thin\ntopology-optimised diffractive metasurface that encodes polarisation states in\nfive different diffraction orders. Positioning the metasurface in a telescope's\npupil plane allows the diffraction orders to be imaged onto a single detector,\nresulting in the capability to perform single-shot full-Stokes polarisation\nimaging of the Earth's surface. The five rectangular image swaths are designed\nto use the full width of the camera, and then each successive frame can be\nstitched together as the satellite moves over the Earth's surface, restoring\nthe full field of view achievable with any chosen camera without comprising the\non-ground resolution. Each set of four out of the five orders enables the\nreconstruction of the full polarisation state, and their simultaneous\nreconstructions allow for error monitoring. The lightweight design and compact\nfootprint of the polarisation imaging optical system achievable with a\nmetasurface is a novel approach to increase the functionality of small\nsatellites while working within their weight and volume constraints.\n",
  "subjects": [
    "Physics/Optics",
    "Astrophysics/Instrumentation and Methods for Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "aSZX238eTUv-jHwtOTkyNE8E-X5M9UHH17LWJtxdfJQ",
  "pdfSize": "19885363"
}