{
  "id": "2412.09052",
  "title": "Subspace tracking for online system identification",
  "authors": "Andr\\'as Sasfi, Alberto Padoan, Ivan Markovsky, Florian D\\\"orfler",
  "authorsParsed": [
    [
      "Sasfi",
      "András",
      ""
    ],
    [
      "Padoan",
      "Alberto",
      ""
    ],
    [
      "Markovsky",
      "Ivan",
      ""
    ],
    [
      "Dörfler",
      "Florian",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 08:22:36 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1733991756000,
  "abstract": "  This paper introduces an online approach for identifying time-varying\nsubspaces defined by linear dynamical systems, leveraging optimization on the\nGrassmannian manifold leading to the Grassmannian Recursive Algorithm for\nTracking (GREAT) method. The approach of representing linear systems by\nnon-parametric subspace models has received significant interest in the field\nof data-driven control recently. We view subspaces as points on the\nGrassmannian manifold, and therefore, tracking is achieved by performing\noptimization on the manifold. At each time step, a single measurement from the\ncurrent subspace corrupted by a bounded error is available. The subspace\nestimate is updated online using Grassmannian gradient descent on a cost\nfunction incorporating a window of the most recent data. Under suitable\nassumptions on the signal-to-noise ratio of the online data and the subspace's\nrate of change, we establish theoretical guarantees for the resulting\nalgorithm. More specifically, we prove an exponential convergence rate and\nprovide a consistent uncertainty quantification of the estimates in terms of an\nupper bound on their distance to the true subspace. The applicability of the\nproposed algorithm is demonstrated by means of numerical examples, and it is\nshown to compare favorably with competing parametric system identification\nmethods.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Systems and Control",
    "Computer Science/Systems and Control",
    "Mathematics/Optimization and Control"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "aEMGBHGUl9VAXPuS_WF_3uIh-txglwJQiqkMmSA57tw",
  "pdfSize": "404447"
}