{
  "id": "2412.02744",
  "title": "The Variable Sources in the Gaia archive",
  "authors": "Laurent Eyer",
  "authorsParsed": [
    [
      "Eyer",
      "Laurent",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 19:00:01 GMT"
    }
  ],
  "updateDate": "2024-12-05",
  "timestamp": 1733252401000,
  "abstract": "  At the core of the Gaia mission is a multi-epoch survey consisting of\nastrometric, photometric, spectrophotometric, and spectroscopic measurements.\nThe astrometric time series provides parallaxes and proper motions, along with\ninformation on astrometric binary systems. The photometric time series offers a\nmeans to investigate the variability of the sources. Due to their whole-sky,\nmulti-epoch nature, multiple instruments, their magnitude range covering 21\nmagnitudes, and their remarkable photometric precision, these data allow us to\ndescribe the variability of celestial phenomena in an unprecedented manner. For\nthe third Gaia Data Release (DR3), the data collection spanned 34 months, with\na median number of field-of-view measurements in the G band of about 44,\nreaching up to 270. At publication time, DR3 delivered the largest collection\nof variable sources with an associated classification across the entire sky.\nAll these sources have their $G$, $G_{BP}$, $G_{RP}$ epoch data published and\naccessible in the Gaia ESA archive. In summary, there are 10.5 million variable\nsources, including 9.5 million variable stars and 1 million QSOs. Additionally,\n2.5 million galaxies were identified thanks to spurious variability caused by\nthe non-axisymmetric nature of galaxies and the way Gaia collects data.\nMoreover, all the epoch data and time series of nearly 1.3 million sources in a\npencil beam around the Andromeda galaxy are published, regardless of their\nstatus (constant or variable); This dataset is known as the Gaia Andromeda\nPhotometric Survey. We also introduce the citizen science project, GaiaVari to\nclassify variable stars, the Focused Product Release delivered on October 10,\n2023. In the future, DR4 will cover 66 months, and we hope DR5 will have\naccumulated 10.5 years of data.\n",
  "subjects": [
    "Astrophysics/Instrumentation and Methods for Astrophysics",
    "Astrophysics/Astrophysics of Galaxies",
    "Astrophysics/Solar and Stellar Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "aEPYFk5peCNBrcgM50B8mjNpG3nznk2XOEzGD3DmBgg",
  "pdfSize": "1527507"
}