{"id":"2412.03081","title":"A new Time-decay Radiomics Integrated Network (TRINet) for short-term\n  breast cancer risk prediction","authors":"Hong Hui Yeoh, Fredrik Strand, Rapha\\\"el Phan, Kartini Rahmat, Maxine\n  Tan","authorsParsed":[["Yeoh","Hong Hui",""],["Strand","Fredrik",""],["Phan","Raphaël",""],["Rahmat","Kartini",""],["Tan","Maxine",""]],"versions":[{"version":"v1","created":"Wed, 4 Dec 2024 07:15:59 GMT"}],"updateDate":"2024-12-05","timestamp":1733296559000,"abstract":"  To facilitate early detection of breast cancer, there is a need to develop\nshort-term risk prediction schemes that can prescribe\npersonalized/individualized screening mammography regimens for women. In this\nstudy, we propose a new deep learning architecture called TRINet that\nimplements time-decay attention to focus on recent mammographic screenings, as\ncurrent models do not account for the relevance of newer images. We integrate\nradiomic features with an Attention-based Multiple Instance Learning (AMIL)\nframework to weigh and combine multiple views for better risk estimation. In\naddition, we introduce a continual learning approach with a new label\nassignment strategy based on bilateral asymmetry to make the model more\nadaptable to asymmetrical cancer indicators. Finally, we add a time-embedded\nadditive hazard layer to perform dynamic, multi-year risk forecasting based on\nindividualized screening intervals. We used two public datasets, namely 8,528\npatients from the American EMBED dataset and 8,723 patients from the Swedish\nCSAW dataset in our experiments. Evaluation results on the EMBED test set show\nthat our approach significantly outperforms state-of-the-art models, achieving\nAUC scores of 0.851, 0.811, 0.796, 0.793, and 0.789 across 1-, 2-, to 5-year\nintervals, respectively. Our results underscore the importance of integrating\ntemporal attention, radiomic features, time embeddings, bilateral asymmetry,\nand continual learning strategies, providing a more adaptive and precise tool\nfor short-term breast cancer risk prediction.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"1UYD6wJODQk3xx_1FaAS9sFUZM_HIdYy-fD2BFN9T3U","pdfSize":"1088137"}