{"id":"2412.14101","title":"Monolayer Capping Provides Close to Optimal Resistance to Laser\n  Dewetting of Au Films","authors":"Christopher P. Murray, Daniyar Mamyraimov, Mugahid Ali, Clive Downing,\n  Ian M. Povey, David McCloskey, David D. O'Regan, John F. Donegan","authorsParsed":[["Murray","Christopher P.",""],["Mamyraimov","Daniyar",""],["Ali","Mugahid",""],["Downing","Clive",""],["Povey","Ian M.",""],["McCloskey","David",""],["O'Regan","David D.",""],["Donegan","John F.",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 17:49:03 GMT"}],"updateDate":"2024-12-19","timestamp":1734544143000,"abstract":"  Next-generation heat-assisted magnetic recording (HAMR) relies on fast,\nlocalized heating of the magnetic medium during the write process. Au plasmonic\nnear-field transducers are an attractive solution to this challenge, but\nincreased thermal stability of Au films is required to improve long-term\nreliability. This work compares the effect of nanoscale Al, AlOx, and Ta\ncapping films on Au thin films with Ti or Ta adhesion layers for use in HAMR\nand other high-temperature plasmonic applications. Thermal stability is\ninvestigated using a bespoke laser dewetting system, and SEM and AFM are\nextensively used to interrogate the resulting dewet areas. The most effective\ncapping layers are found to be 0.5-1 nm of Al or AlOx, which can eliminate\ndewetting under certain conditions. Even one monolayer of AlOx is shown to be\nhighly effective in reducing dewetting. In the case of thicker capping layers\nof Ta and AlOx, the Au film can easily dewet underneath, leaving an intact\ncapping layer. It is concluded that thinner capping layers are most effective\nagainst dewetting as the Au cannot dewet without breaking them and pulling them\napart during the dewetting process. A simple model based on energetics\nconsiderations is developed, which explains how thinner capping layers can more\neffectively protect the metal from pore or fissure creation. The model provides\nsome convenient guidelines for choosing both the substrate and capping layer,\nfor a given metal, to maximize the resistance to laser-induced damage.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science","Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"SOkWHjuXP4LyKyPDvSiQGxIpnn3W0-9aarUgLTvzy8Y","pdfSize":"13112254"}