{"id":"2412.07362","title":"In-poor IGZO: superior resilience to hydrogen in forming gas anneal and\n  PBTI","authors":"A. Kruv, M. J. van Setten, A. Chasin, D. Matsubayashi, H. F. W.\n  Dekkers, A. Pavel, Y. Wan, K. Trivedi, N. Rassoul, J. Li, Y. Jiang, S.\n  Subhechha, G. Pourtois, A. Belmonte, and G. Sankar Kar","authorsParsed":[["Kruv","A.",""],["van Setten","M. J.",""],["Chasin","A.",""],["Matsubayashi","D.",""],["Dekkers","H. F. W.",""],["Pavel","A.",""],["Wan","Y.",""],["Trivedi","K.",""],["Rassoul","N.",""],["Li","J.",""],["Jiang","Y.",""],["Subhechha","S.",""],["Pourtois","G.",""],["Belmonte","A.",""],["Kar","G. Sankar",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 09:58:51 GMT"}],"updateDate":"2024-12-11","timestamp":1733824731000,"abstract":"  Integrating In-Ga-Zn-oxide (IGZO) channel transistors in silicon-based\necosystems requires the resilience of the channel material to hydrogen\ntreatment. Standard IGZO, containing 40% In (metal ratio) suffers from\ndegradation under forming gas anneal (FGA) and hydrogen (H) driven positive\nbias temperature instability (PBTI). We demonstrate scaled top-gated ALD\ntransistors with an In-poor (In $\\le$ 17%) IGZO channel that show superior\nresilience to hydrogen compared to the In-rich (In=40%) counterpart. The\ndevices, fabricated with a 300-mm FAB process with dimensions down to\n$W_\\mathrm{CH} \\times L_\\mathrm{TG} = 80 \\times 40 \\mathrm{nm}^2$, show\nexcellent stability in 2-hour 420$^\\circ$C forming gas anneal ($0.06 \\le \\left|\n\\Delta V_{\\mathrm{TH}} \\right| \\le 0.33\\mathrm{V}$) and improved resilience to\nH in PBTI at 125$^\\circ$C (down to no detectable H-induced $V_{\\mathrm{TH}}$\nshift) compared to In-rich devices. We demonstrate that the device degradation\nby H in the FGA is different from the H-induced VTH instability in PBTI, namely\noxygen scavenging by H and H release from a gate-dielectric into the channel,\nrespectively, and that resilience to H in one process does not automatically\ntranslate to resilience to H in the other one. This significant improvement in\nIGZO resilience to H enables the use of FGA treatments during fabrication\nneeded for silicon technology compatibility, as well as further scaling and 3D\nintegration, bringing IGZO-based technologies closer to mass production.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"BpIc9pVFH0IMPq-aNE38uNLrT3EJDaDSfTVneDnddn0","pdfSize":"1351745"}