{
  "id": "2412.10158",
  "title": "3D projection analysis: characterizing the morphological stability of\n  nearby open clusters",
  "authors": "Qingshun Hu, Songmei Qin, Yangping Luo, and Yuting Li",
  "authorsParsed": [
    [
      "Hu",
      "Qingshun",
      ""
    ],
    [
      "Qin",
      "Songmei",
      ""
    ],
    [
      "Luo",
      "Yangping",
      ""
    ],
    [
      "Li",
      "Yuting",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 14:19:58 GMT"
    }
  ],
  "updateDate": "2024-12-16",
  "timestamp": 1734099598000,
  "abstract": "  Context. The study of open cluster morphology is pivotal for exploring their\nformation and evolutionary processes. Aims. We manage to assess the\nmorphological stability of 105 nearby open clusters within tidal radii on the\nX-Y, X-Z, and Y-Z planes of the heliocentric Cartesian coordinate system,\nutilizing member catalogs from the literature. Meanwhile, we also delve into\nfactors potentially impacting the clusters' morphological stability on these\nprojection planes. Methods. We used the rose diagram method by constructing the\n3D projected morphology of sample clusters to quantify the morphological\nstability of their 3D projected morphology. Results. Our analysis indicates\nthere is a demonstrated linear positive correlation between the number of\nsample clusters' member stars within tidal radii and their morphological\nstability in different 3D projection planes. This may suggest that the more\nmember stars there are within the tidal radius of a cluster, the stronger its\nown gravitational binding capacity is, resulting in strong morphological\nstability. We find a direct link between the clusters' morphological\nstabilities in the X-Z plane within tidal radii and their velocity dispersion\nin the same plane, suggesting that the morphological stabilities in the X-Z\nplane may be dependent on internal dynamics. Moreover, the morphological\nstability of the clusters' 3D projection is influenced by their spatial\npositions along the Y axis, but not linearly, indicating that the environmental\nchanges at the clusters' location may affect their morphological stability.\nLikewise, specific external forces can have an effect on their morphological\nstability. Conclusions. This research introduces a novel perspective for\nunderstanding the morphological stability of open clusters, with a particular\nfocus on their 3D projected morphologies.\n",
  "subjects": [
    "Astrophysics/Astrophysics of Galaxies",
    "Astrophysics/Solar and Stellar Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "s5HABK3AvWD65g086lSa35Gkvu-YjmE1Xeeq8q6kPWM",
  "pdfSize": "3732196"
}