{"id":"2412.03050","title":"Topology Reconstruction of a Class of Electrical Networks with Limited\n  Boundary Measurements","authors":"Shivanagouda Biradar and Deepak U Patil","authorsParsed":[["Biradar","Shivanagouda",""],["Patil","Deepak U",""]],"versions":[{"version":"v1","created":"Wed, 4 Dec 2024 06:09:15 GMT"}],"updateDate":"2024-12-05","timestamp":1733292555000,"abstract":"  We consider the problem of recovering the topology and the edge conductance\nvalue, as well as characterizing a set of electrical networks that satisfy the\nlimitedly available Thevenin impedance measurements. The measurements are\nobtained from an unknown electrical network, which is assumed to belong to a\nclass of circular planar passive electrical network. This class of electrical\nnetworks consists of R, RL, and RC networks whose edge impedance values are\nequal, and the absolute value of the real and the imaginary part of the edge\nimpedances are also equal. To solve the topology reconstruction and the set\ncharacterization problem, we establish a simple relation between Thevenin\nimpedance and the Laplacian matrix and leverage this relation to get a system\nof multivariate polynomial equations, whose solution is a set of all electrical\nnetworks satisfying the limited available Thevenin's impedance measurements. To\nconfine the search space and generate valid electrical networks, we impose the\ntriangle and Kalmanson's inequality as constraints. The solution to a\nconstrained system of multivariate polynomial equations is a set of\nreconstructed valid electrical networks. For simple algorithmic solutions, we\nuse Gr\\\"obner basis polynomials. This paper shows that the triangle and the\nKalmanson's inequality holds for general circular planar passive R, RL, and RC\nelectrical networks if certain boundary conditions lie within a convex cone.\nNumerical examples illustrate the developed topology reconstruction method.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computer Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"4Wp23unArAvimVzFZH8rMxWdE1N6tq8qXro4XKM746w","pdfSize":"4336594"}