{"id":"2412.15770","title":"Influence of a continuous plane gravitational wave on Gaia-like\n  astrometry","authors":"R. Geyer, S. A. Klioner, L. Lindegren, U. Lammers","authorsParsed":[["Geyer","R.",""],["Klioner","S. A.",""],["Lindegren","L.",""],["Lammers","U.",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 10:41:27 GMT"},{"version":"v2","created":"Thu, 6 Feb 2025 09:06:13 GMT"}],"updateDate":"2025-02-07","timestamp":1734691287000,"abstract":"  A gravitational wave (GW) passing through an astrometric observer causes\nperiodic shifts of the apparent star positions measured by the observer. For a\nGW of sufficient amplitude and duration, and of suitable frequency, these\nshifts might be detected with a Gaia-like astrometric telescope. This paper\naims to analyse in detail the effects of GWs on an astrometric solution based\non Gaia-like observations, which are one-dimensional, strictly differential\nbetween two widely separated fields of view and following a prescribed scanning\nlaw. We present a simple geometric model for the astrometric effects of a plane\nGW in terms of the time-dependent positional shifts. Using this model, the\ngeneral interaction between the GW and a Gaia-like observation is discussed.\nNumerous Gaia-like astrometric solutions are made, taking as input simulated\nobservations that include the effects of a continuous plain GW with constant\nparameters and periods ranging from ~50 days to 100 years. The resulting\nsolutions are analysed in terms of the systematic errors on astrometric and\nattitude parameters, as well as the observational residuals. It is found that a\nsignificant part of the GW signal is absorbed by the astrometric parameters,\nleading to astrometric errors of a magnitude (in radians) comparable to the\nstrain parameters. These astrometric errors are in general not possible to\ndetect, because the true (unperturbed) astrometric parameters are not known to\ncorresponding accuracy. The astrometric errors are especially large for\nspecific GW frequencies that are linear combinations of two characteristic\nfrequencies of the scanning law. Nevertheless, for all GW periods smaller than\nthe time span covered by the observations, significant parts of the GW signal\nalso go into the astrometric residuals. This fosters the hope for a GW\ndetection algorithm based on the residuals of standard astrometric solutions.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"-IBHVj43Fo8v0HVK0zkKhEolJyKsu5tYdqnN4U9g6iI","pdfSize":"30617312"}