{"id":"2412.21119","title":"Eigenstructure Analysis of Bloch Wave and Multislice Matrix Formulations\n  for Dynamical Scattering in Transmission Electron Microscopy","authors":"Arya Bangun, Oleh Melnyk, Benjamin M\\\"arz","authorsParsed":[["Bangun","Arya",""],["Melnyk","Oleh",""],["März","Benjamin",""]],"versions":[{"version":"v1","created":"Mon, 30 Dec 2024 17:45:41 GMT"}],"updateDate":"2024-12-31","timestamp":1735580741000,"abstract":"  We investigate the eigenstructure of matrix formulations used for modeling\nscattering processes in materials by transmission electron microscopy (TEM).\nConsidering dynamical scattering is fundamental in describing the interaction\nbetween an electron wave and the material under investigation. In TEM, both the\nBloch wave formulation and the multislice method are commonly employed to model\nthe scattering process, but comparing these models directly is challenging.\nUnlike the Bloch wave formulation, which represents the transmission function\nin terms of the scattering matrix, the traditional multislice method does not\nhave a pure transmission function due to the entanglement between electron\nwaves and the propagation function within the crystal. To address this, we\npropose a reformulation of the multislice method into a matrix framework, which\nwe refer to as transmission matrix. This enables a direct comparison to the\nwell-known scattering matrix, derived from the Bloch wave formulation, and\nanalysis of their eigenstructures. We show theoretically that both matrices are\nequal, under the condition that the angles of the eigenvalues differ no more\nthan modulo $2\\pi n$ for integer $n$, and the eigenvectors of the transmission\nand scattering matrix are related in terms of a two-dimensional Fourier matrix.\nThe characterization of both matrices in terms of physical parameters, such as\ntotal projected potentials, is also discussed, and we perform numerical\nsimulations to validate our theoretical findings. Finally, we show that the\ndeterminant of the transmission matrix can be used to estimate the mean inner\npotential.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics","Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"GVxaxfPWYUl4loLjcj7X5STZV7prcUVDHMbFP0H8msI","pdfSize":"5756395"}