{
  "id": "2412.01077",
  "title": "A Memory-Based Reinforcement Learning Approach to Integrated Sensing and\n  Communication",
  "authors": "Homa Nikbakht, Mich\\`ele Wigger, Shlomo Shamai (Shitz), and H. Vincent\n  Poor",
  "authorsParsed": [
    [
      "Nikbakht",
      "Homa",
      "",
      "Shitz"
    ],
    [
      "Wigger",
      "Michèle",
      "",
      "Shitz"
    ],
    [
      "Shamai",
      "Shlomo",
      "",
      "Shitz"
    ],
    [
      "Poor",
      "H. Vincent",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 03:30:50 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733110250000,
  "abstract": "  In this paper, we consider a point-to-point integrated sensing and\ncommunication (ISAC) system, where a transmitter conveys a message to a\nreceiver over a channel with memory and simultaneously estimates the state of\nthe channel through the backscattered signals from the emitted waveform. Using\nMassey's concept of directed information for channels with memory, we formulate\nthe capacity-distortion tradeoff for the ISAC problem when sensing is performed\nin an online fashion. Optimizing the transmit waveform for this system to\nsimultaneously achieve good communication and sensing performance is a\ncomplicated task, and thus we propose a deep reinforcement learning (RL)\napproach to find a solution. The proposed approach enables the agent to\noptimize the ISAC performance by learning a reward that reflects the difference\nbetween the communication gain and the sensing loss. Since the state-space in\nour RL model is \\`a priori unbounded, we employ deep deterministic policy\ngradient algorithm (DDPG). Our numerical results suggest a significant\nperformance improvement when one considers unbounded state-space as opposed to\na simpler RL problem with reduced state-space. In the extreme case of\ndegenerate state-space only memoryless signaling strategies are possible. Our\nresults thus emphasize the necessity of well exploiting the memory inherent in\nISAC systems.\n",
  "subjects": [
    "Computer Science/Information Theory",
    "Computer Science/Machine Learning",
    "Mathematics/Information Theory"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "mqcK6-UE2rhJjhdRA25nrzzbgr7DzOCgOp-oGiFIVZM",
  "pdfSize": "494185"
}