{
  "id": "2412.06687",
  "title": "Test Beam Characterization of a Digital Silicon Photomultiplier",
  "authors": "Finn King, Inge Diehl, Ono Feyens, Ingrid-Maria Gregor, Karsten\n  Hansen, Stephan Lachnit, Frauke Poblotzki, Daniil Rastorguev, Simon\n  Spannagel, Tomas Vanat, Gianpiero Vignola",
  "authorsParsed": [
    [
      "King",
      "Finn",
      ""
    ],
    [
      "Diehl",
      "Inge",
      ""
    ],
    [
      "Feyens",
      "Ono",
      ""
    ],
    [
      "Gregor",
      "Ingrid-Maria",
      ""
    ],
    [
      "Hansen",
      "Karsten",
      ""
    ],
    [
      "Lachnit",
      "Stephan",
      ""
    ],
    [
      "Poblotzki",
      "Frauke",
      ""
    ],
    [
      "Rastorguev",
      "Daniil",
      ""
    ],
    [
      "Spannagel",
      "Simon",
      ""
    ],
    [
      "Vanat",
      "Tomas",
      ""
    ],
    [
      "Vignola",
      "Gianpiero",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 17:29:56 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733765396000,
  "abstract": "  Conventional silicon photomultipliers (SiPMs) are well established as light\ndetectors with single-photon-detection capability and used throughout high\nenergy physics, medical, and commercial applications. The possibility to\nproduce single photon avalanche diodes (SPADs) in commercial CMOS processes\ncreates the opportunity to combine a matrix of SPADs and an\napplication-specific integrated circuit in the same die. The potential of such\ndigital SiPMs (dSiPMs) is still being explored, while it already is an\nestablished technology in certain applications, like light detection and\nranging (LiDAR).\n  A prototype dSiPM, produced in the LFoundry 150-nm CMOS technology, was\ndesigned and tested at DESY. The dSiPM central part is a matrix of 32 by 32\npixels. Each pixel contains four SPADs, a digital front-end, and has an area of\n69.6 $\\times$ 76 um$^2$. The chip has four time-to-digital converters and\nincludes further circuitry for data serialization and data links.\n  This work focuses on the characterization of the prototype in an electron\nbeam at the DESY II Test Beam facility, to study its capability as a tracking\nand timing detector for minimum ionizing particles (MIPs). The MIP detection\nefficiency is found to be dominated by the fill factor and on the order of 31\n%. The position of the impinging MIPs can be measured with a precision of about\n20 um, and the time of the interaction can be measured with a precision better\nthan 50 ps for about 85 % of the detected events. In addition, laboratory\nstudies on the breakdown voltage, dark count rate, and crosstalk probability,\nas well as the experimental methods required for the characterization of such a\nsensor type in a particle beam are presented.\n",
  "subjects": [
    "Physics/Instrumentation and Detectors"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "O9d-_iJZ_XySzXkmDsJZ_rhwzF3-tcMSLv67yNx0ZKE",
  "pdfSize": "7562993"
}