{"id":"2412.02052","title":"FoveaSPAD: Exploiting Depth Priors for Adaptive and Efficient\n  Single-Photon 3D Imaging","authors":"Justin Folden, Atul Ingle, Sanjeev J. Koppal","authorsParsed":[["Folden","Justin",""],["Ingle","Atul",""],["Koppal","Sanjeev J.",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 00:20:01 GMT"}],"updateDate":"2024-12-04","timestamp":1733185201000,"abstract":"  Fast, efficient, and accurate depth-sensing is important for safety-critical\napplications such as autonomous vehicles. Direct time-of-flight LiDAR has the\npotential to fulfill these demands, thanks to its ability to provide\nhigh-precision depth measurements at long standoff distances. While\nconventional LiDAR relies on avalanche photodiodes (APDs), single-photon\navalanche diodes (SPADs) are an emerging image-sensing technology that offer\nmany advantages such as extreme sensitivity and time resolution. In this paper,\nwe remove the key challenges to widespread adoption of SPAD-based LiDARs: their\nsusceptibility to ambient light and the large amount of raw photon data that\nmust be processed to obtain in-pixel depth estimates. We propose new algorithms\nand sensing policies that improve signal-to-noise ratio (SNR) and increase\ncomputing and memory efficiency for SPAD-based LiDARs. During capture, we use\nexternal signals to \\emph{foveate}, i.e., guide how the SPAD system estimates\nscene depths. This foveated approach allows our method to ``zoom into'' the\nsignal of interest, reducing the amount of raw photon data that needs to be\nstored and transferred from the SPAD sensor, while also improving resilience to\nambient light. We show results both in simulation and also with real hardware\nemulation, with specific implementations achieving a 1548-fold reduction in\nmemory usage, and our algorithms can be applied to newly available and future\nSPAD arrays.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Uye1E3KaBsYEICPO-4kDZhJtDcEbzMZ5AdUupNY34yI","pdfSize":"36158400"}