{
  "id": "2412.07335",
  "title": "Fast Online $L_0$ Elastic Net Subspace Clustering via A Novel Dictionary\n  Update Strategy",
  "authors": "Wentao Qu, Lingchen Kong, Linglong Kong, Bei Jiang",
  "authorsParsed": [
    [
      "Qu",
      "Wentao",
      ""
    ],
    [
      "Kong",
      "Lingchen",
      ""
    ],
    [
      "Kong",
      "Linglong",
      ""
    ],
    [
      "Jiang",
      "Bei",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 09:26:34 GMT"
    },
    {
      "version": "v2",
      "created": "Thu, 12 Dec 2024 12:17:29 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1733822794000,
  "abstract": "  With the rapid growth of data volume and the increasing demand for real-time\nanalysis, online subspace clustering has emerged as an effective tool for\nprocessing dynamic data streams. However, existing online subspace clustering\nmethods often struggle to capture the complex and evolving distribution of such\ndata due to their reliance on rigid dictionary learning mechanisms. In this\npaper, we propose a novel $\\ell_0$ elastic net subspace clustering model by\nintegrating the $\\ell_0$ norm and the Frobenius norm, which owns the desirable\nblock diagonal property. To address the challenges posed by the evolving data\ndistributions in online data, we design a fast online alternating direction\nmethod of multipliers with an innovative dictionary update strategy based on\nsupport points, which are a set of data points to capture the underlying\ndistribution of the data. By selectively updating dictionary atoms according to\nthe support points, the proposed method can dynamically adapt to the evolving\ndata characteristics, thereby enhancing both adaptability and computational\nefficiency. Moreover, we rigorously prove the convergence of the algorithm.\nFinally, extensive numerical experiments demonstrate that the proposed method\nimproves clustering performance and computational efficiency, making it\nwell-suited for real-time and large-scale data processing tasks.\n",
  "subjects": [
    "Mathematics/Optimization and Control"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "T2vf6f2pElkGW3q896uHDrQ-FdRu1giMuJGZxXvaONY",
  "pdfSize": "946509"
}