{"id":"2412.05140","title":"The reliability of gas-phase metallicities immediately adjacent to\n  non-star-forming spaxels in MaNGA","authors":"Jillian M. Scudder, Aidan Khelil, Jonah Z. Ordower","authorsParsed":[["Scudder","Jillian M.",""],["Khelil","Aidan",""],["Ordower","Jonah Z.",""]],"versions":[{"version":"v1","created":"Fri, 6 Dec 2024 15:58:15 GMT"}],"updateDate":"2024-12-09","timestamp":1733500695000,"abstract":"  In this work, we use gas phase metallicities calculated from the Sloan\nDigital Sky Survey (SDSS) Mapping Nearby Galaxies at Apache Point (MaNGA) Data\nRelease 17 (DR17) to assess the extent of potential biases in spaxels which are\nspatially adjacent to spaxels identified as non-star forming (non-SF) on a BPT\ndiagram. We identify a sample of $\\sim21,000$ such spaxels with calculable\nmetallicities from the full metallicity catalogue ($\\sim$1.57 million),\nrepresenting a small fraction ($\\sim1.3$ per cent) of the full metallicity\nsample. $\\sim$23 per cent of all galaxies with at least one spaxel with a\ncalculable metallicity also contain at least one spaxel with a calculated\nmetallicity adjacent to a non-SF spaxel, with a typical galaxy hosting 9\nnon-SF-adjacent spaxels. From our suite of 6 different metallicity\ncalibrations, we find that only the metallicity calibrations based entirely on\nthe [NII]$_{6584}$/H$\\alpha$ ratio are affected, showing systematic offsets to\nhigher metallicities by up to $\\sim$0.04 dex if they are located adjacent to a\nnon-SF flagged spaxel, relative to a radially matched control sample. The\ninclusion of additional diagnostic diagrams (based on [OI]$_{6300}$~\\&/or\n[SII]$_{6717+6731}$) is insufficient to remove the observed offset in the\n[NII]$_{6584}$/H$\\alpha$ based calibrations. Using a stricter diagnostic line\non the BPT diagram removes $\\sim$94 per cent of identified bordering spaxels\nwith metallicities for all metallicity calibrations, and removes the residual\noffset to higher metallicity values seen in [NII]$_{6584}$/H$\\alpha$\ncalibrations. If science cases demand an exceptionally clean metallicity\nsample, we recommend either a stricter BPT cut, and/or a\nnon-[NII]$_{6584}$/H$\\alpha$ based metallicity calibration.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"LdkHZY2u4shilvfRiP8V23Xm7mih0FVN2JMY9YVTgDE","pdfSize":"1154926"}