{"id":"2412.03438","title":"The relation of galaxies and dark matter haloes to the filamentary\n  cosmic web","authors":"Navdha, Philipp Busch, Simon D. M. White","authorsParsed":[["Navdha","",""],["Busch","Philipp",""],["White","Simon D. M.",""]],"versions":[{"version":"v1","created":"Wed, 4 Dec 2024 16:29:02 GMT"}],"updateDate":"2024-12-05","timestamp":1733329742000,"abstract":"  We use the Millennium Simulation to study the relation of galaxies and dark\nmatter haloes to the cosmic web. We define the web as the unique, fully\nconnected, percolating object with (unsmoothed) matter density everywhere\nexceeding 5.25 times the cosmic mean. This object contains 35\\% of all cosmic\nmass but occupies only 0.62\\% of all cosmic volume. It contains 26\\% of dark\nmatter haloes of mass $10^{11}M_\\odot$, rising to 50\\% at $10^{12.7}M_\\odot$,\nand to $>90\\%$ above $10^{14}M_\\odot$. In contrast, it contains 45\\% of all\ngalaxies of stellar mass $10^{8.5}M_\\odot$, rising to 50\\% at $10^{10}M_\\odot$,\nto 60\\% at $10^{11}M_\\odot$ and to 90\\% at $10^{11.5}M_\\odot$. This difference\narises because a large fraction of all satellite and backsplash galaxies are\npart of the cosmic web. Indeed, more than 50\\% of web galaxies are satellites\nfor stellar masses below that of the Milky Way, rising to about 70\\% below\n$10^{10}M_\\odot$, whereas centrals substantially outnumber satellites in the\nnon-web population at all stellar masses. As a result, web galaxies have\nsystematically lower specific star-formation rates (sSFR's) than non-web\ngalaxies. For the latter, the distributions of stellar mass and sSFR are almost\nindependent of web distance. Furthermore, for both central and satellite\ngalaxies, the sSFR distributions at given stellar mass are identical in and\noutside the web, once differences in backsplash fraction are accounted for. For\nthe galaxy formation model considered here, differences between web and non-web\ngalaxy populations are almost entirely due to the difference in halo mass\ndistribution between the two environments.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"3lLqvcQG5UK00is56a1s4cOuYHlzu8cUmDxGkE4thY0","pdfSize":"8068248"}