{"id":"2412.15270","title":"Baichuan4-Finance Technical Report","authors":"Hanyu Zhang, Boyu Qiu, Yuhao Feng, Shuqi Li, Qian Ma, Xiyuan Zhang,\n  Qiang Ju, Dong Yan, Jian Xie","authorsParsed":[["Zhang","Hanyu",""],["Qiu","Boyu",""],["Feng","Yuhao",""],["Li","Shuqi",""],["Ma","Qian",""],["Zhang","Xiyuan",""],["Ju","Qiang",""],["Yan","Dong",""],["Xie","Jian",""]],"versions":[{"version":"v1","created":"Tue, 17 Dec 2024 08:05:32 GMT"},{"version":"v2","created":"Thu, 2 Jan 2025 11:21:38 GMT"}],"updateDate":"2025-01-03","timestamp":1734422732000,"abstract":"  Large language models (LLMs) have demonstrated strong capabilities in\nlanguage understanding, generation, and reasoning, yet their potential in\nfinance remains underexplored due to the complexity and specialization of\nfinancial knowledge. In this work, we report the development of the\nBaichuan4-Finance series, including a comprehensive suite of foundational\nBaichuan4-Finance-Base and an aligned language model Baichuan4-Finance, which\nare built upon Baichuan4-Turbo base model and tailored for finance domain.\nFirstly, we have dedicated significant effort to building a detailed pipeline\nfor improving data quality. Moreover, in the continual pre-training phase, we\npropose a novel domain self-constraint training strategy, which enables\nBaichuan4-Finance-Base to acquire financial knowledge without losing general\ncapabilities. After Supervised Fine-tuning and Reinforcement Learning from\nHuman Feedback and AI Feedback, the chat model Baichuan4-Finance is able to\ntackle various financial certification questions and real-world scenario\napplications. We evaluate Baichuan4-Finance on many widely used general\ndatasets and two holistic financial benchmarks. The evaluation results show\nthat Baichuan4-Finance-Base surpasses almost all competitive baselines on\nfinancial tasks by significant margins without sacrificing performance on\ngeneral LLM benchmarks. At the same time, Baichuan4-Finance demonstrates even\nmore impressive performance on financial application scenarios, showcasing its\npotential to foster community innovation in the financial LLM field.\n","subjects":["Computer Science/Computation and Language","Computer Science/Artificial Intelligence","Computer Science/Computational Engineering, Finance, and Science","Computer Science/Computers and Society","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"FiYoj8iwLMy4UJ2NUmguAQZVVLrT4Bv_f3T0yDPq3e4","pdfSize":"3489096"}