{"id":"2412.02332","title":"SimuScope: Realistic Endoscopic Synthetic Dataset Generation through\n  Surgical Simulation and Diffusion Models","authors":"Sabina Martyniak, Joanna Kaleta, Diego Dall'Alba, Micha{\\l}\n  Naskr\\k{e}t, Szymon P{\\l}otka, Przemys{\\l}aw Korzeniowski","authorsParsed":[["Martyniak","Sabina",""],["Kaleta","Joanna",""],["Dall'Alba","Diego",""],["Naskręt","Michał",""],["Płotka","Szymon",""],["Korzeniowski","Przemysław",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 09:49:43 GMT"}],"updateDate":"2024-12-04","timestamp":1733219383000,"abstract":"  Computer-assisted surgical (CAS) systems enhance surgical execution and\noutcomes by providing advanced support to surgeons. These systems often rely on\ndeep learning models trained on complex, challenging-to-annotate data. While\nsynthetic data generation can address these challenges, enhancing the realism\nof such data is crucial. This work introduces a multi-stage pipeline for\ngenerating realistic synthetic data, featuring a fully-fledged surgical\nsimulator that automatically produces all necessary annotations for modern CAS\nsystems. This simulator generates a wide set of annotations that surpass those\navailable in public synthetic datasets. Additionally, it offers a more complex\nand realistic simulation of surgical interactions, including the dynamics\nbetween surgical instruments and deformable anatomical environments,\noutperforming existing approaches. To further bridge the visual gap between\nsynthetic and real data, we propose a lightweight and flexible image-to-image\ntranslation method based on Stable Diffusion (SD) and Low-Rank Adaptation\n(LoRA). This method leverages a limited amount of annotated data, enables\nefficient training, and maintains the integrity of annotations generated by our\nsimulator. The proposed pipeline is experimentally validated and can translate\nsynthetic images into images with real-world characteristics, which can\ngeneralize to real-world context, thereby improving both training and CAS\nguidance. The code and the dataset are available at\nhttps://github.com/SanoScience/SimuScope.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"f3gpaK7SlzK1eLDfUkgvaoXdZ9XsP5ESfDyFq7TdiGY","pdfSize":"54723267"}