{"id":"2412.18485","title":"Persuasion and Phishing: Analysing the Interplay of Persuasion Tactics\n  in Cyber Threats","authors":"Kalam Khadka","authorsParsed":[["Khadka","Kalam",""]],"versions":[{"version":"v1","created":"Tue, 24 Dec 2024 15:17:44 GMT"}],"updateDate":"2024-12-25","timestamp":1735053464000,"abstract":"  This study extends the research of Ferreira and Teles (2019), who synthesized\nworks by Cialdini (2007), Gragg (2003), and Stajano and Wilson (2011) to\npropose a unique list of persuasion principles in social engineering. While\nFerreira and Teles focused on email subject lines, this research analyzed\nentire email contents to identify principles of human persuasion in phishing\nemails. This study also examined the goals and targets of phishing emails,\nproviding a novel contribution to the field. Applying these findings to the\nontological model by Mouton et al. (2014) reveals that when social engineers\nuse email for phishing, individuals are the primary targets. The goals are\ntypically unauthorized access, followed by financial gain and service\ndisruption, with Distraction as the most commonly used compliance principle.\nThis research highlights the importance of understanding human persuasion in\ntechnology-mediated interactions to develop methods for detecting and\npreventing phishing emails before they reach users. Despite previous\nidentification of luring elements in phishing emails, empirical findings have\nbeen inconsistent. For example, Akbar (2014) found 'authority' and 'scarcity'\nmost common, while Ferreira et al. (2015) identified 'liking' and 'similarity.'\nIn this study, 'Distraction' was most frequently used, followed by 'Deception,'\n'Integrity,' and 'Authority.' This paper offers additional insights into\nphishing email tactics and suggests future solutions should leverage\nsocio-technical principles. Future work will apply this methodology to other\nsocial engineering techniques beyond phishing emails, using the ontological\nmodel to further inform the research community.\n","subjects":["Computer Science/Cryptography and Security","Computer Science/Computers and Society","Computer Science/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"hyf8iMrI59W4rUg5NrX3mWDG4io2a0r2KAqr6ndkr28","pdfSize":"466722"}