{
  "id": "2412.05412",
  "title": "Using Fitts' Law to Benchmark Assisted Human-Robot Performance",
  "authors": "Jiahe Pan, Jonathan Eden, Denny Oetomo, Wafa Johal",
  "authorsParsed": [
    [
      "Pan",
      "Jiahe",
      ""
    ],
    [
      "Eden",
      "Jonathan",
      ""
    ],
    [
      "Oetomo",
      "Denny",
      ""
    ],
    [
      "Johal",
      "Wafa",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 20:44:42 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733517882000,
  "abstract": "  Shared control systems aim to combine human and robot abilities to improve\ntask performance. However, achieving optimal performance requires that the\nrobot's level of assistance adjusts the operator's cognitive workload in\nresponse to the task difficulty. Understanding and dynamically adjusting this\nbalance is crucial to maximizing efficiency and user satisfaction. In this\npaper, we propose a novel benchmarking method for shared control systems based\non Fitts' Law to formally parameterize the difficulty level of a\ntarget-reaching task. With this we systematically quantify and model the effect\nof task difficulty (i.e. size and distance of target) and robot autonomy on\ntask performance and operators' cognitive load and trust levels. Our empirical\nresults (N=24) not only show that both task difficulty and robot autonomy\ninfluence task performance, but also that the performance can be modelled using\nthese parameters, which may allow for the generalization of this relationship\nacross more diverse setups. We also found that the users' perceived cognitive\nload and trust were influenced by these factors. Given the challenges in\ndirectly measuring cognitive load in real-time, our adapted Fitts' model\npresents a potential alternative approach to estimate cognitive load through\ndetermining the difficulty level of the task, with the assumption that greater\ntask difficulty results in higher cognitive load levels. We hope that these\ninsights and our proposed framework inspire future works to further investigate\nthe generalizability of the method, ultimately enabling the benchmarking and\nsystematic assessment of shared control quality and user impact, which will aid\nin the development of more effective and adaptable systems.\n",
  "subjects": [
    "Computer Science/Robotics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Mbb-3PtquTQ_sZesOxct3ZEzOuzCxY129ZXwzk1dYeI",
  "pdfSize": "1544599"
}