{"id":"2412.06011","title":"TopoCellGen: Generating Histopathology Cell Topology with a Diffusion\n  Model","authors":"Meilong Xu, Saumya Gupta, Xiaoling Hu, Chen Li, Shahira Abousamra,\n  Dimitris Samaras, Prateek Prasanna, Chao Chen","authorsParsed":[["Xu","Meilong",""],["Gupta","Saumya",""],["Hu","Xiaoling",""],["Li","Chen",""],["Abousamra","Shahira",""],["Samaras","Dimitris",""],["Prasanna","Prateek",""],["Chen","Chao",""]],"versions":[{"version":"v1","created":"Sun, 8 Dec 2024 18:02:22 GMT"}],"updateDate":"2024-12-10","timestamp":1733680942000,"abstract":"  Accurately modeling multi-class cell topology is crucial in digital\npathology, as it provides critical insights into tissue structure and\npathology. The synthetic generation of cell topology enables realistic\nsimulations of complex tissue environments, enhances downstream tasks by\naugmenting training data, aligns more closely with pathologists' domain\nknowledge, and offers new opportunities for controlling and generalizing the\ntumor microenvironment. In this paper, we propose a novel approach that\nintegrates topological constraints into a diffusion model to improve the\ngeneration of realistic, contextually accurate cell topologies. Our method\nrefines the simulation of cell distributions and interactions, increasing the\nprecision and interpretability of results in downstream tasks such as cell\ndetection and classification. To assess the topological fidelity of generated\nlayouts, we introduce a new metric, Topological Frechet Distance (TopoFD),\nwhich overcomes the limitations of traditional metrics like FID in evaluating\ntopological structure. Experimental results demonstrate the effectiveness of\nour approach in generating multi-class cell layouts that capture intricate\ntopological relationships.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"pf6cjv6RnJ-0F3MyJTiT1v-XR2U4G0iKXOuZa_uHT74","pdfSize":"29551411"}