{
  "id": "2412.06977",
  "title": "Implementing a Quantum Finite Automaton in IBMQ using Custom Control\n  Pulses",
  "authors": "Eduardo Willwock Lussi and Lucas Cavalcante de Sousa and Jerusa Marchi\n  and Rafael de Santiago and Eduardo Inacio Duzzioni",
  "authorsParsed": [
    [
      "Lussi",
      "Eduardo Willwock",
      ""
    ],
    [
      "de Sousa",
      "Lucas Cavalcante",
      ""
    ],
    [
      "Marchi",
      "Jerusa",
      ""
    ],
    [
      "de Santiago",
      "Rafael",
      ""
    ],
    [
      "Duzzioni",
      "Eduardo Inacio",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 20:36:22 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733776582000,
  "abstract": "  Quantum finite automata can be used for pattern recognition. Present\nimplementations on actual quantum devices face decoherence issues, which\ncompromise the quality of long strings computation. In this work, we focus on\nthe Measure Once 1-way Quantum Finite Automata (MO1QFA) model for addressing\nthe MOD^p problem, investigating how quantum errors may affect the quality of\nthe computation in this model when implemented in IBM-Q superconducting\nenvironment. To improve the performance of the implementation, we use\npulse-level programming for calibrating a fast single-qubit gate designed\nspecifically for the automaton implementation. The demonstrations conducted on\nthe Jakarta quantum computer show that using custom pulses significantly\nreduces errors during extended word computations. While realizing improvements\nin error variations and predictability -- with a fourfold reduction in circuit\nlatency -- the proposed solution demonstrates a substantial increase in the\nsupported computation length of the automaton. When considering thresholds of\n10% and 20% in absolute errors of acceptance probabilities, the solution has\nthe potential to increase the maximum word length by 12 and 7+ times,\nrespectively, compared to the default Qiskit gate.\n",
  "subjects": [
    "Physics/Quantum Physics",
    "Computer Science/Formal Languages and Automata Theory"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "Dnus1Fx21n6d-gNYKWVqU_G59Ha6xs_iyNVkvf7CrB4",
  "pdfSize": "1439102"
}