{
  "id": "2412.01448",
  "title": "Mass inflation and strong cosmic censorship conjecture in covariant\n  quantum gravity black hole",
  "authors": "Jianhui Lin, Xiangdong Zhang, Mois\\'es Bravo-Gaete",
  "authorsParsed": [
    [
      "Lin",
      "Jianhui",
      ""
    ],
    [
      "Zhang",
      "Xiangdong",
      ""
    ],
    [
      "Bravo-Gaete",
      "Moisés",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 12:37:29 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733143049000,
  "abstract": "  Recently, a solution to the long-standing issue of general covariance in\ncanonical quantum gravity has been proposed, leading to the proposal of two\nblack hole solutions. From the above, a fundamental question arises: which\nsolution is superior? Note that one of the solutions possesses a Cauchy\nhorizon. Considering this quantum black hole solution with a Cauchy horizon, in\nthe present letter, we explore whether it exhibits properties similar to those\nof the Reissner-Nordstr\\\"{o}m black hole. Given its geometric similarity, by\napplying the generalized Dray-'t Hooft-Redmond relation, we find evidence of\nmass inflation and divergence in scalar curvature, indicating that the Cauchy\nhorizon is unstable. While this is consistent with the Strong Cosmic Censorship\nConjecture, it suggests that it does not represent a regular black hole.\nFurthermore, we extend the metric to include a cosmological constant and study\nthe validity of Strong Cosmic Censorship conjecture for the quantum black hole\nin de Sitter spacetime. The results indicate that the presence of a\ncosmological constant cannot prevent the violation of the conjecture when the\nquantum black hole approaches its extreme limit. These reasons suggest that the\nother black hole solution, which does not have a Cauchy horizon, is more\npreferable.\n",
  "subjects": [
    "Physics/General Relativity and Quantum Cosmology"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "PVhF6X_1VQOYTDq_S7TKj8LV5Mt_uAN8t90yLMAcm3I",
  "pdfSize": "6116655"
}