{
  "id": "2412.05093",
  "title": "Sense and Sensitivity: Evaluating the simulation of social dynamics via\n  Large Language Models",
  "authors": "Da Ju, Adina Williams, Brian Karrer, Maximilian Nickel",
  "authorsParsed": [
    [
      "Ju",
      "Da",
      ""
    ],
    [
      "Williams",
      "Adina",
      ""
    ],
    [
      "Karrer",
      "Brian",
      ""
    ],
    [
      "Nickel",
      "Maximilian",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 14:50:01 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733496601000,
  "abstract": "  Large language models have increasingly been proposed as a powerful\nreplacement for classical agent-based models (ABMs) to simulate social\ndynamics. By using LLMs as a proxy for human behavior, the hope of this new\napproach is to be able to simulate significantly more complex dynamics than\nwith classical ABMs and gain new insights in fields such as social science,\npolitical science, and economics. However, due to the black box nature of LLMs,\nit is unclear whether LLM agents actually execute the intended semantics that\nare encoded in their natural language instructions and, if the resulting\ndynamics of interactions are meaningful. To study this question, we propose a\nnew evaluation framework that grounds LLM simulations within the dynamics of\nestablished reference models of social science. By treating LLMs as a black-box\nfunction, we evaluate their input-output behavior relative to this reference\nmodel, which allows us to evaluate detailed aspects of their behavior. Our\nresults show that, while it is possible to engineer prompts that approximate\nthe intended dynamics, the quality of these simulations is highly sensitive to\nthe particular choice of prompts. Importantly, simulations are even sensitive\nto arbitrary variations such as minor wording changes and whitespace. This puts\ninto question the usefulness of current versions of LLMs for meaningful\nsimulations, as without a reference model, it is impossible to determine a\npriori what impact seemingly meaningless changes in prompt will have on the\nsimulation.\n",
  "subjects": [
    "Computer Science/Computers and Society"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "o_7pNkTmWBWqCRc4SUhC-RKJkJmsIRH6eGbSTmv2H3A",
  "pdfSize": "699901"
}