{"id":"2412.09820","title":"Empowering Patients for Disease Diagnosis and Clinical Treatment: A\n  Smart Contract-Enabled Informed Consent Strategy","authors":"Md Al Amin, Hemanth Tummala, Rushabh Shah, and Indrajit Ray","authorsParsed":[["Amin","Md Al",""],["Tummala","Hemanth",""],["Shah","Rushabh",""],["Ray","Indrajit",""]],"versions":[{"version":"v1","created":"Fri, 13 Dec 2024 03:20:15 GMT"}],"updateDate":"2024-12-16","timestamp":1734060015000,"abstract":"  Digital healthcare systems have revolutionized medical services, facilitating\nprovider collaboration, enhancing diagnosis, and optimizing and improving\ntreatments. They deliver superior quality, faster, reliable, and cost-effective\nservices. Researchers are addressing pressing health challenges by integrating\ninformation technology, computing resources, and digital health records.\nHowever, digitizing healthcare introduces significant risks to patient data\nprivacy and security, with the potential for unauthorized access to protected\nhealth information. Although patients can authorize data access through\nconsent, there is a pressing need for mechanisms to ensure such given consent\nis informed and executed properly and timely. Patients deserve transparency and\naccountability regarding the access to their data: who access it, when, and\nunder what circumstances. Current healthcare systems, often centralized, leave\nmuch to be desired in managing these concerns, leading to numerous security\nincidents. To address these issues, we propose a system based on blockchain and\nsmart contracts for managing informed consent for accessing health records by\nthe treatment team members, incorporating safeguards to verify that consent\nprocesses are correctly executed. Blockchain's inherent immutability ensures\nthe integrity of consent. Smart contracts automatically execute agreements,\nenhancing accountability. They provide a robust framework for protecting\npatient privacy in the digital age. Experimental evaluations show that the\nproposed approach can be integrated easily with the existing healthcare systems\nwithout incurring financial and technological challenges.\n","subjects":["Computer Science/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"RaZiNYEfbmZAwxPud8zUSmHaVoq-WepRDuDT3nV9ccM","pdfSize":"4048928"}