{"id":"2412.03785","title":"A Galactic Scale Magnetized Wind Around a Normal Star-Forming Galaxy","authors":"A. M. Matthews, W. D. Cotton, W. M. Peters, L. Marchetti, T. H.\n  Jarrett, J. J. Condon, J. M. van der Hulst, and M. Moloko","authorsParsed":[["Matthews","A. M.",""],["Cotton","W. D.",""],["Peters","W. M.",""],["Marchetti","L.",""],["Jarrett","T. H.",""],["Condon","J. J.",""],["van der Hulst","J. M.",""],["Moloko","M.",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 00:24:13 GMT"}],"updateDate":"2024-12-06","timestamp":1733358253000,"abstract":"  Galaxy formation theory identifies superwinds as a key regulator of star\nformation rates, galaxy growth, and chemical enrichment. Thermal and radiation\npressure are known to drive galactic-scale winds in dusty starbursting galaxies\n(e.g. M82), but modern numerical simulations have recently highlighted that\ncosmic-ray (CR) driven winds may be especially important in normal galaxies\nwith modest star formation rate surface densities. However, CR-driven winds\nhave yet to be conclusively observed -- leaving significant uncertainty in\ntheir detailed microphysics. We present MeerKAT radio continuum and HI\nspectral-line observations of one such normal galaxy, NGC 1532; a nearby\n($D\\sim15\\,\\mathrm{Mpc}$) and edge-on ($i \\gtrsim 80^{\\circ}$) spiral galaxy\ntidally interacting with its smaller elliptical companion, NGC 1531. We find\nmagnetized, highly-ordered radio continuum loops extending $\\sim10$ kpc above\nand below the disk; visibly connecting discrete star-forming regions in the\ndisk with the nucleus. The deep MeerKAT HI observations place an upper limit on\nthe column density of neutral gas coincident with the outflow to $N_\\mathrm{HI}\n\\lesssim 3 \\times 10^{19}\\,\\mathrm{cm}^{-2}$. Unlike previously observed\noutflows -- for which ejected gas and dust can be traced across multiple\nwavelengths -- the loops in NGC 1532 show no detectable signs of dust or gas\ncoincident with the radio emission far from the disk. We explore multiple\npossible mechanisms for driving this magnetic wind and favor an explanation\nwhere cosmic-ray pressure plays a significant role in launching these outflows.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"-JWxZ4pePgJb05WohzjFg3vo-b2ufnAMaB14Vz-U7yA","pdfSize":"4655126"}