{
  "id": "2412.06098",
  "title": "Bayesian Clustering Prior with Overlapping Indices for Effective Use of\n  Multisource External Data",
  "authors": "Xuetao Lu and J. Jack Lee",
  "authorsParsed": [
    [
      "Lu",
      "Xuetao",
      ""
    ],
    [
      "Lee",
      "J. Jack",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 8 Dec 2024 22:58:14 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733698694000,
  "abstract": "  The use of external data in clinical trials offers numerous advantages, such\nas reducing the number of patients, increasing study power, and shortening\ntrial durations. In Bayesian inference, information in external data can be\ntransferred into an informative prior for future borrowing (i.e., prior\nsynthesis). However, multisource external data often exhibits heterogeneity,\nwhich can lead to information distortion during the prior synthesis. Clustering\nhelps identifying the heterogeneity, enhancing the congruence between\nsynthesized prior and external data, thereby preventing information distortion.\nObtaining optimal clustering is challenging due to the trade-off between\ncongruence with external data and robustness to future data. We introduce two\noverlapping indices: the overlapping clustering index (OCI) and the overlapping\nevidence index (OEI). Using these indices alongside a K-Means algorithm, the\noptimal clustering of external data can be identified by balancing the\ntrade-off. Based on the clustering result, we propose a prior synthesis\nframework to effectively borrow information from multisource external data. By\nincorporating the (robust) meta-analytic predictive prior into this framework,\nwe develop (robust) Bayesian clustering MAP priors. Simulation studies and\nreal-data analysis demonstrate their superiority over commonly used priors in\nthe presence of heterogeneity. Since the Bayesian clustering priors are\nconstructed without needing data from the prospective study to be conducted,\nthey can be applied to both study design and data analysis in clinical trials\nor experiments.\n",
  "subjects": [
    "Statistics/Methodology"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "uYNduiFW2nuVadvyXk2c1fHV0NWmdnS4uMPyl5BiClc",
  "pdfSize": "6559491"
}