{
  "id": "2412.13765",
  "title": "LLM-SEM: A Sentiment-Based Student Engagement Metric Using LLMS for\n  E-Learning Platforms",
  "authors": "Ali Hamdi, Ahmed Abdelmoneim Mazrou, and Mohamed Shaltout",
  "authorsParsed": [
    [
      "Hamdi",
      "Ali",
      ""
    ],
    [
      "Mazrou",
      "Ahmed Abdelmoneim",
      ""
    ],
    [
      "Shaltout",
      "Mohamed",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 12:01:53 GMT"
    },
    {
      "version": "v2",
      "created": "Thu, 19 Dec 2024 15:50:54 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734523313000,
  "abstract": "  Current methods for analyzing student engagement in e-learning platforms,\nincluding automated systems, often struggle with challenges such as handling\nfuzzy sentiment in text comments and relying on limited metadata. Traditional\napproaches, such as surveys and questionnaires, also face issues like small\nsample sizes and scalability. In this paper, we introduce LLM-SEM (Language\nModel-Based Student Engagement Metric), a novel approach that leverages video\nmetadata and sentiment analysis of student comments to measure engagement. By\nutilizing recent Large Language Models (LLMs), we generate high-quality\nsentiment predictions to mitigate text fuzziness and normalize key features\nsuch as views and likes. Our holistic method combines comprehensive metadata\nwith sentiment polarity scores to gauge engagement at both the course and\nlesson levels. Extensive experiments were conducted to evaluate various LLM\nmodels, demonstrating the effectiveness of LLM-SEM in providing a scalable and\naccurate measure of student engagement. We fine-tuned TXLM-RoBERTa using\nhuman-annotated sentiment datasets to enhance prediction accuracy and utilized\nLLama 3B, and Gemma 9B from Ollama.\n",
  "subjects": [
    "Computer Science/Computation and Language",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "tF7drDlBNVGMHOt9GRcytrr_MFvzmZYtbZGQswgjuSg",
  "pdfSize": "485268"
}