{
  "id": "2412.20543",
  "title": "Automated Auxiliary Qubit Allocation in High-Level Quantum Programming",
  "authors": "Evandro C. R. Rosa, Jerusa Marchi, Eduardo I. Duzzioni, Rafael de\n  Santiago",
  "authorsParsed": [
    [
      "Rosa",
      "Evandro C. R.",
      ""
    ],
    [
      "Marchi",
      "Jerusa",
      ""
    ],
    [
      "Duzzioni",
      "Eduardo I.",
      ""
    ],
    [
      "de Santiago",
      "Rafael",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 29 Dec 2024 18:19:06 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735496346000,
  "abstract": "  We present a method for optimizing quantum circuit compilation by automating\nthe allocation of auxiliary qubits for multi-qubit gate decompositions. This\napproach is implemented and evaluated within the high-level quantum programming\nplatform Ket. Our results indicate that the decomposition of multi-qubit gates\nis more effectively handled by the compiler, which has access to all circuit\nparameters, rather than through a quantum programming API. To evaluate the\napproach, we compared our implementation against Qiskit, a widely used quantum\nprogramming platform, by analyzing two quantum algorithms. Using a 16-qubit\nQPU, we observed a reduction of 87% in the number of CNOT gates in Grover's\nalgorithm for 9 qubits. For a state preparation algorithm with 7 qubits, the\nnumber of CNOT gates was reduced from $2.8\\times10^7$ to $5.7\\times10^3$,\nleveraging additional Ket optimizations for high-level quantum program\nconstructions. Overall, a quadratic reduction in the number of CNOT gates in\nthe final circuit was observed, with greater improvements achieved when more\nauxiliary qubits were available. These findings underscore the importance of\nautomatic resource management, such as auxiliary qubit allocation, in\noptimizing quantum applications and improving their suitability for near-term\nquantum hardware.\n",
  "subjects": [
    "Physics/Quantum Physics",
    "Computer Science/Programming Languages"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "4gm6zPHehHP1zOuqOdE6r18ZylRYb4L8hBa377CYAhA",
  "pdfSize": "826851"
}