{
  "id": "2412.09029",
  "title": "The AI Assessment Scale Revisited: A Framework for Educational\n  Assessment",
  "authors": "Mike Perkins (1), Jasper Roe (2), Leon Furze (3) ((1) British\n  University Vietnam, Vietnam, (2) James Cook University Singapore, Singapore,\n  (3) Deakin University, Australia)",
  "authorsParsed": [
    [
      "Perkins",
      "Mike",
      ""
    ],
    [
      "Roe",
      "Jasper",
      ""
    ],
    [
      "Furze",
      "Leon",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 07:44:52 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1733989492000,
  "abstract": "  Recent developments in Generative Artificial Intelligence (GenAI) have\ncreated significant uncertainty in education, particularly in terms of\nassessment practices. Against this backdrop, we present an updated version of\nthe AI Assessment Scale (AIAS), a framework with two fundamental purposes: to\nfacilitate open dialogue between educators and students about appropriate GenAI\nuse and to support educators in redesigning assessments in an era of expanding\nAI capabilities.\n  Grounded in social constructivist principles and designed with assessment\nvalidity in mind, the AIAS provides a structured yet flexible approach that can\nbe adapted across different educational contexts. Building on implementation\nfeedback from global adoption across both the K-12 and higher education\ncontexts, this revision represents a significant change from the original AIAS.\nAmong these changes is a new visual guide that moves beyond the original\ntraffic light system and utilises a neutral colour palette that avoids implied\nhierarchies between the levels. The scale maintains five distinct levels of\nGenAI integration in assessment, from \"No AI\" to \"AI Exploration\", but has been\nrefined to better reflect rapidly advancing technological capabilities and\nemerging pedagogical needs.\n  This paper presents the theoretical foundations of the revised framework,\nprovides detailed implementation guidance through practical vignettes, and\ndiscusses its limitations and future directions. As GenAI capabilities continue\nto expand, particularly in multimodal content generation, the AIAS offers a\nstarting point for reimagining assessment design in an era of disruptive\ntechnologies.\n",
  "subjects": [
    "Computer Science/Computers and Society"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "_6GHyUdIjkRjg6Fz_XCjVmMKA7CZeczVLtCyIbPl9Js",
  "pdfSize": "487665"
}