{
  "id": "2412.18950",
  "title": "Optimal control for a class of linear transport-dominated systems via\n  the shifted proper orthogonal decomposition",
  "authors": "Tobias Breiten, Shubhaditya Burela and Philipp Schulze",
  "authorsParsed": [
    [
      "Breiten",
      "Tobias",
      ""
    ],
    [
      "Burela",
      "Shubhaditya",
      ""
    ],
    [
      "Schulze",
      "Philipp",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 25 Dec 2024 17:13:21 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735146801000,
  "abstract": "  Solving optimal control problems for transport-dominated partial differential\nequations (PDEs) can become computationally expensive, especially when dealing\nwith high-dimensional systems. To overcome this challenge, we focus on\ndeveloping and deriving reduced-order models that can replace the full PDE\nsystem in solving the optimal control problem. Specifically, we explore the use\nof the shifted proper orthogonal decomposition (POD) as a reduced-order model,\nwhich is particularly effective for capturing high-fidelity, low-dimensional\nrepresentations of transport-dominated phenomena. Furthermore, we propose two\ndistinct frameworks for addressing these problems: one where the reduced-order\nmodel is constructed first, followed by optimization of the reduced system, and\nanother where the original PDE system is optimized first, with the\nreduced-order model subsequently applied to the optimality system. We consider\na 1D linear advection equation problem and compare the computational\nperformance of the shifted POD method against the conventional methods like the\nstandard POD when the reduced-order models are used as surrogates within a\nbacktracking line search.\n",
  "subjects": [
    "Mathematics/Optimization and Control",
    "Mathematics/Dynamical Systems",
    "Physics/Fluid Dynamics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "34Ppeqe5mXsSa6KqcrcxK6SDbOOBuXBiGleI0Hcz6Xw",
  "pdfSize": "1679327"
}