{
  "id": "2412.11184",
  "title": "New Approximation Guarantees for The Economic Warehouse Lot Scheduling\n  Problem",
  "authors": "Danny Segev",
  "authorsParsed": [
    [
      "Segev",
      "Danny",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 15 Dec 2024 13:28:50 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734269330000,
  "abstract": "  In this paper, we present long-awaited algorithmic advances toward the\nefficient construction of near-optimal replenishment policies for a true\ninventory management classic, the economic warehouse lot scheduling problem.\nWhile this paradigm has accumulated a massive body of surrounding literature\nsince its inception in the late '50s, we are still very much in the dark as far\nas basic computational questions are concerned, perhaps due to the evasive\nnature of dynamic policies in this context. The latter feature forced earlier\nattempts to either study highly-structured classes of policies or to forgo\nprovably-good performance guarantees altogether; to this day, rigorously\nanalyzable results have been few and far between.\n  The current paper develops novel analytical foundations for directly\ncompeting against dynamic policies. Combined with further algorithmic progress\nand newly-gained insights, these ideas culminate to a polynomial-time\napproximation scheme for constantly-many commodities as well as to a\nproof-of-concept $(2-\\frac{17}{5000} + \\epsilon)$-approximation for general\nproblem instances. In this regard, the efficient design of $\\epsilon$-optimal\ndynamic policies appeared to have been out of reach, since beyond algorithmic\nchallenges by themselves, even the polynomial-space representation of such\npolicies has been a fundamental open question. On the other front, our\nsub-$2$-approximation constitutes the first improvement over the performance\nguarantees achievable via ``stationary order sizes and stationary intervals''\n(SOSI) policies, which have been state-of-the-art since the mid-'90s.\n",
  "subjects": [
    "Computer Science/Data Structures and Algorithms",
    "Mathematics/Optimization and Control"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "JSsQYnXDBLWgsPV6CFN5ymutm6Ko4ev8751xRk6vE60",
  "pdfSize": "652244"
}