{
  "id": "2412.14158",
  "title": "AKiRa: Augmentation Kit on Rays for optical video generation",
  "authors": "Xi Wang, Robin Courant, Marc Christie, Vicky Kalogeiton",
  "authorsParsed": [
    [
      "Wang",
      "Xi",
      ""
    ],
    [
      "Courant",
      "Robin",
      ""
    ],
    [
      "Christie",
      "Marc",
      ""
    ],
    [
      "Kalogeiton",
      "Vicky",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 18:53:22 GMT"
    },
    {
      "version": "v2",
      "created": "Sun, 29 Dec 2024 17:22:30 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1734548002000,
  "abstract": "  Recent advances in text-conditioned video diffusion have greatly improved\nvideo quality. However, these methods offer limited or sometimes no control to\nusers on camera aspects, including dynamic camera motion, zoom, distorted lens\nand focus shifts. These motion and optical aspects are crucial for adding\ncontrollability and cinematic elements to generation frameworks, ultimately\nresulting in visual content that draws focus, enhances mood, and guides\nemotions according to filmmakers' controls. In this paper, we aim to close the\ngap between controllable video generation and camera optics. To achieve this,\nwe propose AKiRa (Augmentation Kit on Rays), a novel augmentation framework\nthat builds and trains a camera adapter with a complex camera model over an\nexisting video generation backbone. It enables fine-tuned control over camera\nmotion as well as complex optical parameters (focal length, distortion,\naperture) to achieve cinematic effects such as zoom, fisheye effect, and bokeh.\nExtensive experiments demonstrate AKiRa's effectiveness in combining and\ncomposing camera optics while outperforming all state-of-the-art methods. This\nwork sets a new landmark in controlled and optically enhanced video generation,\npaving the way for future optical video generation methods.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Multimedia"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "fmQkEf8DDGFRsCwh9hthrC4aVwiP1nMa7HJbd5YU93k",
  "pdfSize": "38584152"
}