{
  "id": "2412.08167",
  "title": "Diversity Drives Fairness: Ensemble of Higher Order Mutants for\n  Intersectional Fairness of Machine Learning Software",
  "authors": "Zhenpeng Chen, Xinyue Li, Jie M. Zhang, Federica Sarro, Yang Liu",
  "authorsParsed": [
    [
      "Chen",
      "Zhenpeng",
      ""
    ],
    [
      "Li",
      "Xinyue",
      ""
    ],
    [
      "Zhang",
      "Jie M.",
      ""
    ],
    [
      "Sarro",
      "Federica",
      ""
    ],
    [
      "Liu",
      "Yang",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 07:44:35 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733903075000,
  "abstract": "  Intersectional fairness is a critical requirement for Machine Learning (ML)\nsoftware, demanding fairness across subgroups defined by multiple protected\nattributes. This paper introduces FairHOME, a novel ensemble approach using\nhigher order mutation of inputs to enhance intersectional fairness of ML\nsoftware during the inference phase. Inspired by social science theories\nhighlighting the benefits of diversity, FairHOME generates mutants representing\ndiverse subgroups for each input instance, thus broadening the array of\nperspectives to foster a fairer decision-making process. Unlike conventional\nensemble methods that combine predictions made by different models, FairHOME\ncombines predictions for the original input and its mutants, all generated by\nthe same ML model, to reach a final decision. Notably, FairHOME is even\napplicable to deployed ML software as it bypasses the need for training new\nmodels. We extensively evaluate FairHOME against seven state-of-the-art\nfairness improvement methods across 24 decision-making tasks using widely\nadopted metrics. FairHOME consistently outperforms existing methods across all\nmetrics considered. On average, it enhances intersectional fairness by 47.5%,\nsurpassing the currently best-performing method by 9.6 percentage points.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Software Engineering"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Utm8KDDNsXNwJyBc-oywJBXA8K-xbTAILUOOaCqqhU0",
  "pdfSize": "1370093"
}