{
  "id": "2412.08233",
  "title": "An Overview of the Decentralized Reconfiguration Language Concerto-D\n  through its Maude Formalization",
  "authors": "Farid Arfi (IMT Atlantique), H\\'el\\`ene Coullon (IMT Atlantique),\n  Fr\\'ed\\'eric Loulergue (University of Orleans), Jolan Philippe (IMT\n  Atlantique), Simon Robillard (University of Montpellier)",
  "authorsParsed": [
    [
      "Arfi",
      "Farid",
      "",
      "IMT Atlantique"
    ],
    [
      "Coullon",
      "Hélène",
      "",
      "IMT Atlantique"
    ],
    [
      "Loulergue",
      "Frédéric",
      "",
      "University of Orleans"
    ],
    [
      "Philippe",
      "Jolan",
      "",
      "IMT\n  Atlantique"
    ],
    [
      "Robillard",
      "Simon",
      "",
      "University of Montpellier"
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 09:31:40 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733909500000,
  "abstract": "  We propose an overview of the decentralized reconfiguration language\nConcerto-D through its Maude formalization. Concerto-D extends the already\npublished Concerto language. Concerto-D improves on two different parameters\ncompared with related work: the decentralized coordination of numerous local\nreconfiguration plans which avoid a single point of failure when considering\nunstable networks such as edge computing, or cyber-physical systems (CPS) for\ninstance; and a mechanized formal semantics of the language with Maude which\noffers guarantees on the executability of the semantics. Throughout the paper,\nthe Concerto-D language and its semantics are exemplified with a\nreconfiguration extracted from a real case study on a CPS. We rely on the Maude\nformal specification language, which is based on rewriting logic, and\nconsequently perfectly suited for describing a concurrent model.\n",
  "subjects": [
    "Computer Science/Programming Languages",
    "Computer Science/Software Engineering"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "in6IOgOKy8P67z8gEQ2cXu0wh4HfCr2QKFug5FaH5y8",
  "pdfSize": "362830"
}