{"id":"2412.00365","title":"Cross Helicity and the Helium Abundance as an in situ Metric of Solar\n  Wind Acceleration","authors":"B. L. Alterman and R. D'Amicis","authorsParsed":[["Alterman","B. L.",""],["D'Amicis","R.",""]],"versions":[{"version":"v1","created":"Sat, 30 Nov 2024 05:54:04 GMT"},{"version":"v2","created":"Mon, 10 Feb 2025 18:40:59 GMT"}],"updateDate":"2025-02-13","timestamp":1732946044000,"abstract":"  The two-state solar wind paradigm is based on observations showing that slow\nand fast solar wind have distinct properties like helium abundances, kinetic\nsignatures, elemental composition, and charge-state ratios. Nominally, the fast\nwind originates from solar sources that are continuously magnetically open to\nthe heliosphere like coronal holes while the slow wind is from solar sources\nthat are only intermittently open to the heliosphere like helmet streamers and\npseudostreamers. The Alfv\\'enic slow wind is an emerging 3rd class of solar\nwind that challenges the two-state fast/slow paradigm. It has slow wind speeds\nbut is highly Alfv\\'enic, i.e. has a high correlation between velocity and\nmagnetic field fluctuations along with low compressibility typical of Alfv\\'en\nwaves, which is typically observed in fast wind. Its other properties are also\nmore similar to the fast than slow wind. From 28 years of Wind observations at\n1 AU, we derive the solar wind helium abundance ($A_\\mathrm{He}$),\nAlfv\\'enicity ($\\left|\\sigma_c\\right|$), and solar wind speed\n($v_\\mathrm{sw}$). Characterizing vsw as a function of $\\left|\\sigma_c\\right|$\nand $A_\\mathrm{He}$, we show that the maximum solar wind speed for plasma\naccelerated in source regions that are intermittently open is faster than the\nminimum solar wind speed for plasma accelerated in continuously open regions.\nWe infer that the Alfv\\'enic slow wind is likely solar wind originating from\nopen-field regions with speeds below the maximum solar wind speed for plasma\nfrom intermittently open regions. We then discuss possible implications for\nsolar wind acceleration. Finally, we utilize the combination of helium\nabundance and normalized cross helicity to present a novel solar wind\ncategorization scheme that illustrates the transition in observations of solar\nwind at 1 AU from magnetically closed to magnetically open sources.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Physics/Space Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"se987IbypGGgp7gnr8ibV0BE7dULtvYdDfhy1WTKJp4","pdfSize":"1556843"}