{"id":"2412.15305","title":"Tree-of-Code: A Tree-Structured Exploring Framework for End-to-End Code\n  Generation and Execution in Complex Task Handling","authors":"Ziyi Ni, Yifan Li, Ning Yang, Dou Shen, Pin Lv, Daxiang Dong","authorsParsed":[["Ni","Ziyi",""],["Li","Yifan",""],["Yang","Ning",""],["Shen","Dou",""],["Lv","Pin",""],["Dong","Daxiang",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 12:31:22 GMT"}],"updateDate":"2024-12-23","timestamp":1734611482000,"abstract":"  Solving complex reasoning tasks is a key real-world application of agents.\nThanks to the pretraining of Large Language Models (LLMs) on code data, recent\napproaches like CodeAct successfully use code as LLM agents' action, achieving\ngood results. However, CodeAct greedily generates the next action's code block\nby relying on fragmented thoughts, resulting in inconsistency and instability.\nMoreover, CodeAct lacks action-related ground-truth (GT), making its\nsupervision signals and termination conditions questionable in multi-turn\ninteractions. To address these issues, we first introduce a simple yet\neffective end-to-end code generation paradigm, CodeProgram, which leverages\ncode's systematic logic to align with global reasoning and enable cohesive\nproblem-solving. Then, we propose Tree-of-Code (ToC), which self-grows\nCodeProgram nodes based on the executable nature of the code and enables\nself-supervision in a GT-free scenario. Experimental results on two datasets\nusing ten popular zero-shot LLMs show ToC remarkably boosts accuracy by nearly\n20% over CodeAct with less than 1/4 turns. Several LLMs even perform better on\none-turn CodeProgram than on multi-turn CodeAct. To further investigate the\ntrade-off between efficacy and efficiency, we test different ToC tree sizes and\nexploration mechanisms. We also highlight the potential of ToC's end-to-end\ndata generation for supervised and reinforced fine-tuning.\n","subjects":["Computer Science/Software Engineering","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"LdMhSu7OrMCUVBVm8-99VnkQ1ZmWG2zg3JyGFPpGoWA","pdfSize":"2102569"}