{
  "id": "2412.15747",
  "title": "Building Bridges: AI Custom Chatbots as Mediators between Mathematics\n  and Physics",
  "authors": "Julia Lademann, Jannik Henze, Sebastian Becker-Genschow",
  "authorsParsed": [
    [
      "Lademann",
      "Julia",
      ""
    ],
    [
      "Henze",
      "Jannik",
      ""
    ],
    [
      "Becker-Genschow",
      "Sebastian",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 10:06:30 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734689190000,
  "abstract": "  This work explores the integration of AI custom chatbots in educational\nsettings, with a particular focus on their applicability in the context of\nmathematics and physics. In view of the increasing deployment of AI tools such\nas ChatGPT in educational contexts, the present study examines their potential\nas personalized tutoring systems. The study assesses the impact of AI-generated\nlearning materials on the learning experiences and performance of sixth-grade\nstudents, with a particular focus on proportional relationships in mathematical\nand physical contexts. The randomized controlled study with N = 214 students\ncompared traditional textbook materials with explanations generated by a custom\nchatbot. The results demonstrated that while AI-generated materials had an\nindefinite impact on learning outcomes, they significantly enhanced\npositive-activating emotions, situational interest, and self-efficacy, while\nreducing intrinsic and extrinsic cognitive load. These findings underscore the\npotential of AI to transform educational practices by fostering a superior\nlearning experience. However, further research is required to clarify its\nimpact on learning performance and long-term learning outcomes. The study\nhighlights the importance of careful integration and customization of AI tools\nto maximize their benefits in physics education.\n",
  "subjects": [
    "Physics/Physics Education"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "CNyElyGDvomoXM0-nojtX-8r8SEW5YthoakZDbMBCMo",
  "pdfSize": "597507"
}