{
  "id": "2412.07213",
  "title": "IntellectSeeker: A Personalized Literature Management System with the\n  Probabilistic Model and Large Language Model",
  "authors": "Weizhen Bian, Siyan Liu, Yubo Zhou, Dezhi Chen, Yijie Liao, Zhenzhen\n  Fan, Aobo Wang",
  "authorsParsed": [
    [
      "Bian",
      "Weizhen",
      ""
    ],
    [
      "Liu",
      "Siyan",
      ""
    ],
    [
      "Zhou",
      "Yubo",
      ""
    ],
    [
      "Chen",
      "Dezhi",
      ""
    ],
    [
      "Liao",
      "Yijie",
      ""
    ],
    [
      "Fan",
      "Zhenzhen",
      ""
    ],
    [
      "Wang",
      "Aobo",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 06:09:49 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733810989000,
  "abstract": "  Faced with the burgeoning volume of academic literature, researchers often\nneed help with uncertain article quality and mismatches in term searches using\ntraditional academic engines. We introduce IntellectSeeker, an innovative and\npersonalized intelligent academic literature management platform to address\nthese challenges. This platform integrates a Large Language Model (LLM)--based\nsemantic enhancement bot with a sophisticated probability model to personalize\nand streamline literature searches. We adopted the GPT-3.5-turbo model to\ntransform everyday language into professional academic terms across various\nscenarios using multiple rounds of few-shot learning. This adaptation mainly\nbenefits academic newcomers, effectively bridging the gap between general\ninquiries and academic terminology. The probabilistic model intelligently\nfilters academic articles to align closely with the specific interests of\nusers, which are derived from explicit needs and behavioral patterns. Moreover,\nIntellectSeeker incorporates an advanced recommendation system and text\ncompression tools. These features enable intelligent article recommendations\nbased on user interactions and present search results through concise one-line\nsummaries and innovative word cloud visualizations, significantly enhancing\nresearch efficiency and user experience. IntellectSeeker offers academic\nresearchers a highly customizable literature management solution with\nexceptional search precision and matching capabilities. The code can be found\nhere: https://github.com/LuckyBian/ISY5001\n",
  "subjects": [
    "Computer Science/Information Retrieval",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "y7Ch41seoMguPicMyRdhb5DDwiMlIM2S4xFqkz7sS1I",
  "pdfSize": "923944"
}