{
  "id": "2412.00909",
  "title": "Centre mode instability of a dilute particle-laden swirling jet in a\n  swirl flow combustor",
  "authors": "Srikumar Warrier, Gaurav Tomar",
  "authorsParsed": [
    [
      "Warrier",
      "Srikumar",
      ""
    ],
    [
      "Tomar",
      "Gaurav",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 1 Dec 2024 17:52:02 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733075522000,
  "abstract": "  Linear stability of a locally parallel annular swirling jet laden with\nparticles in a swirl flow combustor is considered. At low Stokes numbers, the\neigenspectra of the particle-laden jet with uniform particle concentration\nshows three unstable modes namely centre, sinuous and varicose modes. As the\nStokes number is increased to unity, the growth rates of the centre and shear\nlayer modes reduces compared to that of the unladen swirling jet. The magnitude\nof the velocity eigenmodes peaks in the vortex core and decays radially\noutward. The variation in particle concentration occurs mostly in the vortex\ncore and almost none in the shear layer. The strength of flow reversal at the\njet centreline is given by the backflow parameter. An increase in the backflow\nparameter increases the growth rate of the centre mode. Non-uniformity in the\nbase-state particle concentration is introduced using a Gaussian function\nvarying in the radial direction and a reduction in the growth rate of the\ncentre mode is seen compared to the uniform particle concentration profile.\nWhen the location of the peak of the base-state particle concentration profile\nis inside the vortex core, the centre modes are stable. Linearized vorticity\nbudget analysis reveals that this is accompanied by a decrease in the net\ngeneration of perturbation vorticity in the axial direction and increased\nradial and azimuthal perturbation vorticity.\n",
  "subjects": [
    "Physics/Fluid Dynamics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "jnR9cib3-3ZejsOyb3noFNucNJxKXTT6F3sYSaZ9d0c",
  "pdfSize": "1794267"
}