{
  "id": "2412.04079",
  "title": "Electron-Induced Radiolysis of Water Ice and the Buildup of Oxygen",
  "authors": "Chantal Tinner and Andr\\'e Galli and Fiona B\\\"ar and Antoine Pommerol\n  and Martin Rubin and Audrey Vorburger and Peter Wurz",
  "authorsParsed": [
    [
      "Tinner",
      "Chantal",
      ""
    ],
    [
      "Galli",
      "André",
      ""
    ],
    [
      "Bär",
      "Fiona",
      ""
    ],
    [
      "Pommerol",
      "Antoine",
      ""
    ],
    [
      "Rubin",
      "Martin",
      ""
    ],
    [
      "Vorburger",
      "Audrey",
      ""
    ],
    [
      "Wurz",
      "Peter",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 11:26:41 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733398001000,
  "abstract": "  Irradiation by energetic ions, electrons, and UV photons induces sputtering\nand chemical processes (radiolysis) in the surfaces of icy moons, comets, and\nicy grains. Laboratory experiments, both of ideal surfaces and of more complex\nand realistic analog samples, are crucial to understand the interaction of\nsurfaces of icy moons and comets with their space environment. This study shows\nthe first results of mass spectrometry measurements from porous water ice\nregolith samples irradiated with electrons as a representative analogy to\nwater-ice rich surfaces in the solar system. Previous studies have shown that\nmost electron-induced H2O radiolysis products leave the ice as H2 and O2 and\nthat O2 can be trapped under certain conditions in the irradiated ice. Our new\nlaboratory experiments confirm these findings. Moreover, they quantify\nresidence times and saturation levels of O2 in originally pure water ice. H2O\nmay also be released from the water ice by irradiation, but the quantification\nof the released H2O is more difficult and the total amount is sensitive to the\nelectron flux and energy.\n",
  "subjects": [
    "Astrophysics/Earth and Planetary Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "V8UxfRQ4ubJRbpR515mP-FowcDahHW4EPaNVCKiRCXE",
  "pdfSize": "1598680"
}