{
  "id": "2412.05988",
  "title": "A potential exomoon from the predicted planet obliquity of $\\beta$\n  Pictoris b",
  "authors": "Michael Poon, Hanno Rein, Dang Pham",
  "authorsParsed": [
    [
      "Poon",
      "Michael",
      ""
    ],
    [
      "Rein",
      "Hanno",
      ""
    ],
    [
      "Pham",
      "Dang",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 8 Dec 2024 16:33:55 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733675635000,
  "abstract": "  Planet obliquity is the alignment or misalignment of a planet spin axis\nrelative to its orbit normal. In a multiplanet system, this obliquity is a\nvaluable signature of planet formation and evolutionary history. The young\n$\\beta$ Pictoris system hosts two coplanar super-Jupiters and upcoming JWST\nobservations of this system will constrain the obliquity of the outer planet,\n$\\beta$ Pictoris b. This will be the first planet obliquity measurement in an\nextrasolar, multiplanet system. First, we show that this new planet obliquity\nis likely misaligned by using a wide range of simulated observations in\ncombination with published measurements of the system. Motivated by current\nexplanations for the tilted planet obliquities in the Solar System, we consider\ncollisions and secular spin-orbit resonances. While collisions are unlikely to\noccur, secular spin-orbit resonance modified by the presence of an exomoon\naround the outer planet can excite a large obliquity. The largest induced\nobliquities ($\\sim 60^\\circ$) occur for moons with at least a Neptune-mass and\na semimajor axis of $0.03-0.05~\\mathrm{au}$ ($40-70$ planet radii). For certain\norbital alignments, such a moon may observably transit the planet (transit\ndepth of $3-7\\%$, orbital period of $3-7$ weeks). Thus, a nonzero obliquity\ndetection of $\\beta$ Pictoris b implies that it may host a large exomoon.\nAlthough we focus on the $\\beta$ Pictoris system, the idea that the presence of\nexomoons can excite high obliquities is very general and applicable to other\nexoplanetary systems.\n",
  "subjects": [
    "Astrophysics/Earth and Planetary Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "wbgFSG6lmS1g5rPG-r_ju-E0xaWA1Je0L_LDwx-mNjI",
  "pdfSize": "1789470"
}