{
  "id": "2412.16137",
  "title": "Camera-Based Localization and Enhanced Normalized Mutual Information",
  "authors": "Vishnu Teja Kunde, Jean-Francois Chamberland, Siddharth Agarwal",
  "authorsParsed": [
    [
      "Kunde",
      "Vishnu Teja",
      ""
    ],
    [
      "Chamberland",
      "Jean-Francois",
      ""
    ],
    [
      "Agarwal",
      "Siddharth",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 18:35:53 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734719753000,
  "abstract": "  Robust and fine localization algorithms are crucial for autonomous driving.\nFor the production of such vehicles as a commodity, affordable sensing\nsolutions and reliable localization algorithms must be designed. This work\nconsiders scenarios where the sensor data comes from images captured by an\ninexpensive camera mounted on the vehicle and where the vehicle contains a fine\nglobal map. Such localization algorithms typically involve finding the section\nin the global map that best matches the captured image. In harsh environments,\nboth the global map and the captured image can be noisy. Because of physical\nconstraints on camera placement, the image captured by the camera can be viewed\nas a noisy perspective transformed version of the road in the global map. Thus,\nan optimal algorithm should take into account the unequal noise power in\nvarious regions of the captured image, and the intrinsic uncertainty in the\nglobal map due to environmental variations. This article briefly reviews two\nmatching methods: (i) standard inner product (SIP) and (ii) normalized mutual\ninformation (NMI). It then proposes novel and principled modifications to\nimprove the performance of these algorithms significantly in noisy\nenvironments. These enhancements are inspired by the physical constraints\nassociated with autonomous vehicles. They are grounded in statistical signal\nprocessing and, in some context, are provably better. Numerical simulations\ndemonstrate the effectiveness of such modifications.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Electrical Engineering and Systems Science/Signal Processing",
    "Statistics/Applications"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "elH_oGsnVQzek1p2rS1ZTaqlNZ8M35QBdo5YLOiHrX8",
  "pdfSize": "262223"
}