{
  "id": "2412.01175",
  "title": "OBI-Bench: Can LMMs Aid in Study of Ancient Script on Oracle Bones?",
  "authors": "Zijian Chen, Tingzhu Chen, Wenjun Zhang, Guangtao Zhai",
  "authorsParsed": [
    [
      "Chen",
      "Zijian",
      ""
    ],
    [
      "Chen",
      "Tingzhu",
      ""
    ],
    [
      "Zhang",
      "Wenjun",
      ""
    ],
    [
      "Zhai",
      "Guangtao",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 06:31:28 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 11 Feb 2025 14:59:40 GMT"
    }
  ],
  "updateDate": "2025-02-12",
  "timestamp": 1733121088000,
  "abstract": "  We introduce OBI-Bench, a holistic benchmark crafted to systematically\nevaluate large multi-modal models (LMMs) on whole-process oracle bone\ninscriptions (OBI) processing tasks demanding expert-level domain knowledge and\ndeliberate cognition. OBI-Bench includes 5,523 meticulously collected\ndiverse-sourced images, covering five key domain problems: recognition,\nrejoining, classification, retrieval, and deciphering. These images span\ncenturies of archaeological findings and years of research by front-line\nscholars, comprising multi-stage font appearances from excavation to synthesis,\nsuch as original oracle bone, inked rubbings, oracle bone fragments, cropped\nsingle characters, and handprinted characters. Unlike existing benchmarks,\nOBI-Bench focuses on advanced visual perception and reasoning with OBI-specific\nknowledge, challenging LMMs to perform tasks akin to those faced by experts.\nThe evaluation of 6 proprietary LMMs as well as 17 open-source LMMs highlights\nthe substantial challenges and demands posed by OBI-Bench. Even the latest\nversions of GPT-4o, Gemini 1.5 Pro, and Qwen-VL-Max are still far from\npublic-level humans in some fine-grained perception tasks. However, they\nperform at a level comparable to untrained humans in deciphering tasks,\nindicating remarkable capabilities in offering new interpretative perspectives\nand generating creative guesses. We hope OBI-Bench can facilitate the community\nto develop domain-specific multi-modal foundation models towards ancient\nlanguage research and delve deeper to discover and enhance these untapped\npotentials of LMMs.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "u_dRKC53IzGH_hn-3KYHncxdYsrOpzfT-AX8ajD6v9g",
  "pdfSize": "35465770"
}