{
  "id": "2412.01701",
  "title": "FathomVerse: A community science dataset for ocean animal discovery",
  "authors": "Genevieve Patterson, Joost Daniels, Benjamin Woodward, Kevin Barnard,\n  Giovanna Sainz, Lonny Lundsten, Kakani Katija",
  "authorsParsed": [
    [
      "Patterson",
      "Genevieve",
      ""
    ],
    [
      "Daniels",
      "Joost",
      ""
    ],
    [
      "Woodward",
      "Benjamin",
      ""
    ],
    [
      "Barnard",
      "Kevin",
      ""
    ],
    [
      "Sainz",
      "Giovanna",
      ""
    ],
    [
      "Lundsten",
      "Lonny",
      ""
    ],
    [
      "Katija",
      "Kakani",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 16:49:20 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733158160000,
  "abstract": "  Can computer vision help us explore the ocean? The ultimate challenge for\ncomputer vision is to recognize any visual phenomena, more than only the\nobjects and animals humans encounter in their terrestrial lives. Previous\ndatasets have explored everyday objects and fine-grained categories humans see\nfrequently. We present the FathomVerse v0 detection dataset to push the limits\nof our field by exploring animals that rarely come in contact with people in\nthe deep sea. These animals present a novel vision challenge.\n  The FathomVerse v0 dataset consists of 3843 images with 8092 bounding boxes\nfrom 12 distinct morphological groups recorded at two locations on the deep\nseafloor that are new to computer vision. It features visually perplexing\nscenarios such as an octopus intertwined with a sea star, and confounding\ncategories like vampire squids and sea spiders. This dataset can push forward\nresearch on topics like fine-grained transfer learning, novel category\ndiscovery, species distribution modeling, and carbon cycle analysis, all of\nwhich are important to the care and husbandry of our planet.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Human-Computer Interaction"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "bU2gKDyH9-HO2Z0Us_hymevNmNt1I7RU45TqvPAbBH4",
  "pdfSize": "17512113"
}