{"id":"2412.08126","title":"Machine-Learning-Accelerated Surface Exploration of Reconstructed\n  BiVO$_{4}$(010) and Characterization of Their Aqueous Interfaces","authors":"Yonghyuk Lee and Taehun Lee","authorsParsed":[["Lee","Yonghyuk",""],["Lee","Taehun",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 06:22:12 GMT"}],"updateDate":"2024-12-12","timestamp":1733898132000,"abstract":"  Understanding the semiconductor-electrolyte interface in photoelectrochemical\n(PEC) systems is crucial for optimizing stability and reactivity. Despite the\nchallenges in establishing reliable surface structure models during PEC cycles,\nthis study explores the complex surface reconstructions of BiVO$_{4}$(010) by\nemploying a computational workflow integrated with a state-of-the-art active\nlearning protocol for a machine-learning interatomic potential and global\noptimization techniques. Within this workflow, we identified 494 unique\nreconstructed surface structures that surpass conventional chemical\nintuition-driven, bulk-truncated models. After constructing the surface\nPourbaix diagram under Bi- and V-rich electrolyte conditions using density\nfunctional theory and hybrid functional calculations, we proposed structural\nmodels for the experimentally observed Bi-rich BiVO$_{4}$ surfaces. By\nperforming hybrid functional molecular dynamics simulations with explicit\ntreatment of water molecules on selected reconstructed BiVO$_{4}$(010)\nsurfaces, we observed spontaneous water dissociation, marking the first\ntheoretical report of this phenomenon. Our findings demonstrate significant\nwater dissociation on reconstructed Bi-rich surfaces, highlighting the critical\nrole of bare and under-coordinated Bi sites (only observable in reconstructed\nsurfaces) in driving hydration processes. Our work establishes a foundation for\nunderstanding the role of complex, reconstructed Bi surfaces in surface\nhydration and reactivity. Additionally, our theoretical framework for exploring\nsurface structures and predicting reactivity in multicomponent oxides offers a\nprecise approach to describing complex surface and interface processes in PEC\nsystems.\n","subjects":["Condensed Matter/Materials Science","Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"uzkJopwmQi9BTFGhh11TGPB3-Cc4iRLf8DfL3T8dWjA","pdfSize":"6447609"}