{
  "id": "2412.08230",
  "title": "RatanSunPy: A robust preprocessing pipeline for RATAN-600 solar radio\n  observations data",
  "authors": "I. Knyazeva, I. Lysov, E. Kurochkin, A. Shendrik, D. Derkach, N.\n  Makarenko",
  "authorsParsed": [
    [
      "Knyazeva",
      "I.",
      ""
    ],
    [
      "Lysov",
      "I.",
      ""
    ],
    [
      "Kurochkin",
      "E.",
      ""
    ],
    [
      "Shendrik",
      "A.",
      ""
    ],
    [
      "Derkach",
      "D.",
      ""
    ],
    [
      "Makarenko",
      "N.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 09:30:37 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733909437000,
  "abstract": "  The advancement of observational technologies and software for processing and\nvisualizing spectro-polarimetric microwave data obtained with the RATAN-600\nradio telescope opens new opportunities for studying the physical\ncharacteristics of solar plasma at the levels of the chromosphere and corona.\nThese levels remain some difficult to detect in the ultraviolet and X-ray\nranges. The development of such methods allows for more precise investigation\nof the fine structure and dynamics of the solar atmosphere, thereby deepening\nour understanding of the processes occurring in these layers. The obtained data\nalso can be utilized for diagnosing solar plasma and forecasting solar\nactivity. However, using RATAN-600 data requires extensive data processing and\nfamiliarity with the RATAN-600. This paper introduces RatanSunPy, an\nopen-source Python package developed for accessing, visualizing, and analyzing\nmulti-band radio observations of the Sun from the RATAN-600 solar complex. The\npackage offers comprehensive data processing functionalities, including direct\naccess to raw data, essential processing steps such as calibration and quiet\nSun normalization, and tools for analyzing solar activity. This includes\nautomatic detection of local sources, identifying them with NOAA (National\nOceanic and Atmospheric Administration) active regions, and further determining\nparameters for local sources and active regions. By streamlining data\nprocessing workflows, RatanSunPy enables researchers to investigate the fine\nstructure and dynamics of the solar atmosphere more efficiently, contributing\nto advancements in solar physics and space weather forecasting.\n",
  "subjects": [
    "Astrophysics/Solar and Stellar Astrophysics",
    "Astrophysics/Instrumentation and Methods for Astrophysics",
    "Computer Science/Digital Libraries",
    "Physics/Space Physics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "yBUeQamHnSch_fJXvaYt_WAt56QiDobolt60uIefvGo",
  "pdfSize": "5941060"
}