{
  "id": "2412.16818",
  "title": "Unsupervised Discovery of Formulas for Mathematical Constants",
  "authors": "Michael Shalyt, Uri Seligmann, Itay Beit Halachmi, Ofir David, Rotem\n  Elimelech, Ido Kaminer",
  "authorsParsed": [
    [
      "Shalyt",
      "Michael",
      ""
    ],
    [
      "Seligmann",
      "Uri",
      ""
    ],
    [
      "Halachmi",
      "Itay Beit",
      ""
    ],
    [
      "David",
      "Ofir",
      ""
    ],
    [
      "Elimelech",
      "Rotem",
      ""
    ],
    [
      "Kaminer",
      "Ido",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 22 Dec 2024 01:43:56 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734831836000,
  "abstract": "  Ongoing efforts that span over decades show a rise of AI methods for\naccelerating scientific discovery, yet accelerating discovery in mathematics\nremains a persistent challenge for AI. Specifically, AI methods were not\neffective in creation of formulas for mathematical constants because each such\nformula must be correct for infinite digits of precision, with \"near-true\"\nformulas providing no insight toward the correct ones. Consequently, formula\ndiscovery lacks a clear distance metric needed to guide automated discovery in\nthis realm.\n  In this work, we propose a systematic methodology for categorization,\ncharacterization, and pattern identification of such formulas. The key to our\nmethodology is introducing metrics based on the convergence dynamics of the\nformulas, rather than on the numerical value of the formula. These metrics\nenable the first automated clustering of mathematical formulas. We demonstrate\nthis methodology on Polynomial Continued Fraction formulas, which are\nubiquitous in their intrinsic connections to mathematical constants, and\ngeneralize many mathematical functions and structures.\n  We test our methodology on a set of 1,768,900 such formulas, identifying many\nknown formulas for mathematical constants, and discover previously unknown\nformulas for $\\pi$, $\\ln(2)$, Gauss', and Lemniscate's constants. The uncovered\npatterns enable a direct generalization of individual formulas to infinite\nfamilies, unveiling rich mathematical structures. This success paves the way\ntowards a generative model that creates formulas fulfilling specified\nmathematical properties, accelerating the rate of discovery of useful formulas.\n",
  "subjects": [
    "Computer Science/Artificial Intelligence",
    "Computer Science/Machine Learning",
    "Mathematics/Number Theory"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "WQ56B5RM_vxrkPRxPdZKdpvZKaSpilKw9IjSkV3sLzg",
  "pdfSize": "14480832"
}