{
  "id": "2412.17597",
  "title": "Structured pathways in the turbulence organizing recent oil spill events\n  in the Eastern Mediterranean",
  "authors": "Guillermo Garcia-Sanchez, Ana M. Mancho, Antonio G. Ramos, Josep Coca,\n  Stephen Wiggins",
  "authorsParsed": [
    [
      "Garcia-Sanchez",
      "Guillermo",
      ""
    ],
    [
      "Mancho",
      "Ana M.",
      ""
    ],
    [
      "Ramos",
      "Antonio G.",
      ""
    ],
    [
      "Coca",
      "Josep",
      ""
    ],
    [
      "Wiggins",
      "Stephen",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 14:14:59 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734963299000,
  "abstract": "  The chaotic nature of ocean motion is a major challenge that hinders the\ndiscovery of spatio-temporal current routes that govern the transport of\nmaterial. Certain material, such as oil spills, pose significant environmental\nthreats and these are enhanced by the fact that they evolve in a chaotic sea,\nin a way which still nowadays is far from being systematically anticipated.\nRecently such an oil spill event has affected the Mediterranean coast of\nseveral Middle Eastern countries. No accidents were reported for these spills\nprevious to their arrival at the coast, and therefore there was no hint of\ntheir origin. Modelling such an event, in which uncertainties are increased due\nto the lack of information on where and when the spills was produced, stretches\navailable technologies to their limits, and requires the use of novel ideas\nthat help to understand the essential features of oil and tar transport by\nocean currents. In this regard Lagrangian Coherent Structures enable us to find\norder within ocean chaos and provide powerful insights into chaotic events and\ntheir relationships over different locations and times like the one addressed.\nUsing the observed locations of the oil impacting the coast at specific times,\nwe seek to determine its original location and the time it was released in the\nopen ocean. We have determined both using a combination of earlier satellite\nobservations and computational modelling of the time evolution. The observed\nagreement between modeled cases and satellite observations highlights the power\nof these ideas.\n",
  "subjects": [
    "Physics/Atmospheric and Oceanic Physics",
    "Nonlinear Sciences/Chaotic Dynamics",
    "Physics/Fluid Dynamics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "TLuIzV99A9FCNPg0bgJ2NjegeXhiehsiomeb05F_1Kg",
  "pdfSize": "15931935"
}