{
  "id": "2412.09250",
  "title": "GeLoRA: Geometric Adaptive Ranks For Efficient LoRA Fine-tuning",
  "authors": "Abdessalam Ed-dib, Zhanibek Datbayev, Amine Mohamed Aboussalah",
  "authorsParsed": [
    [
      "Ed-dib",
      "Abdessalam",
      ""
    ],
    [
      "Datbayev",
      "Zhanibek",
      ""
    ],
    [
      "Aboussalah",
      "Amine Mohamed",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 13:04:54 GMT"
    },
    {
      "version": "v2",
      "created": "Sun, 15 Dec 2024 21:21:59 GMT"
    },
    {
      "version": "v3",
      "created": "Tue, 17 Dec 2024 23:41:39 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734008694000,
  "abstract": "  Fine-tuning large language models (LLMs) is computationally intensive because\nit requires updating all parameters. Low-Rank Adaptation (LoRA) improves\nefficiency by modifying only a subset of weights but introduces a trade-off\nbetween expressivity and computational cost: lower ranks reduce resources but\nlimit expressiveness, while higher ranks enhance expressivity at increased\ncost. Despite recent advances in adaptive LoRA techniques, existing methods\nfail to provide a theoretical basis for optimizing the trade-off between model\nperformance and efficiency. We propose Geometric Low-Rank Adaptation (GeLoRA),\na novel framework that computes the intrinsic dimensionality of hidden state\nrepresentations to adaptively select LoRA ranks. We demonstrate that the\nintrinsic dimension provides a lower bound for the optimal rank of LoRA\nmatrices, allowing for a principled selection that balances efficiency and\nexpressivity. GeLoRA dynamically adjusts the rank for each layer based on the\nintrinsic dimensionality of its input and output representations, recognizing\nthat not all model parameters equally impact fine-tuning. Empirical validation\non multiple tasks shows that GeLoRA consistently outperforms recent baselines\nwithin the same parameter budget.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Mathematics/Geometric Topology",
    "Statistics/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "E-QxuJofDkaNtGh_mysV4IXgQ63-6XQR59-qgpRRe4o",
  "pdfSize": "803225"
}