{
  "id": "2412.18779",
  "title": "Integrating Zero-Shot Classification to Advance Long COVID Literature: A\n  Systematic Social Media-Centered Review",
  "authors": "Nirmalya Thakur",
  "authorsParsed": [
    [
      "Thakur",
      "Nirmalya",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 25 Dec 2024 05:01:17 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735102877000,
  "abstract": "  Long COVID continues to challenge public health by affecting a significant\nsegment of individuals who have recovered from acute SARS-CoV-2 infection yet\nendure prolonged and often debilitating symptoms. Social media has emerged as a\nvital resource for those seeking real-time information, peer support, and\nvalidating their health concerns related to Long COVID. This paper examines\nrecent works focusing on mining, analyzing, and interpreting user-generated\ncontent on social media platforms such as Twitter, Reddit, Facebook, and\nYouTube to capture the broader discourse on persistent post-COVID conditions. A\nnovel transformer-based zero-shot learning approach serves as the foundation\nfor classifying research papers in this area into four primary categories:\nClinical or Symptom Characterization, Advanced NLP or Computational Methods,\nPolicy, Advocacy, or Public Health Communication, and Online Communities and\nSocial Support. This methodology showcases the adaptability of advanced\nlanguage models in categorizing research papers without predefined training\nlabels, thus enabling a more rapid and scalable assessment of existing\nliterature. This review highlights the multifaceted nature of Long COVID\nresearch, where computational techniques applied to social media data reveal\ninsights into narratives of individuals suffering from Long COVID. This review\nalso demonstrates the capacity of social media analytics to inform clinical\npractice and contribute to policy-making related to Long COVID.\n",
  "subjects": [
    "Computer Science/Social and Information Networks"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "LWFqhu5dxKgY5Q_tD0zDvk4ehDMCN07OHFzdV6iXKho",
  "pdfSize": "480467"
}