{
  "id": "2412.17523",
  "title": "Constructing Fair Latent Space for Intersection of Fairness and\n  Explainability",
  "authors": "Hyungjun Joo, Hyeonggeun Han, Sehwan Kim, Sangwoo Hong, Jungwoo Lee",
  "authorsParsed": [
    [
      "Joo",
      "Hyungjun",
      ""
    ],
    [
      "Han",
      "Hyeonggeun",
      ""
    ],
    [
      "Kim",
      "Sehwan",
      ""
    ],
    [
      "Hong",
      "Sangwoo",
      ""
    ],
    [
      "Lee",
      "Jungwoo",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 12:47:04 GMT"
    },
    {
      "version": "v2",
      "created": "Mon, 20 Jan 2025 05:44:07 GMT"
    }
  ],
  "updateDate": "2025-01-22",
  "timestamp": 1734958024000,
  "abstract": "  As the use of machine learning models has increased, numerous studies have\naimed to enhance fairness. However, research on the intersection of fairness\nand explainability remains insufficient, leading to potential issues in gaining\nthe trust of actual users. Here, we propose a novel module that constructs a\nfair latent space, enabling faithful explanation while ensuring fairness. The\nfair latent space is constructed by disentangling and redistributing labels and\nsensitive attributes, allowing the generation of counterfactual explanations\nfor each type of information. Our module is attached to a pretrained generative\nmodel, transforming its biased latent space into a fair latent space.\nAdditionally, since only the module needs to be trained, there are advantages\nin terms of time and cost savings, without the need to train the entire\ngenerative model. We validate the fair latent space with various fairness\nmetrics and demonstrate that our approach can effectively provide explanations\nfor biased decisions and assurances of fairness.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "FjDRMOMo32a_IwPPf_Bhr3-x-vFtaBwS43WfjiGlm8k",
  "pdfSize": "5559597"
}