{
  "id": "2412.19309",
  "title": "NNLO QCD corrections to unpolarized and polarized SIDIS",
  "authors": "Saurav Goyal, Roman N. Lee, Sven-Olaf Moch, Vaibhav Pathak, Narayan\n  Rana, V. Ravindran",
  "authorsParsed": [
    [
      "Goyal",
      "Saurav",
      ""
    ],
    [
      "Lee",
      "Roman N.",
      ""
    ],
    [
      "Moch",
      "Sven-Olaf",
      ""
    ],
    [
      "Pathak",
      "Vaibhav",
      ""
    ],
    [
      "Rana",
      "Narayan",
      ""
    ],
    [
      "Ravindran",
      "V.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 26 Dec 2024 18:16:32 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735236992000,
  "abstract": "  The semi-inclusive deep-inelastic scattering (SIDIS) process requires the\npresence of an identified hadron H$'$ in the final state, which arises from the\nscattering of a lepton with an initial hadron P. By employing factorization in\nquantum chromodynamics (QCD), SIDIS provides essential knowledge on the hadron\nstructure, enabling the exploration of parton distribution functions (PDFs) and\nfragmentation functions (FFs). The coefficient functions for SIDIS can be\ncalculated in perturbative QCD and are currently known to the\nnext-to-next-to-leading order (NNLO) for the cases, where the incoming lepton\nand the hadron P are either both polarized or unpolarized. We present a\ndetailed description of these NNLO computations, including a thorough\ndiscussion of all the partonic channels, the calculation of the amplitudes and\nmaster integrals for the phase-space integration as well as the renormalization\nof ultraviolet divergences and mass factorization of infrared divergences in\ndimensional regularization through NNLO. We provide an extensive\nphenomenological analysis of the effects of NNLO corrections on SIDIS cross\nsections for different PDFs and FFs and various kinematics, including those of\nthe future Electron-Ion Collider (EIC). We find that these corrections are not\nonly significant but also crucial for reducing the dependence on the\nrenormalization and factorization scales $\\mu_R$ and $\\mu_F$ to obtain stable\npredictions.\n",
  "subjects": [
    "Physics/High Energy Physics - Phenomenology",
    "Physics/High Energy Physics - Experiment",
    "Physics/High Energy Physics - Theory"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "w6jBSr9sziG-rjwUMJllMO4m7Oc_QEUN75JAdAEFYI8",
  "pdfSize": "2486251"
}