{
  "id": "2412.07627",
  "title": "Terabit-class coherent communications enabled by an integrated photonics\n  erbium doped amplifier",
  "authors": "Di Che, Stefano Grillanda, Yang Liu, Zheru Qiu, Xinru Ji, Gregory\n  Raybon, Xi Chen, Kwangwoong Kim, Tobias J. Kippenberg, Andrea Blanco-Redondo",
  "authorsParsed": [
    [
      "Che",
      "Di",
      ""
    ],
    [
      "Grillanda",
      "Stefano",
      ""
    ],
    [
      "Liu",
      "Yang",
      ""
    ],
    [
      "Qiu",
      "Zheru",
      ""
    ],
    [
      "Ji",
      "Xinru",
      ""
    ],
    [
      "Raybon",
      "Gregory",
      ""
    ],
    [
      "Chen",
      "Xi",
      ""
    ],
    [
      "Kim",
      "Kwangwoong",
      ""
    ],
    [
      "Kippenberg",
      "Tobias J.",
      ""
    ],
    [
      "Blanco-Redondo",
      "Andrea",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 16:07:34 GMT"
    },
    {
      "version": "v2",
      "created": "Thu, 9 Jan 2025 12:26:49 GMT"
    }
  ],
  "updateDate": "2025-01-10",
  "timestamp": 1733846854000,
  "abstract": "  Coherent technologies have revolutionized optical communications, driving the\ncapacity per fiber to multi-terabit per second (Tb/s) in combination with\nwavelength division multiplexing (WDM). With an ever-increasing deployment\ndensity of coherent systems, the demand for highly integrated WDM coherent\ntransceivers has been rising. While tremendous progress has been made on\nsilicon photonics compatible high-speed modulation and photodetection on chip,\na solution for monolithically integrable amplifier with high gain and output\npower remains a challenge. Recently, an erbium doped waveguide amplifier based\non ultra-low loss silicon nitride waveguides has demonstrated gain and output\npower levels potentially suitable for Terabit class coherent communications.\nHere, we demonstrate a WDM coherent system enabled by this integrated photonic\namplification solution. The system uses the waveguide amplifier as a booster\namplifier of 16 WDM signals each carrying a net data rate of 1.6 Tb/s,\nachieving 25.6-Tb/s net capacity over 81-km fiber transmission. Our results\nhighlight a fully integrated solution for highly parallel coherent transceivers\nincluding amplification, that has the potential to transform future optical\ncommunications.\n",
  "subjects": [
    "Physics/Optics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "yz6Z8L3rpcvGyRC0NXA99sB_YdHvDqDtGF8FyUlyryA",
  "pdfSize": "846899"
}