{
  "id": "2412.05816",
  "title": "Real-Time Prediction for Athletes' Psychological States Using\n  BERT-XGBoost: Enhancing Human-Computer Interaction",
  "authors": "Chenming Duan, Zhitao Shu, Jingsi Zhang, Feng Xue",
  "authorsParsed": [
    [
      "Duan",
      "Chenming",
      ""
    ],
    [
      "Shu",
      "Zhitao",
      ""
    ],
    [
      "Zhang",
      "Jingsi",
      ""
    ],
    [
      "Xue",
      "Feng",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 8 Dec 2024 04:59:00 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733633940000,
  "abstract": "  Understanding and predicting athletes' mental states is crucial for\noptimizing sports performance. This study introduces a hybrid BERT-XGBoost\nmodel to analyze psychological factors such as emotions, anxiety, and stress,\nand predict their impact on performance. By combining BERT's bidirectional\ncontextual learning with XGBoost's classification efficiency, the model\nachieves high accuracy (94%) in identifying psychological patterns from both\nstructured and unstructured data, including self-reports and observational data\ntagged with categories like emotional balance and stress. The model also\nincorporates real-time monitoring and feedback mechanisms to provide\npersonalized interventions based on athletes' psychological states. Designed to\nengage athletes intuitively, the system adapts its feedback dynamically to\npromote emotional well-being and performance enhancement. By analyzing\nemotional trajectories in real-time offers empathetic, proactive interactions.\nThis approach optimizes performance outcomes and ensures continuous monitoring\nof mental health, improving human-computer interaction and providing an\nadaptive, user-centered model for psychological support in sports.\n",
  "subjects": [
    "Computer Science/Human-Computer Interaction"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "TiaMGYMwv5RNtBUtKMkDhAG0DeDsseoLDSmoLBrTEg0",
  "pdfSize": "202860"
}