{
  "id": "2412.11839",
  "title": "Evaluating the Efficacy of Vectocardiographic and ECG Parameters for\n  Efficient Tertiary Cardiology Care Allocation Using Decision Tree Analysis",
  "authors": "Lucas Jos\\'e da Costa, Vinicius Ruiz Uemoto, Mariana F. N. de Marchi,\n  Renato de Aguiar Hortegal, Renata Valeri de Freitas",
  "authorsParsed": [
    [
      "da Costa",
      "Lucas José",
      ""
    ],
    [
      "Uemoto",
      "Vinicius Ruiz",
      ""
    ],
    [
      "de Marchi",
      "Mariana F. N.",
      ""
    ],
    [
      "Hortegal",
      "Renato de Aguiar",
      ""
    ],
    [
      "de Freitas",
      "Renata Valeri",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 15:01:53 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734361313000,
  "abstract": "  Use real word data to evaluate the performance of the electrocardiographic\nmarkers of GEH as features in a machine learning model with Standard ECG\nfeatures and Risk Factors in Predicting Outcome of patients in a population\nreferred to a tertiary cardiology hospital.\n  Patients forwarded to specific evaluation in a cardiology specialized\nhospital performed an ECG and a risk factor anamnesis. A series of follow up\nattendances occurred in periods of 6 months, 12 months and 15 months to check\nfor cardiovascular related events (mortality or new nonfatal cardiovascular\nevents (Stroke, MI, PCI, CS), as identified during 1-year phone follow-ups.\n  The first attendance ECG was measured by a specialist and processed in order\nto obtain the global electric heterogeneity (GEH) using the Kors Matriz. The\nECG measurements, GEH parameters and risk factors were combined for training\nmultiple instances of XGBoost decision trees models. Each instance were\noptmized for the AUCPR and the instance with higher AUC is chosen as\nrepresentative to the model. The importance of each parameter for the winner\ntree model was compared to better understand the improvement from using GEH\nparameters.\n  The GEH parameters turned out to have statistical significance for this\npopulation specially the QRST angle and the SVG. The combined model with the\ntree parameters class had the best performance. The findings suggest that using\nVCG features can facilitate more accurate identification of patients who\nrequire tertiary care, thereby optimizing resource allocation and improving\npatient outcomes. Moreover, the decision tree model's transparency and ability\nto pinpoint critical features make it a valuable tool for clinical\ndecision-making and align well with existing clinical practices.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Signal Processing",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "NWP1RE9R5I-Fuxe8MQdATkhjl0eHLI1s24VsoZwjADo",
  "pdfSize": "1931915"
}