{
  "id": "2412.07253",
  "title": "CapGen:An Environment-Adaptive Generator of Adversarial Patches",
  "authors": "Chaoqun Li, Zhuodong Liu, Huanqian Yan, Hang Su",
  "authorsParsed": [
    [
      "Li",
      "Chaoqun",
      ""
    ],
    [
      "Liu",
      "Zhuodong",
      ""
    ],
    [
      "Yan",
      "Huanqian",
      ""
    ],
    [
      "Su",
      "Hang",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 07:24:24 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733815464000,
  "abstract": "  Adversarial patches, often used to provide physical stealth protection for\ncritical assets and assess perception algorithm robustness, usually neglect the\nneed for visual harmony with the background environment, making them easily\nnoticeable. Moreover, existing methods primarily concentrate on improving\nattack performance, disregarding the intricate dynamics of adversarial patch\nelements. In this work, we introduce the Camouflaged Adversarial Pattern\nGenerator (CAPGen), a novel approach that leverages specific base colors from\nthe surrounding environment to produce patches that seamlessly blend with their\nbackground for superior visual stealthiness while maintaining robust\nadversarial performance. We delve into the influence of both patterns (i.e.,\ncolor-agnostic texture information) and colors on the effectiveness of attacks\nfacilitated by patches, discovering that patterns exert a more pronounced\neffect on performance than colors. Based on these findings, we propose a rapid\ngeneration strategy for adversarial patches. This involves updating the colors\nof high-performance adversarial patches to align with those of the new\nenvironment, ensuring visual stealthiness without compromising adversarial\nimpact. This paper is the first to comprehensively examine the roles played by\npatterns and colors in the context of adversarial patches.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "NuxEfSmjG8_tl0KdTySOe_IUSp-XDDzoYjD3YoLrfsU",
  "pdfSize": "15033675"
}