{"id":"2412.17020","title":"Optical evidence of the band reconstruction during the charge-density\n  wave transition in annealed Kagome magnet FeGe","authors":"A. Zhang, X. -L. Wu, R. Yang, A. -F. Wang, Y. -M. Dai, and Z. -X. Shi","authorsParsed":[["Zhang","A.",""],["Wu","X. -L.",""],["Yang","R.",""],["Wang","A. -F.",""],["Dai","Y. -M.",""],["Shi","Z. -X.",""]],"versions":[{"version":"v1","created":"Sun, 22 Dec 2024 13:51:57 GMT"}],"updateDate":"2024-12-24","timestamp":1734875517000,"abstract":"  In Kagome magnet FeGe, the coexistence of electron correlation,\ncharge-density wave (CDW), and magnetism renders it ideal to study their\ninteractions. Here, we combined the optical spectroscopy and the\nfirst-principles calculations to investigate the band structures of FeGe\nannealed at different temperatures. Our observations reveal that the sample\nannealed at 320C experienced dramatic change in optical conductivity following\nthe CDW transition. Specifically, a substantial portion of the spectral weight\n(SW) in the low-energy region ( < 0.4 eV) was redistributed to the high-energy\nregion (0.8 - 1.5 eV), suggesting a reconstruction of the band structure. The\nsample annealed at 560 C did not exhibit a CDW transition, but its SW transfer\noccurred progressively from 300 to 5 K. We noticed that: i) after the CDW\ntransition, the sample annealed at 320 C showed similar tendency of SW transfer\nto that of the 560 C annealed sample; ii) the high-energy SW of both materials\ndisplayed a temperature dependence consistent with the magnetic roperties.\nCombining the first-principles calculations, we attribute the SW transfer to\nthe band reconstruction triggered by the distortion of Ge1 atoms induced either\nby annealing at 560C or by the CDW transitions. This lattice distortion affects\nthe energies of Fe 3d orbitals. Under the influence of Hund's rule coupling,\nthe magnetic moment of Fe atoms is enhanced. Our findings elucidate the\ninteractions among charge, lattice, and spin in FeGe, offering pivotal insights\nto modulate properties of this Kagome magnet.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Superconductivity"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ZcFGhjG6uxbn3qskWEznt-BSMjhnvnVXh_nC-jvhHT8","pdfSize":"5603666"}