{
  "id": "2412.12423",
  "title": "GG-SSMs: Graph-Generating State Space Models",
  "authors": "Nikola Zubi\\'c and Davide Scaramuzza",
  "authorsParsed": [
    [
      "Zubić",
      "Nikola",
      ""
    ],
    [
      "Scaramuzza",
      "Davide",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 00:07:29 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734394049000,
  "abstract": "  State Space Models (SSMs) are powerful tools for modeling sequential data in\ncomputer vision and time series analysis domains. However, traditional SSMs are\nlimited by fixed, one-dimensional sequential processing, which restricts their\nability to model non-local interactions in high-dimensional data. While methods\nlike Mamba and VMamba introduce selective and flexible scanning strategies,\nthey rely on predetermined paths, which fails to efficiently capture complex\ndependencies. We introduce Graph-Generating State Space Models (GG-SSMs), a\nnovel framework that overcomes these limitations by dynamically constructing\ngraphs based on feature relationships. Using Chazelle's Minimum Spanning Tree\nalgorithm, GG-SSMs adapt to the inherent data structure, enabling robust\nfeature propagation across dynamically generated graphs and efficiently\nmodeling complex dependencies. We validate GG-SSMs on 11 diverse datasets,\nincluding event-based eye-tracking, ImageNet classification, optical flow\nestimation, and six time series datasets. GG-SSMs achieve state-of-the-art\nperformance across all tasks, surpassing existing methods by significant\nmargins. Specifically, GG-SSM attains a top-1 accuracy of 84.9% on ImageNet,\noutperforming prior SSMs by 1%, reducing the KITTI-15 error rate to 2.77%, and\nimproving eye-tracking detection rates by up to 0.33% with fewer parameters.\nThese results demonstrate that dynamic scanning based on feature relationships\nsignificantly improves SSMs' representational power and efficiency, offering a\nversatile tool for various applications in computer vision and beyond.\n",
  "subjects": [
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "KETcJUFTTYLLYMfoIkbKztdxJR29VhaEbdNh866WY2Y",
  "pdfSize": "523316"
}