{"id":"2412.06106","title":"Enhanced Computationally Efficient Long LoRA Inspired Perceiver\n  Architectures for Auto-Regressive Language Modeling","authors":"Kaleel Mahmood and Shaoyi Huang","authorsParsed":[["Mahmood","Kaleel",""],["Huang","Shaoyi",""]],"versions":[{"version":"v1","created":"Sun, 8 Dec 2024 23:41:38 GMT"}],"updateDate":"2024-12-10","timestamp":1733701298000,"abstract":"  The Transformer architecture has revolutionized the Natural Language\nProcessing field and is the backbone of Large Language Models (LLMs). The\nTransformer uses the attention mechanism that computes the pair-wise similarity\nbetween its input tokens to produce latent vectors that are able to understand\nthe semantic meaning of the input text. One of the challenges in the\nTransformer architecture is the quadratic complexity of the attention mechanism\nthat prohibits the efficient processing of long sequence lengths. While many\nrecent research works have attempted to provide a reduction from $O(n^2)$ time\ncomplexity of attention to semi-linear complexity, it remains an unsolved\nproblem in the sense of maintaining a high performance when such complexity is\nreduced. One of the important works in this respect is the Perceiver class of\narchitectures that have demonstrated excellent performance while reducing the\ncomputation complexity. In this paper, we use the PerceiverAR that was proposed\nfor Auto-Regressive modeling as a baseline, and provide three different\narchitectural enhancements to it with varying computation overhead tradeoffs.\nInspired by the recently proposed efficient attention computation approach of\nLong-LoRA, we then present an equally efficient Perceiver-based architecture\n(termed as Long LoRA Pereceiver - LLP) that can be used as the base\narchitecture in LLMs instead of just a fine-tuning add-on. Our results on\ndifferent benchmarks indicate impressive improvements compared to recent\nTransformer based models.\n","subjects":["Computer Science/Computation and Language","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"mGV70DSKWTDcx53UHTXvsAaTpCFy-oMqmm_lEygKjvo","pdfSize":"909710"}