{"id":"2412.13049","title":"TIMESAFE: Timing Interruption Monitoring and Security Assessment for\n  Fronthaul Environments","authors":"Joshua Groen, Simone Di Valerio, Imtiaz Karim, Davide Villa, Yiewi\n  Zhang, Leonardo Bonati, Michele Polese, Salvatore D'Oro, Tommaso Melodia,\n  Elisa Bertino, Francesca Cuomo, Kaushik Chowdhury","authorsParsed":[["Groen","Joshua",""],["Di Valerio","Simone",""],["Karim","Imtiaz",""],["Villa","Davide",""],["Zhang","Yiewi",""],["Bonati","Leonardo",""],["Polese","Michele",""],["D'Oro","Salvatore",""],["Melodia","Tommaso",""],["Bertino","Elisa",""],["Cuomo","Francesca",""],["Chowdhury","Kaushik",""]],"versions":[{"version":"v1","created":"Tue, 17 Dec 2024 16:13:37 GMT"}],"updateDate":"2024-12-18","timestamp":1734452017000,"abstract":"  5G and beyond cellular systems embrace the disaggregation of Radio Access\nNetwork (RAN) components, exemplified by the evolution of the fronthual (FH)\nconnection between cellular baseband and radio unit equipment. Crucially,\nsynchronization over the FH is pivotal for reliable 5G services. In recent\nyears, there has been a push to move these links to an Ethernet-based packet\nnetwork topology, leveraging existing standards and ongoing research for\nTime-Sensitive Networking (TSN). However, TSN standards, such as Precision Time\nProtocol (PTP), focus on performance with little to no concern for security.\nThis increases the exposure of the open FH to security risks. Attacks targeting\nsynchronization mechanisms pose significant threats, potentially disrupting 5G\nnetworks and impairing connectivity.\n  In this paper, we demonstrate the impact of successful spoofing and replay\nattacks against PTP synchronization. We show how a spoofing attack is able to\ncause a production-ready O-RAN and 5G-compliant private cellular base station\nto catastrophically fail within 2 seconds of the attack, necessitating manual\nintervention to restore full network operations. To counter this, we design a\nMachine Learning (ML)-based monitoring solution capable of detecting various\nmalicious attacks with over 97.5% accuracy.\n","subjects":["Computer Science/Networking and Internet Architecture","Computer Science/Cryptography and Security","Computer Science/Machine Learning","Computer Science/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"hlZHMbB9A_q3I-I0Gp-FNBnJSoaZThbvjwwEE32wvIw","pdfSize":"2905344"}