{
  "id": "2412.07531",
  "title": "Multifunctional Portable Optical Measuring Instrument Based on Y-Fiber\n  Optics",
  "authors": "Juntao He, Yikai Dang, Haoqi Wang, Shaohua Wang, Yingke Li, Ruiyun Ma,\n  Yingyuan Li, Peilin Gao, Jianguo Cao, Yong Pan",
  "authorsParsed": [
    [
      "He",
      "Juntao",
      ""
    ],
    [
      "Dang",
      "Yikai",
      ""
    ],
    [
      "Wang",
      "Haoqi",
      ""
    ],
    [
      "Wang",
      "Shaohua",
      ""
    ],
    [
      "Li",
      "Yingke",
      ""
    ],
    [
      "Ma",
      "Ruiyun",
      ""
    ],
    [
      "Li",
      "Yingyuan",
      ""
    ],
    [
      "Gao",
      "Peilin",
      ""
    ],
    [
      "Cao",
      "Jianguo",
      ""
    ],
    [
      "Pan",
      "Yong",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 14:09:56 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733839796000,
  "abstract": "  Based on grating diffraction principle, optical fiber transmission principle\nand optical interference principle, a multi-functional portable optical\nmeasuring instrument is constructed in this paper. The optical measurement\nvisualization spectrometer based on CCD photoelectric image sensor is designed\nand assembled. The \"Y\" optical signal transmission fiber optical path suitable\nfor multi-function measurement is improved and designed. The multi-function\noptical measurement system is built by combining with remote controlled\nmulti-color LED lights. The spectral analysis, solution concentration\nmonitoring and film thickness measurement are realized. The experimental\nresults show that the observable wavelength range of the spectrometer is about\n340-1050nm and the resolution is 1nm. The solution concentration can be\nobtained by measuring absorbance with optical fiber spectrometer. The film\nthickness measuring instrument can accurately measure the thickness of the\nmicron film, and the measurement accuracy can reach 1.25 {\\mu}m. It is proved\nthat the instrument integrates multiple functions, has high measurement\naccuracy and wide range, and realizes non-contact measurement.\n",
  "subjects": [
    "Physics/Optics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Qkf1dWvmWqKwVmaeyy_xMYjt4gWyQgQ5hxfWO550ufQ",
  "pdfSize": "934803"
}