{
  "id": "2412.06214",
  "title": "Femtosecond laser processing for blast-hole analysis: laser removal of\n  slurry and effect on rocks",
  "authors": "Julia Brand, Ksenia Maximova, Steve Madden, Andrei V. Rode, Ehsan\n  Mihankhah, John Zigman, Andrew J. Hill, Ludovic Rapp",
  "authorsParsed": [
    [
      "Brand",
      "Julia",
      ""
    ],
    [
      "Maximova",
      "Ksenia",
      ""
    ],
    [
      "Madden",
      "Steve",
      ""
    ],
    [
      "Rode",
      "Andrei V.",
      ""
    ],
    [
      "Mihankhah",
      "Ehsan",
      ""
    ],
    [
      "Zigman",
      "John",
      ""
    ],
    [
      "Hill",
      "Andrew J.",
      ""
    ],
    [
      "Rapp",
      "Ludovic",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 05:19:58 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733721598000,
  "abstract": "  This study investigates the possibility of using a femtosecond pulse laser to\nremove iron ore slurry used to stabilise blast-hole structures by mining\nindustries, intending to preserve the wall's stability and the chemical and\ncompositional properties of the underlying rock. In situ minerals are often\ncoated in other material deposits, such as dust or slurry in blast holes. To\nanalyse the rock materials beneath, its surface must be exposed by removal of\nthe surface layer. The ablation depth per pulse and ablation efficiency of the\nslurry were determined using femtosecond laser pulses. Then, the ablation of\nrocks of economic interest in Australia, including banded iron, limonite,\ngoethite, shale, and hematite, was studied to establish their ablation\nthresholds and rates. Any damage induced by the laser was investigated by\noptical microscopy, optical profilometry, colourimetry, VIS/NIR spectroscopy\nand Fourier Transform Infrared spectroscopy (FTIR).\n",
  "subjects": [
    "Physics/Applied Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "PwmGtY0vjp2raMXgy6l2K9469GOPt2IvZl4let_24Ks",
  "pdfSize": "9963805"
}