{"id":"2412.06903","title":"Time to Sparkler. Accurate ages of lensed globular clusters at $z=1.4$\n  with JWST photometry","authors":"Elena Tomasetti, Michele Moresco, Carmela Lardo, Fr\\'ed\\'eric Courbin,\n  Raul Jimenez, Licia Verde, Martin Millon, Andrea Cimatti","authorsParsed":[["Tomasetti","Elena",""],["Moresco","Michele",""],["Lardo","Carmela",""],["Courbin","Frédéric",""],["Jimenez","Raul",""],["Verde","Licia",""],["Millon","Martin",""],["Cimatti","Andrea",""]],"versions":[{"version":"v1","created":"Mon, 9 Dec 2024 19:00:19 GMT"}],"updateDate":"2024-12-11","timestamp":1733770819000,"abstract":"  Determining reliable ages for old stellar objects at different redshifts\noffers a powerful means to constrain cosmology without relying on a specific\ncosmological model: this is known as the cosmic clocks method. Globular\nclusters (GCs), long recognised as hosts of the Universe's oldest stars, have\nserved as the archetypical cosmic clocks. However, their age estimates have\ntraditionally been confined to redshift z=0, limiting their role to\nconstraining the present-day age of the Universe. Here we explore how to\nmeasure reliable ages of GCs well beyond $z=0$, leveraging their potential to\nextend cosmic clock measurements to earlier epochs. Specifically, we use 6-band\nJWST/NIRCam high-precision photometry of candidate stellar clusters in the\nSparkler galaxy, located at redshift $z$=1.378 and strongly lensed by the\ngalaxy cluster SMACS J0723.3-7327. By employing stellar population models\nwithin a Bayesian inference framework, we constrain the GCs' ages, star\nformation histories, metallicities, and dust attenuation. The five compact\nsources previously identified as GCs, based on their red spectral energy\ndistributions being consistent with the colours of old stellar systems, yield a\nformation age of $1.9\\pm0.4$ Gyr on average. This result implies a total age of\nthe Universe that aligns well with the $\\Lambda$CDM model derived from Planck18\ndata. Recent space-based observations have uncovered a wealth of lensed GCs as\nwell as globulars within the member galaxies of the clusters themselves. These\nfindings suggest that the pool of objects available for cosmic clock studies is\nenormous. A systematic multi-band photometric survey of GCs in and behind\ngalaxy clusters, using facilities like Euclid and JWST, would therefore be a\npowerful tool for estimating cluster ages across a large range of redshifts,\nallowing the Universe to be dated across an unprecedented range of epochs.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ejT-McgSaOsG32cg6iKPvCN9GZELkvJePlAXVmg94qE","pdfSize":"2055194"}