{"id":"2412.07954","title":"MOFHEI: Model Optimizing Framework for Fast and Efficient\n  Homomorphically Encrypted Neural Network Inference","authors":"Parsa Ghazvinian, Robert Podschwadt, Prajwal Panzade, Mohammad H.\n  Rafiei, Daniel Takabi","authorsParsed":[["Ghazvinian","Parsa",""],["Podschwadt","Robert",""],["Panzade","Prajwal",""],["Rafiei","Mohammad H.",""],["Takabi","Daniel",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 22:44:54 GMT"}],"updateDate":"2025-01-31","timestamp":1733870694000,"abstract":"  Due to the extensive application of machine learning (ML) in a wide range of\nfields and the necessity of data privacy, privacy-preserving machine learning\n(PPML) solutions have recently gained significant traction. One group of\napproaches relies on Homomorphic Encryption (HE), which enables us to perform\nML tasks over encrypted data. However, even with state-of-the-art HE schemes,\nHE operations are still significantly slower compared to their plaintext\ncounterparts and require a considerable amount of memory. Therefore, we propose\nMOFHEI, a framework that optimizes the model to make HE-based neural network\ninference, referred to as private inference (PI), fast and efficient. First,\nour proposed learning-based method automatically transforms a pre-trained ML\nmodel into its compatible version with HE operations, called the HE-friendly\nversion. Then, our iterative block pruning method prunes the model's parameters\nin configurable block shapes in alignment with the data packing method. This\nallows us to drop a significant number of costly HE operations, thereby\nreducing the latency and memory consumption while maintaining the model's\nperformance. We evaluate our framework through extensive experiments on\ndifferent models using various datasets. Our method achieves up to 98% pruning\nratio on LeNet, eliminating up to 93% of the required HE operations for\nperforming PI, reducing latency and the required memory by factors of 9.63 and\n4.04, respectively, with negligible accuracy loss.\n","subjects":["Computer Science/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"B3duZ70mHxB1L-jwGjK7YzEtgBeCzgwzBfpNSaDLzoM","pdfSize":"1874749"}