{"id":"2412.16988","title":"Distributed Target Tracking based on Localization with Linear\n  Time-Difference-of-Arrival Measurements: A Delay-Tolerant Networked\n  Estimation Approach","authors":"Mohammadreza Doostmohammadian, Themistoklis Charalambous","authorsParsed":[["Doostmohammadian","Mohammadreza",""],["Charalambous","Themistoklis",""]],"versions":[{"version":"v1","created":"Sun, 22 Dec 2024 12:07:12 GMT"}],"updateDate":"2024-12-24","timestamp":1734869232000,"abstract":"  This paper considers target tracking based on a beacon signal's\ntime-difference-of-arrival (TDOA) to a group of cooperating sensors. The\nsensors receive a reflected signal from the target where the time-of-arrival\n(TOA) renders the distance information. The existing approaches include: (i)\nclassic centralized solutions which gather and process the target data at a\ncentral unit, (ii) distributed solutions which assume that the target data is\nobservable in the dense neighborhood of each sensor (to be filtered locally),\nand (iii) double time-scale distributed methods with high rates of\ncommunication/consensus over the network. This work, in order to reduce the\nnetwork connectivity in (i)-(ii) and communication rate in (iii), proposes a\ndistributed single time-scale technique, which can also handle heterogeneous\nconstant data-exchange delays over the static sensor network. This work assumes\nonly distributed observability (in contrast to local observability in some\nexisting works categorized in (ii)), i.e., the target is observable globally\nover a (strongly) connected network. The (strong) connectivity further allows\nfor survivable network and $q$-redundant observer design. Each sensor locally\nshares information and processes the received data in its immediate\nneighborhood via local linear-matrix-inequalities (LMI) feedback gains to\nensure tracking error stability. The same gain matrix works in the presence of\nheterogeneous delays with no need of redesigning algorithms. Since most\nexisting distributed estimation scenarios are linear (based on consensus), many\nworks use linearization of the existing nonlinear TDOA measurement models where\nthe output matrix is a function of the target position.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computer Science/Social and Information Networks","Computer Science/Systems and Control","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"OddVb6qLEguWDUTRoh6q0IWApvVGSeb4kgLhimHAXm0","pdfSize":"1968944"}