{
  "id": "2412.11617",
  "title": "Dung's Argumentation Framework: Unveiling the Expressive Power with\n  Inconsistent Databases",
  "authors": "Yasir Mahmood and Markus Hecher and Axel-Cyrille Ngonga Ngomo",
  "authorsParsed": [
    [
      "Mahmood",
      "Yasir",
      ""
    ],
    [
      "Hecher",
      "Markus",
      ""
    ],
    [
      "Ngomo",
      "Axel-Cyrille Ngonga",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 10:01:18 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734343278000,
  "abstract": "  The connection between inconsistent databases and Dung's abstract\nargumentation framework has recently drawn growing interest. Specifically, an\ninconsistent database, involving certain types of integrity constraints such as\nfunctional and inclusion dependencies, can be viewed as an argumentation\nframework in Dung's setting. Nevertheless, no prior work has explored the exact\nexpressive power of Dung's theory of argumentation when compared to\ninconsistent databases and integrity constraints. In this paper, we close this\ngap by arguing that an argumentation framework can also be viewed as an\ninconsistent database. We first establish a connection between subset-repairs\nfor databases and extensions for AFs, considering conflict-free, naive,\nadmissible, and preferred semantics. Further, we define a new family of\nattribute-based repairs based on the principle of maximal content preservation.\nThe effectiveness of these repairs is then highlighted by connecting them to\nstable, semi-stable, and stage semantics. Our main contributions include\ntranslating an argumentation framework into a database together with integrity\nconstraints. Moreover, this translation can be achieved in polynomial time,\nwhich is essential in transferring complexity results between the two\nformalisms.\n",
  "subjects": [
    "Computer Science/Logic in Computer Science",
    "Computer Science/Databases"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Pek4UF5LyCSGqxemIPbGrKNv_LccItg4uLgVumcGUUQ",
  "pdfSize": "578857"
}