{"id":"2412.06521","title":"Ancient DNA from 120-Million-Year-Old Lycoptera Fossils Reveals\n  Evolutionary Insights","authors":"Wan-Qian Zhao, Zhan-Yong Guo, Zeng-Yuan Tian, Tong-Fu Su, Gang-Qiang\n  Cao, Zi-Xin Qi, Tian-Cang Qin, Wei Zhou, Jin-Yu Yang, Ming-Jie Chen, Xin-Ge\n  Zhang, Chun-Yan Zhou, Chuan-Jia Zhu, Meng-Fei Tang, Di Wu, Mei-Rong Song,\n  Yu-Qi Guo, Li-You Qiu, Fei Liang, Mei-Jun Li, Jun-Hui Geng, Li-Juan Zhao,\n  Shu-Jie Zhang","authorsParsed":[["Zhao","Wan-Qian",""],["Guo","Zhan-Yong",""],["Tian","Zeng-Yuan",""],["Su","Tong-Fu",""],["Cao","Gang-Qiang",""],["Qi","Zi-Xin",""],["Qin","Tian-Cang",""],["Zhou","Wei",""],["Yang","Jin-Yu",""],["Chen","Ming-Jie",""],["Zhang","Xin-Ge",""],["Zhou","Chun-Yan",""],["Zhu","Chuan-Jia",""],["Tang","Meng-Fei",""],["Wu","Di",""],["Song","Mei-Rong",""],["Guo","Yu-Qi",""],["Qiu","Li-You",""],["Liang","Fei",""],["Li","Mei-Jun",""],["Geng","Jun-Hui",""],["Zhao","Li-Juan",""],["Zhang","Shu-Jie",""]],"versions":[{"version":"v1","created":"Mon, 9 Dec 2024 14:25:43 GMT"}],"updateDate":"2024-12-10","timestamp":1733754343000,"abstract":"  High quality ancient DNA (aDNA) is essential for molecular paleontology. Due\nto DNA degradation and contamination by environmental DNA (eDNA), current\nresearch is limited to fossils less than 1 million years old. The study\nsuccessfully extracted DNA from Lycoptera davidi fossils from the Early\nCretaceous period, dating 120 million years ago. Using high-throughput\nsequencing, 1,258,901 DNA sequences were obtained. We established a rigorous\nprotocol known as the mega screen method. Using this method, we identified 243\noriginal in situ DNA (oriDNA) sequences, likely from the Lycoptera genome.\nThese sequences have an average length of over 100 base pairs and show no signs\nof deamination. Additionally, 10 transposase coding sequences were discovered,\nshedding light on a unique self-renewal mechanism in the genome. This study\nprovides valuable DNA data for understanding ancient fish evolution and\nadvances paleontological research.\n","subjects":["Quantitative Biology/Genomics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"FM6bdM0X1AqsV8IMfMwiWYpQ9_BQFJZO0mlhdL5CDIE","pdfSize":"1554979"}