{"id":"2412.17083","title":"Nonlinear stage of modulational instability in repulsive two-component\n  Bose-Einstein condensates","authors":"S. Mossman, S.I. Mistakidis, G. C. Katsimiga, A. Romero-Ros, G.\n  Biondini, P. Schmelcher, P. Engels, and P. G. Kevrekidis","authorsParsed":[["Mossman","S.",""],["Mistakidis","S. I.",""],["Katsimiga","G. C.",""],["Romero-Ros","A.",""],["Biondini","G.",""],["Schmelcher","P.",""],["Engels","P.",""],["Kevrekidis","P. G.",""]],"versions":[{"version":"v1","created":"Sun, 22 Dec 2024 16:27:56 GMT"},{"version":"v2","created":"Fri, 21 Feb 2025 20:06:17 GMT"}],"updateDate":"2025-02-25","timestamp":1734884876000,"abstract":"  Modulational instability (MI) is a fundamental phenomenon in the study of\nnonlinear dynamics, spanning diverse areas such as shallow water waves, optics,\nand ultracold atomic gases. In particular, the nonlinear stage of MI has\nrecently been a topic of intense exploration, and has been shown to manifest,\nin many cases, in the generation of dispersive shock waves (DSWs). In this\nwork, we experimentally probe the MI dynamics in an immiscible two-component\nultracold atomic gas with exclusively repulsive interactions, catalyzed by a\nhard-wall-like boundary produced by a repulsive optical barrier. We\nanalytically describe the expansion rate of the DSWs in this system,\ngeneralized to arbitrary inter-component interaction strengths and species\nratios. We observe excellent agreement among the analytical results, an\neffective 1D numerical model, full 3D numerical simulations, and experimental\ndata. Additionally, we extend this scenario to the interaction between two\ncounterpropagating DSWs, which leads to the production of Peregrine soliton\nstructures. These results further demonstrate the versatility of atomic\nplatforms towards the controlled realization of DSWs and rogue waves.\n","subjects":["Condensed Matter/Quantum Gases","Nonlinear Sciences/Pattern Formation and Solitons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"OdojpJjIEHuSqmwsfkYTDrP-Y3WKKf96pLZB2Mua7Rw","pdfSize":"2292087"}