{
  "id": "2412.14139",
  "title": "Alleviating cosmological tensions with a hybrid dark sector",
  "authors": "Elsa M. Teixeira, Gaspard Poulot, Carsten van de Bruck, Eleonora Di\n  Valentino, and Vivian Poulin",
  "authorsParsed": [
    [
      "Teixeira",
      "Elsa M.",
      ""
    ],
    [
      "Poulot",
      "Gaspard",
      ""
    ],
    [
      "van de Bruck",
      "Carsten",
      ""
    ],
    [
      "Di Valentino",
      "Eleonora",
      ""
    ],
    [
      "Poulin",
      "Vivian",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 18:37:30 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734547050000,
  "abstract": "  We investigate a cosmological model inspired by hybrid inflation, where two\nscalar fields representing dark energy (DE) and dark matter (DM) interact\nthrough a coupling that is proportional to the DE scalar field $1/\\phi$. The\nstrength of the coupling is governed solely by the initial condition of the\nscalar field, $\\phi_i$, which parametrises deviations from the standard\n$\\Lambda$CDM model. In this model, the scalar field tracks the behaviour of DM\nduring matter-domination until it transitions to DE while the DM component\ndecays quicker than standard CDM during matter-domination, and is therefore\ndifferent from some interacting DM-DE models which behaves like phantom dark\nenergy. Using \\textit{Planck} 2018 CMB data, DESI BAO measurements and\nPantheon+ supernova observations, we find that the model allows for an increase\nin $H_0$ that can help reduce the Hubble tension. In addition, we find that\nhigher values of the coupling parameter are correlated with lower values of\n$\\omega_m$, and a mild decrease of the weak-lensing parameter $S_8$,\npotentially relevant to address the $S_8$ tension. Bayesian model comparison,\nhowever, reveals inconclusive results for most datasets, unless S$H_0$ES data\nare included, in which case a moderate evidence in favour of the hybrid model\nis found.\n",
  "subjects": [
    "Astrophysics/Cosmology and Nongalactic Astrophysics",
    "Physics/General Relativity and Quantum Cosmology",
    "Physics/High Energy Physics - Theory"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "q3V42sNWVzecKIjm8f4nEeL4liSPrqO6uv9mMfzfF6M",
  "pdfSize": "4110511"
}