{"id":"2412.05795","title":"Massive geolocation data reveal evacuation behaviour during the 2024\n  Noto Peninsula earthquake and tsunami","authors":"Fumiyasu Makinoshima, Saki Yotsui, Shosuke Sato, Fumihiko Imamura","authorsParsed":[["Makinoshima","Fumiyasu",""],["Yotsui","Saki",""],["Sato","Shosuke",""],["Imamura","Fumihiko",""]],"versions":[{"version":"v1","created":"Sun, 8 Dec 2024 03:16:33 GMT"}],"updateDate":"2024-12-10","timestamp":1733627793000,"abstract":"  On 1 January 2024, devastating tsunamis caused by the Noto Peninsula\nearthquake hit coastal areas within several minutes, but only two tsunami\ncasualties were officially reported. Despite its importance, the cause of this\nunexpectedly low human loss was unclear because of the limited access to the\npeninsula and the presence of many visitors during the holiday, which made\nconducting conventional surveys infeasible. Here, we reveal evacuation\nbehaviour during the 2024 Noto Peninsula tsunami using massive geolocation data\ncollected from a smartphone app. By analysing these massive data, which include\nover 1.5 million records collected on this day, we find that the evacuation was\nextremely fast, occurring within 2--6 minutes after the origin time. Further\nanalyses suggest that these fast departures were driven mainly by strong ground\nshaking; the fact that the tsunami occurred during the family-oriented New Year\nholiday was also a key factor. Additionally, the long-term analysis of the data\nreveals that people started returning to the coastal area 20--100 minutes after\nthe origin time, which was long before the downgrading and cancellation of the\ntsunami warnings. These results highlight the utility of the innovative\ndata-driven approach to evacuation surveys, which addresses the limitations of\nconventional evacuation surveys.\n","subjects":["Physics/Physics and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"tEYivVAflF5Sv2JZuPw-2xuPug9e-BIA6vTQeiqlaVU","pdfSize":"8111199"}