{"id":"2412.03413","title":"Deep Learning for Sea Surface Temperature Reconstruction under Cloud\n  Occlusion","authors":"Andrea Asperti, Ali Aydogdu, Emanuela Clementi, Angelo Greco, Lorenzo\n  Mentaschi, Fabio Merizzi, Pietro Miraglio, Paolo Oddo, Nadia Pinardi,\n  Alessandro Testa","authorsParsed":[["Asperti","Andrea",""],["Aydogdu","Ali",""],["Clementi","Emanuela",""],["Greco","Angelo",""],["Mentaschi","Lorenzo",""],["Merizzi","Fabio",""],["Miraglio","Pietro",""],["Oddo","Paolo",""],["Pinardi","Nadia",""],["Testa","Alessandro",""]],"versions":[{"version":"v1","created":"Wed, 4 Dec 2024 15:49:49 GMT"}],"updateDate":"2024-12-05","timestamp":1733327389000,"abstract":"  Sea Surface Temperature (SST) is crucial for understanding Earth's oceans and\nclimate, significantly influencing weather patterns, ocean currents, marine\necosystem health, and the global energy balance. Large-scale SST monitoring\nrelies on satellite infrared radiation detection, but cloud cover presents a\nmajor challenge, creating extensive observational gaps and hampering our\nability to fully capture large-scale ocean temperature patterns. Efforts to\naddress these gaps in existing L4 datasets have been made, but they often\nexhibit notable local and seasonal biases, compromising data reliability and\naccuracy. To tackle this challenge, we employed deep neural networks to\nreconstruct cloud-covered portions of satellite imagery while preserving the\nintegrity of observed values in cloud-free areas, using MODIS satellite derived\nobservations of SST. Our best-performing architecture showed significant skill\nimprovements over established methodologies, achieving substantial reductions\nin error metrics when benchmarked against widely used approaches and datasets.\nThese results underscore the potential of advanced AI techniques to enhance the\ncompleteness of satellite observations in Earth-science remote sensing,\nproviding more accurate and reliable datasets for environmental assessments,\ndata-driven model training, climate research, and seamless integration into\nmodel data assimilation workflows.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"WMMUU0oISTm0PQmeDJ09gz4RoGYBa62dVNAf9fVvuf0","pdfSize":"1726145"}