{"id":"2412.13703","title":"MBInception: A new Multi-Block Inception Model for Enhancing Image\n  Processing Efficiency","authors":"Fatemeh Froughirad, Reza Bakhoda Eshtivani, Hamed Khajavi and Amir\n  Rastgoo","authorsParsed":[["Froughirad","Fatemeh",""],["Eshtivani","Reza Bakhoda",""],["Khajavi","Hamed",""],["Rastgoo","Amir",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 10:46:04 GMT"}],"updateDate":"2024-12-19","timestamp":1734518764000,"abstract":"  Deep learning models, specifically convolutional neural networks, have\ntransformed the landscape of image classification by autonomously extracting\nfeatures directly from raw pixel data. This article introduces an innovative\nimage classification model that employs three consecutive inception blocks\nwithin a convolutional neural networks framework, providing a comprehensive\ncomparative analysis with well-established architectures such as Visual\nGeometry Group, Residual Network, and MobileNet. Through the utilization of\nbenchmark datasets, including Canadian Institute for Advanced Researc, Modified\nNational Institute of Standards and Technology database, and Fashion Modified\nNational Institute of Standards and Technology database, we assess the\nperformance of our proposed model in comparison to these benchmarks. The\noutcomes reveal that our novel model consistently outperforms its counterparts\nacross diverse datasets, underscoring its effectiveness and potential for\nadvancing the current state-of-the-art in image classification. Evaluation\nmetrics further emphasize that the proposed model surpasses the other compared\narchitectures, thereby enhancing the efficiency of image classification on\nstandard datasets.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computer Science/Computer Vision and Pattern Recognition","Computer Science/Numerical Analysis","Mathematics/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"8j4Y8crQkgCUZOcqGMImOdE81t98xpL316OTvaorfVQ","pdfSize":"1512007"}