{
  "id": "2412.05982",
  "title": "Axion-photon-mixing dark matter conversion mediated by torsion mass\n  constrained by the Barbero-Immirzi parameter",
  "authors": "Zhi-Fu Gao (1) and Luiz C. Garcia de Andrade (2) ((1) Xinjiang\n  Astronomical Observatory, Chinese Academy of Sciences, Urumqi, Xinjiang, (2)\n  Departamento de Fisica Teorica-IFADT-UERJ, Brasil and Institute for Cosmology\n  and natural philosophy at Croatia)",
  "authorsParsed": [
    [
      "Gao",
      "Zhi-Fu",
      ""
    ],
    [
      "de Andrade",
      "Luiz C. Garcia",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 8 Dec 2024 16:08:08 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733674088000,
  "abstract": "  In the Standard Model\\,(SM) of particle physics, photon-torsion mixing is\nextended to include the Einstein-Cartan portal to dark-photon-axion-torsion\nmixing beyond the Standard Model\\,(BSM), mediated by torsion. The\nBarbero-Immirzi(BI) parameter, of the order of $10^{-31}$, is more stringent\nthan those obtained by Aliberti and Lambiase using matter-antimatter asymmetry.\nThis paper presents the coupling of the SM with dark matter\\,(DM) axions, both\nmediated by torsion. We discuss tordions, the quanta of torsion, and the\ndamping of propagating torsion. It is shown that with both kinds of vectorial\ntorsion masses, equations from Einstein-Cartan-Holst gravity can be derived,\nwhich reduce to axionic photon equations where torsion appears only through its\nmass spectrum. Photon-axion conversions and axion mixing are found to depend on\nthe BI parameter. This study demonstrates that when the spin-0 torsion mass is\nfinite and Proca electrodynamics is not ghost-free, dark axion masses align\nwith spin-0 torsion masses via axion-driven torsion and photon-torsion mixing.\nOur results provide innovative insights into Proca gravity models and the role\nof torsion in photon-axion conversion and dark matter dynamics, thereby\noffering a solid foundation for future research and new theoretical frameworks\nin quantum gravity.\n",
  "subjects": [
    "Physics/High Energy Physics - Phenomenology",
    "Physics/General Relativity and Quantum Cosmology"
  ],
  "license": "http://creativecommons.org/publicdomain/zero/1.0/",
  "blobId": "IHfbF5gUg3S4JNLjyAy3-hjzV-h-cxyx-ZB9W7w754U",
  "pdfSize": "174012"
}