{"id":"2412.01722","title":"Correspondence and Inverse Correspondence for Input/Output Logic and\n  Region-Based Theories of Space","authors":"Andrea De Domenico, Ali Farjami, Krishna Manoorkar, Alessandra\n  Palmigiano, Mattia Panettiere, Xiaolong Wang","authorsParsed":[["De Domenico","Andrea",""],["Farjami","Ali",""],["Manoorkar","Krishna",""],["Palmigiano","Alessandra",""],["Panettiere","Mattia",""],["Wang","Xiaolong",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 17:11:05 GMT"}],"updateDate":"2024-12-03","timestamp":1733159465000,"abstract":"  We further develop the algebraic approach to input/output logic initiated in\n\\cite{wollic22}, where subordination algebras and a family of their\ngeneralizations were proposed as a semantic environment of various input/output\nlogics. In particular: we extend the modal characterizations of a finite number\nof well known conditions on normative and permission systems, as well as on\nsubordination, precontact, and dual precontact algebras developed in\n\\cite{de2024obligations}, to those corresponding to the infinite class of {\\em\nclopen-analytic inequalities} in a modal language consisting both of positive\nand of negative unary modal operators; we characterize the syntactic shape of\nfirst-order conditions on algebras endowed with subordination, precontact, and\ndual precontact relations which guarantees these conditions to be the\nfirst-order correspondents of axioms in the modal language above; we introduce\nalgorithms for computing the first-order correspondents of modal axioms on\nalgebras endowed with subordination, precontact, and dual precontact relations,\nand conversely, for computing the modal axioms of which the conditions\nsatisfying the suitable syntactic shape are the first-order correspondents;\nfinally, we extend Celani's dual characterization results between subordination\nlattices and subordination spaces to a wider environment which also encompasses\nprecontact and dual precontact relations, and relative to an infinite class of\nfirst order conditions relating subordination, precontact and dual precontact\nrelations on distributive lattices. The modal characterizations established in\nthe present paper pave the way to establishing faithful embeddings for infinite\nclasses of input/output logics, and hence to their implementation in LogiKEy,\nIsabelle/HOL, Lean, or other interactive systems.\n","subjects":["Computer Science/Logic in Computer Science","Mathematics/Logic"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"tkJdQtZHNJG_kOk0DDHItLwQKw0GtSU_jHZWZzqYRZs","pdfSize":"518119"}