{
  "id": "2412.07402",
  "title": "Non-Progressive Influence Maximization in Dynamic Social Networks",
  "authors": "Yunming Hui and Shihan Wang and Melisachew Wudage Chekol and Stevan\n  Rudinac and Inez Maria Zwetsloot",
  "authorsParsed": [
    [
      "Hui",
      "Yunming",
      ""
    ],
    [
      "Wang",
      "Shihan",
      ""
    ],
    [
      "Chekol",
      "Melisachew Wudage",
      ""
    ],
    [
      "Rudinac",
      "Stevan",
      ""
    ],
    [
      "Zwetsloot",
      "Inez Maria",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 10:52:32 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733827952000,
  "abstract": "  The influence maximization (IM) problem involves identifying a set of key\nindividuals in a social network who can maximize the spread of influence\nthrough their network connections. With the advent of geometric deep learning\non graphs, great progress has been made towards better solutions for the IM\nproblem. In this paper, we focus on the dynamic non-progressive IM problem,\nwhich considers the dynamic nature of real-world social networks and the\nspecial case where the influence diffusion is non-progressive, i.e., nodes can\nbe activated multiple times. We first extend an existing diffusion model to\ncapture the non-progressive influence propagation in dynamic social networks.\nWe then propose the method, DNIMRL, which employs deep reinforcement learning\nand dynamic graph embedding to solve the dynamic non-progressive IM problem. In\nparticular, we propose a novel algorithm that effectively leverages graph\nembedding to capture the temporal changes of dynamic networks and seamlessly\nintegrates with deep reinforcement learning. The experiments, on different\ntypes of real-world social network datasets, demonstrate that our method\noutperforms state-of-the-art baselines.\n",
  "subjects": [
    "Computer Science/Social and Information Networks",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "HYllA265_VbNYyvZ34hPVuXYFW9Fhk7Db4HwArlV1D4",
  "pdfSize": "1319934"
}