{
  "id": "2412.21058",
  "title": "Timelike and gravitational anomalous entanglement from the inner horizon",
  "authors": "Qiang Wen, Mingshuai Xu and Haocheng Zhong",
  "authorsParsed": [
    [
      "Wen",
      "Qiang",
      ""
    ],
    [
      "Xu",
      "Mingshuai",
      ""
    ],
    [
      "Zhong",
      "Haocheng",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 30 Dec 2024 16:20:24 GMT"
    },
    {
      "version": "v2",
      "created": "Thu, 9 Jan 2025 08:22:46 GMT"
    }
  ],
  "updateDate": "2025-01-10",
  "timestamp": 1735575624000,
  "abstract": "  In the context of the AdS$_3$/CFT$_2$, the boundary causal development and\nthe entanglement wedge of any boundary spacelike interval can be mapped to a\nthermal CFT$_2$ and a Rindler $\\widetilde{\\text{AdS}_3}$ respectively via\ncertain boundary and bulk Rindler transformations. Nevertheless, the Rindler\nmapping is not confined in the entanglement wedges. While the outer horizon of\nthe Rindler $\\widetilde{\\text{AdS}_3}$ is mapped to the RT surface, we also\nidentify the pre-image of the inner horizon in the original AdS$_3$, which we\ncall the inner RT surface. In this paper we give some new physical\ninterpretation for the inner RT surface. First, the inner RT surface breaks\ninto two pieces which anchor on the two tips of the causal development.\nFurthermore, we can take the two tips as the endpoints of a certain timelike\ninterval and the inner RT surface is exactly the spacelike geodesic that\nrepresents the real part of the so-called holographic timelike entanglement\nentropy (HTEE). We also identify a timelike geodesic at boundary of the\nextended entanglement wedge, which represents the imaginary part of the HTEE.\nSecond, in the duality between the topological massive gravity (TMG) and\ngravitational anomalous CFT$_2$, the entanglement entropy and the mixed state\ncorrelation that is dual to the entanglement wedge cross section (EWCS) receive\ncorrection from the Chern-Simons term in the TMG. We find that, the correction\nto the holographic entanglement entropy can be reproduced by the area of the\ninner RT surface with a proper regulation, while the mixed state correlation\ncan be represented by the saddle geodesic chord connecting the two pieces of\nthe inner RT surface of the mixed state we consider, which we call the inner\nEWCS. The equivalence between the twist on the RT surface and the length of\ninner RT surface is also discussed.\n",
  "subjects": [
    "Physics/High Energy Physics - Theory"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "UZUWGwaIMX2Qheuwdzq6WDAKEjfe8OJHXWho8-MZOA0",
  "pdfSize": "2544744"
}