{"id":"2412.01176","title":"Superhypergraph Neural Networks and Plithogenic Graph Neural Networks:\n  Theoretical Foundations","authors":"Takaaki Fujita","authorsParsed":[["Fujita","Takaaki",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 06:33:02 GMT"}],"updateDate":"2024-12-03","timestamp":1733121182000,"abstract":"  Hypergraphs extend traditional graphs by allowing edges to connect multiple\nnodes, while superhypergraphs further generalize this concept to represent even\nmore complex relationships. Neural networks, inspired by biological systems,\nare widely used for tasks such as pattern recognition, data classification, and\nprediction. Graph Neural Networks (GNNs), a well-established framework, have\nrecently been extended to Hypergraph Neural Networks (HGNNs), with their\nproperties and applications being actively studied. The Plithogenic Graph\nframework enhances graph representations by integrating multi-valued\nattributes, as well as membership and contradiction functions, enabling the\ndetailed modeling of complex relationships. In the context of handling\nuncertainty, concepts such as Fuzzy Graphs and Neutrosophic Graphs have gained\nprominence. It is well established that Plithogenic Graphs serve as a\ngeneralization of both Fuzzy Graphs and Neutrosophic Graphs. Furthermore, the\nFuzzy Graph Neural Network has been proposed and is an active area of research.\nThis paper establishes the theoretical foundation for the development of\nSuperHyperGraph Neural Networks (SHGNNs) and Plithogenic Graph Neural Networks,\nexpanding the applicability of neural networks to these advanced graph\nstructures. While mathematical generalizations and proofs are presented, future\ncomputational experiments are anticipated.\n","subjects":["Computer Science/Artificial Intelligence","Computer Science/Computational Engineering, Finance, and Science","Computer Science/Machine Learning","Mathematics/Combinatorics","Mathematics/Logic"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"y_giBZ8j7k21Y3D59fZYuSuTwAgfBfGd6h3SQwHUN9s","pdfSize":"935666"}