{
  "id": "2412.16612",
  "title": "The Tractability Border of Reachability in Simple Vector Addition\n  Systems with States",
  "authors": "Dmitry Chistikov, Wojciech Czerwi\\'nski, Filip Mazowiecki, {\\L}ukasz\n  Orlikowski, Henry Sinclair-Banks, Karol W\\k{e}grzycki",
  "authorsParsed": [
    [
      "Chistikov",
      "Dmitry",
      ""
    ],
    [
      "Czerwiński",
      "Wojciech",
      ""
    ],
    [
      "Mazowiecki",
      "Filip",
      ""
    ],
    [
      "Orlikowski",
      "Łukasz",
      ""
    ],
    [
      "Sinclair-Banks",
      "Henry",
      ""
    ],
    [
      "Węgrzycki",
      "Karol",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 21 Dec 2024 12:57:08 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734785828000,
  "abstract": "  Vector Addition Systems with States (VASS), equivalent to Petri nets, are a\nwell-established model of concurrency. The central algorithmic challenge in\nVASS is the reachability problem: is there a run from a given starting state\nand counter values to a given target state and counter values? When the input\nis encoded in binary, reachability is computationally intractable: even in\ndimension one, it is NP-hard.\n  In this paper, we comprehensively characterise the tractability border of the\nproblem when the input is encoded in unary. For our main result, we prove that\nreachability is NP-hard in unary encoded 3-VASS, even when structure is heavily\nrestricted to be a simple linear path scheme. This improves upon a recent\nresult of Czerwi\\'nski and Orlikowski (2022), in both the number of counters\nand expressiveness of the considered model, as well as answers open questions\nof Englert, Lazi\\'c, and Totzke (2016) and Leroux (2021).\n  The underlying graph structure of a simple linear path scheme (SLPS) is just\na path with self-loops at each node. We also study the exceedingly weak model\nof computation that is SPLS with counter updates in {-1,0,+1}. Here, we show\nthat reachability is NP-hard when the dimension is bounded by O(\\alpha(k)),\nwhere \\alpha is the inverse Ackermann function and k bounds the size of the\nSLPS.\n  We complement our result by presenting a polynomial-time algorithm that\ndecides reachability in 2-SLPS when the initial and target configurations are\nspecified in binary. To achieve this, we show that reachability in such\ninstances is well-structured: all loops, except perhaps for a constant number,\nare taken either polynomially many times or almost maximally. This extends the\nmain result of Englert, Lazi\\'c, and Totzke (2016) who showed the problem is in\nNL when the initial and target configurations are specified in unary.\n",
  "subjects": [
    "Computer Science/Formal Languages and Automata Theory",
    "Computer Science/Logic in Computer Science"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "bkQi64Rj4tkiyAkqiwHD53r3ZhvSxxlO0b2ZvsIzAiM",
  "pdfSize": "1272080"
}