{
  "id": "2412.12138",
  "title": "Atomistic catalyst polarization stemming hydrogen generation from CH4",
  "authors": "Sanmei Wang, Yong Zhou, Chunyang Ne, Hengxin Fang, Biao Wang, Chang Q\n  Sun",
  "authorsParsed": [
    [
      "Wang",
      "Sanmei",
      ""
    ],
    [
      "Zhou",
      "Yong",
      ""
    ],
    [
      "Ne",
      "Chunyang",
      ""
    ],
    [
      "Fang",
      "Hengxin",
      ""
    ],
    [
      "Wang",
      "Biao",
      ""
    ],
    [
      "Sun",
      "Chang Q",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 8 Dec 2024 06:35:47 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1733639747000,
  "abstract": "  As the extremely-sized nanocrystals and nanopores, an adatom M and atomic\nvacancy V exhibit extraordinary capability of catalysis with however little\nknowledge about the catalyst-reactant interfacial bonding dynamics. With the\naid of DFT calculations, we examined the dehydrogenization of a single CH4\nmolecule catalyzed using the Rh(111,100), W(110), Ru(0001) surfaces, and\nmonolayer graphene, with and without M or V. It is uncovered in the following\nthree components: (i) catalyst polarization due to atomic under- or\nhetero-coordination raises the valence band of the catalyst by bond contraction\nand atomistic dipolar MP and vacancy dipolar V formation; (ii) reactant bond\nelongation by the interplay of the MP-V = H attraction and MP-V = C repulsion\nwith the = denoting the negative pole of the MP-V; and (iii) reactant\nconversion, i.e., the scale of H-C elongation, the catalyst valence-band shift,\nthe adsorption energy, and the catalytic activity are proportional to the\ncharge quantity of the MP-V whose local electric field matters.\n",
  "subjects": [
    "Condensed Matter/Materials Science",
    "Physics/Chemical Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "rSND9zuIHicf1PKNhfRiy40Xd8exfeYMv874Msw5iaE",
  "pdfSize": "1967798"
}