{
  "id": "2412.03069",
  "title": "TokenFlow: Unified Image Tokenizer for Multimodal Understanding and\n  Generation",
  "authors": "Liao Qu, Huichao Zhang, Yiheng Liu, Xu Wang, Yi Jiang, Yiming Gao, Hu\n  Ye, Daniel K. Du, Zehuan Yuan, Xinglong Wu",
  "authorsParsed": [
    [
      "Qu",
      "Liao",
      ""
    ],
    [
      "Zhang",
      "Huichao",
      ""
    ],
    [
      "Liu",
      "Yiheng",
      ""
    ],
    [
      "Wang",
      "Xu",
      ""
    ],
    [
      "Jiang",
      "Yi",
      ""
    ],
    [
      "Gao",
      "Yiming",
      ""
    ],
    [
      "Ye",
      "Hu",
      ""
    ],
    [
      "Du",
      "Daniel K.",
      ""
    ],
    [
      "Yuan",
      "Zehuan",
      ""
    ],
    [
      "Wu",
      "Xinglong",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 06:46:55 GMT"
    }
  ],
  "updateDate": "2024-12-05",
  "timestamp": 1733294815000,
  "abstract": "  We present TokenFlow, a novel unified image tokenizer that bridges the\nlong-standing gap between multimodal understanding and generation. Prior\nresearch attempt to employ a single reconstruction-targeted Vector Quantization\n(VQ) encoder for unifying these two tasks. We observe that understanding and\ngeneration require fundamentally different granularities of visual information.\nThis leads to a critical trade-off, particularly compromising performance in\nmultimodal understanding tasks. TokenFlow addresses this challenge through an\ninnovative dual-codebook architecture that decouples semantic and pixel-level\nfeature learning while maintaining their alignment via a shared mapping\nmechanism. This design enables direct access to both high-level semantic\nrepresentations crucial for understanding tasks and fine-grained visual\nfeatures essential for generation through shared indices. Our extensive\nexperiments demonstrate TokenFlow's superiority across multiple dimensions.\nLeveraging TokenFlow, we demonstrate for the first time that discrete visual\ninput can surpass LLaVA-1.5 13B in understanding performance, achieving a 7.2\\%\naverage improvement. For image reconstruction, we achieve a strong FID score of\n0.63 at 384*384 resolution. Moreover, TokenFlow establishes state-of-the-art\nperformance in autoregressive image generation with a GenEval score of 0.55 at\n256*256 resolution, achieving comparable results to SDXL.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "XypqAHBQg2D8fNEO7ljePiorxAOANZGAc4X45bc5xpc",
  "pdfSize": "11963834"
}