{
  "id": "2412.00753",
  "title": "The ecological forecast horizon revisited: Potential, actual and\n  relative system predictability",
  "authors": "Marieke Wesselkamp, Jakob Albrecht, Ewan Pinnington, William J.\n  Castillo, Florian Pappenberger and Carsten F. Dormann",
  "authorsParsed": [
    [
      "Wesselkamp",
      "Marieke",
      ""
    ],
    [
      "Albrecht",
      "Jakob",
      ""
    ],
    [
      "Pinnington",
      "Ewan",
      ""
    ],
    [
      "Castillo",
      "William J.",
      ""
    ],
    [
      "Pappenberger",
      "Florian",
      ""
    ],
    [
      "Dormann",
      "Carsten F.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 1 Dec 2024 10:14:42 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733048082000,
  "abstract": "  Ecological forecasts are model-based statements about currently unknown\necosystem states in time or space. For a model forecast to be useful to inform\ndecision-makers, model validation and verification determine adequateness. The\nmeasure of forecast goodness that can be translated into a limit up to which a\nforecast is acceptable is known as the `forecast horizon'. While verification\nof meteorological models follows strict criteria with established metrics and\nforecast horizons, assessments of ecological forecasting models still remain\nexperiment-specific and forecast horizons are rarely reported. As such, users\nof ecological forecasts remain uninformed of how far into the future statements\ncan be trusted. In this work, we synthesise existing approaches, define\nempirical forecast horizons in a unified framework for assessing ecological\npredictability and offer recipes on their computation. We distinguish upper and\nlower boundary estimates of predictability limits, reflecting the model's\npotential and actual forecast horizon, and show how a benchmark model can help\ndetermine its relative forecast horizon. The approaches are demonstrated with\nfour case studies from population, ecosystem, and earth system research.\n",
  "subjects": [
    "Statistics/Applications",
    "Physics/Data Analysis, Statistics and Probability",
    "Quantitative Biology/Populations and Evolution",
    "Statistics/Methodology"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "iUKt-CSEkMSDpdriIV3lpgXMAvqhwFBme5vKTV1alVI",
  "pdfSize": "5076202"
}