{"id":"2412.14943","title":"Unveiling social vibrancy in urban spaces with app usage","authors":"Thomas Collins, Diogo Pacheco, Riccardo Di Clemente, Federico Botta","authorsParsed":[["Collins","Thomas",""],["Pacheco","Diogo",""],["Di Clemente","Riccardo",""],["Botta","Federico",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 15:23:26 GMT"}],"updateDate":"2024-12-20","timestamp":1734621806000,"abstract":"  Urban vibrancy is an important measure of the energetic nature of a city that\nis related to why and how people use urban spaces, and it is inherently\nconnected with our social behaviour. Increasingly, people use a wide range of\nmobile phone apps in their daily lives to connect socially, search for\ninformation, make decisions, and arrange travel, amongst many other reasons.\nHowever, the relationship between online app usage and urban vibrancy remains\nunclear, particularly regarding how sociospatial behaviours interact with urban\nfeatures. Here, we use app-usage data as a digital signature to investigate\nthis question. To do this, we use a high-resolution data source of mobile\nservice-level traffic volumes across eighteen cities in France. We investigate\nthe social component of cities using socially relevant urban features\nconstructed from OpenStreetMap 'Points of Interest'. We developed a methodology\nfor identifying and classifying multidimensional app usage time series based on\nsimilarity. We used these in predictive models to interpret the results for\neach city and across France. Across cities, there were spatial behavioural\narchetypes, characterised by multidimensional properties. We found patterns\nbetween the week and the weekend, and across cities, and the country. These\narchetypes correspond to changes in socially relevant urban features that\nimpact urban vibrancy. Our results add further evidence for the importance of\nusing computational approaches to understand urban environments, the use of\nsociological concepts in computational science, and urban vibrancy in cities.\n","subjects":["Computer Science/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"hRTuiNgp6LvHwUNhBuyDPVKVy78djXUutHlEl94A1Jg","pdfSize":"34530136"}