{
  "id": "2412.15067",
  "title": "General Form of Effective Operators from Hidden Sectors",
  "authors": "Aqeel Ahmed, Zackaria Chacko, Ina Flood, Can Kilic and Saereh Najjari",
  "authorsParsed": [
    [
      "Ahmed",
      "Aqeel",
      ""
    ],
    [
      "Chacko",
      "Zackaria",
      ""
    ],
    [
      "Flood",
      "Ina",
      ""
    ],
    [
      "Kilic",
      "Can",
      ""
    ],
    [
      "Najjari",
      "Saereh",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 17:17:05 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734628625000,
  "abstract": "  We perform a model-independent analysis of the dimension-six terms that are\ngenerated in the low energy effective theory when a hidden sector that\ncommunicates with the Standard Model (SM) through a specific portal operator is\nintegrated out. We work within the Standard Model Effective Field Theory\n(SMEFT) framework and consider the Higgs, neutrino and hypercharge portals. We\nfind that, for each portal, the forms of the leading dimension-six terms in the\nlow-energy effective theory are fixed and independent of the dynamics in the\nhidden sector. For the Higgs portal, we find that two independent dimension-six\nterms are generated, one of which has a sign that, under certain conditions, is\nfixed by the requirement that the dynamics in the hidden sector be causal and\nunitary. In the case of the neutrino portal, for a single generation of SM\nfermions and assuming that the hidden sector does not violate lepton number, a\nunique dimension-six term is generated, which corresponds to a specific linear\ncombination of operators in the Warsaw basis. For the hypercharge portal, a\nunique dimension-six term is generated, which again corresponds to a specific\nlinear combination of operators in the Warsaw basis. For both the neutrino and\nhypercharge portals, under certain conditions, the signs of these terms are\nfixed by the requirement that the hidden sector be causal and unitary. We\nperform a global fit of these dimension-six terms to electroweak precision\nobservables, Higgs measurements and diboson production data and determine the\ncurrent bounds on their coefficients.\n",
  "subjects": [
    "Physics/High Energy Physics - Phenomenology"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "gDS_liRA3s4qRfIj-606I_6l7n0hTdv-JlcYW3VEu-o",
  "pdfSize": "1042699"
}