{
  "id": "2412.01940",
  "title": "Down with the Hierarchy: The 'H' in HNSW Stands for \"Hubs\"",
  "authors": "Blaise Munyampirwa, Vihan Lakshman, Benjamin Coleman",
  "authorsParsed": [
    [
      "Munyampirwa",
      "Blaise",
      ""
    ],
    [
      "Lakshman",
      "Vihan",
      ""
    ],
    [
      "Coleman",
      "Benjamin",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 20:04:06 GMT"
    },
    {
      "version": "v2",
      "created": "Sun, 2 Feb 2025 19:25:13 GMT"
    }
  ],
  "updateDate": "2025-02-04",
  "timestamp": 1733169846000,
  "abstract": "  Driven by recent breakthrough advances in neural representation learning,\napproximate near-neighbor (ANN) search over vector embeddings has emerged as a\ncritical computational workload. With the introduction of the seminal\nHierarchical Navigable Small World (HNSW) algorithm, graph-based indexes have\nestablished themselves as the overwhelmingly dominant paradigm for efficient\nand scalable ANN search. As the name suggests, HNSW searches a layered\nhierarchical graph to quickly identify neighborhoods of similar points to a\ngiven query vector. But is this hierarchy even necessary? A rigorous\nexperimental analysis to answer this question would provide valuable insights\ninto the nature of algorithm design for ANN search and motivate directions for\nfuture work in this increasingly crucial domain. To that end, we conduct an\nextensive benchmarking study covering more large-scale datasets than prior\ninvestigations of this question. We ultimately find that a flat navigable small\nworld graph graph retains all of the benefits of HNSW on high-dimensional\ndatasets, with latency and recall performance essentially \\emph{identical} to\nthe original algorithm but with less memory overhead. Furthermore, we go a step\nfurther and study \\emph{why} the hierarchy of HNSW provides no benefit in high\ndimensions, hypothesizing that navigable small world graphs contain a\nwell-connected, frequently traversed ``highway\" of hub nodes that maintain the\nsame purported function as the hierarchical layers. We present compelling\nempirical evidence that the \\emph{Hub Highway Hypothesis} holds for real\ndatasets and investigate the mechanisms by which the highway forms. The\nimplications of this hypothesis may also provide future research directions in\ndeveloping enhancements to graph-based ANN search.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Databases",
    "Computer Science/Information Retrieval"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "ZK_OOXZYv54mRt0sbjdqfX12i7zITV_8jLc-C8_QYu8",
  "pdfSize": "5316359"
}