{
  "id": "2412.09116",
  "title": "How to Re-enable PDE Loss for Physical Systems Modeling Under Partial\n  Observation",
  "authors": "Haodong Feng, Yue Wang, Dixia Fan",
  "authorsParsed": [
    [
      "Feng",
      "Haodong",
      ""
    ],
    [
      "Wang",
      "Yue",
      ""
    ],
    [
      "Fan",
      "Dixia",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 09:51:18 GMT"
    },
    {
      "version": "v2",
      "created": "Sat, 14 Dec 2024 07:49:20 GMT"
    },
    {
      "version": "v3",
      "created": "Thu, 19 Dec 2024 13:27:49 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1733997078000,
  "abstract": "  In science and engineering, machine learning techniques are increasingly\nsuccessful in physical systems modeling (predicting future states of physical\nsystems). Effectively integrating PDE loss as a constraint of system transition\ncan improve the model's prediction by overcoming generalization issues due to\ndata scarcity, especially when data acquisition is costly. However, in many\nreal-world scenarios, due to sensor limitations, the data we can obtain is\noften only partial observation, making the calculation of PDE loss seem to be\ninfeasible, as the PDE loss heavily relies on high-resolution states. We\ncarefully study this problem and propose a novel framework named Re-enable PDE\nLoss under Partial Observation (RPLPO). The key idea is that although enabling\nPDE loss to constrain system transition solely is infeasible, we can re-enable\nPDE loss by reconstructing the learnable high-resolution state and constraining\nsystem transition simultaneously. Specifically, RPLPO combines an encoding\nmodule for reconstructing learnable high-resolution states with a transition\nmodule for predicting future states. The two modules are jointly trained by\ndata and PDE loss. We conduct experiments in various physical systems to\ndemonstrate that RPLPO has significant improvement in generalization, even when\nobservation is sparse, irregular, noisy, and PDE is inaccurate.\n",
  "subjects": [
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "WO-SCe0m4bTqQ9_o3yMh0OkG6OejyNry2rzwcswHMk0",
  "pdfSize": "3733793"
}