{"id":"2412.16742","title":"EasyVis2: A Real Time Multi-view 3D Visualization for Laparoscopic\n  Surgery Training Enhanced by a Deep Neural Network YOLOv8-Pose","authors":"Yung-Hong Sun, Gefei Shen, Jiangang Chen, Jayer Fernandes, Hongrui\n  Jiang, Yu Hen Hu","authorsParsed":[["Sun","Yung-Hong",""],["Shen","Gefei",""],["Chen","Jiangang",""],["Fernandes","Jayer",""],["Jiang","Hongrui",""],["Hu","Yu Hen",""]],"versions":[{"version":"v1","created":"Sat, 21 Dec 2024 19:26:19 GMT"}],"updateDate":"2024-12-24","timestamp":1734809179000,"abstract":"  EasyVis2 is a system designed for hands-free, real-time 3D visualization\nduring laparoscopic surgery. It incorporates a surgical trocar equipped with a\nset of micro-cameras, which are inserted into the body cavity to provide an\nexpanded field of view and a 3D perspective of the surgical procedure. A\nsophisticated deep neural network algorithm, YOLOv8-Pose, is tailored to\nestimate the position and orientation of surgical instruments in each\nindividual camera view. Subsequently, 3D surgical tool pose estimation is\nperformed using associated 2D key points across multiple views. This enables\nthe rendering of a 3D surface model of the surgical tools overlaid on the\nobserved background scene for real-time visualization. In this study, we\nexplain the process of developing a training dataset for new surgical tools to\ncustomize YoLOv8-Pose while minimizing labeling efforts. Extensive experiments\nwere conducted to compare EasyVis2 with the original EasyVis, revealing that,\nwith the same number of cameras, the new system improves 3D reconstruction\naccuracy and reduces computation time. Additionally, experiments with 3D\nrendering on real animal tissue visually demonstrated the distance between\nsurgical tools and tissues by displaying virtual side views, indicating\npotential applications in real surgeries in the future.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"BlPz6ZHTGoRxAoDoWsA7vm2-by2CFLMyg2xZTmdDu4c","pdfSize":"1431366"}