{
  "id": "2412.02189",
  "title": "Comparative Performance of Machine Learning Algorithms for Early Genetic\n  Disorder and Subclass Classification",
  "authors": "Abu Bakar Siddik, Faisal R. Badal, Afroza Islam",
  "authorsParsed": [
    [
      "Siddik",
      "Abu Bakar",
      ""
    ],
    [
      "Badal",
      "Faisal R.",
      ""
    ],
    [
      "Islam",
      "Afroza",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 06:02:47 GMT"
    }
  ],
  "updateDate": "2024-12-04",
  "timestamp": 1733205767000,
  "abstract": "  A great deal of effort has been devoted to discovering a particular genetic\ndisorder, but its classification across a broad spectrum of disorder classes\nand types remains elusive. Early diagnosis of genetic disorders enables timely\ninterventions and improves outcomes. This study implements machine learning\nmodels using basic clinical indicators measurable at birth or infancy to enable\ndiagnosis in preliminary life stages. Supervised learning algorithms were\nimplemented on a dataset of 22083 instances with 42 features like family\nhistory, newborn metrics, and basic lab tests. Extensive hyperparameter tuning,\nfeature engineering, and selection were undertaken. Two multi-class classifiers\nwere developed: one for predicting disorder classes (mitochondrial,\nmultifactorial, and single-gene) and one for subtypes (9 disorders).\nPerformance was evaluated using accuracy, precision, recall, and the F1-score.\nThe CatBoost classifier achieved the highest accuracy of 77% for predicting\ngenetic disorder classes. For subtypes, SVM attained a maximum accuracy of 80%.\nThe study demonstrates the feasibility of using basic clinical data in machine\nlearning models for early categorization and diagnosis across various genetic\ndisorders. Applying ML with basic clinical indicators can enable timely\ninterventions once validated on larger datasets. It is necessary to conduct\nfurther studies to improve model performance on this dataset.\n",
  "subjects": [
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "nX48aD9-Sz5aQ2MdOgHWsx27NfjieTnxI2k6s403H14",
  "pdfSize": "1008870"
}