{
  "id": "2412.01241",
  "title": "Quantum Pointwise Convolution: A Flexible and Scalable Approach for\n  Neural Network Enhancement",
  "authors": "An Ning, Tai-Yue Li, Nan-Yow Chen",
  "authorsParsed": [
    [
      "Ning",
      "An",
      ""
    ],
    [
      "Li",
      "Tai-Yue",
      ""
    ],
    [
      "Chen",
      "Nan-Yow",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 08:03:59 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733126639000,
  "abstract": "  In this study, we propose a novel architecture, the Quantum Pointwise\nConvolution, which incorporates pointwise convolution within a quantum neural\nnetwork framework. Our approach leverages the strengths of pointwise\nconvolution to efficiently integrate information across feature channels while\nadjusting channel outputs. By using quantum circuits, we map data to a\nhigher-dimensional space, capturing more complex feature relationships. To\naddress the current limitations of quantum machine learning in the Noisy\nIntermediate-Scale Quantum (NISQ) era, we implement several design\noptimizations. These include amplitude encoding for data embedding, allowing\nmore information to be processed with fewer qubits, and a weight-sharing\nmechanism that accelerates quantum pointwise convolution operations, reducing\nthe need to retrain for each input pixels. In our experiments, we applied the\nquantum pointwise convolution layer to classification tasks on the FashionMNIST\nand CIFAR10 datasets, where our model demonstrated competitive performance\ncompared to its classical counterpart. Furthermore, these optimizations not\nonly improve the efficiency of the quantum pointwise convolutional layer but\nalso make it more readily deployable in various CNN-based or deep learning\nmodels, broadening its potential applications across different architectures.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "U9DvZL2u-Ph4q1HAgqp5TNNxBSMxDiCVPfAFWi4Osco",
  "pdfSize": "1771737"
}