{"id":"2412.19267","title":"Ultrafast opto-acoustics in single nickel cavities","authors":"Alba Viejo Rodr\\'iguez, Marco Gandolfi, Andrea Rossetti, Yoav Urbina\n  Elgueta, Evgeny B. Modin, Svetlana Starikovskaia, Tatloon Chng, Vasily\n  Temnov, Maria Antonietta Vincenti, Daniele Brida, Paolo Vavassori, Nicol\\`o\n  Maccaferri","authorsParsed":[["Rodríguez","Alba Viejo",""],["Gandolfi","Marco",""],["Rossetti","Andrea",""],["Elgueta","Yoav Urbina",""],["Modin","Evgeny B.",""],["Starikovskaia","Svetlana",""],["Chng","Tatloon",""],["Temnov","Vasily",""],["Vincenti","Maria Antonietta",""],["Brida","Daniele",""],["Vavassori","Paolo",""],["Maccaferri","Nicolò",""]],"versions":[{"version":"v1","created":"Thu, 26 Dec 2024 16:17:03 GMT"}],"updateDate":"2024-12-30","timestamp":1735229823000,"abstract":"  Mechanical stress produced in nano- and micro-scale structures can enhance\nmaterials properties, such as the high mobility of silicon in modern\ntransistors or amplified magnetization dynamics in spintronic devices. Here, we\nreport on the dynamics of coherent acoustic phonons excited by femtosecond\nlight pulses and confined in a single freestanding nickel layer, acting as an\nacoustic cavity. By combining Fourier transform analysis of the experimental\nsignal and numerical multi-physics simulations, we show that high-frequency (>\n10 GHz) longitudinal acoustic pulses can resonate inside the cavity and display\nlower damping compared to a reference nickel film on SiO2 substrate given that\nthe conditions of total reflection are nearly met in the cavity. Our results\nprovide a thorough understanding of the opto-acoustic response in suspended\nmembranes of magnetic materials, which we foresee can be used to amplify\nmagnetization precession dynamics and to develop magneto-acousto-optical\nmodulators.\n","subjects":["Condensed Matter/Materials Science","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"VLyAktYCPO5_WhYjsFEr46BNpRRptkRHmqhRxk4CpG0","pdfSize":"2916947"}