{
  "id": "2412.04728",
  "title": "Robots in the Wild: Contextually-Adaptive Human-Robot Interactions in\n  Urban Public Environments",
  "authors": "Xinyan Yu, Yiyuan Wang, Tram Thi Minh Tran, Yi Zhao, Julie Stephany\n  Berrio Perez, Marius Hoggenmuller, Justine Humphry, Lian Loke, Lynn Masuda,\n  Callum Parker, Martin Tomitsch, Stewart Worrall",
  "authorsParsed": [
    [
      "Yu",
      "Xinyan",
      ""
    ],
    [
      "Wang",
      "Yiyuan",
      ""
    ],
    [
      "Tran",
      "Tram Thi Minh",
      ""
    ],
    [
      "Zhao",
      "Yi",
      ""
    ],
    [
      "Perez",
      "Julie Stephany Berrio",
      ""
    ],
    [
      "Hoggenmuller",
      "Marius",
      ""
    ],
    [
      "Humphry",
      "Justine",
      ""
    ],
    [
      "Loke",
      "Lian",
      ""
    ],
    [
      "Masuda",
      "Lynn",
      ""
    ],
    [
      "Parker",
      "Callum",
      ""
    ],
    [
      "Tomitsch",
      "Martin",
      ""
    ],
    [
      "Worrall",
      "Stewart",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 02:38:57 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 10 Dec 2024 01:17:52 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733452737000,
  "abstract": "  The increasing transition of human-robot interaction (HRI) context from\ncontrolled settings to dynamic, real-world public environments calls for\nenhanced adaptability in robotic systems. This can go beyond algorithmic\nnavigation or traditional HRI strategies in structured settings, requiring the\nability to navigate complex public urban systems containing multifaceted\ndynamics and various socio-technical needs. Therefore, our proposed workshop\nseeks to extend the boundaries of adaptive HRI research beyond predictable,\nsemi-structured contexts and highlight opportunities for adaptable robot\ninteractions in urban public environments. This half-day workshop aims to\nexplore design opportunities and challenges in creating contextually-adaptive\nHRI within these spaces and establish a network of interested parties within\nthe OzCHI research community. By fostering ongoing discussions, sharing of\ninsights, and collaborations, we aim to catalyse future research that empowers\nrobots to navigate the inherent uncertainties and complexities of real-world\npublic interactions.\n",
  "subjects": [
    "Computer Science/Robotics",
    "Computer Science/Human-Computer Interaction"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "yBuyT-gCgk8l6TLzK0k-2vZRfLEMGUKdfdVGrSN_Xeo",
  "pdfSize": "12167848"
}