{
  "id": "2412.20395",
  "title": "A market-based efficient matching mechanism for crowdsourced delivery\n  systems with demand/supply elasticities",
  "authors": "Yuki Oyama and Takashi Akamatsu",
  "authorsParsed": [
    [
      "Oyama",
      "Yuki",
      ""
    ],
    [
      "Akamatsu",
      "Takashi",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 29 Dec 2024 08:13:17 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735459997000,
  "abstract": "  Crowdsourced delivery (CSD) is an emerging business model that leverages the\nunderutilized or excess capacity of individual drivers to fulfill delivery\ntasks. This paper presents a general formulation of a larege-scale two-sided\nCSD matching problem, considering demand/supply elasticity, heterogeneous\npreferences of both shippers and drivers, and task-bundling. We propose a set\nof methodologies to solve this problem. First, we reveal that the\nfluid-particle decomposition approach of Akamatsu and Oyama (2024) can be\nextended to our general formulation. This approach decomposes the original\nlarge-scale matching problem into a fluidly-approximated task partition problem\n(master problem) and small-scale particle matching problems (sub-problems). We\npropose to introduce a truthful auction mechanism to sub-problems, which\nenables the observation of privately perceived costs for each shipper/driver.\nFurthermore, by finding a theoretical link between auction problems and\nparturbed utility theory, we succeed in accurately reflecting the information\ncollected from auctions to the master problem. This reduces the master problem\nto a smooth convex optimization problem, theoretically guaranteeing the\ncomputational efficiency and solution accuracy of the fluid approximation.\nSecond, we transform the master problem into a traffic assignment problem (TAP)\nbased on a task-chain network. This transformation overcomes the difficulty in\nenumerating task bundles. Finally, we formulate the dual problem of the TAP,\nwhose decision variable is only a price/reward pattern at market equilibrium,\nand develop an efficient accelerated gradient descent method. The numerical\nexperiments clarify that our approach drastically reduces the computational\ncost of the matching problem (~700 times faster than a naive method) without\nsacrificing accuracy of the optimal solution (mostly within 0.5% errors).\n",
  "subjects": [
    "Mathematics/Optimization and Control",
    "Computer Science/Computer Science and Game Theory"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "ctN4wFVCJv5M0rm6ZjsAQs4uGHRt5M1wNeoQWhAkr8w",
  "pdfSize": "1077195"
}