{"id":"2412.05395","title":"Modulation of electronic and piezoelectric properties of lead-free\n  halide perovskites LiSnX$_3$ (X = Cl, Br, and I) under applied pressure","authors":"Celestine Lalengmawia, R. Zosiamliana, Bernard Lalroliana, Lalhum\n  Hima, Shivraj Gurung, Lalhriat Zuala, Lalmuanpuia Vanchhawng, Amel Laref, A.\n  Yvaz, D. P. Rai","authorsParsed":[["Lalengmawia","Celestine",""],["Zosiamliana","R.",""],["Lalroliana","Bernard",""],["Hima","Lalhum",""],["Gurung","Shivraj",""],["Zuala","Lalhriat",""],["Vanchhawng","Lalmuanpuia",""],["Laref","Amel",""],["Yvaz","A.",""],["Rai","D. P.",""]],"versions":[{"version":"v1","created":"Fri, 6 Dec 2024 19:40:40 GMT"}],"updateDate":"2024-12-10","timestamp":1733514040000,"abstract":"  Pb-based perovskites are considered to be the most efficient materials for\nenergy harvest. However, real-time application is limited because of their\ntoxicity. As a result, lead-free perovskites that offer similar advantages are\npotential alternatives. Here, we have chosen LiSnX$_3$ (X = Cl, Br, and I) for\nfurther calculation and explore its possibilities for harvesting clean and\ngreen energy. Our objective is to examine strategies for optimizing the\nparameters that control the energy-harvesting capabilities, particularly the\ninterplay between structural variations and electrical properties. The density\nfunctional theory (DFT) has been employed for the theoretical simulation.\nWithin the DFT framework, we have studied the effect of applied pressure (0 to\n20 GPa) and elemental substitution on their physical properties. We hereby\nreport the variation of lattice parameters, elastic constants, band gaps, and\npiezoelectric constants. MD simulation with time steps of up to 5 ps was\nperformed to verify structural stability at room temperature. We report the\nsemi-conducting characteristic of LiSnX$_3$ and the high piezoelectric response\nup to 20.7 Cm2. The presence of high piezoelectric coefficients suggests that\nmanipulation of the structure of LiSnX$_3$ may provide an alternative way to\nharvest energy through electromechanical processes.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"S1PS2KhhRdOf7otJJO4mif3s_Ct2AfoNeudYTgRuBDg","pdfSize":"2748282"}