{"id":"2412.16100","title":"Logical Consistency of Large Language Models in Fact-checking","authors":"Bishwamittra Ghosh, Sarah Hasan, Naheed Anjum Arafat, Arijit Khan","authorsParsed":[["Ghosh","Bishwamittra",""],["Hasan","Sarah",""],["Arafat","Naheed Anjum",""],["Khan","Arijit",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 17:42:25 GMT"}],"updateDate":"2024-12-23","timestamp":1734716545000,"abstract":"  In recent years, large language models (LLMs) have demonstrated significant\nsuccess in performing varied natural language tasks such as language\ntranslation, question-answering, summarizing, fact-checking, etc. Despite LLMs'\nimpressive ability to generate human-like texts, LLMs are infamous for their\ninconsistent responses -- a meaning-preserving change in the input query\nresults in an inconsistent response and attributes to vulnerabilities of LLMs\nsuch as hallucination, jailbreaking, etc. Consequently, existing research\nfocuses on simple paraphrasing-based consistency assessment of LLMs, and\nignores complex queries that necessitates an even better understanding of\nlogical reasoning by an LLM. Our work therefore addresses the logical\ninconsistency of LLMs under complex logical queries with primitive logical\noperators, e.g., negation, conjunction, and disjunction. As a test bed, we\nconsider retrieval-augmented LLMs on a fact-checking task involving\npropositional logic queries from real-world knowledge graphs (KGs). Our\ncontributions are three-fold. Benchmark: We introduce three logical\nfact-checking datasets over KGs for community development towards logically\nconsistent LLMs. Assessment: We propose consistency measures of LLMs on\npropositional logic queries as input and demonstrate that existing LLMs lack\nlogical consistency, specially on complex queries. Improvement: We employ\nsupervised fine-tuning to improve the logical consistency of LLMs on the\ncomplex fact-checking task with KG contexts.\n","subjects":["Computer Science/Computation and Language"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"L__fhoV_hiXdWlZHj3dAmKDt2oCfuwO7xO1GqbzcjbM","pdfSize":"1154925"}