{"id":"2412.05725","title":"Black Swan: Abductive and Defeasible Video Reasoning in Unpredictable\n  Events","authors":"Aditya Chinchure, Sahithya Ravi, Raymond Ng, Vered Shwartz, Boyang Li,\n  Leonid Sigal","authorsParsed":[["Chinchure","Aditya",""],["Ravi","Sahithya",""],["Ng","Raymond",""],["Shwartz","Vered",""],["Li","Boyang",""],["Sigal","Leonid",""]],"versions":[{"version":"v1","created":"Sat, 7 Dec 2024 19:19:03 GMT"}],"updateDate":"2024-12-10","timestamp":1733599143000,"abstract":"  The commonsense reasoning capabilities of vision-language models (VLMs),\nespecially in abductive reasoning and defeasible reasoning, remain poorly\nunderstood. Most benchmarks focus on typical visual scenarios, making it\ndifficult to discern whether model performance stems from keen perception and\nreasoning skills, or reliance on pure statistical recall. We argue that by\nfocusing on atypical events in videos, clearer insights can be gained on the\ncore capabilities of VLMs. Explaining and understanding such\nout-of-distribution events requires models to extend beyond basic pattern\nrecognition and regurgitation of their prior knowledge. To this end, we\nintroduce BlackSwanSuite, a benchmark for evaluating VLMs' ability to reason\nabout unexpected events through abductive and defeasible tasks. Our tasks\nartificially limit the amount of visual information provided to models while\nquestioning them about hidden unexpected events, or provide new visual\ninformation that could change an existing hypothesis about the event. We curate\na comprehensive benchmark suite comprising over 3,800 MCQ, 4,900 generative and\n6,700 yes/no tasks, spanning 1,655 videos. After extensively evaluating various\nstate-of-the-art VLMs, including GPT-4o and Gemini 1.5 Pro, as well as\nopen-source VLMs such as LLaVA-Video, we find significant performance gaps of\nup to 32% from humans on these tasks. Our findings reveal key limitations in\ncurrent VLMs, emphasizing the need for enhanced model architectures and\ntraining strategies.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"n_28WfWkaZWTZ_MXPxsUrZ9gEQUvx18fBHHYFowaD9g","pdfSize":"29800706"}