{"id":"2412.01251","title":"Multi-Functional RIS Integrated Sensing and Communications for 6G\n  Networks","authors":"Dongsheng Han, Peng Wang, Wanli Ni, Wen Wang, Ailing Zheng, Dusit\n  Niyato and Naofal Al-Dhahir","authorsParsed":[["Han","Dongsheng",""],["Wang","Peng",""],["Ni","Wanli",""],["Wang","Wen",""],["Zheng","Ailing",""],["Niyato","Dusit",""],["Al-Dhahir","Naofal",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 08:17:34 GMT"},{"version":"v2","created":"Thu, 5 Dec 2024 07:27:42 GMT"},{"version":"v3","created":"Tue, 28 Jan 2025 02:49:29 GMT"}],"updateDate":"2025-01-29","timestamp":1733127454000,"abstract":"  In this paper, we propose a novel multi-functional reconfigurable intelligent\nsurface (MF-RIS) that supports signal reflection, refraction, amplification,\nand target sensing simultaneously. Our MF-RIS aims to enhance integrated\ncommunication and sensing (ISAC) systems, particularly in multi-user and\nmulti-target scenarios. Equipped with reflection and refraction components\n(i.e., amplifiers and phase shifters), MF-RIS is able to adjust the amplitude\nand phase shift of both communication and sensing signals on demand.\nAdditionally, with the assistance of sensing elements, MF-RIS is capable of\ncapturing the echo signals from multiple targets, thereby mitigating the signal\nattenuation typically associated with multi-hop links. We propose a\nMF-RIS-enabled multi-user and multi-target ISAC system, and formulate an\noptimization problem to maximize the signal-to-interference-plus-noise ratio\n(SINR) of sensing targets. This problem involves jointly optimizing the\ntransmit beamforming and MF-RIS configurations, subject to constraints on the\ncommunication rate, total power budget, and MF-RIS coefficients. We decompose\nthe formulated non-convex problem into three sub-problems, and then solve them\nvia an efficient iterative algorithm. Simulation results demonstrate that: 1)\nThe performance of MF-RIS varies under different operating protocols, and\nenergy splitting (ES) exhibits the best performance in the considered\nMF-RIS-enabled multi-user multi-target ISAC system; 2) Under the same total\npower budget, the proposed MF-RIS with ES protocol attains 52.2%, 73.5% and\n60.86% sensing SINR gains over active RIS, passive RIS, and simultaneously\ntransmitting and reflecting RIS (STAR-RIS), respectively; 3) The number of\nsensing elements will no longer improve sensing performance after exceeding a\ncertain number.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"-zZ6FM9gNB0HKbxkj6lSMvvm28Xsfnb5zOQH1tSP8YU","pdfSize":"1288851"}