{
  "id": "2412.02390",
  "title": "Estimating Photometric Redshifts for Galaxies from the DESI Legacy\n  Imaging Surveys with Bayesian Neural Networks Trained by DESI EDR",
  "authors": "Xingchen Zhou, Nan Li, Hu Zou, Yan Gong, Furen Deng, Xuelei Chen, Qian\n  Yu, Zizhao He and Boyi Ding",
  "authorsParsed": [
    [
      "Zhou",
      "Xingchen",
      ""
    ],
    [
      "Li",
      "Nan",
      ""
    ],
    [
      "Zou",
      "Hu",
      ""
    ],
    [
      "Gong",
      "Yan",
      ""
    ],
    [
      "Deng",
      "Furen",
      ""
    ],
    [
      "Chen",
      "Xuelei",
      ""
    ],
    [
      "Yu",
      "Qian",
      ""
    ],
    [
      "He",
      "Zizhao",
      ""
    ],
    [
      "Ding",
      "Boyi",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 11:38:59 GMT"
    }
  ],
  "updateDate": "2025-02-25",
  "timestamp": 1733225939000,
  "abstract": "  We present a catalogue of photometric redshifts for galaxies from DESI Legacy\nImaging Surveys, which includes $\\sim0.18$ billion sources covering 14,000\n${\\rm deg}^2$. The photometric redshifts, along with their uncertainties, are\nestimated through galaxy images in three optical bands ($g$, $r$ and $z$) from\nDESI and two near-infrared bands ($W1$ and $W2$) from WISE using a Bayesian\nNeural Network (BNN). The training of BNN is performed by above images and\ntheir corresponding spectroscopic redshifts given in DESI Early Data Release\n(EDR). Our results show that categorizing galaxies into individual groups based\non their inherent characteristics and estimating their photo-$z$s within their\ngroup separately can effectively improve the performance. Specifically, the\ngalaxies are categorized into four distinct groups based on DESI's target\nselection criteria: Bright Galaxy Sample (BGS), Luminous Red Galaxies (LRG),\nEmission Line Galaxies (ELG) and a group comprising the remaining sources,\nreferred to as NON. As measured by outliers of $|\\Delta z| > 0.15 (1 + z_{\\rm\ntrue})$, accuracy $\\sigma_{\\rm NMAD}$ and mean uncertainty $\\overline{E}$ for\nBNN, we achieve low outlier percentage, high accuracy and low uncertainty:\n0.14%, 0.018 and 0.0212 for BGS and 0.45%, 0.026 and 0.0293 for LRG\nrespectively, surpassing results without categorization. However, the\nphoto-$z$s for ELG cannot be reliably estimated, showing result of $>15\\%$,\n$\\sim0.1$ and $\\sim0.1$ irrespective of training strategy. On the other hand,\nNON sources can reach 1.9%, 0.039 and 0.0445 when a magnitude cut of $z<21.3$\nis applied. Our findings demonstrate that estimating photo-$z$s directly from\ngalaxy images is significantly potential, and to achieve high-quality photo-$z$\nmeasurement for ongoing and future large-scale imaging survey, it is sensible\nto implement categorization of sources based on their characteristics.\n",
  "subjects": [
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/publicdomain/zero/1.0/",
  "blobId": "E6VD_2Cv6k3GdmXPMuGFOaZFuf0N0dzlnljiBw2--xY",
  "pdfSize": "4300093"
}