{
  "id": "2412.07877",
  "title": "Score-Optimal Diffusion Schedules",
  "authors": "Christopher Williams, Andrew Campbell, Arnaud Doucet, Saifuddin Syed",
  "authorsParsed": [
    [
      "Williams",
      "Christopher",
      ""
    ],
    [
      "Campbell",
      "Andrew",
      ""
    ],
    [
      "Doucet",
      "Arnaud",
      ""
    ],
    [
      "Syed",
      "Saifuddin",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 19:26:51 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733858811000,
  "abstract": "  Denoising diffusion models (DDMs) offer a flexible framework for sampling\nfrom high dimensional data distributions. DDMs generate a path of probability\ndistributions interpolating between a reference Gaussian distribution and a\ndata distribution by incrementally injecting noise into the data. To\nnumerically simulate the sampling process, a discretisation schedule from the\nreference back towards clean data must be chosen. An appropriate discretisation\nschedule is crucial to obtain high quality samples. However, beyond hand\ncrafted heuristics, a general method for choosing this schedule remains\nelusive. This paper presents a novel algorithm for adaptively selecting an\noptimal discretisation schedule with respect to a cost that we derive. Our cost\nmeasures the work done by the simulation procedure to transport samples from\none point in the diffusion path to the next. Our method does not require\nhyperparameter tuning and adapts to the dynamics and geometry of the diffusion\npath. Our algorithm only involves the evaluation of the estimated Stein score,\nmaking it scalable to existing pre-trained models at inference time and online\nduring training. We find that our learned schedule recovers performant\nschedules previously only discovered through manual search and obtains\ncompetitive FID scores on image datasets.\n",
  "subjects": [
    "Statistics/Machine Learning",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "f0zlrzeuvE7tFlRZXzjkPYvWCNyvoncJohc-dZiUnYg",
  "pdfSize": "884998"
}