{
  "id": "2412.10106",
  "title": "A Cascaded Dilated Convolution Approach for Mpox Lesion Classification",
  "authors": "Ayush Deshmukh",
  "authorsParsed": [
    [
      "Deshmukh",
      "Ayush",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 12:47:30 GMT"
    },
    {
      "version": "v2",
      "created": "Sat, 28 Dec 2024 14:07:21 GMT"
    },
    {
      "version": "v3",
      "created": "Sun, 12 Jan 2025 10:16:32 GMT"
    },
    {
      "version": "v4",
      "created": "Tue, 14 Jan 2025 03:43:02 GMT"
    }
  ],
  "updateDate": "2025-01-15",
  "timestamp": 1734094050000,
  "abstract": "  The global outbreak of the Mpox virus, classified as a Public Health\nEmergency of International Concern (PHEIC) by the World Health Organization,\npresents significant diagnostic challenges due to its visual similarity to\nother skin lesion diseases. Traditional diagnostic methods for Mpox, which rely\non clinical symptoms and laboratory tests, are slow and labor intensive. Deep\nlearning-based approaches for skin lesion classification offer a promising\nalternative. However, developing a model that balances efficiency with accuracy\nis crucial to ensure reliable and timely diagnosis without compromising\nperformance. This study introduces the Cascaded Atrous Group Attention (CAGA)\nframework to address these challenges, combining the Cascaded Atrous Attention\nmodule and the Cascaded Group Attention mechanism. The Cascaded Atrous\nAttention module utilizes dilated convolutions and cascades the outputs to\nenhance multi-scale representation. This is integrated into the Cascaded Group\nAttention mechanism, which reduces redundancy in Multi-Head Self-Attention. By\nintegrating the Cascaded Atrous Group Attention module with EfficientViT-L1 as\nthe backbone architecture, this approach achieves state-of-the-art performance,\nreaching an accuracy of 98% on the Mpox Close Skin Image (MCSI) dataset while\nreducing model parameters by 37.5% compared to the original EfficientViT-L1.\nThe model's robustness is demonstrated through extensive validation on two\nadditional benchmark datasets, where it consistently outperforms existing\napproaches.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Image and Video Processing",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "9Glm2I97whGNjyAXNzkdNsu0WsoKc-rwZqYwEbgN1Kc",
  "pdfSize": "748887"
}