{
  "id": "2412.05102",
  "title": "Exact Model Reduction for Continuous-Time Open Quantum Dynamics",
  "authors": "Tommaso Grigoletto, Yukuan Tao, Francesco Ticozzi and Lorenza Viola",
  "authorsParsed": [
    [
      "Grigoletto",
      "Tommaso",
      ""
    ],
    [
      "Tao",
      "Yukuan",
      ""
    ],
    [
      "Ticozzi",
      "Francesco",
      ""
    ],
    [
      "Viola",
      "Lorenza",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 15:00:58 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733497258000,
  "abstract": "  We consider finite-dimensional many-body quantum systems described by\ntime-independent Hamiltonians and Markovian master equations, and present a\nsystematic method for constructing smaller-dimensional, reduced models that\nexactly reproduce the time evolution of a set of initial conditions or\nobservables of interest. Our approach exploits Krylov operator spaces and their\nextension to operator algebras, and may be used to obtain reduced linear models\nof minimal dimension, well-suited for simulation on classical computers, or\nreduced quantum models that preserve the structural constraints of physically\nadmissible quantum dynamics, as required for simulation on quantum computers.\nNotably, we prove that the reduced quantum-dynamical generator is still in\nLindblad form. By introducing a new type of observable-dependent symmetries, we\nshow that our method provides a non-trivial generalization of techniques that\nleverage symmetries, unlocking new reduction opportunities. We quantitatively\nbenchmark our method on paradigmatic open many-body systems of relevance to\ncondensed-matter and quantum-information physics. In particular, we demonstrate\nhow our reduced models can quantitatively describe decoherence dynamics in\ncentral-spin systems coupled to structured environments, magnetization\ntransport in boundary-driven dissipative spin chains, and unwanted error\ndynamics on information encoded in a noiseless quantum code.\n",
  "subjects": [
    "Physics/Quantum Physics",
    "Computer Science/Systems and Control",
    "Electrical Engineering and Systems Science/Systems and Control",
    "Physics/Mathematical Physics",
    "Mathematics/Mathematical Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "PiN3PAwp2kshUoYClHdh9cNwtiZKVMV3sQAPOCFIqN4",
  "pdfSize": "1619416"
}