{"id":"2412.18552","title":"Distilling Fine-grained Sentiment Understanding from Large Language\n  Models","authors":"Yice Zhang, Guangyu Xie, Hongling Xu, Kaiheng Hou, Jianzhu Bao,\n  Qianlong Wang, Shiwei Chen, and Ruifeng Xu","authorsParsed":[["Zhang","Yice",""],["Xie","Guangyu",""],["Xu","Hongling",""],["Hou","Kaiheng",""],["Bao","Jianzhu",""],["Wang","Qianlong",""],["Chen","Shiwei",""],["Xu","Ruifeng",""]],"versions":[{"version":"v1","created":"Tue, 24 Dec 2024 17:05:26 GMT"},{"version":"v2","created":"Mon, 30 Dec 2024 11:24:32 GMT"}],"updateDate":"2024-12-31","timestamp":1735059926000,"abstract":"  Fine-grained sentiment analysis (FSA) aims to extract and summarize user\nopinions from vast opinionated text. Recent studies demonstrate that large\nlanguage models (LLMs) possess exceptional sentiment understanding\ncapabilities. However, directly deploying LLMs for FSA applications incurs high\ninference costs. Therefore, this paper investigates the distillation of\nfine-grained sentiment understanding from LLMs into small language models\n(SLMs). We prompt LLMs to examine and interpret the sentiments of given reviews\nand then utilize the generated content to pretrain SLMs. Additionally, we\ndevelop a comprehensive FSA benchmark to evaluate both SLMs and LLMs. Extensive\nexperiments on this benchmark reveal that: (1) distillation significantly\nenhances the performance of SLMs in FSA tasks, achieving a 6.00\\% improvement\nin $F_1$-score, and the distilled model can outperform Llama-2-7b with only\n220M parameters; (2) distillation equips SLMs with excellent zero-shot\nsentiment classification capabilities, enabling them to match or even exceed\ntheir teacher models. These results suggest that distillation from LLMs is a\nhighly promising direction for FSA. We will release our code, data, and\npretrained model weights at https://github.com/HITSZ-HLT/FSA-Distillation.\n","subjects":["Computer Science/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"B2g7FqFyDVXPJQ94N2KAQ2OTyQE49MwE1Jkd_GiwSQw","pdfSize":"1378884"}