{
  "id": "2412.11394",
  "title": "Privacy-Preserving Brain-Computer Interfaces: A Systematic Review",
  "authors": "K. Xia, W. Duch, Y. Sun, K. Xu, W. Fang, H. Luo, Y. Zhang, D. Sang, X.\n  Xu, F-Y Wang and D. Wu",
  "authorsParsed": [
    [
      "Xia",
      "K.",
      ""
    ],
    [
      "Duch",
      "W.",
      ""
    ],
    [
      "Sun",
      "Y.",
      ""
    ],
    [
      "Xu",
      "K.",
      ""
    ],
    [
      "Fang",
      "W.",
      ""
    ],
    [
      "Luo",
      "H.",
      ""
    ],
    [
      "Zhang",
      "Y.",
      ""
    ],
    [
      "Sang",
      "D.",
      ""
    ],
    [
      "Xu",
      "X.",
      ""
    ],
    [
      "Wang",
      "F-Y",
      ""
    ],
    [
      "Wu",
      "D.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 02:45:37 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734317137000,
  "abstract": "  A brain-computer interface (BCI) establishes a direct communication pathway\nbetween the human brain and a computer. It has been widely used in medical\ndiagnosis, rehabilitation, education, entertainment, etc. Most research so far\nfocuses on making BCIs more accurate and reliable, but much less attention has\nbeen paid to their privacy. Developing a commercial BCI system usually requires\nclose collaborations among multiple organizations, e.g., hospitals,\nuniversities, and/or companies. Input data in BCIs, e.g., electroencephalogram\n(EEG), contain rich privacy information, and the developed machine learning\nmodel is usually proprietary. Data and model transmission among different\nparties may incur significant privacy threats, and hence privacy protection in\nBCIs must be considered. Unfortunately, there does not exist any contemporary\nand comprehensive review on privacy-preserving BCIs. This paper fills this gap,\nby describing potential privacy threats and protection strategies in BCIs. It\nalso points out several challenges and future research directions in developing\nprivacy-preserving BCIs.\n",
  "subjects": [
    "Computer Science/Human-Computer Interaction"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Gksdhav_ZwXU1DI89cJaRJ3VNS8T2v1hucIpyOuodQo",
  "pdfSize": "507179"
}