{
  "id": "2412.18086",
  "title": "Generating Traffic Scenarios via In-Context Learning to Learn Better\n  Motion Planner",
  "authors": "Aizierjiang Aiersilan",
  "authorsParsed": [
    [
      "Aiersilan",
      "Aizierjiang",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 24 Dec 2024 01:52:19 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1735005139000,
  "abstract": "  Motion planning is a crucial component in autonomous driving.\nState-of-the-art motion planners are trained on meticulously curated datasets,\nwhich are not only expensive to annotate but also insufficient in capturing\nrarely seen critical scenarios. Failing to account for such scenarios poses a\nsignificant risk to motion planners and may lead to incidents during testing.\nAn intuitive solution is to manually compose such scenarios by programming and\nexecuting a simulator (e.g., CARLA). However, this approach incurs substantial\nhuman costs. Motivated by this, we propose an inexpensive method for generating\ndiverse critical traffic scenarios to train more robust motion planners. First,\nwe represent traffic scenarios as scripts, which are then used by the simulator\nto generate traffic scenarios. Next, we develop a method that accepts\nuser-specified text descriptions, which a Large Language Model (LLM) translates\ninto scripts using in-context learning. The output scripts are sent to the\nsimulator that produces the corresponding traffic scenarios. As our method can\ngenerate abundant safety-critical traffic scenarios, we use them as synthetic\ntraining data for motion planners. To demonstrate the value of generated\nscenarios, we train existing motion planners on our synthetic data, real-world\ndatasets, and a combination of both. Our experiments show that motion planners\ntrained with our data significantly outperform those trained solely on\nreal-world data, showing the usefulness of our synthetic data and the\neffectiveness of our data generation method. Our source code is available at\nhttps://ezharjan.github.io/AutoSceneGen.\n",
  "subjects": [
    "Computer Science/Robotics",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Computation and Language",
    "Computer Science/Graphics",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "jNGJhcJHmzxAblDfO23uWnXeaoAFHEjcGm_s2Chv7NA",
  "pdfSize": "7989925"
}