{
  "id": "2412.06531",
  "title": "Unraveling the Complexity of Memory in RL Agents: an Approach for\n  Classification and Evaluation",
  "authors": "Egor Cherepanov, Nikita Kachaev, Artem Zholus, Alexey K. Kovalev,\n  Aleksandr I. Panov",
  "authorsParsed": [
    [
      "Cherepanov",
      "Egor",
      ""
    ],
    [
      "Kachaev",
      "Nikita",
      ""
    ],
    [
      "Zholus",
      "Artem",
      ""
    ],
    [
      "Kovalev",
      "Alexey K.",
      ""
    ],
    [
      "Panov",
      "Aleksandr I.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 14:34:31 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733754871000,
  "abstract": "  The incorporation of memory into agents is essential for numerous tasks\nwithin the domain of Reinforcement Learning (RL). In particular, memory is\nparamount for tasks that require the utilization of past information,\nadaptation to novel environments, and improved sample efficiency. However, the\nterm ``memory'' encompasses a wide range of concepts, which, coupled with the\nlack of a unified methodology for validating an agent's memory, leads to\nerroneous judgments about agents' memory capabilities and prevents objective\ncomparison with other memory-enhanced agents. This paper aims to streamline the\nconcept of memory in RL by providing practical precise definitions of agent\nmemory types, such as long-term versus short-term memory and declarative versus\nprocedural memory, inspired by cognitive science. Using these definitions, we\ncategorize different classes of agent memory, propose a robust experimental\nmethodology for evaluating the memory capabilities of RL agents, and\nstandardize evaluations. Furthermore, we empirically demonstrate the importance\nof adhering to the proposed methodology when evaluating different types of\nagent memory by conducting experiments with different RL agents and what its\nviolation leads to.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "S4Bgy8VxQWmbq98bERl_AcK1E91UH0BejlSaO0-Zvs0",
  "pdfSize": "2169708"
}