{
  "id": "2412.18788",
  "title": "Computational Analysis of Yaredawi YeZema Silt in Ethiopian Orthodox\n  Tewahedo Church Chants",
  "authors": "Mequanent Argaw Muluneh, Yan-Tsung Peng, Li Su",
  "authorsParsed": [
    [
      "Muluneh",
      "Mequanent Argaw",
      ""
    ],
    [
      "Peng",
      "Yan-Tsung",
      ""
    ],
    [
      "Su",
      "Li",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 25 Dec 2024 05:42:56 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735105376000,
  "abstract": "  Despite its musicological, cultural, and religious significance, the\nEthiopian Orthodox Tewahedo Church (EOTC) chant is relatively underrepresented\nin music research. Historical records, including manuscripts, research papers,\nand oral traditions, confirm Saint Yared's establishment of three canonical\nEOTC chanting modes during the 6th century. This paper attempts to investigate\nthe EOTC chants using music information retrieval (MIR) techniques. Among the\nresearch questions regarding the analysis and understanding of EOTC chants,\nYaredawi YeZema Silt, namely the mode of chanting adhering to Saint Yared's\nstandards, is of primary importance. Therefore, we consider the task of\nYaredawi YeZema Silt classification in EOTC chants by introducing a new dataset\nand showcasing a series of classification experiments for this task. Results\nshow that using the distribution of stabilized pitch contours as the feature\nrepresentation on a simple neural network-based classifier becomes an effective\nsolution. The musicological implications and insights of such results are\nfurther discussed through a comparative study with the previous ethnomusicology\nliterature on EOTC chants. By making this dataset publicly accessible, we aim\nto promote future exploration and analysis of EOTC chants and highlight\npotential directions for further research, thereby fostering a deeper\nunderstanding and preservation of this unique spiritual and cultural heritage.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Audio and Speech Processing",
    "Computer Science/Sound",
    "Electrical Engineering and Systems Science/Signal Processing"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Khjil6nqmqhNkOLNezqRqjhk1z_jbjf3tJrOrnTsGas",
  "pdfSize": "1051702"
}