{
  "id": "2412.06802",
  "title": "Efficient Representations of Cardiac Spatial Heterogeneity in\n  Computational Models",
  "authors": "Alejandro Nieto Ramos, Elizabeth M. Cherry",
  "authorsParsed": [
    [
      "Ramos",
      "Alejandro Nieto",
      ""
    ],
    [
      "Cherry",
      "Elizabeth M.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 24 Nov 2024 03:25:46 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1732418746000,
  "abstract": "  It is generally assumed that all cells in models of the electrical behavior\nof cardiac tissue have the same properties. However, there are differences in\ncardiac cells that are not well characterized but cause spatial heterogeneity\nof the electrical properties in tissue. Optical mapping can be used to obtain\nexperimental data from cardiac surfaces at high spatial resolution. Variations\nin model parameters can be defined on a coarser grid than considering each\nsingle pixel, which would allow a representation of heterogeneous tissue to be\nobtained more efficiently. Here, we address how coarse the parameterization\ngrid can be while still obtaining accurate results for complicated dynamical\nstates of spatially discordant alternans. We use the Fenton-Karma model with\nheterogeneity included as a smooth nonlinear gradient over space for more model\nparameters. To obtain the more efficient representations, we set parameter\nvalues everywhere in space based on the assumption that the exact parameter\nvalues are known at the points of the coarser grid; we assume the parameter\nvalues could be obtained from experimental data. We assign parameter values in\nspace by fitting either a piecewise-constant or piecewise-linear function to\nthe spatially coarse known data. We wish to identify the maximal grid spacing\nof such points to obtain good agreement with spatial profiles of action\npotential duration during complex states. We find that coarse grid spacing of\nabout 1.0-1.6 cm generally results in spatial profiles that agree well with the\ntrue profiles for a range of different model parameters and different functions\nof those parameters over space. In addition, the piecewise-constant and\npiecewise-linear functions perform similarly. Our results to date suggest that\nmatching the output of models of cardiac tissue to heterogeneous experimental\ndata can be done efficiently, even during complex dynamical states.\n",
  "subjects": [
    "Quantitative Biology/Tissues and Organs"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "wB6a_dhoKxdVH3OZVayYaCnANA2t_1dEyzMv2rh1Dnk",
  "pdfSize": "1290713"
}