{"id":"2412.11819","title":"HiGDA: Hierarchical Graph of Nodes to Learn Local-to-Global Topology for\n  Semi-Supervised Domain Adaptation","authors":"Ba Hung Ngo, Doanh C. Bui, Nhat-Tuong Do-Tran, Tae Jong Choi","authorsParsed":[["Ngo","Ba Hung",""],["Bui","Doanh C.",""],["Do-Tran","Nhat-Tuong",""],["Choi","Tae Jong",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 14:35:52 GMT"}],"updateDate":"2024-12-17","timestamp":1734359752000,"abstract":"  The enhanced representational power and broad applicability of deep learning\nmodels have attracted significant interest from the research community in\nrecent years. However, these models often struggle to perform effectively under\ndomain shift conditions, where the training data (the source domain) is related\nto but exhibits different distributions from the testing data (the target\ndomain). To address this challenge, previous studies have attempted to reduce\nthe domain gap between source and target data by incorporating a few labeled\ntarget samples during training - a technique known as semi-supervised domain\nadaptation (SSDA). While this strategy has demonstrated notable improvements in\nclassification performance, the network architectures used in these approaches\nprimarily focus on exploiting the features of individual images, leaving room\nfor improvement in capturing rich representations. In this study, we introduce\na Hierarchical Graph of Nodes designed to simultaneously present\nrepresentations at both feature and category levels. At the feature level, we\nintroduce a local graph to identify the most relevant patches within an image,\nfacilitating adaptability to defined main object representations. At the\ncategory level, we employ a global graph to aggregate the features from samples\nwithin the same category, thereby enriching overall representations. Extensive\nexperiments on widely used SSDA benchmark datasets, including Office-Home,\nDomainNet, and VisDA2017, demonstrate that both quantitative and qualitative\nresults substantiate the effectiveness of HiGDA, establishing it as a new\nstate-of-the-art method.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"1Vp6PrWhao8JBJiB1qtfZTYmchiCEFlJaiFsxvoH86w","pdfSize":"4394516"}