{
  "id": "2412.02853",
  "title": "Grand Challenges in Immersive Technologies for Cultural Heritage",
  "authors": "Hanbing Wang, Junyan Du, Yue Li, Lie Zhang, Xiang Li",
  "authorsParsed": [
    [
      "Wang",
      "Hanbing",
      ""
    ],
    [
      "Du",
      "Junyan",
      ""
    ],
    [
      "Li",
      "Yue",
      ""
    ],
    [
      "Zhang",
      "Lie",
      ""
    ],
    [
      "Li",
      "Xiang",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 21:39:01 GMT"
    },
    {
      "version": "v2",
      "created": "Fri, 6 Dec 2024 16:07:12 GMT"
    },
    {
      "version": "v3",
      "created": "Thu, 2 Jan 2025 12:00:45 GMT"
    },
    {
      "version": "v4",
      "created": "Fri, 3 Jan 2025 11:56:22 GMT"
    },
    {
      "version": "v5",
      "created": "Sun, 16 Feb 2025 16:26:51 GMT"
    }
  ],
  "updateDate": "2025-02-18",
  "timestamp": 1733261941000,
  "abstract": "  Cultural heritage, a testament to human history and civilization, has gained\nincreasing recognition for its significance in preservation and dissemination.\nThe integration of immersive technologies has transformed how cultural heritage\nis presented, enabling audiences to engage with it in more vivid, intuitive,\nand interactive ways. However, the adoption of these technologies also brings a\nrange of challenges and potential risks. This paper presents a systematic\nreview, with an in-depth analysis of 177 selected papers. We comprehensively\nexamine and categorize current applications, technological approaches, and user\ndevices in immersive cultural heritage presentations, while also highlighting\nthe associated risks and challenges. Furthermore, we identify areas for future\nresearch in the immersive presentation of cultural heritage. Our goal is to\nprovide a comprehensive reference for researchers and practitioners, enhancing\nunderstanding of the technological applications, risks, and challenges in this\nfield, and encouraging further innovation and development.\n",
  "subjects": [
    "Computer Science/Computers and Society",
    "Computer Science/Human-Computer Interaction"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "wrWiYmed16UqCzvJYFjAfxIVI8wh_Y1JRBIZkQ5mHVM",
  "pdfSize": "2156155"
}