{
  "id": "2412.17575",
  "title": "Pressure Evolution of Magnetic Structure and Quasiparticle Excitations\n  in Anisotropic Frustrated Zigzag Chains",
  "authors": "Fumiya Hori, Hiroyasu Matsudaira, Shunsaku Kitagawa, Kenji Ishida,\n  Hiroto Suzuki, Takahiro Onimaru",
  "authorsParsed": [
    [
      "Hori",
      "Fumiya",
      ""
    ],
    [
      "Matsudaira",
      "Hiroyasu",
      ""
    ],
    [
      "Kitagawa",
      "Shunsaku",
      ""
    ],
    [
      "Ishida",
      "Kenji",
      ""
    ],
    [
      "Suzuki",
      "Hiroto",
      ""
    ],
    [
      "Onimaru",
      "Takahiro",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 13:48:09 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734961689000,
  "abstract": "  Frustrated magnetic systems with anisotropic exchange interactions have been\nrecognized as key platforms for discovering exotic quantum states and\nquasiparticles. In this study, we report the pressure evolution of magnetic\nstructures and quasiparticle excitations in the frustrated semiconductor\nYbCuS2, characterized by Yb3+ zigzag chains with competing exchange\ninteractions. At ambient pressure, YbCuS2 exhibits a magnetic transition at TN\n~ 0.95 K, forming an incommensurate helical magnetic order. Under hydrostatic\npressure of 1.6 GPa, TN increases to 1.17 K, and the magnetic structure changes\nto a commensurate one, which can be regarded as an odd-parity magnetic\nmultipole order. Remarkably, pressure suppresses the gapless quasiparticle\nexcitations. These findings suggest that pressure alters the exchange\ninteractions between the Yb ions, affecting both the magnetic ground state and\nthe quasiparticle excitations. Our results highlight the pivotal role of\nanisotropic interactions in one-dimensionality to stabilize the complex quantum\nphases, offering insights into the interplay among frustration, dimensionality,\nmultipoles and emergent quasiparticles.\n",
  "subjects": [
    "Condensed Matter/Strongly Correlated Electrons"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "KQ-_YULJ2QeRKeALvd-s2k44IUw2Y57Qtb2836BRadM",
  "pdfSize": "1230326"
}