{
  "id": "2412.11555",
  "title": "TS-SatFire: A Multi-Task Satellite Image Time-Series Dataset for\n  Wildfire Detection and Prediction",
  "authors": "Yu Zhao and Sebastian Gerard and Yifang Ban",
  "authorsParsed": [
    [
      "Zhao",
      "Yu",
      ""
    ],
    [
      "Gerard",
      "Sebastian",
      ""
    ],
    [
      "Ban",
      "Yifang",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 08:40:12 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734338412000,
  "abstract": "  Wildfire monitoring and prediction are essential for understanding wildfire\nbehaviour. With extensive Earth observation data, these tasks can be integrated\nand enhanced through multi-task deep learning models. We present a\ncomprehensive multi-temporal remote sensing dataset for active fire detection,\ndaily wildfire monitoring, and next-day wildfire prediction. Covering wildfire\nevents in the contiguous U.S. from January 2017 to October 2021, the dataset\nincludes 3552 surface reflectance images and auxiliary data such as weather,\ntopography, land cover, and fuel information, totalling 71 GB. The lifecycle of\neach wildfire is documented, with labels for active fires (AF) and burned areas\n(BA), supported by manual quality assurance of AF and BA test labels. The\ndataset supports three tasks: a) active fire detection, b) daily burned area\nmapping, and c) wildfire progression prediction. Detection tasks use pixel-wise\nclassification of multi-spectral, multi-temporal images, while prediction tasks\nintegrate satellite and auxiliary data to model fire dynamics. This dataset and\nits benchmarks provide a foundation for advancing wildfire research using deep\nlearning.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "O2ovXZOt9S_HyIT0yoNAaynjRxvcA9pb_doQwRVvBEs",
  "pdfSize": "7623830"
}