{"id":"2412.17596","title":"LiveIdeaBench: Evaluating LLMs' Scientific Creativity and Idea\n  Generation with Minimal Context","authors":"Kai Ruan, Xuan Wang, Jixiang Hong, Peng Wang, Yang Liu, Hao Sun","authorsParsed":[["Ruan","Kai",""],["Wang","Xuan",""],["Hong","Jixiang",""],["Wang","Peng",""],["Liu","Yang",""],["Sun","Hao",""]],"versions":[{"version":"v1","created":"Mon, 23 Dec 2024 14:13:44 GMT"},{"version":"v2","created":"Sun, 12 Jan 2025 03:52:16 GMT"}],"updateDate":"2025-01-14","timestamp":1734963224000,"abstract":"  While Large Language Models (LLMs) have demonstrated remarkable capabilities\nin scientific tasks, existing evaluation frameworks primarily assess their\nperformance using rich contextual inputs, overlooking their ability to generate\nnovel ideas from minimal information. We introduce LiveIdeaBench, a\ncomprehensive benchmark that evaluates LLMs' scientific creativity and\ndivergent thinking capabilities using single-keyword prompts. Drawing from\nGuilford's creativity theory, our framework employs a dynamic panel of\nstate-of-the-art LLMs to assess generated ideas across four key dimensions:\noriginality, feasibility, fluency, and flexibility. Through extensive\nexperimentation with 20 leading models across 1,180 keywords spanning 18\nscientific domains, we reveal that scientific creative ability shows distinct\npatterns from general intelligence metrics. Notably, our results demonstrate\nthat models like QwQ-32B-preview achieve comparable creative performance to\ntop-tier models like o1-preview, despite significant gaps in their general\nintelligence scores. These findings highlight the importance of specialized\nevaluation frameworks for scientific creativity and suggest that the\ndevelopment of creative capabilities in LLMs may follow different trajectories\nthan traditional problem-solving abilities.\n","subjects":["Computer Science/Computation and Language","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"etY_CJfZoQM_VPInbBtjKF_JZhY7hDY8esNumzbcSRo","pdfSize":"10661640"}