{
  "id": "2412.08881",
  "title": "Ultrafast quantum light uncertainty dynamics in real time",
  "authors": "Mohamed Sennary, Javier Rivera-Dean, Mohamed ElKabbash, Vladimir\n  Pervak, Maciej Lewenstein, Mohammed Th. Hassan",
  "authorsParsed": [
    [
      "Sennary",
      "Mohamed",
      ""
    ],
    [
      "Rivera-Dean",
      "Javier",
      ""
    ],
    [
      "ElKabbash",
      "Mohamed",
      ""
    ],
    [
      "Pervak",
      "Vladimir",
      ""
    ],
    [
      "Lewenstein",
      "Maciej",
      ""
    ],
    [
      "Hassan",
      "Mohammed Th.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 02:33:45 GMT"
    },
    {
      "version": "v2",
      "created": "Wed, 26 Feb 2025 19:49:45 GMT"
    }
  ],
  "updateDate": "2025-02-28",
  "timestamp": 1733970825000,
  "abstract": "  Advancements in quantum optics and squeezed light generation have transformed\nvarious domains of quantum science and technology. However, real-time quantum\ndynamics remain an underexplored frontier. Here, we extend quantum optics into\nthe ultrafast regime, providing direct experimental evidence that quantum\nuncertainty is not a static constraint but evolves dynamically with the system\nstate and interactions. Using ultrafast squeezed light generated via a\nfour-wave mixing nonlinear process, we observe the temporal dynamics of\namplitude uncertainty, demonstrating that quantum uncertainty is a controllable\nand tunable physical quantity. This offers new insights into fundamental\nquantum mechanics in real-time. Additionally, we demonstrate control over the\nquantum state of light by switching between amplitude and phase squeezing. Our\nability to generate and manipulate ultrafast squeezed light waveforms with\nattosecond resolution unlocks exciting possibilities for quantum technologies,\nincluding petahertz scale secure quantum communication, quantum computing, and\nultrafast spectroscopy. We also introduce an ultrafast quantum encryption\nprotocol leveraging squeezed light for secure digital communication at\nunprecedented speeds. This work paves the way for exploring quantum uncertainty\ndynamics and establishes the foundation for the emerging field of ultrafast\nquantum science.\n",
  "subjects": [
    "Physics/Optics",
    "Physics/Applied Physics",
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "5WBbaaqA9pDps7Awi3msj66BdGRiZi0ZjtCkliF3dD8",
  "pdfSize": "8367925"
}