{"id":"2412.14704","title":"Mitigating Nonlinear Systematics in Weak Lensing Surveys: The BNT\n  Approach","authors":"Shiming Gu, Ludovic van Waerbeke, Francis Bernardeau, Roohi Dalal","authorsParsed":[["Gu","Shiming",""],["van Waerbeke","Ludovic",""],["Bernardeau","Francis",""],["Dalal","Roohi",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 10:17:08 GMT"}],"updateDate":"2024-12-20","timestamp":1734603428000,"abstract":"  Weak lensing surveys, along with most other late-Universe probes, have\nconsistently measured a lower amplitude of the matter fluctuation spectrum,\ndenoted by the parameter $S_8$, compared to predictions from early-Universe\nmeasurements in cosmic microwave background data. Improper modelling of\nnonlinear scales may partially explain these discrepancies in lensing surveys.\nThis study investigates whether the conventional approach to addressing\nsmall-scale biases remains optimal for Stage-IV lensing surveys. We demonstrate\nthat conventional weak lensing estimators are affected by scale leakage from\ntheoretical biases at nonlinear scales, which influence all observed scales.\nUsing the BNT transform, we propose an $\\ell$-cut methodology that effectively\ncontrols this leakage. The BNT transform reorganizes weak lensing data in\n$\\ell$ space, aligning it with $k$ space, thereby reducing the mixing of\nnonlinear scales and providing a more accurate interpretation of the data. We\nevaluate the BNT approach by comparing HMcode, Halofit, Baryon Correction Model\nand AxionHMcode mass power spectrum models using Euclid-like survey\nconfigurations. Additionally, we introduce a new estimator to quantify scale\nleakage in both the BNT and noBNT approaches. Our findings show that BNT\noutperforms traditional methods, preserving cosmological constraints while\nsignificantly mitigating theoretical biases.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"hEYsqIoYRDn2zvDcpFsLwf_6Q3YJNjCjOiD8loR7aXQ","pdfSize":"1192349"}