{
  "id": "2412.09540",
  "title": "Discretely self-similar exterior-naked singularities for the\n  Einstein-scalar field system",
  "authors": "Serban Cicortas, Christoph Kehle",
  "authorsParsed": [
    [
      "Cicortas",
      "Serban",
      ""
    ],
    [
      "Kehle",
      "Christoph",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 18:30:25 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1734028225000,
  "abstract": "  The problem of constructing naked singularities in general relativity can be\nnaturally divided into two parts: (i) the construction of the region exterior\nto the past light cone of the singularity, extending all the way to (an\nincomplete) future null infinity and yielding the nakedness property (what we\nwill call exterior-naked singularity regions); (ii) attaching an interior\nfill-in that ensures that the singularity arises from regular initial data.\nThis problem has been resolved for the spherically symmetric Einstein-scalar\nfield system by Christodoulou, but his construction, based on a continuously\nself-similar ansatz, requires that both the exterior and the interior regions\nare mildly irregular on the past cone of the singularity. On the other hand,\nnumerical works suggest that there exist naked singularity spacetimes with\ndiscrete self-similarity arising from smooth initial data. In this paper, we\nrevisit part (i) of the problem and we construct exterior-naked singularity\nregions with discretely self-similar profiles which are smooth on the past cone\nof the singularity. We show that the scalar field remains uniformly bounded,\nbut the singularity is characterized by the infinite oscillations of the scalar\nfield and the mass aspect ratio. (Our examples require however that the mass\naspect ratio is uniformly small, and thus the solutions are distinct from the\nexterior regions of the numerical examples.) It remains an open problem to\nsmoothly attach interior fill-ins as in (ii) to our solutions, which would\nyield a new construction of naked singularity spacetimes, now arising from\nsmooth initial data.\n",
  "subjects": [
    "Physics/General Relativity and Quantum Cosmology",
    "Mathematics/Analysis of PDEs"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "eiCNFJ6WbxFTdDajoqdaFh8EORC_7hSU_4BZkNKVJrs",
  "pdfSize": "839884"
}