{"id":"2412.15250","title":"An Enhanced Text Compression Approach Using Transformer-based Language\n  Models","authors":"Chowdhury Mofizur Rahman and Mahbub E Sobhani and Anika Tasnim Rodela\n  and Swakkhar Shatabda","authorsParsed":[["Rahman","Chowdhury Mofizur",""],["Sobhani","Mahbub E",""],["Rodela","Anika Tasnim",""],["Shatabda","Swakkhar",""]],"versions":[{"version":"v1","created":"Sun, 15 Dec 2024 03:01:17 GMT"}],"updateDate":"2024-12-23","timestamp":1734231677000,"abstract":"  Text compression shrinks textual data while keeping crucial information,\neradicating constraints on storage, bandwidth, and computational efficacy. The\nintegration of lossless compression techniques with transformer-based text\ndecompression has received negligible attention, despite the increasing volume\nof English text data in communication. The primary barrier in advancing text\ncompression and restoration involves optimizing transformer-based approaches\nwith efficient pre-processing and integrating lossless compression algorithms,\nthat remained unresolved in the prior attempts. Here, we propose a\ntransformer-based method named RejuvenateForme for text decompression,\naddressing prior issues by harnessing a new pre-processing technique and a\nlossless compression method. Our meticulous pre-processing technique\nincorporating the Lempel-Ziv-Welch algorithm achieves compression ratios of\n12.57, 13.38, and 11.42 on the BookCorpus, EN-DE, and EN-FR corpora, thus\nshowing state-of-the-art compression ratios compared to other deep learning and\ntraditional approaches. Furthermore, the RejuvenateForme achieves a BLEU score\nof 27.31, 25.78, and 50.45 on the EN-DE, EN-FR, and BookCorpus corpora,\nshowcasing its comprehensive efficacy. In contrast, the pre-trained T5-Small\nexhibits better performance over prior state-of-the-art models.\n","subjects":["Computer Science/Computation and Language","Computer Science/Information Theory","Computer Science/Machine Learning","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"bIWJ1kn8nk-UHeubfC9bcadJkQel1x-nn-qlH8k6Mec","pdfSize":"372812"}