{
  "id": "2412.13419",
  "title": "Exploring Transformer-Augmented LSTM for Temporal and Spatial Feature\n  Learning in Trajectory Prediction",
  "authors": "Chandra Raskoti and Weizi Li",
  "authorsParsed": [
    [
      "Raskoti",
      "Chandra",
      ""
    ],
    [
      "Li",
      "Weizi",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 01:31:08 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734485468000,
  "abstract": "  Accurate vehicle trajectory prediction is crucial for ensuring safe and\nefficient autonomous driving. This work explores the integration of Transformer\nbased model with Long Short-Term Memory (LSTM) based technique to enhance\nspatial and temporal feature learning in vehicle trajectory prediction. Here, a\nhybrid model that combines LSTMs for temporal encoding with a Transformer\nencoder for capturing complex interactions between vehicles is proposed.\nSpatial trajectory features of the neighboring vehicles are processed and goes\nthrough a masked scatter mechanism in a grid based environment, which is then\ncombined with temporal trajectory of the vehicles. This combined trajectory\ndata are learned by sequential LSTM encoding and Transformer based attention\nlayers. The proposed model is benchmarked against predecessor LSTM based\nmethods, including STA-LSTM, SA-LSTM, CS-LSTM, and NaiveLSTM. Our results,\nwhile not outperforming it's predecessor, demonstrate the potential of\nintegrating Transformers with LSTM based technique to build interpretable\ntrajectory prediction model. Future work will explore alternative architectures\nusing Transformer applications to further enhance performance. This study\nprovides a promising direction for improving trajectory prediction models by\nleveraging transformer based architectures, paving the way for more robust and\ninterpretable vehicle trajectory prediction system.\n",
  "subjects": [
    "Computer Science/Robotics",
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "rwlwYDOt9wmhwpMmHY2BzcOQHdGCC_61efUE3qBUasM",
  "pdfSize": "309425"
}