{"id":"2412.21059","title":"VisionReward: Fine-Grained Multi-Dimensional Human Preference Learning\n  for Image and Video Generation","authors":"Jiazheng Xu, Yu Huang, Jiale Cheng, Yuanming Yang, Jiajun Xu, Yuan\n  Wang, Wenbo Duan, Shen Yang, Qunlin Jin, Shurun Li, Jiayan Teng, Zhuoyi Yang,\n  Wendi Zheng, Xiao Liu, Ming Ding, Xiaohan Zhang, Xiaotao Gu, Shiyu Huang,\n  Minlie Huang, Jie Tang, Yuxiao Dong","authorsParsed":[["Xu","Jiazheng",""],["Huang","Yu",""],["Cheng","Jiale",""],["Yang","Yuanming",""],["Xu","Jiajun",""],["Wang","Yuan",""],["Duan","Wenbo",""],["Yang","Shen",""],["Jin","Qunlin",""],["Li","Shurun",""],["Teng","Jiayan",""],["Yang","Zhuoyi",""],["Zheng","Wendi",""],["Liu","Xiao",""],["Ding","Ming",""],["Zhang","Xiaohan",""],["Gu","Xiaotao",""],["Huang","Shiyu",""],["Huang","Minlie",""],["Tang","Jie",""],["Dong","Yuxiao",""]],"versions":[{"version":"v1","created":"Mon, 30 Dec 2024 16:24:09 GMT"}],"updateDate":"2024-12-31","timestamp":1735575849000,"abstract":"  We present a general strategy to aligning visual generation models -- both\nimage and video generation -- with human preference. To start with, we build\nVisionReward -- a fine-grained and multi-dimensional reward model. We decompose\nhuman preferences in images and videos into multiple dimensions, each\nrepresented by a series of judgment questions, linearly weighted and summed to\nan interpretable and accurate score. To address the challenges of video quality\nassessment, we systematically analyze various dynamic features of videos, which\nhelps VisionReward surpass VideoScore by 17.2% and achieve top performance for\nvideo preference prediction. Based on VisionReward, we develop a\nmulti-objective preference learning algorithm that effectively addresses the\nissue of confounding factors within preference data. Our approach significantly\noutperforms existing image and video scoring methods on both machine metrics\nand human evaluation. All code and datasets are provided at\nhttps://github.com/THUDM/VisionReward.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"AcN61EES-0LEUIJE_0sOEDYuwhGvvGF6DvlZ32ntmFU","pdfSize":"24097750"}