{"id":"2412.13895","title":"Interplay of large-scale drift and turbulence in the heliospheric\n  propagation of solar energetic particles","authors":"T. Laitinen (1) and S. Dalla (1) ((1) Jeremiah Horrocks Institute,\n  University of Central Lancashire, UK)","authorsParsed":[["Laitinen","T.",""],["Dalla","S.",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 14:35:11 GMT"}],"updateDate":"2024-12-19","timestamp":1734532511000,"abstract":"  The gradient and curvature of the Parker spiral interplanetary magnetic field\ngive rise to curvature and gradient guiding centre drifts on cosmic rays. The\nplasma turbulence present in the interplanetary space is thought to suppress\nthe drifts, however the extent to which they are reduced is not clear. We\ninvestigate the reduction of the drifts using a new analytic model of\nheliospheric turbulence where the dominant 2D component has both the wave\nvector and the magnetic field vector normal to the Parker spiral, thus\nfulfilling the main criterion of 2D turbulence. We use full-orbit test particle\nsimulations of energetic protons in the modelled interplanetary turbulence, and\nanalyse the mean drift velocity of the particles in heliolatitude. We release\nenergetic proton populations of 10, 100 and 1000~MeV close to Sun and introduce\na new method to assess their drift. We compare the drift in the turbulent\nheliosphere to drift in a configuration without turbulence, and to theoretical\nestimates of drift reduction. We find that drifts are reduced by a factor\n0.2-0.9 of that expected for the heliospheric configuration without turbulence.\nThis corresponds to a much less efficient suppression than what is predicted by\ntheoretical estimates, particularly at low proton energies. We conclude that\nguiding centre drifts are a significant factor for the evolution of cosmic ray\nintensities in the heliosphere including the propagation of solar energetic\nparticles in the inner heliosphere.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Physics/Space Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"rykZIDFwdpM34YJSba91TD2uFYoXK90UpIAIlf_qd4k","pdfSize":"668877"}