{
  "id": "2412.04243",
  "title": "Quantifying the Limits of Segment Anything Model: Analyzing Challenges\n  in Segmenting Tree-Like and Low-Contrast Structures",
  "authors": "Yixin Zhang, Nicholas Konz, Kevin Kramer, Maciej A. Mazurowski",
  "authorsParsed": [
    [
      "Zhang",
      "Yixin",
      ""
    ],
    [
      "Konz",
      "Nicholas",
      ""
    ],
    [
      "Kramer",
      "Kevin",
      ""
    ],
    [
      "Mazurowski",
      "Maciej A.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 15:25:51 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733412351000,
  "abstract": "  Segment Anything Model (SAM) has shown impressive performance in interactive\nand zero-shot segmentation across diverse domains, suggesting that they have\nlearned a general concept of \"objects\" from their large-scale training.\nHowever, we observed that SAM struggles with certain types of objects,\nparticularly those featuring dense, tree-like structures and low textural\ncontrast from their surroundings. These failure modes are critical for\nunderstanding its limitations in real-world use. In order to systematically\nexamine this issue, we propose metrics to quantify two key object\ncharacteristics: tree-likeness and textural separability. Through extensive\ncontrolled synthetic experiments and testing on real datasets, we demonstrate\nthat SAM's performance is noticeably correlated with these factors. We link\nthese behaviors under the concept of \"textural confusion\", where SAM\nmisinterprets local structure as global texture, leading to over-segmentation,\nor struggles to differentiate objects from similarly textured backgrounds.\nThese findings offer the first quantitative framework to model SAM's\nchallenges, providing valuable insights into its limitations and guiding future\nimprovements for vision foundation models.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Machine Learning",
    "Electrical Engineering and Systems Science/Image and Video Processing"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "6cuXg_p39EEa___UNMuSo4dZ5tYcYlFDcqgi_Wxzgto",
  "pdfSize": "24572727"
}