{"id":"2412.17204","title":"An accurate and efficient framework for predictive insights into ionic\n  surface chemistry","authors":"Benjamin X. Shi, Andrew S. Rosen, Tobias Sch\\\"afer, Andreas Gr\\\"uneis,\n  Venkat Kapil, Andrea Zen, Angelos Michaelides","authorsParsed":[["Shi","Benjamin X.",""],["Rosen","Andrew S.",""],["Schäfer","Tobias",""],["Grüneis","Andreas",""],["Kapil","Venkat",""],["Zen","Andrea",""],["Michaelides","Angelos",""]],"versions":[{"version":"v1","created":"Mon, 23 Dec 2024 01:05:39 GMT"}],"updateDate":"2024-12-24","timestamp":1734915939000,"abstract":"  Quantum-mechanical simulations can offer atomic-level insights into chemical\nprocesses on surfaces. This understanding is crucial for the rational design of\nnew solid catalysts as well as materials to store energy and mitigate\ngreenhouse gases. However, achieving the accuracy needed for reliable\npredictions has proven challenging. Density functional theory (DFT), the\nworkhorse quantum-mechanical method, can often lead to inconsistent\npredictions, necessitating accurate methods from correlated wave-function\ntheory (cWFT). However, the high computational demands and significant user\nintervention associated with cWFT have traditionally made it impractical to\ncarry out for surfaces. In this work, we address this challenge, presenting an\nautomated framework which leverages multilevel embedding approaches, to apply\naccurate cWFT methods to ionic surfaces with computational costs approaching\nDFT. With this framework, we have reproduced experimental adsorption enthalpies\nfor a diverse set of 19 adsorbate-surface systems. Moreover, we resolve\nlong-standing debates on the adsorption configuration of several systems, while\noffering valuable benchmarks to assess DFT. This framework is completely\nopen-source, making it possible to now routinely apply cWFT to complex problems\nin ionic surface chemistry.\n","subjects":["Physics/Chemical Physics","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"OpCroCECp6BiI8PzU5BxU8sCz_Ru0vK424fQgzmaSzc","pdfSize":"12175332"}