{"id":"2412.01322","title":"Explainable fault and severity classification for rolling element\n  bearings using Kolmogorov-Arnold networks","authors":"Spyros Rigas, Michalis Papachristou, Ioannis Sotiropoulos, Georgios\n  Alexandridis","authorsParsed":[["Rigas","Spyros",""],["Papachristou","Michalis",""],["Sotiropoulos","Ioannis",""],["Alexandridis","Georgios",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 09:40:03 GMT"},{"version":"v2","created":"Wed, 4 Dec 2024 11:53:32 GMT"}],"updateDate":"2024-12-05","timestamp":1733132403000,"abstract":"  Rolling element bearings are critical components of rotating machinery, with\ntheir performance directly influencing the efficiency and reliability of\nindustrial systems. At the same time, bearing faults are a leading cause of\nmachinery failures, often resulting in costly downtime, reduced productivity,\nand, in extreme cases, catastrophic damage. This study presents a methodology\nthat utilizes Kolmogorov-Arnold Networks to address these challenges through\nautomatic feature selection, hyperparameter tuning and interpretable fault\nanalysis within a unified framework. By training shallow network architectures\nand minimizing the number of selected features, the framework produces\nlightweight models that deliver explainable results through feature attribution\nand symbolic representations of their activation functions. Validated on two\nwidely recognized datasets for bearing fault diagnosis, the framework achieved\nperfect F1-Scores for fault detection and high performance in fault and\nseverity classification tasks, including 100% F1-Scores in most cases. Notably,\nit demonstrated adaptability by handling diverse fault types, such as imbalance\nand misalignment, within the same dataset. The symbolic representations\nenhanced model interpretability, while feature attribution offered insights\ninto the optimal feature types or signals for each studied task. These results\nhighlight the framework's potential for practical applications, such as\nreal-time machinery monitoring, and for scientific research requiring efficient\nand explainable models.\n","subjects":["Computer Science/Machine Learning","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"QfIxjIZCycwK4tOxDFccINEnNJ7M_tvECPbYEYeYkD8","pdfSize":"1930323"}