{
  "id": "2412.07652",
  "title": "Mapping the spatial extent of HI-rich absorbers using MgII absorption\n  along gravitational arcs",
  "authors": "Trystyn A. M. Berg, Andrea Afruni, C\\'edric Ledoux, Sebastian Lopez,\n  Pasquier Noterdaeme, Nicolas Tejos, Joaquin Hernandez, Felipe Barrientos,\n  Evelyn J. Johnston",
  "authorsParsed": [
    [
      "Berg",
      "Trystyn A. M.",
      ""
    ],
    [
      "Afruni",
      "Andrea",
      ""
    ],
    [
      "Ledoux",
      "Cédric",
      ""
    ],
    [
      "Lopez",
      "Sebastian",
      ""
    ],
    [
      "Noterdaeme",
      "Pasquier",
      ""
    ],
    [
      "Tejos",
      "Nicolas",
      ""
    ],
    [
      "Hernandez",
      "Joaquin",
      ""
    ],
    [
      "Barrientos",
      "Felipe",
      ""
    ],
    [
      "Johnston",
      "Evelyn J.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 16:38:24 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733848704000,
  "abstract": "  HI-rich absorbers seen within quasar spectra contain the bulk of neutral gas\nin the Universe. However, the spatial extent of these reservoirs are not\nextensively studied due to the pencil beam nature of quasar sightlines. Using\ntwo giant gravitational arc fields (at redshifts 1.17 and 2.06) as 2D\nbackground sources with known strong MgII absorption observed with the MUSE\nintegral field spectrograph (IFS), we investigated whether spatially mapped\nMgII absorption can predict the presence of strong HI systems, and determine\nboth the physical extent and HI mass of the two absorbing systems. We created a\nsimple model of an ensemble of gas clouds in order to simultaneously predict\nthe HI column density and gas covering fraction of HI-rich absorbers based on\nobservations of the MgII rest-frame equivalent width in IFS spaxels. We first\ntest the model on the field with HI observations already available from the\nliterature, finding that we can recover HI column densities consistent with the\nprevious estimates (although with large uncertainties). We then use our\nframework to simultaneously predict the gas covering fraction, HI column\ndensity and total HI mass ($M_{\\rm{HI}}$) for both fields. We find that both of\nthe observed strong systems have a covering fraction of $\\approx70$% and are\nlikely damped Lyman $\\alpha$ systems (DLAs) with $M_{\\rm{HI}}>10^9\\ M_{\\odot}$.\nOur model shows that the typical MgII metrics used in the literature to\nidentify the presence of DLAs are sensitive to the gas covering fraction.\nHowever, these MgII metrics are still sensitive to strong HI, and can be still\napplied to absorbers towards gravitational arcs or other spatially extended\nbackground sources. Based on our results, we speculate that the two strong\nabsorbers are likely representative of a neutral inner circumgalactic medium\nand are a significant reservoir of fuel for star formation within the host\ngalaxies.\n",
  "subjects": [
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "6aW_HFqRK1DDxlqCWmt0jMWXcw7M3_Onm6g6_OLt3rk",
  "pdfSize": "5633125"
}