{"id":"2412.07768","title":"Test-time Correction with Human Feedback: An Online 3D Detection System\n  via Visual Prompting","authors":"Zetong Yang, Hanxue Zhang, Yanan Sun, Li Chen, Fei Xia, Fatma G\\\"uney,\n  Hongyang Li","authorsParsed":[["Yang","Zetong",""],["Zhang","Hanxue",""],["Sun","Yanan",""],["Chen","Li",""],["Xia","Fei",""],["Güney","Fatma",""],["Li","Hongyang",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 18:59:32 GMT"},{"version":"v2","created":"Wed, 11 Dec 2024 03:04:20 GMT"}],"updateDate":"2024-12-12","timestamp":1733857172000,"abstract":"  This paper introduces Test-time Correction (TTC) system, a novel online 3D\ndetection system designated for online correction of test-time errors via human\nfeedback, to guarantee the safety of deployed autonomous driving systems.\nUnlike well-studied offline 3D detectors frozen at inference, TTC explores the\ncapability of instant online error rectification. By leveraging user feedback\nwith interactive prompts at a frame, e.g., a simple click or draw of boxes, TTC\ncould immediately update the corresponding detection results for future\nstreaming inputs, even though the model is deployed with fixed parameters. This\nenables autonomous driving systems to adapt to new scenarios immediately and\ndecrease deployment risks reliably without additional expensive training. To\nachieve such TTC system, we equip existing 3D detectors with Online Adapter\n(OA) module, a prompt-driven query generator for online correction. At the core\nof OA module are visual prompts, images of missed object-of-interest for\nguiding the corresponding detection and subsequent tracking. Those visual\nprompts, belonging to missed objects through online inference, are maintained\nby the visual prompt buffer for continuous error correction in subsequent\nframes. By doing so, TTC consistently detects online missed objects and\nimmediately lowers driving risks. It achieves reliable, versatile, and adaptive\ndriving autonomy. Extensive experiments demonstrate significant gain on instant\nerror rectification over pre-trained 3D detectors, even in challenging\nscenarios with limited labels, zero-shot detection, and adverse conditions. We\nhope this work would inspire the community to investigate online rectification\nsystems for autonomous driving post-deployment. Code would be publicly shared.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ppoCfWgj973lUIUVsrLbuNfs66wDVZmL7Yn9ZzA9fbQ","pdfSize":"21044916"}