{
  "id": "2412.16428",
  "title": "Data-Driven Fairness Generalization for Deepfake Detection",
  "authors": "Uzoamaka Ezeakunne, Chrisantus Eze, and Xiuwen Liu",
  "authorsParsed": [
    [
      "Ezeakunne",
      "Uzoamaka",
      ""
    ],
    [
      "Eze",
      "Chrisantus",
      ""
    ],
    [
      "Liu",
      "Xiuwen",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 21 Dec 2024 01:28:35 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 31 Dec 2024 07:15:01 GMT"
    }
  ],
  "updateDate": "2025-01-03",
  "timestamp": 1734744515000,
  "abstract": "  Despite the progress made in deepfake detection research, recent studies have\nshown that biases in the training data for these detectors can result in\nvarying levels of performance across different demographic groups, such as race\nand gender. These disparities can lead to certain groups being unfairly\ntargeted or excluded. Traditional methods often rely on fair loss functions to\naddress these issues, but they under-perform when applied to unseen datasets,\nhence, fairness generalization remains a challenge. In this work, we propose a\ndata-driven framework for tackling the fairness generalization problem in\ndeepfake detection by leveraging synthetic datasets and model optimization. Our\napproach focuses on generating and utilizing synthetic data to enhance fairness\nacross diverse demographic groups. By creating a diverse set of synthetic\nsamples that represent various demographic groups, we ensure that our model is\ntrained on a balanced and representative dataset. This approach allows us to\ngeneralize fairness more effectively across different domains. We employ a\ncomprehensive strategy that leverages synthetic data, a loss sharpness-aware\noptimization pipeline, and a multi-task learning framework to create a more\nequitable training environment, which helps maintain fairness across both\nintra-dataset and cross-dataset evaluations. Extensive experiments on benchmark\ndeepfake detection datasets demonstrate the efficacy of our approach,\nsurpassing state-of-the-art approaches in preserving fairness during\ncross-dataset evaluation. Our results highlight the potential of synthetic\ndatasets in achieving fairness generalization, providing a robust solution for\nthe challenges faced in deepfake detection.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Computers and Society"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "KzLmsat9tbpzT_TgInclL1hmx_Kg84VfTgF-5MuyCXg",
  "pdfSize": "1131945"
}