{"id":"2412.02606","title":"Ground State Energy Estimation on Current Quantum Hardware Through The\n  Variational Quantum Eigensolver: A Comprehensive Study","authors":"Nacer Eddine Belaloui, Abdellah Tounsi, Rabah Abdelmouheymen Khamadja,\n  Mohamed Messaoud Louamri, Achour Benslama, David E. Bernal Neira, Mohamed\n  Taha Rouabah","authorsParsed":[["Belaloui","Nacer Eddine",""],["Tounsi","Abdellah",""],["Khamadja","Rabah Abdelmouheymen",""],["Louamri","Mohamed Messaoud",""],["Benslama","Achour",""],["Neira","David E. Bernal",""],["Rouabah","Mohamed Taha",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 17:35:31 GMT"}],"updateDate":"2024-12-04","timestamp":1733247331000,"abstract":"  While numerical simulations are presented in most papers introducing new\nmethods to enhance the VQE performance, comprehensive, comparative, and applied\nstudies remain relatively rare. We present a comprehensive, yet concise guide\nfor the implementation of the VQE for molecular problems on NISQ devices,\nspecifically applied to estimate the ground state energy of the BeH2 molecule\nusing hardware-efficient and chemically informed ans\\\"atze. This work clarifies\nseveral under-documented aspects in the literature, such as the construction of\nthe electronic Hamiltonian, the transformation of fermionic operators into\nqubit operators via second quantization, and the mathematical framework's\ndetails for the unitary coupled cluster single and double (UCCSD) ansatz. Our\nmethodology, implemented using Qiskit 1.2, the latest release as of the date of\nthis writing, is demonstrated on a noiseless simulator and further tested with\nnoisy quantum circuits. The resilience of the VQE to quantum noise remains an\nopen question. This study compares the computational accuracy of ground state\nenergy estimations for molecules using the VQE across three different current\nquantum hardware noise models. Furthermore, our experiment on IBM's 156-qubit\nactual quantum computer revealed valuable insights on the real performance of\nthe VQE on current quantum hardware.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7XGo8DzZukKYV_1JcX2k2voveQ9cGrRGndIn9H-ETOA","pdfSize":"6915208"}