{
  "id": "2412.14090",
  "title": "N\\'eel-vector Control of Magnetization Dynamics in\n  $\\alpha$-Fe$_2$O$_3$/NiFe Heterostructures",
  "authors": "Hassan Al-Hamdo, Tobias Wagner, Philipp Schwenke, Gutenberg Kendzo,\n  Maximilian Dausend, Laura Scheuer, Misbah Yaqoob, Vitaliy I. Vasyuchka,\n  Philipp Pirro, Olena Gomonay, and Mathias Weiler",
  "authorsParsed": [
    [
      "Al-Hamdo",
      "Hassan",
      ""
    ],
    [
      "Wagner",
      "Tobias",
      ""
    ],
    [
      "Schwenke",
      "Philipp",
      ""
    ],
    [
      "Kendzo",
      "Gutenberg",
      ""
    ],
    [
      "Dausend",
      "Maximilian",
      ""
    ],
    [
      "Scheuer",
      "Laura",
      ""
    ],
    [
      "Yaqoob",
      "Misbah",
      ""
    ],
    [
      "Vasyuchka",
      "Vitaliy I.",
      ""
    ],
    [
      "Pirro",
      "Philipp",
      ""
    ],
    [
      "Gomonay",
      "Olena",
      ""
    ],
    [
      "Weiler",
      "Mathias",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 17:37:07 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734543427000,
  "abstract": "  We investigate spin dynamics in $\\alpha$-Fe$_{2}$O$_{3}$/Ni$_{80}$Fe$_{20}$\n(Py) heterostructures, uncovering a robust mechanism for in-situ modulation of\nferromagnetic resonance (FMR) through precise control of temperature, applied\nmagnetic field and crystal orientation. Employing cryogenic ferromagnetic\nresonance spectroscopy, we demonstrate that the interfacial coupling between\nthe N\\'eel vector of $\\alpha$-Fe$_{2}$O$_{3}$ and the magnetization of the Py\nlayer is highly tunable across the Morin transition temperature $(T_M)$. Our\nexperiments reveal distinct resonance behavior for different crystal\norientations, highlighting the pivotal role of exchange coupling strength in\ndictating FMR frequencies. Theoretical modeling corroborates the experimental\nfindings, elucidating the dependence of coupling on the relative alignment of\nthe N\\'eel vector and ferromagnetic magnetization. Notably, we achieve\nsignificant modulation of FMR frequencies by manipulating the N\\'eel vector\nconfiguration, facilitated by temperature variations, applied magnetic fields\nand crystal orientation adjustments. These advancements demonstrate the\npotential for dynamic control of spin interactions in AFM/FM heterostructures,\npaving the way for the development of advanced spintronic devices with tunable\nmagnetic properties. Our work provides critical insights into the fundamental\ninteractions governing hybrid spin systems and opens new avenues for the design\nof versatile, temperature-responsive magnetoelectronic applications.\n",
  "subjects": [
    "Condensed Matter/Mesoscale and Nanoscale Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "-zbxEZf9VsguLHWDldtApG-r1PAI-neU_tSOzIhPjH4",
  "pdfSize": "1642439"
}