{"id":"2412.05376","title":"Binary and Grouped Open Clusters: A New Catalogue","authors":"Tali Palma, Valeria Coenda, Gustavo Baume, Carlos Feinstein","authorsParsed":[["Palma","Tali",""],["Coenda","Valeria",""],["Baume","Gustavo",""],["Feinstein","Carlos",""]],"versions":[{"version":"v1","created":"Fri, 6 Dec 2024 19:06:50 GMT"}],"updateDate":"2025-01-22","timestamp":1733512010000,"abstract":"  Context. Understanding the formation and evolution of star clusters in the\nMilky Way requires precise identification of clusters that form binary or\nmultiple systems. Such systems offer valuable insight into the dynamical\nprocesses and interactions that influence cluster evolution. Aims. This study\naims to identify and classify star clusters in the Milky Way as part of double\nor multiple systems. Specifically, we seek to detect clusters that form\ngravitationally bound pairs or groups of clusters and distinguish between\ndifferent types of interactions based on their physical properties and spatial\ndistributions. Methods. We used the extensive star cluster database of Hunt &\nReffert (2023, 2024), which includes 7167 clusters. By estimating the tidal\nforces acting on each cluster through the tidal factor (TF), and considering\nonly close neighbours (within 50 pc), we identified a total of 2170 star\nclusters forming part of double and multiple systems. Pairs were classified as\nBinaries (B), Capture pairs (C), or Optical pairs (O/Oa) based on proper motion\ndistributions, cluster ages, and color-magnitude diagrams. Results. Our\nanalysis identified 617 paired systems, which were successfully classified\nusing our scheme. Additionally, we found 261 groups of star clusters, each with\nthree or more members, further supporting the presence of multiple systems\nwithin the Milky Way that exhibit significant tidal interactions. Conclusions.\nThe method presented provides an improved approach for identifying star\nclusters that share the same spatial volume and experience notable tidal\ninteractions.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ioIFzLOVq_0qkDlx0sTBqCbj2pIVG4HaPqG-KgV_eJY","pdfSize":"970896"}