{
  "id": "2412.01883",
  "title": "Disordered topological crystalline phases",
  "authors": "Adam Yanis Chaou, Mateo Moreno-Gonzalez, Alexander Altland and Piet W.\n  Brouwer",
  "authorsParsed": [
    [
      "Chaou",
      "Adam Yanis",
      ""
    ],
    [
      "Moreno-Gonzalez",
      "Mateo",
      ""
    ],
    [
      "Altland",
      "Alexander",
      ""
    ],
    [
      "Brouwer",
      "Piet W.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 19:00:00 GMT"
    }
  ],
  "updateDate": "2024-12-04",
  "timestamp": 1733166000000,
  "abstract": "  The imposition of crystalline symmetries is known to lead to a rich variety\nof insulating and superconducting topological phases. These include\nhigher-order topological phases and obstructed atomic limits with and without\nfilling anomalies. We here comprehensively classify such topological\ncrystalline phases (TCPs) with mirror, twofold rotation, and inversion\nsymmetries in the presence of disorder that preserves the crystalline symmetry\non average. We find that the inclusion of disorder leads to a simplification of\nthe classification in comparison to the clean case. We also find that, while\nclean TCPs evade a general bulk-boundary principle, disordered TCPs admit a\ncomplete bulk-boundary correspondence, according to which (bulk) topological\nphases are topologically equivalent if and only if they have the same anomalous\nboundary states and filling anomaly. We corroborate the stability of disordered\nTCPs by way of field-theoretic, numerical and symmetry-based analyses in\nvarious case studies. While the boundary signatures of most disordered TCPs are\nsimilar to their clean counterparts, the addition of disorder to certain\nmirror-symmetric TCPs results in novel higher-order statistical topological\nphases, in which zero-energy hinge states have critical wavefunction\nstatistics, while remaining protected from Anderson localization.\n",
  "subjects": [
    "Condensed Matter/Mesoscale and Nanoscale Physics",
    "Condensed Matter/Disordered Systems and Neural Networks"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "n2Tz1C2QNP-g-8QEMhZ8220K-cNzfvEUo-pFv08pvTw",
  "pdfSize": "1453523"
}