{
  "id": "2412.12777",
  "title": "Phase-field modeling of colloid-polymer mixtures in microgravity",
  "authors": "Lauren Barnes, Boris Khusid, Lou Kondic, William V. Meyer, Anand U.\n  Oza",
  "authorsParsed": [
    [
      "Barnes",
      "Lauren",
      ""
    ],
    [
      "Khusid",
      "Boris",
      ""
    ],
    [
      "Kondic",
      "Lou",
      ""
    ],
    [
      "Meyer",
      "William V.",
      ""
    ],
    [
      "Oza",
      "Anand U.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 10:37:17 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734431837000,
  "abstract": "  Colloid-polymer mixtures are an archetype for modeling phase transition\nprocesses, as they a exhibit low-density gas phase, high-density crystalline\nphase and an intervening liquid phase. While their equilibrium behavior has\nbeen studied extensively, the role of hydrodynamics in driving their phase\nseparation is not yet understood. We present a theoretical model that describes\nhydrodynamic interactions in colloid-polymer mixtures in a microgravity\nenvironment. Our phase-field model consists of the Cahn-Hilliard equation,\nwhich describes phase separation processes in multicomponent mixtures, coupled\nwith the Stokes equation for viscous fluid flow. We account for the dependence\nof the suspension viscosity on the colloid concentration, and the so-called\nKorteweg stresses that arise at the interfaces of colloidal phases. We process\nvideo microscopy images from NASA's Binary Colloid Alloy Test (BCAT)\nexperiments, which were performed on the International Space Station. While\nterrestrial experiments would be dominated by gravitational forces and\nbuoyancy-driven flows, the microgravity environment of the BCAT experiments\nallows for the visualization of phase separation by low interfacial tension,\nand thus enables a quantitative comparison between experiment and our model\npredictions.\n",
  "subjects": [
    "Condensed Matter/Soft Condensed Matter"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "-tW--YUvhodZLSpngD8rHD6YyBTUpKygKce9Q8k8VcM",
  "pdfSize": "9367780"
}