{
  "id": "2412.03923",
  "title": "Predictions of Dust Continuum Emission from a Potential Circumplanetary\n  Disk: A Case Study of the Planet Candidate AB Aurigae b",
  "authors": "Yuhito Shibaike, Jun Hashimoto, Ruobing Dong, Christoph Mordasini,\n  Misato Fukagawa, Takayuki Muto",
  "authorsParsed": [
    [
      "Shibaike",
      "Yuhito",
      ""
    ],
    [
      "Hashimoto",
      "Jun",
      ""
    ],
    [
      "Dong",
      "Ruobing",
      ""
    ],
    [
      "Mordasini",
      "Christoph",
      ""
    ],
    [
      "Fukagawa",
      "Misato",
      ""
    ],
    [
      "Muto",
      "Takayuki",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 06:54:48 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733381688000,
  "abstract": "  Gas accreting planets embedded in protoplanetary disks are expected to show\ndust thermal emission from their circumplanetary disks (CPDs). However, a\nrecently reported gas accreting planet candidate, AB Aurigae b, has not been\ndetected in (sub)millimeter continuum observations. We calculate the evolution\nof dust in the potential CPD of AB Aurigae b and predict its thermal emission\nat 1.3 mm wavelength as a case study, where the obtained features may also be\napplied to other gas accreting planets. We find that the expected flux density\nfrom the CPD is lower than the 3-sigma level of the previous continuum\nobservation by ALMA with broad ranges of parameters, consistent with the\nnon-detection. However, the expected planet mass and gas accretion rate are\nhigher if the reduction of the observed near-infrared continuum and H-alpha\nline emission due to the extinction by small grains is considered, resulting in\nhigher flux density of the dust emission from the CPD at (sub)millimeter\nwavelength. We find that the corrected predictions of the dust emission are\nstronger than the 3-sigma level of the previous observation with the typical\ndust-to-gas mass ratio of the inflow to the CPD. This result suggests that the\ndust supply to the vicinity of AB Aurigae b is small if the planet candidate is\nnot the scattered light of the star but is a planet and has a CPD. Future\ncontinuum observations at shorter wavelength are preferable to obtain more\nrobust clues to the question whether the candidate is a planet or not.\n",
  "subjects": [
    "Astrophysics/Earth and Planetary Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "KcJw5XHpRG_Dgzc2AE-uwgKpApqJqcdbYqtjYhUHS50",
  "pdfSize": "4307876"
}