{"id":"2412.17812","title":"FaceLift: Single Image to 3D Head with View Generation and GS-LRM","authors":"Weijie Lyu, Yi Zhou, Ming-Hsuan Yang, Zhixin Shu","authorsParsed":[["Lyu","Weijie",""],["Zhou","Yi",""],["Yang","Ming-Hsuan",""],["Shu","Zhixin",""]],"versions":[{"version":"v1","created":"Mon, 23 Dec 2024 18:59:49 GMT"}],"updateDate":"2024-12-24","timestamp":1734980389000,"abstract":"  We present FaceLift, a feed-forward approach for rapid, high-quality,\n360-degree head reconstruction from a single image. Our pipeline begins by\nemploying a multi-view latent diffusion model that generates consistent side\nand back views of the head from a single facial input. These generated views\nthen serve as input to a GS-LRM reconstructor, which produces a comprehensive\n3D representation using Gaussian splats. To train our system, we develop a\ndataset of multi-view renderings using synthetic 3D human head as-sets. The\ndiffusion-based multi-view generator is trained exclusively on synthetic head\nimages, while the GS-LRM reconstructor undergoes initial training on Objaverse\nfollowed by fine-tuning on synthetic head data. FaceLift excels at preserving\nidentity and maintaining view consistency across views. Despite being trained\nsolely on synthetic data, FaceLift demonstrates remarkable generalization to\nreal-world images. Through extensive qualitative and quantitative evaluations,\nwe show that FaceLift outperforms state-of-the-art methods in 3D head\nreconstruction, highlighting its practical applicability and robust performance\non real-world images. In addition to single image reconstruction, FaceLift\nsupports video inputs for 4D novel view synthesis and seamlessly integrates\nwith 2D reanimation techniques to enable 3D facial animation. Project page:\nhttps://weijielyu.github.io/FaceLift.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Graphics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"06RBY1JmnjdGWiM3gJFd3yGQAUYIqoxFchhiaMeMMEU","pdfSize":"48854125"}