{
  "id": "2412.06159",
  "title": "Model-independent constraints on Lorentz Invariance Violation with\n  update observations of Gamma-Ray Bursts",
  "authors": "Yu Pan, Jun Tian, Shuo Cao, Qing-Quan Jiang, Wei-Liang Qian",
  "authorsParsed": [
    [
      "Pan",
      "Yu",
      ""
    ],
    [
      "Tian",
      "Jun",
      ""
    ],
    [
      "Cao",
      "Shuo",
      ""
    ],
    [
      "Jiang",
      "Qing-Quan",
      ""
    ],
    [
      "Qian",
      "Wei-Liang",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 02:42:26 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733712146000,
  "abstract": "  Searching the possible Lorentz Invariance Violation (LIV) from astrophysical\nsources such as gamma-ray bursts (GRBs) is essential for finding evidences of\nnew theories of quantum gravity. However, the effect of the underlying\ncosmological model is still understudied in the previous analysis. We take a\nnovel approach using artificial neural networks to reconstruct the expansion\nhistory of the universe, thereby eliminating the influence of potential\ncosmological models to constrain LIV. 74 time delays from GRBs are considered\nto obtain stringent results on LIV, including 37 time delays measurements from\nGRB 160625B across various energy bands at redshift $z = 1.41$, and 37\nadditional GRBs with time delays spanning redshifts $0.117\\leq z \\leq1.99$. Our\nanalysis yields stringent constraints on both linear and quadratic LIV, with\n$E_{QG,1} \\geq 2.63 \\times 10^{15}$ $GeV$ and $ E_{QG,2} \\geq 1.19 \\times\n10^{10}$ $GeV$ that are four and nine orders of magnitude beneath the Planck\nenergy scale, and shows the positive intrinsic time delay in GRBs. Our results\ndemonstrate that such combination would significantly improve the precision and\nrobustness of final results. Taking this into account may be an important\ncontribution in the case of possible LIV detection in the future.\n",
  "subjects": [
    "Astrophysics/High Energy Astrophysical Phenomena"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "mGabl42hyWR_56tMzIJA9dS9lR40biRY5Rm7CKjuKlo",
  "pdfSize": "475938"
}