{
  "id": "2412.14529",
  "title": "Leveraging Time Series Categorization and Temporal Fusion Transformers\n  to Improve Cryptocurrency Price Forecasting",
  "authors": "Arash Peik, Mohammad Ali Zare Chahooki, Amin Milani Fard, Mehdi Agha\n  Sarram",
  "authorsParsed": [
    [
      "Peik",
      "Arash",
      ""
    ],
    [
      "Chahooki",
      "Mohammad Ali Zare",
      ""
    ],
    [
      "Fard",
      "Amin Milani",
      ""
    ],
    [
      "Sarram",
      "Mehdi Agha",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 04:57:55 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734584275000,
  "abstract": "  Organizing and managing cryptocurrency portfolios and decision-making on\ntransactions is crucial in this market. Optimal selection of assets is one of\nthe main challenges that requires accurate prediction of the price of\ncryptocurrencies. In this work, we categorize the financial time series into\nseveral similar subseries to increase prediction accuracy by learning each\nsubseries category with similar behavior. For each category of the subseries,\nwe create a deep learning model based on the attention mechanism to predict the\nnext step of each subseries. Due to the limited amount of cryptocurrency data\nfor training models, if the number of categories increases, the amount of\ntraining data for each model will decrease, and some complex models will not be\ntrained well due to the large number of parameters. To overcome this challenge,\nwe propose to combine the time series data of other cryptocurrencies to\nincrease the amount of data for each category, hence increasing the accuracy of\nthe models corresponding to each category.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Computational Engineering, Finance, and Science",
    "Quantitative Finance/Statistical Finance"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "KIiSsotB7NMngI0O5riyp_jF-QkQNnTu8NgLu_i3FGM",
  "pdfSize": "678142"
}