{"id":"2412.00351","title":"Multi-scale Feature Enhancement in Multi-task Learning for Medical Image\n  Analysis","authors":"Phuoc-Nguyen Bui, Duc-Tai Le, Junghyun Bum, Hyunseung Choo","authorsParsed":[["Bui","Phuoc-Nguyen",""],["Le","Duc-Tai",""],["Bum","Junghyun",""],["Choo","Hyunseung",""]],"versions":[{"version":"v1","created":"Sat, 30 Nov 2024 04:20:05 GMT"}],"updateDate":"2024-12-03","timestamp":1732940405000,"abstract":"  Traditional deep learning methods in medical imaging often focus solely on\nsegmentation or classification, limiting their ability to leverage shared\ninformation. Multi-task learning (MTL) addresses this by combining both tasks\nthrough shared representations but often struggles to balance local spatial\nfeatures for segmentation and global semantic features for classification,\nleading to suboptimal performance. In this paper, we propose a simple yet\neffective UNet-based MTL model, where features extracted by the encoder are\nused to predict classification labels, while the decoder produces the\nsegmentation mask. The model introduces an advanced encoder incorporating a\nnovel ResFormer block that integrates local context from convolutional feature\nextraction with long-range dependencies modeled by the Transformer. This design\ncaptures broader contextual relationships and fine-grained details, improving\nclassification and segmentation accuracy. To enhance classification\nperformance, multi-scale features from different encoder levels are combined to\nleverage the hierarchical representation of the input image. For segmentation,\nthe features passed to the decoder via skip connections are refined using a\nnovel dilated feature enhancement (DFE) module, which captures information at\ndifferent scales through three parallel convolution branches with varying\ndilation rates. This allows the decoder to detect lesions of varying sizes with\ngreater accuracy. Experimental results across multiple medical datasets confirm\nthe superior performance of our model in both segmentation and classification\ntasks, compared to state-of-the-art single-task and multi-task learning\nmethods.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"qlLH4R5vnh9SLhbyFJthudy18vOW0tI9Ye75PiGVn7E","pdfSize":"867962"}