{"id":"2412.07144","title":"Political Actor Agent: Simulating Legislative System for Roll Call Votes\n  Prediction with Large Language Models","authors":"Hao Li, Ruoyuan Gong, Hao Jiang","authorsParsed":[["Li","Hao",""],["Gong","Ruoyuan",""],["Jiang","Hao",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 03:06:28 GMT"},{"version":"v2","created":"Fri, 13 Dec 2024 04:05:05 GMT"}],"updateDate":"2024-12-16","timestamp":1733799988000,"abstract":"  Predicting roll call votes through modeling political actors has emerged as a\nfocus in quantitative political science and computer science. Widely used\nembedding-based methods generate vectors for legislators from diverse data sets\nto predict legislative behaviors. However, these methods often contend with\nchallenges such as the need for manually predefined features, reliance on\nextensive training data, and a lack of interpretability. Achieving more\ninterpretable predictions under flexible conditions remains an unresolved\nissue. This paper introduces the Political Actor Agent (PAA), a novel\nagent-based framework that utilizes Large Language Models to overcome these\nlimitations. By employing role-playing architectures and simulating legislative\nsystem, PAA provides a scalable and interpretable paradigm for predicting\nroll-call votes. Our approach not only enhances the accuracy of predictions but\nalso offers multi-view, human-understandable decision reasoning, providing new\ninsights into political actor behaviors. We conducted comprehensive experiments\nusing voting records from the 117-118th U.S. House of Representatives,\nvalidating the superior performance and interpretability of PAA. This study not\nonly demonstrates PAA's effectiveness but also its potential in political\nscience research.\n","subjects":["Computer Science/Artificial Intelligence","Computer Science/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"k1MXLxu9yX6mBgXTXEfE2ax-E4gpgKx4-wGykTnb3ug","pdfSize":"681160"}