{"id":"2412.10826","title":"Generative AI: A Pix2pix-GAN-Based Machine Learning Approach for Robust\n  and Efficient Lung Segmentation","authors":"Sharmin Akter","authorsParsed":[["Akter","Sharmin",""]],"versions":[{"version":"v1","created":"Sat, 14 Dec 2024 13:12:09 GMT"}],"updateDate":"2024-12-17","timestamp":1734181929000,"abstract":"  Chest radiography is climacteric in identifying different pulmonary diseases,\nyet radiologist workload and inefficiency can lead to misdiagnoses. Automatic,\naccurate, and efficient segmentation of lung from X-ray images of chest is\nparamount for early disease detection. This study develops a deep learning\nframework using a Pix2pix Generative Adversarial Network (GAN) to segment\npulmonary abnormalities from CXR images. This framework's image preprocessing\nand augmentation techniques were properly incorporated with a U-Net-inspired\ngenerator-discriminator architecture. Initially, it loaded the CXR images and\nmanual masks from the Montgomery and Shenzhen datasets, after which\npreprocessing and resizing were performed. A U-Net generator is applied to the\nprocessed CXR images that yield segmented masks; then, a Discriminator Network\ndifferentiates between the generated and real masks. Montgomery dataset served\nas the model's training set in the study, and the Shenzhen dataset was used to\ntest its robustness, which was used here for the first time. An adversarial\nloss and an L1 distance were used to optimize the model in training. All\nmetrics, which assess precision, recall, F1 score, and Dice coefficient, prove\nthe effectiveness of this framework in pulmonary abnormality segmentation. It,\ntherefore, sets the basis for future studies to be performed shortly using\ndiverse datasets that could further confirm its clinical applicability in\nmedical imaging.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computer Science/Artificial Intelligence","Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"IUR9Dqd0IRy-FpwUP-X7dueVlMSxwes3eJW1GWGpBas","pdfSize":"683346"}