{
  "id": "2412.01878",
  "title": "The Origins of Lithium Enhancement in Polluted White Dwarfs",
  "authors": "Benjamin C. Kaiser, J. Christopher Clemens, Simon Blouin, Erik\n  Dennihy, Patrick Dufour, Ryan J. Hegedus, Joshua S. Reding",
  "authorsParsed": [
    [
      "Kaiser",
      "Benjamin C.",
      ""
    ],
    [
      "Clemens",
      "J. Christopher",
      ""
    ],
    [
      "Blouin",
      "Simon",
      ""
    ],
    [
      "Dennihy",
      "Erik",
      ""
    ],
    [
      "Dufour",
      "Patrick",
      ""
    ],
    [
      "Hegedus",
      "Ryan J.",
      ""
    ],
    [
      "Reding",
      "Joshua S.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 19:00:00 GMT"
    }
  ],
  "updateDate": "2024-12-04",
  "timestamp": 1733166000000,
  "abstract": "  The bulk abundances of exoplanetesimals can be measured when they are\naccreted by white dwarfs. Recently, lithium from the accretion of\nexoplanetesimals was detected in relatively high levels in multiple white\ndwarfs. There are presently three proposed hypotheses to explain the detection\nof excess lithium in white dwarf photospheres: Big Bang and Galactic\nnucleosynthesis, continental crust, and an exomoon formed from spalled ring\nmaterial. We present new observations of three previously known\nlithium-polluted white dwarfs (WD J1824+1213, WD J2317+1830, and LHS 2534), and\none with metal pollution without lithium (SDSS J1636+1619). We also present\natmospheric model fits to these white dwarfs. We then evaluate the abundances\nof these white dwarfs and two additional lithium-polluted white dwarfs that\nwere previously fit using the same atmospheric models (WD J1644$-$0449 and SDSS\nJ1330+6435) in the context of the three extant hypotheses for explaining\nlithium excesses in polluted white dwarfs. We find Big Bang and Galactic\nnucleosynthesis to be the most plausible explanation of the abundances in WD\nJ1644$-$0449, WD J1824+1213, and WD J2317+1830. SDSS J1330+6435 will require\nstricter abundances to determine its planetesimal's origins, and LHS 2534, as\npresently modeled, defies all three hypotheses. We find the accretion of an\nexomoon formed from spalled ring material to be highly unlikely to be the\nexplanation of the lithium excess in any of these cases.\n",
  "subjects": [
    "Astrophysics/Earth and Planetary Astrophysics",
    "Astrophysics/Solar and Stellar Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "xATR5emFFIUW4-h6HnURjugl-sU7IkH36WIQEL6v4JQ",
  "pdfSize": "1448841"
}