{"id":"2412.10332","title":"Cavitation Onset in an Impulsively Accelerated Liquid Column","authors":"Taj Sobral, John Kokkalis, Kay Romann, Jovan Nedi\\'c, Andrew J.\n  Higgins","authorsParsed":[["Sobral","Taj",""],["Kokkalis","John",""],["Romann","Kay",""],["Nedić","Jovan",""],["Higgins","Andrew J.",""]],"versions":[{"version":"v1","created":"Fri, 13 Dec 2024 18:19:13 GMT"}],"updateDate":"2024-12-16","timestamp":1734113953000,"abstract":"  This paper introduces a novel piston-driven apparatus to study the onset of\ncavitation in an impulsively accelerated liquid column as it compresses a\nclosed gas volume. The experiment is monitored using high-speed videography and\npiezoelectric pressure transducers. Cavitation onset is observed in the liquid\ncolumn as it undergoes an abrupt deceleration and is associated with a sudden\ndrop in pressure in the liquid that leads to negative pressure (tension). A\nnovel numerical modeling approach is introduced where the liquid column is\ntreated as a spring-mass system. This approach can reproduce compressibility\neffects in the liquid column and is used to investigate the wave dynamics\nresponsible for the onset of tension and cavitation in the liquid column. The\nmodel is formulated as a coupled set of non-linear differential equations that\nreproduce the dynamics of an experiment while capturing the pressure wave\nactivity in the liquid column. A parametric study is conducted experimentally\nand numerically to investigate the behavior behind the onset of cavitation. The\nmechanism for the onset of cavitation is identified as a series of wave\nreflections at the boundaries of the liquid column, and this mechanism is found\nto be well reproduced by the model. While a traditional cavitation number\ncriterion is shown to be unable to predict cavitation onset in our experiment,\nour numerical model is found to correctly predict the onset of cavitation for a\nwide range of experimental parameters.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"DVqFJAxWu9w7nmOBPpO0MKBjVBZIC_ZNnoRD1RKkVgc","pdfSize":"3165322"}