{
  "id": "2412.03498",
  "title": "A Bidirectional Siamese Recurrent Neural Network for Accurate Gait\n  Recognition Using Body Landmarks",
  "authors": "Proma Hossain Progga, Md. Jobayer Rahman, Swapnil Biswas, Md. Shakil\n  Ahmed, Arif Reza Anwary and Swakkhar Shatabda",
  "authorsParsed": [
    [
      "Progga",
      "Proma Hossain",
      ""
    ],
    [
      "Rahman",
      "Md. Jobayer",
      ""
    ],
    [
      "Biswas",
      "Swapnil",
      ""
    ],
    [
      "Ahmed",
      "Md. Shakil",
      ""
    ],
    [
      "Anwary",
      "Arif Reza",
      ""
    ],
    [
      "Shatabda",
      "Swakkhar",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 17:39:55 GMT"
    },
    {
      "version": "v2",
      "created": "Thu, 5 Dec 2024 03:47:49 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733333995000,
  "abstract": "  Gait recognition is a significant biometric technique for person\nidentification, particularly in scenarios where other physiological biometrics\nare impractical or ineffective. In this paper, we address the challenges\nassociated with gait recognition and present a novel approach to improve its\naccuracy and reliability. The proposed method leverages advanced techniques,\nincluding sequential gait landmarks obtained through the Mediapipe pose\nestimation model, Procrustes analysis for alignment, and a Siamese\nbiGRU-dualStack Neural Network architecture for capturing temporal\ndependencies. Extensive experiments were conducted on large-scale cross-view\ndatasets to demonstrate the effectiveness of the approach, achieving high\nrecognition accuracy compared to other models. The model demonstrated\naccuracies of 95.7%, 94.44%, 87.71%, and 86.6% on CASIA-B, SZU RGB-D, OU-MVLP,\nand Gait3D datasets respectively. The results highlight the potential\napplications of the proposed method in various practical domains, indicating\nits significant contribution to the field of gait recognition.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "v6P7vD58OLg2BW4UNqFMc738U6U3lYk-BFG08FGL45w",
  "pdfSize": "4470962"
}