{"id":"2412.20181","title":"Can solvents tie knots? Helical folds of biopolymers in liquid\n  environments","authors":"Rhoslyn Coles and Myfanwy E. Evans","authorsParsed":[["Coles","Rhoslyn",""],["Evans","Myfanwy E.",""]],"versions":[{"version":"v1","created":"Sat, 28 Dec 2024 15:37:36 GMT"}],"updateDate":"2024-12-31","timestamp":1735400256000,"abstract":"  Helices are the quintessential geometric motif of microscale self-assembly,\nfrom $\\alpha$-helices in proteins to double helices in DNA. Assembly of the\nhelical geometry of biopolymers is a foundational step in a hierarchy of\nstructure that eventually leads to biological activity. Simulating\nself-assembly in a simplified and controlled setting allows us to probe the\nrelevance of the solvent as a component of the system of collaborative\nprocesses governing biomaterials. Using a simulation technique based on the\nmorphometric approach to solvation, we performed computer experiments which\nfold a short open flexible tube, modelling a biopolymer in an aqueous\nenvironment, according to the interaction of the tube with the solvent alone.\nDifferent fluid environments may favour quite different solute geometry: We\nfind an array of helical geometries that self-assemble depending on the solvent\nconditions, including overhand knot shapes and symmetric double helices where\nthe strand folds back on itself. Interestingly these shapes-in all their\nvariety-are energetically favoured over the $\\alpha$-helix. In differentiating\nthe role of solvation in self-assembly our study helps illuminate the energetic\nbackground scenery in which all soluble biomolecules live, indeed our results\ndemonstrate that the solvent is capable of quite fundamental rearrangements\neven up to tying a simple overhand knot.\n","subjects":["Condensed Matter/Soft Condensed Matter","Mathematics/Geometric Topology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"CV6SinegOzZqPgniOxxXDstoOolA9aexXH_XwkYIw38","pdfSize":"3284794"}