{"id":"2412.09581","title":"Probabilistic Shaping for Nonlinearity Tolerance","authors":"Mohammad Taha Askari and Lutz Lampe","authorsParsed":[["Askari","Mohammad Taha",""],["Lampe","Lutz",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 18:54:42 GMT"}],"updateDate":"2024-12-13","timestamp":1734029682000,"abstract":"  Optimizing the input probability distribution of a discrete-time channel is a\nstandard step in the information-theoretic analysis of digital communication\nsystems. Nevertheless, many practical communication systems transmit uniformly\nand independently distributed symbols drawn from regular constellation sets.\nThe introduction of the probabilistic amplitude shaping architecture has\nrenewed interest in using optimized probability distributions, i.e.,\nprobabilistic shaping. Traditionally, probabilistic shaping has been employed\nto reduce the transmit power required for a given information rate over\nadditive noise channels. While this translates into substantive performance\ngains for optical fiber communication systems, the interaction of shaping and\nfiber nonlinearity has posed intriguing questions. At first glance,\nprobabilistic shaping seems to exacerbate nonlinear interference noise (NLIN)\ndue to larger higher-order standardized moments. Therefore, the optimization of\nshaping distributions must differ from those used for linear channels.\nSecondly, finite-length effects related to the memory of the nonlinear fiber\nchannel have been observed. This suggests that the marginal input-symbol\ndistribution is not the only consideration. This paper provides a\ntutorial-style discussion of probabilistic shaping for optical fiber\ncommunication. Since the distinguishing property of the channel is the\nsignal-dependent NLIN, we speak of probabilistic shaping for nonlinearity\ntolerance. Our analysis builds on the first-order time-domain perturbation\napproximation of the nonlinear fiber channel and revisits the notion of linear\nand nonlinear shaping gain. We largely focus on probabilistic amplitude shaping\nwith popular shaping methods. The concept of shaping via sequence selection is\ngiven special consideration, as it inherently optimizes a multivariate\ndistribution for shaped constellations.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computer Science/Information Theory","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"VcGIgOnzN4SZ1UUzbl2U-dt31TFEZFUnde0aqBNZfbM","pdfSize":"721032"}