{
  "id": "2412.06992",
  "title": "Quantifying the Dynamics of Innovation Abandonment Across Scientific,\n  Technological, Commercial, and Pharmacological Domains",
  "authors": "Binglu Wang, Ching Jin, Chaoming Song, Johannes Bjelland, Brian Uzzi,\n  Dashun Wang",
  "authorsParsed": [
    [
      "Wang",
      "Binglu",
      ""
    ],
    [
      "Jin",
      "Ching",
      ""
    ],
    [
      "Song",
      "Chaoming",
      ""
    ],
    [
      "Bjelland",
      "Johannes",
      ""
    ],
    [
      "Uzzi",
      "Brian",
      ""
    ],
    [
      "Wang",
      "Dashun",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 20:59:33 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733777973000,
  "abstract": "  Despite the vast literature on the diffusion of innovations that impacts a\nbroad range of disciplines, our understanding of the abandonment of innovations\nremains limited yet is essential for a deeper understanding of the innovation\nlifecycle. Here, we analyze four large-scale datasets that capture the temporal\nand structural patterns of innovation abandonment across scientific,\ntechnological, commercial, and pharmacological domains. The paper makes three\nprimary contributions. First, across these diverse domains, we uncover one\nsimple pattern of preferential abandonment, whereby the probability for\nindividuals or organizations to abandon an innovation increases with time and\ncorrelates with the number of network neighbors who have abandoned the\ninnovation. Second, we find that the presence of preferential abandonment\nfundamentally alters the way in which the underlying ecosystem breaks down,\ninducing a novel structural collapse in networked systems commonly perceived as\nrobust against abandonments. Third, we derive an analytical framework to\nsystematically understand the impact of preferential abandonment on network\ndynamics, pinpointing specific conditions where it may accelerate, decelerate,\nor have an identical effect compared to random abandonment, depending on the\nnetwork topology. Together, these results deepen our quantitative understanding\nof the abandonment of innovation within networked social systems, with\nimplications for the robustness and functioning of innovation communities.\nOverall, they demonstrate that the dynamics of innovation abandonment follow\nsimple yet reproducible patterns, suggesting that the uncovered preferential\nabandonment may be a generic property of the innovation lifecycle.\n",
  "subjects": [
    "Physics/Physics and Society",
    "Physics/Data Analysis, Statistics and Probability"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "IFLGqWjLAIEDW_PHnZGScdrqI7vNAncOXoiIHSvSnws",
  "pdfSize": "10369412"
}