{
  "id": "2412.07340",
  "title": "Investigation of in vitro neuronal activity processing using a\n  CMOS-integrated ZrO2-based memristive crossbar",
  "authors": "Maria N. Koryazhkina, Albina V. Lebedeva, Darina D. Pakhomova, Ivan N.\n  Antonov, Vyacheslav V. Razin, Elena D. Budylina, Alexey I. Belov, Alexey N.\n  Mikhaylov, Anton A. Konakov",
  "authorsParsed": [
    [
      "Koryazhkina",
      "Maria N.",
      ""
    ],
    [
      "Lebedeva",
      "Albina V.",
      ""
    ],
    [
      "Pakhomova",
      "Darina D.",
      ""
    ],
    [
      "Antonov",
      "Ivan N.",
      ""
    ],
    [
      "Razin",
      "Vyacheslav V.",
      ""
    ],
    [
      "Budylina",
      "Elena D.",
      ""
    ],
    [
      "Belov",
      "Alexey I.",
      ""
    ],
    [
      "Mikhaylov",
      "Alexey N.",
      ""
    ],
    [
      "Konakov",
      "Anton A.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 09:32:03 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733823123000,
  "abstract": "  The influence of the epileptiform neuronal activity on the response of a\nCMOS-integrated ZrO2-based memristive crossbar and its conductivity was\nstudied. Epileptiform neuronal activity was obtained in vitro in the\nhippocampus slices of laboratory mice using 4-aminopyridine experimental model.\nSynaptic plasticity of the memristive crossbar induced by epileptiform neuronal\nactivity pulses was detected. Qualitatively, the results obtained in the case\nof normal (without pathologies) and epileptiform neuronal activity with and\nwithout noise coincide. For quantitative analysis, the value of the relative\nchange in synaptic weight has been calculated for such important biological\nmechanisms of synapses as paired-pulse facilitation/depression, post-tetanic\npotentiation/depression, and long-term potentiation/depression. It has been\nshown that average value of the relative change in synaptic weight and its are\nsmaller mainly in the case of epileptiform neuronal activity pulses. An effect\nof the influence of noise included in the neuronal activity was found, which\nconsists in the fact that the current response of the memristive crossbar is\nsmaller in the presence of noise. The results of this study can be used in the\ndevelopment of new generation hardware-implemented computing devices with high\nperformance and energy efficiency for the tasks of restorative medicine and\nrobotics. In particular, using these results, neurohybrid devices can be\ndeveloped for processing epileptiform activity in real time and for its\nsuppression.\n",
  "subjects": [
    "Quantitative Biology/Neurons and Cognition",
    "Computer Science/Emerging Technologies",
    "Physics/Applied Physics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "M2qwhoCGFtA2A_cU6n72dphDPavrRH31_6sr9Vpkdu0",
  "pdfSize": "9339411"
}