{"id":"2412.06013","title":"Hydrogen Ionization Inside the Sun","authors":"V.A. Baturin, S.V. Ayukov, A.V. Oreshina, A.B. Gorshkov, V.K.\n  Gryaznov, I.L. Iosilevskiy, W. D\\\"appen","authorsParsed":[["Baturin","V. A.",""],["Ayukov","S. V.",""],["Oreshina","A. V.",""],["Gorshkov","A. B.",""],["Gryaznov","V. K.",""],["Iosilevskiy","I. L.",""],["Däppen","W.",""]],"versions":[{"version":"v1","created":"Sun, 8 Dec 2024 18:09:34 GMT"}],"updateDate":"2024-12-10","timestamp":1733681374000,"abstract":"  Hydrogen is the main chemical component of the solar plasma, and H-ionization\ndetermines basic properties of the first adiabatic exponent $\\Gamma_1$.\nHydrogen ionization remarkably differs from the ionization of other chemicals.\nDue to the large number concentration, H-ionization causes a very deep lowering\nof $\\Gamma_1$, and the lowering profile appears to be strongly asymmetric and\nextends over almost the entire solar convective zone. The excited states in the\nhydrogen atom are modelled with the help of a partition function, which\naccounts the internal degrees of freedom of the composed particle. A\ntemperature-dependent partition function with an asymptotic cut-off tail is\ndeduced from a solution of the quantum mechanical problem of the hydrogen atom\nin the plasma. We present a numerical simulation of hydrogen ionization,\ncalculated with two expressions for the partition function, Planck-Larkin (PL)\nand Starostin-Roerich (SR), respectively. The Hydrogen ionization is shifted\ntoward higher temperature in the SR-case compared to the PL-case. Different\nmodels for excited states of the hydrogen atom may change $\\Gamma_1$ by as much\nas $10^{-2}$. The behavior of the $\\Gamma_1$ profiles for pure hydrogen\nresembles `twisted ropes' for the two considered models. This significantly\naffects the helium ionization and the position of the helium hump. This\nentanglement of H and He effect gives us a chance to study a role of excited\nstates in the solar plasma.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"a7oi4JL79CyBrsGg-9SsZOlYHx9uJ0akJHkn8z-TH6M","pdfSize":"1049065"}