{"id":"2412.00840","title":"DVasMesh: Deep Structured Mesh Reconstruction from Vascular Images for\n  Dynamics Modeling of Vessels","authors":"Dengqiang Jia, Xinnian Yang, Xiaosong Xiong, Shijie Huang, Feiyu Hou,\n  Li Qin, Kaicong Sun, Kannie Wai Yan Chan, Dinggang Shen","authorsParsed":[["Jia","Dengqiang",""],["Yang","Xinnian",""],["Xiong","Xiaosong",""],["Huang","Shijie",""],["Hou","Feiyu",""],["Qin","Li",""],["Sun","Kaicong",""],["Chan","Kannie Wai Yan",""],["Shen","Dinggang",""]],"versions":[{"version":"v1","created":"Sun, 1 Dec 2024 15:05:28 GMT"}],"updateDate":"2024-12-03","timestamp":1733065528000,"abstract":"  Vessel dynamics simulation is vital in studying the relationship between\ngeometry and vascular disease progression. Reliable dynamics simulation relies\non high-quality vascular meshes. Most of the existing mesh generation methods\nhighly depend on manual annotation, which is time-consuming and laborious,\nusually facing challenges such as branch merging and vessel disconnection. This\nwill hinder vessel dynamics simulation, especially for the population study. To\naddress this issue, we propose a deep learning-based method, dubbed as DVasMesh\nto directly generate structured hexahedral vascular meshes from vascular\nimages. Our contributions are threefold. First, we propose to formally\nformulate each vertex of the vascular graph by a four-element vector, including\ncoordinates of the centerline point and the radius. Second, a vectorized graph\ntemplate is employed to guide DVasMesh to estimate the vascular graph.\nSpecifically, we introduce a sampling operator, which samples the extracted\nfeatures of the vascular image (by a segmentation network) according to the\nvertices in the template graph. Third, we employ a graph convolution network\n(GCN) and take the sampled features as nodes to estimate the deformation\nbetween vertices of the template graph and target graph, and the deformed graph\ntemplate is used to build the mesh. Taking advantage of end-to-end learning and\ndiscarding direct dependency on annotated labels, our DVasMesh demonstrates\noutstanding performance in generating structured vascular meshes on cardiac and\ncerebral vascular images. It shows great potential for clinical applications by\nreducing mesh generation time from 2 hours (manual) to 30 seconds (automatic).\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"EeGA_rDD6S1jkaDJVvi5yNm6HLALnewWgUK7BTTliOs","pdfSize":"3822840"}