{
  "id": "2412.19732",
  "title": "Generative Pretrained Embedding and Hierarchical Irregular Time Series\n  Representation for Daily Living Activity Recognition",
  "authors": "Damien Bouchabou and Sao Mai Nguyen",
  "authorsParsed": [
    [
      "Bouchabou",
      "Damien",
      ""
    ],
    [
      "Nguyen",
      "Sao Mai",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 27 Dec 2024 16:43:52 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735317832000,
  "abstract": "  Within the evolving landscape of smart homes, the precise recognition of\ndaily living activities using ambient sensor data stands paramount. This paper\nnot only aims to bolster existing algorithms by evaluating two distinct\npretrained embeddings suited for ambient sensor activations but also introduces\na novel hierarchical architecture. We delve into an architecture anchored on\nTransformer Decoder-based pre-trained embeddings, reminiscent of the GPT\ndesign, and contrast it with the previously established state-of-the-art (SOTA)\nELMo embeddings for ambient sensors. Our proposed hierarchical structure\nleverages the strengths of each pre-trained embedding, enabling the discernment\nof activity dependencies and sequence order, thereby enhancing classification\nprecision. To further refine recognition, we incorporate into our proposed\narchitecture an hour-of-the-day embedding. Empirical evaluations underscore the\npreeminence of the Transformer Decoder embedding in classification endeavors.\nAdditionally, our innovative hierarchical design significantly bolsters the\nefficacy of both pre-trained embeddings, notably in capturing inter-activity\nnuances. The integration of temporal aspects subtly but distinctively augments\nclassification, especially for time-sensitive activities. In conclusion, our\nGPT-inspired hierarchical approach, infused with temporal insights, outshines\nthe SOTA ELMo benchmark.\n",
  "subjects": [
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "TI7YpRIocQhmGaoAuaF6_nqzabWX_1NELuW8JigYSt4",
  "pdfSize": "3379727"
}