{
  "id": "2412.04754",
  "title": "Nonsingular black holes and spherically symmetric objects in nonlinear\n  electrodynamics with a scalar field",
  "authors": "Antonio De Felice, Shinji Tsujikawa",
  "authorsParsed": [
    [
      "De Felice",
      "Antonio",
      ""
    ],
    [
      "Tsujikawa",
      "Shinji",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 03:35:32 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733456132000,
  "abstract": "  In general relativity with vector and scalar fields given by the Lagrangian\n${\\cal L}(F,\\phi,X)$, where $F$ is a Maxwell term and $X$ is a kinetic term of\nthe scalar field, we study the linear stability of static and spherically\nsymmetric objects without curvature singularities at their centers. We show\nthat the background solutions are generally described by either purely\nelectrically or magnetically charged objects with a nontrivial scalar-field\nprofile. In theories with the Lagrangian $\\tilde{{\\cal L}}(F)+K(\\phi, X)$,\nwhich correspond to nonlinear electrodynamics with a k-essence scalar field,\nangular Laplacian instabilities induced by vector-field perturbations exclude\nall the regular spherically symmetric solutions including nonsingular black\nholes. In theories described by the Lagrangian ${\\cal L}=X+\\mu(\\phi)F^n$, where\n$\\mu$ is a function of $\\phi$ and $n$ is a constant, the absence of angular\nLaplacian instabilities of spherically symmetric objects requires that $n>1/2$,\nunder which nonsingular black holes with event horizons are not present.\nHowever, for some particular ranges of $n$, there are horizonless compact\nobjects with neither ghosts nor Laplacian instabilities in the small-scale\nlimit. In theories given by ${\\cal L}=X \\kappa (F)$, where $\\kappa$ is a\nfunction of $F$, regular spherically symmetric objects are prone to Laplacian\ninstabilities either around the center or at spatial infinity. Thus, in our\ntheoretical framework, we do not find any example of linearly stable\nnonsingular black holes.\n",
  "subjects": [
    "Physics/General Relativity and Quantum Cosmology",
    "Physics/High Energy Physics - Phenomenology",
    "Physics/High Energy Physics - Theory"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "CEe9XLWbNlguRoNKzDIa5MyZsGZRXpzTPn4lK5LrExI",
  "pdfSize": "1263712"
}