{
  "id": "2412.04524",
  "title": "Myrzakulov Gravity in Vielbein Formalism: A Study in Weitzenb\\\"ock\n  Spacetime",
  "authors": "Davood Momeni, Ratbay Myrzakulov",
  "authorsParsed": [
    [
      "Momeni",
      "Davood",
      ""
    ],
    [
      "Myrzakulov",
      "Ratbay",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 15:30:39 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733412639000,
  "abstract": "  The quest to understand gravity's role in shaping the universe has led to the\nexploration of modified gravity theories. One such theory is Myrzakulov\ngravity, which incorporates both curvature and torsion. In this work, we\ninvestigate the effects of torsion within the framework of $f(R,T)$-gravity, a\nmodification of General Relativity that includes both curvature and torsion. We\npresent this theory in the Vielbein formalism, which offers a more flexible,\ngeometric perspective on gravity. This formalism is particularly useful in\nWeitzenb\"ock spacetime, where torsion significantly influences gravitational\ninteractions. Our study aims to extend Myrzakulov's theory and explore its\ncosmological and astrophysical implications. We examine the effects of torsion\non phenomena like black holes, gravitational waves, and neutron stars. These\nmodifications could lead to observable deviations in black hole thermodynamics,\ngravitational wave propagation, and dense matter structure. This work provides\nnew insights into the nature of spacetime and gravity, offering a fresh\nperspective on the fundamental forces governing the cosmos. It paves the way\nfor future studies, both observational and theoretical, that could reveal new\nphysics beyond General Relativity.\n",
  "subjects": [
    "Physics/General Relativity and Quantum Cosmology",
    "Astrophysics/Cosmology and Nongalactic Astrophysics",
    "Physics/High Energy Physics - Theory"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "1FZqGOaNKFakwdycPVwyTSGs_HzH_KIvOIBn8JYLRdo",
  "pdfSize": "316662"
}