{
  "id": "2412.05408",
  "title": "FogROS2-FT: Fault Tolerant Cloud Robotics",
  "authors": "Kaiyuan Chen, Kush Hari, Trinity Chung, Michael Wang, Nan Tian,\n  Christian Juette, Jeffrey Ichnowski, Liu Ren, John Kubiatowicz, Ion Stoica,\n  and Ken Goldberg",
  "authorsParsed": [
    [
      "Chen",
      "Kaiyuan",
      ""
    ],
    [
      "Hari",
      "Kush",
      ""
    ],
    [
      "Chung",
      "Trinity",
      ""
    ],
    [
      "Wang",
      "Michael",
      ""
    ],
    [
      "Tian",
      "Nan",
      ""
    ],
    [
      "Juette",
      "Christian",
      ""
    ],
    [
      "Ichnowski",
      "Jeffrey",
      ""
    ],
    [
      "Ren",
      "Liu",
      ""
    ],
    [
      "Kubiatowicz",
      "John",
      ""
    ],
    [
      "Stoica",
      "Ion",
      ""
    ],
    [
      "Goldberg",
      "Ken",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 20:38:46 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733517526000,
  "abstract": "  Cloud robotics enables robots to offload complex computational tasks to cloud\nservers for performance and ease of management. However, cloud compute can be\ncostly, cloud services can suffer occasional downtime, and connectivity between\nthe robot and cloud can be prone to variations in network Quality-of-Service\n(QoS). We present FogROS2-FT (Fault Tolerant) to mitigate these issues by\nintroducing a multi-cloud extension that automatically replicates independent\nstateless robotic services, routes requests to these replicas, and directs the\nfirst response back. With replication, robots can still benefit from cloud\ncomputations even when a cloud service provider is down or there is low QoS.\nAdditionally, many cloud computing providers offer low-cost spot computing\ninstances that may shutdown unpredictably. Normally, these low-cost instances\nwould be inappropriate for cloud robotics, but the fault tolerance nature of\nFogROS2-FT allows them to be used reliably. We demonstrate FogROS2-FT fault\ntolerance capabilities in 3 cloud-robotics scenarios in simulation (visual\nobject detection, semantic segmentation, motion planning) and 1 physical robot\nexperiment (scan-pick-and-place). Running on the same hardware specification,\nFogROS2-FT achieves motion planning with up to 2.2x cost reduction and up to a\n5.53x reduction on 99 Percentile (P99) long-tail latency. FogROS2-FT reduces\nthe P99 long-tail latency of object detection and semantic segmentation by 2.0x\nand 2.1x, respectively, under network slowdown and resource contention.\n",
  "subjects": [
    "Computer Science/Robotics",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Distributed, Parallel, and Cluster Computing",
    "Computer Science/Networking and Internet Architecture"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "RIInTnoKWt23qEo5d1vYC91VT7eu8nYfSal0N29gGfo",
  "pdfSize": "2751453"
}