{"id":"2412.08668","title":"Heat Transport in Ionic Liquids","authors":"Cillian Cockrell","authorsParsed":[["Cockrell","Cillian",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 15:36:26 GMT"}],"updateDate":"2024-12-13","timestamp":1733844986000,"abstract":"  Heat transfer in liquids is a very challenging problem as it combines the\ncompeting effect of high frequency oscillations, which dominate liquid heat\ncapacity, and diffusive motion, which enables transport macroscopic flow. This\nissue is compounded by the relatively junior state of dynamical theories of\nliquid thermodynamics. Nevertheless, molten salts are playing an increasingly\nimportant role in industrial and energy applications and there is a pressing\nneed to understand the mechanisms behind their irreversible transport\nprocesses. Here we use molecular dynamics simulations to investigate the heat\ntransport of three different molten salts: LiCl, KCl, and the eutectic point of\ntheir mixture. While all simulations consider the properties of the liquid\nwithin the frame of its centre of mass, we calculate different susceptibilities\nwhich implicitly include and explicitly exclude the heat carried by partial\nmass currents within this frame. We find that, while the heat advected by\npartial mass currents in the mixture increases with increasing temperature, the\nheat transferred by collective vibrational motion (phonons) decreases with\nincreasing temperature. This causes a maximum in the heat conductance with\ntemperature in the mixtures only - in pure salts each contribution decreases\nmonotonically with temperature. We attribute this anomaly to the extra freedom\nafforded to ionic motion in mixtures - in pure salts the motion of cations and\nanions is bound due to conservation of linear momentum. In mixtures, a coherent\nbut diffusive collective motion is enabled by the release of Li ions from this\ncondition by the introduction of a third species. We tentatively ascribe this\ncoherent collective motion to the ``diffusive\" phonons that have been used to\nexplain a similar anomaly in the thermal conductivity of solids.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Statistical Mechanics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"NHDk9k4A2_5w5fFrlGrsqdq8cGTthWlSrcW-HRy7yAE","pdfSize":"677721"}