{
  "id": "2412.02625",
  "title": "Identifying Hierarchically Triple Star Systems with Gaia DR3 and LAMOST",
  "authors": "Tongyu He, Jiao Li, Jiangdan Li, Jianping Xiong, Xiaobin Zhang,\n  Mikhail Kovalev, Qiyuan Cheng, Sufen Guo, Mingkuan Yang, Xuefei Chen, Zhanwen\n  Han",
  "authorsParsed": [
    [
      "He",
      "Tongyu",
      ""
    ],
    [
      "Li",
      "Jiao",
      ""
    ],
    [
      "Li",
      "Jiangdan",
      ""
    ],
    [
      "Xiong",
      "Jianping",
      ""
    ],
    [
      "Zhang",
      "Xiaobin",
      ""
    ],
    [
      "Kovalev",
      "Mikhail",
      ""
    ],
    [
      "Cheng",
      "Qiyuan",
      ""
    ],
    [
      "Guo",
      "Sufen",
      ""
    ],
    [
      "Yang",
      "Mingkuan",
      ""
    ],
    [
      "Chen",
      "Xuefei",
      ""
    ],
    [
      "Han",
      "Zhanwen",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 17:53:36 GMT"
    }
  ],
  "updateDate": "2024-12-04",
  "timestamp": 1733248416000,
  "abstract": "  Triple star systems are critical for understanding stellar dynamics and\ncompact objects in astrophysics, yet confirmed hierarchical triples identified\nvia spectroscopy remain limited. In this study, we identified 23 triple systems\nby cross-matching the Gaia DR3 non-single star catalog with LAMOST DR10\nspectroscopic data; 18 of them are new discoveries. For two well-observed\ntriples, we performed radial velocity curve fitting and light curve analysis to\ndetermine their orbital parameters, with inner and outer periods of 1.26 days\nand 656 days for one triple, and 3.42 days and 422 days for the other. We\ncompared the results with other studies. We also analyzed the radial velocities\n(RVs) of these 23 triples, revealing a range of $V$ from approximately\n40~km~s$^{-1}$ to 210~km~s$^{-1}$. Due to spectral resolution and detection\nlimitations, velocity differences below 45~km~s$^{-1}$ in binaries and below\n90~km~s$^{-1}$ in the inner binaries of triple systems are challenging to\ndetect. Consequently, our detection range for inner orbital periods is\nrestricted to 0.2--20 days, with the highest efficiency for periods under 10\ndays. These findings underscore the advantage of spectroscopic observations for\nidentifying triple systems with short inner orbital periods.\n",
  "subjects": [
    "Astrophysics/Solar and Stellar Astrophysics",
    "Astrophysics/Earth and Planetary Astrophysics",
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "d1quHE7pAX3wqgIfqnxRa_4rOu239BsrQiJFu5gfqR4",
  "pdfSize": "9367510"
}