{
  "id": "2412.05369",
  "title": "A Search for Low-Mass Neutron Stars in the Third Observing Run of\n  Advanced LIGO and Virgo",
  "authors": "Keisi Kacanja and Alexander H. Nitz",
  "authorsParsed": [
    [
      "Kacanja",
      "Keisi",
      ""
    ],
    [
      "Nitz",
      "Alexander H.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 19:00:42 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 25 Feb 2025 16:41:07 GMT"
    }
  ],
  "updateDate": "2025-02-26",
  "timestamp": 1733511642000,
  "abstract": "  Most observed neutron stars have masses around 1.4 $M_\\odot$, consistent with\ncurrent formation mechanisms. To date, no sub-solar mass neutron star has been\nobserved. Observing a low-mass neutron star would be a significant milestone,\nproviding crucial constraints on the nuclear equation of state, unveiling a new\npopulation of neutron stars, and advancing the study of their formation\nprocesses and underlying mechanisms. We present the first targeted search for\ntidally deformed sub-solar mass binary neutron stars (BNS), with primary masses\nranging from 0.1 to 2 $M_\\odot$ and secondary masses from 0.1 to 1 $M_\\odot$,\nusing data from the third observing run of the Advanced LIGO and Advanced Virgo\ngravitational-wave detectors. We account for the tidal deformabilities of up to\n$O(10^4)$ of these systems, as low-mass neutron stars are more easily distorted\nby their companions' gravitational forces. Previous searches that neglect tidal\ndeformability lose sensitivity to low-mass sources, potentially missing more\nthan $\\sim30\\%$ of detectable signals from a system with a chirp mass of 0.6\n$M_\\odot$ binaries. No statistically significant detections were made. In the\nabsence of a detection, we place a $90\\%$ confidence upper limit on the local\nmerger rate for sub-solar mass BNS systems, constraining it to be $<\n6.4\\times10^4$ Gpc$^{-3}$Yr$^{-1}$ for a chirp mass of 0.2 $M_\\odot$ and $<\n2.2\\times 10^3$ Gpc$^{-3}$Yr$^{-1}$ for 0.7 $M_\\odot$. With future upgrades to\ndetector sensitivity, development of next-generation detectors, and ongoing\nimprovements in search pipelines, constraints on the minimum mass of neutron\nstars will improve, providing the potential to constrain the nuclear equation\nof state, reveal new insights into neutron star formation channels, and\npotentially identify new classes of stars.\n",
  "subjects": [
    "Astrophysics/High Energy Astrophysical Phenomena",
    "Physics/General Relativity and Quantum Cosmology"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "PWS8Pd7wgXS6Wtbc3cIh0qfG4POBQ3jNNkaa0yijI98",
  "pdfSize": "555172"
}