{
  "id": "2412.16277",
  "title": "Mapping the Mind of an Instruction-based Image Editing using SMILE",
  "authors": "Zeinab Dehghani and Koorosh Aslansefat and Adil Khan and Ad\\'in\n  Ram\\'irez Rivera and Franky George and Muhammad Khalid",
  "authorsParsed": [
    [
      "Dehghani",
      "Zeinab",
      ""
    ],
    [
      "Aslansefat",
      "Koorosh",
      ""
    ],
    [
      "Khan",
      "Adil",
      ""
    ],
    [
      "Rivera",
      "Adín Ramírez",
      ""
    ],
    [
      "George",
      "Franky",
      ""
    ],
    [
      "Khalid",
      "Muhammad",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 18:33:23 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734719603000,
  "abstract": "  Despite recent advancements in Instruct-based Image Editing models for\ngenerating high-quality images, they are known as black boxes and a significant\nbarrier to transparency and user trust. To solve this issue, we introduce SMILE\n(Statistical Model-agnostic Interpretability with Local Explanations), a novel\nmodel-agnostic for localized interpretability that provides a visual heatmap to\nclarify the textual elements' influence on image-generating models. We applied\nour method to various Instruction-based Image Editing models like Pix2Pix,\nImage2Image-turbo and Diffusers-Inpaint and showed how our model can improve\ninterpretability and reliability. Also, we use stability, accuracy, fidelity,\nand consistency metrics to evaluate our method. These findings indicate the\nexciting potential of model-agnostic interpretability for reliability and\ntrustworthiness in critical applications such as healthcare and autonomous\ndriving while encouraging additional investigation into the significance of\ninterpretability in enhancing dependable image editing models.\n",
  "subjects": [
    "Computer Science/Artificial Intelligence",
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Human-Computer Interaction"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "SBG6y7vtpnBo01TCohCvlIwW8E59Dpc-3zEqGkzlPSI",
  "pdfSize": "16198394"
}