{
  "id": "2412.13935",
  "title": "Spatio-Temporal Forecasting of PM2.5 via Spatial-Diffusion guided\n  Encoder-Decoder Architecture",
  "authors": "Malay Pandey, Vaishali Jain, Nimit Godhani, Sachchida Nand Tripathi,\n  Piyush Rai",
  "authorsParsed": [
    [
      "Pandey",
      "Malay",
      ""
    ],
    [
      "Jain",
      "Vaishali",
      ""
    ],
    [
      "Godhani",
      "Nimit",
      ""
    ],
    [
      "Tripathi",
      "Sachchida Nand",
      ""
    ],
    [
      "Rai",
      "Piyush",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 15:18:12 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734535092000,
  "abstract": "  In many problem settings that require spatio-temporal forecasting, the values\nin the time-series not only exhibit spatio-temporal correlations but are also\ninfluenced by spatial diffusion across locations. One such example is\nforecasting the concentration of fine particulate matter (PM2.5) in the\natmosphere which is influenced by many complex factors, the most important ones\nbeing diffusion due to meteorological factors as well as transport across vast\ndistances over a period of time. We present a novel Spatio-Temporal Graph\nNeural Network architecture, that specifically captures these dependencies to\nforecast the PM2.5 concentration. Our model is based on an encoder-decoder\narchitecture where the encoder and decoder parts leverage gated recurrent units\n(GRU) augmented with a graph neural network (TransformerConv) to account for\nspatial diffusion. Our model can also be seen as a generalization of various\nexisting models for time-series or spatio-temporal forecasting. We demonstrate\nthe model's effectiveness on two real-world PM2.5 datasets: (1) data collected\nby us using a recently deployed network of low-cost PM$_{2.5}$ sensors from 511\nlocations spanning the entirety of the Indian state of Bihar over a period of\none year, and (2) another publicly available dataset that covers severely\npolluted regions from China for a period of 4 years. Our experimental results\nshow our model's impressive ability to account for both spatial as well as\ntemporal dependencies precisely.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "mcc4L3KAlzPJaYMnfMKaWiMiOEKM6VaW3SMa117mNUU",
  "pdfSize": "2014483"
}