{
  "id": "2412.02467",
  "title": "DP-2Stage: Adapting Language Models as Differentially Private Tabular\n  Data Generators",
  "authors": "Tejumade Afonja, Hui-Po Wang, Raouf Kerkouche, Mario Fritz",
  "authorsParsed": [
    [
      "Afonja",
      "Tejumade",
      ""
    ],
    [
      "Wang",
      "Hui-Po",
      ""
    ],
    [
      "Kerkouche",
      "Raouf",
      ""
    ],
    [
      "Fritz",
      "Mario",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 14:10:09 GMT"
    }
  ],
  "updateDate": "2024-12-04",
  "timestamp": 1733235009000,
  "abstract": "  Generating tabular data under differential privacy (DP) protection ensures\ntheoretical privacy guarantees but poses challenges for training machine\nlearning models, primarily due to the need to capture complex structures under\nnoisy supervision signals. Recently, pre-trained Large Language Models (LLMs)\n-- even those at the scale of GPT-2 -- have demonstrated great potential in\nsynthesizing tabular data. However, their applications under DP constraints\nremain largely unexplored. In this work, we address this gap by applying DP\ntechniques to the generation of synthetic tabular data. Our findings shows that\nLLMs face difficulties in generating coherent text when fine-tuned with DP, as\nprivacy budgets are inefficiently allocated to non-private elements like table\nstructures. To overcome this, we propose \\ours, a two-stage fine-tuning\nframework for differentially private tabular data generation. The first stage\ninvolves non-private fine-tuning on a pseudo dataset, followed by DP\nfine-tuning on a private dataset. Our empirical results show that this approach\nimproves performance across various settings and metrics compared to directly\nfine-tuned LLMs in DP contexts. We release our code and setup at\nhttps://github.com/tejuafonja/DP-2Stage.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Computation and Language",
    "Computer Science/Cryptography and Security"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "MnexqbN-Vq-MJBtQC3OVNjlQLSQ4qlij3JmuX_-M7Gk",
  "pdfSize": "799160"
}