{"id":"2412.01677","title":"Coherent emission from single impurities in ZnSe through resonant\n  excitation","authors":"Yuxi Jiang, Christine Falter, Robert M. Pettit, Nils von den Driesch,\n  Yurii Kutovyi, Amirehsan Alizadeh Herfati, Alexander Pawlis, and Edo Waks","authorsParsed":[["Jiang","Yuxi",""],["Falter","Christine",""],["Pettit","Robert M.",""],["Driesch","Nils von den",""],["Kutovyi","Yurii",""],["Herfati","Amirehsan Alizadeh",""],["Pawlis","Alexander",""],["Waks","Edo",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 16:23:54 GMT"}],"updateDate":"2024-12-03","timestamp":1733156634000,"abstract":"  Impurity-bound excitons in II-VI semiconductors are promising optically\nactive solid-state spin qubit systems. Previous work relied on incoherent\noptical excitation to generate photons from these impurities. However, many\nquantum applications require resonant driving to directly excite optical\ntransitions and maintain coherence. Here, we demonstrate coherent optical\nemission from a resonantly driven single impurity-bound exciton in ZnSe. We\nobserve resonance fluorescence and verify the emission coherence through\npolarization interferometry. Resonant excitation also enables the direct\nmeasurement of the Debye-Waller factor, determined to be 0.94, indicating high\nefficiency emission to the zero-phonon line. Time-resolved resonance\nfluorescence measurements reveal a fast optically driven ionization process\nattributed to Auger recombination, along with a slower spontaneous ionization\nprocess having a lifetime of 21 {\\mu}s due to charge tunneling from the\nimpurity. We demonstrate that a low-power incoherent pump laser efficiently\nstabilizes the charge of the impurity-bound exciton on the timescale of 9.3 ns.\nOur results pave the way for direct coherent optical and spin control through\nresonant excitation of impurity-bound excitons in II-VI semiconductors.\n","subjects":["Physics/Quantum Physics","Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ez6L30P1D9T10DXTOyVKOUIh3KJHuwPoMtUqaeJqbA0","pdfSize":"1745582"}