{"id":"2412.02743","title":"History and Habitability of the LP 890-9 Planetary System","authors":"Rory Barnes, Laura N. R. do Amaral, Jessica Birky, Ludmila Carone,\n  Peter Driscoll, Joseph R. Livesey, David Graham, Juliette Becker, Kaiming\n  Cui, Martin Schlecker, Rodolfo Garcia, Megan Gialluca, Arthur Adams, MD\n  Redyan Ahmed, Paul Bonney, Wynter Broussard, Chetan Chawla, Mario Damasso,\n  William C. Danchi, Russell Deitrick, Elsa Ducrot, Emeline F. Fromont, Brandt\n  A. L. Gaches, Sakshi Gupta, Michelle L. Hill, James A. G. Jackman, Estelle M.\n  Janin, Mikolaj Karawacki, Matheus Daniel Koren, Roberto La Greca, Michaela\n  Leung, Arturo Miranda-Rosete, Michael Kent A. Olohoy, Cecelia Ngo, Daria\n  Paul, Chandan Kumar Sahu, Debajyoti Basu Sarkar, Mohammad Afzal Shadab,\n  Edward W. Schwieterman, Melissa Sedler, Katie Texeira, Allona Vazan, Karen N.\n  Delgado Vega, Rohit Vijayakumar, Jonathan T. Wojack","authorsParsed":[["Barnes","Rory",""],["Amaral","Laura N. R. do",""],["Birky","Jessica",""],["Carone","Ludmila",""],["Driscoll","Peter",""],["Livesey","Joseph R.",""],["Graham","David",""],["Becker","Juliette",""],["Cui","Kaiming",""],["Schlecker","Martin",""],["Garcia","Rodolfo",""],["Gialluca","Megan",""],["Adams","Arthur",""],["Ahmed","MD Redyan",""],["Bonney","Paul",""],["Broussard","Wynter",""],["Chawla","Chetan",""],["Damasso","Mario",""],["Danchi","William C.",""],["Deitrick","Russell",""],["Ducrot","Elsa",""],["Fromont","Emeline F.",""],["Gaches","Brandt A. L.",""],["Gupta","Sakshi",""],["Hill","Michelle L.",""],["Jackman","James A. G.",""],["Janin","Estelle M.",""],["Karawacki","Mikolaj",""],["Koren","Matheus Daniel",""],["La Greca","Roberto",""],["Leung","Michaela",""],["Miranda-Rosete","Arturo",""],["Olohoy","Michael Kent A.",""],["Ngo","Cecelia",""],["Paul","Daria",""],["Sahu","Chandan Kumar",""],["Sarkar","Debajyoti Basu",""],["Shadab","Mohammad Afzal",""],["Schwieterman","Edward W.",""],["Sedler","Melissa",""],["Texeira","Katie",""],["Vazan","Allona",""],["Vega","Karen N. Delgado",""],["Vijayakumar","Rohit",""],["Wojack","Jonathan T.",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 19:00:01 GMT"},{"version":"v2","created":"Thu, 5 Dec 2024 23:07:13 GMT"}],"updateDate":"2024-12-09","timestamp":1733252401000,"abstract":"  We present numerous aspects of the evolution of the LP 890-9\n(SPECULOOS-2/TOI-4306) planetary system, focusing on the likelihood that planet\nc can support life. We find that the host star reaches the main sequence in 1\nGyr and that planet c lies close to the inner boundary of the habitable zone.\nWe find the magma ocean stage can last up to 50 Myr, remove 8 Earth-oceans of\nwater, and leave up to 2000 bars of oxygen in the atmosphere. However, if the\nplanet forms with a hydrogen envelope as small as 0.1 Earth-masses, no water\nwill be lost during the star's pre-main sequence phase from thermal escape\nprocesses. We find that the planets are unlikely to be in a 3:1 mean motion\nresonance and that both planets tidally circularize within 0.5 Gyr when tidal\ndissipation is held constant. However, if tidal dissipation is a function of\nmantle temperature and rheology, then we find that planet c's orbit may require\nmore than 7 Gyr to circularize, during which time tidal heating may reach\nhundreds of terawatts. We thus conclude that the habitability of planet c\ndepends most strongly on the initial volatile content and internal properties,\nbut no data yet preclude the viability of an active biosphere on the planet.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"TjbtyMPcmQ_v6io5qy_tAsLPffHDW-ZsmDpuzH6PTd4","pdfSize":"2724225"}