{
  "id": "2412.17954",
  "title": "Asynchronous Training of Mixed-Role Human Actors in a\n  Partially-Observable Environment",
  "authors": "Kimberlee Chestnut Chang, Reed Jensen, Rohan Paleja, Sam L. Polk, Rob\n  Seater, Jackson Steilberg, Curran Schiefelbein, Melissa Scheldrup, Matthew\n  Gombolay, and Mabel D. Ramirez",
  "authorsParsed": [
    [
      "Chang",
      "Kimberlee Chestnut",
      ""
    ],
    [
      "Jensen",
      "Reed",
      ""
    ],
    [
      "Paleja",
      "Rohan",
      ""
    ],
    [
      "Polk",
      "Sam L.",
      ""
    ],
    [
      "Seater",
      "Rob",
      ""
    ],
    [
      "Steilberg",
      "Jackson",
      ""
    ],
    [
      "Schiefelbein",
      "Curran",
      ""
    ],
    [
      "Scheldrup",
      "Melissa",
      ""
    ],
    [
      "Gombolay",
      "Matthew",
      ""
    ],
    [
      "Ramirez",
      "Mabel D.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 20:09:55 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1734984595000,
  "abstract": "  In cooperative training, humans within a team coordinate on complex tasks,\nbuilding mental models of their teammates and learning to adapt to teammates'\nactions in real-time. To reduce the often prohibitive scheduling constraints\nassociated with cooperative training, this article introduces a paradigm for\ncooperative asynchronous training of human teams in which trainees practice\ncoordination with autonomous teammates rather than humans. We introduce a novel\nexperimental design for evaluating autonomous teammates for use as training\npartners in cooperative training. We apply the design to a human-subjects\nexperiment where humans are trained with either another human or an autonomous\nteammate and are evaluated with a new human subject in a new, partially\nobservable, cooperative game developed for this study. Importantly, we employ a\nmethod to cluster teammate trajectories from demonstrations performed in the\nexperiment to form a smaller number of training conditions. This results in a\nsimpler experiment design that enabled us to conduct a complex cooperative\ntraining human-subjects study in a reasonable amount of time. Through a\ndemonstration of the proposed experimental design, we provide takeaways and\ndesign recommendations for future research in the development of cooperative\nasynchronous training systems utilizing robot surrogates for human teammates.\n",
  "subjects": [
    "Computer Science/Human-Computer Interaction",
    "Computer Science/Multiagent Systems",
    "Computer Science/Robotics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "ylOdwVgz7_00RXopjL0k-k_FxfVx9czTvWVmHAWqtjg",
  "pdfSize": "3688262"
}