{
  "id": "2412.01440",
  "title": "DiffPatch: Generating Customizable Adversarial Patches using Diffusion\n  Model",
  "authors": "Zhixiang Wang, Guangnan Ye, Xiaosen Wang, Siheng Chen, Zhibo Wang,\n  Xingjun Ma, Yu-Gang Jiang",
  "authorsParsed": [
    [
      "Wang",
      "Zhixiang",
      ""
    ],
    [
      "Ye",
      "Guangnan",
      ""
    ],
    [
      "Wang",
      "Xiaosen",
      ""
    ],
    [
      "Chen",
      "Siheng",
      ""
    ],
    [
      "Wang",
      "Zhibo",
      ""
    ],
    [
      "Ma",
      "Xingjun",
      ""
    ],
    [
      "Jiang",
      "Yu-Gang",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 12:30:35 GMT"
    },
    {
      "version": "v2",
      "created": "Thu, 26 Dec 2024 06:47:08 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1733142635000,
  "abstract": "  Physical adversarial patches printed on clothing can easily allow individuals\nto evade person detectors. However, most existing adversarial patch generation\nmethods prioritize attack effectiveness over stealthiness, resulting in patches\nthat are aesthetically unpleasing. Although existing methods using generative\nadversarial networks or diffusion models can produce more natural-looking\npatches, they often struggle to balance stealthiness with attack effectiveness\nand lack flexibility for user customization. To address these challenges, we\npropose a novel diffusion-based customizable patch generation framework termed\nDiffPatch, specifically tailored for creating naturalistic and customizable\nadversarial patches. Our approach enables users to utilize a reference image as\nthe source, rather than starting from random noise, and incorporates masks to\ncraft naturalistic patches of various shapes, not limited to squares. To\nprevent the original semantics from being lost during the diffusion process, we\nemploy Null-text inversion to map random noise samples to a single input image\nand generate patches through Incomplete Diffusion Optimization (IDO). Notably,\nwhile maintaining a natural appearance, our method achieves a comparable attack\nperformance to state-of-the-art non-naturalistic patches when using similarly\nsized attacks. Using DiffPatch, we have created a physical adversarial T-shirt\ndataset, AdvPatch-1K, specifically targeting YOLOv5s. This dataset includes\nover a thousand images across diverse scenarios, validating the effectiveness\nof our attack in real-world environments. Moreover, it provides a valuable\nresource for future research.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "vZmSRjMRtnucTAYIEYWGhtbB5_og5PjEZU4kk9IqRQ8",
  "pdfSize": "11912806"
}