{
  "id": "2412.17194",
  "title": "Topological Semimetal KAlGe with Novel Electronic Instability",
  "authors": "Toshiya Ikenobe, Takahiro Yamada, Jun-ichi Yamaura, Tamio Oguchi,\n  Ryutaro Okuma, Daigorou Hirai, Hajime Sagayama, Yoshihiko Okamoto, and Zenji\n  Hiroi",
  "authorsParsed": [
    [
      "Ikenobe",
      "Toshiya",
      ""
    ],
    [
      "Yamada",
      "Takahiro",
      ""
    ],
    [
      "Yamaura",
      "Jun-ichi",
      ""
    ],
    [
      "Oguchi",
      "Tamio",
      ""
    ],
    [
      "Okuma",
      "Ryutaro",
      ""
    ],
    [
      "Hirai",
      "Daigorou",
      ""
    ],
    [
      "Sagayama",
      "Hajime",
      ""
    ],
    [
      "Okamoto",
      "Yoshihiko",
      ""
    ],
    [
      "Hiroi",
      "Zenji",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 22 Dec 2024 23:57:47 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734911867000,
  "abstract": "  Compounds with the anti-PbFCl structure exhibit a variety of electronic\ninstabilities and intriguing physical properties. NaAlSi and NaAlGe are similar\ntopological nodal-line semimetals, but they have distinct properties. NaAlSi is\na superconductor at 6.8 K, whereas NaAlGe is an insulator with a pseudogap of\napproximately 100 K. Using the potassium-indium flux method, we succeeded in\nsynthesizing a single crystal of KAlGe, a new anti-PbFCl compound. First\nprinciples electronic structure calculations reveal that KAlGe is isoelectronic\nwith NaAlSi and NaAlGe. KAlGe undergoes a metal-to-metal transition at 89 K and\nexhibits no superconductivity above 1.8 K. The low temperature phase has\nsignificantly lower carrier density and extremely high mobility, similar to\nDirac electron systems. Furthermore, X-ray diffraction experiments show a\nstructural change that breaks the fourfold symmetry during the phase\ntransition. Electron-phonon interactions may be responsible for\nsuperconductivity in NaAlSi, whereas excitonic electron-hole interactions are\nthought to play an important role in KAlGe and possibly NaAlGe. Our findings\ndemonstrate that fascinating physics lies within the compound family.\n",
  "subjects": [
    "Condensed Matter/Strongly Correlated Electrons"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "hHN_65QGya-ppqVhKqFRLjxeykgKkWxsDHTJynNaj88",
  "pdfSize": "1437765"
}