{
  "id": "2412.05059",
  "title": "Spatiotemporal distribution of the glycoprotein pherophorin II reveals\n  stochastic geometry of the growing ECM of $Volvox~carteri$",
  "authors": "Benjamin von der Heyde, Anand Srinivasan, Sumit Kumar Birwa, Eva Laura\n  von der Heyde, Steph S.M.H. H\\\"ohn, Raymond E. Goldstein, Armin Hallmann",
  "authorsParsed": [
    [
      "von der Heyde",
      "Benjamin",
      ""
    ],
    [
      "Srinivasan",
      "Anand",
      ""
    ],
    [
      "Birwa",
      "Sumit Kumar",
      ""
    ],
    [
      "von der Heyde",
      "Eva Laura",
      ""
    ],
    [
      "Höhn",
      "Steph S. M. H.",
      ""
    ],
    [
      "Goldstein",
      "Raymond E.",
      ""
    ],
    [
      "Hallmann",
      "Armin",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 14:16:15 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733494575000,
  "abstract": "  The evolution of multicellularity involved the transformation of a simple\ncell wall of unicellular ancestors into a complex, multifunctional\nextracellular matrix (ECM). A suitable model organism to study the formation\nand expansion of an ECM during ontogenesis is the multicellular green alga\n$Volvox~carteri$, which, along with the related volvocine algae, produces a\ncomplex, self-organized ECM composed of multiple substructures. These\nself-assembled ECMs primarily consist of hydroxyproline-rich glycoproteins, a\nmajor component of which is pherophorins. To investigate the geometry of the\ngrowing ECM, we fused the $yfp$ gene with the gene for pherophorin II (PhII) in\n$V.~carteri$. Confocal microscopy reveals PhII:YFP localization at key\nstructures within the ECM, including the boundaries of compartments surrounding\neach somatic cell and the outer surface of the organism. Image analysis during\nthe life cycle allows the stochastic geometry of those growing compartments to\nbe quantified. We find that their areas and aspect ratios exhibit robust gamma\ndistributions and exhibit a transition from a tight polygonal to a looser\nacircular packing geometry with stable eccentricity over time, evoking\nparallels and distinctions with the behavior of hydrated foams. These results\nprovide a quantitative benchmark for addressing a general, open question in\nbiology: How do cells produce structures external to themselves in a robust and\naccurate manner?\n",
  "subjects": [
    "Condensed Matter/Soft Condensed Matter",
    "Physics/Biological Physics",
    "Quantitative Biology/Tissues and Organs"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "SRA-qw4P6WqQNZDQxzKy0DzJr6ZUQcnyDT2YCM0wkUg",
  "pdfSize": "9460580"
}