{
  "id": "2412.08277",
  "title": "Analysis of Age of Information for A Discrete-Time hybrid Dual-Queue\n  System",
  "authors": "Zhengchuan Chen, Yi Qu, Nikolaos Pappas, Chaowei Tang, Min Wang, and\n  Tony Q. S. Quek",
  "authorsParsed": [
    [
      "Chen",
      "Zhengchuan",
      ""
    ],
    [
      "Qu",
      "Yi",
      ""
    ],
    [
      "Pappas",
      "Nikolaos",
      ""
    ],
    [
      "Tang",
      "Chaowei",
      ""
    ],
    [
      "Wang",
      "Min",
      ""
    ],
    [
      "Quek",
      "Tony Q. S.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 10:49:21 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733914161000,
  "abstract": "  Using multiple sensors to update the status process of interest is promising\nin improving the information freshness. The unordered arrival of status updates\nat the monitor end poses a significant challenge in analyzing the timeliness\nperformance of parallel updating systems. This work investigates the age of\ninformation (AoI) of a discrete-time dual-sensor status updating system.\nSpecifically, the status update is generated following the zero-waiting policy.\nThe two sensors are modeled as a geometrically distributed service time queue\nand a deterministic service time queue in parallel. We derive the analytical\nexpressions for the average AoI and peak AoI using the graphical analysis\nmethod. Moreover, the connection of average AoI between discrete-time and\ncontinuous-time systems is also explored. It is shown that the AoI result of\nthe continuous-time system is a limit case of that of the corresponding\ndiscrete-time system. Hence, the AoI result of the discrete-time system is more\ngeneral than the continuous one. Numerical results validate the effectiveness\nof our analysis and further show that randomness of service time contributes\nmore AoI reduction than determinacy of service time in dual-queue systems in\nmost cases, which is different from what is known about the single-queue\nsystem.\n",
  "subjects": [
    "Computer Science/Information Theory",
    "Mathematics/Information Theory",
    "Mathematics/Statistics Theory",
    "Statistics/Statistics Theory"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "tiZIZAPDBjeBwRZos8gqY22Vm9wE-Nz_AKj_FxuhzO0",
  "pdfSize": "1351893"
}