{"id":"2412.02002","title":"Signatures of Rapidly Rotating Stars with Chemically Homogeneous\n  Evolution in the First Galaxies","authors":"Boyuan Liu, Yves Sibony, Georges Meynet, Volker Bromm","authorsParsed":[["Liu","Boyuan",""],["Sibony","Yves",""],["Meynet","Georges",""],["Bromm","Volker",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 22:13:52 GMT"},{"version":"v2","created":"Wed, 5 Feb 2025 11:00:33 GMT"}],"updateDate":"2025-02-06","timestamp":1733177632000,"abstract":"  The James Webb Space Telescope (JWST) has revealed an unexpectedly high\nabundance of UV luminous galaxies at redshifts $z\\gtrsim 10$, challenging\n`standard' galaxy formation models. This study investigates the role of rapidly\nrotating (massive) stars undergoing chemically homogeneous evolution (CHE) in\nreconciling this potential tension. These stars are more compact, hotter, and\nexhibit enhanced UV emission. We find that the rest-frame UV luminosity of\nstar-forming galaxies can be significantly enhanced by a factor of $\\sim 3-6$\nwhen CHE stars above a minimum initial mass of $m_{\\star,\\min}^{\\rm CHE}\\sim\n2-10\\ \\rm M_\\odot$ account for more than half of the total stellar mass\nfollowing a Salpeter initial mass function. As a result, the UV luminosity\nfunctions observed at $z\\sim 12-16$ can be reproduced with less extreme values\nof star formation efficiency and UV luminosity stochastic variability. Our\nresults highlight the potential of CHE in explaining the UV-bright galaxy\npopulations detected by JWST and call for future work to explore the broader\nastrophysical implications of CHE and its associated phenomena in the early\nuniverse, such as gamma-ray bursts, compact object binaries, and metal\nenrichment.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"fZmuhUN45LSGRVq3lpAc09xEb9zcZUXgL-jsSMtygqg","pdfSize":"1253712"}