{
  "id": "2412.09551",
  "title": "Video Creation by Demonstration",
  "authors": "Yihong Sun, Hao Zhou, Liangzhe Yuan, Jennifer J. Sun, Yandong Li,\n  Xuhui Jia, Hartwig Adam, Bharath Hariharan, Long Zhao, Ting Liu",
  "authorsParsed": [
    [
      "Sun",
      "Yihong",
      ""
    ],
    [
      "Zhou",
      "Hao",
      ""
    ],
    [
      "Yuan",
      "Liangzhe",
      ""
    ],
    [
      "Sun",
      "Jennifer J.",
      ""
    ],
    [
      "Li",
      "Yandong",
      ""
    ],
    [
      "Jia",
      "Xuhui",
      ""
    ],
    [
      "Adam",
      "Hartwig",
      ""
    ],
    [
      "Hariharan",
      "Bharath",
      ""
    ],
    [
      "Zhao",
      "Long",
      ""
    ],
    [
      "Liu",
      "Ting",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 18:41:20 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1734028880000,
  "abstract": "  We explore a novel video creation experience, namely Video Creation by\nDemonstration. Given a demonstration video and a context image from a different\nscene, we generate a physically plausible video that continues naturally from\nthe context image and carries out the action concepts from the demonstration.\nTo enable this capability, we present $\\delta$-Diffusion, a self-supervised\ntraining approach that learns from unlabeled videos by conditional future frame\nprediction. Unlike most existing video generation controls that are based on\nexplicit signals, we adopts the form of implicit latent control for maximal\nflexibility and expressiveness required by general videos. By leveraging a\nvideo foundation model with an appearance bottleneck design on top, we extract\naction latents from demonstration videos for conditioning the generation\nprocess with minimal appearance leakage. Empirically, $\\delta$-Diffusion\noutperforms related baselines in terms of both human preference and large-scale\nmachine evaluations, and demonstrates potentials towards interactive world\nsimulation. Sampled video generation results are available at\nhttps://delta-diffusion.github.io/.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "6Yh-4gzvwlP_f9k8RZbnkdy2Xk6Cq9sA8qqGSzt5eq8",
  "pdfSize": "3123747"
}