{
  "id": "2412.03848",
  "title": "INRetouch: Context Aware Implicit Neural Representation for Photography\n  Retouching",
  "authors": "Omar Elezabi, Marcos V. Conde, Zongwei Wu, Radu Timofte",
  "authorsParsed": [
    [
      "Elezabi",
      "Omar",
      ""
    ],
    [
      "Conde",
      "Marcos V.",
      ""
    ],
    [
      "Wu",
      "Zongwei",
      ""
    ],
    [
      "Timofte",
      "Radu",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 03:31:48 GMT"
    },
    {
      "version": "v2",
      "created": "Wed, 11 Dec 2024 16:26:09 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733369508000,
  "abstract": "  Professional photo editing remains challenging, requiring extensive knowledge\nof imaging pipelines and significant expertise. With the ubiquity of smartphone\nphotography, there is an increasing demand for accessible yet sophisticated\nimage editing solutions. While recent deep learning approaches, particularly\nstyle transfer methods, have attempted to automate this process, they often\nstruggle with output fidelity, editing control, and complex retouching\ncapabilities. We propose a novel retouch transfer approach that learns from\nprofessional edits through before-after image pairs, enabling precise\nreplication of complex editing operations. To facilitate this research\ndirection, we introduce a comprehensive Photo Retouching Dataset comprising\n100,000 high-quality images edited using over 170 professional Adobe Lightroom\npresets. We develop a context-aware Implicit Neural Representation that learns\nto apply edits adaptively based on image content and context, requiring no\npretraining and capable of learning from a single example. Our method extracts\nimplicit transformations from reference edits and adaptively applies them to\nnew images. Through extensive evaluation, we demonstrate that our approach not\nonly surpasses existing methods in photo retouching but also enhances\nperformance in related image reconstruction tasks like Gamut Mapping and Raw\nReconstruction. By bridging the gap between professional editing capabilities\nand automated solutions, our work presents a significant step toward making\nsophisticated photo editing more accessible while maintaining high-fidelity\nresults. Check the Project Page at https://omaralezaby.github.io/inretouch for\nmore Results and information about Code and Dataset availability.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Image and Video Processing",
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "kYzlN4xfnWy6PtqssyntYzHEiqDQT8PJXowEpoMXTJ4",
  "pdfSize": "44058335"
}