{"id":"2412.02982","title":"Birthmarks: Ergodicity Breaking Beyond Quantum Scars","authors":"Anton M. Graf, Joonas Keski-Rahkonen, Mingxuan Xiao, Saul Atwood,\n  Zhongling Lu, Siyuan Chen, Eric J. Heller","authorsParsed":[["Graf","Anton M.",""],["Keski-Rahkonen","Joonas",""],["Xiao","Mingxuan",""],["Atwood","Saul",""],["Lu","Zhongling",""],["Chen","Siyuan",""],["Heller","Eric J.",""]],"versions":[{"version":"v1","created":"Wed, 4 Dec 2024 02:49:15 GMT"}],"updateDate":"2024-12-05","timestamp":1733280555000,"abstract":"  One manifestation of classical ergodicity is a complete loss of memory of the\ninitial conditions due to the eventual uniform exploration of phase space. In\nquantum versions of the same systems, classical ergodic traits can be broken.\nHere, we extend the concept of quantum scars in new directions, more focused on\nergodicity and infinite time averages than individual eigenstates. We\nspecifically establish a union of short and long-term enhancements in terms of\na \\emph{quantum birthmark} (QB). Subsequently, we show (1) that the birth and\nearly evolution of a nonstationary state is remembered forever in infinite time\naverages, and (2) that early recurrences in the autocorrelation function\ninevitably lead to nonergodic flow over infinite times. We recount here that\nphase space cannot be explored ergodically if there are early recurrences (well\nbefore the Heisenberg time) in the autocorrelation of the initial nonstationary\nquantum state. Employing random matrix theory, we show that QB extends beyond\nindividual states to entire subspaces or ``{\\it birthplaces}\" in Hilbert space.\nFinally, we visualize scar-amplified QBs unveiled within the time-averaged\nprobability density of a wavepacket in a stadium system. By transcending the\nquantum scarring, QB delivers a new paradigm for understanding the elusive\nquantum nature of ergodicity.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"FAyZnkv0bDv9kC-lXVcg-nbpnlZ5MMEDgFdRGJ8ttLc","pdfSize":"15234608"}