{"id":"2412.18157","title":"Smooth-Foley: Creating Continuous Sound for Video-to-Audio Generation\n  Under Semantic Guidance","authors":"Yaoyun Zhang, Xuenan Xu, Mengyue Wu","authorsParsed":[["Zhang","Yaoyun",""],["Xu","Xuenan",""],["Wu","Mengyue",""]],"versions":[{"version":"v1","created":"Tue, 24 Dec 2024 04:29:46 GMT"}],"updateDate":"2024-12-25","timestamp":1735014586000,"abstract":"  The video-to-audio (V2A) generation task has drawn attention in the field of\nmultimedia due to the practicality in producing Foley sound. Semantic and\ntemporal conditions are fed to the generation model to indicate sound events\nand temporal occurrence. Recent studies on synthesizing immersive and\nsynchronized audio are faced with challenges on videos with moving visual\npresence. The temporal condition is not accurate enough while low-resolution\nsemantic condition exacerbates the problem. To tackle these challenges, we\npropose Smooth-Foley, a V2A generative model taking semantic guidance from the\ntextual label across the generation to enhance both semantic and temporal\nalignment in audio. Two adapters are trained to leverage pre-trained\ntext-to-audio generation models. A frame adapter integrates high-resolution\nframe-wise video features while a temporal adapter integrates temporal\nconditions obtained from similarities of visual frames and textual labels. The\nincorporation of semantic guidance from textual labels achieves precise\naudio-video alignment. We conduct extensive quantitative and qualitative\nexperiments. Results show that Smooth-Foley performs better than existing\nmodels on both continuous sound scenarios and general scenarios. With semantic\nguidance, the audio generated by Smooth-Foley exhibits higher quality and\nbetter adherence to physical laws.\n","subjects":["Computer Science/Sound","Computer Science/Artificial Intelligence","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"PuNJUowORQfoBMR5MPQ18bObZzZ5IRLHKG6eoLzpyko","pdfSize":"3622374"}