{"id":"2412.03386","title":"Diamond-defect engineering of NV- centers using ion beam irradiation","authors":"J. L. S\\'anchez Toural, J. Garc\\'ia-P\\'erez, R. Bernardo-Gavito, D.\n  Granados, A. Andrino-G\\'omez, G. Garc\\'ia, J. L. Pau, M. A. Ramos and N.\n  Gordillo","authorsParsed":[["Toural","J. L. Sánchez",""],["García-Pérez","J.",""],["Bernardo-Gavito","R.",""],["Granados","D.",""],["Andrino-Gómez","A.",""],["García","G.",""],["Pau","J. L.",""],["Ramos","M. A.",""],["Gordillo","N.",""]],"versions":[{"version":"v1","created":"Wed, 4 Dec 2024 15:12:42 GMT"}],"updateDate":"2024-12-05","timestamp":1733325162000,"abstract":"  The interplay between ion beam modification techniques in the MeV range and\nthe controlled generation of negatively charged nitrogen-vacancy (NV-) centers\nin nitrogen-doped synthetic diamond crystals is explored. An experimental\napproach employing both light (H+) and heavy (Br+6) ions was followed to assess\ntheir respective impacts on the creation of NV- centers, using different ion\nenergies or fluences to generate varying amounts of vacancies.\nPhotoluminescence spectroscopy was applied to characterize NV- and neutral NV0\ncenters. Initially, no NV centers were detected post-irradiation, despite the\npresence of substitutional nitrogen and vacancies. However, after annealing at\n800C (and in some cases at 900C), most samples exhibited a high density of NV0\nand especially NV- centers. This demonstrates that thermal treatment is\nessential for vacancy-nitrogen recombination and NV- formation, often through\nelectron capture from nearby nitrogen atoms. Notably, we achieved high NV-\ndensities without graphitization, which is essential for preserving the\nmaterial's properties for quantum applications. This study underscores and\nquantifies the effectiveness of MeV-range ions in controlling vacancy\ndistributions and highlights their potential for optimizing NV- center\nformation to enhance the sensitivity of diamond-based quantum magnetic sensors.\n","subjects":["Condensed Matter/Materials Science","Physics/Accelerator Physics","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"nsbSVt5l-l8A6gJKNzCEWHgWKWIhKAtr6_FebsYNY4U","pdfSize":"1164809"}