{
  "id": "2412.04483",
  "title": "AI-powered Digital Framework for Personalized Economical Quality\n  Learning at Scale",
  "authors": "Mrzieh VatandoustMohammadieh, Mohammad Mahdi Mohajeri, Ali Keramati,\n  Majid Nili Ahmadabadi",
  "authorsParsed": [
    [
      "VatandoustMohammadieh",
      "Mrzieh",
      ""
    ],
    [
      "Mohajeri",
      "Mohammad Mahdi",
      ""
    ],
    [
      "Keramati",
      "Ali",
      ""
    ],
    [
      "Ahmadabadi",
      "Majid Nili",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 20 Nov 2024 17:44:29 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1732124669000,
  "abstract": "  The disparity in access to quality education is significant, both between\ndeveloped and developing countries and within nations, regardless of their\neconomic status. Socioeconomic barriers and rapid changes in the job market\nfurther intensify this issue, highlighting the need for innovative solutions\nthat can deliver quality education at scale and low cost. This paper addresses\nthese challenges by proposing an AI-powered digital learning framework grounded\nin Deep Learning (DL) theory. The DL theory emphasizes learner agency and\nredefines the role of teachers as facilitators, making it particularly suitable\nfor scalable educational environments. We outline eight key principles derived\nfrom learning science and AI that are essential for implementing DL-based\nDigital Learning Environments (DLEs). Our proposed framework leverages AI for\nlearner modelling based on Open Learner Modeling (OLM), activity suggestions,\nand AI-assisted support for both learners and facilitators, fostering\ncollaborative and engaging learning experiences. Our framework provides a\npromising direction for scalable, high-quality education globally, offering\npractical solutions to some of the AI-related challenges in education.\n",
  "subjects": [
    "Computer Science/Computers and Society",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "z_2celzoLun33KGxt6C8qnhXmsUei0eBJBS-BaO-hJU",
  "pdfSize": "1765269"
}