{
  "id": "2412.15977",
  "title": "A quantum dual logarithmic barrier method for linear optimization",
  "authors": "Zeguan Wu, Pouya Sampourmahani, Mohammadhossein Mohammadisiahroudi,\n  Tam\\'as Terlaky",
  "authorsParsed": [
    [
      "Wu",
      "Zeguan",
      ""
    ],
    [
      "Sampourmahani",
      "Pouya",
      ""
    ],
    [
      "Mohammadisiahroudi",
      "Mohammadhossein",
      ""
    ],
    [
      "Terlaky",
      "Tamás",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 15:20:24 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734708024000,
  "abstract": "  Quantum computing has the potential to speed up some optimization methods.\nOne can use quantum computers to solve linear systems via Quantum Linear System\nAlgorithms (QLSAs). QLSAs can be used as a subroutine for algorithms that\nrequire solving linear systems, such as the dual logarithmic barrier method\n(DLBM) for solving linear optimization (LO) problems. In this paper, we use a\nQLSA to solve the linear systems arising in each iteration of the DLBM. To use\nthe QLSA in a hybrid setting, we read out quantum states via a tomography\nprocedure which introduces considerable error and noise. Thus, this paper first\nproposes an inexact-feasible variant of DLBM for LO problems and then extends\nit to a quantum version. Our quantum approach has quadratic convergence toward\nthe central path with inexact directions and we show that this method has the\nbest-known $\\mathcal{O}(\\sqrt{n} \\log (n \\mu_0 /\\zeta))$ iteration complexity,\nwhere $n$ is the number of variables, $\\mu_0$ is the initial duality gap, and\n$\\zeta$ is the desired accuracy. We further use iterative refinement to improve\nthe time complexity dependence on accuracy. For LO problems with quadratically\nmore constraints than variables, the quantum complexity of our method has a\nsublinear dependence on dimension.\n",
  "subjects": [
    "Mathematics/Optimization and Control"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "ntz9RgDoglIy6J_WBTOdmAFYS5cn7HkG87P3kS2SGgM",
  "pdfSize": "342970"
}