{"id":"2412.11646","title":"BA-BFL: Barycentric Aggregation for Bayesian Federated Learning","authors":"Nour Jamoussi, Giuseppe Serra, Photios A. Stavrou and Marios\n  Kountouris","authorsParsed":[["Jamoussi","Nour",""],["Serra","Giuseppe",""],["Stavrou","Photios A.",""],["Kountouris","Marios",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 10:47:05 GMT"}],"updateDate":"2024-12-17","timestamp":1734346025000,"abstract":"  In this work, we study the problem of aggregation in the context of Bayesian\nFederated Learning (BFL). Using an information geometric perspective, we\ninterpret the BFL aggregation step as finding the barycenter of the trained\nposteriors for a pre-specified divergence metric. We study the barycenter\nproblem for the parametric family of $\\alpha$-divergences and, focusing on the\nstandard case of independent and Gaussian distributed parameters, we recover\nthe closed-form solution of the reverse Kullback-Leibler barycenter and develop\nthe analytical form of the squared Wasserstein-2 barycenter. Considering a\nnon-IID setup, where clients possess heterogeneous data, we analyze the\nperformance of the developed algorithms against state-of-the-art (SOTA)\nBayesian aggregation methods in terms of accuracy, uncertainty quantification\n(UQ), model calibration (MC), and fairness. Finally, we extend our analysis to\nthe framework of Hybrid Bayesian Deep Learning (HBDL), where we study how the\nnumber of Bayesian layers in the architecture impacts the considered\nperformance metrics. Our experimental results show that the proposed\nmethodology presents comparable performance with the SOTA while offering a\ngeometric interpretation of the aggregation phase.\n","subjects":["Computer Science/Machine Learning","Computer Science/Information Theory","Computer Science/Networking and Internet Architecture","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"bqzdMrk6a6nEi1yFVeQZdTqum3yXZ0Z6pFqp7f-rsO8","pdfSize":"483113"}