{"id":"2412.12878","title":"Propulsive performance of a windsurf-inspired pitching foil","authors":"Gauthier Bertrand and Tristan Aur\\'egan and Benjamin Thiria and Ramiro\n  Godoy-Diana and Marc Fermigier","authorsParsed":[["Bertrand","Gauthier",""],["Aurégan","Tristan",""],["Thiria","Benjamin",""],["Godoy-Diana","Ramiro",""],["Fermigier","Marc",""]],"versions":[{"version":"v1","created":"Tue, 17 Dec 2024 13:00:14 GMT"}],"updateDate":"2024-12-18","timestamp":1734440414000,"abstract":"  We study experimentally a symmetrical rigid foil performing pitching\noscillations around a mean incidence angle ($\\alpha_{m}$) with respect to an\nincoming flow in a hydrodynamic channel at a constant velocity where the\nReynolds number according to the chord of the foil is, $Re_{c} = \\rho\nU_{\\infty} c / \\mu = 14400$. The problem is inspired from the pumping maneuver\nused by athletes on the new hydrofoil-based windsurf boards. The goal of the\nstudy is to quantify the forces on this configuration by varying the pitching\nkinematics characterized by the Strouhal number ($St_{A} = fA/U_{\\infty}$),\nfrom 0 to 0.27, and the mean incidence angle $\\alpha_{m}$, from 0 to\n30$^{\\circ}$, of the foil. The force measurements show a high lift production\nand the delay of the stall angle according to $St_A$ which can be linked to\nprevious studies about the generation of vortices at the trailing edge. A\ngeneral trend of decrease is observed for the drag force coefficient in\npitching compare to the static case. For the highest Strouhal numbers tested,\ndrag coefficient can become negative (thrust) in a range of $\\alpha_{m}$ up to\n15$^{\\circ}$ in specific case. We present the various impacts of the amplitude\nof beating and the frequency of pitching on the aerodynamic forces for small\nmean incidence angle and high mean incidence angle (above the static stall\nangle). By using a sport-mimetic approach, we transform the measured lift $\\&$\ndrag forces into a propulsive and drifting force. Doing so allows us to\ninvestigate race strategies. We investigate the generation of propulsion in\nupwind conditions.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"PG-NX83bETbcEZ2UMRCEkWRzidDCfODLWvBMyV_LTrw","pdfSize":"6333106"}