{
  "id": "2412.02294",
  "title": "Initial Study On Improving Segmentation By Combining Preoperative CT And\n  Intraoperative CBCT Using Synthetic Data",
  "authors": "Maximilian E. Tschuchnig and Philipp Steininger and Michael Gadermayr",
  "authorsParsed": [
    [
      "Tschuchnig",
      "Maximilian E.",
      ""
    ],
    [
      "Steininger",
      "Philipp",
      ""
    ],
    [
      "Gadermayr",
      "Michael",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 09:08:38 GMT"
    }
  ],
  "updateDate": "2024-12-04",
  "timestamp": 1733216918000,
  "abstract": "  Computer-Assisted Interventions enable clinicians to perform precise,\nminimally invasive procedures, often relying on advanced imaging methods.\nCone-beam computed tomography (CBCT) can be used to facilitate\ncomputer-assisted interventions, despite often suffering from artifacts that\npose challenges for accurate interpretation. While the degraded image quality\ncan affect image analysis, the availability of high quality, preoperative scans\noffers potential for improvements. Here we consider a setting where\npreoperative CT and intraoperative CBCT scans are available, however, the\nalignment (registration) between the scans is imperfect to simulate a real\nworld scenario. We propose a multimodal learning method that fuses roughly\naligned CBCT and CT scans and investigate the effect on segmentation\nperformance. For this experiment we use synthetically generated data containing\nreal CT and synthetic CBCT volumes with corresponding voxel annotations. We\nshow that this fusion setup improves segmentation performance in $18$ out of\n$20$ investigated setups.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Image and Video Processing",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "4nM8I7spwGoi4vTmbpgAiztPBQdmGGtLt7aJ4yw1qP8",
  "pdfSize": "1414740"
}