{"id":"2412.05347","title":"Automated Dynamic Image Analysis for Particle Size and Shape\n  Classification in Three Dimensions","authors":"Sadegh Nadimi, Vasileios Angelidakis, Sadaf Maramizonouz, Chao Zhang","authorsParsed":[["Nadimi","Sadegh",""],["Angelidakis","Vasileios",""],["Maramizonouz","Sadaf",""],["Zhang","Chao",""]],"versions":[{"version":"v1","created":"Fri, 6 Dec 2024 15:36:59 GMT"}],"updateDate":"2024-12-10","timestamp":1733499419000,"abstract":"  We introduce OCULAR, an innovative hardware and software solution for\nthree-dimensional dynamic image analysis of fine particles. Current\nstate-of-the art instruments for dynamic image analysis are largely limited to\ntwo-dimensional imaging. However, extensive literature has demonstrated that\nrelying on a single two-dimensional projection for particle characterisation\ncan lead to inaccuracies in many applications. Existing three-dimensional\nimaging technologies, such as computed tomography, laser scanning, and\northophotography, are limited to static objects. These methods are often not\nstatistically representative and come with significant post-processing\nrequirements, as well as the need for specialised imaging and computing\nresources. OCULAR addresses these challenges by providing a cost-effective\nsolution for imaging continuous particle streams using a synchronised array of\noptical cameras. Particle shape characterisation is achieved through the\nreconstruction of their three-dimensional surfaces. This paper details the\nOCULAR methodology, evaluates its reproducibility, and compares its results\nagainst X-ray micro computed tomography, highlighting its potential for\nefficient and reliable particle analysis.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Condensed Matter/Materials Science","Condensed Matter/Statistical Mechanics","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"DrKFrNcU9rsPxMAv17TsM4hfallAbbmE9EM8Bujhs0c","pdfSize":"4438738"}