{"id":"2412.20374","title":"FairDiffusion: Enhancing Equity in Latent Diffusion Models via Fair\n  Bayesian Perturbation","authors":"Yan Luo, Muhammad Osama Khan, Congcong Wen, Muhammad Muneeb Afzal,\n  Titus Fidelis Wuermeling, Min Shi, Yu Tian, Yi Fang, Mengyu Wang","authorsParsed":[["Luo","Yan",""],["Khan","Muhammad Osama",""],["Wen","Congcong",""],["Afzal","Muhammad Muneeb",""],["Wuermeling","Titus Fidelis",""],["Shi","Min",""],["Tian","Yu",""],["Fang","Yi",""],["Wang","Mengyu",""]],"versions":[{"version":"v1","created":"Sun, 29 Dec 2024 06:33:37 GMT"}],"updateDate":"2024-12-31","timestamp":1735454017000,"abstract":"  Recent progress in generative AI, especially diffusion models, has\ndemonstrated significant utility in text-to-image synthesis. Particularly in\nhealthcare, these models offer immense potential in generating synthetic\ndatasets and training medical students. However, despite these strong\nperformances, it remains uncertain if the image generation quality is\nconsistent across different demographic subgroups. To address this critical\nconcern, we present the first comprehensive study on the fairness of medical\ntext-to-image diffusion models. Our extensive evaluations of the popular Stable\nDiffusion model reveal significant disparities across gender, race, and\nethnicity. To mitigate these biases, we introduce FairDiffusion, an\nequity-aware latent diffusion model that enhances fairness in both image\ngeneration quality as well as the semantic correlation of clinical features. In\naddition, we also design and curate FairGenMed, the first dataset for studying\nthe fairness of medical generative models. Complementing this effort, we\nfurther evaluate FairDiffusion on two widely-used external medical datasets:\nHAM10000 (dermatoscopic images) and CheXpert (chest X-rays) to demonstrate\nFairDiffusion's effectiveness in addressing fairness concerns across diverse\nmedical imaging modalities. Together, FairDiffusion and FairGenMed\nsignificantly advance research in fair generative learning, promoting equitable\nbenefits of generative AI in healthcare.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"AD9tvNd2D3gTvlA2CLw9V_OLPXLXvtdPFSjk8_r8dxY","pdfSize":"11093586"}