{"id":"2412.17257","title":"Asymptotically Optimal Distributionally Robust Solutions through\n  Forecasting and Operations Decentralization","authors":"Yue Lin, Daniel Zhuoyu Long, Viet Anh Nguyen, Jin Qi","authorsParsed":[["Lin","Yue",""],["Long","Daniel Zhuoyu",""],["Nguyen","Viet Anh",""],["Qi","Jin",""]],"versions":[{"version":"v1","created":"Mon, 23 Dec 2024 04:01:19 GMT"}],"updateDate":"2024-12-24","timestamp":1734926479000,"abstract":"  Two-stage risk-averse distributionally robust optimization (DRO) problems are\nubiquitous across many engineering and business applications. Despite their\npromising resilience, two-stage DRO problems are generally computationally\nintractable. To address this challenge, we propose a simple framework by\ndecentralizing the decision-making process into two specialized teams:\nforecasting and operations. This decentralization aligns with prevalent\norganizational practices, in which the operations team uses the information\ncommunicated from the forecasting team as input to make decisions. We formalize\nthis decentralized procedure as a bilevel problem to design a communicated\ndistribution that can yield asymptotic optimal solutions to original two-stage\nrisk-averse DRO problems. We identify an optimal solution that is surprisingly\nsimple: The forecasting team only needs to communicate a two-point distribution\nto the operations team. Consequently, the operations team can solve a highly\ntractable and scalable optimization problem to identify asymptotic optimal\nsolutions. Specifically, as the magnitude of the problem parameters (including\nthe uncertain parameters and the first-stage capacity) increases to infinity at\nan appropriate rate, the cost ratio between our induced solution and the\noriginal optimal solution converges to one, indicating that our decentralized\napproach yields high-quality solutions. We compare our decentralized approach\nagainst the truncated linear decision rule approximation and demonstrate that\nour approach has broader applicability and superior computational efficiency\nwhile maintaining competitive performance. Using real-world sales data, we have\ndemonstrated the practical effectiveness of our strategy. The finely tuned\nsolution significantly outperforms traditional sample-average approximation\nmethods in out-of-sample performance.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"F4otfSdNI7Y50hKJr7ippjfr_Afm3dF83_vm1SHYebA","pdfSize":"1496183"}