{
  "id": "2412.10603",
  "title": "Bright and Purcell-enhanced single photon emission from a silicon G\n  center",
  "authors": "Kyu-Young Kim, Chang-Min Lee, Amirehsan Boreiri, Purbita Purkayastha,\n  Fariba Islam, Samuel Harper, Je-Hyung Kim, and Edo Waks",
  "authorsParsed": [
    [
      "Kim",
      "Kyu-Young",
      ""
    ],
    [
      "Lee",
      "Chang-Min",
      ""
    ],
    [
      "Boreiri",
      "Amirehsan",
      ""
    ],
    [
      "Purkayastha",
      "Purbita",
      ""
    ],
    [
      "Islam",
      "Fariba",
      ""
    ],
    [
      "Harper",
      "Samuel",
      ""
    ],
    [
      "Kim",
      "Je-Hyung",
      ""
    ],
    [
      "Waks",
      "Edo",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 23:10:44 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734131444000,
  "abstract": "  Silicon G centers show significant promise as single photon sources in a\nscalable silicon platform. But these color centers have large non-radiative\ndecay and a low Debye-Waller factor, limiting their usability in quantum\napplications. In this work, we demonstrate bright Purcell-enhanced emission\nfrom a silicon G center by coupling it to a nanophotonic cavity. The nanobeam\ncavity enhances the spontaneous emission rate of a single G center by a factor\nof 6, corresponding to a Purcell factor greater than 31 when accounting for\ndecay into the phonon sideband. We obtain a spontaneous emission rate of 0.97\nns, which is the fastest single photon emission rate reported in silicon. With\nthis radiative enhancement, we achieve an order of magnitude improvement in\nemitter brightness compared to previously reported values. These results pave\nthe way for scalable quantum light sources on a silicon photonic chip.\n",
  "subjects": [
    "Physics/Optics",
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "jts7pGopVEzAheaNHb9U2LV4UStvEj_LVcLBGfL6MEg",
  "pdfSize": "5106175"
}