{"id":"2412.07959","title":"Deep-Learning Control of Lower-Limb Exoskeletons via simplified\n  Therapist Input","authors":"Lorenzo Vianello, Cl\\'ement Lhoste, Emek Bar{\\i}\\c{s}\n  K\\\"u\\c{c}\\\"uktabak, Matthew Short, Levi Hargrove, Jose L. Pons","authorsParsed":[["Vianello","Lorenzo",""],["Lhoste","Clément",""],["Küçüktabak","Emek Barış",""],["Short","Matthew",""],["Hargrove","Levi",""],["Pons","Jose L.",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 22:52:44 GMT"}],"updateDate":"2024-12-12","timestamp":1733871164000,"abstract":"  Partial-assistance exoskeletons hold significant potential for gait\nrehabilitation by promoting active participation during (re)learning of\nnormative walking patterns. Typically, the control of interaction torques in\npartial-assistance exoskeletons relies on a hierarchical control structure.\nThese approaches require extensive calibration due to the complexity of the\ncontroller and user-specific parameter tuning, especially for activities like\nstair or ramp navigation. To address the limitations of hierarchical control in\nexoskeletons, this work proposes a three-step, data-driven approach: (1) using\nrecent sensor data to probabilistically infer locomotion states (landing step\nlength, landing step height, walking velocity, step clearance, gait phase), (2)\nallowing therapists to modify these features via a user interface, and (3)\nusing the adjusted locomotion features to predict the desired joint posture and\nmodel stiffness in a spring-damper system based on prediction uncertainty. We\nevaluated the proposed approach with two healthy participants engaging in\ntreadmill walking and stair ascent and descent at varying speeds, with and\nwithout external modification of the gait features through a user interface.\nResults showed a variation in kinematics according to the gait characteristics\nand a negative interaction power suggesting exoskeleton assistance across the\ndifferent conditions.\n","subjects":["Computer Science/Robotics","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"rJWeB-xnNHp45NH9Teil_EmiHiKEeftbcAABLwWerk8","pdfSize":"1579786"}