{
  "id": "2412.07964",
  "title": "Geometry helps in routing scalability",
  "authors": "Matt Piekenbrock",
  "authorsParsed": [
    [
      "Piekenbrock",
      "Matt",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 23:06:32 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 17 Dec 2024 18:42:54 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1733871992000,
  "abstract": "  Delay Tolerant Networking (DTN) aims to address a myriad of significant\nnetworking challenges that appear in time-varying settings, such as mobile and\nsatellite networks, wherein changes in network topology are frequent and often\nsubject to environmental constraints. Within this paradigm, routing problems\nare often solved by extending classical graph-theoretic path finding\nalgorithms, such as the Bellman-Ford or Floyd-Warshall algorithms, to the\ntime-varying setting; such extensions are simple to understand, but they have\nstrict optimality criteria and can exhibit non-polynomial scaling.\nAcknowledging this, we study time-varying shortest path problems on metric\ngraphs whose vertices are traced by semi-algebraic curves. As an exemplary\napplication, we establish a polynomial upper bound on the number of topological\ncritical events encountered by a set of $n$ satellites moving along elliptic\ncurves in low Earth orbit (per orbital period). Experimental evaluations on\nnetworks derived from STARLINK satellite TLE's demonstrate that not only does\nthis geometric framework allow for routing schemes between satellites requiring\nrecomputation an order of magnitude less than graph-based methods, but it also\ndemonstrates metric spanner properties exist in metric graphs derived from\nreal-world data, opening the door for broader applications of geometric DTN\nrouting.\n",
  "subjects": [
    "Computer Science/Data Structures and Algorithms",
    "Computer Science/Computational Geometry",
    "Computer Science/Networking and Internet Architecture"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "wI8EejY9IHA8K0V6uVVFvgmrZ7cVP_ar4-wTBuLxftU",
  "pdfSize": "1348661"
}