{
  "id": "2412.10923",
  "title": "Linear Programming based Approximation to Individually Fair k-Clustering\n  with Outliers",
  "authors": "Binita Maity, Shrutimoy Das, and Anirban Dasgupta",
  "authorsParsed": [
    [
      "Maity",
      "Binita",
      ""
    ],
    [
      "Das",
      "Shrutimoy",
      ""
    ],
    [
      "Dasgupta",
      "Anirban",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 14 Dec 2024 18:16:46 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734200206000,
  "abstract": "  Individual fairness guarantees are often desirable properties to have, but\nthey become hard to formalize when the dataset contains outliers. Here, we\ninvestigate the problem of developing an individually fair $k$-means clustering\nalgorithm for datasets that contain outliers. That is, given $n$ points and $k$\ncenters, we want that for each point which is not an outlier, there must be a\ncenter within the $\\frac{n}{k}$ nearest neighbours of the given point. While a\nfew of the recent works have looked into individually fair clustering, this is\nthe first work that explores this problem in the presence of outliers for\n$k$-means clustering.\n  For this purpose, we define and solve a linear program (LP) that helps us\nidentify the outliers. We exclude these outliers from the dataset and apply a\nrounding algorithm that computes the $k$ centers, such that the fairness\nconstraint of the remaining points is satisfied. We also provide theoretical\nguarantees that our method leads to a guaranteed approximation of the fair\nradius as well as the clustering cost. We also demonstrate our techniques\nempirically on real-world datasets.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Data Structures and Algorithms",
    "Statistics/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "gNfO-lETIR_T0fbBRZle2qopUxQK0czMXKBcz3iPkCU",
  "pdfSize": "693447"
}