{
  "id": "2412.03480",
  "title": "The morphology and interface structure of titanium on graphene",
  "authors": "Joachim Dahl Thomsen, Wissam A. Saidi, Kate Reidy, Jatin J. Patil,\n  Serin Lee, Frances M. Ross, Prineha Narang",
  "authorsParsed": [
    [
      "Thomsen",
      "Joachim Dahl",
      ""
    ],
    [
      "Saidi",
      "Wissam A.",
      ""
    ],
    [
      "Reidy",
      "Kate",
      ""
    ],
    [
      "Patil",
      "Jatin J.",
      ""
    ],
    [
      "Lee",
      "Serin",
      ""
    ],
    [
      "Ross",
      "Frances M.",
      ""
    ],
    [
      "Narang",
      "Prineha",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 17:12:34 GMT"
    }
  ],
  "updateDate": "2024-12-05",
  "timestamp": 1733332354000,
  "abstract": "  Titanium (Ti) is an adhesion and contact metal commonly used in\nnanoelectronics and two-dimensional (2D) materials research. However, when Ti\nis deposited on graphene (Gr), we obtain dramatically different film morphology\ndepending on the experimental conditions. Through a combination of transmission\nelectron microscopy, Raman spectroscopy, and ab initio density functional\ntheory calculations, we show that the most critical parameters are the number\nof Gr layers, the nature of the Gr support, and the deposition temperature.\nParticularly distinctive is the island morphology and large defect density of\nTi on monolayer Gr, compared to bilayer or thicker Gr. We propose that this\nresults from structural and mechanical differences between monolayer and\nthicker Gr flakes, where monolayer Gr is more flexible, exhibits larger surface\nroughness and therefore lower Ti diffusivity, and is more easily damaged. Our\nresults highlight the extreme sensitivity of Ti morphology on Gr to processing\nand substrate conditions, allowing us to propose design rules for controlling\nTi-Gr interface properties and morphology and to discuss the implications for\nother technologically relevant metal deposition processes.\n",
  "subjects": [
    "Condensed Matter/Materials Science",
    "Condensed Matter/Mesoscale and Nanoscale Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "zrbIPbw-8SnXtd8mRAqiM-mrFzydHMcKXxunVdki22A",
  "pdfSize": "13291993"
}