{
  "id": "2412.03545",
  "title": "Absence of altermagnetic magnon band splitting in MnF$_2$",
  "authors": "Vincent C. Morano, Zeno Maesen, Stanislav E. Nikitin, Jakob Lass,\n  Daniel G. Mazzone, Oksana Zaharko",
  "authorsParsed": [
    [
      "Morano",
      "Vincent C.",
      ""
    ],
    [
      "Maesen",
      "Zeno",
      ""
    ],
    [
      "Nikitin",
      "Stanislav E.",
      ""
    ],
    [
      "Lass",
      "Jakob",
      ""
    ],
    [
      "Mazzone",
      "Daniel G.",
      ""
    ],
    [
      "Zaharko",
      "Oksana",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 18:43:22 GMT"
    }
  ],
  "updateDate": "2024-12-05",
  "timestamp": 1733337802000,
  "abstract": "  Altermagnets are collinear compensated magnets in which the magnetic\nsublattices are related by rotation rather than translation or inversion. One\nof the quintessential properties of altermagnets is the presence of split\nchiral magnon modes. Recently, such modes have been predicted in MnF$_2$. Here,\nwe report inelastic neutron scattering results on an MnF$_2$ single-crystal\nalong high-symmetry Brillouin zone paths for which the magnon splitting is\nexpected. Within the resolution of our measurement, we do not observe the\npredicted splitting. The inelastic spectrum is well-modeled using $J_1, ~J_2,\n~J_3$ nearest-neighbor exchange interactions with weak uniaxial anisotropy.\nThese interactions have higher symmetry than the crystal lattice, while the\ninteractions predicted to produce the altermagnetic splitting are negligibly\nsmall. Therefore, the two magnon modes appear to be degenerate over the entire\nBrillouin zone and the spin dynamics of MnF$_2$ is indistinguishable from a\nclassical N\\'eel antiferromagnet. Application of magnetic field causes a Zeeman\nsplitting of the magnon modes close to the $\\mathrm{\\Gamma}$ point. Even if\nchiral magnon modes are allowed by altermagnetic symmetry, the splitting in\nreal materials such as MnF$_2$ can be negligibly small.\n",
  "subjects": [
    "Condensed Matter/Strongly Correlated Electrons"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "OTUsQBjO4OGF_yeDmWWuyL5y1Fwj1KL21J2xxzIhwH8",
  "pdfSize": "20263514"
}