{"id":"2412.13475","title":"A Statistical and Multi-Perspective Revisiting of the Membership\n  Inference Attack in Large Language Models","authors":"Bowen Chen and Namgi Han and Yusuke Miyao","authorsParsed":[["Chen","Bowen",""],["Han","Namgi",""],["Miyao","Yusuke",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 03:39:42 GMT"}],"updateDate":"2024-12-19","timestamp":1734493182000,"abstract":"  The lack of data transparency in Large Language Models (LLMs) has highlighted\nthe importance of Membership Inference Attack (MIA), which differentiates\ntrained (member) and untrained (non-member) data. Though it shows success in\nprevious studies, recent research reported a near-random performance in\ndifferent settings, highlighting a significant performance inconsistency. We\nassume that a single setting doesn't represent the distribution of the vast\ncorpora, causing members and non-members with different distributions to be\nsampled and causing inconsistency. In this study, instead of a single setting,\nwe statistically revisit MIA methods from various settings with thousands of\nexperiments for each MIA method, along with study in text feature, embedding,\nthreshold decision, and decoding dynamics of members and non-members. We found\nthat (1) MIA performance improves with model size and varies with domains,\nwhile most methods do not statistically outperform baselines, (2) Though MIA\nperformance is generally low, a notable amount of differentiable member and\nnon-member outliers exists and vary across MIA methods, (3) Deciding a\nthreshold to separate members and non-members is an overlooked challenge, (4)\nText dissimilarity and long text benefit MIA performance, (5) Differentiable or\nnot is reflected in the LLM embedding, (6) Member and non-members show\ndifferent decoding dynamics.\n","subjects":["Computer Science/Computation and Language","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"w0muMRlXFMBwy8bFAwX8jZlk8JiC6pO5TjWvWVIET9s","pdfSize":"11817819"}