{"id":"2412.01093","title":"Automated Extraction of Acronym-Expansion Pairs from Scientific Papers","authors":"Izhar Ali, Million Haileyesus, Serhiy Hnatyshyn, Jan-Lucas Ott, Vasil\n  Hnatyshin","authorsParsed":[["Ali","Izhar",""],["Haileyesus","Million",""],["Hnatyshyn","Serhiy",""],["Ott","Jan-Lucas",""],["Hnatyshin","Vasil",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 04:05:49 GMT"}],"updateDate":"2024-12-03","timestamp":1733112349000,"abstract":"  This project addresses challenges posed by the widespread use of\nabbreviations and acronyms in digital texts. We propose a novel method that\ncombines document preprocessing, regular expressions, and a large language\nmodel to identify abbreviations and map them to their corresponding expansions.\nThe regular expressions alone are often insufficient to extract expansions, at\nwhich point our approach leverages GPT-4 to analyze the text surrounding the\nacronyms. By limiting the analysis to only a small portion of the surrounding\ntext, we mitigate the risk of obtaining incorrect or multiple expansions for an\nacronym. There are several known challenges in processing text with acronyms,\nincluding polysemous acronyms, non-local and ambiguous acronyms. Our approach\nenhances the precision and efficiency of NLP techniques by addressing these\nissues with automated acronym identification and disambiguation. This study\nhighlights the challenges of working with PDF files and the importance of\ndocument preprocessing. Furthermore, the results of this work show that neither\nregular expressions nor GPT-4 alone can perform well. Regular expressions are\nsuitable for identifying acronyms but have limitations in finding their\nexpansions within the paper due to a variety of formats used for expressing\nacronym-expansion pairs and the tendency of authors to omit expansions within\nthe text. GPT-4, on the other hand, is an excellent tool for obtaining\nexpansions but struggles with correctly identifying all relevant acronyms.\nAdditionally, GPT-4 poses challenges due to its probabilistic nature, which may\nlead to slightly different results for the same input. Our algorithm employs\npreprocessing to eliminate irrelevant information from the text, regular\nexpressions for identifying acronyms, and a large language model to help find\nacronym expansions to provide the most accurate and consistent results.\n","subjects":["Computer Science/Computation and Language","Computer Science/Information Retrieval"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"n7xTgQf8GNdMYyv2OjtVTPdm8pHljx12M06O40M0lrI","pdfSize":"266240"}