{"id":"2412.11137","title":"Decoding Drug Discovery: Exploring A-to-Z In silico Methods for\n  Beginners","authors":"Hezha O. Rasul, Dlzar D. Ghafour, Bakhtyar K. Aziz, Bryar A. Hassan,\n  Tarik A. Rashid, and Arif Kivrak","authorsParsed":[["Rasul","Hezha O.",""],["Ghafour","Dlzar D.",""],["Aziz","Bakhtyar K.",""],["Hassan","Bryar A.",""],["Rashid","Tarik A.",""],["Kivrak","Arif",""]],"versions":[{"version":"v1","created":"Sun, 15 Dec 2024 10:02:38 GMT"}],"updateDate":"2024-12-17","timestamp":1734256958000,"abstract":"  The drug development process is a critical challenge in the pharmaceutical\nindustry due to its time-consuming nature and the need to discover new drug\npotentials to address various ailments. The initial step in drug development,\ndrug target identification, often consumes considerable time. While valid,\ntraditional methods such as in vivo and in vitro approaches are limited in\ntheir ability to analyze vast amounts of data efficiently, leading to wasteful\noutcomes. To expedite and streamline drug development, an increasing reliance\non computer-aided drug design (CADD) approaches has merged. These sophisticated\nin silico methods offer a promising avenue for efficiently identifying viable\ndrug candidates, thus providing pharmaceutical firms with significant\nopportunities to uncover new prospective drug targets. The main goal of this\nwork is to review in silico methods used in the drug development process with a\nfocus on identifying therapeutic targets linked to specific diseases at the\ngenetic or protein level. This article thoroughly discusses A-to-Z in silico\ntechniques, which are essential for identifying the targets of bioactive\ncompounds and their potential therapeutic effects. This review intends to\nimprove drug discovery processes by illuminating the state of these\ncutting-edge approaches, thereby maximizing the effectiveness and duration of\nclinical trials for novel drug target investigation.\n","subjects":["Quantitative Biology/Quantitative Methods","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"AsfukU9XWfC-gVRwsl7e6FICmeXgSiLMfSnn8YBENZw","pdfSize":"2372246"}