{
  "id": "2412.12068",
  "title": "SPADE: Spectroscopic Photoacoustic Denoising using an Analytical and\n  Data-free Enhancement Framework",
  "authors": "Fangzhou Lin, Shang Gao, Yichuan Tang, Xihan Ma, Ryo Murakami, Ziming\n  Zhang, John D. Obayemi, Winston W. Soboyejo, Haichong K. Zhang",
  "authorsParsed": [
    [
      "Lin",
      "Fangzhou",
      ""
    ],
    [
      "Gao",
      "Shang",
      ""
    ],
    [
      "Tang",
      "Yichuan",
      ""
    ],
    [
      "Ma",
      "Xihan",
      ""
    ],
    [
      "Murakami",
      "Ryo",
      ""
    ],
    [
      "Zhang",
      "Ziming",
      ""
    ],
    [
      "Obayemi",
      "John D.",
      ""
    ],
    [
      "Soboyejo",
      "Winston W.",
      ""
    ],
    [
      "Zhang",
      "Haichong K.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 18:42:05 GMT"
    },
    {
      "version": "v2",
      "created": "Sun, 22 Dec 2024 00:34:22 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734374525000,
  "abstract": "  Spectroscopic photoacoustic (sPA) imaging uses multiple wavelengths to\ndifferentiate chromophores based on their unique optical absorption spectra.\nThis technique has been widely applied in areas such as vascular mapping, tumor\ndetection, and therapeutic monitoring. However, sPA imaging is highly\nsusceptible to noise, leading to poor signal-to-noise ratio (SNR) and\ncompromised image quality. Traditional denoising techniques like frame\naveraging, though effective in improving SNR, can be impractical for dynamic\nimaging scenarios due to reduced frame rates. Advanced methods, including\nlearning-based approaches and analytical algorithms, have demonstrated promise\nbut often require extensive training data and parameter tuning, limiting their\nadaptability for real-time clinical use. In this work, we propose a sPA\ndenoising using a tuning-free analytical and data-free enhancement (SPADE)\nframework for denoising sPA images. This framework integrates a data-free\nlearning-based method with an efficient BM3D-based analytical approach while\npreserves spectral linearity, providing noise reduction and ensuring that\nfunctional information is maintained. The SPADE framework was validated through\nsimulation, phantom, ex vivo, and in vivo experiments. Results demonstrated\nthat SPADE improved SNR and preserved spectral information, outperforming\nconventional methods, especially in challenging imaging conditions. SPADE\npresents a promising solution for enhancing sPA imaging quality in clinical\napplications where noise reduction and spectral preservation are critical.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "V2PkhV1F6uFxtzXWf_PUG9NMwzTdUVIM_nTPfh6SjWI",
  "pdfSize": "846476"
}