{
  "id": "2412.06027",
  "title": "A Generalized Mixture Cure Model Incorporating Known Cured Individuals",
  "authors": "Georgios Karakatsoulis",
  "authorsParsed": [
    [
      "Karakatsoulis",
      "Georgios",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 8 Dec 2024 18:58:36 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733684316000,
  "abstract": "  The Mixture Cure (MC) models constitute an appropriate and easily\ninterpretable method when studying a time-to-event variable in a population\ncomprised of both susceptible and cured individuals. In literature, those\nmodels usually assume that the latter are unobservable. However, there are\ncases in which a cured individual may be identified. For example, when studying\nthe distant metastasis during the lifetime or the miscarriage during pregnancy,\nindividuals that have died without a metastasis or have given birth are\ncertainly non-susceptible. The same also holds when studying the x-year overall\nsurvival or the death during hospital stay. Common MC models ignore this\ninformation and consider them all censored, thus yielding in risk of assigning\nlow immune probabilities to cured individuals. In this study, we consider a MC\nmodel that incorporates known information on cured individuals, with the time\nto cure identification being either deterministic or stochastic. We use the\nexpectation-maximization algorithm to derive the maximum likelihood estimators.\nFurthermore, we compare different strategies that account for cure information\nsuch as (1) assigning infinite times to event for known cured cases and\nadjusting the traditional model and (2) considering only the probability of\ncure identification but ignoring the time until that happens. Theoretical\nresults and simulations demonstrate the value of the proposed model especially\nwhen the time to cure identification is stochastic, increasing precision and\ndecreasing the mean squared error. On the other hand, the traditional models\nthat ignore the known cured information perform well when the curation is\nachieved after a known cutoff point. Moreover, through simulations the\ncomparisons of the different strategies are examined, as possible alternatives\nto the complete-information model.\n",
  "subjects": [
    "Statistics/Methodology"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "mtNvzWKtOiKOWGk_WH33CxrpQXv3WhGFicmeUhQkKRM",
  "pdfSize": "845824"
}