{
  "id": "2412.05731",
  "title": "A Scoping Review of ChatGPT Research in Accounting and Finance",
  "authors": "Mengming Michael Dong, Theophanis C. Stratopoulos, Victor Xiaoqi Wang",
  "authorsParsed": [
    [
      "Dong",
      "Mengming Michael",
      ""
    ],
    [
      "Stratopoulos",
      "Theophanis C.",
      ""
    ],
    [
      "Wang",
      "Victor Xiaoqi",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 7 Dec 2024 19:45:46 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733600746000,
  "abstract": "  This paper provides a review of recent publications and working papers on\nChatGPT and related Large Language Models (LLMs) in accounting and finance. The\naim is to understand the current state of research in these two areas and\nidentify potential research opportunities for future inquiry. We identify three\ncommon themes from these earlier studies. The first theme focuses on\napplications of ChatGPT and LLMs in various fields of accounting and finance.\nThe second theme utilizes ChatGPT and LLMs as a new research tool by leveraging\ntheir capabilities such as classification, summarization, and text generation.\nThe third theme investigates implications of LLM adoption for accounting and\nfinance professionals, as well as for various organizations and sectors. While\nthese earlier studies provide valuable insights, they leave many important\nquestions unanswered or partially addressed. We propose venues for further\nexploration and provide technical guidance for researchers seeking to employ\nChatGPT and related LLMs as a tool for their research.\n",
  "subjects": [
    "Quantitative Finance/General Finance",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Computational Engineering, Finance, and Science",
    "Computer Science/Machine Learning",
    "Economics/General Economics",
    "Quantitative Finance/Economics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "QU2ZRFMMCdp0ehciYLvyl4p6lxlghBbFu4uTfJ38l6I",
  "pdfSize": "554403"
}