{"id":"2412.15756","title":"Probabilistic Latent Variable Modeling for Dynamic Friction\n  Identification and Estimation","authors":"Victor Vantilborgh, Sander De Witte, Frederik Ostyn, Tom Lefebvre and\n  Guillaume Crevecoeur","authorsParsed":[["Vantilborgh","Victor",""],["De Witte","Sander",""],["Ostyn","Frederik",""],["Lefebvre","Tom",""],["Crevecoeur","Guillaume",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 10:16:18 GMT"}],"updateDate":"2024-12-23","timestamp":1734689778000,"abstract":"  Precise identification of dynamic models in robotics is essential to support\ncontrol design, friction compensation, output torque estimation, etc. A\nlongstanding challenge remains in the identification of friction models for\nrobotic joints, given the numerous physical phenomena affecting the underlying\nfriction dynamics which result into nonlinear characteristics and hysteresis\nbehaviour in particular. These phenomena proof difficult to be modelled and\ncaptured accurately using physical analogies alone. This has motivated\nresearchers to shift from physics-based to data-driven models. Currently, these\nmethods are still limited in their ability to generalize effectively to typical\nindustrial robot deployement, characterized by high- and low-velocity\noperations and frequent direction reversals. Empirical observations motivate\nthe use of dynamic friction models but these remain particulary challenging to\nestablish. To address the current limitations, we propose to account for\nunidentified dynamics in the robot joints using latent dynamic states. The\nfriction model may then utilize both the dynamic robot state and additional\ninformation encoded in the latent state to evaluate the friction torque. We\ncast this stochastic and partially unsupervised identification problem as a\nstandard probabilistic representation learning problem. In this work both the\nfriction model and latent state dynamics are parametrized as neural networks\nand integrated in the conventional lumped parameter dynamic robot model. The\ncomplete dynamics model is directly learned from the noisy encoder measurements\nin the robot joints. We use the Expectation-Maximisation (EM) algorithm to find\na Maximum Likelihood Estimate (MLE) of the model parameters. The effectiveness\nof the proposed method is validated in terms of open-loop prediction accuracy\nin comparison with baseline methods, using the Kuka KR6 R700 as a test\nplatform.\n","subjects":["Computer Science/Robotics","Computer Science/Machine Learning","Computer Science/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"LWixuvy-74ARZvixr32-W8UhzblnNoqDDnAxvnMjWbk","pdfSize":"4808537"}