{
  "id": "2412.04497",
  "title": "Opportunities and Challenges of Large Language Models for Low-Resource\n  Languages in Humanities Research",
  "authors": "Tianyang Zhong, Zhenyuan Yang, Zhengliang Liu, Ruidong Zhang, Yiheng\n  Liu, Haiyang Sun, Yi Pan, Yiwei Li, Yifan Zhou, Hanqi Jiang, Junhao Chen,\n  Tianming Liu",
  "authorsParsed": [
    [
      "Zhong",
      "Tianyang",
      ""
    ],
    [
      "Yang",
      "Zhenyuan",
      ""
    ],
    [
      "Liu",
      "Zhengliang",
      ""
    ],
    [
      "Zhang",
      "Ruidong",
      ""
    ],
    [
      "Liu",
      "Yiheng",
      ""
    ],
    [
      "Sun",
      "Haiyang",
      ""
    ],
    [
      "Pan",
      "Yi",
      ""
    ],
    [
      "Li",
      "Yiwei",
      ""
    ],
    [
      "Zhou",
      "Yifan",
      ""
    ],
    [
      "Jiang",
      "Hanqi",
      ""
    ],
    [
      "Chen",
      "Junhao",
      ""
    ],
    [
      "Liu",
      "Tianming",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 30 Nov 2024 00:10:56 GMT"
    },
    {
      "version": "v2",
      "created": "Mon, 9 Dec 2024 03:00:42 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1732925456000,
  "abstract": "  Low-resource languages serve as invaluable repositories of human history,\nembodying cultural evolution and intellectual diversity. Despite their\nsignificance, these languages face critical challenges, including data scarcity\nand technological limitations, which hinder their comprehensive study and\npreservation. Recent advancements in large language models (LLMs) offer\ntransformative opportunities for addressing these challenges, enabling\ninnovative methodologies in linguistic, historical, and cultural research. This\nstudy systematically evaluates the applications of LLMs in low-resource\nlanguage research, encompassing linguistic variation, historical documentation,\ncultural expressions, and literary analysis. By analyzing technical frameworks,\ncurrent methodologies, and ethical considerations, this paper identifies key\nchallenges such as data accessibility, model adaptability, and cultural\nsensitivity. Given the cultural, historical, and linguistic richness inherent\nin low-resource languages, this work emphasizes interdisciplinary collaboration\nand the development of customized models as promising avenues for advancing\nresearch in this domain. By underscoring the potential of integrating\nartificial intelligence with the humanities to preserve and study humanity's\nlinguistic and cultural heritage, this study fosters global efforts towards\nsafeguarding intellectual diversity.\n",
  "subjects": [
    "Computer Science/Computation and Language",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "2Y2XF1cMMg_5fx_0ohLuihAJB1oNrWntBQaL7IuELwI",
  "pdfSize": "517768"
}