{
  "id": "2412.09725",
  "title": "Laser-Induced Gas-Phase Transfer and Direct Stamping of Nanomaterials:\n  Comparison of Nanosecond and Femtosecond Pulses",
  "authors": "Nathan T. Goodfriend, Inam Mirza, Alexander V. Bulgakov, Eleanor E.B.\n  Campbell, Nadezhda M. Bulgakova",
  "authorsParsed": [
    [
      "Goodfriend",
      "Nathan T.",
      ""
    ],
    [
      "Mirza",
      "Inam",
      ""
    ],
    [
      "Bulgakov",
      "Alexander V.",
      ""
    ],
    [
      "Campbell",
      "Eleanor E. B.",
      ""
    ],
    [
      "Bulgakova",
      "Nadezhda M.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 21:27:41 GMT"
    },
    {
      "version": "v2",
      "created": "Thu, 26 Dec 2024 21:17:43 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1734038861000,
  "abstract": "  The two-dimensional nanomaterial, hexagonal boron nitride (hBN) was cleanly\ntransferred via a blister-based laser-induced forward-transfer method. The\ntransfer was performed utilizing femtosecond and nanosecond laser pulses for\nseparation distances of ~16 and ~200 micrometers between a titanium donor film\ndeposited on a glass substrate and a silicon/silicon dioxide receiver. Transfer\nefficiency was examined for isolated laser pulses as well as for series of\noverlapping pulses and single layer transfer was confirmed. It was found that\nhBN is transferable for all tested combinations of pulse duration and transfer\ndistances. The results indicate that transfer proceeds via direct stamping for\nshort donor-to-receiver distances while, for the larger distance, the material\nis ejected from the donor and lands on the receiver. Furthermore, with\noverlapping pulses, nanosecond laser pulses enable a successful printing of hBN\nlines while, for fs laser pulses, the Ti film can be locally disrupted by\nmultiple pulses and molten titanium may be transferred along with the hBN\nflakes. For reproducibility, and to avoid contamination with metal deposits,\nlow laser fluence transfer with ns pulses and transfer distances smaller than\nthe blister height provide the most favourable and reproducible condition.\n",
  "subjects": [
    "Physics/Optics",
    "Condensed Matter/Materials Science"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "j2bm9hd2BwEn2itZ61NUZdDajaBr-5tYHejXBS10LIg",
  "pdfSize": "1232303"
}