{"id":"2412.08017","title":"Integrated probabilistic computer using voltage-controlled magnetic\n  tunnel junctions as its entropy source","authors":"Christian Duffee, Jordan Athas, Yixin Shao, Noraica Davila Melendez,\n  Eleonora Raimondo, Jordan A. Katine, Kerem Y. Camsari, Giovanni Finocchio,\n  Pedram Khalili Amiri","authorsParsed":[["Duffee","Christian",""],["Athas","Jordan",""],["Shao","Yixin",""],["Melendez","Noraica Davila",""],["Raimondo","Eleonora",""],["Katine","Jordan A.",""],["Camsari","Kerem Y.",""],["Finocchio","Giovanni",""],["Amiri","Pedram Khalili",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 01:55:13 GMT"}],"updateDate":"2024-12-12","timestamp":1733882113000,"abstract":"  Probabilistic Ising machines (PIMs) provide a path to solving many\ncomputationally hard problems more efficiently than deterministic algorithms on\nvon Neumann computers. Stochastic magnetic tunnel junctions (S-MTJs), which are\nengineered to be thermally unstable, show promise as entropy sources in PIMs.\nHowever, scaling up S-MTJ-PIMs is challenging, as it requires fine control of a\nsmall magnetic energy barrier across large numbers of devices. In addition,\nnon-spintronic components of S-MTJ-PIMs to date have been primarily realized\nusing general-purpose processors or field-programmable gate arrays. Reaching\nthe ultimate performance of spintronic PIMs, however, requires co-designed\napplication-specific integrated circuits (ASICs), combining CMOS with\nspintronic entropy sources. Here we demonstrate an ASIC in 130 nm foundry CMOS,\nwhich implements integer factorization as a representative hard optimization\nproblem, using PIM-based invertible logic gates realized with 1143\nprobabilistic bits. The ASIC uses stochastic bit sequences read from an\nadjacent voltage-controlled (V-) MTJ chip. The V-MTJs are designed to be\nthermally stable in the absence of voltage, and generate random bits on-demand\nin response to 10 ns pulses using the voltage-controlled magnetic anisotropy\neffect. We experimentally demonstrate the chip's functionality and provide\nprojections for designs in advanced nodes, illustrating a path to millions of\nprobabilistic bits on a single CMOS+V-MTJ chip.\n","subjects":["Physics/Applied Physics","Condensed Matter/Disordered Systems and Neural Networks"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"fhhkc-BOKdKLqUyK4JyH7Ays6iytsJpUZ3zoNeve7mM","pdfSize":"1607866"}