{
  "id": "2412.15255",
  "title": "Data Laundering: Artificially Boosting Benchmark Results through\n  Knowledge Distillation",
  "authors": "Jonibek Mansurov, Akhmed Sakip, Alham Fikri Aji",
  "authorsParsed": [
    [
      "Mansurov",
      "Jonibek",
      ""
    ],
    [
      "Sakip",
      "Akhmed",
      ""
    ],
    [
      "Aji",
      "Alham Fikri",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 15 Dec 2024 19:38:48 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734291528000,
  "abstract": "  In this paper, we show that knowledge distillation can be subverted to\nmanipulate language model benchmark scores, revealing a critical vulnerability\nin current evaluation practices. We introduce \"Data Laundering,\" a three-phase\nprocess analogous to financial money laundering, that enables the covert\ntransfer of benchmark-specific knowledge through seemingly legitimate\nintermediate training steps. Through extensive experiments with a 2-layer BERT\nstudent model, we show how this approach can achieve substantial improvements\nin benchmark accuracy (up to 75\\% on GPQA) without developing genuine reasoning\ncapabilities. Notably, this method can be exploited intentionally or even\nunintentionally, as researchers may inadvertently adopt this method that\ninflates scores using knowledge distillation without realizing the\nimplications. While our findings demonstrate the effectiveness of this\ntechnique, we present them as a cautionary tale highlighting the urgent need\nfor more robust evaluation methods in AI. This work aims to contribute to the\nongoing discussion about evaluation integrity in AI development and the need\nfor benchmarks that more accurately reflect true model capabilities. The code\nis available at \\url{https://github.com/mbzuai-nlp/data_laundering}.\n",
  "subjects": [
    "Computer Science/Computation and Language",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "x8p07VZzUu30iNQcxKd9g-1A3NI18eAtmaPTZBxM6jw",
  "pdfSize": "2312097"
}