{"id":"2412.18667","title":"State-of-the-Art Underwater Vehicles and Technologies Enabling Smart\n  Ocean: Survey and Classifications","authors":"Jiajie Xu, Xabier Irigoien and Mohamed-Slim Alouini","authorsParsed":[["Xu","Jiajie",""],["Irigoien","Xabier",""],["Alouini","Mohamed-Slim",""]],"versions":[{"version":"v1","created":"Tue, 24 Dec 2024 20:00:15 GMT"}],"updateDate":"2024-12-30","timestamp":1735070415000,"abstract":"  The exploration and sustainable use of marine environments have become\nincreasingly critical as oceans cover over 70% of surface of Earth. This paper\nprovides a comprehensive survey and classification of state-of-the-art\nunderwater vehicles (UVs) and supporting technologies essential for enabling a\nsmart ocean. We categorize UVs into several types, including remotely operated\nvehicles (ROVs), autonomous underwater vehicles (AUVs), hybrid underwater\nvehicles (HUVs), unmanned surface vehicles (USVs), and underwater bionic\nvehicles (UBVs). These technologies are fundamental in a wide range of\napplications, such as environmental monitoring, deep-sea exploration, defense,\nand underwater infrastructure inspection. Additionally, the paper explores\nadvancements in underwater communication technologies, namely acoustic,\noptical, and hybrid systems, as well as key support facilities, including\nsubmerged buoys, underwater docking stations, and wearable underwater\nlocalization systems. By classifying the vehicles and analyzing their\ntechnological capabilities and limitations, this work aims to guide future\ndevelopments in underwater exploration and monitoring, addressing challenges\nsuch as energy efficiency, communication limitations, and environmental\nadaptability. The paper concludes by discussing the integration of artificial\nintelligence and machine learning in enhancing the autonomy and operational\nefficiency of these systems, paving the way for the realization of a fully\ninterconnected and sustainable Smart Ocean.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computer Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"FIIp_T6AZI3dHo9va0J0HkmbmIKfUZzsM6Av80Fs3nQ","pdfSize":"13617238"}