{"id":"2412.06564","title":"Applications and Implications of Large Language Models in Qualitative\n  Analysis: A New Frontier for Empirical Software Engineering","authors":"Matheus de Morais Le\\c{c}a, Lucas Valen\\c{c}a, Reydne Santos, Ronnie\n  de Souza Santos","authorsParsed":[["Leça","Matheus de Morais",""],["Valença","Lucas",""],["Santos","Reydne",""],["Santos","Ronnie de Souza",""]],"versions":[{"version":"v1","created":"Mon, 9 Dec 2024 15:17:36 GMT"},{"version":"v2","created":"Tue, 10 Dec 2024 15:53:18 GMT"},{"version":"v3","created":"Mon, 3 Feb 2025 03:59:00 GMT"}],"updateDate":"2025-02-04","timestamp":1733757456000,"abstract":"  The use of large language models (LLMs) for qualitative analysis is gaining\nattention in various fields, including software engineering, where qualitative\nmethods are essential for understanding human and social factors. This study\naimed to investigate how LLMs are currently used in qualitative analysis and\ntheir potential applications in software engineering research, focusing on the\nbenefits, limitations, and practices associated with their use. A systematic\nmapping study was conducted, analyzing 21 relevant studies to explore reported\nuses of LLMs for qualitative analysis. The findings indicate that LLMs are\nprimarily used for tasks such as coding, thematic analysis, and data\ncategorization, offering benefits like increased efficiency and support for new\nresearchers. However, limitations such as output variability, challenges in\ncapturing nuanced perspectives, and ethical concerns related to privacy and\ntransparency were also identified. The study emphasizes the need for structured\nstrategies and guidelines to optimize LLM use in qualitative research within\nsoftware engineering, enhancing their effectiveness while addressing ethical\nconsiderations. While LLMs show promise in supporting qualitative analysis,\nhuman expertise remains crucial for interpreting data, and ongoing exploration\nof best practices will be vital for their successful integration into empirical\nsoftware engineering research.\n","subjects":["Computer Science/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"lcGpkbU3TxZAUUl1wS25JEkmFvNmy6tW_TFrZzbOCJg","pdfSize":"129289"}