{"id":"2412.08244","title":"Call to Protect the Dark and Quiet Sky from Harmful Interference by\n  Satellite Constellations","authors":"IAU Centre for the Protection of the Dark and Quiet Sky from Satellite\n  Constellation Interference (CPS), Gyula I. G. J\\'ozsa, Andrew Williams,\n  Richard Green, Isabel Marsh, John Antoniadis, Domingos Barbosa, John\n  Barentine, Guillermo Blanc, Aaron Boley, Bruno Coelho, Patricia Cooper, Sara\n  Dalledonne, Federico Di Vruno, Joe Diamond, Adam Dong, Ronald Drimmel,\n  Siegfried Eggl, Nusrin Habeeb, Jessica Heim, Chris Hofer, Narae Hwang,\n  Mathieu Isidro, David Koplow, James Lowenthal, Sara Lucatello, Mariya\n  Lyubenova, Robert Massey, Mike Peel, Meredith Rawls, Adrien Saada, Alejandro\n  Sanchez, Pedro Sanhueza, Warren Skidmore, Boris Sorokin, P. Sreekumar, Tim\n  Stevenson, Paula Tartari, Vincenza Tornatore, Connie Walker, Benjamin Winkel,\n  Yana Yakushina","authorsParsed":[["Dark","IAU Centre for the Protection of the","","CPS"],["Interference","Quiet Sky from Satellite Constellation","","CPS"],["Józsa","Gyula I. G.",""],["Williams","Andrew",""],["Green","Richard",""],["Marsh","Isabel",""],["Antoniadis","John",""],["Barbosa","Domingos",""],["Barentine","John",""],["Blanc","Guillermo",""],["Boley","Aaron",""],["Coelho","Bruno",""],["Cooper","Patricia",""],["Dalledonne","Sara",""],["Di Vruno","Federico",""],["Diamond","Joe",""],["Dong","Adam",""],["Drimmel","Ronald",""],["Eggl","Siegfried",""],["Habeeb","Nusrin",""],["Heim","Jessica",""],["Hofer","Chris",""],["Hwang","Narae",""],["Isidro","Mathieu",""],["Koplow","David",""],["Lowenthal","James",""],["Lucatello","Sara",""],["Lyubenova","Mariya",""],["Massey","Robert",""],["Peel","Mike",""],["Rawls","Meredith",""],["Saada","Adrien",""],["Sanchez","Alejandro",""],["Sanhueza","Pedro",""],["Skidmore","Warren",""],["Sorokin","Boris",""],["Sreekumar","P.",""],["Stevenson","Tim",""],["Tartari","Paula",""],["Tornatore","Vincenza",""],["Walker","Connie",""],["Winkel","Benjamin",""],["Yakushina","Yana",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 09:53:41 GMT"},{"version":"v2","created":"Thu, 13 Feb 2025 15:33:56 GMT"}],"updateDate":"2025-02-14","timestamp":1733910821000,"abstract":"  The growing number of satellite constellations in low Earth orbit (LEO)\nenhances global communications and Earth observation, and support of space\ncommerce is a high priority of many governments. At the same time, the\nproliferation of satellites in LEO has negative effects on astronomical\nobservations and research, and the preservation of the dark and quiet sky.\nThese satellite constellations reflect sunlight onto optical telescopes, and\ntheir radio emission impacts radio observatories, jeopardising our access to\nessential scientific discoveries through astronomy. The changing visual\nappearance of the sky also impacts our cultural heritage and environment. Both\nground-based observatories and space-based telescopes in LEO are affected, and\nthere are no places on Earth that can escape the effects of satellite\nconstellations given their global nature. The minimally disturbed dark and\nradio-quiet sky is crucial for conducting fundamental research in astronomy and\nimportant public services such as planetary defence, technology development,\nand high-precision geolocation. Some aspects of satellite deployment and\noperation are regulated by States and intergovernmental organisations. While\nregulatory agencies in some States have started to require operators to\ncoordinate with their national astronomy agencies over impacts, mitigation of\nthe impact of space objects on astronomical activities is not sufficiently\nregulated. To address this issue, the CPS urges States and the international\ncommunity to take steps to protect the dark and quiet sky as specified in this\npaper.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"lo5zaTdP9GuENUTYaLddheSdKamexToP4lo2wMnbgV4","pdfSize":"46663774"}