{
  "id": "2412.14977",
  "title": "6GENABLERS-DLT: DLT-based Marketplace for Decentralized Trading of 6G\n  Telco resources",
  "authors": "Adriana Fern\\'andez-Fern\\'andez, Angel Martin, Guillermo Gomez",
  "authorsParsed": [
    [
      "Fernández-Fernández",
      "Adriana",
      ""
    ],
    [
      "Martin",
      "Angel",
      ""
    ],
    [
      "Gomez",
      "Guillermo",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 15:51:58 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734623518000,
  "abstract": "  The 6GENABLERS-DLT project addresses critical challenges in fostering\nmulti-party collaboration within dynamic 6G environments. As operators and\nservice providers increasingly depend on third-party resources to meet their\ncontractual and operational needs, the project introduces an innovative,\nDistributed Ledger Technology (DLT)-anchored Marketplace designed to streamline\ndecentralized telco resource trading. This 6GENABLERS Marketplace serves as a\ncollaborative platform where operators, resource providers, and service\nproviders can seamlessly discover, advertise, and trade telco assets within a\ntransparent, secure, and efficient permissioned environment. Distinguished from\npublic DLT-Blockchain solutions, the Marketplace's permissioned nature ensures\nrobust governance, privacy, and control, making it particularly suited to\nenterprise and consortium-based use cases in the Information and Communication\nTechnology (ICT) sector. The adoption of a decentralized architecture\neliminates reliance on a central operator, thereby mitigating risks associated\nwith single points of failure and enhancing system trustworthiness, resilience,\nand fault tolerance. The Marketplace encompasses a wide range of resources\nintegral to 6G networks, including virtualized mobile core components, Radio\nAccess Network (RAN) assets, edge and cloud infrastructure, and vertical\napplications tailored to specific industry needs. This diversity enables\nstakeholders to dynamically access and scale resources, fostering operational\nefficiency and innovation across 6G ecosystems. Through the 6GENABLERS-DLT\nproject, the vision of a collaborative, resource-rich 6G environment becomes a\nreality, laying the foundation for a next-generation telco ecosystem where\ndecentralization empowers stakeholders to meet the demands of an\ninterconnected, flexible, and scalable future.\n",
  "subjects": [
    "Computer Science/Networking and Internet Architecture"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "UjGUws587gBJn6kNQojvR3R6SQwU-UpEMXNypqGcam4",
  "pdfSize": "2463757"
}