{"id":"2412.05763","title":"Simultaneous Reconstruction of Spatial Frequency Fields and Sample\n  Locations via Bayesian Semi-Modular Inference","authors":"Chris U. Carmona, Ross A. Haines, Max Anderson Loake, Michael Benskin,\n  Geoff K. Nicholls","authorsParsed":[["Carmona","Chris U.",""],["Haines","Ross A.",""],["Loake","Max Anderson",""],["Benskin","Michael",""],["Nicholls","Geoff K.",""]],"versions":[{"version":"v1","created":"Sat, 7 Dec 2024 23:35:28 GMT"}],"updateDate":"2024-12-10","timestamp":1733614528000,"abstract":"  Traditional methods for spatial inference estimate smooth interpolating\nfields based on features measured at well-located points. When the spatial\nlocations of some observations are missing, joint inference of the fields and\nlocations is possible as the fields inform the locations and vice versa. If the\nnumber of missing locations is large, conventional Bayesian Inference fails if\nthe generative model for the data is even slightly mis-specified, due to\nfeedback between estimated fields and the imputed locations. Semi-Modular\nInference (SMI) offers a solution by controlling the feedback between different\nmodular components of the joint model using a hyper-parameter called the\ninfluence parameter. Our work is motivated by linguistic studies on a large\ncorpus of late-medieval English textual dialects. We simultaneously learn\ndialect fields using dialect features observed in ``anchor texts'' with known\nlocation and estimate the location of origin for ``floating'' textual dialects\nof unknown origin. The optimal influence parameter minimises a loss measuring\nthe accuracy of held-out anchor data. We compute a (flow-based) variational\napproximation to the SMI posterior for our model. This allows efficient\ncomputation of the optimal influence. MCMC-based approaches, feasible on small\nsubsets of the data, are used to check the variational approximation.\n","subjects":["Statistics/Applications"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"hzc02W9AROmGEj8wKTNS7ZNlJK4zgKLvOh6HeX0IDjE","pdfSize":"10023085"}