{"id":"2412.19790","title":"Bottom-up robust modeling for the foraging behavior of Physarum\n  polycephalum","authors":"Damiano Reginato, Daniele Proverbio, Giulia Giordano","authorsParsed":[["Reginato","Damiano",""],["Proverbio","Daniele",""],["Giordano","Giulia",""]],"versions":[{"version":"v1","created":"Fri, 27 Dec 2024 18:44:14 GMT"}],"updateDate":"2024-12-30","timestamp":1735325054000,"abstract":"  The true slime mold \\textit{Physarum polycephalum} has the remarkable\ncapability to perform self-organized activities such as network formation among\nfood sources. Despite well reproducing the emergence of slime networks,\nexisting models are limited in the investigation of the minimal mechanisms, at\nthe microscopic scale, that ensure robust problem-solving capabilities at the\nmacroscopic scale. To this end, we develop three progressively more complex\nmulti-agent models to provide a flexible framework to understand the\nself-organized foraging and network formation behaviors of \\textit{Physarum}.\nThe hierarchy of models allows for a stepwise investigation of the minimal set\nof rules that allow bio-inspired computing agents to achieve the desired\nbehaviors on nutrient-poor substrates. By introducing a quantitative measure of\nconnectedness among food sources, we assess the sensitivity of the model to\nuser-defined and bio-inspired parameters, as well as the robustness of the\nmodel to parameter heterogeneity across agents. We ultimately observe the\nrobust emergence of pattern formation, in line with experimental evidence.\nOverall, our study sheds light onto the basic mechanisms of self-organization\nand paves the way towards the development of decentralized strategies for\nnetwork formation in engineered systems, focusing on trade-offs between\nbiological fidelity and computational efficiency.\n","subjects":["Quantitative Biology/Populations and Evolution"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"nyT-vL3PhPXzFJ5Tm-aCpDIwk5rOIPMZJgcL9d4VSmg","pdfSize":"4565307"}