{"id":"2412.13897","title":"Data-Efficient Inference of Neural Fluid Fields via SciML Foundation\n  Model","authors":"Yuqiu Liu, Jingxuan Xu, Mauricio Soroco, Yunchao Wei, Wuyang Chen","authorsParsed":[["Liu","Yuqiu",""],["Xu","Jingxuan",""],["Soroco","Mauricio",""],["Wei","Yunchao",""],["Chen","Wuyang",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 14:39:43 GMT"}],"updateDate":"2024-12-19","timestamp":1734532783000,"abstract":"  Recent developments in 3D vision have enabled successful progress in\ninferring neural fluid fields and realistic rendering of fluid dynamics.\nHowever, these methods require real-world flow captures, which demand dense\nvideo sequences and specialized lab setups, making the process costly and\nchallenging. Scientific machine learning (SciML) foundation models, which are\npretrained on extensive simulations of partial differential equations (PDEs),\nencode rich multiphysics knowledge and thus provide promising sources of domain\npriors for inferring fluid fields. Nevertheless, their potential to advance\nreal-world vision problems remains largely underexplored, raising questions\nabout the transferability and practical utility of these foundation models. In\nthis work, we demonstrate that SciML foundation model can significantly improve\nthe data efficiency of inferring real-world 3D fluid dynamics with improved\ngeneralization. At the core of our method is leveraging the strong forecasting\ncapabilities and meaningful representations of SciML foundation models. We\nequip neural fluid fields with a novel collaborative training approach that\nutilizes augmented views and fluid features extracted by our foundation model.\nOur method demonstrates significant improvements in both quantitative metrics\nand visual quality, showcasing the practical applicability of SciML foundation\nmodels in real-world fluid dynamics.\n","subjects":["Computer Science/Machine Learning","Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"2FC33KCJopR09_zAJH2D5M8tB4DJUQWxvvJKRo5xEZo","pdfSize":"3717294"}