{
  "id": "2412.04665",
  "title": "ProPLIKS: Probablistic 3D human body pose estimation",
  "authors": "Karthik Shetty, Annette Birkhold, Bernhard Egger, Srikrishna\n  Jaganathan, Norbert Strobel, Markus Kowarschik, Andreas Maier",
  "authorsParsed": [
    [
      "Shetty",
      "Karthik",
      ""
    ],
    [
      "Birkhold",
      "Annette",
      ""
    ],
    [
      "Egger",
      "Bernhard",
      ""
    ],
    [
      "Jaganathan",
      "Srikrishna",
      ""
    ],
    [
      "Strobel",
      "Norbert",
      ""
    ],
    [
      "Kowarschik",
      "Markus",
      ""
    ],
    [
      "Maier",
      "Andreas",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 23:21:05 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733440865000,
  "abstract": "  We present a novel approach for 3D human pose estimation by employing\nprobabilistic modeling. This approach leverages the advantages of normalizing\nflows in non-Euclidean geometries to address uncertain poses. Specifically, our\nmethod employs normalizing flow tailored to the SO(3) rotational group,\nincorporating a coupling mechanism based on the M\\\"obius transformation. This\nenables the framework to accurately represent any distribution on SO(3),\neffectively addressing issues related to discontinuities. Additionally, we\nreinterpret the challenge of reconstructing 3D human figures from 2D\npixel-aligned inputs as the task of mapping these inputs to a range of probable\nposes. This perspective acknowledges the intrinsic ambiguity of the task and\nfacilitates a straightforward integration method for multi-view scenarios. The\ncombination of these strategies showcases the effectiveness of probabilistic\nmodels in complex scenarios for human pose estimation techniques. Our approach\nnotably surpasses existing methods in the field of pose estimation. We also\nvalidate our methodology on human pose estimation from RGB images as well as\nmedical X-Ray datasets.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "5xOBD0MOW6oGqFuoJBQSyOx1BYY3j7vZ29B3fRbbHz8",
  "pdfSize": "9572775"
}