{
  "id": "2412.12230",
  "title": "The impact of AI on engineering design procedures for dynamical systems",
  "authors": "Kristin M. de Payrebrune, Kathrin Fla{\\ss}kamp, Tom Str\\\"ohla, Thomas\n  Sattel, Dieter Bestle, Benedict R\\\"oder, Peter Eberhard, Sebastian Peitz,\n  Marcus Stoffel, Gulakala Rutwik, Borse Aditya, Meike Wohlleben, Walter\n  Sextro, Maximilian Raff, C. David Remy, Manish Yadav, Merten Stender, Jan van\n  Delden, Timo L\\\"uddecke, Sabine C.Langer, Julius Schultz, Christopher Blech",
  "authorsParsed": [
    [
      "de Payrebrune",
      "Kristin M.",
      ""
    ],
    [
      "Flaßkamp",
      "Kathrin",
      ""
    ],
    [
      "Ströhla",
      "Tom",
      ""
    ],
    [
      "Sattel",
      "Thomas",
      ""
    ],
    [
      "Bestle",
      "Dieter",
      ""
    ],
    [
      "Röder",
      "Benedict",
      ""
    ],
    [
      "Eberhard",
      "Peter",
      ""
    ],
    [
      "Peitz",
      "Sebastian",
      ""
    ],
    [
      "Stoffel",
      "Marcus",
      ""
    ],
    [
      "Rutwik",
      "Gulakala",
      ""
    ],
    [
      "Aditya",
      "Borse",
      ""
    ],
    [
      "Wohlleben",
      "Meike",
      ""
    ],
    [
      "Sextro",
      "Walter",
      ""
    ],
    [
      "Raff",
      "Maximilian",
      ""
    ],
    [
      "Remy",
      "C. David",
      ""
    ],
    [
      "Yadav",
      "Manish",
      ""
    ],
    [
      "Stender",
      "Merten",
      ""
    ],
    [
      "van Delden",
      "Jan",
      ""
    ],
    [
      "Lüddecke",
      "Timo",
      ""
    ],
    [
      "Langer",
      "Sabine C.",
      ""
    ],
    [
      "Schultz",
      "Julius",
      ""
    ],
    [
      "Blech",
      "Christopher",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 14:26:27 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734359187000,
  "abstract": "  Artificial intelligence (AI) is driving transformative changes across\nnumerous fields, revolutionizing conventional processes and creating new\nopportunities for innovation. The development of mechatronic systems is\nundergoing a similar transformation. Over the past decade, modeling,\nsimulation, and optimization techniques have become integral to the design\nprocess, paving the way for the adoption of AI-based methods. In this paper, we\nexamine the potential for integrating AI into the engineering design process,\nusing the V-model from the VDI guideline 2206, considered the state-of-the-art\nin product design, as a foundation. We identify and classify AI methods based\non their suitability for specific stages within the engineering product design\nworkflow. Furthermore, we present a series of application examples where\nAI-assisted design has been successfully implemented by the authors. These\nexamples, drawn from research projects within the DFG Priority Program\n\\emph{SPP~2353: Daring More Intelligence - Design Assistants in Mechanics and\nDynamics}, showcase a diverse range of applications across mechanics and\nmechatronics, including areas such as acoustics and robotics.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Systems and Control",
    "Computer Science/Machine Learning",
    "Computer Science/Systems and Control"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Ovr7IiDvKnqTy9OQdfnmS_UcYgjIYJR3vcMx1rbPozc",
  "pdfSize": "7165021"
}