{
  "id": "2412.02121",
  "title": "Rethinking Self-Supervised Learning Within the Framework of Partial\n  Information Decomposition",
  "authors": "Salman Mohamadi, Gianfranco Doretto, Donald A. Adjeroh",
  "authorsParsed": [
    [
      "Mohamadi",
      "Salman",
      ""
    ],
    [
      "Doretto",
      "Gianfranco",
      ""
    ],
    [
      "Adjeroh",
      "Donald A.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 03:20:12 GMT"
    }
  ],
  "updateDate": "2024-12-04",
  "timestamp": 1733196012000,
  "abstract": "  Self Supervised learning (SSL) has demonstrated its effectiveness in feature\nlearning from unlabeled data. Regarding this success, there have been some\narguments on the role that mutual information plays within the SSL framework.\nSome works argued for increasing mutual information between representation of\naugmented views. Others suggest decreasing mutual information between them,\nwhile increasing task-relevant information. We ponder upon this debate and\npropose to revisit the core idea of SSL within the framework of partial\ninformation decomposition (PID). Thus, with SSL under PID we propose to replace\ntraditional mutual information with the more general concept of joint mutual\ninformation to resolve the argument. Our investigation on instantiation of SSL\nwithin the PID framework leads to upgrading the existing pipelines by\nconsidering the components of the PID in the SSL models for improved\nrepresentation learning. Accordingly we propose a general pipeline that can be\napplied to improve existing baselines. Our pipeline focuses on extracting the\nunique information component under the PID to build upon lower level\nsupervision for generic feature learning and on developing higher-level\nsupervisory signals for task-related feature learning. In essence, this could\nbe interpreted as a joint utilization of local and global clustering.\nExperiments on four baselines and four datasets show the effectiveness and\ngenerality of our approach in improving existing SSL frameworks.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "KX7ODI9Q6RlPzlzbbbXuxxX_C40swbqZDSPF976DtVI",
  "pdfSize": "427865"
}