{"id":"2412.05094","title":"Asteroseismic Structure Inversions of Main-Sequence Solar-like\n  Oscillators with Convective Cores","authors":"Lynn Buchele (1 and 2), Earl P. Bellinger (3), Saskia Hekker (1 and\n  2), Sarbani Basu (3) ((1) Heidelberg Institute for Theoretical Studies, (2)\n  Heidelberg University, (3) Yale University)","authorsParsed":[["Buchele","Lynn","","1 and 2"],["Bellinger","Earl P.","","1 and\n  2"],["Hekker","Saskia","","1 and\n  2"],["Basu","Sarbani",""]],"versions":[{"version":"v1","created":"Fri, 6 Dec 2024 14:50:28 GMT"}],"updateDate":"2024-12-09","timestamp":1733496628000,"abstract":"  Asteroseismic inferences of main-sequence solar-like oscillators often rely\non best-fit models. However, these models cannot fully reproduce the observed\nmode frequencies, suggesting that the internal structure of the model does not\nfully match that of the star. Asteroseismic structure inversions provide a way\nto test the interior of our stellar models. Recently, structure inversion\ntechniques were used to study 12 stars with radiative cores. In this work, we\nextend that analysis to 43 main-sequence stars with convective cores observed\nby Kepler to look for differences in the sound speed profiles in the inner 30%\nof the star by radius. For around half of our stars, the structure inversions\nshow that our models reproduce the internal structure of the star, where the\ninversions are sensitive, within the observational uncertainties. For the stars\nwhere our inversions reveal significant differences, we find cases where our\nmodel sound speed is too high and cases where our model sound speed is too low.\nWe use the star with the most significant differences to explore several\nchanges to the physics of our model in an attempt to resolve the inferred\ndifferences. These changes include using a different overshoot prescription and\nincluding the effects of diffusion, gravitational settling, and radiative\nlevitation. We find that the resulting changes to the model structure are too\nsmall to resolve the differences shown in our inversions.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"-5X5Kz5ejc7mbnigkLac79QJL8Jo7agh69mdTBoo5nI","pdfSize":"1133598"}