{"id":"2412.04088","title":"A Spectrophotometric analysis and dust properties of classical nova\n  V5584 Sgr","authors":"Mohit Singh Bisht, A. Raj, F.M. Walter, D. Bisht, Gargi Shaw, K.\n  Belwal, S. Biswas","authorsParsed":[["Bisht","Mohit Singh",""],["Raj","A.",""],["Walter","F. M.",""],["Bisht","D.",""],["Shaw","Gargi",""],["Belwal","K.",""],["Biswas","S.",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 11:49:54 GMT"}],"updateDate":"2024-12-06","timestamp":1733399394000,"abstract":"  In this work, optical observations of the nova V5584 Sgr are presented. These\nobservations cover different phases including pre-maximum, early decline, and\nnebular. The spectra are dominated by hydrogen Balmer, Fe II, and O I lines\nwith P-Cygni profiles in the early phase, which are subsequently observed in\ncomplete emission. The presence of numerous Fe II lines and low ejecta velocity\naligns with the Fe II type nova classification. From optical and NIR colors it\nis clear that this nova manifests dust formation in the ejecta. The dust\ntemperature and mass were estimated from a spectral energy distribution (SED)\nfit to the JHK band magnitudes and the WISE data. Light curve analysis shows\nt$_2$ and t$_3$ values of $\\sim$ 26 and $\\sim$ 48 days, classifying the nova as\nmoderately fast. The physical and chemical properties during early decline and\nlater phases were evaluated using the photoionization code CLOUDY. The best-fit\nmodel parameters from two epochs of multiwavelength spectra are compatible with\na hot white dwarf source with a roughly constant luminosity of $\\sim$ (2.08\n$\\pm$ 0.10) $\\times$ 10$^{36}$ erg s$^{-1}$. We find an ejected mass of $\\sim$\n(1.59 $\\pm$ 0.04) $\\times$ 10$^{-4}$M$_{\\odot}$. Abundance analysis indicates\nthat the ejecta is significantly enriched relative to solar values, with O/H =\n30.2, C/H = 10.8, He/H = 1.8, Mg/H = 1.68, Na/H = 1.55, and N/H = 45.5 in the\nearly decline phase, and O/H = 4.5, Ne/H = 1.5, and N/H = 24.5 in the nebular\nphase.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"Grff8fb9gG_z73_ybiX2BgAyKJlH6x-Nsrej7cZ2Jag","pdfSize":"864101"}