{
  "id": "2412.11890",
  "title": "SegMAN: Omni-scale Context Modeling with State Space Models and Local\n  Attention for Semantic Segmentation",
  "authors": "Yunxiang Fu, Meng Lou, Yizhou Yu",
  "authorsParsed": [
    [
      "Fu",
      "Yunxiang",
      ""
    ],
    [
      "Lou",
      "Meng",
      ""
    ],
    [
      "Yu",
      "Yizhou",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 15:38:25 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734363505000,
  "abstract": "  High-quality semantic segmentation relies on three key capabilities: global\ncontext modeling, local detail encoding, and multi-scale feature extraction.\nHowever, recent methods struggle to possess all these capabilities\nsimultaneously. Hence, we aim to empower segmentation networks to\nsimultaneously carry out efficient global context modeling, high-quality local\ndetail encoding, and rich multi-scale feature representation for varying input\nresolutions. In this paper, we introduce SegMAN, a novel linear-time model\ncomprising a hybrid feature encoder dubbed SegMAN Encoder, and a decoder based\non state space models. Specifically, the SegMAN Encoder synergistically\nintegrates sliding local attention with dynamic state space models, enabling\nhighly efficient global context modeling while preserving fine-grained local\ndetails. Meanwhile, the MMSCopE module in our decoder enhances multi-scale\ncontext feature extraction and adaptively scales with the input resolution. We\ncomprehensively evaluate SegMAN on three challenging datasets: ADE20K,\nCityscapes, and COCO-Stuff. For instance, SegMAN-B achieves 52.6% mIoU on\nADE20K, outperforming SegNeXt-L by 1.6% mIoU while reducing computational\ncomplexity by over 15% GFLOPs. On Cityscapes, SegMAN-B attains 83.8% mIoU,\nsurpassing SegFormer-B3 by 2.1% mIoU with approximately half the GFLOPs.\nSimilarly, SegMAN-B improves upon VWFormer-B3 by 1.6% mIoU with lower GFLOPs on\nthe COCO-Stuff dataset. Our code is available at\nhttps://github.com/yunxiangfu2001/SegMAN.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "WUYDt4Wx6dp9LR7PezyJyAs7spWclvHipeFr22WF8GI",
  "pdfSize": "9182376"
}