{
  "id": "2412.10448",
  "title": "Unlocking Visual Secrets: Inverting Features with Diffusion Priors for\n  Image Reconstruction",
  "authors": "Sai Qian Zhang, Ziyun Li, Chuan Guo, Saeed Mahloujifar, Deeksha\n  Dangwal, Edward Suh, Barbara De Salvo and Chiao Liu",
  "authorsParsed": [
    [
      "Zhang",
      "Sai Qian",
      ""
    ],
    [
      "Li",
      "Ziyun",
      ""
    ],
    [
      "Guo",
      "Chuan",
      ""
    ],
    [
      "Mahloujifar",
      "Saeed",
      ""
    ],
    [
      "Dangwal",
      "Deeksha",
      ""
    ],
    [
      "Suh",
      "Edward",
      ""
    ],
    [
      "De Salvo",
      "Barbara",
      ""
    ],
    [
      "Liu",
      "Chiao",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 20:24:15 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1733948655000,
  "abstract": "  Inverting visual representations within deep neural networks (DNNs) presents\na challenging and important problem in the field of security and privacy for\ndeep learning. The main goal is to invert the features of an unidentified\ntarget image generated by a pre-trained DNN, aiming to reconstruct the original\nimage. Feature inversion holds particular significance in understanding the\nprivacy leakage inherent in contemporary split DNN execution techniques, as\nwell as in various applications based on the extracted DNN features.\n  In this paper, we explore the use of diffusion models, a promising technique\nfor image synthesis, to enhance feature inversion quality. We also investigate\nthe potential of incorporating alternative forms of prior knowledge, such as\ntextual prompts and cross-frame temporal correlations, to further improve the\nquality of inverted features. Our findings reveal that diffusion models can\neffectively leverage hidden information from the DNN features, resulting in\nsuperior reconstruction performance compared to previous methods. This research\noffers valuable insights into how diffusion models can enhance privacy and\nsecurity within applications that are reliant on DNN features.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "SwMSaWH1kokzXdrfE7RJsbPg7dStrslZ18Q_QB2y4kU",
  "pdfSize": "13391210"
}