{"id":"2412.18986","title":"Investigating chemical variations between interstellar gas clouds in the\n  Solar neighbourhood","authors":"T. Ramburuth-Hurt, A. De Cia, J.-K. Krogager, C. Ledoux, E. Jenkins,\n  A. J. Fox, C. Konstantopoulou, A. Velichko, and L. Dalla Pola","authorsParsed":[["Ramburuth-Hurt","T.",""],["De Cia","A.",""],["Krogager","J. -K.",""],["Ledoux","C.",""],["Jenkins","E.",""],["Fox","A. J.",""],["Konstantopoulou","C.",""],["Velichko","A.",""],["Pola","L. Dalla",""]],"versions":[{"version":"v1","created":"Wed, 25 Dec 2024 21:47:46 GMT"},{"version":"v2","created":"Tue, 25 Feb 2025 13:59:10 GMT"}],"updateDate":"2025-02-26","timestamp":1735163266000,"abstract":"  The interstellar medium (ISM) is a fundamental component of the Milky Way.\nStudying its chemical composition and the level of its chemical diversity gives\nus insight into the evolution of the Milky Way and the role of gas in the\nGalactic environment. In this paper, we use a novel simulation technique to\nmodel the distribution of total hydrogen between gas components, and therefore\nderive new constraints on the dust depletion and metallicity. We study\nindividual gas components along the lines of sight towards eight bright O/B\nstars within 1.1 kpc of the Sun using high-resolution HST/STIS absorption\nspectra (R sim 114 000). We measure the level of dust depletion for these\nindividual components and find components with higher levels of dust depletion\ncompared to Milky Way sightlines in the literature. We find large ranges in the\nlevel of dust depletion among components along lines of sight, up to 1.19 dex.\nAlthough it is not possible to directly measure the metallicity of individual\ncomponents due to the saturated and damped Ly-alpha line, we investigate\npossible metallicity ranges for individual gas components by exploring many\ndifferent distributions of the total hydrogen gas between components. We select\npossible combinations of these gas fractions which produce the minimum\nmetallicity difference between components, and for these cases we determine\nindividual metallicities to accuracies that range between sim 0.1 to 0.4 dex.\nThis work shows that full line-of-sight analyses wash out the level of\ndiversity along lines of sight, and that component-by-component studies give a\nmore in-depth understanding of the chemical intricacies of the interstellar\nmedium.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"jHOj0GjwOSRfDQZuMZDxDkJQF7EKMSNSnOlCklCpLmo","pdfSize":"5065828"}