{
  "id": "2412.11852",
  "title": "Towards advanced forecasting of solar energetic particle events with the\n  PARASOL model",
  "authors": "Alexandr Afanasiev, Nicolas Wijsen and Rami Vainio",
  "authorsParsed": [
    [
      "Afanasiev",
      "Alexandr",
      ""
    ],
    [
      "Wijsen",
      "Nicolas",
      ""
    ],
    [
      "Vainio",
      "Rami",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 15:12:05 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734361925000,
  "abstract": "  Gradual solar energetic particle (SEP) events are generally attributed to the\nparticle acceleration in shock waves driven by coronal mass ejections (CMEs).\nSpace-weather effects of such events are important, so there has been\ncontinuous effort to develop models able to forecast their various\ncharacteristics. Here we present the first version of a new such model with the\nprimary goal to address energetic storm particle (ESP) events. The model,\nPARASOL, is built upon the PArticle Radiation Asset Directed at Interplanetary\nSpace Exploration (PARADISE) test-particle simulation model of SEP transport,\nbut includes a semi-analytical description of an inner (i.e., near the shock)\npart of the foreshock region. The semi-analytical foreshock description is\nconstructed using simulations with the SOLar Particle Acceleration in Coronal\nShocks (SOLPACS) model, which simulates proton acceleration self-consistently\ncoupled with Alfven wave generation upstream of the shock, and subsequent\nfitting of the simulation results with suitable analytical functions. PARASOL\nrequires input of solar wind and shock magnetohydrodynamic (MHD) parameters. We\nevaluate the performance of PARASOL by simulating the 12 July 2012 SEP event,\nusing the EUropean Heliospheric FORecasting Information Asset (EUHFORIA) MHD\nsimulation of the solar wind and CME in this event. The PARASOL simulation has\nreproduced the observed ESP event ($E \\lesssim 5$ MeV) in the close vicinity of\nthe shock within one order of magnitude in intensity.\n",
  "subjects": [
    "Astrophysics/Solar and Stellar Astrophysics",
    "Physics/Space Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "WBBySutUozY-HuYWqJLSfifLUH08aICVPwsK3ubpB4A",
  "pdfSize": "3143899"
}