{"id":"2412.14518","title":"Efficient Self-Supervised Video Hashing with Selective State Spaces","authors":"Jinpeng Wang, Niu Lian, Jun Li, Yuting Wang, Yan Feng, Bin Chen,\n  Yongbing Zhang, Shu-Tao Xia","authorsParsed":[["Wang","Jinpeng",""],["Lian","Niu",""],["Li","Jun",""],["Wang","Yuting",""],["Feng","Yan",""],["Chen","Bin",""],["Zhang","Yongbing",""],["Xia","Shu-Tao",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 04:33:22 GMT"}],"updateDate":"2024-12-20","timestamp":1734582802000,"abstract":"  Self-supervised video hashing (SSVH) is a practical task in video indexing\nand retrieval. Although Transformers are predominant in SSVH for their\nimpressive temporal modeling capabilities, they often suffer from computational\nand memory inefficiencies. Drawing inspiration from Mamba, an advanced\nstate-space model, we explore its potential in SSVH to achieve a better balance\nbetween efficacy and efficiency. We introduce S5VH, a Mamba-based video hashing\nmodel with an improved self-supervised learning paradigm. Specifically, we\ndesign bidirectional Mamba layers for both the encoder and decoder, which are\neffective and efficient in capturing temporal relationships thanks to the\ndata-dependent selective scanning mechanism with linear complexity. In our\nlearning strategy, we transform global semantics in the feature space into\nsemantically consistent and discriminative hash centers, followed by a center\nalignment loss as a global learning signal. Our self-local-global (SLG)\nparadigm significantly improves learning efficiency, leading to faster and\nbetter convergence. Extensive experiments demonstrate S5VH's improvements over\nstate-of-the-art methods, superior transferability, and scalable advantages in\ninference efficiency. Code is available at\nhttps://github.com/gimpong/AAAI25-S5VH.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Information Retrieval","Computer Science/Multimedia"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"jlkFj0-CXoSBD4eF_UDaxQqxpkKSJqRmZGRMDfyfGBo","pdfSize":"1930157"}