{
  "id": "2412.08505",
  "title": "Open-Loop and Model Predictive Control for Electric Vehicle Charging to\n  Manage Excess Renewable Energy Supply in Texas",
  "authors": "Kelsey M. Nelson, Maureen S. Golan, Matthew D. Bartos, Javad Mohammadi",
  "authorsParsed": [
    [
      "Nelson",
      "Kelsey M.",
      ""
    ],
    [
      "Golan",
      "Maureen S.",
      ""
    ],
    [
      "Bartos",
      "Matthew D.",
      ""
    ],
    [
      "Mohammadi",
      "Javad",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 16:16:06 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733933766000,
  "abstract": "  Modern power grids are evolving to become more interconnected, include more\nelectric vehicles (EVs), and utilize more renewable energy sources (RES).\nIncreased interconnectivity provides an opportunity to manage EVs and RES by\nusing price signaling to shift EV loads towards periods of high RES output.\nThis work uses ERCOT's 2035 RES installation plans and projections for Texas's\nEV fleet to examine and compare how both open-loop control and model predictive\ncontrol (MPC) schemes can leverage time varying rates for EV charging to\nutilize excess RES supply that may otherwise be underutilized in a highly\nweather-dependent grid. The results show that while open-loop control increases\nRES usage, MPC increases RES usage even further by responding to RES outputs\nthat differ from forecasts due to the inherent uncertainty of weather\npredictions. If MPC is used with time steps that are too frequent, however,\ndifficulties arise; EV owners may find it too onerous to keep up with changing\nprice structures, and frequent over-corrections to charging profiles can lead\nto a ``rebound peak\" phenomenon. Therefore, control schemes should balance\nmaximizing RES usage with ensuring customer participation.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Systems and Control",
    "Computer Science/Systems and Control"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "bXN10qYRAM_T9NRXsJxFiE4Md4YTexMGVijhoSQ_SgY",
  "pdfSize": "851069"
}