{
  "id": "2412.15347",
  "title": "Exploring Machine Learning Engineering for Object Detection and Tracking\n  by Unmanned Aerial Vehicle (UAV)",
  "authors": "Aneesha Guna, Parth Ganeriwala, Siddhartha Bhattacharyya",
  "authorsParsed": [
    [
      "Guna",
      "Aneesha",
      ""
    ],
    [
      "Ganeriwala",
      "Parth",
      ""
    ],
    [
      "Bhattacharyya",
      "Siddhartha",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 19:27:31 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734636451000,
  "abstract": "  With the advancement of deep learning methods it is imperative that\nautonomous systems will increasingly become intelligent with the inclusion of\nadvanced machine learning algorithms to execute a variety of autonomous\noperations. One such task involves the design and evaluation for a subsystem of\nthe perception system for object detection and tracking. The challenge in the\ncreation of software to solve the task is in discovering the need for a\ndataset, annotation of the dataset, selection of features, integration and\nrefinement of existing algorithms, while evaluating performance metrics through\ntraining and testing. This research effort focuses on the development of a\nmachine learning pipeline emphasizing the inclusion of assurance methods with\nincreasing automation. In the process, a new dataset was created by collecting\nvideos of moving object such as Roomba vacuum cleaner, emulating search and\nrescue (SAR) for indoor environment. Individual frames were extracted from the\nvideos and labeled using a combination of manual and automated techniques. This\nannotated dataset was refined for accuracy by initially training it on YOLOv4.\nAfter the refinement of the dataset it was trained on a second YOLOv4 and a\nMask R-CNN model, which is deployed on a Parrot Mambo drone to perform\nreal-time object detection and tracking. Experimental results demonstrate the\neffectiveness of the models in accurately detecting and tracking the Roomba\nacross multiple trials, achieving an average loss of 0.1942 and 96% accuracy.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "jygwiOM6fkFT1NeA9bPi7ppjJbvZTvE7bsJl7tcdC7s",
  "pdfSize": "2895187"
}