{
  "id": "2412.16384",
  "title": "Algorithmic Contract Theory: A Survey",
  "authors": "Paul Duetting and Michal Feldman and Inbal Talgam-Cohen",
  "authorsParsed": [
    [
      "Duetting",
      "Paul",
      ""
    ],
    [
      "Feldman",
      "Michal",
      ""
    ],
    [
      "Talgam-Cohen",
      "Inbal",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 22:40:02 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734734402000,
  "abstract": "  A contract is an economic tool used by a principal to incentivize one or more\nagents to exert effort on her behalf, by defining payments based on observable\nperformance measures. A key challenge addressed by contracts -- known in\neconomics as moral hazard -- is that, absent a properly set up contract, agents\nmight engage in actions that are not in the principal's best interest. Another\ncommon feature of contracts is limited liability, which means that payments can\ngo only from the principal -- who has the deep pocket -- to the agents.\n  With classic applications of contract theory moving online, growing in scale,\nand becoming more data-driven, tools from contract theory become increasingly\nimportant for incentive-aware algorithm design. At the same time, algorithm\ndesign offers a whole new toolbox for reasoning about contracts, ranging from\nadditional tools for studying the tradeoff between simple and optimal\ncontracts, through a language for discussing the computational complexity of\ncontracts in combinatorial settings, to a formalism for analyzing data-driven\ncontracts.\n  This survey aims to provide a computer science-friendly introduction to the\nbasic concepts of contract theory. We give an overview of the emerging field of\n\"algorithmic contract theory\" and highlight work that showcases the potential\nfor interaction between the two areas. We also discuss avenues for future\nresearch.\n",
  "subjects": [
    "Computer Science/Computer Science and Game Theory",
    "Economics/Theoretical Economics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "pmrZdiotqTLnJTJx0k9BhgL_nC7K8UKYeWtLEQDV_PE",
  "pdfSize": "1724185"
}