{"id":"2412.12166","title":"Performance of a large language model-Artificial Intelligence based\n  chatbot for counseling patients with sexually transmitted infections and\n  genital diseases","authors":"Nikhil Mehta, Sithira Ambepitiya, Thanveer Ahamad, Dinuka Wijesundara,\n  Yudara Kularathne","authorsParsed":[["Mehta","Nikhil",""],["Ambepitiya","Sithira",""],["Ahamad","Thanveer",""],["Wijesundara","Dinuka",""],["Kularathne","Yudara",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 20:36:32 GMT"}],"updateDate":"2024-12-18","timestamp":1733949392000,"abstract":"  Introduction: Global burden of sexually transmitted infections (STIs) is\nrising out of proportion to specialists. Current chatbots like ChatGPT are not\ntailored for handling STI-related concerns out of the box. We developed Otiz,\nan Artificial Intelligence-based (AI-based) chatbot platform designed\nspecifically for STI detection and counseling, and assessed its performance.\nMethods: Otiz employs a multi-agent system architecture based on GPT4-0613,\nleveraging large language model (LLM) and Deterministic Finite Automaton\nprinciples to provide contextually relevant, medically accurate, and empathetic\nresponses. Its components include modules for general STI information,\nemotional recognition, Acute Stress Disorder detection, and psychotherapy. A\nquestion suggestion agent operates in parallel. Four STIs (anogenital warts,\nherpes, syphilis, urethritis/cervicitis) and 2 non-STIs (candidiasis, penile\ncancer) were evaluated using prompts mimicking patient language. Each prompt\nwas independently graded by two venereologists conversing with Otiz as patient\nactors on 6 criteria using Numerical Rating Scale ranging from 0 (poor) to 5\n(excellent). Results: Twenty-three venereologists did 60 evaluations of 30\nprompts. Across STIs, Otiz scored highly on diagnostic accuracy (4.1-4.7),\noverall accuracy (4.3-4.6), correctness of information (5.0), comprehensibility\n(4.2-4.4), and empathy (4.5-4.8). However, relevance scores were lower\n(2.9-3.6), suggesting some redundancy. Diagnostic scores for non-STIs were\nlower (p=0.038). Inter-observer agreement was strong, with differences greater\nthan 1 point occurring in only 12.7% of paired evaluations. Conclusions: AI\nconversational agents like Otiz can provide accurate, correct, discrete,\nnon-judgmental, readily accessible and easily understandable STI-related\ninformation in an empathetic manner, and can alleviate the burden on healthcare\nsystems.\n","subjects":["Computer Science/Computation and Language","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"H0fe3LaRzuZBZzv0ZnpHkhw8aMM76ZahyhrHlOEzNIg","pdfSize":"174208"}