{"id":"2412.20407","title":"Two Egyptian Kings, Shepseskaf and Userkaf, and a solar eclipse (2471\n  BC)","authors":"Amelia Carolina Sparavigna","authorsParsed":[["Sparavigna","Amelia Carolina",""]],"versions":[{"version":"v1","created":"Sun, 29 Dec 2024 09:16:02 GMT"},{"version":"v2","created":"Thu, 2 Jan 2025 12:26:43 GMT"}],"updateDate":"2025-01-03","timestamp":1735463762000,"abstract":"  Recently, arXiv published a work by G. Magli about the eclipse of 1 April\n2471 BC and a supposed influence of it on the end of the fourth Egyptian\ndynasty and the beginning of the fifth one. In Magli's arXiv/2412.13640 paper,\nthe eclipse is defined as the 'Shepseskaf eclipse'. Magli considers that this\neclipse happened during the reign of the 'last ruler of the 4th dynasty,\nShepseskaf'. Some literature is giving the name of further members of this\ndynasty. Therefore, here we add some references, besides those given in arXiv.\nWe will show that, in this literature, the same eclipse of 2471 BC is linked to\nking Userkaf of the fifth dynasty. Some observations about chronological data\nproposed by Magli are also necessary. Since in arxiv/2412.13640 paper we find\nmentioned by Magli the pyramid of Cheops (that is Akhet Khufu, a name which is\ngenerally translated as the Khufu's horizon) and the symbol of the 'solarized'\nhorizon, N27 of the Gardiner's list, it is necessary to stress that the word\nAkhet was written with the crested ibis, G25, as clearly shown by the Wadi\nal-Jarf papyri, which are contemporary to Khufu's reign. Mark Lehner, 2001,\nrecognizing a translation problem, rendered Akhet Khufu as the 'Spirit of\nKhufu'. The use of the crested ibis, in a locution translated as 'dwellers of\nthe horizon' is attested in a Pepi II letter to his vizier Herkhuf, then three\ncenturies after Khufu.\n","subjects":["Physics/History and Philosophy of Physics","Astrophysics/Solar and Stellar Astrophysics","Physics/Popular Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"hZXB8Zxb0Cae3R7N7ZxvYzi3fNRd8Bbd6gFvYZq4k7I","pdfSize":"2076664"}