{
  "id": "2412.12114",
  "title": "Unlocking new capabilities in the analysis of GC$\\times$GC-TOFMS data\n  with shift-invariant multi-linearity",
  "authors": "Paul-Albert Schneide, Michael Sorochan Armstrong, Neal Gallagher,\n  Rasmus Bro",
  "authorsParsed": [
    [
      "Schneide",
      "Paul-Albert",
      ""
    ],
    [
      "Armstrong",
      "Michael Sorochan",
      ""
    ],
    [
      "Gallagher",
      "Neal",
      ""
    ],
    [
      "Bro",
      "Rasmus",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 10:49:25 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1733136565000,
  "abstract": "  This paper introduces a novel deconvolution algorithm, shift-invariant\nmulti-linearity (SIML), which significantly enhances the analysis of data from\na comprehensive two-dimensional gas chromatograph coupled to a mass\nspectrometric detector (GC$\\times$GC-TOFMS). Designed to address the challenges\nposed by retention time shifts and high noise levels, SIML incorporates\nwavelet-based smoothing and Fourier-Transform based shift-correction within the\nmultivariate curve resolution-alternating least squares (MCR-ALS) framework. We\nbenchmarked the SIML algorithm against traditional methods such as MCR-ALS and\nParallel Factor Analysis 2 with flexible coupling (PARAFAC2$\\times$N) using\nboth simulated and real GC$\\times$GC-TOFMS datasets. Our results demonstrate\nthat SIML provides unique solutions with significantly improved robustness,\nparticularly in low signal-to-noise ratio scenarios, where it maintains high\naccuracy in estimating mass spectra and concentrations. The enhanced\nreliability of quantitative analyses afforded by SIML underscores its potential\nfor broad application in complex matrix analyses across environmental science,\nfood chemistry, and biological research.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Signal Processing",
    "Statistics/Methodology"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "dX7s9NL8nBdv4S4viBu1kgUTfoNY6qgG2U30Utelq7o",
  "pdfSize": "6980815"
}