{"id":"2412.17115","title":"Sparsest cut and eigenvalue multiplicities on low degree Abelian Cayley\n  graphs","authors":"Tommaso d'Orsi, Chris Jones, Jake Ruotolo, Salil Vadhan, Jiyu Zhang","authorsParsed":[["d'Orsi","Tommaso",""],["Jones","Chris",""],["Ruotolo","Jake",""],["Vadhan","Salil",""],["Zhang","Jiyu",""]],"versions":[{"version":"v1","created":"Sun, 22 Dec 2024 18:02:25 GMT"}],"updateDate":"2024-12-24","timestamp":1734890545000,"abstract":"  Whether or not the Sparsest Cut problem admits an efficient\n$O(1)$-approximation algorithm is a fundamental algorithmic question with\nconnections to geometry and the Unique Games Conjecture. We design an\n$O(1)$-approximation algorithm to Sparsest Cut for the class of Cayley graphs\nover Abelian groups, running in time $n^{O(1)}\\cdot \\exp\\{d^{O(d)}\\}$ where $d$\nis the degree of the graph.\n  Previous work has centered on solving cut problems on graphs which are\n``expander-like'' in various senses, such as being a small-set expander or\nhaving low threshold rank.\n  In contrast, low-degree Abelian Cayley graphs are natural examples of\nnon-expanding graphs far from these assumptions (e.g. the cycle). We\ndemonstrate that spectral and semidefinite programming-based methods can still\nsucceed in these graphs by analyzing an eigenspace enumeration algorithm which\nsearches for a sparse cut among the low eigenspace of the Laplacian matrix. We\ndually interpret this algorithm as searching for a hyperplane cut in a\nlow-dimensional embedding of the graph.\n  In order to analyze the algorithm, we prove a bound of $d^{O(d)}$ on the\nnumber of eigenvalues ``near'' $\\lambda_2$ for connected degree-$d$ Abelian\nCayley graphs. We obtain a tight bound of $2^{\\Theta(d)}$ on the multiplicity\nof $\\lambda_2$ itself which improves on a previous bound of $2^{O(d^2)}$ by Lee\nand Makarychev.\n","subjects":["Computer Science/Data Structures and Algorithms","Computer Science/Discrete Mathematics","Mathematics/Combinatorics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"sOmqW_tCab8ZYijUtS68Mqow-70nM6-rq5nvzLpdz7o","pdfSize":"673649"}