{
  "id": "2412.15088",
  "title": "Coherent spin-1 dynamics encoded in the rotational states of ultracold\n  molecules",
  "authors": "Tom R. Hepworth, Daniel K. Ruttley, Fritz von Gierke, Philip D.\n  Gregory, Alexander Guttridge, Simon L. Cornish",
  "authorsParsed": [
    [
      "Hepworth",
      "Tom R.",
      ""
    ],
    [
      "Ruttley",
      "Daniel K.",
      ""
    ],
    [
      "von Gierke",
      "Fritz",
      ""
    ],
    [
      "Gregory",
      "Philip D.",
      ""
    ],
    [
      "Guttridge",
      "Alexander",
      ""
    ],
    [
      "Cornish",
      "Simon L.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 17:35:57 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734629757000,
  "abstract": "  The rotational states of ultracold polar molecules possess long radiative\nlifetimes, microwave-domain coupling, and tunable dipolar interactions.\nCoherent dynamics between pairs of rotational states have been used to\ndemonstrate simple models of quantum magnetism and to manipulate quantum\ninformation stored as qubits. The availability of numerous rotational states\nhas led to many proposals to implement more complicated models of quantum\nmagnetism, higher-dimensional qudits, and intricate state networks as synthetic\ndimensions; however, these are yet to be experimentally realised. The primary\nissue limiting their implementation is the detrimental effect of the optical\ntrapping environment on coherence, which is not easily mitigated for systems\nbeyond two levels. To address this challenge, we investigate the applicability\nof magic-wavelength optical tweezer traps to facilitate multitransition\ncoherence between rotational states. We demonstrate simultaneous second-scale\ncoherence between three rotational states. Utilising this extended coherence,\nwe perform multiparameter estimation using a generalised Ramsey sequence and\ndemonstrate coherent spin-1 dynamics encoded in the rotational states. Our work\npaves the way to implementing proposed quantum simulation, computation, and\nmetrology schemes that exploit the rich rotational structure of ultracold polar\nmolecules.\n",
  "subjects": [
    "Physics/Atomic Physics",
    "Condensed Matter/Quantum Gases",
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "GQhb7pdEDsMjfvjyCjQ50UxbCMkHn9KFmlgqLWQ0sNg",
  "pdfSize": "1571400"
}