{"id":"2412.01730","title":"The Globular Cluster System of the Virgo Cluster Ultradiffuse Galaxy VCC\n  615","authors":"J. Christopher Mihos, Patrick R. Durrell, Elisa Toloba, Eric W. Peng,\n  Sungsoon Lim, Patrick C\\^ot\\'e, Puragra Guhathakurta, Laura Ferrarese","authorsParsed":[["Mihos","J. Christopher",""],["Durrell","Patrick R.",""],["Toloba","Elisa",""],["Peng","Eric W.",""],["Lim","Sungsoon",""],["Côté","Patrick",""],["Guhathakurta","Puragra",""],["Ferrarese","Laura",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 17:20:11 GMT"}],"updateDate":"2024-12-03","timestamp":1733160011000,"abstract":"  We use Hubble Space Telescope imaging to study the globular cluster system of\nthe Virgo Cluster ultradiffuse galaxy (UDG) VCC 615. We select globular cluster\ncandidates through a combination of size and color, while simultaneously\nrejecting contamination from background galaxies that would be unresolved in\nground-based imaging. Our sample of globular cluster candidates is essentially\ncomplete down to a limiting magnitude of F814W=24.0, approximately 90% down the\nglobular cluster luminosity function. We estimate a total globular cluster\npopulation for VCC 615 of $N_{\\rm GC}=25.1^{+6.5}_{-5.4}$, resulting in a\nspecific frequency of $S_N=55.5^{+14.5}_{-12.0}$, quite high compared to normal\ngalaxies of similar luminosity, but consistent with the large specific\nfrequencies found in some other UDGs. The abundant cluster population suggests\nthe galaxy is enshrouded by a massive dark halo, consistent with previous\ndynamical mass estimates using globular cluster kinematics. While the peak of\nthe globular cluster luminosity function appears slightly brighter than\nexpected (by approximately 0.3-0.5 mag), this difference is comparable to the\n0.3 mag uncertainty in the measurement, and we see no sign of an extremely\nluminous population of clusters similar to those detected in the UDGs\nNGC1054-DF2 and -DF4. However, we do find a relatively high fraction\n($32^{+5}_{-4}$%) of large clusters with half-light radii greater than 9 pc.\nThe galaxy's offset nucleus appears photometrically distinct from the globular\nclusters, and is more akin to ultracompact dwarfs (UCDs) in Virgo. Over time,\nVCC 615's already diffuse stellar body may be further stripped by cluster\ntides, leaving the nucleus intact to form a new Virgo UCD.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"yNlEyKrR4q5mAvU_ipKCQVC7-dwUUOSZ3V9eoi8r3jQ","pdfSize":"1361393"}