{
  "id": "2412.01211",
  "title": "Magnetorotons in Moir\\'e Fractional Chern Insulators",
  "authors": "Xiaoyang Shen, Chonghao Wang, Xiaodong Hu, Ruiping Guo, Hong Yao,\n  Chong Wang, Wenhui Duan, Yong Xu",
  "authorsParsed": [
    [
      "Shen",
      "Xiaoyang",
      ""
    ],
    [
      "Wang",
      "Chonghao",
      ""
    ],
    [
      "Hu",
      "Xiaodong",
      ""
    ],
    [
      "Guo",
      "Ruiping",
      ""
    ],
    [
      "Yao",
      "Hong",
      ""
    ],
    [
      "Wang",
      "Chong",
      ""
    ],
    [
      "Duan",
      "Wenhui",
      ""
    ],
    [
      "Xu",
      "Yong",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 07:29:51 GMT"
    },
    {
      "version": "v2",
      "created": "Fri, 21 Feb 2025 07:21:08 GMT"
    }
  ],
  "updateDate": "2025-02-24",
  "timestamp": 1733124591000,
  "abstract": "  The discovery of fractional Chern insulators (FCIs) unlocks exciting\nopportunities to explore emergent physical excitations arising from topological\nand geometric effects in novel phases of quantum matter. Here we investigate\nthe intraband neutral excitations, namely magnetorotons, in moir\\'e FCIs within\ntwisted $\\rm{MoTe}_2$ by applying the Girvin, MacDonald, and Platzman (GMP)\nansatz together with the method of dynamical geometric response. We reveal the\nuniversal existence of the finite-momentum magnetorotons in moir\\'e FCIs and\npredict their characteristic scales. Furthermore, we explore the geometric\nnature of magnetorotons in the long-wavelength limit, identifying their gapped\nchiral nature with angular momentum-2, which originates from the momentum-space\nincompressibility of FCIs. Utilizing the excellent tunability of moir\\'e\nsystems, we extend our analysis to other incompressible phases and uncover the\ndynamical properties of geometric excitations influenced by quantum phase\ntransitions. Finally, we provide experimental proposals for detecting and\nadvancing the study of intraband neutral excitations in moir\\'e FCIs.\n",
  "subjects": [
    "Condensed Matter/Strongly Correlated Electrons"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "k3xRFJ67D-H2XjmSx9LL8IgRe7hNUBkhPbX96KfgBDU",
  "pdfSize": "1728232"
}