{
  "id": "2412.11967",
  "title": "A Digital twin for Diesel Engines: Operator-infused PINNs with Transfer\n  Learning for Engine Health Monitoring",
  "authors": "Kamaljyoti Nath, Varun Kumar, Daniel J. Smith, George Em Karniadakis",
  "authorsParsed": [
    [
      "Nath",
      "Kamaljyoti",
      ""
    ],
    [
      "Kumar",
      "Varun",
      ""
    ],
    [
      "Smith",
      "Daniel J.",
      ""
    ],
    [
      "Karniadakis",
      "George Em",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 16:47:15 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734367635000,
  "abstract": "  Improving diesel engine efficiency and emission reduction have been critical\nresearch topics. Recent government regulations have shifted this focus to\nanother important area related to engine health and performance monitoring.\nAlthough the advancements in the use of deep learning methods for system\nmonitoring have shown promising results in this direction, designing efficient\nmethods suitable for field systems remains an open research challenge. The\nobjective of this study is to develop a computationally efficient neural\nnetwork-based approach for identifying unknown parameters of a mean value\ndiesel engine model to facilitate physics-based health monitoring and\nmaintenance forecasting. We propose a hybrid method combining physics informed\nneural networks, PINNs, and a deep neural operator, DeepONet to predict unknown\nparameters and gas flow dynamics in a diesel engine. The operator network\npredicts independent actuator dynamics learnt through offline training, thereby\nreducing the PINNs online computational cost. To address PINNs need for\nretraining with changing input scenarios, we propose two transfer learning (TL)\nstrategies. The first strategy involves multi-stage transfer learning for\nparameter identification. While this method is computationally efficient as\ncompared to online PINN training, improvements are required to meet field\nrequirements. The second TL strategy focuses solely on training the output\nweights and biases of a subset of multi-head networks pretrained on a larger\ndataset, substantially reducing computation time during online prediction. We\nalso evaluate our model for epistemic and aleatoric uncertainty by\nincorporating dropout in pretrained networks and Gaussian noise in the training\ndataset. This strategy offers a tailored, computationally inexpensive, and\nphysics-based approach for parameter identification in diesel engine sub\nsystems.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Systems and Control",
    "Electrical Engineering and Systems Science/Systems and Control"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "vmrZ6h09V33ZRhQl-bZX9Eh-ZC8h7VvYRVWJCcxqDC8",
  "pdfSize": "15881497"
}