{
  "id": "2412.18098",
  "title": "Bar instability and formation timescale across Toomre's $Q$ parameter\n  and central mass concentration: slow bar formation or true stability",
  "authors": "Tirawut Worrakitpoonpon",
  "authorsParsed": [
    [
      "Worrakitpoonpon",
      "Tirawut",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 24 Dec 2024 02:15:19 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1735006519000,
  "abstract": "  We investigate the bar formation process using $N$-body simulations across\nthe Toomre's parameter $Q_{min}$ and central mass concentration (CMC), focusing\nprincipally on the formation timescale. Of importance is that, as suggested by\ncosmological simulations, disk galaxies have limited time of $\\sim 8$ Gyr in\nthe Universe timeline to evolve secularly, starting when they became physically\nand kinematically steady to prompt the bar instability. By incorporating this\ntime limit, bar-unstable disks are further sub-divided into those that\nestablish a bar before and after that time, namely the normal and the slowly\nbar-forming disks. Simulations demonstrate that evolutions of bar strengths and\nconfigurations of the slowly bar-forming and the bar-stable cases are nearly\nindistinguishable prior to $8$ Gyr, albeit dynamically distinct, while\ndifferences can be noticed afterwards. Differentiating them before $8$ Gyr is\npossible by identifying the proto-bar, a signature of bar development visible\nin kinematical maps such as the Fourier spectrogram and the angular velocity\nfield, which emerges in the former group $1-2$ Gyr before the fully developed\nbar, whereas it is absent in the latter group until $8$ Gyr and such bar-stable\ndisk remains unbarred until at least $10$ Gyr. In addition, we find complicated\ninterplays between $Q_{min}$ and CMC in regulating the bar formation. Firstly,\ndisk stabilization requires both high $Q_{min}$ and CMC. Either high $Q_{min}$\nor high CMC only results in slow bar formation. Secondly, some hot disks can\nform a bar more rapidly than the colder ones in a specific range of $Q_{min}$\nand CMC.\n",
  "subjects": [
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "duJxMMHi7TbCBtAS9EAcyDbchIxGYemWcaeS2evfHJI",
  "pdfSize": "1209613"
}