{
  "id": "2412.15272",
  "title": "SimGRAG: Leveraging Similar Subgraphs for Knowledge Graphs Driven\n  Retrieval-Augmented Generation",
  "authors": "Yuzheng Cai, Zhenyue Guo, Yiwen Pei, Wanrui Bian, Weiguo Zheng",
  "authorsParsed": [
    [
      "Cai",
      "Yuzheng",
      ""
    ],
    [
      "Guo",
      "Zhenyue",
      ""
    ],
    [
      "Pei",
      "Yiwen",
      ""
    ],
    [
      "Bian",
      "Wanrui",
      ""
    ],
    [
      "Zheng",
      "Weiguo",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 15:40:08 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734450008000,
  "abstract": "  Recent advancements in large language models (LLMs) have shown impressive\nversatility across various tasks. To eliminate its hallucinations,\nretrieval-augmented generation (RAG) has emerged as a powerful approach,\nleveraging external knowledge sources like knowledge graphs (KGs). In this\npaper, we study the task of KG-driven RAG and propose a novel Similar Graph\nEnhanced Retrieval-Augmented Generation (SimGRAG) method. It effectively\naddresses the challenge of aligning query texts and KG structures through a\ntwo-stage process: (1) query-to-pattern, which uses an LLM to transform queries\ninto a desired graph pattern, and (2) pattern-to-subgraph, which quantifies the\nalignment between the pattern and candidate subgraphs using a graph semantic\ndistance (GSD) metric. We also develop an optimized retrieval algorithm that\nefficiently identifies the top-$k$ subgraphs within 1-second latency on a\n10-million-scale KG. Extensive experiments show that SimGRAG outperforms\nstate-of-the-art KG-driven RAG methods in both question answering and fact\nverification, offering superior plug-and-play usability and scalability.\n",
  "subjects": [
    "Computer Science/Computation and Language",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Information Retrieval"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "q8nLs2ZoKSKj6b751lfBMTGZsxVdERnazoXCIWpxykM",
  "pdfSize": "980324"
}