{"id":"2412.14159","title":"Measuring the Transverse Velocity of Strongly Lensed Gravitational Wave\n  Sources with Ground Based Detectors","authors":"Johan Samsing, Lorenz Zwick, Pankaj Saini, Daniel J. D'Orazio, Kai\n  Hendriks, Jose Mar\\'ia Ezquiaga, Rico K.L. Lo, Luka Vujeva, Georgi D. Radev,\n  Yan Yu","authorsParsed":[["Samsing","Johan",""],["Zwick","Lorenz",""],["Saini","Pankaj",""],["D'Orazio","Daniel J.",""],["Hendriks","Kai",""],["Ezquiaga","Jose María",""],["Lo","Rico K. L.",""],["Vujeva","Luka",""],["Radev","Georgi D.",""],["Yu","Yan",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 18:53:27 GMT"}],"updateDate":"2024-12-19","timestamp":1734548007000,"abstract":"  Observations of strongly gravitationally lensed gravitational wave (GW)\nsources provide a unique opportunity for constraining their transverse motion,\nwhich otherwise is exceedingly hard for GW mergers in general. Strong lensing\nmakes this possible when two or more images of the lensed GW source are\nobserved, as each image essentially allows the observer to see the GW source\nfrom different directional lines-of-sight. If the GW source is moving relative\nto the lens and observer, the observed GW signal from one image will therefore\ngenerally appear blue- or redshifted compared to GW signal from the other\nimage. This velocity induced differential Doppler shift gives rise to an\nobservable GW phase shift between the GW signals from the different images,\nwhich provides a rare glimpse into the relative motion of GW sources and their\nhost environment across redshift. We illustrate that detecting such GW phase\nshifts is within reach of next-generation ground-based detectors such as\nEinstein Telescope, that is expected to detect $\\sim$hundreds of lensed GW\nmergers per year. This opens up completely new ways of inferring the\nenvironment of GW sources, as well as studying cosmological velocity flows\nacross redshift.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"izkCfRhC0G3oNBpZB1cM3TDh21vVVmfSTUKtCZv4R_U","pdfSize":"1848449"}