{"id":"2412.04749","title":"Machine learning algorithms to predict the risk of rupture of\n  intracranial aneurysms: a systematic review","authors":"Karan Daga, Siddharth Agarwal, Zaeem Moti, Matthew BK Lee, Munaib Din,\n  David Wood, Marc Modat, Thomas C Booth","authorsParsed":[["Daga","Karan",""],["Agarwal","Siddharth",""],["Moti","Zaeem",""],["Lee","Matthew BK",""],["Din","Munaib",""],["Wood","David",""],["Modat","Marc",""],["Booth","Thomas C",""]],"versions":[{"version":"v1","created":"Fri, 6 Dec 2024 03:25:01 GMT"}],"updateDate":"2024-12-09","timestamp":1733455501000,"abstract":"  Purpose: Subarachnoid haemorrhage is a potentially fatal consequence of\nintracranial aneurysm rupture, however, it is difficult to predict if aneurysms\nwill rupture. Prophylactic treatment of an intracranial aneurysm also involves\nrisk, hence identifying rupture-prone aneurysms is of substantial clinical\nimportance. This systematic review aims to evaluate the performance of machine\nlearning algorithms for predicting intracranial aneurysm rupture risk.\n  Methods: MEDLINE, Embase, Cochrane Library and Web of Science were searched\nuntil December 2023. Studies incorporating any machine learning algorithm to\npredict the risk of rupture of an intracranial aneurysm were included. Risk of\nbias was assessed using the Prediction Model Risk of Bias Assessment Tool\n(PROBAST). PROSPERO registration: CRD42023452509. Results: Out of 10,307\nrecords screened, 20 studies met the eligibility criteria for this review\nincorporating a total of 20,286 aneurysm cases. The machine learning models\ngave a 0.66-0.90 range for performance accuracy. The models were compared to\ncurrent clinical standards in six studies and gave mixed results. Most studies\nposed high or unclear risks of bias and concerns for applicability, limiting\nthe inferences that can be drawn from them. There was insufficient homogenous\ndata for a meta-analysis.\n  Conclusions: Machine learning can be applied to predict the risk of rupture\nfor intracranial aneurysms. However, the evidence does not comprehensively\ndemonstrate superiority to existing practice, limiting its role as a clinical\nadjunct. Further prospective multicentre studies of recent machine learning\ntools are needed to prove clinical validation before they are implemented in\nthe clinic.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Machine Learning","Quantitative Biology/Quantitative Methods"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"5-rB_D2LT_MuVkoABtfHbyOiguqL2wMR_o1iBKj9j2U","pdfSize":"748117"}