{
  "id": "2412.18397",
  "title": "Scheme to Detect the Strong-to-weak Symmetry Breaking via Randomized\n  Measurements",
  "authors": "Ning Sun, Pengfei Zhang, and Lei Feng",
  "authorsParsed": [
    [
      "Sun",
      "Ning",
      ""
    ],
    [
      "Zhang",
      "Pengfei",
      ""
    ],
    [
      "Feng",
      "Lei",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 24 Dec 2024 12:41:38 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 14 Jan 2025 12:56:59 GMT"
    }
  ],
  "updateDate": "2025-01-15",
  "timestamp": 1735044098000,
  "abstract": "  Symmetry breaking plays a central role in classifying the phases of quantum\nmany-body systems. Recent developments have highlighted a novel\nsymmetry-breaking pattern, in which the strong symmetry of a density matrix\nspontaneously breaks to the week symmetry. This strong-to-weak symmetry\nbreaking is typically detected using multi-replica correlation functions, such\nas the R\\'enyi-2 correlator. In this letter, we propose a practical protocol\nfor detecting strong-to-weak symmetry breaking in experiments using the\nrandomized measurement toolbox. Our scheme involves collecting the results of\nrandom Pauli measurements for (i) the original quantum state and (ii) the\nquantum state after evolution with the charged operators. Based on the\nmeasurement results, with a large number of samples, we can obtain the exact\nsolution to the R\\'enyi-2 correlator. With a small sample size, we can still\nprovide an alternative approach to estimate the phase boundary to a decent\naccuracy. We perform numerical simulations of Ising chains with all-to-all\ndecoherence as an exemplary demonstration. Our result opens the opportunity for\nthe experimental studies of the novel quantum phases in mixed quantum states.\n",
  "subjects": [
    "Physics/Quantum Physics",
    "Condensed Matter/Quantum Gases",
    "Condensed Matter/Statistical Mechanics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "AVAQTnRAqhC8nsNGa9N52-FVCbWmChk7PSiIDbrrCBE",
  "pdfSize": "789381"
}