{"id":"2412.07970","title":"Extended red wings and the visibility of reionization-epoch\n  Lyman-$\\alpha$ emitters","authors":"Yuxuan Yuan, Sergio Martin-Alvarez, Martin G. Haehnelt, Thibault\n  Garel, Laura Keating, Joris Witstok and Debora Sijacki","authorsParsed":[["Yuan","Yuxuan",""],["Martin-Alvarez","Sergio",""],["Haehnelt","Martin G.",""],["Garel","Thibault",""],["Keating","Laura",""],["Witstok","Joris",""],["Sijacki","Debora",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 23:15:31 GMT"}],"updateDate":"2024-12-12","timestamp":1733872531000,"abstract":"  The visibility of the Lyman-$\\alpha$ (Ly$\\alpha$) emission from\nreionization-epoch galaxies depends sensitively on the extent of the intrinsic\n\\lya emission redwards of 1215.67~\\AA. The prominent red peak resulting from\nresonant radiative transfer in the interstellar medium is often modelled as a\nsingle Gaussian. We use the \\textsc{Azahar} simulation suite of a\nmassive-reionization epoch galaxy to show that a significantly larger fraction\nof the \\lya emission extends to $400$-$800$~km~s$^{-1}$, and thus significantly\nfurther to the red than predicted by a Gaussian line profile. A cycle of\nfrequent galaxy mergers strongly modulates the \\lya luminosity, the red peak\nvelocity and its extended red wing emerging from the galaxy, which all also\nstrongly vary with viewing angle. The \\lya emission also depends sensitively on\nthe implemented feedback, dust and star formation physics. Our simulations\nincluding cosmic rays reproduce the observed spectral properties of\nreionization epoch \\lya emitters (LAEs) well if we assume that the \\lya\nemission is affected by very little dust. The visibility of LAEs can be\nstrongly underestimated if the extended red wings of the intrinsic \\lya\nemission are not accounted for. We discuss implications for using the\nvisibility of LAEs to constrain the evolution of the volume-averaged neutral\nfraction during reionization.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"SvMD75zc0nPiU8GJMSX7tA1p8dNL_PST51UiQZlENTo","pdfSize":"7233769"}