{"id":"2412.18032","title":"A physics-engineering-economic model coupling approach for estimating\n  the socio-economic impacts of space weather scenarios","authors":"Edward J. Oughton, Dennies K. Bor, Michael Wiltberger, Robert Weigel,\n  C. Trevor Gaunt, Ridvan Dogan, Liling Huang","authorsParsed":[["Oughton","Edward J.",""],["Bor","Dennies K.",""],["Wiltberger","Michael",""],["Weigel","Robert",""],["Gaunt","C. Trevor",""],["Dogan","Ridvan",""],["Huang","Liling",""]],"versions":[{"version":"v1","created":"Mon, 23 Dec 2024 23:03:58 GMT"}],"updateDate":"2024-12-25","timestamp":1734995038000,"abstract":"  There is growing concern about our vulnerability to space weather hazards and\nthe disruption critical infrastructure failures could cause to society and the\neconomy. However, the socio-economic impacts of space weather hazards, such as\nfrom geomagnetic storms, remain under-researched. This study introduces a novel\nframework to estimate the economic impacts of electricity transmission\ninfrastructure failure due to space weather. By integrating existing\ngeophysical and geomagnetically induced current (GIC) estimation models with a\nnewly developed geospatial model of the Continental United States power grid,\nGIC vulnerabilities are assessed for a range of space weather scenarios. The\napproach evaluates multiple power network architectures, incorporating\ninput-output economic modeling to translate business and population disruptions\ninto macroeconomic impacts from GIC-related thermal heating failures. The\nresults indicate a daily GDP loss from 6 billion USD to over 10 billion USD.\nEven under conservative GIC thresholds (75 A/ph) aligned with thermal withstand\nlimits from the North American Electric Reliability Corporation (NERC),\nsignificant economic disruptions are evident. This study is limited by its\nrestriction to thermal heating analysis, though GICs can also affect the grid\nthrough other pathways, such as voltage instability and harmonic distortions.\nAddressing these other failure mechanisms need to be the focus of future\nresearch.\n","subjects":["Physics/Geophysics","Computer Science/Systems and Control","Economics/General Economics","Electrical Engineering and Systems Science/Systems and Control","Quantitative Finance/Economics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"z0xl60psZcpo7BxzOQ58RakLp5G2PMzr5-zOj7jYnOQ","pdfSize":"3343658"}