{"id":"2412.09834","title":"Connecting through Comics: Design and Evaluation of Cube, an Arts-Based\n  Digital Platform for Trauma-Impacted Youth","authors":"Ila Kumar, Jocelyn Shen, Craig Ferguson, Rosalind W Picard","authorsParsed":[["Kumar","Ila",""],["Shen","Jocelyn",""],["Ferguson","Craig",""],["Picard","Rosalind W",""]],"versions":[{"version":"v1","created":"Fri, 13 Dec 2024 03:53:12 GMT"},{"version":"v2","created":"Sat, 4 Jan 2025 21:43:40 GMT"},{"version":"v3","created":"Mon, 20 Jan 2025 23:16:03 GMT"}],"updateDate":"2025-01-22","timestamp":1734061992000,"abstract":"  This paper explores the design, development and evaluation of a digital\nplatform that aims to assist young people who have experienced trauma in\nunderstanding and expressing their emotions and fostering social connections.\nIntegrating principles from expressive arts and narrative-based therapies, we\ncollaborate with lived experts to iteratively design a novel, user-centered\ndigital tool for young people to create and share comics that represent their\nexperiences. Specifically, we conduct a series of nine workshops with N=54\ntrauma-impacted youth and young adults to test and refine our tool, beginning\nwith three workshops using low-fidelity prototypes, followed by six workshops\nwith Cube, a web version of the tool. A qualitative analysis of workshop\nfeedback and empathic relations analysis of artifacts provides valuable\ninsights into the usability and potential impact of the tool, as well as the\nspecific needs of young people who have experienced trauma. Our findings\nsuggest that the integration of expressive and narrative therapy principles\ninto Cube can offer a unique avenue for trauma-impacted young people to process\ntheir experiences, more easily communicate their emotions, and connect with\nsupportive communities. We end by presenting implications for the design of\nsocial technologies that aim to support the emotional well-being and social\nintegration of youth and young adults who have faced trauma.\n","subjects":["Computer Science/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"Jdr1dlQTZ1AoLm15kyEl_Hty2idDfK61-4yWPA9W93U","pdfSize":"21670058"}