{"id":"2412.09088","title":"Cross-feeding percolation phase transitions of inter-cellular metabolic\n  networks","authors":"Lu\\'is C. F. Latoski, Andrea De Martino, Daniele De Martino","authorsParsed":[["Latoski","Luís C. F.",""],["De Martino","Andrea",""],["De Martino","Daniele",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 09:15:39 GMT"}],"updateDate":"2024-12-13","timestamp":1733994939000,"abstract":"  Intercellular exchange networks are essential for the adaptive capabilities\nof populations of cells. While diffusional exchanges have traditionally been\ndifficult to map, recent advances in nanotechnology enable precise probing of\nexchange fluxes with the medium at single-cell resolution. Here we introduce a\ntiling-based method to reconstruct the dynamic unfolding of exchange networks\nfrom flux data, subsequently applying it to an experimental mammalian\nco-culture system where lactate exchanges affect the acidification of the\nenvironment. We observe that the network, which initially exhibits a dense\nmatrix of exchanges, progressively breaks up into small disconnected clusters\nof cells. To explain this behaviour, we develop a two-parameter Maximum-Entropy\nmulticellular metabolic model that incorporates diffusion-driven exchanges\nthrough a set of global constraints that couple cellular behaviors. The model\npredicts a transition from a densely interconnected network to a sparse,\nmotif-dominated state as glucose and oxygen consumption levels shift. We\ncharacterize such a crossover both numerically, revealing a power-law decay in\nthe cluster-size distribution at the critical transition, and analytically, by\ncomputing the critical line through a mean-field approximation based on\npercolation theory. By comparing empirical data with theoretical predictions,\nwe find that populations evolve towards the sparse phase by remaining near the\ncrossover point between these two regimes. These findings offer new insights\ninto the collective organization driving the adaptive dynamics of cell\npopulations.\n","subjects":["Condensed Matter/Statistical Mechanics","Quantitative Biology/Cell Behavior"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"fjLND51OCkQ-2GIWu3S8qNaskc-pGHTz3XnSpt0S0gM","pdfSize":"4321421"}