{
  "id": "2412.06010",
  "title": "Interior and Gravity Field Models for Uranus Suggest Mixed-composition\n  Interior: Implications for the Uranus Orbiter and Probe",
  "authors": "Zifan Lin, Sara Seager, Benjamin P. Weiss",
  "authorsParsed": [
    [
      "Lin",
      "Zifan",
      ""
    ],
    [
      "Seager",
      "Sara",
      ""
    ],
    [
      "Weiss",
      "Benjamin P.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 8 Dec 2024 18:00:42 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733680842000,
  "abstract": "  The interior composition and structure of Uranus are ambiguous. It is unclear\nwhether Uranus is composed of fully differentiated layers dominated by an icy\nmantle or has smooth compositional gradients. The Uranus Orbiter and Probe\n(UOP), the next NASA Flagship mission prioritized by the Planetary Science and\nAstrobiology Survey 2023-2032, will constrain the planet's interior by\nmeasuring its gravity and magnetic fields. To characterize the Uranian\ninterior, here we present CORGI, a newly developed planetary interior and\ngravity model. We confirm that high degrees of mixing are required for Uranus\ninterior models to be consistent with the $J_2$ and $J_4$ gravity harmonics\nmeasured by Voyager 2. Empirical models, which have smooth density profiles\nthat require extensive mixing, can reproduce the Voyager 2 measurements.\nDistinct-layer models with mantles composed of H$_2$O-H/He or\nH$_2$O-CH$_4$-NH$_3$ mixtures are consistent with the Voyager 2 measurements if\nthe heavy element mass fraction, $Z$, in the mantle $\\lesssim85\\%$, or if\natmospheric $Z$ $\\gtrsim25\\%$. Our gravity harmonics model shows that UOP $J_2$\nand $J_4$ measurements can distinguish between high ($Z\\geq25\\%$) and low\n($Z=12.5\\%$) atmospheric metallicity scenarios. The UOP can robustly constrain\n$J_6$ and potentially $J_8$ given polar orbits within rings. An ice-rich\ncomposition can naturally explain the source of Uranus' magnetic field.\nHowever, because the physical properties of rock-ice mixtures are poorly known,\nmagnetic field generation by a rock-rich composition cannot be ruled out.\nFuture experiments and simulations on realistic planetary building materials\nwill be essential for refining Uranus interior models.\n",
  "subjects": [
    "Astrophysics/Earth and Planetary Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "FQFy1aqkxJYa3x9f6Z_I3-5IJOVjuDimrzHlKZY0avs",
  "pdfSize": "14009448"
}