{"id":"2412.19654","title":"Asymmetrical Reciprocity-based Federated Learning for Resolving\n  Disparities in Medical Diagnosis","authors":"Jiaqi Wang, Ziyi Yin, Quanzeng You, Lingjuan Lyu, Fenglong Ma","authorsParsed":[["Wang","Jiaqi",""],["Yin","Ziyi",""],["You","Quanzeng",""],["Lyu","Lingjuan",""],["Ma","Fenglong",""]],"versions":[{"version":"v1","created":"Fri, 27 Dec 2024 13:59:58 GMT"}],"updateDate":"2024-12-30","timestamp":1735307998000,"abstract":"  Geographic health disparities pose a pressing global challenge, particularly\nin underserved regions of low- and middle-income nations. Addressing this issue\nrequires a collaborative approach to enhance healthcare quality, leveraging\nsupport from medically more developed areas. Federated learning emerges as a\npromising tool for this purpose. However, the scarcity of medical data and\nlimited computation resources in underserved regions make collaborative\ntraining of powerful machine learning models challenging. Furthermore, there\nexists an asymmetrical reciprocity between underserved and developed regions.\nTo overcome these challenges, we propose a novel cross-silo federated learning\nframework, named FedHelp, aimed at alleviating geographic health disparities\nand fortifying the diagnostic capabilities of underserved regions.\nSpecifically, FedHelp leverages foundational model knowledge via one-time API\naccess to guide the learning process of underserved small clients, addressing\nthe challenge of insufficient data. Additionally, we introduce a novel\nasymmetric dual knowledge distillation module to manage the issue of asymmetric\nreciprocity, facilitating the exchange of necessary knowledge between developed\nlarge clients and underserved small clients. We validate the effectiveness and\nutility of FedHelp through extensive experiments on both medical image\nclassification and segmentation tasks. The experimental results demonstrate\nsignificant performance improvement compared to state-of-the-art baselines,\nparticularly benefiting clients in underserved regions.\n","subjects":["Computer Science/Machine Learning","Computer Science/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_Tm4b-2rHCs-Df73020Je-E6N94Gr-mrso702Z8ns-M","pdfSize":"1715466"}