{"id":"2412.07944","title":"PGRID: Power Grid Reconstruction in Informal Developments Using\n  High-Resolution Aerial Imagery","authors":"Simone Fobi Nsutezo, Amrita Gupta, Duncan Kebut, Seema Iyer, Luana\n  Marotti, Rahul Dodhia, Juan M. Lavista Ferres, Anthony Ortiz","authorsParsed":[["Nsutezo","Simone Fobi",""],["Gupta","Amrita",""],["Kebut","Duncan",""],["Iyer","Seema",""],["Marotti","Luana",""],["Dodhia","Rahul",""],["Ferres","Juan M. Lavista",""],["Ortiz","Anthony",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 22:04:00 GMT"}],"updateDate":"2024-12-12","timestamp":1733868240000,"abstract":"  As of 2023, a record 117 million people have been displaced worldwide, more\nthan double the number from a decade ago [22]. Of these, 32 million are\nrefugees under the UNHCR mandate, with 8.7 million residing in refugee camps. A\ncritical issue faced by these populations is the lack of access to electricity,\nwith 80% of the 8.7 million refugees and displaced persons in camps globally\nrelying on traditional biomass for cooking and lacking reliable power for\nessential tasks such as cooking and charging phones. Often, the burden of\ncollecting firewood falls on women and children, who frequently travel up to 20\nkilometers into dangerous areas, increasing their vulnerability.[7]\n  Electricity access could significantly alleviate these challenges, but a\nmajor obstacle is the lack of accurate power grid infrastructure maps,\nparticularly in resource-constrained environments like refugee camps, needed\nfor energy access planning. Existing power grid maps are often outdated,\nincomplete, or dependent on costly, complex technologies, limiting their\npracticality. To address this issue, PGRID is a novel application-based\napproach, which utilizes high-resolution aerial imagery to detect electrical\npoles and segment electrical lines, creating precise power grid maps. PGRID was\ntested in the Turkana region of Kenya, specifically the Kakuma and Kalobeyei\nCamps, covering 84 km2 and housing over 200,000 residents.\n  Our findings show that PGRID delivers high-fidelity power grid maps\nespecially in unplanned settlements, with F1-scores of 0.71 and 0.82 for pole\ndetection and line segmentation, respectively. This study highlights a\npractical application for leveraging open data and limited labels to improve\npower grid mapping in unplanned settlements, where the growing number of\ndisplaced persons urgently need sustainable energy infrastructure solutions.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"1ayzzBO5PxhPiwC86KVX6y2UNTHjyfwEbIwo7hTSxn0","pdfSize":"16783537"}