{"id":"2412.00430","title":"Optimizing Sequential Recommendation Models with Scaling Laws and\n  Approximate Entropy","authors":"Tingjia Shen, Hao Wang, Chuhan Wu, Jin Yao Chin, Wei Guo, Yong Liu,\n  Huifeng Guo, Defu Lian, Ruiming Tang, Enhong Chen","authorsParsed":[["Shen","Tingjia",""],["Wang","Hao",""],["Wu","Chuhan",""],["Chin","Jin Yao",""],["Guo","Wei",""],["Liu","Yong",""],["Guo","Huifeng",""],["Lian","Defu",""],["Tang","Ruiming",""],["Chen","Enhong",""]],"versions":[{"version":"v1","created":"Sat, 30 Nov 2024 10:56:30 GMT"},{"version":"v2","created":"Tue, 3 Dec 2024 15:43:49 GMT"},{"version":"v3","created":"Mon, 9 Dec 2024 18:46:37 GMT"},{"version":"v4","created":"Mon, 16 Dec 2024 07:46:03 GMT"},{"version":"v5","created":"Fri, 24 Jan 2025 02:42:07 GMT"},{"version":"v6","created":"Wed, 19 Feb 2025 09:23:03 GMT"}],"updateDate":"2025-02-20","timestamp":1732964190000,"abstract":"  Scaling Laws have emerged as a powerful framework for understanding how model\nperformance evolves as they increase in size, providing valuable insights for\noptimizing computational resources. In the realm of Sequential Recommendation\n(SR), which is pivotal for predicting users' sequential preferences, these laws\noffer a lens through which to address the challenges posed by the scalability\nof SR models. However, the presence of structural and collaborative issues in\nrecommender systems prevents the direct application of the Scaling Law (SL) in\nthese systems. In response, we introduce the Performance Law for SR models,\nwhich aims to theoretically investigate and model the relationship between\nmodel performance and data quality. Specifically, we first fit the HR and NDCG\nmetrics to transformer-based SR models. Subsequently, we propose Approximate\nEntropy (ApEn) to assess data quality, presenting a more nuanced approach\ncompared to traditional data quantity metrics. Our method enables accurate\npredictions across various dataset scales and model sizes, demonstrating a\nstrong correlation in large SR models and offering insights into achieving\noptimal performance for any given model configuration.\n","subjects":["Computer Science/Artificial Intelligence","Computer Science/Information Retrieval"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"HVhPW4bPdgQCW1gAxxz47611eMWy6QIZT0VkWIHikLI","pdfSize":"6118942"}