{
  "id": "2412.01293",
  "title": "SiTSE: Sinhala Text Simplification Dataset and Evaluation",
  "authors": "Surangika Ranathunga, Rumesh Sirithunga, Himashi Rathnayake, Lahiru De\n  Silva, and Thamindu Aluthwala, Saman Peramuna, Ravi Shekhar",
  "authorsParsed": [
    [
      "Ranathunga",
      "Surangika",
      ""
    ],
    [
      "Sirithunga",
      "Rumesh",
      ""
    ],
    [
      "Rathnayake",
      "Himashi",
      ""
    ],
    [
      "De Silva",
      "Lahiru",
      ""
    ],
    [
      "Aluthwala",
      "Thamindu",
      ""
    ],
    [
      "Peramuna",
      "Saman",
      ""
    ],
    [
      "Shekhar",
      "Ravi",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 09:08:06 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733130486000,
  "abstract": "  Text Simplification is a task that has been minimally explored for\nlow-resource languages. Consequently, there are only a few manually curated\ndatasets. In this paper, we present a human curated sentence-level text\nsimplification dataset for the Sinhala language. Our evaluation dataset\ncontains 1,000 complex sentences and corresponding 3,000 simplified sentences\nproduced by three different human annotators. We model the text simplification\ntask as a zero-shot and zero resource sequence-to-sequence (seq-seq) task on\nthe multilingual language models mT5 and mBART. We exploit auxiliary data from\nrelated seq-seq tasks and explore the possibility of using intermediate task\ntransfer learning (ITTL). Our analysis shows that ITTL outperforms the\npreviously proposed zero-resource methods for text simplification. Our findings\nalso highlight the challenges in evaluating text simplification systems, and\nsupport the calls for improved metrics for measuring the quality of automated\ntext simplification systems that would suit low-resource languages as well. Our\ncode and data are publicly available:\nhttps://github.com/brainsharks-fyp17/Sinhala-Text-Simplification-Dataset-and-Evaluation\n",
  "subjects": [
    "Computer Science/Computation and Language"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "FbtEn4sBjttHFpR7Qg_oh424cPmlB0Ajc6vp3ELdAII",
  "pdfSize": "1036195"
}