{"id":"2412.10819","title":"Emergence of half-metallic ferromagnetism and valley polarization in\n  transition metal substituted WSTe monolayer","authors":"Shivani Kumawat, Chandan Kumar Vishwakarma, Mohd Zeeshan, Indranil\n  Mal, Sunil Kumar and B. K. Mani","authorsParsed":[["Kumawat","Shivani",""],["Vishwakarma","Chandan Kumar",""],["Zeeshan","Mohd",""],["Mal","Indranil",""],["Kumar","Sunil",""],["Mani","B. K.",""]],"versions":[{"version":"v1","created":"Sat, 14 Dec 2024 13:02:27 GMT"}],"updateDate":"2024-12-17","timestamp":1734181347000,"abstract":"  Two-dimensional (2D) Janus materials hold a great importance in spintronic\nand valleytronic applications due to their unique lattice structures and\nemergent properties. They intrinsically exhibit both an in-plane inversion and\nout-of-plane mirror symmetry breakings, which offer a new degree of freedom to\nelectrons in the material. One of the main limitations in the multifunctional\napplications of these materials is, however, that, they are usually\nnon-magnetic in nature. Here, using first-principles calculations, we propose\nto induce magnetic degree of freedom in non-magnetic WSTe via doping with\ntransition metal (TM) elements -- Fe, Mn and Co. Further, we comprehensively\nprobe the electronic, spintronic and valleytronic properties in these systems.\nOur simulations predict intrinsic Rashba and Zeeman-type spin splitting in\npristine WSTe. The obtained Rashba parameter is $\\sim$ 422 meV\\AA\\; along the\n$\\Gamma - K$ direction. Our study shows a strong dependence on uniaxial and\nbiaxial strains where we observe an enhancement of $\\sim$ 2.1\\% with 3\\%\nbiaxial compressive strain. The electronic structure of TM-substituted WSTe\nreveals half-metallic nature for 6.25 and 18.75\\% of Fe, 25\\% of Mn, and 18.75\nand 25\\% of Co structures, which leads to 100\\% spin polarization. The obtained\nvalues of valley polarization 65, 54.4 and 46.3 meV for 6.25\\% of Fe, Mn and\nCo, respectively, are consistent with the literature data for other Janus\nmaterials. Further, our calculations show a strain dependent tunability of\nvalley polarization, where we find an increasing (decreasing) trend with\nuniaxial and biaxial tensile (compressive) strains. We observed a maximum\nenhancement of $\\sim$ 1.72\\% for 6.25\\% of Fe on application of 3\\% biaxial\ntensile strain.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"KJNvqLeL02gnTbfp2xMbwBeRqpe2Nw2sUxThZMxQCsU","pdfSize":"1706956"}