{
  "id": "2412.15892",
  "title": "From annular cavity to rotor-stator flow: nonlinear dynamics of\n  axisymmetric rolls",
  "authors": "Artur Gesla, Patrick Le Qu\\'er\\'e, Yohann Duguet and Laurent Martin\n  Witkowski",
  "authorsParsed": [
    [
      "Gesla",
      "Artur",
      ""
    ],
    [
      "Quéré",
      "Patrick Le",
      ""
    ],
    [
      "Duguet",
      "Yohann",
      ""
    ],
    [
      "Witkowski",
      "Laurent Martin",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 13:47:47 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734702467000,
  "abstract": "  Spatio-temporally complex flows are found at the onset of unsteadiness in\n(axisymmetric) rotor-stator turbulence in the shape of concentric rolls. The\nemergence of these rolls is rationalised using a homotopy approach, where the\noriginal flow configuration is continuously deformed into a simpler, better\nunderstood configuration. We deform here rotor-stator flow into an annular\nflow, thereby controlling curvature effects, and we investigate numerically the\ntransition scenarios as functions of the Reynolds number. Increasing curvature\nstarting from the planar limit reveals a clear path towards a subcritical\nscenario as a function of the Reynolds number. As the rotor-stator\nconfiguration is approached, supercritical branches shift to increasing\nReynolds number while a subcritical branch of chaotic states takes over. Modal\nselection in the supercritical scenario involves the competition between two\nmodal families. It rests on a specific radial localisation property of all\neigenmodes, linked to the space-dependent convective radial velocity which\nintensifies as curvature is increased. A new nonlinear mechanism for the\npairing of rolls is proposed based on multiple resonances. The critical point\nwhere the original rotor-stator flow loses its stability to axisymmetric\nperturbations is identified for the first time for the geometry under study.\n",
  "subjects": [
    "Physics/Fluid Dynamics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "udgbNvy8swTEajZMJRqy1qc7pXtpyWP94z3uTa01M_o",
  "pdfSize": "2127273"
}