{"id":"2412.02544","title":"Testing inflation on all scales: a case study with $\\alpha$-attractors","authors":"Laura Iacconi, Michael Bacchi, Luiz Filipe Guimar\\~aes and Felipe T.\n  Falciano","authorsParsed":[["Iacconi","Laura",""],["Bacchi","Michael",""],["Guimarães","Luiz Filipe",""],["Falciano","Felipe T.",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 16:36:16 GMT"}],"updateDate":"2024-12-04","timestamp":1733243776000,"abstract":"  A plethora of inflationary models can produce interesting small-scale\nphenomenology, such as enhanced scalar fluctuations leading to primordial black\nhole (PBH) production and large scalar-induced GW. Nevertheless, good models\nmust simultaneously explain current observations on all scales. In this work,\nwe showcase our methodology to establish the small-scale phenomenology of\ninflationary models on firm grounds. We consider the case of hybrid\n$\\alpha$-attractors, and focus on a reduced parameter space featuring the two\npotential parameters which roughly determine the position of the peak in the\nscalar power spectrum, $\\mathcal{P}_\\zeta$, and its amplitude. We first\nconstrain the parameter space by comparing the large-scale predictions for\n$\\mathcal{P}_\\zeta$ with current CMB anisotropies measurements and upper limits\non $\\mu$-distortions. We take into account uncertainties due to the reheating\nphase, and observe that the parameter-space area compatible with large-scale\nconstraints shrinks for extended reheating stages. We then move to smaller\nscales, where we find that non-Gaussianity at peak scales is of the local type\nand has amplitude $f_\\text{NL}\\sim \\mathcal{O}(0.1)$. This ensures that\nnon-linear effects are subdominant, motivating us to employ the tree-level\n$\\mathcal{P}_\\zeta$ to compute the abundance of PBHs and the spectrum of\ninduced GWs for models consistent with large-scale tests. The former allows us\nto further constrain the parameter space, by excluding models which\nover-produce PBHs. We find that a subset of viable models can lead to\nsignificant production of PBHs, and a fraction of these is within reach for\nLISA, having a signal-to-noise ratio larger than that of astrophysical\nforegrounds. Our first-of-its-kind study systematically combines tests at\ndifferent scales, and exploits the synergy between cosmological observations\nand theoretical consistency requirements.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"lKA-nnJhiQSz_X_aRUYS6n8neDtHgQ8FShQ6F7SqEqo","pdfSize":"2809266"}