{"id":"2412.02712","title":"Analyzing political stances on Twitter in the lead-up to the 2024 U.S.\n  election","authors":"Hazem Ibrahim, Farhan Khan, Hend Alabdouli, Maryam Almatrooshi, Tran\n  Nguyen, Talal Rahwan, Yasir Zaki","authorsParsed":[["Ibrahim","Hazem",""],["Khan","Farhan",""],["Alabdouli","Hend",""],["Almatrooshi","Maryam",""],["Nguyen","Tran",""],["Rahwan","Talal",""],["Zaki","Yasir",""]],"versions":[{"version":"v1","created":"Thu, 28 Nov 2024 07:05:34 GMT"}],"updateDate":"2024-12-05","timestamp":1732777534000,"abstract":"  Social media platforms play a pivotal role in shaping public opinion and\namplifying political discourse, particularly during elections. However, the\nsame dynamics that foster democratic engagement can also exacerbate\npolarization. To better understand these challenges, here, we investigate the\nideological positioning of tweets related to the 2024 U.S. Presidential\nElection. To this end, we analyze 1,235 tweets from key political figures and\n63,322 replies, and classify ideological stances into Pro-Democrat,\nAnti-Republican, Pro-Republican, Anti-Democrat, and Neutral categories. Using a\nclassification pipeline involving three large language models (LLMs)-GPT-4o,\nGemini-Pro, and Claude-Opus-and validated by human annotators, we explore how\nideological alignment varies between candidates and constituents. We find that\nRepublican candidates author significantly more tweets in criticism of the\nDemocratic party and its candidates than vice versa, but this relationship does\nnot hold for replies to candidate tweets. Furthermore, we highlight shifts in\npublic discourse observed during key political events. By shedding light on the\nideological dynamics of online political interactions, these results provide\ninsights for policymakers and platforms seeking to address polarization and\nfoster healthier political dialogue.\n","subjects":["Computer Science/Social and Information Networks","Computer Science/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"qbsjmh9b7qx4lb7pLXN8Uoy5TtDFEKxzl1NG4438010","pdfSize":"14995886"}