{
  "id": "2412.02095",
  "title": "The Terminator Region Atmosphere of the hot Jupiter WASP-77Ab with\n  ESPRESSO/VLT observations",
  "authors": "Zewen Jiang, Wei Wang, Guo Chen, Yaqing Shi, Meng Zhai, Patricio Rojo,\n  Yujuan Liu, Gang Zhao",
  "authorsParsed": [
    [
      "Jiang",
      "Zewen",
      ""
    ],
    [
      "Wang",
      "Wei",
      ""
    ],
    [
      "Chen",
      "Guo",
      ""
    ],
    [
      "Shi",
      "Yaqing",
      ""
    ],
    [
      "Zhai",
      "Meng",
      ""
    ],
    [
      "Rojo",
      "Patricio",
      ""
    ],
    [
      "Liu",
      "Yujuan",
      ""
    ],
    [
      "Zhao",
      "Gang",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 02:30:40 GMT"
    }
  ],
  "updateDate": "2024-12-04",
  "timestamp": 1733193040000,
  "abstract": "  Atmospheric studies are essential for elucidating the formation history,\nevolutionary processes, and atmospheric dynamics of exoplanets. High-resolution\ntransmission spectroscopy offers the advantage of detecting subtle variations\nin stellar spectral profiles, thereby enabling the identification of the\nsources of observed signals. In this study, we present the transmission spectra\nof the exoplanet WASP-77Ab, a hot Jupiter with a 1.36-day orbital period around\na G8 host star with $V=11.29$ mag. These observations were conducted using the\nhigh-resolution spectrograph ESPRESSO at the Very Large Telescope over three\ntransit events. We analyze the Rossiter-McLaughlin effect for WASP-77A and\ndetermine a projected spin-orbit angle of ${\\lambda =\n16.131^{\\circ}}^{+2.106}_{-2.324}$, indicating that the planet's orbit is\nnearly aligned. Following the generation of transmission spectra for the three\nnights, we model and correct for center-to-limb variation and the\nRossiter-McLaughlin effects. In the residual transmission spectra, we detect\nH$\\alpha$, H$\\beta$ and CaII H with a significance exceeding 3.5$\\sigma$. After\napplying 0.1-0.5 \\r{A} masks to the cores of these lines to mitigate stellar\ncontamination, all them still shows visible absorptions although not\nsignificant, suggesting at least partial planet contribution to them.\nTherefore, we are yet unable to confirm or reject the planetary origin of these\nspectral signals based on the current data set. Further investigation of\nWASP-77Ab's atmosphere, particularly in areas beyond the terminator region, is\nessential to illuminate the planet's two-dimensional atmospheric structure.\n",
  "subjects": [
    "Astrophysics/Earth and Planetary Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "prWJeE2hHS1ckCcKbYrUhL8uw9D9nXmYwn8jc1EElio",
  "pdfSize": "27376965"
}