{
  "id": "2412.12683",
  "title": "ShiftedBronzes: Benchmarking and Analysis of Domain Fine-Grained\n  Classification in Open-World Settings",
  "authors": "Rixin Zhou, Honglin Pang, Qian Zhang, Ruihua Qi, Xi Yang, Chuntao Li",
  "authorsParsed": [
    [
      "Zhou",
      "Rixin",
      ""
    ],
    [
      "Pang",
      "Honglin",
      ""
    ],
    [
      "Zhang",
      "Qian",
      ""
    ],
    [
      "Qi",
      "Ruihua",
      ""
    ],
    [
      "Yang",
      "Xi",
      ""
    ],
    [
      "Li",
      "Chuntao",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 08:56:59 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734425819000,
  "abstract": "  In real-world applications across specialized domains, addressing complex\nout-of-distribution (OOD) challenges is a common and significant concern. In\nthis study, we concentrate on the task of fine-grained bronze ware dating, a\ncritical aspect in the study of ancient Chinese history, and developed a\nbenchmark dataset named ShiftedBronzes. By extensively expanding the bronze\nDing dataset, ShiftedBronzes incorporates two types of bronze ware data and\nseven types of OOD data, which exhibit distribution shifts commonly encountered\nin bronze ware dating scenarios. We conduct benchmarking experiments on\nShiftedBronzes and five commonly used general OOD datasets, employing a variety\nof widely adopted post-hoc, pre-trained Vision Large Model (VLM)-based and\ngeneration-based OOD detection methods. Through analysis of the experimental\nresults, we validate previous conclusions regarding post-hoc, VLM-based, and\ngeneration-based methods, while also highlighting their distinct behaviors on\nspecialized datasets. These findings underscore the unique challenges of\napplying general OOD detection methods to domain-specific tasks such as bronze\nware dating. We hope that the ShiftedBronzes benchmark provides valuable\ninsights into both the field of bronze ware dating and the and the development\nof OOD detection methods. The dataset and associated code will be available\nlater.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "x5EytO5bKJ5Vc5yJT23NQCM1M8HUKPAxw3u2lOK64nk",
  "pdfSize": "18300588"
}