{"id":"2412.02560","title":"Selective Thermalization, Chiral Excitations, and a Case of Quantum Hair\n  in the Presence of Event Horizons","authors":"Akhil U Nair, Rakesh K. Jha, Prasant Samantray, Sashideep Gutti","authorsParsed":[["Nair","Akhil U",""],["Jha","Rakesh K.",""],["Samantray","Prasant",""],["Gutti","Sashideep",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 16:49:50 GMT"}],"updateDate":"2024-12-04","timestamp":1733244590000,"abstract":"  The Unruh effect is a well-understood phenomenon, where one considers a\nvacuum state of a quantum field in Minkowski spacetime, which appears to be\nthermally populated for a uniformly accelerating Rindler observer. In this\narticle, we derive a variant of the Unruh effect involving two distinct\naccelerating observers and aim to address the following questions: (i) Is it\npossible to selectively thermalize a subset of momentum modes for the case of\nmassless scalar fields, and (ii) Is it possible to excite only the left-handed\nmassless fermions while keeping right-handed fermions in a vacuum state or vice\nversa? To this end, we consider a Rindler wedge $R_1$ constructed from a class\nof accelerating observers and another Rindler wedge $R_2$ (with $R_2 \\subset\nR_1$) constructed from another class of accelerating observers such that the\nwedge $R_2$ is displaced along a null direction w.r.t $R_1$ by a parameter\n$\\Delta$. By first considering a massless scalar field in the $R_1$ vacuum, we\nshow that if we choose the displacement $\\Delta$ along one null direction, the\npositive momentum modes are thermalized, whereas negative momentum modes remain\nin vacuum (and vice versa if we choose the displacement along the other null\ndirection). We then consider a massless fermionic field in a vacuum state in\n$R_1$ and show that the reduced state in $R_2$ is such that the left-handed\nfermions are excited and are thermal for large frequencies. In contrast, the\nright-handed fermions have negligible particle density and vice versa. We argue\nthat the toy models involving shifted Rindler spacetime may provide insights\ninto the particle excitation aspects of evolving horizons and the possibility\nof Rindler spacetime having a quantum strand of hair. Additionally, based on\nour work, we hypothesize that massless fermions underwent selective chiral\nexcitations during the radiation-dominated era of cosmology.\n","subjects":["Physics/High Energy Physics - Theory","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"2zAiefTOilykfcJEVwnylsQLCwhfZKCMFw_UT4Y7_5M","pdfSize":"631750"}