{"id":"2412.00789","title":"A Cognac shot to forget bad memories: Corrective Unlearning in GNNs","authors":"Varshita Kolipaka, Akshit Sinha, Debangan Mishra, Sumit Kumar, Arvindh\n  Arun, Shashwat Goel, Ponnurangam Kumaraguru","authorsParsed":[["Kolipaka","Varshita",""],["Sinha","Akshit",""],["Mishra","Debangan",""],["Kumar","Sumit",""],["Arun","Arvindh",""],["Goel","Shashwat",""],["Kumaraguru","Ponnurangam",""]],"versions":[{"version":"v1","created":"Sun, 1 Dec 2024 12:23:25 GMT"},{"version":"v2","created":"Mon, 9 Dec 2024 15:14:03 GMT"}],"updateDate":"2024-12-10","timestamp":1733055805000,"abstract":"  Graph Neural Networks (GNNs) are increasingly being used for a variety of ML\napplications on graph data. Because graph data does not follow the\nindependently and identically distributed (i.i.d.) assumption, adversarial\nmanipulations or incorrect data can propagate to other data points through\nmessage passing, which deteriorates the model's performance. To allow model\ndevelopers to remove the adverse effects of manipulated entities from a trained\nGNN, we study the recently formulated problem of Corrective Unlearning. We find\nthat current graph unlearning methods fail to unlearn the effect of\nmanipulations even when the whole manipulated set is known. We introduce a new\ngraph unlearning method, Cognac, which can unlearn the effect of the\nmanipulation set even when only 5% of it is identified. It recovers most of the\nperformance of a strong oracle with fully corrected training data, even beating\nretraining from scratch without the deletion set while being 8x more efficient.\nWe hope our work assists GNN developers in mitigating harmful effects caused by\nissues in real-world data post-training. Our code is publicly available at\nhttps://github.com/varshitakolipaka/corrective-unlearning-for-gnns\n","subjects":["Computer Science/Machine Learning","Computer Science/Artificial Intelligence","Computer Science/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"qKPQXBsIo0tMBqCmpiq9LQhgJfwU6GlSrp_lsg4SZZ4","pdfSize":"3444805"}