{"id":"2412.18554","title":"Red supergiant stars in binary systems II. Confirmation of B-type\n  companions of red supergiants in the Small Magellanic Cloud using Hubble\n  ultra-violet spectroscopy","authors":"L. R. Patrick, D. J. Lennon, A. Schootemeijer, L. Bianchi, I.\n  Negueruela, N. Langer, D. Thilker, and R. Dorda","authorsParsed":[["Patrick","L. R.",""],["Lennon","D. J.",""],["Schootemeijer","A.",""],["Bianchi","L.",""],["Negueruela","I.",""],["Langer","N.",""],["Thilker","D.",""],["Dorda","R.",""]],"versions":[{"version":"v1","created":"Tue, 24 Dec 2024 17:09:37 GMT"}],"updateDate":"2024-12-25","timestamp":1735060177000,"abstract":"  Red supergiant stars (RSGs) represent the final evolutionary phase of the\nmajority of massive stars and hold a unique role in testing the physics of\nstellar models. Eighty eight RSGs in the Small Magellanic Cloud (SMC) were\nrecently found to have an ultra-violet excess that was attributed to a B-type\ncompanion. We present follow-up Hubble Space Telescope (HST) Space Telescope\nImaging Spectrograph (STIS) ultra-violet (1700 -- 3000\\,\\AA) spectroscopy for\n16 of these stars to investigate the nature of the UV excess and confirm the\npresence of a hot companion. In all cases we are able to confirm that the\ncompanion is a main-sequence B-type star based on the near-UV continuum. We\ndetermine effective temperatures, radii and luminosities from fitting the UV\ncontinuum with TLUSTY models and find stellar parameters in the expected range\nof SMC B-type stars. We display these results on a Hertzsprung--Russell diagram\nand assess the previously determined stellar parameters using UV photometry\nalone. From this comparison we conclude that UV photometric surveys are vital\nto identify such companions and UV spectroscopy is similarly vital to\ncharacterise the hot companions. From a comparison with IUE spectra of 32 Cyg,\na well known RSG binary system in the Galaxy, four targets display evidence of\nbeing embedded in the wind of the RSG, like 32 Cyg, although none to the more\nextreme extent of VV Cep. The ages of six targets, determined via the stellar\nparameters of the hot companions, are found to be in tension with the ages\ndetermined for the RSG. A solution to this problem could be binary\nmass-transfer or red straggler stars.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"xmlKqBfpNJUaxgMHFnU1jx3Hjg_qTGOGK-R92gQiYnA","pdfSize":"2132584"}