{
  "id": "2412.19177",
  "title": "Physical nature of quasi-stable structures existing in antimony melt",
  "authors": "Artem A. Tsygankov, Bulat N. Galimzyanov, Anatolii V. Mokshin",
  "authorsParsed": [
    [
      "Tsygankov",
      "Artem A.",
      ""
    ],
    [
      "Galimzyanov",
      "Bulat N.",
      ""
    ],
    [
      "Mokshin",
      "Anatolii V.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 26 Dec 2024 11:30:38 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735212638000,
  "abstract": "  Equilibrium antimony melt near the melting temperature is characterised by\nstructural features that are not present in simple single-component liquids.\nThe cause of these features may be long-lived structural formations that are\nnot yet fully understood. The present work provides the detailed\ncharacterization of the structures formed in liquid antimony near the melting\ntemperature based on the results of quantum chemical calculations and the\navailable neutron and X-ray diffraction data. The quasi-stable structures in\nantimony melt are detected with lifetimes exceeding the structural relaxation\ntime of this melt. These structures are characterised by a low degree of order\nand spatial localisation. It is shown for the first time that the elementary\nunits of these quasi-stable structures are triplets of atoms with\ncharacteristic lengths of $3.07$\\,\\AA~and $4.7$\\,\\AA~and characteristic angles\nof $45$ and $90$ degrees. It was found that these triplets can form chains and\npercolating clusters up to $\\sim15$\\,\\AA~in length. The characteristic lengths\nof these triplets are fully consistent with the correlation lengths associated\nwith short-range order in the antimony melt as determined by diffraction\nexperiments.\n",
  "subjects": [
    "Condensed Matter/Materials Science"
  ],
  "license": "http://creativecommons.org/publicdomain/zero/1.0/",
  "blobId": "cYwBtqk1iT-VsMspWHQO_J9_EVL-STucdIMWIUb2ZkY",
  "pdfSize": "1835357"
}