{
  "id": "2412.11257",
  "title": "Prediction-Enhanced Monte Carlo: A Machine Learning View on Control\n  Variate",
  "authors": "Fengpei Li, Haoxian Chen, Jiahe Lin, Arkin Gupta, Xiaowei Tan, Gang\n  Xu, Yuriy Nevmyvaka, Agostino Capponi, Henry Lam",
  "authorsParsed": [
    [
      "Li",
      "Fengpei",
      ""
    ],
    [
      "Chen",
      "Haoxian",
      ""
    ],
    [
      "Lin",
      "Jiahe",
      ""
    ],
    [
      "Gupta",
      "Arkin",
      ""
    ],
    [
      "Tan",
      "Xiaowei",
      ""
    ],
    [
      "Xu",
      "Gang",
      ""
    ],
    [
      "Nevmyvaka",
      "Yuriy",
      ""
    ],
    [
      "Capponi",
      "Agostino",
      ""
    ],
    [
      "Lam",
      "Henry",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 15 Dec 2024 17:41:38 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734284498000,
  "abstract": "  Despite being an essential tool across engineering and finance, Monte Carlo\nsimulation can be computationally intensive, especially in large-scale,\npath-dependent problems that hinder straightforward parallelization. A natural\nalternative is to replace simulation with machine learning or surrogate\nprediction, though this introduces challenges in understanding the resulting\nerrors.We introduce a Prediction-Enhanced Monte Carlo (PEMC) framework where we\nleverage machine learning prediction as control variates, thus maintaining\nunbiased evaluations instead of the direct use of ML predictors. Traditional\ncontrol variate methods require knowledge of means and focus on per-sample\nvariance reduction. In contrast, PEMC aims at overall cost-aware variance\nreduction, eliminating the need for mean knowledge. PEMC leverages pre-trained\nneural architectures to construct effective control variates and replaces\ncomputationally expensive sample-path generation with efficient neural network\nevaluations. This allows PEMC to address scenarios where no good control\nvariates are known. We showcase the efficacy of PEMC through two\nproduction-grade exotic option-pricing problems: swaption pricing in HJM model\nand the variance swap pricing in a stochastic local volatility model.\n",
  "subjects": [
    "Statistics/Machine Learning",
    "Computer Science/Computational Engineering, Finance, and Science",
    "Computer Science/Machine Learning",
    "Quantitative Finance/Pricing of Securities"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Z4Jov3NawpU4MPisMNmI-ZmybLygJE55nUFXTFOL-90",
  "pdfSize": "1424012"
}