{"id":"2412.04213","title":"Physics-informed Deep Learning for Muscle Force Prediction with\n  Unlabeled sEMG Signals","authors":"Shuhao Ma, Jie Zhang, Chaoyang Shi, Pei Di, Ian D.Robertson and\n  Zhi-Qiang Zhang","authorsParsed":[["Ma","Shuhao",""],["Zhang","Jie",""],["Shi","Chaoyang",""],["Di","Pei",""],["Robertson","Ian D.",""],["Zhang","Zhi-Qiang",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 14:47:38 GMT"}],"updateDate":"2024-12-06","timestamp":1733410058000,"abstract":"  Computational biomechanical analysis plays a pivotal role in understanding\nand improving human movements and physical functions. Although physics-based\nmodeling methods can interpret the dynamic interaction between the neural drive\nto muscle dynamics and joint kinematics, they suffer from high computational\nlatency. In recent years, data-driven methods have emerged as a promising\nalternative due to their fast execution speed, but label information is still\nrequired during training, which is not easy to acquire in practice. To tackle\nthese issues, this paper presents a novel physics-informed deep learning method\nto predict muscle forces without any label information during model training.\nIn addition, the proposed method could also identify personalized muscle-tendon\nparameters. To achieve this, the Hill muscle model-based forward dynamics is\nembedded into the deep neural network as the additional loss to further\nregulate the behavior of the deep neural network. Experimental validations on\nthe wrist joint from six healthy subjects are performed, and a fully connected\nneural network (FNN) is selected to implement the proposed method. The\npredicted results of muscle forces show comparable or even lower root mean\nsquare error (RMSE) and higher coefficient of determination compared with\nbaseline methods, which have to use the labeled surface electromyography (sEMG)\nsignals, and it can also identify muscle-tendon parameters accurately,\ndemonstrating the effectiveness of the proposed physics-informed deep learning\nmethod.\n","subjects":["Computer Science/Machine Learning","Computer Science/Human-Computer Interaction","Electrical Engineering and Systems Science/Signal Processing","Physics/Biological Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"fRm2f7fcPqQyBKhq9-o90BoLoqIpuBYeDdT4ww-K7Jc","pdfSize":"5298335"}