{"id":"2412.05126","title":"Robust Computation with Intrinsic Heterogeneity","authors":"Arash Golmohammadi, Christian Tetzlaff","authorsParsed":[["Golmohammadi","Arash",""],["Tetzlaff","Christian",""]],"versions":[{"version":"v1","created":"Fri, 6 Dec 2024 15:34:58 GMT"}],"updateDate":"2024-12-09","timestamp":1733499298000,"abstract":"  Intrinsic within-type neuronal heterogeneity is a ubiquitous feature of\nbiological systems, with well-documented computational advantages. Recent works\nin machine learning have incorporated such diversities by optimizing neuronal\nparameters alongside synaptic connections and demonstrated state-of-the-art\nperformance across common benchmarks. However, this performance gain comes at\nthe cost of significantly higher computational costs, imposed by a larger\nparameter space. Furthermore, it is unclear how the neuronal parameters,\nconstrained by the biophysics of their surroundings, are globally orchestrated\nto minimize top-down errors. To address these challenges, we postulate that\nneurons are intrinsically diverse, and investigate the computational\ncapabilities of such heterogeneous neuronal parameters. Our results show that\nintrinsic heterogeneity, viewed as a fixed quenched disorder, often\nsubstantially improves performance across hundreds of temporal tasks. Notably,\nsmaller but heterogeneous networks outperform larger homogeneous networks,\ndespite consuming less data. We elucidate the underlying mechanisms driving\nthis performance boost and illustrate its applicability to both rate and\nspiking dynamics. Moreover, our findings demonstrate that heterogeneous\nnetworks are highly resilient to severe alterations in their recurrent synaptic\nhyperparameters, and even recurrent connections removal does not compromise\nperformance. The remarkable effectiveness of heterogeneous networks with small\nsizes and relaxed connectivity is particularly relevant for the neuromorphic\ncommunity, which faces challenges due to device-to-device variability.\nFurthermore, understanding the mechanism of robust computation with\nheterogeneity also benefits neuroscientists and machine learners.\n","subjects":["Computer Science/Machine Learning","Computer Science/Neural and Evolutionary Computing"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"kZgqubNdaa5SaW5wAVW4BpPREd9QWDav95qLeznH2EM","pdfSize":"5013660"}