{
  "id": "2412.16995",
  "title": "Leveraging Neural Networks to Optimize Heliostat Field Aiming Strategies\n  in Concentrating Solar Power Tower Plants",
  "authors": "Antonio Alc\\'antara, Pablo Diaz-Cachinero, Alberto\n  S\\'anchez-Gonz\\'alez, Carlos Ruiz",
  "authorsParsed": [
    [
      "Alcántara",
      "Antonio",
      ""
    ],
    [
      "Diaz-Cachinero",
      "Pablo",
      ""
    ],
    [
      "Sánchez-González",
      "Alberto",
      ""
    ],
    [
      "Ruiz",
      "Carlos",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 22 Dec 2024 12:27:47 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734870467000,
  "abstract": "  Concentrating Solar Power Tower (CSPT) plants rely on heliostat fields to\nfocus sunlight onto a central receiver. Although simple aiming strategies, such\nas directing all heliostats to the receivers equator, can maximize energy\ncollection, they often result in uneven flux distributions that lead to\nhotspots, thermal stresses, and reduced receiver lifetimes. This paper presents\na novel, data-driven approach that integrates constraint learning, neural\nnetwork-based surrogates, and mathematical optimization to overcome these\nchallenges. The methodology learns complex heliostat-to-receiver flux\ninteractions from simulation data, constructing a surrogate model that is\nembedded into a tractable optimization framework. By maximizing a tailored\nquality score that balances energy collection and flux uniformity, the approach\nyields smoothly distributed flux profiles and mitigates excessive thermal\npeaks. An iterative refinement process, guided by the trust region and\nprogressive data sampling, ensures the surrogate model improves the obtained\nsolution by exploring new spaces during the iterations. Results from a real\nCSPT case study demonstrate that the proposed approach surpasses conventional\nheuristic methods, offering flatter flux distributions and safer thermal\nconditions without a substantial loss in overall energy capture.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Systems and Control",
    "Computer Science/Systems and Control",
    "Mathematics/Optimization and Control"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "RtYj7RPc83IVDG-UA5u5cPYQWMQLYWbr506Ya5nw0W0",
  "pdfSize": "3091360"
}