{"id":"2412.16171","title":"Bulk and surface Dirac states accompanied by two superconducting domes\n  in FeSe-based superconductors","authors":"Qiang Hou, Wei Wei, Xin Zhou, Wenhui Liu, Ke Wang, Xiangzhuo Xing,\n  Yufeng Zhang, Nan Zhou, Yongqiang Pan, Yue Sun and Zhixiang Shi","authorsParsed":[["Hou","Qiang",""],["Wei","Wei",""],["Zhou","Xin",""],["Liu","Wenhui",""],["Wang","Ke",""],["Xing","Xiangzhuo",""],["Zhang","Yufeng",""],["Zhou","Nan",""],["Pan","Yongqiang",""],["Sun","Yue",""],["Shi","Zhixiang",""]],"versions":[{"version":"v1","created":"Fri, 6 Dec 2024 13:53:51 GMT"}],"updateDate":"2024-12-24","timestamp":1733493231000,"abstract":"  Recent investigations of FeSe-based superconductors have revealed the\npresence of two superconducting domes, and suggest possible distinct pairing\nmechanisms. Two superconducting domes are commonly found in unconventional\nsuperconductors and exhibit unique normal states and electronic structures. In\nthis study, we conducted electromagnetic transport measurements to establish a\ncomplete phase diagram, successfully observing the two superconducting domes in\nFeSe$_{1-x}$S$_x$ (0 $\\le x \\le$ 0.25) and FeSe$_{1-x}$Te$_x$ (0 $\\le x \\le$ 1)\nsuperconductors. The normal state resistivity on SC1 shows the strange metal\nstate, with a power exponent approximately equal to 1 ($\\rho (T)\\propto T^n$\nwith $n\\sim 1$), whereas the exponent on SC2 is less than 1. A bulk Dirac state\nobserved on SC1, completely synchronized with the strange metal behavior,\nindicating a close relationship between them. While a topological surface Dirac\nstate is witnessed on SC2, and undergoes a sign change near the pure nematic\nquantum critical point. The evolution of the Dirac states indicates that the\nappearance of the two superconducting domes may originate from the Fermi\nsurface reconstruction. Our findings highlight distinct Dirac states and normal\nstate resistivity across the two superconducting domes, providing convincing\nevidence for the existence of the two different pairing mechanisms in\nFeSe-based superconductors.\n","subjects":["Condensed Matter/Superconductivity","Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"kjJM-qp3xWTGnQjzpQlvuZp9wuonrDFoBAtXETMh7PQ","pdfSize":"3491499"}