{"id":"2412.10535","title":"On Adversarial Robustness and Out-of-Distribution Robustness of Large\n  Language Models","authors":"April Yang, Jordan Tab, Parth Shah, and Paul Kotchavong","authorsParsed":[["Yang","April",""],["Tab","Jordan",""],["Shah","Parth",""],["Kotchavong","Paul",""]],"versions":[{"version":"v1","created":"Fri, 13 Dec 2024 20:04:25 GMT"}],"updateDate":"2024-12-17","timestamp":1734120265000,"abstract":"  The increasing reliance on large language models (LLMs) for diverse\napplications necessitates a thorough understanding of their robustness to\nadversarial perturbations and out-of-distribution (OOD) inputs. In this study,\nwe investigate the correlation between adversarial robustness and OOD\nrobustness in LLMs, addressing a critical gap in robustness evaluation. By\napplying methods originally designed to improve one robustness type across both\ncontexts, we analyze their performance on adversarial and out-of-distribution\nbenchmark datasets. The input of the model consists of text samples, with the\noutput prediction evaluated in terms of accuracy, precision, recall, and F1\nscores in various natural language inference tasks.\n  Our findings highlight nuanced interactions between adversarial robustness\nand OOD robustness, with results indicating limited transferability between the\ntwo robustness types. Through targeted ablations, we evaluate how these\ncorrelations evolve with different model sizes and architectures, uncovering\nmodel-specific trends: smaller models like LLaMA2-7b exhibit neutral\ncorrelations, larger models like LLaMA2-13b show negative correlations, and\nMixtral demonstrates positive correlations, potentially due to domain-specific\nalignment. These results underscore the importance of hybrid robustness\nframeworks that integrate adversarial and OOD strategies tailored to specific\nmodels and domains. Further research is needed to evaluate these interactions\nacross larger models and varied architectures, offering a pathway to more\nreliable and generalizable LLMs.\n","subjects":["Computer Science/Computation and Language","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"exe-vi0w0wDoGS7s0hnuShCurdKVRsoITwCrrGpmb1Y","pdfSize":"491664"}