{
  "id": "2412.07389",
  "title": "Electroelastic guided wave dispersion in piezoelectric plates: spectral\n  methods and laser-ultrasound experiments",
  "authors": "Daniel A. Kiefer, Georg Watzl, Katharina Burgholzer, Martin Ryzy and\n  Clemens Gr\\\"unsteidl",
  "authorsParsed": [
    [
      "Kiefer",
      "Daniel A.",
      ""
    ],
    [
      "Watzl",
      "Georg",
      ""
    ],
    [
      "Burgholzer",
      "Katharina",
      ""
    ],
    [
      "Ryzy",
      "Martin",
      ""
    ],
    [
      "Grünsteidl",
      "Clemens",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 10:32:34 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733826754000,
  "abstract": "  Electroelastic waves in piezoelectric media are widely used in sensing and\nfiltering applications. Despite extensive research, computing the guided wave\ndispersion remains challenging. This paper presents semi-analytical approaches\nbased on spectral methods to efficiently and reliably compute dispersion\ncurves. We systematically assess the impact of electrical boundary conditions\non a 128{\\deg} Y-cut LiNbO3 wafer, examining open-open, open-shorted and\nshorted-shorted surfaces configurations. Multi-modal dispersion maps obtained\nfrom laser-ultrasonic experiments for each boundary condition exhibit excellent\nagreement with the computational predictions. A straightforward implementation\nof the spectral collocation method is made available as \"GEW piezo plate\"\n(https://doi.org/10.5281/zenodo.14205789), while the spectral element method\nwill be integrated to \"GEWtool\" (http://doi.org/10.5281/zenodo.10114243).\nTherewith, we aim to make advanced semi-analytical techniques more accessible\nto physicists and engineers relying on dispersion analysis.\n",
  "subjects": [
    "Physics/Applied Physics",
    "Physics/Computational Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "T6W0NMQGd202_sJ6-csI3fMw8U91Wbg15iZQEImwjGg",
  "pdfSize": "3178553"
}