{"id":"2412.01786","title":"Hard Constraint Guided Flow Matching for Gradient-Free Generation of PDE\n  Solutions","authors":"Chaoran Cheng, Boran Han, Danielle C. Maddix, Abdul Fatir Ansari,\n  Andrew Stuart, Michael W. Mahoney, Yuyang Wang","authorsParsed":[["Cheng","Chaoran",""],["Han","Boran",""],["Maddix","Danielle C.",""],["Ansari","Abdul Fatir",""],["Stuart","Andrew",""],["Mahoney","Michael W.",""],["Wang","Yuyang",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 18:36:26 GMT"}],"updateDate":"2024-12-03","timestamp":1733164586000,"abstract":"  Generative models that satisfy hard constraints are crucial in many\nscientific and engineering applications where physical laws or system\nrequirements must be strictly respected. However, many existing constrained\ngenerative models, especially those developed for computer vision, rely heavily\non gradient information, often sparse or computationally expensive in fields\nlike partial differential equations (PDEs). In this work, we introduce a novel\nframework for adapting pre-trained, unconstrained flow-matching models to\nsatisfy constraints exactly in a zero-shot manner without requiring expensive\ngradient computations or fine-tuning. Our framework, ECI sampling, alternates\nbetween extrapolation (E), correction (C), and interpolation (I) stages during\neach iterative sampling step of flow matching sampling to ensure accurate\nintegration of constraint information while preserving the validity of the\ngeneration. We demonstrate the effectiveness of our approach across various PDE\nsystems, showing that ECI-guided generation strictly adheres to physical\nconstraints and accurately captures complex distribution shifts induced by\nthese constraints. Empirical results demonstrate that our framework\nconsistently outperforms baseline approaches in various zero-shot constrained\ngeneration tasks and also achieves competitive results in the regression tasks\nwithout additional fine-tuning.\n","subjects":["Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"zubd5nJ9MPjPSEUNgiYkYSOGMYxfQMkaer3bA504gpc","pdfSize":"19745907"}