{
  "id": "2412.14422",
  "title": "Enhancing Diffusion Models for High-Quality Image Generation",
  "authors": "Jaineet Shah, Michael Gromis, and Rickston Pinto",
  "authorsParsed": [
    [
      "Shah",
      "Jaineet",
      ""
    ],
    [
      "Gromis",
      "Michael",
      ""
    ],
    [
      "Pinto",
      "Rickston",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 00:23:15 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734567795000,
  "abstract": "  This report presents the comprehensive implementation, evaluation, and\noptimization of Denoising Diffusion Probabilistic Models (DDPMs) and Denoising\nDiffusion Implicit Models (DDIMs), which are state-of-the-art generative\nmodels. During inference, these models take random noise as input and\niteratively generate high-quality images as output. The study focuses on\nenhancing their generative capabilities by incorporating advanced techniques\nsuch as Classifier-Free Guidance (CFG), Latent Diffusion Models with\nVariational Autoencoders (VAE), and alternative noise scheduling strategies.\nThe motivation behind this work is the growing demand for efficient and\nscalable generative AI models that can produce realistic images across diverse\ndatasets, addressing challenges in applications such as art creation, image\nsynthesis, and data augmentation. Evaluations were conducted on datasets\nincluding CIFAR-10 and ImageNet-100, with a focus on improving inference speed,\ncomputational efficiency, and image quality metrics like Frechet Inception\nDistance (FID). Results demonstrate that DDIM + CFG achieves faster inference\nand superior image quality. Challenges with VAE and noise scheduling are also\nhighlighted, suggesting opportunities for future optimization. This work lays\nthe groundwork for developing scalable, efficient, and high-quality generative\nAI systems to benefit industries ranging from entertainment to robotics.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "wGDdncFCq6fx6i2UIB3d_5XazLcXGBrsRKKGC_WGO0A",
  "pdfSize": "3755613"
}