{
  "id": "2412.05453",
  "title": "Knowledge Graphs are all you need: Leveraging KGs in Physics Question\n  Answering",
  "authors": "Krishnasai Addala, Kabir Dev Paul Baghel, Dhruv Jain, Chhavi Kirtani,\n  Avinash Anand, Rajiv Ratn Shah",
  "authorsParsed": [
    [
      "Addala",
      "Krishnasai",
      ""
    ],
    [
      "Baghel",
      "Kabir Dev Paul",
      ""
    ],
    [
      "Jain",
      "Dhruv",
      ""
    ],
    [
      "Kirtani",
      "Chhavi",
      ""
    ],
    [
      "Anand",
      "Avinash",
      ""
    ],
    [
      "Shah",
      "Rajiv Ratn",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 22:25:23 GMT"
    },
    {
      "version": "v2",
      "created": "Mon, 23 Dec 2024 20:40:52 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1733523923000,
  "abstract": "  This study explores the effectiveness of using knowledge graphs generated by\nlarge language models to decompose high school-level physics questions into\nsub-questions. We introduce a pipeline aimed at enhancing model response\nquality for Question Answering tasks. By employing LLMs to construct knowledge\ngraphs that capture the internal logic of the questions, these graphs then\nguide the generation of subquestions. We hypothesize that this method yields\nsub-questions that are more logically consistent with the original questions\ncompared to traditional decomposition techniques. Our results show that\nsub-questions derived from knowledge graphs exhibit significantly improved\nfidelity to the original question's logic. This approach not only enhances the\nlearning experience by providing clearer and more contextually appropriate\nsub-questions but also highlights the potential of LLMs to transform\neducational methodologies. The findings indicate a promising direction for\napplying AI to improve the quality and effectiveness of educational content.\n",
  "subjects": [
    "Computer Science/Computation and Language"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "g_1vR2ph64rUgYsaAqoaEQUYmP9WbEW5MqdvB0T0who",
  "pdfSize": "395138"
}