{
  "id": "2412.18309",
  "title": "Simple Quantum Gradient Descent Without Coherent Oracle Access",
  "authors": "Nhat A. Nghiem",
  "authorsParsed": [
    [
      "Nghiem",
      "Nhat A.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 24 Dec 2024 09:48:38 GMT"
    },
    {
      "version": "v2",
      "created": "Mon, 24 Feb 2025 09:40:17 GMT"
    }
  ],
  "updateDate": "2025-02-25",
  "timestamp": 1735033718000,
  "abstract": "  The gradient descent method aims at finding local minima of a given\nmultivariate function by moving along the direction of its gradient, and hence,\nthe algorithm typically involves computing all partial derivatives of a given\nfunction, before updating the solution iteratively. In the work of Rebentrost\net al. [New Journal of Physics, 21(7):073023, 2019], the authors translated the\niterative optimization algorithm into a quantum setting, with some assumptions\nregarding certain structure of the given function, with oracle or black-box\naccess to some matrix that specifies the structure. Here, we develop an\nalternative quantum framework for the gradient descent problem, based on the\nseminal quantum singular value transformation framework. We show that given\nonly classical information of function of interest, it is possible to construct\na quantum gradient descent algorithm with a running time logarithmical in the\nnumber of variables. In particular, our framework consumes exponentially less\nqubits than the prior quantum gradient descent algorithm and removes the need\nfor any coherent oracle access to classical information. Thus, our work\nprovides another example demonstrating the power of quantum singular value\ntransformation framework, and in particular, it adds another instance revealing\nthat quantum coherent access is not necessary for quantum computational\nadvantage.\n",
  "subjects": [
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "SUrLYKXX-i3DZA3ujYfxdd4n0QkAaWAglgYAKqrzIxA",
  "pdfSize": "433360"
}