{
  "id": "2412.11208",
  "title": "Point Cloud Deep Learning Methods for Particle Shower Reconstruction in\n  the DHCAL",
  "authors": "Maryna Borysova, Shikma Bressler, Eilam Gross, Nilotpal Kakati and\n  Darina Zavazieva",
  "authorsParsed": [
    [
      "Borysova",
      "Maryna",
      ""
    ],
    [
      "Bressler",
      "Shikma",
      ""
    ],
    [
      "Gross",
      "Eilam",
      ""
    ],
    [
      "Kakati",
      "Nilotpal",
      ""
    ],
    [
      "Zavazieva",
      "Darina",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 15 Dec 2024 14:58:17 GMT"
    },
    {
      "version": "v2",
      "created": "Sun, 9 Feb 2025 21:08:49 GMT"
    }
  ],
  "updateDate": "2025-02-11",
  "timestamp": 1734274697000,
  "abstract": "  Precision measurement of hadronic final states presents complex experimental\nchallenges. The study explores the concept of a gaseous Digital Hadronic\nCalorimeter (DHCAL) and discusses the potential benefits of employing Graph\nNeural Network (GNN) methods for future collider experiments. In particular, we\nuse GNN to describe calorimeter clusters as point clouds or a collection of\ndata points representing a three-dimensional object in space. Combined with\nGraph Attention Transformers (GATs) and DeepSets algorithms, this results in an\nimprovement over existing baseline techniques for particle identification and\nenergy resolution. We discuss the challenges encountered in implementing GNN\nmethods for energy measurement in digital calorimeters, e.g., the large variety\nof hadronic shower shapes and the hyper-parameter optimization. We also discuss\nthe dependency of the measured performance on the angle of the incoming\nparticle and on the detector granularity. Finally, we highlight potential\nfuture directions and applications of these techniques.\n",
  "subjects": [
    "Physics/High Energy Physics - Phenomenology"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "dIShwmGa_QNSwiBCs9iOZZfJyFqChTO23Ht8Qtf9oTc",
  "pdfSize": "767695"
}