{"id":"2412.18722","title":"Photoreforming of plastic waste into valuable products and hydrogen\n  using a high-entropy oxynitride with distorted atomic-scale structure","authors":"Ho Truong Nam Hai, Thanh Tam Nguyen, Maiko Nishibori, Tatsumi\n  Ishihara, Kaveh Edalati","authorsParsed":[["Hai","Ho Truong Nam",""],["Nguyen","Thanh Tam",""],["Nishibori","Maiko",""],["Ishihara","Tatsumi",""],["Edalati","Kaveh",""]],"versions":[{"version":"v1","created":"Wed, 25 Dec 2024 00:49:39 GMT"}],"updateDate":"2024-12-30","timestamp":1735087779000,"abstract":"  The persistent existence of plastic waste causes serious problems for the\nenvironment, directly and indirectly affecting the health of organisms and\nhumans. Photoreforming is a nature-friendly method that only uses solar energy\nto convert plastic waste into green hydrogen (H2) and valuable organic\nproducts. This study shows that a high-entropy oxynitride (HEON) photocatalyst,\nsynthesized by the addition of nitrogen to a Ti-Zr-Hf-Nb-Ta-containing\nhigh-entropy oxide (HEO), exhibits a higher potential for the production of H2,\nformic acid and acetic acid from polyethylene terephthalate (PET)\nphotoreforming compared to the relevant HEO. Examination of X-ray absorption\nnear edge structure (XANES) and extended X-ray absorption fine structure\n(EXAFS) by synchrotron light shows that, in addition to hybridization of 2p\norbitals from oxygen and nitrogen, nitrogen atoms distort the structure and\ncompletely change the neighborhood of niobium and titanium (a main contributor\nto the conduction band), expands the atomic bonds of zirconium and tantalum,\ncontracts the atomic bonds of hafnium and decreases the binding energy of\ntitanium, niobium and tantalum. These electronic structure changes lead to a\nnarrower bandgap and diminished electron-hole recombination, enhancing the\nphotoreforming performance. This study introduces HEONs with distorted atomic\nbond structures as efficient low-bandgap and stable catalysts for transforming\nplastics into high-value organic chemicals and H2 by photocatalysis.\n","subjects":["Condensed Matter/Materials Science","Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"tWSwyPJUUQx_CeMUcLiu6WtdaE6N4dbHS1atrdWnWXs","pdfSize":"2715238"}