{
  "id": "2412.02751",
  "title": "GA-NIFS: The highly overdense system BR1202-0725 at z $\\sim$ 4.7. A\n  double AGN with fast outflows plus eight companion galaxies",
  "authors": "S. Zamora, Giacomo Venturi, Stefano Carniani, Elena Bertola, Eleonora\n  Parlanti, Michele Perna, Santiago Arribas, Torsten B\\\"oker, Andrew J. Bunker,\n  St\\'ephane Charlot, Francesco D'Eugenio, Roberto Maiolino, Bruno Rodr\\'iguez\n  Del Pino, Hannah \\\"Ubler, Giovanni Cresci, Gareth C. Jones, Isabella Lamperti",
  "authorsParsed": [
    [
      "Zamora",
      "S.",
      ""
    ],
    [
      "Venturi",
      "Giacomo",
      ""
    ],
    [
      "Carniani",
      "Stefano",
      ""
    ],
    [
      "Bertola",
      "Elena",
      ""
    ],
    [
      "Parlanti",
      "Eleonora",
      ""
    ],
    [
      "Perna",
      "Michele",
      ""
    ],
    [
      "Arribas",
      "Santiago",
      ""
    ],
    [
      "Böker",
      "Torsten",
      ""
    ],
    [
      "Bunker",
      "Andrew J.",
      ""
    ],
    [
      "Charlot",
      "Stéphane",
      ""
    ],
    [
      "D'Eugenio",
      "Francesco",
      ""
    ],
    [
      "Maiolino",
      "Roberto",
      ""
    ],
    [
      "Del Pino",
      "Bruno Rodríguez",
      ""
    ],
    [
      "Übler",
      "Hannah",
      ""
    ],
    [
      "Cresci",
      "Giovanni",
      ""
    ],
    [
      "Jones",
      "Gareth C.",
      ""
    ],
    [
      "Lamperti",
      "Isabella",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 19:00:02 GMT"
    }
  ],
  "updateDate": "2024-12-05",
  "timestamp": 1733252402000,
  "abstract": "  Distant quasars (QSOs) in galaxy overdensities are considered key actors in\nthe evolution of the early Universe. In this work, we studied the kinematic and\nphysical properties of the BR1202-0725 system at z=4.7, one of the most\noverdense fields known in the early Universe, consisting of a QSO, a\nsubmillimeter galaxy (SMG), and three Lyman-$\\alpha$ emitters. We used data\nfrom the JWST/NIRSpec Integral Field Unit (IFU) to analyze the rest-frame\noptical emission of each source in the system. We estimated a bolometric\nluminosity of log($L_{\\rm bol}/$[erg/s]) = 47.2 $\\pm$ 0.4 and a black hole mass\nof log($M_{\\rm BH}/M_\\odot$) = 10.1 $\\pm$ 0.5 for the QSO, which are consistent\nwith previous measurements obtained with ground-based observations. The NIRSpec\nspectra of the SMG revealed instead unexpected [OIII] and H$\\alpha$+[NII]\nprofiles. The overall [OIII] line profile is blue-shifted by more than 700 km/s\nrelative to the systemic velocity of the galaxy. Additionally, both the [OIII]\nand H$\\alpha$+[NII] lines show prominent broad (1300 km/s), blueshifted wings\nassociated with outflowing ionized gas. The analysis of NIRSpec and X-ray\nobservations indicates that the SMG likely hosts an accreting supermassive\nblack hole as supported by the following results: (i) the excitation diagnostic\ndiagram is consistent with ionization from an active galactic nucleus (AGN);\n(ii) the X-ray luminosity is higher than $10^{44}$ erg/s; and (iii) it hosts a\nfast outflow ($v_{\\rm out}$ = 5000 km/s), comparable to those observed in\nluminous QSOs. Therefore, the QSO-SMG pair represents one of the\nhighest-redshift double AGN to date, with a projected separation of 24 kpc.\nFinally, we investigated the environment of this system and found four new\ngalaxies at the same redshift of the QSO and within a projected distance of 5\nkpc from it. This overdense system includes at least ten galaxies in only 980\nkpc$^2$.\n",
  "subjects": [
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "2oXReF9lYVC-uj33CVHRprGNpmEkXzmws65oEWzi9hQ",
  "pdfSize": "11633837"
}