{
  "id": "2412.09109",
  "title": "evS2CP: Real-time Simultaneous Speed and Charging Planner for Connected\n  Electric Vehicles",
  "authors": "Minwoo Gwon, Jiwon Kim, Seungjun Yoo, Kwang-Ki K. Kim",
  "authorsParsed": [
    [
      "Gwon",
      "Minwoo",
      ""
    ],
    [
      "Kim",
      "Jiwon",
      ""
    ],
    [
      "Yoo",
      "Seungjun",
      ""
    ],
    [
      "Kim",
      "Kwang-Ki K.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 09:41:07 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1733996467000,
  "abstract": "  This paper presents evS2CP, an optimization-based framework for simultaneous\nspeed and charging planning designed for connected electric vehicles (EVs).\nWith EVs emerging as competitive alternatives to internal combustion engine\nvehicles, overcoming challenges such as limited charging infrastructure is\ncrucial. evS2CP addresses these issues by minimizing the travel time, charging\ntime, and energy consumption, providing practical solutions for both\nhuman-operated and autonomous vehicles. This framework leverages V2X\ncommunication to integrate essential EV planning data, including route\ngeometry, real-time traffic conditions, and charging station availability,\nwhile simulating dynamic driving environments using open-web API services. The\nspeed and charging planning problem was initially formulated as a nonlinear\nprogramming model, which was then convexified into a quadratic programming\nmodel without charging-stop constraints. Additionally, a mixed-integer\nprogramming approach was employed to optimize charging station selection and\nminimize the frequency of charging events. A mixed-integer quadratic\nprogramming implementation exhibited exceptional computational efficiency and\nscalability, effectively solving trip plans over distances exceeding 700 km in\na few seconds. Simulations conducted using open-source and commercial solvers\nvalidated the framework's near-global optimality, demonstrating its robustness\nand feasibility for real-world applications in connected EV ecosystems.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Systems and Control",
    "Computer Science/Computational Engineering, Finance, and Science",
    "Computer Science/Systems and Control",
    "Mathematics/Optimization and Control"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "1YbwlU5Wc1LzADNEVoGHUnzgeSdcndKTv-YPMuG9BTg",
  "pdfSize": "2431022"
}