{"id":"2412.11367","title":"Minor-merger induced star formation rejuvenation in an elliptical\n  radio-loud quasar host, 3C 59","authors":"Yijun Wang (1), Tao Wang (1), Ke Xu (1), Junjie Mao (2), Yerong Xu (3\n  and 4), and Zheng Zhou (5) ((1) Nanjing University, (2) Tsinghua University,\n  (3) Saint Mary's University, (4) INAF, (5) Xiamen University)","authorsParsed":[["Wang","Yijun","","3\n  and 4"],["Wang","Tao","","3\n  and 4"],["Xu","Ke","","3\n  and 4"],["Mao","Junjie","","3\n  and 4"],["Xu","Yerong","","3\n  and 4"],["Zhou","Zheng",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 01:48:38 GMT"}],"updateDate":"2024-12-17","timestamp":1734313718000,"abstract":"  We report a rare case where an elliptical radio-loud quasar host, 3C 59,\nrejuvenates star formation activity through minor mergers with its nearby\nsatellite galaxies. The inferred star formation history of 3C 59 shows\nsignificant star formation rejuvenation within the past 500 Myr, before which\nremains rather quiescent for most of the cosmic time. Three nearest satellite\ngalaxies of 3C 59 exhibit significant morphological disturbances, and two of\nthem present strong tidal tails pointing towards 3C 59. In addition, all the\nsatellite galaxies within a projected distance of 200 kpc show low star\nformation activities. They also have systematically lower effective radius\n($R_{\\rm e}$) than local late-type galaxies, while 3C 59 has significantly\nlarger $R_{\\rm e}$ than both early- and late-type galaxies. All these features\nsuggest that ongoing minor mergers between 3C 59 and its nearby satellites\ncould be causing gas to flow into 3C 59, which induces the star formation\nrejuvenation, and possibly also triggers the quasar activity. The enormous\npower from the large-scale radio jet of 3C 59 may in turn help keep the halo\nhot, prevent gas cooling, and further reduce star formation in its satellite\ngalaxies. These results provide important insights into the mass and size\ngrowth of central galaxies and star formation quenching of satellite galaxies\nin galaxy groups.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"5fQ3eH4NmJPqN3QKzTPwe6PPROU6ZOY8dwsPDqy8QsM","pdfSize":"27911441"}