{
  "id": "2412.11651",
  "title": "A New Sampling Method Base on Sequential Tests with Fixed Sample Size\n  Upper Limit",
  "authors": "Dihong Huang",
  "authorsParsed": [
    [
      "Huang",
      "Dihong",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 10:51:32 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734346292000,
  "abstract": "  Sequential inspection is a technique employed to monitor product quality\nduring the production process. For smaller batch sizes, the Acceptable Quality\nLimit(AQL) inspection theory is typically applied, whereas for larger batch\nsizes, the Poisson distribution is commonly utilized to determine the sample\nsize and rejection thresholds. However, due to the fact that the rate of\ndefective products is usually low in actual production, using these methods\noften requires more samples to draw conclusions, resulting in higher inspection\ntime. Based on this, this paper proposes a sequential inspection method with a\nfixed upper limit of sample size. This approach not only incorporates the\nPoisson distribution algorithm, allowing for rapid calculation of sample size\nand rejection thresholds to facilitate planning, but also adapts the concept of\nsequential inspection to dynamically modify the sampling plan and\ndecision-making process. This method aims to decrease the number of samples\nrequired while preserving the inspection's efficacy. Finally, this paper shows\nthrough Monte Carlo simulation that compared with the traditional Poisson\ndistribution algorithm, the sequential test method with a fixed sample size\nupper limit significantly reduces the number of samples compared to the\ntraditional Poisson distribution algorithm, while maintaining effective\ninspection outcomes.\n",
  "subjects": [
    "Statistics/Methodology"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "ibqaY4GdUoKj_owrsO8615XGdn-BzScI81tjMmkUHW4",
  "pdfSize": "698059"
}