{"id":"2412.11550","title":"THESAURUS: Contrastive Graph Clustering by Swapping Fused\n  Gromov-Wasserstein Couplings","authors":"Bowen Deng, Tong Wang, Lele Fu, Sheng Huang, Chuan Chen, Tao Zhang","authorsParsed":[["Deng","Bowen",""],["Wang","Tong",""],["Fu","Lele",""],["Huang","Sheng",""],["Chen","Chuan",""],["Zhang","Tao",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 08:33:56 GMT"},{"version":"v2","created":"Thu, 19 Dec 2024 03:00:59 GMT"},{"version":"v3","created":"Fri, 14 Feb 2025 03:40:30 GMT"}],"updateDate":"2025-02-17","timestamp":1734338036000,"abstract":"  Graph node clustering is a fundamental unsupervised task. Existing methods\ntypically train an encoder through selfsupervised learning and then apply\nK-means to the encoder output. Some methods use this clustering result directly\nas the final assignment, while others initialize centroids based on this\ninitial clustering and then finetune both the encoder and these learnable\ncentroids. However, due to their reliance on K-means, these methods inherit its\ndrawbacks when the cluster separability of encoder output is low, facing\nchallenges from the Uniform Effect and Cluster Assimilation. We summarize three\nreasons for the low cluster separability in existing methods: (1) lack of\ncontextual information prevents discrimination between similar nodes from\ndifferent clusters; (2) training tasks are not sufficiently aligned with the\ndownstream clustering task; (3) the cluster information in the graph structure\nis not appropriately exploited. To address these issues, we propose conTrastive\ngrapH clustEring by SwApping fUsed gRomov-wasserstein coUplingS (THESAURUS).\nOur method introduces semantic prototypes to provide contextual information,\nand employs a cross-view assignment prediction pretext task that aligns well\nwith the downstream clustering task. Additionally, it utilizes\nGromov-Wasserstein Optimal Transport (GW-OT) along with the proposed prototype\ngraph to thoroughly exploit cluster information in the graph structure. To\nadapt to diverse real-world data, THESAURUS updates the prototype graph and the\nprototype marginal distribution in OT by using momentum. Extensive experiments\ndemonstrate that THESAURUS achieves higher cluster separability than the prior\nart, effectively mitigating the Uniform Effect and Cluster Assimilation issues\n","subjects":["Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"L3gE66XDc01xBpnC1EIhukL9tAUFOCWhogTYu-1RqSU","pdfSize":"2405362"}