{
  "id": "2412.19143",
  "title": "LibAFL-DiFuzz: Advanced Architecture Enabling Directed Fuzzing",
  "authors": "Darya Parygina, Timofey Mezhuev, and Daniil Kuts",
  "authorsParsed": [
    [
      "Parygina",
      "Darya",
      ""
    ],
    [
      "Mezhuev",
      "Timofey",
      ""
    ],
    [
      "Kuts",
      "Daniil",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 26 Dec 2024 09:54:57 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735206897000,
  "abstract": "  Directed fuzzing performs best for targeted program testing via estimating\nthe impact of each input in reaching predefined program points. But due to\ninsufficient analysis of the program structure and lack of flexibility and\nconfigurability it can lose efficiency. In this paper, we enhance directed\nfuzzing with context weights for graph nodes and resolve indirect edges during\ncall graph construction. We construct flexible tool for directed fuzzing with\ncomponents able to be easily combined with other techniques. We implement\nproposed method in three separate modules: DiFuzzLLVM library for graph\nconstruction and indirect calls resolving, DiFuzz static analysis tool for\nprocessing program graphs and computing proximity metrics, and LibAFL-DiFuzz\ndirected fuzzer based on LibAFL fuzzing library. We create additional LibAFL\nmodules for enabling custom power scheduling and static instrumentation. We\nevaluate indirect calls resolving and get increase in directed fuzzing\nefficiency for reaching deeper target points. We evaluate context weights\ncontribution and get benefits in TTE and scheduling iterations number. We\nevaluate our fuzzer in comparison with AFLGo and BEACON, and reveal speedup in\ntime to exposure on several benchmarks. Furthermore, our tool implements some\nimportant usability features that are not available in mentioned tools: target\npoints detection, multiple target points support, etc.\n",
  "subjects": [
    "Computer Science/Cryptography and Security"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "NhzXwS2JhfFpdfqWaL-7uXioA5DdFxfv9DMZICah6Is",
  "pdfSize": "713542"
}