{
  "id": "2412.03649",
  "title": "A Unified Model of Cosmic Ray Propagation and Radio Extreme Scattering\n  Events from Intermittent Interstellar Structures",
  "authors": "Philipp Kempski, Dongzi Li, Drummond B. Fielding, Eliot Quataert, E.\n  Sterl Phinney, Matthew W. Kunz, Dylan L. Jow, Alexander A. Philippov",
  "authorsParsed": [
    [
      "Kempski",
      "Philipp",
      ""
    ],
    [
      "Li",
      "Dongzi",
      ""
    ],
    [
      "Fielding",
      "Drummond B.",
      ""
    ],
    [
      "Quataert",
      "Eliot",
      ""
    ],
    [
      "Phinney",
      "E. Sterl",
      ""
    ],
    [
      "Kunz",
      "Matthew W.",
      ""
    ],
    [
      "Jow",
      "Dylan L.",
      ""
    ],
    [
      "Philippov",
      "Alexander A.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 19:00:01 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733338801000,
  "abstract": "  Intermittent magnetic structures are a plausible candidate for explaining\ncosmic-ray (CR) diffusion rates derived from observed CR energy spectra.\nIndependently, studies of extreme scattering events (ESEs) of radio quasars and\npulsar scintillation have hinted that very straight, large-aspect-ratio,\nmagnetic current sheets may be responsible for the localized large scattering\nof radio waves. The required shortest axis of the typical structures producing\nESEs is of the same scale ($\\sim$AU) as the gyroradii of $\\sim$GeV CRs. In this\npaper, we propose that the same magnetic/density sheets can produce large\nscattering of both CRs and radio waves. We demonstrate that the geometry and\nvolume filling factor of the sheets derived from quasar ESEs can explain the\nobserved mean free path of GeV CRs without introducing free parameters. The\nmodel places constraints on the sheet geometry, such as straightness and large\naspect ratio, and assumes the statistics of the sheets are similar throughout\nthe Galactic volume. We, therefore, discuss observational tests of the sheet\nmodel, which includes observations of echoes in pulsars and fast radio bursts,\ngravitationally lensed quasars, the distribution of ESE durations, and spatial\ncorrelations between ESE events and rotation-measure fluctuations. Such tests\nwill be enabled by upcoming wide-field radio instruments, including Canadian\nHydrogen Observatory and Radio-transient Detector (CHORD) and Deep Synoptic\nArray 2000 Antennas (DSA-2000).\n",
  "subjects": [
    "Astrophysics/High Energy Astrophysical Phenomena",
    "Astrophysics/Astrophysics of Galaxies",
    "Physics/Plasma Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "XwE5kdG7LMoAIuoj0jZL2o-kVa3QFm9oTbrL3JbxpHk",
  "pdfSize": "6008577"
}