{
  "id": "2412.04229",
  "title": "Optimal Low-Thrust Orbit Transfers Connecting Gateway with Earth and\n  Moon",
  "authors": "Chiara Pozzi, Mauro Pontani, Alessandro Beolchi, Elena Fantino",
  "authorsParsed": [
    [
      "Pozzi",
      "Chiara",
      ""
    ],
    [
      "Pontani",
      "Mauro",
      ""
    ],
    [
      "Beolchi",
      "Alessandro",
      ""
    ],
    [
      "Fantino",
      "Elena",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 15:06:36 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733411196000,
  "abstract": "  Gateway will represent a primary logistic infrastructure in cislunar space.\nThe identification of efficient orbit transfers capable of connecting Earth,\nMoon, and Gateway paves the way for enabling refurbishment, servicing, and\nutilization of this orbiting platform. This study is devoted to determining\ntwo-way minimum-time low-thrust orbit transfers that connect both Earth and\nMoon to Gateway. Backward time propagation is proposed as a very convenient\noption for trajectories that approach and rendezvous with Gateway, and a\nunified formulation is introduced for minimum-time orbit transfers, using\neither forward or backward propagation. Two-way transfers between Gateway and a\nspecified low-altitude lunar orbit are first determined, using an indirect\nheuristic method, which employs the necessary conditions for optimality and a\nheuristic algorithm. Second, two-way orbit transfers that connect Earth and\nGateway are addressed. Because these trajectories exist under the influence of\ntwo major attracting bodies, the underlying optimal control problem is\nformulated as a multi-arc trajectory optimization problem, involving three\ndifferent representations for the spacecraft state. Multi-arc optimal control\nproblems are associated with several corner conditions to be enforced at the\njunction time that separates distinct arcs. However, these conditions are shown\nto be solvable sequentially for the problem at hand, leveraging implicit\ncostate transformation. This implies that the multi-arc problem has a set of\nunknown quantities with the same size as that of a single-arc optimal control\nproblem, with apparent advantages of computational nature. The indirect\nheuristic method is also applied in this second mission scenario.\n",
  "subjects": [
    "Mathematics/Optimization and Control",
    "Mathematics/Dynamical Systems"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "KTSPb60tsXAID1XbgN2RryG_nIcNL_qTQB7YWYrDYlY",
  "pdfSize": "7267655"
}