{"id":"2412.13959","title":"A path-specific effect approach to mediation analysis with time-varying\n  mediators and time-to-event outcomes accounting for competing risks","authors":"Arce Domingo-Relloso, Yuchen Zhang, Ziqing Wang, Astrid M Suchy-Dicey,\n  Dedra S Buchwald, Ana Navas-Acien, Joel Schwartz, Kiros Berhane, Brent A\n  Coull, Linda Valeri","authorsParsed":[["Domingo-Relloso","Arce",""],["Zhang","Yuchen",""],["Wang","Ziqing",""],["Suchy-Dicey","Astrid M",""],["Buchwald","Dedra S",""],["Navas-Acien","Ana",""],["Schwartz","Joel",""],["Berhane","Kiros",""],["Coull","Brent A",""],["Valeri","Linda",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 15:39:41 GMT"}],"updateDate":"2024-12-19","timestamp":1734536381000,"abstract":"  Not accounting for competing events in survival analysis can lead to biased\nestimates, as individuals who die from other causes do not have the opportunity\nto develop the event of interest. Formal definitions and considerations for\ncausal effects in the presence of competing risks have been published, but not\nfor the mediation analysis setting. We propose, for the first time, an approach\nbased on the path-specific effects framework to account for competing risks in\nlongitudinal mediation analysis with time-to-event outcomes. We do so by\nconsidering the pathway through the competing event as another mediator, which\nis nested within our longitudinal mediator of interest. We provide a\ntheoretical formulation and related definitions of the effects of interest\nbased on the mediational g-formula, as well as a detailed description of the\nalgorithm. We also present an application of our algorithm to data from the\nStrong Heart Study, a prospective cohort of American Indian adults. In this\napplication, we evaluated the mediating role of the blood pressure trajectory\n(measured during three visits) on the association between arsenic and cadmium,\nin separate models, with time to cardiovascular disease, accounting for\ncompeting risks by death. Identifying the effects through different paths\nenables us to evaluate the impact of metals on the outcome of interest, as well\nas through competing risks, more transparently.\n","subjects":["Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"Is5x5aU2LMf5nsUT4r3NlYgaUI6Q7ozJtShmqESs2bE","pdfSize":"642096"}