{"id":"2412.01865","title":"Enhancing Brain Age Estimation with a Multimodal 3D CNN Approach\n  Combining Structural MRI and AI-Synthesized Cerebral Blood Volume Data","authors":"Jordan Jomsky, Zongyu Li, Yiren Zhang, Tal Nuriel, Jia Guo","authorsParsed":[["Jomsky","Jordan",""],["Li","Zongyu",""],["Zhang","Yiren",""],["Nuriel","Tal",""],["Guo","Jia",""]],"versions":[{"version":"v1","created":"Sun, 1 Dec 2024 21:54:08 GMT"},{"version":"v2","created":"Fri, 13 Dec 2024 21:29:35 GMT"},{"version":"v3","created":"Mon, 27 Jan 2025 17:24:51 GMT"}],"updateDate":"2025-01-28","timestamp":1733090048000,"abstract":"  The increasing global aging population necessitates improved methods to\nassess brain aging and its related neurodegenerative changes. Brain Age Gap\nEstimation (BrainAGE) offers a neuroimaging biomarker for understanding these\nchanges by predicting brain age from MRI scans. Current approaches primarily\nuse T1-weighted magnetic resonance imaging (T1w MRI) data, capturing only\nstructural brain information. To address this limitation, AI-generated Cerebral\nBlood Volume (AICBV) data, synthesized from non-contrast MRI scans, offers\nfunctional insights by revealing subtle blood-tissue contrasts otherwise\nundetectable in standard imaging. We integrated AICBV with T1w MRI to predict\nbrain age, combining both structural and functional metrics. We developed a\ndeep learning model using a VGG-based architecture for both modalities and\ncombined their predictions using linear regression. Our model achieved a mean\nabsolute error (MAE) of 3.95 years and an $R^2$ of 0.943 on the test set ($n =\n288$), outperforming existing models trained on similar data. We have further\ncreated gradient-based class activation maps (Grad-CAM) to visualize the\nregions of the brain that most influenced the model's predictions, providing\ninterpretable insights into the structural and functional contributors to brain\naging.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"pZw45i5DbUYmF7Lq9zu1pPCXqr0Au3YHpHLVRowN7WM","pdfSize":"5180890"}