{
  "id": "2412.10506",
  "title": "Dense gas scaling relations at kiloparsec scales across nearby galaxies\n  with the ALMA ALMOND and IRAM 30m EMPIRE surveys",
  "authors": "Lukas Neumann, Maria J. Jimenez-Donaire, Adam K. Leroy, Frank Bigiel,\n  Antonio Usero, Jiayi Sun, Eva Schinnerer, Miguel Querejeta, Sophia K. Stuber,\n  Ivana Beslic, Ashley Barnes, Jakob den Brok, Yixian Cao, Cosima Eibensteiner,\n  Hao He, Ralf S. Klessen, Fu-Heng Liang, Daizhong Liu, Hsi-An Pan, Thomas G.\n  Williams",
  "authorsParsed": [
    [
      "Neumann",
      "Lukas",
      ""
    ],
    [
      "Jimenez-Donaire",
      "Maria J.",
      ""
    ],
    [
      "Leroy",
      "Adam K.",
      ""
    ],
    [
      "Bigiel",
      "Frank",
      ""
    ],
    [
      "Usero",
      "Antonio",
      ""
    ],
    [
      "Sun",
      "Jiayi",
      ""
    ],
    [
      "Schinnerer",
      "Eva",
      ""
    ],
    [
      "Querejeta",
      "Miguel",
      ""
    ],
    [
      "Stuber",
      "Sophia K.",
      ""
    ],
    [
      "Beslic",
      "Ivana",
      ""
    ],
    [
      "Barnes",
      "Ashley",
      ""
    ],
    [
      "Brok",
      "Jakob den",
      ""
    ],
    [
      "Cao",
      "Yixian",
      ""
    ],
    [
      "Eibensteiner",
      "Cosima",
      ""
    ],
    [
      "He",
      "Hao",
      ""
    ],
    [
      "Klessen",
      "Ralf S.",
      ""
    ],
    [
      "Liang",
      "Fu-Heng",
      ""
    ],
    [
      "Liu",
      "Daizhong",
      ""
    ],
    [
      "Pan",
      "Hsi-An",
      ""
    ],
    [
      "Williams",
      "Thomas G.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 19:00:19 GMT"
    },
    {
      "version": "v2",
      "created": "Mon, 23 Dec 2024 16:51:54 GMT"
    },
    {
      "version": "v3",
      "created": "Mon, 27 Jan 2025 13:08:09 GMT"
    }
  ],
  "updateDate": "2025-01-28",
  "timestamp": 1734116419000,
  "abstract": "  Dense, cold gas is the key ingredient for star formation. Over the last two\ndecades, HCN(1-0) emission has been utilised as the most accessible dense gas\ntracer to study external galaxies. We present new measurements tracing the\nrelationship between dense gas tracers, bulk molecular gas tracers, and star\nformation in the ALMA ALMOND survey, the largest sample of resolved (1-2 kpc\nresolution) HCN maps of galaxies in the local universe (d < 25 Mpc). We measure\nHCN/CO, a line ratio sensitive to the physical density distribution, and\nSFR/HCN, a proxy for the dense gas star formation efficiency, as a function of\nmolecular gas surface density, stellar mass surface density, and dynamical\nequilibrium pressure across 31 galaxies, increasing the number of galaxies by a\nfactor of > 3 over the previous largest such study (EMPIRE). HCN/CO increases\n(slope of ~ 0.5 and scatter of ~ 0.2 dex), while SFR/HCN decreases (slope of ~\n-0.6 and scatter of ~ 0.4 dex) with increasing molecular gas surface density,\nstellar mass surface density and pressure. Galaxy centres with high stellar\nmass surface density show a factor of a few higher HCN/CO and lower SFR/HCN\ncompared to the disc average, but both environments follow the same average\ntrend. Our results emphasise that molecular gas properties vary systematically\nwith the galactic environment and demonstrate that the scatter in the\nGao-Solomon relation (SFR against HCN) is of physical origin.\n",
  "subjects": [
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "IQsLs8UA99wFC6RxiTyoZyA1fyEaG0UsQCi334rUrV8",
  "pdfSize": "1509901"
}