{
  "id": "2412.20447",
  "title": "Cool, But What About Oracles? An Oracle-Based Perspective on Blockchain\n  Integration in the Accounting Field",
  "authors": "Giulio Caldarelli",
  "authorsParsed": [
    [
      "Caldarelli",
      "Giulio",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 29 Dec 2024 12:09:19 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 31 Dec 2024 13:36:16 GMT"
    }
  ],
  "updateDate": "2025-01-03",
  "timestamp": 1735474159000,
  "abstract": "  The Bitcoin Network is a sophisticated accounting system that allows its\nunderlying cryptocurrency to be trusted even in the absence of a reliable\nfinancial authority. Given its undeniable success, the technology, generally\nreferred to as blockchain, has also been proposed as a means to improve legacy\naccounting systems. Accounting for real-world data, however, requires the\nintervention of a third party known as an Oracle, which, having not the same\ncharacteristics as a blockchain, could potentially reduce the expected\nintegration benefit. Through a systematic review of the literature, this study\naims to investigate whether the papers concerning blockchain integration in\naccounting consider and address the limitations posed by oracles. A broad\noverview of the limitations that emerged in the literature is provided and\ndistinguished according to the specific accounting integration. Results support\nthe view that although research on the subject counts numerous articles, actual\nstudies considering oracle limitations are lacking. Interestingly, despite the\nscarce production of papers addressing oracles in various accounting sectors,\nreporting for ESG already shows interesting workarounds for oracle limitations,\nwith permissioned chains envisioned as a valid support for the safe storage of\nsustainability data.\n",
  "subjects": [
    "Computer Science/Cryptography and Security",
    "Computer Science/Computers and Society",
    "Computer Science/Emerging Technologies",
    "Economics/General Economics",
    "Quantitative Finance/Economics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "DLYUNDGgnbtnY1Pr3IJit5OVpzRajO7HZrkLmLJVRWk",
  "pdfSize": "431721"
}