{
  "id": "2412.20343",
  "title": "Spin-orbit interactions of the twisted random light",
  "authors": "Benli Li, Yahong Chen, Weimin Deng, Tongbiao Wang, Lipeng Wan, Tianbao\n  Yu",
  "authorsParsed": [
    [
      "Li",
      "Benli",
      ""
    ],
    [
      "Chen",
      "Yahong",
      ""
    ],
    [
      "Deng",
      "Weimin",
      ""
    ],
    [
      "Wang",
      "Tongbiao",
      ""
    ],
    [
      "Wan",
      "Lipeng",
      ""
    ],
    [
      "Yu",
      "Tianbao",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 29 Dec 2024 04:03:05 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 31 Dec 2024 05:20:06 GMT"
    }
  ],
  "updateDate": "2025-01-03",
  "timestamp": 1735444985000,
  "abstract": "  The twist phase of random light represents a nontrivial two-point phase,\nendowing the field with orbital angular momentum. Although the mutual\ntransition of the spin and orbit angular momenta of coherent light has been\nrevealed, the relationship between spin-orbital angular momentum interaction\n(SOI) and the twist phase has remained unexplored. This is because of the\nstochastic nature of random light, making it challenging to explore the\nproperties of angular momenta that rely on well-defined spatial and\npolarization structures. This study addresses this gap from the view of the\nasymmetry coherent-mode decomposition for twisted random light to gain insight\ninto the intricate interplay between the twist phase and the SOI within a tight\nfocusing system. Our findings reveal that spin and orbit angular momentum\ntransitions occur in the tightly focused twisted random light beam, yielding\nthe transverse spin density controlled by the twist phase. This effect becomes\nmore pronounced when the spin of random light and the chirality of the twist\nphase are the same. Our work may find significant applications in optical\nsensing, metrology, and quantum optics.\n",
  "subjects": [
    "Physics/Optics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "VVKaws3ev35kAFucsauSRaICEQiVDzgK2QXQX7LQW18",
  "pdfSize": "1892547"
}