{
  "id": "2412.10984",
  "title": "Non-relativistic linear Edelstein effect in non-collinear EuIn2As2",
  "authors": "Nayra A. \\'Alvarez Pari, Rodrigo Jaeschke-Ubiergo, Atasi Chakraborty,\n  Libor \\v{S}mejkal, Jairo Sinova",
  "authorsParsed": [
    [
      "Pari",
      "Nayra A. Álvarez",
      ""
    ],
    [
      "Jaeschke-Ubiergo",
      "Rodrigo",
      ""
    ],
    [
      "Chakraborty",
      "Atasi",
      ""
    ],
    [
      "Šmejkal",
      "Libor",
      ""
    ],
    [
      "Sinova",
      "Jairo",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 14 Dec 2024 22:27:20 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 14 Jan 2025 14:29:24 GMT"
    }
  ],
  "updateDate": "2025-01-15",
  "timestamp": 1734215240000,
  "abstract": "  Motivated by the ongoing interest in understanding the actual magnetic ground\nstate of the promising axion insulator candidate EuIn2As2, we present here a\nspin symmetry analysis and ab-initio calculations, aiming to identify specific\nexchange-dominated physics that could offer insights into the current debate.\nWe investigate two non-collinear coplanar magnetic orders reported in this\ncompound: the helical and broken helical phases. Our symmetry analysis shows\nthat magnetic-exchange alone results in the formation of an out-of-plane\nodd-wave order in momentum space with a single un-polarized nodal plane in both\nphases. Additionally, we identified an in-plane g-wave order that emerges\nexclusively in the broken helical phase, providing a distinguishing feature for\nthis phase. Furthermore, we report a non-relativistic Edelstein effect with a\ndistinct out-of-plane polarized spin density that dominates over spin-orbit\ncoupling effects. Our ab-initio calculations reveal a significant contrast in\nthe magnitude of this effect between both phases, which could serve as a means\nto identify the magnetic transition and distinguish them from other magnetic\nground states proposed for this compound.\n",
  "subjects": [
    "Condensed Matter/Strongly Correlated Electrons"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "iMHY0YuiHf6Av8nijPMTKf5i-kkqGv_pVGYY0D7Qq0c",
  "pdfSize": "5569873"
}