{"id":"2412.01045","title":"Explicit symplectic integrators with adaptive time steps in curved\n  spacetimes","authors":"Xin Wu, Ying Wang, Wei Sun, Fuyao Liu, Dazhu Ma","authorsParsed":[["Wu","Xin",""],["Wang","Ying",""],["Sun","Wei",""],["Liu","Fuyao",""],["Ma","Dazhu",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 02:03:02 GMT"},{"version":"v2","created":"Wed, 4 Dec 2024 06:53:43 GMT"}],"updateDate":"2024-12-05","timestamp":1733104982000,"abstract":"  Recently, our group developed explicit symplectic methods for curved\nspacetimes that are not split into several explicitly integrable parts, but are\nvia appropriate time transformations. Such time-transformed explicit symplectic\nintegrators should have employed adaptive time steps in principle, but they are\noften difficult in practical implementations. In fact, they work well if time\ntransformation functions cause the time-transformed Hamiltonians to have the\ndesired splits and approach 1 or constants for sufficiently large distances.\nHowever, they do not satisfy the requirement of step-size selections in this\ncase. Based on the step-size control technique proposed by Preto $\\&$ Saha, the\nnonadaptive time step time-transformed explicit symplectic methods are slightly\nadjusted as adaptive ones. The adaptive methods have only two additional steps\nand a negligible increase in computational cost as compared with the\nnonadaptive ones. Their implementation is simple. Several dynamical simulations\nof particles and photons near black holes have demonstrated that the adaptive\nmethods typically improve the efficiency of the nonadaptive methods. Because of\nthe desirable property, the new adaptive methods are applied to investigate the\nchaotic dynamics of particles and photons outside the horizon in a\nSchwarzschild-Melvin spacetime. The new methods are widely applicable to all\ncurved spacetimes corresponding to Hamiltonians or time-transformed\nHamiltonians with the expected splits. Also application to the backwards\nray-tracing method for studying the motion of photons and shadows of black\nholes is possible.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Astrophysics/Instrumentation and Methods for Astrophysics","Physics/Mathematical Physics","Mathematics/Mathematical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"4jN6K-Oa2kDK06gZc-CAuiPCurZJCPBJUxQQxcVZ7eY","pdfSize":"2413610"}