{
  "id": "2412.02561",
  "title": "User Grouping and Resource Allocation in Multiuser MIMO Systems under\n  SWIPT",
  "authors": "Javier Rubio, Antonio Pascual-Iserte",
  "authorsParsed": [
    [
      "Rubio",
      "Javier",
      ""
    ],
    [
      "Pascual-Iserte",
      "Antonio",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 16:50:00 GMT"
    }
  ],
  "updateDate": "2024-12-04",
  "timestamp": 1733244600000,
  "abstract": "  This paper considers a broadcast multiple-input multiple-output (MIMO)\nnetwork with multiple users and simultaneous wireless information and power\ntransfer (SWIPT). In this scenario, it is assumed that some users are able to\nharvest power from radio frequency (RF) signals to recharge batteries through\nwireless power transfer from the transmitter, while others are served\nsimultaneously with data transmission. The criterion driving the optimization\nand design of the system is based on the weighted sum rate for the users being\nserved with data. At the same time, constraints stating minimum per-user\nharvested powers are included in the optimization problem. This paper derives\nthe structure of the optimal transmit covariance matrices in the case where\nboth types of users are present simultaneously in the network, particularizing\nthe results to the cases where either only harvesting nodes or only information\nusers are to be served. The tradeoff between the achieved weighted sum rate and\nthe powers harvested by the user terminals is analyzed and evaluated using the\nrate-power (R-P) region. Finally, we propose a two-stage user grouping\nmechanism that decides which users should be scheduled to receive information\nand which users should be configured to harvest energy from the RF signals in\neach particular scheduling period, this being one of the main contributions of\nthis paper.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Signal Processing"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "qgH045QynzRzlVENDeNxrDKHOmSrNT5K1Wsn3kmCDp4",
  "pdfSize": "3012450"
}