{"id":"2412.18725","title":"On the Performance of Short Binary BCH Codes for Ultra-Low Latency\n  Wireless Communications","authors":"Robert Morelos-Zaragoza (San Jose State University) and Jeffrey Ma\n  (San Jose State University)","authorsParsed":[["Morelos-Zaragoza","Robert","","San Jose State University"],["Ma","Jeffrey","","San Jose State University"]],"versions":[{"version":"v1","created":"Wed, 25 Dec 2024 00:57:56 GMT"},{"version":"v2","created":"Wed, 8 Jan 2025 05:14:42 GMT"},{"version":"v3","created":"Tue, 14 Jan 2025 00:47:31 GMT"}],"updateDate":"2025-01-15","timestamp":1735088276000,"abstract":"  In recent years, polar codes have been considered for communication systems\nthat require high re-liability and ultra-low latency, such as sixth generation\n(6G) wireless communications. This paper presents simulation results showing\nthat short binary extended BCH (eBCH) codes with low-complexity decoding\noutperform polar codes for lengths 64 and 128. In the simulations, polar\nmapping under additive white Gaussian noise (AWGN) is assumed and\nordered-statistics decoding (OSD) of eBCH codes is compared with CRC-aided\nsuccessive-cancellation list decoding (SCLD-CRC) of polar codes of the same\nlengths and rates. The results indicate that short-length binary eBCH codes\nachieve lower average bit error rate values (higher reliability) and thus\nshould be considered as strong candidates in communication systems requiring\nextremely low latency, i.e., short code lengths of up to 128 bits. The eBCH\nsimulation results are obtained with OSD and re-processing order equal to one\nso that complexity is comparable to SCLD-CRC. Specifically, error performances\nare quantified of length-64 and selected length-128 eBCH codes with order-1 OSD\nand polar codes with SCLD-CRC for the same rates and lengths. These results\nserve to verify that short binary eBCH codes do indeed outperform short polar\ncodes with comparable decoding complexity.\n","subjects":["Computer Science/Information Theory","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"981Kvu1NKxYejeMLHpldQH7d_UnNBfkhxWez_6pa0mo","pdfSize":"855132"}