{"id":"2412.07991","title":"dsLassoCov: a federated machine learning approach incorporating\n  covariate control","authors":"Han Cao, Augusto Anguita, Charline Warembourg, Xavier\n  Escriba-Montagut, Martine Vrijheid, Juan R. Gonzalez, Tim Cadman, Verena\n  Schneider-Lindner, Daniel Durstewitz, Xavier Basagana, Emanuel Schwarz","authorsParsed":[["Cao","Han",""],["Anguita","Augusto",""],["Warembourg","Charline",""],["Escriba-Montagut","Xavier",""],["Vrijheid","Martine",""],["Gonzalez","Juan R.",""],["Cadman","Tim",""],["Schneider-Lindner","Verena",""],["Durstewitz","Daniel",""],["Basagana","Xavier",""],["Schwarz","Emanuel",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 00:03:52 GMT"}],"updateDate":"2024-12-12","timestamp":1733875432000,"abstract":"  Machine learning has been widely adopted in biomedical research, fueled by\nthe increasing availability of data. However, integrating datasets across\ninstitutions is challenging due to legal restrictions and data governance\ncomplexities. Federated learning allows the direct, privacy preserving training\nof machine learning models using geographically distributed datasets, but faces\nthe challenge of how to appropriately control for covariate effects. The naive\nimplementation of conventional covariate control methods in federated learning\nscenarios is often impractical due to the substantial communication costs,\nparticularly with high-dimensional data. To address this issue, we introduce\ndsLassoCov, a machine learning approach designed to control for covariate\neffects and allow an efficient training in federated learning. In biomedical\nanalysis, this allow the biomarker selection against the confounding effects.\nUsing simulated data, we demonstrate that dsLassoCov can efficiently and\neffectively manage confounding effects during model training. In our real-world\ndata analysis, we replicated a large-scale Exposome analysis using data from\nsix geographically distinct databases, achieving results consistent with\nprevious studies. By resolving the challenge of covariate control, our proposed\napproach can accelerate the application of federated learning in large-scale\nbiomedical studies.\n","subjects":["Quantitative Biology/Quantitative Methods","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"tH04ZHVBll_tXV8B_Kn6jhz3BMztH-VYJ-vbnn5OnIk","pdfSize":"2438702"}