{
  "id": "2412.09934",
  "title": "Exploring the Dark Matter Disc Model in Dwarf Galaxies: Insights from\n  the LITTLE THINGS Sample",
  "authors": "Francesco Sylos Labini, Roberto Capuzzo-Dolcetta, Giordano De Marzo,\n  Matteo Straccamore",
  "authorsParsed": [
    [
      "Labini",
      "Francesco Sylos",
      ""
    ],
    [
      "Capuzzo-Dolcetta",
      "Roberto",
      ""
    ],
    [
      "De Marzo",
      "Giordano",
      ""
    ],
    [
      "Straccamore",
      "Matteo",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 07:40:37 GMT"
    }
  ],
  "updateDate": "2025-01-22",
  "timestamp": 1734075637000,
  "abstract": "  We conducted an analysis of the velocity field of dwarf galaxies in the\nLITTLE THINGS sample, focusing on deriving 2D velocity maps that encompass both\nthe transverse and radial velocity fields. Within the range of radial distances\nwhere velocity anisotropies are sufficiently small for the disc to be\nconsidered rotationally supported, and where the warped geometry of the disc\ncan be neglected, we reconstructed the rotation curve while taking into account\nthe effect of the asymmetric drift. To fit the rotation curves, we employed the\nstandard halo model and the dark matter disc (DMD) model, which assumes that\ndark matter is primarily confined to the galactic discs and can be traced by\nthe distribution of \\HI{}. Interestingly, our analysis revealed that the fits\nfrom the DMD model are statistically comparable to those obtained using the\nstandard halo model, but the inferred masses of the galaxies in the DMD model\nare approximately 10 to 100 times smaller than the masses inferred in the\nstandard halo model. In the DMD model, the inner slope of the rotation curve is\ndirectly related to a linear combination of the surface density profiles of the\nstellar and gas components, which generally exhibit a flat core. Consequently,\nthe observation of a linear relationship between the rotation curve and the\nradius in the disc central regions is consistent with the framework of the DMD\nmodel.\n",
  "subjects": [
    "Astrophysics/Astrophysics of Galaxies",
    "Astrophysics/Cosmology and Nongalactic Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "UGYwXyWLnj4pyvZEQFQooNvh43KleOjv3sbDoPSRtWg",
  "pdfSize": "8175456"
}