{
  "id": "2412.18046",
  "title": "Emoji Retrieval from Gibberish or Garbled Social Media Text: A Novel\n  Methodology and A Case Study",
  "authors": "Shuqi Cui, Nirmalya Thakur, and Audrey Poon",
  "authorsParsed": [
    [
      "Cui",
      "Shuqi",
      ""
    ],
    [
      "Thakur",
      "Nirmalya",
      ""
    ],
    [
      "Poon",
      "Audrey",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 23:44:13 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1734997453000,
  "abstract": "  Emojis are widely used across social media platforms but are often lost in\nnoisy or garbled text, posing challenges for data analysis and machine\nlearning. Conventional preprocessing approaches recommend removing such text,\nrisking the loss of emojis and their contextual meaning. This paper proposes a\nthree-step reverse-engineering methodology to retrieve emojis from garbled text\nin social media posts. The methodology also identifies reasons for the\ngeneration of such text during social media data mining. To evaluate its\neffectiveness, the approach was applied to 509,248 Tweets about the Mpox\noutbreak, a dataset referenced in about 30 prior works that failed to retrieve\nemojis from garbled text. Our method retrieved 157,748 emojis from 76,914\nTweets. Improvements in text readability and coherence were demonstrated\nthrough metrics such as Flesch Reading Ease, Flesch-Kincaid Grade Level,\nColeman-Liau Index, Automated Readability Index, Dale-Chall Readability Score,\nText Standard, and Reading Time. Additionally, the frequency of individual\nemojis and their patterns of usage in these Tweets were analyzed, and the\nresults are presented.\n",
  "subjects": [
    "Computer Science/Social and Information Networks",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Computation and Language",
    "Computer Science/Computers and Society",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "YTR8x5aT1sU9zIqspwjz1A1QdlXCxCbZRN38Wid6q9w",
  "pdfSize": "4412454"
}