{
  "id": "2412.04347",
  "title": "Quantized Hall drift in a frequency-encoded photonic Chern insulator",
  "authors": "Alexandre Ch\\'enier, Bosco d'Aligny, F\\'elix Pellerin, Paul-\\'Edouard\n  Blanchard, Tomoki Ozawa, Iacopo Carusotto, Philippe St-Jean",
  "authorsParsed": [
    [
      "Chénier",
      "Alexandre",
      ""
    ],
    [
      "d'Aligny",
      "Bosco",
      ""
    ],
    [
      "Pellerin",
      "Félix",
      ""
    ],
    [
      "Blanchard",
      "Paul-Édouard",
      ""
    ],
    [
      "Ozawa",
      "Tomoki",
      ""
    ],
    [
      "Carusotto",
      "Iacopo",
      ""
    ],
    [
      "St-Jean",
      "Philippe",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 17:07:40 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733418460000,
  "abstract": "  The prospect of developing more efficient classical or quantum photonic\ndevices through the suppression of backscattering is a major driving force for\nthe field of topological photonics. However, genuine protection against\nbackscattering in photonics requires implementing architectures with broken\ntime-reversal which is technically challenging. Here, we make use of a\nfrequency-encoded synthetic dimension scheme in an optical fibre loop platform\nto experimentally realise a photonic Chern insulator inspired from the Haldane\nmodel where time-reversal is explicitly broken through temporal modulation. The\nbands' topology is assessed by reconstructing the Bloch states' geometry across\nthe Brillouin zone. We further highlight its consequences by measuring a\ndriven-dissipative analogue of the quantized transverse Hall conductivity. Our\nresults thus open the door to harnessing topologically protected unidirectional\ntransport of light in frequency-multiplexed photonic systems.\n",
  "subjects": [
    "Physics/Optics",
    "Condensed Matter/Mesoscale and Nanoscale Physics",
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "P_pO_fzLds6oZvzV3QEwMsK7VtipzKbWBD8cPtCXrqs",
  "pdfSize": "8637935"
}