{
  "id": "2412.12587",
  "title": "Distributed satellite information networks: Architecture, enabling\n  technologies, and trends",
  "authors": "Qinyu Zhang, Liang Xu, Jianhao Huang, Tao Yang, Jian Jiao, Ye Wang,\n  Yao Shi, Chiya Zhang, Xingjian Zhang, Ke Zhang, Yupeng Gong, Na Deng, Nan\n  Zhao, Zhen Gao, Shujun Han, Xiaodong Xu, Li You, Dongming Wang, Shan Jiang,\n  Dixian Zhao, Nan Zhang, Liujun Hu, Xiongwen He, Yonghui Li, Xiqi Gao, Xiaohu\n  You",
  "authorsParsed": [
    [
      "Zhang",
      "Qinyu",
      ""
    ],
    [
      "Xu",
      "Liang",
      ""
    ],
    [
      "Huang",
      "Jianhao",
      ""
    ],
    [
      "Yang",
      "Tao",
      ""
    ],
    [
      "Jiao",
      "Jian",
      ""
    ],
    [
      "Wang",
      "Ye",
      ""
    ],
    [
      "Shi",
      "Yao",
      ""
    ],
    [
      "Zhang",
      "Chiya",
      ""
    ],
    [
      "Zhang",
      "Xingjian",
      ""
    ],
    [
      "Zhang",
      "Ke",
      ""
    ],
    [
      "Gong",
      "Yupeng",
      ""
    ],
    [
      "Deng",
      "Na",
      ""
    ],
    [
      "Zhao",
      "Nan",
      ""
    ],
    [
      "Gao",
      "Zhen",
      ""
    ],
    [
      "Han",
      "Shujun",
      ""
    ],
    [
      "Xu",
      "Xiaodong",
      ""
    ],
    [
      "You",
      "Li",
      ""
    ],
    [
      "Wang",
      "Dongming",
      ""
    ],
    [
      "Jiang",
      "Shan",
      ""
    ],
    [
      "Zhao",
      "Dixian",
      ""
    ],
    [
      "Zhang",
      "Nan",
      ""
    ],
    [
      "Hu",
      "Liujun",
      ""
    ],
    [
      "He",
      "Xiongwen",
      ""
    ],
    [
      "Li",
      "Yonghui",
      ""
    ],
    [
      "Gao",
      "Xiqi",
      ""
    ],
    [
      "You",
      "Xiaohu",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 06:44:05 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734417845000,
  "abstract": "  Driven by the vision of ubiquitous connectivity and wireless intelligence,\nthe evolution of ultra-dense constellation-based satellite-integrated Internet\nis underway, now taking preliminary shape. Nevertheless, the entrenched\ninstitutional silos and limited, nonrenewable heterogeneous network resources\nleave current satellite systems struggling to accommodate the escalating\ndemands of next-generation intelligent applications. In this context, the\ndistributed satellite information networks (DSIN), exemplified by the cohesive\nclustered satellites system, have emerged as an innovative architecture,\nbridging information gaps across diverse satellite systems, such as\ncommunication, navigation, and remote sensing, and establishing a unified, open\ninformation network paradigm to support resilient space information services.\nThis survey first provides a profound discussion about innovative network\narchitectures of DSIN, encompassing distributed regenerative satellite network\narchitecture, distributed satellite computing network architecture, and\nreconfigurable satellite formation flying, to enable flexible and scalable\ncommunication, computing and control. The DSIN faces challenges from network\nheterogeneity, unpredictable channel dynamics, sparse resources, and\ndecentralized collaboration frameworks. To address these issues, a series of\nenabling technologies is identified, including channel modeling and estimation,\ncloud-native distributed MIMO cooperation, grant-free massive access, network\nrouting, and the proper combination of all these diversity techniques.\nFurthermore, to heighten the overall resource efficiency, the cross-layer\noptimization techniques are further developed to meet upper-layer\ndeterministic, adaptive and secure information services requirements. In\naddition, emerging research directions and new opportunities are highlighted on\nthe way to achieving the DSIN vision.\n",
  "subjects": [
    "Computer Science/Information Theory",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Networking and Internet Architecture",
    "Mathematics/Information Theory"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "Oc-x8oVMuxfldC7Ruvxw3tK9sAp59M-3oVNtvNXULLQ",
  "pdfSize": "12490980"
}