{"id":"2412.09955","title":"Bilayer orthogonal ferromagnetism in CrTe$_2$-based van der Waals system","authors":"Chiara Bigi, Cyriack Jego, Vincent Polewczyk, Alessandro De Vita,\n  Thomas Jaouen, Hulerich C. Tchouekem, Fran\\c{c}ois Bertran, Patrick Le\n  F\\`evre, Pascal Turban, Jean-Fran\\c{c}ois Jacquot, Jill A. Miwa, Oliver J.\n  Clark, Anupam Jana, Sandeep Kumar Chaluvadi, Pasquale Orgiani, Mario Cuoco,\n  Mats Leandersson, Thiagarajan Balasubramanian, Thomas Olsen, Younghun Hwang,\n  Matthieu Jamet, and Federico Mazzola","authorsParsed":[["Bigi","Chiara",""],["Jego","Cyriack",""],["Polewczyk","Vincent",""],["De Vita","Alessandro",""],["Jaouen","Thomas",""],["Tchouekem","Hulerich C.",""],["Bertran","François",""],["Fèvre","Patrick Le",""],["Turban","Pascal",""],["Jacquot","Jean-François",""],["Miwa","Jill A.",""],["Clark","Oliver J.",""],["Jana","Anupam",""],["Chaluvadi","Sandeep Kumar",""],["Orgiani","Pasquale",""],["Cuoco","Mario",""],["Leandersson","Mats",""],["Balasubramanian","Thiagarajan",""],["Olsen","Thomas",""],["Hwang","Younghun",""],["Jamet","Matthieu",""],["Mazzola","Federico",""]],"versions":[{"version":"v1","created":"Fri, 13 Dec 2024 08:26:45 GMT"}],"updateDate":"2024-12-16","timestamp":1734078405000,"abstract":"  Systems with pronounced spin anisotropy play a pivotal role in advancing\nmagnetization switching and spin-wave generation mechanisms, which are\nfundamental for spintronic technologies. Quasi-van der Waals ferromagnets,\nparticularly Cr$_{1+\\delta}$Te$_2$ compounds, represent seminal materials in\nthis field, renowned for their delicate balance between frustrated layered\ngeometries and magnetism. Despite extensive investigation, the precise nature\nof their magnetic ground state, typically described as a canted ferromagnet,\nremains contested, as does the mechanism governing spin reorientation under\nexternal magnetic fields and varying temperatures. In this work, we leverage a\nmultimodal approach, integrating complementary techniques, to reveal that\nCr$_{1+\\delta}$Te$_2$ ($\\delta = 0.25 - 0.50$) hosts a previously overlooked\nmagnetic phase, which we term orthogonal-ferromagnetism. This single phase\nconsists of alternating atomically sharp single layers of in-plane and\nout-of-plane ferromagnetic blocks, coupled via exchange interactions and as\nsuch, it differs significantly from crossed magnetism, which can be achieved\nexclusively by stacking multiple heterostructural elements together. Contrary\nto earlier reports suggesting a gradual spin reorientation in CrTe$_2$-based\nsystems, we present definitive evidence of abrupt spin-flop-like transitions.\nThis discovery, likely due to the improved crystallinity and lower defect\ndensity in our samples, repositions Cr$_{1+\\delta}$Te$_2$ compounds as\npromising candidates for spintronic and orbitronic applications, opening new\npathways for device engineering.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"B1s4A8b4ursokh2pejI5ICX2jY41pi36BRrWSNCAOp4","pdfSize":"3447271"}