{"id":"2412.11414","title":"Biased or Flawed? Mitigating Stereotypes in Generative Language Models\n  by Addressing Task-Specific Flaws","authors":"Akshita Jha, Sanchit Kabra, Chandan K. Reddy","authorsParsed":[["Jha","Akshita",""],["Kabra","Sanchit",""],["Reddy","Chandan K.",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 03:29:08 GMT"}],"updateDate":"2024-12-17","timestamp":1734319748000,"abstract":"  Recent studies have shown that generative language models often reflect and\namplify societal biases in their outputs. However, these studies frequently\nconflate observed biases with other task-specific shortcomings, such as\ncomprehension failure. For example, when a model misinterprets a text and\nproduces a response that reinforces a stereotype, it becomes difficult to\ndetermine whether the issue arises from inherent bias or from a\nmisunderstanding of the given content. In this paper, we conduct a\nmulti-faceted evaluation that distinctly disentangles bias from flaws within\nthe reading comprehension task. We propose a targeted stereotype mitigation\nframework that implicitly mitigates observed stereotypes in generative models\nthrough instruction-tuning on general-purpose datasets. We reduce stereotypical\noutputs by over 60% across multiple dimensions -- including nationality, age,\ngender, disability, and physical appearance -- by addressing\ncomprehension-based failures, and without relying on explicit debiasing\ntechniques. We evaluate several state-of-the-art generative models to\ndemonstrate the effectiveness of our approach while maintaining the overall\nutility. Our findings highlight the need to critically disentangle the concept\nof `bias' from other types of errors to build more targeted and effective\nmitigation strategies. CONTENT WARNING: Some examples contain offensive\nstereotypes.\n","subjects":["Computer Science/Computation and Language","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"972DFcwBpmiZEC5pfod_81h7FLJDpG_Bc64Rr7Jbswk","pdfSize":"1202655"}