{
  "id": "2412.15253",
  "title": "Using Machine Learning to Distinguish Human-written from\n  Machine-generated Creative Fiction",
  "authors": "Andrea Cristina McGlinchey and Peter J Barclay",
  "authorsParsed": [
    [
      "McGlinchey",
      "Andrea Cristina",
      ""
    ],
    [
      "Barclay",
      "Peter J",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 15 Dec 2024 12:46:57 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734266817000,
  "abstract": "  Following the universal availability of generative AI systems with the\nrelease of ChatGPT, automatic detection of deceptive text created by Large\nLanguage Models has focused on domains such as academic plagiarism and \"fake\nnews\". However, generative AI also poses a threat to the livelihood of creative\nwriters, and perhaps to literary culture in general, through reduction in\nquality of published material. Training a Large Language Model on writers'\noutput to generate \"sham books\" in a particular style seems to constitute a new\nform of plagiarism. This problem has been little researched. In this study, we\ntrained Machine Learning classifier models to distinguish short samples of\nhuman-written from machine-generated creative fiction, focusing on classic\ndetective novels. Our results show that a Naive Bayes and a Multi-Layer\nPerceptron classifier achieved a high degree of success (accuracy > 95%),\nsignificantly outperforming human judges (accuracy < 55%). This approach worked\nwell with short text samples (around 100 words), which previous research has\nshown to be difficult to classify. We have deployed an online proof-of-concept\nclassifier tool, AI Detective, as a first step towards developing lightweight\nand reliable applications for use by editors and publishers, with the aim of\nprotecting the economic and cultural contribution of human authors.\n",
  "subjects": [
    "Computer Science/Computation and Language",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "Z3_dFoxwY_iEfxepZgjYj9ItKvEQkUqiEocd8z4G2qY",
  "pdfSize": "232954"
}