{
  "id": "2412.16089",
  "title": "The Evolution of LLM Adoption in Industry Data Curation Practices",
  "authors": "Crystal Qian, Michael Xieyang Liu, Emily Reif, Grady Simon, Nada\n  Hussein, Nathan Clement, James Wexler, Carrie J. Cai, Michael Terry, Minsuk\n  Kahng",
  "authorsParsed": [
    [
      "Qian",
      "Crystal",
      ""
    ],
    [
      "Liu",
      "Michael Xieyang",
      ""
    ],
    [
      "Reif",
      "Emily",
      ""
    ],
    [
      "Simon",
      "Grady",
      ""
    ],
    [
      "Hussein",
      "Nada",
      ""
    ],
    [
      "Clement",
      "Nathan",
      ""
    ],
    [
      "Wexler",
      "James",
      ""
    ],
    [
      "Cai",
      "Carrie J.",
      ""
    ],
    [
      "Terry",
      "Michael",
      ""
    ],
    [
      "Kahng",
      "Minsuk",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 17:34:16 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734716056000,
  "abstract": "  As large language models (LLMs) grow increasingly adept at processing\nunstructured text data, they offer new opportunities to enhance data curation\nworkflows. This paper explores the evolution of LLM adoption among\npractitioners at a large technology company, evaluating the impact of LLMs in\ndata curation tasks through participants' perceptions, integration strategies,\nand reported usage scenarios. Through a series of surveys, interviews, and user\nstudies, we provide a timely snapshot of how organizations are navigating a\npivotal moment in LLM evolution. In Q2 2023, we conducted a survey to assess\nLLM adoption in industry for development tasks (N=84), and facilitated expert\ninterviews to assess evolving data needs (N=10) in Q3 2023. In Q2 2024, we\nexplored practitioners' current and anticipated LLM usage through a user study\ninvolving two LLM-based prototypes (N=12). While each study addressed distinct\nresearch goals, they revealed a broader narrative about evolving LLM usage in\naggregate. We discovered an emerging shift in data understanding from\nheuristic-first, bottom-up approaches to insights-first, top-down workflows\nsupported by LLMs. Furthermore, to respond to a more complex data landscape,\ndata practitioners now supplement traditional subject-expert-created 'golden\ndatasets' with LLM-generated 'silver' datasets and rigorously validated 'super\ngolden' datasets curated by diverse experts. This research sheds light on the\ntransformative role of LLMs in large-scale analysis of unstructured data and\nhighlights opportunities for further tool development.\n",
  "subjects": [
    "Computer Science/Human-Computer Interaction",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "MNf30OENnUzUDk8Sycr7piwwPrP1WGE8o1NUqo7s4TY",
  "pdfSize": "962812"
}