{"id":"2412.03763","title":"Quantum circuit and mapping algorithms for wavepacket dynamics: case\n  study of anharmonic hydrogen bonds in protonated and hydroxide water clusters","authors":"Debadrita Saha, Philip Richerme, and Srinivasan S. Iyengar","authorsParsed":[["Saha","Debadrita",""],["Richerme","Philip",""],["Iyengar","Srinivasan S.",""]],"versions":[{"version":"v1","created":"Wed, 4 Dec 2024 23:01:24 GMT"}],"updateDate":"2024-12-06","timestamp":1733353284000,"abstract":"  The accurate computational study of wavepacket nuclear dynamics is considered\nto be a classically intractable problem, particularly with increasing\ndimensions. Here we present two algorithms that, in conjunction with other\nmethods developed by us, will form the basis for performing quantum nuclear\ndynamics in arbitrary dimensions. For one algorithm, we present a direct map\nbetween the Born-Oppenheimer Hamiltonian describing the wavepacket\ntime-evolution and the control parameters of a spin-lattice Hamiltonian that\ndescribes the dynamics of qubit states in an ion-trap quantum computer. This\nmap is exact for three qubits, and when implemented, the dynamics of the spin\nstates emulate those of the nuclear wavepacket. However, this map becomes\napproximate as the number of qubits grow. In a second algorithm we present a\ngeneral quantum circuit decomposition formalism for such problems using a\nmethod called the Quantum Shannon Decomposition. This algorithm is more robust\nand is exact for any number of qubits, at the cost of increased circuit\ncomplexity. The resultant circuit is implemented on IBM's quantum simulator\n(QASM) for 3-7 qubits. In both cases the wavepacket dynamics is found to be in\ngood agreement with the classical result and the corresponding vibrational\nfrequencies obtained from the wavepacket density time-evolution, are in\nagreement to within a few tenths of a wavenumbers.\n","subjects":["Physics/Quantum Physics","Computer Science/Numerical Analysis","Mathematics/Numerical Analysis","Physics/Chemical Physics","Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"4Ny79fRfxdznW-fbJy9vgQpTsu8kuEfyER5ZWBgrk2U","pdfSize":"2046606"}