{"id":"2412.05153","title":"A text-to-tabular approach to generate synthetic patient data using LLMs","authors":"Margaux Tornqvist, Jean-Daniel Zucker, Tristan Fauvel, Nicolas\n  Lambert, Mathilde Berthelot, Antoine Movschin","authorsParsed":[["Tornqvist","Margaux",""],["Zucker","Jean-Daniel",""],["Fauvel","Tristan",""],["Lambert","Nicolas",""],["Berthelot","Mathilde",""],["Movschin","Antoine",""]],"versions":[{"version":"v1","created":"Fri, 6 Dec 2024 16:10:40 GMT"}],"updateDate":"2024-12-09","timestamp":1733501440000,"abstract":"  Access to large-scale high-quality healthcare databases is key to accelerate\nmedical research and make insightful discoveries about diseases. However,\naccess to such data is often limited by patient privacy concerns, data sharing\nrestrictions and high costs. To overcome these limitations, synthetic patient\ndata has emerged as an alternative. However, synthetic data generation (SDG)\nmethods typically rely on machine learning (ML) models trained on original\ndata, leading back to the data scarcity problem. We propose an approach to\ngenerate synthetic tabular patient data that does not require access to the\noriginal data, but only a description of the desired database. We leverage\nprior medical knowledge and in-context learning capabilities of large language\nmodels (LLMs) to generate realistic patient data, even in a low-resource\nsetting. We quantitatively evaluate our approach against state-of-the-art SDG\nmodels, using fidelity, privacy, and utility metrics. Our results show that\nwhile LLMs may not match the performance of state-of-the-art models trained on\nthe original data, they effectively generate realistic patient data with\nwell-preserved clinical correlations. An ablation study highlights key elements\nof our prompt contributing to high-quality synthetic patient data generation.\nThis approach, which is easy to use and does not require original data or\nadvanced ML skills, is particularly valuable for quickly generating\ncustom-designed patient data, supporting project implementation and providing\neducational resources.\n","subjects":["Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"UCr8Pccppt-Hcon3k6Z7iObX3QOpboFBffvpmxIXeVo","pdfSize":"1306254"}