{
  "id": "2412.04678",
  "title": "Unsupervised Segmentation by Diffusing, Walking and Cutting",
  "authors": "Daniela Ivanova, Marco Aversa, Paul Henderson, John Williamson",
  "authorsParsed": [
    [
      "Ivanova",
      "Daniela",
      ""
    ],
    [
      "Aversa",
      "Marco",
      ""
    ],
    [
      "Henderson",
      "Paul",
      ""
    ],
    [
      "Williamson",
      "John",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 00:23:18 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733444598000,
  "abstract": "  We propose an unsupervised image segmentation method using features from\npre-trained text-to-image diffusion models. Inspired by classic spectral\nclustering approaches, we construct adjacency matrices from self-attention\nlayers between image patches and recursively partition using Normalised Cuts. A\nkey insight is that self-attention probability distributions, which capture\nsemantic relations between patches, can be interpreted as a transition matrix\nfor random walks across the image. We leverage this by first using Random Walk\nNormalized Cuts directly on these self-attention activations to partition the\nimage, minimizing transition probabilities between clusters while maximizing\ncoherence within clusters. Applied recursively, this yields a hierarchical\nsegmentation that reflects the rich semantics in the pre-trained attention\nlayers, without any additional training. Next, we explore other ways to build\nthe NCuts adjacency matrix from features, and how we can use the random walk\ninterpretation of self-attention to capture long-range relationships. Finally,\nwe propose an approach to automatically determine the NCut cost criterion,\navoiding the need to tune this manually. We quantitatively analyse the effect\nincorporating different features, a constant versus dynamic NCut threshold, and\nincorporating multi-node paths when constructing the NCuts adjacency matrix. We\nshow that our approach surpasses all existing methods for zero-shot\nunsupervised segmentation, achieving state-of-the-art results on COCO-Stuff-27\nand Cityscapes.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "erquZ3nsshJlNoQ2Wmdp7KZKJPxdkFhra_HJETiZhaM",
  "pdfSize": "51874325"
}