{"id":"2412.07514","title":"Physics-Based Dynamic Models Hybridisation Using Physics-Informed Neural\n  Networks","authors":"Branislava Lalic, Dinh Viet Cuong, Mina Petric, Vladimir Pavlovic, Ana\n  Firanj Sremac, Mark Roantree","authorsParsed":[["Lalic","Branislava",""],["Cuong","Dinh Viet",""],["Petric","Mina",""],["Pavlovic","Vladimir",""],["Sremac","Ana Firanj",""],["Roantree","Mark",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 13:51:48 GMT"},{"version":"v2","created":"Tue, 24 Dec 2024 13:40:21 GMT"}],"updateDate":"2024-12-25","timestamp":1733838708000,"abstract":"  Physics-based dynamic models (PBDMs) are simplified representations of\ncomplex dynamical systems. PBDMs take specific processes within a complex\nsystem and assign a fragment of variables and an accompanying set of parameters\nto depict the processes. As this often leads to suboptimal parameterisation of\nthe system, a key challenge requires refining the empirical parameters and\nvariables to reduce uncertainties while maintaining the model s explainability\nand enhancing its predictive accuracy. We demonstrate that a hybrid mosquito\npopulation dynamics model, which integrates a PBDM with Physics-Informed Neural\nNetworks (PINN), retains the explainability of the PBDM by incorporating the\nPINN-learned model parameters in place of its empirical counterparts.\nSpecifically, we address the limitations of traditional PBDMs by modelling the\nparameters of larva and pupa development rates using a PINN that encodes\ncomplex, learned interactions of air temperature, precipitation and humidity.\nOur results demonstrate improved mosquito population simulations including the\ndifficult-to-predict mosquito population peaks. This opens the possibility of\nhybridisation concept application on other complex systems based on PBDMs such\nas cancer growth to address the challenges posed by scarce and noisy data, and\nto numerical weather prediction and climate modelling to overcome the gap\nbetween physics-based and data-driven weather prediction models.\n","subjects":["Physics/Biological Physics","Computer Science/Machine Learning","Computer Science/Numerical Analysis","Mathematics/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"P33cs6WwZtGromZ5SAPIO0PR6uTFlk1lmH12Fu9QF9k","pdfSize":"1882989"}