{"id":"2412.02694","title":"Increased Surface Temperatures of Habitable White Dwarf Worlds Relative\n  to Main-Sequence Exoplanets","authors":"Aomawa L. Shields, Eric T. Wolf, Eric Agol, and Pier-Emmanuel Tremblay","authorsParsed":[["Shields","Aomawa L.",""],["Wolf","Eric T.",""],["Agol","Eric",""],["Tremblay","Pier-Emmanuel",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 18:59:34 GMT"}],"updateDate":"2024-12-04","timestamp":1733252374000,"abstract":"  Discoveries of giant planet candidates orbiting white dwarf stars and the\ndemonstrated capabilities of the James Webb Space Telescope bring the\npossibility of detecting rocky planets in the habitable zones of white dwarfs\ninto pertinent focus. We present simulations of an aqua planet with an\nEarth-like atmospheric composition and incident stellar insolation orbiting in\nthe habitable zone of two different types of stars - a 5000 K white dwarf and\nmain-sequence K-dwarf star Kepler-62 with a similar effective temperature - and\nidentify the mechanisms responsible for the two differing planetary climates.\nThe synchronously-rotating white dwarf planet's global mean surface temperature\nis 25 K higher than that of the synchronously-rotating planet orbiting\nKepler-62, due to its much faster (10-hr) rotation and orbital period. This\nultra-fast rotation generates strong zonal winds and meridional flux of zonal\nmomentum, stretching out and homogenizing the scale of atmospheric circulation,\nand preventing an equivalent build-up of thick, liquid water clouds on the\ndayside of the planet compared to the synchronous planet orbiting Kepler-62,\nwhile also transporting heat equatorward from higher latitudes. White dwarfs\nmay therefore present amenable environments for life on planets formed within\nor migrated to their habitable zones, generating warmer surface environments\nthan those of planets with main-sequence hosts to compensate for an ever\nshrinking incident stellar flux.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"kjs3NlbVpA9PEuFHXFstdLr-PbqfoNohMZi6op48ig4","pdfSize":"4809640"}