{"id":"2412.15029","title":"$\\ell^1$-bases, algebraic structure and strong Arens irregularity of\n  Banach algebras in harmonic analysis$^1$","authors":"Mahmoud Filali and Jorge Galindo","authorsParsed":[["Filali","Mahmoud",""],["Galindo","Jorge",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 16:39:49 GMT"}],"updateDate":"2024-12-20","timestamp":1734626389000,"abstract":"  A long standing problem in abstract harmonic analysis concerns the strong\nArens irregularity (sAir, for short) of the Fourier algebra $A(G)$ of a locally\ncompact group $G.$ The groups for which $A(G)$ is known to be sAir are all\namenable. So far this class includes the abelian groups, the discrete amenable\ngroups, the second countable amenable groups $G$ such that $\\overline{[G, G]}$\nis not open in $G,$ the groups of the form $\\prod_{i=0}^\\infty G_i$ where each\n$G_i$, $i\\ge1$, is a non-trivial metrizable compact group and $G_0$ is an\namenable second countable locally compact group, the groups of the form\n$G_0\\times G$, where $G$ is a compact group whose local weight $w(G)$ has\nuncountable cofinality and $G_0$ is any locally compact amenable group with\n$w(G_0)\\le w(G)$, and the compact group $SU(2).$ We were primarily concerned\nwith the groups for which $A(G)$ is sAir. We introduce a new class of\n$\\ell^1$-bases in Banach algebras. These new $\\ell^1$-bases enable us, among\nother results, to unify most of the results related to Arens products proved in\nthe past seventy years since Arens defined his products. This includes the\nstrong Arens irregularity of algebras in harmonic analysis, and in particular\nalmost all the cases mentioned above for the Fourier algebras. In addition, we\nalso show that $A(G)$ is sAir for compact connected groups with an infinite\ndual rank. The $\\ell^1$-bases for the Fourier algebra are constructed with\ncoefficients of certain irreducible representations of the group. With this new\napproach using $\\ell^1$-bases, the rich algebraic structure of the algebras and\nsemigroups under study such as the second dual of Banach algebras with an Arens\nproduct or certain semigroup compactifications (the Stone-\\v Cech\ncompactification of an infinite discrete group, for instance) is also unveiled\n","subjects":["Mathematics/Functional Analysis","Mathematics/Operator Algebras"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Uc59W_gKkLiHwOofrZz1NXD3zMKD_O95CvtJen-YwDM","pdfSize":"744483"}