{
  "id": "2412.16490",
  "title": "BODex: Scalable and Efficient Robotic Dexterous Grasp Synthesis Using\n  Bilevel Optimization",
  "authors": "Jiayi Chen, Yubin Ke, He Wang",
  "authorsParsed": [
    [
      "Chen",
      "Jiayi",
      ""
    ],
    [
      "Ke",
      "Yubin",
      ""
    ],
    [
      "Wang",
      "He",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 21 Dec 2024 05:22:53 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734758573000,
  "abstract": "  Robotic dexterous grasping is a key step toward human-like manipulation. To\nfully unleash the potential of data-driven models for dexterous grasping, a\nlarge-scale, high-quality dataset is essential. While gradient-based\noptimization offers a promising way for constructing such datasets, existing\nworks suffer from limitations, such as restrictive assumptions in energy design\nor limited experiments on small object sets. Moreover, the lack of a standard\nbenchmark for comparing synthesis methods and datasets hinders progress in this\nfield. To address these challenges, we develop a highly efficient synthesis\nsystem and a comprehensive benchmark with MuJoCo for dexterous grasping. Our\nsystem formulates grasp synthesis as a bilevel optimization problem, combining\na novel lower-level quadratic programming (QP) with an upper-level gradient\ndescent process. By leveraging recent advances in CUDA-accelerated robotic\nlibraries and GPU-based QP solvers, our system can parallelize thousands of\ngrasps and synthesize over 49 grasps per second on a single NVIDIA 3090 GPU.\nOur synthesized grasps for Shadow Hand and Allegro Hand achieve a success rate\nabove 75% in MuJoCo, with a penetration depth and contact distance of under 1\nmm, outperforming existing baselines on nearly all metrics. Compared to the\nprevious large-scale dataset, DexGraspNet, our dataset significantly improves\nthe performance of learning models, with a simulation success rate from around\n40% to 80%. Real-world testing of the trained model on the Shadow Hand achieves\nan 81% success rate across 20 diverse objects.\n",
  "subjects": [
    "Computer Science/Robotics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "FRrCpUiwPdNXvv_8w3iDqrViI2IyeNFMhvTf6AQLnTU",
  "pdfSize": "4577500"
}