{
  "id": "2412.11797",
  "title": "ALMA detections of circumstellar disks in the giant Hii region M17.\n  Probing the intermediate- to high-mass pre-main-sequence population",
  "authors": "J. Poorta, M. Hogerheijde, A. de Koter, L. Kaper, F. Backs, M.C.\n  Ram\\'irez Tannus, M.K. McClure, A.P.S. Hygate, C. Rab, P.D. Klaassen, A.\n  Derkink",
  "authorsParsed": [
    [
      "Poorta",
      "J.",
      ""
    ],
    [
      "Hogerheijde",
      "M.",
      ""
    ],
    [
      "de Koter",
      "A.",
      ""
    ],
    [
      "Kaper",
      "L.",
      ""
    ],
    [
      "Backs",
      "F.",
      ""
    ],
    [
      "Tannus",
      "M. C. Ramírez",
      ""
    ],
    [
      "McClure",
      "M. K.",
      ""
    ],
    [
      "Hygate",
      "A. P. S.",
      ""
    ],
    [
      "Rab",
      "C.",
      ""
    ],
    [
      "Klaassen",
      "P. D.",
      ""
    ],
    [
      "Derkink",
      "A.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 14:10:37 GMT"
    }
  ],
  "updateDate": "2025-02-26",
  "timestamp": 1734358237000,
  "abstract": "  Our current understanding is that intermediate- to high-mass stars form in a\nway similar to low-mass stars, that is, through disk accretion. However, the\nphysical conditions that play a role in disk formation, evolution, and the\npossibility of (sub)stellar companion formation, are significantly different.\nWe search for the mm counterparts of four intermediate- to high-mass (4-10\nSolar mass) young stellar objects (YSOs) in the giant Hii region M17 at a\ndistance of 1.7 kpc. These objects expose their photospheric spectrum such that\ntheir location on the pre-main-sequence (PMS) is well established. They have a\ncircumstellar disk that is likely remnant of the formation process. With ALMA\nwe have detected, for the first time, these four YSOs in M17, in Band 6 and 7,\nas well as four other serendipitous objects. Besides the flux measurements, the\nsource size and spectral index provide important constraints on the physical\nmechanism(s) producing the observed emission. We apply different models to\nestimate the dust and gas mass contained in the disks. All our detections are\nspatially unresolved, constraining the source size to <120 au, and have a\nspectral index in the range 0.5-2.7. The derived (upper limits on the) disk\ndust masses are on the order of a few Earth masses and estimations of the upper\nlimits on the gas mass vary between $10^{-5}$ and $10^{-3}$ Solar mass. In two\nobjects (B331 and B268) free-free emission indicates the presence of ionized\nmaterial around the star. The four serendipitous detections are likely\n(low-mass) YSOs. We compare the derived disk masses of our M17 targets to those\nobtained for YSOs in low-mass star-forming regions (SFRs) and Herbig stars, as\na function of stellar mass, age, luminosity, and outer disk radius. The M17\nsample, though small, is both the most massive and the youngest sample, yet has\nthe lowest mean disk mass.\n",
  "subjects": [
    "Astrophysics/Solar and Stellar Astrophysics",
    "Astrophysics/Earth and Planetary Astrophysics",
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "IWP3sQpv1jlxtUQRBTI7BA07qt5D9tgPiw9em2-mIjU",
  "pdfSize": "2542146"
}