{
  "id": "2412.18047",
  "title": "Uncertainty-Aware Critic Augmentation for Hierarchical Multi-Agent EV\n  Charging Control",
  "authors": "Lo Pang-Yun Ting, Ali \\c{S}enol, Huan-Yang Wang, Hsu-Chao Lai, Kun-Ta\n  Chuang, Huan Liu",
  "authorsParsed": [
    [
      "Ting",
      "Lo Pang-Yun",
      ""
    ],
    [
      "Şenol",
      "Ali",
      ""
    ],
    [
      "Wang",
      "Huan-Yang",
      ""
    ],
    [
      "Lai",
      "Hsu-Chao",
      ""
    ],
    [
      "Chuang",
      "Kun-Ta",
      ""
    ],
    [
      "Liu",
      "Huan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 23:45:45 GMT"
    },
    {
      "version": "v2",
      "created": "Fri, 14 Feb 2025 09:12:45 GMT"
    },
    {
      "version": "v3",
      "created": "Mon, 17 Feb 2025 11:19:13 GMT"
    }
  ],
  "updateDate": "2025-02-18",
  "timestamp": 1734997545000,
  "abstract": "  The advanced bidirectional EV charging and discharging technology, aimed at\nsupporting grid stability and emergency operations, has driven a growing\ninterest in workplace applications. It not only reduces electricity expenses\nbut also enhances the resilience in handling practical matters, such as peak\npower limitation, fluctuating energy prices, and unpredictable EV departures.\nConsidering these factors systematically can benefit energy efficiency in\noffice buildings and for EV users simultaneously. To employ AI to address these\nissues, we propose HUCA, a novel real-time charging control for regulating\nenergy demands for both the building and EVs. HUCA employs hierarchical\nactor-critic networks to dynamically reduce electricity costs in buildings,\naccounting for the needs of EV charging in the dynamic pricing scenario. To\ntackle the uncertain EV departures, we introduce a new critic augmentation to\naccount for departure uncertainties in evaluating the charging decisions, while\nmaintaining the robustness of the charging control. Experiments on real-world\nelectricity datasets under both simulated certain and uncertain departure\nscenarios demonstrate that HUCA outperforms baselines in terms of total\nelectricity costs while maintaining competitive performance in fulfilling EV\ncharging requirements. A case study also manifests that HUCA effectively\nbalances energy supply between the building and EVs based on real-time\ninformation, showcasing its potential as a key AI-driven solution for vehicle\ncharging control.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Systems and Control",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Systems and Control"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "xQoCuMfR18WLnbVQv1bDXSjKtmb4lP5jYimwR1-TmL8",
  "pdfSize": "1219218"
}