{
  "id": "2412.04081",
  "title": "Federated Learning in Mobile Networks: A Comprehensive Case Study on\n  Traffic Forecasting",
  "authors": "Nikolaos Pavlidis, Vasileios Perifanis, Selim F. Yilmaz, Francesc\n  Wilhelmi, Marco Miozzo, Pavlos S. Efraimidis, Remous-Aris Koutsiamanis, Pavol\n  Mulinka, Paolo Dini",
  "authorsParsed": [
    [
      "Pavlidis",
      "Nikolaos",
      ""
    ],
    [
      "Perifanis",
      "Vasileios",
      ""
    ],
    [
      "Yilmaz",
      "Selim F.",
      ""
    ],
    [
      "Wilhelmi",
      "Francesc",
      ""
    ],
    [
      "Miozzo",
      "Marco",
      ""
    ],
    [
      "Efraimidis",
      "Pavlos S.",
      ""
    ],
    [
      "Koutsiamanis",
      "Remous-Aris",
      ""
    ],
    [
      "Mulinka",
      "Pavol",
      ""
    ],
    [
      "Dini",
      "Paolo",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 11:32:14 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733398334000,
  "abstract": "  The increasing demand for efficient resource allocation in mobile networks\nhas catalyzed the exploration of innovative solutions that could enhance the\ntask of real-time cellular traffic prediction. Under these circumstances,\nfederated learning (FL) stands out as a distributed and privacy-preserving\nsolution to foster collaboration among different sites, thus enabling\nresponsive near-the-edge solutions. In this paper, we comprehensively study the\npotential benefits of FL in telecommunications through a case study on\nfederated traffic forecasting using real-world data from base stations (BSs) in\nBarcelona (Spain). Our study encompasses relevant aspects within the federated\nexperience, including model aggregation techniques, outlier management, the\nimpact of individual clients, personalized learning, and the integration of\nexogenous sources of data. The performed evaluation is based on both prediction\naccuracy and sustainability, thus showcasing the environmental impact of\nemployed FL algorithms in various settings. The findings from our study\nhighlight FL as a promising and robust solution for mobile traffic prediction,\nemphasizing its twin merits as a privacy-conscious and environmentally\nsustainable approach, while also demonstrating its capability to overcome data\nheterogeneity and ensure high-quality predictions, marking a significant stride\ntowards its integration in mobile traffic management systems.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "ozfCvK4sLSXEDpZBG2XAwo15kIAt7Ya57or9fqkGw5g",
  "pdfSize": "5703341"
}