{
  "id": "2412.09438",
  "title": "Digital twin of wood working enterprise",
  "authors": "Sergey Masaev, Andrey Minkin, Evgeniy Troyak and Andrey Khrulkevich",
  "authorsParsed": [
    [
      "Masaev",
      "Sergey",
      ""
    ],
    [
      "Minkin",
      "Andrey",
      ""
    ],
    [
      "Troyak",
      "Evgeniy",
      ""
    ],
    [
      "Khrulkevich",
      "Andrey",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 16:49:43 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1734022183000,
  "abstract": "  A review of scientific papers has shown that digital twins are very common\nfor modeling the states of physical objects. It is relevant to consider the\ncreation of a digital twin of an enterprise to obtain various assessments in\nmanagement, taking into account the human factor. In the research, the impact\nof the human factor is assessed by the digital twin and staff competencies. The\nsystem of goals of staff competencies stands for: cognitive, affective,\npsychomotor. An enterprise model is created from the description of the set of\nevents taking place on it. Each event is mapped to an element of staff\ncompetencies target system. The resulting set of staff competencies is\nestimated by a universal (integral) indicator. The dynamics of the universal\nindicator characterizes two modes of operation of the enterprise. The first\noperating mode is normal. The second mode of operation is based on the\nimplementation of staff competencies. Taking into account the competencies of\npersonnel by Bloom's taxonomy allows you to determine their interconnection:\ncognitive, affective, psychomotor. It correlation depends on the work performed\nby the employee and the influence of the external environment. It depends on\nthe efforts of the employee as a learner.\n",
  "subjects": [
    "Mathematics/Optimization and Control"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "ZbyhpKO857CzHtV1_0LloB0gY4QAzOEwgNOquzkDy3w",
  "pdfSize": "181919"
}