{
  "id": "2412.04936",
  "title": "Probing the contents of semantic representations from text, behavior,\n  and brain data using the psychNorms metabase",
  "authors": "Zak Hussain, Rui Mata, Ben R. Newell, Dirk U. Wulff",
  "authorsParsed": [
    [
      "Hussain",
      "Zak",
      ""
    ],
    [
      "Mata",
      "Rui",
      ""
    ],
    [
      "Newell",
      "Ben R.",
      ""
    ],
    [
      "Wulff",
      "Dirk U.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 10:44:20 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733481860000,
  "abstract": "  Semantic representations are integral to natural language processing,\npsycholinguistics, and artificial intelligence. Although often derived from\ninternet text, recent years have seen a rise in the popularity of\nbehavior-based (e.g., free associations) and brain-based (e.g., fMRI)\nrepresentations, which promise improvements in our ability to measure and model\nhuman representations. We carry out the first systematic evaluation of the\nsimilarities and differences between semantic representations derived from\ntext, behavior, and brain data. Using representational similarity analysis, we\nshow that word vectors derived from behavior and brain data encode information\nthat differs from their text-derived cousins. Furthermore, drawing on our\npsychNorms metabase, alongside an interpretability method that we call\nrepresentational content analysis, we find that, in particular, behavior\nrepresentations capture unique variance on certain affective, agentic, and\nsocio-moral dimensions. We thus establish behavior as an important complement\nto text for capturing human representations and behavior. These results are\nbroadly relevant to research aimed at learning human-aligned semantic\nrepresentations, including work on evaluating and aligning large language\nmodels.\n",
  "subjects": [
    "Computer Science/Computation and Language",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Js4thbWxoIRURxvxE3WbHUkJ4lpvQX1jhx1CNU2fPKg",
  "pdfSize": "4352591"
}