{"id":"2412.05364","title":"TiDES -- Young Supernova Selection Pipeline","authors":"Harry Addison, Chris Frohmaier, Kate Maguire, Robert C. Nichol, Isobel\n  Hook, Stephen J. Smartt","authorsParsed":[["Addison","Harry",""],["Frohmaier","Chris",""],["Maguire","Kate",""],["Nichol","Robert C.",""],["Hook","Isobel",""],["Smartt","Stephen J.",""]],"versions":[{"version":"v1","created":"Fri, 6 Dec 2024 19:00:05 GMT"}],"updateDate":"2024-12-10","timestamp":1733511605000,"abstract":"  Early-time spectroscopy of supernovae (SNe), acquired within days of\nexplosion, yields crucial insights into their outermost ejecta layers,\nfacilitating the study of their environments, progenitor systems, and explosion\nmechanisms. Recent efforts in early discovery and follow-up of SNe have shown\nthe potential insights that can be gained from early-time spectra. The\nTime-Domain Extragalactic Survey (TiDES), conducted with the 4-meter\nMulti-Object Spectroscopic Telescope (4MOST), will provide spectroscopic\nfollow-up of transients discovered by the Legacy Survey of Space and Time\n(LSST). Current simulations indicate that early-time spectroscopic studies\nconducted with TiDES data will be limited by the current SN selection criteria.\nTo enhance TiDES's capability for early-time SN spectroscopic studies, we\npropose an additional set of selection criteria focusing on early-time (young)\nSNe (YSNe). Utilising the Zwicky Transient Facility live transient alerts, we\ndeveloped criteria to select YSNe while minimising the sample's contamination\nrate to 28 percent. The developed criteria were applied to LSST simulations,\nyielding a sample of 1167 Deep Drilling Field survey SNe and 67388 Wide Fast\nDeep survey SNe for follow-up with 4MOST. We demonstrate that our criteria\nenables the selection of SNe at early-times, enhancing TiDES's future\nearly-time spectroscopic SN studies. Finally, we investigated 4MOST-like\nobserving strategies to increase the sample of spectroscopically observed YSNe.\nWe propose that a 4MOST-like observing strategy that follows LSST with a delay\nof 3 days is optimal for the TiDES SN survey, while a 1 day delay is most\noptimal for enhancing the early-time science in conjunction with our YSN\nselection criteria.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0BVayQ91BAj7kApsUZpKh4ZrjAKqNaIjbQX1BmmFCsc","pdfSize":"1066742"}