{"id":"2412.14054","title":"Digestion Algorithm in Hierarchical Symbolic Forests: A Fast Text\n  Normalization Algorithm and Semantic Parsing Framework for Specific Scenarios\n  and Lightweight Deployment","authors":"Kevin You","authorsParsed":[["You","Kevin",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 17:05:49 GMT"}],"updateDate":"2024-12-19","timestamp":1734541549000,"abstract":"  Text Normalization and Semantic Parsing have numerous applications in natural\nlanguage processing, such as natural language programming, paraphrasing, data\naugmentation, constructing expert systems, text matching, and more. Despite the\nprominent achievements of deep learning in Large Language Models (LLMs), the\ninterpretability of neural network architectures is still poor, which affects\ntheir credibility and hence limits the deployments of risk-sensitive scenarios.\nIn certain scenario-specific domains with scarce data, rapidly obtaining a\nlarge number of supervised learning labels is challenging, and the workload of\nmanually labeling data would be enormous. Catastrophic forgetting in neural\nnetworks further leads to low data utilization rates. In situations where swift\nresponses are vital, the density of the model makes local deployment difficult\nand the response time long, which is not conducive to local applications of\nthese fields. Inspired by the multiplication rule, a principle of combinatorial\nmathematics, and human thinking patterns, a multilayer framework along with its\nalgorithm, the Digestion Algorithm in Hierarchical Symbolic Forests (DAHSF), is\nproposed to address these above issues, combining text normalization and\nsemantic parsing workflows. The Chinese Scripting Language \"Fire Bunny\nIntelligent Development Platform V2.0\" is an important test and application of\nthe technology discussed in this paper. DAHSF can run locally in\nscenario-specific domains on little datasets, with model size and memory usage\noptimized by at least two orders of magnitude, thus improving the execution\nspeed, and possessing a promising optimization outlook.\n","subjects":["Computer Science/Computation and Language","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"pUhvHYXsJYCfm-QezwaZPHRhzoaWfuDiZSCVE2F80Ww","pdfSize":"515954"}