{"id":"2412.18167","title":"Dependence of the estimated electric potential in thunderstorms observed\n  at GRAPES-3 on the hadronic interaction generators used in simulations","authors":"B. Hariharan, S.K. Gupta, Y. Hayashi, P. Jagadeesan, A. Jain, S.\n  Kawakami, H. Kojima, P.K. Mohanty, Y. Muraki, P.K. Nayak, A. Oshima, M.\n  Rameez, K. Ramesh, L.V. Reddy, S. Shibata, M. Zuberi","authorsParsed":[["Hariharan","B.",""],["Gupta","S. K.",""],["Hayashi","Y.",""],["Jagadeesan","P.",""],["Jain","A.",""],["Kawakami","S.",""],["Kojima","H.",""],["Mohanty","P. K.",""],["Muraki","Y.",""],["Nayak","P. K.",""],["Oshima","A.",""],["Rameez","M.",""],["Ramesh","K.",""],["Reddy","L. V.",""],["Shibata","S.",""],["Zuberi","M.",""]],"versions":[{"version":"v1","created":"Tue, 24 Dec 2024 04:59:24 GMT"}],"updateDate":"2024-12-25","timestamp":1735016364000,"abstract":"  A potential difference of 1.3 Giga-Volts (GV) was inferred across a\nthundercloud using data from the GRAPES-3 muon telescope (G3MT). This was the\nfirst-ever estimation of gigavolt potential in thunderstorms, confirming\nprediction of C.T.R. Wilson almost a century ago. To infer the thundercloud\npotential required acceleration of muons in atmospheric electric field to be\nincorporated in the Monte Carlo simulation software CORSIKA. The G3MT records\nover 4 billion muons daily that are grouped into 169 directions covering 2.3 sr\nsky. This enabled changes as small as 0.1% in the muon flux on minute\ntimescale, caused by thunderstorms to be accurately measured. But that requires\nhigh statistics simulation of muon fluxes in thunderstorm electric fields. The\nCORSIKA offers a choice of several generators for low- (FLUKA, GHEISHA, and\nUrQMD) and high-energy (SIBYLL, EPOS-LHC, and QGSJETII) hadronic interactions.\nSince it is unclear which combination of the low- and high-energy generators\nprovides the correct description of hadronic interactions, all nine\ncombinations of generators were explored, and they yielded thundercloud\npotentials ranging from 1.3 GV to 1.6 GV for the event recorded on 1 December\n2014. The result of SIBYLL-FLUKA combination yielded the lowest electric\npotential of 1.3 GV was reported. Furthermore, another seven major thunderstorm\nevents recorded between April 2011 and December 2020 were analyzed to measure\nthe dependence of their thundercloud potential on the hadronic interaction\ngenerators. It is observed that the low-energy generators produce larger\nvariation ($\\sim$14%) in thundercloud potential than the high-energy generators\n($\\sim$8%). This probably reflects the fact that the GeV muons are\npredominantly produced in low-energy ($<$80 GeV) interactions, which\neffectively magnifies the differences in the meson production cross-sections\namong the low-energy generators.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"2G5gzgWkUPolyCS_7fP02i2Of7IA_XNjQ8adlJiG8aY","pdfSize":"699808"}