{
  "id": "2412.19464",
  "title": "MNet-SAt: A Multiscale Network with Spatial-enhanced Attention for\n  Segmentation of Polyps in Colonoscopy",
  "authors": "Chandravardhan Singh Raghaw, Aryan Yadav, Jasmer Singh Sanjotra,\n  Shalini Dangi, Nagendra Kumar",
  "authorsParsed": [
    [
      "Raghaw",
      "Chandravardhan Singh",
      ""
    ],
    [
      "Yadav",
      "Aryan",
      ""
    ],
    [
      "Sanjotra",
      "Jasmer Singh",
      ""
    ],
    [
      "Dangi",
      "Shalini",
      ""
    ],
    [
      "Kumar",
      "Nagendra",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 27 Dec 2024 05:17:29 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735276649000,
  "abstract": "  Objective: To develop a novel deep learning framework for the automated\nsegmentation of colonic polyps in colonoscopy images, overcoming the\nlimitations of current approaches in preserving precise polyp boundaries,\nincorporating multi-scale features, and modeling spatial dependencies that\naccurately reflect the intricate and diverse morphology of polyps. Methods: To\naddress these limitations, we propose a novel Multiscale Network with\nSpatial-enhanced Attention (MNet-SAt) for polyp segmentation in colonoscopy\nimages. This framework incorporates four key modules: Edge-Guided Feature\nEnrichment (EGFE) preserves edge information for improved boundary quality;\nMulti-Scale Feature Aggregator (MSFA) extracts and aggregates multi-scale\nfeatures across channel spatial dimensions, focusing on salient regions;\nSpatial-Enhanced Attention (SEAt) captures spatial-aware global dependencies\nwithin the multi-scale aggregated features, emphasizing the region of interest;\nand Channel-Enhanced Atrous Spatial Pyramid Pooling (CE-ASPP) resamples and\nrecalibrates attentive features across scales. Results: We evaluated MNet-SAt\non the Kvasir-SEG and CVC-ClinicDB datasets, achieving Dice Similarity\nCoefficients of 96.61% and 98.60%, respectively. Conclusion: Both quantitative\n(DSC) and qualitative assessments highlight MNet-SAt's superior performance and\ngeneralization capabilities compared to existing methods. Significance:\nMNet-SAt's high accuracy in polyp segmentation holds promise for improving\nclinical workflows in early polyp detection and more effective treatment,\ncontributing to reduced colorectal cancer mortality rates.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "skm87Y0u7oLElKWdKeA5iXa5wF3auVA8TDrIcmht4t8",
  "pdfSize": "5571342"
}