{"id":"2412.14698","title":"Geometrical optics for the fractional Helmholtz equation and\n  applications to inverse problems","authors":"Giovanni Covi and Maarten de Hoop and Mikko Salo","authorsParsed":[["Covi","Giovanni",""],["de Hoop","Maarten",""],["Salo","Mikko",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 10:02:42 GMT"}],"updateDate":"2024-12-20","timestamp":1734602562000,"abstract":"  In this paper we construct a parametrix for the fractional Helmholtz equation\n$((-\\Delta)^s - \\tau^{2s} r(x)^{2s} + q(x))u=0$ making use of geometrical\noptics solutions. We show that the associated eikonal equation is the same as\nin the classical case, while in the first transport equation the effect of\nnonlocality is only visible in the zero-th order term, which depends on $s$.\nMoreover, we show that the approximate geometrical optics solutions present\ndifferent behaviors in the regimes $s\\in(0,\\frac 12)$ and $s\\in [\\frac 12,1)$.\nWhile the latter case is quite similar to the classical one, which corresponds\nto $s=1$, in the former case we find that the potential is a strong\nperturbation, which changes the propagation of singularities. As an\napplication, we study the inverse problem consisting in recovering the\npotential $q$ from Cauchy data when the refraction index $r$ is fixed and\nsimple. Using our parametrix based on the construction of approximate\ngeometrical optics solutions, we prove that H\\\"older stability holds for this\nproblem. This is a substantial improvement over the state of the art for\nfractional wave equations, for which the usual Runge approximation argument can\nprovide only logarithmic stability. Besides its mathematical novelty, this\nstudy is motivated by envisioned applications in nonlocal elasticity models\nemerging from the geophysical sciences.\n","subjects":["Mathematics/Analysis of PDEs"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Re14-HCmMPGaSyj_b0CvkPe1yF0Lrj-cl-gNCujtoW8","pdfSize":"382133"}