{
  "id": "2412.02521",
  "title": "Optimisation of Categorical Choices in Exploration Mission Concepts of\n  Operations Using Column Generation Method",
  "authors": "Nicholas Gollins, Masafumi Isaji, Koki Ho",
  "authorsParsed": [
    [
      "Gollins",
      "Nicholas",
      ""
    ],
    [
      "Isaji",
      "Masafumi",
      ""
    ],
    [
      "Ho",
      "Koki",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 16:14:31 GMT"
    }
  ],
  "updateDate": "2024-12-04",
  "timestamp": 1733242471000,
  "abstract": "  Space missions, particularly complex, large-scale exploration campaigns, can\noften involve many discrete decisions or events in their concepts of\noperations. Whilst a variety of methods exist for the optimisation of\ncontinuous variables in mission design, the inherent presence of discrete\nevents in mission ConOps disrupts the possibility of using methods that are\ndependent on having well-defined, continuous mathematical expressions to define\nthe systems. Typically, mission architects will circumvent this problem by\nsolving the system optimisation for every permutation of the categorical\ndecisions if practical, or use metaheuristic solvers if not. However, this can\nbe prohibitively expensive in terms of computation time. Alternatively,\ncategorical decisions in optimisation problems can be expressed using binary\nvariables. If implemented naively, commercially available MILP solvers are\nstill slow to solve such a problem. Problems of this class can be solved more\nefficiently using column generation methods. Here, restricted problems are\ncreated by removing significant numbers of variables. The restricted problem is\nsolved, and the unused variables are priced to test which, if any, could\nimprove the objective of the restricted problem if they were to be added.\nColumn generation methods are problem-specific, and so there is no guaranteed\nsolution to these categorical problems. As such, the following paper proposes\nguidelines for defining restricted problems representing space exploration\nmission concepts of operations. The column generation process is described and\nthen applied to two case studies: a ConOps for a crewed Mars mission, in which\nthe design, assembly, and staging of the trans-Martian spacecraft is modelled\nusing discrete decisions; and the payload delivery scheduling of translunar\nlogistics in the context of an extended Artemis surface exploration campaign.\n",
  "subjects": [
    "Mathematics/Optimization and Control"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "49LRrEs7Xg5GTsSD4OBJdAVCflEyLs4XLCJmN7lCsmQ",
  "pdfSize": "1005723"
}