{
  "id": "2412.09775",
  "title": "waveOrder: generalist framework for label-agnostic computational\n  microscopy",
  "authors": "Talon Chandler, Eduardo Hirata-Miyasaki, Ivan E. Ivanov, Ziwen Liu,\n  Deepika Sundarraman, Allyson Quinn Ryan, Adrian Jacobo, Keir Balla, Shalin B.\n  Mehta",
  "authorsParsed": [
    [
      "Chandler",
      "Talon",
      ""
    ],
    [
      "Hirata-Miyasaki",
      "Eduardo",
      ""
    ],
    [
      "Ivanov",
      "Ivan E.",
      ""
    ],
    [
      "Liu",
      "Ziwen",
      ""
    ],
    [
      "Sundarraman",
      "Deepika",
      ""
    ],
    [
      "Ryan",
      "Allyson Quinn",
      ""
    ],
    [
      "Jacobo",
      "Adrian",
      ""
    ],
    [
      "Balla",
      "Keir",
      ""
    ],
    [
      "Mehta",
      "Shalin B.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 00:58:10 GMT"
    },
    {
      "version": "v2",
      "created": "Fri, 20 Dec 2024 22:52:02 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734051490000,
  "abstract": "  Correlative computational microscopy is accelerating the mapping of dynamic\nbiological systems by integrating morphological and molecular measurements\nacross spatial scales, from organelles to entire organisms. Visualization,\nmeasurement, and prediction of interactions among the components of biological\nsystems can be accelerated by generalist computational imaging frameworks that\nrelax the trade-offs imposed by multiplex dynamic imaging. This work reports a\ngeneralist framework for wave optical imaging of the architectural order\n(waveOrder) among biomolecules for encoding and decoding multiple specimen\nproperties from a minimal set of acquired channels, with or without fluorescent\nlabels. waveOrder expresses material properties in terms of elegant physically\nmotivated basis vectors directly interpretable as phase, absorption,\nbirefringence, diattenuation, and fluorophore density; and it expresses image\ndata in terms of directly measurable Stokes parameters. We report a\ncorresponding multi-channel reconstruction algorithm to recover specimen\nproperties in multiple contrast modes. With this framework, we implement\nmultiple 3D computational microscopy methods, including quantitative phase\nimaging, quantitative label-free imaging with phase and polarization, and\nfluorescence deconvolution imaging, across scales ranging from organelles to\nwhole zebrafish. These advances are available via an extensible open-source\ncomputational imaging library, waveOrder, and a napari plugin, recOrder.\n",
  "subjects": [
    "Physics/Optics",
    "Computer Science/Computer Vision and Pattern Recognition",
    "Quantitative Biology/Quantitative Methods"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "ePYw7xyCrps7CkL5xCW3tAUuirAc3qPdqg9N7nHtAUY",
  "pdfSize": "16863452"
}