{"id":"2412.17286","title":"The Unique Helium Nova V445 Puppis Ejected $\\gg$0.001 M$_{\\odot}$ in the\n  Year 2000 and Will Not Become a Type Ia Supernova","authors":"Bradley E. Schaefer (Louisiana State University)","authorsParsed":[["Schaefer","Bradley E.","","Louisiana State University"]],"versions":[{"version":"v1","created":"Mon, 23 Dec 2024 05:10:26 GMT"}],"updateDate":"2024-12-24","timestamp":1734930626000,"abstract":"  V445 Puppis is the only known example of a helium nova, where a layer of\nhelium-rich gas accretes onto the surface of a white dwarf in a cataclysmic\nvariable, with runaway helium burning making for the nova event. Speculatively,\nhelium nova can provide one path to produce a Type Ia supernova (SNIa), within\nthe larger framework of single-degenerate models. Relatively little has been\nknown about V445 Pup, with this work reporting the discovery of the orbital\nperiod near 1.87 days. The companion star is 2.65$\\pm$0.35 R$_{\\odot}$ in\nradius as an evolved giant star stripped of its outer hydrogen envelope. The\norbital period immediately before the 2000 eruption was $P_{\\rm\npre}$=1.871843$\\pm$0.000014 days, with a steady period change of\n(-0.17$\\pm$0.06)$\\times$10$^{-8}$ from 1896--1995. The period immediately after\nthe nova eruption was $P_{\\rm post}$=1.873593$\\pm$0.000034 days, with a\n$\\dot{P}$ of ($-$4.7$\\pm$0.5)$\\times$10$^{-8}$. The fractional orbital period\nchange ($\\Delta P/P$) is $+$935$\\pm$27 ppm. This restricts the mass of the\ngases ejected in the nova eruption to be $\\gg$0.001M$_{\\odot}$, and much\ngreater than the mass accreted to trigger the nova. So the white dwarf is\nlosing mass over each eruption cycle, and will not become a SNIa. Further, for\nV445 Pup and helium novae in general, I collect observations from 136 normal\nSNIa, for which any giant or sub-giant companion star would have been detected,\nyet zero companions are found. This is an independent proof that V445 Pup and\nhelium novae are not SNIa progenitors.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Ma6k12sPpO0bA8BwppoVTJKXWP99c2SkQPSNIfCedwI","pdfSize":"934805"}