{
  "id": "2412.17492",
  "title": "On the number of $k$-mers admitting a given lexicographical minimizer",
  "authors": "Florian Ingels and Camille Marchet and Mika\\\"el Salson",
  "authorsParsed": [
    [
      "Ingels",
      "Florian",
      ""
    ],
    [
      "Marchet",
      "Camille",
      ""
    ],
    [
      "Salson",
      "Mikaël",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 11:41:56 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 24 Dec 2024 09:48:02 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1734954116000,
  "abstract": "  The minimizer of a word of size $k$ (a $k$-mer) is defined as its smallest\nsubstring of size $m$ (with $m\\leq k$), according to some ordering on $m$-mers.\nminimizers have been used in bioinformatics -- notably -- to partition\nsequencing datasets, binning together $k$-mers that share the same minimizer.\nIt is folklore that using the lexicographical order lead to very unbalanced\npartitions, resulting in an abundant literature devoted to devising alternative\norders for achieving better balanced partitions. To the best of our knowledge,\nthe unbalanced-ness of lexicographical-based minimizer partitions has never\nbeen investigated from a theoretical point of view. In this article, we aim to\nfill this gap and determine, for a given minimizer, how many $k$-mers would\nadmit the chosen minimizer -- i.e. what would be the size of the bucket\nassociated to the chosen minimizer in the worst case, where all $k$-mers would\nbe seen in the data. We show that this number can be computed in $O(km)$ space\nand $O(km^2)$ time. We further introduce approximations that can be computed in\n$O(k)$ space and $O(km)$ time. We also show on genomic datasets that the\npractical number of $k$-mers associated to a minimizer are closely correlated\nto the theoretical expected number. We introduce two conjectures that could\nhelp closely approximating the total number of $k$-mers sharing a minimizer. We\nbelieve that characterising the distribution of the number of $k$-mers per\nminimizer will help devise efficient lexicographic-based minimizer bucketting.\n",
  "subjects": [
    "Computer Science/Data Structures and Algorithms",
    "Computer Science/Discrete Mathematics",
    "Mathematics/Combinatorics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "UGjrosACIheFB6wF9Hh_rmFkkWjh0kcvIiZhtaIpDiI",
  "pdfSize": "4617197"
}