{"id":"2412.18020","title":"Roadmap on Quantum Magnetic Materials","authors":"Antonija Grubi\\v{s}i\\'c-\\v{C}abo, Marcos H. D. Guimar\\~aes, Dmytro\n  Afanasiev, Jose H. Garcia Aguilar, Irene Aguilera, Mazhar N. Ali, Semonti\n  Bhattacharyya, Yaroslav M. Blanter, Rixt Bosma, Zhiyuan Cheng, Zhiying Dan,\n  Saroj P. Dash, Joaqu\\'in Medina Due\\~nas, Joaqu\\'in Fernandez-Rossier, Marco\n  Gibertini, Sergii Grytsiuk, Maurits J. A. Houmes, Anna Isaeva, Chrystalla\n  Knekna, Arnold H. Kole, Samer Kurdi, Jose Lado, Samuel Ma\\~nas-Valero, J.\n  Marcelo J. Lopes, Damiano Marian, Mengxing Na, Falk Pabst, Sergio Barquero\n  Pierantoni, Mexx Regout, Riccardo Reho, Malte R\\\"osner, David Sanz, Toeno van\n  der Sar, Jagoda S{\\l}awi\\'nska, Matthieu J. Verstraete, Muhammad Waseem,\n  Herre S. J. van der Zant, Zeila Zanolli and David Soriano","authorsParsed":[["Grubišić-Čabo","Antonija",""],["Guimarães","Marcos H. D.",""],["Afanasiev","Dmytro",""],["Aguilar","Jose H. Garcia",""],["Aguilera","Irene",""],["Ali","Mazhar N.",""],["Bhattacharyya","Semonti",""],["Blanter","Yaroslav M.",""],["Bosma","Rixt",""],["Cheng","Zhiyuan",""],["Dan","Zhiying",""],["Dash","Saroj P.",""],["Dueñas","Joaquín Medina",""],["Fernandez-Rossier","Joaquín",""],["Gibertini","Marco",""],["Grytsiuk","Sergii",""],["Houmes","Maurits J. A.",""],["Isaeva","Anna",""],["Knekna","Chrystalla",""],["Kole","Arnold H.",""],["Kurdi","Samer",""],["Lado","Jose",""],["Mañas-Valero","Samuel",""],["Lopes","J. Marcelo J.",""],["Marian","Damiano",""],["Na","Mengxing",""],["Pabst","Falk",""],["Pierantoni","Sergio Barquero",""],["Regout","Mexx",""],["Reho","Riccardo",""],["Rösner","Malte",""],["Sanz","David",""],["van der Sar","Toeno",""],["Sławińska","Jagoda",""],["Verstraete","Matthieu J.",""],["Waseem","Muhammad",""],["van der Zant","Herre S. J.",""],["Zanolli","Zeila",""],["Soriano","David",""]],"versions":[{"version":"v1","created":"Mon, 23 Dec 2024 22:32:10 GMT"}],"updateDate":"2024-12-25","timestamp":1734993130000,"abstract":"  Fundamental research on two-dimensional (2D) magnetic systems based on van\nder Waals materials has been gaining traction rapidly since their recent\ndiscovery. With the increase of recent knowledge, it has become clear that such\nmaterials have also a strong potential for applications in devices that combine\nmagnetism with electronics, optics, and nanomechanics. Nonetheless, many\nchallenges still lay ahead. Several fundamental aspects of 2D magnetic\nmaterials are still unknown or poorly understood, such as their\noften-complicated electronic structure, optical properties, and magnetization\ndynamics, and their magnon spectrum. To elucidate their properties and\nfacilitate integration in devices, advanced characterization techniques and\ntheoretical frameworks need to be developed or adapted. Moreover, developing\nsynthesis methods which increase critical temperatures and achieve large-scale,\nhigh-quality homogeneous thin films is crucial before these materials can be\nused for real-world applications. Therefore, the field of 2D magnetic materials\nprovides many challenges and opportunities for the discovery and exploration of\nnew phenomena, as well as the development of new applications. This Roadmap\npresents the background, challenges, and potential research directions for\nvarious relevant topics in the field on the fundamentals, synthesis,\ncharacterization, and applications. We hope that this work can provide a strong\nstarting point for young researchers in the field and provide a general\noverview of the key challenges for more experienced researchers.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"UfJcz2EMsx5XQ8vr0bMv3oy6-0ZHD7f2fzQe7F1wOCI","pdfSize":"5773470"}