{
  "id": "2412.04950",
  "title": "Bed-Attached Vibration Sensor System: A Machine Learning Approach for\n  Fall Detection in Nursing Homes",
  "authors": "Thomas Bartz-Beielstein, Axel Wellendorf, Noah P\\\"utz, Jens Brandt,\n  Alexander Hinterleitner, Richard Schulz, Richard Scholz, Olaf Mersmann, Robin\n  Knabe",
  "authorsParsed": [
    [
      "Bartz-Beielstein",
      "Thomas",
      ""
    ],
    [
      "Wellendorf",
      "Axel",
      ""
    ],
    [
      "Pütz",
      "Noah",
      ""
    ],
    [
      "Brandt",
      "Jens",
      ""
    ],
    [
      "Hinterleitner",
      "Alexander",
      ""
    ],
    [
      "Schulz",
      "Richard",
      ""
    ],
    [
      "Scholz",
      "Richard",
      ""
    ],
    [
      "Mersmann",
      "Olaf",
      ""
    ],
    [
      "Knabe",
      "Robin",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 11:08:47 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733483327000,
  "abstract": "  The increasing shortage of nursing staff and the acute risk of falls in\nnursing homes pose significant challenges for the healthcare system. This study\npresents the development of an automated fall detection system integrated into\ncare beds, aimed at enhancing patient safety without compromising privacy\nthrough wearables or video monitoring. Mechanical vibrations transmitted\nthrough the bed frame are processed using a short-time Fourier transform,\nenabling robust classification of distinct human fall patterns with a\nconvolutional neural network. Challenges pertaining to the quantity and\ndiversity of the data are addressed, proposing the generation of additional\ndata with a specific emphasis on enhancing variation. While the model shows\npromising results in distinguishing fall events from noise using lab data,\nfurther testing in real-world environments is recommended for validation and\nimprovement. Despite limited available data, the proposed system shows the\npotential for an accurate and rapid response to falls, mitigating health\nimplications, and addressing the needs of an aging population. This case study\nwas performed as part of the ZIM Project. Further research on sensors enhanced\nby artificial intelligence will be continued in the ShapeFuture Project.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "mthtVcpq1CtHXJ9yOHN8Kd7vW_96KxsWMBE6-txGvfk",
  "pdfSize": "5942573"
}