{"id":"2412.20733","title":"Towards nation-wide analytical healthcare infrastructures: A\n  privacy-preserving augmented knee rehabilitation case study","authors":"Boris Ba\\v{c}i\\'c, Claudiu Vasile, Chengwei Feng, Marian G. Ciuc\\u{a}","authorsParsed":[["Bačić","Boris",""],["Vasile","Claudiu",""],["Feng","Chengwei",""],["Ciucă","Marian G.",""]],"versions":[{"version":"v1","created":"Mon, 30 Dec 2024 06:14:48 GMT"}],"updateDate":"2024-12-31","timestamp":1735539288000,"abstract":"  The purpose of this paper is to contribute towards the near-future\nprivacy-preserving big data analytical healthcare platforms, capable of\nprocessing streamed or uploaded timeseries data or videos from patients. The\nexperimental work includes a real-life knee rehabilitation video dataset\ncapturing a set of exercises from simple and personalised to more general and\nchallenging movements aimed for returning to sport. To convert video from\nmobile into privacy-preserving diagnostic timeseries data, we employed Google\nMediaPipe pose estimation. The developed proof-of-concept algorithms can\naugment knee exercise videos by overlaying the patient with stick figure\nelements while updating generated timeseries plot with knee angle estimation\nstreamed as CSV file format. For patients and physiotherapists, video with\nside-to-side timeseries visually indicating potential issues such as excessive\nknee flexion or unstable knee movements or stick figure overlay errors is\npossible by setting a-priori knee-angle parameters. To address adherence to\nrehabilitation programme and quantify exercise sets and repetitions, our\nadaptive algorithm can correctly identify (91.67%-100%) of all exercises from\nside- and front-view videos. Transparent algorithm design for adaptive visual\nanalysis of various knee exercise patterns contributes towards the\ninterpretable AI and will inform near-future privacy-preserving, non-vendor\nlocking, open-source developments for both end-user computing devices and as\non-premises non-proprietary cloud platforms that can be deployed within the\nnational healthcare system.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Artificial Intelligence","Computer Science/Computers and Society","Computer Science/Multimedia"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"KM-ZV60JYjE0qpK0Wd71ZEfPhDqM8m5v3gCWu-RcI-E","pdfSize":"1883798"}