{"id":"2412.03798","title":"Prediction of polarization vortices, charge modulation, flat bands, and\n  moir\\'e magnetism in twisted oxide bilayers","authors":"Naafis Ahnaf Shahed, Kartik Samanta, Mohamed Elekhtiar, Kai Huang,\n  Chang-Beom Eom, Mark S. Rzchowski, Kirill D. Belashchenko, and Evgeny Y.\n  Tsymbal","authorsParsed":[["Shahed","Naafis Ahnaf",""],["Samanta","Kartik",""],["Elekhtiar","Mohamed",""],["Huang","Kai",""],["Eom","Chang-Beom",""],["Rzchowski","Mark S.",""],["Belashchenko","Kirill D.",""],["Tsymbal","Evgeny Y.",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 01:41:15 GMT"}],"updateDate":"2024-12-06","timestamp":1733362875000,"abstract":"  The recent surge of interest in moir\\'e superlattices of twisted van der\nWaals compounds has spotlighted the emergence of unconventional\nsuperconductivity and novel electronic phases. However, the range of moir\\'e\nphenomena can be dramatically expanded by incorporating complex oxide materials\ninto twisted heterostructures. In this study, motivated by the recent\nbreakthroughs in synthesis of free-standing oxide membranes, we explore the\nemergent structural and electronic properties of twisted oxide bilayers. We\nfocus on the classic perovskite oxide, SrTiO3, and design SrTiO3 bilayers with\na relative twist between the individual layers. Using density functional theory\ncalculations, we predict the appearance of vortex-antivortex polarization\npatterns at the interface of the SrTiO3 bilayers driven by twist. We also\npredict charge modulation of the interfacial Ti ions induced by varying local\ncoordination which follow the moir\\'e pattern. Furthermore, we forecast the\nemergence of flat bands at large twist angles and the associated localized\nelectronic states with moir\\'e-periodic charge density, originating from the\ninterlayer bonding effects resulting in the formation of dangling bonds.\nFinally, we predict that hole doping induces unconventional d0 magnetism in\notherwise nonmagnetic SrTiO3, driven by the exchange splitting of the\nhigh-density O-p bands and producing the spin density with moir\\'e periodicity.\nThese results demonstrate a broad landscape of emergent phenomena which may\noccur in moir\\'e-engineered oxide heterostructures showing far-reaching\nperspectives of these material systems for further fundamental studies and\npotential applications.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"t97dT7cECdmqpFZNh0uy4jne0J2s2FvMVnASV-_yi6I","pdfSize":"8517664"}