{"id":"2412.14776","title":"Collaborative Problem Solving in Mixed Reality: A Study on Visual Graph\n  Analysis","authors":"Dimitar Garkov, Tommaso Piselli, Emilio Di Giacomo, Karsten Klein,\n  Giuseppe Liotta, Fabrizio Montecchiani, Falk Schreiber","authorsParsed":[["Garkov","Dimitar",""],["Piselli","Tommaso",""],["Di Giacomo","Emilio",""],["Klein","Karsten",""],["Liotta","Giuseppe",""],["Montecchiani","Fabrizio",""],["Schreiber","Falk",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 12:02:47 GMT"},{"version":"v2","created":"Fri, 10 Jan 2025 12:39:47 GMT"}],"updateDate":"2025-01-13","timestamp":1734609767000,"abstract":"  Problem solving is a composite cognitive process, invoking a number of\nsystems and subsystems, such as perception and memory. Individuals may form\ncollectives to solve a given problem together, in collaboration, especially\nwhen complexity is thought to be high. To determine if and when collaborative\nproblem solving is desired, we must quantify collaboration first. For this, we\ninvestigate the practical virtue of collaborative problem solving. Using visual\ngraph analysis, we perform a study with 72 participants in two countries and\nthree languages. We compare ad hoc pairs to individuals and nominal pairs,\nsolving two different tasks on graphs in visuospatial mixed reality. The\naverage collaborating pair does not outdo its nominal counterpart, but it does\nhave a significant trade-off against the individual: an ad hoc pair uses 1.46\nmore time to achieve 4.6 higher accuracy. We also use the concept of task\ninstance complexity to quantify differences in complexity. As task instance\ncomplexity increases, these differences largely scale, though with two notable\nexceptions. With this study we show the importance of using nominal groups as\nbenchmark in collaborative virtual environments research. We conclude that a\nmixed reality environment does not automatically imply superior collaboration.\n","subjects":["Computer Science/Human-Computer Interaction","Computer Science/Emerging Technologies","Computer Science/Graphics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"HkcUyspc4RcaICueFPmw1Sg3QyuFrrm9OLiecjmX17g","pdfSize":"2880655"}