{
  "id": "2412.08578",
  "title": "Machine Learning Information Retrieval and Summarisation to Support\n  Systematic Review on Outcomes Based Contracting",
  "authors": "Iman Munire Bilal, Zheng Fang, Miguel Arana-Catania, Felix-Anselm van\n  Lier, Juliana Outes Velarde, Harry Bregazzi, Eleanor Carter, Mara Airoldi,\n  Rob Procter",
  "authorsParsed": [
    [
      "Bilal",
      "Iman Munire",
      ""
    ],
    [
      "Fang",
      "Zheng",
      ""
    ],
    [
      "Arana-Catania",
      "Miguel",
      ""
    ],
    [
      "van Lier",
      "Felix-Anselm",
      ""
    ],
    [
      "Velarde",
      "Juliana Outes",
      ""
    ],
    [
      "Bregazzi",
      "Harry",
      ""
    ],
    [
      "Carter",
      "Eleanor",
      ""
    ],
    [
      "Airoldi",
      "Mara",
      ""
    ],
    [
      "Procter",
      "Rob",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 17:54:01 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733939641000,
  "abstract": "  As academic literature proliferates, traditional review methods are\nincreasingly challenged by the sheer volume and diversity of available\nresearch. This article presents a study that aims to address these challenges\nby enhancing the efficiency and scope of systematic reviews in the social\nsciences through advanced machine learning (ML) and natural language processing\n(NLP) tools. In particular, we focus on automating stages within the systematic\nreviewing process that are time-intensive and repetitive for human annotators\nand which lend themselves to immediate scalability through tools such as\ninformation retrieval and summarisation guided by expert advice. The article\nconcludes with a summary of lessons learnt regarding the integrated approach\ntowards systematic reviews and future directions for improvement, including\nexplainability.\n",
  "subjects": [
    "Computer Science/Computation and Language",
    "Computer Science/Computers and Society",
    "Computer Science/Digital Libraries",
    "Computer Science/Human-Computer Interaction"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "P-Nvpt_7T2iDvnsni4zPivSvagNSiycXt0LKURDeFUc",
  "pdfSize": "960876"
}