{"id":"2412.14993","title":"Single-Photon Advantage in Quantum Cryptography Beyond QKD","authors":"Daniel A. Vajner, Koray Kaymazlar, Fenja Drauschke, Lucas Rickert,\n  Martin von Helversen, Hanqing Liu, Shulun Li, Haiqiao Ni, Zhichuan Niu, Anna\n  Pappa, and Tobias Heindel","authorsParsed":[["Vajner","Daniel A.",""],["Kaymazlar","Koray",""],["Drauschke","Fenja",""],["Rickert","Lucas",""],["von Helversen","Martin",""],["Liu","Hanqing",""],["Li","Shulun",""],["Ni","Haiqiao",""],["Niu","Zhichuan",""],["Pappa","Anna",""],["Heindel","Tobias",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 16:06:07 GMT"}],"updateDate":"2024-12-20","timestamp":1734624367000,"abstract":"  In quantum cryptography, fundamental laws of quantum physics are exploited to\nenhance the security of cryptographic tasks. Quantum key distribution is by far\nthe most studied protocol to date, enabling the establishment of a secret key\nbetween trusted parties. However, there exist many practical use-cases in\ncommunication networks, which also involve parties in distrustful settings. The\nmost fundamental quantum cryptographic building block in such a distrustful\nsetting is quantum coin flipping, which provides an advantage compared to its\nclassical equivalent. So far, few experimental studies on quantum coin flipping\nhave been reported, all of which used probabilistic quantum light sources\nfacing fundamental limitations. Here, we experimentally implement a quantum\nstrong coin flipping protocol using single-photon states and demonstrate an\nadvantage compared to both classical realizations and implementations using\nfaint laser pulses. We achieve this by employing a state-of-the-art\ndeterministic single-photon source based on the Purcell-enhanced emission of a\nsemiconductor quantum dot in combination with fast polarization-state encoding\nenabling a quantum bit error ratio below 3%, required for the successful\nexecution of the protocol. The reduced multi-photon emission yields a smaller\nbias of the coin flipping protocol compared to an attenuated laser\nimplementation, both in simulations and in the experiment. By demonstrating a\nsingle-photon quantum advantage in a cryptographic primitive beyond QKD, our\nwork represents a major advance towards the implementation of complex\ncryptographic tasks in a future quantum internet.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"CRHhJzLFdm7OCCQO0QxzG0q4ZVN8kCymv1FGFeJ_yuI","pdfSize":"3082713"}