{
  "id": "2412.17586",
  "title": "Enhancing Reconstruction-Based Out-of-Distribution Detection in Brain\n  MRI with Model and Metric Ensembles",
  "authors": "Evi M.C. Huijben, Sina Amirrajab, Josien P.W. Pluim",
  "authorsParsed": [
    [
      "Huijben",
      "Evi M. C.",
      ""
    ],
    [
      "Amirrajab",
      "Sina",
      ""
    ],
    [
      "Pluim",
      "Josien P. W.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 13:58:52 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734962332000,
  "abstract": "  Out-of-distribution (OOD) detection is crucial for safely deploying automated\nmedical image analysis systems, as abnormal patterns in images could hamper\ntheir performance. However, OOD detection in medical imaging remains an open\nchallenge, and we address three gaps: the underexplored potential of a simple\nOOD detection model, the lack of optimization of deep learning strategies\nspecifically for OOD detection, and the selection of appropriate reconstruction\nmetrics. In this study, we investigated the effectiveness of a\nreconstruction-based autoencoder for unsupervised detection of synthetic\nartifacts in brain MRI. We evaluated the general reconstruction capability of\nthe model, analyzed the impact of the selected training epoch and\nreconstruction metrics, assessed the potential of model and/or metric\nensembles, and tested the model on a dataset containing a diverse range of\nartifacts. Among the metrics assessed, the contrast component of SSIM and LPIPS\nconsistently outperformed others in detecting homogeneous circular anomalies.\nBy combining two well-converged models and using LPIPS and contrast as\nreconstruction metrics, we achieved a pixel-level area under the\nPrecision-Recall curve of 0.66. Furthermore, with the more realistic OOD\ndataset, we observed that the detection performance varied between artifact\ntypes; local artifacts were more difficult to detect, while global artifacts\nshowed better detection results. These findings underscore the importance of\ncarefully selecting metrics and model configurations, and highlight the need\nfor tailored approaches, as standard deep learning approaches do not always\nalign with the unique needs of OOD detection.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Image and Video Processing",
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "8IWH6pTE3zoZMMQmUOYfZfGhnHtY_RZXKyY4LN-C74A",
  "pdfSize": "15126742"
}