{"id":"2412.11712","title":"Population synthesis of hot-subdwarf B stars with COMPAS: parameter\n  variations and a prescription for hydrogen-rich shells","authors":"Nicol\\'as Rodr\\'iguez-Segovia, Ashley J. Ruiter, Ivo R. Seitenzahl","authorsParsed":[["Rodríguez-Segovia","Nicolás",""],["Ruiter","Ashley J.",""],["Seitenzahl","Ivo R.",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 12:34:25 GMT"}],"updateDate":"2024-12-17","timestamp":1734352465000,"abstract":"  Subdwarf B stars are a well-known class of hot, low-mass stars thought to be\nformed through interactions in stellar binary systems. While different\nformation channels for subdwarf B stars have been studied through a binary\npopulation synthesis approach, it has also become evident that the\ncharacteristics of the found populations depend on the initial set of\nassumptions that describe the sometimes poorly constrained physical processes,\nsuch as common envelope episodes or angular momentum loss during mass transfer\nevents. In this work we present a parameter study of subdwarf B populations,\nincluding a novel analytic prescription that approximates the evolution of\nsubdwarf B stars with hydrogen-rich outer shells, an element previously\noverlooked in rapid binary population synthesis. We find that all studied\nparameters strongly impact the properties of the population, with the\npossibility of igniting helium below the expected core-mass value near the tip\nof the red giant branch strongly affecting the total number of subdwarf B\ncandidates. Critically, our newly proposed prescription for the evolution of\nsubdwarf B stars with hydrogen-shells helps to reconcile theoretical\npredictions of surface gravity and effective temperature with observational\nresults. Our prescription is useful in the context of rapid binary population\nsynthesis studies and can be applied to other rapid binary population synthesis\ncodes' output.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"LOh6jLiAzHiRlvSlAoU0uqPdR2tTvzmsg_lt7_HBhuY","pdfSize":"1212647"}