{"id":"2412.14155","title":"Towards the HEFT-hedron: the complete set of positivity constraints at\n  NLO","authors":"Debsubhra Chakraborty, Susobhan Chattopadhyay and Rick S. Gupta","authorsParsed":[["Chakraborty","Debsubhra",""],["Chattopadhyay","Susobhan",""],["Gupta","Rick S.",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 18:50:36 GMT"}],"updateDate":"2024-12-19","timestamp":1734547836000,"abstract":"  We present the complete set of positivity bounds on the Higgs Effective Field\nTheory (HEFT) at next-to-leading order (NLO). We identify the 15 operators that\ncan be constrained by positivity, as they contribute to $s^2$-growth in the\namplitude for longitudinal gauge-Higgs scattering, that is to all possible\n2-to-2 scattering processes involving longitudinal gauge bosons, $V_L =\nW_L^\\pm, Z_L$, and the Higgs boson, $h$. We find two sets of constraints: (i)\nspecific linear combinations of CP-even Wilson coefficients (WCs) must be\npositive, and (ii) the magnitudes of some WCs -- including all CP-odd ones --\nmust be smaller than products of other CP-even WCs. We present our final\nconstraints on the 15 dimensional HEFT space and show how known positivity\nbounds on the 3 dimensional space of dimension 8 SMEFT can be recovered from\nthem. We find that only about $5\\%$ of the parameter space for WCs of HEFT\noperators at NLO complies with these positivity constraints. Additionally, we\nobtain double-sided bounds on these WCs by fully exploiting the implications of\nunitarity and $st$-crossing symmetry. For WCs contributing to the vector boson\nscattering process our final constraints are in most cases significantly\nstronger than the experimental ones. For the $V_L V_L, hh \\to hh$ and $V_LV_L,\nhh \\to V_Lh$ process, there are no reported experimental limits and our\ntheoretical constraints provide the first bounds.\n","subjects":["Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Experiment","Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"azooSwlWC6Eo3NH4f0goVXYHK0SB7RbhUA3O3LrMnoI","pdfSize":"899913"}