{
  "id": "2412.01284",
  "title": "MFTF: Mask-free Training-free Object Level Layout Control Diffusion\n  Model",
  "authors": "Shan Yang",
  "authorsParsed": [
    [
      "Yang",
      "Shan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 08:56:13 GMT"
    },
    {
      "version": "v2",
      "created": "Wed, 18 Dec 2024 01:56:53 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1733129773000,
  "abstract": "  Text-to-image generation models have revolutionized content creation, but\ndiffusion-based vision-language models still face challenges in precisely\ncontrolling the shape, appearance, and positional placement of objects in\ngenerated images using text guidance alone. Existing global image editing\nmodels rely on additional masks or images as guidance to achieve layout\ncontrol, often requiring retraining of the model. While local object-editing\nmodels allow modifications to object shapes, they lack the capability to\ncontrol object positions. To address these limitations, we propose the\nMask-free Training-free Object-Level Layout Control Diffusion Model (MFTF),\nwhich provides precise control over object positions without requiring\nadditional masks or images. The MFTF model supports both single-object and\nmulti-object positional adjustments, such as translation and rotation, while\nenabling simultaneous layout control and object semantic editing. The MFTF\nmodel employs a parallel denoising process for both the source and target\ndiffusion models. During this process, attention masks are dynamically\ngenerated from the cross-attention layers of the source diffusion model and\napplied to queries from the self-attention layers to isolate objects. These\nqueries, generated in the source diffusion model, are then adjusted according\nto the layout control parameters and re-injected into the self-attention layers\nof the target diffusion model. This approach ensures accurate and precise\npositional control of objects. Project source code available at\nhttps://github.com/syang-genai/MFTF.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "2tJ9d4kVlC07p4S7060aMg_DrumMnfIQ-db-SsxRW7c",
  "pdfSize": "65339434"
}