{
  "id": "2412.10967",
  "title": "Biological and Radiological Dictionary of Radiomics Features: Addressing\n  Understandable AI Issues in Personalized Prostate Cancer; Dictionary Version\n  PM1.0",
  "authors": "Mohammad R. Salmanpour, Sajad Amiri, Sara Gharibi, Ahmad\n  Shariftabrizi, Yixi Xu, William B Weeks, Arman Rahmim, Ilker Hacihaliloglu",
  "authorsParsed": [
    [
      "Salmanpour",
      "Mohammad R.",
      ""
    ],
    [
      "Amiri",
      "Sajad",
      ""
    ],
    [
      "Gharibi",
      "Sara",
      ""
    ],
    [
      "Shariftabrizi",
      "Ahmad",
      ""
    ],
    [
      "Xu",
      "Yixi",
      ""
    ],
    [
      "Weeks",
      "William B",
      ""
    ],
    [
      "Rahmim",
      "Arman",
      ""
    ],
    [
      "Hacihaliloglu",
      "Ilker",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 14 Dec 2024 20:55:31 GMT"
    },
    {
      "version": "v2",
      "created": "Wed, 18 Dec 2024 02:26:46 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734209731000,
  "abstract": "  We investigate the connection between visual semantic features defined in\nPI-RADS and associated risk factors, moving beyond abnormal imaging findings,\nestablishing a shared framework between medical and AI professionals by\ncreating a standardized dictionary of biological/radiological RFs.\nSubsequently, 6 interpretable and seven complex classifiers, linked with nine\ninterpretable feature selection algorithms (FSA) applied to risk factors, were\nextracted from segmented lesions in T2-weighted imaging (T2WI),\ndiffusion-weighted imaging (DWI), and apparent diffusion coefficient (ADC)\nmultiparametric-prostate MRI sequences to predict the UCLA scores. We then\nutilized the created dictionary to interpret the best-predictive models.\nCombining T2WI, DWI, and ADC with FSAs including ANOVA F-test, Correlation\nCoefficient, and Fisher Score, and utilizing logistic regression, identified\nkey features: The 90th percentile from T2WI, which captures hypo-intensity\nrelated to prostate cancer risk; Variance from T2WI, indicating lesion\nheterogeneity; shape metrics including Least Axis Length and Surface Area to\nVolume ratio from ADC, describing lesion shape and compactness; and Run Entropy\nfrom ADC, reflecting texture consistency. This approach achieved the highest\naverage accuracy of 0.78, significantly outperforming single-sequence methods\n(p-value<0.05). The developed dictionary for Prostate-MRI (PM1.0) serves as a\ncommon language, fosters collaboration between clinical professionals and AI\ndevelopers to advance trustworthy AI solutions that support\nreliable/interpretable clinical decisions.\n",
  "subjects": [
    "Physics/Medical Physics",
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "VDbG0AkSqgsfkEXQv4DAFeCkR-uZAIGOB1Uqe531vhY",
  "pdfSize": "884962"
}