{
  "id": "2412.00505",
  "title": "Good, Cheap, and Fast: Overfitted Image Compression with Wasserstein\n  Distortion",
  "authors": "Jona Ball\\'e, Luca Versari, Emilien Dupont, Hyunjik Kim, Matthias\n  Bauer",
  "authorsParsed": [
    [
      "Ballé",
      "Jona",
      ""
    ],
    [
      "Versari",
      "Luca",
      ""
    ],
    [
      "Dupont",
      "Emilien",
      ""
    ],
    [
      "Kim",
      "Hyunjik",
      ""
    ],
    [
      "Bauer",
      "Matthias",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 30 Nov 2024 15:05:01 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1732979101000,
  "abstract": "  Inspired by the success of generative image models, recent work on learned\nimage compression increasingly focuses on better probabilistic models of the\nnatural image distribution, leading to excellent image quality. This, however,\ncomes at the expense of a computational complexity that is several orders of\nmagnitude higher than today's commercial codecs, and thus prohibitive for most\npractical applications. With this paper, we demonstrate that by focusing on\nmodeling visual perception rather than the data distribution, we can achieve a\nvery good trade-off between visual quality and bit rate similar to \"generative\"\ncompression models such as HiFiC, while requiring less than 1% of the\nmultiply-accumulate operations (MACs) for decompression. We do this by\noptimizing C3, an overfitted image codec, for Wasserstein Distortion (WD), and\nevaluating the image reconstructions with a human rater study. The study also\nreveals that WD outperforms other perceptual quality metrics such as LPIPS,\nDISTS, and MS-SSIM, both as an optimization objective and as a predictor of\nhuman ratings, achieving over 94% Pearson correlation with Elo scores.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Electrical Engineering and Systems Science/Image and Video Processing"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "1IPwaBwLyV2oNq5AjwgShoGSapl3Hgrv461RuMbugtQ",
  "pdfSize": "37496666"
}