{
  "id": "2412.02604",
  "title": "Fairness-Regulated Dense Subgraph Discovery",
  "authors": "Emmanouil Kariotakis, Nikolaos Sidiropoulos, Aritra Konar",
  "authorsParsed": [
    [
      "Kariotakis",
      "Emmanouil",
      ""
    ],
    [
      "Sidiropoulos",
      "Nikolaos",
      ""
    ],
    [
      "Konar",
      "Aritra",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 17:34:29 GMT"
    }
  ],
  "updateDate": "2024-12-04",
  "timestamp": 1733247269000,
  "abstract": "  Dense subgraph discovery (DSD) is a key graph mining primitive with myriad\napplications including finding densely connected communities which are diverse\nin their vertex composition. In such a context, it is desirable to extract a\ndense subgraph that provides fair representation of the diverse subgroups that\nconstitute the vertex set while incurring a small loss in terms of subgraph\ndensity. Existing methods for promoting fairness in DSD have important\nlimitations -- the associated formulations are NP-hard in the worst case and\nthey do not provide flexible notions of fairness, making it non-trivial to\nanalyze the inherent trade-off between density and fairness. In this paper, we\nintroduce two tractable formulations for fair DSD, each offering a different\nnotion of fairness. Our methods provide a structured and flexible approach to\nincorporate fairness, accommodating varying fairness levels. We introduce the\nfairness-induced relative loss in subgraph density as a price of fairness\nmeasure to quantify the associated trade-off. We are the first to study such a\nnotion in the context of detecting fair dense subgraphs. Extensive experiments\non real-world datasets demonstrate that our methods not only match but\nfrequently outperform existing solutions, sometimes incurring even less than\nhalf the subgraph density loss compared to prior art, while achieving the\ntarget fairness levels. Importantly, they excel in scenarios that previous\nmethods fail to adequately handle, i.e., those with extreme subgroup\nimbalances, highlighting their effectiveness in extracting fair and dense\nsolutions.\n",
  "subjects": [
    "Computer Science/Social and Information Networks"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Nw4svzSB7czj79tAVc7xtu-ySP9N3bEbeFdN3jC6vZc",
  "pdfSize": "1058139"
}