{
  "id": "2412.09418",
  "title": "NExT-LF: A Novel Operational Modal Analysis Method via Tangential\n  Interpolation",
  "authors": "Gabriele Dessena, Marco Civera, Ali Yousefi, Cecilia Surace",
  "authorsParsed": [
    [
      "Dessena",
      "Gabriele",
      ""
    ],
    [
      "Civera",
      "Marco",
      ""
    ],
    [
      "Yousefi",
      "Ali",
      ""
    ],
    [
      "Surace",
      "Cecilia",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 16:25:30 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1734020730000,
  "abstract": "  Operational Modal Analysis (OMA) is vital for identifying modal parameters\nunder real-world conditions, yet existing methods often face challenges with\nnoise sensitivity and stability. This work introduces NExT-LF, a novel method\nthat combines the well-known Natural Excitation Technique (NExT) with the\nLoewner Framework (LF). NExT enables the extraction of Impulse Response\nFunctions (IRFs) from output-only vibration data, which are then converted into\nthe frequency domain and used by LF to estimate modal parameters. The proposed\nmethod is validated through numerical and experimental case studies. In the\nnumerical study of a 2D Euler-Bernoulli cantilever beam, NExT-LF provides\nresults consistent with analytical solutions and those from the benchmark\nmethod, NExT with Eigensystem Realization Algorithm (NExT-ERA). Additionally,\nNExT-LF demonstrates superior noise robustness, reliably identifying stable\nmodes across various noise levels where NExT-ERA fails. Experimental validation\non the Sheraton Universal Hotel is the first OMA application to this structure,\nconfirming NExT-LF as a robust and efficient method for output-only modal\nparameter identification.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Systems and Control",
    "Computer Science/Systems and Control"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "C4E-eJ1_pkoe8MyMnF-7Abm-B2oJlqDVo0wUn6EZ6ns",
  "pdfSize": "6527205"
}