{"id":"2412.09624","title":"GenEx: Generating an Explorable World","authors":"Taiming Lu, Tianmin Shu, Junfei Xiao, Luoxin Ye, Jiahao Wang, Cheng\n  Peng, Chen Wei, Daniel Khashabi, Rama Chellappa, Alan Yuille, Jieneng Chen","authorsParsed":[["Lu","Taiming",""],["Shu","Tianmin",""],["Xiao","Junfei",""],["Ye","Luoxin",""],["Wang","Jiahao",""],["Peng","Cheng",""],["Wei","Chen",""],["Khashabi","Daniel",""],["Chellappa","Rama",""],["Yuille","Alan",""],["Chen","Jieneng",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 18:59:57 GMT"},{"version":"v2","created":"Mon, 16 Dec 2024 22:17:55 GMT"},{"version":"v3","created":"Wed, 18 Dec 2024 22:25:19 GMT"},{"version":"v4","created":"Mon, 20 Jan 2025 16:51:42 GMT"}],"updateDate":"2025-01-22","timestamp":1734029997000,"abstract":"  Understanding, navigating, and exploring the 3D physical real world has long\nbeen a central challenge in the development of artificial intelligence. In this\nwork, we take a step toward this goal by introducing GenEx, a system capable of\nplanning complex embodied world exploration, guided by its generative\nimagination that forms priors (expectations) about the surrounding\nenvironments. GenEx generates an entire 3D-consistent imaginative environment\nfrom as little as a single RGB image, bringing it to life through panoramic\nvideo streams. Leveraging scalable 3D world data curated from Unreal Engine,\nour generative model is rounded in the physical world. It captures a continuous\n360-degree environment with little effort, offering a boundless landscape for\nAI agents to explore and interact with. GenEx achieves high-quality world\ngeneration, robust loop consistency over long trajectories, and demonstrates\nstrong 3D capabilities such as consistency and active 3D mapping. Powered by\ngenerative imagination of the world, GPT-assisted agents are equipped to\nperform complex embodied tasks, including both goal-agnostic exploration and\ngoal-driven navigation. These agents utilize predictive expectation regarding\nunseen parts of the physical world to refine their beliefs, simulate different\noutcomes based on potential decisions, and make more informed choices. In\nsummary, we demonstrate that GenEx provides a transformative platform for\nadvancing embodied AI in imaginative spaces and brings potential for extending\nthese capabilities to real-world exploration.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"IropPNQtTvITc4U4KzXY84Rm2Nw0XZKRc_xGSXPj2h0","pdfSize":"10624066"}