{"id":"2412.07285","title":"Tides on Lava Worlds: Application to Close-in Exoplanets and the Early\n  Earth-Moon System","authors":"Mohammad Farhat, Pierre Auclair-Desrotour, Gwena\\\"el Bou\\'e, Tim\n  Lichtenberg, and Jacques Laskar","authorsParsed":[["Farhat","Mohammad",""],["Auclair-Desrotour","Pierre",""],["Boué","Gwenaël",""],["Lichtenberg","Tim",""],["Laskar","Jacques",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 08:16:22 GMT"}],"updateDate":"2024-12-11","timestamp":1733818582000,"abstract":"  Understanding the physics of planetary magma oceans has been the subject of\ngrowing efforts, in light of the increasing abundance of Solar system samples\nand extrasolar surveys. A rocky planet harboring such an ocean is likely to\ninteract tidally with its host star, planetary companions, or satellites. To\ndate, however, models of the tidal response and heat generation of magma oceans\nhave been restricted to the framework of weakly viscous solids, ignoring the\ndynamical fluid behavior of the ocean beyond a critical melt fraction. Here we\nprovide a handy analytical model that accommodates this phase transition,\nallowing for a physical estimation of the tidal response of lava worlds. We\napply the model in two settings: The tidal history of the early Earth-Moon\nsystem in the aftermath of the giant impact; and the tidal interplay between\nshort-period exoplanets and their host stars. For the former, we show that the\nfluid behavior of the Earth's molten surface drives efficient early Lunar\nrecession to ${\\sim} 25$ Earth radii within $10^4{-} 10^5$ years, in contrast\nwith earlier predictions. For close-in exoplanets, we report on how their\nmolten surfaces significantly change their spin-orbit dynamics, allowing them\nto evade spin-orbit resonances and accelerating their track towards tidal\nsynchronization from a Gyr to Myr timescale. Moreover, we re-evaluate the\nenergy budgets of detected close-in exoplanets, highlighting how the surface\nthermodynamics of these planets are likely controlled by enhanced, fluid-driven\ntidal heating, rather than vigorous insolation, and how this regime change\nsubstantially alters predictions for their surface temperatures.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Physics/Atmospheric and Oceanic Physics","Physics/Geophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"WHodCtmiAR9lOq-hcAB7ThcRqtxG1IHHJOAsqdWNC7s","pdfSize":"9844989"}