{"id":"2412.10914","title":"Regulated polarization of active particles in local osmotic flow fields","authors":"Lisa Rohde and Desmond J. Quinn and Diptabrata Paul and Frank Cichos","authorsParsed":[["Rohde","Lisa",""],["Quinn","Desmond J.",""],["Paul","Diptabrata",""],["Cichos","Frank",""]],"versions":[{"version":"v1","created":"Sat, 14 Dec 2024 18:02:13 GMT"}],"updateDate":"2024-12-17","timestamp":1734199333000,"abstract":"  Regulation to a well-defined target state is a fundamental requirement for\nachieving reliable functionality in living systems and maintaining specific\nnon-equilibrium states. The control of certain properties and functionalities\nof systems on the microscale presents a particular challenge since thermal\nfluctuations and environmental perturbations dominate. While synthetic active\nmatter has demonstrated remarkable self-organization capabilities, examples of\nautonomous regulation processes at the single-particle level remain scarce.\nHere, we show that the interplay of two non-equilibrium processes leads to a\nregulated polarization state of active particles in local osmotic flow fields.\nThe balance between thermophoretic repulsion and attraction by thermo-osmotic\nboundary flows, both generated by a single heat source, yields a steady state\nat which active particles encircle the heat source at a distance that depends\non the temperature of the heat source. The balance of both temperature-induced\nprocesses causes a polarization of the active particles that is independent of\nthe heat source temperature. The individual control of heat source and active\nparticles in the experiment allows a detailed investigation of the\nself-regulated polarization effect in which we find that hydrodynamic\ninteractions dominate. As the effects rely on osmotic flows and phoretic\ninteractions, we expect that the observed phenomena can be generalized to other\nactive systems and flow fields.\n","subjects":["Condensed Matter/Soft Condensed Matter"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"aJmz7Lc-03IcOt_-TAjGlBv5R6B6HfR0v62_N2KN_LE","pdfSize":"2045519"}