{"id":"2412.11285","title":"Moderating the Mediation Bootstrap for Causal Inference","authors":"Kees Jan van Garderen, Noud van Giersbergen","authorsParsed":[["van Garderen","Kees Jan",""],["van Giersbergen","Noud",""]],"versions":[{"version":"v1","created":"Sun, 15 Dec 2024 19:15:29 GMT"}],"updateDate":"2024-12-17","timestamp":1734290129000,"abstract":"  Mediation analysis is a form of causal inference that investigates indirect\neffects and causal mechanisms. Confidence intervals for indirect effects play a\ncentral role in conducting inference. The problem is non-standard leading to\ncoverage rates that deviate considerably from their nominal level. The default\ninference method in the mediation model is the paired bootstrap, which\nresamples directly from the observed data. However, a residual bootstrap that\nexplicitly exploits the assumed causal structure (X->M->Y) could also be\napplied. There is also a debate whether the bias-corrected (BC) bootstrap\nmethod is superior to the percentile method, with the former showing liberal\nbehavior (actual coverage too low) in certain circumstances. Moreover,\nbootstrap methods tend to be very conservative (coverage higher than required)\nwhen mediation effects are small. Finally, iterated bootstrap methods like the\ndouble bootstrap have not been considered due to their high computational\ndemands. We investigate the issues mentioned in the simple mediation model by a\nlarge-scale simulation. Results are explained using graphical methods and the\nnewly derived finite-sample distribution. The main findings are: (i)\nconservative behavior of the bootstrap is caused by extreme dependence of the\nbootstrap distribution's shape on the estimated coefficients (ii) this\ndependence leads to counterproductive correction of the the double bootstrap.\nThe added randomness of the BC method inflates the coverage in the absence of\nmediation, but still leads to (invalid) liberal inference when the mediation\neffect is small.\n","subjects":["Economics/Econometrics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ypWIXCx0ohOEvUC7UpXNR5F-BTZH8EsY49H0nx_KjaU","pdfSize":"1595269"}