{
  "id": "2412.06958",
  "title": "Enhancing operational wind downscaling capabilities over Canada:\n  Application of a Conditional Wasserstein GAN methodology",
  "authors": "Jorge Guevara and Victor Nascimento and Johannes Schmude and Daniel\n  Salles and Simon Corbeil-L\\'etourneau and Madalina Surcel and Dominique\n  Brunet",
  "authorsParsed": [
    [
      "Guevara",
      "Jorge",
      ""
    ],
    [
      "Nascimento",
      "Victor",
      ""
    ],
    [
      "Schmude",
      "Johannes",
      ""
    ],
    [
      "Salles",
      "Daniel",
      ""
    ],
    [
      "Corbeil-Létourneau",
      "Simon",
      ""
    ],
    [
      "Surcel",
      "Madalina",
      ""
    ],
    [
      "Brunet",
      "Dominique",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 20:05:07 GMT"
    },
    {
      "version": "v2",
      "created": "Mon, 17 Feb 2025 20:21:13 GMT"
    },
    {
      "version": "v3",
      "created": "Wed, 26 Feb 2025 19:34:45 GMT"
    }
  ],
  "updateDate": "2025-02-28",
  "timestamp": 1733774707000,
  "abstract": "  Wind downscaling is essential for improving the spatial resolution of weather\nforecasts, particularly in operational Numerical Weather Prediction (NWP). This\nstudy advances wind downscaling by extending the DownGAN framework introduced\nby Annau et al.,to operational datasets from the Global Deterministic\nPrediction System (GDPS) and High-Resolution Deterministic Prediction System\n(HRDPS), covering the entire Canadian domain. We enhance the model by\nincorporating high-resolution static covariates, such as HRDPS-derived\ntopography, into a Conditional Wasserstein Generative Adversarial Network with\nGradient Penalty, implemented using a UNET-based generator. Following the\nDownGAN framework, our methodology integrates low-resolution GDPS forecasts (15\nkm, 10-day horizon) and high-resolution HRDPS forecasts (2.5 km, 48-hour\nhorizon) with Frequency Separation techniques adapted from computer vision.\nThrough robust training and inference over the Canadian region, we demonstrate\nthe operational scalability of our approach, achieving significant improvements\nin wind downscaling accuracy. Statistical validation highlights reductions in\nroot mean square error (RMSE) and log spectral distance (LSD) metrics compared\nto the original DownGAN. High-resolution conditioning covariates and Frequency\nSeparation strategies prove instrumental in enhancing model performance. This\nwork underscores the potential for extending high-resolution wind forecasts\nbeyond the 48-hour horizon, bridging the gap to the 10-day low resolution\nglobal forecast window.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "jAY5M4CqzIpcPG5Xm61mFX-Hx5X5CRTFGupt3z3iVjs",
  "pdfSize": "7024071"
}