{"id":"2412.05826","title":"Doppelgangers++: Improved Visual Disambiguation with Geometric 3D\n  Features","authors":"Yuanbo Xiangli, Ruojin Cai, Hanyu Chen, Jeffrey Byrne, Noah Snavely","authorsParsed":[["Xiangli","Yuanbo",""],["Cai","Ruojin",""],["Chen","Hanyu",""],["Byrne","Jeffrey",""],["Snavely","Noah",""]],"versions":[{"version":"v1","created":"Sun, 8 Dec 2024 06:08:47 GMT"}],"updateDate":"2024-12-10","timestamp":1733638127000,"abstract":"  Accurate 3D reconstruction is frequently hindered by visual aliasing, where\nvisually similar but distinct surfaces (aka, doppelgangers), are incorrectly\nmatched. These spurious matches distort the structure-from-motion (SfM)\nprocess, leading to misplaced model elements and reduced accuracy. Prior\nefforts addressed this with CNN classifiers trained on curated datasets, but\nthese approaches struggle to generalize across diverse real-world scenes and\ncan require extensive parameter tuning. In this work, we present\nDoppelgangers++, a method to enhance doppelganger detection and improve 3D\nreconstruction accuracy. Our contributions include a diversified training\ndataset that incorporates geo-tagged images from everyday scenes to expand\nrobustness beyond landmark-based datasets. We further propose a\nTransformer-based classifier that leverages 3D-aware features from the MASt3R\nmodel, achieving superior precision and recall across both in-domain and\nout-of-domain tests. Doppelgangers++ integrates seamlessly into standard SfM\nand MASt3R-SfM pipelines, offering efficiency and adaptability across varied\nscenes. To evaluate SfM accuracy, we introduce an automated, geotag-based\nmethod for validating reconstructed models, eliminating the need for manual\ninspection. Through extensive experiments, we demonstrate that Doppelgangers++\nsignificantly enhances pairwise visual disambiguation and improves 3D\nreconstruction quality in complex and diverse scenarios.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"mafMVToPdqeAKyrxcWG3JT55mWSnYCj_KbDS0ZbjVqY","pdfSize":"47128716"}