{"id":"2412.04432","title":"Divot: Diffusion Powers Video Tokenizer for Comprehension and Generation","authors":"Yuying Ge, Yizhuo Li, Yixiao Ge, Ying Shan","authorsParsed":[["Ge","Yuying",""],["Li","Yizhuo",""],["Ge","Yixiao",""],["Shan","Ying",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 18:53:04 GMT"}],"updateDate":"2024-12-06","timestamp":1733424784000,"abstract":"  In recent years, there has been a significant surge of interest in unifying\nimage comprehension and generation within Large Language Models (LLMs). This\ngrowing interest has prompted us to explore extending this unification to\nvideos. The core challenge lies in developing a versatile video tokenizer that\ncaptures both the spatial characteristics and temporal dynamics of videos to\nobtain representations for LLMs, and the representations can be further decoded\ninto realistic video clips to enable video generation. In this work, we\nintroduce Divot, a Diffusion-Powered Video Tokenizer, which leverages the\ndiffusion process for self-supervised video representation learning. We posit\nthat if a video diffusion model can effectively de-noise video clips by taking\nthe features of a video tokenizer as the condition, then the tokenizer has\nsuccessfully captured robust spatial and temporal information. Additionally,\nthe video diffusion model inherently functions as a de-tokenizer, decoding\nvideos from their representations. Building upon the Divot tokenizer, we\npresent Divot-Vicuna through video-to-text autoregression and text-to-video\ngeneration by modeling the distributions of continuous-valued Divot features\nwith a Gaussian Mixture Model. Experimental results demonstrate that our\ndiffusion-based video tokenizer, when integrated with a pre-trained LLM,\nachieves competitive performance across various video comprehension and\ngeneration benchmarks. The instruction tuned Divot-Vicuna also excels in video\nstorytelling, generating interleaved narratives and corresponding videos.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Tddqf5RcwHnn2HIWZm0kGx8GPbAGEoSLElMA9ilp4LY","pdfSize":"4838382"}