{"id":"2412.02551","title":"Quasi-optimal interpolation of gradients and vector-fields on protected\n  Delaunay meshes in $\\mathbb{R}^d$","authors":"David M. Williams and Mathijs Wintraecken","authorsParsed":[["Williams","David M.",""],["Wintraecken","Mathijs",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 16:44:14 GMT"}],"updateDate":"2024-12-04","timestamp":1733244254000,"abstract":"  There are very few mathematical results governing the interpolation of\nfunctions or their gradients on Delaunay meshes in more than two dimensions.\nUnfortunately, the standard techniques for proving optimal interpolation\nproperties are often limited to triangular meshes. Furthermore, the results\nwhich do exist, are tailored towards interpolation with piecewise linear\npolynomials. In fact, we are unaware of any results which govern the\nhigh-order, piecewise polynomial interpolation of functions or their gradients\non Delaunay meshes. In order to address this issue, we prove that\nquasi-optimal, high-order, piecewise polynomial gradient interpolation can be\nsuccessfully achieved on protected Delaunay meshes. In addition, we generalize\nour analysis beyond gradient interpolation, and prove quasi-optimal\ninterpolation properties for sufficiently-smooth vector fields. Throughout the\npaper, we use the words 'quasi-optimal', because the quality of interpolation\ndepends (in part) on the minimum thickness of simplicies in the mesh.\nFortunately, the minimum thickness can be precisely controlled on protected\nDelaunay meshes in $\\mathbb{R}^d$. Furthermore, the current best mathematical\nestimates for minimum thickness have been obtained on such meshes. In this\nsense, the proposed interpolation is optimal, although, we acknowledge that\nfuture work may reveal an alternative Delaunay meshing strategy with better\ncontrol over the minimum thickness. With this caveat in mind, we refer to our\ninterpolation on protected Delaunay meshes as quasi-optimal.\n","subjects":["Mathematics/Numerical Analysis","Computer Science/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"is1Bd9V6c2DrwHh6_pxe5V0_TQ95S6QhlLzBCJWobw8","pdfSize":"963089"}