{
  "id": "2412.01618",
  "title": "CRAYM: Neural Field Optimization via Camera RAY Matching",
  "authors": "Liqiang Lin, Wenpeng Wu, Chi-Wing Fu, Hao Zhang, Hui Huang",
  "authorsParsed": [
    [
      "Lin",
      "Liqiang",
      ""
    ],
    [
      "Wu",
      "Wenpeng",
      ""
    ],
    [
      "Fu",
      "Chi-Wing",
      ""
    ],
    [
      "Zhang",
      "Hao",
      ""
    ],
    [
      "Huang",
      "Hui",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 15:39:09 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733153949000,
  "abstract": "  We introduce camera ray matching (CRAYM) into the joint optimization of\ncamera poses and neural fields from multi-view images. The optimized field,\nreferred to as a feature volume, can be \"probed\" by the camera rays for novel\nview synthesis (NVS) and 3D geometry reconstruction. One key reason for\nmatching camera rays, instead of pixels as in prior works, is that the camera\nrays can be parameterized by the feature volume to carry both geometric and\nphotometric information. Multi-view consistencies involving the camera rays and\nscene rendering can be naturally integrated into the joint optimization and\nnetwork training, to impose physically meaningful constraints to improve the\nfinal quality of both the geometric reconstruction and photorealistic\nrendering. We formulate our per-ray optimization and matched ray coherence by\nfocusing on camera rays passing through keypoints in the input images to\nelevate both the efficiency and accuracy of scene correspondences. Accumulated\nray features along the feature volume provide a means to discount the coherence\nconstraint amid erroneous ray matching. We demonstrate the effectiveness of\nCRAYM for both NVS and geometry reconstruction, over dense- or sparse-view\nsettings, with qualitative and quantitative comparisons to state-of-the-art\nalternatives.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Graphics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "ZQhDQcBa52JLc9Cqc9JDzEdYcvtDp1KVKQztXs7w7VY",
  "pdfSize": "18001769"
}