{
  "id": "2412.14663",
  "title": "IOHunter: Graph Foundation Model to Uncover Online Information\n  Operations",
  "authors": "Marco Minici, Luca Luceri, Francesco Fabbri, Emilio Ferrara",
  "authorsParsed": [
    [
      "Minici",
      "Marco",
      ""
    ],
    [
      "Luceri",
      "Luca",
      ""
    ],
    [
      "Fabbri",
      "Francesco",
      ""
    ],
    [
      "Ferrara",
      "Emilio",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 09:14:24 GMT"
    }
  ],
  "updateDate": "2025-01-07",
  "timestamp": 1734599664000,
  "abstract": "  Social media platforms have become vital spaces for public discourse, serving\nas modern agor\\'as where a wide range of voices influence societal narratives.\nHowever, their open nature also makes them vulnerable to exploitation by\nmalicious actors, including state-sponsored entities, who can conduct\ninformation operations (IOs) to manipulate public opinion. The spread of\nmisinformation, false news, and misleading claims threatens democratic\nprocesses and societal cohesion, making it crucial to develop methods for the\ntimely detection of inauthentic activity to protect the integrity of online\ndiscourse. In this work, we introduce a methodology designed to identify users\norchestrating information operations, a.k.a. \\textit{IO drivers}, across\nvarious influence campaigns. Our framework, named \\texttt{IOHunter}, leverages\nthe combined strengths of Language Models and Graph Neural Networks to improve\ngeneralization in \\emph{supervised}, \\emph{scarcely-supervised}, and\n\\emph{cross-IO} contexts. Our approach achieves state-of-the-art performance\nacross multiple sets of IOs originating from six countries, significantly\nsurpassing existing approaches. This research marks a step toward developing\nGraph Foundation Models specifically tailored for the task of IO detection on\nsocial media platforms.\n",
  "subjects": [
    "Computer Science/Social and Information Networks",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "O6Mpgk9_gT8laiHZDm1ceytno6oVCefdlnwaOZVcQg8",
  "pdfSize": "764596"
}