{
  "id": "2412.13771",
  "title": "Semantic Convergence: Harmonizing Recommender Systems via Two-Stage\n  Alignment and Behavioral Semantic Tokenization",
  "authors": "Guanghan Li, Xun Zhang, Yufei Zhang, Yifan Yin, Guojun Yin, Wei Lin",
  "authorsParsed": [
    [
      "Li",
      "Guanghan",
      ""
    ],
    [
      "Zhang",
      "Xun",
      ""
    ],
    [
      "Zhang",
      "Yufei",
      ""
    ],
    [
      "Yin",
      "Yifan",
      ""
    ],
    [
      "Yin",
      "Guojun",
      ""
    ],
    [
      "Lin",
      "Wei",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 12:07:58 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734523678000,
  "abstract": "  Large language models (LLMs), endowed with exceptional reasoning\ncapabilities, are adept at discerning profound user interests from historical\nbehaviors, thereby presenting a promising avenue for the advancement of\nrecommendation systems. However, a notable discrepancy persists between the\nsparse collaborative semantics typically found in recommendation systems and\nthe dense token representations within LLMs. In our study, we propose a novel\nframework that harmoniously merges traditional recommendation models with the\nprowess of LLMs. We initiate this integration by transforming ItemIDs into\nsequences that align semantically with the LLMs space, through the proposed\nAlignment Tokenization module. Additionally, we design a series of specialized\nsupervised learning tasks aimed at aligning collaborative signals with the\nsubtleties of natural language semantics. To ensure practical applicability, we\noptimize online inference by pre-caching the top-K results for each user,\nreducing latency and improving effciency. Extensive experimental evidence\nindicates that our model markedly improves recall metrics and displays\nremarkable scalability of recommendation systems.\n",
  "subjects": [
    "Computer Science/Information Retrieval",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Computation and Language"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "vYc-u6msS0eFch4PBcIFVJessFm4r066kIy8d9MS-xM",
  "pdfSize": "620884"
}