{
  "id": "2412.00016",
  "title": "A Supercomputing Based Distributed Cloud Marketplace",
  "authors": "Minjun Kim, Sina Falaki",
  "authorsParsed": [
    [
      "Kim",
      "Minjun",
      ""
    ],
    [
      "Falaki",
      "Sina",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 15 Nov 2024 15:53:20 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1731686000000,
  "abstract": "  The once mythological 51% attack has moved beyond the hypothetical and now\nposes a legitimate widespread threat to blockchain technology. Current\nblockchains provide inferior throughput capacity when compared to that of\ncentralized systems, creating an obvious vulnerability which allows the 51%\nattack to occur within decentralized systems. Despite recent advancements in\nblockchain which introduce interesting models that achieve high throughputs\nwith enhanced security and privacy, no current networks have evolved to deploy\nthe optimal solution of combining scalability, security, and distributed\nsystems to create a legitimate supercomputing enterprise-grade developer\nsandbox. In this paper, we introduce an infinitely scalable, secure, and high\nthroughput blockchain capable of amassing supercomputer speeds with\noff-the-shelf hardware, LuluChain. LuluChain simplifies the blockchain model to\nobtain greater functionality, speed, scalability, privacy, and flexibility,\nthat works to combat the inflated pricing models set by the oligopolistic cloud\ncomputing market as it requires minimal computational work. By eliminating the\nneed for timestamp synchronization and majority agreement among all\nparticipants, LuluChain opens the door to reliable trust, low-cost instant\ntransactions, and flexible instant smart contracts. The supercomputing, high\nthroughput distributed system is the ideal foundation for an essential\ndistributed cloud marketplace.\n",
  "subjects": [
    "Computer Science/Cryptography and Security"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "ZKrXZcIbl_s4VuyQbf48cKyRxzM_6R58We3I82vV54o",
  "pdfSize": "1144712"
}