{
  "id": "2412.05832",
  "title": "Fairness in Computational Innovations: Identifying Bias in Substance Use\n  Treatment Length of Stay Prediction Models with Policy Implications",
  "authors": "Ugur Kursuncu, Aaron Baird, Yusen Xia",
  "authorsParsed": [
    [
      "Kursuncu",
      "Ugur",
      ""
    ],
    [
      "Baird",
      "Aaron",
      ""
    ],
    [
      "Xia",
      "Yusen",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 8 Dec 2024 06:47:23 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733640443000,
  "abstract": "  Predictive machine learning (ML) models are computational innovations that\ncan enhance medical decision-making, including aiding in determining optimal\ntiming for discharging patients. However, societal biases can be encoded into\nsuch models, raising concerns about inadvertently affecting health outcomes for\ndisadvantaged groups. This issue is particularly pressing in the context of\nsubstance use disorder (SUD) treatment, where biases in predictive models could\nsignificantly impact the recovery of highly vulnerable patients. In this study,\nwe focus on the development and assessment of ML models designed to predict the\nlength of stay (LOS) for both inpatients (i.e., residential) and outpatients\nundergoing SUD treatment. We utilize the Treatment Episode Data Set for\nDischarges (TEDS-D) from the Substance Abuse and Mental Health Services\nAdministration (SAMHSA). Through the lenses of distributive justice and\nsocio-relational fairness, we assess our models for bias across variables\nrelated to demographics (e.g., race) as well as medical (e.g., diagnosis) and\nfinancial conditions (e.g., insurance). We find that race, US geographic\nregion, type of substance used, diagnosis, and payment source for treatment are\nprimary indicators of unfairness. From a policy perspective, we provide bias\nmitigation strategies to achieve fair outcomes. We discuss the implications of\nthese findings for medical decision-making and health equity. We ultimately\nseek to contribute to the innovation and policy-making literature by seeking to\nadvance the broader objectives of social justice when applying computational\ninnovations in health care.\n",
  "subjects": [
    "Computer Science/Computers and Society",
    "Computer Science/Human-Computer Interaction"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "E4QXMCKJPqboKdXceLp54nHyMlwhVZeGeYt8Qh_1Vcw",
  "pdfSize": "1054669"
}