{
  "id": "2412.02962",
  "title": "Partially Conditioned Patch Parallelism for Accelerated Diffusion Model\n  Inference",
  "authors": "XiuYu Zhang, Zening Luo, Michelle E. Lu",
  "authorsParsed": [
    [
      "Zhang",
      "XiuYu",
      ""
    ],
    [
      "Luo",
      "Zening",
      ""
    ],
    [
      "Lu",
      "Michelle E.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 02:12:50 GMT"
    }
  ],
  "updateDate": "2024-12-05",
  "timestamp": 1733278370000,
  "abstract": "  Diffusion models have exhibited exciting capabilities in generating images\nand are also very promising for video creation. However, the inference speed of\ndiffusion models is limited by the slow sampling process, restricting its use\ncases. The sequential denoising steps required for generating a single sample\ncould take tens or hundreds of iterations and thus have become a significant\nbottleneck. This limitation is more salient for applications that are\ninteractive in nature or require small latency. To address this challenge, we\npropose Partially Conditioned Patch Parallelism (PCPP) to accelerate the\ninference of high-resolution diffusion models. Using the fact that the\ndifference between the images in adjacent diffusion steps is nearly zero, Patch\nParallelism (PP) leverages multiple GPUs communicating asynchronously to\ncompute patches of an image in multiple computing devices based on the entire\nimage (all patches) in the previous diffusion step. PCPP develops PP to reduce\ncomputation in inference by conditioning only on parts of the neighboring\npatches in each diffusion step, which also decreases communication among\ncomputing devices. As a result, PCPP decreases the communication cost by around\n$70\\%$ compared to DistriFusion (the state of the art implementation of PP) and\nachieves $2.36\\sim 8.02\\times$ inference speed-up using $4\\sim 8$ GPUs compared\nto $2.32\\sim 6.71\\times$ achieved by DistriFusion depending on the computing\ndevice configuration and resolution of generation at the cost of a possible\ndecrease in image quality. PCPP demonstrates the potential to strike a\nfavorable trade-off, enabling high-quality image generation with substantially\nreduced latency.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Distributed, Parallel, and Cluster Computing"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "c-GF4Ab6bMZ1OvZAgHe_CaXuuA4M0KnTpm2yG0FsugY",
  "pdfSize": "21947550"
}