{
  "id": "2412.10170",
  "title": "Resonance-free deep ultraviolet to near infrared supercontinuum\n  generation in a hollow-core antiresonant fibre",
  "authors": "Mohammed Sabbah, Robbie Mears, Kerrianne Harrington, William J.\n  Wadsworth, James M. Stone, Tim A. Birks, and John C. Travers",
  "authorsParsed": [
    [
      "Sabbah",
      "Mohammed",
      ""
    ],
    [
      "Mears",
      "Robbie",
      ""
    ],
    [
      "Harrington",
      "Kerrianne",
      ""
    ],
    [
      "Wadsworth",
      "William J.",
      ""
    ],
    [
      "Stone",
      "James M.",
      ""
    ],
    [
      "Birks",
      "Tim A.",
      ""
    ],
    [
      "Travers",
      "John C.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 14:34:37 GMT"
    }
  ],
  "updateDate": "2024-12-16",
  "timestamp": 1734100477000,
  "abstract": "  Supercontinuum generation in the ultraviolet spectral region is challenging\nin solid-core optical fibres due to solarization and photodarkening.\nAntiresonant hollow-core fibres have overcome this limitation and have been\nshown to guide ultraviolet light at sufficient intensity for ultraviolet\nspectral broadening through nonlinear optics in the filling gas. However, their\nultraviolet guidance is usually limited by discontinuities caused by the\npresence of high-loss resonance bands. In this paper, we report on\nresonance-free supercontinuum generation spanning from the deep ultraviolet to\nthe near infrared achieved through modulation instability in an argon-filled\nantiresonant hollow-core fibre. The fibre was directly fabricated using the\nstack-and-draw method with a wall thickness of approximately 90 nm, enabling\ncontinuous spectral coverage from the deep ultraviolet to the near infrared. We\nalso report numerical simulations to investigate the supercontinuum bandwidth\nand the factors limiting it, finding that the overall dispersion landscape, and\nassociated group-velocity matching of cross-phase modulation interactions, is\nthe dominant constraint on spectral extension.\n",
  "subjects": [
    "Physics/Optics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "OQk8s8Y32144e85n2B95XmQ1bPILuqUjH6C7RXlwjLc",
  "pdfSize": "2847360"
}