{
  "id": "2412.11585",
  "title": "Density Matrix Renormalization Group Study of Domain Wall Qubits",
  "authors": "Guanxiong Qu, Ji Zou, Daniel Loss, and Tomoki Hirosawa",
  "authorsParsed": [
    [
      "Qu",
      "Guanxiong",
      ""
    ],
    [
      "Zou",
      "Ji",
      ""
    ],
    [
      "Loss",
      "Daniel",
      ""
    ],
    [
      "Hirosawa",
      "Tomoki",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 09:17:36 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734340656000,
  "abstract": "  Nanoscale topological spin textures in magnetic systems are emerging as\npromising candidates for scalable quantum architectures. Despite their\npotential as qubits, previous studies have been limited to semiclassical\napproaches, leaving a critical gap: the lack of a fully quantum demonstration.\nHere, we address this challenge by employing the density-matrix renormalization\ngroup (DMRG) method to establish domain wall (DW) qubits in coupled quantum\nspin-1/2 chains. We calculate the ground-state energies and excitation gaps of\nthe system and find that DWs with opposite chiralities form a well-defined\nlow-energy sector, distinctly isolated from higher excited states in the\npresence of anisotropies. This renders the chirality states suitable for\nencoding quantum information, serving as robust qubits. Interestingly, when a\nmagnetic field is applied, we observe tunneling between quantum DW states with\nopposite chiralities. Through quantum simulations, we construct an effective\nqubit Hamiltonian that exhibits strongly anisotropic $g$-factors, offering a\nway to implement single-qubit gates. Furthermore, we obtain an effective\ninteracting Hamiltonian for two mobile DWs in coupled quantum spin chains from\nDMRG simulations, enabling the implementation of two-qubit gates. Our work\nrepresents a critical step from semiclassical constructions to a fully quantum\ndemonstration of the potential of DW textures for scalable quantum computing,\nestablishing a solid foundation for future quantum architectures based on\ntopological magnetic textures.\n",
  "subjects": [
    "Condensed Matter/Mesoscale and Nanoscale Physics",
    "Condensed Matter/Strongly Correlated Electrons"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "FWC0Z6OH_3RCwbOgaNBf3UMe7n2DKbIKToz8o9GG2o0",
  "pdfSize": "7323375"
}