{
  "id": "2412.11057",
  "title": "Set-Valued Sensitivity Analysis of Deep Neural Networks",
  "authors": "Xin Wang, Feilong Wang, and Xuegang Ban",
  "authorsParsed": [
    [
      "Wang",
      "Xin",
      ""
    ],
    [
      "Wang",
      "Feilong",
      ""
    ],
    [
      "Ban",
      "Xuegang",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 15 Dec 2024 05:22:38 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734240158000,
  "abstract": "  This paper proposes a sensitivity analysis framework based on set valued\nmapping for deep neural networks (DNN) to understand and compute how the\nsolutions (model weights) of DNN respond to perturbations in the training data.\nAs a DNN may not exhibit a unique solution (minima) and the algorithm of\nsolving a DNN may lead to different solutions with minor perturbations to input\ndata, we focus on the sensitivity of the solution set of DNN, instead of\nstudying a single solution. In particular, we are interested in the expansion\nand contraction of the set in response to data perturbations. If the change of\nsolution set can be bounded by the extent of the data perturbation, the model\nis said to exhibit the Lipschitz like property. This \"set-to-set\" analysis\napproach provides a deeper understanding of the robustness and reliability of\nDNNs during training. Our framework incorporates both isolated and non-isolated\nminima, and critically, does not require the assumption that the Hessian of\nloss function is non-singular. By developing set-level metrics such as distance\nbetween sets, convergence of sets, derivatives of set-valued mapping, and\nstability across the solution set, we prove that the solution set of the Fully\nConnected Neural Network holds Lipschitz-like properties. For general neural\nnetworks (e.g., Resnet), we introduce a graphical-derivative-based method to\nestimate the new solution set following data perturbation without retraining.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "G7DmXQYBqINUoliPwLOpTuPXIL3dx9pybemKZU-yoFc",
  "pdfSize": "1026878"
}