{"id":"2412.13463","title":"FlexPose: Pose Distribution Adaptation with Limited Guidance","authors":"Zixiao Wang, Junwu Weng, Mengyuan Liu, Bei Yu","authorsParsed":[["Wang","Zixiao",""],["Weng","Junwu",""],["Liu","Mengyuan",""],["Yu","Bei",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 03:18:11 GMT"}],"updateDate":"2024-12-19","timestamp":1734491891000,"abstract":"  Numerous well-annotated human key-point datasets are publicly available to\ndate. However, annotating human poses for newly collected images is still a\ncostly and time-consuming progress. Pose distributions from different datasets\nshare similar pose hinge-structure priors with different geometric\ntransformations, such as pivot orientation, joint rotation, and bone length\nratio. The difference between Pose distributions is essentially the difference\nbetween the transformation distributions. Inspired by this fact, we propose a\nmethod to calibrate a pre-trained pose generator in which the pose prior has\nalready been learned to an adapted one following a new pose distribution. We\ntreat the representation of human pose joint coordinates as skeleton image and\ntransfer a pre-trained pose annotation generator with only a few annotation\nguidance. By fine-tuning a limited number of linear layers that closely related\nto the pose transformation, the adapted generator is able to produce any number\nof pose annotations that are similar to the target poses. We evaluate our\nproposed method, FlexPose, on several cross-dataset settings both qualitatively\nand quantitatively, which demonstrates that our approach achieves\nstate-of-the-art performance compared to the existing generative-model-based\ntransfer learning methods when given limited annotation guidance.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Xigt94bEAmrfOLVUDZ8BaXnefZReYBYQZHwowsT06dc","pdfSize":"6365019"}