{
  "id": "2412.20138",
  "title": "TradingAgents: Multi-Agents LLM Financial Trading Framework",
  "authors": "Yijia Xiao, Edward Sun, Di Luo, Wei Wang",
  "authorsParsed": [
    [
      "Xiao",
      "Yijia",
      ""
    ],
    [
      "Sun",
      "Edward",
      ""
    ],
    [
      "Luo",
      "Di",
      ""
    ],
    [
      "Wang",
      "Wei",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 28 Dec 2024 12:54:06 GMT"
    },
    {
      "version": "v2",
      "created": "Thu, 9 Jan 2025 16:36:26 GMT"
    },
    {
      "version": "v3",
      "created": "Fri, 10 Jan 2025 20:02:32 GMT"
    },
    {
      "version": "v4",
      "created": "Sun, 23 Feb 2025 18:23:52 GMT"
    }
  ],
  "updateDate": "2025-02-25",
  "timestamp": 1735390446000,
  "abstract": "  Significant progress has been made in automated problem-solving using\nsocieties of agents powered by large language models (LLMs). In finance,\nefforts have largely focused on single-agent systems handling specific tasks or\nmulti-agent frameworks independently gathering data. However, multi-agent\nsystems' potential to replicate real-world trading firms' collaborative\ndynamics remains underexplored. TradingAgents proposes a novel stock trading\nframework inspired by trading firms, featuring LLM-powered agents in\nspecialized roles such as fundamental analysts, sentiment analysts, technical\nanalysts, and traders with varied risk profiles. The framework includes Bull\nand Bear researcher agents assessing market conditions, a risk management team\nmonitoring exposure, and traders synthesizing insights from debates and\nhistorical data to make informed decisions. By simulating a dynamic,\ncollaborative trading environment, this framework aims to improve trading\nperformance. Detailed architecture and extensive experiments reveal its\nsuperiority over baseline models, with notable improvements in cumulative\nreturns, Sharpe ratio, and maximum drawdown, highlighting the potential of\nmulti-agent LLM frameworks in financial trading. TradingAgents is available at\nhttps://github.com/TradingAgents-AI.\n",
  "subjects": [
    "Quantitative Finance/Trading and Market Microstructure",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Computational Engineering, Finance, and Science",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "d_rYFlMBS3kGt3jMyFu1-LqMLjaLqUHOhdIsOVU37tE",
  "pdfSize": "2439443"
}