{
  "id": "2412.11592",
  "title": "Performance of an instrumented baffle placed at the entrance of Virgo's\n  end mirror vacuum tower during O5",
  "authors": "M. Andr\\'es-Carcasona, M. Mart\\'inez, Ll. M. Mir, J. Mundet, H.\n  Yamamoto",
  "authorsParsed": [
    [
      "Andrés-Carcasona",
      "M.",
      ""
    ],
    [
      "Martínez",
      "M.",
      ""
    ],
    [
      "Mir",
      "Ll. M.",
      ""
    ],
    [
      "Mundet",
      "J.",
      ""
    ],
    [
      "Yamamoto",
      "H.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 09:26:16 GMT"
    },
    {
      "version": "v2",
      "created": "Wed, 22 Jan 2025 10:12:08 GMT"
    }
  ],
  "updateDate": "2025-01-23",
  "timestamp": 1734341176000,
  "abstract": "  In this article, we present results on the simulated performance of an\ninstrumented baffle installed at the entrance of the vacuum towers hosting the\nend mirrors of Virgo's main Fabry-P\\'erot cavities. The installation of\ninstrumented baffles is part of the Advanced Virgo Plus upgrade in time for the\nO5 observing run. They were originally envisaged to be suspended, mounted on\nnew payloads and surrounding new larger end mirrors. The current Virgo upgrade\nplan includes the replacement of the mirrors with new ones of better quality\nand same dimensions, leaving the installation of new payloads and larger end\nmirrors to a post-O5 upgrade phase still to be defined. Here we demonstrate\nthat placing the instrumented baffles just beyond the cryotrap gate valve and\nin front of the end mirrors would be equally effective for monitoring scattered\nlight inside the cavities. This new location, more than a meter away from the\nmirror, further reduces the risk of contamination and any potential\ninterference with the mirrors, preserves the full capability to monitor\nscattered light, and decouples the instrumented baffle timeline from the plans\nfor installing large mirrors in the experiment. We provide an estimate of the\nlight distribution the baffles would encounter under both nominal and\nnon-nominal conditions, as well as an assessment of the scattered light noise\nintroduced by these baffles in this new location, confirming that they would\nnot compromise Virgo's sensitivity.\n",
  "subjects": [
    "Physics/Instrumentation and Detectors"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "xaG5KFzxnX1xhHvsXVP04VQkKUpcOsn0yM1sgB3fBac",
  "pdfSize": "2505025"
}