{
  "id": "2412.01921",
  "title": "Imaging the innermost circumstellar environment of the red supergiant\n  WOH G64 in the Large Magellanic Cloud",
  "authors": "K. Ohnaka, K.-H. Hofmann, G. Weigelt, J. Th. van Loon, D. Schertl, and\n  S. R. Goldman",
  "authorsParsed": [
    [
      "Ohnaka",
      "K.",
      ""
    ],
    [
      "Hofmann",
      "K. -H.",
      ""
    ],
    [
      "Weigelt",
      "G.",
      ""
    ],
    [
      "van Loon",
      "J. Th.",
      ""
    ],
    [
      "Schertl",
      "D.",
      ""
    ],
    [
      "Goldman",
      "S. R.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 19:11:28 GMT"
    }
  ],
  "updateDate": "2024-12-04",
  "timestamp": 1733166688000,
  "abstract": "  Significant mass loss in the red supergiant (RSG) phase has great influence\non the evolution of massive stars and their final fate as supernovae. We\npresent near-infrared interferometric imaging of the circumstellar environment\nof the dust-enshrouded RSG WOH G64 in the Large Magellanic Cloud. WOH G64 was\nobserved with the GRAVITY instrument at ESO's Very Large Telescope\nInterferometer (VLTI) at 2.0--2.45 micron. We succeeded in imaging the\ninnermost circumstellar environment of WOH G64 -- the first interferometric\nimaging of an RSG outside the Milky Way. The reconstructed image reveals\nelongated compact emission with a semimajor and semiminor axis of ~2 and ~1.5\nmas (~13 and 9 stellar radii), respectively. The GRAVITY data show that the\nstellar flux contribution at 2.2 micron at the time of our observations in 2020\nis much lower than predicted by the optically and geometrically thick dust\ntorus model based on the VLTI/MIDI data taken in 2005 and 2007. We found a\nsignificant change in the near-infrared spectrum of WOH G64: while the\n(spectro)photometric data taken at 1--2.5 micron before 2003 show the spectrum\nof the central RSG with H2O absorption, the spectra and JHK' photometric data\ntaken after 2016 are characterized by a monotonically rising continuum with\nvery weak signatures of H2O. This spectral change likely took place between\nDecember 2009 and 2016. On the other hand, the mid-infrared spectrum obtained\nin 2022 with VLT/VISIR agrees well with the spectra obtained before 2007. The\ncompact emission imaged with GRAVITY and the near-infrared spectral change\nsuggest the formation of hot new dust close to the star, which gives rise to\nthe monotonically rising near-infrared continuum and the high obscuration of\nthe central star. The elongation of the emission may be due to the presence of\na bipolar outflow or effects of an unseen companion.\n",
  "subjects": [
    "Astrophysics/Solar and Stellar Astrophysics",
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "CpmZO23gFfINzoCd_acShmpilwm_hKmkce1jaUKjrdY",
  "pdfSize": "5410381"
}