{"id":"2412.01873","title":"Solar GES-structure modified with EiBI gravity","authors":"Souvik Das and Pralay Kumar Karmakar","authorsParsed":[["Das","Souvik",""],["Karmakar","Pralay Kumar",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 16:19:32 GMT"}],"updateDate":"2024-12-04","timestamp":1733156372000,"abstract":"  In the post-Newtonian era, the Eddington-inspired Born-Infeld (EiBI) theory,\nconsidered as an improved modification of the Einsteinian general relativity\nformalism in the weak field regime (non-relativistic), has enabled us to study\nthe dynamics of dense astroobjects in light of the modified gravitational\neffects. This EiBI theory imparts a new shape to the usual gravitational\nPoisson equation through the addition of a cosmological correction factor,\ntermed as the EiBI gravity parameter. A systematic inclusion of this gravity in\nthe basic structure equation could lead to a realistic picture of the existing\nsolar models free from any end-stage singularity. A theoretic model is\naccordingly proposed to investigate the effect of the EiBI gravity on the\nGravito-Electrostatic Sheath (GES) formalism of the equilibrium solar plasma\nstructure. This study shows that the GES-based solar plasma dynamics is\nnoticeably modified against the previously reported Newtonian GES-model\nstudies. An equilibrium bounded solution for the solar self-gravity shows the\nEiBI-modified solar surface boundary (SSB) to exist at a new helio-centric\nradial location $\\xi = 4$ (on the Jeansean scale). It is found that the EiBI\ngravity shifts the present SSB outwards by 14.28% relative to the original\nNewtonian SSB. The EiBI-modified gravity effects on diverse relevant solar\nparameters, such as the gravito-electrostatic potentials, fields, and Mach\nnumbers, are illustratively analyzed. It is anticipated that our analyses could\nbe applied further to see the solar plasma equilibrium and fluctuation dynamics\nin realistically modified post-Newtonian gravity environments on both the\nbounded (interior) and unbounded (exterior) solar plasma scales.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Astrophysics/Solar and Stellar Astrophysics","Physics/Plasma Physics","Physics/Space Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"4EwRc1paPbkqGdJpS-OTtBNvJBIQYBPYelv7enK2rrg","pdfSize":"838304"}