{"id":"2412.13329","title":"Revealing the anisotropic charge-density-wave order of TiSe$_2$ through\n  high harmonic generation","authors":"Lin Zhang, Igor Tyulnev, Lenard Vamos, Julita Poborska, Utso\n  Bhattacharya, Ravindra W. Chhajlany, Tobias Grass, Jens Biegert, Maciej\n  Lewenstein","authorsParsed":[["Zhang","Lin",""],["Tyulnev","Igor",""],["Vamos","Lenard",""],["Poborska","Julita",""],["Bhattacharya","Utso",""],["Chhajlany","Ravindra W.",""],["Grass","Tobias",""],["Biegert","Jens",""],["Lewenstein","Maciej",""]],"versions":[{"version":"v1","created":"Tue, 17 Dec 2024 20:58:56 GMT"}],"updateDate":"2024-12-19","timestamp":1734469136000,"abstract":"  Titanium diselenide (TiSe$_{2}$) is a transition-metal dichalcogenide\nmaterial that undergoes a charge-density-wave (CDW) transition at $T_{c}\\approx\n200\\,\\mathrm{K}$. In a recent experiment [I. Tyulnev et al., arXiv:2409.04216],\nthe high harmonic generation (HHG) spectra of this material has been studied,\nwhich exhibits asymmetric behavior with respect to the polarization angle of\nthe incident light and provides a new perspective to the CDW phase transition.\nIn this work, we work out a theoretical explanation for the experimentally\nobserved behavior of HHG spectra. We propose a simplified phenomenological\nmean-field model for this material, based on which the HHG spectra is\ncalculated through the time-dependent Schr\\\"odinger equation. This model\ncorrectly describes the measured intensity distribution of the third-, fifth-,\nand seventh-order harmonic generation as a function of polarization direction\nand reveals a strong asymmetry due to the anisotropic CDW order in the low\ntemperature phase. Our work provides a basis for applying high harmonic\nspectroscopy to reveal a new perspective on the nature of CDW orders.\n","subjects":["Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"TWCCg-vx1HVAjsrUG-BdwxDd3CBWRRx-Wx6AxHV7WkU","pdfSize":"1699753"}