{"id":"2412.15473","title":"Predicting Long-Term Student Outcomes from Short-Term EdTech Log Data","authors":"Ge Gao, Amelia Leon, Andrea Jetten, Jasmine Turner, Husni Almoubayyed,\n  Stephen Fancsali, Emma Brunskill","authorsParsed":[["Gao","Ge",""],["Leon","Amelia",""],["Jetten","Andrea",""],["Turner","Jasmine",""],["Almoubayyed","Husni",""],["Fancsali","Stephen",""],["Brunskill","Emma",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 01:05:23 GMT"},{"version":"v2","created":"Wed, 15 Jan 2025 23:11:07 GMT"}],"updateDate":"2025-01-17","timestamp":1734656723000,"abstract":"  Educational stakeholders are often particularly interested in sparse, delayed\nstudent outcomes, like end-of-year statewide exams. The rare occurrence of such\nassessments makes it harder to identify students likely to fail such\nassessments, as well as making it slow for researchers and educators to be able\nto assess the effectiveness of particular educational tools. Prior work has\nprimarily focused on using logs from students full usage (e.g. year-long) of an\neducational product to predict outcomes, or considered predictive accuracy\nusing a few minutes to predict outcomes after a short (e.g. 1 hour) session. In\ncontrast, we investigate machine learning predictors using students' logs\nduring their first few hours of usage can provide useful predictive insight\ninto those students' end-of-school year external assessment. We do this on\nthree diverse datasets: from students in Uganda using a literacy game product,\nand from students in the US using two mathematics intelligent tutoring systems.\nWe consider various measures of the accuracy of the resulting predictors,\nincluding its ability to identify students at different parts along the\nassessment performance distribution. Our findings suggest that short-term log\nusage data, from 2-5 hours, can be used to provide valuable signal about\nstudents' long-term external performance.\n","subjects":["Computer Science/Computers and Society","Computer Science/Human-Computer Interaction","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"j58seQuvmnv8iIy67gxRDIKZaD5Voy6cFaen3dj0XTA","pdfSize":"1185694"}