{
  "id": "2412.14753",
  "title": "Opportunities and limitations of explaining quantum machine learning",
  "authors": "Elies Gil-Fuster, Jonas R. Naujoks, Gr\\'egoire Montavon, Thomas\n  Wiegand, Wojciech Samek, Jens Eisert",
  "authorsParsed": [
    [
      "Gil-Fuster",
      "Elies",
      ""
    ],
    [
      "Naujoks",
      "Jonas R.",
      ""
    ],
    [
      "Montavon",
      "Grégoire",
      ""
    ],
    [
      "Wiegand",
      "Thomas",
      ""
    ],
    [
      "Samek",
      "Wojciech",
      ""
    ],
    [
      "Eisert",
      "Jens",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 11:34:22 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734608062000,
  "abstract": "  A common trait of many machine learning models is that it is often difficult\nto understand and explain what caused the model to produce the given output.\nWhile the explainability of neural networks has been an active field of\nresearch in the last years, comparably little is known for quantum machine\nlearning models. Despite a few recent works analyzing some specific aspects of\nexplainability, as of now there is no clear big picture perspective as to what\ncan be expected from quantum learning models in terms of explainability. In\nthis work, we address this issue by identifying promising research avenues in\nthis direction and lining out the expected future results. We additionally\npropose two explanation methods designed specifically for quantum machine\nlearning models, as first of their kind to the best of our knowledge. Next to\nour pre-view of the field, we compare both existing and novel methods to\nexplain the predictions of quantum learning models. By studying explainability\nin quantum machine learning, we can contribute to the sustainable development\nof the field, preventing trust issues in the future.\n",
  "subjects": [
    "Physics/Quantum Physics",
    "Computer Science/Machine Learning",
    "Statistics/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "BFrdX7H38Y0m635Sv248whXcE33EXrCV3FUI_TlbMyw",
  "pdfSize": "2119970"
}