{"id":"2412.17793","title":"On the Optimization of Singular Spectrum Analyses: A Pragmatic Approach","authors":"Fernando Lopes and Dominique Gibert and Vincent Courtillot and\n  Jean-Louis Le Mou\\\"el and Jean-Baptiste Boul\\'e","authorsParsed":[["Lopes","Fernando",""],["Gibert","Dominique",""],["Courtillot","Vincent",""],["Mouël","Jean-Louis Le",""],["Boulé","Jean-Baptiste",""]],"versions":[{"version":"v1","created":"Mon, 23 Dec 2024 18:50:49 GMT"}],"updateDate":"2024-12-24","timestamp":1734979849000,"abstract":"  Singular Spectrum Analysis (SSA) occupies a prominent place in the real\nsignal analysis toolkit alongside Fourier and Wavelet analysis. In addition to\nthe two aforementioned analyses, SSA allows the separation of patterns directly\nfrom the data space into the data space, with data that need not be strictly\nstationary, continuous, or even normally sampled. In most cases, SSA relies on\na combination of Hankel or Toeplitz matrices and Singular Value Decomposition\n(SVD). Like Fourier and Wavelet analysis, SSA has its limitations. The main\nbottleneck of the method can be summarized in three points. The first is the\ndiagonalization of the Hankel/Toeplitz matrix, which can become a major problem\nfrom a memory and/or computational point of view if the time series to be\nanalyzed is very long or heavily sampled. The second point concerns the size of\nthe analysis window, typically denoted as 'L', which will affect the detection\nof patterns in the time series as well as the dimensions of the Hankel/Toeplitz\nmatrix. Finally, the third point concerns pattern reconstruction: how to easily\nidentify in the eigenvector/eigenvalue space which patterns should be grouped.\nWe propose to address each of these issues by describing a hopefully effective\napproach that we have been developing for over 10 years and that has yielded\ngood results in our research work.\n","subjects":["Physics/Geophysics","Computer Science/Performance","Physics/Biological Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"DeGE0Wi6EG9IzAWRGpdv31lWtmXqKTcHret9Zbeqs4c","pdfSize":"6990267"}