{"id":"2412.05541","title":"Isochronous and period-doubling diagrams for symplectic maps of the\n  plane","authors":"Tim Zolkin, Sergei Nagaitsev, Ivan Morozov, Sergei Kladov and\n  Young-Kee Kim","authorsParsed":[["Zolkin","Tim",""],["Nagaitsev","Sergei",""],["Morozov","Ivan",""],["Kladov","Sergei",""],["Kim","Young-Kee",""]],"versions":[{"version":"v1","created":"Sat, 7 Dec 2024 05:20:04 GMT"},{"version":"v2","created":"Tue, 10 Dec 2024 06:49:52 GMT"}],"updateDate":"2024-12-11","timestamp":1733548804000,"abstract":"  Symplectic mappings of the plane serve as key models for exploring the\nfundamental nature of complex behavior in nonlinear systems. Central to this\nexploration is the effective visualization of stability regimes, which enables\nthe interpretation of how systems evolve under varying conditions. While the\narea-preserving quadratic H\\'enon map has received significant theoretical\nattention, a comprehensive description of its mixed parameter-space dynamics\nremain lacking. This limitation arises from early attempts to reduce the full\ntwo-dimensional phase space to a one-dimensional projection, a simplification\nthat resulted in the loss of important dynamical features. Consequently, there\nis a clear need for a more thorough understanding of the underlying qualitative\naspects.\n  This paper aims to address this gap by revisiting the foundational concepts\nof reversibility and associated symmetries, first explored in the early works\nof G.D. Birkhoff. We extend the original framework proposed by H\\'enon by\nadding a period-doubling diagram to his isochronous diagram, which allows to\nrepresents the system's bifurcations and the groups of symmetric periodic\norbits that emerge in typical bifurcations of the fixed point. A qualitative\nand quantitative explanation of the main features of the region of parameters\nwith bounded motion is provided, along with the application of this technique\nto other symplectic mappings, including cases of multiple reversibility. Modern\nchaos indicators, such as the Reversibility Error Method and the Generalized\nAlignment Index, are employed to distinguish between various dynamical regimes\nin the mixed space of variables and parameters. These tools prove effective in\ndifferentiating regular and chaotic dynamics, as well as in identifying\ntwistless orbits and their associated bifurcations.\n","subjects":["Nonlinear Sciences/Chaotic Dynamics","Physics/Accelerator Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"smp7YDI1wPlGPceeYvsKn--u2sKc02GT1EK0wDXUmEo","pdfSize":"10897264"}