{
  "id": "2412.03030",
  "title": "Exploring the Viability of Unikernels for ARM-powered Edge Computing",
  "authors": "Shahidullah Kaiser, Ali Saman Tosun, Turgay Korkmaz",
  "authorsParsed": [
    [
      "Kaiser",
      "Shahidullah",
      ""
    ],
    [
      "Tosun",
      "Ali Saman",
      ""
    ],
    [
      "Korkmaz",
      "Turgay",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 04:56:27 GMT"
    }
  ],
  "updateDate": "2024-12-05",
  "timestamp": 1733288187000,
  "abstract": "  The rapid expansion of IoT devices and their real-time applications have\ndriven a growing need for edge computing. To meet this need, efficient and\nsecure solutions are required for running such applications on\nresource-constrained devices with limited power, CPU, and memory. Unikernel,\nwith its minimalistic design and application-specific approach, offers a\npromising alternative to traditional virtualization and container technologies\nin these environments. The existing research does not thoroughly examine the\nfeasibility of using unikernel for edge computing. This paper investigates the\npotential of unikernel for ARM-powered edge computing by evaluating the\nperformance and efficiency of three prominent unikernel systems such as OSv,\nNanos, and Unikraft against Docker container. We experiment with real-world\nedge computing applications and utilize key metrics such as boot time,\nexecution time, memory usage, CPU overhead, and network performance to\ndetermine how unikernel performs under the constraints of edge devices. Our\nfindings reveal the potential advantages of unikernel in terms of reduced\nresource consumption and faster startup times while highlighting areas where\nthey may need further optimization for edge deployment. This study provides\nvaluable insights for researchers and practitioners considering unikernel as a\nlightweight, efficient solution for edge computing on ARM architectures.\n",
  "subjects": [
    "Computer Science/Distributed, Parallel, and Cluster Computing"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "_eNxRYRQ9qvdMv-XFZiPgwyAyLf61ZDFlLa3xPl309U",
  "pdfSize": "702116"
}