{
  "id": "2412.03310",
  "title": "Grounded Language Design for Lightweight Diagramming for Formal Methods",
  "authors": "Siddhartha Prasad, Ben Greenman, Tim Nelson, Shriram Krishnamurthi",
  "authorsParsed": [
    [
      "Prasad",
      "Siddhartha",
      ""
    ],
    [
      "Greenman",
      "Ben",
      ""
    ],
    [
      "Nelson",
      "Tim",
      ""
    ],
    [
      "Krishnamurthi",
      "Shriram",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 13:37:59 GMT"
    }
  ],
  "updateDate": "2024-12-05",
  "timestamp": 1733319479000,
  "abstract": "  Model finding, as embodied by SAT solvers and similar tools, is used widely,\nboth in embedding settings and as a tool in its own right. For instance, tools\nlike Alloy target SAT to enable users to incrementally define, explore, verify,\nand diagnose sophisticated specifications for a large number of complex\nsystems.\n  These tools critically include a visualizer that lets users graphically\nexplore these generated models. As we show, however, default visualizers, which\nknow nothing about the domain, are unhelpful and even actively violate\npresentational and cognitive principles. At the other extreme, full-blown\nvisualizations require significant effort as well as knowledge a specifier\nmight not possess; they can also exhibit bad failure modes (including silent\nfailure). Instead, we need a language to capture essential domain information\nfor lightweight diagramming. We ground our language design in both the\ncognitive science literature on diagrams and on a large number of example\ncustom visualizations. This identifies the key elements of lightweight\ndiagrams. We distill these into a small set of orthogonal primitives. We extend\nan Alloy-like tool to support these primitives. We evaluate the effectiveness\nof the produced diagrams, finding them good for reasoning. We then compare this\nagainst many other drawing languages and tools to show that this work defines a\nnew niche that is lightweight, effective, and driven by sound principles.\n",
  "subjects": [
    "Computer Science/Computation and Language",
    "Computer Science/Programming Languages"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "iE3cFf0P2H2YlHffbDEgEn1oh3Kwc9GDCaWqrbrrYAQ",
  "pdfSize": "3362071"
}