{
  "id": "2412.12471",
  "title": "Hints Help Finding and Fixing Bugs Differently in Python and Text-based\n  Program Representations",
  "authors": "Ruchit Rawal, Victor-Alexandru P\\u{a}durean, Sven Apel, Adish Singla,\n  Mariya Toneva",
  "authorsParsed": [
    [
      "Rawal",
      "Ruchit",
      ""
    ],
    [
      "Pădurean",
      "Victor-Alexandru",
      ""
    ],
    [
      "Apel",
      "Sven",
      ""
    ],
    [
      "Singla",
      "Adish",
      ""
    ],
    [
      "Toneva",
      "Mariya",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 02:11:53 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734401513000,
  "abstract": "  With the recent advances in AI programming assistants such as GitHub Copilot,\nprogramming is not limited to classical programming languages\nanymore--programming tasks can also be expressed and solved by end-users in\nnatural text. Despite the availability of this new programming modality, users\nstill face difficulties with algorithmic understanding and program debugging.\nOne promising approach to support end-users is to provide hints to help them\nfind and fix bugs while forming and improving their programming capabilities.\nWhile it is plausible that hints can help, it is unclear which type of hint is\nhelpful and how this depends on program representations (classic source code or\na textual representation) and the user's capability of understanding the\nalgorithmic task. To understand the role of hints in this space, we conduct a\nlarge-scale crowd-sourced study involving 753 participants investigating the\neffect of three types of hints (test cases, conceptual, and detailed), across\ntwo program representations (Python and text-based), and two groups of users\n(with clear understanding or confusion about the algorithmic task). We find\nthat the program representation (Python vs. text) has a significant influence\non the users' accuracy at finding and fixing bugs. Surprisingly, users are more\naccurate at finding and fixing bugs when they see the program in natural text.\nHints are generally helpful in improving accuracy, but different hints help\ndifferently depending on the program representation and the user's\nunderstanding of the algorithmic task. These findings have implications for\ndesigning next-generation programming tools that provide personalized support\nto users, for example, by adapting the programming modality and providing hints\nwith respect to the user's skill level and understanding.\n",
  "subjects": [
    "Computer Science/Software Engineering"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "JAtkl0PnZausmJ-Pp9IfPKlzrSuvCMbehixkDF1YTwE",
  "pdfSize": "439946"
}