{
  "id": "2412.11552",
  "title": "Efficient Avoidance of Ellipsoidal Obstacles with Model Predictive\n  Control for Mobile Robots and Vehicles",
  "authors": "Mario Rosenfelder, Hendrik Carius, Markus Herrmann-Wicklmayr, Peter\n  Eberhard, Kathrin Fla{\\ss}kamp, Henrik Ebel",
  "authorsParsed": [
    [
      "Rosenfelder",
      "Mario",
      ""
    ],
    [
      "Carius",
      "Hendrik",
      ""
    ],
    [
      "Herrmann-Wicklmayr",
      "Markus",
      ""
    ],
    [
      "Eberhard",
      "Peter",
      ""
    ],
    [
      "Flaßkamp",
      "Kathrin",
      ""
    ],
    [
      "Ebel",
      "Henrik",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 08:34:28 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734338068000,
  "abstract": "  In real-world applications of mobile robots, collision avoidance is of\ncritical importance. Typically, global motion planning in constrained\nenvironments is addressed through high-level control schemes. However,\nadditionally integrating local collision avoidance into robot motion control\noffers significant advantages. For instance, it reduces the reliance on\nheuristics and conservatism that can arise from a two-stage approach separating\nlocal collision avoidance and control. Moreover, using model predictive control\n(MPC), a robot's full potential can be harnessed by considering jointly local\ncollision avoidance, the robot's dynamics, and actuation constraints. In this\ncontext, the present paper focuses on obstacle avoidance for wheeled mobile\nrobots, where both the robot's and obstacles' occupied volumes are modeled as\nellipsoids. To this end, a computationally efficient overlap test, that works\nfor arbitrary ellipsoids, is conducted and novelly integrated into the MPC\nframework. We propose a particularly efficient implementation tailored to\nrobots moving in the plane. The functionality of the proposed obstacle-avoiding\nMPC is demonstrated for two exemplary types of kinematics by means of\nsimulations. A hardware experiment using a real-world wheeled mobile robot\nshows transferability to reality and real-time applicability. The general\ncomputational approach to ellipsoidal obstacle avoidance can also be applied to\nother robotic systems and vehicles as well as three-dimensional scenarios.\n",
  "subjects": [
    "Computer Science/Robotics",
    "Computer Science/Systems and Control",
    "Electrical Engineering and Systems Science/Systems and Control"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Jan3wOqShlNb4p8P-Kb3EOq3FrZQOYCWV-T-MNP-39U",
  "pdfSize": "2890813"
}