{"id":"2412.15017","title":"Brownian motion at various length scales with hydrodynamic and direct\n  interactions","authors":"Jeffrey C. Everts, Robert Ho{\\l}yst, Karol Makuch","authorsParsed":[["Everts","Jeffrey C.",""],["Hołyst","Robert",""],["Makuch","Karol",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 16:30:34 GMT"},{"version":"v2","created":"Tue, 25 Feb 2025 22:07:24 GMT"}],"updateDate":"2025-02-27","timestamp":1734625834000,"abstract":"  Brownian motion is essential for describing diffusion in systems ranging from\nsimple to complex liquids. Unlike simple liquids, which consist of only a\nsolvent, complex liquids, such as colloidal suspensions or the cytoplasm of a\ncell, are mixtures of various constituents with different shapes and sizes.\nDescribing Brownian motion in such multiscale systems is extremely challenging\nbecause direct and many-body hydrodynamic interactions (and their interplay)\nplay a pivotal role. Diffusion of small particles is mainly governed by a low\nviscous character of the solution, whereas large particles experience a highly\nviscous flow of the complex liquid on the macro scale. A quantity that encodes\nhydrodynamics on both length scales is the wave-vector-dependent viscosity.\nAssuming this quantity to be known -- in contrast to most studies in which the\nsolvent shear viscosity is given -- provides a new perspective on studying the\ndiffusivity of a tracer, especially in situations where the tracer size can\nvary by several orders of magnitude. Here, we start systematic studies of exact\nformal microscopic expressions for the short- and long-time self-diffusion\ncoefficients of a single probe particle in a complex liquid in terms of\nshort-ranged hydrodynamic response kernels. We study Brownian motion as a\nfunction of the probe size, contrasting most theories that focus on\nself-diffusion as a function of the crowder volume fraction. We discuss the\nlimits of small and large probe sizes for various levels of approximations in\nour theory, and discuss the current successes and shortcomings of our approach.\n","subjects":["Condensed Matter/Soft Condensed Matter","Condensed Matter/Statistical Mechanics","Physics/Biological Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"1EXirAsNcYGkUdz4NEM_KzpSzIQwG5NwDTCx3OEMSA4","pdfSize":"2938368"}