{"id":"2412.02647","title":"Quaternary and Component-Binary Spreading Codes with Low Correlation for\n  Navigation Systems","authors":"P. Vijay Kumar, Sugandh Mishra and Dileep Dharmappa","authorsParsed":[["Kumar","P. Vijay",""],["Mishra","Sugandh",""],["Dharmappa","Dileep",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 18:21:29 GMT"}],"updateDate":"2024-12-04","timestamp":1733250089000,"abstract":"  In the first part of this two-part paper, we construct a family MFD$_2$ of\nlow-correlation quaternary spreading codes having period $2046$. By quaternary,\nwe mean that the spreading code symbols are drawn from $Z_4$ and are designed\nto be used in conjunction with QPSK modulation. Apart from low auto and\ncrosscorrelation properties, we also require in addition, to our knowledge for\nthe first time, that the spreading code family IZ4$_2$ obtained by taking the\nunion of the component in-phase and quadrature-phase binary spreading codes\nassociated to each quaternary spreading code in MFD$_2$, also have desirable\nlow-correlation properties. We also investigate the balance of the quaternary\nand binary spreading codes.\n  The second part is motivated by an application to the design of spreading\ncode, (in this application termed as ranging codes), having parameters suitable\nfor use in a lunar PNT system. Two lengths that are of particular current\ninterest for a planned lunar PNT satellite system are $2046$ and $10230$. We\nstudy the applicability of a subset IZ4$_{2S}$ of IZ4$_2$ containing balanced\nbinary spreading codes having length $2046$ to such a lunar PNT system. We show\nthat the spreading codes belonging to IZ4$_{2S}$ compare favorably with the\nspreading codes of length $2046$ appearing in a recent issue of Inside GNSS. We\nalso show that the IZ4$_{10}$ spreading code family in which the spreading\ncodes have length $10230$, compares well in comparison with spreading codes of\nlength $10230$ described in this article. In addition, the IZ4$_{10}$ and\nIZ4$_2$ spreading codes have been paired so as to be orthogonal at zero shift\ndespite their different lengths and chipping rates.\n","subjects":["Computer Science/Information Theory","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"SWSBMOzOVborVfz3H07pOgol9yq4iYrjfbiGoVvRHj0","pdfSize":"900530"}