{
  "id": "2412.20497",
  "title": "Origin of Pressure-Induced Structural Instability in CsPbX$_3$\n  Photovoltaic Perovskites",
  "authors": "Sizhan Liu, Sandun Amarasinghe, Mo Li, Stella Chariton, Vitali\n  Prakapenka, Sanjit K. Ghose, Yong Yan, Joshua Young and Trevor A. Tyson",
  "authorsParsed": [
    [
      "Liu",
      "Sizhan",
      ""
    ],
    [
      "Amarasinghe",
      "Sandun",
      ""
    ],
    [
      "Li",
      "Mo",
      ""
    ],
    [
      "Chariton",
      "Stella",
      ""
    ],
    [
      "Prakapenka",
      "Vitali",
      ""
    ],
    [
      "Ghose",
      "Sanjit K.",
      ""
    ],
    [
      "Yan",
      "Yong",
      ""
    ],
    [
      "Young",
      "Joshua",
      ""
    ],
    [
      "Tyson",
      "Trevor A.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 29 Dec 2024 15:27:24 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735486044000,
  "abstract": "  Under external stimuli, lead halide perovskites exhibit large atomic\nfluctuations, impacting optical and electron transport properties that affect\ndevice performance in operational settings. However, a thorough understanding\nof the atomic basis for the underlying structural instability is still absent.\nFocusing on the model material CsPbBr$_3$, the inherent lattice softness of\nhalide perovskites is elucidated at the atomic level through in-situ\nsingle-crystal X-ray diffraction measurements under pressure complemented by\natomic level simulations. We identify and explore the nature of the first-order\nphase transition to a distorted P21/c phase at 1.3 GPa, induced by the sudden\nCs-Br bonds breaking. Unlike classical transition metal oxide perovskites,\nwhere the internal energy term dominates, we show explicitly that pressure\nprimarily influences the Gibbs free energy for halide perovskites through the\npressure-volume term. As such, strategically mitigating bond strains from\nvolume shrinkage is the key to suppressing the first-order behavior for\nmaintaining the coordinates of PbX$_6$ polyhedral upon external perturbation.\nOur thermodynamic calculation reveals the demand for high entropy in the\n-T*del-S term, which can be achieved by exploring a broader spectrum of doped A\nsite and B sites in ABX$_3$ systems, enabling continuous structural changes\nthat facilitate recovery from mechanical damage in practical applications.\n",
  "subjects": [
    "Condensed Matter/Materials Science"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "wknPiVmx3ue4DBEcpKV9HVF36evbAC1NdVKyrAlqqWE",
  "pdfSize": "2938806"
}