{"id":"2412.08823","title":"Parity symmetry breaking of spin-$j$ coherent state superpositions in\n  Gaussian noise channel","authors":"Bouchra El Alaoui, Abdallah Slaoui, Abderrahim Lakhfif and Rachid Ahl\n  Laamara","authorsParsed":[["Alaoui","Bouchra El",""],["Slaoui","Abdallah",""],["Lakhfif","Abderrahim",""],["Laamara","Rachid Ahl",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 23:48:00 GMT"}],"updateDate":"2024-12-13","timestamp":1733960880000,"abstract":"  The Wigner function and Wigner-Yanase skew information are connected through\nquantum coherence. States with high skew information often exhibit more\npronounced negative regions in their Wigner functions, indicative of quantum\ninterference and non-classical behavior. Thus, the relationship between these\ntwo concepts is that states with high quantum coherence tend to display more\nnon-classical features in their Wigner functions. By exploiting this\nrelationship, which manifests as parity symmetry and asymmetry, we analyze\nparity symmetry and asymmetry in the superposition of two spin coherent states\nfor a spin-$1/2$, as well as for a general spin-$j$. This analysis shows that\nthe preservation of the parity asymmetry, or the violation of the parity\nsymmetry, correlates with an increase in the value of spin $j$. Additionally,\nwe investigate the behavior of parity symmetry and asymmetry of these states\nsubjected to a Gaussian noise channel. Specifically, we examine how this parity\nsymmetry and asymmetry change and identify the points at which parity symmetry\nis violated in the spin-$1/2$ cat state. Notably, the violation of parity\nsymmetry becomes more pronounced at higher values of the decoherence parameter\n$s$. Our study shows how the spin value $j$ affects the breaking of parity\nsymmetry in general spin-$j$ cat states that are hit by Gaussian noise.\n","subjects":["Physics/Quantum Physics","Physics/Mathematical Physics","Mathematics/Mathematical Physics"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"737hHpD4CaHrVwsZDe_uZi_EhYxVVB2OtBaojqXlpsI","pdfSize":"10233008"}