{"id":"2412.16143","title":"Quantitative classicality in cosmological interactions during inflation","authors":"Yoann L. Launay, Gerasimos I. Rigopoulos, E. Paul S. Shellard","authorsParsed":[["Launay","Yoann L.",""],["Rigopoulos","Gerasimos I.",""],["Shellard","E. Paul S.",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 18:46:19 GMT"}],"updateDate":"2024-12-23","timestamp":1734720379000,"abstract":"  We examine the classical and quantum evolution of inflationary cosmological\nperturbations from quantum initial conditions, using the on-shell and off-shell\ncontributions to correlators to investigate the signatures of interactions. In\nparticular, we calculate the Keldysh contributions to the leading order\nbispectrum from past infinity, showing that the squeezed limit is dominated by\nthe on-shell evolution. By truncating the time integrals in the analytic\nexpressions for contributions to the bispectrum, we define a `quantum\ninteractivity' and quantitatively identify scales and times for which it is\nsufficient to only assume classical evolution, given a fixed precision. In\ncontrast to common perceptions inspired by free two-point functions, we show\nthat common non-linear terms of inflationary perturbations can be\nwell-described by classical evolution even prior to horizon crossing. The\ninsights gained here can pave the way for quantitative criteria for justifying\nthe validity of numerically simulating the generation and evolution of quantum\nfluctuations in inflation. In particular, we comment on the validity of using\nstochastic inflation to reproduce known in-in perturbative results. An\nextensive appendix provides a review of the Keldysh formulation of the in-in\nformalism with the initial state set at a finite, as opposed to infinite past,\nemphasizing the importance of considering temporal boundary terms and the\ninitial state for correctly obtaining the propagators. We also show how\nstochastic dynamics can emerge as a sufficient approximation to the full\nquantum evolution. This becomes particularly transparent in the Keldysh\ndescription.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"TatC6MW9Ex7fBtZwHEP_3t9rs54vQuaVaXJcnKPUf7w","pdfSize":"2144656"}