{
  "id": "2412.17404",
  "title": "BrainMAP: Learning Multiple Activation Pathways in Brain Networks",
  "authors": "Song Wang, Zhenyu Lei, Zhen Tan, Jiaqi Ding, Xinyu Zhao, Yushun Dong,\n  Guorong Wu, Tianlong Chen, Chen Chen, Aiying Zhang, Jundong Li",
  "authorsParsed": [
    [
      "Wang",
      "Song",
      ""
    ],
    [
      "Lei",
      "Zhenyu",
      ""
    ],
    [
      "Tan",
      "Zhen",
      ""
    ],
    [
      "Ding",
      "Jiaqi",
      ""
    ],
    [
      "Zhao",
      "Xinyu",
      ""
    ],
    [
      "Dong",
      "Yushun",
      ""
    ],
    [
      "Wu",
      "Guorong",
      ""
    ],
    [
      "Chen",
      "Tianlong",
      ""
    ],
    [
      "Chen",
      "Chen",
      ""
    ],
    [
      "Zhang",
      "Aiying",
      ""
    ],
    [
      "Li",
      "Jundong",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 09:13:35 GMT"
    },
    {
      "version": "v2",
      "created": "Sat, 1 Feb 2025 04:50:59 GMT"
    }
  ],
  "updateDate": "2025-02-04",
  "timestamp": 1734945215000,
  "abstract": "  Functional Magnetic Resonance Image (fMRI) is commonly employed to study\nhuman brain activity, since it offers insight into the relationship between\nfunctional fluctuations and human behavior. To enhance analysis and\ncomprehension of brain activity, Graph Neural Networks (GNNs) have been widely\napplied to the analysis of functional connectivities (FC) derived from fMRI\ndata, due to their ability to capture the synergistic interactions among brain\nregions. However, in the human brain, performing complex tasks typically\ninvolves the activation of certain pathways, which could be represented as\npaths across graphs. As such, conventional GNNs struggle to learn from these\npathways due to the long-range dependencies of multiple pathways. To address\nthese challenges, we introduce a novel framework BrainMAP to learn Multiple\nActivation Pathways in Brain networks. BrainMAP leverages sequential models to\nidentify long-range correlations among sequentialized brain regions and\nincorporates an aggregation module based on Mixture of Experts (MoE) to learn\nfrom multiple pathways. Our comprehensive experiments highlight BrainMAP's\nsuperior performance. Furthermore, our framework enables explanatory analyses\nof crucial brain regions involved in tasks. Our code is provided at\nhttps://github.com/LzyFischer/Graph-Mamba.\n",
  "subjects": [
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "5AeH3iFiMv8kC0CCQF5oonE4Sc0iLP5go52v_cK2E2c",
  "pdfSize": "798710"
}