{"id":"2412.10299","title":"Towards an exact approach to pulsar timing","authors":"Amodio Carleo, Delphine Perrodin, Andrea Possenti","authorsParsed":[["Carleo","Amodio",""],["Perrodin","Delphine",""],["Possenti","Andrea",""]],"versions":[{"version":"v1","created":"Fri, 13 Dec 2024 17:35:04 GMT"}],"updateDate":"2024-12-17","timestamp":1734111304000,"abstract":"  The pulsar timing technique, which compares the observed arrival times of\nelectromagnetic radiation from a pulsar with the predicted arrival times\nderived from a theoretical model of the pulsar system, is used in pulsar\nastronomy to infer a multitude of physical information and to constrain\npossible corrections to General Relativity (GR). The propagation delay is\nusually computed using formulas based on a post-Newtonian approach, for both\nthe light trajectory and the orbital motion. However, evidence has recently\nemerged that this approximation may no longer be sufficient when the companion\nobject is a supermassive black hole; deviations from a full GR computation of\nthe propagation delay can reach a few seconds. In this paper, we analyze the\ncase of binary pulsars with a stellar or intermediate black hole companion,\nwhose discovery and timing are key goals of SKA. With a numerical algorithm, we\nhave found that in this case, the full GR value depends only on the semi-major\naxis of the relative orbit and on the mass of the black hole companion. If the\nmass of the latter is sufficiently large ($100 M_{\\odot}$), the maximum\ndifference between the two approaches is significant ($\\sim10^{-7}$ s) even for\nlarge binaries ($\\sim10^{16}$ cm), and increases up to $\\sim 10^{-4}$ s when\nthe mass is $10^5 M_{\\odot}$. We also consider relativistic corrections to the\norbital motion, and discover that they can strongly affect the value of the\npropagation delay. We conclude that in the future, post-Newtonian formulas\nshould be replaced with a more accurate approach in these systems, especially\nin view of future discoveries made by new large telescopes such as SKA.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"fLRw_nCa0GXObuHLVA-ANS7LEzkIgRhlII9OuBpB5Vo","pdfSize":"808634"}