{"id":"2412.16678","title":"A unified model for the origins of spongiform degeneration and other\n  neuropathological features in prion diseases","authors":"Gerold Schmitt-Ulms, Xinzhu Wang, Joel Watts, Stephanie Booth, Holger\n  Wille, Wenda Zhao","authorsParsed":[["Schmitt-Ulms","Gerold",""],["Wang","Xinzhu",""],["Watts","Joel",""],["Booth","Stephanie",""],["Wille","Holger",""],["Zhao","Wenda",""]],"versions":[{"version":"v1","created":"Sat, 21 Dec 2024 16:07:15 GMT"},{"version":"v2","created":"Wed, 15 Jan 2025 21:48:23 GMT"}],"updateDate":"2025-01-17","timestamp":1734797235000,"abstract":"  Decades after their initial observation in prion-infected brain tissues, the\nidentities of virus-like dense particles, varicose tubules, and oval bodies\ncontaining parallel bands and fibrils have remained elusive. Our recent work\nrevealed that a phenotype of dilation of the endoplasmic reticulum (ER), most\nnotable for the perinuclear space (PNS), contributes to spongiform\ndegeneration. To assess the significance of this phenotype for the etiology of\nprion diseases, we explored whether it can be functionally linked to other\nneuropathological hallmarks observed in these diseases, as this would indicate\nit to be a central event. Having surveyed the neuropathological record and\nother distant literature niches, we propose a model in which pathogenic forms\nof the prion protein poison raft domains, including essential Na+, K+-ATPases\n(NKAs) embedded within them, thereby triggering an ER-centered cellular rescue\nprogram coordinated by the unfolded protein response (UPR). The execution of\nthis program stalls general protein synthesis, causing the deterioration of\nsynaptic spines. As the disease progresses, cells selectively increase sterol\nbiosynthesis, along with ribosome and ER biogenesis. These adaptive rescue\nattempts cause morphological changes to the ER which manifest as ER dilation or\nER hypertrophy in a manner that is influenced by Ca2+ influx into the cell. The\nnuclear-to-cytoplasmic transport of mRNAs and tRNAs interrupts in late stage\ndisease, thereby depriving ribosomes of supplies and inducing them to aggregate\ninto a paracrystalline form. In support of this model, we share previously\nreported data, whose features are consistent with the interpretation that 1)\nthe phenotype of ER dilation is observed in major prion diseases, 2) varicose\ntubules and oval bodies represent ER hypertrophy, and 3) virus-like dense\nparticles are paracrystalline aggregates of inactive ribosomes.\n","subjects":["Quantitative Biology/Neurons and Cognition","Quantitative Biology/Molecular Networks"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"O7Qx-LzYQ76U3TayjkqacIspPJxCVJlwjgyION_9M6k","pdfSize":"9886881"}