{
  "id": "2412.19369",
  "title": "The Deconstruction of Flavor in the Privately Democratic Higgs Sector",
  "authors": "Bhubanjyoti Bhattacharya (Lawrence Technological University), Suneth\n  Jayawardana (Wayne State University), Nausheen R. Shah (Wayne State\n  University)",
  "authorsParsed": [
    [
      "Bhattacharya",
      "Bhubanjyoti",
      "",
      "Lawrence Technological University"
    ],
    [
      "Jayawardana",
      "Suneth",
      "",
      "Wayne State University"
    ],
    [
      "Shah",
      "Nausheen R.",
      "",
      "Wayne State\n  University"
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 26 Dec 2024 22:32:31 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735252351000,
  "abstract": "  The Standard Model (SM) of particle physics fails to explain the observed\nhierarchy in fermion masses or the origin of fermion-flavor structure. We\nconstruct a model to explain these observations in the quark sector. We\nintroduce a spectrum of new particles consisting of six of each -- massive\nsinglet vector-like quarks (VLQs), singlet scalars, and SU(2)-doublet scalars.\nSM quark masses are generated when the neutral components of the SU(2)-doublet\nscalars acquire non-zero vacuum expectation values (VEVs). We impose global\nsymmetries to ensure that Yukawa couplings stay roughly flavor diagonal and\ndemocratic (of the same order), as well as to suppress tree-level\nflavor-changing neutral currents. Quark-mass hierarchy then follows from a\nhierarchy in scalar VEVs. The singlet scalars also acquire weak-scale VEVs.\nTogether with the VLQs, they act as messengers between different generations of\nquarks in the SM. These messenger particles are responsible for generating the\nelements of the Cabibbo-Kobayashi-Masakawa (CKM) matrix which depend on the\nratios of the singlet VEVs and VLQ masses. Constructed this way, the CKM matrix\nis found to be \\emph{independent} of the SM fermion masses. Using the measured\nvalues of the CKM matrix elements and assuming order-one couplings, we derive\nconstraints on the masses of the VLQs and discuss prospects for probing our\nmodel in the near future.\n",
  "subjects": [
    "Physics/High Energy Physics - Phenomenology",
    "Physics/High Energy Physics - Experiment"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "4mq4WU3YNnKR0z-VLnyMuFtRRR1dRSWZHhxQV1AFsb4",
  "pdfSize": "536748"
}