{"id":"2412.09262","title":"LatentSync: Audio Conditioned Latent Diffusion Models for Lip Sync","authors":"Chunyu Li, Chao Zhang, Weikai Xu, Jinghui Xie, Weiguo Feng, Bingyue\n  Peng, Weiwei Xing","authorsParsed":[["Li","Chunyu",""],["Zhang","Chao",""],["Xu","Weikai",""],["Xie","Jinghui",""],["Feng","Weiguo",""],["Peng","Bingyue",""],["Xing","Weiwei",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 13:20:52 GMT"}],"updateDate":"2024-12-13","timestamp":1734009652000,"abstract":"  We present LatentSync, an end-to-end lip sync framework based on audio\nconditioned latent diffusion models without any intermediate motion\nrepresentation, diverging from previous diffusion-based lip sync methods based\non pixel space diffusion or two-stage generation. Our framework can leverage\nthe powerful capabilities of Stable Diffusion to directly model complex\naudio-visual correlations. Additionally, we found that the diffusion-based lip\nsync methods exhibit inferior temporal consistency due to the inconsistency in\nthe diffusion process across different frames. We propose Temporal\nREPresentation Alignment (TREPA) to enhance temporal consistency while\npreserving lip-sync accuracy. TREPA uses temporal representations extracted by\nlarge-scale self-supervised video models to align the generated frames with the\nground truth frames. Furthermore, we observe the commonly encountered SyncNet\nconvergence issue and conduct comprehensive empirical studies, identifying key\nfactors affecting SyncNet convergence in terms of model architecture, training\nhyperparameters, and data preprocessing methods. We significantly improve the\naccuracy of SyncNet from 91% to 94% on the HDTF test set. Since we did not\nchange the overall training framework of SyncNet, our experience can also be\napplied to other lip sync and audio-driven portrait animation methods that\nutilize SyncNet. Based on the above innovations, our method outperforms\nstate-of-the-art lip sync methods across various metrics on the HDTF and\nVoxCeleb2 datasets.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"tx6QZMgz6MRm0gjcjse8xxzUlE2ZIdCKWltLmNgZrfQ","pdfSize":"4563663"}