{
  "id": "2412.11957",
  "title": "Multiplexing in Networks and Diffusion",
  "authors": "Arun G. Chandrasekhar, Vasu Chaudhary, Benjamin Golub, and Matthew O.\n  Jackson",
  "authorsParsed": [
    [
      "Chandrasekhar",
      "Arun G.",
      ""
    ],
    [
      "Chaudhary",
      "Vasu",
      ""
    ],
    [
      "Golub",
      "Benjamin",
      ""
    ],
    [
      "Jackson",
      "Matthew O.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 16:41:03 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734367263000,
  "abstract": "  Social and economic networks are often multiplexed, meaning that people are\nconnected by different types of relationships -- such as borrowing goods and\ngiving advice. We make three contributions to the study of multiplexing. First,\nwe document empirical multiplexing patterns in Indian village data:\nrelationships such as socializing, advising, helping, and lending are\ncorrelated but distinct, while commonly used proxies for networks based on\nethnicity and geography are nearly uncorrelated with actual relationships.\nSecond, we examine how these layers and their overlap affect information\ndiffusion in a field experiment. The advice network is the best predictor of\ndiffusion, but combining layers improves predictions further. Villages with\ngreater overlap between layers (more multiplexing) experience less overall\ndiffusion. This leads to our third contribution: developing a model and\ntheoretical results about diffusion in multiplex networks. Multiplexing slows\nthe spread of simple contagions, such as diseases or basic information, but can\neither impede or enhance the spread of complex contagions, such as new\ntechnologies, depending on their virality. Finally, we identify differences in\nmultiplexing by gender and connectedness. These have implications for\ninequality in diffusion-mediated outcomes such as access to information and\nadherence to norms.\n",
  "subjects": [
    "Economics/General Economics",
    "Physics/Physics and Society",
    "Quantitative Finance/Economics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "loc2M0p145VFxYDkQcExmU7lQSOVT6AmUl8gGmYp8pU",
  "pdfSize": "1025808"
}