{
  "id": "2412.10193",
  "title": "Simple Guidance Mechanisms for Discrete Diffusion Models",
  "authors": "Yair Schiff, Subham Sekhar Sahoo, Hao Phung, Guanghan Wang, Sam\n  Boshar, Hugo Dalla-torre, Bernardo P. de Almeida, Alexander Rush, Thomas\n  Pierrot, Volodymyr Kuleshov",
  "authorsParsed": [
    [
      "Schiff",
      "Yair",
      ""
    ],
    [
      "Sahoo",
      "Subham Sekhar",
      ""
    ],
    [
      "Phung",
      "Hao",
      ""
    ],
    [
      "Wang",
      "Guanghan",
      ""
    ],
    [
      "Boshar",
      "Sam",
      ""
    ],
    [
      "Dalla-torre",
      "Hugo",
      ""
    ],
    [
      "de Almeida",
      "Bernardo P.",
      ""
    ],
    [
      "Rush",
      "Alexander",
      ""
    ],
    [
      "Pierrot",
      "Thomas",
      ""
    ],
    [
      "Kuleshov",
      "Volodymyr",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 15:08:30 GMT"
    },
    {
      "version": "v2",
      "created": "Wed, 26 Feb 2025 20:08:59 GMT"
    }
  ],
  "updateDate": "2025-02-28",
  "timestamp": 1734102510000,
  "abstract": "  Diffusion models for continuous data gained widespread adoption owing to\ntheir high quality generation and control mechanisms. However, controllable\ndiffusion on discrete data faces challenges given that continuous guidance\nmethods do not directly apply to discrete diffusion. Here, we provide a\nstraightforward derivation of classifier-free and classifier-based guidance for\ndiscrete diffusion, as well as a new class of diffusion models that leverage\nuniform noise and that are more guidable because they can continuously edit\ntheir outputs. We improve the quality of these models with a novel\ncontinuous-time variational lower bound that yields state-of-the-art\nperformance, especially in settings involving guidance or fast generation.\nEmpirically, we demonstrate that our guidance mechanisms combined with uniform\nnoise diffusion improve controllable generation relative to autoregressive and\ndiffusion baselines on several discrete data domains, including genomic\nsequences, small molecule design, and discretized image generation.\n",
  "subjects": [
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "pljVvUJHuxvgWNXSZAtPmpf94LwYlwMF5K9s1VFSAsA",
  "pdfSize": "4529535"
}