{"id":"2412.17940","title":"Equatorial deformation of homogeneous spherical fluid vesicles by a\n  rigid ring","authors":"Pablo V\\'azquez-Montejo, Bojan Bo\\v{z}i\\v{c} and Jemal Guven","authorsParsed":[["Vázquez-Montejo","Pablo",""],["Božič","Bojan",""],["Guven","Jemal",""]],"versions":[{"version":"v1","created":"Mon, 23 Dec 2024 19:53:31 GMT"}],"updateDate":"2024-12-25","timestamp":1734983611000,"abstract":"  We examine the deformation of homogeneous spherical fluid vesicles along\ntheir equator by a circular rigid ring. We consider deformations preserving the\naxial and equatorial mirror symmetries of the vesicles. The configurations of\nthe vesicle are determined employing the spontaneous curvature model subject to\nthe constraints imposed by the ring as well as of having constant area or\nvolume. We determine two expressions of the force exerted by the ring, one\ninvolving a discontinuity in the derivative of the curvature of the membrane\nacross the ring, and another one in terms of the global quantities of the\nvesicle. For small enough values of the spontaneous curvature there is only one\nsequence of configurations either for fixed area or volume. The behavior of\nconstricted vesicles is similar for both constraints, they follow a transition\nfrom prolate to dumbbell shapes, which culminates in two quasispherical\nvesicles connected by a small catenoid-like neck. We analyze the geometry and\nthe force of the small neck employing a perturbative analysis about the\ncatenoid. A stretched vesicle initially adopts an oblate shape for either\nconstraint. If the area is fixed the vesicle increasingly flattens until it\nattains a disclike shape, which we examine using an asymptotic analysis. If the\nvolume is fixed the poles approach until they touch and the vesicle adopts a\ndiscocyte shape. When the spontaneous curvature of the vesicle is close to the\nmean curvature of the constricted quasi-spherical vesicles, the sequences of\nconfigurations of both constraints develop bifurcations, and some of their\nconfigurations have the lowest energy.\n","subjects":["Condensed Matter/Soft Condensed Matter"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"WeCDwHWHm6IloI9jvqcREKHlINFCJtmoe7HFxy-K0N8","pdfSize":"34558289"}