{
  "id": "2412.16456",
  "title": "Safe Dynamic Motion Generation in Configuration Space Using\n  Differentiable Distance Fields",
  "authors": "Xuemin Chi, Yiming Li, Jihao Huang, Bolun Dai, Zhitao Liu, Sylvain\n  Calinon",
  "authorsParsed": [
    [
      "Chi",
      "Xuemin",
      ""
    ],
    [
      "Li",
      "Yiming",
      ""
    ],
    [
      "Huang",
      "Jihao",
      ""
    ],
    [
      "Dai",
      "Bolun",
      ""
    ],
    [
      "Liu",
      "Zhitao",
      ""
    ],
    [
      "Calinon",
      "Sylvain",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 21 Dec 2024 03:13:28 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734750808000,
  "abstract": "  Generating collision-free motions in dynamic environments is a challenging\nproblem for high-dimensional robotics, particularly under real-time\nconstraints. Control Barrier Functions (CBFs), widely utilized in\nsafety-critical control, have shown significant potential for motion\ngeneration. However, for high-dimensional robot manipulators, existing QP\nformulations and CBF-based methods rely on positional information, overlooking\nhigher-order derivatives such as velocities. This limitation may lead to\nreduced success rates, decreased performance, and inadequate safety\nconstraints. To address this, we construct time-varying CBFs (TVCBFs) that\nconsider velocity conditions for obstacles. Our approach leverages recent\ndevelopments on distance fields for articulated manipulators, a differentiable\nrepresentation that enables the mapping of objects' position and velocity into\nthe robot's joint space, offering a comprehensive understanding of the system's\ninteractions. This allows the manipulator to be treated as a point-mass system\nthus simplifying motion generation tasks. Additionally, we introduce a\ntime-varying control Lyapunov function (TVCLF) to enable whole-body contact\nmotions. Our approach integrates the TVCBF, TVCLF, and manipulator physical\nconstraints within a unified QP framework. We validate our method through\nsimulations and comparisons with state-of-the-art approaches, demonstrating its\neffectiveness on a 7-axis Franka robot in real-world experiments.\n",
  "subjects": [
    "Computer Science/Robotics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "jxLuDFqSu2PvgLnJxP7ntI9gFy4IFh4fRM631hdWVUY",
  "pdfSize": "9823258"
}