{"id":"2412.14296","title":"Theory of intervalley-coherent AFM order and topological\n  superconductivity in tWSe$_2$","authors":"Ammon Fischer, Lennart Klebl, Valentin Cr\\'epel, Siheon Ryee, Angel\n  Rubio, Lede Xian, Tim O. Wehling, Antoine Georges, Dante M. Kennes and Andrew\n  J. Millis","authorsParsed":[["Fischer","Ammon",""],["Klebl","Lennart",""],["Crépel","Valentin",""],["Ryee","Siheon",""],["Rubio","Angel",""],["Xian","Lede",""],["Wehling","Tim O.",""],["Georges","Antoine",""],["Kennes","Dante M.",""],["Millis","Andrew J.",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 19:49:49 GMT"}],"updateDate":"2024-12-20","timestamp":1734551389000,"abstract":"  The recent observation of superconductivity in the vicinity of insulating or\nFermi surface reconstructed metallic states has established twisted bilayers of\nWSe$_2$ as an exciting platform to study the interplay of strong\nelectron-electron interactions, broken symmetries and topology. In this work,\nwe study the emergence of electronic ordering in twisted WSe$_2$ driven by\ngate-screened Coulomb interactions. Our first-principles treatment begins by\nconstructing moir\\'e Wannier orbitals that faithfully capture the bandstructure\nand topology of the system and project the gate-screened Coulomb interaction\nonto them. Using unbiased functional renormalization group calculations, we\nfind an interplay between intervalley-coherent antiferromagnetic order and\nchiral, mixed-parity $d/p$-wave superconductivity for carrier concentrations\nnear the displacement field-tunable van-Hove singularity. Our microscopic\napproach establishes incommensurate intervalley-coherent antiferromagnetic spin\nfluctuations as the dominant electronic mechanism driving the formation of\nsuperconductivity in $\\theta = 5.08^{\\circ}$ twisted WSe$_2$ and demonstrates\nthat nesting properties of the Fermi surface sheets near the higher-order\nvan-Hove point cause an asymmetric density dependence of the spin ordering as\nthe density is varied across the van-Hove line, in good agreement with\nexperimental observations. We show how the region of superconducting and\nmagnetic order evolves within the two-dimensional phase space of displacement\nfield and electronic density as twist angle is varied between $4^{\\circ} \\dots\n5^{\\circ}$.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Superconductivity"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"AXl31HcB863F69oX4txjBK9zBBb0zWGnvq5mL1J1yEg","pdfSize":"27850929"}