{"id":"2412.19139","title":"PlanLLM: Video Procedure Planning with Refinable Large Language Models","authors":"Dejie Yang and Zijing Zhao and Yang Liu","authorsParsed":[["Yang","Dejie",""],["Zhao","Zijing",""],["Liu","Yang",""]],"versions":[{"version":"v1","created":"Thu, 26 Dec 2024 09:51:05 GMT"},{"version":"v2","created":"Tue, 7 Jan 2025 01:50:11 GMT"}],"updateDate":"2025-01-08","timestamp":1735206665000,"abstract":"  Video procedure planning, i.e., planning a sequence of action steps given the\nvideo frames of start and goal states, is an essential ability for embodied AI.\nRecent works utilize Large Language Models (LLMs) to generate enriched action\nstep description texts to guide action step decoding. Although LLMs are\nintroduced, these methods decode the action steps into a closed-set of one-hot\nvectors, limiting the model's capability of generalizing to new steps or tasks.\nAdditionally, fixed action step descriptions based on world-level commonsense\nmay contain noise in specific instances of visual states. In this paper, we\npropose PlanLLM, a cross-modal joint learning framework with LLMs for video\nprocedure planning. We propose an LLM-Enhanced Planning module which fully uses\nthe generalization ability of LLMs to produce free-form planning output and to\nenhance action step decoding. We also propose Mutual Information Maximization\nmodule to connect world-level commonsense of step descriptions and\nsample-specific information of visual states, enabling LLMs to employ the\nreasoning ability to generate step sequences. With the assistance of LLMs, our\nmethod can both closed-set and open vocabulary procedure planning tasks. Our\nPlanLLM achieves superior performance on three benchmarks, demonstrating the\neffectiveness of our designs.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Artificial Intelligence","Computer Science/Machine Learning","Computer Science/Multimedia"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"WkVgIBAOvlerwN3PWb8yas-pS76qyHnUzZtSEgmmcEU","pdfSize":"530800"}