{"id":"2412.03723","title":"Bayesian Perspective for Orientation Estimation in Cryo-EM and Cryo-ET","authors":"Sheng Xu, Amnon Balanov, and Tamir Bendory","authorsParsed":[["Xu","Sheng",""],["Balanov","Amnon",""],["Bendory","Tamir",""]],"versions":[{"version":"v1","created":"Wed, 4 Dec 2024 21:29:13 GMT"}],"updateDate":"2024-12-06","timestamp":1733347753000,"abstract":"  Accurate orientation estimation is a crucial component of 3D molecular\nstructure reconstruction, both in single-particle cryo-electron microscopy\n(cryo-EM) and in the increasingly popular field of cryo-electron tomography\n(cryo-ET). The dominant method, which involves searching for an orientation\nwith maximum cross-correlation relative to given templates, falls short,\nparticularly in low signal-to-noise environments. In this work, we propose a\nBayesian framework to develop a more accurate and flexible orientation\nestimation approach, with the minimum mean square error (MMSE) estimator as a\nkey example. This method effectively accommodates varying structural\nconformations and arbitrary rotational distributions. Through simulations, we\ndemonstrate that our estimator consistently outperforms the\ncross-correlation-based method, especially in challenging conditions with low\nsignal-to-noise ratios, and offer a theoretical framework to support these\nimprovements. We further show that integrating our estimator into the iterative\nrefinement in the 3D reconstruction pipeline markedly enhances overall\naccuracy, revealing substantial benefits across the algorithmic workflow.\nFinally, we show empirically that the proposed Bayesian approach enhances\nrobustness against the ``Einstein from Noise'' phenomenon, reducing model bias\nand improving reconstruction reliability. These findings indicate that the\nproposed Bayesian framework could substantially advance cryo-EM and cryo-ET by\nenhancing the accuracy, robustness, and reliability of 3D molecular structure\nreconstruction, thereby facilitating deeper insights into complex biological\nsystems.\n","subjects":["Statistics/Applications","Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"6oydsHqWJyfFfH4trTZOV9rNrcb65c0h6Tvoq6HCqaI","pdfSize":"1775723"}