{
  "id": "2412.01036",
  "title": "Generating Freeform Endoskeletal Robots",
  "authors": "Muhan Li, Lingji Kong, Sam Kriegman",
  "authorsParsed": [
    [
      "Li",
      "Muhan",
      ""
    ],
    [
      "Kong",
      "Lingji",
      ""
    ],
    [
      "Kriegman",
      "Sam",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 01:40:04 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733103604000,
  "abstract": "  The automatic design of embodied agents (e.g. robots) has existed for 31\nyears and is experiencing a renaissance of interest in the literature. To date\nhowever, the field has remained narrowly focused on two kinds of anatomically\nsimple robots: (1) fully rigid, jointed bodies; and (2) fully soft, jointless\nbodies. Here we bridge these two extremes with the open ended creation of\nterrestrial endoskeletal robots: deformable soft bodies that leverage jointed\ninternal skeletons to move efficiently across land. Simultaneous de novo\ngeneration of external and internal structures is achieved by (i) modeling 3D\nendoskeletal body plans as integrated collections of elastic and rigid cells\nthat directly attach to form soft tissues anchored to compound rigid bodies;\n(ii) encoding these discrete mechanical subsystems into a continuous yet\ncoherent latent embedding; (iii) optimizing the sensorimotor coordination of\neach decoded design using model-free reinforcement learning; and (iv)\nnavigating this smooth yet highly non-convex latent manifold using evolutionary\nstrategies. This yields an endless stream of novel species of \"higher robots\"\nthat, like all higher animals, harness the mechanical advantages of both\nelastic tissues and skeletal levers for terrestrial travel. It also provides a\nplug-and-play experimental platform for benchmarking evolutionary design and\nrepresentation learning algorithms in complex hierarchical embodied systems.\n",
  "subjects": [
    "Computer Science/Robotics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "IsA8OIHxLVonwrggB6awuVUy3IX3AQNN7XjH4ACCY84",
  "pdfSize": "12026161"
}