{
  "id": "2412.15274",
  "title": "Memory-Augmented Agent Training for Business Document Understanding",
  "authors": "Jiale Liu, Yifan Zeng, Malte H{\\o}jmark-Bertelsen, Marie Normann\n  Gadeberg, Huazheng Wang, Qingyun Wu",
  "authorsParsed": [
    [
      "Liu",
      "Jiale",
      ""
    ],
    [
      "Zeng",
      "Yifan",
      ""
    ],
    [
      "Højmark-Bertelsen",
      "Malte",
      ""
    ],
    [
      "Gadeberg",
      "Marie Normann",
      ""
    ],
    [
      "Wang",
      "Huazheng",
      ""
    ],
    [
      "Wu",
      "Qingyun",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 18:35:04 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734460504000,
  "abstract": "  Traditional enterprises face significant challenges in processing business\ndocuments, where tasks like extracting transport references from invoices\nremain largely manual despite their crucial role in logistics operations. While\nLarge Language Models offer potential automation, their direct application to\nspecialized business domains often yields unsatisfactory results. We introduce\nMatrix (Memory-Augmented agent Training through Reasoning and Iterative\neXploration), a novel paradigm that enables LLM agents to progressively build\ndomain expertise through experience-driven memory refinement and iterative\nlearning. To validate this approach, we collaborate with one of the world's\nlargest logistics companies to create a dataset of Universal Business Language\nformat invoice documents, focusing on the task of transport reference\nextraction. Experiments demonstrate that Matrix outperforms prompting a single\nLLM by 30.3%, vanilla LLM agent by 35.2%. We further analyze the metrics of the\noptimized systems and observe that the agent system requires less API calls,\nfewer costs and can analyze longer documents on average. Our methods establish\na new approach to transform general-purpose LLMs into specialized business\ntools through systematic memory enhancement in document processing tasks.\n",
  "subjects": [
    "Computer Science/Computation and Language",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Sx32WNBxLDsA0tDadC6AmCtqif9LGnNzQE1qwf15KIU",
  "pdfSize": "347208"
}