{
  "id": "2412.18910",
  "title": "AdaEAGLE: Optimizing Speculative Decoding via Explicit Modeling of\n  Adaptive Draft Structures",
  "authors": "Situo Zhang, Hankun Wang, Da Ma, Zichen Zhu, Lu Chen, Kunyao Lan, Kai\n  Yu",
  "authorsParsed": [
    [
      "Zhang",
      "Situo",
      ""
    ],
    [
      "Wang",
      "Hankun",
      ""
    ],
    [
      "Ma",
      "Da",
      ""
    ],
    [
      "Zhu",
      "Zichen",
      ""
    ],
    [
      "Chen",
      "Lu",
      ""
    ],
    [
      "Lan",
      "Kunyao",
      ""
    ],
    [
      "Yu",
      "Kai",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 25 Dec 2024 13:57:33 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735135053000,
  "abstract": "  Speculative Decoding (SD) is a popular lossless technique for accelerating\nthe inference of Large Language Models (LLMs). We show that the decoding speed\nof SD frameworks with static draft structures can be significantly improved by\nincorporating context-aware adaptive draft structures. However, current studies\non adaptive draft structures are limited by their performance, modeling\napproaches, and applicability. In this paper, we introduce AdaEAGLE, the first\nSD framework that explicitly models adaptive draft structures. AdaEAGLE\nleverages the Lightweight Draft Length Predictor (LDLP) module to explicitly\npredict the optimal number of draft tokens during inference to guide the draft\nmodel. It achieves comparable speedup results without manual thresholds and\nallows for deeper, more specialized optimizations. Moreover, together with\nthreshold-based strategies, AdaEAGLE achieves a $1.62\\times$ speedup over the\nvanilla AR decoding and outperforms fixed-length SotA baseline while\nmaintaining output quality.\n",
  "subjects": [
    "Computer Science/Artificial Intelligence",
    "Computer Science/Computation and Language"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "ugvj_eV71whd483QspUHNF7selNfngEmHSB-XzEPJqQ",
  "pdfSize": "1281584"
}