{"id":"2412.18333","title":"Spatial orientation and shape of the velocity ellipsoids of the Gaia DR3\n  giants and subgiants in the Galactic plane","authors":"A. M. Dmytrenko, P. N. Fedorov, V. S. Akhmetov, A. B. Velichko, S. I.\n  Denyshchenko, V. P. Khramtsov, I. B. Vavilova, D. V. Dobrycheva, O. M.\n  Sergijenko, A. A. Vasylenko and O.V. Kompaniiets","authorsParsed":[["Dmytrenko","A. M.",""],["Fedorov","P. N.",""],["Akhmetov","V. S.",""],["Velichko","A. B.",""],["Denyshchenko","S. I.",""],["Khramtsov","V. P.",""],["Vavilova","I. B.",""],["Dobrycheva","D. V.",""],["Sergijenko","O. M.",""],["Vasylenko","A. A.",""],["Kompaniiets","O. V.",""]],"versions":[{"version":"v1","created":"Tue, 24 Dec 2024 10:39:04 GMT"}],"updateDate":"2024-12-25","timestamp":1735036744000,"abstract":"  We present the results of determining the parameters characterizing the shape\nand orientation of residual velocity ellipsoids from the Gaia DR3 red giants\nand subgiants. We show the distribution of velocity dispersions in the Galactic\nplane obtained from three components of the spatial velocity, as well as the\ncoordinate distribution of the intersection points of the velocity ellipsoid\naxes with the celestial sphere, in particular the deviations of the longitudes\nand latitudes of the vertices of stellar regions located within spheres with a\nradius of 1 kpc centered in the Galactic mid-plane. The area of the Galactic\ndisk under study is in the range of Galactocentric coordinates 0 < R < 15 kpc\nand $120^\\circ < \\theta < 240^\\circ$. We show that the vertex deviations in\nsome regions of the Galactic mid-plane can reach $30^\\circ$ in longitude, and\n$15^\\circ$ in latitude. This indicates the presence of kinematic distortions of\nthe stellar velocity field, especially noticeable in the angular range of\n$150^\\circ < \\theta < 210^\\circ$ at a distance of approximately 13 kpc. We\npropose the angles of deviation of longitudes and latitudes of the ellipsoid\naxes of residual stellar velocities to be considered as kinematic signatures of\nvarious Galactic deformations determined from real fields of spatial\nvelocities. We present the distribution of parameters characterizing the shapes\nof velocity ellipsoids, as well as their distribution of the semi-axes length\nratios. We note a local feature in this distribution and in the distribution of\nthe elongation measurements of the ellipsoids. We perform a comparison of the\nresults obtained from the tensor of deformation velocities and from the\nobserved spatial velocities.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Jm_8tkU4ZDcGkYggM3aFc2YKHgHcto5Dv4b7j3OjDfo","pdfSize":"11543196"}