{"id":"2412.01954","title":"Geometry-aware PINNs for Turbulent Flow Prediction","authors":"Shinjan Ghosh, Julian Busch, Georgia Olympia Brikis, Biswadip Dey","authorsParsed":[["Ghosh","Shinjan",""],["Busch","Julian",""],["Brikis","Georgia Olympia",""],["Dey","Biswadip",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 20:30:53 GMT"}],"updateDate":"2024-12-04","timestamp":1733171453000,"abstract":"  Design exploration or optimization using computational fluid dynamics (CFD)\nis commonly used in the industry. Geometric variation is a key component of\nsuch design problems, especially in turbulent flow scenarios, which involves\nrunning costly simulations at every design iteration. While parametric\nRANS-PINN type approaches have been proven to make effective turbulent\nsurrogates, as a means of predicting unknown Reynolds number flows for a given\ngeometry at near real-time, geometry aware physics informed surrogates with the\nability to predict varying geometries are a relatively less studied topic. A\nnovel geometry aware parametric PINN surrogate model has been created, which\ncan predict flow fields for NACA 4 digit airfoils in turbulent conditions, for\nunseen shapes as well as inlet flow conditions. A local+global approach for\nembedding has been proposed, where known global design parameters for an\nairfoil as well as local SDF values can be used as inputs to the model along\nwith velocity inlet/Reynolds number ($\\mathcal{R}_e$) to predict the flow\nfields. A RANS formulation of the Navier-Stokes equations with a 2-equation\nk-epsilon turbulence model has been used for the PDE losses, in addition to\nlimited CFD data from 8 different NACA airfoils for training. The models have\nthen been validated with unknown NACA airfoils at unseen Reynolds numbers.\n","subjects":["Computer Science/Machine Learning","Computer Science/Numerical Analysis","Mathematics/Numerical Analysis","Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"nBgoGBCvwlgjuAXZJmWgkM0zDC8Ffdjt0aVbM2DT4Y4","pdfSize":"787819"}