{"id":"2412.12724","title":"Compressed Sensing Based Residual Recovery Algorithms and Hardware for\n  Modulo Sampling","authors":"Shaik Basheeruddin Shah, Satish Mulleti, Yonina C. Eldar","authorsParsed":[["Shah","Shaik Basheeruddin",""],["Mulleti","Satish",""],["Eldar","Yonina C.",""]],"versions":[{"version":"v1","created":"Tue, 17 Dec 2024 09:44:01 GMT"}],"updateDate":"2024-12-18","timestamp":1734428641000,"abstract":"  Analog-to-Digital Converters (ADCs) are essential components in modern data\nacquisition systems. A key design challenge is accommodating high dynamic range\n(DR) input signals without clipping. Existing solutions, such as oversampling,\nautomatic gain control (AGC), and compander-based methods, have limitations in\nhandling high-DR signals. Recently, the Unlimited Sampling Framework (USF) has\nemerged as a promising alternative. It uses a non-linear modulo operator to map\nhigh-DR signals within the ADC range. Existing recovery algorithms, such as\nhigher-order differences (HODs), prediction-based methods, and beyond bandwidth\nresidual recovery (B2R2), have shown potential but are either noise-sensitive,\nrequire high sampling rates, or are computationally intensive. To address these\nchallenges, we propose LASSO-B2R2, a fast and robust recovery algorithm.\nSpecifically, we demonstrate that the first-order difference of the residual\n(the difference between the folded and original samples) is sparse, and we\nderive an upper bound on its sparsity. This insight allows us to formulate the\nrecovery as a sparse signal reconstruction problem using the least absolute\nshrinkage and selection operator (LASSO). Numerical simulations show that\nLASSO-B2R2 outperforms prior methods in terms of speed and robustness, though\nit requires a higher sampling rate at lower DR. To overcome this, we introduce\nthe bits distribution mechanism, which allocates 1 bit from the total bit\nbudget to identify modulo folding events. This reduces the recovery problem to\na simple pseudo-inverse computation, significantly enhancing computational\nefficiency. Finally, we validate our approach through numerical simulations and\na hardware prototype that captures 1-bit folding information, demonstrating its\npractical feasibility.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"zoOPCmVdqak5LkRROgkcHE2YSpqCwlZ-ij9pzA5GlUY","pdfSize":"3272966"}