{"id":"2412.14510","title":"PA-RAG: RAG Alignment via Multi-Perspective Preference Optimization","authors":"Jiayi Wu, Hengyi Cai, Lingyong Yan, Hao Sun, Xiang Li, Shuaiqiang\n  Wang, Dawei Yin, Ming Gao","authorsParsed":[["Wu","Jiayi",""],["Cai","Hengyi",""],["Yan","Lingyong",""],["Sun","Hao",""],["Li","Xiang",""],["Wang","Shuaiqiang",""],["Yin","Dawei",""],["Gao","Ming",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 04:18:51 GMT"}],"updateDate":"2024-12-20","timestamp":1734581931000,"abstract":"  The emergence of Retrieval-augmented generation (RAG) has alleviated the\nissues of outdated and hallucinatory content in the generation of large\nlanguage models (LLMs), yet it still reveals numerous limitations. When a\ngeneral-purpose LLM serves as the RAG generator, it often suffers from\ninadequate response informativeness, response robustness, and citation quality.\nPast approaches to tackle these limitations, either by incorporating additional\nsteps beyond generating responses or optimizing the generator through\nsupervised fine-tuning (SFT), still failed to align with the RAG requirement\nthoroughly. Consequently, optimizing the RAG generator from multiple preference\nperspectives while maintaining its end-to-end LLM form remains a challenge. To\nbridge this gap, we propose Multiple Perspective Preference Alignment for\nRetrieval-Augmented Generation (PA-RAG), a method for optimizing the generator\nof RAG systems to align with RAG requirements comprehensively. Specifically, we\nconstruct high-quality instruction fine-tuning data and multi-perspective\npreference data by sampling varied quality responses from the generator across\ndifferent prompt documents quality scenarios. Subsequently, we optimize the\ngenerator using SFT and Direct Preference Optimization (DPO). Extensive\nexperiments conducted on four question-answer datasets across three LLMs\ndemonstrate that PA-RAG can significantly enhance the performance of RAG\ngenerators. Our code and datasets are available at\nhttps://github.com/wujwyi/PA-RAG.\n","subjects":["Computer Science/Computation and Language","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"3J8ujhSERxDLVj1OK2AT3Y5bh7b5Oy-kz09QqFZo7-4","pdfSize":"488737"}