{"id":"2412.04938","title":"Solving 1D Poisson problem with a Variational Quantum Linear Solver","authors":"Giorgio Tosti Balducci, Boyang Chen, Matthias M\\\"oller, Roeland De\n  Breuker","authorsParsed":[["Balducci","Giorgio Tosti",""],["Chen","Boyang",""],["Möller","Matthias",""],["De Breuker","Roeland",""]],"versions":[{"version":"v1","created":"Fri, 6 Dec 2024 10:49:59 GMT"}],"updateDate":"2024-12-09","timestamp":1733482199000,"abstract":"  Different hybrid quantum-classical algorithms have recently been developed as\na near-term way to solve linear systems of equations on quantum devices.\nHowever, the focus has so far been mostly on the methods, rather than the\nproblems that they need to tackle. In fact, these algorithms have been run on\nreal hardware only for problems in quantum physics, such as Hamiltonians of a\nfew qubits systems. These problems are particularly favorable for quantum\nhardware, since their matrices are the sum of just a few unitary terms and\nsince only shallow quantum circuits are required to estimate the cost function.\nHowever, for many interesting problems in linear algebra, it appears far less\ntrivial to find an efficient decomposition and to trade it off with the depth\nof the cost quantum circuits. A first simple yet interesting instance to\nconsider are tridiagonal systems of equations. These arise, for instance, in\nthe discretization of one-dimensional finite element analyses.\n  This work presents a method to solve a class of tridiagonal systems of\nequations with the variational quantum linear solver (VQLS), a recently\nproposed variational hybrid algorithm for solving linear systems. In\nparticular, we present a new decomposition for this class of matrices based on\nboth Pauli strings and multi--qubit gates, resulting in less terms than those\nobtained by just using Pauli gates. Based on this decomposition, we discuss the\ntradeoff between the number of terms and the near-term implementability of the\nquantum circuits. Furthermore, we present the first simulated and real-hardware\nresults obtained by solving tridiagonal linear systems with VQLS, using the\ndecomposition proposed.\n","subjects":["Computer Science/Computational Engineering, Finance, and Science","Computer Science/Numerical Analysis","Mathematics/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Ik75pSxV4AKKW0xl8BIo98p6JpSqjI5MT5-IYGv5-Fw","pdfSize":"357937"}