{"id":"2412.02896","title":"GUESS: Generative Uncertainty Ensemble for Self Supervision","authors":"Salman Mohamadi, Gianfranco Doretto, Donald A. Adjeroh","authorsParsed":[["Mohamadi","Salman",""],["Doretto","Gianfranco",""],["Adjeroh","Donald A.",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 22:59:23 GMT"}],"updateDate":"2024-12-05","timestamp":1733266763000,"abstract":"  Self-supervised learning (SSL) frameworks consist of pretext task, and loss\nfunction aiming to learn useful general features from unlabeled data. The basic\nidea of most SSL baselines revolves around enforcing the invariance to a\nvariety of data augmentations via the loss function. However, one main issue is\nthat, inattentive or deterministic enforcement of the invariance to any kind of\ndata augmentation is generally not only inefficient, but also potentially\ndetrimental to performance on the downstream tasks. In this work, we\ninvestigate the issue from the viewpoint of uncertainty in invariance\nrepresentation. Uncertainty representation is fairly under-explored in the\ndesign of SSL architectures as well as loss functions. We incorporate\nuncertainty representation in both loss function as well as architecture design\naiming for more data-dependent invariance enforcement. The former is\nrepresented in the form of data-derived uncertainty in SSL loss function\nresulting in a generative-discriminative loss function. The latter is achieved\nby feeding slightly different distorted versions of samples to the ensemble\naiming for learning better and more robust representation. Specifically,\nbuilding upon the recent methods that use hard and soft whitening (a.k.a\nredundancy reduction), we introduce a new approach GUESS, a pseudo-whitening\nframework, composed of controlled uncertainty injection, a new architecture,\nand a new loss function. We include detailed results and ablation analysis\nestablishing GUESS as a new baseline.\n","subjects":["Computer Science/Machine Learning","Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"W-GeQQVwATiCBvJFN7UltoJcd5FHSmUmtzpSh1le9aU","pdfSize":"573447"}