{
  "id": "2412.19160",
  "title": "Dual Channel Multi-Attention in ViT for Biometric Authentication using\n  Forehead Subcutaneous Vein Pattern and Periocular Pattern",
  "authors": "Arun K. Sharma, Shubhobrata Bhattacharya, and Motahar Reza",
  "authorsParsed": [
    [
      "Sharma",
      "Arun K.",
      ""
    ],
    [
      "Bhattacharya",
      "Shubhobrata",
      ""
    ],
    [
      "Reza",
      "Motahar",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 26 Dec 2024 10:40:15 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735209615000,
  "abstract": "  Traditional biometric systems, like face and fingerprint recognition, have\nencountered significant setbacks due to wearing face masks and hygiene\nconcerns. To meet the challenges of the partially covered face due to face\nmasks and hygiene concerns of fingerprint recognition, this paper proposes a\nnovel dual-channel multi-attention Vision Transformer (ViT) framework for\nbiometric authentication using forehead subcutaneous vein patterns and\nperiocular patterns, offering a promising alternative to traditional methods,\ncapable of performing well even with face masks and without any physical touch.\nThe proposed framework leverages a dual-channel ViT architecture, designed to\nhandle two distinct biometric traits. It can capture long-range dependencies of\nindependent features from the vein and periocular patterns. A custom classifier\nis then designed to integrate the independently extracted features, producing a\nfinal class prediction. The performance of the proposed algorithm was\nrigorously evaluated using the Forehead Subcutaneous Vein Pattern and\nPeriocular Biometric Pattern (FSVP-PBP) database. The results demonstrated the\nsuperiority of the algorithm over state-of-the-art methods, achieving\nremarkable classification accuracy of $99.3 \\pm 0.02\\%$ with the combined vein\nand periocular patterns.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "hgcBQu4td4-sOoVc-c6_0Cm2fezyFsD-5t00TkwjcUU",
  "pdfSize": "2186616"
}