{
  "id": "2412.01680",
  "title": "NGC 628 in SIGNALS: Explaining the Abundance-Ionization Correlation in\n  HII Regions",
  "authors": "Ray Garner III, Robert Kennicutt Jr, Laurie Rousseau-Nepton, Grace M.\n  Olivier, David Fern\\'andez-Arenas, Carmelle Robert, Ren\\'e Pierre Martin, and\n  Philippe Amram",
  "authorsParsed": [
    [
      "Garner",
      "Ray",
      "III"
    ],
    [
      "Kennicutt",
      "Robert",
      "Jr"
    ],
    [
      "Rousseau-Nepton",
      "Laurie",
      ""
    ],
    [
      "Olivier",
      "Grace M.",
      ""
    ],
    [
      "Fernández-Arenas",
      "David",
      ""
    ],
    [
      "Robert",
      "Carmelle",
      ""
    ],
    [
      "Martin",
      "René Pierre",
      ""
    ],
    [
      "Amram",
      "Philippe",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 16:27:20 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733156840000,
  "abstract": "  The variations of oxygen abundance and ionization parameter in HII regions\nare usually thought to be the dominant factors that produced variations seen in\nobserved emission line spectra. However, if and how these two quantities are\nphysically related is hotly debated in the literature. Using emission line data\nof NGC 628 observed with SITELLE as part of the Star-formation, Ionized Gas,\nand Nebular Abundances Legacy Survey (SIGNALS), we use a suite of\nphotoionization models to constrain the abundance and ionization parameters for\nover 1500 HII regions throughout its disk. We measure an anti-correlation\nbetween these two properties, consistent with expectations, although with\nconsiderable scatter. Secondary trends with dust extinction and star formation\nrate surface density potentially explain the large scatter observed. We raise\nconcerns throughout regarding various modeling assumptions and their impact on\nthe observed correlations presented in the literature.\n",
  "subjects": [
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "bk09fv0UJXOpxKNtV5fJWHIapWqEjWbyHfICrfTdJWo",
  "pdfSize": "8822416"
}