{"id":"2412.11917","title":"Does VLM Classification Benefit from LLM Description Semantics?","authors":"Pingchuan Ma, Lennart Rietdorf, Dmytro Kotovenko, Vincent Tao Hu,\n  Bj\\\"orn Ommer","authorsParsed":[["Ma","Pingchuan",""],["Rietdorf","Lennart",""],["Kotovenko","Dmytro",""],["Hu","Vincent Tao",""],["Ommer","Björn",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 16:01:18 GMT"},{"version":"v2","created":"Wed, 18 Dec 2024 01:15:42 GMT"},{"version":"v3","created":"Thu, 19 Dec 2024 17:57:59 GMT"}],"updateDate":"2024-12-20","timestamp":1734364878000,"abstract":"  Accurately describing images with text is a foundation of explainable AI.\nVision-Language Models (VLMs) like CLIP have recently addressed this by\naligning images and texts in a shared embedding space, expressing semantic\nsimilarities between vision and language embeddings. VLM classification can be\nimproved with descriptions generated by Large Language Models (LLMs). However,\nit is difficult to determine the contribution of actual description semantics,\nas the performance gain may also stem from a semantic-agnostic ensembling\neffect, where multiple modified text prompts act as a noisy test-time\naugmentation for the original one. We propose an alternative evaluation\nscenario to decide if a performance boost of LLM-generated descriptions is\ncaused by such a noise augmentation effect or rather by genuine description\nsemantics. The proposed scenario avoids noisy test-time augmentation and\nensures that genuine, distinctive descriptions cause the performance boost.\nFurthermore, we propose a training-free method for selecting discriminative\ndescriptions that work independently of classname-ensembling effects. Our\napproach identifies descriptions that effectively differentiate classes within\na local CLIP label neighborhood, improving classification accuracy across seven\ndatasets. Additionally, we provide insights into the explainability of\ndescription-based image classification with VLMs.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8uztJVveKfwJCLxcc3w1jt3larm3Ot7vjukR892noOE","pdfSize":"2578808"}