{
  "id": "2412.11317",
  "title": "RoLargeSum: A Large Dialect-Aware Romanian News Dataset for Summary,\n  Headline, and Keyword Generation",
  "authors": "Andrei-Marius Avram, Mircea Timpuriu, Andreea Iuga, Vlad-Cristian\n  Matei, Iulian-Marius T\\u{a}iatu, Tudor G\\u{a}in\\u{a}, Dumitru-Clementin\n  Cercel, Florin Pop and Mihaela-Claudia Cercel",
  "authorsParsed": [
    [
      "Avram",
      "Andrei-Marius",
      ""
    ],
    [
      "Timpuriu",
      "Mircea",
      ""
    ],
    [
      "Iuga",
      "Andreea",
      ""
    ],
    [
      "Matei",
      "Vlad-Cristian",
      ""
    ],
    [
      "Tăiatu",
      "Iulian-Marius",
      ""
    ],
    [
      "Găină",
      "Tudor",
      ""
    ],
    [
      "Cercel",
      "Dumitru-Clementin",
      ""
    ],
    [
      "Pop",
      "Florin",
      ""
    ],
    [
      "Cercel",
      "Mihaela-Claudia",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 15 Dec 2024 21:27:33 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734298053000,
  "abstract": "  Using supervised automatic summarisation methods requires sufficient corpora\nthat include pairs of documents and their summaries. Similarly to many tasks in\nnatural language processing, most of the datasets available for summarization\nare in English, posing challenges for developing summarization models in other\nlanguages. Thus, in this work, we introduce RoLargeSum, a novel large-scale\nsummarization dataset for the Romanian language crawled from various publicly\navailable news websites from Romania and the Republic of Moldova that were\nthoroughly cleaned to ensure a high-quality standard. RoLargeSum contains more\nthan 615K news articles, together with their summaries, as well as their\nheadlines, keywords, dialect, and other metadata that we found on the targeted\nwebsites. We further evaluated the performance of several BART variants and\nopen-source large language models on RoLargeSum for benchmarking purposes. We\nmanually evaluated the results of the best-performing system to gain insight\ninto the potential pitfalls of this data set and future development.\n",
  "subjects": [
    "Computer Science/Computation and Language"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "k06TUfMUw81DR0ESTdi-Q42lb4bxg4kGqiCIRzy1u3I",
  "pdfSize": "532570"
}