{"id":"2412.18985","title":"TravelAgent: Generative Agents in the Built Environment","authors":"Ariel Noyman, Kai Hu, Kent Larson","authorsParsed":[["Noyman","Ariel",""],["Hu","Kai",""],["Larson","Kent",""]],"versions":[{"version":"v1","created":"Wed, 25 Dec 2024 21:27:51 GMT"}],"updateDate":"2024-12-30","timestamp":1735162071000,"abstract":"  Understanding human behavior in built environments is critical for designing\nfunctional, user centered urban spaces. Traditional approaches, such as manual\nobservations, surveys, and simplified simulations, often fail to capture the\ncomplexity and dynamics of real world behavior. To address these limitations,\nwe introduce TravelAgent, a novel simulation platform that models pedestrian\nnavigation and activity patterns across diverse indoor and outdoor environments\nunder varying contextual and environmental conditions. TravelAgent leverages\ngenerative agents integrated into 3D virtual environments, enabling agents to\nprocess multimodal sensory inputs and exhibit human-like decision-making,\nbehavior, and adaptation. Through experiments, including navigation,\nwayfinding, and free exploration, we analyze data from 100 simulations\ncomprising 1898 agent steps across diverse spatial layouts and agent\narchetypes, achieving an overall task completion rate of 76%. Using spatial,\nlinguistic, and sentiment analyses, we show how agents perceive, adapt to, or\nstruggle with their surroundings and assigned tasks. Our findings highlight the\npotential of TravelAgent as a tool for urban design, spatial cognition\nresearch, and agent-based modeling. We discuss key challenges and opportunities\nin deploying generative agents for the evaluation and refinement of spatial\ndesigns, proposing TravelAgent as a new paradigm for simulating and\nunderstanding human experiences in built environments.\n","subjects":["Computer Science/Artificial Intelligence","Computer Science/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"osr0CWiFt3hiGplo640Yx7E5M9q3W8JkjrwqC8SHH0M","pdfSize":"20890381"}