{"id":"2412.02714","title":"Nuevo modelo para el dimensionamiento de lotes de pedidos en funci\\'on\n  del volumen de compra y deterioro temporal de los art\\'iculos","authors":"Margarita Miguelina Mieras, Tania Daiana Tobares, Ricardo Ra\\'ul\n  Palma, Antonio Jos\\'e Ramirez-Pastor and Fabricio Orlando Sanchez Varretti","authorsParsed":[["Mieras","Margarita Miguelina",""],["Tobares","Tania Daiana",""],["Palma","Ricardo Raúl",""],["Ramirez-Pastor","Antonio José",""],["Varretti","Fabricio Orlando Sanchez",""]],"versions":[{"version":"v1","created":"Thu, 28 Nov 2024 13:34:10 GMT"}],"updateDate":"2024-12-05","timestamp":1732800850000,"abstract":"  This research presents the development of a new simulation model to determine\nthe optimal order lot sizes in Material Requirements Planning, based on\npurchase volume and the temporal deterioration of items. The scientific novelty\nlies in the exhaustive enumeration of all supply strategies, considering when\nand how much raw material and/or inputs to acquire while simultaneously\nmanaging multiple factors. The developed model enables obtaining and\nvisualizing all feasible solutions, though a significant challenge arises when\ndealing with larger planning horizons. The methodology includes formulating a\nmathematical equation to calculate the total cost of all supply strategies,\ntaking into account quantity discounts and the maximum allowable shelf life of\ninventory items. The results demonstrate that the model thoroughly explores the\nentire search space and identifies the optimal solution. Validation is\nconducted using the tabu search heuristic, a widely recognized optimization\ntechnique. While the heuristic converges toward the global minimum, it requires\na significantly higher computational load. In contrast, the developed model\nidentifies the global minimum with fewer calculations, showcasing its\nefficiency and accuracy.\n","subjects":["Mathematics/Optimization and Control","Computer Science/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"hsVCEwxYRk7j_cRRsLA7KBveS3m5ygDXMaBFBpiZopg","pdfSize":"2170823"}