{"id":"2412.03460","title":"CUBES, the Cassegrain U-Band Efficient Spectrograph: towards final\n  design review","authors":"Matteo Genoni, Hans Dekker, Stefano Covino, Roberto Cirami, Marcello\n  Agostino Scalera, Lawrence Bissel, Walter Seifert, Ariadna Calcines, Gerardo\n  Avila, Julian Stuermer, Christopher Ritz, David Lunney, Chris Miller, Stephen\n  Watson, Chris Waring, Bruno Vaz Castilho, Marcio De Arruda, Orlando Verducci,\n  Igor Coretti, Luca Oggioni, Giorgio Pariani, Edoardo Alberto Maria Redaelli,\n  Matteo D'Ambrogio, Giorgio Calderone, Matteo Porru, Ingo Stilz, Rodolfo\n  Smiljanic, Guido Cupani, Mariagrazia Franchini, Andrea Scaudo, Vincent Geers,\n  Vincenzo De Caprio, Domenico D' Auria, Mina Sibalic, Cyrielle Opitom,\n  Gabriele Cescutti, Valentina D' Odorico, Ruben Sanchez Janssen, Andreas\n  Quirrenbach, Beatriz Barbuy, Stefano Cristiani, Paolo Di Marcantonio","authorsParsed":[["Genoni","Matteo",""],["Dekker","Hans",""],["Covino","Stefano",""],["Cirami","Roberto",""],["Scalera","Marcello Agostino",""],["Bissel","Lawrence",""],["Seifert","Walter",""],["Calcines","Ariadna",""],["Avila","Gerardo",""],["Stuermer","Julian",""],["Ritz","Christopher",""],["Lunney","David",""],["Miller","Chris",""],["Watson","Stephen",""],["Waring","Chris",""],["Castilho","Bruno Vaz",""],["De Arruda","Marcio",""],["Verducci","Orlando",""],["Coretti","Igor",""],["Oggioni","Luca",""],["Pariani","Giorgio",""],["Redaelli","Edoardo Alberto Maria",""],["D'Ambrogio","Matteo",""],["Calderone","Giorgio",""],["Porru","Matteo",""],["Stilz","Ingo",""],["Smiljanic","Rodolfo",""],["Cupani","Guido",""],["Franchini","Mariagrazia",""],["Scaudo","Andrea",""],["Geers","Vincent",""],["De Caprio","Vincenzo",""],["Auria","Domenico D'",""],["Sibalic","Mina",""],["Opitom","Cyrielle",""],["Cescutti","Gabriele",""],["Odorico","Valentina D'",""],["Janssen","Ruben Sanchez",""],["Quirrenbach","Andreas",""],["Barbuy","Beatriz",""],["Cristiani","Stefano",""],["Di Marcantonio","Paolo",""]],"versions":[{"version":"v1","created":"Wed, 4 Dec 2024 16:49:09 GMT"}],"updateDate":"2024-12-05","timestamp":1733330949000,"abstract":"  In the era of Extremely Large Telescopes, the current generation of 8-10m\nfacilities are likely to remain competitive at ground-UV wavelengths for the\nforeseeable future. The Cassegrain U-Band Efficient Spectrograph (CUBES) has\nbeen designed to provide high instrumental efficiency ( $>$ 37\\%) observations\nin the near UV (305-400 nm requirement, 300-420 nm goal) at a spectral\nresolving power of R $>$ 20, 000 (with a lower-resolution, sky-limited mode of\nR $\\sim$ 7, 000). With the design focusing on maximizing the instrument\nthroughput (ensuring a Signal to Noise Ratio -SNR- $\\sim$ 20 per spectral\nresolution element at 313 nm for U $\\sim$ 17.5 mag objects in 1h of\nobservations), it will offer new possibilities in many fields of astrophysics:\ni) access to key lines of stellar spectra (e.g. lighter elements, in particular\nBeryllium), extragalactic studies (e.g. circumgalactic medium of distant\ngalaxies, cosmic UV background) and follow-up of explosive transients. We\npresent the CUBES instrument design, currently in Phase-C and approaching the\nfinal design review, summarizing the hardware architecture and interfaces\nbetween the different subsystems as well as the relevant technical\nrequirements. We describe the optical, mechanical, electrical design of the\ndifferent subsystems (from the telescope adapter and support structure, through\nthe main opto-mechanical path, including calibration unit, detector devices and\ncryostat control, main control electronics), detailing peculiar instrument\nfunctions like the Active Flexure Compensation (AFC). Furthermore, we outline\nthe AITV concept and the main instrument operations giving an overview of its\nsoftware ecosystem. Installation at the VLT is planned for 2028-2029 and first\nscience operations in late 2029.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"PhLDDNFGmAkAJ6uvOwQI51lFYGc_8dau6LeEKQ3YEqU","pdfSize":"2197039"}