{
  "id": "2412.18300",
  "title": "GenPod: Constructive News Framing in AI-Generated Podcasts More\n  Effectively Reduces Negative Emotions Than Non-Constructive Framing",
  "authors": "Wen Ku, Yihan Liu, Wei Zhang, Pengcheng An",
  "authorsParsed": [
    [
      "Ku",
      "Wen",
      ""
    ],
    [
      "Liu",
      "Yihan",
      ""
    ],
    [
      "Zhang",
      "Wei",
      ""
    ],
    [
      "An",
      "Pengcheng",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 24 Dec 2024 09:08:45 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1735031325000,
  "abstract": "  AI-generated media products are increasingly prevalent in the news industry,\nyet their impacts on audience perception remain underexplored. Traditional\nmedia often employs negative framing to capture attention and capitalize on\nnews consumption, and without oversight, AI-generated news could reinforce this\ntrend. This study examines how different framing styles-constructive versus\nnon-constructive-affect audience responses in AI-generated podcasts. We\ndeveloped a pipeline using generative AI and text-to-speech (TTS) technology to\ncreate both constructive and non-constructive news podcasts from the same set\nof news resources. Through empirical research (N=65), we found that\nconstructive podcasts significantly reduced audience's negative emotions\ncompared to non-constructive podcasts. Additionally, in certain news contexts,\nconstructive framing might further enhance audience self-efficacy. Our findings\nshow that simply altering the framing of AI generated content can significantly\nimpact audience responses, and we offer insights on leveraging these effects\nfor positive outcomes while minimizing ethical risks.\n",
  "subjects": [
    "Computer Science/Human-Computer Interaction"
  ],
  "license": "http://creativecommons.org/publicdomain/zero/1.0/",
  "blobId": "34ooj1z71_VaIGXTqJUucvnXo1uQ7EVDYdB_4ponMoY",
  "pdfSize": "4195981"
}