{
  "id": "2412.19568",
  "title": "Signatures of the quantum skyrmion Hall effect in the\n  Bernevig-Hughes-Zhang model",
  "authors": "Reyhan Ay, Adipta Pal and Ashley M. Cook",
  "authorsParsed": [
    [
      "Ay",
      "Reyhan",
      ""
    ],
    [
      "Pal",
      "Adipta",
      ""
    ],
    [
      "Cook",
      "Ashley M.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 27 Dec 2024 10:11:23 GMT"
    },
    {
      "version": "v2",
      "created": "Mon, 30 Dec 2024 16:28:36 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735294283000,
  "abstract": "  Given recent discovery of the quantum skyrmion Hall effect, we re-examine the\nrelated canonical Bernevig-Hughes-Zhang (BHZ) model for the quantum spin Hall\ninsulator. Within the framework of the quantum skyrmion Hall effect, isospin\ndegree(s) of freedom of the BHZ model encode additional spatial dimensions.\nConsistent with this framework, we observe phenomena similar to those of the\nfour dimensional Chern insulator, revealed by weakly breaking time-reversal\nsymmetry. Bulk-boundary correspondence of these states includes real-space\nboundary orbital angular momentum textures and gapless boundary modes that are\nrobust against magnetic disorder, consistent with compactified three\ndimensional boundary Weyl nodes (WN$_F$s) of the quantum skyrmion Hall effect.\nThese theoretical findings are furthermore consistent with past experimental\nwork reporting unexpected edge conduction in HgTe quantum wells under applied\nZeeman and orbital magnetic fields. This past work is therefore potentially the\nfirst known experimental observation of signatures of the quantum skyrmion Hall\neffect beyond the quantum Hall effect.\n",
  "subjects": [
    "Condensed Matter/Mesoscale and Nanoscale Physics",
    "Condensed Matter/Strongly Correlated Electrons",
    "Physics/High Energy Physics - Theory",
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "zgPmac6Y-Q9UHxmVXKpBi8Bgh1Q-HVmCgoNmjxHSBqA",
  "pdfSize": "4038213"
}