{"id":"2412.07924","title":"A large language model-based approach to quantifying the effects of\n  social determinants in liver transplant decisions","authors":"Emily Robitschek, Asal Bastani, Kathryn Horwath, Savyon Sordean, Mark\n  J. Pletcher, Jennifer C. Lai, Sergio Galletta, Elliott Ash, Jin Ge, Irene Y.\n  Chen","authorsParsed":[["Robitschek","Emily",""],["Bastani","Asal",""],["Horwath","Kathryn",""],["Sordean","Savyon",""],["Pletcher","Mark J.",""],["Lai","Jennifer C.",""],["Galletta","Sergio",""],["Ash","Elliott",""],["Ge","Jin",""],["Chen","Irene Y.",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 21:12:33 GMT"},{"version":"v2","created":"Fri, 10 Jan 2025 03:28:43 GMT"}],"updateDate":"2025-01-13","timestamp":1733865153000,"abstract":"  Patient life circumstances, including social determinants of health (SDOH),\nshape both health outcomes and care access, contributing to persistent\ndisparities across gender, race, and socioeconomic status. Liver\ntransplantation exemplifies these challenges, requiring complex eligibility and\nallocation decisions where SDOH directly influence patient evaluation. We\ndeveloped an artificial intelligence (AI)-driven framework to analyze how\nbroadly defined SDOH -- encompassing both traditional social determinants and\ntransplantation-related psychosocial factors -- influence patient care\ntrajectories. Using large language models, we extracted 23 SDOH factors related\nto patient eligibility for liver transplantation from psychosocial evaluation\nnotes. These SDOH ``snapshots'' significantly improve prediction of patient\nprogression through transplantation evaluation stages and help explain liver\ntransplantation decisions including the recommendation based on psychosocial\nevaluation and the listing of a patient for a liver transplantation. Our\nanalysis helps identify patterns of SDOH prevalence across demographics that\nhelp explain racial disparities in liver transplantation decisions. We\nhighlight specific unmet patient needs, which, if addressed, could improve the\nequity and efficacy of transplant care. While developed for liver\ntransplantation, this systematic approach to analyzing previously unstructured\ninformation about patient circumstances and clinical decision-making could\ninform understanding of care decisions and disparities across various medical\ndomains.\n","subjects":["Computer Science/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"O8jVodUO5VYDpaBS9lIl9cDsKQ04w6rvf_AXs1bspew","pdfSize":"15244169"}