{
  "id": "2412.11757",
  "title": "SCITAT: A Question Answering Benchmark for Scientific Tables and Text\n  Covering Diverse Reasoning Types",
  "authors": "Xuanliang Zhang, Dingzirui Wang, Baoxin Wang, Longxu Dou, Xinyuan Lu,\n  Keyan Xu, Dayong Wu, Qingfu Zhu, Wanxiang Che",
  "authorsParsed": [
    [
      "Zhang",
      "Xuanliang",
      ""
    ],
    [
      "Wang",
      "Dingzirui",
      ""
    ],
    [
      "Wang",
      "Baoxin",
      ""
    ],
    [
      "Dou",
      "Longxu",
      ""
    ],
    [
      "Lu",
      "Xinyuan",
      ""
    ],
    [
      "Xu",
      "Keyan",
      ""
    ],
    [
      "Wu",
      "Dayong",
      ""
    ],
    [
      "Zhu",
      "Qingfu",
      ""
    ],
    [
      "Che",
      "Wanxiang",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 13:21:57 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734355317000,
  "abstract": "  Scientific question answering (SQA) is an important task aimed at answering\nquestions based on papers. However, current SQA datasets have limited reasoning\ntypes and neglect the relevance between tables and text, creating a significant\ngap with real scenarios. To address these challenges, we propose a QA benchmark\nfor scientific tables and text with diverse reasoning types (SciTaT). To cover\nmore reasoning types, we summarize various reasoning types from real-world\nquestions. To involve both tables and text, we require the questions to\nincorporate tables and text as much as possible. Based on SciTaT, we propose a\nstrong baseline (CaR), which combines various reasoning methods to address\ndifferent reasoning types and process tables and text at the same time. CaR\nbrings average improvements of 12.9% over other baselines on SciTaT, validating\nits effectiveness. Error analysis reveals the challenges of SciTaT, such as\ncomplex numerical calculations and domain knowledge.\n",
  "subjects": [
    "Computer Science/Computation and Language"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "HfxGIsZ_cBo8WasaujkQJD3MtiIaJrgtwU0_cH7xmp4",
  "pdfSize": "7750096"
}