{
  "id": "2412.20344",
  "title": "A Slowly Flattening Milky Way Stellar Disk: Investigating Galactic\n  Warping through Dynamical Orbital Inclinations of Open Clusters",
  "authors": "Liming Peng, Zhihong He",
  "authorsParsed": [
    [
      "Peng",
      "Liming",
      ""
    ],
    [
      "He",
      "Zhihong",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 29 Dec 2024 04:05:22 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735445122000,
  "abstract": "  By evaluating angular momentum directions of open cluster (OC) samples across\nvarious Galactocentric radii, we assessed their orbital plane inclinations. Our\nfindings reveal that, without considering the local tilt of the Galactic disk\nnear the sun, our results are consistent with previous studies on Classical\nCepheids (CCs). Notably, the warp precession derived from OCs closely mirror\nthose of CCs. Nonetheless, we observed a systematic deviation between the\ngeometric and dynamic warps, attributable to the tilt of the local disk. We\nidentified a systematic vertical motion in the local region, associated with\nthe warping feature near the solar vicinity. Ignoring this motion leads to\nunderestimates of orbital plane inclinations compared to those derived from\ngeometric positions. Our study indicates consistency between the inclinations\nderived from orbital dynamics and geometric positions at a vertical velocity of\nthe sun relative to the Galactic mid-plane of Vz_sun = 9.4(0.2) km/s. This\nvalue is approximately 2 km/s higher than the historically estimated solar\npeculiar motion, W_sun, primarily due to an approximately 0.6-degree tilt of\nthe local plane. Analysis suggests that previous estimates of the Galactic\ndisk's warping precession rate may have been overestimated due to local warping\ninfluences. The findings indicate that the precession oscillates around zero\nand that the Galactic warp is progressively flattening. Additionally, the line\nof nodes tends to become consistent across various Galactocentric radii over a\ntimescale of 100-200 million years.\n",
  "subjects": [
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/publicdomain/zero/1.0/",
  "blobId": "MbodqcVjSwBy3qWT-QI3X-DzEtZy9QPhJZPXk1A0ZGc",
  "pdfSize": "1184347"
}