{"id":"2412.15387","title":"Frustrated magnetism in Mn films on Ag(111) surface: from chiral\n  in-plane N\\'eel state to row-wise antiferromagnetism","authors":"Selcuk S\\\"ozeri, Nihad Abuawwad, Amal Aldarawsheh, Samir Lounis","authorsParsed":[["Sözeri","Selcuk",""],["Abuawwad","Nihad",""],["Aldarawsheh","Amal",""],["Lounis","Samir",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 20:27:44 GMT"}],"updateDate":"2024-12-23","timestamp":1734640064000,"abstract":"  We conduct a comprehensive density functional theory (DFT) study to explore\nthe intricate magnetic properties of frustrated Mn monolayer on the Ag(111)\nsurface. Spin-polarized scanning tunneling microscopy demonstrates that a\nN\\'eel magnetic state characterizes such an interface, which contradicts\nsystematic ab-initio predictions made in the last two decades indicating that\nthe ground state is collinear row-wise antiferromagnetic (RW-AFM) state. Here,\nwe employ the all-electron full-potential Korringa-Kohn-Rostoker Green function\n(KKR) method and find that the ground state is a chiral magnetic N\\'eel state,\nwith magnetic moments rotating in the surface plane following a unique sense of\nrotation, as dictated by the underlying in-plane magnetic anisotropy and\nDzyaloshinskii-Moriya interaction. Once allowing disordered magnetic states, as\ndescribed within the disordered local moment (DLM) approach, we reveal the\npossibility of stabilization of a RW-AFM state. We conjecture that at low\ntemperatures, the chiral N\\'eel state prevails, while at higher temperatures,\nthe magnetic exchange interactions are modified by magnetic disorder, which can\nthen induce a transition towards a RW-AFM state. Our work addresses a long term\nexperimental-theoretical controversy and provides significant insights into the\nmagnetic interactions and stability of Mn films on noble metal substrates,\ncontributing to the broader understanding of the different magnetic facets of\nfrustrated magnetism in thin films.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"A6ffq-AVrkHWm7FGA9g3x66dTyF8XjUUqn_jSx-iyko","pdfSize":"2891943"}