{
  "id": "2412.16406",
  "title": "Learning Disease Progression Models That Capture Health Disparities",
  "authors": "Erica Chiang, Divya Shanmugam, Ashley N. Beecy, Gabriel Sayer, Nir\n  Uriel, Deborah Estrin, Nikhil Garg, Emma Pierson",
  "authorsParsed": [
    [
      "Chiang",
      "Erica",
      ""
    ],
    [
      "Shanmugam",
      "Divya",
      ""
    ],
    [
      "Beecy",
      "Ashley N.",
      ""
    ],
    [
      "Sayer",
      "Gabriel",
      ""
    ],
    [
      "Uriel",
      "Nir",
      ""
    ],
    [
      "Estrin",
      "Deborah",
      ""
    ],
    [
      "Garg",
      "Nikhil",
      ""
    ],
    [
      "Pierson",
      "Emma",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 23:56:37 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734738997000,
  "abstract": "  Disease progression models are widely used to inform the diagnosis and\ntreatment of many progressive diseases. However, a significant limitation of\nexisting models is that they do not account for health disparities that can\nbias the observed data. To address this, we develop an interpretable Bayesian\ndisease progression model that captures three key health disparities: certain\npatient populations may (1) start receiving care only when their disease is\nmore severe, (2) experience faster disease progression even while receiving\ncare, or (3) receive follow-up care less frequently conditional on disease\nseverity. We show theoretically and empirically that failing to account for\ndisparities produces biased estimates of severity (underestimating severity for\ndisadvantaged groups, for example). On a dataset of heart failure patients, we\nshow that our model can identify groups that face each type of health\ndisparity, and that accounting for these disparities meaningfully shifts which\npatients are considered high-risk.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Computers and Society",
    "Statistics/Applications",
    "Statistics/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "F9siN-8VOM8X2M2VNmS3zO4Blt5jkgq_Ue4eiFH9tJM",
  "pdfSize": "1206939"
}