{
  "id": "2412.06891",
  "title": "Causality bounds from charged shockwaves in 5d",
  "authors": "Sera Cremonini, Brian McPeak, Mohammad Moezzi, Muthusamy Rajaguru",
  "authorsParsed": [
    [
      "Cremonini",
      "Sera",
      ""
    ],
    [
      "McPeak",
      "Brian",
      ""
    ],
    [
      "Moezzi",
      "Mohammad",
      ""
    ],
    [
      "Rajaguru",
      "Muthusamy",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 19:00:03 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733770803000,
  "abstract": "  Effective field theories are constrained by the requirement that their\nconstituents never move superluminally on non-trivial backgrounds. In this\npaper, we study time delays experienced by photons propagating on charged\nshockwave backgrounds in five dimensions. In the absence of gravity -- where\nthe shockwaves are electric fields sourced by boosted charges -- we derive\npositivity bounds for the four-derivative corrections to electromagnetism,\nreproducing previous results derived from scattering amplitudes. By considering\nthe gravitational shockwaves sourced by Reissner-Nordstr\\\"om black holes, we\nderive new constraints in the presence of gravity. We observe the by-now\nfamiliar weakening of positivity bounds in the presence of gravity, but without\nthe logarithmic divergences present in 4d. We find that the strongest bounds\nappear by examining the time delay near the horizon of the smallest possible\nblack hole, and discuss on the validity of the EFT expansion in this region. We\ncomment on our bounds in the context of the swampland program as well as their\nrelation with the positivity bounds obtained from dispersion relations.\n",
  "subjects": [
    "Physics/High Energy Physics - Theory",
    "Physics/General Relativity and Quantum Cosmology"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "LOHTBakN_V2mn7oyljJ73CknjXy0dLnjCPx4QqTtPBQ",
  "pdfSize": "859535"
}