{"id":"2412.18804","title":"Optical detection of the spatial structural alteration in the human\n  brain tissues and cells and DNA and chromatin due to Parkinsons disease","authors":"Fatemah Alharthi, Dhruvil Solanki, Ishmael Apachigawo, Jianfeng Xiao,\n  Mohammad Moshahid Khan, and Prabhakar Pradhan","authorsParsed":[["Alharthi","Fatemah",""],["Solanki","Dhruvil",""],["Apachigawo","Ishmael",""],["Xiao","Jianfeng",""],["Khan","Mohammad Moshahid",""],["Pradhan","Prabhakar",""]],"versions":[{"version":"v1","created":"Wed, 25 Dec 2024 07:05:11 GMT"}],"updateDate":"2024-12-30","timestamp":1735110311000,"abstract":"  Parkinsons disease (PD) is considered one of the most frequent neurological\ndiseases in the world. There is a need to study the early and efficient\nbiomarkers of Parkinsons, such as changes in structural disorders like DNA and\nchromatin, especially at the subcellular level in the human brain. We used two\ntechniques, Partial wave spectroscopy (PWS) and Inverse Participation Ratio\n(IPR), to detect the changes in structural disorder in the human brain tissue\nsamples. It was observed from the PWS experiment that there was an increase in\nstructural disorder in Parkinsons disease tissues and cells when compared to\nnormal tissues and cells using mesoscopic light transport theory. Furthermore,\nthe IPR experiment also showed DNA and chromatin structural alterations that\nhave the same trend and support the PWS results. The increase in mass density\nin the nuclei components, such as DNA and chromatin, can be linked to the\naggregation of alpha-synuclein in the substantia nigra of the brain. This\nprotein deposition is considered a significant cause of neuronal death in the\nbrains of PD patients. We also did a histological analysis of brain tissues,\nwhich supports our results from dual photonics techniques. The results show\nthat this dual technique is a powerful approach to detect the changes. Our\nresults highlight the potential of the parameter, related to the structural\ndisorder strength, as an efficient biomarker for PD progress, paving the way\nfor research into early disease detection.\n","subjects":["Physics/Medical Physics","Physics/Biological Physics","Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"x0OlR2PFfomtP_OhBZLoHi2o2SicVO3T2VdijuDAOvQ","pdfSize":"720488"}