{
  "id": "2412.10672",
  "title": "User Personas Improve Social Sustainability by Encouraging Software\n  Developers to Deprioritize Antisocial Features",
  "authors": "Bimpe Ayoola, Miikka Kuutila, Rina R. Wehbe and Paul Ralph",
  "authorsParsed": [
    [
      "Ayoola",
      "Bimpe",
      ""
    ],
    [
      "Kuutila",
      "Miikka",
      ""
    ],
    [
      "Wehbe",
      "Rina R.",
      ""
    ],
    [
      "Ralph",
      "Paul",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 14 Dec 2024 04:20:20 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734150020000,
  "abstract": "  Sustainable software development involves creating software in a manner that\nmeets present goals without undermining our ability to meet future goals. In a\nsoftware engineering context, sustainability has at least four dimensions:\necological, economic, social, and technical. No interventions for improving\nsocial sustainability in software engineering have been tested in rigorous\nlab-based experiments, and little evidence-based guidance is available. The\npurpose of this study is to evaluate the effectiveness of two\ninterventions-stakeholder maps and persona models-for improving social\nsustainability through software feature prioritization. We conducted a\nrandomized controlled factorial experiment with 79 undergraduate computer\nscience students. Participants were randomly assigned to one of four groups and\nasked to prioritize a backlog of prosocial, neutral, and antisocial user\nstories for a shopping mall's digital screen display and facial recognition\nsoftware. Participants received either persona models, a stakeholder map, both,\nor neither. We compared the differences in prioritization levels assigned to\nprosocial and antisocial user stories using Cumulative Link Mixed Model\nregression. Participants who received persona models gave significantly lower\npriorities to antisocial user stories but no significant difference was evident\nfor prosocial user stories. The effects of the stakeholder map were not\nsignificant. The interaction effects were not significant. Providing aspiring\nsoftware professionals with well-crafted persona models causes them to\nde-prioritize antisocial software features. The impact of persona modelling on\nsustainable software development therefore warrants further study with more\nexperience professionals. Moreover, the novel methodological strategy of\nassessing social sustainability behavior through backlog prioritization appears\nfeasible in lab-based settings.\n",
  "subjects": [
    "Computer Science/Software Engineering"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "H7aEsgyEYOTlBDt2PEsvXprUjaitNcYlTujA1Z_ATjU",
  "pdfSize": "834433"
}