{"id":"2412.20350","title":"Safe Bayesian Optimization for the Control of High-Dimensional Embodied\n  Systems","authors":"Yunyue Wei, Zeji Yi, Hongda Li, Saraswati Soedarmadji, Yanan Sui","authorsParsed":[["Wei","Yunyue",""],["Yi","Zeji",""],["Li","Hongda",""],["Soedarmadji","Saraswati",""],["Sui","Yanan",""]],"versions":[{"version":"v1","created":"Sun, 29 Dec 2024 04:42:50 GMT"}],"updateDate":"2024-12-31","timestamp":1735447370000,"abstract":"  Learning to move is a primary goal for animals and robots, where ensuring\nsafety is often important when optimizing control policies on the embodied\nsystems. For complex tasks such as the control of human or humanoid control,\nthe high-dimensional parameter space adds complexity to the safe optimization\neffort. Current safe exploration algorithms exhibit inefficiency and may even\nbecome infeasible with large high-dimensional input spaces. Furthermore,\nexisting high-dimensional constrained optimization methods neglect safety in\nthe search process. In this paper, we propose High-dimensional Safe Bayesian\nOptimization with local optimistic exploration (HdSafeBO), a novel approach\ndesigned to handle high-dimensional sampling problems under probabilistic\nsafety constraints. We introduce a local optimistic strategy to efficiently and\nsafely optimize the objective function, providing a probabilistic safety\nguarantee and a cumulative safety violation bound. Through the use of isometric\nembedding, HdSafeBO addresses problems ranging from a few hundred to several\nthousand dimensions while maintaining safety guarantees. To our knowledge,\nHdSafeBO is the first algorithm capable of optimizing the control of\nhigh-dimensional musculoskeletal systems with high safety probability. We also\ndemonstrate the real-world applicability of HdSafeBO through its use in the\nsafe online optimization of neural stimulation induced human motion control.\n","subjects":["Computer Science/Machine Learning","Computer Science/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"rQ35nlAT2ZodbasP5Yp_xYJ8cQ0KNDwpKo5pmm_9j6s","pdfSize":"4598346"}