{"id":"2412.09592","title":"JWST PRIMER: strong evidence for the environmental quenching of low-mass\n  galaxies out to $\\mathbf{\\textit{z} \\simeq 2}$","authors":"M. L. Hamadouche, R. J. McLure, A. Carnall, D. J. McLeod, J. S.\n  Dunlop, K. Whitaker, C. T. Donnan, R. Begley, T. M. Stanton, O. Almaini, J.\n  Aird, F. Cullen, S. Cutler, A. M. Koekemoer","authorsParsed":[["Hamadouche","M. L.",""],["McLure","R. J.",""],["Carnall","A.",""],["McLeod","D. J.",""],["Dunlop","J. S.",""],["Whitaker","K.",""],["Donnan","C. T.",""],["Begley","R.",""],["Stanton","T. M.",""],["Almaini","O.",""],["Aird","J.",""],["Cullen","F.",""],["Cutler","S.",""],["Koekemoer","A. M.",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 18:58:01 GMT"}],"updateDate":"2024-12-13","timestamp":1734029881000,"abstract":"  We present the results of a study investigating the galaxy stellar-mass\nfunction (GSMF), size-mass relations and morphological properties of\nstar-forming and quiescent galaxies over the redshift range $0.25<z<2.25$,\nusing the JWST PRIMER survey. The depth of the PRIMER near-IR imaging allows us\nto confirm the double Schechter function shape of the quiescent GSMF out to\n$z\\simeq2.0$, via a clear detection of the upturn at\n$\\mathrm{log}_{10}(M_{\\star}/ M_{\\odot}) \\leq 10$ thought to be induced by\nenvironmental quenching. In addition to the GSMF, we confirm that quiescent\ngalaxies can be split into separate populations at\n$\\mathrm{log}_{10}(M_{\\star}/M_{\\odot}) \\simeq 10$, based on their size-mass\nrelations and morphologies. We find that low-mass quiescent galaxies have more\ndisk-like morphologies (based on S\\'ersic index, Gini coefficient and $M_{20}$\nmetrics) and follow a shallower size-mass relation than their high-mass\ncounterparts. Indeed, the slope of the size-mass relation followed by low-mass\nquiescent galaxies is indistinguishable from that followed by star-forming\ngalaxies, albeit with a lower normalization. Moreover, within the errors, the\nevolution in the median size of low-mass quiescent galaxies is\nindistinguishable from that followed by star-forming galaxies\n($R_{e}\\propto(1+z)^{-0.25\\pm0.03})$, and significantly less rapid than that\ndisplayed by high-mass quiescent galaxies ($R_{e}\\propto (1+z)^{-1.14\\pm\n0.03})$. Overall, our results are consistent with low and high-mass quiescent\ngalaxies following different quenching pathways. The evolution of low-mass\nquiescent galaxies is qualitatively consistent with the expectations of\nexternal/environmental quenching (e.g. ram-pressure stripping). In contrast,\nthe evolution of high-mass quiescent galaxies is consistent with internal/mass\nquenching (e.g. AGN feedback) followed by size growth driven by minor mergers.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0cf-UNcAxPqbkJnIdju-6LQPLbzgVWkd4wcw_pSObTw","pdfSize":"2079901"}