{"id":"2412.15118","title":"Outcome-Refining Process Supervision for Code Generation","authors":"Zhuohao Yu, Weizheng Gu, Yidong Wang, Zhengran Zeng, Jindong Wang, Wei\n  Ye, Shikun Zhang","authorsParsed":[["Yu","Zhuohao",""],["Gu","Weizheng",""],["Wang","Yidong",""],["Zeng","Zhengran",""],["Wang","Jindong",""],["Ye","Wei",""],["Zhang","Shikun",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 17:59:42 GMT"}],"updateDate":"2024-12-20","timestamp":1734631182000,"abstract":"  Large Language Models have demonstrated remarkable capabilities in code\ngeneration, yet they often struggle with complex programming tasks that require\ndeep algorithmic reasoning. While process supervision through learned reward\nmodels shows promise in guiding reasoning steps, it requires expensive training\ndata and suffers from unreliable evaluation. We propose Outcome-Refining\nProcess Supervision, a novel paradigm that treats outcome refinement itself as\nthe process to be supervised. Our framework leverages concrete execution\nsignals to ground the supervision of reasoning steps, while using\ntree-structured exploration to maintain multiple solution trajectories\nsimultaneously. Experiments demonstrate that our approach enables even smaller\nmodels to achieve high success accuracy and performance metrics on competitive\nprogramming tasks, creates more reliable verification than traditional reward\nmodels without requiring training PRMs. Our approach achieves significant\nimprovements across 5 models and 3 datasets: an average of 26.9% increase in\ncorrectness and 42.2% in efficiency. The results suggest that providing\nstructured reasoning space with concrete verification signals is crucial for\nsolving complex programming tasks. We open-source all our code and data at:\nhttps://github.com/zhuohaoyu/ORPS\n","subjects":["Computer Science/Computation and Language","Computer Science/Artificial Intelligence","Computer Science/Machine Learning","Computer Science/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"HGUCgVtPl_zx_VCgAZr85HkJlwwbuf0_mquj_wli3yc","pdfSize":"6279335"}