{"id":"2412.00481","title":"MaintAGT:Sim2Real-Guided Multimodal Large Model for Intelligent\n  Maintenance with Chain-of-Thought Reasoning","authors":"Hongliang He, Jinfeng Huang, Qi Li, Xu Wang, Feibin Zhang, Kangding\n  Yang, Li Meng and Fulei Chu","authorsParsed":[["He","Hongliang",""],["Huang","Jinfeng",""],["Li","Qi",""],["Wang","Xu",""],["Zhang","Feibin",""],["Yang","Kangding",""],["Meng","Li",""],["Chu","Fulei",""]],"versions":[{"version":"v1","created":"Sat, 30 Nov 2024 13:40:54 GMT"}],"updateDate":"2024-12-03","timestamp":1732974054000,"abstract":"  In recent years, large language models have made significant advancements in\nthe field of natural language processing, yet there are still inadequacies in\nspecific domain knowledge and applications. This paper Proposes MaintAGT, a\nprofessional large model for intelligent operations and maintenance, aimed at\naddressing this issue. The system comprises three key components: a\nsignal-to-text model, a pure text model, and a multimodal model. Firstly, the\nsignal-to-text model was designed to convert raw signal data into textual\ndescriptions, bridging the gap between signal data and text-based analysis.\nSecondly, the pure text model was fine-tuned using the GLM4 model with\nspecialized knowledge to enhance its understanding of domain-specific texts.\nFinally, these two models were integrated to develop a comprehensive multimodal\nmodel that effectively processes and analyzes both signal and textual data.The\ndataset used for training and evaluation was sourced from academic papers,\ntextbooks, international standards, and vibration analyst training materials,\nundergoing meticulous preprocessing to ensure high-quality data. As a result,\nthe model has demonstrated outstanding performance across multiple intelligent\noperations and maintenance tasks, providing a low-cost, high-quality method for\nconstructing large-scale monitoring signal-text description-fault pattern\ndatasets. Experimental results indicate that the model holds significant\nadvantages in condition monitoring, signal processing, and fault diagnosis.In\nthe constructed general test set, MaintAGT achieved an accuracy of 70%,\nsurpassing all existing general large language models and reaching the level of\nan ISO Level III human vibration analyst.This advancement signifies a crucial\nstep forward from traditional maintenance practices toward intelligent and\nAI-driven maintenance solutions.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"EFTSB-lw78IT9PqVjNN_8ZPkhF04u_JZJCTdVCYE0C8","pdfSize":"2612366"}