{
  "id": "2412.17254",
  "title": "Enhancing Multi-Text Long Video Generation Consistency without Tuning:\n  Time-Frequency Analysis, Prompt Alignment, and Theory",
  "authors": "Xingyao Li, Fengzhuo Zhang, Jiachun Pan, Yunlong Hou, Vincent Y. F.\n  Tan, Zhuoran Yang",
  "authorsParsed": [
    [
      "Li",
      "Xingyao",
      ""
    ],
    [
      "Zhang",
      "Fengzhuo",
      ""
    ],
    [
      "Pan",
      "Jiachun",
      ""
    ],
    [
      "Hou",
      "Yunlong",
      ""
    ],
    [
      "Tan",
      "Vincent Y. F.",
      ""
    ],
    [
      "Yang",
      "Zhuoran",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 03:56:27 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734926187000,
  "abstract": "  Despite the considerable progress achieved in the long video generation\nproblem, there is still significant room to improve the consistency of the\nvideos, particularly in terms of smoothness and transitions between scenes. We\naddress these issues to enhance the consistency and coherence of videos\ngenerated with either single or multiple prompts. We propose the Time-frequency\nbased temporal Attention Reweighting Algorithm (TiARA), which meticulously\nedits the attention score matrix based on the Discrete Short-Time Fourier\nTransform. Our method is supported by a theoretical guarantee, the\nfirst-of-its-kind for frequency-based methods in diffusion models. For videos\ngenerated by multiple prompts, we further investigate key factors affecting\nprompt interpolation quality and propose PromptBlend, an advanced prompt\ninterpolation pipeline. The efficacy of our proposed method is validated via\nextensive experimental results, exhibiting consistent and impressive\nimprovements over baseline methods. The code will be released upon acceptance.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "-YXC3aHDuvP2vH_cXnVAUH91MNgmklgrOYn5R0eE2n0",
  "pdfSize": "26006218"
}