{
  "id": "2412.17763",
  "title": "Topological Properties of Bilayer $\\alpha-T_{3}$ Lattice Induced by\n  Polarized Light",
  "authors": "O. Benhaida, E. H. Saidi, L. B. Drissi, R. Ahl Laamara",
  "authorsParsed": [
    [
      "Benhaida",
      "O.",
      ""
    ],
    [
      "Saidi",
      "E. H.",
      ""
    ],
    [
      "Drissi",
      "L. B.",
      ""
    ],
    [
      "Laamara",
      "R. Ahl",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 18:19:07 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734977947000,
  "abstract": "  In this study, we explore the topological properties of the photon-dressed\nenergy bands in bilayer $\\alpha-T_{3}$ lattices, focusing on both aligned and\ncyclic stacking configurations under the influence of off-resonant circularly\npolarized light. We derive precise analytical expressions for the quasi-energy\nbands in the aligned stacking case, while numerical results for cyclic stacking\nare obtained at the Dirac points. Our findings reveal that the time-reversal\nsymmetry breaking caused by circularly polarized light completely lifts the\ndegeneracy at the $t^{a,c}$-point intersections at these Dirac points. To\ninvestigate the topological signatures of the driven $\\alpha-T_{3}$ lattices,\nwe examine the Berry phase through anomalous magnetic and thermal responses.\nNotably, at $\\alpha = 1/\\sqrt{2}$, we find that the orbital magnetic moments\nassociated with both corrugated and flat bands exhibit opposite signs, along\nwith their Berry curvatures. For values of $0 < \\alpha < 1$, off-resonant light\ninduces deformations in the bands near the Dirac points, leading to two equally\nsized gaps in the quasi-energy spectrum. The position of the chemical potential\nwithin these gaps significantly influences the orbital magnetization. We\nobserve that linear variations in magnetization correlate with Chern numbers on\neither side of $\\alpha = 1/\\sqrt{2}$. These topological features manifest as\ndistinct quantized values of anomalous Hall conductivity across both stacking\ntypes...\n",
  "subjects": [
    "Condensed Matter/Mesoscale and Nanoscale Physics",
    "Condensed Matter/Other Condensed Matter"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "YHytk0buC8xXoVBwQZGminGrFVCrmt2agQoe6L-O0Mo",
  "pdfSize": "2049500"
}