{
  "id": "2412.10150",
  "title": "The bremsstrahlung-like production of the massive spin-2 dark matter\n  mediator",
  "authors": "I. V. Voronchikhin, D. V. Kirpichnikov",
  "authorsParsed": [
    [
      "Voronchikhin",
      "I. V.",
      ""
    ],
    [
      "Kirpichnikov",
      "D. V.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 14:11:03 GMT"
    }
  ],
  "updateDate": "2024-12-16",
  "timestamp": 1734099063000,
  "abstract": "  The link between Standard Model (SM) particles and dark matter (DM) can be\nintroduced via spin-2 massive mediator, G, that couples to photon and charged\nleptons. Moreover, in a mediator mass range from sub-MeV to sub-GeV,\nfixed-target facilities such as NA64e, LDMX, NA64$\\mu$, M$^3$, and E137, can\npotentially probe such particle of the hidden sector via the signatures that\nare described by the bremsstrahlung-like process involving tensor mediator. We\ncompare numerically the Weizsaker-Williams (WW) approximation and the exact\ntree-level (ETL) approach for the bremsstrahlung-like mediator production cross\nsection by choosing various parameters of the fixed-target experiments. In\naddition, we derive novel constraints on spin-2 DM mediator parameter space\nfrom the data of the E137 fixed-target experiment. In particular, we\ndemonstrate that the E137 experiment has been ruled out the the couplings of\nthe spin-2 mediator at the level of\n$8\\times10^{-8}~\\mbox{GeV}^{-1}~\\lesssim~c^{\\rm\nG}_{ee}~\\lesssim~10^{-5}~\\mbox{GeV}^{-1}$ for the typical masses in the range\n$100~\\mbox{MeV}~\\lesssim~m_{\\rm G}~\\lesssim 800~\\mbox{MeV}$, that corresponds\nto the statistics of $1.87\\times 10^{20}$ electrons accumulated on target. The\nlatter implies its universal coupling to photons and leptons, $c^{\\rm G}_{ee} =\nc^{\\rm G}_{\\gamma \\gamma}$.\n",
  "subjects": [
    "Physics/High Energy Physics - Phenomenology"
  ],
  "license": "http://creativecommons.org/publicdomain/zero/1.0/",
  "blobId": "BoC_2uxzgczeKEio7j5TOyfQAMwOEjfgBtFVgwZAsWg",
  "pdfSize": "2630123"
}