{
  "id": "2412.14365",
  "title": "Influence of Magnetic Anisotropy on the Ground State of\n  [CH$_3$NH$_3$]Fe(HCOO)$_3$: Insights into the Improper Modulated Magnetic\n  Structure",
  "authors": "Laura Ca\\~nadillas-Delgado, Lidia Mazzuca, Sanliang Ling, Matthew J.\n  Cliffe and Oscar Fabelo",
  "authorsParsed": [
    [
      "Cañadillas-Delgado",
      "Laura",
      ""
    ],
    [
      "Mazzuca",
      "Lidia",
      ""
    ],
    [
      "Ling",
      "Sanliang",
      ""
    ],
    [
      "Cliffe",
      "Matthew J.",
      ""
    ],
    [
      "Fabelo",
      "Oscar",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 22:03:11 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734559391000,
  "abstract": "  The hybrid perovskites [CH$_3$NH$_3$]Co$_x$Ni$_{x-1}$(HCOO)$_3$ with $x$ = 0,\n0.25, 0.5, 0.75 and 1.0 possess multiple phase transitions including\nincommensurate structures. [CH$_3$NH$_3$]Ni(HCOO)$_3$ has also been found to\nhave a proper magnetic incommensurate structure in its ground state. We have\ncarried out a detailed structural characterization of the isomorphous\n[CH$_3$NH$_3$]Fe(HCOO)$_3$ (1) to investigate whether it also has\nincommensurate structural and magnetic modulations. We confirm that 1\ncrystallizes in the $Pnma$ space group at room temperature (RT) with a\nperovskite structure. Upon cooling, at about 170 K, the occurrence of new\nsatellite reflections in the diffraction pattern show a phase transition to a\nmodulated structure, which could be refined in the $Pnma(00\\gamma)0s0$ super\nspace group with $q_1~=~0.1662(2)c^\\ast$. On further cooling to 75 K the\nsatellite reflections become closer to the main reflections, indicating a new\nphase transition that keeps the super space group invariant but changes the\nmodulation wave vector, $q_2~=~0.1425(2)c^\\ast$. The structure then does not\nchange structural phase down to base temperature (2 K). Magnetic susceptibility\nmeasurements collected under field-cooled and zero-field-cooled reveal a 3D\nantiferromagnetic order below 17 K. The overlapping in temperature between\nstructural modulation and long-range magnetic order presents a unique\nopportunity to study magneto-structural coupling. Our results point to an\nimproper modulated structure where interestingly the spins oriented strictly\nantiferromagnetic are perpendicular to those of previously reported compounds.\nIn the present work, a combination of magnetometry measurements, single crystal\nand powder neutron diffraction and density functional theory calculations have\nbeen used to accurately determine and understand the sequence of nuclear and\nmagnetic phases present in compound 1.\n",
  "subjects": [
    "Condensed Matter/Materials Science",
    "Condensed Matter/Strongly Correlated Electrons"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "TDNlocE4th6tunRJyKgD5sSQQl6jLpbPxBF5omZgfHE",
  "pdfSize": "3934528"
}