{
  "id": "2412.02329",
  "title": "GRAND : Graph Reconstruction from potential partial Adjacency and\n  Neighborhood Data",
  "authors": "Sofiane Azogagh, Zelma Aubin Birba, Jos\\'ee Desharnais, S\\'ebastien\n  Gambs, Marc-Olivier Killijian and Nadia Tawbi",
  "authorsParsed": [
    [
      "Azogagh",
      "Sofiane",
      ""
    ],
    [
      "Birba",
      "Zelma Aubin",
      ""
    ],
    [
      "Desharnais",
      "Josée",
      ""
    ],
    [
      "Gambs",
      "Sébastien",
      ""
    ],
    [
      "Killijian",
      "Marc-Olivier",
      ""
    ],
    [
      "Tawbi",
      "Nadia",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 09:42:28 GMT"
    },
    {
      "version": "v2",
      "created": "Fri, 6 Dec 2024 14:20:15 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733218948000,
  "abstract": "  Cryptographic approaches, such as secure multiparty computation, can be used\nto compute in a secure manner the function of a distributed graph without\ncentralizing the data of each participant. However, the output of the protocol\nitself can leak sensitive information about the structure of the original\ngraph. In particular, in this work we propose an approach by which an adversary\nobserving the result of a private protocol for the computation of the number of\ncommon neighbors between all pairs of vertices, can reconstruct the adjacency\nmatrix of the graph. In fact, this can only be done up to co-squareness, a\nnotion we introduce, as two different graphs can have the same matrix of common\nneighbors. We consider two models of adversary, one who observes the common\nneighbors matrix only, and a knowledgeable one, that has a partial knowledge of\nthe original graph. Our results demonstrate that secure multiparty protocols\nare not enough for privacy protection, especially in the context of highly\nstructured data such as graphs. The reconstruction that we propose is\ninteresting in itself from the point of view of graph theory.\n",
  "subjects": [
    "Computer Science/Cryptography and Security",
    "Computer Science/Social and Information Networks"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "V7C__0y0nXuXLM7mYXczaOVzouseTNpXjynOkMvXaQc",
  "pdfSize": "3984312"
}