{"id":"2412.02475","title":"A time-discontinuous elasto-plasticity formalism to simulate\n  instantaneous plastic flow bursts","authors":"Mathias Lamari, Pierre Kerfriden, Oguz Umut Salman, Vladislav\n  Yastrebov, Kais Ammar, Samuel Forest","authorsParsed":[["Lamari","Mathias",""],["Kerfriden","Pierre",""],["Salman","Oguz Umut",""],["Yastrebov","Vladislav",""],["Ammar","Kais",""],["Forest","Samuel",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 14:37:25 GMT"}],"updateDate":"2024-12-04","timestamp":1733236645000,"abstract":"  Plastic flow is conventionally treated as continuous in finite element (FE)\ncodes, whether in isotropic, anisotropic plasticity, or crystal plasticity.\nThis approach, derived from continuum mechanics, contradicts the intermittent\nnature of plasticity at the elementary scale. Understanding crystal plasticity\nat micro-scale opens the door to new engineering applications, such as\nmicroscale machining. In this work, a new approach is proposed to account for\nthe intermittence of plastic deformation while remaining within the framework\nof continuum mechanics. We introduce a material parameter, the plastic\ndeformation threshold, denoted as $\\Delta p_{min}$, corresponding to the\nplastic deformation carried by the minimal plastic deformation burst within the\nmaterial. The incremental model is based on the traditional predictor-corrector\nalgorithm to calculate the elastoplastic behavior of a material subjected to\nany external loading. The model is presented within the framework of small\ndeformations for von Mises plasticity. To highlight the main features of the\napproach, the plastic strain increment is calculated using normality rule and\nconsistency conditions, and is accepted only if it exceeds $\\Delta p_{min}$. To\nachieve this, a time-discontinuous generalization of the Karush-Kuhn-Tucker\n(KKT) conditions is proposed. The simulations show that the introduction of the\nplastic threshold allows for the reproduction of the spatiotemporal\nintermittence of plastic flow, capturing the self-organization of plastic flow\nin complex loading scenarios within an FE model.\n","subjects":["Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"6P315K7wobPk0_626ZRp1p2vClRhzbugX4YIzF1pz1E","pdfSize":"17403493"}