{
  "id": "2412.09571",
  "title": "Asymmetric Temperature Variations In Protoplanetary disks: I. Linear\n  Theory, Corotating Spirals, and Ring Formation",
  "authors": "Zhaohuan Zhu, Shangjia Zhang, and Ted Johnson",
  "authorsParsed": [
    [
      "Zhu",
      "Zhaohuan",
      ""
    ],
    [
      "Zhang",
      "Shangjia",
      ""
    ],
    [
      "Johnson",
      "Ted",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 18:52:05 GMT"
    },
    {
      "version": "v2",
      "created": "Wed, 15 Jan 2025 15:53:23 GMT"
    }
  ],
  "updateDate": "2025-02-26",
  "timestamp": 1734029525000,
  "abstract": "  Protoplanetary disks can exhibit asymmetric temperature variations due to\nphenomena such as shadows cast by the inner disk or localized heating by young\nplanets. We investigate the disk features induced by these asymmetric\ntemperature variations. We find that spirals are initially excited, then break\ninto two and reconnect to form rings. By carrying out linear analyses, we first\nstudy the spiral launching mechanism, and find that the effects of azimuthal\ntemperature variations share similarities with effects of external potentials.\nSpecifically, rotating temperature variations launch steady spiral structures\nat Lindblad resonances, which corotate with the temperature patterns. When the\ncooling time exceeds the orbital period, these spiral structures are\nsignificantly weakened, and a checkerboard pattern may appear. A temperature\nvariation of about 10\\% can induce spirals with order unity density\nperturbations, comparable to those generated by a thermal mass planet. We then\nstudy ring formation and find it is related to the coupling between azimuthal\ntemperature variations and spirals outside the resonances. Such coupling leads\nto a radially varying angular momentum flux, which produces anomalous\nwave-driven accretion and forms dense rings separated by the wavelength of the\nwaves. Finally, we speculate that spirals induced by temperature variations may\ncontribute to disk accretion through non-linear wave steepening and\ndissipation. Overall, considering that irradiation determines the temperature\nstructure of protoplanetary disks, the change of irradiation both spatially\nor/and temporarily may produce observable effects in protoplanetary disks,\nespecially spirals and rings in outer disks beyond tens of AU.\n",
  "subjects": [
    "Astrophysics/Earth and Planetary Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "-QJWC3tWN5cngk3fEYrp1icQIxLHYWfztUWyLjvmysA",
  "pdfSize": "8637799"
}