{
  "id": "2412.20986",
  "title": "Resolving Pleiades binary stars with Gaia and speckle interferometric\n  observations",
  "authors": "Dmitry Chulkov, Ivan Strakhov, Boris Safonov",
  "authorsParsed": [
    [
      "Chulkov",
      "Dmitry",
      ""
    ],
    [
      "Strakhov",
      "Ivan",
      ""
    ],
    [
      "Safonov",
      "Boris",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 30 Dec 2024 14:53:06 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735570386000,
  "abstract": "  The Pleiades is the most prominent open star cluster visible from Earth and\nan important benchmark for simple stellar populations, unified by common\norigin, age, and distance. Binary stars are its essential ingredient, yet their\ncontribution remains uncertain due to heavy observational biases. A resolved\nmultiplicity survey was conducted for a magnitude-limited G < 15mag sample of\n423 potential cluster members, including sources with poorly fitted astrometric\nsolutions in Gaia DR3. Speckle interferometric observations at the 2.5 meter\ntelescope of SAI MSU observatory were combined with Gaia data, enabling the\nidentification of 61 resolved binary or multiple systems within the 0.04 - 10\narcsec (5 - 1350 au) separation range. With speckle observations, we discovered\n21 components in 20 systems. The existence of a Merope (23 Tau) companion is\nconfirmed after several previous unsuccessful attempts. We show that the Gaia\nmultipeak fraction is a strong predictor of subarcsecond multiplicity, as all\nsources with ipd_frac_multi_peak > 4% are successfully resolved. We found that\n10% of Pleiades stars have a companion with a mass ratio q > 0.5 within\nprojected separation of 27 < s < 1350 au, and confirm a deficit of wide\nbinaries with s > 300 au. An observed dearth of wide pairs with large mass\nratio (q > 0.55) may imprint the transition from hard to soft binaries regime\nat the early stages of cluster evolution. The total binary fraction for q > 0.5\nsystems is extrapolated to be around 25%.\n",
  "subjects": [
    "Astrophysics/Solar and Stellar Astrophysics",
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "b6WAgFaxE39st6OI0XJikG4TjqFaxhE-3n8_h3tPsHs",
  "pdfSize": "4258958"
}