{"id":"2412.04966","title":"Stochastic modeling of blob-like plasma filaments in the scrape-off\n  layer: Time-dependent velocities and pulse stagnation","authors":"O. Paikina, J. M. Losada, A. Theodorsen, and O. E. Garcia","authorsParsed":[["Paikina","O.",""],["Losada","J. M.",""],["Theodorsen","A.",""],["Garcia","O. E.",""]],"versions":[{"version":"v1","created":"Fri, 6 Dec 2024 11:37:01 GMT"}],"updateDate":"2024-12-09","timestamp":1733485021000,"abstract":"  A stochastic model for a super-position of uncorrelated pulses with a random\ndistribution of and correlations between amplitudes and velocities is analyzed.\nThe pulses are assumed to move radially with fixed shape and amplitudes\ndecreasing exponentially in time due to linear damping. The pulse velocities\nare taken to be time-dependent with a power law dependence on the instantaneous\namplitudes, as suggested by blob velocity scaling theories. In accordance with\nexperimental measurements, the pulse function is assumed to be exponential and\nthe amplitudes are taken to be exponentially distributed. As a consequence of\nlinear damping and time-dependent velocities, it is demonstrated that the\npulses stagnate during their radial motion. This makes the average pulse\nwaiting time increase radially outwards in the scrape-off layer of magnetically\nconfined plasmas. In the case that pulse velocities are proportional to their\namplitudes, the mean value of the process decreases exponentially with radial\ncoordinate, similar to the case when all pulses have the same, time-independent\nvelocity. The profile e-folding length is then given by the product of the\naverage pulse velocity and the parallel transit time. Moreover, both the\naverage pulse amplitude and the average velocity are the same at all radial\npositions due to stagnation of slow and small-amplitude pulses. In general, an\nincreasing average pulse velocity results in a flattened radial profile of the\nmean value of the process as well as a higher relative fluctuation level,\nstrongly enhancing plasma-surface interactions.\n","subjects":["Physics/Plasma Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Ydg9yJjSW5IPO0NOiWn97lHYMtgiJ_LJneNhQjATW5Y","pdfSize":"429222"}