{
  "id": "2412.13459",
  "title": "4.5 Million (Suspected) Fake Stars in GitHub: A Growing Spiral of\n  Popularity Contests, Scams, and Malware",
  "authors": "Hao He, Haoqin Yang, Philipp Burckhardt, Alexandros Kapravelos, Bogdan\n  Vasilescu, Christian K\\\"astner",
  "authorsParsed": [
    [
      "He",
      "Hao",
      ""
    ],
    [
      "Yang",
      "Haoqin",
      ""
    ],
    [
      "Burckhardt",
      "Philipp",
      ""
    ],
    [
      "Kapravelos",
      "Alexandros",
      ""
    ],
    [
      "Vasilescu",
      "Bogdan",
      ""
    ],
    [
      "Kästner",
      "Christian",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 03:03:58 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734491038000,
  "abstract": "  GitHub, the de-facto platform for open-source software development, provides\na set of social-media-like features to signal high-quality repositories. Among\nthem, the star count is the most widely used popularity signal, but it is also\nat risk of being artificially inflated (i.e., faked), decreasing its value as a\ndecision-making signal and posing a security risk to all GitHub users. In this\npaper, we present a systematic, global, and longitudinal measurement study of\nfake stars in GitHub. To this end, we build StarScout, a scalable tool able to\ndetect anomalous starring behaviors (i.e., low activity and lockstep) across\nthe entire GitHub metadata. Analyzing the data collected using StarScout, we\nfind that: (1) fake-star-related activities have rapidly surged since 2024; (2)\nthe user profile characteristics of fake stargazers are not distinct from\naverage GitHub users, but many of them have highly abnormal activity patterns;\n(3) the majority of fake stars are used to promote short-lived malware\nrepositories masquerading as pirating software, game cheats, or cryptocurrency\nbots; (4) some repositories may have acquired fake stars for growth hacking,\nbut fake stars only have a promotion effect in the short term (i.e., less than\ntwo months) and become a burden in the long term. Our study has implications\nfor platform moderators, open-source practitioners, and supply chain security\nresearchers.\n",
  "subjects": [
    "Computer Science/Cryptography and Security",
    "Computer Science/Software Engineering"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "DdwBccRgOPymv5d6NL71ZItd8cD1Gimrh7Y-fugxuq0",
  "pdfSize": "1696551"
}