{"id":"2412.00489","title":"Density-aware Global-Local Attention Network for Point Cloud\n  Segmentation","authors":"Chade Li, Pengju Zhang, Yihong Wu","authorsParsed":[["Li","Chade",""],["Zhang","Pengju",""],["Wu","Yihong",""]],"versions":[{"version":"v1","created":"Sat, 30 Nov 2024 14:14:14 GMT"}],"updateDate":"2024-12-03","timestamp":1732976054000,"abstract":"  3D point cloud segmentation has a wide range of applications in areas such as\nautonomous driving, augmented reality, virtual reality and digital twins. The\npoint cloud data collected in real scenes often contain small objects and\ncategories with small sample sizes, which are difficult to handle by existing\nnetworks. In this regard, we propose a point cloud segmentation network that\nfuses local attention based on density perception with global attention. The\ncore idea is to increase the effective receptive field of each point while\nreducing the loss of information about small objects in dense areas.\nSpecifically, we divide different sized windows for local areas with different\ndensities to compute attention within the window. Furthermore, we consider each\nlocal area as an independent token for the global attention of the entire\ninput. A category-response loss is also proposed to balance the processing of\ndifferent categories and sizes of objects. In particular, we set up an\nadditional fully connected layer in the middle of the network for prediction of\nthe presence of object categories, and construct a binary cross-entropy loss to\nrespond to the presence of categories in the scene. In experiments, our method\nachieves competitive results in semantic segmentation and part segmentation\ntasks on several publicly available datasets. Experiments on point cloud data\nobtained from complex real-world scenes filled with tiny objects also validate\nthe strong segmentation capability of our method for small objects as well as\nsmall sample categories.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"pFzUVwZRXCqdFL-UXbA8JalsYidcfWsFycTJR8dACoc","pdfSize":"8331712"}