{
  "id": "2412.17333",
  "title": "Broadband Ground Motion Synthesis by Diffusion Model with Minimal\n  Condition",
  "authors": "Jaeheun Jung, Jaehyuk Lee, Chang-Hae Jung, Hanyoung Kim, Bosung Jung,\n  Donghun Lee",
  "authorsParsed": [
    [
      "Jung",
      "Jaeheun",
      ""
    ],
    [
      "Lee",
      "Jaehyuk",
      ""
    ],
    [
      "Jung",
      "Chang-Hae",
      ""
    ],
    [
      "Kim",
      "Hanyoung",
      ""
    ],
    [
      "Jung",
      "Bosung",
      ""
    ],
    [
      "Lee",
      "Donghun",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 06:56:28 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734936988000,
  "abstract": "  Earthquakes are rare. Hence there is a fundamental call for reliable methods\nto generate realistic ground motion data for data-driven approaches in\nseismology. Recent GAN-based methods fall short of the call, as the methods\neither require special information such as geological traits or generate subpar\nwaveforms that fail to satisfy seismological constraints such as phase arrival\ntimes. We propose a specialized Latent Diffusion Model (LDM) that reliably\ngenerates realistic waveforms after learning from real earthquake data with\nminimal conditions: location and magnitude. We also design a domain-specific\ntraining method that exploits the traits of earthquake dataset: multiple\nobserved waveforms time-aligned and paired to each earthquake source that are\ntagged with seismological metadata comprised of earthquake magnitude, depth of\nfocus, and the locations of epicenter and seismometers. We construct the\ntime-aligned earthquake dataset using Southern California Earthquake Data\nCenter (SCEDC) API, and train our model with the dataset and our proposed\ntraining method for performance evaluation. Our model surpasses all comparable\ndata-driven methods in various test criteria not only from waveform generation\ndomain but also from seismology such as phase arrival time, GMPE analysis, and\nspectrum analysis. Our result opens new future research directions for deep\nlearning applications in seismology.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Artificial Intelligence",
    "Physics/Geophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "6bC8YHx1B_92Ootlr5wvu2lt9qw_80UOzkcZG-2FKCs",
  "pdfSize": "50552934"
}