{
  "id": "2412.15266",
  "title": "On the Structural Memory of LLM Agents",
  "authors": "Ruihong Zeng, Jinyuan Fang, Siwei Liu, Zaiqiao Meng",
  "authorsParsed": [
    [
      "Zeng",
      "Ruihong",
      ""
    ],
    [
      "Fang",
      "Jinyuan",
      ""
    ],
    [
      "Liu",
      "Siwei",
      ""
    ],
    [
      "Meng",
      "Zaiqiao",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 04:30:00 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734409800000,
  "abstract": "  Memory plays a pivotal role in enabling large language model~(LLM)-based\nagents to engage in complex and long-term interactions, such as question\nanswering (QA) and dialogue systems. While various memory modules have been\nproposed for these tasks, the impact of different memory structures across\ntasks remains insufficiently explored. This paper investigates how memory\nstructures and memory retrieval methods affect the performance of LLM-based\nagents. Specifically, we evaluate four types of memory structures, including\nchunks, knowledge triples, atomic facts, and summaries, along with mixed memory\nthat combines these components. In addition, we evaluate three widely used\nmemory retrieval methods: single-step retrieval, reranking, and iterative\nretrieval. Extensive experiments conducted across four tasks and six datasets\nyield the following key insights: (1) Different memory structures offer\ndistinct advantages, enabling them to be tailored to specific tasks; (2) Mixed\nmemory structures demonstrate remarkable resilience in noisy environments; (3)\nIterative retrieval consistently outperforms other methods across various\nscenarios. Our investigation aims to inspire further research into the design\nof memory systems for LLM-based agents.\n",
  "subjects": [
    "Computer Science/Computation and Language",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "1wAOEA3iQR-RKodZTxsHz0CP0hP8LEK4DAz8i6arsCk",
  "pdfSize": "7819783"
}