{
  "id": "2412.21062",
  "title": "Exponentially reduced circuit depths in Lindbladian simulation",
  "authors": "Wenjun Yu, Xiaogang Li, Qi Zhao, and Xiao Yuan",
  "authorsParsed": [
    [
      "Yu",
      "Wenjun",
      ""
    ],
    [
      "Li",
      "Xiaogang",
      ""
    ],
    [
      "Zhao",
      "Qi",
      ""
    ],
    [
      "Yuan",
      "Xiao",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 30 Dec 2024 16:31:25 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735576285000,
  "abstract": "  Quantum computers can efficiently simulate Lindbladian dynamics, enabling\npowerful applications in open system simulation, thermal and ground-state\npreparation, autonomous quantum error correction, dissipative engineering, and\nmore. Despite the abundance of well-established algorithms for closed-system\ndynamics, simulating open quantum systems on digital quantum computers remains\nchallenging due to the intrinsic requirement for non-unitary operations.\nExisting methods face a critical trade-off: either relying on\nresource-intensive multi-qubit operations with experimentally challenging\napproaches or employing deep quantum circuits to suppress simulation errors\nusing experimentally friendly methods. In this work, we challenge this\nperceived trade-off by proposing an efficient Lindbladian simulation framework\nthat minimizes circuit depths while remaining experimentally accessible. Based\non the incoherent linear combination of superoperators, our method achieves\nexponential reductions in circuit depth using at most two ancilla qubits and\nthe straightforward Trotter decomposition of the process. Furthermore, our\napproach extends to simulate time-dependent Lindbladian dynamics, achieving\nlogarithmic dependence on the inverse accuracy for the first time. Rigorous\nnumerical simulations demonstrate clear advantages of our method over existing\ntechniques. This work provides a practical and scalable solution for simulating\nopen quantum systems on quantum devices.\n",
  "subjects": [
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "2OJ_CB3yqGhz05c6AIYY-ZdgYIrbcDyNWHxKKEV9iWo",
  "pdfSize": "1793642"
}