{"id":"2412.18377","title":"ChaI-TeA: A Benchmark for Evaluating Autocompletion of Interactions with\n  LLM-based Chatbots","authors":"Shani Goren, Oren Kalinsky, Tomer Stav, Yuri Rapoport, Yaron\n  Fairstein, Ram Yazdi, Nachshon Cohen, Alexander Libov, Guy Kushilevitz","authorsParsed":[["Goren","Shani",""],["Kalinsky","Oren",""],["Stav","Tomer",""],["Rapoport","Yuri",""],["Fairstein","Yaron",""],["Yazdi","Ram",""],["Cohen","Nachshon",""],["Libov","Alexander",""],["Kushilevitz","Guy",""]],"versions":[{"version":"v1","created":"Tue, 24 Dec 2024 12:03:36 GMT"},{"version":"v2","created":"Wed, 25 Dec 2024 09:26:52 GMT"}],"updateDate":"2024-12-30","timestamp":1735041816000,"abstract":"  The rise of LLMs has deflected a growing portion of human-computer\ninteractions towards LLM-based chatbots. The remarkable abilities of these\nmodels allow users to interact using long, diverse natural language text\ncovering a wide range of topics and styles. Phrasing these messages is a time\nand effort consuming task, calling for an autocomplete solution to assist\nusers. We introduce the task of chatbot interaction autocomplete. We present\nChaI-TeA: CHat InTEraction Autocomplete; An autcomplete evaluation framework\nfor LLM-based chatbot interactions. The framework includes a formal definition\nof the task, coupled with suitable datasets and metrics. We use the framework\nto evaluate After formally defining the task along with suitable datasets and\nmetrics, we test 9 models on the defined auto completion task, finding that\nwhile current off-the-shelf models perform fairly, there is still much room for\nimprovement, mainly in ranking of the generated suggestions. We provide\ninsights for practitioners working on this task and open new research\ndirections for researchers in the field. We release our framework to serve as a\nfoundation for future research.\n","subjects":["Computer Science/Computation and Language","Computer Science/Artificial Intelligence","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"lt2dMN4mCH45ST08fwl57-QOMt7yvZ-xKrxMYCgS7qM","pdfSize":"684887"}