{
  "id": "2412.12183",
  "title": "Adopting Explainable-AI to investigate the impact of urban morphology\n  design on energy and environmental performance in dry-arid climates",
  "authors": "Pegah Eshraghi, Riccardo Talami, Arman Nikkhah Dehnavi, Maedeh\n  Mirdamadi, Zahra-Sadat Zomorodian",
  "authorsParsed": [
    [
      "Eshraghi",
      "Pegah",
      ""
    ],
    [
      "Talami",
      "Riccardo",
      ""
    ],
    [
      "Dehnavi",
      "Arman Nikkhah",
      ""
    ],
    [
      "Mirdamadi",
      "Maedeh",
      ""
    ],
    [
      "Zomorodian",
      "Zahra-Sadat",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 09:19:49 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734081589000,
  "abstract": "  In rapidly urbanizing regions, designing climate-responsive urban forms is\ncrucial for sustainable development, especially in dry arid-climates where\nurban morphology has a significant impact on energy consumption and\nenvironmental performance. This study advances urban morphology evaluation by\ncombining Urban Building Energy Modeling (UBEM) with machine learning methods\n(ML) and Explainable AI techniques, specifically Shapley Additive Explanations\n(SHAP). Using Tehran's dense urban landscape as a case study, this research\nassesses and ranks the impact of 30 morphology parameters at the urban block\nlevel on key energy metrics (cooling, heating, and lighting demand) and\nenvironmental performance (sunlight exposure, photovoltaic generation, and Sky\nView Factor). Among seven ML algorithms evaluated, the XGBoost model was the\nmost effective predictor, achieving high accuracy (R2: 0.92) and a training\ntime of 3.64 seconds. Findings reveal that building shape, window-to-wall\nratio, and commercial ratio are the most critical parameters affecting energy\nefficiency, while the heights and distances of neighboring buildings strongly\ninfluence cooling demand and solar access. By evaluating urban blocks with\nvaried densities and configurations, this study offers generalizable insights\napplicable to other dry-arid regions. Moreover, the integration of UBEM and\nExplainable AI offers a scalable, data-driven framework for developing\nclimate-responsive urban designs adaptable to high-density environments\nworldwide.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Computers and Society"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "LVibLSLtJtNLmN49jtkBFLhN9XbvpLShv2gP_e3TFA4",
  "pdfSize": "1083222"
}