{
  "id": "2412.07445",
  "title": "Identity theft and societal acceptability of electronic identity in\n  Europe and in the United States",
  "authors": "Marek Tiits, Tarmo Kalvet, David McBee",
  "authorsParsed": [
    [
      "Tiits",
      "Marek",
      ""
    ],
    [
      "Kalvet",
      "Tarmo",
      ""
    ],
    [
      "McBee",
      "David",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 12:04:26 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733832266000,
  "abstract": "  This paper addresses critical questions surrounding the security of\ngovernment-issued identity documents and their potential misuse, with an\nemphasis on understanding the perspectives of ordinary citizens across Europe\nand the United States of America. Drawing upon research on technology\nacceptance and diffusion, the research focuses on understanding the factors\nthat influence users' adoption of novel identity management solutions. Our\nmethodology includes a comprehensive, census-representative survey spanning\ncitizens from France, Germany, Italy, Spain, the United Kingdom, and the USA.\nThe paper's findings underscore a robust confidence in government-issued\nidentity documents, contrasted by a lower trust in private sector services,\nincluding social media platforms and email accounts. The adoption of artificial\nintelligence for identity verification remains contested, with a significant\npercentage of respondents undecided, indicating a need for explicit explanation\nand transparency about its implementation and related risks. Public sentiment\nleans towards acceptance of government data collection for identification\npurposes; however, the sharing of this data with private entities elicits more\napprehension.\n",
  "subjects": [
    "Computer Science/Computers and Society"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "0x33H8_VdfjGaOssJTufdgvAMXZF9_OWSBI564kq5aY",
  "pdfSize": "886629"
}