{
  "id": "2412.19831",
  "title": "Leslie Population Models in Predator-prey and Competitive populations:\n  theory and applications by machine learning",
  "authors": "Pico Gilman, Steven J. Miller, Daeyoung Son, Saad Waheed, Janine Wang",
  "authorsParsed": [
    [
      "Gilman",
      "Pico",
      ""
    ],
    [
      "Miller",
      "Steven J.",
      ""
    ],
    [
      "Son",
      "Daeyoung",
      ""
    ],
    [
      "Waheed",
      "Saad",
      ""
    ],
    [
      "Wang",
      "Janine",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 17:17:54 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1734715074000,
  "abstract": "  We introduce a new predator-prey model by replacing the growth and predation\nconstant by a square matrix, and the population density as a population vector.\nThe classical Lotka-Volterra model describes a population that either modulates\nor converges. Stability analysis of such models have been extensively studied\nby the works of Merdan (https://doi.org/10.1016/j.chaos.2007.06.062). The new\nmodel adds complexity by introducing an age group structure where the\npopulation of each age group evolves as prescribed by the Leslie matrix.\n  The added complexity changes the behavior of the model such that the\npopulation either displays roughly an exponential growth or decay. We first\nprovide an exact equation that describes a time evolution and use analytic\ntechniques to obtain an approximate growth factor. We also discuss the variants\nof the Leslie model, i.e., the complex value predator-prey model and the\ncompetitive model. We then prove the Last Species Standing theorem that\ndetermines the dominant population in the large time limit.\n  The recursive structure of the model denies the application of simple\nregression. We discuss a machine learning scheme that allows an admissible fit\nfor the population evolution of Paramecium Aurelia and Paramecium Caudatum.\nAnother potential avenue to simplify the computation is to use the machinery of\nquantum operators. We demonstrate the potential of this approach by computing\nthe Hamiltonian of a simple Leslie system.\n",
  "subjects": [
    "Quantitative Biology/Populations and Evolution"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "xeQd3rWnamAWTqx6rwqWXWPMA7ADxfy-EybtHL4AIIg",
  "pdfSize": "625365"
}