{"id":"2412.15048","title":"Surface Defects in $A$-type Little String Theories","authors":"Baptiste Filoche, Stefan Hohenegger, and Taro Kimura","authorsParsed":[["Filoche","Baptiste",""],["Hohenegger","Stefan",""],["Kimura","Taro",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 16:53:59 GMT"},{"version":"v2","created":"Mon, 3 Feb 2025 13:38:18 GMT"}],"updateDate":"2025-02-04","timestamp":1734627239000,"abstract":"  $A$-type Little String Theories (LSTs) are engineered from parallel M5-branes\non a circle $\\mathbb{S}_\\perp^1$, probing a transverse\n$\\mathbb{R}^4/\\mathbb{Z}_M$ background. Below the scale of the radius of\n$\\mathbb{S}_\\perp^1$, these theories resemble a circular quiver gauge theory\nwith $M$ nodes of gauge group $U(N)$ and matter in the bifundamental\nrepresentation (or adjoint in the case of $M=1$). In this paper, we study these\nLSTs in the presence of a surface defect, which is introduced through the\naction of a $\\mathbb{Z}_N$ orbifold that breaks the gauge groups into\n$[U(1)]^N$. We provide a combinatoric expression for the non-perturbative BPS\npartition function for this system. This form allows us to argue that a number\nof non-perturbative symmetries, that have previously been established for the\nLSTs, are preserved in the presence of the defect. Furthermore, we discuss the\nNekrasov-Shatashvili (NS) limit of the defect partition function: focusing in\ndetail on the case $(M,N)=(1,2)$, we analyse two distinct proposals made in the\nliterature. We unravel an algebraic structure that is responsible for the\ncancellation of singular terms in the NS limit, which we generalise to generic\n$(M,N)$. In view of the dualities of higher dimensional gauge theories to\nquantum many-body systems, we provide indications that our combinatoric\nexpression for the defect partition are useful in constructing and analysing\nquantum integrable systems in the future.\n","subjects":["Physics/High Energy Physics - Theory","Physics/Mathematical Physics","Mathematics/Mathematical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"DVjND9sXe-a2z-SmKCwa40P_z8brbhSlbkE3ymzkdoE","pdfSize":"580154"}