{"id":"2412.08652","title":"Twenty-Year Review of Outdoor Air Quality in Utah, USA","authors":"Callum E. Flowerday, Ryan Thalman, and Jaron C. Hansen","authorsParsed":[["Flowerday","Callum E.",""],["Thalman","Ryan",""],["Hansen","Jaron C.",""]],"versions":[{"version":"v1","created":"Tue, 26 Nov 2024 17:52:21 GMT"}],"updateDate":"2024-12-13","timestamp":1732643541000,"abstract":"  Air quality is a prevalent concern due to its imposing health risks. The\nstate of Utah, USA, has, at times over the last 20 years, experienced some of\nthe worst air quality in the nation. The propensity for Utah to experience\nelevated concentrations of particulate matter ($\\mathrm{PM_{2.5}}$) and ozone\n($\\mathrm{O_3}$) can, in part, be attributed to its unique geography, which\nfeatures dry, mountainous terrain. Valleys in Utah create ideal environments\nfor extended cold-pool events. In this review, we summarize air quality\nresearch conducted in Utah over the past 20 years (2002-2022) by dividing the\nstate into six regions: Utah Valley, Summit County, Southern Utah (regions\nsouth of Utah Valley), Cache Valley, Uinta Basin, and Salt Lake Valley. We\nreview the published literature chronologically and provide a summary for each\nregion, identifying areas where additional research is warranted. We found that\nresearch efforts are heavily weighted toward the Uinta Basin and Salt Lake\nValley, with the remaining regions collectively accounting for only 20% of\nstudies. We identified the need for more source apportionment studies,\nspeciated volatile organic compound (VOC) analyses, and ozone isopleths. Where\nozone isopleths cannot be created, measurements of glyoxal ($\\mathrm{CHOCHO}$)\nand formaldehyde ($\\mathrm{HCHO}$) concentrations could serve as cost-effective\nsurrogates to inform ozone mitigation policies.\n","subjects":["Physics/Atmospheric and Oceanic Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"iE-UARMJya0fia4XiiyROnSE62ucR7SmfZCHqS361Mw","pdfSize":"1259009"}