{"id":"2412.09277","title":"Analytical modelling for the frequency behavior of two distinct modes in\n  nano-constriction spin Hall nano-oscillator","authors":"H. Ghanatian, M. Rajabali, R. Khymyn, A. Kumar, V. H. Gonz\\'alez, H.\n  Farkhani, J.{\\AA}kerman, F. Moradi","authorsParsed":[["Ghanatian","H.",""],["Rajabali","M.",""],["Khymyn","R.",""],["Kumar","A.",""],["González","V. H.",""],["Farkhani","H.",""],["Åkerman","J.",""],["Moradi","F.",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 13:41:16 GMT"},{"version":"v2","created":"Fri, 13 Dec 2024 10:49:17 GMT"},{"version":"v3","created":"Mon, 3 Feb 2025 08:39:32 GMT"}],"updateDate":"2025-02-04","timestamp":1734010876000,"abstract":"  Nano-constriction spin-Hall nano-oscillators (NC-SHNOs) have garnered\nconsiderable interest due to their potential use as efficient and adjustable\nnano-sized sources of microwave signals, with high-frequency tunability,\nadaptable design layout, and CMOS compatibility. In order to facilitate system-\nand circuit-level designs based on the NC-SHNOs, it is essential to have an\nanalytical model capable of predicting the behavior of the NC-SHNO. In this\npaper, we introduce an analytical model to describe the frequency behavior of a\nsingle NC-SHNO in an in-plane magnetic field while considering the Oersted\nfield. The model is divided into two regions based on the direct current value:\nthe \"linear-like\" and \"bullet\" modes. Each region is characterized by distinct\nconcepts and equations. The first region, the \"linear-like mode,\" emerges from\nthe nano-constriction edges and progresses toward the center of the active area\nof the NC-SHNO. In contrast, the second regime, the localized \"bullet mode,\"\nexhibits negative nonlinearity, where increasing the current will lead to a\ndecrease in frequency. The model's validity is confirmed through experimental\ndata obtained from electrical RF measurements on a single 180nm wide NC-SHNO,\nand the model demonstrates excellent agreement with experimental data.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"1NMS6i29ZHQNqxju2yQt2R3lYgKkhIGdUnxRFbLvweU","pdfSize":"742163"}