{"id":"2412.02891","title":"OriStitch: A Machine Embroidery Workflow to Turn Existing Fabrics into\n  Self-Folding 3D Textiles","authors":"Zekun Chang, Yuta Noma, Shuo Feng, Xinyi Yang, Kazuhiro Shinoda, Tung\n  D. Ta, Koji Yatani, Tomoyuki Yokota, Takao Someya, Yoshihiro Kawahara, Koya\n  Narumi, Francois Guimbretiere, Thijs Roumen","authorsParsed":[["Chang","Zekun",""],["Noma","Yuta",""],["Feng","Shuo",""],["Yang","Xinyi",""],["Shinoda","Kazuhiro",""],["Ta","Tung D.",""],["Yatani","Koji",""],["Yokota","Tomoyuki",""],["Someya","Takao",""],["Kawahara","Yoshihiro",""],["Narumi","Koya",""],["Guimbretiere","Francois",""],["Roumen","Thijs",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 22:54:38 GMT"}],"updateDate":"2024-12-05","timestamp":1733266478000,"abstract":"  OriStitch is a computational fabrication workflow to turn existing flat\nfabrics into self-folding 3D structures. Users turn fabrics into self-folding\nsheets by machine embroidering functional threads in specific patterns on\nfabrics, and then apply heat to deform the structure into a target 3D\nstructure. OriStitch is compatible with a range of existing materials (e.g.,\nleather, woven fabric, and denim).\n  We present the design of specific embroidered hinges that fully close under\nexposure to heat. We discuss the stitch pattern design, thread and fabric\nselection, and heating conditions. To allow users to create 3D textiles using\nour hinges, we create a tool to convert 3D meshes to 2D stitch patterns\nautomatically, as well as an end-to-end fabrication and actuation workflow. To\nvalidate this workflow, we designed and fabricated a cap (303 hinges), a\nhandbag (338 hinges), and a cover for an organically shaped vase (140 hinges).\n  In technical evaluation, we found that our tool successfully converted 23/28\nmodels (textures and volumetric objects) found in related papers. We also\ndemonstrate the folding performance across different materials (suede leather,\ncork, Neoprene, and felt).\n","subjects":["Computer Science/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"pYrRepQ6VrYsAg9QJkdnhdK24wjHcVrKkv90wvQPgNE","pdfSize":"8676916"}