{"id":"2412.19326","title":"Task Preference Optimization: Improving Multimodal Large Language Models\n  with Vision Task Alignment","authors":"Ziang Yan, Zhilin Li, Yinan He, Chenting Wang, Kunchang Li, Xinhao Li,\n  Xiangyu Zeng, Zilei Wang, Yali Wang, Yu Qiao, Limin Wang, Yi Wang","authorsParsed":[["Yan","Ziang",""],["Li","Zhilin",""],["He","Yinan",""],["Wang","Chenting",""],["Li","Kunchang",""],["Li","Xinhao",""],["Zeng","Xiangyu",""],["Wang","Zilei",""],["Wang","Yali",""],["Qiao","Yu",""],["Wang","Limin",""],["Wang","Yi",""]],"versions":[{"version":"v1","created":"Thu, 26 Dec 2024 18:56:05 GMT"}],"updateDate":"2024-12-30","timestamp":1735239365000,"abstract":"  Current multimodal large language models (MLLMs) struggle with fine-grained\nor precise understanding of visuals though they give comprehensive perception\nand reasoning in a spectrum of vision applications. Recent studies either\ndevelop tool-using or unify specific visual tasks into the autoregressive\nframework, often at the expense of overall multimodal performance. To address\nthis issue and enhance MLLMs with visual tasks in a scalable fashion, we\npropose Task Preference Optimization (TPO), a novel method that utilizes\ndifferentiable task preferences derived from typical fine-grained visual tasks.\nTPO introduces learnable task tokens that establish connections between\nmultiple task-specific heads and the MLLM. By leveraging rich visual labels\nduring training, TPO significantly enhances the MLLM's multimodal capabilities\nand task-specific performance. Through multi-task co-training within TPO, we\nobserve synergistic benefits that elevate individual task performance beyond\nwhat is achievable through single-task training methodologies. Our\ninstantiation of this approach with VideoChat and LLaVA demonstrates an overall\n14.6% improvement in multimodal performance compared to baseline models.\nAdditionally, MLLM-TPO demonstrates robust zero-shot capabilities across\nvarious tasks, performing comparably to state-of-the-art supervised models. The\ncode will be released at https://github.com/OpenGVLab/TPO\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"vq4nQpM7_86OzC5JTeEuOpBgf_N2neT4ZvBbZ1jgsdw","pdfSize":"7021664"}