{"id":"2412.06610","title":"MRI-based Head and Neck Tumor Segmentation Using nnU-Net with 15-fold\n  Cross-Validation Ensemble","authors":"Frank N. Mol, Luuk van der Hoek, Baoqiang Ma, Bharath Chowdhary Nagam,\n  Nanna M. Sijtsema, Lisanne V. van Dijk, Kerstin Bunte, Rifka Vlijm, Peter\n  M.A. van Ooijen","authorsParsed":[["Mol","Frank N.",""],["van der Hoek","Luuk",""],["Ma","Baoqiang",""],["Nagam","Bharath Chowdhary",""],["Sijtsema","Nanna M.",""],["van Dijk","Lisanne V.",""],["Bunte","Kerstin",""],["Vlijm","Rifka",""],["van Ooijen","Peter M. A.",""]],"versions":[{"version":"v1","created":"Mon, 9 Dec 2024 16:01:54 GMT"}],"updateDate":"2024-12-10","timestamp":1733760114000,"abstract":"  The superior soft tissue differentiation provided by MRI may enable more\naccurate tumor segmentation compared to CT and PET, potentially enhancing\nadaptive radiotherapy treatment planning. The Head and Neck Tumor Segmentation\nfor MR-Guided Applications challenge (HNTSMRG-24) comprises two tasks:\nsegmentation of primary gross tumor volume (GTVp) and metastatic lymph nodes\n(GTVn) on T2-weighted MRI volumes obtained at (1) pre-radiotherapy (pre-RT) and\n(2) mid-radiotherapy (mid-RT). The training dataset consists of data from 150\npatients, including MRI volumes of pre-RT, mid-RT, and pre-RT registered to the\ncorresponding mid-RT volumes. Each MRI volume is accompanied by a label mask,\ngenerated by merging independent annotations from a minimum of three experts.\nFor both tasks, we propose adopting the nnU-Net V2 framework by the use of a\n15-fold cross-validation ensemble instead of the standard number of 5 folds for\nincreased robustness and variability. For pre-RT segmentation, we augmented the\ninitial training data (150 pre-RT volumes and masks) with the corresponding\nmid-RT data. For mid-RT segmentation, we opted for a three-channel input,\nwhich, in addition to the mid-RT MRI volume, comprises the registered pre-RT\nMRI volume and the corresponding mask. The mean of the aggregated Dice\nSimilarity Coefficient for GTVp and GTVn is computed on a blind test set and\ndetermines the quality of the proposed methods. These metrics determine the\nfinal ranking of methods for both tasks separately. The final blind testing (50\npatients) of the methods proposed by our team, RUG_UMCG, resulted in an\naggregated Dice Similarity Coefficient of 0.81 (0.77 for GTVp and 0.85 for\nGTVn) for Task 1 and 0.70 (0.54 for GTVp and 0.86 for GTVn) for Task 2.\n","subjects":["Physics/Medical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Vo-ubvuyYejPraK3pJCaPYPKd7TzmCm2UGdm_vUnUDc","pdfSize":"3724472"}