{"id":"2412.10038","title":"Stochastic Variational Inference for Structured Additive Distributional\n  Regression","authors":"Gianmarco Callegher, Thomas Kneib, Johannes S\\\"oding, Paul Wiemann","authorsParsed":[["Callegher","Gianmarco",""],["Kneib","Thomas",""],["Söding","Johannes",""],["Wiemann","Paul",""]],"versions":[{"version":"v1","created":"Fri, 13 Dec 2024 10:59:28 GMT"},{"version":"v2","created":"Wed, 5 Feb 2025 09:40:05 GMT"}],"updateDate":"2025-02-06","timestamp":1734087568000,"abstract":"  In structured additive distributional regression, the conditional\ndistribution of the response variables given the covariate information and the\nvector of model parameters is modelled using a P-parametric probability density\nfunction where each parameter is modelled through a linear predictor and a\nbijective response function that maps the domain of the predictor into the\ndomain of the parameter. We present a method to perform inference in structured\nadditive distributional regression using stochastic variational inference. We\npropose two strategies for constructing a multivariate Gaussian variational\ndistribution to estimate the posterior distribution of the regression\ncoefficients. The first strategy leverages covariate information and\nhyperparameters to learn both the location vector and the precision matrix. The\nsecond strategy tackles the complexity challenges of the first by initially\nassuming independence among all smooth terms and then introducing correlations\nthrough an additional set of variational parameters. Furthermore, we present\ntwo approaches for estimating the smoothing parameters. The first treats them\nas free parameters and provides point estimates, while the second accounts for\nuncertainty by applying a variational approximation to the posterior\ndistribution. Our model was benchmarked against state-of-the-art competitors in\nlogistic and gamma regression simulation studies. Finally, we validated our\napproach by comparing its posterior estimates to those obtained using Markov\nChain Monte Carlo on a dataset of patents from the biotechnology/pharmaceutics\nand semiconductor/computer sectors.\n","subjects":["Statistics/Computation"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"obw2OrRCXr--bbZR4N7PTLK99YC2zcQfLm5Qnm9zbKs","pdfSize":"2838588"}