{"id":"2412.04571","title":"Dissociating Artificial Intelligence from Artificial Consciousness","authors":"Graham Findlay, William Marshall, Larissa Albantakis, Isaac David,\n  William GP Mayner, Christof Koch, Giulio Tononi","authorsParsed":[["Findlay","Graham",""],["Marshall","William",""],["Albantakis","Larissa",""],["David","Isaac",""],["Mayner","William GP",""],["Koch","Christof",""],["Tononi","Giulio",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 19:28:35 GMT"}],"updateDate":"2024-12-09","timestamp":1733426915000,"abstract":"  Developments in machine learning and computing power suggest that artificial\ngeneral intelligence is within reach. This raises the question of artificial\nconsciousness: if a computer were to be functionally equivalent to a human,\nbeing able to do all we do, would it experience sights, sounds, and thoughts,\nas we do when we are conscious? Answering this question in a principled manner\ncan only be done on the basis of a theory of consciousness that is grounded in\nphenomenology and that states the necessary and sufficient conditions for any\nsystem, evolved or engineered, to support subjective experience. Here we employ\nIntegrated Information Theory (IIT), which provides principled tools to\ndetermine whether a system is conscious, to what degree, and the content of its\nexperience. We consider pairs of systems constituted of simple Boolean units,\none of which -- a basic stored-program computer -- simulates the other with\nfull functional equivalence. By applying the principles of IIT, we demonstrate\nthat (i) two systems can be functionally equivalent without being phenomenally\nequivalent, and (ii) that this conclusion is not dependent on the simulated\nsystem's function. We further demonstrate that, according to IIT, it is\npossible for a digital computer to simulate our behavior, possibly even by\nsimulating the neurons in our brain, without replicating our experience. This\ncontrasts sharply with computational functionalism, the thesis that performing\ncomputations of the right kind is necessary and sufficient for consciousness.\n","subjects":["Computer Science/Artificial Intelligence","Computer Science/Computers and Society","Quantitative Biology/Neurons and Cognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"QzfdrP1zZNYqvugYWxKFlnHN-fYY7QpubL6dsRyhEoU","pdfSize":"9766731"}