{"id":"2412.09165","title":"When Text Embedding Meets Large Language Model: A Comprehensive Survey","authors":"Zhijie Nie, Zhangchi Feng, Mingxin Li, Cunwang Zhang, Yanzhao Zhang,\n  Dingkun Long, Richong Zhang","authorsParsed":[["Nie","Zhijie",""],["Feng","Zhangchi",""],["Li","Mingxin",""],["Zhang","Cunwang",""],["Zhang","Yanzhao",""],["Long","Dingkun",""],["Zhang","Richong",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 10:50:26 GMT"}],"updateDate":"2024-12-13","timestamp":1734000626000,"abstract":"  Text embedding has become a foundational technology in natural language\nprocessing (NLP) during the deep learning era, driving advancements across a\nwide array of downstream tasks. While many natural language understanding\nchallenges can now be modeled using generative paradigms and leverage the\nrobust generative and comprehension capabilities of large language models\n(LLMs), numerous practical applications, such as semantic matching, clustering,\nand information retrieval, continue to rely on text embeddings for their\nefficiency and effectiveness. In this survey, we categorize the interplay\nbetween LLMs and text embeddings into three overarching themes: (1)\nLLM-augmented text embedding, enhancing traditional embedding methods with\nLLMs; (2) LLMs as text embedders, utilizing their innate capabilities for\nembedding generation; and (3) Text embedding understanding with LLMs,\nleveraging LLMs to analyze and interpret embeddings. By organizing these\nefforts based on interaction patterns rather than specific downstream\napplications, we offer a novel and systematic overview of contributions from\nvarious research and application domains in the era of LLMs. Furthermore, we\nhighlight the unresolved challenges that persisted in the pre-LLM era with\npre-trained language models (PLMs) and explore the emerging obstacles brought\nforth by LLMs. Building on this analysis, we outline prospective directions for\nthe evolution of text embedding, addressing both theoretical and practical\nopportunities in the rapidly advancing landscape of NLP.\n","subjects":["Computer Science/Computation and Language","Computer Science/Artificial Intelligence","Computer Science/Information Retrieval"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"BMc6wZ9SmfK5RD0Rx4gU483gafXD36OEuqU4b5wf8xE","pdfSize":"1757513"}