{
  "id": "2412.04082",
  "title": "Learnable Similarity and Dissimilarity Guided Symmetric Non-Negative\n  Matrix Factorization",
  "authors": "Wenlong Lyu and Yuheng Jia",
  "authorsParsed": [
    [
      "Lyu",
      "Wenlong",
      ""
    ],
    [
      "Jia",
      "Yuheng",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 11:32:53 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733398373000,
  "abstract": "  Symmetric nonnegative matrix factorization (SymNMF) is a powerful tool for\nclustering, which typically uses the $k$-nearest neighbor ($k$-NN) method to\nconstruct similarity matrix. However, $k$-NN may mislead clustering since the\nneighbors may belong to different clusters, and its reliability generally\ndecreases as $k$ grows. In this paper, we construct the similarity matrix as a\nweighted $k$-NN graph with learnable weight that reflects the reliability of\neach $k$-th NN. This approach reduces the search space of the similarity matrix\nlearning to $n - 1$ dimension, as opposed to the $\\mathcal{O}(n^2)$ dimension\nof existing methods, where $n$ represents the number of samples. Moreover, to\nobtain a discriminative similarity matrix, we introduce a dissimilarity matrix\nwith a dual structure of the similarity matrix, and propose a new form of\northogonality regularization with discussions on its geometric interpretation\nand numerical stability. An efficient alternative optimization algorithm is\ndesigned to solve the proposed model, with theoretically guarantee that the\nvariables converge to a stationary point that satisfies the KKT conditions. The\nadvantage of the proposed model is demonstrated by the comparison with nine\nstate-of-the-art clustering methods on eight datasets. The code is available at\n\\url{https://github.com/lwl-learning/LSDGSymNMF}.\n",
  "subjects": [
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "LEl3tIYNzv57oKqs2K_Zrt22kn7xzX1vsetrEkZqsTw",
  "pdfSize": "4373289"
}