{"id":"2412.18240","title":"Calculations of some doping nanostructurations and patterns improving\n  the functionality of high-temperature superconductors for bolometer device\n  applications","authors":"J.C. Verde, A.S. Viz, M.M. Botana, C. Montero-Orille, M.V. Ramallo","authorsParsed":[["Verde","J. C.",""],["Viz","A. S.",""],["Botana","M. M.",""],["Montero-Orille","C.",""],["Ramallo","M. V.",""]],"versions":[{"version":"v1","created":"Tue, 24 Dec 2024 07:51:28 GMT"}],"updateDate":"2024-12-25","timestamp":1735026688000,"abstract":"  We calculate the effects of doping nanostructuration and the patterning of\nthin films of high-temperature superconductors (HTS) with the aim of optimizing\ntheir functionality as sensing materials for resistive transition-edge\nbolometer devices (TES). We focus, in particular, on spatial variations of the\ncarrier doping into the CuO$_2$ layers due to oxygen off-stoichiometry, (that\ninduce, in turn, critical temperature variations) and explore following two\nmajor cases of such structurations: First, the random nanoscale disorder\nintrinsically associated to doping levels that do not maximize the\nsuperconducting critical temperature; our studies suggest that this first\nsimple structuration already improves some of the bolometric operational\nparameters with respect to the conventional, nonstructured HTS materials used\nuntil now. Secondly, we consider the imposition of regular arrangements of\nzones with different nominal doping levels (patterning); we find that such\nregular patterns may improve the bolometer performance even further. We find\none design that improves, with respect to nonstructured HTS materials, both the\nsaturation power and the operating temperature width by more than one order of\nmagnitude. It also almost doubles the response of the sensor to radiation.\n","subjects":["Condensed Matter/Superconductivity"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"rRSvsT-6MTuDRvY1CsDPUvv-wsx7HaTfi5bNhf8bfAc","pdfSize":"708331"}