{"id":"2412.08927","title":"Estimating excess mortality during the Covid-19 pandemic in Aotearoa New\n  Zealand","authors":"Michael John Plank, Pubudu Senanayake, Richard Lyon","authorsParsed":[["Plank","Michael John",""],["Senanayake","Pubudu",""],["Lyon","Richard",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 04:30:19 GMT"}],"updateDate":"2024-12-13","timestamp":1733977819000,"abstract":"  Background. The excess mortality rate in Aotearoa New Zealand during the\nCovid-19 pandemic is frequently estimated to be among the lowest in the world.\nHowever, to facilitate international comparisons, many of the methods that have\nbeen used to estimate excess mortality do not use age-stratified data on deaths\nand population size, which may compromise their accuracy.\n  Methods. We used a quasi-Poisson regression model for monthly all-cause\ndeaths among New Zealand residents, controlling for age, sex and seasonality.\nWe fitted the model to deaths data for 2014-19. We estimated monthly excess\nmortality for 2020-23 as the difference between actual deaths and projected\ndeaths according to the model. We conducted sensitivity analysis on the length\nof the pre-pandemic period used to fit the model. We benchmarked our results\nagainst a simple linear regression on the standardised annual mortality rate.\n  Results. We estimated cumulative excess mortality in New Zealand in 2020-23\nwas 1040 (95% confidence interval [-1134, 2927]), equivalent to 0.7% [-0.8%,\n2.0%] of expected mortality. Excess mortality was negative in 2020-21. The\nmagnitude, timing and age-distribution of the positive excess mortality in\n2022-23 were closely matched with confirmed Covid-19 deaths.\n  Conclusions. Negative excess mortality in 2020-21 reflects very low levels of\nCovid-19 and major reductions in seasonal respiratory diseases during this\nperiod. In 2022-23, Covid-19 deaths were the main contributor to excess\nmortality and there was little or no net non-Covid-19 excess. Overall, New\nZealand experienced one of the lowest rates of pandemic excess mortality in the\nworld.\n","subjects":["Statistics/Applications","Quantitative Biology/Populations and Evolution"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"AHtXyo1spLxi8MmxirTIjW5ms-yOTLxYV96ndQHBbrA","pdfSize":"528784"}