{
  "id": "2412.02980",
  "title": "Surveying the Effects of Quality, Diversity, and Complexity in Synthetic\n  Data From Large Language Models",
  "authors": "Alex Havrilla, Andrew Dai, Laura O'Mahony, Koen Oostermeijer, Vera\n  Zisler, Alon Albalak, Fabrizio Milo, Sharath Chandra Raparthy, Kanishk\n  Gandhi, Baber Abbasi, Duy Phung, Maia Iyer, Dakota Mahan, Chase Blagden,\n  Srishti Gureja, Mohammed Hamdy, Wen-Ding Li, Giovanni Paolini, Pawan Sasanka\n  Ammanamanchi, Elliot Meyerson",
  "authorsParsed": [
    [
      "Havrilla",
      "Alex",
      ""
    ],
    [
      "Dai",
      "Andrew",
      ""
    ],
    [
      "O'Mahony",
      "Laura",
      ""
    ],
    [
      "Oostermeijer",
      "Koen",
      ""
    ],
    [
      "Zisler",
      "Vera",
      ""
    ],
    [
      "Albalak",
      "Alon",
      ""
    ],
    [
      "Milo",
      "Fabrizio",
      ""
    ],
    [
      "Raparthy",
      "Sharath Chandra",
      ""
    ],
    [
      "Gandhi",
      "Kanishk",
      ""
    ],
    [
      "Abbasi",
      "Baber",
      ""
    ],
    [
      "Phung",
      "Duy",
      ""
    ],
    [
      "Iyer",
      "Maia",
      ""
    ],
    [
      "Mahan",
      "Dakota",
      ""
    ],
    [
      "Blagden",
      "Chase",
      ""
    ],
    [
      "Gureja",
      "Srishti",
      ""
    ],
    [
      "Hamdy",
      "Mohammed",
      ""
    ],
    [
      "Li",
      "Wen-Ding",
      ""
    ],
    [
      "Paolini",
      "Giovanni",
      ""
    ],
    [
      "Ammanamanchi",
      "Pawan Sasanka",
      ""
    ],
    [
      "Meyerson",
      "Elliot",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 02:47:45 GMT"
    },
    {
      "version": "v2",
      "created": "Mon, 9 Dec 2024 22:23:41 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733280465000,
  "abstract": "  Synthetic data generation with Large Language Models is a promising paradigm\nfor augmenting natural data over a nearly infinite range of tasks. Given this\nvariety, direct comparisons among synthetic data generation algorithms are\nscarce, making it difficult to understand where improvement comes from and what\nbottlenecks exist. We propose to evaluate algorithms via the makeup of\nsynthetic data generated by each algorithm in terms of data quality, diversity,\nand complexity. We choose these three characteristics for their significance in\nopen-ended processes and the impact each has on the capabilities of downstream\nmodels. We find quality to be essential for in-distribution model\ngeneralization, diversity to be essential for out-of-distribution\ngeneralization, and complexity to be beneficial for both. Further, we emphasize\nthe existence of Quality-Diversity trade-offs in training data and the\ndownstream effects on model performance. We then examine the effect of various\ncomponents in the synthetic data pipeline on each data characteristic. This\nexamination allows us to taxonomize and compare synthetic data generation\nalgorithms through the components they utilize and the resulting effects on\ndata QDC composition. This analysis extends into a discussion on the importance\nof balancing QDC in synthetic data for efficient reinforcement learning and\nself-improvement algorithms. Analogous to the QD trade-offs in training data,\noften there exist trade-offs between model output quality and output diversity\nwhich impact the composition of synthetic data. We observe that many models are\ncurrently evaluated and optimized only for output quality, thereby limiting\noutput diversity and the potential for self-improvement. We argue that\nbalancing these trade-offs is essential to the development of future\nself-improvement algorithms and highlight a number of works making progress in\nthis direction.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Computation and Language"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "6qbx8cEvqT3gKOqQJF4BHYPUgW91Vk8RK1fZujZ_X9k",
  "pdfSize": "6262261"
}