{"id":"2412.20131","title":"A finite strain model for fiber angle plasticity of textile fabrics\n  based on isogeometric shell finite elements","authors":"Thang Xuan Duong and Roger Andrew Sauer","authorsParsed":[["Duong","Thang Xuan",""],["Sauer","Roger Andrew",""]],"versions":[{"version":"v1","created":"Sat, 28 Dec 2024 12:35:16 GMT"}],"updateDate":"2024-12-31","timestamp":1735389316000,"abstract":"  This work presents a shear elastoplasticity model for textile fabrics within\nthe theoretical framework of anisotropic Kirchhoff-Love shells with bending of\nembedded fibers proposed by Duong et al. (2023). The plasticity model aims at\ncapturing the rotational inter-ply frictional sliding between fiber families in\ntextile composites undergoing large deformation. Such effects are usually\ndominant in dry textile fabrics such as woven and non-crimp fabrics. The model\nexplicitly uses relative angles between fiber families as strain measures for\nthe kinematics. The plasticity model is formulated directly with surface\ninvariants without resorting to thickness integration. Motivated by\nexperimental observations from the picture frame test, a yield function is\nproposed with isotropic hardening and a simple evolution equation. A classical\nreturn mapping algorithm is employed to solve the elastoplastic problem within\nthe isogeometric finite shell element formulation of Duong et al. (2022). The\nverification of the implementation is facilitated by the analytical solution\nfor the picture frame test. The proposed plasticity model is calibrated from\nthe picture frame test and is then validated by the bias extension test,\nconsidering available experimental data for different samples from the\nliterature. Good agreement between model prediction and experimental data is\nobtained. Finally, the applicability of the elastoplasticity model to 3D shell\nproblems is demonstrated.\n","subjects":["Computer Science/Computational Engineering, Finance, and Science"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"5PQpramjclgxYpM1eR9r2GjqjkRDtQx-zdOxJG3Itfs","pdfSize":"10710485"}