{
  "id": "2412.13554",
  "title": "An XAI Social Media Platform for Teaching K-12 Students AI-Driven\n  Profiling, Clustering, and Engagement-Based Recommending",
  "authors": "Nicolas Pope, Juho Kahila, Henriikka Vartiainen, Mohammed Saqr,\n  Sonsoles Lopez-Pernas, Teemu Roos, Jari Laru, Matti Tedre",
  "authorsParsed": [
    [
      "Pope",
      "Nicolas",
      ""
    ],
    [
      "Kahila",
      "Juho",
      ""
    ],
    [
      "Vartiainen",
      "Henriikka",
      ""
    ],
    [
      "Saqr",
      "Mohammed",
      ""
    ],
    [
      "Lopez-Pernas",
      "Sonsoles",
      ""
    ],
    [
      "Roos",
      "Teemu",
      ""
    ],
    [
      "Laru",
      "Jari",
      ""
    ],
    [
      "Tedre",
      "Matti",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 07:10:45 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734505845000,
  "abstract": "  This paper, submitted to the special track on resources for teaching AI in\nK-12, presents an explainable AI (XAI) education tool designed for K-12\nclassrooms, particularly for students in grades 4-9. The tool was designed for\ninterventions on the fundamental processes behind social media platforms,\nfocusing on four AI- and data-driven core concepts: data collection, user\nprofiling, engagement metrics, and recommendation algorithms. An Instagram-like\ninterface and a monitoring tool for explaining the data-driven processes make\nthese complex ideas accessible and engaging for young learners. The tool\nprovides hands-on experiments and real-time visualizations, illustrating how\nuser actions influence both their personal experience on the platform and the\nexperience of others. This approach seeks to enhance learners' data agency, AI\nliteracy, and sensitivity to AI ethics. The paper includes a case example from\n12 two-hour test sessions involving 209 children, using learning analytics to\ndemonstrate how they navigated their social media feeds and the browsing\npatterns that emerged.\n",
  "subjects": [
    "Computer Science/Computers and Society"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "QfcvsygmJ8OCV5PJyn8NYfJ80WOCP0vHlvUeK2f-PR0",
  "pdfSize": "6687639"
}