{
  "id": "2412.00533",
  "title": "Maintaining reliability while navigating unprecedented uncertainty: a\n  synthesis of and guide to advances in electric sector resource adequacy",
  "authors": "Gabriel Mantegna, Ziting Huang, Guillaume Van Caelenberg, Bethany\n  Frew, Muireann Lynch, Mark O'Malley",
  "authorsParsed": [
    [
      "Mantegna",
      "Gabriel",
      ""
    ],
    [
      "Huang",
      "Ziting",
      ""
    ],
    [
      "Van Caelenberg",
      "Guillaume",
      ""
    ],
    [
      "Frew",
      "Bethany",
      ""
    ],
    [
      "Lynch",
      "Muireann",
      ""
    ],
    [
      "O'Malley",
      "Mark",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 30 Nov 2024 16:51:53 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1732985513000,
  "abstract": "  The reliability of the electric grid has in recent years become a larger\nconcern for regulators, planners, and consumers due to several high-impact\noutage events, as well as the potential for even more impactful events in the\nfuture. These concerns are largely the result of decades-old resource adequacy\n(RA) planning frameworks being insufficiently adapted to the current types of\nuncertainty faced by planners, including many sources of deep uncertainty for\nwhich probability distributions cannot be defensibly assigned. There are\nemerging methodologies for dealing with these new types of uncertainty in RA\nassessment and procurement frameworks, but their adoption has been hindered by\nthe lack of consistent understanding of terminology related to RA and the\nrelated concept of resilience, as well as a lack of syntheses of such available\nmethodologies. Here we provide an overview of RA and its relationship to\nresilience, a summary of available methods for dealing with emerging types of\nuncertainty faced by RA assessment, and an an overview of procurement\nmethodologies for operationalizing RA in the context of these types of\nuncertainty. This paper provides a synthesis and guide for both researchers and\npractitioners seeking to navigate a new, much more uncertain era of power\nsystem planning.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Systems and Control",
    "Computer Science/Systems and Control"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "AsJdH5tZj0bSiKWxkptPbdusvsCG1GEcS5mTUtb9ozA",
  "pdfSize": "1407943"
}