{"id":"2412.04755","title":"Latent Space Characterization of Autoencoder Variants","authors":"Anika Shrivastava, Renu Rameshan, Samar Agnihotri","authorsParsed":[["Shrivastava","Anika",""],["Rameshan","Renu",""],["Agnihotri","Samar",""]],"versions":[{"version":"v1","created":"Fri, 6 Dec 2024 03:40:21 GMT"},{"version":"v2","created":"Thu, 16 Jan 2025 14:44:39 GMT"}],"updateDate":"2025-01-17","timestamp":1733456421000,"abstract":"  Understanding the latent spaces learned by deep learning models is crucial in\nexploring how they represent and generate complex data. Autoencoders (AEs) have\nplayed a key role in the area of representation learning, with numerous\nregularization techniques and training principles developed not only to enhance\ntheir ability to learn compact and robust representations, but also to reveal\nhow different architectures influence the structure and smoothness of the\nlower-dimensional non-linear manifold. We strive to characterize the structure\nof the latent spaces learned by different autoencoders including convolutional\nautoencoders (CAEs), denoising autoencoders (DAEs), and variational\nautoencoders (VAEs) and how they change with the perturbations in the input. By\ncharacterizing the matrix manifolds corresponding to the latent spaces, we\nprovide an explanation for the well-known observation that the latent spaces of\nCAE and DAE form non-smooth manifolds, while that of VAE forms a smooth\nmanifold. We also map the points of the matrix manifold to a Hilbert space\nusing distance preserving transforms and provide an alternate view in terms of\nthe subspaces generated in the Hilbert space as a function of the distortion in\nthe input. The results show that the latent manifolds of CAE and DAE are\nstratified with each stratum being a smooth product manifold, while the\nmanifold of VAE is a smooth product manifold of two symmetric positive definite\nmatrices and a symmetric positive semi-definite matrix.\n","subjects":["Computer Science/Machine Learning","Computer Science/Computer Vision and Pattern Recognition","Computer Science/Information Theory","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"YYFbukp7cTZMg11CTLkWVlMIgtcHYuy3V34UykGjTds","pdfSize":"7355593"}