{
  "id": "2412.11268",
  "title": "Complex investigations of an active star-formation region in southern\n  part of Mon R2",
  "authors": "T.A. Movsessian, J. Bally, T.Yu. Magakian and A.V. Moiseev",
  "authorsParsed": [
    [
      "Movsessian",
      "T. A.",
      ""
    ],
    [
      "Bally",
      "J.",
      ""
    ],
    [
      "Magakian",
      "T. Yu.",
      ""
    ],
    [
      "Moiseev",
      "A. V.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 15 Dec 2024 18:15:43 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734286543000,
  "abstract": "  We continue to present the results of a Byurakan Narrow Band Imaging Survey\n(BNBIS). In this work we present the results of the search and further detailed\ninvestigation of the objects, found in the course of the BNBIS survey in the\nsouthern part of the Mon R2 association. For the search of HH objects the\nnarrow band images, obtained with the 1-m Schmidt telescope of the Byurakan\nObservatory, were used. Newly found objects were imaged in optical and near-IR\nrange with the Apache Point Observatory 3.5 meter telescope, and observed\nspectrally with long-slit spectrograph and scanning Fabry-Perot interferometer\non 6 m telescope of Special Astrophysical Observatory of the Russian Academy of\nSciences using SCORPIO-2. We found three new HH groups: HH 1233, HH 1234 and HH\n1235, two of them represent extended collimated flows. HH 1233 is the C-shape\nbipolar outflow system associated with the 2MASS 06084223$-$0657385 source\nstar. HH 1234 is the helical chain of HH knots near the star V963 Mon. HH 1235\nis a separate compact knot, connected with the visible only in mid- and far-IR\nsource WISE J060856.57$-$070103.5. We found also several molecular hydrogen\noutflows, one of which coincides with HH 1233 and two other are associated with\nthe deeply embedded IR sources in the same field. One more probable bipolar\nH$_2$ outflow is related to WISE J060856.57$-$070103.5. The emission spectra\nand spectral energy distributions of the source stars were analyzed. According\nto them they should be under rather early evolutional stage.\n",
  "subjects": [
    "Astrophysics/Solar and Stellar Astrophysics",
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "4SyWKbUgolm45KJCQCaGCcuOcx4tEUqmzYg7XwT7upk",
  "pdfSize": "4776850"
}