{"id":"2412.04634","title":"Neural Two-Level Monte Carlo Real-Time Rendering","authors":"Mikhail Dereviannykh, Dmitrii Klepikov, Johannes Hanika, Carsten\n  Dachsbacher","authorsParsed":[["Dereviannykh","Mikhail",""],["Klepikov","Dmitrii",""],["Hanika","Johannes",""],["Dachsbacher","Carsten",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 22:06:23 GMT"}],"updateDate":"2024-12-09","timestamp":1733436383000,"abstract":"  We introduce an efficient Two-Level Monte Carlo (subset of Multi-Level Monte\nCarlo, MLMC) estimator for real-time rendering of scenes with global\nillumination. Using MLMC we split the shading integral into two parts: the\nradiance cache integral and the residual error integral that compensates for\nthe bias of the first one. For the first part, we developed the Neural Incident\nRadiance Cache (NIRC) leveraging the power of fully-fused tiny neural networks\nas a building block, which is trained on the fly. The cache is designed to\nprovide a fast and reasonable approximation of the incident radiance: an\nevaluation takes 2-25x less compute time than a path tracing sample. This\nenables us to estimate the radiance cache integral with a high number of\nsamples and by this achieve faster convergence. For the residual error\nintegral, we compute the difference between the NIRC predictions and the\nunbiased path tracing simulation. Our method makes no assumptions about the\ngeometry, materials, or lighting of a scene and has only few intuitive\nhyper-parameters. We provide a comprehensive comparative analysis in different\nexperimental scenarios. Since the algorithm is trained in an on-line fashion,\nit demonstrates significant noise level reduction even for dynamic scenes and\ncan easily be combined with other importance sampling schemes and noise\nreduction techniques.\n","subjects":["Computer Science/Graphics","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"HtklNPZiI6g0OFke9dNa5QJAJlNbf6d3D9p6oNkMpRY","pdfSize":"42653494"}