{"id":"2412.15453","title":"Northeastern Uni at Multilingual Counterspeech Generation: Enhancing\n  Counter Speech Generation with LLM Alignment through Direct Preference\n  Optimization","authors":"Sahil Wadhwa, Chengtian Xu, Haoming Chen, Aakash Mahalingam, Akankshya\n  Kar, Divya Chaudhary","authorsParsed":[["Wadhwa","Sahil",""],["Xu","Chengtian",""],["Chen","Haoming",""],["Mahalingam","Aakash",""],["Kar","Akankshya",""],["Chaudhary","Divya",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 23:22:11 GMT"}],"updateDate":"2024-12-23","timestamp":1734650531000,"abstract":"  The automatic generation of counter-speech (CS) is a critical strategy for\naddressing hate speech by providing constructive and informed responses.\nHowever, existing methods often fail to generate high-quality, impactful, and\nscalable CS, particularly across diverse linguistic contexts. In this paper, we\npropose a novel methodology to enhance CS generation by aligning Large Language\nModels (LLMs) using Supervised Fine-Tuning (SFT) and Direct Preference\nOptimization (DPO). Our approach leverages DPO to align LLM outputs with human\npreferences, ensuring contextually appropriate and linguistically adaptable\nresponses. Additionally, we incorporate knowledge grounding to enhance the\nfactual accuracy and relevance of generated CS. Experimental results\ndemonstrate that DPO-aligned models significantly outperform SFT baselines on\nCS benchmarks while scaling effectively to multiple languages. These findings\nhighlight the potential of preference-based alignment techniques to advance CS\ngeneration across varied linguistic settings. The model supervision and\nalignment is done in English and the same model is used for reporting metrics\nacross other languages like Basque, Italian, and Spanish.\n","subjects":["Computer Science/Computation and Language","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"tWT8vEUTazLYaMlc4EhayO8ssaDuOapl6XmQtd0BZJ8","pdfSize":"227947"}