{
  "id": "2412.07712",
  "title": "Access to care improves EHR reliability and clinical risk prediction\n  model performance",
  "authors": "Anna Zink, Hongzhou Luan, Irene Y. Chen",
  "authorsParsed": [
    [
      "Zink",
      "Anna",
      ""
    ],
    [
      "Luan",
      "Hongzhou",
      ""
    ],
    [
      "Chen",
      "Irene Y.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 18:00:53 GMT"
    },
    {
      "version": "v2",
      "created": "Fri, 13 Dec 2024 22:46:36 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1733853653000,
  "abstract": "  Disparities in access to healthcare have been well-documented in the United\nStates, but their effects on electronic health record (EHR) data reliability\nand resulting clinical models are poorly understood. Using an All of Us dataset\nof 134,513 participants, we investigate the effects of access to care on the\nmedical machine learning pipeline, including medical condition rates, data\nquality, outcome label accuracy, and prediction performance. Our findings\nreveal that patients with cost constrained or delayed care have worse EHR\nreliability as measured by patient self-reported conditions for 78% of examined\nmedical conditions. We demonstrate in a prediction task of Type II diabetes\nincidence that clinical risk predictive performance can be worse for patients\nwithout standard care, with balanced accuracy gaps of 3.6 and sensitivity gaps\nof 9.4 percentage points for those with cost-constrained or delayed care. We\nevaluate solutions to mitigate these disparities and find that including\npatient self-reported conditions improved performance for patients with lower\naccess to care, with 11.2 percentage points higher sensitivity, effectively\ndecreasing the performance gap between standard versus delayed or\ncost-constrained care. These findings provide the first large-scale evidence\nthat healthcare access systematically affects both data reliability and\nclinical prediction performance. By revealing how access barriers propagate\nthrough the medical machine learning pipeline, our work suggests that improving\nmodel equity requires addressing both data collection biases and algorithmic\nlimitations. More broadly, this analysis provides an empirical foundation for\ndeveloping clinical prediction systems that work effectively for all patients,\nregardless of their access to care.\n",
  "subjects": [
    "Computer Science/Computers and Society"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "MqMCvK9xKtinwsWQTOLTBmGmIKvn12mKoOrLZvPX14k",
  "pdfSize": "1197025"
}