{
  "id": "2412.16778",
  "title": "RoomPainter: View-Integrated Diffusion for Consistent Indoor Scene\n  Texturing",
  "authors": "Zhipeng Huang, Wangbo Yu, Xinhua Cheng, ChengShu Zhao, Yunyang Ge,\n  Mingyi Guo, Li Yuan and Yonghong Tian",
  "authorsParsed": [
    [
      "Huang",
      "Zhipeng",
      ""
    ],
    [
      "Yu",
      "Wangbo",
      ""
    ],
    [
      "Cheng",
      "Xinhua",
      ""
    ],
    [
      "Zhao",
      "ChengShu",
      ""
    ],
    [
      "Ge",
      "Yunyang",
      ""
    ],
    [
      "Guo",
      "Mingyi",
      ""
    ],
    [
      "Yuan",
      "Li",
      ""
    ],
    [
      "Tian",
      "Yonghong",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 21 Dec 2024 21:22:01 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734816121000,
  "abstract": "  Indoor scene texture synthesis has garnered significant interest due to its\nimportant potential applications in virtual reality, digital media, and\ncreative arts. Existing diffusion model-based researches either rely on\nper-view inpainting techniques, which are plagued by severe cross-view\ninconsistencies and conspicuous seams, or they resort to optimization-based\napproaches that entail substantial computational overhead. In this work, we\npresent RoomPainter, a framework that seamlessly integrates efficiency and\nconsistency to achieve high-fidelity texturing of indoor scenes. The core of\nRoomPainter features a zero-shot technique that effectively adapts a 2D\ndiffusion model for 3D-consistent texture synthesis, along with a two-stage\ngeneration strategy that ensures both global and local consistency.\nSpecifically, we introduce Attention-Guided Multi-View Integrated Sampling\n(MVIS) combined with a neighbor-integrated attention mechanism for zero-shot\ntexture map generation. Using the MVIS, we firstly generate texture map for the\nentire room to ensure global consistency, then adopt its variant, namely an\nattention-guided multi-view integrated repaint sampling (MVRS) to repaint\nindividual instances within the room, thereby further enhancing local\nconsistency. Experiments demonstrate that RoomPainter achieves superior\nperformance for indoor scene texture synthesis in visual quality, global\nconsistency, and generation efficiency.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "ERO-_DWDGxufH-1-4lOn7OaxvQSp0P94XQ0FW475AMk",
  "pdfSize": "5312480"
}