{"id":"2412.06646","title":"The Narrow Gate: Localized Image-Text Communication in Vision-Language\n  Models","authors":"Alessandro Serra, Francesco Ortu, Emanuele Panizon, Lucrezia\n  Valeriani, Lorenzo Basile, Alessio Ansuini, Diego Doimo, Alberto Cazzaniga","authorsParsed":[["Serra","Alessandro",""],["Ortu","Francesco",""],["Panizon","Emanuele",""],["Valeriani","Lucrezia",""],["Basile","Lorenzo",""],["Ansuini","Alessio",""],["Doimo","Diego",""],["Cazzaniga","Alberto",""]],"versions":[{"version":"v1","created":"Mon, 9 Dec 2024 16:39:40 GMT"}],"updateDate":"2024-12-10","timestamp":1733762380000,"abstract":"  Recent advances in multimodal training have significantly improved the\nintegration of image understanding and generation within a unified model. This\nstudy investigates how vision-language models (VLMs) handle image-understanding\ntasks, specifically focusing on how visual information is processed and\ntransferred to the textual domain. We compare VLMs that generate both images\nand text with those that output only text, highlighting key differences in\ninformation flow. We find that in models with multimodal outputs, image and\ntext embeddings are more separated within the residual stream. Additionally,\nmodels vary in how information is exchanged from visual to textual tokens. VLMs\nthat only output text exhibit a distributed communication pattern, where\ninformation is exchanged through multiple image tokens. In contrast, models\ntrained for image and text generation rely on a single token that acts as a\nnarrow gate for the visual information. We demonstrate that ablating this\nsingle token significantly deteriorates performance on image understanding\ntasks. Furthermore, modifying this token enables effective steering of the\nimage semantics, showing that targeted, local interventions can reliably\ncontrol the model's global behavior.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"MvMe6PY60bIUwSpwbBTdSiSIttLe9rGaN2tgNZurJ0I","pdfSize":"608252"}