{"id":"2412.08397","title":"Searching for dual/lensed quasar candidates with spectroscopic surveys","authors":"Xiang Ji, Zhen-Ya Zheng, Ru-Qiu Lin, Hai-Cheng Feng","authorsParsed":[["Ji","Xiang",""],["Zheng","Zhen-Ya",""],["Lin","Ru-Qiu",""],["Feng","Hai-Cheng",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 14:15:07 GMT"}],"updateDate":"2024-12-12","timestamp":1733926507000,"abstract":"  Dual and lensed quasars are valuable astrophysical targets in many aspects.\nDual quasars, considered as the precursors of supermassive black hole binaries,\ncan provide crucial insights into how black hole mergers drive the growth of\nsupermassive black holes and influence the evolution of galaxies. Lensed\nquasars, formed by the gravitational deflection of a background quasar's light\nby a massive foreground object, can address key cosmological questions,\nparticularly in refining measurements of the Hubble constant. Despite their\nsignificance, the number of confirmed dual and lensed quasars remains limited.\nHere in this work, we propose a systematic search for dual/lensed quasars using\nbroad emission line profile diagnostics. Our parent sample consists of\nspectroscopic quasars from the Dark Energy Spectroscopic Instrument Early Data\nRelease (DESI EDR) and the SDSS DR17 catalog. We identify 30 lensed quasar\ncandidates with similar broad emission line profiles, as well as 36 dual quasar\ncandidates with different profiles. Cross-matching these 66 targets with the\nHST archival database, we find four overlapping targets, including three\npreviously reported lensed quasars and one newly identified dual quasar\ncandidate. We estimate the black hole masses for the two cores in the same\nsystem. The mass ratios are similar in the lensed quasar scenario but vary\nwidely for dual quasars, consistent with the physical nature of these two\ntypes. In particular, we identified a dual quasar candidate with the mass ratio\nexceeding 100 times. We aim to discover more dual/lensed quasar candidates\nusing our method with the upcoming future spectroscopic surveys.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"hlqnafEmOegpDxHWE8vGovFD9l6i6G6PO5jVcPrINlg","pdfSize":"4326349"}