{
  "id": "2412.15511",
  "title": "RESQUE: Quantifying Estimator to Task and Distribution Shift for\n  Sustainable Model Reusability",
  "authors": "Vishwesh Sangarya and Jung-Eun Kim",
  "authorsParsed": [
    [
      "Sangarya",
      "Vishwesh",
      ""
    ],
    [
      "Kim",
      "Jung-Eun",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 02:55:07 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734663307000,
  "abstract": "  As a strategy for sustainability of deep learning, reusing an existing model\nby retraining it rather than training a new model from scratch is critical. In\nthis paper, we propose REpresentation Shift QUantifying Estimator (RESQUE), a\npredictive quantifier to estimate the retraining cost of a model to\ndistributional shifts or change of tasks. It provides a single concise index\nfor an estimate of resources required for retraining the model. Through\nextensive experiments, we show that RESQUE has a strong correlation with\nvarious retraining measures. Our results validate that RESQUE is an effective\nindicator in terms of epochs, gradient norms, changes of parameter magnitude,\nenergy, and carbon emissions. These measures align well with RESQUE for new\ntasks, multiple noise types, and varying noise intensities. As a result, RESQUE\nenables users to make informed decisions for retraining to different\ntasks/distribution shifts and determine the most cost-effective and sustainable\noption, allowing for the reuse of a model with a much smaller footprint in the\nenvironment. The code for this work is available here:\nhttps://github.com/JEKimLab/AAAI2025RESQUE\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "tY0Epot6FL4PNl5GbVw5d4M-spErr9S0X5GX15YdvgU",
  "pdfSize": "452145"
}