{
  "id": "2412.06358",
  "title": "The local similarity theory, including the \"spectral\" Prandtl mixing\n  length. Dissipation of energies and structural parameters in the atmospheric\n  CBL",
  "authors": "A. N. Vulfson, P. V. Nikolaev",
  "authorsParsed": [
    [
      "Vulfson",
      "A. N.",
      ""
    ],
    [
      "Nikolaev",
      "P. V.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 10:20:51 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733739651000,
  "abstract": "  The paper discusses a variant of the local similarity theory, employing the\nsecond moment of vertical velocity and the \"spectral\" Prandtl mixing length as\nbasic parameters. This approach allows expressing the turbulent exchange\ncoefficient, dissipations of kinetic energy and buoyancy square, mixed moments\nof the buoyancy and vertical velocity, as well as structural parameters solely\nthrough two independent basic parameters of local similarity. Comparison of\nlocal similarity approximations with experimental data convincingly confirms\nthe correctness of the proposed relationships and demonstrates the high\nefficiency of the considered theory. It is established that the approximations\nof the turbulent exchange coefficient and dissipations of local similarity are\nfully consistent with the semi-empirical theories of Prandtl, Hanna,\nRichardson-Onsager and the Kolmogorov-Obukhov spectral theory with the law -5/3\nfor the atmospheric CBL. Thus, the new theory of local similarity significantly\nextends the scope of applications of well-known turbulence theories and\nsubstantially complements our understanding of turbulent convection.\n",
  "subjects": [
    "Physics/Atmospheric and Oceanic Physics",
    "Physics/Mathematical Physics",
    "Mathematics/Mathematical Physics",
    "Physics/Fluid Dynamics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "IJeCEUs-q6rPbBS49Vx5EzXxOBl4p6FgyjO3g2hxa1A",
  "pdfSize": "1350597"
}