{"id":"2412.08855","title":"Real-Time Algorithms for Game-Theoretic Motion Planning and Control in\n  Autonomous Racing using Near-Potential Function","authors":"Dvij Kalaria, Chinmay Maheshwari, Shankar Sastry","authorsParsed":[["Kalaria","Dvij",""],["Maheshwari","Chinmay",""],["Sastry","Shankar",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 01:29:01 GMT"}],"updateDate":"2024-12-13","timestamp":1733966941000,"abstract":"  Autonomous racing extends beyond the challenge of controlling a racecar at\nits physical limits. Professional racers employ strategic maneuvers to outwit\nother competing opponents to secure victory. While modern control algorithms\ncan achieve human-level performance by computing offline racing lines for\nsingle-car scenarios, research on real-time algorithms for multi-car autonomous\nracing is limited. To bridge this gap, we develop game-theoretic modeling\nframework that incorporates the competitive aspect of autonomous racing like\novertaking and blocking through a novel policy parametrization, while operating\nthe car at its limit. Furthermore, we propose an algorithmic approach to\ncompute the (approximate) Nash equilibrium strategy, which represents the\noptimal approach in the presence of competing agents. Specifically, we\nintroduce an algorithm inspired by recently introduced framework of dynamic\nnear-potential function, enabling real-time computation of the Nash\nequilibrium. Our approach comprises two phases: offline and online. During the\noffline phase, we use simulated racing data to learn a near-potential function\nthat approximates utility changes for agents. This function facilitates the\nonline computation of approximate Nash equilibria by maximizing its value. We\nevaluate our method in a head-to-head 3-car racing scenario, demonstrating\nsuperior performance compared to several existing baselines.\n","subjects":["Computer Science/Robotics","Computer Science/Computer Science and Game Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"5GKOAXmpDDeiMsFViudhjjeBE3kwhjZDDECF7ijmcBQ","pdfSize":"1592125"}