{
  "id": "2412.16329",
  "title": "Improving Object Detection for Time-Lapse Imagery Using Temporal\n  Features in Wildlife Monitoring",
  "authors": "Marcus Jenkins, Kirsty A. Franklin, Malcolm A. C. Nicoll, Nik C. Cole,\n  Kevin Ruhomaun, Vikash Tatayah and Michal Mackiewicz",
  "authorsParsed": [
    [
      "Jenkins",
      "Marcus",
      ""
    ],
    [
      "Franklin",
      "Kirsty A.",
      ""
    ],
    [
      "Nicoll",
      "Malcolm A. C.",
      ""
    ],
    [
      "Cole",
      "Nik C.",
      ""
    ],
    [
      "Ruhomaun",
      "Kevin",
      ""
    ],
    [
      "Tatayah",
      "Vikash",
      ""
    ],
    [
      "Mackiewicz",
      "Michal",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 20:37:09 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734727029000,
  "abstract": "  Monitoring animal populations is crucial for assessing the health of\necosystems. Traditional methods, which require extensive fieldwork, are\nincreasingly being supplemented by time-lapse camera-trap imagery combined with\nan automatic analysis of the image data. The latter usually involves some\nobject detector aimed at detecting relevant targets (commonly animals) in each\nimage, followed by some postprocessing to gather activity and population data.\nIn this paper, we show that the performance of an object detector in a single\nframe of a time-lapse sequence can be improved by including spatio-temporal\nfeatures from the prior frames. We propose a method that leverages temporal\ninformation by integrating two additional spatial feature channels which\ncapture stationary and non-stationary elements of the scene and consequently\nimprove scene understanding and reduce the number of stationary false\npositives. The proposed technique achieves a significant improvement of 24\\% in\nmean average precision (mAP@0.05:0.95) over the baseline (temporal\nfeature-free, single frame) object detector on a large dataset of breeding\ntropical seabirds. We envisage our method will be widely applicable to other\nwildlife monitoring applications that use time-lapse imaging.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "wMUtcfOp9RTGdnbetxEuyztuNaMbZ3r8DcLQjjFKIK0",
  "pdfSize": "17074641"
}