{
  "id": "2412.17150",
  "title": "SplitFedZip: Learned Compression for Data Transfer Reduction in\n  Split-Federated Learning",
  "authors": "Chamani Shiranthika, Hadi Hadizadeh, Parvaneh Saeedi, Ivan V. Baji\\'c",
  "authorsParsed": [
    [
      "Shiranthika",
      "Chamani",
      ""
    ],
    [
      "Hadizadeh",
      "Hadi",
      ""
    ],
    [
      "Saeedi",
      "Parvaneh",
      ""
    ],
    [
      "Bajić",
      "Ivan V.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 19:04:19 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734548659000,
  "abstract": "  Federated Learning (FL) enables multiple clients to train a collaborative\nmodel without sharing their local data. Split Learning (SL) allows a model to\nbe trained in a split manner across different locations. Split-Federated\n(SplitFed) learning is a more recent approach that combines the strengths of FL\nand SL. SplitFed minimizes the computational burden of FL by balancing\ncomputation across clients and servers, while still preserving data privacy.\nThis makes it an ideal learning framework across various domains, especially in\nhealthcare, where data privacy is of utmost importance. However, SplitFed\nnetworks encounter numerous communication challenges, such as latency,\nbandwidth constraints, synchronization overhead, and a large amount of data\nthat needs to be transferred during the learning process. In this paper, we\npropose SplitFedZip -- a novel method that employs learned compression to\nreduce data transfer in SplitFed learning. Through experiments on medical image\nsegmentation, we show that learned compression can provide a significant data\ncommunication reduction in SplitFed learning, while maintaining the accuracy of\nthe final trained model. The implementation is available at:\n\\url{https://github.com/ChamaniS/SplitFedZip}.\n",
  "subjects": [
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "0ddpg86N4CqLrZxk3STScJBfrkr0f3hC-DxZyv7JiqY",
  "pdfSize": "1514111"
}