{"id":"2412.05650","title":"Externally irradiated young stars in NGC 3603. A JWST NIRSpec catalogue\n  of pre-main-sequence stars in a massive star formation region","authors":"Ciar\\'an Rogers, Guido de Marchi, Bernhard Brandl","authorsParsed":[["Rogers","Ciarán",""],["de Marchi","Guido",""],["Brandl","Bernhard",""]],"versions":[{"version":"v1","created":"Sat, 7 Dec 2024 13:33:40 GMT"},{"version":"v2","created":"Tue, 10 Dec 2024 10:41:31 GMT"}],"updateDate":"2024-12-11","timestamp":1733578420000,"abstract":"  NGC 3603 is the optically brightest massive star forming region (SFR) in the\nMilky Way, representing a small scale starburst region. Studying young stars in\nregions like this allows us to assess how star and planet formation proceeds in\na dense clustered environment with high levels of UV radiation. JWST provides\nthe sensitivity, unbroken wavelength coverage, and spatial resolution required\nto study individual pre-main-sequence (PMS) stars in distant massive SFRs in\ndetail for the first time. Using the Micro-Shutter Assembly (MSA) onboard the\nNear InfraRed Spectrograph (NIRSpec), multi-object spectroscopy was performed,\nyielding 100 stellar spectra. We fit the PMS spectra to derive their\nphotospheric properties, extinction, and NIR veiling. From this, we determined\nthe masses and ages of our sources by placing them on the Hertzsprung-Russel\ndiagram (HRD). Their accretion rates were determined by converting the\nluminosity of hydrogen emission lines to an accretion luminosity. We have\nclassified 42 as actively accreting. Our sources span a range of masses from\n0.5 to 7 $M_{\\odot}$. Twelve of these accreting sources have ages consistent\nwith $\\ge$ 10 Myrs, with four having ages of $\\ge$ 15 Myrs. Their mass\naccretion rates span 5 orders of magnitude and are systematically higher for a\ngiven stellar mass than for a comparative sample taken from low-mass SFRs. We\nreport an environmental relationship between $\\dot{M}_{acc}$ and the density of\nambient molecular gas as traced by nebular $H_2$ emission.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"2Z2J7ztSyGVhPQ2YHq-uTmvCYzW6514sUPnq-fmNCpc","pdfSize":"34666497"}