{
  "id": "2412.19778",
  "title": "Symbolic Approximations to Ricci-flat Metrics Via Extrinsic Symmetries\n  of Calabi-Yau Hypersurfaces",
  "authors": "Viktor Mirjani\\'c and Challenger Mishra",
  "authorsParsed": [
    [
      "Mirjanić",
      "Viktor",
      ""
    ],
    [
      "Mishra",
      "Challenger",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 27 Dec 2024 18:19:26 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735323566000,
  "abstract": "  Ever since Yau's non-constructive existence proof of Ricci-flat metrics on\nCalabi-Yau manifolds, finding their explicit construction remains a major\nobstacle to development of both string theory and algebraic geometry. Recent\ncomputational approaches employ machine learning to create novel neural\nrepresentations for approximating these metrics, offering high accuracy but\nlimited interpretability. In this paper, we analyse machine learning\napproximations to flat metrics of Fermat Calabi-Yau n-folds and some of their\none-parameter deformations in three dimensions in order to discover their new\nproperties. We formalise cases in which the flat metric has more symmetries\nthan the underlying manifold, and prove that these symmetries imply that the\nflat metric admits a surprisingly compact representation for certain choices of\ncomplex structure moduli. We show that such symmetries uniquely determine the\nflat metric on certain loci, for which we present an analytic form. We also\nincorporate our theoretical results into neural networks to achieve\nstate-of-the-art reductions in Ricci curvature for multiple Calabi-Yau\nmanifolds. We conclude by distilling the ML models to obtain for the first time\nclosed form expressions for Kahler metrics with near-zero scalar curvature.\n",
  "subjects": [
    "Physics/High Energy Physics - Theory",
    "Computer Science/Machine Learning",
    "Mathematics/Algebraic Geometry",
    "Mathematics/Differential Geometry"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "erpXGBAKC2C5xSj1HYybZdiq0XbO3k9HeK0dsEmD0P0",
  "pdfSize": "1138746"
}