{
  "id": "2412.05745",
  "title": "A semi-analytical perspective on massive red galaxies: I. Assembly\n  history, environment & redshift evolution",
  "authors": "D. Stoppacher, A. D. Montero-Dorta, M. C. Artale, A. Knebe, N.\n  Padilla, A. J. Benson, C. Behrens",
  "authorsParsed": [
    [
      "Stoppacher",
      "D.",
      ""
    ],
    [
      "Montero-Dorta",
      "A. D.",
      ""
    ],
    [
      "Artale",
      "M. C.",
      ""
    ],
    [
      "Knebe",
      "A.",
      ""
    ],
    [
      "Padilla",
      "N.",
      ""
    ],
    [
      "Benson",
      "A. J.",
      ""
    ],
    [
      "Behrens",
      "C.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 7 Dec 2024 21:06:45 GMT"
    }
  ],
  "updateDate": "2025-01-22",
  "timestamp": 1733605605000,
  "abstract": "  Investigating the assembly history of the most massive and passive galaxies\nwill enhance our understanding of why galaxies exhibit such a remarkable\ndiversity in structure and morphology. In this paper, we simultaneously\ninvestigate the assembly history and redshift evolution of semi-analytically\nmodelled galaxy properties of central galaxies between 0.56 < z < 4.15,\nalongside their connection to their halos as a function of large-scale\nenvironment. We extract sub-samples of galaxies from a mock catalogue\nrepresentative for the BOSS-CMASS sample, which includes the most massive and\npassively evolving system known today. Utilising typical galaxy properties such\nas star formation rate, (g-i) colour, or cold gas-phase metallicity (Zcold), we\ntrack the redshift evolution of these properties across the main progenitor\ntrees. We present results on galaxy and halo properties, including their growth\nand clustering functions. Our findings indicate that galaxies in the highest\nstellar and halo mass regimes are least metal-enriched (using Zcold as a proxy)\nand consistently exhibit significantly larger black hole masses and higher\nclustering amplitudes compared to sub-samples selected by e.g. colour or star\nformation rate. This population forms later and also retains large reservoirs\nof cold gas. In contrast, galaxies in the intermediate and lower stellar/halo\nmass regimes consume their cold gas at higher redshift and were among the\nearliest and quickest to assemble. We observe a clear trend where the\nclustering of the galaxies selected according to their Zcold-values (either\nlow-Zcold or high-Zcold) depends on the density of their location within the\nlarge-scale environment. We assume that in particular galaxies in the\nlow/high-Zcold sub-samples form and evolve through distinct evolutionary\nchannels, which are predetermined by their location within the large-scale\nenvironment of the cosmic web.\n",
  "subjects": [
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "idBuRQWA_nEHwY7LWodknA8XBN02Z3oeZLx6n4-UkvE",
  "pdfSize": "1605110"
}