{"id":"2412.15676","title":"Code Review Automation Via Multi-task Federated LLM -- An Empirical\n  Study","authors":"Jahnavi Kumar, Sridhar Chimalakonda","authorsParsed":[["Kumar","Jahnavi",""],["Chimalakonda","Sridhar",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 08:46:46 GMT"}],"updateDate":"2024-12-23","timestamp":1734684406000,"abstract":"  Code review is a crucial process before deploying code to production, as it\nvalidates the code, provides suggestions for improvements, and identifies\nerrors such as missed edge cases. In projects with regular production releases,\nthe effort required for peer code-reviews remains high. Consequently, there has\nbeen significant interest from software engineering (SE) researchers in\nautomating the code review process. Previous research on code review automation\nhas typically approached the task as three independent sub-tasks: review\nnecessity prediction, review comment generation, and code refinement. Our study\nattempts to (i) leverage the relationships between the sub-tasks of code review\nautomation, by developing a multi-task model that addresses all tasks in an\nintegrated manner, and (ii) increase model robustness on unseen data via\ncollaborative large language model (LLM) modeling, while retaining the\nproprietary nature of code, by using federated learning (FL). The study\nexplores five simple techniques for multi-task training, including two\nsequential methods, one parallel method, and two cumulative methods. The\nresults indicate that sequentially training a federated LLM (FedLLM) for our\ncode review multi-task use case is less efficient in terms of time,\ncomputation, and performance metrics, compared to training separate models for\neach task. Because sequential training demonstrates catastrophic forgetting,\nalternatively cumulative fine-tuning for multi-task training performs better\nthan training models for individual tasks. This study highlights the need for\nresearch focused on effective fine-tuning of multi-task FedLLMs for SE tasks.\n","subjects":["Computer Science/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"knxtbaoCNoaApYhtPIgeFulLvWAuhmOtDZSRjAFV1Lc","pdfSize":"1454826"}