{"id":"2412.02859","title":"Novel Magnetic Actuation Strategies for Precise Ferrofluid Marble\n  Manipulation in Magnetic Digital Microfluidics: Position Control and\n  Applications","authors":"Mohammad Hossein Sarkhosh, Mohammad Hassan Dabirzadeh, Mohamad Ali\n  Bijarchi, and Hossein Nejat Pishkenari","authorsParsed":[["Sarkhosh","Mohammad Hossein",""],["Dabirzadeh","Mohammad Hassan",""],["Bijarchi","Mohamad Ali",""],["Pishkenari","Hossein Nejat",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 21:50:01 GMT"}],"updateDate":"2024-12-05","timestamp":1733262601000,"abstract":"  Precise manipulation of liquid marbles has significant potential in various\napplications such as lab-on-a-chip systems, drug delivery, and biotechnology\nand has been a challenge for researchers. Ferrofluid marble (FM) is a marble\nwith a ferrofluid core that can easily be manipulated by a magnetic field.\nAlthough FMs have great potential for accurate positioning and manipulation,\nthese marbles have not been precisely controlled in magnetic digital\nmicrofluidics, so far. In this study for the first time, a novel method of\nmagnetic actuation is proposed using a pair of Helmholtz coils and permanent\nmagnets. The governing equations for controlling the FM position are\ninvestigated, and it is shown that there are three different strategies for\nadjusting the applied magnetic force. Then, experiments are conducted to\ndemonstrate the capability of the proposed method. To this aim, different\nmagnetic setups are proposed for manipulating FMs. These setups are compared in\nterms of energy consumption and tracking ability across various frequencies.\nThe study showcases several applications of precise FM position control,\nincluding controllable reciprocal positioning, simultaneous position control of\ntwo FMs, the transport of non-magnetic liquid marbles using the FMs, and sample\nextraction method from the liquid core of the FM.\n","subjects":["Computer Science/Robotics","Computer Science/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"1xOYSpNAtXxJXh6d1Xa4qq5GfYI-DtujxQWFqHs5b1s","pdfSize":"1600318"}