{
  "id": "2412.11426",
  "title": "Looking At the Distant Universe with the MeerKAT Array: the HI Mass\n  Function in the Local Universe",
  "authors": "Amir Kazemi-Moridani, Andrew J. Baker, Marc Verheijen, Eric Gawiser,\n  Sarah-Louise Blyth, Danail Obreschkow, Laurent Chemin, Jordan D. Collier,\n  Kyle W. Cook, Jacinta Delhaize, Ed Elson, Bradley S. Frank, Marcin Glowacki,\n  Kelley M. Hess, Benne W. Holwerda, Zackary L. Hutchens, Matt J. Jarvis,\n  Melanie Kaasinen, Sphesihle Makhathini, Abhisek Mohapatra, Hengxing Pan, Anja\n  C. Schr\\\"oder, Leyya Stockenstroom, Mattia Vaccari, Tobias Westmeier, John F.\n  Wu, and Martin Zwaan",
  "authorsParsed": [
    [
      "Kazemi-Moridani",
      "Amir",
      ""
    ],
    [
      "Baker",
      "Andrew J.",
      ""
    ],
    [
      "Verheijen",
      "Marc",
      ""
    ],
    [
      "Gawiser",
      "Eric",
      ""
    ],
    [
      "Blyth",
      "Sarah-Louise",
      ""
    ],
    [
      "Obreschkow",
      "Danail",
      ""
    ],
    [
      "Chemin",
      "Laurent",
      ""
    ],
    [
      "Collier",
      "Jordan D.",
      ""
    ],
    [
      "Cook",
      "Kyle W.",
      ""
    ],
    [
      "Delhaize",
      "Jacinta",
      ""
    ],
    [
      "Elson",
      "Ed",
      ""
    ],
    [
      "Frank",
      "Bradley S.",
      ""
    ],
    [
      "Glowacki",
      "Marcin",
      ""
    ],
    [
      "Hess",
      "Kelley M.",
      ""
    ],
    [
      "Holwerda",
      "Benne W.",
      ""
    ],
    [
      "Hutchens",
      "Zackary L.",
      ""
    ],
    [
      "Jarvis",
      "Matt J.",
      ""
    ],
    [
      "Kaasinen",
      "Melanie",
      ""
    ],
    [
      "Makhathini",
      "Sphesihle",
      ""
    ],
    [
      "Mohapatra",
      "Abhisek",
      ""
    ],
    [
      "Pan",
      "Hengxing",
      ""
    ],
    [
      "Schröder",
      "Anja C.",
      ""
    ],
    [
      "Stockenstroom",
      "Leyya",
      ""
    ],
    [
      "Vaccari",
      "Mattia",
      ""
    ],
    [
      "Westmeier",
      "Tobias",
      ""
    ],
    [
      "Wu",
      "John F.",
      ""
    ],
    [
      "Zwaan",
      "Martin",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 03:51:36 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734321096000,
  "abstract": "  We present measurements of the neutral atomic hydrogen (HI) mass function\n(HIMF) and cosmic HI density ($\\Omega_{\\rm HI}$) at $0 \\leq z \\leq 0.088$ from\nthe Looking at the Distant Universe with MeerKAT Array (LADUMA) survey. Using\nLADUMA Data Release 1 (DR1), we analyze the HIMF via a new \"recovery matrix\"\n(RM) method that we benchmark against a more traditional Modified Maximum\nLikelihood (MML) method. Our analysis, which implements a forward modeling\napproach, corrects for survey incompleteness and uses extensive synthetic\nsource injections to ensure robust estimates of the HIMF parameters and their\nassociated uncertainties. This new method tracks the recovery of sources in\nmass bins different from those in which they were injected and incorporates a\nPoisson likelihood in the forward modeling process, allowing it to correctly\nhandle uncertainties in bins with few or no detections. The application of our\nanalysis to a high-purity subsample of the LADUMA DR1 spectral line catalog in\nturn mitigates any possible biases that could result from the inconsistent\ntreatment of synthetic and real sources. For the surveyed redshift range, the\nrecovered Schechter function normalization, low-mass slope, and \"knee\" mass are\n$\\phi_\\ast = 3.56_{-1.92}^{+0.97} \\times 10^{-3}$ Mpc$^{-3}$ dex$^{-1}$,\n$\\alpha = -1.18_{-0.19}^{+0.08}$, and $\\log(M_\\ast/M_\\odot) =\n10.01_{-0.12}^{+0.31}$, respectively, which together imply a comoving cosmic HI\ndensity of $\\Omega_{\\rm HI}=3.09_{-0.47}^{+0.65}\\times 10^{-4}$. Our results\nshow consistency between RM and MML methods and with previous low-redshift\nstudies, giving confidence that the cosmic volume probed by LADUMA, even at low\nredshifts, is not an outlier in terms of its HI content.\n",
  "subjects": [
    "Astrophysics/Astrophysics of Galaxies",
    "Astrophysics/Cosmology and Nongalactic Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "D-4mmdhFJszBG_S6EjyWYu1SX45yoHWmtblEAqOPeHY",
  "pdfSize": "4713140"
}