{
  "id": "2412.10647",
  "title": "Enhancement of text recognition for hanja handwritten documents of\n  Ancient Korea",
  "authors": "Joonmo Ahna, Taehong Jang, Quan Fengnyu, Hyungil Lee, Jaehyuk Lee, and\n  Sojung Lucia Kim",
  "authorsParsed": [
    [
      "Ahna",
      "Joonmo",
      ""
    ],
    [
      "Jang",
      "Taehong",
      ""
    ],
    [
      "Fengnyu",
      "Quan",
      ""
    ],
    [
      "Lee",
      "Hyungil",
      ""
    ],
    [
      "Lee",
      "Jaehyuk",
      ""
    ],
    [
      "Kim",
      "Sojung Lucia",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 14 Dec 2024 02:29:07 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734143347000,
  "abstract": "  We implemented a high-performance optical character recognition model for\nclassical handwritten documents using data augmentation with highly variable\ncropping within the document region. Optical character recognition in\nhandwritten documents, especially classical documents, has been a challenging\ntopic in many countries and research organizations due to its difficulty.\nAlthough many researchers have conducted research on this topic, the quality of\nclassical texts over time and the unique stylistic characteristics of various\nauthors have made it difficult, and it is clear that the recognition of hanja\nhandwritten documents is a meaningful and special challenge, especially since\nhanja, which has been developed by reflecting the vocabulary, semantic, and\nsyntactic features of the Joseon Dynasty, is different from classical Chinese\ncharacters. To study this challenge, we used 1100 cursive documents, which are\nsmall in size, and augmented 100 documents per document by cropping a randomly\nsized region within each document for training, and trained them using a\ntwo-stage object detection model, High resolution neural network (HRNet), and\napplied the resulting model to achieve a high inference recognition rate of 90%\nfor cursive documents. Through this study, we also confirmed that the\nperformance of OCR is affected by the simplified characters, variants, variant\ncharacters, common characters, and alternators of Chinese characters that are\ndifficult to see in other studies, and we propose that the results of this\nstudy can be applied to optical character recognition of modern documents in\nmultiple languages as well as other typefaces in classical documents.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "9wNTZcLv93Ia7kAhmEJp3goY1o1XaF5vZKH9c3PZADA",
  "pdfSize": "131924"
}