{
  "id": "2412.04098",
  "title": "Magnetically-controlled Vortex Dynamics in a Ferromagnetic\n  Superconductor",
  "authors": "Joseph Alec Wilcox, Lukas Schneider, Estefani Marchiori, Vadim\n  Plastovets, Alexandre Buzdin, Pardis Sahafi, Andrew Jordan, Raffi Budakian,\n  Tong Ren, Ivan Veschunov, Tsuyoshi Tamegai, Sven Friedemann, Martino Poggio,\n  Simon John Bending",
  "authorsParsed": [
    [
      "Wilcox",
      "Joseph Alec",
      ""
    ],
    [
      "Schneider",
      "Lukas",
      ""
    ],
    [
      "Marchiori",
      "Estefani",
      ""
    ],
    [
      "Plastovets",
      "Vadim",
      ""
    ],
    [
      "Buzdin",
      "Alexandre",
      ""
    ],
    [
      "Sahafi",
      "Pardis",
      ""
    ],
    [
      "Jordan",
      "Andrew",
      ""
    ],
    [
      "Budakian",
      "Raffi",
      ""
    ],
    [
      "Ren",
      "Tong",
      ""
    ],
    [
      "Veschunov",
      "Ivan",
      ""
    ],
    [
      "Tamegai",
      "Tsuyoshi",
      ""
    ],
    [
      "Friedemann",
      "Sven",
      ""
    ],
    [
      "Poggio",
      "Martino",
      ""
    ],
    [
      "Bending",
      "Simon John",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 12:05:19 GMT"
    },
    {
      "version": "v2",
      "created": "Fri, 6 Dec 2024 07:57:07 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733400319000,
  "abstract": "  Ferromagnetic superconductors are exceptionally rare because the strong\nferromagnetic exchange field usually destroys singlet superconductivity.\nEuFe$_2$(As$_{1-x}$P$_x$)$_2$, an iron-based superconductor with a maximum\ncritical temperature of $\\sim$25 K, is a unique material that exhibits full\ncoexistence with ferromagnetic order below $T_\\mathrm{FM} \\approx 19$ K. The\ninterplay between the two leads to a narrowing of ferromagnetic domains at\nhigher temperatures and the spontaneous nucleation of vortices/antivortices at\nlower temperatures. Here we demonstrate how the underlying magnetic structure\ndirectly controls the superconducting vortex dynamics in applied magnetic\nfields. Just below $T_\\mathrm{FM}$ we observe a pronounced\ntemperature-dependent peak in both the coercivity and the creep activation\nenergy, the latter becoming rapidly suppressed in large applied magnetic\nfields. We attribute this behaviour to the formation of vortex polarons arising\nfrom the unique interaction between free vortices and magnetic stripe domains.\nWe present a theoretical description of the properties of vortex polarons that\nexplains our main observations, showing how they lead to vortex trapping and an\nattractive vortex-vortex interaction at short distances. In stark contrast,\nstrong magnetic irreversibility at low temperatures is linked to a critical\ncurrent governed by giant flux creep over an activation barrier for\nvortex-antivortex annihilation near domain walls. Our work reveals unexplored\nnew routes for the magnetic enhancement of vortex pinning with particularly\nimportant applications in high-current conductors for operation at high\nmagnetic fields.\n",
  "subjects": [
    "Condensed Matter/Superconductivity",
    "Condensed Matter/Strongly Correlated Electrons"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "bsxy6ra0sCB1EUx_0GYr3Kk7joAKeEj3TSaGLVhwNEs",
  "pdfSize": "3586097"
}