{
  "id": "2412.05065",
  "title": "Reconstruction of 3D lumbar spine models from incomplete segmentations\n  using landmark detection",
  "authors": "Lara Blomenkamp, Ivanna Kramer, Sabine Bauer, Kevin Weirauch and\n  Dietrich Paulus",
  "authorsParsed": [
    [
      "Blomenkamp",
      "Lara",
      ""
    ],
    [
      "Kramer",
      "Ivanna",
      ""
    ],
    [
      "Bauer",
      "Sabine",
      ""
    ],
    [
      "Weirauch",
      "Kevin",
      ""
    ],
    [
      "Paulus",
      "Dietrich",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 14:23:42 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733495022000,
  "abstract": "  Patient-specific 3D spine models serve as a foundation for spinal treatment\nand surgery planning as well as analysis of loading conditions in biomechanical\nand biomedical research. Despite advancements in imaging technologies, the\nreconstruction of complete 3D spine models often faces challenges due to\nlimitations in imaging modalities such as planar X-Ray and missing certain\nspinal structures, such as the spinal or transverse processes, in volumetric\nmedical images and resulting segmentations. In this study, we present a novel\naccurate and time-efficient method to reconstruct complete 3D lumbar spine\nmodels from incomplete 3D vertebral bodies obtained from segmented magnetic\nresonance images (MRI). In our method, we use an affine transformation to align\nartificial vertebra models with patient-specific incomplete vertebrae. The\ntransformation matrix is derived from vertebra landmarks, which are\nautomatically detected on the vertebra endplates. The results of our evaluation\ndemonstrate the high accuracy of the performed registration, achieving an\naverage point-to-model distance of 1.95 mm. Additionally, in assessing the\nmorphological properties of the vertebrae and intervertebral characteristics,\nour method demonstrated a mean absolute error (MAE) of 3.4{\\deg} in the angles\nof functional spine units (FSUs), emphasizing its effectiveness in maintaining\nimportant spinal features throughout the transformation process of individual\nvertebrae. Our method achieves the registration of the entire lumbar spine,\nspanning segments L1 to L5, in just 0.14 seconds, showcasing its\ntime-efficiency. Clinical relevance: the fast and accurate reconstruction of\nspinal models from incomplete input data such as segmentations provides a\nfoundation for many applications in spine diagnostics, treatment planning, and\nthe development of spinal healthcare solutions.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Image and Video Processing",
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "J5ucqGXFB0ctQAWUmXGJMGL_zJPikv5rveoCx35UqAE",
  "pdfSize": "2400067"
}