{
  "id": "2412.08498",
  "title": "A robust, scalable K-statistic for quantifying immune cell clustering in\n  spatial proteomics data",
  "authors": "Julia Wrobel and Hoseung Song",
  "authorsParsed": [
    [
      "Wrobel",
      "Julia",
      ""
    ],
    [
      "Song",
      "Hoseung",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 16:01:09 GMT"
    },
    {
      "version": "v2",
      "created": "Fri, 20 Dec 2024 19:10:50 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1733932869000,
  "abstract": "  Spatial summary statistics based on point process theory are widely used to\nquantify the spatial organization of cell populations in single-cell spatial\nproteomics data. Among these, Ripley's $K$ is a popular metric for assessing\nwhether cells are spatially clustered or are randomly dispersed. However, the\nkey assumption of spatial homogeneity is frequently violated in spatial\nproteomics data, leading to overestimates of cell clustering and\ncolocalization. To address this, we propose a novel $K$-based method, termed\n\\textit{KAMP} (\\textbf{K} adjustment by \\textbf{A}nalytical \\textbf{M}oments of\nthe \\textbf{P}ermutation distribution), for quantifying the spatial\norganization of cells in spatial proteomics samples. \\textit{KAMP} leverages\nbackground cells in each sample along with a new closed-form representation of\nthe first and second moments of the permutation distribution of Ripley's $K$ to\nestimate an empirical null model. Our method is robust to inhomogeneity,\ncomputationally efficient even in large datasets, and provides approximate\n$p$-values for testing spatial clustering and colocalization. Methodological\ndevelopments are motivated by a spatial proteomics study of 103 women with\novarian cancer, where our analysis using \\textit{KAMP} shows a positive\nassociation between immune cell clustering and overall patient survival.\nNotably, we also find evidence that using $K$ without correcting for sample\ninhomogeneity may bias hazard ratio estimates in downstream analyses.\n\\textit{KAMP} completes this analysis in just 5 minutes, compared to 538\nminutes for the only competing method that adequately addresses inhomogeneity.\n",
  "subjects": [
    "Statistics/Methodology",
    "Quantitative Biology/Genomics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "mWIYI76ayd8HL5evLSyGs2uSnsAkKTteUU0CyhU_lMc",
  "pdfSize": "2457867"
}