{
  "id": "2412.10962",
  "title": "Non-locality detection in nano-semiconductors based on lagging models",
  "authors": "Sharif A. Sulaiman and Zahra Shomali",
  "authorsParsed": [
    [
      "Sulaiman",
      "Sharif A.",
      ""
    ],
    [
      "Shomali",
      "Zahra",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 14 Dec 2024 20:47:50 GMT"
    },
    {
      "version": "v2",
      "created": "Sat, 21 Dec 2024 18:21:20 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734209270000,
  "abstract": "  As the transistors and consequently the chips are getting smaller, the\naccurate investigation of heat transport at micro/nanoscale, becomes an\nimportant issue of concern. This is due to an increase in the energy\nconsumption and the leakage currents as a result of the miniaturization which\nrequires taking care of the thermal behavior to make sure that the device is\nworking in the threshold temperature regime. The current work deals with a\ntwo-dimensional framework, incorporating the nonlocality in space, for more\naccurate investigation of the nanoscale heat transport using the lower\ncomputational cost phenomenological macroscopical Dual Phase Lag (DPL) method.\nThe non dimensional non-locality parameter {\\gamma}, which indicates the\nstrength of the non-locality, is embedded through the modified DPL model named\nas nonlocal DPL. It is obtained that for the two-dimensional silicon\ntransistor, the {\\gamma} parameter in x and y direction has the same value and\nlike its behavior at one-dimension, is linearly dependent on the Knudsen\nnumber, being 1.5 for Kn=10 and 0.015 for Kn=0.1. Also, the phase lagging\nratio, B, is found to be 0.08. It should be mentioned that the non-locality\neffect is more pronounced for smaller systems with higher Knudsen number in\nwhich the non-Fourier behavior is more evident but contemplating the\nnon-locality parameter in systems with lower Knudsen number, makes the results\nmore precise. In brief, it is confirmed that taking into account the {\\gamma}\nparameter is noteworthy for accurately predicting the thermal behavior in\nmicro/nano scale systems using the classical macroscopical methods.\n",
  "subjects": [
    "Physics/Applied Physics",
    "Condensed Matter/Mesoscale and Nanoscale Physics",
    "Physics/Computational Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "pmzg4qkuHFzH2baOVGV2JCtCIclhMwcpeSxASUy8NvQ",
  "pdfSize": "2660821"
}