{"id":"2412.09059","title":"Go With the Flow: Fast Diffusion for Gaussian Mixture Models","authors":"George Rapakoulias, Ali Reza Pedram and Panagiotis Tsiotras","authorsParsed":[["Rapakoulias","George",""],["Pedram","Ali Reza",""],["Tsiotras","Panagiotis",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 08:40:22 GMT"},{"version":"v2","created":"Wed, 18 Dec 2024 18:20:14 GMT"},{"version":"v3","created":"Tue, 24 Dec 2024 09:30:14 GMT"}],"updateDate":"2024-12-25","timestamp":1733992822000,"abstract":"  Schr\\\"{o}dinger Bridges (SB) are diffusion processes that steer, in finite\ntime, a given initial distribution to another final one while minimizing a\nsuitable cost functional. Although various methods for computing SBs have\nrecently been proposed in the literature, most of these approaches require\ncomputationally expensive training schemes, even for solving low-dimensional\nproblems. In this work, we propose an analytic parametrization of a set of\nfeasible policies for steering the distribution of a dynamical system from one\nGaussian Mixture Model (GMM) to another. Instead of relying on standard\nnon-convex optimization techniques, the optimal policy within the set can be\napproximated as the solution of a low-dimensional linear program whose\ndimension scales linearly with the number of components in each mixture.\nFurthermore, our method generalizes naturally to more general classes of\ndynamical systems such as controllable Linear Time-Varying systems that cannot\ncurrently be solved using traditional neural SB approaches. We showcase the\npotential of this approach in low-to-moderate dimensional problems such as\nimage-to-image translation in the latent space of an autoencoder, and various\nother examples. We also benchmark our approach on an Entropic Optimal Transport\n(EOT) problem and show that it outperforms state-of-the-art methods in cases\nwhere the boundary distributions are mixture models while requiring virtually\nno training.\n","subjects":["Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"NX9a2AF74KnLvcyRiRh29A-VcJYW5BZfHm4gsS6C2l4","pdfSize":"6222590"}