{
  "id": "2412.10283",
  "title": "Shaping the Future of Social Media with Middleware",
  "authors": "Luke Hogg, Ren\\'ee DiResta, Francis Fukuyama, Richard Reisman, Daphne\n  Keller, Aviv Ovadya, Luke Thorburn, Jonathan Stray, and Shubhi Mathur",
  "authorsParsed": [
    [
      "Hogg",
      "Luke",
      ""
    ],
    [
      "DiResta",
      "Renée",
      ""
    ],
    [
      "Fukuyama",
      "Francis",
      ""
    ],
    [
      "Reisman",
      "Richard",
      ""
    ],
    [
      "Keller",
      "Daphne",
      ""
    ],
    [
      "Ovadya",
      "Aviv",
      ""
    ],
    [
      "Thorburn",
      "Luke",
      ""
    ],
    [
      "Stray",
      "Jonathan",
      ""
    ],
    [
      "Mathur",
      "Shubhi",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 17:07:05 GMT"
    }
  ],
  "updateDate": "2024-12-16",
  "timestamp": 1734109625000,
  "abstract": "  Middleware, third-party software intermediaries between users and platforms,\nhas been broached as a means to decentralize the power of social media\nplatforms and enhance user agency. Middleware may enable a more user-centric\nand democratic approach to shaping digital experiences, offering a flexible\narchitecture as an alternative to both centrally controlled, opaque platforms\nand an unmoderated, uncurated internet. The widespread adoption of open\nmiddleware has long hinged on the cooperation of established major platforms;\nhowever, the recent growth of federated platforms, such as Mastodon and\nBluesky, has led to increased offerings and user awareness. In this report we\nconsider the potential of middleware as a means of enabling greater user\ncontrol over curation and moderation - two aspects of the social media\nexperience that are often mired in controversy. We evaluate the trade-offs and\nnegative externalities it might create, and discuss the technological,\nregulatory, and market dynamics that could either support or hinder its\nimplementation.\n",
  "subjects": [
    "Computer Science/Computers and Society"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "DYWPNcl6NzGo2qsLN_0kX50stqPlApd4w9gD_urNqgY",
  "pdfSize": "589374"
}