{
  "id": "2412.01255",
  "title": "Embryo 2.0: Merging Synthetic and Real Data for Advanced AI Predictions",
  "authors": "Oriana Presacan, Alexandru Dorobantiu, Vajira Thambawita, Michael A.\n  Riegler, Mette H. Stensen, Mario Iliceto, Alexandru C. Aldea, Akriti Sharma",
  "authorsParsed": [
    [
      "Presacan",
      "Oriana",
      ""
    ],
    [
      "Dorobantiu",
      "Alexandru",
      ""
    ],
    [
      "Thambawita",
      "Vajira",
      ""
    ],
    [
      "Riegler",
      "Michael A.",
      ""
    ],
    [
      "Stensen",
      "Mette H.",
      ""
    ],
    [
      "Iliceto",
      "Mario",
      ""
    ],
    [
      "Aldea",
      "Alexandru C.",
      ""
    ],
    [
      "Sharma",
      "Akriti",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 08:24:49 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733127889000,
  "abstract": "  Accurate embryo morphology assessment is essential in assisted reproductive\ntechnology for selecting the most viable embryo. Artificial intelligence has\nthe potential to enhance this process. However, the limited availability of\nembryo data presents challenges for training deep learning models. To address\nthis, we trained two generative models using two datasets, one we created and\nmade publicly available, and one existing public dataset, to generate synthetic\nembryo images at various cell stages, including 2-cell, 4-cell, 8-cell, morula,\nand blastocyst. These were combined with real images to train classification\nmodels for embryo cell stage prediction. Our results demonstrate that\nincorporating synthetic images alongside real data improved classification\nperformance, with the model achieving 97% accuracy compared to 95% when trained\nsolely on real data. Notably, even when trained exclusively on synthetic data\nand tested on real data, the model achieved a high accuracy of 94%.\nFurthermore, combining synthetic data from both generative models yielded\nbetter classification results than using data from a single generative model.\nFour embryologists evaluated the fidelity of the synthetic images through a\nTuring test, during which they annotated inaccuracies and offered feedback. The\nanalysis showed the diffusion model outperformed the generative adversarial\nnetwork model, deceiving embryologists 66.6% versus 25.3% and achieving lower\nFrechet inception distance scores.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Image and Video Processing",
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "hMTrvlRSJPCtbFz0xDUX5yryasHY2lqw5qQ9z1dl5cE",
  "pdfSize": "5201188"
}