{
  "id": "2412.20417",
  "title": "Movable Antenna Array Aided Ultra Reliable Covert Communications",
  "authors": "Yida Wang, Guojie Hu, Xiaoling Hu, Xingbo Lu, Yuzhen Huang",
  "authorsParsed": [
    [
      "Wang",
      "Yida",
      ""
    ],
    [
      "Hu",
      "Guojie",
      ""
    ],
    [
      "Hu",
      "Xiaoling",
      ""
    ],
    [
      "Lu",
      "Xingbo",
      ""
    ],
    [
      "Huang",
      "Yuzhen",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 29 Dec 2024 09:51:19 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735465879000,
  "abstract": "  In this paper, we construct a framework of the movable antenna (MA) aided\ncovert communication shielded by the general noise uncertainty for the first\ntime. According to the analysis performance on the derived closed-form\nexpressions of the sum of the probabilities of the detection errors and the\ncommunication outage probability, the perfect covertness and the ultra\nreliability can be achieved by adjusting the antenna position in the MA array.\nThen, we formulate the communication covertness maximization problem with the\nconstraints of the ultra reliability and the independent discrete movable\nposition to optimize the transmitter's parameter. With the maximal ratio\ntransmitting (MRT) design for the beamforming, we solve the closed-form optimal\ninformation transmit power and design a lightweight discrete projected gradient\ndescent (DPGD) algorithm to determine the optimal antenna position. The\nnumerical results show that the optimal achievable covertness and the feasible\nregion of the steering angle with the MA array is significant larger than the\none with the fixed-position antenna (FPA) array.\n",
  "subjects": [
    "Computer Science/Information Theory",
    "Electrical Engineering and Systems Science/Signal Processing",
    "Mathematics/Information Theory"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "-R-PgcqCxYggF1jQYJEzD4jGMF_gCjDsnufYxYq2sGM",
  "pdfSize": "519455"
}