{
  "id": "2412.16432",
  "title": "DFModel: Design Space Optimization of Large-Scale Systems Exploiting\n  Dataflow Mappings",
  "authors": "Sho Ko, Nathan Zhang, Olivia Hsu, Ardavan Pedram, Kunle Olukotun",
  "authorsParsed": [
    [
      "Ko",
      "Sho",
      ""
    ],
    [
      "Zhang",
      "Nathan",
      ""
    ],
    [
      "Hsu",
      "Olivia",
      ""
    ],
    [
      "Pedram",
      "Ardavan",
      ""
    ],
    [
      "Olukotun",
      "Kunle",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 21 Dec 2024 01:37:59 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734745079000,
  "abstract": "  We propose DFModel, a modeling framework for mapping dataflow computation\ngraphs onto large-scale systems. Mapping a workload to a system requires\noptimizing dataflow mappings at various levels, including the inter-chip\n(between chips) level and the intra-chip (within a chip) level. DFModel is, to\nthe best of our knowledge, the first framework to perform the optimization at\nmultiple levels of the memory hierarchy and the interconnection network\nhierarchy. We use DFModel to explore a wide range of workloads on a variety of\nsystems. Evaluated workloads include two state-of-the-art machine learning\napplications (Large Language Models and Deep Learning Recommendation Models)\nand two high-performance computing applications (High Performance LINPACK and\nFast Fourier Transform). System parameters investigated span the combination of\ndataflow and traditional accelerator architectures, memory technologies (DDR,\nHBM), interconnect technologies (PCIe, NVLink), and interconnection network\ntopologies (torus, DGX, dragonfly). For a variety of workloads on a wide range\nof systems, the DFModel provided a mapping that predicts an average of 1.25X\nbetter performance compared to the ones measured on real systems. DFModel shows\nthat for large language model training, dataflow architectures achieve 1.52X\nhigher performance, 1.59X better cost efficiency, and 1.6X better power\nefficiency compared to non-dataflow architectures. On an industrial system with\ndataflow architectures, the DFModel-optimized dataflow mapping achieves a\nspeedup of 6.13X compared to non-dataflow mappings from previous performance\nmodels such as Calculon, and 1.52X compared to a vendor provided dataflow\nmapping.\n",
  "subjects": [
    "Computer Science/Hardware Architecture"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "v7V8cO_PZ33j08xYtPFnY-ptbpJW-_qmGPyAp8g8Yjg",
  "pdfSize": "4336209"
}