{
  "id": "2412.02903",
  "title": "EgoCast: Forecasting Egocentric Human Pose in the Wild",
  "authors": "Maria Escobar, Juanita Puentes, Cristhian Forigua, Jordi Pont-Tuset,\n  Kevis-Kokitsi Maninis, Pablo Arbelaez",
  "authorsParsed": [
    [
      "Escobar",
      "Maria",
      ""
    ],
    [
      "Puentes",
      "Juanita",
      ""
    ],
    [
      "Forigua",
      "Cristhian",
      ""
    ],
    [
      "Pont-Tuset",
      "Jordi",
      ""
    ],
    [
      "Maninis",
      "Kevis-Kokitsi",
      ""
    ],
    [
      "Arbelaez",
      "Pablo",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 23:11:06 GMT"
    }
  ],
  "updateDate": "2024-12-05",
  "timestamp": 1733267466000,
  "abstract": "  Accurately estimating and forecasting human body pose is important for\nenhancing the user's sense of immersion in Augmented Reality. Addressing this\nneed, our paper introduces EgoCast, a bimodal method for 3D human pose\nforecasting using egocentric videos and proprioceptive data. We study the task\nof human pose forecasting in a realistic setting, extending the boundaries of\ntemporal forecasting in dynamic scenes and building on the current framework\nfor current pose estimation in the wild. We introduce a current-frame\nestimation module that generates pseudo-groundtruth poses for inference,\neliminating the need for past groundtruth poses typically required by current\nmethods during forecasting. Our experimental results on the recent Ego-Exo4D\nand Aria Digital Twin datasets validate EgoCast for real-life motion\nestimation. On the Ego-Exo4D Body Pose 2024 Challenge, our method significantly\noutperforms the state-of-the-art approaches, laying the groundwork for future\nresearch in human pose estimation and forecasting in unscripted activities with\negocentric inputs.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "kLozEIe5bdmSW__121y9V03Ko_QZ1yGxrIR2fKXrd3k",
  "pdfSize": "4404260"
}