{
  "id": "2412.11942",
  "title": "DRUM: Diffusion-based runoff model for probabilistic flood forecasting",
  "authors": "Zhigang Ou, Congyi Nai, Baoxiang Pan, Ming Pan, Chaopeng Shen, Peishi\n  Jiang, Xingcai Liu, Qiuhong Tang, Wenqing Li, Yi Zheng",
  "authorsParsed": [
    [
      "Ou",
      "Zhigang",
      ""
    ],
    [
      "Nai",
      "Congyi",
      ""
    ],
    [
      "Pan",
      "Baoxiang",
      ""
    ],
    [
      "Pan",
      "Ming",
      ""
    ],
    [
      "Shen",
      "Chaopeng",
      ""
    ],
    [
      "Jiang",
      "Peishi",
      ""
    ],
    [
      "Liu",
      "Xingcai",
      ""
    ],
    [
      "Tang",
      "Qiuhong",
      ""
    ],
    [
      "Li",
      "Wenqing",
      ""
    ],
    [
      "Zheng",
      "Yi",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 16:25:29 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734366329000,
  "abstract": "  Reliable flood forecasting remains a critical challenge due to persistent\nunderestimation of peak flows and inadequate uncertainty quantification in\ncurrent approaches. We present DRUM (Diffusion-based Runoff Model), a\ngenerative AI solution for probabilistic runoff prediction. DRUM builds up an\niterative refinement process that generates ensemble runoff estimates from\nnoise, guided by past meteorological conditions, present meteorological\nforecasts, and static catchment attributes. This framework allows learning\ncomplex hydrological behaviors without imposing explicit distributional\nassumptions, particularly benefiting extreme event prediction and uncertainty\nquantification. Using data from 531 representative basins across the contiguous\nUnited States, DRUM outperforms state-of-the-art deep learning methods in\nrunoff forecasting regarding both deterministic and probabilistic skills, with\nparticular advantages in extreme flow (0.1%) predictions. DRUM demonstrates\nsuperior flood early warning skill across all magnitudes and lead times (1-7\ndays), achieving F1 scores near 0.4 for extreme events under perfect forecasts\nand maintaining robust performance with operational forecasts, especially for\nlonger lead times and high-magnitude floods. When applied to climate\nprojections through the 21st century, DRUM reveals increasing flood\nvulnerability in 47.8-57.1% of basins across emission scenarios, with\nparticularly elevated risks along the West Coast and Southeast regions. These\nadvances demonstrate significant potential for improving both operational flood\nforecasting and long-term risk assessment in a changing climate.\n",
  "subjects": [
    "Physics/Geophysics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "B8s1RVusERa-KtcOUi9Jc0O1jL91wQQOsjbsUNRWvDE",
  "pdfSize": "13224934"
}