{"id":"2412.13444","title":"Ubiquitous Small-scale EUV Upflow-Like Events above Network Regions\n  Observed by the Solar Orbiter/Extreme Ultraviolet Imager","authors":"Yadan Duan, Hechao Chen, Zhenyong Hou, Zheng Sun, and Yuandeng Shen","authorsParsed":[["Duan","Yadan",""],["Chen","Hechao",""],["Hou","Zhenyong",""],["Sun","Zheng",""],["Shen","Yuandeng",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 02:32:49 GMT"}],"updateDate":"2024-12-19","timestamp":1734489169000,"abstract":"  Universal small-scale solar activity in quiet region are suggested to be a\npotential source of solar wind and the upper solar atmosphere. Here, with the\nhigh-resoltion 174 \\AA~imaging observations from the Solar Orbiter/Extreme\nUltraviolet Imager (EUI), we investigate 59 EUV upflow-like events observed in\nthe quiet Sun. Their average apparent (plane-of-sky) velocity, lifetime, and\npropagation distance are measured as 62 $\\speed$, 68.6 s and 3.94 Mm,\nrespectively. These upflow-like events exhibit dynamic characteristics but lack\nbase brightening, featuring a hot front and subsequent cold plasma ejection.\n39\\% of the EUV upflow-like events exhibit recurrent characteristics.\nUnprecedented high-resolution 174 \\AA~observations reveal that some EUV\nupflow-like events exhibit blob-like fine structures and multi-strand\nevolutionary features, and some upflow-like events can cause localized\nhaze-like plasma heating ahead of their spire region during the ejection\nprocess. A subset of the EUV upflow-like events covered by the Solar Dynamics\nObservatory reveals that they appear at the chromospheric networks. Through\nemission measure analysis, we found that these upflow-like events eject hot\nplasma of transient region or coronal temperature (an average of\n$\\sim$10$^{5.5}$K). We suggest that EUV upflow-like events may be EUV\ncounterparts of chromospheric spicules and/or transition region network jets,\nand play a role in heating localized corona above the network regions.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"v4ahII97VArD_Jwa9XasH_hXI35C4UfMC5aec2xrEII","pdfSize":"32908458"}