{"id":"2412.17298","title":"Prompting in the Wild: An Empirical Study of Prompt Evolution in\n  Software Repositories","authors":"Mahan Tafreshipour, Aaron Imani, Eric Huang, Eduardo Almeida, Thomas\n  Zimmermann, Iftekhar Ahmed","authorsParsed":[["Tafreshipour","Mahan",""],["Imani","Aaron",""],["Huang","Eric",""],["Almeida","Eduardo",""],["Zimmermann","Thomas",""],["Ahmed","Iftekhar",""]],"versions":[{"version":"v1","created":"Mon, 23 Dec 2024 05:41:01 GMT"},{"version":"v2","created":"Sun, 12 Jan 2025 20:13:35 GMT"}],"updateDate":"2025-01-14","timestamp":1734932461000,"abstract":"  The adoption of Large Language Models (LLMs) is reshaping software\ndevelopment as developers integrate these LLMs into their applications. In such\napplications, prompts serve as the primary means of interacting with LLMs.\nDespite the widespread use of LLM-integrated applications, there is limited\nunderstanding of how developers manage and evolve prompts. This study presents\nthe first empirical analysis of prompt evolution in LLM-integrated software\ndevelopment. We analyzed 1,262 prompt changes across 243 GitHub repositories to\ninvestigate the patterns and frequencies of prompt changes, their relationship\nwith code changes, documentation practices, and their impact on system\nbehavior. Our findings show that developers primarily evolve prompts through\nadditions and modifications, with most changes occurring during feature\ndevelopment. We identified key challenges in prompt engineering: only 21.9% of\nprompt changes are documented in commit messages, changes can introduce logical\ninconsistencies, and misalignment often occurs between prompt changes and LLM\nresponses. These insights emphasize the need for specialized testing\nframeworks, automated validation tools, and improved documentation practices to\nenhance the reliability of LLM-integrated applications.\n","subjects":["Computer Science/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"-_TK1eLjcl6uWkw54icM7X5B4msQUtShzvuD1hc3utY","pdfSize":"621130"}