{"id":"2412.19961","title":"Incentivizing supplemental math assignments and using AI-generated hints\n  improve exam performance, especially for racially minoritized students","authors":"Yifan Lu, K. Supriya, Shanna Shaked, Elizabeth H. Simmons, Alexander\n  Kusenko","authorsParsed":[["Lu","Yifan",""],["Supriya","K.",""],["Shaked","Shanna",""],["Simmons","Elizabeth H.",""],["Kusenko","Alexander",""]],"versions":[{"version":"v1","created":"Sat, 28 Dec 2024 00:21:51 GMT"}],"updateDate":"2024-12-31","timestamp":1735345311000,"abstract":"  Inequities in student access to trigonometry and calculus are often\nassociated with racial and socioeconomic privilege, and are often propagated to\nintroductory physics course performance. To mitigate these disparities in\nstudent preparedness, we developed a two-pronged intervention consisting of (1)\nincentivized supplemental mathematics assignments and (2) AI-generated learning\nsupport tools in the forms of optional hints embedded in the physics\nassignments. Both interventions are grounded in the Situated Expectancy-Value\nTheory of Achievement Motivation, which posits that students are more likely to\ncomplete a task that they expect to do well in and whose outcomes they think\nare valuable. For the supplemental math assignments, the extra credit available\nwas scaled to make it worth more points for the students with lower exam\nscores, thereby creating even greater value for the students who might most\nbenefit from the assignments. For the AI-generated hints, these were integrated\ninto the homework assignments, thereby reducing or eliminating the cost to the\nstudent, in terms of time, energy, and social barriers or fear of judgment. Our\nfindings indicate that both these interventions are associated with increased\nexam scores; in particular, the scaled extra credit reduced disparities in\ncompletion of math supplemental material and was associated with reducing\nracial disparities in exam scores. These interventions, which are relatively\nsimple for any instructor to implement, are therefore very promising for\ncreating more equitable undergraduate quantitative-based courses.\n","subjects":["Physics/Physics Education"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Jk0ykj5pjxGkU1j49eFmFNsIRwSj52t0AIcPZZMoc9c","pdfSize":"575771"}