{"id":"2412.15506","title":"Optical QPOs with 550 day periodicity in the reverberation mapped broad\n  line quasar PG 1411+442","authors":"XueGuang Zhang (GXU)","authorsParsed":[["Zhang","XueGuang","","GXU"]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 02:39:50 GMT"}],"updateDate":"2024-12-23","timestamp":1734662390000,"abstract":"  In this manuscript, optical quasi-periodic oscillations (QPOs) with 550 day\nperiodicity related to a candidate of sub-pc binary black hole (BBH) system are\nreported in the reverberation mapped broad line quasar PG 1411+442 but with\ndifferent line profile of broad H$\\alpha$ from that of broad H$\\beta$ in its\nrms spectrum. First, considering sine function to describe the 18.8years-long\nlight curves from the CSS, ASAS-SN and ZTF, 550days periodicity can be\nconfirmed with confidence level higher than 5$\\sigma$. Second, the stable\n550days optical QPOs can be re-confirmed with confidence levels higher than\n5$\\sigma$ by the Generalized Lomb-Scargle periodogram, the sine-like\nphase-folded light curves and the WWZ technique determined power maps. Third,\nbased on simulated light curves by CAR process, confidence level higher than\n$3.5\\sigma$ can be confirmed for the optical QPOs not related to intrinsic AGN\nvariability. Moreover, considering spatial separation of central two BH\naccreting systems smaller than expected sizes of broad emission line regions\n(BLRs), central total BH mass higher than $10^6{\\rm M_\\odot}$ could lead to few\neffects of supposed BBH systems on estimated virial BH masses. Meanwhile, disk\nprecession is not preferred due to the similar estimated sizes of optical and\nNUV emission regions, and jet precession can be ruled out due to PG 1411+442 as\na radio quiet quasar. The results strongly indicate it would be practicable by\napplying very different line profiles of broad Balmer emission lines to detect\ncandidates of BBH systems in normal broad line AGN in the near future.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"YEGOZwKoEIiROiNRbS2C4Cnb2s1XfBLlh5KmC3-38G8","pdfSize":"2290558"}