{
  "id": "2412.15363",
  "title": "Making Transparency Advocates: An Educational Approach Towards Better\n  Algorithmic Transparency in Practice",
  "authors": "Andrew Bell and Julia Stoyanovich",
  "authorsParsed": [
    [
      "Bell",
      "Andrew",
      ""
    ],
    [
      "Stoyanovich",
      "Julia",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 19:49:59 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734637799000,
  "abstract": "  Concerns about the risks and harms posed by artificial intelligence (AI) have\nresulted in significant study into algorithmic transparency, giving rise to a\nsub-field known as Explainable AI (XAI). Unfortunately, despite a decade of\ndevelopment in XAI, an existential challenge remains: progress in research has\nnot been fully translated into the actual implementation of algorithmic\ntransparency by organizations. In this work, we test an approach for addressing\nthe challenge by creating transparency advocates, or motivated individuals\nwithin organizations who drive a ground-up cultural shift towards improved\nalgorithmic transparency.\n  Over several years, we created an open-source educational workshop on\nalgorithmic transparency and advocacy. We delivered the workshop to\nprofessionals across two separate domains to improve their algorithmic\ntransparency literacy and willingness to advocate for change. In the weeks\nfollowing the workshop, participants applied what they learned, such as\nspeaking up for algorithmic transparency at an organization-wide AI strategy\nmeeting. We also make two broader observations: first, advocacy is not a\nmonolith and can be broken down into different levels. Second, individuals'\nwillingness for advocacy is affected by their professional field. For example,\nnews and media professionals may be more likely to advocate for algorithmic\ntransparency than those working at technology start-ups.\n",
  "subjects": [
    "Computer Science/Computers and Society",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Human-Computer Interaction"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "95iaQxx428UZlRguNVg1yZqhAwiYBG-Mmnh_wk5tATs",
  "pdfSize": "792076"
}