{"id":"2412.09288","title":"Explicit formulas for forced convection in a shrouded longitudinal-fin\n  heat sink with clearance","authors":"Toby L. Kirk, Marc Hodes","authorsParsed":[["Kirk","Toby L.",""],["Hodes","Marc",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 13:58:32 GMT"}],"updateDate":"2024-12-13","timestamp":1734011912000,"abstract":"  We consider laminar forced convection in a shrouded longitudinal-fin heat\nsink (LFHS) with tip clearance, as described by the pioneering study of\nSparrow, Baliga and Patankar [1978, J. Heat Trans, 100(4)]. The base of the\nLFHS is isothermal but the fins, while thin, are not isothermal, i.e., the\nconjugate heat transfer problem is of interest. Whereas Sparrow et al. solved\nthe fully developed flow and thermal problems numerically for a range of\ngeometries and fin conductivities, we consider here the physically realistic\nasymptotic limit where the fins are closely spaced, i.e. the spacing is small\nrelative to their height and the clearance above them. The flow problem in this\nlimit was considered by Miyoshi et al. [2024, J. Fluid Mech, 991, A2], and here\nwe consider the corresponding thermal problem. Using matched asymptotic\nexpansions, we find explicit solutions for the temperature field (in both the\nfluid and fins) and conjugate Nusselt numbers (local and average). The\nstructure of the asymptotic solutions provides insight into the results of\nSparrow et al.: the flow is highest in the gap above the fins, hence heat\ntransfer predominantly occurs close to the fin tips. The new formulas are\ncompared to numerical solutions and are found to be accurate for practical\nLFHSs. Significantly, existing analytical results for ducts are for boundaries\nthat are either wholly isothermal, wholly isoflux or with one of these\nconditions on each wall. Consequently, this study provides the first analytical\nresults for conjugate Nusselt numbers for flow through ducts.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"AmPnpHvdXvJ3C1vJvM0cAWJjxclmcpM9MTp5MmrVBNs","pdfSize":"1759650"}