{"id":"2412.16320","title":"Generalizing causal effect estimates to larger populations while\n  accounting for (uncertainty in) effect modifiers using a scaled Bayesian\n  bootstrap with application to estimating the effect of family planning on\n  employment in Nigeria","authors":"Lucas Godoy Garraza, Ilene Speizer, Leontine Alkema","authorsParsed":[["Garraza","Lucas Godoy",""],["Speizer","Ilene",""],["Alkema","Leontine",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 20:12:04 GMT"}],"updateDate":"2024-12-24","timestamp":1734725524000,"abstract":"  Strategies are needed to generalize causal effects from a sample that may\ndiffer systematically from the population of interest. In a motivating case\nstudy, interest lies in the causal effect of family planning on\nempowerment-related outcomes among urban Nigerian women, while estimates of\nthis effect and its variation by covariates are available only from a sample of\nwomen in six Nigerian cities. Data on covariates in target populations are\navailable from a complex sampling design survey. Our approach, analogous to the\nplug-in g-formula, takes the expectation of conditional average treatment\neffects from the source study over the covariate distribution in the target\npopulation. This method leverages generalizability literature from randomized\ntrials, applied to a source study using principal stratification for\nidentification. The approach uses a scaled Bayesian bootstrap to account for\nthe complex sampling design. We also introduce checks for sensitivity to\nplausible departures of assumptions. In our case study, the average effect in\nthe target population is higher than in the source sample based on point\nestimates and sensitivity analysis shows that a strong omitted effect modifier\nmust be present in at least 40% of the target population for the 95% credible\ninterval to include the null effect.\n","subjects":["Statistics/Methodology","Statistics/Applications"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"g_vB5wmWfQD63clNlPnabOqquIZap2UbWos0Bf1sRmk","pdfSize":"786962"}