{"id":"2412.20971","title":"Genuine quantum non-Gaussianity and metrological sensitivity of Fock\n  states prepared in a mechanical resonator","authors":"Q. Rumman Rahman, Igor Kladari\\'c, Max-Emanuel Kern, Yiwen Chu, Radim\n  Filip, Matteo Fadel","authorsParsed":[["Rahman","Q. Rumman",""],["Kladarić","Igor",""],["Kern","Max-Emanuel",""],["Chu","Yiwen",""],["Filip","Radim",""],["Fadel","Matteo",""]],"versions":[{"version":"v1","created":"Mon, 30 Dec 2024 14:19:22 GMT"},{"version":"v2","created":"Fri, 3 Jan 2025 09:04:06 GMT"}],"updateDate":"2025-01-06","timestamp":1735568362000,"abstract":"  Fock states of the quantum harmonic oscillator are fundamental to quantum\nsensing and information processing, serving as key resources for exploiting\nbosonic degrees of freedom. Here, we prepare high Fock states in a\nhigh-overtone bulk acoustic wave resonator (HBAR) by coupling it to a\nsuperconducting qubit and applying microwave pulses designed using quantum\noptimal control. We characterize the experimentally realized states by\nemploying a criterion for genuine quantum non-Gaussianity (QNG) designed to\nreveal multiphonon contributions. Although energy relaxation and decoherence\nlimit the achievable fidelities, we demonstrate genuine QNG features compatible\nwith Fock state $\\vert 6\\rangle$, confirming that the prepared states cannot be\ngenerated through Gaussian operations on states with up to Fock state $\\vert\n5\\rangle$ contributions. We further investigate the robustness of these QNG\nfeatures to losses and their utility in sensing displacement amplitudes. In\nparticular, we introduce a hierarchy based on the quantum Fisher information\nand show that, despite decoherence and measurement imperfections, the prepared\nstates achieve a displacement sensitivity surpassing that of an ideal Fock\nstate $\\vert 3\\rangle$. Our results have immediate applications in quantum\nsensing and simulations with HBAR devices.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"WlW4QH7b2i132eSDc1ZxCHvZValAjDKQLpf8soS8WKc","pdfSize":"3716350"}