{
  "id": "2412.18389",
  "title": "Agreement of Image Quality Metrics with Radiological Evaluation in the\n  Presence of Motion Artifacts",
  "authors": "Elisa Marchetto, Hannah Eichhorn, Daniel Gallichan, Julia A. Schnabel,\n  and Melanie Ganz",
  "authorsParsed": [
    [
      "Marchetto",
      "Elisa",
      ""
    ],
    [
      "Eichhorn",
      "Hannah",
      ""
    ],
    [
      "Gallichan",
      "Daniel",
      ""
    ],
    [
      "Schnabel",
      "Julia A.",
      ""
    ],
    [
      "Ganz",
      "Melanie",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 24 Dec 2024 12:21:37 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1735042897000,
  "abstract": "  Purpose: Reliable image quality assessment is crucial for evaluating new\nmotion correction methods for magnetic resonance imaging. In this work, we\ncompare the performance of commonly used reference-based and reference-free\nimage quality metrics on a unique dataset with real motion artifacts. We\nfurther analyze the image quality metrics' robustness to typical pre-processing\ntechniques.\n  Methods: We compared five reference-based and five reference-free image\nquality metrics on data acquired with and without intentional motion (2D and 3D\nsequences). The metrics were recalculated seven times with varying\npre-processing steps. The anonymized images were rated by radiologists and\nradiographers on a 1-5 Likert scale. Spearman correlation coefficients were\ncomputed to assess the relationship between image quality metrics and observer\nscores.\n  Results: All reference-based image quality metrics showed strong correlation\nwith observer assessments, with minor performance variations across sequences.\nAmong reference-free metrics, Average Edge Strength offers the most promising\nresults, as it consistently displayed stronger correlations across all\nsequences compared to the other reference-free metrics. Overall, the strongest\ncorrelation was achieved with percentile normalization and restricting the\nmetric values to the skull-stripped brain region. In contrast, correlations\nwere weaker when not applying any brain mask and using min-max or no\nnormalization.\n  Conclusion: Reference-based metrics reliably correlate with radiological\nevaluation across different sequences and datasets. Pre-processing steps,\nparticularly normalization and brain masking, significantly influence the\ncorrelation values. Future research should focus on refining pre-processing\ntechniques and exploring machine learning approaches for automated image\nquality evaluation.\n",
  "subjects": [
    "Physics/Medical Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "UFUjtkAYzEtb2SXLH5YFxCNwDRDcwJNJASAlj7EEqAM",
  "pdfSize": "2043835"
}