{"id":"2412.18413","title":"Relativistic Dynamics and Electron Transport in Isolated Chiral\n  Molecules","authors":"Sushant Kumar Behera, Ruggero Sala, Abhirup Roy Karmakar, Matteo\n  Moioli, Rocco Martinazzo, Matteo Cococcioni","authorsParsed":[["Behera","Sushant Kumar",""],["Sala","Ruggero",""],["Karmakar","Abhirup Roy",""],["Moioli","Matteo",""],["Martinazzo","Rocco",""],["Cococcioni","Matteo",""]],"versions":[{"version":"v1","created":"Tue, 24 Dec 2024 13:00:26 GMT"},{"version":"v2","created":"Tue, 7 Jan 2025 16:02:58 GMT"}],"updateDate":"2025-01-08","timestamp":1735045226000,"abstract":"  The Chirality-Induced Spin Selectivity (CISS) effect describes the ability of\nchiral molecules and crystals to transmit spin-polarized currents, a phenomenon\nfirst identified in 1999. Although this effect holds great promise for a broad\nspectrum of different applications in device physics and synthetic chemistry\n(including, e.g., spintronics, quantum computing, spin- and enantio-selective\nchemistry), its underlying mechanisms remain incompletely understood. The\nprevailing hypothesis attributes the CISS effect to enhanced spin-orbit\ncoupling (SOC) within chiral molecules. However, the SOC magnitude required to\nalign with experimental observations significantly exceeds the values derived\nfrom conventional atomic-scale calculations, particularly for systems composed\nof light atoms. In this work, we leverage the implementation of \\texttt{fully\nrelativistic density functional theory (DFT)} equations, as available in the\n\\texttt{Dirac code}, to investigate how molecular chirality manifests itself in\nthe chirality density of electronic states. We further explore how this\nresponds to an applied external electric field. To assess spin-dependent\ntransport, we employ the \\texttt{Landauer-Imry-B\\\"uttiker} formalism, examining\nthe dependence of spin transmission on the twist angle of the molecular\nstructure that defines its geometrical chirality. While our findings\nqualitatively align with experimental trends, they point to the necessity of a\nmore general treatment of SOC, \\textit{e.g.}, including geometrical terms or\nthrough the dependence of advanced exchange-correlation functionals on the\nelectronic spin-current density.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"QPDOHH0VHBjRaRUs9sZr3LInJHM9EZ59PFrFtqPZBCg","pdfSize":"726022"}