{
  "id": "2412.08966",
  "title": "Dynamics of swarmalators in the presence of a contrarian",
  "authors": "Gourab Kumar Sar, Sheida Ansarinasab, Fahimeh Nazarimehr, Farnaz\n  Ghassemi, Sajad Jafari, and Dibakar Ghosh",
  "authorsParsed": [
    [
      "Sar",
      "Gourab Kumar",
      ""
    ],
    [
      "Ansarinasab",
      "Sheida",
      ""
    ],
    [
      "Nazarimehr",
      "Fahimeh",
      ""
    ],
    [
      "Ghassemi",
      "Farnaz",
      ""
    ],
    [
      "Jafari",
      "Sajad",
      ""
    ],
    [
      "Ghosh",
      "Dibakar",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 05:59:52 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1733983192000,
  "abstract": "  Swarmalators are entities that combine the swarming behavior of particles\nwith the oscillatory dynamics of coupled phase oscillators and represent a\nnovel and rich area of study within the field of complex systems. Unlike\ntraditional models that treat spatial movement and phase synchronization\nseparately, swarmalators exhibit a unique coupling between their positions and\ninternal phases, leading to emergent behaviors that include clustering, pattern\nformation, and the coexistence of synchronized and desynchronized states etc.\nThis paper presents a comprehensive analysis of a two-dimensional swarmalator\nmodel in the presence of a predator-like agent that we call a contrarian. The\npositions and the phases of the swarmalators are influenced by the contrarian\nand we observe the emergence of intriguing collective states. We find that\nswarmalator phases are synchronized even with negative coupling strength when\ntheir interaction with the contrarian is comparatively strong. Through a\ncombination of analytical methods and simulations, we demonstrate how varying\nthese parameters can lead to transitions between different collective states.\n",
  "subjects": [
    "Nonlinear Sciences/Adaptation and Self-Organizing Systems",
    "Nonlinear Sciences/Chaotic Dynamics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "fcaaUwIPjZOp9-4NX_6jwCc-eHBoM_Y94w436fD5sN4",
  "pdfSize": "2098108"
}