{
  "id": "2412.15261",
  "title": "Blockchain in Environmental Sustainability Measures: a Survey",
  "authors": "Maria-Victoria Vladucu, Hailun Wu, Jorge Medina, Khondaker M. Salehin,\n  Ziqian Dong, Roberto Rojas-Cessa",
  "authorsParsed": [
    [
      "Vladucu",
      "Maria-Victoria",
      ""
    ],
    [
      "Wu",
      "Hailun",
      ""
    ],
    [
      "Medina",
      "Jorge",
      ""
    ],
    [
      "Salehin",
      "Khondaker M.",
      ""
    ],
    [
      "Dong",
      "Ziqian",
      ""
    ],
    [
      "Rojas-Cessa",
      "Roberto",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 19:28:45 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734377325000,
  "abstract": "  Real and effective regulation of contributions to greenhouse gas emissions\nand pollutants requires unbiased and truthful monitoring. Blockchain has\nemerged not only as an approach that provides verifiable economical\ninteractions but also as a mechanism to keep the measurement, monitoring,\nincentivation of environmental conservationist practices and enforcement of\npolicy. Here, we present a survey of areas in what blockchain has been\nconsidered as a response to concerns on keeping an accurate recording of\nenvironmental practices to monitor levels of pollution and management of\nenvironmental practices. We classify the applications of blockchain into\ndifferent segments of concerns, such as greenhouse gas emissions, solid waste,\nwater, plastics, food waste, and circular economy, and show the objectives for\nthe addressed concerns. We also classify the different blockchains and the\nexplored and designed properties as identified for the proposed solutions. At\nthe end, we provide a discussion about the niches and challenges that remain\nfor future research.\n",
  "subjects": [
    "Computer Science/Cryptography and Security",
    "Computer Science/Computers and Society"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "x46gwzcEP8iJ60qPjZIxvpPJjFCyBCJLXZvBclQewcI",
  "pdfSize": "2417435"
}