{"id":"2412.18343","title":"Low-temperature mean valence of nickel ions in pressurized\n  La$_3$Ni$_2$O$_7$","authors":"Shu Cai, Yazhou Zhou, Hualei Sun, Kai Zhang, Jinyu Zhao, Mengwu Huo,\n  Lucie Nataf, Yuxin Wang, Jie Li, Jing Guo, Kun Jiang, Meng Wang, Yang Ding,\n  Wenge Yang, Yi Lu, Qingyu Kong, Qi Wu, Jiangping Hu, Tao Xiang, Ho-kwang Mao\n  and Liling Sun","authorsParsed":[["Cai","Shu",""],["Zhou","Yazhou",""],["Sun","Hualei",""],["Zhang","Kai",""],["Zhao","Jinyu",""],["Huo","Mengwu",""],["Nataf","Lucie",""],["Wang","Yuxin",""],["Li","Jie",""],["Guo","Jing",""],["Jiang","Kun",""],["Wang","Meng",""],["Ding","Yang",""],["Yang","Wenge",""],["Lu","Yi",""],["Kong","Qingyu",""],["Wu","Qi",""],["Hu","Jiangping",""],["Xiang","Tao",""],["Mao","Ho-kwang",""],["Sun","Liling",""]],"versions":[{"version":"v1","created":"Tue, 24 Dec 2024 11:02:38 GMT"}],"updateDate":"2024-12-25","timestamp":1735038158000,"abstract":"  The discovery of high critical temperature (Tc) superconductivity in\npressurized La$_3$Ni$_2$O$_7$ has ignited renewed excitement in the search of\nnovel high-Tc superconducting compounds with 3d transition metals. Compared to\nother ambient-pressure superconductors, such as copper-oxide and\niron-oxypnictides, unraveling the mechanisms of the pressure-induced\nsuperconductivity poses significant and unique challenges. A critical factor in\nthis phenomenon seems to be related to the electronic configuration of 3d\norbitals, which may play a fundamental role in driving high-Tc\nsuperconductivity. However, the pressure effects on the mixed-valence states of\n3d-orbital cations and their influence on the emergence of high-Tc\nsuperconductivity remain poorly understood. Here, we use high-pressure (P) and\nlow-temperature synchrotron X-ray absorption spectroscopy to investigate the\ninfluence of pressure on the mean valence change of Ni ions in\nLa$_3$Ni$_2$O$_7$. Our results demonstrate that at a low-temperature of 20 K,\nthe mean valence remains relatively stable across the pressures range from 1\natm to 40 GPa. Based on analyzing the absorption data, we find that, at a\ncritical pressure, the ambient-pressure ordered phases disappear and both the\nstructural and the superconducting phase transition occur. The pressure-induced\nstructural phase transition revealed by our absorption results is consistent\nwith that determined by X-ray diffraction, offering new information for a\ncomprehensive understanding on the pressure-induced superconductivity in\nLa$_3$Ni$_2$O$_7$.\n","subjects":["Condensed Matter/Superconductivity"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"HLIgpN_DakJqKJ9iIEr-_rbsUldhCC7eQKYz5VeML6E","pdfSize":"1510947"}