{
  "id": "2412.02243",
  "title": "Alignment Parameters: Quantifying Dense Core Alignment in Star-forming\n  Regions",
  "authors": "Wei-An Chen, Ya-Wen Tang and Seamus D. Clarke",
  "authorsParsed": [
    [
      "Chen",
      "Wei-An",
      ""
    ],
    [
      "Tang",
      "Ya-Wen",
      ""
    ],
    [
      "Clarke",
      "Seamus D.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 08:16:21 GMT"
    }
  ],
  "updateDate": "2024-12-04",
  "timestamp": 1733213781000,
  "abstract": "  Recent high-resolution observations at millimeter (mm) and sub-mm reveal a\ndiverse spatial distribution for sub-pc scale dense cores within star-forming\nregions, ranging from clustered to aligned arrangements. To address the\nincreasing volume of observational and simulation data, we introduce \"alignment\nparameters\" as a quantitative and reproducible method to automatically assess\ncore alignment. We first demonstrate the effectiveness of these parameters by\napplying them to artificial test clumps and comparing the results with labels\nfrom visual inspection. A threshold value is then proposed to differentiate\nbetween \"clustered\" and \"aligned\" categories. Subsequently, we apply these\nparameters to dense cores identified from a sample of ALMA 1.3 mm dust\ncontinuum images in high-mass star-forming regions. Analysis exploring\ncorrelations between alignment parameters and clump properties rules out the\npresence of moderate or strong correlation, indicating that clump properties do\nnot appear to strongly influence the outcome of fragmentation. One possible\nexplanation for this is that the fragmentation process is chaotic, meaning that\nsmall variations in initial conditions can lead to significant differences in\nfragmentation outcomes, thus obscuring any direct link between clump properties\nand core alignment/distribution.\n",
  "subjects": [
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "e_bbrBdENel8HMJyn07GXvx2g6ENWWbcjljr_a357wE",
  "pdfSize": "5202760"
}