{
  "id": "2412.11995",
  "title": "Combining Large Language Models with Tutoring System Intelligence: A\n  Case Study in Caregiver Homework Support",
  "authors": "Devika Venugopalan, Ziwen Yan, Conrad Borchers, Jionghao Lin, Vincent\n  Aleven",
  "authorsParsed": [
    [
      "Venugopalan",
      "Devika",
      ""
    ],
    [
      "Yan",
      "Ziwen",
      ""
    ],
    [
      "Borchers",
      "Conrad",
      ""
    ],
    [
      "Lin",
      "Jionghao",
      ""
    ],
    [
      "Aleven",
      "Vincent",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 17:22:40 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734369760000,
  "abstract": "  Caregivers (i.e., parents and members of a child's caring community) are\nunderappreciated stakeholders in learning analytics. Although caregiver\ninvolvement can enhance student academic outcomes, many obstacles hinder\ninvolvement, most notably knowledge gaps with respect to modern school\ncurricula. An emerging topic of interest in learning analytics is hybrid\ntutoring, which includes instructional and motivational support. Caregivers\nassert similar roles in homework, yet it is unknown how learning analytics can\nsupport them. Our past work with caregivers suggested that conversational\nsupport is a promising method of providing caregivers with the guidance needed\nto effectively support student learning. We developed a system that provides\ninstructional support to caregivers through conversational recommendations\ngenerated by a Large Language Model (LLM). Addressing known instructional\nlimitations of LLMs, we use instructional intelligence from tutoring systems\nwhile conducting prompt engineering experiments with the open-source Llama 3\nLLM. This LLM generated message recommendations for caregivers supporting their\nchild's math practice via chat. Few-shot prompting and combining real-time\nproblem-solving context from tutoring systems with examples of tutoring\npractices yielded desirable message recommendations. These recommendations were\nevaluated with ten middle school caregivers, who valued recommendations\nfacilitating content-level support and student metacognition through\nself-explanation. We contribute insights into how tutoring systems can best be\nmerged with LLMs to support hybrid tutoring settings through conversational\nassistance, facilitating effective caregiver involvement in tutoring systems.\n",
  "subjects": [
    "Computer Science/Human-Computer Interaction",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Computers and Society"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "FiMz9sL_60T-TfMZjc871NghE4o6nCz3MAV5lPRa74M",
  "pdfSize": "796141"
}