{"id":"2412.09907","title":"IQViC: In-context, Question Adaptive Vision Compressor for Long-term\n  Video Understanding LMMs","authors":"Sosuke Yamao, Natsuki Miyahara, Yuki Harazono, Shun Takeuchi","authorsParsed":[["Yamao","Sosuke",""],["Miyahara","Natsuki",""],["Harazono","Yuki",""],["Takeuchi","Shun",""]],"versions":[{"version":"v1","created":"Fri, 13 Dec 2024 06:52:02 GMT"},{"version":"v2","created":"Mon, 16 Dec 2024 03:04:33 GMT"}],"updateDate":"2024-12-17","timestamp":1734072722000,"abstract":"  With the increasing complexity of video data and the need for more efficient\nlong-term temporal understanding, existing long-term video understanding\nmethods often fail to accurately capture and analyze extended video sequences.\nThese methods typically struggle to maintain performance over longer durations\nand to handle the intricate dependencies within the video content. To address\nthese limitations, we propose a simple yet effective large multi-modal model\nframework for long-term video understanding that incorporates a novel visual\ncompressor, the In-context, Question Adaptive Visual Compressor (IQViC). The\nkey idea, inspired by humans' selective attention and in-context memory\nmechanisms, is to introduce a novel visual compressor and incorporate efficient\nmemory management techniques to enhance long-term video question answering. Our\nframework utilizes IQViC, a transformer-based visual compressor, enabling\nquestion-conditioned in-context compression, unlike existing methods that rely\non full video visual features. This selectively extracts relevant information,\nsignificantly reducing memory token requirements. Through extensive experiments\non a new dataset based on InfiniBench for long-term video understanding, and\nstandard benchmarks used for existing methods' evaluation, we demonstrate the\neffectiveness of our proposed IQViC framework and its superiority over\nstate-of-the-art methods in terms of video understanding accuracy and memory\nefficiency.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"oruTkKMIGa8zhAEGB4pp6986UFyYbYSmfof9D5mJo4A","pdfSize":"636669"}