{
  "id": "2412.06333",
  "title": "Augmenting the action space with conventions to improve multi-agent\n  cooperation in Hanabi",
  "authors": "F. Bredell, H.A. Engelbrecht, and J.C. Schoeman",
  "authorsParsed": [
    [
      "Bredell",
      "F.",
      ""
    ],
    [
      "Engelbrecht",
      "H. A.",
      ""
    ],
    [
      "Schoeman",
      "J. C.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 09:34:40 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733736880000,
  "abstract": "  The card game Hanabi is considered a strong medium for the testing and\ndevelopment of multi-agent reinforcement learning (MARL) algorithms, due to its\ncooperative nature, hidden information, limited communication and remarkable\ncomplexity. Previous research efforts have explored the capabilities of MARL\nalgorithms within Hanabi, focusing largely on advanced architecture design and\nalgorithmic manipulations to achieve state-of-the-art performance for a various\nnumber of cooperators. However, this often leads to complex solution strategies\nwith high computational cost and requiring large amounts of training data. For\nhumans to solve the Hanabi game effectively, they require the use of\nconventions, which often allows for a means to implicitly convey ideas or\nknowledge based on a predefined, and mutually agreed upon, set of ``rules''.\nMulti-agent problems containing partial observability, especially when limited\ncommunication is present, can benefit greatly from the use of implicit\nknowledge sharing. In this paper, we propose a novel approach to augmenting the\naction space using conventions, which act as special cooperative actions that\nspan over multiple time steps and multiple agents, requiring agents to actively\nopt in for it to reach fruition. These conventions are based on existing human\nconventions, and result in a significant improvement on the performance of\nexisting techniques for self-play and cross-play across a various number of\ncooperators within Hanabi.\n",
  "subjects": [
    "Computer Science/Multiagent Systems",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "G1OdleCImfTm4fps6eKV0k3g5NDZKrHKNwrwCkvjpXw",
  "pdfSize": "8411549"
}