{
  "id": "2412.01658",
  "title": "Moire magnetism in CrBr3 multilayers emerging from differential strain",
  "authors": "Fengrui Yao, Dario Rossi, Ivo A. Gabrovski, Volodymyr Multian, Nelson\n  Hua, Kenji Watanabe, Takashi Taniguchi, Marco Gibertini, Ignacio\n  Gutierrez-Lezama, Louk Rademaker and Alberto F. Morpurgo",
  "authorsParsed": [
    [
      "Yao",
      "Fengrui",
      ""
    ],
    [
      "Rossi",
      "Dario",
      ""
    ],
    [
      "Gabrovski",
      "Ivo A.",
      ""
    ],
    [
      "Multian",
      "Volodymyr",
      ""
    ],
    [
      "Hua",
      "Nelson",
      ""
    ],
    [
      "Watanabe",
      "Kenji",
      ""
    ],
    [
      "Taniguchi",
      "Takashi",
      ""
    ],
    [
      "Gibertini",
      "Marco",
      ""
    ],
    [
      "Gutierrez-Lezama",
      "Ignacio",
      ""
    ],
    [
      "Rademaker",
      "Louk",
      ""
    ],
    [
      "Morpurgo",
      "Alberto F.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 16:06:36 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733155596000,
  "abstract": "  Interfaces between twisted 2D materials host a wealth of physical phenomena\noriginating from the long-scale periodicity associated with the resulting moire\nstructure. Besides twisting, an alternative route to create structures with\ncomparably long or even longer periodicities is inducing a differential strain\nbetween adjacent layers in a van der Waals (vdW) material. Despite recent\ntheoretical efforts analyzing its benefits, this route has not yet been\nimplemented experimentally. Here we report evidence for the simultaneous\npresence of ferromagnetic and antiferromagnetic regions in CrBr3 _a hallmark of\nmoire magnetism_ from the observation of an unexpected magnetoconductance in\nCrBr3 tunnel barriers with ferromagnetic Fe3GeTe2 and graphene electrodes. The\nobserved magnetoconductance evolves with temperature and magnetic field as the\nmagnetoconductance measured in small angle CrBr3 twisted junctions, in which\nmoire magnetism occurs. Consistent with Raman measurements and theoretical\nmodeling, we attribute the phenomenon to the presence of a differential strain\nin the CrBr3 multilayer, which locally modifies the stacking and the interlayer\nexchange between adjacent CrBr3 layers, resulting in spatially modulated spin\ntextures. Our conclusions indicate that inducing differential strain in vdW\nmultilayers is a viable strategy to create moire-like superlattices, which in\nthe future may offer in-situ continuous tunability even at low temperatures.\n",
  "subjects": [
    "Condensed Matter/Materials Science"
  ],
  "license": "http://creativecommons.org/publicdomain/zero/1.0/",
  "blobId": "cmvREkzudeAjWORdRQkXk3gJmqno1aFj4LM4GKXLSFk",
  "pdfSize": "743973"
}