{
  "id": "2412.18894",
  "title": "Comprehensive Study on Lumbar Disc Segmentation Techniques Using MRI\n  Data",
  "authors": "Serkan Salturk, Irem Sayin, Ibrahim Cem Balci, Taha Emre Pamukcu,\n  Zafer Soydan, Huseyin Uvet",
  "authorsParsed": [
    [
      "Salturk",
      "Serkan",
      ""
    ],
    [
      "Sayin",
      "Irem",
      ""
    ],
    [
      "Balci",
      "Ibrahim Cem",
      ""
    ],
    [
      "Pamukcu",
      "Taha Emre",
      ""
    ],
    [
      "Soydan",
      "Zafer",
      ""
    ],
    [
      "Uvet",
      "Huseyin",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 25 Dec 2024 12:54:52 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735131292000,
  "abstract": "  Lumbar disk segmentation is essential for diagnosing and curing spinal\ndisorders by enabling precise detection of disk boundaries in medical imaging.\nThe advent of deep learning has resulted in the development of many\nsegmentation methods, offering differing levels of accuracy and effectiveness.\nThis study assesses the effectiveness of several sophisticated deep learning\narchitectures, including ResUnext, Ef3 Net, UNet, and TransUNet, for lumbar\ndisk segmentation, highlighting key metrics like as Pixel Accuracy, Mean\nIntersection over Union (Mean IoU), and Dice Coefficient. The findings indicate\nthat ResUnext achieved the highest segmentation accuracy, with a Pixel Accuracy\nof 0.9492 and a Dice Coefficient of 0.8425, with TransUNet following closely\nafter. Filtering techniques somewhat enhanced the performance of most models,\nparticularly Dense UNet, improving stability and segmentation quality. The\nfindings underscore the efficacy of these models in lumbar disk segmentation\nand highlight potential areas for improvement.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Image and Video Processing",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "cHj4ckaqxXJ7KuGLOexRkFYkKkSGpDoM6vVqiDoNrZY",
  "pdfSize": "605815"
}