{
  "id": "2412.09445",
  "title": "Embeddings are all you need! Achieving High Performance Medical Image\n  Classification through Training-Free Embedding Analysis",
  "authors": "Raj Hansini Khoiwal and Alan B. McMillan",
  "authorsParsed": [
    [
      "Khoiwal",
      "Raj Hansini",
      ""
    ],
    [
      "McMillan",
      "Alan B.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 16:59:37 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1734022777000,
  "abstract": "  Developing artificial intelligence (AI) and machine learning (ML) models for\nmedical imaging typically involves extensive training and testing on large\ndatasets, consuming significant computational time, energy, and resources.\nThere is a need for more efficient methods that can achieve comparable or\nsuperior diagnostic performance without the associated resource burden. We\ninvestigated the feasibility of replacing conventional training procedures with\nan embedding-based approach that leverages concise and semantically meaningful\nrepresentations of medical images. Using pre-trained foundational\nmodels-specifically, convolutional neural networks (CNN) like ResNet and\nmultimodal models like Contrastive Language-Image Pre-training (CLIP)-we\ngenerated image embeddings for multi-class classification tasks. Simple linear\nclassifiers were then applied to these embeddings. The approach was evaluated\nacross diverse medical imaging modalities, including retinal images,\nmammography, dermatoscopic images, and chest radiographs. Performance was\ncompared to benchmark models trained and tested using traditional methods. The\nembedding-based models surpassed the benchmark area under the receiver\noperating characteristic curve (AUC-ROC) scores by up to 87 percentage in\nmulti-class classification tasks across the various medical imaging modalities.\nNotably, CLIP embedding models achieved the highest AUC-ROC scores,\ndemonstrating superior classification performance while significantly reducing\ncomputational demands. Our study indicates that leveraging embeddings from\npre-trained foundational models can effectively replace conventional,\nresource-intensive training and testing procedures in medical image analysis.\nThis embedding-based approach offers a more efficient alternative for image\nsegmentation, classification, and prediction, potentially accelerating AI\ntechnology integration into clinical practice.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Image and Video Processing",
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "7NaX4Na9JUjwwI0wpTm82h31F_Xe31B334h6K2Da2Pg",
  "pdfSize": "4513185"
}