{
  "id": "2412.16324",
  "title": "Structural and electronic properties of bulk Li$_{2}$O$_{2}$:\n  first-principles simulations based on numerical atomic orbitals",
  "authors": "Paul M. Masanja, Toraya Fern\\'andez-Ruiz, Esther J. Tarimo, Nayara\n  Carral-Sainz, P.V. Kanaka Rao, Vijay Singh, Bernard Mwankemwa, Juan Mar\\'ia\n  Garc\\'ia-Lastra, Pablo Garc\\'ia-Fern\\'andez, and Javier Junquera",
  "authorsParsed": [
    [
      "Masanja",
      "Paul M.",
      ""
    ],
    [
      "Fernández-Ruiz",
      "Toraya",
      ""
    ],
    [
      "Tarimo",
      "Esther J.",
      ""
    ],
    [
      "Carral-Sainz",
      "Nayara",
      ""
    ],
    [
      "Rao",
      "P. V. Kanaka",
      ""
    ],
    [
      "Singh",
      "Vijay",
      ""
    ],
    [
      "Mwankemwa",
      "Bernard",
      ""
    ],
    [
      "García-Lastra",
      "Juan María",
      ""
    ],
    [
      "García-Fernández",
      "Pablo",
      ""
    ],
    [
      "Junquera",
      "Javier",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 20:22:18 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734726138000,
  "abstract": "  The development of advanced materials with high specific energy is crucial\nfor enabling sustainable energy storage solutions, particularly in applications\nsuch as lithium-air batteries. Lithium peroxide (Li$_{2}$O$_{2}$) is a key\ndischarge product in non-aqueous lithium-air systems, where its structural and\nelectronic properties significantly influence battery performance. In this\nwork, we investigate the atomic structure, electronic band structure, and\nWannier functions of bulk Li$_{2}$O$_{2}$ using density functional theory. The\nperformance of different basis sets of numerical atomic orbitals are compared\nwith respect to a converged plane-wave basis results. We analyze the material's\nionic characteristics, the formation of molecular orbitals in oxygen dimers,\nand the band gap discrepancies between various computational approaches.\nFurthermore, we develop a localized Wannier basis to model electron-vibration\ninteractions and explore their implications for polaron formation. Our findings\nprovide a chemically intuitive framework for understanding electron-lattice\ncoupling and offer a basis for constructing reduced models that accurately\ndescribe the dynamics of polarons in Li$_{2}$O$_{2}$. These insights contribute\nto the broader goal of improving energy storage technologies and advancing the\nfield of materials design.\n",
  "subjects": [
    "Condensed Matter/Materials Science"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "dfOrvUrZrxq-5mTloYEzcuaqSYLJIx8zN9Fj_takFQk",
  "pdfSize": "47637480"
}