{"id":"2412.02933","title":"PopSweeper: Automatically Detecting and Resolving App-Blocking Pop-Ups\n  to Assist Automated Mobile GUI Testing","authors":"Linqiang Guo, Wei Liu, Yi Wen Heng, Tse-Hsun (Peter) Chen, Yang Wang","authorsParsed":[["Guo","Linqiang","","Peter"],["Liu","Wei","","Peter"],["Heng","Yi Wen","","Peter"],["Tse-Hsun","","","Peter"],["Chen","",""],["Wang","Yang",""]],"versions":[{"version":"v1","created":"Wed, 4 Dec 2024 01:05:44 GMT"}],"updateDate":"2024-12-05","timestamp":1733274344000,"abstract":"  Graphical User Interfaces (GUIs) are the primary means by which users\ninteract with mobile applications, making them crucial to both app\nfunctionality and user experience. However, a major challenge in automated\ntesting is the frequent appearance of app-blocking pop-ups, such as ads or\nsystem alerts, which obscure critical UI elements and disrupt test execution,\noften requiring manual intervention. These interruptions lead to inaccurate\ntest results, increased testing time, and reduced reliability, particularly for\nstakeholders conducting large-scale app testing. To address this issue, we\nintroduce PopSweeper, a novel tool designed to detect and resolve app-blocking\npop-ups in real-time during automated GUI testing. PopSweeper combines deep\nlearning-based computer vision techniques for pop-up detection and close button\nlocalization, allowing it to autonomously identify pop-ups and ensure\nuninterrupted testing. We evaluated PopSweeper on over 72K app screenshots from\nthe RICO dataset and 87 top-ranked mobile apps collected from app stores,\nmanually identifying 832 app-blocking pop-ups. PopSweeper achieved 91.7%\nprecision and 93.5% recall in pop-up classification and 93.9% BoxAP with 89.2%\nrecall in close button detection. Furthermore, end-to-end evaluations\ndemonstrated that PopSweeper successfully resolved blockages in 87.1% of apps\nwith minimal overhead, achieving classification and close button detection\nwithin 60 milliseconds per frame. These results highlight PopSweeper's\ncapability to enhance the accuracy and efficiency of automated GUI testing by\nmitigating pop-up interruptions.\n","subjects":["Computer Science/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"FJsa7Ppf6gqMR5OerWxeiDzQCQzXmL3q3p8wSnnWWsA","pdfSize":"3203347"}