{"id":"2412.12654","title":"CALA: A Class-Aware Logit Adapter for Few-Shot Class-Incremental\n  Learning","authors":"Chengyan Liu, Linglan Zhao, Fan Lyu, Kaile Du, Fuyuan Hu, Tao Zhou","authorsParsed":[["Liu","Chengyan",""],["Zhao","Linglan",""],["Lyu","Fan",""],["Du","Kaile",""],["Hu","Fuyuan",""],["Zhou","Tao",""]],"versions":[{"version":"v1","created":"Tue, 17 Dec 2024 08:21:46 GMT"}],"updateDate":"2024-12-18","timestamp":1734423706000,"abstract":"  Few-Shot Class-Incremental Learning (FSCIL) defines a practical but\nchallenging task where models are required to continuously learn novel concepts\nwith only a few training samples. Due to data scarcity, existing FSCIL methods\nresort to training a backbone with abundant base data and then keeping it\nfrozen afterward. However, the above operation often causes the backbone to\noverfit to base classes while overlooking the novel ones, leading to severe\nconfusion between them. To address this issue, we propose Class-Aware Logit\nAdapter (CALA). Our method involves a lightweight adapter that learns to\nrectify biased predictions through a pseudo-incremental learning paradigm. In\nthe real FSCIL process, we use the learned adapter to dynamically generate\nrobust balancing factors. These factors can adjust confused novel instances\nback to their true label space based on their similarity to base classes.\nSpecifically, when confusion is more likely to occur in novel instances that\nclosely resemble base classes, greater rectification is required. Notably, CALA\noperates on the classifier level, preserving the original feature space, thus\nit can be flexibly plugged into most of the existing FSCIL works for improved\nperformance. Experiments on three benchmark datasets consistently validate the\neffectiveness and flexibility of CALA. Codes will be available upon acceptance.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"gfXfnQmD8iq4YRtYZYg8Wvp3R8tnkn1OrzfzFa6c68w","pdfSize":"694914"}