{
  "id": "2412.19329",
  "title": "Deep learning and whole-brain networks for biomarker discovery: modeling\n  the dynamics of brain fluctuations in resting-state and cognitive tasks",
  "authors": "Facundo Roffet, Gustavo Deco, Claudio Delrieux, Gustavo Patow",
  "authorsParsed": [
    [
      "Roffet",
      "Facundo",
      ""
    ],
    [
      "Deco",
      "Gustavo",
      ""
    ],
    [
      "Delrieux",
      "Claudio",
      ""
    ],
    [
      "Patow",
      "Gustavo",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 26 Dec 2024 18:58:38 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735239518000,
  "abstract": "  Background: Brain network models offer insights into brain dynamics, but the\nutility of model-derived bifurcation parameters as biomarkers remains\nunderexplored. Objective: This study evaluates bifurcation parameters from a\nwhole-brain network model as biomarkers for distinguishing brain states\nassociated with resting-state and task-based cognitive conditions. Methods:\nSynthetic BOLD signals were generated using a supercritical Hopf brain network\nmodel to train deep learning models for bifurcation parameter prediction.\nInference was performed on Human Connectome Project data, including both\nresting-state and task-based conditions. Statistical analyses assessed the\nseparability of brain states based on bifurcation parameter distributions.\nResults: Bifurcation parameter distributions differed significantly across task\nand resting-state conditions ($p < 0.0001$ for all but one comparison).\nTask-based brain states exhibited higher bifurcation values compared to rest.\nConclusion: Bifurcation parameters effectively differentiate cognitive and\nresting states, warranting further investigation as biomarkers for brain state\ncharacterization and neurological disorder assessment.\n",
  "subjects": [
    "Quantitative Biology/Neurons and Cognition",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "jsEDB4rAdgyZWk-hNnVwJLil3B-tYsTxtzt780-RxPo",
  "pdfSize": "1318025"
}