{"id":"2412.06308","title":"PRECISE: Pre-training Sequential Recommenders with Collaborative and\n  Semantic Information","authors":"Chonggang Song, Chunxu Shen, Hao Gu, Yaoming Wu, Lingling Yi, Jie Wen,\n  Chuan Chen","authorsParsed":[["Song","Chonggang",""],["Shen","Chunxu",""],["Gu","Hao",""],["Wu","Yaoming",""],["Yi","Lingling",""],["Wen","Jie",""],["Chen","Chuan",""]],"versions":[{"version":"v1","created":"Mon, 9 Dec 2024 08:55:48 GMT"}],"updateDate":"2024-12-10","timestamp":1733734548000,"abstract":"  Real-world recommendation systems commonly offer diverse content scenarios\nfor users to interact with. Considering the enormous number of users in\nindustrial platforms, it is infeasible to utilize a single unified\nrecommendation model to meet the requirements of all scenarios. Usually,\nseparate recommendation pipelines are established for each distinct scenario.\nThis practice leads to challenges in comprehensively grasping users' interests.\nRecent research endeavors have been made to tackle this problem by pre-training\nmodels to encapsulate the overall interests of users. Traditional pre-trained\nrecommendation models mainly capture user interests by leveraging collaborative\nsignals. Nevertheless, a prevalent drawback of these systems is their\nincapacity to handle long-tail items and cold-start scenarios. With the recent\nadvent of large language models, there has been a significant increase in\nresearch efforts focused on exploiting LLMs to extract semantic information for\nusers and items. However, text-based recommendations highly rely on elaborate\nfeature engineering and frequently fail to capture collaborative similarities.\nTo overcome these limitations, we propose a novel pre-training framework for\nsequential recommendation, termed PRECISE. This framework combines\ncollaborative signals with semantic information. Moreover, PRECISE employs a\nlearning framework that initially models users' comprehensive interests across\nall recommendation scenarios and subsequently concentrates on the specific\ninterests of target-scene behaviors. We demonstrate that PRECISE precisely\ncaptures the entire range of user interests and effectively transfers them to\nthe target interests. Empirical findings reveal that the PRECISE framework\nattains outstanding performance on both public and industrial datasets.\n","subjects":["Computer Science/Information Retrieval","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"7nD-NpBfhkhS9IbjTScpgiD5I7B3LbActhFxvDZpgbw","pdfSize":"1329413"}