{"id":"2412.14963","title":"IDOL: Instant Photorealistic 3D Human Creation from a Single Image","authors":"Yiyu Zhuang, Jiaxi Lv, Hao Wen, Qing Shuai, Ailing Zeng, Hao Zhu,\n  Shifeng Chen, Yujiu Yang, Xun Cao, Wei Liu","authorsParsed":[["Zhuang","Yiyu",""],["Lv","Jiaxi",""],["Wen","Hao",""],["Shuai","Qing",""],["Zeng","Ailing",""],["Zhu","Hao",""],["Chen","Shifeng",""],["Yang","Yujiu",""],["Cao","Xun",""],["Liu","Wei",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 15:43:05 GMT"}],"updateDate":"2024-12-20","timestamp":1734622985000,"abstract":"  Creating a high-fidelity, animatable 3D full-body avatar from a single image\nis a challenging task due to the diverse appearance and poses of humans and the\nlimited availability of high-quality training data. To achieve fast and\nhigh-quality human reconstruction, this work rethinks the task from the\nperspectives of dataset, model, and representation. First, we introduce a\nlarge-scale HUman-centric GEnerated dataset, HuGe100K, consisting of 100K\ndiverse, photorealistic sets of human images. Each set contains 24-view frames\nin specific human poses, generated using a pose-controllable\nimage-to-multi-view model. Next, leveraging the diversity in views, poses, and\nappearances within HuGe100K, we develop a scalable feed-forward transformer\nmodel to predict a 3D human Gaussian representation in a uniform space from a\ngiven human image. This model is trained to disentangle human pose, body shape,\nclothing geometry, and texture. The estimated Gaussians can be animated without\npost-processing. We conduct comprehensive experiments to validate the\neffectiveness of the proposed dataset and method. Our model demonstrates the\nability to efficiently reconstruct photorealistic humans at 1K resolution from\na single input image using a single GPU instantly. Additionally, it seamlessly\nsupports various applications, as well as shape and texture editing tasks.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Graphics","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"4vLCMwKZeC7334NSlwaLg5u04oeQTRI93zBy85ISBbY","pdfSize":"35049628"}