{
  "id": "2412.17001",
  "title": "Solving Nonlinear Energy Supply and Demand System Using Physics-Informed\n  Neural Networks",
  "authors": "Van Truong Vo, Samad Noeiaghdam, Denis Sidorov, Aliona Dreglea, Liguo\n  Wang",
  "authorsParsed": [
    [
      "Vo",
      "Van Truong",
      ""
    ],
    [
      "Noeiaghdam",
      "Samad",
      ""
    ],
    [
      "Sidorov",
      "Denis",
      ""
    ],
    [
      "Dreglea",
      "Aliona",
      ""
    ],
    [
      "Wang",
      "Liguo",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 22 Dec 2024 12:37:59 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734871079000,
  "abstract": "  Nonlinear differential equations and systems play a crucial role in modeling\nsystems where time-dependent factors exhibit nonlinear characteristics. Due to\ntheir nonlinear nature, solving such systems often presents significant\ndifficulties and challenges. In this study, we propose a method utilizing\nPhysics-Informed Neural Networks (PINNs) to solve the nonlinear energy\nsupply-demand (ESD) system. We design a neural network with four outputs, where\neach output approximates a function that corresponds to one of the unknown\nfunctions in the nonlinear system of differential equations describing the\nfour-dimensional ESD problem. The neural network model is then trained and the\nparameters are identified, optimized to achieve a more accurate solution. The\nsolutions obtained from the neural network for this problem are equivalent when\nwe compare and evaluate them against the Runge-Kutta numerical method of order\n4/5 (RK45). However, the method utilizing neural networks is considered a\nmodern and promising approach, as it effectively exploits the superior\ncomputational power of advanced computer systems, especially in solving complex\nproblems. Another advantage is that the neural network model, after being\ntrained, can solve the nonlinear system of differential equations across a\ncontinuous domain. In other words, neural networks are not only trained to\napproximate the solution functions for the nonlinear ESD system but can also\nrepresent the complex dynamic relationships between the system's components.\nHowever, this approach requires significant time and computational power due to\nthe need for model training.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Numerical Analysis",
    "Mathematics/Numerical Analysis"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "sfA9SzpTJ_tWna2oBoqtV6cyH4-e_hTb4mupvT9jItM",
  "pdfSize": "2327402"
}