{"id":"2412.01998","title":"Hamiltonian characterisation of multi-time processes with classical\n  memory","authors":"Kaumudibikash Goswami, Abhinash Kumar Roy, Varun Srivastava, Barr\n  Perez, Christina Giarmatzi, Alexei Gilchrist, Fabio Costa","authorsParsed":[["Goswami","Kaumudibikash",""],["Roy","Abhinash Kumar",""],["Srivastava","Varun",""],["Perez","Barr",""],["Giarmatzi","Christina",""],["Gilchrist","Alexei",""],["Costa","Fabio",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 22:06:34 GMT"}],"updateDate":"2024-12-04","timestamp":1733177194000,"abstract":"  A central problem in the study of open quantum systems is the\ncharacterisation of non-Markovian processes, where an environment retains\nmemory of its interaction with the system. A key distinction is whether or not\nthis memory can be simulated classically, as this can lead to efficient\nmodelling and noise mitigation. Powerful tools have been developed recently\nwithin the process matrix formalism, a framework that conveniently\ncharacterises all multi-time correlations through a sequence of measurements.\nThis leads to a detailed classification of classical and quantum-memory\nprocesses and provides operational procedures to distinguish between them.\nHowever, these results leave open the question of what type of\nsystem-environment interactions lead to classical memory. More generally,\nprocess-matrix methods lack a direct connection to joint system-environment\nevolution, a cornerstone of open-system modelling. In this work, we\ncharacterise Hamiltonian and circuit-based models of system-environment\ninteractions leading to classical memory. We show that general time-dependent\nHamiltonians with product eigenstates, and where the environment's eigenstates\nform a time-independent, orthonormal basis, always produce a particular type of\nclassical memory: probabilistic mixtures of unitary processes. Additionally, we\nshow that the most general type of classical-memory processes can be generated\nby a quantum circuit in which system and environment interact through a\nspecific class of controlled unitaries. Our results establish the first strong\nlink between process-matrix methods and traditional Hamiltonian-based\napproaches to open quantum systems.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"MjsuMVoPUAoEbA1gUFj0w37EzmkKHk_YC40Da6C9K5I","pdfSize":"626949"}