{"id":"2412.00429","title":"Learner Attentiveness and Engagement Analysis in Online Education Using\n  Computer Vision","authors":"Sharva Gogawale, Madhura Deshpande, Parteek Kumar, Irad Ben-Gal","authorsParsed":[["Gogawale","Sharva",""],["Deshpande","Madhura",""],["Kumar","Parteek",""],["Ben-Gal","Irad",""]],"versions":[{"version":"v1","created":"Sat, 30 Nov 2024 10:54:08 GMT"}],"updateDate":"2024-12-03","timestamp":1732964048000,"abstract":"  In recent times, online education and the usage of video-conferencing\nplatforms have experienced massive growth. Due to the limited scope of a\nvirtual classroom, it may become difficult for instructors to analyze learners'\nattention and comprehension in real time while teaching. In the digital mode of\neducation, it would be beneficial for instructors to have an automated feedback\nmechanism to be informed regarding learners' attentiveness at any given time.\nThis research presents a novel computer vision-based approach to analyze and\nquantify learners' attentiveness, engagement, and other affective states within\nonline learning scenarios. This work presents the development of a multiclass\nmultioutput classification method using convolutional neural networks on a\npublicly available dataset - DAiSEE. A machine learning-based algorithm is\ndeveloped on top of the classification model that outputs a comprehensive\nattentiveness index of the learners. Furthermore, an end-to-end pipeline is\nproposed through which learners' live video feed is processed, providing\ndetailed attentiveness analytics of the learners to the instructors. By\ncomparing the experimental outcomes of the proposed method against those of\nprevious methods, it is demonstrated that the proposed method exhibits better\nattentiveness detection than state-of-the-art methods. The proposed system is a\ncomprehensive, practical, and real-time solution that is deployable and easy to\nuse. The experimental results also demonstrate the system's efficiency in\ngauging learners' attentiveness.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"LYzl_MfclHh5CCw4blcODX98w78Me1R4Vc94CWdrmPU","pdfSize":"2973835"}