{
  "id": "2412.02779",
  "title": "Synergistic Development of Perovskite Memristors and Algorithms for\n  Robust Analog Computing",
  "authors": "Nanyang Ye, Qiao Sun, Yifei Wang, Liujia Yang, Jundong Zhou, Lei Wang,\n  Guang-Zhong Yang, Xinbing Wang, Chenghu Zhou, Wei Ren, Leilei Gu, Huaqiang\n  Wu, Qinying Gu",
  "authorsParsed": [
    [
      "Ye",
      "Nanyang",
      ""
    ],
    [
      "Sun",
      "Qiao",
      ""
    ],
    [
      "Wang",
      "Yifei",
      ""
    ],
    [
      "Yang",
      "Liujia",
      ""
    ],
    [
      "Zhou",
      "Jundong",
      ""
    ],
    [
      "Wang",
      "Lei",
      ""
    ],
    [
      "Yang",
      "Guang-Zhong",
      ""
    ],
    [
      "Wang",
      "Xinbing",
      ""
    ],
    [
      "Zhou",
      "Chenghu",
      ""
    ],
    [
      "Ren",
      "Wei",
      ""
    ],
    [
      "Gu",
      "Leilei",
      ""
    ],
    [
      "Wu",
      "Huaqiang",
      ""
    ],
    [
      "Gu",
      "Qinying",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 19:20:08 GMT"
    },
    {
      "version": "v2",
      "created": "Mon, 9 Dec 2024 15:56:08 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733253608000,
  "abstract": "  Analog computing using non-volatile memristors has emerged as a promising\nsolution for energy-efficient deep learning. New materials, like\nperovskites-based memristors are recently attractive due to their\ncost-effectiveness, energy efficiency and flexibility. Yet, challenges in\nmaterial diversity and immature fabrications require extensive experimentation\nfor device development. Moreover, significant non-idealities in these\nmemristors often impede them for computing. Here, we propose a synergistic\nmethodology to concurrently optimize perovskite memristor fabrication and\ndevelop robust analog DNNs that effectively address the inherent non-idealities\nof these memristors. Employing Bayesian optimization (BO) with a focus on\nusability, we efficiently identify optimal materials and fabrication conditions\nfor perovskite memristors. Meanwhile, we developed \"BayesMulti\", a DNN training\nstrategy utilizing BO-guided noise injection to improve the resistance of\nanalog DNNs to memristor imperfections. Our approach theoretically ensures that\nwithin a certain range of parameter perturbations due to memristor\nnon-idealities, the prediction outcomes remain consistent. Our integrated\napproach enables use of analog computing in much deeper and wider networks,\nwhich significantly outperforms existing methods in diverse tasks like image\nclassification, autonomous driving, species identification, and large\nvision-language models, achieving up to 100-fold improvements. We further\nvalidate our methodology on a 10$\\times$10 optimized perovskite memristor\ncrossbar, demonstrating high accuracy in a classification task and low energy\nconsumption. This study offers a versatile solution for efficient optimization\nof various analog computing systems, encompassing both devices and algorithms.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Emerging Technologies"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "CTPXH4UFUyYMeaU3KKmSF-5YACfZ68GUuyy8QLxIAJ4",
  "pdfSize": "6847478"
}