{
  "id": "2412.01406",
  "title": "Marginal Role of the Electrostatic Instability in the GeV-scale Cascade\n  Flux from 1ES 0229+200",
  "authors": "Mahmoud Alawashra, Ievgen Vovk and Martin Pohl",
  "authorsParsed": [
    [
      "Alawashra",
      "Mahmoud",
      ""
    ],
    [
      "Vovk",
      "Ievgen",
      ""
    ],
    [
      "Pohl",
      "Martin",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 11:50:01 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733140201000,
  "abstract": "  Relativistic pair beams produced in the intergalactic medium (IGM) by TeV\ngamma rays from blazars are expected to generate a detectable GeV-scale\nelectromagnetic cascade, yet this cascade is absent in the observed spectra of\nhard-spectrum TeV emitting blazars. This suppression is often attributed to\nweak intergalactic magnetic fields (IGMF) deflecting electron-positron pairs\nout of the line of sight. Alternatively, it has been proposed that beam-plasma\ninstabilities could drain the energy of the beam before they produce the\nsecondary cascades. Recent studies suggest that the modification of beam\ndistribution due to these instabilities is primarily driven by particle\nscattering, rather than energy loss. In this paper, we quantitatively assess,\nfor the blazar 1ES 0229+200, the arrival time of secondary gamma rays at Earth\nfrom the beam scattering by the electrostatic instability. We first computed\nthe production rates of electron-positron pairs at various distances using the\nMonte Carlo simulation CRPropa. We then simulated the feedback of the plasma\ninstability on the beam, incorporating production rates and inverse-Compton\ncooling, to determine the steady-state distribution function. Our findings\nreveal that the time delay of the GeV secondary cascade arrival due to\ninstability broadening is on the order of a few months. This delay is\ninsufficient to account for the missing cascade emission in blazar spectra,\nsuggesting that plasma instabilities do not significantly affect IGMF\nconstraints.\n",
  "subjects": [
    "Astrophysics/High Energy Astrophysical Phenomena",
    "Physics/Plasma Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Lhrril4AjdbGlfXZ943eZK6wyOPY9tnd4HpZ_FwYPIw",
  "pdfSize": "1278906"
}