{
  "id": "2412.08108",
  "title": "Doubly-Universal Adversarial Perturbations: Deceiving Vision-Language\n  Models Across Both Images and Text with a Single Perturbation",
  "authors": "Hee-Seon Kim, Minbeom Kim, Changick Kim",
  "authorsParsed": [
    [
      "Kim",
      "Hee-Seon",
      ""
    ],
    [
      "Kim",
      "Minbeom",
      ""
    ],
    [
      "Kim",
      "Changick",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 05:23:34 GMT"
    },
    {
      "version": "v2",
      "created": "Thu, 19 Dec 2024 05:01:33 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1733894614000,
  "abstract": "  Large Vision-Language Models (VLMs) have demonstrated remarkable performance\nacross multimodal tasks by integrating vision encoders with large language\nmodels (LLMs). However, these models remain vulnerable to adversarial attacks.\nAmong such attacks, Universal Adversarial Perturbations (UAPs) are especially\npowerful, as a single optimized perturbation can mislead the model across\nvarious input images. In this work, we introduce a novel UAP specifically\ndesigned for VLMs: the Doubly-Universal Adversarial Perturbation (Doubly-UAP),\ncapable of universally deceiving VLMs across both image and text inputs. To\nsuccessfully disrupt the vision encoder's fundamental process, we analyze the\ncore components of the attention mechanism. After identifying value vectors in\nthe middle-to-late layers as the most vulnerable, we optimize Doubly-UAP in a\nlabel-free manner with a frozen model. Despite being developed as a black-box\nto the LLM, Doubly-UAP achieves high attack success rates on VLMs, consistently\noutperforming baseline methods across vision-language tasks. Extensive ablation\nstudies and analyses further demonstrate the robustness of Doubly-UAP and\nprovide insights into how it influences internal attention mechanisms.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Computation and Language",
    "Computer Science/Cryptography and Security"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "N3i3yIl5O97SyBqlAllTA9ak0qzbzRAtW1tLtsM8LNg",
  "pdfSize": "21830001"
}