{
  "id": "2412.11994",
  "title": "Fairness Shields: Safeguarding against Biased Decision Makers",
  "authors": "Filip Cano, Thomas A. Henzinger, Bettina K\\\"onighofer, Konstantin\n  Kueffner, Kaushik Mallik",
  "authorsParsed": [
    [
      "Cano",
      "Filip",
      ""
    ],
    [
      "Henzinger",
      "Thomas A.",
      ""
    ],
    [
      "Könighofer",
      "Bettina",
      ""
    ],
    [
      "Kueffner",
      "Konstantin",
      ""
    ],
    [
      "Mallik",
      "Kaushik",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 17:21:12 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734369672000,
  "abstract": "  As AI-based decision-makers increasingly influence human lives, it is a\ngrowing concern that their decisions are often unfair or biased with respect to\npeople's sensitive attributes, such as gender and race. Most existing bias\nprevention measures provide probabilistic fairness guarantees in the long run,\nand it is possible that the decisions are biased on specific instances of short\ndecision sequences. We introduce fairness shielding, where a symbolic\ndecision-maker -- the fairness shield -- continuously monitors the sequence of\ndecisions of another deployed black-box decision-maker, and makes interventions\nso that a given fairness criterion is met while the total intervention costs\nare minimized. We present four different algorithms for computing fairness\nshields, among which one guarantees fairness over fixed horizons, and three\nguarantee fairness periodically after fixed intervals. Given a distribution\nover future decisions and their intervention costs, our algorithms solve\ndifferent instances of bounded-horizon optimal control problems with different\nlevels of computational costs and optimality guarantees. Our empirical\nevaluation demonstrates the effectiveness of these shields in ensuring fairness\nwhile maintaining cost efficiency across various scenarios.\n",
  "subjects": [
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "l6jnWS0tQgXbnxJXFgyJQ5xsBPNuv7JtzEqBsWoI_mI",
  "pdfSize": "1232454"
}