{
  "id": "2412.20347",
  "title": "Designing Spin-driven Multiferroics in Altermagnets",
  "authors": "Ranquan Cao, Ruizhi Dong, Ruixiang Fei, and Yugui Yao",
  "authorsParsed": [
    [
      "Cao",
      "Ranquan",
      ""
    ],
    [
      "Dong",
      "Ruizhi",
      ""
    ],
    [
      "Fei",
      "Ruixiang",
      ""
    ],
    [
      "Yao",
      "Yugui",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 29 Dec 2024 04:29:47 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735446587000,
  "abstract": "  Spin-driven multiferroics exhibit strong magnetoelectric coupling, with\nnotable polarization changes under a magnetic field, but these effects are\nusually limited to high-Z magnetic insulators with low electronic polarization.\nIn this work, we introduce altermagnets as a promising platform for achieving\nstrong magnetoelectric coupling in low-Z systems with substantial polarization.\nThis large polarization arises from a design principle that utilizes the\nHeisenberg-like exchange striction mechanism, eliminating the reliance on\nspin-orbit coupling (SOC). This approach enables the Kramers-degenerate\nantiferromagnetic phase derived from altermagnetic insulators to achieve\nsubstantial polarization without spin splitting, providing a flexible platform\nfor regulating spin-splitting phenomena. Through first-principles simulations\nand an effective Landau-Ginzburg Hamiltonian, we demonstrate that materials in\nthe LiMnO2 family and strained RuF4 family can achieve polarization values\nexceeding 1.0 {\\mu}C/cm2, an order of magnitude larger than those found in\nSOC-driven multiferroics. Moreover, their magnetoelectric coupling is one to\ntwo orders of magnitude stronger than that observed in conventional\nmultiferroics and those driven by SOC.\n",
  "subjects": [
    "Condensed Matter/Materials Science",
    "Condensed Matter/Mesoscale and Nanoscale Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "BgBclpkW3ZfLSjIW0lFzd78G92PRfNLFRKXuT0gafA0",
  "pdfSize": "3155656"
}