{
  "id": "2412.12160",
  "title": "Climate Aware Deep Neural Networks (CADNN) for Wind Power Simulation",
  "authors": "Ali Forootani, Danial Esmaeili Aliabadi, Daniela Thraen",
  "authorsParsed": [
    [
      "Forootani",
      "Ali",
      ""
    ],
    [
      "Aliabadi",
      "Danial Esmaeili",
      ""
    ],
    [
      "Thraen",
      "Daniela",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 14:22:52 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1733926972000,
  "abstract": "  Wind power forecasting plays a critical role in modern energy systems,\nfacilitating the integration of renewable energy sources into the power grid.\nAccurate prediction of wind energy output is essential for managing the\ninherent intermittency of wind power, optimizing energy dispatch, and ensuring\ngrid stability. This paper proposes the use of Deep Neural Network (DNN)-based\npredictive models that leverage climate datasets, including wind speed,\natmospheric pressure, temperature, and other meteorological variables, to\nimprove the accuracy of wind power simulations. In particular, we focus on the\nCoupled Model Intercomparison Project (CMIP) datasets, which provide climate\nprojections, as inputs for training the DNN models. These models aim to capture\nthe complex nonlinear relationships between the CMIP-based climate data and\nactual wind power generation at wind farms located in Germany. Our study\ncompares various DNN architectures, specifically Multilayer Perceptron (MLP),\nLong Short-Term Memory (LSTM) networks, and Transformer-enhanced LSTM models,\nto identify the best configuration among these architectures for climate-aware\nwind power simulation. The implementation of this framework involves the\ndevelopment of a Python package (CADNN) designed to support multiple tasks,\nincluding statistical analysis of the climate data, data visualization,\npreprocessing, DNN training, and performance evaluation. We demonstrate that\nthe DNN models, when integrated with climate data, significantly enhance\nforecasting accuracy. This climate-aware approach offers a deeper understanding\nof the time-dependent climate patterns that influence wind power generation,\nproviding more accurate predictions and making it adaptable to other\ngeographical regions.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "1GtPJMzeJBcRrBXfbGw6jeaCgWHMiaLnYV2wwjWG8_g",
  "pdfSize": "2894969"
}