{"id":"2412.10195","title":"BAGELS for simultaneous polarization, orbit, and optics control in\n  electron storage rings","authors":"M. G. Signorelli and G. H. Hoffstaetter","authorsParsed":[["Signorelli","M. G.",""],["Hoffstaetter","G. H.",""]],"versions":[{"version":"v1","created":"Fri, 13 Dec 2024 15:10:33 GMT"}],"updateDate":"2024-12-16","timestamp":1734102633000,"abstract":"  We present a new method for minimizing the effects of radiative\ndepolarization in electron storage rings by use of a minimal number of special\nvertical orbit bumps. The bumps can be used to minimize the effects of\nradiative depolarization while simultaneously maintaining other common benefits\nof vertical orbits, e.g. transverse coupling and vertical dispersion control.\nBecause simultaneously optimizing the large number of vertical correctors in a\nring is operationally infeasible, we use dimensionality reduction to define a\nminimal number of most effective groups of vertical correctors that can be\noptimized during operation, motivating the name ``Best Adjustment Groups for\nELectron Spin'' (BAGELS). The method is streamlined by using suitable ``basis\nbumps'' instead of all individual vertical correctors. We define three types of\nbasis bumps for different purposes: (1) generates no delocalized transverse\ncoupling nor delocalized vertical dispersion, (2) generates no delocalized\nvertical dispersion, and (3) generates no delocalized transverse coupling.\nBAGELS has been essential in the design of the Electron Storage Ring (ESR) of\nthe Electron-Ion Collider (EIC), and will be beneficial for any polarized\nelectron ring, including FCC-ee. HERA and LEP would have likely benefitted as\nwell. We use BAGELS to significantly increase polarization in the 18 GeV\nEIC-ESR, beyond achievable with conventional methods; in the 1-IP lattice, we\nnearly double the asymptotic polarization, and in the 2-IP lattice we more than\ntriple the asymptotic polarization. We also use BAGELS to construct knobs that\ncan be used for global coupling correction, and knobs that generate vertical\nemittance for beam size matching, all while having minimal impacts on the\npolarization and orbit/optics.\n","subjects":["Physics/Accelerator Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"jrxFXoi-NEHWtjkvWsMvBqwju_ZpZxQLdrQsBQvzrcY","pdfSize":"2111713"}