{"id":"2412.02237","title":"Cross-Attention Head Position Patterns Can Align with Human Visual\n  Concepts in Text-to-Image Generative Models","authors":"Jungwon Park, Jungmin Ko, Dongnam Byun, Jangwon Suh, Wonjong Rhee","authorsParsed":[["Park","Jungwon",""],["Ko","Jungmin",""],["Byun","Dongnam",""],["Suh","Jangwon",""],["Rhee","Wonjong",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 08:05:56 GMT"},{"version":"v2","created":"Mon, 10 Feb 2025 12:57:09 GMT"},{"version":"v3","created":"Mon, 24 Feb 2025 14:59:37 GMT"}],"updateDate":"2025-02-25","timestamp":1733213156000,"abstract":"  Recent text-to-image diffusion models leverage cross-attention layers, which\nhave been effectively utilized to enhance a range of visual generative tasks.\nHowever, our understanding of cross-attention layers remains somewhat limited.\nIn this study, we introduce a mechanistic interpretability approach for\ndiffusion models by constructing Head Relevance Vectors (HRVs) that align with\nhuman-specified visual concepts. An HRV for a given visual concept has a length\nequal to the total number of cross-attention heads, with each element\nrepresenting the importance of the corresponding head for the given visual\nconcept. To validate HRVs as interpretable features, we develop an ordered\nweakening analysis that demonstrates their effectiveness. Furthermore, we\npropose concept strengthening and concept adjusting methods and apply them to\nenhance three visual generative tasks. Our results show that HRVs can reduce\nmisinterpretations of polysemous words in image generation, successfully modify\nfive challenging attributes in image editing, and mitigate catastrophic neglect\nin multi-concept generation. Overall, our work provides an advancement in\nunderstanding cross-attention layers and introduces new approaches for\nfine-controlling these layers at the head level.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"BWK3nYUuEVFtpWDdC6cRE3Dn_mxgMfm0OzKmkVp0KdM","pdfSize":"44884944"}