{"id":"2412.12809","title":"The interdependence between density PDF, CMF and IMF and their relation\n  with Mach number in simulations","authors":"Arturo Nu\\~nez-Casti\\~neyra, Matthias Gonz\\'alez, No\\'e Brucy, Patrick\n  Hennebelle, Fabien Louvet and Frederique Motte","authorsParsed":[["Nuñez-Castiñeyra","Arturo",""],["González","Matthias",""],["Brucy","Noé",""],["Hennebelle","Patrick",""],["Louvet","Fabien",""],["Motte","Frederique",""]],"versions":[{"version":"v1","created":"Tue, 17 Dec 2024 11:26:37 GMT"},{"version":"v2","created":"Wed, 18 Dec 2024 10:28:18 GMT"}],"updateDate":"2024-12-19","timestamp":1734434797000,"abstract":"  The initial mass function (IMF) of stars and the corresponding cloud mass\nfunction (CMF), traditionally considered universal, exhibit variations that are\ninfluenced by the local environment. Notably, these variations are apparent in\nthe distribution's tail, indicating a possible relationship between local\ndynamics and mass distribution. Our study is designed to examine how the gas\nPDF , the IMF and the CMF depend on the local turbulence within the\ninterstellar medium (ISM). We run hydrodynamical simulations on small\nstar-forming sections of the ISM under varying turbulence conditions,\ncharacterized by Mach numbers of 1, 3.5, and 10, and with two distinct mean\ndensities. This approach allowed us to observe the effects of different\nturbulence levels on the formation of stellar and cloud masses. The study\ndemonstrates a clear correlation between the dynamics of the cloud and the IMF.\nIn environments with lower levels of turbulence likely dominated by\ngravitational collapse, our simulations showed the formation of more massive\nstructures with a powerlaw gas PDF, leading to a top-heavy IMF and CMF. On the\nother hand environment dominated by turbulence result in a lognormal PDF and a\nSalpeter-like CMF and IMF. This indicates that the turbulence level is a\ncritical factor in determining the mass distribution within star-forming\nregions.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"TzSrFZd4S7wMS_7I9pP393h37c141DX8cCGbzJEfAd0","pdfSize":"1851484"}