{"id":"2412.08757","title":"Vision-based indoor localization of nano drones in controlled\n  environment with its applications","authors":"Simranjeet Singh, Amit Kumar, Fayyaz Pocker Chemban, Vikrant\n  Fernandes, Lohit Penubaku, Kavi Arya","authorsParsed":[["Singh","Simranjeet",""],["Kumar","Amit",""],["Chemban","Fayyaz Pocker",""],["Fernandes","Vikrant",""],["Penubaku","Lohit",""],["Arya","Kavi",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 19:55:38 GMT"}],"updateDate":"2024-12-13","timestamp":1733946938000,"abstract":"  Navigating unmanned aerial vehicles in environments where GPS signals are\nunavailable poses a compelling and intricate challenge. This challenge is\nfurther heightened when dealing with Nano Aerial Vehicles (NAVs) due to their\ncompact size, payload restrictions, and computational capabilities. This paper\nproposes an approach for localization using off-board computing, an off-board\nmonocular camera, and modified open-source algorithms. The proposed method uses\nthree parallel proportional-integral-derivative controllers on the off-board\ncomputer to provide velocity corrections via wireless communication,\nstabilizing the NAV in a custom-controlled environment. Featuring a 3.1cm\nlocalization error and a modest setup cost of 50 USD, this approach proves\noptimal for environments where cost considerations are paramount. It is\nespecially well-suited for applications like teaching drone control in academic\ninstitutions, where the specified error margin is deemed acceptable. Various\napplications are designed to validate the proposed technique, such as landing\nthe NAV on a moving ground vehicle, path planning in a 3D space, and localizing\nmulti-NAVs. The created package is openly available at\nhttps://github.com/simmubhangu/eyantra_drone to foster research in this field.\n","subjects":["Computer Science/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"t7JYdUvBJzxDqcTDPwSe2M-K9WpKZVP7IkSrBg3KqYk","pdfSize":"4373093"}