{
  "id": "2412.18285",
  "title": "Device-independent, high bit-rate quantum random number generator with\n  beam-splitter-free architecture and live Bell test certification",
  "authors": "Ayan Kumar Nai, Vimlesh Kumar, G. K. Samanta",
  "authorsParsed": [
    [
      "Nai",
      "Ayan Kumar",
      ""
    ],
    [
      "Kumar",
      "Vimlesh",
      ""
    ],
    [
      "Samanta",
      "G. K.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 24 Dec 2024 08:43:54 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1735029834000,
  "abstract": "  We present a beam-splitter-free, high-bit rate, device-independent quantum\nrandom number generator (DI-QRNG) with real-time quantumness certification via\nlive Bell test data. Using a 20-mm-long, type-0 phase-matched PPKTP crystal in\na polarization Sagnac interferometer, we generated degenerate, non-collinear\nparametric down-converted entangled photons at 810 nm in an annular ring\ndistribution with pair photons appearing at diametrically opposite points on\nthe ring randomly. Dividing the ring into six sections and collecting photons\nfrom opposite sections, we developed three entangled photon sources from a\nsingle resource (optics, laser, and nonlinear crystal). Using a pump power of\n12.4 mW at 405 nm, we recorded coincidence (1 ns window) timestamps of any two\nsources without projection to assign random bits (0 and 1) while measuring the\nBell parameter (S $>$ 2) with the third source for live quantumness\ncertification. We have generated 90 million raw bits in 46.4 seconds, with a\nminimum entropy extraction ratio exceeding 97$\\%$. Post-processed using a\nToeplitz matrix, the QRNG achieved a 1.8 Mbps bit rate, passing all NIST 800-22\nand TestU01 tests. Increasing the coincidence window to 2 ns boosts the bit\nrate to over 2 Mbps, maintaining minimum entropy above 95$\\%$ but reducing the\nBell parameter to S = 1.73. This novel scalable scheme eliminates beam\nsplitters, enabling robust, multi-bit DI-QRNG with enhanced ring sectioning and\ntrustworthy certification for practical high-rate applications.\n",
  "subjects": [
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "SnEVbnKqvZxPeJ9r_j2cjLceLc2i1CLws4b7ZvMxrkM",
  "pdfSize": "3857940"
}