{
  "id": "2412.13948",
  "title": "Surrogate-Based Optimization Techniques for Process Systems Engineering",
  "authors": "Mathias Neufang, Emma Pajak, Damien van de Berg, Ye Seol Lee, Ehecatl\n  Antonio del Rio Chanona",
  "authorsParsed": [
    [
      "Neufang",
      "Mathias",
      ""
    ],
    [
      "Pajak",
      "Emma",
      ""
    ],
    [
      "van de Berg",
      "Damien",
      ""
    ],
    [
      "Lee",
      "Ye Seol",
      ""
    ],
    [
      "Chanona",
      "Ehecatl Antonio del Rio",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 15:29:05 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734535745000,
  "abstract": "  Optimization plays an important role in chemical engineering, impacting\ncost-effectiveness, resource utilization, product quality, and process\nsustainability metrics. This chapter broadly focuses on data-driven\noptimization, particularly, on model-based derivative-free techniques, also\nknown as surrogate-based optimization. The chapter introduces readers to the\ntheory and practical considerations of various algorithms, complemented by a\nperformance assessment across multiple dimensions, test functions, and two\nchemical engineering case studies: a stochastic high-dimensional reactor\ncontrol study and a low-dimensional constrained stochastic reactor optimization\nstudy. This assessment sheds light on each algorithm's performance and\nsuitability for diverse applications. Additionally, each algorithm is\naccompanied by background information, mathematical foundations, and algorithm\ndescriptions. Among the discussed algorithms are Bayesian Optimization (BO),\nincluding state-of-the-art TuRBO, Constrained Optimization by Linear\nApproximation (COBYLA), the Ensemble Tree Model Optimization Tool (ENTMOOT)\nwhich uses decision trees as surrogates, Stable Noisy Optimization by Branch\nand Fit (SNOBFIT), methods that use radial basis functions such as DYCORS and\nSRBFStrategy, Constrained Optimization by Quadratic Approximations (COBYQA), as\nwell as a few others recognized for their effectiveness in surrogate-based\noptimization. By combining theory with practice, this chapter equips readers\nwith the knowledge to integrate surrogate-based optimization techniques into\nchemical engineering. The overarching aim is to highlight the advantages of\nsurrogate-based optimization, introduce state-of-the-art algorithms, and\nprovide guidance for successful implementation within process systems\nengineering.\n",
  "subjects": [
    "Mathematics/Optimization and Control"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "DAg9gaz4WwppGBbLL2dTjEdN1zujB-ECPzcGZNPV8D4",
  "pdfSize": "8458697"
}