{"id":"2412.06900","title":"Robust Catalysis and Resource Broadcasting: The Possible and the\n  Impossible","authors":"Jeongrak Son, Ray Ganardi, Shintaro Minagawa, Francesco Buscemi, Seok\n  Hyung Lie, Nelly H.Y. Ng","authorsParsed":[["Son","Jeongrak",""],["Ganardi","Ray",""],["Minagawa","Shintaro",""],["Buscemi","Francesco",""],["Lie","Seok Hyung",""],["Ng","Nelly H. Y.",""]],"versions":[{"version":"v1","created":"Mon, 9 Dec 2024 19:00:13 GMT"}],"updateDate":"2024-12-11","timestamp":1733770813000,"abstract":"  In resource theories, catalysis refers to the possibility of enabling\notherwise inaccessible quantum state transitions by providing the agent with an\nauxiliary system, under the condition that this auxiliary is returned to its\ninitial state at the end of the protocol. Most studies to date have focused on\nfine-tuned catalytic processes that are highly sensitive to error: if the\ninitial state of the system deviates even slightly from that for which the\ncatalyst was designed, the catalyst would be irreparably degraded. To address\nthis challenge, we introduce and study robust catalytic transformations and\nexplore the extent of their capabilities. It turns out that robust catalysis is\nsubtly related to the property of resource broadcasting. In particular, we show\nthat the possibility of robust catalysis is equivalent to that of resource\nbroadcasting in completely resource non-generating theories. This allows us to\ncharacterize a general class of resource theories that allow neither robust\ncatalysis nor resource broadcasting, and another class where instead resource\nbroadcasting and robust catalysis are possible and provide maximal advantage.\nOur approach encompasses a wide range of quantum resource theories, including\nentanglement, coherence, thermodynamics, magic, and imaginarity.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"yf9dp-d4Kvi3_nowW0wusJF2dOrGXSJRG72Op48qRaI","pdfSize":"462551"}