{
  "id": "2412.04017",
  "title": "Jets are the most robust observable ingredient of common envelope\n  evolution",
  "authors": "Noam Soker (Technion, Israel)",
  "authorsParsed": [
    [
      "Soker",
      "Noam",
      "",
      "Technion, Israel"
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 09:52:17 GMT"
    },
    {
      "version": "v2",
      "created": "Wed, 29 Jan 2025 08:15:13 GMT"
    }
  ],
  "updateDate": "2025-01-30",
  "timestamp": 1733392337000,
  "abstract": "  I examine images of 50 planetary nebulae (PNe) with observable post-common\nenvelope evolution (CEE) binary central stars and find that jets are about 40\npercent more common than dense equatorial outflows. Because, in some cases,\nenergetic jets can compress an equatorial outflow and because fast jets might\ndisperse early in the PN evolution and avoid detection, the CEE process is\nlikelier to launch jets than to eject a dense equatorial outflow by a larger\nfactor than 1.4. In most cases, the companion, mainly a main sequence star,\nlaunches the jets as it accretes mass from the envelope of the giant star. By\nCEE jets, I also refer to jets launched shortly before the onset of the CEE,\nlikely a grazing envelope evolution phase, and shortly after the CEE. The jets\nand the accretion of mass by the companion before, during, and after the CEE\naffect envelope mass removal and the final orbital separation. Most numerical\nsimulations of the CEE ignore jets, and those that include jets omit other\nprocesses. Despite the considerable progress in the last decade with tens of\nhydrodynamical simulations of the CEE, we are still far from correctly\nsimulating the CEE. Including jets in simulations of the CEE requires heavy\ncomputer resources, but it must be the next step.\n",
  "subjects": [
    "Astrophysics/Solar and Stellar Astrophysics",
    "Astrophysics/Astrophysics of Galaxies",
    "Astrophysics/High Energy Astrophysical Phenomena"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "X2hm76H92qy7eBLRP_UbdcEiDFm7yvhcuOGUDoTSMr4",
  "pdfSize": "610639"
}