{
  "id": "2412.07084",
  "title": "Atomic number estimation of dual energy cargo radiographs: initial\n  experimental results using a semiempirical transparency model",
  "authors": "Peter Lalor and Areg Danagoulian",
  "authorsParsed": [
    [
      "Lalor",
      "Peter",
      ""
    ],
    [
      "Danagoulian",
      "Areg",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 00:51:31 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733791891000,
  "abstract": "  To combat the risk of nuclear smuggling, radiography systems are deployed at\nports to scan cargo containers for concealed illicit materials. Dual energy\nradiography systems enable a rough elemental analysis of cargo containers due\nto the Z-dependence of photon attenuation, allowing for improved material\ndetection. This work presents our initial experimental findings using a novel\napproach to predict the atomic number of dual energy images of a loaded cargo\ncontainer. We consider measurements taken by a Rapiscan Sentry Portal scanner,\nwhich is a dual energy betatron-based system used to inspect cargo containers\nand large vehicles. We demonstrate the ability to accurately fit our\nsemiempirical transparency model to a set of calibration measurements. We then\nuse the calibrated model to reconstruct the atomic number of an unknown\nmaterial by minimizing the chi-squared error between the measured pixel values\nand the model predictions. We apply this methodology to two experimental scans\nof a loaded cargo container. First, we incorporate an image segmentation\nroutine to group clusters of pixels into larger, roughly homogeneous objects.\nBy considering groups of pixels, the subsequent atomic number reconstruction\nstep produces a lower noise result. We demonstrate the ability to accurately\nreconstruct the atomic number of blocks of steel and high density polyethylene.\nFurthermore, we are able to identify the presence of two high-Z lead test\nobjects, even when embedded within lower-Z organic shielding. These results\ndemonstrate the significant potential of this methodology to yield improved\nperformance characteristics over existing methods when applied to commercial\ndual energy systems.\n",
  "subjects": [
    "Physics/Instrumentation and Detectors",
    "Physics/Nuclear Experiment"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "scKfJknuY-K3CNM90zFvQQWZTEPeE75SpTqDzW8QOEk",
  "pdfSize": "1777771"
}