{
  "id": "2412.13356",
  "title": "Wind Speed Forecasting Based on Data Decomposition and Deep Learning\n  Models: A Case Study of a Wind Farm in Saudi Arabia",
  "authors": "Yasmeen Aldossary and Nabil Hewahi and Abdulla Alasaadi",
  "authorsParsed": [
    [
      "Aldossary",
      "Yasmeen",
      ""
    ],
    [
      "Hewahi",
      "Nabil",
      ""
    ],
    [
      "Alasaadi",
      "Abdulla",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 22:04:46 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734473086000,
  "abstract": "  With industrial and technological development and the increasing demand for\nelectric power, wind energy has gradually become the fastest-growing and most\nenvironmentally friendly new energy source. Nevertheless, wind power generation\nis always accompanied by uncertainty due to the wind speed's volatility. Wind\nspeed forecasting (WSF) is essential for power grids' dispatch, stability, and\ncontrollability, and its accuracy is crucial to effectively using wind\nresources. Therefore, this study proposes a novel WSF framework for stationary\ndata based on a hybrid decomposition method and the Bidirectional Long\nShort-term Memory (BiLSTM) to achieve high forecasting accuracy for the Dumat\nAl-Jandal wind farm in Al-Jouf, Saudi Arabia. The hybrid decomposition method\ncombines the Wavelet Packet Decomposition (WPD) and the Seasonal Adjustment\nMethod (SAM). The SAM method eliminates the seasonal component of the\ndecomposed subseries generated by WPD to reduce forecasting complexity. The\nBiLSTM is applied to forecast all the deseasonalized decomposed subseries. Five\nyears of hourly wind speed observations acquired from a location in the Al-Jouf\nregion were used to prove the effectiveness of the proposed model. The\ncomparative experimental results, including 27 other models, demonstrated the\nproposed model's superiority in single and multiple WSF with an overall average\nmean absolute error of 0.176549, root mean square error of 0.247069, and\nR-squared error of 0.985987.\n",
  "subjects": [
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "GWx2e_7iEe9YgPaun7VrTEVSfNRDlMWlVkcyMsGBECY",
  "pdfSize": "369653"
}