{"id":"2412.07686","title":"Optimizing Sensor Redundancy in Sequential Decision-Making Problems","authors":"Jonas N\\\"u{\\ss}lein, Maximilian Zorn, Fabian Ritz, Jonas Stein,\n  Gerhard Stenzel, Julian Sch\\\"onberger, Thomas Gabor and Claudia\n  Linnhoff-Popien","authorsParsed":[["Nüßlein","Jonas",""],["Zorn","Maximilian",""],["Ritz","Fabian",""],["Stein","Jonas",""],["Stenzel","Gerhard",""],["Schönberger","Julian",""],["Gabor","Thomas",""],["Linnhoff-Popien","Claudia",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 17:20:44 GMT"}],"updateDate":"2024-12-11","timestamp":1733851244000,"abstract":"  Reinforcement Learning (RL) policies are designed to predict actions based on\ncurrent observations to maximize cumulative future rewards. In real-world\napplications (i.e., non-simulated environments), sensors are essential for\nmeasuring the current state and providing the observations on which RL policies\nrely to make decisions. A significant challenge in deploying RL policies in\nreal-world scenarios is handling sensor dropouts, which can result from\nhardware malfunctions, physical damage, or environmental factors like dust on a\ncamera lens. A common strategy to mitigate this issue is the use of backup\nsensors, though this comes with added costs. This paper explores the\noptimization of backup sensor configurations to maximize expected returns while\nkeeping costs below a specified threshold, C. Our approach uses a second-order\napproximation of expected returns and includes penalties for exceeding cost\nconstraints. We then optimize this quadratic program using Tabu Search, a\nmeta-heuristic algorithm. The approach is evaluated across eight OpenAI Gym\nenvironments and a custom Unity-based robotic environment (RobotArmGrasping).\nEmpirical results demonstrate that our quadratic program effectively\napproximates real expected returns, facilitating the identification of optimal\nsensor configurations.\n","subjects":["Computer Science/Robotics","Computer Science/Artificial Intelligence","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Aw21hepc9BrW5SSvZ9wNUh6sPsC15jcnQ5zavZtUj1Q","pdfSize":"1254515"}