{
  "id": "2412.08460",
  "title": "Federated Learning for Traffic Flow Prediction with Synthetic Data\n  Augmentation",
  "authors": "Fermin Orozco, Pedro Porto Buarque de Gusm\\~ao, Hongkai Wen, Johan\n  Wahlstr\\\"om, Man Luo",
  "authorsParsed": [
    [
      "Orozco",
      "Fermin",
      ""
    ],
    [
      "de Gusmão",
      "Pedro Porto Buarque",
      ""
    ],
    [
      "Wen",
      "Hongkai",
      ""
    ],
    [
      "Wahlström",
      "Johan",
      ""
    ],
    [
      "Luo",
      "Man",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 15:25:38 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733930738000,
  "abstract": "  Deep-learning based traffic prediction models require vast amounts of data to\nlearn embedded spatial and temporal dependencies. The inherent privacy and\ncommercial sensitivity of such data has encouraged a shift towards\ndecentralised data-driven methods, such as Federated Learning (FL). Under a\ntraditional Machine Learning paradigm, traffic flow prediction models can\ncapture spatial and temporal relationships within centralised data. In reality,\ntraffic data is likely distributed across separate data silos owned by multiple\nstakeholders. In this work, a cross-silo FL setting is motivated to facilitate\nstakeholder collaboration for optimal traffic flow prediction applications.\nThis work introduces an FL framework, referred to as FedTPS, to generate\nsynthetic data to augment each client's local dataset by training a\ndiffusion-based trajectory generation model through FL. The proposed framework\nis evaluated on a large-scale real world ride-sharing dataset using various FL\nmethods and Traffic Flow Prediction models, including a novel prediction model\nwe introduce, which leverages Temporal and Graph Attention mechanisms to learn\nthe Spatio-Temporal dependencies embedded within regional traffic flow data.\nExperimental results show that FedTPS outperforms multiple other FL baselines\nwith respect to global model performance.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Distributed, Parallel, and Cluster Computing"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "NtLGN2geB5XzqaCWhRFh8-xNHrvmURCGjEXZqBgCU1U",
  "pdfSize": "9245967"
}