{
  "id": "2412.16245",
  "title": "Physical principles underpinning molecular-level protein evolution",
  "authors": "J.A. Vila",
  "authorsParsed": [
    [
      "Vila",
      "J. A.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 21:49:46 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734644986000,
  "abstract": "  Since protein mutations are the main driving force of evolution at the\nmolecular level, a proper analysis of them (and the factors controlling them)\nwill enable us to find a response to several crucial queries in evolutionary\nbiology. Among them, we highlight the following: At the molecular level, what\nfactors determine whether protein evolution is repeatable? Aiming at finding an\nanswer to this and several other significant questions behind protein\nevolvability and the factors that control it (including, but not limited to,\nthe proteins' robustness, the evolutionary pathways, the number of ancestors,\nthe epistasis, the post-translational modifications, and the location and order\nof mutations) we distinguish two evolutionary models in our analysis:\nconvergent and divergent, based on whether or not a target sequence needs to be\nreached after n-mutational steps beginning with a wild-type protein sequence\n(from an unknown ancestor). Preliminary results suggest (regardless of whether\nthe evolution is convergent or divergent) a tight relationship between the\nthermodynamic hypothesis (or Anfinsen's dogma) and protein evolution at the\nmolecular level. This conjecture will allow us to uncover how fundamental\nphysical principles guide protein evolution, and to gain a deeper grasp of\nmutationally driven evolutionary processes and the factors that influence them.\nBreaking down complex evolutionary problems into manageable pieces (without\ncompromising the vision of the problem as a whole) could lead to effective\nsolutions to critical evolutionary biology challenges, paving the way for\nfurther progress in this field.\n",
  "subjects": [
    "Quantitative Biology/Populations and Evolution",
    "Quantitative Biology/Biomolecules"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "fYxjrHBZDv1HbFJ68VcYeOEAquRLJuxBKiYlSFbI1kQ",
  "pdfSize": "431534"
}