{
  "id": "2412.05747",
  "title": "Charting the Shapes of Stories with Game Theory",
  "authors": "Constantinos Daskalakis, Ian Gemp, Yanchen Jiang, Renato Paes Leme,\n  Christos Papadimitriou, Georgios Piliouras",
  "authorsParsed": [
    [
      "Daskalakis",
      "Constantinos",
      ""
    ],
    [
      "Gemp",
      "Ian",
      ""
    ],
    [
      "Jiang",
      "Yanchen",
      ""
    ],
    [
      "Leme",
      "Renato Paes",
      ""
    ],
    [
      "Papadimitriou",
      "Christos",
      ""
    ],
    [
      "Piliouras",
      "Georgios",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 7 Dec 2024 21:12:16 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733605936000,
  "abstract": "  Stories are records of our experiences and their analysis reveals insights\ninto the nature of being human. Successful analyses are often\ninterdisciplinary, leveraging mathematical tools to extract structure from\nstories and insights from structure. Historically, these tools have been\nrestricted to one dimensional charts and dynamic social networks; however,\nmodern AI offers the possibility of identifying more fully the plot structure,\ncharacter incentives, and, importantly, counterfactual plot lines that the\nstory could have taken but did not take. In this work, we use AI to model the\nstructure of stories as game-theoretic objects, amenable to quantitative\nanalysis. This allows us to not only interrogate each character's decision\nmaking, but also possibly peer into the original author's conception of the\ncharacters' world. We demonstrate our proposed technique on Shakespeare's\nfamous Romeo and Juliet. We conclude with a discussion of how our analysis\ncould be replicated in broader contexts, including real-life scenarios.\n",
  "subjects": [
    "Computer Science/Computer Science and Game Theory",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "GwbEhBePYoGKfF7nFOZWyc1OGx9vnhBrgfQDv7n0RmI",
  "pdfSize": "977869"
}