{
  "id": "2412.10629",
  "title": "Rapid Reconstruction of Extremely Accelerated Liver 4D MRI via Chained\n  Iterative Refinement",
  "authors": "Di Xu, Xin Miao, Hengjie Liu, Jessica E. Scholey, Wensha Yang, Mary\n  Feng, Michael Ohliger, Hui Lin, Yi Lao, Yang Yang and Ke Sheng",
  "authorsParsed": [
    [
      "Xu",
      "Di",
      ""
    ],
    [
      "Miao",
      "Xin",
      ""
    ],
    [
      "Liu",
      "Hengjie",
      ""
    ],
    [
      "Scholey",
      "Jessica E.",
      ""
    ],
    [
      "Yang",
      "Wensha",
      ""
    ],
    [
      "Feng",
      "Mary",
      ""
    ],
    [
      "Ohliger",
      "Michael",
      ""
    ],
    [
      "Lin",
      "Hui",
      ""
    ],
    [
      "Lao",
      "Yi",
      ""
    ],
    [
      "Yang",
      "Yang",
      ""
    ],
    [
      "Sheng",
      "Ke",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 14 Dec 2024 00:43:11 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734136991000,
  "abstract": "  Abstract Purpose: High-quality 4D MRI requires an impractically long scanning\ntime for dense k-space signal acquisition covering all respiratory phases.\nAccelerated sparse sampling followed by reconstruction enhancement is desired\nbut often results in degraded image quality and long reconstruction time. We\nhereby propose the chained iterative reconstruction network (CIRNet) for\nefficient sparse-sampling reconstruction while maintaining clinically\ndeployable quality. Methods: CIRNet adopts the denoising diffusion\nprobabilistic framework to condition the image reconstruction through a\nstochastic iterative denoising process. During training, a forward Markovian\ndiffusion process is designed to gradually add Gaussian noise to the densely\nsampled ground truth (GT), while CIRNet is optimized to iteratively reverse the\nMarkovian process from the forward outputs. At the inference stage, CIRNet\nperforms the reverse process solely to recover signals from noise, conditioned\nupon the undersampled input. CIRNet processed the 4D data (3D+t) as temporal\nslices (2D+t). The proposed framework is evaluated on a data cohort consisting\nof 48 patients (12332 temporal slices) who underwent free-breathing liver 4D\nMRI. 3-, 6-, 10-, 20- and 30-times acceleration were examined with a\nretrospective random undersampling scheme. Compressed sensing (CS)\nreconstruction with a spatiotemporal constraint and a recently proposed deep\nnetwork, Re-Con-GAN, are selected as baselines. Results: CIRNet consistently\nachieved superior performance compared to CS and Re-Con-GAN. The inference time\nof CIRNet, CS, and Re-Con-GAN are 11s, 120s, and 0.15s. Conclusion: A novel\nframework, CIRNet, is presented. CIRNet maintains useable image quality for\nacceleration up to 30 times, significantly reducing the burden of 4DMRI.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Image and Video Processing",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "l-mz7Rbw-Tt9yR4nm8sGR36WpYiGs_paYKf9M6sCCm0",
  "pdfSize": "2459990"
}