{
  "id": "2412.13210",
  "title": "Domain Structure and Interface Control of Mechanical Stiffness in\n  Sustainable Cellulose Bio-nanocomposites",
  "authors": "Hanxun Jin, William Goldberg, Zhenqin Wang, Huiyong Li, Yuxuan Huang,\n  Marcus Foston, Guy M. Genin",
  "authorsParsed": [
    [
      "Jin",
      "Hanxun",
      ""
    ],
    [
      "Goldberg",
      "William",
      ""
    ],
    [
      "Wang",
      "Zhenqin",
      ""
    ],
    [
      "Li",
      "Huiyong",
      ""
    ],
    [
      "Huang",
      "Yuxuan",
      ""
    ],
    [
      "Foston",
      "Marcus",
      ""
    ],
    [
      "Genin",
      "Guy M.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 00:17:56 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1733703476000,
  "abstract": "  Renewable and biodegradable plastics derived from soy protein isolate (SPI)\noffer a promising alternative to conventional petroleum-based plastics,\nparticularly for film-grade bioplastics applications such as plastic bags.\nHowever, even with reinforcement from cellulose nanocrystals (CNCs), their\nmechanical properties including stiffness lag behind those of petroleum-based\nplastics. To identify pathways for improving CNC-reinforced SPI composites, we\nstudied stiffening mechanisms by interpreting experimental data using\nhomogenization models that accounted for CNC agglomeration and the formation of\nCNC/SPI interphases. To model effects of surface modification of CNCs with\npolydopamine (polyDOPA), we incorporated two key mechanisms: enhanced CNC\ndispersion and modified CNC-SPI interfacial interactions. Models accounted for\ninterphases surrounding CNCs, arising from physicochemical interactions with\nthe polyDOPA-modified CNC surfaces. Consistent wih experimental observations of\npolyDOPA modification enhancing mechanical properties through both increased\nspatial distribution of CNCs and matrix-filler interactions, results\ndemonstrated that improved dispersion and interfacial bonding contribute to\nincreased composite stiffness. Results highlight the potential of biodegradable\nCNC/SPI bio-nanocomposites as sustainable plastic alternatives, and suggest\npathways for further enhancing their mechanical properties.\n",
  "subjects": [
    "Physics/Biological Physics",
    "Condensed Matter/Materials Science"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "sOb8E1HgUPKbWWPIDXVquK142poUZ60qZX0YwNZ9ghI",
  "pdfSize": "7136281"
}