{
  "id": "2412.12818",
  "title": "Non-magnetic glass-fiber cryostat for MADMAX prototype tests",
  "authors": "D. Kreikemeyer-Lorenzo, T. Koettig, P. Borges de Sousa, C. Gooch, D.\n  Kittlinger, B. Majorovits, J.P.A. Maldonado, P. Pralavorio",
  "authorsParsed": [
    [
      "Kreikemeyer-Lorenzo",
      "D.",
      ""
    ],
    [
      "Koettig",
      "T.",
      ""
    ],
    [
      "de Sousa",
      "P. Borges",
      ""
    ],
    [
      "Gooch",
      "C.",
      ""
    ],
    [
      "Kittlinger",
      "D.",
      ""
    ],
    [
      "Majorovits",
      "B.",
      ""
    ],
    [
      "Maldonado",
      "J. P. A.",
      ""
    ],
    [
      "Pralavorio",
      "P.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 11:34:00 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 21 Jan 2025 16:01:25 GMT"
    }
  ],
  "updateDate": "2025-01-22",
  "timestamp": 1734435240000,
  "abstract": "  MADMAX, an axion dark matter search experiment, is currently in the prototype\ntesting phase. Its working principle is based on the conversion of axions in a\nmagnetic field into photons. This signal is then enhanced by a booster made of\ndielectric disks placed in front of a mirror. In order to test MADMAX\nprototypes at cryogenic temperatures in a magnetic field parallel to the disks,\na new G-10 glass-fiber cryostat of 0.25 m$^3$ inner volume was designed, tested\nand used in a CERN magnet. The design allows to minimise cost as well as\ncooling down and warming up times. Using continuous circulation flow of gaseous\nhelium, the MADMAX prototype was cooled down reproducibly to temperatures below\n10 K for more than 24 hours. This procedure allowed, for the first time, to\nperform a calibration of the booster response and to run a dark matter axion\nsearch in a magnetic field at low temperatures. This novel type of cryostat,\nwith a low manufacturing cost, fast and easy to operate, could be used for\nother purposes beyond MADMAX.\n",
  "subjects": [
    "Physics/Instrumentation and Detectors",
    "Physics/High Energy Physics - Experiment"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "mA4fbS2UxRQtOhPk03sflHwVTpRo1KubA3yi27jNorw",
  "pdfSize": "3428826"
}