{
  "id": "2412.03141",
  "title": "An Image Simulator of Lunar Far-Side Impact Flashes Captured from the\n  Earth-Moon L2 Point",
  "authors": "Da Song, Hong-bo Cai, Shen Wang and Jing Wang",
  "authorsParsed": [
    [
      "Song",
      "Da",
      ""
    ],
    [
      "Cai",
      "Hong-bo",
      ""
    ],
    [
      "Wang",
      "Shen",
      ""
    ],
    [
      "Wang",
      "Jing",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 09:07:31 GMT"
    }
  ],
  "updateDate": "2024-12-05",
  "timestamp": 1733303251000,
  "abstract": "  Impact flashes on the moon are caused by high-speed collisions of celestial\nbodies with the lunar surface. The study of the impacts is critical for\nexploring the evolutionary history and formation of the Moon, and for\nquantifying the risk posed by the impacts to future human activity. Although\nthe impacts have been monitored from the Earth by a few projects in past 20\nyears, the events occurring on the lunar far side have not been explored\nsystematically so far. We here present an end-to-end image simulator dedicated\nto detecting and monitoring the impacts from space, which is useful for future\nmission design. The simulator is designed for modularity and developed in the\nPython environment, which is mainly composed of four components: the flash\ntemporal radiation, the background emission, the telescope and the detector\nused to collect and measure the radiation. Briefly speaking, with a set of\ninput parameters, the simulator calculates the flash radiation in the context\nof the spherical droplet model and the background emission from the lunar\nsurface. The resulting images are then generated by the simulator after\nconsidering a series observational effects, including the stray light,\ntransmission of the instrument, point spread function and multiple kinds of\nnoise caused by a CCD/CMOS detector. The simulator is validated by comparing\nthe calculation with the observations taken on the ground. The modular design\nenables the simulator to be improved and enhanced by including more complex\nphysical models in the future, and to be flexible for other future space\nmissions.\n",
  "subjects": [
    "Astrophysics/Instrumentation and Methods for Astrophysics",
    "Astrophysics/Earth and Planetary Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "VLAImPDZL9_uxXa9-aaVlc7TVicAkZyA580_nJVELCM",
  "pdfSize": "602517"
}