{"id":"2412.07901","title":"Homophily Within and Across Groups","authors":"Abbas K. Rizi, Riccardo Michielan, Clara Stegehuis, Mikko Kivel\\\"a","authorsParsed":[["Rizi","Abbas K.",""],["Michielan","Riccardo",""],["Stegehuis","Clara",""],["Kivelä","Mikko",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 20:17:04 GMT"}],"updateDate":"2024-12-12","timestamp":1733861824000,"abstract":"  Traditional social network analysis often models homophily--the tendency of\nsimilar individuals to form connections--using a single parameter, overlooking\nfiner biases within and across groups. We present an exponential family model\nthat integrates both local and global homophily, distinguishing between strong\nhomophily within tightly knit cliques and weak homophily spanning broader\ncommunity interactions. By modeling these forms of homophily through a maximum\nentropy approach and deriving the network behavior under percolation, we show\nhow higher-order assortative mixing influences network dynamics. Our framework\nis useful for decomposing homophily into finer levels and studying the spread\nof information and diseases, influence dynamics, and innovation diffusion. We\ndemonstrate that the interaction between different levels of homophily results\nin complex percolation thresholds. We tested our model on various datasets with\ndistinct homophily patterns, showcasing its applicability. These homophilic\nconnections significantly affect the effectiveness of intervention and\nmitigation strategies. Hence, our findings have important implications for\nimproving public health measures, understanding information dissemination on\nsocial media, and optimizing intervention strategies.\n","subjects":["Physics/Physics and Society","Computer Science/Computers and Society","Mathematics/Probability","Physics/Data Analysis, Statistics and Probability"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"jCZT-lu87iPNBqSJMeMcBEg4-XcSS2Ot2pKLba6HXOA","pdfSize":"3514355"}