{
  "id": "2412.06810",
  "title": "I See, Therefore I Do: Estimating Causal Effects for Image Treatments",
  "authors": "Abhinav Thorat, Ravi Kolla, Niranjan Pedanekar",
  "authorsParsed": [
    [
      "Thorat",
      "Abhinav",
      ""
    ],
    [
      "Kolla",
      "Ravi",
      ""
    ],
    [
      "Pedanekar",
      "Niranjan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 28 Nov 2024 04:40:15 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1732768815000,
  "abstract": "  Causal effect estimation under observational studies is challenging due to\nthe lack of ground truth data and treatment assignment bias. Though various\nmethods exist in literature for addressing this problem, most of them ignore\nmulti-dimensional treatment information by considering it as scalar, either\ncontinuous or discrete. Recently, certain works have demonstrated the utility\nof this rich yet complex treatment information into the estimation process,\nresulting in better causal effect estimation. However, these works have been\ndemonstrated on either graphs or textual treatments. There is a notable gap in\nexisting literature in addressing higher dimensional data such as images that\nhas a wide variety of applications. In this work, we propose a model named NICE\n(Network for Image treatments Causal effect Estimation), for estimating\nindividual causal effects when treatments are images. NICE demonstrates an\neffective way to use the rich multidimensional information present in image\ntreatments that helps in obtaining improved causal effect estimates. To\nevaluate the performance of NICE, we propose a novel semi-synthetic data\nsimulation framework that generates potential outcomes when images serve as\ntreatments. Empirical results on these datasets, under various setups including\nthe zero-shot case, demonstrate that NICE significantly outperforms existing\nmodels that incorporate treatment information for causal effect estimation.\n",
  "subjects": [
    "Computer Science/Artificial Intelligence",
    "Statistics/Applications",
    "Statistics/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "l3RL3qFM9yNXWdYZDZA1S-M1rulTAoXFEQFMv08RHk0",
  "pdfSize": "509507"
}