{
  "id": "2412.13021",
  "title": "Queries, Representation & Detection: The Next 100 Model Fingerprinting\n  Schemes",
  "authors": "Augustin Godinot, Erwan Le Merrer, Camilla Penzo, Fran\\c{c}ois\n  Ta\\\"iani, Gilles Tr\\'edan",
  "authorsParsed": [
    [
      "Godinot",
      "Augustin",
      ""
    ],
    [
      "Merrer",
      "Erwan Le",
      ""
    ],
    [
      "Penzo",
      "Camilla",
      ""
    ],
    [
      "Taïani",
      "François",
      ""
    ],
    [
      "Trédan",
      "Gilles",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 15:41:36 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734450096000,
  "abstract": "  The deployment of machine learning models in operational contexts represents\na significant investment for any organisation. Consequently, the risk of these\nmodels being misappropriated by competitors needs to be addressed. In recent\nyears, numerous proposals have been put forth to detect instances of model\nstealing. However, these proposals operate under implicit and disparate data\nand model access assumptions; as a consequence, it remains unclear how they can\nbe effectively compared to one another. Our evaluation shows that a simple\nbaseline that we introduce performs on par with existing state-of-the-art\nfingerprints, which, on the other hand, are much more complex. To uncover the\nreasons behind this intriguing result, this paper introduces a systematic\napproach to both the creation of model fingerprinting schemes and their\nevaluation benchmarks. By dividing model fingerprinting into three core\ncomponents -- Query, Representation and Detection (QuRD) -- we are able to\nidentify $\\sim100$ previously unexplored QuRD combinations and gain insights\ninto their performance. Finally, we introduce a set of metrics to compare and\nguide the creation of more representative model stealing detection benchmarks.\nOur approach reveals the need for more challenging benchmarks and a sound\ncomparison with baselines. To foster the creation of new fingerprinting schemes\nand benchmarks, we open-source our fingerprinting toolbox.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Cryptography and Security"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "t5hHJ1Lp8wE-OfMcy8O_emhMytNtMmfqHI-NpICEdvA",
  "pdfSize": "518085"
}