{
  "id": "2412.14566",
  "title": "AIArena: A Blockchain-Based Decentralized AI Training Platform",
  "authors": "Zhipeng Wang, Rui Sun, Elizabeth Lui, Tuo Zhou, Yizhe Wen, Jiahao Sun",
  "authorsParsed": [
    [
      "Wang",
      "Zhipeng",
      ""
    ],
    [
      "Sun",
      "Rui",
      ""
    ],
    [
      "Lui",
      "Elizabeth",
      ""
    ],
    [
      "Zhou",
      "Tuo",
      ""
    ],
    [
      "Wen",
      "Yizhe",
      ""
    ],
    [
      "Sun",
      "Jiahao",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 06:35:54 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734590154000,
  "abstract": "  The rapid advancement of AI has underscored critical challenges in its\ndevelopment and implementation, largely due to centralized control by a few\nmajor corporations. This concentration of power intensifies biases within AI\nmodels, resulting from inadequate governance and oversight mechanisms.\nAdditionally, it limits public involvement and heightens concerns about the\nintegrity of model generation. Such monopolistic control over data and AI\noutputs threatens both innovation and fair data usage, as users inadvertently\ncontribute data that primarily benefits these corporations. In this work, we\npropose AIArena, a blockchain-based decentralized AI training platform designed\nto democratize AI development and alignment through on-chain incentive\nmechanisms. AIArena fosters an open and collaborative environment where\nparticipants can contribute models and computing resources. Its on-chain\nconsensus mechanism ensures fair rewards for participants based on their\ncontributions. We instantiate and implement AIArena on the public Base\nblockchain Sepolia testnet, and the evaluation results demonstrate the\nfeasibility of AIArena in real-world applications.\n",
  "subjects": [
    "Computer Science/Cryptography and Security",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Distributed, Parallel, and Cluster Computing",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "EYqu2e_dX12KWNFSRkJ_TgJH98Ch3ozlMqepelAFhKQ",
  "pdfSize": "1171723"
}