{
  "id": "2412.07373",
  "title": "Determining stellar properties of massive stars in NGC346 in the SMC\n  with a Bayesian statistic technique",
  "authors": "M. J. Rickard, R. Hainich, D. Pauli, W.-R. Hamann, L. M. Oskinova, R.\n  K. Prinja, V. Ramachandran, H. Todt, E. C. Sch\\\"osser, A. A. C. Sander and P.\n  Zeidler",
  "authorsParsed": [
    [
      "Rickard",
      "M. J.",
      ""
    ],
    [
      "Hainich",
      "R.",
      ""
    ],
    [
      "Pauli",
      "D.",
      ""
    ],
    [
      "Hamann",
      "W. -R.",
      ""
    ],
    [
      "Oskinova",
      "L. M.",
      ""
    ],
    [
      "Prinja",
      "R. K.",
      ""
    ],
    [
      "Ramachandran",
      "V.",
      ""
    ],
    [
      "Todt",
      "H.",
      ""
    ],
    [
      "Schösser",
      "E. C.",
      ""
    ],
    [
      "Sander",
      "A. A. C.",
      ""
    ],
    [
      "Zeidler",
      "P.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 10:15:21 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733825721000,
  "abstract": "  NGC 346 is a young cluster with numerous hot OB stars. It is part of the\nSmall Magellanic Cloud (SMC), and has an average metallicity that is\none-seventh of the Milky Way's. A detailed study of its stellar content\nprovides a unique opportunity to understand the stellar and wind properties of\nmassive stars in low-metallicity environments, and enables us to improve our\nunderstanding of star formation and stellar evolution.\n  The fundamental stellar parameters defining a star's spectral appearance are\nits effective surface temperature, surface gravity, and projected rotational\nvelocity. Unfortunately, these parameters cannot be obtained independently from\nonly H and He spectral features as they are partially degenerate. With this\nwork we aim to overcome this degeneracy by applying a newly developed Bayesian\nstatistic technique that can fit these three parameters simultaneously.\n  Multi-epoch optical spectra are used in combination with a Bayesian statistic\ntechnique to fit stellar properties based on a publicly available grid of\nsynthetic spectra of stellar atmospheres. The use of all of the multi-epoch\nobservations simultaneously allows the identification of binaries.\n  The stellar parameters for 34 OB stars within the core of NGC 346 are derived\nand presented here. By the use of both $\\mathrm{He}\\textsc{i}$ and\n$\\mathrm{He}\\textsc{ii}$ lines, the partial degeneracy between the stellar\nparameters of effective surface temperature, surface gravity, and projected\nrotational velocity is overcome. A lower limit to the binary fraction of the\nsample of stars is found to be at least 46%.\n  Based on comparisons with analysis conducted on an overlapping sample of\nstars within NGC 346, the Bayesian statistic technique approach is shown to be\na viable method to measure stellar parameters for hot massive stars in\nlow-metallicity environments even when only low-resolution spectra are\navailable.}\n",
  "subjects": [
    "Astrophysics/Solar and Stellar Astrophysics",
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "X8S5lEc1BZ7LFfsJEY0m0sdadUHQTTTwqAgdJ23BV_A",
  "pdfSize": "797529"
}