{
  "id": "2412.18631",
  "title": "Tuning Nonlinear Elastic Materials under Small and Large Deformations",
  "authors": "Huanyu Chen and Jernej Barbic",
  "authorsParsed": [
    [
      "Chen",
      "Huanyu",
      ""
    ],
    [
      "Barbic",
      "Jernej",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 21 Dec 2024 18:05:38 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1734804338000,
  "abstract": "  In computer graphics and engineering, nonlinear elastic material properties\nof 3D volumetric solids are typically adjusted by selecting a material family,\nsuch as St. Venant Kirchhoff, Linear Corotational, (Stable) Neo-Hookean, Ogden,\netc., and then selecting the values of the specific parameters for that family,\nsuch as the Lame parameters, Ogden exponents, or whatever the parameterization\nof a particular family may be. However, the relationships between those\nparameter values, and visually intuitive material properties such as object's\n\"stiffness\", volume preservation, or the \"amount of nonlinearity\", are less\nclear and can be tedious to tune. For an arbitrary isotropic hyperelastic\nenergy density function psi that is not parameterized in terms of the Lame\nparameters, it is not even clear what the Lame parameters and Young's modulus\nand Poisson's ratio are. Starting from psi, we first give a concise definition\nof Lame parameters, and therefore Young's modulus and Poisson's ratio. Second,\nwe give a method to adjust the object's three salient properties, namely two\nsmall-deformation properties (overall \"stiffness\", and amount of volume\npreservation, prescribed by object's Young's modulus and Poisson's ratio), and\none large-deformation property (material nonlinearity). We do this in a manner\nwhereby each of these three properties is decoupled from the other two\nproperties, and can therefore be set independently. This permits a new ability,\nnamely \"normalization\" of materials: starting from two distinct materials, we\ncan \"normalize\" them so that they have the same small deformation properties,\nor the same large-deformation nonlinearity behavior, or both. Furthermore, our\nanalysis produced a useful theoretical result, namely it establishes that\nLinear Corotational materials (arguably the most widely used materials in\ncomputer graphics) are the simplest possible nonlinear materials.\n",
  "subjects": [
    "Computer Science/Graphics",
    "Condensed Matter/Materials Science"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "8YbiKK8tvj-NUBluY4042bGvRssUZE4W2PlHknDH0wU",
  "pdfSize": "2010816"
}