{"id":"2412.15727","title":"Broadband Passive Sonar Track-Before-Detect Using Raw Acoustic Data","authors":"Daniel Boss\\'er, Magnus Lundberg Nordenvaad, Gustaf Hendeby, Isaac\n  Skog","authorsParsed":[["Bossér","Daniel",""],["Nordenvaad","Magnus Lundberg",""],["Hendeby","Gustaf",""],["Skog","Isaac",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 09:49:32 GMT"}],"updateDate":"2024-12-23","timestamp":1734688172000,"abstract":"  This article concerns the challenge of reliable broadband passive sonar\ntarget detection and tracking in complex acoustic environments. Addressing this\nchallenge is becoming increasingly crucial for safeguarding underwater\ninfrastructure, monitoring marine life, and providing defense during seabed\nwarfare. To that end, a solution is proposed based on a vector-autoregressive\nmodel for the ambient noise and a heavy-tailed statistical model for the\ndistribution of the raw hydrophone data. These models are integrated into a\nBernoulli track-before-detect (TkBD) filter that estimates the probability of\ntarget existence, target bearing, and signal-to-noise ratio (SNR). The proposed\nsolution is evaluated on both simulated and real-world data, demonstrating the\neffectiveness of the proposed ambient noise modeling and the statistical model\nfor the raw hydrophone data samples to obtain early target detection and robust\ntarget tracking. The simulations show that the SNR at which the target can be\ndetected is reduced by 4 dB compared to when using the standard constant false\nalarm rate detector-based tracker. Further, the test with real-world data shows\nthat the proposed solution increases the target detection distance from 250 m\nto 390 m. The presented results illustrate that the TkBD technology, in\ncombination with data-driven ambient noise modeling and heavy-tailed\nstatistical signal models, can enable reliable broadband passive sonar target\ndetection and tracking in complex acoustic environments and lower the SNR\nrequired to detect and track targets.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"xGCwnR9AtUznUuJ3JIttC6dDwvTjbbi5WWNT2jtjei0","pdfSize":"4030531"}