{
  "id": "2412.00960",
  "title": "Broadband study of the Be X-ray binary RX J0520.5-6932 during its\n  outburst in 2024",
  "authors": "H. N. Yang, C. Maitra, G. Vasilopoulos, F. Haberl, P. A. Jenke, A. S.\n  Karaferias, R. Sharma, A. Beri, L. Ji, C. Jin, W. Yuan, Y. J. Zhang, C. Y.\n  Wang, X. P. Xu, Y. Liu, W. D. Zhang, C. Zhang, Z. X. Ling, H. Y. Liu, H. Q.\n  Cheng, H. W. Pan",
  "authorsParsed": [
    [
      "Yang",
      "H. N.",
      ""
    ],
    [
      "Maitra",
      "C.",
      ""
    ],
    [
      "Vasilopoulos",
      "G.",
      ""
    ],
    [
      "Haberl",
      "F.",
      ""
    ],
    [
      "Jenke",
      "P. A.",
      ""
    ],
    [
      "Karaferias",
      "A. S.",
      ""
    ],
    [
      "Sharma",
      "R.",
      ""
    ],
    [
      "Beri",
      "A.",
      ""
    ],
    [
      "Ji",
      "L.",
      ""
    ],
    [
      "Jin",
      "C.",
      ""
    ],
    [
      "Yuan",
      "W.",
      ""
    ],
    [
      "Zhang",
      "Y. J.",
      ""
    ],
    [
      "Wang",
      "C. Y.",
      ""
    ],
    [
      "Xu",
      "X. P.",
      ""
    ],
    [
      "Liu",
      "Y.",
      ""
    ],
    [
      "Zhang",
      "W. D.",
      ""
    ],
    [
      "Zhang",
      "C.",
      ""
    ],
    [
      "Ling",
      "Z. X.",
      ""
    ],
    [
      "Liu",
      "H. Y.",
      ""
    ],
    [
      "Cheng",
      "H. Q.",
      ""
    ],
    [
      "Pan",
      "H. W.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 1 Dec 2024 20:23:13 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733084593000,
  "abstract": "  A new giant outburst of the Be X-ray binary RX J0520.5-6932 was detected and\nsubsequently observed with several space-borne and ground-based instruments.\nThis study presents a comprehensive analysis of the optical and X-ray data,\nfocusing on the spectral and timing characteristics of selected X-ray\nobservations. A joint fit of spectra from simultaneous observations performed\nby the X-ray telescope (XRT) on the Neil Gehrels Swift Observatory (Swift) and\nNuclear Spectroscopic Telescope ARray (NuSTAR) provides broadband parameter\nconstraints, including a cyclotron resonant scattering feature (CRSF) at\n32.2(+0.8/-0.7) keV with no significant energy change since 2014, and a weaker\nFe line. Independent spectral analyses of observations by the Lobster Eye\nImager for Astronomy (LEIA), Einstein Probe (EP), Swift-XRT, and NuSTAR\ndemonstrate the consistency of parameters across different bands. Luminosity\nvariations during the current outburst were tracked. The light curve of the\nOptical Gravitational Lensing Experiment (OGLE) aligns with the X-ray data in\nboth 2014 and 2024. Spin evolution over 10 years is studied after adding Fermi\nGamma-ray Burst Monitor (GBM) data, improving the orbital parameters, with an\nestimated orbital period of 24.39 days, slightly differing from OGLE data.\nDespite intrinsic spin-up during outbursts, a spin-down of ~0.04s over 10.3\nyears is suggested. For the new outburst, the pulse profiles indicate a\ncomplicated energy-dependent shape, with decreases around 15 keV and 25 keV in\nthe pulsed fraction, a first for an extragalactic source. Phase-resolved NuSTAR\ndata indicate variations in parameters such as flux, photon index, and CRSF\nenergy with rotation phase.\n",
  "subjects": [
    "Astrophysics/High Energy Astrophysical Phenomena"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "CrzKsoJvAjpXT9HMRB_5Ry3d0zLn5OVpHAHlNEohqN0",
  "pdfSize": "4495322"
}