{"id":"2412.13570","title":"Which Imputation Fits Which Feature Selection Method? A Survey-Based\n  Simulation Study","authors":"Jakob Schwerter (1), Andr\\'es Romero (1), Florian Dumpert (2), Markus\n  Pauly (1,3) ((1) TU Dortmund University, Dortmund, Germany, (2) Federal\n  Statistical Office of Germany, Wiesbaden, Germany, (3) Research Center\n  Trustworthy Data Science and Security, Dortmund, Germany)","authorsParsed":[["Schwerter","Jakob",""],["Romero","Andrés",""],["Dumpert","Florian",""],["Pauly","Markus",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 07:36:03 GMT"}],"updateDate":"2024-12-19","timestamp":1734507363000,"abstract":"  Tree-based learning methods such as Random Forest and XGBoost are still the\ngold-standard prediction methods for tabular data. Feature importance measures\nare usually considered for feature selection as well as to assess the effect of\nfeatures on the outcome variables in the model. This also applies to survey\ndata, which are frequently encountered in the social sciences and official\nstatistics. These types of datasets often present the challenge of missing\nvalues. The typical solution is to impute the missing data before applying the\nlearning method. However, given the large number of possible imputation methods\navailable, the question arises as to which should be chosen to achieve the\n'best' reflection of feature importance and feature selection in subsequent\nanalyses. In the present paper, we investigate this question in a survey-based\nsimulation study for eight state-of-the art imputation methods and three\nlearners. The imputation methods comprise listwise deletion, three MICE\noptions, four \\texttt{missRanger} options as well as the recently proposed\nmixGBoost imputation approach. As learners, we consider the two most common\ntree-based methods, Random Forest and XGBoost, and an interpretable linear\nmodel with regularization.\n","subjects":["Statistics/Applications","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"bwgwECA3ZHSBeQAEumewaLOM5eicDmrYt1zD0ELbTiE","pdfSize":"4878918"}