{
  "id": "2412.05273",
  "title": "Interplay of Quasi-Quantum Hall Effect and Coulomb Disorder in\n  Semimetals",
  "authors": "Ian A. Leahy, Anthony D. Rice, Jocienne N. Nelson, Herve Ness, Mark\n  van Schilfgaarde, Wei Pan, and Kirstin Alberi",
  "authorsParsed": [
    [
      "Leahy",
      "Ian A.",
      ""
    ],
    [
      "Rice",
      "Anthony D.",
      ""
    ],
    [
      "Nelson",
      "Jocienne N.",
      ""
    ],
    [
      "Ness",
      "Herve",
      ""
    ],
    [
      "van Schilfgaarde",
      "Mark",
      ""
    ],
    [
      "Pan",
      "Wei",
      ""
    ],
    [
      "Alberi",
      "Kirstin",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 18:58:57 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733511537000,
  "abstract": "  Low carrier densities in topological semimetals (TSMs) enable the exploration\nof novel magnetotransport in the quantum limit (QL). Reports consistent with 3D\nquasi-quantum Hall effect (QQHE) have repositioned TSMs as promising platforms\nfor exploring 3D quantum Hall transport, but the lack of tunability in the\nFermi has thus far limited the ability to control the QQHE signal. Here, we\ntune the defect concentrations in the Dirac semimetal Cd${}_3$As${}_2$ to\nachieve ultra-low carrier concentrations at 2 K around\n$2.9\\times10^{16}$cm${}^{-3}$, giving way to QQHE signal at modest fields under\n10 T. At low carrier densities, where QQHE is most accessible, we find that a\nzero resistivity state is obscured by a carrier density dependent background\noriginating from Coulomb disorder from charged point defects. Our results\nhighlight the interplay between QQHE and Coulomb disorder scattering,\ndemonstrating that clear observation of QQHE in TSMs intricately depends on\nFermi level. Predicted in TSMs a decade ago, we find that Coulomb disorder is\nan essential ingredient for understanding the magnetoresistivity for a spectrum\nof Fermi levels, experimentally anchoring the important roles of defects and\ncharged disorder in TSM applications. We discuss future constraints and\nopportunities in exploring 3D QHE in TSMs.\n",
  "subjects": [
    "Condensed Matter/Materials Science"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "KhaEfW9RSsuA7Du3kcja5zjKkSnLl4Eo6xXq7Ry3DO4",
  "pdfSize": "4029277"
}