{"id":"2412.04935","title":"Uncertainty-aware retinal layer segmentation in OCT through\n  probabilistic signed distance functions","authors":"Mohammad Mohaiminul Islam, Coen de Vente, Bart Liefers, Caroline\n  Klaver, Erik J Bekkers, Clara I. S\\'anchez","authorsParsed":[["Islam","Mohammad Mohaiminul",""],["de Vente","Coen",""],["Liefers","Bart",""],["Klaver","Caroline",""],["Bekkers","Erik J",""],["Sánchez","Clara I.",""]],"versions":[{"version":"v1","created":"Fri, 6 Dec 2024 10:44:11 GMT"}],"updateDate":"2024-12-09","timestamp":1733481851000,"abstract":"  In this paper, we present a new approach for uncertainty-aware retinal layer\nsegmentation in Optical Coherence Tomography (OCT) scans using probabilistic\nsigned distance functions (SDF). Traditional pixel-wise and regression-based\nmethods primarily encounter difficulties in precise segmentation and lack of\ngeometrical grounding respectively. To address these shortcomings, our\nmethodology refines the segmentation by predicting a signed distance function\n(SDF) that effectively parameterizes the retinal layer shape via level set. We\nfurther enhance the framework by integrating probabilistic modeling, applying\nGaussian distributions to encapsulate the uncertainty in the shape\nparameterization. This ensures a robust representation of the retinal layer\nmorphology even in the presence of ambiguous input, imaging noise, and\nunreliable segmentations. Both quantitative and qualitative evaluations\ndemonstrate superior performance when compared to other methods. Additionally,\nwe conducted experiments on artificially distorted datasets with various noise\ntypes-shadowing, blinking, speckle, and motion-common in OCT scans to showcase\nthe effectiveness of our uncertainty estimation. Our findings demonstrate the\npossibility to obtain reliable segmentation of retinal layers, as well as an\ninitial step towards the characterization of layer integrity, a key biomarker\nfor disease progression. Our code is available at\n\\url{https://github.com/niazoys/RLS_PSDF}.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computer Science/Artificial Intelligence","Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"weawQAiLL5Bc_72hxsXOU2nkeVIe-DGl20BUEDds6Bc","pdfSize":"39317953"}