{"id":"2412.00055","title":"High-precision medical speech recognition through synthetic data and\n  semantic correction: UNITED-MEDASR","authors":"Sourav Banerjee, Ayushi Agarwal, Promila Ghosh","authorsParsed":[["Banerjee","Sourav",""],["Agarwal","Ayushi",""],["Ghosh","Promila",""]],"versions":[{"version":"v1","created":"Sun, 24 Nov 2024 17:02:48 GMT"}],"updateDate":"2024-12-03","timestamp":1732467768000,"abstract":"  Automatic Speech Recognition (ASR) systems in the clinical domain face\nsignificant challenges, notably the need to recognise specialised medical\nvocabulary accurately and meet stringent precision requirements. We introduce\nUnited-MedASR, a novel architecture that addresses these challenges by\nintegrating synthetic data generation, precision ASR fine-tuning, and advanced\nsemantic enhancement techniques. United-MedASR constructs a specialised medical\nvocabulary by synthesising data from authoritative sources such as ICD-10\n(International Classification of Diseases, 10th Revision), MIMS (Monthly Index\nof Medical Specialties), and FDA databases. This enriched vocabulary helps\nfinetune the Whisper ASR model to better cater to clinical needs. To enhance\nprocessing speed, we incorporate Faster Whisper, ensuring streamlined and\nhigh-speed ASR performance. Additionally, we employ a customised BART-based\nsemantic enhancer to handle intricate medical terminology, thereby increasing\naccuracy efficiently. Our layered approach establishes new benchmarks in ASR\nperformance, achieving a Word Error Rate (WER) of 0.985% on LibriSpeech\ntest-clean, 0.26% on Europarl-ASR EN Guest-test, and demonstrating robust\nperformance on Tedlium (0.29% WER) and FLEURS (0.336% WER). Furthermore, we\npresent an adaptable architecture that can be replicated across different\ndomains, making it a versatile solution for domain-specific ASR systems.\n","subjects":["Electrical Engineering and Systems Science/Audio and Speech Processing","Computer Science/Computation and Language","Computer Science/Sound"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"f01lF0CyCbtU28DHBwCxq7gb-ORwZY0qH3AGWxkzovE","pdfSize":"988237"}