{"id":"2412.04210","title":"Joint Mode Selection and Beamforming Designs for Hybrid-RIS Assisted\n  ISAC Systems","authors":"Yingbin Lin, Feng Wang, Xiao Zhang, Guojun Han, and Vincent K. N. Lau","authorsParsed":[["Lin","Yingbin",""],["Wang","Feng",""],["Zhang","Xiao",""],["Han","Guojun",""],["Lau","Vincent K. N.",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 14:44:26 GMT"}],"updateDate":"2024-12-06","timestamp":1733409866000,"abstract":"  This paper considers a hybrid reconfigurable intelligent surface (RIS)\nassisted integrated sensing and communication (ISAC) system, where each RIS\nelement can flexibly switch between the active and passive modes. Subject to\nthe signal-to-interference-plus-noise ratio (SINR) constraint for each\ncommunication user (CU) and the transmit power constraints for both the base\nstation (BS) and the active RIS elements, with the objective of maximizing the\nminimum beampattern gain among multiple targets, we jointly optimize the BS\ntransmit beamforming for ISAC and the mode selection of each RIS reflecting\nelement, as well as the RIS reflection coefficient matrix. Such formulated\njoint hybrid-RIS assisted ISAC design problem is a mixed-integer nonlinear\nprogram, which is decomposed into two low-dimensional subproblems being solved\nin an alternating manner. Specifically, by using the semidefinite relaxation\n(SDR) technique along with the rank-one beamforming construction process, we\nefficiently obtain the optimal ISAC transmit beamforming design at the BS. Via\nthe SDR and successive convex approximation (SCA) techniques, we jointly\ndetermine the active/passive mode selection and reflection coefficient for each\nRIS element. Numerical results demonstrate that the proposed design solution is\nsignificantly superior to the existing baseline solutions.\n","subjects":["Computer Science/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"wY2466RymRkuvjjcRVnF78aAxdfTzMkIFhWWAC1nLxc","pdfSize":"700181"}