{"id":"2412.08008","title":"Can Alfv\\'enic Fluctuations Affect the Correlation and Complexity of\n  Magnetic Fields in Magnetic Ejecta? A Case Study Based on Multi-Spacecraft\n  Measurements at 1~au","authors":"Camilla Scolini, Bin Zhuang, No\\'e Lugaz, R\\'eka M. Winslow, Charles\n  J. Farrugia, Norbert Magyar, Fabio Bacchini","authorsParsed":[["Scolini","Camilla",""],["Zhuang","Bin",""],["Lugaz","Noé",""],["Winslow","Réka M.",""],["Farrugia","Charles J.",""],["Magyar","Norbert",""],["Bacchini","Fabio",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 01:23:31 GMT"}],"updateDate":"2024-12-12","timestamp":1733880211000,"abstract":"  We investigate whether Alfv\\'enic fluctuations (AFs) can affect the structure\nof magnetic ejecta (MEs) within interplanetary coronal mass ejections (ICMEs).\nWe study an ICME observed on 2001 December 29 at 1 au by ACE and Wind, at a\ntotal angular separation of $\\sim$0.8$^\\circ$ ($\\sim0.014$~au). We focus on the\ncorrelation and complexity of its magnetic structure measured between two\nspacecraft in association with large-amplitude AFs. The Alfv\\'enicity of the ME\nis investigated in terms of the residual energy and cross helicity of\nfluctuations. We find that as for the event of interest, large-amplitude AFs\noccur in the rear region of the ME at both Wind and ACE with a duration of\nabout six hours. We compare the correlation of the magnetic field strength and\nvector components measured between Wind and ACE, and investigate complexity in\nterms of the magnetic hodograms. The region showing AFs is found to be\nassociated with a decreased correlation of the magnetic field components and an\nincreased complexity of the ME magnetic configuration detected at ACE and Wind,\nwhich may be due to the fact that the two spacecraft crossing the same ME along\ndifferent trajectories likely sampled AFs in different oscillation phases.\nCombining multi-point in-situ measurements and remote-sensing observations of\nthe ICME source region, we further discuss different potential sources of the\nAFs.\n","subjects":["Physics/Space Physics","Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"AmFu8QRA-llc6H5lnc1gFqy_1PsgYBPoCVcG4nohDjY","pdfSize":"7843411"}