{
  "id": "2412.05009",
  "title": "Space Time Algebra Formulation of Cold Magnetized Plasmas",
  "authors": "Kyriakos Hizanidis, Efstratios Koukoutsis, Panagiotis Papagiannis,\n  Abhay K. Ram, George Vahala",
  "authorsParsed": [
    [
      "Hizanidis",
      "Kyriakos",
      ""
    ],
    [
      "Koukoutsis",
      "Efstratios",
      ""
    ],
    [
      "Papagiannis",
      "Panagiotis",
      ""
    ],
    [
      "Ram",
      "Abhay K.",
      ""
    ],
    [
      "Vahala",
      "George",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 13:02:29 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733490149000,
  "abstract": "  The propagation and scattering of electromagnetic waves in magnetized plasmas\nin a state where a global mode has been established or is in turbulence, are of\ntheoretical and experimental interest in thermonuclear fusion research.\nInterpreting experimental results, as well as predicting plasma behavior\nrequires the numerical solutions of the underlying physics, that is, the\nnumerical solution of Maxwell equations under various initial conditions and,\nunder the circumstances, complex boundary conditions. Casting, the underlying\nequations in a coordinate free form that exploits the symmetries and the\nconserved quantities in a form that can easily encompass a variety of initial\nand boundary conditions is of tantamount importance. Pursuing this task we\nutilize the advantages the Clifford Algebras can possibly provide. For\nsimplicity we deal with a cold multi-species lossless magnetized plasma. The\nformulation renders a Dirac type evolution equation for am augmented state that\nconsists of the electric and magnetic field bivectors as well as the\npolarizations and their associated currents for each species. This evolution\nequation can be dealt with a general spatial lattice disretization scheme. The\nevolution operator that dictates the temporal advancement of the state is\nHermitian. This formulation is computationally simpler whatever the application\ncould be. However, small wavelength capabilities (on the Debye length scale)\nfor spatially large systems (magnetic confinement devices) is questionable even\nfor conventional super-computers. However, the formulation provided in this\nwork it is entirely suitable and it can be directly transferred in a quantum\ncomputer. It is shown that the simplified problem in the present work could be\nsuitable for contemporary rudimentary quantum computers.\n",
  "subjects": [
    "Physics/Plasma Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "yJFL-pEOIr-wZNHnhz-RJZcVtwnnQRIRdAdpkUeDc2A",
  "pdfSize": "401663"
}