{
  "id": "2412.16366",
  "title": "Non-Linearities In Atomic Quantum Receivers: Harmonic And\n  Intermodulation Distortion",
  "authors": "Lu\\'is Felipe Gon\\c{c}alves, Teng Zhang, Georg Raithel and David A.\n  Anderson",
  "authorsParsed": [
    [
      "Gonçalves",
      "Luís Felipe",
      ""
    ],
    [
      "Zhang",
      "Teng",
      ""
    ],
    [
      "Raithel",
      "Georg",
      ""
    ],
    [
      "Anderson",
      "David A.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 21:56:45 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734731805000,
  "abstract": "  Rydberg sensors offer a unique approach to radio frequency (RF) detection,\nleveraging the high sensitivity and quantum properties of highly-excited atomic\nstates to achieve performance levels beyond classical technologies. Non-linear\nresponses and distortion behavior in Rydberg atom receivers are critical to\nevaluating and establishing performance metrics and capabilities such as\nspur-free dynamic range and tolerance to unwanted interfering signals. We\nreport here on the measurement and characterization of non-linear behavior and\nspurious response of a Rydberg atomic heterodyne receiver. Single-tone and\ntwo-tone testing procedures are developed and implemented for measurement of\nharmonic and inter-modulation distortion in Rydberg atomic receivers based on\nmulti-photon Rydberg spectroscopy and radio-frequency heterodyne signal\ndetection and demodulation in an atomic vapor. For a predetermined set of\natomic receiver parameters and RF carrier wave in the SHF band near-resonant to\na cesium Rydberg transition, we measure and characterize atomic receiver\nselectivity, bandwidth, roll-off, compression point (P1dB), second-order (IP2)\nand third-order (IP3) intercepts, and spur-free dynamic range. Receiver\nintermodulation distortion is characterized for the case of an interfering\nsignal wave applied at two frequency offsets relative to the near-resonant\nreference local oscillator, $\\Delta F/F= 10^{-4}$ at 6dB and $10^{-6}$ at 22dB\nsingle-tone bandwidths, respectively. We observe that under suitable operating\nconditions the atomic receiver can exhibit a suppression of harmonic and\ninter-modulation distortion relative to that of classical receiver mixer\namplifiers. Finally, we describe how the non-linear behaviors of atomic\nreceivers can provide unique, controllable RF signatures inaccessible by\nclassical counterparts and propose their use to realize secure communication\nmodalities and applications.\n",
  "subjects": [
    "Physics/Atomic Physics",
    "Physics/Instrumentation and Detectors",
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "GRS3xMrrY5uSyUvqF4K16IgYA5MUJVrfIgtDx1Kon0c",
  "pdfSize": "836405"
}