{"id":"2412.05894","title":"FedRBE -- a decentralized privacy-preserving federated batch effect\n  correction tool for omics data based on limma","authors":"Yuliya Burankova, Julian Klemm, Jens J. G. Lohmann, Ahmad Taheri,\n  Niklas Probul, Jan Baumbach, Olga Zolotareva","authorsParsed":[["Burankova","Yuliya",""],["Klemm","Julian",""],["Lohmann","Jens J. G.",""],["Taheri","Ahmad",""],["Probul","Niklas",""],["Baumbach","Jan",""],["Zolotareva","Olga",""]],"versions":[{"version":"v1","created":"Sun, 8 Dec 2024 11:23:31 GMT"}],"updateDate":"2024-12-10","timestamp":1733657011000,"abstract":"  Batch effects in omics data obscure true biological signals and constitute a\nmajor challenge for privacy-preserving analyses of distributed patient data.\nExisting batch effect correction methods either require data centralization,\nwhich may easily conflict with privacy requirements, or lack support for\nmissing values and automated workflows. To bridge this gap, we developed\nfedRBE, a federated implementation of limma's removeBatchEffect method. We\nimplemented it as an app for the FeatureCloud platform. Unlike its existing\nanalogs, fedRBE effectively handles data with missing values and offers an\nautomated, user-friendly online user interface\n(https://featurecloud.ai/app/fedrbe). Leveraging secure multi-party computation\nprovides enhanced security guarantees over classical federated learning\napproaches. We evaluated our fedRBE algorithm on simulated and real omics data,\nachieving performance comparable to the centralized method with negligible\ndifferences (no greater than 3.6E-13). By enabling collaborative correction\nwithout data sharing, fedRBE facilitates large-scale omics studies where batch\neffect correction is crucial.\n","subjects":["Quantitative Biology/Quantitative Methods","Computer Science/Cryptography and Security","Computer Science/Distributed, Parallel, and Cluster Computing","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ayKlMIsIho28v9sq3-HfJ9fLdfE0cZpLZ0Q-4uQXzvk","pdfSize":"2870152"}