{
  "id": "2412.02157",
  "title": "Sublayers Editing of Covalent MAX Phase for Nanolaminated Early\n  Transition Metal Compounds",
  "authors": "Ziqian Li, Ke Chen, Xudong Wang, Kan Luo, Lei Lei, Mian Li, Kun Liang,\n  Degao Wang, Shiyu Du, Zhifang Chai, Qing Huang",
  "authorsParsed": [
    [
      "Li",
      "Ziqian",
      ""
    ],
    [
      "Chen",
      "Ke",
      ""
    ],
    [
      "Wang",
      "Xudong",
      ""
    ],
    [
      "Luo",
      "Kan",
      ""
    ],
    [
      "Lei",
      "Lei",
      ""
    ],
    [
      "Li",
      "Mian",
      ""
    ],
    [
      "Liang",
      "Kun",
      ""
    ],
    [
      "Wang",
      "Degao",
      ""
    ],
    [
      "Du",
      "Shiyu",
      ""
    ],
    [
      "Chai",
      "Zhifang",
      ""
    ],
    [
      "Huang",
      "Qing",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 04:34:04 GMT"
    }
  ],
  "updateDate": "2024-12-04",
  "timestamp": 1733200444000,
  "abstract": "  Two-dimensional transition metal carbides and nitrides (MXenes) have gained\npopularity in fields such as energy storage, catalysis, and electromagnetic\ninterference due to their diverse elemental compositions and variable surface\nterminations (T). Generally, the synthesis of MXene materials involves etching\nthe weak M-A metallic bonds in the ternary layered transition metal carbides\nand nitrides (MAX phase) using HF acid or Lewis acid molten salts, while the\nstrong M-X covalent bonds preserve the two-dimensional framework structure of\nMXenes. On the other hand, the MAX phase material family also includes a\nsignificant class of members where the A site is occupied by non-metal main\ngroup elements (such as sulfur and phosphorus), in which both M-A and M-X are\ncovalent bond-type sublayers. The aforementioned etching methods cannot be used\nto synthesize MXene materials from these parent phases. In this work, we\ndiscovered that the covalent bond-type M-A and M-X sublayers exhibit different\nreactivity with some inorganic materials in a high-temperature molten state. By\nutilizing this difference in reactivity, we can structurally modify these\ncovalent sublayers, allowing for the substitution of elements at the X site\n(from B to Se, S, P, C) and converting non-metal A site atoms in non-van der\nWaals (non-vdW) MAX phases into surface atoms in vdW layered materials. This\nresults in a family of early transition metal Xide chalcogenides (TMXCs) that\nexhibit lattice characteristics of both MXenes and transition metal\nchalcogenides. Using electron-donor chemical scissors, these TMXC layered\nmaterials can be further exfoliated into monolayer nanosheets. The atomic\nconfigurations of each atom in these monolayer TMXCs are the same as those of\nconventional MXenes, but the oxidation states of the M-site atoms can be\nregulated by both X-site atoms and intercalated cations.\n",
  "subjects": [
    "Condensed Matter/Materials Science",
    "Physics/Chemical Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "QhrSID6ZFvXD_qfuHEuvorcdkNtX84tEQ-kDa6mMl7c",
  "pdfSize": "871693"
}