{
  "id": "2412.18088",
  "title": "Origin of the insulating and superconducting phases in molecular solid\n  $\\kappa$-(BEDT-TTF)$_2$Cu$_2$(CN)$_3$",
  "authors": "Dongbin Shin, Fabijan Pavo\\v{s}evi\\'c, Nicolas Tancogne-Dejean,\n  Michele Buzzi, Emil Vi\\~nas Bostr\\\"om, Angel Rubio",
  "authorsParsed": [
    [
      "Shin",
      "Dongbin",
      ""
    ],
    [
      "Pavošević",
      "Fabijan",
      ""
    ],
    [
      "Tancogne-Dejean",
      "Nicolas",
      ""
    ],
    [
      "Buzzi",
      "Michele",
      ""
    ],
    [
      "Boström",
      "Emil Viñas",
      ""
    ],
    [
      "Rubio",
      "Angel",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 24 Dec 2024 02:01:06 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1735005666000,
  "abstract": "  Recent studies of organic molecular solids are highlighted by their complex\nphase diagram and light-induced phenomena, such as Mott insulator, spin liquid\nphase, and superconductivity. However, a discrepancy between experimental\nobservation and first-principle calculation on the $\\kappa$-(BEDT-TTF)$_2$X\nfamily inhibits understanding their properties. Here, we revisit the electronic\nstructure of $\\kappa$-(BEDT-TTF)$_2$Cu$_2$(CN)$_3$ with the recently developed\nDFT+GOU method to correct the energy level of molecular orbital states in the\nmolecular solid. Our work reveals that the insulating electronic structure of\n$\\kappa$-(BEDT-TTF)$_2$Cu$_2$(CN)$_3$ originates from the energy gap between\nthe highest occupied and the lowest unoccupied molecular orbital states of the\nBEDT-TTF dimers, that are the periodic unit of the molecular solid. We verify\nthat our calculation result provides consistent band gap, optical conductivity,\nand evolution of the metal-insulator transition as a function of pressure with\nexperimental observations. Especially, the superconducting dome of\n$\\kappa$-(BEDT-TTF)$_2$Cu$_2$(CN)$_3$, which originates from the flat band\nstate at the Fermi level, is reproduced. Additionally, we constructed a new\nlow-energy lattice model based on the ability of electronic structure data that\ncan be used to address many-body physics, such as quantum spin liquid and\ndouble-holon dynamics. Our provides a deeper understanding of the complex phase\ndiagram and various light-induced phenomena in the $\\kappa$-(BEDT-TTF)$_2$X\nfamily and the other complex organic molecular solids.\n",
  "subjects": [
    "Condensed Matter/Strongly Correlated Electrons",
    "Condensed Matter/Materials Science"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "vJ47j0SdEUVjtBpLdccDq8w6KeJJogiPkGOgzMWZVwY",
  "pdfSize": "4118841"
}