{
  "id": "2412.00757",
  "title": "Theory of rare-earth Kramers magnets on a Shastry-Sutherland lattice:\n  dimer phases in presence of strong spin-orbit coupling",
  "authors": "Changle Liu, Guijing Duan, Rong Yu",
  "authorsParsed": [
    [
      "Liu",
      "Changle",
      ""
    ],
    [
      "Duan",
      "Guijing",
      ""
    ],
    [
      "Yu",
      "Rong",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 1 Dec 2024 10:30:04 GMT"
    },
    {
      "version": "v2",
      "created": "Thu, 19 Dec 2024 10:58:05 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1733049004000,
  "abstract": "  Shastry-Sutherland magnet is a typical frustrated spin system particularly\nknown for the exact solvability of the singlet dimer phase as well as nearly\nflat triplon excitations in the Heisenberg limit, while the situation in the\npresence of strong spin-orbit coupling is not well explored. Motivated by the\nrecently discovered rare-earth Shastry-Sutherland magnets, we derive a generic\neffective-spin model that describes the interactions between Kramers doublet\nlocal moments on a Shastry-Sutherland lattice. Because of the strong spin-orbit\ncoupling, the effective model turns out to be an extended XYZ model on both\nintra- and inter-dimer bonds. We focus on the dimer phase and show that, in\naddition to the conventional \"singlet\" dimer phase in the Heisenberg limit,\npeculiar \"triplet\" dimer phases can be stabilized by the strong spin-orbit\ncoupling. While the \"singlet\" dimer phase, at certain conditions, could still\nexhibit exact solvability and nearly flat excitations analogous to that in the\nisotropic Heisenberg model, these \"triplet\" dimer phases are generally not\nexactly solvable and exhibit stronger dispersive excitations. We further\ndiscuss the thermodynamical and spectral signatures of these \"triplet\" dimer\nphases that can be experimentally probed, and illustrate that the recently\ndiscovered Shastry-Sutherland magnet Yb$_{2}$Be$_{2}$GeO$_{7}$ hosts a triplet\ndimer ground state.\n",
  "subjects": [
    "Condensed Matter/Strongly Correlated Electrons"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "bPE07DsKEagujyZ4PDzJlzIj0nXQE-blohKlPuYjpKQ",
  "pdfSize": "5301723"
}