{
  "id": "2412.15100",
  "title": "Tests for model misspecification in simulation-based inference: from\n  local distortions to global model checks",
  "authors": "Noemi Anau Montel, James Alvey, Christoph Weniger",
  "authorsParsed": [
    [
      "Montel",
      "Noemi Anau",
      ""
    ],
    [
      "Alvey",
      "James",
      ""
    ],
    [
      "Weniger",
      "Christoph",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 17:48:03 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734630483000,
  "abstract": "  Model misspecification analysis strategies, such as anomaly detection, model\nvalidation, and model comparison are a key component of scientific model\ndevelopment. Over the last few years, there has been a rapid rise in the use of\nsimulation-based inference (SBI) techniques for Bayesian parameter estimation,\napplied to increasingly complex forward models. To move towards fully\nsimulation-based analysis pipelines, however, there is an urgent need for a\ncomprehensive simulation-based framework for model misspecification analysis.\nIn this work, we provide a solid and flexible foundation for a wide range of\nmodel discrepancy analysis tasks, using distortion-driven model\nmisspecification tests. From a theoretical perspective, we introduce the\nstatistical framework built around performing many hypothesis tests for\ndistortions of the simulation model. We also make explicit analytic connections\nto classical techniques: anomaly detection, model validation, and\ngoodness-of-fit residual analysis. Furthermore, we introduce an efficient\nself-calibrating training algorithm that is useful for practitioners. We\ndemonstrate the performance of the framework in multiple scenarios, making the\nconnection to classical results where they are valid. Finally, we show how to\nconduct such a distortion-driven model misspecification test for real\ngravitational wave data, specifically on the event GW150914.\n",
  "subjects": [
    "Astrophysics/Instrumentation and Methods for Astrophysics",
    "Astrophysics/Cosmology and Nongalactic Astrophysics",
    "Computer Science/Machine Learning",
    "Physics/General Relativity and Quantum Cosmology"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "-9ZLaLlWyQWC1AiiRwQruPN0CA1bNRvvCYLqIuAvNnU",
  "pdfSize": "1722614"
}