{"id":"2412.18975","title":"Injecting Bias into Text Classification Models using Backdoor Attacks","authors":"A. Dilara Yavuz and M. Emre Gursoy","authorsParsed":[["Yavuz","A. Dilara",""],["Gursoy","M. Emre",""]],"versions":[{"version":"v1","created":"Wed, 25 Dec 2024 19:32:02 GMT"}],"updateDate":"2024-12-30","timestamp":1735155122000,"abstract":"  The rapid growth of natural language processing (NLP) and pre-trained\nlanguage models have enabled accurate text classification in a variety of\nsettings. However, text classification models are susceptible to backdoor\nattacks, where an attacker embeds a trigger into the victim model to make the\nmodel predict attacker-desired labels in targeted scenarios. In this paper, we\npropose to utilize backdoor attacks for a new purpose: bias injection. We\ndevelop a backdoor attack in which a subset of the training dataset is poisoned\nto associate strong male actors with negative sentiment. We execute our attack\non two popular text classification datasets (IMDb and SST) and seven different\nmodels ranging from traditional Doc2Vec-based models to LSTM networks and\nmodern transformer-based BERT and RoBERTa models. Our results show that the\nreduction in backdoored models' benign classification accuracy is limited,\nimplying that our attacks remain stealthy, whereas the models successfully\nlearn to associate strong male actors with negative sentiment (100% attack\nsuccess rate with >= 3% poison rate). Attacks on BERT and RoBERTa are\nparticularly more stealthy and effective, demonstrating an increased risk of\nusing modern and larger models. We also measure the generalizability of our\nbias injection by proposing two metrics: (i) U-BBSR which uses previously\nunseen words when measuring attack success, and (ii) P-BBSR which measures\nattack success using paraphrased test samples. U-BBSR and P-BBSR results show\nthat the bias injected by our attack can go beyond memorizing a trigger phrase.\n","subjects":["Computer Science/Cryptography and Security","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"G5Wc3lJAVUCTEpusPosKfIJJmS0uuRPFlMbeFsllMQ4","pdfSize":"495143"}