{
  "id": "2412.19086",
  "title": "Investigating the Temporal Dynamics of Cyber Threat Intelligence",
  "authors": "Angel Kodituwakku, Clark Xu, Daniel Rogers, David K. Ahn, Errin W.\n  Fulp",
  "authorsParsed": [
    [
      "Kodituwakku",
      "Angel",
      ""
    ],
    [
      "Xu",
      "Clark",
      ""
    ],
    [
      "Rogers",
      "Daniel",
      ""
    ],
    [
      "Ahn",
      "David K.",
      ""
    ],
    [
      "Fulp",
      "Errin W.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 26 Dec 2024 06:54:27 GMT"
    }
  ],
  "updateDate": "2025-01-22",
  "timestamp": 1735196067000,
  "abstract": "  Indicators of Compromise (IoCs) play a crucial role in the rapid detection\nand mitigation of cyber threats. However, the existing body of literature lacks\nin-depth analytical studies on the temporal aspects of IoC publication,\nespecially when considering up-to-date datasets related to Common\nVulnerabilities and Exposures (CVEs). This paper addresses this gap by\nconducting an analysis of the timeliness and comprehensiveness of Cyber Threat\nIntelligence (CTI) pertaining to several recent CVEs. The insights derived from\nthis study aim to enhance cybersecurity defense strategies, particularly when\ndealing with dynamic cyber threats that continually adapt their Tactics,\nTechniques, and Procedures (TTPs). Utilizing IoCs sourced from multiple\nproviders, we scrutinize the IoC publication rate. Our analysis delves into how\nvarious factors, including the inherent nature of a threat, its evolutionary\ntrajectory, and its observability over time, influence the publication rate of\nIoCs. Our preliminary findings emphasize the critical need for cyber defenders\nto maintain a constant state of vigilance in updating their IoCs for any given\nvulnerability. This vigilance is warranted because the publication rate of IoCs\nmay exhibit fluctuations over time. We observe a recurring pattern akin to an\nepidemic model, with an initial phase following the public disclosure of a\nvulnerability characterized by sparse IoC publications, followed by a sudden\nsurge, and subsequently, a protracted period with a slower rate of IoC\npublication.\n",
  "subjects": [
    "Computer Science/Cryptography and Security",
    "Computer Science/Information Theory",
    "Computer Science/Social and Information Networks",
    "Mathematics/Information Theory"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "gXpoDJxaJCB5p53HhG-FOj_VseNXDnPFHgvwrOSMNJs",
  "pdfSize": "95651"
}