{"id":"2412.18693","title":"Diverse and Effective Red Teaming with Auto-generated Rewards and\n  Multi-step Reinforcement Learning","authors":"Alex Beutel, Kai Xiao, Johannes Heidecke, Lilian Weng","authorsParsed":[["Beutel","Alex",""],["Xiao","Kai",""],["Heidecke","Johannes",""],["Weng","Lilian",""]],"versions":[{"version":"v1","created":"Tue, 24 Dec 2024 22:38:46 GMT"}],"updateDate":"2024-12-30","timestamp":1735079926000,"abstract":"  Automated red teaming can discover rare model failures and generate\nchallenging examples that can be used for training or evaluation. However, a\ncore challenge in automated red teaming is ensuring that the attacks are both\ndiverse and effective. Prior methods typically succeed in optimizing either for\ndiversity or for effectiveness, but rarely both. In this paper, we provide\nmethods that enable automated red teaming to generate a large number of diverse\nand successful attacks.\n  Our approach decomposes the task into two steps: (1) automated methods for\ngenerating diverse attack goals and (2) generating effective attacks for those\ngoals. While we provide multiple straightforward methods for generating diverse\ngoals, our key contributions are to train an RL attacker that both follows\nthose goals and generates diverse attacks for those goals. First, we\ndemonstrate that it is easy to use a large language model (LLM) to generate\ndiverse attacker goals with per-goal prompts and rewards, including rule-based\nrewards (RBRs) to grade whether the attacks are successful for the particular\ngoal. Second, we demonstrate how training the attacker model with multi-step\nRL, where the model is rewarded for generating attacks that are different from\npast attempts further increases diversity while remaining effective. We use our\napproach to generate both prompt injection attacks and prompts that elicit\nunsafe responses. In both cases, we find that our approach is able to generate\nhighly-effective and considerably more diverse attacks than past general\nred-teaming approaches.\n","subjects":["Computer Science/Machine Learning","Computer Science/Artificial Intelligence","Computer Science/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"tAL2bHYcBA192sNYs59jAExx9WcblqW_tSWM8qw1Dxo","pdfSize":"1841441"}