{
  "id": "2412.01771",
  "title": "Does matter Kerr?",
  "authors": "Massimo Bianchi, Claudio Gambino, Paolo Pani, Fabio Riccioni",
  "authorsParsed": [
    [
      "Bianchi",
      "Massimo",
      ""
    ],
    [
      "Gambino",
      "Claudio",
      ""
    ],
    [
      "Pani",
      "Paolo",
      ""
    ],
    [
      "Riccioni",
      "Fabio",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 18:12:31 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733163151000,
  "abstract": "  Working in momentum space and at linear order in the gravitational coupling,\nwe derive the most general class of energy-momentum tensors associated with a\ngiven multipolar structure of the spacetime in arbitrary dimensions, and built\nout of a mass and an angular momentum, at any order in the spin expansion. In\nthis formalism, we are able to derive directly the full multipolar structure of\nany solution from the multipole expansion of the energy-momentum tensor, in\ncomplete analogy to Newtonian gravity. In particular, we identify the\nrecurrence relations that allow obtaining the multipolar structure of the Kerr\nand the Myers-Perry black hole solutions, defining source multipoles in a\nGeneral Relativity context for the first time. For these solutions, we are able\nto resum the energy-momentum tensor in momentum space at all orders in the\nangular momentum, and compute its real-space version. In the Kerr case we\nexactly obtain the matter source found by Israel, namely an equatorial,\npressureless thin disk rotating at superluminal speed. For Myers-Perry in five\ndimensions, the matter distribution is a three-ellipsoid in four spatial\ndimensions with nontrivial stresses. Remarkably, for any dimensions, the matter\nconfiguration is a lower-dimensional distribution which has the same\nsingularity structure as the fully non-linear black-hole solution. Our\nformalism underscores the advantage of working in momentum space to generate\nnontrivial matter sources for non-linear spacetimes, and could be used to\nconstruct regular non-exotic matter configurations that source spinning black\nhole solutions or horizonless compact objects with the same multipolar\nstructure as black holes.\n",
  "subjects": [
    "Physics/General Relativity and Quantum Cosmology",
    "Physics/High Energy Physics - Theory"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "SXulRLFWOoGA-Q31JU0S6aMn5KbtWdvzuPHAVIuCSK8",
  "pdfSize": "379112"
}