{"id":"2412.04050","title":"A Phase-Field-Micromechanics Study on the Microstructural Evolution\n  during Viscous Sintering","authors":"Xiaoxu Dai, Bo Qian, Arkadz Kirshtein, Qingcheng Yang","authorsParsed":[["Dai","Xiaoxu",""],["Qian","Bo",""],["Kirshtein","Arkadz",""],["Yang","Qingcheng",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 10:39:53 GMT"}],"updateDate":"2024-12-06","timestamp":1733395193000,"abstract":"  In the manufacturing process of high-performance particulate materials,\nviscous sintering plays a crucial role, particularly in fields such as polymer\nprocessing and additive manufacturing. The interactions between microscopic\nparticles, their flow behavior, and the evolution of porosity during the\nviscous sintering process directly influence the material's density and\nmechanical properties. Therefore, developing efficient modeling techniques to\nsimulate the viscous sintering process is essential for optimizing sintering\ntechnology. However, the large deformations and dynamic surface evolution\ninherent in the viscous sintering of particulate materials present challenges\nto traditional methods based on the sharp interface model. To address these\nchallenges, we propose a thermodynamically consistent diffusion interface\nmodel, referred to as the phase-field-micromechanics model, to analyze the\nevolution of various physical quantities throughout the viscous sintering\nprocess. This model implicitly describes the evolution of particle morphology\nthrough an introduced phase-field variable. Through comparisons with analytical\nsolutions and experimental data, we rigorously validate the correctness of the\nproposed model qualitatively and quantitatively under both isothermal and\nnon-isothermal conditions. Using the proposed model, we explore the development\nof strain and stress during the sintering process, as well as the effects of\nparticle size, shape and arrangement on the overall sintering behavior. The\nevolution of these characteristic indicators allows for a clear observation of\nthe viscous sintering process, which is vital for understanding the mechanisms\nbehind viscous sintering and for guiding industrial production.\n","subjects":["Computer Science/Computational Engineering, Finance, and Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"VDuj_niHvDMQdPePJF4K_NNbUsGetHDs4OKIFlybKtM","pdfSize":"1437900"}