{
  "id": "2412.19662",
  "title": "Innovation beyond intention: harnessing exaptation for technological\n  breakthroughs",
  "authors": "Youwei He, Jeong-Dong Lee, Seungmin Lee",
  "authorsParsed": [
    [
      "He",
      "Youwei",
      ""
    ],
    [
      "Lee",
      "Jeong-Dong",
      ""
    ],
    [
      "Lee",
      "Seungmin",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 27 Dec 2024 14:19:17 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735309157000,
  "abstract": "  The frameworks that explore scientific and technological evolution suggest\nthat discoveries and inventions are intrinsic processes, while the wealth of\nknowledge accumulated over time enables researchers to make further\nadvancements, echoing Newton's sentiment of \"standing on the shoulders of\ngiants.\" Despite the exponential growth in new scientific and technical\nknowledge, the consolidation-disruption (D) index suggests a concerning decline\nin the disruptiveness of papers and patents. \"Exaptation\" a concept borrowed\nfrom biological evolution, is now recognized as a pivotal yet often neglected\nmechanism in technological evolution. Significant technologies often do not\nemerge out of thin air but rather result from the application of existing\ntechnologies in other domains. For instance, bird feathers initially served as\nwaterproofing and insulation before enabling flight, and microwave ovens\noriginated from radar magnetrons. Exaptation, acknowledged as the catalyst for\n\"innovation beyond intention\" signifies a cross-field evolutionary process that\nis driven by functional shifts in pre-existing knowledge, technology, or\nartifacts. In this study, we introduce the concept of exaptation value,\ndeliberately excluding serendipity. Our analysis reveals that, despite a\ndeclining trend in the disruptiveness of innovation, there is an increasing\ntrend in the application of cross-domain knowledge within the innovation\nprocess over time. We also explore the impact of technology exaptation on\ninnovation disruptiveness and discuss how leveraging technology adaptability\nenhances innovation's disruptive potential.\n",
  "subjects": [
    "Physics/Physics and Society",
    "Computer Science/Social and Information Networks"
  ],
  "license": "http://creativecommons.org/publicdomain/zero/1.0/",
  "blobId": "tH5Fvi9mNaKhGltE1dqk7VbSYGIq2cfcIwCyEBuWfj0",
  "pdfSize": "1786894"
}