{
  "id": "2412.03967",
  "title": "First Measurements of the 4-Point Correlation Function of\n  Magnetohydrodynamic Turbulence as a Novel Probe of the Interstellar Medium",
  "authors": "Victoria Williamson, James Sunseri, Zachary Slepian, Jiamin Hou, and\n  Alessandro Greco",
  "authorsParsed": [
    [
      "Williamson",
      "Victoria",
      ""
    ],
    [
      "Sunseri",
      "James",
      ""
    ],
    [
      "Slepian",
      "Zachary",
      ""
    ],
    [
      "Hou",
      "Jiamin",
      ""
    ],
    [
      "Greco",
      "Alessandro",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 08:34:59 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733387699000,
  "abstract": "  In the Interstellar Medium (ISM), gas and dust evolve under\nmagnetohydrodynamic (MHD) turbulence. This produces dense, non-linear\nstructures that then seed star formation. Observationally and theoretically,\nturbulence is quantified by summary statistics such as the 2-Point Correlation\nFunction (2PCF) or its Fourier-space analog the power spectrum. These cannot\ncapture the non-Gaussian correlations coming from turbulence's highly\nnon-linear nature. We here for the first time apply the 4-Point Correlation\nFunction (4PCF) to turbulence, measuring it on a large suite of MHD simulations\nthat mirror, as well as currently possible, the conditions expected in the ISM.\nThe 4PCF captures the dependence of correlations between quadruplets of density\npoints on the geometry of the tetrahedron they form. Using a novel\nfunctionality added to the \\textsc{sarabande} code specifically for this work,\nwe isolate the purely non-Gaussian piece of the 4PCF. We then explore\nsimulations with a range of pressures, $P$, and magnetic fields, $B$ (but\nwithout self-gravity); these are quantified by different sonic $(M_{\\rm S})$\nand Alfv\\'enic $(M_{\\rm A})$ Mach numbers. We show that the 4PCF has rich\nbehavior that can in future be used as a diagnostic of ISM conditions. We also\nshow that a large-scale coherent magnetic field leads to parity-odd modes of\nthe 4PCF, a clean test of magnetic field coherence with observational\nramifications. All our measurements of the 4PCF (10 $M_{\\rm S}, M_{\\rm A}$\ncombinations, 9 time-slices for each, 34 4PCF modes for each) are made public\nfor the community to explore.\n",
  "subjects": [
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "bZ87ZwRDK_0128CzfR1V0W0_DEFg7sy4qgsiNNByb5o",
  "pdfSize": "7311932"
}