{
  "id": "2412.05409",
  "title": "Multilinear analysis of quaternion arrays: theory and computation",
  "authors": "Julien Flamant, Xavier Luciani, Sebastian Miron, Yassine Zniyed",
  "authorsParsed": [
    [
      "Flamant",
      "Julien",
      ""
    ],
    [
      "Luciani",
      "Xavier",
      ""
    ],
    [
      "Miron",
      "Sebastian",
      ""
    ],
    [
      "Zniyed",
      "Yassine",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 20:39:16 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733517556000,
  "abstract": "  Multidimensional quaternion arrays (often referred to as \"quaternion\ntensors\") and their decompositions have recently gained increasing attention in\nvarious fields such as color and polarimetric imaging or video processing.\nDespite this growing interest, the theoretical development of quaternion\ntensors remains limited. This paper introduces a novel multilinear framework\nfor quaternion arrays, which extends the classical tensor analysis to\nmultidimensional quaternion data in a rigorous manner. Specifically, we propose\na new definition of quaternion tensors as $\\mathbb{H}\\mathbb{R}$-multilinear\nforms, addressing the challenges posed by the non-commutativity of quaternion\nmultiplication. Within this framework, we establish the Tucker decomposition\nfor quaternion tensors and develop a quaternion Canonical Polyadic\nDecomposition (Q-CPD). We thoroughly investigate the properties of the Q-CPD,\nincluding trivial ambiguities, complex equivalent models, and sufficient\nconditions for uniqueness. Additionally, we present two algorithms for\ncomputing the Q-CPD and demonstrate their effectiveness through numerical\nexperiments. Our results provide a solid theoretical foundation for further\nresearch on quaternion tensor decompositions and offer new computational tools\nfor practitioners working with quaternion multiway data.\n",
  "subjects": [
    "Mathematics/Numerical Analysis",
    "Computer Science/Numerical Analysis",
    "Electrical Engineering and Systems Science/Signal Processing"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "7_oXkqhYFCIog_fSiDKwa7xDggm_NSxYpUsFbxmXsCk",
  "pdfSize": "614769"
}