{"id":"2412.09905","title":"Subsystem Thermalization Hypothesis in Quantum Spin Chains with\n  Conserved Charges","authors":"Feng-Li Lin and Jhh-Jing Hong and Ching-Yu Huang","authorsParsed":[["Lin","Feng-Li",""],["Hong","Jhh-Jing",""],["Huang","Ching-Yu",""]],"versions":[{"version":"v1","created":"Fri, 13 Dec 2024 06:45:07 GMT"}],"updateDate":"2024-12-16","timestamp":1734072307000,"abstract":"  We consider the thermalization hypothesis of pure states in quantum Ising\nchain with $Z_2$ symmetry, XXZ chain with $U(1)$ symmetry, and XXX chain with\n$SU(2)$ symmetries. Two kinds of pure states are considered: the energy\neigenstates and the typical states evolved unitarily from the random product\nstates for a long enough period. We further group the typical states by their\nexpectation values of the conserved charges and consider the fine-grained\nthermalization hypothesis. We compare the locally (subsystem) reduced states of\ntypical states/eigenstates with the ones of the corresponding thermal ensemble\nstates. Besides the usual thermal ensembles such as the (micro-)canonical\nensemble without conserved charges and the generalized Gibbs ensemble (GGE)\nwith all conserved charges included, we also consider the so-called\npartial-GGEs (p-GGEs), which include only part of the conserved charges in the\nthermal ensemble. Moreover, in the framework of p-GGE, the Hamiltonian and\nother conserved charges are on an equal footing. The introduction of p-GGEs\nextends quantum thermalization to a more general scope. The validity of the\nsubsystem thermalization hypothesis can be quantified by the smallness of the\nrelative entropy of the reduced states obtained from the GGE/p-GGE and the\ntypical states/eigenstates. We examine the validity of the thermalization\nhypothesis by numerically studying the relative entropy demographics. We show\nthat the thermalization hypothesis holds generically for the small enough\nsubsystems for various p-GGEs. Thus, our framework extends the universality of\nquantum thermalization.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Statistical Mechanics","Condensed Matter/Strongly Correlated Electrons","Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"9CrzMfphwNi-at9BXiqGWE2bEy9titefqBiwUNScKLo","pdfSize":"2758802"}