{
  "id": "2412.13211",
  "title": "ManiSkill-HAB: A Benchmark for Low-Level Manipulation in Home\n  Rearrangement Tasks",
  "authors": "Arth Shukla, Stone Tao, Hao Su",
  "authorsParsed": [
    [
      "Shukla",
      "Arth",
      ""
    ],
    [
      "Tao",
      "Stone",
      ""
    ],
    [
      "Su",
      "Hao",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 01:29:24 GMT"
    },
    {
      "version": "v2",
      "created": "Fri, 20 Dec 2024 05:21:39 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1733707764000,
  "abstract": "  High-quality benchmarks are the foundation for embodied AI research, enabling\nsignificant advancements in long-horizon navigation, manipulation and\nrearrangement tasks. However, as frontier tasks in robotics get more advanced,\nthey require faster simulation speed, more intricate test environments, and\nlarger demonstration datasets. To this end, we present MS-HAB, a holistic\nbenchmark for low-level manipulation and in-home object rearrangement. First,\nwe provide a GPU-accelerated implementation of the Home Assistant Benchmark\n(HAB). We support realistic low-level control and achieve over 3x the speed of\nprevious magical grasp implementations at similar GPU memory usage. Second, we\ntrain extensive reinforcement learning (RL) and imitation learning (IL)\nbaselines for future work to compare against. Finally, we develop a rule-based\ntrajectory filtering system to sample specific demonstrations from our RL\npolicies which match predefined criteria for robot behavior and safety.\nCombining demonstration filtering with our fast environments enables efficient,\ncontrolled data generation at scale.\n",
  "subjects": [
    "Computer Science/Robotics",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "TZDjjzzRbIPJtWKYb_CObruIHugaXfL9fOZEtIhH4NI",
  "pdfSize": "11448590"
}