{"id":"2412.07618","title":"Adapting to Non-Stationary Environments: Multi-Armed Bandit Enhanced\n  Retrieval-Augmented Generation on Knowledge Graphs","authors":"Xiaqiang Tang, Jian Li, Nan Du, Sihong Xie","authorsParsed":[["Tang","Xiaqiang",""],["Li","Jian",""],["Du","Nan",""],["Xie","Sihong",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 15:56:03 GMT"},{"version":"v2","created":"Fri, 20 Dec 2024 03:12:49 GMT"}],"updateDate":"2024-12-23","timestamp":1733846163000,"abstract":"  Despite the superior performance of Large language models on many NLP tasks,\nthey still face significant limitations in memorizing extensive world\nknowledge. Recent studies have demonstrated that leveraging the\nRetrieval-Augmented Generation (RAG) framework, combined with Knowledge Graphs\nthat encapsulate extensive factual data in a structured format, robustly\nenhances the reasoning capabilities of LLMs. However, deploying such systems in\nreal-world scenarios presents challenges: the continuous evolution of\nnon-stationary environments may lead to performance degradation and user\nsatisfaction requires a careful balance of performance and responsiveness. To\naddress these challenges, we introduce a Multi-objective Multi-Armed Bandit\nenhanced RAG framework, supported by multiple retrieval methods with diverse\ncapabilities under rich and evolving retrieval contexts in practice. Within\nthis framework, each retrieval method is treated as a distinct ``arm''. The\nsystem utilizes real-time user feedback to adapt to dynamic environments, by\nselecting the appropriate retrieval method based on input queries and the\nhistorical multi-objective performance of each arm. Extensive experiments\nconducted on two benchmark KGQA datasets demonstrate that our method\nsignificantly outperforms baseline methods in non-stationary settings while\nachieving state-of-the-art performance in stationary environments. Code and\ndata are available at https://github.com/FUTUREEEEEE/Dynamic-RAG.git\n","subjects":["Computer Science/Artificial Intelligence","Computer Science/Computation and Language"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"krCbmVq8dgaZDmxRowiYr0rtk208tlqka080Udk07PA","pdfSize":"1361670"}