{
  "id": "2412.18822",
  "title": "Conductance-Photoacoustic Spectroscopy for OneSignal Measurement of\n  Multi-components",
  "authors": "Ruobin Zhuang, Jianfeng He and Huadan Zheng",
  "authorsParsed": [
    [
      "Zhuang",
      "Ruobin",
      ""
    ],
    [
      "He",
      "Jianfeng",
      ""
    ],
    [
      "Zheng",
      "Huadan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 25 Dec 2024 08:23:07 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735114987000,
  "abstract": "  Ensuring safety and efficiency in emerging hydrogen-hydrocarbon fuel systems\nrequires accurate measurement of multiple gas components in real time. However,\nexisting detection techniques generally lack the capability to quantitatively\nmeasure hydrogen and natural gas constituents simultaneously. Here, we present\na novel conductance-photoacoustic spectroscopy (CPAS) method that integrates\nplatinum-modified conductance measurements with beat-frequency photoacoustic\ndetection. By bridging a quartz tuning fork with a platinum microwire, our\napproach enables direct monitoring of hydrogen concentration via frequency\nmodulation, while simultaneously capturing propane's photoacoustic signal with\na single detection channel. Experimental results confirm that the platinum\nmicrowire effectively fine-tunes the tuning fork's mechanical properties for\nhigh-sensitivity hydrogen measurement, and the beat-frequency photoacoustic\nsignals from propane absorption reveal complementary hydrocarbon concentration\ninformation. This unified sensor design is inherently compact, rapid, and\ncalibration-free, making it particularly suitable for applications that demand\nreal-time multiparameter gas analysis, including industrial process control and\nenvironmental monitoring. Taken together, these findings demonstrate that\ncombining conductance and photoacoustic spectroscopies into a single integrated\nplatform significantly advances the state of multi-component gas detection and\nholds promise for further enhancements in sensitivity and adaptability.\n",
  "subjects": [
    "Physics/Optics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "0AHJplZ2vcqSgpCU2Ivy_3mggt4MHD3Sloj7K-jaGHY",
  "pdfSize": "380006"
}