{"id":"2412.16022","title":"The Only Way is Ethics: A Guide to Ethical Research with Large Language\n  Models","authors":"Eddie L. Ungless and Nikolas Vitsakis and Zeerak Talat and James\n  Garforth and Bj\\\"orn Ross and Arno Onken and Atoosa Kasirzadeh and Alexandra\n  Birch","authorsParsed":[["Ungless","Eddie L.",""],["Vitsakis","Nikolas",""],["Talat","Zeerak",""],["Garforth","James",""],["Ross","Björn",""],["Onken","Arno",""],["Kasirzadeh","Atoosa",""],["Birch","Alexandra",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 16:14:43 GMT"}],"updateDate":"2024-12-23","timestamp":1734711283000,"abstract":"  There is a significant body of work looking at the ethical considerations of\nlarge language models (LLMs): critiquing tools to measure performance and\nharms; proposing toolkits to aid in ideation; discussing the risks to workers;\nconsidering legislation around privacy and security etc. As yet there is no\nwork that integrates these resources into a single practical guide that focuses\non LLMs; we attempt this ambitious goal. We introduce 'LLM Ethics Whitepaper',\nwhich we provide as an open and living resource for NLP practitioners, and\nthose tasked with evaluating the ethical implications of others' work. Our goal\nis to translate ethics literature into concrete recommendations and\nprovocations for thinking with clear first steps, aimed at computer scientists.\n'LLM Ethics Whitepaper' distils a thorough literature review into clear Do's\nand Don'ts, which we present also in this paper. We likewise identify useful\ntoolkits to support ethical work. We refer the interested reader to the full\nLLM Ethics Whitepaper, which provides a succinct discussion of ethical\nconsiderations at each stage in a project lifecycle, as well as citations for\nthe hundreds of papers from which we drew our recommendations. The present\npaper can be thought of as a pocket guide to conducting ethical research with\nLLMs.\n","subjects":["Computer Science/Computation and Language","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ca2p763rDP_C17hOVUoGp0rh-HRqAYBxgq186IKX98E","pdfSize":"391641"}