{"id":"2412.13152","title":"Continuous Patient Monitoring with AI: Real-Time Analysis of Video in\n  Hospital Care Settings","authors":"Paolo Gabriel, Peter Rehani, Tyler Troy, Tiffany Wyatt, Michael Choma,\n  and Narinder Singh","authorsParsed":[["Gabriel","Paolo",""],["Rehani","Peter",""],["Troy","Tyler",""],["Wyatt","Tiffany",""],["Choma","Michael",""],["Singh","Narinder",""]],"versions":[{"version":"v1","created":"Tue, 17 Dec 2024 18:23:33 GMT"}],"updateDate":"2024-12-18","timestamp":1734459813000,"abstract":"  This study introduces an AI-driven platform for continuous and passive\npatient monitoring in hospital settings, developed by LookDeep Health.\nLeveraging advanced computer vision, the platform provides real-time insights\ninto patient behavior and interactions through video analysis, securely storing\ninference results in the cloud for retrospective evaluation. The dataset,\ncompiled in collaboration with 11 hospital partners, encompasses over 300\nhigh-risk fall patients and over 1,000 days of inference, enabling applications\nsuch as fall detection and safety monitoring for vulnerable patient\npopulations. To foster innovation and reproducibility, an anonymized subset of\nthis dataset is publicly available. The AI system detects key components in\nhospital rooms, including individual presence and role, furniture location,\nmotion magnitude, and boundary crossings. Performance evaluation demonstrates\nstrong accuracy in object detection (macro F1-score = 0.92) and patient-role\nclassification (F1-score = 0.98), as well as reliable trend analysis for the\n\"patient alone\" metric (mean logistic regression accuracy = 0.82 \\pm 0.15).\nThese capabilities enable automated detection of patient isolation, wandering,\nor unsupervised movement-key indicators for fall risk and other adverse events.\nThis work establishes benchmarks for validating AI-driven patient monitoring\nsystems, highlighting the platform's potential to enhance patient safety and\ncare by providing continuous, data-driven insights into patient behavior and\ninteractions.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"-2Ermq39Giym3BxwgHi3xrCI5fp1swf8gq_-BfGsqCM","pdfSize":"6298997"}