{"id":"2412.11837","title":"The Eclipsing Binaries via Artificial Intelligence. II. Need for Speed\n  in PHOEBE Forward Models","authors":"Marcin Wrona and Andrej Pr\\v{s}a","authorsParsed":[["Wrona","Marcin",""],["Prša","Andrej",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 15:00:15 GMT"},{"version":"v2","created":"Fri, 14 Feb 2025 20:44:33 GMT"}],"updateDate":"2025-02-18","timestamp":1734361215000,"abstract":"  In modern astronomy, the quantity of data collected has vastly exceeded the\ncapacity for manual analysis, necessitating the use of advanced artificial\nintelligence (AI) techniques to assist scientists with the most labor-intensive\ntasks. AI can optimize simulation codes where computational bottlenecks arise\nfrom the time required to generate forward models. One such example is PHOEBE,\na modeling code for eclipsing binaries (EBs), where simulating individual\nsystems is feasible, but analyzing observables for extensive parameter\ncombinations is highly time-consuming.\n  To address this, we present a fully connected feedforward artificial neural\nnetwork (ANN) trained on a dataset of over one million synthetic light curves\ngenerated with PHOEBE. Optimization of the ANN architecture yielded a model\nwith six hidden layers, each containing 512 nodes, provides an optimized\nbalance between accuracy and computational complexity. Extensive testing\nenabled us to establish ANN's applicability limits and to quantify the\nsystematic and statistical errors associated with using such networks for EB\nanalysis. Our findings demonstrate the critical role of dilution effects in\nparameter estimation for EBs, and we outline methods to incorporate these\neffects in AI-based models.\n  This proposed ANN framework enables a speedup of over four orders of\nmagnitude compared to traditional methods, with systematic errors not exceeding\n1\\%, and often as low as 0.01\\%, across the entire parameter space.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Astrophysics of Galaxies","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"SEqb1pwRGoOMy5O6pwbZ55aQWGmqPz9y9RXxCKV5Auo","pdfSize":"14652101"}