{
  "id": "2412.04746",
  "title": "Diff4Steer: Steerable Diffusion Prior for Generative Music Retrieval\n  with Semantic Guidance",
  "authors": "Xuchan Bao, Judith Yue Li, Zhong Yi Wan, Kun Su, Timo Denk, Joonseok\n  Lee, Dima Kuzmin, Fei Sha",
  "authorsParsed": [
    [
      "Bao",
      "Xuchan",
      ""
    ],
    [
      "Li",
      "Judith Yue",
      ""
    ],
    [
      "Wan",
      "Zhong Yi",
      ""
    ],
    [
      "Su",
      "Kun",
      ""
    ],
    [
      "Denk",
      "Timo",
      ""
    ],
    [
      "Lee",
      "Joonseok",
      ""
    ],
    [
      "Kuzmin",
      "Dima",
      ""
    ],
    [
      "Sha",
      "Fei",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 03:18:18 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733455098000,
  "abstract": "  Modern music retrieval systems often rely on fixed representations of user\npreferences, limiting their ability to capture users' diverse and uncertain\nretrieval needs. To address this limitation, we introduce Diff4Steer, a novel\ngenerative retrieval framework that employs lightweight diffusion models to\nsynthesize diverse seed embeddings from user queries that represent potential\ndirections for music exploration. Unlike deterministic methods that map user\nquery to a single point in embedding space, Diff4Steer provides a statistical\nprior on the target modality (audio) for retrieval, effectively capturing the\nuncertainty and multi-faceted nature of user preferences. Furthermore,\nDiff4Steer can be steered by image or text inputs, enabling more flexible and\ncontrollable music discovery combined with nearest neighbor search. Our\nframework outperforms deterministic regression methods and LLM-based generative\nretrieval baseline in terms of retrieval and ranking metrics, demonstrating its\neffectiveness in capturing user preferences, leading to more diverse and\nrelevant recommendations. Listening examples are available at\ntinyurl.com/diff4steer.\n",
  "subjects": [
    "Computer Science/Sound",
    "Computer Science/Information Retrieval",
    "Computer Science/Multimedia",
    "Electrical Engineering and Systems Science/Audio and Speech Processing"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "MXULqDU7HF6yNoV-BF2KbHr5TaPPm32VI-8-o-spxHI",
  "pdfSize": "4345276"
}