{"id":"2412.13807","title":"The role of accreted and in-situ populations in shaping the stellar\n  haloes of low-mass galaxies","authors":"Elisa A. Tau, Antonela Monachesi, Facundo A. Gomez, Robert J. J.\n  Grand, R\\\"udiger Pakmor, Freeke van de Voort, Jenny Gonzalez-Jara, Patricia\n  B. Tissera, Federico Marinacci, and Rebekka Bieri","authorsParsed":[["Tau","Elisa A.",""],["Monachesi","Antonela",""],["Gomez","Facundo A.",""],["Grand","Robert J. J.",""],["Pakmor","Rüdiger",""],["van de Voort","Freeke",""],["Gonzalez-Jara","Jenny",""],["Tissera","Patricia B.",""],["Marinacci","Federico",""],["Bieri","Rebekka",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 12:53:46 GMT"}],"updateDate":"2024-12-19","timestamp":1734526426000,"abstract":"  The stellar haloes of dwarf galaxies are becoming an object of interest in\nthe extragalactic community due to their detection in some recent observations.\nAdditionally, new cosmological simulations of very high resolution were\nperformed, allowing their study. These stellar haloes could help shed light on\nour understanding of the assembly of dwarf galaxies and their evolution, and\nallow us to test the hierarchical model for the formation of structures at\nsmall scales. We aim to characterise the stellar haloes of simulated dwarf\ngalaxies and analyse their evolution and accretion history. We use a sample of\n17 simulated galaxies from the Auriga Project with a stellar mass range from\n3.28x10^8 Msun to 2.08x10^10 Msun. We define the stellar halo as the stellar\nmaterial located outside an ellipsoid with semi-major axes equal to 4 times the\nhalf light radius (Rh) of each galaxy. We find that the inner regions of the\nstellar halo (4 to 6 times the Rh) are dominated by in-situ material. For the\nless massive simulated dwarfs (M*<=4.54x10^8 Msun), this dominance extends to\nall radii. We find that this in-situ stellar halo is mostly formed in the inner\nregions of the galaxies and then ejected into the outskirts during interactions\nand merger events. In ~50% of the galaxies, the stripped gas from satellites\ncontributed to the formation of this in-situ halo. The stellar haloes of the\ngalaxies more massive than M*>=1x10^9 Msun are dominated by the accreted\ncomponent beyond 6 Rh. We find that the more massive dwarf galaxies accrete\nstellar material until later times (t90~4.44 Gyr ago, being t90 the formation\ntime) than the less massive ones (t90~8.17 Gyr ago), impacting on the formation\ntime of the accreted stellar haloes. The galaxies have a range of 1 to 7\nsignificant progenitors contributing to their accreted component but there is\nno correlation between this quantity and the galaxies' accreted mass.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"u7OwYDuUsxYN_CMoCShSoqG5g1yOxmQ8_bY8lbzbU88","pdfSize":"2091602"}