{"id":"2412.13287","title":"On T-Invariance Violation in Neutrino Oscillations and Matter Effects","authors":"Olivia M. Bitter, Andr\\'e de Gouv\\^ea, Kevin J. Kelly","authorsParsed":[["Bitter","Olivia M.",""],["de Gouvêa","André",""],["Kelly","Kevin J.",""]],"versions":[{"version":"v1","created":"Tue, 17 Dec 2024 19:38:02 GMT"}],"updateDate":"2024-12-19","timestamp":1734464282000,"abstract":"  We investigate the impact of matter effects on T (time-reversal)-odd\nobservables, making use of the quantum-mechanical formalism of neutrino-flavor\nevolution. We attempt to be comprehensive and pedagogical. Matter-induced\nT-invariance violation (TV) is qualitatively different from, and more subtle\nthan, matter-induced CP (charge-parity)-invariance violation. If the matter\ndistribution is symmetric relative to the neutrino production and detection\npoints, matter effects will not introduce any new TV. However, if there is\nintrinsic TV, matter effects can modify the size of the T-odd observable. On\nthe other hand, if the matter distribution is not symmetric, there is genuine\nmatter-induced TV. For Earth-bound long-baseline oscillation experiments, these\neffects are small. This remains true for unrealistically-asymmetric matter\npotentials (for example, we investigate the effects of ''hollowing out'' 50% of\nthe DUNE neutrino trajectory). More broadly, we explore consequences, or lack\nthereof, of asymmetric matter potentials on oscillation probabilities. While\nfascinating in their own right, T-odd observables are currently of limited\npractical use, due in no small part to a dearth of intense, well-characterized,\nhigh-energy electron-neutrino beams. Further in the future, however, intense,\nhigh-energy muon storage rings might become available and allow for realistic\nstudies of T invariance in neutrino oscillations.\n","subjects":["Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Experiment"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Q1gYJKoDfPNr5_UowTQ1_Tnl7wB98ZXt1bAt1hfm0F8","pdfSize":"2443224"}