{"id":"2412.20669","title":"Econometric Analysis of Pandemic Disruption and Recovery Trajectory in\n  the U.S. Rail Freight Industry","authors":"Max T.M. Ng, Hani S. Mahmassani, Joseph L. Schofer","authorsParsed":[["Ng","Max T. M.",""],["Mahmassani","Hani S.",""],["Schofer","Joseph L.",""]],"versions":[{"version":"v1","created":"Mon, 30 Dec 2024 02:48:34 GMT"}],"updateDate":"2024-12-31","timestamp":1735526914000,"abstract":"  To measure the impacts on U.S. rail and intermodal freight by economic\ndisruptions of the 2007-09 Great Recession and the COVID-19 pandemic, this\npaper uses time series analysis with the AutoRegressive Integrated Moving\nAverage (ARIMA) family of models and covariates to model intermodal and\ncommodity-specific rail freight volumes based on pre-disruption data. A\nframework to construct scenarios and select parameters and variables is\ndemonstrated. By comparing actual freight volumes during the disruptions\nagainst three counterfactual scenarios, Trend Continuation, Covariate-adapted\nTrend Continuation, and Full Covariate-adapted Prediction, the characteristics\nand differences in magnitude and timing between the two disruptions and their\neffects across nine freight components are examined.\n  Results show the disruption impacts differ from measurement by simple\ncomparison with pre-disruption levels or year-on-year comparison depending on\nthe structural trend and seasonal pattern. Recovery Pace Plots are introduced\nto support comparison in recovery speeds across freight components. Accounting\nfor economic variables helps improve model fitness. It also enables evaluation\nof the change in association between freight volumes and covariates, where\nintermodal freight was found to respond more slowly during the pandemic,\npotentially due to supply constraint.\n","subjects":["Economics/Econometrics","Statistics/Applications"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"wJagt9I-fsE5rLQeAxXPEHsx9bQ-P-4cyNOXKmRCAT8","pdfSize":"2565725"}