{"id":"2412.08283","title":"A Preliminary Analysis of Automatic Word and Syllable Prominence\n  Detection in Non-Native Speech With Text-to-Speech Prosody Embeddings","authors":"Anindita Mondal, Rangavajjala Sankara Bharadwaj, Jhansi Mallela, Anil\n  Kumar Vuppala, Chiranjeevi Yarra","authorsParsed":[["Mondal","Anindita",""],["Bharadwaj","Rangavajjala Sankara",""],["Mallela","Jhansi",""],["Vuppala","Anil Kumar",""],["Yarra","Chiranjeevi",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 10:58:14 GMT"}],"updateDate":"2024-12-12","timestamp":1733914694000,"abstract":"  Automatic detection of prominence at the word and syllable-levels is critical\nfor building computer-assisted language learning systems. It has been shown\nthat prosody embeddings learned by the current state-of-the-art (SOTA)\ntext-to-speech (TTS) systems could generate word- and syllable-level prominence\nin the synthesized speech as natural as in native speech. To understand the\neffectiveness of prosody embeddings from TTS for prominence detection under\nnonnative context, a comparative analysis is conducted on the embeddings\nextracted from native and non-native speech considering the prominence-related\nembeddings: duration, energy, and pitch from a SOTA TTS named FastSpeech2.\nThese embeddings are extracted under two conditions considering: 1) only text,\n2) both speech and text. For the first condition, the embeddings are extracted\ndirectly from the TTS inference mode, whereas for the second condition, we\npropose to extract from the TTS under training mode. Experiments are conducted\non native speech corpus: Tatoeba, and non-native speech corpus: ISLE. For\nexperimentation, word-level prominence locations are manually annotated for\nboth corpora. The highest relative improvement on word \\& syllable-level\nprominence detection accuracies with the TTS embeddings are found to be 13.7% &\n5.9% and 16.2% & 6.9% compared to those with the heuristic-based features and\nself-supervised Wav2Vec-2.0 representations, respectively.\n","subjects":["Computer Science/Computation and Language","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"fIMUTxJe6ZGnvvxtViZ5iTDaRQuNFmpV6SUqq8CNgBQ","pdfSize":"3669670"}