{
  "id": "2412.19931",
  "title": "Pivoting B2B platform business models: From platform experimentation to\n  multi-platform integration to ecosystem envelopment",
  "authors": "Clara Filosa, Marin Jovanovic, Lara Agostini, Anna Nosella",
  "authorsParsed": [
    [
      "Filosa",
      "Clara",
      ""
    ],
    [
      "Jovanovic",
      "Marin",
      ""
    ],
    [
      "Agostini",
      "Lara",
      ""
    ],
    [
      "Nosella",
      "Anna",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 27 Dec 2024 21:34:05 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735335245000,
  "abstract": "  The landscape of digital servitization in the manufacturing sector is\nevolving, marked by a strategic shift from traditional product-centric to\nplatform business models (BMs). Manufacturing firms often employ a blend of\napproaches to develop business-to-business (B2B) platforms, leading to\nsignificant reconfigurations in their BMs. However, they frequently encounter\nfailures in their B2B platform development initiatives, leading them to abandon\ninitial efforts and pivot to alternative platform strategies. Therefore, this\nstudy, through an in-depth case study of a manufacturer in the energy sector,\narticulates a three-phase pivoting framework for B2B platform BMs, including\nplatform development and platform strategy. Initially, the manufacturer focused\non asset-based product sales supplemented by asset maintenance services and\nfollowed an emergent platformization strategy characterized by the rise of\nmultiple, independent B2B platforms catering to diverse functions. Next,\nfocusing on the imposed customer journey strategy, the firm shifted towards a\nstrategic multi-platform integration into an all-encompassing platform\nsupported by artificial intelligence (AI), signaling a maturation of the\nplatform BM to combine a wide range of services into an\nenergy-performance-based contract. Finally, the last step of the firm's\nplatform BM evolution consisted of a deliberate platform strategy open to\nexternal stakeholders and enveloping its data-driven offerings within a broader\nplatform ecosystem. This article advances B2B platform BMs and digital\nservitization literature, highlighting the efficacy of a progressive approach\nand strategic pivoting.\n",
  "subjects": [
    "Economics/General Economics",
    "Computer Science/Artificial Intelligence",
    "Quantitative Finance/Economics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "ecypLugnoWsoQcsVRU9-x5_2Xb9oR8Mkk3DY38yKX3w",
  "pdfSize": "3942711"
}