{
  "id": "2412.01698",
  "title": "UV-processing of icy pebbles in the outer parts of VSI-turbulent disks",
  "authors": "Lizxandra Flores-Rivera, Michiel Lambrechts, Sacha Gavino, Sebastian\n  Lorek, Mario Flock, Anders Johansen, Andrea Mignone",
  "authorsParsed": [
    [
      "Flores-Rivera",
      "Lizxandra",
      ""
    ],
    [
      "Lambrechts",
      "Michiel",
      ""
    ],
    [
      "Gavino",
      "Sacha",
      ""
    ],
    [
      "Lorek",
      "Sebastian",
      ""
    ],
    [
      "Flock",
      "Mario",
      ""
    ],
    [
      "Johansen",
      "Anders",
      ""
    ],
    [
      "Mignone",
      "Andrea",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 16:44:26 GMT"
    }
  ],
  "updateDate": "2025-01-29",
  "timestamp": 1733157866000,
  "abstract": "  Icy dust particles emerge in star-forming clouds and are subsequently\nincorporated in protoplanetary disks, where they coagulate into larger pebbles\nup to mm in size. In the disk midplane, ices are shielded from UV radiation,\nbut moderate levels of disk turbulence can lift small particles to the disk\nsurface, where they can be altered, or destroyed. Nevertheless, studies of\ncomets and meteorites generally find that ices at least partly retained their\ninterstellar medium (ISM) composition before being accreted onto these minor\nbodies. Here we model this process through hydrodynamical simulations with\nVSI-driven turbulence in the outer protoplanetary disk. We use the PLUTO code\nin a 2.5 D global accretion setup and include Lagrangian dust particles of 0.1\nand 1 mm sizes. In a post-processing step, we use the RADMC3D code to generate\nthe local UV radiation field to assess the level of ice processing of pebbles.\nWe find that a small fraction ($\\sim$17$\\%$) of 100 $\\mu$m size particles are\nfrequently lifted up to $Z/R=0.2$ which can result in the loss of their\npristine composition as their residence time in this layer allows for effective\nCO and water photodissociation. The larger 1 mm size particles remain\nUV-shielded in the disk midplane throughout the dynamical evolution of the\ndisk. Our results indicate that the assembly of icy bodies via the accretion of\ndrifting mm-size icy pebbles can explain the presence of pristine ice from the\nISM, even in VSI-turbulent disks. Nevertheless, particles $\\leq$ 100 $\\mu$m\nexperience efficient UV processing and may mix with unaltered icy pebbles,\nresulting in a less ISM-like composition in the midplane.\n",
  "subjects": [
    "Astrophysics/Earth and Planetary Astrophysics",
    "Astrophysics/Solar and Stellar Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Mgc8k-UE1CBT9EA8YwJxW9MwymryvYMl5F9Al406roI",
  "pdfSize": "6947759"
}