{
  "id": "2412.04677",
  "title": "Zephyr quantum-assisted hierarchical Calo4pQVAE for particle-calorimeter\n  interactions",
  "authors": "Ian Lu, Hao Jia, Sebastian Gonzalez, Deniz Sogutlu, J. Quetzalcoatl\n  Toledo-Marin, Sehmimul Hoque, Abhishek Abhishek, Colin Gay, Roger Melko, Eric\n  Paquet, Geoffrey Fox, Maximilian Swiatlowski, Wojciech Fedorko",
  "authorsParsed": [
    [
      "Lu",
      "Ian",
      ""
    ],
    [
      "Jia",
      "Hao",
      ""
    ],
    [
      "Gonzalez",
      "Sebastian",
      ""
    ],
    [
      "Sogutlu",
      "Deniz",
      ""
    ],
    [
      "Toledo-Marin",
      "J. Quetzalcoatl",
      ""
    ],
    [
      "Hoque",
      "Sehmimul",
      ""
    ],
    [
      "Abhishek",
      "Abhishek",
      ""
    ],
    [
      "Gay",
      "Colin",
      ""
    ],
    [
      "Melko",
      "Roger",
      ""
    ],
    [
      "Paquet",
      "Eric",
      ""
    ],
    [
      "Fox",
      "Geoffrey",
      ""
    ],
    [
      "Swiatlowski",
      "Maximilian",
      ""
    ],
    [
      "Fedorko",
      "Wojciech",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 00:23:12 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733444592000,
  "abstract": "  With the approach of the High Luminosity Large Hadron Collider (HL-LHC) era\nset to begin particle collisions by the end of this decade, it is evident that\nthe computational demands of traditional collision simulation methods are\nbecoming increasingly unsustainable. Existing approaches, which rely heavily on\nfirst-principles Monte Carlo simulations for modeling event showers in\ncalorimeters, are projected to require millions of CPU-years annually -- far\nexceeding current computational capacities. This bottleneck presents an\nexciting opportunity for advancements in computational physics by integrating\ndeep generative models with quantum simulations. We propose a quantum-assisted\nhierarchical deep generative surrogate founded on a variational autoencoder\n(VAE) in combination with an energy conditioned restricted Boltzmann machine\n(RBM) embedded in the model's latent space as a prior. By mapping the topology\nof D-Wave's Zephyr quantum annealer (QA) into the nodes and couplings of a\n4-partite RBM, we leverage quantum simulation to accelerate our shower\ngeneration times significantly. To evaluate our framework, we use Dataset 2 of\nthe CaloChallenge 2022. Through the integration of classical computation and\nquantum simulation, this hybrid framework paves way for utilizing large-scale\nquantum simulations as priors in deep generative models.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Artificial Intelligence",
    "Physics/High Energy Physics - Phenomenology",
    "Physics/Computational Physics",
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "DEL6CtCCv_hF5GhjnSfDq_xAizyvD0u1Jz5xUBGKxdU",
  "pdfSize": "1711985"
}