{
  "id": "2412.05563",
  "title": "A Survey on Uncertainty Quantification of Large Language Models:\n  Taxonomy, Open Research Challenges, and Future Directions",
  "authors": "Ola Shorinwa, Zhiting Mei, Justin Lidard, Allen Z. Ren, and Anirudha\n  Majumdar",
  "authorsParsed": [
    [
      "Shorinwa",
      "Ola",
      ""
    ],
    [
      "Mei",
      "Zhiting",
      ""
    ],
    [
      "Lidard",
      "Justin",
      ""
    ],
    [
      "Ren",
      "Allen Z.",
      ""
    ],
    [
      "Majumdar",
      "Anirudha",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 7 Dec 2024 06:56:01 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733554561000,
  "abstract": "  The remarkable performance of large language models (LLMs) in content\ngeneration, coding, and common-sense reasoning has spurred widespread\nintegration into many facets of society. However, integration of LLMs raises\nvalid questions on their reliability and trustworthiness, given their\npropensity to generate hallucinations: plausible, factually-incorrect\nresponses, which are expressed with striking confidence. Previous work has\nshown that hallucinations and other non-factual responses generated by LLMs can\nbe detected by examining the uncertainty of the LLM in its response to the\npertinent prompt, driving significant research efforts devoted to quantifying\nthe uncertainty of LLMs. This survey seeks to provide an extensive review of\nexisting uncertainty quantification methods for LLMs, identifying their salient\nfeatures, along with their strengths and weaknesses. We present existing\nmethods within a relevant taxonomy, unifying ostensibly disparate methods to\naid understanding of the state of the art. Furthermore, we highlight\napplications of uncertainty quantification methods for LLMs, spanning chatbot\nand textual applications to embodied artificial intelligence applications in\nrobotics. We conclude with open research challenges in uncertainty\nquantification of LLMs, seeking to motivate future research.\n",
  "subjects": [
    "Computer Science/Computation and Language",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "DP6PA3CiRbE9rErD1GWJBz_L4G4whVR_gAypadf3Oes",
  "pdfSize": "8974296"
}