{
  "id": "2412.20117",
  "title": "Neuromorphic circuit for temporal odor encoding in turbulent\n  environments",
  "authors": "Shavika Rastogi, Nik Dennler, Michael Schmuker and Andr\\'e van Schaik",
  "authorsParsed": [
    [
      "Rastogi",
      "Shavika",
      ""
    ],
    [
      "Dennler",
      "Nik",
      ""
    ],
    [
      "Schmuker",
      "Michael",
      ""
    ],
    [
      "van Schaik",
      "André",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 28 Dec 2024 11:12:18 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735384338000,
  "abstract": "  Natural odor environments present turbulent and dynamic conditions, causing\nchemical signals to fluctuate in space, time, and intensity. While many species\nhave evolved highly adaptive behavioral responses to such variability, the\nemerging field of neuromorphic olfaction continues to grapple with the\nchallenge of efficiently sampling and identifying odors in real-time. In this\nwork, we investigate Metal-Oxide (MOx) gas sensor recordings of constant\nairflow-embedded artificial odor plumes. We discover a data feature that is\nrepresentative of the presented odor stimulus at a certain concentration -\nirrespective of temporal variations caused by the plume dynamics. Further, we\ndesign a neuromorphic electronic nose front-end circuit for extracting and\nencoding this feature into analog spikes for gas detection and concentration\nestimation. The design is inspired by the spiking output of parallel neural\npathways in the mammalian olfactory bulb. We test the circuit for gas\nrecognition and concentration estimation in artificial environments, where\neither single gas pulses or pre-recorded odor plumes were deployed in a\nconstant flow of air. For both environments, our results indicate that the gas\nconcentration is encoded in -- and inversely proportional to the time\ndifference of analog spikes emerging out of two parallel pathways, similar to\nthe spiking output of a mammalian olfactory bulb. The resulting neuromorphic\nnose could enable data-efficient, real-time robotic plume navigation systems,\nadvancing the capabilities of odor source localization in applications such as\nenvironmental monitoring and search-and-rescue.\n",
  "subjects": [
    "Computer Science/Neural and Evolutionary Computing"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "fuUtr8xeQ0s7ZVtw6fx9JEiiP0StH1v-aoLnS9Qf9Ag",
  "pdfSize": "7411966"
}