{"id":"2412.12896","title":"3D Free-Form Optical Lens -- Miniaturised Fibre Couplers for\n  Astrophotonics","authors":"Haoran Mu, Daniel Smith, Tomas Katkus, Nguyen Hoai An Le, Dominyka\n  Stonyte, Darius Gailevicius, Dan Kapsaskis, Alexander Del Frate, Talwinder\n  Singh Bedi, Donatas Narbutis, Vijayakumar Anand, Darija Astrauskyte, Lina\n  Grineviciute, Soon Hock Ng, Karl Glazebrook, Jon Lawrence, Saulius Juodkazis","authorsParsed":[["Mu","Haoran",""],["Smith","Daniel",""],["Katkus","Tomas",""],["Le","Nguyen Hoai An",""],["Stonyte","Dominyka",""],["Gailevicius","Darius",""],["Kapsaskis","Dan",""],["Del Frate","Alexander",""],["Bedi","Talwinder Singh",""],["Narbutis","Donatas",""],["Anand","Vijayakumar",""],["Astrauskyte","Darija",""],["Grineviciute","Lina",""],["Ng","Soon Hock",""],["Glazebrook","Karl",""],["Lawrence","Jon",""],["Juodkazis","Saulius",""]],"versions":[{"version":"v1","created":"Tue, 17 Dec 2024 13:20:10 GMT"}],"updateDate":"2024-12-18","timestamp":1734441610000,"abstract":"  In astronomy, multi-object spectrographs employ fibre positioning robots to\ncouple the light from multiple astronomy sources (stars or galaxies) into\nmultiple multi-mode fibres, which are distributed across the focal plane of the\ntelescope. These fibres transport the celestial light to the entrance slit of a\nspectrograph (or bank of spectrographs) for analysis. For any multi-object\nsystem mm-scale opto-mechanical solutions are required to couple the telescope\nlight efficiently into the fibre. We demonstrate a unique micro-optics solution\nto replace current optical fibre couplers. Specifically, we target technology\non board the Keck telescope's FOBOS - Fibre-Optic Broadband Optical\nSpectrograph - which operates at UV to IR spectral ranges. For spectrally broad\nUV-IR band operation we use glass and crystals: fused silica, crystalline\nquartz (transparency 0.16 - 2 micrometers), sapphire Al2O3 (0.2 - 5\nmicrometers), CaF2 (0.2-7 micrometers), and BaF2 (0.2-10 micrometers). The\nminiaturised micro-coupler is monolithic, with the entire light path contained\nwithin glass or crystal, seamlessly extending to the fibre entrance, which is\nlaser-machined and precisely aligned with the optical axis.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"KLsakx0JdTFYB6hhxMMu61uqE8CJA5udEedtBs8dpQQ","pdfSize":"9849415"}