{
  "id": "2412.00538",
  "title": "Prognostic Framework for Robotic Manipulators Operating Under Dynamic\n  Task Severities",
  "authors": "Ayush Mohanty, Jason Dekarske, Stephen K. Robinson, Sanjay Joshi and\n  Nagi Gebraeel",
  "authorsParsed": [
    [
      "Mohanty",
      "Ayush",
      ""
    ],
    [
      "Dekarske",
      "Jason",
      ""
    ],
    [
      "Robinson",
      "Stephen K.",
      ""
    ],
    [
      "Joshi",
      "Sanjay",
      ""
    ],
    [
      "Gebraeel",
      "Nagi",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 30 Nov 2024 17:09:18 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1732986558000,
  "abstract": "  Robotic manipulators are critical in many applications but are known to\ndegrade over time. This degradation is influenced by the nature of the tasks\nperformed by the robot. Tasks with higher severity, such as handling heavy\npayloads, can accelerate the degradation process. One way this degradation is\nreflected is in the position accuracy of the robot's end-effector. In this\npaper, we present a prognostic modeling framework that predicts a robotic\nmanipulator's Remaining Useful Life (RUL) while accounting for the effects of\ntask severity. Our framework represents the robot's position accuracy as a\nBrownian motion process with a random drift parameter that is influenced by\ntask severity. The dynamic nature of task severity is modeled using a\ncontinuous-time Markov chain (CTMC). To evaluate RUL, we discuss two approaches\n-- (1) a novel closed-form expression for Remaining Lifetime Distribution\n(RLD), and (2) Monte Carlo simulations, commonly used in prognostics\nliterature. Theoretical results establish the equivalence between these RUL\ncomputation approaches. We validate our framework through experiments using two\ndistinct physics-based simulators for planar and spatial robot fleets. Our\nfindings show that robots in both fleets experience shorter RUL when handling a\nhigher proportion of high-severity tasks.\n",
  "subjects": [
    "Computer Science/Robotics",
    "Computer Science/Machine Learning",
    "Computer Science/Systems and Control",
    "Electrical Engineering and Systems Science/Systems and Control",
    "Statistics/Applications"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "xmxfg2BjlgjX0Ujym395np1EJ-cC7iuqi8HXE85Y7ok",
  "pdfSize": "7039106"
}