{
  "id": "2412.03483",
  "title": "Convolutional Neural Networks and Mixture of Experts for Intrusion\n  Detection in 5G Networks and beyond",
  "authors": "Loukas Ilias, George Doukas, Vangelis Lamprou, Christos Ntanos,\n  Dimitris Askounis",
  "authorsParsed": [
    [
      "Ilias",
      "Loukas",
      ""
    ],
    [
      "Doukas",
      "George",
      ""
    ],
    [
      "Lamprou",
      "Vangelis",
      ""
    ],
    [
      "Ntanos",
      "Christos",
      ""
    ],
    [
      "Askounis",
      "Dimitris",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 17:20:01 GMT"
    }
  ],
  "updateDate": "2024-12-05",
  "timestamp": 1733332801000,
  "abstract": "  The advent of 6G/NextG networks comes along with a series of benefits,\nincluding extreme capacity, reliability, and efficiency. However, these\nnetworks may become vulnerable to new security threats. Therefore, 6G/NextG\nnetworks must be equipped with advanced Artificial Intelligence algorithms, in\norder to evade these attacks. Existing studies on the intrusion detection task\nrely on the train of shallow machine learning classifiers, including Logistic\nRegression, Decision Trees, and so on, yielding suboptimal performance. Others\nare based on deep neural networks consisting of static components, which are\nnot conditional on the input. This limits their representation power and\nefficiency. To resolve these issues, we present the first study integrating\nMixture of Experts (MoE) for identifying malicious traffic. Specifically, we\nuse network traffic data and convert the 1D array of features into a 2D matrix.\nNext, we pass this matrix through convolutional neural network (CNN) layers\nfollowed by batch normalization and max pooling layers. After obtaining the\nrepresentation vector via the CNN layers, a sparsely gated MoE layer is used.\nThis layer consists of a set of experts (dense layers) and a router, where the\nrouter assigns weights to the output of each expert. Sparsity is achieved by\nchoosing the most relevant experts of the total ones. Finally, we perform a\nseries of ablation experiments to prove the effectiveness of our proposed\nmodel. Experiments are conducted on the 5G-NIDD dataset, a network intrusion\ndetection dataset generated from a real 5G test network. Results show that our\nintroduced approach reaches weighted F1-score up to 99.95% achieving comparable\nperformance to existing approaches. Findings also show that our proposed model\nachieves multiple advantages over state-of-the-art approaches.\n",
  "subjects": [
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "F9pYA9euDgQhcDnZVKxrpMyymcXGBECz8RWrrnPTzpA",
  "pdfSize": "1128447"
}