{
  "id": "2412.07758",
  "title": "Fastest spinning millisecond pulsars: indicators for quark matter in\n  neutron stars?",
  "authors": "Christoph G\\\"artlein, Violetta Sagun, Oleksii Ivanytskyi, David\n  Blaschke and Ilidio Lopes",
  "authorsParsed": [
    [
      "Gärtlein",
      "Christoph",
      ""
    ],
    [
      "Sagun",
      "Violetta",
      ""
    ],
    [
      "Ivanytskyi",
      "Oleksii",
      ""
    ],
    [
      "Blaschke",
      "David",
      ""
    ],
    [
      "Lopes",
      "Ilidio",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 18:54:39 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733856879000,
  "abstract": "  We study rotating hybrid stars, with a particular emphasis on the effect of a\ndeconfinement phase transition on their properties at high spin. Our analysis\nis based on a hybrid equation of state with a phase transition from\nhypernuclear matter to color-superconducting quark matter, where both phases\nare described within a relativistic density functional approach. By varying the\nvector and diquark couplings of quark matter, we obtain different hybrid star\nsequences with varying extension of the quark matter core, ensuring consistency\nwith astrophysical constraints from mass, radius and tidal deformability\nmeasurements. We demonstrate the impact of an increasing rotational frequency\non the maximum gravitational mass, the central energy density of compact stars,\nthe rise of the quasi-radial oscillations and non-axisymmetric instabilities.\nWe demonstrate that for the most favorable parameter sets with a strong vector\ncoupling, hybrid star configurations with color-superconducting quark matter\ncore can describe the fastest spinning and heaviest galactic pulsar J0952-0607,\nwhile it is out of reach for the purely hadronic hypernuclear star\nconfiguration.\n  We also revise the previously proposed empirical relation between the Kepler\nfrequency, gravitational mass, and radius of non-rotating neutron stars,\nobtained based on the assumption that all neutron stars, up to the heaviest,\nare hadronic. We show how the phase transition to quark matter alters this\nrelation and, consequently, the constraints on the dense matter equation of\nstate. Our findings reveal that incorporating the hybrid equation of state has\nsignificant implications for the constraints on the properties of strongly\ninteracting matter and neutron stars, placing the upper limit on\n$R_{1.4}\\leq14.90$ km (considering the 716 Hz frequency limit from\nJ1748+2446ad) and $R_{1.4}\\leq$11.90~km (for 1000 Hz).\n",
  "subjects": [
    "Physics/Nuclear Theory",
    "Astrophysics/High Energy Astrophysical Phenomena",
    "Physics/High Energy Physics - Phenomenology"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "KEMe6AqJfHEsipL2bdl0Sf5HuDq55kVG6EafWIObHuQ",
  "pdfSize": "14597396"
}