{
  "id": "2412.15627",
  "title": "Non-Stationary Critical Phenomena: Expanding The Critical Point",
  "authors": "Richard E. Spinney, Richard G. Morris",
  "authorsParsed": [
    [
      "Spinney",
      "Richard E.",
      ""
    ],
    [
      "Morris",
      "Richard G.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 07:34:58 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734680098000,
  "abstract": "  Biased quorum-sensing active particles (bQSAPs) are shown to extend notions\nof dynamic critical phenomena beyond active phase separation into the\nprototypical nonequilibrium setting of driven transport, where characteristic\nemergent behaviour is not stationary. To do so, we construct an effective field\ntheory in a single order-parameter -- a non-stationary analogue of active Model\nB -- which accounts for the fact that different aspects of bQSAPs can only be\ncast in terms of passive thermodynamics under an appropriate choice of inertial\nframe. This codifies the movement of phase boundaries due to nonequilibrium\nfluxes between coexisting bulk phases in terms of a difference in effective\nchemical potentials and therefore an unequal tangent construction on a bulk\nfree energy density. The result is an anomalous phase structure; binodals are\npermitted to cross spinodal lines so that criticality is no longer constrained\nto a single point. Instead, criticality -- with exponents that are seemingly\nunchanged from symmetric QSAPs -- is shown to exist along a line that marks the\nentry to an otherwise forbidden region of phase space. The interior of this\nregion is not critical in the conventional sense but retains certain features\nof criticality, which we term pseudo-critical. Since a Ginzburg criterion\ncannot be satisfied, fluctuations cannot be ignored, no matter how small, and\nmanifest at the scale of macroscopic features. However, finite-wavenumber\nfluctuations grow at non-vanishing rates and are characterized by non-trivial\ndispersion relations. The resulting interplay is used to explain how different\nareas of phase space correspond to different types of micro- and meso-phase\nseparation.\n",
  "subjects": [
    "Condensed Matter/Statistical Mechanics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "pTGAzmy1ETzjS-Wx4-N7H1jkyq8FcBxgr7YUTdZ3OJQ",
  "pdfSize": "41964621"
}