{
  "id": "2412.09871",
  "title": "Byte Latent Transformer: Patches Scale Better Than Tokens",
  "authors": "Artidoro Pagnoni, Ram Pasunuru, Pedro Rodriguez, John Nguyen, Benjamin\n  Muller, Margaret Li, Chunting Zhou, Lili Yu, Jason Weston, Luke Zettlemoyer,\n  Gargi Ghosh, Mike Lewis, Ari Holtzman, Srinivasan Iyer",
  "authorsParsed": [
    [
      "Pagnoni",
      "Artidoro",
      ""
    ],
    [
      "Pasunuru",
      "Ram",
      ""
    ],
    [
      "Rodriguez",
      "Pedro",
      ""
    ],
    [
      "Nguyen",
      "John",
      ""
    ],
    [
      "Muller",
      "Benjamin",
      ""
    ],
    [
      "Li",
      "Margaret",
      ""
    ],
    [
      "Zhou",
      "Chunting",
      ""
    ],
    [
      "Yu",
      "Lili",
      ""
    ],
    [
      "Weston",
      "Jason",
      ""
    ],
    [
      "Zettlemoyer",
      "Luke",
      ""
    ],
    [
      "Ghosh",
      "Gargi",
      ""
    ],
    [
      "Lewis",
      "Mike",
      ""
    ],
    [
      "Holtzman",
      "Ari",
      ""
    ],
    [
      "Iyer",
      "Srinivasan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 05:33:32 GMT"
    }
  ],
  "updateDate": "2024-12-16",
  "timestamp": 1734068012000,
  "abstract": "  We introduce the Byte Latent Transformer (BLT), a new byte-level LLM\narchitecture that, for the first time, matches tokenization-based LLM\nperformance at scale with significant improvements in inference efficiency and\nrobustness. BLT encodes bytes into dynamically sized patches, which serve as\nthe primary units of computation. Patches are segmented based on the entropy of\nthe next byte, allocating more compute and model capacity where increased data\ncomplexity demands it. We present the first FLOP controlled scaling study of\nbyte-level models up to 8B parameters and 4T training bytes. Our results\ndemonstrate the feasibility of scaling models trained on raw bytes without a\nfixed vocabulary. Both training and inference efficiency improve due to\ndynamically selecting long patches when data is predictable, along with\nqualitative improvements on reasoning and long tail generalization. Overall,\nfor fixed inference costs, BLT shows significantly better scaling than\ntokenization-based models, by simultaneously growing both patch and model size.\n",
  "subjects": [
    "Computer Science/Computation and Language"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "j646mgiIYp-zUDpYVTzRZEZ3mWrh0iKjr8Jt9_E1AwI",
  "pdfSize": "2388447"
}