{
  "id": "2412.19274",
  "title": "Flat panel laser displays enabled by large-scale visible photonic\n  integrated circuits",
  "authors": "Zhujun Shi, Risheng Cheng, Guohua Wei, Steven A. Hickman, Min Chul\n  Shin, Peter Topalian, Lei Wang, Dusan Coso, Brian Le, Lizzy Lee, Sean\n  Braxton, Alexander Koshelev, Maxwell F. Parsons, Rahul Agarwal, Barry\n  Silverstein, Yun Wang, Giuseppe Calafiore",
  "authorsParsed": [
    [
      "Shi",
      "Zhujun",
      ""
    ],
    [
      "Cheng",
      "Risheng",
      ""
    ],
    [
      "Wei",
      "Guohua",
      ""
    ],
    [
      "Hickman",
      "Steven A.",
      ""
    ],
    [
      "Shin",
      "Min Chul",
      ""
    ],
    [
      "Topalian",
      "Peter",
      ""
    ],
    [
      "Wang",
      "Lei",
      ""
    ],
    [
      "Coso",
      "Dusan",
      ""
    ],
    [
      "Le",
      "Brian",
      ""
    ],
    [
      "Lee",
      "Lizzy",
      ""
    ],
    [
      "Braxton",
      "Sean",
      ""
    ],
    [
      "Koshelev",
      "Alexander",
      ""
    ],
    [
      "Parsons",
      "Maxwell F.",
      ""
    ],
    [
      "Agarwal",
      "Rahul",
      ""
    ],
    [
      "Silverstein",
      "Barry",
      ""
    ],
    [
      "Wang",
      "Yun",
      ""
    ],
    [
      "Calafiore",
      "Giuseppe",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 26 Dec 2024 16:31:00 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735230660000,
  "abstract": "  Laser-based displays are highly sought after for their superior brightness\nand color performance, especially in advanced applications like augmented\nreality (AR). However, their broader adoption has been hindered by bulky\nprojector designs and complex optical module assemblies. Here, we introduce a\nnew laser display architecture enabled by large-scale visible photonic\nintegrated circuits (PICs) to address these challenges. Unlike previous\nprojector-style laser displays, this architecture features an ultra-thin,\nflat-panel form factor, replacing bulky free-space illumination modules with a\nsingle, high-performance photonic chip. Centimeter-scale PIC devices, which\nintegrate thousands of distinct optical components on-chip, are carefully\ntailored to achieve high display uniformity, contrast, and efficiency. We\ndemonstrate a 2 mm-thick flat-panel laser display combining the PIC with a\nliquid-crystal-on-silicon (LCoS) panel, achieving 211% of the color gamut and\nmore than 80% volume reduction compared to traditional LCoS displays. We\nfurther showcase its application in a see-through AR system. Our work\nrepresents a major advancement in the integration of nanophotonics with display\ntechnology, enabling a range of new display concepts, from high-performance\nimmersive displays to slim-panel 3D holography.\n",
  "subjects": [
    "Physics/Optics",
    "Physics/Applied Physics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "rKZrlM7ojosT7EiXoZkNHoXxhs8MIV-kVd8Mq7UXQQk",
  "pdfSize": "3787334"
}