{"id":"2412.07787","title":"Anomaly Detection in California Electricity Price Forecasting: Enhancing\n  Accuracy and Reliability Using Principal Component Analysis","authors":"Joseph Nyangon and Ruth Akintunde","authorsParsed":[["Nyangon","Joseph",""],["Akintunde","Ruth",""]],"versions":[{"version":"v1","created":"Mon, 25 Nov 2024 20:55:25 GMT"}],"updateDate":"2024-12-12","timestamp":1732568125000,"abstract":"  Accurate and reliable electricity price forecasting has significant practical\nimplications for grid management, renewable energy integration, power system\nplanning, and price volatility management. This study focuses on enhancing\nelectricity price forecasting in California's grid, addressing challenges from\ncomplex generation data and heteroskedasticity. Utilizing principal component\nanalysis (PCA), we analyze CAISO's hourly electricity prices and demand from\n2016-2021 to improve day-ahead forecasting accuracy. Initially, we apply\ntraditional outlier analysis with the interquartile range method, followed by\nrobust PCA (RPCA) for more effective outlier elimination. This approach\nimproves data symmetry and reduces skewness. We then construct multiple linear\nregression models using both raw and PCA-transformed features. The model with\ntransformed features, refined through traditional and SAS Sparse Matrix outlier\nremoval methods, shows superior forecasting performance. The SAS Sparse Matrix\nmethod, in particular, significantly enhances model accuracy. Our findings\ndemonstrate that PCA-based methods are key in advancing electricity price\nforecasting, supporting renewable integration and grid management in day-ahead\nmarkets.\n  Keywords: Electricity price forecasting, principal component analysis (PCA),\npower system planning, heteroskedasticity, renewable energy integration.\n","subjects":["Economics/Econometrics","Computer Science/Artificial Intelligence","Computer Science/Emerging Technologies","Computer Science/Machine Learning","Computer Science/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"wyyyDHsTii6sg5IpSL2Z5m3s5Cri2un7LM9jaz-W7qQ","pdfSize":"463640"}