{"id":"2412.09104","title":"In-Dataset Trajectory Return Regularization for Offline Preference-based\n  Reinforcement Learning","authors":"Songjun Tu, Jingbo Sun, Qichao Zhang, Yaocheng Zhang, Jia Liu, Ke\n  Chen, Dongbin Zhao","authorsParsed":[["Tu","Songjun",""],["Sun","Jingbo",""],["Zhang","Qichao",""],["Zhang","Yaocheng",""],["Liu","Jia",""],["Chen","Ke",""],["Zhao","Dongbin",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 09:35:47 GMT"},{"version":"v2","created":"Sat, 21 Dec 2024 07:50:07 GMT"}],"updateDate":"2024-12-24","timestamp":1733996147000,"abstract":"  Offline preference-based reinforcement learning (PbRL) typically operates in\ntwo phases: first, use human preferences to learn a reward model and annotate\nrewards for a reward-free offline dataset; second, learn a policy by optimizing\nthe learned reward via offline RL. However, accurately modeling step-wise\nrewards from trajectory-level preference feedback presents inherent challenges.\nThe reward bias introduced, particularly the overestimation of predicted\nrewards, leads to optimistic trajectory stitching, which undermines the\npessimism mechanism critical to the offline RL phase. To address this\nchallenge, we propose In-Dataset Trajectory Return Regularization (DTR) for\noffline PbRL, which leverages conditional sequence modeling to mitigate the\nrisk of learning inaccurate trajectory stitching under reward bias.\nSpecifically, DTR employs Decision Transformer and TD-Learning to strike a\nbalance between maintaining fidelity to the behavior policy with high\nin-dataset trajectory returns and selecting optimal actions based on high\nreward labels. Additionally, we introduce an ensemble normalization technique\nthat effectively integrates multiple reward models, balancing the tradeoff\nbetween reward differentiation and accuracy. Empirical evaluations on various\nbenchmarks demonstrate the superiority of DTR over other state-of-the-art\nbaselines.\n","subjects":["Computer Science/Artificial Intelligence","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"K6SdO9n8MCZ_mX-oa_9nwl4ovSsdUX7aCIO5s5WbhYE","pdfSize":"2469232"}