{
  "id": "2412.03375",
  "title": "Granular Ball Twin Support Vector Machine with Universum Data",
  "authors": "M. A. Ganaie and Vrushank Ahire",
  "authorsParsed": [
    [
      "Ganaie",
      "M. A.",
      ""
    ],
    [
      "Ahire",
      "Vrushank",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 15:02:28 GMT"
    }
  ],
  "updateDate": "2024-12-05",
  "timestamp": 1733324548000,
  "abstract": "  Classification with support vector machines (SVM) often suffers from limited\nperformance when relying solely on labeled data from target classes and is\nsensitive to noise and outliers. Incorporating prior knowledge from Universum\ndata and more robust data representations can enhance accuracy and efficiency.\nMotivated by these findings, we propose a novel Granular Ball Twin Support\nVector Machine with Universum Data (GBU-TSVM) that extends the TSVM framework\nto leverage both Universum samples and granular ball computing during model\ntraining. Unlike existing TSVM methods, the proposed GBU-TSVM represents data\ninstances as hyper-balls rather than points in the feature space. This\ninnovative approach improves the model's robustness and efficiency,\nparticularly in handling noisy and large datasets. By grouping data points into\ngranular balls, the model achieves superior computational efficiency, increased\nnoise resistance, and enhanced interpretability. Additionally, the inclusion of\nUniversum data, which consists of samples that are not strictly from the target\nclasses, further refines the classification boundaries. This integration\nenriches the model with contextual information, refining classification\nboundaries and boosting overall accuracy. Experimental results on UCI benchmark\ndatasets demonstrate that the GBU-TSVM outperforms existing TSVM models in both\naccuracy and computational efficiency. These findings highlight the potential\nof the GBU-TSVM model in setting a new standard in data representation and\nclassification.\n",
  "subjects": [
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "NE_pJ-tmIuxNiotg-WTGGtg_NCvVc3LW6lqXMzgITh4",
  "pdfSize": "742033"
}