{
  "id": "2412.04949",
  "title": "Preliminary Study on Virtual Reality Framework for Effective Prospective\n  Memory Training: Integration of Visual Imagery and Daily-life Simulations",
  "authors": "Satoshi Fukumori, Kayoko Miura, Ayako Takamori, Sadao Otsuka",
  "authorsParsed": [
    [
      "Fukumori",
      "Satoshi",
      ""
    ],
    [
      "Miura",
      "Kayoko",
      ""
    ],
    [
      "Takamori",
      "Ayako",
      ""
    ],
    [
      "Otsuka",
      "Sadao",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 11:08:34 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733483314000,
  "abstract": "  Prospective memory (PM), defining the currently conceived intention of a\nfuture action, is crucial for daily functioning, particularly in aging\npopulations. This study develops and validates a virtual reality prospective\nmemory training (VR-PMT) system that integrates visual imagery training (VIT)\nand virtual reality training (VRT) to enhance the PM abilities of users. The\nframework is designed to progressively challenge users by simulating real-life\nPM tasks in a controlled VR environment. The VIT component is designed to\nimprove the generation and utilization of visual imagery by users, while the\nVRT component provides PM tasks based on time and event cues within a virtual\nenvironment.The framework was evaluated on ten healthy adults (university\nstudents and elderly participants) over nine weeks. During the initial session,\nthe baseline PM abilities of the participants were assessed using the memory\nfor intentions screening test (MIST). The subsequent sessions alternated\nbetween VIT and VRT with increasing task complexity. The MIST scores were\nsignificantly positively correlated with task achievement, confirming the\nefficacy of the system. Imagery abilities were also strongly correlated with\ntask performance, underscoring the importance of visual imagery in PM\ntraining.Usability and user experiences, evaluated on the Jikaku-sho Shirabe\nquestionnaire and the user experience questionnaire, indicated an overall\npositive user experience but higher fatigue levels in elderly participants.\nThis study demonstrates that the VR--PMT system effectively trains and assesses\nPM abilities by integrating VIT and VRT, supporting its potential for broader\napplications in clinical settings.\n",
  "subjects": [
    "Computer Science/Human-Computer Interaction"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "vulZj4RlUAlShtOJvtR_ley1ksOcV1q-7zowbd95XaM",
  "pdfSize": "3307578"
}