{
  "id": "2412.02491",
  "title": "Facilitating field-free perpendicular magnetization switching with a\n  Berry curvature dipole in a Weyl semimetal",
  "authors": "Dong Li, Xing-Yu Liu, Xing-Guo Ye, Zhen-Cun Pan, Wen-Zheng Xu,\n  Peng-Fei Zhu, An-Qi Wang, Kenji Watanabe, Takashi Taniguchi, Zhi-Min Liao",
  "authorsParsed": [
    [
      "Li",
      "Dong",
      ""
    ],
    [
      "Liu",
      "Xing-Yu",
      ""
    ],
    [
      "Ye",
      "Xing-Guo",
      ""
    ],
    [
      "Pan",
      "Zhen-Cun",
      ""
    ],
    [
      "Xu",
      "Wen-Zheng",
      ""
    ],
    [
      "Zhu",
      "Peng-Fei",
      ""
    ],
    [
      "Wang",
      "An-Qi",
      ""
    ],
    [
      "Watanabe",
      "Kenji",
      ""
    ],
    [
      "Taniguchi",
      "Takashi",
      ""
    ],
    [
      "Liao",
      "Zhi-Min",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 15:01:46 GMT"
    }
  ],
  "updateDate": "2024-12-04",
  "timestamp": 1733238106000,
  "abstract": "  We report the synergy between orbital and spin-orbit torques in WTe2/Fe3GeTe2\nheterostructures characterized by a Berry curvature dipole. By applying a\ncurrent along the a axis in WTe2, we detect an out-of-plane magnetization in\nthe system, which we attribute to nonequilibrium orbital magnetization linked\nto the Berry curvature dipole based on first-principles calculations,\nmanifesting as the orbital Edelstein effect. This effect generates orbital\ntorques that enable field-free perpendicular magnetization switching.\nFurthermore, by applying a relatively small current along the a axis and a\npulsed current along the b axis in WTe2, we demonstrate controllable field-free\nmagnetization switching of the adjacent Fe3GeTe2 layer, independently\nmanipulating the orbital and spin-orbit torques. Our findings not only enhance\nthe understanding of the collaborative dynamics between these torques but also\nsuggest potential applications in magnetoresistive random-access memory.\n",
  "subjects": [
    "Condensed Matter/Mesoscale and Nanoscale Physics",
    "Condensed Matter/Materials Science"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "g9dqmMj3Om97BYMKUOnYhhamt4bcjmSJjDpjAD9S3WQ",
  "pdfSize": "3207234"
}