{
  "id": "2412.02981",
  "title": "New HI views of the Galaxy and the Magellanic Clouds",
  "authors": "Snezana Stanimirovic",
  "authorsParsed": [
    [
      "Stanimirovic",
      "Snezana",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 02:48:45 GMT"
    }
  ],
  "updateDate": "2024-12-05",
  "timestamp": 1733280525000,
  "abstract": "  Atomic hydrogen (HI) is a vital player in the star-formation process in\ngalaxies. It is the raw fuel for making molecules, an important shielding agent\nagainst interstellar radiation, and a buffer that soaks up the energy and\nmomentum of stellar feedback. While for many years detailed studies of the HI\nthermal structure have been possible only in the Milky Way, the SKA pathfinders\nare expanding our view beyond the Solar neighborhood allowing for crucial tests\nof the HI heating and cooling processes under a wide range of physical\nconditions. This overview article highlights a few recent results and\nemphasizes areas where future observations can make large contributions. We\nshow that the cold HI disk of the Milky Way is extended and flared, yet appears\nspatially coupled to the molecular gas. The cold neutral medium (CNM) in the\nMilky Way is colder and more abundant at higher optical extinctions due to more\nintense cooling and shielding. A comparison between the Milky Way, the Small\nMagellanic Cloud, the Large Magellanic Cloud and NGC 6822 shows a good\nagreement with predictions from recent numerical simulations on how the CNM\nfraction depends on metalliciity. The fraction and spatial distribution of the\nthermally unstable HI remain as open questions and observationally have not\nbeen studied beyond the Milky Way. The excitation temperature of the warm\nneutral medium (WNM) is not well understood. Observations suggest higher WNM\ntemperatures than what is seen in numerical simulations. The SKA, once\noperational, will take the HI studies into a new era of dense HI absorption\ngrids for the Milky Way and nearby galaxies, and the ability to study the HI\nthermal structure beyond the Local Group.\n",
  "subjects": [
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "H3gLAVjCn8lAcrQq-klWLG72uBK1uGvEqGH11ngJ1u8",
  "pdfSize": "6898027"
}