{"id":"2412.12029","title":"Epitaxial Strain Tuning of Er3+ in Ferroelectric Thin Films","authors":"Rafaela M. Brinn, Peter Meisenheimer, Medha Dandu, Elyse Barr\\'e,\n  Piush Behera, Archana Raja, Ramamoorthy Ramesh, Paul Stevenson","authorsParsed":[["Brinn","Rafaela M.",""],["Meisenheimer","Peter",""],["Dandu","Medha",""],["Barré","Elyse",""],["Behera","Piush",""],["Raja","Archana",""],["Ramesh","Ramamoorthy",""],["Stevenson","Paul",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 17:55:52 GMT"}],"updateDate":"2024-12-17","timestamp":1734371752000,"abstract":"  Er3+ color centers are promising candidates for quantum science and\ntechnology due to their long electron and nuclear spin coherence times, as well\nas their desirable emission wavelength. By selecting host materials with\nsuitable, controllable properties, we introduce new parameters that can be used\nto tailor the Er3+ emission spectrum. PbTiO3 is a well-studied ferroelectric\nmaterial with known methods of engineering different domain configurations\nthrough epitaxial strain. By distorting the structure of Er3+-doped PbTiO3 thin\nfilms, we can manipulate the crystal fields around the Er3+ dopant. This is\nresolved through changes in the Er3+ resonant fluorescence spectra, tying the\noptical properties of the defect directly to the domain configurations of the\nferroelectic matrix. Additionally, we are able to resolve a second set of peaks\nfor films with in-plane ferroelectric polarization. We hypothesize these\nresults to be due to either the Er3+ substituting different sites of the PbTiO3\ncrystal, differences in charges between the Er3+ dopant and the original\nsubstituent ion, or selection rules. Systematically studying the relationship\nbetween the Er3+ emission and the epitaxial strain of the ferroelectric matrix\nlays the pathway for future optical studies of spin manipulation by altering\nferroelectric order parameters\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics","Physics/Optics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"i_eNdU1X-dK_r6HtUUS07JtgfaV_xuE6dSpx4-lBbQo","pdfSize":"2575407"}