{
  "id": "2412.02406",
  "title": "A Tractable Closed-Form Approximation of the Ergodic Rate in Poisson\n  Cellular Networks",
  "authors": "Alexis I. Aravanis, Thanh Tu Lam, Olga Mu\\~noz, Antonio\n  Pascual-Iserte, Marco Di Renzo",
  "authorsParsed": [
    [
      "Aravanis",
      "Alexis I.",
      ""
    ],
    [
      "Lam",
      "Thanh Tu",
      ""
    ],
    [
      "Muñoz",
      "Olga",
      ""
    ],
    [
      "Pascual-Iserte",
      "Antonio",
      ""
    ],
    [
      "Di Renzo",
      "Marco",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 11:55:38 GMT"
    }
  ],
  "updateDate": "2024-12-04",
  "timestamp": 1733226938000,
  "abstract": "  The employment of stochastic geometry for the analysis and design of ultra\ndense networks (UDNs) has provided significant insights into network\ndensification. In addition to the characterization of the network performance\nand behavior, these tools can also be exploited toward solving complex\noptimization problems that could maximize the capacity benefits arising in\nUDNs. However, this is preconditioned on the existence of tractable closed form\nexpressions for the considered figures of merit. In this course, the present\npaper introduces an accurate approximation for the moment generating function\n(MGF) of the aggregate other-cell interference created by base stations whose\npositions follow a Poisson point process of given spatial density. Given the\npivotal role of the MGF of the aggregate interference in stochastic geometry\nand the tractability of the derived MGF, the latter can be employed to\nsubstantially simplify ensuing stochastic geometry analyses. Subsequently, the\npresent paper employs the introduced MGF to provide closed form expressions for\nthe downlink ergodic capacity for the interference limited case, and validates\nthe accuracy of these expressions by the use of extensive Monte Carlo\nsimulations. The derived expressions depend on the density of users and base\nstations, setting out a densification road map for network operators and\ndesigners of significant value.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Signal Processing"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "9l7DfpDtpGm9k8GJbtmEWWDvQnNE49b2juDYB50d2DU",
  "pdfSize": "1353084"
}