{
  "id": "2412.03424",
  "title": "Tango*: Constrained synthesis planning using chemically informed value\n  functions",
  "authors": "Daniel Armstrong, Zlatko Joncev, Jeff Guo, Philippe Schwaller",
  "authorsParsed": [
    [
      "Armstrong",
      "Daniel",
      ""
    ],
    [
      "Joncev",
      "Zlatko",
      ""
    ],
    [
      "Guo",
      "Jeff",
      ""
    ],
    [
      "Schwaller",
      "Philippe",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 16:14:02 GMT"
    }
  ],
  "updateDate": "2024-12-05",
  "timestamp": 1733328842000,
  "abstract": "  Computer-aided synthesis planning (CASP) has made significant strides in\ngenerating retrosynthetic pathways for simple molecules in a non-constrained\nfashion. Recent work introduces a specialised bidirectional search algorithm\nwith forward and retro expansion to address the starting material-constrained\nsynthesis problem, allowing CASP systems to provide synthesis pathways from\nspecified starting materials, such as waste products or renewable feed-stocks.\nIn this work, we introduce a simple guided search which allows solving the\nstarting material-constrained synthesis planning problem using an existing,\nuni-directional search algorithm, Retro*. We show that by optimising a single\nhyperparameter, Tango* outperforms existing methods in terms of efficiency and\nsolve rate. We find the Tango* cost function catalyses strong improvements for\nthe bidirectional DESP methods. Our method also achieves lower wall clock times\nwhile proposing synthetic routes of similar length, a common metric for route\nquality. Finally, we highlight potential reasons for the strong performance of\nTango over neural guided search methods\n",
  "subjects": [
    "Computer Science/Computational Engineering, Finance, and Science",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "3IT5MUvqUa0Ytsjm-lu_e7wAMgHmxElciS-3CgIi9vA",
  "pdfSize": "892794"
}