{
  "id": "2412.10031",
  "title": "FM2S: Self-Supervised Fluorescence Microscopy Denoising With Single\n  Noisy Image",
  "authors": "Jizhihui Liu, Qixun Teng, Junjun Jiang",
  "authorsParsed": [
    [
      "Liu",
      "Jizhihui",
      ""
    ],
    [
      "Teng",
      "Qixun",
      ""
    ],
    [
      "Jiang",
      "Junjun",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 10:45:25 GMT"
    }
  ],
  "updateDate": "2024-12-16",
  "timestamp": 1734086725000,
  "abstract": "  Fluorescence microscopy has significantly advanced biological research by\nvisualizing detailed cellular structures and biological processes. However,\nsuch image denoising task often faces challenges due to difficulty in precisely\nmodeling the inherent noise and acquiring clean images for training, which\nconstrains most existing methods. In this paper, we propose an efficient\nself-supervised denoiser Fluorescence Micrograph to Self (FM2S), enabling a\nhigh-quality denoised result with a single noisy image. Our method introduces\nan adaptive global-local Noise Addition module for data augmentation,\naddressing generalization problems caused by discrepancies between synthetic\nand real-world noise. We then train a two-layer neural network to learn the\nmapping from the noise-added image to the filtered image, achieving a balance\nbetween noise removal and computational efficiency. Experimental results\ndemonstrate that FM2S excels in various microscope types and noise levels in\nterms of denoising effects and time consumption, obtaining an average PSNR\nimprovement of around 6 dB over the original noisy image in a few seconds. The\ncode is available at https://github.com/Danielement321/FM2S.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Image and Video Processing",
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "75XoP0kr5Zh-egxiqxM2c51d2iUUplcTrGsNa6aGJnw",
  "pdfSize": "11047783"
}