{"id":"2412.13314","title":"Distributed Speculative Execution for Resilient Cloud Applications","authors":"Tianyu Li and Badrish Chandramouli and Philip A. Bernstein and Samuel\n  Madden","authorsParsed":[["Li","Tianyu",""],["Chandramouli","Badrish",""],["Bernstein","Philip A.",""],["Madden","Samuel",""]],"versions":[{"version":"v1","created":"Tue, 17 Dec 2024 20:30:47 GMT"}],"updateDate":"2024-12-19","timestamp":1734467447000,"abstract":"  Fault-tolerance is critically important in highly-distributed modern cloud\napplications. Solutions such as Temporal, Azure Durable Functions, and Beldi\nhide fault-tolerance complexity from developers by persisting execution state\nand resuming seamlessly from persisted state after failure. This pattern, often\ncalled durable execution, usually forces frequent and synchronous persistence\nand results in hefty latency overheads. In this paper, we propose distributed\nspeculative execution (DSE), a technique for implementing the durable execution\nabstraction without incurring this penalty. With DSE, developers write code\nassuming synchronous persistence, and a DSE runtime is responsible for\ntransparently bypassing persistence and reactively repairing application state\non failure. We present libDSE, the first DSE application framework that\nachieves this vision. The key tension in designing libDSE is between imposing\nrestrictions on user programs so the framework can safely and transparently\nchange execution behavior, and avoiding assumptions so libDSE can support more\nuse cases. We address this with a novel programming model centered around\nmessage-passing, atomic code blocks, and lightweight threads, and show that it\nallows developers to build a variety of speculative services, including\nwrite-ahead logs, key-value stores, event brokers, and fault-tolerant\nworkflows. Our evaluation shows that libDSE reduces end-to-end latency by up to\nan order of magnitude compared to current generations of durable execution\nsystems with minimal run-time overhead and manageable complexity.\n","subjects":["Computer Science/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"SURR3DA-GuDm4VntGO-jK6ULXP1u7Ld7Ow3sydDUo7I","pdfSize":"934040"}