{"id":"2412.06412","title":"StarWhisper Telescope: Agent-Based Observation Assistant System to\n  Approach AI Astrophysicist","authors":"Cunshi Wang, Xinjie Hu, Yu Zhang, Xunhao Chen, Pengliang Du, Yiming\n  Mao, Rui Wang, Yuyang Li, Ying Wu, Hang Yang, Yansong Li, Beichuan Wang,\n  Haiyang Mu, Zheng Wang, Jianfeng Tian, Liang Ge, Yongna Mao, Shengming Li,\n  Xiaomeng Lu, Jinhang Zou, Yang Huang, Ningchen Sun, Jie Zheng, Min He, Yu\n  Bai, Junjie Jin, Hong Wu, Chaohui Shang, Jifeng Liu","authorsParsed":[["Wang","Cunshi",""],["Hu","Xinjie",""],["Zhang","Yu",""],["Chen","Xunhao",""],["Du","Pengliang",""],["Mao","Yiming",""],["Wang","Rui",""],["Li","Yuyang",""],["Wu","Ying",""],["Yang","Hang",""],["Li","Yansong",""],["Wang","Beichuan",""],["Mu","Haiyang",""],["Wang","Zheng",""],["Tian","Jianfeng",""],["Ge","Liang",""],["Mao","Yongna",""],["Li","Shengming",""],["Lu","Xiaomeng",""],["Zou","Jinhang",""],["Huang","Yang",""],["Sun","Ningchen",""],["Zheng","Jie",""],["He","Min",""],["Bai","Yu",""],["Jin","Junjie",""],["Wu","Hong",""],["Shang","Chaohui",""],["Liu","Jifeng",""]],"versions":[{"version":"v1","created":"Mon, 9 Dec 2024 11:40:06 GMT"}],"updateDate":"2024-12-10","timestamp":1733744406000,"abstract":"  With the rapid advancements in Large Language Models (LLMs), LLM-based agents\nhave introduced convenient and user-friendly methods for leveraging tools\nacross various domains. In the field of astronomical observation, the\nconstruction of new telescopes has significantly increased astronomers'\nworkload. Deploying LLM-powered agents can effectively alleviate this burden\nand reduce the costs associated with training personnel. Within the Nearby\nGalaxy Supernovae Survey (NGSS) project, which encompasses eight telescopes\nacross three observation sites, aiming to find the transients from the galaxies\nin 50 mpc, we have developed the \\textbf{StarWhisper Telescope System} to\nmanage the entire observation process. This system automates tasks such as\ngenerating observation lists, conducting observations, analyzing data, and\nproviding feedback to the observer. Observation lists are customized for\ndifferent sites and strategies to ensure comprehensive coverage of celestial\nobjects. After manual verification, these lists are uploaded to the telescopes\nvia the agents in the system, which initiates observations upon neutral\nlanguage. The observed images are analyzed in real-time, and the transients are\npromptly communicated to the observer. The agent modifies them into a real-time\nfollow-up observation proposal and send to the Xinglong observatory group chat,\nthen add them to the next-day observation lists. Additionally, the integration\nof AI agents within the system provides online accessibility, saving\nastronomers' time and encouraging greater participation from amateur\nastronomers in the NGSS project.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Computer Science/Artificial Intelligence","Computer Science/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"4ShuXhfezXAXgS2rnOMExAujd2JlGvGntp_S6wpeIgY","pdfSize":"2029171"}