{"id":"2412.02505","title":"The ALPINE-ALMA [CII] Survey: Unveiling the baryon evolution in the ISM\n  of $z\\sim5$ star-forming galaxies","authors":"P. Sawant, A. Nanni, M. Romano, D. Donevski, G. Bruzual, N. Ysard, B.\n  C. Lemaux, H. Inami, F. Calura, F. Pozzi, K. Ma{\\l}ek, Junais, M. Boquien, A.\n  L. Faisst, M. Hamed, M. Ginolfi, G. Zamorani, G. Lorenzon, J. Molina, S.\n  Bardelli, E. Ibar, D. Vergani, C. Di Cesare, M. B\\'ethermin, D. Burgarella,\n  P. Cassata, M. Dessauges-Zavadsky, E. D'Onghia, Y. Dubois, G. E. Magdis, H.\n  Mendez-Hernandez","authorsParsed":[["Sawant","P.",""],["Nanni","A.",""],["Romano","M.",""],["Donevski","D.",""],["Bruzual","G.",""],["Ysard","N.",""],["Lemaux","B. C.",""],["Inami","H.",""],["Calura","F.",""],["Pozzi","F.",""],["Małek","K.",""],["Junais","",""],["Boquien","M.",""],["Faisst","A. L.",""],["Hamed","M.",""],["Ginolfi","M.",""],["Zamorani","G.",""],["Lorenzon","G.",""],["Molina","J.",""],["Bardelli","S.",""],["Ibar","E.",""],["Vergani","D.",""],["Di Cesare","C.",""],["Béthermin","M.",""],["Burgarella","D.",""],["Cassata","P.",""],["Dessauges-Zavadsky","M.",""],["D'Onghia","E.",""],["Dubois","Y.",""],["Magdis","G. E.",""],["Mendez-Hernandez","H.",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 15:32:03 GMT"}],"updateDate":"2025-02-05","timestamp":1733239923000,"abstract":"  Recent observations reveal a rapid dust build-up in high-redshift galaxies (z\n> 4), challenging current models of galaxy formation. While our understanding\nof dust production and destruction in the interstellar medium (ISM) is\nadvancing, probing baryonic processes in the early Universe remains a complex\ntask. We characterize the evolution of 98 z~5 star-forming galaxies observed as\npart of the ALPINE survey by constraining the physical processes underpinning\nthe gas and dust production, consumption, and destruction in their ISM. We make\nuse of chemical evolution models to simultaneously reproduce the observed dust\nand gas content. For each galaxy, we estimate initial gas mass, inflows and\noutflows, and efficiencies of dust growth and destruction. We test the models\nwith the canonical Chabrier and top-heavy initial mass functions (IMFs), with\nthe latter enabling rapid dust production on shorter timescales. Our models\nsuccessfully reproduce gas and dust content in older galaxies (> 600 Myr)\nregardless of the IMF, with Type II SNe as the primary dust source and no dust\ngrowth in ISM with moderate inflow of primordial gas. In case of\nintermediate-age galaxies (300 - 600 Myr), we reproduce the gas and dust\ncontent through Type II SNe and dust growth in ISM, though we observe an\nover-prediction of dust mass in older galaxies, potentially indicating an\nunaccounted dust destruction mechanism and/or an overestimation of the observed\ndust masses. The number of young galaxies (< 300 Myr) reproduced, increases for\nmodels assuming top-heavy IMF but with maximal prescriptions of dust\nproduction. Galactic outflows are necessary to reproduce observed gas and dust\nmasses. The Chabrier IMF models reproduce 65% of galaxies, while top-heavy IMF\nmodels improve this to 93%, easing tensions with observations. Upcoming JWST\ndata will refine these models by resolving degeneracies in intrinsic galaxy\nproperties.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"3uWl8d5Kg661ef7ahiYigoN9LxaJ8VkVlE0R8uXPafw","pdfSize":"7564227"}