{"id":"2412.00751","title":"Rethinking Cognition: Morphological Info-Computation and the Embodied\n  Paradigm in Life and Artificial Intelligence","authors":"Gordana Dodig-Crnkovic","authorsParsed":[["Dodig-Crnkovic","Gordana",""]],"versions":[{"version":"v1","created":"Sun, 1 Dec 2024 10:04:53 GMT"}],"updateDate":"2024-12-03","timestamp":1733047493000,"abstract":"  This study aims to place Lorenzo Magnanis Eco-Cognitive Computationalism\nwithin the broader context of current work on information, computation, and\ncognition. Traditionally, cognition was believed to be exclusive to humans and\na result of brain activity. However, recent studies reveal it as a fundamental\ncharacteristic of all life forms, ranging from single cells to complex\nmulticellular organisms and their networks. Yet, the literature and general\nunderstanding of cognition still largely remain human-brain-focused, leading to\nconceptual gaps and incoherency. This paper presents a variety of computational\n(information processing) approaches, including an info-computational approach\nto cognition, where natural structures represent information and dynamical\nprocesses on natural structures are regarded as computation, relative to an\nobserving cognizing agent. We model cognition as a web of concurrent\nmorphological computations, driven by processes of self-assembly,\nself-organisation, and autopoiesis across physical, chemical, and biological\ndomains. We examine recent findings linking morphological computation,\nmorphogenesis, agency, basal cognition, extended evolutionary synthesis, and\nactive inference. We establish a connection to Magnanis Eco-Cognitive\nComputationalism and the idea of computational domestication of ignorant\nentities. Novel theoretical and applied insights question the boundaries of\nconventional computational models of cognition. The traditional models\nprioritize symbolic processing and often neglect the inherent constraints and\npotentialities in the physical embodiment of agents on different levels of\norganization. Gaining a better info-computational grasp of cognitive embodiment\nis crucial for the advancement of fields such as biology, evolutionary studies,\nartificial intelligence, robotics, medicine, and more.\n","subjects":["Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"2GJ9rUrn6QudEFRdhfBx-KPtVeHH791A1x-mklWkhjk","pdfSize":"460682"}