{"id":"2412.04597","title":"New Ultracool Companions to Nearby White Dwarfs","authors":"Alexia Bravo, Adam C. Schneider, Sarah Casewell, Austin Rothermich,\n  Jacqueline K. Faherty, Jenni R. French, Thomas P. Bickle, Aaron M. Meisner,\n  J. Davy Kirkpatrick, Marc J. Kuchner, Adam J. Burgasser, Federico Marocco,\n  John H. Debes, Arttu Sainio, L\\'eopold Gramaize, Frank Kiwy, Peter A.\n  Jalowiczor, and Awab Abdullahi","authorsParsed":[["Bravo","Alexia",""],["Schneider","Adam C.",""],["Casewell","Sarah",""],["Rothermich","Austin",""],["Faherty","Jacqueline K.",""],["French","Jenni R.",""],["Bickle","Thomas P.",""],["Meisner","Aaron M.",""],["Kirkpatrick","J. Davy",""],["Kuchner","Marc J.",""],["Burgasser","Adam J.",""],["Marocco","Federico",""],["Debes","John H.",""],["Sainio","Arttu",""],["Gramaize","Léopold",""],["Kiwy","Frank",""],["Jalowiczor","Peter A.",""],["Abdullahi","Awab",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 20:23:14 GMT"}],"updateDate":"2024-12-09","timestamp":1733430194000,"abstract":"  We conducted a search for new ultracool companions to nearby white dwarfs\nusing multiple methods, including the analysis of colors and examination of\nimages in both the optical and the infrared. Through this process, we\nidentified fifty-one previously unrecognized systems with candidate ultracool\ncompanions. Thirty-one of these systems are resolved in at least one catalog,\nand all but six are confirmed as co-moving companions via common proper motion\nand consistent parallax measurements (when available). We have followed up four\nco-moving companions with near-infrared spectroscopy and confirm their\nultracool nature. The remaining twenty candidates are unresolved, but show\nclear signs of infrared excess which is most likely due to the presence of a\ncold, low-mass companion or a dusty circumstellar disk. Three of these\nunresolved systems have existing optical spectra that clearly show the presence\nof a cool stellar companion to the white dwarf primary via spectral\ndecomposition. These new discoveries, along with our age estimates for the\nprimary white dwarfs, will serve as valuable benchmark systems for future\ncharacterization of ultracool dwarfs.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ltX5C0FMtPOHWbnunU4OAJQ4AcmjZ2orueNRXd41Y8Q","pdfSize":"7732702"}