{"id":"2412.16847","title":"Fatigue Monitoring Using Wearables and AI: Trends, Challenges, and\n  Future Opportunities","authors":"Kourosh Kakhi, Senthil Kumar Jagatheesaperumal, Abbas Khosravi,\n  Roohallah Alizadehsani, U Rajendra Acharya","authorsParsed":[["Kakhi","Kourosh",""],["Jagatheesaperumal","Senthil Kumar",""],["Khosravi","Abbas",""],["Alizadehsani","Roohallah",""],["Acharya","U Rajendra",""]],"versions":[{"version":"v1","created":"Sun, 22 Dec 2024 04:04:07 GMT"}],"updateDate":"2024-12-24","timestamp":1734840247000,"abstract":"  Monitoring fatigue is essential for improving safety, particularly for people\nwho work long shifts or in high-demand workplaces. The development of wearable\ntechnologies, such as fitness trackers and smartwatches, has made it possible\nto continuously analyze physiological signals in real-time to determine a\nperson level of exhaustion. This has allowed for timely insights into\npreventing hazards associated with fatigue. This review focuses on wearable\ntechnology and artificial intelligence (AI) integration for tiredness\ndetection, adhering to the PRISMA principles. Studies that used signal\nprocessing methods to extract pertinent aspects from physiological data, such\nas ECG, EMG, and EEG, among others, were analyzed as part of the systematic\nreview process. Then, to find patterns of weariness and indicators of impending\nfatigue, these features were examined using machine learning and deep learning\nmodels. It was demonstrated that wearable technology and cutting-edge AI\nmethods could accurately identify weariness through multi-modal data analysis.\nBy merging data from several sources, information fusion techniques enhanced\nthe precision and dependability of fatigue evaluation. Significant developments\nin AI-driven signal analysis were noted in the assessment, which should improve\nreal-time fatigue monitoring while requiring less interference. Wearable\nsolutions powered by AI and multi-source data fusion present a strong option\nfor real-time tiredness monitoring in the workplace and other crucial\nenvironments. These developments open the door for more improvements in this\nfield and offer useful tools for enhancing safety and reducing fatigue-related\nhazards.\n","subjects":["Computer Science/Human-Computer Interaction","Computer Science/Emerging Technologies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"t0sZj3fgfBTF82o74T60guEQx_-LbJN0wo3ZMlXJHmY","pdfSize":"1785214"}