{
  "id": "2412.06472",
  "title": "Food for thought: How can machine learning help better predict and\n  understand changes in food prices?",
  "authors": "Kristina L. Kupferschmidt, James Requiema, Mya Simpson, Zohrah\n  Varsallay, Ethan Jackson, Cody Kupferschmidt, Sara El-Shawa, Graham W. Taylor",
  "authorsParsed": [
    [
      "Kupferschmidt",
      "Kristina L.",
      ""
    ],
    [
      "Requiema",
      "James",
      ""
    ],
    [
      "Simpson",
      "Mya",
      ""
    ],
    [
      "Varsallay",
      "Zohrah",
      ""
    ],
    [
      "Jackson",
      "Ethan",
      ""
    ],
    [
      "Kupferschmidt",
      "Cody",
      ""
    ],
    [
      "El-Shawa",
      "Sara",
      ""
    ],
    [
      "Taylor",
      "Graham W.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 13:17:28 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733750248000,
  "abstract": "  In this work, we address a lack of systematic understanding of fluctuations\nin food affordability in Canada. Canada's Food Price Report (CPFR) is an annual\npublication that predicts food inflation over the next calendar year. The\npublished predictions are a collaborative effort between forecasting teams that\neach employ their own approach at Canadian Universities: Dalhousie University,\nthe University of British Columbia, the University of Saskatchewan, and the\nUniversity of Guelph/Vector Institute. While the University of Guelph/Vector\nInstitute forecasting team has leveraged machine learning (ML) in previous\nreports, the most recent editions (2024--2025) have also included a\nhuman-in-the-loop approach. For the 2025 report, this focus was expanded to\nevaluate several different data-centric approaches to improve forecast\naccuracy. In this study, we evaluate how different types of forecasting models\nperform when estimating food price fluctuations. We also examine the\nsensitivity of models that curate time series data representing key factors in\nfood pricing.\n",
  "subjects": [
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "SmYJqw9Ll7FrjndZ_NErw0vD9DbfxKuMU7XX4FfT9cY",
  "pdfSize": "1377024"
}