{"id":"2412.18297","title":"Learning to Play Against Unknown Opponents","authors":"Eshwar Ram Arunachaleswaran, Natalie Collina, Jon Schneider","authorsParsed":[["Arunachaleswaran","Eshwar Ram",""],["Collina","Natalie",""],["Schneider","Jon",""]],"versions":[{"version":"v1","created":"Tue, 24 Dec 2024 09:05:06 GMT"},{"version":"v2","created":"Thu, 20 Feb 2025 07:17:45 GMT"}],"updateDate":"2025-02-21","timestamp":1735031106000,"abstract":"  We consider the problem of a learning agent who has to repeatedly play a\ngeneral sum game against a strategic opponent who acts to maximize their own\npayoff by optimally responding against the learner's algorithm. The learning\nagent knows their own payoff function, but is uncertain about the payoff of\ntheir opponent (knowing only that it is drawn from some distribution\n$\\mathcal{D}$). What learning algorithm should the agent run in order to\nmaximize their own total utility, either in expectation or in the worst-case\nover $\\mathcal{D}$?\n  When the learning algorithm is constrained to be a no-regret algorithm, we\ndemonstrate how to efficiently construct an optimal learning algorithm\n(asymptotically achieving the optimal utility) in polynomial time for both the\nin-expectation and worst-case problems, independent of any other assumptions.\nWhen the learning algorithm is not constrained to no-regret, we show how to\nconstruct an $\\varepsilon$-optimal learning algorithm (obtaining average\nutility within $\\varepsilon$ of the optimal utility) for both the\nin-expectation and worst-case problems in time polynomial in the size of the\ninput and $1/\\varepsilon$, when either the size of the game or the support of\n$\\mathcal{D}$ is constant. Finally, for the special case of the maximin\nobjective, where the learner wishes to maximize their minimum payoff over all\npossible optimizer types, we construct a learner algorithm that runs in\npolynomial time in each step and guarantees convergence to the optimal learner\npayoff. All of these results make use of recently developed machinery that\nconverts the analysis of learning algorithms to the study of the class of\ncorresponding geometric objects known as menus.\n","subjects":["Computer Science/Computer Science and Game Theory","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"6lNaDSBWa3nuOt2e5biThgKievJBgm5516_EUVCUnMY","pdfSize":"333027"}