{
  "id": "2412.02201",
  "title": "A New Statistical Model for Waveguide Invariant-Based Range Estimation\n  in Shallow Water",
  "authors": "Junsu Jang and Florian Meyer",
  "authorsParsed": [
    [
      "Jang",
      "Junsu",
      ""
    ],
    [
      "Meyer",
      "Florian",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 06:30:07 GMT"
    },
    {
      "version": "v2",
      "created": "Mon, 16 Dec 2024 02:09:54 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1733207407000,
  "abstract": "  Navigation and source localization in the undersea environment are challenged\nby the absence of a ubiquitous positioning system. Passive acoustic ranging\noffers a valuable means of obtaining location information underwater. We\npresent a range estimation method based on waveguide invariant (WI) theory,\nusing ship noise recorded by a hydrophone as an acoustic source. The WI is a\nscalar parameter that describes the interference patterns in spectrograms\ncaused by the interaction of acoustic wave modes propagating in a waveguide,\nsuch as shallow water. WI theory enables ranging using a single receiver\nwithout detailed knowledge of the environment. In this paper, underwater\nacoustic signals radiated by a moving large ship, which include broadband and\ntonal components, are employed for WI-based ranging in a range-independent\nshallow water environment. In particular, we develop a likelihood function for\nWI-based range estimation by introducing a statistical model for high\nsignal-to-noise ratio scenarios. Here, the broadband component is assumed to\ndominate the background noise. The effectiveness of the proposed range\nestimation method is demonstrated using real acoustic measurements of a moving\ncontainer ship recorded during the Seabed Characterization Experiment 2017\n(SBCEX17).\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Signal Processing"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "mZvmiGgVVx68rVg0L_ZfLvCpFzF7YSB6oF7HAipKRtc",
  "pdfSize": "774896"
}