{"id":"2412.14883","title":"Non-perturbative exciton transfer rate analysis of the\n  Fenna-Matthews-Olson photosynthetic complex under reduced and oxidised\n  conditions","authors":"Hallmann \\'O. Gestsson, Charlie Nation, Jacob S. Higgins, Gregory S.\n  Engel, and Alexandra Olaya-Castro","authorsParsed":[["Gestsson","Hallmann Ó.",""],["Nation","Charlie",""],["Higgins","Jacob S.",""],["Engel","Gregory S.",""],["Olaya-Castro","Alexandra",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 16:19:19 GMT"}],"updateDate":"2024-12-20","timestamp":1734538759000,"abstract":"  Two-dimensional optical spectroscopy experiments have shown that exciton\ntransfer pathways in the Fenna-Matthews-Olson (FMO) photosynthetic complex\ndiffer drastically under reduced and oxidised conditions, suggesting a\nfunctional role for collective vibronic mechanisms that may be active in the\nreduced form but attenuated in the oxidised state. Higgins et al. [PNAS 118\n(11) e2018240118 (2021)] used Redfield theory to link the experimental\nobservations to altered exciton transfer rates due to oxidative onsite energy\nshifts that detune excitonic energy gaps from a specific vibrational frequency\nof the bacteriochlorophyll (BChl) a. Using a memory kernel formulation of the\nhierarchical equations of motion, we present non-perturbative estimations of\ntransfer rates that yield a modified physical picture. Our findings indicate\nthat onsite energy shifts alone cannot reproduce the observed rate changes in\noxidative environments, either qualitatively or quantitatively. By\nsystematically examining combined changes both in site energies and the local\nenvironment for the oxidised complex, while maintaining consistency with\nabsorption spectra, our results suggest that vibronic tuning of transfer rates\nmay indeed be active in the reduced complex. However, we achieve qualitative,\nbut not quantitative, agreement with the experimentally measured rates. Our\nanalysis indicates potential limitations of the FMO electronic Hamiltonian,\nwhich was originally derived by fitting spectra to second-order cumulant and\nRedfield theories. This suggests that reassessment of these electronic\nparameters with a non-perturbative scheme, or derived from first principles, is\nessential for a consistent and accurate understanding of exciton dynamics in\nFMO under varying redox conditions.\n","subjects":["Physics/Chemical Physics","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"IJ4zFS62OsRGrdzR50vhrm5EolA7T310mQ7NHaZB7NA","pdfSize":"2917007"}