{"id":"2412.14326","title":"Covariances for Free: Exploiting Mean Distributions for Federated\n  Learning with Pre-Trained Models","authors":"Dipam Goswami, Simone Magistri, Kai Wang, Bart{\\l}omiej Twardowski,\n  Andrew D. Bagdanov, Joost van de Weijer","authorsParsed":[["Goswami","Dipam",""],["Magistri","Simone",""],["Wang","Kai",""],["Twardowski","Bartłomiej",""],["Bagdanov","Andrew D.",""],["van de Weijer","Joost",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 20:40:14 GMT"},{"version":"v2","created":"Tue, 4 Feb 2025 15:11:28 GMT"}],"updateDate":"2025-02-05","timestamp":1734554414000,"abstract":"  Using pre-trained models has been found to reduce the effect of data\nheterogeneity and speed up federated learning algorithms. Recent works have\ninvestigated the use of first-order statistics and second-order statistics to\naggregate local client data distributions at the server and achieve very high\nperformance without any training. In this work we propose a training-free\nmethod based on an unbiased estimator of class covariance matrices. Our method,\nwhich only uses first-order statistics in the form of class means communicated\nby clients to the server, incurs only a fraction of the communication costs\nrequired by methods based on communicating second-order statistics. We show how\nthese estimated class covariances can be used to initialize a linear\nclassifier, thus exploiting the covariances without actually sharing them. When\ncompared to state-of-the-art methods which also share only class means, our\napproach improves performance in the range of 4-26\\% with exactly the same\ncommunication cost. Moreover, our method achieves performance competitive or\nsuperior to sharing second-order statistics with dramatically less\ncommunication overhead. Finally, using our method to initialize classifiers and\nthen performing federated fine-tuning yields better and faster convergence.\nCode is available at https://github.com/dipamgoswami/FedCOF.\n","subjects":["Computer Science/Machine Learning","Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"RsYXFU54b8Gy-0VcmJWIIrKyAGHMWT6DnvFoUygt-8k","pdfSize":"1511790"}