{"id":"2412.11125","title":"Feature engineering vs. deep learning for paper section identification:\n  Toward applications in Chinese medical literature","authors":"Sijia Zhou, Xin Li","authorsParsed":[["Zhou","Sijia",""],["Li","Xin",""]],"versions":[{"version":"v1","created":"Sun, 15 Dec 2024 09:11:14 GMT"}],"updateDate":"2024-12-17","timestamp":1734253874000,"abstract":"  Section identification is an important task for library science, especially\nknowledge management. Identifying the sections of a paper would help filter\nnoise in entity and relation extraction. In this research, we studied the paper\nsection identification problem in the context of Chinese medical literature\nanalysis, where the subjects, methods, and results are more valuable from a\nphysician's perspective. Based on previous studies on English literature\nsection identification, we experiment with the effective features to use with\nclassic machine learning algorithms to tackle the problem. It is found that\nConditional Random Fields, which consider sentence interdependency, is more\neffective in combining different feature sets, such as bag-of-words,\npart-of-speech, and headings, for Chinese literature section identification.\nMoreover, we find that classic machine learning algorithms are more effective\nthan generic deep learning models for this problem. Based on these\nobservations, we design a novel deep learning model, the Structural\nBidirectional Long Short-Term Memory (SLSTM) model, which models word and\nsentence interdependency together with the contextual information. Experiments\non a human-curated asthma literature dataset show that our approach outperforms\nthe traditional machine learning methods and other deep learning methods and\nachieves close to 90% precision and recall in the task. The model shows good\npotential for use in other text mining tasks. The research has significant\nmethodological and practical implications.\n","subjects":["Computer Science/Computation and Language","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"wDgrbPIzzxWad6petL460bf59eDP3RRCXP9BtXSGCAI","pdfSize":"2290484"}