{"id":"2412.05141","title":"Using data collected from structured light plethysmography to\n  differentiate breathing pattern disorder from normal breathing: A study group\n  report","authors":"Bindi S. Brook, Mathew Bulpett, Robin Curnow, Emily Fraser, Eric J.\n  Hall, Shiting Huang, Mariam Mubarak, Carl A. Whitfield","authorsParsed":[["Brook","Bindi S.",""],["Bulpett","Mathew",""],["Curnow","Robin",""],["Fraser","Emily",""],["Hall","Eric J.",""],["Huang","Shiting",""],["Mubarak","Mariam",""],["Whitfield","Carl A.",""]],"versions":[{"version":"v1","created":"Fri, 6 Dec 2024 15:58:31 GMT"}],"updateDate":"2024-12-09","timestamp":1733500711000,"abstract":"  This report relates to a study group hosted by the EPSRC funded network,\nIntegrating data-driven BIOphysical models into REspiratory MEdicine (BIOREME),\nand supported by SofTMech and Innovate UK, Business Connect. This report\nsummarises the work undertaken on a challenge presented by two of the authors,\nMathew Bulpett and Dr Emily Fraser. The aim was to identify approaches to\nanalyse data collected using structured light plethysmography (SLP) from (n=31)\nhealthy volunteers and (n=67) patients with Breathing Pattern Disorder (BPD)\nattributed to \"long COVID\", i.e. post-acute COVID-19 sequelae. This report\nexplores several approaches including dimensionality reduction techniques on\nthe available data and alternative indices extracted from variation in the\ntime-series data for each measurement. Further proposals are also outlined such\nas different spatial indices that could be extracted from the SLP data, and the\npotential to couple to mechanical models of the lungs, chest and abdomen.\nHowever, running these latter analyses was beyond the scope of the limited\nstudy group timeframe.\n  This exploratory analysis did not identify any clear SLP biomarkers of BPD in\nthese cohorts, however recommendations are made for using SLP technologies in\nfuture BPD studies based on its findings.\n","subjects":["Physics/Medical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"G-i1VoWR31RG9uovPtHmbWfJMHLK4uUgDFmv-8KaVyc","pdfSize":"5588303"}