{"id":"2412.00504","title":"Quantum Active Learning for Structural Determination of Doped\n  Nanoparticles -- a Case Study of 4Al@Si$_{11}$","authors":"Maicon Pierre Louren\\c{c}o, Mosayeb Naseri, Lizandra Barrios Herrera,\n  Hadi Zadeh-Haghighi, Daya Gaur, Christoph Simon and Dennis R. Salahub","authorsParsed":[["Lourenço","Maicon Pierre",""],["Naseri","Mosayeb",""],["Herrera","Lizandra Barrios",""],["Zadeh-Haghighi","Hadi",""],["Gaur","Daya",""],["Simon","Christoph",""],["Salahub","Dennis R.",""]],"versions":[{"version":"v1","created":"Sat, 30 Nov 2024 15:03:51 GMT"}],"updateDate":"2024-12-03","timestamp":1732979031000,"abstract":"  Active learning (AL) has been widely applied in chemistry and materials\nscience. In this work we propose a quantum active learning (QAL) method for\nautomatic structural determination of doped nanoparticles, where quantum\nmachine learning (QML) models for regression are used iteratively to indicate\nnew structures to be calculated by DFT or DFTB and this new data acquisition is\nused to retrain the QML models. The QAL method is implemented in the Quantum\nMachine Learning Software/Agent for Material Design and Discovery\n(QMLMaterial), whose aim is using an artificial agent (defined by QML\nregression algorithms) that chooses the next doped configuration to be\ncalculated that has a higher probability of finding the optimum structure. The\nQAL uses a quantum Gaussian process with a fidelity quantum kernel as well as\nthe projected quantum kernel and different quantum circuits. For comparison,\nclassical AL was used with a classical Gaussian process with different\nclassical kernels. The presented QAL method was applied in the structural\ndetermination of doped Si$_{11}$ with 4 Al (4Al@Si$_{11}$) and the results\nindicate the QAL method is able to find the optimum 4Al@Si$_{11}$ structure.\nThe aim of this work is to present the QAL method -- formulated in a noise-free\nquantum computing framework -- for automatic structural determination of doped\nnanoparticles and materials defects.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"oBKYs6kju7_QnVzjMa4k4NIKlx2QhxWGD3bBRDvvBj8","pdfSize":"2204151"}