{
  "id": "2412.06137",
  "title": "Metallicity Dependence of Giant Planets around M Dwarfs",
  "authors": "Tianjun Gan, Christopher A. Theissen, Sharon X. Wang, Adam J.\n  Burgasser, Shude Mao",
  "authorsParsed": [
    [
      "Gan",
      "Tianjun",
      ""
    ],
    [
      "Theissen",
      "Christopher A.",
      ""
    ],
    [
      "Wang",
      "Sharon X.",
      ""
    ],
    [
      "Burgasser",
      "Adam J.",
      ""
    ],
    [
      "Mao",
      "Shude",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 01:39:35 GMT"
    },
    {
      "version": "v2",
      "created": "Wed, 11 Dec 2024 11:14:53 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733708375000,
  "abstract": "  We investigate the stellar metallicity ([Fe/H] and [M/H]) dependence of giant\nplanets around M dwarfs by comparing the metallicity distribution of 746 field\nM dwarfs without known giant planets with a sample of 22 M dwarfs hosting\nconfirmed giant planets. All metallicity measurements are homogeneously\nobtained through the same methodology based on the near-infrared spectra\ncollected with a single instrument SpeX mounted on the NASA Infrared Telescope\nFacility. We find that 1) giant planets favor metal-rich M dwarfs at a\n4-5$\\sigma$ confidence level, depending on the band of spectra used to derive\nmetallicity; 2) hot ($a/R_\\ast\\leq 20$) and warm ($a/R_\\ast> 20$) Jupiters do\nnot show a significant difference in the metallicity distribution. Our results\nsuggest that giant planets around M and FGK stars, which are already known to\nprefer metal-rich hosts, probably have a similar formation channel. In\nparticular, hot and warm Jupiters around M dwarfs may have the same origin as\nthey have indistinguishable metallicity distributions. With the refined stellar\nand planetary parameters, we examine the stellar metallicities and the masses\nof giant planets where we find no significant correlation. M dwarfs with\nmultiple giant planets or with a single giant planet have similar stellar\nmetallicities. Mid-to-late type M stars hosting gas giants do not show an\napparent preference to higher metallicities compared with those early-M dwarfs\nwith gas giants and field M dwarfs.\n",
  "subjects": [
    "Astrophysics/Earth and Planetary Astrophysics",
    "Astrophysics/Solar and Stellar Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "sI1TL83iq0XmrljEaXYi51kEt5c4RLRNRsqnxBdBSIw",
  "pdfSize": "2004234"
}