{"id":"2412.19499","title":"Tailoring Robust Quantum Anomalous Hall Effect via Entropy-Engineering","authors":"Syeda Amina Shabbir, Frank Fei Yun, Muhammad Nadeem, and Xiaolin Wang","authorsParsed":[["Shabbir","Syeda Amina",""],["Yun","Frank Fei",""],["Nadeem","Muhammad",""],["Wang","Xiaolin",""]],"versions":[{"version":"v1","created":"Fri, 27 Dec 2024 07:33:57 GMT"}],"updateDate":"2024-12-30","timestamp":1735284837000,"abstract":"  Development of quantum materials and tailoring of their functional properties\nis a fundamental interest in materials science. Here we propose a new design\nconcept for robust quantum anomalous Hall effect via entropy engineering in 2D\nmagnets. As a prototypical example, configurational entropy of monolayer\ntransition metal trihalide VCl$_3$ is manipulated by incorporating four\ndifferent transition-metal cations [Ti,Cr,Fe,Co] in the honeycomb structure\nmade of vanadium, such that all the in-plane mirror symmetries, inversion\nand/or roto-inversion are broken. Monolayer VCl$_3$ is a ferromagnetic Dirac\nhalf-metal in which spin-polarized Dirac dispersion at valley momenta is\naccompanied by bulk states at the $\\Gamma$-point and thus the spin-orbit\ninteraction driven quantum anomalous Hall phase does not exhibit fully gapped\nbulk band dispersion. Entropy-driven bandstructure renormalization, especially\nband flattening in combination with red and blue shifts at different momenta of\nthe Brillouin zone and crystal-field effects, transforms Dirac half-metal to a\nDirac spin gapless semiconductor and leads to a robust quantum anomalous Hall\nphase with fully gapped bulk band dispersion, and thus, a purely topological\nedge state transport without mixing with dissipative bulk channels. These\nfindings provide a paradigm to design entropy-driven 2D materials for the\nrealization of robust quantum anomalous Hall effect and quantum device\napplications.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8wa2KaW4ItG7ErTcWnKf4URpO39VAivp4Ps4NUOFIKU","pdfSize":"4058212"}