{"id":"2412.02877","title":"Machine Learned Potential for High-Throughput Phonon Calculations of\n  Metal-Organic Frameworks","authors":"Alin Marin Elena (1), Prathami Divakar Kamath (2,3), Th\\'eo Jaffrelot\n  Inizan (2,3), Andrew S. Rosen (2,3), Federica Zanca (1), Kristin A. Persson\n  (2,3) ((1) Scientific Computing Department, Science and Technology Facilities\n  Council, Cheshire, UK, (2) Department of Materials Science and Engineering,\n  University of California Berkley, California, USA, (3) Materials Sciences\n  Division, Lawrence Berkeley National Laboratory, California, USA)","authorsParsed":[["Elena","Alin Marin",""],["Kamath","Prathami Divakar",""],["Inizan","Théo Jaffrelot",""],["Rosen","Andrew S.",""],["Zanca","Federica",""],["Persson","Kristin A.",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 22:25:10 GMT"},{"version":"v2","created":"Wed, 18 Dec 2024 21:05:59 GMT"},{"version":"v3","created":"Thu, 27 Feb 2025 17:40:20 GMT"}],"updateDate":"2025-02-28","timestamp":1733264710000,"abstract":"  Metal-organic frameworks (MOFs) are highly porous and versatile materials\nstudied extensively for applications such as carbon capture and water\nharvesting. However, computing phonon-mediated properties in MOFs, like thermal\nexpansion and mechanical stability, remains challenging due to the large number\nof atoms per unit cell, making traditional Density Functional Theory (DFT)\nmethods impractical for high-throughput screening. Recent advances in machine\nlearning potentials have led to foundation atomistic models, such as MACE-MP-0,\nthat accurately predict equilibrium structures but struggle with phonon\nproperties of MOFs. In this work, we developed a workflow for computing phonons\nin MOFs within the quasi-harmonic approximation with a fine-tuned MACE model,\nMACE-MP-MOF0. The model was trained on a curated dataset of 127 representative\nand diverse MOFs. The fine-tuned MACE-MP-MOF0 improves the accuracy of phonon\ndensity of states and corrects the imaginary phonon modes of MACE-MP-0,\nenabling high-throughput phonon calculations with state-of-the-art precision.\nThe model successfully predicts thermal expansion and bulk moduli in agreement\nwith DFT and experimental data for several well-known MOFs. These results\nhighlight the potential of MACE-MP-MOF0 in guiding MOF design for applications\nin energy storage and thermoelectrics.\n","subjects":["Condensed Matter/Materials Science","Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"TURBQSmqG2FQ1egqRxsbtbp1kGqCyubSzJVrbB93a5E","pdfSize":"2498558"}