{
  "id": "2412.04354",
  "title": "Multi-Scale Node Embeddings for Graph Modeling and Generation",
  "authors": "Riccardo Milocco, Fabian Jansen, Diego Garlaschelli",
  "authorsParsed": [
    [
      "Milocco",
      "Riccardo",
      ""
    ],
    [
      "Jansen",
      "Fabian",
      ""
    ],
    [
      "Garlaschelli",
      "Diego",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 17:12:45 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733418765000,
  "abstract": "  Lying at the interface between Network Science and Machine Learning, node\nembedding algorithms take a graph as input and encode its structure onto output\nvectors that represent nodes in an abstract geometric space, enabling various\nvector-based downstream tasks such as network modelling, data compression, link\nprediction, and community detection. Two apparently unrelated limitations\naffect these algorithms. On one hand, it is not clear what the basic operation\ndefining vector spaces, i.e. the vector sum, corresponds to in terms of the\noriginal nodes in the network. On the other hand, while the same input network\ncan be represented at multiple levels of resolution by coarse-graining the\nconstituent nodes into arbitrary block-nodes, the relationship between node\nembeddings obtained at different hierarchical levels is not understood. Here,\nbuilding on recent results in network renormalization theory, we address these\ntwo limitations at once and define a multiscale node embedding method that,\nupon arbitrary coarse-grainings, ensures statistical consistency of the\nembedding vector of a block-node with the sum of the embedding vectors of its\nconstituent nodes. We illustrate the power of this approach on two economic\nnetworks that can be naturally represented at multiple resolution levels:\nnamely, the international trade between (sets of) countries and the\ninput-output flows among (sets of) industries in the Netherlands. We confirm\nthe statistical consistency between networks retrieved from coarse-grained node\nvectors and networks retrieved from sums of fine-grained node vectors, a result\nthat cannot be achieved by alternative methods. Several key network properties,\nincluding a large number of triangles, are successfully replicated already from\nembeddings of very low dimensionality, allowing for the generation of faithful\nreplicas of the original networks at arbitrary resolution levels.\n",
  "subjects": [
    "Physics/Physics and Society",
    "Computer Science/Machine Learning",
    "Economics/General Economics",
    "Physics/Data Analysis, Statistics and Probability",
    "Quantitative Finance/Economics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "BJI8V79GVmYELzTJDfdz-MAC4cYjZcCFVgQWbdgRJhI",
  "pdfSize": "3624840"
}