{"id":"2412.19270","title":"Investigating nuclear density profiles to reveal particle-hole\n  configurations in the island of inversion","authors":"R. Barman (1, 2), W. Horiuchi (3, 4, 2), M. Kimura (2), and R.\n  Chatterjee (1) ((1) Indian Institute of Technology Roorkee, Roorkee 247 667,\n  India (2) RIKEN Nishina Center, Wako 351-0198, Japan, (3) Osaka Metropolitan\n  University, Osaka 558-8585, Japan, (4) Hokkaido University, Sapporo 060-0810,\n  Japan)","authorsParsed":[["Barman","R.",""],["Horiuchi","W.",""],["Kimura","M.",""],["Chatterjee","R.",""]],"versions":[{"version":"v1","created":"Thu, 26 Dec 2024 16:23:35 GMT"}],"updateDate":"2024-12-30","timestamp":1735230215000,"abstract":"  Background: In the mass regions with an abnormal shell structure, the\nso-called ``island of inversion,\" the spin-parity of odd-mass nuclei provides\nquantitative insights into the shell evolution. However, the experimental\ndetermination of the spin-parity is often challenging, leaving it undetermined\nin many nuclei. Purpose: We discuss how the shell structure affects the density\nprofiles of nuclei in the island of inversion and investigate whether these can\nbe probed from the total reaction and elastic scattering cross sections.\nMethod: The antisymmetrized molecular dynamics (AMD) is employed to generate\nvarious particle-hole configurations and predict the energy levels of these\nnuclei. The obtained density distributions are used as inputs to the Glauber\nmodel, which is employed to calculate the total reaction and elastic scattering\ncross sections for revealing their relationship to the particle-hole\nconfigurations. Results: In addition to the well-known correlation between\nnuclear deformation and radius, we show the correlations between the\nparticle-hole configurations and both central density and diffuseness. We show\nthat different particle-hole configurations are well reflected in the total\nreaction and elastic scattering cross sections. Conclusion: The total reaction\nand elastic scattering cross sections are useful probes to identify the\nspin-parity of nuclei when different particle-hole configurations coexist.\n","subjects":["Physics/Nuclear Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"2DD2Tbwc0B_oObKLgY65u_GcWYRbIZxcB9uFtkSMS-s","pdfSize":"1203298"}