{
  "id": "2412.02290",
  "title": "Characterizing Information Shared by Participants to Coding Challenges:\n  The Case of Advent of Code",
  "authors": "Francesco Cauteruccio and Enrico Corradini and Luca Virgili",
  "authorsParsed": [
    [
      "Cauteruccio",
      "Francesco",
      ""
    ],
    [
      "Corradini",
      "Enrico",
      ""
    ],
    [
      "Virgili",
      "Luca",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 09:07:13 GMT"
    }
  ],
  "updateDate": "2024-12-04",
  "timestamp": 1733216833000,
  "abstract": "  Advent of Code (AoC from now on) is a popular coding challenge requiring to\nsolve programming puzzles for a variety of skill sets and levels. AoC follows\nthe advent calendar, therefore it is an annual challenge that lasts for 25\ndays. AoC participants usually post their solutions on social networks and\ndiscuss them online. These challenges are interesting to study since they could\nhighlight the adoption of new tools, the evolution of the developer community,\nor the technological requirements of well-known companies. For these reasons,\nwe first create a dataset of the 2019-2021 AoC editions containing the\ndiscussion threads made on the subreddit {\\tt /r/adventofcode}. Then, we\npropose a model based on stream graphs to best study this context, where we\nrepresent its most important actors through time: participants, comments, and\nprogramming languages. Thanks to our model, we investigate user participation,\nadoption of new programming languages during a challenge and between two of\nthem, and resiliency of programming languages based on a Stack Overflow survey.\nWe find that the top-used programming languages are almost the same in the\nthree years, pointing out their importance. Moreover, participants tend to keep\nthe same programming language for the whole challenge, while the ones attending\ntwo AoCs usually change it in the next one. Finally, we observe interesting\nresults about the programming languages that are ``Popular'' or ``Loved''\naccording to the Stack Overflow survey. Firstly, these are the ones adopted for\nthe longest time in an AoC edition, thanks to which users have a high chance of\nreaching the end of the challenge. Secondly, they are the most chosen when a\nparticipant decides to change programming language during the same challenge.\n",
  "subjects": [
    "Computer Science/Social and Information Networks",
    "Computer Science/Computation and Language",
    "Computer Science/Information Retrieval"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "J4viIAwgXsv68Up6vsJll6gcfxJOOKp78EjRJ9Q8K8M",
  "pdfSize": "498805"
}