{"id":"2412.01218","title":"FD-LLM: Large Language Model for Fault Diagnosis of Machines","authors":"Hamzah A.A.M. Qaid, Bo Zhang, Dan Li, See-Kiong Ng and Wei Li","authorsParsed":[["Qaid","Hamzah A. A. M.",""],["Zhang","Bo",""],["Li","Dan",""],["Ng","See-Kiong",""],["Li","Wei",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 07:36:35 GMT"}],"updateDate":"2024-12-03","timestamp":1733124995000,"abstract":"  Large language models (LLMs) are effective at capturing complex, valuable\nconceptual representations from textual data for a wide range of real-world\napplications. However, in fields like Intelligent Fault Diagnosis (IFD),\nincorporating additional sensor data-such as vibration signals, temperature\nreadings, and operational metrics-is essential but it is challenging to capture\nsuch sensor data information within traditional text corpora. This study\nintroduces a novel IFD approach by effectively adapting LLMs to numerical data\ninputs for identifying various machine faults from time-series sensor data. We\npropose FD-LLM, an LLM framework specifically designed for fault diagnosis by\nformulating the training of the LLM as a multi-class classification problem. We\nexplore two methods for encoding vibration signals: the first method uses a\nstring-based tokenization technique to encode vibration signals into text\nrepresentations, while the second extracts statistical features from both the\ntime and frequency domains as statistical summaries of each signal. We assess\nthe fault diagnosis capabilities of four open-sourced LLMs based on the FD-LLM\nframework, and evaluate the models' adaptability and generalizability under\nvarious operational conditions and machine components, namely for traditional\nfault diagnosis, cross-operational conditions, and cross-machine component\nsettings. Our results show that LLMs such as Llama3 and Llama3-instruct\ndemonstrate strong fault detection capabilities and significant adaptability\nacross different operational conditions, outperforming state-of-the-art deep\nlearning (DL) approaches in many cases.\n","subjects":["Computer Science/Artificial Intelligence","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"1s_aC5xIuVyzXHDzbdvdUT1lNDsjHoQCVLGXqLNh9vE","pdfSize":"2578201"}