{
  "id": "2412.13004",
  "title": "Phase Segregation Dynamics in Mixed-Halide Perovskites Revealed by\n  Plunge-Freeze Cryogenic Electron Microscopy",
  "authors": "Qingyuan Fan, Yi Cui, Yanbin Li, Julian A. Vigil, Zhiqiao Jiang,\n  Partha Nandi, Robert Colby, Chensong Zhang, Yi Cui, Hemamala I. Karunadasa,\n  Aaron M. Lindenberg",
  "authorsParsed": [
    [
      "Fan",
      "Qingyuan",
      ""
    ],
    [
      "Cui",
      "Yi",
      ""
    ],
    [
      "Li",
      "Yanbin",
      ""
    ],
    [
      "Vigil",
      "Julian A.",
      ""
    ],
    [
      "Jiang",
      "Zhiqiao",
      ""
    ],
    [
      "Nandi",
      "Partha",
      ""
    ],
    [
      "Colby",
      "Robert",
      ""
    ],
    [
      "Zhang",
      "Chensong",
      ""
    ],
    [
      "Cui",
      "Yi",
      ""
    ],
    [
      "Karunadasa",
      "Hemamala I.",
      ""
    ],
    [
      "Lindenberg",
      "Aaron M.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 15:25:41 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734449141000,
  "abstract": "  Mixed-halide lead perovskites, with photoexcited charge-carrier properties\nsuitable for high-efficiency photovoltaics, hold significant promise for\nhigh-efficiency tandem solar cells. However, phase segregation under\nillumination, where an iodide-rich phase forms carrier trap states, remains a\nbarrier to applications. This study employs plunge-freeze cryogenic electron\nmicroscopy to visualize nanoscale phase segregation dynamics in CsPb(Br,I)\nfilms. By rapidly freezing the illuminated samples, we preserve transient\nphotoexcited ion distributions for high-resolution structural and compositional\nanalysis at the nanoscale. Cryogenic scanning transmission electron microscopy\ntechniques (EELS, 4D-STEM) captured the dynamics of photo-induced iodine\nmigration from grain boundaries to centers, identified the buildup of\nanisotropic strain, and captured the heterogeneous evolution of this process\nwithin a single grain. These findings provide new insights into microscopic\nphase segregation mechanisms and their dynamics, enhancing our understanding of\nmixed-halide perovskite photostability.\n",
  "subjects": [
    "Condensed Matter/Materials Science",
    "Physics/Applied Physics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "dDkf3_4qcJEStdDLQwoLkl4wGrTVqMCgGizwDihwgYI",
  "pdfSize": "2279450"
}