{
  "id": "2412.12616",
  "title": "Macroscopic stress, couple stress and flux tensors derived through\n  energetic equivalence from microscopic continuous and discrete heterogeneous\n  finite representative volumes",
  "authors": "Jan Eli\\'a\\v{s}, Gianluca Cusatis",
  "authorsParsed": [
    [
      "Eliáš",
      "Jan",
      ""
    ],
    [
      "Cusatis",
      "Gianluca",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 07:28:26 GMT"
    },
    {
      "version": "v2",
      "created": "Mon, 30 Dec 2024 22:51:26 GMT"
    }
  ],
  "updateDate": "2025-01-03",
  "timestamp": 1734420506000,
  "abstract": "  This paper presents a rigorous derivation of equations to evaluate the\nmacroscopic stress tensor, the couple stress tensor, and the flux vector\nequivalent to underlying microscopic fields in continuous and discrete\nheterogeneous systems with independent displacements and rotations. Contrary to\nthe classical asymptotic expansion homogenization, finite size representative\nvolume is considered. First, the macroscopic quantities are derived for a\nheterogeneous Cosserat continuum. The resulting continuum equations are\ndiscretized to provide macroscopic quantities in discrete heterogeneous\nsystems. Finally, the expressions for discrete system are derived once again,\nthis time considering the discrete nature directly.\n  The formulations are presented in two variants, considering either internal\nor external forces, couples, and fluxes. The derivation is based on the virtual\nwork equivalence and elucidates the fundamental significance of the couple\nstress tensor in the context of balance equations and admissible virtual\ndeformation modes. Notably, an additional term in the couple stress tensor\nformula emerges, explaining its dependence on the reference system and position\nof the macroscopic point. The resulting equations are verified by comparing\ntheir predictions with known analytical solutions and results of other\nnumerical models under both steady state and transient conditions.\n",
  "subjects": [
    "Computer Science/Computational Engineering, Finance, and Science",
    "Condensed Matter/Other Condensed Matter"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "ORE9GokEFyd-4nwV34IOET6V6gGZxnBLubXJTby_wWo",
  "pdfSize": "1657501"
}