{
  "id": "2412.08853",
  "title": "Designing flexible hard magnetic materials for zero-magnetic-field\n  operation of the anomalous Nernst effect",
  "authors": "Sang J. Park, Rajkumar Modak, Ravi Gautam, Abdulkareem Alasli,\n  Takamasa Hirai, Fuyuki Ando, Hosei Nagano, Hossein Sepehri-Amin and Ken-ichi\n  Uchida",
  "authorsParsed": [
    [
      "Park",
      "Sang J.",
      ""
    ],
    [
      "Modak",
      "Rajkumar",
      ""
    ],
    [
      "Gautam",
      "Ravi",
      ""
    ],
    [
      "Alasli",
      "Abdulkareem",
      ""
    ],
    [
      "Hirai",
      "Takamasa",
      ""
    ],
    [
      "Ando",
      "Fuyuki",
      ""
    ],
    [
      "Nagano",
      "Hosei",
      ""
    ],
    [
      "Sepehri-Amin",
      "Hossein",
      ""
    ],
    [
      "Uchida",
      "Ken-ichi",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 01:22:10 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1733966530000,
  "abstract": "  The global shift towards a carbon-neutral society has accelerated the demand\nfor green energy, driving research into efficient technologies for harvesting\nenergy from low-grade waste heat. Recently, transverse thermoelectrics based on\nthe anomalous Nernst effect (ANE) has gained attention due to their simple\ndevice structure, scalability, and manufacturing-friendly nature. While\ntopological single crystals and epitaxial films have been focused for enhancing\nthe ANE-driven thermoelectric performance, further improvements in material\ndesign are necessary for practical applications. Here, we report an\neasy-to-implement strategy for designing mechanically flexible and magnetically\nhard transverse thermoelectric materials by creating amorphous-crystalline\nheterogeneous composites. We fabricated and optimized the heterogeneous\ncomposites through controlled heat treatment, achieving significant\nenhancements in the coercivity and anomalous Nernst coefficient, while\nmaintaining flexibility. Additionally, using the developed material, we\nconstructed a single-material-based coiled device and demonstrated the\nzero-field operation of the ANE-based energy harvesting from curved heat\nsources. These results validate the feasibility of using the ANE-based flexible\nmaterials for energy harvesting applications.\n",
  "subjects": [
    "Condensed Matter/Materials Science"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "T669ADNDlKC83TnJ_b06nbY1pkOf9tTGoyOYX45gSyw",
  "pdfSize": "1385581"
}