{"id":"2412.15058","title":"MultiverSeg: Scalable Interactive Segmentation of Biomedical Imaging\n  Datasets with In-Context Guidance","authors":"Hallee E. Wong and Jose Javier Gonzalez Ortiz and John Guttag and\n  Adrian V. Dalca","authorsParsed":[["Wong","Hallee E.",""],["Ortiz","Jose Javier Gonzalez",""],["Guttag","John",""],["Dalca","Adrian V.",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 17:06:53 GMT"}],"updateDate":"2024-12-20","timestamp":1734628013000,"abstract":"  Medical researchers and clinicians often need to perform novel segmentation\ntasks on a set of related images. Existing methods for segmenting a new dataset\nare either interactive, requiring substantial human effort for each image, or\nrequire an existing set of manually labeled images. We introduce a system,\nMultiverSeg, that enables practitioners to rapidly segment an entire new\ndataset without requiring access to any existing labeled data from that task or\ndomain. Along with the image to segment, the model takes user interactions such\nas clicks, bounding boxes or scribbles as input, and predicts a segmentation.\nAs the user segments more images, those images and segmentations become\nadditional inputs to the model, providing context. As the context set of\nlabeled images grows, the number of interactions required to segment each new\nimage decreases. We demonstrate that MultiverSeg enables users to interactively\nsegment new datasets efficiently, by amortizing the number of interactions per\nimage to achieve an accurate segmentation. Compared to using a state-of-the-art\ninteractive segmentation method, using MultiverSeg reduced the total number of\nscribble steps by 53% and clicks by 36% to achieve 90% Dice on sets of images\nfrom unseen tasks. We release code and model weights at\nhttps://multiverseg.csail.mit.edu\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Machine Learning","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ZHwjnSlis9c8PLr-Iv6dZRmAch3ECw218qYXxn9PFDM","pdfSize":"2713371"}