{
  "id": "2412.21191",
  "title": "Investigating Temporal and Spatial Variation of Jupiter's Atmosphere\n  with Radio Observations",
  "authors": "Joanna Hardesty, Chris Moeckel, Imke de Pater",
  "authorsParsed": [
    [
      "Hardesty",
      "Joanna",
      ""
    ],
    [
      "Moeckel",
      "Chris",
      ""
    ],
    [
      "de Pater",
      "Imke",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 30 Dec 2024 18:56:34 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735584994000,
  "abstract": "  We study the spatial and temporal variability in Jupiter's atmosphere by\ncomparing longitude-resolved brightness temperature maps from the Very Large\nArray (VLA) radio observatory and NASA's Juno spacecraft Microwave Radiometer\n(MWR) taken between 2013 and 2018. Spatial variations in brightness\ntemperature, as observed at radio wavelengths, indicate dynamics in the\natmosphere as they trace spatial fluctuations in radio-absorbing trace gases or\nphysical temperature. We use four distinct frequency bands, probing the\natmosphere from the water cloud region at the lowest frequency to the pressures\nabove the ammonia cloud deck at the highest frequency. We visualize the\nbrightness temperature anomalies and trace dynamics by analyzing the shapes of\nbrightness temperature anomaly distributions as a function of frequency in\nJupiter's North Equatorial Belt (NEB), Equatorial Zone (EZ), and South\nEquatorial Belt (SEB). The NEB has the greatest brightness temperature\nvariability at all frequencies, indicating that more extreme processes are\noccurring there than in the SEB and EZ. In general, we find that the atmosphere\nat 5 and 22 GHz has the least variability of the frequencies considered, while\nobservations at 10 and 15 GHz have the greatest variability. When comparing the\nsize of the features corresponding to the anomalies, we find evidence for\nsmall-scale events primarily at the depths probed by the 10 and 15 GHz\nobservations. In contrast, we find larger-scale structures deeper (5 GHz) and\nhigher (22 GHz) in the atmosphere.\n",
  "subjects": [
    "Astrophysics/Earth and Planetary Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "e1EkKKk1JtVjzhNF8t_gyihCwahzxf8l32lZUw4h5Xk",
  "pdfSize": "35207195"
}