{
  "id": "2412.08986",
  "title": "Emergent facilitation by random constraints in a facilitated random walk\n  model of glass",
  "authors": "Leo S.I. Lam, Hai-Yao Deng, Wei-Bing Zhang, Udoka Nwankwo, Chu Xiao,\n  Cho-Tung Yip, Chun-Shing Lee, Haihui Ruan and Chi-Hang Lam",
  "authorsParsed": [
    [
      "Lam",
      "Leo S. I.",
      ""
    ],
    [
      "Deng",
      "Hai-Yao",
      ""
    ],
    [
      "Zhang",
      "Wei-Bing",
      ""
    ],
    [
      "Nwankwo",
      "Udoka",
      ""
    ],
    [
      "Xiao",
      "Chu",
      ""
    ],
    [
      "Yip",
      "Cho-Tung",
      ""
    ],
    [
      "Lee",
      "Chun-Shing",
      ""
    ],
    [
      "Ruan",
      "Haihui",
      ""
    ],
    [
      "Lam",
      "Chi-Hang",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 06:38:48 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1733985528000,
  "abstract": "  The physics of glass has been a significant topic of interest for decades.\nDynamical facilitation is widely believed to be an important characteristic of\nglassy dynamics, but the precise mechanism is still under debate. We propose a\nlattice model of glass called the facilitated random walk (FRW). Each particle\nperforms continuous time random walk in the presence of its own random local\nkinetic constraints. The particles do not interact energetically. Instead, they\ninteract kinetically with a hopping rate resampling rule under which motions of\na particle can randomly perturb the local kinetic constraints of other\nparticles. This dynamic interaction is reversible, following a rate restoration\nrule. A step-by-step reversal of the particle motions exactly restore the\nprevious constraints, modeling randomness quenched in the configuration space\nof glass. The model exhibits stretched exponential relaxation and dynamical\nheterogeneity typical of glasses. Despite the lack of explicit facilitation\nrule, the FRW shows facilitation behaviors closely analogous to those of the\nkinetically constrained models (KCM). The FRW is a coarse-grained version of\nthe distinguishable particle lattice model (DPLM) and this exemplifies that\ncompatible defect and atomistic models can complement each other on the study\nof glass.\n",
  "subjects": [
    "Condensed Matter/Statistical Mechanics"
  ],
  "license": "http://creativecommons.org/publicdomain/zero/1.0/",
  "blobId": "JIroANKXmfRYxmRgyIcqlQQIfbZJ5HoCSiNTTcyN23U",
  "pdfSize": "1109256"
}