{"id":"2412.10390","title":"Neural-Symbolic Reasoning over Knowledge Graphs: A Survey from a Query\n  Perspective","authors":"Lihui Liu, Zihao Wang, Hanghang Tong","authorsParsed":[["Liu","Lihui",""],["Wang","Zihao",""],["Tong","Hanghang",""]],"versions":[{"version":"v1","created":"Sat, 30 Nov 2024 18:54:08 GMT"}],"updateDate":"2024-12-17","timestamp":1732992848000,"abstract":"  Knowledge graph reasoning is pivotal in various domains such as data mining,\nartificial intelligence, the Web, and social sciences. These knowledge graphs\nfunction as comprehensive repositories of human knowledge, facilitating the\ninference of new information. Traditional symbolic reasoning, despite its\nstrengths, struggles with the challenges posed by incomplete and noisy data\nwithin these graphs. In contrast, the rise of Neural Symbolic AI marks a\nsignificant advancement, merging the robustness of deep learning with the\nprecision of symbolic reasoning. This integration aims to develop AI systems\nthat are not only highly interpretable and explainable but also versatile,\neffectively bridging the gap between symbolic and neural methodologies.\nAdditionally, the advent of large language models (LLMs) has opened new\nfrontiers in knowledge graph reasoning, enabling the extraction and synthesis\nof knowledge in unprecedented ways. This survey offers a thorough review of\nknowledge graph reasoning, focusing on various query types and the\nclassification of neural symbolic reasoning. Furthermore, it explores the\ninnovative integration of knowledge graph reasoning with large language models,\nhighlighting the potential for groundbreaking advancements. This comprehensive\noverview is designed to support researchers and practitioners across multiple\nfields, including data mining, AI, the Web, and social sciences, by providing a\ndetailed understanding of the current landscape and future directions in\nknowledge graph reasoning.\n","subjects":["Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"VOhqsi2XAtge8j3P3esAwaR9X30z-Xg779yv2pImvmw","pdfSize":"1270880"}