{"id":"2412.20045","title":"Enhancing Diffusion Models for Inverse Problems with Covariance-Aware\n  Posterior Sampling","authors":"Shayan Mohajer Hamidi, En-Hui Yang","authorsParsed":[["Hamidi","Shayan Mohajer",""],["Yang","En-Hui",""]],"versions":[{"version":"v1","created":"Sat, 28 Dec 2024 06:17:44 GMT"}],"updateDate":"2024-12-31","timestamp":1735366664000,"abstract":"  Inverse problems exist in many disciplines of science and engineering. In\ncomputer vision, for example, tasks such as inpainting, deblurring, and super\nresolution can be effectively modeled as inverse problems. Recently, denoising\ndiffusion probabilistic models (DDPMs) are shown to provide a promising\nsolution to noisy linear inverse problems without the need for additional task\nspecific training. Specifically, with the prior provided by DDPMs, one can\nsample from the posterior by approximating the likelihood. In the literature,\napproximations of the likelihood are often based on the mean of conditional\ndensities of the reverse process, which can be obtained using Tweedie formula.\nTo obtain a better approximation to the likelihood, in this paper we first\nderive a closed form formula for the covariance of the reverse process. Then,\nwe propose a method based on finite difference method to approximate this\ncovariance such that it can be readily obtained from the existing pretrained\nDDPMs, thereby not increasing the complexity compared to existing approaches.\nFinally, based on the mean and approximated covariance of the reverse process,\nwe present a new approximation to the likelihood. We refer to this method as\ncovariance-aware diffusion posterior sampling (CA-DPS). Experimental results\nshow that CA-DPS significantly improves reconstruction performance without\nrequiring hyperparameter tuning. The code for the paper is put in the\nsupplementary materials.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Q1LTx9CXQJ1fT6OkZraLXWG7le5Ceqp4Ah2mQQ-mbpc","pdfSize":"1324472"}