{
  "id": "2412.07180",
  "title": "Digital Twin Assisted Beamforming Design for Integrated Sensing and\n  Communication Systems",
  "authors": "Shuaifeng Jiang and Ahmed Alkhateeb",
  "authorsParsed": [
    [
      "Jiang",
      "Shuaifeng",
      ""
    ],
    [
      "Alkhateeb",
      "Ahmed",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 04:39:46 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733805586000,
  "abstract": "  This paper explores a novel research direction where a digital twin is\nleveraged to assist the beamforming design for an integrated sensing and\ncommunication (ISAC) system. In this setup, a base station designs joint\ncommunication and sensing beamforming to serve the communication user and\ndetect the sensing target concurrently. Utilizing the electromagnetic (EM) 3D\nmodel of the environment and ray tracing, the digital twin can provide various\ninformation, e.g., propagation path parameters and wireless channels, to aid\ncommunication and sensing systems. More specifically, our digital twin-based\nbeamforming design first leverages the environment EM 3D model and ray tracing\nto (i) predict the directions of the line-of-sight (LoS) and non-line-of-sight\n(NLoS) sensing channel paths and (ii) identify the dominant one among these\nsensing channel paths. Then, to optimize the joint sensing and communication\nbeam, we maximize the sensing signal-to-noise ratio (SNR) on the dominant\nsensing channel component while satisfying a minimum communication\nsignal-to-interference-plus-noise ratio (SINR) requirement. Simulation results\nshow that the proposed digital twin-assisted beamforming design achieves\nnear-optimal target sensing SNR in both LoS and NLoS dominant areas, while\nensuring the required SINR for the communication user. This highlights the\npotential of leveraging digital twins to assist ISAC systems.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Signal Processing",
    "Computer Science/Information Theory",
    "Mathematics/Information Theory"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "QNVB2roPPQXSwMaR9ZwHBBT1HD6Z7Esh9j7o6WmwJ0k",
  "pdfSize": "1771398"
}