{
  "id": "2412.02827",
  "title": "Damping Enhancement in YIG at Millikelvin Temperatures due to GGG\n  Substrate",
  "authors": "Rostyslav O. Serha, Andrey A. Voronov, David Schmoll, Rebecca\n  Klingbeil, Sebastian Knauer, Sabri Koraltan, Ekaterina Pribytova, Morris\n  Lindner, Timmy Reimann, Carsten Dubs, Claas Abert, Roman Verba, Michal\n  Urb\\'anek, Dieter Suess and Andrii V. Chumak",
  "authorsParsed": [
    [
      "Serha",
      "Rostyslav O.",
      ""
    ],
    [
      "Voronov",
      "Andrey A.",
      ""
    ],
    [
      "Schmoll",
      "David",
      ""
    ],
    [
      "Klingbeil",
      "Rebecca",
      ""
    ],
    [
      "Knauer",
      "Sebastian",
      ""
    ],
    [
      "Koraltan",
      "Sabri",
      ""
    ],
    [
      "Pribytova",
      "Ekaterina",
      ""
    ],
    [
      "Lindner",
      "Morris",
      ""
    ],
    [
      "Reimann",
      "Timmy",
      ""
    ],
    [
      "Dubs",
      "Carsten",
      ""
    ],
    [
      "Abert",
      "Claas",
      ""
    ],
    [
      "Verba",
      "Roman",
      ""
    ],
    [
      "Urbánek",
      "Michal",
      ""
    ],
    [
      "Suess",
      "Dieter",
      ""
    ],
    [
      "Chumak",
      "Andrii V.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 20:46:27 GMT"
    }
  ],
  "updateDate": "2024-12-05",
  "timestamp": 1733258787000,
  "abstract": "  Quantum magnonics aims to exploit the quantum mechanical properties of\nmagnons for nanoscale quantum information technologies. Ferrimagnetic yttrium\niron garnet (YIG), which offers the longest magnon lifetimes, is a key material\ntypically grown on gadolinium gallium garnet (GGG) substrates for structural\ncompatibility. However, the increased magnetic damping in YIG/GGG systems below\n50$\\,$K poses a challenge for quantum applications. Here, we study the damping\nin a 97$\\,$nm-thick YIG film on a 500$\\,\\mu$m-thick GGG substrate at\ntemperatures down to 30$\\,$mK using ferromagnetic resonance (FMR) spectroscopy.\nWe show that the dominant physical mechanism for the observed tenfold increase\nin FMR linewidth at millikelvin temperatures is the non-uniform bias magnetic\nfield generated by the partially magnetized paramagnetic GGG substrate.\nNumerical simulations and analytical theory show that the GGG-driven linewidth\nenhancement can reach up to 6.7 times. In addition, at low temperatures and\nfrequencies above 18$\\,$GHz, the FMR linewidth deviates from the viscous\nGilbert-damping model. These results allow the partial elimination of the\ndamping mechanisms attributed to GGG, which is necessary for the advancement of\nsolid-state quantum technologies.\n",
  "subjects": [
    "Condensed Matter/Mesoscale and Nanoscale Physics",
    "Condensed Matter/Materials Science",
    "Condensed Matter/Other Condensed Matter"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "9icXO0l0ZHr-U5wEYiIKPMA8JMVqynAUbibepNQraUU",
  "pdfSize": "5813265"
}