{
  "id": "2412.09566",
  "title": "How Many Bursts Does it Take to Form a Core at the Center of a Galaxy?",
  "authors": "Olivia Mostow, Paul Torrey, Jonah C. Rose, Alex M. Garcia, Niusha\n  Ahvazi, Mariangela Lisanti, Nitya Kallivayalil",
  "authorsParsed": [
    [
      "Mostow",
      "Olivia",
      ""
    ],
    [
      "Torrey",
      "Paul",
      ""
    ],
    [
      "Rose",
      "Jonah C.",
      ""
    ],
    [
      "Garcia",
      "Alex M.",
      ""
    ],
    [
      "Ahvazi",
      "Niusha",
      ""
    ],
    [
      "Lisanti",
      "Mariangela",
      ""
    ],
    [
      "Kallivayalil",
      "Nitya",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 18:50:04 GMT"
    },
    {
      "version": "v2",
      "created": "Mon, 23 Dec 2024 20:19:18 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1734029404000,
  "abstract": "  We present a novel method for systematically assessing the impact of central\npotential fluctuations associated with bursty outflows on the structure of dark\nmatter halos for dwarf and ultra-faint galaxies. Specifically, we use\ndark-matter-only simulations augmented with a manually-added massive particle\nthat modifies the central potential and approximately accounts for a\ncentrally-concentrated baryon component. This approach enables precise control\nover the magnitude, frequency, and timing of when rapid outflow events occur.\nWe demonstrate that this method can reproduce the established result of core\nformation for systems that undergo multiple episodes of bursty outflows. In\ncontrast, we also find that equivalent models that undergo only a single (or\nsmall number of) burst episodes do not form cores with the same efficacy. This\nis important because many ultra-faint dwarf (UFD) galaxies in the local\nuniverse are observed to have tightly constrained star formation histories that\nare best described by a single, early burst of star formation. Using a suite of\ncosmological, zoom-in simulations, we identify the regimes in which single\nbursts can and cannot form a cored density profile, and therefore, can or\ncannot resolve the core-cusp problem.\n",
  "subjects": [
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "u8EUSPLWrhY0TBhuYVeZej6P8RvJYWtm_SqMZDwmkQU",
  "pdfSize": "1214164"
}