{"id":"2412.03737","title":"Utilizing Machine Learning Models to Predict Acute Kidney Injury in\n  Septic Patients from MIMIC-III Database","authors":"Aleyeh Roknaldin, Zehao Zhang, Jiayuan Xu, Kamiar Alaei, Maryam\n  Pishgar","authorsParsed":[["Roknaldin","Aleyeh",""],["Zhang","Zehao",""],["Xu","Jiayuan",""],["Alaei","Kamiar",""],["Pishgar","Maryam",""]],"versions":[{"version":"v1","created":"Wed, 4 Dec 2024 22:05:35 GMT"}],"updateDate":"2024-12-06","timestamp":1733349935000,"abstract":"  Sepsis is a severe condition that causes the body to respond incorrectly to\nan infection. This reaction can subsequently cause organ failure, a major one\nbeing acute kidney injury (AKI). For septic patients, approximately 50% develop\nAKI, with a mortality rate above 40%. Creating models that can accurately\npredict AKI based on specific qualities of septic patients is crucial for early\ndetection and intervention. Using medical data from septic patients during\nintensive care unit (ICU) admission from the Medical Information Mart for\nIntensive Care 3 (MIMIC-III) database, we extracted 3301 patients with sepsis,\nwith 73% of patients developing AKI. The data was randomly divided into a\ntraining set (n = 1980, 40%), a test set (n = 661, 10%), and a validation set\n(n = 660, 50%). The proposed model was logistic regression, and it was compared\nagainst five baseline models: XGBoost, K Nearest Neighbors (KNN), Support\nVector Machines (SVM), Random Forest (RF), and LightGBM. Area Under the Curve\n(AUC), Accuracy, F1-Score, and Recall were calculated for each model. After\nanalysis, we were able to select 23 features to include in our model, the top\nfeatures being urine output, maximum bilirubin, minimum bilirubin, weight,\nmaximum blood urea nitrogen, and minimum estimated glomerular filtration rate.\nThe logistic regression model performed the best, achieving an AUC score of\n0.887 (95% CI: [0.861-0.915]), an accuracy of 0.817, an F1 score of 0.866, a\nrecall score of 0.827, and a Brier score of 0.13. Compared to the best existing\nliterature in this field, our model achieved an 8.57% improvement in AUC while\nusing 13 fewer variables, showcasing its effectiveness in determining AKI in\nseptic patients. While the features selected for predicting AKI in septic\npatients are similar to previous literature, the top features that influenced\nour model's performance differ.\n","subjects":["Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"C1kub5z7F5Ts4XtlDISNA9T86XHDkfpL9z2E-qnJHlI","pdfSize":"1159694"}