{
  "id": "2412.14876",
  "title": "Impurity-temperature phase diagram with phase crystals and competing\n  time-reversal symmetry breaking states in nodal $d$-wave superconductors",
  "authors": "Kevin Marc Seja, Niclas Wall-Wennerdal, Tomas L\\\"ofwander, Annica M.\n  Black-Schaffer, Mikael Fogelstr\\\"om, Patric Holmvall",
  "authorsParsed": [
    [
      "Seja",
      "Kevin Marc",
      ""
    ],
    [
      "Wall-Wennerdal",
      "Niclas",
      ""
    ],
    [
      "Löfwander",
      "Tomas",
      ""
    ],
    [
      "Black-Schaffer",
      "Annica M.",
      ""
    ],
    [
      "Fogelström",
      "Mikael",
      ""
    ],
    [
      "Holmvall",
      "Patric",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 14:14:34 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734617674000,
  "abstract": "  Phase crystals are a class of non-uniform superconducting ground states\ncharacterized by spontaneous phase gradients of the superconducting order\nparameter. These phase gradients non-locally drive periodic currents and\nmagnetic fields, thus breaking both time-reversal symmetry and continuous\ntranslational symmetry. The phase crystal instability is generally triggered by\nnegative and inhomogeneous superfluid stiffness. Several scenarios have been\nidentified that can realize phase crystals, especially flat bands at specific\nedges of unconventional nodal superconductors. Motivated by omnipresent\ndisorder in all materials, we employ the ${t}$-matrix approach within the\nquasiclassical theory of superconductivity to study the emergence of phase\ncrystals at edges of a nodal $d$-wave superconductor. We quantify the full\nphase diagram as a function of the impurity scattering energy and the\ntemperature, with full self-consistency in the impurity self energies, the\nsuperconducting order parameter, and the vector potential. We find that the\nphase crystal survives even up to $\\sim 40-50\\%$ of the superconducting\ncritical impurity strength in both the Born and unitary scattering limits.\nFinally, we show how mesoscopic finite-size effects induce a competition with a\nstate still breaking time-reversal symmetry but with translationally invariant\nedge currents.\n",
  "subjects": [
    "Condensed Matter/Superconductivity",
    "Condensed Matter/Disordered Systems and Neural Networks",
    "Condensed Matter/Mesoscale and Nanoscale Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "E-vZSCB7Bfy2vhsVrV_il_3NgN4e_MJiYhhilCkpdjU",
  "pdfSize": "1837882"
}