{
  "id": "2412.10091",
  "title": "Data Pruning Can Do More: A Comprehensive Data Pruning Approach for\n  Object Re-identification",
  "authors": "Zi Yang, Haojin Yang, Soumajit Majumder, Jorge Cardoso, Guillermo\n  Gallego",
  "authorsParsed": [
    [
      "Yang",
      "Zi",
      ""
    ],
    [
      "Yang",
      "Haojin",
      ""
    ],
    [
      "Majumder",
      "Soumajit",
      ""
    ],
    [
      "Cardoso",
      "Jorge",
      ""
    ],
    [
      "Gallego",
      "Guillermo",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 12:27:47 GMT"
    }
  ],
  "updateDate": "2024-12-16",
  "timestamp": 1734092867000,
  "abstract": "  Previous studies have demonstrated that not each sample in a dataset is of\nequal importance during training. Data pruning aims to remove less important or\ninformative samples while still achieving comparable results as training on the\noriginal (untruncated) dataset, thereby reducing storage and training costs.\nHowever, the majority of data pruning methods are applied to image\nclassification tasks. To our knowledge, this work is the first to explore the\nfeasibility of these pruning methods applied to object re-identification (ReID)\ntasks, while also presenting a more comprehensive data pruning approach. By\nfully leveraging the logit history during training, our approach offers a more\naccurate and comprehensive metric for quantifying sample importance, as well as\ncorrecting mislabeled samples and recognizing outliers. Furthermore, our\napproach is highly efficient, reducing the cost of importance score estimation\nby 10 times compared to existing methods. Our approach is a plug-and-play,\narchitecture-agnostic framework that can eliminate/reduce 35%, 30%, and 5% of\nsamples/training time on the VeRi, MSMT17 and Market1501 datasets,\nrespectively, with negligible loss in accuracy (< 0.1%). The lists of\nimportant, mislabeled, and outlier samples from these ReID datasets are\navailable at https://github.com/Zi-Y/data-pruning-reid.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "UOawufPYg7MMw9ZFfXAgVxhHL_lZzEKg84pPWIuCsAA",
  "pdfSize": "3804430"
}