{
  "id": "2412.18980",
  "title": "Evaluating deep learning models for fault diagnosis of a rotating\n  machinery with epistemic and aleatoric uncertainty",
  "authors": "Reza Jalayer, Masoud Jalayer, Andrea Mor, Carlotta Orsenigo, Carlo\n  Vercellis",
  "authorsParsed": [
    [
      "Jalayer",
      "Reza",
      ""
    ],
    [
      "Jalayer",
      "Masoud",
      ""
    ],
    [
      "Mor",
      "Andrea",
      ""
    ],
    [
      "Orsenigo",
      "Carlotta",
      ""
    ],
    [
      "Vercellis",
      "Carlo",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 25 Dec 2024 20:22:59 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735158179000,
  "abstract": "  Uncertainty-aware deep learning (DL) models recently gained attention in\nfault diagnosis as a way to promote the reliable detection of faults when\nout-of-distribution (OOD) data arise from unseen faults (epistemic uncertainty)\nor the presence of noise (aleatoric uncertainty). In this paper, we present the\nfirst comprehensive comparative study of state-of-the-art uncertainty-aware DL\narchitectures for fault diagnosis in rotating machinery, where different\nscenarios affected by epistemic uncertainty and different types of aleatoric\nuncertainty are investigated. The selected architectures include sampling by\ndropout, Bayesian neural networks, and deep ensembles. Moreover, to distinguish\nbetween in-distribution and OOD data in the different scenarios two uncertainty\nthresholds, one of which is introduced in this paper, are alternatively\napplied. Our empirical findings offer guidance to practitioners and researchers\nwho have to deploy real-world uncertainty-aware fault diagnosis systems. In\nparticular, they reveal that, in the presence of epistemic uncertainty, all DL\nmodels are capable of effectively detecting, on average, a substantial portion\nof OOD data across all the scenarios. However, deep ensemble models show\nsuperior performance, independently of the uncertainty threshold used for\ndiscrimination. In the presence of aleatoric uncertainty, the noise level plays\nan important role. Specifically, low noise levels hinder the models' ability to\neffectively detect OOD data. Even in this case, however, deep ensemble models\nexhibit a milder degradation in performance, dominating the others. These\nachievements, combined with their shorter inference time, make deep ensemble\narchitectures the preferred choice.\n",
  "subjects": [
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Zw6IsD_FvNZHsRc0U0xlmr034iD3w2SYJq3HMXt_UrU",
  "pdfSize": "5863100"
}