{
  "id": "2412.11416",
  "title": "Relaxation methods for pessimistic bilevel optimization",
  "authors": "Imane Benchouk and Lateef Jolaoso and Khadra Nachi and Alain Zemkoho",
  "authorsParsed": [
    [
      "Benchouk",
      "Imane",
      ""
    ],
    [
      "Jolaoso",
      "Lateef",
      ""
    ],
    [
      "Nachi",
      "Khadra",
      ""
    ],
    [
      "Zemkoho",
      "Alain",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 03:32:35 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734319955000,
  "abstract": "  We consider a smooth pessimistic bilevel optimization problem, where the\nlower-level problem is convex and satisfies the Slater constraint\nqualification. These assumptions ensure that the Karush-Kuhn-Tucker (KKT)\nreformulation of our problem is well-defined. We then introduce and study the\n(i) Scholtes, (ii) Lin and Fukushima, (iii) Kadrani, Dussault and Benchakroun,\n(iv) Steffensen and Ulbrich, and (v) Kanzow and Schwartz relaxation methods for\nthe KKT reformulation of our pessimistic bilevel program. These relaxations\nhave been extensively studied and compared for mathematical programs with\ncomplementatrity constraints (MPCCs). To the best of our knowledge, such a\nstudy has not been conducted for the pessimistic bilevel optimization problem,\nwhich is completely different from an MPCC, as the complemetatrity conditions\nare part of the objective function, and not in the feasible set of the problem.\nAfter introducing these relaxations, we provide convergence results for global\nand local optimal solutions, as well as suitable versions of the C- and\nM-stationarity points of our pessimistic bilevel optimization problem.\nNumerical results are also provided to illustrate the practical implementation\nof these relaxation algorithms, as well as some preliminary comparisons.\n",
  "subjects": [
    "Mathematics/Optimization and Control"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "fsz96Gmc3RKFlpmydGI8g5GDIXUkb_FArerYxx4KL2A",
  "pdfSize": "828928"
}