{
  "id": "2412.05464",
  "title": "Highly Polarized Type III Storm Observed with Parker Solar Probe",
  "authors": "Marc Pulupa, Stuart D. Bale, Immanuel Christopher Jebaraj, Orlando\n  Romeo, and S\\\"am Krucker",
  "authorsParsed": [
    [
      "Pulupa",
      "Marc",
      ""
    ],
    [
      "Bale",
      "Stuart D.",
      ""
    ],
    [
      "Jebaraj",
      "Immanuel Christopher",
      ""
    ],
    [
      "Romeo",
      "Orlando",
      ""
    ],
    [
      "Krucker",
      "Säm",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 23:34:06 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733528046000,
  "abstract": "  The Parker Solar Probe (PSP) spacecraft observed a large coronal mass\nejection (CME) on 5 September 2022, shortly before closest approach during the\n13th PSP solar encounter. For several days following the CME, PSP detected a\nstorm of Type III radio bursts. Stokes parameter analysis of the radio emission\nindicates that the Type III storm was highly circularly polarized. Left hand\ncircularly polarized (LHC) emission dominated at the start of the storm,\ntransitioning to right hand circularly polarized (RHC) emission at the crossing\nof the heliospheric current sheet on 6 September.\n  We analyze the properties of this Type III storm. The drift rate of the Type\nIIIs indicates a constant beam speed of $\\sim$0.1$c$, typical for Type\nIII-producing electron beams. The sense of polarization is consistent with\nfundamental emission generated primarily in the $O$-mode.\n  The stable and well organized post-CME magnetic field neatly separates the\nLHC- and RHC-dominated intervals of the storm, with minimal overlap between the\nsenses of polarization. The proximity of PSP to the source region, both in\nradial distance and in heliographic longitude, makes this event an ideal case\nstudy to connect in situ plasma measurements with remote observations of radio\nemission.\n",
  "subjects": [
    "Astrophysics/Solar and Stellar Astrophysics",
    "Physics/Space Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "vvfh-WqAAEwPDPtVZtIqAdF0gEcA7PuUjIFZjNd8hc0",
  "pdfSize": "3993023"
}