{"id":"2412.04154","title":"On unipolar and bipolar HiPIMS pulse configurations to enhance energy\n  flux to insulating surfaces","authors":"M. Farahani, T. Koz\\'ak, A.D. Pajdarov\\'a, T. T\\\"olg, J. \\v{C}apek","authorsParsed":[["Farahani","M.",""],["Kozák","T.",""],["Pajdarová","A. D.",""],["Tölg","T.",""],["Čapek","J.",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 13:32:10 GMT"}],"updateDate":"2024-12-06","timestamp":1733405530000,"abstract":"  High-power impulse magnetron sputtering (HiPIMS) delivers a high target power\nin short pulses, enhancing the ionization and energy of sputtered atoms and\nproviding thus more possibilities to control the film properties. This study\nexplores the effect of various pulse configurations (unipolar HiPIMS, bipolar\nHiPIMS, chopped unipolar, and chopped bipolar HiPIMS) to increase energy flux\nto an insulated surface (e.g., substrate or growing film). The chopped bipolar\nHiPIMS configuration, featuring several short positive pulses replacing a\nsingle long positive pulse, is introduced, and the total energy fluxes are\nsubsequently measured using a passive thermal probe. Moreover, the effect of\nthe probe's capacitance with respect to the ground is systematically\ninvestigated by connecting an external capacitor. Results show that for an\ninsulated surface with low capacitance, bipolar pulse configurations do not\nsignificantly increase energy flux to the surface due to its rapid charging by\nplasma ions. Conversely, high surface capacitance facilitates an increase in\nenergy flux, as a large potential difference between the plasma and the surface\nremains even for a long positive pulse. For medium surface capacitance (tens of\nnF), chopping the positive pulse in bipolar HiPIMS effectively increases the\nenergy delivered to the film by discharging the surface in the off-times. The\nthermal probe measurements also confirm that energy to the film can be\nincreased for unipolar HiPIMS configurations by splitting the negative pulse\ninto several shorter pulses.\n","subjects":["Physics/Plasma Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"dehi0H1PDcZKuPHiYxm0p2kHJB-hoNMVMBvK-83jcQw","pdfSize":"2780219"}