{
  "id": "2412.16762",
  "title": "A Method for the Runtime Validation of AI-based Environment Perception\n  in Automated Driving System",
  "authors": "Iqra Aslam, Abhishek Buragohain, Daniel Bamal, Adina Aniculaesei, Meng\n  Zhang and Andreas Rausch",
  "authorsParsed": [
    [
      "Aslam",
      "Iqra",
      ""
    ],
    [
      "Buragohain",
      "Abhishek",
      ""
    ],
    [
      "Bamal",
      "Daniel",
      ""
    ],
    [
      "Aniculaesei",
      "Adina",
      ""
    ],
    [
      "Zhang",
      "Meng",
      ""
    ],
    [
      "Rausch",
      "Andreas",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 21 Dec 2024 20:21:49 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734812509000,
  "abstract": "  Environment perception is a fundamental part of the dynamic driving task\nexecuted by Autonomous Driving Systems (ADS). Artificial Intelligence\n(AI)-based approaches have prevailed over classical techniques for realizing\nthe environment perception. Current safety-relevant standards for automotive\nsystems, International Organization for Standardization (ISO) 26262 and ISO\n21448, assume the existence of comprehensive requirements specifications. These\nspecifications serve as the basis on which the functionality of an automotive\nsystem can be rigorously tested and checked for compliance with safety\nregulations. However, AI-based perception systems do not have complete\nrequirements specification. Instead, large datasets are used to train AI-based\nperception systems. This paper presents a function monitor for the functional\nruntime monitoring of a two-folded AI-based environment perception for ADS,\nbased respectively on camera and LiDAR sensors. To evaluate the applicability\nof the function monitor, we conduct a qualitative scenario-based evaluation in\na controlled laboratory environment using a model car. The evaluation results\nthen are discussed to provide insights into the monitor's performance and its\nsuitability for real-world applications.\n",
  "subjects": [
    "Computer Science/Robotics",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Software Engineering"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "GAYFBAf-epDF4C-0LDHayMwPBIOUp8BTBwxDkHpPRQ8",
  "pdfSize": "18215686"
}