{
  "id": "2412.08740",
  "title": "Multiple metamagnetic transitions in helical antiferromagnet CeVGe$_3$",
  "authors": "Hanshang Jin, Eun Sang Choi, Hung-Cheng Wu, N. J. Curro, K. Nawa, T.\n  J. Sato, R. Kiyanagi, T. Ohhara, Peter Klavins, and Valentin Taufour",
  "authorsParsed": [
    [
      "Jin",
      "Hanshang",
      ""
    ],
    [
      "Choi",
      "Eun Sang",
      ""
    ],
    [
      "Wu",
      "Hung-Cheng",
      ""
    ],
    [
      "Curro",
      "N. J.",
      ""
    ],
    [
      "Nawa",
      "K.",
      ""
    ],
    [
      "Sato",
      "T. J.",
      ""
    ],
    [
      "Kiyanagi",
      "R.",
      ""
    ],
    [
      "Ohhara",
      "T.",
      ""
    ],
    [
      "Klavins",
      "Peter",
      ""
    ],
    [
      "Taufour",
      "Valentin",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 19:18:25 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1733944705000,
  "abstract": "  We report on neutron diffraction, magnetoresistance, magnetization, and\nmagnetic torque measurements under high magnetic field in the helical\nantiferromagnet CeVGe$_3$. This compound exhibits Kondo lattice coherence and\nhelical antiferromagnetic (AFM) ordering at ambient pressure, similar to the\nwell-studied CeRhIn$_5$. Our measurements reveal that CeVGe$_3$ undergoes a\nmagnetic transition from an incommensurate (ICM) AFM state to an\nup-up-down-down commensurate (CM) AFM structure, followed by a transition to a\nnovel phase at higher fields. A quantum phase transition occurs around 21.3 T.\nThis rich magnetic field phase diagram closely resembles that of CeRhIn$_5$.\nFurthermore, angle-dependent magnetoresistance measurements reveal that all\ntransitions in CeVGe$_3$ occur from the field component along the $ab$ plane.\nThese findings highlight the intricate interplay among exchange interactions,\ncrystal field effects, ground state properties, and crystalline symmetries.\n",
  "subjects": [
    "Condensed Matter/Strongly Correlated Electrons"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "eWrdkgo1uLbDM3ch9554VQtJfTPU0gp_xEbBTHXq3_Y",
  "pdfSize": "1371689"
}