{
  "id": "2412.00564",
  "title": "Maximum Energy of Particles in Plasmas",
  "authors": "Mitsuo Oka, Kazuo Makishima, and Toshio Terasawa",
  "authorsParsed": [
    [
      "Oka",
      "Mitsuo",
      ""
    ],
    [
      "Makishima",
      "Kazuo",
      ""
    ],
    [
      "Terasawa",
      "Toshio",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 30 Nov 2024 19:37:32 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1732995452000,
  "abstract": "  Particles are accelerated to very high, non-thermal energies in space, solar,\nand astrophysical plasma environments. In cosmic ray physics, the \"Hillas\nlimit\" is often used as a rough estimate (or the necessary condition) of the\nmaximum energy of particles. This limit is based on the concepts of one-shot\ndirect acceleration by a system-wide motional electric field, as well as\nstochastic and diffusive acceleration in strongly turbulent environments.\nHowever, it remains unclear how well this limit explains the actual observed\nmaximum energies of particles. Here we show, based on a systematic review, that\nthe observed maximum energy of particles -- those in space, solar,\nastrophysical, and laboratory environments -- often reach the energy predicted\nby the Hillas limit. We also found several exceptions, such as electrons in\nsolar flares and jet-terminal lobes of radio galaxies, as well as protons in\nplanetary radiation belts, where deviations from this limit occur. We discuss\npossible causes of such deviations, and we argue in particular that there is a\ngood chance of detecting ultra-high-energy ($\\sim$100 GeV) solar flare\nelectrons that have not yet been detected. We anticipate that this study will\nfacilitate further interdisciplinary discussions on the maximum energy of\nparticles and the underlying mechanisms of particle acceleration in diverse\nplasma environments.\n",
  "subjects": [
    "Astrophysics/High Energy Astrophysical Phenomena",
    "Astrophysics/Earth and Planetary Astrophysics",
    "Astrophysics/Solar and Stellar Astrophysics",
    "Physics/Plasma Physics",
    "Physics/Space Physics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "TAG3zNm0kP7TWpiSE49KbRpqgoA0EKp22Z7X9v0XAaU",
  "pdfSize": "850111"
}