{
  "id": "2412.03821",
  "title": "Observational properties of 155 O- and B-type massive pulsating stars",
  "authors": "Xiang-dong Shi, Sheng-bang Qian, Li-ying Zhu, Liang Liu, Lin-jia Li,\n  Lei Zang",
  "authorsParsed": [
    [
      "Shi",
      "Xiang-dong",
      ""
    ],
    [
      "Qian",
      "Sheng-bang",
      ""
    ],
    [
      "Zhu",
      "Li-ying",
      ""
    ],
    [
      "Liu",
      "Liang",
      ""
    ],
    [
      "Li",
      "Lin-jia",
      ""
    ],
    [
      "Zang",
      "Lei",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 02:31:36 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733365896000,
  "abstract": "  The O- and B-type (OB-type) pulsating stars are important objects to study\nthe structure and evolution of massive stars through asteroseismology. A large\namount of data from various sky surveys provide an unprecedented opportunity to\nsearch for and study this kind of variable star. We identify 155 OB-type\npulsating stars or candidates, including 38 Oe/Be stars or candidates, from the\ndata observed by TESS, LAMOST, and GAIA, which are almost new. Among the 155\nobjects, 87 samples are identified as SPB stars including 37 objects with pure\nlow-frequency and 50 objects with both low- and high-frequency pulsation, and\n14 samples are identified as BCEP stars with both low- and high-frequency\npulsation. The H-R diagram shows that these SPB and BCEP stars are mainly\nlocated in their instability regions and in the evolutionary stage of the\nmain-sequence with a mass range of 2.5-20 $M_{\\odot}$ and 7-20 $M_{\\odot}$. Two\nspecial objects show fourier spectra similar to BCEP stars but with different\npositions in H-R, Period-Temperature (P-T), and Period-Luminosity (P-L)\ndiagrams. Meanwhile, 52 other targets are identified as candidates of OB-type\npulsating stars. We also derive the preliminary results of the P-L relation for\nSPB and BCEP stars, respectively. This work also indicates that in addition to\nthe H-R diagram, P-T and P-L diagrams are also very useful for the\nclassification of SPB and BCEP. Further detailed analysis of these objects can\ndramatically increase our understanding of theories of evolution and structure\nfor massive OB-type pulsating stars.\n",
  "subjects": [
    "Astrophysics/Solar and Stellar Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Mk5y3E43VL0XhHQKCXWV4rLmM_Ej_5w1wd0ukDkDsgk",
  "pdfSize": "6527620"
}