{"id":"2412.06562","title":"Towards novel tunability schemes for hybrid ferromagnetic transmon\n  qubits","authors":"Halima Giovanna Ahmad, Raffaella Ferraiuolo, Giuseppe Serpico, Roberta\n  Satariano, Anna Levochkina, Antonio Vettoliere, Carmine Granata, Domenico\n  Montemurro, Martina Esposito, Giovanni Ausanio, Loredana Parlato, Giovanni\n  Piero Pepe, Alessandro Bruno, Francesco Tafuri, Davide Massarotti","authorsParsed":[["Ahmad","Halima Giovanna",""],["Ferraiuolo","Raffaella",""],["Serpico","Giuseppe",""],["Satariano","Roberta",""],["Levochkina","Anna",""],["Vettoliere","Antonio",""],["Granata","Carmine",""],["Montemurro","Domenico",""],["Esposito","Martina",""],["Ausanio","Giovanni",""],["Parlato","Loredana",""],["Pepe","Giovanni Piero",""],["Bruno","Alessandro",""],["Tafuri","Francesco",""],["Massarotti","Davide",""]],"versions":[{"version":"v1","created":"Mon, 9 Dec 2024 15:13:59 GMT"}],"updateDate":"2024-12-10","timestamp":1733757239000,"abstract":"  Flux tuning of qubit frequencies in superconducting quantum processors is\nfundamental for implementing single and multi-qubit gates in quantum\nalgorithms. Typical architectures involve the use of DC or fast RF lines.\nHowever, these lines introduce significant heat dissipation and undesirable\ndecoherence mechanisms, leading to a severe bottleneck for scalability. Among\ndifferent solutions to overcome this issue, we propose integrating tunnel\nSuperconductor-Insulating-thin superconducting\ninterlayer-Ferromagnet-Superconductor Josephson junctions (SIsFS JJs) into a\nnovel transmon qubit design, the so-called ferrotransmon. SIsFS JJs provide\nmemory properties due to the presence of ferromagnetic barriers and preserve at\nthe same time the low-dissipative behavior of tunnel-insulating JJs, thus\npromoting an alternative tuning of the qubit frequency. In this work, we\ndiscuss the fundamental steps towards the implementation of this hybrid\nferromagnetic transmon. We will give a special focus on the design,\nsimulations, and preliminary experimental characterization of superconducting\nlines to provide in-plane magnetic fields, fundamental for an on-chip control\nof the qubit frequencies in the ferrotransmon.\n","subjects":["Condensed Matter/Superconductivity","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"g8Il2KUQMKfGhFP_6rf8EljDUHUPVXeVqW4EDK8sHJ4","pdfSize":"2452890"}