{
  "id": "2412.17570",
  "title": "Finite Temperature Quarkonia Spectral Functions in the Pseudoscalar\n  Channel",
  "authors": "Dibyendu Bala, Sajid Ali, Olaf Kaczmarek, Pavan",
  "authorsParsed": [
    [
      "Bala",
      "Dibyendu",
      ""
    ],
    [
      "Ali",
      "Sajid",
      ""
    ],
    [
      "Kaczmarek",
      "Olaf",
      ""
    ],
    [
      "Pavan",
      "",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 13:43:39 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734961419000,
  "abstract": "  Quarkonia, the bound states of heavy quark-antiquark pairs, are important\ntools for studying the quark-gluon plasma (QGP). In this study, we examine the\nbehavior of in-medium quarkonium bound states in the QGP by analyzing their\nspectral functions at two temperatures, $T = 220\\,\\textrm{MeV}$ and $T =\n293\\,\\textrm{MeV}$. We use physics-motivated information to reconstruct the\nspectral function from the Euclidean lattice correlator. Near the threshold,\nthe spectral function is estimated through a complex potential, determined\nnon-perturbatively from Wilson line correlators. Our results show that the real\npart of the potential undergoes color screening above $T_{pc}$, while the\nimaginary part grows rapidly with increasing distance and temperature. For the\nultraviolet (UV) part of the spectral function, we use the perturbative vacuum\nspectral function, as the temperature effects are suppressed in this region. In\nthe absence of a transport peak in the pseudoscalar channel, we find that this\ncombination effectively describes the pseudoscalar correlator on the lattice,\ncalculated using relativistic quark fields. Our results show that pseudoscalar\ncharmonium ($\\eta_c$) experiences significant thermal effects, as indicated by\nthe broadening of the $\\eta_c(1S)$ state. In contrast, the $\\eta_b(1S)$ state\nremains intact, with a sharp bound state peak.\n",
  "subjects": [
    "Physics/High Energy Physics - Lattice",
    "Physics/High Energy Physics - Phenomenology",
    "Physics/Nuclear Experiment"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "oEoskhCg2Hkdi0wHY8mk54BQBzGmZnECb1N55uPTIEM",
  "pdfSize": "575100"
}