{
  "id": "2412.14023",
  "title": "Accounting for Noise and Singularities in Bayesian Calibration Methods\n  for Global 21-cm Cosmology Experiments",
  "authors": "Christian J. Kirkham, William J. Handley, Jiacong Zhu, Kaan Artuc, Ian\n  L. V. Roque, Samuel A. K. Leeney, Harry T. J. Bevins, Dominic J. Anstey and\n  Eloy de Lera Acedo",
  "authorsParsed": [
    [
      "Kirkham",
      "Christian J.",
      ""
    ],
    [
      "Handley",
      "William J.",
      ""
    ],
    [
      "Zhu",
      "Jiacong",
      ""
    ],
    [
      "Artuc",
      "Kaan",
      ""
    ],
    [
      "Roque",
      "Ian L. V.",
      ""
    ],
    [
      "Leeney",
      "Samuel A. K.",
      ""
    ],
    [
      "Bevins",
      "Harry T. J.",
      ""
    ],
    [
      "Anstey",
      "Dominic J.",
      ""
    ],
    [
      "Acedo",
      "Eloy de Lera",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 16:40:37 GMT"
    },
    {
      "version": "v2",
      "created": "Wed, 22 Jan 2025 13:17:03 GMT"
    }
  ],
  "updateDate": "2025-01-23",
  "timestamp": 1734540037000,
  "abstract": "  Due to the large dynamic ranges involved with separating the cosmological\n21-cm signal from the Cosmic Dawn from galactic foregrounds, a well-calibrated\ninstrument is essential to avoid biases from instrumental systematics. In this\npaper we present three methods for calibrating a global 21-cm cosmology\nexperiment using the noise wave parameter formalisation to characterise a low\nnoise amplifier including a careful consideration of how calibrator temperature\nnoise and singularities will bias the result. The first method presented in\nthis paper builds upon the existing conjugate priors method by weighting the\ncalibrators by a physically motivated factor, thereby avoiding singularities\nand normalising the noise. The second method fits polynomials to the noise wave\nparameters by marginalising over the polynomial coefficients and sampling the\npolynomial orders as parameters. The third method introduces a physically\nmotivated noise model to the marginalised polynomial method. Running these\nmethods on a suite of simulated datasets based on the REACH receiver design and\na lab dataset, we found that our methods produced a calibration solution which\nis equally as or more accurate than the existing conjugate priors method when\ncompared with an analytic estimate of the calibrator's noise. We find in the\ncase of the measured lab dataset the conjugate priors method is biased heavily\nby the large noise on the shorted load calibrator, resulting in incorrect noise\nwave parameter fits. This is mitigated by the methods introduced in this paper\nwhich calibrate the validation source spectra to within 5% of the noise floor.\n",
  "subjects": [
    "Astrophysics/Instrumentation and Methods for Astrophysics",
    "Astrophysics/Cosmology and Nongalactic Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "3Rc5iGuusAgU0Sha9D0NQHhGovwne8dr1Oe8heG3wGc",
  "pdfSize": "774072"
}