{"id":"2412.14471","title":"Why We Build Local Large Language Models: An Observational Analysis from\n  35 Japanese and Multilingual LLMs","authors":"Koshiro Saito, Sakae Mizuki, Masanari Ohi, Taishi Nakamura, Taihei\n  Shiotani, Koki Maeda, Youmi Ma, Kakeru Hattori, Kazuki Fujii, Takumi Okamoto,\n  Shigeki Ishida, Hiroya Takamura, Rio Yokota, Naoaki Okazaki","authorsParsed":[["Saito","Koshiro",""],["Mizuki","Sakae",""],["Ohi","Masanari",""],["Nakamura","Taishi",""],["Shiotani","Taihei",""],["Maeda","Koki",""],["Ma","Youmi",""],["Hattori","Kakeru",""],["Fujii","Kazuki",""],["Okamoto","Takumi",""],["Ishida","Shigeki",""],["Takamura","Hiroya",""],["Yokota","Rio",""],["Okazaki","Naoaki",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 02:39:26 GMT"}],"updateDate":"2024-12-20","timestamp":1734575966000,"abstract":"  Why do we build local large language models (LLMs)? What should a local LLM\nlearn from the target language? Which abilities can be transferred from other\nlanguages? Do language-specific scaling laws exist? To explore these research\nquestions, we evaluated 35 Japanese, English, and multilingual LLMs on 19\nevaluation benchmarks for Japanese and English, taking Japanese as a local\nlanguage. Adopting an observational approach, we analyzed correlations of\nbenchmark scores, and conducted principal component analysis (PCA) on the\nscores to derive \\textit{ability factors} of local LLMs. We found that training\non English text can improve the scores of academic subjects in Japanese\n(JMMLU). In addition, it is unnecessary to specifically train on Japanese text\nto enhance abilities for solving Japanese code generation, arithmetic\nreasoning, commonsense, and reading comprehension tasks. In contrast, training\non Japanese text could improve question-answering tasks about Japanese\nknowledge and English-Japanese translation, which indicates that abilities for\nsolving these two tasks can be regarded as \\textit{Japanese abilities} for\nLLMs. Furthermore, we confirmed that the Japanese abilities scale with the\ncomputational budget for Japanese text.\n","subjects":["Computer Science/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"s7l4CFitCk1JJiXIrEdFcXxV-CRb2MCMm5Hruj_zDlQ","pdfSize":"6264106"}