{"id":"2412.00900","title":"An AMReX-based Compressible Reacting Flow Solver for High-speed Reacting\n  Flows relevant to Hypersonic Propulsion","authors":"Shivank Sharma, Ral Bielawski, Oliver Gibson, Shuzhi Zhang, Vansh\n  Sharma, Andreas H. Rauch, Jagmohan Singh, Sebastian Abisleiman, Michael\n  Ullman, Shivam Barwey, Venkat Raman","authorsParsed":[["Sharma","Shivank",""],["Bielawski","Ral",""],["Gibson","Oliver",""],["Zhang","Shuzhi",""],["Sharma","Vansh",""],["Rauch","Andreas H.",""],["Singh","Jagmohan",""],["Abisleiman","Sebastian",""],["Ullman","Michael",""],["Barwey","Shivam",""],["Raman","Venkat",""]],"versions":[{"version":"v1","created":"Sun, 1 Dec 2024 17:24:22 GMT"}],"updateDate":"2024-12-03","timestamp":1733073862000,"abstract":"  This work presents a comprehensive framework for the efficient implementation\nof finite-volume-based reacting flow solvers, specifically tailored for high\nspeed propulsion applications. Using the exascale computing project (ECP) based\nAMReX framework, a compressible flow solver for handling high-speed reacting\nflows is developed. This work is complementary to the existing PeleC solver,\nemphasizing specific applications that include confined shock-containing flows,\nstationary and moving shocks and detonations. The framework begins with a\ndetailed exposition of the numerical methods employed, emphasizing their\napplication to complex geometries and their effectiveness in ensuring accurate\nand stable numerical simulations. Subsequently, an in-depth analysis evaluates\nthe solver's performance across canonical and practical geometries, with\nparticular focus on computational cost and efficiency. The solver's scalability\nand robustness are demonstrated through practical test cases, including flow\npath simulations of scramjet engines and detailed analysis of various\ndetonation phenomena.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"mk3tqSQdAsz1_r8xzitzRSaJH3_ySTE_msbpY_BNng8","pdfSize":"26318847"}