{
  "id": "2412.09786",
  "title": "A class of nonparametric methods for evaluating the effect of continuous\n  treatments on survival outcomes",
  "authors": "Yutong Jin, Peter B. Gilbert, Aaron Hudson",
  "authorsParsed": [
    [
      "Jin",
      "Yutong",
      ""
    ],
    [
      "Gilbert",
      "Peter B.",
      ""
    ],
    [
      "Hudson",
      "Aaron",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 01:58:08 GMT"
    }
  ],
  "updateDate": "2024-12-16",
  "timestamp": 1734055088000,
  "abstract": "  In randomized trials and observational studies, it is often necessary to\nevaluate the extent to which an intervention affects a time-to-event outcome,\nwhich is only partially observed due to right censoring. For instance, in\ninfectious disease studies, it is frequently of interest to characterize the\nrelationship between risk of acquisition of infection with a pathogen and a\nbiomarker previously measuring for an immune response against that pathogen\ninduced by prior infection and/or vaccination. It is common to conduct\ninference within a causal framework, wherein we desire to make inferences about\nthe counterfactual probability of survival through a given time point, at any\ngiven exposure level. To determine whether a causal effect is present, one can\nassess if this quantity differs by exposure level. Recent work shows that,\nunder typical causal assumptions, summaries of the counterfactual survival\ndistribution are identifiable. Moreover, when the treatment is multi-level,\nthese summaries are also pathwise differentiable in a nonparametric probability\nmodel, making it possible to construct estimators thereof that are unbiased and\napproximately normal. In cases where the treatment is continuous, the target\nestimand is no longer pathwise differentiable, rendering it difficult to\nconstruct well-behaved estimators without strong parametric assumptions. In\nthis work, we extend beyond the traditional setting with multilevel\ninterventions to develop approaches to nonparametric inference with a\ncontinuous exposure. We introduce methods for testing whether the\ncounterfactual probability of survival time by a given time-point remains\nconstant across the range of the continuous exposure levels. The performance of\nour proposed methods is evaluated via numerical studies, and we apply our\nmethod to data from a recent pair of efficacy trials of an HIV monoclonal\nantibody.\n",
  "subjects": [
    "Statistics/Methodology"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "_MpoCyfR8B-XeFLe0NlrJtLDGs--XoE47WnRQk7-dPo",
  "pdfSize": "530559"
}