{
  "id": "2412.07359",
  "title": "Characterization of Indoor RIS-Assisted Channels at 304 GHz:\n  Experimental Measurements, Challenges, and Future Directions",
  "authors": "George C. Alexandropoulos, Bo Kum Jung, Panagiotis Gavriilidis,\n  S\\'ergio Matos, Lorenz H. W. Loeser, Varvara Elesina, Antonio Clemente,\n  Raffaele D'Errico, Lu\\'is M. Pessoa, and Thomas K\\\"urner",
  "authorsParsed": [
    [
      "Alexandropoulos",
      "George C.",
      ""
    ],
    [
      "Jung",
      "Bo Kum",
      ""
    ],
    [
      "Gavriilidis",
      "Panagiotis",
      ""
    ],
    [
      "Matos",
      "Sérgio",
      ""
    ],
    [
      "Loeser",
      "Lorenz H. W.",
      ""
    ],
    [
      "Elesina",
      "Varvara",
      ""
    ],
    [
      "Clemente",
      "Antonio",
      ""
    ],
    [
      "D'Errico",
      "Raffaele",
      ""
    ],
    [
      "Pessoa",
      "Luís M.",
      ""
    ],
    [
      "Kürner",
      "Thomas",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 09:55:05 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733824505000,
  "abstract": "  Reconfigurable Intelligent Surfaces (RISs) are expected to play a pivotal\nrole in future indoor ultra high data rate wireless communications as well as\nhighly accurate three-dimensional localization and sensing, mainly due to their\ncapability to provide flexible, cost- and power-efficient coverage extension,\neven under blockage conditions. However, when considering beyond millimeter\nwave frequencies where there exists GHz-level available bandwidth, realistic\nmodels of indoor RIS-parameterized channels verified by field-trial\nmeasurements are unavailable. In this article, we first present and\ncharacterize three RIS prototypes with $100\\times100$ unit cells of\nhalf-wavelength inter-cell spacing, which were optimized to offer a specific\nnon-specular reflection with $1$-, $2$-, and $3$-bit phase quantization at\n$304$ GHz. The designed static RISs were considered in an indoor channel\nmeasurement campaign carried out with a $304$ GHz channel sounder. Channel\nmeasurements for two setups, one focusing on the transmitter-RIS-receiver path\ngain and the other on the angular spread of multipath components, are presented\nand compared with both state-of-the-art theoretical models as well as full-wave\nsimulation results. The article is concluded with a list of challenges and\nresearch directions for RIS design and modeling of RIS-parameterized channels\nat THz frequencies.\n",
  "subjects": [
    "Computer Science/Information Theory",
    "Computer Science/Emerging Technologies",
    "Mathematics/Information Theory"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "GF8immBxdx1Y_AwLdPN9_pRf-Ca4HaVyOahvKcbL01w",
  "pdfSize": "1711483"
}