{
  "id": "2412.11505",
  "title": "Fast Reflected Forward-Backward algorithm: achieving fast convergence\n  rates for convex optimization with linear cone constraints",
  "authors": "Radu Ioan Bot, Dang-Khoa Nguyen, Chunxiang Zong",
  "authorsParsed": [
    [
      "Bot",
      "Radu Ioan",
      ""
    ],
    [
      "Nguyen",
      "Dang-Khoa",
      ""
    ],
    [
      "Zong",
      "Chunxiang",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 07:28:06 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734334086000,
  "abstract": "  In this paper, we derive a Fast Reflected Forward-Backward (Fast RFB)\nalgorithm to solve the problem of finding a zero of the sum of a maximally\nmonotone operator and a monotone and Lipschitz continuous operator in a real\nHilbert space. Our approach extends the class of reflected forward-backward\nmethods by introducing a Nesterov momentum term and a correction term,\nresulting in enhanced convergence performance. The iterative sequence of the\nproposed algorithm is proven to converge weakly, and the Fast RFB algorithm\ndemonstrates impressive convergence rates, achieving $o\\left( \\frac{1}{k}\n\\right)$ as $k \\to +\\infty$ for both the discrete velocity and the tangent\nresidual at the \\emph{last-iterate}. When applied to minimax problems with a\nsmooth coupling term and nonsmooth convex regularizers, the resulting algorithm\ndemonstrates significantly improved convergence properties compared to the\ncurrent state of the art in the literature. For convex optimization problems\nwith linear cone constraints, our approach yields a fully splitting primal-dual\nalgorithm that ensures not only the convergence of iterates to a primal-dual\nsolution, but also a \\emph{last-iterate} convergence rate of $o\\left(\n\\frac{1}{k} \\right)$ as $k \\to +\\infty$ for the objective function value,\nfeasibility measure, and complementarity condition. This represents the most\ncompetitive theoretical result currently known for algorithms addressing this\nclass of optimization problems. Numerical experiments are performed to\nillustrate the convergence behavior of Fast RFB.\n",
  "subjects": [
    "Mathematics/Optimization and Control"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "8AtpMmGb677xgDlze4BleeJp09pybMzBbZuYViZGLX4",
  "pdfSize": "1886555"
}