{
  "id": "2412.14517",
  "title": "Toward Understanding the Evolutionary Role of Star-forming Lenticular\n  Galaxies: New HI Detections and Comparison with Quiescent S0s and Red Spirals",
  "authors": "Pei-Bin Chen, Junfeng Wang, Tian-Wen Cao, Mengting Shen, and Xiaoyu Xu",
  "authorsParsed": [
    [
      "Chen",
      "Pei-Bin",
      ""
    ],
    [
      "Wang",
      "Junfeng",
      ""
    ],
    [
      "Cao",
      "Tian-Wen",
      ""
    ],
    [
      "Shen",
      "Mengting",
      ""
    ],
    [
      "Xu",
      "Xiaoyu",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 04:33:05 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734582785000,
  "abstract": "  As one type of blue early-type galaxies, the evolutionary history and fate of\nstar-forming lenticular galaxies (S0s) remain elusive. We selected 134\nstar-forming S0s from the SDSS-IV MaNGA survey and found that they have steep\nand warped size-mass relations, similar to quiescent S0s and red spirals,\nindicating that they may have similar gas dissipation scenarios. These galaxies\nhave a higher central stellar mass surface density than normal blue spirals.\nThe radial profiles of $D_{\\rm n}4000$ and [Mgb/Fe] show that red spirals and\nquiescent S0s have similar old central populations and high [Mgb/Fe] values,\nsuggesting rapid bulge formation, though red spirals exhibit a steeper gradient\npossibly due to residual star formation (SF) in outer regions. In contrast,\nstar-forming S0s exhibit profiles between quiescent S0s/red spirals and normal\nblue spirals, with relatively flat $D_{\\rm n}4000$ and [Mgb/Fe] gradients. More\nlong-term SF history causes normal blue spirals to have very flat $D_{\\rm\nn}4000$ and [Mgb/Fe] profiles, and the majority of them (79 $\\pm$ 5 $\\%$) have\nS$\\acute{\\rm e}$rsic index $<$ 2. We also found that the halo mass of\nstar-forming S0s resembles that of quiescent S0s/red spirals, with 82 $\\pm$ 5\n$\\%$ exceeding the critical mass ($M_{\\rm halo} = 10^{12}$$M_{\\odot}$h$^{-1}$).\nTo supplement previous H\\,{\\sc i} detection of star-forming S0s covered by\nH\\,{\\sc i}MaNGA, we obtained new observation for H\\,{\\sc i} emission from 41\nstar-forming S0s in our sample using the Five-hundred-meter Aperture Spherical\nRadio Telescope. We found that the H\\,{\\sc i} mass distribution of star-forming\nS0s matches that of normal blue spirals, although both star-forming S0s and red\nspirals are relatively gas-poor, resulting in varying atomic gas depletion\ntimes due to different SF levels. Based on these observational results, we\ndiscuss the possible evolutionary scenarios of star-forming S0s.\n",
  "subjects": [
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "8qS2DcOW5b9cuJYS6Qx9FsZLAP7qL-Pd4bJ_MA0Geoo",
  "pdfSize": "6236764"
}