{"id":"2412.14221","title":"Improving diabetic retinopathy screening using Artificial Intelligence:\n  design, evaluation and before-and-after study of a custom development","authors":"Imanol Pinto, \\'Alvaro Olazar\\'an, David Jur\\'io, Borja de la Osa,\n  Miguel Sainz, Aritz Oscoz, Jer\\'onimo Ballaz, Javier Gorricho, Mikel Galar\n  and Jos\\'e Andonegui","authorsParsed":[["Pinto","Imanol",""],["Olazarán","Álvaro",""],["Jurío","David",""],["de la Osa","Borja",""],["Sainz","Miguel",""],["Oscoz","Aritz",""],["Ballaz","Jerónimo",""],["Gorricho","Javier",""],["Galar","Mikel",""],["Andonegui","José",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 14:39:57 GMT"}],"updateDate":"2024-12-20","timestamp":1734532797000,"abstract":"  Background: The worst outcomes of diabetic retinopathy (DR) can be prevented\nby implementing DR screening programs assisted by AI. At the University\nHospital of Navarre (HUN), Spain, general practitioners (GPs) grade fundus\nimages in an ongoing DR screening program, referring to a second screening\nlevel (ophthalmologist) target patients.\n  Methods: After collecting their requirements, HUN decided to develop a custom\nAI tool, called NaIA-RD, to assist their GPs in DR screening. This paper\nintroduces NaIA-RD, details its implementation, and highlights its unique\ncombination of DR and retinal image quality grading in a single system. Its\nimpact is measured in an unprecedented before-and-after study that compares\n19,828 patients screened before NaIA-RD's implementation and 22,962 patients\nscreened after.\n  Results: NaIA-RD influenced the screening criteria of 3/4 GPs, increasing\ntheir sensitivity. Agreement between NaIA-RD and the GPs was high for\nnon-referral proposals (94.6% or more), but lower and variable (from 23.4\\% to\n86.6%) for referral proposals. An ophthalmologist discarded a NaIA-RD error in\nmost of contradicted referral proposals by labeling the 93% of a sample of them\nas referable. In an autonomous setup, NaIA-RD would have reduced the study\nvisualization workload by 4.27 times without missing a single case of\nsight-threatening DR referred by a GP.\n  Conclusion: DR screening was more effective when supported by NaIA-RD, which\ncould be safely used to autonomously perform the first level of screening. This\nshows how AI devices, when seamlessly integrated into clinical workflows, can\nhelp improve clinical pathways in the long term.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"VnE8AGxh4t7o8ha67s3TOyoT943U8IPKBJEYbcuORVs","pdfSize":"9671120"}