{
  "id": "2412.07835",
  "title": "Baryonic Ecosystem in Galaxies (BEINGMgII). Host Galaxies of\n  Ultra-strong MgII Absorbers in Subaru Hyper Suprime-Cam Survey",
  "authors": "Ravi Joshi (IIA), Sarbeswar Das, Michele Fumagalli, Matteo Fossati,\n  C\\'eline P\\'eroux, Reena Chaudhary, Hassen M. Yesuf, and Luis C. Ho",
  "authorsParsed": [
    [
      "Joshi",
      "Ravi",
      "",
      "IIA"
    ],
    [
      "Das",
      "Sarbeswar",
      ""
    ],
    [
      "Fumagalli",
      "Michele",
      ""
    ],
    [
      "Fossati",
      "Matteo",
      ""
    ],
    [
      "Péroux",
      "Céline",
      ""
    ],
    [
      "Chaudhary",
      "Reena",
      ""
    ],
    [
      "Yesuf",
      "Hassen M.",
      ""
    ],
    [
      "Ho",
      "Luis C.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 19:00:01 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733857201000,
  "abstract": "  We study the galaxies hosting ultra-strong MgII (USMgII) absorbers at small\nimpact parameters of $\\sim$2\" (5 - 20 kpc), spanning a redshift range of $0.4\n\\le z \\le 1.7$, using deep, high-resolution images from Hyper Suprime-Cam\nSubaru Strategic Survey and spectra from SDSS survey. From a total of 418\nUSMgII absorbers with $W_{2796}\\ \\ge 3 \\mathring{A}$, along 412 quasar\nsightlines, we detect 50 galaxies based on [O II] $\\lambda\\lambda$3727,3729\nnebular emission detected at $\\ge 2\\sigma$ level. Utilizing the [O II] emission\nfrom the stacked spectrum and employing the best-fit galaxy SED template, we\nfurther identify 86 galaxies, leading to a total of 136 bona fide USMgII\ngalaxies. With a prerequisite of having a minimum of four HSC passbands\navailable, we find a detection rate of $\\sim$38% at an average impact parameter\nof 11.4 kpc. We find that galaxies hosting USMgII systems are typically\nstar-forming main sequence galaxies, with 21% exhibiting a starburst nature.\nThe non-zero [O II] emission along the `clear' sightlines, with no stellar\ncounterpart, hints that the USMgII absorbers may likely emanate from the unseen\nfaint galaxies near the quasar. The USMgII absorbers preferentially align along\nthe major and minor axes of the galaxy, which suggests that they originate in\nthe disk or large-scale wind. We show that the distribution of $W_{2796}$ as a\nfunction of impact parameter indicates a discernible radial dependence for the\n`disk' and `wind' subsets, with the observed large scatter in $W_{2796}$\npotentially attributed to large-scale outflows. The quasar sightline hosting\nUSMgII systems show a factor three higher galaxy surface density at impact\nparameters of $\\lesssim 50$kpc, highlights the multiple pathways giving rise to\nUSMgII absorption.\n",
  "subjects": [
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "OEZmmMvwi6Hr09wWwisQcxfVBASYCx2XOjMmPV_Gr0A",
  "pdfSize": "30854370"
}