{
  "id": "2412.14337",
  "title": "Commitment to Sparse Strategies in Two-Player Games",
  "authors": "Salam Afiouni, Jakub \\v{C}ern\\'y, Chun Kai Ling, Christian Kroer",
  "authorsParsed": [
    [
      "Afiouni",
      "Salam",
      ""
    ],
    [
      "Černý",
      "Jakub",
      ""
    ],
    [
      "Ling",
      "Chun Kai",
      ""
    ],
    [
      "Kroer",
      "Christian",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 21:09:22 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734556162000,
  "abstract": "  While Nash equilibria are guaranteed to exist, they may exhibit dense\nsupport, making them difficult to understand and execute in some applications.\nIn this paper, we study $k$-sparse commitments in games where one player is\nrestricted to mixed strategies with support size at most $k$. Finding\n$k$-sparse commitments is known to be computationally hard. We start by showing\nseveral structural properties of $k$-sparse solutions, including that the\noptimal support may vary dramatically as $k$ increases. These results suggest\nthat naive greedy or double-oracle-based approaches are unlikely to yield\npractical algorithms. We then develop a simple approach based on mixed integer\nlinear programs (MILPs) for zero-sum games, general-sum Stackelberg games, and\nvarious forms of structured sparsity. We also propose practical algorithms for\ncases where one or both players have large (i.e., practically innumerable)\naction sets, utilizing a combination of MILPs and incremental strategy\ngeneration. We evaluate our methods on synthetic and real-world scenarios based\non security applications. In both settings, we observe that even for small\nsupport sizes, we can obtain more than $90\\%$ of the true Nash value while\nmaintaining a reasonable runtime, demonstrating the significance of our\nformulation and algorithms.\n",
  "subjects": [
    "Computer Science/Computer Science and Game Theory"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "HcgyOye2rlalP7XcUqAUaagndHgGx8CRF9OowJWpLug",
  "pdfSize": "1684899"
}