{"id":"2412.00933","title":"Fuzzy Galaxies or Cirrus? Decomposition of Galactic Cirrus in Deep\n  Wide-Field Images","authors":"Qing Liu, Roberto Abraham, Peter G. Martin, William P. Bowman, Pieter\n  van Dokkum, Shany Danieli, Ekta Patel, Steven R. Janssens, Zili Shen, Seery\n  Chen, Ananthan Karunakaran, Michael A. Keim, Deborah Lokhorst, Imad Pasha,\n  Douglas L. Welch","authorsParsed":[["Liu","Qing",""],["Abraham","Roberto",""],["Martin","Peter G.",""],["Bowman","William P.",""],["van Dokkum","Pieter",""],["Danieli","Shany",""],["Patel","Ekta",""],["Janssens","Steven R.",""],["Shen","Zili",""],["Chen","Seery",""],["Karunakaran","Ananthan",""],["Keim","Michael A.",""],["Lokhorst","Deborah",""],["Pasha","Imad",""],["Welch","Douglas L.",""]],"versions":[{"version":"v1","created":"Sun, 1 Dec 2024 18:54:05 GMT"},{"version":"v2","created":"Wed, 4 Dec 2024 17:45:48 GMT"},{"version":"v3","created":"Mon, 3 Feb 2025 10:37:07 GMT"}],"updateDate":"2025-02-04","timestamp":1733079245000,"abstract":"  Diffuse Galactic cirrus, or Diffuse Galactic Light (DGL), can be a prominent\ncomponent in the background of deep wide-field imaging surveys. The DGL\nprovides unique insights into the physical and radiative properties of dust\ngrains in our Milky Way, and it also serves as a contaminant on deep images,\nobscuring the detection of background sources such as low surface brightness\ngalaxies. However, it is challenging to disentangle the DGL from other\ncomponents of the night sky. In this paper, we present a technique for the\nphotometric characterization of Galactic cirrus, based on (1) extraction of its\nfilamentary or patchy morphology and (2) incorporation of color constraints\nobtained from Planck thermal dust models. Our decomposition method is\nillustrated using a $\\sim$10 deg$^2$ imaging dataset obtained by the Dragonfly\nTelephoto Array, and its performance is explored using various metrics which\ncharacterize the flatness of the sky background. As a concrete application of\nthe technique, we show how removal of cirrus allows low surface brightness\ngalaxies to be identified on cirrus-rich images. We also show how modeling the\ncirrus in this way allows optical DGL intensities to be determined with high\nradiometric precision.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"nyAbTsmWj7yvqG3nweAWJFECfiUkLJyrEotj2Ah5nNM","pdfSize":"10256201"}