{"id":"2412.02801","title":"Optimization of Transformer heart disease prediction model based on\n  particle swarm optimization algorithm","authors":"Jingyuan Yi, Peiyang Yu, Tianyi Huang, Zeqiu Xu","authorsParsed":[["Yi","Jingyuan",""],["Yu","Peiyang",""],["Huang","Tianyi",""],["Xu","Zeqiu",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 20:04:32 GMT"},{"version":"v2","created":"Sat, 7 Dec 2024 09:04:39 GMT"},{"version":"v3","created":"Tue, 7 Jan 2025 10:09:18 GMT"}],"updateDate":"2025-01-08","timestamp":1733256272000,"abstract":"  Aiming at the latest particle swarm optimization algorithm, this paper\nproposes an improved Transformer model to improve the accuracy of heart disease\nprediction and provide a new algorithm idea. We first use three mainstream\nmachine learning classification algorithms - decision tree, random forest and\nXGBoost, and then output the confusion matrix of these three models. The\nresults showed that the random forest model had the best performance in\npredicting the classification of heart disease, with an accuracy of 92.2%.\nThen, we apply the Transformer model based on particle swarm optimization (PSO)\nalgorithm to the same dataset for classification experiment. The results show\nthat the classification accuracy of the model is as high as 96.5%, 4.3\npercentage points higher than that of random forest, which verifies the\neffectiveness of PSO in optimizing Transformer model. From the above research,\nwe can see that particle swarm optimization significantly improves Transformer\nperformance in heart disease prediction. Improving the ability to predict heart\ndisease is a global priority with benefits for all humankind. Accurate\nprediction can enhance public health, optimize medical resources, and reduce\nhealthcare costs, leading to healthier populations and more productive\nsocieties worldwide. This advancement paves the way for more efficient health\nmanagement and supports the foundation of a healthier, more resilient global\ncommunity.\n","subjects":["Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"xScRpnw7pac7F-SmUka8g_XCyEHPESwutOaSkZc8ynM","pdfSize":"948381"}