{"id":"2412.11703","title":"Differentiating Confined from Adsorbed Water in Single-Walled Carbon\n  Nanotubes via Electronic Transport","authors":"Said Pashayev, Romain Lhermerout, Christophe Roblin, Eric Alibert,\n  Remi Jelinek, Nicolas Izard, Rasim Jabbarov, Francois Henn, and Adrien Noury","authorsParsed":[["Pashayev","Said",""],["Lhermerout","Romain",""],["Roblin","Christophe",""],["Alibert","Eric",""],["Jelinek","Remi",""],["Izard","Nicolas",""],["Jabbarov","Rasim",""],["Henn","Francois",""],["Noury","Adrien",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 12:26:23 GMT"}],"updateDate":"2024-12-17","timestamp":1734351983000,"abstract":"  In this article, we show that it is possible to differentiate between water\nadsorbed on the outside of a single-walled carbon nanotube and that confined\ninside. To this aim, we measured the electronic transport of a carbon nanotube\nbased field effect transistor (CNTFET) constructed with an isolated single\ncarbon nanotube subjected to controlled environments. More precisely, this\ndistinction is made possible by observing the evolution of the transfer\ncharacteristic as a function of the electric field imposed by the gate voltage.\nIt appears that the presence of water results in a displacement of the\nelectrical neutrality point, corresponding to a charge transfer between the\nnanotube and its environment. Using this approach, we demonstrate the existence\nof 3 types of water molecules: (i) chemically adsorbed on the\nSiO\\textsubscript{2} surface of the substrate, i.e., forming silanol groups;\n(ii) physically adsorbed outside next to the nanotube; and (iii) confined\ninside the nanotube. The first one can only be eliminated by high temperature\ntreatment under vacuum, the second one desorbs in a moderate vacuum at room\ntemperature, while the confined water can be removed at room temperature at\nhigher vacuum, i.e. $10^{-3}$ mbar. We also observe that both water adsorption\noutside and water confinement inside the nanotube are spontaneous and rather\nfast, i.e. less than 1 minute in our experimental conditions, while removing\nthe water adsorbed outside and confined inside takes much longer, i.e. 40-60\nminutes, thus indicating that water confinement is thermodynamically favorable.\nIt is also shown that the metallicity of the nanotube has no qualitative\ninfluence on its interaction with water. Our results experimentally prove the\nstronger affinity of water for the inner surface of CNT than for the outer one.\n","subjects":["Condensed Matter/Soft Condensed Matter"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"XCFqkIG7y6bi-sZ5gUbOLGEckw8xW9wskZFzcrMMGcY","pdfSize":"3128413"}