{"id":"2412.15637","title":"CrackUDA: Incremental Unsupervised Domain Adaptation for Improved Crack\n  Segmentation in Civil Structures","authors":"Kushagra Srivastava, Damodar Datta Kancharla, Rizvi Tahereen, Pradeep\n  Kumar Ramancharla, Ravi Kiran Sarvadevabhatla, Harikumar Kandath","authorsParsed":[["Srivastava","Kushagra",""],["Kancharla","Damodar Datta",""],["Tahereen","Rizvi",""],["Ramancharla","Pradeep Kumar",""],["Sarvadevabhatla","Ravi Kiran",""],["Kandath","Harikumar",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 07:55:08 GMT"}],"updateDate":"2024-12-23","timestamp":1734681308000,"abstract":"  Crack segmentation plays a crucial role in ensuring the structural integrity\nand seismic safety of civil structures. However, existing crack segmentation\nalgorithms encounter challenges in maintaining accuracy with domain shifts\nacross datasets. To address this issue, we propose a novel deep network that\nemploys incremental training with unsupervised domain adaptation (UDA) using\nadversarial learning, without a significant drop in accuracy in the source\ndomain. Our approach leverages an encoder-decoder architecture, consisting of\nboth domain-invariant and domain-specific parameters. The encoder learns shared\ncrack features across all domains, ensuring robustness to domain variations.\nSimultaneously, the decoder's domain-specific parameters capture\ndomain-specific features unique to each domain. By combining these components,\nour model achieves improved crack segmentation performance. Furthermore, we\nintroduce BuildCrack, a new crack dataset comparable to sub-datasets of the\nwell-established CrackSeg9K dataset in terms of image count and crack\npercentage. We evaluate our proposed approach against state-of-the-art UDA\nmethods using different sub-datasets of CrackSeg9K and our custom dataset. Our\nexperimental results demonstrate a significant improvement in crack\nsegmentation accuracy and generalization across target domains compared to\nother UDA methods - specifically, an improvement of 0.65 and 2.7 mIoU on source\nand target domains respectively.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"UVpPRWp35k2fvo3ZR6wmaCu88KpyPzyCmhxD1nWV6mI","pdfSize":"1266175"}