{
  "id": "2412.04039",
  "title": "Benchmarking and Enhancing Surgical Phase Recognition Models for\n  Robotic-Assisted Esophagectomy",
  "authors": "Yiping Li, Romy van Jaarsveld, Ronald de Jong, Jasper Bongers, Gino\n  Kuiper, Richard van Hillegersberg, Jelle Ruurda, Marcel Breeuwer, and Yasmina\n  Al Khalil",
  "authorsParsed": [
    [
      "Li",
      "Yiping",
      ""
    ],
    [
      "van Jaarsveld",
      "Romy",
      ""
    ],
    [
      "de Jong",
      "Ronald",
      ""
    ],
    [
      "Bongers",
      "Jasper",
      ""
    ],
    [
      "Kuiper",
      "Gino",
      ""
    ],
    [
      "van Hillegersberg",
      "Richard",
      ""
    ],
    [
      "Ruurda",
      "Jelle",
      ""
    ],
    [
      "Breeuwer",
      "Marcel",
      ""
    ],
    [
      "Khalil",
      "Yasmina Al",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 10:23:16 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733394196000,
  "abstract": "  Robotic-assisted minimally invasive esophagectomy (RAMIE) is a recognized\ntreatment for esophageal cancer, offering better patient outcomes compared to\nopen surgery and traditional minimally invasive surgery. RAMIE is highly\ncomplex, spanning multiple anatomical areas and involving repetitive phases and\nnon-sequential phase transitions. Our goal is to leverage deep learning for\nsurgical phase recognition in RAMIE to provide intraoperative support to\nsurgeons. To achieve this, we have developed a new surgical phase recognition\ndataset comprising 27 videos. Using this dataset, we conducted a comparative\nanalysis of state-of-the-art surgical phase recognition models. To more\neffectively capture the temporal dynamics of this complex procedure, we\ndeveloped a novel deep learning model featuring an encoder-decoder structure\nwith causal hierarchical attention, which demonstrates superior performance\ncompared to existing models.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Cg9rB8xkVtBW5Wr4sU5-0ikQ94FT9TGhXEbwyHdJqvc",
  "pdfSize": "2499921"
}