{
  "id": "2412.16276",
  "title": "SGAC: A Graph Neural Network Framework for Imbalanced and\n  Structure-Aware AMP Classification",
  "authors": "Yingxu Wang, Victor Liang, Nan Yin, Siwei Liu, Eran Segal",
  "authorsParsed": [
    [
      "Wang",
      "Yingxu",
      ""
    ],
    [
      "Liang",
      "Victor",
      ""
    ],
    [
      "Yin",
      "Nan",
      ""
    ],
    [
      "Liu",
      "Siwei",
      ""
    ],
    [
      "Segal",
      "Eran",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 17:17:57 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734715077000,
  "abstract": "  Classifying antimicrobial peptides(AMPs) from the vast array of peptides\nmined from metagenomic sequencing data is a significant approach to addressing\nthe issue of antibiotic resistance. However, current AMP classification\nmethods, primarily relying on sequence-based data, neglect the spatial\nstructure of peptides, thereby limiting the accurate classification of AMPs.\nAdditionally, the number of known AMPs is significantly lower than that of\nnon-AMPs, leading to imbalanced datasets that reduce predictive accuracy for\nAMPs. To alleviate these two limitations, we first employ Omegafold to predict\nthe three-dimensional spatial structures of AMPs and non-AMPs, constructing\npeptide graphs based on the amino acids' C$_\\alpha$ positions. Building upon\nthis, we propose a novel classification model named Spatial GNN-based AMP\nClassifier (SGAC). Our SGAC model employs a graph encoder based on Graph Neural\nNetworks (GNNs) to process peptide graphs, generating high-dimensional\nrepresentations that capture essential features from the three-dimensional\nspatial structure of amino acids. Then, to address the inherent imbalanced\ndatasets, SGAC first incorporates Weight-enhanced Contrastive Learning, which\nclusters similar peptides while ensuring separation between dissimilar ones,\nusing weighted contributions to emphasize AMP-specific features. Furthermore,\nSGAC employs Weight-enhanced Pseudo-label Distillation to dynamically generate\nhigh-confidence pseudo labels for ambiguous peptides, further refining\npredictions and promoting balanced learning between AMPs and non-AMPs.\nExperiments on publicly available AMP and non-AMP datasets demonstrate that\nSGAC significantly outperforms traditional sequence-based methods and achieves\nstate-of-the-art performance among graph-based models, validating its\neffectiveness in AMP classification.\n",
  "subjects": [
    "Quantitative Biology/Quantitative Methods",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Y_68ADQj1h1bBds0IAqhRZ-L-3qWYdTgRE-9rZ5suj0",
  "pdfSize": "7265412"
}