{
  "id": "2412.01511",
  "title": "Many-User Multiple Access with Random User Activity: Achievability\n  Bounds and Efficient Schemes",
  "authors": "Xiaoqi Liu and Pablo Pascual Cobo and Ramji Venkataramanan",
  "authorsParsed": [
    [
      "Liu",
      "Xiaoqi",
      ""
    ],
    [
      "Cobo",
      "Pablo Pascual",
      ""
    ],
    [
      "Venkataramanan",
      "Ramji",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 14:02:51 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733148171000,
  "abstract": "  We study the Gaussian multiple access channel with random user activity, in\nthe regime where the number of users is proportional to the code length. The\nreceiver may know some statistics about the number of active users, but does\nnot know the exact number nor the identities of the active users. We derive two\nachievability bounds on the probabilities of misdetection, false alarm, and\nactive user error, and propose an efficient CDMA-type scheme whose performance\ncan be compared against these bounds. The first bound is a finite-length result\nbased on Gaussian random codebooks and maximum-likelihood decoding. The second\nis an asymptotic bound, established using spatially coupled Gaussian codebooks\nand approximate message passing (AMP) decoding. These bounds can be used to\ncompute an achievable trade-off between the active user density and\nenergy-per-bit, for a fixed user payload and target error rate. The efficient\nCDMA scheme uses a spatially coupled signature matrix and AMP decoding, and we\ngive rigorous asymptotic guarantees on its error performance. Our analysis\nprovides the first state evolution result for spatially coupled AMP with\nmatrix-valued iterates, which may be of independent interest. Numerical\nexperiments demonstrate the promising error performance of the CDMA scheme for\nboth small and large user payloads, when compared with the two achievability\nbounds.\n",
  "subjects": [
    "Computer Science/Information Theory",
    "Mathematics/Information Theory"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "UH8QpuSoKGwWJha5UuPQ9c4nhs8tSZ6UePApM8cS8w0",
  "pdfSize": "2915347"
}