{
  "id": "2412.10908",
  "title": "Do large language vision models understand 3D shapes?",
  "authors": "Sagi Eppel",
  "authorsParsed": [
    [
      "Eppel",
      "Sagi",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 14 Dec 2024 17:35:27 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 17 Dec 2024 14:06:48 GMT"
    },
    {
      "version": "v3",
      "created": "Sun, 19 Jan 2025 23:02:47 GMT"
    }
  ],
  "updateDate": "2025-01-22",
  "timestamp": 1734197727000,
  "abstract": "  Large vision language models (LVLM) are the leading A.I approach for\nachieving a general visual understanding of the world. Models such as GPT,\nClaude, Gemini, and LLama can use images to understand and analyze complex\nvisual scenes. 3D objects and shapes are the basic building blocks of the\nworld, recognizing them is a fundamental part of human perception. The goal of\nthis work is to test whether LVLMs truly understand 3D shapes by testing the\nmodels ability to identify and match objects of the exact same 3D shapes but\nwith different orientations and materials/textures. A large number of test\nimages were created using CGI with a huge number of highly diverse objects,\nmaterials, and scenes. The results of this test show that the ability of such\nmodels to match 3D shapes is significantly below humans but much higher than\nrandom guesses. Suggesting that the models have gained some abstract\nunderstanding of 3D shapes but still trail far beyond humans in this task.\nMainly it seems that the models can easily identify the same object with a\ndifferent orientation as well as matching identical 3D shapes of the same\norientation but with different materials and textures. However, when both the\nobject material and orientation are changed, all models perform poorly relative\nto humans. Code and benchmark are available.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "oVN9dXyLQ6N4YXBAc4bapAk6hQG_op4oSDAXZhoyO6w",
  "pdfSize": "6940582"
}