{
  "id": "2412.12147",
  "title": "Meta-Controller: Few-Shot Imitation of Unseen Embodiments and Tasks in\n  Continuous Control",
  "authors": "Seongwoong Cho, Donggyun Kim, Jinwoo Lee, Seunghoon Hong",
  "authorsParsed": [
    [
      "Cho",
      "Seongwoong",
      ""
    ],
    [
      "Kim",
      "Donggyun",
      ""
    ],
    [
      "Lee",
      "Jinwoo",
      ""
    ],
    [
      "Hong",
      "Seunghoon",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 19:10:17 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1733857817000,
  "abstract": "  Generalizing across robot embodiments and tasks is crucial for adaptive\nrobotic systems. Modular policy learning approaches adapt to new embodiments\nbut are limited to specific tasks, while few-shot imitation learning (IL)\napproaches often focus on a single embodiment. In this paper, we introduce a\nfew-shot behavior cloning framework to simultaneously generalize to unseen\nembodiments and tasks using a few (\\emph{e.g.,} five) reward-free\ndemonstrations. Our framework leverages a joint-level input-output\nrepresentation to unify the state and action spaces of heterogeneous\nembodiments and employs a novel structure-motion state encoder that is\nparameterized to capture both shared knowledge across all embodiments and\nembodiment-specific knowledge. A matching-based policy network then predicts\nactions from a few demonstrations, producing an adaptive policy that is robust\nto over-fitting. Evaluated in the DeepMind Control suite, our framework termed\n\\modelname{} demonstrates superior few-shot generalization to unseen\nembodiments and tasks over modular policy learning and few-shot IL approaches.\nCodes are available at\n\\href{https://github.com/SeongwoongCho/meta-controller}{https://github.com/SeongwoongCho/meta-controller}.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Robotics"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "NZwgYputflhK_x_Qij2nXIkNvQwTj_T_yfw0lQJs6o8",
  "pdfSize": "12157770"
}