{
  "id": "2412.09214",
  "title": "Spectrally indistinguishable intermodal-vectorial four-wave-mixing in\n  birefringent few-mode fibers for spatial-polarization-frequency\n  hybrid-entangled photon-pairs generation",
  "authors": "Andrzej Gawlik, Marta Berna\\'s, Kinga \\.Zo{\\l}nacz and Karol Tarnowski",
  "authorsParsed": [
    [
      "Gawlik",
      "Andrzej",
      ""
    ],
    [
      "Bernaś",
      "Marta",
      ""
    ],
    [
      "Żołnacz",
      "Kinga",
      ""
    ],
    [
      "Tarnowski",
      "Karol",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 12:09:42 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1734005382000,
  "abstract": "  In this paper, we investigate both experimentally and theoretically the two\nintermodal-vectorial four-wave-mixing processes in birefringent few-mode\nfibers, which are spectrally indistinguishable. We show that two\nfour-wave-mixing processes involving the four polarization modes of different\nspatial distributions can overlap spectrally as long as the group refractive\nindices of the signal and idler modes intersect at the pump wavelength. The\nexperimental confirmation of theoretical predictions is performed with PANDA\nfiber pumped with an Nd:YAG laser with 1064.3 nm wavelength. The spectral\noverlap enables the hybrid-entanglement of photons in\nspatial-polarization-frequency degrees of freedom. Moreover, we discuss that\nthe spectral position of the overlapping FWMs can be tailored by: (i) the\nrelative phase birefringence of the four modes participating in the FWM or (ii)\nthe average chromatic dispersion of the signal/idler modes, allowing to move\nthe process away from detrimental Raman scattering. Interestingly, in the $\\pm$\n100 THz range from pump considered here, the gain of FWM depends primarily on\nthe integral overlap between the modes participating in the process and is\nvirtually wavelength-independent. This characteristic makes few-mode\nbirefringent fibers a promising platform for developing flat-gain, spectrally\ntailored sources of photon pairs entangled in multiple degrees of freedom.\n",
  "subjects": [
    "Physics/Optics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "6LfSYJ8t0xiXmUlCFyVTWXvYRpAROr5sxhUj6nWXSzI",
  "pdfSize": "825983"
}