{
  "id": "2412.10052",
  "title": "Non-resonant Optical Injection Locking in Quantum Cascade Laser\n  Frequency Combs",
  "authors": "Alexandre Parriaux, Kenichi N. Komagata, Mathieu Bertrand, Mattias\n  Beck, Valentin J. Wittwer, J\\'er\\^ome Faist, Thomas S\\\"udmeyer",
  "authorsParsed": [
    [
      "Parriaux",
      "Alexandre",
      ""
    ],
    [
      "Komagata",
      "Kenichi N.",
      ""
    ],
    [
      "Bertrand",
      "Mathieu",
      ""
    ],
    [
      "Beck",
      "Mattias",
      ""
    ],
    [
      "Wittwer",
      "Valentin J.",
      ""
    ],
    [
      "Faist",
      "Jérôme",
      ""
    ],
    [
      "Südmeyer",
      "Thomas",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 11:29:30 GMT"
    }
  ],
  "updateDate": "2024-12-16",
  "timestamp": 1734089370000,
  "abstract": "  Optical injection locking of the repetition frequency of a quantum cascade\nlaser frequency comb is demonstrated using an intensity modulated near-infrared\nlight at 1.55 $\\mu$m illuminating the front facet of the laser. Compared to the\ntraditional electrical modulation approach, the introduced technique presents\nbenefits from several perspectives such as the availability of mature and high\nbandwidth equipment in the near-infrared, circumvent the need of dedicated\nelectronic components for the quantum cascade laser, and allows a direct link\nbetween the near and mid-infrared for amplitude to frequency modulation. We\nshow that this stabilization scheme, used with a moderate near-infrared power\nof 5 mW, allows a tight lock to a radio-frequency generator with less than 1\nmrad residual phase noise at 1 s integration time. We also perform a full\ncharacterization of the mechanism and evidence that the locking range follows\nAdler's law. A comparison with our recent characterization of the traditional\nmethod indicates that the optical approach could potentially lead to lower\nphase noise, which would benefit mid-infrared spectroscopy and metrological\napplications.\n",
  "subjects": [
    "Physics/Optics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "-W6Ta9sfTSj4XHqx_eAc3xcvIljVyLv-OiJw6ICxDqE",
  "pdfSize": "1163411"
}