{
  "id": "2412.07909",
  "title": "Explaining and Mitigating the Modality Gap in Contrastive Multimodal\n  Learning",
  "authors": "Can Yaras, Siyi Chen, Peng Wang, Qing Qu",
  "authorsParsed": [
    [
      "Yaras",
      "Can",
      ""
    ],
    [
      "Chen",
      "Siyi",
      ""
    ],
    [
      "Wang",
      "Peng",
      ""
    ],
    [
      "Qu",
      "Qing",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 20:36:49 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733863009000,
  "abstract": "  Multimodal learning has recently gained significant popularity, demonstrating\nimpressive performance across various zero-shot classification tasks and a\nrange of perceptive and generative applications. Models such as Contrastive\nLanguage-Image Pretraining (CLIP) are designed to bridge different modalities,\nsuch as images and text, by learning a shared representation space through\ncontrastive learning. Despite their success, the working mechanisms underlying\nmultimodal learning are not yet well understood. Notably, these models often\nexhibit a modality gap, where different modalities occupy distinct regions\nwithin the shared representation space. In this work, we conduct an in-depth\nanalysis of the emergence of modality gap by characterizing the gradient flow\nlearning dynamics. Specifically, we identify the critical roles of mismatched\ndata pairs and a learnable temperature parameter in causing and perpetuating\nthe modality gap during training. Furthermore, our theoretical insights are\nvalidated through experiments on practical CLIP models. These findings provide\nprincipled guidance for mitigating the modality gap, including strategies such\nas appropriate temperature scheduling and modality swapping. Additionally, we\ndemonstrate that closing the modality gap leads to improved performance on\ntasks such as image-text retrieval.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "buscovPmd_OTsol3SuGMpJQo_T4YQKElKlkpw1GSGdo",
  "pdfSize": "2029155"
}