{
  "id": "2412.11944",
  "title": "User-Centered Course Reengineering: An Analytical Approach to Enhancing\n  Reading Comprehension in Educational Content",
  "authors": "Madjid Sadallah",
  "authorsParsed": [
    [
      "Sadallah",
      "Madjid",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 16:26:20 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734366380000,
  "abstract": "  Delivering high-quality content is crucial for effective reading\ncomprehension and successful learning. Ensuring educational materials are\ninterpreted as intended by their authors is a persistent challenge, especially\nwith the added complexity of multimedia and interactivity in the digital age.\nAuthors must continuously revise their materials to meet learners' evolving\nneeds. Detecting comprehension barriers and identifying actionable improvements\nwithin documents is complex, particularly in education where reading is\nfundamental. This study presents an analytical framework to help course\ndesigners enhance educational content to better support learning outcomes.\nGrounded in a robust theoretical foundation integrating learning analytics,\nreading comprehension, and content revision, our approach introduces\nusage-based document reengineering. This methodology adapts document content\nand structure based on insights from analyzing digital reading\ntraces-interactions between readers and content. We define reading sessions to\ncapture these interactions and develop indicators to detect comprehension\nchallenges. Our framework enables authors to receive tailored content revision\nrecommendations through an interactive dashboard, presenting actionable\ninsights from reading activity. The proposed approach was implemented and\nevaluated using data from a European e-learning platform. Evaluations validate\nthe framework's effectiveness, demonstrating its capacity to empower authors\nwith data-driven insights for targeted revisions. The findings highlight the\nframework's ability to enhance educational content quality, making it more\nresponsive to learners' needs. This research significantly contributes to\nlearning analytics and content optimization, offering practical tools to\nimprove educational outcomes and inform future developments in e-learning.\n",
  "subjects": [
    "Computer Science/Computers and Society"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "m5hi7peZGzWuSSEIt-7d3Sm10YekcJhl55H48-uiOO4",
  "pdfSize": "2059509"
}