{"id":"2412.04337","title":"Reflective Teacher: Semi-Supervised Multimodal 3D Object Detection in\n  Bird's-Eye-View via Uncertainty Measure","authors":"Saheli Hazra, Sudip Das, Rohit Choudhary, Arindam Das, Ganesh Sistu,\n  Ciaran Eising and Ujjwal Bhattacharya","authorsParsed":[["Hazra","Saheli",""],["Das","Sudip",""],["Choudhary","Rohit",""],["Das","Arindam",""],["Sistu","Ganesh",""],["Eising","Ciaran",""],["Bhattacharya","Ujjwal",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 16:54:39 GMT"}],"updateDate":"2024-12-06","timestamp":1733417679000,"abstract":"  Applying pseudo labeling techniques has been found to be advantageous in\nsemi-supervised 3D object detection (SSOD) in Bird's-Eye-View (BEV) for\nautonomous driving, particularly where labeled data is limited. In the\nliterature, Exponential Moving Average (EMA) has been used for adjustments of\nthe weights of teacher network by the student network. However, the same\ninduces catastrophic forgetting in the teacher network. In this work, we\naddress this issue by introducing a novel concept of Reflective Teacher where\nthe student is trained by both labeled and pseudo labeled data while its\nknowledge is progressively passed to the teacher through a regularizer to\nensure retention of previous knowledge. Additionally, we propose Geometry Aware\nBEV Fusion (GA-BEVFusion) for efficient alignment of multi-modal BEV features,\nthus reducing the disparity between the modalities - camera and LiDAR. This\nhelps to map the precise geometric information embedded among LiDAR points\nreliably with the spatial priors for extraction of semantic information from\ncamera images. Our experiments on the nuScenes and Waymo datasets demonstrate:\n1) improved performance over state-of-the-art methods in both fully supervised\nand semi-supervised settings; 2) Reflective Teacher achieves equivalent\nperformance with only 25% and 22% of labeled data for nuScenes and Waymo\ndatasets respectively, in contrast to other fully supervised methods that\nutilize the full labeled dataset.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"AvQOLUMKQaoV4NF6t84enuTjFgAFCO3YFGU3tOe4BrY","pdfSize":"4422235"}