{"id":"2412.02133","title":"Thermal state structure in the Tavis--Cummings model and rapid\n  simulations in mesoscopic quantum ensembles","authors":"Lane G. Gunderman, Troy Borneman, David G. Cory","authorsParsed":[["Gunderman","Lane G.",""],["Borneman","Troy",""],["Cory","David G.",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 03:44:43 GMT"}],"updateDate":"2024-12-04","timestamp":1733197483000,"abstract":"  Hybrid quantum systems consisting of a collection of N spin-1/2 particles\nuniformly interacting with an electromagnetic field, such as one confined in a\ncavity, are important for the development of quantum information processors and\nwill be useful for metrology, as well as tests of collective behavior. Such\nsystems are often modeled by the Tavis-Cummings model and having an accurate\nunderstanding of the thermal behaviors of this system is needed to understand\nthe behavior of them in realistic environments. We quantitatively show in this\nwork that the Dicke subspace approximation is at times invoked too readily, in\nspecific we show that there is a temperature above which the degeneracies in\nthe system become dominant and the Dicke subspace is minimally populated. This\ntransition occurs at a lower temperature than priorly considered. When in such\na temperature regime, the key constants of the motion are the total excitation\ncount between the spin system and cavity and the collective angular momentum of\nthe spin system. These enable perturbative expansions for thermal properties in\nterms of the energy shifts of dressed states, called Lamb shifts herein. These\nenable efficient numeric methods for obtaining certain parameters that scale as\n$O(\\sqrt{N})$, and is thus highly efficient. These provide methods for\napproximating, and bounding, properties of these systems as well as\ncharacterizing the dominant population regions, including under perturbative\nnoise. In the regime of stronger spin-spin coupling the perturbations outweigh\nthe expansion series terms and inefficient methods likely are needed to be\nemployed, removing the computational efficiency of simulating such systems. The\nresults in this work can also be used for related systems such as\ncoupled-cavity arrays, cavity mediated coupling of collective spin ensembles,\nand collective spin systems.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Mesoscale and Nanoscale Physics","Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Zu31sLiGLx0ujSrLpDF-pQAAejUP9vKw85_yPPd2Hck","pdfSize":"1022050"}