{
  "id": "2412.20759",
  "title": "Emergence, Formation and Dynamics of Hot QCD Matter",
  "authors": "Bruno Sebastian Scheihing-Hitschfeld",
  "authorsParsed": [
    [
      "Scheihing-Hitschfeld",
      "Bruno Sebastian",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 30 Dec 2024 07:07:38 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735542458000,
  "abstract": "  In this thesis, we make progress in two concrete directions in the vast\nlandscape of hot QCD physics. The first one is quarkonium transport inside\nquark-gluon plasma (QGP), the high temperature phase of QCD. Over the past two\ndecades it has been realized that a significant fraction of quarkonium\nsuppression in high energy heavy ion collisions comes from dynamic dissociation\nand recombination processes, instead of static screening of the interaction\npotential as originally proposed by Matsui and Satz. Our contribution is the\nformulation of the precise correlation functions in QCD at finite temperature\nthat describe the dissociation and recombination processes of heavy quarkonium\nin QGP, as well as their calculation in weakly coupled QCD and strongly coupled\n$\\mathcal{N}=4$ supersymmetric Yang-Mills theory. We also formulate the\nEuclidean version of these correlation functions so that they may be calculated\nusing Lattice QCD techniques. The second contribution we make is the\ndevelopment of tools to understand the process of hydrodynamization in QCD\nkinetic theory and their application to a simplified description where only a\nsubset of the QCD scattering mechanisms are included. By doing this, we learn\nthat the process of hydrodynamization in this theory, and specifically, how\nmemory of the initial condition is lost, follows the recently proposed\nAdiabatic Hydrodynamization scenario. Concretely, hydrodynamization proceeds\nthrough a sequential process in which a monotonously shrinking set of\nlow-energy states dominate the dynamics, where the opening of an energy gap\nrelative to the ground state(s) signals the start of each stage of this\nprocess. The hydrodynamic attractor is reached when only one low-energy state\nremains as the ground state, and the system approaches local thermal\nequilibrium following the adiabatic evolution of this low-energy state.\n",
  "subjects": [
    "Physics/High Energy Physics - Phenomenology",
    "Physics/High Energy Physics - Theory",
    "Physics/Nuclear Theory"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "uOcBuSthL-vV1YiJGQ7wBytCP7BdRSeXbCXY46tfhVE",
  "pdfSize": "15588678"
}