{"id":"2412.19704","title":"Re-parameterization Invariance of FRW Model: Supervariable and BRST\n  Approaches","authors":"B. Chauhan, R. Tripathi","authorsParsed":[["Chauhan","B.",""],["Tripathi","R.",""]],"versions":[{"version":"v1","created":"Fri, 27 Dec 2024 15:58:29 GMT"},{"version":"v2","created":"Wed, 1 Jan 2025 06:23:56 GMT"},{"version":"v3","created":"Thu, 27 Feb 2025 10:20:32 GMT"}],"updateDate":"2025-02-28","timestamp":1735315109000,"abstract":"  We perform the Becchi-Rouet-Stora-Tyutin (BRST) quantization of a $(0 +\n1)$-dimensional cosmological Friedmann-Robertson-Walker (FRW) model. This\nquantization leverages the classical infinitesimal and continuous\nre-parameterization symmetry transformations of the system. To derive the\nnilpotent re-parameterization invariant BRST-anti-BRST symmetry transformations\nfor the scale factor and corresponding momentum variables present in the\ncosmological FRW model, we employ the modified Bonora-Tonin supervariable\napproach (MBTSA) to BRST formalism. Through this approach, we also establish\nthe BRST-anti-BRST invariant Curci-Ferrari (CF)-type restriction for this\ncosmological re-parameterization invariant model. Further, we obtain the\noff-shell nilpotent quantum BRST-anti-BRST symmetry transformations for other\nvariables within the model using the (anti-)chiral supervariable approach\n(ACSA) to BRST formalism. Within the framework of ACSA, the CF-type restriction\nis demonstrated through two key aspects: $(i)$ the invariance of the coupled\nLagrangians under symmetry transformations, and $(ii)$ the absolute\nanti-commutativity of the conserved BRST-anti-BRST charges. Notably, applying\nthe MBTSA to a physical cosmological system, specifically a one-dimensional\none, constitutes a novel contribution to this work. Additionally, in the\napplication of ACSA, we restrict our analysis to (anti-)chiral super expansions\nof supervariables, leading to the unique observation of the absolute\nanti-commutativity of the conserved BRST-anti-BRST charges. Moreover, we\nhighlight that the CF-type restriction demonstrates a universal nature,\nremaining consistent across any re-parameterization invariant models in general\nD-dimensional spacetime.\n","subjects":["Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7RYgFYzXnwKNhzJf64RKi67JtNdIxIgOSeblSPNhYy4","pdfSize":"247974"}