{
  "id": "2412.17818",
  "title": "EEG-Based Mental Imagery Task Adaptation via Ensemble of\n  Weight-Decomposed Low-Rank Adapters",
  "authors": "Taveena Lotey, Aman Verma and Partha Pratim Roy",
  "authorsParsed": [
    [
      "Lotey",
      "Taveena",
      ""
    ],
    [
      "Verma",
      "Aman",
      ""
    ],
    [
      "Roy",
      "Partha Pratim",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 8 Dec 2024 14:57:00 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1733669820000,
  "abstract": "  Electroencephalography (EEG) is widely researched for neural decoding in\nBrain Computer Interfaces (BCIs) as it is non-invasive, portable, and\neconomical. However, EEG signals suffer from inter- and intra-subject\nvariability, leading to poor performance. Recent technological advancements\nhave led to deep learning (DL) models that have achieved high performance in\nvarious fields. However, such large models are compute- and resource-intensive\nand are a bottleneck for real-time neural decoding. Data distribution shift can\nbe handled with the help of domain adaptation techniques of transfer learning\n(fine-tuning) and adversarial training that requires model parameter updates\naccording to the target domain. One such recent technique is\nParameter-efficient fine-tuning (PEFT), which requires only a small fraction of\nthe total trainable parameters compared to fine-tuning the whole model.\nTherefore, we explored PEFT methods for adapting EEG-based mental imagery\ntasks. We considered two mental imagery tasks: speech imagery and motor\nimagery, as both of these tasks are instrumental in post-stroke\nneuro-rehabilitation. We proposed a novel ensemble of weight-decomposed\nlow-rank adaptation methods, EDoRA, for parameter-efficient mental imagery task\nadaptation through EEG signal classification. The performance of the proposed\nPEFT method is validated on two publicly available datasets, one speech\nimagery, and the other motor imagery dataset. In extensive experiments and\nanalysis, the proposed method has performed better than full fine-tune and\nstate-of-the-art PEFT methods for mental imagery EEG classification.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Signal Processing",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "AydakLz8IacctrQJUS6dEtwVnCplJDuX7KSn8aBu8j8",
  "pdfSize": "847205"
}