{
  "id": "2412.20057",
  "title": "\"My life is miserable, have to sign 500 autographs everyday\": Exposing\n  Humblebragging, the Brags in Disguise",
  "authors": "Sharath Naganna, Saprativa Bhattacharjee, Pushpak Bhattacharyya and\n  Biplab Banerjee",
  "authorsParsed": [
    [
      "Naganna",
      "Sharath",
      ""
    ],
    [
      "Bhattacharjee",
      "Saprativa",
      ""
    ],
    [
      "Bhattacharyya",
      "Pushpak",
      ""
    ],
    [
      "Banerjee",
      "Biplab",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 28 Dec 2024 07:14:55 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735370095000,
  "abstract": "  Humblebragging is a phenomenon where individuals present self-promotional\nstatements under the guise of modesty or complaints. For example, a statement\nlike, \"Ugh, I can't believe I got promoted to lead the entire team. So\nstressful!\", subtly highlights an achievement while pretending to be\ncomplaining. Detecting humblebragging is important for machines to better\nunderstand the nuances of human language, especially in tasks like sentiment\nanalysis and intent recognition. However, this topic has not yet been studied\nin computational linguistics. For the first time, we introduce the task of\nautomatically detecting humblebragging in text. We formalize the task by\nproposing a 4-tuple definition of humblebragging and evaluate machine learning,\ndeep learning, and large language models (LLMs) on this task, comparing their\nperformance with humans. We also create and release a dataset called HB24,\ncontaining 3,340 humblebrags generated using GPT-4o. Our experiments show that\ndetecting humblebragging is non-trivial, even for humans. Our best model\nachieves an F1-score of 0.88. This work lays the foundation for further\nexploration of this nuanced linguistic phenomenon and its integration into\nbroader natural language understanding systems.\n",
  "subjects": [
    "Computer Science/Computation and Language"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "Lpn5zUnhuIcFJLb5jE-L-wMZ7Ky1bIeuAW5TXFpuAw0",
  "pdfSize": "1079857"
}