{
  "id": "2412.08095",
  "title": "5G NR monostatic positioning with array impairments:\n  Data-and-model-driven framework and experiment results",
  "authors": "Shengheng Liu, Hao Wang, Mengguan Pan, Peng Liu, Yahui Ma, Yongming\n  Huang",
  "authorsParsed": [
    [
      "Liu",
      "Shengheng",
      ""
    ],
    [
      "Wang",
      "Hao",
      ""
    ],
    [
      "Pan",
      "Mengguan",
      ""
    ],
    [
      "Liu",
      "Peng",
      ""
    ],
    [
      "Ma",
      "Yahui",
      ""
    ],
    [
      "Huang",
      "Yongming",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 04:36:39 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733891799000,
  "abstract": "  In this article, we present an intelligent framework for 5G new radio (NR)\nindoor positioning under a monostatic configuration. The primary objective is\nto estimate both the angle of arrival and time of arrival simultaneously. This\nrequires capturing the pertinent information from both the antenna and\nsubcarrier dimensions of the receive signals. To tackle the challenges posed by\nthe intricacy of the high-dimensional information matrix, coupled with the\nimpact of irregular array errors, we design a deep learning scheme. Recognizing\nthat the phase difference between any two subcarriers and antennas encodes\nspatial information of the target, we contend that the transformer network is\nbetter suited for this problem compared to the convolutional neural network\nwhich excels in local feature extraction. To further enhance the network's\nfitting capability, we integrate the transformer with a model-based\nmultiple-signal-classification (MUSIC) region decision mechanism. Numerical\nresults and field tests demonstrate the effectiveness of the proposed framework\nin accurately calibrating the irregular angle-dependent array error and\nimproving positioning accuracy.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Signal Processing"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "-fzK0SE6F6t35vJjXvf_zAzY1Z2c45cclTtk8qvtj90",
  "pdfSize": "6197736"
}