{
  "id": "2412.09356",
  "title": "Strong negative magnetoresistance and hopping transport in graphenized\n  nematic aerogels",
  "authors": "V.I. Tsebro, E.G. Nikolaev, M.S. Kutuzov, A.V. Sadakov and O.A.\n  Sobolevskiy",
  "authorsParsed": [
    [
      "Tsebro",
      "V. I.",
      ""
    ],
    [
      "Nikolaev",
      "E. G.",
      ""
    ],
    [
      "Kutuzov",
      "M. S.",
      ""
    ],
    [
      "Sadakov",
      "A. V.",
      ""
    ],
    [
      "Sobolevskiy",
      "O. A.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 15:23:25 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1734017005000,
  "abstract": "  The transport properties of nematic aerogels, which consist of oriented\nmullite nanofibers coated with a graphene shell, were studied. It is shown that\nthe magnetoresistance of this system is well approximated by two contributions\n- negative one, described by the formula for systems with weak localization ,\nand positive contribution, linear in the field and unsaturated in large\nmagnetic fields. The behavior of phase coherence length on temperature obtained\nfrom the analysis of the negative contribution indicates the main role of the\nelectron-electron interaction in the destruction of phase coherence and,\npresumably, the transition at low temperatures from a two-dimensional weak\nlocalization regime to a one-dimensional one. The positive linear contribution\nto magnetoresistance is apparently due to the inhomogeneous distribution of the\nlocal carrier density in the conductive medium. It has also been established\nthat the temperature dependence of the resistance for graphenized aerogels with\na low carbon content, when the graphene coating is apparently incomplete, can\nbe represented as the sum of two contributions, one of which is characteristic\nof weak localization, and the second is described by hopping mechanism\ncorresponding to the Shklovskii-Efros law in the case of a granular conductive\nmedium. For samples with a high carbon content, there is no second\ncontribution.\n",
  "subjects": [
    "Condensed Matter/Mesoscale and Nanoscale Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "2i6ObUjrWPISzSzidRnR6SfXyyLCEVFzPXAeHlXivAc",
  "pdfSize": "934522"
}