{"id":"2412.07037","title":"Exploiting SU(N ) dynamical symmetry for rovibronic stabilization of a\n  weakly bound diatomic molecule","authors":"Diego F. Uribe, Mateo Londo\\~no, Julio C. Arce","authorsParsed":[["Uribe","Diego F.",""],["Londoño","Mateo",""],["Arce","Julio C.",""]],"versions":[{"version":"v1","created":"Mon, 9 Dec 2024 22:53:33 GMT"}],"updateDate":"2024-12-11","timestamp":1733784813000,"abstract":"  We propose a multilevel scheme to coherently transfer the population of a\ndiatomic molecule from a rovibrational level to a target rovibrational level of\nthe same electronic state or another. It involves a linear chain of N\nrovibrational levels alternating between the initial electronic state and a\nsecond electronic state, conveniently selected according to the dipole\ncouplings between consecutive levels. A set of N - 1 simultaneous weak laser\n$\\pi$ pulses, with simple analytical shapes, each in resonance between two\nneighbors of the chain, transfers the population from the initial rovibronic\nstate gradually and consecutively through the chain, until at the end of the\nprocess it resides in the target rovibronic state, as in a kind of ping-pong\ngame between the two electronic states. Using the partial-wave expansion of the\nmolecular wave function, vibrational bases within the J manifolds of each\nelectronic state, and the rotating-wave approximation (RWA), we map the radial\nHamiltonian to the one of a spin s = (N - 1)/2 under a static magnetic field,\nproviding an analytical formula for the populations of the linked states. As an\nillustration, we apply the scheme to the stabilization into the absolute ground\nstate of a KRb molecule initially in the high-lying $\\upsilon$ = 75, J = 6\nlevel of the ground electronic state $X^{1}\\Sigma^{+}$. With a chain of seven\nrovibronic states, three of them belonging to the excited $A^{1}\\Sigma^{+}$\nelectronic state, and pulses of 0.4 ns of duration, the population is fully\ntransferred into the target state in about 1 ns.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"92M2e77jiwEGrvdpxaQJsASJsWmDp3NvJvGvs3dfDYM","pdfSize":"1834484"}