{"id":"2412.08258","title":"Large Language Models for Scholarly Ontology Generation: An Extensive\n  Analysis in the Engineering Field","authors":"Tanay Aggarwal, Angelo Salatino, Francesco Osborne, Enrico Motta","authorsParsed":[["Aggarwal","Tanay",""],["Salatino","Angelo",""],["Osborne","Francesco",""],["Motta","Enrico",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 10:11:41 GMT"}],"updateDate":"2024-12-12","timestamp":1733911901000,"abstract":"  Ontologies of research topics are crucial for structuring scientific\nknowledge, enabling scientists to navigate vast amounts of research, and\nforming the backbone of intelligent systems such as search engines and\nrecommendation systems. However, manual creation of these ontologies is\nexpensive, slow, and often results in outdated and overly general\nrepresentations. As a solution, researchers have been investigating ways to\nautomate or semi-automate the process of generating these ontologies. This\npaper offers a comprehensive analysis of the ability of large language models\n(LLMs) to identify semantic relationships between different research topics,\nwhich is a critical step in the development of such ontologies. To this end, we\ndeveloped a gold standard based on the IEEE Thesaurus to evaluate the task of\nidentifying four types of relationships between pairs of topics: broader,\nnarrower, same-as, and other. Our study evaluates the performance of seventeen\nLLMs, which differ in scale, accessibility (open vs. proprietary), and model\ntype (full vs. quantised), while also assessing four zero-shot reasoning\nstrategies. Several models have achieved outstanding results, including\nMixtral-8x7B, Dolphin-Mistral-7B, and Claude 3 Sonnet, with F1-scores of 0.847,\n0.920, and 0.967, respectively. Furthermore, our findings demonstrate that\nsmaller, quantised models, when optimised through prompt engineering, can\ndeliver performance comparable to much larger proprietary models, while\nrequiring significantly fewer computational resources.\n","subjects":["Computer Science/Digital Libraries","Computer Science/Artificial Intelligence","Computer Science/Information Retrieval"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"-b5I4MiK7XtP-7_JN_5CdSuNrI8WHSjuXd8nB-5PNgM","pdfSize":"644754"}