{"id":"2412.13456","title":"Multiferroic Dark Excitonic Mott Insulator in the Breathing-Kagome\n  Lattice Material Nb$_3$Cl$_8$","authors":"Mahtab Khan, Naseem Ud Din, Dirk R. Englund, Michael N. Leuenberger","authorsParsed":[["Khan","Mahtab",""],["Din","Naseem Ud",""],["Englund","Dirk R.",""],["Leuenberger","Michael N.",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 03:00:18 GMT"}],"updateDate":"2024-12-19","timestamp":1734490818000,"abstract":"  Motivated by the recent discovery of flat bands (FBs) in breathing Kagome\nlattices (BKLs), we present a detailed first-principles study of the optical\nresponse of single-layer (SL) Nb$_3$Cl$_8$ using the GW-Bethe-Salpeter equation\n(GW-BSE) method, incorporating self-energy corrections and excitonic effects.\nOur findings reveal a rich spectrum of strongly bound excitons. The key results\nare fourfold: (i) SL Nb$_3$Cl$_8$ exhibits a dark spin-triplet Frenkel exciton\nground state with binding energy substantially larger than the GW-renormalized\nband gap, giving rise to a negative exciton energy peak at $-0.14$ eV and\nindicating an excitonic Mott insulator phase potentially stable at room\ntemperature ($k_B T = 0.025$ eV); (ii) the brightest exciton peak appears at\n1.2 eV, in excellent agreement with experimental optical absorption spectra.\n(iii) We map the low-energy Frenkel exciton system onto a Hubbard model with\nspin-1 particles on a triangular lattice, resulting in frustrated spin\nconfigurations due to antiferromagnetic spin-spin exchange interaction. (iv) As\nthe spin-triplet Frenkel excitons have electric dipoles that interact with each\nother via electric dipole-dipole interaction, we obtain antiferroelectric\nordering, possibly stable at room temperature. Thus, we propose that\nNb$_3$Cl$_8$ is a multiferroic dark spin-triplet excitonic Mott insulator.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"p1fpvtIDfQvfZIcUy9m1nQ925JGDvWgUIRM66AtViKA","pdfSize":"10972408"}