{
  "id": "2412.14261",
  "title": "Correlations, Spectra and Entanglement Transitions in Ensembles of\n  Matrix Product States",
  "authors": "Hugo L\\'oio, Guillaume Cecile, Sarang Gopalakrishnan, Guglielmo Lami,\n  and Jacopo De Nardis",
  "authorsParsed": [
    [
      "Lóio",
      "Hugo",
      ""
    ],
    [
      "Cecile",
      "Guillaume",
      ""
    ],
    [
      "Gopalakrishnan",
      "Sarang",
      ""
    ],
    [
      "Lami",
      "Guglielmo",
      ""
    ],
    [
      "De Nardis",
      "Jacopo",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 19:00:33 GMT"
    },
    {
      "version": "v2",
      "created": "Fri, 17 Jan 2025 09:50:10 GMT"
    }
  ],
  "updateDate": "2025-01-20",
  "timestamp": 1734548433000,
  "abstract": "  We investigate ensembles of Matrix Product States (MPSs) generated by quantum\ncircuit evolution followed by projection onto MPSs with a fixed bond dimension\n$\\chi$. Specifically, we consider ensembles produced by: (i) random sequential\nunitary circuits, (ii) random brickwork unitary circuits, and (iii) circuits\ninvolving both unitaries and projective measurements. In all cases, we analyze\nthe spectra of the MPS transfer matrices and relate them to the spreading of\nmutual information in the MPS state. We demonstrate how different features of\nthe spectral density correspond to distinct types of circuits, revealing that\nthese MPS ensembles retain crucial physical information about the underlying\nmicroscopic dynamics. Notably, in the presence of quantum monitoring, we show\nthe existence of a measurement-induced entanglement transition (MIPT) in MPS\nensembles, with the averaged dimension of the transfer matrix's null space\nserving as the effective order parameter.\n",
  "subjects": [
    "Physics/Quantum Physics",
    "Condensed Matter/Statistical Mechanics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "tfPKEWdgLv4P8Gut07hOsplPy5pHi1FisCCRRAJIL-s",
  "pdfSize": "2078302"
}