{"id":"2412.19489","title":"RAIN: Real-time Animation of Infinite Video Stream","authors":"Zhilei Shu, Ruili Feng, Yang Cao, Zheng-Jun Zha","authorsParsed":[["Shu","Zhilei",""],["Feng","Ruili",""],["Cao","Yang",""],["Zha","Zheng-Jun",""]],"versions":[{"version":"v1","created":"Fri, 27 Dec 2024 07:13:15 GMT"}],"updateDate":"2024-12-30","timestamp":1735283595000,"abstract":"  Live animation has gained immense popularity for enhancing online engagement,\nyet achieving high-quality, real-time, and stable animation with diffusion\nmodels remains challenging, especially on consumer-grade GPUs. Existing methods\nstruggle with generating long, consistent video streams efficiently, often\nbeing limited by latency issues and degraded visual quality over extended\nperiods. In this paper, we introduce RAIN, a pipeline solution capable of\nanimating infinite video streams in real-time with low latency using a single\nRTX 4090 GPU. The core idea of RAIN is to efficiently compute frame-token\nattention across different noise levels and long time-intervals while\nsimultaneously denoising a significantly larger number of frame-tokens than\nprevious stream-based methods. This design allows RAIN to generate video frames\nwith much shorter latency and faster speed, while maintaining long-range\nattention over extended video streams, resulting in enhanced continuity and\nconsistency. Consequently, a Stable Diffusion model fine-tuned with RAIN in\njust a few epochs can produce video streams in real-time and low latency\nwithout much compromise in quality or consistency, up to infinite long. Despite\nits advanced capabilities, the RAIN only introduces a few additional 1D\nattention blocks, imposing minimal additional burden. Experiments in benchmark\ndatasets and generating super-long videos demonstrating that RAIN can animate\ncharacters in real-time with much better quality, accuracy, and consistency\nthan competitors while costing less latency. All code and models will be made\npublicly available.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"UJyo9qUiFAwlWhkETV2ImitG7-kp5vA7C0QziUEO8C4","pdfSize":"34982468"}