{
  "id": "2412.02286",
  "title": "Weighted Essentially Non-Oscillatory Shepard method",
  "authors": "David Levin, Jos\\'e M. Ram\\'on, Juan Ruiz-Alvarez, Dionisio F.\n  Y\\'a\\~nez",
  "authorsParsed": [
    [
      "Levin",
      "David",
      ""
    ],
    [
      "Ramón",
      "José M.",
      ""
    ],
    [
      "Ruiz-Alvarez",
      "Juan",
      ""
    ],
    [
      "Yáñez",
      "Dionisio F.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 09:04:41 GMT"
    }
  ],
  "updateDate": "2024-12-04",
  "timestamp": 1733216681000,
  "abstract": "  Shepard method is a fast algorithm that has been classically used to\ninterpolate scattered data in several dimensions. This is an important and\nwell-known technique in numerical analysis founded in the main idea that data\nthat is far away from the approximation point should contribute less to the\nresulting approximation. Approximating piecewise smooth functions in\n$\\mathbb{R}^n$ near discontinuities along a hypersurface in $\\mathbb{R}^{n-1}$\nis challenging for the Shepard method or any other linear technique for sparse\ndata due to the inherent difficulty in accurately capturing sharp transitions\nand avoiding oscillations. This letter is devoted to constructing a non-linear\nShepard method using the basic ideas that arise from the weighted essentially\nnon-oscillatory interpolation method (WENO). The proposed method aims to\nenhance the accuracy and stability of the traditional Shepard method by\nincorporating WENO's adaptive and nonlinear weighting mechanism. To address\nthis challenge, we will nonlinearly modify the weight function in a general\nShepard method, considering any weight function, rather than relying solely on\nthe inverse of the distance squared. This approach effectively reduces\noscillations near discontinuities and improves the overall interpolation\nquality. Numerical experiments demonstrate the superior performance of the new\nmethod in handling complex datasets, making it a valuable tool for various\napplications in scientific computing and data analysis.\n",
  "subjects": [
    "Mathematics/Numerical Analysis",
    "Computer Science/Numerical Analysis"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "tWFU8h_AYugyhNCTfT0vEdqbmARsMEeydzg26FlocTM",
  "pdfSize": "2348217"
}