{"id":"2412.06973","title":"Observation of Charge Enhancement in forward-biased neutron-irradiated\n  4H-SiC PiN Detectors in UV-TCT Measurements","authors":"Andreas Gsponer, Philipp Gaggl, J\\\"urgen Burin, Simon Waid, Thomas\n  Bergauer","authorsParsed":[["Gsponer","Andreas",""],["Gaggl","Philipp",""],["Burin","Jürgen",""],["Waid","Simon",""],["Bergauer","Thomas",""]],"versions":[{"version":"v1","created":"Mon, 9 Dec 2024 20:34:02 GMT"}],"updateDate":"2024-12-11","timestamp":1733776442000,"abstract":"  Due to the increased commercial availability, wide-bandgap semiconductors and\ntheir radiation hardness have recently received increased interest from the\nparticle physics community. 4H-Silicon Carbide (SiC), especially, is an\nattractive candidate for future radiation-hard detectors which do not require\ncooling.\n  This paper investigates the radiation hardness of 4H-SiC p-in-n detectors\nirradiated up to $5\\times 10^{15}$ $\\text{n}_{\\text{eq.}}/\\text{cm}^2$ using\nUV-TCT. The samples have been operated in reverse and forward bias, which is\npossible due to the heavily decreased forward current after irradiation.\nPrevious studies have already hinted at an excessive charge collection in\nforward bias, even exceeding a charge collection efficiency (CCE) of 100%. In\nthis work, the excessive CCE in forward bias was shown to correlate heavily\nwith the spatial profile of injected charge. For a sufficiently focused laser,\nthe CCE starts to increase at high forward bias and even surpasses 100% instead\nof saturating as it does for a defocused laser beam. In reverse bias, the CCE\nwas found to be independent of the beam spot size. For samples irradiated to\nhigh fluences ($\\geq 1\\times 10^{15}$ $\\text{n}_{\\text{eq.}}/\\text{cm}^2$) the\nexcessive CCE in forward bias is smaller and negligible at the highest\nfluences.\n  Additionally, the CCE was observed to correlate to the rate of charge\ninjection (laser pulses per second), with a logarithmic increase of the\ncollected charge if a threshold of injected carrier density is exceeded. The\nmechanism of these effects is still an ongoing topic of study, however, the\nobservations already pose implications for the accurate experimental\ncharacterization of irradiated SiC detectors.\n","subjects":["Physics/Instrumentation and Detectors"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"i-hRsmCkOFT6Y_MUABfqNqdC3n_EOwVItX4NoGKU7S4","pdfSize":"384644"}