{
  "id": "2412.09755",
  "title": "Constraining inflation with nonminimal derivative coupling with the\n  Parkes Pulsar Timing Array third data release",
  "authors": "Chang Han, Li-Yang Chen, Zu-Cheng Chen, Chengjie Fu, Puxun Wu, Hongwei\n  Yu, N. D. Ramesh Bhat, Xiaojin Liu, Valentina Di Marco, Saurav Mishra, Daniel\n  J. Reardon, Christopher J. Russell, Ryan M. Shannon, Lei Zhang, Xingjiang\n  Zhu, and Andrew Zic",
  "authorsParsed": [
    [
      "Han",
      "Chang",
      ""
    ],
    [
      "Chen",
      "Li-Yang",
      ""
    ],
    [
      "Chen",
      "Zu-Cheng",
      ""
    ],
    [
      "Fu",
      "Chengjie",
      ""
    ],
    [
      "Wu",
      "Puxun",
      ""
    ],
    [
      "Yu",
      "Hongwei",
      ""
    ],
    [
      "Bhat",
      "N. D. Ramesh",
      ""
    ],
    [
      "Liu",
      "Xiaojin",
      ""
    ],
    [
      "Di Marco",
      "Valentina",
      ""
    ],
    [
      "Mishra",
      "Saurav",
      ""
    ],
    [
      "Reardon",
      "Daniel J.",
      ""
    ],
    [
      "Russell",
      "Christopher J.",
      ""
    ],
    [
      "Shannon",
      "Ryan M.",
      ""
    ],
    [
      "Zhang",
      "Lei",
      ""
    ],
    [
      "Zhu",
      "Xingjiang",
      ""
    ],
    [
      "Zic",
      "Andrew",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 23:16:11 GMT"
    },
    {
      "version": "v2",
      "created": "Thu, 20 Feb 2025 03:36:33 GMT"
    }
  ],
  "updateDate": "2025-02-21",
  "timestamp": 1734045371000,
  "abstract": "  We study an inflation model with nonminimal derivative coupling that features\na coupling between the derivative of the inflaton field and the Einstein\ntensor. This model naturally amplifies curvature perturbations at small scales\nvia gravitationally enhanced friction, a mechanism critical for the formation\nof primordial black holes and the associated production of potentially\ndetectable scalar-induced gravitational waves. We derive analytical expressions\nfor the primordial power spectrum, enabling efficient exploration of the model\nparameter space without requiring computationally intensive numerical solutions\nof the Mukhanov-Sasaki equation. Using the third data release of the Parkes\nPulsar Timing Array (PPTA DR3), we constrain the model parameters\ncharacterizing the coupling function: $\\phi_c = 3.7^{+0.3}_{-0.5}\nM_\\mathrm{P}$, $\\log_{10} \\omega_L = 7.1^{+0.6}_{-0.3}$, and $\\log_{10} \\sigma\n= -8.3^{+0.3}_{-0.6}$ at 90\\% confidence level. Our results demonstrate the\ngrowing capability of pulsar timing arrays to probe early Universe physics,\ncomplementing traditional cosmic microwave background observations by providing\nunique constraints on inflationary dynamics at small scales.\n",
  "subjects": [
    "Physics/General Relativity and Quantum Cosmology",
    "Astrophysics/Cosmology and Nongalactic Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Va1iPoXH6qpPO7AxOq3UqYuK73B7uLpWZ8_Cm035TSA",
  "pdfSize": "1314213"
}