{
  "id": "2412.20568",
  "title": "Derivations of Animal Movement Models with Explicit Memory",
  "authors": "Tianxu Wang, Kyunghan Choi, Hao Wang",
  "authorsParsed": [
    [
      "Wang",
      "Tianxu",
      ""
    ],
    [
      "Choi",
      "Kyunghan",
      ""
    ],
    [
      "Wang",
      "Hao",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 29 Dec 2024 20:38:21 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735504701000,
  "abstract": "  Highly evolved animals continuously update their knowledge of social factors,\nrefining movement decisions based on both historical and real-time\nobservations. Despite its significance, research on the underlying mechanisms\nremains limited. In this study, we explore how the use of explicit memory\nshapes different mathematical models across various ecological dispersal\nscenarios. Specifically, we investigate three memory-based dispersal scenarios:\ngradient-based movement, where individuals respond to environmental gradients;\nenvironment matching, which promotes uniform distribution within a population;\nand location-based movement, where decisions rely solely on local suitability.\nThese scenarios correspond to diffusion advection, Fickian diffusion, and\nFokker-Planck diffusion models, respectively. We focus on the derivation of\nthese memory-based movement models using three approaches: spatial and temporal\ndiscretization, patch models in continuous time, and discrete-velocity jump\nprocess. These derivations highlight how different ways of using memory lead to\ndistinct mathematical models. Numerical simulations reveal that the three\ndispersal scenarios exhibit distinct behaviors under memory-induced repulsive\nand attractive conditions. The diffusion advection and Fokker-Planck models\ndisplay wiggle patterns and aggregation phenomena, while simulations of the\nFickian diffusion model consistently stabilize to uniform constant states.\n",
  "subjects": [
    "Quantitative Biology/Populations and Evolution",
    "Quantitative Biology/Quantitative Methods"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "8niynndD0mkCFYLmJ9_5HefQetH4NhDzKpvKnC2xxzQ",
  "pdfSize": "898015"
}