{"id":"2412.08479","title":"CAT: Class Aware Adaptive Thresholding for Semi-Supervised Domain\n  Generalization","authors":"Sumaiya Zoha, Jeong-Gun Lee, Young-Woong Ko","authorsParsed":[["Zoha","Sumaiya",""],["Lee","Jeong-Gun",""],["Ko","Young-Woong",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 15:47:01 GMT"}],"updateDate":"2024-12-12","timestamp":1733932021000,"abstract":"  Domain Generalization (DG) seeks to transfer knowledge from multiple source\ndomains to unseen target domains, even in the presence of domain shifts.\nAchieving effective generalization typically requires a large and diverse set\nof labeled source data to learn robust representations that can generalize to\nnew, unseen domains. However, obtaining such high-quality labeled data is often\ncostly and labor-intensive, limiting the practical applicability of DG. To\naddress this, we investigate a more practical and challenging problem:\nsemi-supervised domain generalization (SSDG) under a label-efficient paradigm.\nIn this paper, we propose a novel method, CAT, which leverages semi-supervised\nlearning with limited labeled data to achieve competitive generalization\nperformance under domain shifts. Our method addresses key limitations of\nprevious approaches, such as reliance on fixed thresholds and sensitivity to\nnoisy pseudo-labels. CAT combines adaptive thresholding with noisy label\nrefinement techniques, creating a straightforward yet highly effective solution\nfor SSDG tasks. Specifically, our approach uses flexible thresholding to\ngenerate high-quality pseudo-labels with higher class diversity while refining\nnoisy pseudo-labels to improve their reliability. Extensive experiments across\nmultiple benchmark datasets demonstrate the superior performance of our method,\nhighlighting its effectiveness in achieving robust generalization under domain\nshift.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"bu8qK9Y4ifhmIvMz3ZFSbb2KESrq_HBJz6sx5dvabYQ","pdfSize":"621581"}