{"id":"2412.06323","title":"HAIFAI: Human-AI Interaction for Mental Face Reconstruction","authors":"Florian Strohm and Mihai B\\^ace and Andreas Bulling","authorsParsed":[["Strohm","Florian",""],["Bâce","Mihai",""],["Bulling","Andreas",""]],"versions":[{"version":"v1","created":"Mon, 9 Dec 2024 09:18:40 GMT"},{"version":"v2","created":"Tue, 25 Feb 2025 14:31:42 GMT"}],"updateDate":"2025-02-26","timestamp":1733735920000,"abstract":"  We present HAIFAI - a novel two-stage system where humans and AI interact to\ntackle the challenging task of reconstructing a visual representation of a face\nthat exists only in a person's mind. In the first stage, users iteratively rank\nimages our reconstruction system presents based on their resemblance to a\nmental image. These rankings, in turn, allow the system to extract relevant\nimage features, fuse them into a unified feature vector, and use a generative\nmodel to produce an initial reconstruction of the mental image. The second\nstage leverages an existing face editing method, allowing users to manually\nrefine and further improve this reconstruction using an easy-to-use slider\ninterface for face shape manipulation. To avoid the need for tedious human data\ncollection for training the reconstruction system, we introduce a computational\nuser model of human ranking behaviour. For this, we collected a small face\nranking dataset through an online crowd-sourcing study containing data from 275\nparticipants. We evaluate HAIFAI and an ablated version in a 12-participant\nuser study and demonstrate that our approach outperforms the previous state of\nthe art regarding reconstruction quality, usability, perceived workload, and\nreconstruction speed. We further validate the reconstructions in a subsequent\nface ranking study with 18 participants and show that HAIFAI achieves a new\nstate-of-the-art identification rate of 60.6%. These findings represent a\nsignificant advancement towards developing new interactive intelligent systems\ncapable of reliably and effortlessly reconstructing a user's mental image.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"LpHWTb8jqKLUMEYbrpt4LM960a5rMSe9DmZmPGmxbLo","pdfSize":"14379615"}