{"id":"2412.14952","title":"The impact of rotation on the stochastic excitation of stellar acoustic\n  modes in solar-like pulsators","authors":"Le\\\"ila Bessila, Adrien Deckx van Ruys, Valentin Buriasco, St\\'ephane\n  Mathis, Lisa Bugnet, Rafael A. Garc\\'ia, Savita Mathur","authorsParsed":[["Bessila","Leïla",""],["van Ruys","Adrien Deckx",""],["Buriasco","Valentin",""],["Mathis","Stéphane",""],["Bugnet","Lisa",""],["García","Rafael A.",""],["Mathur","Savita",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 15:33:49 GMT"}],"updateDate":"2024-12-20","timestamp":1734622429000,"abstract":"  Recent observational results from asteroseismic studies show that an\nimportant fraction of solar-like stars do not present detectable stochastically\nexcited acoustic oscillations. This non-detectability seems to correlate with a\nhigh rotation rate in the convective envelope and a high surface magnetic\nactivity. At the same time, the properties of stellar convection are affected\nby rotation and magnetism. We investigate the role of rotation in the\nexcitation of acoustic modes in the convective envelope of solar-like stars, to\nevaluate its impact on the energy injected in the oscillations. We derive\ntheoretical prescriptions for the excitation of acoustic waves in the\nconvective envelope of rotating solar-like stars. We adopt the Rotating\nMixing-Length Theory to model the influence of rotation on convection. We use\nthe MESA stellar evolution code and the GYRE stellar oscillation code to\nestimate the power injected in the oscillations from our theoretical\nprescriptions. We demonstrate that the power injected in the acoustic modes is\ninsensitive to the rotation if a Gaussian time-correlation function is assumed,\nwhile it can decrease by up to 60 % for a Lorentzian time-correlation function,\nfor a $20 \\Omega_{\\odot}$ rotation rate. This result can allow us to better\nconstrain the properties of stellar convection by studying observationally\nacoustic modes excitation. These results demonstrate how important it is to\ntake into account the modification of stellar convection by rotation when\nevaluating the amplitude of the stellar oscillations it stochastically excites.\nThey open the path for understanding the large variety of observed\nacoustic-mode amplitudes at the surface of solar-like stars as a function of\nsurface rotation rates.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"HzUJb2bJqePVqWM4QSaO7SskgHvgb1qdIQ432nf6kSQ","pdfSize":"7118803"}