{
  "id": "2412.06889",
  "title": "Primordial Black Holes (as Dark Matter) from the Supercooled Phase\n  Transitions with Radiative Symmetry Breaking",
  "authors": "Indra Kumar Banerjee, Francesco Rescigno, Alberto Salvio",
  "authorsParsed": [
    [
      "Banerjee",
      "Indra Kumar",
      ""
    ],
    [
      "Rescigno",
      "Francesco",
      ""
    ],
    [
      "Salvio",
      "Alberto",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 19:00:02 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733770802000,
  "abstract": "  We study in detail the production of primordial black holes (PBHs), as well\nas their mass and initial spin, due to the phase transitions corresponding to\nradiative symmetry breaking (RSB) and featuring a large supercooling. The\nlatter property allows us to use a model-independent approach. In this context,\nwe demonstrate that the decay rate of the false vacuum grows exponentially with\ntime to a high degree of accuracy, justifying a time dependence commonly\nassumed in the literature. Our study provides ready-to-use results for\ndetermining the abundance, mass and initial spin of PBHs generated in a generic\nRSB model with large supercooling. We find that PBHs are generically produced\nin a broad region of the model-independent parameter space. Notably, we\nidentify the subregion that may explain recently observed microlensing\nanomalies. Additionally, we show that a simple Standard-Model extension, with\nright-handed neutrinos and gauged $B-L$ featuring RSB, may explain an anomaly\nof this sort in a region of its parameter space.\n",
  "subjects": [
    "Physics/High Energy Physics - Phenomenology",
    "Astrophysics/Cosmology and Nongalactic Astrophysics",
    "Physics/General Relativity and Quantum Cosmology",
    "Physics/High Energy Physics - Theory"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "5WvFIJKJW3qUlQwAxgABwP6xADAd47bREXTaUD3V9fI",
  "pdfSize": "2834445"
}