{
  "id": "2412.07245",
  "title": "Detection with Uncertainty in Target Direction for Dual Functional Radar\n  and Communication Systems",
  "authors": "Mateen Ashraf, Anna Gaydamaka, Dmitri Moltchanov, John Thompson, Mikko\n  Valkama, Bo Tan",
  "authorsParsed": [
    [
      "Ashraf",
      "Mateen",
      ""
    ],
    [
      "Gaydamaka",
      "Anna",
      ""
    ],
    [
      "Moltchanov",
      "Dmitri",
      ""
    ],
    [
      "Thompson",
      "John",
      ""
    ],
    [
      "Valkama",
      "Mikko",
      ""
    ],
    [
      "Tan",
      "Bo",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 07:10:53 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733814653000,
  "abstract": "  Dual functional radar and communication (DFRC) systems are a viable approach\nto extend the services of future communication systems. Most studies designing\nDFRC systems assume that the target direction is known. In our paper, we\naddress a critical scenario where this information is not exactly known. For\nsuch a system, a signal-to-clutter-plus-noise ratio (SCNR) maximization problem\nis formulated. Quality-of-service constraints for communication users (CUs) are\nalso incorporated as constraints on their received\nsignal-to-interference-plus-noise ratios (SINRs). To tackle the nonconvexity,\nan iterative alternating optimization approach is developed where, at each\niteration, the optimization is alternatively performed with respect to transmit\nand receive beamformers. Specifically, a penalty-based approach is used to\nobtain an efficient sub-optimal solution for the resulting subproblem with\nregard to transmit beamformers. Next, a globally optimal solution is obtained\nfor receive beamformers with the help of the Dinkleback approach. The\nconvergence of the proposed algorithm is also proved by proving the\nnondecreasing nature of the objective function with iterations. The numerical\nresults illustrate the effectiveness of the proposed approach. Specifically, it\nis observed that the proposed algorithm converges within almost 3 iterations,\nand the SCNR performance is almost unchanged with the number of possible target\ndirections.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Signal Processing"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "LY3aZ_TQMPL5Y0_8M7nJvfzxAebe7sze4Xx_wm-mPlk",
  "pdfSize": "1626818"
}