{"id":"2412.16829","title":"Visual Prompting with Iterative Refinement for Design Critique\n  Generation","authors":"Peitong Duan, Chin-Yi Chen, Bjoern Hartmann, Yang Li","authorsParsed":[["Duan","Peitong",""],["Chen","Chin-Yi",""],["Hartmann","Bjoern",""],["Li","Yang",""]],"versions":[{"version":"v1","created":"Sun, 22 Dec 2024 02:35:57 GMT"}],"updateDate":"2024-12-24","timestamp":1734834957000,"abstract":"  Feedback is crucial for every design process, such as user interface (UI)\ndesign, and automating design critiques can significantly improve the\nefficiency of the design workflow. Although existing multimodal large language\nmodels (LLMs) excel in many tasks, they often struggle with generating\nhigh-quality design critiques -- a complex task that requires producing\ndetailed design comments that are visually grounded in a given design's image.\nBuilding on recent advancements in iterative refinement of text output and\nvisual prompting methods, we propose an iterative visual prompting approach for\nUI critique that takes an input UI screenshot and design guidelines and\ngenerates a list of design comments, along with corresponding bounding boxes\nthat map each comment to a specific region in the screenshot. The entire\nprocess is driven completely by LLMs, which iteratively refine both the text\noutput and bounding boxes using few-shot samples tailored for each step. We\nevaluated our approach using Gemini-1.5-pro and GPT-4o, and found that human\nexperts generally preferred the design critiques generated by our pipeline over\nthose by the baseline, with the pipeline reducing the gap from human\nperformance by 50% for one rating metric. To assess the generalizability of our\napproach to other multimodal tasks, we applied our pipeline to open-vocabulary\nobject and attribute detection, and experiments showed that our method also\noutperformed the baseline.\n","subjects":["Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"PUqV00CvQ-rYUQZiy5tI_YqZxLmRASYSqQsC7e9NVyk","pdfSize":"5846902"}