{
  "id": "2412.17779",
  "title": "Ergodic Network Stochastic Differential Equations",
  "authors": "Francesco Iafrate and Stefano Iacus",
  "authorsParsed": [
    [
      "Iafrate",
      "Francesco",
      ""
    ],
    [
      "Iacus",
      "Stefano",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 18:38:38 GMT"
    },
    {
      "version": "v2",
      "created": "Mon, 20 Jan 2025 18:25:19 GMT"
    }
  ],
  "updateDate": "2025-01-22",
  "timestamp": 1734979118000,
  "abstract": "  We propose a novel framework for Network Stochastic Differential Equations\n(N-SDE), where each node in a network is governed by an SDE influenced by\ninteractions with its neighbors. The evolution of each node is driven by the\ninterplay of three key components: the node's intrinsic dynamics\n(\\emph{momentum effect}), feedback from neighboring nodes (\\emph{network\neffect}), and a \\emph{stochastic volatility} term modeled by Brownian motion.\nOur primary objective is to estimate the parameters of the N-SDE system from\nhigh-frequency discrete-time observations. The motivation behind this model\nlies in its ability to analyze very high-dimensional time series by leveraging\nthe inherent sparsity of the underlying network graph. We consider two distinct\nscenarios: \\textit{i) known network structure}: the graph is fully specified,\nand we establish conditions under which the parameters can be identified,\nconsidering the linear growth of the parameter space with the number of edges.\n\\textit{ii) unknown network structure}: the graph must be inferred from the\ndata. For this, we develop an iterative procedure using adaptive Lasso,\ntailored to a specific subclass of N-SDE models. In this work, we assume the\nnetwork graph is oriented, paving the way for novel applications of SDEs in\ncausal inference, enabling the study of cause-effect relationships in dynamic\nsystems. Through extensive simulation studies, we demonstrate the performance\nof our estimators across various graph topologies in high-dimensional settings.\nWe also showcase the framework's applicability to real-world datasets,\nhighlighting its potential for advancing the analysis of complex networked\nsystems.\n",
  "subjects": [
    "Statistics/Methodology",
    "Mathematics/Statistics Theory",
    "Statistics/Statistics Theory"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "cLmOebXWzxvdG4orcUCUGcg7ameuGAXLA_VgYS_L3mQ",
  "pdfSize": "753848"
}