{
  "id": "2412.07160",
  "title": "Motion-aware Contrastive Learning for Temporal Panoptic Scene Graph\n  Generation",
  "authors": "Thong Thanh Nguyen, Xiaobao Wu, Yi Bin, Cong-Duy T Nguyen, See-Kiong\n  Ng, Anh Tuan Luu",
  "authorsParsed": [
    [
      "Nguyen",
      "Thong Thanh",
      ""
    ],
    [
      "Wu",
      "Xiaobao",
      ""
    ],
    [
      "Bin",
      "Yi",
      ""
    ],
    [
      "Nguyen",
      "Cong-Duy T",
      ""
    ],
    [
      "Ng",
      "See-Kiong",
      ""
    ],
    [
      "Luu",
      "Anh Tuan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 03:41:07 GMT"
    },
    {
      "version": "v2",
      "created": "Thu, 19 Dec 2024 00:48:45 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1733802067000,
  "abstract": "  To equip artificial intelligence with a comprehensive understanding towards a\ntemporal world, video and 4D panoptic scene graph generation abstracts visual\ndata into nodes to represent entities and edges to capture temporal relations.\nExisting methods encode entity masks tracked across temporal dimensions (mask\ntubes), then predict their relations with temporal pooling operation, which\ndoes not fully utilize the motion indicative of the entities' relation. To\novercome this limitation, we introduce a contrastive representation learning\nframework that focuses on motion pattern for temporal scene graph generation.\nFirstly, our framework encourages the model to learn close representations for\nmask tubes of similar subject-relation-object triplets. Secondly, we seek to\npush apart mask tubes from their temporally shuffled versions. Moreover, we\nalso learn distant representations for mask tubes belonging to the same video\nbut different triplets. Extensive experiments show that our motion-aware\ncontrastive framework significantly improves state-of-the-art methods on both\nvideo and 4D datasets.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "GX3c5t2ZywLsR5XwWlXccchBnz9qfrUmAny6q7yqiUw",
  "pdfSize": "887967"
}