{
  "id": "2412.14203",
  "title": "BlenderLLM: Training Large Language Models for Computer-Aided Design\n  with Self-improvement",
  "authors": "Yuhao Du, Shunian Chen, Wenbo Zan, Peizhao Li, Mingxuan Wang, Dingjie\n  Song, Bo Li, Yan Hu, Benyou Wang",
  "authorsParsed": [
    [
      "Du",
      "Yuhao",
      ""
    ],
    [
      "Chen",
      "Shunian",
      ""
    ],
    [
      "Zan",
      "Wenbo",
      ""
    ],
    [
      "Li",
      "Peizhao",
      ""
    ],
    [
      "Wang",
      "Mingxuan",
      ""
    ],
    [
      "Song",
      "Dingjie",
      ""
    ],
    [
      "Li",
      "Bo",
      ""
    ],
    [
      "Hu",
      "Yan",
      ""
    ],
    [
      "Wang",
      "Benyou",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 14:34:02 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734359642000,
  "abstract": "  The application of Large Language Models (LLMs) in Computer-Aided Design\n(CAD) remains an underexplored area, despite their remarkable advancements in\nother domains. In this paper, we present BlenderLLM, a novel framework for\ntraining LLMs specifically for CAD tasks leveraging a self-improvement\nmethodology. To support this, we developed a bespoke training dataset,\nBlendNet, and introduced a comprehensive evaluation suite, CADBench. Our\nresults reveal that existing models demonstrate significant limitations in\ngenerating accurate CAD scripts. However, through minimal instruction-based\nfine-tuning and iterative self-improvement, BlenderLLM significantly surpasses\nthese models in both functionality and accuracy of CAD script generation. This\nresearch establishes a strong foundation for the application of LLMs in CAD\nwhile demonstrating the transformative potential of self-improving models in\nadvancing CAD automation. We encourage further exploration and adoption of\nthese methodologies to drive innovation in the field. The dataset, model,\nbenchmark, and source code are publicly available at\nhttps://github.com/FreedomIntelligence/BlenderLLM\n",
  "subjects": [
    "Computer Science/Human-Computer Interaction",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "psHDlqrRl9PdqsqQR--kkcWtEAad9EfPnBdvVYeREDE",
  "pdfSize": "46769482"
}