{
  "id": "2412.06546",
  "title": "An efficiency and memory-saving programming paradigm for the unified\n  gas-kinetic scheme",
  "authors": "Yue Zhang, Yufeng Wei, Wenpei Long, Kun Xu",
  "authorsParsed": [
    [
      "Zhang",
      "Yue",
      ""
    ],
    [
      "Wei",
      "Yufeng",
      ""
    ],
    [
      "Long",
      "Wenpei",
      ""
    ],
    [
      "Xu",
      "Kun",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 14:56:24 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733756184000,
  "abstract": "  In recent years, non-equilibrium flows have gained significant attention in\naerospace engineering and micro-electro-mechanical systems. The unified\ngas-kinetic scheme (UGKS) follows the methodology of direct modeling to couple\nparticle collisions and free transport during gas evolution. However, like\nother discrete-velocity-based methods, the UGKS faces challenges related to\nhigh memory requirements and computational costs, such as the possible\nconsumption of $1.32$ TB of memory when using $512$ cores for the simulations\nof the hypersonic flow around an X38-like space vehicle. This paper introduces\na new UGKS programming paradigm for unstructured grids, focusing on reducing\nmemory usage and improving parallel efficiency. By optimizing the computational\nsequence, the current method enables each cell in physical space to store only\nthe distribution function for the discretized velocity space, eliminating the\nneed to retain the entire velocity space for slopes and residuals.\nAdditionally, the parallel communication is enhanced through the use of\nnon-blocking MPI. Numerical experiments demonstrate that the new strategy in\nthe programming effectively simulates non-equilibrium problems while achieving\nhigh computational efficiency and low memory consumption. For the hypersonic\nflow around an X38-like space vehicle, the simulation, which utilizes\n$1,058,685$ physical mesh cells and $4,548$ discrete velocity space mesh cells,\nrequires only $168.12$ GB of memory when executed on $512$ CPU cores. This\nindicates that memory consumption in the UGKS is much reduced. This new\nprogramming paradigm can serve as a reference for discrete velocity methods for\nsolving kinetic equations.\n",
  "subjects": [
    "Physics/Computational Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "gfUiim5zlCmVRytOBo9-W2vSXb-eVjq7zIOjkOM8n50",
  "pdfSize": "6670718"
}