{
  "id": "2412.06619",
  "title": "Copyright-Protected Language Generation via Adaptive Model Fusion",
  "authors": "Javier Abad, Konstantin Donhauser, Francesco Pinto, Fanny Yang",
  "authorsParsed": [
    [
      "Abad",
      "Javier",
      ""
    ],
    [
      "Donhauser",
      "Konstantin",
      ""
    ],
    [
      "Pinto",
      "Francesco",
      ""
    ],
    [
      "Yang",
      "Fanny",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 16:13:17 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733760797000,
  "abstract": "  The risk of language models reproducing copyrighted material from their\ntraining data has led to the development of various protective measures. Among\nthese, inference-time strategies that impose constraints via post-processing\nhave shown promise in addressing the complexities of copyright regulation.\nHowever, they often incur prohibitive computational costs or suffer from\nperformance trade-offs. To overcome these limitations, we introduce\nCopyright-Protecting Model Fusion (CP-Fuse), a novel approach that combines\nmodels trained on disjoint sets of copyrighted material during inference. In\nparticular, CP-Fuse adaptively aggregates the model outputs to minimize the\nreproduction of copyrighted content, adhering to a crucial balancing property\nthat prevents the regurgitation of memorized data. Through extensive\nexperiments, we show that CP-Fuse significantly reduces the reproduction of\nprotected material without compromising the quality of text and code\ngeneration. Moreover, its post-hoc nature allows seamless integration with\nother protective measures, further enhancing copyright safeguards. Lastly, we\nshow that CP-Fuse is robust against common techniques for extracting training\ndata.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Computation and Language",
    "Computer Science/Cryptography and Security"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "pvTCA8Avs6pXIfxFAt-33tVr5uDYm4z7iVzEhcdlIxQ",
  "pdfSize": "1173087"
}