{"id":"2412.02632","title":"Scaling Image Tokenizers with Grouped Spherical Quantization","authors":"Jiangtao Wang, Zhen Qin, Yifan Zhang, Vincent Tao Hu, Bj\\\"orn Ommer,\n  Rania Briq, Stefan Kesselheim","authorsParsed":[["Wang","Jiangtao",""],["Qin","Zhen",""],["Zhang","Yifan",""],["Hu","Vincent Tao",""],["Ommer","Björn",""],["Briq","Rania",""],["Kesselheim","Stefan",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 18:01:45 GMT"},{"version":"v2","created":"Wed, 4 Dec 2024 05:02:45 GMT"}],"updateDate":"2024-12-05","timestamp":1733248905000,"abstract":"  Vision tokenizers have gained a lot of attraction due to their scalability\nand compactness; previous works depend on old-school GAN-based hyperparameters,\nbiased comparisons, and a lack of comprehensive analysis of the scaling\nbehaviours. To tackle those issues, we introduce Grouped Spherical Quantization\n(GSQ), featuring spherical codebook initialization and lookup regularization to\nconstrain codebook latent to a spherical surface. Our empirical analysis of\nimage tokenizer training strategies demonstrates that GSQ-GAN achieves superior\nreconstruction quality over state-of-the-art methods with fewer training\niterations, providing a solid foundation for scaling studies. Building on this,\nwe systematically examine the scaling behaviours of GSQ, specifically in latent\ndimensionality, codebook size, and compression ratios, and their impact on\nmodel performance. Our findings reveal distinct behaviours at high and low\nspatial compression levels, underscoring challenges in representing\nhigh-dimensional latent spaces. We show that GSQ can restructure\nhigh-dimensional latent into compact, low-dimensional spaces, thus enabling\nefficient scaling with improved quality. As a result, GSQ-GAN achieves a 16x\ndown-sampling with a reconstruction FID (rFID) of 0.50.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"1quLfZ-cxLAc7dxkhTQOXe0KtyF4_9BLbNvBcXmKkjg","pdfSize":"9120275"}