{"id":"2412.03212","title":"Semi-Supervised Transfer Boosting (SS-TrBoosting)","authors":"Lingfei Deng, Changming Zhao, Zhenbang Du, Kun Xia and Dongrui Wu","authorsParsed":[["Deng","Lingfei",""],["Zhao","Changming",""],["Du","Zhenbang",""],["Xia","Kun",""],["Wu","Dongrui",""]],"versions":[{"version":"v1","created":"Wed, 4 Dec 2024 10:57:55 GMT"}],"updateDate":"2024-12-05","timestamp":1733309875000,"abstract":"  Semi-supervised domain adaptation (SSDA) aims at training a high-performance\nmodel for a target domain using few labeled target data, many unlabeled target\ndata, and plenty of auxiliary data from a source domain. Previous works in SSDA\nmainly focused on learning transferable representations across domains.\nHowever, it is difficult to find a feature space where the source and target\ndomains share the same conditional probability distribution. Additionally,\nthere is no flexible and effective strategy extending existing unsupervised\ndomain adaptation (UDA) approaches to SSDA settings. In order to solve the\nabove two challenges, we propose a novel fine-tuning framework, semi-supervised\ntransfer boosting (SS-TrBoosting). Given a well-trained deep learning-based UDA\nor SSDA model, we use it as the initial model, generate additional base\nlearners by boosting, and then use all of them as an ensemble. More\nspecifically, half of the base learners are generated by supervised domain\nadaptation, and half by semi-supervised learning. Furthermore, for more\nefficient data transmission and better data privacy protection, we propose a\nsource data generation approach to extend SS-TrBoosting to semi-supervised\nsource-free domain adaptation (SS-SFDA). Extensive experiments showed that\nSS-TrBoosting can be applied to a variety of existing UDA, SSDA and SFDA\napproaches to further improve their performance.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"2-xRiVHM88SLDlJd7BvrmAjL6kCROruyupHqg90k6Oo","pdfSize":"972602"}