{
  "id": "2412.16138",
  "title": "Cross-sectional Topology Optimization of Slender Soft Pneumatic\n  Actuators using Genetic Algorithms and Geometrically Exact Beam Models",
  "authors": "Leon Schindler and Kristin Miriam de Payrebrune",
  "authorsParsed": [
    [
      "Schindler",
      "Leon",
      ""
    ],
    [
      "de Payrebrune",
      "Kristin Miriam",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 18:38:10 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734719890000,
  "abstract": "  The design of soft robots is still commonly driven by manual trial-and-error\napproaches, requiring the manufacturing of multiple physical prototypes, which\nin the end, is time-consuming and requires significant expertise. To reduce the\nnumber of manual interventions in this process, topology optimization can be\nused to assist the design process. The design is then guided by simulations and\nnumerous prototypes can be tested in simulation rather than being evaluated\nthrough laborious experiments. To implement this simulation-driven design\nprocess, the possible design space of a slender soft pneumatic actuator is\ngeneralized to the design of the circular cross-section. We perform a black-box\ntopology optimization using genetic algorithms to obtain a cross-sectional\ndesign of a soft pneumatic actuator that is capable of reaching a target\nworkspace defined by the end-effector positions at different pressure values.\nThis design method is evaluated for three different case studies and target\nworkspaces, which were either randomly generated or specified by the operator\nof the design assistant. The black-box topology optimization based on genetic\nalgorithms proves to be capable of finding good designs under given plausible\ntarget workspaces. We considered a simplified simulation model to verify the\nefficacy of the employed method. An experimental validation has not yet been\nperformed. It can be concluded that the employed black-box topology\noptimization can assist in the design process for slender soft pneumatic\nactuators. It supports at searching for possible design prototypes that reach\npoints specified by corresponding actuation pressures. This helps reduce the\ntrial-and-error driven iterative manual design process and enables the operator\nto focus on prototypes that already offer a good viable solution.\n",
  "subjects": [
    "Computer Science/Robotics",
    "Physics/Computational Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "WzBbelXrxVmc-0R8V6UTbYNyNqtzQNViHDVYeubN_Ok",
  "pdfSize": "1128196"
}