{
  "id": "2412.13439",
  "title": "Rare Event Detection in Imbalanced Multi-Class Datasets Using an Optimal\n  MIP-Based Ensemble Weighting Approach",
  "authors": "Georgios Tertytchny, Georgios L. Stavrinides, Maria K. Michael",
  "authorsParsed": [
    [
      "Tertytchny",
      "Georgios",
      ""
    ],
    [
      "Stavrinides",
      "Georgios L.",
      ""
    ],
    [
      "Michael",
      "Maria K.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 02:20:51 GMT"
    },
    {
      "version": "v2",
      "created": "Fri, 20 Dec 2024 12:49:05 GMT"
    },
    {
      "version": "v3",
      "created": "Fri, 31 Jan 2025 14:05:16 GMT"
    }
  ],
  "updateDate": "2025-02-03",
  "timestamp": 1734488451000,
  "abstract": "  To address the challenges of imbalanced multi-class datasets typically used\nfor rare event detection in critical cyber-physical systems, we propose an\noptimal, efficient, and adaptable mixed integer programming (MIP) ensemble\nweighting scheme. Our approach leverages the diverse capabilities of the\nclassifier ensemble on a granular per class basis, while optimizing the weights\nof classifier-class pairs using elastic net regularization for improved\nrobustness and generalization. Additionally, it seamlessly and optimally\nselects a predefined number of classifiers from a given set. We evaluate and\ncompare our MIP-based method against six well-established weighting schemes,\nusing representative datasets and suitable metrics, under various ensemble\nsizes. The experimental results reveal that MIP outperforms all existing\napproaches, achieving an improvement in balanced accuracy ranging from 0.99% to\n7.31%, with an overall average of 4.53% across all datasets and ensemble sizes.\nFurthermore, it attains an overall average increase of 4.63%, 4.60%, and 4.61%\nin macro-averaged precision, recall, and F1-score, respectively, while\nmaintaining computational efficiency.\n",
  "subjects": [
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Vq9FZ4_yBxH5IM1BYS_pvmbFf5UnZbxd2STDW3tP4Dg",
  "pdfSize": "765434"
}