{
  "id": "2412.10232",
  "title": "QCD Axion Dark Matter from level crossing with refined adiabatic\n  condition",
  "authors": "Kai Murai, Yuma Narita, Fuminobu Takahashi, Wen Yin",
  "authorsParsed": [
    [
      "Murai",
      "Kai",
      ""
    ],
    [
      "Narita",
      "Yuma",
      ""
    ],
    [
      "Takahashi",
      "Fuminobu",
      ""
    ],
    [
      "Yin",
      "Wen",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 16:02:37 GMT"
    }
  ],
  "updateDate": "2024-12-16",
  "timestamp": 1734105757000,
  "abstract": "  We investigate the level-crossing phenomenon in two-axion systems, where the\nmass eigenvalues intersect as the mass of one axion increases with the cooling\nof the universe. This phenomenon can significantly alter the abundance of\naxions in the early universe. Our study focuses on its impact on the QCD axion\nand an axion-like particle, identifying viable regions of axion mass and decay\nconstant that explain the observed dark matter. We demonstrate the equivalence\nof two different bases for describing the axion system in the existing\nliterature. Furthermore, we derive an improved expression for the adiabatic\ncondition that overcomes limitations in earlier formulations. This new\nformulation is basis-independent, and we numerically validate its\neffectiveness. Our analysis reveals specific relations between axion masses and\naxion-photon couplings within the viable region. These relations could\npotentially serve as a smoking gun signal for this scenario if confirmed\nexperimentally. We also find that, using the chiral perturbation model, the\nthermal friction on the QCD axion might be significantly larger than previously\nestimated. Additionally, we show that a simple model with axion mixing can\nnaturally realize either a heavier or lighter QCD axion.\n",
  "subjects": [
    "Physics/High Energy Physics - Phenomenology",
    "Astrophysics/Cosmology and Nongalactic Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "zoKmMPPv1oMNnV9ES9qCVk3wQ7UB6Pnuh5vrQ66YVHk",
  "pdfSize": "3870077"
}