{
  "id": "2412.12476",
  "title": "Interfacial Perpendicular Magnetic Anisotropy of Ultrathin Fe(001) Film\n  Grown on CoO(001) Surface",
  "authors": "Tong Wu, Yunzhuo Wu, Haoran Chen, Hongyue Xu, Zhen Cheng, Yuanfei Fan,\n  Nan Jiang, Wentao Qin, Yongwei Cui, Yuqiang Gao, Guanhua Zhang, Zhe Yuan,\n  Yizheng Wu",
  "authorsParsed": [
    [
      "Wu",
      "Tong",
      ""
    ],
    [
      "Wu",
      "Yunzhuo",
      ""
    ],
    [
      "Chen",
      "Haoran",
      ""
    ],
    [
      "Xu",
      "Hongyue",
      ""
    ],
    [
      "Cheng",
      "Zhen",
      ""
    ],
    [
      "Fan",
      "Yuanfei",
      ""
    ],
    [
      "Jiang",
      "Nan",
      ""
    ],
    [
      "Qin",
      "Wentao",
      ""
    ],
    [
      "Cui",
      "Yongwei",
      ""
    ],
    [
      "Gao",
      "Yuqiang",
      ""
    ],
    [
      "Zhang",
      "Guanhua",
      ""
    ],
    [
      "Yuan",
      "Zhe",
      ""
    ],
    [
      "Wu",
      "Yizheng",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 02:26:55 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734402415000,
  "abstract": "  Exploring novel systems with perpendicular magnetic anisotropy (PMA) is vital\nfor advancing memory devices. In this study, we report an intriguing PMA system\ninvolving an ultrathin Fe layer on an antiferromagnetic (AFM) CoO(001) surface.\nThe measured perpendicular anisotropy field is inversely proportional to the Fe\nthickness, indicating an interfacial origin of PMA. Temperature-dependent\nmeasurements reveal that the antiferromagnetism of CoO has a negligible effect\non the PMA. By leveraging the magneto-optical Kerr effect and birefringence\neffect, we achieved concurrent visualization of ferromagnetic (FM) and AFM\ndomains. A pronounced coupling effect between these domains was observed near\nthe spin reorientation transition, contrasting sharply with areas of stronger\nPMA that exhibited weak coupling. This research not only establishes a new\nFM/AFM bilayer PMA system but also significantly advances the understanding of\nFM/AFM interfacial interactions.\n",
  "subjects": [
    "Condensed Matter/Materials Science"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "f2Fbk75pE5yXnx6cBZWKAE2eIqbZOwP1HpakyfNZals",
  "pdfSize": "1812138"
}