{"id":"2412.19198","title":"Multi-Attribute Constraint Satisfaction via Language Model Rewriting","authors":"Ashutosh Baheti, Debanjana Chakraborty, Faeze Brahman, Ronan Le Bras,\n  Ximing Lu, Nouha Dziri, Yejin Choi, Mark Riedl, Maarten Sap","authorsParsed":[["Baheti","Ashutosh",""],["Chakraborty","Debanjana",""],["Brahman","Faeze",""],["Bras","Ronan Le",""],["Lu","Ximing",""],["Dziri","Nouha",""],["Choi","Yejin",""],["Riedl","Mark",""],["Sap","Maarten",""]],"versions":[{"version":"v1","created":"Thu, 26 Dec 2024 12:36:39 GMT"}],"updateDate":"2024-12-30","timestamp":1735216599000,"abstract":"  Obeying precise constraints on top of multiple external attributes is a\ncommon computational problem underlying seemingly different domains, from\ncontrolled text generation to protein engineering. Existing language model (LM)\ncontrollability methods for multi-attribute constraint satisfaction often rely\non specialized architectures or gradient-based classifiers, limiting their\nflexibility to work with arbitrary black-box evaluators and pretrained models.\nCurrent general-purpose large language models, while capable, cannot achieve\nfine-grained multi-attribute control over external attributes. Thus, we create\nMulti-Attribute Constraint Satisfaction (MACS), a generalized method capable of\nfinetuning language models on any sequential domain to satisfy user-specified\nconstraints on multiple external real-value attributes. Our method trains LMs\nas editors by sampling diverse multi-attribute edit pairs from an initial set\nof paraphrased outputs. During inference, LM iteratively improves upon its\nprevious solution to satisfy constraints for all attributes by leveraging our\ndesigned constraint satisfaction reward. We additionally experiment with\nreward-weighted behavior cloning to further improve the constraint satisfaction\nrate of LMs. To evaluate our approach, we present a new Fine-grained Constraint\nSatisfaction (FineCS) benchmark, featuring two challenging tasks: (1) Text\nStyle Transfer, where the goal is to simultaneously modify the sentiment and\ncomplexity of reviews, and (2) Protein Design, focusing on modulating\nfluorescence and stability of Green Fluorescent Proteins (GFP). Our empirical\nresults show that MACS achieves the highest threshold satisfaction in both\nFineCS tasks, outperforming strong domain-specific baselines. Our work opens\nnew avenues for generalized and real-value multi-attribute control, with\nimplications for diverse applications spanning NLP and bioinformatics.\n","subjects":["Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"m2RV4sLFLjGTtFhZpMZBvuMGDnj7vK_Yv-Bje5YZlz0","pdfSize":"10309381"}