{
  "id": "2412.17370",
  "title": "Cech Complex Generation with Homotopy Equivalence Framework for\n  Myocardial Infarction Diagnosis using Electrocardiogram Signals",
  "authors": "Srikireddy Dhanunjay Reddy, Pujayita Deb, Tharun Kumar Reddy Bollu",
  "authorsParsed": [
    [
      "Reddy",
      "Srikireddy Dhanunjay",
      ""
    ],
    [
      "Deb",
      "Pujayita",
      ""
    ],
    [
      "Bollu",
      "Tharun Kumar Reddy",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 08:12:59 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734941579000,
  "abstract": "  Early and optimal identification of cardiac anomalies, especially Myocardial\ninfarction (MCI) can aid the individual in obtaining prompt medical attention\nto mitigate the severity. Electrocardiogram (ECG) is a simple non-invasive\nphysiological signal modality, that can be used to examine the electrical\nactivity of heart tissue. Existing methods for MCI detection mostly rely on the\ntemporal, frequency, and spatial domain analysis of the ECG signals. These\nconventional techniques lack in effective identification of cardiac cycle\ninter-dependency during diagnosis. Hence, there is an emerging need for\nincorporating the underlying connectivity of the intra-sessional cardiac cycles\nfor improved anomaly detection. This article proposes a novel framework for ECG\nsignal analysis and classification using persistent homological features\nthrough Cech Complex generation with homotopy equivalence check, by taking the\nabove-mentioned emerging needs into account. Homological features like\npersistent birth-death rates, betti curves, and persistent entropy provide\ntransparency of the regional and cardiac cycle connectivity when combined with\nMachine Learning (ML) models. The proposed framework is assessed using publicly\navailable datasets (MIT-BIH and PTB), and the performance metrics of machine\nlearning models indicate its efficacy in classifying Normal Sinus Rhythm (NSR),\nMCI, and non-MCI subjects, achieving a 2.8% mean improvement in AUC (area under\nthe ROC curve) over existing approaches.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Signal Processing"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Xlmipg5UhlJ4l8a1GMuoyIAAddej7OC6M-9VCWIZy_E",
  "pdfSize": "5500336"
}