{"id":"2412.02659","title":"Adaptive Informed Deep Neural Networks for Power Flow Analysis","authors":"Zeynab Kaseb and Stavros Orfanoudakis and Pedro P. Vergara and Peter\n  Palensky","authorsParsed":[["Kaseb","Zeynab",""],["Orfanoudakis","Stavros",""],["Vergara","Pedro P.",""],["Palensky","Peter",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 18:33:48 GMT"}],"updateDate":"2024-12-04","timestamp":1733250828000,"abstract":"  This study introduces PINN4PF, an end-to-end deep learning architecture for\npower flow (PF) analysis that effectively captures the nonlinear dynamics of\nlarge-scale modern power systems. The proposed neural network (NN) architecture\nconsists of two important advancements in the training pipeline: (A) a\ndouble-head feed-forward NN that aligns with PF analysis, including an\nactivation function that adjusts to active and reactive power consumption\npatterns, and (B) a physics-based loss function that partially incorporates\npower system topology information. The effectiveness of the proposed\narchitecture is illustrated through 4-bus, 15-bus, 290-bus, and 2224-bus test\nsystems and is evaluated against two baselines: a linear regression model (LR)\nand a black-box NN (MLP). The comparison is based on (i) generalization\nability, (ii) robustness, (iii) impact of training dataset size on\ngeneralization ability, (iv) accuracy in approximating derived PF quantities\n(specifically line current, line active power, and line reactive power), and\n(v) scalability. Results demonstrate that PINN4PF outperforms both baselines\nacross all test systems by up to two orders of magnitude not only in terms of\ndirect criteria, e.g., generalization ability but also in terms of\napproximating derived physical quantities.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computer Science/Artificial Intelligence","Computer Science/Systems and Control","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"bPTityRK4P5fxNN2icqno_1qIU4rTLzQceppnBnnytk","pdfSize":"1456421"}