{"id":"2412.11002","title":"Communications over Unlicensed sub-8 GHz Spectrum: Opportunities and\n  Challenges","authors":"Karim Saifullin, Hussein Al-Shatri and Mohamed-Slim Alouini","authorsParsed":[["Saifullin","Karim",""],["Al-Shatri","Hussein",""],["Alouini","Mohamed-Slim",""]],"versions":[{"version":"v1","created":"Sun, 15 Dec 2024 00:34:28 GMT"}],"updateDate":"2024-12-17","timestamp":1734222868000,"abstract":"  The utilization of unlicensed spectrum presents a promising solution to the\nissue of spectrum scarcity in densely populated areas, while also offering a\ncost-effective means to connect underserved regions. In response to this\npotential, both academia and industry are actively exploring innovative\napplications of unlicensed spectrum. This work offers a thorough overview of\nunlicensed spectrum bands below 8 GHz, including TV White Spaces, Civil\nBroadband Radio Services, Industrial Scientific Medical bands, and the\nUnlicensed National Information Infrastructure. The paper focuses on three key\naspects: regulations, existing technologies, and applications. It is essential\nto recognize that \"unlicensed\" does not equate to \"unregulated\"; therefore, a\nclear understanding of permissible and prohibited activities is crucial. From a\ntechnological perspective, we examine the current technologies, their\ncapabilities, and relevant applications. Additionally, the shared nature of\nthis spectrum introduces challenges related to interference among users. These\ncollisions can be managed through two primary strategies, that we described: a\ndatabase-driven approach and coexistence mechanisms at the MAC and PHY layers.\nThis work may serve as a starting point for those who are interested in the\nunlicensed spectrum, both in academia and industry.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computer Science/Networking and Internet Architecture"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"iRijDTRqutPi_NkcFA5piwSd6m7jb79Rka11fKQ4TDI","pdfSize":"450805"}