{
  "id": "2412.06569",
  "title": "Dynamics of Non-superconducting Pairs in YBa2Cu3O7-{\\delta} Below Tc",
  "authors": "Jinzhong Zhang, Xinhang Cai, Qingming Huang, Yihong Chen, Zhangqiang\n  Yang, Zhiyuan Sun, Ye Yang",
  "authorsParsed": [
    [
      "Zhang",
      "Jinzhong",
      ""
    ],
    [
      "Cai",
      "Xinhang",
      ""
    ],
    [
      "Huang",
      "Qingming",
      ""
    ],
    [
      "Chen",
      "Yihong",
      ""
    ],
    [
      "Yang",
      "Zhangqiang",
      ""
    ],
    [
      "Sun",
      "Zhiyuan",
      ""
    ],
    [
      "Yang",
      "Ye",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 15:25:00 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733757900000,
  "abstract": "  Pairing states are essential for understanding the underlying mechanisms of\nhigh-temperature superconductivity. Here the non-superconducting state in an\noptimally doped YBa2Cu3O7-{\\delta} film was driven out of equilibrium by an\noptical pump with low fluence at a temperature well below the critical\ntemperature (Tc), and its recovery dynamics were exclusively measured using\ntransient terahertz spectroscopy. The pump-fluence dependent experiments\nunveiled evidence of local pairs without superconductivity coexisting with the\nsuperconducting Cooper pairs. An energy gap opening induced by the local\npairing with short-range coherence was invoked to rationalize the\ntemperature-dependent recovery time of local pairs with a characteristic\ndivergence at a temperature substantially below Tc. These local pairs displayed\nremarkable likeness to the short-range pair-density-wave state. Our finding\nshed light on understanding the dynamic interplay between the coexisting\nsuperconducting and non-superconducting pairs in cuprate superconductors.\n",
  "subjects": [
    "Condensed Matter/Superconductivity"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "jdV9fKQR8fzaOJW2z9FhDboyyO0n6BMLvJ2NRdv0qK4",
  "pdfSize": "724954"
}