{"id":"2412.18405","title":"Generalized Mean Absolute Directional Loss as a Solution to Overfitting\n  and High Transaction Costs in Machine Learning Models Used in High-Frequency\n  Algorithmic Investment Strategies","authors":"Jakub Micha\\'nk\\'ow, Pawe{\\l} Sakowski, Robert \\'Slepaczuk","authorsParsed":[["Michańków","Jakub",""],["Sakowski","Paweł",""],["Ślepaczuk","Robert",""]],"versions":[{"version":"v1","created":"Tue, 24 Dec 2024 12:51:40 GMT"}],"updateDate":"2024-12-25","timestamp":1735044700000,"abstract":"  Regardless of the selected asset class and the level of model complexity\n(Transformer versus LSTM versus Perceptron/RNN), the GMADL loss function\nproduces superior results than standard MSE-type loss functions and has better\nnumerical properties in the context of optimization than MADL. Better results\nmean the possibility of achieving a higher risk-weighted return based on buy\nand sell signals built on forecasts generated by a given theoretical model\nestimated using the GMADL versus MSE or MADL function. In practice, GMADL\nsolves the problem of selecting the most preferable feature in both\nclassification and regression problems, improving the performance of each\nestimation. What is important is that, through additional parameterization,\nGMADL also solves the problem of optimizing investment systems on\nhigh-frequency data in such a way that they focus on strategy variants that\ncontain fewer transactions so that transaction costs do not reduce the\neffectiveness of a given strategy to zero. Moreover, the implementation\nleverages state-of-the-art machine learning tools, including frameworks for\nhyperparameter tuning, architecture testing, and walk-forward optimization,\nensuring robust and scalable solutions for real-world algorithmic trading.\n","subjects":["Quantitative Finance/Computational Finance","Quantitative Finance/Trading and Market Microstructure"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"nNcFnyxl18GtyZ1eR7FBqenW-OnTEeQS-yQwR0LBpBY","pdfSize":"4316908"}