{
  "id": "2412.11682",
  "title": "NEST: A Neuromodulated Small-world Hypergraph Trajectory Prediction\n  Model for Autonomous Driving",
  "authors": "Chengyue Wang, Haicheng Liao, Bonan Wang, Yanchen Guan, Bin Rao,\n  Ziyuan Pu, Zhiyong Cui, Chengzhong Xu, Zhenning Li",
  "authorsParsed": [
    [
      "Wang",
      "Chengyue",
      ""
    ],
    [
      "Liao",
      "Haicheng",
      ""
    ],
    [
      "Wang",
      "Bonan",
      ""
    ],
    [
      "Guan",
      "Yanchen",
      ""
    ],
    [
      "Rao",
      "Bin",
      ""
    ],
    [
      "Pu",
      "Ziyuan",
      ""
    ],
    [
      "Cui",
      "Zhiyong",
      ""
    ],
    [
      "Xu",
      "Chengzhong",
      ""
    ],
    [
      "Li",
      "Zhenning",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 11:49:12 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734349752000,
  "abstract": "  Accurate trajectory prediction is essential for the safety and efficiency of\nautonomous driving. Traditional models often struggle with real-time\nprocessing, capturing non-linearity and uncertainty in traffic environments,\nefficiency in dense traffic, and modeling temporal dynamics of interactions. We\nintroduce NEST (Neuromodulated Small-world Hypergraph Trajectory Prediction), a\nnovel framework that integrates Small-world Networks and hypergraphs for\nsuperior interaction modeling and prediction accuracy. This integration enables\nthe capture of both local and extended vehicle interactions, while the\nNeuromodulator component adapts dynamically to changing traffic conditions. We\nvalidate the NEST model on several real-world datasets, including nuScenes,\nMoCAD, and HighD. The results consistently demonstrate that NEST outperforms\nexisting methods in various traffic scenarios, showcasing its exceptional\ngeneralization capability, efficiency, and temporal foresight. Our\ncomprehensive evaluation illustrates that NEST significantly improves the\nreliability and operational efficiency of autonomous driving systems, making it\na robust solution for trajectory prediction in complex traffic environments.\n",
  "subjects": [
    "Computer Science/Robotics",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "2JYcoqqUpiLCuv13NzgagbOLvqw5Mhq6KdgYlse8re4",
  "pdfSize": "1936002"
}