{"id":"2412.04184","title":"Modeling Eye Gaze Velocity Trajectories using GANs with Spectral Loss\n  for Enhanced Fidelity","authors":"Shailendra Bhandari, Pedro Lencastre, Rujeena Mathema, Alexander\n  Szorkovszky, Anis Yazidi, Pedro Lind","authorsParsed":[["Bhandari","Shailendra",""],["Lencastre","Pedro",""],["Mathema","Rujeena",""],["Szorkovszky","Alexander",""],["Yazidi","Anis",""],["Lind","Pedro",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 14:23:40 GMT"}],"updateDate":"2024-12-09","timestamp":1733408620000,"abstract":"  Accurate modeling of eye gaze dynamics is essential for advancement in\nhuman-computer interaction, neurological diagnostics, and cognitive research.\nTraditional generative models like Markov models often fail to capture the\ncomplex temporal dependencies and distributional nuance inherent in eye gaze\ntrajectories data. This study introduces a GAN framework employing LSTM and CNN\ngenerators and discriminators to generate high-fidelity synthetic eye gaze\nvelocity trajectories. We conducted a comprehensive evaluation of four GAN\narchitectures: CNN-CNN, LSTM-CNN, CNN-LSTM, and LSTM-LSTM trained under two\nconditions: using only adversarial loss and using a weighted combination of\nadversarial and spectral losses. Our findings reveal that the LSTM-CNN\narchitecture trained with this new loss function exhibits the closest alignment\nto the real data distribution, effectively capturing both the distribution\ntails and the intricate temporal dependencies. The inclusion of spectral\nregularization significantly enhances the GANs ability to replicate the\nspectral characteristics of eye gaze movements, leading to a more stable\nlearning process and improved data fidelity. Comparative analysis with an HMM\noptimized to four hidden states further highlights the advantages of the\nLSTM-CNN GAN. Statistical metrics show that the HMM-generated data\nsignificantly diverges from the real data in terms of mean, standard deviation,\nskewness, and kurtosis. In contrast, the LSTM-CNN model closely matches the\nreal data across these statistics, affirming its capacity to model the\ncomplexity of eye gaze dynamics effectively. These results position the\nspectrally regularized LSTM-CNN GAN as a robust tool for generating synthetic\neye gaze velocity data with high fidelity.\n","subjects":["Computer Science/Neural and Evolutionary Computing","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"RxdBOA5ttGEyhvBl5BsykEU3IbmdpDwgJnvIlNF4UYE","pdfSize":"3579896"}