{"id":"2412.13843","title":"A Review on Deep Learning Autoencoder in the Design of Next-Generation\n  Communication Systems","authors":"Omar Alnaseri, Laith Alzubaidi, Yassine Himeur and Jens Timmermann","authorsParsed":[["Alnaseri","Omar",""],["Alzubaidi","Laith",""],["Himeur","Yassine",""],["Timmermann","Jens",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 13:36:44 GMT"}],"updateDate":"2024-12-19","timestamp":1734529004000,"abstract":"  Traditional mathematical models used in designing next-generation\ncommunication systems often fall short due to inherent simplifications, narrow\nscope, and computational limitations. In recent years, the incorporation of\ndeep learning (DL) methodologies into communication systems has made\nsignificant progress in system design and performance optimisation.\nAutoencoders (AEs) have become essential, enabling end-to-end learning that\nallows for the combined optimisation of transmitters and receivers.\nConsequently, AEs offer a data-driven methodology capable of bridging the gap\nbetween theoretical models and real-world complexities. The paper presents a\ncomprehensive survey of the application of AEs within communication systems,\nwith a particular focus on their architectures, associated challenges, and\nfuture directions. We examine 120 recent studies across wireless, optical,\nsemantic, and quantum communication fields, categorising them according to\ntransceiver design, channel modelling, digital signal processing, and\ncomputational complexity. This paper further examines the challenges\nencountered in the implementation of AEs, including the need for extensive\ntraining data, the risk of overfitting, and the requirement for differentiable\nchannel models. Through data-driven approaches, AEs provide robust solutions\nfor end-to-end system optimisation, surpassing traditional mathematical models\nconfined by simplifying assumptions. This paper also summarises the\ncomputational complexity associated with AE-based systems by conducting an\nin-depth analysis employing the metric of floating-point operations per second\n(FLOPS). This analysis encompasses the evaluation of matrix multiplications,\nbias additions, and activation functions. This survey aims to establish a\nroadmap for future research, emphasising the transformative potential of AEs in\nthe formulation of next-generation communication systems.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"07eLlYvhZb-gQRXOB3aQDkYeU53s7u3cC81QfOYW-JY","pdfSize":"3265449"}