{
  "id": "2412.12254",
  "title": "Gauge-Fermion Cartography: from confinement and chiral symmetry breaking\n  to conformality",
  "authors": "Florian Goertz, \\'Alvaro Pastor-Guti\\'errez and Jan M. Pawlowski",
  "authorsParsed": [
    [
      "Goertz",
      "Florian",
      ""
    ],
    [
      "Pastor-Gutiérrez",
      "Álvaro",
      ""
    ],
    [
      "Pawlowski",
      "Jan M.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 19:00:01 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734375601000,
  "abstract": "  We study, for the first time, the interplay between colour-confining and\nchiral symmetry-breaking dynamics in gauge-fermion systems with a general\nnumber of flavours and colours. Specifically, we work out the flavour\ndependence of the confinement and chiral symmetry breaking scales. We connect\nthe QCD-like regime, in quantitative agreement with lattice data, with the\nperturbative conformal limit, thereby exploring uncharted region of theory\nspace. This analysis is done within the first-principles functional\nrenormalisation group approach to gauge-fermion systems and is facilitated by a\nnovel approximation scheme introduced here. This novel scheme enables a\nrelatively simple access to the confining dynamics. This allows us to\ninvestigate the whole landscape of many-flavour theories and to provide a\ncartography of their phase structure. In particular, we uncover a novel phase\nwith the locking of confining and chiral dynamics at intermediate flavour\nnumbers. We also explore the close-conformal region that displays a walking\nbehaviour. Finally, we provide a quantitative estimate for the lower boundary\nof the conformal Caswell-Banks-Zaks window, with a $N^{\\rm crit}_f(N_c=3)=\n9.60^{+0.55}_{-0.53}$. This work offers a self-consistent framework for\ncharting the landscape of strongly interacting gauge-fermion theories necessary\nto reliably study strongly coupled extensions of the Standard Model of particle\nphysics.\n",
  "subjects": [
    "Physics/High Energy Physics - Theory",
    "Physics/High Energy Physics - Lattice",
    "Physics/High Energy Physics - Phenomenology"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "HjZfRBlcUQr-uyqtcCIlg0Rg_fxwztz6nuNtqyYv6-w",
  "pdfSize": "4943479"
}