{"id":"2412.01524","title":"Opinion Dynamic Under Malicious Agent Influence in Multi-Agent Systems:\n  From the Perspective of Opinion Evolution Cost","authors":"Yuhan Suo and Runqi Chai and Senchun Chai and Ishrak MD Farhan and\n  Xudong Zhao and Yuanqing Xia","authorsParsed":[["Suo","Yuhan",""],["Chai","Runqi",""],["Chai","Senchun",""],["Farhan","Ishrak MD",""],["Zhao","Xudong",""],["Xia","Yuanqing",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 14:16:25 GMT"},{"version":"v2","created":"Fri, 13 Dec 2024 07:00:57 GMT"}],"updateDate":"2024-12-16","timestamp":1733148985000,"abstract":"  In human social systems, debates are often seen as a means to resolve\ndifferences of opinion. However, in reality, debates frequently incur\nsignificant communication costs, especially when dealing with stubborn\nopponents. Inspired by this phenomenon, this paper examines the impact of\nmalicious agents on the evolution of normal agents' opinions from the\nperspective of opinion evolution cost, and proposes corresponding solutions for\nthe scenario in which malicious agents hold different opinions in multi-agent\nsystems(MASs). First, this paper analyzes the negative impact of malicious\nagents on the opinion evolution process, reveals the additional evolution cost\nit brings, and provides a theoretical basis for the subsequent solutions.\nSecondly, based on the characteristics of opinion evolution, the malicious\nagent isolation algorithm based on opinion evolution direction vector is\nproposed, which does not strongly restrict the proportion of malicious agents.\nAdditionally, an evolution rate adjustment mechanism is introduced, allowing\nthe system to flexibly regulate the evolution process in complex situations,\neffectively achieving the trade-off between opinion evolution rate and cost.\nExtensive numerical simulations demonstrate that the algorithm can effectively\neliminate the negative influence of malicious agents and achieve a balance\nbetween opinion evolution costs and convergence speed.\n","subjects":["Computer Science/Multiagent Systems","Computer Science/Social and Information Networks","Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"sTjmg2On32N9EywIsZ9MtEh-acYzSHLxW4qf4zZgbiI","pdfSize":"823652"}