{
  "id": "2412.06553",
  "title": "Primordial non-Gaussianity -- the effects of relativistic and wide-angle\n  corrections to the power spectrum",
  "authors": "S\\^ecloka L. Guedezounme and Sheean Jolicoeur and Roy Maartens",
  "authorsParsed": [
    [
      "Guedezounme",
      "Sêcloka L.",
      ""
    ],
    [
      "Jolicoeur",
      "Sheean",
      ""
    ],
    [
      "Maartens",
      "Roy",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 15:02:38 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733756558000,
  "abstract": "  Wide-angle and relativistic corrections to the Newtonian and flat-sky\napproximations are important for accurate modelling of the galaxy power\nspectrum of next-generation galaxy surveys. In addition to Doppler and\nSachs-Wolfe relativistic corrections, we include the effects of lensing\nconvergence, time delay and integrated Sachs-Wolfe. We investigate the impact\nof these corrections on measurements of the local primordial non-Gaussianity\nparameter $f_{\\rm NL}$, using two futuristic spectroscopic galaxy surveys,\nplanned for SKAO2 and MegaMapper. In addition to the monopole, we include the\nquadrupole of the galaxy Fourier power spectrum. The quadrupole is much more\nsensitive to the corrections than the monopole. The combination with the\nquadrupole improves the precision on $f_{\\rm NL}$ by $\\sim {40}\\%$ and $\\sim\n{60}\\%$ for SKAO2 and MegaMapper respectively. Neglecting the wide-angle and\nrelativistic corrections produces a shift in $f_{\\rm NL}$ of $\\sim {0.1}\\sigma$\nand $\\sim {0.2}\\sigma$ for SKAO2 and MegaMapper. The shift in $f_{\\rm NL}$ is\nvery sensitive to the magnification bias and the redshift evolution of the\ncomoving number density. For these surveys, the contributions to the shift from\nintegrated and non-integrated effects partly cancel. We point out that some of\nthe approximations made in the corrections may artificially suppress the shift\nin $f_{\\rm NL}$.\n",
  "subjects": [
    "Astrophysics/Cosmology and Nongalactic Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "SFyYNBvx5H8td1mnemop8TcaK2zBTJjSZ_IBDq3oh-s",
  "pdfSize": "1704170"
}