{
  "id": "2412.14580",
  "title": "DiffSim: Taming Diffusion Models for Evaluating Visual Similarity",
  "authors": "Yiren Song, Xiaokang Liu, Mike Zheng Shou",
  "authorsParsed": [
    [
      "Song",
      "Yiren",
      ""
    ],
    [
      "Liu",
      "Xiaokang",
      ""
    ],
    [
      "Shou",
      "Mike Zheng",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 07:00:03 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734591603000,
  "abstract": "  Diffusion models have fundamentally transformed the field of generative\nmodels, making the assessment of similarity between customized model outputs\nand reference inputs critically important. However, traditional perceptual\nsimilarity metrics operate primarily at the pixel and patch levels, comparing\nlow-level colors and textures but failing to capture mid-level similarities and\ndifferences in image layout, object pose, and semantic content. Contrastive\nlearning-based CLIP and self-supervised learning-based DINO are often used to\nmeasure semantic similarity, but they highly compress image features,\ninadequately assessing appearance details. This paper is the first to discover\nthat pretrained diffusion models can be utilized for measuring visual\nsimilarity and introduces the DiffSim method, addressing the limitations of\ntraditional metrics in capturing perceptual consistency in custom generation\ntasks. By aligning features in the attention layers of the denoising U-Net,\nDiffSim evaluates both appearance and style similarity, showing superior\nalignment with human visual preferences. Additionally, we introduce the Sref\nand IP benchmarks to evaluate visual similarity at the level of style and\ninstance, respectively. Comprehensive evaluations across multiple benchmarks\ndemonstrate that DiffSim achieves state-of-the-art performance, providing a\nrobust tool for measuring visual coherence in generative models.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "HKq4lLJBKee-uY4gP2ZhiH4h1h6mCA9YmKvOXPC2LA0",
  "pdfSize": "20985984"
}