{
  "id": "2412.11044",
  "title": "Understanding and Mitigating Memorization in Diffusion Models for\n  Tabular Data",
  "authors": "Zhengyu Fang, Zhimeng Jiang, Huiyuan Chen, Xiao Li, Jing Li",
  "authorsParsed": [
    [
      "Fang",
      "Zhengyu",
      ""
    ],
    [
      "Jiang",
      "Zhimeng",
      ""
    ],
    [
      "Chen",
      "Huiyuan",
      ""
    ],
    [
      "Li",
      "Xiao",
      ""
    ],
    [
      "Li",
      "Jing",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 15 Dec 2024 04:04:37 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734235477000,
  "abstract": "  Tabular data generation has attracted significant research interest in recent\nyears, with the tabular diffusion models greatly improving the quality of\nsynthetic data. However, while memorization, where models inadvertently\nreplicate exact or near-identical training data, has been thoroughly\ninvestigated in image and text generation, its effects on tabular data remain\nlargely unexplored. In this paper, we conduct the first comprehensive\ninvestigation of memorization phenomena in diffusion models for tabular data.\nOur empirical analysis reveals that memorization appears in tabular diffusion\nmodels and increases with larger training epochs. We further examine the\ninfluence of factors such as dataset sizes, feature dimensions, and different\ndiffusion models on memorization. Additionally, we provide a theoretical\nexplanation for why memorization occurs in tabular diffusion models. To address\nthis issue, we propose TabCutMix, a simple yet effective data augmentation\ntechnique that exchanges randomly selected feature segments between random\nsame-class training sample pairs. Building upon this, we introduce\nTabCutMixPlus, an enhanced method that clusters features based on feature\ncorrelations and ensures that features within the same cluster are exchanged\ntogether during augmentation. This clustering mechanism mitigates\nout-of-distribution (OOD) generation issues by maintaining feature coherence.\nExperimental results across various datasets and diffusion models demonstrate\nthat TabCutMix effectively mitigates memorization while maintaining\nhigh-quality data generation.\n",
  "subjects": [
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "FCDQmsmQXIPruR6PuQWYTQ-uF1WM_HPh5mzyTwbnHjU",
  "pdfSize": "1348642"
}