{"id":"2412.15540","title":"MRAG: A Modular Retrieval Framework for Time-Sensitive Question\n  Answering","authors":"Zhang Siyue, Xue Yuxiang, Zhang Yiming, Wu Xiaobao, Luu Anh Tuan, Zhao\n  Chen","authorsParsed":[["Siyue","Zhang",""],["Yuxiang","Xue",""],["Yiming","Zhang",""],["Xiaobao","Wu",""],["Tuan","Luu Anh",""],["Chen","Zhao",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 03:58:27 GMT"}],"updateDate":"2024-12-23","timestamp":1734667107000,"abstract":"  Understanding temporal relations and answering time-sensitive questions is\ncrucial yet a challenging task for question-answering systems powered by large\nlanguage models (LLMs). Existing approaches either update the parametric\nknowledge of LLMs with new facts, which is resource-intensive and often\nimpractical, or integrate LLMs with external knowledge retrieval (i.e.,\nretrieval-augmented generation). However, off-the-shelf retrievers often\nstruggle to identify relevant documents that require intensive temporal\nreasoning. To systematically study time-sensitive question answering, we\nintroduce the TempRAGEval benchmark, which repurposes existing datasets by\nincorporating temporal perturbations and gold evidence labels. As anticipated,\nall existing retrieval methods struggle with these temporal reasoning-intensive\nquestions. We further propose Modular Retrieval (MRAG), a trainless framework\nthat includes three modules: (1) Question Processing that decomposes question\ninto a main content and a temporal constraint; (2) Retrieval and Summarization\nthat retrieves evidence and uses LLMs to summarize according to the main\ncontent; (3) Semantic-Temporal Hybrid Ranking that scores each evidence\nsummarization based on both semantic and temporal relevance. On TempRAGEval,\nMRAG significantly outperforms baseline retrievers in retrieval performance,\nleading to further improvements in final answer accuracy.\n","subjects":["Computer Science/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"LOrfJAXNsl1ytmAZFTXEQopLEiSIa2_x7LA6ZqzHetc","pdfSize":"1348409"}