{"id":"2412.05150","title":"BIAS: A Body-based Interpretable Active Speaker Approach","authors":"Tiago Roxo and Joana C. Costa and Pedro R. M. In\\'acio and Hugo\n  Proen\\c{c}a","authorsParsed":[["Roxo","Tiago",""],["Costa","Joana C.",""],["Inácio","Pedro R. M.",""],["Proença","Hugo",""]],"versions":[{"version":"v1","created":"Fri, 6 Dec 2024 16:08:09 GMT"}],"updateDate":"2024-12-09","timestamp":1733501289000,"abstract":"  State-of-the-art Active Speaker Detection (ASD) approaches heavily rely on\naudio and facial features to perform, which is not a sustainable approach in\nwild scenarios. Although these methods achieve good results in the standard\nAVA-ActiveSpeaker set, a recent wilder ASD dataset (WASD) showed the\nlimitations of such models and raised the need for new approaches. As such, we\npropose BIAS, a model that, for the first time, combines audio, face, and body\ninformation, to accurately predict active speakers in varying/challenging\nconditions. Additionally, we design BIAS to provide interpretability by\nproposing a novel use for Squeeze-and-Excitation blocks, namely in attention\nheatmaps creation and feature importance assessment. For a full\ninterpretability setup, we annotate an ASD-related actions dataset (ASD-Text)\nto finetune a ViT-GPT2 for text scene description to complement BIAS\ninterpretability. The results show that BIAS is state-of-the-art in challenging\nconditions where body-based features are of utmost importance (Columbia,\nopen-settings, and WASD), and yields competitive results in AVA-ActiveSpeaker,\nwhere face is more influential than body for ASD. BIAS interpretability also\nshows the features/aspects more relevant towards ASD prediction in varying\nsettings, making it a strong baseline for further developments in interpretable\nASD models, and is available at https://github.com/Tiago-Roxo/BIAS.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"BW-lhGARa_MwUox4wSMxkEnAF6-tMuKQ3l4B-XLJLoY","pdfSize":"9509351"}