{"id":"2412.10073","title":"Africanus III. pfb-imaging -- a flexible radio interferometric imaging\n  suite","authors":"Hertzog L. Bester, Jonathan S. Kenyon, Audrey Repetti, Simon J.\n  Perkins, Oleg M. Smirnov, Tariq Blecher, Yassine Mhiri, Jakob Roth, Ian\n  Heywood, Yves Wiaux, Benjamin V. Hugo","authorsParsed":[["Bester","Hertzog L.",""],["Kenyon","Jonathan S.",""],["Repetti","Audrey",""],["Perkins","Simon J.",""],["Smirnov","Oleg M.",""],["Blecher","Tariq",""],["Mhiri","Yassine",""],["Roth","Jakob",""],["Heywood","Ian",""],["Wiaux","Yves",""],["Hugo","Benjamin V.",""]],"versions":[{"version":"v1","created":"Fri, 13 Dec 2024 12:01:30 GMT"},{"version":"v2","created":"Tue, 17 Dec 2024 11:45:43 GMT"}],"updateDate":"2024-12-18","timestamp":1734091290000,"abstract":"  The popularity of the CLEAN algorithm in radio interferometric imaging stems\nfrom its maturity, speed, and robustness. While many alternatives have been\nproposed in the literature, none have achieved mainstream adoption by\nastronomers working with data from interferometric arrays operating in the big\ndata regime. This lack of adoption is largely due to increased computational\ncomplexity, absence of mature implementations, and the need for astronomers to\ntune obscure algorithmic parameters.\n  This work introduces pfb-imaging: a flexible library that implements the\nscaffolding required to develop and accelerate general radio interferometric\nimaging algorithms. We demonstrate how the framework can be used to implement a\nsparsity-based image reconstruction technique known as (unconstrained) SARA in\na way that scales with image size rather than data volume and features\ninterpretable algorithmic parameters. The implementation is validated on\nterabyte-sized data from the MeerKAT telescope, using both a single compute\nnode and Amazon Web Services computing instances.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"YJLwHOYTyweffxyvs7GAsLtBcJIbE0HRqiXM-FEJtos","pdfSize":"21593269"}