{"id":"2412.12264","title":"CARMENES input catalogue of M dwarfs IX. Multiplicity from close\n  spectroscopic binaries to ultra-wide systems","authors":"C. Cifuentes, J. A. Caballero, J. Gonz\\'alez-Payo, P. J. Amado, V. J.\n  S. B\\'ejar, A. J. Burgasser, M. Cort\\'es-Contreras, N. Lodieu, D. Montes, A.\n  Quirrenbach, A. Reiners, I. Ribas, J. Sanz-Forcada, W. Seifert, and M. R.\n  Zapatero Osorio","authorsParsed":[["Cifuentes","C.",""],["Caballero","J. A.",""],["González-Payo","J.",""],["Amado","P. J.",""],["Béjar","V. J. S.",""],["Burgasser","A. J.",""],["Cortés-Contreras","M.",""],["Lodieu","N.",""],["Montes","D.",""],["Quirrenbach","A.",""],["Reiners","A.",""],["Ribas","I.",""],["Sanz-Forcada","J.",""],["Seifert","W.",""],["Osorio","M. R. Zapatero",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 19:00:03 GMT"}],"updateDate":"2024-12-18","timestamp":1734375603000,"abstract":"  Multiplicity studies greatly benefit from focusing on M dwarfs because they\nare often paired in a variety of configurations with both stellar and\nsubstellar objects, including exoplanets. We aim to address the observed\nmultiplicity of M dwarfs by conducting a systematic analysis using the latest\navailable astrophotometric data. For every star in a sample of 2214 M dwarfs\nfrom the CARMENES catalogue, we investigated the existence of resolved and\nunresolved physical companions in the literature and in all-sky surveys,\nespecially in Gaia DR3 data products. We covered a very wide range of\nseparations, from known spectroscopic binaries in tight arrangements $\\sim$0.01\nau to remarkably separated ultra-wide pairs ($\\sim$10$^5$ au). We identified\n835 M dwarfs in 720 multiple systems, predominantly binaries. Thus, we propose\n327 new binary candidates based on Gaia data. If these candidates are finally\nconfirmed, we expect the multiplicity fraction of M dwarfs to be\n40.3$^{+2.1}_{-2.0}$ %. When only considering the systems already identified,\nthe multiplicity fraction is reduced to 27.8$^{+1.9}_{-1.8}$ %. This result is\nin line with most of the values published in the literature. We also identified\nM-dwarf multiple systems with FGK, white dwarf, ultra-cool dwarf, and exoplanet\ncompanions, as well as those in young stellar kinematic groups. We studied\ntheir physical separations, orbital periods, binding energies, and mass ratios.\nWe argue that based on reliable astrometric data and spectroscopic\ninvestigations from the literature (even when considering detection biases),\nthe multiplicity fraction of M dwarfs could still be significantly\nunderestimated. This calls for further high-resolution follow-up studies to\nvalidate these findings.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"7pdsCdym1-RC-GAUI4OWCL5ctC0sCeZ_0sZAJoDYNwg","pdfSize":"3202793"}