{"id":"2412.13500","title":"Precise and efficient modeling of stellar-activity-affected solar\n  spectra using SOAP-GPU","authors":"Yinan Zhao, Xavier Dumusque, Michael Cretignier, Khaled Al Moulla,\n  Momo Ellwarth, Ansgar Reiners, Alessandro Sozzetti","authorsParsed":[["Zhao","Yinan",""],["Dumusque","Xavier",""],["Cretignier","Michael",""],["Moulla","Khaled Al",""],["Ellwarth","Momo",""],["Reiners","Ansgar",""],["Sozzetti","Alessandro",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 04:45:24 GMT"}],"updateDate":"2025-01-29","timestamp":1734497124000,"abstract":"  One of the main obstacles in exoplanet detection when using the radial\nvelocity (RV) technique is the presence of stellar activity signal induced by\nmagnetic regions. In this context, a realistic simulated dataset that can\nprovide photometry and spectroscopic outputs is needed for method development.\nThe goal of this paper is to describe two realistic simulations of solar\nactivity obtained from SOAP-GPU and to compare them with real data obtained\nfrom the HARPS-N solar telescope. We describe two different methods of modeling\nsolar activity using SOAP-GPU. The first models the evolution of active regions\nbased on the spot number as a function of time. The second method relies on the\nextraction of active regions from the Solar Dynamics Observatory (SDO) data.\nThe simulated spectral time series generated with the first method shows a\nlong-term RV behavior similar to that seen in the HARPS-N solar observations.\nThe effect of stellar activity induced by stellar rotation is also well modeled\nwith prominent periodicities at the stellar rotation period and its first\nharmonic. The comparison between the simulated spectral time series generated\nusing SDO images and the HARPS-N solar spectra shows that SOAP-GPU can\nprecisely model the RV time series of the Sun to a precision better than 0.9\nm/s. By studying the width and depth variations of each spectral line in the\nHARPS-N solar and SOAP-GPU data, we find a strong correlation between the\nobservation and the simulation for strong spectral lines, therefore supporting\nthe modeling of the stellar activity effect at the spectral level. These\nsimulated solar spectral time series serve as a useful test bed for evaluating\nspectral-level stellar activity mitigation techniques.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_sTPD7cPZHuWuCB4nmcTSi6Q4heeDsliuCqCajeq60A","pdfSize":"2520004"}