{"id":"2412.07910","title":"Predicting Chaotic Systems with Quantum Echo-state Networks","authors":"Erik Connerty, Ethan Evans, Gerasimos Angelatos, Vignesh Narayanan","authorsParsed":[["Connerty","Erik",""],["Evans","Ethan",""],["Angelatos","Gerasimos",""],["Narayanan","Vignesh",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 20:39:16 GMT"}],"updateDate":"2024-12-12","timestamp":1733863156000,"abstract":"  Recent advancements in artificial neural networks have enabled impressive\ntasks on classical computers, but they demand significant computational\nresources. While quantum computing offers potential beyond classical systems,\nthe advantages of quantum neural networks (QNNs) remain largely unexplored. In\nthis work, we present and examine a quantum circuit (QC) that implements and\naims to improve upon the classical echo-state network (ESN), a type of\nreservoir-based recurrent neural networks (RNNs), using quantum computers.\nTypically, ESNs consist of an extremely large reservoir that learns\nhigh-dimensional embeddings, enabling prediction of complex system\ntrajectories. Quantum echo-state networks (QESNs) aim to reduce this need for\nprohibitively large reservoirs by leveraging the unique capabilities of quantum\ncomputers, potentially allowing for more efficient and higher performing\ntime-series prediction algorithms. The proposed QESN can be implemented on any\ndigital quantum computer implementing a universal gate set, and does not\nrequire any sort of stopping or re-initialization of the circuit, allowing\ncontinuous evolution of the quantum state over long time horizons. We conducted\nsimulated QC experiments on the chaotic Lorenz system, both with noisy and\nnoiseless models, to demonstrate the circuit's performance and its potential\nfor execution on noisy intermediate-scale quantum (NISQ) computers.\n","subjects":["Physics/Quantum Physics","Computer Science/Emerging Technologies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"F9lfTpSLbyOJqMy52n6kgbvZjPjzPAco6Ybh2I6_sUs","pdfSize":"11581391"}