{
  "id": "2412.18115",
  "title": "Statistical physics of large-scale neural activity with loops",
  "authors": "David P. Carcamo and Christopher W. Lynn",
  "authorsParsed": [
    [
      "Carcamo",
      "David P.",
      ""
    ],
    [
      "Lynn",
      "Christopher W.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 24 Dec 2024 02:53:51 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1735008831000,
  "abstract": "  As experiments advance to record from tens of thousands of neurons,\nstatistical physics provides a framework for understanding how collective\nactivity emerges from networks of fine-scale correlations. While modeling these\npopulations is tractable in loop-free networks, neural circuitry inherently\ncontains feedback loops of connectivity. Here, for a class of networks with\nloops, we present an exact solution to the maximum entropy problem that scales\nto very large systems. This solution provides direct access to\ninformation-theoretic measures like the entropy of the model and the\ninformation contained in correlations, which are usually inaccessible at large\nscales. In turn, this allows us to search for the optimal network of\ncorrelations that contains the maximum information about population activity.\nApplying these methods to 45 recordings of approximately 10,000 neurons in the\nmouse visual system, we demonstrate that our framework captures more\ninformation -- providing a better description of the population -- than\nexisting methods without loops. For a given population, our models perform even\nbetter during visual stimulation than spontaneous activity; however, the\ninferred interactions overlap significantly, suggesting an underlying neural\ncircuitry that remains consistent across stimuli. Generally, we construct an\noptimized framework for studying the statistical physics of large neural\npopulations, with future applications extending to other biological networks.\n",
  "subjects": [
    "Physics/Biological Physics",
    "Quantitative Biology/Neurons and Cognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "rk0ybImfaING4FYqcq8Vf_5iC7e8pxT34AMYGJq_JMo",
  "pdfSize": "7119922"
}