{
  "id": "2412.03732",
  "title": "Unveiling the Role of Lewis Base Strength in Small-Molecule Passivation\n  of Defect Perovskites",
  "authors": "Yi-Chen Wu and Hsien-Hsin Chou",
  "authorsParsed": [
    [
      "Wu",
      "Yi-Chen",
      ""
    ],
    [
      "Chou",
      "Hsien-Hsin",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 21:54:24 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733349264000,
  "abstract": "  Perovskite materials are highly promising for a range of optoelectronic\napplications including energy conversion technologies, owing to their high\ncharge-carrier mobilities, adaptability of bandgap tuning, and exceptional\nlight-harvesting capabilities. Yet, defects that arise during manufacturing\noften lead to performance limitations such as hindered efficiency and\nstability. This is primarily due to significant deviations in crystal geometry\nand band structure elements such as the Fermi level, work function, and density\nof states, compared to pristine perovskite. To mitigate these issues, this\nstudy explored the passivation of surface iodide-vacancy defect in perovskite\nusing small-molecule Lewis bases, an approach aims to counteract these\ndetrimental effects. Among the examined N-, P- and O-coordinated benzyl\nderivatives, those featuring a phosphonic acid group as a passivator for the\nundercoordinated Pb(II) sites demonstrated outstanding electronic structure\nproperties. This was notably achieved by lowering the Fermi level, increasing\nthe work function, and suppressing surface trap states. The effective\nrestoration of electronic properties achieved by targeted small molecule\npassivation provides crucial insights into enhanced functionality and\nefficiency for defect perovskite materials.\n",
  "subjects": [
    "Physics/Chemical Physics",
    "Condensed Matter/Materials Science"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "-lGvgBRmP7DcZ_dobJjSly6bI3obeXuBdv2Mi6Il-Z0",
  "pdfSize": "2640125"
}