{"id":"2412.04742","title":"DRDST: Low-latency DAG Consensus through Robust Dynamic Sharding and\n  Tree-broadcasting for IoV","authors":"Runhua Chen, Haoxiang Luo, Gang Sun, Hongfang Yu, Dusit Niyato,\n  Schahram Dustdar","authorsParsed":[["Chen","Runhua",""],["Luo","Haoxiang",""],["Sun","Gang",""],["Yu","Hongfang",""],["Niyato","Dusit",""],["Dustdar","Schahram",""]],"versions":[{"version":"v1","created":"Fri, 6 Dec 2024 03:03:58 GMT"}],"updateDate":"2024-12-09","timestamp":1733454238000,"abstract":"  The Internet of Vehicles (IoV) is emerging as a pivotal technology for\nenhancing traffic management and safety. Its rapid development demands\nsolutions for enhanced communication efficiency and reduced latency. However,\ntraditional centralized networks struggle to meet these demands, prompting the\nexploration of decentralized solutions such as blockchain. Addressing\nblockchain's scalability challenges posed by the growing number of nodes and\ntransactions calls for innovative solutions, among which sharding stands out as\na pivotal approach to significantly enhance blockchain throughput. However,\nexisting schemes still face challenges related to a) the impact of vehicle\nmobility on blockchain consensus, especially for cross-shard transaction; and\nb) the strict requirements of low latency consensus in a highly dynamic\nnetwork. In this paper, we propose a DAG (Directed Acyclic Graph) consensus\nleveraging Robust Dynamic Sharding and Tree-broadcasting (DRDST) to address\nthese challenges. Specifically, we first develop a standard for evaluating the\nnetwork stability of nodes, combined with the nodes' trust values, to propose a\nnovel robust sharding model that is solved through the design of the Genetic\nSharding Algorithm (GSA). Then, we optimize the broadcast latency of the whole\nsharded network by improving the tree-broadcasting to minimize the maximum\nbroadcast latency within each shard. On this basis, we also design a DAG\nconsensus scheme based on an improved hashgraph protocol, which can efficiently\nhandle cross-shard transactions. Finally, the simulation proves the proposed\nscheme is superior to the comparison schemes in latency, throughput, consensus\nsuccess rate, and node traffic load.\n","subjects":["Computer Science/Networking and Internet Architecture","Computer Science/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"HDJ557fGLZbkmGXomjDLX-Xh2V44bQ7nEcx3whYrdQI","pdfSize":"1938789"}