{"id":"2412.21157","title":"Accidental Peccei-Quinn Symmetry From Gauged U(1) and a High Quality\n  Axion","authors":"K.S. Babu, Bhaskar Dutta, Rabindra N. Mohapatra","authorsParsed":[["Babu","K. S.",""],["Dutta","Bhaskar",""],["Mohapatra","Rabindra N.",""]],"versions":[{"version":"v1","created":"Mon, 30 Dec 2024 18:35:16 GMT"},{"version":"v2","created":"Tue, 18 Feb 2025 19:00:01 GMT"}],"updateDate":"2025-02-20","timestamp":1735583716000,"abstract":"  We construct explicit models that solve the axion quality problem originating\nfrom quantum gravitational effects. The general strategy we employ is to\nsupplement the Standard Model and its grand unified extensions by an\nanomaly-free axial $U(1)_a$ symmetry that is gauged. We show that for several\nchoices of the gauge quantum numbers of the fermions, this setup leads to an\naccidental $U(1)$ symmetry with a QCD anomaly which can be identified as the\nPeccei-Quinn (PQ) symmetry that solves the strong CP problem. The $U(1)_a$\ngauge symmetry controls the amount of explicit PQ symmetry violation induced by\nquantum gravity, resulting in a high quality axion. We present two classes of\nmodels employing this strategy. In the first class (models I and II), the axial\n$U(1)_a$ gauge symmetry acts on vector-like quarks leading to an accidental\nKSVZ-type axion. The second class (model III) is based on $SO(10)$ grand\nunified theory extended by a gauged $U(1)_a$ symmetry that leads to a hybrid\nKSVZ--DFSZ type axion. The couplings of the axion to the electron and the\nnucleon are found to be distinct in this class of hybrid models from those in\nthe KSVZ and DFSZ models, when the axion is identified as the dark matter of\nthe universe, which can be used to test these models. Interestingly, all models\npresented here have domain wall number of one, which is free of cosmological\nproblems that typically arise in axion models.\n","subjects":["Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"yceDWMYNwZepITJnte69MOncOCKRHHcq4zzeB1ROcew","pdfSize":"1284331"}