{
  "id": "2412.15448",
  "title": "Assessing the Impact of Technical Indicators on Machine Learning Models\n  for Stock Price Prediction",
  "authors": "Akash Deep, Chris Monico, Abootaleb Shirvani, Svetlozar Rachev, Frank\n  J. Fabozzi",
  "authorsParsed": [
    [
      "Deep",
      "Akash",
      ""
    ],
    [
      "Monico",
      "Chris",
      ""
    ],
    [
      "Shirvani",
      "Abootaleb",
      ""
    ],
    [
      "Rachev",
      "Svetlozar",
      ""
    ],
    [
      "Fabozzi",
      "Frank J.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 23:02:02 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734649322000,
  "abstract": "  This study evaluates the performance of random forest regression models\nenhanced with technical indicators for high-frequency stock price prediction.\nUsing minute-level SPY data, we assessed 13 models that incorporate technical\nindicators such as Bollinger bands, exponential moving average, and Fibonacci\nretracement. While these models improved risk-adjusted performance metrics,\nthey struggled with out-of-sample generalization, highlighting significant\noverfitting challenges. Feature importance analysis revealed that primary\nprice-based features consistently outperformed technical indicators, suggesting\ntheir limited utility in high-frequency trading contexts. These findings\nchallenge the weak form of the efficient market hypothesis, identifying\nshort-lived inefficiencies during volatile periods but its limited persistence\nacross market regimes. The study emphasizes the need for selective feature\nengineering, adaptive modeling, and a stronger focus on risk-adjusted\nperformance metrics to navigate the complexities of high-frequency trading\nenvironments.\n",
  "subjects": [
    "Quantitative Finance/Computational Finance",
    "Quantitative Finance/Risk Management"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "zntYJAxFoXqNu8KenepW3QPaHGi1okY-bd9-ygBD02M",
  "pdfSize": "7042150"
}