{"id":"2412.14187","title":"Detecting Dark Patterns in User Interfaces Using Logistic Regression and\n  Bag-of-Words Representation","authors":"Aliyu Umar, Maaruf Lawan, Adamu Lawan, Abdullahi Abdulkadir, Mukhtar\n  Dahiru","authorsParsed":[["Umar","Aliyu",""],["Lawan","Maaruf",""],["Lawan","Adamu",""],["Abdulkadir","Abdullahi",""],["Dahiru","Mukhtar",""]],"versions":[{"version":"v1","created":"Mon, 9 Dec 2024 16:29:46 GMT"}],"updateDate":"2024-12-20","timestamp":1733761786000,"abstract":"  Dark patterns in user interfaces represent deceptive design practices\nintended to manipulate users' behavior, often leading to unintended\nconsequences such as coerced purchases, involuntary data disclosures, or user\nfrustration. Detecting and mitigating these dark patterns is crucial for\npromoting transparency, trust, and ethical design practices in digital\nenvironments. This paper proposes a novel approach for detecting dark patterns\nin user interfaces using logistic regression and bag-of-words representation.\nOur methodology involves collecting a diverse dataset of user interface text\nsamples, preprocessing the data, extracting text features using the\nbag-of-words representation, training a logistic regression model, and\nevaluating its performance using various metrics such as accuracy, precision,\nrecall, F1-score, and the area under the ROC curve (AUC). Experimental results\ndemonstrate the effectiveness of the proposed approach in accurately\nidentifying instances of dark patterns, with high predictive performance and\nrobustness to variations in dataset composition and model parameters. The\ninsights gained from this study contribute to the growing body of knowledge on\ndark patterns detection and classification, offering practical implications for\ndesigners, developers, and policymakers in promoting ethical design practices\nand protecting user rights in digital environments.\n","subjects":["Computer Science/Human-Computer Interaction","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"DTO1sRVr2rlBWFNaozJo5kMwpDmigHKCpNZG0w5VSPU","pdfSize":"272351"}