{
  "id": "2412.04362",
  "title": "The spin-phonon relaxation mechanism of single-molecule magnets in the\n  presence of strong exchange coupling",
  "authors": "Sourav Mondal, Julia Netz, David Hunger, Simon Suhr, Biprajit Sarkar,\n  Joris van Slageren, Andreas K\\\"ohn and Alessandro Lunghi",
  "authorsParsed": [
    [
      "Mondal",
      "Sourav",
      ""
    ],
    [
      "Netz",
      "Julia",
      ""
    ],
    [
      "Hunger",
      "David",
      ""
    ],
    [
      "Suhr",
      "Simon",
      ""
    ],
    [
      "Sarkar",
      "Biprajit",
      ""
    ],
    [
      "van Slageren",
      "Joris",
      ""
    ],
    [
      "Köhn",
      "Andreas",
      ""
    ],
    [
      "Lunghi",
      "Alessandro",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 17:20:49 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733419249000,
  "abstract": "  Magnetic relaxation in coordination compounds is largely dominated by the\ninteraction of the spin with phonons. Large zero-field splitting and exchange\ncoupling values have been empirically found to strongly suppress spin\nrelaxation and have been used as the main guideline for designing new molecular\ncompounds. Although a comprehensive understanding of spin-phonon relaxation has\nbeen achieved for mononuclear complexes, only a qualitative picture is\navailable for polynuclear compounds. Here we fill this critical knowledge gap\nby providing a full first-principle description of spin-phonon relaxation in an\nair-stable Co(II) dimer with both large single-ion anisotropy and exchange\ncoupling. Simulations reproduce the experimental relaxation data with excellent\naccuracy and provide a microscopic understanding of Orbach and Raman relaxation\npathways and their dependency on exchange coupling, zero-field splitting, and\nmolecular vibrations. Theory and numerical simulations show that increasing\ncluster nuclearity to just four cobalt units would lead to a complete\nsuppression of Raman relaxation. These results hold a general validity for\nsingle-molecule magnets, providing a deeper understanding of their relaxation\nand revised strategies for their improvement.\n",
  "subjects": [
    "Condensed Matter/Materials Science"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "oj-3YSQ1d1BsnzTSfod-B0NB1ZsJN1E-M8u2z8YfAVo",
  "pdfSize": "1332591"
}