{"id":"2412.04833","title":"Wavelet Diffusion Neural Operator","authors":"Peiyan Hu, Rui Wang, Xiang Zheng, Tao Zhang, Haodong Feng, Ruiqi Feng,\n  Long Wei, Yue Wang, Zhi-Ming Ma, Tailin Wu","authorsParsed":[["Hu","Peiyan",""],["Wang","Rui",""],["Zheng","Xiang",""],["Zhang","Tao",""],["Feng","Haodong",""],["Feng","Ruiqi",""],["Wei","Long",""],["Wang","Yue",""],["Ma","Zhi-Ming",""],["Wu","Tailin",""]],"versions":[{"version":"v1","created":"Fri, 6 Dec 2024 07:56:25 GMT"}],"updateDate":"2024-12-09","timestamp":1733471785000,"abstract":"  Simulating and controlling physical systems described by partial differential\nequations (PDEs) are crucial tasks across science and engineering. Recently,\ndiffusion generative models have emerged as a competitive class of methods for\nthese tasks due to their ability to capture long-term dependencies and model\nhigh-dimensional states. However, diffusion models typically struggle with\nhandling system states with abrupt changes and generalizing to higher\nresolutions. In this work, we propose Wavelet Diffusion Neural Operator (WDNO),\na novel PDE simulation and control framework that enhances the handling of\nthese complexities. WDNO comprises two key innovations. Firstly, WDNO performs\ndiffusion-based generative modeling in the wavelet domain for the entire\ntrajectory to handle abrupt changes and long-term dependencies effectively.\nSecondly, to address the issue of poor generalization across different\nresolutions, which is one of the fundamental tasks in modeling physical\nsystems, we introduce multi-resolution training. We validate WDNO on five\nphysical systems, including 1D advection equation, three challenging physical\nsystems with abrupt changes (1D Burgers' equation, 1D compressible\nNavier-Stokes equation and 2D incompressible fluid), and a real-world dataset\nERA5, which demonstrates superior performance on both simulation and control\ntasks over state-of-the-art methods, with significant improvements in long-term\nand detail prediction accuracy. Remarkably, in the challenging context of the\n2D high-dimensional and indirect control task aimed at reducing smoke leakage,\nWDNO reduces the leakage by 33.2% compared to the second-best baseline.\n","subjects":["Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"YDjwLpAuyYZ4gzQTlvo81uVTQAgW8s9Pry5Hby-_9Lk","pdfSize":"7589834"}