{"id":"2412.15374","title":"Automated Root Cause Analysis System for Complex Data Products","authors":"Mathieu Demarne, Miso Cilimdzic, Tom Falkowski, Timothy Johnson, Jim\n  Gramling, Wei Kuang, Hoobie Hou, Amjad Aryan, Gayatri Subramaniam, Kenny Lee,\n  Manuel Mejia, Lisa Liu, Divya Vermareddy","authorsParsed":[["Demarne","Mathieu",""],["Cilimdzic","Miso",""],["Falkowski","Tom",""],["Johnson","Timothy",""],["Gramling","Jim",""],["Kuang","Wei",""],["Hou","Hoobie",""],["Aryan","Amjad",""],["Subramaniam","Gayatri",""],["Lee","Kenny",""],["Mejia","Manuel",""],["Liu","Lisa",""],["Vermareddy","Divya",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 20:10:54 GMT"}],"updateDate":"2024-12-23","timestamp":1734639054000,"abstract":"  We present ARCAS (Automated Root Cause Analysis System), a diagnostic\nplatform based on a Domain Specific Language (DSL) built for fast diagnostic\nimplementation and low learning curve. Arcas is composed of a constellation of\nautomated troubleshooting guides (Auto-TSGs) that can execute in parallel to\ndetect issues using product telemetry and apply mitigation in near-real-time.\nThe DSL is tailored specifically to ensure that subject matter experts can\ndeliver highly curated and relevant Auto-TSGs in a short time without having to\nunderstand how they will interact with the rest of the diagnostic platform,\nthus reducing time-to-mitigate and saving crucial engineering cycles when they\nmatter most. This contrasts with platforms like Datadog and New Relic, which\nprimarily focus on monitoring and require manual intervention for mitigation.\nARCAS uses a Large Language Model (LLM) to prioritize Auto-TSGs outputs and\ntake appropriate actions, thus suppressing the costly requirement of\nunderstanding the general behavior of the system. We explain the key concepts\nbehind ARCAS and demonstrate how it has been successfully used for multiple\nproducts across Azure Synapse Analytics and Microsoft Fabric Synapse Data\nWarehouse.\n","subjects":["Computer Science/Software Engineering","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"COg5NFU7ngiokCqfPCJKwC05WEuOHcWO_K8x5GHzNdk","pdfSize":"849727"}