{
  "id": "2412.16471",
  "title": "Cryogenic field-cycling instrument for optical NMR hyperpolarization\n  studies",
  "authors": "Noella D'Souza, Kieren A. Harkins, Cooper Selco, Ushoshi Basumallick,\n  Samantha Breuer, Zhuorui Zhang, Paul Reshetikhin, Marcus Ho, Aniruddha Nayak,\n  Maxwell McAllister, Emanuel Druga, David Marchiori, Ashok Ajoy",
  "authorsParsed": [
    [
      "D'Souza",
      "Noella",
      ""
    ],
    [
      "Harkins",
      "Kieren A.",
      ""
    ],
    [
      "Selco",
      "Cooper",
      ""
    ],
    [
      "Basumallick",
      "Ushoshi",
      ""
    ],
    [
      "Breuer",
      "Samantha",
      ""
    ],
    [
      "Zhang",
      "Zhuorui",
      ""
    ],
    [
      "Reshetikhin",
      "Paul",
      ""
    ],
    [
      "Ho",
      "Marcus",
      ""
    ],
    [
      "Nayak",
      "Aniruddha",
      ""
    ],
    [
      "McAllister",
      "Maxwell",
      ""
    ],
    [
      "Druga",
      "Emanuel",
      ""
    ],
    [
      "Marchiori",
      "David",
      ""
    ],
    [
      "Ajoy",
      "Ashok",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 21 Dec 2024 03:54:05 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734753245000,
  "abstract": "  Optical dynamic nuclear polarization (DNP) offers an attractive approach to\nenhancing the sensitivity of nuclear magnetic resonance (NMR) spectroscopy.\nEfficient, optically-generated electron polarization can be leveraged to\noperate across a broad range of temperatures and magnetic fields, making it\nparticularly appealing for applications requiring high DNP efficiency or\nspatial resolution. While a large class of systems hold promise for optical\nDNP, many candidates display both variable electron polarizability and electron\nand nuclear T1 relaxation times as functions of magnetic field and temperature.\nThis necessitates tools capable of studying DNP under diverse experimental\nconditions. To address this, we introduce a cryogenic field cycling instrument\nthat facilitates optical DNP studies across a wide range of magnetic fields\n(10mT to 9.4T) and temperatures (10K to 300K). Continuous cryogen replenishment\nenables sustained, long-term operation. Additionally, the system supports the\nability to manipulate and probe hyperpolarized nuclear spins via pulse\nsequences involving millions of RF pulses. We describe innovations in the\ndevice design and demonstrate its operation on a model system of 13C nuclear\nspins in diamond polarized through optically pumped nitrogen vacancy (NV)\ncenters. We anticipate the use of the instrument for a broad range of optical\nDNP systems and studies.\n",
  "subjects": [
    "Physics/Quantum Physics",
    "Physics/Chemical Physics",
    "Physics/Instrumentation and Detectors"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "JDBiplvcY5kOCqDYG32UOSWE--r4RMBVcBmrYqQYhUg",
  "pdfSize": "8149674"
}