{"id":"2412.08350","title":"Benchmarking learned algorithms for computed tomography image\n  reconstruction tasks","authors":"Maximilian B. Kiss, Ander Biguri, Zakhar Shumaylov, Ferdia Sherry, K.\n  Joost Batenburg, Carola-Bibiane Sch\\\"onlieb, Felix Lucka","authorsParsed":[["Kiss","Maximilian B.",""],["Biguri","Ander",""],["Shumaylov","Zakhar",""],["Sherry","Ferdia",""],["Batenburg","K. Joost",""],["Schönlieb","Carola-Bibiane",""],["Lucka","Felix",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 12:45:17 GMT"}],"updateDate":"2024-12-12","timestamp":1733921117000,"abstract":"  Computed tomography (CT) is a widely used non-invasive diagnostic method in\nvarious fields, and recent advances in deep learning have led to significant\nprogress in CT image reconstruction. However, the lack of large-scale,\nopen-access datasets has hindered the comparison of different types of learned\nmethods. To address this gap, we use the 2DeteCT dataset, a real-world\nexperimental computed tomography dataset, for benchmarking machine learning\nbased CT image reconstruction algorithms. We categorize these methods into\npost-processing networks, learned/unrolled iterative methods, learned\nregularizer methods, and plug-and-play methods, and provide a pipeline for easy\nimplementation and evaluation. Using key performance metrics, including SSIM\nand PSNR, our benchmarking results showcase the effectiveness of various\nalgorithms on tasks such as full data reconstruction, limited-angle\nreconstruction, sparse-angle reconstruction, low-dose reconstruction, and\nbeam-hardening corrected reconstruction. With this benchmarking study, we\nprovide an evaluation of a range of algorithms representative for different\ncategories of learned reconstruction methods on a recently published dataset of\nreal-world experimental CT measurements. The reproducible setup of methods and\nCT image reconstruction tasks in an open-source toolbox enables straightforward\naddition and comparison of new methods later on. The toolbox also provides the\noption to load the 2DeteCT dataset differently for extensions to other problems\nand different CT reconstruction tasks.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computer Science/Computer Vision and Pattern Recognition","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"qMbHj4zeBtCcQpJ9CBypTOV1c4kLZpyFVnHdIPMKCoE","pdfSize":"22764376"}