{"id":"2412.05941","title":"Shedding light on the intrinsic transversal momentum distributions of\n  pion and kaon","authors":"Jian Chai and Shan Cheng","authorsParsed":[["Chai","Jian",""],["Cheng","Shan",""]],"versions":[{"version":"v1","created":"Sun, 8 Dec 2024 13:47:12 GMT"},{"version":"v2","created":"Wed, 11 Dec 2024 14:56:19 GMT"},{"version":"v3","created":"Mon, 17 Feb 2025 04:30:09 GMT"}],"updateDate":"2025-02-18","timestamp":1733665632000,"abstract":"  We propose to introduce the intrinsic transversal momentum distribution\nfunctions (iTMDs), in conjunction with the light-cone distribution amplitudes\n(LCDAs), to elucidate the probability amplitude of encountering a meson state\nwherein the partons swiftly traverse along the longitudinal axis while gently\noscillating in the transversal plane. The primary motivation stems from the\noversight of soft transverse dynamics within the $k_T$ factorization formalism\nof an exclusive QCD process, which confines perturbative QCD (pQCD) predictions\nto scenarios involving large momentum transfers. We meticulously investigate\nthe $\\pi$ and $K$ electromagnetic form factors using the iTMDs-improved pQCD\ncalculation at next-to-leading order. By analyzing data in the timelike\nphysical regions, we obtain the transversal-size parameters $\\beta_\\pi^2 = 0.51\n\\pm 0.04$ GeV$^{-2}$ and $\\beta_K^2 = 0.30 \\pm 0.05$ GeV$^2$. We then extract\nthe chiral mass of pion to be $m_0^\\pi(1 \\, {\\rm GeV}) = 1.84 \\pm 0.07$ GeV and\nexplain the precise measurements of kaon form factor in the perturbative\ntimelike region. As a remarkable byproduct, we found that the incorporation of\niTMDs improves the pQCD predictions for electromagnetic form factors, extending\ntheir accuracy to the range of a few GeV$^2$. This improvement allows for\ndirect comparison with existing measurements and lattice QCD evaluations.\n","subjects":["Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"rcSyYJZqTPEl46_2Rd2Obn_T24piFZ5lYPi7M5YsSjQ","pdfSize":"626081"}