{
  "id": "2412.08883",
  "title": "ESpRESSO -- Forward modeling Roman Space Telescope spectroscopy",
  "authors": "Austen Gabrielpillai, Isak G. B. Wold, Sangeeta Malhotra, James\n  Rhoads, Guangjun Gao, Mainak Singha, Anton M. Koekemoer",
  "authorsParsed": [
    [
      "Gabrielpillai",
      "Austen",
      ""
    ],
    [
      "Wold",
      "Isak G. B.",
      ""
    ],
    [
      "Malhotra",
      "Sangeeta",
      ""
    ],
    [
      "Rhoads",
      "James",
      ""
    ],
    [
      "Gao",
      "Guangjun",
      ""
    ],
    [
      "Singha",
      "Mainak",
      ""
    ],
    [
      "Koekemoer",
      "Anton M.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 02:44:12 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1733971452000,
  "abstract": "  We describe the software package $\\texttt{ESpRESSO}$ - [E]xtragalactic\n[Sp]ectroscopic [R]oman [E]mulator and [S]imulator of [S]ynthetic [O]bjects,\ncreated to emulate the slitless spectroscopic observing modes of the Nancy\nGrace Roman Space Telescope (Roman) Wide Field Instrument (WFI). We combine\narchival Hubble Space Telescope (HST) imaging data of comparable spatial\nresolution with model spectral energy distributions to create a data-cube of\nflux density as a function of position and wavelength. This data-cube is used\nfor simulating a nine detector grism observation, producing a crowded\nbackground scene which model field angle dependent optical distortions expected\nfor the grism. We also demonstrate the ability to inject custom sources using\nthe described tools and pipelines. In addition, we show that spectral features\nsuch as emission line pairs are unlikely to be mistaken as off order\ncontaminating features and vice versa. Our result is a simulation suite of half\nof the eighteen detector array, with a realistic background scene and injected\nLy$\\alpha$ emitter (LAE) galaxies, realized at 25 position angles (PAs), 12\nwith analogous positive and negative dithers, Using an exposure time of 10ks\nper PA, the full PA set can be used as a mock deep Roman grism survey with high\n(synthetic) LAE completeness for developing future spectral data analysis\ntools.\n",
  "subjects": [
    "Astrophysics/Instrumentation and Methods for Astrophysics",
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "PjUY1OJjKP6SZdf1bpJ5G47kOwsTDtoZMG3wEkls4W4",
  "pdfSize": "9081873"
}