{"id":"2412.14797","title":"Quantum computing in spin-adapted representations for efficient\n  simulations of spin systems","authors":"Anthony Gandon, Alberto Baiardi, Max Rossmannek, Werner Dobrautz,\n  Ivano Tavernelli","authorsParsed":[["Gandon","Anthony",""],["Baiardi","Alberto",""],["Rossmannek","Max",""],["Dobrautz","Werner",""],["Tavernelli","Ivano",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 12:38:20 GMT"}],"updateDate":"2024-12-20","timestamp":1734611900000,"abstract":"  Exploiting inherent symmetries is a common and effective approach to speed up\nthe simulation of quantum systems. However, efficiently accounting for\nnon-Abelian symmetries, such as the $SU(2)$ total-spin symmetry, remains a\nmajor challenge. In fact, expressing total-spin eigenstates in terms of the\ncomputational basis can require an exponentially large number of coefficients.\nIn this work, we introduce a novel formalism for designing quantum algorithms\ndirectly in an eigenbasis of the total-spin operator. Our strategy relies on\nthe symmetric group approach in conjunction with a truncation scheme for the\ninternal degrees of freedom of total-spin eigenstates. For the case of the\nantiferromagnetic Heisenberg model, we show that this formalism yields a\nhierarchy of spin-adapted Hamiltonians, for each truncation threshold, whose\nground-state energy and wave function quickly converge to their exact\ncounterparts, calculated on the full model. These truncated Hamiltonians can be\nencoded with sparse and local qubit Hamiltonians that are suitable for quantum\nsimulations. We demonstrate this by developing a state-preparation schedule to\nconstruct shallow quantum-circuit approximations, expressed in a total-spin\neigenbasis, for the ground states of the Heisenberg Hamiltonian in different\nsymmetry sectors.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"6iajkBoj0a_AGXjfGKOCf_zv33Dnxtpg-ZBp_MtFdRg","pdfSize":"1747791"}