{
  "id": "2412.06683",
  "title": "A Decoupled Channel Estimation Method for Beyond Diagonal RIS",
  "authors": "Bruno Sokal, Fazal-E-Asim, Andr\\'e L. F. de Almeida, Hongyu Li, and\n  Bruno Clerckx",
  "authorsParsed": [
    [
      "Sokal",
      "Bruno",
      ""
    ],
    [
      "Fazal-E-Asim",
      "",
      ""
    ],
    [
      "de Almeida",
      "André L. F.",
      ""
    ],
    [
      "Li",
      "Hongyu",
      ""
    ],
    [
      "Clerckx",
      "Bruno",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 17:26:47 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733765207000,
  "abstract": "  Beyond diagonal reconfigurable intelligent surface (BD-RIS) is a new\narchitecture for RIS where elements are interconnected to provide more wave\nmanipulation flexibility than traditional single connected RIS, enhancing data\nrate and coverage. However, channel estimation for BD-RIS is challenging due to\nthe more complex multiple-connection structure involving their scattering\nelements. To address this issue, this paper proposes a decoupled channel\nestimation method for BD-RIS that yields separate estimates of the involved\nchannels to enhance the accuracy of the overall combined channel by\ncapitalizing on its Kronecker structure. Starting from a least squares estimate\nof the combined channel and by properly reshaping the resulting filtered\nsignal, the proposed algorithm resorts to a Khatri-Rao Factorization (KRF)\nmethod that teases out the individual channels based on simple rank-one matrix\napproximation steps. Numerical results show that the proposed decoupled channel\nestimation yields more accurate channel estimates than the classical least\nsquares scheme.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Signal Processing"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "8nkslDViuD0FHRyQ-hSU9NE6uq1m5mM_dFw8bx_V1Ho",
  "pdfSize": "986544"
}