{
  "id": "2412.06742",
  "title": "ContRail: A Framework for Realistic Railway Image Synthesis using\n  ControlNet",
  "authors": "Andrei-Robert Alexandrescu, Razvan-Gabriel Petec, Alexandru Manole,\n  Laura-Silvia Diosan",
  "authorsParsed": [
    [
      "Alexandrescu",
      "Andrei-Robert",
      ""
    ],
    [
      "Petec",
      "Razvan-Gabriel",
      ""
    ],
    [
      "Manole",
      "Alexandru",
      ""
    ],
    [
      "Diosan",
      "Laura-Silvia",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 18:34:49 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 10 Dec 2024 13:23:18 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733769289000,
  "abstract": "  Deep Learning became an ubiquitous paradigm due to its extraordinary\neffectiveness and applicability in numerous domains. However, the approach\nsuffers from the high demand of data required to achieve the potential of this\ntype of model. An ever-increasing sub-field of Artificial Intelligence, Image\nSynthesis, aims to address this limitation through the design of intelligent\nmodels capable of creating original and realistic images, endeavour which could\ndrastically reduce the need for real data. The Stable Diffusion generation\nparadigm recently propelled state-of-the-art approaches to exceed all previous\nbenchmarks. In this work, we propose the ContRail framework based on the novel\nStable Diffusion model ControlNet, which we empower through a multi-modal\nconditioning method. We experiment with the task of synthetic railway image\ngeneration, where we improve the performance in rail-specific tasks, such as\nrail semantic segmentation by enriching the dataset with realistic synthetic\nimages.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "6HCyNVOxJMZN6c2E80jBWtHZgiQhwKv2jdgBtsDrglM",
  "pdfSize": "18658873"
}