{
  "id": "2412.05836",
  "title": "Modeling time to failure using a temporal sequence of events",
  "authors": "Sandip K Pal, Arnab Koley, Pritam Ranjan, Debasis Kundu",
  "authorsParsed": [
    [
      "Pal",
      "Sandip K",
      ""
    ],
    [
      "Koley",
      "Arnab",
      ""
    ],
    [
      "Ranjan",
      "Pritam",
      ""
    ],
    [
      "Kundu",
      "Debasis",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 8 Dec 2024 06:52:00 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733640720000,
  "abstract": "  In recent years, the requirement for real-time understanding of machine\nbehavior has become an important objective in industrial sectors to reduce the\ncost of unscheduled downtime and to maximize production with expected quality.\nThe vast majority of high-end machines are equipped with a number of sensors\nthat can record event logs over time. In this paper, we consider an injection\nmolding (IM) machine that manufactures plastic bottles for soft drink. We have\nanalyzed the machine log data with a sequence of three type of events,\n``running with alert'', ``running without alert'', and ``failure''. Failure\nevent leads to downtime of the machine and necessitates maintenance. The\nsensors are capable of capturing the corresponding operational conditions of\nthe machine as well as the defined states of events. This paper presents a new\nmodel to predict a) time to failure of the IM machine and b) identification of\nimportant sensors in the system that may explain the events which in-turn leads\nto failure. The proposed method is more efficient than the popular competitor\nand can help reduce the downtime costs by controlling operational parameters in\nadvance to prevent failures from occurring too soon.\n",
  "subjects": [
    "Statistics/Methodology"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Q3sxL24R4xzlNVfXtb99OY1NlDYMJAnyh9eDaX7rhWk",
  "pdfSize": "1075261"
}