{"id":"2412.09030","title":"RingFormer: A Ring-Enhanced Graph Transformer for Organic Solar Cell\n  Property Prediction","authors":"Zhihao Ding, Ting Zhang, Yiran Li, Jieming Shi, Chen Jason Zhang","authorsParsed":[["Ding","Zhihao",""],["Zhang","Ting",""],["Li","Yiran",""],["Shi","Jieming",""],["Zhang","Chen Jason",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 07:45:17 GMT"}],"updateDate":"2024-12-13","timestamp":1733989517000,"abstract":"  Organic Solar Cells (OSCs) are a promising technology for sustainable energy\nproduction. However, the identification of molecules with desired OSC\nproperties typically involves laborious experimental research. To accelerate\nprogress in the field, it is crucial to develop machine learning models capable\nof accurately predicting the properties of OSC molecules. While graph\nrepresentation learning has demonstrated success in molecular property\nprediction, it remains underexplored for OSC-specific tasks. Existing methods\nfail to capture the unique structural features of OSC molecules, particularly\nthe intricate ring systems that critically influence OSC properties, leading to\nsuboptimal performance. To fill the gap, we present RingFormer, a novel graph\ntransformer framework specially designed to capture both atom and ring level\nstructural patterns in OSC molecules. RingFormer constructs a hierarchical\ngraph that integrates atomic and ring structures and employs a combination of\nlocal message passing and global attention mechanisms to generate expressive\ngraph representations for accurate OSC property prediction. We evaluate\nRingFormer's effectiveness on five curated OSC molecule datasets through\nextensive experiments. The results demonstrate that RingFormer consistently\noutperforms existing methods, achieving a 22.77% relative improvement over the\nnearest competitor on the CEPDB dataset.\n","subjects":["Computer Science/Machine Learning","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"7fnY-WHOVMqf0tXEeJ8bv8Hnx_jQNSSJfh7ZUcHb0Q0","pdfSize":"567948"}