{
  "id": "2412.14482",
  "title": "Embedding high-resolution touch across robotic hands enables adaptive\n  human-like grasping",
  "authors": "Zihang Zhao, Wanlin Li, Yuyang Li, Tengyu Liu, Boren Li, Meng Wang,\n  Kai Du, Hangxin Liu, Yixin Zhu, Qining Wang, Kaspar Althoefer, and Song-Chun\n  Zhu",
  "authorsParsed": [
    [
      "Zhao",
      "Zihang",
      ""
    ],
    [
      "Li",
      "Wanlin",
      ""
    ],
    [
      "Li",
      "Yuyang",
      ""
    ],
    [
      "Liu",
      "Tengyu",
      ""
    ],
    [
      "Li",
      "Boren",
      ""
    ],
    [
      "Wang",
      "Meng",
      ""
    ],
    [
      "Du",
      "Kai",
      ""
    ],
    [
      "Liu",
      "Hangxin",
      ""
    ],
    [
      "Zhu",
      "Yixin",
      ""
    ],
    [
      "Wang",
      "Qining",
      ""
    ],
    [
      "Althoefer",
      "Kaspar",
      ""
    ],
    [
      "Zhu",
      "Song-Chun",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 03:05:51 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734577551000,
  "abstract": "  Developing robotic hands that adapt to real-world dynamics remains a\nfundamental challenge in robotics and machine intelligence. Despite significant\nadvances in replicating human hand kinematics and control algorithms, robotic\nsystems still struggle to match human capabilities in dynamic environments,\nprimarily due to inadequate tactile feedback. To bridge this gap, we present\nF-TAC Hand, a biomimetic hand featuring high-resolution tactile sensing (0.1mm\nspatial resolution) across 70% of its surface area. Through optimized hand\ndesign, we overcome traditional challenges in integrating high-resolution\ntactile sensors while preserving the full range of motion. The hand, powered by\nour generative algorithm that synthesizes human-like hand configurations,\ndemonstrates robust grasping capabilities in dynamic real-world conditions.\nExtensive evaluation across 600 real-world trials demonstrates that this\ntactile-embodied system significantly outperforms non-tactile alternatives in\ncomplex manipulation tasks (p<0.0001). These results provide empirical evidence\nfor the critical role of rich tactile embodiment in developing advanced robotic\nintelligence, offering new perspectives on the relationship between physical\nsensing capabilities and intelligent behavior.\n",
  "subjects": [
    "Computer Science/Robotics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "NT7GlMxtyIrvzQdWurpoVMADdi9wuy845r2OTCqrXxA",
  "pdfSize": "15467589"
}