{
  "id": "2412.20253",
  "title": "Election of Collaborators via Reinforcement Learning for Federated Brain\n  Tumor Segmentation",
  "authors": "Muhammad Irfan Khan, Elina Kontio, Suleiman A. Khan, and Mojtaba\n  Jafaritadi",
  "authorsParsed": [
    [
      "Khan",
      "Muhammad Irfan",
      ""
    ],
    [
      "Kontio",
      "Elina",
      ""
    ],
    [
      "Khan",
      "Suleiman A.",
      ""
    ],
    [
      "Jafaritadi",
      "Mojtaba",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 28 Dec 2024 19:54:06 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735415646000,
  "abstract": "  Federated learning (FL) enables collaborative model training across\ndecentralized datasets while preserving data privacy. However, optimally\nselecting participating collaborators in dynamic FL environments remains\nchallenging. We present RL-HSimAgg, a novel reinforcement learning (RL) and\nsimilarity-weighted aggregation (simAgg) algorithm using harmonic mean to\nmanage outlier data points. This paper proposes applying multi-armed bandit\nalgorithms to improve collaborator selection and model generalization. By\nbalancing exploration-exploitation trade-offs, these RL methods can promote\nresource-efficient training with diverse datasets. We demonstrate the\neffectiveness of Epsilon-greedy (EG) and upper confidence bound (UCB)\nalgorithms for federated brain lesion segmentation. In simulation experiments\non internal and external validation sets, RL-HSimAgg with UCB collaborator\noutperformed the EG method across all metrics, achieving higher Dice scores for\nEnhancing Tumor (0.7334 vs 0.6797), Tumor Core (0.7432 vs 0.6821), and Whole\nTumor (0.8252 vs 0.7931) segmentation. Therefore, for the Federated Tumor\nSegmentation Challenge (FeTS 2024), we consider UCB as our primary client\nselection approach in federated Glioblastoma lesion segmentation of multi-modal\nMRIs. In conclusion, our research demonstrates that RL-based collaborator\nmanagement, e.g. using UCB, can potentially improve model robustness and\nflexibility in distributed learning environments, particularly in domains like\nbrain tumor segmentation.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "GKOFB8N-JoHjpOg_0Zwls74Z4KKLDnO-idlTlAhsz90",
  "pdfSize": "401659"
}