{"id":"2412.14209","title":"Integrating Evidence into the Design of XAI and AI-based Decision\n  Support Systems: A Means-End Framework for End-users in Construction","authors":"Peter .E.D. Love, Jane Matthews, Weili Fang, and Hadi Mahamivanan","authorsParsed":[["Love","Peter . E. D.",""],["Matthews","Jane",""],["Fang","Weili",""],["Mahamivanan","Hadi",""]],"versions":[{"version":"v1","created":"Tue, 17 Dec 2024 13:02:05 GMT"}],"updateDate":"2024-12-20","timestamp":1734440525000,"abstract":"  A narrative review is used to develop a theoretical evidence-based means-end\nframework to build an epistemic foundation to uphold explainable artificial\nintelligence instruments so that the reliability of outcomes generated from\ndecision support systems can be assured and better explained to end-users. The\nimplications of adopting an evidence-based approach to designing decision\nsupport systems in construction are discussed with emphasis placed on\nevaluating the strength, value, and utility of evidence needed to develop\nmeaningful human explanations for end-users. While the developed means-end\nframework is focused on end-users, stakeholders can also utilize it to create\nmeaningful human explanations. However, they will vary due to their different\nepistemic goals. Including evidence in the design and development of\nexplainable artificial intelligence and decision support systems will improve\ndecision-making effectiveness, enabling end-users' epistemic goals to be\nachieved. The proposed means-end framework is developed from a broad spectrum\nof literature. Thus, it is suggested that it can be used in construction and\nother engineering domains where there is a need to integrate evidence into the\ndesign of explainable artificial intelligence and decision support systems.\n","subjects":["Computer Science/Human-Computer Interaction","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"kRettElrl7VwPAdy6MU585Lfsxw6cxNOAOg3ym1vNiM","pdfSize":"727760"}