{"id":"2412.14388","title":"Identifying Band Inversions in Topological Materials Using Diffusion\n  Monte Carlo","authors":"Annette Lopez, Cody A. Melton, Jeonghwan Ahn, Brenda M. Rubenstein,\n  Jaron T. Krogel","authorsParsed":[["Lopez","Annette",""],["Melton","Cody A.",""],["Ahn","Jeonghwan",""],["Rubenstein","Brenda M.",""],["Krogel","Jaron T.",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 22:47:10 GMT"}],"updateDate":"2024-12-20","timestamp":1734562030000,"abstract":"  Topological insulators are characterized by insulating bulk states and robust\nmetallic surface states. Band inversion is a hallmark of topological\ninsulators: at time-reversal invariant points in the Brillouin zone, spin-orbit\ncoupling (SOC) induces a swapping of orbital character at the bulk band edges.\nIn this work, we develop a novel method to detect band inversion within\ncontinuum quantum Monte Carlo (QMC) methods that can accurately treat the\nelectron correlation and spin-orbit coupling crucial to the physics of\ntopological insulators. Our approach applies a momentum-space-resolved atomic\npopulation analysis throughout the first Brillouin zone utilizing the L\\\"owdin\nmethod and the one-body reduced density matrix produced with Diffusion Monte\nCarlo (DMC). We integrate this method into QMCPACK, an open source ab initio\nQMC package, so that these ground state methods can be used to complement\nexperimental studies and validate prior DFT work on predicting the band\nstructures of correlated topological insulators. We demonstrate this new\ntechnique on the topological insulator bismuth telluride, which displays band\ninversion between its Bi-p and Te-p states at the $\\Gamma$-point. We show an\nincrease in charge on the bismuth p orbital and a decrease in charge on the\ntellurium p orbital when comparing band structures with and without SOC.\nAdditionally, we use our method to compare the degree of band inversion present\nin monolayer Bi$_2$Te$_3$, which has no interlayer van der Waals interactions,\nto that seen in the bulk. The method presented here will enable future,\nmany-body studies of band inversion that can shed light on the delicate\ninterplay between correlation and topology in correlated topological materials.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_yfR9YV-PxwbqtGOCcA-2tsObA-mAdpFnelyBpeDnvU","pdfSize":"1868453"}