{"id":"2412.17473","title":"Bismuth doping induced enhancement of the spin-orbit coupling strength\n  in the prototype dilute ferromagnetic semiconductor (Ga,Mn)As: a review","authors":"Tadeusz Wosinski","authorsParsed":[["Wosinski","Tadeusz",""]],"versions":[{"version":"v1","created":"Mon, 23 Dec 2024 10:59:58 GMT"}],"updateDate":"2025-01-27","timestamp":1734951598000,"abstract":"  Extensive studies on the impact of bismuth incorporation into the (Ga,Mn)As\nprototype dilute ferromagnetic semiconductor (DFS) on its structural, magnetic\nand magnetotransport properties are summarized in this review. Thin epitaxial\nlayers of the quaternary (Ga,Mn)(Bi,As) compound, containing up to 1% Bi and 6%\nMn atoms, and the reference ternary (Ga,Mn)As compound, have been grown under\neither a compressive or tensile biaxial misfit strain by the low-temperature\nmolecular-beam epitaxy technique with precisely optimized growth conditions.\nThe high-resolution X-ray diffractometry measurements and transmission electron\nmicroscopy imaging of cross-sections across the sample interfaces have\nevidenced for high structural perfection of the DFS layers and sharp interfaces\nwith the substrate. An addition of bismuth into the layers causes a small\ndecrease in their ferromagnetic Curie temperature and a distinct increase in\nthe coercive fields, as revealed by the superconducting quantum interference\ndevice magnetometry investigations. Most of all, the incorporation of a small\natomic fraction of heavy Bi atoms, substituting As atoms in the layer,\npredominantly enhances the spin-orbit coupling strength in its valence band,\nconsiderably affecting electromagnetic properties of the layers. Investigations\nof magnetotransport properties of the DFS layers, performed on micro-Hall-bars\nprepared from the layers using electron-beam lithography patterning, reveal, as\na result of Bi addition to the layers, significantly enhanced magnitudes of\nmagnetoresistance, anomalous and planar Hall effects as well as the spin-orbit\ntorque effect. The latter effect is of special interest for applications to the\nnext generation non-volatile data storage and logic spintronic devices,\nutilizing electrically controlled magnetization reversal.\n","subjects":["Condensed Matter/Materials Science","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ENqYmnlVPRYv_rF0SQpXq_vfybNHzTrzzkeX8d4czxk","pdfSize":"1365252"}