{
  "id": "2412.00975",
  "title": "On the Orbital Effects of Stellar Collisions in Galactic Nuclei: Tidal\n  Disruption Events and Ejected Stars",
  "authors": "Sanaea C. Rose and Brenna Mockler",
  "authorsParsed": [
    [
      "Rose",
      "Sanaea C.",
      ""
    ],
    [
      "Mockler",
      "Brenna",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 1 Dec 2024 21:38:01 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733089081000,
  "abstract": "  Dense stellar clusters surround the supermassive black holes (SMBH) in\ngalactic nuclei. Interactions within the cluster can alter the stellar orbits,\noccasionally driving a star into the SMBH's tidal radius where it becomes\nruptured. This proof-of-concept study examines the orbital effects of stellar\ncollisions using a semianalytic model. Both low and high speed collisions occur\nin the SMBH's sphere of influence. Our model treats stars in low speed\ncollisions as sticky spheres. For high-speed collisions, we develop a simple\nprescription based on the limiting case of a hyperbolic encounter. We test a\nrange of collision treatments and cluster conditions. We find that collisions\ncan place stars on nearly radial orbits. Depositing stars within the tidal\nradius, collisions may drive the disruption of stars with unusual masses and\nstructures: depending on the nature of the collision, the star could be the\nproduct of a recent merger, or it could have lost its outer layers in a high\nspeed impact, appearing as a stripped star. We also find that high speed\ncollisions near the periapsis of an eccentric orbit can unbind stars from the\nSMBH. However, dissipation during these high-speed collisions can substantially\nreduce the number of unbound stars achieved in our simulations. We conclude\nthat TDEs and ejected stars, even in the hypervelocity regime, are plausible\noutcomes of stellar collisions, though their frequency in a three-dimensional\nnuclear star cluster are uncertain. Future work will address the rates and\nproperties of these events.\n",
  "subjects": [
    "Astrophysics/Astrophysics of Galaxies",
    "Astrophysics/High Energy Astrophysical Phenomena"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "p0Ai929_2qO1xfdeSVOCTg-d_TfZD3rObXJnwnCNyoA",
  "pdfSize": "1366226"
}