{
  "id": "2412.05708",
  "title": "On the effective transfer of knowledge from English to Hindi Wikipedia",
  "authors": "Paramita Das, Amartya Roy, Ritabrata Chakraborty, Animesh Mukherjee",
  "authorsParsed": [
    [
      "Das",
      "Paramita",
      ""
    ],
    [
      "Roy",
      "Amartya",
      ""
    ],
    [
      "Chakraborty",
      "Ritabrata",
      ""
    ],
    [
      "Mukherjee",
      "Animesh",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 7 Dec 2024 17:43:21 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733593401000,
  "abstract": "  Although Wikipedia is the largest multilingual encyclopedia, it remains\ninherently incomplete. There is a significant disparity in the quality of\ncontent between high-resource languages (HRLs, e.g., English) and low-resource\nlanguages (LRLs, e.g., Hindi), with many LRL articles lacking adequate\ninformation. To bridge these content gaps, we propose a lightweight framework\nto enhance knowledge equity between English and Hindi. In case the English\nWikipedia page is not up-to-date, our framework extracts relevant information\nfrom external resources readily available (such as English books) and adapts it\nto align with Wikipedia's distinctive style, including its \\textit{neutral\npoint of view} (NPOV) policy, using in-context learning capabilities of large\nlanguage models. The adapted content is then machine-translated into Hindi for\nintegration into the corresponding Wikipedia articles. On the other hand, if\nthe English version is comprehensive and up-to-date, the framework directly\ntransfers knowledge from English to Hindi. Our framework effectively generates\nnew content for Hindi Wikipedia sections, enhancing Hindi Wikipedia articles\nrespectively by 65% and 62% according to automatic and human judgment-based\nevaluations.\n",
  "subjects": [
    "Computer Science/Computation and Language",
    "Computer Science/Information Retrieval",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "R9kyYXV1ZHbW0UWYkEyv_oFdI6hhWDSpsYDmG7ls66c",
  "pdfSize": "873360"
}