{
  "id": "2412.19980",
  "title": "Hades: Homomorphic Augmented Decryption for Efficient Symbol-comparison\n  -- A Database's Perspective",
  "authors": "Dongfang Zhao",
  "authorsParsed": [
    [
      "Zhao",
      "Dongfang",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 28 Dec 2024 02:47:14 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735354034000,
  "abstract": "  Outsourced databases powered by fully homomorphic encryption (FHE) offer the\npromise of secure data processing on untrusted cloud servers. A crucial aspect\nof database functionality, and one that has remained challenging to integrate\nefficiently within FHE schemes, is the ability to perform comparisons on\nencrypted data. Such comparisons are fundamental for various database\noperations, including building indexes for efficient data retrieval and\nexecuting range queries to select data within specific intervals. While\ntraditional approaches like Order-Preserving Encryption (OPE) could enable\ncomparisons, they are fundamentally incompatible with FHE without significantly\nincreasing ciphertext size, thereby exacerbating the inherent performance\noverhead of FHE and further hindering its practical deployment. This paper\nintroduces HADES, a novel cryptographic framework that enables efficient and\nsecure comparisons directly on FHE ciphertexts without any ciphertext\nexpansion. Based on the Ring Learning with Errors (RLWE) problem, HADES\nprovides CPA-security and incorporates perturbation-aware encryption to\nmitigate frequency-analysis attacks. Implemented using OpenFHE, HADES supports\nboth integer and floating-point operations, demonstrating practical performance\non real-world datasets and outperforming state-of-the-art baselines.\n",
  "subjects": [
    "Computer Science/Databases",
    "Computer Science/Cryptography and Security"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "tzcw-kSQm9l6SrV5ihBS6OyFaNLqNTVNX_5Y0g77qYU",
  "pdfSize": "872406"
}