{"id":"2412.05619","title":"Do We Need to Design Specific Diffusion Models for Different Tasks? Try\n  ONE-PIC","authors":"Ming Tao, Bing-Kun Bao, Yaowei Wang, Changsheng Xu","authorsParsed":[["Tao","Ming",""],["Bao","Bing-Kun",""],["Wang","Yaowei",""],["Xu","Changsheng",""]],"versions":[{"version":"v1","created":"Sat, 7 Dec 2024 11:19:32 GMT"}],"updateDate":"2024-12-10","timestamp":1733570372000,"abstract":"  Large pretrained diffusion models have demonstrated impressive generation\ncapabilities and have been adapted to various downstream tasks. However, unlike\nLarge Language Models (LLMs) that can learn multiple tasks in a single model\nbased on instructed data, diffusion models always require additional branches,\ntask-specific training strategies, and losses for effective adaptation to\ndifferent downstream tasks. This task-specific fine-tuning approach brings two\ndrawbacks. 1) The task-specific additional networks create gaps between\npretraining and fine-tuning which hinders the transfer of pretrained knowledge.\n2) It necessitates careful additional network design, raising the barrier to\nlearning and implementation, and making it less user-friendly. Thus, a question\narises: Can we achieve a simple, efficient, and general approach to fine-tune\ndiffusion models? To this end, we propose ONE-PIC. It enhances the inherited\ngenerative ability in the pretrained diffusion models without introducing\nadditional modules. Specifically, we propose In-Visual-Context Tuning, which\nconstructs task-specific training data by arranging source images and target\nimages into a single image. This approach makes downstream fine-tuning closer\nto the pertaining, allowing our model to adapt more quickly to various\ndownstream tasks. Moreover, we propose a Masking Strategy to unify different\ngenerative tasks. This strategy transforms various downstream fine-tuning tasks\ninto predictions of the masked portions. The extensive experimental results\ndemonstrate that our method is simple and efficient which streamlines the\nadaptation process and achieves excellent performance with lower costs. Code is\navailable at https://github.com/tobran/ONE-PIC.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"4RnM69AHKwhsJ8N02ypzoTtvVSVPriq5MoukJfSkvnY","pdfSize":"22068034"}