{"id":"2412.11717","title":"Learning UAV-based path planning for efficient localization of objects\n  using prior knowledge","authors":"Rick van Essen, Eldert van Henten and Gert Kootstra","authorsParsed":[["van Essen","Rick",""],["van Henten","Eldert",""],["Kootstra","Gert",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 12:39:02 GMT"}],"updateDate":"2024-12-17","timestamp":1734352742000,"abstract":"  UAV's are becoming popular for various object search applications in\nagriculture, however they usually use time-consuming row-by-row flight paths.\nThis paper presents a deep-reinforcement-learning method for path planning to\nefficiently localize objects of interest using UAVs with a minimal flight-path\nlength. The method uses some global prior knowledge with uncertain object\nlocations and limited resolution in combination with a local object map created\nusing the output of an object detection network. The search policy could be\nlearned using deep Q-learning. We trained the agent in simulation, allowing\nthorough evaluation of the object distribution, typical errors in the\nperception system and prior knowledge, and different stopping criteria. When\nobjects were non-uniformly distributed over the field, the agent found the\nobjects quicker than a row-by-row flight path, showing that it learns to\nexploit the distribution of objects. Detection errors and quality of prior\nknowledge had only minor effect on the performance, indicating that the learned\nsearch policy was robust to errors in the perception system and did not need\ndetailed prior knowledge. Without prior knowledge, the learned policy was still\ncomparable in performance to a row-by-row flight path. Finally, we demonstrated\nthat it is possible to learn the appropriate moment to end the search task. The\napplicability of the approach for object search on a real drone was\ncomprehensively discussed and evaluated. Overall, we conclude that the learned\nsearch policy increased the efficiency of finding objects using a UAV, and can\nbe applied in real-world conditions when the specified assumptions are met.\n","subjects":["Computer Science/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_daoLg2jxvnMXSGYMAKXxLUu9LlDbXlS2jZF2b4LQLY","pdfSize":"1796595"}