{
  "id": "2412.09492",
  "title": "Video Seal: Open and Efficient Video Watermarking",
  "authors": "Pierre Fernandez, Hady Elsahar, I. Zeki Yalniz, Alexandre Mourachko",
  "authorsParsed": [
    [
      "Fernandez",
      "Pierre",
      ""
    ],
    [
      "Elsahar",
      "Hady",
      ""
    ],
    [
      "Yalniz",
      "I. Zeki",
      ""
    ],
    [
      "Mourachko",
      "Alexandre",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 17:41:49 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1734025309000,
  "abstract": "  The proliferation of AI-generated content and sophisticated video editing\ntools has made it both important and challenging to moderate digital platforms.\nVideo watermarking addresses these challenges by embedding imperceptible\nsignals into videos, allowing for identification. However, the rare open tools\nand methods often fall short on efficiency, robustness, and flexibility. To\nreduce these gaps, this paper introduces Video Seal, a comprehensive framework\nfor neural video watermarking and a competitive open-sourced model. Our\napproach jointly trains an embedder and an extractor, while ensuring the\nwatermark robustness by applying transformations in-between, e.g., video\ncodecs. This training is multistage and includes image pre-training, hybrid\npost-training and extractor fine-tuning. We also introduce temporal watermark\npropagation, a technique to convert any image watermarking model to an\nefficient video watermarking model without the need to watermark every\nhigh-resolution frame. We present experimental results demonstrating the\neffectiveness of the approach in terms of speed, imperceptibility, and\nrobustness. Video Seal achieves higher robustness compared to strong baselines\nespecially under challenging distortions combining geometric transformations\nand video compression. Additionally, we provide new insights such as the impact\nof video compression during training, and how to compare methods operating on\ndifferent payloads. Contributions in this work - including the codebase,\nmodels, and a public demo - are open-sourced under permissive licenses to\nfoster further research and development in the field.\n",
  "subjects": [
    "Computer Science/Multimedia",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "LpMaZd4wq4UbyLJfty71yX7aGbpgZt9v_tR6Oyyextc",
  "pdfSize": "43061297"
}