{
  "id": "2412.14403",
  "title": "Short-term wind forecasting via surface pressure measurements:\n  stochastic modeling and sensor placement",
  "authors": "Seyedalireza Abootorabi, Stefano Leonardi, Mario Rotea, Armin Zare",
  "authorsParsed": [
    [
      "Abootorabi",
      "Seyedalireza",
      ""
    ],
    [
      "Leonardi",
      "Stefano",
      ""
    ],
    [
      "Rotea",
      "Mario",
      ""
    ],
    [
      "Zare",
      "Armin",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 23:22:47 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734564167000,
  "abstract": "  We propose a short-term wind forecasting framework for predicting real-time\nvariations in atmospheric turbulence based on nacelle-mounted anemometer and\nground-level air-pressure measurements. Our approach combines linear stochastic\nestimation and Kalman filtering algorithms to assimilate and process real-time\nfield measurements with the predictions of a stochastic reduced-order model\nthat is confined to a two-dimensional plane at the hub height of turbines. We\nbridge the vertical gap between the computational plane of the model at hub\nheight and the measurement plane on the ground using a projection technique\nthat allows us to infer the pressure in one plane from the other. Depending on\nthe quality of this inference, we show that customized variants of the extended\nand ensemble Kalman filters can be tuned to balance estimation quality and\ncomputational speed 1-1.5 diameters ahead and behind leading turbines. In\nparticular, we show how synchronizing the sign of estimates with that of\nvelocity fluctuations recorded at the nacelle can significantly improve the\nability to follow temporal variations upwind of the leading turbine. We also\npropose a convex optimization-based framework for selecting a subset of\npressure sensors that achieve a desired level of accuracy relative to the\noptimal Kalman filter that uses all sensing capabilities.\n",
  "subjects": [
    "Physics/Fluid Dynamics",
    "Computer Science/Systems and Control",
    "Electrical Engineering and Systems Science/Systems and Control",
    "Mathematics/Dynamical Systems",
    "Physics/Atmospheric and Oceanic Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "ypu7zSFDO08fCs-lribihwBN6sL6cnP1V-TlFyYj7bI",
  "pdfSize": "15391885"
}