{
  "id": "2412.14498",
  "title": "Diverging network architecture of the $\\textit{C. elegans}$ connectome\n  and signaling network",
  "authors": "Sophie Dvali, Caio Seguin, Richard Betzel, and Andrew M. Leifer",
  "authorsParsed": [
    [
      "Dvali",
      "Sophie",
      ""
    ],
    [
      "Seguin",
      "Caio",
      ""
    ],
    [
      "Betzel",
      "Richard",
      ""
    ],
    [
      "Leifer",
      "Andrew M.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 03:46:31 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734579991000,
  "abstract": "  The connectome describes the complete set of synaptic contacts through which\nneurons communicate. While the architecture of the $\\textit{C. elegans}$\nconnectome has been extensively characterized, much less is known about the\norganization of causal signaling networks arising from functional interactions\nbetween neurons. Understanding how effective communication pathways relate to\nor diverge from the underlying structure is a central question in neuroscience.\nHere, we analyze the modular architecture of the $\\textit{C. elegans}$ signal\npropagation network, measured via calcium imaging and optogenetics, and compare\nit to the underlying anatomical wiring measured by electron microscopy.\nCompared to the connectome, we find that signaling modules are not aligned with\nthe modular boundaries of the anatomical network, highlighting an instance\nwhere function deviates from structure. An exception to this is the pharynx\nwhich is delineated into a separate community in both anatomy and signaling. We\nanalyze the cellular compositions of the signaling architecture and find that\nits modules are enriched for specific cell types and functions, suggesting that\nthe network modules are neurobiologically relevant. Lastly, we identify a \"rich\nclub\" of hub neurons in the signaling network. The membership of the signaling\nrich club differs from the rich club detected in the anatomical network,\nchallenging the view that structural hubs occupy positions of influence in\nfunctional (signaling) networks. Our results provide new insight into the\ninterplay between brain structure, in the form of a complete synaptic-level\nconnectome, and brain function, in the form of a system-wide causal signal\npropagation atlas.\n",
  "subjects": [
    "Quantitative Biology/Neurons and Cognition"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "pPrRt6KsbajquBPGGF1ASSutr1gXwF0uPwRz1rbK26c",
  "pdfSize": "27009171"
}