{"id":"2412.06989","title":"Learning About Algorithm Auditing in Five Steps: Scaffolding How High\n  School Youth Can Systematically and Critically Evaluate Machine Learning\n  Applications","authors":"Luis Morales-Navarro, Yasmin B. Kafai, Lauren Vogelstein, Evelyn Yu,\n  Dana\\\"e Metaxa","authorsParsed":[["Morales-Navarro","Luis",""],["Kafai","Yasmin B.",""],["Vogelstein","Lauren",""],["Yu","Evelyn",""],["Metaxa","Danaë",""]],"versions":[{"version":"v1","created":"Mon, 9 Dec 2024 20:55:54 GMT"},{"version":"v2","created":"Wed, 11 Dec 2024 22:21:17 GMT"},{"version":"v3","created":"Fri, 10 Jan 2025 19:05:56 GMT"}],"updateDate":"2025-01-14","timestamp":1733777754000,"abstract":"  While there is widespread interest in supporting young people to critically\nevaluate machine learning-powered systems, there is little research on how we\ncan support them in inquiring about how these systems work and what their\nlimitations and implications may be. Outside of K-12 education, an effective\nstrategy in evaluating black-boxed systems is algorithm auditing-a method for\nunderstanding algorithmic systems' opaque inner workings and external impacts\nfrom the outside in. In this paper, we review how expert researchers conduct\nalgorithm audits and how end users engage in auditing practices to propose five\nsteps that, when incorporated into learning activities, can support young\npeople in auditing algorithms. We present a case study of a team of teenagers\nengaging with each step during an out-of-school workshop in which they audited\npeer-designed generative AI TikTok filters. We discuss the kind of scaffolds we\nprovided to support youth in algorithm auditing and directions and challenges\nfor integrating algorithm auditing into classroom activities. This paper\ncontributes: (a) a conceptualization of five steps to scaffold algorithm\nauditing learning activities, and (b) examples of how youth engaged with each\nstep during our pilot study.\n","subjects":["Computer Science/Human-Computer Interaction","Computer Science/Artificial Intelligence","Computer Science/Computers and Society"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"A8jv4xpB9YSdWCUl5kPlNj-V8YxGloEtablZX6jH63g","pdfSize":"5684230"}