{"id":"2412.02283","title":"VR Based Emotion Recognition Using Deep Multimodal Fusion With\n  Biosignals Across Multiple Anatomical Domains","authors":"Pubudu L. Indrasiri and Bipasha Kashyap and Chandima Kolambahewage and\n  Bahareh Nakisa and Kiran Ijaz and Pubudu N. Pathirana","authorsParsed":[["Indrasiri","Pubudu L.",""],["Kashyap","Bipasha",""],["Kolambahewage","Chandima",""],["Nakisa","Bahareh",""],["Ijaz","Kiran",""],["Pathirana","Pubudu N.",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 08:59:12 GMT"}],"updateDate":"2024-12-04","timestamp":1733216352000,"abstract":"  Emotion recognition is significantly enhanced by integrating multimodal\nbiosignals and IMU data from multiple domains. In this paper, we introduce a\nnovel multi-scale attention-based LSTM architecture, combined with\nSqueeze-and-Excitation (SE) blocks, by leveraging multi-domain signals from the\nhead (Meta Quest Pro VR headset), trunk (Equivital Vest), and peripheral\n(Empatica Embrace Plus) during affect elicitation via visual stimuli. Signals\nfrom 23 participants were recorded, alongside self-assessed valence and arousal\nratings after each stimulus. LSTM layers extract features from each modality,\nwhile multi-scale attention captures fine-grained temporal dependencies, and SE\nblocks recalibrate feature importance prior to classification. We assess which\ndomain's signals carry the most distinctive emotional information during VR\nexperiences, identifying key biosignals contributing to emotion detection. The\nproposed architecture, validated in a user study, demonstrates superior\nperformance in classifying valance and arousal level (high / low), showcasing\nthe efficacy of multi-domain and multi-modal fusion with biosignals (e.g.,\nTEMP, EDA) with IMU data (e.g., accelerometer) for emotion recognition in\nreal-world applications.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"z8C8LpQbxTHrVHCgiyoyohVkNyNzOXmXTkGOZbvx7Lg","pdfSize":"4672977"}