{
  "id": "2412.03644",
  "title": "A nuclear spiral in a dusty star-forming galaxy at $z=2.78$",
  "authors": "H. R. Stacey, M. Kaasinen, C. M. O'Riordan, J. P. McKean, D. M. Powell\n  and F. Rizzo",
  "authorsParsed": [
    [
      "Stacey",
      "H. R.",
      ""
    ],
    [
      "Kaasinen",
      "M.",
      ""
    ],
    [
      "O'Riordan",
      "C. M.",
      ""
    ],
    [
      "McKean",
      "J. P.",
      ""
    ],
    [
      "Powell",
      "D. M.",
      ""
    ],
    [
      "Rizzo",
      "F.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 19:00:00 GMT"
    }
  ],
  "updateDate": "2025-01-29",
  "timestamp": 1733338800000,
  "abstract": "  The nuclear structure of dusty star-forming galaxies is largely unexplored\nbut harbours critical information about their structural evolution. Here, we\npresent long-baseline Atacama Large (sub-)Millimetre Array (ALMA) continuum\nobservations of a gravitationally lensed dusty star-forming galaxy at $z=2.78$.\nWe use a pixellated lens modelling analysis to reconstruct the rest-frame 230\n$\\rm\\mu$m dust emission with a mean resolution of $\\approx55$ pc and\ndemonstrate that the inferred source properties are robust to changes in lens\nmodelling methodology. The central 1 kpc is characterised by an exponential\nprofile, a dual spiral arm morphology and an apparent super-Eddington compact\ncentral starburst. We find tentative evidence for a nuclear bar in the central\n300 pc. These features may indicate that secular dynamical processes play a\nrole in accumulating a high concentration of cold gas that fuels the rapid\nformation of a compact stellar spheroid and black hole accretion. We propose\nthat the high spatial resolution provided by long-baseline ALMA observations\nand strong gravitational lensing will give key insights into the formation\nmechanisms of massive galaxies.\n",
  "subjects": [
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "7rGVL4YppIYy4hBx42fd4549p_fT10CaQZ4a8j2XVeQ",
  "pdfSize": "1828100"
}