{"id":"2412.10796","title":"Spatio-temporal analysis of extreme winter temperatures in Ireland","authors":"D\\'aire Healy, Jonathan A. Tawn, Peter Thorne and Andrew Parnell","authorsParsed":[["Healy","Dáire",""],["Tawn","Jonathan A.",""],["Thorne","Peter",""],["Parnell","Andrew",""]],"versions":[{"version":"v1","created":"Sat, 14 Dec 2024 11:26:28 GMT"}],"updateDate":"2024-12-17","timestamp":1734175588000,"abstract":"  We analyse extreme daily minimum temperatures in winter months over the\nisland of Ireland from 1950-2022. We model the marginal distributions of\nextreme winter minima using a generalised Pareto distribution (GPD), capturing\ntemporal and spatial non-stationarities in the parameters of the GPD. We\ninvestigate two independent temporal non-stationarities in extreme winter\nminima. We model the long-term trend in magnitude of extreme winter minima as\nwell as short-term, large fluctuations in magnitude caused by anomalous\nbehaviour of the jet stream. We measure magnitudes of spatial events with a\ncarefully chosen risk function and fit an r-Pareto process to extreme events\nexceeding a high-risk threshold. Our analysis is based on synoptic data\nobservations courtesy of Met \\'Eireann and the Met Office. We show that the\nfrequency of extreme cold winter events is decreasing over the study period.\nThe magnitude of extreme winter events is also decreasing, indicating that\nwinters are warming, and apparently warming at a faster rate than extreme\nsummer temperatures. We also show that extremely cold winter temperatures are\nwarming at a faster rate than non-extreme winter temperatures. We find that a\nclimate model output previously shown to be informative as a covariate for\nmodelling extremely warm summer temperatures is less effective as a covariate\nfor extremely cold winter temperatures. However, we show that the climate model\nis useful for informing a non-extreme temperature model.\n","subjects":["Physics/Atmospheric and Oceanic Physics","Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"-vdRYqena_0AWI0GFRH2_28ozk1zkTPQYtGQHmB69mk","pdfSize":"3199142"}