{"id":"2412.15128","title":"Estimating Heterogeneous Treatment Effects for Spatio-Temporal Causal\n  Inference: How Economic Assistance Moderates the Effects of Airstrikes on\n  Insurgent Violence","authors":"Lingxiao Zhou, Kosuke Imai, Jason Lyall, Georgia Papadogeorgou","authorsParsed":[["Zhou","Lingxiao",""],["Imai","Kosuke",""],["Lyall","Jason",""],["Papadogeorgou","Georgia",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 18:08:54 GMT"}],"updateDate":"2024-12-20","timestamp":1734631734000,"abstract":"  Scholars from diverse fields now increasingly rely on high-frequency\nspatio-temporal data. Yet, causal inference with these data remains challenging\ndue to the twin threats of spatial spillover and temporal carryover effects. We\ndevelop methods to estimate heterogeneous treatment effects by allowing for\narbitrary spatial and temporal causal dependencies. We focus on common settings\nwhere the treatment and outcomes are time-varying spatial point patterns and\nwhere moderators are either spatial or spatio-temporal in nature. We define\ncausal estimands based on stochastic interventions where researchers specify\ncounterfactual distributions of treatment events. We propose the Hajek-type\nestimator of the conditional average treatment effect (CATE) as a function of\nspatio-temporal moderator variables, and establish its asymptotic normality as\nthe number of time periods increases. We then introduce a statistical test of\nno heterogeneous treatment effects. Through simulations, we evaluate the\nfinite-sample performance of the proposed CATE estimator and its inferential\nproperties. Our motivating application examines the heterogeneous effects of US\nairstrikes on insurgent violence in Iraq. Drawing on declassified\nspatio-temporal data, we examine how prior aid distributions moderate airstrike\neffects. Contrary to expectations from counterinsurgency theories, we find that\nprior aid distribution, along with greater amounts of aid per capita, is\nassociated with increased insurgent attacks following airstrikes.\n","subjects":["Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"AZ96x7bK0H2px7ptyQB5YFFMNMPQdmi_E497EK0dlTY","pdfSize":"2258612"}