{
  "id": "2412.15850",
  "title": "Experimental discovery of Sarma state in atomically thick\n  superconducting FeSe films under high magnetic fields",
  "authors": "Wantong Huang, Yuguo Yin, Haicheng Lin, Wei Chen, Yaowu Liu, Lichen\n  Ji, Zichun Zhang, Xinyu Zhou, Xusheng Wang, Xiaopeng Hu, Yong Xu, Lianyi He,\n  Xi Chen, Qi-Kun Xue, Shuai-Hua Ji",
  "authorsParsed": [
    [
      "Huang",
      "Wantong",
      ""
    ],
    [
      "Yin",
      "Yuguo",
      ""
    ],
    [
      "Lin",
      "Haicheng",
      ""
    ],
    [
      "Chen",
      "Wei",
      ""
    ],
    [
      "Liu",
      "Yaowu",
      ""
    ],
    [
      "Ji",
      "Lichen",
      ""
    ],
    [
      "Zhang",
      "Zichun",
      ""
    ],
    [
      "Zhou",
      "Xinyu",
      ""
    ],
    [
      "Wang",
      "Xusheng",
      ""
    ],
    [
      "Hu",
      "Xiaopeng",
      ""
    ],
    [
      "Xu",
      "Yong",
      ""
    ],
    [
      "He",
      "Lianyi",
      ""
    ],
    [
      "Chen",
      "Xi",
      ""
    ],
    [
      "Xue",
      "Qi-Kun",
      ""
    ],
    [
      "Ji",
      "Shuai-Hua",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 12:46:32 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734698792000,
  "abstract": "  Many-body ground states of imbalanced Fermi gas have been studied both\ntheoretically and experimentally for several decades because of their\nfundamental significance in condensed matter physics, cold atom physics and\nnuclear physics. The Sarma state, a gapless spin-polarized superfluid, is one\nof those long sought-after exotic ground states of spin imbalanced Fermi gas.\nYet, an unambiguous experimental evidence of Sarma superfluid state has not\nbeen found. Here, we report the experimental discovery of the Sarma state in\natomically thick FeSe films by a dilution-refrigerator scanning tunneling\nmicroscope under high magnetic fields. In the bilayer or trilayer FeSe films,\nwe directly observe the key evidence of the entrance of the Sarma state: the\ninner Zeeman splitting coherence peaks cross the Fermi level under high\nin-plane magnetic fields. The angle dependent critical in-plane magnetic field\nof coherence peak crossing shows a two-fold symmetry due to the anisotropy of\nthe in-plane g-factor of FeSe films. Moreover, in a superconducting FeSe\nmonolayer of a lateral size of several hundred nanometers, the Sarma state can\nalso be induced by strong out-of-plane magnetic fields. Our findings pave the\nway to explore the unusual physical properties and potential applications in\nsuperconducting spintronics of the spin-polarized Sarma superfluid state.\n",
  "subjects": [
    "Condensed Matter/Superconductivity"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "23Cf3KNXiLOK3rmmdWwNBq56n8so8zGP4PRR71IQjoc",
  "pdfSize": "5933312"
}