{"id":"2412.17820","title":"Hyperbolic embedding of brain networks can predict the surgery outcome\n  in temporal lobe epilepsy","authors":"Martin Guillemaud, Alice Longhena, Louis Cousyn, Valerio Frazzini,\n  Bertrand Mathon, Vincent Navarro, Mario Chavez","authorsParsed":[["Guillemaud","Martin",""],["Longhena","Alice",""],["Cousyn","Louis",""],["Frazzini","Valerio",""],["Mathon","Bertrand",""],["Navarro","Vincent",""],["Chavez","Mario",""]],"versions":[{"version":"v1","created":"Mon, 9 Dec 2024 11:45:13 GMT"},{"version":"v2","created":"Sat, 8 Feb 2025 14:00:23 GMT"}],"updateDate":"2025-02-11","timestamp":1733744713000,"abstract":"  Epilepsy surgery, particularly for temporal lobe epilepsy (TLE), remains a\nvital treatment option for patients with drug-resistant seizures. However,\naccurately predicting surgical outcomes remains a significant challenge. This\nstudy introduces a novel biomarker derived from brain connectivity changes\ncaused by TLE surgery, analyzed using hyperbolic graph embeddings, to predict\nsurgical success. Using structural and diffusion magnetic resonance imaging\n(MRI) data from 51 patients, we examined differences in structural connectivity\nnetworks associated to surgical outcomes. Our approach uniquely leveraged\nhyperbolic disk embeddings of pre- and post-surgery brain networks,\nsuccessfully distinguishing patients with favorable outcomes from those with\npoor outcomes. Notably, the method identified regions in the contralateral\nhemisphere relative to the epileptogenic zone, whose connectivity patterns\nemerged as a potential biomarker for favorable surgical outcomes. To validate\nthe model, we employed a leave-one-out cross-validation approach, achieving an\narea under the curve (AUC) of 0.86 and a balanced accuracy of 0.81. These\nresults underscore the predictive capability of our model and its effectiveness\nin individual outcome forecasting based on structural network changes. Our\nfindings highlight the use of non-Euclidean hyperbolic graph embeddings to\nanalyze brain networks, offering deeper insights into connectivity alterations\nin epilepsy, and advancing personalized prediction of surgical outcomes in TLE.\n","subjects":["Quantitative Biology/Neurons and Cognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"4ADTG8HtYXRmDNspnoY3I_uiG_rkn084WH1SQ7Ps65M","pdfSize":"5891079"}