{
  "id": "2412.13760",
  "title": "Hunting pre-stellar cores with APEX: IRAS16293E (Oph464)",
  "authors": "S. Spezzano, E. Redaelli, P. Caselli, O. Sipil\\\"a, J. Harju, F. Lique,\n  D. Arzoumanian, J. E. Pineda, F. Wyrowski, and A. Belloche",
  "authorsParsed": [
    [
      "Spezzano",
      "S.",
      ""
    ],
    [
      "Redaelli",
      "E.",
      ""
    ],
    [
      "Caselli",
      "P.",
      ""
    ],
    [
      "Sipilä",
      "O.",
      ""
    ],
    [
      "Harju",
      "J.",
      ""
    ],
    [
      "Lique",
      "F.",
      ""
    ],
    [
      "Arzoumanian",
      "D.",
      ""
    ],
    [
      "Pineda",
      "J. E.",
      ""
    ],
    [
      "Wyrowski",
      "F.",
      ""
    ],
    [
      "Belloche",
      "A.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 11:57:02 GMT"
    }
  ],
  "updateDate": "2025-02-05",
  "timestamp": 1734523022000,
  "abstract": "  Pre-stellar cores are the first steps in the process of star and planet\nformation. However, the dynamical and chemical evolution of pre-stellar cores\nis still not well understood. We aim at estimating the central density of the\npre-stellar core IRAS16293E and at carrying out an inventory of molecular\nspecies towards the density peak of the core. We observed high-$J$ rotational\ntransitions of N$_2$H$^+$ and N$_2$D$^+$, and several other molecular lines\ntowards the dust emission peak using the Atacama Pathfinder EXperiment (APEX)\ntelescope, and derived the density and temperature profiles of the core using\nfar-infrared surface brightness maps from $Herschel$. The N$_2$H$^+$ and\nN$_2$D$^+$ lines were analysed by non-LTE radiative transfer modelling. Our\nbest-fit core model consists in a static inner region, embedded in an infalling\nenvelope with an inner radius of approximately 3000 au (21\" at 141 pc). The\nobserved high-J lines of N$_2$H$^+$ and N$_2$D$^+$ (with critical densities\ngreater than 10$^6$ cm$^{-3}$) turn out to be very sensitive to depletion; the\npresent single-dish observations are best explained with no depletion of\nN$_2$H$^+$ and N$_2$D$^+$ in the inner core. The N$_2$D$^+$/N$_2$H$^+$ ratio\nthat best reproduces our observations is 0.44, one of the largest observed to\ndate in pre-stellar cores. Additionally, half of the molecules that we observed\nare deuterated isotopologues, confirming the high-level of deuteration towards\nthis source. Non-LTE radiative transfer modelling of N$_2$H$^+$ and N$_2$D$^+$\nlines proved to be an excellent diagnostic of the chemical structure and\ndynamics of a pre-stellar core. Probing the physical conditions immediately\nbefore the protostellar collapse is a necessary reference for theoretical\nstudies and simulations with the aim of understanding the earliest stages of\nstar and planet formation and the time scale of this process.\n",
  "subjects": [
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "CWlZgTv9bqmLx8ED8vZ05hRrmGQ3bsnrj0rHZOGD5pY",
  "pdfSize": "2348159"
}