{"id":"2412.16809","title":"GeoTexDensifier: Geometry-Texture-Aware Densification for High-Quality\n  Photorealistic 3D Gaussian Splatting","authors":"Hanqing Jiang, Xiaojun Xiang, Han Sun, Hongjie Li, Liyang Zhou, Xiaoyu\n  Zhang, Guofeng Zhang","authorsParsed":[["Jiang","Hanqing",""],["Xiang","Xiaojun",""],["Sun","Han",""],["Li","Hongjie",""],["Zhou","Liyang",""],["Zhang","Xiaoyu",""],["Zhang","Guofeng",""]],"versions":[{"version":"v1","created":"Sun, 22 Dec 2024 00:25:53 GMT"}],"updateDate":"2024-12-24","timestamp":1734827153000,"abstract":"  3D Gaussian Splatting (3DGS) has recently attracted wide attentions in\nvarious areas such as 3D navigation, Virtual Reality (VR) and 3D simulation,\ndue to its photorealistic and efficient rendering performance. High-quality\nreconstrution of 3DGS relies on sufficient splats and a reasonable distribution\nof these splats to fit real geometric surface and texture details, which turns\nout to be a challenging problem. We present GeoTexDensifier, a novel\ngeometry-texture-aware densification strategy to reconstruct high-quality\nGaussian splats which better comply with the geometric structure and texture\nrichness of the scene. Specifically, our GeoTexDensifier framework carries out\nan auxiliary texture-aware densification method to produce a denser\ndistribution of splats in fully textured areas, while keeping sparsity in\nlow-texture regions to maintain the quality of Gaussian point cloud. Meanwhile,\na geometry-aware splitting strategy takes depth and normal priors to guide the\nsplitting sampling and filter out the noisy splats whose initial positions are\nfar from the actual geometric surfaces they aim to fit, under a Validation of\nDepth Ratio Change checking. With the help of relative monocular depth prior,\nsuch geometry-aware validation can effectively reduce the influence of\nscattered Gaussians to the final rendering quality, especially in regions with\nweak textures or without sufficient training views. The texture-aware\ndensification and geometry-aware splitting strategies are fully combined to\nobtain a set of high-quality Gaussian splats. We experiment our GeoTexDensifier\nframework on various datasets and compare our Novel View Synthesis results to\nother state-of-the-art 3DGS approaches, with detailed quantitative and\nqualitative evaluations to demonstrate the effectiveness of our method in\nproducing more photorealistic 3DGS models.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"8OM8fjJ8fKxTql4yZW6340acWKWaF8g3XfypFw3XG8o","pdfSize":"9423490"}