{
  "id": "2412.13701",
  "title": "Testing local position invariance with odd multipoles of galaxy\n  clustering statistics",
  "authors": "Takuya Inoue, Teppei Okumura, Shohei Saga, Atsushi Taruya",
  "authorsParsed": [
    [
      "Inoue",
      "Takuya",
      ""
    ],
    [
      "Okumura",
      "Teppei",
      ""
    ],
    [
      "Saga",
      "Shohei",
      ""
    ],
    [
      "Taruya",
      "Atsushi",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 10:44:19 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734518659000,
  "abstract": "  We investigate cosmological constraints on local position invariance (LPI), a\nkey aspect of the Einstein equivalence principle (EEP), through asymmetric\ngalaxy clustering. The LPI asserts that the outcomes of the non-gravitational\nexperiments are identical regardless of location in spacetime and has been\ntested through measurements of the gravitational redshift effect. Therefore,\nmeasuring the gravitational redshift effect encoded in galaxy clustering\nprovides a powerful and novel cosmological probe of the LPI. Recent work by\nSaga et al. proposed its validation using the cross-correlation function\nbetween distinct galaxy samples, but their analysis focused solely on the\ndipole moment. In this paper, we extend their work by further analyzing a\nhigher-order odd multipole moment, the octupole moment, in the constraints on\nthe LPI-violating parameter, $\\alpha$, expected from galaxy surveys such as\nDark Energy Spectroscopic Instrument, Euclid space telescope, Subaru Prime\nFocus Spectrograph, and Square Kilometre Array. We demonstrate that combining\nthe octupole and dipole moments significantly improves the constraints,\nparticularly when the analysis is restricted to larger scales, characterized by\na large minimum separation $s_{\\rm min}$. For a conservative setup with $s_{\\rm\nmin}=15 {\\rm Mpc}/h$, we find an average improvement of 11$\\%$ compared to\nusing the dipole moment alone. Our results highlight the importance of\nhigher-order multipoles in constraining $\\alpha$, providing a more robust\napproach to testing the EEP on cosmological scales.\n",
  "subjects": [
    "Astrophysics/Cosmology and Nongalactic Astrophysics",
    "Physics/General Relativity and Quantum Cosmology"
  ],
  "license": "http://creativecommons.org/publicdomain/zero/1.0/",
  "blobId": "k3tb92Lpx_VCLk1UBjzfhI3ospFEuaPOB0TG-QTM1tc",
  "pdfSize": "840041"
}