{
  "id": "2412.04273",
  "title": "Reinforcement Learning from Wild Animal Videos",
  "authors": "Elliot Chane-Sane, Constant Roux, Olivier Stasse, Nicolas Mansard",
  "authorsParsed": [
    [
      "Chane-Sane",
      "Elliot",
      ""
    ],
    [
      "Roux",
      "Constant",
      ""
    ],
    [
      "Stasse",
      "Olivier",
      ""
    ],
    [
      "Mansard",
      "Nicolas",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 15:55:23 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733414123000,
  "abstract": "  We propose to learn legged robot locomotion skills by watching thousands of\nwild animal videos from the internet, such as those featured in nature\ndocumentaries. Indeed, such videos offer a rich and diverse collection of\nplausible motion examples, which could inform how robots should move. To\nachieve this, we introduce Reinforcement Learning from Wild Animal Videos\n(RLWAV), a method to ground these motions into physical robots. We first train\na video classifier on a large-scale animal video dataset to recognize actions\nfrom RGB clips of animals in their natural habitats. We then train a\nmulti-skill policy to control a robot in a physics simulator, using the\nclassification score of a third-person camera capturing videos of the robot's\nmovements as a reward for reinforcement learning. Finally, we directly transfer\nthe learned policy to a real quadruped Solo. Remarkably, despite the extreme\ngap in both domain and embodiment between animals in the wild and robots, our\napproach enables the policy to learn diverse skills such as walking, jumping,\nand keeping still, without relying on reference trajectories nor skill-specific\nrewards.\n",
  "subjects": [
    "Computer Science/Robotics",
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "qUlqpiV6PLsKVYqr5wjk_ZS1DlCHyVRNxeXCRvUzBC8",
  "pdfSize": "9237102"
}