{"id":"2412.10453","title":"Analysis of Object Detection Models for Tiny Object in Satellite\n  Imagery: A Dataset-Centric Approach","authors":"Kailas PS, Selvakumaran R, Palani Murugan, Ramesh Kumar V, Malaya\n  Kumar Biswal M","authorsParsed":[["PS","Kailas",""],["R","Selvakumaran",""],["Murugan","Palani",""],["Kumar","Ramesh","V"],["M","Malaya Kumar Biswal",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 07:06:22 GMT"}],"updateDate":"2024-12-17","timestamp":1733987182000,"abstract":"  In recent years, significant advancements have been made in deep\nlearning-based object detection algorithms, revolutionizing basic computer\nvision tasks, notably in object detection, tracking, and segmentation. This\npaper delves into the intricate domain of Small-Object-Detection (SOD) within\nsatellite imagery, highlighting the unique challenges stemming from wide\nimaging ranges, object distribution, and their varying appearances in\nbird's-eye-view satellite images. Traditional object detection models face\ndifficulties in detecting small objects due to limited contextual information\nand class imbalances. To address this, our research presents a meticulously\ncurated dataset comprising 3000 images showcasing cars, ships, and airplanes in\nsatellite imagery. Our study aims to provide valuable insights into small\nobject detection in satellite imagery by empirically evaluating\nstate-of-the-art models. Furthermore, we tackle the challenges of satellite\nvideo-based object tracking, employing the Byte Track algorithm on the SAT-MTB\ndataset. Through rigorous experimentation, we aim to offer a comprehensive\nunderstanding of the efficacy of state-of-the-art models in\nSmall-Object-Detection for satellite applications. Our findings shed light on\nthe effectiveness of these models and pave the way for future advancements in\nsatellite imagery analysis.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"RwBs0A8OszHScD4knaB99JQNpagb0SbckCR3ZnPl35s","pdfSize":"420694"}