{"id":"2412.17336","title":"APEX$^2$: Adaptive and Extreme Summarization for Personalized Knowledge\n  Graphs","authors":"Zihao Li, Dongqi Fu, Mengting Ai, Jingrui He","authorsParsed":[["Li","Zihao",""],["Fu","Dongqi",""],["Ai","Mengting",""],["He","Jingrui",""]],"versions":[{"version":"v1","created":"Mon, 23 Dec 2024 07:02:06 GMT"}],"updateDate":"2024-12-24","timestamp":1734937326000,"abstract":"  Knowledge graphs (KGs), which store an extensive number of relational facts,\nserve various applications. Recently, personalized knowledge graphs (PKGs) have\nemerged as a solution to optimize storage costs by customizing their content to\nalign with users' specific interests within particular domains. In the real\nworld, on one hand, user queries and their underlying interests are inherently\nevolving, requiring PKGs to adapt continuously; on the other hand, the\nsummarization is constantly expected to be as small as possible in terms of\nstorage cost. However, the existing PKG summarization methods implicitly assume\nthat the user's interests are constant and do not shift. Furthermore, when the\nsize constraint of PKG is extremely small, the existing methods cannot\ndistinguish which facts are more of immediate interest and guarantee the\nutility of the summarized PKG. To address these limitations, we propose\nAPEX$^2$, a highly scalable PKG summarization framework designed with robust\ntheoretical guarantees to excel in adaptive summarization tasks with extremely\nsmall size constraints. To be specific, after constructing an initial PKG,\nAPEX$^2$ continuously tracks the interest shift and adjusts the previous\nsummary. We evaluate APEX$^2$ under an evolving query setting on benchmark KGs\ncontaining up to 12 million triples, summarizing with compression ratios $\\leq\n0.1\\%$. The experiments show that APEX outperforms state-of-the-art baselines\nin terms of both query-answering accuracy and efficiency.\n","subjects":["Computer Science/Machine Learning","Computer Science/Artificial Intelligence","Computer Science/Databases","Computer Science/Symbolic Computation"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"9x6B56m_GcVwD7hmuIstN58PA0Y4VrxRuNrdGlu_B3c","pdfSize":"6515674"}