{"id":"2412.20837","title":"High-pressure growth effects on the superconducting properties of\n  Sm-based oxypnictide superconductors","authors":"Mohammad Azam, Manasa Manasa, Tatiana Zajarniuk, Ryszard Diduszko,\n  Taras Palasyuk, Tomasz Cetner, Andrzej Morawski, Cezariusz Jastrz\\k{e}bski,\n  Andrzej Szewczyk, Micha{\\l} Wierzbicki, Shiv J. Singh","authorsParsed":[["Azam","Mohammad",""],["Manasa","Manasa",""],["Zajarniuk","Tatiana",""],["Diduszko","Ryszard",""],["Palasyuk","Taras",""],["Cetner","Tomasz",""],["Morawski","Andrzej",""],["Jastrzębski","Cezariusz",""],["Szewczyk","Andrzej",""],["Wierzbicki","Michał",""],["Singh","Shiv J.",""]],"versions":[{"version":"v1","created":"Mon, 30 Dec 2024 10:04:35 GMT"}],"updateDate":"2025-02-03","timestamp":1735553075000,"abstract":"  High-pressure synthesis can be an effective method for improving the sample\nquality of materials as well as their superconducting properties. In this\npaper, the synthesis process of F- doped SmFeAsO has been optimized by\npreparing a series of bulk SmFeAsO0.8F0.2 (Sm1111) using the high gas pressure\nand high-temperature synthesis (HP-HTS) method, considering various growth\nparameters like growth pressures (0-1 GPa) and heating time (0.5-2 h).\nStructural, microstructural, Raman spectroscopic, transport, and magnetic\nmeasurements are employed to comprehensively analyze these bulks and derive the\nconclusive findings. The parent SmFeAsO0.8F0.2 prepared by the conventional\nsynthesis process at ambient pressure (CSP) has a transition temperature (Tc)\nof around 53-54 K, and the critical current density (Jc) of 103 A/cm2 at 5 K\nwith a small amount of the impurity phases (SmOF and SmAs), consistent with\nprevious reports. Interestingly, all bulks synthesized by HP-HTS have almost\nthe same Tc and Jc as the parent sample. The optimal growth conditions are\nobtained as 900C, 1 hour, and 0.5 GPa with the sealed Ta-tube, which slightly\nimproved the sample quality and the superconducting properties compared to\nother bulks grown by HP-HTS. Our study confirms that the existence of the\nimpurity phases in the 1111 family is very robust and cannot be reduced by\nHP-HTS, leading to only a small variation in the observed superconducting\nproperties of Sm1111 whether prepared by CSP or HP-HTS. This is the first\ncomprehensive investigation of the high-pressure development of Sm1111, which\nshows distinct behaviour from other families of iron-based superconductors.\n","subjects":["Condensed Matter/Superconductivity","Condensed Matter/Strongly Correlated Electrons","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"UgGcFbJfz5jeI3MQIbsEoel_mG3JpNrK12ojwKJKB9s","pdfSize":"15423924"}