{"id":"2412.13405","title":"What Human-Horse Interactions may Teach us About Effective Human-AI\n  Interactions","authors":"Mohammad Hossein Jarrahi and Stanley Ahalt","authorsParsed":[["Jarrahi","Mohammad Hossein",""],["Ahalt","Stanley",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 00:39:16 GMT"}],"updateDate":"2024-12-19","timestamp":1734482356000,"abstract":"  This article explores human-horse interactions as a metaphor for\nunderstanding and designing effective human-AI partnerships. Drawing on the\nlong history of human collaboration with horses, we propose that AI, like\nhorses, should complement rather than replace human capabilities. We move\nbeyond traditional benchmarks such as the Turing test, which emphasize AI's\nability to mimic human intelligence, and instead advocate for a symbiotic\nrelationship where distinct intelligences enhance each other. We analyze key\nelements of human-horse relationships: trust, communication, and mutual\nadaptability, to highlight essential principles for human-AI collaboration.\nTrust is critical in both partnerships, built through predictability and shared\nunderstanding, while communication and feedback loops foster mutual\nadaptability. We further discuss the importance of taming and habituation in\nshaping these interactions, likening it to how humans train AI to perform\nreliably and ethically in real-world settings. The article also addresses the\nasymmetry of responsibility, where humans ultimately bear the greater burden of\noversight and ethical judgment. Finally, we emphasize that long-term commitment\nand continuous learning are vital in both human-horse and human-AI\nrelationships, as ongoing interaction refines the partnership and increases\nmutual adaptability. By drawing on these insights from human-horse\ninteractions, we offer a vision for designing AI systems that are trustworthy,\nadaptable, and capable of fostering symbiotic human-AI partnerships.\n","subjects":["Computer Science/Human-Computer Interaction","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"hs7Q56oko0ZslH1JBvib8DfhgLHIXnUTH1on5FAj_-A","pdfSize":"250374"}