{
  "id": "2412.13882",
  "title": "Nanogap-Engineered Core-Shell-Like Nanostructures for Comprehensive SERS\n  Analysis",
  "authors": "Mihai C. Suster, Aleksandra Szyma\\'nska, Tomasz J. Antosiewicz, Agata\n  Kr\\'olikowska and Piotr Wr\\'obel",
  "authorsParsed": [
    [
      "Suster",
      "Mihai C.",
      ""
    ],
    [
      "Szymańska",
      "Aleksandra",
      ""
    ],
    [
      "Antosiewicz",
      "Tomasz J.",
      ""
    ],
    [
      "Królikowska",
      "Agata",
      ""
    ],
    [
      "Wróbel",
      "Piotr",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 14:22:09 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734531729000,
  "abstract": "  Development of fabrication protocols for large-area plasmonic nanostructures\nwith sub-10 nm gaps with a spatially controlled distribution is critical for\ntheir real-world applications. In this work, we develop a simple,\ncleanroom-free protocol for the fabrication of macroscopic-sized plasmonic\nsubstrates (>6 cm^2), featuring a tunable multi-resonance optical response and\nlight concentration in sub-10 nm gaps. Critically, these gaps are free to\ninteract with the surrounding medium. This architecture consists of\nnon-periodically distributed dielectric nanospheres coated with a metal\nmultilayer, forming semi-spherical core-shell-like nanostructures (CSLNs)\nsurrounded by a planar film. The sub-10 nm gaps formed between metal caps and\nthe planar film are easily tuned by adjusting fabrication parameters such as\nmultimetal layer thickness, composition, or nanosphere size and density. The\nexcellent structural homogeneity, wide optical tunability, and extreme light\nconfinement in the spatially controlled subwavelength nanogaps make CSLN-based\nsubstrates an ideal platform for comprehensive surface-enhanced Raman\nscattering (SERS) spectroscopy. This is proven through a combination of\nnumerical modeling and iterative fabrication/characterization, leading to the\noptimized substrates showing cutting-edge spatial uniformity down to 1.9%\ndetermined as the relative standard deviation (RSD) of the SERS signal of\np-mercaptobenzoic acid for 225 spectra over 3600 {\\mu}m^2 area. High\nsensitivity is evidenced by an enhancement factor of ~10^6. The proposed\nsubstrates also meet all other demanding criteria, including sufficient signal\ntemporal stability (RSD <4%), high substrate-to-substrate reproducibility\n(<15%), and SERS activity towards three various analytes. The unique geometry\nand wide spectral tunability of the CSLN substrates will also be of great value\nfor other plasmon-driven applications.\n",
  "subjects": [
    "Physics/Optics",
    "Physics/Chemical Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "mr6Zp9lVoqquKL_AazS1agUaANxSEsqv4cao_QCa3ao",
  "pdfSize": "3837145"
}