{
  "id": "2412.12978",
  "title": "How much earlier would LSST have discovered currently known long-period\n  comets?",
  "authors": "Laura Inno, Margherita Scuderi, Ivano Bertini, Marco Fulle, Elena\n  Mazzotta Epifani, Vincenzo Della Corte, Alice Maria Piccirillo, Antonio\n  Vanzanella, Pedro Lacerda, Chiara Grappasonni, Eleonora Ammanito, Giuseppe\n  Sindoni, and Alessandra Rotundi",
  "authorsParsed": [
    [
      "Inno",
      "Laura",
      ""
    ],
    [
      "Scuderi",
      "Margherita",
      ""
    ],
    [
      "Bertini",
      "Ivano",
      ""
    ],
    [
      "Fulle",
      "Marco",
      ""
    ],
    [
      "Epifani",
      "Elena Mazzotta",
      ""
    ],
    [
      "Della Corte",
      "Vincenzo",
      ""
    ],
    [
      "Piccirillo",
      "Alice Maria",
      ""
    ],
    [
      "Vanzanella",
      "Antonio",
      ""
    ],
    [
      "Lacerda",
      "Pedro",
      ""
    ],
    [
      "Grappasonni",
      "Chiara",
      ""
    ],
    [
      "Ammanito",
      "Eleonora",
      ""
    ],
    [
      "Sindoni",
      "Giuseppe",
      ""
    ],
    [
      "Rotundi",
      "Alessandra",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 14:58:14 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734447494000,
  "abstract": "  Among solar system objects, comets coming from the Oort Cloud are an elusive\npopulation, intrinsically rare and difficult to detect. Nonetheless, as the\nmore pristine objects we can observe, they encapsulate critical cues on the\nformation of planetary systems and are the focus of many scientific\ninvestigations and science missions. The Legacy Survey of Space and Time\n(LSST), which will start to operate from the Vera C. Rubin Observatory in 2025,\nis expected to dramatically improve our detection ability of these comets by\nperforming regular monitoring of the Southern sky deep down to magnitude 24.5\nwith excellent astrometry. However, making straightforward predictions on\nfuture LSST detection rates is challenging due to our biased knowledge of the\nunderlying population. This is because identifications to date have been\nconducted by various surveys or individual observers, often without detailed\ninformation on their respective selection functions. Recent efforts to predict\nincoming flux of Long Period Comets still suffer of the lack of systematic,\nwell-characterized, homogeneous cometary surveys. Here, we adopt a different\npoint of view by asking how much earlier~on known comets on long-period or\nhyperbolic orbits would have been discovered by a LSST-like survey if it was\nalready in place 10 years prior to their perihelion epoch. In this case, we are\nnot simulating a real flux of incoming comet, as all comets in our sample reach\nthe perihelion simultaneously, but we can analyze the impact of a LSST-like\nsurvey on individual objects. We find that LSST would have found about 40% of\ncomets in our sample at least 5 years prior to their perihelion epoch, and at\ndouble (at least) the distance at which they were actually discovered. Based on\nthis approach, we find that LSST has the potentiality to at least twofold the\ncurrent discovery rate of long-period and hyperbolic comets.\n",
  "subjects": [
    "Astrophysics/Earth and Planetary Astrophysics",
    "Astrophysics/Instrumentation and Methods for Astrophysics",
    "Astrophysics/Solar and Stellar Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "GetyljuZheLbhqVGunsVuxJLRAKjQS7ZSsYw5dVg2jo",
  "pdfSize": "864126"
}