{"id":"2412.05566","title":"Dif4FF: Leveraging Multimodal Diffusion Models and Graph Neural Networks\n  for Accurate New Fashion Product Performance Forecasting","authors":"Andrea Avogaro, Luigi Capogrosso, Franco Fummi, Marco Cristani","authorsParsed":[["Avogaro","Andrea",""],["Capogrosso","Luigi",""],["Fummi","Franco",""],["Cristani","Marco",""]],"versions":[{"version":"v1","created":"Sat, 7 Dec 2024 07:03:59 GMT"}],"updateDate":"2024-12-10","timestamp":1733555039000,"abstract":"  In the fast-fashion industry, overproduction and unsold inventory create\nsignificant environmental problems. Precise sales forecasts for unreleased\nitems could drastically improve the efficiency and profits of industries.\nHowever, predicting the success of entirely new styles is difficult due to the\nabsence of past data and ever-changing trends. Specifically, currently used\ndeterministic models struggle with domain shifts when encountering items\noutside their training data. The recently proposed diffusion models address\nthis issue using a continuous-time diffusion process. Specifically, these\nmodels enable us to predict the sales of new items, mitigating the domain shift\nchallenges encountered by deterministic models. As a result, this paper\nproposes Dif4FF, a novel two-stage pipeline for New Fashion Product Performance\nForecasting (NFPPF) that leverages the power of diffusion models conditioned on\nmultimodal data related to specific clothes. Dif4FF first utilizes a multimodal\nscore-based diffusion model to forecast multiple sales trajectories for various\ngarments over time. The forecasts are refined using a powerful Graph\nConvolutional Network (GCN) architecture. By leveraging the GCN's capability to\ncapture long-range dependencies within both the temporal and spatial data and\nseeking the optimal solution between these two dimensions, Dif4FF offers the\nmost accurate and efficient forecasting system available in the literature for\npredicting the sales of new items. We tested Dif4FF on VISUELLE, the de facto\nstandard for NFPPF, achieving new state-of-the-art results.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0LeM7QmlBgZnSDK1pJo-FIvaYSNDVsO7g_U2xwL52WM","pdfSize":"1362136"}