{
  "id": "2412.17013",
  "title": "Electrical Manipulation of Spin Splitting Torque in Altermagnetic RuO2",
  "authors": "Yichi Zhang, Hua Bai, Lei Han, Jiankun Dai, Chong Chen, Shixuan Liang,\n  Yanzhang Cao, Yingying Zhang, Qian Wang, Wenxuan Zhu, Feng Pan, Cheng Song",
  "authorsParsed": [
    [
      "Zhang",
      "Yichi",
      ""
    ],
    [
      "Bai",
      "Hua",
      ""
    ],
    [
      "Han",
      "Lei",
      ""
    ],
    [
      "Dai",
      "Jiankun",
      ""
    ],
    [
      "Chen",
      "Chong",
      ""
    ],
    [
      "Liang",
      "Shixuan",
      ""
    ],
    [
      "Cao",
      "Yanzhang",
      ""
    ],
    [
      "Zhang",
      "Yingying",
      ""
    ],
    [
      "Wang",
      "Qian",
      ""
    ],
    [
      "Zhu",
      "Wenxuan",
      ""
    ],
    [
      "Pan",
      "Feng",
      ""
    ],
    [
      "Song",
      "Cheng",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 22 Dec 2024 13:26:56 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734874016000,
  "abstract": "  Due to nonrelativistic altermagnetic spin splitting effect (ASSE),\naltermagnets can generate time-reversal-odd spin current and spin splitting\ntorque (SST) with spin polarization parallel to the N\\'eel vector. Hence the\neffective manipulation of SST would provide plenty of opportunities for\ndesignable spintronic devices, which remains elusive. Here, the electrical\ncontrol of SST is achieved in altermagnetic RuO2, based on controllable N\\'eel\nvector of RuO2 and N\\'eel vector-dependent generation of SST. We demonstrate\nthe current-induced switching of N\\'eel vector via spin-orbit torque in RuO2\nfilms, according to the reversible polarity of electrical transport\nmeasurements and X-ray magnetic linear dichroism (XMLD). The XMLD also\nunprecedentedly demonstrates that N\\'eel vector really exists in altermagnets.\nThe switching of N\\'eel vector to the current direction and resultantly\nenhanced spin polarization parallel to the N\\'eel vector brings about stronger\nASSE-induced spin current. Our findings not only enrich the properties of\naltermagnets but also pave the way for high speed memories and nano-oscillators\nwith excellent controllability and efficiency.\n",
  "subjects": [
    "Condensed Matter/Materials Science"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "pH7FrY6_BzGjBohlp5XnFh1HEgS-wCSEWdmbHc7E6-A",
  "pdfSize": "709621"
}