{"id":"2412.16468","title":"The Road to Artificial SuperIntelligence: A Comprehensive Survey of\n  Superalignment","authors":"HyunJin Kim, Xiaoyuan Yi, Jing Yao, Jianxun Lian, Muhua Huang, Shitong\n  Duan, JinYeong Bak, Xing Xie","authorsParsed":[["Kim","HyunJin",""],["Yi","Xiaoyuan",""],["Yao","Jing",""],["Lian","Jianxun",""],["Huang","Muhua",""],["Duan","Shitong",""],["Bak","JinYeong",""],["Xie","Xing",""]],"versions":[{"version":"v1","created":"Sat, 21 Dec 2024 03:51:04 GMT"},{"version":"v2","created":"Tue, 24 Dec 2024 05:54:15 GMT"},{"version":"v3","created":"Wed, 25 Dec 2024 07:10:21 GMT"}],"updateDate":"2024-12-30","timestamp":1734753064000,"abstract":"  The emergence of large language models (LLMs) has sparked the possibility of\nabout Artificial Superintelligence (ASI), a hypothetical AI system surpassing\nhuman intelligence. However, existing alignment paradigms struggle to guide\nsuch advanced AI systems. Superalignment, the alignment of AI systems with\nhuman values and safety requirements at superhuman levels of capability aims to\naddresses two primary goals -- scalability in supervision to provide\nhigh-quality guidance signals and robust governance to ensure alignment with\nhuman values. In this survey, we examine scalable oversight methods and\npotential solutions for superalignment. Specifically, we explore the concept of\nASI, the challenges it poses, and the limitations of current alignment\nparadigms in addressing the superalignment problem. Then we review scalable\noversight methods for superalignment. Finally, we discuss the key challenges\nand propose pathways for the safe and continual improvement of ASI systems. By\ncomprehensively reviewing the current literature, our goal is provide a\nsystematical introduction of existing methods, analyze their strengths and\nlimitations, and discuss potential future directions.\n","subjects":["Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"UlLo2FYTADbf3GeluEFGqlCAy20Mav-WN-rGV9At3sE","pdfSize":"1711508"}