{
  "id": "2412.16107",
  "title": "Allocation for Omnidirectional Aerial Robots: Incorporating Power\n  Dynamics",
  "authors": "Eugenio Cuniato, Mike Allenspach, Thomas Stastny, Helen Oleynikova,\n  Roland Siegwart, Michael Pantic",
  "authorsParsed": [
    [
      "Cuniato",
      "Eugenio",
      ""
    ],
    [
      "Allenspach",
      "Mike",
      ""
    ],
    [
      "Stastny",
      "Thomas",
      ""
    ],
    [
      "Oleynikova",
      "Helen",
      ""
    ],
    [
      "Siegwart",
      "Roland",
      ""
    ],
    [
      "Pantic",
      "Michael",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 17:48:56 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734716936000,
  "abstract": "  Tilt-rotor aerial robots are more dynamic and versatile than their\nfixed-rotor counterparts, since the thrust vector and body orientation are\ndecoupled. However, the coordination of servomotors and propellers (the\nallocation problem) is not trivial, especially accounting for overactuation and\nactuator dynamics. We present and compare different methods of actuator\nallocation for tilt-rotor platforms, evaluating them on a real aerial robot\nperforming dynamic trajectories. We extend the state-of-the-art geometric\nallocation into a differential allocation, which uses the platform's redundancy\nand does not suffer from singularities typical of the geometric solution. We\nexpand it by incorporating actuator dynamics and introducing propeller limit\ncurves. These improve the modeling of propeller limits, automatically balancing\ntheir usage and allowing the platform to selectively activate and deactivate\npropellers during flight. We show that actuator dynamics and limits make the\ntuning of the allocation not only easier, but also allow it to track more\ndynamic oscillating trajectories with angular velocities up to 4 rad/s,\ncompared to 2.8 rad/s of geometric methods.\n",
  "subjects": [
    "Computer Science/Robotics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "r_WMXRJ1eIm985GwJcNMGodCA5AM05Rq1j2n-4-NqfE",
  "pdfSize": "11103631"
}