{
  "id": "2412.13019",
  "title": "The Temporal Vadalog System: Temporal Datalog-based Reasoning",
  "authors": "Luigi Bellomarini, Livia Blasi, Markus Nissl, Emanuel Sallinger",
  "authorsParsed": [
    [
      "Bellomarini",
      "Luigi",
      ""
    ],
    [
      "Blasi",
      "Livia",
      ""
    ],
    [
      "Nissl",
      "Markus",
      ""
    ],
    [
      "Sallinger",
      "Emanuel",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 15:39:33 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734449973000,
  "abstract": "  In the wake of the recent resurgence of the Datalog language of databases,\ntogether with its extensions for ontological reasoning settings, this work aims\nto bridge the gap between the theoretical studies of DatalogMTL (Datalog\nextended with metric temporal logic) and the development of production-ready\nreasoning systems. In particular, we lay out the functional and architectural\ndesiderata of a modern reasoner and propose our system, Temporal Vadalog.\nLeveraging the vast amount of experience from the database community, we go\nbeyond the typical chase-based implementations of reasoners, and propose a set\nof novel techniques and a system that adopts a modern data pipeline\narchitecture. We discuss crucial architectural choices, such as how to\nguarantee termination when infinitely many time intervals are possibly\ngenerated, how to merge intervals, and how to sustain a limited memory\nfootprint. We discuss advanced features of the system, such as the support for\ntime series, and present an extensive experimental evaluation. This paper is a\nsubstantially extended version of \"The Temporal Vadalog System\" as presented at\nRuleML+RR '22. Under consideration in Theory and Practice of Logic Programming\n(TPLP).\n",
  "subjects": [
    "Computer Science/Databases"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "zG6t41nW0M_vy5XB0SDmR3rolds7S2msJgikxAKOTK4",
  "pdfSize": "1554010"
}