{
  "id": "2412.03420",
  "title": "Automated Test-Case Generation for REST APIs Using Model Inference\n  Search Heuristic",
  "authors": "Clinton Cao and Annibale Panichella and Sicco Verwer",
  "authorsParsed": [
    [
      "Cao",
      "Clinton",
      ""
    ],
    [
      "Panichella",
      "Annibale",
      ""
    ],
    [
      "Verwer",
      "Sicco",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 16:00:14 GMT"
    },
    {
      "version": "v2",
      "created": "Thu, 30 Jan 2025 12:35:06 GMT"
    }
  ],
  "updateDate": "2025-01-31",
  "timestamp": 1733328014000,
  "abstract": "  The rising popularity of the microservice architectural style has led to a\ngrowing demand for automated testing approaches tailored to these systems.\nEvoMaster is a state-of-the-art tool that uses Evolutionary Algorithms (EAs) to\nautomatically generate test cases for microservices' REST APIs. One limitation\nof these EAs is the use of unit-level search heuristics, such as branch\ndistances, which focus on fine-grained code coverage and may not effectively\ncapture the complex, interconnected behaviors characteristic of system-level\ntesting. To address this limitation, we propose a new search heuristic (MISH)\nthat uses real-time automaton learning to guide the test case generation\nprocess. We capture the sequential call patterns exhibited by a test case by\nlearning an automaton from the stream of log events outputted by different\nmicroservices within the same system. Therefore, MISH learns a representation\nof the systemwide behavior, allowing us to define the fitness of a test case\nbased on the path it traverses within the inferred automaton. We empirically\nevaluate MISH's effectiveness on six real-world benchmark microservice\napplications and compare it against a state-of-the-art technique, MOSA, for\ntesting REST APIs. Our evaluation shows promising results for using MISH to\nguide the automated test case generation within EvoMaster.\n",
  "subjects": [
    "Computer Science/Software Engineering",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "skh-Qp-1nasDqCG4LKW440b-c8B1r0CeqiNrNK6T_y4",
  "pdfSize": "899578"
}