{
  "id": "2412.05752",
  "title": "Oscillatory properties of strange quark stars described by the vector\n  MIT bag model",
  "authors": "Luiz L. Lopes, Jose C. Jimenez, Luis B. Castro, Cesar V. Flores",
  "authorsParsed": [
    [
      "Lopes",
      "Luiz L.",
      ""
    ],
    [
      "Jimenez",
      "Jose C.",
      ""
    ],
    [
      "Castro",
      "Luis B.",
      ""
    ],
    [
      "Flores",
      "Cesar V.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 7 Dec 2024 21:42:58 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733607778000,
  "abstract": "  We investigated the radial and non-radial fundamental ($f$) mode oscillations\nof self-bound (quark) stars obtained after employing the Vector MIT (vMIT) bag\nmodel. Within this model, we computed the equation of state for strange quark\nmatter satisfying thermodynamic consistency. This allowed us to obtain the\ncorresponding behavior of the speed of sound, mass-radius relation, and\ngravitational redshift. In particular, our choice of $G_V$ = 0.30 fm$^2$\nproduces masses and radii in agreement with recent astronomical data (e.g. from\nNICER and HESS J1731). In fact, we tested that variations of the remaining vMIT\nparameters slightly modify this conclusion. Then, we proceeded to compute the\nradial oscillation frequencies of the $f$-mode, which is tightly connected to\nthe dynamical stability of these compact stars. We found that increments of the\n$G_V$ parameter have a stabilizing property around the maximal-mass stars for a\ngiven stellar family. We also calculated the gravitational-wave frequencies of\nthe non-radial $f$-mode. Our results show that they are restricted to be in the\nrange (1.6 - 1.8) kHz for high-mass stars and to (1.5 - 1.6) kHz for low-mass\nstars. Finally, we propose a universal relation between these frequencies and\nthe square root of the average density. All these last results are important in\ndistinguishing strange stars from ordinary neutron stars in future\ngravitational-wave detections coming from compact sources with activated\nnon-radial modes.\n",
  "subjects": [
    "Physics/High Energy Physics - Phenomenology"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "yoCz94U_bU1kWdvm_OpFg2kuDoSX3u9gOS7CWkGtCy8",
  "pdfSize": "247360"
}