{
  "id": "2412.19045",
  "title": "Fundamental Limits on Fiber-Based Electron Acceleration $-$ and How to\n  Overcome Them",
  "authors": "Aku Antikainen and Siddharth Ramachandran",
  "authorsParsed": [
    [
      "Antikainen",
      "Aku",
      ""
    ],
    [
      "Ramachandran",
      "Siddharth",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 26 Dec 2024 03:43:15 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735184595000,
  "abstract": "  To accelerate ultra-relativistic charged particles, such as electrons, using\nan electromagnetic pulse along a hollow-core waveguide, the pulse needs to have\na longitudinal electric field component and a phase velocity of $c$, the speed\nof light in vacuum. We derive an approximate closed-form expression for the\nwavelength at which the phase velocity of the TM$_{01}$ mode in a metal-clad\nhollow-core fiber with a dielectric layer is $c$. The expression is then used\nto derive conditions for material dispersion required of the dielectric in\norder to simultaneously have $c$ phase and group velocity. It is shown that the\ndispersion would need to be so heavily anomalous that the losses in the\nanomalously dispersive regime would render such a particle accelerator useless.\nWe then propose the utilization of gain in the form of two spectral peaks in\nthe dielectric to circumvent the otherwise fundamental limits and allow for\nTM$_{01}$ pulses with $c$ phase and group velocity and thus arbitrary\nlength-scaling of fiber-based electron accelerators. In theory, the group\nvelocity dispersion could also be made zero with further gain-assisted\ndispersion engineering, allowing for the co-propagation of dispersionless\nelectromagnetic pulses with relativistic particles.\n",
  "subjects": [
    "Physics/Accelerator Physics",
    "Physics/Optics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "i4n-eLpOI3xtGq6n12hM-U3Q7oHHcis9wX8oj6fMthY",
  "pdfSize": "1864370"
}