{"id":"2412.06360","title":"India's residential space cooling transition: Decarbonization ambitions\n  since the turn of millennium","authors":"Ran Yan, Nan Zhou, Minda Ma, Chao Mao","authorsParsed":[["Yan","Ran",""],["Zhou","Nan",""],["Ma","Minda",""],["Mao","Chao",""]],"versions":[{"version":"v1","created":"Mon, 9 Dec 2024 10:25:36 GMT"},{"version":"v2","created":"Mon, 16 Dec 2024 16:16:50 GMT"},{"version":"v3","created":"Sat, 8 Feb 2025 13:48:33 GMT"}],"updateDate":"2025-02-11","timestamp":1733739936000,"abstract":"  As an emerging emitter poised for significant growth in space cooling demand,\nIndia requires comprehensive insights into historical emission trends and\ndecarbonization performance to shape future low-carbon cooling strategies. By\nintegrating a bottom-up demand resource energy analysis model and a top-down\ndecomposition method, this study is the first to conduct a state-level analysis\nof carbon emission trends and the corresponding decarbonization efforts for\nresidential space cooling in urban and rural India from 2000 to 2022. The\nresults indicate that (1) the carbon intensity of residential space cooling in\nIndia increased by 292.4% from 2000 to 2022, reaching 513.8 kilograms of carbon\ndioxide per household. The net state domestic product per capita, representing\nincome, emerged as the primary positive contributor. (2) The increase in carbon\nemissions from space cooling can be primarily attributed to the use of fans.\nWhile fan-based space cooling has nearly saturated Indian urban households, it\nis anticipated to persist as the primary cooling method in rural households for\ndecades. (3) States with higher decarbonization potential are concentrated in\ntwo categories: those with high household income and substantial cooling\nappliance ownership and those with pronounced unmet cooling demand but low\nhousehold income and hot climates. Furthermore, it is believed that promoting\nenergy-efficient building designs can be prioritized to achieve affordable\nspace cooling. Overall, this study serves as an effective foundation for\nformulating and promoting India's future cooling action plan, addressing the\ncountry's rising residential cooling demands and striving toward its net-zero\ngoal by 2070.\n","subjects":["Economics/General Economics","Quantitative Finance/Economics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"kcZvpFM8psm0W6C2ABNiNgCMc4phj0ldKoBNxNyJ5_M","pdfSize":"2759568"}