{
  "id": "2412.04192",
  "title": "Traffic-cognitive Slicing for Resource-efficient Offloading with\n  Dual-distillation DRL in Multi-edge Systems",
  "authors": "Ting Xiaoyang, Minfeng Zhang, Saimin Chen Zhang",
  "authorsParsed": [
    [
      "Xiaoyang",
      "Ting",
      ""
    ],
    [
      "Zhang",
      "Minfeng",
      ""
    ],
    [
      "Zhang",
      "Saimin Chen",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 28 Nov 2024 01:51:36 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1732758696000,
  "abstract": "  In edge computing, emerging network slicing and computation offloading can\nsupport Edge Service Providers (ESPs) better handling diverse distributions of\nuser requests, to improve Quality-of-Service (QoS) and resource efficiency.\nHowever, fluctuating traffic and heterogeneous resources seriously hinder their\nbroader application in multi-edge systems. Existing solutions commonly rely on\nstatic configurations or prior knowledge, lacking adaptability to changeable\nmulti-edge environments and thus causing unsatisfying QoS and improper resource\nprovisioning. To address this important challenge, we propose SliceOff, a novel\nresource-efficient offloading framework with traffic-cognitive network slicing\nfor dynamic multi-edge systems. First, we design a new traffic prediction model\nbased on self-attention to capture traffic fluctuations among different edge\nregions. Next, an adaptive slicing strategy based on random rounding is devised\nto adjust the resource configuration according to the traffic and demands of\nedge regions. Finally, we develop an improved Deep Reinforcement Learning (DRL)\nmethod with a dual-distillation mechanism to address the complex offloading\nproblem, where twin critics networks and dual policy distillation are\nintegrated to improve the agents exploration and updating efficiency in huge\ndecision spaces. Notably, we carry out rigorous theoretical analysis to prove\nthe effectiveness of the proposed SliceOff. Using the real-world testbed and\ndatasets of user traffic, extensive experiments are conducted to verify the\nsuperiority of the proposed SliceOff. The results show that the SliceOff\nimproves resource inefficiency and ESP profits under dynamic multi-edge\nenvironments, which outperforms state-of-the-art methods on multiple metrics\nunder various scenarios.\n",
  "subjects": [
    "Computer Science/Networking and Internet Architecture"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "1b5u7hAkkIzUx5etAUJElRvYH8veWiF8xk4s9_gL8eE",
  "pdfSize": "411609"
}