{"id":"2412.02870","title":"A personalized model and optimization strategy for estimating blood\n  glucose concentrations from sweat measurements","authors":"Xiaoyu Yin, Elisabetta Peri, Eduard Pelssers, Jaap den Toonder, Lisa\n  Klous, Hein Daanen, Massimo Mischi","authorsParsed":[["Yin","Xiaoyu",""],["Peri","Elisabetta",""],["Pelssers","Eduard",""],["Toonder","Jaap den",""],["Klous","Lisa",""],["Daanen","Hein",""],["Mischi","Massimo",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 22:12:41 GMT"}],"updateDate":"2024-12-05","timestamp":1733263961000,"abstract":"  Background and objective: Diabetes is one of the four leading causes of death\nworldwide, necessitating daily blood glucose monitoring. While sweat offers a\npromising non-invasive alternative for glucose monitoring, its application\nremains limited due to the low to moderate correlation between sweat and blood\nglucose concentrations, which has been obtained until now by assuming a linear\nrelationship. This study proposes a novel model-based strategy to estimate\nblood glucose concentrations from sweat samples, setting the stage for\nnon-invasive glucose monitoring through sweat-sensing technology.\n  Methods: We first developed a pharmacokinetic glucose transport model that\ndescribes the glucose transport from blood to sweat. Secondly, we designed a\nnovel optimization strategy leveraging the proposed model to solve the inverse\nproblem and infer blood glucose levels from measured glucose concentrations in\nsweat. To this end, the pharmacokinetic model parameters with the highest\nsensitivity were also optimized so as to achieve a personalized estimation. Our\nstrategy was tested on a dataset composed of 108 samples from healthy\nvolunteers and diabetic patients.\n  Results: Our glucose transport model improves over the state-of-the-art in\nestimating sweat glucose concentrations from blood levels (higher accuracy,\np<0.001). Additionally, our optimization strategy effectively solved the\ninverse problem, yielding a Pearson correlation coefficient of 0.98 across all\n108 data points, with an average root-mean-square-percent-error of 12%+/-8%.\nThis significantly outperforms the best sweat-blood glucose correlation\nreported in the existing literature (0.75).\n  Conclusion: Our innovative optimization strategy, also leveraging more\naccurate modeling, shows promising results, paving the way for non-invasive\nblood glucose monitoring and, possibly, improved diabetes management.\n","subjects":["Quantitative Biology/Quantitative Methods"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"svqoTx17f0EnJDrcg4R7fU_fGNARlz53I1XNh9VkvBw","pdfSize":"3232574"}