{
  "id": "2412.15113",
  "title": "Associative memory inspires improvements for in-context learning using a\n  novel attention residual stream architecture",
  "authors": "Thomas F Burns, Tomoki Fukai, Christopher J Earls",
  "authorsParsed": [
    [
      "Burns",
      "Thomas F",
      ""
    ],
    [
      "Fukai",
      "Tomoki",
      ""
    ],
    [
      "Earls",
      "Christopher J",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 17:55:42 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734630942000,
  "abstract": "  Large language models (LLMs) demonstrate an impressive ability to utilise\ninformation within the context of their input sequences to appropriately\nrespond to data unseen by the LLM during its training procedure. This ability\nis known as in-context learning (ICL). Humans and non-human animals demonstrate\nsimilar abilities, however their neural architectures differ substantially from\nLLMs. Despite this, a critical component within LLMs, the attention mechanism,\nresembles modern associative memory models, widely used in and influenced by\nthe computational neuroscience community to model biological memory systems.\nUsing this connection, we introduce an associative memory model capable of\nperforming ICL. We use this as inspiration for a novel residual stream\narchitecture which allows information to directly flow between attention heads.\nWe test this architecture during training within a two-layer Transformer and\nshow its ICL abilities manifest more quickly than without this modification. We\nthen apply our architecture in small language models with 8 million parameters,\nfocusing on attention head values, with results also indicating improved ICL\nperformance at this larger and more naturalistic scale.\n",
  "subjects": [
    "Computer Science/Neural and Evolutionary Computing",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Computation and Language"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "2ayolyP9XEr3uHwkopXUYXQBnqwtHjZkJhYUKQMuvwk",
  "pdfSize": "1302281"
}