{"id":"2412.04670","title":"Lattice Lingo: Effect of Textual Detail on Multimodal Learning for\n  Property Prediction of Crystals","authors":"Mrigi Munjal, Jaewan Lee, Changyoung Park, Sehui Han","authorsParsed":[["Munjal","Mrigi",""],["Lee","Jaewan",""],["Park","Changyoung",""],["Han","Sehui",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 23:43:51 GMT"}],"updateDate":"2024-12-09","timestamp":1733442231000,"abstract":"  Most prediction models for crystal properties employ a unimodal perspective,\nwith graph-based representations, overlooking important non-local information\nthat affects crystal properties. Some recent studies explore the impact of\nintegrating graph and textual information on crystal property predictions to\nprovide the model with this \"missing\" information by concatenation of\nembeddings. However, such studies do not evaluate which type of textual\ninformation is actually beneficial. We concatenate graph representations with\ntext representations derived from textual descriptions with varying levels of\ndetail. These descriptions, generated using the Robocrystallographer package,\nencompass global (e.g., space group, crystal type), local (e.g., bond lengths,\ncoordination environment), and semiglobal (e.g., connectivity, arrangements)\ninformation about the structures. Our approach investigates how augmenting\ngraph-based information with various levels of textual detail influences the\nperformance for predictions for shear modulus and bulk modulus. We demonstrate\nthat while graph representations can capture local structural information,\nincorporating semiglobal textual information enhances model performance the\nmost. Global information can support performance further in the presence of\nsemiglobal information. Our findings suggest that the strategic inclusion of\ntextual information can enhance property prediction, thereby advancing the\ndesign and discovery of advanced novel materials for battery electrodes,\ncatalysts, etc.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"13NdJWVwA9ar8_85RbZQN-evYwY63EI7jttG9L0yIVc","pdfSize":"398749"}