{
  "id": "2412.12439",
  "title": "Droplet impact on elastic substrates: force scaling crossover",
  "authors": "Yuto Yokoyama, Hirokazu Maruoka, Yoshiyuki Tagawa",
  "authorsParsed": [
    [
      "Yokoyama",
      "Yuto",
      ""
    ],
    [
      "Maruoka",
      "Hirokazu",
      ""
    ],
    [
      "Tagawa",
      "Yoshiyuki",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 01:08:02 GMT"
    },
    {
      "version": "v2",
      "created": "Wed, 5 Feb 2025 01:40:00 GMT"
    }
  ],
  "updateDate": "2025-02-06",
  "timestamp": 1734397682000,
  "abstract": "  Droplet impacts are fundamental to fluid-structure interactions, shaping\nprocesses from erosion to bioprinting. While previous scaling laws have\nprovided insights into droplet dynamics, force scaling laws remain\ninsufficiently understood, particularly for soft substrates where both the\ndroplet and substrate deform significantly. Here, we show that droplet impacts\non elastic substrates exhibit a scaling crossover in maximum impact force,\ntransitioning from inertial force scaling, typical for rigid substrates under\nhigh inertia, to Hertzian impact scaling, characteristic of rigid spheres on\nelastic substrates. Using high-speed photoelastic tomography, we captured\nhigh-resolution dynamic stress fields and identified a similarity parameter\ngoverning the interplay between droplet inertia, substrate elasticity, and\ndeformation time scales. Our findings redefine how substrate properties\ninfluence impact forces, demonstrating that droplets under high inertia -- long\nthought to follow inertial force scaling -- can instead follow Hertzian impact\nscaling on soft substrates. This framework provides practical insights for\ndesigning soft, impact-resistant materials.\n",
  "subjects": [
    "Condensed Matter/Soft Condensed Matter",
    "Physics/Fluid Dynamics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "2kF0ut929p8XRp-YxgocUL0btUS3evb2V7lE7X7LYEE",
  "pdfSize": "5276437"
}