{
  "id": "2412.03941",
  "title": "Enhancing and Accelerating Diffusion-Based Inverse Problem Solving\n  through Measurements Optimization",
  "authors": "Tianyu Chen, Zhendong Wang, Mingyuan Zhou",
  "authorsParsed": [
    [
      "Chen",
      "Tianyu",
      ""
    ],
    [
      "Wang",
      "Zhendong",
      ""
    ],
    [
      "Zhou",
      "Mingyuan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 07:44:18 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733384658000,
  "abstract": "  Diffusion models have recently demonstrated notable success in solving\ninverse problems. However, current diffusion model-based solutions typically\nrequire a large number of function evaluations (NFEs) to generate high-quality\nimages conditioned on measurements, as they incorporate only limited\ninformation at each step. To accelerate the diffusion-based inverse\nproblem-solving process, we introduce \\textbf{M}easurements\n\\textbf{O}ptimization (MO), a more efficient plug-and-play module for\nintegrating measurement information at each step of the inverse problem-solving\nprocess. This method is comprehensively evaluated across eight diverse linear\nand nonlinear tasks on the FFHQ and ImageNet datasets. By using MO, we\nestablish state-of-the-art (SOTA) performance across multiple tasks, with key\nadvantages: (1) it operates with no more than 100 NFEs, with phase retrieval on\nImageNet being the sole exception; (2) it achieves SOTA or near-SOTA results\neven at low NFE counts; and (3) it can be seamlessly integrated into existing\ndiffusion model-based solutions for inverse problems, such as DPS\n\\cite{chung2022diffusion} and Red-diff \\cite{mardani2023variational}. For\nexample, DPS-MO attains a peak signal-to-noise ratio (PSNR) of 28.71 dB on the\nFFHQ 256 dataset for high dynamic range imaging, setting a new SOTA benchmark\nwith only 100 NFEs, whereas current methods require between 1000 and 4000 NFEs\nfor comparable performance.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "CODvpHzmC3Gw11g1fPi23rADLEq6Uchesoalsq-OfQE",
  "pdfSize": "51143025"
}