{
  "id": "2412.01794",
  "title": "IQA-Adapter: Exploring Knowledge Transfer from Image Quality Assessment\n  to Diffusion-based Generative Models",
  "authors": "Khaled Abud, Sergey Lavrushkin, Alexey Kirillov, Dmitriy Vatolin",
  "authorsParsed": [
    [
      "Abud",
      "Khaled",
      ""
    ],
    [
      "Lavrushkin",
      "Sergey",
      ""
    ],
    [
      "Kirillov",
      "Alexey",
      ""
    ],
    [
      "Vatolin",
      "Dmitriy",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 18:40:19 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733164819000,
  "abstract": "  Diffusion-based models have recently transformed conditional image\ngeneration, achieving unprecedented fidelity in generating photorealistic and\nsemantically accurate images. However, consistently generating high-quality\nimages remains challenging, partly due to the lack of mechanisms for\nconditioning outputs on perceptual quality. In this work, we propose methods to\nintegrate image quality assessment (IQA) models into diffusion-based\ngenerators, enabling quality-aware image generation. First, we experiment with\ngradient-based guidance to optimize image quality directly and show this\napproach has limited generalizability. To address this, we introduce\nIQA-Adapter, a novel architecture that conditions generation on target quality\nlevels by learning the relationship between images and quality scores. When\nconditioned on high target quality, IQA-Adapter shifts the distribution of\ngenerated images towards a higher-quality subdomain. This approach achieves up\nto a 10% improvement across multiple objective metrics, as confirmed by a\nsubjective study, while preserving generative diversity and content.\nAdditionally, IQA-Adapter can be used inversely as a degradation model,\ngenerating progressively more distorted images when conditioned on lower\nquality scores. Our quality-aware methods also provide insights into the\nadversarial robustness of IQA models, underscoring the potential of quality\nconditioning in generative modeling and the importance of robust IQA methods.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "OwpX9RkTEU7uNf7K8M8v1_mA-emCKWJDzAgrkz7_xNg",
  "pdfSize": "24241725"
}