{
  "id": "2412.14603",
  "title": "Successive optimization of optics and post-processing with\n  differentiable coherent PSF operator and field information",
  "authors": "Zheng Ren, Jingwen Zhou, Wenguan Zhang, Jiapu Yan, Bingkun Chen,\n  Huajun Feng, Shiqi Chen",
  "authorsParsed": [
    [
      "Ren",
      "Zheng",
      ""
    ],
    [
      "Zhou",
      "Jingwen",
      ""
    ],
    [
      "Zhang",
      "Wenguan",
      ""
    ],
    [
      "Yan",
      "Jiapu",
      ""
    ],
    [
      "Chen",
      "Bingkun",
      ""
    ],
    [
      "Feng",
      "Huajun",
      ""
    ],
    [
      "Chen",
      "Shiqi",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 07:49:40 GMT"
    },
    {
      "version": "v2",
      "created": "Mon, 23 Dec 2024 11:40:38 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734594580000,
  "abstract": "  Recently, the joint design of optical systems and downstream algorithms is\nshowing significant potential. However, existing rays-described methods are\nlimited to optimizing geometric degradation, making it difficult to fully\nrepresent the optical characteristics of complex, miniaturized lenses\nconstrained by wavefront aberration or diffraction effects. In this work, we\nintroduce a precise optical simulation model, and every operation in pipeline\nis differentiable. This model employs a novel initial value strategy to enhance\nthe reliability of intersection calculation on high aspherics. Moreover, it\nutilizes a differential operator to reduce memory consumption during coherent\npoint spread function calculations. To efficiently address various degradation,\nwe design a joint optimization procedure that leverages field information.\nGuided by a general restoration network, the proposed method not only enhances\nthe image quality, but also successively improves the optical performance\nacross multiple lenses that are already in professional level. This joint\noptimization pipeline offers innovative insights into the practical design of\nsophisticated optical systems and post-processing algorithms. The source code\nwill be made publicly available at\nhttps://github.com/Zrr-ZJU/Successive-optimization\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Physics/Optics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "D9PPvoQfFfnfPQxmXfF8u2H0_Af2ROrokY1Aq7Xvx6Y",
  "pdfSize": "10795132"
}