{"id":"2412.05188","title":"Novel Physics of Escaping Secondary Atmospheres May Shape the Cosmic\n  Shoreline","authors":"Richard D. Chatterjee and Raymond T. Pierrehumbert","authorsParsed":[["Chatterjee","Richard D.",""],["Pierrehumbert","Raymond T.",""]],"versions":[{"version":"v1","created":"Fri, 6 Dec 2024 17:09:33 GMT"}],"updateDate":"2024-12-09","timestamp":1733504973000,"abstract":"  Recent James Webb Space Telescope observations of cool, rocky exoplanets\nreveal a probable lack of thick atmospheres, suggesting prevalent escape of the\nsecondary atmospheres formed after losing primordial hydrogen. Yet, simulations\nindicate that hydrodynamic escape of secondary atmospheres, composed of\nnitrogen and carbon dioxide, requires intense fluxes of ionizing radiation\n(XUV) to overcome the effects of high molecular weight and efficient line\ncooling. This transonic outflow of hot, ionized metals (not hydrogen) presents\na novel astrophysical regime ripe for exploration. We introduce an analytic\nframework to determine which planets retain or lose their atmospheres,\npositioning them on either side of the cosmic shoreline. We model the radial\nstructure of escaping atmospheres as polytropic expansions - power-law\nrelationships between density and temperature driven by local XUV heating. Our\napproach diagnoses line cooling with a three-level atom model and incorporates\nhow ion-electron interactions reduce mean molecular weight. Crucially,\nhydrodynamic escape onsets for a threshold XUV flux dependent upon the\natmosphere's gravitational binding. Ensuing escape rates either scale linearly\nwith XUV flux when weakly ionized (energy-limited) or are controlled by a\ncollisional-radiative thermostat when strongly ionized. Thus, airlessness is\ndetermined by whether the XUV flux surpasses the critical threshold during the\nstar's active periods, accounting for expendable primordial hydrogen and\nrevival by volcanism. We explore atmospheric escape from Young-Sun Mars and\nEarth, LHS-1140 b and c, and TRAPPIST-1 b. Our modeling characterizes the\nbottleneck of atmospheric loss on the occurrence of observable Earth-like\nhabitats and offers analytic tools for future studies.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"a14PXcHieXnfzOWLbaydnsG8Kz8EbBo-zHt0yfjbX2c","pdfSize":"4521366"}