{"id":"2412.00419","title":"AutoPQ: Automating Quantile estimation from Point forecasts in the\n  context of sustainability","authors":"Stefan Meisenbacher, Kaleb Phipps, Oskar Taubert, Marie Weiel, Markus\n  G\\\"otz, Ralf Mikut, Veit Hagenmeyer","authorsParsed":[["Meisenbacher","Stefan",""],["Phipps","Kaleb",""],["Taubert","Oskar",""],["Weiel","Marie",""],["Götz","Markus",""],["Mikut","Ralf",""],["Hagenmeyer","Veit",""]],"versions":[{"version":"v1","created":"Sat, 30 Nov 2024 10:13:57 GMT"}],"updateDate":"2024-12-03","timestamp":1732961637000,"abstract":"  Optimizing smart grid operations relies on critical decision-making informed\nby uncertainty quantification, making probabilistic forecasting a vital tool.\nDesigning such forecasting models involves three key challenges: accurate and\nunbiased uncertainty quantification, workload reduction for data scientists\nduring the design process, and limitation of the environmental impact of model\ntraining. In order to address these challenges, we introduce AutoPQ, a novel\nmethod designed to automate and optimize probabilistic forecasting for smart\ngrid applications. AutoPQ enhances forecast uncertainty quantification by\ngenerating quantile forecasts from an existing point forecast by using a\nconditional Invertible Neural Network (cINN). AutoPQ also automates the\nselection of the underlying point forecasting method and the optimization of\nhyperparameters, ensuring that the best model and configuration is chosen for\neach application. For flexible adaptation to various performance needs and\navailable computing power, AutoPQ comes with a default and an advanced\nconfiguration, making it suitable for a wide range of smart grid applications.\nAdditionally, AutoPQ provides transparency regarding the electricity\nconsumption required for performance improvements. We show that AutoPQ\noutperforms state-of-the-art probabilistic forecasting methods while\neffectively limiting computational effort and hence environmental impact.\nAdditionally and in the context of sustainability, we quantify the electricity\nconsumption required for performance improvements.\n","subjects":["Computer Science/Machine Learning","Electrical Engineering and Systems Science/Signal Processing","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"rtGprrJy14uAG7B4Kn9xcat8CpY4wsT17K8L3FysPK4","pdfSize":"1023055"}