{"id":"2412.03843","title":"Using Cooperative Co-evolutionary Search to Generate Metamorphic Test\n  Cases for Autonomous Driving Systems","authors":"Hossein Yousefizadeh, Shenghui Gu, Lionel C. Briand, Ali Nasr","authorsParsed":[["Yousefizadeh","Hossein",""],["Gu","Shenghui",""],["Briand","Lionel C.",""],["Nasr","Ali",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 03:17:31 GMT"}],"updateDate":"2024-12-06","timestamp":1733368651000,"abstract":"  Autonomous Driving Systems (ADSs) rely on Deep Neural Networks, allowing\nvehicles to navigate complex, open environments. However, the unpredictability\nof these scenarios highlights the need for rigorous system-level testing to\nensure safety, a task usually performed with a simulator in the loop. Though\none important goal of such testing is to detect safety violations, there are\nmany undesirable system behaviors, that may not immediately lead to violations,\nthat testing should also be focusing on, thus detecting more subtle problems\nand enabling a finer-grained analysis. This paper introduces Cooperative\nCo-evolutionary MEtamorphic test Generator for Autonomous systems (CoCoMEGA), a\nnovel automated testing framework aimed at advancing system-level safety\nassessments of ADSs. CoCoMEGA combines Metamorphic Testing (MT) with a\nsearch-based approach utilizing Cooperative Co-Evolutionary Algorithms (CCEA)\nto efficiently generate a diverse set of test cases. CoCoMEGA emphasizes the\nidentification of test scenarios that present undesirable system behavior, that\nmay eventually lead to safety violations, captured by Metamorphic Relations\n(MRs). When evaluated within the CARLA simulation environment on the Interfuser\nADS, CoCoMEGA consistently outperforms baseline methods, demonstrating enhanced\neffectiveness and efficiency in generating severe, diverse MR violations and\nachieving broader exploration of the test space. These results underscore\nCoCoMEGA as a promising, more scalable solution to the inherent challenges in\nADS testing with a simulator in the loop. Future research directions may\ninclude extending the approach to additional simulation platforms, applying it\nto other complex systems, and exploring methods for further improving testing\nefficiency such as surrogate modeling.\n","subjects":["Computer Science/Software Engineering","Computer Science/Neural and Evolutionary Computing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"chAdH53dr0qShWRrTzMSYCSoqs8RosaH5pbeYklNZjQ","pdfSize":"1179558"}