{
  "id": "2412.05673",
  "title": "A generalized Bayesian approach for high-dimensional robust regression\n  with serially correlated errors and predictors",
  "authors": "Saptarshi Chakraborty, Kshitij Khare, George Michailidis",
  "authorsParsed": [
    [
      "Chakraborty",
      "Saptarshi",
      ""
    ],
    [
      "Khare",
      "Kshitij",
      ""
    ],
    [
      "Michailidis",
      "George",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 7 Dec 2024 14:38:56 GMT"
    },
    {
      "version": "v2",
      "created": "Fri, 21 Feb 2025 22:10:18 GMT"
    }
  ],
  "updateDate": "2025-02-25",
  "timestamp": 1733582336000,
  "abstract": "  This paper introduces a loss-based generalized Bayesian methodology for\nhigh-dimensional robust regression with serially correlated errors and\npredictors. The proposed framework employs a novel scaled pseudo-Huber (SPH)\nloss function, which smooths the well-known Huber loss, effectively balancing\nquadratic ($\\ell_2$) and absolute linear ($\\ell_1$) loss behaviors. This\nflexibility enables the framework to accommodate both thin-tailed and\nheavy-tailed data efficiently. The generalized Bayesian approach constructs a\nworking likelihood based on the SPH loss, facilitating efficient and stable\nestimation while providing rigorous uncertainty quantification for all model\nparameters. Notably, this approach allows formal statistical inference without\nrequiring ad hoc tuning parameter selection while adaptively addressing a wide\nrange of tail behavior in the errors. By specifying appropriate prior\ndistributions for the regression coefficients--such as ridge priors for small\nor moderate-dimensional settings and spike-and-slab priors for high-dimensional\nsettings--the framework ensures principled inference. We establish rigorous\ntheoretical guarantees for accurate parameter estimation and correct predictor\nselection under sparsity assumptions for a wide range of data generating\nsetups. Extensive simulation studies demonstrate the superior performance of\nour approach compared to traditional Bayesian regression methods based on\n$\\ell_2$ and $\\ell_1$-loss functions. The results highlight its flexibility and\nrobustness, particularly in challenging high-dimensional settings characterized\nby data contamination.\n",
  "subjects": [
    "Statistics/Methodology",
    "Mathematics/Statistics Theory",
    "Statistics/Computation",
    "Statistics/Statistics Theory"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "XTWpQxx9dHPHEia_dUU8qQJ5EoZq7ciBf03f6duEsAs",
  "pdfSize": "4582954"
}