{"id":"2412.20348","title":"Spatial and Temporal Distribution of Nanoflare Heating During Active\n  Region Evolution","authors":"Biswajit Mondal, James A Klimchuk, Amy R. Winebarger, P. S. Athiray,\n  and Jiayi Liu","authorsParsed":[["Mondal","Biswajit",""],["Klimchuk","James A",""],["Winebarger","Amy R.",""],["Athiray","P. S.",""],["Liu","Jiayi",""]],"versions":[{"version":"v1","created":"Sun, 29 Dec 2024 04:30:13 GMT"}],"updateDate":"2024-12-31","timestamp":1735446613000,"abstract":"  Nanoflares are believed to be key contributors to heating solar non-flaring\nactive regions, though their individual detection remains challenging. This\nstudy uses a data-driven field-aligned hydrodynamic model to examine nanoflare\nproperties throughout the lifecycle of AR12758. We simulate coronal loop\nemissions, where each loop is heated by random nanoflares depending on the loop\nparameters derived from photospheric magnetograms observed by SDO/HMI.\nSimulated X-ray flux and temperature can reproduce the temporal variations\nobserved by Chandrayaan-2/XSM. Our findings show that high-frequency nanoflares\ncontribute to cool emissions across the AR, while low- and intermediate-\nfrequency primarily contribute to hot emissions. During the emerging phase,\nenergy deposition is dominated by low-frequency events. Post-emergence, energy\nis deposited by both low- and intermediate-frequency nanoflares, while as the\nAR ages, the contribution from intermediate- and high-frequency nanoflares\nincreases. The spatial distribution of heating frequencies across the AR\nreveals a clear pattern: the core of the active region spends most of its time\nin a low-frequency heating state, the periphery is dominated by high-frequency\nheating, and the region between the core and periphery experiences\nintermediate-frequency heating.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"KUB_SlVose7FNPWQNiDFHyk6aGCfuyXYrudTOtnSMCw","pdfSize":"2113164"}