{
  "id": "2412.05573",
  "title": "Neighborhood Commonality-aware Evolution Network for Continuous\n  Generalized Category Discovery",
  "authors": "Ye Wang, Yaxiong Wang, Guoshuai Zhao, and Xueming Qian",
  "authorsParsed": [
    [
      "Wang",
      "Ye",
      ""
    ],
    [
      "Wang",
      "Yaxiong",
      ""
    ],
    [
      "Zhao",
      "Guoshuai",
      ""
    ],
    [
      "Qian",
      "Xueming",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 7 Dec 2024 07:41:41 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733557301000,
  "abstract": "  Continuous Generalized Category Discovery (C-GCD) aims to continually\ndiscover novel classes from unlabelled image sets while maintaining performance\non old classes. In this paper, we propose a novel learning framework, dubbed\nNeighborhood Commonality-aware Evolution Network (NCENet) that conquers this\ntask from the perspective of representation learning. Concretely, to learn\ndiscriminative representations for novel classes, a Neighborhood\nCommonality-aware Representation Learning (NCRL) is designed, which exploits\nlocal commonalities derived neighborhoods to guide the learning of\nrepresentational differences between instances of different classes. To\nmaintain the representation ability for old classes, a Bi-level Contrastive\nKnowledge Distillation (BCKD) module is designed, which leverages contrastive\nlearning to perceive the learning and learned knowledge and conducts knowledge\ndistillation. Extensive experiments conducted on CIFAR10, CIFAR100, and\nTiny-ImageNet demonstrate the superior performance of NCENet compared to the\nprevious state-of-the-art method. Particularly, in the last incremental\nlearning session on CIFAR100, the clustering accuracy of NCENet outperforms the\nsecond-best method by a margin of 3.09\\% on old classes and by a margin of\n6.32\\% on new classes. Our code will be publicly available at\n\\href{https://github.com/xjtuYW/NCENet.git}{https://github.com/xjtuYW/NCENet.git}.\n\\end{abstract}\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "7kWD8cyhF0eaqrIq1XR9iiRrDDeK-KUVQpPVtoUPTyc",
  "pdfSize": "4775250"
}