{
  "id": "2412.11295",
  "title": "The Relational Quotient Completion",
  "authors": "Francesco Dagnino and Fabio Pasquali",
  "authorsParsed": [
    [
      "Dagnino",
      "Francesco",
      ""
    ],
    [
      "Pasquali",
      "Fabio",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 15 Dec 2024 20:05:47 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734293147000,
  "abstract": "  Taking a quotient roughly means changing the notion of equality on a given\nobject, set or type. In a quantitative setting, equality naturally generalises\nto a distance, measuring how much elements are similar instead of just stating\ntheir equivalence. Hence, quotients can be understood quantitatively as a\nchange of distance.\n  In this paper, we show how, combining Lawvere's doctrines and the calculus of\nrelations, one can unify quantitative and usual quotients in a common picture.\nMore in detail, we introduce relational doctrines as a functorial description\nof (the core of) the calculus of relations. Then, we define quotients and a\nuniversal construction adding them to any relational doctrine, generalising the\nquotient completion of existential elementary doctrine and also recovering many\nquantitative examples. This construction deals with an intensional notion of\nquotient and breaks extensional equality of morphisms. Then, we describe\nanother construction forcing extensionality, showing how it abstracts several\nnotions of separation in metric and topological structures. Combining these two\nconstructions, we get the extensional quotient completion, whose essential\nimage is characterized through the notion of projective cover. As an\napplication, we show that, under suitable conditions, relational doctrines of\nalgebras arise as the extensional quotient completion of free algebras.\nFinally, we compare relational doctrines to other categorical structures where\none can model the calculus of relations.\n",
  "subjects": [
    "Mathematics/Category Theory",
    "Computer Science/Logic in Computer Science",
    "Mathematics/Logic"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "ptOOWoTHRf_d2uDV3eLnFqafrLBwUW-WITKYtULOi54",
  "pdfSize": "654719"
}