{"id":"2412.07072","title":"Stable Mean Teacher for Semi-supervised Video Action Detection","authors":"Akash Kumar, Sirshapan Mitra, Yogesh Singh Rawat","authorsParsed":[["Kumar","Akash",""],["Mitra","Sirshapan",""],["Rawat","Yogesh Singh",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 00:25:33 GMT"},{"version":"v2","created":"Mon, 23 Dec 2024 01:39:48 GMT"}],"updateDate":"2024-12-24","timestamp":1733790333000,"abstract":"  In this work, we focus on semi-supervised learning for video action\ndetection. Video action detection requires spatiotemporal localization in\naddition to classification, and a limited amount of labels makes the model\nprone to unreliable predictions. We present Stable Mean Teacher, a simple\nend-to-end teacher-based framework that benefits from improved and temporally\nconsistent pseudo labels. It relies on a novel Error Recovery (EoR) module,\nwhich learns from students' mistakes on labeled samples and transfers this\nknowledge to the teacher to improve pseudo labels for unlabeled samples.\nMoreover, existing spatiotemporal losses do not take temporal coherency into\naccount and are prone to temporal inconsistencies. To address this, we present\nDifference of Pixels (DoP), a simple and novel constraint focused on temporal\nconsistency, leading to coherent temporal detections. We evaluate our approach\non four different spatiotemporal detection benchmarks: UCF101-24, JHMDB21, AVA,\nand YouTube-VOS. Our approach outperforms the supervised baselines for action\ndetection by an average margin of 23.5% on UCF101-24, 16% on JHMDB21, and 3.3%\non AVA. Using merely 10% and 20% of data, it provides competitive performance\ncompared to the supervised baseline trained on 100% annotations on UCF101-24\nand JHMDB21, respectively. We further evaluate its effectiveness on AVA for\nscaling to large-scale datasets and YouTube-VOS for video object segmentation,\ndemonstrating its generalization capability to other tasks in the video domain.\nCode and models are publicly available.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Jyuyb3CJt3u9jdhjUxw1a335BSS5-rgaC1xjB9M7jpA","pdfSize":"2893179"}