{
  "id": "2412.16069",
  "title": "Cloud-scale elemental abundance variations and the CO-to-dust-mass\n  conversion factor in M31",
  "authors": "Chloe Bosomworth, Jan Forbrich, Charles J. Lada, Nelson Caldwell,\n  Chiaki Kobayashi, S\\'ebastien Viaene",
  "authorsParsed": [
    [
      "Bosomworth",
      "Chloe",
      ""
    ],
    [
      "Forbrich",
      "Jan",
      ""
    ],
    [
      "Lada",
      "Charles J.",
      ""
    ],
    [
      "Caldwell",
      "Nelson",
      ""
    ],
    [
      "Kobayashi",
      "Chiaki",
      ""
    ],
    [
      "Viaene",
      "Sébastien",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 17:11:51 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734714711000,
  "abstract": "  From a spectroscopic survey of candidate H II regions in the Andromeda galaxy\n(M31) with MMT/Hectospec, we have identified 294 H II regions using emission\nline ratios and calculated elemental abundances from strong-line diagnostics\n(values ranging from sub-solar to super-solar) producing both Oxygen and\nNitrogen radial abundance gradients. The Oxygen gradient is relatively flat,\nwhile the Nitrogen gradient is significantly steeper, indicating a higher N/O\nratio in M31's inner regions, consistent with recent simulations of galaxy\nchemical evolution. No strong evidence was found of systematic galaxy-scale\ntrends beyond the radial gradient. After subtracting the radial gradient from\nabundance values, we find an apparently stochastic and statistically\nsignificant scatter of standard deviation 0.06 dex, which exceeds measurement\nuncertainties. One explanation includes a possible collision with M32 200 - 800\nMyrs ago. Using the two-point correlation function of the Oxygen abundance, we\nfind that, similar to other spiral galaxies, M31 is well-mixed on sub-kpc\nscales but less so on larger (kpc) scales, which could be a result of an\nexponential decrease in mixing speed with spatial scale, and the aforementioned\nrecent merger. Finally, the MMT spectroscopy is complemented by a dust\ncontinuum and CO survey of individual Giant Molecular Clouds, conducted with\nthe Submillimeter Array. By combining the MMT and SMA observations, we obtain a\nunique direct test of the Oxygen abundance dependence of the\n$\\alpha^{\\prime}(^{12}\\mathrm{CO})$ factor which is crucial to convert CO\nemission to dust mass. Our results suggest that within our sample there is no\ntrend of the $\\alpha^{\\prime}(^{12}\\mathrm{CO})$ with Oxygen abundance.\n",
  "subjects": [
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "uFdoR7nsxWkHqKyZClI-5BDd_LPypM2ias4sfMYtVa0",
  "pdfSize": "15135388"
}