{
  "id": "2412.14457",
  "title": "VISA: Retrieval Augmented Generation with Visual Source Attribution",
  "authors": "Xueguang Ma, Shengyao Zhuang, Bevan Koopman, Guido Zuccon, Wenhu Chen,\n  Jimmy Lin",
  "authorsParsed": [
    [
      "Ma",
      "Xueguang",
      ""
    ],
    [
      "Zhuang",
      "Shengyao",
      ""
    ],
    [
      "Koopman",
      "Bevan",
      ""
    ],
    [
      "Zuccon",
      "Guido",
      ""
    ],
    [
      "Chen",
      "Wenhu",
      ""
    ],
    [
      "Lin",
      "Jimmy",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 02:17:35 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734574655000,
  "abstract": "  Generation with source attribution is important for enhancing the\nverifiability of retrieval-augmented generation (RAG) systems. However,\nexisting approaches in RAG primarily link generated content to document-level\nreferences, making it challenging for users to locate evidence among multiple\ncontent-rich retrieved documents. To address this challenge, we propose\nRetrieval-Augmented Generation with Visual Source Attribution (VISA), a novel\napproach that combines answer generation with visual source attribution.\nLeveraging large vision-language models (VLMs), VISA identifies the evidence\nand highlights the exact regions that support the generated answers with\nbounding boxes in the retrieved document screenshots. To evaluate its\neffectiveness, we curated two datasets: Wiki-VISA, based on crawled Wikipedia\nwebpage screenshots, and Paper-VISA, derived from PubLayNet and tailored to the\nmedical domain. Experimental results demonstrate the effectiveness of VISA for\nvisual source attribution on documents' original look, as well as highlighting\nthe challenges for improvement. Code, data, and model checkpoints will be\nreleased.\n",
  "subjects": [
    "Computer Science/Information Retrieval"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "kkeeBAkR0lZAMefKrxMMVihtvBCQqDckQA8j5iSjB6U",
  "pdfSize": "3651221"
}