{
  "id": "2412.02905",
  "title": "Constrained LTL Specification Learning from Examples",
  "authors": "Changjian Zhang, Parv Kapoor, Ian Dardik, Leyi Cui, Romulo Meira-Goes,\n  David Garlan, Eunsuk Kang",
  "authorsParsed": [
    [
      "Zhang",
      "Changjian",
      ""
    ],
    [
      "Kapoor",
      "Parv",
      ""
    ],
    [
      "Dardik",
      "Ian",
      ""
    ],
    [
      "Cui",
      "Leyi",
      ""
    ],
    [
      "Meira-Goes",
      "Romulo",
      ""
    ],
    [
      "Garlan",
      "David",
      ""
    ],
    [
      "Kang",
      "Eunsuk",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 23:15:27 GMT"
    },
    {
      "version": "v2",
      "created": "Thu, 19 Dec 2024 21:49:59 GMT"
    },
    {
      "version": "v3",
      "created": "Mon, 30 Dec 2024 18:51:21 GMT"
    }
  ],
  "updateDate": "2025-01-03",
  "timestamp": 1733267727000,
  "abstract": "  Temporal logic specifications play an important role in a wide range of\nsoftware analysis tasks, such as model checking, automated synthesis, program\ncomprehension, and runtime monitoring. Given a set of positive and negative\nexamples, specified as traces, LTL learning is the problem of synthesizing a\nspecification, in linear temporal logic (LTL), that evaluates to true over the\npositive traces and false over the negative ones. In this paper, we propose a\nnew type of LTL learning problem called constrained LTL learning, where the\nuser, in addition to positive and negative examples, is given an option to\nspecify one or more constraints over the properties of the LTL formula to be\nlearned. We demonstrate that the ability to specify these additional\nconstraints significantly increases the range of applications for LTL learning,\nand also allows efficient generation of LTL formulas that satisfy certain\ndesirable properties (such as minimality). We propose an approach for solving\nthe constrained LTL learning problem through an encoding in first-order\nrelational logic and reduction to an instance of the maximal satisfiability\n(MaxSAT) problem. An experimental evaluation demonstrates that ATLAS, an\nimplementation of our proposed approach, is able to solve new types of learning\nproblems while performing better than or competitively with the\nstate-of-the-art tools in LTL learning.\n",
  "subjects": [
    "Computer Science/Software Engineering",
    "Computer Science/Logic in Computer Science"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "Z8ZwbtxltQ2vcS-RwQkNfF1_fK7Go4WW1UOZFbzzqw4",
  "pdfSize": "886802"
}