{
  "id": "2412.01064",
  "title": "FLOAT: Generative Motion Latent Flow Matching for Audio-driven Talking\n  Portrait",
  "authors": "Taekyung Ki, Dongchan Min, Gyeongsu Chae",
  "authorsParsed": [
    [
      "Ki",
      "Taekyung",
      ""
    ],
    [
      "Min",
      "Dongchan",
      ""
    ],
    [
      "Chae",
      "Gyeongsu",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 02:50:07 GMT"
    },
    {
      "version": "v2",
      "created": "Wed, 4 Dec 2024 09:43:18 GMT"
    }
  ],
  "updateDate": "2024-12-05",
  "timestamp": 1733107807000,
  "abstract": "  With the rapid advancement of diffusion-based generative models, portrait\nimage animation has achieved remarkable results. However, it still faces\nchallenges in temporally consistent video generation and fast sampling due to\nits iterative sampling nature. This paper presents FLOAT, an audio-driven\ntalking portrait video generation method based on flow matching generative\nmodel. We shift the generative modeling from the pixel-based latent space to a\nlearned motion latent space, enabling efficient design of temporally consistent\nmotion. To achieve this, we introduce a transformer-based vector field\npredictor with a simple yet effective frame-wise conditioning mechanism.\nAdditionally, our method supports speech-driven emotion enhancement, enabling a\nnatural incorporation of expressive motions. Extensive experiments demonstrate\nthat our method outperforms state-of-the-art audio-driven talking portrait\nmethods in terms of visual quality, motion fidelity, and efficiency.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Machine Learning",
    "Computer Science/Multimedia",
    "Electrical Engineering and Systems Science/Image and Video Processing"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "O9mhDjRN1UD8ozVTzdKgukxJQvhQfwrvi-VujR1WKHY",
  "pdfSize": "14868536"
}