{
  "id": "2412.04625",
  "title": "Global minimization of a minimum of a finite collection of functions",
  "authors": "Guillaume Van Dessel and Fran\\c{c}ois Glineur",
  "authorsParsed": [
    [
      "Van Dessel",
      "Guillaume",
      ""
    ],
    [
      "Glineur",
      "François",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 21:38:54 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733434734000,
  "abstract": "  We consider the global minimization of a particular type of minimum\nstructured optimization problems wherein the variables must belong to some\nbasic set, the feasible domain is described by the intersection of a large\nnumber of functional constraints and the objective stems as the pointwise\nminimum of a collection of functional pieces. Among others, this setting\nincludes all non-convex piecewise linear problems. The global minimum of a\nminimum structured problem can be computed using a simple enumeration scheme by\nsolving a sequence of individual problems involving each a single piece and\nthen taking the smallest individual minimum.\n  We propose a new algorithm, called Upper-Lower Optimization (ULO), tackling\nproblems from the aforementioned class. Our method does not require the\nsolution of every individual problem listed in the baseline enumeration scheme,\nyielding potential substantial computational gains. It alternates between (a)\nlocal-search steps, which minimize upper models, and (b) suggestion steps,\nwhich optimize lower models. We prove that ULO can return a solution of any\nprescribed global optimality accuracy. According to a computational complexity\nmodel based on the cost of solving the individual problems, we analyze in which\npractical scenarios ULO is expected to outperform the baseline enumeration\nscheme. Finally, we empirically validate our approach on a set of piecewise\nlinear programs (PL) of incremental difficulty.\n",
  "subjects": [
    "Mathematics/Optimization and Control"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "bI8KHmcisciEHK57qTXdCbpyYOmFCLD05J2MQ9C2XXc",
  "pdfSize": "1143989"
}