{
  "id": "2412.11421",
  "title": "The role of Enhanced Geothermal Systems in the energy transition at\n  Cornell -- Report of a workshop held at Cornell University, Ithaca, October\n  23-24, 2024",
  "authors": "Chlo\\'e Arson, Dominic Balog-Way, Koenraad Beckers, Wayne Bezner-Kerr,\n  Sarah Carson, Stacey Edwards, Patrick Fulton, Michael Gillenwater, Trystan\n  Goetze, Olaf Gustafson, Tony Ingraffea, Terry Jordan, Katherine McComas,\n  Sheila Olmstead, Seth Saltiel, Jeff Tester, Cole Tucker, Marguerite Wells",
  "authorsParsed": [
    [
      "Arson",
      "Chloé",
      ""
    ],
    [
      "Balog-Way",
      "Dominic",
      ""
    ],
    [
      "Beckers",
      "Koenraad",
      ""
    ],
    [
      "Bezner-Kerr",
      "Wayne",
      ""
    ],
    [
      "Carson",
      "Sarah",
      ""
    ],
    [
      "Edwards",
      "Stacey",
      ""
    ],
    [
      "Fulton",
      "Patrick",
      ""
    ],
    [
      "Gillenwater",
      "Michael",
      ""
    ],
    [
      "Goetze",
      "Trystan",
      ""
    ],
    [
      "Gustafson",
      "Olaf",
      ""
    ],
    [
      "Ingraffea",
      "Tony",
      ""
    ],
    [
      "Jordan",
      "Terry",
      ""
    ],
    [
      "McComas",
      "Katherine",
      ""
    ],
    [
      "Olmstead",
      "Sheila",
      ""
    ],
    [
      "Saltiel",
      "Seth",
      ""
    ],
    [
      "Tester",
      "Jeff",
      ""
    ],
    [
      "Tucker",
      "Cole",
      ""
    ],
    [
      "Wells",
      "Marguerite",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 03:43:13 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734320593000,
  "abstract": "  To review the lessons learnt from recent deep geothermal case studies and\nplan strategically the research, development, regulation, and communication\nwork required for the implementation of an Enhanced Geothermal System (EGS) at\nCornell University, a group of engineers and scholars convened a two-day\nworkshop on the Ithaca campus, on October 23-24, 2024. The event was funded by\nCornell Atkinson Center for Sustainability. This report is a summary of the\ncontent of the presentations and discussions that took place during the\nworkshop. The first section focuses on philosophical, sociological, economic,\nand regulatory questions posed by EGS deployment as a means to mitigate climate\nchange. The second section tackles the scientific and technological research\nareas associated with EGS. The third section aims to assess the feasibility of\ndeveloping EGS for heat direct use at Cornell University, based on results and\ninformation available to date. The report concludes with a summary of the most\nsalient technological and scientific breakthroughs, and a plan for future\ntechnological and academic engagement in EGS projects at Cornell.\n",
  "subjects": [
    "Physics/Geophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "8Lmp9hL1nRiM2D-GZyqke8ScwsyEwcAvwX1NO32I_M4",
  "pdfSize": "1919531"
}