{
  "id": "2412.12550",
  "title": "Consistent Diffusion: Denoising Diffusion Model with Data-Consistent\n  Training for Image Restoration",
  "authors": "Xinlong Cheng, Tiantian Cao, Guoan Cheng, Bangxuan Huang, Xinghan\n  Tian, Ye Wang, Xiaoyu He, Weixin Li, Tianfan Xue, Xuan Dong",
  "authorsParsed": [
    [
      "Cheng",
      "Xinlong",
      ""
    ],
    [
      "Cao",
      "Tiantian",
      ""
    ],
    [
      "Cheng",
      "Guoan",
      ""
    ],
    [
      "Huang",
      "Bangxuan",
      ""
    ],
    [
      "Tian",
      "Xinghan",
      ""
    ],
    [
      "Wang",
      "Ye",
      ""
    ],
    [
      "He",
      "Xiaoyu",
      ""
    ],
    [
      "Li",
      "Weixin",
      ""
    ],
    [
      "Xue",
      "Tianfan",
      ""
    ],
    [
      "Dong",
      "Xuan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 05:21:16 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734412876000,
  "abstract": "  In this work, we address the limitations of denoising diffusion models (DDMs)\nin image restoration tasks, particularly the shape and color distortions that\ncan compromise image quality. While DDMs have demonstrated a promising\nperformance in many applications such as text-to-image synthesis, their\neffectiveness in image restoration is often hindered by shape and color\ndistortions. We observe that these issues arise from inconsistencies between\nthe training and testing data used by DDMs. Based on our observation, we\npropose a novel training method, named data-consistent training, which allows\nthe DDMs to access images with accumulated errors during training, thereby\nensuring the model to learn to correct these errors. Experimental results show\nthat, across five image restoration tasks, our method has significant\nimprovements over state-of-the-art methods while effectively minimizing\ndistortions and preserving image fidelity.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "mPfxF4tNAJCHAnr4NYzYBi47ikr7RYeS32phUaNFnKY",
  "pdfSize": "33180558"
}