{"id":"2412.09170","title":"Interplay between topology and electron-electron interactions in the\n  moir\\'{e} MoTe$_{\\mathrm{2}}$/WSe$_{\\mathrm{2}}$ heterobilayer","authors":"Palash Saha, Louk Rademaker, and Micha{\\l} Zegrodnik","authorsParsed":[["Saha","Palash",""],["Rademaker","Louk",""],["Zegrodnik","Michał",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 11:00:59 GMT"}],"updateDate":"2024-12-13","timestamp":1734001259000,"abstract":"  We study, the interplay between topology and electron-electron interactions\nin the moir\\'{e} MoTe$_2$/WSe$_2$ heterobilayer. In our analysis we apply an\neffective two-band model with complex hoppings that incorporate the Ising-type\nspin-orbit coupling and lead to a non-trivial topology after the application of\nperpendicular electric field (displacement field). The model is supplemented by\non-site and inter-site Coulomb repulsion terms and treated by both Hartree-Fock\nand Gutzwiller methods. According to our analysis, for the case of one hole per\nmoir\\'{e} unit cell, the system undergoes two phase transitions with increasing\ndisplacement field. The first one is from an in-plane 120$^\\circ$\nantiferromagnetic charge transfer insulator to a topological insulator. At the\nsecond transition, the system becomes topologically trivial and an out-of-plane\nferromagnetic metallic phase becomes stable. In the topological region a\nspontaneous spin-polarization appears and the holes are distributed in both\nlayers. Moreover, the hybridization of states from different layers and\ndifferent valleys is allowed near the Fermi level. Those aspects are in\nqualitative agreement with the available experimental data. Additionally, we\nanalyze the influence of the intersite Coulomb repulsion terms on the\nappearance of the topological phase as well as on the formation of the charge\ndensity wave state.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"mOjcoV84iFdv0tXHXVv5VL0fzEdGEiPuSw8IJO2TLgE","pdfSize":"2870197"}