{
  "id": "2412.18119",
  "title": "Age Optimal Sampling for Unreliable Channels under Unknown Channel\n  Statistics",
  "authors": "Hongyi He, Haoyue Tang, Jiayu Pan, Jintao Wang, Jian Song, and\n  Leandros Tassiulas",
  "authorsParsed": [
    [
      "He",
      "Hongyi",
      ""
    ],
    [
      "Tang",
      "Haoyue",
      ""
    ],
    [
      "Pan",
      "Jiayu",
      ""
    ],
    [
      "Wang",
      "Jintao",
      ""
    ],
    [
      "Song",
      "Jian",
      ""
    ],
    [
      "Tassiulas",
      "Leandros",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 24 Dec 2024 03:06:22 GMT"
    },
    {
      "version": "v2",
      "created": "Mon, 24 Feb 2025 08:42:09 GMT"
    }
  ],
  "updateDate": "2025-02-25",
  "timestamp": 1735009582000,
  "abstract": "  In this paper, we study a system in which a sensor forwards status updates to\na receiver through an error-prone channel, while the receiver sends the\ntransmission results back to the sensor via a reliable channel. Both channels\nare subject to random delays. To evaluate the timeliness of the status\ninformation at the receiver, we use the Age of Information (AoI) metric. The\nobjective is to design a sampling policy that minimizes the expected\ntime-average AoI, even when the channel statistics (e.g., delay distributions)\nare unknown. We first review the threshold structure of the optimal offline\npolicy under known channel statistics and then reformulate the design of the\nonline algorithm as a stochastic approximation problem. We propose a\nRobbins-Monro algorithm to solve this problem and demonstrate that the optimal\nthreshold can be approximated almost surely. Moreover, we prove that the\ncumulative AoI regret of the online algorithm increases with rate\n$\\mathcal{O}(\\ln K)$, where $K$ is the number of successful transmissions. In\naddition, our algorithm is shown to be minimax order optimal, in the sense that\nfor any online learning algorithm, the cumulative AoI regret up to the $K$-th\nsuccessful transmissions grows with the rate at least $\\Omega(\\ln K)$ in the\nworst case delay distribution. Finally, we improve the stability of the\nproposed online learning algorithm through a momentum-based stochastic gradient\ndescent algorithm. Simulation results validate the performance of our proposed\nalgorithm.\n",
  "subjects": [
    "Computer Science/Information Theory",
    "Computer Science/Machine Learning",
    "Mathematics/Information Theory"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "Zol8vtM2SgOdUqK7eWr2ZTq6DiJqiCz2hslRHvIUHSw",
  "pdfSize": "1206480"
}