{
  "id": "2412.07121",
  "title": "Bridging the Gap for Test-Time Multimodal Sentiment Analysis",
  "authors": "Zirun Guo, Tao Jin, Wenlong Xu, Wang Lin, Yangyang Wu",
  "authorsParsed": [
    [
      "Guo",
      "Zirun",
      ""
    ],
    [
      "Jin",
      "Tao",
      ""
    ],
    [
      "Xu",
      "Wenlong",
      ""
    ],
    [
      "Lin",
      "Wang",
      ""
    ],
    [
      "Wu",
      "Yangyang",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 02:26:33 GMT"
    },
    {
      "version": "v2",
      "created": "Sat, 8 Feb 2025 14:41:36 GMT"
    }
  ],
  "updateDate": "2025-02-11",
  "timestamp": 1733797593000,
  "abstract": "  Multimodal sentiment analysis (MSA) is an emerging research topic that aims\nto understand and recognize human sentiment or emotions through multiple\nmodalities. However, in real-world dynamic scenarios, the distribution of\ntarget data is always changing and different from the source data used to train\nthe model, which leads to performance degradation. Common adaptation methods\nusually need source data, which could pose privacy issues or storage overheads.\nTherefore, test-time adaptation (TTA) methods are introduced to improve the\nperformance of the model at inference time. Existing TTA methods are always\nbased on probabilistic models and unimodal learning, and thus can not be\napplied to MSA which is often considered as a multimodal regression task. In\nthis paper, we propose two strategies: Contrastive Adaptation and Stable\nPseudo-label generation (CASP) for test-time adaptation for multimodal\nsentiment analysis. The two strategies deal with the distribution shifts for\nMSA by enforcing consistency and minimizing empirical risk, respectively.\nExtensive experiments show that CASP brings significant and consistent\nimprovements to the performance of the model across various distribution shift\nsettings and with different backbones, demonstrating its effectiveness and\nversatility. Our codes are available at https://github.com/zrguo/CASP.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Computation and Language"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "GZJCsPLZ1jbmhzzgAJQq__OSP-qtwOQbbUBop24Cguk",
  "pdfSize": "867296"
}