{"id":"2412.08786","title":"An assessment of Alberta's strategy for controlling mountain pine beetle\n  outbreaks","authors":"Evan C. Johnson, Mark A. Lewis","authorsParsed":[["Johnson","Evan C.",""],["Lewis","Mark A.",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 21:30:31 GMT"},{"version":"v2","created":"Sat, 25 Jan 2025 20:20:54 GMT"}],"updateDate":"2025-01-28","timestamp":1733952631000,"abstract":"  The Canadian province of Alberta spent over 500 million dollars on\ncontrolling mountain pine beetle populations, but did it work? Using a\nstatistical modeling framework coupled with long-term field data, we examined\nhow direct control measures, severe winters, and host-tree depletion shaped the\ntrajectory of Alberta's mountain pine beetle outbreak between 2009 and 2020.\nSimulations suggest that control efforts reduced total tree mortality by 79%\n(95% predictive interval: 58--89%) and prevented 1.8 (0.91--4.1) trees per\nhectare from being killed from 2010--2020. Although cold winters had little\neffect on overall damage, they acted synergistically with control to end the\noutbreak, causing population collapse circa 2020. This synergy supports a \"wait\nit out\" strategy of mountain pine beetle management, where moderate control\neffort is applied until an extreme weather event delivers the final blow. Any\neffects of host-tree depletion via beetle attack were negligible. From an\neconomic perspective, removing one infestation tree -- at an approximate cost\nof 320 CAD -- prevented the loss of roughly six (2.6--15) trees, demonstrating\nthe potential for long-term cost-effectiveness. Our results further indicate\nthat future outbreaks may vary widely in severity due to environmental\nstochasticity, with potential damage in a no-control scenario ranging from 0.41\nto 9.7 trees per hectare killed (over a hypothetical 11-year period). An\nalternative model predicts an even wider range of outcomes: 1--40 trees per\nhectare. These findings highlight not only the potential of sustained control\nefforts in mitigating forest pest outbreaks, but also the inherent uncertainty\nin long-term ecological forecasting.\n","subjects":["Quantitative Biology/Populations and Evolution"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"aHjHJ4kUmekqIiya_itndb0DS1NVwakY2kMg2YItaBo","pdfSize":"4582608"}