{"id":"2412.12347","title":"AutoSciLab: A Self-Driving Laboratory For Interpretable Scientific\n  Discovery","authors":"Saaketh Desai, Sadhvikas Addamane, Jeffrey Y. Tsao, Igal Brener, Laura\n  P. Swiler, Remi Dingreville, Prasad P. Iyer","authorsParsed":[["Desai","Saaketh",""],["Addamane","Sadhvikas",""],["Tsao","Jeffrey Y.",""],["Brener","Igal",""],["Swiler","Laura P.",""],["Dingreville","Remi",""],["Iyer","Prasad P.",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 20:41:46 GMT"}],"updateDate":"2024-12-18","timestamp":1734381706000,"abstract":"  Advances in robotic control and sensing have propelled the rise of automated\nscientific laboratories capable of high-throughput experiments. However,\nautomated scientific laboratories are currently limited by human intuition in\ntheir ability to efficiently design and interpret experiments in\nhigh-dimensional spaces, throttling scientific discovery. We present\nAutoSciLab, a machine learning framework for driving autonomous scientific\nexperiments, forming a surrogate researcher purposed for scientific discovery\nin high-dimensional spaces. AutoSciLab autonomously follows the scientific\nmethod in four steps: (i) generating high-dimensional experiments (x \\in R^D)\nusing a variational autoencoder (ii) selecting optimal experiments by forming\nhypotheses using active learning (iii) distilling the experimental results to\ndiscover relevant low-dimensional latent variables (z \\in R^d, with d << D)\nwith a 'directional autoencoder' and (iv) learning a human interpretable\nequation connecting the discovered latent variables with a quantity of interest\n(y = f(z)), using a neural network equation learner. We validate the\ngeneralizability of AutoSciLab by rediscovering a) the principles of projectile\nmotion and b) the phase transitions within the spin-states of the Ising model\n(NP-hard problem). Applying our framework to an open-ended nanophotonics\nchallenge, AutoSciLab uncovers a fundamentally novel method for directing\nincoherent light emission that surpasses the current state-of-the-art (Iyer et\nal. 2023b, 2020).\n","subjects":["Computer Science/Machine Learning","Condensed Matter/Materials Science","Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"rV7Bq3WI1kjclMqRks0ipucSBAX3xFZh8LUUPRxAKLo","pdfSize":"11187355"}