{
  "id": "2412.19754",
  "title": "Complement or substitute? How AI increases the demand for human skills",
  "authors": "Elina M\\\"akel\\\"a, Fabian Stephany",
  "authorsParsed": [
    [
      "Mäkelä",
      "Elina",
      ""
    ],
    [
      "Stephany",
      "Fabian",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 27 Dec 2024 17:26:30 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 25 Feb 2025 10:31:29 GMT"
    },
    {
      "version": "v3",
      "created": "Wed, 26 Feb 2025 11:30:39 GMT"
    }
  ],
  "updateDate": "2025-02-27",
  "timestamp": 1735320390000,
  "abstract": "  This paper examines whether artificial intelligence (AI) acts as a substitute\nor complement to human labour, drawing on 12 million online job vacancies from\nthe United States spanning 2018-2023. We adopt a two-pronged approach: first,\nanalysing \"internal effects\" within roles explicitly requiring AI, and second,\ninvestigating \"external effects\" that arise when industries, occupations, and\nregions experience increases in AI demand. Our focus centres on whether\ncomplementary skills-such as digital literacy, teamwork, resilience, agility,\nor analytical thinking-become more prevalent and valuable as AI adoption grows.\nResults show that AI-focused roles are nearly twice as likely to require skills\nlike resilience, agility, or analytical thinking compared to non-AI roles.\nFurthermore, these skills command a significant wage premium; data scientists,\nfor instance, are offered 5-10% higher salaries if they also possess resilience\nor ethics capabilities. We observe positive spillover effects: a doubling of\nAI-specific demand across industries correlates with a 5% increase in demand\nfor complementary skills, even outside AI-related roles. Conversely, tasks\nvulnerable to AI substitution, such as basic data skills or translation,\nexhibit modest declines in demand. However, the external effect is clearly net\npositive: Complementary effects are up to 1.7x larger than substitution\neffects. These results are consistent across economies, including the United\nKingdom and Australia. Our findings highlight the necessity of reskilling\nworkers in areas where human expertise remains increasingly valuable and\nensuring workers can effectively complement and leverage emerging AI\ntechnologies.\n",
  "subjects": [
    "Economics/General Economics",
    "Computer Science/Artificial Intelligence",
    "Quantitative Finance/Economics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "RsoA3l_NVwcnBMt9r9qD-cb_C3do1F2t-N0ITpLE9Ck",
  "pdfSize": "3915892"
}