{"id":"2412.06820","title":"Artificial Intelligence without Restriction Surpassing Human\n  Intelligence with Probability One: Theoretical Insight into Secrets of the\n  Brain with AI Twins of the Brain","authors":"Guang-Bin Huang, M. Brandon Westover, Eng-King Tan, Haibo Wang,\n  Dongshun Cui, Wei-Ying Ma, Tiantong Wang, Qi He, Haikun Wei, Ning Wang,\n  Qiyuan Tian, Kwok-Yan Lam, Xin Yao, Tien Yin Wong","authorsParsed":[["Huang","Guang-Bin",""],["Westover","M. Brandon",""],["Tan","Eng-King",""],["Wang","Haibo",""],["Cui","Dongshun",""],["Ma","Wei-Ying",""],["Wang","Tiantong",""],["He","Qi",""],["Wei","Haikun",""],["Wang","Ning",""],["Tian","Qiyuan",""],["Lam","Kwok-Yan",""],["Yao","Xin",""],["Wong","Tien Yin",""]],"versions":[{"version":"v1","created":"Wed, 4 Dec 2024 13:17:44 GMT"}],"updateDate":"2024-12-12","timestamp":1733318264000,"abstract":"  Artificial Intelligence (AI) has apparently become one of the most important\ntechniques discovered by humans in history while the human brain is widely\nrecognized as one of the most complex systems in the universe. One fundamental\ncritical question which would affect human sustainability remains open: Will\nartificial intelligence (AI) evolve to surpass human intelligence in the\nfuture? This paper shows that in theory new AI twins with fresh cellular level\nof AI techniques for neuroscience could approximate the brain and its\nfunctioning systems (e.g. perception and cognition functions) with any expected\nsmall error and AI without restrictions could surpass human intelligence with\nprobability one in the end. This paper indirectly proves the validity of the\nconjecture made by Frank Rosenblatt 70 years ago about the potential\ncapabilities of AI, especially in the realm of artificial neural networks.\nIntelligence is just one of fortuitous but sophisticated creations of the\nnature which has not been fully discovered. Like mathematics and physics, with\nno restrictions artificial intelligence would lead to a new subject with its\nself-contained systems and principles. We anticipate that this paper opens new\ndoors for 1) AI twins and other AI techniques to be used in cellular level of\nefficient neuroscience dynamic analysis, functioning analysis of the brain and\nbrain illness solutions; 2) new worldwide collaborative scheme for\ninterdisciplinary teams concurrently working on and modelling different types\nof neurons and synapses and different level of functioning subsystems of the\nbrain with AI techniques; 3) development of low energy of AI techniques with\nthe aid of fundamental neuroscience properties; and 4) new controllable,\nexplainable and safe AI techniques with reasoning capabilities of discovering\nprinciples in nature.\n","subjects":["Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"S0SpgchiS3DLiEnt8-BLgcfU_4E2tVbDrV_ovjPRSdE","pdfSize":"1442602"}