{"id":"2412.17665","title":"Shape and Performance of Fastest Paths over Networks with Interacting\n  Selfish Agents","authors":"Marco Cogoni, Giovanni Busonera, and Enrico Gobbetti","authorsParsed":[["Cogoni","Marco",""],["Busonera","Giovanni",""],["Gobbetti","Enrico",""]],"versions":[{"version":"v1","created":"Mon, 23 Dec 2024 15:51:49 GMT"}],"updateDate":"2024-12-24","timestamp":1734969109000,"abstract":"  We study the evolution of the fastest paths in transportation networks under\nincreasing congestion, modeled as a linear decrease in edge travel speed with\ndensity due to interactions among selfish agents. Moving from the common\nedge-based to a path-based analysis, we examine the fastest directed routes\nconnecting random origin-destination pairs as traffic grows, characterizing\ntheir shape through effective length, maximum detour, and area under the curve,\nand their performance through a novel metric measuring how fast and how far an\nagent travels toward its destination. The entire network is characterized by\nanalyzing the performance metric's distribution across uniformly distributed\npaths. The study covers both random planar networks with controlled\ncharacteristics and real urban networks of major cities. The low-density\nnetwork regime, in which an initial smooth performance degradation is observed\nup to a critical traffic volume, is followed by the emergence of complex\npatterns of spatially heterogeneous slowdowns as traffic increases, rapidly\nleading to disjoint subnetworks. The failure of a few edges leads to a\ncatastrophic decrease in the network performance. The fastest paths for all\ncities show a peak for detour and inness (and their variance) in the proximity\nof the critical traffic level, defined as the flex of the rejected path ratio\ncurve. Inness generally shows a slight attraction by city centers on paths for\nlight traffic, but this reverses to strong repulsion during congestion. We\nexploit path performance to uncover an asymmetric behavior of different regions\nof the networks when acting as origins or destinations. Finally, the Gini\ncoefficient is used to study the unequal effects of path performance\ndegradation with traffic.\n","subjects":["Physics/Physics and Society","Condensed Matter/Statistical Mechanics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_p_mnSjG-KkbHE8CLCHgNfJJ2AbG1ryNFb-_yLoaCwM","pdfSize":"8068413"}