{
  "id": "2412.01906",
  "title": "The ionizing photon budget and effective clumping factor in radiative\n  transfer simulations calibrated to Lyman-alpha forest data",
  "authors": "Shikhar Asthana, Girish Kulkarni, Martin G. Haehnelt, James S. Bolton,\n  Laura C. Keating, and Charlotte Simmonds",
  "authorsParsed": [
    [
      "Asthana",
      "Shikhar",
      ""
    ],
    [
      "Kulkarni",
      "Girish",
      ""
    ],
    [
      "Haehnelt",
      "Martin G.",
      ""
    ],
    [
      "Bolton",
      "James S.",
      ""
    ],
    [
      "Keating",
      "Laura C.",
      ""
    ],
    [
      "Simmonds",
      "Charlotte",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 19:00:34 GMT"
    }
  ],
  "updateDate": "2024-12-04",
  "timestamp": 1733166034000,
  "abstract": "  Recent JWST observations have allowed for the first time to obtain\ncomprehensive measurements of the ionizing photon production efficiency\n$\\xi_\\text{ion} $ for a wide range of reionization-epoch galaxies. We explore\nimplications for the inferred UV luminosity functions and escape fractions of\nionizing sources in our suite of simulations. These are run with the GPU-based\nradiative transfer code ATON-HE and are calibrated to the XQR-30 Lyman-alpha\nforest data at $5<z<6.2$. For our fiducial source model, the inferred ionizing\nescape fractions increase from (6.1, 5.4, 4.9)% at $z=6$ to (14.4, 23.8, 29.4)%\nat $z=10$ for our (Fiducial, Early, Extremely Early) models in good agreement\nwith extrapolations of lower redshift escape fraction measurements.\nExtrapolating observed luminosity functions beyond the resolution limit of the\nsimulations to faint sources with $M_\\text{UV}=-11$ increases the inferred\nescape fractions by a factor $\\sim 1.5$ at $z=10$. For our oligarchic source\nmodel, where no ionizing photons are emitted in faint sources, the inferred\nescape fractions increase from 10% at $z=6$ to uncomfortably large values\n$>50$% at $z> 10$, disfavouring the oligarchic source model at very high\nredshift. The inferred effective clumping factors in our simulations are in the\nrange of $3-6$, suggesting consistency between the observed ionizing properties\nof reionization-epoch galaxies and the ionizing photon budget in our\nsimulations.\n",
  "subjects": [
    "Astrophysics/Cosmology and Nongalactic Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "qs_AnucXr7Dw2kceG72959kXku4Dfe0h5VCae-kq2pw",
  "pdfSize": "531781"
}