{
  "id": "2412.09628",
  "title": "Bridging AI and Science: Implications from a Large-Scale Literature\n  Analysis of AI4Science",
  "authors": "Yutong Xie, Yijun Pan, Hua Xu, Qiaozhu Mei",
  "authorsParsed": [
    [
      "Xie",
      "Yutong",
      ""
    ],
    [
      "Pan",
      "Yijun",
      ""
    ],
    [
      "Xu",
      "Hua",
      ""
    ],
    [
      "Mei",
      "Qiaozhu",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 27 Nov 2024 00:40:51 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 18 Feb 2025 03:53:05 GMT"
    }
  ],
  "updateDate": "2025-02-19",
  "timestamp": 1732668051000,
  "abstract": "  Artificial Intelligence has proven to be a transformative tool for advancing\nscientific research across a wide range of disciplines. However, a significant\ngap still exists between AI and scientific communities, limiting the full\npotential of AI methods in driving broad scientific discovery. Existing efforts\nin identifying and bridging this gap have often relied on qualitative\nexamination of small samples of literature, offering a limited perspective on\nthe broader AI4Science landscape. In this work, we present a large-scale\nanalysis of the AI4Science literature, starting by using large language models\nto identify scientific problems and AI methods in publications from top science\nand AI venues. Leveraging this new dataset, we quantitatively highlight key\ndisparities between AI methods and scientific problems, revealing substantial\nopportunities for deeper AI integration across scientific disciplines.\nFurthermore, we explore the potential and challenges of facilitating\ncollaboration between AI and scientific communities through the lens of link\nprediction. Our findings and tools aim to promote more impactful\ninterdisciplinary collaborations and accelerate scientific discovery through\ndeeper and broader AI integration. Our code and dataset are available at:\nhttps://github.com/charles-pyj/Bridging-AI-and-Science.\n",
  "subjects": [
    "Computer Science/Artificial Intelligence",
    "Computer Science/Digital Libraries",
    "Computer Science/Information Retrieval"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "UruS36LW6y2cTEgSne0_RGQHux_DG_lHstmnUpMhsXA",
  "pdfSize": "9919186"
}