{
  "id": "2412.01968",
  "title": "On the Theoretical Foundations of Data Exchange Economies",
  "authors": "Hannaneh Akrami, Bhaskar Ray Chaudhury, Jugal Garg, Aniket Murhekar",
  "authorsParsed": [
    [
      "Akrami",
      "Hannaneh",
      ""
    ],
    [
      "Chaudhury",
      "Bhaskar Ray",
      ""
    ],
    [
      "Garg",
      "Jugal",
      ""
    ],
    [
      "Murhekar",
      "Aniket",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 20:55:04 GMT"
    }
  ],
  "updateDate": "2024-12-04",
  "timestamp": 1733172904000,
  "abstract": "  The immense success of ML systems relies heavily on large-scale, high-quality\ndata. The high demand for data has led to many paradigms that involve selling,\nexchanging, and sharing data, motivating the study of economic processes with\ndata as an asset. However, data differs from classical economic assets in terms\nof free duplication: there is no concept of limited supply since it can be\nreplicated at zero marginal cost. This distinction introduces fundamental\ndifferences between economic processes involving data and those concerning\nother assets.\n  We study a parallel to exchange (Arrow-Debreu) markets where data is the\nasset. Here, agents with datasets exchange data fairly and voluntarily, aiming\nfor mutual benefit without monetary compensation. This framework is\nparticularly relevant for non-profit organizations that seek to improve their\nML models through data exchange, yet are restricted from selling their data for\nprofit.\n  We propose a general framework for data exchange, built on two core\nprinciples: (i) fairness, ensuring that each agent receives utility\nproportional to their contribution to others; contributions are quantifiable\nusing standard credit-sharing functions like the Shapley value, and (ii)\nstability, ensuring that no coalition of agents can identify an exchange among\nthemselves which they unanimously prefer to the current exchange. We show that\nfair and stable exchanges exist for all monotone continuous utility functions.\nNext, we investigate the computational complexity of finding approximate fair\nand stable exchanges. We present a local search algorithm for instances with\nmonotone submodular utility functions, where each agent contributions are\nmeasured using the Shapley value. We prove that this problem lies in CLS under\nmild assumptions. Our framework opens up several intriguing theoretical\ndirections for research in data economics.\n",
  "subjects": [
    "Computer Science/Computer Science and Game Theory"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "bXSzNCmNpip0vunZlLjrgeM2kl33EcUI122zrIv3NGo",
  "pdfSize": "469690"
}