{
  "id": "2412.09443",
  "title": "Elastic Modulus Versus Cell Packing Density in MDCK Epithelial\n  Monolayers",
  "authors": "Steven J. Chisolm, Emily Guo, Vignesh Subramaniam, Kyle D. Schulze,\n  Thomas E. Angelini",
  "authorsParsed": [
    [
      "Chisolm",
      "Steven J.",
      ""
    ],
    [
      "Guo",
      "Emily",
      ""
    ],
    [
      "Subramaniam",
      "Vignesh",
      ""
    ],
    [
      "Schulze",
      "Kyle D.",
      ""
    ],
    [
      "Angelini",
      "Thomas E.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 16:57:45 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1734022665000,
  "abstract": "  The elastic moduli of tissues are connected to their states of health and\nfunction. The epithelial monolayer is a simple, minimal, tissue model that is\noften used to gain understanding of mechanical behavior at the cellular or\nmulti-cellular scale. Here we investigate how the elastic modulus of Madin\nDarby Canine Kidney (MDCK) cells depends on their packing density. Rather than\nmeasuring elasticity at the sub-cellular scale with local probes, we\ncharacterize the monolayer at the multi-cellular scale, as one would a thin\nslab of elastic material. We use a micro-indentation system to apply gentle\nforces to the apical side of MDCK monolayers, applying a normal force to\napproximately 100 cells in each experiment. In low-density confluent\nmonolayers, we find that the elastic modulus decreases with increasing cell\ndensity. At high densities, the modulus appears to plateau. This finding will\nhelp guide our understanding of known collective behaviors in epithelial\nmonolayers and other tissues where variations in cell packing density are\ncorrelated with cell motion.\n",
  "subjects": [
    "Condensed Matter/Soft Condensed Matter",
    "Physics/Biological Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "RXTWY5OLdYeOln9ZWj_ZqtZXo5Zq0DE-vQ15-S_BPws",
  "pdfSize": "869588"
}