{
  "id": "2412.04845",
  "title": "Using Machine Learning to Discover Parsimonious and\n  Physically-Interpretable Representations of Catchment-Scale Rainfall-Runoff\n  Dynamics",
  "authors": "Yuan-Heng Wang, Hoshin V. Gupta",
  "authorsParsed": [
    [
      "Wang",
      "Yuan-Heng",
      ""
    ],
    [
      "Gupta",
      "Hoshin V.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 08:30:01 GMT"
    },
    {
      "version": "v2",
      "created": "Thu, 16 Jan 2025 18:48:36 GMT"
    },
    {
      "version": "v3",
      "created": "Fri, 7 Feb 2025 20:54:48 GMT"
    }
  ],
  "updateDate": "2025-02-11",
  "timestamp": 1733473801000,
  "abstract": "  Despite excellent real-world predictive performance of modern machine\nlearning (ML) methods, many scientists hesitate to discard traditional\nphysical-conceptual (PC) approaches due to their relative interpretability,\nwhich contributes to credibility during decision-making. In this context, a\ncurrently underexplored aspect of ML is how to develop minimally-optimal\nrepresentations that can facilitate better insight regarding system\nfunctioning. Regardless of how this is achieved, parsimonious representations\nseem to better support the advancement of scientific understanding. Our own\nview is that ML-based modeling should be based in use of computational units\nthat are fundamentally interpretable by design.\n  This paper continues our exploration of how ML can be exploited in the\nservice of scientific investigation. We use the Mass-Conserving-Perceptron\n(MCP) as the fundamental computational unit in a generic network architecture\nto explore important issues related to the use of observational data for\nconstructing models of dynamical systems. We show, in the context of lumped\ncatchment modeling, that physical interpretability and predictive performance\ncan both be achieved using a relatively parsimonious distributed-state\nmultiple-flow-path network with context-dependent gating and information\nsharing across the nodes, suggesting that MCP-based modeling can play a\nsignificant role in application of ML to geoscientific investigation.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "z7mBmqVQEX3CTgEmF-WtHXJ7v7cvrFJ1dixED5lurMk",
  "pdfSize": "9881124"
}