{
  "id": "2412.03994",
  "title": "Transport Signatures of Radial Rashba Spin-Orbit Coupling at\n  Ferromagnet/Superconductor Interfaces",
  "authors": "Andreas Costa and Jaroslav Fabian",
  "authorsParsed": [
    [
      "Costa",
      "Andreas",
      ""
    ],
    [
      "Fabian",
      "Jaroslav",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 09:14:50 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 18 Feb 2025 12:17:41 GMT"
    }
  ],
  "updateDate": "2025-02-19",
  "timestamp": 1733390090000,
  "abstract": "  Spin-orbit coupling (SOC) emerging at the interfaces of superconducting\nmagnetic tunnel junctions is at the heart of multiple unprecedented physical\nphenomena, covering triplet proximity effects induced by unconventional\n(spin-flip) Andreev reflections, giant transport magnetoanisotropies, sizable\ntunneling anomalous Hall effects, and electrically controlled current-reversing\n$ 0 $--$ \\pi $(-like) transitions in Josephson contacts. Recent\nfirst-principles calculations proposed that the Rashba spin-orbit fields in\ntwisted graphene/transition-metal dichalcogenide and van der Waals multilayers\ncan -- owing to broken mirror symmetries -- exhibit an unconventional radial\ncomponent (with spin parallel to the electron's momentum), which can be\nquantified by the Rashba angle $ \\theta_\\mathrm{R} $. We theoretically explore\nthe ramifications of radial Rashba SOC at the interfaces of vertical\nferromagnet/superconductor tunnel junctions with a focus on the\nmagnetoanisotropies of the tunneling and tunneling-anomalous-Hall-effect\nconductances. Our results demonstrate that $ \\theta_\\mathrm{R} $ can be\nexperimentally extracted from respective magnetization-angle shifts, providing\na robust way to probe the radial Rashba SOC induced by twisted multilayers that\nare placed as tunneling barriers between ferromagnetic and superconducting\nelectrodes.\n",
  "subjects": [
    "Condensed Matter/Superconductivity"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Zr9_sG5HvRAebEOeoOAQ0rJ4Y2yVDKQX7apMfPHe0mQ",
  "pdfSize": "713541"
}