{"id":"2412.10999","title":"Cocoa: Co-Planning and Co-Execution with AI Agents","authors":"K. J. Kevin Feng, Kevin Pu, Matt Latzke, Tal August, Pao Siangliulue,\n  Jonathan Bragg, Daniel S. Weld, Amy X. Zhang, Joseph Chee Chang","authorsParsed":[["Feng","K. J. Kevin",""],["Pu","Kevin",""],["Latzke","Matt",""],["August","Tal",""],["Siangliulue","Pao",""],["Bragg","Jonathan",""],["Weld","Daniel S.",""],["Zhang","Amy X.",""],["Chang","Joseph Chee",""]],"versions":[{"version":"v1","created":"Sat, 14 Dec 2024 23:59:42 GMT"},{"version":"v2","created":"Mon, 13 Jan 2025 21:41:47 GMT"}],"updateDate":"2025-01-15","timestamp":1734220782000,"abstract":"  We present Cocoa, a system that implements a novel interaction design pattern\n-- interactive plans -- for users to collaborate with an AI agent on complex,\nmulti-step tasks in a document editor. Cocoa harmonizes human and AI efforts\nand enables flexible delegation of agency through two actions: Co-planning\n(where users collaboratively compose a plan of action with the agent) and\nCo-execution (where users collaboratively execute plan steps with the agent).\nUsing scientific research as a sample domain, we motivate the design of Cocoa\nthrough a formative study with 9 researchers while also drawing inspiration\nfrom the design of computational notebooks. We evaluate Cocoa through a user\nstudy with 16 researchers and find that when compared to a strong chat\nbaseline, Cocoa improved agent steerability without sacrificing ease of use. A\ndeeper investigation of the general utility of both systems uncovered insights\ninto usage contexts where interactive plans may be more appropriate than chat,\nand vice versa. Our work surfaces numerous practical implications and paves new\npaths for interactive interfaces that foster more effective collaboration\nbetween humans and agentic AI systems.\n","subjects":["Computer Science/Human-Computer Interaction","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"AE2Ha4JwmG1f2-lQUaRZ7vAHEoYZ5IpYhMBEGXC4-ys","pdfSize":"10022074"}