{"id":"2412.06378","title":"Emerging Challenges in Molecular Paleontology: Misapplication of\n  Environmental DNA Fragments and Misconception of Deamination as a Key\n  Criterion for In Situ DNA Identification","authors":"Wan-Qian Zhao, Shu-Jie Zhang, Zhan-Yong Guo, Zeng-Yuan Tian,\n  Gang-Qiang Cao, Mei-Jun Li, Li-You Qiu, Jin-Yu Yang, Yong-Kai Wang, Shu-Hui\n  Zhang, Zhi-Fang Zheng, Min-Zhi Wu","authorsParsed":[["Zhao","Wan-Qian",""],["Zhang","Shu-Jie",""],["Guo","Zhan-Yong",""],["Tian","Zeng-Yuan",""],["Cao","Gang-Qiang",""],["Li","Mei-Jun",""],["Qiu","Li-You",""],["Yang","Jin-Yu",""],["Wang","Yong-Kai",""],["Zhang","Shu-Hui",""],["Zheng","Zhi-Fang",""],["Wu","Min-Zhi",""]],"versions":[{"version":"v1","created":"Mon, 9 Dec 2024 10:56:48 GMT"}],"updateDate":"2024-12-10","timestamp":1733741808000,"abstract":"  This article critically examines the methodologies applied in ancient DNA\n(aDNA) research, particularly those developed by Dr. P\\\"a\\\"abo's team, which\nhave significantly influenced the field. The focus is on the challenges of\ndistinguishing original in situ DNA (oriDNA) from environmental DNA (eDNA)\ncontamination in fossil samples. Recent analyses indicate that even with\nrigorous extraction and sequencing protocols, a considerable amount of eDNA\nremains present, often misinterpreted as oriDNA. This misidentification risks\nthe accuracy of species ascription and evolutionary interpretations derived\nfrom fossil analyses. The paper explores fossil preservation's physical and\nchemical dynamics, which allow eDNA from similar and disparate species to\ninfiltrate bone matrices. We propose enhancements to methodological frameworks,\nsuch as broader BLAST database usage and stringent E-value criteria, to improve\nspecies-specific aDNA identification. Additionally, the article critiques the\nreliance on deamination patterns as a definitive marker for aDNA, suggesting a\nreevaluation of this criterion due to its inconsistency and the potential for\nmisleading sequencing results. Ultimately, our findings advocate for a more\ncautious and refined approach to aDNA research, ensuring more reliable and\nverifiable scientific outcomes\n","subjects":["Quantitative Biology/Genomics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"SQXTZVo4RpLO35M_G1TfeBTY4izei5yQvvSXsmYVPfY","pdfSize":"475445"}