{"id":"2412.07680","title":"BPS Dendroscopy on Local $\\mathbb{P}^1\\times \\mathbb{P}^1$","authors":"Bruno Le Floch, Boris Pioline, Rishi Raj","authorsParsed":[["Floch","Bruno Le",""],["Pioline","Boris",""],["Raj","Rishi",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 17:10:20 GMT"}],"updateDate":"2024-12-11","timestamp":1733850620000,"abstract":"  BPS states in type II string compactified on a Calabi-Yau threefold can\ntypically be decomposed as moduli-dependent bound states of absolutely stable\nconstituents, with a hierarchical structure labelled by attractor flow trees.\nThis decomposition is best understood from the scattering diagram, an\narrangement of real codimension-one loci (or rays) in the space of stability\nconditions where BPS states of given electromagnetic charge and fixed phase of\nthe central charge exist. The consistency of the diagram when rays intersect\ndetermines all BPS indices in terms of the `attractor indices' carried by the\ninitial rays. In this work we study the scattering diagram for a non-compact\ntoric CY threefold known as local $\\mathbb{F}_0$, namely the total space of the\ncanonical bundle over $\\mathbb{P}^1\\times \\mathbb{P}^1$. We first construct the\nscattering diagram for the quiver, valid near the orbifold point, and for the\nlarge volume slice, valid when both $\\mathbb{P}^1$'s have large (and nearly\nequal) area. We then combine the insights gained from these simple limits to\nconstruct the scattering diagram along the physical slice of $\\Pi$-stability\nconditions, which carries an action of a $\\mathbb{Z}^4$ extension of the\nmodular group $\\Gamma_0(4)$. We sketch a proof of the Split Attractor Flow Tree\nConjecture in this example, albeit for a restricted range of the central charge\nphase. Most arguments are similar to our early study of local $\\mathbb{P}^2$\n[arXiv:2210.10712], but complicated by the occurence of an extra mass parameter\nand ramification points on the $\\Pi$-stability slice.\n","subjects":["Physics/High Energy Physics - Theory","Mathematics/Algebraic Geometry"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"TJmDlPWp2iKYW-Pr7rGvrsFlAINXnWzSRJyGEQo9zn8","pdfSize":"8889631"}