{
  "id": "2412.13299",
  "title": "In-context learning for medical image segmentation",
  "authors": "Eichi Takaya and Shinnosuke Yamamoto",
  "authorsParsed": [
    [
      "Takaya",
      "Eichi",
      ""
    ],
    [
      "Yamamoto",
      "Shinnosuke",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 19:59:08 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734465548000,
  "abstract": "  Annotation of medical images, such as MRI and CT scans, is crucial for\nevaluating treatment efficacy and planning radiotherapy. However, the extensive\nworkload of medical professionals limits their ability to annotate large image\ndatasets, posing a bottleneck for AI applications in medical imaging. To\naddress this, we propose In-context Cascade Segmentation (ICS), a novel method\nthat minimizes annotation requirements while achieving high segmentation\naccuracy for sequential medical images. ICS builds on the UniverSeg framework,\nwhich performs few-shot segmentation using support images without additional\ntraining. By iteratively adding the inference results of each slice to the\nsupport set, ICS propagates information forward and backward through the\nsequence, ensuring inter-slice consistency. We evaluate the proposed method on\nthe HVSMR dataset, which includes segmentation tasks for eight cardiac regions.\nExperimental results demonstrate that ICS significantly improves segmentation\nperformance in complex anatomical regions, particularly in maintaining boundary\nconsistency across slices, compared to baseline methods. The study also\nhighlights the impact of the number and position of initial support slices on\nsegmentation accuracy. ICS offers a promising solution for reducing annotation\nburdens while delivering robust segmentation results, paving the way for its\nbroader adoption in clinical and research applications.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Image and Video Processing",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "gsB42WG6XxHhMWxvWnx7whSNRkGvqH4wh3yaO1LO2iM",
  "pdfSize": "1371981"
}