{
  "id": "2412.19741",
  "title": "Physics of 2D magnets and magnetic thin films: Surface structure and\n  surface phase transition, criticality and skyrmions",
  "authors": "Hung T. Diep",
  "authorsParsed": [
    [
      "Diep",
      "Hung T.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 27 Dec 2024 17:06:31 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735319191000,
  "abstract": "  Recently, there is an increasing renewed interest in 2D magnetism such as Van\nder Waals magnets. The physics of 2D magnetism and ultra-thin magnetic films\nhas a long history. This chapter is a review devoted to some fundamental\ntheoretical properties of 2D magnets and and magnetic thin films including\nfrustrated systems and topological spin textures. These properties allow to\nunderstand macroscopic behaviors experimentally observed in thin films and\nsuperlattices where the surface and the interface play a crucial role. The\nchapter begins with a review on 2D magnets, their spin structures and phase\ntransitions. Next, the case of thin films is considered. The theory of surface\nspin waves is discussed in various situations with and without surface\nreconstruction of spin ordering. Various interactions are taken into account:\nsurface interaction different from the bulk one, competing interactions,\nDzyaloshinskii-Moriya interaction. Surface phase transitions are shown in some\nparticularly striking cases. Finally, some cases of topological spin textures\ncalled \"skyrmions\" are reviewed. All the results shown in this chapter have\nbeen published in various research papers cited in the text. Therefore, we will\ndiscuss some important results but avoid to enter complicated methods. Instead,\nthe reader is referred to original papers for detailed demonstrations.\n",
  "subjects": [
    "Condensed Matter/Statistical Mechanics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Pn3tNhQ1pdtIsTXxRZAUKvKjeUWhJ_MNhpxcbg6-dM8",
  "pdfSize": "1584259"
}