{
  "id": "2412.16825",
  "title": "SoK: Usability Studies in Differential Privacy",
  "authors": "Onyinye Dibia, Brad Stenger, Steven Baldasty, Mako Bates, Ivoline C.\n  Ngong, Yuanyuan Feng, Joseph P. Near",
  "authorsParsed": [
    [
      "Dibia",
      "Onyinye",
      ""
    ],
    [
      "Stenger",
      "Brad",
      ""
    ],
    [
      "Baldasty",
      "Steven",
      ""
    ],
    [
      "Bates",
      "Mako",
      ""
    ],
    [
      "Ngong",
      "Ivoline C.",
      ""
    ],
    [
      "Feng",
      "Yuanyuan",
      ""
    ],
    [
      "Near",
      "Joseph P.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 22 Dec 2024 02:21:57 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734834117000,
  "abstract": "  Differential Privacy (DP) has emerged as a pivotal approach for safeguarding\nindividual privacy in data analysis, yet its practical adoption is often\nhindered by challenges in usability in implementation and communication of the\nprivacy protection levels. This paper presents a comprehensive systematization\nof existing research on the usability of and communication about DP,\nsynthesizing insights from studies on both the practical use of DP tools and\nstrategies for conveying DP parameters that determine the privacy protection\nlevels such as epsilon. By reviewing and analyzing these studies, we identify\ncore usability challenges, best practices, and critical gaps in current DP\ntools that affect adoption across diverse user groups, including developers,\ndata analysts, and non-technical stakeholders. Our analysis highlights\nactionable insights and pathways for future research that emphasizes\nuser-centered design and clear communication, fostering the development of more\naccessible DP tools that meet practical needs and support broader adoption.\n",
  "subjects": [
    "Computer Science/Human-Computer Interaction",
    "Computer Science/Cryptography and Security"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "fZfyEAOQC394RZMHNyWqtYWswTKyZgPEw5nu2l0UKuw",
  "pdfSize": "307954"
}