{"id":"2412.21143","title":"Systematic Benchmarking of Macrosegregation: The Performance of a\n  Modified Hybrid Model","authors":"Ali Moeinirad and Ehsan Amani","authorsParsed":[["Moeinirad","Ali",""],["Amani","Ehsan",""]],"versions":[{"version":"v1","created":"Mon, 30 Dec 2024 18:19:51 GMT"}],"updateDate":"2024-12-31","timestamp":1735582791000,"abstract":"  Recently, a new alloy solidification benchmark, called AFRODITE, with\nwell-defined setups and state-of-the-art measurements has emerged, enabling a\nthorough assessment of MacroSegregation (MS) solvers, particularly in terms of\ntheir ability to predict different features of MS maps. In this research, we\nfirst develop an analytical solution for the alloy-solidification Stefan\nproblem, which involves melt, solid, and mushy regions. This new analytical\nsolution extends a previous solution (S. Cho and J. Sunderland,\n\"Heat-conduction problems with melting or freezing\", J. Heat Transfer, vol. 91,\npp. 421-426, 1969) by incorporating a linear microsegregation law as a function\nof temperature in place of spatial coordinate. Then, we adopt this solution to\nverify an OpenFOAM MS solver in a limiting condition, where only heat diffusion\nis present. Subsequently, to capture the MS map of the Sn-3%Pb AFRODITE\nbenchmark, the solver is incorporated using the standard Blake-Kozeny-Carman\npermeability law and one of its hybrid variants, slightly modified in this work\nto better align with physics by ensuring a continuous transition of\ncharacteristics from the slurry to the porous regions of the mush. It is\ndemonstrated that the hybrid model predicts the main features of the MS map,\nincluding the channel segregates morphology and peak segregation degree due to\nthe pile-up effect, in much finer agreement with the experimental observation.\nCareful analyses of the results reveal that these improved predictions stem\nfrom the hybrid model's more accurate estimation of the re-melting, melt flow\nadvection parallel, and advection normal to the solidification front.\n","subjects":["Physics/Fluid Dynamics","Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"U7HW5JA9MI3FdB7jACHRbMteh2lROHqPTsXZOH7_U5E","pdfSize":"3179034"}