{
  "id": "2412.15239",
  "title": "Modeling Story Expectations to Understand Engagement: A Generative\n  Framework Using LLMs",
  "authors": "Hortense Fong and George Gui",
  "authorsParsed": [
    [
      "Fong",
      "Hortense",
      ""
    ],
    [
      "Gui",
      "George",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 04:53:34 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734065614000,
  "abstract": "  Understanding when and why consumers engage with stories is crucial for\ncontent creators and platforms. While existing theories suggest that audience\nbeliefs of what is going to happen should play an important role in engagement\ndecisions, empirical work has mostly focused on developing techniques to\ndirectly extract features from actual content, rather than capturing\nforward-looking beliefs, due to the lack of a principled way to model such\nbeliefs in unstructured narrative data. To complement existing feature\nextraction techniques, this paper introduces a novel framework that leverages\nlarge language models to model audience forward-looking beliefs about how\nstories might unfold. Our method generates multiple potential continuations for\neach story and extracts features related to expectations, uncertainty, and\nsurprise using established content analysis techniques. Applying our method to\nover 30,000 book chapters from Wattpad, we demonstrate that our framework\ncomplements existing feature engineering techniques by amplifying their\nmarginal explanatory power on average by 31%. The results reveal that different\ntypes of engagement-continuing to read, commenting, and voting-are driven by\ndistinct combinations of current and anticipated content features. Our\nframework provides a novel way to study and explore how audience\nforward-looking beliefs shape their engagement with narrative media, with\nimplications for marketing strategy in content-focused industries.\n",
  "subjects": [
    "Computer Science/Computation and Language",
    "Computer Science/Artificial Intelligence",
    "Economics/General Economics",
    "Quantitative Finance/Economics",
    "Statistics/Methodology"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "0uDPs1jmHxWAeeT6vGskxKQ_gBUkwdMnEOCH98cpkr0",
  "pdfSize": "279865"
}