{"id":"2412.13428","title":"Magnifier: Detecting Network Access via Lightweight Traffic-based\n  Fingerprints","authors":"Wenhao Li, Qiang Wang, Huaifeng Bao, Xiao-Yu Zhang, Lingyun Ying and\n  Zhaoxuan Li","authorsParsed":[["Li","Wenhao",""],["Wang","Qiang",""],["Bao","Huaifeng",""],["Zhang","Xiao-Yu",""],["Ying","Lingyun",""],["Li","Zhaoxuan",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 01:45:07 GMT"}],"updateDate":"2024-12-19","timestamp":1734486307000,"abstract":"  Network access detection plays a crucial role in global network management,\nenabling efficient network monitoring and topology measurement by identifying\nunauthorized network access and gathering detailed information about mobile\ndevices. Existing methods for endpoint-based detection primarily rely on\ndeploying monitoring software to recognize network connections. However, the\nchallenges associated with developing and maintaining such systems have limited\ntheir universality and coverage in practical deployments, especially given the\ncost implications of covering a wide array of devices with heterogeneous\noperating systems. To tackle the issues, we propose Magnifier for mobile device\nnetwork access detection that, for the first time, passively infers access\npatterns from backbone traffic at the gateway level. Magnifier's foundation is\nthe creation of device-specific access patterns using the innovative Domain\nName Forest (dnForest) fingerprints. We then employ a two-stage distillation\nalgorithm to fine-tune the weights of individual Domain Name Trees (dnTree)\nwithin each dnForest, emphasizing the unique device fingerprints. With these\nmeticulously crafted fingerprints, Magnifier efficiently infers network access\nfrom backbone traffic using a lightweight fingerprint matching algorithm. Our\nexperimental results, conducted in real-world scenarios, demonstrate that\nMagnifier exhibits exceptional universality and coverage in both initial and\nrepetitive network access detection in real-time. To facilitate further\nresearch, we have thoughtfully curated the NetCess2023 dataset, comprising\nnetwork access data from 26 different models across 7 brands, covering the\nmajority of mainstream mobile devices. We have also made both the Magnifier\nprototype and the NetCess2023 dataset publicly\navailable\\footnote{https://github.com/SecTeamPolaris/Magnifier}.\n","subjects":["Computer Science/Networking and Internet Architecture","Computer Science/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"QxPUPBjp-O1X8UaZ1dRVUCDFnS7L939ZaURAxjquI58","pdfSize":"2756291"}