{
  "id": "2412.14494",
  "title": "Drive-1-to-3: Enriching Diffusion Priors for Novel View Synthesis of\n  Real Vehicles",
  "authors": "Chuang Lin, Bingbing Zhuang, Shanlin Sun, Ziyu Jiang, Jianfei Cai,\n  Manmohan Chandraker",
  "authorsParsed": [
    [
      "Lin",
      "Chuang",
      ""
    ],
    [
      "Zhuang",
      "Bingbing",
      ""
    ],
    [
      "Sun",
      "Shanlin",
      ""
    ],
    [
      "Jiang",
      "Ziyu",
      ""
    ],
    [
      "Cai",
      "Jianfei",
      ""
    ],
    [
      "Chandraker",
      "Manmohan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 03:39:13 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734579553000,
  "abstract": "  The recent advent of large-scale 3D data, e.g. Objaverse, has led to\nimpressive progress in training pose-conditioned diffusion models for novel\nview synthesis. However, due to the synthetic nature of such 3D data, their\nperformance drops significantly when applied to real-world images. This paper\nconsolidates a set of good practices to finetune large pretrained models for a\nreal-world task -- harvesting vehicle assets for autonomous driving\napplications. To this end, we delve into the discrepancies between the\nsynthetic data and real driving data, then develop several strategies to\naccount for them properly. Specifically, we start with a virtual camera\nrotation of real images to ensure geometric alignment with synthetic data and\nconsistency with the pose manifold defined by pretrained models. We also\nidentify important design choices in object-centric data curation to account\nfor varying object distances in real driving scenes -- learn across varying\nobject scales with fixed camera focal length. Further, we perform\nocclusion-aware training in latent spaces to account for ubiquitous occlusions\nin real data, and handle large viewpoint changes by leveraging a symmetric\nprior. Our insights lead to effective finetuning that results in a $68.8\\%$\nreduction in FID for novel view synthesis over prior arts.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "9wv3SKOR7TJqr8X77GEvJqPKYYWaPe_lMGNOm4pfqog",
  "pdfSize": "5168495"
}