{
  "id": "2412.01306",
  "title": "Multimodal Medical Disease Classification with LLaMA II",
  "authors": "Christian Gapp, Elias Tappeiner, Martin Welk, Rainer Schubert",
  "authorsParsed": [
    [
      "Gapp",
      "Christian",
      ""
    ],
    [
      "Tappeiner",
      "Elias",
      ""
    ],
    [
      "Welk",
      "Martin",
      ""
    ],
    [
      "Schubert",
      "Rainer",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 09:18:07 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733131087000,
  "abstract": "  Medical patient data is always multimodal. Images, text, age, gender,\nhistopathological data are only few examples for different modalities in this\ncontext. Processing and integrating this multimodal data with deep learning\nbased methods is of utmost interest due to its huge potential for medical\nprocedure such as diagnosis and patient treatment planning. In this work we\nretrain a multimodal transformer-based model for disease classification. To\nthis end we use the text-image pair dataset from OpenI consisting of 2D chest\nX-rays associated with clinical reports. Our focus is on fusion methods for\nmerging text and vision information extracted from medical datasets. Different\narchitecture structures with a LLaMA II backbone model are tested. Early fusion\nof modality specific features creates better results with the best model\nreaching 97.10% mean AUC than late fusion from a deeper level of the\narchitecture (best model: 96.67% mean AUC). Both outperform former\nclassification models tested on the same multimodal dataset. The newly\nintroduced multimodal architecture can be applied to other multimodal datasets\nwith little effort and can be easily adapted for further research, especially,\nbut not limited to, the field of medical AI.\n",
  "subjects": [
    "Computer Science/Artificial Intelligence",
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "jqHGDjuSmh4ji0Brw99uoHFnJf4xGMtrqch4uikp72A",
  "pdfSize": "1491511"
}