{
  "id": "2412.17682",
  "title": "Tailoring the properties of the 2D ferromagnet CrSBr by lanthanide\n  doping",
  "authors": "Sourav Dey, Dorye L. Esteras and Jos\\'e J. Baldov\\'i",
  "authorsParsed": [
    [
      "Dey",
      "Sourav",
      ""
    ],
    [
      "Esteras",
      "Dorye L.",
      ""
    ],
    [
      "Baldoví",
      "José J.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 16:08:07 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734970087000,
  "abstract": "  The growing interest in 2D van der Waals (vdW) magnetic materials stems from\ntheir unique properties and potential applications in spintronics, magnonics\nand quantum information technologies. Among them, CrSBr is a semiconductor that\nstands out, owing to its high Curie temperature (TC ~ 146 K), air stability and\ntunable electronic and magnetic properties. Here, we present a systematic\ninvestigation of the effects of Dy doping (12.5%, 25%, and 50%) on the\nstructural, electronic and magnetic properties of CrSBr monolayer. Our results\nreveal that Dy incorporation enhances magnetic anisotropy, modulates TC, and\ncan create quasi-1D ferromagnetic chains that arise from competing\nferromagnetic and antiferromagnetic interactions. Additionally, we investigate\nthe properties of DySBr, DySI and DySeI monolayers, which are isostructural to\nthe CrSBr. Our results reveal the feasibility of exfoliating them down to the\nsingle-layer and the presence of long-range magnetic order at low temperatures,\nrelying on the combination of both weak exchange interactions and large\nspin-orbit coupling. This work provides insights into tuning the properties of\nCrSBr through rare earth doping, unlocking new possibilities for advanced\napplications at the 2D limit.\n",
  "subjects": [
    "Condensed Matter/Materials Science",
    "Condensed Matter/Mesoscale and Nanoscale Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "6ZZa9nVjzGLW7KdtJe3FOLRhvEOB6SBxwo28RN2xvVM",
  "pdfSize": "3269790"
}