{
  "id": "2412.17375",
  "title": "A Room to Roam: Reset Prediction Based on Physical Object Placement for\n  Redirected Walking",
  "authors": "Sulim Chun, Ho Jung Lee, In-Kwon Lee",
  "authorsParsed": [
    [
      "Chun",
      "Sulim",
      ""
    ],
    [
      "Lee",
      "Ho Jung",
      ""
    ],
    [
      "Lee",
      "In-Kwon",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 08:21:33 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734942093000,
  "abstract": "  In Redirected Walking (RDW), resets are an overt method that explicitly\ninterrupts users, and they should be avoided to provide a quality user\nexperience. The number of resets depends on the configuration of the physical\nenvironment; thus, inappropriate object placement can lead to frequent resets,\ncausing motion sickness and degrading presence. However, estimating the number\nof resets based on the physical layout is challenging. It is difficult to\nmeasure reset frequency with real users repeatedly testing different layouts,\nand virtual simulations offer limited real-time verification. As a result,\nwhile rearranging objects can reduce resets, users have not been able to fully\ntake advantage of this opportunity, highlighting the need for rapid assessment\nof object placement. To address this, in Study 1, we collected simulation data\nand analyzed the average number of resets for various object placements. In\nstudy 2, we developed a system that allows users to evaluate reset frequency\nusing a real-time placement interface powered by the first learning-based reset\nprediction model. Our model predicts resets from top-down views of the physical\nspace, leveraging a Vision Transformer architecture. The model achieved a root\nmean square error (RMSE) of $23.88$. We visualized the model's attention scores\nusing heatmaps to analyze the regions of focus during prediction. Through the\ninterface, users can reorganize furniture while instantly observing the change\nin the predicted number of resets, thus improving their interior for a better\nRDW experience with fewer resets.\n",
  "subjects": [
    "Computer Science/Human-Computer Interaction"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "ow2LhRn7YrraTu4GyxHYnFjFfQ7GIIVYkveHpS-VsIk",
  "pdfSize": "7522076"
}