{"id":"2412.04247","title":"3D Part Segmentation via Geometric Aggregation of 2D Visual Features","authors":"Marco Garosi, Riccardo Tedoldi, Davide Boscaini, Massimiliano Mancini,\n  Nicu Sebe, Fabio Poiesi","authorsParsed":[["Garosi","Marco",""],["Tedoldi","Riccardo",""],["Boscaini","Davide",""],["Mancini","Massimiliano",""],["Sebe","Nicu",""],["Poiesi","Fabio",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 15:27:58 GMT"},{"version":"v2","created":"Wed, 8 Jan 2025 09:18:03 GMT"}],"updateDate":"2025-01-09","timestamp":1733412478000,"abstract":"  Supervised 3D part segmentation models are tailored for a fixed set of\nobjects and parts, limiting their transferability to open-set, real-world\nscenarios. Recent works have explored vision-language models (VLMs) as a\npromising alternative, using multi-view rendering and textual prompting to\nidentify object parts. However, naively applying VLMs in this context\nintroduces several drawbacks, such as the need for meticulous prompt\nengineering, and fails to leverage the 3D geometric structure of objects. To\naddress these limitations, we propose COPS, a COmprehensive model for Parts\nSegmentation that blends the semantics extracted from visual concepts and 3D\ngeometry to effectively identify object parts. COPS renders a point cloud from\nmultiple viewpoints, extracts 2D features, projects them back to 3D, and uses a\nnovel geometric-aware feature aggregation procedure to ensure spatial and\nsemantic consistency. Finally, it clusters points into parts and labels them.\nWe demonstrate that COPS is efficient, scalable, and achieves zero-shot\nstate-of-the-art performance across five datasets, covering synthetic and\nreal-world data, texture-less and coloured objects, as well as rigid and\nnon-rigid shapes. The code is available at https://3d-cops.github.io.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7-fZctxkl0V58--TiZ74XZiJAYgk4PfMq9i6BiWDxLc","pdfSize":"11161943"}