{
  "id": "2412.03472",
  "title": "Measure Anything: Real-time, Multi-stage Vision-based Dimensional\n  Measurement using Segment Anything",
  "authors": "Yongkyu Lee, Shivam Kumar Panda, Wei Wang, Mohammad Khalid Jawed",
  "authorsParsed": [
    [
      "Lee",
      "Yongkyu",
      ""
    ],
    [
      "Panda",
      "Shivam Kumar",
      ""
    ],
    [
      "Wang",
      "Wei",
      ""
    ],
    [
      "Jawed",
      "Mohammad Khalid",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 16:59:44 GMT"
    }
  ],
  "updateDate": "2024-12-05",
  "timestamp": 1733331584000,
  "abstract": "  We present Measure Anything, a comprehensive vision-based framework for\ndimensional measurement of objects with circular cross-sections, leveraging the\nSegment Anything Model (SAM). Our approach estimates key geometric features --\nincluding diameter, length, and volume -- for rod-like geometries with varying\ncurvature and general objects with constant skeleton slope. The framework\nintegrates segmentation, mask processing, skeleton construction, and 2D-3D\ntransformation, packaged in a user-friendly interface. We validate our\nframework by estimating the diameters of Canola stems -- collected from\nagricultural fields in North Dakota -- which are thin and non-uniform, posing\nchallenges for existing methods. Measuring its diameters is critical, as it is\na phenotypic traits that correlates with the health and yield of Canola crops.\nThis application also exemplifies the potential of Measure Anything, where\nintegrating intelligent models -- such as keypoint detection -- extends its\nscalability to fully automate the measurement process for high-throughput\napplications. Furthermore, we showcase its versatility in robotic grasping,\nleveraging extracted geometric features to identify optimal grasp points.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "TTRMgHiI9VhbkD3Z1afoIHKXwvfhMWzXIKIHxtLkzGI",
  "pdfSize": "3627824"
}