{
  "id": "2412.04254",
  "title": "CLINICSUM: Utilizing Language Models for Generating Clinical Summaries\n  from Patient-Doctor Conversations",
  "authors": "Subash Neupane, Himanshu Tripathi, Shaswata Mitra, Sean Bozorgzad,\n  Sudip Mittal, Shahram Rahimi, and Amin Amirlatifi",
  "authorsParsed": [
    [
      "Neupane",
      "Subash",
      ""
    ],
    [
      "Tripathi",
      "Himanshu",
      ""
    ],
    [
      "Mitra",
      "Shaswata",
      ""
    ],
    [
      "Bozorgzad",
      "Sean",
      ""
    ],
    [
      "Mittal",
      "Sudip",
      ""
    ],
    [
      "Rahimi",
      "Shahram",
      ""
    ],
    [
      "Amirlatifi",
      "Amin",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 15:34:02 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733412842000,
  "abstract": "  This paper presents ClinicSum, a novel framework designed to automatically\ngenerate clinical summaries from patient-doctor conversations. It utilizes a\ntwo-module architecture: a retrieval-based filtering module that extracts\nSubjective, Objective, Assessment, and Plan (SOAP) information from\nconversation transcripts, and an inference module powered by fine-tuned\nPre-trained Language Models (PLMs), which leverage the extracted SOAP data to\ngenerate abstracted clinical summaries. To fine-tune the PLM, we created a\ntraining dataset of consisting 1,473 conversations-summaries pair by\nconsolidating two publicly available datasets, FigShare and MTS-Dialog, with\nground truth summaries validated by Subject Matter Experts (SMEs). ClinicSum's\neffectiveness is evaluated through both automatic metrics (e.g., ROUGE,\nBERTScore) and expert human assessments. Results show that ClinicSum\noutperforms state-of-the-art PLMs, demonstrating superior precision, recall,\nand F-1 scores in automatic evaluations and receiving high preference from SMEs\nin human assessment, making it a robust solution for automated clinical\nsummarization.\n",
  "subjects": [
    "Computer Science/Computation and Language",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "sWzQrsULHbbYtGmFtb-E0VtOaXu-SvhgQlsk0-laJuE",
  "pdfSize": "533132"
}