{"id":"2412.10563","title":"Augmented two-stage estimation for treatment crossover in oncology\n  trials: Leveraging external data for improved precision","authors":"Harlan Campbell, Nicholas Latimer, Jeroen P Jansen, Shannon Cope","authorsParsed":[["Campbell","Harlan",""],["Latimer","Nicholas",""],["Jansen","Jeroen P",""],["Cope","Shannon",""]],"versions":[{"version":"v1","created":"Fri, 13 Dec 2024 21:08:23 GMT"},{"version":"v2","created":"Mon, 10 Feb 2025 23:15:58 GMT"}],"updateDate":"2025-02-12","timestamp":1734124103000,"abstract":"  Randomized controlled trials (RCTs) in oncology often allow control group\nparticipants to crossover to experimental treatments, a practice that, while\noften ethically necessary, complicates the accurate estimation of long-term\ntreatment effects. When crossover rates are high or sample sizes are limited,\ncommonly used methods for crossover adjustment (such as the rank-preserving\nstructural failure time model, inverse probability of censoring weights, and\ntwo-stage estimation (TSE)) may produce imprecise estimates. Real-world data\n(RWD) can be used to develop an external control arm for the RCT, although this\napproach ignores evidence from trial subjects who did not crossover and ignores\nevidence from the data obtained prior to crossover for those subjects who did.\nThis paper introduces ''augmented two-stage estimation'' (ATSE), a method that\ncombines data from non-switching participants in a RCT with an external\ndataset, forming a ''hybrid non-switching arm''. With a simulation study, we\nevaluate the ATSE method's performance compared to TSE crossover adjustment and\nan external control arm approach. Results indicate that performance is\ndependent on scenario characteristics, but when unconfounded external data are\navailable, ATSE may result in less bias and improved precision compared to TSE\nand external control arm approaches. When external data are affected by\nunmeasured confounding, ATSE becomes prone to bias, but to a lesser extent\ncompared to an external control arm approach.\n","subjects":["Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"SINvf_4QveOkMTjgfUYpbCH2FlEl8ysL2GN5dLVzqi0","pdfSize":"679964"}