{"id":"2412.04734","title":"Sensing-Aided 6G Drone Communications: Real-World Datasets and\n  Demonstration","authors":"Gouranga Charan and Ahmed Alkhateeb","authorsParsed":[["Charan","Gouranga",""],["Alkhateeb","Ahmed",""]],"versions":[{"version":"v1","created":"Fri, 6 Dec 2024 02:50:36 GMT"}],"updateDate":"2024-12-09","timestamp":1733453436000,"abstract":"  In the advent of next-generation wireless communication, millimeter-wave\n(mmWave) and terahertz (THz) technologies are pivotal for their high data rate\ncapabilities. However, their reliance on large antenna arrays and narrow\ndirective beams for ensuring adequate receive signal power introduces\nsignificant beam training overheads. This becomes particularly challenging in\nsupporting highly-mobile applications such as drone communication, where the\ndynamic nature of drones demands frequent beam alignment to maintain\nconnectivity. Addressing this critical bottleneck, our paper introduces a novel\nmachine learning-based framework that leverages multi-modal sensory data,\nincluding visual and positional information, to expedite and refine mmWave/THz\nbeam prediction. Unlike conventional approaches that solely depend on\nexhaustive beam training methods, our solution incorporates additional layers\nof contextual data to accurately predict beam directions, significantly\nmitigating the training overhead. Additionally, our framework is capable of\npredicting future beam alignments ahead of time. This feature enhances the\nsystem's responsiveness and reliability by addressing the challenges posed by\nthe drones' mobility and the computational delays encountered in real-time\nprocessing. This capability for advanced beam tracking asserts a critical\nadvancement in maintaining seamless connectivity for highly-mobile drones. We\nvalidate our approach through comprehensive evaluations on a unique, real-world\nmmWave drone communication dataset, which integrates concurrent camera visuals,\npractical GPS coordinates, and mmWave beam training data...\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computer Science/Information Theory","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"uE4JSpSagUX2HRCekmdR3SokZ8c0FZTcpRgUxrpbmr0","pdfSize":"8626385"}