{
  "id": "2412.15083",
  "title": "Assessing the viability of non-light water reactor concepts for\n  electricity and heat generation in decarbonized energy systems",
  "authors": "Alexander Wimmers, Fanny B\\\"ose, Leonard G\\\"oke",
  "authorsParsed": [
    [
      "Wimmers",
      "Alexander",
      ""
    ],
    [
      "Böse",
      "Fanny",
      ""
    ],
    [
      "Göke",
      "Leonard",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 17:29:14 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734629354000,
  "abstract": "  Recent pledges to triple global nuclear capacity by 2050 suggest a \"nuclear\nrenaissance,\" bolstered by reactor concepts such as sodium-cooled fast\nreactors, high-temperature reactors, and molten salt reactors. These\ntechnologies claim to address the challenges of today's high-capacity\nlight-water reactors, i.e., cost overruns, delays, and social acceptance, while\nalso offering additional non-electrical applications. However, this analysis\nreveals that none of these concepts currently meet the prerequisites of\naffordability, competitiveness, or commercial availability. We omit social\nacceptability. The cost analysis reveals optimistic FOAK cost assumptions of\n5,623 to 9,511 USD per kW, and NOAK cost projections as low as 1,476 USD per\nkW. At FOAK cost, the applied energy system model includes no nuclear power\ncapacity, and thus indicates that significant cost reductions would be required\nfor these technologies to contribute to energy system decarbonization. In\nlow-cost scenarios, reactors capable of producing high temperature heat become\ncompetitive with other low-carbon technologies. We conclude that, for reactor\ncapacties to increase significantly, a focus on certain technology lines ist\nnecessary. However, until a concept becomes viable and commercially available,\npolicymakers should prioritize existing technologies to decarbonize energy\nsystems.\n",
  "subjects": [
    "Economics/General Economics",
    "Quantitative Finance/Economics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "euGHFVl3tmJbuFW9IqCqLJzRXolp2uJrLE1aTWCfotw",
  "pdfSize": "13060126"
}