{
  "id": "2412.06709",
  "title": "Parkinson's Disease Diagnosis Through Deep Learning: A Novel LSTM-Based\n  Approach for Freezing of Gait Detection",
  "authors": "Aqib Nazir Mir, Iqra Nissar, Mumtaz Ahmed, Sarfaraz Masood, Danish\n  Raza Rizvi",
  "authorsParsed": [
    [
      "Mir",
      "Aqib Nazir",
      ""
    ],
    [
      "Nissar",
      "Iqra",
      ""
    ],
    [
      "Ahmed",
      "Mumtaz",
      ""
    ],
    [
      "Masood",
      "Sarfaraz",
      ""
    ],
    [
      "Rizvi",
      "Danish Raza",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 17:58:24 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733767104000,
  "abstract": "  Deep learning holds tremendous potential in healthcare for uncovering hidden\npatterns within extensive clinical datasets, aiding in the diagnosis of various\ndiseases. Parkinson's disease (PD) is a neurodegenerative condition\ncharacterized by the deterioration of brain function. In the initial stages of\nPD, automatic diagnosis poses a challenge due to the similarity in behavior\nbetween individuals with PD and those who are healthy. Our objective is to\npropose an effective model that can aid in the early detection of Parkinson's\ndisease. We employed the VGRF gait signal dataset sourced from Physionet for\ndistinguishing between healthy individuals and those diagnosed with Parkinson's\ndisease. This paper introduces a novel deep learning architecture based on the\nLSTM network for automatically detecting freezing of gait episodes in\nParkinson's disease patients. In contrast to conventional machine learning\nalgorithms, this method eliminates manual feature engineering and proficiently\ncaptures prolonged temporal dependencies in gait patterns, thereby improving\nthe diagnosis of Parkinson's disease. The LSTM network resolves the issue of\nvanishing gradients by employing memory blocks in place of self-connected\nhidden units, allowing for optimal information assimilation. To prevent\noverfitting, dropout and L2 regularization techniques have been employed.\nAdditionally, the stochastic gradient-based optimizer Adam is used for the\noptimization process. The results indicate that our proposed approach surpasses\ncurrent state-of-the-art models in FOG episode detection, achieving an accuracy\nof 97.71%, sensitivity of 99%, precision of 98%, and specificity of 96%. This\ndemonstrates its potential as a superior classification method for Parkinson's\ndisease detection.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "YoXnsAoBHM6sKYZju9QciwPhsBSHSXr8gdo-3NsxSHI",
  "pdfSize": "788076"
}