{
  "id": "2412.06475",
  "title": "Instabilities govern the low-frequency vibrational spectrum of amorphous\n  solids",
  "authors": "Surajit Chakraborty, Roshan Maharana, Smarajit Karmakar, Kabir Ramola",
  "authorsParsed": [
    [
      "Chakraborty",
      "Surajit",
      ""
    ],
    [
      "Maharana",
      "Roshan",
      ""
    ],
    [
      "Karmakar",
      "Smarajit",
      ""
    ],
    [
      "Ramola",
      "Kabir",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 13:24:14 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733750654000,
  "abstract": "  Amorphous solids exhibit an excess of low-frequency vibrational modes beyond\nthe Debye prediction, contributing to their anomalous mechanical and thermal\nproperties. Although a $\\omega^4$ power-law scaling is often proposed for the\ndistribution of these modes, the precise exponent remains a subject of debate.\nIn this study, we demonstrate that boundary-condition-induced instabilities\nplay a key role in this variability. We identify two distinct types of elastic\nbranches that differ in the nature of their energy landscape: Fictitious\nbranches, where shear minima cannot be reached through elastic deformation\nalone and require plastic instabilities, and True branches, where elastic\ndeformation can access these minima. Configurations on Fictitious branches show\na vibrational density of states (VDoS) scaling as $D(\\omega) \\sim \\omega^3$,\nwhile those on True elastic branches under simple and pure shear deformations\nexhibit a scaling of $D(\\omega) \\sim \\omega^{5.5}$. Ensemble averaging over\nboth types of branches results in a VDoS scaling of $D(\\omega) \\sim \\omega^4$.\nAdditionally, solids relaxed to their shear minima, with no residual shear\nstress, display a steeper scaling of $D(\\omega) \\sim \\omega^{6.5}$ in both two\nand three dimensions. We propose two limiting behaviors for amorphous solids:\nif the system size is increased without addressing instabilities, the\nlow-frequency VDoS scales with an exponent close to $3$. Conversely, by\nremoving residual shear stress before considering large system sizes, the VDoS\nscales as $D(\\omega) \\sim \\omega^{6.5}$.\n",
  "subjects": [
    "Condensed Matter/Soft Condensed Matter",
    "Condensed Matter/Disordered Systems and Neural Networks"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "_hiJBt7WVGokeX89dzpBjpPp9EdBj4WoM4XC3bQy8SI",
  "pdfSize": "1988813"
}