{
  "id": "2412.09578",
  "title": "DISHONEST: Dissecting misInformation Spread using Homogeneous sOcial\n  NEtworks and Semantic Topic classification",
  "authors": "Caleb Stam, Emily Saldanha, Mahantesh Halappanavar, Anurag Acharya",
  "authorsParsed": [
    [
      "Stam",
      "Caleb",
      ""
    ],
    [
      "Saldanha",
      "Emily",
      ""
    ],
    [
      "Halappanavar",
      "Mahantesh",
      ""
    ],
    [
      "Acharya",
      "Anurag",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 18:53:46 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1734029626000,
  "abstract": "  The emergence of the COVID-19 pandemic resulted in a significant rise in the\nspread of misinformation on online platforms such as Twitter. Oftentimes this\ngrowth is blamed on the idea of the \"echo chamber.\" However, the behavior said\nto characterize these echo chambers exists in two dimensions. The first is in a\nuser's social interactions, where they are said to stick with the same clique\nof like-minded users. The second is in the content of their posts, where they\nare said to repeatedly espouse homogeneous ideas. In this study, we link the\ntwo by using Twitter's network of retweets to study social interactions and\ntopic modeling to study tweet content. In order to measure the diversity of a\nuser's interactions over time, we develop a novel metric to track the speed at\nwhich they travel through the social network. The application of these analysis\nmethods to misinformation-focused data from the pandemic demonstrates\ncorrelation between social behavior and tweet content. We believe this\ncorrelation supports the common intuition about how antisocial users behave,\nand further suggests that it holds even in subcommunities already rife with\nmisinformation.\n",
  "subjects": [
    "Computer Science/Social and Information Networks",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Computation and Language"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "-_rXweAU4tOPxgOhY7g2tqYzowe3m4zfrZiDL62BFBs",
  "pdfSize": "1025839"
}