{
  "id": "2412.07178",
  "title": "Electron microscopy and spectroscopy investigation of atomic,\n  electronic, and phonon structures of NdNiO2/SrTiO3 interface",
  "authors": "Yin Yuan, Wu Mei, Ding Xiang, He Peiyi, Li Qize, Zhang Xiaowen, Zhu\n  Ruixue, Mao Ruilin, Gao Xiaoyue, Shi Ruochen, Qiao Liang, Gao Peng",
  "authorsParsed": [
    [
      "Yuan",
      "Yin",
      ""
    ],
    [
      "Mei",
      "Wu",
      ""
    ],
    [
      "Xiang",
      "Ding",
      ""
    ],
    [
      "Peiyi",
      "He",
      ""
    ],
    [
      "Qize",
      "Li",
      ""
    ],
    [
      "Xiaowen",
      "Zhang",
      ""
    ],
    [
      "Ruixue",
      "Zhu",
      ""
    ],
    [
      "Ruilin",
      "Mao",
      ""
    ],
    [
      "Xiaoyue",
      "Gao",
      ""
    ],
    [
      "Ruochen",
      "Shi",
      ""
    ],
    [
      "Liang",
      "Qiao",
      ""
    ],
    [
      "Peng",
      "Gao",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 04:28:47 GMT"
    },
    {
      "version": "v2",
      "created": "Wed, 22 Jan 2025 08:04:44 GMT"
    }
  ],
  "updateDate": "2025-01-23",
  "timestamp": 1733804927000,
  "abstract": "  The infinite-layer nickelates, proposed as analogs to superconducting\ncuprates, provide a promising platform for exploring the mechanisms of\nunconventional superconductivity. However, the superconductivity under\natmospheric pressure has only been observed in thin films, indicating the\nheterointerface is essential. Here, we employed the advanced Scanning\nTransmission Electron Microscopy-Electron Energy Loss Spectroscopy (STEM-EELS)\ntechnique to thoroughly investigate the atomic configuration, layer-resolved\nelectronic states and phonon across the NdNiO2/SrTiO3 interface. We found the\nSr atoms diffusion at the interface, which results in hole doping into oxygen\nand nickel band to form a p-type interface. A pronounced redshift of the\nhighest-energy optical phonon (HEOP) of NdNiO2 (~78 meV) is observed at the\ninterface, which is primarily attributed to the epitaxial strain. Our work\nclarifies that the effects of the interface on electron and phonon states are\nmainly due to elemental intermixing and epitaxial strain, which could lay the\nfoundation for future investigations into superconducting mechanisms of\ninfinite-layer nickelates.\n",
  "subjects": [
    "Condensed Matter/Superconductivity"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "L1XmFWJOv_ftRHqoXhIciXA0hngBGQmCAf8_-2NcDm0",
  "pdfSize": "1345698"
}