{
  "id": "2412.05449",
  "title": "Towards Effective GenAI Multi-Agent Collaboration: Design and Evaluation\n  for Enterprise Applications",
  "authors": "Raphael Shu, Nilaksh Das, Michelle Yuan, Monica Sunkara, Yi Zhang",
  "authorsParsed": [
    [
      "Shu",
      "Raphael",
      ""
    ],
    [
      "Das",
      "Nilaksh",
      ""
    ],
    [
      "Yuan",
      "Michelle",
      ""
    ],
    [
      "Sunkara",
      "Monica",
      ""
    ],
    [
      "Zhang",
      "Yi",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 22:14:17 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733523257000,
  "abstract": "  AI agents powered by large language models (LLMs) have shown strong\ncapabilities in problem solving. Through combining many intelligent agents,\nmulti-agent collaboration has emerged as a promising approach to tackle\ncomplex, multi-faceted problems that exceed the capabilities of single AI\nagents. However, designing the collaboration protocols and evaluating the\neffectiveness of these systems remains a significant challenge, especially for\nenterprise applications. This report addresses these challenges by presenting a\ncomprehensive evaluation of coordination and routing capabilities in a novel\nmulti-agent collaboration framework. We evaluate two key operational modes: (1)\na coordination mode enabling complex task completion through parallel\ncommunication and payload referencing, and (2) a routing mode for efficient\nmessage forwarding between agents. We benchmark on a set of handcrafted\nscenarios from three enterprise domains, which are publicly released with the\nreport. For coordination capabilities, we demonstrate the effectiveness of\ninter-agent communication and payload referencing mechanisms, achieving\nend-to-end goal success rates of 90%. Our analysis yields several key findings:\nmulti-agent collaboration enhances goal success rates by up to 70% compared to\nsingle-agent approaches in our benchmarks; payload referencing improves\nperformance on code-intensive tasks by 23%; latency can be substantially\nreduced with a routing mechanism that selectively bypasses agent orchestration.\nThese findings offer valuable guidance for enterprise deployments of\nmulti-agent systems and advance the development of scalable, efficient\nmulti-agent collaboration frameworks.\n",
  "subjects": [
    "Computer Science/Computation and Language",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "2m0mtgFM_b3rxfE9NSkYMIjD4vCepw0GlSmK6qwA4e0",
  "pdfSize": "643129"
}