{
  "id": "2412.02434",
  "title": "Fast maximal clique enumeration in weighted temporal networks",
  "authors": "Hanjo D. Boekhout and Frank W. Takes",
  "authorsParsed": [
    [
      "Boekhout",
      "Hanjo D.",
      ""
    ],
    [
      "Takes",
      "Frank W.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 13:11:36 GMT"
    }
  ],
  "updateDate": "2024-12-04",
  "timestamp": 1733231496000,
  "abstract": "  Cliques, groups of fully connected nodes in a network, are often used to\nstudy group dynamics of complex systems. In real-world settings, group dynamics\noften have a temporal component. For example, conference attendees moving from\none group conversation to another. Recently, maximal clique enumeration methods\nhave been introduced that add temporal (and frequency) constraints, to account\nfor such phenomena. These methods enumerate so called (delta,gamma)-maximal\ncliques. In this work, we introduce an efficient (delta,gamma)-maximal clique\nenumeration algorithm, that extends gamma from a frequency constraint to a more\nversatile weighting constraint. Additionally, we introduce a definition of\n(delta,gamma)-cliques, that resolves a problem of existing definitions in the\ntemporal domain. Our approach, which was inspired by a state-of-the-art\ntwo-phase approach, introduces a more efficient initial (stretching) phase.\nSpecifically, we reduce the time complexity of this phase to be linear with\nrespect to the number of temporal edges. Furthermore, we introduce a new\napproach to the second (bulking) phase, which allows us to efficiently prune\nsearch tree branches. Consequently, in experiments we observe speed-ups, often\nby several order of magnitude, on various (large) real-world datasets. Our\nalgorithm vastly outperforms the existing state-of-the-art methods for temporal\nnetworks, while also extending applicability to weighted networks.\n",
  "subjects": [
    "Computer Science/Social and Information Networks"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "7GMKCTe9rhKaO7-CLmPhJGrxDTsyor41X_2nUgh3Vcw",
  "pdfSize": "2108919"
}