{"id":"2412.10392","title":"Computational Methods for Breast Cancer Molecular Profiling through\n  Routine Histopathology: A Review","authors":"Suchithra Kunhoth, Somaya Al- Maadeed, Younes Akbari, Rafif Al Saady","authorsParsed":[["Kunhoth","Suchithra",""],["Maadeed","Somaya Al-",""],["Akbari","Younes",""],["Saady","Rafif Al",""]],"versions":[{"version":"v1","created":"Sun, 1 Dec 2024 08:13:49 GMT"}],"updateDate":"2024-12-17","timestamp":1733040829000,"abstract":"  Precision medicine has become a central focus in breast cancer management,\nadvancing beyond conventional methods to deliver more precise and\nindividualized therapies. Traditionally, histopathology images have been used\nprimarily for diagnostic purposes; however, they are now recognized for their\npotential in molecular profiling, which provides deeper insights into cancer\nprognosis and treatment response. Recent advancements in artificial\nintelligence (AI) have enabled digital pathology to analyze histopathologic\nimages for both targeted molecular and broader omic biomarkers, marking a\npivotal step in personalized cancer care. These technologies offer the\ncapability to extract various biomarkers such as genomic, transcriptomic,\nproteomic, and metabolomic markers directly from the routine hematoxylin and\neosin (H&E) stained images, which can support treatment decisions without the\nneed for costly molecular assays. In this work, we provide a comprehensive\nreview of AI-driven techniques for biomarker detection, with a focus on diverse\nomic biomarkers that allow novel biomarker discovery. Additionally, we analyze\nthe major challenges faced in this field for robust algorithm development.\nThese challenges highlight areas where further research is essential to bridge\nthe gap between AI research and clinical application.\n","subjects":["Quantitative Biology/Quantitative Methods","Computer Science/Computer Vision and Pattern Recognition","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Z-MnnqHnK6KZefHXyCLWXNsSzAx5ea0xuFHyS-xjiis","pdfSize":"1032163"}