{"id":"2412.15348","title":"Autonomous Vehicle Security: A Deep Dive into Threat Modeling","authors":"Amal Yousseef, Shalaka Satam, Banafsheh Saber Latibari, Jesus Pacheco,\n  Soheil Salehi, Salim Hariri, Partik Satam","authorsParsed":[["Yousseef","Amal",""],["Satam","Shalaka",""],["Latibari","Banafsheh Saber",""],["Pacheco","Jesus",""],["Salehi","Soheil",""],["Hariri","Salim",""],["Satam","Partik",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 19:29:23 GMT"}],"updateDate":"2024-12-23","timestamp":1734636563000,"abstract":"  Autonomous vehicles (AVs) are poised to revolutionize modern transportation,\noffering enhanced safety, efficiency, and convenience. However, the increasing\ncomplexity and connectivity of AV systems introduce significant cybersecurity\nchallenges. This paper provides a comprehensive survey of AV security with a\nfocus on threat modeling frameworks, including STRIDE, DREAD, and MITRE\nATT\\&CK, to systematically identify and mitigate potential risks. The survey\nexamines key components of AV architectures, such as sensors, communication\nmodules, and electronic control units (ECUs), and explores common attack\nvectors like wireless communication exploits, sensor spoofing, and firmware\nvulnerabilities. Through case studies of real-world incidents, such as the Jeep\nCherokee and Tesla Model S exploits, the paper highlights the critical need for\nrobust security measures. Emerging technologies, including blockchain for\nsecure Vehicle-to-Everything (V2X) communication, AI-driven threat detection,\nand secure Over-The-Air (OTA) updates, are discussed as potential solutions to\nmitigate evolving threats. The paper also addresses legal and ethical\nconsiderations, emphasizing data privacy, user safety, and regulatory\ncompliance. By combining threat modeling frameworks, multi-layered security\nstrategies, and proactive defenses, this survey offers insights and\nrecommendations for enhancing the cybersecurity of autonomous vehicles.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computer Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"V-KgvL28A7f9Zae8CUNxjeQZ8_lMADK6m4q-8bNWoRk","pdfSize":"1178271"}