{
  "id": "2412.02730",
  "title": "Shaping AI's Impact on Billions of Lives",
  "authors": "Mariano-Florentino Cu\\'ellar, Jeff Dean, Finale Doshi-Velez, John\n  Hennessy, Andy Konwinski, Sanmi Koyejo, Pelonomi Moiloa, Emma Pierson, and\n  David Patterson",
  "authorsParsed": [
    [
      "Cuéllar",
      "Mariano-Florentino",
      ""
    ],
    [
      "Dean",
      "Jeff",
      ""
    ],
    [
      "Doshi-Velez",
      "Finale",
      ""
    ],
    [
      "Hennessy",
      "John",
      ""
    ],
    [
      "Konwinski",
      "Andy",
      ""
    ],
    [
      "Koyejo",
      "Sanmi",
      ""
    ],
    [
      "Moiloa",
      "Pelonomi",
      ""
    ],
    [
      "Pierson",
      "Emma",
      ""
    ],
    [
      "Patterson",
      "David",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 16:29:37 GMT"
    },
    {
      "version": "v2",
      "created": "Wed, 11 Dec 2024 15:22:32 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733243377000,
  "abstract": "  Artificial Intelligence (AI), like any transformative technology, has the\npotential to be a double-edged sword, leading either toward significant\nadvancements or detrimental outcomes for society as a whole. As is often the\ncase when it comes to widely-used technologies in market economies (e.g., cars\nand semiconductor chips), commercial interest tends to be the predominant\nguiding factor. The AI community is at risk of becoming polarized to either\ntake a laissez-faire attitude toward AI development, or to call for government\noverregulation. Between these two poles we argue for the community of AI\npractitioners to consciously and proactively work for the common good. This\npaper offers a blueprint for a new type of innovation infrastructure including\n18 concrete milestones to guide AI research in that direction. Our view is that\nwe are still in the early days of practical AI, and focused efforts by\npractitioners, policymakers, and other stakeholders can still maximize the\nupsides of AI and minimize its downsides.\n  We talked to luminaries such as recent Nobelist John Jumper on science,\nPresident Barack Obama on governance, former UN Ambassador and former National\nSecurity Advisor Susan Rice on security, philanthropist Eric Schmidt on several\ntopics, and science fiction novelist Neal Stephenson on entertainment. This\nongoing dialogue and collaborative effort has produced a comprehensive,\nrealistic view of what the actual impact of AI could be, from a diverse\nassembly of thinkers with deep understanding of this technology and these\ndomains. From these exchanges, five recurring guidelines emerged, which form\nthe cornerstone of a framework for beginning to harness AI in service of the\npublic good. They not only guide our efforts in discovery but also shape our\napproach to deploying this transformative technology responsibly and ethically.\n",
  "subjects": [
    "Computer Science/Artificial Intelligence",
    "Computer Science/Computers and Society",
    "Computer Science/Emerging Technologies",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "lP8xF0iB32_ZPCExHfZt_xNGkKKNgbl9Saur3gJk1qg",
  "pdfSize": "18188685"
}