{
  "id": "2412.07882",
  "title": "The continuous net benefit: Assessing the clinical utility of prediction\n  models when informing a continuum of decisions",
  "authors": "Jose Benitez-Aurioles, Laure Wynants, Niels Peek, Patrick Goodley,\n  Philip Crosbie, Matthew Sperrin",
  "authorsParsed": [
    [
      "Benitez-Aurioles",
      "Jose",
      ""
    ],
    [
      "Wynants",
      "Laure",
      ""
    ],
    [
      "Peek",
      "Niels",
      ""
    ],
    [
      "Goodley",
      "Patrick",
      ""
    ],
    [
      "Crosbie",
      "Philip",
      ""
    ],
    [
      "Sperrin",
      "Matthew",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 19:30:57 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733859057000,
  "abstract": "  Clinical prognostic models help inform decision-making by estimating a\npatient's risk of experiencing an outcome in the future. The net benefit is\nincreasingly being used to assess the clinical utility of models. By\ncalculating an appropriately weighted average of the true and false positives\nof a model, the net benefit assesses the value added by a binary decision\npolicy obtained when thresholding a model. Although such 'treat or not'\ndecisions are common, prognostic models are also often used to tailor and\npersonalise the care of patients, which implicitly involves the consideration\nof multiple interventions at different risk thresholds.\n  We extend the net benefit to consider multiple decision thresholds\nsimultaneously, by taking a weighted area under a rescaled version of the net\nbenefit curve, deriving the continuous net benefit. In addition to the\nconsideration of a continuum of interventions, we also show how the continuous\nnet benefit can be used for populations with a range of optimal thresholds for\na single treatment, due to individual variations in expected treatment benefit\nor harm, highlighting limitations of current proposed methods that calculate\nthe area under the decision curve. We showcase the continuous net benefit\nthrough two examples of cardiovascular preventive care, comparing two modelling\nchoices using the continuous net benefit.\n  The continuous net benefit informs researchers of the clinical utility of\nmodels during selection, development, and validation, and helps decision makers\nunderstand their usefulness, improving their viability towards implementation.\n",
  "subjects": [
    "Statistics/Applications"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "7yyJ3jRGKxb7vZ3cWkT-tVoliVrT8Nfw1jOp01-FzvY",
  "pdfSize": "673877"
}