{
  "id": "2412.16730",
  "title": "Interface-sensitive microwave loss in superconducting tantalum films\n  sputtered on c-plane sapphire",
  "authors": "Anthony P. McFadden and Jinsu Oh and Lin Zhou and Trevyn F.Q. Larson\n  and Stephen Gill and Akash V. Dixit and Raymond Simmonds and Florent Lecocq",
  "authorsParsed": [
    [
      "McFadden",
      "Anthony P.",
      ""
    ],
    [
      "Oh",
      "Jinsu",
      ""
    ],
    [
      "Zhou",
      "Lin",
      ""
    ],
    [
      "Larson",
      "Trevyn F. Q.",
      ""
    ],
    [
      "Gill",
      "Stephen",
      ""
    ],
    [
      "Dixit",
      "Akash V.",
      ""
    ],
    [
      "Simmonds",
      "Raymond",
      ""
    ],
    [
      "Lecocq",
      "Florent",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 21 Dec 2024 18:40:49 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734806449000,
  "abstract": "  Quantum coherence in superconducting circuits has increased steadily over the\nlast decades as a result of a growing understanding of the various loss\nmechanisms. Recently, tantalum (Ta) emerged as a promising material to address\nmicroscopic sources of loss found on niobium (Nb) or aluminum (Al) surfaces.\nHowever, the effects of film and interface microstructure on low-temperature\nmicrowave loss are still not well understood. Here we present a systematic\nstudy of the structural and electrical properties of Ta and Nb films sputtered\non c-plane sapphire at varying growth temperatures. As growth temperature is\nincreased, our results show that the onset of epitaxial growth of\n$\\alpha$-phase Ta correlates with lower Ta surface roughness, higher critical\ntemperature, and higher residual resistivity ratio, but surprisingly also\ncorrelates with a significant increase in loss at microwave frequency. We\ndetermine that the source of loss is located at the Ta/sapphire interface and\nshow that it can be fully mitigated by either growing a thin, epitaxial Nb\ninter-layer between the Ta film and the substrate or by intentionally treating\nthe sapphire surface with \\textit{in-situ} argon plasma before Ta growth. In\naddition to elucidating this interfacial microwave loss, this work provides\nadequate process details that should allow for the reproducible growth of\nlow-loss Ta film across fabrication facilities.\n",
  "subjects": [
    "Physics/Quantum Physics",
    "Condensed Matter/Materials Science"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "S6cgKBVTrY6GlEVvcwlo7J_ePKpcXBeRzJRPBKYJtUw",
  "pdfSize": "3343010"
}