{
  "id": "2412.11220",
  "title": "Non-Markovian Noise Suppression Simplified through Channel\n  Representation",
  "authors": "Zhenhuan Liu, Yunlong Xiao, Zhenyu Cai",
  "authorsParsed": [
    [
      "Liu",
      "Zhenhuan",
      ""
    ],
    [
      "Xiao",
      "Yunlong",
      ""
    ],
    [
      "Cai",
      "Zhenyu",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 15 Dec 2024 15:26:07 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734276367000,
  "abstract": "  Non-Markovian noise, arising from the memory effect in the environment, poses\nsubstantial challenges to conventional quantum noise suppression protocols,\nincluding quantum error correction and mitigation. We introduce a channel\nrepresentation for arbitrary non-Markovian quantum dynamics, termed the Choi\nchannel, as it operates on the Choi states of the ideal gate layers. This\nrepresentation translates the complex dynamics of non-Markovian noise into the\nfamiliar picture of noise channels acting on ideal states, allowing us to\ndirectly apply many existing error suppression protocols originally designed\nfor Markovian noise. These protocols can then be translated from the Choi\nchannel picture back to the circuit picture, yielding non-Markovian noise\nsuppression protocols. With this framework, we have devised new protocols using\nPauli twirling, probabilistic error cancellation and virtual channel\npurification. In particular, Pauli twirling can transform any non-Markovian\nnoise into noise that exhibits only classical temporal correlations, thereby\nextending the proven noise resilience of single-shot quantum error correction\nto arbitrary non-Markovian noise. Through these examples, the Choi channel\ndemonstrates significant potential as a foundational bridge for connecting\nexisting techniques and inspiring the development of novel non-Markovian noise\nsuppression protocols.\n",
  "subjects": [
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "GOHQUmLd0O-sCsbAowPPVFfHLGTYDk3qbIxzcL_fsnQ",
  "pdfSize": "763324"
}