{
  "id": "2412.12543",
  "title": "Personalized Federated Deep Reinforcement Learning for Heterogeneous\n  Edge Content Caching Networks",
  "authors": "Zhen Li, Tan Li, Hai Liu, Tse-Tin Chan",
  "authorsParsed": [
    [
      "Li",
      "Zhen",
      ""
    ],
    [
      "Li",
      "Tan",
      ""
    ],
    [
      "Liu",
      "Hai",
      ""
    ],
    [
      "Chan",
      "Tse-Tin",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 05:09:45 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734412185000,
  "abstract": "  Proactive caching is essential for minimizing latency and improving Quality\nof Experience (QoE) in multi-server edge networks. Federated Deep Reinforcement\nLearning (FDRL) is a promising approach for developing cache policies tailored\nto dynamic content requests. However, FDRL faces challenges such as an\nexpanding caching action space due to increased content numbers and difficulty\nin adapting global information to heterogeneous edge environments. In this\npaper, we propose a Personalized Federated Deep Reinforcement Learning\nframework for Caching, called PF-DRL-Ca, with the aim to maximize system\nutility while satisfying caching capability constraints. To manage the\nexpanding action space, we employ a new DRL algorithm, Multi-head Deep\nQ-Network (MH-DQN), which reshapes the action output layers of DQN into a\nmulti-head structure where each head generates a sub-dimensional action. We\nnext integrate the proposed MH-DQN into a personalized federated training\nframework, employing a layer-wise approach for training to derive a\npersonalized model that can adapt to heterogeneous environments while\nexploiting the global information to accelerate learning convergence. Our\nextensive experimental results demonstrate the superiority of MH-DQN over\ntraditional DRL algorithms on a single server, as well as the advantages of the\npersonal federated training architecture compared to other frameworks.\n",
  "subjects": [
    "Computer Science/Networking and Internet Architecture",
    "Electrical Engineering and Systems Science/Signal Processing"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "zTj9Q3whGYXDSNCbYBY2HnjVEiTIkAUHLnT0hUn20Ts",
  "pdfSize": "2393623"
}