{
  "id": "2412.12730",
  "title": "Thin film flow over a spinning disc: Experiments and direct numerical\n  simulations",
  "authors": "Jason Stafford, Nwachukwu Uzo, Enrico Piccoli, Camille Petit, Omar K.\n  Matar",
  "authorsParsed": [
    [
      "Stafford",
      "Jason",
      ""
    ],
    [
      "Uzo",
      "Nwachukwu",
      ""
    ],
    [
      "Piccoli",
      "Enrico",
      ""
    ],
    [
      "Petit",
      "Camille",
      ""
    ],
    [
      "Matar",
      "Omar K.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 09:52:51 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734429171000,
  "abstract": "  The dynamics of thin liquid films flowing over a spinning disc is studied\nthrough a combination of experiments and direct numerical simulations. We\nconsider a comprehensive range of interfacial flow regimes from waveless\nthrough to three-dimensional (3D) waves, and for previously unexplored\ninertia-dominated conditions that have practical relevance. The transition\nbetween these regimes is categorised within a phase map based on two governing\nparameters that correspond to modified inverse Weber ($\\lambda$) and Ekman\nnumbers ($r_{disc}$). Our findings show that stationary two-dimensional (2D)\nspiral waves, which unfold in the direction of rotation from the Coriolis\neffect, transition to 3D waves with the emergence of small perturbations on the\nwavefronts. These non-stationary structures grow asymmetrically in the 2D-3D\ntransitional region, and detach from the parent spiral wave to form wavelets or\nso-called $\\Lambda$ solitons. We show that during and after this wave formation\nprocess, flow circulations unique to the spinning disc arrangement are present\nwithin the main wave hump. Furthermore, when combined with observations of wall\nstrain rates and topology within the film, these findings elucidate the\nmechanisms that underpin the apparent wave-induced interfacial turbulence\neffects observed for spinning disc flows.\n",
  "subjects": [
    "Physics/Fluid Dynamics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "3TaAnOn4LaakaIsvHYGuacoPtSzyd_AedPAXcoYlzKM",
  "pdfSize": "15552020"
}