{
  "id": "2412.13654",
  "title": "GAGS: Granularity-Aware Feature Distillation for Language Gaussian\n  Splatting",
  "authors": "Yuning Peng, Haiping Wang, Yuan Liu, Chenglu Wen, Zhen Dong, Bisheng\n  Yang",
  "authorsParsed": [
    [
      "Peng",
      "Yuning",
      ""
    ],
    [
      "Wang",
      "Haiping",
      ""
    ],
    [
      "Liu",
      "Yuan",
      ""
    ],
    [
      "Wen",
      "Chenglu",
      ""
    ],
    [
      "Dong",
      "Zhen",
      ""
    ],
    [
      "Yang",
      "Bisheng",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 09:33:20 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734514400000,
  "abstract": "  3D open-vocabulary scene understanding, which accurately perceives complex\nsemantic properties of objects in space, has gained significant attention in\nrecent years. In this paper, we propose GAGS, a framework that distills 2D CLIP\nfeatures into 3D Gaussian splatting, enabling open-vocabulary queries for\nrenderings on arbitrary viewpoints. The main challenge of distilling 2D\nfeatures for 3D fields lies in the multiview inconsistency of extracted 2D\nfeatures, which provides unstable supervision for the 3D feature field. GAGS\naddresses this challenge with two novel strategies. First, GAGS associates the\nprompt point density of SAM with the camera distances, which significantly\nimproves the multiview consistency of segmentation results. Second, GAGS\nfurther decodes a granularity factor to guide the distillation process and this\ngranularity factor can be learned in a unsupervised manner to only select the\nmultiview consistent 2D features in the distillation process. Experimental\nresults on two datasets demonstrate significant performance and stability\nimprovements of GAGS in visual grounding and semantic segmentation, with an\ninference speed 2$\\times$ faster than baseline methods. The code and additional\nresults are available at https://pz0826.github.io/GAGS-Webpage/ .\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "L2neLZdLtJW_3C5MLjYaQPJcG45RLyoNKLaRzJN5WWU",
  "pdfSize": "51303383"
}