{
  "id": "2412.10500",
  "title": "Chiral anomaly and longitudinal magnetoconductance in pseudospin-1\n  fermions",
  "authors": "Azaz Ahmad and Gargee Sharma",
  "authorsParsed": [
    [
      "Ahmad",
      "Azaz",
      ""
    ],
    [
      "Sharma",
      "Gargee",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 19:00:02 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734116402000,
  "abstract": "  Chiral anomaly (CA), a hallmark of Weyl fermions, has emerged as a\ncornerstone of condensed matter physics following the discovery of Weyl\nsemimetals. While the anomaly in pseudospin-1/2 (Weyl) systems is\nwell-established, its extension to higher-pseudospin fermions remains a\nfrontier with critical implications for transport phenomena in materials with\nmultifold fermions. We present a rigorous quasiclassical analysis of CA and\nlongitudinal magnetotransport in pseudospin-1 fermions, advancing beyond\nconventional models that assume constant relaxation times and neglect the\norbital magnetic moment and global charge conservation. Our study uncovers a\nmagnetic-field dependence of the longitudinal magnetoconductance: it is\npositive and quadratic-in-B for weak internode scattering and transitions to\nnegative values beyond a critical internode scattering strength. Notably, the\ncritical threshold is lower for pseudospin-1 fermions compared to their\npseudospin-1/2 counterparts. We show analytically that the zero-field\nconductivity is affected more strongly by internode scattering for pseudospin-1\nfermions than conventional Weyl fermions. These insights provide a foundational\nframework for interpreting recent experiments on multifold fermions and offer a\nroadmap for probing CA in candidate materials with space group symmetries 199,\n214, and 220.\n",
  "subjects": [
    "Condensed Matter/Mesoscale and Nanoscale Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "VruaorbKYK7MdtNDnTjehcMYJplmZKzNOprWcZ3tniE",
  "pdfSize": "2075244"
}