{
  "id": "2412.15822",
  "title": "S$^2$DN: Learning to Denoise Unconvincing Knowledge for Inductive\n  Knowledge Graph Completion",
  "authors": "Tengfei Ma, Yujie Chen, Liang Wang, Xuan Lin, Bosheng Song, Xiangxiang\n  Zeng",
  "authorsParsed": [
    [
      "Ma",
      "Tengfei",
      ""
    ],
    [
      "Chen",
      "Yujie",
      ""
    ],
    [
      "Wang",
      "Liang",
      ""
    ],
    [
      "Lin",
      "Xuan",
      ""
    ],
    [
      "Song",
      "Bosheng",
      ""
    ],
    [
      "Zeng",
      "Xiangxiang",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 12:03:33 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734696213000,
  "abstract": "  Inductive Knowledge Graph Completion (KGC) aims to infer missing facts\nbetween newly emerged entities within knowledge graphs (KGs), posing a\nsignificant challenge. While recent studies have shown promising results in\ninferring such entities through knowledge subgraph reasoning, they suffer from\n(i) the semantic inconsistencies of similar relations, and (ii) noisy\ninteractions inherent in KGs due to the presence of unconvincing knowledge for\nemerging entities. To address these challenges, we propose a Semantic\nStructure-aware Denoising Network (S$^2$DN) for inductive KGC. Our goal is to\nlearn adaptable general semantics and reliable structures to distill consistent\nsemantic knowledge while preserving reliable interactions within KGs.\nSpecifically, we introduce a semantic smoothing module over the enclosing\nsubgraphs to retain the universal semantic knowledge of relations. We\nincorporate a structure refining module to filter out unreliable interactions\nand offer additional knowledge, retaining robust structure surrounding target\nlinks. Extensive experiments conducted on three benchmark KGs demonstrate that\nS$^2$DN surpasses the performance of state-of-the-art models. These results\ndemonstrate the effectiveness of S$^2$DN in preserving semantic consistency and\nenhancing the robustness of filtering out unreliable interactions in\ncontaminated KGs.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Computation and Language"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "yHGXkVdS9UJQqZ1Uek0AdjJo-2Rdd6VOxbvqdpHVcQg",
  "pdfSize": "1327752"
}