{"id":"2412.00846","title":"Improving Multimodal LLMs Ability In Geometry Problem Solving,\n  Reasoning, And Multistep Scoring","authors":"Avinash Anand, Raj Jaiswal, Abhishek Dharmadhikari, Atharva Marathe,\n  Harsh Parimal Popat, Harshil Mital, Kritarth Prasad, Rajiv Ratn Shah, Roger\n  Zimmermann","authorsParsed":[["Anand","Avinash",""],["Jaiswal","Raj",""],["Dharmadhikari","Abhishek",""],["Marathe","Atharva",""],["Popat","Harsh Parimal",""],["Mital","Harshil",""],["Prasad","Kritarth",""],["Shah","Rajiv Ratn",""],["Zimmermann","Roger",""]],"versions":[{"version":"v1","created":"Sun, 1 Dec 2024 15:19:23 GMT"}],"updateDate":"2024-12-03","timestamp":1733066363000,"abstract":"  This paper presents GPSM4K, a comprehensive geometry multimodal dataset\ntailored to augment the problem-solving capabilities of Large Vision Language\nModels (LVLMs). GPSM4K encompasses 2157 multimodal question-answer pairs\nmanually extracted from mathematics textbooks spanning grades 7-12 and is\nfurther augmented to 5340 problems, consisting of both numerical and\ntheorem-proving questions. In contrast to PGPS9k, Geometry3K, and Geo170K which\nfeature only objective-type questions, GPSM4K offers detailed step-by-step\nsolutions in a consistent format, facilitating a comprehensive evaluation of\nproblem-solving approaches. This dataset serves as an excellent benchmark for\nassessing the geometric reasoning capabilities of LVLMs. Evaluation of our test\nset shows that there is scope for improvement needed in open-source language\nmodels in geometry problem-solving. Finetuning on our training set increases\nthe geometry problem-solving capabilities of models. Further, We also evaluate\nthe effectiveness of techniques such as image captioning and Retrieval\nAugmentation generation (RAG) on model performance. We leveraged LLM to\nautomate the task of final answer evaluation by providing ground truth and\npredicted solutions. This research will help to assess and improve the\ngeometric reasoning capabilities of LVLMs.\n","subjects":["Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"B2SzUwvxI8SaH_uSu3jnRWZBBZTQ1ZJvqHbhJyGr-nU","pdfSize":"2653027"}