{"id":"2412.16531","title":"From Creation to Curriculum: Examining the role of generative AI in Arts\n  Universities","authors":"Atticus Sims (Faculty of Media Creation, Kyoto Seika University)","authorsParsed":[["Sims","Atticus","","Faculty of Media Creation, Kyoto Seika University"]],"versions":[{"version":"v1","created":"Sat, 21 Dec 2024 08:18:43 GMT"}],"updateDate":"2024-12-24","timestamp":1734769123000,"abstract":"  The age of Artificial Intelligence (AI) is marked by its transformative\n\"generative\" capabilities, distinguishing it from prior iterations. This\nburgeoning characteristic of AI has enabled it to produce new and original\ncontent, inherently showcasing its creative prowess. This shift challenges and\nrequires a recalibration in the realm of arts education, urging a departure\nfrom established pedagogies centered on human-driven image creation. The paper\nmeticulously addresses the integration of AI tools, with a spotlight on Stable\nDiffusion (SD), into university arts curricula. Drawing from practical insights\ngathered from workshops conducted in July 2023, which culminated in an\nexhibition of AI-driven artworks, the paper aims to provide a roadmap for\nseamlessly infusing these tools into academic settings. Given their recent\nemergence, the paper delves into a comprehensive overview of such tools,\nemphasizing the intricate dance between artists, developers, and researchers in\nthe open-source AI art world. This discourse extends to the challenges and\nimperatives faced by educational institutions. It presents a compelling case\nfor the swift adoption of these avant-garde tools, underscoring the paramount\nimportance of equipping students with the competencies required to thrive in an\nAI-augmented artistic landscape.\n","subjects":["Computer Science/Artificial Intelligence","Computer Science/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"o8p6K3tmEorQnDjOcAtJXGdTJQTdUd1eVt8P9SMz7QA","pdfSize":"438232"}