{"id":"2412.00996","title":"Decoupling Optical and Thermal Responses: Thermo-optical Nonlinearities\n  Unlock MHz Transmission Modulation in Dielectric Metasurfaces","authors":"Omer Can Karaman, Gopal Narmada Naidu, Alan R. Bowman, Elif Nur Dayi\n  and Giulia Tagliabue","authorsParsed":[["Karaman","Omer Can",""],["Naidu","Gopal Narmada",""],["Bowman","Alan R.",""],["Dayi","Elif Nur",""],["Tagliabue","Giulia",""]],"versions":[{"version":"v1","created":"Sun, 1 Dec 2024 22:57:31 GMT"}],"updateDate":"2024-12-03","timestamp":1733093851000,"abstract":"  Thermo-optical nonlinearities (TONL) in metasurfaces enable dynamic control\nof optical properties like transmission, reflection, and absorption through\nexternal stimuli such as laser irradiation or temperature. As slow thermal\ndynamics of extended systems are expected to limit modulation speeds\nultimately, research has primarily focused on steady-state effects. In this\nstudy, we investigate photo-driven TONL in amorphous silicon (a-Si)\nmetasurfaces both under steady-state and, most importantly, dynamic conditions\n(50 kHz modulation) using a 488 nm continuous-wave pump laser. First, we show\nthat a non-monotonic change in the steady-state transmission occurs at\nwavelengths longer than the electric-dipole resonance (800 nm). In particular,\nat 815 nm transmission first decreases by 30% and then increases by 30% as the\nlaser intensity is raised to 5 mW/{\\mu}m2. Next, we demonstrate that TONL\ndecouple the thermal and optical characteristic times, the latter being up to 7\ntimes shorter in the tested conditions (i.e {\\tau}opt =0.5 {\\mu}s vs {\\tau}th\n=3.5 {\\mu}s). Most remarkably, we experimentally demonstrate that combining\nthese two effects enables optical modulation at twice the speed (100 kHz) of\nthe excitation laser modulation. We finally show how to achieve all-optical\ntransmission modulation at MHz speeds with large amplitudes (85%). Overall,\nthese results show that photo-driven TONL produce large and fully reversible\ntransmission modulation in dielectric metasurfaces with fast and adjustable\nspeeds. Therefore, they open completely new opportunities toward exploiting\nTONL in dynamically reconfigurable systems, from optical switching to wavefront\nmanipulation.\n","subjects":["Physics/Optics","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"87Pw6EnCCiwdOgRNmnhtRyLRfBfQ4Wn2totMNtC3V-Y","pdfSize":"2950280"}