{
  "id": "2412.07020",
  "title": "An instrument to link global positioning to the Universe -- Observing\n  GNSS satellites with the Australian VLBI array",
  "authors": "Lucia McCallum, David Schunck, Jamie McCallum and Tiege McCarthy",
  "authorsParsed": [
    [
      "McCallum",
      "Lucia",
      ""
    ],
    [
      "Schunck",
      "David",
      ""
    ],
    [
      "McCallum",
      "Jamie",
      ""
    ],
    [
      "McCarthy",
      "Tiege",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 22:01:56 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 17 Dec 2024 05:33:03 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1733781716000,
  "abstract": "  This paper introduces a new instrument enabling a novel combination of Earth\nmeasuring techniques: direct observations with the radio astronomical\ninstruments to satellites of the global navigation satellite systems.\nInter-technique biases are a major error source in the terrestrial reference\nframe. Combining two major space-geodetic techniques, GNSS and VLBI, through\nobservations to identical sensors has been considered infeasible due to their\nseemingly incompatible operating frequencies. The newly accessible L-band\ncapability of the Australian VGOS telescopes is shown here, invalidating this\nprevailing opinion. A series of test observations demonstrates geodetic VLBI\nobservations to GPS satellites for a continental-wide IVS telescope array, with\nthe potential for observations at a critical scale. We anticipate immediate\nimpact for the geodetic community, through first-ever inter-technique ties\nbetween VLBI and GNSS in the Australian region and via the opportunity for\ncritical test observations towards the Genesis mission, geodesy's flagship\nproject in the area of space ties set for launch in 2028.\n",
  "subjects": [
    "Physics/Geophysics",
    "Astrophysics/Instrumentation and Methods for Astrophysics",
    "Physics/Instrumentation and Detectors",
    "Physics/Space Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "sRBerIVLkKPPRqjyuSM75RzYWwdKgPe5KfbXAqJCv10",
  "pdfSize": "1935014"
}