{
  "id": "2412.12448",
  "title": "Task-Parameter Nexus: Task-Specific Parameter Learning for Model-Based\n  Control",
  "authors": "Sheng Cheng, Ran Tao, Yuliang Gu, Shenlong Wang, Xiaofeng Wang, Naira\n  Hovakimyan",
  "authorsParsed": [
    [
      "Cheng",
      "Sheng",
      ""
    ],
    [
      "Tao",
      "Ran",
      ""
    ],
    [
      "Gu",
      "Yuliang",
      ""
    ],
    [
      "Wang",
      "Shenlong",
      ""
    ],
    [
      "Wang",
      "Xiaofeng",
      ""
    ],
    [
      "Hovakimyan",
      "Naira",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 01:24:02 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734398642000,
  "abstract": "  This paper presents the Task-Parameter Nexus (TPN), a learning-based approach\nfor online determination of the (near-)optimal control parameters of\nmodel-based controllers (MBCs) for tracking tasks. In TPN, a deep neural\nnetwork is introduced to predict the control parameters for any given tracking\ntask at runtime, especially when optimal parameters for new tasks are not\nimmediately available. To train this network, we constructed a trajectory bank\nwith various speeds and curvatures that represent different motion\ncharacteristics. Then, for each trajectory in the bank, we auto-tune the\noptimal control parameters offline and use them as the corresponding ground\ntruth. With this dataset, the TPN is trained by supervised learning. We\nevaluated the TPN on the quadrotor platform. In simulation experiments, it is\nshown that the TPN can predict near-optimal control parameters for a spectrum\nof tracking tasks, demonstrating its robust generalization capabilities to\nunseen tasks.\n",
  "subjects": [
    "Computer Science/Robotics",
    "Computer Science/Systems and Control",
    "Electrical Engineering and Systems Science/Systems and Control"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "lb09LHiY0LSkTJmTmr39-r9bAyQw9o1s2jkT0wKvpt0",
  "pdfSize": "1298336"
}