{"id":"2412.13625","title":"Ion acoustic and spin electron acoustic cnoidal waves in a spin\n  polarized plasma with exchange effects","authors":"B. Sania, Z. Iqbal, Ch. Rozina, Hafeez ur Rehman, and G. Abbas","authorsParsed":[["Sania","B.",""],["Iqbal","Z.",""],["Rozina","Ch.",""],["Rehman","Hafeez ur",""],["Abbas","G.",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 09:04:38 GMT"}],"updateDate":"2024-12-19","timestamp":1734512678000,"abstract":"  Separate spin evolution-quantum hydrodynamic (SSE-QHD) model is employed to\naddress the nonlinear propagation of ion-acoustic wave (IAW) and spin\nelectron-acoustic wave (SEAW) in a spin polarized electron-ion plasma. The\nanalysis has been made under the self-consistent field approximation and with\nexchange correlation effects. The reductive perturbation method (RPM) is used\nto derive KdV equation and its cnoidal wave solutions. We noted that the phase\nvelocity of IAW in the self-consistent field approximation is almost constant\nhowever, in the presence of exchange-correlation potential there is an abrupt\nchange in the phase velocity. The phase velocity of SEAW decreases in the\npresence of exchange-correlation effects as compare to self-consistent field\napproximation. We have calculated the condition for the existence of \\\nnonlinear structures and it is found that \\ in the presence of exchange effect\nthe condition satisfy for certain values of $\\eta$ at different densities.\nFurthermore, the comparisons have been made with and without exchange effects,\nit shows that although the nonlinear profiles of both waves are significantly\\\naffected with exchange effect but it also converts cnoidal structures of SEAW\nfrom rarefactive to compressive. The influence of exchange-correlation\npotential and spin polarization on the \\ profiles of both nonlinear structures\nis evaluated numerically. The present study may be helpful to understand\nformation of \\ new longitudinal cniondal structures in laboratory degenerate\nplasma.\n","subjects":["Physics/Plasma Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"vsN8xwmQdiG1O1QJL5hX3SbU6xsgTnnvPEi3BpZMiQ0","pdfSize":"387089"}