{"id":"2412.02293","title":"FL-QDSNNs: Federated Learning with Quantum Dynamic Spiking Neural\n  Networks","authors":"Nouhaila Innan, Alberto Marchisio, and Muhammad Shafique","authorsParsed":[["Innan","Nouhaila",""],["Marchisio","Alberto",""],["Shafique","Muhammad",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 09:08:33 GMT"}],"updateDate":"2024-12-04","timestamp":1733216913000,"abstract":"  This paper introduces the Federated Learning-Quantum Dynamic Spiking Neural\nNetworks (FL-QDSNNs) framework, an innovative approach specifically designed to\ntackle significant challenges in distributed learning systems, such as\nmaintaining high accuracy while ensuring privacy. Central to our framework is a\nnovel dynamic threshold mechanism for activating quantum gates in Quantum\nSpiking Neural Networks (QSNNs), which mimics classical activation functions\nwhile uniquely exploiting quantum operations to enhance computational\nperformance. This mechanism is essential for tackling the typical performance\nvariability across dynamically changing data distributions, a prevalent\nchallenge in conventional QSNNs applications. Validated through extensive\ntesting on datasets including Iris, digits, and breast cancer, our FL-QDSNNs\nframework has demonstrated superior accuracies-up to 94% on the Iris dataset\nand markedly outperforms existing Quantum Federated Learning (QFL) approaches.\nOur results reveal that our FL-QDSNNs framework offers scalability with respect\nto the number of clients, provides improved learning capabilities, and\nrepresents a robust solution to privacy and efficiency limitations posed by\nemerging quantum hardware and complex QSNNs training protocols. By\nfundamentally advancing the operational capabilities of QSNNs in real-world\ndistributed environments, this framework can potentially redefine the\napplication landscape of quantum computing in sensitive and critical sectors,\nensuring enhanced data security and system performance.\n","subjects":["Physics/Quantum Physics","Computer Science/Emerging Technologies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"9Bw_JDOVrbqxDCIkuM7eg5vQnUQKVTGRmIN5T4eRVNs","pdfSize":"3778178"}