{
  "id": "2412.16750",
  "title": "Gradient-based Trajectory Optimization with Parallelized Differentiable\n  Traffic Simulation",
  "authors": "Sanghyun Son, Laura Zheng, Brian Clipp, Connor Greenwell, Sujin\n  Philip, Ming C. Lin",
  "authorsParsed": [
    [
      "Son",
      "Sanghyun",
      ""
    ],
    [
      "Zheng",
      "Laura",
      ""
    ],
    [
      "Clipp",
      "Brian",
      ""
    ],
    [
      "Greenwell",
      "Connor",
      ""
    ],
    [
      "Philip",
      "Sujin",
      ""
    ],
    [
      "Lin",
      "Ming C.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 21 Dec 2024 19:53:38 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 18 Feb 2025 03:28:35 GMT"
    }
  ],
  "updateDate": "2025-02-19",
  "timestamp": 1734810818000,
  "abstract": "  We present a parallelized differentiable traffic simulator based on the\nIntelligent Driver Model (IDM), a car-following framework that incorporates\ndriver behavior as key variables. Our vehicle simulator efficiently models\nvehicle motion, generating trajectories that can be supervised to fit\nreal-world data. By leveraging its differentiable nature, IDM parameters are\noptimized using gradient-based methods. With the capability to simulate up to 2\nmillion vehicles in real time, the system is scalable for large-scale\ntrajectory optimization. We show that we can use the simulator to filter noise\nin the input trajectories (trajectory filtering), reconstruct dense\ntrajectories from sparse ones (trajectory reconstruction), and predict future\ntrajectories (trajectory prediction), with all generated trajectories adhering\nto physical laws. We validate our simulator and algorithm on several datasets\nincluding NGSIM and Waymo Open Dataset. The code is publicly available at:\nhttps://github.com/SonSang/diffidm.\n",
  "subjects": [
    "Computer Science/Robotics",
    "Computer Science/Distributed, Parallel, and Cluster Computing",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "5Oa3lslBpA4CTk3iqqhu5nxuSvYHNjK1At1kfcqgkO0",
  "pdfSize": "1017984"
}