{
  "id": "2412.06124",
  "title": "Spiking Neural Networks for Radio Frequency Interference Detection in\n  Radio Astronomy",
  "authors": "Nicholas J. Pritchard, Andreas Wicenec, Mohammed Bennamoun and Richard\n  Dodson",
  "authorsParsed": [
    [
      "Pritchard",
      "Nicholas J.",
      ""
    ],
    [
      "Wicenec",
      "Andreas",
      ""
    ],
    [
      "Bennamoun",
      "Mohammed",
      ""
    ],
    [
      "Dodson",
      "Richard",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 01:02:30 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733706150000,
  "abstract": "  Spiking Neural Networks (SNNs) promise efficient spatio-temporal data\nprocessing owing to their dynamic nature. This paper addresses a significant\nchallenge in radio astronomy, Radio Frequency Interference (RFI) detection, by\nreformulating it as a time-series segmentation task inherently suited for SNN\nexecution. Automated RFI detection systems capable of real-time operation with\nminimal energy consumption are increasingly important in modern radio\ntelescopes. We explore several spectrogram-to-spike encoding methods and\nnetwork parameters, applying first-order leaky integrate-and-fire SNNs to\ntackle RFI detection. To enhance the contrast between RFI and background\ninformation, we introduce a divisive normalisation-inspired pre-processing\nstep, which improves detection performance across multiple encoding strategies.\nOur approach achieves competitive performance on a synthetic dataset and\ncompelling results on real data from the Low-Frequency Array (LOFAR)\ninstrument. To our knowledge, this work is the first to train SNNs on real\nradio astronomy data successfully. These findings highlight the potential of\nSNNs for performing complex time-series tasks, paving the way for efficient,\nreal-time processing in radio astronomy and other data-intensive fields.\n",
  "subjects": [
    "Computer Science/Neural and Evolutionary Computing",
    "Astrophysics/Instrumentation and Methods for Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "K1fvw_f60JxVxYAvBPVbXG8LmbHhsjr9hyUHP0H7Uvo",
  "pdfSize": "2738237"
}