{"id":"2412.01228","title":"Polarization of gamma-ray burst afterglows in the context of\n  non-axisymmetric structured jets","authors":"Jin-Da Li, He Gao, Shunke Ai, Wei-Hua Lei","authorsParsed":[["Li","Jin-Da",""],["Gao","He",""],["Ai","Shunke",""],["Lei","Wei-Hua",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 07:48:16 GMT"}],"updateDate":"2024-12-03","timestamp":1733125696000,"abstract":"  As the most energetic explosion in the universe, gamma-ray bursts (GRBs) are\nusually believed to be generated by relativistic jets. Some mechanisms (e.g.\ninternal non-uniform magnetic dissipation processes or the precession of the\ncentral engine) may generate asymmetric jet structures, which is characterized\nby multiple fluctuations in the light curve of afterglow. Since the jet's\nstructure introduces asymmetry in radiation around the line of sight (LOS), it\nis naturally expected that polarization will be observable. In this work, we\nreveal the polarization characteristics of gamma-ray burst afterglows with a\nnon-axisymmetric structured jet. Our results show that the afterglow signal\ngenerally exhibits polarization, with the degree and evolution influenced by\nthe specific jet structure, observing frequency, and the line of sight (LOS).\nThe polarization degree is notably higher when the LOS is outside the jet. This\ndegree fluctuates over time as different regions of radiation alternate in\ntheir dominance, which is accompanied by the rotation of the polarization angle\nand further reflects the intricate nature of the jet. Regarding its evolution\nover frequency, the polarization degree displays significant fluctuations at\nspectral breaks, with the polarization angle possibly undergoing abrupt\nchanges. These features may provide strong evidence for future identification\nof potential GRBs with asymmetric jet structures.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"VCgt92NB9YOvUAhyV-S8SQyzNdJse1mkDsIhbDHCnx0","pdfSize":"1362099"}