{"id":"2412.12285","title":"Multi-Messenger Cosmology: A Route to Accurate Inference of Dark Energy\n  Beyond CPL Parametrization from XG Detectors","authors":"Samsuzzaman Afroz, Suvodip Mukherjee","authorsParsed":[["Afroz","Samsuzzaman",""],["Mukherjee","Suvodip",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 19:01:02 GMT"},{"version":"v2","created":"Tue, 25 Feb 2025 06:49:08 GMT"}],"updateDate":"2025-02-26","timestamp":1734375662000,"abstract":"  One of the central challenges in modern cosmology is understanding the nature\nof dark energy and its evolution throughout the history of the Universe. Dark\nenergy is commonly modeled as a perfect fluid with a time-varying\nequation-of-state parameter, $w(z)$, often modeled under CPL parametrization\nusing two parameters $w_0$ and $w_a$. In this study, we explore both parametric\nand non-parametric methods to reconstruct the dark energy Equation of State\n(EoS) using Gravitational Wave (GW) sources, with and without electromagnetic\n(EM) counterparts called bright sirens and dark sirens respectively. In the\nparametric approach, we extend the widely used $w_0$-$w_a$ model by introducing\nan additional term, $w_b$, to better capture the evolving dynamics of dark\nenergy up to high redshift which is accessible from GW sources. This extension\nprovides increased flexibility in modeling the EoS and enables a more detailed\ninvestigation of dark energy's evolution. Our analysis indicates that, with\nfive years of observation time and a $75\\%$ duty cycle using Cosmic Explorer\nand the Einstein Telescope, it will be possible to measure the dark energy EoS\nwith remarkable precision, better than any other cosmological probe in the\ncoming years, from bright standard sirens using a multi-messenger approach.\nThese findings highlight the potential of GW observations in synergy with EM\ntelescopes to offer valuable insights into the nature of dark energy,\novercoming the current limitations in cosmological measurements.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"upqHZpiq0O2vZCiMePpkeDgVJ6ZG3Py_S-68iWIWzXU","pdfSize":"4020256"}