{
  "id": "2412.15322",
  "title": "Taming Multimodal Joint Training for High-Quality Video-to-Audio\n  Synthesis",
  "authors": "Ho Kei Cheng, Masato Ishii, Akio Hayakawa, Takashi Shibuya, Alexander\n  Schwing, Yuki Mitsufuji",
  "authorsParsed": [
    [
      "Cheng",
      "Ho Kei",
      ""
    ],
    [
      "Ishii",
      "Masato",
      ""
    ],
    [
      "Hayakawa",
      "Akio",
      ""
    ],
    [
      "Shibuya",
      "Takashi",
      ""
    ],
    [
      "Schwing",
      "Alexander",
      ""
    ],
    [
      "Mitsufuji",
      "Yuki",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 18:59:55 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734634795000,
  "abstract": "  We propose to synthesize high-quality and synchronized audio, given video and\noptional text conditions, using a novel multimodal joint training framework\nMMAudio. In contrast to single-modality training conditioned on (limited) video\ndata only, MMAudio is jointly trained with larger-scale, readily available\ntext-audio data to learn to generate semantically aligned high-quality audio\nsamples. Additionally, we improve audio-visual synchrony with a conditional\nsynchronization module that aligns video conditions with audio latents at the\nframe level. Trained with a flow matching objective, MMAudio achieves new\nvideo-to-audio state-of-the-art among public models in terms of audio quality,\nsemantic alignment, and audio-visual synchronization, while having a low\ninference time (1.23s to generate an 8s clip) and just 157M parameters. MMAudio\nalso achieves surprisingly competitive performance in text-to-audio generation,\nshowing that joint training does not hinder single-modality performance. Code\nand demo are available at: https://hkchengrex.github.io/MMAudio\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Machine Learning",
    "Computer Science/Sound",
    "Electrical Engineering and Systems Science/Audio and Speech Processing"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "5bMJ2a7lS4dR5UHmZpxRbwichPLkCsVcTfuens1YiDI",
  "pdfSize": "3601615"
}