{
  "id": "2412.02173",
  "title": "Keeping Experts in the Loop: Expert-Guided Optimization for Clinical\n  Data Classification using Large Language Models",
  "authors": "Nader Karayanni, Aya Awwad, Chein-Lien Hsiao, Surish P Shanmugam",
  "authorsParsed": [
    [
      "Karayanni",
      "Nader",
      ""
    ],
    [
      "Awwad",
      "Aya",
      ""
    ],
    [
      "Hsiao",
      "Chein-Lien",
      ""
    ],
    [
      "Shanmugam",
      "Surish P",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 05:05:13 GMT"
    }
  ],
  "updateDate": "2024-12-04",
  "timestamp": 1733202313000,
  "abstract": "  Since the emergence of Large Language Models (LLMs), the challenge of\neffectively leveraging their potential in healthcare has taken center stage. A\ncritical barrier to using LLMs for extracting insights from unstructured\nclinical notes lies in the prompt engineering process. Despite its pivotal role\nin determining task performance, a clear framework for prompt optimization\nremains absent. Current methods to address this gap take either a manual prompt\nrefinement approach, where domain experts collaborate with prompt engineers to\ncreate an optimal prompt, which is time-intensive and difficult to scale, or\nthrough employing automatic prompt optimizing approaches, where the value of\nthe input of domain experts is not fully realized. To address this, we propose\nStructEase, a novel framework that bridges the gap between automation and the\ninput of human expertise in prompt engineering. A core innovation of the\nframework is SamplEase, an iterative sampling algorithm that identifies\nhigh-value cases where expert feedback drives significant performance\nimprovements. This approach minimizes expert intervention, to effectively\nenhance classification outcomes. This targeted approach reduces labeling\nredundancy, mitigates human error, and enhances classification outcomes. We\nevaluated the performance of StructEase using a dataset of de-identified\nclinical narratives from the US National Electronic Injury Surveillance System\n(NEISS), demonstrating significant gains in classification performance compared\nto current methods. Our findings underscore the value of expert integration in\nLLM workflows, achieving notable improvements in F1 score while maintaining\nminimal expert effort. By combining transparency, flexibility, and scalability,\nStructEase sets the foundation for a framework to integrate expert input into\nLLM workflows in healthcare and beyond.\n",
  "subjects": [
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "JiYl339KrBL7fyPk86nK2teyVdIFTTx1wDJ6R8cMYwA",
  "pdfSize": "629238"
}