{"id":"2412.03717","title":"Electrocardiogram-based diagnosis of liver diseases: an externally\n  validated and explainable machine learning approach","authors":"Juan Miguel Lopez Alcaraz, Wilhelm Haverkamp, Nils Strodthoff","authorsParsed":[["Alcaraz","Juan Miguel Lopez",""],["Haverkamp","Wilhelm",""],["Strodthoff","Nils",""]],"versions":[{"version":"v1","created":"Wed, 4 Dec 2024 21:11:34 GMT"}],"updateDate":"2024-12-06","timestamp":1733346694000,"abstract":"  Background: Liver diseases are a major global health concern, often diagnosed\nusing resource-intensive methods. Electrocardiogram (ECG) data, widely\naccessible and non-invasive, offers potential as a diagnostic tool for liver\ndiseases, leveraging the physiological connections between cardiovascular and\nhepatic health.\n  Methods: This study applies machine learning models to ECG data for the\ndiagnosis of liver diseases. The pipeline, combining tree-based models with\nShapley values for explainability, was trained, internally validated, and\nexternally validated on an independent cohort, demonstrating robust\ngeneralizability.\n  Findings: Our results demonstrate the potential of ECG to derive biomarkers\nto diagnose liver diseases. Shapley values revealed key ECG features\ncontributing to model predictions, highlighting already known connections\nbetween cardiovascular biomarkers and hepatic conditions as well as providing\nnew ones. Furthermore, our approach holds promise as a scalable and affordable\nsolution for liver disease detection, particularly in resource-limited\nsettings.\n  Interpretation: This study underscores the feasibility of leveraging ECG\nfeatures and machine learning to enhance the diagnosis of liver diseases. By\nproviding interpretable insights into cardiovascular-liver interactions, the\napproach bridges existing gaps in non-invasive diagnostics, offering\nimplications for broader systemic disease monitoring.\n","subjects":["Computer Science/Machine Learning","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"oSoyxwputScU2tOLoccqp3W77xS6wv1frxcS2jlEWoc","pdfSize":"8071215"}