{"id":"2412.16045","title":"Millikelvin Nb nanoSQUID-embedded tuneable resonator fabricated with a\n  neon focused-ion-beam","authors":"Jamie A. Potter, Laith Meti, Gemma Chapman, Ed Romans, John Gallop,\n  Ling Hao","authorsParsed":[["Potter","Jamie A.",""],["Meti","Laith",""],["Chapman","Gemma",""],["Romans","Ed",""],["Gallop","John",""],["Hao","Ling",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 16:48:47 GMT"},{"version":"v2","created":"Fri, 3 Jan 2025 14:06:32 GMT"}],"updateDate":"2025-01-06","timestamp":1734713327000,"abstract":"  SQUID-embedded superconducting resonators are of great interest due to their\npotential for coupling highly scalable superconducting circuits with quantum\nmemories based on solid-state spin ensembles. Such an application requires a\nhigh-$Q$, frequency-tuneable resonator which is both resilient to magnetic\nfield, and able to operate at millikelvin temperatures. These requirements\nmotivate the use of a higher $H_{c}$ metal such as niobium, however the\nchallenge then becomes to sufficiently reduce the operating temperature. We\naddress this by presenting a monolithic Nb nanoSQUID-embedded resonator, where\nneon focused-ion-beam fabrication of the nanoSQUID results in a device\ndisplaying frequency tuneability at $T = 16$ mK. In order to assess the\napplicability of the device for coupling to small spin clusters, we\ncharacterise the flux sensitivity as a function of microwave drive power and\nexternally applied magnetic field, and find that the noise is dominated by\ndielectric noise in the resonator. Finally, we discuss improvements to the\ndevice design which can dramatically improve the flux sensitivity, which\nhighlights the promise of Nb SQUID-embedded resonators for hybrid\nsuperconductor-spin applications.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Superconductivity"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"HbjI56_vdHK3BaAi4u2C59UkM_2i2bVRb2xaOXFFiRA","pdfSize":"4704250"}