{
  "id": "2412.08669",
  "title": "Development and Justification of a Physical Layer Model Based on\n  Monitoring Data for Quantum Key Distribution",
  "authors": "Gian-Luca Haiden",
  "authorsParsed": [
    [
      "Haiden",
      "Gian-Luca",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 17:25:20 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1733851520000,
  "abstract": "  Quantum Key Distribution (QKD) is a promising technique for ensuring\nlong-term security in communication systems. Unlike conventional key exchange\nmethods like RSA, which quantum computers could theoretically break [1], QKD\noffers enhanced security based on quantum mechanics [2]. Despite its maturity\nand commercial availability, QKD devices often have undisclosed implementations\nand are tamper-protected. This thesis addresses the practical imperfections of\nQKD systems, such as low and fluctuating Secret Key Rates (SKR) and unstable\nperformance. By applying theoretical SKR derivations to measurement data from a\nQKD system in Poland, we gain insights into current system performance and\ndevelop machine learning (ML) models to predict system behavior.\n  Our methodologies include creating a theoretical QKD model [2] and\nimplementing ML models using tools like Keras (TensorFlow [3]). Key findings\nreveal that while theoretical models offer foundational insights, ML models\nprovide superior accuracy in forecasting QKD system performance, adapting to\nenvironmental and operational parameters. This thesis highlights the\nlimitations of theoretical models and underscores the practical relevance of ML\nmodels for QKD systems.\n  Future research should focus on developing a comprehensive physical layer\nmodel capable of doing long-term forcasting of the SKR. Such a model could\nprevent an encryption system form running out of keys if the SKR drops\nsignificantly. In summary, this thesis establishes a foundational approach for\nusing ML models to predict QKD system performance, paving the way for future\nadvancements in SKR long-term predictions.\n",
  "subjects": [
    "Physics/Quantum Physics",
    "Computer Science/Cryptography and Security"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "9QTiDwV1HG3HEfYrheANxPhX_cFu3aNGx_aRfHo_xmA",
  "pdfSize": "5354734"
}