{
  "id": "2412.04301",
  "title": "SwiftEdit: Lightning Fast Text-Guided Image Editing via One-Step\n  Diffusion",
  "authors": "Trong-Tung Nguyen, Quang Nguyen, Khoi Nguyen, Anh Tran, Cuong Pham",
  "authorsParsed": [
    [
      "Nguyen",
      "Trong-Tung",
      ""
    ],
    [
      "Nguyen",
      "Quang",
      ""
    ],
    [
      "Nguyen",
      "Khoi",
      ""
    ],
    [
      "Tran",
      "Anh",
      ""
    ],
    [
      "Pham",
      "Cuong",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 16:23:11 GMT"
    },
    {
      "version": "v2",
      "created": "Sat, 7 Dec 2024 09:17:10 GMT"
    },
    {
      "version": "v3",
      "created": "Sun, 15 Dec 2024 10:10:39 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1733415791000,
  "abstract": "  Recent advances in text-guided image editing enable users to perform image\nedits through simple text inputs, leveraging the extensive priors of multi-step\ndiffusion-based text-to-image models. However, these methods often fall short\nof the speed demands required for real-world and on-device applications due to\nthe costly multi-step inversion and sampling process involved. In response to\nthis, we introduce SwiftEdit, a simple yet highly efficient editing tool that\nachieve instant text-guided image editing (in 0.23s). The advancement of\nSwiftEdit lies in its two novel contributions: a one-step inversion framework\nthat enables one-step image reconstruction via inversion and a mask-guided\nediting technique with our proposed attention rescaling mechanism to perform\nlocalized image editing. Extensive experiments are provided to demonstrate the\neffectiveness and efficiency of SwiftEdit. In particular, SwiftEdit enables\ninstant text-guided image editing, which is extremely faster than previous\nmulti-step methods (at least 50 times faster) while maintain a competitive\nperformance in editing results. Our project page is at:\nhttps://swift-edit.github.io/\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "w-IUf4ZsfKfTIKhyVeu7V9XP8TYONBj7cXOnfcREQ14",
  "pdfSize": "12715716"
}