{
  "id": "2412.06641",
  "title": "Frequency entangled W states and quantum frequency translation protocols\n  via forward Brillouin interactions",
  "authors": "Andrew J. Shepherd and Ryan O. Behunin",
  "authorsParsed": [
    [
      "Shepherd",
      "Andrew J.",
      ""
    ],
    [
      "Behunin",
      "Ryan O.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 16:36:55 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733762215000,
  "abstract": "  Complex quantum states of light are not only central to advancing our\nunderstanding of quantum mechanics, but are also necessary for a variety of\nquantum protocols. High-dimensional, or multipartite, quantum states are of\nspecific interest, as they can exhibit unique properties both fundamentally and\nin application. The synthesis of high-dimensional, entangled photonic states\ncan take the form of various schemes, which result in varying forms of\nentanglement. Frequency-entanglement is specifically attractive due to\ncompatibility with integrated systems and resistance to decoherence in fiber\ntransportation; however, increasing the dimension of frequency-entangled states\nrequires a system that offers quantum interactions between a large set of\ndistinct frequencies. Here, we show how the phonon-photon interactions of\nforward Brillouin scattering, which offer access to a ladder of optical\nresonances permitted by a single mechanical mode, can be used for\nfast-synthesis of frequency-entangled, single-photon W states. In our proposed\nsystem, simultaneous laser pulses of different frequencies dynamically evolve\neither an injected single photon or a heralded single phonon, generating W\nstates of selected dimension and output frequency. This method enables the\nsynthesis of `perfect' W states by adjusting the pulse amplitudes. In addition,\nwe show how this system can be used for quantum frequency translation.\n",
  "subjects": [
    "Physics/Quantum Physics",
    "Physics/Optics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "mljkJANeyV2JeUg09X9nObocQvqcpa6t2KlTgshVaRE",
  "pdfSize": "1586835"
}