{
  "id": "2412.16859",
  "title": "Adversarial Diffusion Model for Unsupervised Domain-Adaptive Semantic\n  Segmentation",
  "authors": "Jongmin Yu, Zhongtian Sun, Shan Luo",
  "authorsParsed": [
    [
      "Yu",
      "Jongmin",
      ""
    ],
    [
      "Sun",
      "Zhongtian",
      ""
    ],
    [
      "Luo",
      "Shan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 22 Dec 2024 04:55:41 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734843341000,
  "abstract": "  Semantic segmentation requires labour-intensive labelling tasks to obtain the\nsupervision signals, and because of this issue, it is encouraged that using\ndomain adaptation, which transfers information from the existing labelled\nsource domains to unlabelled or weakly labelled target domains, is essential.\nHowever, it is intractable to find a well-generalised representation which can\ndescribe two domains due to probabilistic or geometric difference between the\ntwo domains. This paper presents a novel method, the Conditional and\nInter-coder Connected Latent Diffusion (CICLD) based Semantic Segmentation\nModel, to advance unsupervised domain adaptation (UDA) for semantic\nsegmentation tasks. Leveraging the strengths of latent diffusion models and\nadversarial learning, our method effectively bridges the gap between synthetic\nand real-world imagery. CICLD incorporates a conditioning mechanism to improve\ncontextual understanding during segmentation and an inter-coder connection to\npreserve fine-grained details and spatial hierarchies. Additionally,\nadversarial learning aligns latent feature distributions across source, mixed,\nand target domains, further enhancing generalisation. Extensive experiments are\nconducted across three benchmark datasets-GTA5, Synthia, and Cityscape-shows\nthat CICLD outperforms state-of-the-art UDA methods. Notably, the proposed\nmethod achieves a mean Intersection over Union (mIoU) of 74.4 for the GTA5 to\nCityscape UDA setting and 67.2 mIoU for the Synthia to Cityscape UDA setting.\nThis project is publicly available on 'https://github.com/andreYoo/CICLD'.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "dkC0l467ZAlUlO1G__Z8PkkKIt3LcLouGHGXWFXOm3U",
  "pdfSize": "5808584"
}