{
  "id": "2412.11679",
  "title": "Bias Vector: Mitigating Biases in Language Models with Task Arithmetic\n  Approach",
  "authors": "Daiki Shirafuji, Makoto Takenaka and Shinya Taguchi",
  "authorsParsed": [
    [
      "Shirafuji",
      "Daiki",
      ""
    ],
    [
      "Takenaka",
      "Makoto",
      ""
    ],
    [
      "Taguchi",
      "Shinya",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 11:38:23 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734349103000,
  "abstract": "  The use of language models (LMs) has increased considerably in recent years,\nand the biases and stereotypes in training data that are reflected in the LM\noutputs are causing social problems. In this paper, inspired by the task\narithmetic, we propose the ``Bias Vector'' method for the mitigation of these\nLM biases. The Bias Vector method does not require manually created debiasing\ndata. The three main steps of our approach involve: (1) continual training the\npre-trained LMs on biased data using masked language modeling; (2) constructing\nthe Bias Vector as the difference between the weights of the biased LMs and\nthose of pre-trained LMs; and (3) subtracting the Bias Vector from the weights\nof the pre-trained LMs for debiasing. We evaluated the Bias Vector method on\nthe SEAT across three LMs and confirmed an average improvement of 0.177 points.\nWe demonstrated that the Bias Vector method does not degrade the LM performance\non downstream tasks in the GLUE benchmark. In addition, we examined the impact\nof scaling factors, which control the magnitudes of Bias Vectors, with effect\nsizes on the SEAT and conducted a comprehensive evaluation of our debiased LMs\nacross both the SEAT and GLUE benchmarks.\n",
  "subjects": [
    "Computer Science/Computation and Language",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "oPyMyQVetsQQJ_n8w7Fw7uCCUbejJexDxI2l54v-E_4",
  "pdfSize": "522989"
}