{
  "id": "2412.07241",
  "title": "Human-Computer Interaction and Human-AI Collaboration in Advanced Air\n  Mobility: A Comprehensive Review",
  "authors": "Fatma Yamac Sagirli, Xiaopeng Zhao, Zhenbo Wang",
  "authorsParsed": [
    [
      "Sagirli",
      "Fatma Yamac",
      ""
    ],
    [
      "Zhao",
      "Xiaopeng",
      ""
    ],
    [
      "Wang",
      "Zhenbo",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 07:06:52 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733814412000,
  "abstract": "  The increasing rates of global urbanization and vehicle usage are leading to\na shift of mobility to the third dimension-through Advanced Air Mobility\n(AAM)-offering a promising solution for faster, safer, cleaner, and more\nefficient transportation. As air transportation continues to evolve with more\nautomated and autonomous systems, advancements in AAM require a deep\nunderstanding of human-computer interaction and human-AI collaboration to\nensure safe and effective operations in complex urban and regional\nenvironments. There has been a significant increase in publications regarding\nthese emerging applications; thus, there is a need to review developments in\nthis area. This paper comprehensively reviews the current state of research on\nhuman-computer interaction and human-AI collaboration in AAM. Specifically, we\nfocus on AAM applications related to the design of human-machine interfaces for\nvarious uses, including pilot training, air traffic management, and the\nintegration of AI-assisted decision-making systems with immersive technologies\nsuch as extended, virtual, mixed, and augmented reality devices. Additionally,\nwe provide a comprehensive analysis of the challenges AAM encounters in\nintegrating human-computer frameworks, including unique challenges associated\nwith these interactions, such as trust in AI systems and safety concerns.\nFinally, we highlight emerging opportunities and propose future research\ndirections to bridge the gap between human factors and technological\nadvancements in AAM.\n",
  "subjects": [
    "Computer Science/Human-Computer Interaction",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "MA6sql7pWNkiuu_WWLbwp09M76kJvxtlZCGRFMTPRSc",
  "pdfSize": "2499424"
}