{
  "id": "2412.01874",
  "title": "The Design and Implementation of a Quantum Information Science\n  Undergraduate Program",
  "authors": "Sarah Blanchette, Dani\\`ele Normandin, Michel Pioro-Ladri\\`ere, Lyne\n  St-Hilaire, Armand Soldera, Karl Thibault and Dave Touchette",
  "authorsParsed": [
    [
      "Blanchette",
      "Sarah",
      ""
    ],
    [
      "Normandin",
      "Danièle",
      ""
    ],
    [
      "Pioro-Ladrière",
      "Michel",
      ""
    ],
    [
      "St-Hilaire",
      "Lyne",
      ""
    ],
    [
      "Soldera",
      "Armand",
      ""
    ],
    [
      "Thibault",
      "Karl",
      ""
    ],
    [
      "Touchette",
      "Dave",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 17:24:35 GMT"
    }
  ],
  "updateDate": "2024-12-04",
  "timestamp": 1733160275000,
  "abstract": "  Quantum information science is a burgeoning research field attracting vast\npublic and private investment in the last decade. This quick rise has led to a\ntalent gap, where there are more open positions than new graduates who can fill\nthese roles. To meet this critical need, higher education has been challenged\nto react accordingly by assuring a flow of highly skilled individuals who must\nbe trained quickly. We thus present how Universit\\'e de Sherbrooke, in Quebec,\nCanada, responded by creating and launching an innovative undergraduate degree\nin quantum information science, aiming to address this gap by training quantum\nsoftware developers in three and a half years. At the end of this program, they\nwill be ready to join the quantum workforce. We detail the creative process\nleading to a coherent curriculum, as well as why the local ecosystem led to\nthese choices. The guiding principles and lessons learned during the\ndevelopment of this interdepartmental and interfaculty degree are shared to\ninspire other quantum education institutions.\n",
  "subjects": [
    "Physics/Physics Education",
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "JC2tZxaLzNm4Uscy4-rmVoulHWHUdU7eVihrnQBtxBY",
  "pdfSize": "433913"
}