{"id":"2412.07030","title":"FM2DS: Few-Shot Multimodal Multihop Data Synthesis with Knowledge\n  Distillation for Question Answering","authors":"Amirhossein Abaskohi, Spandana Gella, Giuseppe Carenini, Issam H.\n  Laradji","authorsParsed":[["Abaskohi","Amirhossein",""],["Gella","Spandana",""],["Carenini","Giuseppe",""],["Laradji","Issam H.",""]],"versions":[{"version":"v1","created":"Mon, 9 Dec 2024 22:35:44 GMT"},{"version":"v2","created":"Tue, 17 Dec 2024 20:38:21 GMT"},{"version":"v3","created":"Sat, 1 Feb 2025 10:26:39 GMT"}],"updateDate":"2025-02-04","timestamp":1733783744000,"abstract":"  Multimodal multihop question answering is a complex task that requires\nreasoning over multiple sources of information, such as images and text, to\nanswer questions. While there has been significant progress in visual question\nanswering, the multihop setting remains unexplored due to the lack of\nhigh-quality datasets. Current methods focus on single-hop question answering\nor a single modality, which makes them unsuitable for real-world scenarios such\nas analyzing multimodal educational materials, summarizing lengthy academic\narticles, or interpreting scientific studies that combine charts, images, and\ntext. To address this gap, we propose a novel methodology, introducing the\nfirst framework for creating a high-quality dataset that enables training\nmodels for multimodal multihop question answering. Our approach consists of a\n5-stage pipeline that involves acquiring relevant multimodal documents from\nWikipedia, synthetically generating high-level questions and answers, and\nvalidating them through rigorous criteria to ensure quality data. We evaluate\nour methodology by training models on our synthesized dataset and testing on\ntwo benchmarks, our results demonstrate that, with an equal sample size, models\ntrained on our synthesized data outperform those trained on human-collected\ndata by 1.9 in exact match (EM) on average. We believe our data synthesis\nmethod will serve as a strong foundation for training and evaluating multimodal\nmultihop question answering models.\n","subjects":["Computer Science/Computation and Language","Computer Science/Artificial Intelligence","Computer Science/Computer Vision and Pattern Recognition","Computer Science/Information Retrieval","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"fQAGr8WKYYzhb_uFXNSU__xSETHS9OmX2EZyWIfOIbQ","pdfSize":"16026774"}