{"id":"2412.18028","title":"Diverse dust populations in the near-Sun environment characterized by\n  PSP/IS$\\odot$IS","authors":"M. M. Shen, J. R. Szalay, P. Pokorn\\'y, J. G. Mitchell, M. E. Hill, D.\n  G. Mitchell, D. J. McComas, E. R. Christian, C. M. S. Cohen, N. A. Schwadron,\n  S. D. Bale, D. M. Malaspina","authorsParsed":[["Shen","M. M.",""],["Szalay","J. R.",""],["Pokorný","P.",""],["Mitchell","J. G.",""],["Hill","M. E.",""],["Mitchell","D. G.",""],["McComas","D. J.",""],["Christian","E. R.",""],["Cohen","C. M. S.",""],["Schwadron","N. A.",""],["Bale","S. D.",""],["Malaspina","D. M.",""]],"versions":[{"version":"v1","created":"Mon, 23 Dec 2024 22:47:52 GMT"},{"version":"v2","created":"Sat, 28 Dec 2024 19:19:23 GMT"}],"updateDate":"2024-12-31","timestamp":1734994072000,"abstract":"  The Integrated Science Investigation of the Sun (IS$\\odot$IS) energetic\nparticle instrument suite on Parker Solar Probe is dedicated to measuring\nenergetic ions and electrons in the near-Sun environment. It includes a\nhalf-sky-viewing time-of-flight mass spectrometer (EPI-Lo) and five high-energy\nsilicon solid-state detector-telescopes (EPI-Hi). To August 2024, eight of\nEPI-Lo's eighty separate telescope foils have experienced direct dust puncture\nevents, most of which occurred inside 40 solar radii (0.19 au). These impacts\nrepresent the closest ever direct dust detections to the Sun. While there is\nlimited information about the size/mass of each impact due to the lack of a\ndedicated dust instrument, we can determine the impact direction for six\npunctures, allowing us to partially constrain the inner zodiacal abundance.\nRemarkably, one of six unambiguous dust impacters was likely on a retrograde\norbit, suggesting long-period cometary material may survive within 20 solar\nradii (0.09 au). We discuss observations in the context of improving our\nunderstanding of the inner zodiacal dust environment, highlighting multiple\ndust populations responsible for these events, and refining hazard assessment\nfor near-Sun spacecraft.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Solar and Stellar Astrophysics","Physics/Space Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"fviMcFbwoxynsL5xDizfs80Vy2Agkv2HFmdaTtMEfXk","pdfSize":"14460709"}