{
  "id": "2412.05148",
  "title": "LoRA.rar: Learning to Merge LoRAs via Hypernetworks for Subject-Style\n  Conditioned Image Generation",
  "authors": "Donald Shenaj, Ondrej Bohdal, Mete Ozay, Pietro Zanuttigh, Umberto\n  Michieli",
  "authorsParsed": [
    [
      "Shenaj",
      "Donald",
      ""
    ],
    [
      "Bohdal",
      "Ondrej",
      ""
    ],
    [
      "Ozay",
      "Mete",
      ""
    ],
    [
      "Zanuttigh",
      "Pietro",
      ""
    ],
    [
      "Michieli",
      "Umberto",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 16:04:56 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733501096000,
  "abstract": "  Recent advancements in image generation models have enabled personalized\nimage creation with both user-defined subjects (content) and styles. Prior\nworks achieved personalization by merging corresponding low-rank adaptation\nparameters (LoRAs) through optimization-based methods, which are\ncomputationally demanding and unsuitable for real-time use on\nresource-constrained devices like smartphones. To address this, we introduce\nLoRA$.$rar, a method that not only improves image quality but also achieves a\nremarkable speedup of over $4000\\times$ in the merging process. LoRA$.$rar\npre-trains a hypernetwork on a diverse set of content-style LoRA pairs,\nlearning an efficient merging strategy that generalizes to new, unseen\ncontent-style pairs, enabling fast, high-quality personalization. Moreover, we\nidentify limitations in existing evaluation metrics for content-style quality\nand propose a new protocol using multimodal large language models (MLLM) for\nmore accurate assessment. Our method significantly outperforms the current\nstate of the art in both content and style fidelity, as validated by MLLM\nassessments and human evaluations.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "e9CvyKgauvn5ePoRTECVPCVSaNSQ8FqXYOvT6L2fqv4",
  "pdfSize": "26076481"
}