{"id":"2412.11463","title":"FedCAR: Cross-client Adaptive Re-weighting for Generative Models in\n  Federated Learning","authors":"Minjun Kim, Minjee Kim, and Jinhoon Jeong","authorsParsed":[["Kim","Minjun",""],["Kim","Minjee",""],["Jeong","Jinhoon",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 05:43:14 GMT"}],"updateDate":"2024-12-17","timestamp":1734327794000,"abstract":"  Generative models trained on multi-institutional datasets can provide an\nenriched understanding through diverse data distributions. However, training\nthe models on medical images is often challenging due to hospitals' reluctance\nto share data for privacy reasons. Federated learning(FL) has emerged as a\nprivacy-preserving solution for training distributed datasets across data\ncenters by aggregating model weights from multiple clients instead of sharing\nraw data. Previous research has explored the adaptation of FL to generative\nmodels, yet effective aggregation algorithms specifically tailored for\ngenerative models remain unexplored. We hereby propose a novel algorithm aimed\nat improving the performance of generative models within FL. Our approach\nadaptively re-weights the contribution of each client, resulting in\nwell-trained shared parameters. In each round, the server side measures the\ndistribution distance between fake images generated by clients instead of\ndirectly comparing the Fr\\'echet Inception Distance per client, thereby\nenhancing efficiency of the learning. Experimental results on three public\nchest X-ray datasets show superior performance in medical image generation,\noutperforming both centralized learning and conventional FL algorithms. Our\ncode is available at https://github.com/danny0628/FedCAR.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Artificial Intelligence","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"7VpkTS_kNrXsMVof1uZ4QZ5AQNSHpj4ILlWdvt5p1EA","pdfSize":"877008"}