{"id":"2412.15119","title":"Parallelized Autoregressive Visual Generation","authors":"Yuqing Wang, Shuhuai Ren, Zhijie Lin, Yujin Han, Haoyuan Guo, Zhenheng\n  Yang, Difan Zou, Jiashi Feng, Xihui Liu","authorsParsed":[["Wang","Yuqing",""],["Ren","Shuhuai",""],["Lin","Zhijie",""],["Han","Yujin",""],["Guo","Haoyuan",""],["Yang","Zhenheng",""],["Zou","Difan",""],["Feng","Jiashi",""],["Liu","Xihui",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 17:59:54 GMT"}],"updateDate":"2024-12-20","timestamp":1734631194000,"abstract":"  Autoregressive models have emerged as a powerful approach for visual\ngeneration but suffer from slow inference speed due to their sequential\ntoken-by-token prediction process. In this paper, we propose a simple yet\neffective approach for parallelized autoregressive visual generation that\nimproves generation efficiency while preserving the advantages of\nautoregressive modeling. Our key insight is that parallel generation depends on\nvisual token dependencies-tokens with weak dependencies can be generated in\nparallel, while strongly dependent adjacent tokens are difficult to generate\ntogether, as their independent sampling may lead to inconsistencies. Based on\nthis observation, we develop a parallel generation strategy that generates\ndistant tokens with weak dependencies in parallel while maintaining sequential\ngeneration for strongly dependent local tokens. Our approach can be seamlessly\nintegrated into standard autoregressive models without modifying the\narchitecture or tokenizer. Experiments on ImageNet and UCF-101 demonstrate that\nour method achieves a 3.6x speedup with comparable quality and up to 9.5x\nspeedup with minimal quality degradation across both image and video generation\ntasks. We hope this work will inspire future research in efficient visual\ngeneration and unified autoregressive modeling. Project page:\nhttps://epiphqny.github.io/PAR-project.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"44wK1iYJ_-tNCor63Z2NQbVgXrTgX_BmIdDbv-LM6ro","pdfSize":"18597278"}