{
  "id": "2412.13343",
  "title": "Design Kinetic Parameters for Improved Resilience of Materials under\n  Irradiation",
  "authors": "Mohammadhossein Nahavandian, Eda Aydogan, Jesper Byggm\\\"astar, Matheus\n  A. Tunes, Enrique Martinez, Osman El-Atwani",
  "authorsParsed": [
    [
      "Nahavandian",
      "Mohammadhossein",
      ""
    ],
    [
      "Aydogan",
      "Eda",
      ""
    ],
    [
      "Byggmästar",
      "Jesper",
      ""
    ],
    [
      "Tunes",
      "Matheus A.",
      ""
    ],
    [
      "Martinez",
      "Enrique",
      ""
    ],
    [
      "El-Atwani",
      "Osman",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 21:38:02 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734471482000,
  "abstract": "  High entropy alloys (HEAs) have captured much attention in recent years due\nto their conceivably improved radiation resistance compared to pure metals and\ntraditional alloys. However, among HEAs, there are millions of design\npossibilities considering all potential compositions. In this study, we develop\ncriteria to design HEAs with improved radiation resilience taking into\nconsideration defect properties to promote interstitial-vacancy recombination.\nFirst, we conduct rate theory calculations on defects followed by molecular\ndynamics (MD) simulations on pure W and W-based multicomponent concentrated\nalloys. It is found that when the diffusion coefficients for single vacancies\nand interstitials become similar and the effective migration energies of\ndefects is minimum (maximum diffusivities), defect recombination becomes\noptimal, and the concentration of defects is significantly reduced. This is\nsupported by MD simulations indicating improved radiation resistance of V- and\nCr-based alloys, which satisfy the above-stated criteria. Furthermore,\nexperimental observations also reinforce the proposed approach. This study\nsheds light on the design criteria for improved radiation resistance and helps\nmaterial selection without the need of extensive experimental work.\n",
  "subjects": [
    "Condensed Matter/Materials Science"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "B4VnB7bQokXlr1rf9467V90UbgPmHNEr7XFqVEy8brU",
  "pdfSize": "777020"
}