{"id":"2412.18238","title":"Lensless speckle reconstructive spectrometer via physics-aware neural\n  network","authors":"Junrui Liang, Min Jiang, Zhongming Huang, Junhong He, Yanting Guo,\n  Yanzhao Ke, Jun Ye, Jiangming Xu, Jun Li, Jinyong Leng and Pu Zhou","authorsParsed":[["Liang","Junrui",""],["Jiang","Min",""],["Huang","Zhongming",""],["He","Junhong",""],["Guo","Yanting",""],["Ke","Yanzhao",""],["Ye","Jun",""],["Xu","Jiangming",""],["Li","Jun",""],["Leng","Jinyong",""],["Zhou","Pu",""]],"versions":[{"version":"v1","created":"Tue, 24 Dec 2024 07:45:43 GMT"}],"updateDate":"2024-12-25","timestamp":1735026343000,"abstract":"  The speckle field yielded by disordered media is extensively employed for\nspectral measurements. Existing speckle reconstructive spectrometers (RSs)\nimplemented by neural networks primarily rely on supervised learning, which\nnecessitates large-scale spectra-speckle pairs. However, beyond system\nstability requirements for prolonged data collection, generating diverse\nspectra with high resolution and finely labeling them is particularly\ndifficult. A lack of variety in datasets hinders the generalization of neural\nnetworks to new spectrum types. Here we avoid this limitation by introducing\nPhyspeNet, an untrained spectrum reconstruction framework combining a\nconvolutional neural network (CNN) with a physical model of a chaotic optical\ncavity. Without pre-training and prior knowledge about the spectrum under test,\nPhyspeNet requires only a single captured speckle for various multi-wavelength\nreconstruction tasks. Experimentally, we demonstrate a lens-free, snapshot RS\nsystem by leveraging the one-to-many mapping between spatial and spectrum\ndomains in a random medium. Dual-wavelength peaks separated by 2 pm can be\ndistinguished, and a maximum working bandwidth of 40 nm is achieved with high\nmeasurement accuracy. This approach establishes a new paradigm for neural\nnetwork-based RS systems, entirely eliminating reliance on datasets while\nensuring that computational results exhibit a high degree of generalizability\nand physical explainability.\n","subjects":["Physics/Optics","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"sXjgYNqpnv4vSAT17J5vNfAG3kxL0lxZSRLDEimEZZI","pdfSize":"1675386"}