{
  "id": "2412.10570",
  "title": "Adaptive Sampling to Reduce Epistemic Uncertainty Using Prediction\n  Interval-Generation Neural Networks",
  "authors": "Giorgio Morales, John Sheppard",
  "authorsParsed": [
    [
      "Morales",
      "Giorgio",
      ""
    ],
    [
      "Sheppard",
      "John",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 21:21:47 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734124907000,
  "abstract": "  Obtaining high certainty in predictive models is crucial for making informed\nand trustworthy decisions in many scientific and engineering domains. However,\nextensive experimentation required for model accuracy can be both costly and\ntime-consuming. This paper presents an adaptive sampling approach designed to\nreduce epistemic uncertainty in predictive models. Our primary contribution is\nthe development of a metric that estimates potential epistemic uncertainty\nleveraging prediction interval-generation neural networks. This estimation\nrelies on the distance between the predicted upper and lower bounds and the\nobserved data at the tested positions and their neighboring points. Our second\ncontribution is the proposal of a batch sampling strategy based on Gaussian\nprocesses (GPs). A GP is used as a surrogate model of the networks trained at\neach iteration of the adaptive sampling process. Using this GP, we design an\nacquisition function that selects a combination of sampling locations to\nmaximize the reduction of epistemic uncertainty across the domain. We test our\napproach on three unidimensional synthetic problems and a multi-dimensional\ndataset based on an agricultural field for selecting experimental fertilizer\nrates. The results demonstrate that our method consistently converges faster to\nminimum epistemic uncertainty levels compared to Normalizing Flows Ensembles,\nMC-Dropout, and simple GPs.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Statistics/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "FaYNvonObL6IztEoRE2Fy6HrZJnrU47gBp1iuKpMfJU",
  "pdfSize": "3772389"
}