{"id":"2412.08692","title":"The Spin-Orbit Alignment of 8 Warm Gas Giant Systems","authors":"Juan I. Espinoza-Retamal, Andr\\'es Jord\\'an, Rafael Brahm, Cristobal\n  Petrovich, Elyar Sedaghati, Gu{\\dh}mundur Stef\\'ansson, Melissa J. Hobson,\n  Marcelo Tala Pinto, Diego J. Mu\\~noz, Gavin Boyle, Rodrigo Leiva, Vincent Suc","authorsParsed":[["Espinoza-Retamal","Juan I.",""],["Jordán","Andrés",""],["Brahm","Rafael",""],["Petrovich","Cristobal",""],["Sedaghati","Elyar",""],["Stefánsson","Guðmundur",""],["Hobson","Melissa J.",""],["Pinto","Marcelo Tala",""],["Muñoz","Diego J.",""],["Boyle","Gavin",""],["Leiva","Rodrigo",""],["Suc","Vincent",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 19:00:00 GMT"}],"updateDate":"2024-12-13","timestamp":1733943600000,"abstract":"  Essential information about the formation and evolution of planetary systems\ncan be found in their architectures -- in particular, in stellar obliquity\n($\\psi$) -- as they serve as a signature of their dynamical evolution. Here, we\npresent ESPRESSO observations of the Rossiter-Mclaughlin (RM) effect of 8 warm\ngas giants, revealing that independent of the eccentricities, all of them have\nrelatively aligned orbits. Our 5 warm Jupiters -- WASP-106 b, WASP-130 b,\nTOI-558 b, TOI-4515 b, and TOI-5027 b -- have sky-projected obliquities\n$|\\lambda|\\simeq0-10$ deg while the 2 less massive warm Saturns -- K2-139 b and\nK2-329 A b -- are slightly misaligned having $|\\lambda|\\simeq15-25$ deg.\nFurthermore, for K2-139 b, K2-329 A b, and TOI-4515 b, we also measure true 3D\nobliquities $\\psi\\simeq15-30$ deg. We also report a non-detection of the RM\neffect produced by TOI-2179 b. Through hierarchical Bayesian modeling of the\ntrue 3D obliquities of hot and warm Jupiters, we find that around single stars,\nwarm Jupiters are statistically more aligned than hot Jupiters. Independent of\neccentricities, 95\\% of the warm Jupiters have $\\psi\\lesssim30$ deg with no\nmisaligned planets, while hot Jupiters show an almost isotropic distribution of\nmisaligned systems. This implies that around single stars, warm Jupiters form\nin primordially aligned protoplanetary disks and subsequently evolve in a more\nquiescent way than hot Jupiters. Finally, we find that Saturns may have\nslightly more misaligned orbits than warm Jupiters, but more obliquity\nmeasurements are necessary to be conclusive.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Hdib5T-gjaRShvQDvPW8TDH8G-xe6n95MWRdpPpdQRk","pdfSize":"12286221"}