{
  "id": "2412.06608",
  "title": "Scintillations in Southern Europe during the geomagnetic storm of June\n  2015: analysis of a plasma bubbles spill-over using ground-based data",
  "authors": "Anna Morozova, Luca Spogli, Teresa Barata, Rayan Imam, Emanuele Pica,\n  Juan Andr\\'es Cahuasqu\\'i, Mohammed Mainul Hoque, Norbert Jakowski and\n  Daniela Esta\\c{c}o",
  "authorsParsed": [
    [
      "Morozova",
      "Anna",
      ""
    ],
    [
      "Spogli",
      "Luca",
      ""
    ],
    [
      "Barata",
      "Teresa",
      ""
    ],
    [
      "Imam",
      "Rayan",
      ""
    ],
    [
      "Pica",
      "Emanuele",
      ""
    ],
    [
      "Cahuasquí",
      "Juan Andrés",
      ""
    ],
    [
      "Hoque",
      "Mohammed Mainul",
      ""
    ],
    [
      "Jakowski",
      "Norbert",
      ""
    ],
    [
      "Estaço",
      "Daniela",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 15:58:54 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733759934000,
  "abstract": "  The sensitivity of Global Navigation Satellite Systems (GNSS) receivers to\nionospheric disturbances and their constant growth are nowadays resulting in an\nincreased concern of GNSS-users about the impacts of ionospheric disturbances\nat mid-latitudes. The geomagnetic storm of June 2015 is an example of a rare\nphenomenon of a spill-over of equatorial plasma bubbles well North from their\nhabitual. We study the occurrence of small- and medium-scale irregularities in\nthe North Atlantic Eastern-Mediterranean mid- and low-latitudinal zone by\nanalysing the behaviour of the amplitude scintillation index S4 and of the rate\nof total electron content index (ROTI) during such a storm. In addition, large\nscale perturbations of the ionospheric electron density were studied using\nground and space-born instruments, thus characterizing a complex perturbation\nbehaviour over the region mentioned above. The multi-source data allows us to\ncharacterize the impact of irregularities of different scales to better\nunderstand the ionospheric dynamics and stress the importance of a proper\nmonitoring of the ionosphere in the studied region.\n",
  "subjects": [
    "Physics/Geophysics",
    "Physics/Space Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "KUw9BCTIEEHQCNPsELWKf5z2SS52R5WhBHb8lyNnmPM",
  "pdfSize": "6898013"
}