{
  "id": "2412.17813",
  "title": "Internet of medical things for non-invasive and non-contact dehydration\n  monitoring away from the hospital: state-of-the-art, challenges and prospects",
  "authors": "Soumia Siyoucef, Rose Al-Aslani, Mourad Adnane, Muhammad Mahboob Ur\n  Rahman, Taous-Meriem Laleg-Kirati, Tareq Y. Al-Naffouri",
  "authorsParsed": [
    [
      "Siyoucef",
      "Soumia",
      ""
    ],
    [
      "Al-Aslani",
      "Rose",
      ""
    ],
    [
      "Adnane",
      "Mourad",
      ""
    ],
    [
      "Rahman",
      "Muhammad Mahboob Ur",
      ""
    ],
    [
      "Laleg-Kirati",
      "Taous-Meriem",
      ""
    ],
    [
      "Al-Naffouri",
      "Tareq Y.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 27 Nov 2024 19:39:14 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1732736354000,
  "abstract": "  Dehydration occurs when the body loses more water than it takes in. Mild\ndehydration can lead to fatigue, cognitive impairments, and physical\ncomplications, while severe dehydration can cause life-threatening conditions\nlike heat stroke, kidney damage, and hypovolemic shock. Traditional bio\nchemistry-based clinical gold standard methods are expensive, time-consuming,\nand invasive. Thus, there is a pressing need to design novel non-invasive\nmethods that could do in-situ, early and accurate detection of dehydration,\nwhich will in turn allow timely intervention. This article presents a\nmethodological review of the literature on a range of innovative internet of\nmedical things-based techniques for dehydration monitoring. We begin by briefly\ndescribing the pathophysiology of the dehydration problem, its clinical\nsignificance, and current clinical gold-standard methods for assessing\nhydration level. Subsequently, we critically examine a number of non-invasive\nand non-contact hydration assessment studies. We also discuss multi-modal\nsensing methods and assess the impact of dehydration among specific population\ngroups (e.g., elderly, infants, athletes) and on different organs. We also\nprovide a list of existing public and private datasets which make the backbone\nof machine learning-driven research on dehydration monitoring. Finally, we\nprovide our opinion statement on the challenges and future prospects of\nnon-invasive and non-contact hydration monitoring.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Signal Processing"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "4_EGJFDB6MfHGhUNKXLNhuLJnTihwGKxTj07cp_CfaE",
  "pdfSize": "4381031"
}