{"id":"2412.14743","title":"The Stellar Disk Structure Rrevealed by the Mono-age Populations of the\n  LAMOST Red Clump Sample","authors":"Zheng Yu, Bingqiu Chen, Jianhui Lian, Chun Wang, and Xiaowei Liu","authorsParsed":[["Yu","Zheng",""],["Chen","Bingqiu",""],["Lian","Jianhui",""],["Wang","Chun",""],["Liu","Xiaowei",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 11:20:40 GMT"}],"updateDate":"2024-12-20","timestamp":1734607240000,"abstract":"  Understanding the structure of the Galactic disk is crucial for understanding\nthe formation and evolutionary history of the Milky Way. This study examines\nthe structure of the Galactic disk by analyzing a sample of 138,667 primary red\nclump (RC) stars from the LAMOST and Gaia datasets. We have categorized these\nRC stars into mono-age populations and investigated their spatial distributions\nwithin the R - Z plane, estimating scale heights and lengths through the\nfitting of their vertical and radial density profiles. Our analysis indicates\nthat the vertical profiles of these mono-age populations fit a dual-component\ndisk model, where both components exhibit significant flaring, particularly in\nthe outer disk regions. Within a constant Galactocentric radius R, the scale\nheights of the first component, representing the morphologically thin disk,\nrise with age. In contrast, the scale heights of the second component,\ncorresponding to the morphologically thick disk, remain comparatively stable\nacross different age groups. Additionally, the radial density profiles of both\ndisk components predominantly peak within a radial range of 7.5-8.5 kpc. These\nfindings underscore the importance of age as a crucial factor in shaping the\nspatial distribution and structural evolution of the Galactic disk, offering\nvaluable insights into its complex dynamics and history.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"W3ClV1GWziF6g93VgRKtyqgZ-O4IXuQahr3ytbky7QU","pdfSize":"4071189"}