{
  "id": "2412.01217",
  "title": "RGBDS-SLAM: A RGB-D Semantic Dense SLAM Based on 3D Multi Level Pyramid\n  Gaussian Splatting",
  "authors": "Zhenzhong Cao, Chenyang Zhao, Qianyi Zhang, Jinzheng Guang, Yinuo Song\n  Jingtai Liu",
  "authorsParsed": [
    [
      "Cao",
      "Zhenzhong",
      ""
    ],
    [
      "Zhao",
      "Chenyang",
      ""
    ],
    [
      "Zhang",
      "Qianyi",
      ""
    ],
    [
      "Guang",
      "Jinzheng",
      ""
    ],
    [
      "Liu",
      "Yinuo Song Jingtai",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 07:36:30 GMT"
    },
    {
      "version": "v2",
      "created": "Wed, 4 Dec 2024 02:19:50 GMT"
    }
  ],
  "updateDate": "2024-12-05",
  "timestamp": 1733124990000,
  "abstract": "  High-quality reconstruction is crucial for dense SLAM. Recent popular\napproaches utilize 3D Gaussian Splatting (3D GS) techniques for RGB, depth, and\nsemantic reconstruction of scenes. However, these methods often overlook issues\nof detail and consistency in different parts of the scene. To address this, we\npropose RGBDS-SLAM, a RGB-D semantic dense SLAM system based on 3D multi-level\npyramid gaussian splatting, which enables high-quality dense reconstruction of\nscene RGB, depth, and semantics.In this system, we introduce a 3D multi-level\npyramid gaussian splatting method that restores scene details by extracting\nmulti-level image pyramids for gaussian splatting training, ensuring\nconsistency in RGB, depth, and semantic reconstructions. Additionally, we\ndesign a tightly-coupled multi-features reconstruction optimization mechanism,\nallowing the reconstruction accuracy of RGB, depth, and semantic maps to\nmutually enhance each other during the rendering optimization process.\nExtensive quantitative, qualitative, and ablation experiments on the Replica\nand ScanNet public datasets demonstrate that our proposed method outperforms\ncurrent state-of-the-art methods. The open-source code will be available at:\nhttps://github.com/zhenzhongcao/RGBDS-SLAM.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "w5zx_MpjNqQZ5WWaCI7A8WQt0hb1vwDhahLq97G4Gtc",
  "pdfSize": "1466580"
}