{"id":"2412.03027","title":"Timestamp calibration for time-series single cell RNA-seq expression\n  data","authors":"Xiran Chen, Sha Lin, Xiaofeng Chen, Weikai Li, Yifei Li","authorsParsed":[["Chen","Xiran",""],["Lin","Sha",""],["Chen","Xiaofeng",""],["Li","Weikai",""],["Li","Yifei",""]],"versions":[{"version":"v1","created":"Wed, 4 Dec 2024 04:45:05 GMT"},{"version":"v2","created":"Tue, 21 Jan 2025 05:53:15 GMT"}],"updateDate":"2025-01-22","timestamp":1733287505000,"abstract":"  Timestamp automatic annotation (TAA) is a crucial procedure for analyzing\ntime-series ScRNA-seq data, as they unveil dynamic biological developments and\ncell regeneration process. However, current TAA methods heavily rely on manual\ntimestamps, often overlooking their reliability. This oversight can\nsignificantly degrade the performance of timestamp automatic annotation due to\nnoisy timestamps. Nevertheless, the current approach for addressing this issue\ntends to select less critical cleaned samples for timestamp calibration. To\ntackle this challenge, we have developed a novel timestamp calibration model\ncalled ScPace for handling noisy labeled time-series ScRNA-seq data. This\napproach incorporates a latent variable indicator within a base classifier\ninstead of probability sampling to detect noisy samples effectively. To\nvalidate our proposed method, we conducted experiments on both simulated and\nreal time-series ScRNA-seq datasets. Cross-validation experiments with\ndifferent artificial mislabeling rates demonstrate that ScPace outperforms\nprevious approaches. Furthermore, after calibrating the timestamps of the\noriginal time-series ScRNA-seq data using our method, we performed supervised\npseudotime analysis, revealing that ScPace enhances its performance\nsignificantly. These findings suggest that ScPace is an effective tool for\ntimestamp calibration by enabling reclassification and deletion of detected\nnoisy labeled samples while maintaining robustness across diverse ranges of\ntime-series ScRNA-seq datasets. The source code is available at\nhttps://github.com/OPUS-Lightphenexx/ScPace.\n","subjects":["Quantitative Biology/Genomics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"wWe_Dy7ABzK3e7ZHyXXNgWJep-6Br9AGNWfjLnOGsPU","pdfSize":"8364528"}