{
  "id": "2412.05214",
  "title": "AI's assigned gender affects human-AI cooperation",
  "authors": "Sepideh Bazazi and Jurgis Karpus and Taha Yasseri",
  "authorsParsed": [
    [
      "Bazazi",
      "Sepideh",
      ""
    ],
    [
      "Karpus",
      "Jurgis",
      ""
    ],
    [
      "Yasseri",
      "Taha",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 17:46:35 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733507195000,
  "abstract": "  Cooperation between humans and machines is increasingly vital as artificial\nintelligence (AI) becomes more integrated into daily life. Research indicates\nthat people are often less willing to cooperate with AI agents than with\nhumans, more readily exploiting AI for personal gain. While prior studies have\nshown that giving AI agents human-like features influences people's cooperation\nwith them, the impact of AI's assigned gender remains underexplored. This study\ninvestigates how human cooperation varies based on gender labels assigned to AI\nagents with which they interact. In the Prisoner's Dilemma game, 402\nparticipants interacted with partners labelled as AI (bot) or humans. The\npartners were also labelled male, female, non-binary, or gender-neutral.\nResults revealed that participants tended to exploit female-labelled and\ndistrust male-labelled AI agents more than their human counterparts, reflecting\ngender biases similar to those in human-human interactions. These findings\nhighlight the significance of gender biases in human-AI interactions that must\nbe considered in future policy, design of interactive AI systems, and\nregulation of their use.\n",
  "subjects": [
    "Computer Science/Computers and Society",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Computer Science and Game Theory",
    "Computer Science/Human-Computer Interaction"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "UfBU3cU5DNq2NTdsVy85oUfBSSsX1vyg5P6zhrGJOQ4",
  "pdfSize": "955252"
}