{
  "id": "2412.11553",
  "title": "Training Strategies for Isolated Sign Language Recognition",
  "authors": "Karina Kvanchiani, Roman Kraynov, Elizaveta Petrova, Petr Surovcev,\n  Aleksandr Nagaev, Alexander Kapitanov",
  "authorsParsed": [
    [
      "Kvanchiani",
      "Karina",
      ""
    ],
    [
      "Kraynov",
      "Roman",
      ""
    ],
    [
      "Petrova",
      "Elizaveta",
      ""
    ],
    [
      "Surovcev",
      "Petr",
      ""
    ],
    [
      "Nagaev",
      "Aleksandr",
      ""
    ],
    [
      "Kapitanov",
      "Alexander",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 08:37:58 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734338278000,
  "abstract": "  This paper introduces a comprehensive model training pipeline for Isolated\nSign Language Recognition (ISLR) designed to accommodate the distinctive\ncharacteristics and constraints of the Sign Language (SL) domain. The\nconstructed pipeline incorporates carefully selected image and video\naugmentations to tackle the challenges of low data quality and varying sign\nspeeds. Including an additional regression head combined with IoU-balanced\nclassification loss enhances the model's awareness of the gesture and\nsimplifies capturing temporal information. Extensive experiments demonstrate\nthat the developed training pipeline easily adapts to different datasets and\narchitectures. Additionally, the ablation study shows that each proposed\ncomponent expands the potential to consider ISLR task specifics. The presented\nstrategies improve recognition performance on a broad set of ISLR benchmarks.\nMoreover, we achieved a state-of-the-art result on the WLASL and Slovo\nbenchmarks with 1.63% and 14.12% improvements compared to the previous best\nsolution, respectively.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "gPNzrwi_KvyYg0ifpSBjEVb927vS0gaq6-GAKmEauGg",
  "pdfSize": "7148618"
}