{"id":"2412.14377","title":"Deep Swift/UVOT Observations of GOODS-N and the Evolution of the\n  Ultraviolet Luminosity Function at 0.2<z<1.2","authors":"Alexander Belles, Caryl Gronwall, Michael H. Siegel, Robin Ciardullo,\n  and Mat J. Page","authorsParsed":[["Belles","Alexander",""],["Gronwall","Caryl",""],["Siegel","Michael H.",""],["Ciardullo","Robin",""],["Page","Mat J.",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 22:24:09 GMT"}],"updateDate":"2024-12-20","timestamp":1734560649000,"abstract":"  We present Swift Ultraviolet Optical Telescope (UVOT) observations of the\ndeep field GOODS-N in four near-UV filters. A catalog of detected galaxies is\nreported, which will be used to explore galaxy evolution using ultraviolet\nemission. Swift/UVOT observations probe galaxies at $z \\lesssim 1.5$ and\ncombine a wide field of view with moderate spatial resolution; these data\ncomplement the wide-field observations of GALEX and the deep, high angular\nresolution observations by HST. Using our catalog of detected galaxies, we\ncalculate the UV galaxy number counts as a function of apparent magnitude and\ncompute the UV luminosity function and its evolution with redshift. From the\nluminosity function fits in various redshift bins, we calculate the star\nformation rate density as a function of redshift and find evolution consistent\nwith past works. We explore how different assumptions such as dust attenuation\ncorrections can dramatically change how quickly the corrected star formation\nrate density changes with redshift. At these low redshifts, we find no trend\nbetween UV attenuation and redshift or absolute magnitude with significant\nscatter in the UV spectral slope $\\beta$. This dataset will complement the\nextensive observations of GOODS-N already in the literature.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"jbhW7MFR7uzcNSR7vmjP4L4Fh1dD1SaWPm-I3xlrguk","pdfSize":"1186832"}