{
  "id": "2412.19204",
  "title": "Open cluster dissolution rate and the initial cluster mass function in\n  the solar neighbourhood. Modelling the age and mass distributions of clusters\n  observed by Gaia",
  "authors": "Duarte Almeida, Andr\\'e Moitinho, Sandro Moreira",
  "authorsParsed": [
    [
      "Almeida",
      "Duarte",
      ""
    ],
    [
      "Moitinho",
      "André",
      ""
    ],
    [
      "Moreira",
      "Sandro",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 26 Dec 2024 12:54:51 GMT"
    }
  ],
  "updateDate": "2025-01-29",
  "timestamp": 1735217691000,
  "abstract": "  Context. The dissolution rate of open clusters (OCs) and integration of their\nstars into the Milky Way's field population has been previously explored using\ntheir age distribution. With the advent of the Gaia mission, we have an\nexceptional opportunity to revisit and enhance these studies with ages and\nmasses from high quality data. Aims. To build a comprehensive Gaia-based OC\nmass catalogue which, combined with the age distribution, allows a deeper\ninvestigation of the disruption experienced by OCs within the solar\nneighbourhood. Methods. Masses were determined by comparing luminosity\ndistributions to theoretical luminosity functions. The limiting and core radii\nof the clusters were obtained by fitting the King function to their observed\ndensity profiles. We examined the disruption process through simulations of the\nbuild-up and mass evolution of a population of OCs which were compared to the\nobserved mass and age distributions. Results. Our analysis yielded an OC mass\ndistribution with a peak at $log(M)$ = 2.7 dex ($\\sim 500 M_{\\odot}$), as well\nas radii for 1724 OCs. Our simulations showed that using a power-law Initial\nCluster Mass Function (ICMF) no parameters were able to reproduce the observed\nmass distribution. Moreover, we find that a skew log-normal ICMF provides a\ngood match to the observations and that the disruption time of a $10^4\nM{_\\odot}$ OC is $t_4^{tot} = 2.9 \\pm 0.4$ Gyr. Conclusions. Our results\nindicate that the OC disruption time $t_4^{tot}$ is about twice longer than\nprevious estimates based solely on OC age distributions. We find that the shape\nof the ICMF for bound OCs differs from that of embedded clusters, which could\nimply a low typical star formation efficiency of $\\leq 20\\%$ in OCs. Our\nresults also suggest a lower limit of $\\sim 60 M{_\\odot}$ for bound OCs in the\nsolar neighbourhood.\n",
  "subjects": [
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "XUOoNPGCSymLOrk37l6FYJRHdte3YyTUIWf-8n8qr0c",
  "pdfSize": "1169929"
}