{
  "id": "2412.08946",
  "title": "MoSLD: An Extremely Parameter-Efficient Mixture-of-Shared LoRAs for\n  Multi-Task Learning",
  "authors": "Lulu Zhao, Weihao Zeng, Xiaofeng Shi, Hua Zhou",
  "authorsParsed": [
    [
      "Zhao",
      "Lulu",
      ""
    ],
    [
      "Zeng",
      "Weihao",
      ""
    ],
    [
      "Shi",
      "Xiaofeng",
      ""
    ],
    [
      "Zhou",
      "Hua",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 05:22:49 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1733980969000,
  "abstract": "  Recently, LoRA has emerged as a crucial technique for fine-tuning large\npre-trained models, yet its performance in multi-task learning scenarios often\nfalls short. In contrast, the MoE architecture presents a natural solution to\nthis issue. However, it introduces challenges such as mutual interference of\ndata across multiple domains and knowledge forgetting of various tasks.\nAdditionally, MoE significantly increases the number of parameters, posing a\ncomputational cost challenge. Therefore, in this paper, we propose MoSLD, a\nmixture-of-shared-LoRAs model with a dropout strategy. MoSLD addresses these\nchallenges by sharing the upper projection matrix in LoRA among different\nexperts, encouraging the model to learn general knowledge across tasks, while\nstill allowing the lower projection matrix to focus on the unique features of\neach task. The application of dropout alleviates the imbalanced update of\nparameter matrix and mitigates parameter overfitting in LoRA. Extensive\nexperiments demonstrate that our model exhibits excellent performance in both\nsingle-task and multi-task scenarios, with robust out-of-domain generalization\ncapabilities.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Computation and Language"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "04h5syiIXFJW-N99g6oSKblCwoyjf3lvBX47DkFzW_8",
  "pdfSize": "970655"
}