{"id":"2412.04367","title":"Machine Theory of Mind for Autonomous Cyber-Defence","authors":"Luke Swaby, Matthew Stewart, Daniel Harrold, Chris Willis, Gregory\n  Palmer","authorsParsed":[["Swaby","Luke",""],["Stewart","Matthew",""],["Harrold","Daniel",""],["Willis","Chris",""],["Palmer","Gregory",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 17:35:29 GMT"}],"updateDate":"2024-12-06","timestamp":1733420129000,"abstract":"  Intelligent autonomous agents hold much potential for the domain of\ncyber-security. However, due to many state-of-the-art approaches relying on\nuninterpretable black-box models, there is growing demand for methods that\noffer stakeholders clear and actionable insights into their latent beliefs and\nmotivations. To address this, we evaluate Theory of Mind (ToM) approaches for\nAutonomous Cyber Operations. Upon learning a robust prior, ToM models can\npredict an agent's goals, behaviours, and contextual beliefs given only a\nhandful of past behaviour observations. In this paper, we introduce a novel\nGraph Neural Network (GNN)-based ToM architecture tailored for cyber-defence,\nGraph-In, Graph-Out (GIGO)-ToM, which can accurately predict both the targets\nand attack trajectories of adversarial cyber agents over arbitrary computer\nnetwork topologies. To evaluate the latter, we propose a novel extension of the\nWasserstein distance for measuring the similarity of graph-based probability\ndistributions. Whereas the standard Wasserstein distance lacks a fixed\nreference scale, we introduce a graph-theoretic normalization factor that\nenables a standardized comparison between networks of different sizes. We\nfurnish this metric, which we term the Network Transport Distance (NTD), with a\nweighting function that emphasizes predictions according to custom node\nfeatures, allowing network operators to explore arbitrary strategic\nconsiderations. Benchmarked against a Graph-In, Dense-Out (GIDO)-ToM\narchitecture in an abstract cyber-defence environment, our empirical\nevaluations show that GIGO-ToM can accurately predict the goals and behaviours\nof various unseen cyber-attacking agents across a range of network topologies,\nas well as learn embeddings that can effectively characterize their policies.\n","subjects":["Computer Science/Machine Learning","Computer Science/Artificial Intelligence","Computer Science/Multiagent Systems"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"A6x9WaFp5tRAPXS0KcvMCE8opZB67_urAn0I2r5PF4E","pdfSize":"8214649"}