{
  "id": "2412.11481",
  "title": "Formation of Fe-6.5wt%Si High Silicon Steel by Double Glow Plasma\n  Surface Metallurgy Technology",
  "authors": "Zhong Xu, Jun Huang, Hongyan Wu, Rui Chen, Chengyuan Zhang, Zaifeng\n  Xu, Weixin Zhang, Lei Hu, Bin Zhang",
  "authorsParsed": [
    [
      "Xu",
      "Zhong",
      ""
    ],
    [
      "Huang",
      "Jun",
      ""
    ],
    [
      "Wu",
      "Hongyan",
      ""
    ],
    [
      "Chen",
      "Rui",
      ""
    ],
    [
      "Zhang",
      "Chengyuan",
      ""
    ],
    [
      "Xu",
      "Zaifeng",
      ""
    ],
    [
      "Zhang",
      "Weixin",
      ""
    ],
    [
      "Hu",
      "Lei",
      ""
    ],
    [
      "Zhang",
      "Bin",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 06:49:40 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734331780000,
  "abstract": "  High silicon steel with 6.5% silicon content is the best because of its\nexcellent magnetic properties, such as high saturation magnetization, high\nresistivity, low iron loss and near zero magnetostriction. High silicon steel\ncan greatly save energy, and reduce the weight and size of electrical\nappliances. This has a very important application prospect for energy and\naerospace industry. The high brittleness of high silicon steel makes its\nproduction and processing very difficult. For more than 30 years, many steel\ncompanies and research institutions around the world have adopted various\ntechnical means to study the industrialization of high silicon steel, but they\nhave not been successful . JFE-NKK steel company in Japan has realized the\nsmall batch production of high silicon steel by using SiCl4-CVD technology.\nHowever, due to the complex process, corrosion and pollution, high cost, its\nproduction scale is greatly limited. So far, large-scale production of high\nsilicon steel is still a major challenge in the world. This paper will\nintroduce the experimental results of successfully preparing high silicon steel\nby Double Glow Plasma Surface Metallurgy Technology. The process is simple and\neasy without any corrosion or pollution, which may provide a new way for the\nworld to achieve large-scale production of high silicon steel. The large-scale\nproduction and wide application of high silicon steel is likely to change the\npattern of the world's energy and electric power industry, save a lot of energy\nfor mankind, and create huge economic benefits.\n",
  "subjects": [
    "Physics/Applied Physics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "FQTSLDWK1ViSY0b6cwiKVjQvBG0Aup-c_qwdLAPv0Qc",
  "pdfSize": "540852"
}