{"id":"2412.06449","title":"High-throughput computational screening of small, eco-friendly,\n  molecular crystals for sustainable piezoelectric materials","authors":"Shubham Vishnoi, Geetu Kumari, Robert Guest, Pierre-Andr\\'e Cazade,\n  Sarah Guerin","authorsParsed":[["Vishnoi","Shubham",""],["Kumari","Geetu",""],["Guest","Robert",""],["Cazade","Pierre-André",""],["Guerin","Sarah",""]],"versions":[{"version":"v1","created":"Mon, 9 Dec 2024 12:48:52 GMT"},{"version":"v2","created":"Tue, 10 Dec 2024 13:49:30 GMT"}],"updateDate":"2024-12-11","timestamp":1733748532000,"abstract":"  Organic molecular crystals are ideally placed to become next-generation\npiezoelectric materials due to their diverse chemistries that can be used to\nengineer tailor-made solid-state assemblies. Using crystal engineering\nprinciples, and techniques such as co-crystallisation, these materials can be\nengineered to have a wide range of electromechanical properties. For materials\nthat have been structurally characterised by methods such as X-Ray Diffraction,\ncomputational chemistry is an effective tool to predict their electromechanical\nproperties, allowing researchers to screen these molecular crystals and\nidentify materials best suited to their chosen application. Here we present our\ndatabase of small molecular crystals, and their Density Functional Theory (DFT)\npredicted electromechanical properties, CrystalDFT\n(https://actuatelab.ie/CrystalDFT). We highlight the broad range of\nelectromechanical properties amongst this primary dataset, and in particular,\nthe high number of crystals that have a naturally occurring longitudinal d33\nconstant. This longitudinal electromechanical coupling is a prerequisite for\nseveral conventional sensing and energy harvesting applications, the presence\nof which is notably rare amongst the literature on biomolecular crystal\npiezoelectricity to date.\n","subjects":["Condensed Matter/Materials Science","Physics/Chemical Physics","Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"AH67WNR7JWSGD-o2fNCydpn8YleFnAnWjY-qvrox0FE","pdfSize":"2519406"}