{
  "id": "2412.02938",
  "title": "Nonlinear spin and orbital Edelstein effect in WTe2",
  "authors": "Xing-Guo Ye, Peng-Fei Zhu, Wen-Zheng Xu, Tong-Yang Zhao, Zhi-Min Liao",
  "authorsParsed": [
    [
      "Ye",
      "Xing-Guo",
      ""
    ],
    [
      "Zhu",
      "Peng-Fei",
      ""
    ],
    [
      "Xu",
      "Wen-Zheng",
      ""
    ],
    [
      "Zhao",
      "Tong-Yang",
      ""
    ],
    [
      "Liao",
      "Zhi-Min",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 01:11:50 GMT"
    }
  ],
  "updateDate": "2024-12-05",
  "timestamp": 1733274710000,
  "abstract": "  In materials with spin-momentum locked spin textures, such as Rashba states\nand topological surface states, the current-induced shift of the Fermi contour\nin the k space leads to spin polarization, known as the Edelstein effect, which\ndepends linearly on the applied current. However, its nonlinear counterpart has\nnot yet been discovered. Here, we report the observation of the nonlinear\nEdelstein effect in few-layer WTe2. Under a current bias, an out-of-plane\nmagnetization is induced in WTe2, which is electrically probed using an\nFe3GeTe2 electrode, a van der Waals ferromagnet with perpendicular magnetic\nanisotropy. Notably, with an applied ac at frequency {\\omega}, an induced\nmagnetization with second-harmonic response at frequency 2{\\omega} is observed,\nand its magnitude demonstrates a quadratic dependence on the applied current,\ncharacteristic of the nonlinear Edelstein effect. This phenomenon is well\nexplained by the current-induced orbital magnetization via the Berry connection\npolarizability tensors in WTe2. The orbital degree of freedom plays the primary\nrole in the observed nonlinear Edelstein effect, that is, the nonlinear orbital\nEdelstein effect. This can, in turn, give rise to a nonlinear spin Edelstein\neffect through spin-orbit coupling.\n",
  "subjects": [
    "Condensed Matter/Mesoscale and Nanoscale Physics",
    "Condensed Matter/Materials Science"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "9KF1oaxFVORgUDwPMHn33y8PooJAd0C4pByr4dSfpa4",
  "pdfSize": "2725562"
}