{"id":"2412.19362","title":"Evaluating Convolutional Neural Networks for COVID-19 classification in\n  chest X-ray images","authors":"Leonardo Gabriel Ferreira Rodrigues and Danilo Ferreira da Silva and\n  Larissa Ferreira Rodrigues and Jo\\~ao Fernando Mari","authorsParsed":[["Rodrigues","Leonardo Gabriel Ferreira",""],["da Silva","Danilo Ferreira",""],["Rodrigues","Larissa Ferreira",""],["Mari","João Fernando",""]],"versions":[{"version":"v1","created":"Thu, 26 Dec 2024 22:05:30 GMT"}],"updateDate":"2024-12-30","timestamp":1735250730000,"abstract":"  Coronavirus Disease 2019 (COVID-19) pandemic rapidly spread globally,\nimpacting the lives of billions of people. The effective screening of infected\npatients is a critical step to struggle with COVID-19, and treating the\npatients avoiding this quickly disease spread. The need for automated and\nscalable methods has increased due to the unavailability of accurate automated\ntoolkits. Recent researches using chest X-ray images suggest they include\nrelevant information about the COVID-19 virus. Hence, applying machine learning\ntechniques combined with radiological imaging promises to identify this disease\naccurately. It is straightforward to collect these images once it is spreadly\nshared and analyzed in the world. This paper presents a method for automatic\nCOVID-19 detection using chest Xray images through four convolutional neural\nnetworks, namely: AlexNet, VGG-11, SqueezeNet, and DenseNet-121. This method\nhad been providing accurate diagnostics for positive or negative COVID-19\nclassification. We validate our experiments using a ten-fold cross-validation\nprocedure over the training and test sets. Our findings include the shallow\nfine-tuning and data augmentation strategies that can assist in dealing with\nthe low number of positive COVID-19 images publicly available. The accuracy for\nall CNNs is higher than 97.00%, and the SqueezeNet model achieved the best\nresult with 99.20%.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computer Science/Computer Vision and Pattern Recognition","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"qK917b2cZdgs8ZUcwe00w6wP_TrJQ_EiEfUMo0pns3s","pdfSize":"4080344"}