{"id":"2412.06306","title":"Self-Paced Learning Strategy with Easy Sample Prior Based on Confidence\n  for the Flying Bird Object Detection Model Training","authors":"Zi-Wei Sun, Ze-Xi hua, Heng-Chao Li and Yan Li","authorsParsed":[["Sun","Zi-Wei",""],["hua","Ze-Xi",""],["Li","Heng-Chao",""],["Li","Yan",""]],"versions":[{"version":"v1","created":"Mon, 9 Dec 2024 08:53:56 GMT"}],"updateDate":"2024-12-10","timestamp":1733734436000,"abstract":"  In order to avoid the impact of hard samples on the training process of the\nFlying Bird Object Detection model (FBOD model, in our previous work, we\ndesigned the FBOD model according to the characteristics of flying bird objects\nin surveillance video), the Self-Paced Learning strategy with Easy Sample Prior\nBased on Confidence (SPL-ESP-BC), a new model training strategy, is proposed.\nFirstly, the loss-based Minimizer Function in Self-Paced Learning (SPL) is\nimproved, and the confidence-based Minimizer Function is proposed, which makes\nit more suitable for one-class object detection tasks. Secondly, to give the\nmodel the ability to judge easy and hard samples at the early stage of training\nby using the SPL strategy, an SPL strategy with Easy Sample Prior (ESP) is\nproposed. The FBOD model is trained using the standard training strategy with\neasy samples first, then the SPL strategy with all samples is used to train it.\nCombining the strategy of the ESP and the Minimizer Function based on\nconfidence, the SPL-ESP-BC model training strategy is proposed. Using this\nstrategy to train the FBOD model can make it to learn the characteristics of\nthe flying bird object in the surveillance video better, from easy to hard. The\nexperimental results show that compared with the standard training strategy\nthat does not distinguish between easy and hard samples, the AP50 of the FBOD\nmodel trained by the SPL-ESP-BC is increased by 2.1%, and compared with other\nloss-based SPL strategies, the FBOD model trained with SPL-ESP-BC strategy has\nthe best comprehensive detection performance.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"J-Qpn3ZIQkd3HjgLcHaQlaHQfZSY_JLgn-TaeqLkXno","pdfSize":"1531703"}