{"id":"2412.04606","title":"Semantic Consistency-Based Uncertainty Quantification for Factuality in\n  Radiology Report Generation","authors":"Chenyu Wang, Weichao Zhou, Shantanu Ghosh, Kayhan Batmanghelich,\n  Wenchao Li","authorsParsed":[["Wang","Chenyu",""],["Zhou","Weichao",""],["Ghosh","Shantanu",""],["Batmanghelich","Kayhan",""],["Li","Wenchao",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 20:43:39 GMT"}],"updateDate":"2024-12-09","timestamp":1733431419000,"abstract":"  Radiology report generation (RRG) has shown great potential in assisting\nradiologists by automating the labor-intensive task of report writing. While\nrecent advancements have improved the quality and coherence of generated\nreports, ensuring their factual correctness remains a critical challenge.\nAlthough generative medical Vision Large Language Models (VLLMs) have been\nproposed to address this issue, these models are prone to hallucinations and\ncan produce inaccurate diagnostic information. To address these concerns, we\nintroduce a novel Semantic Consistency-Based Uncertainty Quantification\nframework that provides both report-level and sentence-level uncertainties.\nUnlike existing approaches, our method does not require modifications to the\nunderlying model or access to its inner state, such as output token logits,\nthus serving as a plug-and-play module that can be seamlessly integrated with\nstate-of-the-art models. Extensive experiments demonstrate the efficacy of our\nmethod in detecting hallucinations and enhancing the factual accuracy of\nautomatically generated radiology reports. By abstaining from high-uncertainty\nreports, our approach improves factuality scores by $10$%, achieved by\nrejecting $20$% of reports using the Radialog model on the MIMIC-CXR dataset.\nFurthermore, sentence-level uncertainty flags the lowest-precision sentence in\neach report with an $82.9$% success rate.\n","subjects":["Computer Science/Artificial Intelligence","Computer Science/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"YFxKCKDSIV3S-xiVJaix0aspeTfZqogfc_VGykeTPAc","pdfSize":"1908539"}