{"id":"2412.14621","title":"Diversity and universality: evolution of dwarf galaxies with\n  self-interacting dark matter","authors":"Zhichao Carton Zeng, Annika H. G. Peter, Xiaolong Du, Andrew Benson,\n  Jiaxuan Li, Charlie Mace and Shengqi Yang","authorsParsed":[["Zeng","Zhichao Carton",""],["Peter","Annika H. G.",""],["Du","Xiaolong",""],["Benson","Andrew",""],["Li","Jiaxuan",""],["Mace","Charlie",""],["Yang","Shengqi",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 08:17:47 GMT"},{"version":"v2","created":"Mon, 10 Feb 2025 02:22:27 GMT"}],"updateDate":"2025-02-11","timestamp":1734596267000,"abstract":"  Dark matter halos with self-interacting dark matter (SIDM) experience a\nunique evolutionary phenomenon, in that their central regions eventually\ncollapse to high density through the runaway gravothermal process after\ninitially forming a large and low-density core. When coupled with orbital\nevolution, this is expected to naturally produce a large diversity in\ndark-matter halos' inner mass distribution, potentially explaining the\ndiversity problem of dwarf galaxies. However, it remains unknown how the\ndiversity in SIDM dark-matter halos propagates to the more easily observed\nluminous matter at the center of the halo, especially the stellar component. In\nthis work, we use idealized N-body simulations with two species of particles\n(dark matter and stars) to study the response of the stellar properties of\nfield and satellite dwarf galaxies to SIDM evolution and orbital effects on\ntheir halos. Galaxies' stellar components, including galaxy size, mass-to-light\nratio, and stellar velocity dispersion, display a much larger scatter in SIDM\nthan the standard cold dark matter (CDM) model. Importantly, we find signs of\nuniversality in the evolution pathways, or \"tidal tracks\", of SIDM dwarf\nsatellites, which are physically interpretable and potentially parameterizable.\nThis type of tidal-track model can be layered onto larger-scale, cosmological\nsimulations to reconstruct the evolution of populations of SIDM dwarfs in cases\nwhere high-resolution simulations of galaxies are otherwise prohibitively\nexpensive.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"D_RohLNAsVG6E-OCYMcSKiTm9wStYGZijgIqKQtgSag","pdfSize":"2224666"}