{"id":"2412.01945","title":"Ultrafast dynamic Coulomb screening of X-ray core excitons in\n  photoexcited semiconductors","authors":"Thomas C. Rossi, Lu Qiao, Conner P. Dykstra, Ronaldo Rodrigues Pela,\n  Richard Gnewkow, Rachel F. Wallick, John H. Burke, Erin Nicholas, Anne-Marie\n  March, Gilles Doumy, D. Bruce Buchholz, Christiane Deparis, Jesus\n  Zu\\~niga-P\\'erez, Michael Weise, Klaus Ellmer, Mattis Fondell, Claudia Draxl,\n  Renske M. van der Veen","authorsParsed":[["Rossi","Thomas C.",""],["Qiao","Lu",""],["Dykstra","Conner P.",""],["Pela","Ronaldo Rodrigues",""],["Gnewkow","Richard",""],["Wallick","Rachel F.",""],["Burke","John H.",""],["Nicholas","Erin",""],["March","Anne-Marie",""],["Doumy","Gilles",""],["Buchholz","D. Bruce",""],["Deparis","Christiane",""],["Zuñiga-Pérez","Jesus",""],["Weise","Michael",""],["Ellmer","Klaus",""],["Fondell","Mattis",""],["Draxl","Claudia",""],["van der Veen","Renske M.",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 20:09:35 GMT"},{"version":"v2","created":"Thu, 12 Dec 2024 10:55:45 GMT"}],"updateDate":"2024-12-13","timestamp":1733170175000,"abstract":"  Ultrafast X-ray spectroscopy has been revolutionized in recent years due to\nthe advent of fourth-generation X-ray facilities. In solid-state materials,\ncore excitons determine the energy and line shape of absorption features in\ncore-level spectroscopies such as X-ray absorption spectroscopy. The screening\nof core excitons is an inherent many-body process that can reveal insight into\ncharge-transfer excitations and electronic correlations. Under non-equilibrium\nconditions such as after photoexcitation, however, core-exciton screening is\nstill not fully understood. Here we demonstrate the dynamic Coulomb screening\nof core excitons induced by photoexcited carriers by employing X-ray transient\nabsorption (XTA) spectroscopy with picosecond time resolution. Our\ninterpretation is supported by state-of-the-art ab initio theory, combining\nconstrained and real-time time-dependent density functional theory with\nmany-body perturbation theory. Using ZnO as an archetypal wide band-gap\nsemiconductor, we show that the Coulomb screening by photoexcited carriers at\nthe Zn K-edge leads to a decrease in the core-exciton binding energy, which\ndepends nonlinearly on both the excitation density and the distribution of\nphotoexcited carriers in reciprocal space. The effect of Coulomb screening\ndominates over Pauli blocking in the XTA spectra. We show that dynamic\ncore-exciton screening is also observed at other X-ray absorption edges and\ntheoretically predict the effect of core-exciton screening on the femtosecond\ntime scale for the case of ZnO, a major step towards hard X-ray excitonics. The\nresults have implications for the interpretation of ultrafast X-ray spectra in\ngeneral and their use in tracking charge carrier dynamics in complex materials\non atomic length scales.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"zwByfEW7UiouSG_IkbNF8QeMez-ncqn52g8Wq8drU3o","pdfSize":"7828062"}