{
  "id": "2412.17266",
  "title": "Intrinsically chiral exciton polaritons in an atomically-thin\n  semiconductor",
  "authors": "Matthias J. Wurdack, Ivan Iorsh, Tobias Bucher, Sarka Vavreckova,\n  Eliezer Estrecho, Sebastian Klimmer, Zlata Fedorova, Huachun Deng, Qinghai\n  Song, Giancarlo Soavi, Falk Eilenberger, Thomas Pertsch, Isabelle Staude,\n  Yuri Kivshar and Elena. A. Ostrovskaya",
  "authorsParsed": [
    [
      "Wurdack",
      "Matthias J.",
      ""
    ],
    [
      "Iorsh",
      "Ivan",
      ""
    ],
    [
      "Bucher",
      "Tobias",
      ""
    ],
    [
      "Vavreckova",
      "Sarka",
      ""
    ],
    [
      "Estrecho",
      "Eliezer",
      ""
    ],
    [
      "Klimmer",
      "Sebastian",
      ""
    ],
    [
      "Fedorova",
      "Zlata",
      ""
    ],
    [
      "Deng",
      "Huachun",
      ""
    ],
    [
      "Song",
      "Qinghai",
      ""
    ],
    [
      "Soavi",
      "Giancarlo",
      ""
    ],
    [
      "Eilenberger",
      "Falk",
      ""
    ],
    [
      "Pertsch",
      "Thomas",
      ""
    ],
    [
      "Staude",
      "Isabelle",
      ""
    ],
    [
      "Kivshar",
      "Yuri",
      ""
    ],
    [
      "Ostrovskaya",
      "Elena. A.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 04:25:30 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734927930000,
  "abstract": "  Photonic bound states in the continuum (BICs) have emerged as a versatile\ntool for enhancing light-matter interactions by strongly confining light\nfields. Chiral BICs are photonic resonances with a high degree of circular\npolarisation, which hold great promise for spin-selective applications in\nquantum optics and nanophotonics. Here, we demonstrate a novel application of a\nchiral BIC for inducing strong coupling between the circularly polarised\nphotons and spin-polarised (valley) excitons (bound electron-hole pairs) in\natomically-thin transition metal dichalcogenide crystals (TMDCs). By placing\nmonolayer WS$_2$ onto the BIC-hosting metasurface, we observe the formation of\nintrinsically chiral, valley-selective exciton polaritons, evidenced by\ncircularly polarised photoluminescence (PL) at two distinct energy levels. The\nPL intensity and degree of circular polarisation of polaritons exceed those of\nuncoupled excitons in our structure by an order of magnitude. Our microscopic\nmodel shows that this enhancement is due to folding of the Brillouin zone\ncreating a direct emission path for high-momenta polaritonic states far outside\nthe light cone, thereby providing a shortcut to thermalisation (energy\nrelaxation) and suppressing depolarisation. Moreover, while the polarisation of\nthe upper polariton is determined by the valley excitons, the lower polariton\nbehaves like an intrinsic chiral emitter with its polarisation fixed by the\nBIC. Therefore, the spin alignment of the upper and lower polaritons\n($\\uparrow\\downarrow$ and $\\uparrow \\uparrow$) can be controlled by $\\sigma^+$\nand $\\sigma^-$ polarised optical excitation, respectively. Our work introduces\na new type of chiral light-matter quasi-particles in atomically-thin\nsemiconductors and provides an insight into their energy relaxation dynamics.\n",
  "subjects": [
    "Condensed Matter/Mesoscale and Nanoscale Physics",
    "Physics/Optics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "K99EOAnN2m7KibUiH6itTiRrQc-1LZopcZxFmuDTYhE",
  "pdfSize": "2287674"
}