{
  "id": "2412.13952",
  "title": "Prompting Strategies for Enabling Large Language Models to Infer\n  Causation from Correlation",
  "authors": "Eleni Sgouritsa, Virginia Aglietti, Yee Whye Teh, Arnaud Doucet,\n  Arthur Gretton, Silvia Chiappa",
  "authorsParsed": [
    [
      "Sgouritsa",
      "Eleni",
      ""
    ],
    [
      "Aglietti",
      "Virginia",
      ""
    ],
    [
      "Teh",
      "Yee Whye",
      ""
    ],
    [
      "Doucet",
      "Arnaud",
      ""
    ],
    [
      "Gretton",
      "Arthur",
      ""
    ],
    [
      "Chiappa",
      "Silvia",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 15:32:27 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734535947000,
  "abstract": "  The reasoning abilities of Large Language Models (LLMs) are attracting\nincreasing attention. In this work, we focus on causal reasoning and address\nthe task of establishing causal relationships based on correlation information,\na highly challenging problem on which several LLMs have shown poor performance.\nWe introduce a prompting strategy for this problem that breaks the original\ntask into fixed subquestions, with each subquestion corresponding to one step\nof a formal causal discovery algorithm, the PC algorithm. The proposed\nprompting strategy, PC-SubQ, guides the LLM to follow these algorithmic steps,\nby sequentially prompting it with one subquestion at a time, augmenting the\nnext subquestion's prompt with the answer to the previous one(s). We evaluate\nour approach on an existing causal benchmark, Corr2Cause: our experiments\nindicate a performance improvement across five LLMs when comparing PC-SubQ to\nbaseline prompting strategies. Results are robust to causal query\nperturbations, when modifying the variable names or paraphrasing the\nexpressions.\n",
  "subjects": [
    "Computer Science/Computation and Language",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "cKHHbj8BcEkHogOwRqVgDKZsGC9Udnz7LLx5kPEaLXo",
  "pdfSize": "2165398"
}