{"id":"2412.20784","title":"DEMO: A Dynamics-Enhanced Learning Model for Multi-Horizon Trajectory\n  Prediction in Autonomous Vehicles","authors":"Chengyue Wang, Haicheng Liao, Kaiqun Zhu, Guohui Zhang, Zhenning Li","authorsParsed":[["Wang","Chengyue",""],["Liao","Haicheng",""],["Zhu","Kaiqun",""],["Zhang","Guohui",""],["Li","Zhenning",""]],"versions":[{"version":"v1","created":"Mon, 30 Dec 2024 08:07:21 GMT"}],"updateDate":"2024-12-31","timestamp":1735546041000,"abstract":"  Autonomous vehicles (AVs) rely on accurate trajectory prediction of\nsurrounding vehicles to ensure the safety of both passengers and other road\nusers. Trajectory prediction spans both short-term and long-term horizons, each\nrequiring distinct considerations: short-term predictions rely on accurately\ncapturing the vehicle's dynamics, while long-term predictions rely on\naccurately modeling the interaction patterns within the environment. However\ncurrent approaches, either physics-based or learning-based models, always\nignore these distinct considerations, making them struggle to find the optimal\nprediction for both short-term and long-term horizon. In this paper, we\nintroduce the Dynamics-Enhanced Learning MOdel (DEMO), a novel approach that\ncombines a physics-based Vehicle Dynamics Model with advanced deep learning\nalgorithms. DEMO employs a two-stage architecture, featuring a Dynamics\nLearning Stage and an Interaction Learning Stage, where the former stage\nfocuses on capturing vehicle motion dynamics and the latter focuses on modeling\ninteraction. By capitalizing on the respective strengths of both methods, DEMO\nfacilitates multi-horizon predictions for future trajectories. Experimental\nresults on the Next Generation Simulation (NGSIM), Macau Connected Autonomous\nDriving (MoCAD), Highway Drone (HighD), and nuScenes datasets demonstrate that\nDEMO outperforms state-of-the-art (SOTA) baselines in both short-term and\nlong-term prediction horizons.\n","subjects":["Computer Science/Robotics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"66g9Lq5M9x9GQ85M60IytMu3A4Ebbdm9dL9Zu1r_fP4","pdfSize":"1947265"}