{"id":"2412.20006","title":"Adversarial Robustness for Deep Learning-based Wildfire Prediction\n  Models","authors":"Ryo Ide, Lei Yang","authorsParsed":[["Ide","Ryo",""],["Yang","Lei",""]],"versions":[{"version":"v1","created":"Sat, 28 Dec 2024 04:06:29 GMT"},{"version":"v2","created":"Fri, 10 Jan 2025 01:09:37 GMT"}],"updateDate":"2025-01-13","timestamp":1735358789000,"abstract":"  Smoke detection using Deep Neural Networks (DNNs) is an effective approach\nfor early wildfire detection. However, because smoke is temporally and\nspatially anomalous, there are limitations in collecting sufficient training\ndata. This raises overfitting and bias concerns in existing DNN-based wildfire\ndetection models. Thus, we introduce WARP (Wildfire Adversarial Robustness\nProcedure), the first model-agnostic framework for evaluating the adversarial\nrobustness of DNN-based wildfire detection models. WARP addresses limitations\nin smoke image diversity using global and local adversarial attack methods. The\nglobal attack method uses image-contextualized Gaussian noise, while the local\nattack method uses patch noise injection, tailored to address critical aspects\nof wildfire detection. Leveraging WARP's model-agnostic capabilities, we assess\nthe adversarial robustness of real-time Convolutional Neural Networks (CNNs)\nand Transformers. The analysis revealed valuable insights into the models'\nlimitations. Specifically, the global attack method demonstrates that the\nTransformer model has more than 70% precision degradation than the CNN against\nglobal noise. In contrast, the local attack method shows that both models are\nsusceptible to cloud image injections when detecting smoke-positive instances,\nsuggesting a need for model improvements through data augmentation. WARP's\ncomprehensive robustness analysis contributed to the development of\nwildfire-specific data augmentation strategies, marking a step toward\npracticality.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"AXappiEezKA8sqXkdUv3Ba2rz17X2JMSLaVgFSScb7s","pdfSize":"15066963"}