{"id":"2412.08149","title":"AsyncDSB: Schedule-Asynchronous Diffusion Schr\\\"odinger Bridge for Image\n  Inpainting","authors":"Zihao Han, Baoquan Zhang, Lisai Zhang, Shanshan Feng, Kenghong Lin,\n  Guotao Liang, Yunming Ye, Xiaochen Qi, Guangming Ye","authorsParsed":[["Han","Zihao",""],["Zhang","Baoquan",""],["Zhang","Lisai",""],["Feng","Shanshan",""],["Lin","Kenghong",""],["Liang","Guotao",""],["Ye","Yunming",""],["Qi","Xiaochen",""],["Ye","Guangming",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 07:08:07 GMT"}],"updateDate":"2024-12-12","timestamp":1733900887000,"abstract":"  Image inpainting is an important image generation task, which aims to restore\ncorrupted image from partial visible area. Recently, diffusion Schr\\\"odinger\nbridge methods effectively tackle this task by modeling the translation between\ncorrupted and target images as a diffusion Schr\\\"odinger bridge process along a\nnoising schedule path. Although these methods have shown superior performance,\nin this paper, we find that 1) existing methods suffer from a\nschedule-restoration mismatching issue, i.e., the theoretical schedule and\npractical restoration processes usually exist a large discrepancy, which\ntheoretically results in the schedule not fully leveraged for restoring images;\nand 2) the key reason causing such issue is that the restoration process of all\npixels are actually asynchronous but existing methods set a synchronous noise\nschedule to them, i.e., all pixels shares the same noise schedule. To this end,\nwe propose a schedule-Asynchronous Diffusion Schr\\\"odinger Bridge (AsyncDSB)\nfor image inpainting. Our insight is preferentially scheduling pixels with high\nfrequency (i.e., large gradients) and then low frequency (i.e., small\ngradients). Based on this insight, given a corrupted image, we first train a\nnetwork to predict its gradient map in corrupted area. Then, we regard the\npredicted image gradient as prior and design a simple yet effective\npixel-asynchronous noise schedule strategy to enhance the diffusion\nSchr\\\"odinger bridge. Thanks to the asynchronous schedule at pixels, the\ntemporal interdependence of restoration process between pixels can be fully\ncharacterized for high-quality image inpainting. Experiments on real-world\ndatasets show that our AsyncDSB achieves superior performance, especially on\nFID with around 3% - 14% improvement over state-of-the-art baseline methods.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"RH7z1AZMqN5wgYX1ESm84xOMYhyyxT89snkfVAB-ifY","pdfSize":"5257561"}