{
  "id": "2412.05784",
  "title": "ASC-Hook: fast and transparent system call hook for Arm",
  "authors": "Yang Shen (National University of Defense Technology), Min Xie\n  (National University of Defense Technology), Wenzhe Zhang (National\n  University of Defense Technology), and Tao Wu (Changsha University of Science\n  and Technology)",
  "authorsParsed": [
    [
      "Shen",
      "Yang",
      "",
      "National University of Defense Technology"
    ],
    [
      "Xie",
      "Min",
      "",
      "National University of Defense Technology"
    ],
    [
      "Zhang",
      "Wenzhe",
      "",
      "National\n  University of Defense Technology"
    ],
    [
      "Wu",
      "Tao",
      "",
      "Changsha University of Science\n  and Technology"
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 8 Dec 2024 02:30:23 GMT"
    },
    {
      "version": "v2",
      "created": "Thu, 12 Dec 2024 11:35:52 GMT"
    },
    {
      "version": "v3",
      "created": "Sun, 15 Dec 2024 14:21:17 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1733625023000,
  "abstract": "  Intercepting system calls is crucial for tools that aim to modify or monitor\napplication behavior. However, existing system call interception tools on the\nARM platform still suffer from limitations in terms of performance and\ncompleteness. This paper presents an efficient and comprehensive binary\nrewriting framework, ASC-Hook, specifically designed for intercepting system\ncalls on the ARM platform. ASC-Hook addresses two key challenges on the ARM\narchitecture: the misalignment of the target address caused by directly\nreplacing the SVC instruction with br x8, and the return to the original\ncontrol flow after system call interception. This is achieved through a hybrid\nreplacement strategy and our specially designed trampoline mechanism. By\nimplementing multiple completeness strategies specifically for system calls, we\nensured comprehensive and thorough interception. Experimental results show that\nASC-Hook reduces overhead to at least 1/29 of that of existing system call\ninterception tools. We conducted extensive performance evaluations of ASC-Hook,\nand the average performance loss for system call-intensive applications is\n3.7\\% .\n",
  "subjects": [
    "Computer Science/Hardware Architecture",
    "Computer Science/Operating Systems",
    "Computer Science/Performance",
    "Computer Science/Programming Languages"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Np_dNAKg2zEtm3ipMx1yR0CrIoPw6wUyQxuOrSDKpAE",
  "pdfSize": "1524950"
}