{
  "id": "2412.07826",
  "title": "SALON: Self-supervised Adaptive Learning for Off-road Navigation",
  "authors": "Matthew Sivaprakasam, Samuel Triest, Cherie Ho, Shubhra Aich, Jeric\n  Lew, Isaiah Adu, Wenshan Wang, Sebastian Scherer",
  "authorsParsed": [
    [
      "Sivaprakasam",
      "Matthew",
      ""
    ],
    [
      "Triest",
      "Samuel",
      ""
    ],
    [
      "Ho",
      "Cherie",
      ""
    ],
    [
      "Aich",
      "Shubhra",
      ""
    ],
    [
      "Lew",
      "Jeric",
      ""
    ],
    [
      "Adu",
      "Isaiah",
      ""
    ],
    [
      "Wang",
      "Wenshan",
      ""
    ],
    [
      "Scherer",
      "Sebastian",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 18:58:06 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733857086000,
  "abstract": "  Autonomous robot navigation in off-road environments presents a number of\nchallenges due to its lack of structure, making it difficult to handcraft\nrobust heuristics for diverse scenarios. While learned methods using hand\nlabels or self-supervised data improve generalizability, they often require a\ntremendous amount of data and can be vulnerable to domain shifts. To improve\ngeneralization in novel environments, recent works have incorporated adaptation\nand self-supervision to develop autonomous systems that can learn from their\nown experiences online. However, current works often rely on significant prior\ndata, for example minutes of human teleoperation data for each terrain type,\nwhich is difficult to scale with more environments and robots. To address these\nlimitations, we propose SALON, a perception-action framework for fast\nadaptation of traversability estimates with minimal human input. SALON rapidly\nlearns online from experience while avoiding out of distribution terrains to\nproduce adaptive and risk-aware cost and speed maps. Within seconds of\ncollected experience, our results demonstrate comparable navigation performance\nover kilometer-scale courses in diverse off-road terrain as methods trained on\n100-1000x more data. We additionally show promising results on significantly\ndifferent robots in different environments. Our code is available at\nhttps://theairlab.org/SALON.\n",
  "subjects": [
    "Computer Science/Robotics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "D5O3FJvb7zn7G4L2TWyt9ugfGzAYeU_01iBbyVLlvj8",
  "pdfSize": "28648319"
}