{
  "id": "2412.10783",
  "title": "Video Diffusion Transformers are In-Context Learners",
  "authors": "Zhengcong Fei, Di Qiu, Changqian Yu, Debang Li, Mingyuan Fan, Xiang\n  Wen",
  "authorsParsed": [
    [
      "Fei",
      "Zhengcong",
      ""
    ],
    [
      "Qiu",
      "Di",
      ""
    ],
    [
      "Yu",
      "Changqian",
      ""
    ],
    [
      "Li",
      "Debang",
      ""
    ],
    [
      "Fan",
      "Mingyuan",
      ""
    ],
    [
      "Wen",
      "Xiang",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 14 Dec 2024 10:39:55 GMT"
    },
    {
      "version": "v2",
      "created": "Fri, 20 Dec 2024 11:39:59 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734172795000,
  "abstract": "  This paper investigates a solution for enabling in-context capabilities of\nvideo diffusion transformers, with minimal tuning required for activation.\nSpecifically, we propose a simple pipeline to leverage in-context generation:\n($\\textbf{i}$) concatenate videos along spacial or time dimension,\n($\\textbf{ii}$) jointly caption multi-scene video clips from one source, and\n($\\textbf{iii}$) apply task-specific fine-tuning using carefully curated small\ndatasets. Through a series of diverse controllable tasks, we demonstrate\nqualitatively that existing advanced text-to-video models can effectively\nperform in-context generation. Notably, it allows for the creation of\nconsistent multi-scene videos exceeding 30 seconds in duration, without\nadditional computational overhead. Importantly, this method requires no\nmodifications to the original models, results in high-fidelity video outputs\nthat better align with prompt specifications and maintain role consistency. Our\nframework presents a valuable tool for the research community and offers\ncritical insights for advancing product-level controllable video generation\nsystems. The data, code, and model weights are publicly available at:\n\\url{https://github.com/feizc/Video-In-Context}.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "mQD9hc8BddwlmBLZL7EuWl6G9dvEP442hKWli6VOVSM",
  "pdfSize": "5271204"
}