{
  "id": "2412.00528",
  "title": "The Schrijver system of the length polyhedron of an interval order",
  "authors": "Andr\\'e E. K\\'ezdy, Jen\\H{o} Lehel",
  "authorsParsed": [
    [
      "Kézdy",
      "André E.",
      ""
    ],
    [
      "Lehel",
      "Jenő",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 30 Nov 2024 16:28:57 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1732984137000,
  "abstract": "  The length polyhedron of an interval order $P$ is the convex hull of integer\nvectors representing the interval lengths in possible interval representations\nof $P$ in which all intervals have integer endpoints. This polyhedron is an\nintegral translation of a polyhedral cone, with its apex corresponding to the\ncanonical interval representation of $P$ (also known as the minimal endpoint\nrepresentation).\n  In earlier work, we introduced an arc-weighted directed graph model, termed\nthe key graph, inspired by this canonical representation. We showed that cycles\nin the key graph correspond, via Fourier-Motzkin elimination, to inequalities\nthat describe supporting hyperplanes of the length polyhedron. These cycle\ninequalities derived from the key graph form a complete system of linear\ninequalities defining the length polyhedron. By applying a theorem due to Cook,\nwe establish here that this system of inequalities is totally dual integral\n(TDI).\n  Leveraging circulations, total dual integrality, and the special structure of\nthe key graph, our main theorem demonstrates that a cycle inequality is a\npositive linear combination of other cycle inequalities if and only if it is a\npositive integral linear combination of smaller cycle inequalities (where\n`smaller' here refers a natural weak ordering among these cycle inequalities).\nThis yields an efficient method to remove redundant cycle inequalities and\nultimately construct the unique minimal TDI-system, also known as the Schrijver\nsystem, for the length polyhedron. Notably, if the key graph contains a\npolynomial number of cycles, this gives a polynomial-time algorithm to compute\nthe Schrijver system for the length polyhedron.\n  Lastly, we provide examples of interval orders where the Schrijver system has\nan exponential size.\n",
  "subjects": [
    "Mathematics/Combinatorics",
    "Computer Science/Discrete Mathematics"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "8r2C231W1ZGNxOt-gpwH4BlewHulDRHTjPLQpXk9zxI",
  "pdfSize": "299103"
}