{"id":"2412.15682","title":"Effect of three-orifice baffles orientation on the flow and\n  thermal-hydraulic performance: experimental analysis for net and oscillatory\n  flows","authors":"J. Mu\\~noz-C\\'amara, D. Cresp\\'i-Llorens, J.P. Solano, P.G. Vicente","authorsParsed":[["Muñoz-Cámara","J.",""],["Crespí-Llorens","D.",""],["Solano","J. P.",""],["Vicente","P. G.",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 09:01:01 GMT"}],"updateDate":"2024-12-23","timestamp":1734685261000,"abstract":"  Three-orifice baffles equally spaced along a circular tube are investigated\nas a means for heat transfer enhancement under net, oscillatory and compound\nflows. An unprecedented, systematic analysis of the relative orientation of\nconsecutive baffles -- aligned or opposed -- is accomplished to assess the\nchanges induced on the flow structure and their impact on the thermal-hydraulic\nperformance. The results cover the Nusselt number, the net and oscillatory\nfriction factors and the instantaneous velocity fields using PIV in an\nexperimental campaign with a 32 mm tube diameter. The study is conducted in the\nrange of net Reynolds numbers $50 < Re_n < 1000$ and oscillatory Reynolds\nnumbers $0 < Re_{osc}< 750$, for a dimensionless amplitude $x_0/D = 0.5$ and\n$Pr=65$. In absence of oscillatory flow, opposed baffles advance the transition\nto turbulence from $Re_n = 100$ to $50$, increasing the net friction factor (40\n%) for $Re_n > 50$ and the Nusselt number (maximum of 27 %) for $Re_n < 150$.\nWhen an oscillatory flow is applied, augmentations caused by opposed baffles\nare only observed for $Re_n < 150$ and $Re_{osc} < 150$. Above $Re_n$,\n$Re_{osc}>150$, opposed baffles are not recommended for the promotion of heat\ntransfer, owing to friction penalties. However, the chaotic mixing and lack of\nshort-circuiting between baffles observed with flow velocimetry over a wide\nrange of operational conditions point out the interest of this configuration to\nachieve plug flow.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"KJOc7mtwoLl1eimwA-AI5CSf-epIW6B4jLwzHvKVMSo","pdfSize":"4995572"}