{
  "id": "2412.04402",
  "title": "From Magic State Distillation to Dynamical Systems",
  "authors": "Yunzhe Zheng, Dong E. Liu",
  "authorsParsed": [
    [
      "Zheng",
      "Yunzhe",
      ""
    ],
    [
      "Liu",
      "Dong E.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 18:20:01 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733422801000,
  "abstract": "  Magic State Distillation (MSD) has been a research focus for fault-tolerant\nquantum computing due to the need for non-Clifford resource in gaining quantum\nadvantage. Although many of the MSD protocols so far are based on stabilizer\ncodes with transversal $T$ gates, there exists quite several protocols that\ndon't fall into this class. We propose a method to map MSD protocols to\niterative dynamical systems under the framework of stabilizer reduction. With\nour mapping, we are able to analyze the performance of MSD protocols using\ntechniques from dynamical systems theory, easily simulate the distillation\nprocess of input states under arbitrary noise model and visualize it using flow\ndiagram. We apply our mapping to common MSD protocols for $\\ket{T}$ state and\nfind some interesting properties: The $[[15, 1, 3]]$ code may distill states\ncorresponding to $\\sqrt{T}$ gate and the $[[5, 1, 3]]$ code can distill the\nmagic state for corresponding to the $T$ gate. Besides, we examine the exotic\nMSD protocols that may distill into other magic states proposed in [Eur. Phys.\nJ. D 70, 55 (2016)] and identify the condition for distillable magic states. We\nalso study new MSD protocols generated by concatenating different codes and\nnumerically demonstrate that concatenation can generate MSD protocols with\nvarious magic states. By concatenating efficient codes with exotic codes, we\ncan reduce the overhead of the exotic MSD protocols. We believe our proposed\nmethod will be a useful tool for simulating and visualization MSD protocols for\ncanonical MSD protocols on $\\ket{T}$ as well as other unexplored MSD protocols\nfor other states.\n",
  "subjects": [
    "Physics/Quantum Physics",
    "Physics/Mathematical Physics",
    "Mathematics/Mathematical Physics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "-1FdytzrEPxqTVBHBSWChJMK5_HsMV0vvyYyxxmTunQ",
  "pdfSize": "8045813"
}