{"id":"2412.19526","title":"Magnon-Phonon Coupling in Layered Antiferromagnet","authors":"Somsubhra Ghosh, Mainak Palit, Sujan Maity and Subhadeep Datta","authorsParsed":[["Ghosh","Somsubhra",""],["Palit","Mainak",""],["Maity","Sujan",""],["Datta","Subhadeep",""]],"versions":[{"version":"v1","created":"Fri, 27 Dec 2024 08:38:33 GMT"}],"updateDate":"2025-01-03","timestamp":1735288713000,"abstract":"  We present a fully analytical model of hybridization between magnon, and\nphonons observed experimentally in magneto-Raman scattering in van der Waals\n(vdW) antiferromagnets (AFM). Here, the representative material, FePS3, has\nbeen shown to be a quasi-two-dimensional-Ising antiferromagnet, with additional\nfeatures of spin-phonon coupling in the Raman spectra emerging below the N\\'eel\ntemperature (TN) of approximately 120 K. Using magneto-Raman spectroscopy as an\noptical probe of magnetic structure, we show that one of these Raman-active\nmodes in the magnetically ordered state is a magnon with a frequency of 3.7 THz\n(~ 122 cm-1). In addition, one magnon band and three phonon bands are coupled\nvia the magneto-elastic coupling evidenced by anti-crossing in the complete\nspectra. We consider a simple model involving only in-plane nearest neighbor\nexchange couplings (designed to give rise to a similar magnetic structure) and\nperpendicular anisotropy in presence of an out-of-plane magnetic field. Exact\ndiagonalization of the Hamiltonian leads to energy bands which show that the\ninteraction term gives rise to avoided crossings between the hybridized magnon\nand phonon branches. Realizing magnon-phonon coupling in two-dimensional (2D)\nAFMs is important for the verification of the theoretical predictions on exotic\nquantum transport phenomena like spin-caloritronics, topological magnonics,\netc.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"EzoXP9bL2mWhkG0Zb-ZTZKSi5dubHHtQ3Dw-8R4csSw","pdfSize":"408724"}