{
  "id": "2412.14184",
  "title": "Evolution of Hubble parameter from Pantheon+ data and comparison of\n  cosmological models using cosmic chronometers",
  "authors": "Ardra Edathandel Sasi, Moncy Vilavinal John",
  "authorsParsed": [
    [
      "Sasi",
      "Ardra Edathandel",
      ""
    ],
    [
      "John",
      "Moncy Vilavinal",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 18:03:07 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1733508187000,
  "abstract": "  The evolution of the Hubble parameter $H(z)$ with redshift $z$ is estimated\nfrom the Pantheon+ data of Type Ia supernovae, for the $\\Lambda$CDM model and\nthe three special cases of the eternal coasting (EC) cosmological model with\nthree different spatial geometries. The scatter associated with $H(z)$ is seen\nto grow markedly with redshift. This behaviour, which is deduced directly from\nthe SNe Hubble diagram, raises the question of whether the universe is\nundergoing a stochastic expansion, which scenario can offer an explanation for\nthe Hubble tension in cosmology. From the estimated $H(z)$ values, the present\nvalue of the Hubble parameter $H_0$ is evaluated for each of these models\nthrough regression, and the scatter using the Monte Carlo method. Bayesian\ncomparison between these models is carried out using the data of 35 cosmic\nchronometers (CC). The comparative study favours the $\\Lambda$CDM model, with\nsome strong evidence. However, exclusion of four outlier CC data points with\nsmall errorbars leads to large reduction in the Bayes factor value. The\nunusually large value of Bayes factor obtained while using the full set of CC\ndata raises some concerns about its tension with other data, such as that of\nthe SNe Ia. While using the remaining 31 CC data points, it is observed that\nthe resulting Bayes factor still favours the $\\Lambda$CDM model, but with a\nmuch smaller value of the Bayes factor. When EC models are compared among\nthemselves, the $\\Omega = 2$ model has strong evidence than the $\\Omega = 1$\n(also known as $R_h = ct$) and the $\\Omega = 0$ (Milne-type) models.\n",
  "subjects": [
    "Astrophysics/Cosmology and Nongalactic Astrophysics",
    "Physics/General Relativity and Quantum Cosmology"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "QaJHl71xR61cftmPBydYpdBgGcpROuUhO0VVuFY6IME",
  "pdfSize": "448981"
}