{
  "id": "2412.13020",
  "title": "A Central Limit Theorem for the permutation importance measure",
  "authors": "Nico F\\\"oge, Lena Schmid, Marc Ditzhaus and Markus Pauly",
  "authorsParsed": [
    [
      "Föge",
      "Nico",
      ""
    ],
    [
      "Schmid",
      "Lena",
      ""
    ],
    [
      "Ditzhaus",
      "Marc",
      ""
    ],
    [
      "Pauly",
      "Markus",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 15:40:21 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734450021000,
  "abstract": "  Random Forests have become a widely used tool in machine learning since their\nintroduction in 2001, known for their strong performance in classification and\nregression tasks. One key feature of Random Forests is the Random Forest\nPermutation Importance Measure (RFPIM), an internal, non-parametric measure of\nvariable importance. While widely used, theoretical work on RFPIM is sparse,\nand most research has focused on empirical findings. However, recent progress\nhas been made, such as establishing consistency of the RFPIM, although a\nmathematical analysis of its asymptotic distribution is still missing. In this\npaper, we provide a formal proof of a Central Limit Theorem for RFPIM using\nU-Statistics theory. Our approach deviates from the conventional Random Forest\nmodel by assuming a random number of trees and imposing conditions on the\nregression functions and error terms, which must be bounded and additive,\nrespectively. Our result aims at improving the theoretical understanding of\nRFPIM rather than conducting comprehensive hypothesis testing. However, our\ncontributions provide a solid foundation and demonstrate the potential for\nfuture work to extend to practical applications which we also highlight with a\nsmall simulation study.\n",
  "subjects": [
    "Mathematics/Statistics Theory",
    "Statistics/Machine Learning",
    "Statistics/Statistics Theory"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "h2L46Qdpiy0EX1LJ09YrqPTBH89RSVbaeVKDm2Uwxko",
  "pdfSize": "809080"
}