{"id":"2412.04851","title":"Volumetric (dilatant) plasticity in geodynamic models and implications\n  on thermal dissipation and strain localization","authors":"Ekeabino Momoh, Harsha S. Bhat, Stephen Tait, Muriel Gerbault","authorsParsed":[["Momoh","Ekeabino",""],["Bhat","Harsha S.",""],["Tait","Stephen",""],["Gerbault","Muriel",""]],"versions":[{"version":"v1","created":"Fri, 6 Dec 2024 08:43:31 GMT"}],"updateDate":"2024-12-09","timestamp":1733474611000,"abstract":"  Here, we present a new thermomechanical geodynamic, numerical implementation\nthat incorporates Maxwell viscoelastic rheology accounting for\ntemperature-dependent power-law dislocation creep and pressure-sensitive,\nnon-associated Drucker-Prager brittle failure, as well as for volumetric\nstresses and strains during viscoplastic flow, a departure from the traditional\nincompressible assumptions. In solving for energy conservation, we incorporate\nthe heat source term resulting from irreversible mechanical deformations, which\nembodies viscoelastic and viscoplastic work, and by considering the total\nstress tensor and total inelastic strain rate tensors, including dilatant\nplasticity effects for lithospheric-scale applications, instead of only the\nshear terms as is usually assumed for incompressible materials. This form of\nthe work term thus allows to consider, volumetric deformation and to couple the\nenergy equation to the constitutive description, and hence the stress balance,\nvia the evolving temperature field. Code design enables us to switch individual\nfeatures of this general rheology ``on or off'' and thus to benchmark this\nimplementation with published numerical experiments of crustal-scale shortening\nexperiments. We investigate whether ``brittle-plastic'' compressibility can\npromote or inhibit localization of deformation and thermal evolution during\ncompression for crustal, and upper mantle rheology. For both crustal-scale and\nlithospheric-scale experiments, we establish that the feedback from volumetric\ndissipation, while contributing to temperature increase along with shear\ndissipation, can potentially slow down heat production per unit time, depending\non the choice of boundary conditions. Our new implementation can be used to\naddress buckling problems and collision tectonics.\n","subjects":["Physics/Geophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"IvaKAQQf6DfYbiL2PP0AX_PDf2GaQajRyBqvxTFpmZA","pdfSize":"13408970"}