{
  "id": "2412.20704",
  "title": "HFI: A unified framework for training-free detection and implicit\n  watermarking of latent diffusion model generated images",
  "authors": "Sungik Choi, Sungwoo Park, Jaehoon Lee, Seunghyun Kim, Stanley Jungkyu\n  Choi, Moontae Lee",
  "authorsParsed": [
    [
      "Choi",
      "Sungik",
      ""
    ],
    [
      "Park",
      "Sungwoo",
      ""
    ],
    [
      "Lee",
      "Jaehoon",
      ""
    ],
    [
      "Kim",
      "Seunghyun",
      ""
    ],
    [
      "Choi",
      "Stanley Jungkyu",
      ""
    ],
    [
      "Lee",
      "Moontae",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 30 Dec 2024 04:34:42 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735533282000,
  "abstract": "  Dramatic advances in the quality of the latent diffusion models (LDMs) also\nled to the malicious use of AI-generated images. While current AI-generated\nimage detection methods assume the availability of real/AI-generated images for\ntraining, this is practically limited given the vast expressibility of LDMs.\nThis motivates the training-free detection setup where no related data are\navailable in advance. The existing LDM-generated image detection method assumes\nthat images generated by LDM are easier to reconstruct using an autoencoder\nthan real images. However, we observe that this reconstruction distance is\noverfitted to background information, leading the current method to\nunderperform in detecting images with simple backgrounds. To address this, we\npropose a novel method called HFI. Specifically, by viewing the autoencoder of\nLDM as a downsampling-upsampling kernel, HFI measures the extent of aliasing, a\ndistortion of high-frequency information that appears in the reconstructed\nimage. HFI is training-free, efficient, and consistently outperforms other\ntraining-free methods in detecting challenging images generated by various\ngenerative models. We also show that HFI can successfully detect the images\ngenerated from the specified LDM as a means of implicit watermarking. HFI\noutperforms the best baseline method while achieving magnitudes of\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "ArVCvUh4PNLaGXhwoytx3fejCKHMgPLmRwC3np8kKCc",
  "pdfSize": "5270972"
}