{"id":"2412.09051","title":"Supersonic Shear and Wall-Bounded Flows With Body-Fitted Meshes Using\n  the Semi-Lagrangian Lattice Boltzmann Method: Boundary Schemes and\n  Applications","authors":"Philipp Spelten, Dominik Wilde, Mario Christopher Bedrunka, Dirk\n  Reith, Holger Foysi","authorsParsed":[["Spelten","Philipp",""],["Wilde","Dominik",""],["Bedrunka","Mario Christopher",""],["Reith","Dirk",""],["Foysi","Holger",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 08:22:25 GMT"}],"updateDate":"2024-12-13","timestamp":1733991745000,"abstract":"  Lattice Boltzmann method (LBM) simulations of incompressible flows are\nnowadays common and well-established. However, for compressible turbulent flows\nwith strong variable density and intrinsic compressibility effects, results are\nrelatively scarce. Only recently, progress was made regarding compressible LBM,\nusually applied to simple one and two-dimensional test cases due to the\nincreased computational expense. The recently developed semi-Lagrangian lattice\nBoltzmann method (SLLBM) is capable of simulating two- and three-dimensional\nviscous compressible flows. This paper presents bounce-back, thermal, inlet,\nand outlet boundary conditions new to the method and their application to\nproblems including heated or cooled walls, often required for supersonic flow\ncases. Using these boundary conditions, the SLLBM's capabilities are\ndemonstrated in various test cases, including a supersonic 2D NACA-0012\nairfoil, flow around a 3D sphere, and, to the best of our knowledge, for the\nfirst time, the 3D simulation of a supersonic turbulent channel flow at a bulk\nMach number of Ma=1.5 and a 3D temporal supersonic compressible mixing layer at\nconvective Mach numbers ranging from Ma=0.3 to Ma=1.2. The results show that\nthe compressible SLLBM is able to adequately capture intrinsic and variable\ndensity compressibility effects.\n","subjects":["Physics/Fluid Dynamics","Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"c2PQaYwSN7rqCiBzcPTkVen6EqiW1J2vLcSqQ7dgZKg","pdfSize":"7199937"}