{
  "id": "2412.18989",
  "title": "How Propense Are Large Language Models at Producing Code Smells? A\n  Benchmarking Study",
  "authors": "Alejandro Velasco, Daniel Rodriguez-Cardenas, Luftar Rahman Alif,\n  David N. Palacio, Denys Poshyvanyk",
  "authorsParsed": [
    [
      "Velasco",
      "Alejandro",
      ""
    ],
    [
      "Rodriguez-Cardenas",
      "Daniel",
      ""
    ],
    [
      "Alif",
      "Luftar Rahman",
      ""
    ],
    [
      "Palacio",
      "David N.",
      ""
    ],
    [
      "Poshyvanyk",
      "Denys",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 25 Dec 2024 21:56:35 GMT"
    },
    {
      "version": "v2",
      "created": "Sat, 18 Jan 2025 20:14:21 GMT"
    }
  ],
  "updateDate": "2025-01-22",
  "timestamp": 1735163795000,
  "abstract": "  Large Language Models (LLMs) have shown significant potential in automating\nsoftware engineering tasks, particularly in code generation. However, current\nevaluation benchmarks, which primarily focus on accuracy, fall short in\nassessing the quality of the code generated by these models, specifically their\ntendency to produce code smells. To address this limitation, we introduce\nCodeSmellEval, a benchmark designed to evaluate the propensity of LLMs for\ngenerating code smells. Our benchmark includes a novel metric: Propensity\nSmelly Score (PSC), and a curated dataset of method-level code smells:\nCodeSmellData. To demonstrate the use of CodeSmellEval, we conducted a case\nstudy with two state-of-the-art LLMs, CodeLlama and Mistral. The results reveal\nthat both models tend to generate code smells, such as simplifiable-condition\nand consider-merging-isinstance. These findings highlight the effectiveness of\nour benchmark in evaluating LLMs, providing valuable insights into their\nreliability and their propensity to introduce code smells in code generation\ntasks.\n",
  "subjects": [
    "Computer Science/Software Engineering",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "uRbo7wm3FiPgXWixUoXm57aZSbenGnUZVggL08IasOc",
  "pdfSize": "3187022"
}