{
  "id": "2412.20271",
  "title": "High-fidelity social learning via shared episodic memories enhances\n  collaborative foraging through mnemonic convergence",
  "authors": "Ismael T. Freire, Paul Verschure",
  "authorsParsed": [
    [
      "Freire",
      "Ismael T.",
      ""
    ],
    [
      "Verschure",
      "Paul",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 28 Dec 2024 20:55:38 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735419338000,
  "abstract": "  Social learning, a cornerstone of cultural evolution, enables individuals to\nacquire knowledge by observing and imitating others. At the heart of its\nefficacy lies episodic memory, which encodes specific behavioral sequences to\nfacilitate learning and decision-making. This study explores the interrelation\nbetween episodic memory and social learning in collective foraging. Using\nSequential Episodic Control (SEC) agents capable of sharing complete behavioral\nsequences stored in episodic memory, we investigate how variations in the\nfrequency and fidelity of social learning influence collaborative foraging\nperformance. Furthermore, we analyze the effects of social learning on the\ncontent and distribution of episodic memories across the group. High-fidelity\nsocial learning is shown to consistently enhance resource collection efficiency\nand distribution, with benefits sustained across memory lengths. In contrast,\nlow-fidelity learning fails to outperform nonsocial learning, spreading diverse\nbut ineffective mnemonic patterns. Novel analyses using mnemonic metrics reveal\nthat high-fidelity social learning also fosters mnemonic group alignment and\nequitable resource distribution, while low-fidelity conditions increase\nmnemonic diversity without translating to performance gains. Additionally, we\nidentify an optimal range for episodic memory length in this task, beyond which\nperformance plateaus. These findings underscore the critical effects of social\nlearning on mnemonic group alignment and distribution and highlight the\npotential of neurocomputational models to probe the cognitive mechanisms\ndriving cultural evolution.\n",
  "subjects": [
    "Computer Science/Artificial Intelligence",
    "Computer Science/Multiagent Systems"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "SC-55fl2cTOiJQEL8v7HwT3NGDAkHV0pnwZjHluGIQQ",
  "pdfSize": "5904846"
}