{"id":"2412.18171","title":"Token Highlighter: Inspecting and Mitigating Jailbreak Prompts for Large\n  Language Models","authors":"Xiaomeng Hu, Pin-Yu Chen and Tsung-Yi Ho","authorsParsed":[["Hu","Xiaomeng",""],["Chen","Pin-Yu",""],["Ho","Tsung-Yi",""]],"versions":[{"version":"v1","created":"Tue, 24 Dec 2024 05:10:02 GMT"},{"version":"v2","created":"Wed, 25 Dec 2024 02:15:50 GMT"}],"updateDate":"2024-12-30","timestamp":1735017002000,"abstract":"  Large Language Models (LLMs) are increasingly being integrated into services\nsuch as ChatGPT to provide responses to user queries. To mitigate potential\nharm and prevent misuse, there have been concerted efforts to align the LLMs\nwith human values and legal compliance by incorporating various techniques,\nsuch as Reinforcement Learning from Human Feedback (RLHF), into the training of\nthe LLMs. However, recent research has exposed that even aligned LLMs are\nsusceptible to adversarial manipulations known as Jailbreak Attacks. To address\nthis challenge, this paper proposes a method called Token Highlighter to\ninspect and mitigate the potential jailbreak threats in the user query. Token\nHighlighter introduced a concept called Affirmation Loss to measure the LLM's\nwillingness to answer the user query. It then uses the gradient of Affirmation\nLoss for each token in the user query to locate the jailbreak-critical tokens.\nFurther, Token Highlighter exploits our proposed Soft Removal technique to\nmitigate the jailbreak effects of critical tokens via shrinking their token\nembeddings. Experimental results on two aligned LLMs (LLaMA-2 and Vicuna-V1.5)\ndemonstrate that the proposed method can effectively defend against a variety\nof Jailbreak Attacks while maintaining competent performance on benign\nquestions of the AlpacaEval benchmark. In addition, Token Highlighter is a\ncost-effective and interpretable defense because it only needs to query the\nprotected LLM once to compute the Affirmation Loss and can highlight the\ncritical tokens upon refusal.\n","subjects":["Computer Science/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"qrW9jP3H4JWJnaadR-0HrwhoeQE4ORboZOvtEC9XF-w","pdfSize":"1558604"}