{
  "id": "2412.16049",
  "title": "Generalized Wilson lines and the gravitational scattering of spinning\n  bodies",
  "authors": "Domenico Bonocore, Anna Kulesza and Johannes Pirsch",
  "authorsParsed": [
    [
      "Bonocore",
      "Domenico",
      ""
    ],
    [
      "Kulesza",
      "Anna",
      ""
    ],
    [
      "Pirsch",
      "Johannes",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 16:51:21 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734713481000,
  "abstract": "  A generalization of Wilson line operators at subleading power in the soft\nexpansion has been recently introduced as an efficient building block of\ngravitational scattering amplitudes for non-spinning objects. The classical\nlimit in this picture corresponds to the strict Regge limit, where the\nPost-Minkowskian (PM) expansion corresponds to the soft expansion, interpreted\nas a sum over correlations of soft emissions. Building on the well-studied\nworldline model with ${\\cal N}=1$ supersymmetry, in this work we extend the\ngeneralized Wilson line (GWL) approach to the case of spinning gravitating\nbodies. Specifically, at the quantum level we derive from first-principles a\nrepresentation for the spin $1/2$ GWL that is relevant for the all-order\nfactorization of next-to-soft gravitons with fermionic matter, thus\ngeneralizing the exponentiation of single-emission next-to-soft theorems. At\nthe classical level, we identity the suitable generalization of Wilson line\noperators that enables the generation of classical spin observables at linear\norder in spin. Thanks to the crucial role played by the soft expansion, the map\nfrom Grassmann variables to classical spin is manifest. We also comment on the\nrelation between the GWL approach and the Worldline Quantum Field Theory as\nwell as the Heavy Mass Effective Theory formalism. We validate the approach by\nrederiving known results in the conservative sector at 2PM order.\n",
  "subjects": [
    "Physics/High Energy Physics - Theory"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "wRUjnI7XpMOSEOOW0LJw_B--BlV7R4i7jaUJhtDglEE",
  "pdfSize": "708348"
}