{"id":"2412.15583","title":"Tracking the 2024 US Presidential Election Chatter on TikTok: A Public\n  Multimodal Dataset","authors":"Gabriela Pinto, Charles Bickham, Tanishq Salkar, Joyston Menezes, Luca\n  Luceri, Emilio Ferrara","authorsParsed":[["Pinto","Gabriela",""],["Bickham","Charles",""],["Salkar","Tanishq",""],["Menezes","Joyston",""],["Luceri","Luca",""],["Ferrara","Emilio",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 05:36:23 GMT"}],"updateDate":"2024-12-23","timestamp":1734672983000,"abstract":"  This paper presents the TikTok 2024 U.S. Presidential Election Dataset, a\nlarge-scale, resource designed to advance research into political communication\nand social media dynamics. The dataset comprises 3.14 million videos published\non TikTok between November 1, 2023, and October 16, 2024, encompassing video\nids and transcripts. Data collection was conducted using the TikTok Research\nAPI with a comprehensive set of election-related keywords and hashtags,\nsupplemented by third-party tools to address API limitations and expand content\ncoverage, enabling analysis of hashtag co-occurrence networks that reveal\npolitically aligned hashtags based on ideological affiliations, the evolution\nof top hashtags over time, and summary statistics that highlight the dataset's\nscale and richness. This dataset offers insights into TikTok's role in shaping\nelectoral discourse by providing a multimodal view of election-related content.\nIt enables researchers to explore critical topics such as coordinated\nmessaging, misinformation spread, audience engagement, and linguistic trends.\nThe TikTok 2024 U.S. Presidential Election Dataset is publicly available and\naims to contribute to the broader understanding of social media's impact on\ndemocracy and public opinion.\n","subjects":["Computer Science/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"3ZBFVYTpT6eDdffD9rdT6QISspPrvZ_1pIGDNQbLqxw","pdfSize":"2693299"}