{"id":"2412.17217","title":"Machine learning and natural language processing models to predict the\n  extent of food processing","authors":"Nalin Arora, Sumit Bhagat, Riya Dhama, Ganesh Bagler","authorsParsed":[["Arora","Nalin",""],["Bhagat","Sumit",""],["Dhama","Riya",""],["Bagler","Ganesh",""]],"versions":[{"version":"v1","created":"Mon, 23 Dec 2024 02:08:45 GMT"}],"updateDate":"2024-12-24","timestamp":1734919725000,"abstract":"  The dramatic increase in consumption of ultra-processed food has been\nassociated with numerous adverse health effects. Given the public health\nconsequences linked to ultra-processed food consumption, it is highly relevant\nto build computational models to predict the processing of food products. We\ncreated a range of machine learning, deep learning, and NLP models to predict\nthe extent of food processing by integrating the FNDDS dataset of food products\nand their nutrient profiles with their reported NOVA processing level. Starting\nwith the full nutritional panel of 102 features, we further implemented\ncoarse-graining of features to 65 and 13 nutrients by dropping flavonoids and\nthen by considering the 13-nutrient panel of FDA, respectively. LGBM Classifier\nand Random Forest emerged as the best model for 102 and 65 nutrients,\nrespectively, with an F1-score of 0.9411 and 0.9345 and MCC of 0.8691 and\n0.8543. For the 13-nutrient panel, Gradient Boost achieved the best F1-score of\n0.9284 and MCC of 0.8425. We also implemented NLP based models, which exhibited\nstate-of-the-art performance. Besides distilling nutrients critical for model\nperformance, we present a user-friendly web server for predicting processing\nlevel based on the nutrient panel of a food product:\nhttps://cosylab.iiitd.edu.in/food-processing/.\n","subjects":["Quantitative Biology/Biomolecules","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"WWF4cMCntO6wwgRWe5QmAMJ366P6AmQH48zxx2ZgeaA","pdfSize":"3325982"}