{"id":"2412.09679","title":"Jetted Seyfert Galaxies at z = 0: Simulating Feedback Effects on\n  Galactic Morphology and Beyond","authors":"Julianne Goddard (1), Isaac Shlosman (1 and 2), and Emilio Romano-Diaz\n  (3) ((1) Department of Physics and Astronomy, University of Kentucky, KY,\n  USA, (2) Theoretical Astrophysics, School of Sciences, Osaka University,\n  Japan, (3) Argelander-Institut f\\\"ur Astronomie, Bonn, Germany)","authorsParsed":[["Goddard","Julianne","","1 and 2"],["Shlosman","Isaac","","1 and 2"],["Romano-Diaz","Emilio",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 19:00:10 GMT"}],"updateDate":"2024-12-16","timestamp":1734030010000,"abstract":"  We use high-resolution cosmological zoom-in simulations to model feedback\nfrom Seyfert-type supermassive black hole (SMBH) jets onto galaxies with\nidentical dark matter (DM) halos of log(M/M$_\\odot$) ~ 11.8. The low mass,\n~10$^6$ M$_\\odot$, seed SMBHs, have been introduced when the parent DM halos\nhave reached log(M/M$_\\odot$) ~ 11, at z ~ 3.7. In a controlled experiment, we\nvary only the efficiency of the SMBH accretion and focus on galaxies and their\nimmediate environment properties. Our results show that the AGN jet feedback\nhas a substantial effect on the basic properties of Seyfert-type galaxies, such\nas morphology, gas fraction and distribution, star formation rate and\ndistribution, bulge-to-disk ratio, DM halo baryon fraction, and properties of\ncircumgalactic medium (CGM) and beyond. These have been compared to a galaxy\nwith supernovae only feedback. We focus on the energy deposition by the jet in\nthe ISM and IGM, and follow the expansion of the multiple jet cocoons to 2 Mpc.\nWe find that the jet-ISM interaction gradually pushes the star formation to\nlarger radii with increasing accretion efficiency, which results in increased\nmass of the outer stellar disk, which is best fit as a double-exponential disk.\nFurthermore, we compare our galaxies and their properties with the observed\nnearby Seyfert galaxies, including the scaling relations, and find a close\nagreement, although statistical analysis of observed Seyferts is currently\nmissing. In a forthcoming paper, we focus on evolution of these objects at z<10\nand study the effect of the SMBH seeding redshift on galaxy evolution.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"FC6UzF0Zibn7DYp0Z_Wlik10Hnft893wyvsDA0X1KAo","pdfSize":"26130154"}