{
  "id": "2412.20515",
  "title": "Entanglement as a topological marker in harmonically confined attractive\n  Fermi-Hubbard chains",
  "authors": "Marina Sanino and Isaac Carvalho and Vivian Fran\\c{c}a",
  "authorsParsed": [
    [
      "Sanino",
      "Marina",
      ""
    ],
    [
      "Carvalho",
      "Isaac",
      ""
    ],
    [
      "França",
      "Vivian",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 29 Dec 2024 16:22:44 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735489364000,
  "abstract": "  We investigate the single-site von Neumann entropy along a harmonically\nconfined superfluid chain, as described by the one-dimensional fermionic\nHubbard model with strongly attractive interactions. We find that by increasing\nthe confinement (or equivalently the particle filling) the system undergoes a\nquantum phase transition from a superfluid (SF) to a non-trivial topological\ninsulator (TI) phase, which is characterized by an insulating bulk surrounded\nby highly entangled superfluid edges. These highly entangled states are found\nto be robust against perturbations and topologically protected by the\nparticle-hole symmetry, which is locally preserved. We also find a\nsemi-quantitative agreement between entanglement and superconducting order\nparameter profiles, confirming then that entanglement can be used as a\ntopological marker and an order parameter in these systems. The charge gap not\nonly confirms the SF-TI transition, but also shows that this transition is\nmediated by a metallic intermediate regime within the bulk. Using the gap we\ncould depict a phase diagram for which the non-trivial topological insulator\ncan be found in such harmonically confined attractive systems.\n",
  "subjects": [
    "Condensed Matter/Quantum Gases",
    "Condensed Matter/Strongly Correlated Electrons"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "-tlzFvZf0YB3aO7ud49XYyhRr-yfk9mNNYXPZzdKWDE",
  "pdfSize": "2197721"
}