{"id":"2412.00330","title":"Ethics and Artificial Intelligence Adoption","authors":"Martim Veiga, Carlos J. Costa","authorsParsed":[["Veiga","Martim",""],["Costa","Carlos J.",""]],"versions":[{"version":"v1","created":"Sat, 30 Nov 2024 03:08:15 GMT"}],"updateDate":"2024-12-03","timestamp":1732936095000,"abstract":"  In recent years, we have witnessed a marked development and growth in\nArtificial Intelligence. The growth of the data volume generated by sensors and\nmachines, combined with the information flow resulting from the user actions on\nthe Internet, with high investments of the governments and the companies in\nthis area, provided the practice and developed the algorithms of the Artificial\nIntelligence However, the people, in general, started to feel a particular fear\nregarding the security and privacy of their data and the theme of the\nArtificial Intelligence Ethics began to be discussed more regularly. The\ninvestigation aim of this work is to understand the possibility of adopting\nArtificial Intelligence nowadays in our society, having, as a mandatory\nassumption, Ethics and respect towards data and people's privacy. With that\npurpose in mind, a model has been created, mainly supported by the theories\nthat were used to create the model. The suggested model has been tested and\nvalidated through Structural equation modeling based on data taken back from\nthe respondents' answers to the questionnaire online: 237 answers, mainly from\nthe Investigation Technologies area. The results obtained enabled the\nvalidation of seven of the nine investigation hypotheses of the proposed model.\nIt was impossible to confirm any association between the Social Influence\nconstruct and the variables of Behavioral Intention and the Use of Artificial\nIntelligence. The aim of this work was accomplished once the investigation\ntheme was validated and proved that it is possible to adopt Artificial\nIntelligence in our society, using the Attitude Towards Ethical Behavioral\nconstruct as the mainstay of the model.\n","subjects":["Computer Science/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"koEQAavPz127UxEXT7TXiwgCzA5a9iJ0K-F2ZNVBqbU","pdfSize":"347592"}