{"id":"2412.02885","title":"SymBreak: Mitigating Quantum Degeneracy Issues in QLDPC Code Decoders by\n  Breaking Symmetry","authors":"Keyi Yin, Xiang Fang, Jixuan Ruan, Hezi Zhang, Dean Tullsen, Andrew\n  Sornborger, Chenxu Liu, Ang Li, Travis Humble, Yufei Ding","authorsParsed":[["Yin","Keyi",""],["Fang","Xiang",""],["Ruan","Jixuan",""],["Zhang","Hezi",""],["Tullsen","Dean",""],["Sornborger","Andrew",""],["Liu","Chenxu",""],["Li","Ang",""],["Humble","Travis",""],["Ding","Yufei",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 22:45:43 GMT"}],"updateDate":"2024-12-05","timestamp":1733265943000,"abstract":"  Quantum error correction (QEC) is critical for scalable and reliable quantum\ncomputing, but existing solutions, such as surface codes, incur significant\nqubit overhead. Quantum low-density parity check (qLDPC) codes have recently\nemerged as a promising alternative, requiring fewer qubits. However, the lack\nof efficient decoders remains a major barrier to their practical\nimplementation. In this work, we introduce SymBreak, a novel decoder for qLDPC\ncodes that adaptively modifies the decoding graph to improve the performance of\nstate-of-the-art belief propagation (BP) decoders. Our key contribution is\nidentifying quantum degeneracy as a root cause of the convergence issues often\nencountered in BP decoding of quantum LDPC codes. We propose a solution that\nmitigates this issue at the decoding graph level, achieving both fast and\naccurate decoding. Our results demonstrate that SymBreak outperforms BP and\nBP+OSD-a more complex variant of BP-with a $16.17\\times$ reduction in logical\nerror rate compared to BP and $3.23\\times$ compared to BP+OSD across various\nqLDPC code families. With only an $18.97$% time overhead compared to BP,\nSymBreak provides significantly faster decoding times than BP+OSD, representing\na major advancement in efficient and accurate decoding for qLDPC-based QEC\narchitectures.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7B-1Au-VbFySSJgGVq_jOYGf91A2Jva6bIewVKXi2Vk","pdfSize":"2389183"}