{
  "id": "2412.14019",
  "title": "Discovery of Maximally Consistent Causal Orders with Large Language\n  Models",
  "authors": "Federico Baldo, Simon Ferreira, Charles K. Assaad",
  "authorsParsed": [
    [
      "Baldo",
      "Federico",
      ""
    ],
    [
      "Ferreira",
      "Simon",
      ""
    ],
    [
      "Assaad",
      "Charles K.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 16:37:51 GMT"
    },
    {
      "version": "v2",
      "created": "Sun, 9 Feb 2025 16:40:38 GMT"
    }
  ],
  "updateDate": "2025-02-11",
  "timestamp": 1734539871000,
  "abstract": "  Causal discovery is essential for understanding complex systems, as it aims\nto uncover causal relationships from observational data in the form of a causal\ndirected acyclic graph (DAG). However, traditional methods often rely on\nstrong, untestable assumptions, which makes them unreliable in real\napplications. Large Language Models (LLMs) present a promising alternative for\nextracting causal knowledge from text-based metadata, which consolidates domain\nexpertise. However, LLMs are prone to unreliability and hallucinations,\nnecessitating strategies that account for their limitations. One such strategy\ninvolves leveraging a consistency measure to evaluate reliability.\nAdditionally, most text metadata does not clearly distinguish direct causal\nrelationships from indirect ones, further complicating the discovery of a\ncausal DAG. As a result, focusing on causal orderings, rather than causal DAGs,\nemerges as a more practical and robust approach. We propose a novel method to\nderive a class of acyclic tournaments (representing plausible causal orders)\nthat maximizes a consistency score derived from an LLM. Our approach begins by\ncomputing pairwise consistency scores between variables, yielding a\nsemi-complete directed graph that aggregates these scores. From this structure,\nwe identify optimal acyclic tournaments, prioritizing those that maximize\nconsistency across all configurations. We tested our method on both\nwell-established benchmarks, as well as real-world datasets from epidemiology\nand public health. Our results demonstrate the effectiveness of our approach in\nrecovering a class of causal orders.\n",
  "subjects": [
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Dppylk5yyh4AaVPqfMTeCzpqIqXSiqxiMkbTYkudVrs",
  "pdfSize": "351903"
}