{
  "id": "2412.03875",
  "title": "Learning to Hash for Recommendation: A Survey",
  "authors": "Fangyuan Luo, Honglei Zhang, Tong Li, Jun Wu",
  "authorsParsed": [
    [
      "Luo",
      "Fangyuan",
      ""
    ],
    [
      "Zhang",
      "Honglei",
      ""
    ],
    [
      "Li",
      "Tong",
      ""
    ],
    [
      "Wu",
      "Jun",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 05:07:19 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733375239000,
  "abstract": "  With the explosive growth of users and items, Recommender Systems (RS) are\nfacing unprecedented challenges on both retrieval efficiency and storage cost.\nFortunately, Learning to Hash (L2H) techniques have been shown as a promising\nsolution to address the two dilemmas, whose core idea is encoding\nhigh-dimensional data into compact hash codes. To this end, L2H for RS (HashRec\nfor short) has recently received widespread attention to support large-scale\nrecommendations. In this survey, we present a comprehensive review of current\nHashRec algorithms. Specifically, we first introduce the commonly used\ntwo-tower models in the recall stage and identify two search strategies\nfrequently employed in L2H. Then, we categorize prior works into two-tier\ntaxonomy based on: (i) the type of loss function and (ii) the optimization\nstrategy. We also introduce some commonly used evaluation metrics to measure\nthe performance of HashRec algorithms. Finally, we shed light on the\nlimitations of the current research and outline the future research directions.\nFurthermore, the summary of HashRec methods reviewed in this survey can be\nfound at\n\\href{https://github.com/Luo-Fangyuan/HashRec}{https://github.com/Luo-Fangyuan/HashRec}.\n",
  "subjects": [
    "Computer Science/Information Retrieval"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "hoc-5EGgb8Up8Gq1sl0doTX8A5kAwMUkpZxhbjuAElM",
  "pdfSize": "1196638"
}