{"id":"2412.03925","title":"Traffic Co-Simulation Framework Empowered by Infrastructure Camera\n  Sensing and Reinforcement Learning","authors":"Talha Azfar and Ruimin Ke","authorsParsed":[["Azfar","Talha",""],["Ke","Ruimin",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 07:01:56 GMT"}],"updateDate":"2024-12-06","timestamp":1733382116000,"abstract":"  Traffic simulations are commonly used to optimize traffic flow, with\nreinforcement learning (RL) showing promising potential for automated traffic\nsignal control. Multi-agent reinforcement learning (MARL) is particularly\neffective for learning control strategies for traffic lights in a network using\niterative simulations. However, existing methods often assume perfect vehicle\ndetection, which overlooks real-world limitations related to infrastructure\navailability and sensor reliability. This study proposes a co-simulation\nframework integrating CARLA and SUMO, which combines high-fidelity 3D modeling\nwith large-scale traffic flow simulation. Cameras mounted on traffic light\npoles within the CARLA environment use a YOLO-based computer vision system to\ndetect and count vehicles, providing real-time traffic data as input for\nadaptive signal control in SUMO. MARL agents, trained with four different\nreward structures, leverage this visual feedback to optimize signal timings and\nimprove network-wide traffic flow. Experiments in the test-bed demonstrate the\neffectiveness of the proposed MARL approach in enhancing traffic conditions\nusing real-time camera-based detection. The framework also evaluates the\nrobustness of MARL under faulty or sparse sensing and compares the performance\nof YOLOv5 and YOLOv8 for vehicle detection. Results show that while better\naccuracy improves performance, MARL agents can still achieve significant\nimprovements with imperfect detection, demonstrating adaptability for\nreal-world scenarios.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computer Science/Machine Learning","Computer Science/Systems and Control","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"xot9_Loj-Hkbu3xybrxtnb0qVHzqdT808Lg0aOqRQ4A","pdfSize":"3133944"}