{"id":"2412.08477","title":"Accurate Water Level Monitoring in AWD Rice Cultivation Using\n  Convolutional Neural Networks","authors":"Ahmed Rafi Hasan, Niloy Kumar Kundu, Saad Hasan, Mohammad Rashedul\n  Hoque, Swakkhar Shatabda","authorsParsed":[["Hasan","Ahmed Rafi",""],["Kundu","Niloy Kumar",""],["Hasan","Saad",""],["Hoque","Mohammad Rashedul",""],["Shatabda","Swakkhar",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 15:44:08 GMT"},{"version":"v2","created":"Thu, 12 Dec 2024 05:45:10 GMT"}],"updateDate":"2024-12-13","timestamp":1733931848000,"abstract":"  The Alternate Wetting and Drying (AWD) method is a rice-growing water\nmanagement technique promoted as a sustainable alternative to Continuous\nFlooding (CF). Climate change has placed the agricultural sector in a\nchallenging position, particularly as global water resources become\nincreasingly scarce, affecting rice production on irrigated lowlands. Rice, a\nstaple food for over half of the world's population, demands significantly more\nwater than other major crops. In Bangladesh, Boro rice, in particular, requires\nconsiderable water inputs during its cultivation. Traditionally, farmers\nmanually measure water levels, a process that is both time-consuming and prone\nto errors. While ultrasonic sensors offer improvements in water height\nmeasurement, they still face limitations, such as susceptibility to weather\nconditions and environmental factors. To address these issues, we propose a\nnovel approach that automates water height measurement using computer vision,\nspecifically through a convolutional neural network (CNN). Our attention-based\narchitecture achieved an $R^2$ score of 0.9885 and a Mean Squared Error (MSE)\nof 0.2766, providing a more accurate and efficient solution for managing AWD\nsystems.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"sJlfe1nAt2TZLqWfQmpUg9sYtTbBNAgrvoE3LWmfOR0","pdfSize":"2181133"}