{
  "id": "2412.04770",
  "title": "Comparison of bar formation mechanisms I: does a tidally-induced bar\n  rotate slower than an internally-induced bar?",
  "authors": "Yirui Zheng and Juntai Shen",
  "authorsParsed": [
    [
      "Zheng",
      "Yirui",
      ""
    ],
    [
      "Shen",
      "Juntai",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 04:31:24 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733459484000,
  "abstract": "  Galactic bars can form via the internal bar instability or external tidal\nperturbations by other galaxies. We systematically compare the properties of\nbars formed through the two mechanisms with a series of controlled $N$-body\nsimulations that form bars through internal or external mechanisms. We create\nthree disk galaxy models with different dynamical ``hotness'' and evolve them\nin isolation and under flyby interactions. In the cold and warm disk models,\nwhere bars can form spontaneously in isolation, tidally-induced bars are\npromoted to a more ``advanced'' evolutionary stage. However, these bars have\nsimilar pattern speeds to those formed spontaneously within the same disk. Bars\nformed from both mechanisms have similar distributions in pattern speed--bar\nstrength ($\\Omega_p-A_2$) space and exhibit comparable ratios of co-rotation\nradius to bar length (${\\cal R}={R_{\\mathrm {CR}}}/{R_{\\mathrm {bar}}}$).\nDynamical analyses suggest that the inner stellar disk loses the same amount of\nangular momentum, irrespective of the presence or intensity of the\nperturbation, which possibly explains the resemblance between tidally and\nspontaneously formed bars. In the hot disk model, which avoids the internal bar\ninstability in isolation, a bar forms only under perturbations and rotates more\nslowly than those in the cold and warm disks. Thus, if ``tidally-induced bars''\nrefer exclusively to those in galaxies that are otherwise stable against bar\ninstability, they indeed rotate slower than internally-induced ones. However,\nthe pattern speed difference is due to the difference in the internal\nproperties of the bar host galaxies, not the different formation mechanisms.\n",
  "subjects": [
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "ujW9q-32uhlGGXAk06csk1rCKMYhpz52PmNihgzGE8M",
  "pdfSize": "2290833"
}