{
  "id": "2412.13984",
  "title": "Components and anisotropy of 3D QFP waves during the early solar\n  eruption",
  "authors": "Jialiang Hu, Jing Ye, Yuhao Chen, Zhixing Mei, Shanshan Xu, and Jun\n  Lin",
  "authorsParsed": [
    [
      "Hu",
      "Jialiang",
      ""
    ],
    [
      "Ye",
      "Jing",
      ""
    ],
    [
      "Chen",
      "Yuhao",
      ""
    ],
    [
      "Mei",
      "Zhixing",
      ""
    ],
    [
      "Xu",
      "Shanshan",
      ""
    ],
    [
      "Lin",
      "Jun",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 16:06:04 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734537964000,
  "abstract": "  The propagation of disturbances in the solar atmosphere is inherently three\ndimensional (3D), yet comprehensive studies on the spatial structure and\ndynamics of 3D wavefronts are scarce. Here we conduct high resolution 3D\nnumerical simulations to investigate filament eruptions, focusing particularly\non the 3D structure and genesis of EUV waves. Our results demonstrate that the\nEUV wavefront forms a dome like configuration subdivided into three distinct\nzones. The foremost zone, preceding the flux rope, consists of fast-mode shock\nwaves that heat the adjacent plasma. Adjacent to either side of the flux rope,\nthe second zone contains expansion waves that cool the nearby plasma. The third\nzone, at the juncture of the first two, exhibits minimal disturbances. This\nanisotropic structure of the wavefront stems from the configuration and\ndynamics of the flux rope, which acts as a 3D piston during eruptions\n:compressing the plasma ahead to generate fast mode shocks and evacuating the\nplasma behind to induce expansion waves. This dynamic results in the observed\nanisotropic wavefront.Additionally, with synthetic EUV images from simulation\ndata, the EUV waves are observable in Atmospheric Imaging Assembly 193 and 211\nangstrom, which are identified as the fast mode shocks. The detection of EUV\nwaves varies with the observational perspective: the face on view reveals EUV\nwaves from the lower to the higher corona, whereas an edge on view uncovers\nthese waves only in the higher corona.\n",
  "subjects": [
    "Astrophysics/Solar and Stellar Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "D11nxHXGjttWrptL9OZKa3ln_6BjEukbX40CEJ--KB4",
  "pdfSize": "25712255"
}