{"id":"2412.08530","title":"Ensemble-Based Quantum-Token Protocol Benchmarked on IBM Quantum\n  Processors","authors":"Lucas Tsunaki, Bernd Bauerhenne, Malwin Xibraku, Martin E. Garcia,\n  Kilian Singer, Boris Naydenov","authorsParsed":[["Tsunaki","Lucas",""],["Bauerhenne","Bernd",""],["Xibraku","Malwin",""],["Garcia","Martin E.",""],["Singer","Kilian",""],["Naydenov","Boris",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 16:39:39 GMT"},{"version":"v2","created":"Mon, 24 Feb 2025 10:15:52 GMT"}],"updateDate":"2025-02-25","timestamp":1733935179000,"abstract":"  Quantum tokens envision to store unclonable keys in quantum states that can\nbe used for personal authentication in a physical device issued by a bank, for\ninstance. Still, its experimental realization faces many technical challenges.\nIn this work, we propose an ensemble-based quantum-token protocol, having the\npotential to make these applications technologically less-demanding. Therefore,\nin order to demonstrate the safety of the protocol, a simple and minimal model\nbased on an observable operator and measurement uncertainty is developed to\ndescribe the quantum token hardware, while the protocol is fully benchmarked\nand compared on five different IBM quantum processors. First, the uncertainties\nof the hardware are characterized, from which the main quality parameters that\ndescribe the token can be extracted. Following that, the fraction of qubits\nwhich the bank prepares and measures successfully is benchmarked. These\nfractions are then compared with the values obtained from an attacker who\nattempts to read the bank token and prepare a forged key. From which we\nexperimentally demonstrate an acceptance probability of 0.059 for a single\nforged token, in contrast to 0.999 for the bank's own tokens. These values can\nbe further optimized by increasing the number of tokens in the device, where\neven in the worst IBMQ, with 49 tokens the acceptance probability of forged\ntokens is below $10^{-22}$. Finally, we show that minor improvements in the\nhardware quality lead to significant increases in the protocol security,\ndenoting a great potential of the protocol to scale with the ongoing quantum\nhardware evolution. This work demonstrates the overall security of the protocol\nwithin a hardware-agnostic framework, further confirming the interoperability\nof the protocol in arbitrary quantum systems and thus paving the way for future\napplications with different qubits.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"ikorYxxLlh4D7Sa7HlMdZgi6NaH2irhAALoxls0eabE","pdfSize":"1931434"}