{
  "id": "2412.03701",
  "title": "Interpretable Hierarchical Attention Network for Medical Condition\n  Identification",
  "authors": "Dongping Fang, Lian Duan, Xiaojing Yuan, Allyn Klunder, Kevin Tan,\n  Suiting Cao, Yeqing Ji, Mike Xu",
  "authorsParsed": [
    [
      "Fang",
      "Dongping",
      ""
    ],
    [
      "Duan",
      "Lian",
      ""
    ],
    [
      "Yuan",
      "Xiaojing",
      ""
    ],
    [
      "Klunder",
      "Allyn",
      ""
    ],
    [
      "Tan",
      "Kevin",
      ""
    ],
    [
      "Cao",
      "Suiting",
      ""
    ],
    [
      "Ji",
      "Yeqing",
      ""
    ],
    [
      "Xu",
      "Mike",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 20:31:40 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733344300000,
  "abstract": "  Accurate prediction of medical conditions with straight past clinical\nevidence is a long-sought topic in the medical management and health insurance\nfield. Although great progress has been made with machine learning algorithms,\nthe medical community is still skeptical about the model accuracy and\ninterpretability. This paper presents an innovative hierarchical attention deep\nlearning model to achieve better prediction and clear interpretability that can\nbe easily understood by medical professionals.\n  This paper developed an Interpretable Hierarchical Attention Network (IHAN).\nIHAN uses a hierarchical attention structure that matches naturally with the\nmedical history data structure and reflects patients encounter (date of\nservice) sequence. The model attention structure consists of 3 levels: (1)\nattention on the medical code types (diagnosis codes, procedure codes, lab test\nresults, and prescription drugs), (2) attention on the sequential medical\nencounters within a type, (3) attention on the individual medical codes within\nan encounter and type.\n  This model is applied to predict the occurrence of stage 3 chronic kidney\ndisease (CKD), using three years medical history of Medicare Advantage (MA)\nmembers from an American nationwide health insurance company. The model takes\nmembers medical events, both claims and Electronic Medical Records (EMR) data,\nas input, makes a prediction of stage 3 CKD and calculates contribution from\nindividual events to the predicted outcome.\n",
  "subjects": [
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "e_LrWB7DPbEdYs5UIQyYG1_oZyC5J5RLkQo0zCs7n5g",
  "pdfSize": "384118"
}