{"id":"2412.00094","title":"A Novel Approach to Image Steganography Using Generative Adversarial\n  Networks","authors":"Waheed Rehman","authorsParsed":[["Rehman","Waheed",""]],"versions":[{"version":"v1","created":"Wed, 27 Nov 2024 14:34:41 GMT"}],"updateDate":"2024-12-03","timestamp":1732718081000,"abstract":"  The field of steganography has long been focused on developing methods to\nsecurely embed information within various digital media while ensuring\nimperceptibility and robustness. However, the growing sophistication of\ndetection tools and the demand for increased data hiding capacity have revealed\nlimitations in traditional techniques. In this paper, we propose a novel\napproach to image steganography that leverages the power of generative\nadversarial networks (GANs) to address these challenges. By employing a\ncarefully designed GAN architecture, our method ensures the creation of\nstego-images that are visually indistinguishable from their original\ncounterparts, effectively thwarting detection by advanced steganalysis tools.\nAdditionally, the adversarial training paradigm optimizes the balance between\nembedding capacity, imperceptibility, and robustness, enabling more efficient\nand secure data hiding. We evaluate our proposed method through a series of\nexperiments on benchmark datasets and compare its performance against baseline\ntechniques, including least significant bit (LSB) substitution and discrete\ncosine transform (DCT)-based methods. Our results demonstrate significant\nimprovements in metrics such as Peak Signal-to-Noise Ratio (PSNR), Structural\nSimilarity Index Measure (SSIM), and robustness against detection. This work\nnot only contributes to the advancement of image steganography but also\nprovides a foundation for exploring GAN-based approaches for secure digital\ncommunication.\n","subjects":["Computer Science/Cryptography and Security","Computer Science/Computer Vision and Pattern Recognition","Computer Science/Machine Learning"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"ULQ2At_TPmfvS7GSGCgUVuWhzEOVu2ywQLk4wnkOTWg","pdfSize":"153795"}