{
  "id": "2412.11620",
  "title": "Combating Semantic Contamination in Learning with Label Noise",
  "authors": "Wenxiao Fan, Kan Li",
  "authorsParsed": [
    [
      "Fan",
      "Wenxiao",
      ""
    ],
    [
      "Li",
      "Kan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 10:07:15 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 17 Dec 2024 04:26:08 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734343635000,
  "abstract": "  Noisy labels can negatively impact the performance of deep neural networks.\nOne common solution is label refurbishment, which involves reconstructing noisy\nlabels through predictions and distributions. However, these methods may\nintroduce problematic semantic associations, a phenomenon that we identify as\nSemantic Contamination. Through an analysis of Robust LR, a representative\nlabel refurbishment method, we found that utilizing the logits of views for\nrefurbishment does not adequately balance the semantic information of\nindividual classes. Conversely, using the logits of models fails to maintain\nconsistent semantic relationships across models, which explains why label\nrefurbishment methods frequently encounter issues related to Semantic\nContamination. To address this issue, we propose a novel method called\nCollaborative Cross Learning, which utilizes semi-supervised learning on\nrefurbished labels to extract appropriate semantic associations from embeddings\nacross views and models. Experimental results show that our method outperforms\nexisting approaches on both synthetic and real-world noisy datasets,\neffectively mitigating the impact of label noise and Semantic Contamination.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "GahuOIhGaJRH-115YHKM2GquFk_og8XFVdj2CGLU31s",
  "pdfSize": "4830351"
}