{
  "id": "2412.14022",
  "title": "The Evolution of Massive Stellar Multiplicity in the Field I. Numerical\n  simulations, long-term evolution and final outcomes",
  "authors": "Holly P. Preece, A. Vigna-G\\'omez, A. S. Rajamuthukumar, P. Vynatheya,\n  J. Klencki",
  "authorsParsed": [
    [
      "Preece",
      "Holly P.",
      ""
    ],
    [
      "Vigna-Gómez",
      "A.",
      ""
    ],
    [
      "Rajamuthukumar",
      "A. S.",
      ""
    ],
    [
      "Vynatheya",
      "P.",
      ""
    ],
    [
      "Klencki",
      "J.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 16:39:26 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734539966000,
  "abstract": "  We investigate how the multiplicity of binary, triple and quadruple star\nsystems changes as the systems evolve from the zero-age main-sequence to the\nHubble time. We find the change in multiplicity fractions over time for each\ndata set, identify the number of changes to the orbital configuration and the\ndominant underlying physical mechanism responsible for each configuration\nchange. Finally, we identify key properties of the binaries which survive the\nevolution.\n  We use the stellar evolution population synthesis code Multiple Stellar\nEvolution (MSE) to follow the evolution of $3 \\times 10^4$ of each 1+1\nbinaries, 2+1 triples, 3+1 quadruples and 2+2 quadruples. The coupled stellar\nand orbital evolution are computed each iteration. The systems are assumed to\nbe isolated and to have formed in situ. We generate data sets for two different\nblack hole natal kick mean velocity distributions (sigma = 10 km/s and sigma =\n50 km/s and with and without the inclusion of stellar fly-bys. Our fiducial\nmodel has a mean black hole natal kick velocity if sigma = 10 km/s and includes\nstellar fly-bys. Each system has at least one star with an initial mass larger\nthan 10 solar masses. All data will be publicly available.\n  We find that at the end of the evolution the large majority of systems are\nsingle stars in every data set (> 85%). As the number of objects in the initial\nsystem increases, so too does the final non-single system fraction. The single\nfractions of final systems in our fiducial model are 87.8 $\\pm$ 0.2 % for the 2\n+ 2s, 88.8 $\\pm$ 0.3 % for the 3 + 1s, 92.3 $\\pm$ 0.2 % for the 2 + 1s and 98.9\n$\\pm$ 0.3 % for the 1 + 1s.\n",
  "subjects": [
    "Astrophysics/Solar and Stellar Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Es7aux4vLSnjXuwYLQixXOiPBogYxc0wBttclc1ercI",
  "pdfSize": "2378197"
}