{
  "id": "2412.21171",
  "title": "Quantum Error Correction near the Coding Theoretical Bound",
  "authors": "Daiki Komoto and Kenta Kasai",
  "authorsParsed": [
    [
      "Komoto",
      "Daiki",
      ""
    ],
    [
      "Kasai",
      "Kenta",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 30 Dec 2024 18:48:54 GMT"
    },
    {
      "version": "v2",
      "created": "Thu, 23 Jan 2025 17:49:13 GMT"
    }
  ],
  "updateDate": "2025-01-24",
  "timestamp": 1735584534000,
  "abstract": "  Recent advancements in quantum computing have led to the realization of\nsystems comprising tens of reliable logical qubits, constructed from thousands\nof noisy physical qubits. However, many of the critical applications that\nquantum computers aim to solve require quantum computations involving millions\nor more logical qubits. This necessitates highly efficient quantum error\ncorrection capable of handling large numbers of logical qubits. Classical error\ncorrection theory is well-developed, with low-density parity-check (LDPC) codes\nachieving performance limits by encoding large classical bits. Despite more\nthan two decades of effort, no efficiently decodable quantum error-correcting\ncode that approaches the hashing bound, which is a fundamental lower bound on\nquantum capacity, had been discovered. Here, we present quantum\nerror-correcting codes constructed from classical LDPC codes that approach the\nhashing bound while maintaining linear computational complexity in the number\nof physical qubits. This result establishes a pathway toward realizing\nlarge-scale, fault-tolerant quantum computers. By integrating our quantum error\ncorrection scheme with devices capable of managing vast numbers of qubits, the\nprospect of solving critical real-world problems through quantum computation is\nbrought significantly closer.\n",
  "subjects": [
    "Physics/Quantum Physics",
    "Computer Science/Information Theory",
    "Mathematics/Information Theory"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "mAU0Stbey9khfBMPEMB2E3Is6V1NzbR8eICPkei3jvA",
  "pdfSize": "197613"
}