{"id":"2412.19592","title":"Single-molecule Surface-Induced Fluorescence Attenuation Based on\n  Reduced Graphene Oxide","authors":"Q. Fan, C. Yang, S. Hu, C. Xu, M. Li and Y. Lu","authorsParsed":[["Fan","Q.",""],["Yang","C.",""],["Hu","S.",""],["Xu","C.",""],["Li","M.",""],["Lu","Y.",""]],"versions":[{"version":"v1","created":"Fri, 27 Dec 2024 11:26:42 GMT"}],"updateDate":"2024-12-30","timestamp":1735298802000,"abstract":"  Single-molecule surface-induced fluorescence attenuation (smSIFA) is a\nprecise method for studying the vertical movement of biological macromolecules\nusing two-dimensional material acceptors. Unlike other methods, smSIFA is not\ninfluenced by the planar motion of membranes or proteins. However, the\ndetection range and accuracy of vertical movement are dependent on the\nproperties of these two-dimensional materials. Recently, smSIFA utilizing\ngraphene oxide and graphene has significantly advanced the study of\nbiomacromolecules, although the detection range is restricted by their inherent\nquenching distances. Modifying these distances necessitates the replacement of\nthe medium material, which presents challenges in material selection and\npreparation. Consequently, there is a pressing need to develop controllable\nmaterials for smSIFA applications. In this study, we enhance the smSIFA\ntechnique using graphene oxide as the medium acceptor through thermal\nreduction. By adjusting the reduction temperature, we prepare reduced graphene\noxides at varying degrees of reduction, thus fine-tuning the quenching\ndistances. The adjustment of these distances is measured using fluorescently\nlabeled DNA. This modified smSIFA approach, employing reduced graphene oxide,\nis then applied to observe conformational changes in the Holliday junction,\ndemonstrating the enhanced detection capabilities of reduced graphene oxide.\n","subjects":["Physics/Biological Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"3nyhVeXk3OJKlPH9Xvy5ezv2Uxq6-pI3lSaO9F8FsyY","pdfSize":"1035282"}