{"id":"2412.16222","title":"A matheuristic approach for an integrated lot-sizing and scheduling\n  problem with a period-based learning effect","authors":"Mohammad Rohaninejad, Behdin Vahedi-Nouri, Reza Tavakkoli-Moghaddam,\n  Zden\\v{e}k Hanz\\'alek","authorsParsed":[["Rohaninejad","Mohammad",""],["Vahedi-Nouri","Behdin",""],["Tavakkoli-Moghaddam","Reza",""],["Hanzálek","Zdeněk",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 12:54:50 GMT"},{"version":"v2","created":"Thu, 9 Jan 2025 10:27:10 GMT"}],"updateDate":"2025-01-10","timestamp":1734526490000,"abstract":"  This research investigates a multi-product capacitated lot-sizing and\nscheduling problem incorporating a novel learning effect, namely the\nperiod-based learning effect. This is inspired by a real case in a core\nanalysis laboratory under a job shop setting. Accordingly, a Mixed-Integer\nLinear Programming (MILP) model is extended based on the big-bucket\nformulation, optimizing the total tardiness and overtime costs. Given the\ncomplexity of the problem, a cutting plane method is employed to simplify the\nmodel. Afterward, three matheuristic methods based on the rolling horizon\napproach are devised, incorporating two lower bounds and a local search\nheuristic. Furthermore, a post-processing approach is implemented to\nincorporate lot-streaming possibility. Computational experiments demonstrate:\n1) the simplified model performs effectively in terms of both solution quality\nand computational time; and 2) although the model encounters challenges with\nlarge-scale instances, the proposed matheuristic methods achieve satisfactory\noutcomes; and 3) it can be inferred that the complexity of the models and\nsolution methods are independent of the learning effect; however, the value of\nlearning effect may impact the performance of the lower bounds; 4) in\nmanufacturing settings, where the lot-streaming is possible, incorporating\npost-processing can drastically improve the objective function; 5) the impact\nof the period-based learning effect in the results is significant, and the\nmodel's sensitivity to time-based parameters (e.g., learning rate) is more than\ncost-based ones (e.g., tardiness cost).\n","subjects":["Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"u5bUDueVaQA0dreBXz742gzyo7xt2tW9CfS81GhX7JI","pdfSize":"934180"}