{
  "id": "2412.05005",
  "title": "Eta-Earth Revisited I: A Formula for Estimating the Maximum Number of\n  Earth-like Habitats",
  "authors": "Helmut Lammer, Manuel Scherf, Laurenz Spro{\\ss}",
  "authorsParsed": [
    [
      "Lammer",
      "Helmut",
      ""
    ],
    [
      "Scherf",
      "Manuel",
      ""
    ],
    [
      "Sproß",
      "Laurenz",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 12:59:09 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733489949000,
  "abstract": "  In this hypothesis article, we discuss the basic requirements of planetary\nenvironments where aerobe organisms can grow and survive, including atmospheric\nlimitations of millimeter-to-meter-sized biological animal life based on\nphysical limits, and O$_2$, N$_2$, and CO$_2$ toxicity levels. By assuming that\nanimal-like extraterrestrial organisms adhere to similar limits, we define\nEarth-like Habitats ($\\eta_{\\rm EH}$) as rocky exoplanets in the Habitable Zone\nof Complex Life that host N$_2$-O$_2$-dominated atmospheres with minor amounts\nof CO$_2$, at which advanced animal-like life can in principle evolve and\nexist. We then derive a new formula that can be used to estimate the maximum\noccurrence rate of such Earth-like Habitats in the Galaxy. This contains\nrealistic probabilistic arguments that can be fine-tuned and constrained by\natmospheric characterization with future space and ground-based telescopes. As\nan example, we briefly discuss two specific requirements feeding into our new\nformula that, although not quantifiable at present, will become scientifically\nquantifiable in the upcoming decades due to future observations of exoplanets\nand their atmospheres.\n",
  "subjects": [
    "Astrophysics/Earth and Planetary Astrophysics",
    "Astrophysics/Solar and Stellar Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "7jCxV-Mwaj4wqduhpg8Hk1gLJ8e47HpBnZN_DDTwy1A",
  "pdfSize": "1401368"
}