{"id":"2412.09026","title":"Video Anomaly Detection with Motion and Appearance Guided Patch\n  Diffusion Model","authors":"Hang Zhou, Jiale Cai, Yuteng Ye, Yonghui Feng, Chenxing Gao, Junqing\n  Yu, Zikai Song and Wei Yang","authorsParsed":[["Zhou","Hang",""],["Cai","Jiale",""],["Ye","Yuteng",""],["Feng","Yonghui",""],["Gao","Chenxing",""],["Yu","Junqing",""],["Song","Zikai",""],["Yang","Wei",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 07:42:50 GMT"}],"updateDate":"2024-12-13","timestamp":1733989370000,"abstract":"  A recent endeavor in one class of video anomaly detection is to leverage\ndiffusion models and posit the task as a generation problem, where the\ndiffusion model is trained to recover normal patterns exclusively, thus\nreporting abnormal patterns as outliers. Yet, existing attempts neglect the\nvarious formations of anomaly and predict normal samples at the feature level\nregardless that abnormal objects in surveillance videos are often relatively\nsmall. To address this, a novel patch-based diffusion model is proposed,\nspecifically engineered to capture fine-grained local information. We further\nobserve that anomalies in videos manifest themselves as deviations in both\nappearance and motion. Therefore, we argue that a comprehensive solution must\nconsider both of these aspects simultaneously to achieve accurate frame\nprediction. To address this, we introduce innovative motion and appearance\nconditions that are seamlessly integrated into our patch diffusion model. These\nconditions are designed to guide the model in generating coherent and\ncontextually appropriate predictions for both semantic content and motion\nrelations. Experimental results in four challenging video anomaly detection\ndatasets empirically substantiate the efficacy of our proposed approach,\ndemonstrating that it consistently outperforms most existing methods in\ndetecting abnormal behaviors.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"dZqSHp0RSVrIuodFONaqLjExUnXAgN_QOQzpOn-3-lM","pdfSize":"2055680"}