{"id":"2412.09531","title":"A universal and physically motivated threshold for Hessian-based cosmic\n  web identification: V-Web case","authors":"Edward Olex, Wojciech A. Hellwing, Alexander Knebe","authorsParsed":[["Olex","Edward",""],["Hellwing","Wojciech A.",""],["Knebe","Alexander",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 18:21:21 GMT"}],"updateDate":"2024-12-13","timestamp":1734027681000,"abstract":"  The study of large-scale structure can benefit from accurate and robust\nidentification of the cosmic web. Having such classification can facilitate a\nmore complete extraction of cosmological information encoded therein.\nClassification methods like T-web and V-web, based on the Hessian matrix, are\nwidely used to signal-out voids, sheets, filaments, and knots. However, these\ntechniques depend on a threshold parameter which value is chosen without\nphysical justification, usually relying on a user visual impression, thus\nlimiting the universality of results. In this paper we focus on the V-web\nmethod. Our aim is to find a physical motivation for deriving an universal\nthreshold that can be applied across different cosmic scales and epochs. V-web\nclassify the large-scale structure using the eigenvalues of the velocity shear\ntensor. Using a set of gravity-only simulations we introduce a normalization\nthat incorporates the standard deviation of the velocity divergence field,\nisolating the beyond Gaussian evolution of cosmic web elements. In the\nZeldovich's approximation, the probability presence of each cosmic web element\nremains constant at a threshold equal to 0. For the first time, we reveal that\nthis behavior also holds in the non-linear regime for a normalized positive\n'constant volume threshold' that depends on both the redshift and the applied\nsmoothing scale. The conservation of volume fractions is valid for the studied\nredshifts between 0 and 2, regardless of cosmic variance, and is most precise\nfor intermediate smoothing scales around 3 Mpc/h. The properties of the cosmic\nweb derived using this approach in the V-web align with expectations from other\nmethods, including visual impressions. We provide a general fit formula to\ncompute the constant volume threshold for any standard cosmological simulation,\nregardless of its specific properties.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"X0QsFdMlg72ev59lVocRNruwokxQ2Uh2mCBlmheSKNc","pdfSize":"904307"}