{"id":"2412.03431","title":"SpyDust: an improved and extended implementation for modeling spinning\n  dust radiation","authors":"Zheng Zhang and Jens Chluba","authorsParsed":[["Zhang","Zheng",""],["Chluba","Jens",""]],"versions":[{"version":"v1","created":"Wed, 4 Dec 2024 16:21:47 GMT"},{"version":"v2","created":"Sun, 9 Feb 2025 09:43:20 GMT"}],"updateDate":"2025-02-11","timestamp":1733329307000,"abstract":"  This paper presents 'SpyDust', an improved and extended implementation of the\nspinning dust emission model based on a Fokker-Planck treatment. 'SpyDust'\nserves not only as a Python successor to 'spdust', but also incorporates some\ncorrections and extensions. Unlike 'spdust', which is focused on specific grain\nshapes, 'SpyDust' considers a wider range of grain shapes and provides the\ncorresponding grain dynamics, directional radiation field and angular momentum\ntransports. We recognise the unique effects of different grain shapes on\nemission, in particular the shape-dependent mapping between rotational\nfrequency and spectral frequency.\n  In addition, we update the expressions for effects of electrical dipole\nradiation back-reaction and plasma drag on angular momentum dissipation. We\nalso discuss the degeneracies in describing the shape of the spectral energy\ndistribution (SED) of spinning dust grains with the interstellar environmental\nparameters. Using a typical Cold Neutral Medium (CNM) environment as an\nexample, we perform a perturbative analysis of the model parameters, revealing\nstrong positive or negative correlations between them. A principal component\nanalysis (PCA) shows that four dominant modes can linearly capture most of the\nSED variations, highlighting the degeneracy in the parameter space of the SED\nshape in the vicinity of the chosen CNM environment. This opens the possibility\nfor future applications of moment expansion methods to reduce the\ndimensionality of the encountered SED parameter space.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"6pPUd_XOvhOKoRbUY_B0YlDyDlqKFaAeFCJwPC_P7xI","pdfSize":"1726668"}