{
  "id": "2412.01684",
  "title": "Condensation dynamics in a two-dimensional photonic crystal waveguide",
  "authors": "Maria Efthymiou-Tsironi, Antonio Gianfrate, Dimitrios Trypogeorgos,\n  Charly Leblanc, Fabrizio Riminucci, Grazia Salerno, Milena De Giorgi, Dario\n  Ballarini, Daniele Sanvitto",
  "authorsParsed": [
    [
      "Efthymiou-Tsironi",
      "Maria",
      ""
    ],
    [
      "Gianfrate",
      "Antonio",
      ""
    ],
    [
      "Trypogeorgos",
      "Dimitrios",
      ""
    ],
    [
      "Leblanc",
      "Charly",
      ""
    ],
    [
      "Riminucci",
      "Fabrizio",
      ""
    ],
    [
      "Salerno",
      "Grazia",
      ""
    ],
    [
      "De Giorgi",
      "Milena",
      ""
    ],
    [
      "Ballarini",
      "Dario",
      ""
    ],
    [
      "Sanvitto",
      "Daniele",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 16:30:02 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733157002000,
  "abstract": "  Exciton-polariton condensation occurs at the extrema of the underlying\ndispersion where the density of states diverges and carriers can naturally\naccumulate. The existence of multiple such points leads to coupling and\ncompetition between the associated modes and dynamical redistribution of the\ncarriers in the dispersion. Here, we directly engineer the above situation via\nsubwavelength periodic patterning of a two-dimensional nanostructure. This\nleads to multimode condensation into a pair of symmetric condensates that form\nat high-momenta, accidental-coupling points, and a high-symmetry $\\Gamma$-point\nwith a bound-in-the-continuum (BiC) state. The dynamical behaviour of the\nsystem reveals the non-simultaneous appearance of these condensates and the\ninterplay of non-trivial gain and relaxation mechanisms. We fully characterise\nthe quasi-static and dynamical regime of this artificial crystal and the\nproperties of the different condensates. This understanding is necessary when\nband-structure engineering techniques are used to achieve precise control of\ncondensate formation with given energy and momentum.\n",
  "subjects": [
    "Physics/Optics",
    "Condensed Matter/Quantum Gases"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Hi2s-9n7v4ewCNV_PB6lJDiM0VoeaAZzmD8Z2VuFdos",
  "pdfSize": "5090071"
}