{
  "id": "2412.06170",
  "title": "A mathematical model for smooth muscle cell phenotype switching in\n  atherosclerotic plaque",
  "authors": "Joseph P. Ndenda, Michael G. Watson, Ashish Misra, Mary R. Myerscough",
  "authorsParsed": [
    [
      "Ndenda",
      "Joseph P.",
      ""
    ],
    [
      "Watson",
      "Michael G.",
      ""
    ],
    [
      "Misra",
      "Ashish",
      ""
    ],
    [
      "Myerscough",
      "Mary R.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 03:04:59 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733713499000,
  "abstract": "  Smooth muscle cells (SMCs) play a fundamental role in the development of\natherosclerotic plaques. SMCs may ingest lipids in a similar way to\nmonocyte-derived macrophages (MDMs) in the plaque. This can stimulate SMCs to\nundergo a phenotypic switch towards a macrophage-like phenotype. We formulate\nan ordinary differential equation (ODE) model for the populations of SMCs, MDMs\nand smooth muscle cell-derived macrophages (SDMs) and the internalised lipid\nload in each population. We use this model to explore the effect on plaque fate\nof SMC phenotype switching. We find that when SMCs switch to a macrophage-like\nphenotype, the total lipid contained in cells in the plaque increases.\nAdditionally, removal of SMCs from the plaque via phenotype switching reduces\nthe fibrous plaque cap, increases the lipid in the necrotic core, and increases\nplaque inflammation. This makes the plaque more vulnerable to rupture, which\ncan lead to heart attacks and strokes. When SDMs are highly proliferative and\nresistant to cell death, the plaque grows rapidly and becomes highly\npathological. The model suggests that plaque dynamics, driven by the switch of\nSMCs to a macrophage-like phenotype, may drive the development of unstable,\nvulnerable and pathological plaques.\n",
  "subjects": [
    "Quantitative Biology/Cell Behavior"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "vwpdKhcTH1lo5lY7SN6ZyfZL13_vNxRsc4eSfooIgkU",
  "pdfSize": "2461627"
}