{
  "id": "2412.19254",
  "title": "Leveraging Self-Training and Variational Autoencoder for Agitation\n  Detection in People with Dementia Using Wearable Sensors",
  "authors": "Abeer Badawi, Somayya Elmoghazy, Samira Choudhury, Khalid Elgazzar,\n  and Amer Burhan",
  "authorsParsed": [
    [
      "Badawi",
      "Abeer",
      ""
    ],
    [
      "Elmoghazy",
      "Somayya",
      ""
    ],
    [
      "Choudhury",
      "Samira",
      ""
    ],
    [
      "Elgazzar",
      "Khalid",
      ""
    ],
    [
      "Burhan",
      "Amer",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 26 Dec 2024 15:34:25 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735227265000,
  "abstract": "  Dementia is a neurodegenerative disorder that has been growing among elder\npeople over the past decades. This growth profoundly impacts the quality of\nlife for patients and caregivers due to the symptoms arising from it. Agitation\nand aggression (AA) are some of the symptoms of people with severe dementia\n(PwD) in long-term care or hospitals. AA not only causes discomfort but also\nputs the patients or others at potential risk. Existing monitoring solutions\nutilizing different wearable sensors integrated with Artificial Intelligence\n(AI) offer a way to detect AA early enough for timely and adequate medical\nintervention. However, most studies are limited by the availability of\naccurately labeled datasets, which significantly affects the efficacy of such\nsolutions in real-world scenarios. This study presents a novel comprehensive\napproach to detect AA in PwD using physiological data from the Empatica E4\nwristbands. The research creates a diverse dataset, consisting of three\ndistinct datasets gathered from 14 participants across multiple hospitals in\nCanada. These datasets have not been extensively explored due to their limited\nlabeling. We propose a novel approach employing self-training and a variational\nautoencoder (VAE) to detect AA in PwD effectively. The proposed approach aims\nto learn the representation of the features extracted using the VAE and then\nuses a semi-supervised block to generate labels, classify events, and detect\nAA. We demonstrate that combining Self-Training and Variational Autoencoder\nmechanism significantly improves model performance in classifying AA in PwD.\nAmong the tested techniques, the XGBoost classifier achieved the highest\naccuracy of 90.16\\%. By effectively addressing the challenge of limited labeled\ndata, the proposed system not only learns new labels but also proves its\nsuperiority in detecting AA.\n",
  "subjects": [
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/publicdomain/zero/1.0/",
  "blobId": "BwfVlDK0j_1FNqeeXqi_sZ-snkCm8aCsJwx8sGsQ8u0",
  "pdfSize": "644934"
}