{
  "id": "2412.00315",
  "title": "One Model for One Graph: A New Perspective for Pretraining with\n  Cross-domain Graphs",
  "authors": "Jingzhe Liu, Haitao Mao, Zhikai Chen, Wenqi Fan, Mingxuan Ju, Tong\n  Zhao, Neil Shah, Jiliang Tang",
  "authorsParsed": [
    [
      "Liu",
      "Jingzhe",
      ""
    ],
    [
      "Mao",
      "Haitao",
      ""
    ],
    [
      "Chen",
      "Zhikai",
      ""
    ],
    [
      "Fan",
      "Wenqi",
      ""
    ],
    [
      "Ju",
      "Mingxuan",
      ""
    ],
    [
      "Zhao",
      "Tong",
      ""
    ],
    [
      "Shah",
      "Neil",
      ""
    ],
    [
      "Tang",
      "Jiliang",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 30 Nov 2024 01:49:45 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1732931385000,
  "abstract": "  Graph Neural Networks (GNNs) have emerged as a powerful tool to capture\nintricate network patterns, achieving success across different domains.\nHowever, existing GNNs require careful domain-specific architecture designs and\ntraining from scratch on each dataset, leading to an expertise-intensive\nprocess with difficulty in generalizing across graphs from different domains.\nTherefore, it can be hard for practitioners to infer which GNN model can\ngeneralize well to graphs from their domains. To address this challenge, we\npropose a novel cross-domain pretraining framework, \"one model for one graph,\"\nwhich overcomes the limitations of previous approaches that failed to use a\nsingle GNN to capture diverse graph patterns across domains with significant\ngaps. Specifically, we pretrain a bank of expert models, with each one\ncorresponding to a specific dataset. When inferring to a new graph, gating\nfunctions choose a subset of experts to effectively integrate prior model\nknowledge while avoiding negative transfer. Extensive experiments consistently\ndemonstrate the superiority of our proposed method on both link prediction and\nnode classification tasks.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Artificial Intelligence",
    "Statistics/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "CRRKuKPb4bBz3qH-HIhcUIOBeKjLqi3QKNmgaA4UpPY",
  "pdfSize": "728638"
}