{
  "id": "2412.17372",
  "title": "Outage Probability Analysis of Uplink Heterogeneous Non-terrestrial\n  Networks: A Novel Stochastic Geometry Model",
  "authors": "Wen-Yu Dong, Shaoshi Yang, Wei Lin, Wei Zhao, Jia-Xing Gui and Sheng\n  Chen",
  "authorsParsed": [
    [
      "Dong",
      "Wen-Yu",
      ""
    ],
    [
      "Yang",
      "Shaoshi",
      ""
    ],
    [
      "Lin",
      "Wei",
      ""
    ],
    [
      "Zhao",
      "Wei",
      ""
    ],
    [
      "Gui",
      "Jia-Xing",
      ""
    ],
    [
      "Chen",
      "Sheng",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 08:13:18 GMT"
    }
  ],
  "updateDate": "2025-01-03",
  "timestamp": 1734941598000,
  "abstract": "  In harsh environments such as mountainous terrain, dense vegetation areas, or\nurban landscapes, a single type of unmanned aerial vehicles (UAVs) may\nencounter challenges like flight restrictions, difficulty in task execution, or\nincreased risk. Therefore, employing multiple types of UAVs, along with\nsatellite assistance, to collaborate becomes essential in such scenarios. In\nthis context, we present a stochastic geometry based approach for modeling the\nheterogeneous non-terrestrial networks (NTNs) by using the classical binomial\npoint process and introducing a novel point process, called Mat{\\'e}rn\nhard-core cluster process (MHCCP). Our MHCCP possesses both the exclusivity and\nthe clustering properties, thus it can better model the aircraft group composed\nof multiple clusters. Then, we derive closed-form expressions of the outage\nprobability (OP) for the uplink (aerial-to-satellite) of heterogeneous NTNs.\nUnlike existing studies, our analysis relies on a more advanced system\nconfiguration, where the integration of beamforming and frequency division\nmultiple access, and the shadowed-Rician (SR) fading model for interference\npower, are considered. The accuracy of our theoretical derivation is confirmed\nby Monte Carlo simulations. Our research offers fundamental insights into the\nsystem-level performance optimization of NTNs.\n",
  "subjects": [
    "Computer Science/Networking and Internet Architecture"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "OUSFCaIRsf4h_SWbeDRxGsD8zBsjLXLftIVGrGKV9lk",
  "pdfSize": "510837"
}