{"id":"2412.12488","title":"A System for Microserving of LLMs","authors":"Hongyi Jin, Ruihang Lai, Charlie F. Ruan, Yingcheng Wang, Todd C.\n  Mowry, Xupeng Miao, Zhihao Jia, Tianqi Chen","authorsParsed":[["Jin","Hongyi",""],["Lai","Ruihang",""],["Ruan","Charlie F.",""],["Wang","Yingcheng",""],["Mowry","Todd C.",""],["Miao","Xupeng",""],["Jia","Zhihao",""],["Chen","Tianqi",""]],"versions":[{"version":"v1","created":"Tue, 17 Dec 2024 02:44:43 GMT"}],"updateDate":"2024-12-18","timestamp":1734403483000,"abstract":"  The recent advances in LLMs bring a strong demand for efficient system\nsupport to improve overall serving efficiency. As LLM inference scales towards\nmultiple GPUs and even multiple compute nodes, various coordination patterns,\nsuch as prefill-decode disaggregation and context migration, arise in serving\nsystems. Most inference services today expose a coarse-grained request-level\nAPI with a pre-configured coordination strategy, limiting the ability to\ncustomize and dynamically reconfigure the coordination. In this paper, we\npropose LLM microserving, a multi-level architecture for structuring and\nprogramming LLM inference services. We introduces simple yet effective\nmicroserving APIs to support fine-grained sub-request level actions. A\nprogrammable router transforms user requests into sub-request calls, enabling\nthe dynamic reconfiguration of serving patterns. To support diverse execution\npatterns, we develop a unified KV cache interface that handles various KV\ncompute, transfer, and reuse scenarios. Our evaluation shows that LLM\nmicroserving can be reconfigured to support multiple disaggregation\norchestration strategies in a few lines of Python code while maintaining\nstate-of-the-art performance for LLM inference tasks. Additionally, it allows\nus to explore new strategy variants that reduce up to 47% of job completion\ntime compared to the existing strategies.\n","subjects":["Computer Science/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"sbCoNL8DXfa2fXlliyA7d4UdruyoykQTO2UVanSedPY","pdfSize":"1019102"}