{
  "id": "2412.15862",
  "title": "MarkovType: A Markov Decision Process Strategy for Non-Invasive\n  Brain-Computer Interfaces Typing Systems",
  "authors": "Elifnur Sunger, Yunus Bicer, Deniz Erdogmus, Tales Imbiriba",
  "authorsParsed": [
    [
      "Sunger",
      "Elifnur",
      ""
    ],
    [
      "Bicer",
      "Yunus",
      ""
    ],
    [
      "Erdogmus",
      "Deniz",
      ""
    ],
    [
      "Imbiriba",
      "Tales",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 12:59:41 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734699581000,
  "abstract": "  Brain-Computer Interfaces (BCIs) help people with severe speech and motor\ndisabilities communicate and interact with their environment using neural\nactivity. This work focuses on the Rapid Serial Visual Presentation (RSVP)\nparadigm of BCIs using noninvasive electroencephalography (EEG). The RSVP\ntyping task is a recursive task with multiple sequences, where users see only a\nsubset of symbols in each sequence. Extensive research has been conducted to\nimprove classification in the RSVP typing task, achieving fast classification.\nHowever, these methods struggle to achieve high accuracy and do not consider\nthe typing mechanism in the learning procedure. They apply binary target and\nnon-target classification without including recursive training. To improve\nperformance in the classification of symbols while controlling the\nclassification speed, we incorporate the typing setup into training by\nproposing a Partially Observable Markov Decision Process (POMDP) approach. To\nthe best of our knowledge, this is the first work to formulate the RSVP typing\ntask as a POMDP for recursive classification. Experiments show that the\nproposed approach, MarkovType, results in a more accurate typing system\ncompared to competitors. Additionally, our experiments demonstrate that while\nthere is a trade-off between accuracy and speed, MarkovType achieves the\noptimal balance between these factors compared to other methods.\n",
  "subjects": [
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "ORPIm5seI01tbgLp58f6oLoWYAc7FTNJPOhjglr7cJs",
  "pdfSize": "466194"
}