{"id":"2412.13220","title":"Relativistic particles in super-periodic potentials: exploring graphene\n  and fractal systems","authors":"Sudhanshu Shekhar, Bhabani Prasad Mandal and Anirban Dutta","authorsParsed":[["Shekhar","Sudhanshu",""],["Mandal","Bhabani Prasad",""],["Dutta","Anirban",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 06:42:43 GMT"}],"updateDate":"2024-12-19","timestamp":1734331363000,"abstract":"  In this article, we employ the transfer matrix method to investigate\nrelativistic particles in super-periodic potentials (SPPs) of arbitrary order\n$n \\in I^{+}$. We calculate the reflection and transmission probabilities for\nspinless Klein particles encountering rectangular potential barriers with\nsuper-periodic repetition. It is found that spinless relativistic particles\nexhibit Klein tunneling and a significantly higher degree of reflection\ncompared to their non-relativistic counterparts. Additionally, we analytically\nexplore the behavior of experimentally realizable massless Dirac electrons as\nthey encounter rectangular potential barriers with a super-periodic pattern in\na monolayer of graphene. In this system, the transmission probability,\nconductance, and Fano factor are evaluated as functions of the number of\nbarriers, the order of super-periodicity, and the angle of incidence. Our\nfindings reveal that the transmission probability shows a series of resonances\nthat depend on the number of barriers and the order of super-periodicity. We\nextend our analysis to specific cases within the Unified Cantor Potentials\n(UCPs)-$\\gamma$ system ($\\gamma$ is a scaling parameter greater than $1$),\nfocusing on the General Cantor fractal system and the General\nSmith-Volterra-Cantor (GSVC) system. For the General Cantor fractal system, we\ncalculate the tunneling probability, which reveals sharp transmission peaks and\nprogressively thinner unit cell potentials as $G$ increases. In the GSVC\nsystem, we analyze the potential segment length and tunneling probability,\nobserving nearly unity tunneling coefficients when $\\gamma \\approx 1$, as well\nas saturation behavior in transmission coefficients at higher stages $G$.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"R4RRIfPMU5DKSrfensPOCM9UTb009B3QKWt4026whQw","pdfSize":"12288541"}