{
  "id": "2412.03739",
  "title": "A Global Perspective with Updated Constraints on the Ultra-hot Jupiter\n  WASP-19b: Atmospheric Properties and Stellar Activity",
  "authors": "Abigail A. Tumborang, Jessica J. Spake, Heather A. Knutson, Megan\n  Weiner Mansfield, Kimberly Paragas, Billy Edwards, Tiffany Kataria, Thomas M.\n  Evans-Soma, Nikole K. Lewis, and Gilda E. Ballester",
  "authorsParsed": [
    [
      "Tumborang",
      "Abigail A.",
      ""
    ],
    [
      "Spake",
      "Jessica J.",
      ""
    ],
    [
      "Knutson",
      "Heather A.",
      ""
    ],
    [
      "Mansfield",
      "Megan Weiner",
      ""
    ],
    [
      "Paragas",
      "Kimberly",
      ""
    ],
    [
      "Edwards",
      "Billy",
      ""
    ],
    [
      "Kataria",
      "Tiffany",
      ""
    ],
    [
      "Evans-Soma",
      "Thomas M.",
      ""
    ],
    [
      "Lewis",
      "Nikole K.",
      ""
    ],
    [
      "Ballester",
      "Gilda E.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 22:07:08 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733350028000,
  "abstract": "  We present a detailed reanalysis of the atmospheric properties of WASP-19b,\nan ultra-hot Jupiter (1.14 M Jup, 1.41 R Jup) orbiting an active Sun-like star\nevery 0.79 day. We reanalyze a transit and secondary eclipse of WASP-19b\nobserved by the Hubble Space Telescope's Wide Field Camera 3 spectrograph (1.1\n- 1.7 microns). When combined with Spitzer photometry at longer wavelengths,\nour analyses indicate the presence of water absorption features in both the\nplanet's transmission and emission spectra, consistent with results from\npreviously published studies. We jointly fit WASP-19b's dayside emission and\ntransmission spectra with a retrieval model in order to constrain its\natmospheric composition, and explore the effect of stellar activity on its\ntransmission spectrum in greater depth. We also compare our dayside emission\nspectrum to predictions from a general circulation model, and conclude that\nmagnetic drag appears to be relatively unimportant in shaping WASP-19b's\natmospheric circulation. Lastly, we compare the size of WASP-19b's dayside\nwater absorption feature to the population of hot Jupiters with similar\nmeasurements, and show that it is located in the transitional irradiation\nregime where temperature inversions first begin to emerge. As in previous\nstudies, we find that the current observations provide relatively weak\nconstraints on this planet's atmospheric properties. These constraints could be\nsignificantly improved by the addition of spectroscopically resolved\nobservations at longer wavelengths with JWST/NIRSpec PRISM.\n",
  "subjects": [
    "Astrophysics/Earth and Planetary Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "aaA5zsjR3i0qG0QUiT6a2GF_0N1ImgdRSo3aPt_DaLg",
  "pdfSize": "2265184"
}