{"id":"2412.05812","title":"Singular Spectrum Analysis of Fermi-LAT Blazar Light Curves: A\n  Systematic Search for Periodicity and Trends in the Time Domain","authors":"Alba Rico (UC Madrid & IPARCOS, Clemson), A. Dom\\'inguez (UC Madrid &\n  IPARCOS), P. Pe\\~nil (Clemson), M. Ajello, S. Buson, S. Adhikari, and M.\n  Movahedifar","authorsParsed":[["Rico","Alba","","UC Madrid & IPARCOS, Clemson"],["Domínguez","A.","","UC Madrid &\n  IPARCOS"],["Peñil","P.","","Clemson"],["Ajello","M.",""],["Buson","S.",""],["Adhikari","S.",""],["Movahedifar","M.",""]],"versions":[{"version":"v1","created":"Sun, 8 Dec 2024 04:49:02 GMT"}],"updateDate":"2024-12-10","timestamp":1733633342000,"abstract":"  A majority of blazars exhibit variable emission across the entire\nelectromagnetic spectrum, observed over various time scales. In particular,\ndiscernible periodic patterns are detected in the {\\gamma}-ray light curves of\na few blazars, such as PG 1553+113, S5 1044+71, and PKS 0426-380. The presence\nof trends, flares, and noise complicates the detection of periodicity,\nrequiring careful analysis to determine whether these patterns are related to\nemission mechanisms within the source or occur by chance. We employ Singular\nSpectrum Analysis (SSA) for the first time on data from the Large Area\nTelescope (LAT) aboard the Fermi Gamma-ray Space Telescope to systematically\nsearch for periodicity in the time domain, using 28-day binned light curves.\nOur aim is to isolate any potential periodic nature of the emission from trends\nand noise, thereby reducing uncertainties in revealing periodicity.\nAdditionally, we aim to characterize long-term trends and develop a forecasting\nalgorithm based on SSA, enabling accurate predictions of future emission\nbehavior. We apply SSA to analyze 494 sources detected by Fermi-LAT, focusing\non identifying and isolating periodic components from trends and noise in their\n{\\gamma}-ray light curves. We calculate the Lomb-Scargle Periodogram for the\nperiodic components extracted by SSA to determine the most significant periods.\nThe local and global significance of these periods is then assessed to validate\ntheir authenticity. Our analysis identifies 46 blazars as potential candidates\nfor quasi-periodic {\\gamma}-ray emissions, each with a local significance level\n>= 2{\\sigma}. Notably, 33 of these candidates exhibit a local significance of\n>= 4{\\sigma} (corresponding to a global significance of >= 2.2{\\sigma}). Our\nfindings introduce 25 new {\\gamma}-ray candidates, effectively doubling the\nnumber of potentially periodic sources.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"5v4--fxvjhJ4eRAAn_n5IlkPgR-NRpBfvSpV_bkBUH8","pdfSize":"3326027"}