{"id":"2412.00034","title":"Data-Driven Prescriptive Analytics Applications: A Comprehensive Survey","authors":"Martin Moesmann and Torben Bach Pedersen","authorsParsed":[["Moesmann","Martin",""],["Pedersen","Torben Bach",""]],"versions":[{"version":"v1","created":"Thu, 21 Nov 2024 12:56:58 GMT"}],"updateDate":"2024-12-03","timestamp":1732193818000,"abstract":"  Prescriptive Analytics (PSA), an emerging business analytics field suggesting\nconcrete options for solving business problems, has seen an increasing amount\nof interest after more than a decade of multidisciplinary research. This paper\nis a comprehensive survey of existing applications within PSA in terms of their\nuse cases, methodologies, and possible future research directions. To ensure a\nmanageable scope, we focus on PSA applications that develop data-driven,\nautomatic workflows, i.e. Data-Driven PSA (DPSA). Following a systematic\nmethodology, we identify and include 104 papers in our survey. As our key\ncontributions, we derive a number of novel conceptual models: In terms of use\ncases, we derive 10 application domains for DPSA, from Healthcare to\nManufacturing, and subsumed problem types within each. In terms of individual\nmethod usage, we derive 5 method types and map them to a comprehensive taxonomy\nof method usage within DPSA applications, covering mathematical optimization,\ndata mining and machine learning, probabilistic modelling, domain expertise, as\nwell as simulations. As for combined method usage, we provide a statistical\noverview of how different method usage combinations are distributed and derive\n2 generic workflow patterns along with subsumed workflow patterns, combining\nmethods by either sequential or simultaneous relationships. Finally, we derive\n4 possible research directions based on frequently recurring issues among\nsurveyed papers, suggesting new frontiers in terms of methods, tools, and use\ncases.\n","subjects":["Computer Science/Databases"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"VbMI2cY2zOd-0nhbA1WvsIEb7lNHoyiM24UQCdUyuUM","pdfSize":"8045090"}