{
  "id": "2412.16724",
  "title": "Coupling Neural Networks and Physics Equations For Li-Ion Battery\n  State-of-Charge Prediction",
  "authors": "Giovanni Pollo, Alessio Burrello, Enrico Macii, Massimo Poncino, Sara\n  Vinco, Daniele Jahier Pagliari",
  "authorsParsed": [
    [
      "Pollo",
      "Giovanni",
      ""
    ],
    [
      "Burrello",
      "Alessio",
      ""
    ],
    [
      "Macii",
      "Enrico",
      ""
    ],
    [
      "Poncino",
      "Massimo",
      ""
    ],
    [
      "Vinco",
      "Sara",
      ""
    ],
    [
      "Pagliari",
      "Daniele Jahier",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 21 Dec 2024 18:19:12 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734805152000,
  "abstract": "  Estimating the evolution of the battery's State of Charge (SoC) in response\nto its usage is critical for implementing effective power management policies\nand for ultimately improving the system's lifetime. Most existing estimation\nmethods are either physics-based digital twins of the battery or data-driven\nmodels such as Neural Networks (NNs). In this work, we propose two new\ncontributions in this domain. First, we introduce a novel NN architecture\nformed by two cascaded branches: one to predict the current SoC based on sensor\nreadings, and one to estimate the SoC at a future time as a function of the\nload behavior. Second, we integrate battery dynamics equations into the\ntraining of our NN, merging the physics-based and data-driven approaches, to\nimprove the models' generalization over variable prediction horizons. We\nvalidate our approach on two publicly accessible datasets, showing that our\nPhysics-Informed Neural Networks (PINNs) outperform purely data-driven ones\nwhile also obtaining superior prediction accuracy with a smaller architecture\nwith respect to the state-of-the-art.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "vajkIB_wBSA6fAu4H7qw7DKhwddYoFTvbfEzvhC-_AU",
  "pdfSize": "551455"
}