{"id":"2412.17373","title":"FRTP: Federating Route Search Records to Enhance Long-term Traffic\n  Prediction","authors":"Hangli Ge, Xiaojie Yang, Itsuki Matsunaga, Dizhi Huang, Noboru\n  Koshizuka","authorsParsed":[["Ge","Hangli",""],["Yang","Xiaojie",""],["Matsunaga","Itsuki",""],["Huang","Dizhi",""],["Koshizuka","Noboru",""]],"versions":[{"version":"v1","created":"Mon, 23 Dec 2024 08:14:20 GMT"}],"updateDate":"2024-12-24","timestamp":1734941660000,"abstract":"  Accurate traffic prediction, especially predicting traffic conditions several\ndays in advance is essential for intelligent transportation systems (ITS). Such\npredictions enable mid- and long-term traffic optimization, which is crucial\nfor efficient transportation planning. However, the inclusion of diverse\nexternal features, alongside the complexities of spatial relationships and\ntemporal uncertainties, significantly increases the complexity of forecasting\nmodels. Additionally, traditional approaches have handled data preprocessing\nseparately from the learning model, leading to inefficiencies caused by\nrepeated trials of preprocessing and training. In this study, we propose a\nfederated architecture capable of learning directly from raw data with varying\nfeatures and time granularities or lengths. The model adopts a unified design\nthat accommodates different feature types, time scales, and temporal periods.\nOur experiments focus on federating route search records and begin by\nprocessing raw data within the model framework. Unlike traditional models, this\napproach integrates the data federation phase into the learning process,\nenabling compatibility with various time frequencies and input/output\nconfigurations. The accuracy of the proposed model is demonstrated through\nevaluations using diverse learning patterns and parameter settings. The results\nshow that online search log data is useful for forecasting long-term traffic,\nhighlighting the model's adaptability and efficiency.\n","subjects":["Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"xbEqzoR8EaoAERZRNp9jUdQp3H948_UdgyQeHTDzqUE","pdfSize":"815475"}