{"id":"2412.15776","title":"On the optimal growth of autocatalytic subnetworks: A Mathematical\n  Optimization Approach","authors":"V\\'ictor Blanco and Gabriel Gonz\\'alez and Praful Gagrani","authorsParsed":[["Blanco","Víctor",""],["González","Gabriel",""],["Gagrani","Praful",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 10:45:57 GMT"}],"updateDate":"2024-12-23","timestamp":1734691557000,"abstract":"  Chemical reaction networks (CRNs) are essential for modeling and analyzing\ncomplex systems across fields, from biochemistry to economics. Autocatalytic\nreaction network -- networks where certain species catalyze their own\nproduction -- are particularly significant for understanding self-replication\ndynamics in biological systems and serve as foundational elements in\nformalizing the concept of a circular economy. In a previous study, we\ndeveloped a mixed-integer linear optimization-based procedure to enumerate all\nminimal autocatalytic subnetworks within a network. In this work, we define the\nmaximum growth factor (MGF) of an autocatalytic subnetwork, develop\nmathematical optimization approaches to compute this metric, and explore its\nimplications in the field of economics and dynamical systems. We develop exact\napproaches to determine the MGF of any subnetwork based on an iterative\nprocedure with guaranteed convergence, which allows for identifying\nautocatalytic subnetworks with the highest MGF. We report the results of\ncomputational experiments on synthetic CRNs and two well-known datasets, namely\nthe Formose and E. coli reaction networks, identifying their autocatalytic\nsubnetworks and exploring their scientific ramifications. Using advanced\noptimization techniques and interdisciplinary applications, our framework adds\nan essential resource to analyze complex systems modeled as reaction networks.\n","subjects":["Mathematics/Optimization and Control","Computer Science/Computational Engineering, Finance, and Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"4SD2iAVnLlVLdpOinDAIYndXtMlMGgRvbWmCCyMvaRY","pdfSize":"3887843"}