{
  "id": "2412.10132",
  "title": "Control of Ferrimagnetic Compensation and Perpendicular Anisotropy in\n  Tb$_x$Co$_{(100-x)}$ with H$^{+}$ ion implantation",
  "authors": "Robbie G. Hunt, Dmitrii Moldarev, Mat\\'ias P. Grassi, Daniel\n  Primetzhofer, Gabriella Andersson",
  "authorsParsed": [
    [
      "Hunt",
      "Robbie G.",
      ""
    ],
    [
      "Moldarev",
      "Dmitrii",
      ""
    ],
    [
      "Grassi",
      "Matías P.",
      ""
    ],
    [
      "Primetzhofer",
      "Daniel",
      ""
    ],
    [
      "Andersson",
      "Gabriella",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 13:28:28 GMT"
    }
  ],
  "updateDate": "2024-12-16",
  "timestamp": 1734096508000,
  "abstract": "  The tuning of magnetic properties through electrochemical loading of hydrogen\nhas recently attracted significant interest as a way to manipulate magnetic\ndevices with electric fields. In this paper we investigate quantitatively the\nmagneto-ionic effect of hydrogen uptake on the magnetic properties of\nrare-earth transition metal alloy Tb$_x$Co$_{(100-x)}$ in the composition range\nof $x=10-39$ at.\\% using ion implantation. Using this technique we are able to\nlink changes in magnetic behaviour to exact concentrations of hydrogen,\nisolated from the movement of any other ions that would be a factor in\nelectrochemical studies. The composition of the alloy has been varied alongside\nthe hydrogen dose to characterize the effect of progressive hydrogen loading on\nthe full range of $x$ displaying out-of-plane magnetic anisotropy. We find\nlarge changes in two important properties: the compensation composition and the\nCo-rich in-plane to out-of-plane magnetic anisotropy transition composition,\nboth of which move by 6 at.\\% towards higher Tb concentrations after hydrogen\nimplantation. This shift in composition does not increase with a larger dose.\nFrom the changes in magnetization we attribute the change in compensation\ncomposition to a significant reduction of the moment on the Tb sublattice.\n",
  "subjects": [
    "Condensed Matter/Materials Science"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "EK0YCe8HhnCRRan_YYkbY5pDE5v2Ka2wv__I6---F8Q",
  "pdfSize": "1587566"
}