{
  "id": "2412.16270",
  "title": "MetaScientist: A Human-AI Synergistic Framework for Automated Mechanical\n  Metamaterial Design",
  "authors": "Jingyuan Qi, Zian Jia, Minqian Liu, Wangzhi Zhan, Junkai Zhang,\n  Xiaofei Wen, Jingru Gan, Jianpeng Chen, Qin Liu, Mingyu Derek Ma, Bangzheng\n  Li, Haohui Wang, Adithya Kulkarni, Muhao Chen, Dawei Zhou, Ling Li, Wei Wang,\n  Lifu Huang",
  "authorsParsed": [
    [
      "Qi",
      "Jingyuan",
      ""
    ],
    [
      "Jia",
      "Zian",
      ""
    ],
    [
      "Liu",
      "Minqian",
      ""
    ],
    [
      "Zhan",
      "Wangzhi",
      ""
    ],
    [
      "Zhang",
      "Junkai",
      ""
    ],
    [
      "Wen",
      "Xiaofei",
      ""
    ],
    [
      "Gan",
      "Jingru",
      ""
    ],
    [
      "Chen",
      "Jianpeng",
      ""
    ],
    [
      "Liu",
      "Qin",
      ""
    ],
    [
      "Ma",
      "Mingyu Derek",
      ""
    ],
    [
      "Li",
      "Bangzheng",
      ""
    ],
    [
      "Wang",
      "Haohui",
      ""
    ],
    [
      "Kulkarni",
      "Adithya",
      ""
    ],
    [
      "Chen",
      "Muhao",
      ""
    ],
    [
      "Zhou",
      "Dawei",
      ""
    ],
    [
      "Li",
      "Ling",
      ""
    ],
    [
      "Wang",
      "Wei",
      ""
    ],
    [
      "Huang",
      "Lifu",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 15:20:57 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734708057000,
  "abstract": "  The discovery of novel mechanical metamaterials, whose properties are\ndominated by their engineered structures rather than chemical composition, is a\nknowledge-intensive and resource-demanding process. To accelerate the design of\nnovel metamaterials, we present MetaScientist, a human-in-the-loop system that\nintegrates advanced AI capabilities with expert oversight with two primary\nphases: (1) hypothesis generation, where the system performs complex reasoning\nto generate novel and scientifically sound hypotheses, supported with\ndomain-specific foundation models and inductive biases retrieved from existing\nliterature; (2) 3D structure synthesis, where a 3D structure is synthesized\nwith a novel 3D diffusion model based on the textual hypothesis and refined it\nwith a LLM-based refinement model to achieve better structure properties. At\neach phase, domain experts iteratively validate the system outputs, and provide\nfeedback and supplementary materials to ensure the alignment of the outputs\nwith scientific principles and human preferences. Through extensive evaluation\nfrom human scientists, MetaScientist is able to deliver novel and valid\nmechanical metamaterial designs that have the potential to be highly impactful\nin the metamaterial field.\n",
  "subjects": [
    "Computer Science/Artificial Intelligence",
    "Computer Science/Human-Computer Interaction"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "WT0yJhNjNT16aG9xsJW9HqoXBXu2UsDZAjWGFvcRLaM",
  "pdfSize": "2390803"
}