{
  "id": "2412.16012",
  "title": "Discovery of a non-Hermitian phase transition in a bulk condensed-matter\n  system",
  "authors": "Jingwen Li, Michael Turaev, Masakazu Matsubara, Kristin Kliemt,\n  Cornelius Krellner, Shovon Pal, Manfred Fiebig, and Johann Kroha",
  "authorsParsed": [
    [
      "Li",
      "Jingwen",
      ""
    ],
    [
      "Turaev",
      "Michael",
      ""
    ],
    [
      "Matsubara",
      "Masakazu",
      ""
    ],
    [
      "Kliemt",
      "Kristin",
      ""
    ],
    [
      "Krellner",
      "Cornelius",
      ""
    ],
    [
      "Pal",
      "Shovon",
      ""
    ],
    [
      "Fiebig",
      "Manfred",
      ""
    ],
    [
      "Kroha",
      "Johann",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 16:03:45 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734710625000,
  "abstract": "  Phase transitions are fundamental in nature. A small parameter change near a\ncritical point leads to a qualitative change in system properties. Across a\nregular phase transition, the system remains in thermal equilibrium and,\ntherefore, experiences a change of static properties, like the emergence of a\nmagnetisation upon cooling a ferromagnet below the Curie temperature. When\ndriving a system far from equilibrium, novel, otherwise inaccessible quantum\nstates of matter may arise. Such states are typically non-Hermitian, that is,\ntheir dynamics break time-reversal symmetry, a basic law of equilibrium\nphysics. Phase transitions in non-Hermitian systems are of fundamentally new\nnature in that the dynamical behaviour rather than static properties may\nundergo a qualitative change at a critical, here called exceptional point. Here\nwe experimentally realize a non-Hermitian phase transition in a bulk\ncondensed-matter system. Optical excitation creates charge carriers in the\nferromagnetic semiconductor EuO. In a temperature-dependent interplay with the\nHermitian transition to ferromagnetic order, a non-Hermitian change of the\nrelaxation dynamics occurs, manifesting in our time-resolved reflection data as\na transition from bi-exponential real to single-exponential complex decay. Our\ntheory models this behavior and predicts non-Hermitian phase transitions for a\nlarge class of condensed-matter systems, where they may be exploited to\nsensitively control bulk-dynamic properties.\n",
  "subjects": [
    "Condensed Matter/Strongly Correlated Electrons",
    "Condensed Matter/Statistical Mechanics",
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "xBqApqm2Zh0GOk5c89rGJ4bSnlF2YhtLcmzNX89szCU",
  "pdfSize": "1995933"
}