{
  "id": "2412.04356",
  "title": "Water Ice in the Edge-On Orion Silhouette Disk 114--426 from JWST NIRCam\n  Images",
  "authors": "Nicholas P. Ballering, L. Ilsedore Cleeves, Ryan D. Boyden, Mark J.\n  McCaughrean, Rachel E. Gross, Samuel G. Pearson",
  "authorsParsed": [
    [
      "Ballering",
      "Nicholas P.",
      ""
    ],
    [
      "Cleeves",
      "L. Ilsedore",
      ""
    ],
    [
      "Boyden",
      "Ryan D.",
      ""
    ],
    [
      "McCaughrean",
      "Mark J.",
      ""
    ],
    [
      "Gross",
      "Rachel E.",
      ""
    ],
    [
      "Pearson",
      "Samuel G.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 17:15:28 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 21 Jan 2025 16:10:08 GMT"
    }
  ],
  "updateDate": "2025-01-22",
  "timestamp": 1733418928000,
  "abstract": "  We examine images of the protoplanetary disk 114--426 with JWST/NIRCam in 12\nbands. This large disk is oriented edge-on with a dark midplane flanked by\nlobes of scattered light. The outer edges of the midplane are seen in\nsilhouette against the Orion Nebula, providing a unique opportunity to study\nplanet-forming material in absorption. We discover a dip in the scattered light\nof the disk at 3\\,$\\micron$ -- compelling evidence for the presence of water\nice. The 3\\,$\\micron$ dip is also seen in the silhouette of the disk, where we\nquantify the ice abundance with models of pure absorption and avoid the\ncomplications of disk scattering effects. We find grain ice-to-refractory mass\nratios of up to $\\sim$0.2, maximum grain sizes of 0.25 to 5\\,$\\micron$, and a\ntotal dust plus ice mass of 0.46\\,$M_\\oplus$ in the silhouette region. We also\ndiscover excess absorption in the NIRCam bands that include the Paschen\n$\\alpha$ line, suggesting there may be excited atomic hydrogen in the disk.\nExamining the morphology of the scattered light lobes reveals that they are\nlaterally offset from each other and exhibit a brightness asymmetry that flips\nwith wavelength -- both evidence for a tilted inner disk in this system.\n",
  "subjects": [
    "Astrophysics/Earth and Planetary Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "07d9U_Fk8Arj7Tk6NpuC7Pdyiuf6_Gc2NR7Nwo_UGy4",
  "pdfSize": "3826963"
}