{"id":"2412.00872","title":"Tracing Hierarchical Star Formation out to Kiloparsec Scales in Nearby\n  Spiral Galaxies with UVIT","authors":"Gairola Shashank, Smitha Subramanian, Sreedevi M., Shyam H Menon,\n  Chayan Mondal, Sriram Krishna, Mousumi Das, Annapurni Subramaniam","authorsParsed":[["Shashank","Gairola",""],["Subramanian","Smitha",""],["M.","Sreedevi",""],["Menon","Shyam H",""],["Mondal","Chayan",""],["Krishna","Sriram",""],["Das","Mousumi",""],["Subramaniam","Annapurni",""]],"versions":[{"version":"v1","created":"Sun, 1 Dec 2024 16:25:46 GMT"},{"version":"v2","created":"Tue, 10 Dec 2024 05:14:20 GMT"}],"updateDate":"2024-12-11","timestamp":1733070346000,"abstract":"  Molecular clouds fragment under the action of supersonic turbulence & gravity\nwhich results in a scale-free hierarchical distribution of star formation (SF)\nwithin galaxies. Recent studies suggest that the hierarchical distribution of\nSF in nearby galaxies shows a dependence on host galaxy properties. In this\ncontext, we study the nature of hierarchical SF from a few tens of pc up to\nseveral kpc in 4 nearby spiral galaxies NGC1566, NGC5194, NGC5457 & NGC7793, by\nleveraging the large FoV & high resolution FUV+NUV observations from the\nUltraViolet Imaging Telescope (UVIT). Using the two-point correlation function,\nwe infer that the young star-forming clumps (SFCs) in the galaxies are arranged\nin a fractal-like hierarchical distribution, but only up to a maximum scale\n($l_{corr}$) & it ranges from 0.5 kpc to 3.1 kpc. The flocculent spiral NGC7793\nhas $\\sim$5 times smaller $l_{corr}$ than the 3 grand design spirals, possibly\ndue to its lower mass, low pressure environment & lack of strong spiral arms.\n$l_{corr}$ being much smaller than the galaxy size suggests that the SF\nhierarchy does not extend to the full galaxy size & it is likely an effect set\nby multiple physical mechanisms in the galaxy. The hierarchical distribution of\nSFCs dissipates within 10 to 50 Myr, signifying their migration away from their\nbirthplaces over time. Our results suggest that the global hierarchical\nproperties of SF in galaxies are not universal & significant variations exist\nin the local & global hierarchy parameters of a galaxy. This study also\ndemonstrates the capabilities of UVIT in characterizing the SF hierarchy in\nnearby galaxies. In the future, a bigger sample can be employed to further\nunderstand the role of large-scale galaxy properties (morphology, environment)\n& physical processes (feedback, turbulence, shear & ISM conditions) on\ndetermining the non-universal hierarchical properties of SF in galaxies.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"NxivgB2OEQ_ov2S1ZCFh45uhJV-7NltLyw0ZzLyHZog","pdfSize":"12400936"}