{
  "id": "2412.03905",
  "title": "Integrating Various Software Artifacts for Better LLM-based Bug\n  Localization and Program Repair",
  "authors": "Qiong Feng, Xiaotian Ma, Jiayi Sheng, Ziyuan Feng, Wei Song, Peng\n  Liang",
  "authorsParsed": [
    [
      "Feng",
      "Qiong",
      ""
    ],
    [
      "Ma",
      "Xiaotian",
      ""
    ],
    [
      "Sheng",
      "Jiayi",
      ""
    ],
    [
      "Feng",
      "Ziyuan",
      ""
    ],
    [
      "Song",
      "Wei",
      ""
    ],
    [
      "Liang",
      "Peng",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 06:21:31 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733379691000,
  "abstract": "  LLMs have garnered considerable attention for their potential to streamline\nAutomated Program Repair (APR). LLM-based approaches can either insert the\ncorrect code or directly generate patches when provided with buggy methods.\nHowever, most of LLM-based APR methods rely on a single type of software\ninformation, without fully leveraging different software artifacts. Despite\nthis, many LLM-based approaches do not explore which specific types of\ninformation best assist in APR. Addressing this gap is crucial for advancing\nLLM-based APR techniques. We propose DEVLoRe to use issue content (description\nand message) and stack error traces to localize buggy methods, then rely on\ndebug information in buggy methods and issue content and stack error to\nlocalize buggy lines and generate plausible patches which can pass all unit\ntests. The results show that while issue content is particularly effective in\nassisting LLMs with fault localization and program repair, different types of\nsoftware artifacts complement each other. By incorporating different artifacts,\nDEVLoRe successfully locates 49.3% and 47.6% of single and non-single buggy\nmethods and generates 56.0% and 14.5% plausible patches for the Defects4J v2.0\ndataset, respectively. This outperforms current state-of-the-art APR methods.\nThe source code and experimental results of this work for replication are\navailable at https://github.com/XYZboom/DEVLoRe.\n",
  "subjects": [
    "Computer Science/Software Engineering",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "AxZSWWiO7BkgMDEgKeU3APsLUpowzlekRH0SQsGeCpk",
  "pdfSize": "1763697"
}