{
  "id": "2412.07724",
  "title": "Granite Guardian",
  "authors": "Inkit Padhi, Manish Nagireddy, Giandomenico Cornacchia, Subhajit\n  Chaudhury, Tejaswini Pedapati, Pierre Dognin, Keerthiram Murugesan, Erik\n  Miehling, Mart\\'in Santill\\'an Cooper, Kieran Fraser, Giulio Zizzo, Muhammad\n  Zaid Hameed, Mark Purcell, Michael Desmond, Qian Pan, Zahra Ashktorab, Inge\n  Vejsbjerg, Elizabeth M. Daly, Michael Hind, Werner Geyer, Ambrish Rawat, Kush\n  R. Varshney, Prasanna Sattigeri",
  "authorsParsed": [
    [
      "Padhi",
      "Inkit",
      ""
    ],
    [
      "Nagireddy",
      "Manish",
      ""
    ],
    [
      "Cornacchia",
      "Giandomenico",
      ""
    ],
    [
      "Chaudhury",
      "Subhajit",
      ""
    ],
    [
      "Pedapati",
      "Tejaswini",
      ""
    ],
    [
      "Dognin",
      "Pierre",
      ""
    ],
    [
      "Murugesan",
      "Keerthiram",
      ""
    ],
    [
      "Miehling",
      "Erik",
      ""
    ],
    [
      "Cooper",
      "Martín Santillán",
      ""
    ],
    [
      "Fraser",
      "Kieran",
      ""
    ],
    [
      "Zizzo",
      "Giulio",
      ""
    ],
    [
      "Hameed",
      "Muhammad Zaid",
      ""
    ],
    [
      "Purcell",
      "Mark",
      ""
    ],
    [
      "Desmond",
      "Michael",
      ""
    ],
    [
      "Pan",
      "Qian",
      ""
    ],
    [
      "Ashktorab",
      "Zahra",
      ""
    ],
    [
      "Vejsbjerg",
      "Inge",
      ""
    ],
    [
      "Daly",
      "Elizabeth M.",
      ""
    ],
    [
      "Hind",
      "Michael",
      ""
    ],
    [
      "Geyer",
      "Werner",
      ""
    ],
    [
      "Rawat",
      "Ambrish",
      ""
    ],
    [
      "Varshney",
      "Kush R.",
      ""
    ],
    [
      "Sattigeri",
      "Prasanna",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 18:17:02 GMT"
    },
    {
      "version": "v2",
      "created": "Mon, 16 Dec 2024 20:27:36 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1733854622000,
  "abstract": "  We introduce the Granite Guardian models, a suite of safeguards designed to\nprovide risk detection for prompts and responses, enabling safe and responsible\nuse in combination with any large language model (LLM). These models offer\ncomprehensive coverage across multiple risk dimensions, including social bias,\nprofanity, violence, sexual content, unethical behavior, jailbreaking, and\nhallucination-related risks such as context relevance, groundedness, and answer\nrelevance for retrieval-augmented generation (RAG). Trained on a unique dataset\ncombining human annotations from diverse sources and synthetic data, Granite\nGuardian models address risks typically overlooked by traditional risk\ndetection models, such as jailbreaks and RAG-specific issues. With AUC scores\nof 0.871 and 0.854 on harmful content and RAG-hallucination-related benchmarks\nrespectively, Granite Guardian is the most generalizable and competitive model\navailable in the space. Released as open-source, Granite Guardian aims to\npromote responsible AI development across the community.\n  https://github.com/ibm-granite/granite-guardian\n",
  "subjects": [
    "Computer Science/Computation and Language"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "_3Qj-BQeTgd3X0UkZBsMvE2Qzv6OtevyWGc89v_NSj4",
  "pdfSize": "781618"
}