{"id":"2412.18000","title":"Entropy spectroscopy of a bilayer graphene quantum dot","authors":"Christoph Adam, Hadrien Duprez, Natalie Lehmann, Antoni Yglesias,\n  Solenn Cances, Max Josef Ruckriegel, Michele Masseroni, Chuyao Tong, Artem\n  Olegovich Denisov, Wei Wister Huang, David Kealhofer, Rebekka Garreis, Kenji\n  Watanabe, Takashi Taniguchi, Klaus Ensslin, Thomas Ihn","authorsParsed":[["Adam","Christoph",""],["Duprez","Hadrien",""],["Lehmann","Natalie",""],["Yglesias","Antoni",""],["Cances","Solenn",""],["Ruckriegel","Max Josef",""],["Masseroni","Michele",""],["Tong","Chuyao",""],["Denisov","Artem Olegovich",""],["Huang","Wei Wister",""],["Kealhofer","David",""],["Garreis","Rebekka",""],["Watanabe","Kenji",""],["Taniguchi","Takashi",""],["Ensslin","Klaus",""],["Ihn","Thomas",""]],"versions":[{"version":"v1","created":"Mon, 23 Dec 2024 21:49:51 GMT"}],"updateDate":"2024-12-25","timestamp":1734990591000,"abstract":"  We measure the entropy change of charge transitions in an electrostatically\ndefined quantum dot in bilayer graphene. Entropy provides insights into the\nequilibrium thermodynamic properties of both ground and excited states beyond\ntransport measurements. For the one-carrier regime, the obtained entropy shows\nthat the ground state has a two-fold degeneracy lifted by an out-of-plane\nmagnetic field. This observation is in agreement with previous direct transport\nmeasurements and confirms the applicability of this novel method. For the\ntwo-carrier regime, the extracted entropy indicates a non-degenerate ground\nstate at zero magnetic field, contrary to previous studies suggesting a\nthree-fold degeneracy. We attribute the degeneracy lifting to the effect of\nKane-Mele type spin-orbit interaction on the two-carrier ground state, which\nhas not been observed before. Our work demonstrates the validity and efficacy\nof entropy measurements as a unique, supplementary experimental tool to\ninvestigate the degeneracy of the ground state in quantum devices build in\nmaterials such as graphene. This technique, applied to exotic systems with\nfractional ground state entropies, will be a powerful tool in the study of\nquantum matter.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"brHX2EmwwlGxyRrBQDio4LTwYZKXc1fMMtVA2howlXY","pdfSize":"4698515"}