{"id":"2412.16239","title":"Zero Energy States for Commensurate Hopping Modulation of a Generalized\n  Su-Schrieffer-Heeger Chain in the Presence of a Domain Wall","authors":"Surajit Mandal","authorsParsed":[["Mandal","Surajit",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 13:31:39 GMT"}],"updateDate":"2024-12-24","timestamp":1734615099000,"abstract":"  We study the effect of domain wall (DW) on zero-energy states (ZESs) in the\nSu-Schrieffer-Heeger (SSH) chain. The chain features two fractional ZESs in the\npresence of such DW, one of which is localized at the edge and the other bound\nat the location of DW. This zero-energy DW state exhibits interesting\nmodifications when hopping modulation is tuned periodically. We studied the\nenergy spectra for commensurate frequencies $\\theta=\\pi,\\pi/2,\\pi/3$ and\n$\\pi/4$. Following the recent study by the author of this paper [S. Mandal, S.\nKar, Phys. Rev. B 109, 195124 (2024)], we showed numerically, along with\nphysical intuition, that one ZES can bound at the DW position only for\ncommensurate frequency $\\theta=\\frac{\\pi}{2s+1}$ for zero or an integer $s$\nvalues, while for $\\theta=\\frac{\\pi}{2s}$ with nonzero or an integer $s$ value\nthey appear only at the edges of the chain. We verify our numerical results by\nusing exact analytical techniques. Both analyses indicate the realization of\nthe Jackiw-Rebbi modes for our model only with $\\theta=\\frac{\\pi}{2s+1}$.\nMoreover, the localization of zero-energy edge and DW states are investigated\nwhich reveals their localized (extended) nature for smaller (larger)\n$\\Delta_{0}$ (amplitude of DW). The localization of topological DW states is\nsuppressed as the width of DW ($\\xi$) increases (typically scaled as $\\sim\n1/\\xi$) while the edge state shows an extended behavior only for the large\n$\\xi$ limit.\n","subjects":["Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"edOnRjOeDwKPVq8w3TS-lugsMDnvXdXEUWNvq_wHnFg","pdfSize":"1567674"}