{
  "id": "2412.10384",
  "title": "Adult learners recall and recognition performance and affective feedback\n  when learning from an AI-generated synthetic video",
  "authors": "Zoe Ruo-Yu Li, Caswell Barry, Mutlu Cukurova",
  "authorsParsed": [
    [
      "Li",
      "Zoe Ruo-Yu",
      ""
    ],
    [
      "Barry",
      "Caswell",
      ""
    ],
    [
      "Cukurova",
      "Mutlu",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 28 Nov 2024 21:40:28 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1732830028000,
  "abstract": "  The widespread use of generative AI has led to multiple applications of\nAI-generated text and media to potentially enhance learning outcomes. However,\nthere are a limited number of well-designed experimental studies investigating\nthe impact of learning gains and affective feedback from AI-generated media\ncompared to traditional media (e.g., text from documents and human recordings\nof video). The current study recruited 500 participants to investigate adult\nlearners recall and recognition performances as well as their affective\nfeedback on the AI-generated synthetic video, using a mixed-methods approach\nwith a pre-and post-test design. Specifically, four learning conditions,\nAI-generated framing of human instructor-generated text, AI-generated synthetic\nvideos with human instructor-generated text, human instructor-generated videos,\nand human instructor-generated text frame (baseline), were considered. The\nresults indicated no statistically significant difference amongst conditions on\nrecall and recognition performance. In addition, the participants affective\nfeedback was not statistically significantly different between the two video\nconditions. However, adult learners preferred to learn from the video formats\nrather than text materials.\n",
  "subjects": [
    "Computer Science/Human-Computer Interaction",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "_WJ9e0YIaZce07rsmcAQQShfQtTwnfYSqq17dSC9erQ",
  "pdfSize": "2055986"
}