{"id":"2412.05298","title":"Curvature-Enhanced Dynamics and Exponential Decay of the Non-Cutoff\n  Boltzmann Equation on Riemannian Manifolds","authors":"R\\^omulo Damasclin Chaves dos Santos","authorsParsed":[["Santos","Rômulo Damasclin Chaves dos",""]],"versions":[{"version":"v1","created":"Mon, 25 Nov 2024 00:10:52 GMT"}],"updateDate":"2024-12-10","timestamp":1732493452000,"abstract":"  In this work, we investigate the long-time behavior of solutions to the\nnon-cutoff Boltzmann equation on compact Riemannian manifolds with bounded\nRicci curvature. The paper introduces new results on the exponential decay of\nhydrodynamic quantities, such as density, momentum, and energy fields,\ninfluenced by both the curvature of the manifold and singularities in the\ncollision kernel. We demonstrate that for initial data in $H^s_x \\times L^p_v$,\nthe solutions exhibit sharp exponential decay rates in Sobolev norms, with the\ndecay rate determined by the manifold's geometry and the regularity of the\nkernel. Specifically, we prove that the density $\\rho(t, x)$, momentum\n$\\mathbf{m}(t, x)$, and energy field $E(t, x)$ all decay exponentially in time,\nwith decay rates that depend on the manifold's curvature and the nature of the\ncollision kernel's singularity. Additionally, we address the case of angular\nsingularities in the collision kernel, providing conditions under which the\nexponential decay persists. The analysis combines energy methods, Fourier\nanalysis, and coercivity estimates for the collision operator, extended to\ncurved geometries. These results extend the understanding of dissipation\nmechanisms in kinetic theory, especially in curved settings, and offer valuable\ninsights into the behavior of rarefied gases and plasma flows in non-Euclidean\nenvironments. The findings have applications in plasma physics, astrophysics,\nand the study of rarefied gases, opening new directions for future research in\nkinetic theory and geometric analysis.\n","subjects":["Mathematics/Analysis of PDEs","Physics/Mathematical Physics","Mathematics/Mathematical Physics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"dmFAHPNnBi2VRtvmsg8imNppfFifycZwC9HDb1y4HjI","pdfSize":"165966"}