{
  "id": "2412.04174",
  "title": "Supertoroid fitting of objects with holes for robotic grasping and scene\n  generation",
  "authors": "Joan Badia Torres, Eric Carmona, Abhijit Makhal, Omid Heidari, and\n  Alba Perez Gracia",
  "authorsParsed": [
    [
      "Torres",
      "Joan Badia",
      ""
    ],
    [
      "Carmona",
      "Eric",
      ""
    ],
    [
      "Makhal",
      "Abhijit",
      ""
    ],
    [
      "Heidari",
      "Omid",
      ""
    ],
    [
      "Gracia",
      "Alba Perez",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 14:11:07 GMT"
    },
    {
      "version": "v2",
      "created": "Sat, 21 Dec 2024 18:59:26 GMT"
    },
    {
      "version": "v3",
      "created": "Sun, 29 Dec 2024 10:55:53 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1733407867000,
  "abstract": "  One of the strategies to detect the pose and shape of unknown objects is\ntheir geometric modeling, consisting on fitting known geometric entities.\nClassical geometric modeling fits simple shapes such as spheres or cylinders,\nbut often those don't cover the variety of shapes that can be encountered. For\nthose situations, one solution is the use of superquadrics, which can adapt to\na wider variety of shapes.\n  One of the limitations of superquadrics is that they cannot model objects\nwith holes, such as those with handles. This work aims to fit supersurfaces of\ndegree four, in particular supertoroids, to objects with a single hole.\nFollowing the results of superquadrics, simple expressions for the major and\nminor radial distances are derived, which lead to the fitting of the intrinsic\nand extrinsic parameters of the supertoroid. The differential geometry of the\nsurface is also studied as a function of these parameters. The result is a\nsupergeometric modeling that can be used for symmetric objects with and without\nholes with a simple distance function for the fitting. The proposed algorithm\nexpands considerably the amount of shapes that can be targeted for geometric\nmodeling.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Image and Video Processing",
    "Computer Science/Robotics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "fxGP7OELzdjM1ZySA6--hfhIbsaO4g_S-8NosXyykOo",
  "pdfSize": "3731724"
}