{"id":"2412.10355","title":"Old Dogs, New Tricks: Re-examining Photographic Spectra of Plaskett's\n  Star","authors":"T. J. Davidge","authorsParsed":[["Davidge","T. J.",""]],"versions":[{"version":"v1","created":"Fri, 13 Dec 2024 18:50:52 GMT"}],"updateDate":"2024-12-16","timestamp":1734115852000,"abstract":"  Photographic spectra of Plaskett's Star (PS; HR2420, HD47129, V640 Mon) that\nwere recorded at the Dominion Astrophysical Observatory (DAO) have been\ndigitized with a flatbed scanner. Many of the spectra were recorded during\ncampaigns in 1922 and 1937, and sample wavelengths between 0.39 and 0.50um.\nSpectra of poor quality are identified. Mean spectra near orbital phases 0.25\nand 0.75 match many characteristics of synthetic spectra, although Hgamma and\nHeI 4388 are exceptions. Evidence is presented that Hgamma was affected by\ntransient activity in 1937, but not in 1922. Emission lines of NIII and HeII\nmove with wavelength in a manner that is consistent with them tracking the\nmotion of the secondary, indicating that an 'f' spectral type designation\nshould be assigned to the secondary. The location of the peak that is\nassociated with the secondary in cross-correlation functions changes with time\nnear phase 0.75, although the mean amplitude of the radial velocity curve of\nthe secondary did not change between the two campaigns. There is also an offset\nin velocities of the primary measured from Hgamma and HeI 4472 near phase 0.25.\nThe velocity curves of the components suggest a mass ratio that is larger than\nprevious estimates, although uncertainties associated with the spectroscopic\nfeatures attributed to the secondary, coupled with the wavelength resolution of\nthe spectra, complicate efforts to determine robust masses. We conclude that\npeculiarities in the radial velocity curves of the components have thus been in\nplace for over a thousand orbital cycles.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"-CBPT-JXjcVEL8NkXdPtt7cYdnkxdEvPqFYFmyNvMDU","pdfSize":"921600"}