{
  "id": "2412.15500",
  "title": "Hidden Figures in Software Engineering: A Replication Study Exploring\n  Undergraduate Software Students' Awareness of Distinguished Scientists from\n  Underrepresented Groups",
  "authors": "Ronnie de Souza Santos, Italo Santos, Robson Santos, Cleyton Magalhaes",
  "authorsParsed": [
    [
      "Santos",
      "Ronnie de Souza",
      ""
    ],
    [
      "Santos",
      "Italo",
      ""
    ],
    [
      "Santos",
      "Robson",
      ""
    ],
    [
      "Magalhaes",
      "Cleyton",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 02:26:23 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734661583000,
  "abstract": "  Technology is a cornerstone of modern life, yet the software engineering\nfield struggles to reflect the diversity of contemporary society. This lack of\ndiversity and inclusivity within the software industry can be traced back to\nlimited representation in software engineering academic settings, where\nstudents from underrepresented groups are often stigmatized despite the field's\nrich history of contributions from scientists from diverse backgrounds. Over\nthe years, studies have revealed that women, LGBTQIA+ individuals, and Black\nstudents frequently encounter unwelcoming environments in software engineering\nprograms. However, similar to other fields, increasing awareness of notable\nindividuals from marginalized backgrounds could inspire students and foster a\nmore inclusive environment. This study reports the findings from a replicated\nglobal survey with undergraduate software engineering students, exploring their\nknowledge of distinguished scientists from underrepresented groups. These\nfindings show that students have limited awareness of these figures and their\ncontributions, highlighting the need to improve diversity awareness and develop\neducational practices that celebrate the achievements of historically\nmarginalized groups in software engineering. Index Terms-EDi in software\nengineering, software engineering education, diversity.\n",
  "subjects": [
    "Computer Science/Software Engineering"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "5e_kkf4cP1TWxwZBaeA824HuKZ5E016L3kZ0kwN15ac",
  "pdfSize": "192625"
}