{"id":"2412.09994","title":"The PET Paradox: How Amazon Instrumentalises PETs in Sidewalk to\n  Entrench Its Infrastructural Power","authors":"Thijmen van Gend, Donald Jay Bertulfo, Seda G\\\"urses","authorsParsed":[["van Gend","Thijmen",""],["Bertulfo","Donald Jay",""],["Gürses","Seda",""]],"versions":[{"version":"v1","created":"Fri, 13 Dec 2024 09:29:32 GMT"}],"updateDate":"2024-12-16","timestamp":1734082172000,"abstract":"  Recent applications of Privacy Enhancing Technologies (PETs) reveal a\nparadox. PETs aim to alleviate power asymmetries, but can actually entrench the\ninfrastructural power of companies implementing them vis-\\`a-vis other public\nand private organisations. We investigate whether and how this contradiction\nmanifests with an empirical study of Amazon's cloud connectivity service called\nSidewalk. In 2021, Amazon remotely updated Echo and Ring devices in consumers'\nhomes, to transform them into Sidewalk \"gateways\". Compatible Internet of\nThings (IoT) devices, called \"endpoints\", can connect to an associated\n\"Application Server\" in Amazon Web Services (AWS) through these gateways. We\nfind that Sidewalk is not just a connectivity service, but an extension of\nAmazon's cloud infrastructure as a software production environment for IoT\nmanufacturers. PETs play a prominent role in this pursuit: we observe a\ntwo-faceted PET paradox. First, suppressing some information flows allows\nAmazon to promise narrow privacy guarantees to owners of Echo and Ring devices\nwhen \"flipping\" them into gateways. Once flipped, these gateways constitute a\ncrowdsourced connectivity infrastructure that covers 90% of the US population\nand expands their AWS offerings. We show how novel information flows, enabled\nby Sidewalk connectivity, raise greater surveillance and competition concerns.\nSecond, Amazon governs the implementation of these PETs, requiring\nmanufacturers to adjust their device hardware, operating system and software;\ncloud use; factory lines; and organisational processes. Together, these changes\nturn manufacturers' endpoints into accessories of Amazon's computational\ninfrastructure; further entrenching Amazon's infrastructural power. We argue\nthat power analyses undergirding PET design should go beyond analysing\ninformation flows. We propose future steps for policy and tech research.\n","subjects":["Computer Science/Computers and Society","Computer Science/Cryptography and Security","Computer Science/Networking and Internet Architecture"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"RKqRryx47u1i3csTnEXfvhXYyrk-qwuFqdWJDkQX3ro","pdfSize":"2649239"}