{
  "id": "2412.14013",
  "title": "Turbulent solutions of the binormal flow and the 1D cubic Schr\\\"odinger\n  equation",
  "authors": "Valeria Banica and Luis Vega",
  "authorsParsed": [
    [
      "Banica",
      "Valeria",
      ""
    ],
    [
      "Vega",
      "Luis",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 16:30:58 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734539458000,
  "abstract": "  In the last three decades there is an intense activity on the exploration of\nturbulent phenomena of dispersive equations, as for instance the growth of\nSobolev norms since the work of Bourgain in the 90s. In general the 1D cubic\nSchr\\\"odinger equation has been left aside because of its complete\nintegrability. In a series of papers of the last six years that we survey here\nfor the special issue of the ICMP 2024 ([12],[13],[14],[15],[16],[7],[8]), we\nconsidered, together with the 1D cubic Schr\\\"odinger equation, the binormal\nflow, which is a geometric flow explicitly related to it. We displayed\nrigorously a large range of complex behavior as creation of singularities and\nunique continuation, Fourier growth, Talbot effects, intermittency and\nmultifractality, justifying in particular some previous numerical observations.\nTo do so we constructed a class of well-posedness for the 1D cubic\nSchr\\\"odinger equation included in the critical Fourier-Lebesgue space\n$\\mathcal FL^\\infty$ and in supercritical Sobolev spaces with respect to\nscaling. Last but not least we recall that the binormal flow is a classical\nmodel for the dynamics of a vortex filament in a 3D fluid or superfluid, and\nthat vortex motions are a key element of turbulence.\n",
  "subjects": [
    "Mathematics/Analysis of PDEs",
    "Physics/Mathematical Physics",
    "Mathematics/Mathematical Physics"
  ],
  "license": "http://creativecommons.org/publicdomain/zero/1.0/",
  "blobId": "hnI3ua_tMQljK-jbTpqi1YUw7y29xMx1n7hDEK-L6mM",
  "pdfSize": "7248988"
}