{"id":"2412.13836","title":"Fool's gold: ligand-receptor interactions and the origins of life","authors":"Betony Adams, Angela Illing and Francesco Petruccione","authorsParsed":[["Adams","Betony",""],["Illing","Angela",""],["Petruccione","Francesco",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 13:26:12 GMT"}],"updateDate":"2024-12-19","timestamp":1734528372000,"abstract":"  The origins of life is a question that continues to intrigue scientists\nacross disciplines. One theory - the iron-sulphur theory - suggests that\nreactions essential to the synthesis of biological materials got their\ncatalytic 'spark' from mineral surfaces such as iron pyrite, commonly known as\nfool's gold. Additionally, the binding affinity of the ligands synthesised in\nthis 'surface metabolism' acted as an early version of natural selection: more\nstrongly-binding ligands were accumulated into further autocatalytic reactions\nand the aggregation of complex biological materials. Ligand-receptor binding is\nthus fundamental to the origins of life. In this paper, we use the iron-sulphur\ntheory as a lens through which to review ligand-receptor interactions as they\nare more commonly understood today. In particular we focus on the electron\ntunnelling theory of receptor activation that has emerged from research into\nquantum biology. We revisit criticism against this theory, particularly the\nlack of evidence for electron transfer in receptors, to see what insights might\nbe offered by ligand-receptor interactions mediated by iron pyrite at the\norigins of life. What emerges from this comparison is the central importance of\nredox activity in receptors, in particular with respect to the recurring\npresence of the disulphide bond. While the paper is a speculative exercise, we\nconclude that conductivity in biomolecules, particularly the selective\nconductivity conferred by appropriate ligand-receptor binding, is a powerful\ntool for understanding diverse phenomena such as pharmacological potency and\nviral infection. As such it deserves further investigation.\n","subjects":["Physics/Biological Physics","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"99ohi-IcapbJMuL2Xi0ga436-brSL_8M6DAQ2CcQadQ","pdfSize":"7272046"}