{
  "id": "2412.04023",
  "title": "A Model of the Sidewalk Salsa",
  "authors": "Olger Siebinga",
  "authorsParsed": [
    [
      "Siebinga",
      "Olger",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 09:58:39 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733392719000,
  "abstract": "  When two pedestrians approach each other on the sidewalk head-on, they\nsometimes engage in an awkward interaction, both deviating to the same side\n(repeatedly) to avoid a collision. This phenomenon is known as the sidewalk\nsalsa. Although well known, no existing model describes how this \"dance\"\narises. Such a model must capture the nuances of individual interactions\nbetween pedestrians that lead to the sidewalk salsa. Therefore, it could be\nhelpful in the development of mobile robots that frequently participate in such\nindividual interactions, for example, by informing robots in their\ndecision-making. Here, I present a model based on the communication-enabled\ninteraction framework capable of reproducing the sidewalk salsa. The model\nassumes pedestrians have a deterministic plan for their future movements and a\nprobabilistic belief about the movements of another pedestrian. Combined, the\nplan and belief result in a perceived risk that pedestrians try to keep below a\npersonal threshold. In simulations of this model, the sidewalk salsa occurs in\na symmetrical scenario. At the same time, it shows behavior comparable to\nobserved real-world pedestrian behavior in scenarios with initial position\noffsets or risk threshold differences. Two other scenarios provide support for\na hypothesis from previous literature stating that cultural norms, in the form\nof a biased belief about on which side others will pass (i.e. deviating to the\nleft or right), contribute to the occurrence of the sidewalk salsa. Thereby,\nthe proposed model provides insight into how the sidewalk salsa arises.\n",
  "subjects": [
    "Computer Science/Robotics",
    "Computer Science/Human-Computer Interaction"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "wXDhm3aYg7530mmmjBPjKHFW5PNF4q8I9LKI8SIQqyM",
  "pdfSize": "1471038"
}