{
  "id": "2412.12726",
  "title": "Can quasars, triggered by mergers, account for NANOGrav's stochastic\n  gravitational wave background?",
  "authors": "\\'Agnes Kis-T\\'oth, Zolt\\'an Haiman, Zsolt Frei",
  "authorsParsed": [
    [
      "Kis-Tóth",
      "Ágnes",
      ""
    ],
    [
      "Haiman",
      "Zoltán",
      ""
    ],
    [
      "Frei",
      "Zsolt",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 09:49:01 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734428941000,
  "abstract": "  The stochastic gravitational wave background (GWB) recently discovered by\nseveral pulsar timing array (PTA) experiments is consistent with arising from a\npopulation of coalescing super-massive black hole binaries (SMBHBs). The\namplitude of the background is somewhat higher than expected in most previous\npopulation models or from the local mass density of SMBHs. SMBHBs are expected\nto be produced in galaxy mergers, which are also thought to trigger bright\nquasar activity. Under the assumptions that (i) a fraction $f_{bin} \\sim 1$ of\nall quasars are associated with SMBHB mergers, (ii) the typical quasar lifetime\nis $t_{Q} \\sim 10^{8} yr$, and (iii) adopting Eddington ratios $f_{Edd} \\sim\n0.3$ for the luminosity of bright quasars, we compute the GWB associated\ndirectly with the empirically measured quasar luminosity function (QLF). This\napproach bypasses the need to model the cosmological evolution of SMBH or\ngalaxy mergers from simulations or semi-analytical models. We find a GWB\namplitude approximately matching the value measured by NANOGrav. Our results\nare consistent with most quasars being associated with SMBH binaries and being\nthe sources of the GWB, and imply a joint constraint on $t_{Q}$, $f_{Edd}$ and\nthe typical mass ratio $q \\equiv M_{2}/M_{1}$. The GWB in this case would be\ndominated by relatively distant $\\sim 10^{9} M_{\\odot}$ SMBHs at $z \\approx 2 -\n3$, at the peak of quasar activity. Similarly to other population models, our\nresults remain in tension with the local SMBH mass density.\n",
  "subjects": [
    "Astrophysics/Cosmology and Nongalactic Astrophysics",
    "Astrophysics/High Energy Astrophysical Phenomena",
    "Physics/General Relativity and Quantum Cosmology"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "viyb_V5NY14XQ7X9CpdZTFJyH8ii8Gjb_derOIxocB0",
  "pdfSize": "5970027"
}