{"id":"2412.21181","title":"Causal Hangover Effects","authors":"Andreas Santucci, Eric Lax","authorsParsed":[["Santucci","Andreas",""],["Lax","Eric",""]],"versions":[{"version":"v1","created":"Mon, 30 Dec 2024 18:52:48 GMT"}],"updateDate":"2024-12-31","timestamp":1735584768000,"abstract":"  It's not unreasonable to think that in-game sporting performance can be\naffected partly by what takes place off the court. We can't observe what\nhappens between games directly. Instead, we proxy for the possibility of\nathletes partying by looking at play following games in party cities. We are\ninterested to see if teams exhibit a decline in performance the day following a\ngame in a city with active nightlife; we call this a \"hangover effect\". Part of\nthe question is determining a reasonable way to measure levels of nightlife,\nand correspondingly which cities are notorious for it; we colloquially refer to\nsuch cities as \"party cities\". To carry out this study, we exploit data on\nbookmaker spreads: the expected score differential between two teams after\nconditioning on observable performance in past games and expectations about the\nupcoming game. We expect a team to meet the spread half the time, since this is\none of the easiest ways for bookmakers to guarantee a profit. We construct a\nmodel which attempts to estimate the causal effect of visiting a \"party city\"\non subsequent day performance as measured by the odds of beating the spread. In\nparticular, we only consider the hangover effect on games played back-to-back\nwithin 24 hours of each other. To the extent that odds of beating the spread\nagainst next day opponent is uncorrelated with playing in a party city the day\nbefore, which should be the case under an efficient betting market, we have\nidentification in our variable of interest. We find that visiting a city with\nactive nightlife the day prior to a game does have a statistically significant\nnegative effect on a team's likelihood of meeting bookmakers' expectations for\nboth NBA and MLB.\n","subjects":["Economics/Econometrics","Computer Science/Information Theory","Mathematics/Information Theory","Statistics/Applications"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"vxrJ0s1xoatux1WiW-mFC18PhrxNiRg_y5fP33GACq4","pdfSize":"324771"}