{"id":"2412.10937","title":"Asymmetric Interactions Shape Survival During Population Range\n  Expansions","authors":"Jason M. Gray, Rowan J. Barker-Clarke, Jacob G. Scott, Michael\n  Hinczewski","authorsParsed":[["Gray","Jason M.",""],["Barker-Clarke","Rowan J.",""],["Scott","Jacob G.",""],["Hinczewski","Michael",""]],"versions":[{"version":"v1","created":"Sat, 14 Dec 2024 19:13:32 GMT"}],"updateDate":"2024-12-17","timestamp":1734203612000,"abstract":"  An organism that is newly introduced into an existing population has a\nsurvival probability that is dependent on both the population density of its\nenvironment and the competition it experiences with the members of that\npopulation. Expanding populations naturally form regions of high and low\ndensity, and simultaneously experience ecological interactions both internally\nand at the boundary of their range. For this reason, systems of expanding\npopulations are ideal for studying the combination of density and ecological\neffects. Conservation ecologists have been studying the ability of an invasive\nspecies to establish for some time, attributing success to both ecological and\nspatial factors. Similar behaviors have been observed in spatially structured\ncell populations, such as those found in cancerous tumors and bacterial\nbiofilms. In these scenarios, novel organisms may be the introduction of a new\nmutation or bacterial species with some form of drug resistance, leading to the\npossibility of treatment failure. In order to gain insight into the\nrelationship between population density and ecological interactions, we study\nan expanding population of interacting wild-type cells and mutant cells. We\nsimulate these interactions in time and study the spatially dependent\nprobability for a mutant to survive or to take over the front of the population\nwave (gene surfing). Additionally, we develop a mathematical model that\ndescribes this survival probability and find agreement when the payoff for the\nmutant is positive (corresponding to cooperation, exploitation, or\ncommensalism). By knowing the types of interactions, our model provides insight\ninto the spatial distribution of survival probability. Conversely, given a\nspatial distribution of survival probabilities, our model provides insight into\nthe types of interactions that were involved to generate it.\n","subjects":["Quantitative Biology/Populations and Evolution","Physics/Biological Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"txqpzRh8g4Qiz08OexvHxRsOIX0w-Kl2B8bqCHnuU4Q","pdfSize":"4536354"}