{"id":"2412.01156","title":"Covariance Matrix Adaptation Evolution Strategy for Low Effective\n  Dimensionality","authors":"Kento Uchida, Teppei Yamaguchi, Shinichi Shirakawa","authorsParsed":[["Uchida","Kento",""],["Yamaguchi","Teppei",""],["Shirakawa","Shinichi",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 05:56:17 GMT"}],"updateDate":"2024-12-03","timestamp":1733118977000,"abstract":"  Despite the state-of-the-art performance of the covariance matrix adaptation\nevolution strategy (CMA-ES), high-dimensional black-box optimization problems\nare challenging tasks. Such problems often involve a property called low\neffective dimensionality (LED), in which the objective function is formulated\nwith redundant dimensions relative to the intrinsic objective function and a\nrotation transformation of the search space. The CMA-ES suffers from LED for\ntwo reasons: the default hyperparameter setting is determined by the total\nnumber of dimensions, and the norm calculations in step-size adaptations are\nperformed including elements on the redundant dimensions. In this paper, we\nincorporate countermeasures for LED into the CMA-ES and propose CMA-ES-LED. We\ntackle with the rotation transformation using the eigenvectors of the\ncovariance matrix. We estimate the effectiveness of each dimension in the\nrotated search space using the element-wise signal-to-noise ratios of the mean\nvector update and the rank-$\\mu$ update, both of which updates can be explained\nas the natural gradient ascent. Then, we adapt the hyperparameter using the\nestimated number of effective dimensions. In addition, we refine the cumulative\nstep-size adaptation and the two-point step-size adaptation to measure the\nnorms only on the effective dimensions. The experimental results show the\nCMA-ES-LED outperforms the CMA-ES on benchmark functions with LED.\n","subjects":["Computer Science/Neural and Evolutionary Computing"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"pzsUwDqolt-LIpDVfdB1xLIyaBTqRQMSFhjsAKTNSpE","pdfSize":"2466518"}