{
  "id": "2412.18145",
  "title": "Supervised centrality via sparse network influence regression: an\n  application to the 2021 Henan floods' social network",
  "authors": "Yingying Ma, Wei Lan, Chenlei Leng, Ting Li, Hansheng Wang",
  "authorsParsed": [
    [
      "Ma",
      "Yingying",
      ""
    ],
    [
      "Lan",
      "Wei",
      ""
    ],
    [
      "Leng",
      "Chenlei",
      ""
    ],
    [
      "Li",
      "Ting",
      ""
    ],
    [
      "Wang",
      "Hansheng",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 24 Dec 2024 04:00:44 GMT"
    },
    {
      "version": "v2",
      "created": "Sat, 28 Dec 2024 03:20:24 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735012844000,
  "abstract": "  The social characteristics of players in a social network are closely\nassociated with their network positions and relational importance. Identifying\nthose influential players in a network is of great importance as it helps to\nunderstand how ties are formed, how information is propagated, and, in turn,\ncan guide the dissemination of new information. Motivated by a Sina Weibo\nsocial network analysis of the 2021 Henan Floods, where response variables for\neach Sina Weibo user are available, we propose a new notion of supervised\ncentrality that emphasizes the task-specific nature of a player's centrality.\nTo estimate the supervised centrality and identify important players, we\ndevelop a novel sparse network influence regression by introducing individual\nheterogeneity for each user. To overcome the computational difficulties in\nfitting the model for large social networks, we further develop a\nforward-addition algorithm and show that it can consistently identify a\nsuperset of the influential Sina Weibo users. We apply our method to analyze\nthree responses in the Henan Floods data: the number of comments, reposts, and\nlikes, and obtain meaningful results. A further simulation study corroborates\nthe developed method.\n",
  "subjects": [
    "Statistics/Methodology",
    "Computer Science/Social and Information Networks",
    "Physics/Physics and Society"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "VmlDSAz7a1UfYaeCvdpF-ggdXzfO0aYjn6chEN10Js0",
  "pdfSize": "828887"
}