{
  "id": "2412.17243",
  "title": "\"From Unseen Needs to Classroom Solutions\": Exploring AI Literacy\n  Challenges & Opportunities with Project-based Learning Toolkit in K-12\n  Education",
  "authors": "Hanqi Li, Ruiwei Xiao, Hsuan Nieu, Ying-Jui Tseng and Guanze Liao",
  "authorsParsed": [
    [
      "Li",
      "Hanqi",
      ""
    ],
    [
      "Xiao",
      "Ruiwei",
      ""
    ],
    [
      "Nieu",
      "Hsuan",
      ""
    ],
    [
      "Tseng",
      "Ying-Jui",
      ""
    ],
    [
      "Liao",
      "Guanze",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 03:31:02 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734924662000,
  "abstract": "  As artificial intelligence (AI) becomes increasingly central to various\nfields, there is a growing need to equip K-12 students with AI literacy skills\nthat extend beyond computer science. This paper explores the integration of a\nProject-Based Learning (PBL) AI toolkit into diverse subject areas, aimed at\nhelping educators teach AI concepts more effectively. Through interviews and\nco-design sessions with K-12 teachers, we examined current AI literacy levels\nand how teachers adapt AI tools like the AI Art Lab, AI Music Studio, and AI\nChatbot into their course designs. While teachers appreciated the potential of\nAI tools to foster creativity and critical thinking, they also expressed\nconcerns about the accuracy, trustworthiness, and ethical implications of\nAI-generated content. Our findings reveal the challenges teachers face,\nincluding limited resources, varying student and instructor skill levels, and\nthe need for scalable, adaptable AI tools. This research contributes insights\nthat can inform the development of AI curricula tailored to diverse educational\ncontexts.\n",
  "subjects": [
    "Computer Science/Artificial Intelligence",
    "Computer Science/Computers and Society",
    "Computer Science/Human-Computer Interaction"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "WjRugnHSyXp2JOdKvh3jVDCs1D6Lb8iBm5skIwUFUPk",
  "pdfSize": "3592874"
}