{
  "id": "2412.14925",
  "title": "Automatic Spectral Calibration of Hyperspectral Images:Method, Dataset\n  and Benchmark",
  "authors": "Zhuoran Du, Shaodi You, Cheng Cheng, Shikui Wei",
  "authorsParsed": [
    [
      "Du",
      "Zhuoran",
      ""
    ],
    [
      "You",
      "Shaodi",
      ""
    ],
    [
      "Cheng",
      "Cheng",
      ""
    ],
    [
      "Wei",
      "Shikui",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 15:02:50 GMT"
    },
    {
      "version": "v2",
      "created": "Fri, 20 Dec 2024 14:01:54 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734620570000,
  "abstract": "  Hyperspectral image (HSI) densely samples the world in both the space and\nfrequency domain and therefore is more distinctive than RGB images. Usually,\nHSI needs to be calibrated to minimize the impact of various illumination\nconditions. The traditional way to calibrate HSI utilizes a physical reference,\nwhich involves manual operations, occlusions, and/or limits camera mobility.\nThese limitations inspire this paper to automatically calibrate HSIs using a\nlearning-based method. Towards this goal, a large-scale HSI calibration dataset\nis created, which has 765 high-quality HSI pairs covering diversified natural\nscenes and illuminations. The dataset is further expanded to 7650 pairs by\ncombining with 10 different physically measured illuminations. A spectral\nillumination transformer (SIT) together with an illumination attention module\nis proposed. Extensive benchmarks demonstrate the SoTA performance of the\nproposed SIT. The benchmarks also indicate that low-light conditions are more\nchallenging than normal conditions. The dataset and codes are available\nonline:https://github.com/duranze/Automatic-spectral-calibration-of-HSI\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Electrical Engineering and Systems Science/Image and Video Processing"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "oeUIdeG_9lOLbrLLZDopErpA7YOd-EKbvUrUECpZ_bY",
  "pdfSize": "6969844"
}