{"id":"2412.17114","title":"Decentralized Governance of Autonomous AI Agents","authors":"Tomer Jordi Chaffer, Charles von Goins II, Bayo Okusanya, Dontrail\n  Cotlage, Justin Goldston","authorsParsed":[["Chaffer","Tomer Jordi",""],["Goins","Charles von","II"],["Okusanya","Bayo",""],["Cotlage","Dontrail",""],["Goldston","Justin",""]],"versions":[{"version":"v1","created":"Sun, 22 Dec 2024 18:01:49 GMT"},{"version":"v2","created":"Tue, 24 Dec 2024 16:04:18 GMT"},{"version":"v3","created":"Sat, 11 Jan 2025 16:14:10 GMT"}],"updateDate":"2025-01-14","timestamp":1734890509000,"abstract":"  Autonomous AI agents present transformative opportunities and significant\ngovernance challenges. Existing frameworks, such as the EU AI Act and the NIST\nAI Risk Management Framework, fall short of addressing the complexities of\nthese agents, which are capable of independent decision-making, learning, and\nadaptation. To bridge these gaps, we propose the ETHOS (Ethical Technology and\nHolistic Oversight System) framework, a decentralized governance (DeGov) model\nleveraging Web3 technologies, including blockchain, smart contracts, and\ndecentralized autonomous organizations (DAOs). ETHOS establishes a global\nregistry for AI agents, enabling dynamic risk classification, proportional\noversight, and automated compliance monitoring through tools like soulbound\ntokens and zero-knowledge proofs. Furthermore, the framework incorporates\ndecentralized justice systems for transparent dispute resolution and introduces\nAI specific legal entities to manage limited liability, supported by mandatory\ninsurance to ensure financial accountability and incentivize ethical design. By\nintegrating philosophical principles of rationality, ethical grounding, and\ngoal alignment, ETHOS aims to create a robust research agenda for promoting\ntrust, transparency, and participatory governance. This innovative framework\noffers a scalable and inclusive strategy for regulating AI agents, balancing\ninnovation with ethical responsibility to meet the demands of an AI-driven\nfuture.\n","subjects":["Computer Science/Artificial Intelligence","Computer Science/Emerging Technologies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"c6_d5LJyadoDwQgAvnhPy_yN4G80DAO5NSYCMzu5ml0","pdfSize":"196361"}