{
  "id": "2412.15721",
  "title": "Safe Spaces or Toxic Places? Content Moderation and Social Dynamics of\n  Online Eating Disorder Communities",
  "authors": "Kristina Lerman, Minh Duc Chu, Charles Bickham, Luca Luceri, Emilio\n  Ferrara",
  "authorsParsed": [
    [
      "Lerman",
      "Kristina",
      ""
    ],
    [
      "Chu",
      "Minh Duc",
      ""
    ],
    [
      "Bickham",
      "Charles",
      ""
    ],
    [
      "Luceri",
      "Luca",
      ""
    ],
    [
      "Ferrara",
      "Emilio",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 09:42:54 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734687774000,
  "abstract": "  Social media platforms have become critical spaces for discussing mental\nhealth concerns, including eating disorders. While these platforms can provide\nvaluable support networks, they may also amplify harmful content that glorifies\ndisordered cognition and self-destructive behaviors. While social media\nplatforms have implemented various content moderation strategies, from\nstringent to laissez-faire approaches, we lack a comprehensive understanding of\nhow these different moderation practices interact with user engagement in\nonline communities around these sensitive mental health topics. This study\naddresses this knowledge gap through a comparative analysis of eating disorder\ndiscussions across Twitter/X, Reddit, and TikTok. Our findings reveal that\nwhile users across all platforms engage similarly in expressing concerns and\nseeking support, platforms with weaker moderation (like Twitter/X) enable the\nformation of toxic echo chambers that amplify pro-anorexia rhetoric. These\nresults demonstrate how moderation strategies significantly influence the\ndevelopment and impact of online communities, particularly in contexts\ninvolving mental health and self-harm.\n",
  "subjects": [
    "Computer Science/Social and Information Networks",
    "Computer Science/Computers and Society",
    "Computer Science/Human-Computer Interaction"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "yKLZ2EusROfyeGCiMBec3prGmw1n7m0mC229mRRcE_A",
  "pdfSize": "14199063"
}