{
  "id": "2412.14095",
  "title": "Quantum Optimization for Energy Management: A Coherent Variational\n  Approach",
  "authors": "Farshad Amani, Amin Kargarian",
  "authorsParsed": [
    [
      "Amani",
      "Farshad",
      ""
    ],
    [
      "Kargarian",
      "Amin",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 17:43:51 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734543831000,
  "abstract": "  This paper presents a quantum-enhanced optimization approach for solving\noptimal power flow (OPF) by integrating the interior point method (IPM) with a\ncoherent variational quantum linear solver (CVQLS). The objective is to explore\nthe applicability of quantum computing to power systems optimization and\naddress the associated challenges. A comparative analysis of state-of-the-art\nquantum linear solvers - Harrow-Hassidim-Lloyd (HHL), variational quantum\nlinear solver (VQLS), and CVQLS - revealed that CVQLS is most suitable for OPF\ndue to its stability with ill-conditioned matrices, such as the Hessian in IPM.\nTo ensure high-quality solutions, prevent suboptimal convergence, and avoid the\nbarren plateau problem, we propose a quantum circuit parameter initialization\ntechnique along with a method to guide the IPM along the central path.\nMoreover, we design an ansatz tailored for OPF, optimizing the expressibility\nand trainability of the quantum circuit to ensure efficient convergence and\nrobustness in solving quantum OPF. Various optimizers are also tested for\nquantum circuit parameter optimization, and based on the comparative analysis,\nthe best optimizer is selected. We evaluate our approaches on IEEE 3-, 5-,\n118-, and 300-bus systems, demonstrating their effectiveness in providing\nreliable OPF solutions. Our resource comparison between the power flow and OPF\nmatrices on quantum hardware highlights that OPF needs considerably more\nresources, making its implementation significantly more challenging than in\nprevious studies. Although promising, the application of CVQLS is currently\nconstrained by the limitations of existing quantum hardware, especially for\nlarger power systems. To address this, we use a quantum noise simulator for\ntesting on larger systems.\n",
  "subjects": [
    "Physics/Quantum Physics",
    "Computer Science/Systems and Control",
    "Electrical Engineering and Systems Science/Systems and Control"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "fcISxJsN2oa27XK8UtT788j8FbK1wH6NcVvINVlKAbY",
  "pdfSize": "3327379"
}