{
  "id": "2412.20522",
  "title": "MaskGaussian: Adaptive 3D Gaussian Representation from Probabilistic\n  Masks",
  "authors": "Yifei Liu, Zhihang Zhong, Yifan Zhan, Sheng Xu, Xiao Sun",
  "authorsParsed": [
    [
      "Liu",
      "Yifei",
      ""
    ],
    [
      "Zhong",
      "Zhihang",
      ""
    ],
    [
      "Zhan",
      "Yifan",
      ""
    ],
    [
      "Xu",
      "Sheng",
      ""
    ],
    [
      "Sun",
      "Xiao",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 29 Dec 2024 17:12:16 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735492336000,
  "abstract": "  While 3D Gaussian Splatting (3DGS) has demonstrated remarkable performance in\nnovel view synthesis and real-time rendering, the high memory consumption due\nto the use of millions of Gaussians limits its practicality. To mitigate this\nissue, improvements have been made by pruning unnecessary Gaussians, either\nthrough a hand-crafted criterion or by using learned masks. However, these\nmethods deterministically remove Gaussians based on a snapshot of the pruning\nmoment, leading to sub-optimized reconstruction performance from a long-term\nperspective. To address this issue, we introduce MaskGaussian, which models\nGaussians as probabilistic entities rather than permanently removing them, and\nutilize them according to their probability of existence. To achieve this, we\npropose a masked-rasterization technique that enables unused yet\nprobabilistically existing Gaussians to receive gradients, allowing for dynamic\nassessment of their contribution to the evolving scene and adjustment of their\nprobability of existence. Hence, the importance of Gaussians iteratively\nchanges and the pruned Gaussians are selected diversely. Extensive experiments\ndemonstrate the superiority of the proposed method in achieving better\nrendering quality with fewer Gaussians than previous pruning methods, pruning\nover 60% of Gaussians on average with only a 0.02 PSNR decline. Our code can be\nfound at: https://github.com/kaikai23/MaskGaussian\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "USNfwwa-28ZaSUxRO_PFocDNOSdLe75rOtmWib8Xyfc",
  "pdfSize": "10270226"
}