{
  "id": "2412.15521",
  "title": "Challenges in Forming Millisecond Pulsar-Black Holes from Isolated\n  Binaries",
  "authors": "Camille Liotine, Vicky Kalogera, Jeff J. Andrews, Simone S. Bavera,\n  Max Briel, Tassos Fragos, Seth Gossage, Konstantinos Kovlakas, Matthias U.\n  Kruckow, Kyle A. Rocha, Philipp M. Srivastava, Meng Sun, Elizabeth Teng,\n  Zepei Xing, Emmanouil Zapartas",
  "authorsParsed": [
    [
      "Liotine",
      "Camille",
      ""
    ],
    [
      "Kalogera",
      "Vicky",
      ""
    ],
    [
      "Andrews",
      "Jeff J.",
      ""
    ],
    [
      "Bavera",
      "Simone S.",
      ""
    ],
    [
      "Briel",
      "Max",
      ""
    ],
    [
      "Fragos",
      "Tassos",
      ""
    ],
    [
      "Gossage",
      "Seth",
      ""
    ],
    [
      "Kovlakas",
      "Konstantinos",
      ""
    ],
    [
      "Kruckow",
      "Matthias U.",
      ""
    ],
    [
      "Rocha",
      "Kyle A.",
      ""
    ],
    [
      "Srivastava",
      "Philipp M.",
      ""
    ],
    [
      "Sun",
      "Meng",
      ""
    ],
    [
      "Teng",
      "Elizabeth",
      ""
    ],
    [
      "Xing",
      "Zepei",
      ""
    ],
    [
      "Zapartas",
      "Emmanouil",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 03:20:15 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734664815000,
  "abstract": "  Binaries harboring a millisecond pulsar (MSP) and a black hole (BH) are a key\nobserving target for current and upcoming pulsar surveys. We model the\nformation and evolution of such binaries in isolation at solar metallicity\nusing the next-generation binary population synthesis code POSYDON. We examine\nneutron star (NS)-BH binaries where the NS forms first (labeled NSBH), as the\nNS must be able to spin-up to MSP rotation periods before the BH forms in these\nsystems. We find that NSBHs are very rare and have a birth rate < 1 Myr$^{-1}$\nfor a Milky Way-like galaxy in our typical models. The NSBH birth rate is 2-3\norders of magnitude smaller than that for NS-BHs where the BH forms first\n(labeled BHNS). These rates are also sensitive to model assumptions about the\nsupernova (SN) remnant masses, natal kicks, and common-envelope efficiency. We\nfind that 100% of NSBHs undergo a mass ratio reversal before the first SN and\nup to 64% of NSBHs undergo a double common envelope phase after the mass ratio\nreversal occurs. Most importantly, no NSBH binaries in our populations undergo\na mass transfer phase, either stable or unstable, after the first SN. This\nimplies that there is no possibility of pulsar spin-up via accretion, and thus\nMSP-BH binaries cannot form. Thus, dynamical environments and processes may\nprovide the only formation channels for such MSP-BH binaries.\n",
  "subjects": [
    "Astrophysics/High Energy Astrophysical Phenomena"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "leR2ixrD9YPWC0EddKexLqS8ySEpNZ_-TV8hlbsh58Q",
  "pdfSize": "1002997"
}