{"id":"2412.10425","title":"Active Inference for Self-Organizing Multi-LLM Systems: A Bayesian\n  Thermodynamic Approach to Adaptation","authors":"Rithvik Prakki","authorsParsed":[["Prakki","Rithvik",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 16:34:47 GMT"},{"version":"v2","created":"Mon, 6 Jan 2025 21:24:40 GMT"},{"version":"v3","created":"Thu, 9 Jan 2025 22:46:26 GMT"}],"updateDate":"2025-01-13","timestamp":1733848487000,"abstract":"  This paper introduces a novel approach to creating adaptive language agents\nby integrating active inference with large language models (LLMs). While LLMs\ndemonstrate remarkable capabilities, their reliance on static prompts limits\nadaptation to new information and changing environments. We address this by\nimplementing an active inference framework that acts as a cognitive layer above\nan LLM-based agent, dynamically adjusting prompts and search strategies through\nprincipled information-seeking behavior. Our framework models the environment\nusing three state factors (prompt, search, and information states) with seven\nobservation modalities capturing quality metrics. By framing the agent's\nlearning through the free energy principle, we enable systematic exploration of\nprompt combinations and search strategies. Experimental results demonstrate the\neffectiveness of this approach, with the agent developing accurate models of\nenvironment dynamics evidenced by emergent structure in observation matrices.\nAction selection patterns reveal sophisticated exploration-exploitation\nbehavior, transitioning from initial information-gathering to targeted prompt\ntesting. The integration of thermodynamic principles with language model\ncapabilities provides a principled framework for creating robust, adaptable\nagents, extending active inference beyond traditional low-dimensional control\nproblems to high-dimensional, language-driven environments.\n","subjects":["Computer Science/Computation and Language","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"KFOyavzBMJRUCmX-jLsGhq0_gGf1PElBpHod2Z9SzRA","pdfSize":"2655602"}