{"id":"2412.10424","title":"LLM-as-an-Interviewer: Beyond Static Testing Through Dynamic LLM\n  Evaluation","authors":"Eunsu Kim, Juyoung Suk, Seungone Kim, Niklas Muennighoff, Dongkwan\n  Kim, Alice Oh","authorsParsed":[["Kim","Eunsu",""],["Suk","Juyoung",""],["Kim","Seungone",""],["Muennighoff","Niklas",""],["Kim","Dongkwan",""],["Oh","Alice",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 15:00:32 GMT"},{"version":"v2","created":"Mon, 30 Dec 2024 09:11:50 GMT"}],"updateDate":"2024-12-31","timestamp":1733842832000,"abstract":"  We introduce LLM-as-an-Interviewer, a novel paradigm for evaluating large\nlanguage models (LLMs). This approach leverages multi-turn interactions where\nthe LLM interviewer actively provides feedback on responses and poses follow-up\nquestions to the evaluated LLM. At the start of the interview, the LLM\ninterviewer dynamically modifies datasets to generate initial questions,\nmitigating data contamination. We apply the LLM-as-an-Interviewer framework to\nevaluate six models on the MATH and DepthQA tasks. Our results show that the\nframework effectively provides insights into LLM performance, including the\nquality of initial responses, adaptability to feedback, and ability to address\nfollow-up queries like clarification or additional knowledge requests. The\nframework also addresses key limitations of conventional methods like\nLLM-as-a-Judge, including verbosity bias and inconsistency across runs.\nFinally, we propose the Interview Report, which aggregates insights from the\ninterview process, providing examples and a comprehensive analysis of the LLM's\nstrengths and weaknesses. This report offers a detailed snapshot of the model's\nreal-world applicability. The code for our framework is publicly available at\nhttps://github.com/interview-eval/.\n","subjects":["Computer Science/Computation and Language","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Oi6ty_mw9p3tNDKJkofQffk1-UW9NKX5a6PQDUYL54A","pdfSize":"2793074"}