{"id":"2412.08515","title":"Enhancing Interpretability Through Loss-Defined Classification Objective\n  in Structured Latent Spaces","authors":"Daniel Geissler, Bo Zhou, Mengxi Liu, and Paul Lukowicz","authorsParsed":[["Geissler","Daniel",""],["Zhou","Bo",""],["Liu","Mengxi",""],["Lukowicz","Paul",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 16:25:17 GMT"}],"updateDate":"2024-12-12","timestamp":1733934317000,"abstract":"  Supervised machine learning often operates on the data-driven paradigm,\nwherein internal model parameters are autonomously optimized to converge\npredicted outputs with the ground truth, devoid of explicitly programming rules\nor a priori assumptions. Although data-driven methods have yielded notable\nsuccesses across various benchmark datasets, they inherently treat models as\nopaque entities, thereby limiting their interpretability and yielding a lack of\nexplanatory insights into their decision-making processes. In this work, we\nintroduce Latent Boost, a novel approach that integrates advanced distance\nmetric learning into supervised classification tasks, enhancing both\ninterpretability and training efficiency. Thus during training, the model is\nnot only optimized for classification metrics of the discrete data points but\nalso adheres to the rule that the collective representation zones of each class\nshould be sharply clustered. By leveraging the rich structural insights of\nintermediate model layer latent representations, Latent Boost improves\nclassification interpretability, as demonstrated by higher Silhouette scores,\nwhile accelerating training convergence. These performance and latent\nstructural benefits are achieved with minimum additional cost, making it\nbroadly applicable across various datasets without requiring data-specific\nadjustments. Furthermore, Latent Boost introduces a new paradigm for aligning\nclassification performance with improved model transparency to address the\nchallenges of black-box models.\n","subjects":["Computer Science/Machine Learning","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7nyLLtU4WF4Z_Wc5p9ELa6RaIUhq2ewHdX30v3KpIZQ","pdfSize":"2724627"}