{
  "id": "2412.18025",
  "title": "Collinear Altermagnets and their Landau Theories",
  "authors": "Hana Schiff, Paul McClarty, Jeffrey G. Rau, and Judit Romhanyi",
  "authorsParsed": [
    [
      "Schiff",
      "Hana",
      ""
    ],
    [
      "McClarty",
      "Paul",
      ""
    ],
    [
      "Rau",
      "Jeffrey G.",
      ""
    ],
    [
      "Romhanyi",
      "Judit",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 22:38:47 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1734993527000,
  "abstract": "  Altermagnets exhibit spontaneously spin-split electronic bands in the zero\nspin-orbit coupling (SOC) limit arising from the presence of collinear\ncompensated magnetic order. The distinctive magneto-crystalline symmetries of\naltermagnets ensure that these spin splittings have a characteristic anisotropy\nin crystal momentum space. These systems have attracted a great deal of\ninterest due to their potential for applications in spintronics. In this paper,\nwe provide a general Landau theory that encompasses all three-dimensional\naltermagnets where the magnetic order does not enlarge the unit cell. We\nidentify all crystal structures that admit altermagnetism and then reduce these\nto a relatively small set of distinct possible Landau theories governing such\nsystems. In the zero SOC limit, we determine the possible local multipolar\norders that are tied to the spin splitting of the band structure. We make\nprecise the connection between altermagnetism as defined at zero SOC (\"ideal\"\naltermagnets) and the effects of weak SOC. In particular, we examine which\nresponse functions allowed by symmetry when SOC is present are guaranteed by\nthe spin-orbit free theory, and spell out the distinctive properties of\naltermagnets in comparison with conventional collinear antiferromagnets.\nFinally, we show how these ideas can be applied by considering a number of\naltermagnetic candidate materials.\n",
  "subjects": [
    "Condensed Matter/Strongly Correlated Electrons"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "ZQMmSZfjTZdmaCZalkSakBbjUBPXlriZGLz6JsEqDak",
  "pdfSize": "10466780"
}