{
  "id": "2412.17866",
  "title": "Artificial Intelligence, Scientific Discovery, and Product Innovation",
  "authors": "Aidan Toner-Rodgers",
  "authorsParsed": [
    [
      "Toner-Rodgers",
      "Aidan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 21 Dec 2024 05:38:10 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1734759490000,
  "abstract": "  This paper studies the impact of artificial intelligence on innovation,\nexploiting the randomized introduction of a new materials discovery technology\nto 1,018 scientists in the R&D lab of a large U.S. firm. AI-assisted\nresearchers discover 44% more materials, resulting in a 39% increase in patent\nfilings and a 17% rise in downstream product innovation. These compounds\npossess more novel chemical structures and lead to more radical inventions.\nHowever, the technology has strikingly disparate effects across the\nproductivity distribution: while the bottom third of scientists see little\nbenefit, the output of top researchers nearly doubles. Investigating the\nmechanisms behind these results, I show that AI automates 57% of\n\"idea-generation\" tasks, reallocating researchers to the new task of evaluating\nmodel-produced candidate materials. Top scientists leverage their domain\nknowledge to prioritize promising AI suggestions, while others waste\nsignificant resources testing false positives. Together, these findings\ndemonstrate the potential of AI-augmented research and highlight the\ncomplementarity between algorithms and expertise in the innovative process.\nSurvey evidence reveals that these gains come at a cost, however, as 82% of\nscientists report reduced satisfaction with their work due to decreased\ncreativity and skill underutilization.\n",
  "subjects": [
    "Economics/General Economics",
    "Quantitative Finance/Economics"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "My0GbxBV-E_iI01KjvCuRkXNBEcrQ2F316WWxS4niB0",
  "pdfSize": "1700211"
}