{
  "id": "2412.01246",
  "title": "Class Distance Weighted Cross Entropy Loss for Classification of Disease\n  Severity",
  "authors": "Gorkem Polat,\\\"Umit Mert \\c{C}a\\u{g}lar, Alptekin Temizel",
  "authorsParsed": [
    [
      "Polat",
      "Gorkem",
      ""
    ],
    [
      "Çağlar",
      "Ümit Mert",
      ""
    ],
    [
      "Temizel",
      "Alptekin",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 08:06:14 GMT"
    },
    {
      "version": "v2",
      "created": "Fri, 10 Jan 2025 13:02:07 GMT"
    },
    {
      "version": "v3",
      "created": "Mon, 13 Jan 2025 16:07:46 GMT"
    }
  ],
  "updateDate": "2025-01-14",
  "timestamp": 1733126774000,
  "abstract": "  Assessing disease severity with ordinal classes, where each class reflects\nincreasing severity levels, benefits from loss functions designed for this\nordinal structure. Traditional categorical loss functions, like Cross-Entropy\n(CE), often perform suboptimally in these scenarios. To address this, we\npropose a novel loss function, Class Distance Weighted Cross-Entropy (CDW-CE),\nwhich penalizes misclassifications more severely when the predicted and actual\nclasses are farther apart. We evaluated CDW-CE using various deep\narchitectures, comparing its performance against several categorical and\nordinal loss functions. To assess the quality of latent representations, we\nused t-distributed stochastic neighbor embedding (t-SNE) and uniform manifold\napproximation and projection (UMAP) visualizations, quantified the clustering\nquality using the Silhouette Score, and compared Class Activation Maps (CAM)\ngenerated by models trained with CDW-CE and CE loss. Feedback from domain\nexperts was incorporated to evaluate how well model attention aligns with\nexpert opinion. Our results show that CDW-CE consistently improves performance\nin ordinal image classification tasks. It achieves higher Silhouette Scores,\nindicating better class discrimination capability, and its CAM visualizations\nshow a stronger focus on clinically significant regions, as validated by domain\nexperts. Receiver operator characteristics (ROC) curves and the area under the\ncurve (AUC) scores highlight that CDW-CE outperforms other loss functions,\nincluding prominent ordinal loss functions from the literature.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "wk_nkFXtY03_psUDqZfDF62ZunNLuMbua6Ituns_wjU",
  "pdfSize": "4543140"
}