{"id":"2412.08058","title":"Colossal terahertz emission with ultrafast tunability based on van der\n  Waals ferroelectric NbOI$_2$","authors":"Sujan Subedi, Wenhao Liu, Wuzhang Fang, Carter Fox, Zixin Zhai, Fan\n  Fei, Yuan Ping, Bing Lv, Jun Xiao","authorsParsed":[["Subedi","Sujan",""],["Liu","Wenhao",""],["Fang","Wuzhang",""],["Fox","Carter",""],["Zhai","Zixin",""],["Fei","Fan",""],["Ping","Yuan",""],["Lv","Bing",""],["Xiao","Jun",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 03:01:55 GMT"}],"updateDate":"2025-02-28","timestamp":1733886115000,"abstract":"  Terahertz (THz) technology is critical for quantum material physics,\nbiomedical imaging, ultrafast electronics, and next-generation wireless\ncommunications. However, standing in the way of widespread applications is the\nscarcity of efficient ultrafast THz sources with on-demand fast modulation and\neasy on-chip integration capability. Here we report the discovery of colossal\nTHz emission from a van der Waals (vdW) ferroelectric semiconductor NbOI$_2$.\nUsing THz emission spectroscopy, we observe a THz generation efficiency an\norder of magnitude higher than that of ZnTe, a standard nonlinear crystal for\nultrafast THz generation. We further uncover the underlying generation\nmechanisms associated with its large ferroelectric polarization by studying the\nTHz emission dependence on excitation wavelength, incident polarization and\nfluence. Moreover, we demonstrate the ultrafast coherent amplification and\nannihilation of the THz emission and associated coherent phonon oscillations by\nemploying a double-pump scheme. These findings combined with first-principles\ncalculations, inform new understanding of the THz light-matter interaction in\nemergent vdW ferroelectrics and pave the way to develop high-performance THz\ndevices on them for quantum materials sensing and ultrafast electronics.\n","subjects":["Condensed Matter/Materials Science","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"PipOdVQDdWCZzasGtn_9ydZHNoI1JqvRjOalkRnJPuo","pdfSize":"1883873"}