{"id":"2412.13743","title":"User-Generated Content and Editors in Games: A Comprehensive Survey","authors":"Yuyue Liu, Haihan Duan, Wei Cai","authorsParsed":[["Liu","Yuyue",""],["Duan","Haihan",""],["Cai","Wei",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 11:21:39 GMT"}],"updateDate":"2024-12-19","timestamp":1734520899000,"abstract":"  User-Generated Content (UGC) refers to any form of content, such as posts and\nimages, created by users rather than by professionals. In recent years, UGC has\nbecome an essential part of the evolving video game industry, influencing both\ngame culture and community dynamics. The ability for users to actively\ncontribute to the games they engage with has shifted the landscape of gaming\nfrom a one-directional entertainment experience into a collaborative,\nuser-driven ecosystem. Therefore, this growing trend highlights the urgent need\nfor summarizing the current UGC development in game industry. Our conference\npaper has systematically classified the existing UGC in games and the UGC\neditors separately into four types. However, the previous survey lacks the\ndepth and precision necessary to capture the wide-ranging and increasingly\ncomplex nature of UGC. To this end, as an extension of previous work, this\npaper presents a refined and expanded classification of UGC and UGC editors\nwithin video games, offering a more robust and comprehensive framework with\nrepresentative cases that better reflects the diversity and nuances of\ncontemporary user-generated contributions. Moreover, we provide our insights on\nthe future of UGC, involving game culture, game genre and user creative\ntendencies, artificial intelligence, its potential ethical considerations, and\nrelationship between games, users and communities.\n","subjects":["Computer Science/Multimedia","Computer Science/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"GN2gznaT6p8-DQm2IBK34iVqGWcTYZ5O74YPwzRKWUM","pdfSize":"25887766"}