{"id":"2412.17160","title":"Unveiling the Potential of NOMA: A Journey to Next Generation Multiple\n  Access","authors":"Adeel Ahmed, Wang Xingfu, Ammar Hawbani, Weijie Yuan, Hina Tabassum,\n  Yuanwei Liu, Muhammad Umar Farooq Qaisar, Zhiguo Ding, Naofal Al-Dhahir,\n  Arumugam Nallanathan, Derrick Wing Kwan Ng","authorsParsed":[["Ahmed","Adeel",""],["Xingfu","Wang",""],["Hawbani","Ammar",""],["Yuan","Weijie",""],["Tabassum","Hina",""],["Liu","Yuanwei",""],["Qaisar","Muhammad Umar Farooq",""],["Ding","Zhiguo",""],["Al-Dhahir","Naofal",""],["Nallanathan","Arumugam",""],["Ng","Derrick Wing Kwan",""]],"versions":[{"version":"v1","created":"Sun, 22 Dec 2024 21:01:46 GMT"}],"updateDate":"2024-12-30","timestamp":1734901306000,"abstract":"  Revolutionary sixth-generation wireless communications technologies and\napplications, notably digital twin networks (DTN), connected autonomous\nvehicles (CAVs), space-air-ground integrated networks (SAGINs), zero-touch\nnetworks, industry 5.0, and healthcare 5.0, are driving next-generation\nwireless networks (NGWNs). These technologies generate massive data, requiring\nswift transmission and trillions of device connections, fueling the need for\nsophisticated next-generation multiple access (NGMA) schemes. NGMA enables\nmassive connectivity in the 6G era, optimizing NGWN operations beyond current\nmultiple access (MA) schemes. This survey showcases non-orthogonal multiple\naccess (NOMA) as NGMA's frontrunner, exploring What has NOMA delivered?, What\nis NOMA providing?, and What lies ahead?. We present NOMA variants, fundamental\noperations, and applicability in multi-antenna systems, machine learning,\nreconfigurable intelligent surfaces (RIS), cognitive radio networks (CRN),\nintegrated sensing and communications (ISAC), terahertz networks, and unmanned\naerial vehicles (UAVs). Additionally, we explore NOMA's interplay with\nstate-of-the-art wireless technologies, highlighting its advantages and\ntechnical challenges. Finally, we unveil NOMA research trends in the 6G era and\nprovide design recommendations and future perspectives for NOMA as the leading\nNGMA solution for NGWNs.\n","subjects":["Computer Science/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"y3YEx-PdSIvdnuY_SRHYlHmJjK0iQXZm8iXpOxUK99w","pdfSize":"19651075"}