{"id":"2412.06637","title":"FREYJA: Efficient Join Discovery in Data Lakes","authors":"Marc Maynou, Sergi Nadal, Raquel Panadero, Javier Flores, Oscar\n  Romero, Anna Queralt","authorsParsed":[["Maynou","Marc",""],["Nadal","Sergi",""],["Panadero","Raquel",""],["Flores","Javier",""],["Romero","Oscar",""],["Queralt","Anna",""]],"versions":[{"version":"v1","created":"Mon, 9 Dec 2024 16:32:45 GMT"}],"updateDate":"2024-12-10","timestamp":1733761965000,"abstract":"  Data lakes are massive repositories of raw and heterogeneous data, designed\nto meet the requirements of modern data storage. Nonetheless, this same\nphilosophy increases the complexity of performing discovery tasks to find\nrelevant data for subsequent processing. As a response to these growing\nchallenges, we present FREYJA, a modern data discovery system capable of\neffectively exploring data lakes, aimed at finding candidates to perform joins\nand increase the number of attributes for downstream tasks. More precisely, we\nwant to compute rankings that sort potential joins by their relevance. Modern\nmechanisms apply advanced table representation learning (TRL) techniques to\nyield accurate joins. Yet, this incurs high computational costs when dealing\nwith elevated volumes of data. In contrast to the state-of-the-art, we adopt a\nnovel notion of join quality tailored to data lakes, which leverages syntactic\nmeasurements while achieving accuracy comparable to that of TRL approaches. To\nobtain this metric in a scalable manner we train a general purpose predictive\nmodel. Predictions are based, rather than on large-scale datasets, on data\nprofiles, succinct representations that capture the underlying characteristics\nof the data. Our experiments show that our system, FREYJA, matches the results\nof the state-of-the-art whilst reducing the execution times by several orders\nof magnitude.\n","subjects":["Computer Science/Databases"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ZlEjjCD_fIGJCcjOZLePmMtVkWjhxkLlLvWeDv62JzA","pdfSize":"1074386"}