{
  "id": "2412.20662",
  "title": "Enhancing Table Recognition with Vision LLMs: A Benchmark and\n  Neighbor-Guided Toolchain Reasoner",
  "authors": "Yitong Zhou, Mingyue Cheng, Qingyang Mao, Qi Liu, Feiyang Xu, Xin Li,\n  Enhong Chen",
  "authorsParsed": [
    [
      "Zhou",
      "Yitong",
      ""
    ],
    [
      "Cheng",
      "Mingyue",
      ""
    ],
    [
      "Mao",
      "Qingyang",
      ""
    ],
    [
      "Liu",
      "Qi",
      ""
    ],
    [
      "Xu",
      "Feiyang",
      ""
    ],
    [
      "Li",
      "Xin",
      ""
    ],
    [
      "Chen",
      "Enhong",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 30 Dec 2024 02:40:19 GMT"
    },
    {
      "version": "v2",
      "created": "Fri, 3 Jan 2025 06:22:52 GMT"
    }
  ],
  "updateDate": "2025-01-06",
  "timestamp": 1735526419000,
  "abstract": "  Pre-trained foundation models have recently significantly progressed in\nstructured table understanding and reasoning. However, despite advancements in\nareas such as table semantic understanding and table question answering,\nrecognizing the structure and content of unstructured tables using Vision Large\nLanguage Models (VLLMs) remains under-explored. In this work, we address this\nresearch gap by employing VLLMs in a training-free reasoning paradigm. First,\nwe design a benchmark with various hierarchical dimensions relevant to table\nrecognition. Subsequently, we conduct in-depth evaluations using pre-trained\nVLLMs, finding that low-quality image input is a significant bottleneck in the\nrecognition process. Drawing inspiration from these findings, we propose the\nNeighbor-Guided Toolchain Reasoner (NGTR) framework, which is characterized by\nintegrating multiple lightweight models for low-level visual processing\noperations aimed at mitigating issues with low-quality input images.\nSpecifically, we utilize a neighbor retrieval mechanism to guide the generation\nof multiple tool invocation plans, transferring tool selection experiences from\nsimilar neighbors to the given input, thereby facilitating suitable tool\nselection. Additionally, we introduce a reflection module to supervise the tool\ninvocation process. Extensive experiments on public table recognition datasets\ndemonstrate that our approach significantly enhances the recognition\ncapabilities of the vanilla VLLMs. We believe that the designed benchmark and\nthe proposed NGTR framework could provide an alternative solution in table\nrecognition.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "lKMQBSQj79ux7K6CyQtYPmidUSB3YS8qT0aPTyYI0Bc",
  "pdfSize": "5729081"
}