{
  "id": "2412.03671",
  "title": "Tight Lower Bounds and Improved Convergence in Performative Prediction",
  "authors": "Pedram Khorsandi, Rushil Gupta, Mehrnaz Mofakhami, Simon\n  Lacoste-Julien, Gauthier Gidel",
  "authorsParsed": [
    [
      "Khorsandi",
      "Pedram",
      ""
    ],
    [
      "Gupta",
      "Rushil",
      ""
    ],
    [
      "Mofakhami",
      "Mehrnaz",
      ""
    ],
    [
      "Lacoste-Julien",
      "Simon",
      ""
    ],
    [
      "Gidel",
      "Gauthier",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 19:06:19 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733339179000,
  "abstract": "  Performative prediction is a framework accounting for the shift in the data\ndistribution induced by the prediction of a model deployed in the real world.\nEnsuring rapid convergence to a stable solution where the data distribution\nremains the same after the model deployment is crucial, especially in evolving\nenvironments. This paper extends the Repeated Risk Minimization (RRM) framework\nby utilizing historical datasets from previous retraining snapshots, yielding a\nclass of algorithms that we call Affine Risk Minimizers and enabling\nconvergence to a performatively stable point for a broader class of problems.\nWe introduce a new upper bound for methods that use only the final iteration of\nthe dataset and prove for the first time the tightness of both this new bound\nand the previous existing bounds within the same regime. We also prove that\nutilizing historical datasets can surpass the lower bound for last iterate RRM,\nand empirically observe faster convergence to the stable point on various\nperformative prediction benchmarks. We offer at the same time the first lower\nbound analysis for RRM within the class of Affine Risk Minimizers, quantifying\nthe potential improvements in convergence speed that could be achieved with\nother variants in our framework.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "RRKEQIjZXs0rRu-bH8WsfX_P0w_z8BbG0a3C_QkpP0I",
  "pdfSize": "1630122"
}