{
  "id": "2412.18452",
  "title": "Shoving tubes through shapes gives a sufficient and efficient shape\n  statistic",
  "authors": "Adam Onus, Nina Otter, Renata Turkes",
  "authorsParsed": [
    [
      "Onus",
      "Adam",
      ""
    ],
    [
      "Otter",
      "Nina",
      ""
    ],
    [
      "Turkes",
      "Renata",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 24 Dec 2024 14:22:43 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1735050163000,
  "abstract": "  The Persistent Homology Transform (PHT) was introduced in the field of\nTopological Data Analysis about 10 years ago, and has since been proven to be a\nvery powerful descriptor of Euclidean shapes. The PHT consists of scanning a\nshape from all possible directions $v\\in S^{n-1}$ and then computing the\npersistent homology of sublevel set filtrations of the respective height\nfunctions $h_v$; this results in a sufficient and continuous descriptor of\nEuclidean shapes. We introduce a generalisation of the PHT in which we consider\narbitrary parameter spaces and sublevel sets with respect to any function. In\nparticular, we study transforms, defined on the Grassmannian\n$\\mathbb{A}\\mathbb{G}(m,n)$ of affine subspaces of $\\mathbb{R}^n$, that allow\nto scan a shape by probing it with all possible affine $m$-dimensional\nsubspaces $P\\subset \\mathbb{R}^n$, for fixed dimension $m$, and by computing\npersistent homology of sublevel set filtrations of the function\n$\\mathrm{dist}(\\cdot, P)$ encoding the distance from the flat $P$. We call such\ntransforms \"distance-from-flat\" PHTs. We show that these transforms are\ninjective and continuous and that they provide computational advantages over\nthe classical PHT. In particular, we show that it is enough to compute homology\nonly in degrees up to $m-1$ to obtain injectivity; for $m=1$ this provides a\nvery powerful and computationally advantageous tool for examining shapes, which\nin a previous work by a subset of the authors has proven to significantly\noutperform state-of-the-art neural networks for shape classification tasks.\n",
  "subjects": [
    "Mathematics/Algebraic Topology",
    "Computer Science/Computational Geometry"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "MLdsylboSPNjZVLqf-NXwjq9E0Luhqt29LdX0KgQrds",
  "pdfSize": "7334125"
}