{"id":"2412.04760","title":"'Being there together for health': A Systematic Review on the\n  Feasibility, Effectiveness and Design Considerations of Immersive\n  Collaborative Virtual Environments in Health Applications","authors":"Tohid Zarei (1), Michelle Emery (1), Dimitrios Saredakis (1), Gun A.\n  Lee (1), Ben Stubbs (1), Ancret Szpak (1 and 2) and Tobias Loetscher (1) ((1)\n  University of South Australia, (2) The University of Adelaide)","authorsParsed":[["Zarei","Tohid","","1 and 2"],["Emery","Michelle","","1 and 2"],["Saredakis","Dimitrios","","1 and 2"],["Lee","Gun A.","","1 and 2"],["Stubbs","Ben","","1 and 2"],["Szpak","Ancret","","1 and 2"],["Loetscher","Tobias",""]],"versions":[{"version":"v1","created":"Fri, 6 Dec 2024 03:58:51 GMT"}],"updateDate":"2024-12-09","timestamp":1733457531000,"abstract":"  Effectively using immersive multi-user environments for digital applications\n(via virtual, augmented and mixed reality technologies) beckons the future of\nhealthcare delivery in the metaverse. We aimed to evaluate the feasibility and\neffectiveness of these environments used in health applications, while\nidentifying their design features.\n  We systematically searched MEDLINE, PsycINFO, and Emcare databases for\npeer-reviewed original reports, published in English, without date restrictions\nuntil Aug 30, 2023, and conducted manual citation searching in Feb 2024. All\nstudies using fully immersive extended reality technologies (e.g., head-mounted\ndisplays, smart glasses) while engaging more than one participant in an\nintervention with direct health benefits were included. A qualitative synthesis\nof findings is reported. The quality of research was assessed using JBI\nCritical Checklists. The review was pre-registered on PROSPERO\n(CRD42023479155).\n  Of 2862 identified records, 10 studies were eligible. Included studies were\nmostly conducted with healthy young adults (five studies) and older adults\n(four studies). While they all used different models of Oculus/Meta headsets,\ntheir environments' designs were distinctive and aligned with their objectives.\nFindings indicated varying degrees of positive health outcomes, for engagement\nin rehabilitation, meaningful interactions across distances, positive affect,\ntransformative experiences, mental health therapies, and motor skill learning.\nParticipants reported high usability, motivation, enjoyment, presence and\ncopresence. They also expressed the need for more training time with\ntechnology.\n  Adopting an intentional intervention design, considering factors affecting\npresence and copresence, as well as integrating co-creation of the program with\nparticipants, seems integral to achieving positive health outcomes.\n","subjects":["Computer Science/Human-Computer Interaction","Computer Science/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"AhpFN0nI6mXkWKVMistreawPHLEbNPMLJdQqLWq7Vjc","pdfSize":"1013504"}