{"id":"2412.12575","title":"SIDE: Socially Informed Drought Estimation Toward Understanding Societal\n  Impact Dynamics of Environmental Crisis","authors":"Lanyu Shang, Bozhang Chen, Shiwei Liu, Yang Zhang, Ruohan Zong, Anav\n  Vora, Ximing Cai, Na Wei, Dong Wang","authorsParsed":[["Shang","Lanyu",""],["Chen","Bozhang",""],["Liu","Shiwei",""],["Zhang","Yang",""],["Zong","Ruohan",""],["Vora","Anav",""],["Cai","Ximing",""],["Wei","Na",""],["Wang","Dong",""]],"versions":[{"version":"v1","created":"Tue, 17 Dec 2024 06:11:46 GMT"}],"updateDate":"2024-12-18","timestamp":1734415906000,"abstract":"  Drought has become a critical global threat with significant societal impact.\nExisting drought monitoring solutions primarily focus on assessing drought\nseverity using quantitative measurements, overlooking the diverse societal\nimpact of drought from human-centric perspectives. Motivated by the collective\nintelligence on social media and the computational power of AI, this paper\nstudies a novel problem of socially informed AI-driven drought estimation that\naims to leverage social and news media information to jointly estimate drought\nseverity and its societal impact. Two technical challenges exist: 1) How to\nmodel the implicit temporal dynamics of drought societal impact. 2) How to\ncapture the social-physical interdependence between the physical drought\ncondition and its societal impact. To address these challenges, we develop\nSIDE, a socially informed AI-driven drought estimation framework that\nexplicitly quantifies the societal impact of drought and effectively models the\nsocial-physical interdependency for joint severity-impact estimation.\nExperiments on real-world datasets from California and Texas demonstrate SIDE's\nsuperior performance compared to state-of-the-art baselines in accurately\nestimating drought severity and its societal impact. SIDE offers valuable\ninsights for developing human-centric drought mitigation strategies to foster\nsustainable and resilient communities.\n","subjects":["Computer Science/Social and Information Networks","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"52BUQDfqRBFCAvysjSBHDd30zkPwn0bhSeJ9ZTE_C0M","pdfSize":"4660105"}