{
  "id": "2412.10343",
  "title": "Accretion Disc-Jet Decomposition from the Optical-Near Infrared\n  Monitoring of Fermi Blazars",
  "authors": "Garima Rajguru (Clemson U., Presidency U. Kolkata) and Ritaban\n  Chatterjee (Presidency U. Kolkata)",
  "authorsParsed": [
    [
      "Rajguru",
      "Garima",
      "",
      "Clemson U., Presidency U. Kolkata"
    ],
    [
      "Chatterjee",
      "Ritaban",
      "",
      "Presidency U. Kolkata"
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 18:40:25 GMT"
    }
  ],
  "updateDate": "2024-12-16",
  "timestamp": 1734115225000,
  "abstract": "  We study the variability of the thermal (accretion disc) and non-thermal\n(jet) emission of thirteen flat spectrum radio quasars in the optical and near\ninfrared (OIR) regime using light curves spanning years with an average\nsampling of three observations per week. We fit a combination of a blackbody\nand a power-law function to the OIR data, in the blazar rest frame, to extract\nthe corresponding thermal (disc) and non-thermal (jet) components from the\ntotal flux. We carry out this analysis for the entire duration of the light\ncurves to obtain the variation of the disc and jet components over years.\nReliability of our fits have been affirmed by successfully retrieving accurate\nparameters by employing our method to simulated data and by comparing our\nresults with published disc luminosity obtained by other methods for a few\nwell-observed blazars. In blazars, the thermal (disc) emission is difficult to\nextract because the relativistically beamed radiation of the jet dominates at\nall wavelengths. By employing this method, the disc emission in blazars may be\nestimated directly from photometric data at OIR bands instead of indirect\nmethods, such as, inferring it from the emission line luminosities. We find\nthat the variability of the disc and jet emission obtained by the above method\nare strongly correlated in most cases.\n",
  "subjects": [
    "Astrophysics/High Energy Astrophysical Phenomena"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "y7vC1bJcWQV88Ym0QH3rNEdiHTCh6BSW52pTUzhslAI",
  "pdfSize": "2440363"
}