{
  "id": "2412.06753",
  "title": "InstantRestore: Single-Step Personalized Face Restoration with\n  Shared-Image Attention",
  "authors": "Howard Zhang, Yuval Alaluf, Sizhuo Ma, Achuta Kadambi, Jian Wang, Kfir\n  Aberman",
  "authorsParsed": [
    [
      "Zhang",
      "Howard",
      ""
    ],
    [
      "Alaluf",
      "Yuval",
      ""
    ],
    [
      "Ma",
      "Sizhuo",
      ""
    ],
    [
      "Kadambi",
      "Achuta",
      ""
    ],
    [
      "Wang",
      "Jian",
      ""
    ],
    [
      "Aberman",
      "Kfir",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 18:43:46 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733769826000,
  "abstract": "  Face image restoration aims to enhance degraded facial images while\naddressing challenges such as diverse degradation types, real-time processing\ndemands, and, most crucially, the preservation of identity-specific features.\nExisting methods often struggle with slow processing times and suboptimal\nrestoration, especially under severe degradation, failing to accurately\nreconstruct finer-level identity details. To address these issues, we introduce\nInstantRestore, a novel framework that leverages a single-step image diffusion\nmodel and an attention-sharing mechanism for fast and personalized face\nrestoration. Additionally, InstantRestore incorporates a novel landmark\nattention loss, aligning key facial landmarks to refine the attention maps,\nenhancing identity preservation. At inference time, given a degraded input and\na small (~4) set of reference images, InstantRestore performs a single forward\npass through the network to achieve near real-time performance. Unlike prior\napproaches that rely on full diffusion processes or per-identity model tuning,\nInstantRestore offers a scalable solution suitable for large-scale\napplications. Extensive experiments demonstrate that InstantRestore outperforms\nexisting methods in quality and speed, making it an appealing choice for\nidentity-preserving face restoration.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "YbnUljwq-4DrpRqjH3aAa-j399pPR0mDvuWnwC7y8oA",
  "pdfSize": "20899687"
}