{"id":"2412.12474","title":"Study of Satellite Plane Structure Characteristics Based on TNG50\n  Simulations: A Comparative Analysis from Plane to Non-Plane Structures","authors":"Hu Caiyu, Tang Lin","authorsParsed":[["Caiyu","Hu",""],["Lin","Tang",""]],"versions":[{"version":"v1","created":"Tue, 17 Dec 2024 02:16:06 GMT"}],"updateDate":"2024-12-18","timestamp":1734401766000,"abstract":"  In recent years, multiple plane structures of satellite galaxies have been\nidentified in the nearby universe, although their formation mechanisms remain\nunclear. In this work, we employ the TNG50-1 numerical simulation to classify\nsatellite systems into plane and non-plane structures, based on their geometric\nand dynamical properties. We focus on comparing the characteristics of these\nplane and non-plane structures. The plane structures in TNG50-1 exhibit a mean\nheight of 5.24 kpc, with most of them found in galaxy groups with intermediate\nhalo virial masses within the narrow range of $10^{11.5}$ to $10^{12.5}$\n$M_\\odot$. Statistical analyses reveal that plane structures of satellite\ngalaxies constitute approximately 11.30% in TNG50-1, with this proportion\nincreasing to 27.11% in TNG100-1, aligning closely with previous observations.\nAdditionally, central galaxies in clusters and groups hosting co-rotating plane\nstructures are intermediate massive and slightly metal-poorer than those in\nnon-plane structures. Significant difference are found between in-plane and\nout-of-plane satellite galaxies, suggesting that in-plane satellites exhibit\nslightly longer formation times, and more active interstellar matter cycles.\nThe satellites within these plane structures in TNG50-1 exhibit similar radial\ndistributions with observations, but are fainter and more massive than those in\nobservational plane structures, due to the over- or under-estimation of galaxy\nproperties in simulations. Our analysis also shows that the satellite plane\nstructures might be effected by some low- or high-mass galaxies temporarily\nentered the plane structures due to the gravitational potential of the clusters\nand groups after the plane structures had formed.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"DXKRtC_39KW4t0wvYze3f2dUwGeue6TEDhhtXXyLozk","pdfSize":"6469923"}