{"id":"2412.18442","title":"SoK: On the Offensive Potential of AI","authors":"Saskia Laura Schr\\\"oer, Giovanni Apruzzese, Soheil Human, Pavel\n  Laskov, Hyrum S. Anderson, Edward W. N. Bernroider, Aurore Fass, Ben Nassi,\n  Vera Rimmer, Fabio Roli, Samer Salam, Ashley Shen, Ali Sunyaev, Tim\n  Wadhwa-Brown, Isabel Wagner, Gang Wang","authorsParsed":[["Schröer","Saskia Laura",""],["Apruzzese","Giovanni",""],["Human","Soheil",""],["Laskov","Pavel",""],["Anderson","Hyrum S.",""],["Bernroider","Edward W. N.",""],["Fass","Aurore",""],["Nassi","Ben",""],["Rimmer","Vera",""],["Roli","Fabio",""],["Salam","Samer",""],["Shen","Ashley",""],["Sunyaev","Ali",""],["Wadhwa-Brown","Tim",""],["Wagner","Isabel",""],["Wang","Gang",""]],"versions":[{"version":"v1","created":"Tue, 24 Dec 2024 14:02:44 GMT"},{"version":"v2","created":"Wed, 25 Dec 2024 11:05:54 GMT"},{"version":"v3","created":"Thu, 23 Jan 2025 13:27:12 GMT"},{"version":"v4","created":"Fri, 24 Jan 2025 11:39:32 GMT"}],"updateDate":"2025-01-27","timestamp":1735048964000,"abstract":"  Our society increasingly benefits from Artificial Intelligence (AI).\nUnfortunately, more and more evidence shows that AI is also used for offensive\npurposes. Prior works have revealed various examples of use cases in which the\ndeployment of AI can lead to violation of security and privacy objectives. No\nextant work, however, has been able to draw a holistic picture of the offensive\npotential of AI. In this SoK paper we seek to lay the ground for a systematic\nanalysis of the heterogeneous capabilities of offensive AI. In particular we\n(i) account for AI risks to both humans and systems while (ii) consolidating\nand distilling knowledge from academic literature, expert opinions, industrial\nvenues, as well as laypeople -- all of which being valuable sources of\ninformation on offensive AI.\n  To enable alignment of such diverse sources of knowledge, we devise a common\nset of criteria reflecting essential technological factors related to offensive\nAI. With the help of such criteria, we systematically analyze: 95 research\npapers; 38 InfoSec briefings (from, e.g., BlackHat); the responses of a user\nstudy (N=549) entailing individuals with diverse backgrounds and expertise; and\nthe opinion of 12 experts. Our contributions not only reveal concerning ways\n(some of which overlooked by prior work) in which AI can be offensively used\ntoday, but also represent a foothold to address this threat in the years to\ncome.\n","subjects":["Computer Science/Cryptography and Security","Computer Science/Artificial Intelligence","Computer Science/Computers and Society","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"z625MXVYPMZP7Ppq-LxmlbY4SVhHPMqqSvvJgeuPuLY","pdfSize":"5984587"}