{
  "id": "2412.19767",
  "title": "On Universally Free First-Order Extensions of Belnap-Dunn's Four-Valued\n  Logic and Nelson's Paraconsistent Logic N4",
  "authors": "Henrique Antunes and Abilio Rodrigues",
  "authorsParsed": [
    [
      "Antunes",
      "Henrique",
      ""
    ],
    [
      "Rodrigues",
      "Abilio",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 27 Dec 2024 17:57:18 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735322238000,
  "abstract": "  The aim of this paper is to introduce the logics FFDE and FN4, which are\nuniversally free versions of Belnap-Dunn's four-valued logic, also known as the\nlogic of first-degree entailment (FDE), and Nelson's paraconsistent logic QN4\n(N-). Both FDE and QN4 are suitable to be interpreted as information-based\nlogics, that is, logics that are capable of representing the deductive behavior\nof possibly inconsistent and incomplete information in a database. Like QN4 and\nsome non-free first-order extensions of FDE, FFDE and FN4 are endowed with\nKripke-style variable domain semantics, which allows representing the dynamic\naspect of information processing, that is, how a database receives new\ninformation over time, including information about new individuals. We argue,\nhowever, that FFDE and FN4 can better represent the development of inconsistent\nand incomplete information states (i.e., configurations of a database) over\ntime than their non-free versions. First, because they allow for empty domains,\nwhich corresponds to the idea that a database may acknowledge no individual at\nall at an early stage of its development. Second, because they allow for empty\nnames, which get interpreted as information about new individuals is inserted\ninto the database. Also, both systems include an identity predicate that is\ninterpreted along the same lines of the other logical operators, viz., in terms\nof independent positive and negative rules.\n",
  "subjects": [
    "Mathematics/Logic"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "SNlXba-B_lxdqV3Kk0SaLOLqKNMV59NaCEAkp_5-nLA",
  "pdfSize": "330824"
}