{"id":"2412.00584","title":"Dynamics of a particle in the double-slit experiment with measurement","authors":"Alexey A. Kryukov","authorsParsed":[["Kryukov","Alexey A.",""]],"versions":[{"version":"v1","created":"Sat, 30 Nov 2024 20:48:56 GMT"}],"updateDate":"2024-12-03","timestamp":1732999736000,"abstract":"  Spontaneous collapse models use non-linear stochastic modifications of the\nSchroedinger equation to suppress superpositions of eigenstates of the measured\nobservable and drive the state to an eigenstate. It was recently demonstrated\nthat the Born rule for transition probabilities can be modeled using the linear\nSchroedinger equation with a Hamiltonian represented by a random matrix from\nthe Gaussian unitary ensemble. The matrices representing the Hamiltonian at\ndifferent time points throughout the observation period are assumed to be\nindependent. Instead of suppressing superpositions, such Schroedinger evolution\nmakes the state perform an isotropic random walk on the projective space of\nstates. The relative frequency of reaching different eigenstates of an\narbitrary observable in the random walk is shown to satisfy the Born rule.\nHere, we apply this methodology to investigate the behavior of a particle in\nthe context of the double-slit experiment with measurement. Our analysis shows\nthat, in this basic case, the evolution of the particle's state can be\neffectively captured through a random walk on a two-dimensional submanifold of\nthe state space. This random walk reproduces the Born rule for the probability\nof finding the particle near the slits, conditioned on its arrival at one of\nthem. To ensure that this condition is satisfied, we introduce a drift term\nrepresenting a change in the variance of the position observable for the state.\nA drift-free model, based on equivalence classes of states indistinguishable by\nthe detector, is also considered. The resulting random walk, with or without\ndrift, serves as a suitable model for describing the transition from the\ninitial state to an eigenstate of the measured observable in the experiment,\noffering new insights into its potential underlying mechanisms.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"wUu9eRJDD6ygx47ka3z9ZAeEvNzzM0Bm0_j8A1YKlN8","pdfSize":"517175"}