{
  "id": "2412.04296",
  "title": "Structure-Aware Stylized Image Synthesis for Robust Medical Image\n  Segmentation",
  "authors": "Jie Bao, Zhixin Zhou, Wen Jung Li, Rui Luo",
  "authorsParsed": [
    [
      "Bao",
      "Jie",
      ""
    ],
    [
      "Zhou",
      "Zhixin",
      ""
    ],
    [
      "Li",
      "Wen Jung",
      ""
    ],
    [
      "Luo",
      "Rui",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 16:15:32 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733415332000,
  "abstract": "  Accurate medical image segmentation is essential for effective diagnosis and\ntreatment planning but is often challenged by domain shifts caused by\nvariations in imaging devices, acquisition conditions, and patient-specific\nattributes. Traditional domain generalization methods typically require\ninclusion of parts of the test domain within the training set, which is not\nalways feasible in clinical settings with limited diverse data. Additionally,\nalthough diffusion models have demonstrated strong capabilities in image\ngeneration and style transfer, they often fail to preserve the critical\nstructural information necessary for precise medical analysis. To address these\nissues, we propose a novel medical image segmentation method that combines\ndiffusion models and Structure-Preserving Network for structure-aware one-shot\nimage stylization. Our approach effectively mitigates domain shifts by\ntransforming images from various sources into a consistent style while\nmaintaining the location, size, and shape of lesions. This ensures robust and\naccurate segmentation even when the target domain is absent from the training\ndata. Experimental evaluations on colonoscopy polyp segmentation and skin\nlesion segmentation datasets show that our method enhances the robustness and\naccuracy of segmentation models, achieving superior performance metrics\ncompared to baseline models without style transfer. This structure-aware\nstylization framework offers a practical solution for improving medical image\nsegmentation across diverse domains, facilitating more reliable clinical\ndiagnoses.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Image and Video Processing",
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "662cyEZP8NltN8cfiDvbg-CIMH7M5xXJFg8wbJTwydw",
  "pdfSize": "1758965"
}