{
  "id": "2412.12883",
  "title": "A Comparative Study of Pruning Methods in Transformer-based Time Series\n  Forecasting",
  "authors": "Nicholas Kiefer, Arvid Weyrauch, Muhammed \\\"Oz, Achim Streit, Markus\n  G\\\"otz, Charlotte Debus",
  "authorsParsed": [
    [
      "Kiefer",
      "Nicholas",
      ""
    ],
    [
      "Weyrauch",
      "Arvid",
      ""
    ],
    [
      "Öz",
      "Muhammed",
      ""
    ],
    [
      "Streit",
      "Achim",
      ""
    ],
    [
      "Götz",
      "Markus",
      ""
    ],
    [
      "Debus",
      "Charlotte",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 13:07:31 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734440851000,
  "abstract": "  The current landscape in time-series forecasting is dominated by\nTransformer-based models. Their high parameter count and corresponding demand\nin computational resources pose a challenge to real-world deployment,\nespecially for commercial and scientific applications with low-power embedded\ndevices. Pruning is an established approach to reduce neural network parameter\ncount and save compute. However, the implications and benefits of pruning\nTransformer-based models for time series forecasting are largely unknown. To\nclose this gap, we provide a comparative benchmark study by evaluating\nunstructured and structured pruning on various state-of-the-art multivariate\ntime series models. We study the effects of these pruning strategies on model\npredictive performance and computational aspects like model size, operations,\nand inference time. Our results show that certain models can be pruned even up\nto high sparsity levels, outperforming their dense counterpart. However,\nfine-tuning pruned models is necessary. Furthermore, we demonstrate that even\nwith corresponding hardware and software support, structured pruning is unable\nto provide significant time savings.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "hV4QwC2mgUdFGcJ1REWq8_7VqZ_hcGcWIrjk1eSzqis",
  "pdfSize": "852945"
}