{
  "id": "2412.07581",
  "title": "Physics-Based Simulation of the 2013 April 11 Solar Energetic Particle\n  Event",
  "authors": "Weihao Liu, Igor V. Sokolov, Lulu Zhao, Tamas I. Gombosi, Nishtha\n  Sachdeva, Xiaohang Chen, G\\'abor T\\'oth, David Lario, Ward B. Manchester IV,\n  Kathryn Whitman, Christina M. S. Cohen, Alessandro Bruno, M. Leila Mays,\n  Hazel M. Bain",
  "authorsParsed": [
    [
      "Liu",
      "Weihao",
      ""
    ],
    [
      "Sokolov",
      "Igor V.",
      ""
    ],
    [
      "Zhao",
      "Lulu",
      ""
    ],
    [
      "Gombosi",
      "Tamas I.",
      ""
    ],
    [
      "Sachdeva",
      "Nishtha",
      ""
    ],
    [
      "Chen",
      "Xiaohang",
      ""
    ],
    [
      "Tóth",
      "Gábor",
      ""
    ],
    [
      "Lario",
      "David",
      ""
    ],
    [
      "Manchester",
      "Ward B.",
      "IV"
    ],
    [
      "Whitman",
      "Kathryn",
      ""
    ],
    [
      "Cohen",
      "Christina M. S.",
      ""
    ],
    [
      "Bruno",
      "Alessandro",
      ""
    ],
    [
      "Mays",
      "M. Leila",
      ""
    ],
    [
      "Bain",
      "Hazel M.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 15:16:12 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 28 Jan 2025 22:26:21 GMT"
    }
  ],
  "updateDate": "2025-01-30",
  "timestamp": 1733843772000,
  "abstract": "  Solar energetic particles (SEPs) can pose hazardous radiation risks to both\nhumans and spacecraft electronics in space. Numerical modeling based on first\nprinciples offers valuable insights into the underlying physics of SEPs and\nprovides synthetic observables for SEPs at any time and location in the inner\nheliosphere. In this work, we present a numerical scheme, which conserves the\nnumber of particles based on integral relations for Poisson brackets\n\\citep{sokolov2023high}, to solve the kinetic equation for particle\nacceleration and transport processes. We implement this scheme within the Space\nWeather Modeling Framework, developed at the University of Michigan. In\naddition, we develop a new shock-capturing tool to study the coronal mass\nejection-driven shock originating from the low solar corona. These\nmethodological advancements are applied to conduct a comprehensive study of a\nhistorical SEP event on April 11, 2013. Multi-spacecraft observations,\nincluding SOHO, SDO, GOES and ACE near Earth, and STEREO-A/B, are used for\nmodel--data comparison and validation. We show synthetic observables, including\nextreme ultraviolet and white-light images, proton time--intensity profiles,\nand energy spectra, and discuss their differences and probable explanations\ncompared to observations. Our simulation results demonstrate the application of\nthe Poisson bracket scheme with a particle solver to simulating a historical\nSEP event. We also show the capability of extracting the complex shock surface\nusing our shock-capturing tool and understand how the complex shock surface\naffects the particle acceleration process.\n",
  "subjects": [
    "Astrophysics/Solar and Stellar Astrophysics",
    "Physics/Space Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "iBE94T9KzxcEIM1kWbewoF9v3krqSU4pgJY2RhGQfA8",
  "pdfSize": "20467840"
}