{"id":"2412.15190","title":"EarthDial: Turning Multi-sensory Earth Observations to Interactive\n  Dialogues","authors":"Sagar Soni, Akshay Dudhane, Hiyam Debary, Mustansar Fiaz, Muhammad\n  Akhtar Munir, Muhammad Sohail Danish, Paolo Fraccaro, Campbell D Watson,\n  Levente J Klein, Fahad Shahbaz Khan, Salman Khan","authorsParsed":[["Soni","Sagar",""],["Dudhane","Akshay",""],["Debary","Hiyam",""],["Fiaz","Mustansar",""],["Munir","Muhammad Akhtar",""],["Danish","Muhammad Sohail",""],["Fraccaro","Paolo",""],["Watson","Campbell D",""],["Klein","Levente J",""],["Khan","Fahad Shahbaz",""],["Khan","Salman",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 18:57:13 GMT"}],"updateDate":"2024-12-20","timestamp":1734634633000,"abstract":"  Automated analysis of vast Earth observation data via interactive\nVision-Language Models (VLMs) can unlock new opportunities for environmental\nmonitoring, disaster response, and resource management. Existing generic VLMs\ndo not perform well on Remote Sensing data, while the recent Geo-spatial VLMs\nremain restricted to a fixed resolution and few sensor modalities. In this\npaper, we introduce EarthDial, a conversational assistant specifically designed\nfor Earth Observation (EO) data, transforming complex, multi-sensory Earth\nobservations into interactive, natural language dialogues. EarthDial supports\nmulti-spectral, multi-temporal, and multi-resolution imagery, enabling a wide\nrange of remote sensing tasks, including classification, detection, captioning,\nquestion answering, visual reasoning, and visual grounding. To achieve this, we\nintroduce an extensive instruction tuning dataset comprising over 11.11M\ninstruction pairs covering RGB, Synthetic Aperture Radar (SAR), and\nmultispectral modalities such as Near-Infrared (NIR) and infrared. Furthermore,\nEarthDial handles bi-temporal and multi-temporal sequence analysis for\napplications like change detection. Our extensive experimental results on 37\ndownstream applications demonstrate that EarthDial outperforms existing generic\nand domain-specific models, achieving better generalization across various EO\ntasks.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"1yNvJEWRrNyRqMfF_rUoALtUaM5kZ5xMnRJT6fdjSfo","pdfSize":"5011331"}