{
  "id": "2412.00741",
  "title": "Overview of NR Enhancements for Extended Reality (XR) in 3GPP\n  5G-Advanced",
  "authors": "Margarita Gapeyenko, Stefano Paris, Markus Isomaki, Boyan Yanakiev,\n  Abolfazl Amiri, Benoist S\\'ebire, Jorma Kaikkonen, Chunli Wu, Klaus I.\n  Pedersen",
  "authorsParsed": [
    [
      "Gapeyenko",
      "Margarita",
      ""
    ],
    [
      "Paris",
      "Stefano",
      ""
    ],
    [
      "Isomaki",
      "Markus",
      ""
    ],
    [
      "Yanakiev",
      "Boyan",
      ""
    ],
    [
      "Amiri",
      "Abolfazl",
      ""
    ],
    [
      "Sébire",
      "Benoist",
      ""
    ],
    [
      "Kaikkonen",
      "Jorma",
      ""
    ],
    [
      "Wu",
      "Chunli",
      ""
    ],
    [
      "Pedersen",
      "Klaus I.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 1 Dec 2024 09:21:50 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733044910000,
  "abstract": "  Extended reality (XR) is unlocking numerous possibilities and continues\nattracting individuals and larger groups across different business sectors.\nWith Virtual reality (VR), Augmented reality (AR), or Mixed reality (MR) it is\npossible to improve the way we access, deliver and exchange information in\neducation, health care, entertainment, and many other aspects of our daily\nlives. However, to fully exploit the potential of XR, it is important to\nprovide reliable, fast and secure wireless connectivity to the users of XR and\nthat requires refining existing solutions and tailoring those to support XR\nservices. This article presents a tutorial on 3GPP 5G-Advanced Release 18 XR\nactivities, summarizing physical as well as higher layer enhancements\nintroduced for New Radio considering the specifics of XR. In addition, we also\ndescribe enhancements across 5G system architecture that impacted radio access\nnetwork. Furthermore, the paper provides system-level simulation results for\nseveral Release 18 enhancements to show their benefits in terms of XR capacity\nand power saving gains. Finally, it concludes with an overview of future work\nin Release 19 that continues developing features to support XR services.\n",
  "subjects": [
    "Computer Science/Networking and Internet Architecture"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "wpqW8QQpbSSQtd5BTFrC4JrspGA4DdthEzpPo2n4SFA",
  "pdfSize": "18464867"
}