{
  "id": "2412.11389",
  "title": "Early-time millimeter observations of the nearby Type II SN 2024ggi",
  "authors": "Maokai Hu, Yiping Ao, Yi Yang, Lei Hu, Fulin Li, Lifan Wang, Xiaofeng\n  Wang",
  "authorsParsed": [
    [
      "Hu",
      "Maokai",
      ""
    ],
    [
      "Ao",
      "Yiping",
      ""
    ],
    [
      "Yang",
      "Yi",
      ""
    ],
    [
      "Hu",
      "Lei",
      ""
    ],
    [
      "Li",
      "Fulin",
      ""
    ],
    [
      "Wang",
      "Lifan",
      ""
    ],
    [
      "Wang",
      "Xiaofeng",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 02:36:47 GMT"
    },
    {
      "version": "v2",
      "created": "Sat, 28 Dec 2024 02:10:03 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1734316607000,
  "abstract": "  The short-lived ionized emission lines in early spectroscopy of the nearby\ntype II supernova SN 2024ggi signify the presence of dense circumstellar matter\n(CSM) close to its progenitor star. We proposed the Atacama Large\nMillimeter/submillimeter Array (ALMA) observations by its Director's\nDiscretionary Time program to catch the potential synchrotron radiation\nassociated with the ejecta-CSM interaction. Multi-epoch observations were\nconducted using ALMA band 6 at +8, +13, and +17 days after the discovery. The\ndata show non-detections at the position of SN 2024ggi with a 3sigma upper\nlimit of less than 0.15 mJy, corresponding to a luminosity of approximately\n8*10^24 erg/s/Hz. In this paper, we leverage the non-detections to place\nconstraints on the properties of CSM surrounding SN 2024ggi. We investigate\nboth the Wind and Eruptive models for the radial distribution of CSM, assuming\na constant mass-loss rate in the Wind model and a distance-variant mass-loss\nrate in the Eruptive model. The derived CSM distribution for the Wind model\ndoes not align with the early-time spectral features, while the ALMA\nobservations suggest a mass-loss rate of ~ 5*10^-3 Msun/year for the Eruptive\nmodel. Conducting multi-epoch millimeter/submillimeter observations shortly\nafter the explosion, with a cadence of a few days, could offer a promising\nopportunity to capture the observable signature of the Eruptive model.\n",
  "subjects": [
    "Astrophysics/Solar and Stellar Astrophysics",
    "Astrophysics/Astrophysics of Galaxies",
    "Astrophysics/High Energy Astrophysical Phenomena"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "E__6GPWzmtTQy1Y0N4zZ-Jk_nqHmGjZ1P7ksPCewIhc",
  "pdfSize": "1193788"
}