{
  "id": "2412.05532",
  "title": "Enhancing Webshell Detection With Deep Learning-Powered Methods",
  "authors": "Ha L. Viet, On V. Phung, Hoa N. Nguyen",
  "authorsParsed": [
    [
      "Viet",
      "Ha L.",
      ""
    ],
    [
      "Phung",
      "On V.",
      ""
    ],
    [
      "Nguyen",
      "Hoa N.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 7 Dec 2024 04:26:36 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733545596000,
  "abstract": "  Webshell attacks are becoming more common, requiring robust detection\nmechanisms to protect web applications. The dissertation clearly states two\nresearch directions: scanning web application source code and analyzing HTTP\ntraffic to detect webshells. First, the dissertation proposes ASAF, an advanced\nDL-Powered Source-Code Scanning Framework that uses signature-based methods and\ndeep learning algorithms to detect known and unknown webshells. We designed the\nframework to enable programming language-specific detection models. The\ndissertation used PHP for interpreted language and ASP.NET for compiled\nlanguage to build a complete ASAF-based model for experimentation and\ncomparison with other research results to prove its efficacy.\n  Second, the dissertation introduces a deep neural network that detects\nwebshells using real-time HTTP traffic analysis of web applications. The study\nproposes an algorithm to improve the deep learning model's loss function to\naddress data imbalance. We tested and compared the model to other studies on\nthe CSE-CIC-IDS2018 dataset to prove its efficacy. We integrated the model with\nNetIDPS to improve webshell identification. Automatically blacklist attack\nsource IPs and block URIs querying webshells on the web server to prevent these\nattacks.\n",
  "subjects": [
    "Computer Science/Cryptography and Security"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "sIAMtM2Dc19pZHym_z9_Hg_qWww_FJKCanAbAnbLVLU",
  "pdfSize": "4171410"
}