{
  "id": "2412.16042",
  "title": "Twist-tuned quantum criticality in moir\\'e bilayer graphene",
  "authors": "Jan Biedermann, Lukas Janssen",
  "authorsParsed": [
    [
      "Biedermann",
      "Jan",
      ""
    ],
    [
      "Janssen",
      "Lukas",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 16:44:14 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 25 Feb 2025 13:39:46 GMT"
    }
  ],
  "updateDate": "2025-02-26",
  "timestamp": 1734713054000,
  "abstract": "  We argue that moir\\'e bilayer graphene at charge neutrality hosts a\ncontinuous semimetal-to-insulator quantum phase transition that can be accessed\nexperimentally by tuning the twist angle between the two layers. For small\ntwist angles near the first magic angle, the system realizes a Kramers\nintervalley-coherent insulator, characterized by circulating currents and\nspontaneously broken time reversal and U(1) valley symmetries. For larger twist\nangles above a critical value, the spectrum remains gapless down to the lowest\ntemperatures, with a fully symmetric Dirac semimetal ground state. Using\nself-consistent Hartree-Fock theory applied to a realistic model of twisted\nbilayer graphene, based on the Bistritzer-MacDonald Hamiltonian augmented by\nscreened Coulomb interactions, we find that the twist-tuned quantum phase\ntransition is continuous. We argue that the quantum critical behavior belongs\nto the relativistic Gross-Neveu-XY universality class, and we characterize it\nthrough an effective field theory analysis. Our theoretical predictions can be\ndirectly tested using current experimental setups incorporating the recently\ndeveloped quantum twisting microscope.\n",
  "subjects": [
    "Condensed Matter/Mesoscale and Nanoscale Physics",
    "Condensed Matter/Strongly Correlated Electrons",
    "Physics/High Energy Physics - Theory"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "Ss5YHtAiBYBUmLdfSsHkVRbAZd6ZYpeHordp_56He7Q",
  "pdfSize": "1395829"
}