{"id":"2412.08687","title":"VisionArena: 230K Real World User-VLM Conversations with Preference\n  Labels","authors":"Christopher Chou, Lisa Dunlap, Koki Mashita, Krishna Mandal, Trevor\n  Darrell, Ion Stoica, Joseph E. Gonzalez, Wei-Lin Chiang","authorsParsed":[["Chou","Christopher",""],["Dunlap","Lisa",""],["Mashita","Koki",""],["Mandal","Krishna",""],["Darrell","Trevor",""],["Stoica","Ion",""],["Gonzalez","Joseph E.",""],["Chiang","Wei-Lin",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 18:59:46 GMT"},{"version":"v2","created":"Fri, 13 Dec 2024 23:12:23 GMT"}],"updateDate":"2024-12-17","timestamp":1733943586000,"abstract":"  With the growing adoption and capabilities of vision-language models (VLMs)\ncomes the need for benchmarks that capture authentic user-VLM interactions. In\nresponse, we create VisionArena, a dataset of 230K real-world conversations\nbetween users and VLMs. Collected from Chatbot Arena - an open-source platform\nwhere users interact with VLMs and submit preference votes - VisionArena spans\n73K unique users, 45 VLMs, and 138 languages. Our dataset contains three\nsubsets: VisionArena-Chat, 200k single and multi-turn conversations between a\nuser and a VLM; VisionArena-Battle, 30K conversations comparing two anonymous\nVLMs with user preference votes; and VisionArena-Bench, an automatic benchmark\nof 500 diverse user prompts that efficiently approximate the live Chatbot Arena\nmodel rankings. Additionally, we highlight the types of question asked by\nusers, the influence of response style on preference, and areas where models\noften fail. We find open-ended tasks like captioning and humor are highly\nstyle-dependent, and current VLMs struggle with spatial reasoning and planning\ntasks. Lastly, we show finetuning the same base model on VisionArena-Chat\noutperforms Llava-Instruct-158K, with a 17-point gain on MMMU and a 46-point\ngain on the WildVision benchmark. Dataset at https://huggingface.co/lmarena-ai\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"jNnCA25zX-XQT9yywmTUchQGWqXjjIjIovvnjsHhLhI","pdfSize":"9335052"}