{
  "id": "2412.10060",
  "title": "Identification of ram pressure stripping features in galaxies using\n  citizen science",
  "authors": "Jacob P. Crossett, Yara L. Jaff\\'e, Sean L. McGee, Rory Smith, Callum\n  Bellhouse, Daniela Bettoni, Benedetta Vulcani, Kshitija Kelkar, Ana C. C.\n  Louren\\c{c}o",
  "authorsParsed": [
    [
      "Crossett",
      "Jacob P.",
      ""
    ],
    [
      "Jaffé",
      "Yara L.",
      ""
    ],
    [
      "McGee",
      "Sean L.",
      ""
    ],
    [
      "Smith",
      "Rory",
      ""
    ],
    [
      "Bellhouse",
      "Callum",
      ""
    ],
    [
      "Bettoni",
      "Daniela",
      ""
    ],
    [
      "Vulcani",
      "Benedetta",
      ""
    ],
    [
      "Kelkar",
      "Kshitija",
      ""
    ],
    [
      "Lourenço",
      "Ana C. C.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 11:44:21 GMT"
    }
  ],
  "updateDate": "2025-02-19",
  "timestamp": 1734090261000,
  "abstract": "  Ram pressure stripped galaxies are rare cases of environmental evolution in\naction. However, our ability to understand these galaxies is limited by the\nsmall number of identified galaxies experiencing ram pressure stripping (RPS).\nOur aim is to explore the efficacy of citizen science classifications in\nidentifying ram pressure stripped galaxies, and use this to aid in motivating\nnew samples of ram pressure stripped candidates. We compile a sample of over\n200 known ram pressure stripped galaxies from existing literature, with\nmorphological classifications obtained from Galaxy Zoo. We compare these\ngalaxies with magnitude and redshift-matched comparison cluster and field\ngalaxies. Additionally, we create a sample of SDSS cluster galaxies, with\nmorphological classifications similar to known ram pressure stripped galaxies,\nand compare the fraction of potential new RPS candidates against control\nsamples. We find that ram pressure stripped galaxies exhibit a higher\nproportion of odd and irregular morphological classifications compared to field\nand cluster comparison samples. This trend is particularly pronounced in\ngalaxies displaying strong optical ram pressure stripping features, but absent\nfrom galaxies with only radio tails. We find that SDSS galaxies with Galaxy Zoo\nclassifications consistent with the known RPS galaxies have a higher fraction\nof visible ram pressure stripping features ($19\\%$) compared with other cluster\ngalaxies ($12\\%$) when classified by experts. We identify 101 new ram pressure\nstripping candidate galaxies through these expert classifications. We\ndemonstrate that indirect morphological classifications from citizen science\nprojects can increase the efficiency in which new stripping candidates are\nfound. Projects such as Galaxy Zoo can aid in the identification of ram\npressure stripped galaxies that are key to understanding galaxy evolution in\nclusters.\n",
  "subjects": [
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "kK2V-attF-pc6LN4fzVfcTBXA7J9_8w0jh0MSQJqF2w",
  "pdfSize": "553492"
}