{
  "id": "2412.15484",
  "title": "Toward Robust Hyper-Detailed Image Captioning: A Multiagent Approach and\n  Dual Evaluation Metrics for Factuality and Coverage",
  "authors": "Saehyung Lee, Seunghyun Yoon, Trung Bui, Jing Shi, Sungroh Yoon",
  "authorsParsed": [
    [
      "Lee",
      "Saehyung",
      ""
    ],
    [
      "Yoon",
      "Seunghyun",
      ""
    ],
    [
      "Bui",
      "Trung",
      ""
    ],
    [
      "Shi",
      "Jing",
      ""
    ],
    [
      "Yoon",
      "Sungroh",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 01:37:22 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 24 Dec 2024 04:42:49 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1734658642000,
  "abstract": "  Multimodal large language models (MLLMs) excel at generating highly detailed\ncaptions but often produce hallucinations. Our analysis reveals that existing\nhallucination detection methods struggle with detailed captions. We attribute\nthis to the increasing reliance of MLLMs on their generated text, rather than\nthe input image, as the sequence length grows. To address this issue, we\npropose a multiagent approach that leverages LLM-MLLM collaboration to correct\ngiven captions. Additionally, we introduce an evaluation framework and a\nbenchmark dataset to facilitate the systematic analysis of detailed captions.\nOur experiments demonstrate that our proposed evaluation method better aligns\nwith human judgments of factuality than existing metrics and that existing\napproaches to improve the MLLM factuality may fall short in hyper-detailed\nimage captioning tasks. In contrast, our proposed method significantly enhances\nthe factual accuracy of captions, even improving those generated by GPT-4V.\nFinally, we highlight a limitation of VQA-centric benchmarking by demonstrating\nthat an MLLM's performance on VQA benchmarks may not correlate with its ability\nto generate detailed image captions.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "5445IuVxYRaujunvVLE6bE3G0Ez3KoP8fvODKVM8dnw",
  "pdfSize": "2082111"
}