{"id":"2412.17720","title":"Field-Induced Magnon Decay, Magnon Shadows, and Roton Excitations in the\n  Honeycomb Antiferromagnet YbBr$_3$","authors":"J. A. Hern\\'andez, A. A. Eberharter, M. Schuler, J. Lass, D. G.\n  Mazzone, R. Sibille, S. Raymond, K. W. Kr\\\"amer, B. Normand, B. Roessli, A.\n  M. L\\\"auchli, M. Kenzelmann","authorsParsed":[["Hernández","J. A.",""],["Eberharter","A. A.",""],["Schuler","M.",""],["Lass","J.",""],["Mazzone","D. G.",""],["Sibille","R.",""],["Raymond","S.",""],["Krämer","K. W.",""],["Normand","B.",""],["Roessli","B.",""],["Läuchli","A. M.",""],["Kenzelmann","M.",""]],"versions":[{"version":"v1","created":"Mon, 23 Dec 2024 16:59:02 GMT"}],"updateDate":"2024-12-24","timestamp":1734973142000,"abstract":"  Although the search for quantum many-body phenomena in magnetic materials has\na strong focus on highly frustrated systems, even unfrustrated quantum magnets\nshow a multitude of unconventional phenomena in their spin excitation spectra.\nYbBr$_3$ is an excellent realization of the $S = 1/2$ antiferromagnetic\nHeisenberg model on the honeycomb lattice, and we have performed detailed\nspectroscopic experiments with both unpolarized and polarized neutrons at all\napplied magnetic fields up to saturation. We observe extensive excitation\ncontinua, which cause strong renormalization and the decay of single magnons at\nhigher fields, while coherent features include field-induced ``shadows'' of the\nsingle magnons and the spectacular emergence of a roton-like excitation. To\nguide and interpret our experiments, we performed systematic calculations by\nthe method of cylinder matrix-product states that provide quantitative\nagreement with the neutron scattering data and a qualitative benchmark for the\nspectral signatures of strong quantum fluctuations even in the absence of\nmagnetic frustration.\n","subjects":["Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"9VEPLwHtyrZVb_UBMepAP0QvFaUwusZONREKTwkG1_E","pdfSize":"5945892"}