{
  "id": "2412.19773",
  "title": "On the uplift of 4D wormholes in Braneworld models and their 5D\n  structure",
  "authors": "Thomas D. Pappas and Theodoros Nakas",
  "authorsParsed": [
    [
      "Pappas",
      "Thomas D.",
      ""
    ],
    [
      "Nakas",
      "Theodoros",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 27 Dec 2024 18:12:03 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735323123000,
  "abstract": "  Recent developments in the consistent embedding of general 4D static and\nspherically-symmetric spacetimes in arbitrary single-brane braneworld models\n[Phys.Rev.D 109 (2024) 4, L041501] initiated the program of studying the bulk\nstructure of braneworld wormholes. In this article, adopting a completely\ngeneric approach, we derive the general conditions that the metric functions of\nany braneworld spacetime must satisfy to describe a wormhole structure in the\nbulk. Particular emphasis is placed on clarifying the proper uplift of 4D\nwormholes, expressed in terms of various radial coordinates on the brane, and\nwe demonstrate the important role of the circumferential radius metric function\nfor the embedding. Additionally, the flare-out conditions for braneworld\nwormholes are presented for the first time and are found to differ from the\ncase of flat extra dimensions. To illustrate the method, we first perform the\nuplift into the Randall-Sundrum II braneworld model for three well-known 4D\nwormhole spacetimes; the effective braneworld wormhole solutions of\nCasadio-Fabbri-Mazzacurati and Bronnikov-Kim, and the Simpson-Visser spacetime.\nSubsequently, we study their bulk features by means of curvature invariants,\nflare-out conditions, energy conditions and embedding diagrams. Our analysis\nreveals that the assumption of a warped extra dimension has non-trivial\nimplications for the structure of 5D wormholes.\n",
  "subjects": [
    "Physics/General Relativity and Quantum Cosmology",
    "Physics/High Energy Physics - Theory"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "tgjVqiqvyTteaF7eFCuUM7JfMx36FKyX_CMRRIVMZcQ",
  "pdfSize": "4962805"
}