{
  "id": "2412.03586",
  "title": "Broadband Cavity-Enhanced Absorption Spectroscopy (BBCEAS) Coupled with\n  an Interferometer for On-Band and Off-Band Detection of Glyoxal",
  "authors": "Callum E. Flowerday, Ryan Thalman, Matthew C. Asplund, and Jaron C.\n  Hansen",
  "authorsParsed": [
    [
      "Flowerday",
      "Callum E.",
      ""
    ],
    [
      "Thalman",
      "Ryan",
      ""
    ],
    [
      "Asplund",
      "Matthew C.",
      ""
    ],
    [
      "Hansen",
      "Jaron C.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 25 Nov 2024 21:06:25 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1732568785000,
  "abstract": "  Glyoxal CHOCHO is a trace gas in the atmosphere, often used as an indicator\nof biogenic emissions. It is frequently compared to formaldehyde\nconcentrations, which serve as indicators of anthropogenic emissions, to gain\ninsights into the characteristics of the environmental source. This study\nemployed broadband cavity-enhanced absorption spectroscopy to detect gaseous\nCHOCHO, methylglyoxal, and $\\mathrm{NO_2}$. Two different detection methods are\ncompared. Spectrograph and CCD Detection: This approach involves coupling the\nsystem to a spectrograph with a charge-coupled device (CCD) detector. It\nachieved a 1 min 1-$\\sigma$ detection limit of $2.5 \\times 10^8$\nmolecules/cm$^3$, or 10 parts per trillion (ppt). Methylglyoxal and\n$\\mathrm{NO_2}$ achieved 1 min 1-$\\sigma$ detection limits of 34 ppt and 22\nppt, respectively. Interferometer and PMT Detection: In this method, an\ninterferometer is used in conjunction with a photomultiplier tube (PMT)\ndetector. It resulted in a 2 min 1-$\\sigma$ detection limit of $1.5 \\times\n10^{10}$ molecules/cm$^3$, or 600 ppt. The $\\mathrm{NO_2}$ 2 min 1-$\\sigma$\ndetection limit was determined to be 900 ppt. Concentrations of methylglyoxal\nwere difficult to determine using this method, as they appeared to be below the\ndetection limit of the instrument. This study discusses the advantages and\nlimitations of each of these detection methods.\n",
  "subjects": [
    "Physics/Chemical Physics",
    "Physics/Instrumentation and Detectors"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "UrnZyuWgNwLRtwoDiXPB73bJD5vFXYs4P5WJgz4SntM",
  "pdfSize": "4854450"
}