{
  "id": "2412.14555",
  "title": "Single-Loop Federated Actor-Critic across Heterogeneous Environments",
  "authors": "Ye Zhu and Xiaowen Gong",
  "authorsParsed": [
    [
      "Zhu",
      "Ye",
      ""
    ],
    [
      "Gong",
      "Xiaowen",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 06:13:59 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1734588839000,
  "abstract": "  Federated reinforcement learning (FRL) has emerged as a promising paradigm,\nenabling multiple agents to collaborate and learn a shared policy adaptable\nacross heterogeneous environments. Among the various reinforcement learning\n(RL) algorithms, the actor-critic (AC) algorithm stands out for its low\nvariance and high sample efficiency. However, little to nothing is known\ntheoretically about AC in a federated manner, especially each agent interacts\nwith a potentially different environment. The lack of such results is\nattributed to various technical challenges: a two-level structure illustrating\nthe coupling effect between the actor and the critic, heterogeneous\nenvironments, Markovian sampling and multiple local updates. In response, we\nstudy \\textit{Single-loop Federated Actor Critic} (SFAC) where agents perform\nactor-critic learning in a two-level federated manner while interacting with\nheterogeneous environments. We then provide bounds on the convergence error of\nSFAC. The results show that the convergence error asymptotically converges to a\nnear-stationary point, with the extent proportional to environment\nheterogeneity. Moreover, the sample complexity exhibits a linear speed-up\nthrough the federation of agents. We evaluate the performance of SFAC through\nnumerical experiments using common RL benchmarks, which demonstrate its\neffectiveness.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Distributed, Parallel, and Cluster Computing",
    "Computer Science/Multiagent Systems"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "t2LRNYDrL84zWRWGjC8lASGPFrNz1kxTbtOv28nmVRM",
  "pdfSize": "640007"
}