{
  "id": "2412.18939",
  "title": "Forensics of Transpiled Quantum Circuits",
  "authors": "Rupshali Roy, Archisman Ghosh and Swaroop Ghosh",
  "authorsParsed": [
    [
      "Roy",
      "Rupshali",
      ""
    ],
    [
      "Ghosh",
      "Archisman",
      ""
    ],
    [
      "Ghosh",
      "Swaroop",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 25 Dec 2024 16:10:34 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735143034000,
  "abstract": "  Many third-party cloud providers set up quantum hardware as a service that\nincludes a wide range of qubit technologies and architectures to maximize\nperformance at minimal cost. However, there is little visibility to where the\nexecution of the circuit is taking place. This situation is similar to the\nclassical cloud. The difference in the quantum scenario is that the success of\nthe user program is highly reliant on the backend used. Besides, the\nthird-party provider may be untrustworthy and execute the quantum circuits on\nless efficient and more error-prone hardware to maximize profit. Thus, gaining\nvisibility on the backend from various aspects will be valuable. Effective\nforensics can have many applications including establishing trust in quantum\ncloud services. We introduce the problem of forensics in the domain of quantum\ncomputing. We trace the coupling map of the hardware where the transpilation of\nthe circuit took place from the transpiled program. We perform experiments on\nvarious coupling topologies (linear, T-shaped, H-shaped, and loop) on IBM\nbackends. We can derive the coupling map from the transpiled circuits with\ncomplete accuracy for almost every transpiled circuit we considered. We could\ncorrectly trace 97.33% of the programs to the correct backend.\n",
  "subjects": [
    "Computer Science/Cryptography and Security"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "QKreK6nc_i7GH_jO2o5bRCmho5WpL9tjaDsFVPDfMS0",
  "pdfSize": "2335546"
}