{"id":"2412.07739","title":"GASP: Gaussian Avatars with Synthetic Priors","authors":"Jack Saunders, Charlie Hewitt, Yanan Jian, Marek Kowalski, Tadas\n  Baltrusaitis, Yiye Chen, Darren Cosker, Virginia Estellers, Nicholas Gyde,\n  Vinay P. Namboodiri, Benjamin E Lundell","authorsParsed":[["Saunders","Jack",""],["Hewitt","Charlie",""],["Jian","Yanan",""],["Kowalski","Marek",""],["Baltrusaitis","Tadas",""],["Chen","Yiye",""],["Cosker","Darren",""],["Estellers","Virginia",""],["Gyde","Nicholas",""],["Namboodiri","Vinay P.",""],["Lundell","Benjamin E",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 18:36:21 GMT"}],"updateDate":"2024-12-11","timestamp":1733855781000,"abstract":"  Gaussian Splatting has changed the game for real-time photo-realistic\nrendering. One of the most popular applications of Gaussian Splatting is to\ncreate animatable avatars, known as Gaussian Avatars. Recent works have pushed\nthe boundaries of quality and rendering efficiency but suffer from two main\nlimitations. Either they require expensive multi-camera rigs to produce avatars\nwith free-view rendering, or they can be trained with a single camera but only\nrendered at high quality from this fixed viewpoint. An ideal model would be\ntrained using a short monocular video or image from available hardware, such as\na webcam, and rendered from any view. To this end, we propose GASP: Gaussian\nAvatars with Synthetic Priors. To overcome the limitations of existing\ndatasets, we exploit the pixel-perfect nature of synthetic data to train a\nGaussian Avatar prior. By fitting this prior model to a single photo or video\nand fine-tuning it, we get a high-quality Gaussian Avatar, which supports\n360$^\\circ$ rendering. Our prior is only required for fitting, not inference,\nenabling real-time application. Through our method, we obtain high-quality,\nanimatable Avatars from limited data which can be animated and rendered at\n70fps on commercial hardware. See our project page\n(https://microsoft.github.io/GASP/) for results.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Artificial Intelligence","Computer Science/Graphics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"ybYusP1wvEBbQ252aQ6ysqzwJGyS92VNR3tuyNTEjjM","pdfSize":"27822108"}