{
  "id": "2412.00608",
  "title": "Leveraging LLM for Automated Ontology Extraction and Knowledge Graph\n  Generation",
  "authors": "Mohammad Sadeq Abolhasani, Rong Pan",
  "authorsParsed": [
    [
      "Abolhasani",
      "Mohammad Sadeq",
      ""
    ],
    [
      "Pan",
      "Rong",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 30 Nov 2024 23:11:44 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 3 Dec 2024 17:49:02 GMT"
    },
    {
      "version": "v3",
      "created": "Tue, 10 Dec 2024 04:28:36 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733008304000,
  "abstract": "  Extracting relevant and structured knowledge from large, complex technical\ndocuments within the Reliability and Maintainability (RAM) domain is\nlabor-intensive and prone to errors. Our work addresses this challenge by\npresenting OntoKGen, a genuine pipeline for ontology extraction and Knowledge\nGraph (KG) generation. OntoKGen leverages Large Language Models (LLMs) through\nan interactive user interface guided by our adaptive iterative Chain of Thought\n(CoT) algorithm to ensure that the ontology extraction process and, thus, KG\ngeneration align with user-specific requirements. Although KG generation\nfollows a clear, structured path based on the confirmed ontology, there is no\nuniversally correct ontology as it is inherently based on the user's\npreferences. OntoKGen recommends an ontology grounded in best practices,\nminimizing user effort and providing valuable insights that may have been\noverlooked, all while giving the user complete control over the final ontology.\nHaving generated the KG based on the confirmed ontology, OntoKGen enables\nseamless integration into schemeless, non-relational databases like Neo4j. This\nintegration allows for flexible storage and retrieval of knowledge from\ndiverse, unstructured sources, facilitating advanced querying, analysis, and\ndecision-making. Moreover, the generated KG serves as a robust foundation for\nfuture integration into Retrieval Augmented Generation (RAG) systems, offering\nenhanced capabilities for developing domain-specific intelligent applications.\n",
  "subjects": [
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "lXI0OQLpP5EffU6nvbzN_QWqEC9-MSW_SIasTzCHQLU",
  "pdfSize": "2597459"
}