{"id":"2412.14926","title":"Quantum chaos on the separatrix of the periodically perturbed Harper\n  model","authors":"Alice C. Quillen, Abobakar Sediq Miakhel","authorsParsed":[["Quillen","Alice C.",""],["Miakhel","Abobakar Sediq",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 15:04:21 GMT"},{"version":"v2","created":"Tue, 24 Dec 2024 00:14:55 GMT"}],"updateDate":"2024-12-25","timestamp":1734620661000,"abstract":"  We explore the relation between a classical periodic Hamiltonian system and\nan associated discrete quantum system on a torus in phase space. The model is a\nsinusoidally perturbed Harper model and is similar to the sinusoidally\nperturbed pendulum. Separatrices connecting hyperbolic fixed points in the\nunperturbed classical system become chaotic under sinusoidal perturbation. We\nnumerically compute eigenstates of the Floquet propagator for the associated\nquantum system. For each Floquet eigenstate we compute a Husimi distribution in\nphase space and an energy and energy dispersion from the expectation value of\nthe unperturbed Hamiltonian operator. The Husimi distribution of each Floquet\neigenstate resembles a classical orbit with a similar energy and similar energy\ndispersion. Chaotic orbits in the classical system are related to Floquet\neigenstates that appear ergodic. For a hybrid regular and chaotic system, we\nuse the energy dispersion to separate the Floquet eigenstates into ergodic and\nintegrable subspaces. The distribution of quasi-energies in the ergodic\nsubspace resembles that of a random matrix model. The width of a chaotic region\nin the classical system is estimated by integrating the perturbation along a\nseparatrix orbit. We derive a related expression for the associated quantum\nsystem from the averaged perturbation in the interaction representation\nevaluated at states with energy close to the separatrix.\n","subjects":["Physics/Quantum Physics","Physics/Mathematical Physics","Mathematics/Mathematical Physics","Nonlinear Sciences/Chaotic Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"L05V6J1gr3XUfhzMIjmKdZyDa_2o9Qug__och2BBmmo","pdfSize":"4516739"}