{
  "id": "2412.21046",
  "title": "Mind the truncation gap: challenges of learning on dynamic graphs with\n  recurrent architectures",
  "authors": "Jo\\~ao Bravo, Jacopo Bono, Pedro Saleiro, Hugo Ferreira, Pedro Bizarro",
  "authorsParsed": [
    [
      "Bravo",
      "João",
      ""
    ],
    [
      "Bono",
      "Jacopo",
      ""
    ],
    [
      "Saleiro",
      "Pedro",
      ""
    ],
    [
      "Ferreira",
      "Hugo",
      ""
    ],
    [
      "Bizarro",
      "Pedro",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 30 Dec 2024 16:07:41 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735574861000,
  "abstract": "  Systems characterized by evolving interactions, prevalent in social,\nfinancial, and biological domains, are effectively modeled as continuous-time\ndynamic graphs (CTDGs). To manage the scale and complexity of these graph\ndatasets, machine learning (ML) approaches have become essential. However,\nCTDGs pose challenges for ML because traditional static graph methods do not\nnaturally account for event timings. Newer approaches, such as graph recurrent\nneural networks (GRNNs), are inherently time-aware and offer advantages over\nstatic methods for CTDGs. However, GRNNs face another issue: the short\ntruncation of backpropagation-through-time (BPTT), whose impact has not been\nproperly examined until now. In this work, we demonstrate that this truncation\ncan limit the learning of dependencies beyond a single hop, resulting in\nreduced performance. Through experiments on a novel synthetic task and\nreal-world datasets, we reveal a performance gap between full\nbackpropagation-through-time (F-BPTT) and the truncated\nbackpropagation-through-time (T-BPTT) commonly used to train GRNN models. We\nterm this gap the \"truncation gap\" and argue that understanding and addressing\nit is essential as the importance of CTDGs grows, discussing potential future\ndirections for research in this area.\n",
  "subjects": [
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "YjOJpP8-0QVvcj4SMSY465Hw9DXhzjGf20O9ZBqyX9g",
  "pdfSize": "663021"
}