{
  "id": "2412.06643",
  "title": "Detecting Facial Image Manipulations with Multi-Layer CNN Models",
  "authors": "Alejandro Marco Montejano and Angela Sanchez Perez and Javier\n  Barrachina and David Ortiz-Perez and Manuel Benavent-Lledo and Jose\n  Garcia-Rodriguez",
  "authorsParsed": [
    [
      "Montejano",
      "Alejandro Marco",
      ""
    ],
    [
      "Perez",
      "Angela Sanchez",
      ""
    ],
    [
      "Barrachina",
      "Javier",
      ""
    ],
    [
      "Ortiz-Perez",
      "David",
      ""
    ],
    [
      "Benavent-Lledo",
      "Manuel",
      ""
    ],
    [
      "Garcia-Rodriguez",
      "Jose",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 16:37:27 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733762247000,
  "abstract": "  The rapid evolution of digital image manipulation techniques poses\nsignificant challenges for content verification, with models such as stable\ndiffusion and mid-journey producing highly realistic, yet synthetic, images\nthat can deceive human perception. This research develops and evaluates\nconvolutional neural networks (CNNs) specifically tailored for the detection of\nthese manipulated images. The study implements a comparative analysis of three\nprogressively complex CNN architectures, assessing their ability to classify\nand localize manipulations across various facial image modifications.\nRegularization and optimization techniques were systematically incorporated to\nimprove feature extraction and performance. The results indicate that the\nproposed models achieve an accuracy of up to 76\\% in distinguishing manipulated\nimages from genuine ones, surpassing traditional approaches. This research not\nonly highlights the potential of CNNs in enhancing the robustness of digital\nmedia verification tools, but also provides insights into effective\narchitectural adaptations and training strategies for low-computation\nenvironments. Future work will build on these findings by extending the\narchitectures to handle more diverse manipulation techniques and integrating\nmulti-modal data for improved detection capabilities.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "PLqaSbc6d0tmS-slX4UPYMiWkJfQWs1pbc5TCzn8vWw",
  "pdfSize": "508184"
}