{
  "id": "2412.13092",
  "title": "Computing crossing numbers with topological and geometric restrictions",
  "authors": "Thekla Hamm, Fabian Klute, Irene Parada",
  "authorsParsed": [
    [
      "Hamm",
      "Thekla",
      ""
    ],
    [
      "Klute",
      "Fabian",
      ""
    ],
    [
      "Parada",
      "Irene",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 17:01:34 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734454894000,
  "abstract": "  Computing the crossing number of a graph is one of the most classical\nproblems in computational geometry. Both it and numerous variations of the\nproblem have been studied, and overcoming their frequent computational\ndifficulty is an active area of research. Particularly recently, there has been\nincreased effort to show and understand the parameterized tractability of\nvarious crossing number variants. While many results in this direction use a\nsimilar approach, a general framework remains elusive. We suggest such a\nframework that generalizes important previous results, and can even be used to\nshow the tractability of deciding crossing number variants for which this was\nstated as an open problem in previous literature. Our framework targets\nvariants that prescribe a partial predrawing and some kind of topological\nrestrictions on crossings. Additionally, to provide evidence for the\nnon-generalizability of previous approaches for the partially crossing number\nproblem to allow for geometric restrictions, we show a new more constrained\nhardness result for partially predrawn rectilinear crossing number. In\nparticular, we show W-hardness of deciding Straight-Line Planarity Extension\nparameterized by the number of missing edges.\n",
  "subjects": [
    "Computer Science/Computational Geometry",
    "Computer Science/Data Structures and Algorithms"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "sSZHmzuCNckRfopUBjiUDJ4dJRhRw75InsPeH5x2-C0",
  "pdfSize": "1373172"
}