{"id":"2412.04299","title":"Investigating Kozai-Lidov Oscillations and Disc Tearing in Be Star Discs","authors":"M.W. Suffak, C.E. Jones, and A.C. Carciofi","authorsParsed":[["Suffak","M. W.",""],["Jones","C. E.",""],["Carciofi","A. C.",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 16:20:59 GMT"}],"updateDate":"2024-12-06","timestamp":1733415659000,"abstract":"  Recent simulations of Be stars in misaligned binary systems have revealed\nthat misalignment between the disc and binary orbit can cause the disc to\nundergo Kozai-Lidov (KL) oscillations or disc-tearing. We build on our previous\nsuite of three-dimensional smoothed particle hydrodynamics simulations of\nequal-mass systems by simulating eight new misaligned Be star binary systems,\nwith mass-ratios of 0.1 and 0.5, or equal-mass systems with varying viscosity.\nWe find the same phenomena occur as previously for mass ratios of 0.5, while\nthe mass ratio of 0.1 does not cause KL oscillations or disc-tearing for the\nparameters examined. With increased viscosity in our equal-mass simulations, we\nshow that these phenomena and other oscillations are damped out and do not\noccur. We also briefly compare two viscosity prescriptions and find they can\nproduce the same qualitative disc evolution. Next, we use the radiative\ntransfer code HDUST to predict observable trends of a KL oscillation, and show\nhow the observables oscillate in sync with disc inclination and cause large\nchanges in the polarization position angle. Our models generate highly complex\nline profiles, including triple-peak profiles that are known to occur in Be\nstars. The mapping between the SPH simulations and these triple-peak features\ngives us hints as to where they originate. Finally, we construct\ninterferometric predictions of how a gap in the disc, produced by KL\noscillations or disc-tearing, perturbs the visibility versus baseline curve at\nmultiple wavelengths, and can cause large changes to the differential phase\nprofile across an emission line.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"l-5WATIMqofx0oUzxtptZOgbAoe4roQzzGKIbwd9BBI","pdfSize":"5808122"}