{
  "id": "2412.19716",
  "title": "The non-standad logic of physics: the case of the Boltzmann-Sinai\n  hard-sphere system",
  "authors": "Massimo Tessarotto, Claudio Cremaschini, Claudio Asci, Alessandro\n  Soranzo, Marco Tessarotto, Gino Tironi",
  "authorsParsed": [
    [
      "Tessarotto",
      "Massimo",
      ""
    ],
    [
      "Cremaschini",
      "Claudio",
      ""
    ],
    [
      "Asci",
      "Claudio",
      ""
    ],
    [
      "Soranzo",
      "Alessandro",
      ""
    ],
    [
      "Tessarotto",
      "Marco",
      ""
    ],
    [
      "Tironi",
      "Gino",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 27 Dec 2024 16:15:24 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735316124000,
  "abstract": "  One of the most challenging and fascinating issues in mathematical and\ntheoretical physics concerns identifying the common logic, if any, which\nunderlies the physical world. More precisely, this involves the search of the\npossibly-unique axiomatic logical proposition calculus to apply simultaneously\nboth to classical and quantum realms of physics and to be consistent with the\ncorresponding mathematical and filosophysical setups. Based on the recent\nestablishment of quantum logic, which has been shown to apply both to Quantum\nMechanics and Quantum Gravity, the crucial remaining step involves the\nidentification of the appropriate axiomatic logical proposition calculus to be\nassociated with Classical Mechanics. In this paper the issue is posed for a\nfundamental example of Classical Mechanics, which is represented by the\nso-called Boltzmann-Sinai dynamical system. This is realized by the ensemble of\nclassical smooth hard-spheres, which is set at the basis of Classical\nStatistical Mechanics and is also commonly regarded as a possible realization\nof Classical Newtonian Cosmology. Depending on the initial conditions which are\nprescribed for such a system, its classical state is shown to obey the\npropositional calculus of non-classical logic. In particular, the latter is\nexpressed by the 3-way Principle of Non-Contradiction, namely the same logical\nprinciple that holds for quantum logic. The result therefore permits to\nquestion on a mathematical basis the principles of deterministic classical\nlogic and the validity of their character within the domain of Classical\nPhysics. Such a conclusion represents a potential notable innovation in the\nlogical dicotomy true/false, a crucial topic which has crossed millennia\nthrough philosophy, logic, mathematics and physics.\n",
  "subjects": [
    "Physics/Classical Physics",
    "Physics/Mathematical Physics",
    "Mathematics/Mathematical Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "M4Y_p5pgtKEqTakb7sxSREdZcgEYf4P2ii5XFJvFirg",
  "pdfSize": "298772"
}