{"id":"2412.10788","title":"Efficient electron heating by laser in finite sized plasma\n  micro-globular targets by repeated collisions of surface and bulk waves","authors":"Animesh Sharma, Amita Das, and G Ravindra Kumar","authorsParsed":[["Sharma","Animesh",""],["Das","Amita",""],["Kumar","G Ravindra",""]],"versions":[{"version":"v1","created":"Sat, 14 Dec 2024 10:50:20 GMT"},{"version":"v2","created":"Sat, 15 Feb 2025 10:26:11 GMT"}],"updateDate":"2025-02-18","timestamp":1734173420000,"abstract":"  A new mechanism of enhanced laser energy absorption in plasma microglobules\nis demonstrated with the help of two-dimensional Particle-In-Cell (PIC)\nsimulations. The mechanism relies on the excitation of surface and bulk waves\nand the occurrence of repeated collisions in the confines of the finite-sized\nmicroglobular target. The episodic increase in the average particle energy\ncorrelates with the repeated collision of the surface and bulk waves that get\nexcited by the laser on the target. It is shown that the size of the\nmicroglobular target governs the efficiency of absorption and the timings of\nepisodic events of energy enhancement. This study thereby illustrates the novel\nefficient possibility that a closed plasma target provides for energy\nextraction. Parallels of such colliding waves creating havoc in terms of wave\nbreaking etc. can be witnessed on the ocean surface, seismic disturbances\ntraversing as body waves traverse reflecting and refracting in the interior of\nthe Earth along with surface waves (propagating on the curved surface of the\nEarth) converge at the antipode to create destruction. Our studies here show\nthe importance of choosing closed targets which aid in the process of repeated\nenergy transfer to particles and often their thermalization. The waves keep\npropagating in the closed confines rather than getting dissipated over an\nextended region as would happen for extended targets.\n","subjects":["Physics/Plasma Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"vxsIO7MOyJxHaaVNbMMaOfa27E_E1o_9sn7BR5CtvSE","pdfSize":"2499909"}