{
  "id": "2412.11643",
  "title": "A comprehensive GeoAI review: Progress, Challenges and Outlooks",
  "authors": "Anasse Boutayeb and Iyad Lahsen-cherif and Ahmed El Khadimi",
  "authorsParsed": [
    [
      "Boutayeb",
      "Anasse",
      ""
    ],
    [
      "Lahsen-cherif",
      "Iyad",
      ""
    ],
    [
      "Khadimi",
      "Ahmed El",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 10:41:02 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734345662000,
  "abstract": "  In recent years, Geospatial Artificial Intelligence (GeoAI) has gained\ntraction in the most relevant research works and industrial applications, while\nalso becoming involved in various fields of use. This paper offers a\ncomprehensive review of GeoAI as a synergistic concept applying Artificial\nIntelligence (AI) methods and models to geospatial data. A preliminary study is\ncarried out, identifying the methodology of the work, the research motivations,\nthe issues and the directions to be tracked, followed by exploring how GeoAI\ncan be used in various interesting fields of application, such as precision\nagriculture, environmental monitoring, disaster management and urban planning.\nNext, a statistical and semantic analysis is carried out, followed by a clear\nand precise presentation of the challenges facing GeoAI. Then, a concrete\nexploration of the future prospects is provided, based on several informations\ngathered during the census. To sum up, this paper provides a complete overview\nof the correlation between AI and the geospatial domain, while mentioning the\nresearches conducted in this context, and emphasizing the close relationship\nlinking GeoAI with other advanced concepts such as geographic information\nsystems (GIS) and large-scale geospatial data, known as big geodata. This will\nenable researchers and scientific community to assess the state of progress in\nthis promising field, and will help other interested parties to gain a better\nunderstanding of the issues involved.\n",
  "subjects": [
    "Computer Science/Artificial Intelligence",
    "Physics/Geophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "wLT_TmlgpCVqah2JodFONGwBk_Y6LIDNSuJk7cvIUpU",
  "pdfSize": "43246370"
}