{"id":"2412.05088","title":"Logarithmic matching between past infinity and future infinity: The\n  massless scalar field","authors":"Oscar Fuentealba, Marc Henneaux","authorsParsed":[["Fuentealba","Oscar",""],["Henneaux","Marc",""]],"versions":[{"version":"v1","created":"Fri, 6 Dec 2024 14:46:30 GMT"}],"updateDate":"2024-12-09","timestamp":1733496390000,"abstract":"  Matching conditions relating the fields at the future of past null infinity\nwith the fields at the past of future null infinity play a central role in the\nanalysis of asymptotic symmetries and conservation laws in asymptotically flat\nspacetimes. These matching conditions can be derived from initial data given on\na Cauchy hypersurface by integrating forward and backward in time the field\nequations to leading order in an asymptotic expansion, all the way to future\nand past null infinities. The standard matching conditions considered in the\nliterature are valid only in the case when the expansion near null infinity\n(which is generically polylogarithmic) has no dominant logarithmic term.\n  This paper is the first in a series in which we derive the matching\nconditions for a massless scalar field with initial conditions leading to\ndominant logarithms at null infinity. We prove that these involve the opposite\nsign with respect to the usual matching conditions. We also analyse the\nmatching of the angle-dependent conserved charges that follow from the\nasymptotic decay and Lorentz invariance. We show in particular that these are\nwell defined and finite at null infinity even in the presence of leading\nlogarithmic terms provided one uses the correct definitions.\n  The free massless scalar field has the virtue of presenting the\npolylogarithmic features in a particularly clear setting that shows their\ninevitability, since there is no subtle gauge fixing issue or nonlinear\nintrincacies involved in the problem. We also consider the case of higher\nspacetime dimensions where fractional powers of $r$ (odd spacetime dimensions)\nor subdominant logarithmic terms (even spacetime dimensions) are present. Mixed\nmatching conditions are then relevant. In subsequent papers, we will extend the\nanalysis to the electromagnetic and the gravitational fields.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"PIEa48QuvSYb_BY5mXXsbuK3Q2ngejbDv8l6AO5Qdhc","pdfSize":"792748"}