{"id":"2412.15811","title":"IXPE detection of highly polarized X-rays from the magnetar 1E 1841-045","authors":"Michela Rigoselli, Roberto Taverna, Sandro Mereghetti, Roberto\n  Turolla, Gian Luca Israel, Silvia Zane, Lorenzo Marra, Fabio Muleri, Alice\n  Borghese, Francesco Coti Zelati, Davide De Grandis, Matteo Imbrogno, Ruth\n  M.E. Kelly, Paolo Esposito and Nanda Rea","authorsParsed":[["Rigoselli","Michela",""],["Taverna","Roberto",""],["Mereghetti","Sandro",""],["Turolla","Roberto",""],["Israel","Gian Luca",""],["Zane","Silvia",""],["Marra","Lorenzo",""],["Muleri","Fabio",""],["Borghese","Alice",""],["Zelati","Francesco Coti",""],["De Grandis","Davide",""],["Imbrogno","Matteo",""],["Kelly","Ruth M. E.",""],["Esposito","Paolo",""],["Rea","Nanda",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 11:42:28 GMT"}],"updateDate":"2024-12-23","timestamp":1734694948000,"abstract":"  The Imaging X-ray Polarimetry Explorer (IXPE) observed for the first time\nhighly polarized X-ray emission from the magnetar 1E 1841-045, targeted after a\nburst-active phase in August 2024. To date, IXPE has observed four other\nmagnetars during quiescent periods, highlighting substantially different\npolarization properties. 1E 1841-045 exhibits a high, energy-dependent\npolarization degree, which increases monotonically from ~15% at 2-3 keV up to\n~55% at 5.5-8 keV, while the polarization angle, aligned with the celestial\nNorth, remains fairly constant. The broadband spectrum (2-79 keV) obtained by\ncombining simultaneous IXPE and NuSTAR data is well modeled by a blackbody and\ntwo power-law components. The unabsorbed 2-8 keV flux (~2E-11 erg/cm2/s) is\nabout 10% higher than that obtained from archival XMM-Newton and NuSTAR\nobservations. The polarization of the soft, thermal component does not exceed\n~25%, and may be produced by a condensed surface or a bombarded atmosphere. The\nintermediate power law is polarized at around 30%, consistent with predictions\nfor resonant Compton scattering in the star magnetosphere; while, the hard\npower law exhibits a polarization degree exceeding 65%, pointing to a\nsynchrotron/curvature origin.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"NZ21ws5Pgj6LAQlYw2Yz9P5NC1UKD7ZcFwRIY_zDeMI","pdfSize":"4567497"}