{"id":"2412.19511","title":"Uncertainty quantification for improving radiomic-based models in\n  radiation pneumonitis prediction","authors":"Chanon Puttanawarut, Romen Samuel Wabina, Nat Sirirutbunkajorn","authorsParsed":[["Puttanawarut","Chanon",""],["Wabina","Romen Samuel",""],["Sirirutbunkajorn","Nat",""]],"versions":[{"version":"v1","created":"Fri, 27 Dec 2024 08:01:42 GMT"},{"version":"v2","created":"Tue, 18 Feb 2025 10:14:08 GMT"}],"updateDate":"2025-02-19","timestamp":1735286502000,"abstract":"  Background and Objective: Radiation pneumonitis (RP) is a side effect of\nthoracic radiation therapy. Recently, Machine learning (ML) models enhanced\nwith radiomic and dosiomic features provide better predictions by incorporating\nspatial information beyond DVHs. However, to improve the clinical decision\nprocess, we propose to use uncertainty quantification (UQ) to improve the\nconfidence in model prediction. This study evaluates the impact of post hoc UQ\nmethods on the discriminative performance and calibration of ML models for RP\nprediction. Methods: This study evaluated four ML models: logistic regression\n(LR), support vector machines (SVM), extreme gradient boosting (XGB), and\nrandom forest (RF), using radiomic, dosiomic, and dosimetric features to\npredict RP. We applied UQ methods, including Patt scaling, isotonic regression,\nVenn-ABERS predictor, and Conformal Prediction, to quantify uncertainty. Model\nperformance was assessed through Area Under the Receiver Operating\nCharacteristic curve (AUROC), Area Under the Precision-Recall Curve (AUPRC),\nand Adaptive Calibration Error (ACE) using Leave-One-Out Cross-Validation\n(LOO-CV). Results: UQ methods enhanced predictive performance, particularly for\nhigh-certainty predictions, while also improving calibration. Radiomic and\ndosiomic features increased model accuracy but introduced calibration\nchallenges, especially for non-linear models like XGB and RF. Performance gains\nfrom UQ methods were most noticeable at higher certainty thresholds.\nConclusion: Integrating UQ into ML models with radiomic and dosiomic features\nimproves both predictive accuracy and calibration, supporting more reliable\nclinical decision-making. The findings emphasize the value of UQ methods in\nenhancing applicability of predictive models for RP in healthcare settings.\n","subjects":["Computer Science/Machine Learning","Physics/Medical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8_VwiyPIYjaWSZzeDShhCc-Vn9oJZHG3veDo-yZ6MTQ","pdfSize":"1000188"}