{"id":"2412.10387","title":"AsyMov: Integrated Sensing and Communications with Asynchronous Moving\n  Devices","authors":"Gianmaria Ventura, Zaman Bhalli, Michele Rossi, Jacopo Pegoraro","authorsParsed":[["Ventura","Gianmaria",""],["Bhalli","Zaman",""],["Rossi","Michele",""],["Pegoraro","Jacopo",""]],"versions":[{"version":"v1","created":"Fri, 29 Nov 2024 14:06:43 GMT"}],"updateDate":"2024-12-17","timestamp":1732889203000,"abstract":"  Estimating the Doppler frequency shift caused by moving targets is one of the\nkey objectives of Integrated Sensing And Communication (ISAC) systems. In the\ncase of Wi-Fi sensing, a reliable estimation of the Doppler enables\napplications such as target classification, human activity recognition, and\ngait analysis. However, in practical scenarios, Doppler estimation is hindered\nby the movement of transmitter and receiver devices, and by the phase offsets\ncaused by their clock asynchrony. Existing approaches have separately addressed\nthese two aspects, either assuming clock-synchronous moving devices or\nasynchronous static ones. Jointly tackling device motion and clock asynchrony\nis extremely challenging, as the Doppler shift from device movement differs for\neach propagation path and the phase offsets are time-varying. In this paper, we\npresent AsyMov, a method to estimate the bistatic Doppler frequency of a target\nand the device velocity in ISAC setups featuring mobile and asynchronous\ndevices. Our method leverages the channel impulse response at the receiver, by\noriginally exploiting the invariance of phase offsets across propagation paths\nand the bistatic geometry. Moreover, AsyMov handles irregular channel sampling\nin the time domain and can be seamlessly integrated with device velocity\nmeasurements obtained from onboard sensors (if available), to enhance its\nreliability. AsyMov is thoroughly characterized from a theoretical perspective,\nvia numerical simulation, and experimentally, implementing it on an IEEE\n802.11ay testbed. Numerical and experimental results show superior performance\nagainst traditional methods based on the discrete Fourier transform and are on\npar with scenarios featuring static ISAC devices.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"CBqSW8sd6QBbxrO2gTch_XjFmwoBFYII3ul4KblW76g","pdfSize":"1855214"}