{"id":"2412.18484","title":"PrettiSmart: Visual Interpretation of Smart Contracts via Simulation","authors":"Xiaolin Wen, Tai D. Nguyen, Lun Zhang, Jun Sun, and Yong Wang","authorsParsed":[["Wen","Xiaolin",""],["Nguyen","Tai D.",""],["Zhang","Lun",""],["Sun","Jun",""],["Wang","Yong",""]],"versions":[{"version":"v1","created":"Tue, 24 Dec 2024 15:16:35 GMT"}],"updateDate":"2024-12-25","timestamp":1735053395000,"abstract":"  Smart contracts are the fundamental components of blockchain technology. They\nare programs to determine cryptocurrency transactions, and are irreversible\nonce deployed, making it crucial for cryptocurrency investors to understand the\ncryptocurrency transaction behaviors of smart contracts comprehensively.\nHowever, it is a challenging (if not impossible) task for investors, as they do\nnot necessarily have a programming background to check the complex source code.\nEven for investors with certain programming skills, inferring all the potential\nbehaviors from the code alone is still difficult, since the actual behaviors\ncan be different when different investors are involved. To address this\nchallenge, we propose PrettiSmart, a novel visualization approach via execution\nsimulation to achieve intuitive and reliable visual interpretation of smart\ncontracts. Specifically, we develop a simulator to comprehensively capture most\nof the possible real-world smart contract behaviors, involving multiple\ninvestors and various smart contract functions. Then, we present PrettiSmart to\nintuitively visualize the simulation results of a smart contract, which\nconsists of two modules: The Simulation Overview Module is a barcode-based\ndesign, providing a visual summary for each simulation, and the Simulation\nDetail Module is an augmented sequential design to display the cryptocurrency\ntransaction details in each simulation, such as function call sequences,\ncryptocurrency flows, and state variable changes. It can allow investors to\nintuitively inspect and understand how a smart contract will work. We evaluate\nPrettiSmart through two case studies and in-depth user interviews with 12\ninvestors. The results demonstrate the effectiveness and usability of\nPrettiSmart in facilitating an easy interpretation of smart contracts.\n","subjects":["Computer Science/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"pPk9fW2e-qbF-60B4xbeHRrBYobDp4KVRX7nSvZzxnU","pdfSize":"2142260"}