{
  "id": "2412.19957",
  "title": "Evolutionary games on the lattice: multitype contact process with\n  density-dependent birth rates",
  "authors": "Jonas K\\\"oppl, Nicolas Lanchier and Max Mercer",
  "authorsParsed": [
    [
      "Köppl",
      "Jonas",
      ""
    ],
    [
      "Lanchier",
      "Nicolas",
      ""
    ],
    [
      "Mercer",
      "Max",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 27 Dec 2024 23:53:34 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735343614000,
  "abstract": "  Interacting particle systems of interest in evolutionary game theory\nintroduced in the probability literature consist of variants of the voter model\nin which each site is occupied by one player. The goal of this paper is to\ninitiate the study of evolutionary games based more realistically on the\nmultitype contact process in which each site is either empty or occupied by a\nplayer following one of two possible competing strategies. Like in the\nsymmetric multitype contact process, players have natural death rate one and\nnatural birth rate $\\lambda$. Following the traditional modeling approach of\nevolutionary game theory, the process also depends on a payoff matrix $A =\n(a_{ij})$ where $a_{ij}$ represents the payoff a type $i$ player receives from\neach of its type $j$ neighbors, and the actual birth rate is an increasing\nfunction of the payoff. Using various couplings and block constructions, we\nfirst prove the existence of a phase transition in the direction of the intra\npayoff $a_{11}$ or $a_{22}$ while the other three payoffs are fixed. We also\nlook at the behavior near the critical point where all four payoffs are equal\nto zero, in which case the system reduces to the symmetric multitype contact\nprocess. The effects of the intra payoffs $a_{11}$ and $a_{22}$ are studied\nusing various couplings and duality techniques, while the effects of the inter\npayoffs $a_{12}$ and $a_{21}$ are studied in one dimension using a coupling\nwith the contact process to control the interface between the 1s and the 2s.\n",
  "subjects": [
    "Mathematics/Probability"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "i983hdMKAPKD96I0hCxvqppnIJXr-hAFnUF5aeCupfU",
  "pdfSize": "1039796"
}