{"id":"2412.11685","title":"Ultra-High-Definition Dynamic Multi-Exposure Image Fusion via Infinite\n  Pixel Learning","authors":"Xingchi Chen, Zhuoran Zheng, Xuerui Li, Yuying Chen, Shu Wang, Wenqi\n  Ren","authorsParsed":[["Chen","Xingchi",""],["Zheng","Zhuoran",""],["Li","Xuerui",""],["Chen","Yuying",""],["Wang","Shu",""],["Ren","Wenqi",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 11:55:26 GMT"}],"updateDate":"2024-12-17","timestamp":1734350126000,"abstract":"  With the continuous improvement of device imaging resolution, the popularity\nof Ultra-High-Definition (UHD) images is increasing. Unfortunately, existing\nmethods for fusing multi-exposure images in dynamic scenes are designed for\nlow-resolution images, which makes them inefficient for generating high-quality\nUHD images on a resource-constrained device. To alleviate the limitations of\nextremely long-sequence inputs, inspired by the Large Language Model (LLM) for\nprocessing infinitely long texts, we propose a novel learning paradigm to\nachieve UHD multi-exposure dynamic scene image fusion on a single\nconsumer-grade GPU, named Infinite Pixel Learning (IPL). The design of our\napproach comes from three key components: The first step is to slice the input\nsequences to relieve the pressure generated by the model processing the data\nstream; Second, we develop an attention cache technique, which is similar to KV\ncache for infinite data stream processing; Finally, we design a method for\nattention cache compression to alleviate the storage burden of the cache on the\ndevice. In addition, we provide a new UHD benchmark to evaluate the\neffectiveness of our method. Extensive experimental results show that our\nmethod maintains high-quality visual performance while fusing UHD dynamic\nmulti-exposure images in real-time (>40fps) on a single consumer-grade GPU.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"NVf5UQuhDsY3hh4cBwU4W47GuIsSdEDlTHrl6AbXIVs","pdfSize":"30465407"}