{"id":"2412.04822","title":"Space-Time-Modulated Wideband Radiation-Type Programmable Metasurface\n  for Low Sidelobe Beamforming","authors":"Xudong Bai, Longpan Wang, Yuhua Chen, Xilong Lu, Fuli Zhang, Jingfeng\n  Chen, Wen Chen, and He-Xiu Xu","authorsParsed":[["Bai","Xudong",""],["Wang","Longpan",""],["Chen","Yuhua",""],["Lu","Xilong",""],["Zhang","Fuli",""],["Chen","Jingfeng",""],["Chen","Wen",""],["Xu","He-Xiu",""]],"versions":[{"version":"v1","created":"Fri, 6 Dec 2024 07:34:51 GMT"}],"updateDate":"2024-12-09","timestamp":1733470491000,"abstract":"  Programmable metasurfaces promise a great potential to construct low-cost\nphased array systems due to the capability of elaborate modulation over\nelectromagnetic (EM) waves. However, they are in either reflective or\ntransmissive mode, and usually possess a relatively high profile as a result of\nthe external feed source. Besides, it is difficult to conduct multibit phase\nshift in metasurfaces, when comparing with conventional phased arrays. Here, we\npropose a strategy of space-time modulated wideband radiation-type programmable\nmetasurface for low side-lobe beamforming. The wideband programmable\nmetasurface avoids the space-feed external source required by its traditional\ncounterpart, thus achieving a significant reduction of profile through\nintegration of a highefficiency microwave-fed excitation network and\nmetasurface. Furthermore, through introducing space-time-modulated strategy,\nthe high-accuracy amplitude-phase weight algorithm can also be synchronously\ncarried out on the first harmonic component for low side-lobe beam-scanning.\nMost importantly, adaptive beamforming and generation of interference null can\nfurther be created after analyzing the harmonic component characteristics of\nreceived signals.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"hoe1AAYbyInJkJqF9GQ20TUVIndFphWenjlfTyjvGqk","pdfSize":"3676156"}