{"id":"2412.15860","title":"Recovering the properties of the interstellar medium through integrated\n  spectroscopy: application to the z~0 ECO volume-limited star-forming galaxy\n  sample","authors":"V. Lebouteiller, C. T. Richardson, M. S. Polimera, D. S. Carr, Z. L.\n  Hutchens, S. J. Kannappan, L. Ramambason, A. J. Moffett, M. Varese, S. C.\n  Madden","authorsParsed":[["Lebouteiller","V.",""],["Richardson","C. T.",""],["Polimera","M. S.",""],["Carr","D. S.",""],["Hutchens","Z. L.",""],["Kannappan","S. J.",""],["Ramambason","L.",""],["Moffett","A. J.",""],["Varese","M.",""],["Madden","S. C.",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 12:55:29 GMT"},{"version":"v2","created":"Sat, 15 Feb 2025 18:59:52 GMT"}],"updateDate":"2025-02-18","timestamp":1734699329000,"abstract":"  Deriving physical parameters from integrated galaxy spectra is paramount to\ninterpret the cosmic evolution of star formation, chemical enrichment, and\nenergetic sources. We develop modeling techniques to characterize the ionized\ngas properties in the subset of 2052 star-forming galaxies from the\nvolume-limited, dwarf-dominated, z~0 ECO catalog. The MULTIGRIS statistical\nframework is used to evaluate the performance of various models using strong\nlines as constraints. The reference model involves physical parameters\ndistributed as power-laws with free parameter boundaries. Specifically, we use\ncombinations of 1D photoionization models (i.e., considering the propagation of\nradiation toward a single cloud) to match optical HII region lines, in order to\nprovide probability density functions of the inferred parameters. The inference\npredicts non-uniform physical conditions within galaxies. The integrated\nspectra of most galaxies are dominated by relatively low-excitation gas with a\nmetallicity around 0.3 solar. Using the average metallicity in galaxies, we\nprovide a new fit to the mass-metallicity relationship which is in line with\ndirect abundance method determinations from the calibrated range at low\nmetallicity to stacks at high metallicity. The average metallicity shows a\nweakly bimodal distribution which may be due related to external (e.g.,\nrefueling of non-cluster early-type galaxies above ~10^9.5 solar masses) or\ninternal processes (more efficient star-formation in metal-rich regions). The\nspecific line set used for inference affects the results and we identify\npotential issues with the use of the [SII] line doublet. Complex modelling\napproaches are limited by the inherent 1D model database as well as caveats\nregarding the gas geometry. Our results highlight, however, the possibility to\nextract useful and significant information from integrated spectra.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"l-xf72vtJpypxJhw6dv-ya5b3sx0L36PZe0Q-tG55nw","pdfSize":"6625928"}