{"id":"2412.13604","title":"Distinct amplitude mode dynamics upon resonant and off-resonant\n  excitation across the charge density wave energy gap in LaTe3 investigated by\n  time- and angle-resolved photoemission spectroscopy","authors":"Kecheng Liu, Takeshi Suzuki, Yigui Zhong, Teruto Kanai, Jiro Itatani,\n  Linda Ye, Maya Martinez, Anisha Singh, Ian R. Fisher, Uwe Bovensiepen, Kozo\n  Okazaki","authorsParsed":[["Liu","Kecheng",""],["Suzuki","Takeshi",""],["Zhong","Yigui",""],["Kanai","Teruto",""],["Itatani","Jiro",""],["Ye","Linda",""],["Martinez","Maya",""],["Singh","Anisha",""],["Fisher","Ian R.",""],["Bovensiepen","Uwe",""],["Okazaki","Kozo",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 08:33:34 GMT"}],"updateDate":"2024-12-19","timestamp":1734510814000,"abstract":"  Non-equilibrium states generated by ultrafast laser pulses are characterized\nby specific phenomena that are not accessible in static measurements. Previous\ntime- and angle-resolved photoemission spectroscopy (TARPES) studies on\nrare-earth tritelluride materials have revealed the laser-driven melting of the\ncharge density wave order as well as its collective amplitude mode excitation.\nVariation of the excess energy deposited by optical pumping in the material\npromises pathways to control the dynamic material response. To this end, we use\nan optical parametric amplifier to generate a tunable pump photon energy.\nStudying LaTe3 we compare the dynamics driven by pumping resonantly across the\ncharge density wave energy gap with the effect of pumping at a twice higher\nphoton energy in a TARPES pump-probe experiment. We clearly identify a pump\nphoton energy dependent behavior. At the larger pump photon energy, the excess\nelectronic energy generates lattice heating mediated by e-ph coupling and\nsoftening of the amplitude mode frequency from 3 to 2 THz. Remarkably, the\nresonant pumping across the CDW gap results in a time-independent amplitude\nmode frequency. We conclude that the resonant excitation across the energy gap\nexcites the amplitude mode selectively while additional electronic excess\nenergy deposited at higher pump photon energy modifies the crystal properties\ntransiently by incoherent dissipative processes.\n","subjects":["Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"vrNcJ7Y3uEsNfhatMo6UFyQXd2JDqZEYMMqtoSl8vuA","pdfSize":"708723"}