{
  "id": "2412.16662",
  "title": "Adversarial Attack Against Images Classification based on Generative\n  Adversarial Networks",
  "authors": "Yahe Yang",
  "authorsParsed": [
    [
      "Yang",
      "Yahe",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 21 Dec 2024 15:23:34 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 24 Dec 2024 17:21:50 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1734794614000,
  "abstract": "  Adversarial attacks on image classification systems have always been an\nimportant problem in the field of machine learning, and generative adversarial\nnetworks (GANs), as popular models in the field of image generation, have been\nwidely used in various novel scenarios due to their powerful generative\ncapabilities. However, with the popularity of generative adversarial networks,\nthe misuse of fake image technology has raised a series of security problems,\nsuch as malicious tampering with other people's photos and videos, and invasion\nof personal privacy. Inspired by the generative adversarial networks, this work\nproposes a novel adversarial attack method, aiming to gain insight into the\nweaknesses of the image classification system and improve its anti-attack\nability. Specifically, the generative adversarial networks are used to generate\nadversarial samples with small perturbations but enough to affect the\ndecision-making of the classifier, and the adversarial samples are generated\nthrough the adversarial learning of the training generator and the classifier.\nFrom extensive experiment analysis, we evaluate the effectiveness of the method\non a classical image classification dataset, and the results show that our\nmodel successfully deceives a variety of advanced classifiers while maintaining\nthe naturalness of adversarial samples.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "50h4a2QFAqRk993YIc6ExYvDss9LJLSd9kls9OHyAQ4",
  "pdfSize": "717766"
}