{"id":"2412.10400","title":"Reinforcement Learning Enhanced LLMs: A Survey","authors":"Shuhe Wang, Shengyu Zhang, Jie Zhang, Runyi Hu, Xiaoya Li, Tianwei\n  Zhang, Jiwei Li, Fei Wu, Guoyin Wang and Eduard Hovy","authorsParsed":[["Wang","Shuhe",""],["Zhang","Shengyu",""],["Zhang","Jie",""],["Hu","Runyi",""],["Li","Xiaoya",""],["Zhang","Tianwei",""],["Li","Jiwei",""],["Wu","Fei",""],["Wang","Guoyin",""],["Hovy","Eduard",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 16:10:42 GMT"},{"version":"v2","created":"Tue, 17 Dec 2024 18:05:11 GMT"},{"version":"v3","created":"Mon, 24 Feb 2025 08:57:10 GMT"}],"updateDate":"2025-02-25","timestamp":1733415042000,"abstract":"  Reinforcement learning (RL) enhanced large language models (LLMs),\nparticularly exemplified by DeepSeek-R1, have exhibited outstanding\nperformance. Despite the effectiveness in improving LLM capabilities, its\nimplementation remains highly complex, requiring complex algorithms, reward\nmodeling strategies, and optimization techniques. This complexity poses\nchallenges for researchers and practitioners in developing a systematic\nunderstanding of RL-enhanced LLMs. Moreover, the absence of a comprehensive\nsurvey summarizing existing research on RL-enhanced LLMs has limited progress\nin this domain, hindering further advancements.\n  In this work, we are going to make a systematic review of the most up-to-date\nstate of knowledge on RL-enhanced LLMs, attempting to consolidate and analyze\nthe rapidly growing research in this field, helping researchers understand the\ncurrent challenges and advancements. Specifically, we (1) detail the basics of\nRL; (2) introduce popular RL-enhanced LLMs; (3) review researches on two\nwidely-used reward model-based RL techniques: Reinforcement Learning from Human\nFeedback (RLHF) and Reinforcement Learning from AI Feedback (RLAIF); and (4)\nexplore Direct Preference Optimization (DPO), a set of methods that bypass the\nreward model to directly use human preference data for aligning LLM outputs\nwith human expectations. We will also point out current challenges and\ndeficiencies of existing methods and suggest some avenues for further\nimprovements. Project page of this work can be found at\nhttps://github.com/ShuheWang1998/Reinforcement-Learning-Enhanced-LLMs-A-Survey.\n","subjects":["Computer Science/Computation and Language","Computer Science/Artificial Intelligence","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"wozgglVcL4Wko7gUQrnMmPg7f89crK1YX35Xn5NZsiU","pdfSize":"15921741"}