{"id":"2412.01474","title":"\"Oh, sh*t! I actually opened the document!\": An Empirical Study of the\n  Experiences with Suspicious Emails in Virtual Reality Headsets","authors":"Filipo Sharevski and Jennifer Vander Loop and Sarah Ferguson","authorsParsed":[["Sharevski","Filipo",""],["Loop","Jennifer Vander",""],["Ferguson","Sarah",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 13:20:23 GMT"}],"updateDate":"2024-12-03","timestamp":1733145623000,"abstract":"  This paper reports on a study exploring user experiences with suspicious\nemails and associated warnings when accessed through virtual reality (VR)\nheadsets in realistic settings. A group of (n=20) Apple Vision Pro and another\ngroup of (n=20) Meta Quest 3 users were invited to sort through their own\nselection of Google mail suspicious emails through the VR headset. We asked\nthem to verbalize the experience relative to how they assess the emails, what\ncues they use to determine their legitimacy, and what actions they would take\nfor each suspicious email of their choice. We covertly sent a \"false positive\"\nsuspicious email containing either a URL or an attachment (an email that is\nassigned a suspicious email warning but, in reality, is a legitimate one) and\nobserved how participants would interact with it. Two participants clicked on\nthe link (Apple Vision Pro), and one participant opened the attachment (Meta\nQuest 3). Upon close inspection, in all three instances, the participant \"fell\"\nfor the phish because of the VR headsets' hypersensitive clicking and lack of\nergonomic precision during the routine email sorting task. These and the other\nparticipants thus offered recommendations for implementing suspicious email\nwarnings in VR environments, considerate of the immersiveness and ergonomics of\nthe headsets' interface.\n","subjects":["Computer Science/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Ldc2fCNcal5t7chgo8cX8YyfFFefV9OzQIGDfE_TkX4","pdfSize":"2512747"}