{"id":"2412.15009","title":"Projection-based preprocessing for electrical impedance tomography to\n  reduce the effect of electrode contacts","authors":"Altti J\\\"a\\\"askel\\\"ainen, Jussi Toivanen, Asko H\\\"anninen, Ville\n  Kolehmainen, Nuutti Hyv\\\"onen","authorsParsed":[["Jääskeläinen","Altti",""],["Toivanen","Jussi",""],["Hänninen","Asko",""],["Kolehmainen","Ville",""],["Hyvönen","Nuutti",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 16:22:33 GMT"}],"updateDate":"2024-12-20","timestamp":1734625353000,"abstract":"  This work introduces a method for preprocessing measurements of electrical\nimpedance tomography to considerably reduce the effect uncertainties in the\nelectrode contacts have on the reconstruction quality, without a need to\nexplicitly estimate the contacts. The idea is to compute the Jacobian matrix of\nthe forward map with respect to the contact strengths and project the electrode\nmeasurements and the forward map onto the orthogonal complement of the range of\nthis Jacobian. Using the smoothened complete electrode model as the forward\nmodel, it is demonstrated that inverting the resulting projected equation with\nrespect to only the internal conductivity of the examined body results in good\nquality reconstructions both when resorting to a single step linearization with\na smoothness prior and when combining lagged diffusivity iteration with total\nvariation regularization. The quality of the reconstructions is further\nimproved if the range of the employed projection is also orthogonal to that of\nthe Jacobian with respect to the electrode positions. These results hold even\nif the projections are formed at internal and contact conductivities that\nsignificantly differ from the true ones; it is numerically demonstrated that\nthe orthogonal complement of the range of the contact Jacobian is almost\nindependent of the conductivity parameters at which it is evaluated. In\nparticular, our observations introduce a numerical technique for inferring\nwhether a change in the electrode measurements is caused by a change in the\ninternal conductivity or alterations in the electrode contacts, which has\npotential applications, e.g., in bedside monitoring of stroke patients. The\nideas are tested both on simulated data and on real-world water tank\nmeasurements with adjustable contact resistances.\n","subjects":["Mathematics/Numerical Analysis","Computer Science/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"bf2dow92V8SGN_8hbbfDGnwV_wGxQmfHN0LhdG2DQRA","pdfSize":"1873450"}