{
  "id": "2412.09147",
  "title": "A Comprehensive Study on Dark Patterns",
  "authors": "Meng Li and Xiang Wang and Liming Nie and Chenglin Li and Yang Liu and\n  Yangyang Zhao and Lei Xue and Kabir Sulaiman Said",
  "authorsParsed": [
    [
      "Li",
      "Meng",
      ""
    ],
    [
      "Wang",
      "Xiang",
      ""
    ],
    [
      "Nie",
      "Liming",
      ""
    ],
    [
      "Li",
      "Chenglin",
      ""
    ],
    [
      "Liu",
      "Yang",
      ""
    ],
    [
      "Zhao",
      "Yangyang",
      ""
    ],
    [
      "Xue",
      "Lei",
      ""
    ],
    [
      "Said",
      "Kabir Sulaiman",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 10:32:01 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1733999521000,
  "abstract": "  As digital interfaces become increasingly prevalent, certain manipulative\ndesign elements have emerged that may harm user interests, raising associated\nethical concerns and bringing dark patterns into focus as a significant\nresearch topic. Manipulative design strategies are widely used in user\ninterfaces (UI) primarily to guide user behavior in ways that favor service\nproviders, often at the cost of the users themselves. This paper addresses\nthree main challenges in dark pattern research: inconsistencies and\nincompleteness in classification, limitations of detection tools, and\ninsufficient comprehensiveness in existing datasets. In this study, we propose\na comprehensive analytical framework--the Dark Pattern Analysis Framework\n(DPAF). Using this framework, we developed a taxonomy comprising 68 types of\ndark patterns, each annotated in detail to illustrate its impact on users,\npotential scenarios, and real-world examples, validated through industry\nsurveys. Furthermore, we evaluated the effectiveness of current detection tools\nand assessed the completeness of available datasets. Our findings indicate\nthat, among the 8 detection tools studied, only 31 types of dark patterns are\nidentifiable, resulting in a coverage rate of just 45.5%. Similarly, our\nanalysis of four datasets, encompassing 5,561 instances, reveals coverage of\nonly 30 types of dark patterns, with an overall coverage rate of 44%. Based on\nthe available datasets, we standardized classifications and merged datasets to\nform a unified image dataset and a unified text dataset. These results\nhighlight significant room for improvement in the field of dark pattern\ndetection. This research not only deepens our understanding of dark pattern\nclassification and detection tools but also offers valuable insights for future\nresearch and practice in this domain.\n",
  "subjects": [
    "Computer Science/Human-Computer Interaction"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "92BbnawQIXONT5axOLuyXXOtup94Bux4hmdvAJfW8rw",
  "pdfSize": "3847572"
}