{
  "id": "2412.05051",
  "title": "Angstrom Scale Ionic Memristors' Engineering with van der Waals\n  Materials- A Route to Highly Tunable Memory States",
  "authors": "Dhal Biswabhusan, Puzari Animesh, Li-Hsien Yeh, and Kalon Gopinadhan",
  "authorsParsed": [
    [
      "Biswabhusan",
      "Dhal",
      ""
    ],
    [
      "Animesh",
      "Puzari",
      ""
    ],
    [
      "Yeh",
      "Li-Hsien",
      ""
    ],
    [
      "Gopinadhan",
      "Kalon",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 14:05:54 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733493954000,
  "abstract": "  Memristors that mimic brain functions are crucial for energy-efficient\nneuromorphic devices. Ion channels that emulate biological synapses are still\nin the early stages of development, especially the tunability of memory states.\nHere, we demonstrate that cations such as K+, Na+, Ca2+, and Al3+ intercalated\nin the interlayer spaces of vermiculite, result in highly confined channels of\nsize 3-5 {\\AA}. They host exotic memristor properties through ion exchange\ndynamics, even at high salt concentrations of 1 M. The bipolar memristor\ncharacteristics observed are tunable with frequency, geometric asymmetry, ion\nconcentration, and intercalants. Notably, we observe polarization-flipping\nmemristor behavior in two cases: one with Al3+ ions and another with devices\nhaving a geometric asymmetry ratio greater than 15. This inversion is\nattributed to the over-screening of counter-ions due to their accumulation at\nthe channel entrance. Our results suggest that ion exchange dynamics, ion-ion\ninteractions, and ion accumulation/depletion mechanisms, particularly with\nmultivalent ions, can be harnessed to develop advanced memristor devices.\n",
  "subjects": [
    "Condensed Matter/Materials Science",
    "Condensed Matter/Mesoscale and Nanoscale Physics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "wcNkM2e0wmhAGnjY6YfS-ocag5qZBeSz-uVoJMII3cc",
  "pdfSize": "1043534"
}