{
  "id": "2412.20616",
  "title": "Hilbert Curve Based Molecular Sequence Analysis",
  "authors": "Sarwan Ali, Tamkanat E Ali, Imdad Ullah Khan, Murray Patterson",
  "authorsParsed": [
    [
      "Ali",
      "Sarwan",
      ""
    ],
    [
      "Ali",
      "Tamkanat E",
      ""
    ],
    [
      "Khan",
      "Imdad Ullah",
      ""
    ],
    [
      "Patterson",
      "Murray",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 29 Dec 2024 23:26:43 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735514803000,
  "abstract": "  Accurate molecular sequence analysis is a key task in the field of\nbioinformatics. To apply molecular sequence classification algorithms, we first\nneed to generate the appropriate representations of the sequences. Traditional\nnumeric sequence representation techniques are mostly based on sequence\nalignment that faces limitations in the form of lack of accuracy. Although\nseveral alignment-free techniques have also been introduced, their tabular data\nform results in low performance when used with Deep Learning (DL) models\ncompared to the competitive performance observed in the case of image-based\ndata. To find a solution to this problem and to make Deep Learning (DL) models\nfunction to their maximum potential while capturing the important spatial\ninformation in the sequence data, we propose a universal Hibert curve-based\nChaos Game Representation (CGR) method. This method is a transformative\nfunction that involves a novel Alphabetic index mapping technique used in\nconstructing Hilbert curve-based image representation from molecular sequences.\nOur method can be globally applied to any type of molecular sequence data. The\nHilbert curve-based image representations can be used as input to sophisticated\nvision DL models for sequence classification. The proposed method shows\npromising results as it outperforms current state-of-the-art methods by\nachieving a high accuracy of $94.5$\\% and an F1 score of $93.9\\%$ when tested\nwith the CNN model on the lung cancer dataset. This approach opens up a new\nhorizon for exploring molecular sequence analysis using image classification\nmethods.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Quantitative Biology/Other Quantitative Biology"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "uHl81E5zzdLQ0pu9bRznJxrxB9Ty8RGIVelcOMNNLQA",
  "pdfSize": "461097"
}