{"id":"2412.04908","title":"PERCY: A Multimodal Dataset and Conversational System for Personalized\n  and Emotionally Aware Human-Robot Interaction","authors":"Mohammed Althubyani, Zhijin Meng, Shengyuan Xie, Cha Seung, Imran\n  Razzak, Eduardo Benitez Sandoval, Baki Kocaballi, Mahdi Bamdad, Francisco\n  Cruz Naranjo","authorsParsed":[["Althubyani","Mohammed",""],["Meng","Zhijin",""],["Xie","Shengyuan",""],["Seung","Cha",""],["Razzak","Imran",""],["Sandoval","Eduardo Benitez",""],["Kocaballi","Baki",""],["Bamdad","Mahdi",""],["Naranjo","Francisco Cruz",""]],"versions":[{"version":"v1","created":"Fri, 6 Dec 2024 10:04:26 GMT"}],"updateDate":"2024-12-09","timestamp":1733479466000,"abstract":"  The integration of conversational agents into our daily lives has become\nincreasingly common, yet many of these agents cannot engage in deep\ninteractions with humans. Despite this, there is a noticeable shortage of\ndatasets that capture multimodal information from human-robot interaction\ndialogues. To address this gap, we have developed a Personal Emotional Robotic\nConversational sYstem (PERCY) and recorded a novel multimodal dataset that\nencompasses rich embodied interaction data. The process involved asking\nparticipants to complete a questionnaire and gathering their profiles on ten\ntopics, such as hobbies and favourite music. Subsequently, we initiated\nconversations between the robot and the participants, leveraging GPT-4 to\ngenerate contextually appropriate responses based on the participant's profile\nand emotional state, as determined by facial expression recognition and\nsentiment analysis. Automatic and user evaluations were conducted to assess the\noverall quality of the collected data. The results of both evaluations\nindicated a high level of naturalness, engagement, fluency, consistency, and\nrelevance in the conversation, as well as the robot's ability to provide\nempathetic responses. It is worth noting that the dataset is derived from\ngenuine interactions with the robot, involving participants who provided\npersonal information and conveyed actual emotions.\n","subjects":["Computer Science/Human-Computer Interaction","Computer Science/Emerging Technologies","Computer Science/Robotics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"HIobvend6Op3wi9Nxfb31XsPLK7TAwXhuTEuH7LVoyQ","pdfSize":"1016532"}