{
  "id": "2412.07162",
  "title": "Skyrmion Lattice Manipulation with Electric Currents and Thermal\n  Gradients in MnSi",
  "authors": "N. Chalus, A. W. D. Leishman, R. M. Menezes, G. Longbons, U. Welp,\n  W.-K. Kwok, J. S. White, M. Bartkowiak, R. Cubitt, Y. Liu, E. D. Bauer, M.\n  Janoschek, M. V. Milosevic, M. R. Eskildsen",
  "authorsParsed": [
    [
      "Chalus",
      "N.",
      ""
    ],
    [
      "Leishman",
      "A. W. D.",
      ""
    ],
    [
      "Menezes",
      "R. M.",
      ""
    ],
    [
      "Longbons",
      "G.",
      ""
    ],
    [
      "Welp",
      "U.",
      ""
    ],
    [
      "Kwok",
      "W. -K.",
      ""
    ],
    [
      "White",
      "J. S.",
      ""
    ],
    [
      "Bartkowiak",
      "M.",
      ""
    ],
    [
      "Cubitt",
      "R.",
      ""
    ],
    [
      "Liu",
      "Y.",
      ""
    ],
    [
      "Bauer",
      "E. D.",
      ""
    ],
    [
      "Janoschek",
      "M.",
      ""
    ],
    [
      "Milosevic",
      "M. V.",
      ""
    ],
    [
      "Eskildsen",
      "M. R.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 03:43:08 GMT"
    },
    {
      "version": "v2",
      "created": "Mon, 20 Jan 2025 14:01:47 GMT"
    }
  ],
  "updateDate": "2025-02-10",
  "timestamp": 1733802188000,
  "abstract": "  The skyrmion lattice (SkL) in MnSi was studied using small-angle neutron\nscattering and under the influence of a radial electric current in a Corbino\ngeometry. In response to the applied current, the SkL undergoes an angular\nreorientation with respect to the MnSi crystal lattice. The reorientation is\nnon-monotonic with increasing current, with the SkL rotating first in one\ndirection and then the other. The SkL reorientation was studied at different\nsample locations and found to depend on the local current density as inferred\nfrom a finite element analysis. The non-monotonic response indicates the\npresence of two competing effects on the SkL, most likely due to the presence\nof both radial electric and thermal currents. Such a scenario is supported by\nmicromagnetic simulations, which show how these effects can act constructively\nor destructively to drive the SkL rotation, depending on the direction of the\nelectric current. In addition, the simulations also suggest how the direction\nof the skyrmion flow may affect the SkL orientation.\n",
  "subjects": [
    "Condensed Matter/Mesoscale and Nanoscale Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "QnGqew4Q_Aus6MB_28vpvDr49JUvJ94McEf3G3JSX-I",
  "pdfSize": "8233055"
}