{"id":"2412.14273","title":"Approximation Schemes for Age of Information Minimization in UAV Grid\n  Patrols","authors":"Weiqi Wang and Jin Xu","authorsParsed":[["Wang","Weiqi",""],["Xu","Jin",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 19:08:00 GMT"}],"updateDate":"2024-12-20","timestamp":1734548880000,"abstract":"  Motivated by the critical need for unmanned aerial vehicles (UAVs) to patrol\ngrid systems in hazardous and dynamically changing environments, this study\naddresses a routing problem aimed at minimizing the time-average Age of\nInformation (AoI) for edges in general graphs. We establish a lower bound for\nall feasible patrol policies and demonstrate that this bound is tight when the\ngraph contains an Eulerian cycle. For graphs without Eulerian cycles, it\nbecomes challenging to identify the optimal patrol strategy due to the\nextensive range of feasible options. Our analysis shows that restricting the\nstrategy to periodic sequences still results in an exponentially large number\nof possible strategies. To address this complexity, we introduce two\npolynomial-time approximation schemes, each involving a two-step process:\nconstructing multigraphs first and then embedding Eulerian cycles within these\nmultigraphs. We prove that both schemes achieve an approximation ratio of 2.\nFurther, both analytical and numerical results suggest that evenly and sparsely\ndistributing edge visits within a periodic route significantly reduces the\naverage AoI compared to strategies that merely minimize the route travel\ndistance. Building on this insight, we propose a heuristic method that not only\nmaintains the approximation ratio of 2 but also ensures robust performance\nacross varying random graphs.\n","subjects":["Computer Science/Information Theory","Mathematics/Information Theory","Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"THyF7MDBpFH8Kqi8qp-PFK0Jw-zRKW5nE28wEeAEyRY","pdfSize":"890102"}