{"id":"2412.12840","title":"Two-stage memetic algorithm for blind equalization in\n  direct-sequence/code-division multiple-access Systems","authors":"Luis M. San-Jos\\'e-Revuelta and Pablo Casaseca-de-la-Higuera","authorsParsed":[["San-José-Revuelta","Luis M.",""],["Casaseca-de-la-Higuera","Pablo",""]],"versions":[{"version":"v1","created":"Tue, 17 Dec 2024 12:08:25 GMT"}],"updateDate":"2024-12-18","timestamp":1734437305000,"abstract":"  This paper proposes a novel memetic algorithm (MA) for the blind equalization\nof digital multiuser channels with Direct-Sequence / Code-Division\nMultiple-Access (DS/CDMA) sharing scheme. Equalization involves two different\ntasks, the estimation of: (1) channel response and (2) transmitted data. The\ncorresponding channel model is first analyzed and then the MA is developed for\nthis specific communication system. Convergence, population diversity and\nnear-far resistance have been analyzed. Numerical experiments include\ncomparative results with traditional multiuser detectors as well as with other\nnature-inspired approaches. Proposed receiver is proved to allow higher\ntransmission rates over existing channels, while supporting stronger\ninterferences as well as fading and time-variant effects. Required computation\nrequisites are kept moderate in most cases. Proposed MA saves approximately 80%\nof computation time with respect to a standard genetic algorithm and about 15%\nwith respect to a similar two-stage memetic algorithm, while keeping a\nstatistically significant higher performance. Besides, complexity increases\nonly by a factor of 5, when the number of active users doubles, instead of 32x\nfound for the optimum maximum likelihood algorithm. The proposed method also\nexhibits high near-far resistance and achieves accurate channel response\nestimates, becoming an interesting and viable alternative to so far proposed\nmethods.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"p924Mt06r5TRzGFm0ILX1B1oxa68_CJoaU1Xdr9d3-Y","pdfSize":"334132"}