{"id":"2412.07374","title":"Poromechanical modelling of the time-dependent response of in vivo human\n  skin during extension","authors":"Thomas Lavigne, St\\'ephane Urcun, Emmanuelle Jacquet, J\\'er\\^ome\n  Chambert, Aflah Elouneg, Camilo A. Suarez-Afanador, St\\'ephane P. A. Bordas,\n  Giuseppe Scium\\`e, Pierre-Yves Rohan","authorsParsed":[["Lavigne","Thomas",""],["Urcun","Stéphane",""],["Jacquet","Emmanuelle",""],["Chambert","Jérôme",""],["Elouneg","Aflah",""],["Suarez-Afanador","Camilo A.",""],["Bordas","Stéphane P. A.",""],["Sciumè","Giuseppe",""],["Rohan","Pierre-Yves",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 10:15:47 GMT"}],"updateDate":"2024-12-11","timestamp":1733825747000,"abstract":"  This paper proposes a proof of concept application of a biphasic constitutive\nmodel to identify the mechanical properties of in vivo human skin under\nextension. Although poromechanics theory has been extensively used to model\nother soft biological tissues, only a few studies have been published for skin,\nand most have been limited to ex vivo or in silico conditions. However, in vivo\nprocedures are crucial to determine the subject-specific properties at\ndifferent body sites. This study focuses on cyclic uni-axial extension of the\nupper arm skin, using unpublished data collected by Chambert et al. Our\nanalysis shows that a two-layer finite element model allows representing all\nrelevant features of the observed mechanical response to the imposed external\nloading, which was composed, in this contribution, of four\nloading-sustaining-unloading cycles. The Root Mean Square Error (RMSE) between\nthe calibrated model and the measured Force-time response was 8.84e-3 N. Our\nbiphasic model represents a preliminary step toward investigating the\nmechanical conditions responsible for the onset of injury. It allows for the\nanalysis of changes in Interstitial Fluid (IF) pressure, flow, and osmotic\npressure, in addition to the mechanical fields. Future work will focus on the\ninteraction of multiple biochemical factors and the complex network of\nregulatory signals.\n","subjects":["Quantitative Biology/Tissues and Organs"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"SQIylvy3G3LkqbEt_r0XdPABRyT7pYemaINw1x6VRXw","pdfSize":"3491363"}