{"id":"2412.14147","title":"Quantum fluid dimers of hyperbolic exciton-polariton condensates","authors":"Ioannis Georgakilas, Antonio Gianfrate, Dimitrios Trypogeorgos, Helgi\n  Sigur{\\dh}sson, Fabrizio Riminucci, Kirk W. Baldwin, Loren N. Pfeiffer,\n  Milena De Giorgi, Dario Ballarini, and Daniele Sanvitto","authorsParsed":[["Georgakilas","Ioannis",""],["Gianfrate","Antonio",""],["Trypogeorgos","Dimitrios",""],["Sigurðsson","Helgi",""],["Riminucci","Fabrizio",""],["Baldwin","Kirk W.",""],["Pfeiffer","Loren N.",""],["De Giorgi","Milena",""],["Ballarini","Dario",""],["Sanvitto","Daniele",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 18:44:55 GMT"}],"updateDate":"2024-12-20","timestamp":1734547495000,"abstract":"  Coupled many-body quantum systems give rise to rich emergent physics and\nabundance of both stationary and dynamical behaviours. Designing platforms with\ntunable and distinct forms of coupling gives new insight into the collective\nbehaviour of the dimerised quantum systems. Fundamentally, two systems can\nexchange particles through either forbidden or allowed channels, underpinning\nevanescent and ballistic coupling mechanisms, respectively. Based on proximity,\nthe former leads to large spectral splitting that defines, for instance,\nchemical binding energies, whereas the latter pushes for stringent\nphase-matching and synchronicity between oscillating degrees-of-freedom,\nanalogous to phase-coupled harmonic oscillators, with a significantly smaller\nimpact on the energy landscape. Here, we demonstrate an all-optically tunable\nevanescent-ballistic quantum fluid dimer based on hyperbolic exciton-polariton\ncondensates in a photonic crystal waveguide. By changing the angle of the\npolariton dimer relative to the grating, the system transitions from an\nevanescently-coupled molecule with large mode-splitting to a ballistic\ncondensate dimer with strict phase-matching conditions and rich interference\npatterns. We directly measure the condensate spectral features and mass flow\nsubject to a saddle dispersion relation, and connect our results to mean field\ntheory. These results showcase the potential of photonic crystals to study\ncondensed matter phenomena lying at the interface between delay-coupled\nnonlinear oscillators and tight binding physics.\n","subjects":["Physics/Optics","Condensed Matter/Quantum Gases"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"CPCkknjjYVow2QB89xrnTQHK9Ow_Np2Dgllg2BeR7Lo","pdfSize":"9466511"}