{
  "id": "2412.03454",
  "title": "Decoding Long-duration Gravitational Waves from Binary Neutron Stars\n  with Machine Learning: Parameter Estimation and Equations of State",
  "authors": "Qian Hu, Jessica Irwin, Qi Sun, Christopher Messenger, Lami Suleiman,\n  Ik Siong Heng, John Veitch",
  "authorsParsed": [
    [
      "Hu",
      "Qian",
      ""
    ],
    [
      "Irwin",
      "Jessica",
      ""
    ],
    [
      "Sun",
      "Qi",
      ""
    ],
    [
      "Messenger",
      "Christopher",
      ""
    ],
    [
      "Suleiman",
      "Lami",
      ""
    ],
    [
      "Heng",
      "Ik Siong",
      ""
    ],
    [
      "Veitch",
      "John",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 16:42:56 GMT"
    }
  ],
  "updateDate": "2024-12-05",
  "timestamp": 1733330576000,
  "abstract": "  Gravitational waves (GWs) from binary neutron stars (BNSs) offer valuable\nunderstanding of the nature of compact objects and hadronic matter. However,\ntheir analysis requires substantial computational resources due to the\nchallenges in Bayesian stochastic sampling. The third-generation (3G) GW\ndetectors are expected to detect BNS signals with significantly increased\nsignal duration, detection rates, and signal strength, leading to a major\ncomputational burden in the 3G era. We demonstrate a machine learning-based\nworkflow capable of producing source parameter estimation and constraints on\nequations of state (EOSs) for hours-long BNS signals in seconds with minimal\nhardware costs. We employ efficient compressions on the GW data and EOS using\nneural networks, based on which we build normalizing flows for inferences.\nGiven that full Bayesian analysis is prohibitively time-intensive, we validate\nour model against (semi-)analytical predictions. Additionally, we estimate the\ncomputational demands of BNS signal analysis in the 3G era, showing that the\nmachine learning methods will be crucial for future catalog-level analysis.\n",
  "subjects": [
    "Physics/General Relativity and Quantum Cosmology",
    "Astrophysics/High Energy Astrophysical Phenomena",
    "Astrophysics/Instrumentation and Methods for Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "F9pC9WFwjDAc46Mhwb9nwZ-8_1a4tXvrMppJ1qSeZf4",
  "pdfSize": "4436618"
}