{
  "id": "2412.20186",
  "title": "The quantum Kibble-Zurek mechanism: the role of boundary conditions,\n  endpoints and kink types",
  "authors": "Jose Soto Garcia and Natalia Chepiga",
  "authorsParsed": [
    [
      "Garcia",
      "Jose Soto",
      ""
    ],
    [
      "Chepiga",
      "Natalia",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 28 Dec 2024 15:51:54 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735401114000,
  "abstract": "  Quantum phase transitions are characterised by the universal scaling laws in\nthe critical region surrounding the transitions. This universality is also\nmanifested in the critical real-time dynamics through the quantum Kibble-Zurek\nmechanism. In recent experiments on a Rydberg atom quantum simulator, the\nKibble-Zurek mechanism has been used to probe the nature of quantum phase\ntransitions.\n  In this paper we analyze the caveats associated with this method and develop\nstrategies to improve its accuracy. Focusing on two minimal models --\ntransverse-field Ising and three-state Potts -- we study the effect of boundary\nconditions, the location of the endpoints and some subtleties in the definition\nof the kink operators.\n  In particular, we show that the critical scaling of the most intuitive types\nof kinks is extremely sensitive to the correct choice of endpoint, while more\nadvanced types of kinks exhibit remarkably robust universal scaling.\nFurthermore, we show that when kinks are tracked over the entire chain, fixed\nboundary conditions improve the accuracy of the scaling. Surprisingly, the\nKibble-Zurek critical scaling appears to be equally accurate whether the fixed\nboundary conditions are chosen to be symmetric or anti-symmetric. Finally, we\nshow that the density of kinks extracted in the central part of long chains\nobeys the predicted universal scaling for all types of boundary conditions.\n",
  "subjects": [
    "Physics/Quantum Physics",
    "Condensed Matter/Strongly Correlated Electrons"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "6kkk3vBDg5nW5D_OT_e64T8gCGKIEqGJHPvh0fLBJcU",
  "pdfSize": "1187940"
}