{"id":"2412.04700","title":"SpasticMyoElbow: Physical Human-Robot Interaction Simulation Framework\n  for Modelling Elbow Spasticity","authors":"Hao Yu, Zebin Huang, Yutong Li, Xinliang Guo, Vincent Crocher, Ignacio\n  Carlucho, and Mustafa Suphi Erden","authorsParsed":[["Yu","Hao",""],["Huang","Zebin",""],["Li","Yutong",""],["Guo","Xinliang",""],["Crocher","Vincent",""],["Carlucho","Ignacio",""],["Erden","Mustafa Suphi",""]],"versions":[{"version":"v1","created":"Fri, 6 Dec 2024 01:24:33 GMT"}],"updateDate":"2024-12-09","timestamp":1733448273000,"abstract":"  Robotic devices hold great potential for efficient and reliable assessment of\nneuromotor abnormalities in post-stroke patients. However, spasticity caused by\nstroke is still assessed manually in clinical settings. The limited and\nvariable nature of data collected from patients has long posed a major barrier\nto quantitatively modelling spasticity with robotic measurements and fully\nvalidating robotic assessment techniques. This paper presents a simulation\nframework developed to support the design and validation of elbow spasticity\nmodels and mitigate data problems. The framework consists of a simulation\nenvironment of robot-assisted spasticity assessment, two motion controllers for\nthe robot and human models, and a stretch reflex controller. Our framework\nallows simulation based on synthetic data without experimental data from human\nsubjects. Using this framework, we replicated the constant-velocity stretch\nexperiment typically used in robot-assisted spasticity assessment and evaluated\nfour types of spasticity models. Our results show that a spasticity reflex\nmodel incorporating feedback on both muscle fibre velocity and length more\naccurately captures joint resistance characteristics during passive elbow\nstretching in spastic patients than a force-dependent model. When integrated\nwith an appropriate spasticity model, this simulation framework has the\npotential to generate extensive datasets of virtual patients for future\nresearch on spasticity assessment.\n","subjects":["Computer Science/Robotics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"00LBkOys5Ec3XJANumZ3FZiJ-7mHBqaP_qA_7aEF_y8","pdfSize":"1437322"}