{
  "id": "2412.12099",
  "title": "Magnetic sub-micron rods for quantitative viscosity imaging using\n  heterodyne holography",
  "authors": "C. Gentner, J.-F. Berret, P. Berto, S. Reichman, R. Kuszelewicz, G.\n  Tessier",
  "authorsParsed": [
    [
      "Gentner",
      "C.",
      ""
    ],
    [
      "Berret",
      "J. -F.",
      ""
    ],
    [
      "Berto",
      "P.",
      ""
    ],
    [
      "Reichman",
      "S.",
      ""
    ],
    [
      "Kuszelewicz",
      "R.",
      ""
    ],
    [
      "Tessier",
      "G.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 29 Oct 2024 06:26:46 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1730183206000,
  "abstract": "  Many processes in microfluidics and biology are driven or affected by\nviscosity. While several methods are able to measure this parameter globally,\nvery few can provide high resolution viscosity images. Optimizing the locality\nof viscosity measurements demands smaller probes but also shorter lateral\ndiffusion lengths and measurement times. Here, we propose to use sub-micrometer\nmagnetic rods to perform high resolution viscosity imaging. An external\nmagnetic field forces the oscillation of superparamagnetic iron oxide rods.\nUnder linearly polarized illumination, the rotation of these highly anisotropic\noptical scatterers induces a blinking which is analyzed by heterodyne\nholography. The spectral analysis of the rotation dynamics yields a regime\ntransition frequency from which the local viscosity is deduced. Holography\nprovides a 3D optical field reconstruction and 3D superlocalization of the\nrods, which allows super-resolved viscosity measurements. Relying on the fast\nBrownian rotation instead of the slower translation component of nanorods\ntherefore allows faster measurements and, crucially, smaller effective voxels\nfor viscosity determination. We thus demonstrate that viscosity imaging is\npossible with a 0.5 (micron)^3 3D-resolution.\n",
  "subjects": [
    "Physics/Optics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "InCFLRjdCgwrD0gO0PkIG-J43kN7hN5N4FV4evaaMz8",
  "pdfSize": "815189"
}