{"id":"2412.12672","title":"Structural Pruning via Spatial-aware Information Redundancy for Semantic\n  Segmentation","authors":"Dongyue Wu, Zilin Guo, Li Yu, Nong Sang, Changxin Gao","authorsParsed":[["Wu","Dongyue",""],["Guo","Zilin",""],["Yu","Li",""],["Sang","Nong",""],["Gao","Changxin",""]],"versions":[{"version":"v1","created":"Tue, 17 Dec 2024 08:41:50 GMT"}],"updateDate":"2024-12-18","timestamp":1734424910000,"abstract":"  In recent years, semantic segmentation has flourished in various\napplications. However, the high computational cost remains a significant\nchallenge that hinders its further adoption. The filter pruning method for\nstructured network slimming offers a direct and effective solution for the\nreduction of segmentation networks. Nevertheless, we argue that most existing\npruning methods, originally designed for image classification, overlook the\nfact that segmentation is a location-sensitive task, which consequently leads\nto their suboptimal performance when applied to segmentation networks. To\naddress this issue, this paper proposes a novel approach, denoted as\nSpatial-aware Information Redundancy Filter Pruning~(SIRFP), which aims to\nreduce feature redundancy between channels. First, we formulate the pruning\nprocess as a maximum edge weight clique problem~(MEWCP) in graph theory,\nthereby minimizing the redundancy among the remaining features after pruning.\nWithin this framework, we introduce a spatial-aware redundancy metric based on\nfeature maps, thus endowing the pruning process with location sensitivity to\nbetter adapt to pruning segmentation networks. Additionally, based on the\nMEWCP, we propose a low computational complexity greedy strategy to solve this\nNP-hard problem, making it feasible and efficient for structured pruning. To\nvalidate the effectiveness of our method, we conducted extensive comparative\nexperiments on various challenging datasets. The results demonstrate the\nsuperior performance of SIRFP for semantic segmentation tasks.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"30s44-wgO9yLoP4U1vkuaXdgHHxN0SaspypjQgK7kB0","pdfSize":"5287326"}