{"id":"2412.13849","title":"99.9%-fidelity in measuring a superconducting qubit","authors":"Can Wang, Feng-Ming Liu, He Chen, Yi-Fei Du, Chong Ying, Jian-Wen\n  Wang, Yong-Heng Huo, Cheng-Zhi Peng, Xiaobo Zhu, Ming-Cheng Chen, Chao-Yang\n  Lu, Jian-Wei Pan","authorsParsed":[["Wang","Can",""],["Liu","Feng-Ming",""],["Chen","He",""],["Du","Yi-Fei",""],["Ying","Chong",""],["Wang","Jian-Wen",""],["Huo","Yong-Heng",""],["Peng","Cheng-Zhi",""],["Zhu","Xiaobo",""],["Chen","Ming-Cheng",""],["Lu","Chao-Yang",""],["Pan","Jian-Wei",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 13:45:13 GMT"},{"version":"v2","created":"Thu, 19 Dec 2024 13:04:28 GMT"}],"updateDate":"2024-12-20","timestamp":1734529513000,"abstract":"  Despite the significant progress in superconducting quantum computation over\nthe past years, quantum state measurement still lags nearly an order of\nmagnitude behind quantum gate operations in speed and fidelity. The main\nchallenge is that the strong coupling and readout signal used to probe the\nquantum state may also introduce additional channels which may cause qubit\nstate transitions. Here, we design a novel architecture to implement the\nlong-sought longitudinal interaction scheme between qubits and resonators. This\narchitecture not only provides genuine longitudinal interaction by eliminating\nresidual transversal couplings, but also introduces proper nonlinearity to the\nresonator that can further minimize decay error and measurement-induced\nexcitation error. Our experimental results demonstrate a measurement fidelity\nof 99.8% in 202 ns without the need for any first-stage amplification. After\nsubtracting the residual preparation errors, the pure measurement fidelity is\nabove 99.9%. Our scheme is compatible with the multiplexing readout scheme and\ncan be used for quantum error correction.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"jnxiypeCzMUU0Zb1ICbigMjQ3Qg7d1d6V5z0AJvXAMQ","pdfSize":"1501615"}