{
  "id": "2412.04825",
  "title": "Universal Hamming Weight Preserving Variational Quantum Ansatz",
  "authors": "Ge Yan, Kaisen Pan, Ruocheng Wang, Mengfei Ran, Hongxu Chen, Xunuo\n  Wang, Junchi Yan",
  "authorsParsed": [
    [
      "Yan",
      "Ge",
      ""
    ],
    [
      "Pan",
      "Kaisen",
      ""
    ],
    [
      "Wang",
      "Ruocheng",
      ""
    ],
    [
      "Ran",
      "Mengfei",
      ""
    ],
    [
      "Chen",
      "Hongxu",
      ""
    ],
    [
      "Wang",
      "Xunuo",
      ""
    ],
    [
      "Yan",
      "Junchi",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 07:42:20 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733470940000,
  "abstract": "  Understanding the mathematical properties of variational quantum ans\\\"atze is\ncrucial for determining quantum advantage in Variational Quantum Eigensolvers\n(VQEs). A deeper understanding of ans\\\"atze not only enriches theoretical\ndiscussions but also facilitates the design of more efficient and robust\nframeworks for near-term applications. In this work, we address the challenge\nof balancing expressivity and trainability by utilizing a Hamming Weight\nPreserving (HWP) ansatz that confines quantum state evolution to a\nsymmetry-preserving subspace. We rigorously establish the necessary and\nsufficient conditions for subspace universality of HWP ans\\\"atze, along with a\ncomprehensive analysis of the trainability. These theoretical advances are\nvalidated via the accurate approximation of arbitrary unitary matrices in the\nHWP subspace. Furthermore, the practical utility of the HWP ansatz is\nsubstantiated for solving ground-state properties of Fermionic systems,\nachieving energy errors below $1\\times 10^{-10}$Ha. This work highlights the\ncritical role of symmetry-preserving ans\\\"atze in VQE research, offering\ninsights that extend beyond supremacy debates and paving the way for more\nreliable and efficient quantum algorithms in the near term.\n",
  "subjects": [
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "0MAz9wQfRkgarSGbAK48JEEZLgpQ9aSjjx-4TxYigLk",
  "pdfSize": "12776835"
}