{
  "id": "2412.10155",
  "title": "WordVIS: A Color Worth A Thousand Words",
  "authors": "Umar Khan, Saifullah, Stefan Agne, Andreas Dengel, Sheraz Ahmed",
  "authorsParsed": [
    [
      "Khan",
      "Umar",
      ""
    ],
    [
      "Saifullah",
      "",
      ""
    ],
    [
      "Agne",
      "Stefan",
      ""
    ],
    [
      "Dengel",
      "Andreas",
      ""
    ],
    [
      "Ahmed",
      "Sheraz",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 14:12:55 GMT"
    }
  ],
  "updateDate": "2024-12-16",
  "timestamp": 1734099175000,
  "abstract": "  Document classification is considered a critical element in automated\ndocument processing systems. In recent years multi-modal approaches have become\nincreasingly popular for document classification. Despite their improvements,\nthese approaches are underutilized in the industry due to their requirement for\na tremendous volume of training data and extensive computational power. In this\npaper, we attempt to address these issues by embedding textual features\ndirectly into the visual space, allowing lightweight image-based classifiers to\nachieve state-of-the-art results using small-scale datasets in document\nclassification. To evaluate the efficacy of the visual features generated from\nour approach on limited data, we tested on the standard dataset Tobacco-3482.\nOur experiments show a tremendous improvement in image-based classifiers,\nachieving an improvement of 4.64% using ResNet50 with no document pre-training.\nIt also sets a new record for the best accuracy of the Tobacco-3482 dataset\nwith a score of 91.14% using the image-based DocXClassifier with no document\npre-training. The simplicity of the approach, its resource requirements, and\nsubsequent results provide a good prospect for its use in industrial use cases.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "FZ7oPnmdImwSAnra6oCAmBD3EnTJAVf-w9NCRWSHaNk",
  "pdfSize": "6228268"
}