{
  "id": "2412.11899",
  "title": "Probabilistic Behavioral Aggregation: A Case Study on the Nordic Power\n  Grid",
  "authors": "Anna B\\\"uttner and Frank Hellmann",
  "authorsParsed": [
    [
      "Büttner",
      "Anna",
      ""
    ],
    [
      "Hellmann",
      "Frank",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 15:46:27 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734363987000,
  "abstract": "  This study applies the Probabilistic Behavioral Tuning (ProBeTune) framework\nto transient power grid simulations to address challenges posed by increasing\ngrid complexity. ProBeTune offers a probabilistic approach to model\naggregation, using a behavioral distance measure to quantify and minimize\ndiscrepancies between a full-scale system and a simplified model. We\ndemonstrate the effectiveness of ProBeTune on the Nordic5 (N5) test case, a\nmodel representing the Nordic power grid with complex nodal dynamics and a high\nshare of RESs. We substantially reduce the complexity of the dynamics by tuning\nthe system to align with a reduced swing-equation model. We confirm the\nvalidity of the swing equation with tailored controllers and parameter\ndistributions for capturing the essential dynamics of the Nordic region. This\nreduction could allow interconnected systems like the Central European power\ngrid to treat the Nordic grid as a single dynamic actor, facilitating more\nmanageable stability assessments. The findings lay the groundwork for future\nresearch on applying ProBeTune to microgrids and other complex sub-systems,\naiming to enhance scalability and accuracy in power grid modeling amidst rising\ncomplexity.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Systems and Control",
    "Computer Science/Systems and Control"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "hEPqZZhEITswd111vlOYi2QLzpkC7oZSTvLCpgvQPjk",
  "pdfSize": "1597078"
}