{"id":"2412.05871","title":"MID: A Comprehensive Shore-Based Dataset for Multi-Scale Dense Ship\n  Occlusion and Interaction Scenarios","authors":"Yugang Chang, Hongyu Chen, Fei Wang, Chengcheng Chen, and Weiming Zeng","authorsParsed":[["Chang","Yugang",""],["Chen","Hongyu",""],["Wang","Fei",""],["Chen","Chengcheng",""],["Zeng","Weiming",""]],"versions":[{"version":"v1","created":"Sun, 8 Dec 2024 09:34:23 GMT"},{"version":"v2","created":"Tue, 10 Dec 2024 04:10:56 GMT"},{"version":"v3","created":"Wed, 11 Dec 2024 03:58:47 GMT"}],"updateDate":"2024-12-12","timestamp":1733650463000,"abstract":"  This paper introduces the Maritime Ship Navigation Behavior Dataset (MID),\ndesigned to address challenges in ship detection within complex maritime\nenvironments using Oriented Bounding Boxes (OBB). MID contains 5,673 images\nwith 135,884 finely annotated target instances, supporting both supervised and\nsemi-supervised learning. It features diverse maritime scenarios such as ship\nencounters under varying weather, docking maneuvers, small target clustering,\nand partial occlusions, filling critical gaps in datasets like HRSID, SSDD, and\nNWPU-10. MID's images are sourced from high-definition video clips of\nreal-world navigation across 43 water areas, with varied weather and lighting\nconditions (e.g., rain, fog). Manually curated annotations enhance the\ndataset's variety, ensuring its applicability to real-world demands in busy\nports and dense maritime regions. This diversity equips models trained on MID\nto better handle complex, dynamic environments, supporting advancements in\nmaritime situational awareness. To validate MID's utility, we evaluated 10\ndetection algorithms, providing an in-depth analysis of the dataset, detection\nresults from various models, and a comparative study of baseline algorithms,\nwith a focus on handling occlusions and dense target clusters. The results\nhighlight MID's potential to drive innovation in intelligent maritime traffic\nmonitoring and autonomous navigation systems. The dataset will be made publicly\navailable at https://github.com/VirtualNew/MID_DataSet.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"mer189OxZcetyYB8Mr410e3ZrIuk04fAHOhz6gyH3yg","pdfSize":"28790481"}