{
  "id": "2412.01299",
  "title": "Cross-Modal Visual Relocalization in Prior LiDAR Maps Utilizing\n  Intensity Textures",
  "authors": "Qiyuan Shen, Hengwang Zhao, Weihao Yan, Chunxiang Wang, Tong Qin, Ming\n  Yang",
  "authorsParsed": [
    [
      "Shen",
      "Qiyuan",
      ""
    ],
    [
      "Zhao",
      "Hengwang",
      ""
    ],
    [
      "Yan",
      "Weihao",
      ""
    ],
    [
      "Wang",
      "Chunxiang",
      ""
    ],
    [
      "Qin",
      "Tong",
      ""
    ],
    [
      "Yang",
      "Ming",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 09:13:14 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733130794000,
  "abstract": "  Cross-modal localization has drawn increasing attention in recent years,\nwhile the visual relocalization in prior LiDAR maps is less studied. Related\nmethods usually suffer from inconsistency between the 2D texture and 3D\ngeometry, neglecting the intensity features in the LiDAR point cloud. In this\npaper, we propose a cross-modal visual relocalization system in prior LiDAR\nmaps utilizing intensity textures, which consists of three main modules: map\nprojection, coarse retrieval, and fine relocalization. In the map projection\nmodule, we construct the database of intensity channel map images leveraging\nthe dense characteristic of panoramic projection. The coarse retrieval module\nretrieves the top-K most similar map images to the query image from the\ndatabase, and retains the top-K' results by covisibility clustering. The fine\nrelocalization module applies a two-stage 2D-3D association and a covisibility\ninlier selection method to obtain robust correspondences for 6DoF pose\nestimation. The experimental results on our self-collected datasets demonstrate\nthe effectiveness in both place recognition and pose estimation tasks.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Robotics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "tByqN4w5ViVyvDCfpYUozwJh3ECp7HypVsWLoO3fcsg",
  "pdfSize": "2133308"
}