{"id":"2412.17313","title":"Weak signals, strong debates: Density dependence and population\n  regulation through the lens of model uncertainty","authors":"Evan C. Johnson","authorsParsed":[["Johnson","Evan C.",""]],"versions":[{"version":"v1","created":"Mon, 23 Dec 2024 06:07:49 GMT"}],"updateDate":"2024-12-24","timestamp":1734934069000,"abstract":"  Ecologists have long argued about the strength of density dependence and\npopulation regulation, respectively defined as the short-term and long-term\nrates of return to equilibrium. Here, I give three arguments for the\nintractability of population regulation. First, the ecological literature\nflip-flops on the strength of evidence for population regulation; by simple\ninduction, population regulation should remain uncertain. Second, there is an\nanalogous debate in economics about whether shocks to Gross Domestic Product\nhave transient or permanent effects. This literature is extensive and\nsophisticated, yet there is no consensus, implying that more research will not\nresolve the issue in ecology. Third, using a variety of time series models and\nthe Global Population Dynamics Database, I show that one's conclusions about\npopulation regulation are almost entirely dependent on model structure. This\ninsurmountable model uncertainty explains why the strength of regulation is\nunresolved despite decades of research. However, it is possible to achieve the\nmore modest goal of estimating density dependence. I introduce a novel measure\nof density dependence -- the effective autoregressive parameter -- which is\nconceptually intuitive and easy to calculate with simulations. The strength of\ndensity dependence varies significantly across populations, with an average\nthat can be characterized as moderate: perturbations have an average half-life\nof 3 years. Rather than a universal balance of nature, stability varies widely\nacross populations in ways that correlate with life history and taxonomy.\n","subjects":["Quantitative Biology/Populations and Evolution"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Q7RtXrJJQkKhlBWQxCk-1Q41m8TY2Gtd4IDhlZGCTq8","pdfSize":"2280290"}