{
  "id": "2412.18412",
  "title": "Examination of the Relationship Between Spectral Type and Stellar\n  Rotational Velocity in $\\sim$50,000 Single Stars",
  "authors": "Boran Mert, Usta Ahmet, Kayhan Cenk",
  "authorsParsed": [
    [
      "Mert",
      "Boran",
      ""
    ],
    [
      "Ahmet",
      "Usta",
      ""
    ],
    [
      "Cenk",
      "Kayhan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 24 Dec 2024 13:00:15 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1735045215000,
  "abstract": "  In this study, we present the results of the relationship between spectral\ntype (ST) and the projected stellar rotational velocity ($vsini$), utilising a\nsample of approximately 50,000 single stars across a range of evolutionary\nstages. The STs of the stars included in this study span a broad range, from O0\nto M9. We examine the stars in our data set, which has been divided into two\ngroups according to ST and luminosity class (LC). The groups were conducted an\ninvestigation into the relationship between the mean $vsini$ ($\\langle vsini\n\\rangle$) and STs, as well as the dependence of $\\langle vsini \\rangle$ on STs\nand LCs. The rationale for investigating the two subgroups separately is to\ntake into account for the evolutionary status of the stars and ascertain the\nimpact on stellar rotation. The results demonstrate a notable decline in\n$\\langle vsini \\rangle$ as the spectral type progresses from early to late\ntypes. In particular, we found a significant decrease in $\\langle vsini\n\\rangle$ values, amounting to approximately 100 km/s, between hot stars (STs O0\nto F2) and cool stars (STs F2 to M9). Moreover, a reduction in $\\langle vsini\n\\rangle$ is discernible as stars evolve, with this trend being most pronounced\nin evolutionary stages beyond the subgiant phase.\n",
  "subjects": [
    "Astrophysics/Solar and Stellar Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "nH72cODXi9mla3avOIVPILSuNAumyJrfUeRZCkg6GkE",
  "pdfSize": "980270"
}