{
  "id": "2412.15930",
  "title": "Propagation of untwisting solar jets from the low-beta corona into the\n  super-Alfv\\'enic wind: Testing a solar origin scenario for switchbacks",
  "authors": "Jade Touresse, Etienne Pariat, Clara Froment, Valentin Aslanyan, Peter\n  F. Wyper and Louis Seyfritz",
  "authorsParsed": [
    [
      "Touresse",
      "Jade",
      ""
    ],
    [
      "Pariat",
      "Etienne",
      ""
    ],
    [
      "Froment",
      "Clara",
      ""
    ],
    [
      "Aslanyan",
      "Valentin",
      ""
    ],
    [
      "Wyper",
      "Peter F.",
      ""
    ],
    [
      "Seyfritz",
      "Louis",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 14:22:49 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734704569000,
  "abstract": "  Parker Solar Probe's (PSP) discovery of the prevalence of switchbacks (SBs),\nlocalised magnetic deflections in the nascent solar wind, has sparked interest\nin uncovering their origins. A prominent theory suggests these SBs originate in\nthe lower corona through magnetic reconnection processes, closely linked to\nsolar jet phenomena. Jets are impulsive events, observed across scales and\nsolar atmosphere layers, associated with the release of magnetic twist and\nhelicity. This study examines whether self-consistent jets can form and\npropagate into the super-Alfv\\'enic wind, assesses the impact of distinct\nParker solar wind profiles on jet dynamics, and determines if jet-induced\nmagnetic untwisting waves display signatures typical of SBs. We employed\nparametric 3D numerical MHD simulations using the ARMS code to model the\nself-consistent generation of solar jets. Our study focuses on the propagation\nof solar jets in distinct atmospheric plasma $\\beta$ and Alfv\\'en velocity\nprofiles, including a Parker solar wind. Our findings show that self-consistent\ncoronal jets can form and propagate into the super-Alfv\\'enic wind. Notable\nstructures such as the leading Alfv\\'enic wave and trailing dense-jet region\nwere consistently observed across diverse plasma $\\beta$ atmospheres. The jet\npropagation dynamics are significantly influenced by atmospheric variations,\nwith changes in Alfv\\'en velocity profiles affecting the group velocity and\npropagation ratio of the leading and trailing structures. U-loops, prevalent at\njet onset, do not persist in the low-$\\beta$ corona, but magnetic untwisting\nwaves associated with jets show SB-like signatures. However, full-reversal SBs\nwere not observed. These findings may explain the absence of full reversal SBs\nin the sub-Alfv\\'enic wind and illustrate the propagation of magnetic\ndeflections through jet-like events, shedding light on possible SB formation\nprocesses.\n",
  "subjects": [
    "Astrophysics/Solar and Stellar Astrophysics",
    "Physics/Plasma Physics",
    "Physics/Space Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "yum8CGsYrVjalx8qdj7UICBQchlz7x3NTR5UOqz8pcQ",
  "pdfSize": "3504254"
}