{"id":"2412.11434","title":"Auto-bidding in real-time auctions via Oracle Imitation Learning (OIL)","authors":"Alberto Silvio Chiappa, Briti Gangopadhyay, Zhao Wang, Shingo\n  Takamatsu","authorsParsed":[["Chiappa","Alberto Silvio",""],["Gangopadhyay","Briti",""],["Wang","Zhao",""],["Takamatsu","Shingo",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 04:21:35 GMT"},{"version":"v2","created":"Tue, 17 Dec 2024 08:56:42 GMT"}],"updateDate":"2024-12-18","timestamp":1734322895000,"abstract":"  Online advertising has become one of the most successful business models of\nthe internet era. Impression opportunities are typically allocated through\nreal-time auctions, where advertisers bid to secure advertisement slots.\nDeciding the best bid for an impression opportunity is challenging, due to the\nstochastic nature of user behavior and the variability of advertisement traffic\nover time. In this work, we propose a framework for training auto-bidding\nagents in multi-slot second-price auctions to maximize acquisitions (e.g.,\nclicks, conversions) while adhering to budget and cost-per-acquisition (CPA)\nconstraints. We exploit the insight that, after an advertisement campaign\nconcludes, determining the optimal bids for each impression opportunity can be\nframed as a multiple-choice knapsack problem (MCKP) with a nonlinear objective.\nWe propose an \"oracle\" algorithm that identifies a near-optimal combination of\nimpression opportunities and advertisement slots, considering both past and\nfuture advertisement traffic data. This oracle solution serves as a training\ntarget for a student network which bids having access only to real-time\ninformation, a method we term Oracle Imitation Learning (OIL). Through\nnumerical experiments, we demonstrate that OIL achieves superior performance\ncompared to both online and offline reinforcement learning algorithms, offering\nimproved sample efficiency. Notably, OIL shifts the complexity of training\nauto-bidding agents from crafting sophisticated learning algorithms to solving\na nonlinear constrained optimization problem efficiently.\n","subjects":["Computer Science/Machine Learning","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"-93O3n1T1WE6KQBedqiCkfHFMjt7UmZsSKOvQ3OYUhM","pdfSize":"3615599"}