{"id":"2412.03132","title":"Galaxy mass dependence of metal-enrichment of nuclear star clusters","authors":"Wenhe Lyu, Hong-Xin Zhang, Sanjaya Paudel, Tie Li, Yimeng Tang,\n  Guangwen Chen, Xu Kong, Eric W. Peng","authorsParsed":[["Lyu","Wenhe",""],["Zhang","Hong-Xin",""],["Paudel","Sanjaya",""],["Li","Tie",""],["Tang","Yimeng",""],["Chen","Guangwen",""],["Kong","Xu",""],["Peng","Eric W.",""]],"versions":[{"version":"v1","created":"Wed, 4 Dec 2024 08:53:46 GMT"}],"updateDate":"2024-12-05","timestamp":1733302426000,"abstract":"  Nuclear Star Clusters (NSCs) are commonly found in galaxy centers, but their\ndominant formation mechanisms remain elusive. We perform a consistent analysis\nof stellar populations of 97 nearby NSCs, based on VLT spectroscopic data. The\nsample covers a galaxy stellar mass range of 10$^{7}$ to 10$^{11}$ M$_{\\odot}$\nand is more than 3$\\times$ larger than any previous studies. We identify three\ngalaxy stellar mass regimes with distinct NSC properties. In the low-mass\nregime of $\\log M_{\\rm host}$ $\\lesssim$ 8.5, nearly all NSCs have\nmetallicities lower than circum-NSC host but similar to typical red globular\nclusters (GCs), supporting the GC inspiral-merger scenario of NSC formation. In\nthe high-mass regime of $\\log M_{\\rm host}$ $\\gtrsim$ 9.5, nearly all NSCs have\nhigher metallicities than circum-NSC host and red GCs, suggesting significant\ncontributions from in-situ star formation (SF). In the intermediate-mass\nregime, a comparable fraction of NSCs have higher or lower metallicities than\ncircum-NSC host and red GCs, with no clear dependence on NSC mass, suggesting\nintermittent in-situ SF. The majority of NSCs with higher metallicities than\ntheir host exhibit a negative age$-$metallicity correlation, providing clear\nevidence of long-term chemical enrichment. The average NSC$-$host metallicity\ndifference peaks broadly around $\\log M_{\\rm host} \\sim 9.8$ and declines\ntowards both higher and lower galaxy mass. We find that the efficiency of\ndynamical friction-driven inspiral of GCs observed in present-day galaxies can\nexplain the NSC mass at $\\log M_{\\rm host} \\lesssim 9.5$ but falls short of\nobserved ones at higher galaxy mass, reinforcing our conclusions based on\nstellar population analysis.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"a7WKsfcrvzrJdBc4nMd4pOFKPLRQvo84f3Q1naUpqaw","pdfSize":"2486953"}