{
  "id": "2412.17945",
  "title": "Evolution of steam worlds: energetic aspects",
  "authors": "Artyom Aguichine, Natalie Batalha, Jonathan J. Fortney, Nadine\n  Nettelmann, James E. Owen, Eliza M.-R. Kempton",
  "authorsParsed": [
    [
      "Aguichine",
      "Artyom",
      ""
    ],
    [
      "Batalha",
      "Natalie",
      ""
    ],
    [
      "Fortney",
      "Jonathan J.",
      ""
    ],
    [
      "Nettelmann",
      "Nadine",
      ""
    ],
    [
      "Owen",
      "James E.",
      ""
    ],
    [
      "Kempton",
      "Eliza M. -R.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 19:57:10 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1734983830000,
  "abstract": "  Sub-Neptunes occupy an intriguing region of planetary mass-radius space,\nwhere theoretical models of interior structure predict that they could be\nwater-rich, where water is in steam and supercritical state. Such planets are\nexpected to evolve according to the same principles as canonical H$_2$-He rich\nplanets, but models that assume a water-dominated atmosphere consistent with\nthe interior have not been developed yet. Here, we present a state of the art\nstructure and evolution model for water-rich sub-Neptunes. Our set-up combines\nan existing atmosphere model that controls the heat loss from the planet, and\nan interior model that acts as the reservoir of energy. We compute evolutionary\ntracks of planetary radius over time. We find that planets with pure water\nenvelopes have smaller radii than predicted by previous models, and the change\nin radius is much slower (within $\\sim$10\\%). We also find that water in the\ndeep interior is colder than previously suggested, and can transition from\nplasma state to superionic ice, which can have additional implications for\ntheir evolution. We provide a grid of evolutionary tracks that can be used to\ninfer the bulk water content of sub-Neptunes. We compare the bulk water content\ninferred by this model and other models available in the literature, and find\nstatistically significant differences between models when the uncertainty on\nmeasured mass and radius are both smaller than 10\\%. This study shows the\nimportance of pursuing efforts in the modeling of volatile-rich planets, and\nhow to connect them to observations.\n",
  "subjects": [
    "Astrophysics/Earth and Planetary Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "-CDZvq3sGR-X1TbqN6lR0FjZUVFKRcKZAPTSZ-uiccc",
  "pdfSize": "1280370"
}