{
  "id": "2412.02005",
  "title": "Energy level structure of diamond silicon vacancy centers in an off-axis\n  magnetic field",
  "authors": "Shuhao Wu, Xinzhu Li, Ian Gallagher, Lexington Mandachi, Benjamin\n  Lawrie, and Hailin Wang",
  "authorsParsed": [
    [
      "Wu",
      "Shuhao",
      ""
    ],
    [
      "Li",
      "Xinzhu",
      ""
    ],
    [
      "Gallagher",
      "Ian",
      ""
    ],
    [
      "Mandachi",
      "Lexington",
      ""
    ],
    [
      "Lawrie",
      "Benjamin",
      ""
    ],
    [
      "Wang",
      "Hailin",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 22:21:44 GMT"
    }
  ],
  "updateDate": "2024-12-04",
  "timestamp": 1733178104000,
  "abstract": "  We report the development of an experimental approach that can characterize\nthe energy level structure of an individual silicon vacancy (SiV) center in a\nmagnetic field and extract the key parameters for the energy level structure.\nThis approach builds upon a theoretical model that includes effects of the\nstatic strain, dynamic Jahn-Teller coupling, and magnetic field and introduces\ntwo coupling rates, one each for the ground and the excited states, to\ncharacterize the combined effects of strain and Jahn-Teller coupling. With the\nuse of an analytical expression for the energy level structure of the SiV\ncenter under a transverse magnetic field, these two coupling rates can be\ndirectly derived from the measurement of the frequency separation between two\nspin-conserved transitions in a photoluminescence excitation spectrum and the\nmeasurement of the coherent population trapping resonance related to the SiV\nground spin states. Additional experimental studies on the dependence of the\nenergy level structure on the magnetic field amplitude and direction further\nverify the theoretical model and reveal contributions from unequal orbital\nmagnetic coupling for the ground and excited states.\n",
  "subjects": [
    "Condensed Matter/Mesoscale and Nanoscale Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "eG8HqEYzsv9cnnPpRB5cDwr6Mid7Z-K6jveGHb5jK4U",
  "pdfSize": "807654"
}