{
  "id": "2412.06006",
  "title": "A brief introduction to the diffusion Monte Carlo method and the\n  fixed-node approximation",
  "authors": "Alfonso Annarelli and Dario Alf\\`e and Andrea Zen",
  "authorsParsed": [
    [
      "Annarelli",
      "Alfonso",
      ""
    ],
    [
      "Alfè",
      "Dario",
      ""
    ],
    [
      "Zen",
      "Andrea",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 8 Dec 2024 17:36:04 GMT"
    }
  ],
  "updateDate": "2025-01-08",
  "timestamp": 1733679364000,
  "abstract": "  Quantum Monte Carlo (QMC) methods represent a powerful family of\ncomputational techniques for tackling complex quantum many-body problems and\nperforming calculations of stationary state properties. QMC is among the most\naccurate and powerful approaches to the study of electronic structure, but its\napplication is often hindered by a steep learning curve, hence it is rarely\naddressed in undergraduate and postgraduate classes. This tutorial is a step\ntowards filling this gap. We offer an introduction to the diffusion Monte Carlo\n(DMC) method, which aims to solve the imaginary time Schr\\\"odinger equation\nthrough stochastic sampling of the configuration space. Starting from the\ntheoretical foundations, the discussion leads naturally to the formulation of a\nstep-by-step algorithm. To illustrate how the method works in simplified\nscenarios, examples such as the harmonic oscillator and the hydrogen atom are\nprovided. The discussion extends to the fixed-node approximation, a crucial\napproach for addressing the fermionic sign problem in multi-electron systems.\nIn particular, we examine the influence of trial wavefunction nodal surfaces on\nthe accuracy of DMC energy by evaluating results from a non-interacting\ntwo-fermion system. Extending the method to excited states is feasible in\nprinciple, but some additional considerations are needed, supported by\npractical insights. By addressing the fundamental concepts from a hands-on\nperspective, we hope this tutorial will serve as a valuable guide for\nresearchers and students approaching DMC for the first time.\n",
  "subjects": [
    "Condensed Matter/Materials Science",
    "Physics/Computational Physics",
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "5GHFM3CRKCJgKIi_PYLXe3ZtDP5_NQAzpAo1azuW3QQ",
  "pdfSize": "4801515"
}