{"id":"2412.03718","title":"ParetoFlow: Guided Flows in Multi-Objective Optimization","authors":"Ye Yuan, Can Chen, Christopher Pal, Xue Liu","authorsParsed":[["Yuan","Ye",""],["Chen","Can",""],["Pal","Christopher",""],["Liu","Xue",""]],"versions":[{"version":"v1","created":"Wed, 4 Dec 2024 21:14:18 GMT"},{"version":"v2","created":"Thu, 20 Feb 2025 13:31:09 GMT"}],"updateDate":"2025-02-21","timestamp":1733346858000,"abstract":"  In offline multi-objective optimization (MOO), we leverage an offline dataset\nof designs and their associated labels to simultaneously minimize multiple\nobjectives. This setting more closely mirrors complex real-world problems\ncompared to single-objective optimization. Recent works mainly employ\nevolutionary algorithms and Bayesian optimization, with limited attention given\nto the generative modeling capabilities inherent in such data. In this study,\nwe explore generative modeling in offline MOO through flow matching, noted for\nits effectiveness and efficiency. We introduce ParetoFlow, specifically\ndesigned to guide flow sampling to approximate the Pareto front. Traditional\npredictor (classifier) guidance is inadequate for this purpose because it\nmodels only a single objective. In response, we propose a multi-objective\npredictor guidance module that assigns each sample a weight vector,\nrepresenting a weighted distribution across multiple objective predictions. A\nlocal filtering scheme is introduced to address non-convex Pareto fronts. These\nweights uniformly cover the entire objective space, effectively directing\nsample generation towards the Pareto front. Since distributions with similar\nweights tend to generate similar samples, we introduce a neighboring evolution\nmodule to foster knowledge sharing among neighboring distributions. This module\ngenerates offspring from these distributions, and selects the most promising\none for the next iteration. Our method achieves state-of-the-art performance\nacross various tasks.\n","subjects":["Computer Science/Computational Engineering, Finance, and Science","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"XJz5Gos66TspoqV6qr93nFwjcPQpas9g5qwjjliwYtQ","pdfSize":"1733053"}