{"id":"2412.16220","title":"Cross-Attention Graph Neural Networks for Inferring Gene Regulatory\n  Networks with Skewed Degree Distribution","authors":"Jiaqi Xiong, Nan Yin, Shiyang Liang, Haoyang Li, Yingxu Wang, Duo Ai,\n  Fang Pan and Jingjie Wang","authorsParsed":[["Xiong","Jiaqi",""],["Yin","Nan",""],["Liang","Shiyang",""],["Li","Haoyang",""],["Wang","Yingxu",""],["Ai","Duo",""],["Pan","Fang",""],["Wang","Jingjie",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 10:56:40 GMT"},{"version":"v2","created":"Tue, 24 Dec 2024 06:17:31 GMT"},{"version":"v3","created":"Thu, 9 Jan 2025 14:55:29 GMT"}],"updateDate":"2025-01-10","timestamp":1734519400000,"abstract":"  Inferencing Gene Regulatory Networks (GRNs) from gene expression data is a\npivotal challenge in systems biology, and several innovative computational\nmethods have been introduced. However, most of these studies have not\nconsidered the skewed degree distribution of genes. Specifically, some genes\nmay regulate multiple target genes while some genes may be regulated by\nmultiple regulator genes. Such a skewed degree distribution issue significantly\ncomplicates the application of directed graph embedding methods. To tackle this\nissue, we propose the Cross-Attention Complex Dual Graph Embedding Model\n(XATGRN). Our XATGRN employs a cross-attention mechanism to effectively capture\nintricate gene interactions from gene expression profiles. Additionally, it\nuses a Dual Complex Graph Embedding approach to manage the skewed degree\ndistribution, thereby ensuring precise prediction of regulatory relationships\nand their directionality. Our model consistently outperforms existing\nstate-of-the-art methods across various datasets, underscoring its efficacy in\nelucidating complex gene regulatory mechanisms. Our codes used in this paper\nare publicly available at: https://github.com/kikixiong/XATGRN.\n","subjects":["Quantitative Biology/Quantitative Methods","Computer Science/Artificial Intelligence","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"quBextUoMmuR2ntxZ5BhbV9f1vsnKYA6uIZtqNAbLQo","pdfSize":"1007059"}