{
  "id": "2412.17664",
  "title": "Effect of arsenic doping on structural and electronic properties of\n  MoSe$_2$ monolayer: an ab initio study",
  "authors": "B. Bradji, M. L. Benkhedir",
  "authorsParsed": [
    [
      "Bradji",
      "B.",
      ""
    ],
    [
      "Benkhedir",
      "M. L.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 15:44:28 GMT"
    },
    {
      "version": "v2",
      "created": "Mon, 30 Dec 2024 16:25:24 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1734968668000,
  "abstract": "  In this paper, we studied the structural and electronic properties of\nMoSe$_2$ monolayer in its pure and doped forms, using the density functional\ntheory (DFT), and the calculations were performed using Quantum Espresso (QE)\nsoftware package. The doped systems are a MoSe$_2$ monolayer with a vacancy in\nMo site (Mo vacancy system), the MoSe$_2$ monolayer with an As atom as\nsubstitutional for Mo atom (As(Mo) doped system) and an MoSe$_2$ monolayer with\nAs atom in an interstitial site in the hollow location of the center of one\nring of the structure between the plane Mo atoms and the plane containing Se\natoms (As interstitial system). We calculated the formation energy of various\nstructures studied in Se-rich condition. We found that the As(Mo) doped system\nis a favorable configuration, whereas the As interstitial system is metastable.\nDifferent defects introduce midgap levels, which were interpreted according to\nthe orbitals involved in their formation using the analysis of the band\nstructure and DOS and PDOS of each system. The energy gap increases in all\nsystem structures and its value ranged between 1.5 eV and 1.73 eV, the Fermi\nlevel shifts toward the valence band for the Mo vacancy system, and As(Mo)\ndoped system which suggests that it can be a $p$-type semiconductor, whereas\nFermi level shifts to the conduction band for As interstitial system and\nsuggests a $n$-type semiconductor behavior. The obtained results enable us to\npredict the possibility of using these systems in many applications, since it\ncan be used in the As(Mo) doped system in photocatalysis or in photovoltaic\napplications in the visible light, and As interstitial system can be used in\nelectronics applications in the infrared field.\n",
  "subjects": [
    "Condensed Matter/Materials Science",
    "Condensed Matter/Mesoscale and Nanoscale Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "279hcc6-3T3MsmcGbZ1lkH7siw6-HAihZ5ITuSDzHHk",
  "pdfSize": "604522"
}