{
  "id": "2412.13010",
  "title": "Measurement of Medial Elbow Joint Space using Landmark Detection",
  "authors": "Shizuka Akahori, Shotaro Teruya, Pragyan Shrestha, Yuichi Yoshii,\n  Ryuhei Michinobu, Satoshi Iizuka, Itaru Kitahara",
  "authorsParsed": [
    [
      "Akahori",
      "Shizuka",
      ""
    ],
    [
      "Teruya",
      "Shotaro",
      ""
    ],
    [
      "Shrestha",
      "Pragyan",
      ""
    ],
    [
      "Yoshii",
      "Yuichi",
      ""
    ],
    [
      "Michinobu",
      "Ryuhei",
      ""
    ],
    [
      "Iizuka",
      "Satoshi",
      ""
    ],
    [
      "Kitahara",
      "Itaru",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 15:32:12 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 25 Feb 2025 09:52:03 GMT"
    }
  ],
  "updateDate": "2025-02-26",
  "timestamp": 1734449532000,
  "abstract": "  Ultrasound imaging of the medial elbow is crucial for the early diagnosis of\nUlnar Collateral Ligament (UCL) injuries. Specifically, measuring the elbow\njoint space in ultrasound images is used to assess the valgus instability of\nthe elbow caused by UCL injuries. To automate this measurement, a model trained\non a precisely annotated dataset is necessary; however, no publicly available\ndataset exists to date. This study introduces a novel ultrasound medial elbow\ndataset to measure the joint space. The dataset comprises 4,201 medial elbow\nultrasound images from 22 subjects, with landmark annotations on the humerus\nand ulna, based on the expertise of three orthopedic surgeons. We evaluated\njoint space measurement methods on our proposed dataset using heatmap-based,\nregression-based, and token-based landmark detection methods. While\nheatmap-based landmark detection methods generally achieve high accuracy, they\nsometimes produce multiple peaks on a heatmap, leading to incorrect detection.\nTo mitigate this issue and enhance landmark localization, we propose Shape\nSubspace (SS) landmark refinement by measuring geometrical similarities between\nthe detected and reference landmark positions. The results show that the mean\njoint space measurement error is 0.116 mm when using HRNet. Furthermore, SS\nlandmark refinement can reduce the mean absolute error of landmark positions by\n0.010 mm with HRNet and by 0.103 mm with ViTPose on average. These highlight\nthe potential for high-precision, real-time diagnosis of UCL injuries by\naccurately measuring joint space. Lastly, we demonstrate point-based\nsegmentation for the humerus and ulna using the detected landmarks as inputs.\nOur dataset will be publicly available at\nhttps://github.com/Akahori000/Ultrasound-Medial-Elbow-Dataset\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "Vl6p-C2OuYtOuXtx3z1YYlJ6gQrGzLFQ4hbjvWg6N6A",
  "pdfSize": "27053761"
}