{
  "id": "2412.11875",
  "title": "Bayesian Surrogate Training on Multiple Data Sources: A Hybrid Modeling\n  Strategy",
  "authors": "Philipp Reiser, Paul-Christian B\\\"urkner, Anneli Guthke",
  "authorsParsed": [
    [
      "Reiser",
      "Philipp",
      ""
    ],
    [
      "Bürkner",
      "Paul-Christian",
      ""
    ],
    [
      "Guthke",
      "Anneli",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 15:27:28 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734362848000,
  "abstract": "  Surrogate models are often used as computationally efficient approximations\nto complex simulation models, enabling tasks such as solving inverse problems,\nsensitivity analysis, and probabilistic forward predictions, which would\notherwise be computationally infeasible. During training, surrogate parameters\nare fitted such that the surrogate reproduces the simulation model's outputs as\nclosely as possible. However, the simulation model itself is merely a\nsimplification of the real-world system, often missing relevant processes or\nsuffering from misspecifications e.g., in inputs or boundary conditions. Hints\nabout these might be captured in real-world measurement data, and yet, we\ntypically ignore those hints during surrogate building. In this paper, we\npropose two novel probabilistic approaches to integrate simulation data and\nreal-world measurement data during surrogate training. The first method trains\nseparate surrogate models for each data source and combines their predictive\ndistributions, while the second incorporates both data sources by training a\nsingle surrogate. We show the conceptual differences and benefits of the two\napproaches through both synthetic and real-world case studies. The results\ndemonstrate the potential of these methods to improve predictive accuracy,\npredictive coverage, and to diagnose problems in the underlying simulation\nmodel. These insights can improve system understanding and future model\ndevelopment.\n",
  "subjects": [
    "Statistics/Machine Learning",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "y73Kl5TFqrkzhoC0gs6Pqk_fnSeZMsdmbE-7nvxH6_M",
  "pdfSize": "4488330"
}