{"id":"2412.08639","title":"Fast Prompt Alignment for Text-to-Image Generation","authors":"Khalil Mrini, Hanlin Lu, Linjie Yang, Weilin Huang, Heng Wang","authorsParsed":[["Mrini","Khalil",""],["Lu","Hanlin",""],["Yang","Linjie",""],["Huang","Weilin",""],["Wang","Heng",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 18:58:41 GMT"}],"updateDate":"2024-12-12","timestamp":1733943521000,"abstract":"  Text-to-image generation has advanced rapidly, yet aligning complex textual\nprompts with generated visuals remains challenging, especially with intricate\nobject relationships and fine-grained details. This paper introduces Fast\nPrompt Alignment (FPA), a prompt optimization framework that leverages a\none-pass approach, enhancing text-to-image alignment efficiency without the\niterative overhead typical of current methods like OPT2I. FPA uses large\nlanguage models (LLMs) for single-iteration prompt paraphrasing, followed by\nfine-tuning or in-context learning with optimized prompts to enable real-time\ninference, reducing computational demands while preserving alignment fidelity.\nExtensive evaluations on the COCO Captions and PartiPrompts datasets\ndemonstrate that FPA achieves competitive text-image alignment scores at a\nfraction of the processing time, as validated through both automated metrics\n(TIFA, VQA) and human evaluation. A human study with expert annotators further\nreveals a strong correlation between human alignment judgments and automated\nscores, underscoring the robustness of FPA's improvements. The proposed method\nshowcases a scalable, efficient alternative to iterative prompt optimization,\nenabling broader applicability in real-time, high-demand settings. The codebase\nis provided to facilitate further research:\nhttps://github.com/tiktok/fast_prompt_alignment\n","subjects":["Computer Science/Computation and Language","Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8SGKmh8z3O-aD4P5RBOWJc2cS4lW4VWlgG3-sWZH-d4","pdfSize":"557543"}