{
  "id": "2412.07687",
  "title": "Privacy-Preserving Customer Support: A Framework for Secure and Scalable\n  Interactions",
  "authors": "Anant Prakash Awasthi, Girdhar Gopal Agarwal, Chandraketu Singh,\n  Rakshit Varma, Sanchit Sharma",
  "authorsParsed": [
    [
      "Awasthi",
      "Anant Prakash",
      ""
    ],
    [
      "Agarwal",
      "Girdhar Gopal",
      ""
    ],
    [
      "Singh",
      "Chandraketu",
      ""
    ],
    [
      "Varma",
      "Rakshit",
      ""
    ],
    [
      "Sharma",
      "Sanchit",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 17:20:47 GMT"
    },
    {
      "version": "v2",
      "created": "Mon, 30 Dec 2024 08:29:09 GMT"
    }
  ],
  "updateDate": "2025-01-03",
  "timestamp": 1733851247000,
  "abstract": "  The growing reliance on artificial intelligence (AI) in customer support has\nsignificantly improved operational efficiency and user experience. However,\ntraditional machine learning (ML) approaches, which require extensive local\ntraining on sensitive datasets, pose substantial privacy risks and compliance\nchallenges with regulations like the General Data Protection Regulation (GDPR)\nand California Consumer Privacy Act (CCPA). Existing privacy-preserving\ntechniques, such as anonymization, differential privacy, and federated\nlearning, address some concerns but face limitations in utility, scalability,\nand complexity. This paper introduces the Privacy-Preserving Zero-Shot Learning\n(PP-ZSL) framework, a novel approach leveraging large language models (LLMs) in\na zero-shot learning mode. Unlike conventional ML methods, PP-ZSL eliminates\nthe need for local training on sensitive data by utilizing pre-trained LLMs to\ngenerate responses directly. The framework incorporates real-time data\nanonymization to redact or mask sensitive information, retrieval-augmented\ngeneration (RAG) for domain-specific query resolution, and robust\npost-processing to ensure compliance with regulatory standards. This\ncombination reduces privacy risks, simplifies compliance, and enhances\nscalability and operational efficiency. Empirical analysis demonstrates that\nthe PP-ZSL framework provides accurate, privacy-compliant responses while\nsignificantly lowering the costs and complexities of deploying AI-driven\ncustomer support systems. The study highlights potential applications across\nindustries, including financial services, healthcare, e-commerce, legal\nsupport, telecommunications, and government services. By addressing the dual\nchallenges of privacy and performance, this framework establishes a foundation\nfor secure, efficient, and regulatory-compliant AI applications in customer\ninteractions.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Cryptography and Security",
    "Statistics/Applications",
    "Statistics/Methodology",
    "Statistics/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "TmCzwV7tYXDrUNP32PoDgpbXrx-BbNbXKjCCiokRNOw",
  "pdfSize": "355273"
}