{
  "id": "2412.01304",
  "title": "Analysis of metal-poor galaxy spectra in the redshift range\n  0.00574-0.05368",
  "authors": "Marcella Contini",
  "authorsParsed": [
    [
      "Contini",
      "Marcella",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 09:17:07 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733131027000,
  "abstract": "  We present an analysis of the metal-poor galaxy spectra in the redshift range\n0.00574$\\leq$z$\\leq$0.05368 which were reported by Nakajima et al (2022) in\ntheir EMPG (extreme metal poor galaxy) sample. The models account for the\nactive galactic nuclei (AGN) and the starburst (SB) galaxies, for accretion and\nejection, for the physical parameters and the element abundances. The results\nare obtained in particular for the two cases, the emitting nebula is ejected\noutward from the galaxy radiation source (RS) and the emitting nebula is\naccreted towards the RS. We adopt the code {\\sc suma} which allows to choose\nthe direction of the clouds relative to the RS. The modelling results which\nreproduce a single galaxy spectrum with the highest precision allow to classify\nthis object as an AGN ejecting, an AGN accreting, an SB ejecting or an SB\naccreting type. When more models are equally valid we suggest that the galaxy\nis the product of merging. Our results show that among the eleven sample\ngalaxies five are such. We focus on the N/O trends with the oxygen metallicity\nand with the redshift to identify the nitrogen/oxygen relative formation\nprocesses and the process-rates, respectively, for intermediate-mass stars. Our\nresults show that O/H relative abundances calculated for the sample galaxies\nare lower than solar by a factor $\\leq$5. Yet, a few values were found above\nsolar. He/H were calculated lower than solar by factors $\\leq$ 100 and N/H by\nfactors $\\leq$135.\n",
  "subjects": [
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "bObFH8skWLvo6ScKhu9vaS34nINTl2jXOtMUm_He84E",
  "pdfSize": "475142"
}