{
  "id": "2412.16574",
  "title": "Heading towards an Algebraic Heisenberg Cut",
  "authors": "Mathias Van Den Bossche and Philippe Grangier",
  "authorsParsed": [
    [
      "Bossche",
      "Mathias Van Den",
      ""
    ],
    [
      "Grangier",
      "Philippe",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 21 Dec 2024 10:39:40 GMT"
    },
    {
      "version": "v2",
      "created": "Sun, 9 Feb 2025 15:30:09 GMT"
    }
  ],
  "updateDate": "2025-02-11",
  "timestamp": 1734777580000,
  "abstract": "  In previous papers we have explained how a sequence of theorems by John von\nNeumann on infinite tensor products (ITP) can be understood as providing\nelements to support both sectorisation of the Hilbert space of large quantum\nsystems, and a mechanism of self decoherence thereof. These two effects may\nhelp understanding the articulation of the classical and quantum realms.\nHowever, as they involve considering an infinite number of quantum degrees of\nfreedom, legitimate concerns can be raised on their applicability. In this\npaper, we address explicitly the interface between both realms through the\nexample of a simplified model of a photon polarisation measurement device.\nGuided by the fact that there is von Neumann sectorisation at infinity, and by\nthe necessity of classical contexts to perform measurements, we show that this\nlimit can be under control, and that although the full force of the\nsectorisation theorems requires taking the infinite limit, early signs of the\nmacroscopic behaviour appear before infinity. In our example, this shows up in\nphotodiodes through diverging electron avalanches that simultaneously make the\nsystem classical, localise it randomly in a macroscopic sector and provide a\nmacroscopic signal. This lays the grounds for justifying the inclusion in\nquantum physics of the ITP formalism, which involves non-separable Hilbert\nspaces and potentially type-III von Neumann algebras. Such an approach could\nmake sense of the quantum-classical transition as a primarily algebraic one.\n",
  "subjects": [
    "Physics/Quantum Physics",
    "Physics/History and Philosophy of Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "KK6d4DAsPWta_2nDHiwA0ZDPUndnEzYSgxQIohfsm-A",
  "pdfSize": "210245"
}