{"id":"2412.12225","title":"DLF: Disentangled-Language-Focused Multimodal Sentiment Analysis","authors":"Pan Wang, Qiang Zhou, Yawen Wu, Tianlong Chen, Jingtong Hu","authorsParsed":[["Wang","Pan",""],["Zhou","Qiang",""],["Wu","Yawen",""],["Chen","Tianlong",""],["Hu","Jingtong",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 10:03:44 GMT"},{"version":"v2","created":"Thu, 26 Dec 2024 19:23:17 GMT"}],"updateDate":"2024-12-30","timestamp":1734343424000,"abstract":"  Multimodal Sentiment Analysis (MSA) leverages heterogeneous modalities, such\nas language, vision, and audio, to enhance the understanding of human\nsentiment. While existing models often focus on extracting shared information\nacross modalities or directly fusing heterogeneous modalities, such approaches\ncan introduce redundancy and conflicts due to equal treatment of all modalities\nand the mutual transfer of information between modality pairs. To address these\nissues, we propose a Disentangled-Language-Focused (DLF) multimodal\nrepresentation learning framework, which incorporates a feature disentanglement\nmodule to separate modality-shared and modality-specific information. To\nfurther reduce redundancy and enhance language-targeted features, four\ngeometric measures are introduced to refine the disentanglement process. A\nLanguage-Focused Attractor (LFA) is further developed to strengthen language\nrepresentation by leveraging complementary modality-specific information\nthrough a language-guided cross-attention mechanism. The framework also employs\nhierarchical predictions to improve overall accuracy. Extensive experiments on\ntwo popular MSA datasets, CMU-MOSI and CMU-MOSEI, demonstrate the significant\nperformance gains achieved by the proposed DLF framework. Comprehensive\nablation studies further validate the effectiveness of the feature\ndisentanglement module, language-focused attractor, and hierarchical\npredictions. Our code is available at https://github.com/pwang322/DLF.\n","subjects":["Computer Science/Machine Learning","Computer Science/Artificial Intelligence","Computer Science/Computation and Language","Computer Science/Multimedia"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"JwWteU6Wz5vjbN3u-z7UAp26vDASk2E2FL1X-SQSCZY","pdfSize":"8677124"}