{
  "id": "2412.07211",
  "title": "Early Solar System Turbulence Constrained by High Oxidation States of\n  the Oldest Non-Carbonaceous Planetesimals",
  "authors": "Teng Ee Yap, Konstantin Batygin, and Fran\\c{c}ois L. H. Tissot",
  "authorsParsed": [
    [
      "Yap",
      "Teng Ee",
      ""
    ],
    [
      "Batygin",
      "Konstantin",
      ""
    ],
    [
      "Tissot",
      "François L. H.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 06:08:53 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733810933000,
  "abstract": "  Early Solar System (SS) planetesimals constitute the parent bodies of most\nmeteorites investigated today. Nucleosynthetic isotope anomalies of bulk\nmeteorites have revealed a dichotomy between non-carbonaceous (NC) and\ncarbonaceous (CC) groups. Planetesimals sampling NC and CC isotopic signatures\nare conventionally thought to originate from the \"dry\" inner disk, and\nvolatile-rich outer disk, respectively, with their segregation enforced by a\npressure bump close to the water-ice sublimation line, possibly tied to\nJupiter's formation. This framework is challenged by emerging evidence that the\noldest NC planetesimals (i.e., the iron meteorites parent bodies; IMPBs) were\ncharacterized by far higher oxidation states than previously imagined,\nsuggesting abundant ($\\gtrsim$ few wt.%) liquid water in their interiors prior\nto core differentiation. In this paper, we employ a model for a degassing icy\nplanetesimal (heated by $^{26}$Al decay) to map the conditions for liquid water\nproduction therein. Our work culminates in threshold characteristic sizes for\npebbles composing the said planetesimal, under which water-ice melting occurs.\nAdopting a model for a disk evolving under both turbulence and\nmagnetohydrodynamic disk winds, and assuming pebble growth is\nfragmentation-limited, we self-consistently translate the threshold pebble size\nto lower limits on early SS turbulence. We find that if NC IMPBs were \"wet,\"\ntheir constituent pebbles must have been smaller than a few centimeters,\ncorresponding to typical values of the Shakura-Sunyaev $\\alpha_{\\nu}$\nturbulence parameter in excess of $10^{-3}$. These findings argue against a\nquiescent SS disk (for <10 AU), are concordant with astronomical constraints on\nprotoplanetary disk turbulence, and suggest pebble accretion played a secondary\nrole in building our rocky planets.\n",
  "subjects": [
    "Astrophysics/Earth and Planetary Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "sRHA6Co2k6_Mj5eAXI8KRoMkcKXh-eo-RvFdp4_DUwU",
  "pdfSize": "1456773"
}