{"id":"2412.18966","title":"ModelGrow: Continual Text-to-Video Pre-training with Model Expansion and\n  Language Understanding Enhancement","authors":"Zhefan Rao, Liya Ji, Yazhou Xing, Runtao Liu, Zhaoyang Liu, Jiaxin\n  Xie, Ziqiao Peng, Yingqing He, Qifeng Chen","authorsParsed":[["Rao","Zhefan",""],["Ji","Liya",""],["Xing","Yazhou",""],["Liu","Runtao",""],["Liu","Zhaoyang",""],["Xie","Jiaxin",""],["Peng","Ziqiao",""],["He","Yingqing",""],["Chen","Qifeng",""]],"versions":[{"version":"v1","created":"Wed, 25 Dec 2024 18:58:07 GMT"}],"updateDate":"2024-12-30","timestamp":1735153087000,"abstract":"  Text-to-video (T2V) generation has gained significant attention recently.\nHowever, the costs of training a T2V model from scratch remain persistently\nhigh, and there is considerable room for improving the generation performance,\nespecially under limited computation resources. This work explores the\ncontinual general pre-training of text-to-video models, enabling the model to\n\"grow\" its abilities based on a pre-trained foundation, analogous to how humans\nacquire new knowledge based on past experiences. There is a lack of extensive\nstudy of the continual pre-training techniques in T2V generation. In this work,\nwe take the initial step toward exploring this task systematically and propose\nModelGrow. Specifically, we break this task into two key aspects: increasing\nmodel capacity and improving semantic understanding. For model capacity, we\nintroduce several novel techniques to expand the model size, enabling it to\nstore new knowledge and improve generation performance. For semantic\nunderstanding, we propose a method that leverages large language models as\nadvanced text encoders, integrating them into T2V models to enhance language\ncomprehension and guide generation results according to detailed prompts. This\napproach enables the model to achieve better semantic alignment, particularly\nin response to complex user prompts. Extensive experiments demonstrate the\neffectiveness of our method across various metrics. The source code and the\nmodel of ModelGrow will be publicly available.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Artificial Intelligence","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"en4ZLn3kifDn8kgie7sq9CGnNAoHyKzFy7jM4xV3mCU","pdfSize":"35584762"}