{
  "id": "2412.02264",
  "title": "Technical Report on Reinforcement Learning Control on the Lucas-N\\\"ulle\n  Inverted Pendulum",
  "authors": "Maximilian Schenke, Shalbus Bukarov",
  "authorsParsed": [
    [
      "Schenke",
      "Maximilian",
      ""
    ],
    [
      "Bukarov",
      "Shalbus",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 08:37:27 GMT"
    }
  ],
  "updateDate": "2024-12-04",
  "timestamp": 1733215047000,
  "abstract": "  The discipline of automatic control is making increased use of concepts that\noriginate from the domain of machine learning. Herein, reinforcement learning\n(RL) takes an elevated role, as it is inherently designed for sequential\ndecision making, and can be applied to optimal control problems without the\nneed for a plant system model. To advance education of control engineers and\noperators in this field, this contribution targets an RL framework that can be\napplied to educational hardware provided by the Lucas-N\\\"ulle company.\nSpecifically, the goal of inverted pendulum control is pursued by means of RL,\nincluding both, swing-up and stabilization within a single holistic design\napproach. Herein, the actual learning is enabled by separating corresponding\ncomputations from the real-time control computer and outsourcing them to a\ndifferent hardware. This distributed architecture, however, necessitates\ncommunication of the involved components, which is realized via CAN bus. The\nexperimental proof of concept is presented with an applied safeguarding\nalgorithm that prevents the plant from being operated harmfully during the\ntrial-and-error training phase.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Systems and Control",
    "Computer Science/Distributed, Parallel, and Cluster Computing",
    "Computer Science/Machine Learning",
    "Computer Science/Systems and Control"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "lQHmxJHSWA1Sw9E1B-min-FfpxEzoGtxwCHeKkNyBBg",
  "pdfSize": "2681939"
}