{"id":"2412.10315","title":"Neutrino-Portal Dark Matter Detection Prospects at a Future Muon\n  Collider","authors":"Jyotismita Adhikary, Kevin J. Kelly, Felix Kling, and Sebastian\n  Trojanowski","authorsParsed":[["Adhikary","Jyotismita",""],["Kelly","Kevin J.",""],["Kling","Felix",""],["Trojanowski","Sebastian",""]],"versions":[{"version":"v1","created":"Fri, 13 Dec 2024 17:58:05 GMT"}],"updateDate":"2024-12-16","timestamp":1734112685000,"abstract":"  With no concrete evidence for non-gravitational interactions of dark matter\nto date, it is natural to wonder whether dark matter couples predominantly to\nthe Standard Model (SM)'s neutrinos. Neutrino interactions (and the possible\nexistence of additional neutrinophilic mediators) are substantially less\nunderstood than those of other SM particles, yet this picture will change\ndramatically in the coming decades with new neutrino sources. One potential new\nsource arises with the construction of a high-energy muon collider (MuCol) --\ndue to muons' instability, a MuCol is a source of high-energy collimated\nneutrinos. Importantly, since the physics of muon decays (into neutrinos) is\nvery well-understood, this leads to a neutrino flux with systematic\nuncertainties far smaller than fluxes from conventional high-energy\n(proton-sourced) neutrino beams. In this work, we study the capabilities of a\npotential neutrino detector, \"MuCol$\\nu$,\" placed ${\\sim}$100 m downstream of\nthe MuCol interaction point. The MuCol$\\nu$ detector would be especially\ncapable of searching for a neutrinophilic mediator $\\phi$ through the\nmono-neutrino scattering process $\\nu_\\mu N \\to \\mu^+ \\phi X$, exceeding\nsearches from other terrestrial approaches for $m_\\phi$ in the ${\\sim}$few MeV\n-- ten GeV range. Even with a $10$ kg-yr exposure, MuCol$\\nu$ is capable of\nsearching for well-motivated classes of thermal freeze-out and freeze-in\nneutrino-portal dark matter.\n","subjects":["Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Experiment"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"wn3LPq6jFaTg4P3T_JVoctKHww3uTEQKeWCKflxIQKI","pdfSize":"818401"}