{"id":"2412.13999","title":"Evaluation of 'Dunkelflaute' event detection methods considering grid\n  operators' needs","authors":"Benjamin Biewald, Bastien Cozian, Laurent Dubus, William Zappa,\n  Laurens Stoop","authorsParsed":[["Biewald","Benjamin",""],["Cozian","Bastien",""],["Dubus","Laurent",""],["Zappa","William",""],["Stoop","Laurens",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 16:15:09 GMT"}],"updateDate":"2024-12-19","timestamp":1734538509000,"abstract":"  Weather conditions associated with low electricity production from renewable\nenergy sources (RES) can result in challenging 'dunkelflaute' events, where\n'dunkel' means dark and 'flaute' refers to low windspeeds. In a power system\nrelying significantly on RES, such events can pose a risk for maintaining\nresource adequacy, i.e. the balance between generation and demand, particularly\nif they occur over a large geographical area and for an extended period of\ntime. This risk is further emphasized in periods of cold ('kalte') temperature,\nknown as 'kalte dunkelflaute'.\n  In this paper, we perform a literature review of different methods to\nidentify dunkelflaute events from hourly RES production and load data alone. We\nthen validate three of these methods by comparing their results with periods of\nshortage identified from a detailed power system simulation model used by grid\noperators (ERAA2023). Strengths and weaknesses of these methods are discussed\nin terms of their data requirements, ease of application, and skill in\ndetecting dunkelflaute events.\n  We find that all three 'dunkelflaute' event detection methods have some\nability to identify potential energy shortages, but none are able to detect all\nevents. Most likely other factors such as the presence of energy storage\ncapacity, non-weather-dependent outages, and model-related factors limit the\nskill of these methods. We find that all three methods perform best if the\nresidual load is used as input, rather than hourly RES production or load\nalone. Overall, we find that Otero'22 is the method that yields the best\nresults while being straightforward to implement and requiring only data with\ndaily resolution. The results hold for countries relying on a small or a large\nshare of RES production in their electricity mix.\n","subjects":["Physics/Physics and Society","Physics/Atmospheric and Oceanic Physics","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"ykSHaUH_KVgd3wEjaepIPe3ubmv4g0A-FyrMJytDWXY","pdfSize":"3977378"}