{"id":"2412.08562","title":"An End-to-End Collaborative Learning Approach for Connected Autonomous\n  Vehicles in Occluded Scenarios","authors":"Leandro Parada, Hanlin Tian, Jose Escribano, Panagiotis Angeloudis","authorsParsed":[["Parada","Leandro",""],["Tian","Hanlin",""],["Escribano","Jose",""],["Angeloudis","Panagiotis",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 17:30:08 GMT"}],"updateDate":"2024-12-12","timestamp":1733938208000,"abstract":"  Collaborative navigation becomes essential in situations of occluded\nscenarios in autonomous driving where independent driving policies are likely\nto lead to collisions. One promising approach to address this issue is through\nthe use of Vehicle-to-Vehicle (V2V) networks that allow for the sharing of\nperception information with nearby agents, preventing catastrophic accidents.\nIn this article, we propose a collaborative control method based on a V2V\nnetwork for sharing compressed LiDAR features and employing Proximal Policy\nOptimisation to train safe and efficient navigation policies. Unlike previous\napproaches that rely on expert data (behaviour cloning), our proposed approach\nlearns the multi-agent policies directly from experience in the occluded\nenvironment, while effectively meeting bandwidth limitations. The proposed\nmethod first prepossesses LiDAR point cloud data to obtain meaningful features\nthrough a convolutional neural network and then shares them with nearby CAVs to\nalert for potentially dangerous situations. To evaluate the proposed method, we\ndeveloped an occluded intersection gym environment based on the CARLA\nautonomous driving simulator, allowing real-time data sharing among agents. Our\nexperimental results demonstrate the consistent superiority of our\ncollaborative control method over an independent reinforcement learning method\nand a cooperative early fusion method.\n","subjects":["Computer Science/Robotics","Computer Science/Multiagent Systems"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"CgaUAd1klL9dYygJg0FWNFI-yzq8djqwpnyMTcHcoQM","pdfSize":"3041183"}