{"id":"2412.10763","title":"Impact of Trip Distance Distribution Time Dependency and Aggregation\n  Levels in Bathtub Models -- A Comparative Simulation Analysis","authors":"Jiayi Guo, Irene Mart\\'inez, Gon\\c{c}alo Correia, Bart van Arem","authorsParsed":[["Guo","Jiayi",""],["Martínez","Irene",""],["Correia","Gonçalo",""],["van Arem","Bart",""]],"versions":[{"version":"v1","created":"Sat, 14 Dec 2024 09:20:11 GMT"}],"updateDate":"2024-12-17","timestamp":1734168011000,"abstract":"  Bathtub models are used to study urban traffic within a certain area. They do\nnot require to take into account the detailed network topology. The emergence\nof different bathtub models has raised the question of which model can provide\nmore robust and accurate results under different demand scenarios and network\nproperties. This paper presents a comparative simulation analysis of the\naccumulation-based model and trip-based models under static and dynamic trip\ndistance distribution (TDD) scenarios. Network accumulation was used to\nvalidate and compare the performance of the bathtub models with results from\nthe macroscopic traffic simulation with dynamic traffic assignment. Three\nnetworks were built to explore the effect of network properties on the accuracy\nof bathtub models. Two are from the network of Delft, the Netherlands, and one\nis a reference toy network. The findings show that the time dependency of TDD\ncan increase the errors in bathtub models. Using TDD in different aggregation\nlevels can significantly influence the performance of bathtub models during\ndemand transition periods. The state transition speed of networks is also found\nto be influential. Future research could explore the effects of dynamic TDD\nunder congested situations and develop enhanced bathtub models that can better\naccount for different network state transition speeds.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computer Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"Y7fcFBpwCAk6W_AH2WPY6JuiD1QRXjoJpjt6JGFY5w4","pdfSize":"9699361"}