{
  "id": "2412.05770",
  "title": "KITE-DDI: A Knowledge graph Integrated Transformer Model for accurately\n  predicting Drug-Drug Interaction Events from Drug SMILES and Biomedical\n  Knowledge Graph",
  "authors": "Azwad Tamir, Jiann-Shiun Yuan",
  "authorsParsed": [
    [
      "Tamir",
      "Azwad",
      ""
    ],
    [
      "Yuan",
      "Jiann-Shiun",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 8 Dec 2024 00:49:57 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733618997000,
  "abstract": "  It is a common practice in modern medicine to prescribe multiple medications\nsimultaneously to treat diseases. However, these medications could have adverse\nreactions between them, known as Drug-Drug Interactions (DDI), which have the\npotential to cause significant bodily injury and could even be fatal. Hence, it\nis essential to identify all the DDI events before prescribing multiple drugs\nto a patient. Most contemporary research for predicting DDI events relies on\neither information from Biomedical Knowledge graphs (KG) or drug SMILES, with\nvery few managing to merge data from both to make predictions. While others use\nheuristic algorithms to extract features from SMILES and KGs, which are then\nfed into a Deep Learning framework to generate output. In this study, we\npropose a KG-integrated Transformer architecture to generate an end-to-end\nfully automated Machine Learning pipeline for predicting DDI events with high\naccuracy. The algorithm takes full-scale molecular SMILES sequences of a pair\nof drugs and a biomedical KG as input and predicts the interaction between the\ntwo drugs with high precision. The results show superior performance in two\ndifferent benchmark datasets compared to existing state-of-the-art models\nespecially when the test and training sets contain distinct sets of drug\nmolecules. This demonstrates the strong generalization of the proposed model,\nindicating its potential for DDI event prediction for newly developed drugs.\nThe model does not depend on heuristic models for generating embeddings and has\na minimal number of hyperparameters, making it easy to use while demonstrating\noutstanding performance in low-data scenarios.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Quantitative Biology/Biomolecules"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "jh75qh9U8V9NDUrl2KQ2uJtYMibSSs91y1HlVthGO2Y",
  "pdfSize": "581382"
}