{"id":"2412.10907","title":"Energy-resolved pulse profile changes in V 0332+53: Indications of wings\n  in the cyclotron absorption line profile","authors":"Antonino D'A\\`i, Dimitrios K. Maniadakis, Carlo Ferrigno, Elena\n  Ambrosi, Ekaterina Sokolova-Lapa, Giancarlo Cusumano, Peter A. Becker,\n  Luciano Burderi, Melania Del Santo, Tiziana Di Salvo, Felix F\\\"urst, Rosario\n  Iaria, Peter Kretschmar, Valentina La Parola, Christian Malacaria, Ciro\n  Pinto, Fabio Pintore, A. Guillermo Rodriguez-Castillo","authorsParsed":[["D'Aì","Antonino",""],["Maniadakis","Dimitrios K.",""],["Ferrigno","Carlo",""],["Ambrosi","Elena",""],["Sokolova-Lapa","Ekaterina",""],["Cusumano","Giancarlo",""],["Becker","Peter A.",""],["Burderi","Luciano",""],["Del Santo","Melania",""],["Di Salvo","Tiziana",""],["Fürst","Felix",""],["Iaria","Rosario",""],["Kretschmar","Peter",""],["La Parola","Valentina",""],["Malacaria","Christian",""],["Pinto","Ciro",""],["Pintore","Fabio",""],["Rodriguez-Castillo","A. Guillermo",""]],"versions":[{"version":"v1","created":"Sat, 14 Dec 2024 17:32:33 GMT"},{"version":"v2","created":"Tue, 14 Jan 2025 17:25:12 GMT"}],"updateDate":"2025-02-26","timestamp":1734197553000,"abstract":"  We aim to investigate the energy-resolved pulse profile changes of the\naccreting X-ray pulsar V 0332+53, focusing in the cyclotron line energy range,\nusing the full set of available NuSTAR observations. We applied a tailored\npipeline to study the energy dependence of the pulse profiles and to build the\npulsed fraction spectra (PFS) for the different observations. We studied the\nprofile changes also using cross-correlation and lag spectra. We re-analysed\nthe energy spectra to search for links between the local features observed in\nthe PFS and spectral emission components associated with the shape of the\nfundamental cyclotron line. In the PFS data, with sufficiently high statistics,\nwe observe a consistent behaviour around the cyclotron line energy.\nSpecifically, two Gaussian-shaped features appear symmetrically on either side\nof the putative cyclotron line. These features exhibit minimal variation with\nsource luminosity, and their peak positions consistently remain on the left and\nright of the cyclotron line energy. Associated with the cyclotron line-forming\nregion, we interpret them as evidence for the resonant cyclotron absorption\nline wings, as predicted by theoretical models of how the cyclotron line\nprofile should appear along the observer's line of sight. A phase-resolved\nanalysis of the pulse in the energy bands surrounding these features enables us\nto determine both the spectral shape and the intensity of the photons\nresponsible for these peaks in the PFS. Assuming these features correspond to a\nspectral component, we used their shapes as priors for the corresponding\nemission components, finding a statistically satisfactory description of the\nspectra. To explain these results, we propose that our line of sight is close\nto the direction of the spin axis, while the magnetic axis is likely orthogonal\nto it.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"MfXM0_q3ha97K8ltGmqODKv4-fF8q8WxIt_fP3bLrVY","pdfSize":"7513380"}