{
  "id": "2412.04340",
  "title": "Disentangling the influence of excitation energy and compound nucleus\n  angular momentum on fission fragment angular momentum",
  "authors": "Simone Cannarozzo, Stephan Pomp, Andreas Solders, Ali Al-Adili, Zhihao\n  Gao, Mattias Lantz, Heikki Penttil\\\"a, Anu Kankainen, Iain Moore, Tommi\n  Eronen, Jouni Ruotsalainen, Zhuang Ge, Arthur Jaries, Maxime Mougeot, Andrea\n  Raggio, Ville Virtanen, Marek Stryjczyk",
  "authorsParsed": [
    [
      "Cannarozzo",
      "Simone",
      ""
    ],
    [
      "Pomp",
      "Stephan",
      ""
    ],
    [
      "Solders",
      "Andreas",
      ""
    ],
    [
      "Al-Adili",
      "Ali",
      ""
    ],
    [
      "Gao",
      "Zhihao",
      ""
    ],
    [
      "Lantz",
      "Mattias",
      ""
    ],
    [
      "Penttilä",
      "Heikki",
      ""
    ],
    [
      "Kankainen",
      "Anu",
      ""
    ],
    [
      "Moore",
      "Iain",
      ""
    ],
    [
      "Eronen",
      "Tommi",
      ""
    ],
    [
      "Ruotsalainen",
      "Jouni",
      ""
    ],
    [
      "Ge",
      "Zhuang",
      ""
    ],
    [
      "Jaries",
      "Arthur",
      ""
    ],
    [
      "Mougeot",
      "Maxime",
      ""
    ],
    [
      "Raggio",
      "Andrea",
      ""
    ],
    [
      "Virtanen",
      "Ville",
      ""
    ],
    [
      "Stryjczyk",
      "Marek",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 16:59:00 GMT"
    },
    {
      "version": "v2",
      "created": "Wed, 11 Dec 2024 09:20:35 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733417940000,
  "abstract": "  The origin of the large angular momenta observed for fission fragments is\nstill a question under discussion. To address this, we study isomeric yield\nratios (IYR), i.e. the relative population of two or more long-lived metastable\nstates with different spins, of fission products.\n  We report on IYR of 17 isotopes produced in the 28 MeV $\\alpha$-induced\nfission of $^{232}$Th at the IGISOL facility of the University of\nJyv\\\"askyl\\\"a. The fissioning nuclei in this reaction are $^{233,234,235}$U*.\nWe compare our data to IYR from thermal neutron-induced fission of $^{233}$U\nand $^{235}$U, and we observe statistically significant larger IYR in the\n$^{232}$Th($\\alpha$,f) reaction, where the average compound nucleus (CN) spin\nis 7.5 $\\hbar$, than in $^{233,235}$U(n$_{th}$,f), with average spins 2.5 and\n3.5 $\\hbar$, respectively.\n  To assess the influence of the excitation energy, we study literature data of\nIYR from photon-induced fission reactions, and find that the IYR are\nindependent of the CN excitation energy. We conclude that the different IYR\nmust be explained by the different CN spin alone. This implies that the FF\nangular momentum only partly comes from the fission process itself, and is in\naddition influenced by the angular momentum present in the CN.\n",
  "subjects": [
    "Physics/Nuclear Experiment",
    "Physics/Nuclear Theory"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "kM8DFUCesErfDFLGPNPmXQG3hfN3CfTczz-DX1FiPUk",
  "pdfSize": "1776669"
}