{
  "id": "2412.13737",
  "title": "On the Compression of Language Models for Code: An Empirical Study on\n  CodeBERT",
  "authors": "Giordano d'Aloisio, Luca Traini, Federica Sarro, Antinisca Di Marco",
  "authorsParsed": [
    [
      "d'Aloisio",
      "Giordano",
      ""
    ],
    [
      "Traini",
      "Luca",
      ""
    ],
    [
      "Sarro",
      "Federica",
      ""
    ],
    [
      "Di Marco",
      "Antinisca",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 11:14:30 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734520470000,
  "abstract": "  Language models have proven successful across a wide range of software\nengineering tasks, but their significant computational costs often hinder their\npractical adoption. To address this challenge, researchers have begun applying\nvarious compression strategies to improve the efficiency of language models for\ncode. These strategies aim to optimize inference latency and memory usage,\nthough often at the cost of reduced model effectiveness. However, there is\nstill a significant gap in understanding how these strategies influence the\nefficiency and effectiveness of language models for code. Here, we empirically\ninvestigate the impact of three well-known compression strategies -- knowledge\ndistillation, quantization, and pruning -- across three different classes of\nsoftware engineering tasks: vulnerability detection, code summarization, and\ncode search. Our findings reveal that the impact of these strategies varies\ngreatly depending on the task and the specific compression method employed.\nPractitioners and researchers can use these insights to make informed decisions\nwhen selecting the most appropriate compression strategy, balancing both\nefficiency and effectiveness based on their specific needs.\n",
  "subjects": [
    "Computer Science/Software Engineering",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Performance"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "IU9rPUl5sfw6oEb3AnWAal4HKF8TiQBNZkPT25KzyUI",
  "pdfSize": "3231388"
}