{"id":"2412.11750","title":"Common Ground, Diverse Roots: The Difficulty of Classifying Common\n  Examples in Spanish Varieties","authors":"Javier A. Lopetegui, Arij Riabi, Djam\\'e Seddah","authorsParsed":[["Lopetegui","Javier A.",""],["Riabi","Arij",""],["Seddah","Djamé",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 13:10:09 GMT"}],"updateDate":"2024-12-17","timestamp":1734354609000,"abstract":"  Variations in languages across geographic regions or cultures are crucial to\naddress to avoid biases in NLP systems designed for culturally sensitive tasks,\nsuch as hate speech detection or dialog with conversational agents. In\nlanguages such as Spanish, where varieties can significantly overlap, many\nexamples can be valid across them, which we refer to as common examples.\nIgnoring these examples may cause misclassifications, reducing model accuracy\nand fairness. Therefore, accounting for these common examples is essential to\nimprove the robustness and representativeness of NLP systems trained on such\ndata. In this work, we address this problem in the context of Spanish\nvarieties. We use training dynamics to automatically detect common examples or\nerrors in existing Spanish datasets. We demonstrate the efficacy of using\npredicted label confidence for our Datamaps\n\\cite{swayamdipta-etal-2020-dataset} implementation for the identification of\nhard-to-classify examples, especially common examples, enhancing model\nperformance in variety identification tasks. Additionally, we introduce a Cuban\nSpanish Variety Identification dataset with common examples annotations\ndeveloped to facilitate more accurate detection of Cuban and Caribbean Spanish\nvarieties. To our knowledge, this is the first dataset focused on identifying\nthe Cuban, or any other Caribbean, Spanish variety.\n","subjects":["Computer Science/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"bkQ-3WyhrObFV6J4oMxm5UfUJSSKvrNws90LT-GnbwU","pdfSize":"868876"}