{
  "id": "2412.10981",
  "title": "Hybrid Forecasting of Geopolitical Events",
  "authors": "Daniel M. Benjamin, Fred Morstatter, Ali E. Abbas, Andres Abeliuk,\n  Pavel Atanasov, Stephen Bennett, Andreas Beger, Saurabh Birari, David V.\n  Budescu, Michele Catasta, Emilio Ferrara, Lucas Haravitch, Mark Himmelstein,\n  KSM Tozammel Hossain, Yuzhong Huang, Woojeong Jin, Regina Joseph, Jure\n  Leskovec, Akira Matsui, Mehrnoosh Mirtaheri, Xiang Ren, Gleb Satyukov, Rajiv\n  Sethi, Amandeep Singh, Rok Sosic, Mark Steyvers, Pedro A Szekely, Michael D.\n  Ward, Aram Galstyan",
  "authorsParsed": [
    [
      "Benjamin",
      "Daniel M.",
      ""
    ],
    [
      "Morstatter",
      "Fred",
      ""
    ],
    [
      "Abbas",
      "Ali E.",
      ""
    ],
    [
      "Abeliuk",
      "Andres",
      ""
    ],
    [
      "Atanasov",
      "Pavel",
      ""
    ],
    [
      "Bennett",
      "Stephen",
      ""
    ],
    [
      "Beger",
      "Andreas",
      ""
    ],
    [
      "Birari",
      "Saurabh",
      ""
    ],
    [
      "Budescu",
      "David V.",
      ""
    ],
    [
      "Catasta",
      "Michele",
      ""
    ],
    [
      "Ferrara",
      "Emilio",
      ""
    ],
    [
      "Haravitch",
      "Lucas",
      ""
    ],
    [
      "Himmelstein",
      "Mark",
      ""
    ],
    [
      "Hossain",
      "KSM Tozammel",
      ""
    ],
    [
      "Huang",
      "Yuzhong",
      ""
    ],
    [
      "Jin",
      "Woojeong",
      ""
    ],
    [
      "Joseph",
      "Regina",
      ""
    ],
    [
      "Leskovec",
      "Jure",
      ""
    ],
    [
      "Matsui",
      "Akira",
      ""
    ],
    [
      "Mirtaheri",
      "Mehrnoosh",
      ""
    ],
    [
      "Ren",
      "Xiang",
      ""
    ],
    [
      "Satyukov",
      "Gleb",
      ""
    ],
    [
      "Sethi",
      "Rajiv",
      ""
    ],
    [
      "Singh",
      "Amandeep",
      ""
    ],
    [
      "Sosic",
      "Rok",
      ""
    ],
    [
      "Steyvers",
      "Mark",
      ""
    ],
    [
      "Szekely",
      "Pedro A",
      ""
    ],
    [
      "Ward",
      "Michael D.",
      ""
    ],
    [
      "Galstyan",
      "Aram",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 14 Dec 2024 22:09:45 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734214185000,
  "abstract": "  Sound decision-making relies on accurate prediction for tangible outcomes\nranging from military conflict to disease outbreaks. To improve crowdsourced\nforecasting accuracy, we developed SAGE, a hybrid forecasting system that\ncombines human and machine generated forecasts. The system provides a platform\nwhere users can interact with machine models and thus anchor their judgments on\nan objective benchmark. The system also aggregates human and machine forecasts\nweighting both for propinquity and based on assessed skill while adjusting for\noverconfidence. We present results from the Hybrid Forecasting Competition\n(HFC) - larger than comparable forecasting tournaments - including 1085 users\nforecasting 398 real-world forecasting problems over eight months. Our main\nresult is that the hybrid system generated more accurate forecasts compared to\na human-only baseline which had no machine generated predictions. We found that\nskilled forecasters who had access to machine-generated forecasts outperformed\nthose who only viewed historical data. We also demonstrated the inclusion of\nmachine-generated forecasts in our aggregation algorithms improved performance,\nboth in terms of accuracy and scalability. This suggests that hybrid\nforecasting systems, which potentially require fewer human resources, can be a\nviable approach for maintaining a competitive level of accuracy over a larger\nnumber of forecasting questions.\n",
  "subjects": [
    "Computer Science/Computers and Society",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Human-Computer Interaction",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "pvloTLOtJznzA96WHxCqATfJGgoxAys5zjlXUs0Vtfw",
  "pdfSize": "1182123"
}