{
  "id": "2412.11896",
  "title": "Classification of Spontaneous and Scripted Speech for Multilingual Audio",
  "authors": "Shahar Elisha, Andrew McDowell, Mariano Beguerisse-D\\'iaz, Emmanouil\n  Benetos",
  "authorsParsed": [
    [
      "Elisha",
      "Shahar",
      ""
    ],
    [
      "McDowell",
      "Andrew",
      ""
    ],
    [
      "Beguerisse-Díaz",
      "Mariano",
      ""
    ],
    [
      "Benetos",
      "Emmanouil",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 15:45:10 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734363910000,
  "abstract": "  Distinguishing scripted from spontaneous speech is an essential tool for\nbetter understanding how speech styles influence speech processing research. It\ncan also improve recommendation systems and discovery experiences for media\nusers through better segmentation of large recorded speech catalogues. This\npaper addresses the challenge of building a classifier that generalises well\nacross different formats and languages. We systematically evaluate models\nranging from traditional, handcrafted acoustic and prosodic features to\nadvanced audio transformers, utilising a large, multilingual proprietary\npodcast dataset for training and validation. We break down the performance of\neach model across 11 language groups to evaluate cross-lingual biases. Our\nexperimental analysis extends to publicly available datasets to assess the\nmodels' generalisability to non-podcast domains. Our results indicate that\ntransformer-based models consistently outperform traditional feature-based\ntechniques, achieving state-of-the-art performance in distinguishing between\nscripted and spontaneous speech across various languages.\n",
  "subjects": [
    "Computer Science/Computation and Language",
    "Computer Science/Sound",
    "Electrical Engineering and Systems Science/Audio and Speech Processing"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "rf0cPkBhA-wnpuS2HTMaVlgfpLkd8Mu1gO7YqgASmXI",
  "pdfSize": "552580"
}