{"id":"2412.11167","title":"Cultural Palette: Pluralising Culture Alignment via Multi-agent Palette","authors":"Jiahao Yuan, Zixiang Di, Shangzixin Zhao, Usman Naseem","authorsParsed":[["Yuan","Jiahao",""],["Di","Zixiang",""],["Zhao","Shangzixin",""],["Naseem","Usman",""]],"versions":[{"version":"v1","created":"Sun, 15 Dec 2024 12:30:52 GMT"},{"version":"v2","created":"Sun, 16 Feb 2025 12:21:29 GMT"}],"updateDate":"2025-02-18","timestamp":1734265852000,"abstract":"  Large language models (LLMs) face challenges in aligning with diverse\ncultural values despite their remarkable performance in generation, which stems\nfrom inherent monocultural biases and difficulties in capturing nuanced\ncultural semantics. Existing methods struggle to adapt to unkown culture after\nfine-tuning. Inspired by cultural geography across five continents, we propose\nCultural Palette, a multi-agent framework that redefines cultural alignment as\nan adaptive \"color-blending\" process for country-specific adaptation. Our\napproach harnesses cultural geography across five continents (Africa, America,\nAsia, Europe, Oceania) through three key steps: First, we synthesize the\nPentachromatic Cultural Palette Dataset using GPT-4o, refining\ncontinental-level dialogues with Hofstede cultural dimensions to establish\nfoundational cultural representations. Second, five continent-level alignment\nagents form specialized cultural communities that generate region-specific\ndraft responses. Third, a Meta Agent employs Cultural MoErges to dynamically\nblend these cultural \"colors\" through attention-gated parameter merging, akin\nto mixing pigments on a palette, resolving conflicts while preserving cultural\nnuances to produce the final culturally-aligned response. Extensive experiments\nacross various countries demonstrate that Cultural Palette surpasses existing\nbaselines in cultural alignment.\n","subjects":["Computer Science/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0gHs2UXNOVXP9eRDa0-jbJC_6Pkz9BvOHUQ7ziEEYq0","pdfSize":"3134427"}