{
  "id": "2412.00400",
  "title": "Imaging the Photochemistry of the Hydrogen-Bonded Heptazine-Water\n  Complex with Femtosecond Time-Resolved Spectroscopy: A Computational Study",
  "authors": "Sebastian V. Pios, Maxim F. Gelin, Wolfgang Domcke and Lipeng Chen",
  "authorsParsed": [
    [
      "Pios",
      "Sebastian V.",
      ""
    ],
    [
      "Gelin",
      "Maxim F.",
      ""
    ],
    [
      "Domcke",
      "Wolfgang",
      ""
    ],
    [
      "Chen",
      "Lipeng",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 30 Nov 2024 08:45:14 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1732956314000,
  "abstract": "  Graphitic carbon nitride ($g$-CN) has attracted vast interest as a promising\ninexpensive metal-free photocatalyst for water splitting with solar photons.\nThe heptazine (Hz) molecule is the building block of graphitic carbon nitride.\nThe photochemistry of the Hz molecule and derivatives thereof in protic\nenvironments has been the subject of several recent experimental and\ncomputational studies. In the present work, the hydrogen-bonded\nHz$\\cdots$H$_2$O complex was adopted as a model system for the exploration of\nphotoinduced electron and proton transfer processes in this complex with\nquasi-classical nonadiabatic trajectory simulations, using the $ab$ $initio$\nADC(2) electronic-structure method and a computationally efficient\nsurface-hopping algorithm. The population of the optically excited bright\n$^1\\pi\\pi^*$ state of the Hz chromophore relaxes through three $^1n\\pi^*$\nstates and a low-lying charge-transfer state, which drives proton transfer from\nH$_2$O to Hz, to the long-lived optically dark S$_1$($\\pi\\pi^*$) state of Hz.\nThe imaging of this ultrafast and complex dynamics with femtosecond\ntime-resolved transient absorption (TA) pump-probe (PP) spectroscopy and\ntwo-dimensional (2D) electronic spectroscopy (ES) was computationally explored\nin the framework of the quasi-classical doorway-window approximation. By\ncomparison of the spectra of the Hz$\\cdots$H$_2$O complex with those of the\nfree Hz molecule, the effects of the hydrogen bond on the ultrafast internal\nconversion dynamics can be identified in the spectroscopic signals. Albeit the\nTA PP and 2D ES spectroscopies are primarily sensitive to electronic\nexcited-state dynamics and less so to proton transfer dynamics, they\nnevertheless can provide mechanistic insights which can contribute to the\nacceleration of the optimization of photocatalysts for water splitting.\n",
  "subjects": [
    "Physics/Chemical Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "9jtJ-dcI6daev04qpiH2JDOKehxY7vX4dt6THTHIi7Y",
  "pdfSize": "2600054"
}