{
  "id": "2412.05668",
  "title": "Kinematic evidence of magnetospheric accretion for Herbig Ae stars with\n  JWST NIRSpec",
  "authors": "Ciar\\'an Rogers, Bernhard Brandl, Guido de Marchi",
  "authorsParsed": [
    [
      "Rogers",
      "Ciarán",
      ""
    ],
    [
      "Brandl",
      "Bernhard",
      ""
    ],
    [
      "de Marchi",
      "Guido",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 7 Dec 2024 14:33:03 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 10 Dec 2024 10:50:16 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733581983000,
  "abstract": "  Hydrogen emission lines are routinely used to estimate the mass accretion\nrate of pre-main-sequence stars. Despite the clear correlation between the\naccretion luminosity of a star and hydrogen line luminosities, the physical\norigin of these lines is still unclear, with magnetospheric accretion and\nmagneto-centrifugal winds as the two most often invoked mechanisms. Using a\ncombination of HST photometry and new JWST NIRSpec spectra, we have analysed\nthe SED and emission line spectra of five sources in order to determine their\nunderlying photospheric properties, and to attempt to reveal the physical\norigin of their hydrogen emission lines. These sources reside in NGC 3603, a\nGalactic massive star forming region. We have fitted the SED of the five\nsources employing a Markov Chain Monte Carlo exploration to estimate $T_{eff}$,\n$R_{*}$, $M_{*}$ and $A(V)$ for each source. We have performed a kinematic\nanalysis across three spectral series of hydrogen lines, Paschen, Brackett, and\nPfund, totalling $\\ge 15$ lines. The FWHM and optical depth of the spectrally\nresolved lines have been studied in order to constrain the emission origin. The\nfive sources all have SEDs consistent with young intermediate-mass stars. We\nhave classified three of these sources as Herbig Ae type stars based on their\neffective temperature. Their hydrogen lines show broad profiles with FWHMs $\\ge\n200$ km s$^{-1}$. Hydrogen lines with high upper energy levels $n_{up}$ tend to\nbe significantly broader than lines with lower $n_{up}$. The optical depth of\nthe emission lines is also highest for the high velocity component of each\nline, becoming optically thin in the low velocity component. This is consistent\nwith emission from a magnetospheric accretion flow, and cannot be explained as\noriginating in a magneto-centrifugal wind, or other line emission mechanisms\nthought to be present in protoplanetary disks.\n",
  "subjects": [
    "Astrophysics/Solar and Stellar Astrophysics",
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "c6fxeyLxzpu5gWwKx_qlV-JdTnNdkKB7_gckkGQ5rvk",
  "pdfSize": "7877922"
}