{"id":"2412.18731","title":"Position-aware Graph Transformer for Recommendation","authors":"Jiajia Chen and Jiancan Wu and Jiawei Chen and Chongming Gao and Yong\n  Li and Xiang Wang","authorsParsed":[["Chen","Jiajia",""],["Wu","Jiancan",""],["Chen","Jiawei",""],["Gao","Chongming",""],["Li","Yong",""],["Wang","Xiang",""]],"versions":[{"version":"v1","created":"Wed, 25 Dec 2024 01:22:35 GMT"}],"updateDate":"2024-12-30","timestamp":1735089755000,"abstract":"  Collaborative recommendation fundamentally involves learning high-quality\nuser and item representations from interaction data. Recently, graph\nconvolution networks (GCNs) have advanced the field by utilizing high-order\nconnectivity patterns in interaction graphs, as evidenced by state-of-the-art\nmethods like PinSage and LightGCN. However, one key limitation has not been\nwell addressed in existing solutions: capturing long-range collaborative\nfiltering signals, which are crucial for modeling user preference. In this\nwork, we propose a new graph transformer (GT) framework --\n\\textit{Position-aware Graph Transformer for Recommendation} (PGTR), which\ncombines the global modeling capability of Transformer blocks with the local\nneighborhood feature extraction of GCNs. The key insight is to explicitly\nincorporate node position and structure information from the user-item\ninteraction graph into GT architecture via several purpose-designed positional\nencodings. The long-range collaborative signals from the Transformer block are\nthen combined linearly with the local neighborhood features from the GCN\nbackbone to enhance node embeddings for final recommendations. Empirical\nstudies demonstrate the effectiveness of the proposed PGTR method when\nimplemented on various GCN-based backbones across four real-world datasets, and\nthe robustness against interaction sparsity as well as noise.\n","subjects":["Computer Science/Information Retrieval"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"s6zlybIBbiNKqocMhCoIwWua7foKh_3ikH9WQYlrbd8","pdfSize":"3444635"}