{"id":"2412.15571","title":"Continual Learning Using a Kernel-Based Method Over Foundation Models","authors":"Saleh Momeni, Sahisnu Mazumder, Bing Liu","authorsParsed":[["Momeni","Saleh",""],["Mazumder","Sahisnu",""],["Liu","Bing",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 05:09:18 GMT"}],"updateDate":"2024-12-23","timestamp":1734671358000,"abstract":"  Continual learning (CL) learns a sequence of tasks incrementally. This paper\nstudies the challenging CL setting of class-incremental learning (CIL). CIL has\ntwo key challenges: catastrophic forgetting (CF) and inter-task class\nseparation (ICS). Despite numerous proposed methods, these issues remain\npersistent obstacles. This paper proposes a novel CIL method, called Kernel\nLinear Discriminant Analysis (KLDA), that can effectively avoid CF and ICS\nproblems. It leverages only the powerful features learned in a foundation model\n(FM). However, directly using these features proves suboptimal. To address\nthis, KLDA incorporates the Radial Basis Function (RBF) kernel and its Random\nFourier Features (RFF) to enhance the feature representations from the FM,\nleading to improved performance. When a new task arrives, KLDA computes only\nthe mean for each class in the task and updates a shared covariance matrix for\nall learned classes based on the kernelized features. Classification is\nperformed using Linear Discriminant Analysis. Our empirical evaluation using\ntext and image classification datasets demonstrates that KLDA significantly\noutperforms baselines. Remarkably, without relying on replay data, KLDA\nachieves accuracy comparable to joint training of all classes, which is\nconsidered the upper bound for CIL performance. The KLDA code is available at\nhttps://github.com/salehmomeni/klda.\n","subjects":["Computer Science/Machine Learning","Computer Science/Artificial Intelligence","Computer Science/Computation and Language","Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"H61HEObH9F6Ake8uNWs8bqJWA1ZRfePeH0r6mYbAkxE","pdfSize":"399991"}