{
  "id": "2412.02166",
  "title": "Analyzing the Impact of AI Tools on Student Study Habits and Academic\n  Performance",
  "authors": "Ben Ward, Deepshikha Bhati, Fnu Neha, Angela Guercio",
  "authorsParsed": [
    [
      "Ward",
      "Ben",
      ""
    ],
    [
      "Bhati",
      "Deepshikha",
      ""
    ],
    [
      "Neha",
      "Fnu",
      ""
    ],
    [
      "Guercio",
      "Angela",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 04:51:57 GMT"
    }
  ],
  "updateDate": "2024-12-04",
  "timestamp": 1733201517000,
  "abstract": "  This study explores the effectiveness of AI tools in enhancing student\nlearning, specifically in improving study habits, time management, and feedback\nmechanisms. The research focuses on how AI tools can support personalized\nlearning, adaptive test adjustments, and provide real-time classroom analysis.\nStudent feedback revealed strong support for these features, and the study\nfound a significant reduction in study hours alongside an increase in GPA,\nsuggesting positive academic outcomes. Despite these benefits, challenges such\nas over-reliance on AI and difficulties in integrating AI with traditional\nteaching methods were also identified, emphasizing the need for AI tools to\ncomplement conventional educational strategies rather than replace them. Data\nwere collected through a survey with a Likert scale and follow-up interviews,\nproviding both quantitative and qualitative insights. The analysis involved\ndescriptive statistics to summarize demographic data, AI usage patterns, and\nperceived effectiveness, as well as inferential statistics (T-tests, ANOVA) to\nexamine the impact of demographic factors on AI adoption. Regression analysis\nidentified predictors of AI adoption, and qualitative responses were\nthematically analyzed to understand students' perspectives on the future of AI\nin education. This mixed-methods approach provided a comprehensive view of AI's\nrole in education and highlighted the importance of privacy, transparency, and\ncontinuous refinement of AI features to maximize their educational benefits.\n",
  "subjects": [
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "UlLaS69CvBo0KicHrBZA_zACY2FXCms26fdAfYp2xRY",
  "pdfSize": "377338"
}