{
  "id": "2412.00378",
  "title": "Bi-Band ECoGNet for ECoG Decoding on Classification Task",
  "authors": "Changqing Ji",
  "authorsParsed": [
    [
      "Ji",
      "Changqing",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 30 Nov 2024 06:54:38 GMT"
    },
    {
      "version": "v2",
      "created": "Mon, 23 Dec 2024 02:11:58 GMT"
    },
    {
      "version": "v3",
      "created": "Mon, 6 Jan 2025 05:32:03 GMT"
    }
  ],
  "updateDate": "2025-01-07",
  "timestamp": 1732949678000,
  "abstract": "  In the application of brain-computer interface (BCI), being able to\naccurately decode brain signals is a critical task. For the multi-class\nclassification task of brain signal ECoG, how to improve the classification\naccuracy is one of the current research hotspots. ECoG acquisition uses a\nhigh-density electrode array and a high sampling frequency, which makes ECoG\ndata have a certain high similarity and data redundancy in the temporal domain,\nand also unique spatial pattern in spatial domain. How to effectively extract\nfeatures is both exciting and challenging. Previous work found that\nvisual-related ECoG can carry visual information via frequency and spatial\ndomain. Based on this finding, we focused on using deep learning to design\nfrequency and spatial feature extraction modules, and proposed a Bi-Band\nECoGNet model based on deep learning. The main contributions of this paper are:\n1) The Bi-BCWT (Bi-Band Channel-Wise Transform) neural network module is\ndesigned to replace the time-consume method MST, this module greatly improves\nthe model calculation and data storage efficiency, and effectively increases\nthe training speed; 2) The Bi-BCWT module can effectively take into account the\ninformation both in low-frequency and high-frequency domain, which is more\nconducive to ECoG multi-classification tasks; 3) ECoG is acquired using 2D\nelectrode array, the newly designed 2D Spatial-Temporal feature encoder can\nextract the 2D spatial feature better. Experiments have shown that the unique\n2D spatial data structure can effectively improve classification accuracy; 3)\nCompared with previous work, the Bi-Band ECoGNet model is smaller and has\nhigher performance, with an accuracy increase of 1.24%, and the model training\nspeed is increased by 6 times, which is more suitable for BCI applications.\n",
  "subjects": [
    "Mathematics/Numerical Analysis",
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Numerical Analysis"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "vHj32RkvWLic3riWA_Vb9TiqSWFRTdp0UAkCeqR8Wv4",
  "pdfSize": "2144230"
}