{"id":"2412.07897","title":"Constraining solar wind transport model parameters using Bayesian\n  analysis","authors":"Mark Bishop, Sean Ougthon, Tulasi Parashar, Yvette Perrott","authorsParsed":[["Bishop","Mark",""],["Ougthon","Sean",""],["Parashar","Tulasi",""],["Perrott","Yvette",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 20:10:12 GMT"}],"updateDate":"2024-12-12","timestamp":1733861412000,"abstract":"  We apply nested-sampling (NS) Bayesian analysis [AshtonEA22] to a model for\nthe transport of MHD-scale solar wind fluctuations. The dual objectives are to\nobtain improved constraints on parameters present in the turbulence transport\nmodel (TTM) and to support comparisons of distinct versions of the TTM. The\nTTMs analysed are essentially 1D steady-state presented in [BreechEA08] that\ndescribe the radial evolution of the energy, correlation length, and normalized\ncross helicity of the fluctuations, together with the proton temperature, in\nprescribed background solar wind fields. Modelled effects present in the TTM\ninclude nonlinear turbulence interactions, shear driving, and energy injection\nassociated with pickup-ions. These effects involve adjustable parameters that\nwe seek to constrain. Bayesian analysis supports the efficient searching of a\nparameter space for the 'best' set of TTM parameter values. More advanced use\nprovides the parameter's posterior distribution: its probability given the\ndata, and the model. This can be used to understand the uncertainty in the\nprovided 'best' values for the parameters and therefore the uncertainty in the\nsuggested TTM solutions/predictions. By using NS, we can calculate the Bayesian\nevidence for each TTM and objectively determine which best fits the given\nobservational data. Based on the analysis of the datasets and TTM employed, we\nrecommend use of the 2D TTM with von Karman-Howarth parameters ${\\alpha}\\approx\n0.16$ and $\\beta \\approx 0.10$ and parameter assumptions from existing\nliterature. It is important to include the pickup ion effects in the\nlengthscale evolution equation by assuming $Z^{2\\beta/\\alpha}\\lambda = const$\nis locally conserved. This work is readily extended to more sophisticated solar\nwind models. Although more work is required to generate datasets with\nassociated errors, which is necessary for accurate Bayesian modelling.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Physics/Plasma Physics","Physics/Space Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"vmUYcRRL94uNNYEXF9JNsLqOcEJubf2Le5k0m_5c5Xg","pdfSize":"1569519"}