{
  "id": "2412.11373",
  "title": "Codenames as a Benchmark for Large Language Models",
  "authors": "Matthew Stephenson, Matthew Sidji, Beno\\^it Ronval",
  "authorsParsed": [
    [
      "Stephenson",
      "Matthew",
      ""
    ],
    [
      "Sidji",
      "Matthew",
      ""
    ],
    [
      "Ronval",
      "Benoît",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 01:59:03 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734314343000,
  "abstract": "  In this paper, we propose the use of the popular word-based board game\nCodenames as a suitable benchmark for evaluating the reasoning capabilities of\nLarge Language Models (LLMs). Codenames presents a highly interesting challenge\nfor achieving successful AI performance, requiring both a sophisticated\nunderstanding of language, theory of mind, and epistemic reasoning\ncapabilities. Prior attempts to develop agents for Codenames have largely\nrelied on word embedding techniques, which have a limited vocabulary range and\nperform poorly when paired with differing approaches. LLMs have demonstrated\nenhanced reasoning and comprehension capabilities for language-based tasks, but\ncan still suffer in lateral thinking challenges. We evaluate the capabilities\nof several state-of-the-art LLMs, including GPT-4o, Gemini 1.5, Claude 3.5\nSonnet, and Llama 3.1, across a variety of board setups. Our results indicate\nthat while certain LLMs perform better than others overall, different models\nexhibit varying emergent behaviours during gameplay and excel at specific\nroles. We also evaluate the performance of different combinations of LLMs when\nplaying cooperatively together, demonstrating that LLM agents are more\ngeneralisable to a wider range of teammates than prior techniques.\n",
  "subjects": [
    "Computer Science/Artificial Intelligence",
    "Computer Science/Computation and Language"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "_t1OTLWuCCFh62AzpAiWgLmsZaFxiJwi2I8HcoXaofw",
  "pdfSize": "298847"
}