{
  "id": "2412.08606",
  "title": "Enhancing the use of family planning service statistics using a Bayesian\n  modelling approach to inform estimates of modern contraceptive use in low-\n  and middle-income countries",
  "authors": "Shauna Mooney, Leontine Alkema, Emily Sonneveldt, Kristin Bietsch,\n  Jessica Williamson, Niamh Cahill",
  "authorsParsed": [
    [
      "Mooney",
      "Shauna",
      ""
    ],
    [
      "Alkema",
      "Leontine",
      ""
    ],
    [
      "Sonneveldt",
      "Emily",
      ""
    ],
    [
      "Bietsch",
      "Kristin",
      ""
    ],
    [
      "Williamson",
      "Jessica",
      ""
    ],
    [
      "Cahill",
      "Niamh",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 18:27:50 GMT"
    },
    {
      "version": "v2",
      "created": "Thu, 6 Feb 2025 16:22:38 GMT"
    }
  ],
  "updateDate": "2025-02-07",
  "timestamp": 1733941670000,
  "abstract": "  Monitoring family planning indicators, such as modern contraceptive\nprevalence rate (mCPR), is essential for family planning programming. The\nFamily Planning Estimation Tool (FPET) uses survey data to estimate and\nforecast family planning indicators, including mCPR, over time. However, sole\nreliance on large-scale surveys, carried out on average every 3-5 years, can\nlead to data gaps. Service statistics are a readily available data source,\nroutinely collected in conjunction with service delivery. Various service\nstatistics data types can be used to derive a family planning indicator called\nEstimated Modern Use (EMU). In a number of countries, annual rates of change in\nEMU have been found to be predictive of true rates of change in mCPR. However,\nit has been challenging to capture the varying levels of uncertainty associated\nwith the EMU indicator across different countries and service statistics data\ntypes and to subsequently quantify this uncertainty when using EMU in FPET. We\npresent a new approach to using EMUs in FPET to inform mCPR estimates, using\nannual EMU rates of change as input, and accounting for uncertainty associated\nwith the EMU derivation process. The approach also considers additional\ncountry-type-specific uncertainty. We assess the EMU type-specific uncertainty\nat the country level, via a Bayesian hierarchical modelling approach.\nValidation results and anonymised country-level case studies highlight improved\npredictive performance and provide insights into the impact of including EMU\ndata on mCPR estimates compared to using survey data alone. Together, they\ndemonstrate that EMUs can help countries monitor progress toward their family\nplanning goals more effectively.\n",
  "subjects": [
    "Statistics/Applications"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "wzjV1eKK737A1pa5thklxfSckbU4PwwFs3TkMD-zfR4",
  "pdfSize": "701531"
}