{"id":"2412.10829","title":"Interference in Fuzzy Dark Matter Filaments: Idealised Models and\n  Statistics","authors":"Tim Zimmermann, David J.E. Marsh, Keir K. Rogers, Hans A. Winther,\n  Sijing Shen","authorsParsed":[["Zimmermann","Tim",""],["Marsh","David J. E.",""],["Rogers","Keir K.",""],["Winther","Hans A.",""],["Shen","Sijing",""]],"versions":[{"version":"v1","created":"Sat, 14 Dec 2024 13:22:53 GMT"},{"version":"v2","created":"Mon, 17 Feb 2025 14:38:40 GMT"},{"version":"v3","created":"Sun, 23 Feb 2025 01:01:39 GMT"}],"updateDate":"2025-02-25","timestamp":1734182573000,"abstract":"  Fuzzy (wave) dark matter (FDM), the dynamical model underlying an ultralight\nbosonic dark matter species, produces a rich set of non-gravitational\nsignatures that distinguishes it markedly from the phenomenologically related\nwarm (particle) dark matter (WDM) scenario. The emergence of extended\ninterference fringes hosted by cosmic filaments is one such phenomenon reported\nby cosmological simulations, and a detailed understanding of such may\nstrengthen existing limits on the boson mass but also break the degeneracy with\nWDM, and provide a unique fingerprint of interference in cosmology. In this\npaper, we provide initial steps towards this goal. In particular, we show in a\nbottom-up approach, how the presence of interference in an idealised filament\npopulation can lead to a non-suppressive feature in the matter power spectrum\n-- an observation supported by fully-cosmological FDM simulations. To this end,\nwe build on a theoretically motivated and numerically observed steady-state\napproximation for filaments and express the equilibrium dynamics of such in an\nexpansion of FDM eigenstates. We optimise the size of the expansion by\nincorporating classical phase-space information. Ellipsoidal collapse\nconsiderations are used to construct a fuzzy filament mass function which,\ntogether with the reconstructed FDM wave function, allow us to efficiently\ncompute the one-filament power spectrum. We showcase our non-perturbative\ninterference model for a selection of boson masses and confirm our approach is\nable to produce the matter power boost observed in fully-cosmological FDM\nsimulations. More precisely, we find an excess in correlation between the\nspatial scale associated with the FDM ground state and the quantum pressure\nscale. We speculate about applications of this effect in data analysis.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Lk9DQHgw-PrrPt_AiNUapncXgMnB_r0fHz5Jbhyz1ck","pdfSize":"7335861"}