{
  "id": "2412.05626",
  "title": "Sensor Selection and Distributed Quantization for Energy Efficiency in\n  Massive MTC",
  "authors": "Sergi Liesegang, Olga Mu\\~noz, Antonio Pascual-Iserte",
  "authorsParsed": [
    [
      "Liesegang",
      "Sergi",
      ""
    ],
    [
      "Muñoz",
      "Olga",
      ""
    ],
    [
      "Pascual-Iserte",
      "Antonio",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 7 Dec 2024 11:45:15 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733571915000,
  "abstract": "  This paper presents an estimation approach within the framework of uplink\nmassive machine-type communications (mMTC) that considers the energy\nlimitations of the devices. We focus on a scenario where a group of sensors\nobserve a set of parameters and send the measured information to a collector\nnode (CN). The CN is responsible for estimating the original observations,\nwhich are spatially correlated and corrupted by measurement and quantization\nnoise. Given the use of Gaussian sources, the minimum mean squared error (MSE)\nestimation is employed and, when considering temporal evolution, the use of\nKalman filters is studied. Based on that, we propose a device selection\nstrategy to reduce the number of active sensors and a quantization scheme with\nadjustable number of bits to minimize the overall payload. The set of selected\nsensors and quantization levels are, thus, designed to minimize the MSE. For a\nmore realistic analysis, communication errors are also included by averaging\nthe MSE over the error decoding probabilities. We evaluate the performance of\nour strategy in a practical mMTC system with synthetic and real databases.\nSimulation results show that the optimization of the payload and the set of\nactive devices can reduce the power consumption without compromising the\nestimation accuracy.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Signal Processing"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "KW0CKogfzJlzmIEaIJIJMaarDsbPfs1jtrTMnXwc_H0",
  "pdfSize": "688879"
}