{"id":"2412.18409","title":"Re-assessing ImageNet: How aligned is its single-label assumption with\n  its multi-label nature?","authors":"Esla Timothy Anzaku, Seyed Amir Mousavi, Arnout Van Messem, Wesley De\n  Neve","authorsParsed":[["Anzaku","Esla Timothy",""],["Mousavi","Seyed Amir",""],["Van Messem","Arnout",""],["De Neve","Wesley",""]],"versions":[{"version":"v1","created":"Tue, 24 Dec 2024 12:55:31 GMT"}],"updateDate":"2024-12-25","timestamp":1735044931000,"abstract":"  ImageNet, an influential dataset in computer vision, is traditionally\nevaluated using single-label classification, which assumes that an image can be\nadequately described by a single concept or label. However, this approach may\nnot fully capture the complex semantics within the images available in\nImageNet, potentially hindering the development of models that effectively\nlearn these intricacies. This study critically examines the prevalent\nsingle-label benchmarking approach and advocates for a shift to multi-label\nbenchmarking for ImageNet. This shift would enable a more comprehensive\nassessment of the capabilities of deep neural network (DNN) models. We analyze\nthe effectiveness of pre-trained state-of-the-art DNNs on ImageNet and one of\nits variants, ImageNetV2. Studies in the literature have reported unexpected\naccuracy drops of 11% to 14% on ImageNetV2. Our findings show that these\nreported declines are largely attributable to a characteristic of the dataset\nthat has not received sufficient attention -- the proportion of images with\nmultiple labels. Taking this characteristic into account, the results of our\nexperiments provide evidence that there is no substantial degradation in\neffectiveness on ImageNetV2. Furthermore, we acknowledge that ImageNet\npre-trained models exhibit some capability at capturing the multi-label nature\nof the dataset even though they were trained under the single-label assumption.\nConsequently, we propose a new evaluation approach to augment existing\napproaches that assess this capability. Our findings highlight the importance\nof considering the multi-label nature of the ImageNet dataset during\nbenchmarking. Failing to do so could lead to incorrect conclusions regarding\nthe effectiveness of DNNs and divert research efforts from addressing other\nsubstantial challenges related to the reliability and robustness of these\nmodels.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"jSrG7ug8RwFe7dTS_CYC3_R21xULNrT8gtc0QFKv2ug","pdfSize":"5859830"}