{"id":"2412.09783","title":"oMEGACat V: Helium Enrichment in $\\omega$ Centauri as a Function of\n  Metallicity","authors":"C. Clontz, A. C. Seth, Z. Wang, S. O. Souza, M. H\\\"aberle, M. S.\n  Nitschai, N. Neumayer, M. Latour, A. P. Milone, A. Feldmeier-Krause, N.\n  Kacharov, M. Libralato, A. Bellini, G. van de Ven, and M. Alfaro-Cuello","authorsParsed":[["Clontz","C.",""],["Seth","A. C.",""],["Wang","Z.",""],["Souza","S. O.",""],["Häberle","M.",""],["Nitschai","M. S.",""],["Neumayer","N.",""],["Latour","M.",""],["Milone","A. P.",""],["Feldmeier-Krause","A.",""],["Kacharov","N.",""],["Libralato","M.",""],["Bellini","A.",""],["van de Ven","G.",""],["Alfaro-Cuello","M.",""]],"versions":[{"version":"v1","created":"Fri, 13 Dec 2024 01:46:55 GMT"}],"updateDate":"2024-12-16","timestamp":1734054415000,"abstract":"  Constraining the helium enhancement in stars is critical for understanding\nthe formation mechanisms of multiple populations in star clusters. However,\nmeasuring helium variations for many stars within a cluster remains\nobservationally challenging. We use Hubble Space Telescope photometry combined\nwith MUSE spectroscopic data for over 7,200 red-giant branch stars in \\omc\\ to\nmeasure helium differences between distinct groups of stars as a function of\nmetallicity separating the impact of helium enhancements from other abundance\nvariations on the pseudo-color (chromosome) diagrams. Our results show that\nstars at all metallicities have subpopulations with significant helium\nenhancement ($\\Delta Y_{min} \\gtrsim$ 0.11). We find a rapid increase in helium\nenhancement from low metallicities ($\\rm{[Fe/H] \\simeq -2.05}$ to $\\rm{[Fe/H]\n\\simeq -1.92})$, with this enhancement leveling out at \\deltay\\ $= 0.154$ at\nhigher metallicities. The fraction of helium-enhanced stars steadily increases\nwith metallicity ranging from 10\\% at $\\rm{[Fe/H] \\simeq -2.04}$ to over $90\\%$\nat $\\rm{[Fe/H] \\simeq -1.04}$. This study is the first to examine helium\nenhancement across the full range of metallicities in \\omc{}, providing new\ninsight into its formation history and additional constraints on enrichment\nmechanisms.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"9kEGbBTNdsXiCInlZmKUmJXmBgV38pmwj-3RLkuEeZc","pdfSize":"2221411"}