{"id":"2412.15874","title":"Controlled polymorphic competition -- a path to tough and hard ceramics","authors":"D.G. Sangiovanni, A. Kjell\\'en, F. Trybel, L.J.S. Johnson, M. Od\\'en,\n  F. Tasn\\'adi, I.A. Abrikosov","authorsParsed":[["Sangiovanni","D. G.",""],["Kjellén","A.",""],["Trybel","F.",""],["Johnson","L. J. S.",""],["Odén","M.",""],["Tasnádi","F.",""],["Abrikosov","I. A.",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 13:23:54 GMT"}],"updateDate":"2024-12-23","timestamp":1734701034000,"abstract":"  From nanoscale devices including sensors, electronics, or biocompatible\ncoatings to macroscale structural, automotive or aerospace components,\nfundamental understanding of plasticity and fracture can guide the realization\nof materials that ensure safe and durable performance. Identifying the role of\natomic-scale plasticity is crucial, especially for applications relying on\nbrittle ceramics. Here, stress-intensity-controlled atomistic simulations of\nfracture in cubic Ti$_{1-x}$Al$_{x}$N model systems demonstrate how\n$\\overset{\\lower.5em\\circ}{\\mathrm{A}}$-scale plasticity - manifested as\nlattice distortions, phase transformation, nucleation and emission of\ndislocations - substantially affects the macroscale fracture toughness\n(K$_{Ic}$) and fracture strength (${\\sigma}$$_{f}$) of brittle ceramics. The\nextent of plastic deformation in Ti$_{1-x}$Al$_{x}$N increases monotonically\nwith the Al content (x), due to a corresponding decrease in cubic $\\rightarrow$\nhexagonal polymorph transition energy. Overall, plasticity positively affects\nthe mechanical properties, resulting in optimal combinations of strength and\ntoughness for x~0.6. However, for x exceeding ~0.7, the benefits of plasticity\ndiminish. The initial rise followed by a decline in K$_{Ic}$(x) and\n${\\sigma}$$_{f}$(x) is explained based on the interplay between phase\ntransformation and tensile cleavage on the easiest fracture plane. The results\nhighlight the impact of atomic-scale plasticity on observable properties and\npoint to strategies for toughening ceramics through control of polymorph\ncompetition.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"cP54SJxMkHS0Erzwv19dSmJoooRr5UVyycfSLLqUdXE","pdfSize":"2138001"}