{"id":"2412.08418","title":"Apollon Real-Time Adaptive Optics (ARTAO) -- Astronomy-Inspired\n  Wavefront Stabilization in Ultraintense Lasers","authors":"Jonas Benjamin Ohland and Nathalie Lebas and Vincent Deo and Olivier\n  Guyon and Fran\\c{c}ois Mathieu and Patrick Audebert and Dimitrios\n  Papadopoulos","authorsParsed":[["Ohland","Jonas Benjamin",""],["Lebas","Nathalie",""],["Deo","Vincent",""],["Guyon","Olivier",""],["Mathieu","François",""],["Audebert","Patrick",""],["Papadopoulos","Dimitrios",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 14:35:17 GMT"},{"version":"v2","created":"Tue, 21 Jan 2025 14:16:24 GMT"}],"updateDate":"2025-02-20","timestamp":1733927717000,"abstract":"  Traditional wavefront control in high-energy, high-intensity laser systems\nusually lacks real-time capability, failing to address dynamic aberrations.\nThis limits experimental accuracy due to shot-to-shot fluctuations and\nnecessitates long cool-down phases to mitigate thermal effects, particularly as\nhigher repetition rates become essential, e.g. in Inertial Fusion research.\nThis paper details the development and implementation of a real-time capable\nadaptive optics system at the Apollon laser facility. Inspired by astronomical\nadaptive optics, the system uses a fiber-coupled 905 nm laser diode as a pilot\nbeam that allows for spectral separation, bypassing the constraints of pulsed\nlasers. A GPU-based controller, built on the open-source CACAO framework,\nmanages a loop comprising a bimorph deformable mirror and high-speed\nShack-Hartmann sensor. Initial tests showed excellent stability and effective\naberration correction. However, integration into the Apollon laser revealed\ncritical challenges unique to the laser environment that must be resolved to\nensure safe operation with amplified shots.\n","subjects":["Physics/Optics","Physics/High Energy Physics - Experiment"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"fYuewWEq85No_PMMWK1VzD-daRdukM-BxPk7eGR1zKk","pdfSize":"4938544"}