{"id":"2412.17018","title":"GAS: Generative Auto-bidding with Post-training Search","authors":"Yewen Li, Shuai Mao, Jingtong Gao, Nan Jiang, Yunjian Xu, Qingpeng\n  Cai, Fei Pan, Peng Jiang, Bo An","authorsParsed":[["Li","Yewen",""],["Mao","Shuai",""],["Gao","Jingtong",""],["Jiang","Nan",""],["Xu","Yunjian",""],["Cai","Qingpeng",""],["Pan","Fei",""],["Jiang","Peng",""],["An","Bo",""]],"versions":[{"version":"v1","created":"Sun, 22 Dec 2024 13:47:46 GMT"}],"updateDate":"2024-12-24","timestamp":1734875266000,"abstract":"  Auto-bidding is essential in facilitating online advertising by automatically\nplacing bids on behalf of advertisers. Generative auto-bidding, which generates\nbids based on an adjustable condition using models like transformers and\ndiffusers, has recently emerged as a new trend due to its potential to learn\noptimal strategies directly from data and adjust flexibly to preferences.\nHowever, generative models suffer from low-quality data leading to a mismatch\nbetween condition, return to go, and true action value, especially in long\nsequential decision-making. Besides, the majority preference in the dataset may\nhinder models' generalization ability on minority advertisers' preferences.\nWhile it is possible to collect high-quality data and retrain multiple models\nfor different preferences, the high cost makes it unaffordable, hindering the\nadvancement of auto-bidding into the era of large foundation models. To address\nthis, we propose a flexible and practical Generative Auto-bidding scheme using\npost-training Search, termed GAS, to refine a base policy model's output and\nadapt to various preferences. We use weak-to-strong search alignment by\ntraining small critics for different preferences and an MCTS-inspired search to\nrefine the model's output. Specifically, a novel voting mechanism with\ntransformer-based critics trained with policy indications could enhance search\nalignment performance. Additionally, utilizing the search, we provide a\nfine-tuning method for high-frequency preference scenarios considering\ncomputational efficiency. Extensive experiments conducted on the real-world\ndataset and online A/B test on the Kuaishou advertising platform demonstrate\nthe effectiveness of GAS, achieving significant improvements, e.g., 1.554%\nincrement of target cost.\n","subjects":["Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Q7f2OJc5hcppQ1ONqAWy9YtTgm8dLtbM_vVtTxrBtck","pdfSize":"940703"}