{
  "id": "2412.13558",
  "title": "Read Like a Radiologist: Efficient Vision-Language Model for 3D Medical\n  Imaging Interpretation",
  "authors": "Changsun Lee, Sangjoon Park, Cheong-Il Shin, Woo Hee Choi, Hyun Jeong\n  Park, Jeong Eun Lee, Jong Chul Ye",
  "authorsParsed": [
    [
      "Lee",
      "Changsun",
      ""
    ],
    [
      "Park",
      "Sangjoon",
      ""
    ],
    [
      "Shin",
      "Cheong-Il",
      ""
    ],
    [
      "Choi",
      "Woo Hee",
      ""
    ],
    [
      "Park",
      "Hyun Jeong",
      ""
    ],
    [
      "Lee",
      "Jeong Eun",
      ""
    ],
    [
      "Ye",
      "Jong Chul",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 07:19:48 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734506388000,
  "abstract": "  Recent medical vision-language models (VLMs) have shown promise in 2D medical\nimage interpretation. However extending them to 3D medical imaging has been\nchallenging due to computational complexities and data scarcity. Although a few\nrecent VLMs specified for 3D medical imaging have emerged, all are limited to\nlearning volumetric representation of a 3D medical image as a set of\nsub-volumetric features. Such process introduces overly correlated\nrepresentations along the z-axis that neglect slice-specific clinical details,\nparticularly for 3D medical images where adjacent slices have low redundancy.\nTo address this limitation, we introduce MS-VLM that mimic radiologists'\nworkflow in 3D medical image interpretation. Specifically, radiologists analyze\n3D medical images by examining individual slices sequentially and synthesizing\ninformation across slices and views. Likewise, MS-VLM leverages self-supervised\n2D transformer encoders to learn a volumetric representation that capture\ninter-slice dependencies from a sequence of slice-specific features. Unbound by\nsub-volumetric patchification, MS-VLM is capable of obtaining useful volumetric\nrepresentations from 3D medical images with any slice length and from multiple\nimages acquired from different planes and phases. We evaluate MS-VLM on\npublicly available chest CT dataset CT-RATE and in-house rectal MRI dataset. In\nboth scenarios, MS-VLM surpasses existing methods in radiology report\ngeneration, producing more coherent and clinically relevant reports. These\nfindings highlight the potential of MS-VLM to advance 3D medical image\ninterpretation and improve the robustness of medical VLMs.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Image and Video Processing",
    "Computer Science/Computation and Language",
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "4b_XDdkalo4CfoDBlTteVh4A2JRrrBhPuwOeN0fMixE",
  "pdfSize": "26821852"
}