{
  "id": "2412.15393",
  "title": "A Decision Transformer Approach to Grain Boundary Network Optimization",
  "authors": "Christopher W. Adair, Oliver K. Johnson",
  "authorsParsed": [
    [
      "Adair",
      "Christopher W.",
      ""
    ],
    [
      "Johnson",
      "Oliver K.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 20:51:54 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734641514000,
  "abstract": "  As microstructure property models improve, additional information from\ncrystallographic degrees of freedom and grain boundary networks (GBNs) can be\nincluded in microstructure design problems. However, the high dimensional\nnature of including this information precludes the use of many common\noptimization approaches and requires less efficient methods to generate quality\ndesigns. Previous work demonstrated that human-in-the-loop optimization,\ninstantiated as a video game, achieved high-quality, efficient solutions to\nthese design problems. However, such data is expensive to obtain. In the\npresent work, we show how a Decision Transformer machine learning (ML) model\ncan be used to learn from the optimization trajectories generated by human\nplayers, and subsequently solve materials design problems. We compare the ML\noptimization trajectories against players and a common global optimization\nalgorithm: simulated annealing (SA). We find that the ML model exhibits a\nvalidation accuracy of 84% against player decisions, and achieves solutions of\ncomparable quality to SA (92%), but does so using three orders of magnitude\nfewer iterations. We find that the ML model generalizes in important and\nsurprising ways, including the ability to train using a simple constitutive\nstructure-property model and then solve microstructure design problems for a\ndifferent, higher-fidelity, constitutive structure-property model without any\nretraining. These results demonstrate the potential of Decision Transformer\nmodels for the solution of materials design problems.\n",
  "subjects": [
    "Condensed Matter/Materials Science",
    "Physics/Computational Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "FNDMHVLPaoxuD9r9J4IEoL4G8IZE6iHl9hI5ed4Zp4Q",
  "pdfSize": "2305552"
}