{"id":"2412.12926","title":"Prediction-Based Control Barrier Functions for Input-Constrained Safety\n  Critical Systems","authors":"Ali Mesbah, Seid H. Pourtakdoust, Alireza Sharifi, Afshin Banazadeh","authorsParsed":[["Mesbah","Ali",""],["Pourtakdoust","Seid H.",""],["Sharifi","Alireza",""],["Banazadeh","Afshin",""]],"versions":[{"version":"v1","created":"Tue, 17 Dec 2024 13:59:35 GMT"}],"updateDate":"2024-12-18","timestamp":1734443975000,"abstract":"  Control barrier functions (CBFs) have emerged as a popular topic in safety\ncritical control due to their ability to provide formal safety guarantees for\ndynamical systems. Despite their powerful capabilities, the determination of\nfeasible CBFs for input-constrained systems is still a formidable task and a\nchallenging research issue. The present work aims to tackle this problem by\nfocusing on an alternative approach towards a generalization of some ideas\nintroduced in the existing CBF literature. The approach provides a rigorous yet\nstraightforward method to define and implement prediction-based control barrier\nfunctions for complex dynamical systems to ensure safety with bounded inputs.\nThis is accomplished by introducing a prediction-based term into the CBF that\nallows for the required margin needed to null the CBF rate of change given the\nspecified input constraints. Having established the theoretical groundwork,\ncertain remarks are subsequently presented with regards to the scheme's\nimplementation. Finally, the proposed prediction-based control barrier function\n(PB-CBF) scheme is implemented for two numerical examples. In particular, the\nsecond example is related to aircraft stall prevention, which is meant to\ndemonstrate the functionality and capability of the PB-CBFs in handling complex\nnonlinear dynamical systems via simulations. In both examples, the performance\nof the PB-CBF is compared with that of a non-prediction based basic CBF.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computer Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"UTDY7eDVIqWUOgMy3XFuQ4U-Y41d1IaeumiTkRd4tW0","pdfSize":"1281518"}