{"id":"2412.14290","title":"Impact of DESI BAO Data on Inflationary Parameters: stability against\n  late-time new physics","authors":"Simony Santos da Costa","authorsParsed":[["da Costa","Simony Santos",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 19:31:08 GMT"}],"updateDate":"2024-12-20","timestamp":1734550268000,"abstract":"  In this work, I investigate the impact of Dark Energy Spectroscopic\nInstrument (DESI) Baryonic Acoustic Oscillations (BAO) data on cosmological\nparameters, focusing on the inflationary spectral index $n_s$, the amplitude of\nscalar perturbations $A_s$, and the matter density parameter $\\omega_m$. By\nexamining different models of late-time new physics, the inflationary\nparameters were revealed to be stable when compared with the baseline dataset\nthat used the earlier BAO data from the SDSS collaboration. When combined with\nCosmic Microwave Background (CMB) and type Ia supernovae (SNeIa), DESI BAO data\nleads to a slight reduction in $\\omega_m$ (less than 2\\%) and modest changes in\n$A_s$ and $n_s$, if compared with the same combination but using SDSS BAO data\ninstead, suggesting a subtle shift in matter clustering. These effects may be\nattributed to a higher expansion rate from dynamical dark energy, changes in\nthe recombination period, or modifications to the matter-radiation equality\ntime. Further analyses of models with dynamical dark energy and free curvature\nshow a consistent trend of reduced $\\omega_m$, accompanied by slight increases\nin both $n_s$ and $H_0$. The results emphasize the importance of the DESI BAO\ndata in refining cosmological parameter estimates and highlight the stability\nof inflationary parameters across different late-time cosmological models.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"RYameDNmDDKj6nWn9FI4CiEYPKisZhoHu3N7yRzMVqI","pdfSize":"1910558"}