{
  "id": "2412.15902",
  "title": "On the Suitability of pre-trained foundational LLMs for Analysis in\n  German Legal Education",
  "authors": "Lorenz Wendlinger, Christian Braun, Abdullah Al Zubaer, Simon\n  Alexander Nonn, Sarah Gro{\\ss}kopf, Christofer Fellicious, Michael Granitzer",
  "authorsParsed": [
    [
      "Wendlinger",
      "Lorenz",
      ""
    ],
    [
      "Braun",
      "Christian",
      ""
    ],
    [
      "Zubaer",
      "Abdullah Al",
      ""
    ],
    [
      "Nonn",
      "Simon Alexander",
      ""
    ],
    [
      "Großkopf",
      "Sarah",
      ""
    ],
    [
      "Fellicious",
      "Christofer",
      ""
    ],
    [
      "Granitzer",
      "Michael",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 13:54:57 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734702897000,
  "abstract": "  We show that current open-source foundational LLMs possess instruction\ncapability and German legal background knowledge that is sufficient for some\nlegal analysis in an educational context. However, model capability breaks down\nin very specific tasks, such as the classification of \"Gutachtenstil\" appraisal\nstyle components, or with complex contexts, such as complete legal opinions.\nEven with extended context and effective prompting strategies, they cannot\nmatch the Bag-of-Words baseline. To combat this, we introduce a Retrieval\nAugmented Generation based prompt example selection method that substantially\nimproves predictions in high data availability scenarios. We further evaluate\nthe performance of pre-trained LLMs on two standard tasks for argument mining\nand automated essay scoring and find it to be more adequate. Throughout,\npre-trained LLMs improve upon the baseline in scenarios with little or no\nlabeled data with Chain-of-Thought prompting further helping in the zero-shot\ncase.\n",
  "subjects": [
    "Computer Science/Computation and Language",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "d3k1urpee6Q2ez3Q3h_yhGn8mORSDaXZBLSM2JmETFY",
  "pdfSize": "865608"
}