{"id":"2412.09798","title":"A Composite Target of a Radium Salt and a Soft Metal Matrix for\n  Production of Ac-225 with a Proton or Electron Accelerator","authors":"William Diamond, Carl Ross and Herbert Moore","authorsParsed":[["Diamond","William",""],["Ross","Carl",""],["Moore","Herbert",""]],"versions":[{"version":"v1","created":"Fri, 13 Dec 2024 02:33:25 GMT"}],"updateDate":"2024-12-16","timestamp":1734057205000,"abstract":"  The production of 225Ac using either a proton or electron accelerator\nrequires a target of 226Ra. Radium metal is difficult to work with and so a\nradium salt, such as radium carbonate, is preferred as a target material.\nNormally available as a powder, the average density of the powder is low and\nthe thermal conductivity is poor, thus limiting the beam power that can be\ndissipated in the target. This work proposes the creation of a solid mixture of\na radium salt powder with a metal matrix. Although aluminum powder has been\nused in similar applications, we suggest that indium powder is good choice for\nthe metal matrix in the case of radioactive radium salts. The target can be\nformed with low die pressure without any need for heating, thus simplifying the\nhot-cell equipment needed for target preparation. We describe how the solid\nmixture can be formed, measure its thermal conductivity and compare the value\nto model estimates. We calculate the yield of 225Ac under different scenarios.\nCalculations show that the radioactive isotopes of indium produced during the\nirradiation should not produce significant handling challenges\npost-irradiation. For the proposed target geometry and beam parameters, thermal\nmodelling indicates that the target temperature will be below the melting point\nof indium and the heat flux from the surfaces will be manageable. Thermal\nresistance at the target interfaces is shown to have a large effect on the\ntarget temperature. Using indium powder to form the mixture, occupying about 40\n% of the target volume, we find that the yield of 225Ac is 80 GBq (2 Ci) for a\n10-day irradiation with a 24 MeV, 3 kW proton beam and approximately the same\nfor three milkings of 225Ra after a 10-day irradiation with a 25 MeV, 20 kW\nelectron beam.\n","subjects":["Physics/Medical Physics","Physics/Instrumentation and Detectors"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"PmVp-C3bV_l-Tx-tlwVCr-gm35QgBGZteR1yH7U8Fco","pdfSize":"2015192"}