{"id":"2412.03342","title":"UniVAD: A Training-free Unified Model for Few-shot Visual Anomaly\n  Detection","authors":"Zhaopeng Gu, Bingke Zhu, Guibo Zhu, Yingying Chen, Ming Tang, Jinqiao\n  Wang","authorsParsed":[["Gu","Zhaopeng",""],["Zhu","Bingke",""],["Zhu","Guibo",""],["Chen","Yingying",""],["Tang","Ming",""],["Wang","Jinqiao",""]],"versions":[{"version":"v1","created":"Wed, 4 Dec 2024 14:20:27 GMT"},{"version":"v2","created":"Thu, 5 Dec 2024 03:31:40 GMT"}],"updateDate":"2024-12-06","timestamp":1733322027000,"abstract":"  Visual Anomaly Detection (VAD) aims to identify abnormal samples in images\nthat deviate from normal patterns, covering multiple domains, including\nindustrial, logical, and medical fields. Due to the domain gaps between these\nfields, existing VAD methods are typically tailored to each domain, with\nspecialized detection techniques and model architectures that are difficult to\ngeneralize across different domains. Moreover, even within the same domain,\ncurrent VAD approaches often follow a \"one-category-one-model\" paradigm,\nrequiring large amounts of normal samples to train class-specific models,\nresulting in poor generalizability and hindering unified evaluation across\ndomains. To address this issue, we propose a generalized few-shot VAD method,\nUniVAD, capable of detecting anomalies across various domains, such as\nindustrial, logical, and medical anomalies, with a training-free unified model.\nUniVAD only needs few normal samples as references during testing to detect\nanomalies in previously unseen objects, without training on the specific\ndomain. Specifically, UniVAD employs a Contextual Component Clustering ($C^3$)\nmodule based on clustering and vision foundation models to segment components\nwithin the image accurately, and leverages Component-Aware Patch Matching\n(CAPM) and Graph-Enhanced Component Modeling (GECM) modules to detect anomalies\nat different semantic levels, which are aggregated to produce the final\ndetection result. We conduct experiments on nine datasets spanning industrial,\nlogical, and medical fields, and the results demonstrate that UniVAD achieves\nstate-of-the-art performance in few-shot anomaly detection tasks across\nmultiple domains, outperforming domain-specific anomaly detection models. The\ncode will be made publicly available.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"Cn5aBpgNV_ekb2cn6yIUqe8ggTeRJqfiAhdjy1meMjk","pdfSize":"6001962"}