{
  "id": "2412.06138",
  "title": "SGIA: Enhancing Fine-Grained Visual Classification with Sequence\n  Generative Image Augmentation",
  "authors": "Qiyu Liao, Xin Yuan, Min Xu, Dadong Wang",
  "authorsParsed": [
    [
      "Liao",
      "Qiyu",
      ""
    ],
    [
      "Yuan",
      "Xin",
      ""
    ],
    [
      "Xu",
      "Min",
      ""
    ],
    [
      "Wang",
      "Dadong",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 01:39:46 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733708386000,
  "abstract": "  In Fine-Grained Visual Classification (FGVC), distinguishing highly similar\nsubcategories remains a formidable challenge, often necessitating datasets with\nextensive variability. The acquisition and annotation of such FGVC datasets are\nnotably difficult and costly, demanding specialized knowledge to identify\nsubtle distinctions among closely related categories. Our study introduces a\nnovel approach employing the Sequence Latent Diffusion Model (SLDM) for\naugmenting FGVC datasets, called Sequence Generative Image Augmentation (SGIA).\nOur method features a unique Bridging Transfer Learning (BTL) process, designed\nto minimize the domain gap between real and synthetically augmented data. This\napproach notably surpasses existing methods in generating more realistic image\nsamples, providing a diverse range of pose transformations that extend beyond\nthe traditional rigid transformations and style changes in generative\naugmentation. We demonstrate the effectiveness of our augmented dataset with\nsubstantial improvements in FGVC tasks on various datasets, models, and\ntraining strategies, especially in few-shot learning scenarios. Our method\noutperforms conventional image augmentation techniques in benchmark tests on\nthree FGVC datasets, showcasing superior realism, variability, and\nrepresentational quality. Our work sets a new benchmark and outperforms the\nprevious state-of-the-art models in classification accuracy by 0.5% for the\nCUB-200-2011 dataset and advances the application of generative models in FGVC\ndata augmentation.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "GcpQPvD6gPNQ-bK7r_I_pCt9M596cBjCeiRoX-ffItU",
  "pdfSize": "3557021"
}