{
  "id": "2412.05937",
  "title": "Accelerating Manufacturing Scale-Up from Material Discovery Using\n  Agentic Web Navigation and Retrieval-Augmented AI for Process Engineering\n  Schematics Design",
  "authors": "Sakhinana Sagar Srinivas, Akash Das, Shivam Gupta, Venkataramana\n  Runkana",
  "authorsParsed": [
    [
      "Srinivas",
      "Sakhinana Sagar",
      ""
    ],
    [
      "Das",
      "Akash",
      ""
    ],
    [
      "Gupta",
      "Shivam",
      ""
    ],
    [
      "Runkana",
      "Venkataramana",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 8 Dec 2024 13:36:42 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733665002000,
  "abstract": "  Process Flow Diagrams (PFDs) and Process and Instrumentation Diagrams (PIDs)\nare critical tools for industrial process design, control, and safety. However,\nthe generation of precise and regulation-compliant diagrams remains a\nsignificant challenge, particularly in scaling breakthroughs from material\ndiscovery to industrial production in an era of automation and digitalization.\nThis paper introduces an autonomous agentic framework to address these\nchallenges through a twostage approach involving knowledge acquisition and\ngeneration. The framework integrates specialized sub-agents for retrieving and\nsynthesizing multimodal data from publicly available online sources and\nconstructs ontological knowledge graphs using a Graph Retrieval-Augmented\nGeneration (Graph RAG) paradigm. These capabilities enable the automation of\ndiagram generation and open-domain question answering (ODQA) tasks with high\ncontextual accuracy. Extensive empirical experiments demonstrate the frameworks\nability to deliver regulation-compliant diagrams with minimal expert\nintervention, highlighting its practical utility for industrial applications.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Information Retrieval",
    "Computer Science/Multiagent Systems"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "Gt9zbUOWeWhLHTHDO_o1G7u8hx_TC1qSu3G0JT7U_dM",
  "pdfSize": "1224247"
}