{"id":"2412.17255","title":"Unlocking Cross-Lingual Sentiment Analysis through Emoji Interpretation:\n  A Multimodal Generative AI Approach","authors":"Rafid Ishrak Jahan, Heng Fan, Haihua Chen, Yunhe Feng","authorsParsed":[["Jahan","Rafid Ishrak",""],["Fan","Heng",""],["Chen","Haihua",""],["Feng","Yunhe",""]],"versions":[{"version":"v1","created":"Mon, 23 Dec 2024 03:57:45 GMT"}],"updateDate":"2024-12-24","timestamp":1734926265000,"abstract":"  Emojis have become ubiquitous in online communication, serving as a universal\nmedium to convey emotions and decorative elements. Their widespread use\ntranscends language and cultural barriers, enhancing understanding and\nfostering more inclusive interactions. While existing work gained valuable\ninsight into emojis understanding, exploring emojis' capability to serve as a\nuniversal sentiment indicator leveraging large language models (LLMs) has not\nbeen thoroughly examined. Our study aims to investigate the capacity of emojis\nto serve as reliable sentiment markers through LLMs across languages and\ncultures. We leveraged the multimodal capabilities of ChatGPT to explore the\nsentiments of various representations of emojis and evaluated how well\nemoji-conveyed sentiment aligned with text sentiment on a multi-lingual dataset\ncollected from 32 countries. Our analysis reveals that the accuracy of\nLLM-based emoji-conveyed sentiment is 81.43%, underscoring emojis' significant\npotential to serve as a universal sentiment marker. We also found a consistent\ntrend that the accuracy of sentiment conveyed by emojis increased as the number\nof emojis grew in text. The results reinforce the potential of emojis to serve\nas global sentiment indicators, offering insight into fields such as\ncross-lingual and cross-cultural sentiment analysis on social media platforms.\nCode: https://github.com/ResponsibleAILab/emoji-universal-sentiment.\n","subjects":["Computer Science/Computation and Language","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"wM3fboEfmwIXQ3SVicTQORAR4GSqMMF5gvQiXWD2eQs","pdfSize":"506650"}