{"id":"2412.03841","title":"LL-ICM: Image Compression for Low-level Machine Vision via Large\n  Vision-Language Model","authors":"Yuan Xue, Qi Zhang, Chuanmin Jia, Shiqi Wang","authorsParsed":[["Xue","Yuan",""],["Zhang","Qi",""],["Jia","Chuanmin",""],["Wang","Shiqi",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 03:12:45 GMT"}],"updateDate":"2024-12-06","timestamp":1733368365000,"abstract":"  Image Compression for Machines (ICM) aims to compress images for machine\nvision tasks rather than human viewing. Current works predominantly concentrate\non high-level tasks like object detection and semantic segmentation. However,\nthe quality of original images is usually not guaranteed in the real world,\nleading to even worse perceptual quality or downstream task performance after\ncompression. Low-level (LL) machine vision models, like image restoration\nmodels, can help improve such quality, and thereby their compression\nrequirements should also be considered. In this paper, we propose a pioneered\nICM framework for LL machine vision tasks, namely LL-ICM. By jointly optimizing\ncompression and LL tasks, the proposed LL-ICM not only enriches its encoding\nability in generalizing to versatile LL tasks but also optimizes the processing\nability of down-stream LL task models, achieving mutual adaptation for image\ncodecs and LL task models. Furthermore, we integrate large-scale\nvision-language models into the LL-ICM framework to generate more universal and\ndistortion-robust feature embeddings for LL vision tasks. Therefore, one LL-ICM\ncodec can generalize to multiple tasks. We establish a solid benchmark to\nevaluate LL-ICM, which includes extensive objective experiments by using both\nfull and no-reference image quality assessments. Experimental results show that\nLL-ICM can achieve 22.65% BD-rate reductions over the state-of-the-art methods.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ENy52ZPNddUx2WChrIMBGP7HZflFEdH5d55d49GMNuo","pdfSize":"4055853"}