{
  "id": "2412.20464",
  "title": "Capturing strong correlation effects on a quantum annealer: calculation\n  of avoided crossing in the H$_4$ molecule using the quantum annealer\n  eigensolver",
  "authors": "Aashna Anil Zade, Kenji Sugisaki, Matthias Werner, Ana Palacios, Artur\n  Garcia-Saez, Arnau Riera and V. S. Prasannaa",
  "authorsParsed": [
    [
      "Zade",
      "Aashna Anil",
      ""
    ],
    [
      "Sugisaki",
      "Kenji",
      ""
    ],
    [
      "Werner",
      "Matthias",
      ""
    ],
    [
      "Palacios",
      "Ana",
      ""
    ],
    [
      "Garcia-Saez",
      "Artur",
      ""
    ],
    [
      "Riera",
      "Arnau",
      ""
    ],
    [
      "Prasannaa",
      "V. S.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 29 Dec 2024 13:37:02 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735479422000,
  "abstract": "  We broaden the scope of the Quantum Annealer Eigensolver (QAE) algorithm, an\nunderexplored noisy intermediate scale quantum (NISQ) era approach for\ncalculating atomic and molecular properties, to predict avoided crossings,\nwhere strong correlation effects are at play. For this purpose, we consider the\nclassic example of the H$_4$ molecule in a rectangular geometry. Our results\nare obtained on the 5000-qubit D-Wave Advantage system 4.1 quantum computer. We\nbenchmark our quantum annealing results with full configuration interaction\n(FCI) as well as with those obtained using simulated annealing. We find that we\ncan predict avoided crossings within about 1.1% of the FCI value on real\nquantum hardware. We carry out analyses on the effect of the number of shots,\nanneal time, and the choice of Lagrange multiplier on our obtained results.\nSince the QAE algorithm provides information on the wave function as its\noutput, we also check the quality of the computed wave function by calculating\nthe fidelity, and find it to be 99.886%. Finally, we qualitatively discuss the\nstrengths and weaknesses of the QAE algorithm relative to its gate-based NISQ\nalgorithm counterpart, the celebrated Variational Quantum Eigensolver. Our work\ncontributes to the existing body of literature on QAE by demonstrating that\nhigh-quality results can be achieved on noisy hardware.\n",
  "subjects": [
    "Physics/Chemical Physics",
    "Physics/Atomic Physics",
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "he7jadSnb3g7v1D71fz-a4BtiLO6OXb4aRsl4RIf0Eg",
  "pdfSize": "2438385"
}