{"id":"2412.15621","title":"Pirates of Charity: Exploring Donation-based Abuses in Social Media\n  Platforms","authors":"Bhupendra Acharya, Dario Lazzaro, Antonio Emanuele Cin\\`a and Thorsten\n  Holz","authorsParsed":[["Acharya","Bhupendra",""],["Lazzaro","Dario",""],["Cinà","Antonio Emanuele",""],["Holz","Thorsten",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 07:26:43 GMT"}],"updateDate":"2024-12-23","timestamp":1734679603000,"abstract":"  With the widespread use of social media, organizations, and individuals use\nthese platforms to raise funds and support causes. Unfortunately, this has led\nto the rise of scammers in soliciting fraudulent donations. In this study, we\nconduct a large-scale analysis of donation-based scams on social media\nplatforms. More specifically, we studied profile creation and scam operation\nfraudulent donation solicitation on X, Instagram, Facebook, YouTube, and\nTelegram. By collecting data from 151,966 accounts and their 3,053,333 posts\nrelated to donations between March 2024 and May 2024, we identified 832\nscammers using various techniques to deceive users into making fraudulent\ndonations. Analyzing the fraud communication channels such as phone number,\nemail, and external URL linked, we show that these scamming accounts perform\nvarious fraudulent donation schemes, including classic abuse such as fake\nfundraising website setup, crowdsourcing fundraising, and asking users to\ncommunicate via email, phone, and pay via various payment methods. Through\ncollaboration with industry partners PayPal and cryptocurrency abuse database\nChainabuse, we further validated the scams and measured the financial losses on\nthese platforms. Our study highlights significant weaknesses in social media\nplatforms' ability to protect users from fraudulent donations. Additionally, we\nrecommended social media platforms, and financial services for taking proactive\nsteps to block these fraudulent activities. Our study provides a foundation for\nthe security community and researchers to automate detecting and mitigating\nfraudulent donation solicitation on social media platforms.\n","subjects":["Computer Science/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"49qS4fgmodn6_xW4Msr8_srVShp9jGO6hCFy_bgEQzc","pdfSize":"8673811"}