{
  "id": "2412.09096",
  "title": "High peak-power 2.1-{\\mu}m femtosecond Holmium amplifier at 100 kHz",
  "authors": "Anna Suzuki, Boldizsar Kassai, Yicheng Wang, Alan Omar, Robin\n  L\\\"oscher, Sergei Tomilov, Martin Hoffmann, Clara J. Saraceno",
  "authorsParsed": [
    [
      "Suzuki",
      "Anna",
      ""
    ],
    [
      "Kassai",
      "Boldizsar",
      ""
    ],
    [
      "Wang",
      "Yicheng",
      ""
    ],
    [
      "Omar",
      "Alan",
      ""
    ],
    [
      "Löscher",
      "Robin",
      ""
    ],
    [
      "Tomilov",
      "Sergei",
      ""
    ],
    [
      "Hoffmann",
      "Martin",
      ""
    ],
    [
      "Saraceno",
      "Clara J.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 09:23:29 GMT"
    },
    {
      "version": "v2",
      "created": "Fri, 14 Feb 2025 14:23:06 GMT"
    }
  ],
  "updateDate": "2025-02-17",
  "timestamp": 1733995409000,
  "abstract": "  High-power ultrafast laser sources in the short-wave infrared region are of\ngreat interest for numerous applications, including secondary sources of\nradiation and processing of materials commonly opaque in the near-infrared\nregion. In this wavelength region, direct laser amplification around 2.1-{\\mu}m\nwavelength within the atmospheric transparency window is particularly\nattractive for realizing compact and efficient high-power lasers. However, this\nwavelength region was widely underrepresented in femtosecond laser technology\nso far. Here, we report on a 2.1-{\\mu}m laser system delivering 97-fs pulses\nwith an unprecedented combination of high peak power of 525 MW and high\nrepetition rate of 100 kHz. The amplifier system consists of a mode-locked\noscillator seeding a regenerative amplifier (RA) using the novel broadband\nmaterial Holmium (Ho)-doped CaAlGdO4 (CALGO), operating in the chirped pulse\namplification (CPA) scheme and a nonlinear compression stage based on a\nHerriott-type multi-pass cell (MPC) with bulk material. We demonstrate the\npotential of this unique laser system by generating a micro plasma in ambient\nair, demonstrating its high intensity for future plasma-driven secondary\nsources. This system bridges the gap between conventional 1-to-10 kHz\namplifiers and high-power MHz laser oscillators in this attractive wavelength\nrange.\n",
  "subjects": [
    "Physics/Optics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "TSwPwdAtLpKeynikEbHZq2VLQLwkImjX3mTaLxJ-jJI",
  "pdfSize": "839132"
}