{
  "id": "2412.01341",
  "title": "Virtual finite element and hyperbolic problems: the PAMPA algorithm",
  "authors": "R\\'emi Abgrall and Yongle Liu and Walter Boscheri",
  "authorsParsed": [
    [
      "Abgrall",
      "Rémi",
      ""
    ],
    [
      "Liu",
      "Yongle",
      ""
    ],
    [
      "Boscheri",
      "Walter",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 10:07:03 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733134023000,
  "abstract": "  In this paper, we explore the use of the Virtual Element Method concepts to\nsolve scalar and system hyperbolic problems on general polygonal grids. The new\nschemes stem from the active flux approach \\cite{AF1}, which combines the usage\nof point values at the element boundaries with an additional degree of freedom\nrepresenting the average of the solution within each control volume. Along the\nlines of the family of residual distribution schemes introduced in\n\\cite{Abgrall_AF,abgrall2023activefluxtriangularmeshes} to bridge the active\nflux technique, we devise novel third order accurate methods that rely on the\nVEM technology to discretize gradients of the numerical solution by means of a\npolynomial-free approximation, hence adopting a virtual basis that is locally\ndefined for each element. The obtained discretization is globally continuous,\nand for nonlinear problems it needs a stabilization which is provided by the\n\\textit{a posteriori} MOOD paradigm \\cite{Mood1}. This is applied to both point\nand average values of the discrete solution. We show applications to scalar\nproblems, as well as to the acoustics and Euler equations in 2D. The accuracy\nand the robustness of the proposed schemes are assessed against a suite of\nbenchmarks involving smooth solutions, shock waves and other discontinuities.\n",
  "subjects": [
    "Mathematics/Numerical Analysis",
    "Computer Science/Numerical Analysis"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "1Lum40HLmjsIrNVDaF_PXYlvKvrDCXAzq_9qhlU7mBM",
  "pdfSize": "3064222"
}