{"id":"2412.16325","title":"Towards Safe and Honest AI Agents with Neural Self-Other Overlap","authors":"Marc Carauleanu, Michael Vaiana, Judd Rosenblatt, Cameron Berg, Diogo\n  Schwerz de Lucena","authorsParsed":[["Carauleanu","Marc",""],["Vaiana","Michael",""],["Rosenblatt","Judd",""],["Berg","Cameron",""],["de Lucena","Diogo Schwerz",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 20:23:52 GMT"}],"updateDate":"2024-12-24","timestamp":1734726232000,"abstract":"  As AI systems increasingly make critical decisions, deceptive AI poses a\nsignificant challenge to trust and safety. We present Self-Other Overlap (SOO)\nfine-tuning, a promising approach in AI Safety that could substantially improve\nour ability to build honest artificial intelligence. Inspired by cognitive\nneuroscience research on empathy, SOO aims to align how AI models represent\nthemselves and others. Our experiments on LLMs with 7B, 27B, and 78B parameters\ndemonstrate SOO's efficacy: deceptive responses of Mistral-7B-Instruct-v0.2\ndropped from 73.6% to 17.2% with no observed reduction in general task\nperformance, while in Gemma-2-27b-it and CalmeRys-78B-Orpo-v0.1 deceptive\nresponses were reduced from 100% to 9.3% and 2.7%, respectively, with a small\nimpact on capabilities. In reinforcement learning scenarios, SOO-trained agents\nshowed significantly reduced deceptive behavior. SOO's focus on contrastive\nself and other-referencing observations offers strong potential for\ngeneralization across AI architectures. While current applications focus on\nlanguage models and simple RL environments, SOO could pave the way for more\ntrustworthy AI in broader domains. Ethical implications and long-term effects\nwarrant further investigation, but SOO represents a significant step forward in\nAI safety research.\n","subjects":["Computer Science/Artificial Intelligence","Computer Science/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"6nFk_IbXnM0vV54vjgJOkBlHlHJhZW_yeePbCPpUbvE","pdfSize":"758921"}