{"id":"2412.13199","title":"Solving the Inverse Problem of Magnetic Induction Tomography Using\n  Gauss-Newton Iterative Method and Zoning Technique to Reduce Unknown\n  Coefficients","authors":"Mohammad Reza Yousefi, Amin Dehghani, Ali Asghar Amini, S. M. Mehdi\n  Mirtalaei","authorsParsed":[["Yousefi","Mohammad Reza",""],["Dehghani","Amin",""],["Amini","Ali Asghar",""],["Mirtalaei","S. M. Mehdi",""]],"versions":[{"version":"v1","created":"Sun, 1 Dec 2024 08:22:33 GMT"}],"updateDate":"2024-12-19","timestamp":1733041353000,"abstract":"  Magnetic Induction Tomography (MIT) is a promising modality for noninvasive\nimaging due to its contactless and nonionizing technology. In this imaging\nmethod, a primary magnetic field is applied by excitation coils to induce eddy\ncurrents in the material to be studied, and a secondary magnetic field is\ndetected from these eddy currents using sensing coils. The image (spatial\ndistribution of electrical conductivity) is then reconstructed using\nmeasurement data, the initial estimation of electrical conductivity, and the\niterative solution of forward and inverse problems. The inverse problem can be\nsolved using one-step linear, iterative nonlinear, and special methods. In\ngeneral, the MIT inverse problem can be solved by Gauss- Newton iterative\nmethod with acceptable accuracy. In this paper, this algorithm is extended and\nthe zoning technique is employed for the reduction of unknown coefficients. The\nsimulation results obtained by the proposed method are compared with the real\nconductivity coefficients and the mean relative error rate is reduced to\n24.22%. On the other hand, Gauss-Newton iterative method is extended for\nsolving the inverse problem of the MIT, and sensitivity measurement matrices\nare extracted in different experimental and normalization conditions.\n","subjects":["Quantitative Biology/Quantitative Methods"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"AzyoKuJEvhflfpVUZdr69zPYKDvIIZUpExOKFVLd5Xk","pdfSize":"1183325"}