{"id":"2412.11545","title":"Minute-cadence Observations of the LAMOST Fields with the TMTS: VI.\n  Absolute Physical Parameters of Contact Binaries","authors":"Qiqi Xia, Xiaofeng Wang, Kai Li, Xiang Gao, Fangzhou Guo, Jie Lin,\n  Cheng Liu, Jun Mo, Haowei Peng, Qichun Liu, Gaobo Xi, Shengyu Yan, Xiaojun\n  Jiang, Jicheng Zhang, Cui-Ying Song, Jianrong Shi, Xiaoran Ma, Danfeng Xiang,\n  Wenxiong Li","authorsParsed":[["Xia","Qiqi",""],["Wang","Xiaofeng",""],["Li","Kai",""],["Gao","Xiang",""],["Guo","Fangzhou",""],["Lin","Jie",""],["Liu","Cheng",""],["Mo","Jun",""],["Peng","Haowei",""],["Liu","Qichun",""],["Xi","Gaobo",""],["Yan","Shengyu",""],["Jiang","Xiaojun",""],["Zhang","Jicheng",""],["Song","Cui-Ying",""],["Shi","Jianrong",""],["Ma","Xiaoran",""],["Xiang","Danfeng",""],["Li","Wenxiong",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 08:25:22 GMT"}],"updateDate":"2024-12-17","timestamp":1734337522000,"abstract":"  With the development of wide-field surveys, a large amount of data on\nshort-period W UMa contact binaries have been obtained. Continuous and\nuninterrupted light curves as well as high-resolution spectroscopic data are\ncrucial in determining the absolute physical parameters. Targets with both TMTS\nlight curves and LAMOST medium-resolution spectra were selected. The absolute\nphysical parameters were inferred with the W-D code for ten systems, all of\nthem are W-type shallow or medium contact binaries. The O'Connell effect\nobserved in the light curves can be explained by adding a spot on the primary\nor secondary component in the models. According to O-C analysis, the orbital\nperiods exhibit a long-term increasing or decreasing trend, amongst which\nJ0132, J1300, and J1402 show periodic variations that may be attributed to the\npresence of a third body or magnetic activity cycles. Spectral subtraction\nanalysis revealed that the equivalent width of H$\\alpha$ indicates strong\nmagnetic activity in J0047, J0305, J0638, and J1402. Among the 10 selected\nbinary systems, except for J0132 and J0913, the more massive components are\nfound to be main-sequence stars while the less massive components have evolved\noff the main sequence. In J0132, both components are in the main sequence,\nwhereas both components of J0913 lie above the terminal-age main sequence.\nBased on the relationship between orbital angular momentum and total mass for\nthese two systems, as well as their low fill-out factors, it is possible that\nthese two systems are newly formed contact binaries, having recently evolved\nfrom the detached configuration.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"lCGXBQncATXOvaT2WNYfae-4T5SgXEfP0yPoJw8F6wg","pdfSize":"2391339"}