{"id":"2412.09536","title":"Identification of structures driving trailing-edge noise. Part I --\n  Experimental investigation","authors":"Simon Demange, Zhenyang Yuan, Simon Jekosch, Ennes Sarradj, Ardeshir\n  Hanifi, Andr\\'e V. G. Cavalieri, Kilian Oberleithner","authorsParsed":[["Demange","Simon",""],["Yuan","Zhenyang",""],["Jekosch","Simon",""],["Sarradj","Ennes",""],["Hanifi","Ardeshir",""],["Cavalieri","André V. G.",""],["Oberleithner","Kilian",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 18:27:53 GMT"}],"updateDate":"2024-12-13","timestamp":1734028073000,"abstract":"  Trailing-edge (TE) noise is the main contributor to the acoustic signature of\nflows over airfoils. It originates from the interaction of turbulent structures\nin the airfoil boundary layer with the TE. This study experimentally identifies\nthe flow structures responsible for TE noise by decomposing the data into\nspanwise modes and examining the impact of spanwise coherent structures on\nsound emission. We analyse a NACA0012 airfoil at moderate Reynolds numbers,\nensuring broadband TE noise, and use synchronous measurements of surface and\nfar-field acoustic pressure fluctuations with custom spanwise microphone\narrays. Our results demonstrate the key role of coherent structures with large\nspanwise wavelengths in generating broadband TE noise. Spanwise modal\ndecomposition of the acoustic field shows that only waves with spanwise\nwavenumbers below the acoustic wavenumber contribute to the radiated acoustic\nspectrum, consistent with theoretical scattering conditions. Moreover, a strong\ncorrelation is found between spanwise-coherent (zero wavenumber) flow\nstructures and radiated acoustics. At frequencies corresponding to peak TE\nnoise emission, the turbulent structures responsible for radiation exhibit\nstrikingly large spanwise wavelengths, exceeding $60\\%$ of the airfoil chord\nlength. These findings have implications for numerical and experimental TE\nnoise analysis and flow control. The correlation between spectrally decomposed\nturbulent fluctuations and TE noise paves the way for future aeroacoustic\nmodelling through linearized mean field analysis. A companion paper further\nexplores the nature of the spanwise-coherent structures using high-resolution\nnumerical simulations of the same setup.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"bISQy5U5a7OhvPXhserq5x5eEXXflVwSvU_AP8zNuHU","pdfSize":"4727554"}