{"id":"2412.07737","title":"Explainable machine learning for neoplasms diagnosis via\n  electrocardiograms: an externally validated study","authors":"Juan Miguel Lopez Alcaraz, Wilhelm Haverkamp, Nils Strodthoff","authorsParsed":[["Alcaraz","Juan Miguel Lopez",""],["Haverkamp","Wilhelm",""],["Strodthoff","Nils",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 18:34:08 GMT"}],"updateDate":"2024-12-11","timestamp":1733855648000,"abstract":"  Background: Neoplasms remains a leading cause of mortality worldwide, with\ntimely diagnosis being crucial for improving patient outcomes. Current\ndiagnostic methods are often invasive, costly, and inaccessible to many\npopulations. Electrocardiogram (ECG) data, widely available and non-invasive,\nhas the potential to serve as a tool for neoplasms diagnosis by using\nphysiological changes in cardiovascular function associated with neoplastic\nprescences.\n  Methods: This study explores the application of machine learning models to\nanalyze ECG features for the diagnosis of neoplasms. We developed a pipeline\nintegrating tree-based models with Shapley values for explainability. The model\nwas trained and internally validated and externally validated on a second\nlarge-scale independent external cohort to ensure robustness and\ngeneralizability.\n  Findings: The results demonstrate that ECG data can effectively capture\nneoplasms-associated cardiovascular changes, achieving high performance in both\ninternal testing and external validation cohorts. Shapley values identified key\nECG features influencing model predictions, revealing established and novel\ncardiovascular markers linked to neoplastic conditions. This non-invasive\napproach provides a cost-effective and scalable alternative for the diagnosis\nof neoplasms, particularly in resource-limited settings. Similarly, useful for\nthe management of secondary cardiovascular effects given neoplasms therapies.\n  Interpretation: This study highlights the feasibility of leveraging ECG\nsignals and machine learning to enhance neoplasms diagnostics. By offering\ninterpretable insights into cardio-neoplasms interactions, this approach\nbridges existing gaps in non-invasive diagnostics and has implications for\nintegrating ECG-based tools into broader neoplasms diagnostic frameworks, as\nwell as neoplasms therapy management.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8wrImsqpF_MSh1Xq8nNjqTw7c5v0FV0FMhKfNOKY5sA","pdfSize":"11227764"}