{
  "id": "2412.02943",
  "title": "Modularized Neural Network Incorporating Physical Priors for Smart\n  Building Control, Accuracy or Consistency?",
  "authors": "Zixin Jiang, Bing Dong",
  "authorsParsed": [
    [
      "Jiang",
      "Zixin",
      ""
    ],
    [
      "Dong",
      "Bing",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 01:22:01 GMT"
    }
  ],
  "updateDate": "2024-12-05",
  "timestamp": 1733275321000,
  "abstract": "  Model predictive control can achieve significant energy savings, offer grid\nflexibility, and mitigate carbon emissions. However, the challenge of\nidentifying individual control-oriented building dynamic models limits\nlarge-scale real-world applications. To address this issue, this study proposed\na Modularized Neural Network Incorporating Physical Priors (ModNN), capable of\nestablishing a control-oriented and physical-consistent building dynamic model\nwithin minutes without substantial modeling effort. This is also the first\nstudy to evaluate the physical consistency of a given data-driven model both\nqualitatively and quantitively. We compared the physical consistency of a\nclassical Long Short-Term Memory (LSTM) model and our ModNN. The ModNN strictly\nsatisfies physical constraints, whereas the LSTM model learned contradictory\nsystem dynamics. Additionally, we compared their control performance on an\nEnergyPlus virtual testbed. While the LSTM model demonstrated slightly better\nprediction accuracy in dynamic modeling, it failed in control optimization,\nresulting in an 89{\\deg}C-h temperature violation, whereas the ModNN showed\nonly a 0.57{\\deg}C-h violation and achieved up to a 78% peak load reduction.\nOur findings highlight the importance of incorporating physics priors into\ndata-driven models and provide a promising solution for future smart building\ncontrol optimization. Furthermore, the proposed evaluation framework defines\ntwo physical consistency indicators, providing guidelines for selecting and\ntesting control-oriented, data-driven building dynamic models.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Systems and Control",
    "Computer Science/Systems and Control"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "pett_Vj0viad71kEkNqaTfojNG7ROl6fWJWF6Ei1d20",
  "pdfSize": "1205247"
}