{"id":"2412.09671","title":"Effective temperatures of the QGP from thermal photon and dilepton\n  production","authors":"Olaf Massen, Govert Nijs, Mike Sas, Wilke van der Schee and Raimond\n  Snellings","authorsParsed":[["Massen","Olaf",""],["Nijs","Govert",""],["Sas","Mike",""],["van der Schee","Wilke",""],["Snellings","Raimond",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 19:00:00 GMT"}],"updateDate":"2024-12-16","timestamp":1734030000000,"abstract":"  Thermal electromagnetic radiation is emitted by the quark-gluon plasma (QGP)\nthroughout its space-time evolution, with production rates that depend\ncharacteristically on the temperature. We study this temperature using thermal\nphotons and dileptons using the Trajectum heavy ion code, which is constrained\nby Bayesian analysis. In addition we present the elliptic flow of both the\nthermal photons and thermal dileptons including systematic uncertainties\ncorresponding to the model parameter uncertainty. We give a comprehensive\noverview of the resulting effective temperatures $T_{\\rm eff}$, obtained from\nthermal photon transverse momentum and thermal dilepton invariant mass\ndistributions, as well as the dependence of $T_{\\rm eff}$ on various selection\ncriteria of these probes. We conclude that the $T_{\\rm eff}$ obtained from\nthermal photons is mostly insensitive to the temperature of the QGP with a\nvalue of $T_{\\rm eff} \\sim$ 250-300 MeV depending on their transverse momentum,\nalmost independent of collision centrality. Thermal dileptons are much better\nprobes of the QGP temperature as they do not suffer from a blue shift as their\ninvariant mass is used, allowing for a more precise constraint of the QGP\ntemperature during different stages of the evolution of the system. By applying\nselection criteria on the dilepton transverse momentum and the invariant mass\nwe are able to extract fluid temperatures on average times ranging from late\nemission ($\\langle \\tau \\rangle = 5.6\\,$fm$/c$) to very early emissions\n($\\langle \\tau \\rangle < 1.0\\,$fm$/c$). Furthermore, we show how these\nselection criteria can be used to map the elliptic flow of the system all\nthroughout its evolution.\n","subjects":["Physics/Nuclear Theory","Physics/High Energy Physics - Phenomenology","Physics/Nuclear Experiment"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"HM4mZQ4aG8CE3F59cbc1y8u7VJSo2-3x7kU42PzfVyE","pdfSize":"2085402"}