{
  "id": "2412.12839",
  "title": "From An LLM Swarm To A PDDL-Empowered HIVE: Planning Self-Executed\n  Instructions In A Multi-Modal Jungle",
  "authors": "Kaustubh Vyas, Damien Graux, Yijun Yang, S\\'ebastien Montella, Chenxin\n  Diao, Wendi Zhou, Pavlos Vougiouklis, Ruofei Lai, Yang Ren, Keshuang Li, Jeff\n  Z. Pan",
  "authorsParsed": [
    [
      "Vyas",
      "Kaustubh",
      ""
    ],
    [
      "Graux",
      "Damien",
      ""
    ],
    [
      "Yang",
      "Yijun",
      ""
    ],
    [
      "Montella",
      "Sébastien",
      ""
    ],
    [
      "Diao",
      "Chenxin",
      ""
    ],
    [
      "Zhou",
      "Wendi",
      ""
    ],
    [
      "Vougiouklis",
      "Pavlos",
      ""
    ],
    [
      "Lai",
      "Ruofei",
      ""
    ],
    [
      "Ren",
      "Yang",
      ""
    ],
    [
      "Li",
      "Keshuang",
      ""
    ],
    [
      "Pan",
      "Jeff Z.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 12:05:21 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734437121000,
  "abstract": "  In response to the call for agent-based solutions that leverage the\never-increasing capabilities of the deep models' ecosystem, we introduce Hive\n-- a comprehensive solution for selecting appropriate models and subsequently\nplanning a set of atomic actions to satisfy the end-users' instructions. Hive\noperates over sets of models and, upon receiving natural language instructions\n(i.e. user queries), schedules and executes explainable plans of atomic\nactions. These actions can involve one or more of the available models to\nachieve the overall task, while respecting end-users specific constraints.\nNotably, Hive handles tasks that involve multi-modal inputs and outputs,\nenabling it to handle complex, real-world queries. Our system is capable of\nplanning complex chains of actions while guaranteeing explainability, using an\nLLM-based formal logic backbone empowered by PDDL operations. We introduce the\nMuSE benchmark in order to offer a comprehensive evaluation of the multi-modal\ncapabilities of agent systems. Our findings show that our framework redefines\nthe state-of-the-art for task selection, outperforming other competing systems\nthat plan operations across multiple models while offering transparency\nguarantees while fully adhering to user constraints.\n",
  "subjects": [
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "8Dx8gfpQiSIMc9MPjKqqpcbuTnRmOgzLEpfxE77RU1w",
  "pdfSize": "9801877"
}