{
  "id": "2412.06758",
  "title": "Robust Quantum Reservoir Computing for Molecular Property Prediction",
  "authors": "Daniel Beaulieu, Milan Kornjaca, Zoran Krunic, Michael Stivaktakis,\n  Thomas Ehmer, Sheng-Tao Wang, and Anh Pham",
  "authorsParsed": [
    [
      "Beaulieu",
      "Daniel",
      ""
    ],
    [
      "Kornjaca",
      "Milan",
      ""
    ],
    [
      "Krunic",
      "Zoran",
      ""
    ],
    [
      "Stivaktakis",
      "Michael",
      ""
    ],
    [
      "Ehmer",
      "Thomas",
      ""
    ],
    [
      "Wang",
      "Sheng-Tao",
      ""
    ],
    [
      "Pham",
      "Anh",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 18:49:18 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733770158000,
  "abstract": "  Machine learning has been increasingly utilized in the field of biomedical\nresearch to accelerate the drug discovery process. In recent years, the\nemergence of quantum computing has been followed by extensive exploration of\nquantum machine learning algorithms. Quantum variational machine learning\nalgorithms are currently the most prevalent but face issues with trainability\ndue to vanishing gradients. An emerging alternative is the quantum reservoir\ncomputing (QRC) approach, in which the quantum algorithm does not require\ngradient evaluation on quantum hardware. Motivated by the potential advantages\nof the QRC method, we apply it to predict the biological activity of potential\ndrug molecules based on molecular descriptors. We observe more robust QRC\nperformance as the size of the dataset decreases, compared to standard\nclassical models, a quality of potential interest for pharmaceutical datasets\nof limited size. In addition, we leverage the uniform manifold approximation\nand projection technique to analyze structural changes as classical features\nare transformed through quantum dynamics and find that quantum reservoir\nembeddings appear to be more interpretable in lower dimensions.\n",
  "subjects": [
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Buai2ZzdfsDLV2F7_qrIh7s6QRwQnmCAu4aA28CGax0",
  "pdfSize": "2069271"
}