{
  "id": "2412.08618",
  "title": "Image Retrieval Methods in the Dissimilarity Space",
  "authors": "Madhu Kiran, Kartikey Vishnu, Rafael M. O. Cruz, Eric Granger",
  "authorsParsed": [
    [
      "Kiran",
      "Madhu",
      ""
    ],
    [
      "Vishnu",
      "Kartikey",
      ""
    ],
    [
      "Cruz",
      "Rafael M. O.",
      ""
    ],
    [
      "Granger",
      "Eric",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 18:39:32 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733942372000,
  "abstract": "  Image retrieval methods rely on metric learning to train backbone feature\nextraction models that can extract discriminant queries and reference (gallery)\nfeature representations for similarity matching. Although state-of-the-art\naccuracy has improved considerably with the advent of deep learning (DL) models\ntrained on large datasets, image retrieval remains challenging in many\nreal-world video analytics and surveillance applications, e.g., person\nre-identification. Using the Euclidean space for matching limits the\nperformance in real-world applications due to the curse of dimensionality,\noverfitting, and sensitivity to noisy data.\n  We argue that the feature dissimilarity space is more suitable for similarity\nmatching, and propose a dichotomy transformation to project query and reference\nembeddings into a single embedding in the dissimilarity space.\n  We also advocate for end-to-end training of a backbone and binary\nclassification models for pair-wise matching. As opposed to comparing the\ndistance between queries and reference embeddings, we show the benefits of\nclassifying the single dissimilarity space embedding (as similar or\ndissimilar), especially when trained end-to-end. We propose a method to train\nthe max-margin classifier together with the backbone feature extractor by\napplying constraints to the L2 norm of the classifier weights along with the\nhinge loss.\n  Our extensive experiments on challenging image retrieval datasets and using\ndiverse feature extraction backbones highlight the benefits of similarity\nmatching in the dissimilarity space. In particular, when jointly training the\nfeature extraction backbone and regularised classifier for matching, the\ndissimilarity space provides a higher level of accuracy.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "ze70psahRNvWcMRTWEJJNzBu-pc4vzfZbOFVIuSkvA4",
  "pdfSize": "250992"
}