{
  "id": "2412.15323",
  "title": "Abelian Spectral Topology of Multifold Exceptional Points",
  "authors": "Marcus St{\\aa}lhammar, and Lukas R{\\o}dland",
  "authorsParsed": [
    [
      "Stålhammar",
      "Marcus",
      ""
    ],
    [
      "Rødland",
      "Lukas",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 19:00:00 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734634800000,
  "abstract": "  The advent of non-Hermitian physics has enriched the plethora of topological\nphases to include phenomena without Hermitian counterparts. Despite being among\nthe most well-studied uniquely non-Hermitian features, the topological\nproperties of multifold exceptional points, $n$-fold spectral degeneracies\n(EP$n$s) at which also the corresponding eigenvectors coalesce, were only\nrecently revealed in terms of topological resultant winding numbers and\nconcomitant Abelian doubling theorems. Nevertheless, a more mathematically\nfundamental description of EP$n$s and their topological nature has remained an\nopen question. To fill this void, in this article, we revisit the topological\nclassification of EP$n$s in generic systems and systems with local symmetries,\ngeneralize it in terms of more mathematically tractable (local) similarity\nrelations, and extend it to include all such similarities as well as non-local\nsymmetries. Through the resultant vector, whose components are given in terms\nof the resultants between the corresponding characteristic polynomial and its\nderivatives, the topological nature of the resultant winding number is\nunderstood in several ways: in terms of i) the tenfold classification of\n(Hermitian) topological matter, ii) the framework of Mayer--Vietoris sequence,\nand iii) the classification of vector bundles. Our work reveals the\nmathematical foundations on which the topological nature of EP$n$s resides,\nenriches the theoretical understanding of non-Hermitian spectral features, and\nwill therefore find great use in modern experiments within both classical and\nquantum physics.\n",
  "subjects": [
    "Condensed Matter/Mesoscale and Nanoscale Physics",
    "Physics/Mathematical Physics",
    "Mathematics/Mathematical Physics",
    "Physics/Optics",
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "jNuOAa_m8BY1YiLa-HL9JY0H_ZrSpzrHjfgL0mRqaZ0",
  "pdfSize": "4776094"
}