{"id":"2412.16182","title":"Decoding Poultry Vocalizations -- Natural Language Processing and\n  Transformer Models for Semantic and Emotional Analysis","authors":"Venkatraman Manikandan and Suresh Neethirajan","authorsParsed":[["Manikandan","Venkatraman",""],["Neethirajan","Suresh",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 06:44:32 GMT"}],"updateDate":"2024-12-24","timestamp":1733899472000,"abstract":"  Deciphering the acoustic language of chickens offers new opportunities in\nanimal welfare and ecological informatics. Their subtle vocal signals encode\nhealth conditions, emotional states, and dynamic interactions within\necosystems. Understanding the semantics of these calls provides a valuable tool\nfor interpreting their functional vocabulary and clarifying how each sound\nserves a specific purpose in social and environmental contexts. We apply\nadvanced Natural Language Processing and transformer based models to translate\nbioacoustic data into meaningful insights. Our method integrates Wave2Vec 2.0\nfor raw audio feature extraction with a fine tuned Bidirectional Encoder\nRepresentations from Transformers model, pretrained on a broad corpus of animal\nsounds and adapted to poultry tasks. This pipeline decodes poultry\nvocalizations into interpretable categories including distress calls, feeding\nsignals, and mating vocalizations, revealing emotional nuances often overlooked\nby conventional analyses. Achieving 92 percent accuracy in classifying key\nvocalization types, our approach demonstrates the feasibility of real time\nautomated monitoring of flock health and stress. By tracking this functional\nvocabulary, farmers can respond proactively to environmental or behavioral\nchanges, improving poultry welfare, reducing stress related productivity\nlosses, and supporting more sustainable farm management. Beyond agriculture,\nthis research enhances our understanding of computational ecology. Accessing\nthe semantic foundation of animal calls may indicate biodiversity,\nenvironmental stressors, and species interactions, informing integrative\necosystem level decision making.\n","subjects":["Computer Science/Sound","Computer Science/Artificial Intelligence","Computer Science/Computation and Language","Computer Science/Machine Learning","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"ibjNg67eeNO82bJ6H0sH_UGLCudH2dQ6_tOInnR5MQk","pdfSize":"764817"}