{
  "id": "2412.08339",
  "title": "Induced eccentricity splitting in disordered optical microspheres for\n  machine learning enabled wavemeter",
  "authors": "Ivan Saetchnikov, Elina Tcherniavskaia, Andreas Ostendorf, Anton\n  Saetchnikov",
  "authorsParsed": [
    [
      "Saetchnikov",
      "Ivan",
      ""
    ],
    [
      "Tcherniavskaia",
      "Elina",
      ""
    ],
    [
      "Ostendorf",
      "Andreas",
      ""
    ],
    [
      "Saetchnikov",
      "Anton",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 12:29:42 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733920182000,
  "abstract": "  Accurate measurement of light wavelength is critical for applications in\nspectroscopy, optical communication, and semiconductor manufacturing, ensuring\nprecision and consistency of sensing, high-speed data transmission and device\nproduction. Emerging reconstructive wavemeters synergize physical systems\ncapable for pseudo-random wavelength dependent pattern formation with\ncomputational techniques to offer a promising alternative against established\nmethods such as frequency beating and inteferometry for high-resolution and\nbroadband measurements in compact and cost-effective devices. In this paper, we\npropose a novel type of compact and affordable reconstructive wavemeter based\non the disordered chip with thousands of high quality-factor whispering gallery\nmode microcavities as physical model and a hybrid machine learning approach\nutilizing boosting methods and variational autoencoders implemented as\nwavelength interpreter. We leverage eccentricity mode splitting obtained via\ncontrollable deformation of the spherical microresonators in order to ensure\nthe uniqueness of the wavelength patterns up to ultra-wide (~100 nm) spectral\nwindow while guaranteeing high (~100 fm) intrinsic sensitivity. The latter\nallocates the proposed model right next to the ultimate reconstructive\nwavemeters based on integrating spheres, but with superior miniaturization\noptions and chip-scale integrability.\n",
  "subjects": [
    "Physics/Optics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "Chbo3CmSd1ec034wrjqj2i_mdeA450zmk5ybg2BeOaM",
  "pdfSize": "2292594"
}