{
  "id": "2412.18763",
  "title": "Unusual topological polar texture in moir\\'e ferroelectrics",
  "authors": "Yuhao Li, Yuanhao Wei, Ruiping Guo, Yifei Wang, Hanhao Zhang, Takashi\n  Taniguchi, Kenji Watanabe, Yan Shi, Yi Shi, Chong Wang, Zaiyao Fei",
  "authorsParsed": [
    [
      "Li",
      "Yuhao",
      ""
    ],
    [
      "Wei",
      "Yuanhao",
      ""
    ],
    [
      "Guo",
      "Ruiping",
      ""
    ],
    [
      "Wang",
      "Yifei",
      ""
    ],
    [
      "Zhang",
      "Hanhao",
      ""
    ],
    [
      "Taniguchi",
      "Takashi",
      ""
    ],
    [
      "Watanabe",
      "Kenji",
      ""
    ],
    [
      "Shi",
      "Yan",
      ""
    ],
    [
      "Shi",
      "Yi",
      ""
    ],
    [
      "Wang",
      "Chong",
      ""
    ],
    [
      "Fei",
      "Zaiyao",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 25 Dec 2024 03:25:29 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735097129000,
  "abstract": "  Topological polar textures in ferroelectrics have attracted significant\ninterest for their potential for energy-efficient and high-density data storage\nand processing. Among these, polar merons and antimerons are predicted in\nstrained and twisted bilayers of inversion symmetry broken systems. However,\nexperimental observation of these polar textures within twisted two-dimensional\nvan der Waals (2D vdW) materials remains challenging. Here, we utilize vector\npiezoresponse force microscopy (PFM) to reconstruct the polarization fields in\nR-type marginally twisted hexagonal boron nitride (hBN). We observe alternating\nout-of-plane (OOP) polarizations at domain regions and in-plane (IP)\nvortex-like polarization patterns along domain walls (DWs), indicative of a\nnetwork of polar merons and antimerons. Notably, the OOP polarization exhibits\nthree polarity reversals across a DW. Similar polar textures are identified in\nmarginally twisted MoSe2 and WSe2 homobilayers. Our theoretical simulations\nattribute these unusual polarization reversals near the DWs to the competition\nbetween moir\\'e ferroelectricity and piezoelectricity. These results provide\nexperimental evidence of complex polar textures in moir\\'e ferroelectrics,\noffering new insights into the electronic band topology in twisted transition\nmetal dichalcogenides (TMDCs).\n",
  "subjects": [
    "Condensed Matter/Materials Science"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "nTjw_N74kKe0_b1CiHe6LPiHB0LwFyMe4Cy_SYHmb7U",
  "pdfSize": "870395"
}