{
  "id": "2412.07919",
  "title": "Identifying Quantum Mechanical Statistics in Italian Corpora",
  "authors": "Diederik Aerts, Jonito Aerts Argu\\\"elles, Lester Beltran, Massimiliano\n  Sassoli de Bianchi and Sandro Sozzo",
  "authorsParsed": [
    [
      "Aerts",
      "Diederik",
      ""
    ],
    [
      "Arguëlles",
      "Jonito Aerts",
      ""
    ],
    [
      "Beltran",
      "Lester",
      ""
    ],
    [
      "de Bianchi",
      "Massimiliano Sassoli",
      ""
    ],
    [
      "Sozzo",
      "Sandro",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 21:04:56 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733864696000,
  "abstract": "  We present a theoretical and empirical investigation of the statistical\nbehaviour of the words in a text produced by human language. To this aim, we\nanalyse the word distribution of various texts of Italian language selected\nfrom a specific literary corpus. We firstly generalise a theoretical framework\nelaborated by ourselves to identify 'quantum mechanical statistics' in\nlarge-size texts. Then, we show that, in all analysed texts, words distribute\naccording to 'Bose--Einstein statistics' and show significant deviations from\n'Maxwell--Boltzmann statistics'. Next, we introduce an effect of 'word\nrandomization' which instead indicates that the difference between the two\nstatistical models is not as pronounced as in the original cases. These results\nconfirm the empirical patterns obtained in texts of English language and\nstrongly indicate that identical words tend to 'clump together' as a\nconsequence of their meaning, which can be explained as an effect of 'quantum\nentanglement' produced through a phenomenon of 'contextual updating'. More,\nword randomization can be seen as the linguistic-conceptual equivalent of an\nincrease of temperature which destroys 'coherence' and makes classical\nstatistics prevail over quantum statistics. Some insights into the origin of\nquantum statistics in physics are finally provided.\n",
  "subjects": [
    "Quantitative Biology/Neurons and Cognition",
    "Computer Science/Computation and Language",
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "KBz1QLV869vGSP8C_daJg2BJVVJO4O5Tfzip9OpWQqg",
  "pdfSize": "1098342"
}