{"id":"2412.09427","title":"A Plug-and-Play Algorithm for 3D Video Super-Resolution of Single-Photon\n  LiDAR data","authors":"Alice Ruget, Lewis Wilson, Jonathan Leach, Rachael Tobin, Aongus\n  Mccarthy, Gerald S. Buller, Steve Mclaughlin, Abderrahim Halimi","authorsParsed":[["Ruget","Alice",""],["Wilson","Lewis",""],["Leach","Jonathan",""],["Tobin","Rachael",""],["Mccarthy","Aongus",""],["Buller","Gerald S.",""],["Mclaughlin","Steve",""],["Halimi","Abderrahim",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 16:33:06 GMT"}],"updateDate":"2024-12-13","timestamp":1734021186000,"abstract":"  Single-photon avalanche diodes (SPADs) are advanced sensors capable of\ndetecting individual photons and recording their arrival times with picosecond\nresolution using time-correlated Single-Photon Counting detection techniques.\nThey are used in various applications, such as LiDAR, and can capture\nhigh-speed sequences of binary single-photon images, offering great potential\nfor reconstructing 3D environments with high motion dynamics. To complement\nsingle-photon data, they are often paired with conventional passive cameras,\nwhich capture high-resolution (HR) intensity images at a lower frame rate.\nHowever, 3D reconstruction from SPAD data faces challenges. Aggregating\nmultiple binary measurements improves precision and reduces noise but can cause\nmotion blur in dynamic scenes. Additionally, SPAD arrays often have lower\nresolution than passive cameras. To address these issues, we propose a novel\ncomputational imaging algorithm to improve the 3D reconstruction of moving\nscenes from SPAD data by addressing the motion blur and increasing the native\nspatial resolution. We adopt a plug-and-play approach within an optimization\nscheme alternating between guided video super-resolution of the 3D scene, and\nprecise image realignment using optical flow. Experiments on synthetic data\nshow significantly improved image resolutions across various signal-to-noise\nratios and photon levels. We validate our method using real-world SPAD\nmeasurements on three practical situations with dynamic objects. First on\nfast-moving scenes in laboratory conditions at short range; second very low\nresolution imaging of people with a consumer-grade SPAD sensor from\nSTMicroelectronics; and finally, HR imaging of people walking outdoors in\ndaylight at a range of 325 meters under eye-safe illumination conditions using\na short-wave infrared SPAD camera. These results demonstrate the robustness and\nversatility of our approach.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"I7ebbqAZGwaQCjdpOpPLXjD2ih5CbdRUl9Jc5CJxT3A","pdfSize":"4753875"}