{"id":"2412.13077","title":"What do we know about cosmic rays with energies above 5 EeV?","authors":"Jonathan Biteau (for the Pierre Auger Collaboration)","authorsParsed":[["Biteau","Jonathan","","for the Pierre Auger Collaboration"]],"versions":[{"version":"v1","created":"Tue, 17 Dec 2024 16:49:00 GMT"}],"updateDate":"2024-12-18","timestamp":1734454140000,"abstract":"  Cosmic rays begin to reveal their secrets at energies above 5 EeV. Beyond\nthis characteristic energy, known as the spectral \"ankle\", the\narrival-direction data from the Pierre Auger Observatory show anisotropy on\nlarge angular scales of increasing amplitude with energy. This discovery\nprovides observational evidence that cosmic rays beyond the ankle originate\noutside the Milky Way, as expected from the weak Galactic confinement and the\nhigh luminosity required for the sources. Synthetic models of extragalactic\nsource populations emitting fully ionized atoms have allowed us to reproduce\nthe cosmic-ray flux beyond the ankle for almost a decade. These models capture\nthe various slope breaks in the spectrum at ultra-high energies, including the\nflux suppression at ${\\sim}\\,$45 EeV and the recently measured feature at\n${\\sim}\\,$15 EeV, known as the spectral \"instep\". Such slope breaks are\nunderstood as changes in nuclear composition, with the average atomic mass\nincreasing with energy. The population of astrophysical sources responsible for\naccelerating these nuclei remains unidentified, although serious contenders\nhave been identified. Particularly instructive are the latest searches at the\nhighest energies for anisotropies correlated with the flux patterns expected\nfrom galaxies outside the Local Group, which are approaching $5\\,\\sigma$.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"Dr4qLG3XFLNHbVeHxr2DuWmGFUvZfX3pweckc5Y16P8","pdfSize":"2483776"}