{"id":"2412.11647","title":"Q-DISCO: Query-Centric Densest Subgraphs in Networks with Opinion\n  Information","authors":"Tianyi Chen, Atsushi Miyauchi, Charalampos E. Tsourakakis","authorsParsed":[["Chen","Tianyi",""],["Miyauchi","Atsushi",""],["Tsourakakis","Charalampos E.",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 10:49:33 GMT"}],"updateDate":"2024-12-17","timestamp":1734346173000,"abstract":"  Given a network $G=(V,E)$, where each node $v$ is associated with a vector\n$\\boldsymbol{p}_v \\in \\mathbb{R}^d$ representing its opinion about $d$\ndifferent topics, how can we uncover subsets of nodes that not only exhibit\nexceptionally high density but also possess positively aligned opinions on\nmultiple topics? In this paper we focus on this novel algorithmic question,\nthat is essential in an era where digital social networks are hotbeds of\nopinion formation and dissemination. We introduce a novel methodology anchored\nin the well-established densest subgraph problem. We analyze the computational\ncomplexity of our formulation, indicating that our problem is NP-hard and\neludes practically acceptable approximation guarantees. To navigate these\nchallenges, we design two heuristic algorithms: the first is predicated on the\nLagrangian relaxation of our formulation, while the second adopts a peeling\nalgorithm based on the dual of a Linear Programming relaxation. We elucidate\nthe theoretical underpinnings of their performance and validate their utility\nthrough empirical evaluation on real-world datasets. Among others, we delve\ninto Twitter datasets we collected concerning timely issues, such as the\nUkraine conflict and the discourse surrounding COVID-19 mRNA vaccines, to gauge\nthe effectiveness of our methodology. Our empirical investigations verify that\nour algorithms are able to extract valuable insights from networks with opinion\ninformation.\n","subjects":["Computer Science/Social and Information Networks","Physics/Physics and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Zupv7ubQH93bYdGFaSbYYD5CHMl_tqVJE3LuFDLq0L4","pdfSize":"1577751"}