{"id":"2412.01362","title":"Accurate transient heat flux from simple treatment of surface\n  temperature distribution in the semi-infinite case","authors":"David Buttsworth and Timothy Buttsworth","authorsParsed":[["Buttsworth","David",""],["Buttsworth","Timothy",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 10:44:46 GMT"}],"updateDate":"2024-12-03","timestamp":1733136286000,"abstract":"  When the variations of surface temperature are measured both spatially and\ntemporally, analytical expressions that correctly account for multi-dimensional\ntransient conduction can be applied. To enhance the accessibility of these\naccurate multi-dimensional methods, expressions for converting between surface\ntemperature and heat flux are presented as the sum of the one-dimensional\ncomponent plus the multi-dimensional component. Advantage arises herein because\npotential numerical challenges are isolated within the one-dimensional\ncomponent and practitioners are already familiar with well-established\none-dimensional methods. The second derivative of the surface heat flux\ndistribution scaled by the thermal diffusivity and the duration of the\nexperiment delivers an approximation of the multi-dimensional conduction term.\nFor the analysis of experiments in which multi-dimensional effects are\nsignificant, a simplified numerical approach in which the temperature within\neach pixel is treated as uniform is demonstrated. The approach involves\nconvolution of temperature differences and pixel-based impulse response\nfunctions, followed by a summation of results across the region of interest,\nbut there are no singularities that require special treatment in the\nmulti-dimensional component. Recovery of heat flux distributions to within 1%\nis demonstrated for two-dimensional heat flux distributions discretized using\nseveral tens of elements, and for a three-dimensional distribution discretized\nusing several hundred pixels. Higher accuracy can be achieved by using finer\nspatial resolution, but the level of discretization used herein is likely\nsufficient for practical applications since typical experimental uncertainties\nare much larger than 1%.\n","subjects":["Physics/Instrumentation and Detectors"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"327e5iCeNhnQ29OnxdggT0H29BYrxMETkaYLucALlGM","pdfSize":"2818044"}