{"id":"2412.20755","title":"Ultra-Wideband Double-Directional Channel Measurements and Statistical\n  Modeling in Urban Microcellular Environments for the Upper-Midband/FR3","authors":"Naveed A. Abbasi, Kelvin Arana, Siddhant Singh, Atulya Bist, Vikram\n  Vasudevan, Tathagat Pal, Jorge Gomez-Ponce, Young-Han Nam, Charlie Zhang, and\n  Andreas F. Molisch","authorsParsed":[["Abbasi","Naveed A.",""],["Arana","Kelvin",""],["Singh","Siddhant",""],["Bist","Atulya",""],["Vasudevan","Vikram",""],["Pal","Tathagat",""],["Gomez-Ponce","Jorge",""],["Nam","Young-Han",""],["Zhang","Charlie",""],["Molisch","Andreas F.",""]],"versions":[{"version":"v1","created":"Mon, 30 Dec 2024 06:57:12 GMT"},{"version":"v2","created":"Tue, 31 Dec 2024 03:59:01 GMT"}],"updateDate":"2025-01-03","timestamp":1735541832000,"abstract":"  The upper midband, designated as Frequency Range 3 (FR3), is increasingly\ncritical for the next-generation of wireless networks. Channel propagation\nmeasurements and their statistical analysis are essential first steps towards\nthis direction. This paper presents a comprehensive ultra-wideband (UWB)\ndouble-directional channel measurement campaign in a large portion of FR3 (6-14\nGHz) for urban microcellular environments. We analyze over 25,000 directional\npower delay profiles and providing key insights into line-of-sight (LoS) and\nobstructed line-of-sight (OLoS) conditions. This is followed by statistical\nmodeling of path loss, shadowing, delay spread and angular spread. As the first\nUWB double-directional measurement campaign in this frequency range, this work\noffers critical insights for spectrum allocation, channel modeling, and the\ndesign of advanced communication systems, paving the way for further\nexploration of FR3.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computer Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"tSg8csrov5gFTC70QpRBBuqkuH8rBNqUe6CD3FFzolE","pdfSize":"1238067"}