{"id":"2412.13700","title":"On the construction of explicit analytical driving forces for crack\n  nucleation in the phase field approach to brittle fracture with application\n  to Mohr-Coulomb and Drucker-Prager strength surfaces","authors":"Chockalingam Senthilnathan","authorsParsed":[["Senthilnathan","Chockalingam",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 10:44:07 GMT"},{"version":"v2","created":"Tue, 31 Dec 2024 16:09:50 GMT"}],"updateDate":"2025-01-03","timestamp":1734518647000,"abstract":"  A series of recent papers have modified the classical variational phase-field\nfracture models to successfully predict both the nucleation and propagation of\ncracks in brittle fracture under general loading conditions. This is done\nthrough the introduction of a consistent crack nucleation driving force in the\nphase field governing equations, which results in the model being able to\ncapture both the strength surface and fracture toughness of the material. This\ndriving force has been presented in the literature for the case of\nDrucker-Prager strength surface and specific choice of stress states on the\nstrength surface that are captured exactly for finite values of the phase field\nregularization length parameter $\\varepsilon$. Here we present an explicit\nanalytical expression for this driving force given a general material strength\nsurface when the functional form of the strength locus is linear in the\nmaterial parameter coefficients. In the limit $\\varepsilon \\to 0$, the\nformulation reproduces the exact material strength surface and for finite\n$\\varepsilon$ the strength surface is captured at any n 'distinct' points on\nthe strength surface where n is the minimum number of material coefficients\nrequired to describe it. The presentation of the driving force in the current\nwork facilitates the easy demonstration of its consistent nature. Further, in\nthe equation governing crack nucleation, the toughness in the classical models\nis shown to be replaced by an effective toughness in the modified theory, that\nis dependent on the stress. The derived analytical expressions are verified via\napplication to the widely employed Mohr-Coulomb and Drucker-Prager strength\nsurfaces.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Other Condensed Matter"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"GZ8_ei4O28SSvHfWW6ezHHDc_uUFEtsDr8bOF4aaXw8","pdfSize":"378775"}