{"id":"2412.05655","title":"Shifting NER into High Gear: The Auto-AdvER Approach","authors":"Filippos Ventirozos, Ioanna Nteka, Tania Nandy, Jozef Baca, Peter\n  Appleby and Matthew Shardlow","authorsParsed":[["Ventirozos","Filippos",""],["Nteka","Ioanna",""],["Nandy","Tania",""],["Baca","Jozef",""],["Appleby","Peter",""],["Shardlow","Matthew",""]],"versions":[{"version":"v1","created":"Sat, 7 Dec 2024 14:00:06 GMT"}],"updateDate":"2024-12-10","timestamp":1733580006000,"abstract":"  This paper presents a case study on the development of Auto-AdvER, a\nspecialised named entity recognition schema and dataset for text in the car\nadvertisement genre. Developed with industry needs in mind, Auto-AdvER is\ndesigned to enhance text mining analytics in this domain and contributes a\nlinguistically unique NER dataset. We present a schema consisting of three\nlabels: \"Condition\", \"Historic\" and \"Sales Options\". We outline the guiding\nprinciples for annotation, describe the methodology for schema development, and\nshow the results of an annotation study demonstrating inter-annotator agreement\nof 92% F1-Score. Furthermore, we compare the performance by using encoder-only\nmodels: BERT, DeBERTaV3 and decoder-only open and closed source Large Language\nModels (LLMs): Llama, Qwen, GPT-4 and Gemini. Our results show that the class\nof LLMs outperforms the smaller encoder-only models. However, the LLMs are\ncostly and far from perfect for this task. We present this work as a stepping\nstone toward more fine-grained analysis and discuss Auto-AdvER's potential\nimpact on advertisement analytics and customer insights, including applications\nsuch as the analysis of market dynamics and data-driven predictive maintenance.\nOur schema, as well as our associated findings, are suitable for both private\nand public entities considering named entity recognition in the automotive\ndomain, or other specialist domains.\n","subjects":["Computer Science/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"mjUcMKI24Gd3UDRatR-4keKor-Y_AqZjnu5bvwtbDAw","pdfSize":"675861"}