{
  "id": "2412.07679",
  "title": "RADIOv2.5: Improved Baselines for Agglomerative Vision Foundation Models",
  "authors": "Greg Heinrich, Mike Ranzinger, Hongxu (Danny) Yin, Yao Lu, Jan Kautz,\n  Andrew Tao, Bryan Catanzaro, Pavlo Molchanov",
  "authorsParsed": [
    [
      "Heinrich",
      "Greg",
      "",
      "Danny"
    ],
    [
      "Ranzinger",
      "Mike",
      "",
      "Danny"
    ],
    [
      "Hongxu",
      "",
      "",
      "Danny"
    ],
    [
      "Yin",
      "",
      ""
    ],
    [
      "Lu",
      "Yao",
      ""
    ],
    [
      "Kautz",
      "Jan",
      ""
    ],
    [
      "Tao",
      "Andrew",
      ""
    ],
    [
      "Catanzaro",
      "Bryan",
      ""
    ],
    [
      "Molchanov",
      "Pavlo",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 17:06:41 GMT"
    },
    {
      "version": "v2",
      "created": "Sun, 9 Feb 2025 15:03:08 GMT"
    }
  ],
  "updateDate": "2025-02-11",
  "timestamp": 1733850401000,
  "abstract": "  Agglomerative models have recently emerged as a powerful approach to training\nvision foundation models, leveraging multi-teacher distillation from existing\nmodels such as CLIP, DINO, and SAM. This strategy enables the efficient\ncreation of robust models, combining the strengths of individual teachers while\nsignificantly reducing computational and resource demands. In this paper, we\nthoroughly analyze state-of-the-art agglomerative models, identifying critical\nchallenges including resolution mode shifts, teacher imbalance, idiosyncratic\nteacher artifacts, and an excessive number of output tokens. To address these\nissues, we propose several novel solutions: multi-resolution training, mosaic\naugmentation, and improved balancing of teacher loss functions. Specifically,\nin the context of Vision Language Models, we introduce a token compression\ntechnique to maintain high-resolution information within a fixed token count.\nWe release our top-performing variants at multiple scales (-B, -L, -H, and -g),\nalong with inference code and pretrained weights\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "XxZnvB7D3EmPkiN81OUOyWDOCU0TiHImNxWkjAO5UIw",
  "pdfSize": "11068096"
}