{"id":"2412.18506","title":"Study of the physical and chemical properties of dense clumps at\n  different evolutionary stages in several regions of massive star and stellar\n  cluster formation","authors":"A. G. Pazukhin, I. I. Zinchenko, E. A. Trofimova","authorsParsed":[["Pazukhin","A. G.",""],["Zinchenko","I. I.",""],["Trofimova","E. A.",""]],"versions":[{"version":"v1","created":"Tue, 24 Dec 2024 15:46:58 GMT"},{"version":"v2","created":"Thu, 26 Dec 2024 10:13:49 GMT"}],"updateDate":"2024-12-30","timestamp":1735055218000,"abstract":"  Massive stars play an important role in the Universe. Unlike low-mass stars,\nthe formation of these objects located at great distances is still unclear. It\nis expected to be governed by some combination of self-gravity, turbulence, and\nmagnetic fields. In this work, we aim to study the chemical and physical\nconditions of dense clumps at different evolutionary stages. We performed\nobservations towards 5 regions of massive star and stellar cluster formation\n(L1287, S187, S231, DR 21(OH), NGC 7538) with the IRAM-30m telescope. We\ncovered the 2 and 3$-$4 mm wavelength bands and analysed the lines of HCN, HNC,\nHCO$^+$, HC$_3$N, HNCO, OCS, CS, SiO, SO$_2$, and SO. Using astrodendro\nalgorithm on the 850 $\\mu$m dust emission data from the SCUBA Legacy catalogue,\nwe determined the masses, H$_2$ column densities, and sizes of the clumps.\nFurthermore, the kinetic temperatures, molecular abundances, and dynamical\nstate were obtained. The Red Midcourse Space Experiment Source survey (RMS) was\nused to determine the clump types. A total of 20 clumps were identified. Three\nclumps were found to be associated with the Hii regions, 10 with young stellar\nobjects (YSOs), and 7 with submillimetre emission. The clumps have typical\nsizes of about 0.2 pc and masses ranging from 1 to $10^{2}\\,M_\\odot$, kinetic\ntemperatures ranging from 20 to 40 K and line widths of $\\rm H^{13}CO^{+}\n(1-0)$ approximately 2 $\\rm km\\,s^{-1}$. We found no significant correlation in\nthe line width$-$size and the line width$-$mass relationships. However, a\nstrong correlation is observed in mass$-$size relationships. The virial\nanalysis indicated that three clumps are gravitationally bound. Furthermore, we\nsuggested that magnetic fields of about 1 mG provide additional support for\nclump stability. The molecular abundances relative to H$_2$ are approximately\n$10^{-10}-10^{-8}$.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"UEjH8Q6x1kyvFXA_t-_PE6Se5C5BZ2qs3J9X0Xytec4","pdfSize":"2380720"}