{
  "id": "2412.08623",
  "title": "A 1% accurate method to include baryonic effects in galaxy-galaxy\n  lensing models",
  "authors": "Matteo Zennaro, Giovanni Aric\\`o, Carlos Garc\\'ia-Garc\\'ia, Ra\\'ul E.\n  Angulo, Lurdes Ondaro-Mallea, Sergio Contreras, Andrina Nicola, Matthieu\n  Schaller, Joop Schaye",
  "authorsParsed": [
    [
      "Zennaro",
      "Matteo",
      ""
    ],
    [
      "Aricò",
      "Giovanni",
      ""
    ],
    [
      "García-García",
      "Carlos",
      ""
    ],
    [
      "Angulo",
      "Raúl E.",
      ""
    ],
    [
      "Ondaro-Mallea",
      "Lurdes",
      ""
    ],
    [
      "Contreras",
      "Sergio",
      ""
    ],
    [
      "Nicola",
      "Andrina",
      ""
    ],
    [
      "Schaller",
      "Matthieu",
      ""
    ],
    [
      "Schaye",
      "Joop",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 18:44:02 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733942642000,
  "abstract": "  Galaxy clustering and galaxy-galaxy lensing are two of the main observational\nprobes in Stage-IV large-scale structure surveys. Unfortunately, the\ncomplicated relationship between galaxies and matter limits the exploitation of\nthis data. Galaxy bias models -- such as the hybrid Lagrangian bias expansion\n-- allow describing galaxy clustering down to scales as small as $k =\n0.7h$/Mpc. However, the galaxy-matter cross-power spectra are already affected\nby baryons on these scales, directly impacting the modelling of galaxy-galaxy\nlensing. We propose to extend models of the galaxy-matter cross-power spectrum\n$P_{\\rm gm}(k)$ (currently only accounting for dark matter) by including a\nbaryonic correction inferred from the matter component ($S_{\\rm mm}(k)$), so\nthat $P_{\\rm gm, full \\, physics} (k) = \\sqrt{S_{\\rm mm}} P_{\\rm gm, gravity \\,\nonly}$. We use the FLAMINGO simulations to measure the effect of baryons on the\ngalaxy-matter cross-power spectrum and to assess the performance of our model.\nWe perform a Bayesian analysis of synthetic data, implementing a model based on\nBACCO's hybrid Lagrangian bias expansion (for the nonlinear galaxy bias) and\nBaryon Correction Model. Ignoring baryons in the galaxy-matter cross-power\nspectrum leads to a biased inference of the galaxy bias, while ignoring baryons\nin both the galaxy-matter and matter-matter power spectra leads to a biased\ninference of both the galaxy bias and cosmological parameters. In contrast, our\nmethod is 1% accurate compared to all physics variations in FLAMINGO and on all\nscales described by hybrid perturbative models ($k < 0.7h$/Mpc). Moreover, our\nmodel leads to inferred bias and cosmological parameters compatible within\n1$\\sigma$ with their reference values. We anticipate that our method will be a\npromising candidate for analysing forthcoming Stage-IV survey data.\n",
  "subjects": [
    "Astrophysics/Cosmology and Nongalactic Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "YztPYn9gSrR6xh09CwtWApVHZl7KZTdBrw0SNsTip5Y",
  "pdfSize": "2514811"
}