{"id":"2412.18588","title":"A Paragraph is All It Takes: Rich Robot Behaviors from Interacting,\n  Trusted LLMs","authors":"OpenMind, Shaohong Zhong, Adam Zhou, Boyuan Chen, Homin Luo, Jan\n  Liphardt","authorsParsed":[["OpenMind","",""],["Zhong","Shaohong",""],["Zhou","Adam",""],["Chen","Boyuan",""],["Luo","Homin",""],["Liphardt","Jan",""]],"versions":[{"version":"v1","created":"Tue, 24 Dec 2024 18:41:15 GMT"}],"updateDate":"2024-12-25","timestamp":1735065675000,"abstract":"  Large Language Models (LLMs) are compact representations of all public\nknowledge of our physical environment and animal and human behaviors. The\napplication of LLMs to robotics may offer a path to highly capable robots that\nperform well across most human tasks with limited or even zero tuning. Aside\nfrom increasingly sophisticated reasoning and task planning, networks of\n(suitably designed) LLMs offer ease of upgrading capabilities and allow humans\nto directly observe the robot's thinking. Here we explore the advantages,\nlimitations, and particularities of using LLMs to control physical robots. The\nbasic system consists of four LLMs communicating via a human language data bus\nimplemented via web sockets and ROS2 message passing. Surprisingly, rich robot\nbehaviors and good performance across different tasks could be achieved despite\nthe robot's data fusion cycle running at only 1Hz and the central data bus\nrunning at the extremely limited rates of the human brain, of around 40 bits/s.\nThe use of natural language for inter-LLM communication allowed the robot's\nreasoning and decision making to be directly observed by humans and made it\ntrivial to bias the system's behavior with sets of rules written in plain\nEnglish. These rules were immutably written into Ethereum, a global, public,\nand censorship resistant Turing-complete computer. We suggest that by using\nnatural language as the data bus among interacting AIs, and immutable public\nledgers to store behavior constraints, it is possible to build robots that\ncombine unexpectedly rich performance, upgradability, and durable alignment\nwith humans.\n","subjects":["Computer Science/Robotics","Computer Science/Artificial Intelligence","Computer Science/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"pDEMttzpy6BMYoDyoOuUzoXB0UXt_24xYdx8i62md2k","pdfSize":"317616"}