{
  "id": "2412.05258",
  "title": "Using the helium triplet as a tracer of the physics of giant planet\n  outflows",
  "authors": "Matth\\\"aus Schulik and James Owen",
  "authorsParsed": [
    [
      "Schulik",
      "Matthäus",
      ""
    ],
    [
      "Owen",
      "James",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 18:49:02 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733510942000,
  "abstract": "  Hydrodynamic outflows, such as those observed escaping close-in gas giant\nplanets, are not isothermal in structure. Their highly ionized nature allows\nthem to cool adiabatically at distances beyond several planetary radii. The\ncontrast between the hottest gas temperatures at around 10,000K and the coldest\nat around 1,000K triggers an excess population of the observable helium\ntriplet. This excess is caused by the suppression of collisional de-excitation\nfrom the triplet state at cool temperatures. Using radiation-hydrodynamic\nsimulations, we show that this helium triplet excess may explain the excess\nbroadening seen in HD 189733b's observed transmission spectrum, demonstrating\nadiabatic cooling of its outflow, confirming its hydrodynamic nature on scales\nof several planetary radii. However, further observations are required to\nconfirm this conclusion. Furthermore, we explore a range of electron\ntransitions for neutral helium which were not considered in the previous\nliterature. We find that the He$2^1$S state is unavailable as a potential\nreservoir for He$2^3$S electrons. Additionally, the de-excitation to the ground\nstate must be considered for stellar spectra later than K2 in predicting the\ncorrect helium triplet population. Importantly, since triplet helium inherits\nmomentum from ionized helium as it is generated by recombination, it is\nsignificantly less prone to fractionation than ground-state neutral helium.\nHowever at separations of $\\gtrsim 0.05$~au, ionization at the flow base and\ndrag on helium weaken, leading to significant fractionation of the then mostly\nneutral helium. This in turn, can cause a suppression of the Helium transit\ndepth, even though the helium line width remains large.\n",
  "subjects": [
    "Astrophysics/Earth and Planetary Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "l8atRwEiv9u5Lhbkv6XSA1IC-Hv3wK_mF06RkD1LKp4",
  "pdfSize": "1780025"
}