{
  "id": "2412.20509",
  "title": "Stochastic gradient descent estimation of generalized matrix\n  factorization models with application to single-cell RNA sequencing data",
  "authors": "Cristian Castiglione, Alexandre Segers, Lieven Clement, Davide Risso",
  "authorsParsed": [
    [
      "Castiglione",
      "Cristian",
      ""
    ],
    [
      "Segers",
      "Alexandre",
      ""
    ],
    [
      "Clement",
      "Lieven",
      ""
    ],
    [
      "Risso",
      "Davide",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 29 Dec 2024 16:02:15 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735488135000,
  "abstract": "  Single-cell RNA sequencing allows the quantitation of gene expression at the\nindividual cell level, enabling the study of cellular heterogeneity and gene\nexpression dynamics. Dimensionality reduction is a common preprocessing step to\nsimplify the visualization, clustering, and phenotypic characterization of\nsamples. This step, often performed using principal component analysis or\nclosely related methods, is challenging because of the size and complexity of\nthe data. In this work, we present a generalized matrix factorization model\nassuming a general exponential dispersion family distribution and we show that\nmany of the proposed approaches in the single-cell dimensionality reduction\nliterature can be seen as special cases of this model. Furthermore, we propose\na scalable adaptive stochastic gradient descent algorithm that allows us to\nestimate the model efficiently, enabling the analysis of millions of cells. Our\ncontribution extends to introducing a novel warm start initialization method,\ndesigned to accelerate algorithm convergence and increase the precision of\nfinal estimates. Moreover, we discuss strategies for dealing with missing\nvalues and model selection. We benchmark the proposed algorithm through\nextensive numerical experiments against state-of-the-art methods and showcase\nits use in real-world biological applications. The proposed method\nsystematically outperforms existing methods of both generalized and\nnon-negative matrix factorization, demonstrating faster execution times while\nmaintaining, or even enhancing, matrix reconstruction fidelity and accuracy in\nbiological signal extraction. Finally, all the methods discussed here are\nimplemented in an efficient open-source R package, sgdGMF, available at\ngithub/CristianCastiglione/sgdGMF\n",
  "subjects": [
    "Statistics/Computation",
    "Statistics/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "dvKQhG56FugvnPqRy3HeN_FdQ6NZ_VrhYt-JRlwdkrE",
  "pdfSize": "16961106"
}