{
  "id": "2412.04544",
  "title": "Spin dynamics of an easy-plane Dirac spin liquid in a frustrated XY\n  model: Application to honeycomb cobaltates",
  "authors": "Anjishnu Bose, Arun Paramekanti",
  "authorsParsed": [
    [
      "Bose",
      "Anjishnu",
      ""
    ],
    [
      "Paramekanti",
      "Arun",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 19:00:01 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733425201000,
  "abstract": "  Recent work has shown that the honeycomb lattice spin-$1/2$ $J_1$-$J_3$ XY\nmodel, with nearest-neighbor ferromagnetic exchange $J_1$ and frustration\ninduced by third-neighbor antiferromagnetic exchange $J_3$, may be relevant to\na wide range of cobaltate materials. We explore a variational Monte Carlo study\nof Gutzwiller projected wavefunctions for this model and show that an\neasy-plane Dirac spin liquid (DSL) is a viable `parent' state for the competing\nmagnetic orders observed in these materials, including ferromagnetic, zig-zag,\nspiral, and double zig-zag orders at intermediate frustration, and show that\nsuch broken symmetry states can be easily polarized by a weak in-plane magnetic\nfield consistent with experiments. We formulate a modified parton theory for\nsuch frustrated spin models, and explore the potential instabilities of the DSL\ndue to residual parton interactions within a random phase approximation (RPA),\nboth at zero magnetic field and in a nonzero in-plane field. The broken\nsymmetry states which emerge in the vicinity of this Dirac spin liquid include\nferromagnetic, zig-zag, and incommensurate spiral orders, with a phase diagram\nwhich is consistent with VMC and density matrix renormalization group studies.\nWe calculate the dynamical spin response of the easy-plane DSL, including RPA\ncorrections, near the boundary of the ordered states, and present results for\nTHz spectroscopy and inelastic neutron scattering, at zero field as well as in\nan in-plane magnetic field, and discuss experimental implications.\n",
  "subjects": [
    "Condensed Matter/Strongly Correlated Electrons"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "mupDxgz6owGguzRjJmrVsC8oMxj0Ovly3EUKsmes57M",
  "pdfSize": "1991187"
}