{
  "id": "2412.02695",
  "title": "An ADHD Diagnostic Interface Based on EEG Spectrograms and Deep Learning\n  Techniques",
  "authors": "Medha Pappula, Syed Muhammad Anwar",
  "authorsParsed": [
    [
      "Pappula",
      "Medha",
      ""
    ],
    [
      "Anwar",
      "Syed Muhammad",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 18:59:35 GMT"
    }
  ],
  "updateDate": "2024-12-04",
  "timestamp": 1733252375000,
  "abstract": "  This paper introduces an innovative approach to\nAttention-deficit/hyperactivity disorder (ADHD) diagnosis by employing deep\nlearning (DL) techniques on electroencephalography (EEG) signals. This method\naddresses the limitations of current behavior-based diagnostic methods, which\noften lead to misdiagnosis and gender bias. By utilizing a publicly available\nEEG dataset and converting the signals into spectrograms, a Resnet-18\nconvolutional neural network (CNN) architecture was used to extract features\nfor ADHD classification. The model achieved a high precision, recall, and an\noverall F1 score of 0.9. Feature extraction highlighted significant brain\nregions (frontopolar, parietal, and occipital lobes) associated with ADHD.\nThese insights guided the creation of a three-part digital diagnostic system,\nfacilitating cost-effective and accessible ADHD screening, especially in school\nenvironments. This system enables earlier and more accurate identification of\nstudents at risk for ADHD, providing timely support to enhance their\ndevelopmental outcomes. This study showcases the potential of integrating EEG\nanalysis with DL to enhance ADHD diagnostics, presenting a viable alternative\nto traditional methods.\n",
  "subjects": [
    "Computer Science/Computers and Society",
    "Computer Science/Machine Learning",
    "Electrical Engineering and Systems Science/Signal Processing"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "_lQVcXpTWf9WmlJ2gPt_WCYyxU_Bc_OkS_kS45uzW6I",
  "pdfSize": "1497595"
}