{"id":"2412.13352","title":"Key Exchange in the Quantum Era: Evaluating a Hybrid System of\n  Public-Key Cryptography and Physical-Layer Security","authors":"Paul Staat, Meik D\\\"orpinghaus, Azadeh Sheikholeslami, Christof Paar,\n  Gerhard Fettweis, Dennis Goeckel","authorsParsed":[["Staat","Paul",""],["Dörpinghaus","Meik",""],["Sheikholeslami","Azadeh",""],["Paar","Christof",""],["Fettweis","Gerhard",""],["Goeckel","Dennis",""]],"versions":[{"version":"v1","created":"Tue, 17 Dec 2024 21:56:04 GMT"}],"updateDate":"2024-12-19","timestamp":1734472564000,"abstract":"  Today's information society relies on cryptography to achieve security goals\nsuch as confidentiality, integrity, authentication, and non-repudiation for\ndigital communications. Here, public-key cryptosystems play a pivotal role to\nshare encryption keys and create digital signatures. However, quantum computers\nthreaten the security of traditional public-key cryptosystems as they can tame\ncomputational problems underlying the schemes, i.e., discrete logarithm and\ninteger factorization. The prospective arrival of capable-enough quantum\ncomputers already threatens today's secret communication in terms of their\nlong-term secrecy when stored to be later decrypted. Therefore, researchers\nstrive to develop and deploy alternative schemes.\n  In this work, evaluate a key exchange protocol based on combining public-key\nschemes with physical-layer security, anticipating the prospect of quantum\nattacks. If powerful quantum attackers cannot immediately obtain private keys,\nlegitimate parties have a window of short-term secrecy to perform a\nphysical-layer jamming key exchange (JKE) to establish a long-term shared\nsecret. Thereby, the protocol constraints the computation time available to the\nattacker to break the employed public-key cryptography. In this paper, we\noutline the protocol, discuss its security, and point out challenges to be\nresolved.\n","subjects":["Computer Science/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"20_FrcEROUheHd01KLzpPgJ1MGtcGxR8ndo8Ya6V8ZY","pdfSize":"315459"}