{
  "id": "2412.08599",
  "title": "Der Effizienz- und Intelligenzbegriff in der Lexikographie und\n  kuenstlichen Intelligenz: kann ChatGPT die lexikographische Textsorte\n  nachbilden?",
  "authors": "Ivan Arias-Arias, Maria Jose Dominguez Vazquez, and Carlos Valcarcel\n  Riveiro",
  "authorsParsed": [
    [
      "Arias-Arias",
      "Ivan",
      ""
    ],
    [
      "Vazquez",
      "Maria Jose Dominguez",
      ""
    ],
    [
      "Riveiro",
      "Carlos Valcarcel",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 18:18:07 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733941087000,
  "abstract": "  By means of pilot experiments for the language pair German and Galician, this\npaper examines the concept of efficiency and intelligence in lexicography and\nartificial intelligence, AI. The aim of the experiments is to gain empirically\nand statistically based insights into the lexicographical text type,dictionary\narticle, in the responses of ChatGPT 3.5, as well as into the lexicographical\ndata on which this chatbot was trained. Both quantitative and qualitative\nmethods are used for this purpose. The analysis is based on the evaluation of\nthe outputs of several sessions with the same prompt in ChatGPT 3.5. On the one\nhand, the algorithmic performance of intelligent systems is evaluated in\ncomparison with data from lexicographical works. On the other hand, the ChatGPT\ndata supplied is analysed using specific text passages of the aforementioned\nlexicographical text type. The results of this study not only help to evaluate\nthe efficiency of this chatbot regarding the creation of dictionary articles,\nbut also to delve deeper into the concept of intelligence, the thought\nprocesses and the actions to be carried out in both disciplines.\n",
  "subjects": [
    "Computer Science/Computation and Language"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "W9Klrvr5RwvNwDcQ_G76MSy3HZZ-6_A1DUo_sxZVOdM",
  "pdfSize": "1272629"
}