{
  "id": "2412.19168",
  "title": "GFG -- Gender-Fair Generation: A CALAMITA Challenge",
  "authors": "Simona Frenda, Andrea Piergentili, Beatrice Savoldi, Marco Madeddu,\n  Martina Rosola, Silvia Casola, Chiara Ferrando, Viviana Patti, Matteo Negri,\n  Luisa Bentivogli",
  "authorsParsed": [
    [
      "Frenda",
      "Simona",
      ""
    ],
    [
      "Piergentili",
      "Andrea",
      ""
    ],
    [
      "Savoldi",
      "Beatrice",
      ""
    ],
    [
      "Madeddu",
      "Marco",
      ""
    ],
    [
      "Rosola",
      "Martina",
      ""
    ],
    [
      "Casola",
      "Silvia",
      ""
    ],
    [
      "Ferrando",
      "Chiara",
      ""
    ],
    [
      "Patti",
      "Viviana",
      ""
    ],
    [
      "Negri",
      "Matteo",
      ""
    ],
    [
      "Bentivogli",
      "Luisa",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 26 Dec 2024 10:58:40 GMT"
    },
    {
      "version": "v2",
      "created": "Mon, 30 Dec 2024 10:44:39 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735210720000,
  "abstract": "  Gender-fair language aims at promoting gender equality by using terms and\nexpressions that include all identities and avoid reinforcing gender\nstereotypes. Implementing gender-fair strategies is particularly challenging in\nheavily gender-marked languages, such as Italian. To address this, the\nGender-Fair Generation challenge intends to help shift toward gender-fair\nlanguage in written communication. The challenge, designed to assess and\nmonitor the recognition and generation of gender-fair language in both mono-\nand cross-lingual scenarios, includes three tasks: (1) the detection of\ngendered expressions in Italian sentences, (2) the reformulation of gendered\nexpressions into gender-fair alternatives, and (3) the generation of\ngender-fair language in automatic translation from English to Italian. The\nchallenge relies on three different annotated datasets: the GFL-it corpus,\nwhich contains Italian texts extracted from administrative documents provided\nby the University of Brescia; GeNTE, a bilingual test set for gender-neutral\nrewriting and translation built upon a subset of the Europarl dataset; and\nNeo-GATE, a bilingual test set designed to assess the use of non-binary\nneomorphemes in Italian for both fair formulation and translation tasks.\nFinally, each task is evaluated with specific metrics: average of F1-score\nobtained by means of BERTScore computed on each entry of the datasets for task\n1, an accuracy measured with a gender-neutral classifier, and a\ncoverage-weighted accuracy for tasks 2 and 3.\n",
  "subjects": [
    "Computer Science/Computation and Language"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "udGynXlta9-SjxunFF1gLxSA2JPk8XWXUrfJzE4L_ok",
  "pdfSize": "847112"
}