{"id":"2412.12282","title":"QCD factorization with multihadron fragmentation functions","authors":"T. C. Rogers, M. Radici, A. Courtoy, and T. Rainaldi","authorsParsed":[["Rogers","T. C.",""],["Radici","M.",""],["Courtoy","A.",""],["Rainaldi","T.",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 19:00:28 GMT"}],"updateDate":"2024-12-18","timestamp":1734375628000,"abstract":"  Important aspects of QCD factorization theorems are the properties of the\nobjects involved that can be identified as universal. One example is that the\ndefinitions of parton densities and fragmentation functions for different types\nof hadrons differ only in the identity of the nonperturbative states that form\nthe matrix elements, but are otherwise the same. This leads to independence of\nperturbative calculations on nonperturbative details of external states. It\nalso lends support to interpretations of correlation functions as\nencapsulations of intrinsic nonperturbative properties. These characteristics\nhave usually been presumed to still hold true in fragmentation functions even\nwhen the observed nonperturbative state is a small-mass cluster of $n$ hadrons\nrather than simply a single isolated hadron. However, the multidifferential\naspect of cross sections that rely on these latter types of fragmentation\nfunctions complicates the treatment of kinematical approximations in\nfactorization derivations. That has led to recent claims that the operator\ndefinitions for fragmentation functions need to be modified from the single\nhadron case with nonuniversal prefactors. With such concerns as our motivation,\nwe retrace the steps for factorizing the unpolarized semi-inclusive $e^+e^-$\nannihilation cross section and confirm that they do apply without modification\nto the case of a small-mass multihadron observed in the final state. In\nparticular, we verify that the standard operator definition from single hadron\nfragmentation, with its usual prefactor, remains equally valid for the\nsmall-mass $n$-hadron case with the same hard parts and evolution kernels,\nwhereas the more recently proposed definitions with nonuniversal prefactors do\nnot. Our results reaffirm the reliability of most past phenomenological\napplications of dihadron fragmentation functions.\n","subjects":["Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Experiment","Physics/Nuclear Experiment","Physics/Nuclear Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"dNXKEJGCz2mOwLZOX0dGrI8TW92BAjvWx5lLJn6furA","pdfSize":"2042106"}