{"id":"2412.06146","title":"Homogeneous Dynamics Space for Heterogeneous Humans","authors":"Xinpeng Liu, Junxuan Liang, Chenshuo Zhang, Zixuan Cai, Cewu Lu,\n  Yong-Lu Li","authorsParsed":[["Liu","Xinpeng",""],["Liang","Junxuan",""],["Zhang","Chenshuo",""],["Cai","Zixuan",""],["Lu","Cewu",""],["Li","Yong-Lu",""]],"versions":[{"version":"v1","created":"Mon, 9 Dec 2024 01:59:40 GMT"}],"updateDate":"2024-12-10","timestamp":1733709580000,"abstract":"  Analyses of human motion kinematics have achieved tremendous advances.\nHowever, the production mechanism, known as human dynamics, is still\nundercovered. In this paper, we aim to push data-driven human dynamics\nunderstanding forward. We identify a major obstacle to this as the\nheterogeneity of existing human motion understanding efforts. Specifically,\nheterogeneity exists in not only the diverse kinematics representations and\nhierarchical dynamics representations but also in the data from different\ndomains, namely biomechanics and reinforcement learning. With an in-depth\nanalysis of the existing heterogeneity, we propose to emphasize the beneath\nhomogeneity: all of them represent the homogeneous fact of human motion, though\nfrom different perspectives. Given this, we propose Homogeneous Dynamics Space\n(HDyS) as a fundamental space for human dynamics by aggregating heterogeneous\ndata and training a homogeneous latent space with inspiration from the\ninverse-forward dynamics procedure. Leveraging the heterogeneous\nrepresentations and datasets, HDyS achieves decent mapping between human\nkinematics and dynamics. We demonstrate the feasibility of HDyS with extensive\nexperiments and applications. The project page is\nhttps://foruck.github.io/HDyS.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Artificial Intelligence","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"2PQbW5P09rgbMNa0BpRHzPKhbc-SltLJr7vxjP6_JCo","pdfSize":"3924446"}