{"id":"2412.21185","title":"Holographic observers for time-band algebras","authors":"Kristan Jensen, Suvrat Raju and Antony J. Speranza","authorsParsed":[["Jensen","Kristan",""],["Raju","Suvrat",""],["Speranza","Antony J.",""]],"versions":[{"version":"v1","created":"Mon, 30 Dec 2024 18:54:09 GMT"},{"version":"v2","created":"Mon, 24 Feb 2025 16:09:24 GMT"}],"updateDate":"2025-02-25","timestamp":1735584849000,"abstract":"  We study the algebra of observables in a time band on the boundary of anti-de\nSitter space in a theory of quantum gravity. Strictly speaking this algebra\ndoes not have a commutant because products of operators within the time band\ngive rise to operators outside the time band. However, we show that in a state\nwhere the bulk contains a macroscopic observer, it is possible to define a\ncoarse-grained version of this algebra with a non-trivial commutant, and a\nresolution limited by the observer's characteristics. This algebra acts on a\nlittle Hilbert space that describes excitations about the observer's state and\ntime-translated versions of this state. Our construction requires a choice of\ndressing that determines how elements of the algebra transform under the\nHamiltonian. At leading order in gravitational perturbation theory, and with a\nspecific choice of dressing, our construction reduces to the modular\ncrossed-product described previously in the literature. We also prove a theorem\nshowing that this is the only crossed product of a type III$_1$ algebra\nresulting in an algebra with a trace. This trace can be used to define entropy\ndifferences between states in the little Hilbert space that are insensitive to\nthe properties of the observer. We discuss some technical challenges in\nextending this construction to higher orders in perturbation theory. Lastly, we\nreview the construction of interior operators in the eternal black hole and\nshow that they can be written as elements of a crossed product algebra.\n","subjects":["Physics/High Energy Physics - Theory","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"f1UBig54uqdFKeXctBkfVMeavVpN-6Ca7RrdyMd4Crc","pdfSize":"812253"}