{"id":"2412.18712","title":"Generalized Entropy Theory Investigation of the Relatively High\n  Segmental Fragility of Many Glass-Forming Polymers","authors":"Xiaolei Xu and Jack F. Douglas and Wen-Sheng Xu","authorsParsed":[["Xu","Xiaolei",""],["Douglas","Jack F.",""],["Xu","Wen-Sheng",""]],"versions":[{"version":"v1","created":"Wed, 25 Dec 2024 00:21:32 GMT"}],"updateDate":"2024-12-30","timestamp":1735086092000,"abstract":"  We utilize the generalized entropy theory (GET) of glass formation to address\none of the most singular and least understood properties of polymer\nglass-forming liquids in comparison to atomic and small molecule liquids -- the\noften relatively high fragility of the polymer dynamics on a segmental scale,\n$m_s$. We first analyze the relation between $m_s$ and the ratio, $S_c^*/\nS_c(T_{\\mathrm{g}})$. We find that an apparently general nonlinear relation\nbetween $m_s$ and $S_c^*/ S_c(T_{\\mathrm{g}})$ holds to a good approximation\nfor a large class of polymer models, $m_s \\approx 7.9 \\exp [0.6S_c^*/\nS_c(T_{\\mathrm{g}})]$. The predicted ranges of $m_s$ and $S_c^*/\nS_c(T_{\\mathrm{g}})$ are consistent with experimental estimates for high\nmolecular-mass polymer, oligomeric, small molecule, and atomic glass-forming\nliquids. In particular, relatively high values of $m_s$ are found for polymers\nhaving complex monomer structures and significant chain stiffness. The\nvariation of $m_s$ with molecular mass, chain stiffness, and intermolecular\ninteraction strength can be traced to the variation of $S_c^*$, which is shown\nto provide a measure of packing frustration defined in terms of the\ndimensionless thermal expansion coefficient and isothermal compressibility. The\noften relatively high fragility and large extent of cooperative motion are\nfound in the GET to derive from the often relatively large packing frustration\nin this class of polymer glass-forming liquids. Finally, we also develop a\ntentative model of the ``dynamical segmental relaxation time'' based on the\nGET, in which the polymers on a coarse-grained scale are modeled as strings of\nstructureless ``beads'', as assumed in the Rouse and reptation models of\npolymer dynamics.\n","subjects":["Condensed Matter/Soft Condensed Matter","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"GK2meM2j8-Oq56Uo3K3Ff_T7hZHJN_S3lZpawYq0rx4","pdfSize":"862287"}