{
  "id": "2412.06863",
  "title": "Wormhole solutions in generalized Rastall gravity",
  "authors": "Naser Sadeghnezhad",
  "authorsParsed": [
    [
      "Sadeghnezhad",
      "Naser",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 08:27:19 GMT"
    },
    {
      "version": "v2",
      "created": "Wed, 18 Dec 2024 21:39:07 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1733732839000,
  "abstract": "  In the present work, we seek for static spherically symmetric solutions\nrepresenting wormhole configurations in generalized Rastall gravity (GRG). In\nthis theory, a varying coupling parameter could act as dark energy (DE) and\nthus, it can be considered as responsible for the current accelerated expansion\nof the universe. We consider an anisotropic energy momentum tensor (EMT) as the\nsupporting source for wormhole structure and further assume that there exists a\nlinear relation between radial and tangential pressures and energy density. We\ntherefore obtain two classes of solutions to the field equations of GRG,\nincluding the solutions with zero and nonzero redshift functions. For these\nsolutions we find that the matter distribution obeys the physical reasonability\nconditions, i.e., the flare-out and the weak (WEC) and null (NEC) energy\nconditions either at the throat and throughout the spacetime. The conditions on\nphysical reasonability of the wormhole solutions put restrictions on model\nparameters. Hence, in the framework of GRG, asymptotically flat wormhole\nconfigurations can be built without the need of exotic matter. Gravitational\nlensing effects of the obtained solutions are also discussed and it is found\nthat the throat of wormhole can effectively act as a photon sphere near which\nthe light deflection angle takes arbitrarily large values.\n",
  "subjects": [
    "Physics/General Relativity and Quantum Cosmology"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Y0_-OZPUIwzGcEAEXiC0ZOlJVmVPzZLmSfMhOMfD-Nw",
  "pdfSize": "554922"
}