{"id":"2412.10143","title":"Flaring together: A preferred angular separation between sympathetic\n  flares on the Sun","authors":"Louis-Simon Guit\\'e, Antoine Strugarek, Paul Charbonneau","authorsParsed":[["Guité","Louis-Simon",""],["Strugarek","Antoine",""],["Charbonneau","Paul",""]],"versions":[{"version":"v1","created":"Fri, 13 Dec 2024 13:54:11 GMT"}],"updateDate":"2025-02-05","timestamp":1734098051000,"abstract":"  Sympathetic solar flares are eruptions that occur nearby in space and time,\ndriven by an apparent interaction between the active regions in which they are\ntriggered. Their statistical existence on the Sun has yet to be firmly\nestablished. The main goal of this paper is to identify a statistical signature\nof sympathetic flares, characterize their properties and determine a potential\nmechanism driving their interaction. We perform a statistical analysis of a\nlarge number of flares observed by the Atmospheric Imaging Assembly (AIA)\nonboard the Solar Dynamics Observatory (SDO), the Reuven Ramaty High Energy\nSolar Spectroscopic Imager (RHESSI) and the Spectrometer Telescope for Imaging\nX-rays (STIX) on Solar Orbiter during solar cycle 24 and 25. We examine the\nspatiotemporal distribution of consecutive flare pairs across solar cycle\nphases and hemispheres, along with the propagation velocity of potential causal\ninteractions and the relationship between flare magnitudes. We observe an\nexcess of hemispheric flares separated by about 30 degrees of longitude and\ntriggered in less than 1.5 hours from each other. This peak in angular\nseparation varies with the solar cycle phase and hemisphere. Moreover, we\nidentify a deficit of transequatorial events separated by 25-30 degrees in\nlatitude and less than 5 degrees in longitude, a phenomenon we term\nunsympathetic flares. We provide strong statistical evidence for the existence\nof sympathetic flares on the Sun, demonstrating that their occurrence rate\nreaches approximately 5% across the three instruments used in this study.\nAdditionally, we propose an interpretation of the observed angular scale of the\nsympathetic phenomenon, based on the separation between magnetic field line\nfootpoints derived from potential field source surface extrapolations.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Physics/Space Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"vHW55EDmJbO7PeTqjnSMNuq_C_-CfwVtuTcQMZ_TRUM","pdfSize":"2345247"}