{
  "id": "2412.14666",
  "title": "Galaxy-Point Spread Function correlations as a probe of weak-lensing\n  systematics with UNIONS data",
  "authors": "Sacha Guerrini, Martin Kilbinger, Hubert Leterme, Axel Guinot, Jingwei\n  Wang, Fabian Hervas Peters, Hendrik Hildebrandt, Michael J. Hudson, and Alan\n  McConnachie",
  "authorsParsed": [
    [
      "Guerrini",
      "Sacha",
      ""
    ],
    [
      "Kilbinger",
      "Martin",
      ""
    ],
    [
      "Leterme",
      "Hubert",
      ""
    ],
    [
      "Guinot",
      "Axel",
      ""
    ],
    [
      "Wang",
      "Jingwei",
      ""
    ],
    [
      "Peters",
      "Fabian Hervas",
      ""
    ],
    [
      "Hildebrandt",
      "Hendrik",
      ""
    ],
    [
      "Hudson",
      "Michael J.",
      ""
    ],
    [
      "McConnachie",
      "Alan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 09:16:27 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734599787000,
  "abstract": "  Weak gravitational lensing requires precise measurements of galaxy shapes and\ntherefore an accurate knowledge of the PSF model. The latter can be a source of\nsystematics that affect the shear two-point correlation function. A key stake\nof weak lensing analysis is to forecast the systematics due to the PSF.\nCorrelation functions of galaxies and the PSF, the so-called $\\rho$- and\n$\\tau$-statistics, are used to evaluate the level of systematics coming from\nthe PSF model and PSF corrections, and contributing to the two-point\ncorrelation function used to perform cosmological inference. Our goal is to\nintroduce a fast and simple method to estimate this level of systematics and\nassess its agreement with state-of-the-art approaches. We introduce a new way\nto estimate the covariance matrix of the $\\tau$-statistics using analytical\nexpressions. The covariance allows us to estimate parameters directly related\nto the level of systematics associated with the PSF and provides us with a tool\nto validate the PSF model used in a weak-lensing analysis. We apply those\nmethods to data from the Ultraviolet Near-Infrared Optical Northern Survey\n(UNIONS). We show that the semi-analytical covariance yields comparable results\nthan using covariances obtained from simulations or jackknife resampling. It\nrequires less computation time and is therefore well suited for rapid\ncomparison of the systematic level obtained from different catalogs. We also\nshow how one can break degeneracies between parameters with a redefinition of\nthe $\\tau$-statistics. The methods developed in this work will be useful tools\nin the analysis of current weak-lensing data but also of Stage IV surveys such\nas Euclid, LSST or Roman. They provide fast and accurate diagnostics on PSF\nsystematics that are crucial to understand in the context of cosmic shear\nstudies.\n",
  "subjects": [
    "Astrophysics/Cosmology and Nongalactic Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "Q_VmcYxUUaC6FmLhgefX4pTpPZitH_4H4jLklyGJRXA",
  "pdfSize": "11757081"
}