{
  "id": "2412.02757",
  "title": "Dark Galactic subhalos and the Gaia snail",
  "authors": "Daniel Gilman, Jo Bovy, Neige Frankel, Andrew Benson",
  "authorsParsed": [
    [
      "Gilman",
      "Daniel",
      ""
    ],
    [
      "Bovy",
      "Jo",
      ""
    ],
    [
      "Frankel",
      "Neige",
      ""
    ],
    [
      "Benson",
      "Andrew",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 19:00:19 GMT"
    },
    {
      "version": "v2",
      "created": "Thu, 19 Dec 2024 17:30:32 GMT"
    },
    {
      "version": "v3",
      "created": "Tue, 28 Jan 2025 20:53:04 GMT"
    }
  ],
  "updateDate": "2025-01-30",
  "timestamp": 1733252419000,
  "abstract": "  Gaia has revealed a clear signal of disequilibrium in the solar neighborhood\nin the form of a spiral (or snail) feature in the vertical phase-space\ndistribution. We investigate the possibility that this structure emerges from\nongoing perturbations by dark $\\left(10^{6} M_{\\odot} - 10^8 M_{\\odot}\\right)$\nGalactic subhalos. We develop a probabilistic model for generating subhalo\norbits based on a semi-analytic model of structure formation, and combine this\nframework with an approximate prescription for calculating the response of the\ndisk to external perturbations. We also develop a phenomenological treatment\nfor the diffusion of phase-space spirals caused by gravitational scattering\nbetween stars and giant molecular clouds, a process that erases the kinematic\nsignatures of old ($t \\gtrsim 0.6$ Gyr) events. Perturbations caused by dark\nsubhalos are, on average, orders of magnitude weaker than those caused by\nluminous satellite galaxies, but the ubiquity of dark halos predicted by cold\ndark matter makes them a more probable source of strong perturbation to the\ndynamics of the solar neighborhood. Dark subhalos alone do not cause enough\ndisturbance to explain the Gaia snail, but they excite fluctuations of $\\sim\n0.1-0.5 \\ \\rm{km} \\ \\rm{s^{-1}}$ in the mean vertical velocity of stars near\nthe Galactic midplane that should persist to the present day. Subhalos also\nproduce correlations between vertical frequency and orbital angle that could be\nmistaken as originating from a single past disturbance. Our results motivate\ninvestigation of the Milky Way's dark satellites by characterizing their\nkinematic signatures in phase-space spirals across the Galaxy.\n",
  "subjects": [
    "Astrophysics/Astrophysics of Galaxies",
    "Astrophysics/Cosmology and Nongalactic Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "ap2EV4yskeTd7VOOgP26NoL20jLILpGxTfP3an5tXEg",
  "pdfSize": "8327634"
}