{
  "id": "2412.11045",
  "title": "Facial Surgery Preview Based on the Orthognathic Treatment Prediction",
  "authors": "Huijun Han, Congyi Zhang, Lifeng Zhu, Pradeep Singh, Richard Tai Chiu\n  Hsung, Yiu Yan Leung, Taku Komura, Wenping Wang and Min Gu",
  "authorsParsed": [
    [
      "Han",
      "Huijun",
      ""
    ],
    [
      "Zhang",
      "Congyi",
      ""
    ],
    [
      "Zhu",
      "Lifeng",
      ""
    ],
    [
      "Singh",
      "Pradeep",
      ""
    ],
    [
      "Hsung",
      "Richard Tai Chiu",
      ""
    ],
    [
      "Leung",
      "Yiu Yan",
      ""
    ],
    [
      "Komura",
      "Taku",
      ""
    ],
    [
      "Wang",
      "Wenping",
      ""
    ],
    [
      "Gu",
      "Min",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 15 Dec 2024 04:06:39 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734235599000,
  "abstract": "  Orthognathic surgery consultation is essential to help patients understand\nthe changes to their facial appearance after surgery. However, current\nvisualization methods are often inefficient and inaccurate due to limited pre-\nand post-treatment data and the complexity of the treatment. To overcome these\nchallenges, this study aims to develop a fully automated pipeline that\ngenerates accurate and efficient 3D previews of postsurgical facial appearances\nfor patients with orthognathic treatment without requiring additional medical\nimages. The study introduces novel aesthetic losses, such as mouth-convexity\nand asymmetry losses, to improve the accuracy of facial surgery prediction.\nAdditionally, it proposes a specialized parametric model for 3D reconstruction\nof the patient, medical-related losses to guide latent code prediction network\noptimization, and a data augmentation scheme to address insufficient data. The\nstudy additionally employs FLAME, a parametric model, to enhance the quality of\nfacial appearance previews by extracting facial latent codes and establishing\ndense correspondences between pre- and post-surgery geometries. Quantitative\ncomparisons showed the algorithm's effectiveness, and qualitative results\nhighlighted accurate facial contour and detail predictions. A user study\nconfirmed that doctors and the public could not distinguish between machine\nlearning predictions and actual postoperative results. This study aims to offer\na practical, effective solution for orthognathic surgery consultations,\nbenefiting doctors and patients.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Human-Computer Interaction"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "iNWr2Vuy8PRiJCU4DrxlBKmCumUeoph4NrLW9u5BlLE",
  "pdfSize": "14765218"
}