{
  "id": "2412.13422",
  "title": "Generating Diverse Hypotheses for Inductive Reasoning",
  "authors": "Kang-il Lee, Hyukhun Koh, Dongryeol Lee, Seunghyun Yoon, Minsung Kim,\n  Kyomin Jung",
  "authorsParsed": [
    [
      "Lee",
      "Kang-il",
      ""
    ],
    [
      "Koh",
      "Hyukhun",
      ""
    ],
    [
      "Lee",
      "Dongryeol",
      ""
    ],
    [
      "Yoon",
      "Seunghyun",
      ""
    ],
    [
      "Kim",
      "Minsung",
      ""
    ],
    [
      "Jung",
      "Kyomin",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 01:38:09 GMT"
    },
    {
      "version": "v2",
      "created": "Sat, 8 Feb 2025 23:39:32 GMT"
    }
  ],
  "updateDate": "2025-02-11",
  "timestamp": 1734485889000,
  "abstract": "  Inductive reasoning - the process of inferring general rules from a small\nnumber of observations - is a fundamental aspect of human intelligence. Recent\nworks suggest that large language models (LLMs) can engage in inductive\nreasoning by sampling multiple hypotheses about the rules and selecting the one\nthat best explains the observations. However, due to the IID sampling,\nsemantically redundant hypotheses are frequently generated, leading to\nsignificant wastage of compute. In this paper, we 1) demonstrate that\nincreasing the temperature to enhance the diversity is limited due to text\ndegeneration issue, and 2) propose a novel method to improve the diversity\nwhile maintaining text quality. We first analyze the effect of increasing the\ntemperature parameter, which is regarded as the LLM's diversity control, on IID\nhypotheses. Our analysis shows that as temperature rises, diversity and\naccuracy of hypotheses increase up to a certain point, but this trend saturates\ndue to text degeneration. To generate hypotheses that are more semantically\ndiverse and of higher quality, we propose a novel approach inspired by human\ninductive reasoning, which we call Mixture of Concepts (MoC). When applied to\nseveral inductive reasoning benchmarks, MoC demonstrated significant\nperformance improvements compared to standard IID sampling and other\napproaches.\n",
  "subjects": [
    "Computer Science/Artificial Intelligence",
    "Computer Science/Software Engineering"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "BRSQUQ8bFMOi1aIV4zRBnCJg3k8DKFJVX6B_XhILAws",
  "pdfSize": "1744163"
}