{"id":"2412.03907","title":"ONER: Online Experience Replay for Incremental Anomaly Detection","authors":"Yizhou Jin, Jiahui Zhu, Guodong Wang, Shiwei Li, Jinjin Zhang, Qingjie\n  Liu, Xinyue Liu, Yunhong Wang","authorsParsed":[["Jin","Yizhou",""],["Zhu","Jiahui",""],["Wang","Guodong",""],["Li","Shiwei",""],["Zhang","Jinjin",""],["Liu","Qingjie",""],["Liu","Xinyue",""],["Wang","Yunhong",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 06:26:32 GMT"},{"version":"v2","created":"Tue, 14 Jan 2025 09:40:53 GMT"}],"updateDate":"2025-01-15","timestamp":1733379992000,"abstract":"  Incremental anomaly detection sequentially recognizes abnormal regions in\nnovel categories for dynamic industrial scenarios. This remains highly\nchallenging due to knowledge overwriting and feature conflicts, leading to\ncatastrophic forgetting. In this work, we propose ONER, an end-to-end ONline\nExperience Replay method, which efficiently mitigates catastrophic forgetting\nwhile adapting to new tasks with minimal cost. Specifically, our framework\nutilizes two types of experiences from past tasks: decomposed prompts and\nsemantic prototypes, addressing both model parameter updates and feature\noptimization. The decomposed prompts consist of learnable components that\nassemble to produce attention-conditioned prompts. These prompts reuse\npreviously learned knowledge, enabling model to learn novel tasks effectively.\nThe semantic prototypes operate at both pixel and image levels, performing\nregularization in the latent feature space to prevent forgetting across various\ntasks. Extensive experiments demonstrate that our method achieves\nstate-of-the-art performance in incremental anomaly detection with\nsignificantly reduced forgetting, as well as efficiently adapting to new\ncategories with minimal costs. These results confirm the efficiency and\nstability of ONER, making it a powerful solution for real-world applications.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"J5PcLTYfXLQeEUG3yWOR1dQTpsfxHstKf3OIlGimCjA","pdfSize":"3402897"}