{
  "id": "2412.08127",
  "title": "Evil twins are not that evil: Qualitative insights into\n  machine-generated prompts",
  "authors": "Nathana\\\"el Carraz Rakotonirina, Corentin Kervadec, Francesca Franzon,\n  Marco Baroni",
  "authorsParsed": [
    [
      "Rakotonirina",
      "Nathanaël Carraz",
      ""
    ],
    [
      "Kervadec",
      "Corentin",
      ""
    ],
    [
      "Franzon",
      "Francesca",
      ""
    ],
    [
      "Baroni",
      "Marco",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 06:22:44 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733898164000,
  "abstract": "  It has been widely observed that language models (LMs) respond in predictable\nways to algorithmically generated prompts that are seemingly unintelligible.\nThis is both a sign that we lack a full understanding of how LMs work, and a\npractical challenge, because opaqueness can be exploited for harmful uses of\nLMs, such as jailbreaking. We present the first thorough analysis of opaque\nmachine-generated prompts, or autoprompts, pertaining to 3 LMs of different\nsizes and families. We find that machine-generated prompts are characterized by\na last token that is often intelligible and strongly affects the generation. A\nsmall but consistent proportion of the previous tokens are fillers that\nprobably appear in the prompt as a by-product of the fact that the optimization\nprocess fixes the number of tokens. The remaining tokens tend to have at least\na loose semantic relation with the generation, although they do not engage in\nwell-formed syntactic relations with it. We find moreover that some of the\nablations we applied to machine-generated prompts can also be applied to\nnatural language sequences, leading to similar behavior, suggesting that\nautoprompts are a direct consequence of the way in which LMs process linguistic\ninputs in general.\n",
  "subjects": [
    "Computer Science/Computation and Language",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Jqea-UEAZVfV_xktwNwR2aOmeMgavhHBOvQTwZDI0nI",
  "pdfSize": "761246"
}