{"id":"2412.07504","title":"Deterministic Storage of Quantum Information in the Genetic Code","authors":"Roberto Rivelino","authorsParsed":[["Rivelino","Roberto",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 13:36:31 GMT"}],"updateDate":"2024-12-11","timestamp":1733837791000,"abstract":"  DNA has been proposed as a chemical platform for computing and data storage,\npaving the way for building DNA-based computers. Recently, DNA has been\nhypothesized as an ideal quantum computer with the base pairs working as\nJosephson junctions. There are still major challenges to be overcome in these\ndirections, but they do not prevent deviceful perspectives of the main problem.\nThe present paper explores DNA base pairs as elementary units for a scalable\nnuclear magnetic resonance quantum computer (NMRQC). First, it presents an\noverview of the proton transfer (PT) mechanism during the prototropic\ntautomerism in the base pairs, scoring the current stage. Second, as a\nproof-of-principle, the paper examines these molecular structures as quantum\nprocessing units (QPUs) of a biochemical quantum device. For the model proposed\nhere, it is theoretically demonstrated that the nuclear spins involved in the\nPT of base pairs can be deterministically prepared in a superposition of\ntriplet states. Under appropriate conditions, the proton dynamics provides the\nminimal two-qubit entanglement required for quantum computing. The dynamics\nbetween the canonical and tautomeric quantum states (CQS and TQS, respectively)\nis determined from a thermally dependent Watson-Crick quantum superposition\n(WCQS); i.e., |WCQS> = a(T)|CQS> + b(T)|TQS> with |a(T)|^2 + |b(T)|^2 = 1. If\nthe DNA structure is sufficiently protected to avoid environment-induced\ndecoherence of the confined-proton quantum states, quantum information can be\nsuccessfully encoded in several base pairs along the coiled double strand. As a\npotential applicability, a crystalline DNA device could be employed for quantum\ncomputing and cryptography controlled by a sequence of Ramsey pulses. Finally,\nthis study critically evaluates these possibilities toward a proof-of-concept\nof a DNA-based quantum computer.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Other Condensed Matter","Quantitative Biology/Other Quantitative Biology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"jnq7_rU-YWKUwHdv3pLoiE2pccQUOjLhoYPvIlXvupc","pdfSize":"1284325"}