{"id":"2412.18162","title":"Unsupervised Learning Approach for Beamforming in Cell-Free Integrated\n  Sensing and Communication","authors":"Mohamed Elrashidy, Mudassir Masood, Ali Arshad Nasir","authorsParsed":[["Elrashidy","Mohamed",""],["Masood","Mudassir",""],["Nasir","Ali Arshad",""]],"versions":[{"version":"v1","created":"Tue, 24 Dec 2024 04:47:14 GMT"}],"updateDate":"2024-12-25","timestamp":1735015634000,"abstract":"  Cell-free massive multiple input multiple output (MIMO) systems can provide\nreliable connectivity and increase user throughput and spectral efficiency of\nintegrated sensing and communication (ISAC) systems. This can only be achieved\nthrough intelligent beamforming design. While many works have proposed\noptimization methods to design beamformers for cell-free systems, the\nunderlying algorithms are computationally complex and potentially increase\nfronthaul link loads. To address this concern, we propose an unsupervised\nlearning algorithm to jointly design the communication and sensing beamformers\nfor cell-free ISAC system. Specifically, we adopt a teacher-student training\nmodel to guarantee a balanced maximization of sensing signal to noise ratio\n(SSNR) and signal to interference plus noise ratio (SINR), which represent the\nsensing and communication metrics, respectively. The proposed scheme is\ndecentralized, which can reduce the load on the central processing unit (CPU)\nand the required fronthaul links. To avoid the tradeoff problem between sensing\nand communication counterparts of the cell-free system, we first train two\nidentical models (teacher models) each biased towards one of the two tasks. A\nthird identical model (a student model) is trained based on the maximum sensing\nand communication performance information obtained by the teacher models. While\nthe results show that our proposed unsupervised DL approach yields a\nperformance close to the state-of-the-art solution, the proposed approach is\nmore computationally efficient than the state of the art by at least three\norders of magnitude.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"DcINNDHF9PfPMyUmoz0fudWI0ygA7pqMG7Wp66-_w6o","pdfSize":"2633197"}