{"id":"2412.10998","title":"Evidence for incommensurate antiferromagnetism in nonsymmorphic\n  UPd$_{0.65}$Bi$_2$","authors":"Sanu Mishra, Caitlin S. Kengle, Joe D. Thompson, Allen O. Scheie,\n  Sean. M. Thomas, Filip Ronning, and Priscila F. S. Rosa","authorsParsed":[["Mishra","Sanu",""],["Kengle","Caitlin S.",""],["Thompson","Joe D.",""],["Scheie","Allen O.",""],["Thomas","Sean. M.",""],["Ronning","Filip",""],["Rosa","Priscila F. S.",""]],"versions":[{"version":"v1","created":"Sat, 14 Dec 2024 23:49:45 GMT"}],"updateDate":"2024-12-17","timestamp":1734220185000,"abstract":"  The intersection between nonsymmorphic symmetry and electronic correlations\nhas emerged as a platform for topological Kondo semimetallic states and\nunconventional spin textures. Here we report the synthesis of nonsymmorphic\nUPd$_{0.65}$Bi$_2$ single crystals and their structural, electronic, magnetic,\nand thermodynamic properties. UPd$_{0.65}$Bi$_2$ orders antiferromagnetically\n(AFM) below $T_N\\simeq$ 161 K as evidenced by a sharp cusp in magnetic\nsusceptibility, a second-order phase transition in specific heat, and an upturn\nin electrical resistivity, which suggests an incommensurate AFM structure that\ndeviates from the A-type magnetism typically observed in this class of\nmaterials. Across $T_N$, Hall effect measurements reveal a change from\nelectron-dominated to hole-dominated transport, which points to a sharp\nreconstruction in the electronic structure at $T_N$. Upon further cooling, a\nfirst-order transition is observed at $T_1 \\simeq 30 $K in magnetic\nsusceptibility and heat capacity but not in electrical resistivity or Hall\nmeasurements, which indicates a small change in the AFM structure that does not\naffect the electronic structure. Our specific heat data reveal a small\nSommerfeld coefficient ($\\gamma \\simeq$13 mJmol$^{-1}$K$^{-2}$), consistent\nwith localized 5$f$ electrons. Our results indicate that UPd$_{0.65}$Bi$_2$\nhosts weak electronic correlations and is likely away from a Kondo semimetallic\nstate. Low-temperature magnetization measurements show that the AFM structure\nis remarkably stable to 160 kOe and does not undergo any field-induced\ntransitions. Neutron diffraction and magnetization experiments at higher fields\nwould be valuable to probe the presence of unconventional spin textures.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Materials Science","Condensed Matter/Other Condensed Matter"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"JZRv7GVQ9eRbeQLbMVdYiW3aqnM-UV-KxodiY-V8tWo","pdfSize":"1417421"}