{
  "id": "2412.13809",
  "title": "Extreme Multi-label Completion for Semantic Document Labelling with\n  Taxonomy-Aware Parallel Learning",
  "authors": "Julien Audiffren, Christophe Broillet, Ljiljana Dolamic and Philippe\n  Cudr\\'e-Mauroux",
  "authorsParsed": [
    [
      "Audiffren",
      "Julien",
      ""
    ],
    [
      "Broillet",
      "Christophe",
      ""
    ],
    [
      "Dolamic",
      "Ljiljana",
      ""
    ],
    [
      "Cudré-Mauroux",
      "Philippe",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 12:57:49 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734526669000,
  "abstract": "  In Extreme Multi Label Completion (XMLCo), the objective is to predict the\nmissing labels of a collection of documents. Together with XML Classification,\nXMLCo is arguably one of the most challenging document classification tasks, as\nthe very high number of labels (at least ten of thousands) is generally very\nlarge compared to the number of available labelled documents in the training\ndataset. Such a task is often accompanied by a taxonomy that encodes the labels\norganic relationships, and many methods have been proposed to leverage this\nhierarchy to improve the results of XMLCo algorithms. In this paper, we propose\na new approach to this problem, TAMLEC (Taxonomy-Aware Multi-task Learning for\nExtreme multi-label Completion). TAMLEC divides the problem into several\nTaxonomy-Aware Tasks, i.e. subsets of labels adapted to the hierarchical paths\nof the taxonomy, and trains on these tasks using a dynamic Parallel Feature\nsharing approach, where some parts of the model are shared between tasks while\nothers are task-specific. Then, at inference time, TAMLEC uses the labels\navailable in a document to infer the appropriate tasks and to predict missing\nlabels. To achieve this result, TAMLEC uses a modified transformer architecture\nthat predicts ordered sequences of labels on a Weak-Semilattice structure that\nis naturally induced by the tasks. This approach yields multiple advantages.\nFirst, our experiments on real-world datasets show that TAMLEC outperforms\nstate-of-the-art methods for various XMLCo problems. Second, TAMLEC is by\nconstruction particularly suited for few-shots XML tasks, where new tasks or\nlabels are introduced with only few examples, and extensive evaluations\nhighlight its strong performance compared to existing methods.\n",
  "subjects": [
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "Yn0UHAcjS9eOsAqlK4AUHJOIKp5RnsvVyyY3-Hc6lEs",
  "pdfSize": "252419"
}