{"id":"2412.05447","title":"A Graph-Based Approach for Conversational AI-Driven Personal Memory\n  Capture and Retrieval in a Real-world Application","authors":"Savini Kashmira, Jayanaka L. Dantanarayana, Joshua Brodsky, Ashish\n  Mahendra, Yiping Kang, Krisztian Flautner, Lingjia Tang, Jason Mars","authorsParsed":[["Kashmira","Savini",""],["Dantanarayana","Jayanaka L.",""],["Brodsky","Joshua",""],["Mahendra","Ashish",""],["Kang","Yiping",""],["Flautner","Krisztian",""],["Tang","Lingjia",""],["Mars","Jason",""]],"versions":[{"version":"v1","created":"Fri, 6 Dec 2024 22:05:39 GMT"}],"updateDate":"2024-12-10","timestamp":1733522739000,"abstract":"  TOBU is a novel mobile application that captures and retrieves `personal\nmemories' (pictures/videos together with stories and context around those\nmoments) in a user-engaging AI-guided conversational approach. Our initial\nprototype showed that existing retrieval techniques such as retrieval-augmented\ngeneration (RAG) systems fall short due to their limitations in understanding\nmemory relationships, causing low recall, hallucination, and unsatisfactory\nuser experience. We design TOBUGraph, a novel graph-based retrieval approach.\nDuring capturing, TOBUGraph leverages large language models (LLMs) to\nautomatically create a dynamic knowledge graph of memories, establishing\ncontext and relationships of those memories. During retrieval, TOBUGraph\ncombines LLMs with the memory graph to achieve comprehensive recall through\ngraph traversal. Our evaluation using real user data demonstrates that\nTOBUGraph outperforms multiple RAG implementations in both precision and\nrecall, significantly improving user experience through improved retrieval\naccuracy and reduced hallucination.\n","subjects":["Computer Science/Machine Learning","Computer Science/Artificial Intelligence","Computer Science/Information Retrieval"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"w_Fk_X3RYKvOhga7iq9e9If6bcNwkVfzH392eAJ-ayY","pdfSize":"3331585"}