{
  "id": "2412.20843",
  "title": "Ising phase transitions and thermodynamics of correlated fermions in a\n  2D spin-dependent optical lattice",
  "authors": "Zhuotao Xie, Yu-Feng Song, Yuan-Yao He",
  "authorsParsed": [
    [
      "Xie",
      "Zhuotao",
      ""
    ],
    [
      "Song",
      "Yu-Feng",
      ""
    ],
    [
      "He",
      "Yuan-Yao",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 30 Dec 2024 10:16:54 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735553814000,
  "abstract": "  We present a {\\it numerically exact} study of the Hubbard model with\nspin-dependent anisotropic hopping on the square lattice using auxiliary-field\nquantum Monte Carlo method. At half-filling, the system undergoes Ising phase\ntransitions upon cooling, leading to the formation of Ising-type\nantiferromagnetic order for repulsive interactions and charge density wave\norder for attractive interactions at finite temperatures. By elegantly\nimplementing the sign-problem-free condition and Hubbard-Stratonovich\ntransformations, we achieve significant improvements in precision control of\nthe numerical calculations, and obtain highly accurate results of the\ntransition temperatures from weak to strong interactions across representative\nanisotropies. We further characterize the system by examining the temperature\ndependence of various thermodynamic properties, including the energy, double\noccupancy, specific heat and charge susceptibility. Specifically, we provide\nunbiased numerical results of the entropy map on temperature-interaction plane,\nthe critical entropy, and the spin, singlon and doublon correlations, all of\nwhich are directly measurable in optical lattice experiments. Away from\nhalf-filling, we explore the behavior of the sign problem and investigate the\npossible emergence of stripe spin-density wave order in the system with\nrepulsive interaction.\n",
  "subjects": [
    "Condensed Matter/Strongly Correlated Electrons",
    "Condensed Matter/Quantum Gases"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "fkjI-_QeXapnuzuNTAi8MXqX214-Skese2js0d-WeZA",
  "pdfSize": "1759869"
}