{
  "id": "2412.10099",
  "title": "Unexpected but informative: What fixation-related potentials tell us\n  about the processing of ambiguous program code",
  "authors": "Annabelle Bergum, Anna-Maria Maurer, Norman Peitek, Regine Bader, Axel\n  Mecklinger, Vera Demberg, Janet Siegmund, Sven Apel",
  "authorsParsed": [
    [
      "Bergum",
      "Annabelle",
      ""
    ],
    [
      "Maurer",
      "Anna-Maria",
      ""
    ],
    [
      "Peitek",
      "Norman",
      ""
    ],
    [
      "Bader",
      "Regine",
      ""
    ],
    [
      "Mecklinger",
      "Axel",
      ""
    ],
    [
      "Demberg",
      "Vera",
      ""
    ],
    [
      "Siegmund",
      "Janet",
      ""
    ],
    [
      "Apel",
      "Sven",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 12:38:10 GMT"
    }
  ],
  "updateDate": "2024-12-16",
  "timestamp": 1734093490000,
  "abstract": "  As software pervades more and more areas of our professional and personal\nlives, there is an ever-increasing need to maintain software, and for\nprogrammers to be able to efficiently write and understand program code. In the\nfirst study of its kind, we analyze fixation-related potentials (FRPs) to\nexplore the online processing of program code patterns that are ambiguous to\nprogrammers, but not the computer (so-called atoms of confusion), and their\nunderlying neurocognitive mechanisms in an ecologically valid setting. Relative\nto unambiguous counterparts in program code, atoms of confusion elicit a late\nfrontal positivity with a duration of about 400 to 700 ms after first looking\nat the atom of confusion. As the frontal positivity shows high resemblance with\nan event-related potential (ERP) component found during natural language\nprocessing that is elicited by unexpected but plausible words in sentence\ncontext, we take these data to suggest that the brain engages similar\nneurocognitive mechanisms in response to unexpected and informative inputs in\nprogram code and in natural language. In both domains, these inputs lead to an\nupdate of a comprehender's situation model that is essential for information\nextraction from a quickly unfolding input.\n",
  "subjects": [
    "Computer Science/Software Engineering"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "IRrkOH3EOJMq7tBoev3g9yfse06FRn7OkJGGRsx6AMI",
  "pdfSize": "4343896"
}