{
  "id": "2412.07080",
  "title": "EvRepSL: Event-Stream Representation via Self-Supervised Learning for\n  Event-Based Vision",
  "authors": "Qiang Qu, Xiaoming Chen, Yuk Ying Chung, Yiran Shen",
  "authorsParsed": [
    [
      "Qu",
      "Qiang",
      ""
    ],
    [
      "Chen",
      "Xiaoming",
      ""
    ],
    [
      "Chung",
      "Yuk Ying",
      ""
    ],
    [
      "Shen",
      "Yiran",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 00:42:54 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733791374000,
  "abstract": "  Event-stream representation is the first step for many computer vision tasks\nusing event cameras. It converts the asynchronous event-streams into a\nformatted structure so that conventional machine learning models can be applied\neasily. However, most of the state-of-the-art event-stream representations are\nmanually designed and the quality of these representations cannot be guaranteed\ndue to the noisy nature of event-streams. In this paper, we introduce a\ndata-driven approach aiming at enhancing the quality of event-stream\nrepresentations. Our approach commences with the introduction of a new\nevent-stream representation based on spatial-temporal statistics, denoted as\nEvRep. Subsequently, we theoretically derive the intrinsic relationship between\nasynchronous event-streams and synchronous video frames. Building upon this\ntheoretical relationship, we train a representation generator, RepGen, in a\nself-supervised learning manner accepting EvRep as input. Finally, the\nevent-streams are converted to high-quality representations, termed as EvRepSL,\nby going through the learned RepGen (without the need of fine-tuning or\nretraining). Our methodology is rigorously validated through extensive\nevaluations on a variety of mainstream event-based classification and optical\nflow datasets (captured with various types of event cameras). The experimental\nresults highlight not only our approach's superior performance over existing\nevent-stream representations but also its versatility, being agnostic to\ndifferent event cameras and tasks.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Multimedia"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "wRI0r2FHfFZANQGE_7Hd4dbtJ9ZDxv8a9pFWHBqQV9Y",
  "pdfSize": "4397819"
}