{
  "id": "2412.04924",
  "title": "Follow the money: a startup-based measure of AI exposure across\n  occupations, industries and regions",
  "authors": "Enrico Maria Fenoaltea, Dario Mazzilli, Aurelio Patelli, Angelica\n  Sbardella, Andrea Tacchella, Andrea Zaccaria, Marco Trombetti, and Luciano\n  Pietronero",
  "authorsParsed": [
    [
      "Fenoaltea",
      "Enrico Maria",
      ""
    ],
    [
      "Mazzilli",
      "Dario",
      ""
    ],
    [
      "Patelli",
      "Aurelio",
      ""
    ],
    [
      "Sbardella",
      "Angelica",
      ""
    ],
    [
      "Tacchella",
      "Andrea",
      ""
    ],
    [
      "Zaccaria",
      "Andrea",
      ""
    ],
    [
      "Trombetti",
      "Marco",
      ""
    ],
    [
      "Pietronero",
      "Luciano",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 10:25:05 GMT"
    },
    {
      "version": "v2",
      "created": "Thu, 12 Dec 2024 15:47:16 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1733480705000,
  "abstract": "  The integration of artificial intelligence (AI) into the workplace is\nadvancing rapidly, necessitating robust metrics to evaluate its tangible impact\non the labour market. Existing measures of AI occupational exposure largely\nfocus on AI's theoretical potential to substitute or complement human labour on\nthe basis of technical feasibility, providing limited insight into actual\nadoption and offering inadequate guidance for policymakers. To address this\ngap, we introduce the AI Startup Exposure (AISE) index-a novel metric based on\noccupational descriptions from O*NET and AI applications developed by startups\nfunded by the Y Combinator accelerator. Our findings indicate that while\nhigh-skilled professions are theoretically highly exposed according to\nconventional metrics, they are heterogeneously targeted by startups. Roles\ninvolving routine organizational tasks-such as data analysis and office\nmanagement-display significant exposure, while occupations involving tasks that\nare less amenable to AI automation due to ethical or high-stakes, more than\nfeasibility, considerations -- such as judges or surgeons -- present lower AISE\nscores. By focusing on venture-backed AI applications, our approach offers a\nnuanced perspective on how AI is reshaping the labour market. It challenges the\nconventional assumption that high-skilled jobs uniformly face high AI risks,\nhighlighting instead the role of today's AI players' societal\ndesirability-driven and market-oriented choices as critical determinants of AI\nexposure. Contrary to fears of widespread job displacement, our findings\nsuggest that AI adoption will be gradual and shaped by social factors as much\nas by the technical feasibility of AI applications. This framework provides a\ndynamic, forward-looking tool for policymakers and stakeholders to monitor AI's\nevolving impact and navigate the changing labour landscape.\n",
  "subjects": [
    "Economics/General Economics",
    "Computer Science/Artificial Intelligence",
    "Quantitative Finance/Economics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "8R82IoLTxgK_bWXrggJEaSvIVC4a6VX6uHpvVpqa8Ew",
  "pdfSize": "23241462"
}