{
  "id": "2412.19734",
  "title": "Dynamics, data and reconstruction",
  "authors": "Suddhasattwa Das, Tomoharu Suda",
  "authorsParsed": [
    [
      "Das",
      "Suddhasattwa",
      ""
    ],
    [
      "Suda",
      "Tomoharu",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 27 Dec 2024 16:49:52 GMT"
    },
    {
      "version": "v2",
      "created": "Wed, 5 Feb 2025 12:49:27 GMT"
    },
    {
      "version": "v3",
      "created": "Sun, 9 Feb 2025 22:39:16 GMT"
    }
  ],
  "updateDate": "2025-02-11",
  "timestamp": 1735318192000,
  "abstract": "  Data-driven learning is prevalent in many fields of science, mathematics and\nengineering. The goal of data-driven learning of dynamical systems is to\ninterpret timeseries as a continuous observation of an underlying dynamical\nsystem. This task is not well-posed for a variety of reasons. A dynamical\nsystem may have multiple sub-systems co-existing within it. The nature of the\ndataset depends on the portion of the phase space being viewed, and may thus be\nconfined to a sub-system. Secondly these sub-systems may be topologically\ninter-weaved, so may be inseparable computationally. Thirdly, two timeseries\nsampled separately from different dynamical systems may be close or even\nindistinguishable. Thus a timeseries may not have a unique source. We show how\nthese ambiguities are circumvented if one considers dynamical systems and\nmeasurement maps collectively. This is made possible in a category theoretical\nframework, in which reconstruction is unique up to equivalences. Dynamical\nsystems, observed dynamical systems, and timeseries data - each of these three\ncollections have an extensive network of relations within them, which gives\nthem the mathematical structure of a category. We show that the transformations\npreserve these relations, and thus have the mathematical property of being\nfunctors. Secondly we show that under mild conditions of consistency,\nreconstruction algorithms are themselves functors from the category of\ntimeseries-data into the category of dynamical systems. Finally we present the\ntask of inverting the data into dynamics, using the language of Kan extensions.\n",
  "subjects": [
    "Mathematics/Dynamical Systems",
    "Mathematics/Category Theory"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "1yw3DSLZgD8eTX8kk9meGDbVmOofWLKoMGVIBrBoV6Y",
  "pdfSize": "679707"
}