{
  "id": "2412.10932",
  "title": "Understanding the Radio Emission from the $\\beta$ Cep star V2187 Cyg",
  "authors": "Luis F. Rodriguez, Susana Lizano, Jorge Canto, Ricardo F. Gonzalez,\n  Mauricio Tapia",
  "authorsParsed": [
    [
      "Rodriguez",
      "Luis F.",
      ""
    ],
    [
      "Lizano",
      "Susana",
      ""
    ],
    [
      "Canto",
      "Jorge",
      ""
    ],
    [
      "Gonzalez",
      "Ricardo F.",
      ""
    ],
    [
      "Tapia",
      "Mauricio",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 14 Dec 2024 19:01:31 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734202891000,
  "abstract": "  We analyze the radio emission from the $\\beta$ Cep star V2187 Cyg using\narchive data from the Jansky Very Large Array. The observations were made in\nten epochs at 1.39 and 4.96 GHz in the highest angular resolution A\nconfiguration. We determine a spectral index of of $\\alpha = 0.6\\pm0.2$\n($S_{\\nu} \\propto \\nu^\\alpha$), consistent with an ionized wind or a partially\noptically-thick synchrotron or gyrosynchrotron source. The emission is\nspatially unresolved at both frequencies. The 4.96 GHz data shows a radio pulse\nwith a duration of about one month that can be modeled in terms of an internal\nshock in the stellar wind produced by a sudden increase in the mass-loss rate\nand the terminal velocity. The quiescent radio emission of V2187 Cyg at 4.96\nGHz (with a flux density of $\\simeq 150~\\mu Jy$), cannot be explained in terms\nof an internally (by V2187 Cyg) or externally (by a nearby O star) photoionized\nwind. We conclude that, despite the spectral index suggestive of free-free\nemission from an ionized wind, the radio emission of V2187 Cyg most likely has\na magnetic origin, a possibility that can be tested with a sensitive search for\ncircular polarization in the radio, as expected from gyro-synchrotron\nradiation, and also by trying to measure the stellar magnetic field, that is\nexpected to be in the range of several kGauss.\n",
  "subjects": [
    "Astrophysics/Solar and Stellar Astrophysics",
    "Astrophysics/High Energy Astrophysical Phenomena"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "2KY14nZK7uau6r63V_fXMlMYTVmyl9ygd5Xeb9je1aE",
  "pdfSize": "452401"
}