{
  "id": "2412.04674",
  "title": "Comparison of Transcriptional Activation by Corticosteroids of Human MR\n  (Ile-180) and Human MR Haplotype (Ile180Val)",
  "authors": "Yoshinao Katsu, Jiawn Zhang, Ya Ao, Michael E. Baker",
  "authorsParsed": [
    [
      "Katsu",
      "Yoshinao",
      ""
    ],
    [
      "Zhang",
      "Jiawn",
      ""
    ],
    [
      "Ao",
      "Ya",
      ""
    ],
    [
      "Baker",
      "Michael E.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 23:59:11 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733443151000,
  "abstract": "  While the classical function of human mineralocorticoid receptor (MR) is to\nregulate sodium and potassium homeostasis through aldosterone activation of the\nkidney MR, the MR also is highly expressed in the brain, where the MR is\nactivated by cortisol in response to stress. Here, we report the half-maximal\nresponse (EC50) and fold-activation by cortisol, aldosterone and other\ncorticosteroids of human MR rs5522, a haplotype containing valine at codon 180\ninstead of isoleucine found in the wild-type MR (Ile-180). MR rs5522 (Val-180)\nhas been studied for its actions in the human brain involving coping with\nstress and depression. We compared the EC50 and fold-activation by\ncorticosteroids of MR rs5522 and wild-type MR transfected into HEK293 cells\nwith either the TAT3 promoter or the MMTV promoter. Parallel studies\ninvestigated the binding of MR antagonists, spironolactone and progesterone, to\nMR rs5522. In HEK293 cells with the MMTV promotor, MR rs5522 had a slightly\nhigher EC50 compared to wild-type MR and a similar level of fold-activation for\nall corticosteroids. In contrast, in HEK293 cells with the TAT3 promoter, MR\n5522 had a higher EC50 (lower affinity) and higher fold-activation for cortisol\ncompared to wild-type MR (Ile-180), while compared to wild-type MR, the EC50s\nof MR rs5522 for aldosterone and corticosterone were slightly lower and\nfold-activation was higher. Spironolactone and progesterone had similar\nantagonist activity for MR rs5522 and MR (Ile-180) in the presence of MMTV and\nTAT3 promoters in HEK293 cells.\n",
  "subjects": [
    "Quantitative Biology/Biomolecules",
    "Quantitative Biology/Tissues and Organs"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "ePfFx8pLSs0nm8CCsFJMOvhXf9dlCWDxwfsaxtIfD7k",
  "pdfSize": "599807"
}