{
  "id": "2412.16894",
  "title": "Unsupervised Bilingual Lexicon Induction for Low Resource Languages",
  "authors": "Charitha Rathnayake, P.R.S. Thilakarathna, Uthpala Nethmini,\n  Rishemjith Kaur and Surangika Ranathunga",
  "authorsParsed": [
    [
      "Rathnayake",
      "Charitha",
      ""
    ],
    [
      "Thilakarathna",
      "P. R. S.",
      ""
    ],
    [
      "Nethmini",
      "Uthpala",
      ""
    ],
    [
      "Kaur",
      "Rishemjith",
      ""
    ],
    [
      "Ranathunga",
      "Surangika",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 22 Dec 2024 07:07:09 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734851229000,
  "abstract": "  Bilingual lexicons play a crucial role in various Natural Language Processing\ntasks. However, many low-resource languages (LRLs) do not have such lexicons,\nand due to the same reason, cannot benefit from the supervised Bilingual\nLexicon Induction (BLI) techniques. To address this, unsupervised BLI (UBLI)\ntechniques were introduced. A prominent technique in this line is\nstructure-based UBLI. It is an iterative method, where a seed lexicon, which is\ninitially learned from monolingual embeddings is iteratively improved. There\nhave been numerous improvements to this core idea, however they have been\nexperimented with independently of each other. In this paper, we investigate\nwhether using these techniques simultaneously would lead to equal gains. We use\nthe unsupervised version of VecMap, a commonly used structure-based UBLI\nframework, and carry out a comprehensive set of experiments using the LRL\npairs, English-Sinhala, English-Tamil, and English-Punjabi. These experiments\nhelped us to identify the best combination of the extensions. We also release\nbilingual dictionaries for English-Sinhala and English-Punjabi.\n",
  "subjects": [
    "Computer Science/Computation and Language"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "wedC0KhKAMiyBcKrBISgQaPGqTEspCEb-WlQB6lcXLY",
  "pdfSize": "812493"
}