{
  "id": "2412.18146",
  "title": "Exploring variation of double-peak broad-line profile in strongly\n  variable AGNs",
  "authors": "Jiancheng Wu, Qingwen Wu, Kaixing Lu, Xinwu Cao, Xiangli Lei, Mengye\n  Wang and Xiao Fan",
  "authorsParsed": [
    [
      "Wu",
      "Jiancheng",
      ""
    ],
    [
      "Wu",
      "Qingwen",
      ""
    ],
    [
      "Lu",
      "Kaixing",
      ""
    ],
    [
      "Cao",
      "Xinwu",
      ""
    ],
    [
      "Lei",
      "Xiangli",
      ""
    ],
    [
      "Wang",
      "Mengye",
      ""
    ],
    [
      "Fan",
      "Xiao",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 24 Dec 2024 04:04:30 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1735013070000,
  "abstract": "  The geometry and kinematics of the broad-line region (BLR) in AGNs are still\nunclear, which is crucial for studying the physics and evolution of\nsupermassive black holes (SMBHs) and AGNs. The broad-line profile provides\nvaluable information on BLR geometry and kinematics. In this work, we explore\nthe evolution of line profiles in variable AGNs based on the BLR model of\nCzerny \\& Hryniewicz, where the BLR is driven by the radiation pressure acting\non dust at the surface layers of the accretion disk. The line profiles in the\nlow-Eddington-ratio regime show a double-peak profile, which will become a\nsingle peak at high Eddington ratios. The high metallicity of $Z\\gtrsim\n5Z_{\\odot}$ is required to reproduce the observational anti-correlation between\nthe peak separation of broad lines and the Eddington ratio for a sample of\nAGNs. For the broad lines in variable AGNs, it will take several years to\nseveral decades to change their line profile if the disk luminosity suffers\nstrong variation in a much shorter timescale. More monitoring of the broad line\nand continuum in strongly variable AGNs can shed special light on BLR physics.\n",
  "subjects": [
    "Astrophysics/Astrophysics of Galaxies",
    "Astrophysics/High Energy Astrophysical Phenomena"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "4Dwkg43sfrpz_lNkD52NPPfNhaQSZbQQegeOLkCECO8",
  "pdfSize": "699010"
}