{"id":"2412.01472","title":"Time Resolved Absorption of Six Chemical Species With MAROON-X Points to\n  Strong Drag in the Ultra Hot Jupiter TOI-1518 b","authors":"A. Simonnin, V. Parmentier, J.P. Wardenier, G. Chauvin, A. Chiavassa,\n  M. N'Diaye, X. Tan, J. Bean, M. Line, D. Kitzmann, D. Kasper, A. Seifhart, M.\n  Brogi, E.K.H. Lee, S. Pelletier, L. Pino, B. Prinoth, J.V. Seidel, M. Weiner\n  Mansfield, B. Benneke, J-M. D\\'esert, S. Gandhi, M. Hammond, P. Palma-Bifani,\n  E. Rauscher, P. Smith","authorsParsed":[["Simonnin","A.",""],["Parmentier","V.",""],["Wardenier","J. P.",""],["Chauvin","G.",""],["Chiavassa","A.",""],["N'Diaye","M.",""],["Tan","X.",""],["Bean","J.",""],["Line","M.",""],["Kitzmann","D.",""],["Kasper","D.",""],["Seifhart","A.",""],["Brogi","M.",""],["Lee","E. K. H.",""],["Pelletier","S.",""],["Pino","L.",""],["Prinoth","B.",""],["Seidel","J. V.",""],["Mansfield","M. Weiner",""],["Benneke","B.",""],["Désert","J-M.",""],["Gandhi","S.",""],["Hammond","M.",""],["Palma-Bifani","P.",""],["Rauscher","E.",""],["Smith","P.",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 13:19:02 GMT"},{"version":"v2","created":"Tue, 3 Dec 2024 15:48:05 GMT"}],"updateDate":"2024-12-04","timestamp":1733145542000,"abstract":"  Wind dynamics play a pivotal role in governing transport processes within\nplanetary atmospheres, influencing atmospheric chemistry, cloud formation, and\nthe overall energy budget. Understanding the strength and patterns of winds is\ncrucial for comprehensive insights into the physics of ultra-hot Jupiter\natmospheres. Current research has proposed two contrasting mechanisms that\nlimit wind speeds in these atmospheres, each predicting a different scaling of\nwind speed with planet temperature. However, the sparse nature of existing\nobservations hinders the determination of population trends and the validation\nof these proposed mechanisms. This study focuses on unraveling the wind\ndynamics and the chemical composition in the atmosphere of the ultra-hot\nJupiter TOI-1518 b. Two transit observations using the high-resolution\n(R{\\lambda} = 85 000), optical (spectral coverage between 490 and 920 nm)\nspectrograph MAROON-X were obtained and analyzed to explore the chemical\ncomposition and wind dynamics using the cross-correlation techniques, global\ncirculating models, and atmospheric retrieval. We report the detection of 14\nspecies in the atmosphere of TOI-1518 b through cross-correlation analysis.\nAdditionally, we measure the time-varying cross-correlation trails for 6\ndifferent species, compare them with predictions from General Circulation\nModels (GCM) and conclude that a strong drag is present in TOI-1518b's\natmosphere. The ionized species require stronger drags than neutral species,\nlikely due to the increased magnetic effects in the upper atmosphere.\nFurthermore, we detect vanadium oxide (VO) using the most up-to-date line list.\nThis result is promising in detecting VO in other systems where inaccuracies in\nprevious line lists have hindered detection. We use a retrieval analysis to\nfurther characterize the abundances of the different species detected.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"HIF1eb8C97aGAYtds687g15OG7xRuLcqiKLpgpjigbQ","pdfSize":"11235630"}