{"id":"2412.15381","title":"Recovering WPA-3 Network Password by Bypassing the Simultaneous\n  Authentication of Equals Handshake using Social Engineering Captive Portal","authors":"Kyle Chadee, Wayne Goodridge, Koffka Khan","authorsParsed":[["Chadee","Kyle",""],["Goodridge","Wayne",""],["Khan","Koffka",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 20:19:34 GMT"}],"updateDate":"2024-12-23","timestamp":1734639574000,"abstract":"  Wi-Fi Protected Access 3 (WPA3) is the accepted standard for next generation\nwireless security. WPA3 comes with exciting new features that allows for\nincreased security of Wi-Fi networks. One such feature is the Simultaneous\nAuthentication of Equals (SAE) which is a protocol whereby passphrases are\nhashed using a Password Authenticated Key Exchange with keys from both the\nAccess Point and the Client making the password resistant to offline dictionary\nattacks. (Harkins, Dan. 2019) This objective of this research paper seeks to\nbypass WPA3-SAE to acquire network password via Man-in-the-Middle attack and\nSocial Engineering. This method can prove to be useful given that majority of\nnetwork attacks stem from social engineering. For this research we would be\nlooking at the security of WPA3 personal transition mode and capture the\nnetwork password via a captive portal. Breaching the WPA3 network can be\npossible by building on various security flaws that was disclosed on WPA3 in\n2021. Due to the discovery of Dragonblood downgrade attacks disclosed in 2019,\nidentified that WPA2/3Handshakes could be acquired. A Man in the Middle attack\nproposed set up is carried out by using race conditions to deauthentication\nWPA3 network and then using a Raspberry Pi to spawn a rouge WPA3 network. As\nsuch, the handshake acquired can then be utilized as to verify the password\nthat would be entered in the captive portal of the rouge WPA3 network. This\nresearch identified that the Password was able to be recovered from Social\nEngineering Captive Portal when Protected Management Frames are not\nimplemented. This research also indicates that some devices are not able to\nconnect to a WPA 3 transition network which is contradicting the Wi-Fi Alliance\nclaim that it is backwards compatible with WPA2.\n","subjects":["Computer Science/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"xFlt1Li2WN4NnIFVgiKqwF6nhkvsHrWB14-8lUVwvxM","pdfSize":"1317283"}