{
  "id": "2412.08573",
  "title": "TryOffAnyone: Tiled Cloth Generation from a Dressed Person",
  "authors": "Ioannis Xarchakos, Theodoros Koukopoulos",
  "authorsParsed": [
    [
      "Xarchakos",
      "Ioannis",
      ""
    ],
    [
      "Koukopoulos",
      "Theodoros",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 17:41:53 GMT"
    },
    {
      "version": "v2",
      "created": "Fri, 3 Jan 2025 11:34:09 GMT"
    }
  ],
  "updateDate": "2025-01-06",
  "timestamp": 1733938913000,
  "abstract": "  The fashion industry is increasingly leveraging computer vision and deep\nlearning technologies to enhance online shopping experiences and operational\nefficiencies. In this paper, we address the challenge of generating\nhigh-fidelity tiled garment images essential for personalized recommendations,\noutfit composition, and virtual try-on systems from photos of garments worn by\nmodels. Inspired by the success of Latent Diffusion Models (LDMs) in\nimage-to-image translation, we propose a novel approach utilizing a fine-tuned\nStableDiffusion model. Our method features a streamlined single-stage network\ndesign, which integrates garmentspecific masks to isolate and process target\nclothing items effectively. By simplifying the network architecture through\nselective training of transformer blocks and removing unnecessary\ncrossattention layers, we significantly reduce computational complexity while\nachieving state-of-the-art performance on benchmark datasets like VITON-HD.\nExperimental results demonstrate the effectiveness of our approach in producing\nhigh-quality tiled garment images for both full-body and half-body inputs. Code\nand model are available at: https://github.com/ixarchakos/try-off-anyone\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "wlpFILdzqg5tGIVGtZ4uuC_E9u1we2wIv0F8sweU0sA",
  "pdfSize": "8215780"
}