{
  "id": "2412.16616",
  "title": "Distributed Inference on Mobile Edge and Cloud: A Data-Cartography based\n  Clustering Approach",
  "authors": "Divya Jyoti Bajpai and Manjesh Kumar Hanawal",
  "authorsParsed": [
    [
      "Bajpai",
      "Divya Jyoti",
      ""
    ],
    [
      "Hanawal",
      "Manjesh Kumar",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 21 Dec 2024 13:20:26 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734787226000,
  "abstract": "  The large size of DNNs poses a significant challenge for deployment on\ndevices with limited resources, such as mobile, edge, and IoT platforms. To\naddress this issue, a distributed inference framework can be utilized. In this\nframework, a small-scale DNN (initial layers) is deployed on mobile devices, a\nlarger version on edge devices, and the full DNN on the cloud. Samples with low\ncomplexity (easy) can be processed on mobile, those with moderate complexity\n(medium) on edge devices, and high complexity (hard) samples on the cloud.\nGiven that the complexity of each sample is unknown in advance, the crucial\nquestion in distributed inference is determining the sample complexity for\nappropriate DNN processing. We introduce a novel method named \\our{}, which\nleverages the Data Cartography approach initially proposed for enhancing DNN\ngeneralization. By employing data cartography, we assess sample complexity.\n\\our{} aims to boost accuracy while considering the offloading costs from\nmobile to edge/cloud. Our experimental results on GLUE datasets, covering a\nvariety of NLP tasks, indicate that our approach significantly lowers inference\ncosts by more than 43\\% while maintaining a minimal accuracy drop of less than\n0.5\\% compared to performing all inferences on the cloud. The source code is\navailable at https://anonymous.4open.science/r/DIMEC-1B04.\n",
  "subjects": [
    "Computer Science/Distributed, Parallel, and Cluster Computing",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "baPGu1UkxVcZsamVqtC5iGSivsXsXsU0mEnGCR9k-uM",
  "pdfSize": "1903359"
}