{"id":"2412.10727","title":"Revisiting constraints on proton PDFs from HERA DIS, Drell-Yan, W/Z\n  Boson production, and projected EIC measurements","authors":"Majid Azizi, Maryam Soleymaninia, Hadi Hashamipour, Maral Salajegheh,\n  Hamzeh Khanpour, and Ulf-G. Mei{\\ss}ner","authorsParsed":[["Azizi","Majid",""],["Soleymaninia","Maryam",""],["Hashamipour","Hadi",""],["Salajegheh","Maral",""],["Khanpour","Hamzeh",""],["Meißner","Ulf-G.",""]],"versions":[{"version":"v1","created":"Sat, 14 Dec 2024 07:55:01 GMT"}],"updateDate":"2024-12-17","timestamp":1734162901000,"abstract":"  We present new parton distribution functions (PDFs) at next-to-leading order\n(NLO) and next-to-next-to-leading order (NNLO) in perturbative QCD, derived\nfrom a comprehensive global QCD analysis of high-precision data sets from\ncombined HERA deep-inelastic scattering (DIS), the Tevatron, and the Large\nHadron Collider (LHC). To improve constraints on quark flavor separation, we\nincorporate Drell-Yan pair production data, which provides critical sensitivity\nto the quark distributions. In addition, we include the latest W and Z boson\nproduction data from the CDF, D0, ATLAS, and CMS collaborations, further\nrefining both quark and gluon distributions. Our nominal global QCD fit\nintegrates these datasets and examines the resulting impact on the PDFs and\ntheir associated uncertainties. Uncertainties in the PDFs are quantified using\nthe Hessian method, ensuring robust error estimates. Furthermore, we explore\nthe sensitivity of the strong coupling constant, $\\alpha_s(M_Z^2)$, and proton\nPDFs in light of the projected measurements from the Electron-Ion Collider\n(EIC), where improvements in precision are expected. The analysis also\ninvestigates the effects of inclusive jet and dijet production data, which\nprovide enhanced constraints on the gluon PDF and $\\alpha_s(M_Z^2)$.\n","subjects":["Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"6ttd_g6-S1RlsMpg3I1BXKEZRK1MIim0kzo1wZ1lLbM","pdfSize":"7100349"}