{
  "id": "2412.06694",
  "title": "Digital Transformation in the Water Distribution System based on the\n  Digital Twins Concept",
  "authors": "MohammadHossein Homaei, Agust\\'in Javier Di Bartolo, Mar \\'Avila,\n  \\'Oscar Mogoll\\'on-Guti\\'errez, Andr\\'es Caro",
  "authorsParsed": [
    [
      "Homaei",
      "MohammadHossein",
      ""
    ],
    [
      "Di Bartolo",
      "Agustín Javier",
      ""
    ],
    [
      "Ávila",
      "Mar",
      ""
    ],
    [
      "Mogollón-Gutiérrez",
      "Óscar",
      ""
    ],
    [
      "Caro",
      "Andrés",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 17:40:37 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733766037000,
  "abstract": "  Digital Twins have emerged as a disruptive technology with great potential;\nthey can enhance WDS by offering real-time monitoring, predictive maintenance,\nand optimization capabilities. This paper describes the development of a\nstate-of-the-art DT platform for WDS, introducing advanced technologies such as\nthe Internet of Things, Artificial Intelligence, and Machine Learning models.\nThis paper provides insight into the architecture of the proposed\nplatform-CAUCCES-that, informed by both historical and meteorological data,\neffectively deploys AI/ML models like LSTM networks, Prophet, LightGBM, and\nXGBoost in trying to predict water consumption patterns. Furthermore, we delve\ninto how optimization in the maintenance of WDS can be achieved by formulating\na Constraint Programming problem for scheduling, hence minimizing the\noperational cost efficiently with reduced environmental impacts. It also\nfocuses on cybersecurity and protection to ensure the integrity and reliability\nof the DT platform. In this view, the system will contribute to improvements in\ndecision-making capabilities, operational efficiency, and system reliability,\nwith reassurance being drawn from the important role it can play toward\nsustainable management of water resources.\n",
  "subjects": [
    "Computer Science/Computers and Society",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "5mZo8BRH-9URy-wWhDgRnnKVJcaI7nkNIT-iWaocOxs",
  "pdfSize": "8291381"
}