{
  "id": "2412.09505",
  "title": "Integrating Vision Systems and STPA for Robust Landing and Take-Off in\n  VTOL Aircraft",
  "authors": "Sandeep Banik, Jinrae Kim, Naira Hovakimyan, Luca Carlone, John P.\n  Thomas, and Nancy G. Leveson",
  "authorsParsed": [
    [
      "Banik",
      "Sandeep",
      ""
    ],
    [
      "Kim",
      "Jinrae",
      ""
    ],
    [
      "Hovakimyan",
      "Naira",
      ""
    ],
    [
      "Carlone",
      "Luca",
      ""
    ],
    [
      "Thomas",
      "John P.",
      ""
    ],
    [
      "Leveson",
      "Nancy G.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 17:54:55 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1734026095000,
  "abstract": "  Vertical take-off and landing (VTOL) unmanned aerial vehicles (UAVs) are\nversatile platforms widely used in applications such as surveillance, search\nand rescue, and urban air mobility. Despite their potential, the critical\nphases of take-off and landing in uncertain and dynamic environments pose\nsignificant safety challenges due to environmental uncertainties, sensor noise,\nand system-level interactions. This paper presents an integrated approach\ncombining vision-based sensor fusion with System-Theoretic Process Analysis\n(STPA) to enhance the safety and robustness of VTOL UAV operations during\ntake-off and landing. By incorporating fiducial markers, such as AprilTags,\ninto the control architecture, and performing comprehensive hazard analysis, we\nidentify unsafe control actions and propose mitigation strategies. Key\ncontributions include developing the control structure with vision system\ncapable of identifying a fiducial marker, multirotor controller and\ncorresponding unsafe control actions and mitigation strategies. The proposed\nsolution is expected to improve the reliability and safety of VTOL UAV\noperations, paving the way for resilient autonomous systems.\n",
  "subjects": [
    "Computer Science/Robotics",
    "Computer Science/Emerging Technologies"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "UiIe80-T8rFdZWib-TEu6auwdzQS3hz_UY8NwJOr7EE",
  "pdfSize": "2303465"
}