{
  "id": "2412.08763",
  "title": "Beyond Knowledge Silos: Task Fingerprinting for Democratization of\n  Medical Imaging AI",
  "authors": "Patrick Godau and Akriti Srivastava and Tim Adler and Lena Maier-Hein",
  "authorsParsed": [
    [
      "Godau",
      "Patrick",
      ""
    ],
    [
      "Srivastava",
      "Akriti",
      ""
    ],
    [
      "Adler",
      "Tim",
      ""
    ],
    [
      "Maier-Hein",
      "Lena",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 20:28:42 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1733948922000,
  "abstract": "  The field of medical imaging AI is currently undergoing rapid\ntransformations, with methodical research increasingly translated into clinical\npractice. Despite these successes, research suffers from knowledge silos,\nhindering collaboration and progress: Existing knowledge is scattered across\npublications and many details remain unpublished, while privacy regulations\nrestrict data sharing. In the spirit of democratizing of AI, we propose a\nframework for secure knowledge transfer in the field of medical image analysis.\nThe key to our approach is dataset \"fingerprints\", structured representations\nof feature distributions, that enable quantification of task similarity. We\ntested our approach across 71 distinct tasks and 12 medical imaging modalities\nby transferring neural architectures, pretraining, augmentation policies, and\nmulti-task learning. According to comprehensive analyses, our method\noutperforms traditional methods for identifying relevant knowledge and\nfacilitates collaborative model training. Our framework fosters the\ndemocratization of AI in medical imaging and could become a valuable tool for\npromoting faster scientific advancement.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "wjNaIRgJXs1THC9FqtJlM0wi7vWVPzOxxtuMZHOa4hY",
  "pdfSize": "8732133"
}