{"id":"2412.12580","title":"A hierarchical splines-based $h$-adaptive isogeometric solver for\n  all-electron Kohn--Sham equation","authors":"Tao Wang, Yang Kuang, Ran Zhang, Guanghui Hu","authorsParsed":[["Wang","Tao",""],["Kuang","Yang",""],["Zhang","Ran",""],["Hu","Guanghui",""]],"versions":[{"version":"v1","created":"Tue, 17 Dec 2024 06:19:05 GMT"}],"updateDate":"2024-12-18","timestamp":1734416345000,"abstract":"  In this paper, a novel $h$-adaptive isogeometric solver utilizing high-order\nhierarchical splines is proposed to solve the all-electron Kohn--Sham equation.\nIn virtue of the smooth nature of Kohn--Sham wavefunctions across the domain,\nexcept at the nuclear positions, high-order globally regular basis functions\nsuch as B-splines are well suited for achieving high accuracy. To further\nhandle the singularities in the external potential at the nuclear positions, an\n$h$-adaptive framework based on the hierarchical splines is presented with a\nspecially designed residual-type error indicator, allowing for different\nresolutions on the domain. The generalized eigenvalue problem raising from the\ndiscretized Kohn--Sham equation is effectively solved by the locally optimal\nblock preconditioned conjugate gradient (LOBPCG) method with an elliptic\npreconditioner, and it is found that the eigensolver's convergence is\nindependent of the spline basis order. A series of numerical experiments\nconfirm the effectiveness of the $h$-adaptive framework, with a notable\nexperiment that the numerical accuracy $10^{-3} \\mathrm{~Hartree/particle}$ in\nthe all-electron simulation of a methane molecule is achieved using only $6355$\ndegrees of freedom, demonstrating the competitiveness of our solver for the\nall-electron Kohn--Sham equation.\n","subjects":["Physics/Computational Physics","Computer Science/Numerical Analysis","Mathematics/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"KVFQBDNrXJ3Q4-veQTrejtrkz-eAAVWwscSiQt5VDcQ","pdfSize":"3758074"}