{
  "id": "2412.08778",
  "title": "Biological barriers to forest pest invasions: A novel host tree slows\n  mountain pine beetle range expansion",
  "authors": "Evan C. Johnson, Antonia Musso, Catherine Cullingham, Mark A. Lewis",
  "authorsParsed": [
    [
      "Johnson",
      "Evan C.",
      ""
    ],
    [
      "Musso",
      "Antonia",
      ""
    ],
    [
      "Cullingham",
      "Catherine",
      ""
    ],
    [
      "Lewis",
      "Mark A.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 21:10:01 GMT"
    },
    {
      "version": "v2",
      "created": "Sat, 25 Jan 2025 20:18:06 GMT"
    }
  ],
  "updateDate": "2025-01-28",
  "timestamp": 1733951401000,
  "abstract": "  Following widespread outbreaks across western North America, mountain pine\nbeetle recently expanded its range from British Columbia into Alberta. However,\nmountain pine beetle's eastward expansion across Canada has stalled\nunexpectedly, defying predictions of rapid spread through jack pine, a novel\nhost tree. This study investigates the underlying causes of this deceleration\nusing an integrative approach combining statistical modeling, simulations, and\nexperimental data. We find that the slow spread is primarily due to mountain\npine beetle's difficulty in finding and successfully attacking jack pine trees,\nrather than issues with reproduction or larval development. The underlying\nmechanism impeding beetle range expansion has been hypothesized to be lower\npine volumes in eastern forests, which are primarily a consequence of lower\nstem density. However, our analysis suggests that jack pine's phenotype itself\nis the primary impediment. We propose that jack pine's smaller size, thinner\nphloem, and lower monoterpene concentrations result in weaker chemical cues\nduring the host-finding and mass-attack stages of MPB's life cycle, ultimately\nleading to fewer successful attacks. These findings suggest a reduced risk of\nfurther eastward spread, but should be interpreted cautiously due to enormous\npolicy implications and the inherent limitations of ecological forecasting.\n",
  "subjects": [
    "Quantitative Biology/Populations and Evolution"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "SkN9G0EcBTSW195qmynjWQiNKRCKaVNoBvG5b2mIGbI",
  "pdfSize": "6763744"
}