{
  "id": "2412.00546",
  "title": "Rank It, Then Ask It: Input Reranking for Maximizing the Performance of\n  LLMs on Symmetric Tasks",
  "authors": "Mohsen Dehghankar, Abolfazl Asudeh",
  "authorsParsed": [
    [
      "Dehghankar",
      "Mohsen",
      ""
    ],
    [
      "Asudeh",
      "Abolfazl",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 30 Nov 2024 17:39:59 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1732988399000,
  "abstract": "  Large language models (LLMs) have quickly emerged as practical and versatile\ntools that provide new solutions for a wide range of domains. In this paper, we\nconsider the application of LLMs on symmetric tasks where a query is asked on\nan (unordered) bag of elements. Examples of such tasks include answering\naggregate queries on a database table. In general, when the bag contains a\nlarge number of elements, LLMs tend to overlook some elements, leading to\nchallenges in generating accurate responses to the query. LLMs receive their\ninputs as ordered sequences. However, in this problem, we leverage the fact\nthat the symmetric input is not ordered, and reordering should not affect the\nLLM's response.\n  Observing that LLMs are less likely to miss elements at certain positions of\nthe input, we introduce the problem of LLM input reranking: to find a ranking\nof the input that maximizes the LLM's accuracy for the given query without\nmaking explicit assumptions about the query. Finding the optimal ranking\nrequires identifying (i) the relevance of each input element for answering the\nquery and (ii) the importance of each rank position for the LLM's attention. We\ndevelop algorithms for estimating these values efficiently utilizing a helper\nLLM. We conduct comprehensive experiments on different synthetic and real\ndatasets to validate our proposal and to evaluate the effectiveness of our\nproposed algorithms. Our experiments confirm that our reranking approach\nimproves the accuracy of the LLMs on symmetric tasks by up to $99\\%$ proximity\nto the optimum upper bound.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Databases",
    "Computer Science/Information Retrieval"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "QnavCaDBxHIYZVmbEWxs3mZbSh_WEWvPGzpfudA9fFs",
  "pdfSize": "753510"
}