{"id":"2412.10721","title":"Model checking for high dimensional generalized linear models based on\n  random projections","authors":"Wen Chen, Jie Liu, Heng Peng, Falong Tan, and Lixing Zhu","authorsParsed":[["Chen","Wen",""],["Liu","Jie",""],["Peng","Heng",""],["Tan","Falong",""],["Zhu","Lixing",""]],"versions":[{"version":"v1","created":"Sat, 14 Dec 2024 07:31:46 GMT"},{"version":"v2","created":"Fri, 27 Dec 2024 16:13:36 GMT"}],"updateDate":"2024-12-30","timestamp":1734161506000,"abstract":"  Most existing tests in the literature for model checking do not work in high\ndimension settings due to challenges arising from the \"curse of\ndimensionality\", or dependencies on the normality of parameter estimators. To\naddress these challenges, we proposed a new goodness of fit test based on\nrandom projections for generalized linear models, when the dimension of\ncovariates may substantially exceed the sample size. The tests only require the\nconvergence rate of parameter estimators to derive the limiting distribution.\nThe growing rate of the dimension is allowed to be of exponential order in\nrelation to the sample size. As random projection converts covariates to\none-dimensional space, our tests can detect the local alternative departing\nfrom the null at the rate of $n^{-1/2}h^{-1/4}$ where $h$ is the bandwidth, and\n$n$ is the sample size. This sensitive rate is not related to the dimension of\ncovariates, and thus the \"curse of dimensionality\" for our tests would be\nlargely alleviated. An interesting and unexpected result is that for randomly\nchosen projections, the resulting test statistics can be asymptotic\nindependent. We then proposed combination methods to enhance the power\nperformance of the tests. Detailed simulation studies and a real data analysis\nare conducted to illustrate the effectiveness of our methodology.\n","subjects":["Statistics/Methodology","Mathematics/Statistics Theory","Statistics/Statistics Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"PXUZGjMeasDLvLGpuX8PwLy35944FtdFXzm8K2cNm_g","pdfSize":"916916"}