{"id":"2412.19693","title":"Wannier states and spin supersolid physics in the triangular\n  antiferromagnet K$_2$Co(SeO$_3$)$_2$","authors":"M. Zhu, Leandro M. Chinellato, V. Romerio, N. Murai, S.\n  Ohira-Kawamura, Christian Balz, Z. Yan, S. Gvasaliya, Yasuyuki Kato, C. D.\n  Batista, and A. Zheludev","authorsParsed":[["Zhu","M.",""],["Chinellato","Leandro M.",""],["Romerio","V.",""],["Murai","N.",""],["Ohira-Kawamura","S.",""],["Balz","Christian",""],["Yan","Z.",""],["Gvasaliya","S.",""],["Kato","Yasuyuki",""],["Batista","C. D.",""],["Zheludev","A.",""]],"versions":[{"version":"v1","created":"Fri, 27 Dec 2024 15:40:31 GMT"}],"updateDate":"2024-12-30","timestamp":1735314031000,"abstract":"  We use a combination of ultra-high-resolution inelastic neutron scattering\nand Monte Carlo numerical simulations to study the thermodynamics and the\nstructure of spin excitations in the spin-supersolid phase of the triangular\nlattice XXZ easy axis antiferromagnet K$_2$Co(SeO$_3$)$_2$ and its evolution in\na magnetic field. BKT transitions heralding the onset of Ising and supersolid\norder are detected. Above the supersolid phase the value of Wannier entropy is\nexperimentally recovered. At low temperatures, with an experimental resolution\nof about 23 $\\mu$eV, no discrete coherent magnon modes are resolved within a\nbroad continuum of scattering. In addition to gapless excitations, a\npseudo-Goldstone mode with a small energy gap of 0.06 meV is found. A second\nexcitation continuum is seen at higher energy, in place of single-spin-flip\nexcitations of the Ising model. In applied fields the continuum gradually\nmorphs into coherent spin waves, with the Goldstone and pseudo-Goldstone\nsectors showing distinct evolution. The agreement between experiment and\nnumerical simulations is excellent on the quantitative level.\n","subjects":["Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"C4PiIgbPvjql3mCp_fL9l58twl2bVqACRN3VCzAQkw8","pdfSize":"8153778"}