{
  "id": "2412.05674",
  "title": "No-Free-Lunch Theories for Tensor-Network Machine Learning Models",
  "authors": "Jing-Chuan Wu, Qi Ye, Dong-Ling Deng, Li-Wei Yu",
  "authorsParsed": [
    [
      "Wu",
      "Jing-Chuan",
      ""
    ],
    [
      "Ye",
      "Qi",
      ""
    ],
    [
      "Deng",
      "Dong-Ling",
      ""
    ],
    [
      "Yu",
      "Li-Wei",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 7 Dec 2024 14:41:24 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733582484000,
  "abstract": "  Tensor network machine learning models have shown remarkable versatility in\ntackling complex data-driven tasks, ranging from quantum many-body problems to\nclassical pattern recognitions. Despite their promising performance, a\ncomprehensive understanding of the underlying assumptions and limitations of\nthese models is still lacking. In this work, we focus on the rigorous\nformulation of their no-free-lunch theorem -- essential yet notoriously\nchallenging to formalize for specific tensor network machine learning models.\nIn particular, we rigorously analyze the generalization risks of learning\ntarget output functions from input data encoded in tensor network states. We\nfirst prove a no-free-lunch theorem for machine learning models based on matrix\nproduct states, i.e., the one-dimensional tensor network states. Furthermore,\nwe circumvent the challenging issue of calculating the partition function for\ntwo-dimensional Ising model, and prove the no-free-lunch theorem for the case\nof two-dimensional projected entangled-pair state, by introducing the\ncombinatorial method associated to the \"puzzle of polyominoes\". Our findings\nreveal the intrinsic limitations of tensor network-based learning models in a\nrigorous fashion, and open up an avenue for future analytical exploration of\nboth the strengths and limitations of quantum-inspired machine learning\nframeworks.\n",
  "subjects": [
    "Physics/Quantum Physics",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Data Structures and Algorithms",
    "Computer Science/Machine Learning",
    "Statistics/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "z6v3Ya4HKpVqvvws31njyKOlRyZOnKMcMB2NkcKpFHU",
  "pdfSize": "4207136"
}