{"id":"2412.15171","title":"SqueezeMe: Mobile-Ready Distillation of Gaussian Full-Body Avatars","authors":"Forrest Iandola, Stanislav Pidhorskyi, Igor Santesteban, Divam Gupta,\n  Anuj Pahuja, Nemanja Bartolovic, Frank Yu, Emanuel Garbin, Tomas Simon,\n  Shunsuke Saito","authorsParsed":[["Iandola","Forrest",""],["Pidhorskyi","Stanislav",""],["Santesteban","Igor",""],["Gupta","Divam",""],["Pahuja","Anuj",""],["Bartolovic","Nemanja",""],["Yu","Frank",""],["Garbin","Emanuel",""],["Simon","Tomas",""],["Saito","Shunsuke",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 18:46:55 GMT"},{"version":"v2","created":"Sat, 21 Dec 2024 00:13:54 GMT"},{"version":"v3","created":"Mon, 17 Feb 2025 23:29:25 GMT"}],"updateDate":"2025-02-19","timestamp":1734634015000,"abstract":"  Gaussian-based human avatars have achieved an unprecedented level of visual\nfidelity. However, existing approaches based on high-capacity neural networks\ntypically require a desktop GPU to achieve real-time performance for a single\navatar, and it remains non-trivial to animate and render such avatars on mobile\ndevices including a standalone VR headset due to substantially limited memory\nand computational bandwidth. In this paper, we present SqueezeMe, a simple and\nhighly effective framework to convert high-fidelity 3D Gaussian full-body\navatars into a lightweight representation that supports both animation and\nrendering with mobile-grade compute. Our key observation is that the decoding\nof pose-dependent Gaussian attributes from a neural network creates\nnon-negligible memory and computational overhead. Inspired by blendshapes and\nlinear pose correctives widely used in Computer Graphics, we address this by\ndistilling the pose correctives learned with neural networks into linear\nlayers. Moreover, we further reduce the parameters by sharing the correctives\namong nearby Gaussians. Combining them with a custom splatting pipeline based\non Vulkan, we achieve, for the first time, simultaneous animation and rendering\nof 3 Gaussian avatars in real-time (72 FPS) on a Meta Quest 3 VR headset.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0rKJ9WvhMKlz5hwiolIv2UKQNoOZCNJAUyVeXHm9VIs","pdfSize":"5549223"}