{"id":"2412.06841","title":"The Helicobacter pylori AI-Clinician: Harnessing Artificial Intelligence\n  to Personalize H. pylori Treatment Recommendations","authors":"Kyle Higgins, Olga P. Nyssen, Joshua Southern, Ivan Laponogov, AIDA\n  CONSORTIUM, Dennis Veselkov, Javier P. Gisbert, Tania Fleitas Kanonnikoff,\n  and Kirill Veselkov","authorsParsed":[["Higgins","Kyle",""],["Nyssen","Olga P.",""],["Southern","Joshua",""],["Laponogov","Ivan",""],["CONSORTIUM","AIDA",""],["Veselkov","Dennis",""],["Gisbert","Javier P.",""],["Kanonnikoff","Tania Fleitas",""],["Veselkov","Kirill",""]],"versions":[{"version":"v1","created":"Sat, 7 Dec 2024 12:57:10 GMT"}],"updateDate":"2024-12-11","timestamp":1733576230000,"abstract":"  Helicobacter pylori (H. pylori) is the most common carcinogenic pathogen\nworldwide. Infecting roughly 1 in 2 individuals globally, it is the leading\ncause of peptic ulcer disease, chronic gastritis, and gastric cancer. To\ninvestigate whether personalized treatments would be optimal for patients\nsuffering from infection, we developed the H. pylori AI-clinician\nrecommendation system. This system was trained on data from tens of thousands\nof H. pylori-infected patients from Hp-EuReg, orders of magnitude greater than\nthose experienced by a single real-world clinician. We first used a simulated\ndataset and demonstrated the ability of our AI Clinician method to identify\npatient subgroups that would benefit from differential optimal treatments.\nNext, we trained the AI Clinician on Hp-EuReg, demonstrating the AI Clinician\nreproduces known quality estimates of treatments, for example bismuth and\nquadruple therapies out-performing triple, with longer durations and higher\ndose proton pump inhibitor (PPI) showing higher quality estimation on average.\nNext we demonstrated that treatment was optimized by recommended personalized\ntherapies in patient subsets, where 65% of patients were recommended a bismuth\ntherapy of either metronidazole, tetracycline, and bismuth salts with PPI, or\nbismuth quadruple therapy with clarithromycin, amoxicillin, and bismuth salts\nwith PPI, and 15% of patients recommended a quadruple non-bismuth therapy of\nclarithromycin, amoxicillin, and metronidazole with PPI. Finally, we determined\ntrends in patient variables driving the personalized recommendations using\nrandom forest modelling. With around half of the world likely to experience H.\npylori infection at some point in their lives, the identification of\npersonalized optimal treatments will be crucial in both gastric cancer\nprevention and quality of life improvements for countless individuals\nworldwide.\n","subjects":["Quantitative Biology/Quantitative Methods","Computer Science/Artificial Intelligence","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"sdGae_75Ias7GThuj_O0iAmLPBlHP47EAQUnyQyjd2I","pdfSize":"1590590"}