{
  "id": "2412.02542",
  "title": "Unveiling Concept Attribution in Diffusion Models",
  "authors": "Quang H. Nguyen, Hoang Phan, Khoa D. Doan",
  "authorsParsed": [
    [
      "Nguyen",
      "Quang H.",
      ""
    ],
    [
      "Phan",
      "Hoang",
      ""
    ],
    [
      "Doan",
      "Khoa D.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 16:34:49 GMT"
    }
  ],
  "updateDate": "2024-12-04",
  "timestamp": 1733243689000,
  "abstract": "  Diffusion models have shown remarkable abilities in generating realistic and\nhigh-quality images from text prompts. However, a trained model remains\nblack-box; little do we know about the role of its components in exhibiting a\nconcept such as objects or styles. Recent works employ causal tracing to\nlocalize layers storing knowledge in generative models without showing how\nthose layers contribute to the target concept. In this work, we approach the\nmodel interpretability problem from a more general perspective and pose a\nquestion: \\textit{``How do model components work jointly to demonstrate\nknowledge?''}. We adapt component attribution to decompose diffusion models,\nunveiling how a component contributes to a concept. Our framework allows\neffective model editing, in particular, we can erase a concept from diffusion\nmodels by removing positive components while remaining knowledge of other\nconcepts. Surprisingly, we also show there exist components that contribute\nnegatively to a concept, which has not been discovered in the knowledge\nlocalization approach. Experimental results confirm the role of positive and\nnegative components pinpointed by our framework, depicting a complete view of\ninterpreting generative models. Our code is available at\n\\url{https://github.com/mail-research/CAD-attribution4diffusion}\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "1bvyj89SucgpeXzFMj-z_F9cSoSPDMApQu5v2F0XWVk",
  "pdfSize": "27707572"
}