{"id":"2412.12017","title":"Evidence for the spin-kick alignment of pulsars from the statistics of\n  their magnetic inclinations","authors":"Anton Biryukov, Gregory Beskin","authorsParsed":[["Biryukov","Anton",""],["Beskin","Gregory",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 17:41:50 GMT"}],"updateDate":"2024-12-17","timestamp":1734370910000,"abstract":"  Isolated neutron stars are thought to receive a natal kick velocity at birth\nnearly aligned with their spin axis. Direct observational confirmation of this\nalignment has been limited to a single source in a supernova remnant (PSR\nJ0538+2817) whose three-dimensional velocity has been well-constrained. Pulsar\npolarisation statistical properties indicate the presence of a spin-kick\ncorrelation, but aligned and orthogonal cases remain plausible. However, if the\nthree-dimensional velocities of radiopulsars are indeed predominantly aligned\nwith their spin axes, a systematic difference in the observed transverse\nvelocities of pulsars with small and large magnetic obliquities would be\nexpected. In particular, due to projection effects, weakly oblique rotators\nshould show systematically smaller and less scattered transverse velocities. In\ncontrast, transverse velocities of pulsars with large obliquities should be\nclose to their actual three-dimensional velocities. This study analyzed samples\nof 13 weakly and 25 strongly oblique pulsars with known distances and proper\nmotions. We find their peculiar velocities being distributed differently with\nthe statistical confidence of 0.007 and 0.016 according to Anderson-Darling and\nKolmogorov-Smirnov tests, respectively. We performed a detailed population\nsynthesis of the isolated pulsars, considering the evolution of their viewing\ngeometry in both isotropic and spin-aligned kick scenarios. The observed split\nin the transverse velocity distributions and its amplitude are consistent with\nthe spin-aligned kick model but not the isotropic case. At the same time, an\northogonal kick predicts a similar effect but of the opposite sign. This\nprovides robust support for pulsar spin-kick alignment based on their\nstatistics and independent of their polarization properties.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"d1AIZHm5uKMbeKdjjgCzgX8GSezE36ldVVXOeTnVIMQ","pdfSize":"962485"}