{"id":"2412.12590","title":"Integrated Sensing and Communications in Downlink FDD MIMO without CSI\n  Feedback","authors":"Namhyun Kim, Juntaek Han, Jinseok Choi, Ahmed Alkhateeb, Chan-Byoung\n  Chae, and Jeonghun Park","authorsParsed":[["Kim","Namhyun",""],["Han","Juntaek",""],["Choi","Jinseok",""],["Alkhateeb","Ahmed",""],["Chae","Chan-Byoung",""],["Park","Jeonghun",""]],"versions":[{"version":"v1","created":"Tue, 17 Dec 2024 06:46:46 GMT"}],"updateDate":"2024-12-18","timestamp":1734418006000,"abstract":"  In this paper, we propose a precoding framework for frequency division duplex\n(FDD) integrated sensing and communication (ISAC) systems with multiple-input\nmultiple-output (MIMO). Specifically, we aim to maximize ergodic sum spectral\nefficiency (SE) while satisfying a sensing beam pattern constraint defined by\nthe mean squared error (MSE). Our method reconstructs downlink (DL) channel\nstate information (CSI) from uplink (UL) training signals using partial\nreciprocity, eliminating the need for CSI feedback. To mitigate interference\ncaused by imperfect DL CSI reconstruction and sensing operations, we adopt\nrate-splitting multiple access (RSMA). We observe that the error covariance\nmatrix of the reconstructed channel effectively compensates for CSI\nimperfections, affecting both communication and sensing performance. To obtain\nthis, we devise an observed Fisher information-based estimation technique. We\nthen optimize the precoder by solving the Karush-Kuhn-Tucker (KKT) conditions,\njointly updating the precoding vector and Lagrange multipliers, and solving the\nnonlinear eigenvalue problem with eigenvector dependency to maximize SE. The\nnumerical results show that the proposed design achieves precise beam pattern\ncontrol, maximizes SE, and significantly improves the sensing-communication\ntrade-off compared to the state-of-the-art methods in FDD ISAC scenarios.\n","subjects":["Computer Science/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"Lk70lKduKJkwLA9_7S56E_HjRP4g7IEZMuJJwMZCu08","pdfSize":"1036786"}