{"id":"2412.09183","title":"Dimensionality Reduction Techniques for Global Bayesian Optimisation","authors":"Luo Long, Coralia Cartis, Paz Fink Shustin","authorsParsed":[["Long","Luo",""],["Cartis","Coralia",""],["Shustin","Paz Fink",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 11:27:27 GMT"}],"updateDate":"2024-12-13","timestamp":1734002847000,"abstract":"  Bayesian Optimisation (BO) is a state-of-the-art global optimisation\ntechnique for black-box problems where derivative information is unavailable,\nand sample efficiency is crucial. However, improving the general scalability of\nBO has proved challenging. Here, we explore Latent Space Bayesian Optimisation\n(LSBO), that applies dimensionality reduction to perform BO in a\nreduced-dimensional subspace. While early LSBO methods used (linear) random\nprojections (Wang et al., 2013), we employ Variational Autoencoders (VAEs) to\nmanage more complex data structures and general DR tasks. Building on Grosnit\net. al. (2021), we analyse the VAE-based LSBO framework, focusing on VAE\nretraining and deep metric loss. We suggest a few key corrections in their\nimplementation, originally designed for tasks such as molecule generation, and\nreformulate the algorithm for broader optimisation purposes. Our numerical\nresults show that structured latent manifolds improve BO performance.\nAdditionally, we examine the use of the Mat\\'{e}rn-$\\frac{5}{2}$ kernel for\nGaussian Processes in this LSBO context. We also integrate Sequential Domain\nReduction (SDR), a standard global optimization efficiency strategy, into BO.\nSDR is included in a GPU-based environment using \\textit{BoTorch}, both in the\noriginal and VAE-generated latent spaces, marking the first application of SDR\nwithin LSBO.\n","subjects":["Mathematics/Optimization and Control","Computer Science/Machine Learning","Computer Science/Numerical Analysis","Mathematics/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"vJcW2z1ZqxrIkukRN_Y0PDPiGhiy4PLfWeJNqPPrqJI","pdfSize":"869299"}