{
  "id": "2412.18133",
  "title": "$N$-photon bundles emission in high-spin Jaynes-Cummings model",
  "authors": "Huanhuan Wei, Jing Tang, and Yuangang Deng",
  "authorsParsed": [
    [
      "Wei",
      "Huanhuan",
      ""
    ],
    [
      "Tang",
      "Jing",
      ""
    ],
    [
      "Deng",
      "Yuangang",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 24 Dec 2024 03:42:19 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1735011739000,
  "abstract": "  High-spin quantum systems, endowed with rich internal degrees of freedom,\nconstitute a promising platform for manipulating high-quality $n$-photon\nstates. In this study, we explore $n$-photon bundles emission by constructing a\nhigh-spin Jaynes-Cummings model (JCM) within a single-mode cavity interacting\nwith a single spin-$3/2$ atom. Our analysis reveals that the $n$-photon dressed\nstate splittings can be significantly enhanced by adjusting the linear Zeeman\nshift inherent to the internal degrees of freedom in high-spin systems, thereby\nyielding well-resolved $n$-photon resonance. The markedly enhanced\nenergy-spectrum anharmonicity, stemming from strong nonlinearities, enables the\nrealization of high-quality $n$-photon bundles emission with large steady-state\nphoton numbers, in contrast to conventional spin-1/2 JCM setups. Of particular\ninterest is the realization of an optical multimode transducer capable of\ntransitioning among single-photon blockade, two- to four-photon bundles\nemission, and photon-induced tunneling by tuning the light-cavity detuning in\nthe presence of both cavity and atomic pump fields. This work unveils\nsignificant opportunities for diverse applications in nonclassical all-optical\nswitching and high-quality multiphoton sources, deepening our understanding of\ncreating specialized nonclassical states and fundamental physics in high-spin\natom-cavity systems.\n",
  "subjects": [
    "Condensed Matter/Quantum Gases"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "JkMShsPVHLLB4tp8x5SG7qsYzNwiV0oppc2Ai4q4Npo",
  "pdfSize": "998081"
}