{
  "id": "2412.04830",
  "title": "Cosmological constraints on dark energy models using DESI BAO 2024",
  "authors": "Jie Zheng, Da-Chun Qiang, and Zhi-Qiang You",
  "authorsParsed": [
    [
      "Zheng",
      "Jie",
      ""
    ],
    [
      "Qiang",
      "Da-Chun",
      ""
    ],
    [
      "You",
      "Zhi-Qiang",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 07:48:33 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733471313000,
  "abstract": "  Recently, the measurements of baryon acoustic oscillations (BAO) by the Dark\nEnergy Spectroscopic Instrument (DESI) indicate a potential deviation from the\nstandard $\\Lambda$CDM model. Some studies suggest that the data points from the\nluminous red galaxies (LRG) survey in DESI BAO data may contribute to this\ndiscrepancy. In this work, our main goal is to investigate whether this\ndeviation is caused by the parameterization of the equation of state (EoS) of\ndark energy (DE). Hence, we have examined four popular parameterized dark\nenergy models in our analysis: the Chevallier-Polarski-Linder (CPL),\nBarboza-Alcaniz (BA), Jassal-Bagla-Padmanabhan (JBP), and Feng-Shen-Li-Li\n(FSLL) parameterizations. Considering that LRG1 and LRG2 data points may lead\nto deviation from the $\\Lambda$CDM model, we use two versions of DESI BAO data,\ndiffering in whether these data points are included. Additionally, to break the\nparameter degeneracies and obtain robust constraint results, we introduce Type\nIa supernovae (SNe Ia) and quasars (QSO) in our analysis. Our findings indicate\nthat in these parameterizations, the deviation from ($w_0$,$w_{1}$)=(-1,0)\nbecomes more pronounced when using the combined data from DESI BAO, SNe Ia, and\nQSO compilations. Here, $w_{0}$ and $w_{1}$ represent the EoS of DE. It\nsuggests that the parameterizations of the EoS of DE have little impact on the\ndeviation from the $\\Lambda$CDM model. Besides, our analysis potentially hints\nthat dark energy may have dynamic properties. In addition, the results obtained\nfrom different BAO datasets demonstrate that the LRG1 and LRG2 data points do\nindeed contribute to a deviation from the $\\Lambda$CDM model. Finally,\naccording to the statistical criteria, the Akaike Information Criterion (AIC)\nand the Bayesian Information Criterion (BIC), the joint constraints provide\nsubstantial observational support to the BA and FSLL models.\n",
  "subjects": [
    "Astrophysics/Cosmology and Nongalactic Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "08KcZ6FbTRanq_0WbWNFMKZJxQrYwWP6B5nD2nXuePE",
  "pdfSize": "3677624"
}