{"id":"2412.03802","title":"On-Chip Enhanced Biphoton Generation with Incoherent Light","authors":"Yue-Wei Song, Heng Zhao, Li Chen, Yin-Hai Li, Wu-Zhen Li, Ming-Yuan\n  Gao, Ren-Hui Chen, Zhao-Qi-Zhi Han, Meng-Yu Xie, Zhi-Yuan Zhou, Bao-Sen Shi","authorsParsed":[["Song","Yue-Wei",""],["Zhao","Heng",""],["Chen","Li",""],["Li","Yin-Hai",""],["Li","Wu-Zhen",""],["Gao","Ming-Yuan",""],["Chen","Ren-Hui",""],["Han","Zhao-Qi-Zhi",""],["Xie","Meng-Yu",""],["Zhou","Zhi-Yuan",""],["Shi","Bao-Sen",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 01:45:27 GMT"}],"updateDate":"2024-12-06","timestamp":1733363127000,"abstract":"  On-chip quantum photon sources are pivotal components in integrated\nphotonics, driving significant advancements in quantum information technologies\nover recent decades. Traditionally, the coherence of the pump beam has been\nconsidered a critical property in ensuring the quality of the source. In this\nwork, we produce a photon-pair source via spontaneous four-wave mixing pumped\nby temporally incoherent light in a standard silicon nanowire. Compared to a\ncoherent laser, the incoherence improves pump utilization efficiency, which\nresults in higher source brightness. Additionally, its spectrally uncorrelated\nnature of incoherent light is transferred to the generated photon source,\nallowing high-purity state preparation without the need for narrow filtering.\nExperimentally, we demonstrate the advantages using an amplified spontaneous\nemission source over a continuous-wave laser. With temporally incoherent\npumping, the photon pair generation rate increases by 40%. The\ncoincidence-to-accidental ratio and heralded second-order autocorrelation\nexhibit improved performance at low power. Our work expands the scope of\nincoherently pumped quantum states and provides a method for generating photon\nsources using a more readily accessible light.\n","subjects":["Physics/Quantum Physics","Physics/Optics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"I8WI6m8P7g9SngLQu_olt6uKOUkRJcP6D_mdbncAuYw","pdfSize":"4960909"}