{"id":"2412.14514","title":"Enhanced second-order sideband generation and slow-fast light via\n  coupled opto- and magnomechanical microspheres","authors":"Abdul Wahab, Muqaddar Abbas, Xiaosen Yang, Yuee Xie and Yuanping Chen","authorsParsed":[["Wahab","Abdul",""],["Abbas","Muqaddar",""],["Yang","Xiaosen",""],["Xie","Yuee",""],["Chen","Yuanping",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 04:26:17 GMT"}],"updateDate":"2024-12-20","timestamp":1734582377000,"abstract":"  In this research, we investigate second-order sideband generation (SSG) and\nslow-fast light using a hybrid system comprised of two coupled opto- and\nmagnomechanical microspheres, namely a YIG sphere and a silica sphere. The YIG\nsphere hosts a magnon mode and a vibration mode induced by magnetostriction,\nwhereas the silica sphere has an optical whispering gallery mode and a\nmechanical mode coupled via optomechanical interaction. The mechanical modes of\nboth spheres are close in frequency and are coherently coupled by the\nstraightway physical contact between the two microspheres. We use a\nperturbation approach to solve the Heisenberg-Langevin equations, offering an\nanalytical framework for transmission rate and SSG. Using experimentally\nfeasible settings, we demonstrate that the transmission rate and SSG are\nstrongly dependent on the magnomechanical, optomechanical, and mechanics\nmechanics coupling strengths (MMCS) between the two microspheres. The numerical\nresults show that increasing the MMCS can enhance both the transmission rate\nand SSG efficiency, resulting in gain within our system. Our findings, in\nparticular, reveal that the efficiency of the SSG can be effectively controlled\nby cavity detuning, decay rate, and pump power. Notably, our findings suggest\nthat modifying the system parameters can alter the group delay, thereby\nregulating the transition between fast and slow light propagation, and vice\nversa. Our protocol provides guidelines for manipulating nonlinear optical\nproperties and controlling light propagation, with applications including\noptical switching, information storage, and precise measurement of weak\nsignals.\n","subjects":["Physics/Optics","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"36L21a-rNU9xNRVTALSxJNnlaFE8s0afeA5lFbchzFk","pdfSize":"1131857"}