{
  "id": "2412.00859",
  "title": "Magnetically tuned topological phase in graphene nanoribbon\n  heterojunctions",
  "authors": "Wei-Jian Li, Da-Fei Sun, Sheng Ju, Ai-Lei He, and Yuan Zhou",
  "authorsParsed": [
    [
      "Li",
      "Wei-Jian",
      ""
    ],
    [
      "Sun",
      "Da-Fei",
      ""
    ],
    [
      "Ju",
      "Sheng",
      ""
    ],
    [
      "He",
      "Ai-Lei",
      ""
    ],
    [
      "Zhou",
      "Yuan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 1 Dec 2024 15:47:33 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733068053000,
  "abstract": "  The interplay between topology and magnetism often triggers the exotic\nquantum phases. Here, we report an accessible scheme to engineer the robust\n$\\mathbb{Z}_{2}$ topology by intrinsic magnetism, originating from the zigzag\nsegment connecting two armchair segments with different width, in\none-dimensional graphene nanoribbon heterojunctions. Our first-principle and\nmodel simulations reveal that the emergent spin polarization substantially\nmodifies the dimerization between junction states, forming the special SSH\nmechanism depending on the magnetic configurations. Interestingly, the\ntopological phase in magnetic state is only determined by the width of the\nnarrow armchair segment, in sharp contrast with that in the normal state. In\naddition, the emergent magnetism increases the bulk energy band gap by an order\nof magnitude than that in the nonmagnetic state. We also discuss the\n$\\mathbb{Z}$ topology of the junction states and the termination-dependent of\ntopological end states. Our results bring new way to tune the topology in\ngraphene nanoribbon heterostructure, providing a new platform for future\none-dimensional topological devices and molecular-scale spintronics.\n",
  "subjects": [
    "Condensed Matter/Mesoscale and Nanoscale Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "yxa7uxfT-mQUzcLheQjkISxzfYyqaMxAEtNXPkdf6F0",
  "pdfSize": "13316332"
}