{
  "id": "2412.14006",
  "title": "InstructSeg: Unifying Instructed Visual Segmentation with Multi-modal\n  Large Language Models",
  "authors": "Cong Wei, Yujie Zhong, Haoxian Tan, Yingsen Zeng, Yong Liu, Zheng\n  Zhao, Yujiu Yang",
  "authorsParsed": [
    [
      "Wei",
      "Cong",
      ""
    ],
    [
      "Zhong",
      "Yujie",
      ""
    ],
    [
      "Tan",
      "Haoxian",
      ""
    ],
    [
      "Zeng",
      "Yingsen",
      ""
    ],
    [
      "Liu",
      "Yong",
      ""
    ],
    [
      "Zhao",
      "Zheng",
      ""
    ],
    [
      "Yang",
      "Yujiu",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 16:20:40 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734538840000,
  "abstract": "  Boosted by Multi-modal Large Language Models (MLLMs), text-guided universal\nsegmentation models for the image and video domains have made rapid progress\nrecently. However, these methods are often developed separately for specific\ndomains, overlooking the similarities in task settings and solutions across\nthese two areas. In this paper, we define the union of referring segmentation\nand reasoning segmentation at both the image and video levels as Instructed\nVisual Segmentation (IVS). Correspondingly, we propose InstructSeg, an\nend-to-end segmentation pipeline equipped with MLLMs for IVS. Specifically, we\nemploy an object-aware video perceiver to extract temporal and object\ninformation from reference frames, facilitating comprehensive video\nunderstanding. Additionally, we introduce vision-guided multi-granularity text\nfusion to better integrate global and detailed text information with\nfine-grained visual guidance. By leveraging multi-task and end-to-end training,\nInstructSeg demonstrates superior performance across diverse image and video\nsegmentation tasks, surpassing both segmentation specialists and MLLM-based\nmethods with a single model. Our code is available at\nhttps://github.com/congvvc/InstructSeg.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "aR4zSFEQndGMmaEQre4W8sbFBGZVr52CkUlnqfuLFho",
  "pdfSize": "8233728"
}