{
  "id": "2412.09271",
  "title": "Journey of complex organic molecules: Formation and transport in\n  protoplanetary disks",
  "authors": "T. Benest Couzinou, O. Mousis, G. Danger, A. Schneeberger, A.\n  Aguichine and A. Bouquet",
  "authorsParsed": [
    [
      "Couzinou",
      "T. Benest",
      ""
    ],
    [
      "Mousis",
      "O.",
      ""
    ],
    [
      "Danger",
      "G.",
      ""
    ],
    [
      "Schneeberger",
      "A.",
      ""
    ],
    [
      "Aguichine",
      "A.",
      ""
    ],
    [
      "Bouquet",
      "A.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 13:32:37 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1734010357000,
  "abstract": "  Complex organic molecules serve as indicators of molecular diversity. Their\ndetection on comets, planets, and moons has prompted inquiries into their\norigins, particularly the conditions conducive to their formation. One\nhypothesis suggests that the UV irradiation of icy grains in the protosolar\nnebula generates significant molecular complexity, a hypothesis supported by\nexperiments on methanol ice irradiation. We investigated the irradiation of\nmethanol ice particles as they migrate through the protosolar nebula. Our\nobjective is to ascertain whether the encountered conditions facilitate the\nformation of complex organics molecules, and we leverage experimental data in\nour analysis. We developed a two-dimensional model that describes the transport\nof pebbles during the evolution of the protosolar nebula, employing a\nLagrangian scheme. This model computes the interstellar UV flux received by the\nparticles along their paths, which we compared with experimental values. On\naverage, particles ranging from 1 to 100 micrometers in size, released at a\nlocal temperature of 20 K, undergo adequate irradiation to attain the same\nmolecular diversity as methanol ice during the experiments within timescales of\n25 kyr of protosolar nebula evolution. In contrast, 1 cm sized particles\nrequire 911 kyr of irradiation to reach similar molecular diversity, making\ncomparable molecular complexity unlikely. Similarly, particles ranging from 1\nto 100 micrometers in size, released at a local temperature of 80 K, receive\nsufficient irradiation after 141 and 359 kyr. The particles readily receive the\nirradiation dose necessary to generate the molecular diversity observed in the\nexperiments within the outer regions of the disk. Our model, combined with\nfuture irradiation experiments, can provide additional insights into the\nspecific regions where the building blocks of planets form.\n",
  "subjects": [
    "Astrophysics/Earth and Planetary Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "HR4Oq4EOFfXCSIYdNX7CRC73LrUMFbkPeRPiQkGhqIM",
  "pdfSize": "4562591"
}