{"id":"2412.11683","title":"Multimodal LLM for Intelligent Transportation Systems","authors":"Dexter Le, Aybars Yunusoglu, Karn Tiwari, Murat Isik, I. Can Dikmen","authorsParsed":[["Le","Dexter",""],["Yunusoglu","Aybars",""],["Tiwari","Karn",""],["Isik","Murat",""],["Dikmen","I. Can",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 11:50:30 GMT"}],"updateDate":"2024-12-17","timestamp":1734349830000,"abstract":"  In the evolving landscape of transportation systems, integrating Large\nLanguage Models (LLMs) offers a promising frontier for advancing intelligent\ndecision-making across various applications. This paper introduces a novel\n3-dimensional framework that encapsulates the intersection of applications,\nmachine learning methodologies, and hardware devices, particularly emphasizing\nthe role of LLMs. Instead of using multiple machine learning algorithms, our\nframework uses a single, data-centric LLM architecture that can analyze time\nseries, images, and videos. We explore how LLMs can enhance data interpretation\nand decision-making in transportation. We apply this LLM framework to different\nsensor datasets, including time-series data and visual data from sources like\nOxford Radar RobotCar, D-Behavior (D-Set), nuScenes by Motional, and Comma2k19.\nThe goal is to streamline data processing workflows, reduce the complexity of\ndeploying multiple models, and make intelligent transportation systems more\nefficient and accurate. The study was conducted using state-of-the-art\nhardware, leveraging the computational power of AMD RTX 3060 GPUs and Intel\ni9-12900 processors. The experimental results demonstrate that our framework\nachieves an average accuracy of 91.33\\% across these datasets, with the highest\naccuracy observed in time-series data (92.7\\%), showcasing the model's\nproficiency in handling sequential information essential for tasks such as\nmotion planning and predictive maintenance. Through our exploration, we\ndemonstrate the versatility and efficacy of LLMs in handling multimodal data\nwithin the transportation sector, ultimately providing insights into their\napplication in real-world scenarios. Our findings align with the broader\nconference themes, highlighting the transformative potential of LLMs in\nadvancing transportation technologies.\n","subjects":["Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Yx-417jol3k-kD0Yiu-pK6vIuHZuz_ZQ-_ULRcUQAt0","pdfSize":"496050"}