{
  "id": "2412.00065",
  "title": "DYRECT Computed Tomography: DYnamic Reconstruction of Events on a\n  Continuous Timescale",
  "authors": "Wannes Goethals, Tom Bultreys, Steffen Berg, Matthieu N. Boone, Jan\n  Aelterman",
  "authorsParsed": [
    [
      "Goethals",
      "Wannes",
      ""
    ],
    [
      "Bultreys",
      "Tom",
      ""
    ],
    [
      "Berg",
      "Steffen",
      ""
    ],
    [
      "Boone",
      "Matthieu N.",
      ""
    ],
    [
      "Aelterman",
      "Jan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 15 Nov 2024 14:21:46 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1731680506000,
  "abstract": "  Time-resolved high-resolution X-ray Computed Tomography (4D $\\mu$CT) is an\nimaging technique that offers insight into the evolution of dynamic processes\ninside materials that are opaque to visible light. Conventional tomographic\nreconstruction techniques are based on recording a sequence of 3D images that\nrepresent the sample state at different moments in time. This frame-based\napproach limits the temporal resolution compared to dynamic radiography\nexperiments due to the time needed to make CT scans. Moreover, it leads to an\ninflation of the amount of data and thus to costly post-processing computations\nto quantify the dynamic behaviour from the sequence of time frames, hereby\noften ignoring the temporal correlations of the sample structure. Our proposed\n4D $\\mu$CT reconstruction technique, named DYRECT, estimates individual\nattenuation evolution profiles for each position in the sample. This leads to a\nnovel memory-efficient event-based representation of the sample, using as\nlittle as three image volumes: its initial attenuation, its final attenuation\nand the transition times. This third volume represents local events on a\ncontinuous timescale instead of the discrete global time frames. We propose a\nmethod to iteratively reconstruct the transition times and the attenuation\nvolumes. The dynamic reconstruction technique was validated on synthetic ground\ntruth data and experimental data, and was found to effectively pinpoint the\ntransition times in the synthetic dataset with a time resolution corresponding\nto less than a tenth of the amount of projections required to reconstruct\ntraditional $\\mu$CT time frames.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Image and Video Processing",
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "dcADMws27CbQ4vK-xBwitT1Crn_6yQ27ZKqVcyOoFrE",
  "pdfSize": "23631644"
}