{
  "id": "2412.00676",
  "title": "Overionized plasma in the supernova remnant Sagittarius A East anchored\n  by XRISM observations",
  "authors": "XRISM Collaboration",
  "authorsParsed": [
    [
      "XRISM Collaboration",
      "",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 1 Dec 2024 05:20:07 GMT"
    },
    {
      "version": "v2",
      "created": "Sat, 14 Dec 2024 17:08:35 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1733030407000,
  "abstract": "  Sagittarius A East is a supernova remnant with a unique surrounding\nenvironment, as it is located in the immediate vicinity of the supermassive\nblack hole at the Galactic center, Sagittarius A*. The X-ray emission of the\nremnant is suspected to show features of overionized plasma, which would\nrequire peculiar evolutionary paths. We report on the first observation of\nSagittarius A East with X-Ray Imaging and Spectroscopy Mission (XRISM).\nEquipped with a combination of high-resolution microcalorimeter spectrometer\nand large field-of-view CCD imager, we for the first time resolved the Fe XXV\nK-shell lines into fine structure lines and measured the forbidden-to-resonance\nintensity ratio to be $1.39\\pm0.12$, which strongly suggests the presence of\noverionized plasma. We obtained a reliable constraint on the ionization\ntemperature just before the transition into the overionization state, to be > 4\nkeV. The recombination timescale was constrained to be < $8\\times10^{11}$\ncm$^{-3}$ s. The small velocity dispersion of $109\\pm6$ km s$^{-1}$ indicates a\nlow Fe ion temperature < 8 keV and a small expansion velocity < 200 km\ns$^{-1}$. The high initial ionization temperature and small recombination\ntimescale suggest that either rapid cooling of the plasma via adiabatic\nexpansion from dense circumstellar material or intense photoionization by\nSagittarius A* in the past may have triggered the overionization.\n",
  "subjects": [
    "Astrophysics/High Energy Astrophysical Phenomena"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "noii3Kmp30Om58STq1GVX4McC9GB1Vs0ZZY8kYVY2Bk",
  "pdfSize": "3268727"
}