{
  "id": "2412.02925",
  "title": "Effects of Landau quantization on neutrino emission and absorption",
  "authors": "Mia Kumamoto, Catherine Welch",
  "authorsParsed": [
    [
      "Kumamoto",
      "Mia",
      ""
    ],
    [
      "Welch",
      "Catherine",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 00:30:37 GMT"
    },
    {
      "version": "v2",
      "created": "Mon, 6 Jan 2025 21:38:37 GMT"
    },
    {
      "version": "v3",
      "created": "Thu, 20 Feb 2025 01:12:28 GMT"
    }
  ],
  "updateDate": "2025-02-21",
  "timestamp": 1733272237000,
  "abstract": "  Some neutron stars known as magnetars possess very strong magnetic fields,\nwith surface fields as large as $10^{15}\\,\\rm G$ and internal fields that are\npossibly stronger. Recent observations of the radio pulsar GLEAM-X J1627\nsuggest it may have a surface field as strong as $10^{16} \\,\\rm G$. In the\npresence of a strong magnetic field, the energy levels of electrons and protons\nare quantized and the Direct Urca process allows neutron stars to cool rapidly,\neven at low density. For the case of magnetic fields $B \\geq 10^{16}\\,\\rm G$,\nwe find features in the emissivity due to energy quantization that are not\ncaptured by the frequently employed quasiclassical approximation where energy\nlevels are treated as nearly continuous. Resonances can result in amplification\nof the neutrino emissivity at specific densities compared to a calculation that\nneglects quantization, particularly at low temperature. These effects are not\nimportant for the thermal evolution of an entire neutron star, but may be\nrelevant for phenomena that depend on behavior at specific densities. We\npresent a fully relativistic calculation of the Direct Urca rate in a strong\nmagnetic field using the standard V-A weak Lagrangian incorporating mean field\nnuclear effects and discuss approaches to the numerical challenge the modified\nwavefunctions present and a new semi-analytic approximation. These tools are\nalso applicable to calculating neutrino opacities in strong magnetic fields in\nthe ejecta of binary neutron star mergers. We calculate the opacities for\nneutrinos capturing on free nucleons at sub-saturation densities and\ntemperatures exceeding an MeV. We find an enhancement to capture processes of\nthe lowest energy neutrinos by an order of magnitude or more due to suppression\nof electron Pauli blocking in the case of capture on neutrons, and from the\neffect of the nucleon magnetic moments in the case of capture on protons.\n",
  "subjects": [
    "Physics/Nuclear Theory",
    "Astrophysics/High Energy Astrophysical Phenomena"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "5EmiieRsvTvk5kRqT9T-ODlX_eQhLVKl_hN4TRdecUI",
  "pdfSize": "2552306"
}