{"id":"2412.01457","title":"Neutrinos from stochastic acceleration in black hole environments","authors":"M. Lemoine (APC), F. Rieger (IPP, U. Heidelberg)","authorsParsed":[["Lemoine","M.","","APC"],["Rieger","F.","","IPP, U. Heidelberg"]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 12:49:03 GMT"}],"updateDate":"2024-12-03","timestamp":1733143743000,"abstract":"  Recent results from the IceCube detector and their phenomenological\ninterpretation suggest that the corona of nearby X-ray luminous Seyfert\ngalaxies can produce $\\sim 1-10\\,$TeV neutrinos via photo-hadronic\ninteractions. We investigate in detail the physics of stochastic acceleration\nin such environments and examine under which conditions one can explain the\ninferred proton spectrum. To do so, we borrow recent findings on particle\nacceleration in turbulence and pay particular attention to the transport\nequation, notably for what concerns transport in momentum space, turbulent\ntransport outside of the corona and advection through the corona. We first\nremark that the spectra obtained are highly sensitive to the value of the\nacceleration rate, e.g., to the Alfv\\'enic velocity. Then we examine three\nprototype scenarios, one describing turbulent acceleration in the test-particle\npicture, one in which particles are pre-accelerated by turbulence and further\nenergized by shear acceleration, and one in which we consider the effect of\nparticle backreaction on the turbulence (damping), which self-regulates the\nacceleration process. We show that it is possible to obtain satisfactory fits\nto the inferred proton spectrum in all three cases, but stress that in the\nfirst two, the energy content in supra-thermal protons has to be fixed in an\nad-hoc manner to match the inferred spectrum, at an energy density close to\nthat contained in the turbulence. Interestingly, self-regulated acceleration by\nturbulence damping naturally brings the suprathermal particle energy content\nclose to that of the turbulence and allows to reproduce the inferred flux level\nwithout additional fine tuning. We suggest that, given the strong sensitivity\nof the maximal proton energy to the acceleration rate, any variation of that\nquantity in the corona could affect, and in fact set the slope of the\nhigh-energy proton spectrum.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"aAhQbK4y0EPyDdZUF59t_mGwS71uqdrvqLy0Oy2lDKU","pdfSize":"596577"}