{"id":"2412.05672","title":"Graph with Sequence: Broad-Range Semantic Modeling for Fake News\n  Detection","authors":"Junwei Yin, Min Gao, Kai Shu, Wentao Li, Yinqiu Huang, Zongwei Wang","authorsParsed":[["Yin","Junwei",""],["Gao","Min",""],["Shu","Kai",""],["Li","Wentao",""],["Huang","Yinqiu",""],["Wang","Zongwei",""]],"versions":[{"version":"v1","created":"Sat, 7 Dec 2024 14:35:46 GMT"},{"version":"v2","created":"Fri, 7 Feb 2025 02:44:58 GMT"}],"updateDate":"2025-02-10","timestamp":1733582146000,"abstract":"  The rapid proliferation of fake news on social media threatens social\nstability, creating an urgent demand for more effective detection methods.\nWhile many promising approaches have emerged, most rely on content analysis\nwith limited semantic depth, leading to suboptimal comprehension of news\ncontent.To address this limitation, capturing broader-range semantics is\nessential yet challenging, as it introduces two primary types of noise: fully\nconnecting sentences in news graphs often adds unnecessary structural noise,\nwhile highly similar but authenticity-irrelevant sentences introduce feature\nnoise, complicating the detection process. To tackle these issues, we propose\nBREAK, a broad-range semantics model for fake news detection that leverages a\nfully connected graph to capture comprehensive semantics while employing dual\ndenoising modules to minimize both structural and feature noise. The semantic\nstructure denoising module balances the graph's connectivity by iteratively\nrefining it between two bounds: a sequence-based structure as a lower bound and\na fully connected graph as the upper bound. This refinement uncovers\nlabel-relevant semantic interrelations structures. Meanwhile, the semantic\nfeature denoising module reduces noise from similar semantics by diversifying\nrepresentations, aligning distinct outputs from the denoised graph and sequence\nencoders using KL-divergence to achieve feature diversification in\nhigh-dimensional space. The two modules are jointly optimized in a bi-level\nframework, enhancing the integration of denoised semantics into a comprehensive\nrepresentation for detection. Extensive experiments across four datasets\ndemonstrate that BREAK significantly outperforms existing fake news detection\nmethods.\n","subjects":["Computer Science/Computation and Language"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"Dg72PG7U-nvG57Yd045sS6x4DzZ2QuFsp7cq3w1ETLg","pdfSize":"1062380"}