{"id":"2412.12323","title":"Revolutionizing $f(Q)$ Gravity Studies: Observational Cosmology through\n  Deep Learning and Bayesian Analysis","authors":"Lokesh Kumar Sharma (1), Suresh Parekh (2) and Anil Kumar Yadav (3)\n  ((1) Department of Physics, GLA University, Mathura, India, (2) Department of\n  Physics, Savitribai Phule Pune University, Pune, Maharashtra, India, (3)\n  Department of Physics, United College of Engineering and Research, Greater\n  Noida, India)","authorsParsed":[["Sharma","Lokesh Kumar",""],["Parekh","Suresh",""],["Yadav","Anil Kumar",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 19:41:46 GMT"},{"version":"v2","created":"Wed, 18 Dec 2024 03:47:13 GMT"}],"updateDate":"2024-12-19","timestamp":1734378106000,"abstract":"  One of the most exciting elements of cosmology is researching the potential\nof anisotropy in the early cosmos. We examine the expansion of the cosmos over\ntime using an anisotropic Bianchi type-I spacetime subjected to the $f(Q)$\ngravity. We do this by limiting the number of cosmological parameters used. The\napproach, we used is known as CoLFI, which stands for \"Estimating Cosmological\nParameters with deep learning.\" This paper presents a revolutionary deep\nlearning-based technique to the parameter inference. The deep learning\nmethodology clearly outperforms the MCMC method in terms of best-fit values,\nparameter errors, and correlations between parameters. This is the result of\ncomparing the two different ways. Moreover, we obtained the transition redshift\n$z_{t} = 0.63$ which leads the transitioning model of the Universe from early\ndeceleration to current acceleration phase. The dynamics of jerk parameter and\nvalidation of energy conditions of the model are also discussed.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"TjJJJ7ZSytszWScnnkn26F1ZUa6y7SHvstAj1OnODbo","pdfSize":"1165524"}