{"id":"2412.17356","title":"Optimal Multi-Level ASK Modulations for RIS-Assisted Communications with\n  Energy-Based Noncoherent Reception","authors":"Sambit Mishra, Soumya P. Dash, and George C. Alexandropoulos","authorsParsed":[["Mishra","Sambit",""],["Dash","Soumya P.",""],["Alexandropoulos","George C.",""]],"versions":[{"version":"v1","created":"Mon, 23 Dec 2024 07:34:55 GMT"}],"updateDate":"2024-12-24","timestamp":1734939295000,"abstract":"  This paper investigates the performance of one- and two-sided amplitude shift\nkeying (ASK) modulations in noncoherent single-input single-output (SISO)\nwireless communication systems assisted by a reconfigurable intelligent surface\n(RIS). Novel noncoherent receiver structures are proposed based on the energy\nof the received symbol and the choice of the modulation scheme for data\ntransmission. The system's performance is assessed in terms of the symbol error\nrate (SER) and an optimization framework is proposed to determine the most\neffective one- and two-sided ASKs to minimize the SER, while adhering to\naverage a transmit power constraint. Two scenarios based on the availability of\nthe statistical characteristics of the wireless channel are explored: a) the\ntransceiver pair has complete knowledge of the channel statistics, and b) both\nend nodes possess knowledge of the statistics of the channel gain up to its\nfourth moment, and novel algorithms are developed to obtain optimal ASKs for\nboth of them. Extensive numerical evaluations are presented showcasing that\nthere exists a threshold signal-to-noise ratio (SNR) above which the optimal\nASKs outperform the traditional equispaced ASKs. The dependencies of the SER\nperformance and the SNR threshold on various system parameters are assessed,\nproviding design guidelines for RIS-assisted noncoherent wireless communication\nsystems with multi-level ASK modulations.\n","subjects":["Computer Science/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"WwDnm7ipSzbtdjrRH97y6OtSRQvuOqCum_Q_SJ7YZjo","pdfSize":"1029363"}