{
  "id": "2412.10249",
  "title": "Stochastic Multiresolution Image Sketching for Inverse Imaging Problems",
  "authors": "Alessandro Perelli, Carola-Bibiane Schonlieb, Matthias J. Ehrhardt",
  "authorsParsed": [
    [
      "Perelli",
      "Alessandro",
      ""
    ],
    [
      "Schonlieb",
      "Carola-Bibiane",
      ""
    ],
    [
      "Ehrhardt",
      "Matthias J.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 16:20:48 GMT"
    }
  ],
  "updateDate": "2024-12-16",
  "timestamp": 1734106848000,
  "abstract": "  A challenge in high-dimensional inverse problems is developing iterative\nsolvers to find the accurate solution of regularized optimization problems with\nlow computational cost. An important example is computed tomography (CT) where\nboth image and data sizes are large and therefore the forward model is costly\nto evaluate. Since several years algorithms from stochastic optimization are\nused for tomographic image reconstruction with great success by subsampling the\ndata. Here we propose a novel way how stochastic optimization can be used to\nspeed up image reconstruction by means of image domain sketching such that at\neach iteration an image of different resolution is being used. Hence, we coin\nthis algorithm ImaSk. By considering an associated saddle-point problem, we can\nformulate ImaSk as a gradient-based algorithm where the gradient is\napproximated in the same spirit as the stochastic average gradient am\\'elior\\'e\n(SAGA) and uses at each iteration one of these multiresolution operators at\nrandom. We prove that ImaSk is linearly converging for linear forward models\nwith strongly convex regularization functions. Numerical simulations on CT show\nthat ImaSk is effective and increasing the number of multiresolution operators\nreduces the computational time to reach the modeled solution.\n",
  "subjects": [
    "Mathematics/Numerical Analysis",
    "Computer Science/Numerical Analysis",
    "Mathematics/Optimization and Control"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "s9Vxx_lzMSm563O_PaH4SISbYE--rGSbb7xu3U0Ar7k",
  "pdfSize": "4988333"
}