{
  "id": "2412.05489",
  "title": "Exotic properties and manipulation in 2D semimetal Mn2B2(OH)2: a\n  theoretical study",
  "authors": "Pingwei Liu, Dan Liu, Shixin Song, Kang Li, Xueyong Yuan, Jie Guan",
  "authorsParsed": [
    [
      "Liu",
      "Pingwei",
      ""
    ],
    [
      "Liu",
      "Dan",
      ""
    ],
    [
      "Song",
      "Shixin",
      ""
    ],
    [
      "Li",
      "Kang",
      ""
    ],
    [
      "Yuan",
      "Xueyong",
      ""
    ],
    [
      "Guan",
      "Jie",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 7 Dec 2024 01:20:35 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733534435000,
  "abstract": "  Most functional materials possess one single outstanding property and are\nlimited to be used for a particular purpose. Instead of integrating materials\nwith different functions into one module, designing materials with controllable\nmulti-functions is more promising for the electronic industry. In this study,\nwe investigate an unexplored alpha-phase of two-dimensional (2D) Mn2B2(OH)2\ntheoretically. Eighteen distinct electrical polarizations, characterized by\nthree different magnitudes and twelve different directions, are found in this\nphase. The switch of the electrical polarizations is also linked to an observed\nsplitting of band structures between different spin states and the\nferroelasticity of the system. The manipulation of these properties can be\nrealized through controlling the alignment of Mn-OH-Mn chains. Additionally,\nthe approximately honeycomb lattice for the atomic layer of boron indicate the\npotential superconductivity in the system. The diverse and tunable properties\nmake the proposed material as an outstanding candidate for sensing applications\nat the 2D limit.\n",
  "subjects": [
    "Condensed Matter/Materials Science",
    "Condensed Matter/Mesoscale and Nanoscale Physics"
  ],
  "license": "http://creativecommons.org/publicdomain/zero/1.0/",
  "blobId": "eHGgol7tw5syVAUq3HxJbZAZRuOaVGO1U0d0iya5WiQ",
  "pdfSize": "3105747"
}