{"id":"2412.15412","title":"LG-Sleep: Local and Global Temporal Dependencies for Mice Sleep Scoring","authors":"Shadi Sartipi, Mie Andersen, Natalie Hauglund, Celia Kjaerby, Verena\n  Untiet, Maiken Nedergaard, Mujdat Cetin","authorsParsed":[["Sartipi","Shadi",""],["Andersen","Mie",""],["Hauglund","Natalie",""],["Kjaerby","Celia",""],["Untiet","Verena",""],["Nedergaard","Maiken",""],["Cetin","Mujdat",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 21:39:57 GMT"}],"updateDate":"2024-12-23","timestamp":1734644397000,"abstract":"  Efficiently identifying sleep stages is crucial for unraveling the\nintricacies of sleep in both preclinical and clinical research. The\nlabor-intensive nature of manual sleep scoring, demanding substantial\nexpertise, has prompted a surge of interest in automated alternatives. Sleep\nstudies in mice play a significant role in understanding sleep patterns and\ndisorders and underscore the need for robust scoring methodologies. In\nresponse, this study introduces LG-Sleep, a novel subject-independent deep\nneural network architecture designed for mice sleep scoring through\nelectroencephalogram (EEG) signals. LG-Sleep extracts local and global temporal\ntransitions within EEG signals to categorize sleep data into three stages:\nwake, rapid eye movement (REM) sleep, and non-rapid eye movement (NREM) sleep.\nThe model leverages local and global temporal information by employing\ntime-distributed convolutional neural networks to discern local temporal\ntransitions in EEG data. Subsequently, features derived from the convolutional\nfilters traverse long short-term memory blocks, capturing global transitions\nover extended periods. Crucially, the model is optimized in an\nautoencoder-decoder fashion, facilitating generalization across distinct\nsubjects and adapting to limited training samples. Experimental findings\ndemonstrate superior performance of LG-Sleep compared to conventional deep\nneural networks. Moreover, the model exhibits good performance across different\nsleep stages even when tasked with scoring based on limited training samples.\n","subjects":["Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"2hYJlbI7ts6w4hSxiY4bXEC-tEk7YCcLUyoi8Ekg534","pdfSize":"1793207"}