{"id":"2412.03659","title":"GRoovy: A General Relativistic Hydrodynamics Code for Dynamical\n  Spacetimes with Curvilinear Coordinates, Tabulated Equations of State, and\n  Neutrino Physics","authors":"Terrence Pierre Jacques, Samuel Cupp, Leonardo R. Werneck, Samuel D.\n  Tootle, Maria C. Babiuc Hamilton, Zachariah B. Etienne","authorsParsed":[["Jacques","Terrence Pierre",""],["Cupp","Samuel",""],["Werneck","Leonardo R.",""],["Tootle","Samuel D.",""],["Hamilton","Maria C. Babiuc",""],["Etienne","Zachariah B.",""]],"versions":[{"version":"v1","created":"Wed, 4 Dec 2024 19:00:04 GMT"}],"updateDate":"2024-12-06","timestamp":1733338804000,"abstract":"  Many astrophysical systems of interest to numerical relativity, such as\nrapidly rotating stars, black hole accretion disks, and core-collapse\nsupernovae, exhibit near-symmetries. These systems generally consist of a\nstrongly gravitating central object surrounded by an accretion disk, debris,\nand ejecta. Simulations can efficiently exploit the near-axisymmetry of these\nsystems by reducing the number of points in the angular direction around the\nnear-symmetry axis, enabling efficient simulations over seconds-long timescales\nwith minimal computational expense. In this paper, we introduce GRoovy, a novel\ncode capable of modeling astrophysical systems containing compact objects by\nsolving the equations of general relativistic hydrodynamics (GRHD) in full\ngeneral relativity using singular curvilinear (spherical-like and\ncylindrical-like) and Cartesian coordinates. We demonstrate the code's\nrobustness through a battery of challenging GRHD tests, ranging from flat,\nstatic spacetimes to curved, dynamical spacetimes. These tests further showcase\nthe code's capabilities in modeling systems with realistic, finite-temperature\nequations of state and neutrino cooling via a leakage scheme. GRoovy\nextensively leverages GRHayL, an open-source, modular, and\ninfrastructure-agnostic general relativistic magnetohydrodynamics library built\nfrom the highly robust algorithms of IllinoisGRMHD. Long-term simulations of\nbinary neutron star and black hole-neutron star post-merger remnants will\nbenefit greatly from GRoovy to study phenomena such as remnant stability,\ngamma-ray bursts, and nucleosynthesis.\n","subjects":["Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"fqnaSWVB8ErffxowBTKgCtplEWEMzKvivZnMQVUTdAo","pdfSize":"1231684"}