{
  "id": "2412.06213",
  "title": "Ultralight axion or axion-like particle dark matter and 21-cm absorption\n  signals in new physics",
  "authors": "C.R. Das",
  "authorsParsed": [
    [
      "Das",
      "C. R.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 05:17:38 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733721458000,
  "abstract": "  A hypothetical particle known as the axion holds the potential to resolve\nboth the cosmic dark matter riddle and particle physics' long-standing, strong\nCP dilemma. An unusually strong 21-cm absorption feature associated with the\ninitial star formation era, i.e., the dark ages, may be due to ultralight axion\ndark matter ($\\sim 10^{-22}$ eV) at this time. The radio wave observation's\n21-cm absorption signal can be explained as either anomalous baryon cooling or\nanomalous cosmic microwave background photon heating. Shortly after the axions\nor axion-like particles (ALPs) thermalize among themselves and form a\nBose-Einstein condensate, the cold dark matter ALPs make thermal contact with\nbaryons, cooling them. ALPs are thought to be the source of some new evidence\nfor dark matter, as the baryon temperature at cosmic dawn was lower than\npredicted based on presumptions. The detection of baryon acoustic oscillations\nis found to be consistent with baryon cooling by dark matter ALPs.\nSimultaneously, under the influence of the primordial black hole and/or\nintergalactic magnetic fields, the dark radiation composed of ALPs can\nresonantly transform into photons, significantly heating up the radiation in\nthe frequency range relevant to the 21-cm tests. When examining the 21-cm\ncosmology at redshifts $z$ between 200 and 20, we see that, when taking into\naccount both heating and cooling options at the same time, heating eliminated\nthe theoretical excess number of neutrino species, $\\Delta N_{eff}$, from the\ncooling effect.\n",
  "subjects": [
    "Physics/High Energy Physics - Phenomenology"
  ],
  "license": "http://creativecommons.org/publicdomain/zero/1.0/",
  "blobId": "DCCU8xg7AbvQzMrwI5d2kGb8KoDUT1lx39K4bOAPIfo",
  "pdfSize": "140195"
}