{"id":"2412.13433","title":"Unidirectional Raman emissions of Stokes photons via chiral atom-photon\n  coupling in a ring cavity","authors":"Haole Jiao, Minjie Wang, Jiajin Lu, Can Sun, Zhifang Yang, Mengqi Xi,\n  Shujing Li and Hai Wang","authorsParsed":[["Jiao","Haole",""],["Wang","Minjie",""],["Lu","Jiajin",""],["Sun","Can",""],["Yang","Zhifang",""],["Xi","Mengqi",""],["Li","Shujing",""],["Wang","Hai",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 02:09:22 GMT"}],"updateDate":"2024-12-19","timestamp":1734487762000,"abstract":"  The non-reciprocal (unidirectional) atom-photon couplings are crucial for\nmodern photonics ranging from chiral quantum networks to cold-atom many-body\nphysics. In the presented experiment, we demonstrated unidirectional Raman\nemission of Stokes photons from 87Rb atoms in a ring cavity. A bias magnetic\nfield B0 is applied along z-direction on the atoms to define the quantum axis,\nwhich breaks the time inverse symmetry. By transversely applying write laser\npulses to drive a \\pi-transition of the atoms, we generate spontaneous Raman\nemissions of Stokes photons from a chiral (\\sigma+) transition. The emissions\nare coupled into the clock-wise (z-direction) and counter-clock-wise\n(-z-direction) modes of a running-wave cavity, respectively. According to the\nmirror (parity) symmetry of the atom-light coupling, we demonstrated that spins\n(polarizations) of the Stokes fields are correlated with their propagation\ndirections along z and -z -axis. The Stokes emissions constrained to the\nspin-momentum correlation are found to be violation of Kirchhoff's law of\nthermal radiation. Based on the correlation, we demonstrated that the Stokes\nemissions propagate along the clock-wise or counter-clock-wise via polarization\ndissipation. The directional factor is up to 1500:1.\n","subjects":["Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"dNyCSGG4hYMRHCamMkbYw5E-FoX2F7_bvKdV-TnwXZ0","pdfSize":"1300037"}