{"id":"2412.06711","title":"MISFEAT: Feature Selection for Subgroups with Systematic Missing Data","authors":"Bar Genossar, Thinh On, Md. Mouinul Islam, Ben Eliav, Senjuti Basu Roy\n  and Avigdor Gal","authorsParsed":[["Genossar","Bar",""],["On","Thinh",""],["Islam","Md. Mouinul",""],["Eliav","Ben",""],["Roy","Senjuti Basu",""],["Gal","Avigdor",""]],"versions":[{"version":"v1","created":"Mon, 9 Dec 2024 17:59:59 GMT"}],"updateDate":"2024-12-10","timestamp":1733767199000,"abstract":"  We investigate the problem of selecting features for datasets that can be\nnaturally partitioned into subgroups (e.g., according to socio-demographic\ngroups and age), each with its own dominant set of features. Within this\nsubgroup-oriented framework, we address the challenge of systematic missing\ndata, a scenario in which some feature values are missing for all tuples of a\nsubgroup, due to flawed data integration, regulatory constraints, or privacy\nconcerns. Feature selection is governed by finding mutual Information, a\npopular quantification of correlation, between features and a target variable.\nOur goal is to identify top-K feature subsets of some fixed size with the\nhighest joint mutual information with a target variable. In the presence of\nsystematic missing data, the closed form of mutual information could not simply\nbe applied. We argue that in such a setting, leveraging relationships between\navailable feature mutual information within a subgroup or across subgroups can\nassist inferring missing mutual information values. We propose a generalizable\nmodel based on heterogeneous graph neural network to identify interdependencies\nbetween feature-subgroup-target variable connections by modeling it as a\nmultiplex graph, and employing information propagation between its nodes. We\naddress two distinct scalability challenges related to training and propose\nprincipled solutions to tackle them. Through an extensive empirical evaluation,\nwe demonstrate the efficacy of the proposed solutions both qualitatively and\nrunning time wise.\n","subjects":["Computer Science/Machine Learning","Computer Science/Databases","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Jp7wYWoCzBbn1kuWxM8q6JVwrKGZgrMZZVIXD29kD84","pdfSize":"1305891"}