{
  "id": "2412.12557",
  "title": "Ultrafast demagnetization in ferromagnetic materials: Origins and\n  progress",
  "authors": "Xiaowen Chen, Roman Adam, Daniel E. B\\\"urgler, Fangzhou Wang, Zhenyan\n  Lu, Lining Pan, Sarah Heidtfeld, Christian Greb, Meihong Liu, Qingfang Liu,\n  Jianbo Wang, Claus M. Schneider, and Derang Cao",
  "authorsParsed": [
    [
      "Chen",
      "Xiaowen",
      ""
    ],
    [
      "Adam",
      "Roman",
      ""
    ],
    [
      "Bürgler",
      "Daniel E.",
      ""
    ],
    [
      "Wang",
      "Fangzhou",
      ""
    ],
    [
      "Lu",
      "Zhenyan",
      ""
    ],
    [
      "Pan",
      "Lining",
      ""
    ],
    [
      "Heidtfeld",
      "Sarah",
      ""
    ],
    [
      "Greb",
      "Christian",
      ""
    ],
    [
      "Liu",
      "Meihong",
      ""
    ],
    [
      "Liu",
      "Qingfang",
      ""
    ],
    [
      "Wang",
      "Jianbo",
      ""
    ],
    [
      "Schneider",
      "Claus M.",
      ""
    ],
    [
      "Cao",
      "Derang",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 05:31:46 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734413506000,
  "abstract": "  Since the discovery of ultrafast demagnetization in Ni thin films in 1996,\nlaser-induced ultrafast spin dynamics have become a prominent research topic in\nthe field of magnetism and spintronics. This development offers new\npossibilities for the advancement of spintronics and magnetic storage\ntechnology. The subject has drawn a substantial number of researchers, leading\nto a series of research endeavors. Various models have been proposed to\nelucidate the physical processes underlying laser-induced ultrafast spin\ndynamics in ferromagnetic materials. However, the potential origins of these\nprocesses across different material systems and the true contributions of these\ndifferent origins remain challenging in the realm of ultrafast spin dynamics.\nThis predicament also hinders the development of spintronic terahertz emitters.\nIn this review, we initially introduce the different experimental methods used\nin laser-induced ultrafast spin dynamics. We then systematically explore the\nmagnetization precession process and present seven models of ultrafast\ndemagnetization in ferromagnetic materials. Subsequently, we discuss the\nphysical processes and research status of four ultrafast demagnetization\norigins (including spin-flipping, spin transport, non-thermal electronic\ndistribution, and laser-induced lattice strain). Since attosecond laser\ntechnique and antiferromagnetic materials exhibit promising applications in\nultrahigh-frequency spintronics, we acknowledge the emerging studies used by\nattosecond pules and studies on ultrafast spin dynamics in antiferromagnets,\nnoting the significant challenges that need to be addressed in these burgeoning\nfield.\n",
  "subjects": [
    "Condensed Matter/Materials Science",
    "Condensed Matter/Other Condensed Matter",
    "Physics/High Energy Physics - Experiment",
    "Physics/Applied Physics",
    "Physics/Optics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "jmL6AGercomrdTIV4cdCKau5nMBTsshLU4XUl5Lt45o",
  "pdfSize": "4411213"
}