{
  "id": "2412.11425",
  "title": "Contemporary Reaction to Gibbs's Statistical Mechanics",
  "authors": "Bruce D. Popp",
  "authorsParsed": [
    [
      "Popp",
      "Bruce D.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 03:50:33 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734321033000,
  "abstract": "  J. Willard Gibbs published a book in 1902 on statistical mechanics that\nquickly received significant attention from his contemporaries because of the\nreputation that he had secured with his prior work on thermodynamics. People\nreading Gibbs's book were often familiar with Ludwig Boltzmann's work on the\nkinetic theory of gases. This article looks at the published response to\nGibbs's book in the decade following its publication. What did these readers\nget from reading Elementary Principles in Statistical Mechanics? How did they\nput that to use? Was it fruitful? Samuel H. Burbury had been strongly critical\nof the assumptions on which Boltzmann's theory was built and had expressed a\nneed for a theory without them. Burbury was pleased with the foundation and\nrigor of Gibbs's approach, since in his first three chapters he had built on\nanalytical mechanics in the Hamiltonian formulation, a many-body dynamical\nsystem. Others found Gibbs hard to understand and some were critical. Hendrik\nA. Lorentz began teaching Gibbs's dynamical theory and supervised a thesis by\nLeonard Ornstein in which Orenstein developed applications built on grand\ncanonical ensembles and correlations, which were contrary to Boltzmann's\nmolecular disorder. Ornstein and Zernike expanded on material in that thesis to\ndevelop a theory of critical opalescence without infinities.\n",
  "subjects": [
    "Physics/History and Philosophy of Physics",
    "Physics/Classical Physics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "knZ3_TytLNHHb8nfl4vDVAMVm9WbZ_-KFeXy683gzFU",
  "pdfSize": "401688"
}