{
  "id": "2412.12403",
  "title": "Characterizing the Networks Sending Enterprise Phishing Emails",
  "authors": "Elisa Luo, Liane Young, Grant Ho, M. H. Afifi, Marco Schweighauser,\n  Ethan Katz-Bassett, Asaf Cidon",
  "authorsParsed": [
    [
      "Luo",
      "Elisa",
      ""
    ],
    [
      "Young",
      "Liane",
      ""
    ],
    [
      "Ho",
      "Grant",
      ""
    ],
    [
      "Afifi",
      "M. H.",
      ""
    ],
    [
      "Schweighauser",
      "Marco",
      ""
    ],
    [
      "Katz-Bassett",
      "Ethan",
      ""
    ],
    [
      "Cidon",
      "Asaf",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 23:15:40 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734390940000,
  "abstract": "  Phishing attacks on enterprise employees present one of the most costly and\npotent threats to organizations. We explore an understudied facet of enterprise\nphishing attacks: the email relay infrastructure behind successfully delivered\nphishing emails. We draw on a dataset spanning one year across thousands of\nenterprises, billions of emails, and over 800,000 delivered phishing attacks.\nOur work sheds light on the network origins of phishing emails received by\nreal-world enterprises, differences in email traffic we observe from networks\nsending phishing emails, and how these characteristics change over time.\n  Surprisingly, we find that over one-third of the phishing email in our\ndataset originates from highly reputable networks, including Amazon and\nMicrosoft. Their total volume of phishing email is consistently high across\nmultiple months in our dataset, even though the overwhelming majority of email\nsent by these networks is benign. In contrast, we observe that a large portion\nof phishing emails originate from networks where the vast majority of emails\nthey send are phishing, but their email traffic is not consistent over time.\nTaken together, our results explain why no singular defense strategy, such as\nstatic blocklists (which are commonly used in email security filters deployed\nby organizations in our dataset), is effective at blocking enterprise phishing.\nBased on our offline analysis, we partnered with a large email security company\nto deploy a classifier that uses dynamically updated network-based features. In\na production environment over a period of 4.5 months, our new detector was able\nto identify 3-5% more enterprise email attacks that were previously undetected\nby the company's existing classifiers.\n",
  "subjects": [
    "Computer Science/Cryptography and Security"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "px0QRQGg9TtbzvgL5K8HA2HA9fN9nivfSmRctzdViRo",
  "pdfSize": "1450138"
}