{
  "id": "2412.08670",
  "title": "A feature refinement module for light-weight semantic segmentation\n  network",
  "authors": "Zhiyan Wang, Xin Guo, Song Wang, Peixiao Zheng, Lin Qi",
  "authorsParsed": [
    [
      "Wang",
      "Zhiyan",
      ""
    ],
    [
      "Guo",
      "Xin",
      ""
    ],
    [
      "Wang",
      "Song",
      ""
    ],
    [
      "Zheng",
      "Peixiao",
      ""
    ],
    [
      "Qi",
      "Lin",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 03:31:20 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1733887880000,
  "abstract": "  Low computational complexity and high segmentation accuracy are both\nessential to the real-world semantic segmentation tasks. However, to speed up\nthe model inference, most existing approaches tend to design light-weight\nnetworks with a very limited number of parameters, leading to a considerable\ndegradation in accuracy due to the decrease of the representation ability of\nthe networks. To solve the problem, this paper proposes a novel semantic\nsegmentation method to improve the capacity of obtaining semantic information\nfor the light-weight network. Specifically, a feature refinement module (FRM)\nis proposed to extract semantics from multi-stage feature maps generated by the\nbackbone and capture non-local contextual information by utilizing a\ntransformer block. On Cityscapes and Bdd100K datasets, the experimental results\ndemonstrate that the proposed method achieves a promising trade-off between\naccuracy and computational cost, especially for Cityscapes test set where 80.4%\nmIoU is achieved and only 214.82 GFLOPs are required.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Machine Learning",
    "Electrical Engineering and Systems Science/Image and Video Processing"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "HlRoaOgciG6TjgUtSk8uVYQaPlqu53nA0y4JiOJGpUE",
  "pdfSize": "319415"
}