{"id":"2412.01829","title":"Explainable Artificial Intelligence for Medical Applications: A Review","authors":"Qiyang Sun, Alican Akman and Bj\\\"orn W. Schuller","authorsParsed":[["Sun","Qiyang",""],["Akman","Alican",""],["Schuller","Björn W.",""]],"versions":[{"version":"v1","created":"Fri, 15 Nov 2024 11:31:06 GMT"}],"updateDate":"2024-12-04","timestamp":1731670266000,"abstract":"  The continuous development of artificial intelligence (AI) theory has\npropelled this field to unprecedented heights, owing to the relentless efforts\nof scholars and researchers. In the medical realm, AI takes a pivotal role,\nleveraging robust machine learning (ML) algorithms. AI technology in medical\nimaging aids physicians in X-ray, computed tomography (CT) scans, and magnetic\nresonance imaging (MRI) diagnoses, conducts pattern recognition and disease\nprediction based on acoustic data, delivers prognoses on disease types and\ndevelopmental trends for patients, and employs intelligent health management\nwearable devices with human-computer interaction technology to name but a few.\nWhile these well-established applications have significantly assisted in\nmedical field diagnoses, clinical decision-making, and management,\ncollaboration between the medical and AI sectors faces an urgent challenge: How\nto substantiate the reliability of decision-making? The underlying issue stems\nfrom the conflict between the demand for accountability and result transparency\nin medical scenarios and the black-box model traits of AI. This article reviews\nrecent research grounded in explainable artificial intelligence (XAI), with an\nemphasis on medical practices within the visual, audio, and multimodal\nperspectives. We endeavour to categorise and synthesise these practices, aiming\nto provide support and guidance for future researchers and healthcare\nprofessionals.\n","subjects":["Computer Science/Machine Learning","Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"gDZgZ8W9bs9bAxDQSaKSuJ9hkNSezgN5WUzt2DQAaDo","pdfSize":"1675610"}