{"id":"2412.02144","title":"The neutrino flavor oscillations in the static and spherically symmetric\n  black-hole-like wormholes","authors":"Yuxuan Shi, Hongbo Cheng","authorsParsed":[["Shi","Yuxuan",""],["Cheng","Hongbo",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 04:00:30 GMT"},{"version":"v2","created":"Wed, 19 Feb 2025 17:28:03 GMT"}],"updateDate":"2025-02-20","timestamp":1733198430000,"abstract":"  We study the effects of neutrino lensing induced by a Damour-Solodukhin\nwormhole on the neutrino oscillation. We derive and calculate the flavour\ntransition probabilities in the presence of Damour-Solodukhin factor $\\Lambda$\nas a shift in the massive source to show that the neutrino flavour oscillation\nis also sensitive not only to the sign of difference between the squared masses\nbut also to the individual mass of neutrinos in both the two-flavour and the\nthree-flavour cases, which is similar to the results for the black holes in the\nprevious works mentioned here. As a consequence of parameter $\\Lambda$ within a\nregion, a series of curves of probability function versus the azimuthal angle\n$\\phi$ with definite masses of neutrino can be plotted and their shapes\nresemble each other in the case of two-flavoured neutrinos and of\nthree-flavoured ones. In view of the probability functions due to the wormhole,\nwe reveal that the contribution of the factor $\\Lambda$ is novel. Based on our\nanalytical and numerical discussions on the probability expressions, the\ndifference of the neutrino flavour oscillation arising from the shift in the\nwormhole factor $\\Lambda$ is detectable. It is crucial that the $\\Lambda$ as\ndeviation from the black holes can change the shapes of the curves greatly, in\nthe case of three-flavoured neutrinos in particular. The detailed comparisons\ncan be made among our estimations depicted in the figures for neutrino\noscillations and the measurements from the detector, which open a new window\nfor judging whether the remote star as lens is black-hole-like wormhole or just\na spherically symmetric black hole and further the wormhole factor $\\Lambda$\ncan be estimated.\n","subjects":["Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"opiVoA_-jBvSLVdb41blqcVfYgNTXi8I8NyM6PFRBVk","pdfSize":"801153"}