{
  "id": "2412.13725",
  "title": "From Risk to Readiness: VR-Based Safety Training for Industrial Hazards",
  "authors": "Gianni Vercelli, Saverio Iacono, Luca Martini, Michele Zardetto,\n  Daniele Zolezzi",
  "authorsParsed": [
    [
      "Vercelli",
      "Gianni",
      ""
    ],
    [
      "Iacono",
      "Saverio",
      ""
    ],
    [
      "Martini",
      "Luca",
      ""
    ],
    [
      "Zardetto",
      "Michele",
      ""
    ],
    [
      "Zolezzi",
      "Daniele",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 11:05:03 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734519903000,
  "abstract": "  This study explores the application of Virtual Reality (VR) as a tool for\nsafety training in high-risk industrial settings, specifically focusing on the\nIPLOM refinery, Busalla (Italy). As industries increasingly adopt digital tools\nto enhance safety and operational efficiency, VR provides a risk-free,\nimmersive environment for training operators in emergency protocols. This\nproject developed a VR simulation using Unreal Engine and Meta Quest headsets\nto mirror refinery conditions, including equipment handling, emergency response\nprocedures, and spatial navigation. Integrated tools, such as multi-gas\ndetectors and evacuation drills, allow users to practice real-world tasks\nvirtually, enhancing procedural knowledge and spatial awareness. The\nsimulation's design allows for future integration with Augmented Reality (AR)\nto enable real-time equipment monitoring and data overlays, enhancing on-site\ndecision-making. Feedback from initial testing shows high user satisfaction and\nincreased confidence in emergency response skills, indicating the effectiveness\nof VR in safety training. This VR approach offers a scalable, adaptable model\nfor refining industrial training, reducing physical risks and costs associated\nwith traditional drills, and setting a foundation for the use of immersive\ntechnologies in other high-risk sectors.\n",
  "subjects": [
    "Computer Science/Human-Computer Interaction"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "XIOi0MpR3nA30RGKjsF-vS8c_7yVEyzbEfd0dR74sPo",
  "pdfSize": "499992"
}