{
  "id": "2412.15271",
  "title": "A MapReduce Approach to Effectively Utilize Long Context Information in\n  Retrieval Augmented Language Models",
  "authors": "Gongbo Zhang, Zihan Xu, Qiao Jin, Fangyi Chen, Yilu Fang, Yi Liu,\n  Justin F. Rousseau, Ziyang Xu, Zhiyong Lu, Chunhua Weng, Yifan Peng",
  "authorsParsed": [
    [
      "Zhang",
      "Gongbo",
      ""
    ],
    [
      "Xu",
      "Zihan",
      ""
    ],
    [
      "Jin",
      "Qiao",
      ""
    ],
    [
      "Chen",
      "Fangyi",
      ""
    ],
    [
      "Fang",
      "Yilu",
      ""
    ],
    [
      "Liu",
      "Yi",
      ""
    ],
    [
      "Rousseau",
      "Justin F.",
      ""
    ],
    [
      "Xu",
      "Ziyang",
      ""
    ],
    [
      "Lu",
      "Zhiyong",
      ""
    ],
    [
      "Weng",
      "Chunhua",
      ""
    ],
    [
      "Peng",
      "Yifan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 11:18:14 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734434294000,
  "abstract": "  While holding great promise for improving and facilitating healthcare, large\nlanguage models (LLMs) struggle to produce up-to-date responses on evolving\ntopics due to outdated knowledge or hallucination. Retrieval-augmented\ngeneration (RAG) is a pivotal innovation that improves the accuracy and\nrelevance of LLM responses by integrating LLMs with a search engine and\nexternal sources of knowledge. However, the quality of RAG responses can be\nlargely impacted by the rank and density of key information in the retrieval\nresults, such as the \"lost-in-the-middle\" problem. In this work, we aim to\nimprove the robustness and reliability of the RAG workflow in the medical\ndomain. Specifically, we propose a map-reduce strategy, BriefContext, to combat\nthe \"lost-in-the-middle\" issue without modifying the model weights. We\ndemonstrated the advantage of the workflow with various LLM backbones and on\nmultiple QA datasets. This method promises to improve the safety and\nreliability of LLMs deployed in healthcare domains.\n",
  "subjects": [
    "Computer Science/Computation and Language",
    "Computer Science/Information Retrieval"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "S0BYIlF6fcea1eeCh_KMoynginYnC_z838cb37kiWMM",
  "pdfSize": "550541"
}