{"id":"2412.15670","title":"BS-LDM: Effective Bone Suppression in High-Resolution Chest X-Ray Images\n  with Conditional Latent Diffusion Models","authors":"Yifei Sun, Zhanghao Chen, Hao Zheng, Wenming Deng, Jin Liu, Wenwen\n  Min, Ahmed Elazab, Xiang Wan, Changmiao Wang, Ruiquan Ge","authorsParsed":[["Sun","Yifei",""],["Chen","Zhanghao",""],["Zheng","Hao",""],["Deng","Wenming",""],["Liu","Jin",""],["Min","Wenwen",""],["Elazab","Ahmed",""],["Wan","Xiang",""],["Wang","Changmiao",""],["Ge","Ruiquan",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 08:36:17 GMT"},{"version":"v2","created":"Tue, 24 Dec 2024 08:44:04 GMT"},{"version":"v3","created":"Mon, 30 Dec 2024 02:40:31 GMT"}],"updateDate":"2024-12-31","timestamp":1734683777000,"abstract":"  Lung diseases represent a significant global health challenge, with Chest\nX-Ray (CXR) being a key diagnostic tool due to their accessibility and\naffordability. Nonetheless, the detection of pulmonary lesions is often\nhindered by overlapping bone structures in CXR images, leading to potential\nmisdiagnoses. To address this issue, we developed an end-to-end framework\ncalled BS-LDM, designed to effectively suppress bone in high-resolution CXR\nimages. This framework is based on conditional latent diffusion models and\nincorporates a multi-level hybrid loss-constrained vector-quantized generative\nadversarial network which is crafted for perceptual compression, ensuring the\npreservation of details. To further enhance the framework's performance, we\nintroduce offset noise and a temporal adaptive thresholding strategy. These\nadditions help minimize discrepancies in generating low-frequency information,\nthereby improving the clarity of the generated soft tissue images.\nAdditionally, we have compiled a high-quality bone suppression dataset named\nSZCH-X-Rays. This dataset includes 818 pairs of high-resolution CXR and\ndual-energy subtraction soft tissue images collected from a partner hospital.\nMoreover, we processed 241 data pairs from the JSRT dataset into negative\nimages, which are more commonly used in clinical practice. Our comprehensive\nexperimental and clinical evaluations reveal that BS-LDM excels in bone\nsuppression, underscoring its significant clinical value.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"gCrZH7xiinUVSOlJJfIlYr4vRjlwKBMA4TQ_KoKcQjY","pdfSize":"3307360"}