{
  "id": "2412.08702",
  "title": "PICS: Planetary Nebulae in Cosmological Simulations -- Revelations of\n  the Planetary Nebula Luminosity Function from Realistic Stellar Populations",
  "authors": "Lucas M. Valenzuela, Rhea-Silvia Remus, Marcelo M. Miller Bertolami,\n  Roberto H. M\\'endez",
  "authorsParsed": [
    [
      "Valenzuela",
      "Lucas M.",
      ""
    ],
    [
      "Remus",
      "Rhea-Silvia",
      ""
    ],
    [
      "Bertolami",
      "Marcelo M. Miller",
      ""
    ],
    [
      "Méndez",
      "Roberto H.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 19:00:00 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1733943600000,
  "abstract": "  Even after decades of usage as an extragalactic standard candle, the\nuniversal bright end of the planetary nebula luminosity function (PNLF) still\nlacks a solid theoretical explanation. Until now, models have modeled planetary\nnebulae (PNe) from artificial stellar populations, without an underlying\ncosmological star formation history. We present PICS (PNe In Cosmological\nSimulations), a novel method of modeling PNe in cosmological simulations,\nthrough which PN populations for the first time naturally occur within galaxies\nof diverse evolutionary pathways. We find that only by using realistic stellar\npopulations and their metallicities is it possible to reproduce the bright end\nof the PNLF for all galaxy types. In particular, the dependence of stellar\nlifetimes on metallicity has to be accounted for to produce bright PNe in\nmetal-rich populations. Finally, PICS reproduces the statistically complete\npart of the PNLF observed around the Sun, down to six orders of magnitude below\nthe bright end.\n",
  "subjects": [
    "Astrophysics/Astrophysics of Galaxies",
    "Astrophysics/Solar and Stellar Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "WVFnfhQpvBj60OkjgBW17AvMF-XtlhdSPiDP2Kp4Whw",
  "pdfSize": "335570"
}