{
  "id": "2412.20774",
  "title": "Baryon number violating hydrogen decay",
  "authors": "Wei-Qi Fan, Yi Liao, Xiao-Dong Ma, and Hao-Lin Wang",
  "authorsParsed": [
    [
      "Fan",
      "Wei-Qi",
      ""
    ],
    [
      "Liao",
      "Yi",
      ""
    ],
    [
      "Ma",
      "Xiao-Dong",
      ""
    ],
    [
      "Wang",
      "Hao-Lin",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 30 Dec 2024 07:55:12 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 18 Feb 2025 12:05:06 GMT"
    },
    {
      "version": "v3",
      "created": "Thu, 20 Feb 2025 16:05:47 GMT"
    }
  ],
  "updateDate": "2025-02-21",
  "timestamp": 1735545312000,
  "abstract": "  Most studies on baryon number violating (BNV) processes in the literature\nfocus on free or bound nucleons in nuclei, with limited attention given to the\ndecay of bound atoms. Given that hydrogen is the most abundant atom in the\nuniverse, it is particularly intriguing to investigate the decay of hydrogen\natom as a means to probe BNV interactions. In this study, for the first time,\nwe employ a robust effective field theory (EFT) approach to estimate the decay\nwidths of two-body decays of hydrogen atom into standard model particles, by\nutilizing the constraints on the EFT cutoff scale derived from conventional\nnucleon decay processes. We integrate low energy effective field theory (LEFT),\nchiral perturbation theory (ChPT), and standard model effective field theory\n(SMEFT) to formulate the decay widths in terms of the LEFT and SMEFT Wilson\ncoefficients (WCs), respectively. By applying the bounds on the WCs from\nconventional nucleon decays, we provide a conservative estimate on hydrogen BNV\ndecays. Our findings indicate that the bounds on the inverse partial widths of\nall dominant two-body decays exceed $10^{44}$ years. Among these modes, the\nleast constrained diphoton decay $\\Hy\\to \\gamma\\gamma$ might be astrophysically\ninteresting, although the monochromatic photon signal from our Sun is difficult\nto detect with current near-Earth telescopes.\n",
  "subjects": [
    "Physics/High Energy Physics - Phenomenology"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "59IjBfUvV8RsbRU97j0-P7qBMWmZM5IoDJi0moszmro",
  "pdfSize": "566927"
}