{"id":"2412.15423","title":"An Explorative Study of Pig Butchering Scams","authors":"Bhupendra Acharya and Thorsten Holz","authorsParsed":[["Acharya","Bhupendra",""],["Holz","Thorsten",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 22:15:50 GMT"}],"updateDate":"2024-12-23","timestamp":1734646550000,"abstract":"  In the recent past, so-called pig-butchering scams are on the rise. This term\nis based on a translation of the Chinese term \"Sha Zhu Pan\", where scammers\nrefer to victims as \"pig\" which are to be \"fattened up before slaughter\" so\nthat scammer can siphon off as much monetary value as possible. In this type of\nscam, attackers perform social engineering tricks on victims over an extended\nperiod to build credibility or relationships. After a certain period, when\nvictims transfer larger amounts of money to scammers, the fraudsters' platforms\nor profiles go permanently offline and the victims' money is lost.\n  In this work, we provide the first comprehensive study of pig-butchering\nscams from multiple vantage points. Our study analyzes the direct victims'\nnarratives shared on multiple social media platforms, public abuse report\ndatabases, and case studies from news outlets. Between March 2024 to October\n2024, we collected data related to pig butchering scams from (i) four social\nmedia platforms comprised of more than 430,000 social media accounts and\n770,000 posts; (ii) more than 3,200 public abuse reports narratives, and (iii)\nabout 1,000 news articles. Through automated and qualitative evaluation, we\nprovide an evaluation of victims of pig-butchering scams, finding 146 social\nmedia scammed users, 2,570 abuse reports narratives, and 50 case studies of 834\nsouls from news outlets. In total, we approximated losses of over \\$521 million\nrelated to such scams. To complement this analysis, we performed a survey on\ncrowdsourcing platforms with 584 users to broaden the insights on comparative\nanalysis of pig-butchering scams with other types of scams. Our research\nhighlights that these attacks are sophisticated and often require multiple\nentities, including policymakers and law enforcement, to work together\nalongside user education to create a proactive detection of such scams.\n","subjects":["Computer Science/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7EDC_pGxgXnc3jHVZLZW-oBjwFh8iSFOptyM9_MxvuQ","pdfSize":"1495324"}