{"id":"2412.18953","title":"Engineering whispering gallery modes in MoSe$_2$/WS$_2$ double\n  heterostructure nanocavities: Towards developing all-TMDC light sources","authors":"P. A. Alekseev, I. A. Milekhin, K. A. Gasnikova, I. A. Eliseyev, V.\n  Yu. Davydov, A. A. Bogdanov, V. Kravtsov, A. O. Mikhin, B. R. Borodin, and A.\n  G. Milekhin","authorsParsed":[["Alekseev","P. A.",""],["Milekhin","I. A.",""],["Gasnikova","K. A.",""],["Eliseyev","I. A.",""],["Davydov","V. Yu.",""],["Bogdanov","A. A.",""],["Kravtsov","V.",""],["Mikhin","A. O.",""],["Borodin","B. R.",""],["Milekhin","A. G.",""]],"versions":[{"version":"v1","created":"Wed, 25 Dec 2024 17:36:35 GMT"}],"updateDate":"2024-12-30","timestamp":1735148195000,"abstract":"  Transition metal dichalcogenides (TMDCs) have emerged as highly promising\nmaterials for nanophotonics and optoelectronics due to their exceptionally high\nrefractive indices, strong excitonic photoluminescence (PL) in monolayer\nconfigurations, and the versatility to engineer van der Waals (vdW)\nheterostructures. In this work, we exploit the intense excitonic PL of a\nMoSe$_2$ monolayer combined with the high refractive index of bulk WS$_2$ to\nfabricate microdisk cavities with tunable light emission characteristics. These\nmicrodisks are created from a 50-nm-thick WS$_2$/MoSe$_2$/WS$_2$ double\nheterostructure using frictional mechanical scanning probe lithography. The\nresulting cavities achieve a 4-10-fold enhancement in excitonic PL from the\nMoSe$_2$ monolayer at wavelengths near 800 nm. The excitonic PL peak is\nmodulated by sharp spectral features, which correspond to whispering gallery\nmodes (WGMs) supported by the cavity. A microdisk with a diameter of 2.35\n$\\mu$m demonstrates WGMs with a quality factor of up to 700, significantly\nsurpassing theoretical predictions and suggesting strong potential for lasing\napplications. The spectral positions of the WGMs can be finely tuned by\nadjusting the microdisk's diameter and thickness, as confirmed by theoretical\ncalculations. This approach offers a novel route for developing ultra-compact,\nall-TMDC double heterostructure light sources with record-small size.\n","subjects":["Physics/Optics","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"L2wIFsBeqIhYkeDcfxn6CfHWmzqJzldRopZEg21YudY","pdfSize":"13458817"}