{"id":"2412.02936","title":"One predator and two prey: Coexistence of pumas, guanacos and sheep in\n  Patagonia","authors":"Jhordan Silveira de Borba and Sebastian Gon\\c{c}alves","authorsParsed":[["de Borba","Jhordan Silveira",""],["Gonçalves","Sebastian",""]],"versions":[{"version":"v1","created":"Wed, 4 Dec 2024 01:09:15 GMT"}],"updateDate":"2024-12-05","timestamp":1733274555000,"abstract":"  The ecosystem considered in this study is the outcome of a lengthy sequence\nof historical and ecological events. Patagonia's indigenous fauna comprises\nsurvivors of five significant extinction events, with the notable presence of\nthe puma and the guanaco, two of the largest native mammals. In addition to\nthese, European immigrants introduced sheep into the ecosystem. Together, these\nthree species form a straightforward trophic network, featuring one predator\nand two prey species, all competing within the Patagonian steppe. For ranchers,\nguanacos and pumas are frequently perceived as threats to their economic\ninterests. In recent decades, the field of biology, particularly ecology, has\nwitnessed a substantial increase in the development of equation-based models.\nScientists are interested in the ability to systematize hypotheses and gain\ninsights into the behavior of complex biological systems, such as the one\npresented in this study. However, the nonlinear nature and the large number of\nparameters of models, represent a challenge when one wants to explore the\nparameter space. To overcome this and, at the same time, improve the\nunderstanding of the Patagonia ecosystem, we start by building an\nequation-based model based on previous contributions, and we reduce it to the\nessential minimum set of parameters. Then, we introduce two tools, a\ngeneralization of ternary graphs and a perceptron based ML, to help understand\nthe response of the system equation to the key parameters. The perceptron tool\nallows us to visualize/interpret the influence of each parameter on the\nsurvival or extinction of each species. Through the generalization of the\nternary graph, it was possible to conveniently visualize how the system\nresponds to different combinations/variations of the five parameters of the\nreduced system equation in a single graphical representation.\n","subjects":["Quantitative Biology/Populations and Evolution"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"nrtEq-1zdxwzQl65n68wHIZTcDFAuMgmi3GQGXMqyrI","pdfSize":"7157381"}