{
  "id": "2412.19694",
  "title": "Nonperturbative effects in triple-differential dijet and Z+jet\n  production at the LHC",
  "authors": "Stefan Gieseke, Maximilian Horzela, Manjit Kaur, Dari Leonardi, Klaus\n  Rabbertz, Aayushi Singla, Cedric Verstege",
  "authorsParsed": [
    [
      "Gieseke",
      "Stefan",
      ""
    ],
    [
      "Horzela",
      "Maximilian",
      ""
    ],
    [
      "Kaur",
      "Manjit",
      ""
    ],
    [
      "Leonardi",
      "Dari",
      ""
    ],
    [
      "Rabbertz",
      "Klaus",
      ""
    ],
    [
      "Singla",
      "Aayushi",
      ""
    ],
    [
      "Verstege",
      "Cedric",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 27 Dec 2024 15:42:07 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735314127000,
  "abstract": "  In comparisons of precision collider data to the most accurate highest-order\ncalculations in perturbative quantum chromodynamics (QCD), it is required to\ncorrect for nonperturbative effects. Such effects are typically studied using\nMonte Carlo event generators that complement fixed-order predictions with\nperturbative parton showers and models for the nonperturbative effects of the\nUnderlying Event and hadronisation. Thereby, the final state of collision\nevents can be predicted at the level of stable particles, which serve as input\nfor full detector simulations.\n  This article investigates the impact of nonperturbative effects on two\nprocesses that may be used for precision determinations of the strong coupling\nconstant and the proton structure: the triple-differential dijet and Z+jet\nproduction. While nonperturbative effects impact both processes, significant\ndifferences among them are observed and further investigated. Indications are\nfound that the Underlying Event and hadronisation cannot fully explain these\ndifferences and the perturbative modelling may play a significant role as well.\n",
  "subjects": [
    "Physics/High Energy Physics - Phenomenology"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "BkD1_k2zBGx7PXgseRiNe7MAbO0BdwHJmsExEulI6g0",
  "pdfSize": "2156383"
}