{"id":"2412.21166","title":"Cavity-QED Simulation of a Maser beyond the Mean-Field Approximation","authors":"Xinpeng Shu, Yining Jiang, Hao Wu and Mark Oxborrow","authorsParsed":[["Shu","Xinpeng",""],["Jiang","Yining",""],["Wu","Hao",""],["Oxborrow","Mark",""]],"versions":[{"version":"v1","created":"Mon, 30 Dec 2024 18:44:16 GMT"}],"updateDate":"2024-12-31","timestamp":1735584256000,"abstract":"  We here introduce a method for simulating, quantum mechanically, the dynamics\nof a maser where the strength of the magnetic field of the microwave mode being\namplified by stimulated emission varies over the volume of the maser's\nspatially extended gain medium. This is very often the case in real systems.\nOur method generalizes the well-known Tavis-Cummings (T-C) model of cavity\nquantum electrodynamics (QED) to encompass quantum emitters whose coupling\nstrengths to the maser's amplified mode vary over a distribution that can be\naccurately determined using an electromagnetic-field solver applied to the\nmaser cavity's geometry and composition. We then solve our generalized T-C\nmodel to second order in cumulant expansion using publicly available\nPython-based software. We apply our methodology to a specific, experimentally\nmeasured maser based on an optically pumped crystal of pentacene-doped\npara-terphenyl. We demonstrate that certain distinct quantum-mechanical\nfeatures exhibited by this maser's dynamics, most notably the observation of\nRabi-like flopping associated with the generation of spin-photon Dicke states,\ncan be accurately reproduced using our numerically solved model. The equivalent\nsimpler model, that invokes the mean-field approximation, fails to do so. By\nconstructing then solving for artificial (perfectly Gaussian) distributions, we\ngo on to explore how the performance of this type of maser is affected by the\nspread in spin-photon coupling strengths. Our methodology thereby enables the\nmaser's anatomy to be more rationally engineered.\n","subjects":["Physics/Quantum Physics","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"I4nwCNbMTV-ZneXYCc3JKT8pF6FUbsbxtB1CTxK8xLI","pdfSize":"563462"}