{"id":"2412.08476","title":"Potential Interior Structures and Habitability of Super-Earth Exoplanets\n  LHS 1140 b, K2-18 b, TOI-1452 b and TOI-1468 c","authors":"Mangesh Daspute, Amri Wandel, Ravi Kumar Kopparapu, Volker Perdelwitz,\n  Jerusalem Tamirat Teklu and Lev Tal-Or","authorsParsed":[["Daspute","Mangesh",""],["Wandel","Amri",""],["Kopparapu","Ravi Kumar",""],["Perdelwitz","Volker",""],["Teklu","Jerusalem Tamirat",""],["Tal-Or","Lev",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 15:43:36 GMT"}],"updateDate":"2024-12-12","timestamp":1733931816000,"abstract":"  We analyze four super-Earth exoplanets, LHS 1140 b, K2-18 b, TOI-1452 b, and\nTOI-1468 c, which orbit M-dwarf stars in the habitable zone. Their relative\nproximity, within 40 parsecs, makes them prime candidates for follow-up\nobservations and atmospheric and habitability studies. This paper aims to\nassess their internal structure and habitability, considering their tidal\nheating, atmospheric heating, and global transport. We model the interior\nstructure of the planets by applying Bayesian inference to an exoplanet's\ninterior model. A constant quality factor model is used to calculate the range\nof tidal heating, and a one-dimensional analytical model of tidally locked\nplanets is used to assess their surface temperature distribution and\nhabitability. Assuming no or only thin atmospheres, K2-18 b and TOI-1468 c are\nlikely to be water worlds. However, TOI-1452 b and LHS 1140 b may have rocky\nsurfaces. We find that tidal heating is not enough to raise the global mean\nsurface temperature, but greenhouse heating can effectively do so. If the\nconsidered planets have retained thick atmospheres, K2-18 b, TOI-1468 c, and\nTOI-1452 b may, for significant atmospheric heating and heat transport factors,\nbe too hot to sustain liquid water on their surface. However, the lower\ninstellation of LHS 1140 b and the non-zero probability of it having a rocky\nsurface give more space for habitable conditions on the planet.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ESe5pqFNktF6e8t0wNNIRhhtrrua2eKFStDIQNgw9JQ","pdfSize":"1033142"}