{"id":"2412.02060","title":"IFUM Integrated Field Spectroscopy of Ten M104 Satellite Galaxy\n  Candidates","authors":"Ethan Crosby, Mario Mateo, Ivanna Escala, Helmut Jerjen, Oliver\n  M\\\"uller and Marcel S. Pawlowski","authorsParsed":[["Crosby","Ethan",""],["Mateo","Mario",""],["Escala","Ivanna",""],["Jerjen","Helmut",""],["Müller","Oliver",""],["Pawlowski","Marcel S.",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 00:45:14 GMT"}],"updateDate":"2024-12-04","timestamp":1733186714000,"abstract":"  We report the spectroscopic analysis of ten satellite galaxy candidates in\nthe sphere of influence of the Sombrero galaxy (M104, NGC4594), based on data\nobtained with IFUM (Integral Field Units for Magellan). Based on their\nnewly-observed recessional velocities, we confirm that nine of these candidates\nare satellite galaxies of M104, with one being a background dwarf galaxy. All\nten dwarfs have stellar masses $2\\times10^{7}\\,M_{\\odot}$ to\n$1\\times10^{9}\\,M_{\\odot}$ and mean weighted metallicities\n$-1.7<\\langle{[\\mathrm{M/H}]}\\rangle<-0.3$. Although these dwarfs are\npredominantly old, with stellar populations $\\sim5-11\\,$Gyr. However, this\nsample contains a local example of a low-mass \"Green Pea\" candidate, it\nexhibits extreme optical emission features and broad emission line features\n($\\sigma\\sim250\\,\\mathrm{km\\,s^{-1}}$) reminiscent of high-redshift\nLy$\\alpha$/LyC photon leaking galaxies. Using the newly-acquired recessional\nvelocities of the nine satellites of M104, we find no evidence of coherent\nsatellite motions unlike other nearby $L_*$ galaxy environments. Given the\nsmall sample, this results does not statistically rule out such coherent\nmotions. There remain 60 satellite candidates of M104 for which future\nspectroscopy can more reliably test for such motion. Using the observed dwarf\ngalaxies as tracers of the gravitational potential of M104, we estimate the\ndynamical mass of M104, $M_{dyn}=(12.4\\pm6.5)\\times10^{12}M_{\\odot}$, and find\nthat, making a reasonable estimate of M104's gas mass, $>90\\%$ of its baryons\nare missing. These results agree with previous measurements of M104's dynamical\nmass.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"5IBUICgUr6MR_EFaKqgebfLFBX1hNwzkMJ9EbGL8Dbk","pdfSize":"1125542"}