{
  "id": "2412.06127",
  "title": "HSDA: High-frequency Shuffle Data Augmentation for Bird's-Eye-View Map\n  Segmentation",
  "authors": "Calvin Glisson and Qiuxiao Chen",
  "authorsParsed": [
    [
      "Glisson",
      "Calvin",
      ""
    ],
    [
      "Chen",
      "Qiuxiao",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 01:15:08 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733706908000,
  "abstract": "  Autonomous driving has garnered significant attention in recent research, and\nBird's-Eye-View (BEV) map segmentation plays a vital role in the field,\nproviding the basis for safe and reliable operation. While data augmentation is\na commonly used technique for improving BEV map segmentation networks, existing\napproaches predominantly focus on manipulating spatial domain representations.\nIn this work, we investigate the potential of frequency domain data\naugmentation for camera-based BEV map segmentation. We observe that\nhigh-frequency information in camera images is particularly crucial for\naccurate segmentation. Based on this insight, we propose High-frequency Shuffle\nData Augmentation (HSDA), a novel data augmentation strategy that enhances a\nnetwork's ability to interpret high-frequency image content. This approach\nencourages the network to distinguish relevant high-frequency information from\nnoise, leading to improved segmentation results for small and intricate image\nregions, as well as sharper edge and detail perception. Evaluated on the\nnuScenes dataset, our method demonstrates broad applicability across various\nBEV map segmentation networks, achieving a new state-of-the-art mean\nIntersection over Union (mIoU) of 61.3% for camera-only systems. This\nsignificant improvement underscores the potential of frequency domain data\naugmentation for advancing the field of autonomous driving perception. Code has\nbeen released: https://github.com/Zarhult/HSDA\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "zf7ZH59ylyxpCh8gw9a9bpx0uvIaedzOZsogiocRXuk",
  "pdfSize": "9214676"
}