{
  "id": "2412.05401",
  "title": "Rotational Velocities and Radii Estimates of Low-Mass Pre-Main Sequence\n  Stars in NGC 2264",
  "authors": "Laurin M. Gray, Katherine L. Rhode, Catrina M. Hamilton-Drager,\n  Tiffany Picard, Luisa M. Rebull",
  "authorsParsed": [
    [
      "Gray",
      "Laurin M.",
      ""
    ],
    [
      "Rhode",
      "Katherine L.",
      ""
    ],
    [
      "Hamilton-Drager",
      "Catrina M.",
      ""
    ],
    [
      "Picard",
      "Tiffany",
      ""
    ],
    [
      "Rebull",
      "Luisa M.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 19:57:55 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733515075000,
  "abstract": "  Investigating the angular momentum evolution of pre-main sequence (PMS) stars\nprovides important insight into the interactions between Sun-like stars and\ntheir protoplanetary disks, and the timescales that govern disk dissipation and\nplanet formation. We present projected rotational velocities (v sin i values)\nof 254 T Tauri stars (TTSs) in the ~3 Myr-old open cluster NGC 2264, measured\nusing high-dispersion spectra from the WIYN 3.5m telescope's Hydra instrument.\nWe combine these with literature values of temperature, rotation period,\nluminosity, disk classification, and binarity. We find some evidence that\nWeak-lined TTSs may rotate faster than their Classical TTS counterparts and\nthat stars in binary systems may rotate faster than single stars. We also\ncombine our v sin i measurements with rotation period to estimate the projected\nstellar radii of our sample stars, and then use a maximum likelihood modeling\ntechnique to compare our radii estimates to predicted values from stellar\nevolution models. We find that starspot-free models tend to underestimate the\nradii of the PMS stars at the age of the cluster, while models that incorporate\nstarspots are more successful. We also observe a mass dependence in the degree\nof radius inflation, which may be a result of differences in the birthline\nlocation on the HR diagram. Our study of NGC 2264 serves as a pilot study for\nanalysis methods to be applied to four other clusters ranging in age from 1 to\n14 Myr, which is the timescale over which protoplanetary disks dissipate and\nplanetary systems begin to form.\n",
  "subjects": [
    "Astrophysics/Solar and Stellar Astrophysics",
    "Astrophysics/Earth and Planetary Astrophysics",
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "wUbDFsvKqB7CCJydqg0cDChFPO_Gb7Co4RJAkv8F-xk",
  "pdfSize": "924071"
}