{
  "id": "2412.11188",
  "title": "Assessing the Robustness and Resilience of U.S. Strategic Highways: A\n  Network Science Perspective",
  "authors": "Sukhwan Chung, Daniel Sardak, Jeffrey Cegan, and Igor Linkov",
  "authorsParsed": [
    [
      "Chung",
      "Sukhwan",
      ""
    ],
    [
      "Sardak",
      "Daniel",
      ""
    ],
    [
      "Cegan",
      "Jeffrey",
      ""
    ],
    [
      "Linkov",
      "Igor",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 15 Dec 2024 13:45:11 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734270311000,
  "abstract": "  Network science is a powerful tool for analyzing transportation networks,\noffering insights into their structures and enabling the quantification of\nresilience and robustness. Understanding the underlying structures of\ntransportation networks is crucial for effective infrastructure planning and\nmaintenance. In military contexts, network science is valuable for analyzing\nlogistics networks, critical for the movement and supply of troops and\nequipment. The U.S. Army's logistical success, particularly in the\n\"fort-to-port\" phase, relies heavily on the Strategic Highway Network\n(STRAHNET) in the U.S., which is a system of public highways crucial for\nmilitary deployments. However, the shared nature of these networks with\ncivilian users introduces unique challenges, including vulnerabilities to\ncyberattacks and physical sabotage, which is highlighted by the concept of\ncontested logistics. This paper proposes a method using network science and\ngeographic information systems (GIS) to assess the robustness and resilience of\ntransportation networks, specifically applied to military logistics. Our\nfindings indicate that while the STRAHNET is robust against targeted\ndisruptions, it is more resilient to random disruptions.\n",
  "subjects": [
    "Physics/Physics and Society"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "IL_WMBFWEk_EEmoPnsTJBUzzDmzxq85Oaijb7IAoogc",
  "pdfSize": "1768144"
}