{"id":"2412.11488","title":"Counting Butterflies over Streaming Bipartite Graphs with Duplicate\n  Edges","authors":"Lingkai Meng, Long Yuan, Xuemin Lin, Chengjie Li, Kai Wang, and Wenjie\n  Zhang","authorsParsed":[["Meng","Lingkai",""],["Yuan","Long",""],["Lin","Xuemin",""],["Li","Chengjie",""],["Wang","Kai",""],["Zhang","Wenjie",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 07:04:54 GMT"}],"updateDate":"2024-12-17","timestamp":1734332694000,"abstract":"  Bipartite graphs are commonly used to model relationships between two\ndistinct entities in real-world applications, such as user-product\ninteractions, user-movie ratings and collaborations between authors and\npublications. A butterfly (a 2x2 bi-clique) is a critical substructure in\nbipartite graphs, playing a significant role in tasks like community detection,\nfraud detection, and link prediction. As more real-world data is presented in a\nstreaming format, efficiently counting butterflies in streaming bipartite\ngraphs has become increasingly important. However, most existing algorithms\ntypically assume that duplicate edges are absent, which is hard to hold in\nreal-world graph streams, as a result, they tend to sample edges that appear\nmultiple times, leading to inaccurate results. The only algorithm designed to\nhandle duplicate edges is FABLE, but it suffers from significant limitations,\nincluding high variance, substantial time complexity, and memory inefficiency\ndue to its reliance on a priority queue. To overcome these limitations, we\nintroduce DEABC (Duplicate-Edge-Aware Butterfly Counting), an innovative method\nthat uses bucket-based priority sampling to accurately estimate the number of\nbutterflies, accounting for duplicate edges. Compared to existing methods,\nDEABC significantly reduces memory usage by storing only the essential sampled\nedge data while maintaining high accuracy. We provide rigorous proofs of the\nunbiasedness and variance bounds for DEABC, ensuring they achieve high\naccuracy. We compare DEABC with state-of-the-art algorithms on real-world\nstreaming bipartite graphs. The results show that our DEABC outperforms\nexisting methods in memory efficiency and accuracy, while also achieving\nsignificantly higher throughput.\n","subjects":["Computer Science/Data Structures and Algorithms"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"HMJmxyjyd-s4aBDPnWZRd12AkJZ7LRpUohK2sxBi35A","pdfSize":"987344"}