{
  "id": "2412.12813",
  "title": "Confirmation of the planetary nebula nature of HaTr 5. Not the remnant\n  of Nova Sco 1437",
  "authors": "M. A. Guerrero, E. Santamaria, G. Liberato, Q. A. Parker, D. R.\n  Goncalves, J. B. Rodriguez-Gonzalez, A. Ritter, H. Yuan, and J. A. Toala",
  "authorsParsed": [
    [
      "Guerrero",
      "M. A.",
      ""
    ],
    [
      "Santamaria",
      "E.",
      ""
    ],
    [
      "Liberato",
      "G.",
      ""
    ],
    [
      "Parker",
      "Q. A.",
      ""
    ],
    [
      "Goncalves",
      "D. R.",
      ""
    ],
    [
      "Rodriguez-Gonzalez",
      "J. B.",
      ""
    ],
    [
      "Ritter",
      "A.",
      ""
    ],
    [
      "Yuan",
      "H.",
      ""
    ],
    [
      "Toala",
      "J. A.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 11:31:15 GMT"
    }
  ],
  "updateDate": "2025-02-12",
  "timestamp": 1734435075000,
  "abstract": "  The identification of the nebula HaTr 5 with the shell remnant of the\nhistoric Nova Sco 1437 around the low-accretion rate cataclysmic variable 2MASS\nJ17022815-4306123 has been used in the framework of the hibernation scenario to\nset an upper limit of <580 yr to the transition time from a nova-like binary to\na dwarf nova. This work aims at clarifying the nature of HaTr 5, which has also\npreviously been proposed to be a possible planetary nebula. Intermediate- and\nhigh-dispersion long-slit spectra of HaTr\\,5 have been obtained and analyzed in\nconjunction with archival optical and infrared images to investigate its\nspectral properties using photoionization models, to derive its H-alpha flux\nand ionized mass, and to determine its spatio-kinematic by means of 3D models\nto clarify its true nature. The H-alpha flux of HaTr 5 implies an ionized mass\nof 0.059 M_Sun at the 0.99 kpc distance of J170228, i.e., about 1000 times the\ntypical ejecta of a nova. If HaTr\\,5 were actually an unrelated planetary\nnebula, its H-alpha flux implies a distance of 2.25 kpc and an ionized mass of\n0.47 M_Sun. The expansion velocity of HaTr 5 is found to be of 27 km/s, with a\nheliocentric radial velocity of -1 km/. The ionized mass of HaTr 5 and its\nexpansion velocity (and associated kinematic age) are clearly inconsistent with\nthose expected for a nova remnant, which all strongly support a planetary\nnebula nature. The association of J170228 with HaTr 5 is further called into\nquestion by their differing radial velocities and almost orthogonal motions on\nthe plane of the sky. It is concluded that HaTr 5 is an old, evolved planetary\nnebula unrelated to the remnant of Nova Sco 1437 and to the cataclysmic\nvariable J170228, the latter being by chance projected onto HaTr 5.\n",
  "subjects": [
    "Astrophysics/Solar and Stellar Astrophysics",
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "x0bJHKWhUCirGn5cNnIduK770uj1sxCgLBWLVo3cWAw",
  "pdfSize": "7122206"
}