{
  "id": "2412.09071",
  "title": "Detrimental 2$p$-3$d$ Hybridisation in Ni Nanosheets Supported on\n  Strontium Dioxide for Catalytic H$_2$ Production, Necessitating Thickness\n  Optimisation",
  "authors": "Kabir S. Suraj and M. Hussein N. Assadi",
  "authorsParsed": [
    [
      "Suraj",
      "Kabir S.",
      ""
    ],
    [
      "Assadi",
      "M. Hussein N.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 08:54:27 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1733993667000,
  "abstract": "  We employ accurate density functional theory calculations to examine the\nelectronic structure of three Ni/SrO$_2$ nanostructures containing\nsingle-layer, bilayer and four-layer Ni nanosheets. The single Ni layer\ninteracts strongly with the topmost oxygen layer at the Ni/SrO$_2$ interface,\nresulting in significant surface reconstruction and strong hybridisation\nbetween the O $2p$ and Ni $3d$ states. For the bilayer Ni, the layer facing the\ninterface also strongly interacts with the O. However, the second layer retains\nits geometry. For the four-layer system, none of the Ni layers interacted\nstrongly with O. According to the electronic population analysis, in the\nthinnest nanosheets, the strong hybridisation with oxygen pulls Ni's $3d$\nstates away from the Fermi level deeper into the valence band. In these cases,\nNi's electronic population that is labile for catalysis in the vicinity of the\nFermi level was as little as half of the bilayer nanosheet. Such reduction in\nthe labile $3d$ population has a detrimental effect on Ni's catalytic\nperformance in de-hydrogenating formic acid. Our results demonstrate that there\nis an optimum dimension for Ni nanoparticles below or above which the catalytic\nperformance deteriorates. Consequently, reducing the Ni dimension to maximise\nthe surface in the hope of better catalytic yield might not be the best\nstrategy as detrimental $p$-$d$ hybridisation takes hold. Smaller might not\nalways be better after all!\n",
  "subjects": [
    "Condensed Matter/Materials Science",
    "Condensed Matter/Mesoscale and Nanoscale Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "vNvjsszxP1dGrv1MlXT6wUhHI3rFA-Z8u4VfVTWvpsg",
  "pdfSize": "4478626"
}