{
  "id": "2412.12738",
  "title": "Strong and weak symmetries and their spontaneous symmetry breaking in\n  mixed states emerging from the quantum Ising model under multiple decoherence",
  "authors": "Takahiro Orito, Yoshihito Kuno, Ikuo Ichinose",
  "authorsParsed": [
    [
      "Orito",
      "Takahiro",
      ""
    ],
    [
      "Kuno",
      "Yoshihito",
      ""
    ],
    [
      "Ichinose",
      "Ikuo",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 10:00:29 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 7 Jan 2025 06:23:59 GMT"
    },
    {
      "version": "v3",
      "created": "Sun, 26 Jan 2025 13:32:53 GMT"
    }
  ],
  "updateDate": "2025-01-28",
  "timestamp": 1734429629000,
  "abstract": "  Discovering and categorizing quantum orders in mixed many-body systems are\ncurrently one of the most important problems. Specific types of decoherence\napplied to typical quantum many-body states can induce a novel kind of mixed\nstate accompanying characteristic symmetry orders, which has no counterparts in\npure many-body states. We study phenomena generated by interplay between two\ntypes of decoherence applied to the one-dimensional transverse field Ising\nmodel (TFIM). We show that in the doubled Hilbert space formalism, the\ndecoherence can be described by filtering operation applied to matrix product\nstates (MPS) defined in the doubled Hilbert system. The filtering operation\ninduces specific deformation of the MPS, which approximates the ground state of\na certain parent Hamiltonian in the doubled Hilbert space. In the present case,\nsuch a parent Hamiltonian is the quantum Ashkin-Teller model, having a rich\nphase diagram with a critical lines and quantum phase transitions. By\ninvestigating the deformed MPS, we find various types of mixed states emergent\nfrom the ground states of the TFIM, and clarify phase transitions between them.\nIn that study, strong and weak $Z_2$ symmetries play an important role, for\nwhich we introduce efficient order parameters, such as R\\'{e}nyi-2 correlators,\nentanglement entropy, etc., in the doubled Hilbert space.\n",
  "subjects": [
    "Physics/Quantum Physics",
    "Condensed Matter/Disordered Systems and Neural Networks",
    "Condensed Matter/Statistical Mechanics",
    "Condensed Matter/Strongly Correlated Electrons"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "AvqezYB2N3tz-iU1-3fr0ucDDvNgFBYe0-d8-_qeTjQ",
  "pdfSize": "794545"
}