{
  "id": "2412.13910",
  "title": "Quantifying Stress States of Theoretically Modelled Polarimetric\n  Measurements on Dielectric Media",
  "authors": "Felix B. M\\\"uller and Georgios Ctistis",
  "authorsParsed": [
    [
      "Müller",
      "Felix B.",
      ""
    ],
    [
      "Ctistis",
      "Georgios",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 14:51:54 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734533514000,
  "abstract": "  This work introduces and characterizes a theoretical model of a reflective\npolarimetric measurement technique determining the surface stress of a\ndielectric material, e.g. glass. We have developed a procedure to reconstruct\nthe actual stress state, which is the orientation and value of the principal\naxes of stress, from the calculated Stokes vector components that would appear\nas polarization signals in a measurement. We consider a special geometry of the\nprinciple stress axis, where we chose one of them to be perpendicular to the\nsurface and relaxed to a zero value. Our new approach of reconstructing surface\nstress states from reflected polarization states embraces the determination of\nthe reflection M\\\"uller matrix. With that and an initial Stokes vector, the\nresulting reflected Stokes vector is calculated to create a database. The\ndatabase represents the dependence of the resulting Stokes vector on the\ninitial Stokes vector and the stress states included in the reflection matrix,\nwhich is iteratively calculated for several stress components and its\norientations. Introducing a model for the dependency of the reflected Stokes\nvector components on the stress states and fitting it to the database results\nin a system of equations of those dependencies which are solved for the stress\nstate components and orientation. Finally, we found a theoretical determination\naccuracy of the model for surface stress magnitude to be of the order of a few\nMPa.\n",
  "subjects": [
    "Physics/Optics",
    "Physics/Applied Physics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "Bxj5OMjrzjOxWpU4MDhQDGjGbcyJFZPRqeMjt7nJKPA",
  "pdfSize": "12068695"
}