{
  "id": "2412.19494",
  "title": "Retrieval-augmented Generation for GenAI-enabled Semantic Communications",
  "authors": "Shunpu Tang, Ruichen Zhang, Yuxuan Yan, Qianqian Yang, Dusit Niyato,\n  Xianbin Wang, Shiwen Mao",
  "authorsParsed": [
    [
      "Tang",
      "Shunpu",
      ""
    ],
    [
      "Zhang",
      "Ruichen",
      ""
    ],
    [
      "Yan",
      "Yuxuan",
      ""
    ],
    [
      "Yang",
      "Qianqian",
      ""
    ],
    [
      "Niyato",
      "Dusit",
      ""
    ],
    [
      "Wang",
      "Xianbin",
      ""
    ],
    [
      "Mao",
      "Shiwen",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 27 Dec 2024 07:30:01 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735284601000,
  "abstract": "  Semantic communication (SemCom) is an emerging paradigm aiming at\ntransmitting only task-relevant semantic information to the receiver, which can\nsignificantly improve communication efficiency. Recent advancements in\ngenerative artificial intelligence (GenAI) have empowered GenAI-enabled SemCom\n(GenSemCom) to further expand its potential in various applications. However,\ncurrent GenSemCom systems still face challenges such as semantic inconsistency,\nlimited adaptability to diverse tasks and dynamic environments, and the\ninability to leverage insights from past transmission. Motivated by the success\nof retrieval-augmented generation (RAG) in the domain of GenAI, this paper\nexplores the integration of RAG in GenSemCom systems. Specifically, we first\nprovide a comprehensive review of existing GenSemCom systems and the\nfundamentals of RAG techniques. We then discuss how RAG can be integrated into\nGenSemCom. Following this, we conduct a case study on semantic image\ntransmission using an RAG-enabled diffusion-based SemCom system, demonstrating\nthe effectiveness of the proposed integration. Finally, we outline future\ndirections for advancing RAG-enabled GenSemCom systems.\n",
  "subjects": [
    "Computer Science/Networking and Internet Architecture",
    "Computer Science/Information Theory",
    "Electrical Engineering and Systems Science/Signal Processing",
    "Mathematics/Information Theory"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "nR2KpYQrvOkK0Tb0xxJqs83EDU4ScBtgIZrHaE3l8u4",
  "pdfSize": "13183203"
}