{
  "id": "2412.21097",
  "title": "Effects of asymmetric dark matter on a magnetized neutron star: A\n  two-fluid approach",
  "authors": "Pinku Routaray, Vishal Parmar, H. C. Das, Bharat Kumar, G. F. Burgio,\n  H.-J. Schulze",
  "authorsParsed": [
    [
      "Routaray",
      "Pinku",
      ""
    ],
    [
      "Parmar",
      "Vishal",
      ""
    ],
    [
      "Das",
      "H. C.",
      ""
    ],
    [
      "Kumar",
      "Bharat",
      ""
    ],
    [
      "Burgio",
      "G. F.",
      ""
    ],
    [
      "Schulze",
      "H. -J.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 30 Dec 2024 17:20:29 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735579229000,
  "abstract": "  We study the interaction between dark matter (DM) and highly magnetized\nneutron stars (NSs), focusing on how DM particle mass, mass fraction, and\nmagnetic field (MF) strength affect NS structure and stability. We consider\nself-interacting, non-annihilating, asymmetric fermionic DM that couples to NSs\nonly through gravitational interaction. Using the QMC-RMF4 relativistic\nmean-field model with density-dependent magnetic fields, we investigate the\nmagnetized equation of state and examine the accumulation of DM under various\nconditions. Our results show that as the DM fraction increases, the maximum\ngravitational mass of the NS decreases, especially for heavier DM particles,\nwhile lighter DM particles can induce a transition from a dark core to a halo\nstructure, increasing the maximum mass. Strong MFs soften the equation of state\nand reduce the dark mass a NS core can retain before transitioning to a halo.\n",
  "subjects": [
    "Physics/Nuclear Theory",
    "Astrophysics/High Energy Astrophysical Phenomena",
    "Physics/General Relativity and Quantum Cosmology",
    "Physics/High Energy Physics - Phenomenology"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "8rQp3y5NjTskfZpszZ3oF8ZDfkLpy-2KzAqcztcY878",
  "pdfSize": "892639"
}