{"id":"2412.07009","title":"LUIEO: A Lightweight Model for Integrating Underwater Image Enhancement\n  and Object Detection","authors":"Bin Li, Li Li, Zhenwei Zhang, Yuping Duan","authorsParsed":[["Li","Bin",""],["Li","Li",""],["Zhang","Zhenwei",""],["Duan","Yuping",""]],"versions":[{"version":"v1","created":"Sun, 1 Dec 2024 14:01:30 GMT"}],"updateDate":"2024-12-11","timestamp":1733061690000,"abstract":"  Underwater optical images inevitably suffer from various degradation factors\nsuch as blurring, low contrast, and color distortion, which hinder the accuracy\nof object detection tasks. Due to the lack of paired underwater/clean images,\nmost research methods adopt a strategy of first enhancing and then detecting,\nresulting in a lack of feature communication between the two learning tasks. On\nthe other hand, due to the contradiction between the diverse degradation\nfactors of underwater images and the limited number of samples, existing\nunderwater enhancement methods are difficult to effectively enhance degraded\nimages of unknown water bodies, thereby limiting the improvement of object\ndetection accuracy. Therefore, most underwater target detection results are\nstill displayed on degraded images, making it difficult to visually judge the\ncorrectness of the detection results. To address the above issues, this paper\nproposes a multi-task learning method that simultaneously enhances underwater\nimages and improves detection accuracy. Compared with single-task learning, the\nintegrated model allows for the dynamic adjustment of information communication\nand sharing between different tasks. Due to the fact that real underwater\nimages can only provide annotated object labels, this paper introduces physical\nconstraints to ensure that object detection tasks do not interfere with image\nenhancement tasks. Therefore, this article introduces a physical module to\ndecompose underwater images into clean images, background light, and\ntransmission images and uses a physical model to calculate underwater images\nfor self-supervision. Numerical experiments demonstrate that the proposed model\nachieves satisfactory results in visual performance, object detection accuracy,\nand detection efficiency compared to state-of-the-art comparative methods.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"G-Fe3sFMiiVyCLpOZe-15Tq6JfV3xZ36xEOMYDzy-xo","pdfSize":"52012276"}