{"id":"2412.04540","title":"Unveiling the Origins and Dynamics of the Hierarchical Triple Star\n  System CN Lyn","authors":"G. Yucel, V Bakis, R. Canbay, N. Alan, T. Banks, S. Bilir","authorsParsed":[["Yucel","G.",""],["Bakis","V",""],["Canbay","R.",""],["Alan","N.",""],["Banks","T.",""],["Bilir","S.",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 19:00:00 GMT"}],"updateDate":"2024-12-09","timestamp":1733425200000,"abstract":"  In this study we present a detailed analysis of CN Lyn, an overlooked triple\nstar system, by combining spectroscopic data from the literature, photometric\n\\textit{TESS} data, and kinematic techniques. We updated the fundamental\nparameters of the known eclipsing components in the system with high precision.\nThe chemical composition of both eclipsing components (Aab) and the third\ncomponent (B) in the system were calculated with great accuracy. According to\nour analysis the mass, radius, and metallicity of the eclipsing components are\n$1.166_{-0.012}^{+0.013}\\,M_\\odot$, $1.786_{-0.014}^{+0.013}\\,R_\\odot$, and\n$-0.78_{-0.02}^{+0.02}$ dex for Aa and $1.143_{-0.012}^{+0.013}\\,M_\\odot$,\n$1.651_{-0.013}^{+0.014}\\,R_\\odot$, and $-0.55_{-0.02}^{+0.03}$ dex for Ab. The\npair's age is $3.89_{-0.10}^{+0.10}$ Gyr. The mass, radius, metallicity, and\nage for B are $0.85_{-0.23}^{+0.23}\\,M_\\odot$,\n$1.436_{-0.023}^{+0.026}\\,R_\\odot$, $-1.83_{-0.11}^{+0.09}$ dex, and\n$12.5_{-2.5}^{+2.5}$ Gyr, respectively. It is also found that the triple system\n(AabB) satisfies the stability criteria for the hierarchical triple system.\nKinematic and Galactic orbital parameters of CN Lyn were obtained from the\nastrometric and spectroscopic data of the system. Dynamical orbital analyses,\ntaking into account the ages of the component stars in the central binary\nsystem (A) show that the CN Lyn originated at the metal-poor edge of the\nGalactic disk. The third component of the system was found to be a member of\nthe halo population in terms of age, $\\alpha$ elements and metal abundance.\nGiven the different chemical abundances and age of B compared to A, this\nsuggests that the third component was captured by the central system in a\nregion with weak gravitational interactions far beyond the Galactic disc.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"3xEh3OGYx_DMT6QVeSesq-DAj2lFoyJeM2zbDGEpczE","pdfSize":"4443304"}