{
  "id": "2412.08866",
  "title": "Defect Dynamics in Cholesterics: Beyond the Peach-Koehler Force",
  "authors": "Joseph Pollard and Richard G. Morris",
  "authorsParsed": [
    [
      "Pollard",
      "Joseph",
      ""
    ],
    [
      "Morris",
      "Richard G.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 01:56:27 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1733968587000,
  "abstract": "  The Peach-Koehler force between disclination lines was originally formulated\nin the study of crystalline solids, and has since been adopted to provide a\nnotion of interactions between disclination lines in nematic liquid crystals.\nHere, we argue that the standard formulation of this interaction force\nseemingly fails for materials where there is a symmetry-broken ground state,\nand suggest that this is due to the interaction between disclination lines and\nmerons: non-singular yet non-trivial topological solitons. We examine this in\nthe context of chiral nematic (cholesteric) liquid crystals, which provide a\nnatural setting for studying these interactions due to their energetic\npreference for meron tubes in the form of double-twist cylinders. Through a\ncombination of theory and simulation we demonstrate that, for sufficiently\nstrong chirality, defects of $+1/2$ winding will change their winding through\nthe emission of a meron line, and that interactions between the merons and\ndefects dominate over defect-defect interactions. Instead of Peach-Koehler\nframework, we employ a method based on contact topology - the Gray stability\ntheorem - to directly calculate the velocity field of the material. We apply\nour framework to point defects as well as disclination lines. Our results have\nimplications not just for chiral materials, but also for other phases with\nmodulated ground states, such as the twist-bend and splay-bend nematics.\n",
  "subjects": [
    "Condensed Matter/Soft Condensed Matter"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "1J2WZze1aSgL2tqEPWrAHHw6dUPBQ3WlCRSVjc3nTtA",
  "pdfSize": "3216125"
}