{
  "id": "2412.04796",
  "title": "Employee Well-being in the Age of AI: Perceptions, Concerns, Behaviors,\n  and Outcomes",
  "authors": "Soheila Sadeghi",
  "authorsParsed": [
    [
      "Sadeghi",
      "Soheila",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 06:07:44 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733465264000,
  "abstract": "  The growing integration of Artificial Intelligence (AI) into Human Resources\n(HR) processes has transformed the way organizations manage recruitment,\nperformance evaluation, and employee engagement. While AI offers numerous\nadvantages, such as improved efficiency, reduced bias, and\nhyper-personalization, it raises significant concerns about employee\nwell-being, job security, fairness, and transparency. This study examines how\nAI shapes employee perceptions, job satisfaction, mental health, and retention.\nKey findings reveal that while AI can enhance efficiency and reduce bias, it\nalso raises concerns about job security, fairness, and privacy. Transparency in\nAI systems emerges as a critical factor in fostering trust and positive\nemployee attitudes. AI systems can both support and undermine employee\nwell-being, depending on how they are implemented and perceived. The research\nintroduces an AI-employee well-being Interaction Framework, illustrating how AI\ninfluences employee perceptions, behaviors, and outcomes. Organizational\nstrategies, such as clear communication, upskilling programs, and employee\ninvolvement in AI implementation, are identified as crucial for mitigating\nnegative impacts and enhancing positive outcomes. The study concludes that the\nsuccessful integration of AI in HR requires a balanced approach that\nprioritizes employee well-being, facilitates human-AI collaboration, and\nensures ethical and transparent AI practices alongside technological\nadvancement.\n",
  "subjects": [
    "Computer Science/Computers and Society",
    "Computer Science/Human-Computer Interaction"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "IFUoxuA98-2LQuhBqTn4Or0UmFVmrPLemItFiPjlL4s",
  "pdfSize": "300423"
}