{"id":"2412.14757","title":"Space-time Peer-to-Peer Distribution of Multi-party Entanglement for Any\n  Quantum Network","authors":"Yuexun Huang, Xiangyu Ren, Bikun Li, Yat Wong, Liang Jiang","authorsParsed":[["Huang","Yuexun",""],["Ren","Xiangyu",""],["Li","Bikun",""],["Wong","Yat",""],["Jiang","Liang",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 11:37:32 GMT"},{"version":"v2","created":"Tue, 24 Dec 2024 03:58:40 GMT"}],"updateDate":"2024-12-25","timestamp":1734608252000,"abstract":"  Graph states are a class of important multiparty entangled states, of which\nbell pairs are the special case. Realizing a robust and fast distribution of\narbitrary graph states in the downstream layer of the quantum network can be\nessential for further large-scale quantum networks. We propose a novel quantum\nnetwork protocol called P2PGSD inspired by the classical Peer-to-Peer (P2P)\nnetwork to efficiently implement the general graph state distribution in the\nnetwork layer, which demonstrates advantages in resource efficiency and\nscalability over existing methods for sparse graph states. An explicit\nmathematical model for a general graph state distribution problem has also been\nconstructed, above which the intractability for a wide class of resource\nminimization problems is proved and the optimality of the existing algorithms\nis discussed. In addition, we leverage the spacetime quantum network inspired\nby the symmetry from relativity for memory management in network problems and\nused it to improve our proposed algorithm. The advantages of our protocols are\nconfirmed by numerical simulations showing an improvement of up to 50% for\ngeneral sparse graph states, paving the way for a resource-efficient multiparty\nentanglement distribution across any network topology.\n","subjects":["Physics/Quantum Physics","Computer Science/Networking and Internet Architecture"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"YMnsIJktyqv7WxP1BNVJTqmrLDs7Z4SETY-UneTHMaM","pdfSize":"1849953"}