{
  "id": "2412.11483",
  "title": "\"They've Stolen My GPL-Licensed Model!\": Toward Standardized and\n  Transparent Model Licensing",
  "authors": "Moming Duan, Rui Zhao, Linshan Jiang, Nigel Shadbolt, Bingsheng He",
  "authorsParsed": [
    [
      "Duan",
      "Moming",
      ""
    ],
    [
      "Zhao",
      "Rui",
      ""
    ],
    [
      "Jiang",
      "Linshan",
      ""
    ],
    [
      "Shadbolt",
      "Nigel",
      ""
    ],
    [
      "He",
      "Bingsheng",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 06:52:09 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734331929000,
  "abstract": "  As model parameter sizes reach the billion-level range and their training\nconsumes zettaFLOPs of computation, components reuse and collaborative\ndevelopment are become increasingly prevalent in the Machine Learning (ML)\ncommunity. These components, including models, software, and datasets, may\noriginate from various sources and be published under different licenses, which\ngovern the use and distribution of licensed works and their derivatives.\nHowever, commonly chosen licenses, such as GPL and Apache, are\nsoftware-specific and are not clearly defined or bounded in the context of\nmodel publishing. Meanwhile, the reused components may also have free-content\nlicenses and model licenses, which pose a potential risk of license\nnoncompliance and rights infringement within the model production workflow. In\nthis paper, we propose addressing the above challenges along two lines: 1) For\nlicense analysis, we have developed a new vocabulary for ML workflow management\nand encoded license rules to enable ontological reasoning for analyzing rights\ngranting and compliance issues. 2) For standardized model publishing, we have\ndrafted a set of model licenses that provide flexible options to meet the\ndiverse needs of model publishing. Our analysis tool is built on Turtle\nlanguage and Notation3 reasoning engine, envisioned as a first step toward\nLinked Open Model Production Data. We have also encoded our proposed model\nlicenses into rules and demonstrated the effects of GPL and other commonly used\nlicenses in model publishing, along with the flexibility advantages of our\nlicenses, through comparisons and experiments.\n",
  "subjects": [
    "Computer Science/Computers and Society",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "WebDuY-eiTYtkwK-iiWUTeNWQON_XDe0LGe2keSU1fQ",
  "pdfSize": "1511811"
}