{"id":"2412.16322","title":"A multiscale radiation biophysical stochastic model describing the cell\n  survival response at ultra-high dose rate","authors":"Marco Battestini, Marta Missiaggia, Sara Bolzoni, Francesco G. Cordoni\n  and Emanuele Scifoni","authorsParsed":[["Battestini","Marco",""],["Missiaggia","Marta",""],["Bolzoni","Sara",""],["Cordoni","Francesco G.",""],["Scifoni","Emanuele",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 20:21:36 GMT"}],"updateDate":"2024-12-24","timestamp":1734726096000,"abstract":"  Ultra-high dose-rate (UHDR) radiotherapy, characterized by an extremely high\nradiation delivery rate, represents one of the most recent and promising\nfrontier in radiotherapy. UHDR radiotherapy, addressed in the field as FLASH\nradiotherapy, is a disruptive treatment modality with several benefits,\nincluding significantly shorter treatment times, unchanged effectiveness in\ntreating tumors, and clear reductions in side effects on normal tissues. While\nthe benefits of UHDR irradiation have been well highlighted experimentally, the\nbiological mechanism underlying the FLASH effect is still unclear and highly\ndebated. Nonetheless, to effectively use UHDR radiotherapy in clinics,\nunderstanding the driving biological mechanism is paramount. Since the\nconcurrent involvement of multiple scales of radiation damage has been\nsuggested, we developed the MultiScale Generalized Stochastic Microdosimetric\nModel (MS-GSM2), a multi-stage extension of the GSM2, which is a probabilistic\nmodel describing the time evolution of the DNA damage in an irradiated cell\nnucleus. The MS-GSM2 can investigate several chemical species combined effects,\nDNA damage formation, and time evolution. We demonstrate that the MS-GSM2 can\npredict various in-vitro UHDR experimental results across various oxygenation\nlevels, radiation types, and energies. The MS-GSM2 can accurately describe the\nempirical trend of dose and dose rate-dependent cell sensitivity over a wide\nrange, consistently describing multiple aspects of the FLASH effect and\nreproducing the main evidence from the in-vitro experimental data. Our model\nalso proposes a consistent explanation for the differential outcomes observed\nin normal tissues and tumors, in-vivo and in-vitro.\n","subjects":["Physics/Biological Physics","Physics/Medical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Pp3EjRQqaLnBKpZHVpVMsBpQcMPUNf6NRwNyvCchP6A","pdfSize":"4126679"}