{"id":"2412.01198","title":"One-step Fabrication of Sharp Platinum/Iridium Tips via\n  Amplitude-Modulated Alternating-Current Electropolishing","authors":"Yuto Nishiwaki, Toru Utsunomiya, Shu Kurokawa and Takashi Ichii","authorsParsed":[["Nishiwaki","Yuto",""],["Utsunomiya","Toru",""],["Kurokawa","Shu",""],["Ichii","Takashi",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 07:01:22 GMT"},{"version":"v2","created":"Mon, 17 Feb 2025 04:02:38 GMT"}],"updateDate":"2025-02-18","timestamp":1733122882000,"abstract":"  The platinum/iridium (Pt/Ir) alloy tip for scanning probe microscopy (SPM)\nwas fabricated by amplitude-modulated alternating-current (AC)\nelectropolishing. The clean tips with a radius of curvature less than 100 nm\nwere reproducibly obtained by applying the sinusoidal voltage in the frequency\n($f_0$) of $900\\ \\mathrm{Hz} \\leq f_0 \\leq 1500\\ \\mathrm{Hz}$ with amplitude\nmodulation by the sinusoidal wave in the modulation frequency ($f_s$) of\n$f_s=0.1f_0$ in $\\mathrm{CaCl}_2$/$\\mathrm{H_2O}$/acetone solution. The\nanalyses by scanning electron microscopy with an energy-dispersive X-ray\nanalyzer (SEM-EDX) and atom probe tomography (APT) showed that a uniform Pt/Ir\nalloy was exposed on the tip surface as a clean surface without O or Cl\ncontamination. The STM imaging using the fabricated tip showed that it is more\nsuitable for investigating rough surfaces than conventional as-cut tips and\napplicable for atomic-resolution imaging. Furthermore, we applied the\nfabricated tip to qPlus AFM analysis in liquid and showed that it has atomic\nresolution in both the horizontal and vertical directions. Therefore, it is\nconcluded that the amplitude-modulated AC etching method reproducibly provides\nsharp STM/AFM tips capable of both atomic resolution and large-area analyses\nwithout complex etching setups.\n","subjects":["Condensed Matter/Materials Science","Physics/Applied Physics","Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"lDv6P0E39nEksZsBCnhRELr0cRkKMDj9iWuNMH0TBLk","pdfSize":"36793471"}