{
  "id": "2412.19510",
  "title": "Parameter Efficient Fine-Tuning for Deep Learning-Based Full-Waveform\n  Inversion",
  "authors": "Koustav Ghosal, Abhranta Panigrahi, Arnav Chavan, ArunSingh and Deepak\n  Gupta",
  "authorsParsed": [
    [
      "Ghosal",
      "Koustav",
      ""
    ],
    [
      "Panigrahi",
      "Abhranta",
      ""
    ],
    [
      "Chavan",
      "Arnav",
      ""
    ],
    [
      "ArunSingh",
      "",
      ""
    ],
    [
      "Gupta",
      "Deepak",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 27 Dec 2024 08:00:12 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735286412000,
  "abstract": "  Seismic full waveform inversion (FWI) has seen promising advancements through\ndeep learning. Existing approaches typically focus on task-specific models\ntrained and evaluated in isolation that lead to limited generalization across\ndifferent geological scenarios. In this work we introduce a task-agnostic\nfoundational model for FWI that captures general features across tasks. We\nfirst demonstrate that full fine-tuning of this foundational model outperforms\ntask-specific models built from scratch by delivering superior performance\nacross multiple benchmarks. Building upon this we employ parameter-efficient\nfine-tuning (PEFT) to further reduce computational overhead. By fine-tuning\nonly a small fraction of the model parameters PEFT achieves comparable results\nto full fine-tuning while significantly lowering memory and computational\nrequirements. Additionally, PEFT excels in out-of-distribution tasks where it\noutperforms both full fine-tuning and task-specific models. These findings\nestablish the value of foundational modeling for FWI and highlight PEFT as an\neffective strategy for efficient and scalable adaptation across diverse tasks.\n",
  "subjects": [
    "Computer Science/Computational Engineering, Finance, and Science",
    "Physics/Geophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "_R6VM88GVlBN-vfMor1D5grzToTMO9aVqLM_aUbToZg",
  "pdfSize": "13617139"
}