{"id":"2412.20972","title":"Efficient Estimation and Sequential Optimization of Cost Functions in\n  Variational Quantum Algorithms","authors":"Muhammad Umer, Eleftherios Mastorakis, Dimitris G. Angelakis","authorsParsed":[["Umer","Muhammad",""],["Mastorakis","Eleftherios",""],["Angelakis","Dimitris G.",""]],"versions":[{"version":"v1","created":"Mon, 30 Dec 2024 14:24:53 GMT"}],"updateDate":"2024-12-31","timestamp":1735568693000,"abstract":"  Classical optimization is a cornerstone of the success of variational quantum\nalgorithms, which often require determining the derivatives of the cost\nfunction relative to variational parameters. The computation of the cost\nfunction and its derivatives, coupled with their effective utilization,\nfacilitates faster convergence by enabling smooth navigation through complex\nlandscapes, ensuring the algorithm's success in addressing challenging\nvariational problems. In this work, we introduce a novel optimization\nmethodology that conceptualizes the parameterized quantum circuit as a weighted\nsum of distinct unitary operators, enabling the cost function to be expressed\nas a sum of multiple terms. This representation facilitates the efficient\nevaluation of nonlocal characteristics of cost functions, as well as their\narbitrary derivatives. The optimization protocol then utilizes the nonlocal\ninformation on the cost function to facilitate a more efficient navigation\nprocess, ultimately enhancing the performance in the pursuit of optimal\nsolutions. We utilize this methodology for two distinct cost functions. The\nfirst is the squared residual of the variational state relative to a target\nstate, which is subsequently employed to examine the nonlinear dynamics of\nfluid configurations governed by the one-dimensional Burgers' equation. The\nsecond cost function is the expectation value of an observable, which is later\nutilized to approximate the ground state of the nonlinear Schr\\\"{o}dinger\nequation. Our findings reveal substantial enhancements in convergence speed and\naccuracy relative to traditional optimization methods, even within complex,\nhigh-dimensional landscapes. Our work contributes to the advancement of\noptimization strategies for variational quantum algorithms, establishing a\nrobust framework for addressing a range of computationally intensive problems\nacross numerous applications.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"X3oovSMzUR2JekmHDWeVbxNtKVg76HbGD1AyeoZEeCg","pdfSize":"4946587"}