{"id":"2412.04075","title":"Does your model understand genes? A benchmark of gene properties for\n  biological and text models","authors":"Yoav Kan-Tor, Michael Morris Danziger, Eden Zohar, Matan Ninio and\n  Yishai Shimoni","authorsParsed":[["Kan-Tor","Yoav",""],["Danziger","Michael Morris",""],["Zohar","Eden",""],["Ninio","Matan",""],["Shimoni","Yishai",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 11:14:01 GMT"}],"updateDate":"2024-12-06","timestamp":1733397241000,"abstract":"  The application of deep learning methods, particularly foundation models, in\nbiological research has surged in recent years. These models can be text-based\nor trained on underlying biological data, especially omics data of various\ntypes. However, comparing the performance of these models consistently has\nproven to be a challenge due to differences in training data and downstream\ntasks. To tackle this problem, we developed an architecture-agnostic\nbenchmarking approach that, instead of evaluating the models directly,\nleverages entity representation vectors from each model and trains simple\npredictive models for each benchmarking task. This ensures that all types of\nmodels are evaluated using the same input and output types. Here we focus on\ngene properties collected from professionally curated bioinformatics databases.\nThese gene properties are categorized into five major groups: genomic\nproperties, regulatory functions, localization, biological processes, and\nprotein properties. Overall, we define hundreds of tasks based on these\ndatabases, which include binary, multi-label, and multi-class classification\ntasks. We apply these benchmark tasks to evaluate expression-based models,\nlarge language models, protein language models, DNA-based models, and\ntraditional baselines. Our findings suggest that text-based models and protein\nlanguage models generally outperform expression-based models in genomic\nproperties and regulatory functions tasks, whereas expression-based models\ndemonstrate superior performance in localization tasks. These results should\naid in the development of more informed artificial intelligence strategies for\nbiological understanding and therapeutic discovery. To ensure the\nreproducibility and transparency of our findings, we have made the source code\nand benchmark data publicly accessible for further investigation and expansion\nat github.com/BiomedSciAI/gene-benchmark.\n","subjects":["Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"XC2H0XG9HPYDObX1Zp2XRtBmUGTGRevSkge4J1Pd06I","pdfSize":"797020"}