{
  "id": "2412.14425",
  "title": "Time-Reversal Symmetry-Protected Coherent Control of Ultracold Molecular\n  Collisions",
  "authors": "Adrien Devolder, Timur V. Tscherbul and Paul Brumer",
  "authorsParsed": [
    [
      "Devolder",
      "Adrien",
      ""
    ],
    [
      "Tscherbul",
      "Timur V.",
      ""
    ],
    [
      "Brumer",
      "Paul",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 00:26:59 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734568019000,
  "abstract": "  Coherent control of atomic and molecular scattering relies on the preparation\nof colliding particles in superpositions of internal states, establishing\ninterfering pathways that can be used to tune the outcome of a scattering\nprocess. However, incoherent addition of different partial wave contributions\nto the integral cross sections (partial wave scrambling), commonly encountered\nin systems with complex collisional dynamics, poses a significant challenge,\noften limiting control. This work demonstrates that time-reversal symmetry can\novercome these limitations by constraining the relative phases of S-matrix\nelements, thereby protecting coherent control against partial wave scrambling,\neven for collisions mediated by highly anisotropic interactions. Using the\nexample of ultracold O$_2$-O$_2$ scattering, we show that coherent control is\nrobust against short-range dynamical complexity. Furthermore, the time-reversal\nsymmetry also protects the control against a distribution of collisional\nenergy. These findings show that ultracold scattering into the final states\nthat are time-reversal-invariant, such as the J = 0, M = 0 rotational state,\ncan always be optimally controlled by using time-reversal-invariant initial\nsuperpositions. Beyond the ultracold regime, we observe significant differences\nin the controllability of crossed-molecular beam vs. trap experiments with the\nformer being easier to control, emphasizing the cooperative role of\ntime-reversal and permutation symmetries in maintaining control at any\ntemperature. These results open new avenues for the coherent control of complex\ninelastic collisions and chemical reactions both in and outside of the\nultracold regime.\n",
  "subjects": [
    "Physics/Atomic Physics",
    "Physics/Chemical Physics",
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "qtZekfaTPsJDIle2HTC4u2b2SOYsAwFsFBynNs2mCD8",
  "pdfSize": "1293060"
}