{
  "id": "2412.08077",
  "title": "Ground-state properties and structure evolutions of odd-$A$ transuranium\n  Bk isotopes by deformed relativistic Hartree-Bogoliubov theory in continuum",
  "authors": "Zi-Dan Huang, Wei Zhang, Shuang-Quan Zhang, Ting-Ting Sun",
  "authorsParsed": [
    [
      "Huang",
      "Zi-Dan",
      ""
    ],
    [
      "Zhang",
      "Wei",
      ""
    ],
    [
      "Zhang",
      "Shuang-Quan",
      ""
    ],
    [
      "Sun",
      "Ting-Ting",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 03:48:55 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 17 Dec 2024 06:49:07 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1733888935000,
  "abstract": "  The studies of transuranium nuclei are of vital significance in exploring the\nexistence of the ``island of superheavy nuclei\". This work presents the\nsystematic investigations for the ground-state properties and structure\nevolutions of odd-$A$ transuranium Bk isotopes taking the deformed relativistic\nHartree-Bogoliubov theory in continuum~(DRHBc) with PC-PK1 density functional,\nin comparison with those by spherical relativistic continuum\nHartree-Bogoliubov~(RCHB) theory. The DRHBc calculations offer improved\ndescriptions of the binding energies, closely aligning with the experimental\ndata. The incorporation of deformation effects in DRHBc results in enhanced\nnuclear binding energies and a notable reduction in $\\alpha$-decay energies.\nWith the rotational corrections further incorporated, the theoretical deviation\nby DRHBc from the experimental data is further reduced. Based on the\ntwo-neutron gap $\\delta_{\\rm 2n}$ and the neutron pairing energy $E_{\\rm\npair}^n$, prominent shell closures at $N=184$ and $258$, as well as potential\nsub-shell structures at $N=142, 150, 162, 178, 218$, and $230$ are exhibited. A\nquasi-periodic variation among prolate, oblate, and spherical shapes as well as\nprolate deformation predominance have been shown in the evolutions of the\nquadrupole deformation. Possible shape coexistence is predicted in $^{331}$Bk\nwith the oblate and prolate minima in close energies, which is further\nsupported by the triaxial relativistic Hartree-Bogoliubov theory in\ncontinuum~(TRHBc) calculations.\n",
  "subjects": [
    "Physics/Nuclear Theory"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "CBLWUsgOMziqCm3ceGqgq9vZBcQz3B5N55pHlfYWkGY",
  "pdfSize": "4193197"
}