{"id":"2412.13280","title":"Political Fact-Checking Efforts are Constrained by Deficiencies in\n  Coverage, Speed, and Reach","authors":"Morgan Wack, Kayla Duskin, and Damian Hodel","authorsParsed":[["Wack","Morgan",""],["Duskin","Kayla",""],["Hodel","Damian",""]],"versions":[{"version":"v1","created":"Tue, 17 Dec 2024 19:15:08 GMT"}],"updateDate":"2024-12-19","timestamp":1734462908000,"abstract":"  Fact-checking has been promoted as a key method for combating political\nmisinformation. Comparing the spread of election-related misinformation\nnarratives along with their relevant political fact-checks, this study provides\nthe most comprehensive assessment to date of the real-world limitations faced\nby political fact-checking efforts. To examine barriers to impact, this study\nextends recent work from laboratory and experimental settings to the wider\nonline information ecosystem present during the 2022 U.S. midterm elections.\nFrom analyses conducted within this context, we find that fact-checks as\ncurrently developed and distributed are severely inhibited in election contexts\nby constraints on their i. coverage, ii. speed, and, iii. reach. Specifically,\nwe provide evidence that fewer than half of all prominent election-related\nmisinformation narratives were fact-checked. Within the subset of fact-checked\nclaims, we find that the median fact-check was released a full four days after\nthe initial appearance of a narrative. Using network analysis to estimate user\npartisanship and dynamics of information spread, we additionally find evidence\nthat fact-checks make up less than 1.2\\% of narrative conversations and that\neven when shared, fact-checks are nearly always shared within,rather than\nbetween, partisan communities. Furthermore, we provide empirical evidence which\nruns contrary to the assumption that misinformation moderation is politically\nbiased against the political right. In full, through this assessment of the\nreal-world influence of political fact-checking efforts, our findings\nunderscore how limitations in coverage, speed, and reach necessitate further\nexamination of the potential use of fact-checks as the primary method for\ncombating the spread of political misinformation.\n","subjects":["Computer Science/Social and Information Networks","Computer Science/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"aO1iQ1vLg1u9K6S3ekdRCgckp6hlFxvxDOuTjaOfb_A","pdfSize":"2209157"}