{"id":"2412.10476","title":"A Survey on Web Application Testing: A Decade of Evolution","authors":"Tao Li, Rubing Huang, Chenhui Cui, Dave Towey, Lei Ma, Yuan-Fang Li,\n  Wen Xia","authorsParsed":[["Li","Tao",""],["Huang","Rubing",""],["Cui","Chenhui",""],["Towey","Dave",""],["Ma","Lei",""],["Li","Yuan-Fang",""],["Xia","Wen",""]],"versions":[{"version":"v1","created":"Fri, 13 Dec 2024 04:13:28 GMT"}],"updateDate":"2024-12-17","timestamp":1734063208000,"abstract":"  As one of the most popular software applications, a web application is a\nprogram, accessible through the web, to dynamically generate content based on\nuser interactions or contextual data, for example, online shopping platforms,\nsocial networking sites, and financial services. Web applications operate in\ndiverse environments and leverage web technologies such as HTML, CSS,\nJavaScript, and Ajax, often incorporating features like asynchronous operations\nto enhance user experience. Due to the increasing user and popularity of web\napplications, approaches to their quality have become increasingly important.\nWeb Application Testing (WAT) plays a vital role in ensuring web applications'\nfunctionality, security, and reliability. Given the speed with which web\ntechnologies are evolving, WAT is especially important. Over the last decade,\nvarious WAT approaches have been developed. The diversity of approaches\nreflects the many aspects of web applications, such as dynamic content,\nasynchronous operations, and diverse user environments. This paper provides a\ncomprehensive overview of the main achievements during the past decade: It\nexamines the main steps involved in WAT, including test-case generation and\nexecution, and evaluation and assessment. The currently available tools for WAT\nare also examined. The paper also discusses some open research challenges and\npotential future WAT work.\n","subjects":["Computer Science/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Tv0uzw5OVgTydOiSNtlqDY0lg6vTLSzVYCIVmh7JT3M","pdfSize":"1796898"}