{"id":"2412.08889","title":"Geometrical Distances of Extragalactic Binaries through\n  Spectroastrometry","authors":"Yu-Yang Songsheng, Jian-Min Wang, Yuan Cao, XueFei Chen, JianPing\n  Xiong, Zhi-Xiang Zhang, Rong-Gen Cai","authorsParsed":[["Songsheng","Yu-Yang",""],["Wang","Jian-Min",""],["Cao","Yuan",""],["Chen","XueFei",""],["Xiong","JianPing",""],["Zhang","Zhi-Xiang",""],["Cai","Rong-Gen",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 02:54:04 GMT"}],"updateDate":"2024-12-13","timestamp":1733972044000,"abstract":"  The growing ``Hubble tension'' has prompted the need for precise measurements\nof cosmological distances. This paper demonstrates a purely geometric approach\nfor determining the distance to extragalactic binaries through a joint analysis\nof spectroastrometry (SA), radial velocity (RV), and light curve (LC)\nobservations. A parameterized model for the binary system is outlined, and\nsimulated SA, RV, and LC data are computed to infer the probability\ndistribution of model parameters based on the mock data. The impact of data\nquality and binary parameters on distance uncertainties is comprehensively\nanalyzed, showcasing the method's potential for high-precision distance\nmeasurements. For a typical eclipsing binary in the Large Magellanic Cloud\n(LMC), the distance uncertainty is approximately 6% under reasonable\nobservational conditions. Within a specific range of data quality and input\nparameters, the distance measurement precision of individual binary star\nsystems is generally better than 10%. As a geometric method based on the\nsimplest dynamics, it is independent of empirical calibration and the\nsystematics caused by model selections can be tested using nearby binaries with\nknown distances. By measuring multiple binary star systems or monitoring one\nbinary system repeatedly, geometric distance measurements of nearby galaxies\ncan be achieved, providing valuable insights into the Hubble tension and\nadvancing our understanding of the universe's structure and evolution.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/Astrophysics of Galaxies","Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"FfC3gJqvysz8BkDv_b5Ee9AfWH3v09jmulFteWcVoZc","pdfSize":"3776488"}