{"id":"2412.12888","title":"ArtAug: Enhancing Text-to-Image Generation through\n  Synthesis-Understanding Interaction","authors":"Zhongjie Duan, Qianyi Zhao, Cen Chen, Daoyuan Chen, Wenmeng Zhou,\n  Yaliang Li and Yingda Chen","authorsParsed":[["Duan","Zhongjie",""],["Zhao","Qianyi",""],["Chen","Cen",""],["Chen","Daoyuan",""],["Zhou","Wenmeng",""],["Li","Yaliang",""],["Chen","Yingda",""]],"versions":[{"version":"v1","created":"Tue, 17 Dec 2024 13:12:31 GMT"},{"version":"v2","created":"Wed, 18 Dec 2024 13:01:11 GMT"}],"updateDate":"2024-12-19","timestamp":1734441151000,"abstract":"  The emergence of diffusion models has significantly advanced image synthesis.\nThe recent studies of model interaction and self-corrective reasoning approach\nin large language models offer new insights for enhancing text-to-image models.\nInspired by these studies, we propose a novel method called ArtAug for\nenhancing text-to-image models in this paper. To the best of our knowledge,\nArtAug is the first one that improves image synthesis models via model\ninteractions with understanding models. In the interactions, we leverage human\npreferences implicitly learned by image understanding models to provide\nfine-grained suggestions for image synthesis models. The interactions can\nmodify the image content to make it aesthetically pleasing, such as adjusting\nexposure, changing shooting angles, and adding atmospheric effects. The\nenhancements brought by the interaction are iteratively fused into the\nsynthesis model itself through an additional enhancement module. This enables\nthe synthesis model to directly produce aesthetically pleasing images without\nany extra computational cost. In the experiments, we train the ArtAug\nenhancement module on existing text-to-image models. Various evaluation metrics\nconsistently demonstrate that ArtAug enhances the generative capabilities of\ntext-to-image models without incurring additional computational costs. The\nsource code and models will be released publicly.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"85OWx2CMn_mDAqb-3nu9pv7CEJ_LeyfimhSEu2eBX2U","pdfSize":"6973301"}