{"id":"2412.09355","title":"Stop Relearning: Model Reuse via Feature Distribution Analysis for\n  Incremental Entity Resolution","authors":"Victor Christen, Abdulnaser Sabra, Erhard Rahm","authorsParsed":[["Christen","Victor",""],["Sabra","Abdulnaser",""],["Rahm","Erhard",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 15:22:50 GMT"}],"updateDate":"2024-12-13","timestamp":1734016970000,"abstract":"  Entity resolution is essential for data integration, facilitating analytics\nand insights from complex systems. Multi-source and incremental entity\nresolution address the challenges of integrating diverse and dynamic data,\nwhich is common in real-world scenarios. A critical question is how to classify\nmatches and non-matches among record pairs from new and existing data sources.\nTraditional threshold-based methods often yield lower quality than machine\nlearning (ML) approaches, while incremental methods may lack stability\ndepending on the order in which new data is integrated.\n  Additionally, reusing training data and existing models for new data sources\nis unresolved for multi-source entity resolution. Even the approach of transfer\nlearning does not consider the challenge of which source domain should be used\nto transfer model and training data information for a certain target domain.\nNaive strategies for training new models for each new linkage problem are\ninefficient.\n  This work addresses these challenges and focuses on creating as well as\nmanaging models with a small labeling effort and the selection of suitable\nmodels for new data sources based on feature distributions. The results of our\nmethod StoRe demonstrate that our approach achieves comparable qualitative\nresults. Regarding efficiency, StoRe outperforms both a multi-source active\nlearning and a transfer learning approach, achieving efficiency improvements of\nup to 48 times faster than the active learning approach and by a factor of 163\ncompared to the transfer learning method.\n","subjects":["Computer Science/Databases"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"LP5h04h2raX2wZXUG5LWCOnJh5pEu1wUlknnEqQqMbQ","pdfSize":"3386268"}