{"id":"2412.17805","title":"Large Motion Video Autoencoding with Cross-modal Video VAE","authors":"Yazhou Xing, Yang Fei, Yingqing He, Jingye Chen, Jiaxin Xie, Xiaowei\n  Chi, Qifeng Chen","authorsParsed":[["Xing","Yazhou",""],["Fei","Yang",""],["He","Yingqing",""],["Chen","Jingye",""],["Xie","Jiaxin",""],["Chi","Xiaowei",""],["Chen","Qifeng",""]],"versions":[{"version":"v1","created":"Mon, 23 Dec 2024 18:58:24 GMT"}],"updateDate":"2024-12-24","timestamp":1734980304000,"abstract":"  Learning a robust video Variational Autoencoder (VAE) is essential for\nreducing video redundancy and facilitating efficient video generation. Directly\napplying image VAEs to individual frames in isolation can result in temporal\ninconsistencies and suboptimal compression rates due to a lack of temporal\ncompression. Existing Video VAEs have begun to address temporal compression;\nhowever, they often suffer from inadequate reconstruction performance. In this\npaper, we present a novel and powerful video autoencoder capable of\nhigh-fidelity video encoding. First, we observe that entangling spatial and\ntemporal compression by merely extending the image VAE to a 3D VAE can\nintroduce motion blur and detail distortion artifacts. Thus, we propose\ntemporal-aware spatial compression to better encode and decode the spatial\ninformation. Additionally, we integrate a lightweight motion compression model\nfor further temporal compression. Second, we propose to leverage the textual\ninformation inherent in text-to-video datasets and incorporate text guidance\ninto our model. This significantly enhances reconstruction quality,\nparticularly in terms of detail preservation and temporal stability. Third, we\nfurther improve the versatility of our model through joint training on both\nimages and videos, which not only enhances reconstruction quality but also\nenables the model to perform both image and video autoencoding. Extensive\nevaluations against strong recent baselines demonstrate the superior\nperformance of our method. The project website can be found\nat~\\href{https://yzxing87.github.io/vae/}{https://yzxing87.github.io/vae/}.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"FgEtTdI682LIqI5h8njwu37xsiavmlTSZQNxDV0G-pk","pdfSize":"8751098"}