{
  "id": "2412.16360",
  "title": "A Versatile Chip-Scale Platform for High-Rate Entanglement Generation\n  using an AlGaAs Microresonator Array",
  "authors": "Yiming Pang, Joshua E. Castro, Trevor J. Steiner, Liao Duan, Noemi\n  Tagliavacche, Massimo Borghi, Lillian Thiel, Nicholas Lewis, John E. Bowers,\n  Marco Liscidini, Galan Moody",
  "authorsParsed": [
    [
      "Pang",
      "Yiming",
      ""
    ],
    [
      "Castro",
      "Joshua E.",
      ""
    ],
    [
      "Steiner",
      "Trevor J.",
      ""
    ],
    [
      "Duan",
      "Liao",
      ""
    ],
    [
      "Tagliavacche",
      "Noemi",
      ""
    ],
    [
      "Borghi",
      "Massimo",
      ""
    ],
    [
      "Thiel",
      "Lillian",
      ""
    ],
    [
      "Lewis",
      "Nicholas",
      ""
    ],
    [
      "Bowers",
      "John E.",
      ""
    ],
    [
      "Liscidini",
      "Marco",
      ""
    ],
    [
      "Moody",
      "Galan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 21:45:32 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734731132000,
  "abstract": "  Integrated photonic microresonators have become an essential resource for\ngenerating photonic qubits for quantum information processing, entanglement\ndistribution and networking, and quantum communications. The pair generation\nrate is enhanced by reducing the microresonator radius, but this comes at the\ncost of increasing the frequency mode spacing and reducing the quantum\ninformation spectral density. Here, we circumvent this rate-density trade-off\nin an AlGaAs-on-insulator photonic device by multiplexing an array of 20\nsmall-radius microresonators each producing a 650-GHz-spaced comb of\ntime-energy entangled-photon pairs. The resonators can be independently tuned\nvia integrated thermo-optic heaters, enabling control of the mode spacing from\ndegeneracy up to a full free spectral range. We demonstrate simultaneous\npumping of five resonators with up to $50$ GHz relative comb offsets, where\neach resonator produces pairs exhibiting time-energy entanglement visibilities\nup to 95$\\%$, coincidence-to-accidental ratios exceeding 5,000, and an on-chip\npair rate up to 2.6 GHz/mW$^2$ per comb line -- more than 40 times improvement\nover prior work. As a demonstration, we generate frequency-bin qubits in a\nmaximally entangled two-qubit Bell state with fidelity exceeding 87$\\%$ (90$\\%$\nwith background correction) and detected frequency-bin entanglement rates up to\n7 kHz ($\\sim 70$ MHz on-chip pair rate) using $\\sim 250$ $\\mu$W pump power.\nMultiplexing small-radius microresonators combines the key capabilities\nrequired for programmable and dense photonic qubit encoding while retaining\nhigh pair-generation rates, heralded single-photon purity, and entanglement\nfidelity.\n",
  "subjects": [
    "Physics/Quantum Physics",
    "Physics/Optics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "xOaaFkGOGFGSLtSKVjIpMerr-yV3t9htz-X7_5K9-W4",
  "pdfSize": "14482392"
}