{
  "id": "2412.05471",
  "title": "Bubble dynamics in a cavitating venturi",
  "authors": "Premchand V Chandra, Anuja Vijayan, Pradeep Kumar P",
  "authorsParsed": [
    [
      "Chandra",
      "Premchand V",
      ""
    ],
    [
      "Vijayan",
      "Anuja",
      ""
    ],
    [
      "P",
      "Pradeep Kumar",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 23:53:16 GMT"
    },
    {
      "version": "v2",
      "created": "Thu, 26 Dec 2024 23:10:53 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1733529196000,
  "abstract": "  Cryogenic fluids have extensive applications as fuel for launch vehicles in\nspace applications and research. The physics of cryogenic flows are highly\ncomplex due to the sensitive nature of phase transformation from liquid to\nbubbly liquid and vapor, eventually resulting in cavitating flows at the\nambient temperature owing to the very low boiling point of cryogenic fluids,\nwhich asserts us to classify such flows under multi-phase flow physics regime.\nThis work elucidates the modeling of bubbly flow for cryogenic fluids such as\nliquid nitrogen in a converging-diverging venturi-like flow device known as\ncavitating venturi, a passive flow control metering device. The numerical works\nin literature are usually limited to modeling iso-thermal bubbly flows such as\nwater devoid of involving energy equations because there is no occurrence of\ninterface heat transfer as latent heat of vaporization of water is higher,\nunlike cryogenic fluids which are sensitive to phase change at ambient\nconditions. So, to realize an appropriate model for modeling cryogenic bubbly\nflows such as liquid nitrogen flow, the effect of heat transfer at the\ninterface and convective heat transfer from the surrounding liquid to the\ntraversing bubble needs to be included. Numerical modeling using an in-house\ncode involving a finite-difference method The numerical results showed the\nimportance of including the heat transport equation due to convection and at\nthe interface of bubble-fluid as a significant source term for the bubble\ndynamics. The work is supported by computational simulation using a commercial\nCFD package for 2-dimensional simulations to predict a characterizing\nparameter, namely cavitation length. A limited flow visualization experiment\nusing a high-speed camera is performed to study the cavitating zone length.\n",
  "subjects": [
    "Physics/Fluid Dynamics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "ynMqhYTapD7FqGEzkjkKt9r16Ontfi1PvAK0o6QETpA",
  "pdfSize": "3230851"
}