{"id":"2412.05419","title":"Is Chaotic Advection Inherent to Heterogeneous Darcy Flow?","authors":"Daniel R. Lester and Michael G. Trefry and Guy Metcalfe and Marco\n  Dentz","authorsParsed":[["Lester","Daniel R.",""],["Trefry","Michael G.",""],["Metcalfe","Guy",""],["Dentz","Marco",""]],"versions":[{"version":"v1","created":"Fri, 6 Dec 2024 20:59:21 GMT"}],"updateDate":"2024-12-10","timestamp":1733518761000,"abstract":"  At all scales, porous materials stir interstitial fluids as they are\nadvected, leading to complex distributions of matter and energy. Of particular\ninterest is whether porous media naturally induce chaotic advection at the\nDarcy scale, as these stirring kinematics profoundly impact basic processes\nsuch as solute transport and mixing, colloid transport and deposition and\nchemical, geochemical and biological reactivity. While many studies report\ncomplex transport phenomena characteristic of chaotic advection in\nheterogeneous Darcy flow, it has also been shown that chaotic dynamics are\nprohibited in a large class of Darcy flows. In this study we rigorously\nestablish that chaotic advection is inherent to steady 3D Darcy flow in all\nrealistic models of heterogeneous porous media. Anisotropic and heterogenous 3D\nhydraulic conductivity fields generate non-trivial braiding of stream-lines,\nleading to both chaotic advection and (purely advective) transverse dispersion.\nWe establish that steady 3D Darcy flow has the same topology as unsteady 2D\nflow, and so use braid theory to establish a quantitative link between\ntransverse dispersivity and Lyapunov exponent in heterogeneous Darcy flow. We\nshow that chaotic advection and transverse dispersion occur in both anisotropic\nweakly heterogeneous and in heterogeneous weakly anisotropic conductivity\nfields, and that the quantitative link between these phenomena persists across\na broad range of conductivity anisotropy and heterogeneity. The ubiquity of\nmacroscopic chaotic advection has profound implications for the myriad of\nprocesses hosted in heterogeneous porous media and calls for a re-evaluation of\ntransport and reaction methods in these systems.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"GUM9vrh_K__EMDTTtYr0pC9uN3L4nzIH8Fr5lkeiby4","pdfSize":"6903404"}