{"id":"2412.21103","title":"Parallel DNA Sequence Alignment on High-Performance Systems with CUDA\n  and MPI","authors":"Linus Zwaka","authorsParsed":[["Zwaka","Linus",""]],"versions":[{"version":"v1","created":"Mon, 30 Dec 2024 17:27:34 GMT"}],"updateDate":"2024-12-31","timestamp":1735579654000,"abstract":"  Sequence alignment is a cornerstone of bioinformatics, widely used to\nidentify similarities between DNA, RNA, and protein sequences and studying\nevolutionary relationships and functional properties. The Needleman-Wunsch\nalgorithm remains a robust and accurate method for global sequence alignment.\nHowever, its computational complexity, O(mn), poses significant challenges when\nprocessing large-scale datasets or performing multiple sequence alignments. To\naddress these limitations, a hybrid implementation of the Needleman-Wunsch\nalgorithm that leverages CUDA for parallel execution on GPUs and MPI for\ndistributed computation across multiple nodes on a supercomputer is proposed.\nCUDA efficiently offloads computationally intensive tasks to GPU cores, while\nMPI enables communication and workload distribution across nodes to handle\nlarge-scale alignments.\n  This work details the implementation and performance evaluation of the\nNeedleman-Wunsch algorithm in a massively parallel computing environment.\nExperimental results demonstrate significant acceleration of the alignment\nprocess compared to traditional CPU-based implementations, particularly for\nlarge input sizes and multiple sequence alignments. In summary, the combination\nof CUDA and MPI effectively overcomes the computational bottlenecks inherent to\nthe Needleman-Wunsch algorithm without requiring substantial modifications to\nthe underlying algorithm, highlighting the potential of high-performance\ncomputing in advancing sequence alignment workflows.\n","subjects":["Computer Science/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"xmfsVF4zPTX_3wi0CzRyiCXoi_J-1gh2US8iluJuyKE","pdfSize":"523623"}