{
  "id": "2412.16925",
  "title": "Quantifying Public Response to COVID-19 Events: Introducing the\n  Community Sentiment and Engagement Index",
  "authors": "Nirmalya Thakur, Kesha A. Patel, Audrey Poon, Shuqi Cui, Nazif Azizi,\n  Rishika Shah, and Riyan Shah",
  "authorsParsed": [
    [
      "Thakur",
      "Nirmalya",
      ""
    ],
    [
      "Patel",
      "Kesha A.",
      ""
    ],
    [
      "Poon",
      "Audrey",
      ""
    ],
    [
      "Cui",
      "Shuqi",
      ""
    ],
    [
      "Azizi",
      "Nazif",
      ""
    ],
    [
      "Shah",
      "Rishika",
      ""
    ],
    [
      "Shah",
      "Riyan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 22 Dec 2024 08:52:12 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734857532000,
  "abstract": "  This study introduces the Community Sentiment and Engagement Index (CSEI),\ndeveloped to capture nuanced public sentiment and engagement variations on\nsocial media, particularly in response to major events related to COVID-19.\nConstructed with diverse sentiment indicators, CSEI integrates features like\nengagement, daily post count, compound sentiment, fine-grain sentiments (fear,\nsurprise, joy, sadness, anger, disgust, and neutral), readability,\noffensiveness, and domain diversity. Each component is systematically weighted\nthrough a multi-step Principal Component Analysis (PCA)-based framework,\nprioritizing features according to their variance contributions across temporal\nsentiment shifts. This approach dynamically adjusts component importance,\nenabling CSEI to precisely capture high-sensitivity shifts in public sentiment.\nThe development of CSEI showed statistically significant correlations with its\nconstituent features, underscoring internal consistency and sensitivity to\nspecific sentiment dimensions. CSEI's responsiveness was validated using a\ndataset of 4,510,178 Reddit posts about COVID-19. The analysis focused on 15\nmajor events, including the WHO's declaration of COVID-19 as a pandemic, the\nfirst reported cases of COVID-19 across different countries, national\nlockdowns, vaccine developments, and crucial public health measures. Cumulative\nchanges in CSEI revealed prominent peaks and valleys aligned with these events,\nindicating significant patterns in public sentiment across different phases of\nthe pandemic. Pearson correlation analysis further confirmed a statistically\nsignificant relationship between CSEI daily fluctuations and these events (p =\n0.0428), highlighting the capacity of CSEI to infer and interpret shifts in\npublic sentiment and engagement in response to major events related to\nCOVID-19.\n",
  "subjects": [
    "Computer Science/Social and Information Networks",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Computation and Language",
    "Computer Science/Computers and Society",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "xRIoMZdAC73dMur3NaI85oYN-iyP8nRWRSYlHhXcxTs",
  "pdfSize": "650804"
}