{
  "id": "2412.01498",
  "title": "Windowed Dictionary Design for Delay-Aware OMP Channel Estimation under\n  Fractional Doppler",
  "authors": "Hanning Wang, Xiang Huang, Rong-Rong Chen, and Arman Farhang",
  "authorsParsed": [
    [
      "Wang",
      "Hanning",
      ""
    ],
    [
      "Huang",
      "Xiang",
      ""
    ],
    [
      "Chen",
      "Rong-Rong",
      ""
    ],
    [
      "Farhang",
      "Arman",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 13:49:57 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733147397000,
  "abstract": "  Delay-Doppler (DD) signal processing has emerged as a powerful tool for\nanalyzing multipath and time-varying channel effects. Due to the inherent\nsparsity of the wireless channel in the DD domain, compressed sensing (CS)\nbased techniques, such as orthogonal matching pursuit (OMP), are commonly used\nfor channel estimation. However, many of these methods assume integer Doppler\nshifts, which can lead to performance degradation in the presence of fractional\nDoppler. In this paper, we propose a windowed dictionary design technique while\nwe develop a delay-aware orthogonal matching pursuit (DA-OMP) algorithm that\nmitigates the impact of fractional Doppler shifts on DD domain channel\nestimation. First, we apply receiver windowing to reduce the correlation\nbetween the columns of our proposed dictionary matrix. Second, we introduce a\ndelay-aware interference block to quantify the interference caused by\nfractional Doppler. This approach removes the need for a pre-determined\nstopping criterion, which is typically based on the number of propagation\npaths, in conventional OMP algorithm. Our simulation results confirm the\neffective performance of our proposed DA-OMP algorithm using the proposed\nwindowed dictionary in terms of normalized mean square error (NMSE) of the\nchannel estimate. In particular, our proposed DA-OMP algorithm demonstrates\nsubstantial gains compared to standard OMP algorithm in terms of channel\nestimation NMSE with and without windowed dictionary.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Signal Processing"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "2iZn3wJCQhRZRLqUV9RWtSSnkcx_xdCh9AHS6zlou3k",
  "pdfSize": "739788"
}