{
  "id": "2412.18994",
  "title": "Geospatial Data Fusion: Combining Lidar, SAR, and Optical Imagery with\n  AI for Enhanced Urban Mapping",
  "authors": "Sajjad Afroosheh, Mohammadreza Askari",
  "authorsParsed": [
    [
      "Afroosheh",
      "Sajjad",
      ""
    ],
    [
      "Askari",
      "Mohammadreza",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 25 Dec 2024 22:17:31 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735165051000,
  "abstract": "  This study explores the integration of Lidar, Synthetic Aperture Radar (SAR),\nand optical imagery through advanced artificial intelligence techniques for\nenhanced urban mapping. By fusing these diverse geospatial datasets, we aim to\novercome the limitations associated with single-sensor data, achieving a more\ncomprehensive representation of urban environments. The research employs Fully\nConvolutional Networks (FCNs) as the primary deep learning model for urban\nfeature extraction, enabling precise pixel-wise classification of essential\nurban elements, including buildings, roads, and vegetation. To optimize the\nperformance of the FCN model, we utilize Particle Swarm Optimization (PSO) for\nhyperparameter tuning, significantly enhancing model accuracy. Key findings\nindicate that the FCN-PSO model achieved a pixel accuracy of 92.3% and a mean\nIntersection over Union (IoU) of 87.6%, surpassing traditional single-sensor\napproaches. These results underscore the potential of fused geospatial data and\nAI-driven methodologies in urban mapping, providing valuable insights for urban\nplanning and management. The implications of this research pave the way for\nfuture developments in real-time mapping and adaptive urban infrastructure\nplanning.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Artificial Intelligence",
    "Electrical Engineering and Systems Science/Image and Video Processing"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "IqEJobR4q9KM6svLtRo139tSJUWfoaTGgrdp_sPF6KQ",
  "pdfSize": "983460"
}