{
  "id": "2412.08251",
  "title": "Parameter Estimation based Automatic Modulation Recognition for Radio\n  Frequency Signal",
  "authors": "Shuo Wang, Kuojun Yang, Zelin Ji, Qinchuan Zhang, Huiqing Pan",
  "authorsParsed": [
    [
      "Wang",
      "Shuo",
      ""
    ],
    [
      "Yang",
      "Kuojun",
      ""
    ],
    [
      "Ji",
      "Zelin",
      ""
    ],
    [
      "Zhang",
      "Qinchuan",
      ""
    ],
    [
      "Pan",
      "Huiqing",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 10:03:06 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733911386000,
  "abstract": "  Automatic modulation recognition (AMR) critically contributes to spectrum\nsensing, dynamic spectrum access, and intelligent communications in cognitive\nradio systems. The introduction of deep learning has greatly improved the\naccuracy of AMR. However, current automatic identification methods require the\ninput of key parameters such as the carrier frequency, which is necessary to\nconvert the radio frequency (RF) to a base-band signal before it can be used\nfor identification. In addition, the high complexity of deep learning models\nleads to high computational effort and long recognition times of existing\nmethods, which are difficult to implement in demodulation system deployments.\nTo address the above issues, in this paper, we first use power spectrum\nanalysis to estimate the carrier frequency and signal bandwidth, which realizes\nthe effective conversion from RF signals to base-band signals. This paper\nchooses the long short-term memory (LSTM) network as the model for automatic\nidentification, which has low implementation complexity while maintaining high\naccuracy. Finally, by training the LSTM with actual sampling data combined with\nparameter estimation (PE), the method proposed in this paper can guarantee more\nthan 90% format recognition accuracy.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Signal Processing"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "AjDzY2AeBlkxURxJYlpOKCNkvVARqKkAjOqTxZBNiHI",
  "pdfSize": "1565975"
}