{
  "id": "2412.04879",
  "title": "Automatic Tissue Differentiation in Parotidectomy using Hyperspectral\n  Imaging",
  "authors": "Eric L. Wisotzky and Alexander Schill and Anna Hilsmann and Peter\n  Eisert and Michael Knoke",
  "authorsParsed": [
    [
      "Wisotzky",
      "Eric L.",
      ""
    ],
    [
      "Schill",
      "Alexander",
      ""
    ],
    [
      "Hilsmann",
      "Anna",
      ""
    ],
    [
      "Eisert",
      "Peter",
      ""
    ],
    [
      "Knoke",
      "Michael",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 09:20:59 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1733476859000,
  "abstract": "  In head and neck surgery, continuous intraoperative tissue differentiation is\nof great importance to avoid injury to sensitive structures such as nerves and\nvessels. Hyperspectral imaging (HSI) with neural network analysis could support\nthe surgeon in tissue differentiation. A 3D Convolutional Neural Network with\nhyperspectral data in the range of $400-1000$ nm is used in this work. The\nacquisition system consisted of two multispectral snapshot cameras creating a\nstereo-HSI-system. For the analysis, 27 images with annotations of glandular\ntissue, nerve, muscle, skin and vein in 18 patients undergoing parotidectomy\nare included. Three patients are removed for evaluation following the\nleave-one-subject-out principle. The remaining images are used for training,\nwith the data randomly divided into a training group and a validation group. In\nthe validation, an overall accuracy of $98.7\\%$ is achieved, indicating robust\ntraining. In the evaluation on the excluded patients, an overall accuracy of\n$83.4\\%$ has been achieved showing good detection and identification abilities.\nThe results clearly show that it is possible to achieve robust intraoperative\ntissue differentiation using hyperspectral imaging. Especially the high\nsensitivity in parotid or nerve tissue is of clinical importance. It is\ninteresting to note that vein was often confused with muscle. This requires\nfurther analysis and shows that a very good and comprehensive data basis is\nessential. This is a major challenge, especially in surgery.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Image and Video Processing",
    "Computer Science/Computer Vision and Pattern Recognition",
    "Physics/Medical Physics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "zPICTsADmQPYSdrI9XjmL7P3rKgMxO5Cy8Nl1nW6kig",
  "pdfSize": "4720391"
}