{"id":"2412.13361","title":"Two types of colossal magnetoresistance with distinct mechanisms in\n  Eu5In2As6","authors":"Sudhaman Balguri, Mira B. Mahendru, Enrique O. Gonzalez Delgado, Kyle\n  Fruhling, Xiaohan Yao, David E. Graf, Jose A. Rodriguez-Rivera, Adam A.\n  Aczel, Andreas Rydh, Jonathan Gaudet and Fazel Tafti","authorsParsed":[["Balguri","Sudhaman",""],["Mahendru","Mira B.",""],["Delgado","Enrique O. Gonzalez",""],["Fruhling","Kyle",""],["Yao","Xiaohan",""],["Graf","David E.",""],["Rodriguez-Rivera","Jose A.",""],["Aczel","Adam A.",""],["Rydh","Andreas",""],["Gaudet","Jonathan",""],["Tafti","Fazel",""]],"versions":[{"version":"v1","created":"Tue, 17 Dec 2024 22:21:21 GMT"}],"updateDate":"2024-12-19","timestamp":1734474081000,"abstract":"  Recent reports of colossal negative magnetoresistance (CMR) in a few magnetic\nsemimetals and semiconductors have attracted attention, because these materials\nare devoid of the conventional mechanisms of CMR such as mixed valence, double\nexchange interaction, and Jahn-Teller distortion. New mechanisms have thus been\nproposed, including topological band structure, ferromagnetic clusters, orbital\ncurrents, and charge ordering. The CMR in these compounds has been reported in\ntwo forms: either a resistivity peak or a resistivity upturn suppressed by a\nmagnetic field. Here we reveal both types of CMR in a single antiferromagnetic\nsemiconductor Eu5In2As6. Using the transport and thermodynamic measurements, we\ndemonstrate that the peak-type CMR is likely due to the percolation of magnetic\npolarons with increasing magnetic field, while the upturn-type CMR is proposed\nto result from the melting of a charge order under the magnetic field. We argue\nthat similar mechanisms operate in other compounds, offering a unifying\nframework to understand CMR in seemingly different materials.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"6jOD98qu_u0gJjN00gxL9li4PYNlKlPdMiB6GQXnAjM","pdfSize":"15156554"}