{"id":"2412.06961","title":"Analysis of Conducted and Radiated Emission on a Self-oscillating\n  Capacitive Touch Sensing Circuit","authors":"Subramaniam Saravana Sankar, Stanislav Kovar, Martin Pospisilik,\n  Michael Galda","authorsParsed":[["Sankar","Subramaniam Saravana",""],["Kovar","Stanislav",""],["Pospisilik","Martin",""],["Galda","Michael",""]],"versions":[{"version":"v1","created":"Mon, 9 Dec 2024 20:08:43 GMT"}],"updateDate":"2024-12-11","timestamp":1733774923000,"abstract":"  With the advent of smartphones, there has been a recent increase in the use\nof capacitive touch sensing for various Human Machine Interfaces (HMI).\nCapacitive-based touch sensing provides higher flexibility and\ncost-effectiveness than, methodologies such as resistive-based touch sensing.\nHowever, Capacitive-based touch sensing is more prone to disturbances such as\nElectromagnetic interference (EMI) and noise due to temperature variation. This\neffect becomes more dominating as the sensing excitation frequency increases.\nTraditional capacitance to digital circuits, such as sigma-delta capacitive\nsensing, requires multiple clock cycles to measure sensing capacitance, thus\nnecessitating higher frequency operation. In turn, this produces challenges in\nElectromagnetic Emission while also increasing its susceptibility to EMI, such\nas false or ghost touch due to exposure of the sensing electrodes to various\nfrequency electric fields. This paper discusses the conducted electromagnetic\nemission behavior of an external excitation-frequency independent\nself-oscillating capacitance-to-time converter, where sensing is done with a\nsingle clock cycle, and discusses radiated Electromagnetic emission of the\ntouch sensing electrode. The proposed approach is suitable for touch-sensing\napplications, mainly when used in a noisy EMI environment, such as inside a\nvehicle within the Automotive industry.\n","subjects":["Computer Science/Emerging Technologies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"i5YIZgndMeg5QS32GZfQ8puYHOBq80fOi_UXeSgiivM","pdfSize":"508885"}