{"id":"2412.16349","title":"CensorLab: A Testbed for Censorship Experimentation","authors":"Jade Sheffey, Amir Houmansadr","authorsParsed":[["Sheffey","Jade",""],["Houmansadr","Amir",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 21:17:24 GMT"},{"version":"v2","created":"Thu, 9 Jan 2025 17:55:17 GMT"}],"updateDate":"2025-01-10","timestamp":1734729444000,"abstract":"  Censorship and censorship circumvention are closely connected, and each is\nconstantly making decisions in reaction to the other. When censors deploy a new\nInternet censorship technique, the anti-censorship community scrambles to find\nand develop circumvention strategies against the censor's new strategy, i.e.,\nby targeting and exploiting specific vulnerabilities in the new censorship\nmechanism. We believe that over-reliance on such a reactive approach to\ncircumvention has given the censors the upper hand in the censorship arms race,\nbecoming a key reason for the inefficacy of in-the-wild circumvention systems.\nTherefore, we argue for a proactive approach to censorship research: the\nanti-censorship community should be able to proactively develop circumvention\nmechanisms against hypothetical or futuristic censorship strategies. To\nfacilitate proactive censorship research, we design and implement CensorLab, a\ngeneric platform for emulating Internet censorship scenarios. CensorLab aims to\ncomplement currently reactive circumvention research by efficiently emulating\npast, present, and hypothetical censorship strategies in realistic network\nenvironments. Specifically, CensorLab aims to (1) support all censorship\nmechanisms previously or currently deployed by real-world censors; (2) support\nthe emulation of hypothetical (not-yet-deployed) censorship strategies\nincluding advanced data-driven censorship mechanisms (e.g., ML-based traffic\nclassifiers); (3) provide an easy-to-use platform for researchers and\npractitioners enabling them to perform extensive experimentation; and (4)\noperate efficiently with minimal overhead. We have implemented CensorLab as a\nfully functional, flexible, and high-performance platform, and showcase how it\ncan be used to emulate a wide range of censorship scenarios, from traditional\nIP blocking and keyword filtering to hypothetical ML-based censorship\nmechanisms.\n","subjects":["Computer Science/Cryptography and Security","Computer Science/Networking and Internet Architecture"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"9Yo1G1zAE44leIC1P5RXkyAT4muqckODOEO-3Rtd42g","pdfSize":"472534"}