{"id":"2412.10580","title":"DeepWiener: Neural Networks for CMB polarization maps and power spectrum\n  computation","authors":"Bel\\'en Costanza, Claudia G. Sc\\'occola, Mat\\'ias Zaldarriaga","authorsParsed":[["Costanza","Belén",""],["Scóccola","Claudia G.",""],["Zaldarriaga","Matías",""]],"versions":[{"version":"v1","created":"Fri, 13 Dec 2024 21:46:57 GMT"}],"updateDate":"2024-12-17","timestamp":1734126417000,"abstract":"  To study the early Universe, it is essential to estimate cosmological\nparameters with high accuracy, which depends on the optimal reconstruction of\nCosmic Microwave Background (CMB) maps and the measurement of their power\nspectrum. In this paper, we generalize the neural network developed for\napplying the Wiener Filter, initially presented for temperature maps in\nprevious work, to polarization maps. Our neural network has a UNet\narchitecture, including an extra channel for the noise variance map, to account\nfor inhomogeneous noise, and a channel for the mask. In addition, we propose an\niterative approach for reconstructing the E and B-mode fields, while addressing\nthe E-to-B leakage present in the maps due to incomplete sky coverage. The\naccuracy achieved is satisfactory compared to the Wiener Filter solution\ncomputed with the standard Conjugate Gradient method, and it is highly\nefficient, enabling the computation of the power spectrum of an unknown signal\nusing the optimal quadratic estimator. We further evaluate the quality of the\nreconstructed maps at the power spectrum level along with their corresponding\nerrors, finding that these errors are smaller than those obtained using the\nwell-known pseudo-$C_\\ell$ approach. Our results show that increasing\ncomplexity in the applied mask presents a more significant challenge for B-mode\nreconstruction.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"43mv6F-7Wpsa0l5-G0REszzssvCzraoQsdPPVm0EFlU","pdfSize":"3389004"}