{
  "id": "2412.04355",
  "title": "Bloch Oscillations of a Soliton in a 1D Quantum Fluid",
  "authors": "F. Rabec, G. Chauveau, G. Brochier, S. Nascimbene, J. Dalibard, J.\n  Beugnon",
  "authorsParsed": [
    [
      "Rabec",
      "F.",
      ""
    ],
    [
      "Chauveau",
      "G.",
      ""
    ],
    [
      "Brochier",
      "G.",
      ""
    ],
    [
      "Nascimbene",
      "S.",
      ""
    ],
    [
      "Dalibard",
      "J.",
      ""
    ],
    [
      "Beugnon",
      "J.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 17:15:06 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733418906000,
  "abstract": "  The motion of a quantum system subjected to an external force often defeats\nour classical intuition. A celebrated example is the dynamics of a single\nparticle in a periodic potential, which undergoes Bloch oscillations under the\naction of a constant force. Surprisingly, Bloch-like oscillations can also\noccur in one-dimensional quantum fluids without requiring the presence of a\nlattice. The intriguing generalization of Bloch oscillations to a\nweakly-bounded ensemble of interacting particles has been so far limited to the\nexperimental study of the two-particle case, where the observed period is\nhalved compared to the single-particle case. In this work, we observe the\noscillations of the position of a mesoscopic solitonic wave packet, consisting\nof approximately 1000 atoms in a one-dimensional Bose gas when subjected to a\nconstant uniform force and in the absence of a lattice potential. The\noscillation period scales inversely with the atom number, thus revealing its\ncollective nature. We demonstrate the pivotal role of the phase coherence of\nthe quantum bath in which the wave packet moves and investigate the underlying\ntopology of the associated superfluid currents. Our measurements highlight the\nperiodicity of the dispersion relation of collective excitations in\none-dimensional quantum systems. We anticipate that our observation of such a\nmacroscopic quantum phenomenon will inspire further studies on the crossover\nbetween classical and quantum laws of motion, such as exploring the role of\ndissipation, similarly to the textbook case of macroscopic quantum tunneling in\nJosephson physics.\n",
  "subjects": [
    "Condensed Matter/Quantum Gases",
    "Nonlinear Sciences/Pattern Formation and Solitons"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "V4BZ2QNDrpmltCjujbb8jHubeNkFXskkMpACayz2ebE",
  "pdfSize": "2401112"
}