{
  "id": "2412.10258",
  "title": "Copy-Move Detection in Optical Microscopy: A Segmentation Network and A\n  Dataset",
  "authors": "Hao-Chiang Shao, Yuan-Rong Liao, Tse-Yu Tseng, Yen-Liang Chuo, Fong-Yi\n  Lin",
  "authorsParsed": [
    [
      "Shao",
      "Hao-Chiang",
      ""
    ],
    [
      "Liao",
      "Yuan-Rong",
      ""
    ],
    [
      "Tseng",
      "Tse-Yu",
      ""
    ],
    [
      "Chuo",
      "Yen-Liang",
      ""
    ],
    [
      "Lin",
      "Fong-Yi",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 16:29:00 GMT"
    }
  ],
  "updateDate": "2024-12-16",
  "timestamp": 1734107340000,
  "abstract": "  With increasing revelations of academic fraud, detecting forged experimental\nimages in the biomedical field has become a public concern. The challenge lies\nin the fact that copy-move targets can include background tissue, small\nforeground objects, or both, which may be out of the training domain and\nsubject to unseen attacks, rendering standard object-detection-based approaches\nless effective. To address this, we reformulate the problem of detecting\nbiomedical copy-move forgery regions as an intra-image co-saliency detection\ntask and propose CMSeg-Net, a copy-move forgery segmentation network capable of\nidentifying unseen duplicated areas. Built on a multi-resolution\nencoder-decoder architecture, CMSeg-Net incorporates self-correlation and\ncorrelation-assisted spatial-attention modules to detect intra-image regional\nsimilarities within feature tensors at each observation scale. This design\nhelps distinguish even small copy-move targets in complex microscopic images\nfrom other similar objects. Furthermore, we created a copy-move forgery dataset\nof optical microscopic images, named FakeParaEgg, using open data from the ICIP\n2022 Challenge to support CMSeg-Net's development and verify its performance.\nExtensive experiments demonstrate that our approach outperforms previous\nstate-of-the-art methods on the FakeParaEgg dataset and other open copy-move\ndetection datasets, including CASIA-CMFD, CoMoFoD, and CMF. The FakeParaEgg\ndataset, our source code, and the CMF dataset with our manually defined\nsegmentation ground truths available at\n``https://github.com/YoursEver/FakeParaEgg''.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Image and Video Processing",
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "He3rgIgzmrb6a5jKBSqcX80ZqRfiBJoY2pVhTfk8CyA",
  "pdfSize": "2752020"
}