{
  "id": "2412.01285",
  "title": "Self organisation of invasive breast cancer driven by the interplay of\n  active and passive nematic dynamics",
  "authors": "Pablo Gottheil, Saraswat Bhattacharyya, Kolya Lettl, Philip Friedrich,\n  Kilian Roth, Salvador Rivera-Moreno, Mario Merkel, Bahriye Aktas, Igor Sauer,\n  Assal Daneshgar, Jonas Wieland, Hans Kubitschke, Anne-Sophie Wegscheider,\n  Julia M. Yeomans, Josef A. K\\\"as",
  "authorsParsed": [
    [
      "Gottheil",
      "Pablo",
      ""
    ],
    [
      "Bhattacharyya",
      "Saraswat",
      ""
    ],
    [
      "Lettl",
      "Kolya",
      ""
    ],
    [
      "Friedrich",
      "Philip",
      ""
    ],
    [
      "Roth",
      "Kilian",
      ""
    ],
    [
      "Rivera-Moreno",
      "Salvador",
      ""
    ],
    [
      "Merkel",
      "Mario",
      ""
    ],
    [
      "Aktas",
      "Bahriye",
      ""
    ],
    [
      "Sauer",
      "Igor",
      ""
    ],
    [
      "Daneshgar",
      "Assal",
      ""
    ],
    [
      "Wieland",
      "Jonas",
      ""
    ],
    [
      "Kubitschke",
      "Hans",
      ""
    ],
    [
      "Wegscheider",
      "Anne-Sophie",
      ""
    ],
    [
      "Yeomans",
      "Julia M.",
      ""
    ],
    [
      "Käs",
      "Josef A.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 08:57:18 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733129838000,
  "abstract": "  In invasive breast cancer, cell clusters of varying sizes and shapes are\nembedded in the fibrous extracellular matrix (ECM). Although the prevailing\nview attributes this structure to increasing disorder resulting from loss of\nfunction and dedifferentiation, our findings reveal that it arises through a\nprocess of active self-organization driven by cancer cell motility. Simulations\nand histological analyses of tumours from over 2,000 breast cancer patients\nreveal that motile, aligned cancer cells within clusters move as active nematic\naggregates through the surrounding highly aligned ECM fibres, which form a\nconfining, passive nematic phase. Cellular motion leads to cluster splitting\nand coalescence. The degree of cluster activity, combined with heterogeneity in\ncell motility, is reflected in specific scaling behaviours for cluster shape,\nsize distribution, and the distance between cluster boundaries and nematic\ndefects in ECM alignment. Increased activity estimates correlate with tumour\nprogression and are associated with a poorer prognosis for patients.\n",
  "subjects": [
    "Physics/Biological Physics",
    "Condensed Matter/Soft Condensed Matter"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "67cx0EoruDe-u_EZh-KPCG2Mxa7vCvmL1HMLR16wqEQ",
  "pdfSize": "40534167"
}