{
  "id": "2412.16352",
  "title": "Counting Defiers in Health Care with a Design-Based Likelihood for the\n  Joint Distribution of Potential Outcomes",
  "authors": "Neil Christy and Amanda Ellen Kowalski",
  "authorsParsed": [
    [
      "Christy",
      "Neil",
      ""
    ],
    [
      "Kowalski",
      "Amanda Ellen",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 21:27:02 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734730022000,
  "abstract": "  We present a design-based model of a randomized experiment in which the\nobserved outcomes are informative about the joint distribution of potential\noutcomes within the experimental sample. We derive a likelihood function that\nmaintains curvature with respect to the joint distribution of potential\noutcomes, even when holding the marginal distributions of potential outcomes\nconstant -- curvature that is not maintained in a sampling-based likelihood\nthat imposes a large sample assumption. Our proposed decision rule guesses the\njoint distribution of potential outcomes in the sample as the distribution that\nmaximizes the likelihood. We show that this decision rule is Bayes optimal\nunder a uniform prior. Our optimal decision rule differs from and significantly\noutperforms a ``monotonicity'' decision rule that assumes no defiers or no\ncompliers. In sample sizes ranging from 2 to 40, we show that the Bayes\nexpected utility of the optimal rule increases relative to the monotonicity\nrule as the sample size increases. In two experiments in health care, we show\nthat the joint distribution of potential outcomes that maximizes the likelihood\nneed not include compliers even when the average outcome in the intervention\ngroup exceeds the average outcome in the control group, and that the maximizer\nof the likelihood may include both compliers and defiers, even when the average\nintervention effect is large and statistically significant.\n",
  "subjects": [
    "Economics/Econometrics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "vnEDgEaozGO1qi3kOu8Cmtl0PeYMTETKH32XAwJf4ng",
  "pdfSize": "1117237"
}