{
  "id": "2412.03658",
  "title": "Exploring velocity dispersion anisotropy in a dark matter dominated\n  ultra-diffuse galaxy with modified gravity models",
  "authors": "Esha Bhatia, Sayan Chakrabarti, and Sovan Chakraborty",
  "authorsParsed": [
    [
      "Bhatia",
      "Esha",
      ""
    ],
    [
      "Chakrabarti",
      "Sayan",
      ""
    ],
    [
      "Chakraborty",
      "Sovan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 19:00:04 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733338804000,
  "abstract": "  The kinematics of the ultra-diffuse galaxy (UDG) NGC1052-DF44 is primarily\ninfluenced by the presence of dark matter (DM). In this paper, we conduct a\ncontrasting kinematic study of DF44 within the alternative modified gravity\nframework. In comparison to NFW DM, we test three alternative gravity models\nviz Milgromian dynamics (MOND), characterized by a known acceleration scale, a\ngeneric $f(R)$ model, assuming an expansion of the Ricci scalar, and a quantum\ngravity-inspired Renormalization Group correction to General Relativity (RGGR),\nwhich involves the running of the gravitational coupling parameter $G$ with the\nUniverse's energy scale. For each gravity model, we evaluate the velocity\ndispersion (VD) of the galaxy beyond the conventional radial isotropic\nassumption and extend to two anisotropy scenarios, i.e., constant and\nOsipkov-Merritt. Our results show that all three gravity models can provide\nconsistent fits to the observed VD of DF44; however, only MOND and RGGR remain\ncompetitive with NFW DM. Interestingly, the constant anisotropy scenario in all\nthe models is also found to be competitive with the complete isotropic\nassumption.\n",
  "subjects": [
    "Astrophysics/Cosmology and Nongalactic Astrophysics",
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "pmEwn2JkOKvZRHlLuYTDdgFfyFCyHIY4kFffumyVkCs",
  "pdfSize": "573205"
}