{
  "id": "2412.04922",
  "title": "Large Language Models for Ingredient Substitution in Food Recipes using\n  Supervised Fine-tuning and Direct Preference Optimization",
  "authors": "Thevin Senath, Kumuthu Athukorala, Ransika Costa, Surangika\n  Ranathunga, Rishemjit Kaur",
  "authorsParsed": [
    [
      "Senath",
      "Thevin",
      ""
    ],
    [
      "Athukorala",
      "Kumuthu",
      ""
    ],
    [
      "Costa",
      "Ransika",
      ""
    ],
    [
      "Ranathunga",
      "Surangika",
      ""
    ],
    [
      "Kaur",
      "Rishemjit",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 10:21:25 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733480485000,
  "abstract": "  In this paper, we address the challenge of recipe personalization through\ningredient substitution. We make use of Large Language Models (LLMs) to build\nan ingredient substitution system designed to predict plausible substitute\ningredients within a given recipe context. Given that the use of LLMs for this\ntask has been barely done, we carry out an extensive set of experiments to\ndetermine the best LLM, prompt, and the fine-tuning setups. We further\nexperiment with methods such as multi-task learning, two-stage fine-tuning, and\nDirect Preference Optimization (DPO). The experiments are conducted using the\npublicly available Recipe1MSub corpus. The best results are produced by the\nMistral7-Base LLM after fine-tuning and DPO. This result outperforms the strong\nbaseline available for the same corpus with a Hit@1 score of 22.04. Thus we\nbelieve that this research represents a significant step towards enabling\npersonalized and creative culinary experiences by utilizing LLM-based\ningredient substitution.\n",
  "subjects": [
    "Computer Science/Computation and Language"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "_dgISirfaZUtntCHe5u74FWex5uNdo978wKuEbh0pig",
  "pdfSize": "782199"
}