{
  "id": "2412.00566",
  "title": "Parameter estimation of microlensed gravitational waves with Conditional\n  Variational Autoencoders",
  "authors": "Roberto Bada Nerin, Oleg Bulashenko, Osvaldo Gramaxo Freitas and\n  Jos\\'e A. Font",
  "authorsParsed": [
    [
      "Nerin",
      "Roberto Bada",
      ""
    ],
    [
      "Bulashenko",
      "Oleg",
      ""
    ],
    [
      "Freitas",
      "Osvaldo Gramaxo",
      ""
    ],
    [
      "Font",
      "José A.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 30 Nov 2024 19:41:18 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1732995678000,
  "abstract": "  Gravitational lensing of gravitational waves (GWs) provides a unique\nopportunity to study cosmology and astrophysics at multiple scales. Detecting\nmicrolensing signatures, in particular, requires efficient parameter estimation\nmethods due to the high computational cost of traditional Bayesian inference.\nIn this paper we explore the use of deep learning, namely Conditional\nVariational Autoencoders (CVAE), to estimate parameters of microlensed binary\nblack hole (simulated) waveforms. We find that our CVAE model yields accurate\nparameter estimation and significant computational savings compared to Bayesian\nmethods such as bilby (up to five orders of magnitude faster inferences).\nMoreover, the incorporation of CVAE-generated priors in bilby reduces the\naverage runtime of the latter in about 48% with no penalty on its accuracy. Our\nresults suggest that a CVAE model is a promising tool for future low-latency\nsearches of lensed signals. Further applications to actual signals and\nintegration with advanced pipelines could help extend the capabilities of GW\nobservatories in detecting microlensing events.\n",
  "subjects": [
    "Physics/General Relativity and Quantum Cosmology",
    "Astrophysics/Cosmology and Nongalactic Astrophysics",
    "Astrophysics/High Energy Astrophysical Phenomena",
    "Astrophysics/Instrumentation and Methods for Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "UgTYhiQUyEsughQ4Y0fUsTa-n1xYWAj28bxvBgUYEdo",
  "pdfSize": "1407557"
}