{"id":"2412.18287","title":"Semi-supervised Credit Card Fraud Detection via Attribute-Driven Graph\n  Representation","authors":"Sheng Xiang, Mingzhi Zhu, Dawei Cheng, Enxia Li, Ruihui Zhao, Yi\n  Ouyang, Ling Chen, Yefeng Zheng","authorsParsed":[["Xiang","Sheng",""],["Zhu","Mingzhi",""],["Cheng","Dawei",""],["Li","Enxia",""],["Zhao","Ruihui",""],["Ouyang","Yi",""],["Chen","Ling",""],["Zheng","Yefeng",""]],"versions":[{"version":"v1","created":"Tue, 24 Dec 2024 08:48:48 GMT"}],"updateDate":"2024-12-25","timestamp":1735030128000,"abstract":"  Credit card fraud incurs a considerable cost for both cardholders and issuing\nbanks. Contemporary methods apply machine learning-based classifiers to detect\nfraudulent behavior from labeled transaction records. But labeled data are\nusually a small proportion of billions of real transactions due to expensive\nlabeling costs, which implies that they do not well exploit many natural\nfeatures from unlabeled data. Therefore, we propose a semi-supervised graph\nneural network for fraud detection. Specifically, we leverage transaction\nrecords to construct a temporal transaction graph, which is composed of\ntemporal transactions (nodes) and interactions (edges) among them. Then we pass\nmessages among the nodes through a Gated Temporal Attention Network (GTAN) to\nlearn the transaction representation. We further model the fraud patterns\nthrough risk propagation among transactions. The extensive experiments are\nconducted on a real-world transaction dataset and two publicly available fraud\ndetection datasets. The result shows that our proposed method, namely GTAN,\noutperforms other state-of-the-art baselines on three fraud detection datasets.\nSemi-supervised experiments demonstrate the excellent fraud detection\nperformance of our model with only a tiny proportion of labeled data.\n","subjects":["Computer Science/Machine Learning","Computer Science/Artificial Intelligence","Computer Science/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7sgy5mZ_7yLNdmyeZ5XK9RuHkCov2liP0-8GIrUH7ZE","pdfSize":"680994"}