{
  "id": "2412.12996",
  "title": "Neural Control and Certificate Repair via Runtime Monitoring",
  "authors": "Emily Yu, {\\DJ}or{\\dj}e \\v{Z}ikeli\\'c, Thomas A. Henzinger",
  "authorsParsed": [
    [
      "Yu",
      "Emily",
      ""
    ],
    [
      "Žikelić",
      "Đorđe",
      ""
    ],
    [
      "Henzinger",
      "Thomas A.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 15:15:30 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734448530000,
  "abstract": "  Learning-based methods provide a promising approach to solving highly\nnon-linear control tasks that are often challenging for classical control\nmethods. To ensure the satisfaction of a safety property, learning-based\nmethods jointly learn a control policy together with a certificate function for\nthe property. Popular examples include barrier functions for safety and\nLyapunov functions for asymptotic stability. While there has been significant\nprogress on learning-based control with certificate functions in the white-box\nsetting, where the correctness of the certificate function can be formally\nverified, there has been little work on ensuring their reliability in the\nblack-box setting where the system dynamics are unknown. In this work, we\nconsider the problems of certifying and repairing neural network control\npolicies and certificate functions in the black-box setting. We propose a novel\nframework that utilizes runtime monitoring to detect system behaviors that\nviolate the property of interest under some initially trained neural network\npolicy and certificate. These violating behaviors are used to extract new\ntraining data, that is used to re-train the neural network policy and the\ncertificate function and to ultimately repair them. We demonstrate the\neffectiveness of our approach empirically by using it to repair and to boost\nthe safety rate of neural network policies learned by a state-of-the-art method\nfor learning-based control on two autonomous system control tasks.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "M3Wt7Y0O79-4xH4zgtK60LWwVYjgINZT99dIHkR4W5k",
  "pdfSize": "940267"
}