{"id":"2412.18784","title":"Zema Dataset: A Comprehensive Study of Yaredawi Zema with a Focus on\n  Horologium Chants","authors":"Mequanent Argaw Muluneh, Yan-Tsung Peng, Worku Abebe Degife, Nigussie\n  Abate Tadesse, Aknachew Mebreku Demeku, Li Su","authorsParsed":[["Muluneh","Mequanent Argaw",""],["Peng","Yan-Tsung",""],["Degife","Worku Abebe",""],["Tadesse","Nigussie Abate",""],["Demeku","Aknachew Mebreku",""],["Su","Li",""]],"versions":[{"version":"v1","created":"Wed, 25 Dec 2024 05:20:08 GMT"}],"updateDate":"2024-12-30","timestamp":1735104008000,"abstract":"  Computational music research plays a critical role in advancing music\nproduction, distribution, and understanding across various musical styles\nworldwide. Despite the immense cultural and religious significance, the\nEthiopian Orthodox Tewahedo Church (EOTC) chants are relatively\nunderrepresented in computational music research. This paper contributes to\nthis field by introducing a new dataset specifically tailored for analyzing\nEOTC chants, also known as Yaredawi Zema. This work provides a comprehensive\noverview of a 10-hour dataset, 369 instances, creation, and curation process,\nincluding rigorous quality assurance measures. Our dataset has a detailed\nword-level temporal boundary and reading tone annotation along with the\ncorresponding chanting mode label of audios. Moreover, we have also identified\nthe chanting options associated with multiple chanting notations in the\nmanuscript by annotating them accordingly. Our goal in making this dataset\navailable to the public 1 is to encourage more research and study of EOTC\nchants, including lyrics transcription, lyric-to-audio alignment, and music\ngeneration tasks. Such research work will advance knowledge and efforts to\npreserve this distinctive liturgical music, a priceless cultural artifact for\nthe Ethiopian people.\n","subjects":["Electrical Engineering and Systems Science/Audio and Speech Processing","Computer Science/Information Retrieval","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_iwmgpEAg5aW-C2Nacs38QzChuRZArFZM59tl8ricnA","pdfSize":"2305953"}