{"id":"2412.01609","title":"Optimizing LoRa for Edge Computing with TinyML Pipeline for Channel\n  Hopping","authors":"Marla Grunewald and Mounir Bensalem and Admela Jukan","authorsParsed":[["Grunewald","Marla",""],["Bensalem","Mounir",""],["Jukan","Admela",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 15:28:44 GMT"}],"updateDate":"2024-12-03","timestamp":1733153324000,"abstract":"  We propose to integrate long-distance LongRange (LoRa) communication solution\nfor sending the data from IoT to the edge computing system, by taking advantage\nof its unlicensed nature and the potential for open source implementations that\nare common in edge computing. We propose a channel hoping optimization model\nand apply TinyML-based channel hoping model based for LoRa transmissions, as\nwell as experimentally study a fast predictive algorithm to find free channels\nbetween edge and IoT devices. In the open source experimental setup that\nincludes LoRa, TinyML and IoT-edge-cloud continuum, we integrate a novel\napplication workflow and cloud-friendly protocol solutions in a case study of\nplant recommender application that combines concepts of microfarming and urban\ncomputing. In a LoRa-optimized edge computing setup, we engineer the\napplication workflow, and apply collaborative filtering and various machine\nlearning algorithms on application data collected to identify and recommend the\nplanting schedule for a specific microfarm in an urban area. In the LoRa\nexperiments, we measure the occurrence of packet loss, RSSI, and SNR, using a\nrandom channel hoping scheme to compare with our proposed TinyML method. The\nresults show that it is feasible to use TinyML in microcontrollers for channel\nhopping, while proving the effectiveness of TinyML in learning to predict the\nbest channel to select for LoRa transmission, and by improving the RSSI by up\nto 63 %, SNR by up to 44 % in comparison with a random hopping mechanism.\n","subjects":["Computer Science/Networking and Internet Architecture","Computer Science/Artificial Intelligence","Computer Science/Discrete Mathematics","Computer Science/Machine Learning","Computer Science/Performance"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"EiNE6E23z9pU7NlkdWpkUDBLEQ2-Taa2Vb6EGwJWrcY","pdfSize":"17907782"}