{
  "id": "2412.07647",
  "title": "Simultaneous emission from dust and gas in the planetary debris orbiting\n  a white dwarf",
  "authors": "Laura K. Rogers, Christopher J. Manser, Amy Bonsor, Erik Dennihy,\n  Simon Hodgkin, Markus Kissler-Patig, Samuel Lai, Carl Melis, Siyi Xu, Nicola\n  Gentile Fusillo, Boris G\\\"ansicke, Andrew Swan, Odette Toloza, Dimitri Veras",
  "authorsParsed": [
    [
      "Rogers",
      "Laura K.",
      ""
    ],
    [
      "Manser",
      "Christopher J.",
      ""
    ],
    [
      "Bonsor",
      "Amy",
      ""
    ],
    [
      "Dennihy",
      "Erik",
      ""
    ],
    [
      "Hodgkin",
      "Simon",
      ""
    ],
    [
      "Kissler-Patig",
      "Markus",
      ""
    ],
    [
      "Lai",
      "Samuel",
      ""
    ],
    [
      "Melis",
      "Carl",
      ""
    ],
    [
      "Xu",
      "Siyi",
      ""
    ],
    [
      "Fusillo",
      "Nicola Gentile",
      ""
    ],
    [
      "Gänsicke",
      "Boris",
      ""
    ],
    [
      "Swan",
      "Andrew",
      ""
    ],
    [
      "Toloza",
      "Odette",
      ""
    ],
    [
      "Veras",
      "Dimitri",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 16:33:17 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733848397000,
  "abstract": "  There is increasing evidence for the presence and variability of\ncircumstellar dust and gas around white dwarfs that are polluted with\nexoplanetary material, although the origin of this dust and gas remains\ndebated. This paper presents the first near-simultaneous observations of both\ncircumstellar dust (via broadband emission) and gas (via emission lines) around\na polluted white dwarf. From the optical spectra the gaseous emission lines,\nnotably the calcium infrared triplet and magnesium lines, show significant\nincreases and decreases in their strength over timescales of weeks, while the\noxygen and iron lines remain relatively stable. Near-infrared JHKs photometry\nreveals dust emission changes of up to 0.2 magnitudes in the Ks band over\nsimilar timescales, marking the shortest variability timescales observed to\ndate. The two epochs with the strongest emission were correlated between the\ndust (Ks band brightening) and gas (strengthened calcium and magnesium lines),\nshowing for the first time that the dust and gas must be produced\nnear-simultaneously with a common origin, likely in collisions.\n",
  "subjects": [
    "Astrophysics/Earth and Planetary Astrophysics",
    "Astrophysics/Solar and Stellar Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "RTIHEkWea7q9wDO0KON7_Zv7-9TWbR_Vw85F8FoxQ4A",
  "pdfSize": "932921"
}