{
  "id": "2412.13421",
  "title": "Detecting Machine-Generated Music with Explainability -- A Challenge and\n  Early Benchmarks",
  "authors": "Yupei Li, Qiyang Sun, Hanqian Li, Lucia Specia, Bj\\\"orn W. Schuller",
  "authorsParsed": [
    [
      "Li",
      "Yupei",
      ""
    ],
    [
      "Sun",
      "Qiyang",
      ""
    ],
    [
      "Li",
      "Hanqian",
      ""
    ],
    [
      "Specia",
      "Lucia",
      ""
    ],
    [
      "Schuller",
      "Björn W.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 01:36:34 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734485794000,
  "abstract": "  Machine-generated music (MGM) has become a groundbreaking innovation with\nwide-ranging applications, such as music therapy, personalised editing, and\ncreative inspiration within the music industry. However, the unregulated\nproliferation of MGM presents considerable challenges to the entertainment,\neducation, and arts sectors by potentially undermining the value of\nhigh-quality human compositions. Consequently, MGM detection (MGMD) is crucial\nfor preserving the integrity of these fields. Despite its significance, MGMD\ndomain lacks comprehensive benchmark results necessary to drive meaningful\nprogress. To address this gap, we conduct experiments on existing large-scale\ndatasets using a range of foundational models for audio processing,\nestablishing benchmark results tailored to the MGMD task. Our selection\nincludes traditional machine learning models, deep neural networks,\nTransformer-based architectures, and State Space Models (SSM). Recognising the\ninherently multimodal nature of music, which integrates both melody and lyrics,\nwe also explore fundamental multimodal models in our experiments. Beyond\nproviding basic binary classification outcomes, we delve deeper into model\nbehaviour using multiple explainable Aritificial Intelligence (XAI) tools,\noffering insights into their decision-making processes. Our analysis reveals\nthat ResNet18 performs the best according to in-domain and out-of-domain tests.\nBy providing a comprehensive comparison of benchmark results and their\ninterpretability, we propose several directions to inspire future research to\ndevelop more robust and effective detection methods for MGM.\n",
  "subjects": [
    "Computer Science/Sound",
    "Electrical Engineering and Systems Science/Audio and Speech Processing"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "I9R_OCOMlOG6AI5NOTPzwiAaVaR3RBOhL6R-DAEYSyY",
  "pdfSize": "1451196"
}