{"id":"2412.05751","title":"Global Weak Solutions to a Navier-Stokes-Cahn-Hilliard System with\n  Chemotaxis and Mass Transport: Cross Diffusion versus Logistic Degradation","authors":"Andrea Giorgini, Jingning He, Hao Wu","authorsParsed":[["Giorgini","Andrea",""],["He","Jingning",""],["Wu","Hao",""]],"versions":[{"version":"v1","created":"Sat, 7 Dec 2024 21:34:53 GMT"}],"updateDate":"2024-12-10","timestamp":1733607293000,"abstract":"  We analyze a diffuse interface model that describes the dynamics of\nincompressible two-phase flows influenced by interactions with a soluble\nchemical substance, encompassing the chemotaxis effect, mass transport, and\nreactions. In the resulting coupled evolutionary system, the macroscopic fluid\nvelocity field $\\boldsymbol{v}$ satisfies a Navier--Stokes system driven by a\ncapillary force, the phase field variable $\\varphi$ is governed by a convective\nCahn--Hilliard equation incorporating a mass source and a singular potential\n(e.g., the Flory--Huggins type), and the chemical concentration $\\sigma$ obeys\nan advection-reaction-diffusion equation with logistic degradation, exhibiting\na cross-diffusion structure akin to the Keller--Segel model for chemotaxis.\nUnder general structural assumptions, we establish the existence of global weak\nsolutions to the initial boundary value problem within a bounded smooth domain\n$\\Omega\\subset \\mathbb{R}^d$, $d=2,3$. The proof hinges on a novel\nsemi-Galerkin scheme for a suitably regularized system, featuring a\nnon-standard approximation of the singular potential. Moreover, with more\nrestrictive assumptions on coefficients and data, we establish regularity\nproperties and uniqueness of global weak solutions in the two-dimensional case.\nOur analysis contributes to a further understanding of phase separation\nprocesses under the interplay of fluid dynamics and chemotaxis, in particular,\nthe influence of cross diffusion and logistic degradation.\n","subjects":["Mathematics/Analysis of PDEs"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"zFg1V7DOVSFcOvvR0MidDr0CHWskVpLZqWtCTR7a7o8","pdfSize":"481616"}