{
  "id": "2412.18995",
  "title": "MiTREE: Multi-input Transformer Ecoregion Encoder for Species\n  Distribution Modelling",
  "authors": "Theresa Chen and Yao-Yi Chiang",
  "authorsParsed": [
    [
      "Chen",
      "Theresa",
      ""
    ],
    [
      "Chiang",
      "Yao-Yi",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 25 Dec 2024 22:20:47 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735165247000,
  "abstract": "  Climate change poses an extreme threat to biodiversity, making it imperative\nto efficiently model the geographical range of different species. The\navailability of large-scale remote sensing images and environmental data has\nfacilitated the use of machine learning in Species Distribution Models (SDMs),\nwhich aim to predict the presence of a species at any given location.\nTraditional SDMs, reliant on expert observation, are labor-intensive, but\nadvancements in remote sensing and citizen science data have facilitated\nmachine learning approaches to SDM development. However, these models often\nstruggle with leveraging spatial relationships between different inputs -- for\ninstance, learning how climate data should inform the data present in satellite\nimagery -- without upsampling or distorting the original inputs. Additionally,\nlocation information and ecological characteristics at a location play a\ncrucial role in predicting species distribution models, but these aspects have\nnot yet been incorporated into state-of-the-art approaches. In this work, we\nintroduce MiTREE: a multi-input Vision-Transformer-based model with an\necoregion encoder. MiTREE computes spatial cross-modal relationships without\nupsampling as well as integrates location and ecological context. We evaluate\nour model on the SatBird Summer and Winter datasets, the goal of which is to\npredict bird species encounter rates, and we find that our approach improves\nupon state-of-the-art baselines.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Machine Learning",
    "Quantitative Biology/Quantitative Methods"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "ool8_YHteqVU1RuvaXesQ8DZlcac3YAIxsObATqYSiQ",
  "pdfSize": "7597222"
}