{"id":"2412.06386","title":"Estimation of Classical Cepheid's Physical Parameters from NIR Light\n  Curves","authors":"Lajos G. Bal\\'azs and G\\'abor B. Kov\\'acs","authorsParsed":[["Balázs","Lajos G.",""],["Kovács","Gábor B.",""]],"versions":[{"version":"v1","created":"Mon, 9 Dec 2024 11:12:33 GMT"}],"updateDate":"2025-01-13","timestamp":1733742753000,"abstract":"  Recent space-borne and ground-based observations provide photometric\nmeasurements as time series. The effect of interstellar dust extinction in the\nnear-infrared range is only 10% of that measured in the V band. However, the\nsensitivity of the light curve shape to the physical parameters in the\nnear-infrared is much lower. So, interpreting these types of data sets requires\nnew approaches like the different large-scale surveys, which create similar\nproblems with big data. Using a selected data set, we provide a method for\napplying routines implemented in R to extract most information of measurements\nto determine physical parameters, which can also be used in automatic\nclassification schemes and pipeline processing. We made a multivariate\nclassification of 131 Cepheid light curves (LC) in J, H, and K colors, where\nall the LCs were represented in 20D parameter space in these colors separately.\nPerforming a Principal Component Analysis (PCA), we got an orthogonal\ncoordinate system and squared Euclidean distances between LCs, with 6\nsignificant eigenvalues, reducing the 20-dimension to 6. We also estimated the\noptimal number of partitions of similar objects and found it to be equal to 7\nin each color; their dependence on the period, absolute magnitude, amplitude,\nand metallicity are also discussed. We computed the Spearman rank correlations,\nshowing that periods and absolute magnitudes correlate with the first three PCs\nsignificantly. The first two PC are also found to have a relationship with the\namplitude, but the metallicity effects are only marginal. The method shown can\nbe generalized and implemented in unsupervised classification schemes and\nanalysis of mixed and biased samples. The analysis of our Classical Cepheid\nnear-infrared LC sample showed that the J, H, K curves are insufficient for\ndetermination of stellar metallicity, with mass being the key factor shaping\nthem.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"VuozBH1USuF-KQ9JcABvNz6QXSCwTSLvPnxC-syFrsY","pdfSize":"994999"}