{"id":"2412.02116","title":"ILASH: A Predictive Neural Architecture Search Framework for Multi-Task\n  Applications","authors":"Md Hafizur Rahman, Md Mashfiq Rizvee, Sumaiya Shomaji and Prabuddha\n  Chakraborty","authorsParsed":[["Rahman","Md Hafizur",""],["Rizvee","Md Mashfiq",""],["Shomaji","Sumaiya",""],["Chakraborty","Prabuddha",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 03:12:16 GMT"}],"updateDate":"2024-12-04","timestamp":1733195536000,"abstract":"  Artificial intelligence (AI) is widely used in various fields including\nhealthcare, autonomous vehicles, robotics, traffic monitoring, and agriculture.\nMany modern AI applications in these fields are multi-tasking in nature (i.e.\nperform multiple analysis on same data) and are deployed on\nresource-constrained edge devices requiring the AI models to be efficient\nacross different metrics such as power, frame rate, and size. For these\nspecific use-cases, in this work, we propose a new paradigm of neural network\narchitecture (ILASH) that leverages a layer sharing concept for minimizing\npower utilization, increasing frame rate, and reducing model size.\nAdditionally, we propose a novel neural network architecture search framework\n(ILASH-NAS) for efficient construction of these neural network models for a\ngiven set of tasks and device constraints. The proposed NAS framework utilizes\na data-driven intelligent approach to make the search efficient in terms of\nenergy, time, and CO2 emission. We perform extensive evaluations of the\nproposed layer shared architecture paradigm (ILASH) and the ILASH-NAS framework\nusing four open-source datasets (UTKFace, MTFL, CelebA, and Taskonomy). We\ncompare ILASH-NAS with AutoKeras and observe significant improvement in terms\nof both the generated model performance and neural search efficiency with up to\n16x less energy utilization, CO2 emission, and training/search time.\n","subjects":["Computer Science/Machine Learning","Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"qhQb-aA4QIR3azvqiEq08BKiTZGqBgWfGAm_hfeMAog","pdfSize":"883880"}