{"id":"2412.15443","title":"SKETCH: Structured Knowledge Enhanced Text Comprehension for Holistic\n  Retrieval","authors":"Aakash Mahalingam, Vinesh Kumar Gande, Aman Chadha, Vinija Jain, Divya\n  Chaudhary","authorsParsed":[["Mahalingam","Aakash",""],["Gande","Vinesh Kumar",""],["Chadha","Aman",""],["Jain","Vinija",""],["Chaudhary","Divya",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 22:51:56 GMT"}],"updateDate":"2024-12-23","timestamp":1734648716000,"abstract":"  Retrieval-Augmented Generation (RAG) systems have become pivotal in\nleveraging vast corpora to generate informed and contextually relevant\nresponses, notably reducing hallucinations in Large Language Models. Despite\nsignificant advancements, these systems struggle to efficiently process and\nretrieve information from large datasets while maintaining a comprehensive\nunderstanding of the context. This paper introduces SKETCH, a novel methodology\nthat enhances the RAG retrieval process by integrating semantic text retrieval\nwith knowledge graphs, thereby merging structured and unstructured data for a\nmore holistic comprehension. SKETCH, demonstrates substantial improvements in\nretrieval performance and maintains superior context integrity compared to\ntraditional methods. Evaluated across four diverse datasets: QuALITY, QASPER,\nNarrativeQA, and Italian Cuisine-SKETCH consistently outperforms baseline\napproaches on key RAGAS metrics such as answer_relevancy, faithfulness,\ncontext_precision and context_recall. Notably, on the Italian Cuisine dataset,\nSKETCH achieved an answer relevancy of 0.94 and a context precision of 0.99,\nrepresenting the highest performance across all evaluated metrics. These\nresults highlight SKETCH's capability in delivering more accurate and\ncontextually relevant responses, setting new benchmarks for future retrieval\nsystems.\n","subjects":["Computer Science/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"hyGKJ2_BTjEQd1oucCmebhLHhb65CCDN3U4kjgEEbHk","pdfSize":"1745019"}