{"id":"2412.14944","title":"Estimating the impact of light pollution on quantum communication\n  between QEYSSat and Canadian quantum ground station sites","authors":"Mathew Yastremski, Paul J. Godin, Nouralhoda Bayat, Sungeun Oh, Ziheng\n  Chang, Katanya B. Kuntz, Daniel Oblak, Thomas Jennewein","authorsParsed":[["Yastremski","Mathew",""],["Godin","Paul J.",""],["Bayat","Nouralhoda",""],["Oh","Sungeun",""],["Chang","Ziheng",""],["Kuntz","Katanya B.",""],["Oblak","Daniel",""],["Jennewein","Thomas",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 15:24:11 GMT"}],"updateDate":"2025-01-07","timestamp":1734621851000,"abstract":"  Satellite to ground quantum communication typically operates at night to\nreduce background signals, however it remains susceptible to noise from light\npollution of the night sky. In this study we compare several methodologies for\ndetermining whether a Quantum Ground Station (QGS) site is viable for\nexchanging quantum signals with the upcoming Quantum Encryption and Science\nSatellite (QEYSSat) mission. We conducted ground site characterization studies\nat three locations in Canada: Waterloo, Ontario, Calgary, Alberta, and Priddis,\nAlberta. Using different methods we estimate the background counts expected to\nleak into the satellite-ground quantum channel, and determined whether the\nnoise levels could prevent a quantum key transfer. We also investigate how\nsatellite data recorded from the Visible Infrared Imaging Radiometer Suite\n(VIIRS) can help estimate conditions of a particular site, and find reasonable\nagreement with the locally recorded data. Our results indicate that the\nWaterloo, Calgary, and Priddis QGS sites should allow both quantum uplinks and\ndownlinks with QEYSSat, despite their proximity to urban centres. Furthermore,\nour approach allows the use of satellite borne instrument data (VIIRS) to\nremotely and efficiently determine the potential of a ground site.\n","subjects":["Physics/Quantum Physics","Physics/Optics","Physics/Space Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"citCx1QyMc87eZzO4rU6rfHoQqAG94o-SfQurBbHEDE","pdfSize":"9698107"}