{"id":"2412.14027","title":"Ultra-directional and high-efficiency $\\mu$LEDs via gradient index\n  filled micro-Horn collimators","authors":"Alexander Luce, Rasoul Alaee, Aimi Abass","authorsParsed":[["Luce","Alexander",""],["Alaee","Rasoul",""],["Abass","Aimi",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 16:45:44 GMT"}],"updateDate":"2024-12-19","timestamp":1734540344000,"abstract":"  Micro-LEDs ($\\mu$LEDs) are poised to transform AR/VR, display, and optical\ncommunication technologies, but they are currently hindered by low light\nextraction efficiency and non-directional emission. Our study introduces an\ninnovative approach using a descending index multilayer anti-reflection coating\ncombined with a horn collimator structure atop the $\\mu$LED pixel. This design\nleverages the propagation of light outside the critical angle to enhance both\nthe directionality and extraction efficiency of emitted light. By implementing\neither discrete or continuous refractive index gradients within the horn, we\nachieve a dramatic tenfold increase in light extraction within a\n$\\pm$15$^\\circ$ cone, with an overall light extraction efficiency reaching\napproximately 80%, where 31% of the power is concentrated within this narrow\ncone. This performance surpasses that of an optimized SiO2 half-ellipsoidal\nlens, which diameter and height is 24X and 26X larger than the pixel width\nrespectively, while our design only slightly increases the device height and\nexpands the final light escape surface to 3 times and roughly 4 times the pixel\nwidth respectively. Such efficiency, directionality enhancement, and\ncompactness make this solution particularly suitable for high-resolution,\ndensely packed $\\mu$LED arrays, promising advancements in high-performance,\nminiaturized display systems.\n","subjects":["Physics/Optics","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"xvF5MmtEbVIx8b64rTqk8m6IVyk8-ilptcNXRMYPKTk","pdfSize":"18665053"}