{
  "id": "2412.05761",
  "title": "Interactions Between Artificial Intelligence and Digital Public\n  Infrastructure: Concepts, Benefits, and Challenges",
  "authors": "Sarosh Nagar, David Eaves",
  "authorsParsed": [
    [
      "Nagar",
      "Sarosh",
      ""
    ],
    [
      "Eaves",
      "David",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 7 Dec 2024 23:25:13 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733613913000,
  "abstract": "  Artificial intelligence (AI) and digital public infrastructure (DPI) are two\ntechnological developments that have taken center stage in global policy\ndiscourse. Yet, to date, there has been relatively little discussion about how\nAI and DPI can mutually enhance the public value provided by each other.\nTherefore, in this paper, we describe both the opportunities and challenges\nunder which AI and DPI can interact for mutual benefit. First, we define both\nAI and DPI to provide clarity and help policymakers distinguish between these\ntwo technological developments. Second, we provide empirical evidence for how\nAI, a general-purpose technology, can integrate into many DPI systems, aiding\nDPI function in use cases like language localization via machine translation\n(MT), personalized service delivery via recommender systems, and more. Third,\nwe catalog how DPI can act as a foundation for creating more advanced AI\nsystems by improving both the quantity and quality of training data available.\nFourth, we discuss the challenges of integrating AI and DPI, including high\ninference costs for advanced AI models, interoperability challenges with legacy\nsoftware, concerns about induced bias in AI systems, and privacy challenges\nrelated to DPI. We conclude with key takeaways for how policymakers can work to\nenhance the positive interactions of AI and DPI.\n",
  "subjects": [
    "Computer Science/Computers and Society"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "HS08QSuq7wKYQuHjXo07W2kwhcLkTefabp_rzrTMT7g",
  "pdfSize": "245026"
}