{
  "id": "2412.14206",
  "title": "Design of an AI-Enhanced Digital Stethoscope: Advancing Cardiovascular\n  Diagnostics Through Smart Auscultation",
  "authors": "Abraham G. Taye, Sador Yemane, Eshetu Negash, Yared Minwuyelet, Nebiha\n  Tofik",
  "authorsParsed": [
    [
      "Taye",
      "Abraham G.",
      ""
    ],
    [
      "Yemane",
      "Sador",
      ""
    ],
    [
      "Negash",
      "Eshetu",
      ""
    ],
    [
      "Minwuyelet",
      "Yared",
      ""
    ],
    [
      "Tofik",
      "Nebiha",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 03:24:02 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734405842000,
  "abstract": "  In the ever-evolving landscape of medical diagnostics, this study details the\nsystematic design process and concept selection methodology for developing an\nadvanced digital stethoscope, demonstrating the evolution from traditional\nacoustic models to AI-enhanced digital solutions. The device integrates\ncutting-edge AI technology with traditional auscultation methods to create a\nmore accurate, efficient, and user-friendly diagnostic tool. Through systematic\nproduct planning, customer need analysis, and rigorous specification\ndevelopment, we identified key opportunities to enhance conventional\nstethoscope functionality. The proposed system features real-time sound\nanalysis, automated classification of heart sounds, wireless connectivity for\nremote consultations, and an intuitive user interface accessible via smartphone\nintegration. The design process employed a methodical approach incorporating\ncustomer feedback, competitive benchmarking, and systematic concept generation\nand selection. Through a structured evaluation framework, we analyzed\nportability, frequency response sensitivity, transmission quality, maintenance\nease, user interface simplicity, output signal quality, power efficiency, and\ncost-effectiveness. The final design prioritizes biocompatibility, reliability,\nand cost-effectiveness while addressing the growing demand for telemedicine\ncapabilities in cardiovascular care. The project emphasizes the transition from\nconventional design to advanced digital solutions while maintaining a focus on\npractical clinical applications. Each concept was modelled using SOLIDWORKS\nsoftware, enabling detailed visualization and engineering analysis. This\nsystematic approach to concept screening and selection ensures the final design\nmeets both current healthcare needs and future technological adaptability.\n",
  "subjects": [
    "Computer Science/Human-Computer Interaction",
    "Computer Science/Hardware Architecture"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "H1urqTChmORQX4XbDEZ7N_BVa719Jq3iX-xVkdSdwg0",
  "pdfSize": "2029216"
}