{"id":"2412.16310","title":"Sulfur in diamond and its effect on the creation of nitrogen-vacancy\n  defect from \\textit{ab initio} simulations","authors":"Nima Ghafari Cherati, Anton Pershin, \\'Ad\\'am Gali","authorsParsed":[["Cherati","Nima Ghafari",""],["Pershin","Anton",""],["Gali","Ádám",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 19:43:47 GMT"},{"version":"v2","created":"Wed, 12 Feb 2025 22:28:32 GMT"}],"updateDate":"2025-02-14","timestamp":1734723827000,"abstract":"  The negatively charged nitrogen-vacancy (NV) center is one of the most\nsignificant and widely studied defects in diamond that plays a prominent role\nin quantum technologies. The precise engineering of the location and\nconcentration of NV centers is of great importance in quantum technology\napplications. To this end, irradiation techniques such as nitrogen-molecule ion\nimplantation are applied. Recent studies have reported enhanced NV center\ncreation and activation efficiencies introduced by nitrogen molecule ion\nimplantation in doped diamond layers, where the maximum creation efficiency at\n$\\sim75$\\% has been achieved in sulfur-doped layers. However, the microscopic\nmechanisms behind these observations and the limits of the efficiencies are far\nfrom understood. In this study, we employ hybrid density functional theory\ncalculations to compute the formation energies, charge transition levels, and\nthe magneto-optical properties of various sulfur defects in diamond where we\nalso consider the interaction of sulfur and hydrogen in chemical\nvapor-deposited diamond layers. Our results imply that the competition between\nthe donor substitutional sulfur and the hyper-deep acceptor sulfur-vacancy\ncomplex is an important limiting factor on the creation efficiency of the NV\ncenter in diamond. However, both species are able to trap interstitial hydrogen\nfrom diamond, which favorably mediates the creation of NV centers in chemical\nvapor-deposited diamond layers.\n","subjects":["Condensed Matter/Materials Science","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"f5SIKi1PHSD52-zAK3KMXnznttZraTIlOZAQpUOP-fk","pdfSize":"31908622"}