{"id":"2412.07857","title":"Adaptation of Wallace's Approach to the Specific Heat of Elemental\n  Solids with Significant Intrinsic Anharmonicity, Particularly the Light\n  Actinide Metals","authors":"Christopher A. Mizzi, W. Adam Phelan, Matthew S. Cook, Greta L.\n  Chappell, Paul H. Tobash, David C. Arellano, Derek V. Prada, Boris Maiorov,\n  and Neil Harrison","authorsParsed":[["Mizzi","Christopher A.",""],["Phelan","W. Adam",""],["Cook","Matthew S.",""],["Chappell","Greta L.",""],["Tobash","Paul H.",""],["Arellano","David C.",""],["Prada","Derek V.",""],["Maiorov","Boris",""],["Harrison","Neil",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 19:02:32 GMT"}],"updateDate":"2024-12-12","timestamp":1733857352000,"abstract":"  The quasiharmonic approximation is the most common method for modeling the\nspecific heat of solids; however, it fails to capture the effects of intrinsic\nanharmonicity in phonons. In this study, we introduce the \"elastic softening\napproximation,\" an alternative approach to modelling intrinsic anharmonic\neffects on thermodynamic quantities which is grounded in Wallace's\nthermodynamic framework (Thermodynamics of Crystals, 1972) and focused on\ntracking entropy changes due to the continuous softening of phonons as a\nfunction of temperature. A key finding of our study is a direct correlation\nbetween Poisson's ratio and the differential rate of phonon softening at finite\nfrequencies, compared to lower frequencies relevant to elastic moduli\nmeasurements. We observe that elemental solids such as alpha-Be, diamond, Al,\nCu, In, W, Au, and Pb, which span a wide range of Poisson's ratios and exhibit\nvarying degrees of intrinsic anharmonicity, consistently follow this trend.\nWhen applied to alpha-U, alpha-Pu, and delta-Pu, our method reveals unusually\nlarge anharmonic phonon contributions at elevated temperatures across all three\nlight actinide metals. These findings are attributed to the unique combination\nof enhanced covalency and softer elastic moduli inherent in the actinides,\npotentially influenced by their 5f-electron bonding.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"wIAKEvhBR4rwpqP7cW7NjTJ7vFqI1tXBsQYLKBEE26U","pdfSize":"2817456"}