{"id":"2412.02875","title":"Out-of-Distribution Detection for Neurosymbolic Autonomous Cyber Agents","authors":"Ankita Samaddar, Nicholas Potteiger, Xenofon Koutsoukos","authorsParsed":[["Samaddar","Ankita",""],["Potteiger","Nicholas",""],["Koutsoukos","Xenofon",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 22:20:52 GMT"}],"updateDate":"2024-12-05","timestamp":1733264452000,"abstract":"  Autonomous agents for cyber applications take advantage of modern defense\ntechniques by adopting intelligent agents with conventional and\nlearning-enabled components. These intelligent agents are trained via\nreinforcement learning (RL) algorithms, and can learn, adapt to, reason about\nand deploy security rules to defend networked computer systems while\nmaintaining critical operational workflows. However, the knowledge available\nduring training about the state of the operational network and its environment\nmay be limited. The agents should be trustworthy so that they can reliably\ndetect situations they cannot handle, and hand them over to cyber experts. In\nthis work, we develop an out-of-distribution (OOD) Monitoring algorithm that\nuses a Probabilistic Neural Network (PNN) to detect anomalous or OOD situations\nof RL-based agents with discrete states and discrete actions. To demonstrate\nthe effectiveness of the proposed approach, we integrate the OOD monitoring\nalgorithm with a neurosymbolic autonomous cyber agent that uses behavior trees\nwith learning-enabled components. We evaluate the proposed approach in a\nsimulated cyber environment under different adversarial strategies.\nExperimental results over a large number of episodes illustrate the overall\nefficiency of our proposed approach.\n","subjects":["Computer Science/Machine Learning","Computer Science/Artificial Intelligence","Computer Science/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"EWolkIFEcLiF2Qk5zR9i8cSYXIeGkLrBXBqr8i7svvA","pdfSize":"1276793"}