{"id":"2412.16435","title":"THeGCN: Temporal Heterophilic Graph Convolutional Network","authors":"Yuchen Yan, Yuzhong Chen, Huiyuan Chen, Xiaoting Li, Zhe Xu, Zhichen\n  Zeng, Lihui Liu, Zhining Liu, Hanghang Tong","authorsParsed":[["Yan","Yuchen",""],["Chen","Yuzhong",""],["Chen","Huiyuan",""],["Li","Xiaoting",""],["Xu","Zhe",""],["Zeng","Zhichen",""],["Liu","Lihui",""],["Liu","Zhining",""],["Tong","Hanghang",""]],"versions":[{"version":"v1","created":"Sat, 21 Dec 2024 01:52:03 GMT"},{"version":"v2","created":"Fri, 10 Jan 2025 19:49:12 GMT"}],"updateDate":"2025-01-14","timestamp":1734745923000,"abstract":"  Graph Neural Networks (GNNs) have exhibited remarkable efficacy in diverse\ngraph learning tasks, particularly on static homophilic graphs. Recent\nattention has pivoted towards more intricate structures, encompassing (1)\nstatic heterophilic graphs encountering the edge heterophily issue in the\nspatial domain and (2) event-based continuous graphs in the temporal domain.\nState-of-the-art (SOTA) has been concurrently addressing these two lines of\nwork but tends to overlook the presence of heterophily in the temporal domain,\nconstituting the temporal heterophily issue. Furthermore, we highlight that the\nedge heterophily issue and the temporal heterophily issue often co-exist in\nevent-based continuous graphs, giving rise to the temporal edge heterophily\nchallenge. To tackle this challenge, this paper first introduces the temporal\nedge heterophily measurement. Subsequently, we propose the Temporal\nHeterophilic Graph Convolutional Network (THeGCN), an innovative model that\nincorporates the low/high-pass graph signal filtering technique to accurately\ncapture both edge (spatial) heterophily and temporal heterophily. Specifically,\nthe THeGCN model consists of two key components: a sampler and an aggregator.\nThe sampler selects events relevant to a node at a given moment. Then, the\naggregator executes message-passing, encoding temporal information, node\nattributes, and edge attributes into node embeddings. Extensive experiments\nconducted on 5 real-world datasets validate the efficacy of THeGCN.\n","subjects":["Computer Science/Machine Learning","Computer Science/Information Retrieval","Computer Science/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"glh1dN41W-IZI5jp85TuZcBRCei-Y9YRW5M4sIfNI4M","pdfSize":"901246"}