{
  "id": "2412.10553",
  "title": "Edge AI-based Radio Frequency Fingerprinting for IoT Networks",
  "authors": "Ahmed Mohamed Hussain, Nada Abughanam, and Panos Papadimitratos",
  "authorsParsed": [
    [
      "Hussain",
      "Ahmed Mohamed",
      ""
    ],
    [
      "Abughanam",
      "Nada",
      ""
    ],
    [
      "Papadimitratos",
      "Panos",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 20:55:10 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734123310000,
  "abstract": "  The deployment of the Internet of Things (IoT) in smart cities and critical\ninfrastructure has enhanced connectivity and real-time data exchange but\nintroduced significant security challenges. While effective, cryptography can\noften be resource-intensive for small-footprint resource-constrained (i.e.,\nIoT) devices. Radio Frequency Fingerprinting (RFF) offers a promising\nauthentication alternative by using unique RF signal characteristics for device\nidentification at the Physical (PHY)-layer, without resorting to cryptographic\nsolutions. The challenge is two-fold: how to deploy such RFF in a large scale\nand for resource-constrained environments. Edge computing, processing data\ncloser to its source, i.e., the wireless device, enables faster\ndecision-making, reducing reliance on centralized cloud servers. Considering a\nmodest edge device, we introduce two truly lightweight Edge AI-based RFF\nschemes tailored for resource-constrained devices. We implement two Deep\nLearning models, namely a Convolution Neural Network and a Transformer-Encoder,\nto extract complex features from the IQ samples, forming device-specific RF\nfingerprints. We convert the models to TensorFlow Lite and evaluate them on a\nRaspberry Pi, demonstrating the practicality of Edge deployment. Evaluations\ndemonstrate the Transformer-Encoder outperforms the CNN in identifying unique\ntransmitter features, achieving high accuracy (> 0.95) and ROC-AUC scores (>\n0.90) while maintaining a compact model size of 73KB, appropriate for\nresource-constrained devices.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Cryptography and Security",
    "Computer Science/Networking and Internet Architecture",
    "Electrical Engineering and Systems Science/Signal Processing"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "KlltkSPwDsjTufFh2tqmnczB60rFgZ9oVlQ7b3KALNM",
  "pdfSize": "3380427"
}