{
  "id": "2412.03496",
  "title": "TRENDy: Temporal Regression of Effective Non-linear Dynamics",
  "authors": "Matthew Ricci, Guy Pelc, Zoe Piran, Noa Moriel, Mor Nitzan",
  "authorsParsed": [
    [
      "Ricci",
      "Matthew",
      ""
    ],
    [
      "Pelc",
      "Guy",
      ""
    ],
    [
      "Piran",
      "Zoe",
      ""
    ],
    [
      "Moriel",
      "Noa",
      ""
    ],
    [
      "Nitzan",
      "Mor",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 17:36:47 GMT"
    }
  ],
  "updateDate": "2024-12-05",
  "timestamp": 1733333807000,
  "abstract": "  Spatiotemporal dynamics pervade the natural sciences, from the morphogen\ndynamics underlying patterning in animal pigmentation to the protein waves\ncontrolling cell division. A central challenge lies in understanding how\ncontrollable parameters induce qualitative changes in system behavior called\nbifurcations. This endeavor is made particularly difficult in realistic\nsettings where governing partial differential equations (PDEs) are unknown and\ndata is limited and noisy. To address this challenge, we propose TRENDy\n(Temporal Regression of Effective Nonlinear Dynamics), an equation-free\napproach to learning low-dimensional, predictive models of spatiotemporal\ndynamics. Following classical work in spatial coarse-graining, TRENDy first\nmaps input data to a low-dimensional space of effective dynamics via a cascade\nof multiscale filtering operations. Our key insight is the recognition that\nthese effective dynamics can be fit by a neural ordinary differential equation\n(NODE) having the same parameter space as the input PDE. The preceding\nfiltering operations strongly regularize the phase space of the NODE, making\nTRENDy significantly more robust to noise compared to existing methods. We\ntrain TRENDy to predict the effective dynamics of synthetic and real data\nrepresenting dynamics from across the physical and life sciences. We then\ndemonstrate how our framework can automatically locate both Turing and Hopf\nbifurcations in unseen regions of parameter space. We finally apply our method\nto the analysis of spatial patterning of the ocellated lizard through\ndevelopment. We found that TRENDy's effective state not only accurately\npredicts spatial changes over time but also identifies distinct pattern\nfeatures unique to different anatomical regions, highlighting the potential\ninfluence of surface geometry on reaction-diffusion mechanisms and their role\nin driving spatially varying pattern dynamics.\n",
  "subjects": [
    "Nonlinear Sciences/Pattern Formation and Solitons",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "BE5UlznpejHSjjZ1Rae2h0CylsQiBlBpjM61oeQ0qpU",
  "pdfSize": "3533139"
}