{"id":"2412.07545","title":"Fault Isolation for the Ink Deposition Process in High-End Industrial\n  Printers","authors":"Casper van Peijpe, Farhad Ghanipoor, Youri de Loore, Pim Hacking,\n  Nathan van de Wouw, and Peyman Mohajerin Esfahani","authorsParsed":[["van Peijpe","Casper",""],["Ghanipoor","Farhad",""],["de Loore","Youri",""],["Hacking","Pim",""],["van de Wouw","Nathan",""],["Esfahani","Peyman Mohajerin",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 14:32:01 GMT"}],"updateDate":"2024-12-11","timestamp":1733841121000,"abstract":"  This paper presents a mathematical framework for modeling the dynamic effects\nof three fault categories and six fault variants in the ink channels of\nhigh-end industrial printers. It also introduces a hybrid approach that\ncombines model-based and data-based methods to detect and isolate these faults\neffectively. A key challenge in these systems is that the same piezo device is\nused for actuation (generating ink droplets) and for sensing and, as a\nconsequence, sensing is only available when there is no actuation. The proposed\nFault Detection (FD) filter, based on the healthy model, uses the piezo\nself-sensing signal to generate a residual, while taking the above challenge\ninto account. The system is flagged as faulty if the residual energy exceeds a\nthreshold. Fault Isolation (FI) is achieved through linear regression or a\nk-nearest neighbors approach to identify the most likely fault category and\nvariant. The resulting hybrid Fault Detection and Isolation (FDI) method\novercomes traditional limitations of model-based methods by isolating different\ntypes of faults affecting the same entries (i.e., equations) in the ink channel\ndynamics. Moreover, it is shown to outperform purely data-driven methods in\nfault isolation, especially when data is scarce. Experimental validation\ndemonstrates superior FDI performance compared to state-of-the-art methods.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computer Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"K57NZdPq_Q5hBRgJGNt1ZFnOYI1vBakj4Tb3GnS05d4","pdfSize":"3065612"}