{
  "id": "2412.05403",
  "title": "Knowledge-Based Deep Learning for Time-Efficient Inverse Dynamics",
  "authors": "Shuhao Ma, Yu Cao, Ian D. Robertson, Chaoyang Shi, Jindong Liu, and\n  Zhi-Qiang Zhang",
  "authorsParsed": [
    [
      "Ma",
      "Shuhao",
      ""
    ],
    [
      "Cao",
      "Yu",
      ""
    ],
    [
      "Robertson",
      "Ian D.",
      ""
    ],
    [
      "Shi",
      "Chaoyang",
      ""
    ],
    [
      "Liu",
      "Jindong",
      ""
    ],
    [
      "Zhang",
      "Zhi-Qiang",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 20:12:52 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733515972000,
  "abstract": "  Accurate understanding of muscle activation and muscle forces plays an\nessential role in neuro-rehabilitation and musculoskeletal disorder treatments.\nComputational musculoskeletal modeling has been widely used as a powerful\nnon-invasive tool to estimate them through inverse dynamics using static\noptimization, but the inherent computational complexity results in\ntime-consuming analysis. In this paper, we propose a knowledge-based deep\nlearning framework for time-efficient inverse dynamic analysis, which can\npredict muscle activation and muscle forces from joint kinematic data directly\nwhile not requiring any label information during model training. The\nBidirectional Gated Recurrent Unit (BiGRU) neural network is selected as the\nbackbone of our model due to its proficient handling of time-series data. Prior\nphysical knowledge from forward dynamics and pre-selected inverse dynamics\nbased physiological criteria are integrated into the loss function to guide the\ntraining of neural networks. Experimental validations on two datasets,\nincluding one benchmark upper limb movement dataset and one self-collected\nlower limb movement dataset from six healthy subjects, are performed. The\nexperimental results have shown that the selected BiGRU architecture\noutperforms other neural network models when trained using our specifically\ndesigned loss function, which illustrates the effectiveness and robustness of\nthe proposed framework.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Signal Processing",
    "Computer Science/Computational Engineering, Finance, and Science",
    "Computer Science/Human-Computer Interaction",
    "Computer Science/Machine Learning",
    "Physics/Biological Physics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "o6S_1iNMdeLcZqt4ZOakhxYWqjh56Y1YDDGT9pkWw1M",
  "pdfSize": "2120776"
}