{"id":"2412.02539","title":"Graph-Powered Defense: Controller Area Network Intrusion Detection for\n  Unmanned Aerial Vehicles","authors":"Reek Majumder, Gurcan Comert, David Werth, Adrian Gale, Mashrur\n  Chowdhury, M Sabbir Salek","authorsParsed":[["Majumder","Reek",""],["Comert","Gurcan",""],["Werth","David",""],["Gale","Adrian",""],["Chowdhury","Mashrur",""],["Salek","M Sabbir",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 16:32:57 GMT"}],"updateDate":"2024-12-04","timestamp":1733243577000,"abstract":"  The network of services, including delivery, farming, and environmental\nmonitoring, has experienced exponential expansion in the past decade with\nUnmanned Aerial Vehicles (UAVs). Yet, UAVs are not robust enough against\ncyberattacks, especially on the Controller Area Network (CAN) bus. The CAN bus\nis a general-purpose vehicle-bus standard to enable microcontrollers and\nin-vehicle computers to interact, primarily connecting different Electronic\nControl Units (ECUs). In this study, we focus on solving some of the most\ncritical security weaknesses in UAVs by developing a novel graph-based\nintrusion detection system (IDS) leveraging the Uncomplicated Application-level\nVehicular Communication and Networking (UAVCAN) protocol. First, we decode CAN\nmessages based on UAVCAN protocol specification; second, we present a\ncomprehensive method of transforming tabular UAVCAN messages into graph\nstructures. Lastly, we apply various graph-based machine learning models for\ndetecting cyber-attacks on the CAN bus, including graph convolutional neural\nnetworks (GCNNs), graph attention networks (GATs), Graph Sample and Aggregate\nNetworks (GraphSAGE), and graph structure-based transformers. Our findings show\nthat inductive models such as GATs, GraphSAGE, and graph-based transformers can\nachieve competitive and even better accuracy than transductive models like\nGCNNs in detecting various types of intrusions, with minimum information on\nprotocol specification, thus providing a generic robust solution for CAN bus\nsecurity for the UAVs. We also compared our results with baseline single-layer\nLong Short-Term Memory (LSTM) and found that all our graph-based models perform\nbetter without using any decoded features based on the UAVCAN protocol,\nhighlighting higher detection performance with protocol-independent capability.\n","subjects":["Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"pggicnC6WuP_KPvqCWUDW0cMl2-k38T8E_rGJRPj9Bo","pdfSize":"696529"}