{
  "id": "2412.02574",
  "title": "Generating Critical Scenarios for Testing Automated Driving Systems",
  "authors": "Trung-Hieu Nguyen, Truong-Giang Vuong, Hong-Nam Duong, Son Nguyen,\n  Hieu Dinh Vo, Toshiaki Aoki, and Thu-Trang Nguyen",
  "authorsParsed": [
    [
      "Nguyen",
      "Trung-Hieu",
      ""
    ],
    [
      "Vuong",
      "Truong-Giang",
      ""
    ],
    [
      "Duong",
      "Hong-Nam",
      ""
    ],
    [
      "Nguyen",
      "Son",
      ""
    ],
    [
      "Vo",
      "Hieu Dinh",
      ""
    ],
    [
      "Aoki",
      "Toshiaki",
      ""
    ],
    [
      "Nguyen",
      "Thu-Trang",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 16:59:30 GMT"
    }
  ],
  "updateDate": "2024-12-04",
  "timestamp": 1733245170000,
  "abstract": "  Autonomous vehicles (AVs) have demonstrated significant potential in\nrevolutionizing transportation, yet ensuring their safety and reliability\nremains a critical challenge, especially when exposed to dynamic and\nunpredictable environments. Real-world testing of an Autonomous Driving System\n(ADS) is both expensive and risky, making simulation-based testing a preferred\napproach. In this paper, we propose AVASTRA, a Reinforcement Learning\n(RL)-based approach to generate realistic critical scenarios for testing ADSs\nin simulation environments. To capture the complexity of driving scenarios,\nAVASTRA comprehensively represents the environment by both the internal states\nof an ADS under-test (e.g., the status of the ADS's core components, speed, or\nacceleration) and the external states of the surrounding factors in the\nsimulation environment (e.g., weather, traffic flow, or road condition).\nAVASTRA trains the RL agent to effectively configure the simulation environment\nthat places the AV in dangerous situations and potentially leads it to\ncollisions. We introduce a diverse set of actions that allows the RL agent to\nsystematically configure both environmental conditions and traffic\nparticipants. Additionally, based on established safety requirements, we\nenforce heuristic constraints to ensure the realism and relevance of the\ngenerated test scenarios. AVASTRA is evaluated on two popular simulation maps\nwith four different road configurations. Our results show AVASTRA's ability to\noutperform the state-of-the-art approach by generating 30% to 115% more\ncollision scenarios. Compared to the baseline based on Random Search, AVASTRA\nachieves up to 275% better performance. These results highlight the\neffectiveness of AVASTRA in enhancing the safety testing of AVs through\nrealistic comprehensive critical scenario generation.\n",
  "subjects": [
    "Computer Science/Robotics",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Software Engineering"
  ],
  "license": "http://creativecommons.org/publicdomain/zero/1.0/",
  "blobId": "-E4IMFWhqUgk7OvUp7cC4Vca01eMUesaHs7WL_B8ItI",
  "pdfSize": "1130652"
}