{"id":"2412.09582","title":"Neptune: The Long Orbit to Benchmarking Long Video Understanding","authors":"Arsha Nagrani, Mingda Zhang, Ramin Mehran, Rachel Hornung, Nitesh\n  Bharadwaj Gundavarapu, Nilpa Jha, Austin Myers, Xingyi Zhou, Boqing Gong,\n  Cordelia Schmid, Mikhail Sirotenko, Yukun Zhu, Tobias Weyand","authorsParsed":[["Nagrani","Arsha",""],["Zhang","Mingda",""],["Mehran","Ramin",""],["Hornung","Rachel",""],["Gundavarapu","Nitesh Bharadwaj",""],["Jha","Nilpa",""],["Myers","Austin",""],["Zhou","Xingyi",""],["Gong","Boqing",""],["Schmid","Cordelia",""],["Sirotenko","Mikhail",""],["Zhu","Yukun",""],["Weyand","Tobias",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 18:54:48 GMT"},{"version":"v2","created":"Sat, 18 Jan 2025 00:52:42 GMT"}],"updateDate":"2025-01-22","timestamp":1734029688000,"abstract":"  We introduce Neptune, a benchmark for long video understanding that requires\nreasoning over long time horizons and across different modalities. Many\nexisting video datasets and models are focused on short clips (10s-30s). While\nsome long video datasets do exist, they can often be solved by powerful image\nmodels applied per frame (and often to very few frames) in a video, and are\nusually manually annotated at high cost. In order to mitigate both these\nproblems, we propose a scalable dataset creation pipeline which leverages large\nmodels (VLMs and LLMs), to automatically generate dense, time-aligned video\ncaptions, as well as tough question answer decoy sets for video segments (up to\n15 minutes in length). Our dataset Neptune covers a broad range of long video\nreasoning abilities and consists of a subset that emphasizes multimodal\nreasoning. Since existing metrics for open-ended question answering are either\nrule-based or may rely on proprietary models, we provide a new open source\nmodel-based metric GEM to score open-ended responses on Neptune. Benchmark\nevaluations reveal that most current open-source long video models perform\npoorly on Neptune, particularly on questions testing temporal ordering,\ncounting and state changes. Through Neptune, we aim to spur the development of\nmore advanced models capable of understanding long videos. The dataset is\navailable at https://github.com/google-deepmind/neptune\n","subjects":["Computer Science/Machine Learning","Computer Science/Artificial Intelligence","Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ztez8_shJW7rQEqbGYGDN2rccwsJTkwTgCYuW_0F5JI","pdfSize":"8771610"}