{
  "id": "2412.05748",
  "title": "Constrained Control for Autonomous Spacecraft Rendezvous: Learning-Based\n  Time Shift Governor",
  "authors": "Taehyeun Kim, Robin Inho Kee, Ilya Kolmanovsky, Anouck Girard",
  "authorsParsed": [
    [
      "Kim",
      "Taehyeun",
      ""
    ],
    [
      "Kee",
      "Robin Inho",
      ""
    ],
    [
      "Kolmanovsky",
      "Ilya",
      ""
    ],
    [
      "Girard",
      "Anouck",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 7 Dec 2024 21:17:36 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733606256000,
  "abstract": "  This paper develops a Time Shift Governor (TSG)-based control scheme to\nenforce constraints during rendezvous and docking (RD) missions in the setting\nof the Two-Body problem. As an add-on scheme to the nominal closed-loop system,\nthe TSG generates a time-shifted Chief spacecraft trajectory as a target\nreference for the Deputy spacecraft. This modification of the commanded\nreference trajectory ensures that constraints are enforced while the time shift\nis reduced to zero to effect the rendezvous. Our approach to TSG implementation\nintegrates an LSTM neural network which approximates the time shift parameter\nas a function of a sequence of past Deputy and Chief spacecraft states. This\nLSTM neural network is trained offline from simulation data. We report\nsimulation results for RD missions in the Low Earth Orbit (LEO) and on the\nMolniya orbit to demonstrate the effectiveness of the proposed control scheme.\nThe proposed scheme reduces the time to compute the time shift parameter in\nmost of the scenarios and successfully completes rendezvous missions.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Systems and Control",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Machine Learning",
    "Computer Science/Robotics",
    "Computer Science/Systems and Control"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "r4Ay9qtzgJ0qMfWNEXacwFLNOGqQLkvdfbo5T1pqTE4",
  "pdfSize": "5036088"
}