{
  "id": "2412.01510",
  "title": "Minimal Submanifolds and Waists of Locally Symmetric Spaces",
  "authors": "Mikolaj Fraczyk and Ben Lowe",
  "authorsParsed": [
    [
      "Fraczyk",
      "Mikolaj",
      ""
    ],
    [
      "Lowe",
      "Ben",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 14:02:26 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733148146000,
  "abstract": "  We study the higher expansion properties of locally symmetric spaces, with a\nparticular focus on octonionic hyperbolic manifolds. We show that codimension\ntwo minimal submanifolds of compact octonionic locally symmetric spaces must\nhave large volume, at least linear in the volume of the ambient space. As a\ncorollary we prove linear waist inequalities for octonionic hyperbolic\nmanifolds in codimension two and construct the first locally symmetric examples\nof power-law systolic freedom. We also show that any codimension two\nsubmanifold of small volume can be homotoped to a lower dimensional set. We use\nthis to prove that branched covers of octonionic hyperbolic manifolds are\nstable in the sense of Dinur-Meshulam and to establish a uniform lower bound on\nthe non-abelian Cheeger constants of octonionic hyperbolic manifolds.\n  In a more general setting, we prove that maps from locally symmetric spaces\nto low dimensional euclidean spaces admit fibers whose fundamental group has\nlarge exponent of growth. We show as a consequence that cocompact lattices in\n$SL_n(\\mathbb{R})$ have property $ FA_{\\lfloor n/8\\rfloor-1}$: any action on a\ncontractible $CAT(0)$ simplicial complex of dimension at most $ \\lfloor\nn/8\\rfloor -1$ has a global fixed point.\n",
  "subjects": [
    "Mathematics/Differential Geometry",
    "Mathematics/Combinatorics",
    "Mathematics/Group Theory",
    "Mathematics/Geometric Topology"
  ],
  "license": "http://creativecommons.org/publicdomain/zero/1.0/",
  "blobId": "JbQKKcY6JVsrRt4WNAOCflpejxxBz9y-kUdQSzRg_C0",
  "pdfSize": "1932190"
}