{
  "id": "2412.03335",
  "title": "Specific heat at low temperatures in quasiplanar molecular crystals:\n  Where do glassy anomalies in minimally disordered crystals come from?",
  "authors": "Daria Szewczyk, Manuel Moratalla, Grzegorz Chajewski, Jonathan F.\n  Gebbia, Andrzej Je\\.zowski, Alexander I. Krivchikov, Mar\\'ia Barrio, Josep\n  Ll. Tamarit, and Miguel A. Ramos",
  "authorsParsed": [
    [
      "Szewczyk",
      "Daria",
      ""
    ],
    [
      "Moratalla",
      "Manuel",
      ""
    ],
    [
      "Chajewski",
      "Grzegorz",
      ""
    ],
    [
      "Gebbia",
      "Jonathan F.",
      ""
    ],
    [
      "Jeżowski",
      "Andrzej",
      ""
    ],
    [
      "Krivchikov",
      "Alexander I.",
      ""
    ],
    [
      "Barrio",
      "María",
      ""
    ],
    [
      "Tamarit",
      "Josep Ll.",
      ""
    ],
    [
      "Ramos",
      "Miguel A.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 14:09:13 GMT"
    }
  ],
  "updateDate": "2024-12-05",
  "timestamp": 1733321353000,
  "abstract": "  We present low-temperature specific heat (Cp) measurements of a monoclinic\nP2_{1}/c crystal formed by quasiplanar molecules of tetrachloro-m-xylene. The\ndynamic disorder frozen at low-temperature of the asymmetric unit (formed by a\nhalf molecule) consists of reorientation around a three-fold-like axis\nperpendicular to the benzene ring. Such a minimal disorder gives rise to\ntypical glassy anomalies, as a linear in contribution in Cp ascribed to\ntwo-level systems and a broad maximum around 6.6 K in Cp/T^3 (the boson peak).\nWe discuss these results in the framework of other quasiplanar molecular\ncrystals with different accountable number of in-plane molecular orientations\nWe find that the density of two-level systems does not correlate with the\ndegree of orientational disorder. Rather, it is the molecular asymmetry that\nseems to play a relevant role in the thermal anomalies. Furthermore, we discuss\nthe suggested correlation between the boson peak and Debye temperatures. We\nfind that a linear correlation between the boson peak and Debye temperatures\nholds for many -- but not all -- structural glasses and strikingly holds even\nbetter for some disordered crystals, including our studied quasiplanar\nmolecular crystals.\n",
  "subjects": [
    "Condensed Matter/Disordered Systems and Neural Networks",
    "Condensed Matter/Soft Condensed Matter"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "9uJyKeviaURNUH1Ja2iOHfiODf00hIvEb9BweqX3OnM",
  "pdfSize": "1779018"
}