{"id":"2412.14248","title":"Episodic super-Eddington accretion as a clue to Overmassive Black Holes\n  in the early Universe","authors":"Alessandro Trinca, Rosa Valiante, Raffaella Schneider, Ignas\n  Juod\\v{z}balis, Roberto Maiolino, Luca Graziani, Alessandro Lupi, Priyamvada\n  Natarajan, Marta Volonteri, Tommaso Zana","authorsParsed":[["Trinca","Alessandro",""],["Valiante","Rosa",""],["Schneider","Raffaella",""],["Juodžbalis","Ignas",""],["Maiolino","Roberto",""],["Graziani","Luca",""],["Lupi","Alessandro",""],["Natarajan","Priyamvada",""],["Volonteri","Marta",""],["Zana","Tommaso",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 19:00:02 GMT"}],"updateDate":"2024-12-20","timestamp":1734548402000,"abstract":"  Early JWST observations are providing growing evidence for a ubiquitous\npopulation of accreting supermassive black holes (BHs) at high redshift, many\nof which appear overmassive compared to the empirically-derived local scaling\nrelation between black hole mass and host galaxy stellar mass. In this study,\nwe leverage predictions from the semi-analytical Cosmic Archaeology Tool (CAT)\nto reconstruct the evolutionary pathways for this overmassive BH population,\ninvestigating how they assemble over cosmic time and interact with their host\ngalaxies. We find that the large $M_{\\rm BH}-M_{\\rm star}$ ratios can be\nexplained if light and heavy BH seeds grow by short, repeated episodes of\nsuper-Eddington accretion, triggered by major galaxy mergers. On average, we\nfind that BH-galaxy co-evolution starts in earnest only at $z < 8$, when\n$\\simeq 30\\%$ of the final galaxy stellar mass has formed outside the massive\nblack hole host. Our model suggests that super-Eddington bursts of accretion\nlast between $0.5-3$ Myr, resulting in a duty cycle of $1-4 \\%$ for the target\nBH sample. The boost in luminosity of BHs undergoing super-Eddington accretion\nhelps explaining the luminosity function of Active Galactic Nuclei observed by\nJWST. At the same time, a large population of these overmassive BHs are\npredicted to be inactive, with Eddington ratio $\\lambda_{\\rm Edd} < 0.05$, in\nagreement with recent observations.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"zxA_FHLl-eFHhNBoYwGnXcBG41KxfATQ2O2iga5zQ_o","pdfSize":"2129311"}