{
  "id": "2412.20918",
  "title": "Uncertainty-Aware Out-of-Distribution Detection with Gaussian Processes",
  "authors": "Yang Chen, Chih-Li Sung, Arpan Kusari, Xiaoyang Song and Wenbo Sun",
  "authorsParsed": [
    [
      "Chen",
      "Yang",
      ""
    ],
    [
      "Sung",
      "Chih-Li",
      ""
    ],
    [
      "Kusari",
      "Arpan",
      ""
    ],
    [
      "Song",
      "Xiaoyang",
      ""
    ],
    [
      "Sun",
      "Wenbo",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 30 Dec 2024 12:57:31 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735563451000,
  "abstract": "  Deep neural networks (DNNs) are often constructed under the closed-world\nassumption, which may fail to generalize to the out-of-distribution (OOD) data.\nThis leads to DNNs producing overconfident wrong predictions and can result in\ndisastrous consequences in safety-critical applications. Existing OOD detection\nmethods mainly rely on curating a set of OOD data for model training or\nhyper-parameter tuning to distinguish OOD data from training data (also known\nas in-distribution data or InD data). However, OOD samples are not always\navailable during the training phase in real-world applications, hindering the\nOOD detection accuracy. To overcome this limitation, we propose a\nGaussian-process-based OOD detection method to establish a decision boundary\nbased on InD data only. The basic idea is to perform uncertainty quantification\nof the unconstrained softmax scores of a DNN via a multi-class Gaussian process\n(GP), and then define a score function to separate InD and potential OOD data\nbased on their fundamental differences in the posterior predictive distribution\nfrom the GP. Two case studies on conventional image classification datasets and\nreal-world image datasets are conducted to demonstrate that the proposed method\noutperforms the state-of-the-art OOD detection methods when OOD samples are not\nobserved in the training phase.\n",
  "subjects": [
    "Statistics/Machine Learning",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "zk4xApZlqWYs8a96GMHa-HcZ9-oupKfXDnNoyz_qqTg",
  "pdfSize": "927350"
}