{"id":"2412.10442","title":"Steganography in Game Actions","authors":"Ching-Chun Chang and Isao Echizen","authorsParsed":[["Chang","Ching-Chun",""],["Echizen","Isao",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 12:02:36 GMT"}],"updateDate":"2024-12-17","timestamp":1733918556000,"abstract":"  The problem of subliminal communication has been addressed in various forms\nof steganography, primarily relying on visual, auditory and linguistic media.\nHowever, the field faces a fundamental paradox: as the art of concealment\nadvances, so too does the science of revelation, leading to an ongoing\nevolutionary interplay. This study seeks to extend the boundaries of what is\nconsidered a viable steganographic medium. We explore a steganographic\nparadigm, where hidden information is communicated through the episodes of\nmultiple agents interacting with an environment. Each agent, acting as an\nencoder, learns a policy to disguise the very existence of hidden messages\nwithin actions seemingly directed toward innocent objectives. Meanwhile, an\nobserver, serving as a decoder, learns to associate behavioural patterns with\ntheir respective agents despite their dynamic nature, thereby unveiling the\nhidden messages. The interactions of agents are governed by the framework of\nmulti-agent reinforcement learning and shaped by feedback from the observer.\nThis framework encapsulates a game-theoretic dilemma, wherein agents face\ndecisions between cooperating to create distinguishable behavioural patterns or\ndefecting to pursue individually optimal yet potentially overlapping episodic\nactions. As a proof of concept, we exemplify action steganography through the\ngame of labyrinth, a navigation task where subliminal communication is\nconcealed within the act of steering toward a destination. The stego-system has\nbeen systematically validated through experimental evaluations, assessing its\ndistortion and capacity alongside its secrecy and robustness when subjected to\nsimulated passive and active adversaries.\n","subjects":["Computer Science/Artificial Intelligence","Computer Science/Cryptography and Security","Computer Science/Multimedia"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0quIRpZ-JldFr3ZQKujB5GxMGvv_M0G-veTjObMufVw","pdfSize":"3336267"}