{"id":"2412.19815","title":"Enhancing Drug-Target Interaction Prediction through Transfer Learning\n  from Activity Cliff Prediction Tasks","authors":"Regina Ibragimova, Dimitrios Iliadis, Willem Waegeman","authorsParsed":[["Ibragimova","Regina",""],["Iliadis","Dimitrios",""],["Waegeman","Willem",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 18:56:11 GMT"}],"updateDate":"2024-12-31","timestamp":1733943371000,"abstract":"  Recently, machine learning (ML) has gained popularity in the early stages of\ndrug discovery. This trend is unsurprising given the increasing volume of\nrelevant experimental data and the continuous improvement of ML algorithms.\nHowever, conventional models, which rely on the principle of molecular\nsimilarity, often fail to capture the complexities of chemical interactions,\nparticularly those involving activity cliffs (ACs) - compounds that are\nstructurally similar but exhibit evidently different activity behaviors. In\nthis work, we address two distinct yet related tasks: (1) activity cliff (AC)\nprediction and (2) drug-target interaction (DTI) prediction. Leveraging\ninsights gained from the AC prediction task, we aim to improve the performance\nof DTI prediction through transfer learning. A universal model was developed\nfor AC prediction, capable of identifying activity cliffs across diverse\ntargets. Insights from this model were then incorporated into DTI prediction,\nenabling better handling of challenging cases involving ACs while maintaining\nsimilar overall performance. This approach establishes a strong foundation for\nintegrating AC awareness into predictive models for drug discovery. Scientific\nContribution This study presents a novel approach that applies transfer\nlearning from AC prediction to enhance DTI prediction, addressing limitations\nof traditional similarity-based models. By introducing AC-awareness, we improve\nDTI model performance in structurally complex regions, demonstrating the\nbenefits of integrating compound-specific and protein-contextual information.\nUnlike previous studies, which treat AC and DTI predictions as separate\nproblems, this work establishes a unified framework to address both data\nscarcity and prediction challenges in drug discovery.\n","subjects":["Quantitative Biology/Biomolecules","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"24AS3rhYKwxuj6CJJcZQfLGfGYRieyCOOZsBwlYI4AM","pdfSize":"1789884"}