{"id":"2412.18638","title":"Luminescent Trityl-based Diradicaloids: A Theoretical and Experimental\n  Assessment of Charge-Resonance in Low-Lying Excited States","authors":"Davide Mesto, Michele Orza, Brunella Bardi, Angela Punzi, Imma Ratera,\n  Jaume Veciana, Gianluca Farinola, Anna Painelli, Francesca Terenziani, Davide\n  Blasi, Fabrizia Negri","authorsParsed":[["Mesto","Davide",""],["Orza","Michele",""],["Bardi","Brunella",""],["Punzi","Angela",""],["Ratera","Imma",""],["Veciana","Jaume",""],["Farinola","Gianluca",""],["Painelli","Anna",""],["Terenziani","Francesca",""],["Blasi","Davide",""],["Negri","Fabrizia",""]],"versions":[{"version":"v1","created":"Mon, 23 Dec 2024 18:30:53 GMT"},{"version":"v2","created":"Sat, 4 Jan 2025 21:49:27 GMT"}],"updateDate":"2025-01-07","timestamp":1734978653000,"abstract":"  The tris(2,4,6-trichlorophenyl)methyl radical (TTM) has inspired the\nsynthesis of several luminescent diradicals and diradicaloids, providing an\nextraordinary opportunity to control the nature of the low-lying excited states\nby fine-tuning the diradical character. However, the photophysical properties\nof TTM-derived diradicals remain not fully understood yet. Here we present a\ncombined theoretical and experimental investigation on TTM-derived diradicals\nto elucidate the origin of their luminescence. The theoretical analysis focuses\non a series of symmetric TTM-derived diradicals with singlet ground state,\nfeaturing radical moieties linked by pi-conjugated spacers of different length.\nThe nature of the lowest excited electronic states that control their\nphotophysical behaviour is discussed in detail. The study is complemented by a\ncomplete spectroscopic characterization of the TTM-TTM diradical, synthesized\nusing a novel, simpler and more efficient procedure exploiting the unique\nreactivity of TTM. The lowest excited states of the diradicals differ\nqualitatively from those of TTM: two novel low-lying states emerge in the\ndiradical, due to charge resonance (CR) between the two radical units. The\nlowest CR state is a dark state for symmetric diradicals. The CR nature\nexplains the blue-shifted emission observed by increasing the distance between\nthe radical centres as seen in TTM-ph-TTM. This insight suggests different\ndesign strategies to improve the luminescence properties of TTM-derived\ndiradicals\n","subjects":["Physics/Chemical Physics","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"6KwCoZyeBk2l7IcjSI-ov6yy4qDPRmDr93rfRNhfcp4","pdfSize":"1047187"}