{"id":"2412.18172","title":"Entropy-driven electron density and effective model Hamiltonian for\n  boron systems","authors":"Chang-Chun He, Shao-Gang Xu, Yu-Jun Zhao, Hu Xu, and Xiao-Bao Yang","authorsParsed":[["He","Chang-Chun",""],["Xu","Shao-Gang",""],["Zhao","Yu-Jun",""],["Xu","Hu",""],["Yang","Xiao-Bao",""]],"versions":[{"version":"v1","created":"Tue, 24 Dec 2024 05:13:41 GMT"}],"updateDate":"2025-02-11","timestamp":1735017221000,"abstract":"  The unique electron deficiency of boron makes it challenging to determine the\nstable structures, leading to a wide variety of forms. In this work, we\nintroduce a statistical model based on grand canonical ensemble theory that\nincorporates the octet rule to determine electron density in boron systems.\nThis parameter-free model, referred to as the bonding free energy (BFE) model,\naligns well with first-principles calculations and accurately predicts total\nenergies. For borane clusters, the model successfully predicts isomer energies,\nhydrogen diffusion pathways, and optimal charge quantity for closo-boranes. In\nall-boron clusters, the absence of B-H bond constraints enables increased\nelectron delocalization and flexibility. The BFE model systematically explains\nthe geometric structures and chemical bonding in boron clusters, revealing\nvariations in electron density that clarify their structural diversity. For\nborophene, the BFE model predicts that hexagonal vacancy distributions are\ninfluenced by bonding entropy, with uniform electron density enhancing\nstability. Notably, our model predicts borophenes with a vacancy concentration\nof 1 6 to exhibit increased stability with long-range periodicity. Therefore,\nthe BFE model serves as a practical criterion for structure prediction,\nproviding essential insights into the stability and physical properties of\nboron-based systems.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"a0S5etbrpG4hME9hF15b1jPgtcbq6RTziLwl2WSnmoo","pdfSize":"13533773"}