{
  "id": "2412.15440",
  "title": "Neural network biased corrections: Cautionary study in background\n  corrections for quenched jets",
  "authors": "David Stewart and Joern Putschke",
  "authorsParsed": [
    [
      "Stewart",
      "David",
      ""
    ],
    [
      "Putschke",
      "Joern",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 22:42:43 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 14 Jan 2025 04:39:06 GMT"
    }
  ],
  "updateDate": "2025-01-15",
  "timestamp": 1734648163000,
  "abstract": "  Jets clustered from heavy ion collision measurements combine a dense\nbackground of particles with those actually resulting from a hard partonic\nscattering. The background contribution to jet transverse momentum ($p_{T}$)\nmay be corrected by subtracting the collision average background; however, the\nbackground inhomogeneity limits the resolution of this correction. Many recent\nstudies have embedded jets into heavy ion backgrounds and demonstrated a\nmarkedly improved background correction is achievable by using neural networks\n(NNs) trained with aspects of jet substructure which are used to map measured\njet $p_\\mathrm{T}$ to the embedded truth jet $p_\\mathrm{T}$. However, jet\nquenching in heavy ion collisions modifies jet substructure, and\ncorrespondingly biases the NNs' background corrections. This study investigates\nthose biases by using simulations of jet quenching in central Au+Au collisions\nat $\\sqrt{s_\\mathrm{NN}}=200\\;\\mathrm{GeV}/c$ with hydrodynamically modeled\nquark-gluon plasma (QGP) evolution. To demonstrate the magnitude of the effect\nof such biases in measurement, a leading jet nuclear modification factor\n($R_\\mathrm{AA}$) is calculated and reported using the NN background correction\non jets quenched utilizing a brick of QGP.\n",
  "subjects": [
    "Physics/Data Analysis, Statistics and Probability",
    "Physics/High Energy Physics - Experiment",
    "Physics/Nuclear Experiment"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "SqfNTJGsoV7TusGasQCI6X3LRlxQeH3w3WCsxzp0ynE",
  "pdfSize": "1555186"
}