{
  "id": "2412.16319",
  "title": "Active matter as the underpinning agency for extraordinary sensitivity\n  of biological membranes to electric fields",
  "authors": "Anand Mathew and Yashashree Kulkarni",
  "authorsParsed": [
    [
      "Mathew",
      "Anand",
      ""
    ],
    [
      "Kulkarni",
      "Yashashree",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 20:07:53 GMT"
    },
    {
      "version": "v2",
      "created": "Thu, 2 Jan 2025 02:32:49 GMT"
    }
  ],
  "updateDate": "2025-01-03",
  "timestamp": 1734725273000,
  "abstract": "  Interaction of electric fields with biological cells is indispensable for\nmany physiological processes. Thermal electrical noise in the cellular\nenvironment has long been considered as the minimum threshold for detection of\nelectrical signals by cells. However, there is compelling experimental evidence\nthat the minimum electric field sensed by certain cells and organisms is many\norders of magnitude weaker than the thermal electrical noise limit estimated\npurely under equilibrium considerations. We resolve this discrepancy by\nproposing a non-equilibrium statistical mechanics model for active\nelectromechanical membranes and hypothesize the role of activity in modulating\nthe minimum electrical field that can be detected by a biological membrane.\nActive membranes contain proteins that use external energy sources to carry out\nspecific functions and drive the membrane away from equilibrium. The central\nidea behind our model is that active mechanisms, attributed to different\nsources, endow the membrane with the ability to sense and respond to electric\nfields that are deemed undetectable based on equilibrium statistical mechanics.\nOur model for active membranes is capable of reproducing different experimental\ndata available in the literature by varying the activity. Elucidating how\nactive matter can modulate the sensitivity of cells to electric signals can\nopen avenues for a deeper understanding of physiological and pathological\nprocesses.\n",
  "subjects": [
    "Condensed Matter/Soft Condensed Matter",
    "Physics/Biological Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "TC31cafuFoZwVPibXeaUgOpMR1c3sCz0uecQjXcDWT4",
  "pdfSize": "1569873"
}