{"id":"2412.08638","title":"An Improved Precision Calculation of the $0\\nu\\beta\\beta$ Contact Term\n  within Chiral Effective Field Theory","authors":"Graham Van Goffrier","authorsParsed":[["Van Goffrier","Graham",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 18:58:41 GMT"},{"version":"v2","created":"Tue, 7 Jan 2025 20:05:27 GMT"}],"updateDate":"2025-01-09","timestamp":1733943521000,"abstract":"  Neutrinoless double-beta ($0\\nu\\beta\\beta$) decay is an as-yet unobserved\nnuclear process, which stands to provide crucial insights for model-building\nbeyond the Standard Model of particle physics. Its detection would\nsimultaneously confirm the hypothesis that neutrinos are Majorana fermions,\nthus violating lepton-number conservation, and provide the first measurement of\nthe absolute neutrino mass scale. This work aims to improve the estimation\nwithin chiral effective field theory of the so-called ''contact term'' for\n$0\\nu\\beta\\beta$-decay, a short-range two-nucleon effect which is unaccounted\nfor in traditional nuclear approaches to the process. We conduct a thorough\nreview of the justifications for this contact term and the most precise\ncomputation of its size to date ($g_\\nu^{NN}$ = 1.3(6) at renormalisation point\n$\\mu=m_\\pi$), whose precision is limited by a truncation to elastic\nintermediate hadronic states. We then perform an extension of this analysis to\na subleading class of inelastic intermediate states which we characterise,\ndelivering an updated figure for the contact coefficient ($g_\\nu^{NN}$ = 1.4(3)\nat $\\mu=m_\\pi$) with uncertainty reduced by half. Such ab initio nuclear\nresults, especially with enhanced precision, show promise for the resolution of\ndisagreements between estimates of $0\\nu\\beta\\beta$ from different many-body\nmethods.\n","subjects":["Physics/High Energy Physics - Phenomenology","Physics/Nuclear Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"J9kiiLhqowl_ZUllwnqOnT91RJu670jebMT97Kcr9L0","pdfSize":"2992277"}