{"id":"2412.13256","title":"Generalized Clausius inequalities and entanglement production in\n  holographic two-dimensional CFTs","authors":"Tanay Kibe, Ayan Mukhopadhyay and Pratik Roy","authorsParsed":[["Kibe","Tanay",""],["Mukhopadhyay","Ayan",""],["Roy","Pratik",""]],"versions":[{"version":"v1","created":"Tue, 17 Dec 2024 19:00:02 GMT"}],"updateDate":"2024-12-19","timestamp":1734462002000,"abstract":"  Utilizing quantum information theory, it has been shown that irreversible\nentropy production is bounded from both below and above in physical processes.\nBoth these bounds are positive and generalize the Clausius inequality. Such\nbounds are, however, obtained from distance measures in the space of states,\nwhich are hard to define and compute in quantum field theories. We show that\nthe quantum null energy condition (QNEC) can be utilized to obtain both lower\nand upper bounds on irreversible entropy production for quenches leading to\ntransitions between thermal states carrying uniform momentum density in two\ndimensional holographic conformal field theories. We achieve this by refining\nearlier methods and developing an algebraic procedure for determining HRT\nsurfaces in arbitrary Ba\\~nados-Vaidya geometries which are dual to quenches\ninvolving transitions between general quantum equilibrium states (e.g. thermal\nstates) where the QNEC is saturated. We also discuss results for the growth and\nthermalization of entanglement entropy for arbitrary initial and final\ntemperatures and momentum densities. The rate of quadratic growth of\nentanglement just after the quench depends only on the change in the energy\ndensity and is independent of the entangling length. For sufficiently large\nentangling lengths, the entanglement tsunami phenomenon can be established.\nFinally, we study recovery of the initial state from the evolving entanglement\nentropy and argue that the Renyi entropies should give us a refined\nunderstanding of scrambling of quantum information.\n","subjects":["Physics/High Energy Physics - Theory","Physics/General Relativity and Quantum Cosmology","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"lZ_JvoglAC9FzRqQ1zKH_RC3puA17W-ww1GomIi1aZc","pdfSize":"1360522"}