{
  "id": "2412.08698",
  "title": "The complete non-perturbative partition function of minimal superstring\n  theory and JT supergravity",
  "authors": "Dan Stefan Eniceicu, Chitraang Murdia, Andrii Torchylo",
  "authorsParsed": [
    [
      "Eniceicu",
      "Dan Stefan",
      ""
    ],
    [
      "Murdia",
      "Chitraang",
      ""
    ],
    [
      "Torchylo",
      "Andrii",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 19:00:00 GMT"
    },
    {
      "version": "v2",
      "created": "Wed, 15 Jan 2025 16:40:59 GMT"
    }
  ],
  "updateDate": "2025-01-16",
  "timestamp": 1733943600000,
  "abstract": "  We derive an exact convergent expression for the partition function of the\n$\\mathcal{N}=1$ $(2,4k)$ minimal superstring theory with type 0B GSO projection\nin the ungapped phase by leveraging the duality between this theory and a\ndouble-scaled unitary matrix integral. Taking the $k\\rightarrow\\infty$ limit,\nwe also obtain the complete partition function of $\\mathcal{N}=1$ JT\nsupergravity, including all contributions associated with \"doubly\nnon-perturbative\" effects. We discover that the fundamental objects of the\nstring theory are a linear combination of the standard FZZT branes which we\ncall F-branes, along with their charge-conjugate partners which we call\nanti-F-branes. Summing over the disk and cylinder diagram contributions of the\nF-branes and anti-F-branes and integrating over their moduli space completely\nreproduces our expression for the partition function from the matrix integral\nside of the duality. We show that the string theory can be expressed precisely\nin the formalism of dressed free fermions and we propose a Hilbert space\ninterpretation of our results. We present exact expressions for the matrix\nintegral correlators of the double-scaled eigenvalue density.\n",
  "subjects": [
    "Physics/High Energy Physics - Theory",
    "Physics/Mathematical Physics",
    "Mathematics/Mathematical Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "kGKpCj9OQpKENv4QvDpMw8NJLunCok-5JfHrOlkHoiw",
  "pdfSize": "973891"
}