{"id":"2412.03097","title":"Enhancing Recommendation Systems with GNNs and Addressing Over-Smoothing","authors":"Wenyi Liu, Ziqi Zhang, Xinshi Li, Jiacheng Hu, Yuanshuai Luo, Junliang\n  Du","authorsParsed":[["Liu","Wenyi",""],["Zhang","Ziqi",""],["Li","Xinshi",""],["Hu","Jiacheng",""],["Luo","Yuanshuai",""],["Du","Junliang",""]],"versions":[{"version":"v1","created":"Wed, 4 Dec 2024 07:50:27 GMT"}],"updateDate":"2024-12-05","timestamp":1733298627000,"abstract":"  This paper addresses key challenges in enhancing recommendation systems by\nleveraging Graph Neural Networks (GNNs) and addressing inherent limitations\nsuch as over-smoothing, which reduces model effectiveness as network hierarchy\ndeepens. The proposed approach introduces three GNN-based recommendation\nmodels, specifically designed to mitigate over-smoothing through innovative\nmechanisms like residual connections and identity mapping within the\naggregation propagation process. These modifications enable more effective\ninformation flow across layers, preserving essential user-item interaction\ndetails to improve recommendation accuracy. Additionally, the study emphasizes\nthe critical need for interpretability in recommendation systems, aiming to\nprovide transparent and justifiable suggestions tailored to dynamic user\npreferences. By integrating collaborative filtering with GNN architectures, the\nproposed models not only enhance predictive accuracy but also align\nrecommendations more closely with individual behaviors, adapting to nuanced\nshifts in user interests. This work advances the field by tackling both\ntechnical and user-centric challenges, contributing to the development of\nrobust and explainable recommendation systems capable of managing the\ncomplexity and scale of modern online environments.\n","subjects":["Computer Science/Information Retrieval","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"5IvJU1ryhDDLgWFugGxCHf-5BeN02iueXJEzZWvxSAc","pdfSize":"908579"}