{"id":"2412.07951","title":"From Lived Experience to Insight: Unpacking the Psychological Risks of\n  Using AI Conversational Agents","authors":"Mohit Chandra, Suchismita Naik, Denae Ford, Ebele Okoli, Munmun De\n  Choudhury, Mahsa Ershadi, Gonzalo Ramos, Javier Hernandez, Ananya\n  Bhattacharjee, Shahed Warreth, Jina Suh","authorsParsed":[["Chandra","Mohit",""],["Naik","Suchismita",""],["Ford","Denae",""],["Okoli","Ebele",""],["De Choudhury","Munmun",""],["Ershadi","Mahsa",""],["Ramos","Gonzalo",""],["Hernandez","Javier",""],["Bhattacharjee","Ananya",""],["Warreth","Shahed",""],["Suh","Jina",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 22:31:29 GMT"},{"version":"v2","created":"Thu, 12 Dec 2024 13:19:29 GMT"}],"updateDate":"2024-12-13","timestamp":1733869889000,"abstract":"  Recent gain in popularity of AI conversational agents has led to their\nincreased use for improving productivity and supporting well-being. While\nprevious research has aimed to understand the risks associated with\ninteractions with AI conversational agents, these studies often fall short in\ncapturing the lived experiences. Additionally, psychological risks have often\nbeen presented as a sub-category within broader AI-related risks in past\ntaxonomy works, leading to under-representation of the impact of psychological\nrisks of AI use. To address these challenges, our work presents a novel risk\ntaxonomy focusing on psychological risks of using AI gathered through lived\nexperience of individuals. We employed a mixed-method approach, involving a\ncomprehensive survey with 283 individuals with lived mental health experience\nand workshops involving lived experience experts to develop a psychological\nrisk taxonomy. Our taxonomy features 19 AI behaviors, 21 negative psychological\nimpacts, and 15 contexts related to individuals. Additionally, we propose a\nnovel multi-path vignette based framework for understanding the complex\ninterplay between AI behaviors, psychological impacts, and individual user\ncontexts. Finally, based on the feedback obtained from the workshop sessions,\nwe present design recommendations for developing safer and more robust AI\nagents. Our work offers an in-depth understanding of the psychological risks\nassociated with AI conversational agents and provides actionable\nrecommendations for policymakers, researchers, and developers.\n","subjects":["Computer Science/Human-Computer Interaction","Computer Science/Artificial Intelligence","Computer Science/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"AtCQtFulHyiSPxXl_xStkQR2c4wI5SV1_ssxQ9Fi1Qg","pdfSize":"1635633"}