{
  "id": "2412.13397",
  "title": "Strings from Feynman Diagrams",
  "authors": "Rajesh Gopakumar, Rishabh Kaushik, Shota Komatsu, Edward A. Mazenc and\n  Debmalya Sarkar",
  "authorsParsed": [
    [
      "Gopakumar",
      "Rajesh",
      ""
    ],
    [
      "Kaushik",
      "Rishabh",
      ""
    ],
    [
      "Komatsu",
      "Shota",
      ""
    ],
    [
      "Mazenc",
      "Edward A.",
      ""
    ],
    [
      "Sarkar",
      "Debmalya",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 00:22:50 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734481370000,
  "abstract": "  For correlators in $\\mathcal{N}=4$ Super Yang-Mills preserving half the\nsupersymmetry, we manifestly recast the gauge theory Feynman diagram expansion\nas a sum over dual closed strings. Each individual Feynman diagram maps on to a\nRiemann surface with specific moduli. The Feynman diagrams thus correspond to\ndiscrete lattice points on string moduli space, rather than discretized\nworldsheets. This picture is valid to all orders in the $1/N$ expansion.\nConcretely, the mapping is carried out at the level of a two-matrix integral\nwith its dual string description. It provides a microscopic picture of\nopen/closed string duality for this topological subsector of the full AdS/CFT\ncorrespondence. At the same time, the concrete mechanism for how strings emerge\nfrom the matrix model Feynman diagrams predicts that multiple open string\ndescriptions can exist for the same dual closed string theory. By considering\nthe insertion of determinant operators in $\\mathcal{N}=4$ SYM, we indeed find\nsix equivalent open-string descriptions. Each of them generates Feynman\ndiagrams related to one another via (partial) graph duality, and hence encodes\nthe same information. The embedding of these Kontsevich-like duals into the 1/2\nSUSY sector of AdS/CFT is achieved by open strings on giant graviton branes.\n",
  "subjects": [
    "Physics/High Energy Physics - Theory",
    "Physics/Mathematical Physics",
    "Mathematics/Mathematical Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "mnAawrcfyKCDbwj8X2O84ocQ1CaKhr9hcLIbzzkA5KY",
  "pdfSize": "2410091"
}