{
  "id": "2412.17486",
  "title": "Is ChatGPT Massively Used by Students Nowadays? A Survey on the Use of\n  Large Language Models such as ChatGPT in Educational Settings",
  "authors": "J\\'er\\'emie Sublime and Ilaria Renna",
  "authorsParsed": [
    [
      "Sublime",
      "Jérémie",
      ""
    ],
    [
      "Renna",
      "Ilaria",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 11:29:44 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734953384000,
  "abstract": "  The rapid adoption of Generative AI (GenAI) based on Large Language Models\n(LLMs) such as ChatGPT has recently and profoundly impacted education, offering\ntransformative opportunities while raising significant concerns. In this study\nwe present the results of a survey that investigates how 395 students aged 13\nto 25 years old in France and Italy integrate LLMs into their educational\nroutines.\n  Key findings include the widespread use of these tools across all age groups\nand disciplines, with older students and male students demonstrating higher\nusage frequencies, particularly in scientific contexts. The results also show\ngender disparities, raising concerns about an emerging AI literacy and\ntechnological gender gap. Additionally, while most students utilise LLMs\nconstructively, the lack of systematic proofreading and critical evaluation\namong younger users suggests potential risks to cognitive skills development,\nincluding critical thinking and foundational knowledge. The survey results\nunderscore the need for educational institutions to adapt their curricula to\nintegrate AI tools effectively, promoting ethical use, critical thinking, and\nawareness of AI limitations and environmental costs. This paper provides\nactionable recommendations for fostering equitable and effective cohabitation\nof LLMs and education while addressing emerging challenges.\n",
  "subjects": [
    "Computer Science/Computers and Society",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "zsK0QH4Py9APA3Vn9eTgzKo3itfRmcGA9T4PG3SMhWk",
  "pdfSize": "828483"
}