{"id":"2412.14205","title":"Large-scale Group Brainstorming using Conversational Swarm Intelligence\n  (CSI) versus Traditional Chat","authors":"Louis Rosenberg, Hans Schumann, Christopher Dishop, Gregg Willcox,\n  Anita Woolley, Ganesh Mani","authorsParsed":[["Rosenberg","Louis",""],["Schumann","Hans",""],["Dishop","Christopher",""],["Willcox","Gregg",""],["Woolley","Anita",""],["Mani","Ganesh",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 22:11:25 GMT"}],"updateDate":"2025-02-12","timestamp":1734387085000,"abstract":"  Conversational Swarm Intelligence (CSI) is an AI-facilitated method for\nenabling real-time conversational deliberations and prioritizations among\nnetworked human groups of potentially unlimited size. Based on the biological\nprinciple of Swarm Intelligence and modelled on the decision-making dynamics of\nfish schools, CSI has been shown in prior studies to amplify group\nintelligence, increase group participation, and facilitate productive\ncollaboration among hundreds of participants at once. It works by dividing a\nlarge population into a set of small subgroups that are woven together by\nreal-time AI agents called Conversational Surrogates. The present study focuses\non the use of a CSI platform called Thinkscape to enable real-time\nbrainstorming and prioritization among groups of 75 networked users. The study\nemployed a variant of a common brainstorming intervention called an Alternative\nUse Task (AUT) and was designed to compare through subjective feedback, the\nexperience of participants brainstorming using a CSI structure vs brainstorming\nin a single large chat room. This comparison revealed that participants\nsignificantly preferred brainstorming with the CSI structure and reported that\nit felt (i) more collaborative, (ii) more productive, and (iii) was better at\nsurfacing quality answers. In addition, participants using the CSI structure\nreported (iv) feeling more ownership and more buy-in in the final answers the\ngroup converged on and (v) reported feeling more heard as compared to\nbrainstorming in a traditional text chat environment. Overall, the results\nsuggest that CSI is a very promising AI-facilitated method for brainstorming\nand prioritization among large-scale, networked human groups.\n","subjects":["Computer Science/Human-Computer Interaction","Computer Science/Artificial Intelligence","Computer Science/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"0q0QeO1kPCOBGn9aNFv6V_2pTFY14SaSAwHjqOxu0KQ","pdfSize":"388007"}