{"id":"2412.18666","title":"Probing the Interaction Between Topological and Rashba-like Surface\n  States in MnBi$_2$Te$_4$ Through Sn Doping","authors":"A. V. Tarasov, D. A. Estyunin, A. G. Rybkin, A. S. Frolov, A. I.\n  Sergeev, A. V. Eryzhenkov, V. V. Anferova, T. P. Estyunina, D. A. Glazkova,\n  K. A. Kokh, V. A. Golyashov, O. E. Tereshchenko, S. Ideta, Y. Miyai, Y.\n  Kumar, K. Shimada, A. M. Shikin","authorsParsed":[["Tarasov","A. V.",""],["Estyunin","D. A.",""],["Rybkin","A. G.",""],["Frolov","A. S.",""],["Sergeev","A. I.",""],["Eryzhenkov","A. V.",""],["Anferova","V. V.",""],["Estyunina","T. P.",""],["Glazkova","D. A.",""],["Kokh","K. A.",""],["Golyashov","V. A.",""],["Tereshchenko","O. E.",""],["Ideta","S.",""],["Miyai","Y.",""],["Kumar","Y.",""],["Shimada","K.",""],["Shikin","A. M.",""]],"versions":[{"version":"v1","created":"Tue, 24 Dec 2024 19:43:35 GMT"}],"updateDate":"2024-12-30","timestamp":1735069415000,"abstract":"  The presence of Rashba-like surface states (RSS) in the electronic structure\nof topological insulators (TIs) has been a longstanding topic of interest due\nto their significant impact on electronic and spin structures. In this study,\nwe investigate the interaction between topological and Rashba-like surface\nstates (TSS and RSS) in Mn$_{1-x}$Sn$_x$Bi$_2$Te$_4$ systems using density\nfunctional theory (DFT) calculations and high-resolution ARPES. Our findings\nreveal that increasing Sn concentration shifts RSS downward in energy,\nenhancing their influence on the electronic structure near the Fermi level.\nARPES validates these predictions, capturing the evolution of RSS and their\nhybridization with TSS. Orbital analysis shows RSS are localized within the\nfirst three Te-Bi-Te trilayers, dominated by Bi $p$-orbitals, with evidence of\nthe orbital Rashba effect enhancing spin-momentum locking. At higher Sn\nconcentrations, RSS penetrate deeper into the crystal, driven by Sn $p$-orbital\ncontributions. These results position Mn$_{1-x}$Sn$_x$Bi$_2$Te$_4$ as a tunable\nplatform for tailoring electronic properties in spintronic and quantum\ntechnologies.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"B-j1LGitWwZTTC3INESSEPetR0IjXbV4TbYt4S-DtqQ","pdfSize":"19542449"}