{
  "id": "2412.10543",
  "title": "RAGServe: Fast Quality-Aware RAG Systems with Configuration Adaptation",
  "authors": "Siddhant Ray, Rui Pan, Zhuohan Gu, Kuntai Du, Ganesh Ananthanarayanan,\n  Ravi Netravali, Junchen Jiang",
  "authorsParsed": [
    [
      "Ray",
      "Siddhant",
      ""
    ],
    [
      "Pan",
      "Rui",
      ""
    ],
    [
      "Gu",
      "Zhuohan",
      ""
    ],
    [
      "Du",
      "Kuntai",
      ""
    ],
    [
      "Ananthanarayanan",
      "Ganesh",
      ""
    ],
    [
      "Netravali",
      "Ravi",
      ""
    ],
    [
      "Jiang",
      "Junchen",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 20:39:30 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734122370000,
  "abstract": "  RAG (Retrieval Augmented Generation) allows LLMs (large language models) to\ngenerate better responses with external knowledge, but using more external\nknowledge often improves generation quality at the expense of response delay.\nPrior work either reduces the response delay (through better scheduling of RAG\nqueries) or strives to maximize quality (which involves tuning the RAG\nworkflow), but they fall short in optimizing the tradeoff between the delay and\nquality of RAG responses. This paper presents RAGServe, the first RAG system\nthat jointly schedules queries and adapts the key RAG configurations of each\nquery, such as the number of retrieved text chunks and synthesis methods, in\norder to balance quality optimization and response delay reduction. Using 4\npopular RAG-QA datasets, we show that compared with the state-of-the-art RAG\noptimization schemes, RAGServe reduces the generation latency by\n$1.64-2.54\\times$ without sacrificing generation quality.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Computation and Language",
    "Computer Science/Information Retrieval"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "hfalfY_6yqqxVOntNRp8FyW48gYO1ZJzqO9jhIfgiQA",
  "pdfSize": "1203694"
}