{
  "id": "2412.00656",
  "title": "Two-Stage Adaptive Robust Optimization Model for Joint Unit Maintenance\n  and Unit Commitment Considering Source-Load Uncertainty",
  "authors": "Hongrui Lu, Yuxiong Huang, Tong He, Gengfeng Li",
  "authorsParsed": [
    [
      "Lu",
      "Hongrui",
      ""
    ],
    [
      "Huang",
      "Yuxiong",
      ""
    ],
    [
      "He",
      "Tong",
      ""
    ],
    [
      "Li",
      "Gengfeng",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 1 Dec 2024 03:27:10 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733023630000,
  "abstract": "  Unit maintenance and unit commitment are two critical and interrelated\naspects of electric power system operation, both of which face the challenge of\ncoordinating efforts to enhance reliability and economic performance. This\nchallenge becomes increasingly pronounced in the context of increased\nintegration of renewable energy and flexible loads, such as wind power and\nelectric vehicles, into the power system, where high uncertainty is prevalent.\nTo tackle this issue, this paper develops a two-stage adaptive robust\noptimization model for the joint unit maintenance and unit commitment strategy.\nThe first stage focuses on making joint decisions regarding unit maintenance\nand unit commitment, while the second stage addresses economic dispatch under\nthe worst-case scenarios of wind power and load demand. Then a practical\nsolution methodology is proposed to solve this model efficiently, which\ncombines the inexact column-and-constraint generation algorithm with an outer\napproximation method. Finally, the economic viability and adaptability of the\nproposed method is demonstrated based on the RTS-79 test system.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Systems and Control",
    "Computer Science/Systems and Control"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "MMS2d3gULRfZWqRGBL-_Daof5NhrubkWGQ_UGHldSCM",
  "pdfSize": "701926"
}