{
  "id": "2412.10236",
  "title": "Quantum transport theory for unconventional magnets; interplay of\n  altermagnetism and p-wave magnetism with superconductivity",
  "authors": "Tim Kokkeler, Ilya Tokatly, F. Sebastian Bergeret",
  "authorsParsed": [
    [
      "Kokkeler",
      "Tim",
      ""
    ],
    [
      "Tokatly",
      "Ilya",
      ""
    ],
    [
      "Bergeret",
      "F. Sebastian",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 16:08:18 GMT"
    },
    {
      "version": "v2",
      "created": "Wed, 29 Jan 2025 13:06:09 GMT"
    }
  ],
  "updateDate": "2025-01-30",
  "timestamp": 1734106098000,
  "abstract": "  We present a quantum transport theory for generic magnetic metals, in which\nmagnetism occurs predominantly due to exchange interactions, such as\nferromagnets, antiferromagnets, altermagnets and p-wave magnets. Our theory is\nvalid both for the normal and the superconducting state. We derive the\neffective low-energy action for each of these materials, where the spin space\ngroups are used to determine the form of the tensor coefficients appearing in\nthe action. The transport equations, which are obtained as the saddle point\nequations of this action, describe a wider range of phenomena than the usual\nquasiclassical equations. In ferromagnets, in addition to the usual exchange\nfield and spin relaxation effects, we identify a spin-dependent renormalization\nof the diffusion coefficient, which provides a description of spinpolarized\ncurrents in both the normal and superconducting equal spin-triplet states. In\nthe normal state, our equations provide a complete description of the\nspin-splitting effect in diffusive systems, recently predicted in ideal clean\naltermagnets. In the superconducting state, our equations predict a proximity\ninduced magnetization, the appearance of a spontaneous magnetic moment in\nhybrid superconductor-altermagnet systems. The distribution and polarization\ndirection of this magnetic moment depend on the symmetry of the structure, thus\nmeasurements of such polarization reveal the underlying microscopic symmetry of\nthe altermagnet. Finally, for inversionsymmetry broken antiferromagnets, such\nas the p-wave magnet, we show that spin-galvanic effects which are\ndistinguishable from the spin-galvanic effect induced by spin-orbit coupling\nonly in the superconducting state. Besides these examples, our model applies to\narbitrary magnetic systems, providing a complete theory for nonequilibrium\ntransport in diffusive nonconventional magnets at arbitrary temperatures.\n",
  "subjects": [
    "Condensed Matter/Superconductivity"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "kVyvmzj29-t8hCmjIssdV80nMgki5P_yo_HedsXuevI",
  "pdfSize": "975606"
}