{
  "id": "2412.08688",
  "title": "A Novel Technique for Long-term Timing of Redback Millisecond Pulsars",
  "authors": "Kyle A. Corcoran, Scott M. Ransom, Alexandra C. Rosenthal, Megan E.\n  DeCesar, Paulo C. C. Freire, Jason W. T. Hessels, Ryan S. Lynch, Prajwal V.\n  Padmanabh, Ingrid H. Stairs",
  "authorsParsed": [
    [
      "Corcoran",
      "Kyle A.",
      ""
    ],
    [
      "Ransom",
      "Scott M.",
      ""
    ],
    [
      "Rosenthal",
      "Alexandra C.",
      ""
    ],
    [
      "DeCesar",
      "Megan E.",
      ""
    ],
    [
      "Freire",
      "Paulo C. C.",
      ""
    ],
    [
      "Hessels",
      "Jason W. T.",
      ""
    ],
    [
      "Lynch",
      "Ryan S.",
      ""
    ],
    [
      "Padmanabh",
      "Prajwal V.",
      ""
    ],
    [
      "Stairs",
      "Ingrid H.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 19:00:00 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1733943600000,
  "abstract": "  We present timing solutions spanning nearly two decades for five redback (RB)\nsystems found in globular clusters (GC), created using a novel technique that\neffectively \"isolates\" the pulsar. By accurately measuring the time of passage\nthrough periastron ($T_0$) at points over the timing baseline, we use a\npiecewise-continuous, binary model to get local solutions of the orbital\nvariations that we pair with long-term orbital information to remove the\norbital timing delays. The isolated pulse times of arrival can then be fit to\ndescribe the spin behavior of the millisecond pulsar (MSP). The results of our\ntiming analyses via this method are consistent with those of conventional\ntiming methods for binaries in GCs as demonstrated by analyses of NGC 6440D. We\nalso investigate the observed orbital phase variations for these systems.\nQuasi-periodic oscillations in Terzan 5P's orbit may be the result of changes\nto the gravitational-quadruple moment of the companion as prescribed by the\nApplegate model. We find a striking correlation between the standard deviation\nof the phase variations as a fraction of a system's orbit ($\\sigma_{\\Delta\nT_0}$) and the MSP's spin frequency, as well as a potential correlation between\n$\\sigma_{\\Delta T_0}$ and the binary's projected semi-major axis. While\nlong-term RB timing is fraught with large systematics, our work provides a\nneeded alternative for studying systems with significant orbital variations,\nespecially when high-cadence monitoring observations are unavailable.\n",
  "subjects": [
    "Astrophysics/High Energy Astrophysical Phenomena",
    "Astrophysics/Solar and Stellar Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "T6-aqU3xLHrZfJHQNSmzAFbs7ng3RmVr6fb3pTXGyaw",
  "pdfSize": "4124952"
}