{
  "id": "2412.17081",
  "title": "Efficient Data Labeling and Optimal Device Scheduling in HWNs Using\n  Clustered Federated Semi-Supervised Learning",
  "authors": "Moqbel Hamood, Abdullatif Albaseer, Mohamed Abdallah, Ala Al-Fuqaha",
  "authorsParsed": [
    [
      "Hamood",
      "Moqbel",
      ""
    ],
    [
      "Albaseer",
      "Abdullatif",
      ""
    ],
    [
      "Abdallah",
      "Mohamed",
      ""
    ],
    [
      "Al-Fuqaha",
      "Ala",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 22 Dec 2024 16:13:00 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734883980000,
  "abstract": "  Clustered Federated Multi-task Learning (CFL) has emerged as a promising\ntechnique to address statistical challenges, particularly with non-independent\nand identically distributed (non-IID) data across users. However, existing CFL\nstudies entirely rely on the impractical assumption that devices possess access\nto accurate ground-truth labels. This assumption becomes problematic in\nhierarchical wireless networks (HWNs), with vast unlabeled data and dual-level\nmodel aggregation, slowing convergence speeds, extending processing times, and\nincreasing resource consumption. To this end, we propose Clustered Federated\nSemi-Supervised Learning (CFSL), a novel framework tailored for realistic\nscenarios in HWNs. We leverage specialized models from device clustering and\npresent two prediction model schemes: the best-performing specialized model and\nthe weighted-averaging ensemble model. The former assigns the most suitable\nspecialized model to label unlabeled data, while the latter unifies specialized\nmodels to capture broader data distributions. CFSL introduces two novel\nprediction time schemes, split-based and stopping-based, for accurate labeling\ntiming, and two device selection strategies, greedy and round-robin. Extensive\ntesting validates CFSL's superiority in labeling/testing accuracy and resource\nefficiency, achieving up to 51% energy savings.\n",
  "subjects": [
    "Computer Science/Distributed, Parallel, and Cluster Computing"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "gpGaID_ndz8FYl761x7k2j3L2bPDwOAZnfCcS7RE1f4",
  "pdfSize": "10546147"
}