{"id":"2412.17542","title":"Leveraging Cardiovascular Simulations for In-Vivo Prediction of Cardiac\n  Biomarkers","authors":"Laura Manduchi, Antoine Wehenkel, Jens Behrmann, Luca Pegolotti, Andy\n  C. Miller, Ozan Sener, Marco Cuturi, Guillermo Sapiro, J\\\"orn-Henrik Jacobsen","authorsParsed":[["Manduchi","Laura",""],["Wehenkel","Antoine",""],["Behrmann","Jens",""],["Pegolotti","Luca",""],["Miller","Andy C.",""],["Sener","Ozan",""],["Cuturi","Marco",""],["Sapiro","Guillermo",""],["Jacobsen","Jörn-Henrik",""]],"versions":[{"version":"v1","created":"Mon, 23 Dec 2024 13:05:17 GMT"}],"updateDate":"2024-12-24","timestamp":1734959117000,"abstract":"  Whole-body hemodynamics simulators, which model blood flow and pressure\nwaveforms as functions of physiological parameters, are now essential tools for\nstudying cardiovascular systems. However, solving the corresponding inverse\nproblem of mapping observations (e.g., arterial pressure waveforms at specific\nlocations in the arterial network) back to plausible physiological parameters\nremains challenging. Leveraging recent advances in simulation-based inference,\nwe cast this problem as statistical inference by training an amortized neural\nposterior estimator on a newly built large dataset of cardiac simulations that\nwe publicly release. To better align simulated data with real-world\nmeasurements, we incorporate stochastic elements modeling exogenous effects.\nThe proposed framework can further integrate in-vivo data sources to refine its\npredictive capabilities on real-world data. In silico, we demonstrate that the\nproposed framework enables finely quantifying uncertainty associated with\nindividual measurements, allowing trustworthy prediction of four biomarkers of\nclinical interest--namely Heart Rate, Cardiac Output, Systemic Vascular\nResistance, and Left Ventricular Ejection Time--from arterial pressure\nwaveforms and photoplethysmograms. Furthermore, we validate the framework in\nvivo, where our method accurately captures temporal trends in CO and SVR\nmonitoring on the VitalDB dataset. Finally, the predictive error made by the\nmodel monotonically increases with the predicted uncertainty, thereby directly\nsupporting the automatic rejection of unusable measurements.\n","subjects":["Computer Science/Machine Learning","Computer Science/Computational Engineering, Finance, and Science","Physics/Biological Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"4T2Lw9po7L-vTObsooOa6ZjUpyOEgmkAk62MG1Nc-5c","pdfSize":"7759179"}