{"id":"2412.02963","title":"Solar System Migration Points to a Renewed Concept: Galactic Habitable\n  Orbits","authors":"Junichi Baba (Kagosima U./NAOJ), Takuji Tsujimoto (NAOJ), Takayuki R.\n  Saitoh (Kobe U.)","authorsParsed":[["Baba","Junichi","","Kagosima U./NAOJ"],["Tsujimoto","Takuji","","NAOJ"],["Saitoh","Takayuki R.","","Kobe U."]],"versions":[{"version":"v1","created":"Wed, 4 Dec 2024 02:17:22 GMT"}],"updateDate":"2024-12-05","timestamp":1733278642000,"abstract":"  Astrophysical evidence suggests that the Sun was born near 5 kpc from the\nGalactic center, within the corotation radius of the Galactic bar, around 6-7\nkpc. This presents challenges for outward migration due to the Jacobi energy\nconstraint, preventing stars from easily overcoming the corotation barrier. In\nthis study, we use test particle simulations to explore two possible migration\npathways for the Sun: a \"trapped\" scenario, where the Sun's orbit was\ninfluenced by a slowing Galactic bar, and an \"untrapped\" scenario driven by\ndynamic spiral arms. Our results demonstrate that both mechanisms can explain\nhow the Sun migrated from its birth radius (approximately 5 kpc) to its current\norbital radius around 8.5-9 kpc. Furthermore, we investigate the environmental\nchanges experienced by the Sun along these migration pathways, focusing on\nvariations in radiation hazards and comet fluxes, which may have impacted\nplanetary habitability. These findings highlight the dynamic nature of galactic\nhabitability, emphasizing that the path a star takes within the Milky Way can\nsignificantly affect its surrounding environment and the potential for life. We\npropose a new concept of \"Galactic habitable orbits,\" which accounts for\nevolving galactic structures and their effects on stellar and planetary\nsystems. This work contributes to a deeper understanding of the solar system's\nmigration and its implications for habitability within the Milky Way.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"eZrYAY5QTiFFBujGlveY5BVOu_oS9pM7kLBXwCTyg2o","pdfSize":"1307354"}