{"id":"2412.00530","title":"Forma mentis networks predict creativity ratings of short texts via\n  interpretable artificial intelligence in human and GPT-simulated raters","authors":"Edith Haim, Natalie Fischer, Salvatore Citraro, Giulio Rossetti, and\n  Massimo Stella","authorsParsed":[["Haim","Edith",""],["Fischer","Natalie",""],["Citraro","Salvatore",""],["Rossetti","Giulio",""],["Stella","Massimo",""]],"versions":[{"version":"v1","created":"Sat, 30 Nov 2024 16:33:48 GMT"}],"updateDate":"2024-12-03","timestamp":1732984428000,"abstract":"  Creativity is a fundamental skill of human cognition. We use textual forma\nmentis networks (TFMN) to extract network (semantic/syntactic associations) and\nemotional features from approximately one thousand human- and GPT3.5-generated\nstories. Using Explainable Artificial Intelligence (XAI), we test whether\nfeatures relative to Mednick's associative theory of creativity can explain\ncreativity ratings assigned by humans and GPT-3.5. Using XGBoost, we examine\nthree scenarios: (i) human ratings of human stories, (ii) GPT-3.5 ratings of\nhuman stories, and (iii) GPT-3.5 ratings of GPT-generated stories. Our findings\nreveal that GPT-3.5 ratings differ significantly from human ratings not only in\nterms of correlations but also because of feature patterns identified with XAI\nmethods. GPT-3.5 favours 'its own' stories and rates human stories differently\nfrom humans. Feature importance analysis with SHAP scores shows that: (i)\nnetwork features are more predictive for human creativity ratings but also for\nGPT-3.5's ratings of human stories; (ii) emotional features played a greater\nrole than semantic/syntactic network structure in GPT-3.5 rating its own\nstories. These quantitative results underscore key limitations in GPT-3.5's\nability to align with human assessments of creativity. We emphasise the need\nfor caution when using GPT-3.5 to assess and generate creative content, as it\ndoes not yet capture the nuanced complexity that characterises human\ncreativity.\n","subjects":["Computer Science/Artificial Intelligence","Computer Science/Computation and Language","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"OkBRBtJmWL1HAzFIJrGp_DpVqU5-HUhbwg-a26YefQw","pdfSize":"1689781"}