{"id":"2412.14705","title":"Event-assisted 12-stop HDR Imaging of Dynamic Scene","authors":"Shi Guo, Zixuan Chen, Ziran Zhang, Yutian Chen, Gangwei Xu and Tianfan\n  Xue","authorsParsed":[["Guo","Shi",""],["Chen","Zixuan",""],["Zhang","Ziran",""],["Chen","Yutian",""],["Xu","Gangwei",""],["Xue","Tianfan",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 10:17:50 GMT"}],"updateDate":"2024-12-20","timestamp":1734603470000,"abstract":"  High dynamic range (HDR) imaging is a crucial task in computational\nphotography, which captures details across diverse lighting conditions.\nTraditional HDR fusion methods face limitations in dynamic scenes with extreme\nexposure differences, as aligning low dynamic range (LDR) frames becomes\nchallenging due to motion and brightness variation. In this work, we propose a\nnovel 12-stop HDR imaging approach for dynamic scenes, leveraging a dual-camera\nsystem with an event camera and an RGB camera. The event camera provides\ntemporally dense, high dynamic range signals that improve alignment between LDR\nframes with large exposure differences, reducing ghosting artifacts caused by\nmotion. Also, a real-world finetuning strategy is proposed to increase the\ngeneralization of alignment module on real-world events. Additionally, we\nintroduce a diffusion-based fusion module that incorporates image priors from\npre-trained diffusion models to address artifacts in high-contrast regions and\nminimize errors from the alignment process. To support this work, we developed\nthe ESHDR dataset, the first dataset for 12-stop HDR imaging with synchronized\nevent signals, and validated our approach on both simulated and real-world\ndata. Extensive experiments demonstrate that our method achieves\nstate-of-the-art performance, successfully extending HDR imaging to 12 stops in\ndynamic scenes.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"4ezcb7_IXpaRcr6tsBUJ4udVV42iM9JPtat4IzZzmk0","pdfSize":"13997006"}