{
  "id": "2412.03416",
  "title": "Transiting Jupiters around M-dwarfs have similar masses to FGK\n  warm-Jupiters",
  "authors": "Shubham Kanodia",
  "authorsParsed": [
    [
      "Kanodia",
      "Shubham",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 15:52:43 GMT"
    },
    {
      "version": "v2",
      "created": "Thu, 5 Dec 2024 14:51:47 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733327563000,
  "abstract": "  This paper presents a comparative analysis of the bulk properties (mass and\nradius) of transiting giant planets ($\\gtrsim$ 8$R_{\\oplus}$) orbiting FGKM\nstars. Our findings suggest that the average mass of M-dwarf Jupiters is lower\nthan that of their solar-type counterparts, primarily due to the scarcity of\nsuper-Jupiters ( $\\gtrsim$ 2 $M_J$) around M-dwarfs. However, when\nsuper-Jupiters are excluded from the analysis, we observe a striking similarity\nin the average masses of M-dwarf and FGK warm-Jupiters. We propose that these\ntrends can be explained by a minimum disk dust mass threshold required for\nJovian formation through core accretion, which is likely to be satisfied more\noften around higher mass stars. This simplistic explanation suggests that the\ndisk mass has more of an influence on giant planet formation than other factors\nsuch as the host star mass, formation location, metallicity, radiation\nenvironment, etc., and also accounts for the lower occurrence of giant planets\naround M-dwarf stars. Additionally, we explore the possibility of an abrupt\ntransition in the ratio of super-Jupiters to Jupiters around F-type stars at\nthe Kraft break, which could be a product of $v$sin$i$ related detection\nbiases, but requires additional data from an unbiased sample with published\nnon-detections to confirm. Overall, our results provide valuable insights into\nthe formation and evolution of giant exoplanets across a diverse range of\nstellar environments.\n",
  "subjects": [
    "Astrophysics/Earth and Planetary Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "xew7tz_q4-iehdw0nOBxEgKG0jx74OpiDJp7gIwbWRw",
  "pdfSize": "2621047"
}