{
  "id": "2412.16648",
  "title": "Fractional Spending: VRF&Ring Signatures As Efficient Primitives For\n  Secret Quorums",
  "authors": "Maxence Perion, Sara Tucci-Piergiovanni, Rida Bazzi",
  "authorsParsed": [
    [
      "Perion",
      "Maxence",
      ""
    ],
    [
      "Tucci-Piergiovanni",
      "Sara",
      ""
    ],
    [
      "Bazzi",
      "Rida",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 21 Dec 2024 14:37:36 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734791856000,
  "abstract": "  Digital currencies have emerged as a significant evolution in the financial\nsystem, yet they face challenges in distributed settings, particularly\nregarding double spending. Traditional approaches, such as Bitcoin, use\nconsensus to establish a total order of transactions, ensuring that no more\nthan the currency held by an account is spent in the order. However, consensus\nprotocols are costly, especially when coping with Byzantine faults. It was\nshown that solving Consensus is not needed to perform currency's transfer, for\ninstance using byzantine quorum systems but validation remains per-account\nsequential. Recent research also introduced the fractional spending problem,\nwhich enables concurrent but non-conflicting transactions i.e., transactions\nthat spend from the same account but cannot lead to a double spending because\neach is only spending a small fraction of the balance. A solution was proposed\nbased on a new quorum system and specific cryptographic primitives to protect\nagainst an adaptive adversary. The quorum system, called (k1, k2)-quorum\nsystem, guarantees that at least k1 transactions can be validated concurrently\nbut that no more than k2 can. Employing such quorums, a payer can validate\nconcurrently multiple fractional spending transactions in parallel with high\nprobability. Subsequently, the payer reclaims any remaining sum through a\nsettlement. This paper enhances such solution by integrating different\ncryptographic primitives, VRF and Ring Signatures, into a similar protocol. But\ncontrarily, these tools ensure quorums to remain secret during settlements,\nallowing to reduces its communication costs from cubic to quadratic in\nmessages. We also achieve payment transaction with 3 message delays rather then\n5. Additionally, we propose a refined formalization of the fractional spending\nproblem, introducing coupons, which simplifies the theoretical framework and\nproof structure.\n",
  "subjects": [
    "Computer Science/Cryptography and Security",
    "Computer Science/Distributed, Parallel, and Cluster Computing"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "sSWuLj4lYFndgT6BOd4ESdAOfliR4SLmwPz80DOwNEg",
  "pdfSize": "864148"
}