{
  "id": "2412.04567",
  "title": "A compact group lens modeled with GIGA-Lens: Enhanced inference for\n  complex systems",
  "authors": "F. Urcelay, E. Jullo, L. F. Barrientos, X. Huang and J. Hernandez",
  "authorsParsed": [
    [
      "Urcelay",
      "F.",
      ""
    ],
    [
      "Jullo",
      "E.",
      ""
    ],
    [
      "Barrientos",
      "L. F.",
      ""
    ],
    [
      "Huang",
      "X.",
      ""
    ],
    [
      "Hernandez",
      "J.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 19:21:52 GMT"
    }
  ],
  "updateDate": "2025-02-05",
  "timestamp": 1733426512000,
  "abstract": "  In the era of large-scale astronomical surveys, fast modeling of strong lens\nsystems has become increasingly vital. While significant progress has been made\nfor galaxy-scale lenses, the development of automated methods for modeling\nlarger systems, such as groups and clusters, is not as extensive. Our study\naims to extend the capabilities of the GIGA-Lens code, enhancing its efficiency\nin modeling multi-galaxy strong lens systems. We focus on demonstrating the\npotential of GPU-accelerated Bayesian inference in handling complex lensing\nscenarios with a high number of free parameters. We employ an improved\ninference approach that combines image position and pixelated data with an\nannealing sampling technique to obtain the posterior distribution of complex\nmodels. This method allows us to overcome the challenge of limited prior\ninformation, a high number of parameters, and memory usage. Our process is\nexemplified through the analysis of the compact group lens system DES\nJ0248-3955, for which we present VLT/X-shooter spectra. We measure a redshift\nof $z = 0.69 \\pm 0.04$ for the group, and $z = 1.2722 \\pm 0.0005$ for one of\nthe extended arcs. Our enhanced method successfully constrained a lens model\nwith 29 free parameters and lax priors in a remarkably short time. The mass of\nthe lens is well described by a single dark-matter halo with a velocity\ndispersion of $\\sigma_v = (690 \\pm 30) \\, km \\, s^{-1}$. The model predicts the\npresence of a second source at the same redshift and a third source at\napproximately $z \\sim 2.7$. Our study demonstrates the effectiveness of our\nlens modeling technique for dealing with a complex system in a short time using\nground-based data. This presents considerable potential within the context of\nlarge surveys such as LSST.\n",
  "subjects": [
    "Astrophysics/Cosmology and Nongalactic Astrophysics",
    "Astrophysics/Astrophysics of Galaxies",
    "Astrophysics/Instrumentation and Methods for Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "gJLkmK0-sfvOBiDRKL97vGIfW9sV7-lJ9BcD2PUsXQ4",
  "pdfSize": "964758"
}