{"id":"2412.10482","title":"Dynamic Entity-Masked Graph Diffusion Model for histopathological image\n  Representation Learning","authors":"Zhenfeng Zhuang, Min Cen, Yanfeng Li, Fangyu Zhou, Lequan Yu, Baptiste\n  Magnier, Liansheng Wang","authorsParsed":[["Zhuang","Zhenfeng",""],["Cen","Min",""],["Li","Yanfeng",""],["Zhou","Fangyu",""],["Yu","Lequan",""],["Magnier","Baptiste",""],["Wang","Liansheng",""]],"versions":[{"version":"v1","created":"Fri, 13 Dec 2024 10:18:36 GMT"}],"updateDate":"2024-12-17","timestamp":1734085116000,"abstract":"  Significant disparities between the features of natural images and those\ninherent to histopathological images make it challenging to directly apply and\ntransfer pre-trained models from natural images to histopathology tasks.\nMoreover, the frequent lack of annotations in histopathology patch images has\ndriven researchers to explore self-supervised learning methods like mask\nreconstruction for learning representations from large amounts of unlabeled\ndata. Crucially, previous mask-based efforts in self-supervised learning have\noften overlooked the spatial interactions among entities, which are essential\nfor constructing accurate representations of pathological entities. To address\nthese challenges, constructing graphs of entities is a promising approach. In\naddition, the diffusion reconstruction strategy has recently shown superior\nperformance through its random intensity noise addition technique to enhance\nthe robust learned representation. Therefore, we introduce H-MGDM, a novel\nself-supervised Histopathology image representation learning method through the\nDynamic Entity-Masked Graph Diffusion Model. Specifically, we propose to use\ncomplementary subgraphs as latent diffusion conditions and self-supervised\ntargets respectively during pre-training. We note that the graph can embed\nentities' topological relationships and enhance representation. Dynamic\nconditions and targets can improve pathological fine reconstruction. Our model\nhas conducted pretraining experiments on three large histopathological\ndatasets. The advanced predictive performance and interpretability of H-MGDM\nare clearly evaluated on comprehensive downstream tasks such as classification\nand survival analysis on six datasets. Our code will be publicly available at\nhttps://github.com/centurion-crawler/H-MGDM.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"IGeH0ngP3qeshqb3DxjefqhoLstsA9RC7DqzO-5hxeM","pdfSize":"14736843"}