{"id":"2412.03619","title":"A Teleoperation System with Impedance Control and Disturbance Observer\n  for Robot-Assisted Rehabilitation","authors":"Teng Li","authorsParsed":[["Li","Teng",""]],"versions":[{"version":"v1","created":"Wed, 4 Dec 2024 14:53:31 GMT"}],"updateDate":"2024-12-06","timestamp":1733324011000,"abstract":"  Physical movement therapy is a crucial method of rehabilitation aimed at\nreinstating mobility among patients facing motor dysfunction due to\nneurological conditions or accidents. Such therapy is usually featured as\npatient-specific, repetitive, and labor-intensive. The conventional method,\nwhere therapists collaborate with patients to conduct repetitive physical\ntraining, proves strenuous due to these characteristics. The concept of\nrobot-assisted rehabilitation, assisting therapists with robotic systems, has\ngained substantial popularity. However, building such systems presents\nchallenges, such as diverse task demands, uncertainties in dynamic models, and\nsafety issues. To address these concerns, in this paper, we proposed a\nbilateral teleoperation system for rehabilitation. The control scheme of the\nsystem is designed as an integrated framework of impedance control and\ndisturbance observer where the former can ensure compliant human-robot\ninteraction without the need for force sensors while the latter can compensate\nfor dynamic uncertainties when only a roughly identified dynamic model is\navailable. Furthermore, the scheme allows free switching between tracking tasks\nand physical human-robot interaction (pHRI). The presented system can execute a\nwide array of pre-defined trajectories with varying patterns, adaptable to\ndiverse needs. Moreover, the system can capture therapists' demonstrations,\nreplaying them as many times as necessary. The effectiveness of the\nteleoperation system is experimentally evaluated and demonstrated.\n","subjects":["Computer Science/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"RwUoE0E8pNnhl0114Sy-ifdtG8AsJEeMfUEqCWeBYSI","pdfSize":"13983513"}