{
  "id": "2412.10008",
  "title": "Automated Collection of Evaluation Dataset for Semantic Search in\n  Low-Resource Domain Language",
  "authors": "Anastasia Zhukova, Christian E. Matt, Bela Gipp",
  "authorsParsed": [
    [
      "Zhukova",
      "Anastasia",
      ""
    ],
    [
      "Matt",
      "Christian E.",
      ""
    ],
    [
      "Gipp",
      "Bela",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 09:47:26 GMT"
    }
  ],
  "updateDate": "2024-12-16",
  "timestamp": 1734083246000,
  "abstract": "  Domain-specific languages that use a lot of specific terminology often fall\ninto the category of low-resource languages. Collecting test datasets in a\nnarrow domain is time-consuming and requires skilled human resources with\ndomain knowledge and training for the annotation task. This study addresses the\nchallenge of automated collecting test datasets to evaluate semantic search in\nlow-resource domain-specific German language of the process industry. Our\napproach proposes an end-to-end annotation pipeline for automated query\ngeneration to the score reassessment of query-document pairs. To overcome the\nlack of text encoders trained in the German chemistry domain, we explore a\nprinciple of an ensemble of \"weak\" text encoders trained on common knowledge\ndatasets. We combine individual relevance scores from diverse models to\nretrieve document candidates and relevance scores generated by an LLM, aiming\nto achieve consensus on query-document alignment. Evaluation results\ndemonstrate that the ensemble method significantly improves alignment with\nhuman-assigned relevance scores, outperforming individual models in both\ninter-coder agreement and accuracy metrics. These findings suggest that\nensemble learning can effectively adapt semantic search systems for\nspecialized, low-resource languages, offering a practical solution to resource\nlimitations in domain-specific contexts.\n",
  "subjects": [
    "Computer Science/Computation and Language"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "CrhN0a_BiIjMQ84PVRuu0NcAxPsJ1Jj3hnK6VyCMX8Y",
  "pdfSize": "1183630"
}