{
  "id": "2412.15656",
  "title": "Locomotion on a lubricating fluid with spatial viscosity variations",
  "authors": "Takahiro Kanazawa, Kenta Ishimoto",
  "authorsParsed": [
    [
      "Kanazawa",
      "Takahiro",
      ""
    ],
    [
      "Ishimoto",
      "Kenta",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 08:15:06 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734682506000,
  "abstract": "  We studied locomotion of a crawler on a thin Newtonian fluid film whose\nviscosity varied spatially. We first derived a general locomotion velocity\nformula with fluid viscosity variations via the lubrication theory. For further\nanalysis, the surface of the crawler was described by a combination of\ntransverse and longitudinal travelling waves and we analysed the time-averaged\nlocomotion behaviours under two scenarios: (i) a sharp viscosity interface and\n(ii) a linear viscosity gradient. Using the asymptotic expansions of small\nsurface deformations and the method of multiple time-scale analysis, we derived\nan explicit form of the average velocity that captures nonlinear, accumulative\ninteractions between the crawler and the spatially varying environment. (i) In\nthe case of a viscosity interface, the time-averaged speed of the crawler is\nalways slower than that in the uniform viscosity, for both the transverse and\nlongitudinal wave cases. Notably, the speed reduction is most significant when\nthe crawler's front enters a more viscous layer and the crawler's rear exits\nfrom the same layer. (ii) In the case of a viscosity gradient, the crawler's\nspeed becomes slower for the transverse wave, while for the longitudinal wave,\nthe corrections are of a higher order compared with the uniform viscosity case.\nAs an application of the derived locomotion velocity formula, we also analysed\nthe impacts of a substrate topography to the average speed. Our analysis\nillustrates the fundamental importance of interactions between a locomotor and\nits environment, and separating the time scale behind the locomotion.\n",
  "subjects": [
    "Physics/Fluid Dynamics",
    "Condensed Matter/Soft Condensed Matter",
    "Physics/Biological Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "mW1UmdYKRQYOs8Yz4juGqzfKcm1eqdS6q2ub81I8TN8",
  "pdfSize": "1189473"
}