{"id":"2412.14433","title":"Spectral signatures of young radio galaxies","authors":"Sophie A. Young, Ross J. Turner, Stanislav S. Shabala, Georgia S. C.\n  Stewart, Patrick M. Yates-Jones","authorsParsed":[["Young","Sophie A.",""],["Turner","Ross J.",""],["Shabala","Stanislav S.",""],["Stewart","Georgia S. C.",""],["Yates-Jones","Patrick M.",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 01:30:20 GMT"}],"updateDate":"2024-12-20","timestamp":1734571820000,"abstract":"  We investigate the evolution of active galactic nucleus jets on\nkiloparsec-scales due to their interaction with the clumpy interstellar medium\n(ISM) of the host galaxy and, subsequently, the surrounding circumgalactic\nenvironment. Hydrodynamic simulations of this jet-environment interaction are\npresented for a range of jet kinetic powers, peak densities of the multiphase\nISM, and scale radii of the larger-scale environment -- characteristic of\neither a galaxy cluster or poor group. Synthetic radio images are generated by\nconsidering the combination of synchrotron radiation from the jet plasma and\nfree-free absorption from the multiphase ISM. We find that jet propagation is\nslowed by interactions with a few very dense clouds in the host galaxy ISM,\nproducing asymmetries in lobe length and brightness which persist to scales of\ntens of kpc for poor group environments. The classification of kiloparsec-scale\njets is highly dependent on surface brightness sensitivity and resolution. Our\nsimulations of young active sources can appear as restarted sources, showing\ndouble-double lobe morphology, high core prominence (CP > 0.1), and the\nexpected radio spectra for both the inner- and outer-lobe components. We\nqualitatively reproduce the observed inverse correlation between peak frequency\nand source size, and find that the peak frequency of the integrated radio\nspectrum depends on ISM density but not the jet power. Spectral turnover in\nresolved young radio sources therefore provides a new probe of the ISM.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"hksGuqdmdYDgszkaA9FTCSFuvZ9AkwUMNlGXlyp4yC4","pdfSize":"5430765"}