{
  "id": "2412.04111",
  "title": "Adult Glioma Segmentation in Sub-Saharan Africa using Transfer Learning\n  on Stratified Finetuning Data",
  "authors": "Abhijeet Parida, Daniel Capell\\'an-Mart\\'in, Zhifan Jiang, Austin\n  Tapp, Xinyang Liu, Syed Muhammad Anwar, Mar\\'ia J. Ledesma-Carbayo, Marius\n  George Linguraru",
  "authorsParsed": [
    [
      "Parida",
      "Abhijeet",
      ""
    ],
    [
      "Capellán-Martín",
      "Daniel",
      ""
    ],
    [
      "Jiang",
      "Zhifan",
      ""
    ],
    [
      "Tapp",
      "Austin",
      ""
    ],
    [
      "Liu",
      "Xinyang",
      ""
    ],
    [
      "Anwar",
      "Syed Muhammad",
      ""
    ],
    [
      "Ledesma-Carbayo",
      "María J.",
      ""
    ],
    [
      "Linguraru",
      "Marius George",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 12:29:12 GMT"
    },
    {
      "version": "v2",
      "created": "Fri, 20 Dec 2024 23:06:13 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1733401752000,
  "abstract": "  Gliomas, a kind of brain tumor characterized by high mortality, present\nsubstantial diagnostic challenges in low- and middle-income countries,\nparticularly in Sub-Saharan Africa. This paper introduces a novel approach to\nglioma segmentation using transfer learning to address challenges in\nresource-limited regions with minimal and low-quality MRI data. We leverage\npre-trained deep learning models, nnU-Net and MedNeXt, and apply a stratified\nfine-tuning strategy using the BraTS2023-Adult-Glioma and BraTS-Africa\ndatasets. Our method exploits radiomic analysis to create stratified training\nfolds, model training on a large brain tumor dataset, and transfer learning to\nthe Sub-Saharan context. A weighted model ensembling strategy and adaptive\npost-processing are employed to enhance segmentation accuracy. The evaluation\nof our proposed method on unseen validation cases on the BraTS-Africa 2024 task\nresulted in lesion-wise mean Dice scores of 0.870, 0.865, and 0.926, for\nenhancing tumor, tumor core, and whole tumor regions and was ranked first for\nthe challenge. Our approach highlights the ability of integrated\nmachine-learning techniques to bridge the gap between the medical imaging\ncapabilities of resource-limited countries and established developed regions.\nBy tailoring our methods to a target population's specific needs and\nconstraints, we aim to enhance diagnostic capabilities in isolated\nenvironments. Our findings underscore the importance of approaches like local\ndata integration and stratification refinement to address healthcare\ndisparities, ensure practical applicability, and enhance impact.\n  A dockerized version of the BraTS-Africa 2024 winning algorithm is available\nat https://hub.docker.com/r/aparida12/brats-ssa-2024 .\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Image and Video Processing",
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "R-tpkaAwrH8p68kvzUJuDOP7T7hPzDrx3uuM1Qnha5M",
  "pdfSize": "1401116"
}