{
  "id": "2412.12870",
  "title": "Towards Physically Interpretable World Models: Meaningful Weakly\n  Supervised Representations for Visual Trajectory Prediction",
  "authors": "Zhenjiang Mao and Ivan Ruchkin",
  "authorsParsed": [
    [
      "Mao",
      "Zhenjiang",
      ""
    ],
    [
      "Ruchkin",
      "Ivan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 12:51:24 GMT"
    },
    {
      "version": "v2",
      "created": "Mon, 27 Jan 2025 18:13:37 GMT"
    }
  ],
  "updateDate": "2025-01-28",
  "timestamp": 1734439884000,
  "abstract": "  Deep learning models are increasingly employed for perception, prediction,\nand control in complex systems. Embedding physical knowledge into these models\nis crucial for achieving realistic and consistent outputs, a challenge often\naddressed by physics-informed machine learning. However, integrating physical\nknowledge with representation learning becomes difficult when dealing with\nhigh-dimensional observation data, such as images, particularly under\nconditions of incomplete or imprecise state information. To address this, we\npropose Physically Interpretable World Models, a novel architecture that aligns\nlearned latent representations with real-world physical quantities. Our method\ncombines a variational autoencoder with a dynamical model that incorporates\nunknown system parameters, enabling the discovery of physically meaningful\nrepresentations. By employing weak supervision with interval-based constraints,\nour approach eliminates the reliance on ground-truth physical annotations.\nExperimental results demonstrate that our method improves the quality of\nlearned representations while achieving accurate predictions of future states,\nadvancing the field of representation learning in dynamic systems.\n",
  "subjects": [
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "L_nmBcMpXrXu7goyN8EQeFQkcpOODTtEnriRUg0aXP8",
  "pdfSize": "1744925"
}