{
  "id": "2412.19125",
  "title": "Advanced Knowledge Transfer: Refined Feature Distillation for Zero-Shot\n  Quantization in Edge Computing",
  "authors": "Inpyo Hong, Youngwan Jo, Hyojeong Lee, Sunghyun Ahn, Sanghyun Park",
  "authorsParsed": [
    [
      "Hong",
      "Inpyo",
      ""
    ],
    [
      "Jo",
      "Youngwan",
      ""
    ],
    [
      "Lee",
      "Hyojeong",
      ""
    ],
    [
      "Ahn",
      "Sunghyun",
      ""
    ],
    [
      "Park",
      "Sanghyun",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 26 Dec 2024 08:52:27 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735203147000,
  "abstract": "  We introduce AKT (Advanced Knowledge Transfer), a novel method to enhance the\ntraining ability of low-bit quantized (Q) models in the field of zero-shot\nquantization (ZSQ). Existing research in ZSQ has focused on generating\nhigh-quality data from full-precision (FP) models. However, these approaches\nstruggle with reduced learning ability in low-bit quantization due to its\nlimited information capacity. To overcome this limitation, we propose effective\ntraining strategy compared to data generation. Particularly, we analyzed that\nrefining feature maps in the feature distillation process is an effective way\nto transfer knowledge to the Q model. Based on this analysis, AKT efficiently\ntransfer core information from the FP model to the Q model. AKT is the first\napproach to utilize both spatial and channel attention information in feature\ndistillation in ZSQ. Our method addresses the fundamental gradient exploding\nproblem in low-bit Q models. Experiments on CIFAR-10 and CIFAR-100 datasets\ndemonstrated the effectiveness of the AKT. Our method led to significant\nperformance enhancement in existing generative models. Notably, AKT achieved\nsignificant accuracy improvements in low-bit Q models, achieving\nstate-of-the-art in the 3,5bit scenarios on CIFAR-10. The code is available at\nhttps://github.com/Inpyo-Hong/AKT-Advanced-knowledge-Transfer.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "mMhCYTMAdBVmr9UQX5p1A8_8a02SCuBbq5828L-KCRw",
  "pdfSize": "1797858"
}