{"id":"2412.01512","title":"ArtBrain: An Explainable end-to-end Toolkit for Classification and\n  Attribution of AI-Generated Art and Style","authors":"Ravidu Suien Rammuni Silva, Ahmad Lotfi, Isibor Kennedy Ihianle,\n  Golnaz Shahtahmassebi, Jordan J. Bird","authorsParsed":[["Silva","Ravidu Suien Rammuni",""],["Lotfi","Ahmad",""],["Ihianle","Isibor Kennedy",""],["Shahtahmassebi","Golnaz",""],["Bird","Jordan J.",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 14:03:50 GMT"}],"updateDate":"2024-12-03","timestamp":1733148230000,"abstract":"  Recently, the quality of artworks generated using Artificial Intelligence\n(AI) has increased significantly, resulting in growing difficulties in\ndetecting synthetic artworks. However, limited studies have been conducted on\nidentifying the authenticity of synthetic artworks and their source. This paper\nintroduces AI-ArtBench, a dataset featuring 185,015 artistic images across 10\nart styles. It includes 125,015 AI-generated images and 60,000 pieces of\nhuman-created artwork. This paper also outlines a method to accurately detect\nAI-generated images and trace them to their source model. This work proposes a\nnovel Convolutional Neural Network model based on the ConvNeXt model called\nAttentionConvNeXt. AttentionConvNeXt was implemented and trained to\ndifferentiate between the source of the artwork and its style with an F1-Score\nof 0.869. The accuracy of attribution to the generative model reaches 0.999. To\ncombine the scientific contributions arising from this study, a web-based\napplication named ArtBrain was developed to enable both technical and\nnon-technical users to interact with the model. Finally, this study presents\nthe results of an Artistic Turing Test conducted with 50 participants. The\nfindings reveal that humans could identify AI-generated images with an accuracy\nof approximately 58%, while the model itself achieved a significantly higher\naccuracy of around 99%.\n","subjects":["Computer Science/Artificial Intelligence","Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"C-8WkOgOW0x0hj43g849jVYE9xZxoAchtip9_1q8dbo","pdfSize":"33980023"}