{
  "id": "2412.20870",
  "title": "SoftPatch+: Fully Unsupervised Anomaly Classification and Segmentation",
  "authors": "Chengjie Wang, Xi Jiang, Bin-Bin Gao, Zhenye Gan, Yong Liu, Feng\n  Zheng, Lizhuang Ma",
  "authorsParsed": [
    [
      "Wang",
      "Chengjie",
      ""
    ],
    [
      "Jiang",
      "Xi",
      ""
    ],
    [
      "Gao",
      "Bin-Bin",
      ""
    ],
    [
      "Gan",
      "Zhenye",
      ""
    ],
    [
      "Liu",
      "Yong",
      ""
    ],
    [
      "Zheng",
      "Feng",
      ""
    ],
    [
      "Ma",
      "Lizhuang",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 30 Dec 2024 11:16:49 GMT"
    },
    {
      "version": "v2",
      "created": "Mon, 13 Jan 2025 04:11:06 GMT"
    }
  ],
  "updateDate": "2025-01-14",
  "timestamp": 1735557409000,
  "abstract": "  Although mainstream unsupervised anomaly detection (AD) (including\nimage-level classification and pixel-level segmentation)algorithms perform well\nin academic datasets, their performance is limited in practical application due\nto the ideal experimental setting of clean training data. Training with noisy\ndata is an inevitable problem in real-world anomaly detection but is seldom\ndiscussed. This paper is the first to consider fully unsupervised industrial\nanomaly detection (i.e., unsupervised AD with noisy data). To solve this\nproblem, we proposed memory-based unsupervised AD methods, SoftPatch and\nSoftPatch+, which efficiently denoise the data at the patch level. Noise\ndiscriminators are utilized to generate outlier scores for patch-level noise\nelimination before coreset construction. The scores are then stored in the\nmemory bank to soften the anomaly detection boundary. Compared with existing\nmethods, SoftPatch maintains a strong modeling ability of normal data and\nalleviates the overconfidence problem in coreset, and SoftPatch+ has more\nrobust performance which is articularly useful in real-world industrial\ninspection scenarios with high levels of noise (from 10% to 40%). Comprehensive\nexperiments conducted in diverse noise scenarios demonstrate that both\nSoftPatch and SoftPatch+ outperform the state-of-the-art AD methods on the\nMVTecAD, ViSA, and BTAD benchmarks. Furthermore, the performance of SoftPatch\nand SoftPatch+ is comparable to that of the noise-free methods in conventional\nunsupervised AD setting. The code of the proposed methods can be found at\nhttps://github.com/TencentYoutuResearch/AnomalyDetection-SoftPatch.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "JnQgolUzfbOiBF3EwyOI_WJFY_RYxsJzFBW9XfhXDSI",
  "pdfSize": "9608237"
}