{
  "id": "2412.07809",
  "title": "Fine-grained graph representation learning for heterogeneous mobile\n  networks with attentive fusion and contrastive learning",
  "authors": "Shengheng Liu, Tianqi Zhang, Ningning Fu, Yongming Huang",
  "authorsParsed": [
    [
      "Liu",
      "Shengheng",
      ""
    ],
    [
      "Zhang",
      "Tianqi",
      ""
    ],
    [
      "Fu",
      "Ningning",
      ""
    ],
    [
      "Huang",
      "Yongming",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 01:12:51 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733793171000,
  "abstract": "  AI becomes increasingly vital for telecom industry, as the burgeoning\ncomplexity of upcoming mobile communication networks places immense pressure on\nnetwork operators. While there is a growing consensus that intelligent network\nself-driving holds the key, it heavily relies on expert experience and\nknowledge extracted from network data. In an effort to facilitate convenient\nanalytics and utilization of wireless big data, we introduce the concept of\nknowledge graphs into the field of mobile networks, giving rise to what we term\nas wireless data knowledge graphs (WDKGs). However, the heterogeneous and\ndynamic nature of communication networks renders manual WDKG construction both\nprohibitively costly and error-prone, presenting a fundamental challenge. In\nthis context, we propose an unsupervised data-and-model driven graph structure\nlearning (DMGSL) framework, aimed at automating WDKG refinement and updating.\nTackling WDKG heterogeneity involves stratifying the network into homogeneous\nlayers and refining it at a finer granularity. Furthermore, to capture WDKG\ndynamics effectively, we segment the network into static snapshots based on the\ncoherence time and harness the power of recurrent neural networks to\nincorporate historical information. Extensive experiments conducted on the\nestablished WDKG demonstrate the superiority of the DMGSL over the baselines,\nparticularly in terms of node classification accuracy.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Networking and Internet Architecture"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "XS-2r7HSRONUx1hcnOuKTUcVLi0jrCePmZbOn-pDzSk",
  "pdfSize": "1326162"
}