{
  "id": "2412.13873",
  "title": "UA-MPC: Uncertainty-Aware Model Predictive Control for Motorized LiDAR\n  Odometry",
  "authors": "Jianping Li, Xinhang Xu, Jinxin Liu, Kun Cao, Shenghai Yuan, and Lihua\n  Xie",
  "authorsParsed": [
    [
      "Li",
      "Jianping",
      ""
    ],
    [
      "Xu",
      "Xinhang",
      ""
    ],
    [
      "Liu",
      "Jinxin",
      ""
    ],
    [
      "Cao",
      "Kun",
      ""
    ],
    [
      "Yuan",
      "Shenghai",
      ""
    ],
    [
      "Xie",
      "Lihua",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 14:12:11 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734531131000,
  "abstract": "  Accurate and comprehensive 3D sensing using LiDAR systems is crucial for\nvarious applications in photogrammetry and robotics, including facility\ninspection, Building Information Modeling (BIM), and robot navigation.\nMotorized LiDAR systems can expand the Field of View (FoV) without adding\nmultiple scanners, but existing motorized LiDAR systems often rely on\nconstant-speed motor control, leading to suboptimal performance in complex\nenvironments. To address this, we propose UA-MPC, an uncertainty-aware motor\ncontrol strategy that balances scanning accuracy and efficiency. By predicting\ndiscrete observabilities of LiDAR Odometry (LO) through ray tracing and\nmodeling their distribution with a surrogate function, UA-MPC efficiently\noptimizes motor speed control according to different scenes. Additionally, we\ndevelop a ROS-based realistic simulation environment for motorized LiDAR\nsystems, enabling the evaluation of control strategies across diverse\nscenarios. Extensive experiments, conducted on both simulated and real-world\nscenarios, demonstrate that our method significantly improves odometry accuracy\nwhile preserving the scanning efficiency of motorized LiDAR systems.\nSpecifically, it achieves over a 60\\% reduction in positioning error with less\nthan a 2\\% decrease in efficiency compared to constant-speed control, offering\na smarter and more effective solution for active 3D sensing tasks. The\nsimulation environment for control motorized LiDAR is open-sourced at:\n\\url{https://github.com/kafeiyin00/UA-MPC.git}.\n",
  "subjects": [
    "Computer Science/Robotics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "N3qqWHA7VcVkJo-rQ3n24ig7xIJGdlaJjczDy0rp0-8",
  "pdfSize": "4857211"
}