{
  "id": "2412.00025",
  "title": "On an infinite number of nonlinear Euler sums",
  "authors": "J. Braun, H. J. Bentz",
  "authorsParsed": [
    [
      "Braun",
      "J.",
      ""
    ],
    [
      "Bentz",
      "H. J.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 18 Nov 2024 14:34:52 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1731940492000,
  "abstract": "  Linear harmonic number sums had been studied by a variety of authors during\nthe last centuries, but only few results are known about nonlinear Euler sums\nof quadratic or even higher degree. The first systematic study on nonlinear\nEuler sums consisting of products of hyperharmonic sums had been published by\nFlajolet and Salvy in 1997 followed by similar studies presented during the\nlast years by different authors. Although these studies had been restricted to\nsums where the nominator consists of a product of even or odd hyperharmonic\nsums, where the denominator is of the type $1/k^n$. We have generalized these\nresults to nonlinear Euler sums with different denominators and nominators\nwhich consist in addition of mixed products between even and odd hyperharmonic\nnumbers. In detail we present eight families of quadratic Euler sums which are\nexpressible by zeta values and special types of linear Euler sums only where\nthe order of the nonlinear Euler sums is always an odd number. The resulting\neight different families of nonlinear Euler sums which we discovered consist of\nvarious products between even and odd hyperharmonic numbers, divided by three\ndifferent types of denominators $1/k^n$, $1/((2k-1)^n)$ and $1/(k(2k-1))$. The\ncalculational scheme is based on proper two-valued integer functions, which\nallow us to compute these sequences explicitly in terms of zeta values and\npairs of odd-type linear harmonic numbers and even hyperharmonic numbers of\nsecond order.\n",
  "subjects": [
    "Mathematics/Number Theory"
  ],
  "license": "http://creativecommons.org/publicdomain/zero/1.0/",
  "blobId": "pUbGpm2DPZhlLwEPSDuTy3dXlRr7_Cwn31swhc1aQH4",
  "pdfSize": "238878"
}