{"id":"2412.06830","title":"A New Strategy for the Exploration of Venus","authors":"The VEXAG Exploration Strategy Study Analysis Workgroup","authorsParsed":[["Workgroup","The VEXAG Exploration Strategy Study Analysis",""]],"versions":[{"version":"v1","created":"Fri, 6 Dec 2024 22:58:32 GMT"}],"updateDate":"2024-12-11","timestamp":1733525912000,"abstract":"  The 2023-2032 Planetary Science and Astrobiology Decadal Survey Origins,\nWorlds, and Life recommended that \"NASA develop scientific exploration\nstrategies, as it has for Mars, in areas of broad scientific importance, e.g.,\nVenus... that have an increasing number of U.S. missions and international\ncollaboration opportunities\" (OWL, p.22-10). In NASA's initial responses to\nthat Decadal Survey, the agency asserted that \"...specific scientific\nexploration strategies should be community generated by bodies such as the\nAnalysis Groups,\" thus placing the onus on the planetary community to generate\nand support these exploration strategies. In late 2022, the Venus Exploration\nAnalysis Group began a project to develop a new exploration strategy for Venus,\nreflecting the 2021 selections of the VERITAS, DAVINCI, and EnVision missions\nand the sweeping comparative planetology recommendations relevant to Venus in\nOrigins, Worlds, and Life.\n  This is that strategy.\n  Taking a broad look at the scientific, technological, and programmatic\nadvances required to address the key outstanding questions that Venus poses,\nand predicated on VERITAS, DAVINCI, and EnVision flying as planned in the early\n2030s, this report outlines a set of actions available to NASA, VEXAG, and the\nplanetary science community at large to establish a sustained program of Venus\nexploration in the years and decades ahead. Key to this approach is recognizing\nVenus as a unique setting where multiple, cross-disciplinary, Decadal-level\nplanetary, Earth, heliophysics, and exoplanet science questions can be\naddressed, as well as being a worthy target of exploration in its own right.\n  This report offers Assessments of the current state of Venus exploration, and\nActions for the U.S. and international Venus community, as well as NASA, to\nconsider. This strategy is a living document and should be updated as\nwarranted.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"am86SuuR5wfdyL2Isb3RNQY2BXBFt_7O7e9dEz-4aW8","pdfSize":"9651348"}