{
  "id": "2412.12095",
  "title": "Causal Diffusion Transformers for Generative Modeling",
  "authors": "Chaorui Deng, Deyao Zhu, Kunchang Li, Shi Guang, Haoqi Fan",
  "authorsParsed": [
    [
      "Deng",
      "Chaorui",
      ""
    ],
    [
      "Zhu",
      "Deyao",
      ""
    ],
    [
      "Li",
      "Kunchang",
      ""
    ],
    [
      "Guang",
      "Shi",
      ""
    ],
    [
      "Fan",
      "Haoqi",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 18:59:29 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 17 Dec 2024 18:45:55 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734375569000,
  "abstract": "  We introduce Causal Diffusion as the autoregressive (AR) counterpart of\nDiffusion models. It is a next-token(s) forecasting framework that is friendly\nto both discrete and continuous modalities and compatible with existing\nnext-token prediction models like LLaMA and GPT. While recent works attempt to\ncombine diffusion with AR models, we show that introducing sequential\nfactorization to a diffusion model can substantially improve its performance\nand enables a smooth transition between AR and diffusion generation modes.\nHence, we propose CausalFusion - a decoder-only transformer that\ndual-factorizes data across sequential tokens and diffusion noise levels,\nleading to state-of-the-art results on the ImageNet generation benchmark while\nalso enjoying the AR advantage of generating an arbitrary number of tokens for\nin-context reasoning. We further demonstrate CausalFusion's multimodal\ncapabilities through a joint image generation and captioning model, and\nshowcase CausalFusion's ability for zero-shot in-context image manipulations.\nWe hope that this work could provide the community with a fresh perspective on\ntraining multimodal models over discrete and continuous data.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "DdE2peEA8QPibjDtELte8KkLRdpcOLkkczid--zj-Bo",
  "pdfSize": "23137283"
}