{
  "id": "2412.06964",
  "title": "Magneto-Ionic Physical Reservoir Computing",
  "authors": "Md Mahadi Rajib, Dhritiman Bhattacharya, Christopher J. Jensen, Gong\n  Chen, Fahim F Chowdhury, Shouvik Sarkar, Kai Liu, and Jayasimha Atulasimha",
  "authorsParsed": [
    [
      "Rajib",
      "Md Mahadi",
      ""
    ],
    [
      "Bhattacharya",
      "Dhritiman",
      ""
    ],
    [
      "Jensen",
      "Christopher J.",
      ""
    ],
    [
      "Chen",
      "Gong",
      ""
    ],
    [
      "Chowdhury",
      "Fahim F",
      ""
    ],
    [
      "Sarkar",
      "Shouvik",
      ""
    ],
    [
      "Liu",
      "Kai",
      ""
    ],
    [
      "Atulasimha",
      "Jayasimha",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 20:09:25 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733774965000,
  "abstract": "  Recent progresses in magnetoionics offer exciting potentials to leverage its\nnon-linearity, short-term memory, and energy-efficiency to uniquely advance the\nfield of physical reservoir computing. In this work, we experimentally\ndemonstrate the classification of temporal data using a magneto-ionic (MI)\nheterostructure. The device was specifically engineered to induce non-linear\nion migration dynamics, which in turn imparted non-linearity and short-term\nmemory (STM) to the magnetization. These capabilities, key features for\nenabling reservoir computing, were investigated, and the role of the ion\nmigration mechanism, along with its history-dependent influence on STM, was\nexplained. These attributes were utilized to distinguish between sine and\nsquare waveforms within a randomly distributed set of pulses. Additionally, two\nimportant performance metrics, short-term memory and parity check capacity\n(PC), were quantified, yielding promising values of 1.44 and 2, respectively,\ncomparable to those of other state-of-the-art reservoirs. Our work paves the\nway for exploiting the relaxation dynamics of solid-state magneto-ionic\nplatforms and developing energy-efficient magneto-ionic reservoir computing\ndevices.\n",
  "subjects": [
    "Condensed Matter/Mesoscale and Nanoscale Physics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "E2I-umNZKXUYXkZz5XslVRYKpFLBVW8LnkAkklZdpt4",
  "pdfSize": "782949"
}