{"id":"2412.19552","title":"Contrast-Optimized Basis Functions for Self-Navigated Motion Correction\n  in Quantitative MRI","authors":"Elisa Marchetto, Sebastian Flassbeck, Andrew Mao, and Jakob\n  Assl\\\"ander","authorsParsed":[["Marchetto","Elisa",""],["Flassbeck","Sebastian",""],["Mao","Andrew",""],["Assländer","Jakob",""]],"versions":[{"version":"v1","created":"Fri, 27 Dec 2024 09:49:35 GMT"}],"updateDate":"2024-12-30","timestamp":1735292975000,"abstract":"  Purpose: The long scan times of quantitative MRI techniques make motion\nartifacts more likely. For MR-Fingerprinting-like approaches, this problem can\nbe addressed with self-navigated retrospective motion correction based on\nreconstructions in a singular value decomposition (SVD) subspace. However, the\nSVD promotes high signal intensity in all tissues, which limits the contrast\nbetween tissue types and ultimately reduces the accuracy of registration. The\npurpose of this paper is to rotate the subspace for maximum contrast between\ntwo types of tissue and improve the accuracy of motion estimates.\n  Methods: A subspace is derived that promotes contrasts between brain\nparenchyma and CSF, achieved through the generalized eigendecomposition of mean\nautocorrelation matrices, followed by a Gram-Schmidt process to maintain\northogonality. We tested our motion correction method on 85 scans with varying\nmotion levels, acquired with a 3D hybrid-state sequence optimized for\nquantitative magnetization transfer imaging.\n  Results: A comparative analysis shows that the contrast-optimized basis\nsignificantly improve the parenchyma-CSF contrast, leading to smoother motion\nestimates and reduced artifacts in the quantitative maps.\n  Conclusion: The proposed contrast-optimized subspace improves the accuracy of\nthe motion estimation.\n","subjects":["Physics/Medical Physics","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8hJEoZPvF-9k8ikkGrr-jC-uCDB9wgfYq9wcWaRFRRo","pdfSize":"3011602"}