{
  "id": "2412.14332",
  "title": "CW3E's West-WRF 200-member Ensemble",
  "authors": "Luca Delle Monache, Daniel F. Steinhoff, Rachel Weihs, Matthew\n  Simpson, Mohammadvaghef Ghazvinian, Vesta Afzali Gorooh, Kevin M. Lupo,\n  Patrick Mulrooney, Caroline Papadopoulos, F. Martin Ralph",
  "authorsParsed": [
    [
      "Monache",
      "Luca Delle",
      ""
    ],
    [
      "Steinhoff",
      "Daniel F.",
      ""
    ],
    [
      "Weihs",
      "Rachel",
      ""
    ],
    [
      "Simpson",
      "Matthew",
      ""
    ],
    [
      "Ghazvinian",
      "Mohammadvaghef",
      ""
    ],
    [
      "Gorooh",
      "Vesta Afzali",
      ""
    ],
    [
      "Lupo",
      "Kevin M.",
      ""
    ],
    [
      "Mulrooney",
      "Patrick",
      ""
    ],
    [
      "Papadopoulos",
      "Caroline",
      ""
    ],
    [
      "Ralph",
      "F. Martin",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 21:00:43 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734555643000,
  "abstract": "  A 200-member ensemble developed at the Center for Western Weather and Water\nExtremes based on the Weather Research and Forecast atmospheric model tailored\nfor the prediction of atmospheric rivers and associated heavy-to-extreme\nprecipitation events over the Western US (West-WRF) is presented. The ensemble\n(WW200En) is generated with initial and boundary conditions from the US\nNational Center for Environmental Prediction's Global Ensemble Forecast System\n(GEFS) and the European Centre for Medium-Range Weather Forecasts' Ensemble\nPrediction System (EPS), 100 unique combinations of microphysics, planetary\nboundary layer, and cumulus schemes, as well as perturbations applied to each\nof the 200 members based on the stochastic kinetic-energy backscatter scheme.\nEach member is run with 9-km horizontal increments and 60 vertical levels for a\n10-month period spanning two winters. The performance of WW200En is compared to\nGEFS and EPS for probabilistic forecasts of 24-h precipitation, integrated\nwater vapor transport (IVT), and for several thresholds including high\npercentiles of the observed climatological distribution. The WW200En\nprecipitation forecast skill is better than GEFS at nearly all thresholds and\nlead times, and comparable or better than the EPS. For larger rainfall\nthresholds WW200En typically exhibits the best forecast skill. Additionally,\nWW200En has a better spread-skill relationship than the global systems, and an\nimproved overall reliability and resolution of the probabilistic prediction.\nThe results for IVT are qualitatively similar to those for precipitation\nforecasts. A sensitivity analysis of the physics parameterizations and the\nnumber of ensemble members provides insights into possible future developments\nof WW200En.\n",
  "subjects": [
    "Physics/Atmospheric and Oceanic Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Xwto0paq6F2cGhFv4jf7o_x2P4JFW73XQ3kqsTdcbNw",
  "pdfSize": "3107760"
}