{
  "id": "2412.08003",
  "title": "Active Sampling and Gaussian Reconstruction for Radio Frequency Radiance\n  Field",
  "authors": "Chi-Shiang Gau, Xingyu Chen, Tara Javidi, Xinyu Zhang",
  "authorsParsed": [
    [
      "Gau",
      "Chi-Shiang",
      ""
    ],
    [
      "Chen",
      "Xingyu",
      ""
    ],
    [
      "Javidi",
      "Tara",
      ""
    ],
    [
      "Zhang",
      "Xinyu",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 01:14:13 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733879653000,
  "abstract": "  Radio-frequency (RF) Radiance Field reconstruction is a challenging problem.\nThe difficulty lies in the interactions between the propagating signal and\nobjects, such as reflections and diffraction, which are hard to model\nprecisely, especially when the shapes and materials of the objects are unknown.\nPreviously, a neural network-based method was proposed to reconstruct the RF\nRadiance Field, showing promising results. However, this neural network-based\nmethod has some limitations: it requires a large number of samples for training\nand is computationally expensive. Additionally, the neural network only\nprovides the predicted mean of the RF Radiance Field and does not offer an\nuncertainty model. In this work, we propose a training-free Gaussian\nreconstruction method for RF Radiance Field. Our method demonstrates that the\nrequired number of samples is significantly smaller compared to the neural\nnetwork-based approach. Furthermore, we introduce an uncertainty model that\nprovides confidence estimates for predictions at any selected position in the\nscene. We also combine the Gaussian reconstruction method with active sampling,\nwhich further reduces the number of samples needed to achieve the same\nperformance. Finally, we explore the potential benefits of our method in a\nquasi-dynamic setting, showcasing its ability to adapt to changes in the scene\nwithout requiring the entire process to be repeated.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Signal Processing"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "ZXM5uX2Kvp9AqCOo57qizffu7d6_0WPhpSlCZYfmdhc",
  "pdfSize": "2226563"
}