{"id":"2412.11691","title":"Multilingual and Explainable Text Detoxification with Parallel Corpora","authors":"Daryna Dementieva, Nikolay Babakov, Amit Ronen, Abinew Ali Ayele,\n  Naquee Rizwan, Florian Schneider, Xintong Wang, Seid Muhie Yimam, Daniil\n  Moskovskiy, Elisei Stakovskii, Eran Kaufman, Ashraf Elnagar, Animesh\n  Mukherjee and Alexander Panchenko","authorsParsed":[["Dementieva","Daryna",""],["Babakov","Nikolay",""],["Ronen","Amit",""],["Ayele","Abinew Ali",""],["Rizwan","Naquee",""],["Schneider","Florian",""],["Wang","Xintong",""],["Yimam","Seid Muhie",""],["Moskovskiy","Daniil",""],["Stakovskii","Elisei",""],["Kaufman","Eran",""],["Elnagar","Ashraf",""],["Mukherjee","Animesh",""],["Panchenko","Alexander",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 12:08:59 GMT"}],"updateDate":"2024-12-17","timestamp":1734350939000,"abstract":"  Even with various regulations in place across countries and social media\nplatforms (Government of India, 2021; European Parliament and Council of the\nEuropean Union, 2022, digital abusive speech remains a significant issue. One\npotential approach to address this challenge is automatic text detoxification,\na text style transfer (TST) approach that transforms toxic language into a more\nneutral or non-toxic form. To date, the availability of parallel corpora for\nthe text detoxification task (Logachevavet al., 2022; Atwell et al., 2022;\nDementievavet al., 2024a) has proven to be crucial for state-of-the-art\napproaches. With this work, we extend parallel text detoxification corpus to\nnew languages -- German, Chinese, Arabic, Hindi, and Amharic -- testing in the\nextensive multilingual setup TST baselines. Next, we conduct the first of its\nkind an automated, explainable analysis of the descriptive features of both\ntoxic and non-toxic sentences, diving deeply into the nuances, similarities,\nand differences of toxicity and detoxification across 9 languages. Finally,\nbased on the obtained insights, we experiment with a novel text detoxification\nmethod inspired by the Chain-of-Thoughts reasoning approach, enhancing the\nprompting process through clustering on relevant descriptive attributes.\n","subjects":["Computer Science/Computation and Language","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"eWpuF8M8AzUC5OlnbQGsPg-LbDIYPNOSMNa7qmJtQC4","pdfSize":"3304485"}