{"id":"2412.03053","title":"Noninvasive In vivo Estimation of HbA1c Based on Beer Lambert Model from\n  Photoplethysmogram Using Only Two Wavelengths","authors":"Mrinmoy Sarker Turja, Tae Ho Kwon, Hyoungkeun Kim and Ki Doo Kim","authorsParsed":[["Turja","Mrinmoy Sarker",""],["Kwon","Tae Ho",""],["Kim","Hyoungkeun",""],["Kim","Ki Doo",""]],"versions":[{"version":"v1","created":"Wed, 4 Dec 2024 06:14:41 GMT"}],"updateDate":"2024-12-05","timestamp":1733292881000,"abstract":"  Glycated hemoglobin (HbA1c) is the most important factor in diabetes control.\nSince HbA1c reflects the average blood glucose level over the preceding three\nmonths, it is unaffected by the patient's activity level or diet before the\ntest. Noninvasive HbA1c measurement reduces both the pain and complications\nassociated with fingertip piercing to collect blood. Photoplethysmography is\nhelpful for measuring HbA1c without blood samples. Herein, only two wavelengths\n(615 and 525 nm) were used to estimate HbA1c noninvasively, where two different\nratio calibrations were applied and performances were compared to a work that\nuses three wavelengths. For the fingertip type, the Pearson r values for HbA1c\nestimates are 0.896 and 0.905 considering ratio calibrations for blood vessel\nand whole finger models, respectively. Using another value (HbA1c) calibration\nin addition to ratio calibrations, we can improve this performance, such that\nthe Pearson r values of HbA1c levels are 0.929 and 0.930 for blood vessel and\nwhole finger models, respectively. In the previous study using three\nwavelengths, the Pearson r values were 0.916 and 0.959 for the blood-vessel and\nwhole-finger models, respectively. Here, the RCF of SpO2 estimation is 0.986\nwhen SpO2 ratio calibration is applied, while in the previous study, the RCF\nvalues of SpO2 estimation were 0.983 and 0.986 for the blood-vessel and whole\nfinger models, respectively. Thus, we show that HbA1c estimation using only two\nwavelengths has comparable performance to previous studies.\n","subjects":["Physics/Medical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"U3wohS5LPXTgXKNJOuIzq-CgVonCnEwCJNj-THOZHvI","pdfSize":"1130050"}