{"id":"2412.04418","title":"ACE2-SOM: Coupling an ML atmospheric emulator to a slab ocean and\n  learning the sensitivity of climate to changed CO$_2$","authors":"Spencer K. Clark, Oliver Watt-Meyer, Anna Kwa, Jeremy McGibbon, Brian\n  Henn, W. Andre Perkins, Elynn Wu, Lucas M. Harris, and Christopher S.\n  Bretherton","authorsParsed":[["Clark","Spencer K.",""],["Watt-Meyer","Oliver",""],["Kwa","Anna",""],["McGibbon","Jeremy",""],["Henn","Brian",""],["Perkins","W. Andre",""],["Wu","Elynn",""],["Harris","Lucas M.",""],["Bretherton","Christopher S.",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 18:44:33 GMT"},{"version":"v2","created":"Mon, 30 Dec 2024 21:38:56 GMT"}],"updateDate":"2025-01-03","timestamp":1733424273000,"abstract":"  While autoregressive machine-learning-based emulators have been trained to\nproduce stable and accurate rollouts in the climate of the present-day and\nrecent past, none so far have been trained to emulate the sensitivity of\nclimate to substantial changes in CO$_2$ or other greenhouse gases. As an\ninitial step we couple the Ai2 Climate Emulator version 2 to a slab ocean model\n(hereafter ACE2-SOM) and train it on output from a collection of\nequilibrium-climate physics-based reference simulations with varying levels of\nCO$_2$. We test it in equilibrium and non-equilibrium climate scenarios with\nCO$_2$ concentrations seen and unseen in training.\n  ACE2-SOM performs well in equilibrium-climate inference with both in-sample\nand out-of-sample CO$_2$ concentrations, accurately reproducing the emergent\ntime-mean spatial patterns of surface temperature and precipitation change with\nCO$_2$ doubling, tripling, or quadrupling. In addition, the vertical profile of\natmospheric warming and change in extreme precipitation rates up to the\n99.9999th percentile closely agree with the reference model.\nNon-equilibrium-climate inference is more challenging. With CO$_2$ increasing\ngradually at a rate of 2% year$^{-1}$, ACE2-SOM can accurately emulate the\nglobal annual mean trends of surface and lower-to-middle atmosphere fields but\nproduces unphysical jumps in stratospheric fields. With an abrupt quadrupling\nof CO$_2$, ML-controlled fields transition unrealistically quickly to the\n4xCO$_2$ regime. In doing so they violate global energy conservation and\nexhibit unphysical sensitivities of and surface and top of atmosphere radiative\nfluxes to instantaneous changes in CO$_2$. Future emulator development needed\nto address these issues should improve its generalizability to diverse climate\nchange scenarios.\n","subjects":["Physics/Atmospheric and Oceanic Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"hJY1tb3_FUaDoMCKor6rChP--pKCxO6e6RZL6TbTvRM","pdfSize":"14773683"}