{"id":"2412.13388","title":"Catalysts of Conversation: Examining Interaction Dynamics Between Topic\n  Initiators and Commentors in Alzheimer's Disease Online Communities","authors":"Congning Ni, Qingxia Chen, Lijun Song, Patricia Commiskey, Qingyuan\n  Song, Bradley A. Malin, Zhijun Yin","authorsParsed":[["Ni","Congning",""],["Chen","Qingxia",""],["Song","Lijun",""],["Commiskey","Patricia",""],["Song","Qingyuan",""],["Malin","Bradley A.",""],["Yin","Zhijun",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 00:00:41 GMT"}],"updateDate":"2024-12-19","timestamp":1734480041000,"abstract":"  Informal caregivers (e.g.,family members or friends) of people living with\nAlzheimers Disease and Related Dementias (ADRD) face substantial challenges and\noften seek informational or emotional support through online communities.\nUnderstanding the factors that drive engagement within these platforms is\ncrucial, as it can enhance their long-term value for caregivers by ensuring\nthat these communities effectively meet their needs. This study investigated\nthe user interaction dynamics within two large, popular ADRD communities,\nTalkingPoint and ALZConnected, focusing on topic initiator engagement, initial\npost content, and the linguistic patterns of comments at the thread level.\nUsing analytical methods such as propensity score matching, topic modeling, and\npredictive modeling, we found that active topic initiator engagement drives\nhigher comment volumes, and reciprocal replies from topic initiators encourage\nfurther commentor engagement at the community level. Practical caregiving\ntopics prompt more re-engagement of topic initiators, while emotional support\ntopics attract more comments from other commentors. Additionally, the\nlinguistic complexity and emotional tone of a comment influence its likelihood\nof receiving replies from topic initiators. These findings highlight the\nimportance of fostering active and reciprocal engagement and providing\neffective strategies to enhance sustainability in ADRD caregiving and broader\nhealth-related online communities.\n","subjects":["Computer Science/Computers and Society","Computer Science/Computation and Language","Computer Science/Machine Learning","Statistics/Applications"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ZbpTuzDzbMsK65VJ7uVOxbDsTesjK5dRRrKx7xkxpN4","pdfSize":"6201306"}