{"id":"2412.06596","title":"Augmented reality for upper limb rehabilitation: real-time kinematic\n  feedback with HoloLens 2","authors":"Beatrice Luciani, Alessandra Pedrocchi, Peppino Tropea, Agnese\n  Seregni, Francesco Braghin, Marta Gandolla","authorsParsed":[["Luciani","Beatrice",""],["Pedrocchi","Alessandra",""],["Tropea","Peppino",""],["Seregni","Agnese",""],["Braghin","Francesco",""],["Gandolla","Marta",""]],"versions":[{"version":"v1","created":"Mon, 9 Dec 2024 15:47:35 GMT"}],"updateDate":"2024-12-10","timestamp":1733759255000,"abstract":"  Exoskeletons for rehabilitation can help enhance motor recovery in\nindividuals suffering from neurological disorders. Precision in movement\nexecution, especially in arm rehabilitation, is crucial to prevent maladaptive\nplasticity. However, current exoskeletons, while providing arm support, often\nlack the necessary 3D feedback capabilities to show how well rehabilitation\nexercises are being performed. This reduces therapist acceptance and patients'\nperformance. Augmented Reality technologies offer promising solutions for\nfeedback and gaming systems in rehabilitation. In this work, we leverage\nHoloLens 2 with its advanced hand-tracking system to develop an application for\npersonalized rehabilitation. Our application generates custom holographic\ntrajectories based on existing databases or therapists' demonstrations,\nrepresented as 3D tunnels. Such trajectories can be superimposed on the real\ntraining environment. They serve as a guide to the users and, thanks to\ncolour-coded real-time feedback, indicate their performance. To assess the\nefficacy of the application in improving kinematic precision, we tested it with\n15 healthy subjects. Comparing user tracking capabilities with and without the\nuse of our feedback system in executing 4 different exercises, we observed\nsignificant differences, demonstrating that our application leads to improved\nkinematic performance. 12 clinicians tested our system and positively evaluated\nits usability (System Usability Scale score of 67.7) and acceptability (4.4 out\nof 5 in the 'Willingness to Use' category in the relative Technology Acceptance\nModel). The results from the tests on healthy participants and the feedback\nfrom clinicians encourage further exploration of our framework, to verify its\npotential in supporting arm rehabilitation for individuals with neurological\ndisorders.\n","subjects":["Computer Science/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"vjtY8hRZWMWsU_FBHXRcjNjPOtqrwAsSjsEh8qyvWrs","pdfSize":"22590234"}