{
  "id": "2412.11357",
  "title": "van der Waals Torque in 2D Materials Induced by Interaction between\n  Many-Body Charge Density Fluctuations",
  "authors": "Zepu Kou, Yuquan Zhou, Zonghuiyi Jiang, Alexandre Tkatchenko, Xiaofei\n  Liu",
  "authorsParsed": [
    [
      "Kou",
      "Zepu",
      ""
    ],
    [
      "Zhou",
      "Yuquan",
      ""
    ],
    [
      "Jiang",
      "Zonghuiyi",
      ""
    ],
    [
      "Tkatchenko",
      "Alexandre",
      ""
    ],
    [
      "Liu",
      "Xiaofei",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 01:12:43 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734311563000,
  "abstract": "  Van der Waals torque determines the relative rotational motion between\nanisotropic objects, being of relevance to low-dimensional systems. Here we\ndemonstrate a substantial torque between anisotropic two-dimensional materials\nthat arises from the interaction between many-body charge density fluctuations,\nexceeding by twenty-fold the torque computed with atom-pairwise models. The\ndependence of torque on the disorientation angle, the positive correlation\nbetween torque and in-planar dielectric anisotropy, the linear relation between\ntorque and area, and the decaying torque with increasing separation are\nrediscovered using the fully atomistic many-body dispersion model. Unlike\ncontinuum Casimir-Lifshitz theory, the advantage of the molecular theory relies\non describing the collective torque and the effects of atomic details on an\nequal footing. These findings open an avenue for incorporating quantum\nfluctuation-induced torque into molecular modeling, being instrumental to the\ndesign of nanoelectromechanical systems and the understanding of rotational\ndynamics of anisotropic layered materials.\n",
  "subjects": [
    "Physics/Computational Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "FeEcN6hvni_VPdovmv7h8-qzzFj-rg1hKa2hC69JZRs",
  "pdfSize": "5403202"
}