{"id":"2412.16236","title":"On Shaping Gain of Multidimensional Constellation in Linear and\n  Nonlinear Optical Fiber Channel","authors":"Bin Chen, Zhiwei Liang, Yi Lei, JingXin Deng, Shen Li and Gabriele\n  Liga","authorsParsed":[["Chen","Bin",""],["Liang","Zhiwei",""],["Lei","Yi",""],["Deng","JingXin",""],["Li","Shen",""],["Liga","Gabriele",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 08:16:41 GMT"}],"updateDate":"2024-12-24","timestamp":1734596201000,"abstract":"  Utilizing the multi-dimensional (MD) space for constellation shaping has been\nproven to be an effective approach for achieving shaping gains. Despite there\nexists a variety of MD modulation formats tailored for specific optical\ntransmission scenarios, there remains a notable absence of a dependable\ncomparison method for efficiently and promptly re-evaluating their performance\nin arbitrary transmission systems. In this paper, we introduce an analytical\nnonlinear interference (NLI) power model-based shaping gain estimation method\nto enable a fast performance evaluation of various MD modulation formats in\ncoherent dual-polarization (DP) optical transmission system. In order to extend\nthe applicability of this method to a broader set of modulation formats, we\nextend the established NLI model to take the 4D joint distribution into account\nand thus able to analyze the complex interactions of non-iid signaling in DP\nsystems. With the help of the NLI model, we conduct a comprehensive analysis of\nthe state-of-the-art modulation formats and investigate their actual shaping\ngains in two types of optical fiber communication scenarios (multi-span and\nsingle-span). The numerical simulation shows that for arbitrary modulation\nformats, the NLI power and relative shaping gains in terms of signal-to-noise\nratio can be more accurately estimated by capturing the statistics of MD\nsymbols. Furthermore, the proposed method further validates the effectiveness\nof the reported NLI-tolerant modulation format in the literature, which reveals\nthat the linear shaping gains and modulation-dependent NLI should be jointly\nconsidered for nonlinearity mitigation.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"sSfbmW5QDqjjQ_in9C7bV4e_xRvgXiqmcsEiEBwI2Uk","pdfSize":"656839"}