{"id":"2412.09758","title":"Toward Foundation Model for Multivariate Wearable Sensing of\n  Physiological Signals","authors":"Yunfei Luo, Yuliang Chen, Asif Salekin, Tauhidur Rahman","authorsParsed":[["Luo","Yunfei",""],["Chen","Yuliang",""],["Salekin","Asif",""],["Rahman","Tauhidur",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 23:35:18 GMT"}],"updateDate":"2024-12-16","timestamp":1734046518000,"abstract":"  Time-series foundation models have the ability to run inference, mainly\nforecasting, on any type of time series data, thanks to the informative\nrepresentations comprising waveform features. Wearable sensing data, on the\nother hand, contain more variability in both patterns and frequency bands of\ninterest and generally emphasize more on the ability to infer\nhealthcare-related outcomes. The main challenge of crafting a foundation model\nfor wearable sensing physiological signals is to learn generalizable\nrepresentations that support efficient adaptation across heterogeneous sensing\nconfigurations and applications. In this work, we propose NormWear, a step\ntoward such a foundation model, aiming to extract generalized and informative\nwearable sensing representations. NormWear has been pretrained on a large set\nof physiological signals, including PPG, ECG, EEG, GSR, and IMU, from various\npublic resources. For a holistic assessment, we perform downstream evaluation\non 11 public wearable sensing datasets, spanning 18 applications in the areas\nof mental health, body state inference, biomarker estimations, and disease risk\nevaluations. We demonstrate that NormWear achieves a better performance\nimprovement over competitive baselines in general time series foundation\nmodeling. In addition, leveraging a novel representation-alignment-match-based\nmethod, we align physiological signals embeddings with text embeddings. This\nalignment enables our proposed foundation model to perform zero-shot inference,\nallowing it to generalize to previously unseen wearable signal-based health\napplications. Finally, we perform nonlinear dynamic analysis on the waveform\nfeatures extracted by the model at each intermediate layer. This analysis\nquantifies the model's internal processes, offering clear insights into its\nbehavior and fostering greater trust in its inferences among end users.\n","subjects":["Computer Science/Machine Learning","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"dVswAyJ7uuGAMiJRjblqEo596maJfp9Z-SFUy-cjac8","pdfSize":"5691378"}