{
  "id": "2412.19119",
  "title": "Characterizing resources for multiparameter estimation of SU(2) and\n  SU(1,1) unitaries",
  "authors": "Shaowei Du and Shuheng Liu and Frank E. S. Steinhoff and Giuseppe\n  Vitagliano",
  "authorsParsed": [
    [
      "Du",
      "Shaowei",
      ""
    ],
    [
      "Liu",
      "Shuheng",
      ""
    ],
    [
      "Steinhoff",
      "Frank E. S.",
      ""
    ],
    [
      "Vitagliano",
      "Giuseppe",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 26 Dec 2024 08:36:38 GMT"
    },
    {
      "version": "v2",
      "created": "Mon, 27 Jan 2025 12:40:25 GMT"
    }
  ],
  "updateDate": "2025-01-28",
  "timestamp": 1735202198000,
  "abstract": "  We follow recent works analyzing precision bounds to the estimation of\nmultiple parameters generated by a unitary evolution with non-commuting\nHamiltonians that form a closed algebra. We consider the $3$-parameter\nestimation of SU(2) and SU(1,1) unitaries and investigate the scaling of the\nprecision in a pragmatic framework where the estimation is performed via the\nso-called method of moments, consisting in the estimation of phases via\nexpectation values of time-evolved observables, which we restrict to be the\nfirst two moments of the Hamiltonian generators. We consider optimal or\nclose-to-optimal initial states, that can be obtained by maximizing the quantum\nFisher information matrix, and analyze the maximal precision achievable from\nmeasuring only the first two moments of the generators. As a result, we find\nthat in our context with limited resources accessible, the twin-Fock state\nemerges as the best probe state, that allows the estimation of two out of the\nthree parameters with Heisenberg precision scaling. Moreover, in other\npractical scenarios with less limitations we identify useful probe states that\ncan in principle achieve Heisenberg scaling for the three parameters\nconsidered.\n",
  "subjects": [
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "RitCUJSXncvKEf9NRy4aoYSjgxpuNnnmTwU84I1dDYc",
  "pdfSize": "1472857"
}