{"id":"2412.06078","title":"Mixture-of-PageRanks: Replacing Long-Context with Real-Time, Sparse\n  GraphRAG","authors":"Nicholas Alonso, Beren Millidge","authorsParsed":[["Alonso","Nicholas",""],["Millidge","Beren",""]],"versions":[{"version":"v1","created":"Sun, 8 Dec 2024 21:55:12 GMT"}],"updateDate":"2024-12-10","timestamp":1733694912000,"abstract":"  Recent advances have extended the context window of frontier LLMs\ndramatically, from a few thousand tokens up to millions, enabling entire books\nand codebases to fit into context. However, the compute costs of inferencing\nlong-context LLMs are massive and often prohibitive in practice. RAG offers an\nefficient and effective alternative: retrieve and process only the subset of\nthe context most important for the current task. Although promising, recent\nwork applying RAG to long-context tasks has two core limitations: 1) there has\nbeen little focus on making the RAG pipeline compute efficient, and 2) such\nworks only test on simple QA tasks, and their performance on more challenging\ntasks is unclear. To address this, we develop an algorithm based on PageRank, a\ngraph-based retrieval algorithm, which we call mixture-of-PageRanks (MixPR).\nMixPR uses a mixture of PageRank-based graph-retrieval algorithms implemented\nusing sparse matrices for efficent, cheap retrieval that can deal with a\nvariety of complex tasks. Our MixPR retriever achieves state-of-the-art results\nacross a wide range of long-context benchmark tasks, outperforming both\nexisting RAG methods, specialized retrieval architectures, and long-context\nLLMs despite being far more compute efficient. Due to using sparse embeddings,\nour retriever is extremely compute efficient, capable of embedding and\nretrieving millions of tokens within a few seconds and runs entirely on CPU.\n","subjects":["Computer Science/Information Retrieval","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"hnSxzLDvhPGfXF2VBp6rMIQm_nUDL3MJopb2ptclIm8","pdfSize":"2770190"}