{"id":"2412.18792","title":"Improving the performance of Bandwidth Efficient Acknowledgement based\n  Multicast (BEAM) protocol in VANET for Urban environment","authors":"Alehegn Minale Chanie, Dawit Kflie (Dr), Getamesay Haile","authorsParsed":[["Chanie","Alehegn Minale","","Dr"],["Kflie","Dawit","","Dr"],["Haile","Getamesay",""]],"versions":[{"version":"v1","created":"Wed, 25 Dec 2024 06:16:21 GMT"}],"updateDate":"2024-12-30","timestamp":1735107381000,"abstract":"  Vehicular Ad-hoc Network (VANET) is a subset of Mobile Ad-hoc Network (MANET)\nenabling communication between vehicles for safety, traffic updates,\nentertainment, and data sharing. Due to the high mobility in VANETs, routing\nmessages to their final destination is challenging. Various protocols, such as\nbroadcasting, multicasting, and geo-casting, are used to disseminate data.\nMulticasting protocols are effective in conserving bandwidth. One such\nprotocol, Bandwidth Efficient Acknowledgment Based Multicasting Protocol\n(BEAM), improves VANET performance by minimizing in-network message\ntransactions, particularly in emergencies. However, BEAM may cause multi-car\ncollisions due to the absence of vehicle-to-vehicle (V2V) communication. To\naddress this, we propose an algorithm that incorporates clustering, grouping\nvehicles based on predefined metrics like density, velocity, and location.\nClustering controls VANET topology dynamics, enhancing stability and reducing\ncommunication barriers and RSU installation costs. The proposed approach uses\nstatic and mobile agents for communication between vehicles and RSUs. In\nmulticast groups, RSUs manage communication, while cluster heads (CHs) handle\nnon-multicast groups. Agents decide cluster size and select primary and\nsecondary cluster heads based on vehicle speed and connectivity. A backup\ncluster head prevents re-clustering during high mobility, extending cluster\nlife and reducing routing overhead. Simulation results demonstrate improved\nperformance in terms of throughput, PDR, and end-to-end delay compared to BEAM\n","subjects":["Computer Science/Networking and Internet Architecture"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"11SfhLcM7YPKFDbc5f39y8V2KPnv2sXs5Jw5pMOXIMI","pdfSize":"3368633"}