{
  "id": "2412.11987",
  "title": "Convective shutdown in the atmospheres of lava worlds",
  "authors": "Harrison Nicholls, Raymond T. Pierrehumbert, Tim Lichtenberg, Laurent\n  Soucasse, and Stef Smeets",
  "authorsParsed": [
    [
      "Nicholls",
      "Harrison",
      ""
    ],
    [
      "Pierrehumbert",
      "Raymond T.",
      ""
    ],
    [
      "Lichtenberg",
      "Tim",
      ""
    ],
    [
      "Soucasse",
      "Laurent",
      ""
    ],
    [
      "Smeets",
      "Stef",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 17:11:31 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734369091000,
  "abstract": "  Atmospheric energy transport is central to the cooling of primordial magma\noceans. Theoretical studies of atmospheres on lava planets have assumed that\nconvection is the only process involved in setting the atmospheric temperature\nstructure. This significantly influences the ability for a magma ocean to cool.\nIt has been suggested that convective stability in these atmospheres could\npreclude permanent magma oceans. We develop a new 1D radiative-convective model\nin order to investigate when the atmospheres overlying magma oceans are\nconvectively stable. Using a coupled interior-atmosphere framework, we simulate\nthe early evolution of two terrestrial-mass exoplanets: TRAPPIST-1 c and HD\n63433 d. Our simulations suggest that the atmosphere of HD 63433 d exhibits\ndeep isothermal layers which are convectively stable. However, it is able to\nmaintain a permanent magma ocean and an atmosphere depleted in H2O. It is\npossible to maintain permanent magma oceans underneath atmospheres without\nconvection. Absorption features of CO2 and SO2 within synthetic emission\nspectra are associated with mantle redox state, meaning that future\nobservations of HD 63433 d may provide constraints on the geochemical\nproperties of a magma ocean analogous with the early Earth. Simulations of\nTRAPPIST-1 c indicate that it is expected to have solidified within 100 Myr,\noutgassing a thick atmosphere in the process. Cool isothermal stratospheres\ngenerated by low molecular-weight atmospheres can mimic the emission of an\natmosphere-less body. Future work should consider how atmospheric escape and\nchemistry modulates the lifetime of magma oceans, and the role of tidal heating\nin sustaining atmospheric convection\n",
  "subjects": [
    "Astrophysics/Earth and Planetary Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "PthD-tKiI9tAp1YwWVfvzkzDDUxLh0p8vXDEmuGiRxs",
  "pdfSize": "1815564"
}