{"id":"2412.15535","title":"Protocol for an Observational Study on the Effects of Paternal Alcohol\n  Use Disorder on Children's Later Life Outcomes","authors":"William Bekerman, Marina Bogomolov, Ruth Heller, Matthew Spivey, Kevin\n  G. Lynch, David W. Oslin, Dylan S. Small","authorsParsed":[["Bekerman","William",""],["Bogomolov","Marina",""],["Heller","Ruth",""],["Spivey","Matthew",""],["Lynch","Kevin G.",""],["Oslin","David W.",""],["Small","Dylan S.",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 03:49:31 GMT"}],"updateDate":"2024-12-23","timestamp":1734666571000,"abstract":"  The harmful effects of growing up with a parent with an alcohol use disorder\nhave been closely examined in children and adolescents, and are reported to\ninclude mental and physical health problems, interpersonal difficulties, and a\nworsened risk of future substance use disorders. However, few studies have\ninvestigated how these impacts evolve into later life adulthood, leaving the\nensuing long-term effects of interest. In this article, we provide the protocol\nfor our observational study of the long-term consequences of growing up with a\nfather who had an alcohol use disorder. We will use data from the Wisconsin\nLongitudinal Study to examine impacts on long-term economic success,\ninterpersonal relationships, physical, and mental health. To reinforce our\nfindings, we will conduct this investigation on two discrete subpopulations of\nindividuals in our study, allowing us to analyze the replicability of our\nconclusions. We introduce a novel statistical design, called data turnover, to\ncarry out this analysis. Data turnover allows a single group of statisticians\nand domain experts to work together to assess the strength of evidence gathered\nacross multiple data splits, while incorporating both qualitative and\nquantitative findings from data exploration. We delineate our analysis plan\nusing this new method and conclude with a brief discussion of some additional\nconsiderations for our study.\n","subjects":["Statistics/Applications","Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"q9nbXO_p1B5wpgZeGbLqP5NeEGkjGTv8XPsGKq4Wvns","pdfSize":"344078"}