{
  "id": "2412.14339",
  "title": "Forecasting Influenza Hospitalizations Using a Bayesian Hierarchical\n  Nonlinear Model with Discrepancy",
  "authors": "Spencer Wadsworth and Jarad Niemi",
  "authorsParsed": [
    [
      "Wadsworth",
      "Spencer",
      ""
    ],
    [
      "Niemi",
      "Jarad",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 21:12:30 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734556350000,
  "abstract": "  The annual influenza outbreak leads to significant public health and economic\nburdens making it desirable to have prompt and accurate probabilistic forecasts\nof the disease spread. The United States Centers for Disease Control and\nPrevention (CDC) hosts annually a national flu forecasting competition which\nhas led to the development of a variety of flu forecast modeling methods.\nBeginning in 2013, the target to be forecast was weekly percentage of patients\nwith an influenza-like illness (ILI), but in 2021 the target was changed to\nweekly hospitalizations. Reliable hospitalization data has only been available\nsince 2021, but ILI data has been available since 2010 and has been\nsuccessfully forecast for several seasons. In this manuscript, we introduce a\ntwo component modeling framework for forecasting hospitalizations utilizing\nboth hospitalization and ILI data. The first component is for modeling ILI data\nusing a nonlinear Bayesian model. The second component is for modeling\nhospitalizations as a function of ILI. For hospitalization forecasts, ILI is\nfirst forecast then hospitalizations are forecast with ILI forecasts used as a\npredictor. In a simulation study, the hospitalization forecast model is\nassessed and two previously successful ILI forecast models are compared. Also\nassessed is the usefulness of including a systematic model discrepancy term in\nthe ILI model. Forecasts of state and national hospitalizations for the 2023-24\nflu season are made, and different modeling decisions are compared. We found\nthat including a discrepancy component in the ILI model tends to improve\nforecasts during certain weeks of the year. We also found that other modeling\ndecisions such as the exact nonlinear function to be used in the ILI model or\nthe error distribution for hospitalization models may or may not be better than\nother decisions, depending on the season, location, or week of the forecast.\n",
  "subjects": [
    "Statistics/Applications"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "VK7vZucS9kUZKpvQHBKbd4dN8ldRb1TpXfXy4C8RAI4",
  "pdfSize": "815519"
}