{
  "id": "2412.06832",
  "title": "SLA Management in Reconfigurable Multi-Agent RAG: A Systems Approach to\n  Question Answering",
  "authors": "Michael Iannelli, Sneha Kuchipudi, and Vera Dvorak",
  "authorsParsed": [
    [
      "Iannelli",
      "Michael",
      ""
    ],
    [
      "Kuchipudi",
      "Sneha",
      ""
    ],
    [
      "Dvorak",
      "Vera",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 7 Dec 2024 01:32:13 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733535133000,
  "abstract": "  Retrieval Augmented Generation (RAG) enables Large Language Models (LLMs) to\ngeneralize to new information by decoupling reasoning capabilities from static\nknowledge bases. Traditional RAG enhancements have explored vertical scaling --\nassigning subtasks to specialized modules -- and horizontal scaling --\nreplicating tasks across multiple agents -- to improve performance. However,\nreal-world applications impose diverse Service Level Agreements (SLAs) and\nQuality of Service (QoS) requirements, involving trade-offs among objectives\nsuch as reducing cost, ensuring answer quality, and adhering to specific\noperational constraints.\n  In this work, we present a systems-oriented approach to multi-agent RAG\ntailored for real-world Question Answering (QA) applications. By integrating\ntask-specific non-functional requirements -- such as answer quality, cost, and\nlatency -- into the system, we enable dynamic reconfiguration to meet diverse\nSLAs. Our method maps these Service Level Objectives (SLOs) to system-level\nparameters, allowing the generation of optimal results within specified\nresource constraints.\n  We conduct a case study in the QA domain, demonstrating how dynamic\nre-orchestration of a multi-agent RAG system can effectively manage the\ntrade-off between answer quality and cost. By adjusting the system based on\nquery intent and operational conditions, we systematically balance performance\nand resource utilization. This approach allows the system to meet SLOs for\nvarious query types, showcasing its practicality for real-world applications.\n",
  "subjects": [
    "Computer Science/Software Engineering",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Computation and Language",
    "Computer Science/Distributed, Parallel, and Cluster Computing"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "e7-7a0M21-QDsu6KfLrfZYXJ6JQMeNBcFiqH4y_D2p4",
  "pdfSize": "2742126"
}