{
  "id": "2412.18063",
  "title": "LMRPA: Large Language Model-Driven Efficient Robotic Process Automation\n  for OCR",
  "authors": "Osama Hosam Abdellaif, Abdelrahman Nader, Ali Hamdi",
  "authorsParsed": [
    [
      "Abdellaif",
      "Osama Hosam",
      ""
    ],
    [
      "Nader",
      "Abdelrahman",
      ""
    ],
    [
      "Hamdi",
      "Ali",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 24 Dec 2024 00:21:36 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1734999696000,
  "abstract": "  This paper introduces LMRPA, a novel Large Model-Driven Robotic Process\nAutomation (RPA) model designed to greatly improve the efficiency and speed of\nOptical Character Recognition (OCR) tasks. Traditional RPA platforms often\nsuffer from performance bottlenecks when handling high-volume repetitive\nprocesses like OCR, leading to a less efficient and more time-consuming\nprocess. LMRPA allows the integration of Large Language Models (LLMs) to\nimprove the accuracy and readability of extracted text, overcoming the\nchallenges posed by ambiguous characters and complex text structures.Extensive\nbenchmarks were conducted comparing LMRPA to leading RPA platforms, including\nUiPath and Automation Anywhere, using OCR engines like Tesseract and DocTR. The\nresults are that LMRPA achieves superior performance, cutting the processing\ntimes by up to 52\\%. For instance, in Batch 2 of the Tesseract OCR task, LMRPA\ncompleted the process in 9.8 seconds, where UiPath finished in 18.1 seconds and\nAutomation Anywhere finished in 18.7 seconds. Similar improvements were\nobserved with DocTR, where LMRPA outperformed other automation tools conducting\nthe same process by completing tasks in 12.7 seconds, while competitors took\nover 20 seconds to do the same. These findings highlight the potential of LMRPA\nto revolutionize OCR-driven automation processes, offering a more efficient and\neffective alternative solution to the existing state-of-the-art RPA models.\n",
  "subjects": [
    "Computer Science/Robotics",
    "Computer Science/Digital Libraries",
    "Computer Science/Human-Computer Interaction",
    "Computer Science/Software Engineering"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "uCJ3MVORYRVwKgVO1_YaJcWhBk1zBa7o43BDKEK6o_E",
  "pdfSize": "403554"
}