{
  "id": "2412.03367",
  "title": "Light structuring via nonlinear total angular momentum addition with\n  flat optics",
  "authors": "Evgenii Menshikov, Paolo Franceschini, Kristina Frizyuk, Ivan\n  Fernandez-Corbaton, Andrea Tognazzi, Alfonso Carmelo Cino, Denis Garoli,\n  Mihail Petrov, Domenico de Ceglia, Costantino De Angelis",
  "authorsParsed": [
    [
      "Menshikov",
      "Evgenii",
      ""
    ],
    [
      "Franceschini",
      "Paolo",
      ""
    ],
    [
      "Frizyuk",
      "Kristina",
      ""
    ],
    [
      "Fernandez-Corbaton",
      "Ivan",
      ""
    ],
    [
      "Tognazzi",
      "Andrea",
      ""
    ],
    [
      "Cino",
      "Alfonso Carmelo",
      ""
    ],
    [
      "Garoli",
      "Denis",
      ""
    ],
    [
      "Petrov",
      "Mihail",
      ""
    ],
    [
      "de Ceglia",
      "Domenico",
      ""
    ],
    [
      "De Angelis",
      "Costantino",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 14:54:52 GMT"
    }
  ],
  "updateDate": "2024-12-05",
  "timestamp": 1733324092000,
  "abstract": "  Shaping the structure of light with flat optical devices has driven\nsignificant advancements in our fundamental understanding of light and\nlight-matter interactions, and enabled a broad range of applications, from\nimage processing and microscopy to optical communication, quantum information\nprocessing, and the manipulation of microparticles. Yet, pushing the boundaries\nof structured light beyond the linear optical regime remains an open challenge.\nNonlinear optical interactions, such as wave mixing in nonlinear flat optics,\noffer a powerful platform to unlock new degrees of freedom and functionalities\nfor generating and detecting structured light. In this study, we experimentally\ndemonstrate the non-trivial structuring of third-harmonic light enabled by the\naddition of total angular momentum projection in a nonlinear, isotropic flat\noptics element -- a single thin film of amorphous silicon. We identify the\ntotal angular momentum projection and helicity as the most critical properties\nfor analyzing the experimental results. The theoretical model we propose,\nsupported by numerical simulations, offers quantitative predictions for light\nstructuring through nonlinear wave mixing under various pumping conditions,\nincluding vectorial and non-paraxial pump light. Notably, we reveal that the\nshape of third-harmonic light is highly sensitive to the polarization state of\nthe pump. Our findings demonstrate that harnessing the addition of total\nangular momentum projection in nonlinear wave mixing can be a powerful strategy\nfor generating and detecting precisely controlled structured light.\n",
  "subjects": [
    "Physics/Optics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "RjQl5OMD50gcoWbofxqV8xMEcLhDxOvw9BBkRfRrec4",
  "pdfSize": "6440458"
}