{
  "id": "2412.16674",
  "title": "STAMPsy: Towards SpatioTemporal-Aware Mixed-Type Dialogues for\n  Psychological Counseling",
  "authors": "Jieyi Wang, Yue Huang, Zeming Liu, Dexuan Xu, Chuan Wang, Xiaoming\n  Shi, Ruiyuan Guan, Hongxing Wang, Weihua Yue, Yu Huang",
  "authorsParsed": [
    [
      "Wang",
      "Jieyi",
      ""
    ],
    [
      "Huang",
      "Yue",
      ""
    ],
    [
      "Liu",
      "Zeming",
      ""
    ],
    [
      "Xu",
      "Dexuan",
      ""
    ],
    [
      "Wang",
      "Chuan",
      ""
    ],
    [
      "Shi",
      "Xiaoming",
      ""
    ],
    [
      "Guan",
      "Ruiyuan",
      ""
    ],
    [
      "Wang",
      "Hongxing",
      ""
    ],
    [
      "Yue",
      "Weihua",
      ""
    ],
    [
      "Huang",
      "Yu",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 21 Dec 2024 15:48:02 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734796082000,
  "abstract": "  Online psychological counseling dialogue systems are trending, offering a\nconvenient and accessible alternative to traditional in-person therapy.\nHowever, existing psychological counseling dialogue systems mainly focus on\nbasic empathetic dialogue or QA with minimal professional knowledge and without\ngoal guidance. In many real-world counseling scenarios, clients often seek\nmulti-type help, such as diagnosis, consultation, therapy, console, and common\nquestions, but existing dialogue systems struggle to combine different dialogue\ntypes naturally. In this paper, we identify this challenge as how to construct\nmixed-type dialogue systems for psychological counseling that enable clients to\nclarify their goals before proceeding with counseling. To mitigate the\nchallenge, we collect a mixed-type counseling dialogues corpus termed STAMPsy,\ncovering five dialogue types, task-oriented dialogue for diagnosis,\nknowledge-grounded dialogue, conversational recommendation, empathetic\ndialogue, and question answering, over 5,000 conversations. Moreover,\nspatiotemporal-aware knowledge enables systems to have world awareness and has\nbeen proven to affect one's mental health. Therefore, we link dialogues in\nSTAMPsy to spatiotemporal state and propose a spatiotemporal-aware mixed-type\npsychological counseling dataset. Additionally, we build baselines on STAMPsy\nand develop an iterative self-feedback psychological dialogue generation\nframework, named Self-STAMPsy. Results indicate that clarifying dialogue goals\nin advance and utilizing spatiotemporal states are effective.\n",
  "subjects": [
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "9kTWMBJRmc4J36EK1Vuz6Z6expHjXxYQrNOs4aF8GFY",
  "pdfSize": "8805018"
}