{
  "id": "2412.17541",
  "title": "Concept Discovery in Deep Neural Networks for Explainable Face\n  Anti-Spoofing",
  "authors": "Haoyuan Zhang, Xiangyu Zhu, Li Gao, Guoying Zhao, Zhen Lei",
  "authorsParsed": [
    [
      "Zhang",
      "Haoyuan",
      ""
    ],
    [
      "Zhu",
      "Xiangyu",
      ""
    ],
    [
      "Gao",
      "Li",
      ""
    ],
    [
      "Zhao",
      "Guoying",
      ""
    ],
    [
      "Lei",
      "Zhen",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 13:03:51 GMT"
    },
    {
      "version": "v2",
      "created": "Thu, 26 Dec 2024 01:48:36 GMT"
    },
    {
      "version": "v3",
      "created": "Sun, 5 Jan 2025 04:42:03 GMT"
    }
  ],
  "updateDate": "2025-01-07",
  "timestamp": 1734959031000,
  "abstract": "  With the rapid growth usage of face recognition in people's daily life, face\nanti-spoofing becomes increasingly important to avoid malicious attacks. Recent\nface anti-spoofing models can reach a high classification accuracy on multiple\ndatasets but these models can only tell people \"this face is fake\" while\nlacking the explanation to answer \"why it is fake\". Such a system undermines\ntrustworthiness and causes user confusion, as it denies their requests without\nproviding any explanations. In this paper, we incorporate XAI into face\nanti-spoofing and propose a new problem termed X-FAS (eXplainable Face\nAnti-Spoofing) empowering face anti-spoofing models to provide an explanation.\nWe propose SPED (SPoofing Evidence Discovery), an X-FAS method which can\ndiscover spoof concepts and provide reliable explanations on the basis of\ndiscovered concepts. To evaluate the quality of X-FAS methods, we propose an\nX-FAS benchmark with annotated spoofing evidence by experts. We analyze SPED\nexplanations on face anti-spoofing dataset and compare SPED quantitatively and\nqualitatively with previous XAI methods on proposed X-FAS benchmark.\nExperimental results demonstrate SPED's ability to generate reliable\nexplanations.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "hmzcIV1sao7UXAf7Es8m1qujK4cmt9mkaRkKGLPOZ-4",
  "pdfSize": "6853000"
}