{
  "id": "2412.16061",
  "title": "On the Impact of 3D Visualization of Repository Metrics in Software\n  Engineering Education",
  "authors": "Dario Di Dario, Stefano Lambiase, Fabio Palomba, Carmine Gravino",
  "authorsParsed": [
    [
      "Di Dario",
      "Dario",
      ""
    ],
    [
      "Lambiase",
      "Stefano",
      ""
    ],
    [
      "Palomba",
      "Fabio",
      ""
    ],
    [
      "Gravino",
      "Carmine",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 17:06:15 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734714375000,
  "abstract": "  Context: Software development is a complex socio-technical process requiring\na deep understanding of various aspects. In order to support practitioners in\nunderstanding such a complex activity, repository process metrics, like number\nof pull requests and issues, emerged as crucial for evaluating CI/CD workflows\nand guiding informed decision-making. The research community proposed different\nways to visualize these metrics to increase their impact on developers' process\ncomprehension: VR is a promising one. Nevertheless, despite such promising\nresults, the role of VR, especially in educational settings, has received\nlimited research attention. Objective: This study aims to address this gap by\nexploring how VR-based repository metrics visualization can support the\nteaching of process comprehension. Method: The registered report proposes the\nexecution of a controlled experiment where VR and non-VR approaches will be\ncompared, with the final aim to assess whether repository metrics in VR's\nimpact on learning experience and software process comprehension. By immersing\nstudents in an intuitive environment, this research hypothesizes that VR can\nfoster essential analytical skills, thus preparing software engineering\nstudents more effectively for industry requirements and equipping them to\nnavigate complex software development tasks with enhanced comprehension and\ncritical thinking abilities.\n",
  "subjects": [
    "Computer Science/Computers and Society",
    "Computer Science/Software Engineering"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Ir__d8kVGCUhk93EqYveqHNEpD3uMclxB8CJ-ucOy5I",
  "pdfSize": "135678"
}