{"id":"2412.12110","title":"Enhancing the conformal predictability of context-aware recommendation\n  systems by using Deep Autoencoders","authors":"Saloua Zammali, Siddhant Dutta, Sadok Ben Yahia","authorsParsed":[["Zammali","Saloua",""],["Dutta","Siddhant",""],["Yahia","Sadok Ben",""]],"versions":[{"version":"v1","created":"Sat, 30 Nov 2024 18:24:42 GMT"}],"updateDate":"2024-12-18","timestamp":1732991082000,"abstract":"  In the field of Recommender Systems (RS), neural collaborative filtering\nrepresents a significant milestone by combining matrix factorization and deep\nneural networks to achieve promising results. Traditional methods like matrix\nfactorization often rely on linear models, limiting their capability to capture\ncomplex interactions between users, items, and contexts. This limitation\nbecomes particularly evident with high-dimensional datasets due to their\ninability to capture relationships among users, items, and contextual factors.\nUnsupervised learning and dimension reduction tasks utilize autoencoders,\nneural network-based models renowned for their capacity to encode and decode\ndata. Autoencoders learn latent representations of inputs, reducing dataset\nsize while capturing complex patterns and features. In this paper, we introduce\na framework that combines neural contextual matrix factorization with\nautoencoders to predict user ratings for items. We provide a comprehensive\noverview of the framework's design and implementation. To evaluate its\nperformance, we conduct experiments on various real-world datasets and compare\nthe results against state-of-the-art approaches. We also extend the concept of\nconformal prediction to prediction rating and introduce a Conformal Prediction\nRating (CPR). For RS, we define the nonconformity score, a key concept of\nconformal prediction, and demonstrate that it satisfies the exchangeability\nproperty.\n","subjects":["Computer Science/Information Retrieval","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"IEzXyHT4hb4OihAHtGCHAJNR8HSaBDMCha7dYR2O9A8","pdfSize":"181784"}