{
  "id": "2412.08985",
  "title": "Assessing the Robustness of Retrieval-Augmented Generation Systems in\n  K-12 Educational Question Answering with Knowledge Discrepancies",
  "authors": "Tianshi Zheng, Weihan Li, Jiaxin Bai, Weiqi Wang, Yangqiu Song",
  "authorsParsed": [
    [
      "Zheng",
      "Tianshi",
      ""
    ],
    [
      "Li",
      "Weihan",
      ""
    ],
    [
      "Bai",
      "Jiaxin",
      ""
    ],
    [
      "Wang",
      "Weiqi",
      ""
    ],
    [
      "Song",
      "Yangqiu",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 06:38:40 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1733985520000,
  "abstract": "  Retrieval-Augmented Generation (RAG) systems have demonstrated remarkable\npotential as question answering systems in the K-12 Education domain, where\nknowledge is typically queried within the restricted scope of authoritative\ntextbooks. However, the discrepancy between textbooks and the parametric\nknowledge in Large Language Models (LLMs) could undermine the effectiveness of\nRAG systems. To systematically investigate the robustness of RAG systems under\nsuch knowledge discrepancies, we present EduKDQA, a question answering dataset\nthat simulates knowledge discrepancies in real applications by applying\nhypothetical knowledge updates in answers and source documents. EduKDQA\nincludes 3,005 questions covering five subjects, under a comprehensive question\ntypology from the perspective of context utilization and knowledge integration.\nWe conducted extensive experiments on retrieval and question answering\nperformance. We find that most RAG systems suffer from a substantial\nperformance drop in question answering with knowledge discrepancies, while\nquestions that require integration of contextual knowledge and parametric\nknowledge pose a challenge to LLMs.\n",
  "subjects": [
    "Computer Science/Computation and Language"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "iOkU5RiYV__KSQSwqhefKMQTgQB_GJ0gZJu7fExzcSg",
  "pdfSize": "599311"
}