{
  "id": "2412.09982",
  "title": "SplineGS: Robust Motion-Adaptive Spline for Real-Time Dynamic 3D\n  Gaussians from Monocular Video",
  "authors": "Jongmin Park, Minh-Quan Viet Bui, Juan Luis Gonzalez Bello, Jaeho\n  Moon, Jihyong Oh, Munchurl Kim",
  "authorsParsed": [
    [
      "Park",
      "Jongmin",
      ""
    ],
    [
      "Bui",
      "Minh-Quan Viet",
      ""
    ],
    [
      "Bello",
      "Juan Luis Gonzalez",
      ""
    ],
    [
      "Moon",
      "Jaeho",
      ""
    ],
    [
      "Oh",
      "Jihyong",
      ""
    ],
    [
      "Kim",
      "Munchurl",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 09:09:14 GMT"
    },
    {
      "version": "v2",
      "created": "Wed, 18 Dec 2024 03:25:50 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734080954000,
  "abstract": "  Synthesizing novel views from in-the-wild monocular videos is challenging due\nto scene dynamics and the lack of multi-view cues. To address this, we propose\nSplineGS, a COLMAP-free dynamic 3D Gaussian Splatting (3DGS) framework for\nhigh-quality reconstruction and fast rendering from monocular videos. At its\ncore is a novel Motion-Adaptive Spline (MAS) method, which represents\ncontinuous dynamic 3D Gaussian trajectories using cubic Hermite splines with a\nsmall number of control points. For MAS, we introduce a Motion-Adaptive Control\npoints Pruning (MACP) method to model the deformation of each dynamic 3D\nGaussian across varying motions, progressively pruning control points while\nmaintaining dynamic modeling integrity. Additionally, we present a joint\noptimization strategy for camera parameter estimation and 3D Gaussian\nattributes, leveraging photometric and geometric consistency. This eliminates\nthe need for Structure-from-Motion preprocessing and enhances SplineGS's\nrobustness in real-world conditions. Experiments show that SplineGS\nsignificantly outperforms state-of-the-art methods in novel view synthesis\nquality for dynamic scenes from monocular videos, achieving thousands times\nfaster rendering speed.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "jCNY7hGNnEkfPtqdINK9GlsZwygPwngA4HeGULAdv9M",
  "pdfSize": "20946219"
}