{
  "id": "2412.19066",
  "title": "FFCG: Effective and Fast Family Column Generation for Solving\n  Large-Scale Linear Program",
  "authors": "Yi-Xiang Hu, Feng Wu, Shaoang Li, Yifang Zhao, Xiang-Yang Li",
  "authorsParsed": [
    [
      "Hu",
      "Yi-Xiang",
      ""
    ],
    [
      "Wu",
      "Feng",
      ""
    ],
    [
      "Li",
      "Shaoang",
      ""
    ],
    [
      "Zhao",
      "Yifang",
      ""
    ],
    [
      "Li",
      "Xiang-Yang",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 26 Dec 2024 05:35:48 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735191348000,
  "abstract": "  Column Generation (CG) is an effective and iterative algorithm to solve\nlarge-scale linear programs (LP). During each CG iteration, new columns are\nadded to improve the solution of the LP. Typically, CG greedily selects one\ncolumn with the most negative reduced cost, which can be improved by adding\nmore columns at once. However, selecting all columns with negative reduced\ncosts would lead to the addition of redundant columns that do not improve the\nobjective value. Therefore, selecting the appropriate columns to add is still\nan open problem and previous machine-learning-based approaches for CG only add\na constant quantity of columns per iteration due to the state-space explosion\nproblem. To address this, we propose Fast Family Column Generation (FFCG) -- a\nnovel reinforcement-learning-based CG that selects a variable number of columns\nas needed in an iteration. Specifically, we formulate the column selection\nproblem in CG as an MDP and design a reward metric that balances both the\nconvergence speed and the number of redundant columns. In our experiments, FFCG\nconverges faster on the common benchmarks and reduces the number of CG\niterations by 77.1% for Cutting Stock Problem (CSP) and 84.8% for Vehicle\nRouting Problem with Time Windows (VRPTW), and a 71.4% reduction in computing\ntime for CSP and 84.0% for VRPTW on average compared to several\nstate-of-the-art baselines.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Mathematics/Optimization and Control"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "d68ptt5Yn3Z-kWXREGqAkoept43fLliVp08Uc4eHGy4",
  "pdfSize": "2868563"
}