{
  "id": "2412.04065",
  "title": "Space to Policy: Scalable Brick Kiln Detection and Automatic Compliance\n  Monitoring with Geospatial Data",
  "authors": "Zeel B Patel, Rishabh Mondal, Shataxi Dubey, Suraj Jaiswal, Sarath\n  Guttikunda and Nipun Batra",
  "authorsParsed": [
    [
      "Patel",
      "Zeel B",
      ""
    ],
    [
      "Mondal",
      "Rishabh",
      ""
    ],
    [
      "Dubey",
      "Shataxi",
      ""
    ],
    [
      "Jaiswal",
      "Suraj",
      ""
    ],
    [
      "Guttikunda",
      "Sarath",
      ""
    ],
    [
      "Batra",
      "Nipun",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 10:59:54 GMT"
    },
    {
      "version": "v2",
      "created": "Mon, 9 Dec 2024 06:02:36 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733396394000,
  "abstract": "  Air pollution kills 7 million people annually. The brick kiln sector\nsignificantly contributes to economic development but also accounts for 8-14\\%\nof air pollution in India. Policymakers have implemented compliance measures to\nregulate brick kilns. Emission inventories are critical for air quality\nmodeling and source apportionment studies. However, the largely unorganized\nnature of the brick kiln sector necessitates labor-intensive survey efforts for\nmonitoring. Recent efforts by air quality researchers have relied on manual\nannotation of brick kilns using satellite imagery to build emission\ninventories, but this approach lacks scalability. Machine-learning-based object\ndetection methods have shown promise for detecting brick kilns; however,\nprevious studies often rely on costly high-resolution imagery and fail to\nintegrate with governmental policies. In this work, we developed a scalable\nmachine-learning pipeline that detected and classified 30638 brick kilns across\nfive states in the Indo-Gangetic Plain using free, moderate-resolution\nsatellite imagery from Planet Labs. Our detections have a high correlation with\non-ground surveys. We performed automated compliance analysis based on\ngovernment policies. In the Delhi airshed, stricter policy enforcement has led\nto the adoption of efficient brick kiln technologies. This study highlights the\nneed for inclusive policies that balance environmental sustainability with the\nlivelihoods of workers.\n",
  "subjects": [
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "s7_YJ_wGM4g9tJvYorGq8ZXAlVNSQMDdQzIAFKjdhvQ",
  "pdfSize": "17219795"
}