{
  "id": "2412.04275",
  "title": "Scoping review of methodology for aiding generalisability and\n  transportability of clinical prediction models",
  "authors": "Kritchavat Ploddi, Matthew Sperrin, Glen P. Martin, Maurice M.\n  O'Connell",
  "authorsParsed": [
    [
      "Ploddi",
      "Kritchavat",
      ""
    ],
    [
      "Sperrin",
      "Matthew",
      ""
    ],
    [
      "Martin",
      "Glen P.",
      ""
    ],
    [
      "O'Connell",
      "Maurice M.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 15:56:56 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733414216000,
  "abstract": "  Generalisability and transportability of clinical prediction models (CPMs)\nrefer to their ability to maintain predictive performance when applied to new\npopulations. While CPMs may show good generalisability or transportability to a\nspecific new population, it is rare for a CPM to be developed using methods\nthat prioritise good generalisability or transportability. There is an emerging\nliterature of such techniques; therefore, this scoping review aims to summarise\nthe main methodological approaches, assumptions, advantages, disadvantages and\nfuture development of methodology aiding the generalisability/transportability.\nRelevant articles were systematically searched from MEDLINE, Embase, medRxiv,\narxiv databases until September 2023 using a predefined set of search terms.\nExtracted information included methodology description, assumptions, applied\nexamples, advantages and disadvantages. The searches found 1,761 articles; 172\nwere retained for full text screening; 18 were finally included. We categorised\nthe methodologies according to whether they were data-driven or\nknowledge-driven, and whether are specifically tailored for target population.\nData-driven approaches range from data augmentation to ensemble methods and\ndensity ratio weighting, while knowledge-driven strategies rely on causal\nmethodology. Future research could focus on comparison of such methodologies on\nsimulated and real datasets to identify their strengths specific applicability,\nas well as synthesising these approaches for enhancing their practical\nusefulness.\n",
  "subjects": [
    "Statistics/Methodology"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "UFu-OWf8IQad4c4Y26xSzOZtykg-VOP7YwTpULNDk8I",
  "pdfSize": "683493"
}