{"id":"2412.05081","title":"Spinal ligaments detection on vertebrae meshes using registration and 3D\n  edge detection","authors":"Ivanna Kramer, Lara Blomenkamp, Kevin Weirauch, Sabine Bauer and\n  Dietrich Paulus","authorsParsed":[["Kramer","Ivanna",""],["Blomenkamp","Lara",""],["Weirauch","Kevin",""],["Bauer","Sabine",""],["Paulus","Dietrich",""]],"versions":[{"version":"v1","created":"Fri, 6 Dec 2024 14:39:06 GMT"}],"updateDate":"2024-12-09","timestamp":1733495946000,"abstract":"  Spinal ligaments are crucial elements in the complex biomechanical simulation\nmodels as they transfer forces on the bony structure, guide and limit movements\nand stabilize the spine. The spinal ligaments encompass seven major groups\nbeing responsible for maintaining functional interrelationships among the other\nspinal components. Determination of the ligament origin and insertion points on\nthe 3D vertebrae models is an essential step in building accurate and complex\nspine biomechanical models. In our paper, we propose a pipeline that is able to\ndetect 66 spinal ligament attachment points by using a step-wise approach. Our\nmethod incorporates a fast vertebra registration that strategically extracts\nonly 15 3D points to compute the transformation, and edge detection for a\nprecise projection of the registered ligaments onto any given patient-specific\nvertebra model. Our method shows high accuracy, particularly in identifying\nlandmarks on the anterior part of the vertebra with an average distance of 2.24\nmm for anterior longitudinal ligament and 1.26 mm for posterior longitudinal\nligament landmarks. The landmark detection requires approximately 3.0 seconds\nper vertebra, providing a substantial improvement over existing methods.\nClinical relevance: using the proposed method, the required landmarks that\nrepresent origin and insertion points for forces in the biomechanical spine\nmodels can be localized automatically in an accurate and time-efficient manner.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"ez91ZcAAvr_zcghz21IdZX3Q3Dxo_JosNCwe7Bfqvjc","pdfSize":"1054691"}