{
  "id": "2412.14355",
  "title": "Enabling Realtime Reinforcement Learning at Scale with Staggered\n  Asynchronous Inference",
  "authors": "Matthew Riemer, Gopeshh Subbaraj, Glen Berseth, Irina Rish",
  "authorsParsed": [
    [
      "Riemer",
      "Matthew",
      ""
    ],
    [
      "Subbaraj",
      "Gopeshh",
      ""
    ],
    [
      "Berseth",
      "Glen",
      ""
    ],
    [
      "Rish",
      "Irina",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 21:43:40 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734558220000,
  "abstract": "  Realtime environments change even as agents perform action inference and\nlearning, thus requiring high interaction frequencies to effectively minimize\nregret. However, recent advances in machine learning involve larger neural\nnetworks with longer inference times, raising questions about their\napplicability in realtime systems where reaction time is crucial. We present an\nanalysis of lower bounds on regret in realtime reinforcement learning (RL)\nenvironments to show that minimizing long-term regret is generally impossible\nwithin the typical sequential interaction and learning paradigm, but often\nbecomes possible when sufficient asynchronous compute is available. We propose\nnovel algorithms for staggering asynchronous inference processes to ensure that\nactions are taken at consistent time intervals, and demonstrate that use of\nmodels with high action inference times is only constrained by the\nenvironment's effective stochasticity over the inference horizon, and not by\naction frequency. Our analysis shows that the number of inference processes\nneeded scales linearly with increasing inference times while enabling use of\nmodels that are multiple orders of magnitude larger than existing approaches\nwhen learning from a realtime simulation of Game Boy games such as Pok\\'emon\nand Tetris.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "_bV9JnpRwmTqTsgxD3woS4RNBNdzl3jWWGcyo5-q4pY",
  "pdfSize": "2807777"
}