{"id":"2412.12155","title":"Adapting Unsigned Graph Neural Networks for Signed Graphs: A Few-Shot\n  Prompt Tuning Approach","authors":"Zian Zhai, Sima Qing, Xiaoyang Wang, Wenjie Zhang","authorsParsed":[["Zhai","Zian",""],["Qing","Sima",""],["Wang","Xiaoyang",""],["Zhang","Wenjie",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 09:22:46 GMT"}],"updateDate":"2024-12-18","timestamp":1733908966000,"abstract":"  Signed Graph Neural Networks (SGNNs) are powerful tools for signed graph\nrepresentation learning but struggle with limited generalization and heavy\ndependence on labeled data. While recent advancements in \"graph pre-training\nand prompt tuning\" have reduced label dependence in Graph Neural Networks\n(GNNs) and improved their generalization abilities by leveraging pre-training\nknowledge, these efforts have focused exclusively on unsigned graphs. The\nscarcity of publicly available signed graph datasets makes it essential to\ntransfer knowledge from unsigned graphs to signed graph tasks. However, this\ntransfer introduces significant challenges due to the graph-level and\ntask-level divergences between the pre-training and downstream phases. To\naddress these challenges, we propose Signed Graph Prompt Tuning (SGPT) in this\npaper. Specifically, SGPT employs a graph template and a semantic prompt to\nsegregate mixed link semantics in the signed graph and then adaptively\nintegrate the distinctive semantic information according to the needs of\ndownstream tasks, thereby unifying the pre-training and downstream graphs.\nAdditionally, SGPT utilizes a task template and a feature prompt to reformulate\nthe downstream signed graph tasks, aligning them with pre-training tasks to\nensure a unified optimization objective and consistent feature space across\ntasks. Finally, extensive experiments are conducted on popular signed graph\ndatasets, demonstrating the superiority of SGPT over state-of-the-art methods.\n","subjects":["Computer Science/Machine Learning","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"f7KGIM2LY5s-IXw5wTHUGFrrBm3DqQRxvaFORjMS6GQ","pdfSize":"1471729"}