{
  "id": "2412.04495",
  "title": "Artificial intelligence and cybersecurity in banking sector:\n  opportunities and risks",
  "authors": "Ana Kovacevic, Sonja D. Radenkovic and Dragana Nikolic",
  "authorsParsed": [
    [
      "Kovacevic",
      "Ana",
      ""
    ],
    [
      "Radenkovic",
      "Sonja D.",
      ""
    ],
    [
      "Nikolic",
      "Dragana",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 28 Nov 2024 22:09:55 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1732831795000,
  "abstract": "  The rapid advancements in artificial intelligence (AI) have presented new\nopportunities for enhancing efficiency and economic competitiveness across\nvarious industries, espcially in banking. Machine learning (ML), as a subset of\nartificial intelligence, enables systems to adapt and learn from vast datasets,\nrevolutionizing decision-making processes, fraud detection, and customer\nservice automation. However, these innovations also introduce new challenges,\nparticularly in the realm of cybersecurity. Adversarial attacks, such as data\npoisoning and evasion attacks, represent critical threats to machine learning\nmodels, exploiting vulnerabilities to manipulate outcomes or compromise\nsensitive information. Furthermore, this study highlights the dual-use nature\nof AI tools, which can be used by malicious users. To address these challenges,\nthe paper emphasizes the importance of developing machine learning models with\nkey characteristics such as security, trust, resilience and robustness. These\nfeatures are essential to mitigating risks and ensuring the secure deployment\nof AI technologies in banking sectors, where the protection of financial data\nis paramount. The findings underscore the urgent need for enhanced\ncybersecurity frameworks and continuous improvements in defensive mechanisms.\nBy exploring both opportunities and risks, this paper aims to guide the\nresponsible integration of AI in the banking sector, paving the way for\ninnovation while safeguarding against emerging threats.\n",
  "subjects": [
    "Computer Science/Cryptography and Security"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "NRC4eX5afqwhIMY10bCJdYZsCCOja8AUv5qe5y553k8",
  "pdfSize": "390269"
}