{"id":"2412.01686","title":"Direct linearisation of the non-commutative Kadomtsev-Petviashvili\n  equations","authors":"Gordon Blower and Simon J.A. Malham","authorsParsed":[["Blower","Gordon",""],["Malham","Simon J. A.",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 16:31:45 GMT"},{"version":"v2","created":"Thu, 5 Dec 2024 12:56:49 GMT"}],"updateDate":"2024-12-06","timestamp":1733157105000,"abstract":"  We prove that the non-commutative Kadomtsev-Petviashvili (KP) equation and a\n`lifted' modified Kadomtsev-Petviashvili (mKP) equation are directly\nlinearisable, and thus integrable in this sense. There are several versions of\nthe non-commutative mKP equations, including the two-dimensional\ngeneralisations of the non-commutative modified Korteweg-de Vries (mKdV)\nequation and its alternative form (amKdV). Herein we derive the `lifted' mKP\nequation, whose solutions are the natural two-dimensional extension of those\nfor the non-commutative mKdV equation derived in Blower and Malham. We also\npresent the log-potential form of the mKP equation, from which all of these\nnon-commutative mKP equations can be derived. To achieve the integrability\nresults, we construct the pre-Poppe algebra that underlies the KP and mKP\nequations. This is a non-commutative polynomial algebra over the real line\ngenerated by the solution (and its partial derivatives) to the linearised form\nof the KP and mKP equations. The algebra is endowed with a pre-Poppe product,\nbased on the product rule for semi-additive operators pioneered by Poppe for\nthe commutative KP equation. Integrability corresponds to establishing a\nparticular polynomial expansion in the respective pre-Poppe algebra. We also\npresent numerical simulations of soliton-like interactions for the\nnon-commutative KP equation.\n","subjects":["Nonlinear Sciences/Exactly Solvable and Integrable Systems","Physics/Mathematical Physics","Mathematics/Analysis of PDEs","Mathematics/Mathematical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"-2nU5b7l04WBCtYLcW7b16hI5IxOzoqGICQ9TXGXmCA","pdfSize":"2167147"}