{
  "id": "2412.06697",
  "title": "Inelastic H + H$^+_3$ Collision rates and their impact in the\n  determination of the excitation temperature of H$^+_3$",
  "authors": "Daniel Felix-Gonzalez, Pablo del Mazo-Sevillano, Alfredo Aguado,\n  Octavio Roncero, Jacques Le Bourlot, Evelyne Roueff, Franck Le Petit, and\n  Emeric Bron",
  "authorsParsed": [
    [
      "Felix-Gonzalez",
      "Daniel",
      ""
    ],
    [
      "del Mazo-Sevillano",
      "Pablo",
      ""
    ],
    [
      "Aguado",
      "Alfredo",
      ""
    ],
    [
      "Roncero",
      "Octavio",
      ""
    ],
    [
      "Bourlot",
      "Jacques Le",
      ""
    ],
    [
      "Roueff",
      "Evelyne",
      ""
    ],
    [
      "Petit",
      "Franck Le",
      ""
    ],
    [
      "Bron",
      "Emeric",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 17:44:29 GMT"
    }
  ],
  "updateDate": "2025-01-15",
  "timestamp": 1733766269000,
  "abstract": "  Context. In dffuse interstellar clouds the excitation temperature derived\nfrom the lowest levels of H$^+_3$ is systematically lower than that derived\nfrom H2. The differences may be attributed to the lack of state-specific\nformation and destruction rates of H$^+_3$ needed to thermalize the two\nspecies. Aims. In this work, we want to check the role of rotational excitation\ncollisions of H$^+_3$ with atomic hydrogen on its excitation temperature.\nMethods. A time independent close-coupling method is used to calculate the\nstate-to-state rate coefficients, using a very accurate and full dimensional\npotential energy surface recently developed for H$^+_4$. A symmetric top\napproach is used to describe a frozen H$^+_3$ as equilateral triangle. Results.\nRotational excitation collision rate coefficients of H$^+_3$ with atomic\nHydrogen have been derived in a temperature range appropriate to diffuse\ninterstellar conditions up to $(J; K; \\pm) = (7; 6; +)$ and $(J; K; \\pm) = (6;\n4; +)$ for its ortho and para forms. This allows to have a consistent set of\ncollisional excitation rate coefficients and to improve the previous study\nwhere these contributions were speculated. Conclusions. The new state-specific\ninelastic H$^+_3$ + H rate coeffcients yield differences up to 20% in the\nexcitation temperature, and their impact increases with decreasing molecular\nfraction. We also confirm the impact of chemical state-to-state destruction\nreactions in the excitation balance of H$^+_3$ , and that reactive H + H$^+_3$\ncollisions are also needed to account for possible further ortho to para\ntransitions\n",
  "subjects": [
    "Astrophysics/Astrophysics of Galaxies",
    "Astrophysics/Solar and Stellar Astrophysics",
    "Physics/Chemical Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Ro8rZeyhotJddfW-gccPZwWQ_GG-OxBMH8gmRbx661c",
  "pdfSize": "612137"
}