{
  "id": "2412.15306",
  "title": "MIETT: Multi-Instance Encrypted Traffic Transformer for Encrypted\n  Traffic Classification",
  "authors": "Xu-Yang Chen, Lu Han, De-Chuan Zhan, Han-Jia Ye",
  "authorsParsed": [
    [
      "Chen",
      "Xu-Yang",
      ""
    ],
    [
      "Han",
      "Lu",
      ""
    ],
    [
      "Zhan",
      "De-Chuan",
      ""
    ],
    [
      "Ye",
      "Han-Jia",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 12:52:53 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734612773000,
  "abstract": "  Network traffic includes data transmitted across a network, such as web\nbrowsing and file transfers, and is organized into packets (small units of\ndata) and flows (sequences of packets exchanged between two endpoints).\nClassifying encrypted traffic is essential for detecting security threats and\noptimizing network management. Recent advancements have highlighted the\nsuperiority of foundation models in this task, particularly for their ability\nto leverage large amounts of unlabeled data and demonstrate strong\ngeneralization to unseen data. However, existing methods that focus on\ntoken-level relationships fail to capture broader flow patterns, as tokens,\ndefined as sequences of hexadecimal digits, typically carry limited semantic\ninformation in encrypted traffic. These flow patterns, which are crucial for\ntraffic classification, arise from the interactions between packets within a\nflow, not just their internal structure. To address this limitation, we propose\na Multi-Instance Encrypted Traffic Transformer (MIETT), which adopts a\nmulti-instance approach where each packet is treated as a distinct instance\nwithin a larger bag representing the entire flow. This enables the model to\ncapture both token-level and packet-level relationships more effectively\nthrough Two-Level Attention (TLA) layers, improving the model's ability to\nlearn complex packet dynamics and flow patterns. We further enhance the model's\nunderstanding of temporal and flow-specific dynamics by introducing two novel\npre-training tasks: Packet Relative Position Prediction (PRPP) and Flow\nContrastive Learning (FCL). After fine-tuning, MIETT achieves state-of-the-art\n(SOTA) results across five datasets, demonstrating its effectiveness in\nclassifying encrypted traffic and understanding complex network behaviors. Code\nis available at \\url{https://github.com/Secilia-Cxy/MIETT}.\n",
  "subjects": [
    "Computer Science/Cryptography and Security",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "wtNHeXufG2j5yXZODmoQ1DnOBQNCvGCOoEPY94cVwEE",
  "pdfSize": "1910865"
}