{
  "id": "2412.05675",
  "title": "M$^3$PC: Test-time Model Predictive Control for Pretrained Masked\n  Trajectory Model",
  "authors": "Kehan Wen, Yutong Hu, Yao Mu, Lei Ke",
  "authorsParsed": [
    [
      "Wen",
      "Kehan",
      ""
    ],
    [
      "Hu",
      "Yutong",
      ""
    ],
    [
      "Mu",
      "Yao",
      ""
    ],
    [
      "Ke",
      "Lei",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 7 Dec 2024 14:44:22 GMT"
    },
    {
      "version": "v2",
      "created": "Thu, 6 Feb 2025 13:39:31 GMT"
    }
  ],
  "updateDate": "2025-02-07",
  "timestamp": 1733582662000,
  "abstract": "  Recent work in Offline Reinforcement Learning (RL) has shown that a unified\nTransformer trained under a masked auto-encoding objective can effectively\ncapture the relationships between different modalities (e.g., states, actions,\nrewards) within given trajectory datasets. However, this information has not\nbeen fully exploited during the inference phase, where the agent needs to\ngenerate an optimal policy instead of just reconstructing masked components\nfrom unmasked ones. Given that a pretrained trajectory model can act as both a\nPolicy Model and a World Model with appropriate mask patterns, we propose using\nModel Predictive Control (MPC) at test time to leverage the model's own\npredictive capability to guide its action selection. Empirical results on D4RL\nand RoboMimic show that our inference-phase MPC significantly improves the\ndecision-making performance of a pretrained trajectory model without any\nadditional parameter training. Furthermore, our framework can be adapted to\nOffline to Online (O2O) RL and Goal Reaching RL, resulting in more substantial\nperformance gains when an additional online interaction budget is provided, and\nbetter generalization capabilities when different task targets are specified.\nCode is available: https://github.com/wkh923/m3pc.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Robotics",
    "Computer Science/Systems and Control",
    "Electrical Engineering and Systems Science/Systems and Control"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "hjV0RKrVfB41NLYhJWCcJFbrCRVZb6sCaZVBdv97PmA",
  "pdfSize": "7280376"
}