{
  "id": "2412.14572",
  "title": "Accelerated Patient-Specific Calibration via Differentiable Hemodynamics\n  Simulations",
  "authors": "Diego Renner, Georgios Kissas",
  "authorsParsed": [
    [
      "Renner",
      "Diego",
      ""
    ],
    [
      "Kissas",
      "Georgios",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 06:42:57 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734590577000,
  "abstract": "  One of the goals of personalized medicine is to tailor diagnostics to\nindividual patients. Diagnostics are performed in practice by measuring\nquantities, called biomarkers, that indicate the existence and progress of a\ndisease. In common cardiovascular diseases, such as hypertension, biomarkers\nthat are closely related to the clinical representation of a patient can be\npredicted using computational models. Personalizing computational models\ntranslates to considering patient-specific flow conditions, for example, the\ncompliance of blood vessels that cannot be a priori known and quantities such\nas the patient geometry that can be measured using imaging. Therefore, a\npatient is identified by a set of measurable and nonmeasurable parameters\nneeded to well-define a computational model; else, the computational model is\nnot personalized, meaning it is prone to large prediction errors. Therefore, to\npersonalize a computational model, sufficient information needs to be extracted\nfrom the data. The current methods by which this is done are either\ninefficient, due to relying on slow-converging optimization methods, or hard to\ninterpret, due to using `black box` deep-learning algorithms. We propose a\npersonalized diagnostic procedure based on a differentiable 0D-1D Navier-Stokes\nreduced order model solver and fast parameter inference methods that take\nadvantage of gradients through the solver. By providing a faster method for\nperforming parameter inference and sensitivity analysis through\ndifferentiability while maintaining the interpretability of well-understood\nmathematical models and numerical methods, the best of both worlds is combined.\nThe performance of the proposed solver is validated against a well-established\nprocess on different geometries, and different parameter inference processes\nare successfully performed.\n",
  "subjects": [
    "Physics/Medical Physics",
    "Computer Science/Machine Learning",
    "Computer Science/Mathematical Software",
    "Physics/Computational Physics",
    "Quantitative Biology/Quantitative Methods"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "OuVomssfPH_xOxyrAJJP27T9D4YMjaywavS9zszmrWo",
  "pdfSize": "1328114"
}