{
  "id": "2412.01746",
  "title": "Strong gravitational lensing with upcoming wide-field radio surveys",
  "authors": "Samuel McCarty and Liam Connor",
  "authorsParsed": [
    [
      "McCarty",
      "Samuel",
      ""
    ],
    [
      "Connor",
      "Liam",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 17:42:45 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733161365000,
  "abstract": "  The number of strong lensing systems will soon increase by orders of\nmagnitude thanks to sensitive, wide-field optical and infrared imaging surveys\nsuch as Euclid, Rubin-LSST, and Roman. A dramatic increase in strong lenses\nwill also occur at radio wavelengths. The 2000-antenna Deep Synoptic Array\n(DSA-2000) will detect over $10^9$ continuum sources in the Northern Hemisphere\nwith a high mean redshift ($\\langle z_s \\rangle \\approx2$) and the Square\nKilometer Array (SKA) will observe a large sample of extragalactic sources in\nthe South with sub-arcsecond resolution. We forecast lensing rates, finding\nthat the DSA-2000 will discover $\\mathcal{O}(10^5)$ strongly lensed systems,\nmany of which will be galaxy group and cluster lenses. We propose strategies\nfor strong lensing discovery in the limit where the Einstein radii are\ncomparable to the PSF angular scale, taking advantage of modern computer vision\ntechniques and multi-survey data. We also forecast synergies with optical and\ninfrared surveys, which will provide redshifts as well as multiwavelength\ninformation about the lens systems. Finally, we describe applications of radio\nstrong lensing systems, including time-delay cosmography with transient and\nvariable sources. We find that $\\sim$100 time-variable flat-spectrum AGN\ndiscovered by the DSA-2000 could be used to constrain $H_0$ at the percent\nlevel with the appropriate follow-up.\n",
  "subjects": [
    "Astrophysics/Cosmology and Nongalactic Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "2Jma_BnSf379bhzFeEOtZ6y3D4LnfZxMdl0_omOlCX8",
  "pdfSize": "1107695"
}