{"id":"2412.03978","title":"Revealing Physical Mechanisms of Pattern Formation and Switching in\n  Ecosystems via Nonequilibrium Landscape and Flux","authors":"Jie Su, Wei Wu, Denis Patterson, Simon Asher Levin, and Jin Wang","authorsParsed":[["Su","Jie",""],["Wu","Wei",""],["Patterson","Denis",""],["Levin","Simon Asher",""],["Wang","Jin",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 08:53:33 GMT"},{"version":"v2","created":"Mon, 16 Dec 2024 09:35:09 GMT"}],"updateDate":"2024-12-17","timestamp":1733388813000,"abstract":"  Spatial patterns are widely observed in numerous nonequilibrium natural\nsystems, often undergoing complex transitions and bifurcations, thereby\nexhibiting significant importance in many physical and biological systems such\nas embryonic development, ecosystem desertification, and turbulence. However,\nhow spatial pattern formation emerges and how the spatial pattern switches are\nnot fully understood. Here, we developed a landscape-flux field theory via the\nspatial mode expansion method to uncover the underlying physical mechanism of\nthe pattern formation and switching. We identified the landscape and flux field\nas the driving force for spatial dynamics and applied this theory to the\ncritical transitions between spatial vegetation patterns in semi-arid\necosystems, revealing that the nonequilibrium flux drives the switchings of\nspatial patterns. We uncovered how the pattern switching emerges through the\noptimal pathways and how fast this occurs via the speed of pattern switching.\nFurthermore, both the averaged flux and the entropy production rate exhibit\npeaks near pattern switching boundaries, revealing dynamical and\nthermodynamical origins for pattern transitions, and further offering early\nwarning signals for anticipating spatial pattern switching. Our work thus\nreveals physical mechanisms on spatial pattern-switching in semi-arid\necosystems and, more generally, introduces a useful approach for quantifying\nspatial pattern switching in nonequilibrium systems, which further offers\npractical applications such as early warning signals for critical transitions\nof spatial patterns.\n","subjects":["Physics/Biological Physics","Nonlinear Sciences/Pattern Formation and Solitons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"NI44IPVr619UF_pVm1Yaa-HxMEGYs1phsq7-rED7Ypk","pdfSize":"11782554"}