{"id":"2412.04232","title":"Intent-based Meta-Scheduling in Programmable Networks: A Research Agenda","authors":"Nanjangud C. Narendra, Ronak Kanthaliya, Venkatareddy Akumalla","authorsParsed":[["Narendra","Nanjangud C.",""],["Kanthaliya","Ronak",""],["Akumalla","Venkatareddy",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 15:09:21 GMT"},{"version":"v2","created":"Fri, 6 Dec 2024 06:35:41 GMT"},{"version":"v3","created":"Sun, 22 Dec 2024 15:29:02 GMT"}],"updateDate":"2024-12-24","timestamp":1733411361000,"abstract":"  The emergence and growth of 5G and beyond 5G (B5G) networks has brought about\nthe rise of so-called ''programmable'' networks, i.e., networks whose\noperational requirements are so stringent that they can only be met in an\nautomated manner, with minimal/no human involvement. Any requirements on such a\nnetwork would need to be formally specified via intents, which can represent\nuser requirements in a formal yet understandable manner. Meeting the user\nrequirements via intents would necessitate the rapid implementation of resource\nallocation and scheduling in the network. Also, given the expected size and\ngeographical distribution of programmable networks, multiple resource\nscheduling implementations would need to be implemented at the same time. This\nwould necessitate the use of a meta-scheduler that can coordinate the various\nschedulers and dynamically ensure optimal resource scheduling across the\nnetwork.\n  To that end, in this position paper, we propose a research agenda for\nmodeling, implementation, and inclusion of intent-based dynamic meta-scheduling\nin programmable networks. Our research agenda will be built on active\ninference, a type of causal inference. Active inference provides some level of\nautonomy to each scheduler while the meta-scheduler takes care of overall\nintent fulfillment. Our research agenda will comprise a strawman architecture\nfor meta-scheduling and a set of research questions that need to be addressed\nto make intent-based dynamic meta-scheduling a reality.\n","subjects":["Computer Science/Networking and Internet Architecture"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"6Bnu4vl612L89qvSF42MLtk2pdr3HxjJdFLa7a4yKHY","pdfSize":"1820393"}