{
  "id": "2412.17834",
  "title": "EEG-GMACN: Interpretable EEG Graph Mutual Attention Convolutional\n  Network",
  "authors": "Haili Ye and Stephan Goerttler and Fei He",
  "authorsParsed": [
    [
      "Ye",
      "Haili",
      ""
    ],
    [
      "Goerttler",
      "Stephan",
      ""
    ],
    [
      "He",
      "Fei",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 15 Dec 2024 13:37:20 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1734269840000,
  "abstract": "  Electroencephalogram (EEG) is a valuable technique to record brain electrical\nactivity through electrodes placed on the scalp. Analyzing EEG signals\ncontributes to the understanding of neurological conditions and developing\nbrain-computer interface. Graph Signal Processing (GSP) has emerged as a\npromising method for EEG spatial-temporal analysis, by further considering the\ntopological relationships between electrodes. However, existing GSP studies\nlack interpretability of electrode importance and the credibility of prediction\nconfidence. This work proposes an EEG Graph Mutual Attention Convolutional\nNetwork (EEG-GMACN), by introducing an 'Inverse Graph Weight Module' to output\ninterpretable electrode graph weights, enhancing the clinical credibility and\ninterpretability of EEG classification results. Additionally, we incorporate a\nmutual attention mechanism module into the model to improve its capability to\ndistinguish critical electrodes and introduce credibility calibration to assess\nthe uncertainty of prediction results. This study enhances the transparency and\neffectiveness of EEG analysis, paving the way for its widespread use in\nclinical and neuroscience research.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Signal Processing",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "8sl95k97XsgtY0Y1wL99aFYVYoga7h4GC_WtoB-RAY8",
  "pdfSize": "463926"
}