{"id":"2412.04091","title":"Machine learning enhanced multi-particle tracking in solid fuel\n  combustion","authors":"Haowen Chen, Yuhang Li, Benjamin B\\\"ohm, Tao Li","authorsParsed":[["Chen","Haowen",""],["Li","Yuhang",""],["Böhm","Benjamin",""],["Li","Tao",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 11:55:59 GMT"}],"updateDate":"2024-12-06","timestamp":1733399759000,"abstract":"  Particle velocimetry is essential in solid fuel combustion studies, however,\nthe accurate detection and tracking of particles in high Particle Number\nDensity (PND) combustion scenario remain challenging. The current study\nadvances the machine-learning approaches for precise velocity measurements of\nsolid particles. For this, laser imaging experiments were performed for\nhigh-volatile bituminous coal particles burning in a laminar flow reactor.\nParticle positions were imaged using time-resolved Mie scattering. Various\ndetection methods, including conventional blob detection and Machine Learning\n(ML) based You Only Look Once (YOLO) and Realtime Detection Transformer\n(RT-DETR) were employed and bench marked.~Particle tracking was performed using\nthe Simple Online Realtime Tracking (SORT) algorithm. The results demonstrated\nthe capability of machine learning models trained on low-PND data for\nprediction of high-PND data. Slicing Aided Hyper Inference (SAHI) algorithm is\nimportant for the better performance of the used models. By evaluating the\nvelocity statistics, it is found that the mean particle velocity decreases with\nincreasing PND, primarily due to stronger particle interactions. The particle\ndynamics are closely related to the position of combustion zone observed in the\nprevious study. Thus, PND is considered as the dominant factor for the particle\ngroup combustion behavior of high-volatile solid fuels.\n","subjects":["Physics/Applied Physics","Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"MWIJvFKlV7_n0VI36esZ4DMWB7KQ7bk9fD9IFUhj-Os","pdfSize":"3189882"}