{
  "id": "2412.18813",
  "title": "Barycentric rational function approximation made simple: A fast analytic\n  continuation method for Matsubara Green's functions",
  "authors": "Li Huang and Changming Yue",
  "authorsParsed": [
    [
      "Huang",
      "Li",
      ""
    ],
    [
      "Yue",
      "Changming",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 25 Dec 2024 07:49:46 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735112986000,
  "abstract": "  Analytic continuation is a critical step in quantum many-body computations,\nconnecting imaginary-time or Matsubara Green's functions with real-frequency\nspectral functions, which can be directly compared to experimental results.\nHowever, due to the ill-posed nature of the analytic continuation problems,\nthey have not been completely solved so far. In this paper, we suggest a\nsimple, yet highly efficient method for analytic continuations of Matsubara\nGreen's functions. This method takes advantage of barycentric rational\nfunctions to directly interpolate Matsubara Green's functions. At first, the\nnodes and weights of the barycentric rational functions are determined by the\nadaptive Antoulas-Anderson algorithm, avoiding reliance on the non-convex\noptimization. Next, the retarded Green's functions and the relatively spectral\nfunctions are evaluated by the resulting interpolants. We systematically\nexplore the performance of this method through a series of toy models and\nrealistic examples, comparing its accuracy and efficiency with other popular\nmethods, such as the maximum entropy method. The benchmark results demonstrate\nthat the new method can accurately reproduce not only continuous but also\ndiscrete spectral functions, irrespective of their positive definiteness. It\nworks well even in the presence of intermediate noise, and outperforms\ntraditional analytic continuation methods in computational speed. We believe\nthat this method should stand out for its robustness against noise, broad\napplicability, high precision, and ultra efficiency, offering a promising\nalternative to the maximum entropy method.\n",
  "subjects": [
    "Condensed Matter/Strongly Correlated Electrons"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "HJheO4xNIDVlQzv69nGPl-3qOW-kdbivBW9J1zzTKhA",
  "pdfSize": "1102504"
}