{
  "id": "2412.16791",
  "title": "Enhancing web traffic attacks identification through ensemble methods\n  and feature selection",
  "authors": "Daniel Urda, Branly Mart\\'inez, Nu\\~no Basurto, Meelis Kull, \\'Angel\n  Arroyo, \\'Alvaro Herrero",
  "authorsParsed": [
    [
      "Urda",
      "Daniel",
      ""
    ],
    [
      "Martínez",
      "Branly",
      ""
    ],
    [
      "Basurto",
      "Nuño",
      ""
    ],
    [
      "Kull",
      "Meelis",
      ""
    ],
    [
      "Arroyo",
      "Ángel",
      ""
    ],
    [
      "Herrero",
      "Álvaro",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 21 Dec 2024 22:13:30 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734819210000,
  "abstract": "  Websites, as essential digital assets, are highly vulnerable to cyberattacks\nbecause of their high traffic volume and the significant impact of breaches.\nThis study aims to enhance the identification of web traffic attacks by\nleveraging machine learning techniques. A methodology was proposed to extract\nrelevant features from HTTP traces using the CSIC2010 v2 dataset, which\nsimulates e-commerce web traffic. Ensemble methods, such as Random Forest and\nExtreme Gradient Boosting, were employed and compared against baseline\nclassifiers, including k-nearest Neighbor, LASSO, and Support Vector Machines.\nThe results demonstrate that the ensemble methods outperform baseline\nclassifiers by approximately 20% in predictive accuracy, achieving an Area\nUnder the ROC Curve (AUC) of 0.989. Feature selection methods such as\nInformation Gain, LASSO, and Random Forest further enhance the robustness of\nthese models. This study highlights the efficacy of ensemble models in\nimproving attack detection while minimizing performance variability, offering a\npractical framework for securing web traffic in diverse application contexts.\n",
  "subjects": [
    "Computer Science/Cryptography and Security",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "PrgI7ETUwmySY4ouAsFwAjoLAEwx-ivEBQl2TkheJoE",
  "pdfSize": "783470"
}