{
  "id": "2412.03643",
  "title": "Direct Deflection of Millicharged Radiation",
  "authors": "Asher Berlin, Surjeet Rajendran, Harikrishnan Ramani, Erwin H. Tanin",
  "authorsParsed": [
    [
      "Berlin",
      "Asher",
      ""
    ],
    [
      "Rajendran",
      "Surjeet",
      ""
    ],
    [
      "Ramani",
      "Harikrishnan",
      ""
    ],
    [
      "Tanin",
      "Erwin H.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 19:00:00 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733338800000,
  "abstract": "  Millicharged particles are generic in theories of dark sectors. A cosmic or\nlocal abundance of them may be produced by the early universe, stellar\nenvironments, or the decay or annihilation of dark matter/dark energy.\nFurthermore, if such particles are light, these production channels result in a\nbackground of millicharged radiation. We show that light-shining-through-wall\nexperiments employing superconducting RF cavities can also be used as ``direct\ndeflection\" experiments to search for this relativistic background. The\nmillicharged plasma is first subjected to an oscillating electromagnetic field\nof a driven cavity, which causes charge separation in the form of charge and\ncurrent perturbations. In turn, these perturbations can propagate outwards and\nresonantly excite electromagnetic fields in a well-shielded cavity placed\nnearby, enabling detection. We estimate that future versions of the existing\nDark SRF experiment can probe orders of magnitude of currently unexplored\nparameter space, including millicharges produced from the Sun, the cosmic\nneutrino background, or other mechanisms that generate a thermal abundance with\nenergy density as small as $\\sim 10^{-4}$ that of the cosmic microwave\nbackground.\n",
  "subjects": [
    "Physics/High Energy Physics - Phenomenology",
    "Astrophysics/Cosmology and Nongalactic Astrophysics",
    "Physics/High Energy Physics - Experiment"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "wUale6mDZuYEfpiTuYB70GvQIO4YtZq6MYMN_ZxlOUg",
  "pdfSize": "1653706"
}