{
  "id": "2412.14030",
  "title": "Machine learning in wastewater treatment: insights from modelling a\n  pilot denitrification reactor",
  "authors": "Eivind B{\\o}hn, S{\\o}lve Eidnes and Kjell Rune Jonassen",
  "authorsParsed": [
    [
      "Bøhn",
      "Eivind",
      ""
    ],
    [
      "Eidnes",
      "Sølve",
      ""
    ],
    [
      "Jonassen",
      "Kjell Rune",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 16:49:23 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734540563000,
  "abstract": "  Wastewater treatment plants are increasingly recognized as promising\ncandidates for machine learning applications, due to their societal importance\nand high availability of data. However, their varied designs, operational\nconditions, and influent characteristics hinder straightforward automation. In\nthis study, we use data from a pilot reactor at the Veas treatment facility in\nNorway to explore how machine learning can be used to optimize biological\nnitrate ($\\mathrm{NO_3^-}$) reduction to molecular nitrogen ($\\mathrm{N_2}$) in\nthe biogeochemical process known as \\textit{denitrification}. Rather than\nfocusing solely on predictive accuracy, our approach prioritizes understanding\nthe foundational requirements for effective data-driven modelling of wastewater\ntreatment. Specifically, we aim to identify which process parameters are most\ncritical, the necessary data quantity and quality, how to structure data\neffectively, and what properties are required by the models. We find that\nnonlinear models perform best on the training and validation data sets,\nindicating nonlinear relationships to be learned, but linear models transfer\nbetter to the unseen test data, which comes later in time. The variable\nmeasuring the water temperature has a particularly detrimental effect on the\nmodels, owing to a significant change in distributions between training and\ntest data. We therefore conclude that multiple years of data is necessary to\nlearn robust machine learning models. By addressing foundational elements,\nparticularly in the context of the climatic variability faced by northern\nregions, this work lays the groundwork for a more structured and tailored\napproach to machine learning for wastewater treatment. We share publicly both\nthe data and code used to produce the results in the paper.\n",
  "subjects": [
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "XmZjuxkAMCiKtUlbb9l4w7t6tOZJAVdi1j_04pp40YM",
  "pdfSize": "1376234"
}