{
  "id": "2412.18445",
  "title": "Towards the Automatic Detection of Vection in Virtual Reality Using EEG",
  "authors": "Ga\\\"el Van der Lee, Anatole L\\'ecuyer, Maxence Naud, Reinhold Scherer,\n  Fran\\c{c}ois Cabestaing, Hakim Si-Mohammed",
  "authorsParsed": [
    [
      "Van der Lee",
      "Gaël",
      ""
    ],
    [
      "Lécuyer",
      "Anatole",
      ""
    ],
    [
      "Naud",
      "Maxence",
      ""
    ],
    [
      "Scherer",
      "Reinhold",
      ""
    ],
    [
      "Cabestaing",
      "François",
      ""
    ],
    [
      "Si-Mohammed",
      "Hakim",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 24 Dec 2024 14:08:18 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1735049298000,
  "abstract": "  Vection, the visual illusion of self-motion, provides a strong marker of the\nVR user experience and plays an important role in both presence and\ncybersickness. Traditional measurements have been conducted using\nquestionnaires, which exhibit inherent limitations due to their subjective\nnature and preventing real-time adjustments. Detecting vection in real time\nwould allow VR systems to adapt to users' needs, improving comfort and\nminimizing negative effects like motion sickness. This paper investigates the\npresence of vection markers in electroencephalogram (EEG) brain signals using\nevoked potentials (brain responses to external stimulations).\n  We designed a VR experiment that induces vection using two conditions: (1)\nforward acceleration or (2) backward acceleration. We recorded both\nelectroencephalographic (EEG) signals and gathered subjective reports on thirty\n(30) participants. We found an evoked potential of vection characterized by a\npositive peak around 600 ms (P600) after stimulus onset in the parietal region\nand a simultaneous negative peak in the frontal region. Our results also found\nparticipant variability in sensitivity to vection and cybersickness and EEG\nmarkers of acceleration across subjects. This result is promising for potential\ndetection of vection using EEG and paves the way for future studies towards a\nbetter understanding of vection. It also provides insights into the functional\nrole of the visual system and its integration with the vestibular system during\nmotion-perception. It has the potential to help enhance VR user experience by\nqualifying users' perceived vection and adapting the VR environments\naccordingly.\n",
  "subjects": [
    "Computer Science/Human-Computer Interaction",
    "Quantitative Biology/Neurons and Cognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "5z6oomnl0rMy1QuZsf2O7-Fd0twJNL0luXMwEldm86U",
  "pdfSize": "1018547"
}