{
  "id": "2412.02836",
  "title": "Clusters, Clumps, Dust, & Gas (CCDG) in NGC1614: Bench-marking Cluster\n  Demographics in Extreme Systems",
  "authors": "Miranda Caputo, Rupali Chandar, Angus Mok, Sean Linden, Paul\n  Goudfrooij, and Bradley C. Whitmore",
  "authorsParsed": [
    [
      "Caputo",
      "Miranda",
      ""
    ],
    [
      "Chandar",
      "Rupali",
      ""
    ],
    [
      "Mok",
      "Angus",
      ""
    ],
    [
      "Linden",
      "Sean",
      ""
    ],
    [
      "Goudfrooij",
      "Paul",
      ""
    ],
    [
      "Whitmore",
      "Bradley C.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 21:00:38 GMT"
    }
  ],
  "updateDate": "2024-12-05",
  "timestamp": 1733259638000,
  "abstract": "  Observations of young star clusters in a variety of galaxies have been used\nto constrain basic properties related to star-formation, such as the fraction\nof stars found in clusters (Gam) and the shape of the cluster mass function.\nHowever, the results can depend heavily on the reliability of the cluster\nage-dating process and other assumptions. One of the biggest challenges for\nsuccessful age-dating lies in breaking the age-reddening degeneracy, where\nolder, dust-free clusters and young, reddened clusters can have similar\nbroad-band colors. While this degeneracy affects cluster populations in all\ngalaxies, it is particularly challenging in dusty, extreme star-forming\nenvironments systems. We study the cluster demographics in the luminous\ninfrared galaxy NGC1614 using Hubble imaging taken in 8 optical-NIR passbands.\nFor age-dating, we adopt a spectral energy distribution fitting process that\nlimits the maximum allowed reddening by region, and includes Ha photometry\ndirectly. We find that without these assumptions, essentially all clusters in\nthe dust-free UV-bright arm which should have ages 50-250Myr are incorrectly\nassigned ages younger than 10Myr. We find this method greatly reduces the\nnumber of clusters in the youngest (tau<10Myrs) age bin and shows a fairly\nuniform distribution of massive clusters, the most massive being few10^7M. A\nmaximum likelihood fit shows that the cluster mass function is well fitted by a\npower-law with an index -1.8, with no statistically significant high-mass\ncutoff. We calculate the fraction of stars born in clusters to be\nGam1-10=22.4+_5.7%. The fraction of stars in clusters decreases quickly over\ntime, with Gam10-100= 4.5+_1.1% and Gam100-400=1.7+_0.4%, suggesting that\nclusters dissolve rapidly over the first ~0.5Gyr. The decreasing fraction of\nstars in clusters is consistent with the declining shape observed for the\ncluster age distribution.\n",
  "subjects": [
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "DDmTUyrbluoc4JSEwe9E1azKD7pB5ziUDnu9IGhWcv8",
  "pdfSize": "16398464"
}