{"id":"2412.06892","title":"The ACCEL2 Project: Precision Measurements of EFT Parameters and BAO\n  Peak Shifts for the Lyman-$\\alpha$ Forest","authors":"Roger de Belsunce, Shi-Fan Chen, Mikhail M. Ivanov, Corentin Ravoux,\n  Solene Chabanier, Jean Sexton, Zarija Lukic","authorsParsed":[["de Belsunce","Roger",""],["Chen","Shi-Fan",""],["Ivanov","Mikhail M.",""],["Ravoux","Corentin",""],["Chabanier","Solene",""],["Sexton","Jean",""],["Lukic","Zarija",""]],"versions":[{"version":"v1","created":"Mon, 9 Dec 2024 19:00:03 GMT"}],"updateDate":"2024-12-11","timestamp":1733770803000,"abstract":"  We present precision measurements of the bias parameters of the one-loop\npower spectrum model of the Lyman-alpha (Lya) forest, derived within the\neffective field theory of large-scale structure (EFT). We fit our model to the\nthree-dimensional flux power spectrum measured from the ACCEL2 hydrodynamic\nsimulations. The EFT model fits the data with an accuracy of below 2 percent up\nto a wavenumber of k = 2 h/Mpc. Further, we analytically derive how\nnon-linearities in the three-dimensional clustering of the Lya forest introduce\nbiases in measurements of the Baryon Acoustic Oscillations (BAO) scaling\nparameters in radial and transverse directions. From our EFT parameter\nmeasurements, we obtain a theoretical error budget of -0.2 (-0.3) percent for\nthe radial (transverse) parameters at redshift two. This corresponds to a shift\nof -0.3 (0.1) percent for the isotropic (anisotropic) distance measurements. We\nprovide an estimate for the shift of the BAO peak for Lya-quasar\ncross-correlation measurements assuming analytical and simulation-based scaling\nrelations for the non-linear quasar bias parameters resulting in a shift of\n-0.2 (-0.1) percent for the radial (transverse) dilation parameters,\nrespectively. This analysis emphasizes the robustness of Lya forest BAO\nmeasurements to the theory modeling. We provide informative priors and an error\nbudget for measuring the BAO feature -- a key science driver of the currently\nobserving Dark Energy Spectroscopic Instrument (DESI). Our work paves the way\nfor full-shape cosmological analyses of Lya forest data from DESI and upcoming\nsurveys such as the Prime Focus Spectrograph, WEAVE-QSO, and 4MOST.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"uxd6y7DMgGsGs70s1boJO40tEMdfe6-i4owvhTWzNJY","pdfSize":"3328227"}