{
  "id": "2412.12213",
  "title": "The AI Black-Scholes: Finance-Informed Neural Network",
  "authors": "Amine M. Aboussalah, Xuanze Li, Cheng Chi, Raj Patel",
  "authorsParsed": [
    [
      "Aboussalah",
      "Amine M.",
      ""
    ],
    [
      "Li",
      "Xuanze",
      ""
    ],
    [
      "Chi",
      "Cheng",
      ""
    ],
    [
      "Patel",
      "Raj",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 15 Dec 2024 22:40:40 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734302440000,
  "abstract": "  In the realm of option pricing, existing models are typically classified into\nprinciple-driven methods, such as solving partial differential equations (PDEs)\nthat pricing function satisfies, and data-driven approaches, such as machine\nlearning (ML) techniques that parameterize the pricing function directly. While\nprinciple-driven models offer a rigorous theoretical framework, they often rely\non unrealistic assumptions, such as asset processes adhering to fixed\nstochastic differential equations (SDEs). Moreover, they can become\ncomputationally intensive, particularly in high-dimensional settings when\nanalytical solutions are not available and thus numerical solutions are needed.\nIn contrast, data-driven models excel in capturing market data trends, but they\noften lack alignment with core financial principles, raising concerns about\ninterpretability and predictive accuracy, especially when dealing with limited\nor biased datasets. This work proposes a hybrid approach to address these\nlimitations by integrating the strengths of both principled and data-driven\nmethodologies. Our framework combines the theoretical rigor and\ninterpretability of PDE-based models with the adaptability of machine learning\ntechniques, yielding a more versatile methodology for pricing a broad spectrum\nof options. We validate our approach across different volatility modeling\napproaches-both with constant volatility (Black-Scholes) and stochastic\nvolatility (Heston), demonstrating that our proposed framework,\nFinance-Informed Neural Network (FINN), not only enhances predictive accuracy\nbut also maintains adherence to core financial principles. FINN presents a\npromising tool for practitioners, offering robust performance across a variety\nof market conditions.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Quantitative Finance/Computational Finance",
    "Statistics/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "HyRhb0lbHHVTYQRSDfYJWkMWHdzCz7KCEe_5MuhHWtQ",
  "pdfSize": "10954720"
}