{
  "id": "2412.15884",
  "title": "Direct measurement of the local electrocaloric effect in 2D\n  ferroelectric In${}_2$Se${}_3$ by Scanning Electrocaloric Thermometry",
  "authors": "Jean Spi\\`ece, Valentin Fonck, Charalambos Evangeli, Phil S. Dobson,\n  Jonathan M. R. Weaver and Pascal Gehring",
  "authorsParsed": [
    [
      "Spièce",
      "Jean",
      ""
    ],
    [
      "Fonck",
      "Valentin",
      ""
    ],
    [
      "Evangeli",
      "Charalambos",
      ""
    ],
    [
      "Dobson",
      "Phil S.",
      ""
    ],
    [
      "Weaver",
      "Jonathan M. R.",
      ""
    ],
    [
      "Gehring",
      "Pascal",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 13:33:14 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734701594000,
  "abstract": "  The electrocaloric effect refers to the temperature change in a material when\nan electric field is applied or removed. Significant breakthroughs revealed its\npotential for solid-state cooling technologies in past decades. These devices\noffer a sustainable alternative to traditional vapor compression refrigeration,\nwith advantages such as compactness, silent operation, and the absence of\nmoving parts or refrigerants.\n  Electrocaloric effects are typically studied using indirect methods using\npolarization data, and which suffer from inaccuracies related to assumptions\nabout heat capacity. Direct methods, although more precise, require device\nfabrication and face challenges in studying meso- or nanoscale systems, like 2D\nmaterials, and materials with non-uniform polarization textures where high\nspatial resolution is required.\n  In this study, a novel technique, Scanning Electrocaloric Thermometry, is\nintroduced for characterizing the local electrocaloric effect in nanomaterials.\nThis approach achieves high spatial resolution by locally applying electric\nfields and by simultaneously measuring the resulting temperature change. By\nemploying AC excitation, the measurement sensitivity is further enhanced and\nthe electrocaloric effect is disentangled from other heating mechanisms such as\nJoule heating and dielectric losses. The effectiveness of the method is\ndemonstrated by examining electrocaloric and heat dissipation phenomena in\ntwo-dimensional In${}_2$Se${}_3$ micrometer-sized flakes.\n",
  "subjects": [
    "Condensed Matter/Mesoscale and Nanoscale Physics",
    "Condensed Matter/Materials Science"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "UsArb4F5UstL-vdT25L8_S2200vaW7dWU6aqlY_PTZs",
  "pdfSize": "6912658"
}