{
  "id": "2412.10825",
  "title": "Suppression of photospheric velocity fluctuations in strongly magnetic\n  O-stars in radiation-magnetohydrodynamic simulations",
  "authors": "A. ud-Doula, J.O. Sundqvist, N. Narechania, D. Debnath, N. Moens, and\n  R. Keppens",
  "authorsParsed": [
    [
      "ud-Doula",
      "A.",
      ""
    ],
    [
      "Sundqvist",
      "J. O.",
      ""
    ],
    [
      "Narechania",
      "N.",
      ""
    ],
    [
      "Debnath",
      "D.",
      ""
    ],
    [
      "Moens",
      "N.",
      ""
    ],
    [
      "Keppens",
      "R.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 14 Dec 2024 13:05:22 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734181522000,
  "abstract": "  O-stars generally show clear signs of strong line-broadening (in addition to\nrotational broadening) in their photospheric absorption lines (typically\nreferred to as 'macroturbulence'), believed to originate in a turbulent\nsub-surface zone associated with enhanced opacities due to recombination of\niron-group elements (at T~ 150-200 kK). O-stars with detected global magnetic\nfields also display such macroturbulence; the sole exception to this is NGC\n1624-2, which also has the strongest (by far) detected field of the known\nmagnetic O-stars. It has been suggested that this lack of additional\nline-broadening is because NGC 1624-2's exceptionally strong magnetic field\nmight be able able to suppress the turbulent velocity field generated in the\niron opacity peak zone. For moderately strong magnetic cases (~1 kG) the\nsimulated atmospheres are highly structured characterised by large\nroot-mean-square velocities, and our results are qualitatively similar to those\nfound in previous non-magnetic studies. By contrast, we find that a strong\nhorizontal magnetic field in excess of 10 kG can indeed suppress the large\nvelocity fluctuations and thus stabilise (and thereby also inflate) the\natmosphere of a typical early O-star in the Galaxy. On the other hand, an\nequally strong radial field is only able to suppress horizontal motions, and as\na consequence these models exhibit significant radial fluctuations. Our\nsimulations provide an overall physical rationale as to why NGC 1624-2 with its\nstrong ~20 kG dipolar field lacks the large macroturbulent line broadening that\nall other known slowly rotating early O-stars exhibit. However, they also\nhighlight the importance of field geometry for controlling the atmospheric\ndynamics in massive and luminous stars that are strongly magnetic, tentatively\nsuggesting latitudinal dependence of macroturbulence and basic photospheric\nparameters.\n",
  "subjects": [
    "Astrophysics/Solar and Stellar Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "Ka_eRUHvg6UzHW67Q5YysnibHhfhouaA4r9KlGJiIsc",
  "pdfSize": "13689812"
}