{"id":"2412.08011","title":"SS433 Microquasar Jet and the TeV Resurgence beam","authors":"D.Fargion","authorsParsed":[["Fargion","D.",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 01:38:23 GMT"}],"updateDate":"2024-12-12","timestamp":1733881103000,"abstract":"  The understanding of microquasars in our galaxy is one of the frontiers of\nhigh energy astrophysics. Their models are based on a capturing mass Black\nHole, with a nearby spiraling binary companion star. The companion star mass\nfeeds the accretion disk around the Black Hole. This energy also fuels an\northogonal precessing X gamma jets. The spiral precessing tail of such\nmicroquasars, as the SS433 system, is due to an ultra-relativistic jet,\nspraying nucleons and electrons at relativistic speeds. The up-down jet is\nobservable in radio, X, gamma spectra. Its long spirals are spread and diluted\nwithin a light-year distance. The source is inside the W50 supernova remnant\nnebula , whose asymmetry reflects the past and present role of the SS433 jet.\nVery recently HESS, HAWC discovered, surprisingly at a much far disconnected\ndistance from the SS433, the resurgence of a twin gamma beam tail. Nearly 75\nyears light distance far away from the same inner jet source. The recent\nstandard model is based on an accelerating shock wave which reaccelerates, the\nresurgence of a PeV nucleon beam and its TeV secondaries. The surprising\nrecollimation of this TeV beam jet is difficult to be accepted, in the\nassumption of a planarlike Fermi shock wave model. Here we discuss an\nalternative framework based on known high energy nuclear physics, capable to\nsimultaneously explaining both the disconnected and the aligned hard TeV jet\nappearance. Several consequences, that might also be able to validate the\nmodel, are considered.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"KJaR6RTGTAJaJhacbJuPWDSdlcBJ96_buyg5HIanpkU","pdfSize":"2210712"}