{"id":"2412.10594","title":"Towards Unified Benchmark and Models for Multi-Modal Perceptual Metrics","authors":"Sara Ghazanfari, Siddharth Garg, Nicolas Flammarion, Prashanth\n  Krishnamurthy, Farshad Khorrami, Francesco Croce","authorsParsed":[["Ghazanfari","Sara",""],["Garg","Siddharth",""],["Flammarion","Nicolas",""],["Krishnamurthy","Prashanth",""],["Khorrami","Farshad",""],["Croce","Francesco",""]],"versions":[{"version":"v1","created":"Fri, 13 Dec 2024 22:38:09 GMT"}],"updateDate":"2024-12-17","timestamp":1734129489000,"abstract":"  Human perception of similarity across uni- and multimodal inputs is highly\ncomplex, making it challenging to develop automated metrics that accurately\nmimic it. General purpose vision-language models, such as CLIP and large\nmulti-modal models (LMMs), can be applied as zero-shot perceptual metrics, and\nseveral recent works have developed models specialized in narrow perceptual\ntasks. However, the extent to which existing perceptual metrics align with\nhuman perception remains unclear. To investigate this question, we introduce\nUniSim-Bench, a benchmark encompassing 7 multi-modal perceptual similarity\ntasks, with a total of 25 datasets. Our evaluation reveals that while\ngeneral-purpose models perform reasonably well on average, they often lag\nbehind specialized models on individual tasks. Conversely, metrics fine-tuned\nfor specific tasks fail to generalize well to unseen, though related, tasks. As\na first step towards a unified multi-task perceptual similarity metric, we\nfine-tune both encoder-based and generative vision-language models on a subset\nof the UniSim-Bench tasks. This approach yields the highest average\nperformance, and in some cases, even surpasses taskspecific models.\nNevertheless, these models still struggle with generalization to unseen tasks,\nhighlighting the ongoing challenge of learning a robust, unified perceptual\nsimilarity metric capable of capturing the human notion of similarity. The code\nand models are available at https://github.com/SaraGhazanfari/UniSim.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7dSGiTrJHwRKyXynjkalzaghqjhySC02FSYJUQlXy8U","pdfSize":"1664209"}