{"id":"2412.20190","title":"Maximizing Predictive Performance for Small Subgroups: Functionally\n  Adaptive Interaction Regularization (FAIR)","authors":"Daniel Smolyak, Courtney Paulson, Margr\\'et V. Bjarnad\\'ottir","authorsParsed":[["Smolyak","Daniel",""],["Paulson","Courtney",""],["Bjarnadóttir","Margrét V.",""]],"versions":[{"version":"v1","created":"Sat, 28 Dec 2024 16:03:18 GMT"},{"version":"v2","created":"Wed, 22 Jan 2025 16:20:40 GMT"}],"updateDate":"2025-01-23","timestamp":1735401798000,"abstract":"  In many healthcare settings, it is both critical to consider fairness when\nbuilding analytical applications but also uniquely unacceptable to lower model\nperformance for one group to match that of another (e.g. fairness cannot be\nachieved by lowering the diagnostic ability of a model for one group to match\nthat of another and lose overall diagnostic power). Therefore a modeler needs\nto maximize model performance across groups as much as possible, often while\nmaintaining a model's interpretability, which is a challenge for a number of\nreasons. In this paper we therefore suggest a new modeling framework, FAIR, to\nmaximize performance across imbalanced groups, based on existing linear\nregression approaches already commonly used in healthcare settings. We propose\na full linear interaction model between groups and all other covariates, paired\nwith a weighting of samples by group size and independent regularization\npenalties for each group. This efficient approach overcomes many of the\nlimitations in current approaches and manages to balance learning from other\ngroups with tailoring prediction to the small focal group(s). FAIR has an added\nadvantage in that it still allows for model interpretability in research and\nclinical settings. We demonstrate its usefulness with numerical and health data\nexperiments.\n","subjects":["Statistics/Applications"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"GnEg1IItPIcwS2pZlTdz3cZsNlzIJurdrBJZXF-8KzM","pdfSize":"1012735"}