{
  "id": "2412.16081",
  "title": "Error-corrected fermionic quantum processors with neutral atoms",
  "authors": "Robert Ott, Daniel Gonz\\'alez-Cuadra, Torsten V. Zache, Peter Zoller,\n  Adam M. Kaufman, and Hannes Pichler",
  "authorsParsed": [
    [
      "Ott",
      "Robert",
      ""
    ],
    [
      "González-Cuadra",
      "Daniel",
      ""
    ],
    [
      "Zache",
      "Torsten V.",
      ""
    ],
    [
      "Zoller",
      "Peter",
      ""
    ],
    [
      "Kaufman",
      "Adam M.",
      ""
    ],
    [
      "Pichler",
      "Hannes",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 17:25:46 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734715546000,
  "abstract": "  Many-body fermionic systems can be simulated in a hardware-efficient manner\nusing a fermionic quantum processor. Neutral atoms trapped in optical\npotentials can realize such processors, where non-local fermionic statistics\nare guaranteed at the hardware level. Implementing quantum error correction in\nthis setup is however challenging, due to the atom-number superselection\npresent in atomic systems, that is, the impossibility of creating coherent\nsuperpositions of different particle numbers. In this work, we overcome this\nconstraint and present a blueprint for an error-corrected fermionic quantum\ncomputer that can be implemented using current experimental capabilities. To\nachieve this, we first consider an ancillary set of fermionic modes and design\na fermionic reference, which we then use to construct superpositions of\ndifferent numbers of referenced fermions. This allows us to build logical\nfermionic modes that can be error corrected using standard atomic operations.\nHere, we focus on phase errors, which we expect to be a dominant source of\nerrors in neutral-atom quantum processors. We then construct logical fermionic\ngates, and show their implementation for the logical particle-number conserving\nprocesses relevant for quantum simulation. Finally, our protocol is illustrated\nusing a minimal fermionic circuit, where it leads to a quadratic suppression of\nthe logical error rate.\n",
  "subjects": [
    "Physics/Quantum Physics",
    "Condensed Matter/Quantum Gases",
    "Physics/Atomic Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "k1bvNj55xumixECuSrDQR4Gf6R9n_3sOWDfMdT0g-f8",
  "pdfSize": "892607"
}