{"id":"2412.17067","title":"Circular-shift-based Vector Linear Network Coding and Its Application to\n  Array Codes","authors":"Sheng Jin, Zhe Zhai, Qifu Tyler Sun, Zongpeng Li","authorsParsed":[["Jin","Sheng",""],["Zhai","Zhe",""],["Sun","Qifu Tyler",""],["Li","Zongpeng",""]],"versions":[{"version":"v1","created":"Sun, 22 Dec 2024 15:36:44 GMT"}],"updateDate":"2024-12-24","timestamp":1734881804000,"abstract":"  Circular-shift linear network coding (LNC) is a class of vector LNC with\nlocal encoding kernels selected from cyclic permutation matrices, so that it\nhas low coding complexities. However, it is insufficient to exactly achieve the\ncapacity of a multicast network, so the data units transmitted along the\nnetwork need to contain redundant symbols, which affects the transmission\nefficiency. In this paper, as a variation of circular-shift LNC, we introduce a\nnew class of vector LNC over arbitrary GF($p$), called circular-shift-based\nvector LNC, which is shown to be able to exactly achieve the capacity of a\nmulticast network. The set of local encoding kernels in circular-shift-based\nvector LNC is nontrivially designed such that it is closed under multiplication\nby elements in itself. It turns out that the coding complexity of\ncircular-shift-based vector LNC is comparable to and, in some cases, lower than\nthat of circular-shift LNC.\n  The new results in circular-shift-based vector LNC further facilitates us to\ncharacterize and design Vandermonde circulant maximum distance separable (MDS)\narray codes, which are built upon the structure of Vandermonde matrices and\ncircular-shift operations. We prove that for $r \\geq 2$, the largest possible\n$k$ for an $L$-dimensional $(k+r, k)$ Vandermonde circulant $p$-ary MDS array\ncode is $p^{m_L}-1$, where $L$ is an integer co-prime with $p$, and $m_L$\nrepresents the multiplicative order of $p$ modulo $L$. For $r = 2, 3$, we\nintroduce two new types of $(k+r, k)$ $p$-ary array codes that achieves the\nlargest $k = p^{m_L}-1$. For the special case that $p = 2$, we propose\nscheduling encoding algorithms for the 2 new codes, so that the encoding\ncomplexity not only asymptotically approaches the optimal $2$ XORs per original\ndata bit, but also slightly outperforms the encoding complexity of other known\nVandermonde circulant MDS array codes with $k = p^{m_L}-1$.\n","subjects":["Computer Science/Information Theory","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"JTAorBw3O9MEQbPw_T0F26tNz2InlFJUGjIAr5knOf0","pdfSize":"715949"}