{
  "id": "2412.07914",
  "title": "Yellow diode-pumped lasing of femtosecond-laser-written Dy,Tb:LiLuF4\n  waveguide",
  "authors": "Davide Baiocco, Ignacio Lopez-Quintas, Javier R. V\\'azquez de Aldana,\n  Alessandro di Maggio, Fabio Pozzi, Mauro Tonelli, Alessandro Tredicucci",
  "authorsParsed": [
    [
      "Baiocco",
      "Davide",
      ""
    ],
    [
      "Lopez-Quintas",
      "Ignacio",
      ""
    ],
    [
      "de Aldana",
      "Javier R. Vázquez",
      ""
    ],
    [
      "di Maggio",
      "Alessandro",
      ""
    ],
    [
      "Pozzi",
      "Fabio",
      ""
    ],
    [
      "Tonelli",
      "Mauro",
      ""
    ],
    [
      "Tredicucci",
      "Alessandro",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 20:50:28 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733863828000,
  "abstract": "  In this article we report the fabrication of a diode-pumped Dy,Tb:LiLuF4\nwaveguide laser operating in the yellow region of the visible spectrum. The\ncircular depressed-cladding waveguides have been fabricated by direct\nfemtosecond laser writing, and showed propagation losses as low as 0.07 dB/cm.\nBy employing these structures, we obtain a maximum output power of 86 mW at 574\nnm from a 60 {\\mu}m diameter waveguide, and a highest slope efficiency of 19%\nfrom a 80 {\\mu}m diameter depressed cladding waveguide. In addition, we\ndemonstrate lasing at 574 nm from a half-ring surface waveguide, with a maximum\noutput power of 12 mW. Moreover, we also obtained dual wavelength operation at\n568-574 nm, with a maximum output power of 15 mW, and stable lasing at 578 nm,\nwith an output power of 100 mW. The latter wavelength corresponds to the main\ntransition of the atomic clock based on the neutral ytterbium atom. To the best\nof the authors' knowledge, this is the first demonstration of a yellow\nwaveguide laser based on Dy-doped materials.\n",
  "subjects": [
    "Physics/Optics"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "J56rMTl3HqHcdrUyMnk9JroYEWQh8_KLln3o_OUtUBo",
  "pdfSize": "4426378"
}