{
  "id": "2412.04385",
  "title": "The Thermal Sunyaev-Zel'dovich Effect from the Epoch of Reionization",
  "authors": "Ilian T. Iliev, Azizah R. Hosein, Jens Chluba, Luke Conaboy, David\n  Attard, Rajesh Mondal, Kyungjin Ahn, Stefan Gottl\\\"ober, Joseph Lewis, Pierre\n  Ocvirk, Hyunbae Park, Paul R. Shapiro, Jenny G. Sorce, Gustavo Yepes",
  "authorsParsed": [
    [
      "Iliev",
      "Ilian T.",
      ""
    ],
    [
      "Hosein",
      "Azizah R.",
      ""
    ],
    [
      "Chluba",
      "Jens",
      ""
    ],
    [
      "Conaboy",
      "Luke",
      ""
    ],
    [
      "Attard",
      "David",
      ""
    ],
    [
      "Mondal",
      "Rajesh",
      ""
    ],
    [
      "Ahn",
      "Kyungjin",
      ""
    ],
    [
      "Gottlöber",
      "Stefan",
      ""
    ],
    [
      "Lewis",
      "Joseph",
      ""
    ],
    [
      "Ocvirk",
      "Pierre",
      ""
    ],
    [
      "Park",
      "Hyunbae",
      ""
    ],
    [
      "Shapiro",
      "Paul R.",
      ""
    ],
    [
      "Sorce",
      "Jenny G.",
      ""
    ],
    [
      "Yepes",
      "Gustavo",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 18:00:06 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733421606000,
  "abstract": "  The thermal Sunyaev-Zel'dovich (tSZ) effect arises from inverse Compton\nscattering of low energy photons onto thermal electrons, proportional to the\nintegrated electron pressure, and is usually observed from galaxy clusters.\nHowever, we can expect that the Epoch of Reionization (EoR) also contributes to\nthis signal, but that contribution has not been previously evaluated. In this\nwork we analyse a suite of fully-coupled radiation-hydrodynamics simulations\nbased on RAMSES-CUDATON to calculate and study the tSZ signal from the\nReionization Epoch. We construct lightcones of the electron pressure in the\nintergalactic medium for $6<z$ to calculate the resulting Compton y-parameters.\nWe vary the box sizes, resolutions and star formation parameters to investigate\nhow these factors affect the tSZ effect. We produce plots of maps and\ndistributions of y, as well as angular temperature power spectra of the tSZ\nsignal obtained from integrating the lightcones constructed for each\nsimulation. We find that the tSZ signal from reionization is generally\nsub-dominant to the post-reionization one at larger scales ($\\ell< 10^4$), but\ncan contribute non-trivially and potentially contaminate the measured signals.\nAt scales probed by current experiments like SPT ($\\ell\\sim10^3-10^4$), we find\nthat the tSZ signal power spectrum from reionization contributes at roughly a\npercent level compared to the current templates, with the quadratic Doppler\neffect contributing an additional $\\sim10\\%$ to the tSZ signal. At smaller\nscales the tSZ from reionization peaks and can potentially dominate the total\nsignal and is thus a potentially much more important contribution to take into\naccount in any future, more sensitive experiments.\n",
  "subjects": [
    "Astrophysics/Cosmology and Nongalactic Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "6On7DrY_VM7RiDNkYv3PCRaq55t1nmBJvh5wzGapzdg",
  "pdfSize": "4506327"
}