{
  "id": "2412.15404",
  "title": "A Retrieval-Augmented Generation Framework for Academic Literature\n  Navigation in Data Science",
  "authors": "Ahmet Yasin Aytar, Kemal Kilic, Kamer Kaya",
  "authorsParsed": [
    [
      "Aytar",
      "Ahmet Yasin",
      ""
    ],
    [
      "Kilic",
      "Kemal",
      ""
    ],
    [
      "Kaya",
      "Kamer",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 21:14:54 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734642894000,
  "abstract": "  In the rapidly evolving field of data science, efficiently navigating the\nexpansive body of academic literature is crucial for informed decision-making\nand innovation. This paper presents an enhanced Retrieval-Augmented Generation\n(RAG) application, an artificial intelligence (AI)-based system designed to\nassist data scientists in accessing precise and contextually relevant academic\nresources. The AI-powered application integrates advanced techniques, including\nthe GeneRation Of BIbliographic Data (GROBID) technique for extracting\nbibliographic information, fine-tuned embedding models, semantic chunking, and\nan abstract-first retrieval method, to significantly improve the relevance and\naccuracy of the retrieved information. This implementation of AI specifically\naddresses the challenge of academic literature navigation. A comprehensive\nevaluation using the Retrieval-Augmented Generation Assessment System (RAGAS)\nframework demonstrates substantial improvements in key metrics, particularly\nContext Relevance, underscoring the system's effectiveness in reducing\ninformation overload and enhancing decision-making processes. Our findings\nhighlight the potential of this enhanced Retrieval-Augmented Generation system\nto transform academic exploration within data science, ultimately advancing the\nworkflow of research and innovation in the field.\n",
  "subjects": [
    "Computer Science/Information Retrieval"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Jt1soXbhwegN33-Xme-M5-uMmvjG0oSf00BvWuPzSWI",
  "pdfSize": "788575"
}