{"id":"2412.19858","title":"Constituent Quark Model and nucleon-Nucleon Potentials","authors":"Th. A. Rijken","authorsParsed":[["Rijken","Th. A.",""]],"versions":[{"version":"v1","created":"Wed, 25 Dec 2024 23:34:52 GMT"}],"updateDate":"2024-12-31","timestamp":1735169692000,"abstract":"  In these notes, while focusing on the meson-nucleon vertices, we give a\nderivation of the nucleon-nucleon 9NN) potentials from meson-exchange between\nquarks. To establish such a relation the quark-quark-meson (QQM) interactions\nare properly defined. Hitherto, the coefficients in the Pauli-spinor expansion\nof the meson-nucleon-nucleon (NNM) vertices are equated with those of the\nQQM-vertices. In these notes we employ the description of the nucleon with\nDirac-spinors in the SU(6) semi-relativistic \"constituent\" quark-model (CQM) as\nformulated by LeYouanc, et al. It appears that the constituent quark model with\n$m_q= M_N/3$, is able to produce the same ratio's for the central-, spin-spin-,\ntensor-, spin-orbit-, and quadratic-spin-orbit Pauli-invariants as in the\nphenomenological NNM-vertices. In order to achieve this, the scalar-,\nmagnetic-vector, and axial-vector interactions require, besides the standard\nones, an extra coupling to the quarks without the introduction of new\nparameters. in the case of the axial-vector mesons an extra coupling to the\nquarks is necessary, which is related to the quark orbital angular momentum\ncontribution to the nucleon spin. Furthermore, a momentum correlation between\nthe quark that is coupled to the meson and the remaining quark pair, and a\n(gaussian) QQM form factor, are necessary to avoid \"spurious\" terms. From these\nresults we have obtained a formulation of the QQ-interactions which is directly\nrelated to the NN extended-soft-core (ESC) interactions. This has been applied\nto mixed quark-nuclear matter in a study of (heavy) neutron stars.\n","subjects":["Physics/Nuclear Theory","Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"BFIPi0hgIt2LFLuAkQeUU7ExuhVge7dwmj6MW_I0GBw","pdfSize":"484190"}