{
  "id": "2412.05360",
  "title": "Serendipitous decametre detection of ultra steep spectrum radio emission\n  in Abell 655",
  "authors": "C. Groeneveld, R. J. van Weeren, A. Botteon, R. Cassano, F. de\n  Gasperin, E. Osinga, G. Brunetti, and H. J. A. R\\\"ottgering",
  "authorsParsed": [
    [
      "Groeneveld",
      "C.",
      ""
    ],
    [
      "van Weeren",
      "R. J.",
      ""
    ],
    [
      "Botteon",
      "A.",
      ""
    ],
    [
      "Cassano",
      "R.",
      ""
    ],
    [
      "de Gasperin",
      "F.",
      ""
    ],
    [
      "Osinga",
      "E.",
      ""
    ],
    [
      "Brunetti",
      "G.",
      ""
    ],
    [
      "Röttgering",
      "H. J. A.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 19:00:01 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733511601000,
  "abstract": "  Some galaxy clusters contain non-thermal synchrotron emitting plasma\npermeating the intracluster medium (ICM). The spectral properties of this radio\nemission are not well characterized at decameter wavelengths ({\\nu} < 30 MHz),\nprimarily due to the severe corrupting effects of the ionosphere. Using a\nrecently developed calibration strategy, we present LOFAR images below 30 MHz\nof the low mass galaxy cluster Abell 655, which was serendipitously detected in\nan observation of the bright calibrator 3C 196. We combine this observation\nwith LOFAR data at 144 MHz, and new Band 4 Giant Metrewave Radio Telescope\nobservations centered at 650 MHz. In the 15-30 MHz LOFAR image, diffuse\nemission is seen with a physical extent of about 700 kpc. We argue that the\ndiffuse emission detected in this galaxy cluster likely has multiple origins.\nAt higher frequencies (650 MHz), the diffuse emission resembles a radio halo,\nwhile at lower frequencies the emission seems to consist of several components\nand bar-like structures. It suggests that most low-frequency emission in this\ncluster comes from re-energized fossil plasma from old AGN outbursts,\ncoexisting with the radio halo component. By counting the number of cluster\nradio detections in the decameter band, we estimate that around a quarter of\nthe Planck clusters host re-energised fossil plasma that is detectable in the\ndecameter band with LOFAR.\n",
  "subjects": [
    "Astrophysics/Cosmology and Nongalactic Astrophysics",
    "Astrophysics/High Energy Astrophysical Phenomena"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "colMOARMDo3SUJPW6nSn9aj2Mjvay9DeTDgDLM9O5NI",
  "pdfSize": "2311607"
}