{"id":"2412.04201","title":"Hipandas: Hyperspectral Image Joint Denoising and Super-Resolution by\n  Image Fusion with the Panchromatic Image","authors":"Shuang Xu, Zixiang Zhao, Haowen Bai, Chang Yu, Jiangjun Peng,\n  Xiangyong Cao, Deyu Meng","authorsParsed":[["Xu","Shuang",""],["Zhao","Zixiang",""],["Bai","Haowen",""],["Yu","Chang",""],["Peng","Jiangjun",""],["Cao","Xiangyong",""],["Meng","Deyu",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 14:39:29 GMT"}],"updateDate":"2024-12-06","timestamp":1733409569000,"abstract":"  Hyperspectral images (HSIs) are frequently noisy and of low resolution due to\nthe constraints of imaging devices. Recently launched satellites can\nconcurrently acquire HSIs and panchromatic (PAN) images, enabling the\nrestoration of HSIs to generate clean and high-resolution imagery through\nfusing PAN images for denoising and super-resolution. However, previous studies\ntreated these two tasks as independent processes, resulting in accumulated\nerrors. This paper introduces \\textbf{H}yperspectral \\textbf{I}mage Joint\n\\textbf{Pand}enoising \\textbf{a}nd Pan\\textbf{s}harpening (Hipandas), a novel\nlearning paradigm that reconstructs HRHS images from noisy low-resolution HSIs\n(LRHS) and high-resolution PAN images. The proposed zero-shot Hipandas\nframework consists of a guided denoising network, a guided super-resolution\nnetwork, and a PAN reconstruction network, utilizing an HSI low-rank prior and\na newly introduced detail-oriented low-rank prior. The interconnection of these\nnetworks complicates the training process, necessitating a two-stage training\nstrategy to ensure effective training. Experimental results on both simulated\nand real-world datasets indicate that the proposed method surpasses\nstate-of-the-art algorithms, yielding more accurate and visually pleasing HRHS\nimages.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"9hz-g2191-fpwo0CJiZP5myIZ7y1BZE1FLfQOHVfSss","pdfSize":"5368063"}