{"id":"2412.03523","title":"Microwave Remote Sensing of Soil Moisture, Above Ground Biomass and\n  Freeze-Thaw Dynamic: Modeling and Empirical Approaches","authors":"Laura Angeloni, Domenico Daniele Bloisi, Paolo Burghignoli, Davide\n  Comite, Danilo Costarelli, Michele Piconi, Anna Rita Sambucini, Alessio\n  Troiani, Alessandro Veneri","authorsParsed":[["Angeloni","Laura",""],["Bloisi","Domenico Daniele",""],["Burghignoli","Paolo",""],["Comite","Davide",""],["Costarelli","Danilo",""],["Piconi","Michele",""],["Sambucini","Anna Rita",""],["Troiani","Alessio",""],["Veneri","Alessandro",""]],"versions":[{"version":"v1","created":"Wed, 4 Dec 2024 18:10:00 GMT"}],"updateDate":"2024-12-05","timestamp":1733335800000,"abstract":"  Human actions have accelerated changes in global temperature, precipitation\npatterns, and other critical Earth systems. Key markers of these changes can be\nlinked to the dynamic of Essential Climate Variables (ECVs) and related\nquantities, such as Soil Moisture (SM), Above Ground Biomass (AGB), and\nFreeze-Thaw (FT) Dynamics. These variables are crucial for understanding global\nclimate changes, hydrological and carbon cycles included. Monitoring these\nvariables helps to validate climate models and inform policy decisions.\nTechnologies like microwave remote sensing provide critical tools for\nmonitoring the effects of human activities on these variables at a global\nscale. Other than proper tachenological developments, the study of ECVs\nrequires suitable theoretical retrieval tools, which leads to the solutions of\ninverse problems. In this brief survey, we analyze and summarize the main\nretrieval techniques available in the literature for SM, AGB, and FT, performed\non data collected with microwave remote sensing sensors. Such methods will be\nsome of the fundamental algorithms that can find applications in the research\nactivities of the interdisciplinary, curiosity-driven, project {\\it REmote\nsensing daTa INversion with multivariate functional modeling for essential\nclimAte variables characterization (RETINA)}, recently funded by the European\nUnion under the Italian National Recovery and Resilience Plan of\nNextGenerationEU, under the Italian Ministry of University and Research. The\nmain goal of RETINA, in which three research units from three different italian\nuniversities are involved, is to create innovative techniques for analyzing\ndata generated by the interaction of electromagnetic waves with the Earth's\nsurface, applying theoretical insights to address real-world challenges.\n","subjects":["Mathematics/Numerical Analysis","Computer Science/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"Q2T0p7vmYjkxr-C8sQGt0AZ29kZ3iZH_SDi9t9U48A0","pdfSize":"16770707"}