{"id":"2412.16357","title":"Certified Lumped Approximations for the Conduction Dunking Problem","authors":"Kento Kaneko (1), Claude Le Bris (2), Anthony T. Patera (1) ((1)\n  Department of Mechanical Engineering, Massachusetts Institute of Technology,\n  (2) Matherials project-team, \\'Ecole des Ponts and Inria)","authorsParsed":[["Kaneko","Kento",""],["Bris","Claude Le",""],["Patera","Anthony T.",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 21:35:12 GMT"}],"updateDate":"2024-12-24","timestamp":1734730512000,"abstract":"  We consider the dunking problem: a solid body at uniform temperature\n$T_\\text{i}$ is placed in a environment characterized by farfield temperature\n$T_\\infty$ and time-independent spatially uniform heat transfer coefficient; we\npermit heterogeneous material composition. The problem is described by a heat\nequation with Robin boundary conditions. The crucial parameter is the Biot\nnumber, a nondimensional heat transfer coefficient; we consider the limit of\nsmall Biot number.\n  We introduce first-order and second-order asymptotic approximations (in Biot\nnumber) for the spatial domain average temperature as a function of time; the\nfirst-order approximation is the standard `lumped model'. We provide asymptotic\nerror estimates for the first-order and second-order approximations for small\nBiot number, and also, for the first-order approximation, non-asymptotic bounds\nvalid for all Biot number. We also develop a second-order approximation and\nassociated asymptotic error estimate for the normalized difference in the\ndomain average and boundary average temperatures. Companion numerical solutions\nof the heat equation confirm the effectiveness of the error estimates for small\nBiot number.\n  The second-order approximation and the first-order and second-order error\nestimates depend on several functional outputs associated with an elliptic\npartial differential equation; the latter can be derived from Biot-sensitivity\nanalysis of the heat equation eigenproblem in the limit of small Biot number.\nMost important is the functional output $\\phi$, the only functional output\nrequired for the first-order error estimate and also the second-order\napproximation; $\\phi$ admits a simple physical interpretation in terms of\nconduction length scale. We characterize a class of spatial domains for which\nthe standard lumped-model criterion -- Biot number (based on volume-to-area\nlength scale) small -- is deficient.\n","subjects":["Mathematics/Numerical Analysis","Computer Science/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"vkW9wWP8SYA-1mRYzPa4DUWBXoQz4mn_4ETIwga652o","pdfSize":"939160"}