{
  "id": "2412.09226",
  "title": "The Global Carbon Budget as a cointegrated system",
  "authors": "Mikkel Bennedsen, Eric Hillebrand, Morten {\\O}rregaard Nielsen",
  "authorsParsed": [
    [
      "Bennedsen",
      "Mikkel",
      ""
    ],
    [
      "Hillebrand",
      "Eric",
      ""
    ],
    [
      "Nielsen",
      "Morten Ørregaard",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 12:28:38 GMT"
    },
    {
      "version": "v2",
      "created": "Fri, 31 Jan 2025 18:03:53 GMT"
    },
    {
      "version": "v3",
      "created": "Tue, 11 Feb 2025 08:18:28 GMT"
    }
  ],
  "updateDate": "2025-02-12",
  "timestamp": 1734006518000,
  "abstract": "  The Global Carbon Budget, maintained by the Global Carbon Project, summarizes\nEarth's global carbon cycle through four annual time series beginning in 1959:\natmospheric CO$_2$ concentrations, anthropogenic CO$_2$ emissions, and CO$_2$\nuptake by land and ocean. We analyze these four time series as a multivariate\n(cointegrated) system. Statistical tests show that the four time series are\ncointegrated with rank three and identify anthropogenic CO$_2$ emissions as the\nsingle stochastic trend driving the nonstationary dynamics of the system. The\nthree cointegrated relations correspond to the physical relations that the\nsinks are linearly related to atmospheric concentrations and that the change in\nconcentrations equals emissions minus the combined uptake by land and ocean.\nFurthermore, likelihood ratio tests show that a parametrically restricted\nerror-correction model that embodies these physical relations and accounts for\nthe El Ni\\~no/Southern Oscillation cannot be rejected on the data. The model\ncan be used for both in-sample and out-of-sample analysis. In an application of\nthe latter, we demonstrate that projections based on this model, using Shared\nSocioeconomic Pathways scenarios, yield results consistent with established\nclimate science.\n",
  "subjects": [
    "Statistics/Applications",
    "Economics/Econometrics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "pZDPdmLnD1CYrOonG6hiRDTfvF9RiNZf8O7mCZyL_Q0",
  "pdfSize": "2826159"
}