{"id":"2412.15018","title":"Joint estimation of activity, attenuation and motion in\n  respiratory-self-gated time-of-flight PET","authors":"Masoud Elhamiasl, Frederic Jolivet, Ahmadreza Rezaei, Michael\n  Fieseler, Klaus Sch\\\"afers, Johan Nuyts, Georg Schramm, Fernando Boada","authorsParsed":[["Elhamiasl","Masoud",""],["Jolivet","Frederic",""],["Rezaei","Ahmadreza",""],["Fieseler","Michael",""],["Schäfers","Klaus",""],["Nuyts","Johan",""],["Schramm","Georg",""],["Boada","Fernando",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 16:30:56 GMT"}],"updateDate":"2024-12-20","timestamp":1734625856000,"abstract":"  Whole-body PET imaging is often hindered by respiratory motion during\nacquisition, causing significant degradation in the quality of reconstructed\nactivity images. An additional challenge in PET/CT imaging arises from the\nrespiratory phase mismatch between CT-based attenuation correction and PET\nacquisition, leading to attenuation artifacts. To address these issues, we\npropose two new, purely data-driven methods for the joint estimation of\nactivity, attenuation, and motion in respiratory self-gated TOF PET. These\nmethods enable the reconstruction of a single activity image free from motion\nand attenuation artifacts.\n  The proposed methods were evaluated using data from the anthropomorphic\nWilhelm phantom acquired on a Siemens mCT PET/CT system, as well as 3 clinical\nFDG PET/CT datasets acquired on a GE DMI PET/CT system. Image quality was\nassessed visually to identify motion and attenuation artifacts. Lesion uptake\nvalues were quantitatively compared across reconstructions without motion\nmodeling, with motion modeling but static attenuation correction, and with our\nproposed methods.\n  For the Wilhelm phantom, the proposed methods delivered image quality closely\nmatching the reference reconstruction from a static acquisition. The\nlesion-to-background contrast for a liver dome lesion improved from 2.0 (no\nmotion correction) to 5.2 (proposed methods), matching the contrast from the\nstatic acquisition (5.2). In contrast, motion modeling with static attenuation\ncorrection yielded a lower contrast of 3.5. In patient datasets, the proposed\nmethods successfully reduced motion artifacts in lung and liver lesions and\nmitigated attenuation artifacts, demonstrating superior lesion to background\nseparation.\n  Our proposed methods enable the reconstruction of a single, high-quality\nactivity image that is motion-corrected and free from attenuation artifacts,\nwithout the need for external hardware.\n","subjects":["Physics/Medical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"jziQt5WtTckQ39AjKZF5SgoHM28s67erqn-VBPG-7RM","pdfSize":"2663043"}