{"id":"2412.15831","title":"Enriching Social Science Research via Survey Item Linking","authors":"Tornike Tsereteli and Daniel Ruffinelli and Simone Paolo Ponzetto","authorsParsed":[["Tsereteli","Tornike",""],["Ruffinelli","Daniel",""],["Ponzetto","Simone Paolo",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 12:14:33 GMT"}],"updateDate":"2024-12-23","timestamp":1734696873000,"abstract":"  Questions within surveys, called survey items, are used in the social\nsciences to study latent concepts, such as the factors influencing life\nsatisfaction. Instead of using explicit citations, researchers paraphrase the\ncontent of the survey items they use in-text. However, this makes it\nchallenging to find survey items of interest when comparing related work.\nAutomatically parsing and linking these implicit mentions to survey items in a\nknowledge base can provide more fine-grained references. We model this task,\ncalled Survey Item Linking (SIL), in two stages: mention detection and entity\ndisambiguation. Due to an imprecise definition of the task, existing datasets\nused for evaluating the performance for SIL are too small and of low-quality.\nWe argue that latent concepts and survey item mentions should be\ndifferentiated. To this end, we create a high-quality and richly annotated\ndataset consisting of 20,454 English and German sentences. By benchmarking deep\nlearning systems for each of the two stages independently and sequentially, we\ndemonstrate that the task is feasible, but observe that errors propagate from\nthe first stage, leading to a lower overall task performance. Moreover,\nmentions that require the context of multiple sentences are more challenging to\nidentify for models in the first stage. Modeling the entire context of a\ndocument and combining the two stages into an end-to-end system could mitigate\nthese problems in future work, and errors could additionally be reduced by\ncollecting more diverse data and by improving the quality of the knowledge\nbase. The data and code are available at https://github.com/e-tornike/SIL .\n","subjects":["Computer Science/Digital Libraries","Computer Science/Computation and Language"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"QyvTkXI7PWwKV6Yj5FXEvEGwmkQs7mWJZLzqRlVX46U","pdfSize":"5276088"}