{
  "id": "2412.12064",
  "title": "Development of a Compact High-Voltage Functional Electrical Stimulation\n  Device",
  "authors": "Haiduo Wang, Ruizhe Tang, and Xilin Liu",
  "authorsParsed": [
    [
      "Wang",
      "Haiduo",
      ""
    ],
    [
      "Tang",
      "Ruizhe",
      ""
    ],
    [
      "Liu",
      "Xilin",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 18:38:53 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734374333000,
  "abstract": "  This report details the design and development of a compact high-voltage\nfunctional electrical stimulation (FES) device. Unlike conventional FES\nsystems, the proposed design prioritizes user comfort by leveraging rapid\nswitching times to effectively activate muscles while minimizing stimulation of\npain receptors. The device is equipped with a high compliance voltage of up to\n135 V, enabling its use across various muscle groups and accommodating users\nwith differing skin conductance levels. At the core of the system is a switched\ncapacitor (SC) stimulator, which facilitates fast switching, and a flyback\nconverter that steps up the battery voltage. The design exclusively utilizes\noff-the-shelf components, significantly reducing prototyping costs. Initially,\na large testing board was developed to evaluate the performance of the SC\nstimulator in comparison with conventional H-bridge-based current-regulated\nstimulators. Subsequently, a compact, three-board PCB design was created to\nenable battery-powered operation, making it suitable for wearable applications.\nThe proposed design methodology is broadly applicable to a wide range of neural\nrehabilitation applications.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Systems and Control",
    "Computer Science/Systems and Control"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "mdfS-AEgsmGjwTTXTgP5b4NFfgfugBhhae57dUgfQ1o",
  "pdfSize": "2975440"
}