{"id":"2412.08729","title":"Photoelectron Circular Dichroism of Aqueous-Phase Alanine","authors":"Dominik Stemer, Stephan Thuermer, Florian Trinter, Uwe Hergenhahn,\n  Michele Pugini, Bruno Credidio, Sebastian Malerz, Iain Wilkinson, Laurent\n  Nahon, Gerard Meijer, Ivan Powis, and Bernd Winter","authorsParsed":[["Stemer","Dominik",""],["Thuermer","Stephan",""],["Trinter","Florian",""],["Hergenhahn","Uwe",""],["Pugini","Michele",""],["Credidio","Bruno",""],["Malerz","Sebastian",""],["Wilkinson","Iain",""],["Nahon","Laurent",""],["Meijer","Gerard",""],["Powis","Ivan",""],["Winter","Bernd",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 19:00:42 GMT"}],"updateDate":"2024-12-13","timestamp":1733943642000,"abstract":"  Amino acids and other small chiral molecules play key roles in biochemistry.\nHowever, in order to understand how these molecules behave in vivo, it is\nnecessary to study them under aqueous-phase conditions. Photoelectron circular\ndichroism (PECD) has emerged as an extremely sensitive probe of chiral\nmolecules, but its suitability for application to aqueous solutions had not yet\nbeen proven. Here, we report on our PECD measurements of aqueous-phase alanine,\nthe simplest chiral amino acid. We demonstrate that the PECD response of\nalanine in water is different for each of alanine's carbon atoms, and is\nsensitive to molecular structure changes (protonation states) related to the\nsolution pH. For C~1s photoionization of alanine's carboxylic acid group, we\nreport PECD of comparable magnitude to that observed in valence-band\nphotoelectron spectroscopy of gas-phase alanine. We identify key differences\nbetween PECD experiments from liquids and gases, discuss how PECD may provide\ninformation regarding solution-specific phenomena -- for example the nature and\nchirality of the solvation shell surrounding chiral molecules in water -- and\nhighlight liquid-phase PECD as a powerful new tool for the study of\naqueous-phase chiral molecules of biological relevance.\n","subjects":["Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"TY1wMZw4oqcDbeBbXuzeKhh3dmpBI2NU1AAJ9yenP6I","pdfSize":"8654169"}