{
  "id": "2412.02124",
  "title": "New insight of time-transformed symplectic integrator I: hybrid methods\n  for hierarchical triples",
  "authors": "Long Wang",
  "authorsParsed": [
    [
      "Wang",
      "Long",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 03:27:47 GMT"
    }
  ],
  "updateDate": "2024-12-04",
  "timestamp": 1733196467000,
  "abstract": "  Accurate $N$-body simulations of multiple systems such as binaries and\ntriples are essential for understanding the formation and evolution of\ninteracting binaries and binary mergers, including gravitational wave sources,\nblue stragglers and X-ray binaries. The logarithmic time-transformed explicit\nsymplectic integrator (LogH), also known as algorithmic regularization, is a\nstate-of-the-art method for this purpose.However, we show that this method is\naccurate for isolated Kepler orbits because of its ability to trace Keplerian\ntrajectories, but much less accurate for hierarichal triple systems. The method\ncan lead to an unphysical secular evolution of inner eccentricity in\nKozal-Lidov triples, despite a small energy error. We demonstrate that hybrid\nmethods, which apply LogH to the inner binary and alternative methods to the\nouter bodies, are significantly more effective, though not symplectic.\nAdditionally, we introduce a more efficient hybrid method, BlogH, which\neliminates the need for time synchronization and is time symmetric. The method\nis implemented in the few-body code SDAR. We explore suitable criteria for\nswitching between the LogH and BlogH methods for general triple systems. These\nhybrid methods have the potential to enhance the integration performance of\nhierarchial triples.\n",
  "subjects": [
    "Astrophysics/Instrumentation and Methods for Astrophysics",
    "Astrophysics/Earth and Planetary Astrophysics",
    "Astrophysics/High Energy Astrophysical Phenomena",
    "Astrophysics/Solar and Stellar Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "TQrwKhzEyAKgmtldMbrbkJddx-G04sIQtcdkDuWAlDk",
  "pdfSize": "3027027"
}