{"id":"2412.07363","title":"Development of a bipolar 50 V output digital-to-analog converter system\n  for ion-shuttling operations","authors":"T. Oshio, R. Nishimoto, T. Higuchi, K. Hayasaka, K. Koike, S.\n  Morisaka, T. Miyoshi, R. Ohira, U. Tanaka","authorsParsed":[["Oshio","T.",""],["Nishimoto","R.",""],["Higuchi","T.",""],["Hayasaka","K.",""],["Koike","K.",""],["Morisaka","S.",""],["Miyoshi","T.",""],["Ohira","R.",""],["Tanaka","U.",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 09:59:47 GMT"},{"version":"v2","created":"Mon, 17 Feb 2025 08:23:35 GMT"}],"updateDate":"2025-02-18","timestamp":1733824787000,"abstract":"  The quantum charge-coupled device (QCCD) is one of the notable architectures\nto achieve large-scale trapped-ion quantum computers. To realize QCCD\narchitecture, ions must be transported quickly while minimizing motional\nexcitation. High-voltage sources are necessary to achieve such high-quality ion\ntransport through a high secular frequency. In this study, we report the\ndevelopment of a field programmable gate array (FPGA)-based digital-to-analog\nconverter (DAC) system with an output voltage range of +/-50 V and demonstrate\nits effectiveness in ion transport operations. The device provides 16-channel\nanalog output, maximum update rate of 16 mega updates per second (MUPS), slew\nrate of 20 V/us, and bandwidth of > 200 kHz. By optimizing the voltage sets\nwith quadratic programming, we experimentally confirmed that this DAC system\ncan achieve more than twice the secular frequency attainable when its output\nrange is restricted to +/-10 V. Since the output range of many commercially\navailable DACs is commonly limited to +/-10 V, this increase is effective for\nion shuttling operations, such as transport, split and merge. The developed DAC\nsystem has potential to increase the speed of ion transport thereby reducing\nprocessing times in QCCD-based quantum computers.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"MeW9A_i7pGkRqm2iqATPYMJA9D7L_mauyOHsZlt4WB8","pdfSize":"1977009"}