{
  "id": "2412.12684",
  "title": "Strain engineering of magnetic anisotropy in the kagome magnet Fe3Sn2",
  "authors": "D. Kong, A. Kov\\'acs, M. Charilaou, M. Altthaler, L. Prodan, V.\n  Tsuran, D. Meier, X. Han, I Kezsmarki, R.E. Dunin-Borkowski",
  "authorsParsed": [
    [
      "Kong",
      "D.",
      ""
    ],
    [
      "Kovács",
      "A.",
      ""
    ],
    [
      "Charilaou",
      "M.",
      ""
    ],
    [
      "Altthaler",
      "M.",
      ""
    ],
    [
      "Prodan",
      "L.",
      ""
    ],
    [
      "Tsuran",
      "V.",
      ""
    ],
    [
      "Meier",
      "D.",
      ""
    ],
    [
      "Han",
      "X.",
      ""
    ],
    [
      "Kezsmarki",
      "I",
      ""
    ],
    [
      "Dunin-Borkowski",
      "R. E.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 09:02:51 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734426171000,
  "abstract": "  The ability to control magnetism with strain offers innovative pathways for\nthe modulation of magnetic domain configurations and for the manipulation of\nmagnetic states in materials on the nanoscale. Although the effect of strain on\nmagnetic domains has been recognized since the early work of C. Kittel,\ndetailed local observations have been elusive. Here, we use mechanical strain\nto achieve reversible control of magnetic textures in a kagome-type Fe3Sn2\nferromagnet without the use of an external electric current or magnetic field\nin situ in a transmission electron microscope at room temperature. We use\nFresnel defocus imaging, off-axis electron holography and micromagnetic\nsimulations to show that tensile strain modifies the structures of dipolar\nskyrmions and switches their magnetization between out-of-plane and in-plane\nconfigurations. We also present quantitative measurements of magnetic domain\nwall structures and their transformations as a function of strain. Our results\ndemonstrate the fundamental importance of anisotropy effects and their\ninterplay with magnetoelastic and magnetocrystalline energies, providing new\nopportunities for the development of strain-controlled devices for spintronic\napplications.\n",
  "subjects": [
    "Condensed Matter/Materials Science"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "uKZP5mebpBndSCluU0TCaNh2MQozcOorn8UgGqxp8rc",
  "pdfSize": "15551717"
}