{
  "id": "2412.14915",
  "title": "Efficient Experimental Qudit State Estimation via Point Tomography",
  "authors": "D. Mart\\'inez, L. Pereira, K. Sawada, P. Gonz\\'alez, J. Cari\\~ne, M.\n  Mu\\~noz, A. Delgado, E. S. G\\'omez, S. P. Walborn, G. Lima",
  "authorsParsed": [
    [
      "Martínez",
      "D.",
      ""
    ],
    [
      "Pereira",
      "L.",
      ""
    ],
    [
      "Sawada",
      "K.",
      ""
    ],
    [
      "González",
      "P.",
      ""
    ],
    [
      "Cariñe",
      "J.",
      ""
    ],
    [
      "Muñoz",
      "M.",
      ""
    ],
    [
      "Delgado",
      "A.",
      ""
    ],
    [
      "Gómez",
      "E. S.",
      ""
    ],
    [
      "Walborn",
      "S. P.",
      ""
    ],
    [
      "Lima",
      "G.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 14:49:36 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734619776000,
  "abstract": "  Point tomography is a new approach to the problem of state estimation, which\nis arguably the most efficient and simple method for modern high-precision\nquantum information experiments. In this scenario, the experimenter knows the\ntarget state that their device should prepare, except that intrinsic systematic\nerrors will create small discrepancies in the state actually produced. By\nintroducing a new kind of informationally complete measurement, dubbed\nFisher-symmetric measurements, point tomography determines deviations from the\nexpected state with optimal efficiency. In this method, the number of outcomes\nof a measurement saturating the Gill-Massar limit for reconstructing a\n$d$-dimensional quantum states can be reduced from $\\sim 4d-3$ to only $2d-1$\noutcomes. Thus, providing better scalability as the dimension increases. Here\nwe demonstrate the experimental viability of point tomography. Using a modern\nphotonic platform constructed with state-of-the-art multicore optical fiber\ntechnology, we generate 4-dimensional quantum states and implement\nseven-outcome Fisher-symmetric measurements. Our experimental results exhibit\nthe main feature of point tomography, namely a precision close to the\nGill-Massar limit with a single few-outcome measurement. Specifically, we\nachieved a precision of $3.8/N$ while the Gill-Massar limit for $d=4$ is $3/N$\n($N$ being the ensemble size).\n",
  "subjects": [
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "S6df6EXfQi1cSE3jAsiVtcpNefH61iqN55IJ0s-0s0Y",
  "pdfSize": "1576634"
}