{
  "id": "2412.01247",
  "title": "Optional participation only provides a narrow scope for sustaining\n  cooperation",
  "authors": "Khadija Khatun (1 and 2), Chen Shen (3), and Jun Tanimoto (1 and 3),\n  (1) Interdisciplinary Graduate School of Engineering Sciences, Kyushu\n  University, Japan, (2) Department of Applied Mathematics, University of\n  Dhaka, Bangladesh, (3) Faculty of Engineering Sciences, Kyushu University,\n  Japan",
  "authorsParsed": [
    [
      "Khatun",
      "Khadija",
      "",
      "1 and 2"
    ],
    [
      "Shen",
      "Chen",
      "",
      "1 and 3"
    ],
    [
      "Tanimoto",
      "Jun",
      "",
      "1 and 3"
    ],
    [
      "Sciences",
      "Interdisciplinary Graduate School of Engineering",
      ""
    ],
    [
      "University",
      "Kyushu",
      ""
    ],
    [
      "Japan",
      "",
      ""
    ],
    [
      "Mathematics",
      "Department of Applied",
      ""
    ],
    [
      "Dhaka",
      "University of",
      ""
    ],
    [
      "Bangladesh",
      "",
      ""
    ],
    [
      "Sciences",
      "Faculty of Engineering",
      ""
    ],
    [
      "University",
      "Kyushu",
      ""
    ],
    [
      "Japan",
      "",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 08:07:51 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733126871000,
  "abstract": "  Understanding how cooperation emerges in public goods games is crucial for\naddressing societal challenges. While optional participation can establish\ncooperation without identifying cooperators, it relies on specific assumptions\n-- that individuals abstain and receive a non-negative payoff, or that\nnon-participants cause damage to public goods -- which limits our understanding\nof its broader role. We generalize this mechanism by considering\nnon-participants' payoffs and their potential direct influence on public goods,\nallowing us to examine how various strategic motives for non-participation\naffect cooperation. Using replicator dynamics, we find that cooperation thrives\nonly when non-participants are motivated by individualistic or prosocial\nvalues, with individualistic motivations yielding optimal cooperation. These\nfindings are robust to mutation, which slightly enlarges the region where\ncooperation can be maintained through cyclic dominance among strategies. Our\nresults suggest that while optional participation can benefit cooperation, its\neffectiveness is limited and highlights the limitations of bottom-up schemes in\nsupporting public goods.\n",
  "subjects": [
    "Mathematics/Dynamical Systems"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "qrSXODzzRWCaM4mVRObhViUoZIoZ0VNpcrJvsOYKtC4",
  "pdfSize": "6417554"
}