{"id":"2412.11636","title":"Science Filter Characterization of the Solar Ultraviolet Imaging\n  Telescope (SUIT) on board Aditya-L1","authors":"Janmejoy Sarkar, Rushikesh Deogaonkar, Ravi Kesharwani, Sreejith\n  Padinhatteeri, A. N. Ramaprakash, Durgesh Tripathi, Soumya Roy, Gazi A.\n  Ahmed, Rwitika Chatterjee, Avyarthana Ghosh, Sankarasubramanian K., Aafaque\n  Khan, Nidhi Mehandiratta, Netra Pillai, Swapnil Singh","authorsParsed":[["Sarkar","Janmejoy",""],["Deogaonkar","Rushikesh",""],["Kesharwani","Ravi",""],["Padinhatteeri","Sreejith",""],["Ramaprakash","A. N.",""],["Tripathi","Durgesh",""],["Roy","Soumya",""],["Ahmed","Gazi A.",""],["Chatterjee","Rwitika",""],["Ghosh","Avyarthana",""],["K.","Sankarasubramanian",""],["Khan","Aafaque",""],["Mehandiratta","Nidhi",""],["Pillai","Netra",""],["Singh","Swapnil",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 10:25:47 GMT"}],"updateDate":"2024-12-23","timestamp":1734344747000,"abstract":"  The Solar Ultraviolet Imaging Telescope (SUIT) on board the Aditya-L1 mission\nis designed to observe the Sun across 200-400 nm wavelength. The telescope used\n16 dichroic filters tuned at specific wavelengths in various combinations to\nachieve its science goals. For accurate measurements and interpretation, it is\nimportant to characterize these filters for spectral variations as a function\nof spatial location and tilt angle. Moreover, we also measured out-of-band and\nin-band transmission characteristics with respect to the inband transmissions.\nIn this paper, we present the experimental setup, test methodology, and the\nanalyzed results. Our findings reveal that the transmission properties of all\nfilters meet the expected performance for spatial variation of transmission and\nthe transmission band at a specific tilt angle. The out-of-band transmission\nfor all filters is below 1% with respect to in-band, except for filters BB01\nand NB01. These results confirm the capabilities of SUIT to effectively capture\ncritical solar features in the anticipated layer of the solar atmosphere.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"xTWPPZl6VC9nwM0Oiq8jbiQwdSNTdD5t2423cqmnTpA","pdfSize":"8302818"}