{
  "id": "2412.11740",
  "title": "The fate of Wannier-Stark localization and skin effect in periodically\n  driven non-Hermitian quasiperiodic lattices",
  "authors": "Aditi Chakrabarty and Sanjoy Datta",
  "authorsParsed": [
    [
      "Chakrabarty",
      "Aditi",
      ""
    ],
    [
      "Datta",
      "Sanjoy",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 13:01:35 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734354095000,
  "abstract": "  The eigenstates of one-dimensional Hermitian and non-Hermitian tight-binding\nsystems (in the presence/absence of quasiperiodic potential) and an external\nelectric field undergo complete localization with equally spaced eigenenergies,\nknown as the Wannier-Stark (WS) localization. In this work, we demonstrate that\nwhen the electric field is slowly modulated with time, new non-trivial phases\nwith multiple mobility edges emerge in place of WS localized phase, which\npersists up to a certain strength of the non-Hermiticity. On the other hand,\nfor a large driving frequency, we retrieve the usual sharp\ndelocalization-localization transition to the usual (no WS) localized phase,\nsimilar to the static non-Hermitian Aubry-Andr\\'e-Harper type without any\nelectric field. This vanishing of WS localization can be attributed solely to\nthe time-periodic drive and occurs irrespective of the non-Hermiticity.\nInterestingly, under the open boundary condition (OBC), we find that contrary\nto the undriven systems where an external electric field destroys the SE\ncompletely, the SE appears in certain regime of the parameter space when the\nelectric field is temporally driven. This appearance of SE is closely related\nto the absence of extended unitarity. In addition, in the presence of the\ndrive, the skin states are found to be multifractal, contrary to its usual\nnature in such non-Hermitian systems. An in-depth understanding about the\nbehavior of the states in the driven system is established from the long-time\ndynamics of an initial excitation.\n",
  "subjects": [
    "Condensed Matter/Disordered Systems and Neural Networks",
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "BBkUB3zmqpaLxMnh0CxXUUFxT4ykX-hwFHuCvalGdG8",
  "pdfSize": "17860777"
}