{"id":"2412.00867","title":"Numerical approach to compressible shallow-water dynamics of\n  neutron-star spreading layers","authors":"Aleksandr Rusakov, Pavel Abolmasov, Omer Bromberg","authorsParsed":[["Rusakov","Aleksandr",""],["Abolmasov","Pavel",""],["Bromberg","Omer",""]],"versions":[{"version":"v1","created":"Sun, 1 Dec 2024 16:12:32 GMT"}],"updateDate":"2024-12-03","timestamp":1733069552000,"abstract":"  A weakly magnetized neutron star (NS) undergoing disk accretion should\nrelease about a half of its power in a compact region known as the accretion\nboundary layer. Latitudinal spread of the accreted matter and efficient\nradiative cooling justify the approach to this flow as a two-dimensional\nspreading layer (SL) on the surface of the star. Numerical simulations of SLs\nare challenging because of the curved geometry and supersonic nature of the\nproblem. We develop a new two-dimensional hydrodynamics code that uses the\nmultislope second-order MUSCL scheme in combination with an HLLC+ Riemann\nsolver on an arbitrary irregular mesh on a spherical surface. The code is\nsuitable and accurate for Mach numbers at least up to 5-10. Adding sinks and\nsources to the conserved variables, we simulate constant-rate accretion onto a\nspherical NS. During the early stages of accretion, heating in the equatorial\nregion triggers convective instability that causes rapid mixing in latitudinal\ndirection. One of the outcomes of the instability is the development of a\ntwo-armed `tennis ball' pattern rotating as a rigid body. From the point of\nview of a high-inclination observer, its contribution to the light curve is\nseen as a high-quality-factor quasi-periodic oscillation mode with a frequency\nconsiderably smaller than the rotation frequency of the matter in the SL. Other\nvariability modes seen in the simulated light curves are probably associated\nwith low-azimuthal-number Rossby waves.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"wrt7yoiBDOoKZx2Qo3dVaMYCDaYq7MjQ6Mhq1oCsjOE","pdfSize":"4365921"}