{"id":"2412.17841","title":"Reducing QUBO Density by Factoring Out Semi-Symmetries","authors":"Jonas N\\\"u{\\ss}lein, Leo S\\\"unkel, Jonas Stein, Tobias Rohe,\n  Dani\\\"elle Schuman, Sebastian Feld, Corey O'Meara, Giorgio Cortiana and\n  Claudia Linnhoff-Popien","authorsParsed":[["Nüßlein","Jonas",""],["Sünkel","Leo",""],["Stein","Jonas",""],["Rohe","Tobias",""],["Schuman","Daniëlle",""],["Feld","Sebastian",""],["O'Meara","Corey",""],["Cortiana","Giorgio",""],["Linnhoff-Popien","Claudia",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 12:05:18 GMT"},{"version":"v2","created":"Fri, 27 Dec 2024 16:49:23 GMT"}],"updateDate":"2024-12-30","timestamp":1734523518000,"abstract":"  Quantum Approximate Optimization Algorithm (QAOA) and Quantum Annealing are\nprominent approaches for solving combinatorial optimization problems, such as\nthose formulated as Quadratic Unconstrained Binary Optimization (QUBO). These\nalgorithms aim to minimize the objective function $x^T Q x$, where $Q$ is a\nQUBO matrix. However, the number of two-qubit CNOT gates in QAOA circuits and\nthe complexity of problem embeddings in Quantum Annealing scale linearly with\nthe number of non-zero couplings in $Q$, contributing to significant\ncomputational and error-related challenges. To address this, we introduce the\nconcept of \\textit{semi-symmetries} in QUBO matrices and propose an algorithm\nfor identifying and factoring these symmetries into ancilla qubits.\n\\textit{Semi-symmetries} frequently arise in optimization problems such as\n\\textit{Maximum Clique}, \\textit{Hamilton Cycles}, \\textit{Graph Coloring}, and\n\\textit{Graph Isomorphism}. We theoretically demonstrate that the modified QUBO\nmatrix $Q_{\\text{mod}}$ retains the same energy spectrum as the original $Q$.\nExperimental evaluations on the aforementioned problems show that our algorithm\nreduces the number of couplings and QAOA circuit depth by up to $45\\%$. For\nQuantum Annealing, these reductions also lead to sparser problem embeddings,\nshorter qubit chains and better performance. This work highlights the utility\nof exploiting QUBO matrix structure to optimize quantum algorithms, advancing\ntheir scalability and practical applicability to real-world combinatorial\nproblems.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"vm79JyXiqMJl68bSKrlGPSZBiAtJSMRwA8yYs1zvG8k","pdfSize":"310054"}