{
  "id": "2412.01452",
  "title": "Antennas in Walls: Performance Analysis of Microstrip Patch Antennas\n  Designed for Internet of Paint (IoP)",
  "authors": "Lasantha Thakshila Wedage, Bernard Butler, Mehmet Can Vuran,\n  Sasitharan Balasubramaniam and Christos Argyropoulos",
  "authorsParsed": [
    [
      "Wedage",
      "Lasantha Thakshila",
      ""
    ],
    [
      "Butler",
      "Bernard",
      ""
    ],
    [
      "Vuran",
      "Mehmet Can",
      ""
    ],
    [
      "Balasubramaniam",
      "Sasitharan",
      ""
    ],
    [
      "Argyropoulos",
      "Christos",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 12:42:46 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733143366000,
  "abstract": "  This study presents a simulated transceiver with a microstrip patch antenna\n(MPA) designed to operate at 150 GHz and embedded in a dielectric paint. The\nin-paint MPA (IP-MPA) is designed for the Internet of Paint (IoP) paradigm,\nwhich envisions seamless device communication through a paint layer on walls.\nDue to the paint's dielectric properties, the resonant frequency of the IP-MPA\nlowers to 141.3 GHz, with lower spreading loss. The study introduces a\ncomprehensive channel model between transceivers in paint at arbitrary depths\nas well as IP-MPA angle orientations. The best transceiver orientations are\nanalyzed for IoP channel performance. Our extensive evaluations shows that the\nlateral waves, which propagate along the air-paint interface, have the lowest\nloss, making this path the most reliable communication path between\ntransceivers in paint. Further, all multipaths, except the reflected paths, are\ndepth-independent when the received power is maximized. The findings suggest\nthat the proposed network of IP-MPA-enabled transceivers for IoP has the\npotential to transform conventional walls into an integrated high-speed\nwireless communication infrastructure.\n",
  "subjects": [
    "Computer Science/Emerging Technologies"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "cWkhpE2vhPWLy3lyEyFhZmXmWca3lbUUAl15eHKwv_8",
  "pdfSize": "1496062"
}