{
  "id": "2412.12609",
  "title": "MultiLingPoT: Enhancing Mathematical Reasoning with Multilingual Program\n  Fine-tuning",
  "authors": "Nianqi Li, Zujie Liang, Siyu Yuan, Jiaqing Liang, Feng Wei, Yanghua\n  Xiao",
  "authorsParsed": [
    [
      "Li",
      "Nianqi",
      ""
    ],
    [
      "Liang",
      "Zujie",
      ""
    ],
    [
      "Yuan",
      "Siyu",
      ""
    ],
    [
      "Liang",
      "Jiaqing",
      ""
    ],
    [
      "Wei",
      "Feng",
      ""
    ],
    [
      "Xiao",
      "Yanghua",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 07:14:03 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734419643000,
  "abstract": "  Program-of-Thought (PoT), which aims to use programming language instead of\nnatural language as an intermediate step in reasoning, is an important way for\nLLMs to solve mathematical problems. Since different programming languages\nexcel in different areas, it is natural to use the most suitable language for\nsolving specific problems. However, current PoT research only focuses on single\nlanguage PoT, ignoring the differences between different programming languages.\nTherefore, this paper proposes an multilingual program reasoning method,\nMultiLingPoT. This method allows the model to answer questions using multiple\nprogramming languages by fine-tuning on multilingual data. Additionally, prior\nand posterior hybrid methods are used to help the model select the most\nsuitable language for each problem. Our experimental results show that the\ntraining of MultiLingPoT improves each program's mathematical reasoning by\nabout 2.5\\%. Moreover, with proper mixing, the performance of MultiLingPoT can\nbe further improved, achieving a 6\\% increase compared to the single-language\nPoT with the data augmentation.Resources of this paper can be found at\nhttps://github.com/Nianqi-Li/MultiLingPoT.\n",
  "subjects": [
    "Computer Science/Computation and Language"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "BpnFgq5BtzimJefvC-89PdZqfU7HiKkdeUv-G6rpclI",
  "pdfSize": "668914"
}