{
  "id": "2412.07094",
  "title": "Access Point Deployment for Localizing Accuracy and User Rate in\n  Cell-Free Systems",
  "authors": "Fanfei Xu, Shengheng Liu, Zihuan Mao, Shangqing Shi, Dazhuan Xu,\n  Dongming Wang, Yongming Huang",
  "authorsParsed": [
    [
      "Xu",
      "Fanfei",
      ""
    ],
    [
      "Liu",
      "Shengheng",
      ""
    ],
    [
      "Mao",
      "Zihuan",
      ""
    ],
    [
      "Shi",
      "Shangqing",
      ""
    ],
    [
      "Xu",
      "Dazhuan",
      ""
    ],
    [
      "Wang",
      "Dongming",
      ""
    ],
    [
      "Huang",
      "Yongming",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 01:22:32 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733793752000,
  "abstract": "  Evolving next-generation mobile networks is designed to provide ubiquitous\ncoverage and networked sensing. With utility of multi-view sensing and\nmulti-node joint transmission, cell-free is a promising technique to realize\nthis prospect. This paper aims to tackle the problem of access point (AP)\ndeployment in cell-free systems to balance the sensing accuracy and user rate.\nBy merging the D-optimality with Euclidean criterion, a novel integrated metric\nis proposed to be the objective function for both max-sum and max-min problems,\nwhich respectively guarantee the overall and lowest performance in multi-user\ncommunication and target tracking scenario. To solve the corresponding high\ndimensional non-convex multi-objective problem, the Soft actor-critic (SAC) is\nutilized to avoid risk of local optimal result. Numerical results demonstrate\nthat proposed SAC-based APs deployment method achieves $20\\%$ of overall\nperformance and $120\\%$ of lowest performance.\n",
  "subjects": [
    "Computer Science/Networking and Internet Architecture",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "3xotb7cGoeFEUhSkIuR1Mnm8f3hmbFv1SeO1XlePeyU",
  "pdfSize": "2315196"
}