{
  "id": "2412.02851",
  "title": "Block MedCare: Advancing healthcare through blockchain integration with\n  AI and IoT",
  "authors": "Oliver Simonoski, Dijana Capeska Bogatinoska",
  "authorsParsed": [
    [
      "Simonoski",
      "Oliver",
      ""
    ],
    [
      "Bogatinoska",
      "Dijana Capeska",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 21:31:46 GMT"
    }
  ],
  "updateDate": "2024-12-05",
  "timestamp": 1733261506000,
  "abstract": "  This research explores the integration of blockchain technology in\nhealthcare, focusing on enhancing the security and efficiency of Electronic\nHealth Record (EHR) management. We propose a novel Ethereum-based system that\nempowers patients with secure control over their medical data. Our approach\naddresses key challenges in healthcare blockchain implementation, including\nscalability, privacy, and regulatory compliance. The system incorporates\ndigital signatures, Role-Based Access Control, and a multi-layered architecture\nto ensure secure, controlled access. We developed a decentralized application\n(dApp) with user-friendly interfaces for patients, doctors, and administrators,\ndemonstrating the practical application of our solution. A survey among\nhealthcare professionals and IT experts revealed strong interest in blockchain\nadoption, while also highlighting concerns about integration costs. The study\nexplores future enhancements, including integration with IoT devices and\nAI-driven analytics, contributing to the evolution of secure, efficient, and\ninteroperable healthcare systems that leverage cutting-edge technologies for\nimproved patient care.\n",
  "subjects": [
    "Computer Science/Software Engineering",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Cryptography and Security"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "w97mx6R3vAz29ES147kZE9KxfgBDKdzSqu2-oQFtO6I",
  "pdfSize": "1183952"
}