{
  "id": "2412.01682",
  "title": "Diffusion Models with Anisotropic Gaussian Splatting for Image\n  Inpainting",
  "authors": "Jacob Fein-Ashley and Benjamin Fein-Ashley",
  "authorsParsed": [
    [
      "Fein-Ashley",
      "Jacob",
      ""
    ],
    [
      "Fein-Ashley",
      "Benjamin",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 16:29:06 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 3 Dec 2024 18:44:43 GMT"
    },
    {
      "version": "v3",
      "created": "Sat, 14 Dec 2024 17:46:13 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1733156946000,
  "abstract": "  Image inpainting is a fundamental task in computer vision, aiming to restore\nmissing or corrupted regions in images realistically. While recent deep\nlearning approaches have significantly advanced the state-of-the-art,\nchallenges remain in maintaining structural continuity and generating coherent\ntextures, particularly in large missing areas. Diffusion models have shown\npromise in generating high-fidelity images but often lack the structural\nguidance necessary for realistic inpainting. We propose a novel inpainting\nmethod that combines diffusion models with anisotropic Gaussian splatting to\ncapture both local structures and global context effectively. By modeling\nmissing regions using anisotropic Gaussian functions that adapt to local image\ngradients, our approach provides structural guidance to the diffusion-based\ninpainting network. The Gaussian splat maps are integrated into the diffusion\nprocess, enhancing the model's ability to generate high-fidelity and\nstructurally coherent inpainting results. Extensive experiments demonstrate\nthat our method outperforms state-of-the-art techniques, producing visually\nplausible results with enhanced structural integrity and texture realism.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "acR3ORYOAST5Q9Tk6pahR_i0KImAAZKcF074fZwiwDc",
  "pdfSize": "6460956"
}