{"id":"2412.18500","title":"Joint Adaptive OFDM and Reinforcement Learning Design for Autonomous\n  Vehicles: Leveraging Age of Updates","authors":"Mamady Delamou, Ahmed Naeem, Huseyin Arslan, El Mehdi Amhoud","authorsParsed":[["Delamou","Mamady",""],["Naeem","Ahmed",""],["Arslan","Huseyin",""],["Amhoud","El Mehdi",""]],"versions":[{"version":"v1","created":"Tue, 24 Dec 2024 15:32:58 GMT"}],"updateDate":"2024-12-25","timestamp":1735054378000,"abstract":"  Millimeter wave (mmWave)-based orthogonal frequency-division multiplexing\n(OFDM) stands out as a suitable alternative for high-resolution sensing and\nhigh-speed data transmission. To meet communication and sensing requirements,\nmany works propose a static configuration where the wave's hyperparameters such\nas the number of symbols in a frame and the number of frames in a communication\nslot are already predefined. However, two facts oblige us to redefine the\nproblem, (1) the environment is often dynamic and uncertain, and (2) mmWave is\nseverely impacted by wireless environments. A striking example where this\nchallenge is very prominent is autonomous vehicle (AV). Such a system leverages\nintegrated sensing and communication (ISAC) using mmWave to manage data\ntransmission and the dynamism of the environment. In this work, we consider an\nautonomous vehicle network where an AV utilizes its queue state information\n(QSI) and channel state information (CSI) in conjunction with reinforcement\nlearning techniques to manage communication and sensing. This enables the AV to\nachieve two primary objectives: establishing a stable communication link with\nother AVs and accurately estimating the velocities of surrounding objects with\nhigh resolution. The communication performance is therefore evaluated based on\nthe queue state, the effective data rate, and the discarded packets rate. In\ncontrast, the effectiveness of the sensing is assessed using the velocity\nresolution. In addition, we exploit adaptive OFDM techniques for dynamic\nmodulation, and we suggest a reward function that leverages the age of updates\nto handle the communication buffer and improve sensing. The system is validated\nusing advantage actor-critic (A2C) and proximal policy optimization (PPO).\nFurthermore, we compare our solution with the existing design and demonstrate\nits superior performance by computer simulations.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"JxFO_rVUnsumkbN7n5Wg64bb7woftKGwsWaOD6ViwbY","pdfSize":"691151"}