{
  "id": "2412.06555",
  "title": "When Dimensionality Reduction Meets Graph (Drawing) Theory: Introducing\n  a Common Framework, Challenges and Opportunities",
  "authors": "Fernando Paulovich, Alessio Arleo, Stef van den Elzen",
  "authorsParsed": [
    [
      "Paulovich",
      "Fernando",
      ""
    ],
    [
      "Arleo",
      "Alessio",
      ""
    ],
    [
      "Elzen",
      "Stef van den",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 15:03:22 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733756602000,
  "abstract": "  In the vast landscape of visualization research, Dimensionality Reduction\n(DR) and graph analysis are two popular subfields, often essential to most\nvisual data analytics setups. DR aims to create representations to support\nneighborhood and similarity analysis on complex, large datasets. Graph analysis\nfocuses on identifying the salient topological properties and key actors within\nnetworked data, with specialized research on investigating how such features\ncould be presented to the user to ease the comprehension of the underlying\nstructure. Although these two disciplines are typically regarded as disjoint\nsubfields, we argue that both fields share strong similarities and synergies\nthat can potentially benefit both. Therefore, this paper discusses and\nintroduces a unifying framework to help bridge the gap between DR and graph\n(drawing) theory. Our goal is to use the strongly math-grounded graph theory to\nimprove the overall process of creating DR visual representations. We propose\nhow to break the DR process into well-defined stages, discussing how to match\nsome of the DR state-of-the-art techniques to this framework and presenting\nideas on how graph drawing, topology features, and some popular algorithms and\nstrategies used in graph analysis can be employed to improve DR topology\nextraction, embedding generation, and result validation. We also discuss the\nchallenges and identify opportunities for implementing and using our framework,\nopening directions for future visualization research.\n",
  "subjects": [
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "nv60HSH4sLYFUkhvWe8GCecbSb4kT-oedII6tzVuDPA",
  "pdfSize": "8600548"
}