{
  "id": "2412.19784",
  "title": "Can AI Help with Your Personal Finances?",
  "authors": "Oudom Hean, Utsha Saha and Binita Saha",
  "authorsParsed": [
    [
      "Hean",
      "Oudom",
      ""
    ],
    [
      "Saha",
      "Utsha",
      ""
    ],
    [
      "Saha",
      "Binita",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 27 Dec 2024 18:25:27 GMT"
    },
    {
      "version": "v2",
      "created": "Fri, 3 Jan 2025 17:03:26 GMT"
    },
    {
      "version": "v3",
      "created": "Sun, 12 Jan 2025 01:01:04 GMT"
    },
    {
      "version": "v4",
      "created": "Tue, 14 Jan 2025 02:28:28 GMT"
    }
  ],
  "updateDate": "2025-01-15",
  "timestamp": 1735323927000,
  "abstract": "  In recent years, Large Language Models (LLMs) have emerged as a\ntransformative development in artificial intelligence (AI), drawing significant\nattention from industry and academia. Trained on vast datasets, these\nsophisticated AI systems exhibit impressive natural language processing and\ncontent generation capabilities. This paper explores the potential of LLMs to\naddress key challenges in personal finance, focusing on the United States. We\nevaluate several leading LLMs, including OpenAI's ChatGPT, Google's Gemini,\nAnthropic's Claude, and Meta's Llama, to assess their effectiveness in\nproviding accurate financial advice on topics such as mortgages, taxes, loans,\nand investments. Our findings show that while these models achieve an average\naccuracy rate of approximately 70%, they also display notable limitations in\ncertain areas. Specifically, LLMs struggle to provide accurate responses for\ncomplex financial queries, with performance varying significantly across\ndifferent topics. Despite these limitations, the analysis reveals notable\nimprovements in newer versions of these models, highlighting their growing\nutility for individuals and financial advisors. As these AI systems continue to\nevolve, their potential for advancing AI-driven applications in personal\nfinance becomes increasingly promising.\n",
  "subjects": [
    "Computer Science/Artificial Intelligence",
    "Computer Science/Computational Engineering, Finance, and Science",
    "Computer Science/Machine Learning",
    "Economics/General Economics",
    "Quantitative Finance/Economics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "c1iMrwDfKGX1LShCcSpA8aGs1AZQYFk6B6oh_A0Sfb0",
  "pdfSize": "996021"
}