{"id":"2412.02029","title":"Learning Ensembles of Vision-based Safety Control Filters","authors":"Ihab Tabbara, Hussein Sibai","authorsParsed":[["Tabbara","Ihab",""],["Sibai","Hussein",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 23:19:31 GMT"}],"updateDate":"2024-12-04","timestamp":1733181571000,"abstract":"  Safety filters in control systems correct nominal controls that violate\nsafety constraints. Designing such filters as functions of visual observations\nin uncertain and complex environments is challenging. Several deep\nlearning-based approaches to tackle this challenge have been proposed recently.\nHowever, formally verifying that the learned filters satisfy critical\nproperties that enable them to guarantee the safety of the system is currently\nbeyond reach. Instead, in this work, motivated by the success of ensemble\nmethods in reinforcement learning, we empirically investigate the efficacy of\nensembles in enhancing the accuracy and the out-of-distribution generalization\nof such filters, as a step towards more reliable ones. We experiment with\ndiverse pre-trained vision representation models as filter backbones, training\napproaches, and output aggregation techniques. We compare the performance of\nensembles with different configurations against each other, their individual\nmember models, and large single-model baselines in distinguishing between safe\nand unsafe states and controls in the DeepAccident dataset. Our results show\nthat diverse ensembles have better state and control classification accuracies\ncompared to individual models.\n","subjects":["Computer Science/Machine Learning","Computer Science/Artificial Intelligence","Computer Science/Computer Vision and Pattern Recognition","Computer Science/Robotics","Computer Science/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"3xkA_0amjVL3016MI-PzYTwCxesUHQvyBcx_YTAWVqk","pdfSize":"179646"}