{
  "id": "2412.05197",
  "title": "A Riemannian Take on Distance Fields and Geodesic Flows in Robotics",
  "authors": "Yiming Li, Jiacheng Qiu and Sylvain Calinon",
  "authorsParsed": [
    [
      "Li",
      "Yiming",
      ""
    ],
    [
      "Qiu",
      "Jiacheng",
      ""
    ],
    [
      "Calinon",
      "Sylvain",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 17:22:18 GMT"
    },
    {
      "version": "v2",
      "created": "Mon, 9 Dec 2024 11:12:23 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733505738000,
  "abstract": "  Distance functions are crucial in robotics for representing spatial\nrelationships between the robot and the environment. It provides an implicit\nrepresentation of continuous and differentiable shapes, which can seamlessly be\ncombined with control, optimization, and learning techniques. While standard\ndistance fields rely on the Euclidean metric, many robotic tasks inherently\ninvolve non-Euclidean structures. To this end, we generalize the use of\nEuclidean distance fields to more general metric spaces by solving a Riemannian\neikonal equation, a first-order partial differential equation, whose solution\ndefines a distance field and its associated gradient flow on the manifold,\nenabling the computation of geodesics and globally length-minimizing paths. We\nshow that this \\emph{geodesic distance field} can also be exploited in the\nrobot configuration space. To realize this concept, we exploit physics-informed\nneural networks to solve the eikonal equation for high-dimensional spaces,\nwhich provides a flexible and scalable representation without the need for\ndiscretization. Furthermore, a variant of our neural eikonal solver is\nintroduced, which enables the gradient flow to march across both task and\nconfiguration spaces. As an example of application, we validate the proposed\napproach in an energy-aware motion generation task. This is achieved by\nconsidering a manifold defined by a Riemannian metric in configuration space,\neffectively taking the property of the robot's dynamics into account. Our\napproach produces minimal-energy trajectories for a 7-axis Franka robot by\niteratively tracking geodesics through gradient flow backpropagation.\n",
  "subjects": [
    "Computer Science/Robotics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "RXKTxUKdwVWtLHeMzo8Nz1CPXKb9MyKOgjfRAPrlILU",
  "pdfSize": "6933140"
}