{"id":"2412.15665","title":"Quantum Subroutines in Branch-Price-and-Cut for Vehicle Routing","authors":"Friedrich Wagner and Frauke Liers","authorsParsed":[["Wagner","Friedrich",""],["Liers","Frauke",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 08:27:23 GMT"}],"updateDate":"2024-12-23","timestamp":1734683243000,"abstract":"  Motivated by recent progress in quantum hardware and algorithms researchers\nhave developed quantum heuristics for optimization problems, aiming for\nadvantages over classical methods. To date, quantum hardware is still\nerror-prone and limited in size such that quantum heuristics cannot be scaled\nto relevant problem sizes and are often outperformed by their classical\ncounterparts. Moreover, if provably optimal solutions are desired, one has to\nresort to classical exact methods. As however quantum technologies may improve\nconsiderably in future, we demonstrate in this work how quantum heuristics with\nlimited resources can be integrated in large-scale exact optimization\nalgorithms for NP-hard problems. To this end, we consider vehicle routing as\nprototypical NP-hard problem. We model the pricing and separation subproblems\narising in a branch-price-and-cut algorithm as quadratic unconstrained binary\noptimization problems. This allows to use established quantum heuristics like\nquantum annealing or the quantum approximate optimization algorithm for their\nsolution. A key feature of our algorithm is that it profits not only from the\nbest solution returned by the quantum heuristic but from all solutions below a\ncertain cost threshold, thereby exploiting the inherent randomness is quantum\nalgorithms. Moreover, we reduce the requirements on quantum hardware since the\nsubproblems, which are solved via quantum heuristics, are smaller than the\noriginal problem. We provide an experimental study comparing quantum annealing\nto simulated annealing and to established classical algorithms in our\nframework. While our hybrid quantum-classical approach is still outperformed by\npurely classical methods, our results reveal that both pricing and separation\nmay be well suited for quantum heuristics if quantum hardware improves.\n","subjects":["Physics/Quantum Physics","Computer Science/Discrete Mathematics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"z8k1GMJmcEe-fCq_-I6fKCYU_aGagStO5uEitKY78Ns","pdfSize":"824380"}