{
  "id": "2412.05897",
  "title": "Detecting Discrepancies Between AI-Generated and Natural Images Using\n  Uncertainty",
  "authors": "Jun Nie, Yonggang Zhang, Tongliang Liu, Yiu-ming Cheung, Bo Han,\n  Xinmei Tian",
  "authorsParsed": [
    [
      "Nie",
      "Jun",
      ""
    ],
    [
      "Zhang",
      "Yonggang",
      ""
    ],
    [
      "Liu",
      "Tongliang",
      ""
    ],
    [
      "Cheung",
      "Yiu-ming",
      ""
    ],
    [
      "Han",
      "Bo",
      ""
    ],
    [
      "Tian",
      "Xinmei",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 8 Dec 2024 11:32:25 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733657545000,
  "abstract": "  In this work, we propose a novel approach for detecting AI-generated images\nby leveraging predictive uncertainty to mitigate misuse and associated risks.\nThe motivation arises from the fundamental assumption regarding the\ndistributional discrepancy between natural and AI-generated images. The\nfeasibility of distinguishing natural images from AI-generated ones is grounded\nin the distribution discrepancy between them. Predictive uncertainty offers an\neffective approach for capturing distribution shifts, thereby providing\ninsights into detecting AI-generated images. Namely, as the distribution shift\nbetween training and testing data increases, model performance typically\ndegrades, often accompanied by increased predictive uncertainty. Therefore, we\npropose to employ predictive uncertainty to reflect the discrepancies between\nAI-generated and natural images. In this context, the challenge lies in\nensuring that the model has been trained over sufficient natural images to\navoid the risk of determining the distribution of natural images as that of\ngenerated images. We propose to leverage large-scale pre-trained models to\ncalculate the uncertainty as the score for detecting AI-generated images. This\nleads to a simple yet effective method for detecting AI-generated images using\nlarge-scale vision models: images that induce high uncertainty are identified\nas AI-generated. Comprehensive experiments across multiple benchmarks\ndemonstrate the effectiveness of our method.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "2pZpIG0DM40-9TTHFgaOp64fz7KA9pnfR4XQcfVMc8Q",
  "pdfSize": "2090855"
}