{
  "id": "2412.09474",
  "title": "Optimizing CDN Architectures: Multi-Metric Algorithmic Breakthroughs for\n  Edge and Distributed Performance",
  "authors": "Md Nurul Absur, Sourya Saha, Sifat Nawrin Nova, Kazi Fahim Ahmad\n  Nasif, Md Rahat Ul Nasib",
  "authorsParsed": [
    [
      "Absur",
      "Md Nurul",
      ""
    ],
    [
      "Saha",
      "Sourya",
      ""
    ],
    [
      "Nova",
      "Sifat Nawrin",
      ""
    ],
    [
      "Nasif",
      "Kazi Fahim Ahmad",
      ""
    ],
    [
      "Nasib",
      "Md Rahat Ul",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 17:20:26 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1734024026000,
  "abstract": "  A Content Delivery Network (CDN) is a powerful system of distributed caching\nservers that aims to accelerate content delivery, like high-definition video,\nIoT applications, and ultra-low-latency services, efficiently and with fast\nvelocity. This has become of paramount importance in the post-pandemic era.\nChallenges arise when exponential content volume growth and scalability across\ndifferent geographic locations are required. This paper investigates\ndata-driven evaluations of CDN algorithms in dynamic server selection for\nlatency reduction, bandwidth throttling for efficient resource management,\nreal-time Round Trip Time analysis for adaptive routing, and programmatic\nnetwork delay simulation to emulate various conditions. Key performance\nmetrics, such as round-trip time (RTT) and CPU usage, are carefully analyzed to\nevaluate scalability and algorithmic efficiency through two experimental\nsetups: a constrained edge-like local system and a scalable FABRIC testbed. The\nstatistical validation of RTT trends, alongside CPU utilization, is presented\nin the results. The optimization process reveals significant trade-offs between\nscalability and resource consumption, providing actionable insights for\neffectively deploying and enhancing CDN algorithms in edge and distributed\ncomputing environments.\n",
  "subjects": [
    "Computer Science/Distributed, Parallel, and Cluster Computing"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "zahiKQNgPa4V7EmPNq3uG4gFsVgoG56WaF1oRAPQHkM",
  "pdfSize": "843197"
}