{"id":"2412.09172","title":"Quantifying Roche Lobe Overflow in the Formation of Merging Black Hole\n  Binaries","authors":"David Dickson","authorsParsed":[["Dickson","David",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 11:02:24 GMT"}],"updateDate":"2024-12-13","timestamp":1734001344000,"abstract":"  We demonstrate a new methodology to model Roche lobe overflow (RLO) systems\nto unprecedented resolution simultaneously across the envelope, donor wind,\ntidal stream, and accretion disk regimes without reliance upon\npreviously-universal symmetry, mass flux, and angular momentum flux\nassumptions. We have applied this method to the semidetached high-mass X-ray\nbinary (HMXB) M33 X-7 in order to provide a direct comparison to recent\nobservations of an RLO candidate system at two overflow states of overfilling\nfactors f = 1.01 and f = 1.1. We found extreme overflow ( f = 1.1) to exhibit\nentirely conservative unstable mass transfer (MT), with tidal stream density\nand deflected angle comparable to predictions. The f = 1.01 case differed in\nstream geometry, accretion disk size, and efficiency, demonstrating\nnon-conservative stable MT through a ballistic uniform-width stream. The\nnon-conservative and stable nature of the f = 1.01 case MT also suggests that\nexisting assumptions of semi-detached binaries undergoing RLO may\nmischaracterize the parameter space of stability for the L1 flow. We also\nconducted a piecewise evolution of M33 X-7 across nearly the entirety of RLO\nphase from onset to runaway unstable MT. We present the first model of the\nefficiency of MT and its associated angular momentum across overfilling factor\nparameter space. We also present novel relations for binary separation, mass\nratio, L1 mass transfer rate, and Roche timescale as they vary with respect to\nthe overfilling factor. These provide constraints on the threshold for the\nonset of unstable MT which ultimately led in our system to exponentially faster\nMT evolution. Collectively these parameter constraints, relations, and\nexplorations probe RLO dynamics in HMXBs and their role and distribution as\nprogenitors of binary black holes and common envelopes.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"ZUEcP4bZdr0Iv7m-IhLFRwXU1oBJNlJy3u196Bfua40","pdfSize":"23449211"}