{"id":"2412.04679","title":"Raspberry Pi multispectral imaging camera system (PiMICS): a low-cost,\n  skills-based physics educational tool","authors":"John C. Howell, Brian Flores, Juan Javier Naranjo, Angel Mendez, Cesar\n  Costa-Vera, Chris Koumriqian, Juliana Jordan, Pieter H. Neethling, Calvin\n  Groenewald, Michael A. C. Lovemore, Patrick A. T. Kinsey, and Tjaart P. J.\n  Kruger","authorsParsed":[["Howell","John C.",""],["Flores","Brian",""],["Naranjo","Juan Javier",""],["Mendez","Angel",""],["Costa-Vera","Cesar",""],["Koumriqian","Chris",""],["Jordan","Juliana",""],["Neethling","Pieter H.",""],["Groenewald","Calvin",""],["Lovemore","Michael A. C.",""],["Kinsey","Patrick A. T.",""],["Kruger","Tjaart P. J.",""]],"versions":[{"version":"v1","created":"Fri, 6 Dec 2024 00:24:20 GMT"}],"updateDate":"2024-12-09","timestamp":1733444660000,"abstract":"  We report on an educational pilot program for low-cost physics\nexperimentation run in Ecuador, South Africa, and the United States. The\nprogram was developed after having needs-based discussions with African\neducators, researchers, and leaders. It was determined that the need and desire\nfor low-cost, skills-building, and active-learning tools is very high. From\nthis, we developed a 3D-printable, Raspberry Pi-based multispectral camera (15\nto 25 spectral channels in the visible and near-IR) for as little as $100. The\nprogram allows students to learn 3D modeling, 3D printing, feedback, control,\nimage analysis, Python programming, systems integration and artificial\nintelligence as well as spectroscopy. After completing their cameras, the\nstudents in the program studied plant health, plant stress, post-harvest fruit\nripeness, and polarization and spectral analysis of nanostructured insect\nwings, the latter of which won the ``best-applied research\" award at a\nconference poster session and will be highlighted in this paper. Importantly,\nthese cameras can be an integral part of any developing country's agricultural,\nrecycling, medical, and pharmaceutical infrastructure. Thus, we believe this\nexperiment can play an important role at the intersection of student training\nand developing countries' capacity building.\n","subjects":["Physics/Physics Education","Electrical Engineering and Systems Science/Image and Video Processing","Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Ol-S7TwfHSq4RzEXyUv0ZTl_oTrdaHDhmAJHfYVd8ZA","pdfSize":"6080777"}