{"id":"2412.04693","title":"Sequential anomaly identification with observation control under\n  generalized error metrics","authors":"Aristomenis Tsopelakos, Georgios Fellouris","authorsParsed":[["Tsopelakos","Aristomenis",""],["Fellouris","Georgios",""]],"versions":[{"version":"v1","created":"Fri, 6 Dec 2024 01:07:49 GMT"}],"updateDate":"2024-12-09","timestamp":1733447269000,"abstract":"  The problem of sequential anomaly detection and identification is considered,\nwhere multiple data sources are simultaneously monitored and the goal is to\nidentify in real time those, if any, that exhibit ``anomalous\" statistical\nbehavior. An upper bound is postulated on the number of data sources that can\nbe sampled at each sampling instant, but the decision maker selects which ones\nto sample based on the already collected data. Thus, in this context, a policy\nconsists not only of a stopping rule and a decision rule that determine when\nsampling should be terminated and which sources to identify as anomalous upon\nstopping, but also of a sampling rule that determines which sources to sample\nat each time instant subject to the sampling constraint. Two distinct\nformulations are considered, which require control of different, ``generalized\"\nerror metrics. The first one tolerates a certain user-specified number of\nerrors, of any kind, whereas the second tolerates distinct, user-specified\nnumbers of false positives and false negatives. For each of them, a universal\nasymptotic lower bound on the expected time for stopping is established as the\nerror probabilities go to 0, and it is shown to be attained by a policy that\ncombines the stopping and decision rules proposed in the full-sampling case\nwith a probabilistic sampling rule that achieves a specific long-run sampling\nfrequency for each source. Moreover, the optimal to a first order asymptotic\napproximation expected time for stopping is compared in simulation studies with\nthe corresponding factor in a finite regime, and the impact of the sampling\nconstraint and tolerance to errors is assessed.\n","subjects":["Mathematics/Statistics Theory","Statistics/Statistics Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8MtUqp01rVYJb81IdKPXUJf96i-lAgPpVrX-bSV54PQ","pdfSize":"729106"}