{
  "id": "2412.07698",
  "title": "Quantum vs. Classical Machine Learning Algorithms for Software Defect\n  Prediction: Challenges and Opportunities",
  "authors": "Md Nadim, Mohammad Hassan, Ashis Kumar Mandal, Chanchal K. Roy",
  "authorsParsed": [
    [
      "Nadim",
      "Md",
      ""
    ],
    [
      "Hassan",
      "Mohammad",
      ""
    ],
    [
      "Mandal",
      "Ashis Kumar",
      ""
    ],
    [
      "Roy",
      "Chanchal K.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 17:38:36 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733852316000,
  "abstract": "  Software defect prediction is a critical aspect of software quality\nassurance, as it enables early identification and mitigation of defects,\nthereby reducing the cost and impact of software failures. Over the past few\nyears, quantum computing has risen as an exciting technology capable of\ntransforming multiple domains; Quantum Machine Learning (QML) is one of them.\nQML algorithms harness the power of quantum computing to solve complex problems\nwith better efficiency and effectiveness than their classical counterparts.\nHowever, research into its application in software engineering to predict\nsoftware defects still needs to be explored. In this study, we worked to fill\nthe research gap by comparing the performance of three QML and five classical\nmachine learning (CML) algorithms on the 20 software defect datasets. Our\ninvestigation reports the comparative scenarios of QML vs. CML algorithms and\nidentifies the better-performing and consistent algorithms to predict software\ndefects. We also highlight the challenges and future directions of employing\nQML algorithms in real software defect datasets based on the experience we\nfaced while performing this investigation. The findings of this study can help\npractitioners and researchers further progress in this research domain by\nmaking software systems reliable and bug-free.\n",
  "subjects": [
    "Computer Science/Software Engineering",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "fpmrDrp3MDWl4MN0iKYOzDQhYsDV9bP-LKIi1Zingkc",
  "pdfSize": "511009"
}