{"id":"2412.11561","title":"RADARSAT Constellation Mission Compact Polarisation SAR Data for Burned\n  Area Mapping with Deep Learning","authors":"Yu Zhao, Yifang Ban","authorsParsed":[["Zhao","Yu",""],["Ban","Yifang",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 08:47:55 GMT"}],"updateDate":"2024-12-17","timestamp":1734338875000,"abstract":"  Monitoring wildfires has become increasingly critical due to the sharp rise\nin wildfire incidents in recent years. Optical satellites like Sentinel-2 and\nLandsat are extensively utilized for mapping burned areas. However, the\neffectiveness of optical sensors is compromised by clouds and smoke, which\nobstruct the detection of burned areas. Thus, satellites equipped with\nSynthetic Aperture Radar (SAR), such as dual-polarization Sentinel-1 and\nquad-polarization RADARSAT-1/-2 C-band SAR, which can penetrate clouds and\nsmoke, are investigated for mapping burned areas. However, there is limited\nresearch on using compact polarisation (compact-pol) C-band RADARSAT\nConstellation Mission (RCM) SAR data for this purpose. This study aims to\ninvestigate the capacity of compact polarisation RCM data for burned area\nmapping through deep learning. Compact-pol m-chi decomposition and Compact-pol\nRadar Vegetation Index (CpRVI) are derived from the RCM Multi-look Complex\nproduct. A deep-learning-based processing pipeline incorporating ConvNet-based\nand Transformer-based models is applied for burned area mapping, with three\ndifferent input settings: using only log-ratio dual-polarization intensity\nimages images, using only compact-pol decomposition plus CpRVI, and using all\nthree data sources. The results demonstrate that compact-pol m-chi\ndecomposition and CpRVI images significantly complement log-ratio images for\nburned area mapping. The best-performing Transformer-based model, UNETR,\ntrained with log-ratio, m-chi decomposition, and CpRVI data, achieved an F1\nScore of 0.718 and an IoU Score of 0.565, showing a notable improvement\ncompared to the same model trained using only log-ratio images.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"AuHepQugiklWphz3QlIUthe1fM5H0ZYktXFwxs6GtVg","pdfSize":"25451915"}