{
  "id": "2412.15208",
  "title": "OpenEMMA: Open-Source Multimodal Model for End-to-End Autonomous Driving",
  "authors": "Shuo Xing, Chengyuan Qian, Yuping Wang, Hongyuan Hua, Kexin Tian, Yang\n  Zhou, Zhengzhong Tu",
  "authorsParsed": [
    [
      "Xing",
      "Shuo",
      ""
    ],
    [
      "Qian",
      "Chengyuan",
      ""
    ],
    [
      "Wang",
      "Yuping",
      ""
    ],
    [
      "Hua",
      "Hongyuan",
      ""
    ],
    [
      "Tian",
      "Kexin",
      ""
    ],
    [
      "Zhou",
      "Yang",
      ""
    ],
    [
      "Tu",
      "Zhengzhong",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 18:59:40 GMT"
    },
    {
      "version": "v2",
      "created": "Fri, 14 Feb 2025 23:22:47 GMT"
    }
  ],
  "updateDate": "2025-02-18",
  "timestamp": 1734634780000,
  "abstract": "  Since the advent of Multimodal Large Language Models (MLLMs), they have made\na significant impact across a wide range of real-world applications,\nparticularly in Autonomous Driving (AD). Their ability to process complex\nvisual data and reason about intricate driving scenarios has paved the way for\na new paradigm in end-to-end AD systems. However, the progress of developing\nend-to-end models for AD has been slow, as existing fine-tuning methods demand\nsubstantial resources, including extensive computational power, large-scale\ndatasets, and significant funding. Drawing inspiration from recent advancements\nin inference computing, we propose OpenEMMA, an open-source end-to-end\nframework based on MLLMs. By incorporating the Chain-of-Thought reasoning\nprocess, OpenEMMA achieves significant improvements compared to the baseline\nwhen leveraging a diverse range of MLLMs. Furthermore, OpenEMMA demonstrates\neffectiveness, generalizability, and robustness across a variety of challenging\ndriving scenarios, offering a more efficient and effective approach to\nautonomous driving. We release all the codes in\nhttps://github.com/taco-group/OpenEMMA.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Machine Learning",
    "Computer Science/Robotics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "IoqfCwXxZpavqYgnq13C-DEda7Sgcj6U_0plEgmUmlQ",
  "pdfSize": "4649904"
}