{"id":"2412.13130","title":"Higgs Factory options for CERN: A comparative study","authors":"Alain Blondel, Christophe Grojean, Patrick Janot, Guy Wilkinson","authorsParsed":[["Blondel","Alain",""],["Grojean","Christophe",""],["Janot","Patrick",""],["Wilkinson","Guy",""]],"versions":[{"version":"v1","created":"Tue, 17 Dec 2024 17:47:44 GMT"}],"updateDate":"2024-12-18","timestamp":1734457664000,"abstract":"  ``All future $e^+e^-$ Higgs factories have similar reach for the precise\nmeasurement of the Higgs boson properties.'': this popular statement has often\nled to the impression that all $\\rm e^+e^-$ options are scientifically\nequivalent when it comes to choosing the future post-LHC collider at CERN. More\nrecently, the concept of sustainability has been added in attempts to rank\nHiggs factories. A comparative analysis of the data currently available is\nperformed in this note to clarify these issues for three different options: the\nfuture circular colliders (FCC), and two linear collider alternatives (CLIC and\nILC@CERN).\n  The main observation is as follows. For the precise measurement of already\ndemonstrated Higgs decays (b\\=b, $\\tau^+\\tau^-$, gg, ZZ, WW) and for $\\rm H \\to\nc\\bar c$, it would take half a century to CLIC and ILC@CERN to reach the\nprecisions that FCC-ee can achieve in 8 years thanks to its large luminosity\nand its four interactions points. The corresponding electricity consumption,\ncost and carbon footprint would also be very significantly larger with linear\ncolliders than with FCC-ee.\n  Considering in addition that (i) [...]; (ii) [...]; (iii) [...]; and {\\it\n(iv)} the vast experimental programme achievable with both FCC-ee and FCC-hh is\nout of reach of linear colliders; it is found that FCC-ee is a vastly superior\noption for CERN, and the only first step en route to the 100\\,TeV hadron\ncollider.\n","subjects":["Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Experiment"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0pki0XtqyVN8YY1JJxx1Q0QLGNCF33z_fj8NdRoSZvA","pdfSize":"826312"}