{
  "id": "2412.03237",
  "title": "Ab-initio study of the beta Fe2O3 phase",
  "authors": "Priyanka Mishra, Carmine Autieri",
  "authorsParsed": [
    [
      "Mishra",
      "Priyanka",
      ""
    ],
    [
      "Autieri",
      "Carmine",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 11:38:16 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733312296000,
  "abstract": "  We present first-principles results on the electronic and magnetic properties\nof the cubic bulk $\\beta$-phase of iron(III) oxide (Fe$_2$O$_3$). Given that\nall Fe-Fe magnetic couplings are expected to be antiferromagnetic within this\nhigh-symmetry crystal structure, the system may exhibit some signature of\nmagnetic frustration, making it challenging to identify its magnetic ground\nstate. We have analyzed the possible magnetic phases of the $\\beta$-phase among\nwhich there are ferrimagnets, altermagnets and Kramers antiferromagnets. While\nthe $\\alpha$-phase is an altermagnet and the $\\gamma$-phase is a ferrimagnet,\nwe conclude that the magnetic ground state for the bulk $\\beta$-phase of\nFe$_2$O$_3$ is a Kramers antiferromagnet, moreover, we find that close in\nenergy there is a bulk d-wave altermagnetic phase. We report the density of\nstates and the evolution band gap as a function of the electronic correlations,\nfor suitable values of the Coulomb repulsion the system is a charge-transfer\ninsulator with an indirect band gap of 1.5 eV. As the opposite to the\n$\\gamma$-phase, the magnetic configuration between first-neighbor of the same\nkind is always antiferromagnetic while the magnetic configuration between\nFe$_a$ and Fe$_b$ is ferro or antiferro. In this magnetic arrangement,\nfirst-neighbor interactions cancel out in the mean-field estimation of the\nN\\'eel temperature, leaving second-neighbor magnetic exchanges as the primary\ncontributors, resulting in a N\\'eel temperature lower than that of other\nphases. Our work paves the way toward the ab initio study of nanoparticles and\nalloys for the $\\beta$-phase of Fe$_2$O$_3$.\n",
  "subjects": [
    "Condensed Matter/Materials Science"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "A5P1ZYTPfTOvTt2gzxOZPGlQTShBeft8l2Tgcwus17Y",
  "pdfSize": "2607286"
}