{
  "id": "2412.12173",
  "title": "A NotSo Simple Way to Beat Simple Bench",
  "authors": "Soham Sane and Angus McLean",
  "authorsParsed": [
    [
      "Sane",
      "Soham",
      ""
    ],
    [
      "McLean",
      "Angus",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 16:04:31 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734019471000,
  "abstract": "  This paper presents a novel framework for enhancing reasoning capabilities in\nlarge language models (LLMs) by leveraging iterative reasoning and\nfeedback-driven methodologies. Building on the limitations identified in the\nSimpleBench benchmark, a dataset designed to evaluate logical coherence and\nreal-world reasoning, we propose a multi-step prompting strategy coupled with\nglobal consistency checks to improve model accuracy and robustness. Through\ncomparative analysis of state-of-the-art models, including Claude 3 Opus,\nClaude 3.5, GPT- 4o, and o1-preview, we demonstrate that iterative reasoning\nsignificantly enhances model performance, with improvements observed in both\nstandard accuracy metrics (AVG@5) and a newly introduced metric, Extreme\nAveraging (EAG@5). Our results reveal model-specific strengths: Claude excels\nin maintaining logical consistency, while GPT-4o exhibits exploratory\ncreativity but struggles with ambiguous prompts. By analyzing case studies and\nidentifying gaps in spatial and temporal reasoning, we highlight areas for\nfurther refinement. The findings underscore the potential of structured\nreasoning frameworks to address inherent model limitations, irrespective of\npretraining methodologies. This study lays the groundwork for integrating\ndynamic feedback mechanisms, adaptive restart strategies, and diverse\nevaluation metrics to advance LLM reasoning capabilities across complex and\nmulti-domain problem spaces.\n",
  "subjects": [
    "Computer Science/Computation and Language",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "mqqiRs7fjUi-3sVLzP48H4NvCuQImhaiG9Zp7S_BHZE",
  "pdfSize": "1205090"
}