{
  "id": "2412.05637",
  "title": "Enhancing Fenton-like Photo-degradation and Electrocatalytic Oxygen\n  Evolution Reaction (OER) in Fe-doped Copper Oxide (CuO) Catalysts",
  "authors": "Suresh Chandra Baral, Dilip Sasmal, Sayak Datta, Mange Ram, Krishna\n  Kanta Haldar, A. Mekki and Somaditya Sen",
  "authorsParsed": [
    [
      "Baral",
      "Suresh Chandra",
      ""
    ],
    [
      "Sasmal",
      "Dilip",
      ""
    ],
    [
      "Datta",
      "Sayak",
      ""
    ],
    [
      "Ram",
      "Mange",
      ""
    ],
    [
      "Haldar",
      "Krishna Kanta",
      ""
    ],
    [
      "Mekki",
      "A.",
      ""
    ],
    [
      "Sen",
      "Somaditya",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 7 Dec 2024 12:47:31 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733575651000,
  "abstract": "  Although hydrogen generation by water electrolysis is the cheapest of all\nother available sources, water splitting still occurs with sluggish kinetics.\nIt is a challenging barrier for H2 production on a large scale. Moreover,\nresearch is still underway to understand the oxygen evolution reaction (OER)\nand design the catalysts with improved OER performance. Herein, we report the\nsynthesis, characterization, and OER performance of iron-doped copper oxide\n(CuO) as low-cost catalysts for water oxidation. The OER occurs at about 1.49 V\nversus the RHE with a Tafel slope of 69 mV/dec in a 1 M KOH solution. The\noverpotential of 338 mV at 10 mA/cm2 is among the lowest compared with other\ncopper-based materials. The catalyst can deliver a stable current density of\n>10 mA/cm2 for more than 10 hours. Additionally, wastewater treatment,\nparticularly synthetic dye wastewater, is vital for preventing water scarcity\nand adverse effects on human health and ecotoxicology. The as-synthesized\ncatalysts are also utilized for Fenton-like photo-degradation under low-power\nvisible household LED lights toward the most commonly industrially used\nsimulated Methylene blue dye wastewater. Almost complete degradation of the MB\ndye has been achieved within 50 minutes of visible light irradiation with a\nfirst-order rate constant of 0.0973/min. This dual functionality feature can\nopen new pathways as a non-noble, highly efficient, and robust catalyst for OER\nand wastewater treatments.\n",
  "subjects": [
    "Physics/Applied Physics",
    "Condensed Matter/Materials Science",
    "Physics/Chemical Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "vuZ2Sj_ZY-SNrp13upwQKG4JpwshwqKWL85S8isGW90",
  "pdfSize": "1777973"
}