{"id":"2412.20438","title":"Integrating Natural Language Processing Techniques of Text Mining Into\n  Financial System: Applications and Limitations","authors":"Denisa Millo, Blerina Vika, Nevila Baci","authorsParsed":[["Millo","Denisa",""],["Vika","Blerina",""],["Baci","Nevila",""]],"versions":[{"version":"v1","created":"Sun, 29 Dec 2024 11:25:03 GMT"}],"updateDate":"2024-12-31","timestamp":1735471503000,"abstract":"  The financial sector, a pivotal force in economic development, increasingly\nuses the intelligent technologies such as natural language processing to\nenhance data processing and insight extraction. This research paper through a\nreview process of the time span of 2018-2023 explores the use of text mining as\nnatural language processing techniques in various components of the financial\nsystem including asset pricing, corporate finance, derivatives, risk\nmanagement, and public finance and highlights the need to address the specific\nproblems in the discussion section. We notice that most of the research\nmaterials combined probabilistic with vector-space models, and text-data with\nnumerical ones. The most used technique regarding information processing is the\ninformation classification technique and the most used algorithms include the\nlong-short term memory and bidirectional encoder models. The research noticed\nthat new specific algorithms are developed and the focus of the financial\nsystem is mainly on asset pricing component. The research also proposes a path\nfrom engineering perspective for researchers who need to analyze financial\ntext. The challenges regarding text mining perspective such as data quality,\ncontext-adaption and model interpretability need to be solved so to integrate\nadvanced natural language processing models and techniques in enhancing\nfinancial analysis and prediction. Keywords: Financial System (FS), Natural\nLanguage Processing (NLP), Software and Text Engineering, Probabilistic,\nVector-Space, Models, Techniques, TextData, Financial Analysis.\n","subjects":["Computer Science/Computation and Language","Computer Science/Artificial Intelligence","Economics/General Economics","Quantitative Finance/Economics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_gHHGTdXfGD4xjSx34l6ZtpyMn3-JJAh2sHYAsrOtGk","pdfSize":"453052"}