{"id":"2412.19701","title":"Magnetic fields on different spatial scales of the L328 cloud","authors":"Shivani Gupta, Archana Soam, Janik Karoly, Chang Won Lee, Maheswar G","authorsParsed":[["Gupta","Shivani",""],["Soam","Archana",""],["Karoly","Janik",""],["Lee","Chang Won",""],["G","Maheswar",""]],"versions":[{"version":"v1","created":"Fri, 27 Dec 2024 15:53:45 GMT"}],"updateDate":"2024-12-30","timestamp":1735314825000,"abstract":"  L328 core has three sub-cores S1, S2, and S3, among which the sub-core S2\ncontains L328-IRS, a Very Low Luminosity Object (VeLLO), which shows a CO\nbipolar outflow. Earlier investigations of L328 mapped cloud/envelope\n(parsec-scale) magnetic fields (B-fields). In this work, we used JCMT/POL-2\nsubmillimeter (sub-mm) polarisation measurements at 850 $\\mu$m to map\ncore-scale B-fields in L328. The B-fields were found to be ordered and\nwell-connected from cloud to core-scales, i.e., from parsec- to\nsub-parsec-scale. The connection in B-field geometry is shown using $Planck$\ndust polarisation maps to trace large-scale B-fields, optical and near-infrared\n(NIR) polarisation observations to trace B-fields in the cloud and envelope,\nand 850 $\\mu$m polarisation mapping core-scale field geometry. The core-scale\nB-field strength, estimated using the modified Davis-Chandrasekhar-Fermi\nrelation, was found to be 50.5 $\\pm$ 9.8 $\\mu$G, which is $\\sim$2.5 times\nhigher than the envelope B-field strength found in previous studies. This\nindicates that B-fields are getting stronger on smaller (sub-parsec) scales.\nThe mass-to-flux ratio of 1.1 $\\pm$ 0.2 suggests that the core is magnetically\ntranscritical. The energy budget in the L328 core was also estimated, revealing\nthat the gravitational, magnetic, and non-thermal kinetic energies were\ncomparable with each other, while thermal energy was significantly lower.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"dv8l7MrzjkogVggfLcRk6CecLhJIqJl0GA9uNNjvz9k","pdfSize":"7723280"}