{
  "id": "2412.16207",
  "title": "Synthetic Time Series Data Generation for Healthcare Applications: A PCG\n  Case Study",
  "authors": "Ainaz Jamshidi, Muhammad Arif, Sabir Ali Kalhoro, Alexander Gelbukh",
  "authorsParsed": [
    [
      "Jamshidi",
      "Ainaz",
      ""
    ],
    [
      "Arif",
      "Muhammad",
      ""
    ],
    [
      "Kalhoro",
      "Sabir Ali",
      ""
    ],
    [
      "Gelbukh",
      "Alexander",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 18:07:40 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734458860000,
  "abstract": "  The generation of high-quality medical time series data is essential for\nadvancing healthcare diagnostics and safeguarding patient privacy.\nSpecifically, synthesizing realistic phonocardiogram (PCG) signals offers\nsignificant potential as a cost-effective and efficient tool for cardiac\ndisease pre-screening. Despite its potential, the synthesis of PCG signals for\nthis specific application received limited attention in research. In this\nstudy, we employ and compare three state-of-the-art generative models from\ndifferent categories - WaveNet, DoppelGANger, and DiffWave - to generate\nhigh-quality PCG data. We use data from the George B. Moody PhysioNet Challenge\n2022. Our methods are evaluated using various metrics widely used in the\nprevious literature in the domain of time series data generation, such as mean\nabsolute error and maximum mean discrepancy. Our results demonstrate that the\ngenerated PCG data closely resembles the original datasets, indicating the\neffectiveness of our generative models in producing realistic synthetic PCG\ndata. In our future work, we plan to incorporate this method into a data\naugmentation pipeline to synthesize abnormal PCG signals with heart murmurs, in\norder to address the current scarcity of abnormal data. We hope to improve the\nrobustness and accuracy of diagnostic tools in cardiology, enhancing their\neffectiveness in detecting heart murmurs.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Computational Engineering, Finance, and Science",
    "Electrical Engineering and Systems Science/Signal Processing"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "S5J26xJxzGffX3vW2Jm2vVw9CU6oqgeEhF1qVLdo_o4",
  "pdfSize": "800464"
}