{"id":"2412.12541","title":"LLMCL-GEC: Advancing Grammatical Error Correction with LLM-Driven\n  Curriculum Learning","authors":"Tao Fang, Derek F. Wong, Lusheng Zhang, Keyan Jin, Qiang Zhang,\n  Tianjiao Li, Jinlong Hou, Lidia S. Chao","authorsParsed":[["Fang","Tao",""],["Wong","Derek F.",""],["Zhang","Lusheng",""],["Jin","Keyan",""],["Zhang","Qiang",""],["Li","Tianjiao",""],["Hou","Jinlong",""],["Chao","Lidia S.",""]],"versions":[{"version":"v1","created":"Tue, 17 Dec 2024 05:09:07 GMT"}],"updateDate":"2024-12-18","timestamp":1734412147000,"abstract":"  While large-scale language models (LLMs) have demonstrated remarkable\ncapabilities in specific natural language processing (NLP) tasks, they may\nstill lack proficiency compared to specialized models in certain domains, such\nas grammatical error correction (GEC). Drawing inspiration from the concept of\ncurriculum learning, we have delved into refining LLMs into proficient GEC\nexperts by devising effective curriculum learning (CL) strategies. In this\npaper, we introduce a novel approach, termed LLM-based curriculum learning,\nwhich capitalizes on the robust semantic comprehension and discriminative\nprowess inherent in LLMs to gauge the complexity of GEC training data. Unlike\ntraditional curriculum learning techniques, our method closely mirrors human\nexpert-designed curriculums. Leveraging the proposed LLM-based CL method, we\nsequentially select varying levels of curriculums ranging from easy to hard,\nand iteratively train and refine using the pretrianed T5 and LLaMA series\nmodels. Through rigorous testing and analysis across diverse benchmark\nassessments in English GEC, including the CoNLL14 test, BEA19 test, and BEA19\ndevelopment sets, our approach showcases a significant performance boost over\nbaseline models and conventional curriculum learning methodologies.\n","subjects":["Computer Science/Computation and Language","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"s-Lvvk1UopGWkhL8kZ389e0R7eW48lAEfsP4-GxQtQQ","pdfSize":"1006507"}