{"id":"2412.04528","title":"Chemical Abundances in the Nuclear Star Cluster of the Milky Way:\n  alpha-Element Trends and Their Similarities with the Inner Bulge","authors":"N. Ryde, G. Nandakumar, M. Schultheis, G. Kordopatis, P. di Matteo, M.\n  Haywood, R. Sch\\\"odel, F. Nogueras-Lara, R. M. Rich, B. Thorsbro, G. Mace, O.\n  Agertz, A. M. Amarsi, J. Kocher, M. Molero, L. Origlia, G. Pagnini, and E.\n  Spitoni","authorsParsed":[["Ryde","N.",""],["Nandakumar","G.",""],["Schultheis","M.",""],["Kordopatis","G.",""],["di Matteo","P.",""],["Haywood","M.",""],["Schödel","R.",""],["Nogueras-Lara","F.",""],["Rich","R. M.",""],["Thorsbro","B.",""],["Mace","G.",""],["Agertz","O.",""],["Amarsi","A. M.",""],["Kocher","J.",""],["Molero","M.",""],["Origlia","L.",""],["Pagnini","G.",""],["Spitoni","E.",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 16:45:43 GMT"}],"updateDate":"2024-12-09","timestamp":1733417143000,"abstract":"  A chemical characterization of the Galactic Center is essential for\nunderstanding its formation and structural evolution. Trends of alpha-elements,\nsuch as Mg, Si, and Ca, serve as powerful diagnostic tools, offering insights\ninto star-formation rates and gas-infall history. However, high extinction has\npreviously hindered such studies. In this study, we present a detailed chemical\nabundance analysis of M giants in the Milky Way's Nuclear Star Cluster (NSC),\nfocusing on alpha-element trends with metallicity. High-resolution,\nnear-infrared spectra were obtained using the IGRINS spectrograph on the Gemini\nSouth telescope for nine M giants. Careful selection of spectral lines, based\non a solar-neighborhood control sample of 50 M giants, was implemented to\nminimize systematic uncertainties. Our findings show enhanced alpha-element\nabundances in the predominantly metal-rich NSC stars, consistent with trends in\nthe inner bulge. The NSC stars follow the high-[alpha/Fe] envelope seen in the\nsolar vicinity's metal-rich population, indicating a high star-formation rate.\nThe alpha-element trends decrease with increasing metallicity, also at the\nhighest metallicities. Our results suggest the NSC population likely shares a\nsimilar evolutionary history with the inner bulge, challenging the idea of a\nrecent dominant star formation burst. This connection between the NSC and the\ninner-disk sequence suggests that the chemical properties of extragalactic NSCs\nof Milky Way type galaxies could serve as a proxy for understanding the host\ngalaxies' evolutionary processes.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"te5gPByZe7rN3I1X_9t1pRgu9Nx4Gtqrl9fpTG692mY","pdfSize":"6367493"}