{
  "id": "2412.19814",
  "title": "Predicting Human Brain States with Transformer",
  "authors": "Yifei Sun, Mariano Cabezas, Jiah Lee, Chenyu Wang, Wei Zhang, Fernando\n  Calamante, Jinglei Lv",
  "authorsParsed": [
    [
      "Sun",
      "Yifei",
      ""
    ],
    [
      "Cabezas",
      "Mariano",
      ""
    ],
    [
      "Lee",
      "Jiah",
      ""
    ],
    [
      "Wang",
      "Chenyu",
      ""
    ],
    [
      "Zhang",
      "Wei",
      ""
    ],
    [
      "Calamante",
      "Fernando",
      ""
    ],
    [
      "Lv",
      "Jinglei",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 00:18:39 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1733876319000,
  "abstract": "  The human brain is a complex and highly dynamic system, and our current\nknowledge of its functional mechanism is still very limited. Fortunately, with\nfunctional magnetic resonance imaging (fMRI), we can observe blood oxygen\nlevel-dependent (BOLD) changes, reflecting neural activity, to infer brain\nstates and dynamics. In this paper, we ask the question of whether the brain\nstates rep-resented by the regional brain fMRI can be predicted. Due to the\nsuccess of self-attention and the transformer architecture in sequential\nauto-regression problems (e.g., language modelling or music generation), we\nexplore the possi-bility of the use of transformers to predict human brain\nresting states based on the large-scale high-quality fMRI data from the human\nconnectome project (HCP). Current results have shown that our model can\naccurately predict the brain states up to 5.04s with the previous 21.6s.\nFurthermore, even though the prediction error accumulates for the prediction of\na longer time period, the gen-erated fMRI brain states reflect the architecture\nof functional connectome. These promising initial results demonstrate the\npossibility of developing gen-erative models for fMRI data using self-attention\nthat learns the functional or-ganization of the human brain. Our code is\navailable at: https://github.com/syf0122/brain_state_pred.\n",
  "subjects": [
    "Quantitative Biology/Neurons and Cognition",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "-mIX5ysghAvWo8Uhs-h7v-x3wxCylHey4ti474RoeC0",
  "pdfSize": "624075"
}