{
  "id": "2412.15679",
  "title": "High-Dimensional Bayesian Optimisation with Large-Scale Constraints via\n  Latent Space Gaussian Processes",
  "authors": "Hauke F. Maathuis, Roeland De Breuker, Saullo G.P. Castro",
  "authorsParsed": [
    [
      "Maathuis",
      "Hauke F.",
      ""
    ],
    [
      "De Breuker",
      "Roeland",
      ""
    ],
    [
      "Castro",
      "Saullo G. P.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 08:51:14 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734684674000,
  "abstract": "  Design optimisation offers the potential to develop lightweight aircraft\nstructures with reduced environmental impact. Due to the high number of design\nvariables and constraints, these challenges are typically addressed using\ngradient-based optimisation methods to maintain efficiency. However, this\napproach often results in a local solution, overlooking the global design\nspace. Moreover, gradients are frequently unavailable. Bayesian Optimisation\npresents a promising alternative, enabling sample-efficient global optimisation\nthrough probabilistic surrogate models that do not depend on gradients.\nAlthough Bayesian Optimisation has shown its effectiveness for problems with a\nsmall number of design variables, it struggles to scale to high-dimensional\nproblems, particularly when incorporating large-scale constraints. This\nchallenge is especially pronounced in aeroelastic tailoring, where directional\nstiffness properties are integrated into the structural design to manage\naeroelastic deformations and enhance both aerodynamic and structural\nperformance. Ensuring the safe operation of the system requires simultaneously\naddressing constraints from various analysis disciplines, making global design\nspace exploration even more complex. This study seeks to address this issue by\nemploying high-dimensional Bayesian Optimisation combined with a dimensionality\nreduction technique to tackle the optimisation challenges in aeroelastic\ntailoring. The proposed approach is validated through experiments on a\nwell-known benchmark case with black-box constraints, as well as its\napplication to the aeroelastic tailoring problem, demonstrating the feasibility\nof Bayesian Optimisation for high-dimensional problems with large-scale\nconstraints.\n",
  "subjects": [
    "Computer Science/Computational Engineering, Finance, and Science"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "mYGjTMV5uGcbr1i-jvX9YY87NxGK22kVK20DNlfmfwk",
  "pdfSize": "1889132"
}