{"id":"2412.16922","title":"Enhancing Supply Chain Transparency in Emerging Economies Using Online\n  Contents and LLMs","authors":"Bohan Jin, Qianyou Sun, Lihua Chen","authorsParsed":[["Jin","Bohan",""],["Sun","Qianyou",""],["Chen","Lihua",""]],"versions":[{"version":"v1","created":"Sun, 22 Dec 2024 08:46:16 GMT"}],"updateDate":"2024-12-24","timestamp":1734857176000,"abstract":"  In the current global economy, supply chain transparency plays a pivotal role\nin ensuring this security by enabling companies to monitor supplier performance\nand fostering accountability and responsibility. Despite the advancements in\nsupply chain relationship datasets like Bloomberg and FactSet, supply chain\ntransparency remains a significant challenge in emerging economies due to\nissues such as information asymmetry and institutional gaps in regulation. This\nstudy proposes a novel approach to enhance supply chain transparency in\nemerging economies by leveraging online content and large language models\n(LLMs). We develop a Supply Chain Knowledge Graph Mining System that integrates\nadvanced LLMs with web crawler technology to automatically collect and analyze\nsupply chain information. The system's effectiveness is validated through a\ncase study focusing on the semiconductor supply chain, a domain that has\nrecently gained significant attention due to supply chain risks. Our results\ndemonstrate that the proposed system provides greater applicability for\nemerging economies, such as mainland China, complementing the data gaps in\nexisting datasets. However, challenges including the accurate estimation of\nmonetary and material flows, the handling of time series data, synonyms\ndisambiguation, and mitigating biases from online contents still remains.\nFuture research should focus on addressing these issues to further enhance the\nsystem's capabilities and broaden its application to other emerging economies\nand industries.\n","subjects":["Computer Science/Information Retrieval","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"gKCLDsyMRr6Qrfiohwwn3WbAMSub7IHN60BhWNFxW-M","pdfSize":"609983"}