{
  "id": "2412.05962",
  "title": "Waveform Reconstruction of Core-Collapse Supernova Gravitational Waves\n  with Improved Multisynchrosqueezing Transform",
  "authors": "Yong Yuan, Ao-Ran Wang, Zhuo-Tao Li, Gang Yu, Hou-Jun L\\\"u, Peng Xu,\n  Xi-Long Fan",
  "authorsParsed": [
    [
      "Yuan",
      "Yong",
      ""
    ],
    [
      "Wang",
      "Ao-Ran",
      ""
    ],
    [
      "Li",
      "Zhuo-Tao",
      ""
    ],
    [
      "Yu",
      "Gang",
      ""
    ],
    [
      "Lü",
      "Hou-Jun",
      ""
    ],
    [
      "Xu",
      "Peng",
      ""
    ],
    [
      "Fan",
      "Xi-Long",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 8 Dec 2024 14:48:25 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733669305000,
  "abstract": "  Gravitational waves (GWs) from core-collapse supernovae (CCSNe) have been\nproposed as a means to probe the internal physical properties of supernovae.\nHowever, due to their complex time-frequency structure, effectively searching\nfor and extracting GW signals from CCSNe remains an unsolved challenge. In this\npaper, we apply the improved multisynchrosqueezing transform (IMSST) method to\nreconstruct simulated GW data based on the advanced LIGO (aLIGO) and Einstein\nTelescope (ET) detectors. These data are generated by the magnetorotational and\nneutrino-driven mechanisms, and we use the match score as the criterion for\nevaluating the quality of the reconstruction. To assess whether the\nreconstructed waveforms correspond to true GW signals, we calculate the false\nalarm probability of reconstruction (FAPR). For GW sources located at 10 kpc\nand datasets where the waveform amplitudes are normalized to $5 \\times\n10^{-21}$ observed by aLIGO, FAPR are $2.1 \\times 10^{-2}$ and $6.2 \\times\n10^{-3}$, respectively. For GW sources at 100 kpc and with waveform amplitudes\nnormalized to $5 \\times 10^{-21}$ observed by ET, FAPR are $1.3 \\times 10^{-1}$\nand $1.5 \\times 10^{-2}$, respectively. When the gravitational wave strain\nreaches $7 \\times 10^{-21}$ and the match score threshold is set to 0.75, the\nIMSST method achieves maximum reconstruction distances of approximately 37 kpc\nand 317 kpc for aLIGO and ET, respectively. Finally, we compared the\nperformance of IMSST and STFT in waveform reconstruction based on the ET. The\nresults show that the maximum reconstructable distance using STFT is 186 kpc.\n",
  "subjects": [
    "Astrophysics/High Energy Astrophysical Phenomena"
  ],
  "license": "http://creativecommons.org/publicdomain/zero/1.0/",
  "blobId": "M-Zqey29KsncYsljVpJT47kxr8n6N4q53AuhmGCkrJc",
  "pdfSize": "897582"
}