{"id":"2412.01289","title":"Enhancing Perception Capabilities of Multimodal LLMs with Training-Free\n  Fusion","authors":"Zhuokun Chen, Jinwu Hu, Zeshuai Deng, Yufeng Wang, Bohan Zhuang,\n  Mingkui Tan","authorsParsed":[["Chen","Zhuokun",""],["Hu","Jinwu",""],["Deng","Zeshuai",""],["Wang","Yufeng",""],["Zhuang","Bohan",""],["Tan","Mingkui",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 09:02:28 GMT"},{"version":"v2","created":"Wed, 4 Dec 2024 09:51:16 GMT"}],"updateDate":"2024-12-05","timestamp":1733130148000,"abstract":"  Multimodal LLMs (MLLMs) equip language models with visual capabilities by\naligning vision encoders with language models. Existing methods to enhance the\nvisual perception of MLLMs often involve designing more powerful vision\nencoders, which requires exploring a vast design space and re-aligning each\npotential encoder with the language model, resulting in prohibitively high\ntraining costs. In this paper, we introduce VisionFuse, a novel integration\nframework that efficiently utilizes multiple vision encoders from off-the-shelf\nMLLMs to enhance visual perception without requiring additional training. Our\napproach is motivated by the observation that different MLLMs tend to focus on\ndistinct regions given the same query and image. Moreover, we find that the\nfeature distributions of vision encoders within an MLLM family, a group of\nMLLMs sharing the same pretrained LLM, are highly aligned. Building on these\ninsights, VisionFuse enriches the visual context by concatenating the tokens\ngenerated by the vision encoders of selected MLLMs within a family. By merging\nthe parameters of language models from these MLLMs, VisionFuse allows a single\nlanguage model to align with various vision encoders, significantly reducing\ndeployment overhead. We conduct comprehensive evaluations across multiple\nmultimodal benchmarks using various MLLM combinations, demonstrating\nsubstantial improvements in multimodal tasks. Notably, when integrating\nMiniGemini-8B and SLIME-8B, VisionFuse achieves an average performance increase\nof over 4%.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"93fhvC5GN3lc5J2gabup2Z3JFvTacQRIiC8J46mrvxI","pdfSize":"3256913"}