{
  "id": "2412.09248",
  "title": "A Systematic Review of Knowledge Tracing and Large Language Models in\n  Education: Opportunities, Issues, and Future Research",
  "authors": "Yongwan Cho, Rabia Emhamed AlMamlook, Tasnim Gharaibeh",
  "authorsParsed": [
    [
      "Cho",
      "Yongwan",
      ""
    ],
    [
      "AlMamlook",
      "Rabia Emhamed",
      ""
    ],
    [
      "Gharaibeh",
      "Tasnim",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 13:00:50 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1734008450000,
  "abstract": "  Knowledge Tracing (KT) is a research field that aims to estimate a student's\nknowledge state through learning interactions-a crucial component of\nIntelligent Tutoring Systems (ITSs). Despite significant advancements, no\ncurrent KT models excel in both predictive accuracy and interpretability.\nMeanwhile, Large Language Models (LLMs), pre-trained on vast natural language\ndatasets, have emerged as powerful tools with immense potential in various\neducational applications. This systematic review explores the intersections,\nopportunities, and challenges of combining KT models and LLMs in educational\ncontexts. The review first investigates LLM applications in education,\nincluding their adaptability to domain-specific content and ability to support\npersonalized learning. It then examines the development and current state of KT\nmodels, from traditional to advanced approaches, aiming to uncover potential\nchallenges that LLMs could mitigate. The core of this review focuses on\nintegrating LLMs with KT, exploring three primary functions: addressing general\nconcerns in KT fields, overcoming specific KT model limitations, and performing\nas KT models themselves. Our findings reveal that LLMs can be customized for\nspecific educational tasks through tailor-making techniques such as in-context\nlearning and agent-based approaches, effectively managing complex and\nunbalanced educational data. These models can enhance existing KT models'\nperformance and solve cold-start problems by generating relevant features from\nquestion data. However, both current models depend heavily on structured,\nlimited datasets, missing opportunities to use diverse educational data that\ncould offer deeper insights into individual learners and support various\neducational settings.\n",
  "subjects": [
    "Computer Science/Computers and Society"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "vPqEyPCcvi91Ab_bXEaBEB-IJugrInWWlocvqbSb6QM",
  "pdfSize": "405273"
}