{
  "id": "2412.16667",
  "title": "The Good, the Bad, and the (Un)Usable: A Rapid Literature Review on\n  Privacy as Code",
  "authors": "Nicol\\'as E. D\\'iaz Ferreyra, Sirine Khelifi, Nalin Arachchilage and\n  Riccardo Scandariato",
  "authorsParsed": [
    [
      "Ferreyra",
      "Nicolás E. Díaz",
      ""
    ],
    [
      "Khelifi",
      "Sirine",
      ""
    ],
    [
      "Arachchilage",
      "Nalin",
      ""
    ],
    [
      "Scandariato",
      "Riccardo",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 21 Dec 2024 15:30:17 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734795017000,
  "abstract": "  Privacy and security are central to the design of information systems endowed\nwith sound data protection and cyber resilience capabilities. Still, developers\noften struggle to incorporate these properties into software projects as they\neither lack proper cybersecurity training or do not consider them a priority.\nPrior work has tried to support privacy and security engineering activities\nthrough threat modeling methods for scrutinizing flaws in system architectures.\nMoreover, several techniques for the automatic identification of\nvulnerabilities and the generation of secure code implementations have also\nbeen proposed in the current literature. Conversely, such as-code approaches\nseem under-investigated in the privacy domain, with little work elaborating on\n(i) the automatic detection of privacy properties in source code or (ii) the\ngeneration of privacy-friendly code. In this work, we seek to characterize the\ncurrent research landscape of Privacy as Code (PaC) methods and tools by\nconducting a rapid literature review. Our results suggest that PaC research is\nin its infancy, especially regarding the performance evaluation and usability\nassessment of the existing approaches. Based on these findings, we outline and\ndiscuss prospective research directions concerning empirical studies with\nsoftware practitioners, the curation of benchmark datasets, and the role of\ngenerative AI technologies.\n",
  "subjects": [
    "Computer Science/Software Engineering",
    "Computer Science/Computers and Society",
    "Computer Science/Human-Computer Interaction"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "a4tC-uOuryNvWotgXRIPFq6uQjkimUGoWkqGUyTFwsE",
  "pdfSize": "378898"
}