{
  "id": "2412.11061",
  "title": "Classification Drives Geographic Bias in Street Scene Segmentation",
  "authors": "Rahul Nair, Gabriel Tseng, Esther Rolf, Bhanu Tokas, Hannah Kerner",
  "authorsParsed": [
    [
      "Nair",
      "Rahul",
      ""
    ],
    [
      "Tseng",
      "Gabriel",
      ""
    ],
    [
      "Rolf",
      "Esther",
      ""
    ],
    [
      "Tokas",
      "Bhanu",
      ""
    ],
    [
      "Kerner",
      "Hannah",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 15 Dec 2024 05:33:10 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734240790000,
  "abstract": "  Previous studies showed that image datasets lacking geographic diversity can\nlead to biased performance in models trained on them. While earlier work\nstudied general-purpose image datasets (e.g., ImageNet) and simple tasks like\nimage recognition, we investigated geo-biases in real-world driving datasets on\na more complex task: instance segmentation. We examined if instance\nsegmentation models trained on European driving scenes (Eurocentric models) are\ngeo-biased. Consistent with previous work, we found that Eurocentric models\nwere geo-biased. Interestingly, we found that geo-biases came from\nclassification errors rather than localization errors, with classification\nerrors alone contributing 10-90% of the geo-biases in segmentation and 19-88%\nof the geo-biases in detection. This showed that while classification is\ngeo-biased, localization (including detection and segmentation) is\ngeographically robust. Our findings show that in region-specific models (e.g.,\nEurocentric models), geo-biases from classification errors can be significantly\nmitigated by using coarser classes (e.g., grouping car, bus, and truck as\n4-wheeler).\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Computers and Society",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Bfj1APZvmPTky11sY811_BctIh2SFna43joeh0UaZUM",
  "pdfSize": "57234193"
}