{
  "id": "2412.07782",
  "title": "Trustworthy artificial intelligence in the energy sector: Landscape\n  analysis and evaluation framework",
  "authors": "Sotiris Pelekis, Evangelos Karakolis, George Lampropoulos, Spiros\n  Mouzakitis, Ourania Markaki, Christos Ntanos, Dimitris Askounis",
  "authorsParsed": [
    [
      "Pelekis",
      "Sotiris",
      ""
    ],
    [
      "Karakolis",
      "Evangelos",
      ""
    ],
    [
      "Lampropoulos",
      "George",
      ""
    ],
    [
      "Mouzakitis",
      "Spiros",
      ""
    ],
    [
      "Markaki",
      "Ourania",
      ""
    ],
    [
      "Ntanos",
      "Christos",
      ""
    ],
    [
      "Askounis",
      "Dimitris",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 25 Nov 2024 11:39:55 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1732534795000,
  "abstract": "  The present study aims to evaluate the current fuzzy landscape of Trustworthy\nAI (TAI) within the European Union (EU), with a specific focus on the energy\nsector. The analysis encompasses legal frameworks, directives, initiatives, and\nstandards like the AI Ethics Guidelines for Trustworthy AI (EGTAI), the\nAssessment List for Trustworthy AI (ALTAI), the AI act, and relevant\nCEN-CENELEC standardization efforts, as well as EU-funded projects such as\nAI4EU and SHERPA. Subsequently, we introduce a new TAI application framework,\ncalled E-TAI, tailored for energy applications, including smart grid and smart\nbuilding systems. This framework draws inspiration from EGTAI but is customized\nfor AI systems in the energy domain. It is designed for stakeholders in\nelectrical power and energy systems (EPES), including researchers, developers,\nand energy experts linked to transmission system operators, distribution system\noperators, utilities, and aggregators. These stakeholders can utilize E-TAI to\ndevelop and evaluate AI services for the energy sector with a focus on ensuring\ntrustworthiness throughout their development and iterative assessment\nprocesses.\n",
  "subjects": [
    "Computer Science/Computers and Society",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "SG_pjcNJSzK8K0e81aZsYuLoSKZbcAWpuMAq4kd_e9Q",
  "pdfSize": "657696"
}