{
  "id": "2412.04520",
  "title": "Cooling of Neutron Stars through Emission of Neutrinos and Photons:\n  Effects of Modified Gravity and Magnetic Field using TOV Equations",
  "authors": "Charul Rathod, M. Mishra and Prasanta Kumar Das",
  "authorsParsed": [
    [
      "Rathod",
      "Charul",
      ""
    ],
    [
      "Mishra",
      "M.",
      ""
    ],
    [
      "Das",
      "Prasanta Kumar",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 10:21:07 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733394067000,
  "abstract": "  The existence of dark matter has long been extensively studied in the past\nfew decades. In this study, we investigate the emission of neutrinos and\nphotons from neutron stars (NSs) by employing the modified theory of gravity\nand the corresponding Tolman-Oppenheimer-Volkoff (TOV) system of equations. The\nextreme matter density and magnetic field inside the NSs provide a unique\nlaboratory for studying fundamental physics, including the interplay between\ngravity and quantum field effects. The impact of a strong magnetic field has\nalso been incorporated into the corresponding TOV equations. We here attempt to\nsee how neutrinos and photons emissions from these compact objects are impacted\nby the modified TOV equations due to modified theory of gravity; f(R,T) gravity\nor scalar-tensor theory and strong magnetic fields. Our analysis focuses on how\nthese modifications influence the structure, cooling, and photon/neutrino\nluminosities of NS. We computed the surface temperature of NSs for normal\nEinstein gravity and modified gravity theories with and without magnetic field\nfor three EoSs; namely APR, FPS and SLY. On comparison of our predicted values\nof surface temperature with the observed surface temperature for three NSs, we\nfind that modified gravity along with inside magnetic field-based predictions\nshows reasonable agreement with the corresponding observed values.\n",
  "subjects": [
    "Physics/General Relativity and Quantum Cosmology",
    "Astrophysics/High Energy Astrophysical Phenomena"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "ty8hCxwt1nP8P3d5ARRVTqs9mIHmdPHDWEK6UHPukH4",
  "pdfSize": "777836"
}