{"id":"2412.05688","title":"Flow-based Detection of Botnets through Bio-inspired Optimisation of\n  Machine Learning","authors":"Biju Issac, Kyle Fryer and Seibu Mary Jacob","authorsParsed":[["Issac","Biju",""],["Fryer","Kyle",""],["Jacob","Seibu Mary",""]],"versions":[{"version":"v1","created":"Sat, 7 Dec 2024 15:55:49 GMT"},{"version":"v2","created":"Thu, 12 Dec 2024 14:49:49 GMT"},{"version":"v3","created":"Sun, 15 Dec 2024 13:58:10 GMT"}],"updateDate":"2024-12-17","timestamp":1733586949000,"abstract":"  Botnets could autonomously infect, propagate, communicate and coordinate with\nother members in the botnet, enabling cybercriminals to exploit the cumulative\ncomputing and bandwidth of its bots to facilitate cybercrime. Traditional\ndetection methods are becoming increasingly unsuitable against various\nnetwork-based detection evasion methods. These techniques ultimately render\nsignature-based fingerprinting detection infeasible and thus this research\nexplores the application of network flow-based behavioural modelling to\nfacilitate the binary classification of bot network activity, whereby the\ndetection is independent of underlying communications architectures, ports,\nprotocols and payload-based detection evasion mechanisms. A comparative\nevaluation of various machine learning classification methods is conducted, to\nprecisely determine the average accuracy of each classifier on bot datasets\nlike CTU-13, ISOT 2010 and ISCX 2014. Additionally, hyperparameter tuning using\nGenetic Algorithm (GA), aiming to efficiently converge to the fittest\nhyperparameter set for each dataset was done. The bioinspired optimisation of\nRandom Forest (RF) with GA achieved an average accuracy of 99.85% when it was\ntested against the three datasets. The model was then developed into a software\nproduct. The YouTube link of the project and demo of the software developed:\nhttps://youtu.be/gNQjC91VtOI\n","subjects":["Computer Science/Cryptography and Security","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"VyvNb4Eujkq5EhmsIgdS78X5EGWx2bBeptM1AnMlFfM","pdfSize":"1604385"}