{
  "id": "2412.03481",
  "title": "Universal Constants and Energy Integral in Self-Organized Criticality\n  Systems",
  "authors": "Markus Aschwanden",
  "authorsParsed": [
    [
      "Aschwanden",
      "Markus",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 17:17:17 GMT"
    },
    {
      "version": "v2",
      "created": "Wed, 22 Jan 2025 19:49:53 GMT"
    }
  ],
  "updateDate": "2025-01-24",
  "timestamp": 1733332637000,
  "abstract": "  The occurrence frequency distributions of fluxes (F) and fluences or energies\n(E) observed in astrophysical observations are found to be consistent with the\npredictions of the fractal-diffusive self-organized criticality (FD-SOC) model,\nwhich predicts power law slopes with universal constants of\n$\\alpha_F=(9/5)=1.80$ for the flux and $\\alpha_E=(5/3)\\approx 1.67$ for the\nfluence. The energy integrated over the power law-like (size distribution)\nenergy range is found to be finite for these power law slopes with $\\alpha_E <\n2$, which refutes earlier claims of a divergent energy integral that has been\npostulated in the energy budget of solar and stellar nanoflare scenarios. The\ntheoretial FD-SOC model approximates the microscopic cellular automaton models\nsatisfactorily with the macroscopic scaling law of classical diffusion. The\nuniversal scaling laws predict the size distributions of numerous astrophysical\nphenomena, such as solar flares, stellar flares, coronal mass ejections (CME),\nauroras, blazars, galactic fast radio bursts (FRB), active galactic nuclei\n(AGN), gamma-ray bursts (GRB), soft gamma-ray repeaters (SGB), and black-hole\nsystems (BH), while coherent solar radio bursts, random radio bursts, solar\nenergetic partices (SEP), cosmic rays, and pulsar glitches require non-standard\nSOC models.\n",
  "subjects": [
    "Astrophysics/High Energy Astrophysical Phenomena"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "aqkY4Kr1jm629pNzxuOYwvAyuvmcxerfdJEuPKCxdUw",
  "pdfSize": "455616"
}