{
  "id": "2412.19517",
  "title": "Estimation of System Parameters Including Repeated Cross-Sectional Data\n  through Emulator-Informed Deep Generative Model",
  "authors": "Hyunwoo Cho, Sung Woong Cho, Hyeontae Jo, Hyung Ju Hwang",
  "authorsParsed": [
    [
      "Cho",
      "Hyunwoo",
      ""
    ],
    [
      "Cho",
      "Sung Woong",
      ""
    ],
    [
      "Jo",
      "Hyeontae",
      ""
    ],
    [
      "Hwang",
      "Hyung Ju",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 27 Dec 2024 08:19:23 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735287563000,
  "abstract": "  Differential equations (DEs) are crucial for modeling the evolution of\nnatural or engineered systems. Traditionally, the parameters in DEs are\nadjusted to fit data from system observations. However, in fields such as\npolitics, economics, and biology, available data are often independently\ncollected at distinct time points from different subjects (i.e., repeated\ncross-sectional (RCS) data). Conventional optimization techniques struggle to\naccurately estimate DE parameters when RCS data exhibit various\nheterogeneities, leading to a significant loss of information. To address this\nissue, we propose a new estimation method called the emulator-informed\ndeep-generative model (EIDGM), designed to handle RCS data. Specifically, EIDGM\nintegrates a physics-informed neural network-based emulator that immediately\ngenerates DE solutions and a Wasserstein generative adversarial network-based\nparameter generator that can effectively mimic the RCS data. We evaluated EIDGM\non exponential growth, logistic population models, and the Lorenz system,\ndemonstrating its superior ability to accurately capture parameter\ndistributions. Additionally, we applied EIDGM to an experimental dataset of\nAmyloid beta 40 and beta 42, successfully capturing diverse parameter\ndistribution shapes. This shows that EIDGM can be applied to model a wide range\nof systems and extended to uncover the operating principles of systems based on\nlimited data.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Numerical Analysis",
    "Mathematics/Numerical Analysis",
    "Quantitative Biology/Populations and Evolution",
    "Statistics/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "EUpkr7237hDA7x9ygeRodJpipJiGFCK5a9REazakqOI",
  "pdfSize": "2213845"
}