{
  "id": "2412.03446",
  "title": "From Words to Workflows: Automating Business Processes",
  "authors": "Laura Minkova and Jessica L\\'opez Espejel and Taki Eddine Toufik\n  Djaidja and Walid Dahhane and El Hassane Ettifouri",
  "authorsParsed": [
    [
      "Minkova",
      "Laura",
      ""
    ],
    [
      "Espejel",
      "Jessica López",
      ""
    ],
    [
      "Djaidja",
      "Taki Eddine Toufik",
      ""
    ],
    [
      "Dahhane",
      "Walid",
      ""
    ],
    [
      "Ettifouri",
      "El Hassane",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 16:34:35 GMT"
    }
  ],
  "updateDate": "2024-12-05",
  "timestamp": 1733330075000,
  "abstract": "  As businesses increasingly rely on automation to streamline operations, the\nlimitations of Robotic Process Automation (RPA) have become apparent,\nparticularly its dependence on expert knowledge and inability to handle complex\ndecision-making tasks. Recent advancements in Artificial Intelligence (AI),\nparticularly Generative AI (GenAI) and Large Language Models (LLMs), have paved\nthe way for Intelligent Automation (IA), which integrates cognitive\ncapabilities to overcome the shortcomings of RPA. This paper introduces\nText2Workflow, a novel method that automatically generates workflows from\nnatural language user requests. Unlike traditional automation approaches,\nText2Workflow offers a generalized solution for automating any business\nprocess, translating user inputs into a sequence of executable steps\nrepresented in JavaScript Object Notation (JSON) format. Leveraging the\ndecision-making and instruction-following capabilities of LLMs, this method\nprovides a scalable, adaptable framework that enables users to visualize and\nexecute workflows with minimal manual intervention. This research outlines the\nText2Workflow methodology and its broader implications for automating complex\nbusiness processes.\n",
  "subjects": [
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "XLxxqTZh5y4brUwEz1whc3FOozX5A3Fs8mAoYMKAOt8",
  "pdfSize": "9403826"
}