{
  "id": "2412.12224",
  "title": "Application of machine learning in grain-related clustering of Laue\n  spots in a polycrystalline energy dispersive Laue pattern",
  "authors": "Amir Tosson, Mohammad Shokr, Mahmoud Al Humaidi, Eduard Mikayelyan,\n  Christian Gutt and Ulrich Pietsch",
  "authorsParsed": [
    [
      "Tosson",
      "Amir",
      ""
    ],
    [
      "Shokr",
      "Mohammad",
      ""
    ],
    [
      "Humaidi",
      "Mahmoud Al",
      ""
    ],
    [
      "Mikayelyan",
      "Eduard",
      ""
    ],
    [
      "Gutt",
      "Christian",
      ""
    ],
    [
      "Pietsch",
      "Ulrich",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 09:28:17 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734341297000,
  "abstract": "  We address the identification of grain-corresponding Laue reflections in\nenergy dispersive Laue diffraction (EDLD) experiments by formulating it as a\nclustering problem solvable through unsupervised machine learning (ML). To\nachieve reliable and efficient identification of grains in a Laue pattern, we\nemploy a combination of clustering algorithms, namely hierarchical clustering\n(HC) and K-means. These algorithms allow us to group together similar Laue\nreflections, revealing the underlying grain structure in the diffraction\npattern. Additionally, we utilise the elbow method to determine the optimal\nnumber of clusters, ensuring accurate results. To evaluate the performance of\nour proposed method, we conducted experiments using both simulated and\nexperimental datasets obtained from nickel wires. The simulated datasets were\ngenerated to mimic the characteristics of real-world EDLD experiments, while\nthe experimental datasets were obtained from actual measurements.\n",
  "subjects": [
    "Condensed Matter/Materials Science",
    "Computer Science/Machine Learning",
    "Physics/Applied Physics",
    "Physics/Data Analysis, Statistics and Probability"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "6driRH26900nuUTiv3vXlZlh6dOF57GjLadWIGHgwqw",
  "pdfSize": "1746036"
}