{"id":"2412.00892","title":"Non-Perturbative Contributions to Low Transverse Momentum Drell-Yan Pair\n  Production Using the Parton Branching Method","authors":"Nata\\v{s}a Rai\\v{c}evi\\'c","authorsParsed":[["Raičević","Nataša",""]],"versions":[{"version":"v1","created":"Sun, 1 Dec 2024 17:05:03 GMT"}],"updateDate":"2024-12-03","timestamp":1733072703000,"abstract":"  The non-perturbative processes - the internal transverse motion of partons\ninside hadrons, which gives rise to their intrinsic transverse momentum\n(intrinsic-kT) - and multiple soft gluon emissions that need to be resummed,\nare dominant contributions to the low transverse momentum of the Drell-Yan (DY)\npair cross section. Therefore, this part of the DY spectra serves as a powerful\ntool for a better understanding of such processes, which is the focus of the\nstudy presented here. The study is conducted using the Parton Branching Method,\nwhich describes Transverse Momentum Dependent (TMD) Parton Densitity Functions\n(PDF) and provides a very precise description of DY pair transverse momentum\ndistributions across a wide range of collision energies and pair invariant\nmasses. In contrast to the energy dependence of intrinsic kT observed in\nshower-based Monte Carlo event generators, the CASCADE3 event generator - based\non the Parton Branching Method - has provided an intrinsic-kT distribution that\nis independent of the center of mass energy. Further studies conducted within\nthe Parton Branching Method have sought to understand the origin of this energy\ndependence, indicating that the dependence is mainly a consequence of the\ninterplay between two main processes: internal transverse motion and soft gluon\nemission. The latter has been reduced in shower-based event generators,\nprimarily due to the non-perturbative Sudakov form factor, which is often\nneglected. Since the Sudakov form factor depends on the evolution scale, this\npaper explores this dependence through the interplay of the two processes and\nattempts to explain it. Additionally, since QED final state radiation affects\nthe profile of the DY pair transverse momentum distribution, we investigate its\nimpact in both the high and low DY pair invariant mass regions.\n","subjects":["Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"pr1sBP01w4bKNstl_nuR16IIZH2bzeGsOWXIFVbit-s","pdfSize":"833959"}