{
  "id": "2412.10129",
  "title": "TIGRE v3: Efficient and easy to use iterative computed tomographic\n  reconstruction toolbox for real datasets",
  "authors": "Ander Biguri, Tomoyuki Sadakane, Reuben Lindroos, Yi Liu, Malena\n  Sabat\\'e Landman, Yi Du, Manasavee Lohvithee, Stefanie Kaser, Sepideh\n  Hatamikia, Robert Bryll, Emilien Valat, Sarinrat Wonglee, Thomas Blumensath,\n  Carola-Bibiane Sch\\\"onlieb",
  "authorsParsed": [
    [
      "Biguri",
      "Ander",
      ""
    ],
    [
      "Sadakane",
      "Tomoyuki",
      ""
    ],
    [
      "Lindroos",
      "Reuben",
      ""
    ],
    [
      "Liu",
      "Yi",
      ""
    ],
    [
      "Landman",
      "Malena Sabaté",
      ""
    ],
    [
      "Du",
      "Yi",
      ""
    ],
    [
      "Lohvithee",
      "Manasavee",
      ""
    ],
    [
      "Kaser",
      "Stefanie",
      ""
    ],
    [
      "Hatamikia",
      "Sepideh",
      ""
    ],
    [
      "Bryll",
      "Robert",
      ""
    ],
    [
      "Valat",
      "Emilien",
      ""
    ],
    [
      "Wonglee",
      "Sarinrat",
      ""
    ],
    [
      "Blumensath",
      "Thomas",
      ""
    ],
    [
      "Schönlieb",
      "Carola-Bibiane",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 13:21:47 GMT"
    }
  ],
  "updateDate": "2024-12-16",
  "timestamp": 1734096107000,
  "abstract": "  Computed Tomography (CT) has been widely adopted in medicine and it is\nincreasingly being used in scientific and industrial applications. Parallelly,\nresearch in different mathematical areas concerning discrete inverse problems\nhas led to the development of new sophisticated numerical solvers that can be\napplied in the context of CT. The Tomographic Iterative GPU-based\nReconstruction (TIGRE) toolbox was born almost a decade ago precisely in the\ngap between mathematics and high performance computing for real CT data,\nproviding user-friendly open-source software tools for image reconstruction.\nHowever, since its inception, the tools' features and codebase have had over a\ntwenty-fold increase, and are now including greater geometric flexibility, a\nvariety of modern algorithms for image reconstruction, high-performance\ncomputing features and support for other CT modalities, like proton CT. The\npurpose of this work is two-fold: first, it provides a structured overview of\nthe current version of the TIGRE toolbox, providing appropriate descriptions\nand references, and serving as a comprehensive and peer-reviewed guide for the\nuser; second, it is an opportunity to illustrate the performance of several of\nthe available solvers showcasing real CT acquisitions, which are typically not\nbe openly available to algorithm developers.\n",
  "subjects": [
    "Physics/Medical Physics",
    "Computer Science/Mathematical Software",
    "Mathematics/Optimization and Control"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "cIQaI0XgdrtUnrtDATcCj_apyALjsmJhNN2CgbT4l2E",
  "pdfSize": "4866795"
}