{"id":"2412.09772","title":"Acquisition of Spatially-Varying Reflectance and Surface Normals via\n  Polarized Reflectance Fields","authors":"Jing Yang, Pratusha Bhuvana Prasad, Qing Zhang, Yajie Zhao","authorsParsed":[["Yang","Jing",""],["Prasad","Pratusha Bhuvana",""],["Zhang","Qing",""],["Zhao","Yajie",""]],"versions":[{"version":"v1","created":"Fri, 13 Dec 2024 00:39:55 GMT"}],"updateDate":"2024-12-16","timestamp":1734050395000,"abstract":"  Accurately measuring the geometry and spatially-varying reflectance of\nreal-world objects is a complex task due to their intricate shapes formed by\nconcave features, hollow engravings and diverse surfaces, resulting in\ninter-reflection and occlusion when photographed. Moreover, issues like lens\nflare and overexposure can arise from interference from secondary reflections\nand limitations of hardware even in professional studios. In this paper, we\npropose a novel approach using polarized reflectance field capture and a\ncomprehensive statistical analysis algorithm to obtain highly accurate surface\nnormals (within 0.1mm/px) and spatially-varying reflectance data, including\nalbedo, specular separation, roughness, and anisotropy parameters for realistic\nrendering and analysis. Our algorithm removes image artifacts via analytical\nmodeling and further employs both an initial step and an optimization step\ncomputed on the whole image collection to further enhance the precision of\nper-pixel surface reflectance and normal measurement. We showcase the captured\nshapes and reflectance of diverse objects with a wide material range, spanning\nfrom highly diffuse to highly glossy - a challenge unaddressed by prior\ntechniques. Our approach enhances downstream applications by offering precise\nmeasurements for realistic rendering and provides a valuable training dataset\nfor emerging research in inverse rendering. We will release the polarized\nreflectance fields of several captured objects with this work.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Graphics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"JzzdJ1mG5VN2eCT_UMOEZVxzOu8d12vDNbGA_UfZDrk","pdfSize":"11772342"}