{
  "id": "2412.12216",
  "title": "SitPose: Real-Time Detection of Sitting Posture and Sedentary Behavior\n  Using Ensemble Learning With Depth Sensor",
  "authors": "Hang Jin, Xin He, Lingyun Wang, Yujun Zhu, Weiwei Jiang, Xiaobo Zhou",
  "authorsParsed": [
    [
      "Jin",
      "Hang",
      ""
    ],
    [
      "He",
      "Xin",
      ""
    ],
    [
      "Wang",
      "Lingyun",
      ""
    ],
    [
      "Zhu",
      "Yujun",
      ""
    ],
    [
      "Jiang",
      "Weiwei",
      ""
    ],
    [
      "Zhou",
      "Xiaobo",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 00:40:49 GMT"
    }
  ],
  "updateDate": "2025-02-13",
  "timestamp": 1734309649000,
  "abstract": "  Poor sitting posture can lead to various work-related musculoskeletal\ndisorders (WMSDs). Office employees spend approximately 81.8% of their working\ntime seated, and sedentary behavior can result in chronic diseases such as\ncervical spondylosis and cardiovascular diseases. To address these health\nconcerns, we present SitPose, a sitting posture and sedentary detection system\nutilizing the latest Kinect depth camera. The system tracks 3D coordinates of\nbone joint points in real-time and calculates the angle values of related\njoints. We established a dataset containing six different sitting postures and\none standing posture, totaling 33,409 data points, by recruiting 36\nparticipants. We applied several state-of-the-art machine learning algorithms\nto the dataset and compared their performance in recognizing the sitting poses.\nOur results show that the ensemble learning model based on the soft voting\nmechanism achieves the highest F1 score of 98.1%. Finally, we deployed the\nSitPose system based on this ensemble model to encourage better sitting posture\nand to reduce sedentary habits.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Ug9L4clXxA3dY96b1FnVUItypuKbt4BKteRY2pHOcN4",
  "pdfSize": "2866469"
}