{
  "id": "2412.08405",
  "title": "On-demand Quick Metasurface Design with Neighborhood Attention\n  Transformer",
  "authors": "Zhi Sun, Tianyue Li, Shiqi Kuang, Xue Yun, Minru He, Boyan Fu, Yunlai\n  Fu, Tianyu Zhao, Shaowei Wang, Yansheng Liang, Shuming Wang, Ming Lei",
  "authorsParsed": [
    [
      "Sun",
      "Zhi",
      ""
    ],
    [
      "Li",
      "Tianyue",
      ""
    ],
    [
      "Kuang",
      "Shiqi",
      ""
    ],
    [
      "Yun",
      "Xue",
      ""
    ],
    [
      "He",
      "Minru",
      ""
    ],
    [
      "Fu",
      "Boyan",
      ""
    ],
    [
      "Fu",
      "Yunlai",
      ""
    ],
    [
      "Zhao",
      "Tianyu",
      ""
    ],
    [
      "Wang",
      "Shaowei",
      ""
    ],
    [
      "Liang",
      "Yansheng",
      ""
    ],
    [
      "Wang",
      "Shuming",
      ""
    ],
    [
      "Lei",
      "Ming",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 14:26:49 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733927209000,
  "abstract": "  Metasurfaces are reshaping traditional optical paradigms and are increasingly\nrequired in complex applications that demand substantial computational\nresources to numerically solve Maxwell's equations-particularly for large-scale\nsystems, inhomogeneous media, and densely packed metadevices. Conventional\nforward design using electromagnetic solvers is based on specific\napproximations, which may not effectively address complex problems. In\ncontrast, existing inverse design methods are a stepwise process that is often\ntime-consuming and involves repetitive computations. Here, we present an\ninverse design approach utilizing a surrogate Neighborhood Attention\nTransformer, MetaE-former, to predict the performance of metasurfaces with\nultrafast speed and high accuracy. This method achieves global solutions for\nhundreds of nanostructures simultaneously, providing up to a 250,000-fold\nspeedup compared with solving for individual meta-atoms based on the FDTD\nmethod. As examples, we demonstrate a binarized high-numerical-aperture (about\n1.31) metalens and several optimized structured-light meta-generators. Our\nmethod significantly improves the beam shaping adaptability with metasurfaces\nand paves the way for fast designing of large-scale metadevices for shaping\nextreme light fields with high accuracy.\n",
  "subjects": [
    "Physics/Optics",
    "Physics/Classical Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "JqpEgrT18t6dGWnm1PDylNL03WXNe7jvWeJnoeZb--I",
  "pdfSize": "1424991"
}