{"id":"2412.17242","title":"On the Generalization and Adaptation Ability of Machine-Generated Text\n  Detectors in Academic Writing","authors":"Yule Liu, Zhiyuan Zhong, Yifan Liao, Zhen Sun, Jingyi Zheng, Jiaheng\n  Wei, Qingyuan Gong, Fenghua Tong, Yang Chen, Yang Zhang, Xinlei He","authorsParsed":[["Liu","Yule",""],["Zhong","Zhiyuan",""],["Liao","Yifan",""],["Sun","Zhen",""],["Zheng","Jingyi",""],["Wei","Jiaheng",""],["Gong","Qingyuan",""],["Tong","Fenghua",""],["Chen","Yang",""],["Zhang","Yang",""],["He","Xinlei",""]],"versions":[{"version":"v1","created":"Mon, 23 Dec 2024 03:30:34 GMT"},{"version":"v2","created":"Wed, 26 Feb 2025 08:13:52 GMT"}],"updateDate":"2025-02-27","timestamp":1734924634000,"abstract":"  The rising popularity of large language models (LLMs) has raised concerns\nabout machine-generated text (MGT), particularly in academic settings, where\nissues like plagiarism and misinformation are prevalent. As a result,\ndeveloping a highly generalizable and adaptable MGT detection system has become\nan urgent priority. Given that LLMs are most commonly misused in academic\nwriting, this work investigates the generalization and adaptation capabilities\nof MGT detectors in three key aspects specific to academic writing: First, we\nconstruct MGT-Acedemic, a large-scale dataset comprising over 336M tokens and\n749K samples. MGT-Acedemic focuses on academic writing, featuring human-written\ntexts (HWTs) and MGTs across STEM, Humanities, and Social Sciences, paired with\nan extensible code framework for efficient benchmarking. Second, we benchmark\nthe performance of various detectors for binary classification and attribution\ntasks in both in-domain and cross-domain settings. This benchmark reveals the\noften-overlooked challenges of attribution tasks. Third, we introduce a novel\nattribution task where models have to adapt to new classes over time without\n(or with very limited) access to prior training data in both few-shot and\nmany-shot scenarios. We implement eight different adapting techniques to\nimprove the performance and highlight the inherent complexity of the task. Our\nfindings provide insights into the generalization and adaptation ability of MGT\ndetectors across diverse scenarios and lay the foundation for building robust,\nadaptive detection systems. The code framework is available at\nhttps://github.com/Y-L-LIU/MGTBench-2.0.\n","subjects":["Computer Science/Artificial Intelligence","Computer Science/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"LT6_e_Y80jrELpOOMlvdet55bhB6myC9t4rKwd3Kres","pdfSize":"6238504"}