{"id":"2412.01275","title":"PASTA-4-PHT: A Pipeline for Automated Security and Technical Audits for\n  the Personal Health Train","authors":"Sascha Welten, Karl Kindermann, Ahmet Polat, Martin G\\\"orz, Maximilian\n  Jugl, Laurenz Neumann, Alexander Neumann, Johannes Lohm\\\"oller, Jan\n  Pennekamp, Stefan Decker","authorsParsed":[["Welten","Sascha",""],["Kindermann","Karl",""],["Polat","Ahmet",""],["Görz","Martin",""],["Jugl","Maximilian",""],["Neumann","Laurenz",""],["Neumann","Alexander",""],["Lohmöller","Johannes",""],["Pennekamp","Jan",""],["Decker","Stefan",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 08:43:40 GMT"}],"updateDate":"2024-12-03","timestamp":1733129020000,"abstract":"  With the introduction of data protection regulations, the need for innovative\nprivacy-preserving approaches to process and analyse sensitive data has become\napparent. One approach is the Personal Health Train (PHT) that brings analysis\ncode to the data and conducts the data processing at the data premises.\nHowever, despite its demonstrated success in various studies, the execution of\nexternal code in sensitive environments, such as hospitals, introduces new\nresearch challenges because the interactions of the code with sensitive data\nare often incomprehensible and lack transparency. These interactions raise\nconcerns about potential effects on the data and increases the risk of data\nbreaches. To address this issue, this work discusses a PHT-aligned security and\naudit pipeline inspired by DevSecOps principles. The automated pipeline\nincorporates multiple phases that detect vulnerabilities. To thoroughly study\nits versatility, we evaluate this pipeline in two ways. First, we deliberately\nintroduce vulnerabilities into a PHT. Second, we apply our pipeline to five\nreal-world PHTs, which have been utilised in real-world studies, to audit them\nfor potential vulnerabilities. Our evaluation demonstrates that our designed\npipeline successfully identifies potential vulnerabilities and can be applied\nto real-world studies. In compliance with the requirements of the GDPR for data\nmanagement, documentation, and protection, our automated approach supports\nresearchers using in their data-intensive work and reduces manual overhead. It\ncan be used as a decision-making tool to assess and document potential\nvulnerabilities in code for data processing. Ultimately, our work contributes\nto an increased security and overall transparency of data processing activities\nwithin the PHT framework.\n","subjects":["Computer Science/Cryptography and Security","Computer Science/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"FRT3I8cg5_qgkVnzLPJlgshIar7jZ_glkolpB0Y7wk4","pdfSize":"2713572"}