{
  "id": "2412.09182",
  "title": "On the effectiveness of Rotation-Equivariance in U-Net: A Benchmark for\n  Image Segmentation",
  "authors": "Robin Ghyselinck, Valentin Delchevalerie, Bruno Dumas, Beno\\^it\n  Fr\\'enay",
  "authorsParsed": [
    [
      "Ghyselinck",
      "Robin",
      ""
    ],
    [
      "Delchevalerie",
      "Valentin",
      ""
    ],
    [
      "Dumas",
      "Bruno",
      ""
    ],
    [
      "Frénay",
      "Benoît",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 11:25:32 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1734002732000,
  "abstract": "  Numerous studies have recently focused on incorporating different variations\nof equivariance in Convolutional Neural Networks (CNNs). In particular,\nrotation-equivariance has gathered significant attention due to its relevance\nin many applications related to medical imaging, microscopic imaging, satellite\nimaging, industrial tasks, etc. While prior research has primarily focused on\nenhancing classification tasks with rotation equivariant CNNs, their impact on\nmore complex architectures, such as U-Net for image segmentation, remains\nscarcely explored. Indeed, previous work interested in integrating\nrotation-equivariance into U-Net architecture have focused on solving specific\napplications with a limited scope. In contrast, this paper aims to provide a\nmore exhaustive evaluation of rotation equivariant U-Net for image segmentation\nacross a broader range of tasks. We benchmark their effectiveness against\nstandard U-Net architectures, assessing improvements in terms of performance\nand sustainability (i.e., computational cost). Our evaluation focuses on\ndatasets whose orientation of objects of interest is arbitrary in the image\n(e.g., Kvasir-SEG), but also on more standard segmentation datasets (such as\nCOCO-Stuff) as to explore the wider applicability of rotation equivariance\nbeyond tasks undoubtedly concerned by rotation equivariance. The main\ncontribution of this work is to provide insights into the trade-offs and\nadvantages of integrating rotation equivariance for segmentation tasks.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "ABOwvkZsJ9iisNNCTla-_rhDMGmMlfs3oa6YV5LOVH8",
  "pdfSize": "4317154"
}