{"id":"2412.08620","title":"Revisiting light-flavor diquarks in the inverse matrix method of QCD sum\n  rules","authors":"Halil Mutuk","authorsParsed":[["Mutuk","Halil",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 18:40:32 GMT"},{"version":"v2","created":"Thu, 12 Dec 2024 17:49:58 GMT"},{"version":"v3","created":"Wed, 26 Feb 2025 20:00:06 GMT"}],"updateDate":"2025-02-28","timestamp":1733942432000,"abstract":"  This study reexamines the spectroscopic parameters of light-flavor diquarks\nwithin the framework of quantum chromodynamics sum rules (QCDSR) using the\ninverse matrix method. Conventional QCDSR analyses are based on assumptions\nsuch as quark-hadron duality and continuum models, which introduce a degree of\nsystematic uncertainty. The inverse matrix method circumvents these assumptions\nby reformulating the problem as an inverse integral equation and expanding the\nunknown spectral density using orthogonal Laguerre polynomials. This method\nallows for a direct determination of spectral densities, thereby enhancing the\nprecision of predictions regarding resonance masses and decay constants. By\nemploying this methodology with regard to light-flavor diquarks ($sq$ and\n$ud$), it is possible to extract the associated masses and decay constants. The\nresults indicate that the masses of diquarks with quantum numbers $J^P = 0^+$\nand $J^P = 0^-$ are nearly degenerate. We compare our results regarding masses\nand decay constants with those of other theoretical predictions, which could\nprove a useful complementary tool in interpretation. Our results are consistent\nwith those in the literature and can be shown as evidence for the consistency\nof the method. The results achieved in this study highlight the potential of\nthe inverse matrix method as a robust tool for exploring nonperturbative QCD\nphenomena and elucidating the internal structure of exotic hadronic systems.\n","subjects":["Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Experiment","Physics/High Energy Physics - Lattice"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Z8ix523b8m39sml31p_A-xeEZH0Xb9JjrDaSCwfKlGY","pdfSize":"565093"}