{
  "id": "2412.13312",
  "title": "Automated Phytosensing: Ozone Exposure Classification Based on Plant\n  Electrical Signals",
  "authors": "Till Aust and Eduard Buss and Felix Mohr and Heiko Hamann",
  "authorsParsed": [
    [
      "Aust",
      "Till",
      ""
    ],
    [
      "Buss",
      "Eduard",
      ""
    ],
    [
      "Mohr",
      "Felix",
      ""
    ],
    [
      "Hamann",
      "Heiko",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 20:29:00 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734467340000,
  "abstract": "  In our project WatchPlant, we propose to use a decentralized network of\nliving plants as air-quality sensors by measuring their electrophysiology to\ninfer the environmental state, also called phytosensing. We conducted in-lab\nexperiments exposing ivy (Hedera helix) plants to ozone, an important pollutant\nto monitor, and measured their electrophysiological response. However, there is\nno well established automated way of detecting ozone exposure in plants. We\npropose a generic automatic toolchain to select a high-performance subset of\nfeatures and highly accurate models for plant electrophysiology. Our approach\nderives plant- and stimulus-generic features from the electrophysiological\nsignal using the tsfresh library. Based on these features, we automatically\nselect and optimize machine learning models using AutoML. We use forward\nfeature selection to increase model performance. We show that our approach\nsuccessfully classifies plant ozone exposure with accuracies of up to 94.6% on\nunseen data. We also show that our approach can be used for other plant species\nand stimuli. Our toolchain automates the development of monitoring algorithms\nfor plants as pollutant monitors. Our results help implement significant\nadvancements for phytosensing devices contributing to the development of\ncost-effective, high-density urban air monitoring systems in the future.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Electrical Engineering and Systems Science/Signal Processing"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "BR3IETLKkk5t8WVwladXVgJ9NVFZgCtaj3Z6s-hG2gs",
  "pdfSize": "2119675"
}