{"id":"2412.09936","title":"CaLoRAify: Calorie Estimation with Visual-Text Pairing and LoRA-Driven\n  Visual Language Models","authors":"Dongyu Yao, Keling Yao, Junhong Zhou, Yinghao Zhang","authorsParsed":[["Yao","Dongyu",""],["Yao","Keling",""],["Zhou","Junhong",""],["Zhang","Yinghao",""]],"versions":[{"version":"v1","created":"Fri, 13 Dec 2024 07:51:32 GMT"}],"updateDate":"2024-12-16","timestamp":1734076292000,"abstract":"  The obesity phenomenon, known as the heavy issue, is a leading cause of\npreventable chronic diseases worldwide. Traditional calorie estimation tools\noften rely on specific data formats or complex pipelines, limiting their\npracticality in real-world scenarios. Recently, vision-language models (VLMs)\nhave excelled in understanding real-world contexts and enabling conversational\ninteractions, making them ideal for downstream tasks such as ingredient\nanalysis. However, applying VLMs to calorie estimation requires domain-specific\ndata and alignment strategies. To this end, we curated CalData, a 330K\nimage-text pair dataset tailored for ingredient recognition and calorie\nestimation, combining a large-scale recipe dataset with detailed nutritional\ninstructions for robust vision-language training. Built upon this dataset, we\npresent CaLoRAify, a novel VLM framework aligning ingredient recognition and\ncalorie estimation via training with visual-text pairs. During inference, users\nonly need a single monocular food image to estimate calories while retaining\nthe flexibility of agent-based conversational interaction. With Low-rank\nAdaptation (LoRA) and Retrieve-augmented Generation (RAG) techniques, our\nsystem enhances the performance of foundational VLMs in the vertical domain of\ncalorie estimation. Our code and data are fully open-sourced at\nhttps://github.com/KennyYao2001/16824-CaLORAify.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"zso9Z2JaWWJsp8sVgZCCvP2KvHh--GHGLla1rSUdOfg","pdfSize":"3527859"}