{
  "id": "2412.03922",
  "title": "Deformation-Aware Segmentation Network Robust to Motion Artifacts for\n  Brain Tissue Segmentation using Disentanglement Learning",
  "authors": "Sunyoung Jung, Yoonseok Choi, Mohammed A. Al-masni, Minyoung Jung, and\n  Dong-Hyun Kim",
  "authorsParsed": [
    [
      "Jung",
      "Sunyoung",
      ""
    ],
    [
      "Choi",
      "Yoonseok",
      ""
    ],
    [
      "Al-masni",
      "Mohammed A.",
      ""
    ],
    [
      "Jung",
      "Minyoung",
      ""
    ],
    [
      "Kim",
      "Dong-Hyun",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 06:52:42 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733381562000,
  "abstract": "  Motion artifacts caused by prolonged acquisition time are a significant\nchallenge in Magnetic Resonance Imaging (MRI), hindering accurate tissue\nsegmentation. These artifacts appear as blurred images that mimic tissue-like\nappearances, making segmentation difficult. This study proposes a novel deep\nlearning framework that demonstrates superior performance in both motion\ncorrection and robust brain tissue segmentation in the presence of artifacts.\nThe core concept lies in a complementary process: a disentanglement learning\nnetwork progressively removes artifacts, leading to cleaner images and\nconsequently, more accurate segmentation by a jointly trained motion estimation\nand segmentation network. This network generates three outputs: a\nmotioncorrected image, a motion deformation map that identifies\nartifact-affected regions, and a brain tissue segmentation mask. This\ndeformation serves as a guidance mechanism for the disentanglement process,\naiding the model in recovering lost information or removing artificial\nstructures introduced by the artifacts. Extensive in-vivo experiments on\npediatric motion data demonstrate that our proposed framework outperforms\nstate-of-the-art methods in segmenting motion-corrupted MRI scans.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Image and Video Processing",
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "6j9OGzBrX6i3H0w0l7XExiAnSobUbdK59kb9fjUxg-s",
  "pdfSize": "1444841"
}