{
  "id": "2412.06101",
  "title": "Self-supervised cost of transport estimation for multimodal path\n  planning",
  "authors": "Vincent Gherold, Ioannis Mandralis, Eric Sihite, Adarsh Salagame,\n  Alireza Ramezani, Morteza Gharib",
  "authorsParsed": [
    [
      "Gherold",
      "Vincent",
      ""
    ],
    [
      "Mandralis",
      "Ioannis",
      ""
    ],
    [
      "Sihite",
      "Eric",
      ""
    ],
    [
      "Salagame",
      "Adarsh",
      ""
    ],
    [
      "Ramezani",
      "Alireza",
      ""
    ],
    [
      "Gharib",
      "Morteza",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 8 Dec 2024 23:02:35 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733698955000,
  "abstract": "  Autonomous robots operating in real environments are often faced with\ndecisions on how best to navigate their surroundings. In this work, we address\na particular instance of this problem: how can a robot autonomously decide on\nthe energetically optimal path to follow given a high-level objective and\ninformation about the surroundings? To tackle this problem we developed a\nself-supervised learning method that allows the robot to estimate the cost of\ntransport of its surroundings using only vision inputs. We apply our method to\nthe multi-modal mobility morphobot (M4), a robot that can drive, fly, segway,\nand crawl through its environment. By deploying our system in the real world,\nwe show that our method accurately assigns different cost of transports to\nvarious types of environments e.g. grass vs smooth road. We also highlight the\nlow computational cost of our method, which is deployed on an Nvidia Jetson\nOrin Nano robotic compute unit. We believe that this work will allow\nmulti-modal robotic platforms to unlock their full potential for navigation and\nexploration tasks.\n",
  "subjects": [
    "Computer Science/Robotics",
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "fzgRDWWGEIzSVTKJRYKz4afiAWqMK-S160kL7nxrHgo",
  "pdfSize": "6184223"
}