{
  "id": "2412.03687",
  "title": "Assessing Changes in Thinking about Troubleshooting in Physical\n  Computing: A Clinical Interview Protocol with Failure Artifacts Scenarios",
  "authors": "Luis Morales-Navarro, Deborah A. Fields, Yasmin B. Kafai, Deepali\n  Barapatre",
  "authorsParsed": [
    [
      "Morales-Navarro",
      "Luis",
      ""
    ],
    [
      "Fields",
      "Deborah A.",
      ""
    ],
    [
      "Kafai",
      "Yasmin B.",
      ""
    ],
    [
      "Barapatre",
      "Deepali",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 19:48:56 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733341736000,
  "abstract": "  Purpose: The purpose of this paper is to examine how a clinical interview\nprotocol with failure artifact scenarios can capture changes in high school\nstudents' explanations of troubleshooting processes in physical computing\nactivities. We focus on physical computing since finding and fixing hardware\nand software bugs is a highly contextual practice that involves multiple\ninterconnected domains and skills. Approach: We developed and piloted a\n\"failure artifact scenarios\" clinical interview protocol. Youth were presented\nwith buggy physical computing projects over video calls and asked for\nsuggestions on how to fix them without having access to the actual project or\nits code. We applied this clinical interview protocol before and after an\neight-week-long physical computing (more specifically, electronic textiles)\nunit. We analyzed matching pre- and post-interviews from 18 students at four\ndifferent schools. Findings: Our findings demonstrate how the protocol can\ncapture change in students' thinking about troubleshooting by eliciting\nstudents' explanations of specificity of domain knowledge of problems,\nmultimodality of physical computing, iterative testing of failure artifact\nscenarios, and concreteness of troubleshooting and problem solving processes.\nOriginality: Beyond tests and surveys used to assess debugging, which\ntraditionally focus on correctness or student beliefs, our \"failure artifact\nscenarios\" clinical interview protocol reveals student troubleshooting-related\nthinking processes when encountering buggy projects. As an assessment tool, it\nmay be useful to evaluate the change and development of students' abilities\nover time.\n",
  "subjects": [
    "Computer Science/Computers and Society"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "ZT1sqlRRxYR8N7tFxOwm-_ntd0cn-rI6OhaK8QaQGTE",
  "pdfSize": "7216066"
}