{
  "id": "2412.13894",
  "title": "Understanding acoustic scale observations: the one-sided fight against\n  $\\Lambda$",
  "authors": "Antony Lewis and Ewan Chamberlain",
  "authorsParsed": [
    [
      "Lewis",
      "Antony",
      ""
    ],
    [
      "Chamberlain",
      "Ewan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 14:35:07 GMT"
    },
    {
      "version": "v2",
      "created": "Thu, 27 Feb 2025 10:16:25 GMT"
    }
  ],
  "updateDate": "2025-02-28",
  "timestamp": 1734532507000,
  "abstract": "  The cosmic microwave background (CMB) and baryon acoustic oscillations (BAO)\nprovide precise measurements of the cosmic expansion history through the\ncomoving acoustic scale. The CMB angular scale measurement $\\theta_*$ is\nparticularly robust, constraining the ratio of the sound horizon to the angular\ndiameter distance to last scattering independently of the late-time\ncosmological model. For models with standard early-universe physics, this\nmeasurement strongly constrains possible deviations from $\\Lambda$CDM at late\ntimes. We show that the null energy condition imposes strict inequalities on\nthe BAO observables $D_H(z)$, $D_M(z)$, $D_V(z)$ and $F_{\\rm AP}(z)$ relative\nto $\\Lambda$CDM predictions. These inequalities demonstrate that certain\ndeviations from $\\Lambda$CDM are impossible for any physical non-interacting\ndark energy model that respects the null energy condition. We also identify the\nregions of parameter space in the CPL parameterization $w(a) = w_0 + w_a(1-a)$\nthat can give predictions consistent with both the null energy condition and\nthe observed CMB scale. While current DESI DR1 BAO measurements exhibit slight\njoint-constraint parameter tensions with $\\Lambda$CDM, this tension only arises\nin directions that are inconsistent with the null-energy condition, so\n$\\Lambda$CDM is favoured by current acoustic scale measurements unless the\nnull-energy condition is violated.\n",
  "subjects": [
    "Astrophysics/Cosmology and Nongalactic Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "a4JFx59ab7dQiY8tvczXONZYIaZD9L6l9boUe5yGSI4",
  "pdfSize": "2953197"
}