{"id":"2412.15833","title":"Up-Converting Luminescent Nanoparticles as Probes of Surface Dynamics in\n  Single Evaporating Microdroplets of Suspension","authors":"Yaroslav Shopa, Maciej Kolwas, Daniel Jakubczyk, Gennadiy Derkachov,\n  Izabela Kami\\'nska, Krzysztof Fronc, Tomasz Wojciechowski","authorsParsed":[["Shopa","Yaroslav",""],["Kolwas","Maciej",""],["Jakubczyk","Daniel",""],["Derkachov","Gennadiy",""],["Kamińska","Izabela",""],["Fronc","Krzysztof",""],["Wojciechowski","Tomasz",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 12:20:19 GMT"}],"updateDate":"2024-12-23","timestamp":1734697219000,"abstract":"  We have investigated the optically measurable properties of single\nevaporating microdroplets of suspensions containing up-converting luminescent\nnanoparticles (Gd2O3:Er3+), levitated in a linear electrodynamic trap. These\nmicrodroplets served as spherical optical resonators, with their resonance\nproperties influenced by the distribution and interactions of nanoparticles\n(NPs) acting as nanoprobes. Using a combination of light scattering theories,\nwe examined the evolution of the microdroplet radius, nanoparticle surface\norganization, and effective refractive index during evaporation. Up-conversion\nluminescence, driven by 805 nm excitation, enhanced the resolution of these\nobservations. Key findings reveal that the increasing NP density in the surface\nlayer leads to surface saturation, followed by transitions to a gel-like state\nthrough successive layer formation and collapse. Scattering and luminescence\nsignals exhibit complex oscillatory behaviors linked to resonance phenomena and\nnanoparticle migration driven by photophoretic forces. Theoretical modeling\nclosely aligns with experimental trends, confirming the interplay between NP\ndistribution and optical resonance properties.\n","subjects":["Physics/Optics","Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Soft Condensed Matter"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"b1Yh9JN9_9Ibwn_89YK5IWZQDjWLT7YseXIpG9kWjk4","pdfSize":"901786"}