{
  "id": "2412.00541",
  "title": "Context-Based Echo State Networks with Prediction Confidence for\n  Human-Robot Shared Control",
  "authors": "Negin Amirshirzad, Mehmet Arda Eren, Erhan Oztop",
  "authorsParsed": [
    [
      "Amirshirzad",
      "Negin",
      ""
    ],
    [
      "Eren",
      "Mehmet Arda",
      ""
    ],
    [
      "Oztop",
      "Erhan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 30 Nov 2024 17:20:00 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1732987200000,
  "abstract": "  In this paper, we propose a novel lightweight learning from demonstration\n(LfD) model based on reservoir computing that can learn and generate multiple\nmovement trajectories with prediction intervals, which we call as Context-based\nEcho State Network with prediction confidence (CESN+). CESN+ can generate\nmovement trajectories that may go beyond the initial LfD training based on a\ndesired set of conditions while providing confidence on its generated output.\nTo assess the abilities of CESN+, we first evaluate its performance against\nConditional Neural Movement Primitives (CNMP), a comparable framework that uses\na conditional neural process to generate movement primitives. Our findings\nindicate that CESN+ not only outperforms CNMP but is also faster to train and\ndemonstrates impressive performance in generating trajectories for\nextrapolation cases. In human-robot shared control applications, the confidence\nof the machine generated trajectory is a key indicator of how to arbitrate\ncontrol sharing. To show the usability of the CESN+ for human-robot adaptive\nshared control, we have designed a proof-of-concept human-robot shared control\ntask and tested its efficacy in adapting the sharing weight between the human\nand the robot by comparing it to a fixed-weight control scheme. The simulation\nexperiments show that with CESN+ based adaptive sharing the total human load in\nshared control can be significantly reduced. Overall, the developed CESN+ model\nis a strong lightweight LfD system with desirable properties such fast training\nand ability to extrapolate to the new task parameters while producing robust\nprediction intervals for its output.\n",
  "subjects": [
    "Computer Science/Robotics",
    "Computer Science/Human-Computer Interaction",
    "Computer Science/Machine Learning",
    "Computer Science/Neural and Evolutionary Computing",
    "Computer Science/Systems and Control",
    "Electrical Engineering and Systems Science/Systems and Control"
  ],
  "license": "http://creativecommons.org/publicdomain/zero/1.0/",
  "blobId": "nW_kMUtgjA8s5tHA3pcpO8_qpJzzW96a2fnI7MM-atM",
  "pdfSize": "10338324"
}