{
  "id": "2412.18033",
  "title": "Distributed Priority-Based Load Shedding over Time-Varying Communication\n  Networks",
  "authors": "Adel Aghajan, Miguel Jimenez-Aparicio, Michael E. Ropp, Jorge I.\n  Poveda",
  "authorsParsed": [
    [
      "Aghajan",
      "Adel",
      ""
    ],
    [
      "Jimenez-Aparicio",
      "Miguel",
      ""
    ],
    [
      "Ropp",
      "Michael E.",
      ""
    ],
    [
      "Poveda",
      "Jorge I.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 23:07:06 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1734995226000,
  "abstract": "  We study the problem of distributed optimal resource allocation on networks\nwith actions defined on discrete spaces, with applications to adaptive\nunder-frequency load-shedding in power systems. In this context, the primary\nobjective is to identify an optimal subset of loads (i.e., resources) in the\ngrid to be shed to maintain system stability whenever there is a sudden\nimbalance in the generation and loads. The selection of loads to be shed must\nsatisfy demand requirements while also incorporating criticality functions that\naccount for socio-technical factors in the optimization process, enabling the\nalgorithms to differentiate between network nodes with greater socio-technical\nvalue and those with less critical loads. Given the discrete nature of the\nstate space in the optimization problem, which precludes the use of standard\ngradient-based approaches commonly employed in resource allocation problems\nwith continuous action spaces, we propose a novel load-shedding algorithm based\non distributed root-finding techniques and the novel concept of cumulative\ncriticality function (CCF). For the proposed approach, convergence conditions\nvia Lyapunov-like techniques are established for a broad class of time-varying\ncommunication graphs that interconnect the system's regions. The theoretical\nresults are validated through numerical examples on the Quebec 29-bus system,\ndemonstrating the algorithm's effectiveness.\n",
  "subjects": [
    "Mathematics/Optimization and Control"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Bj92JcrViGKgam4CQ-v9irTvE9HuZZ41NYo0sFpGNBU",
  "pdfSize": "597181"
}