{
  "id": "2412.20698",
  "title": "Tutorial of Fourier and Hankel transforms for ultrafast optics",
  "authors": "Yi-Hao Chen",
  "authorsParsed": [
    [
      "Chen",
      "Yi-Hao",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 30 Dec 2024 04:21:48 GMT"
    },
    {
      "version": "v2",
      "created": "Wed, 1 Jan 2025 16:26:24 GMT"
    },
    {
      "version": "v3",
      "created": "Wed, 8 Jan 2025 12:33:10 GMT"
    },
    {
      "version": "v4",
      "created": "Tue, 14 Jan 2025 15:17:58 GMT"
    },
    {
      "version": "v5",
      "created": "Thu, 16 Jan 2025 13:14:24 GMT"
    },
    {
      "version": "v6",
      "created": "Mon, 27 Jan 2025 03:57:49 GMT"
    },
    {
      "version": "v7",
      "created": "Mon, 3 Feb 2025 14:25:48 GMT"
    },
    {
      "version": "v8",
      "created": "Sat, 15 Feb 2025 03:26:43 GMT"
    }
  ],
  "updateDate": "2025-02-18",
  "timestamp": 1735532508000,
  "abstract": "  This tutorial is designed for individuals who are new to the field of\nultrafast optics. It was written in response to the apparent lack of\ncomprehensive introductions to the basic Fourier transform, extending beyond\nthe flat-phase description. Additionally, it contains complete derivations of\nthe general formulations of several Fourier-transform relations. It shows the\nimportance of having Fourier-transform constants as parameters, and helps\nclarify the arbitrary selection of Fourier-transform constants and conventions.\nMost of the time, an implementation of an optical numerical simulation is first\nverified by checking the smoothness of the generated result (because physical\nphenomena mostly exhibit some smooth physical features, e.g., temporal or\nspectral profiles) or further by seeing if the simulation reasonably duplicates\nthe ``known physics.'' However, the misuse of Fourier transform, from my\nobservations, cannot be easily detected by such naive verifications. One main\npurpose of this tutorial is to clarify the correct Fourier-transform convention\nto be employed in ultrafast optics. Moreover, other Fourier-transform aspects,\nsuch as convolution and aliasing, are discussed. In addition, a tutorial of the\nHankel transform, which arises from the two-dimensional spatial Fourier\ntransform of a radially-symmetric function, is provided. Its numerical\nimplementation based on the fast Hankel transform with high accuracy (FHATHA)\nis also provided, which is the core element of computationally-efficient\nradially-symmetric full-field optical propagation. Despite being a tutorial, I,\nfor the first time, propose a new numerical scheme for the fast Hankel\ntransform that outperforms both the original FHATHA and the discrete Hankel\ntransform.\n",
  "subjects": [
    "Physics/Optics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "9SVi8__1CWLjW8i-aztgMeX7WinfmDptTib9-7t2QOw",
  "pdfSize": "2124636"
}