{
  "id": "2412.15223",
  "title": "Public Engagement in Action: Developing an Introductory Programming\n  Module for Apprentices",
  "authors": "Jianhua Yang, Mir Seyedebrahimi, Margaret Low, Holly Heshmati",
  "authorsParsed": [
    [
      "Yang",
      "Jianhua",
      ""
    ],
    [
      "Seyedebrahimi",
      "Mir",
      ""
    ],
    [
      "Low",
      "Margaret",
      ""
    ],
    [
      "Heshmati",
      "Holly",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 09:55:59 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1733306159000,
  "abstract": "  Programming is a crucial skill in today's world and being taught worldwide at\ndifferent levels. However, in the literature there is little research\ninvestigating a formal approach to embedding public engagement into programming\nmodule design. This paper explores the integration of public engagement into an\nintroductory programming module, at the University of Warwick, UK, as part of\nthe Digital and Technology Solutions (DTS) degree apprenticeship. The module\ndesign follows a 'V' model, which integrates community engagement with\ntraditional programming education, providing a holistic learning experience.\nThe aim is to enhance learning by combining programming education with\ncommunity engagement. Apprentices participate in outreach activities, teaching\nprogramming and Arduino hardware to local secondary school students. This\nhands-on approach aligns with Kolb's experiential learning model, improving\ncommunication skills and solidifying programming concepts through teaching. The\nmodule also includes training in safeguarding, presentation skills, and\nstorytelling to prepare apprentices for public engagement. Pedagogical\ntechniques in the module include live coding, group exercises, and Arduino kit\nusage, as well as peer education, allowing apprentices to learn from and teach\neach other. Degree apprentices, who balance part-time studies with full-time\nemployment, bring diverse knowledge and motivations. The benefit of public\nengagement is that it helps bridge their skills gap, fostering teamwork and\ncreating a positive learning environment. Embedding public engagement in\nprogramming education also enhances both technical and soft skills, providing\napprentices with a deeper understanding of community issues and real-world\napplications. Our design supports their academic and professional growth,\nensuring the module's ongoing success and impact.\n",
  "subjects": [
    "Computer Science/Computers and Society"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Dwr7A9zUXTCRH_3W-ocyLS6Ph10ZhOoO5GRfHUx-hJU",
  "pdfSize": "185526"
}