{
  "id": "2412.02809",
  "title": "The origin, consequence, and visibility of criticism in science",
  "authors": "Bingsheng Chen, Dakota Murray, Yixuan Liu, Albert-L\\'aszl\\'o\n  Barab\\'asi",
  "authorsParsed": [
    [
      "Chen",
      "Bingsheng",
      ""
    ],
    [
      "Murray",
      "Dakota",
      ""
    ],
    [
      "Liu",
      "Yixuan",
      ""
    ],
    [
      "Barabási",
      "Albert-László",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 20:19:32 GMT"
    }
  ],
  "updateDate": "2024-12-05",
  "timestamp": 1733257172000,
  "abstract": "  Critique between peers plays a vital role in the production of scientific\nknowledge. Yet, there is limited empirical evidence on the origins of\ncriticism, its effects on the papers and individuals involved, and its\nvisibility within the scientific literature. Here, we address these gaps\nthrough a data-driven analysis of papers that received substantiated and\nexplicit written criticisms. Our analysis draws on data representing over 3,000\n``critical letters'' -- papers explicitly published to critique another -- from\nfour high profile journals, with each letter linked to its target paper. We\nfind that the papers receiving critical letters are disproportionately among\nthe most highly-cited in their respective journal and, to a lesser extent,\namong the most interdisciplinary and novel. However, despite the theoretical\nimportance of criticism in scientific progress, we observe no evidence that\nreceiving a critical letter affects a paper's citation trajectory or the\nproductivity and citation impact of its authors. One explanation for the\nlimited consequence of critical letters is that they often go unnoticed.\nIndeed, we find that critical letters attract only a small fraction of the\ncitations received by their targets, even years after publication. An analysis\nof topical similarity between criticized papers and their citing papers\nindicates that critical letters are primarily cited by researchers actively\nengaged in a similar field of study, whereas they are overlooked by more\ndistant communities. Although criticism is celebrated as a cornerstone to\nscience, our findings reveal that it is concentrated on high-impact papers, has\nminimal measurable consequences, and suffers from limited visibility. These\nresults raise important questions about the role and value of critique in\nscientific practice.\n",
  "subjects": [
    "Computer Science/Digital Libraries",
    "Computer Science/Social and Information Networks"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "7C-Wh79m-l1wYfxfB5XGR3LUtSP2ye0q7arZnZUbmG4",
  "pdfSize": "2293006"
}