{"id":"2412.12753","title":"Bond-Network Entropy Governs Heat Transport in Coordination-Disordered\n  Solids","authors":"Kamil Iwanowski, G\\'abor Cs\\'anyi, and Michele Simoncelli","authorsParsed":[["Iwanowski","Kamil",""],["Csányi","Gábor",""],["Simoncelli","Michele",""]],"versions":[{"version":"v1","created":"Tue, 17 Dec 2024 10:18:17 GMT"},{"version":"v2","created":"Thu, 9 Jan 2025 00:36:08 GMT"}],"updateDate":"2025-01-10","timestamp":1734430697000,"abstract":"  Understanding how the vibrational and thermal properties of solids are\ninfluenced by atomistic structural disorder is of fundamental scientific\ninterest, and paramount to designing materials for next-generation energy\ntechnologies. While several studies indicate that structural disorder strongly\ninfluences the thermal conductivity, the fundamental physics governing the\ndisorder-conductivity relation remains elusive. Here we show that\norder-of-magnitude, disorder-induced variations of conductivity in network\nsolids can be predicted from a bond-network entropy, an atomistic structural\ndescriptor that quantifies heterogeneity in the topology of the atomic-bond\nnetwork. We employ the Wigner formulation of thermal transport to demonstrate\nthe existence of a relation between the bond-network entropy, and observables\nsuch as smoothness of the vibrational density of states (VDOS) and macroscopic\nconductivity. We also show that the smoothing of the VDOS encodes information\nabout the thermal resistance induced by disorder, and can be directly related\nto phenomenological models for phonon-disorder scattering based on the\nsemiclassical Peierls-Boltzmann equation. Our findings rationalize the\nconductivity variations of disordered carbon polymorphs ranging from nanoporous\nelectrodes to defective graphite used as a moderator in nuclear reactors.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"NQhgCW7g6qMJj-RQ28a9Bj7KiQFx6jHsjkQlasEtmtY","pdfSize":"9027918"}