{"id":"2412.14685","title":"The JWST/NIRSpec view of the nuclear region in the prototypical merging\n  galaxy NGC 6240","authors":"Matteo Ceci, Giovanni Cresci, Santiago Arribas, Torsten B\\\"oker, Andy\n  Bunker, Stephane Charlot, Katja Fahrion, Isabella Lamperti, Alessandro\n  Marconi, Giulia Tozzi, Michele Perna, Lorenzo Ulivi","authorsParsed":[["Ceci","Matteo",""],["Cresci","Giovanni",""],["Arribas","Santiago",""],["Böker","Torsten",""],["Bunker","Andy",""],["Charlot","Stephane",""],["Fahrion","Katja",""],["Lamperti","Isabella",""],["Marconi","Alessandro",""],["Tozzi","Giulia",""],["Perna","Michele",""],["Ulivi","Lorenzo",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 09:37:36 GMT"},{"version":"v2","created":"Fri, 7 Feb 2025 11:04:15 GMT"}],"updateDate":"2025-02-10","timestamp":1734601056000,"abstract":"  Merger events are thought to be an important phase in the assembly of massive\ngalaxies. At the same time, Active Galactic Nuclei (AGN) play a fundamental\nrole in the evolution of their star formation histories. Both phenomena can be\nobserved at work in NGC 6240, a local prototypical merger, classified as an\nUltraLuminous InfraRed Galaxy (ULIRG) thanks to its elevated infrared\nluminosity. Interestingly, NGC 6240 hosts two AGN separated by 1.5''(~ 735 pc),\ndetected in both X-ray and radio band. Taking advantage of the unprecedented\nsensitivity and wavelength coverage provided by the Integral Field Unit (IFU)\nof the NIRSpec instrument onboard JWST, we observed the nuclear region of NGC\n6240 in a FoV of 3.7'' x 3.7''(1.9 x 1.9 kpc^2), to investigate gas kinematics\nand InterStellar Medium (ISM) properties with a high spatial resolution of ~\n0.1'' (or ~ 50 pc). We separated the different gas kinematic components through\nmulti-Gaussian fitting and studied the excitation properties of the ISM from\nthe NIR diagnostic diagram based on the H_2 1-0 S(1)/BrGamma and [Fe\nII]1.257micron/PaBeta lines ratios. We isolated the ionization cones of the two\nnuclei, and detected coronal lines emission from both of them. Using H_2 line\nratios, we found that the molecular hydrogen gas is excited mostly by thermal\nprocesses. We computed a hot molecular gas mass of 1.3 x 10^5 M_sun and an\nionized gas mass in the range of 10^5 - 10^7 M_sun. We studied with\nunprecedented spatial resolution and sensitivity the kinematics of the\nmolecular and ionized gas phases. We revealed the complex structure of the\nmolecular gas and found a blueshifted outflow near the Southern nucleus,\ntogether with filaments connecting a highly redshifted H_2 cloud with the two\nnuclei. We speculate on the possible nature of this H_2 cloud and propose two\npossible scenarios: either outflowing gas, or a tidal cloud falling onto the\nnuclei.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8I-8H2EYik_Yof5PC1rmIlqBlwjceKfvDPn13adWObM","pdfSize":"27654306"}