{"id":"2412.01545","title":"Beyond SICP -- Design and Implementation of a Notional Machine for\n  Scheme","authors":"Kyriel Abad, Martin Henz","authorsParsed":[["Abad","Kyriel",""],["Henz","Martin",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 14:34:30 GMT"}],"updateDate":"2024-12-03","timestamp":1733150070000,"abstract":"  Computer science education has been at the heart of Scheme from the\nbeginning. The language was designed in the 1970s concurrently with the MIT\ncourse 6.001 and the textbook \"Structure and Interpretation of Computer\nPrograms\" (SICP). To explain the scope of variables at run time in the presence\nof higher-order procedures, SICP introduces a mental model called the\nenvironment model, along with a pictorial representation of environments and\ndata structures. Recently, the concept of notional machines has emerged in\ncomputer science education: a predictive set of abstractions that define the\nstructure and behavior of a computational device. Proponents of notional\nmachines argue that learners benefit when complex dynamic concepts such as the\ncomputational structure of Scheme are accompanied with concise notional\nmachines. In this paper, we start with a sublanguage of Scheme sufficient for\nall programs in SICP that we call SICP Scheme. We extend the environment model\nto a full notional machine for SICP Scheme that is simple enough to serve as\nthe central mental model in a CS1 course and demonstrate the machine with\ncomputer-generated visualizations. Moving beyond SICP Scheme, we show how the\nnotional machine can be further extended to explain Scheme's call/cc and thus\nmake this powerful concept accessible to beginners through a coherent mental\nmodel. The presented notional machine serves as the core of a web-based\nimplementation of Scheme that is under development at our university.\n","subjects":["Computer Science/Programming Languages"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"h8dCY6qUR51dB9ZNgeegiAOUY9EcA0Ych88m6JdyXRs","pdfSize":"1365145"}