{"id":"2412.14378","title":"A first taste of MEAD (Measuring Extinction and Abundances of Dust) --\n  I. Diffuse Milky Way interstellar dust extinction features in JWST infrared\n  spectra","authors":"Marjorie Decleir, Karl D. Gordon, Karl A. Misselt, Burcu G\\\"unay,\n  Julia Roman-Duval, Sascha T. Zeegers","authorsParsed":[["Decleir","Marjorie",""],["Gordon","Karl D.",""],["Misselt","Karl A.",""],["Günay","Burcu",""],["Roman-Duval","Julia",""],["Zeegers","Sascha T.",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 22:25:43 GMT"}],"updateDate":"2024-12-20","timestamp":1734560743000,"abstract":"  We present the initial results of MEAD (Measuring Extinction and Abundances\nof Dust), with a focus on the dust extinction features observed in our JWST\nnear- and mid-infrared spectra of nine diffuse Milky Way sightlines ($1.2 \\leq\nA(V) \\leq 2.5$). For the first time, we find strong correlations between the 10\n$\\mu$m silicate feature strength and the column densities of Mg, Fe and O in\ndust. This is consistent with the well-established theory that Mg- and Fe-rich\nsilicates are responsible for this feature. We obtained an average\nstoichiometry of the silicate grains in our sample of Mg:Fe:O = 1.1:1:11.2,\nconstraining the grain composition. We find variations in the feature\nproperties, indicating that different sightlines contain different types of\nsilicates. In the average spectrum of our sample, we tentatively detect\nfeatures around 3.4 and 6.2 $\\mu$m, which are likely caused by aliphatic and\naromatic/olefinic hydrocarbons, respectively. If real, to our knowledge, this\nis the first detection of hydrocarbons in purely diffuse sightlines with $A(V)\n\\leq 2.5$, confirming the presence of these grains in diffuse environments. We\ndetected a 3 $\\mu$m feature toward HD073882, and tentatively in the sample\naverage, likely caused by water ice (or solid-state water trapped on silicate\ngrains). If confirmed, to our knowledge, this is the first detection of ice in\npurely diffuse sightlines with $A(V) \\leq 2.5$, supporting previous findings\nthat these molecules can exist in the diffuse ISM.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Q2Am1rP9jcymdWzPMKBB1imbJooDQIP8i8DELAXX4JA","pdfSize":"986098"}