{"id":"2412.20042","title":"DAVE: Diverse Atomic Visual Elements Dataset with High Representation of\n  Vulnerable Road Users in Complex and Unpredictable Environments","authors":"Xijun Wang, Pedro Sandoval-Segura, Chengyuan Zhang, Junyun Huang,\n  Tianrui Guan, Ruiqi Xian, Fuxiao Liu, Rohan Chandra, Boqing Gong, Dinesh\n  Manocha","authorsParsed":[["Wang","Xijun",""],["Sandoval-Segura","Pedro",""],["Zhang","Chengyuan",""],["Huang","Junyun",""],["Guan","Tianrui",""],["Xian","Ruiqi",""],["Liu","Fuxiao",""],["Chandra","Rohan",""],["Gong","Boqing",""],["Manocha","Dinesh",""]],"versions":[{"version":"v1","created":"Sat, 28 Dec 2024 06:13:44 GMT"}],"updateDate":"2024-12-31","timestamp":1735366424000,"abstract":"  Most existing traffic video datasets including Waymo are structured, focusing\npredominantly on Western traffic, which hinders global applicability.\nSpecifically, most Asian scenarios are far more complex, involving numerous\nobjects with distinct motions and behaviors. Addressing this gap, we present a\nnew dataset, DAVE, designed for evaluating perception methods with high\nrepresentation of Vulnerable Road Users (VRUs: e.g. pedestrians, animals,\nmotorbikes, and bicycles) in complex and unpredictable environments. DAVE is a\nmanually annotated dataset encompassing 16 diverse actor categories (spanning\nanimals, humans, vehicles, etc.) and 16 action types (complex and rare cases\nlike cut-ins, zigzag movement, U-turn, etc.), which require high reasoning\nability. DAVE densely annotates over 13 million bounding boxes (bboxes) actors\nwith identification, and more than 1.6 million boxes are annotated with both\nactor identification and action/behavior details. The videos within DAVE are\ncollected based on a broad spectrum of factors, such as weather conditions, the\ntime of day, road scenarios, and traffic density. DAVE can benchmark video\ntasks like Tracking, Detection, Spatiotemporal Action Localization,\nLanguage-Visual Moment retrieval, and Multi-label Video Action Recognition.\nGiven the critical importance of accurately identifying VRUs to prevent\naccidents and ensure road safety, in DAVE, vulnerable road users constitute\n41.13% of instances, compared to 23.71% in Waymo. DAVE provides an invaluable\nresource for the development of more sensitive and accurate visual perception\nalgorithms in the complex real world. Our experiments show that existing\nmethods suffer degradation in performance when evaluated on DAVE, highlighting\nits benefit for future video recognition research.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"LNi73sLuHp098QVlfMVfxBw8t0X2lDFzHUB3LZLCJFs","pdfSize":"1766278"}