{
  "id": "2412.12052",
  "title": "Africanus I. Scalable, distributed and efficient radio data processing\n  with Dask-MS and Codex Africanus",
  "authors": "Simon J. Perkins, Jonathan S. Kenyon, Lexy A.L. Andati, Hertzog L.\n  Bester, Oleg M. Smirnov, Benjamin V. Hugo",
  "authorsParsed": [
    [
      "Perkins",
      "Simon J.",
      ""
    ],
    [
      "Kenyon",
      "Jonathan S.",
      ""
    ],
    [
      "Andati",
      "Lexy A. L.",
      ""
    ],
    [
      "Bester",
      "Hertzog L.",
      ""
    ],
    [
      "Smirnov",
      "Oleg M.",
      ""
    ],
    [
      "Hugo",
      "Benjamin V.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 18:21:42 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 17 Dec 2024 11:45:10 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734373302000,
  "abstract": "  New radio interferometers such as MeerKAT, SKA, ngVLA, and DSA-2000 drive\nadvancements in software for two key reasons. First, handling the vast data\nfrom these instruments requires subdivision and multi-node processing. Second,\ntheir improved sensitivity, achieved through better engineering and larger data\nvolumes, demands new techniques to fully exploit it. This creates a critical\nchallenge in radio astronomy software: pipelines must be optimized to process\ndata efficiently, but unforeseen artefacts from increased sensitivity require\nongoing development of new techniques. This leads to a trade-off among (1)\nperformance, (2) flexibility, and (3) ease-of-development. Rigid designs often\nmiss the full scope of the problem, while temporary research code is unsuitable\nfor production. This work introduces a framework for developing radio astronomy\ntechniques while balancing the above trade-offs. It prioritizes flexibility and\nease-of-development alongside acceptable performance by leveraging Open Source\ndata formats and software. To manage growing data volumes, data is distributed\nacross multiple processors and nodes for parallel processing, utilizing HPC and\ncloud infrastructure. We present two Python libraries, Dask-MS and Codex\nAfricanus, which enable distributed, high-performance radio astronomy software\nwith Dask. Dask is a lightweight parallelization and distribution framework\nthat integrates with the PyData ecosystem, addressing the \"Big Data\" challenges\nof radio astronomy.\n",
  "subjects": [
    "Astrophysics/Instrumentation and Methods for Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "p6MRiZ9qhpX7B8dG_y1mAtjwEyCUD1DfYq0GcrTweKQ",
  "pdfSize": "533951"
}