{
  "id": "2412.02443",
  "title": "Multi-scale and Multi-path Cascaded Convolutional Network for Semantic\n  Segmentation of Colorectal Polyps",
  "authors": "Malik Abdul Manan, Feng Jinchao, Muhammad Yaqub, Shahzad Ahmed, Syed\n  Muhammad Ali Imran, Imran Shabir Chuhan, Haroon Ahmed Khan",
  "authorsParsed": [
    [
      "Manan",
      "Malik Abdul",
      ""
    ],
    [
      "Jinchao",
      "Feng",
      ""
    ],
    [
      "Yaqub",
      "Muhammad",
      ""
    ],
    [
      "Ahmed",
      "Shahzad",
      ""
    ],
    [
      "Imran",
      "Syed Muhammad Ali",
      ""
    ],
    [
      "Chuhan",
      "Imran Shabir",
      ""
    ],
    [
      "Khan",
      "Haroon Ahmed",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 13:27:51 GMT"
    }
  ],
  "updateDate": "2024-12-04",
  "timestamp": 1733232471000,
  "abstract": "  Colorectal polyps are structural abnormalities of the gastrointestinal tract\nthat can potentially become cancerous in some cases. The study introduces a\nnovel framework for colorectal polyp segmentation named the Multi-Scale and\nMulti-Path Cascaded Convolution Network (MMCC-Net), aimed at addressing the\nlimitations of existing models, such as inadequate spatial dependence\nrepresentation and the absence of multi-level feature integration during the\ndecoding stage by integrating multi-scale and multi-path cascaded convolutional\ntechniques and enhances feature aggregation through dual attention modules,\nskip connections, and a feature enhancer. MMCC-Net achieves superior\nperformance in identifying polyp areas at the pixel level. The Proposed\nMMCC-Net was tested across six public datasets and compared against eight SOTA\nmodels to demonstrate its efficiency in polyp segmentation. The MMCC-Net's\nperformance shows Dice scores with confidence intervals ranging between (77.08,\n77.56) and (94.19, 94.71) and Mean Intersection over Union (MIoU) scores with\nconfidence intervals ranging from (72.20, 73.00) to (89.69, 90.53) on the six\ndatabases. These results highlight the model's potential as a powerful tool for\naccurate and efficient polyp segmentation, contributing to early detection and\nprevention strategies in colorectal cancer.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Image and Video Processing",
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "OiZJQD9-79m5Mr8MlYaWsfZj-a9hTMS8sU289ITAduM",
  "pdfSize": "9214126"
}