{"id":"2412.01655","title":"Command-line Risk Classification using Transformer-based Neural\n  Architectures","authors":"Paolo Notaro, Soroush Haeri, Jorge Cardoso, Michael Gerndt","authorsParsed":[["Notaro","Paolo",""],["Haeri","Soroush",""],["Cardoso","Jorge",""],["Gerndt","Michael",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 16:04:31 GMT"}],"updateDate":"2024-12-03","timestamp":1733155471000,"abstract":"  To protect large-scale computing environments necessary to meet increasing\ncomputing demand, cloud providers have implemented security measures to monitor\nOperations and Maintenance (O&M) activities and therefore prevent data loss and\nservice interruption. Command interception systems are used to intercept,\nassess, and block dangerous Command-line Interface (CLI) commands before they\ncan cause damage. Traditional solutions for command risk assessment include\nrule-based systems, which require expert knowledge and constant human revision\nto account for unseen commands. To overcome these limitations, several\nend-to-end learning systems have been proposed to classify CLI commands. These\nsystems, however, have several other limitations, including the adoption of\ngeneral-purpose text classifiers, which may not adapt to the language\ncharacteristics of scripting languages such as Bash or PowerShell, and may not\nrecognize dangerous commands in the presence of an unbalanced class\ndistribution. In this paper, we propose a transformer-based command risk\nclassification system, which leverages the generalization power of Large\nLanguage Models (LLM) to provide accurate classification and the ability to\nidentify rare dangerous commands effectively, by exploiting the power of\ntransfer learning. We verify the effectiveness of our approach on a realistic\ndataset of production commands and show how to apply our model for other\nsecurity-related tasks, such as dangerous command interception and auditing of\nexisting rule-based systems.\n","subjects":["Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"RKSdXvRflgoW6ojTLIJVnR6eHF9EBpPsDBZYWNhvTvE","pdfSize":"503435"}