{
  "id": "2412.06573",
  "title": "Population-level Hypothesis Testing with Rocky Planet Emission Data: A\n  Tentative Trend in the Brightness Temperatures of M-Earths",
  "authors": "Brandon Park Coy, Jegug Ih, Edwin S. Kite, Daniel D.B. Koll, Moritz\n  Tenthoff, Jacob L. Bean, Megan Weiner Mansfield, Michael Zhang, Qiao Xue,\n  Eliza M.-R. Kempton, Kay Wolhfarth, Renyu Hu, Xintong Lyu, Christian Wohler",
  "authorsParsed": [
    [
      "Coy",
      "Brandon Park",
      ""
    ],
    [
      "Ih",
      "Jegug",
      ""
    ],
    [
      "Kite",
      "Edwin S.",
      ""
    ],
    [
      "Koll",
      "Daniel D. B.",
      ""
    ],
    [
      "Tenthoff",
      "Moritz",
      ""
    ],
    [
      "Bean",
      "Jacob L.",
      ""
    ],
    [
      "Mansfield",
      "Megan Weiner",
      ""
    ],
    [
      "Zhang",
      "Michael",
      ""
    ],
    [
      "Xue",
      "Qiao",
      ""
    ],
    [
      "Kempton",
      "Eliza M. -R.",
      ""
    ],
    [
      "Wolhfarth",
      "Kay",
      ""
    ],
    [
      "Hu",
      "Renyu",
      ""
    ],
    [
      "Lyu",
      "Xintong",
      ""
    ],
    [
      "Wohler",
      "Christian",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 15:27:40 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733758060000,
  "abstract": "  Determining which rocky exoplanets have atmospheres, and why, is a key goal\nfor JWST. So far, emission observations of individual rocky exoplanets orbiting\nM stars (M-Earths) have not provided definitive evidence for atmospheres. Here,\nwe synthesize emission data for M-Earths and find a trend in measured\nbrightness temperature (ratioed to its theoretical maximum value) as a function\nof instellation. However, the statistical evidence of this trend is dependent\non the choice of stellar model and we consider its identification tentative. We\nshow that this trend can be explained by either the onset of thin/tenuous\natmospheres on colder worlds, or a population of bare rocks with stronger space\nweathering and/or coarser regolith on closer-in worlds. Such grain coarsening\nmay be caused by sintering near the melting point of rock or frequent volcanic\nresurfacing. We also find that fresh, fine-grained surfaces can serve as a\nfalse positive to the detection of moderate atmospheric heat redistribution.\nHowever, we argue that such surfaces are unlikely given the ubiquity of space\nweathering in the Solar System and the low albedo of Solar System airless\nbodies. Furthermore, we highlight considerations when testing rocky planet\nhypotheses at the population level, including the choice of instrument, stellar\nmodeling, and how brightness temperatures are derived. Emission data from a\nlarger sample of M-Earths will be able to confirm or reject this tentative\ntrend and diagnose its cause.\n",
  "subjects": [
    "Astrophysics/Earth and Planetary Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "LzT55iENfCdBjvXgYt2_UkPMObiPj84nUpLS2Rat1qQ",
  "pdfSize": "2605212"
}