{
  "id": "2412.03384",
  "title": "Characterization of local energy transfer in large-scale intermittent\n  stratified geophysical flows via space filtering",
  "authors": "Raffaello Foldes, Raffaele Marino, Silvio Sergio Cerri, Enrico\n  Camporeale",
  "authorsParsed": [
    [
      "Foldes",
      "Raffaello",
      ""
    ],
    [
      "Marino",
      "Raffaele",
      ""
    ],
    [
      "Cerri",
      "Silvio Sergio",
      ""
    ],
    [
      "Camporeale",
      "Enrico",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 15:11:59 GMT"
    }
  ],
  "updateDate": "2024-12-05",
  "timestamp": 1733325119000,
  "abstract": "  Recent studies based on simulations of the Boussinesq equations indicate that\nstratified turbulent flows can develop large-scale intermittency in the\nvelocity and temperature fields, as detected in the atmosphere and in the\noceans. In particular, emerging powerful vertical drafts were found to generate\nlocal turbulence, proving necessary for stratified flows to dissipate the\nenergy as efficiently as homogeneous isotropic turbulent flows. The existence\nof regions characterized by enhanced turbulence and dissipation, as observed,\nfor instance, in the ocean, requires appropriate tools to assess how energy is\ntransferred across the scales and at the same time locally in the physical\nspace. After refining a classical space-filtering procedure, here we\ninvestigate the feedback of extreme vertical velocity drafts on energy transfer\nand exchanges in subdomains of simulations of stably stratified flows of\ngeophysical interest. Our analysis shows that vertical drafts are indeed able\nto trigger upscale and downscale energy transfers, strengthening the coupling\nbetween kinetic and potential energies at certain scales, depending on the\nintensity of the local vertical velocity.\n",
  "subjects": [
    "Physics/Fluid Dynamics",
    "Physics/Atmospheric and Oceanic Physics",
    "Physics/Computational Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "OwdkKdj5_r2V7UDhxswOCNWYQ56PnJpWm9-2WvLZ0qY",
  "pdfSize": "6633063"
}