{
  "id": "2412.17472",
  "title": "Collective dynamics behind success",
  "authors": "Manuel S. Mariani, Federico Battiston, Em\\H{o}ke-\\'Agnes Horv\\'at,\n  Giacomo Livan, Federico Musciotto, Dashun Wang",
  "authorsParsed": [
    [
      "Mariani",
      "Manuel S.",
      ""
    ],
    [
      "Battiston",
      "Federico",
      ""
    ],
    [
      "Horvát",
      "Emőke-Ágnes",
      ""
    ],
    [
      "Livan",
      "Giacomo",
      ""
    ],
    [
      "Musciotto",
      "Federico",
      ""
    ],
    [
      "Wang",
      "Dashun",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 10:58:01 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734951481000,
  "abstract": "  Understanding the collective dynamics behind the success of ideas, products,\nbehaviors, and social actors is critical for decision-making across diverse\ncontexts, including hiring, funding, career choices, and the design of\ninterventions for social change. Methodological advances and the increasing\navailability of big data now allow for a broader and deeper understanding of\nthe key facets of success. Recent studies unveil regularities beneath the\ncollective dynamics of success, pinpoint underlying mechanisms, and even enable\npredictions of success across diverse domains, including science, technology,\nbusiness, and the arts. However, this research also uncovers troubling biases\nthat challenge meritocratic views of success. This review synthesizes the\ngrowing, cross-disciplinary literature on the collective dynamics behind\nsuccess and calls for further research on cultural influences, the origins of\ninequalities, the role of algorithms in perpetuating them, and experimental\nmethods to further probe causal mechanisms behind success. Ultimately, these\nefforts may help to better align success with desired societal values.\n",
  "subjects": [
    "Physics/Physics and Society",
    "Computer Science/Social and Information Networks"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "y6vtuI8Xg6lgw_i__YOFkaSofteQ6VOgl14s8WI0sFE",
  "pdfSize": "1029997"
}