{
  "id": "2412.10317",
  "title": "Sampling from exponential distributions in the time domain with\n  superparamagnetic tunnel junctions",
  "authors": "Temitayo N. Adeyeye, Sidra Gibeault, Daniel P. Lathrop, Matthew W.\n  Daniels, Mark D. Stiles, Jabez J. McClelland, William A. Borders, Jason T.\n  Ryan, Philippe Talatchian, Ursula Ebels, and Advait Madhavan",
  "authorsParsed": [
    [
      "Adeyeye",
      "Temitayo N.",
      ""
    ],
    [
      "Gibeault",
      "Sidra",
      ""
    ],
    [
      "Lathrop",
      "Daniel P.",
      ""
    ],
    [
      "Daniels",
      "Matthew W.",
      ""
    ],
    [
      "Stiles",
      "Mark D.",
      ""
    ],
    [
      "McClelland",
      "Jabez J.",
      ""
    ],
    [
      "Borders",
      "William A.",
      ""
    ],
    [
      "Ryan",
      "Jason T.",
      ""
    ],
    [
      "Talatchian",
      "Philippe",
      ""
    ],
    [
      "Ebels",
      "Ursula",
      ""
    ],
    [
      "Madhavan",
      "Advait",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 17:58:35 GMT"
    },
    {
      "version": "v2",
      "created": "Fri, 21 Feb 2025 17:57:51 GMT"
    }
  ],
  "updateDate": "2025-02-24",
  "timestamp": 1734112715000,
  "abstract": "  In the superparamagnetic regime, magnetic tunnel junctions switch between two\nresistance states due to random thermal fluctuations. The dwell time\ndistribution in each state is exponential. We sample this distribution using a\ntemporal encoding scheme, in which information is encoded in the time at which\nthe device switches between its resistance states. We then develop a circuit\nelement known as a probabilistic delay cell that applies an electrical current\nstep to a superparamagnetic tunnel junction and a temporal measurement circuit\nthat measures the timing of the first switching event. Repeated experiments\nconfirm that these times are exponentially distributed. Temporal processing\nmethods then allow us to digitally compute with these exponentially distributed\nprobabilistic delay cells. We describe how to use these circuits in a\nMetropolis-Hastings stepper and in a weighted random sampler, both of which are\ncomputationally intensive applications that benefit from the efficient\ngeneration of exponentially distributed random numbers.\n",
  "subjects": [
    "Computer Science/Emerging Technologies"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "pZH6qrRBQ-xl9HLeH5mhCC3aj4naj9cr023H_xvlBe0",
  "pdfSize": "4388159"
}