{
  "id": "2412.13458",
  "title": "Inducing Berry Curvature Dipole in Multilayer Graphene through\n  Inhomogeneous Interlayer Sliding",
  "authors": "Jie Pan, Huanhuan Wang, Lin Zou, Haibo Xie, Yi Ding, Yuze Zhang,\n  Aiping Fang, Zhe Wang",
  "authorsParsed": [
    [
      "Pan",
      "Jie",
      ""
    ],
    [
      "Wang",
      "Huanhuan",
      ""
    ],
    [
      "Zou",
      "Lin",
      ""
    ],
    [
      "Xie",
      "Haibo",
      ""
    ],
    [
      "Ding",
      "Yi",
      ""
    ],
    [
      "Zhang",
      "Yuze",
      ""
    ],
    [
      "Fang",
      "Aiping",
      ""
    ],
    [
      "Wang",
      "Zhe",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 03:01:35 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734490895000,
  "abstract": "  Breaking lattice symmetry is crucial for generating a nonzero Berry\ncurvature. While manipulating twisting angles between adjacent layers has\nsuccessfully broken lattice symmetry through strain field and generated nonzero\nBerry curvature, interlayer sliding in principle offers a promising alternative\nroute. However, realizing uniform interlayer sliding faces experimental\nchallenges due to its energetic instability. In this work, we introduce an\nexperimentally feasible method, using a corrugated substrate to induce an\ninhomogeneous but energetically more stable interlayer sliding in multilayer\ngraphene. Our simulations demonstrate that inhomogeneous interlayer sliding\nproduces a sizable Berry curvature dipole, which can be further tuned by\nvarying the interlayer sliding distances and potential differences. The\nresulting Berry curvature dipole magnitude is remarkably up to 100 times\ngreater than the maximum displacement involved in the inhomogeneous sliding.\nOur results highlight inhomogeneous interlayer sliding as a viable and\neffective method to induce a significant Berry curvature dipole in graphene\nsystems and propose the experimentally feasible way to realize it.\n",
  "subjects": [
    "Condensed Matter/Mesoscale and Nanoscale Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "YREMgXAi3dBbYwemnRc_fRO16i3WxorByYsRixKYVwU",
  "pdfSize": "4014414"
}