{
  "id": "2412.13376",
  "title": "Targeted View-Invariant Adversarial Perturbations for 3D Object\n  Recognition",
  "authors": "Christian Green and Mehmet Ergezer and Abdurrahman Zeybey",
  "authorsParsed": [
    [
      "Green",
      "Christian",
      ""
    ],
    [
      "Ergezer",
      "Mehmet",
      ""
    ],
    [
      "Zeybey",
      "Abdurrahman",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 23:23:25 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734477805000,
  "abstract": "  Adversarial attacks pose significant challenges in 3D object recognition,\nespecially in scenarios involving multi-view analysis where objects can be\nobserved from varying angles. This paper introduces View-Invariant Adversarial\nPerturbations (VIAP), a novel method for crafting robust adversarial examples\nthat remain effective across multiple viewpoints. Unlike traditional methods,\nVIAP enables targeted attacks capable of manipulating recognition systems to\nclassify objects as specific, pre-determined labels, all while using a single\nuniversal perturbation. Leveraging a dataset of 1,210 images across 121 diverse\nrendered 3D objects, we demonstrate the effectiveness of VIAP in both targeted\nand untargeted settings. Our untargeted perturbations successfully generate a\nsingular adversarial noise robust to 3D transformations, while targeted attacks\nachieve exceptional results, with top-1 accuracies exceeding 95% across various\nepsilon values. These findings highlight VIAPs potential for real-world\napplications, such as testing the robustness of 3D recognition systems. The\nproposed method sets a new benchmark for view-invariant adversarial robustness,\nadvancing the field of adversarial machine learning for 3D object recognition.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Cryptography and Security",
    "Electrical Engineering and Systems Science/Image and Video Processing"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "LKCoxJc8R4c3fW6ctR6q8phDyiHA-7BHcCPm7GkF2C0",
  "pdfSize": "8447526"
}