{"id":"2412.14495","title":"FedMUP: Federated Learning driven Malicious User Prediction Model for\n  Secure Data Distribution in Cloud Environments","authors":"Kishu Gupta, Deepika Saxena, Rishabh Gupta, Jatinder Kumar, Ashutosh\n  Kumar Singh","authorsParsed":[["Gupta","Kishu",""],["Saxena","Deepika",""],["Gupta","Rishabh",""],["Kumar","Jatinder",""],["Singh","Ashutosh Kumar",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 03:39:47 GMT"}],"updateDate":"2024-12-20","timestamp":1734579587000,"abstract":"  Cloud computing is flourishing at a rapid pace. Significant consequences\nrelated to data security appear as a malicious user may get unauthorized access\nto sensitive data which may be misused, further. This raises an alarm-ringing\nsituation to tackle the crucial issue related to data security and proactive\nmalicious user prediction. This article proposes a Federated learning driven\nMalicious User Prediction Model for Secure Data Distribution in Cloud\nEnvironments (FedMUP). This approach firstly analyses user behavior to acquire\nmultiple security risk parameters. Afterward, it employs the federated\nlearning-driven malicious user prediction approach to reveal doubtful users,\nproactively. FedMUP trains the local model on their local dataset and transfers\ncomputed values rather than actual raw data to obtain an updated global model\nbased on averaging various local versions. This updated model is shared\nrepeatedly at regular intervals with the user for retraining to acquire a\nbetter, and more efficient model capable of predicting malicious users more\nprecisely. Extensive experimental work and comparison of the proposed model\nwith state-of-the-art approaches demonstrate the efficiency of the proposed\nwork. Significant improvement is observed in the key performance indicators\nsuch as malicious user prediction accuracy, precision, recall, and f1-score up\nto 14.32%, 17.88%, 14.32%, and 18.35%, respectively.\n","subjects":["Computer Science/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"epf8wAL-ByykVFznn5aRTtVaQ3Tf2rv1avFr0uPdHXo","pdfSize":"1705175"}