{"id":"2412.18849","title":"SWAG: Long-term Surgical Workflow Prediction with Generative-based\n  Anticipation","authors":"Maxence Boels, Yang Liu, Prokar Dasgupta, Alejandro Granados and\n  Sebastien Ourselin","authorsParsed":[["Boels","Maxence",""],["Liu","Yang",""],["Dasgupta","Prokar",""],["Granados","Alejandro",""],["Ourselin","Sebastien",""]],"versions":[{"version":"v1","created":"Wed, 25 Dec 2024 09:29:57 GMT"},{"version":"v2","created":"Thu, 6 Feb 2025 18:54:37 GMT"}],"updateDate":"2025-02-07","timestamp":1735118997000,"abstract":"  While existing approaches excel at recognising current surgical phases, they\nprovide limited foresight and intraoperative guidance into future procedural\nsteps. Similarly, current anticipation methods are constrained to predicting\nshort-term and singular events, neglecting the dense and sequential nature of\nsurgical workflows. To address these needs and limitations, we propose SWAG\n(Surgical Workflow Anticipative Generation), a framework to combine phase\nrecognition and anticipation, using a generative approach for surgical workflow\nguidance. This paper investigates two distinct decoding methods-single-pass\n(SP) and auto-regressive (AR)-to generate sequences of future surgical phases\nat minute intervals over long horizons of up to 60 minutes. We propose a novel\nembedding approach using prior knowledge to enhance the accuracy of phase\nanticipation. Additionally, our anticipative framework offers remaining time\nregression and proposes a regression-to-classification (R2C) method. SWAG's\nperformance was evaluated on the Cholec80 and AutoLaparo21 datasets. Our\nsingle-pass model with prior knowledge embeddings (SP*) achieves 49.8% mean\naccuracy over 18-minute anticipation on AutoLaparo21, while the simple SP with\nR2C extension reaches 56.6% mean accuracy over the same horizon on Cholec80.\nMoreover, our approach outperforms existing methods on the phase remaining time\nregression task, achieving weighted mean absolute errors of 0.32 and 0.48\nminutes for 2- and 3-minute horizons, respectively. SWAG demonstrates\nversatility across classification and regression tasks and creates a temporal\ncontinuity between surgical workflow recognition and anticipation. While\nfurther studies are required to understand the impact of generative-based\nanticipation intraoperatively, our method provides steps towards this\ndirection.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"a-Uw32B49I9akJ5tc79A7npvcE-Tgna7Ve0hPGkzLiI","pdfSize":"10802695"}