{"id":"2412.17713","title":"A note on partially massless supergravity","authors":"Nicolas Boulanger, Guillaume Lhost, Sylvain Thom\\'ee","authorsParsed":[["Boulanger","Nicolas",""],["Lhost","Guillaume",""],["Thomée","Sylvain",""]],"versions":[{"version":"v1","created":"Mon, 23 Dec 2024 16:45:30 GMT"},{"version":"v2","created":"Fri, 10 Jan 2025 10:13:47 GMT"}],"updateDate":"2025-01-13","timestamp":1734972330000,"abstract":"  We analyse the couplings of a partially massless spin-2 field with a doublet\nof massless, real spin-3/2 fields. In the flat limit, this spectrum coincides\nwith the spectrum of ${\\cal N}=2$ pure supergravity around anti-de Sitter\nspacetime AdS$_4$. We classify all the possible parity-invariant, non-Abelian\ndeformations of the free theory that lead to a deformation of the Lagrangian.\nBy doing this, we re-derive a non-Abelian vertex recently found in 2412.04982\n[hep-th] by Yu. M. Zinoviev following a different approach, and show that the\ncorresponding non-Abelian gauge algebra closely resembles the one of ${\\cal\nN}=2$ supergravity around AdS$_4$. The gauge-algebra deformation is however\nobstructed, at next order. Then, we add a massless vector field together with a\nmassive spin-3/2 field, and find two nontrivial vertices mixing these fields\nwith a single massless gravitino. Still, the gauge algebra remains obstructed\nat next order, therefore excluding the possibility to make local the global\nsupersymmetry algebra found in recent works on partially massless\nsupermultiplets in AdS$_4$. Finally, we argue that the two problems encountered\nare simultaneously solved by the addition of the masseless graviton, leading to\n${\\cal N}=1$ pure conformal supergravity around AdS$_4$ as the only consistent\ntheory coupling partially massless spin-2 fields to massless and massive\nspin-3/2 fields.\n","subjects":["Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"nl4zwtQTfqremqFMAoLbj3mSu4OeoNBX1BRa0bFKVzA","pdfSize":"417830"}