{
  "id": "2412.08395",
  "title": "Lyman Continuum Leakers at $z>3$ in the GOODS-S Field: Mergers Dominated",
  "authors": "Shuairu Zhu, Zhen-ya Zheng, Fang-Ting Yuan, Chunyan Jiang and Ruqiu\n  Lin",
  "authorsParsed": [
    [
      "Zhu",
      "Shuairu",
      ""
    ],
    [
      "Zheng",
      "Zhen-ya",
      ""
    ],
    [
      "Yuan",
      "Fang-Ting",
      ""
    ],
    [
      "Jiang",
      "Chunyan",
      ""
    ],
    [
      "Lin",
      "Ruqiu",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 14:15:01 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733926501000,
  "abstract": "  Understanding the ionizing photon escape from galaxies is essential for\nstudying Cosmic Reionization. With a sample of 23 Lyman Continuum (LyC) leakers\nat $3<z<4.5$ in the GOODS-S field, we investigate their morphologies using\nhigh-resolution data from the Hubble Space Telescope (HST) and the James Webb\nSpace Telescope (JWST). We find that 20 of the 23 LyC leakers show merging\nsignatures, while the remaining 3 are starbursts. Based on our previous finding\nthat LyC leakers are not necessarily starbursts while some are in the star\nformation main sequence, we further find that those in the main sequence show\nmerger signatures. Our results suggest that LyC leakers are either starbursts\nor mergers, both of which can facilitate the LyC photon escape, in addition to\ngenerating more LyC photons. Furthermore, we show that high-$z$ LyC leakers are\nstatistically more extended than those selected at low redshift, which exhibits\na higher merger fraction as size increases. This is likely due to the\nobservational bias that the spatial resolution limits the detection of high-$z$\ncompact galaxies, while low redshift LyC leakers are more selected as compact\nstarbursts.\n",
  "subjects": [
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "3bzOeMLU45GY4lmm1u4zp_NDtEC67YTmEOvgh6bcWBU",
  "pdfSize": "3681610"
}