{
  "id": "2412.05898",
  "title": "Strain-Induced Decoupling Drives Gold-Assisted Exfoliation of Large-Area\n  Monolayer 2D Crystals",
  "authors": "Jakob Ziewer, Abyay Ghosh, Michaela Hanu\\v{s}ov\\'a, Luka Pirker,\n  Otakar Frank, Mat\\v{e}j Velick\\'y, Myrta Gr\\\"uning, and Fumin Huang",
  "authorsParsed": [
    [
      "Ziewer",
      "Jakob",
      ""
    ],
    [
      "Ghosh",
      "Abyay",
      ""
    ],
    [
      "Hanušová",
      "Michaela",
      ""
    ],
    [
      "Pirker",
      "Luka",
      ""
    ],
    [
      "Frank",
      "Otakar",
      ""
    ],
    [
      "Velický",
      "Matěj",
      ""
    ],
    [
      "Grüning",
      "Myrta",
      ""
    ],
    [
      "Huang",
      "Fumin",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 8 Dec 2024 11:35:30 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733657730000,
  "abstract": "  Gold assisted exfoliation (GAE) is a groundbreaking mechanical exfoliation\ntechnique, producing centimeter scale single crystal monolayers of 2D\nmaterials. Such large, high quality films offer unparalleled advantages over\nthe micron sized flakes typically produced by conventional exfoliation\ntechniques, significantly accelerating the research and technological\nadvancements in the field of 2D materials. Despite its wide applications, the\nfundamental mechanism of GAE remains poorly understood. In this study, using\nMoS2 on Au as a model system, we employ ultralow frequency Raman spectroscopy\nto elucidate how the interlayer interactions within MoS2 crystals are impacted\nby the gold substrate. The results reveal that the coupling at the first\ninterface between the adhered layer on the gold substrate and the adjacent\nlayer, is substantially weakened, with the binding force being reduced to\nnearly zero. This renders the first interface the weakest point in the system,\nthereby the crystal preferentially cleaves at this junction, generating large\narea monolayers with sizes comparable to the parent crystal. Biaxial strain in\nthe adhered layer, induced by the gold substrate, is identified as the driving\nfactor for the decoupling effect. We establish the strain-induced decoupling\neffect as the primary mechanism of GAE, which could also play a significant\nrole in general mechanical exfoliations.\n",
  "subjects": [
    "Condensed Matter/Materials Science",
    "Condensed Matter/Mesoscale and Nanoscale Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Cu6tW429trhu29KjdmblfBEoG3STwjDuXCAuJ6mi5Ek",
  "pdfSize": "2392656"
}