{"id":"2412.12113","title":"Application of Analytical Hierarchical Process and its Variants on\n  Remote Sensing Datasets","authors":"Sarthak Arora, Michael Warner, Ariel Chamberlain, James C. Smoot,\n  Nikhil Raj Deep, Claire Gorman, Anthony Acciavatti","authorsParsed":[["Arora","Sarthak",""],["Warner","Michael",""],["Chamberlain","Ariel",""],["Smoot","James C.",""],["Deep","Nikhil Raj",""],["Gorman","Claire",""],["Acciavatti","Anthony",""]],"versions":[{"version":"v1","created":"Sun, 1 Dec 2024 11:24:03 GMT"},{"version":"v2","created":"Wed, 5 Feb 2025 14:25:23 GMT"}],"updateDate":"2025-02-06","timestamp":1733052243000,"abstract":"  The river Ganga is one of the Earth's most critically important river basins,\nyet it faces significant pollution challenges, making it crucial to evaluate\nits vulnerability for effective and targeted remediation efforts. While the\nAnalytic Hierarchy Process (AHP) is widely regarded as the standard in decision\nmaking methodologies, uncertainties arise from its dependence on expert\njudgments, which can introduce subjectivity, especially when applied to remote\nsensing data, where expert knowledge might not fully capture spatial and\nspectral complexities inherent in such data. To address that, in this paper, we\napplied AHP alongside a suite of alternative existing and novel variants of\nAHP-based decision analysis on remote sensing data to assess the vulnerability\nof the river Ganga to pollution. We then compared the areas where the outputs\nof each variant may provide additional insights over AHP. Lastly, we utilized\nour learnings to design a composite variable to robustly define the\nvulnerability of the river Ganga to pollution. This approach contributes to a\nmore comprehensive understanding of remote sensing data applications in\nenvironmental assessment, and these decision making variants can also have\nbroader applications in other areas of environment management and\nsustainability, facilitating more precise and adaptable decision support\nframeworks.\n","subjects":["Computer Science/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"z9uWz-53ef3nOLcCrJFLpd5iwPMv7zqVSimFbVf9BVk","pdfSize":"40389588"}