{
  "id": "2412.13543",
  "title": "Query-centric Audio-Visual Cognition Network for Moment Retrieval,\n  Segmentation and Step-Captioning",
  "authors": "Yunbin Tu, Liang Li, Li Su, Qingming Huang",
  "authorsParsed": [
    [
      "Tu",
      "Yunbin",
      ""
    ],
    [
      "Li",
      "Liang",
      ""
    ],
    [
      "Su",
      "Li",
      ""
    ],
    [
      "Huang",
      "Qingming",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 06:43:06 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734504186000,
  "abstract": "  Video has emerged as a favored multimedia format on the internet. To better\ngain video contents, a new topic HIREST is presented, including video\nretrieval, moment retrieval, moment segmentation, and step-captioning. The\npioneering work chooses the pre-trained CLIP-based model for video retrieval,\nand leverages it as a feature extractor for other three challenging tasks\nsolved in a multi-task learning paradigm. Nevertheless, this work struggles to\nlearn the comprehensive cognition of user-preferred content, due to\ndisregarding the hierarchies and association relations across modalities. In\nthis paper, guided by the shallow-to-deep principle, we propose a query-centric\naudio-visual cognition (QUAG) network to construct a reliable multi-modal\nrepresentation for moment retrieval, segmentation and step-captioning.\nSpecifically, we first design the modality-synergistic perception to obtain\nrich audio-visual content, by modeling global contrastive alignment and local\nfine-grained interaction between visual and audio modalities. Then, we devise\nthe query-centric cognition that uses the deep-level query to perform the\ntemporal-channel filtration on the shallow-level audio-visual representation.\nThis can cognize user-preferred content and thus attain a query-centric\naudio-visual representation for three tasks. Extensive experiments show QUAG\nachieves the SOTA results on HIREST. Further, we test QUAG on the query-based\nvideo summarization task and verify its good generalization.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Computation and Language"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "sHsNbIa1GzBTsht3ya2wYSp4hXNvTpS3lUdnSKRMk7Y",
  "pdfSize": "2106698"
}