{
  "id": "2412.06115",
  "title": "Protein Evolution as a Complex System",
  "authors": "Barnabas Gall, Sacha B. Pulsford, Dana Matthews, Matthew A. Spence,\n  Joe A. Kaczmarski, John Z. Chen, Mahakaran Sandhu, Eric Stone, James Nichols,\n  Colin J. Jackson",
  "authorsParsed": [
    [
      "Gall",
      "Barnabas",
      ""
    ],
    [
      "Pulsford",
      "Sacha B.",
      ""
    ],
    [
      "Matthews",
      "Dana",
      ""
    ],
    [
      "Spence",
      "Matthew A.",
      ""
    ],
    [
      "Kaczmarski",
      "Joe A.",
      ""
    ],
    [
      "Chen",
      "John Z.",
      ""
    ],
    [
      "Sandhu",
      "Mahakaran",
      ""
    ],
    [
      "Stone",
      "Eric",
      ""
    ],
    [
      "Nichols",
      "James",
      ""
    ],
    [
      "Jackson",
      "Colin J.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 00:27:44 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733704064000,
  "abstract": "  Protein evolution underpins life, and understanding its behavior as a system\nis of great importance. However, our current models of protein evolution are\narguably too simplistic to allow quantitative interpretation and prediction of\nevolutionary trajectories. Viewing protein evolution as a complex system has\nthe potential to advance our understanding and ability to model protein\nevolution. In this perspective, we discuss aspects of protein evolution that\nare typical of complex systems, from nonlinear dynamics, sensitivity to initial\nconditions, self-organization, and the emergence of order from chaos and\ndisorder. We discuss how the growth in sequence and structural data, insights\nfrom laboratory evolution and new machine learning tools can advance the study\nof protein evolution and that by treating protein evolution as a complex\nadaptive system, we may gain new insights into the fundamental principles\ndriving biological innovation and adaptation and apply this to protein\nengineering and design.\n",
  "subjects": [
    "Quantitative Biology/Biomolecules"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "tmAFS2-LnF5VRgqYN4VwKkpq76cFxwTxH6l6mnIW12s",
  "pdfSize": "4341999"
}