{
  "id": "2412.14235",
  "title": "Fermion-Portal Dark Matter at a High-Energy Muon Collider",
  "authors": "Pouya Asadi, Samuel Homiller, Aria Radick, Tien-Tien Yu",
  "authorsParsed": [
    [
      "Asadi",
      "Pouya",
      ""
    ],
    [
      "Homiller",
      "Samuel",
      ""
    ],
    [
      "Radick",
      "Aria",
      ""
    ],
    [
      "Yu",
      "Tien-Tien",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 19:00:00 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734548400000,
  "abstract": "  In this work, we provide a comprehensive study of fermion-portal dark matter\nmodels in the freeze-in regime at a future muon collider. For different\npossible non-singlet fermion portals, we calculate the upper bound on the\nmediator's mass arising from the relic abundance calculation and discuss the\nreach of a future muon collider in probing their viable parameter space in\nprompt and long-lived particle search strategies. In particular, we develop\nrudimentary search strategies in the prompt region and show that cuts on the\ninvariant dilepton or dijet masses, the missing transverse mass $M_{T2}$,\npseudorapidity and energy of leptons or jets, and the opening angle between the\nlepton or the jet pair can be employed to subtract the Standard Model\nbackground. In the long-lived particle regime, we discuss the signals of each\nmodel and calculate their event counts. In this region, the\nlepton-(quark-)portal model signal consists of charged tracks ($R$-hadrons)\nthat either decay in the detector to give rise to a displaced lepton (jet)\nsignature, or are detector stable and give rise to heavy stable charged track\nsignals. As a byproduct, a pipeline is developed for including the non-trivial\nparton distribution function of a muon component inside a muon beam; it is\nshown that this leads to non-trivial effects on the kinematic distributions and\nattainable significances. We also highlight phenomenological features of all\nmodels unique to a muon collider and hope our results, for this motivated and\nbroad class of dark matter models, inform the design of a future muon collider\ndetector. We also speculate on suggestions for improving the sensitivity of a\nmuon collider detector to long-lived particle signals in fermion-portal models.\n",
  "subjects": [
    "Physics/High Energy Physics - Phenomenology",
    "Physics/High Energy Physics - Experiment"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "1wsgSK6t0SOXa09oVGBATyNSR9wx1931uzEvFzooPkc",
  "pdfSize": "3515726"
}