{"id":"2412.14828","title":"Quantum circuit synthesis with SQiSW","authors":"Jialiang Tang, Jialin Zhang, Xiaoming Sun","authorsParsed":[["Tang","Jialiang",""],["Zhang","Jialin",""],["Sun","Xiaoming",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 13:17:43 GMT"},{"version":"v2","created":"Tue, 24 Dec 2024 14:38:07 GMT"}],"updateDate":"2024-12-25","timestamp":1734614263000,"abstract":"  The main task of quantum circuit synthesis is to efficiently and accurately\nimplement specific quantum algorithms or operations using a set of quantum\ngates, and optimize the circuit size. It plays a crucial role in Noisy\nIntermediate-Scale Quantum computation. Most prior synthesis efforts have\nemployed CNOT or CZ gates as the 2-qubit gates. However, the SQiSW gate, also\nknown as the square root of iSWAP gate, has garnered considerable attention due\nto its outstanding experimental performance with low error rates and high\nefficiency in 2-qubit gate synthesis. In this paper, we investigate the\npotential of the SQiSW gate in various synthesis problems by utilizing only the\nSQiSW gate along with arbitrary single-qubit gates, while optimizing the\noverall circuit size. For exact synthesis, the upper bound of SQiSW gates to\nsynthesize arbitrary 3-qubit and $n$-qubit gates are 24 and\n$\\frac{139}{192}4^n(1+o(1))$ respectively, which relies on the properties of\nSQiSW gate in Lie theory and quantum shannon decomposition. We also introduce\nan exact synthesis scheme for Toffoli gate using only 8 SQiSW gates, which is\ngrounded in numerical observation. More generally, with respect to numerical\napproximations, we propose and provide a theoretical analysis of a pruning\nalgorithm to reduce the size of the searching space in numerical experiment to\n$\\frac{1}{12}+o(1)$ of previous size, helping us reach the result that 11 SQiSW\ngates are enough in arbitrary 3-qubit gates synthesis up to an acceptable\nnumerical error.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"DGDqjomSXZYDoQ7lC3oX0coczBVb0-TeyNrR98BsRjE","pdfSize":"502158"}