{
  "id": "2412.18215",
  "title": "Asymptotically Optimal Appointment Scheduling in the Presence of Patient\n  Unpunctuality",
  "authors": "Nikolai Lipscomb, Xin Liu, Vidyadhar G. Kulkarni",
  "authorsParsed": [
    [
      "Lipscomb",
      "Nikolai",
      ""
    ],
    [
      "Liu",
      "Xin",
      ""
    ],
    [
      "Kulkarni",
      "Vidyadhar G.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 24 Dec 2024 06:44:03 GMT"
    },
    {
      "version": "v2",
      "created": "Thu, 26 Dec 2024 19:53:53 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735022643000,
  "abstract": "  We consider the optimal appointment scheduling problem that incorporates\npatients' unpunctual behavior, where the unpunctuality is assumed to be time\ndependent, but additive. Our goal is to develop an optimal scheduling method\nfor a large patient system to maximize expected net revenue. Methods for\nderiving optimal appointment schedules for large-scale systems often run into\ncomputational bottlenecks due to mixed-integer programming or robust\noptimization formulations and computationally complex search methods. In this\nwork, we model the system as a single-server queueing system, where patients\narrive unpunctually and follow the FIFO service discipline to see the doctor\n(i.e., get into service). Using the heavy traffic fluid approximation, we\ndevelop a deterministic control problem, referred to as the fluid control\nproblem (FCP), which serves as an asymptotic upper bound for the original\nqueueing control problem (QCP). Using the optimal solution of the FCP, we\nestablish an asymptotically optimal scheduling policy on a fluid scale. We\nfurther investigate the convergence rate of the QCP under the proposed policy.\nThe FCP, due to the incorporation of unpunctuality, is difficult to solve\nanalytically. We thus propose a time-discretized numerical scheme to\napproximately solve the FCP. The discretized FCP takes the form of a quadratic\nprogram with linear constraints. We examine the behavior of these schedules\nunder different unpunctuality assumptions and test the performance of the\nschedules on real data in a simulation study. Interestingly, the optimal\nschedules can involve block booking of patients, even if the unpunctuality\ndistributions are continuous.\n",
  "subjects": [
    "Mathematics/Optimization and Control",
    "Mathematics/Probability"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "g6DEIMuBddRDKc2RLjm6-KZ6-MdcGyie59fD-USMlEI",
  "pdfSize": "658653"
}