{"id":"2412.07675","title":"RAZOR: Sharpening Knowledge by Cutting Bias with Unsupervised Text\n  Rewriting","authors":"Shuo Yang, Bardh Prenkaj, Gjergji Kasneci","authorsParsed":[["Yang","Shuo",""],["Prenkaj","Bardh",""],["Kasneci","Gjergji",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 17:02:58 GMT"},{"version":"v2","created":"Wed, 18 Dec 2024 17:54:30 GMT"},{"version":"v3","created":"Thu, 19 Dec 2024 10:11:42 GMT"}],"updateDate":"2024-12-20","timestamp":1733850178000,"abstract":"  Despite the widespread use of LLMs due to their superior performance in\nvarious tasks, their high computational costs often lead potential users to opt\nfor the pretraining-finetuning pipeline. However, biases prevalent in manually\nconstructed datasets can introduce spurious correlations between tokens and\nlabels, creating so-called shortcuts and hindering the generalizability of\nfine-tuned models. Existing debiasing methods often rely on prior knowledge of\nspecific dataset biases, which is challenging to acquire a priori. We propose\nRAZOR (Rewriting And Zero-bias Optimization Refinement), a novel, unsupervised,\nand data-focused debiasing approach based on text rewriting for shortcut\nmitigation. RAZOR leverages LLMs to iteratively rewrite potentially biased text\nsegments by replacing them with heuristically selected alternatives in a\nshortcut space defined by token statistics and positional information. This\nprocess aims to align surface-level text features more closely with diverse\nlabel distributions, thereby promoting the learning of genuine linguistic\npatterns. Compared with unsupervised SoTA models, RAZOR improves by 3.5% on the\nFEVER and 6.5% on MNLI and SNLI datasets according to the F1 score.\nAdditionally, RAZOR effectively mitigates specific known biases, reducing\nbias-related terms by x2 without requiring prior bias information, a result\nthat is on par with SoTA models that leverage prior information. Our work\nprioritizes data manipulation over architectural modifications, emphasizing the\npivotal role of data quality in enhancing model performance and fairness. This\nresearch contributes to developing more robust evaluation benchmarks for\ndebiasing methods by incorporating metrics for bias reduction and overall model\nefficacy.\n","subjects":["Computer Science/Computation and Language","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"gTX7yZSOFia3OUERxSXvNp0NmhTKFMtINVTYB4ZTlb0","pdfSize":"1224996"}