{
  "id": "2412.02224",
  "title": "3D Modular Microrobots: Micro-Origami Cubes with Integrated Si Chips\n  Dive, Communicate, Flash Programs, and Form Collectives",
  "authors": "Yeji Lee, Vineeth K. Bandari, John S. McCaskill, Pranathi Adluri,\n  Daniil Karnaushenko, Dmitriy D. Karnaushenko and Oliver G. Schmidt",
  "authorsParsed": [
    [
      "Lee",
      "Yeji",
      ""
    ],
    [
      "Bandari",
      "Vineeth K.",
      ""
    ],
    [
      "McCaskill",
      "John S.",
      ""
    ],
    [
      "Adluri",
      "Pranathi",
      ""
    ],
    [
      "Karnaushenko",
      "Daniil",
      ""
    ],
    [
      "Karnaushenko",
      "Dmitriy D.",
      ""
    ],
    [
      "Schmidt",
      "Oliver G.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 07:31:52 GMT"
    }
  ],
  "updateDate": "2024-12-04",
  "timestamp": 1733211112000,
  "abstract": "  Modular microrobotics can potentially address many information-intensive\nmicrotasks in medicine, manufacturing and the environment. However, surface\narea has limited the natural powering, communication, functional integration,\nand self-assembly of smart mass-fabricated modular robotic devices at small\nscales. We demonstrate the integrated self-folding and self-rolling of\nfunctionalized patterned interior and exterior membrane surfaces resulting in\nprogrammable, self-assembling, inter-communicating and self-locomoting\nmicromodules (smartlets ess-than 1 mm3) with interior chambers for on-board\nbuoyancy control. The microbotic divers, with 360 deg solar harvesting rolls,\nfunction with sufficient ambient power for communication and programmed\nlocomotion in water via electrolysis. The folding faces carry rigid\nmicrocomponents including silicon chiplets as microprocessors and micro-LEDs\nfor communication. This remodels modular microrobotics closer to the\nsurface-rich modular autonomy of biological cells and provides an economical\nplatform for microscopic applications.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Systems and Control",
    "Computer Science/Systems and Control"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "TlWS5aZd123WkgezXQu9u8aMi9D561PvBb8FvNow2RE",
  "pdfSize": "4318362"
}