{"id":"2412.10941","title":"APAR: Modeling Irregular Target Functions in Tabular Regression via\n  Arithmetic-Aware Pre-Training and Adaptive-Regularized Fine-Tuning","authors":"Hong-Wei Wu, Wei-Yao Wang, Kuang-Da Wang, Wen-Chih Peng","authorsParsed":[["Wu","Hong-Wei",""],["Wang","Wei-Yao",""],["Wang","Kuang-Da",""],["Peng","Wen-Chih",""]],"versions":[{"version":"v1","created":"Sat, 14 Dec 2024 19:33:21 GMT"}],"updateDate":"2024-12-17","timestamp":1734204801000,"abstract":"  Tabular data are fundamental in common machine learning applications, ranging\nfrom finance to genomics and healthcare. This paper focuses on tabular\nregression tasks, a field where deep learning (DL) methods are not consistently\nsuperior to machine learning (ML) models due to the challenges posed by\nirregular target functions inherent in tabular data, causing sensitive label\nchanges with minor variations from features. To address these issues, we\npropose a novel Arithmetic-Aware Pre-training and Adaptive-Regularized\nFine-tuning framework (APAR), which enables the model to fit irregular target\nfunction in tabular data while reducing the negative impact of overfitting. In\nthe pre-training phase, APAR introduces an arithmetic-aware pretext objective\nto capture intricate sample-wise relationships from the perspective of\ncontinuous labels. In the fine-tuning phase, a consistency-based adaptive\nregularization technique is proposed to self-learn appropriate data\naugmentation. Extensive experiments across 10 datasets demonstrated that APAR\noutperforms existing GBDT-, supervised NN-, and pretrain-finetune NN-based\nmethods in RMSE (+9.43% $\\sim$ 20.37%), and empirically validated the effects\nof pre-training tasks, including the study of arithmetic operations. Our code\nand data are publicly available at https://github.com/johnnyhwu/APAR.\n","subjects":["Computer Science/Machine Learning","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"p-7qK9xpsJsANnKV0dXAu3ws9hyFUu-1HGgl7ycSQLo","pdfSize":"506055"}