{"id":"2412.08280","title":"The supermassive black hole population from seeding via collisions in\n  Nuclear Star Clusters","authors":"M. Liempi, D.R.G. Schleicher, A. Benson, A. Escala, and M.C. Vergara","authorsParsed":[["Liempi","M.",""],["Schleicher","D. R. G.",""],["Benson","A.",""],["Escala","A.",""],["Vergara","M. C.",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 10:53:48 GMT"},{"version":"v2","created":"Fri, 27 Dec 2024 14:10:18 GMT"}],"updateDate":"2024-12-30","timestamp":1733914428000,"abstract":"  The coexistence of nuclear star clusters (NSCs) and supermassive black holes\n(SMBHs) in galaxies with stellar masses $\\sim 10^{10}~$M$_\\odot$, the scaling\nrelations between their properties and properties of the host galaxy (e.g.,\n$M_{NSC}^{stellar}-M_{galaxy}^{stellar}$, $M_{BH}-M_{galaxy}^{stellar}$), and\nthe fact that NSCs seem to take on the role of SMBHs in less massive galaxies\nand vice versa in the more massive ones, suggest that the origin of NSCs and\nSMBHs is related. In this study, we implement an 'in-situ' NSC formation\nscenario, where NSCs are formed in the center of galaxies due to star formation\nin the accumulated gas. We explore the impact of the free parameter $A_{res}$\nwhich regulates the amount of gas transferred to the NSC reservoir, playing a\ncrucial role in shaping the cluster's growth. Simultaneously, we include a BH\nseed formation recipe based on stellar collisions within NSCs in the\nSemi-Analytical Model (SAM) Galacticus to explore the resulting population of\nSMBHs. We determine the parameter space of the NSCs that form a BH seed and\nfind that in initially more compact NSCs the formation of these BH seeds is\nmore favorable, leading to the formation of light, medium and heavy BH seeds\nwhich finally reach masses up to $\\sim 10^9$~M$_\\odot$ and is comparable with\nthe observed SMBH mass function at masses above $10^8$~M$_\\odot$. Additionally,\nwe compare the resulting population of NSCs with a derived NSC mass function\nfrom the stellar mass function of galaxies from the GAMA survey at $z<0.06$\nfinding a well agreement in shape terms. We also find a considerable overlap in\nthe observed scaling relations between the NSC mass, and the host galaxy\nstellar mass and velocity dispersion which is independent of the value of\n$A_{res}$. However, the chi-square analysis suggests that the model requires\nfurther refinement to achieve better quantitative agreement.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"u71zKpI1ThbRLAsYE6XVZPGyG3SyL3k-EmyvekzX8Sk","pdfSize":"1915626"}