{"id":"2412.06007","title":"Hallucination-aware Optimization for Large Language Model-empowered\n  Communications","authors":"Yinqiu Liu, Guangyuan Liu, Ruichen Zhang, Dusit Niyato, Zehui Xiong,\n  Dong In Kim, Kaibin Huang, Hongyang Du","authorsParsed":[["Liu","Yinqiu",""],["Liu","Guangyuan",""],["Zhang","Ruichen",""],["Niyato","Dusit",""],["Xiong","Zehui",""],["Kim","Dong In",""],["Huang","Kaibin",""],["Du","Hongyang",""]],"versions":[{"version":"v1","created":"Sun, 8 Dec 2024 17:37:32 GMT"}],"updateDate":"2024-12-10","timestamp":1733679452000,"abstract":"  Large Language Models (LLMs) have significantly advanced communications\nfields, such as Telecom Q\\&A, mathematical modeling, and coding. However, LLMs\nencounter an inherent issue known as hallucination, i.e., generating\nfact-conflicting or irrelevant content. This problem critically undermines the\napplicability of LLMs in communication systems yet has not been systematically\nexplored. Hence, this paper provides a comprehensive review of LLM applications\nin communications, with a particular emphasis on hallucination mitigation.\nSpecifically, we analyze hallucination causes and summarize hallucination\nmitigation strategies from both model- and system-based perspectives.\nAfterward, we review representative LLM-empowered communication schemes,\ndetailing potential hallucination scenarios and comparing the mitigation\nstrategies they adopted. Finally, we present a case study of a Telecom-oriented\nLLM that utilizes a novel hybrid approach to enhance the hallucination-aware\nservice experience. On the model side, we publish a Telecom hallucination\ndataset and apply direct preference optimization to fine-tune LLMs, resulting\nin a 20.6\\% correct rate improvement. Moreover, we construct a mobile-edge\nmixture-of-experts architecture for optimal LLM expert activation. Our research\naims to propel the field of LLM-empowered communications forward by detecting\nand minimizing hallucination impacts.\n","subjects":["Computer Science/Networking and Internet Architecture"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"aNlRowne9kSJtRfdiTxHsP-4BCxgLeH11ImGNsmV3oc","pdfSize":"1437365"}