{"id":"2412.19577","title":"Gauging or extending bulk and boundary conformal field theories:\n  Application to bulk and domain wall problem in topological matter and their\n  descriptions by (mock) modular covariant","authors":"Yoshiki Fukusumi","authorsParsed":[["Fukusumi","Yoshiki",""]],"versions":[{"version":"v1","created":"Fri, 27 Dec 2024 10:46:30 GMT"}],"updateDate":"2024-12-30","timestamp":1735296390000,"abstract":"  We study gauging operations (or group extensions) in (smeared) boundary\nconformal field theories (BCFTs) and bulk conformal field theories and their\napplications to various phenomena in topologically ordered systems. We apply\nthe resultant theories to the correspondence between the renormalization group\n(RG) flow of CFTs and the classification of topological quantum field theories\nin the testable information of general classes of partition functions. One can\nobtain the bulk topological properties of $2+1$ dimensional topological ordered\nphase corresponding to the massive RG flow of $1+1$ dimensional systems, or\nsmeared BCFT. We present an obstruction of mass condensation for smeared BCFT\nanalogous to the Lieb-Shultz-Mattis theorem for noninvertible symmetry. Related\nto the bulk topological degeneracies in $2+1$ dimensions and quantum phases in\n$1+1$ dimensions we construct a new series of BCFT. We also investigate the\nimplications of the massless RG flow of $1+1$ dimensional CFT to $2+1$\ndimensional topological order which corresponds to the earlier proposal by L.\nKong and H. Zheng in [Nucl. Phys. B 966 (2021), 115384], arXiv:1912.01760\nclosely related to the integer-spin simple current by Schellekens and\nGato-Rivera. We study the properties of the product of two CFTs connected by\nthe two kinds of massless flows. The (mock) modular covariants appearing in the\nanalysis seem to contain new ones. By applying the folding trick to the coupled\nmodel, we provide a general method to solve the gapped and charged domain wall.\nOne can obtain the general phenomenology of the transportation of anyons\nthrough the domain wall. Our work gives a unified direction for the future\ntheoretical and numerical studies of the topological phase based on the\nestablished data of classifications of conformal field theories or modular\ninvariants.\n","subjects":["Physics/High Energy Physics - Theory","Condensed Matter/Strongly Correlated Electrons","Physics/Mathematical Physics","Mathematics/Category Theory","Mathematics/Mathematical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"o4hGh6tJvRU5ydO_QpWvY34Rk3X_7PpjnqBm1vou0Io","pdfSize":"937024"}