{
  "id": "2412.13087",
  "title": "Explorando el impacto de los gradientes qu\\'imicos en los procesos de\n  mezcla del interior estelar",
  "authors": "M.M. Ocampo, M.M. Miller Bertolami, L.G. Althaus and F.C Wachlin",
  "authorsParsed": [
    [
      "Ocampo",
      "M. M.",
      ""
    ],
    [
      "Bertolami",
      "M. M. Miller",
      ""
    ],
    [
      "Althaus",
      "L. G.",
      ""
    ],
    [
      "Wachlin",
      "F. C",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 16:58:07 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734454687000,
  "abstract": "  During the various steps of stellar evolution are formed convectives zones\nthat alter the chemical stratification in stars. Usually, in astrophysics is\nused the Mixing Length Theory (MLT) for modeling the convective movement and,\nin general, it is used with the Schwarzschild instability criterion, which\nneglects the impact of chemical composition gradients in the development of\nconvection. However, towards the end of central helium burning and during the\nthermal pulses in the Asymptotic Giant Branch (AGB) are produced stratification\nprocesses with inversions in the chemical gradient that would produce\ninstabilities beyond the ones predicted by the Schwarzschild criterion. These\ninstabilities would alter the chemical profile in the white dwarfs, with\nrespect to the one predicted by MLT, having observable consequences in the\npulsational modes of such objects. In the present work we will explore an\nextension of MLT in which we will consider the chemical instabilities as\ngenerators of convectives and non-convectives instabilities. This theory will\nbe applied in stellar evolution models in comparison with standard MLT and a\ndouble diffusive mixing theory, discussing the benefits and shortcomings of\neach one.\n",
  "subjects": [
    "Astrophysics/Solar and Stellar Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "uPsMhYefa24aZvvfWosvN_Ye2bl7jaLIN1P2AzTwtWw",
  "pdfSize": "388715"
}