{
  "id": "2412.10521",
  "title": "KenCoh: A Ranked-Based Canonical Coherence",
  "authors": "Mara Sherlin D. Talento, Sarbojit Roy, Hernando C. Ombao",
  "authorsParsed": [
    [
      "Talento",
      "Mara Sherlin D.",
      ""
    ],
    [
      "Roy",
      "Sarbojit",
      ""
    ],
    [
      "Ombao",
      "Hernando C.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 19:31:48 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734118308000,
  "abstract": "  In this paper, we consider the problem of characterizing a robust global\ndependence between two brain regions where each region may contain several\nvoxels or channels. This work is driven by experiments to investigate the\ndependence between two cortical regions and to identify differences in brain\nnetworks between brain states, e.g., alert and drowsy states. The most common\napproach to explore dependence between two groups of variables (or signals) is\nvia canonical correlation analysis (CCA). However, it is limited to only\ncapturing linear associations and is sensitive to outlier observations. These\nlimitations are crucial because brain network connectivity is likely to be more\ncomplex than linear and that brain signals may exhibit heavy-tailed properties.\nTo overcome these limitations, we develop a robust method, Kendall canonical\ncoherence (KenCoh), for learning monotonic connectivity structure among\nneuronal signals filtered at given frequency bands. Furthermore, we propose the\nKenCoh-based permutation test to investigate the differences in brain network\nconnectivity between two different states. Our simulation study demonstrates\nthat KenCoh is competitive to the traditional variance-covariance estimator and\noutperforms the later when the underlying distributions are heavy-tailed. We\napply our method to EEG recordings from a virtual-reality driving experiment.\nOur proposed method led to further insights on the differences of\nfrontal-parietal cross-dependence network when the subject is alert and when\nthe subject is drowsy and that left-parietal channel drives this dependence at\nthe beta-band.\n",
  "subjects": [
    "Statistics/Methodology"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "xr07GM2csWaPT425jEI5vKVJCVpt2k4XJD_8RV18KmA",
  "pdfSize": "2324424"
}