{
  "id": "2412.20693",
  "title": "Diffractive Magic Cube Network with Super-high Capacity Enabled by\n  Mechanical Reconfiguration",
  "authors": "Peijie Feng, Fubei Liu, Yuanfeng Liu, Mingzhe Chong, Zongkun Zhang,\n  Qian Zhao, Jingbo Sun, Ji Zhou, Yunhua Tan",
  "authorsParsed": [
    [
      "Feng",
      "Peijie",
      ""
    ],
    [
      "Liu",
      "Fubei",
      ""
    ],
    [
      "Liu",
      "Yuanfeng",
      ""
    ],
    [
      "Chong",
      "Mingzhe",
      ""
    ],
    [
      "Zhang",
      "Zongkun",
      ""
    ],
    [
      "Zhao",
      "Qian",
      ""
    ],
    [
      "Sun",
      "Jingbo",
      ""
    ],
    [
      "Zhou",
      "Ji",
      ""
    ],
    [
      "Tan",
      "Yunhua",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 30 Dec 2024 04:01:55 GMT"
    },
    {
      "version": "v2",
      "created": "Sat, 15 Feb 2025 04:39:02 GMT"
    }
  ],
  "updateDate": "2025-02-18",
  "timestamp": 1735531315000,
  "abstract": "  Multiplexing and dynamic reconfigurable metasurfaces have been extensively\nstudied to enhance system capacity in response to the challenges posed by the\nexponential growth of optical information. Among them, the mechanically\nreconfigurable strategy offers a cost-effective and low-complexity approach for\ncapacity enhancement. However, the channel numbers achieved in current studies\nare insufficient for practical applications because of inadequate mechanical\ntransformations and suboptimal optimization methods. In this article, a\ndiffractive magic cube network (DMCN) is proposed to advance the multiplexing\ncapacity of mechanically reconfigurable metasurfaces. We utilized the deep\ndiffractive neural network (D2NN) model to jointly optimize the subset of\nchannels generated by the combination of three mechanical operations,\npermutation, translation, and rotation. The 144-channel holograms, 108-channel\nsingle-focus/multi-focus, and 60-channel orbital angular momentum (OAM)\nbeam/comb generation were numerically achieved and experimentally validated\nusing a spatial light modulator (SLM) and a reflective mirror. Our strategy not\nonly provides a novel paradigm to improve metasurface capacity to super-high\nlevel with low crosstalk, but also paves the way for new advancements in\noptical storage, computing, communication, and photolithography.\n",
  "subjects": [
    "Physics/Optics",
    "Physics/Applied Physics",
    "Physics/Data Analysis, Statistics and Probability"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "aROfgnMNGV_koYujsUFnz8jnMx4gVMzCRf6dfJhjdis",
  "pdfSize": "1746360"
}