{
  "id": "2412.11713",
  "title": "Seeker: Towards Exception Safety Code Generation with Intermediate\n  Language Agents Framework",
  "authors": "Xuanming Zhang, Yuxuan Chen, Yiming Zheng, Zhexin Zhang, Yuan Yuan,\n  Minlie Huang",
  "authorsParsed": [
    [
      "Zhang",
      "Xuanming",
      ""
    ],
    [
      "Chen",
      "Yuxuan",
      ""
    ],
    [
      "Zheng",
      "Yiming",
      ""
    ],
    [
      "Zhang",
      "Zhexin",
      ""
    ],
    [
      "Yuan",
      "Yuan",
      ""
    ],
    [
      "Huang",
      "Minlie",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 12:35:29 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734352529000,
  "abstract": "  In real world software development, improper or missing exception handling\ncan severely impact the robustness and reliability of code. Exception handling\nmechanisms require developers to detect, capture, and manage exceptions\naccording to high standards, but many developers struggle with these tasks,\nleading to fragile code. This problem is particularly evident in open-source\nprojects and impacts the overall quality of the software ecosystem. To address\nthis challenge, we explore the use of large language models (LLMs) to improve\nexception handling in code. Through extensive analysis, we identify three key\nissues: Insensitive Detection of Fragile Code, Inaccurate Capture of Exception\nBlock, and Distorted Handling Solution. These problems are widespread across\nreal world repositories, suggesting that robust exception handling practices\nare often overlooked or mishandled. In response, we propose Seeker, a\nmulti-agent framework inspired by expert developer strategies for exception\nhandling. Seeker uses agents: Scanner, Detector, Predator, Ranker, and Handler\nto assist LLMs in detecting, capturing, and resolving exceptions more\neffectively. Our work is the first systematic study on leveraging LLMs to\nenhance exception handling practices in real development scenarios, providing\nvaluable insights for future improvements in code reliability.\n",
  "subjects": [
    "Computer Science/Computation and Language",
    "Computer Science/Software Engineering"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "jwm1_XGRJcygeUxpfS0mMggdxq0grpoE6cJYKQglNjM",
  "pdfSize": "3436447"
}