{
  "id": "2412.11085",
  "title": "GraphMoRE: Mitigating Topological Heterogeneity via Mixture of\n  Riemannian Experts",
  "authors": "Zihao Guo, Qingyun Sun, Haonan Yuan, Xingcheng Fu, Min Zhou, Yisen\n  Gao, Jianxin Li",
  "authorsParsed": [
    [
      "Guo",
      "Zihao",
      ""
    ],
    [
      "Sun",
      "Qingyun",
      ""
    ],
    [
      "Yuan",
      "Haonan",
      ""
    ],
    [
      "Fu",
      "Xingcheng",
      ""
    ],
    [
      "Zhou",
      "Min",
      ""
    ],
    [
      "Gao",
      "Yisen",
      ""
    ],
    [
      "Li",
      "Jianxin",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 15 Dec 2024 06:52:40 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734245560000,
  "abstract": "  Real-world graphs have inherently complex and diverse topological patterns,\nknown as topological heterogeneity. Most existing works learn graph\nrepresentation in a single constant curvature space that is insufficient to\nmatch the complex geometric shapes, resulting in low-quality embeddings with\nhigh distortion. This also constitutes a critical challenge for graph\nfoundation models, which are expected to uniformly handle a wide variety of\ndiverse graph data. Recent studies have indicated that product manifold gains\nthe possibility to address topological heterogeneity. However, the product\nmanifold is still homogeneous, which is inadequate and inflexible for\nrepresenting the mixed heterogeneous topology. In this paper, we propose a\nnovel Graph Mixture of Riemannian Experts (GraphMoRE) framework to effectively\ntackle topological heterogeneity by personalized fine-grained topology geometry\npattern preservation. Specifically, to minimize the embedding distortion, we\npropose a topology-aware gating mechanism to select the optimal embedding space\nfor each node. By fusing the outputs of diverse Riemannian experts with learned\ngating weights, we construct personalized mixed curvature spaces for nodes,\neffectively embedding the graph into a heterogeneous manifold with varying\ncurvatures at different points. Furthermore, to fairly measure pairwise\ndistances between different embedding spaces, we present a concise and\neffective alignment strategy. Extensive experiments on real-world and synthetic\ndatasets demonstrate that our method achieves superior performance with lower\ndistortion, highlighting its potential for modeling complex graphs with\ntopological heterogeneity, and providing a novel architectural perspective for\ngraph foundation models.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "HU4uGKnx4IJIqjSSiuHYaRFAayhwq75BOHS4ltz9clw",
  "pdfSize": "772350"
}