{
  "id": "2412.09736",
  "title": "Tuning the structure and superconductivity of SrNi$_2$P$_2$ by Rh\n  substitution",
  "authors": "Juan Schmidt, Aashish Sapkota, Carsyn L. Mueller, Shuyang Xiao,\n  Shuyuan Huyan, Tyler J. Slade, Seok-Wook Lee, Sergey L. Bud'ko, Paul C.\n  Canfield",
  "authorsParsed": [
    [
      "Schmidt",
      "Juan",
      ""
    ],
    [
      "Sapkota",
      "Aashish",
      ""
    ],
    [
      "Mueller",
      "Carsyn L.",
      ""
    ],
    [
      "Xiao",
      "Shuyang",
      ""
    ],
    [
      "Huyan",
      "Shuyuan",
      ""
    ],
    [
      "Slade",
      "Tyler J.",
      ""
    ],
    [
      "Lee",
      "Seok-Wook",
      ""
    ],
    [
      "Bud'ko",
      "Sergey L.",
      ""
    ],
    [
      "Canfield",
      "Paul C.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 21:57:24 GMT"
    },
    {
      "version": "v2",
      "created": "Thu, 23 Jan 2025 15:05:36 GMT"
    }
  ],
  "updateDate": "2025-01-24",
  "timestamp": 1734040644000,
  "abstract": "  SrNi$_2$P$_2$ is unique among the ThCr$_2$Si$_2$ class since it exhibits a\ntemperature induced transition upon cooling from an uncollapsed tetragonal\n(ucT) state to a one-third-collapsed orthorhombic (tcO) state where one out of\nevery three P-rows bond across the Sr layers. This compound is also known for\nexhibiting bulk superconductivity below 1.4 K at ambient pressure. In this\nwork, we report on the effects of Rh substitution in\nSr(Ni$_{1-x}$Rh$_x$)$_2$P$_2$ on the structural and superconducting properties.\nWe studied the variation of the nearest P-P distances as a function of the Rh\nfraction at room temperature, as well as its temperature dependence for\nselected compositions. We find that increasing the Rh fraction leads to a\ndecrease in the transition temperature between the ucT and tcO states, until a\nfull suppression of the tcO state for $x\\geq 0.166$. The superconducting\ntransition first remains nearly insensitive to the Rh fraction, and then it\nincreases to 2.3 K after the tcO state is fully suppressed. These results are\nsummarized in a phase diagram, built upon the characterization by energy\ndispersive x-ray spectroscopy, x-ray diffraction, resistance, magnetization and\nspecific heat measurements done on crystalline samples with varying Rh content.\nThe relationship between band structure, crystal structure and\nsuperconductivity is discussed based on previously reported band structure\ncalculations on SrRh$_2$P$_2$. Moreover, the effect of Rh fraction on the\nstress-induced structural transitions is also addressed by means of\nstrain-stress studies done by uniaxial compression of single-crystalline\nmicropillars of Sr(Ni$_{1-x}$Rh$_x$)$_2$P$_2$.\n",
  "subjects": [
    "Condensed Matter/Superconductivity"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "6vUChsy9Vzw4t8qUjj1qA1579AeYQ61EyNV-3kVHGkc",
  "pdfSize": "3941728"
}