{
  "id": "2412.00639",
  "title": "Needle: A Generative-AI Powered Monte Carlo Method for Answering Complex\n  Natural Language Queries on Multi-modal Data",
  "authors": "Mahdi Erfanian, Mohsen Dehghankar, Abolfazl Asudeh",
  "authorsParsed": [
    [
      "Erfanian",
      "Mahdi",
      ""
    ],
    [
      "Dehghankar",
      "Mohsen",
      ""
    ],
    [
      "Asudeh",
      "Abolfazl",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 1 Dec 2024 01:36:41 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733017001000,
  "abstract": "  Multi-modal data, such as image data sets, often miss the detailed\ndescriptions that properly capture the rich information encoded in them. This\nmakes answering complex natural language queries a major challenge in these\ndomains. In particular, unlike the traditional nearest-neighbor search, where\nthe tuples and the query are modeled as points in a data cube, the query and\nthe tuples are of different natures, making the traditional query answering\nsolutions not directly applicable for such settings. Existing literature\naddresses this challenge for image data through vector representations jointly\ntrained on natural language and images. This technique, however, underperforms\nfor complex queries due to various reasons.\n  This paper takes a step towards addressing this challenge by introducing a\nGenerative-AI (GenAI) powered Monte Carlo method that utilizes foundation\nmodels to generate synthetic samples that capture the complexity of the natural\nlanguage query and transform it to the same space of the multi-modal data.\nFollowing this method, we develop a system for image data retrieval and propose\npractical solutions that enable leveraging future advancements in GenAI and\nvector representations for improving our system's performance. Our\ncomprehensive experiments on various benchmark datasets verify that our system\nsignificantly outperforms state-of-the-art techniques.\n",
  "subjects": [
    "Computer Science/Information Retrieval",
    "Computer Science/Databases"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "alguCJu3CTUzib2uxHma6mi_xi6tysa9K8gML8iBiZc",
  "pdfSize": "10352549"
}