{
  "id": "2412.17176",
  "title": "WPMixer: Efficient Multi-Resolution Mixing for Long-Term Time Series\n  Forecasting",
  "authors": "Md Mahmuddun Nabi Murad, Mehmet Aktukmak, Yasin Yilmaz",
  "authorsParsed": [
    [
      "Murad",
      "Md Mahmuddun Nabi",
      ""
    ],
    [
      "Aktukmak",
      "Mehmet",
      ""
    ],
    [
      "Yilmaz",
      "Yasin",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 22 Dec 2024 22:08:16 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734905296000,
  "abstract": "  Time series forecasting is crucial for various applications, such as weather\nforecasting, power load forecasting, and financial analysis. In recent studies,\nMLP-mixer models for time series forecasting have been shown as a promising\nalternative to transformer-based models. However, the performance of these\nmodels is still yet to reach its potential. In this paper, we propose Wavelet\nPatch Mixer (WPMixer), a novel MLP-based model, for long-term time series\nforecasting, which leverages the benefits of patching, multi-resolution wavelet\ndecomposition, and mixing. Our model is based on three key components: (i)\nmulti-resolution wavelet decomposition, (ii) patching and embedding, and (iii)\nMLP mixing. Multi-resolution wavelet decomposition efficiently extracts\ninformation in both the frequency and time domains. Patching allows the model\nto capture an extended history with a look-back window and enhances capturing\nlocal information while MLP mixing incorporates global information. Our model\nsignificantly outperforms state-of-the-art MLP-based and transformer-based\nmodels for long-term time series forecasting in a computationally efficient\nway, demonstrating its efficacy and potential for practical applications.\n",
  "subjects": [
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "VRTQ_49WhF4esjRY7iIbQ7Y5bT5oqBEPG8TPCjK2t7w",
  "pdfSize": "673318"
}