{"id":"2412.18367","title":"Towards Global AI Inclusivity: A Large-Scale Multilingual Terminology\n  Dataset (GIST)","authors":"Jiarui Liu, Iman Ouzzani, Wenkai Li, Lechen Zhang, Tianyue Ou, Houda\n  Bouamor, Zhijing Jin, Mona Diab","authorsParsed":[["Liu","Jiarui",""],["Ouzzani","Iman",""],["Li","Wenkai",""],["Zhang","Lechen",""],["Ou","Tianyue",""],["Bouamor","Houda",""],["Jin","Zhijing",""],["Diab","Mona",""]],"versions":[{"version":"v1","created":"Tue, 24 Dec 2024 11:50:18 GMT"},{"version":"v2","created":"Wed, 25 Dec 2024 06:20:11 GMT"},{"version":"v3","created":"Wed, 8 Jan 2025 15:30:11 GMT"},{"version":"v4","created":"Sun, 12 Jan 2025 04:01:45 GMT"},{"version":"v5","created":"Mon, 17 Feb 2025 18:13:38 GMT"}],"updateDate":"2025-02-18","timestamp":1735041018000,"abstract":"  The field of machine translation has achieved significant advancements, yet\ndomain-specific terminology translation, particularly in AI, remains\nchallenging. We introduce GIST, a large-scale multilingual AI terminology\ndataset containing 5K terms extracted from top AI conference papers spanning\n2000 to 2023. The terms are translated into Arabic, Chinese, French, Japanese,\nand Russian using a hybrid framework that combines LLMs for extraction with\nhuman expertise for translation. The dataset's quality is benchmarked against\nexisting resources, demonstrating superior translation accuracy through\ncrowdsourced evaluation. GIST is integrated into translation workflows using\npost-translation refinement methods that require no retraining, where LLM\nprompting consistently improves BLEU and COMET scores. A web demonstration on\nthe ACL Anthology platform highlights its practical application, showcasing\nimproved accessibility for non-English speakers. This work aims to address\ncritical gaps in AI terminology resources and fosters global inclusivity and\ncollaboration in AI research.\n","subjects":["Computer Science/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Lqn52x8rhAtandklkm6w7i8BB3SQNAp7G349MHDhtzc","pdfSize":"3057369"}