{
  "id": "2412.15563",
  "title": "In-context Continual Learning Assisted by an External Continual Learner",
  "authors": "Saleh Momeni, Sahisnu Mazumder, Zixuan Ke, Bing Liu",
  "authorsParsed": [
    [
      "Momeni",
      "Saleh",
      ""
    ],
    [
      "Mazumder",
      "Sahisnu",
      ""
    ],
    [
      "Ke",
      "Zixuan",
      ""
    ],
    [
      "Liu",
      "Bing",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 04:44:41 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734669881000,
  "abstract": "  Existing continual learning (CL) methods mainly rely on fine-tuning or\nadapting large language models (LLMs). They still suffer from catastrophic\nforgetting (CF). Little work has been done to exploit in-context learning (ICL)\nto leverage the extensive knowledge within LLMs for CL without updating any\nparameters. However, incrementally learning each new task in ICL necessitates\nadding training examples from each class of the task to the prompt, which\nhampers scalability as the prompt length increases. This issue not only leads\nto excessively long prompts that exceed the input token limit of the underlying\nLLM but also degrades the model's performance due to the overextended context.\nTo address this, we introduce InCA, a novel approach that integrates an\nexternal continual learner (ECL) with ICL to enable scalable CL without CF. The\nECL is built incrementally to pre-select a small subset of likely classes for\neach test instance. By restricting the ICL prompt to only these selected\nclasses, InCA prevents prompt lengths from becoming excessively long, while\nmaintaining high performance. Experimental results demonstrate that InCA\nsignificantly outperforms existing CL baselines, achieving substantial\nperformance gains.\n",
  "subjects": [
    "Computer Science/Computation and Language",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "oInACjwPacbT2KMVMFUV2IN4rt-gNfIqy3jA6fir3lo",
  "pdfSize": "798221"
}