{"id":"2412.16203","title":"Linear-Quadratic Stackelberg Mean Field Games and Teams with Arbitrary\n  Population Sizes","authors":"Wenyu Cong, Jingtao Shi, Bingchang Wang","authorsParsed":[["Cong","Wenyu",""],["Shi","Jingtao",""],["Wang","Bingchang",""]],"versions":[{"version":"v1","created":"Tue, 17 Dec 2024 06:50:29 GMT"}],"updateDate":"2024-12-24","timestamp":1734418229000,"abstract":"  This paper addresses a linear-quadratic Stackelberg mean field (MF) games and\nteams problem with arbitrary population sizes, where the game among the\nfollowers is further categorized into two types: non-cooperative and\ncooperative, and the number of followers can be finite or infinite. The leader\ncommences by providing its strategy, and subsequently, each follower optimizes\nits individual cost or social cost. A new de-aggregation method is applied to\nsolve the problem, which is instrumental in determining the optimal strategy of\nfollowers to the leader's strategy. Unlike previous studies that focus on MF\ngames and social optima, and yield decentralized asymptotically optimal\nstrategies relative to the centralized strategy set, the strategies presented\nhere are exact decentralized optimal strategies relative to the decentralized\nstrategy set. This distinction is crucial as it highlights a shift in the\napproach to MF systems, emphasizing the precision and direct applicability of\nthe strategies to the decentralized context. In the wake of the implementation\nof followers' strategies, the leader is confronted with an optimal control\nproblem driven by high-dimensional forward-backward stochastic differential\nequations (FBSDEs). By variational analysis, we obtain the decentralized\nstrategy for the leader. By applying the de-aggregation method and employing\ndimension expansion to decouple the high-dimensional FBSDEs, we are able to\nderive a set of decentralized Stackelberg-Nash or Stackelberg-team equilibrium\nsolution for all players.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"NsmSpN1khe6UlaAsMLNqklIaXo4TvPCYcMCtCX_wykA","pdfSize":"786383"}