{
  "id": "2412.09411",
  "title": "Resilience for Regular Path Queries: Towards a Complexity Classification",
  "authors": "Antoine Amarilli, Wolfgang Gatterbauer, Neha Makhija, Mika\\\"el Monet",
  "authorsParsed": [
    [
      "Amarilli",
      "Antoine",
      ""
    ],
    [
      "Gatterbauer",
      "Wolfgang",
      ""
    ],
    [
      "Makhija",
      "Neha",
      ""
    ],
    [
      "Monet",
      "Mikaël",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 16:17:24 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1734020244000,
  "abstract": "  The resilience problem for a query and an input set or bag database is to\ncompute the minimum number of facts to remove from the database to make the\nquery false. In this paper, we study how to compute the resilience of Regular\nPath Queries (RPQs) over graph databases. Our goal is to characterize the\nregular languages $L$ for which it is tractable to compute the resilience of\nthe existentially-quantified RPQ built from $L$.\n  We show that computing the resilience in this sense is tractable (even in\ncombined complexity) for all RPQs defined from so-called local languages. By\ncontrast, we show hardness in data complexity for RPQs defined from the\nfollowing language classes (after reducing the languages to eliminate redundant\nwords): all finite languages featuring a word containing a repeated letter, and\nall languages featuring a specific kind of counterexample to being local (which\nwe call four-legged languages). The latter include in particular all languages\nthat are not star-free. Our results also imply hardness for all non-local\nlanguages with a so-called neutral letter.\n  We also highlight some remaining obstacles towards a full dichotomy. In\nparticular, for the RPQ $abc|be$, resilience is tractable but the only PTIME\nalgorithm that we know uses submodular function optimization.\n",
  "subjects": [
    "Computer Science/Databases"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "7WKnH0TDP8reNtyhRk2CPgzfivmmx3tudUSv0H5buXA",
  "pdfSize": "1450840"
}