{"id":"2412.16166","title":"Unveiling the Role of Artificial Intelligence and Stock Market Growth in\n  Achieving Carbon Neutrality in the United States: An ARDL Model Analysis","authors":"Azizul Hakim Rafi, Abdullah Al Abrar Chowdhury, Adita Sultana, Abdulla\n  All Noman","authorsParsed":[["Rafi","Azizul Hakim",""],["Chowdhury","Abdullah Al Abrar",""],["Sultana","Adita",""],["Noman","Abdulla All",""]],"versions":[{"version":"v1","created":"Wed, 4 Dec 2024 17:07:04 GMT"}],"updateDate":"2024-12-24","timestamp":1733332024000,"abstract":"  Given the fact that climate change has become one of the most pressing\nproblems in many countries in recent years, specialized research on how to\nmitigate climate change has been adopted by many countries. Within this\ndiscussion, the influence of advanced technologies in achieving carbon\nneutrality has been discussed. While several studies investigated how AI and\nDigital innovations could be used to reduce the environmental footprint, the\nactual influence of AI in reducing CO2 emissions (a proxy measuring carbon\nfootprint) has yet to be investigated. This paper studies the role of advanced\ntechnologies in general, and Artificial Intelligence (AI) and ICT use in\nparticular, in advancing carbon neutrality in the United States, between 2021.\nSecondly, this paper examines how Stock Market Growth, ICT use, Gross Domestic\nProduct (GDP), and Population affect CO2 emissions using the STIRPAT model.\nAfter examining stationarity among the variables using a variety of unit root\ntests, this study concluded that there are no unit root problems across all the\nvariables, with a mixed order of integration. The ARDL bounds test for\ncointegration revealed that variables in this study have a long-run\nrelationship. Moreover, the estimates revealed from the ARDL model in the\nshort- and long-run indicated that economic growth, stock market\ncapitalization, and population significantly contributed to the carbon\nemissions in both the short-run and long-run. Conversely, AI and ICT use\nsignificantly reduced carbon emissions over both periods. Furthermore, findings\nwere confirmed to be robust using FMOLS, DOLS, and CCR estimations.\nFurthermore, diagnostic tests indicated the absence of serial correlation,\nheteroscedasticity, and specification errors and, thus, the model was robust.\n","subjects":["Economics/General Economics","Computer Science/Artificial Intelligence","Quantitative Finance/Economics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"khA6GlGUfuMmQji9wgB26TCXuPzGF1zr4eHyvXN09Us","pdfSize":"523807"}