{"id":"2412.12275","title":"A topological route to engineering robust and bright supersymmetric\n  laser arrays","authors":"Soujanya Datta, Mohammadmahdi Alizadeh, Ramy El-Ganainy, and Krishanu\n  Roychowdhury","authorsParsed":[["Datta","Soujanya",""],["Alizadeh","Mohammadmahdi",""],["El-Ganainy","Ramy",""],["Roychowdhury","Krishanu",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 19:00:15 GMT"}],"updateDate":"2024-12-18","timestamp":1734375615000,"abstract":"  In recent years, several proposals that leverage principles from condensed\nmatter and high-energy physics for engineering laser arrays have been put\nforward. The most important among these concepts are topology, which enables\nthe construction of robust zero-mode laser devices, and supersymmetry (SUSY),\nwhich holds the potential for achieving phase locking in laser arrays. In this\nwork, we show that the relation between supersymmetric coupled bosonic and\nfermionic oscillators on one side, and bipartite networks (and hence chiral\nsymmetry) on another side can be exploited together with non-Hermitian\nengineering for building one- and two-dimensional laser arrays with in-phase\nsynchronization. To demonstrate our strategy, we present a concrete design\nstarting from the celebrated Su-Schrieffer-Heeger (SSH) model to arrive at a\nSUSY laser structure that enjoys two key advantages over those reported in\nprevious works. Firstly, the design presented here features a near-uniform\ngeometry for both the laser array and supersymmetric reservoir (i.e. the widths\nand distances between the cavity arrays are almost the same). Secondly, the\nuniform field distribution in the presented structure leads to a far-field\nintensity that scales as N^2 where N is the number of lasing elements. Taken\ntogether, these two features can enable the implementation of higher-power\nlaser arrays that are easy to fabricate, and hence provide a roadmap for\npushing the frontier of SUSY laser arrays beyond the proof-of-concept phase.\n","subjects":["Physics/Optics","Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Other Condensed Matter"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"CjdQc-OosdDRLa6KIJEwZC3ZQfgSbevqsgG-rMzYmd8","pdfSize":"8143493"}