{
  "id": "2412.02804",
  "title": "Galaxy evolution in the post-merger regime. III -- The triggering of\n  active galactic nuclei peaks immediately after coalescence",
  "authors": "Sara L. Ellison, Leonardo Ferreira, Robert Bickley, Tess Grindlay,\n  Samir Salim, Shoshannah Byrne-Mamahit, Shobita Satyapal, David R. Patton,\n  Jillian M. Scudder",
  "authorsParsed": [
    [
      "Ellison",
      "Sara L.",
      ""
    ],
    [
      "Ferreira",
      "Leonardo",
      ""
    ],
    [
      "Bickley",
      "Robert",
      ""
    ],
    [
      "Grindlay",
      "Tess",
      ""
    ],
    [
      "Salim",
      "Samir",
      ""
    ],
    [
      "Byrne-Mamahit",
      "Shoshannah",
      ""
    ],
    [
      "Satyapal",
      "Shobita",
      ""
    ],
    [
      "Patton",
      "David R.",
      ""
    ],
    [
      "Scudder",
      "Jillian M.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 20:15:39 GMT"
    },
    {
      "version": "v2",
      "created": "Sun, 2 Feb 2025 22:22:42 GMT"
    }
  ],
  "updateDate": "2025-02-05",
  "timestamp": 1733256939000,
  "abstract": "  Galaxy mergers have been shown to trigger AGN in the nearby universe, but the\ntimescale over which this process happens remains unconstrained. The\nMulti-Model Merger Identifier (MUMMI) machine vision pipeline has been\ndemonstrated to provide reliable predictions of time post-merger (T_PM) for\ngalaxies selected from the Ultraviolet Near Infrared and Optical Northern\nSurvey (UNIONS) up to T_PM=1.76 Gyr after coalescence. By combining the\npost-mergers identified in UNIONS with pre-coalescence galaxy pairs, we can\nstudy the triggering of AGN throughout the merger sequence. AGN are identified\nusing a range of complementary metrics: mid-IR colours, narrow emission lines\nand broad emission lines, which can be combined to provide insight into the\ndemographics of dust and luminosity of the AGN population. Our main results\nare: 1) Regardless of the metric used, we find that the peak AGN excess\n(compared with a matched control sample) occurs immediately after coalescence,\nat 0 < T_PM < 0.16 Gyr. 2) The excess of AGN is observed until long after\ncoalescence; both the mid-IR selected AGN and broad line AGN are more common\nthan in the control sample even in the longest time bin of our sample (0.96 <\nT_PM < 1.76 Gyr). 3) The AGN excess is larger for more luminous and\nbolometrically dominant AGN, and we find that AGN in post-mergers are generally\nmore luminous than secularly triggered events. 4) A deficit of broad line AGN\nin the pre-merger phase, that evolves into an excess in post-mergers is\nconsistent with evolution of the covering fraction of nuclear obscuring\nmaterial. Before coalescence, tidally triggered inflows increase the covering\nfraction of nuclear dust; in the post-merger regime feedback from the AGN\nclears (at least some of) this material. 5) The statistical peak in the\ntriggering of starbursts occurs contemporaneously with AGN, within 0.16 Gyr of\ncoalescence.\n",
  "subjects": [
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "pWm8UUqNgsdpInenTf6KOfvJIO6srhWkfuE1wR66t1c",
  "pdfSize": "912828"
}