{"id":"2412.00903","title":"Tomographic SAR Reconstruction for Forest Height Estimation","authors":"Grace Colverd, Jumpei Takami, Laura Schade, Karol Bot, Joseph A.\n  Gallego-Mejia","authorsParsed":[["Colverd","Grace",""],["Takami","Jumpei",""],["Schade","Laura",""],["Bot","Karol",""],["Gallego-Mejia","Joseph A.",""]],"versions":[{"version":"v1","created":"Sun, 1 Dec 2024 17:37:25 GMT"},{"version":"v2","created":"Tue, 3 Dec 2024 16:32:27 GMT"}],"updateDate":"2024-12-04","timestamp":1733074645000,"abstract":"  Tree height estimation serves as an important proxy for biomass estimation in\necological and forestry applications. While traditional methods such as\nphotogrammetry and Light Detection and Ranging (LiDAR) offer accurate height\nmeasurements, their application on a global scale is often cost-prohibitive and\nlogistically challenging. In contrast, remote sensing techniques, particularly\n3D tomographic reconstruction from Synthetic Aperture Radar (SAR) imagery,\nprovide a scalable solution for global height estimation. SAR images have been\nused in earth observation contexts due to their ability to work in all\nweathers, unobscured by clouds. In this study, we use deep learning to estimate\nforest canopy height directly from 2D Single Look Complex (SLC) images, a\nderivative of SAR. Our method attempts to bypass traditional tomographic signal\nprocessing, potentially reducing latency from SAR capture to end product. We\nalso quantify the impact of varying numbers of SLC images on height estimation\naccuracy, aiming to inform future satellite operations and optimize data\ncollection strategies. Compared to full tomographic processing combined with\ndeep learning, our minimal method (partial processing + deep learning) falls\nshort, with an error 16-21\\% higher, highlighting the continuing relevance of\ngeometric signal processing.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"qx0V8zGe_Mr2fco--XIV6LRRb2NtydMqfNt7TLNy3Rw","pdfSize":"1267977"}