{
  "id": "2412.16246",
  "title": "Web Privacy based on Contextual Integrity: Measuring the Collapse of\n  Online Contexts",
  "authors": "Ido Sivan-Sevilla and Parthav Poudel",
  "authorsParsed": [
    [
      "Sivan-Sevilla",
      "Ido",
      ""
    ],
    [
      "Poudel",
      "Parthav",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 23:30:29 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734651029000,
  "abstract": "  The collapse of social contexts has been amplified by digital infrastructures\nbut surprisingly received insufficient attention from Web privacy scholars.\nUsers are persistently identified within and across distinct web contexts, in\nvarying degrees, through and by different websites and trackers, losing the\nability to maintain a fragmented identity. To systematically evaluate this\nstructural privacy harm we operationalize the theory of Privacy as Contextual\nIntegrity and measure persistent user identification within and between\ndistinct Web contexts. We crawl the top-700 popular websites across the\ncontexts of health, finance, news & media, LGBTQ, eCommerce, adult, and\neducation websites, for 27 days, to learn how persistent browser identification\nvia third-party cookies and JavaScript fingerprinting is diffused within and\nbetween web contexts. Past work measured Web tracking in bulk, highlighting the\nvolume of trackers and tracking techniques. These measurements miss a crucial\nprivacy implication of Web tracking - the collapse of online contexts. Our\nfindings reveal how persistent browser identification varies between and within\ncontexts, diffusing user IDs to different distances, contrasting known tracking\ndistributions across websites, and conducted as a joint or separate effort via\ncookie IDs and JS fingerprinting. Our network analysis can inform the\nconstruction of browser storage containers to protect users against real-time\ncontext collapse. This is a first modest step in measuring Web privacy as\ncontextual integrity, opening new avenues for contextual Web privacy research.\n",
  "subjects": [
    "Computer Science/Cryptography and Security",
    "Computer Science/Computers and Society",
    "Computer Science/Human-Computer Interaction"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "BvVlt5oklLcqcw4MTdxZMlreRDmZXyUt10iAom1EUUs",
  "pdfSize": "21874581"
}