{"id":"2412.20516","title":"Electro-Optic Modulator source as sample-free calibrator and frequency\n  stabilizer for Brillouin Microscopy","authors":"Claudia Testi, Emanuele Pontecorvo, Chiara Bartoli, Chiara Marzaro,\n  Fabrizio Gala, Li Zhang, Giulia Zanini and Giancarlo Ruocco","authorsParsed":[["Testi","Claudia",""],["Pontecorvo","Emanuele",""],["Bartoli","Chiara",""],["Marzaro","Chiara",""],["Gala","Fabrizio",""],["Zhang","Li",""],["Zanini","Giulia",""],["Ruocco","Giancarlo",""]],"versions":[{"version":"v1","created":"Sun, 29 Dec 2024 16:32:43 GMT"},{"version":"v2","created":"Fri, 17 Jan 2025 13:27:21 GMT"}],"updateDate":"2025-01-20","timestamp":1735489963000,"abstract":"  Brillouin Microscopy is a novel label-free optical technique that enables the\nmeasurement of a material's mechanical properties at the sub-micron scale in a\nnon-invasive and non-contact way; in the last few years, its applications in\nthe life sciences have extensively expanded. To date, many custom-built\nBrillouin Microscopes suffer from temporal instabilities that impact their\nperformances, showing drifts in the acquired spectra during time that may lead\nto inconsistencies between data acquired at different days. A further challenge\nfor standard Brillouin Microscopes is the calibration of the spectrometer: the\ncurrently accepted protocol in literature uses known Brillouin shifts of water\nand methanol to reconstruct the dispersion curve, but this approach is highly\ninfluenced by external factors that are unrelated to spectrometer's\nperformances. Manual and frequent realignments of the spectrometer and repeated\ncalibrations with standard materials are thus needed to address these issues.\nHere, we show an innovative method to remove temporal instabilities of a\nstandard Brillouin Microscope by inserting an Electro-Optic Modulator (EOM)\nthat can be used: i) as a reference signal during measurements; ii) as a\ncalibrator, allowing the reconstruction of the spectrometer dispersion curve\nwith high precision, in an automatic pipeline and without the need for\nreference samples; iii) as a tool to detect and compensate for temporal drifts\nthrough a feedback control in a closed loop. We here show that our Brillouin\nMicroscope, equipped with an EOM and a tuneable laser, is able to automatically\nacquire data for more than 2 days without the need to realign the spectrometer;\nretrieved Brillouin shifts and widths showed superior stability in time than\nstandard Brillouin Microscopes.\n","subjects":["Physics/Biological Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"ogKGZc70-p2LpD4U5d1dkNkOIEae9kImKkjKkQ0ENcs","pdfSize":"1034796"}