{"id":"2412.03935","title":"Floquet-Bloch Valleytronics","authors":"Sotirios Fragkos, Baptiste Fabre, Olena Tkach, St\\'ephane Petit,\n  Dominique Descamps, Gerd Sch\\\"onhense, Yann Mairesse, Michael Sch\\\"uler, and\n  Samuel Beaulieu","authorsParsed":[["Fragkos","Sotirios",""],["Fabre","Baptiste",""],["Tkach","Olena",""],["Petit","Stéphane",""],["Descamps","Dominique",""],["Schönhense","Gerd",""],["Mairesse","Yann",""],["Schüler","Michael",""],["Beaulieu","Samuel",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 07:33:26 GMT"}],"updateDate":"2024-12-06","timestamp":1733384006000,"abstract":"  Driving quantum materials out-of-equilibrium makes it possible to generate\nstates of matter inaccessible through standard equilibrium tuning methods. Upon\ntime-periodic coherent driving of electrons using electromagnetic fields, the\nemergence of Floquet-Bloch states enables the creation and control of exotic\nquantum phases. In transition metal dichalcogenides, broken inversion symmetry\nwithin each monolayer results in a non-zero Berry curvature at the K and\nK$^{\\prime}$ valley extrema, giving rise to chiroptical selection rules that\nare fundamental to valleytronics. Here, we bridge the gap between these two\nconcepts and introduce Floquet-Bloch valleytronics. Using time- and\npolarization-resolved extreme ultraviolet momentum microscopy combined with\nstate-of-the-art ab initio theory, we demonstrate the formation of\nvalley-polarized Floquet-Bloch states in 2H-WSe$_2$ upon below-bandgap coherent\nelectron driving with chiral light pulses. We investigate quantum path\ninterference between Floquet-Bloch and Volkov states, showing that this\ninterferometric process depends on the valley pseudospin and light\npolarization-state. Conducting extreme ultraviolet photoemission circular\ndichroism in these nonequilibrium settings reveals the potential for\ncontrolling the orbital character of Floquet-engineered states. These findings\nlink Floquet engineering and quantum geometric light-matter coupling in\ntwo-dimensional materials. They can serve as a guideline for reaching novel\nout-of-equilibrium phases of matter by dynamically breaking symmetries through\ncoherent dressing of winding Bloch electrons with tailored light pulses.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"SB3x2qBjU928-4B_lDvKupONSXb7uTUDPa98Q_nrwu8","pdfSize":"4190860"}