{"id":"2412.05178","title":"Unveiling hadronic resonance dynamics at LHC energies: insights from\n  EPOS4","authors":"Vikash Sumberia, Dukhishyam Mallick, Sanjeev Singh Sambyal and Nasir\n  Mehdi Malik","authorsParsed":[["Sumberia","Vikash",""],["Mallick","Dukhishyam",""],["Sambyal","Sanjeev Singh",""],["Malik","Nasir Mehdi",""]],"versions":[{"version":"v1","created":"Fri, 6 Dec 2024 16:53:00 GMT"}],"updateDate":"2024-12-09","timestamp":1733503980000,"abstract":"  Hadronic resonances, with lifetimes of a few fm/\\textit{c}, are key tools for\nstudying the hadronic phase in high-energy collisions. This work investigates\nresonance production in pp collisions at $\\sqrt{s} = 13.6$ TeV and in Pb$-$Pb\ncollisions at $\\sqrt{s_{\\rm{NN}}} = 5.36$ TeV using the EPOS4 model, which can\nswitch the Ultra-relativistic Quantum Molecular Dynamics (UrQMD) ON and OFF,\nenabling the study of final-state hadronic interactions. We focus on hadronic\nresonances and the production of non-strange and strange hadrons, addressing\neffects like rescattering, regeneration, baryon-to-meson production, and\nstrangeness enhancement, using transverse momentum ($p_\\textrm{T}$) spectra and\nparticle ratios. Rescattering and strangeness effects are important at low\n$p_\\rm{T}$, while baryon-to-meson ratios dominate at intermediate $p_\\rm{T}$. A\nstrong mass-dependent radial flow is observed in the most central Pb$-$Pb\ncollisions. The average $p_\\rm{T}$, scaled with reduced hadron mass (mass\ndivided by valence quarks), shows a deviation from linearity for short-lived\nresonances. By analyzing the yield ratios of short-lived resonances to stable\nhadrons in pp and Pb$-$Pb collisions, we estimate the time duration ($\\tau$) of\nthe hadronic phase as a function of average charged multiplicity. The results\nshow that $\\tau$ increases with multiplicity and system size, with a nonzero\nvalue in high-multiplicity pp collisions. Proton (p), strange ($\\rm{\\Lambda}$),\nand multi-strange ($\\rm{\\Xi}$, $\\rm{\\Omega}$) baryon production in central\nPb$-$Pb collisions is influenced by strangeness enhancement and\nbaryon-antibaryon annihilation. Comparing with LHC measurements offers insights\ninto the dynamics of the hadronic phase.\n","subjects":["Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"sqYRBFJy3muPRMqY6sqb24K52b_E4Oz6Wwew_x-AWXQ","pdfSize":"685583"}