{"id":"2412.11233","title":"Structural and magnetic properties of CoTeMoO$_6$ revisited","authors":"Yu Li, Jared Coles, Xin Gui, Hyowon Park, Yan Wu, Xinglong Chen,\n  Jing-han Chen, Xiaoping Wang, Huibo Cao, Shane Stadler, Omar Chmaissem, David\n  P. Young, Stephan Rosenkranz, John F. DiTusa","authorsParsed":[["Li","Yu",""],["Coles","Jared",""],["Gui","Xin",""],["Park","Hyowon",""],["Wu","Yan",""],["Chen","Xinglong",""],["Chen","Jing-han",""],["Wang","Xiaoping",""],["Cao","Huibo",""],["Stadler","Shane",""],["Chmaissem","Omar",""],["Young","David P.",""],["Rosenkranz","Stephan",""],["DiTusa","John F.",""]],"versions":[{"version":"v1","created":"Sun, 15 Dec 2024 16:11:31 GMT"}],"updateDate":"2024-12-22","timestamp":1734279091000,"abstract":"  We have conducted a comprehensive investigation into the magnetic properties\nof the chiral multiferroic material CoTeMoO$_6$. In contrast with the previous\nclaim of canted antiferromagnetic order with ferromagnetic components, our\ninvestigation reveals an antiferromagnetic ground state with compensated\nmoments, providing an interesting platform for exploring exotic material\nproperties. Through careful measurements of magnetization under a series of\napplied field, we demonstrate that there exist two sequential field-induced\nmagnetic transitions in CoTeMoO$_6$, with one occurring at $H_{c1}$=460 Oe\nalong the a-axis, and the other at $H_{c2}$=1.16 T with the field along the\nb-axis. The values of $H_{c1}$ and $H_{c2}$ exhibit strong angular dependence\nand diverge with different rates as the applied field is rotated 90 degrees\nwithin the ab plane. This reflects the distinct nature of these transitions,\nwhich is further supported by the different critical behavior of $H_{c1}$ and\n$H_{c2}$, characterized by the values of $\\gamma$,in the function of\n$H_c=H_0\\times(1-\\frac{T}{T_c})^n$. Furthermore, we have demonstrated that\nthere exist structural and magnetic twin domains in CoTeMoO$_6$ that strongly\naffect the experimental measurement of their macroscopic properties.\nIntriguingly, these twin domains can be related to the\northorhombicity/chirality of the crystal structure with the space group $P2_1\n2_1 2$. We further explored the magnetic and structural domains with uniaxial\npressure and polarized light microscopy. Our results suggest that CoTeMoO$_6$\ncould be used as a unique platform for investigating the intriguing physics\ninvolving intertwined degrees of freedom. The tunability of the underlying\ndomain distribution and its strong anisotropy could also be useful for\ndeveloping functional devices and applications.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"GwK1xDbNvXJSP11KhrROtObKazZjELvCbPrP0gqEICc","pdfSize":"1414914"}