{
  "id": "2412.09542",
  "title": "The Controlled Four-Parameter Method for Cross-Assignment of Directional\n  Wave Systems",
  "authors": "Andre Luiz Cordeiro dos Santos, Felipe Marques dos Santos, Nelson\n  Violante-Carvalho, Luiz Mariano Carvalho, Helder Manoel Venceslau",
  "authorsParsed": [
    [
      "Santos",
      "Andre Luiz Cordeiro dos",
      ""
    ],
    [
      "Santos",
      "Felipe Marques dos",
      ""
    ],
    [
      "Violante-Carvalho",
      "Nelson",
      ""
    ],
    [
      "Carvalho",
      "Luiz Mariano",
      ""
    ],
    [
      "Venceslau",
      "Helder Manoel",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 18:33:14 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1734028394000,
  "abstract": "  Cross-assignment of directional wave spectra is a critical task in wave data\nassimilation. Traditionally, most methods rely on two-parameter spectral\ndistances or energy ranking approaches, which often fail to account for the\ncomplexities of the wave field, leading to inaccuracies. To address these\nlimitations, we propose the Controlled Four-Parameter Method (C4PM), which\nindependently considers four integrated wave parameters. This method enhances\nthe accuracy and robustness of cross-assignment by offering flexibility in\nassigning weights and controls to each wave parameter. We compare C4PM with a\ntwo-parameter spectral distance method using data from two buoys moored 13 km\napart in deep water. Although both methods produce negligible bias and high\ncorrelation, C4PM demonstrates superior performance by preventing the\noccurrence of outliers and achieving a lower root mean square error across all\nparameters. The negligible computational cost and customization make C4PM a\nvaluable tool for wave data assimilation, improving the reliability of\nforecasts and model validations.\n",
  "subjects": [
    "Physics/Atmospheric and Oceanic Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "463E3eDC77sGVtuLcwIAmpJz3z9dcLYMLegBPfKNvQc",
  "pdfSize": "6345037"
}