{
  "id": "2412.17651",
  "title": "Detecting anxiety and depression in dialogues: a multi-label and\n  explainable approach",
  "authors": "Francisco de Arriba-P\\'erez, Silvia Garc\\'ia-M\\'endez",
  "authorsParsed": [
    [
      "de Arriba-Pérez",
      "Francisco",
      ""
    ],
    [
      "García-Méndez",
      "Silvia",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 15:29:46 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734967786000,
  "abstract": "  Anxiety and depression are the most common mental health issues worldwide,\naffecting a non-negligible part of the population. Accordingly, stakeholders,\nincluding governments' health systems, are developing new strategies to promote\nearly detection and prevention from a holistic perspective (i.e., addressing\nseveral disorders simultaneously). In this work, an entirely novel system for\nthe multi-label classification of anxiety and depression is proposed. The input\ndata consists of dialogues from user interactions with an assistant chatbot.\nAnother relevant contribution lies in using Large Language Models (LLMs) for\nfeature extraction, provided the complexity and variability of language. The\ncombination of LLMs, given their high capability for language understanding,\nand Machine Learning (ML) models, provided their contextual knowledge about the\nclassification problem thanks to the labeled data, constitute a promising\napproach towards mental health assessment. To promote the solution's\ntrustworthiness, reliability, and accountability, explainability descriptions\nof the model's decision are provided in a graphical dashboard. Experimental\nresults on a real dataset attain 90 % accuracy, improving those in the prior\nliterature. The ultimate objective is to contribute in an accessible and\nscalable way before formal treatment occurs in the healthcare systems.\n",
  "subjects": [
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "vz-P9VZBRh8JpC44DlSOMhcg5MODOKqw1lwZ7Q4DFKI",
  "pdfSize": "3085070"
}