{"id":"2412.15704","title":"PoisonCatcher: Revealing and Identifying LDP Poisoning Attacks in IIoT","authors":"Lisha Shuai, Shaofeng Tan, Nan Zhang, Jiamin Zhang, Min Zhang,\n  Xiaolong Yang","authorsParsed":[["Shuai","Lisha",""],["Tan","Shaofeng",""],["Zhang","Nan",""],["Zhang","Jiamin",""],["Zhang","Min",""],["Yang","Xiaolong",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 09:26:50 GMT"}],"updateDate":"2024-12-23","timestamp":1734686810000,"abstract":"  Local Differential Privacy (LDP) is widely adopted in the Industrial Internet\nof Things (IIoT) for its lightweight, decentralized, and scalable nature.\nHowever, its perturbation-based privacy mechanism makes it difficult to\ndistinguish between uncontaminated and tainted data, encouraging adversaries to\nlaunch poisoning attacks. While LDP provides some resilience against minor\npoisoning, it lacks robustness in IIoT with dynamic networks and substantial\nreal-time data flows. Effective countermeasures for such attacks are still\nunderdeveloped. This work narrows the critical gap by revealing and identifying\nLDP poisoning attacks in IIoT. We begin by deepening the understanding of such\nattacks, revealing novel threats that arise from the interplay between LDP\nindistinguishability and IIoT complexity. This exploration uncovers a novel\nrule-poisoning attack, and presents a general attack formulation by unifying it\nwith input-poisoning and output-poisoning. Furthermore, two key attack impacts,\ni.e., Statistical Query Result (SQR) accuracy degradation and inter-dataset\ncorrelations disruption, along with two characteristics: attack patterns\nunstable and poisoned data stealth are revealed. From this, we propose\nPoisonCatcher, a four-stage solution that detects LDP poisoning attacks and\nidentifies specific contaminated data points. It utilizes temporal similarity,\nattribute correlation, and time-series stability analysis to detect datasets\nexhibiting SQR accuracy degradation, inter-dataset disruptions, and unstable\npatterns. Enhanced feature engineering is used to extract subtle poisoning\nsignatures, enabling machine learning models to identify specific\ncontamination. Experimental evaluations show the effectiveness, achieving\nstate-of-the-art performance with average precision and recall rates of 86.17%\nand 97.5%, respectively, across six representative attack scenarios.\n","subjects":["Computer Science/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"EjoCnTmcL0o4DYDNzLWjU9TzrCOCkwJ8JpDtmU9wpdU","pdfSize":"872937"}