{"id":"2412.10173","title":"Scalable magnetic resonance fingerprinting: Incremental inference of\n  high dimensional elliptical mixtures from large data volumes","authors":"Geoffroy Oudoumanessah, Thomas Coudert, Carole Lartizien, Michel\n  Dojat, Thomas Christen, Florence Forbes","authorsParsed":[["Oudoumanessah","Geoffroy",""],["Coudert","Thomas",""],["Lartizien","Carole",""],["Dojat","Michel",""],["Christen","Thomas",""],["Forbes","Florence",""]],"versions":[{"version":"v1","created":"Fri, 13 Dec 2024 14:39:23 GMT"}],"updateDate":"2024-12-16","timestamp":1734100763000,"abstract":"  Magnetic Resonance Fingerprinting (MRF) is an emerging technology with the\npotential to revolutionize radiology and medical diagnostics. In comparison to\ntraditional magnetic resonance imaging (MRI), MRF enables the rapid,\nsimultaneous, non-invasive acquisition and reconstruction of multiple tissue\nparameters, paving the way for novel diagnostic techniques. In the original\nmatching approach, reconstruction is based on the search for the best matches\nbetween in vivo acquired signals and a dictionary of high-dimensional simulated\nsignals (fingerprints) with known tissue properties. A critical and limiting\nchallenge is that the size of the simulated dictionary increases exponentially\nwith the number of parameters, leading to an extremely costly subsequent\nmatching. In this work, we propose to address this scalability issue by\nconsidering probabilistic mixtures of high-dimensional elliptical\ndistributions, to learn more efficient dictionary representations. Mixture\ncomponents are modelled as flexible ellipitic shapes in low dimensional\nsubspaces. They are exploited to cluster similar signals and reduce their\ndimension locally cluster-wise to limit information loss. To estimate such a\nmixture model, we provide a new incremental algorithm capable of handling large\nnumbers of signals, allowing us to go far beyond the hardware limitations\nencountered by standard implementations. We demonstrate, on simulated and real\ndata, that our method effectively manages large volumes of MRF data with\nmaintained accuracy. It offers a more efficient solution for accurate tissue\ncharacterization and significantly reduces the computational burden, making the\nclinical application of MRF more practical and accessible.\n","subjects":["Statistics/Applications"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Sou_tlJQYPh60x8dNBmR4byaq-MnsyROiNNeO6u21cs","pdfSize":"5863359"}