{"id":"2412.04045","title":"AI4EF: Artificial Intelligence for Energy Efficiency in the Building\n  Sector","authors":"Alexandros Menelaos Tzortzis, Georgios Kormpakis, Sotiris Pelekis,\n  Ariadni Michalitsi-Psarrou, Evangelos Karakolis, Christos Ntanos, Dimitris\n  Askounis","authorsParsed":[["Tzortzis","Alexandros Menelaos",""],["Kormpakis","Georgios",""],["Pelekis","Sotiris",""],["Michalitsi-Psarrou","Ariadni",""],["Karakolis","Evangelos",""],["Ntanos","Christos",""],["Askounis","Dimitris",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 10:36:39 GMT"}],"updateDate":"2024-12-06","timestamp":1733394999000,"abstract":"  AI4EF, Artificial Intelligence for Energy Efficiency, is an advanced,\nuser-centric tool designed to support decision-making in building energy\nretrofitting and efficiency optimization. Leveraging machine learning (ML) and\ndata-driven insights, AI4EF enables stakeholders such as public sector\nrepresentatives, energy consultants, and building owners to model, analyze, and\npredict energy consumption, retrofit costs, and environmental impacts of\nbuilding upgrades. Featuring a modular framework, AI4EF includes customizable\nbuilding retrofitting, photovoltaic installation assessment, and predictive\nmodeling tools that allow users to input building parameters and receive\ntailored recommendations for achieving energy savings and carbon reduction\ngoals. Additionally, the platform incorporates a Training Playground for data\nscientists to refine ML models used by said framework. Finally, AI4EF provides\naccess to the Enershare Data Space to facilitate seamless data sharing and\naccess within the ecosystem. Its compatibility with open-source identity\nmanagement, Keycloak, enhances security and accessibility, making it adaptable\nfor various regulatory and organizational contexts. This paper presents an\narchitectural overview of AI4EF, its application in energy efficiency\nscenarios, and its potential for advancing sustainable energy practices through\nartificial intelligence (AI).\n","subjects":["Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"qlzAxKoXV0eqTDlDC040i6JS9xHbCG82SJmwWay2HVU","pdfSize":"2049836"}