{
  "id": "2412.16981",
  "title": "Relaxation of A Thermally Bathed Harmonic Oscillator: A Study Based on\n  the Group-theoretical Formalism",
  "authors": "Yan Gu and Jiao Wang",
  "authorsParsed": [
    [
      "Gu",
      "Yan",
      ""
    ],
    [
      "Wang",
      "Jiao",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 22 Dec 2024 11:53:12 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734868392000,
  "abstract": "  Quantum dynamics of a damped harmonic oscillator has been extensively studied\nsince the sixties of the last century. Here, with a distinct tool termed the\n``group-theoretical characteristic function\" (GCF), we investigate analytically\nhow a harmonic oscillator immersed in a thermal environment would relax to its\nequilibrium state. We assume that the oscillator is at a pure state initially\nand its evolution is governed by a well-known quantum-optical master equation.\nBy taking advantage of the GCF, the master equation can be transformed into a\nfirst-order linear partial differential equation that allows us to write down\nits solution explicitly. Based on the solution, it is found that, in clear\ncontrast with the monotonic relaxation process of its classical counterpart,\nthe quantum oscillator may demonstrate some intriguing nonmonotonic relaxation\ncharacteristics. In particular, when the initial state is a Gaussian state\n(i.e., a squeezed coherent state), it is found that there is a critical value\nof the environmental temperature, below which the entropy will first increase\nto reach its maximum value, then turn down and converge to its equilibrium\nvalue from above. For the temperature higher than the critical value, the\nentropy will converge to its equilibrium value from below monotonically.\nHowever, when the initial state is a Fock state, it is found that there is a\nnew phase additional to the previous case, where the time curve of entropy\nfeatures two extreme points. Namely, the entropy will increase to reach its\nmaximum first, then turn down to reach its minimum, from where it begins to\nincrease and converges to the equilibrium value eventually. Other related\nissues are discussed as well.\n",
  "subjects": [
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "Zeh12XGzOFSXoriWcqysGlOsL4IzFHa_yZdJ7TYuw9Y",
  "pdfSize": "543196"
}