{
  "id": "2412.11385",
  "title": "Why Does ChatGPT \"Delve\" So Much? Exploring the Sources of Lexical\n  Overrepresentation in Large Language Models",
  "authors": "Tom S. Juzek, Zina B. Ward",
  "authorsParsed": [
    [
      "Juzek",
      "Tom S.",
      ""
    ],
    [
      "Ward",
      "Zina B.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 02:27:59 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734316079000,
  "abstract": "  Scientific English is currently undergoing rapid change, with words like\n\"delve,\" \"intricate,\" and \"underscore\" appearing far more frequently than just\na few years ago. It is widely assumed that scientists' use of large language\nmodels (LLMs) is responsible for such trends. We develop a formal, transferable\nmethod to characterize these linguistic changes. Application of our method\nyields 21 focal words whose increased occurrence in scientific abstracts is\nlikely the result of LLM usage. We then pose \"the puzzle of lexical\noverrepresentation\": WHY are such words overused by LLMs? We fail to find\nevidence that lexical overrepresentation is caused by model architecture,\nalgorithm choices, or training data. To assess whether reinforcement learning\nfrom human feedback (RLHF) contributes to the overuse of focal words, we\nundertake comparative model testing and conduct an exploratory online study.\nWhile the model testing is consistent with RLHF playing a role, our\nexperimental results suggest that participants may be reacting differently to\n\"delve\" than to other focal words. With LLMs quickly becoming a driver of\nglobal language change, investigating these potential sources of lexical\noverrepresentation is important. We note that while insights into the workings\nof LLMs are within reach, a lack of transparency surrounding model development\nremains an obstacle to such research.\n",
  "subjects": [
    "Computer Science/Computation and Language",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "7ZD6XAav3RINrhpP3n_8QXZqIxgQCWRhFB7Af8txDJo",
  "pdfSize": "2163719"
}