{
  "id": "2412.20372",
  "title": "LLM2: Let Large Language Models Harness System 2 Reasoning",
  "authors": "Cheng Yang, Chufan Shi, Siheng Li, Bo Shui, Yujiu Yang, Wai Lam",
  "authorsParsed": [
    [
      "Yang",
      "Cheng",
      ""
    ],
    [
      "Shi",
      "Chufan",
      ""
    ],
    [
      "Li",
      "Siheng",
      ""
    ],
    [
      "Shui",
      "Bo",
      ""
    ],
    [
      "Yang",
      "Yujiu",
      ""
    ],
    [
      "Lam",
      "Wai",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 29 Dec 2024 06:32:36 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735453956000,
  "abstract": "  Large language models (LLMs) have exhibited impressive capabilities across a\nmyriad of tasks, yet they occasionally yield undesirable outputs. We posit that\nthese limitations are rooted in the foundational autoregressive architecture of\nLLMs, which inherently lacks mechanisms for differentiating between desirable\nand undesirable results. Drawing inspiration from the dual-process theory of\nhuman cognition, we introduce LLM2, a novel framework that combines an LLM\n(System 1) with a process-based verifier (System 2). Within LLM2, the LLM is\nresponsible for generating plausible candidates, while the verifier provides\ntimely process-based feedback to distinguish desirable and undesirable outputs.\nThe verifier is trained with a pairwise comparison loss on synthetic\nprocess-supervision data generated through our token quality exploration\nstrategy. Empirical results on mathematical reasoning benchmarks substantiate\nthe efficacy of LLM2, exemplified by an accuracy enhancement from 50.3 to 57.8\n(+7.5) for Llama3-1B on GSM8K. Furthermore, when combined with\nself-consistency, LLM2 achieves additional improvements, boosting major@20\naccuracy from 56.2 to 70.2 (+14.0).\n",
  "subjects": [
    "Computer Science/Computation and Language",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "MHDQluMdOAzSv_LcRb0sF0DiC8x8Llagor9WZQRgB2Q",
  "pdfSize": "605861"
}