{
  "id": "2412.02792",
  "title": "Taurus Database: How to be Fast, Available, and Frugal in the Cloud",
  "authors": "Alex Depoutovitch, Chong Chen, Jin Chen, Paul Larson, Shu Lin, Jack\n  Ng, Wenlin Cui, Qiang Liu, Wei Huang, Yong Xiao, Yongjun He",
  "authorsParsed": [
    [
      "Depoutovitch",
      "Alex",
      ""
    ],
    [
      "Chen",
      "Chong",
      ""
    ],
    [
      "Chen",
      "Jin",
      ""
    ],
    [
      "Larson",
      "Paul",
      ""
    ],
    [
      "Lin",
      "Shu",
      ""
    ],
    [
      "Ng",
      "Jack",
      ""
    ],
    [
      "Cui",
      "Wenlin",
      ""
    ],
    [
      "Liu",
      "Qiang",
      ""
    ],
    [
      "Huang",
      "Wei",
      ""
    ],
    [
      "Xiao",
      "Yong",
      ""
    ],
    [
      "He",
      "Yongjun",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 19:43:07 GMT"
    }
  ],
  "updateDate": "2024-12-05",
  "timestamp": 1733254987000,
  "abstract": "  Using cloud Database as a Service (DBaaS) offerings instead of on-premise\ndeployments is increasingly common. Key advantages include improved\navailability and scalability at a lower cost than on-premise alternatives. In\nthis paper, we describe the design of Taurus, a new multi-tenant cloud database\nsystem. Taurus separates the compute and storage layers in a similar manner to\nAmazon Aurora and Microsoft Socrates and provides similar benefits, such as\nread replica support, low network utilization, hardware sharing and\nscalability. However, the Taurus architecture has several unique advantages.\nTaurus offers novel replication and recovery algorithms providing better\navailability than existing approaches using the same or fewer replicas. Also,\nTaurus is highly optimized for performance, using no more than one network hop\non critical paths and exclusively using append-only storage, delivering faster\nwrites, reduced device wear, and constant-time snapshots. This paper describes\nTaurus and provides a detailed description and analysis of the storage node\narchitecture, which has not been previously available from the published\nliterature.\n",
  "subjects": [
    "Computer Science/Databases",
    "Computer Science/Distributed, Parallel, and Cluster Computing"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "qeSnqMQa66KNGuMJmWGYkoYsJmYClkoscR3zpLBIDr8",
  "pdfSize": "985453"
}