{
  "id": "2412.06877",
  "title": "LLMs for Generalizable Language-Conditioned Policy Learning under\n  Minimal Data Requirements",
  "authors": "Thomas Pouplin, Katarzyna Kobalczyk, Hao Sun, Mihaela van der Schaar",
  "authorsParsed": [
    [
      "Pouplin",
      "Thomas",
      ""
    ],
    [
      "Kobalczyk",
      "Katarzyna",
      ""
    ],
    [
      "Sun",
      "Hao",
      ""
    ],
    [
      "van der Schaar",
      "Mihaela",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 18:43:56 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733769836000,
  "abstract": "  To develop autonomous agents capable of executing complex, multi-step\ndecision-making tasks as specified by humans in natural language, existing\nreinforcement learning approaches typically require expensive labeled datasets\nor access to real-time experimentation. Moreover, conventional methods often\nface difficulties in generalizing to unseen goals and states, thereby limiting\ntheir practical applicability. This paper presents TEDUO, a novel training\npipeline for offline language-conditioned policy learning. TEDUO operates on\neasy-to-obtain, unlabeled datasets and is suited for the so-called in-the-wild\nevaluation, wherein the agent encounters previously unseen goals and states. To\naddress the challenges posed by such data and evaluation settings, our method\nleverages the prior knowledge and instruction-following capabilities of large\nlanguage models (LLMs) to enhance the fidelity of pre-collected offline data\nand enable flexible generalization to new goals and states. Empirical results\ndemonstrate that the dual role of LLMs in our framework-as data enhancers and\ngeneralizers-facilitates both effective and data-efficient learning of\ngeneralizable language-conditioned policies.\n",
  "subjects": [
    "Computer Science/Computation and Language",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "BvCFdjezCb-AJsZ0KNHuhCPNYq6LxfekeEEmGizL8Y0",
  "pdfSize": "1091731"
}