{
  "id": "2412.06771",
  "title": "Proactive Agents for Multi-Turn Text-to-Image Generation Under\n  Uncertainty",
  "authors": "Meera Hahn, Wenjun Zeng, Nithish Kannen, Rich Galt, Kartikeya Badola,\n  Been Kim, Zi Wang",
  "authorsParsed": [
    [
      "Hahn",
      "Meera",
      ""
    ],
    [
      "Zeng",
      "Wenjun",
      ""
    ],
    [
      "Kannen",
      "Nithish",
      ""
    ],
    [
      "Galt",
      "Rich",
      ""
    ],
    [
      "Badola",
      "Kartikeya",
      ""
    ],
    [
      "Kim",
      "Been",
      ""
    ],
    [
      "Wang",
      "Zi",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 18:56:32 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733770592000,
  "abstract": "  User prompts for generative AI models are often underspecified, leading to\nsub-optimal responses. This problem is particularly evident in text-to-image\n(T2I) generation, where users commonly struggle to articulate their precise\nintent. This disconnect between the user's vision and the model's\ninterpretation often forces users to painstakingly and repeatedly refine their\nprompts. To address this, we propose a design for proactive T2I agents equipped\nwith an interface to (1) actively ask clarification questions when uncertain,\nand (2) present their understanding of user intent as an understandable belief\ngraph that a user can edit. We build simple prototypes for such agents and\nverify their effectiveness through both human studies and automated evaluation.\nWe observed that at least 90% of human subjects found these agents and their\nbelief graphs helpful for their T2I workflow. Moreover, we develop a scalable\nautomated evaluation approach using two agents, one with a ground truth image\nand the other tries to ask as few questions as possible to align with the\nground truth. On DesignBench, a benchmark we created for artists and designers,\nthe COCO dataset (Lin et al., 2014), and ImageInWords (Garg et al., 2024), we\nobserved that these T2I agents were able to ask informative questions and\nelicit crucial information to achieve successful alignment with at least 2\ntimes higher VQAScore (Lin et al., 2024) than the standard single-turn T2I\ngeneration. Demo: https://github.com/google-deepmind/proactive_t2i_agents.\n",
  "subjects": [
    "Computer Science/Artificial Intelligence",
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "TJtnHzd-DNdMaajLaMThYP3NppM2bu_x0Dp3SzKQEdk",
  "pdfSize": "20142097"
}