{"id":"2412.05595","title":"Quantum Annealing and Tensor Networks: a Powerful Combination to Solve\n  Optimization Problems","authors":"Miquel Albert\\'i Binimelis","authorsParsed":[["Binimelis","Miquel Albertí",""]],"versions":[{"version":"v1","created":"Sat, 7 Dec 2024 09:20:20 GMT"}],"updateDate":"2024-12-10","timestamp":1733563220000,"abstract":"  Quantum computing has long promised to revolutionize the way we solve complex\nproblems. At the same time, tensor networks are widely used across various\nfields due to their computational efficiency and capacity to represent\nintricate systems. While both technologies can address similar problems, the\nprimary aim of this thesis is not to compare them. Such comparison would be\nunfair, as quantum devices are still in an early stage, whereas tensor network\nalgorithms represent the state-of-the-art in quantum simulation. Instead, we\nexplore a potential synergy between these technologies, focusing on how two\nflagship algorithms from each paradigm, the Density Matrix Renormalization\nGroup (DMRG) and quantum annealing, might collaborate in the future.\nFurthermore, a significant challenge in the DMRG algorithm is identifying an\nappropriate tensor network representation for the quantum system under study.\nThe representation commonly used is called Matrix Product Operator (MPO), and\nit is notoriously difficult to obtain for certain systems. This thesis outlines\nan approach to this problem using finite automata, which we apply to construct\nthe MPO for our case study. Finally, we present a practical application of this\nframework through the quadratic knapsack problem (QKP). Despite its apparent\nsimplicity, the QKP is a fundamental problem in computer science with numerous\npractical applications. In addition to quantum annealing and the DMRG\nalgorithm, we implement a dynamic programming approach to evaluate the quality\nof our results. Our results highlight the power of tensor networks and the\npotential of quantum annealing for solving optimization problems. Moreover,\nthis thesis is designed to be self-explanatory, ensuring that readers with a\nsolid mathematical background can fully understand the content without prior\nknowledge of quantum mechanics.\n","subjects":["Physics/Quantum Physics","Computer Science/Information Theory","Mathematics/Information Theory","Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"qY3sxorLOx8hi2UxhlmKpqnJ-omwdODZvebLgYfWhAw","pdfSize":"1360659"}