{"id":"2412.20492","title":"Evolution of massive black hole in galactic nucleus","authors":"Hajime Inoue","authorsParsed":[["Inoue","Hajime",""]],"versions":[{"version":"v1","created":"Sun, 29 Dec 2024 15:15:03 GMT"}],"updateDate":"2024-12-31","timestamp":1735485303000,"abstract":"  We propose a scenario for mass evolution of massive black holes (MBH) in\ngalactic nuclei, to explain both the mass correlation of the supermassive black\nhole (SMBH) with the bulge and the down-sizing behavior of the active galactic\nnuclei. Primordial gas structures to evolve galactic bulges are supposed to be\nformed at $z \\sim$ 10 and the core region, called the nuclear region (NR) here,\nis considered to be a place for a MBH to grow to the SMBH. The down-sizing\nbehavior requires the MBH to significantly increase the mass in a time $\\sim$ 1\nGyr. The rapid mass increase is discussed to be realized only when the MBH\nstays in a very high density region such as a core of a molecular cloud\nthroughout the period $\\sim$ 1 Gyr. According to these arguments, the MBHs\nformed from the population III stars born in the mini halos at $z \\sim$ 20 - 30\nare excluded from the candidates for the seed black hole to the SMBH and only\nthe MBHs from the population II stars born in the core of the central molecular\ncloud (CMC) in the NR remain as them. The MBHs in the dense core of the CMC\nstarted increasing the mass through mass-accretion and the most massive black\nhole (MMBH) got the most rapid evolution, possibly restraining relatively slow\nevolutions of the less massive black holes. Dynamical interactions of the MMBH\nwith the ambient MCs induced the wandering motion and the further\nmass-increase. However, when the MMBH mass exceeded a boundary mass, the\ndynamical friction with the field stars brakes the MMBH wandering and the mass\naccretion. This scenario can semi-quantitatively reproduce both the down-sizing\nbehavior and the SMBH mass - bulge mass correlation with reasonable parameter\nvalues.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"2DtOrIGI38xmnGGkz7-2n7GlV4nqzKHJ2AkExtFWaHk","pdfSize":"318556"}