{
  "id": "2412.11610",
  "title": "Efficient Bayesian inversion for simultaneous estimation of geometry and\n  spatial field using the Karhunen-Lo\\`eve expansion",
  "authors": "Tatsuya Shibata, Michael Conrad Koch, Iason Papaioannou and Kazunori\n  Fujisawa",
  "authorsParsed": [
    [
      "Shibata",
      "Tatsuya",
      ""
    ],
    [
      "Koch",
      "Michael Conrad",
      ""
    ],
    [
      "Papaioannou",
      "Iason",
      ""
    ],
    [
      "Fujisawa",
      "Kazunori",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 09:50:33 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734342633000,
  "abstract": "  Detection of abrupt spatial changes in physical properties representing\nunique geometric features such as buried objects, cavities, and fractures is an\nimportant problem in geophysics and many engineering disciplines. In this\ncontext, simultaneous spatial field and geometry estimation methods that\nexplicitly parameterize the background spatial field and the geometry of the\nembedded anomalies are of great interest. This paper introduces an advanced\ninversion procedure for simultaneous estimation using the domain independence\nproperty of the Karhunen-Lo\\`eve (K-L) expansion. Previous methods pursuing\nthis strategy face significant computational challenges. The associated\nintegral eigenvalue problem (IEVP) needs to be solved repeatedly on evolving\ndomains, and the shape derivatives in gradient-based algorithms require costly\ncomputations of the Moore-Penrose inverse. Leveraging the domain independence\nproperty of the K-L expansion, the proposed method avoids both of these\nbottlenecks, and the IEVP is solved only once on a fixed bounding domain.\nComparative studies demonstrate that our approach yields two orders of\nmagnitude improvement in K-L expansion gradient computation time. Inversion\nstudies on one-dimensional and two-dimensional seepage flow problems highlight\nthe benefits of incorporating geometry parameters along with spatial field\nparameters. The proposed method captures abrupt changes in hydraulic\nconductivity with a lower number of parameters and provides accurate estimates\nof boundary and spatial-field uncertainties, outperforming spatial-field-only\nestimation methods.\n",
  "subjects": [
    "Statistics/Applications"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "SXU_lKBxaguMvlvFIZnR_ttKxRDZVeUgmAxplqNka2Q",
  "pdfSize": "25211429"
}