{"id":"2412.13681","title":"Dynamics of Parallel Manipulators with Hybrid Complex Limbs -- Modular\n  Modeling and Parallel Computing","authors":"Andreas Mueller","authorsParsed":[["Mueller","Andreas",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 10:08:40 GMT"}],"updateDate":"2024-12-19","timestamp":1734516520000,"abstract":"  Parallel manipulators, also called parallel kinematics machines (PKM), enable\nrobotic solutions for highly dynamic handling and machining applications. The\nsafe and accurate design and control necessitates high-fidelity dynamics\nmodels. Such modeling approaches have already been presented for PKM with\nsimple limbs (i.e. each limb is a serial kinematic chain). A systematic\nmodeling approach for PKM with complex limbs (i.e. limbs that possess kinematic\nloops) was not yet proposed despite the fact that many successful PKM comprise\ncomplex limbs. This paper presents a systematic modular approach to the\nkinematics and dynamics modeling of PKM with complex limbs that are built as\nserial arrangement of closed loops. The latter are referred to as hybrid limbs,\nand can be found in almost all PKM with complex limbs, such as the Delta robot.\nThe proposed method generalizes the formulation for PKM with simple limbs by\nmeans of local resolution of loop constraints, which is known as constraint\nembedding in multibody dynamics. The constituent elements of the method are the\nkinematic and dynamic equations of motions (EOM), and the inverse kinematics\nsolution of the limbs, i.e. the relation of platform motion and the motion of\nthe limbs. While the approach is conceptually independent of the used\nkinematics and dynamics formulation, a Lie group formulation is employed for\nderiving the EOM. The frame invariance of the Lie group formulation is used for\ndevising a modular modeling method where the EOM of a representative limb are\nused to derived the EOM of the limbs of a particular PKM. The PKM topology is\nexploited in a parallel computation scheme that shall allow for computationally\nefficient distributed evaluation of the overall EOM of the PKM. Finally, the\nmethod is applied to the IRSBot-2 and a 3\\underline{R}R[2RR]R Delta robot,\nwhich is presented in detail.\n","subjects":["Computer Science/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"LqN6yofryb-mLt3c6B5fNxmJM0wDHxp9Srg9mAOUhts","pdfSize":"6547655"}