{
  "id": "2412.06888",
  "title": "Conditions for Super-Eddington Accretion onto the First Black Holes",
  "authors": "Simone T. Gordon, Britton D. Smith, Sadegh Khochfar, Ricarda S.\n  Beckmann",
  "authorsParsed": [
    [
      "Gordon",
      "Simone T.",
      ""
    ],
    [
      "Smith",
      "Britton D.",
      ""
    ],
    [
      "Khochfar",
      "Sadegh",
      ""
    ],
    [
      "Beckmann",
      "Ricarda S.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 19:00:01 GMT"
    },
    {
      "version": "v2",
      "created": "Sun, 2 Feb 2025 17:10:46 GMT"
    }
  ],
  "updateDate": "2025-02-04",
  "timestamp": 1733770801000,
  "abstract": "  Observations of supermassive black holes at high redshift challenge our\nunderstanding of the evolution of the first generation of black holes (BHs) in\nproto-galactic environments. One possibility is that they grow much more\nrapidly than current estimates of feedback and accretion efficiency permit.\nFollowing our previous analysis of super-Eddington accretion onto stellar-mass\nblack holes in mini-haloes under no-feedback conditions, we now investigate\nwhether this can be sustained when thermal feedback is included. We use four\nsets of cosmological simulations at sub-pc resolution with initial black hole\nmasses varying from $1 \\times 10^3 - 6 \\times 10^4 M_\\odot$, exploring a range\nof feedback efficiencies. We also vary the feedback injection radius to probe\nthe threshold of numerical overcooling. We find that super-Eddington growth\nsustained on the order of $\\sim$$100 \\, \\rm kyr$ is possible with very weak\nthermal feedback efficiency in all environments and moderate efficiency for two\nof the BHs. Trans-Eddington growth is possible for a $3 \\times 10^3 - 6 \\times\n10^3 M_\\odot$ BH at moderate feedback efficiencies. We discuss the\neffectiveness of thermal feedback in heating the gas, suppressing accretion,\nand driving outflows at these parameter configurations. Our results suggest\nthat super-Eddington growth may be possible in the presence of thermal feedback\nfor black holes formed from the first stars.\n",
  "subjects": [
    "Astrophysics/Astrophysics of Galaxies",
    "Astrophysics/Cosmology and Nongalactic Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "phb40LKBGH0SH6CgyFJrm9nJR3cJKL3Nx2411Zyx11Q",
  "pdfSize": "5261346"
}