{"id":"2412.09132","title":"Exploring the lifetime frontier with a beam-dump experiment at CiADS","authors":"Liangwen Chen, Mingxuan Du, Zhiyu Sun, Zeren Simon Wang, Fang Xie,\n  Ju-Jun Xie, Lei Yang, Pei Yu, Yu Zhang","authorsParsed":[["Chen","Liangwen",""],["Du","Mingxuan",""],["Sun","Zhiyu",""],["Wang","Zeren Simon",""],["Xie","Fang",""],["Xie","Ju-Jun",""],["Yang","Lei",""],["Yu","Pei",""],["Zhang","Yu",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 10:07:55 GMT"}],"updateDate":"2024-12-13","timestamp":1733998075000,"abstract":"  We propose a beam-dump experiment (BDE) at the upcoming facility of China\ninitiative Accelerator Driven System (CiADS), called CiADS-BDE, in order to\nsearch for long-lived particles (LLPs) predicted in various\nbeyond-the-Standard-Model (BSM) theories. The experiment is to be located in\nthe forward direction of the incoming low-energy proton beam at CiADS,\nleveraging the strong forward boost of the produced particles at the beam dump\nin general. The space between the dump and the detector is largely available,\nallowing for installation of veto materials and hence low levels of background\nevents. We elaborate on the detector setup, and choose dark photon as a\nbenchmark model for sensitivity study. We restrict ourselves to the signature\nof an electron-positron pair, and find that with 5 years' operation, unique,\ncurrently unexcluded parts of the parameter space for $\\mathcal{O}(100)$ MeV\ndark-photon masses and $\\mathcal{O}(10^{-9}\\text{--}10^{-8})$ kinetic mixing\ncan be probed at the CiADS-BDE. Furthermore, considering that there is no need\nto set up a proton beam specifically for this experiment and that the detector\nsystem requires minimal instrumentation, the experiment is supposed to be\nrelatively cost-effective. Therefore, we intend this work to promote studies on\nthe sensitivity reach of the proposed experiment to additional LLP scenarios,\nand in the end, the realization of the experiment. Incidentally, we study the\nsensitivity of the same BDE setups at the High Intensity Heavy-ion Accelerator\nFacility (HIAF), presently under construction near the CiADS program site, and\nconclude that HIAF-BDE could probe new parameter regions, too.\n","subjects":["Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Experiment"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"u41GUeESUwji2mVNumcXZe75eXl60qsrMQETj0-n9jY","pdfSize":"1438882"}