{"id":"2412.13203","title":"Matryoshka: Optimization of Dynamic Diverse Quantum Chemistry Systems\n  via Elastic Parallelism Transformation","authors":"Tuowei Wang, Kun Li, Donglin Bai, Fusong Ju, Leo Xia, Ting Cao, Ju\n  Ren, Yaoxue Zhang, Mao Yang","authorsParsed":[["Wang","Tuowei",""],["Li","Kun",""],["Bai","Donglin",""],["Ju","Fusong",""],["Xia","Leo",""],["Cao","Ting",""],["Ren","Ju",""],["Zhang","Yaoxue",""],["Yang","Mao",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 06:34:39 GMT"},{"version":"v2","created":"Mon, 23 Dec 2024 01:53:01 GMT"}],"updateDate":"2024-12-24","timestamp":1733207679000,"abstract":"  AI infrastructures, predominantly GPUs, have delivered remarkable performance\ngains for deep learning. Conversely, scientific computing, exemplified by\nquantum chemistry systems, suffers from dynamic diversity, where computational\npatterns are more diverse and vary dynamically, posing a significant challenge\nto sponge acceleration off GPUs.\n  In this paper, we propose Matryoshka, a novel elastically-parallel technique\nfor the efficient execution of quantum chemistry system with dynamic diversity\non GPU. Matryoshka capitalizes on Elastic Parallelism Transformation, a\nproperty prevalent in scientific systems yet underexplored for dynamic\ndiversity, to elastically realign parallel patterns with GPU architecture.\nStructured around three transformation primitives (Permutation, Deconstruction,\nand Combination), Matryoshka encompasses three core components. The Block\nConstructor serves as the central orchestrator, which reformulates data\nstructures accommodating dynamic inputs and constructs fine-grained\nGPU-efficient compute blocks. Within each compute block, the Graph Compiler\noperates offline, generating high-performance code with clear computational\npath through an automated compilation process. The Workload Allocator\ndynamically schedules workloads with varying operational intensities to threads\nonline. It achieves highly efficient parallelism for compute-intensive\noperations and facilitates fusion with neighboring memory-intensive operations\nautomatically. Extensive evaluation shows that Matryoshka effectively addresses\ndynamic diversity, yielding acceleration improvements of up to 13.86x (average\n9.41x) over prevailing state-of-the-art approaches on 13 quantum chemistry\nsystems.\n","subjects":["Computer Science/Distributed, Parallel, and Cluster Computing","Computer Science/Performance"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7Xqzkh0_yHGRnWyKydGfZi80_XJAsFNRu8ui2xNMPDM","pdfSize":"3333225"}