{
  "id": "2412.07615",
  "title": "Detection and parameter estimation of supermassive black hole ringdown\n  signals using a pulsar timing array",
  "authors": "Xuan Tao, Yan Wang, and Soumya D. Mohanty",
  "authorsParsed": [
    [
      "Tao",
      "Xuan",
      ""
    ],
    [
      "Wang",
      "Yan",
      ""
    ],
    [
      "Mohanty",
      "Soumya D.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 15:52:43 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733845963000,
  "abstract": "  Gravitational wave (GW) searches using pulsar timing arrays (PTAs) are\ncommonly assumed to be limited to a GW frequency of $\\lesssim 4\\times\n10^{-7}$Hz given by the Nyquist rate associated with the average observational\ncadence of $2$ weeks for a single pulsar. However, by taking advantage of\nasynchronous observations of multiple pulsars, a PTA can detect GW signals at\nhigher frequencies. This allows a sufficiently large PTA to detect and\ncharacterize the ringdown signals emitted following the merger of supermassive\nbinary black holes (SMBBHs), leading to stringent tests of the no-hair theorem\nin the mass range of such systems. Such large-scale PTAs are imminent with the\nadvent of the FAST telescope and the upcoming era of the Square Kilometer Array\n(SKA). To scope out the data analysis challenges involved in such a search, we\npropose a likelihood-based method coupled with Particle Swarm Optimization and\napply it to a simulated large-scale PTA comprised of $100$ pulsars, each having\na timing residual noise standard deviation of $100$~nsec, with randomized\nobservation times. Focusing on the dominant $(2,2)$ mode of the ringdown\nsignal, we show that it is possible to achieve a $99\\%$ detection probability\nwith a false alarm probability below $0.2\\%$ for an optimal signal-to-noise\nratio (SNR) $>10$. This corresponds, for example, to an equal-mass non-spinning\nSMBBH with an observer frame chirp mass $M_c = 9.52\\times10^{9}M_{\\odot}$ at a\nluminosity distance of $D_L = 420$ Mpc.\n",
  "subjects": [
    "Astrophysics/High Energy Astrophysical Phenomena",
    "Physics/General Relativity and Quantum Cosmology"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "fclr4lP8uKsLLux9H1EWXo3luPbU_TsCoh28v8-_ONk",
  "pdfSize": "2061456"
}