{"id":"2412.12906","title":"CATSplat: Context-Aware Transformer with Spatial Guidance for\n  Generalizable 3D Gaussian Splatting from A Single-View Image","authors":"Wonseok Roh, Hwanhee Jung, Jong Wook Kim, Seunggwan Lee, Innfarn Yoo,\n  Andreas Lugmayr, Seunggeun Chi, Karthik Ramani, Sangpil Kim","authorsParsed":[["Roh","Wonseok",""],["Jung","Hwanhee",""],["Kim","Jong Wook",""],["Lee","Seunggwan",""],["Yoo","Innfarn",""],["Lugmayr","Andreas",""],["Chi","Seunggeun",""],["Ramani","Karthik",""],["Kim","Sangpil",""]],"versions":[{"version":"v1","created":"Tue, 17 Dec 2024 13:32:04 GMT"},{"version":"v2","created":"Mon, 3 Feb 2025 08:06:36 GMT"}],"updateDate":"2025-02-04","timestamp":1734442324000,"abstract":"  Recently, generalizable feed-forward methods based on 3D Gaussian Splatting\nhave gained significant attention for their potential to reconstruct 3D scenes\nusing finite resources. These approaches create a 3D radiance field,\nparameterized by per-pixel 3D Gaussian primitives, from just a few images in a\nsingle forward pass. However, unlike multi-view methods that benefit from\ncross-view correspondences, 3D scene reconstruction with a single-view image\nremains an underexplored area. In this work, we introduce CATSplat, a novel\ngeneralizable transformer-based framework designed to break through the\ninherent constraints in monocular settings. First, we propose leveraging\ntextual guidance from a visual-language model to complement insufficient\ninformation from a single image. By incorporating scene-specific contextual\ndetails from text embeddings through cross-attention, we pave the way for\ncontext-aware 3D scene reconstruction beyond relying solely on visual cues.\nMoreover, we advocate utilizing spatial guidance from 3D point features toward\ncomprehensive geometric understanding under single-view settings. With 3D\npriors, image features can capture rich structural insights for predicting 3D\nGaussians without multi-view techniques. Extensive experiments on large-scale\ndatasets demonstrate the state-of-the-art performance of CATSplat in\nsingle-view 3D scene reconstruction with high-quality novel view synthesis.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"cTYx15WWyUtPE7ceOGCbLDIe09ujVbWv9IsDyJpkGuA","pdfSize":"7266182"}