{
  "id": "2412.08762",
  "title": "Modeling EEG Spectral Features through Warped Functional Mixed\n  Membership Models",
  "authors": "Emma Landry, Damla Senturk, Shafali Jeste, Charlotte DiStefano,\n  Abigail Dickinson, Donatello Telesca",
  "authorsParsed": [
    [
      "Landry",
      "Emma",
      ""
    ],
    [
      "Senturk",
      "Damla",
      ""
    ],
    [
      "Jeste",
      "Shafali",
      ""
    ],
    [
      "DiStefano",
      "Charlotte",
      ""
    ],
    [
      "Dickinson",
      "Abigail",
      ""
    ],
    [
      "Telesca",
      "Donatello",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 20:28:39 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1733948919000,
  "abstract": "  A common concern in the field of functional data analysis is the challenge of\ntemporal misalignment, which is typically addressed using curve registration\nmethods. Currently, most of these methods assume the data is governed by a\nsingle common shape or a finite mixture of population level shapes. We\nintroduce more flexibility using mixed membership models. Individual\nobservations are assumed to partially belong to different clusters, allowing\nvariation across multiple functional features. We propose a Bayesian\nhierarchical model to estimate the underlying shapes, as well as the individual\ntime-transformation functions and levels of membership. Motivating this work is\ndata from EEG signals in children with autism spectrum disorder (ASD). Our\nmethod agrees with the neuroimaging literature, recovering the 1/f pink noise\nfeature distinctly from the peak in the alpha band. Furthermore, the\nintroduction of a regression component in the estimation of time-transformation\nfunctions quantifies the effect of age and clinical designation on the location\nof the peak alpha frequency (PAF).\n",
  "subjects": [
    "Statistics/Methodology",
    "Statistics/Applications"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "dydJBJB4e2IpcCb4yGAtATeiUH5-dqQ2MQ71Wt6Zh2A",
  "pdfSize": "1394422"
}