{
  "id": "2412.17248",
  "title": "Taming Imbalance and Complexity in WAN Traffic Engineering",
  "authors": "Yufeng Xin, Sajith Sasidharam, Cong Wang, and Mert Cevik",
  "authorsParsed": [
    [
      "Xin",
      "Yufeng",
      ""
    ],
    [
      "Sasidharam",
      "Sajith",
      ""
    ],
    [
      "Wang",
      "Cong",
      ""
    ],
    [
      "Cevik",
      "Mert",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 03:40:08 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734925208000,
  "abstract": "  The rapid expansion of global cloud infrastructures, coupled with the growing\nvolume and complexity of network traffic, has fueled active research into\nscalable and resilient Traffic Engineering (TE) solutions for Wide Area\nNetworks (WANs). Despite recent advancements, achieving an optimal balance\nbetween solution quality and computational complexity remains a significant\nchallenge, especially for larger WAN topologies under dynamic traffic demands\nand stringent resource constraints.\n  This paper presents empirical evidence of a critical shortcoming in existing\nTE solutions: their oversight inadequately accounting for traffic demand\nheterogeneities and link utilization imbalances. We identify key factors\ncontributing to these issues, including traffic distribution, solver selection,\nresiliency, and resource overprovisioning. To address these gaps, we propose a\nholistic solution featuring new performance metrics and a novel resilient TE\nalgorithm. The proposed metrics, critical link set and network criticality,\nprovide a more comprehensive assessment of resilient TE solutions, while the\ntunnel-based TE algorithm dynamically adapts to changing traffic demands.\n  Through extensive simulations on diverse WAN topologies, we demonstrate that\nthis holistic solution significantly improves network performance, achieving a\nsuperior balance across key objectives. This work represents a significant\nadvancement in the development of resilient and scalable TE solutions for WANs.\n",
  "subjects": [
    "Computer Science/Networking and Internet Architecture"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "bvHfROaPwPWhwKCd8CaVDEHfV615dz6uNJuUPtVWfEg",
  "pdfSize": "904851"
}