{
  "id": "2412.17809",
  "title": "Measurements of the quantum geometric tensor in solids",
  "authors": "Mingu Kang, Sunje Kim, Yuting Qian, Paul M. Neves, Linda Ye, Junseo\n  Jung, Denny Puntel, Federico Mazzola, Shiang Fang, Chris Jozwiak, Aaron\n  Bostwick, Eli Rotenberg, Jun Fuji, Ivana Vobornik, Jae-Hoon Park, Joseph G.\n  Checkelsky, Bohm-Jung Yang, Riccardo Comin",
  "authorsParsed": [
    [
      "Kang",
      "Mingu",
      ""
    ],
    [
      "Kim",
      "Sunje",
      ""
    ],
    [
      "Qian",
      "Yuting",
      ""
    ],
    [
      "Neves",
      "Paul M.",
      ""
    ],
    [
      "Ye",
      "Linda",
      ""
    ],
    [
      "Jung",
      "Junseo",
      ""
    ],
    [
      "Puntel",
      "Denny",
      ""
    ],
    [
      "Mazzola",
      "Federico",
      ""
    ],
    [
      "Fang",
      "Shiang",
      ""
    ],
    [
      "Jozwiak",
      "Chris",
      ""
    ],
    [
      "Bostwick",
      "Aaron",
      ""
    ],
    [
      "Rotenberg",
      "Eli",
      ""
    ],
    [
      "Fuji",
      "Jun",
      ""
    ],
    [
      "Vobornik",
      "Ivana",
      ""
    ],
    [
      "Park",
      "Jae-Hoon",
      ""
    ],
    [
      "Checkelsky",
      "Joseph G.",
      ""
    ],
    [
      "Yang",
      "Bohm-Jung",
      ""
    ],
    [
      "Comin",
      "Riccardo",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 18:59:09 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734980349000,
  "abstract": "  Understanding the geometric properties of quantum states and their\nimplications in fundamental physical phenomena is at the core of modern\nphysics. The Quantum Geometric Tensor (QGT) is a central physical object in\nthis regard, encoding complete information about the geometry of the quantum\nstate. The imaginary part of the QGT is the well-known Berry curvature, which\nplays a fundamental role in the topological magnetoelectric and optoelectronic\nphenomena. The real part of the QGT is the quantum metric, whose importance has\ncome to prominence very recently, giving rise to a new set of quantum geometric\nphenomena, such as anomalous Landau levels, flat band superfluidity, excitonic\nLamb shifts, and nonlinear Hall effect. Despite the central importance of the\nQGT, its experimental measurements have been restricted only to artificial\ntwo-level systems. In this work, we develop a framework to measure the QGT\n(both quantum metric and Berry curvature) in crystalline solids using\npolarization-, spin-, and angle-resolved photoemission spectroscopy. Using this\nframework, we demonstrate the effective reconstruction of the QGT in solids in\nthe archetype kagome metal CoSn, which hosts topological flat bands. The key\nidea is to introduce another geometrical tensor, the quasi-QGT, whose\ncomponents, the band Drude weight and orbital angular momentum, are\nexperimentally accessible and can be used for extracting the QGT. Establishing\nsuch a momentum- and energy-resolved spectroscopic probe of the QGT is poised\nto significantly advance our understanding of quantum geometric responses in a\nwide range of crystalline systems.\n",
  "subjects": [
    "Condensed Matter/Materials Science"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "E7mocHlnOk11Ro3kWTitZXf8oJ0CrvfjTWWX4iz6uOQ",
  "pdfSize": "2601261"
}