{
  "id": "2412.07163",
  "title": "Fast Occupancy Network",
  "authors": "Mingjie Lu, Yuanxian Huang, Ji Liu, Xingliang Huang, Dong Li, Jinzhang\n  Peng, Lu Tian, and Emad Barsoum",
  "authorsParsed": [
    [
      "Lu",
      "Mingjie",
      ""
    ],
    [
      "Huang",
      "Yuanxian",
      ""
    ],
    [
      "Liu",
      "Ji",
      ""
    ],
    [
      "Huang",
      "Xingliang",
      ""
    ],
    [
      "Li",
      "Dong",
      ""
    ],
    [
      "Peng",
      "Jinzhang",
      ""
    ],
    [
      "Tian",
      "Lu",
      ""
    ],
    [
      "Barsoum",
      "Emad",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 03:46:03 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733802363000,
  "abstract": "  Occupancy Network has recently attracted much attention in autonomous\ndriving. Instead of monocular 3D detection and recent bird's eye view(BEV)\nmodels predicting 3D bounding box of obstacles, Occupancy Network predicts the\ncategory of voxel in specified 3D space around the ego vehicle via transforming\n3D detection task into 3D voxel segmentation task, which has much superiority\nin tackling category outlier obstacles and providing fine-grained 3D\nrepresentation. However, existing methods usually require huge computation\nresources than previous methods, which hinder the Occupancy Network solution\napplying in intelligent driving systems. To address this problem, we make an\nanalysis of the bottleneck of Occupancy Network inference cost, and present a\nsimple and fast Occupancy Network model, which adopts a deformable 2D\nconvolutional layer to lift BEV feature to 3D voxel feature and presents an\nefficient voxel feature pyramid network (FPN) module to improve performance\nwith few computational cost. Further, we present a cost-free 2D segmentation\nbranch in perspective view after feature extractors for Occupancy Network\nduring inference phase to improve accuracy. Experimental results demonstrate\nthat our method consistently outperforms existing methods in both accuracy and\ninference speed, which surpasses recent state-of-the-art (SOTA) OCCNet by 1.7%\nwith ResNet50 backbone with about 3X inference speedup. Furthermore, our method\ncan be easily applied to existing BEV models to transform them into Occupancy\nNetwork models.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "VInhxCojodVfxy6ktN52rctb4g1p3jls8n4bKN-9qr8",
  "pdfSize": "1800415"
}