{"id":"2412.01268","title":"Ponder & Press: Advancing Visual GUI Agent towards General Computer\n  Control","authors":"Yiqin Wang, Haoji Zhang, Jingqi Tian, Yansong Tang","authorsParsed":[["Wang","Yiqin",""],["Zhang","Haoji",""],["Tian","Jingqi",""],["Tang","Yansong",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 08:35:31 GMT"}],"updateDate":"2024-12-03","timestamp":1733128531000,"abstract":"  Most existing GUI agents typically depend on non-vision inputs like HTML\nsource code or accessibility trees, limiting their flexibility across diverse\nsoftware environments and platforms. Current multimodal large language models\n(MLLMs), which excel at using vision to ground real-world objects, offer a\npotential alternative. However, they often struggle with accurately localizing\nGUI elements -- a critical requirement for effective GUI automation -- due to\nthe semantic gap between real-world objects and GUI elements. In this work, we\nintroduce Ponder & Press, a divide-and-conquer framework for general computer\ncontrol using only visual input. Our approach combines an general-purpose MLLM\nas an 'interpreter', responsible for translating high-level user instructions\ninto detailed action descriptions, with a GUI-specific MLLM as a 'locator' that\nprecisely locates GUI elements for action placement. By leveraging a purely\nvisual input, our agent offers a versatile, human-like interaction paradigm\napplicable to a wide range of applications. Ponder & Press locator outperforms\nexisting models by +22.5% on the ScreenSpot GUI grounding benchmark. Both\noffline and interactive agent benchmarks across various GUI environments --\nincluding web pages, desktop software, and mobile UIs -- demonstrate that\nPonder & Press framework achieves state-of-the-art performance, highlighting\nthe potential of visual GUI agents. Refer to the project homepage\nhttps://invinciblewyq.github.io/ponder-press-page/\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"TfFi3IehMYLHkqknkrZLyfIxevgpnNYFaShxc_Ti1pA","pdfSize":"3426683"}