{"id":"2412.17110","title":"Deep Joint Source Channel Coding for Secure End-to-End Image\n  Transmission","authors":"Mehdi Letafati, Seyyed Amirhossein Ameli Kalkhoran, Ecenaz Erdemir,\n  Babak Hossein Khalaj, Hamid Behroozi, and Deniz G\\\"und\\\"uz","authorsParsed":[["Letafati","Mehdi",""],["Kalkhoran","Seyyed Amirhossein Ameli",""],["Erdemir","Ecenaz",""],["Khalaj","Babak Hossein",""],["Behroozi","Hamid",""],["Gündüz","Deniz",""]],"versions":[{"version":"v1","created":"Sun, 22 Dec 2024 17:55:41 GMT"}],"updateDate":"2024-12-24","timestamp":1734890141000,"abstract":"  Deep neural network (DNN)-based joint source and channel coding is proposed\nfor end-to-end secure image transmission against multiple eavesdroppers. Both\nscenarios of colluding and non-colluding eavesdroppers are considered. Instead\nof idealistic assumptions of perfectly known and i.i.d. source and channel\ndistributions, the proposed scheme assumes unknown source and channel\nstatistics. The goal is to transmit images with minimum distortion, while\nsimultaneously preventing eavesdroppers from inferring private attributes of\nimages. Simultaneously generalizing the ideas of privacy funnel and wiretap\ncoding, a multi-objective optimization framework is expressed that\ncharacterizes the trade-off between image reconstruction quality and\ninformation leakage to eavesdroppers, taking into account the structural\nsimilarity index (SSIM) for improving the perceptual quality of image\nreconstruction. Extensive experiments over CIFAR-10 and CelebFaces Attributes\n(CelebA) datasets, together with ablation studies are provided to highlight the\nperformance gain in terms of SSIM, adversarial accuracy, and cross-entropy\nmetric compared with benchmarks. Experiments show that the proposed scheme\nrestrains the adversarially-trained eavesdroppers from intercepting privatized\ndata for both cases of eavesdropping a common secret, as well as the case in\nwhich eavesdroppers are interested in different secrets. Furthermore, useful\ninsights on the privacy-utility trade-off are also provided.\n","subjects":["Computer Science/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"ai22O38WsSLR1hvojvL7LQN_BE_Pjwdqoop0IEwMWug","pdfSize":"4027091"}