{"id":"2412.09583","title":"Gradient-Boosted Mixture Regression Models for Postprocessing Ensemble\n  Weather Forecasts","authors":"David Jobst","authorsParsed":[["Jobst","David",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 18:54:56 GMT"}],"updateDate":"2024-12-13","timestamp":1734029696000,"abstract":"  Nowadays, weather forecasts are commonly generated by ensemble forecasts\nbased on multiple runs of numerical weather prediction models. However, such\nforecasts are usually miscalibrated and/or biased, thus require statistical\npostprocessing. Non-homogeneous regression models, such as the ensemble model\noutput statistics are frequently applied to correct these forecasts.\nNonetheless, these methods often rely on the assumption of an unimodal\nparametric distribution, leading to improved, but sometimes not fully\ncalibrated forecasts. To address this issue, a mixture regression model is\npresented, where the ensemble forecasts of each exchangeable group are linked\nto only one mixture component and mixture weight, called mixture of model\noutput statistics (MIXMOS). In order to remove location specific effects and to\nuse a longer training data, the standardized anomalies of the response and the\nensemble forecasts are employed for the mixture of standardized anomaly model\noutput statistics (MIXSAMOS). As carefully selected covariates, e.g. from\ndifferent weather variables, can enhance model performance, the non-cyclic\ngradient-boosting algorithm for mixture regression models is introduced.\nFurthermore, MIXSAMOS is extended by this gradient-boosting algorithm\n(MIXSAMOS-GB) providing an automatic variable selection. The novel mixture\nregression models substantially outperform state-of-the-art postprocessing\nmodels in a case study for 2m surface temperature forecasts in Germany.\n","subjects":["Statistics/Applications"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"D43ke2AFlDHJp4DVKwxJ0IBcBSlRp_Cr8d_WgRx0mUk","pdfSize":"2948367"}