{
  "id": "2412.02937",
  "title": "Orbital anomalous Hall effect in the few-layer Weyl semimetal TaIrTe4",
  "authors": "An-Qi Wang, Dong Li, Tong-Yang Zhao, Xing-Yu Liu, Jiantian Zhang, Xin\n  Liao, Qing Yin, Zhen-Cun Pan, Peng Yu, Zhi-Min Liao",
  "authorsParsed": [
    [
      "Wang",
      "An-Qi",
      ""
    ],
    [
      "Li",
      "Dong",
      ""
    ],
    [
      "Zhao",
      "Tong-Yang",
      ""
    ],
    [
      "Liu",
      "Xing-Yu",
      ""
    ],
    [
      "Zhang",
      "Jiantian",
      ""
    ],
    [
      "Liao",
      "Xin",
      ""
    ],
    [
      "Yin",
      "Qing",
      ""
    ],
    [
      "Pan",
      "Zhen-Cun",
      ""
    ],
    [
      "Yu",
      "Peng",
      ""
    ],
    [
      "Liao",
      "Zhi-Min",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 01:11:33 GMT"
    }
  ],
  "updateDate": "2024-12-05",
  "timestamp": 1733274693000,
  "abstract": "  We report on the observation of the linear anomalous Hall effect (AHE) in the\nnonmagnetic Weyl semimetal TaIrTe4. This is achieved by applying a direct\ncurrent Idc and an alternating current Iac (Iac<<Idc) in TaIrTe4, where the\nformer induces time-reversal symmetry breaking and the latter probes the\ntriggered AHE. The anomalous Hall resistance VacH/Iac shows a linear dependence\non Idc and changes sign with the polarity of Idc. In temperature-dependent\nmeasurements, VacH/Iac also experiences a sign reversal at 100 K, consistent\nwith the temperature-dependent nonlinear Hall effect (NLHE). Furthermore, in\nmeasurements involving only dc transport, the dc Hall voltage exhibits a\nquadratic relationship with Idc. When the Idc direction is reversed, the Hall\nresistance changes sign, demonstrating a colossal nonreciprocal Hall effect\n(NRHE). Our theoretical calculations suggest that the observed linear AHE,\nNLHE, and NRHE all dominantly originate from the current-induced orbital\nmagnetization compared to the minor spin contribution. This work provides deep\ninsights into the orbital magnetoelectric effect and nonlinear Hall response,\npromising precise electric control of out-of-plane polarized orbit flow.\n",
  "subjects": [
    "Condensed Matter/Mesoscale and Nanoscale Physics",
    "Condensed Matter/Materials Science"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "BGYHAQZzxfu5buErOt6t2DV6UF1nr1E_K3or2c1yrOw",
  "pdfSize": "2298105"
}