{"id":"2412.06621","title":"Shocked POststarburst Galaxy Survey. IV. Outflows in Shocked\n  Post-Starburst Galaxies Are Not Responsible For Quenching","authors":"Antoniu Fodor, Taylor Tomko, Mary Braun, Anne M. Medling, Thomas M.\n  Johnson, Alexander Thompson, Victor D. Johnston, Matthew Newhouse, Yuanze\n  Luo, K. Decker French, Justin A. Otter, Akshat Tripathi, Margaret E. Verrico,\n  Katherine Alatalo, Kate Rowlands, and Timothy Heckman","authorsParsed":[["Fodor","Antoniu",""],["Tomko","Taylor",""],["Braun","Mary",""],["Medling","Anne M.",""],["Johnson","Thomas M.",""],["Thompson","Alexander",""],["Johnston","Victor D.",""],["Newhouse","Matthew",""],["Luo","Yuanze",""],["French","K. Decker",""],["Otter","Justin A.",""],["Tripathi","Akshat",""],["Verrico","Margaret E.",""],["Alatalo","Katherine",""],["Rowlands","Kate",""],["Heckman","Timothy",""]],"versions":[{"version":"v1","created":"Mon, 9 Dec 2024 16:14:25 GMT"}],"updateDate":"2024-12-10","timestamp":1733760865000,"abstract":"  Shocked POst-starburst Galaxies (SPOGs) exhibit both emission lines\nsuggestive of shock-heated gas and post-starburst-like stellar absorption,\nresulting in a unique subset for galaxy evolution studies. We have observed 77\ngalaxies that fulfilled the SPOGs criteria selection using the DeVeny\nSpectrograph on the Lowell Discovery Telescope. Our long-slit minor axis\nspectra detect H$\\alpha$ and [O III] in some SPOGs out to 6 kpc above the\ngalactic plane. We find extraplanar ionized gas in 31 targets of our sample\noverall. Using their internal and external kinematics, we argue that 22\ngalaxies host outflows with ionized gas masses ranging from $10^2 M_{\\odot}$ to\n$10^5 M_{\\odot}$. The rest are likely extended diffuse ionized gas. A positive\ncorrelation exists between AGN luminosity and the extraplanar gas extent,\nvelocity dispersion, and mass$\\unicode{x2013}\\unicode{x2013}$suggesting that\nthe AGN may indeed drive the outflows detected in AGN hosts. The low masses of\nthe extraplanar gas suggest that these outflows are not depleting each galaxy's\ngas reserves. The outflows, therefore, are not likely a significant quenching\nmechanism in these SPOGs.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"JiQfTtI9Rva29psaobwPs1xf44NnIVcinbWiw9wBenk","pdfSize":"1582858"}