{
  "id": "2412.12084",
  "title": "DarkNESS: developing a skipper-CCD instrument to search for Dark Matter\n  from Low Earth Orbit",
  "authors": "Phoenix Alpine, Samriddhi Bhatia, Fernando Chierchie, Alex\n  Drlica-Wagner, Rouven Essig, Juan Estrada, Erez Etzion, Roni Harnik, Michael\n  Lembeck, Nathan Saffold, Sho Uemura",
  "authorsParsed": [
    [
      "Alpine",
      "Phoenix",
      ""
    ],
    [
      "Bhatia",
      "Samriddhi",
      ""
    ],
    [
      "Chierchie",
      "Fernando",
      ""
    ],
    [
      "Drlica-Wagner",
      "Alex",
      ""
    ],
    [
      "Essig",
      "Rouven",
      ""
    ],
    [
      "Estrada",
      "Juan",
      ""
    ],
    [
      "Etzion",
      "Erez",
      ""
    ],
    [
      "Harnik",
      "Roni",
      ""
    ],
    [
      "Lembeck",
      "Michael",
      ""
    ],
    [
      "Saffold",
      "Nathan",
      ""
    ],
    [
      "Uemura",
      "Sho",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 18:55:12 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734375312000,
  "abstract": "  The DarkNESS (Dark Matter Nano-satellite Equipped with Skipper Sensors)\nmission aims to deploy a skipper-CCD CubeSat Observatory to search for dark\nmatter (DM) from Low Earth Orbit. This mission will employ novel skipper-CCDs\nto investigate O(keV) X-rays from decaying DM, as well as electron recoils from\nstrongly-interacting sub-GeV DM. The DarkNESS mission will be the first space\ndeployment of skipper-CCDs, and the DarkNESS team is developing a skipper-CCD\ninstrument that is compatible with the CubeSat platform. DarkNESS has recently\nprogressed from laboratory validation to a Critical Design Review (CDR) phase,\nwith a launch opportunity anticipated in late 2025. The implementation of the\nDarkNESS skipper-CCD payload on the CubeSat platform will pave the way for\nfuture demonstrators of space-based imagers for X-ray and single-electron\ncounting applications.\n",
  "subjects": [
    "Astrophysics/Instrumentation and Methods for Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "_T7ucXoHnbFa6R3RMOLko0A07pPjKuSTJK6C__MQFBs",
  "pdfSize": "3206838"
}