{"id":"2412.02389","title":"Fast ground-to-air transition with avian-inspired multifunctional legs","authors":"Won Dong Shin, Hoang-Vu Phan, Monica A. Daley, Auke J. Ijspeert, Dario\n  Floreano","authorsParsed":[["Shin","Won Dong",""],["Phan","Hoang-Vu",""],["Daley","Monica A.",""],["Ijspeert","Auke J.",""],["Floreano","Dario",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 11:31:25 GMT"}],"updateDate":"2024-12-06","timestamp":1733225485000,"abstract":"  Most birds can navigate seamlessly between aerial and terrestrial\nenvironments. Whereas the forelimbs evolved into wings primarily for flight,\nthe hindlimbs serve diverse functions such as walking, hopping, and leaping,\nand jumping take-off for transitions into flight. These capabilities have\ninspired engineers to aim for similar multi-modality in aerial robots,\nexpanding their range of applications across diverse environments. However,\nchallenges remain in reproducing multi-modal locomotion, across gaits with\ndistinct kinematics and propulsive characteristics, such as walking and\njumping, while preserving lightweight mass for flight. This tradeoff between\nmechanical complexity and versatility limits most existing aerial robots to\nonly one additional locomotor mode. Here, we overcome the\ncomplexity-versatility tradeoff with RAVEN (Robotic Avian-inspired Vehicle for\nmultiple ENvironments), which uses its bird-inspired multi-functional legs to\njump rapidly into flight, walk on ground and hop over obstacles and gaps\nsimilar to the multi-modal locomotion of birds. We show that jumping for\ntake-off contributes substantially to initial flight take-off speed and,\nremarkably, that it is more energy-efficient than solely propeller-based\ntake-off. Our analysis suggests an important tradeoff in mass distribution\nbetween legs and body among birds adapted for different locomotor strategies,\nwith greater investment in leg mass among terrestrial birds with multi-modal\ngait demands. Multi-functional robot legs expand opportunities to deploy\ntraditional fixed-wing aircraft in complex terrains through autonomous\ntake-offs and multi-modal gaits.\n","subjects":["Computer Science/Robotics","Computer Science/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"Hf9JYBB-FzV7tZ3Ju2A7tFQm7ug7f3s2qRY0X7sDAZ4","pdfSize":"18731562"}