{
  "id": "2412.01693",
  "title": "Beyond the Long Wavelength Approximation: Next-generation\n  Gravitational-Wave Detectors and Frequency-dependent Antenna Patterns",
  "authors": "Andrea Virtuoso, Edoardo Milotti",
  "authorsParsed": [
    [
      "Virtuoso",
      "Andrea",
      ""
    ],
    [
      "Milotti",
      "Edoardo",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 16:37:23 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733157443000,
  "abstract": "  The response of a gravitational-wave (GW) interferometer is spatially\nmodulated and is described by two antenna patterns, one for each polarization\nstate of the waves. The antenna patterns are derived from the shape and size of\nthe interferometer, usually under the assumption that the interferometer size\nis much smaller than the wavelength of the gravitational waves (long wavelength\napproximation, LWA). This assumption is well justified as long as the frequency\nof the gravitational waves is well below the free spectral range (FSR) of the\nFabry-Perot cavities in the interferometer arms as it happens for current\ninterferometers ($\\mathrm{FSR}=37.5$~kHz for the LIGO interferometers and\n$\\mathrm{FSR}=50$~kHz for Virgo and KAGRA). However, the LWA can no longer be\ntaken for granted with third--generation instruments (Einstein Telescope,\nCosmic Explorer and LISA) because of their longer arms. This has been known for\nsome time, and previous analyses have mostly been carried out in the frequency\ndomain. In this paper, we explore the behavior of the frequency--dependent\nantenna patterns in the time domain and in the time--frequency domain, with\nspecific reference to the searches of short GW transients. We analyze the\nprofound changes in the concept of Dominant Polarization Frame, which must be\ngeneralized in a nontrivial way, we show that the conventional likelihood-based\nanalysis of coherence in different interferometers can no longer be applied as\nin current analysis pipelines, and that methods based on the null stream in\ntriangular (60{\\deg}) interferometers no longer work. Overall, this paper\nestablishes methods and tools that can be used to overcome these difficulties\nin the unmodeled analysis of short GW transients.\n",
  "subjects": [
    "Physics/General Relativity and Quantum Cosmology"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "74PoEkjJgjG4nTEW8r5PmjNcNqkrJQ6RtPObNUhMIv0",
  "pdfSize": "16528198"
}