{"id":"2412.09307","title":"Friday the 13th Hailstorm in the province of Bulacan, Philippines (13\n  August 2021): A Case Study","authors":"Generich H. Capuli","authorsParsed":[["Capuli","Generich H.",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 14:24:01 GMT"},{"version":"v2","created":"Sun, 15 Dec 2024 11:35:56 GMT"}],"updateDate":"2024-12-17","timestamp":1734013441000,"abstract":"  This case study presents a thorough investigation of the environmental setup\nthat led to the hail-producing severe storm that impacted the municipality of\nNorzagaray and City of San Jose Del Monte, including other nearby areas, in the\nprovince of Bulacan on the afternoon of August 13, 2021. During this period,\n2-5 cm and potentially as large as $\\sim$8 cm diameter hail was reported over\nthese locations of Bulacan. For this purpose, the combination of HIMAWARI-8\nAHI, PLDN and its flash counts, and meteorological indices; synoptic,\nthermodynamic, and kinematic indices, calculated from the ERA5 reanalysis are\nutilized to understand the nature of the hail event. In the morning, the\npre-convective environment was comprised by a warm inversion layer that\ninhibited storm initiation, until the arrival of ample moisture and convective\nheating in the afternoon. By the afternoon, model sounding analysis revealed\nthat the environment transitioned into uncapped profile with steep low-level\nlapse rate owing to warm, moist south-westerly wind flow from the Manila Bay in\nthe lower troposphere and north-easterlies aloft crossing the SMMR induced by a\nweak low-pressure system located in the eastern Philippine Sea, with minimal\nturning on the wind profile. This promoted low-level convergence within the\narea of interest and build up of instability. The updraft associated with\nconvectively unstable atmosphere, sufficient cloud-layer bulk shear, and storm\nnudging at its maturing phase countered entrainment-driven dilution and aided\nthe growth of ice crystals by rapid collection of supercooled cloud liquid\nparticles, which ultimately led to formation of hailstones.\n","subjects":["Physics/Atmospheric and Oceanic Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"X9Tgkgj0NdBToBpPaGhlkHzaWhEfzrM2Xi0xUyx67E8","pdfSize":"60723024"}