{
  "id": "2412.19631",
  "title": "Primordial Black Hole Formation from the Upward Step Model: Avoiding\n  Overproduction",
  "authors": "Xiaoding Wang, Xiao-Han Ma, Yi-Fu Cai",
  "authorsParsed": [
    [
      "Wang",
      "Xiaoding",
      ""
    ],
    [
      "Ma",
      "Xiao-Han",
      ""
    ],
    [
      "Cai",
      "Yi-Fu",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 27 Dec 2024 13:21:06 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735305666000,
  "abstract": "  We investigate the formation of primordial black holes (PBHs) in an upward\nstep inflationary model, where nonlinearities between curvature perturbations\nand field fluctuations introduce a cutoff, deviating from the Gaussian case.\nThis necessitates a reevaluation of PBH formation, as $\\mathcal{R}$ is not the\noptimal variable for estimating abundance. Using the extended Press-Schechter\nformalism, we show that non-Gaussianity modifies both the curvature\nperturbation profile $\\mathcal{R}(r)$ and the integration path in probability\nspace, significantly impacting PBH abundance. Our results reveal that the\nabundance initially increases with the parameter $h$, which characterizes the\nrelaxation stage after the step. However, beyond a critical value ($h \\simeq\n5.9$), it sharply declines before rising again. Furthermore, we demonstrate\nthat non-Gaussianity introduces uncertainties in indirect PBH observations via\ngravitational waves. Notably, we present an example where a positive $f_{\\rm\nNL}$ does not necessarily enhance PBH production, contrary to conventional\nexpectations. Finally, by accounting for non-perturbative effects, we resolve\nthe overproduction of PBHs suggested by pulsar timing array (PTA) data,\nunderscoring the critical importance of incorporating non-Gaussianity in future\nstudies.\n",
  "subjects": [
    "Astrophysics/Cosmology and Nongalactic Astrophysics",
    "Physics/General Relativity and Quantum Cosmology"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "--frbOvGzydwl1cVRDrtGvAxfdItqdz6x7GSzNODdXo",
  "pdfSize": "2277252"
}