{
  "id": "2412.05979",
  "title": "Consciousness-Centered Ontology of Relational Quantum Dynamics (RQD)",
  "authors": "Arash E. Zaghi",
  "authorsParsed": [
    [
      "Zaghi",
      "Arash E.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 8 Dec 2024 15:57:31 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733673451000,
  "abstract": "  This paper presents Relational Quantum Dynamics (RQD), a paradigm that\nre-envisions quantum theory and its interplay with spacetime, observers, and\nconsciousness. Abandoning the notion of a preexisting universe or fixed\nmanifold, RQD posits that observers, observed systems, and geometric structures\nemerge together as stable relational patterns in an underlying quantum\nsubstrate. Spacetime is thus recast as an effective, large-scale feature of\nentanglement and information flows rather than a fundamental stage. By\neliminating pre-given observers and absolute properties, RQD unifies relational\nquantum mechanics, insights from holography and tensor networks, and non-dual\nphilosophical traditions into a single idealist framework. Here, universal\nawareness is not an added element but the ontological ground, ensuring that\nsubjective experience and physical reality co-derive from the same relational\nfield. This approach not only demystifies the \"hard problem\" of consciousness,\nmaking it intrinsic rather than emergent but also resolves longstanding quantum\npuzzles, such as Wigner's friend and Frauchiger-Renner scenarios, by showing\nthat no absolute vantage point or objective collapse is required. In\nharmonizing quantum theory, emergent geometry, and a fundamental\nawareness-based ontology, RQD reveals that quantum mechanics, gravity, and\nconsciousness are facets of a single, integrated reality.\n",
  "subjects": [
    "Physics/Quantum Physics",
    "Physics/History and Philosophy of Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "33K51wuPN-rM-FAfTwlygHtHRtYgNTBdzELdKELzTqA",
  "pdfSize": "460296"
}