{
  "id": "2412.05171",
  "title": "Baseband control of single-electron silicon spin qubits in two\n  dimensions",
  "authors": "Florian K. Unseld, Brennan Undseth, Eline Raymenants, Yuta Matsumoto,\n  Saurabh Karwal, Oriol Pietx-Casas, Alexander S. Ivlev, Marcel Meyer, Amir\n  Sammak, Menno Veldhorst, Giordano Scappucci, Lieven M. K. Vandersypen",
  "authorsParsed": [
    [
      "Unseld",
      "Florian K.",
      ""
    ],
    [
      "Undseth",
      "Brennan",
      ""
    ],
    [
      "Raymenants",
      "Eline",
      ""
    ],
    [
      "Matsumoto",
      "Yuta",
      ""
    ],
    [
      "Karwal",
      "Saurabh",
      ""
    ],
    [
      "Pietx-Casas",
      "Oriol",
      ""
    ],
    [
      "Ivlev",
      "Alexander S.",
      ""
    ],
    [
      "Meyer",
      "Marcel",
      ""
    ],
    [
      "Sammak",
      "Amir",
      ""
    ],
    [
      "Veldhorst",
      "Menno",
      ""
    ],
    [
      "Scappucci",
      "Giordano",
      ""
    ],
    [
      "Vandersypen",
      "Lieven M. K.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 16:42:47 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733503367000,
  "abstract": "  Micromagnet-enabled electric-dipole spin resonance (EDSR) is an established\nmethod of high-fidelity single-spin control in silicon. However, the resulting\narchitectural limitations have restrained silicon quantum processors to\none-dimensional arrays, and heating effects from the associated microwave\ndissipation exacerbates crosstalk during multi-qubit operations. In contrast,\nqubit control based on hopping spins has recently emerged as a compelling\nprimitive for high-fidelity baseband control in sparse two-dimensional hole\narrays in germanium. In this work, we commission a $^{28}$Si/SiGe 2x2 quantum\ndot array both as a four-qubit device with pairwise exchange interactions using\nestablished EDSR techniques and as a two-qubit device using baseband hopping\ncontrol. In this manner, we can evaluate the two modes of operation in terms of\nfidelity, coherence, and crosstalk. We establish a lower bound on the fidelity\nof the hopping gate of 99.50(6)%, which is similar to the average fidelity of\nthe resonant gate of 99.54(4)%. Lowering the external field to reach the\nhopping regime nearly doubles the measured $T_2^{\\mathrm{H}}$, suggesting a\nreduced coupling to charge noise. Finally, the hopping gate circumvents the\ntransient pulse-induced resonance shift. To further motivate the hopping gate\napproach as an attractive means of scaling silicon spin-qubit arrays, we\npropose an extensible nanomagnet design that enables engineered baseband\ncontrol of large spin arrays.\n",
  "subjects": [
    "Condensed Matter/Mesoscale and Nanoscale Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "qbnPLT12arEKlIC27uldJbdojnX59b4PMMNJ_XYHn-k",
  "pdfSize": "26806188"
}