{
  "id": "2412.12697",
  "title": "Colossal optical anisotropy in wide-bandgap semiconductor CuAlO2",
  "authors": "Baekjune Kang, Junhee Shin, Myeongjun Kang, Uksam Choi, Uihyeon Seo,\n  Kunook Chung, Jong Mok Ok, Hosub Jin, and Changhee Sohn",
  "authorsParsed": [
    [
      "Kang",
      "Baekjune",
      ""
    ],
    [
      "Shin",
      "Junhee",
      ""
    ],
    [
      "Kang",
      "Myeongjun",
      ""
    ],
    [
      "Choi",
      "Uksam",
      ""
    ],
    [
      "Seo",
      "Uihyeon",
      ""
    ],
    [
      "Chung",
      "Kunook",
      ""
    ],
    [
      "Ok",
      "Jong Mok",
      ""
    ],
    [
      "Jin",
      "Hosub",
      ""
    ],
    [
      "Sohn",
      "Changhee",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 09:16:19 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734426979000,
  "abstract": "  Colossal optical anisotropy in the entire visible spectrum is crucial for\nadvanced photonic applications, enabling precise light manipulation without\noptical loss across a broad spectral range. Here, we demonstrate that CuAlO2\nexhibits colossal optical anisotropy and transparency across the visible\nspectrum, enabled by its unique three-dimensional O-Cu-O dumbbell structure and\ntwo-dimensionally confined excitons. Using mm-sized single crystals, we\nindependently measured ab-plane and c-axis optical properties, revealing\nmaximum birefringence (= 3.67) and linear dichroism (= 5.21), the highest\nreported to date. CuAlO2 retains birefringence over 0.5 throughout the entire\nvisible range and possesses a wide direct bandgap of 3.71 eV, surpassing the\nbirefringence of commercial anisotropic crystals transparent in the visible\nspectrum. From the two-dimensional screened hydrogen model and first-principles\ncalculations, we demonstrate that the colossal anisotropy arises from a unique\nexcitonic Cu d-p transition confined to the atomic-thick layer. This colossal\noptical anisotropy and transparency across the entire visible spectrum makes\nCuAlO2 a promising candidate for future photonic technologies.\n",
  "subjects": [
    "Condensed Matter/Materials Science"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "0FQ-5ncVRex-5nRr2hqHvy_zwTUhURn56nkph03D7C0",
  "pdfSize": "1511789"
}