{
  "id": "2412.14779",
  "title": "Agent-Temporal Credit Assignment for Optimal Policy Preservation in\n  Sparse Multi-Agent Reinforcement Learning",
  "authors": "Aditya Kapoor, Sushant Swamy, Kale-ab Tessera, Mayank Baranwal,\n  Mingfei Sun, Harshad Khadilkar, Stefano V. Albrecht",
  "authorsParsed": [
    [
      "Kapoor",
      "Aditya",
      ""
    ],
    [
      "Swamy",
      "Sushant",
      ""
    ],
    [
      "Tessera",
      "Kale-ab",
      ""
    ],
    [
      "Baranwal",
      "Mayank",
      ""
    ],
    [
      "Sun",
      "Mingfei",
      ""
    ],
    [
      "Khadilkar",
      "Harshad",
      ""
    ],
    [
      "Albrecht",
      "Stefano V.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 12:05:13 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734609913000,
  "abstract": "  In multi-agent environments, agents often struggle to learn optimal policies\ndue to sparse or delayed global rewards, particularly in long-horizon tasks\nwhere it is challenging to evaluate actions at intermediate time steps. We\nintroduce Temporal-Agent Reward Redistribution (TAR$^2$), a novel approach\ndesigned to address the agent-temporal credit assignment problem by\nredistributing sparse rewards both temporally and across agents. TAR$^2$\ndecomposes sparse global rewards into time-step-specific rewards and calculates\nagent-specific contributions to these rewards. We theoretically prove that\nTAR$^2$ is equivalent to potential-based reward shaping, ensuring that the\noptimal policy remains unchanged. Empirical results demonstrate that TAR$^2$\nstabilizes and accelerates the learning process. Additionally, we show that\nwhen TAR$^2$ is integrated with single-agent reinforcement learning algorithms,\nit performs as well as or better than traditional multi-agent reinforcement\nlearning methods.\n",
  "subjects": [
    "Computer Science/Multiagent Systems",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Computer Science and Game Theory",
    "Computer Science/Machine Learning",
    "Computer Science/Robotics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "8iyDYRykxwiN_HYxJQLHO-YUGGG64eHm8sDYmbdM8-M",
  "pdfSize": "6479380"
}