{
  "id": "2412.07193",
  "title": "Epidemiological Model Calibration via Graybox Bayesian Optimization",
  "authors": "Puhua Niu, Byung-Jun Yoon, Xiaoning Qian",
  "authorsParsed": [
    [
      "Niu",
      "Puhua",
      ""
    ],
    [
      "Yoon",
      "Byung-Jun",
      ""
    ],
    [
      "Qian",
      "Xiaoning",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 05:04:52 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733807092000,
  "abstract": "  In this study, we focus on developing efficient calibration methods via\nBayesian decision-making for the family of compartmental epidemiological\nmodels. The existing calibration methods usually assume that the compartmental\nmodel is cheap in terms of its output and gradient evaluation, which may not\nhold in practice when extending them to more general settings. Therefore, we\nintroduce model calibration methods based on a \"graybox\" Bayesian optimization\n(BO) scheme, more efficient calibration for general epidemiological models.\nThis approach uses Gaussian processes as a surrogate to the expensive model,\nand leverages the functional structure of the compartmental model to enhance\ncalibration performance. Additionally, we develop model calibration methods via\na decoupled decision-making strategy for BO, which further exploits the\ndecomposable nature of the functional structure. The calibration efficiencies\nof the multiple proposed schemes are evaluated based on various data generated\nby a compartmental model mimicking real-world epidemic processes, and\nreal-world COVID-19 datasets. Experimental results demonstrate that our\nproposed graybox variants of BO schemes can efficiently calibrate\ncomputationally expensive models and further improve the calibration\nperformance measured by the logarithm of mean square errors and achieve faster\nperformance convergence in terms of BO iterations. We anticipate that the\nproposed calibration methods can be extended to enable fast calibration of more\ncomplex epidemiological models, such as the agent-based models.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Statistics/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "rDeDTnMwI5Q17tPZrmYmW6FbPUlUyShs1C9KfR65bDk",
  "pdfSize": "988033"
}