{"id":"2412.01434","title":"Feasibility of Logical Bell State Generation in Memory Assisted Quantum\n  Networks","authors":"Vladlen Galetsky, Nilesh Vyas, Alberto Comin, Janis N\\\"otzel","authorsParsed":[["Galetsky","Vladlen",""],["Vyas","Nilesh",""],["Comin","Alberto",""],["Nötzel","Janis",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 12:16:28 GMT"},{"version":"v2","created":"Tue, 3 Dec 2024 09:09:35 GMT"}],"updateDate":"2024-12-04","timestamp":1733141788000,"abstract":"  This study explores the feasibility of utilizing quantum error correction\n(QEC) to generate and store logical Bell states in heralded quantum\nentanglement protocols, crucial for quantum repeater networks. Two novel\nlattice surgery-based protocols (local and non-local) are introduced to\nestablish logical Bell states between distant nodes using an intermediary node.\nIn the local protocol, the intermediary node creates and directly transmits the\nlogical Bell states to quantum memories. In contrast, the non-local protocol\ndistributes auxiliary Bell states, merging boundaries between pre-existing\ncodes in the quantum memories.\n  We simulate the protocols using realistic experimental parameters, including\ncavity-enhanced atomic frequency comb quantum memories and multimode\nfiber-optic noisy channels. The study evaluates rotated and planar surface\ncodes alongside Bacon-Shor codes for small code distances $(d = 3, 5)$ under\nstandard and realistic noise models. We observe pseudo-thresholds, indicating\nthat when physical error rates exceed approximately $p_{\\text{err}} \\sim\n10^{-3}$, QEC codes do not provide any benefit over using unencoded Bell\nstates. Moreover, to achieve an advantage over unencoded Bell states for a\ndistance of $1 \\, \\mathrm{km}$ between the end node and the intermediary, gate\nerror rates must be reduced by an order of magnitude $(0.1p_{\\text{err}_H}$,\n$0.1p_{\\text{err}_{CX}}$, and $0.1p_{\\text{err}_M}$), highlighting the need for\nsignificant hardware improvements to implement logical Bell state protocols\nwith quantum memories. Finally, both protocols were analyzed for their achieved\nrates, with the non-local protocol showing higher rates, ranging from $6.64 \\,\n\\mathrm{kHz}$ to $1.91 \\, \\mathrm{kHz}$, over distances of $1$ to $9 \\,\n\\mathrm{km}$ between the end node and the intermediary node.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ViGxxqgt8GFDuHxQwGy-ifIBXdfXekd_uxZSkMqzBpA","pdfSize":"948028"}