{
  "id": "2412.04948",
  "title": "KaLM: Knowledge-aligned Autoregressive Language Modeling via Dual-view\n  Knowledge Graph Contrastive Learning",
  "authors": "Peng Yu, Cheng Deng, Beiya Dai, Xinbing Wang, Ying Wen",
  "authorsParsed": [
    [
      "Yu",
      "Peng",
      ""
    ],
    [
      "Deng",
      "Cheng",
      ""
    ],
    [
      "Dai",
      "Beiya",
      ""
    ],
    [
      "Wang",
      "Xinbing",
      ""
    ],
    [
      "Wen",
      "Ying",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 11:08:24 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733483304000,
  "abstract": "  Autoregressive large language models (LLMs) pre-trained by next token\nprediction are inherently proficient in generative tasks. However, their\nperformance on knowledge-driven tasks such as factual knowledge querying\nremains unsatisfactory. Knowledge graphs (KGs), as high-quality structured\nknowledge bases, can provide reliable knowledge for LLMs, potentially\ncompensating for their knowledge deficiencies. Aligning LLMs with explicit,\nstructured knowledge from KGs has been a challenge; previous attempts either\nfailed to effectively align knowledge representations or compromised the\ngenerative capabilities of LLMs, leading to less-than-optimal outcomes. This\npaper proposes \\textbf{KaLM}, a \\textit{Knowledge-aligned Language Modeling}\napproach, which fine-tunes autoregressive LLMs to align with KG knowledge via\nthe joint objective of explicit knowledge alignment and implicit knowledge\nalignment. The explicit knowledge alignment objective aims to directly optimize\nthe knowledge representation of LLMs through dual-view knowledge graph\ncontrastive learning. The implicit knowledge alignment objective focuses on\nincorporating textual patterns of knowledge into LLMs through triple completion\nlanguage modeling. Notably, our method achieves a significant performance boost\nin evaluations of knowledge-driven tasks, specifically embedding-based\nknowledge graph completion and generation-based knowledge graph question\nanswering.\n",
  "subjects": [
    "Computer Science/Computation and Language",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "vJyXZhX2JSPWNP90QMd4uRjrm4dfNvgkYUc24paYll4",
  "pdfSize": "3942885"
}