{
  "id": "2412.03079",
  "title": "Align3R: Aligned Monocular Depth Estimation for Dynamic Videos",
  "authors": "Jiahao Lu, Tianyu Huang, Peng Li, Zhiyang Dou, Cheng Lin, Zhiming Cui,\n  Zhen Dong, Sai-Kit Yeung, Wenping Wang, Yuan Liu",
  "authorsParsed": [
    [
      "Lu",
      "Jiahao",
      ""
    ],
    [
      "Huang",
      "Tianyu",
      ""
    ],
    [
      "Li",
      "Peng",
      ""
    ],
    [
      "Dou",
      "Zhiyang",
      ""
    ],
    [
      "Lin",
      "Cheng",
      ""
    ],
    [
      "Cui",
      "Zhiming",
      ""
    ],
    [
      "Dong",
      "Zhen",
      ""
    ],
    [
      "Yeung",
      "Sai-Kit",
      ""
    ],
    [
      "Wang",
      "Wenping",
      ""
    ],
    [
      "Liu",
      "Yuan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 07:09:59 GMT"
    },
    {
      "version": "v2",
      "created": "Thu, 5 Dec 2024 14:16:07 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733296199000,
  "abstract": "  Recent developments in monocular depth estimation methods enable high-quality\ndepth estimation of single-view images but fail to estimate consistent video\ndepth across different frames. Recent works address this problem by applying a\nvideo diffusion model to generate video depth conditioned on the input video,\nwhich is training-expensive and can only produce scale-invariant depth values\nwithout camera poses. In this paper, we propose a novel video-depth estimation\nmethod called Align3R to estimate temporal consistent depth maps for a dynamic\nvideo. Our key idea is to utilize the recent DUSt3R model to align estimated\nmonocular depth maps of different timesteps. First, we fine-tune the DUSt3R\nmodel with additional estimated monocular depth as inputs for the dynamic\nscenes. Then, we apply optimization to reconstruct both depth maps and camera\nposes. Extensive experiments demonstrate that Align3R estimates consistent\nvideo depth and camera poses for a monocular video with superior performance\nthan baseline methods.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "zO7R29leb1be6doRsCg190twwMlC50NJsbHXcnXrJss",
  "pdfSize": "18380182"
}