{
  "id": "2412.12677",
  "title": "A Simplified Algorithm for Joint Real-Time Synchronization, NLoS\n  Identification, and Multi-Agent Localization",
  "authors": "Yili Deng, Jie Fan, Jiguang He, Baojia Luo, Miaomiao Dong, Zhongyi\n  Huang",
  "authorsParsed": [
    [
      "Deng",
      "Yili",
      ""
    ],
    [
      "Fan",
      "Jie",
      ""
    ],
    [
      "He",
      "Jiguang",
      ""
    ],
    [
      "Luo",
      "Baojia",
      ""
    ],
    [
      "Dong",
      "Miaomiao",
      ""
    ],
    [
      "Huang",
      "Zhongyi",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 08:47:16 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734425236000,
  "abstract": "  Real-time, high-precision localization in large-scale wireless networks faces\ntwo primary challenges: clock offsets caused by network asynchrony and\nnon-line-of-sight (NLoS) conditions. To tackle these challenges, we propose a\nlow-complexity real-time algorithm for joint synchronization and NLoS\nidentification-based localization. For precise synchronization, we resolve\nclock offsets based on accumulated time-of-arrival measurements from all the\npast time instances, modeling it as a large-scale linear least squares (LLS)\nproblem. To alleviate the high computational burden of solving this LLS, we\nintroduce the blockwise recursive Moore-Penrose inverse (BRMP) technique, a\ngeneralized recursive least squares approach, and derive a simplified\nformulation of BRMP tailored specifically for the real-time synchronization\nproblem. Furthermore, we formulate joint NLoS identification and localization\nas a robust least squares regression (RLSR) problem and address it by using an\nefficient iterative approach. Simulations show that the proposed algorithm\nachieves sub-nanosecond synchronization accuracy and centimeter-level\nlocalization precision, while maintaining low computational overhead.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Signal Processing"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "V5sdbh1I2mN-A1RXGCGeLXHjtca76dnJ9df4AdjiJJU",
  "pdfSize": "292613"
}