{"id":"2412.04788","title":"GUIDE: A Global Unified Inference Engine for Deploying Large Language\n  Models in Heterogeneous Environments","authors":"Yanyu Chen and Ganhong Huang","authorsParsed":[["Chen","Yanyu",""],["Huang","Ganhong",""]],"versions":[{"version":"v1","created":"Fri, 6 Dec 2024 05:46:43 GMT"},{"version":"v2","created":"Sun, 26 Jan 2025 19:35:02 GMT"}],"updateDate":"2025-01-28","timestamp":1733464003000,"abstract":"  Efficiently deploying large language models (LLMs) in real-world scenarios\nremains a critical challenge, primarily due to hardware heterogeneity,\ninference framework limitations, and workload complexities.Efficiently\ndeploying large language models (LLMs) in real-world scenarios remains a\ncritical challenge, primarily due to hardware heterogeneity, inference\nframework limitations, and workload complexities. These challenges often lead\nto inefficiencies in memory utilization, latency, and throughput, hindering the\neffective deployment of LLMs, especially for non-experts. Through extensive\nexperiments, we identify key performance bottlenecks, including sudden drops in\nmemory utilization, latency fluctuations with varying batch sizes, and\ninefficiencies in multi-GPU configurations. These insights reveal a vast\noptimization space shaped by the intricate interplay of hardware, frameworks,\nand workload parameters. This underscores the need for a systematic approach to\noptimize LLM inference, motivating the design of our framework, GUIDE. GUIDE\nleverages dynamic modeling and simulation-based optimization to address these\nissues, achieving prediction errors between 9.9% and 42.3% for key metrics such\nas batch latency, TTFT, and decode throughput. By effectively bridging the gap\nbetween theoretical performance and practical deployment, our framework\nempowers practitioners, particularly non-specialists, to make data-driven\ndecisions and unlock the full potential of LLMs in heterogeneous environments\ncheaply.\n","subjects":["Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Ts1ez_jC2rFJp_d5kgL7bFibjUV7Rmvdp5WMXmVo1hM","pdfSize":"2774681"}