{
  "id": "2412.06243",
  "title": "U-Know-DiffPAN: An Uncertainty-aware Knowledge Distillation Diffusion\n  Framework with Details Enhancement for PAN-Sharpening",
  "authors": "Sungpyo Kim, Jeonghyeok Do, Jaehyup Lee, Munchurl Kim",
  "authorsParsed": [
    [
      "Kim",
      "Sungpyo",
      ""
    ],
    [
      "Do",
      "Jeonghyeok",
      ""
    ],
    [
      "Lee",
      "Jaehyup",
      ""
    ],
    [
      "Kim",
      "Munchurl",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 06:33:36 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733726016000,
  "abstract": "  Conventional methods for PAN-sharpening often struggle to restore fine\ndetails due to limitations in leveraging high-frequency information. Moreover,\ndiffusion-based approaches lack sufficient conditioning to fully utilize\nPanchromatic (PAN) images and low-resolution multispectral (LRMS) inputs\neffectively. To address these challenges, we propose an uncertainty-aware\nknowledge distillation diffusion framework with details enhancement for\nPAN-sharpening, called U-Know-DiffPAN. The U-Know-DiffPAN incorporates\nuncertainty-aware knowledge distillation for effective transfer of feature\ndetails from our teacher model to a student one. The teacher model in our\nU-Know-DiffPAN captures frequency details through freqeuncy selective\nattention, facilitating accurate reverse process learning. By conditioning the\nencoder on compact vector representations of PAN and LRMS and the decoder on\nWavelet transforms, we enable rich frequency utilization. So, the high-capacity\nteacher model distills frequency-rich features into a lightweight student model\naided by an uncertainty map. From this, the teacher model can guide the student\nmodel to focus on difficult image regions for PAN-sharpening via the usage of\nthe uncertainty map. Extensive experiments on diverse datasets demonstrate the\nrobustness and superior performance of our U-Know-DiffPAN over very recent\nstate-of-the-art PAN-sharpening methods.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Electrical Engineering and Systems Science/Image and Video Processing"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "buJZCLmpWTT6ll9jpKpSy8fGPDJuilKrf1AhfcoyTeE",
  "pdfSize": "7078197"
}