{
  "id": "2412.07040",
  "title": "Beyond Idle Channels: Unlocking Idle Space with Signal Alignment in\n  Massive MIMO Cognitive Radio Networks",
  "authors": "Weidong Zhu, Xueqian Li, Longwei Wang, Zheng Zhang",
  "authorsParsed": [
    [
      "Zhu",
      "Weidong",
      ""
    ],
    [
      "Li",
      "Xueqian",
      ""
    ],
    [
      "Wang",
      "Longwei",
      ""
    ],
    [
      "Zhang",
      "Zheng",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 23:00:57 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733785257000,
  "abstract": "  Cognitive radio networks (CRNs) have traditionally focused on utilizing idle\nchannels to enhance spectrum efficiency. However, as wireless networks grow\ndenser, channel-centric strategies face increasing limitations. This paper\nintroduces a paradigm shift by exploring the underutilized potential of idle\nspatial dimensions, termed idle space, in co-channel transmissions. By\nintegrating massive multiple-input multiple-output (MIMO) systems with signal\nalignment techniques, we enable secondary users to transmit without causing\ninterference to primary users by aligning their signals within the null spaces\nof primary receivers. We propose a comprehensive framework that synergizes\nspatial spectrum sensing, signal alignment, and resource allocation,\nspecifically designed for secondary users in CRNs. Theoretical analyses and\nextensive simulations validate the framework, demonstrating substantial gains\nin spectrum efficiency, throughput, and interference mitigation. The results\nshow that the proposed approach not only ensures interference-free coexistence\nwith primary users but also unlocks untapped spatial resources for secondary\ntransmissions.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Signal Processing"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "GNwn_Kh_EgmtSXo8eAoA2oeH8QW435ZFnNiSTiOtU5s",
  "pdfSize": "1158848"
}