{"id":"2412.03884","title":"A Unified Framework for Evaluating the Effectiveness and Enhancing the\n  Transparency of Explainable AI Methods in Real-World Applications","authors":"Md. Ariful Islam, M. F. Mridha, Md Abrar Jahin, and Nilanjan Dey","authorsParsed":[["Islam","Md. Ariful",""],["Mridha","M. F.",""],["Jahin","Md Abrar",""],["Dey","Nilanjan",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 05:30:10 GMT"}],"updateDate":"2024-12-06","timestamp":1733376610000,"abstract":"  The rapid advancement of deep learning has resulted in substantial\nadvancements in AI-driven applications; however, the \"black box\" characteristic\nof these models frequently constrains their interpretability, transparency, and\nreliability. Explainable artificial intelligence (XAI) seeks to elucidate AI\ndecision-making processes, guaranteeing that explanations faithfully represent\nthe model's rationale and correspond with human comprehension. Despite\ncomprehensive research in XAI, a significant gap persists in standardized\nprocedures for assessing the efficacy and transparency of XAI techniques across\nmany real-world applications. This study presents a unified XAI evaluation\nframework incorporating extensive quantitative and qualitative criteria to\nsystematically evaluate the correctness, interpretability, robustness,\nfairness, and completeness of explanations generated by AI models. The\nframework prioritizes user-centric and domain-specific adaptations, hence\nimproving the usability and reliability of AI models in essential domains. To\naddress deficiencies in existing evaluation processes, we suggest defined\nbenchmarks and a systematic evaluation pipeline that includes data loading,\nexplanation development, and thorough method assessment. The suggested\nframework's relevance and variety are evidenced by case studies in healthcare,\nfinance, agriculture, and autonomous systems. These provide a solid basis for\nthe equitable and dependable assessment of XAI methodologies. This paradigm\nenhances XAI research by offering a systematic, flexible, and pragmatic method\nto guarantee transparency and accountability in AI systems across many\nreal-world contexts.\n","subjects":["Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"cbZLye8uHlpe-V6OZLtV5i25gyplJr1gAgOoDAMNrmc","pdfSize":"4377712"}