{"id":"2412.21051","title":"Toward Intelligent and Secure Cloud: Large Language Model Empowered\n  Proactive Defense","authors":"Yuyang Zhou, Guang Cheng, Kang Du, Zihan Chen","authorsParsed":[["Zhou","Yuyang",""],["Cheng","Guang",""],["Du","Kang",""],["Chen","Zihan",""]],"versions":[{"version":"v1","created":"Mon, 30 Dec 2024 16:09:28 GMT"}],"updateDate":"2024-12-31","timestamp":1735574968000,"abstract":"  The rapid evolution of cloud computing technologies and the increasing number\nof cloud applications have provided a large number of benefits in daily lives.\nHowever, the diversity and complexity of different components pose a\nsignificant challenge to cloud security, especially when dealing with\nsophisticated and advanced cyberattacks. Recent advancements in generative\nfoundation models (GFMs), particularly in the large language models (LLMs),\noffer promising solutions for security intelligence. By exploiting the powerful\nabilities in language understanding, data analysis, task inference, action\nplanning, and code generation, we present LLM-PD, a novel proactive defense\narchitecture that defeats various threats in a proactive manner. LLM-PD can\nefficiently make a decision through comprehensive data analysis and sequential\nreasoning, as well as dynamically creating and deploying actionable defense\nmechanisms on the target cloud. Furthermore, it can flexibly self-evolve based\non experience learned from previous interactions and adapt to new attack\nscenarios without additional training. The experimental results demonstrate its\nremarkable ability in terms of defense effectiveness and efficiency,\nparticularly highlighting an outstanding success rate when compared with other\nexisting methods.\n","subjects":["Computer Science/Cryptography and Security","Computer Science/Artificial Intelligence","Computer Science/Networking and Internet Architecture"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"LFl3llK6dGit24LM3al5UE5PxcwSNSfWVlJE1puyXkc","pdfSize":"710258"}