{
  "id": "2412.15896",
  "title": "Evaluation of Reliability Criteria for News Publishers with Large\n  Language Models",
  "authors": "Manuel Pratelli and John Bianchi and Fabio Pinelli and Marinella\n  Petrocchi",
  "authorsParsed": [
    [
      "Pratelli",
      "Manuel",
      ""
    ],
    [
      "Bianchi",
      "John",
      ""
    ],
    [
      "Pinelli",
      "Fabio",
      ""
    ],
    [
      "Petrocchi",
      "Marinella",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 13:50:18 GMT"
    },
    {
      "version": "v2",
      "created": "Thu, 13 Feb 2025 14:07:25 GMT"
    }
  ],
  "updateDate": "2025-02-14",
  "timestamp": 1734702618000,
  "abstract": "  In this study, we investigate the use of a large language model to assist in\nthe evaluation of the reliability of the vast number of existing online news\npublishers, addressing the impracticality of relying solely on human expert\nannotators for this task. In the context of the Italian news media market, we\nfirst task the model with evaluating expert-designed reliability criteria using\na representative sample of news articles. We then compare the model's answers\nwith those of human experts. The dataset consists of 340 news articles, each\nannotated by two human experts and the LLM. Six criteria are taken into\naccount, for a total of 6,120 annotations. We observe good agreement between\nLLM and human annotators in three of the six evaluated criteria, including the\ncritical ability to detect instances where a text negatively targets an entity\nor individual. For two additional criteria, such as the detection of\nsensational language and the recognition of bias in news content, LLMs generate\nfair annotations, albeit with certain trade-offs. Furthermore, we show that the\nLLM is able to help resolve disagreements among human experts, especially in\ntasks such as identifying cases of negative targeting.\n",
  "subjects": [
    "Computer Science/Social and Information Networks"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "l-NJU5g-B8yCDTRWgSOBqXauK0DVVPoRK2XvlaADoEY",
  "pdfSize": "928388"
}