{
  "id": "2412.06222",
  "title": "Blotto on the Ballot: A Ballot Stuffing Blotto Game",
  "authors": "Harsh Shah, Jayakrishnan Nair, D Manjunath, Narayan Mandayam",
  "authorsParsed": [
    [
      "Shah",
      "Harsh",
      ""
    ],
    [
      "Nair",
      "Jayakrishnan",
      ""
    ],
    [
      "Manjunath",
      "D",
      ""
    ],
    [
      "Mandayam",
      "Narayan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 05:38:14 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733722694000,
  "abstract": "  We consider the following Colonel Blotto game between parties $P_1$ and\n$P_A.$ $P_1$ deploys a non negative number of troops across $J$ battlefields,\nwhile $P_A$ chooses $K,$ $K < J,$ battlefields to remove all of $P_1$'s troops\nfrom the chosen battlefields. $P_1$ has the objective of maximizing the number\nof surviving troops while $P_A$ wants to minimize it. Drawing an analogy with\nballot stuffing by a party contesting an election and the countermeasures by\nthe Election Commission to negate that, we call this the Ballot Stuffing Game.\nFor this zero-sum resource allocation game, we obtain the set of Nash\nequilibria as a solution to a convex combinatorial optimization problem. We\nanalyze this optimization problem and obtain insights into the several non\ntrivial features of the equilibrium behavior. These features in turn allows to\ndescribe the structure of the solutions and efficient algorithms to obtain\nthen. The model is described as ballot stuffing game in a plebiscite but has\napplications in security and auditing games. The results are extended to a\nparliamentary election model. Numerical examples illustrate applications of the\ngame.\n",
  "subjects": [
    "Computer Science/Computer Science and Game Theory",
    "Economics/Theoretical Economics"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "brvFTdCbyR8KCDQToDeTaXxitsHtkx1V9FyQwTKar6I",
  "pdfSize": "533507"
}