{"id":"2412.17228","title":"MatchMiner-AI: An Open-Source Solution for Cancer Clinical Trial\n  Matching","authors":"Ethan Cerami, Pavel Trukhanov, Morgan A. Paul, Michael J. Hassett,\n  Irbaz B. Riaz, James Lindsay, Emily Mallaber, Harry Klein, Gufran Gungor,\n  Matthew Galvin, Stephen C. Van Nostrand, Joyce Yu, Tali Mazor, Kenneth L.\n  Kehl","authorsParsed":[["Cerami","Ethan",""],["Trukhanov","Pavel",""],["Paul","Morgan A.",""],["Hassett","Michael J.",""],["Riaz","Irbaz B.",""],["Lindsay","James",""],["Mallaber","Emily",""],["Klein","Harry",""],["Gungor","Gufran",""],["Galvin","Matthew",""],["Van Nostrand","Stephen C.",""],["Yu","Joyce",""],["Mazor","Tali",""],["Kehl","Kenneth L.",""]],"versions":[{"version":"v1","created":"Mon, 23 Dec 2024 02:44:35 GMT"}],"updateDate":"2024-12-24","timestamp":1734921875000,"abstract":"  Clinical trials drive improvements in cancer treatments and outcomes.\nHowever, most adults with cancer do not participate in trials, and trials often\nfail to enroll enough patients to answer their scientific questions. Artificial\nintelligence could accelerate matching of patients to appropriate clinical\ntrials. Here, we describe the development and evaluation of the MatchMiner-AI\npipeline for clinical trial searching and ranking. MatchMiner-AI focuses on\nmatching patients to potential trials based on core criteria describing\nclinical \"spaces,\" or disease contexts, targeted by a trial. It aims to\naccelerate the human work of identifying potential matches, not to fully\nautomate trial screening. The pipeline includes modules for extraction of key\ninformation from a patient's longitudinal electronic health record; rapid\nranking of candidate trial-patient matches based on embeddings in vector space;\nand classification of whether a candidate match represents a reasonable\nclinical consideration. Code and synthetic data are available at\nhttps://huggingface.co/ksg-dfci/MatchMiner-AI . Model weights based on\nsynthetic data are available at https://huggingface.co/ksg-dfci/TrialSpace and\nhttps://huggingface.co/ksg-dfci/TrialChecker . A simple cancer clinical trial\nsearch engine to demonstrate pipeline components is available at\nhttps://huggingface.co/spaces/ksg-dfci/trial_search_alpha .\n","subjects":["Computer Science/Artificial Intelligence","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"G70J0yLgqXnvVgc3ZrwDqioq0yKx_IMboGTXARBVbfY","pdfSize":"2514339"}