{"id":"2412.20578","title":"The Two-Loop Lipatov Vertex in QCD","authors":"Samuel Abreu, Giuseppe De Laurentis, Giulio Falcioni, Einan Gardi,\n  Calum Milloy, Leonardo Vernazza","authorsParsed":[["Abreu","Samuel",""],["De Laurentis","Giuseppe",""],["Falcioni","Giulio",""],["Gardi","Einan",""],["Milloy","Calum",""],["Vernazza","Leonardo",""]],"versions":[{"version":"v1","created":"Sun, 29 Dec 2024 20:55:00 GMT"}],"updateDate":"2024-12-31","timestamp":1735505700000,"abstract":"  High-energy factorization of 2 -> 2 amplitudes in QCD has been recently\npushed to the next-to-next-to-leading logarithmic order by determining the\nthree-loop gluon Regge trajectory. This was based on computing multi-Reggeon\nexchanges using rapidity evolution in the shock-wave formalism, and\ndisentangling between the Regge pole and Regge cut contributions. In the\npresent paper we extend the relevant theoretical framework to 2 -> 3 processes,\nand compute all multi-Reggeon exchanges necessary for extracting the two-loop\nReggeon-gluon-Reggeon Lipatov vertex from 2 -> 3 amplitudes. Then, specializing\ngeneral amplitude methods to multi-Regge kinematics, we derive analytic\nexpressions for non-planar two-loop gg -> ggg, gq -> ggq and qq -> qgq QCD\namplitudes in that limit. Matching these to the multi-Reggeon computation, we\ndetermine the QCD Lipatov vertex in dimensional regularization at two loops\nthrough finite terms. We also determine the one-loop vertex through\nO(epsilon^4). All results are expressed in a compact form in terms of a basis\nof single-valued generalised polylogarithms, manifesting target-projectile\nsymmetry and reality properties. Furthermore, our basis of functions is\nexplicitly finite in the soft limit, featuring delicate cancellation of\nspurious rational poles by transcendental functions. Agreement between all\nthree partonic channels, as well agreement of the maximal weight contributions\nwith the super Yang-Mills Lipatov vertex provide robust checks of the result.\n","subjects":["Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"4mnHYkgWYLSKBGFtiAfAuaYoXnjiedUTHrajXDkHCqQ","pdfSize":"1148726"}