{
  "id": "2412.13286",
  "title": "Posterior Mean Matching: Generative Modeling through Online Bayesian\n  Inference",
  "authors": "Sebastian Salazar, Michal Kucer, Yixin Wang, Emily Casleton, David\n  Blei",
  "authorsParsed": [
    [
      "Salazar",
      "Sebastian",
      ""
    ],
    [
      "Kucer",
      "Michal",
      ""
    ],
    [
      "Wang",
      "Yixin",
      ""
    ],
    [
      "Casleton",
      "Emily",
      ""
    ],
    [
      "Blei",
      "David",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 19:34:58 GMT"
    },
    {
      "version": "v2",
      "created": "Thu, 19 Dec 2024 23:02:07 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734464098000,
  "abstract": "  This paper introduces posterior mean matching (PMM), a new method for\ngenerative modeling that is grounded in Bayesian inference. PMM uses conjugate\npairs of distributions to model complex data of various modalities like images\nand text, offering a flexible alternative to existing methods like diffusion\nmodels. PMM models iteratively refine noisy approximations of the target\ndistribution using updates from online Bayesian inference. PMM is flexible\nbecause its mechanics are based on general Bayesian models. We demonstrate this\nflexibility by developing specialized examples: a generative PMM model of\nreal-valued data using the Normal-Normal model, a generative PMM model of count\ndata using a Gamma-Poisson model, and a generative PMM model of discrete data\nusing a Dirichlet-Categorical model. For the Normal-Normal PMM model, we\nestablish a direct connection to diffusion models by showing that its\ncontinuous-time formulation converges to a stochastic differential equation\n(SDE). Additionally, for the Gamma-Poisson PMM, we derive a novel SDE driven by\na Cox process, which is a significant departure from traditional Brownian\nmotion-based generative models. PMMs achieve performance that is competitive\nwith generative models for language modeling and image generation.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Artificial Intelligence",
    "Statistics/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "cO1SwBPDSFaxCEzmtGaR8M4jR2l0PEVDR6ZNNhO7TBg",
  "pdfSize": "2385558"
}