{"id":"2412.09914","title":"Atomic Learning Objectives Labeling: A High-Resolution Approach for\n  Physics Education","authors":"Naiming Liu, Shashank Sonkar, Debshila Basu Mallick, Richard Baraniuk,\n  Zhongzhou Chen","authorsParsed":[["Liu","Naiming",""],["Sonkar","Shashank",""],["Mallick","Debshila Basu",""],["Baraniuk","Richard",""],["Chen","Zhongzhou",""]],"versions":[{"version":"v1","created":"Fri, 13 Dec 2024 07:05:31 GMT"},{"version":"v2","created":"Sat, 22 Feb 2025 00:17:16 GMT"}],"updateDate":"2025-02-25","timestamp":1734073531000,"abstract":"  This paper introduces a novel approach to create a high-resolution \"map\" for\nphysics learning: an \"atomic\" learning objectives (LOs) system designed to\ncapture detailed cognitive processes and concepts required for problem solving\nin a college-level introductory physics course. Our method leverages Large\nLanguage Models (LLMs) for automated labeling of physics questions and\nintroduces a comprehensive set of metrics to evaluate the quality of the\nlabeling outcomes. The atomic LO system, covering nine chapters of an\nintroductory physics course, uses a \"subject-verb-object'' structure to\nrepresent specific cognitive processes. We apply this system to 131 questions\nfrom expert-curated question banks and the OpenStax University Physics\ntextbook. Each question is labeled with 1-8 atomic LOs across three chapters.\nThrough extensive experiments using various prompting strategies and LLMs, we\ncompare automated LOs labeling results against human expert labeling. Our\nanalysis reveals both the strengths and limitations of LLMs, providing insight\ninto LLMs reasoning processes for labeling LOs and identifying areas for\nimprovement in LOs system design. Our work contributes to the field of learning\nanalytics by proposing a more granular approach to mapping learning objectives\nwith questions. Our findings have significant implications for the development\nof intelligent tutoring systems and personalized learning pathways in STEM\neducation, paving the way for more effective \"learning GPS'' systems.\n","subjects":["Computer Science/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"b3zhBVJcARkdIGfvaz6v7qizxxJ-WfLStwxl73Nw8fc","pdfSize":"776582"}