{
  "id": "2412.12089",
  "title": "Stabilizing Reinforcement Learning in Differentiable Multiphysics\n  Simulation",
  "authors": "Eliot Xing, Vernon Luk, Jean Oh",
  "authorsParsed": [
    [
      "Xing",
      "Eliot",
      ""
    ],
    [
      "Luk",
      "Vernon",
      ""
    ],
    [
      "Oh",
      "Jean",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 18:56:24 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734375384000,
  "abstract": "  Recent advances in GPU-based parallel simulation have enabled practitioners\nto collect large amounts of data and train complex control policies using deep\nreinforcement learning (RL), on commodity GPUs. However, such successes for RL\nin robotics have been limited to tasks sufficiently simulated by fast\nrigid-body dynamics. Simulation techniques for soft bodies are comparatively\nseveral orders of magnitude slower, thereby limiting the use of RL due to\nsample complexity requirements. To address this challenge, this paper presents\nboth a novel RL algorithm and a simulation platform to enable scaling RL on\ntasks involving rigid bodies and deformables. We introduce Soft Analytic Policy\nOptimization (SAPO), a maximum entropy first-order model-based actor-critic RL\nalgorithm, which uses first-order analytic gradients from differentiable\nsimulation to train a stochastic actor to maximize expected return and entropy.\nAlongside our approach, we develop Rewarped, a parallel differentiable\nmultiphysics simulation platform that supports simulating various materials\nbeyond rigid bodies. We re-implement challenging manipulation and locomotion\ntasks in Rewarped, and show that SAPO outperforms baselines over a range of\ntasks that involve interaction between rigid bodies, articulations, and\ndeformables.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Robotics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "joQrrhHHKCSum51p1WO96DEOy9WfHXuc6vWmO516B4Q",
  "pdfSize": "14034865"
}