{
  "id": "2412.13576",
  "title": "GPU-based Graver Basis Extraction for Nonlinear Integer Optimization",
  "authors": "Wenbo Liu, Akang Wang, Wenguo Yang",
  "authorsParsed": [
    [
      "Liu",
      "Wenbo",
      ""
    ],
    [
      "Wang",
      "Akang",
      ""
    ],
    [
      "Yang",
      "Wenguo",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 07:50:55 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734508255000,
  "abstract": "  Nonlinear integer programs involve optimizing nonlinear objectives with\nvariables restricted to integer values, and have widespread applications in\nareas such as resource allocation and portfolio selection. One approach to\nsolving these problems is the augmentation procedure, which iteratively refines\na feasible solution by identifying augmenting steps from the Graver Basis--a\nset of test directions. While this method guarantees termination in\npolynomially many steps, computing the Graver Basis exactly is known to be\n$\\mathcal{NP}$-hard. To address this computational challenge, we propose\nMulti-start Augmentation via Parallel Extraction (MAPLE), a GPU-based heuristic\ndesigned to efficiently approximate the Graver Basis. MAPLE extracts test\ndirections by optimizing non-convex continuous problems, leveraging first-order\nmethods to enable parallelizable implementation. The resulting set of\ndirections is then used in multiple augmentations, each seeking to improve the\nsolution's optimality. The proposed approach has three notable characteristics:\n(i) independence from general-purpose solvers, while ensuring guaranteed\nfeasibility of solutions; (ii) high computational efficiency, achieved through\nGPU-based parallelization; (iii) flexibility in handling instances with shared\nconstraint matrices but varying objectives and right-hand sides. Empirical\nevaluations on QPLIB benchmark instances demonstrate that MAPLE delivers\nperformance comparable to state-of-the-art solvers in terms of solution\nquality, while achieving significant gains in computational efficiency. These\nresults highlight MAPLE's potential as an effective heuristic for solving\nnonlinear integer programs in practical applications.\n",
  "subjects": [
    "Mathematics/Optimization and Control"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "RzPXAEagsyimOKvbmsSfo-jjZQORh7BXRbRNyuH6Cac",
  "pdfSize": "565005"
}