{
  "id": "2412.12382",
  "title": "Parallel Motif-Based Community Detection",
  "authors": "Tianyi Chen, Charalampos E. Tsourakakis",
  "authorsParsed": [
    [
      "Chen",
      "Tianyi",
      ""
    ],
    [
      "Tsourakakis",
      "Charalampos E.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 22:33:49 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734388429000,
  "abstract": "  Community detection is a central task in graph analytics. Given the\nsubstantial growth in graph size, scalability in community detection continues\nto be an unresolved challenge. Recently, alongside established methods like\nLouvain and Infomap, motif-based community detection has emerged. Techniques\nlike Tectonic are notable for their advanced ability to identify communities by\npruning edges based on motif similarity scores and analyzing the resulting\nconnected components.\n  In this study, we perform a comprehensive evaluation of community detection\nmethods, focusing on both the quality of their output and their scalability.\nSpecifically, we contribute an open-source parallel framework for motif-based\ncommunity detection based on a shared memory architecture. We conduct a\nthorough comparative analysis of community detection techniques from various\nfamilies among state-of-the-art methods, including Tectonic, label propagation,\nspectral clustering, Louvain, LambdaCC, and Infomap on graphs with up to\nbillions of edges. A key finding of our analysis is that motif-based graph\nclustering provides a good balance between performance and efficiency. Our work\nprovides several novel insights. Interestingly, we pinpoint biases in prior\nworks in evaluating community detection methods using the top 5K groundtruth\ncommunities from SNAP only, as these are frequently near-cliques. Our empirical\nstudies lead to rules of thumb threshold picking strategies that can be\ncritical for real applications. Finally, we show that Tectonic can fail to\nrecover two well-separated clusters. To address this, we suggest a new\nsimilarity measure based on counts of triangles and wedges (TW) that prevents\nthe over-segmentation of communities by Tectonic.\n",
  "subjects": [
    "Computer Science/Social and Information Networks"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "zYWQ4AlXddvfUyABE5H5ZgcCcKV9QXDIxvdqfaK6KJA",
  "pdfSize": "1444074"
}