{
  "id": "2412.14907",
  "title": "The source of the 2017 cosmic ray half-year modulation event",
  "authors": "O.P.M. Aslam, D. MacTaggart, R. Battiston, M.S. Potgieter, and M.D.\n  Ngobeni",
  "authorsParsed": [
    [
      "Aslam",
      "O. P. M.",
      ""
    ],
    [
      "MacTaggart",
      "D.",
      ""
    ],
    [
      "Battiston",
      "R.",
      ""
    ],
    [
      "Potgieter",
      "M. S.",
      ""
    ],
    [
      "Ngobeni",
      "M. D.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 14:39:35 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734619175000,
  "abstract": "  In 2017, as the solar cycle approached solar minimum, an unusually long and\nlarge depression was observed in galactic cosmic ray (GCR) protons, detected\nwith the Alpha Magnetic Spectrometer (AMS-02), lasting for the second half of\nthat year. The depression, as seen in the Bartel rotation-averaged proton flux,\nhas the form of a Forbush decrease (FD). Despite this resemblance, however, the\ncause of the observed depression does not have such a simple explanation as\nFDs, due to coronal mass ejections (CMEs), typically last for a few days at 1\nAU rather than half a year. In this work, we seek the cause of the observed\ndepression and investigate two main possibilities. First, we consider a\nmini-cycle - a temporary change in the solar dynamo that changes the behavior\nof the global solar magnetic field and, by this, the modulation of GCRs.\nSecondly, we investigate the behavior of solar activity, both CMEs and\nco-rotating/stream interactions regions (C/SIRs), during this period. Our\nfindings show that, although there is some evidence for mini-cycle behavior\nprior to the depression, the depression is ultimately due to a combination of\nrecurrent CMEs, SIRs and CIRs. A particular characteristic of the depression is\nthat the largest impacts that help to create and maintain it are due to four\nCMEs from the same, highly active, magnetic source that persists for several\nsolar rotations. This active magnetic source is unusual given the closeness of\nthe solar cycle to solar minimum, which also helps to make the depression more\nevident.\n",
  "subjects": [
    "Astrophysics/Solar and Stellar Astrophysics",
    "Astrophysics/High Energy Astrophysical Phenomena",
    "Physics/Space Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "WvY2iItDVr_DRMYhiuBUqFwf-B9ARy5_IyaJLwZNTeI",
  "pdfSize": "1093971"
}