{"id":"2412.13338","title":"Ultra-Long-Range Bessel Beams via Leaky Waves with Mitigated Open\n  Stopband","authors":"Edoardo Negri, Federico Giusti, Walter Fuscaldo, Paolo Burghignoli,\n  Enrica Martini, and Alessandro Galli","authorsParsed":[["Negri","Edoardo",""],["Giusti","Federico",""],["Fuscaldo","Walter",""],["Burghignoli","Paolo",""],["Martini","Enrica",""],["Galli","Alessandro",""]],"versions":[{"version":"v1","created":"Tue, 17 Dec 2024 21:19:38 GMT"}],"updateDate":"2024-12-19","timestamp":1734470378000,"abstract":"  Open stop-band (OSB) mitigation techniques are commonly used to improve the\nfar-field radiating properties of leakywave antennas based on periodic\nstructures. Recently, leaky waves have been proposed to focus energy in the\nnear field through Bessel beams. However, the focusing character of Bessel\nbeams is notably limited to a maximum distance known as the nondiffractive\nrange. In this work, an OSB mitigation technique is originally exploited to\nsignificantly extend the nondiffractive range of a Bessel beam generated by a\nleaky-wave launcher in the microwave/millimeter-wave range. A comprehensive\nanalysis of this device is presented, comparing the performance of the proposed\nlauncher with the typical structure of a leaky-wave Bessel-beam launcher where\nthe OSB is not suppressed. Theoretical results corroborated by full-wave\nsimulations demonstrate that the proposed device, designed around 30 GHz,\nachieves an impressive nondiffractive range of approximately 25 m, which\ncorresponds to 2500 vacuum wavelengths and to 50 times its aperture diameter of\n50 cm. These results look particularly attractive for, e.g., near-field\ncommunications and wireless power transfer applications, where focusing energy\nin narrow spots and over large distances is a key factor.\n","subjects":["Physics/Optics","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"SkfT_M5Ybolper2DDUGMlAinZOciZUhj58jCpGDyq6k","pdfSize":"5347894"}