{
  "id": "2412.04165",
  "title": "Differential Magnetic Force Microscopy with a Switchable Tip",
  "authors": "Shobhna Misra and Reshma Peremadathil Pradeep and Yaoxuan Feng and Urs\n  Grob and Andrada Oana Mandru and Christian L. Degen and Hans J. Hug and\n  Alexander Eichler",
  "authorsParsed": [
    [
      "Misra",
      "Shobhna",
      ""
    ],
    [
      "Pradeep",
      "Reshma Peremadathil",
      ""
    ],
    [
      "Feng",
      "Yaoxuan",
      ""
    ],
    [
      "Grob",
      "Urs",
      ""
    ],
    [
      "Mandru",
      "Andrada Oana",
      ""
    ],
    [
      "Degen",
      "Christian L.",
      ""
    ],
    [
      "Hug",
      "Hans J.",
      ""
    ],
    [
      "Eichler",
      "Alexander",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 14:03:15 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733407395000,
  "abstract": "  The separation of physical forces acting on the tip of a magnetic force\nmicroscope (MFM) is essential for correct magnetic imaging. Electrostatic\nforces can be modulated by varying the tip-sample potential and minimized to\nmap the local Kelvin potential. However, distinguishing magnetic forces from\nvan der Waals forces typically requires two measurements with opposite tip\nmagnetizations under otherwise identical measurement conditions. Here, we\npresent an inverted magnetic force microscope where the sample is mounted on a\nflat cantilever for force sensing, and the magnetic tip is attached to a\nminiaturized electromagnet that periodically flips the tip magnetization. This\nsetup enables the extraction of magnetic tip-sample interactions from the\nsidebands occurring at the switching rate in the cantilever oscillation\nspectrum. Our method achieves the separation of magnetic signals from other\nforce contributions in a single-scan mode. Future iterations of this setup may\nincorporate membrane, trampoline, or string resonators with ultra-high quality\nfactors, potentially improving measurement sensitivity by up to three orders of\nmagnitude compared to the state-of-the-art MFM systems using cantilevers.\n",
  "subjects": [
    "Physics/Applied Physics",
    "Condensed Matter/Mesoscale and Nanoscale Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "UTfhAyIcsP5CZTuzwZY4b-zLocCOM_BGX0aYZcsctpQ",
  "pdfSize": "19517374"
}