{
  "id": "2412.04224",
  "title": "The radio properties of the JWST-discovered AGN",
  "authors": "G. Mazzolari, R. Gilli, R. Maiolino, I. Prandoni, I. Delvecchio, C.\n  Norman, E.F. Jimenez-Andrade, S. Belladitta, F. Vito, E. Momjian, M.\n  Chiaberge, B. Trefoloni, M. Signorini, X. Ji, Q. D'Amato, G. Risaliti, R.D.\n  Baldi, A. Fabian, H. \\\"Ubler, F. D'Eugenio, J. Scholtz, I. Juod\\v{z}balis, M.\n  Mignoli, M. Brusa, E. Murphy, T.W.B. Muxlow",
  "authorsParsed": [
    [
      "Mazzolari",
      "G.",
      ""
    ],
    [
      "Gilli",
      "R.",
      ""
    ],
    [
      "Maiolino",
      "R.",
      ""
    ],
    [
      "Prandoni",
      "I.",
      ""
    ],
    [
      "Delvecchio",
      "I.",
      ""
    ],
    [
      "Norman",
      "C.",
      ""
    ],
    [
      "Jimenez-Andrade",
      "E. F.",
      ""
    ],
    [
      "Belladitta",
      "S.",
      ""
    ],
    [
      "Vito",
      "F.",
      ""
    ],
    [
      "Momjian",
      "E.",
      ""
    ],
    [
      "Chiaberge",
      "M.",
      ""
    ],
    [
      "Trefoloni",
      "B.",
      ""
    ],
    [
      "Signorini",
      "M.",
      ""
    ],
    [
      "Ji",
      "X.",
      ""
    ],
    [
      "D'Amato",
      "Q.",
      ""
    ],
    [
      "Risaliti",
      "G.",
      ""
    ],
    [
      "Baldi",
      "R. D.",
      ""
    ],
    [
      "Fabian",
      "A.",
      ""
    ],
    [
      "Übler",
      "H.",
      ""
    ],
    [
      "D'Eugenio",
      "F.",
      ""
    ],
    [
      "Scholtz",
      "J.",
      ""
    ],
    [
      "Juodžbalis",
      "I.",
      ""
    ],
    [
      "Mignoli",
      "M.",
      ""
    ],
    [
      "Brusa",
      "M.",
      ""
    ],
    [
      "Murphy",
      "E.",
      ""
    ],
    [
      "Muxlow",
      "T. W. B.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 14:58:18 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733410698000,
  "abstract": "  We explore the radio emission of spectroscopically confirmed, X-ray weak,\nBroad Line AGN (BLAGN, or type 1) selected with JWST in the GOODS-N field, one\nof the fields with the best combination of deep radio observations and\nstatistics of JWST-selected BLAGN. We use deep radio data at different\nfrequencies (144\\,MHz, 1.5\\,GHz, 3\\,GHz, 5.5\\,GHz, 10\\,GHz), and we find that\nnone of the 22 sources investigated is detected at any of the aforementioned\nfrequencies. Similarly, the radio stacking analysis does not reveal any\ndetection down to an rms of $\\sim 0.2\\mu$Jy beam$^{-1}$, corresponding to a\n$3\\sigma$ upper limit at rest frame 5 GHz of $L_{5GHz}=2\\times10^{39}$ erg\ns$^{-1}$ at the mean redshift of the sample $z\\sim 5.2$. We compared this and\nindividual sources upper limits with expected radio luminosities estimated\nassuming different AGN scaling relations. For most of the sources the radio\nluminosity upper limits are still compatible with expectations for radio-quiet\n(RQ) AGN; nevertheless, the more stringent stacking upper limits and the fact\nthat no detection is found would suggest that JWST-selected BLAGN are weaker\nthan standard AGN even at radio frequencies. We discuss some scenarios that\ncould explain the possible radio weakness, such as free-free absorption from a\ndense medium, or the lack of either magnetic field or a corona, possibly as a\nconsequence of super-Eddington accretion. These scenarios would also explain\nthe observed X-ray weakness. We also conclude that $\\sim$1 dex more sensitive\nradio observations are needed to better constrain the level of radio emission\n(or lack thereof) for the bulk of these sources. The Square Kilometer Array\nObservatory (SKAO) will likely play a crucial role in assessing the properties\nof this AGN population.\n",
  "subjects": [
    "Astrophysics/Astrophysics of Galaxies",
    "Astrophysics/Cosmology and Nongalactic Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "wVZjvWpR9cpoaRpJcH6dGFT-136w3_FXwPUS0sALzzs",
  "pdfSize": "6700341"
}