{"id":"2412.14805","title":"Coronal kink oscillations and photospheric driving: combining SolO/EUI\n  and SST/CRISP high-resolution observations","authors":"Nicolas Poirier (1 and 2), Sanja Danilovic (3), Petra Kohutova (1 and\n  2), Carlos J. D\\'iaz Baso (1 and 2), Luc Rouppe van der Voort (1 and 2),\n  Daniele Calchetti (4), Jonas Sinjan (4) ((1) Rosseland Centre for Solar\n  Physics, University of Oslo, P.O. Box 1029, Blindern, NO-0315 Oslo, Norway,\n  (2) Institute of Theoretical Astrophysics, University of Oslo, P.O. Box 1029,\n  Blindern, NO-0315 Oslo, Norway, (3) Institute for Solar Physics, Dept. of\n  Astronomy, Stockholm University, Albanova University Center, 10691 Stockholm,\n  Sweden, (4) Max-Planck-Institut f\\\"ur Sonnensystemforschung,\n  Justus-von-Liebig-Weg 3, 37077 G\\\"ottingen, Germany)","authorsParsed":[["Poirier","Nicolas","","1 and 2"],["Danilovic","Sanja","","1 and\n  2"],["Kohutova","Petra","","1 and\n  2"],["Baso","Carlos J. Díaz","","1 and 2"],["van der Voort","Luc Rouppe","","1 and 2"],["Calchetti","Daniele",""],["Sinjan","Jonas",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 12:56:27 GMT"},{"version":"v2","created":"Fri, 20 Dec 2024 09:35:59 GMT"}],"updateDate":"2024-12-23","timestamp":1734612987000,"abstract":"  The driving and excitation mechanisms of decay-less kink oscillations in\ncoronal loops remain under debate. We aim to quantify and provide simple\nobservational constraints on the photospheric driving of oscillating coronal\nloops in a few typical active region configurations: sunspot, plage, pores and\nenhanced-network regions. We then aim to investigate the possible interplay\nbetween photospheric driving and properties of kink oscillations in connected\ncoronal loops. We analyse two unique datasets of the corona and photosphere\ntaken at a high resolution during the first coordinated observation campaign\nbetween Solar Orbiter and the Swedish 1-m Solar Telescope (SST). A local\ncorrelation tracking method is applied on the SST/CRISP data to quantify the\nphotospheric motions at the base of coronal loops. The same loops are then\nanalysed in the corona by exploiting data from the Extreme Ultraviolet Imager\non Solar Orbiter, and by using a wavelet analysis to characterize the kink\noscillations. Each photospheric region shows dynamics with an overall increase\nin strength going from pore, plage, enhanced-network to sunspot regions.\nDifferences are also seen in the kink-mode amplitudes of the corresponding\ncoronal loops. This suggests the photosphere is involved in the driving of\ncoronal kink oscillations. However, the few samples available does not allow to\nfurther establish the excitation mechanism yet. Despite oscillating coronal\nloops being anchored in seemingly \"static\" strong magnetic field regions as\nseen from coronal EUV observations, photospheric observations provide evidence\nfor a continuous and significant driving at their base. The precise connection\nbetween photospheric driving and coronal kink oscillations remains to be\nfurther investigated. This study finally provides critical constraints on\nphotospheric driving that can be tested in existing numerical models of coronal\nloops.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"KZk_jsmeh51X1T13YzdVbNP-hHtX0FcRNv5IenaHL0c","pdfSize":"12560835"}