{
  "id": "2412.10063",
  "title": "Unveiling the Energy Vampires: A Methodology for Debugging Software\n  Energy Consumption",
  "authors": "Enrique Barba Roque, Luis Cruz, Thomas Durieux",
  "authorsParsed": [
    [
      "Roque",
      "Enrique Barba",
      ""
    ],
    [
      "Cruz",
      "Luis",
      ""
    ],
    [
      "Durieux",
      "Thomas",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 11:49:19 GMT"
    }
  ],
  "updateDate": "2024-12-16",
  "timestamp": 1734090559000,
  "abstract": "  Energy consumption in software systems is becoming increasingly important,\nespecially in large-scale deployments. However, debugging energy-related issues\nremains challenging due to the lack of specialized tools. This paper presents\nan energy debugging methodology for identifying and isolating energy\nconsumption hotspots in software systems. We demonstrate the methodology's\neffectiveness through a case study of Redis, a popular in-memory database. Our\nanalysis reveals significant energy consumption differences between Alpine and\nUbuntu distributions, with Alpine consuming up to 20.2% more power in certain\noperations. We trace this difference to the implementation of the memcpy\nfunction in different C standard libraries (musl vs. glibc). By isolating and\nbenchmarking memcpy, we confirm it as the primary cause of the energy\ndiscrepancy. Our findings highlight the importance of considering energy\nefficiency in software dependencies and demonstrate the capability to assist\ndevelopers in identifying and addressing energy-related issues. This work\ncontributes to the growing field of sustainable software engineering by\nproviding a systematic approach to energy debugging and using it to unveil\nunexpected energy behaviors in Alpine.\n",
  "subjects": [
    "Computer Science/Software Engineering"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "DxbeJdBai74IKGKjS_xnbSmB7i3trBc5wCnUbJDxFMk",
  "pdfSize": "1746428"
}