{"id":"2412.11347","title":"FRB 20230708A, a quasi-periodic FRB with unique temporal-polarimetric\n  morphology","authors":"T. Dial, A. T. Deller, P. A. Uttarkar, M. E. Lower, R. M. Shannon,\n  Kelly Gourdji, Lachlan Marnoch, A. Bera, Stuart D. Ryder, Marcin Glowacki, J.\n  Xavier Prochaska","authorsParsed":[["Dial","T.",""],["Deller","A. T.",""],["Uttarkar","P. A.",""],["Lower","M. E.",""],["Shannon","R. M.",""],["Gourdji","Kelly",""],["Marnoch","Lachlan",""],["Bera","A.",""],["Ryder","Stuart D.",""],["Glowacki","Marcin",""],["Prochaska","J. Xavier",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 00:08:22 GMT"}],"updateDate":"2024-12-17","timestamp":1734307702000,"abstract":"  There has been a rapid increase in the known fast radio burst (FRB)\npopulation, yet the progenitor(s) of these events have remained an enigma. A\nsmall number of FRBs have displayed some level of quasi-periodicity in their\nburst profile, which can be used to constrain their plausible progenitors.\nHowever, these studies suffer from the lack of polarisation data which can\ngreatly assist in constraining possible FRB progenitors and environments. Here\nwe report on the detection and characterisation of FRB 20230708A by the\nAustralian Square Kilometre Array Pathfinder (ASKAP), a burst which displays a\nrich temporal and polarimetric morphology. We model the burst time series to\ntest for the presence of periodicity, scattering and scintillation. We find a\npotential period of T = 7.267 ms within the burst, but with a low statistical\nsignificance of 1.77$\\sigma$. Additionally, we model the burst's time- and\nfrequency-dependent polarisation to search for the presence of (relativistic\nand non-relativistic) propagation effects. We find no evidence to suggest that\nthe high circular polarisation seen in FRB 20230708A is generated by Faraday\nconversion. The majority of the properties of FRB 20230708A are broadly\nconsistent with a (non-millisecond) magnetar model in which the quasi-periodic\nmorphology results from microstructure in the beamed emission, but other\nexplanations are not excluded.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"khw7N1AGgMw1ogitQyG5RUO5gMTMk0fUjJJYSXv2ezY","pdfSize":"2383472"}