{
  "id": "2412.05473",
  "title": "Hydroxyl Lines and Moonlight: a High Spectral Resolution Investigation\n  of NIR skylines from Maunakea to guide NIR spectroscopic surveys",
  "authors": "Frederick Dauphin, Andreea Petric, \\'Etienne Artigau, Andrew W.\n  Stephens, Neil James Cook, Steven Businger, Nicolas Flagey, Jennifer\n  Marshall, Michelle Ntampaka, Swara Ravindranath, Laurie Rousseau-Nepton",
  "authorsParsed": [
    [
      "Dauphin",
      "Frederick",
      ""
    ],
    [
      "Petric",
      "Andreea",
      ""
    ],
    [
      "Artigau",
      "Étienne",
      ""
    ],
    [
      "Stephens",
      "Andrew W.",
      ""
    ],
    [
      "Cook",
      "Neil James",
      ""
    ],
    [
      "Businger",
      "Steven",
      ""
    ],
    [
      "Flagey",
      "Nicolas",
      ""
    ],
    [
      "Marshall",
      "Jennifer",
      ""
    ],
    [
      "Ntampaka",
      "Michelle",
      ""
    ],
    [
      "Ravindranath",
      "Swara",
      ""
    ],
    [
      "Rousseau-Nepton",
      "Laurie",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 23:56:59 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733529419000,
  "abstract": "  Subtracting the changing sky contribution from the near-infrared (NIR)\nspectra of faint astronomical objects is challenging and crucial to a wide\nrange of science cases such as estimating the velocity dispersions of dwarf\ngalaxies, studying the gas dynamics in faint galaxies, measuring accurate\nredshifts, and any spectroscopic studies of faint targets. Since the sky\nbackground varies with time and location, NIR spectral observations, especially\nthose employing fiber spectrometers and targeting extended sources, require\nfrequent sky-only observations for calibration. However, sky subtraction can be\noptimized with sufficient a priori knowledge of the sky's variability. In this\nwork, we explore how to optimize sky subtraction by analyzing 1075\nhigh-resolution NIR spectra from the CFHT's SPIRou on Maunakea, and we estimate\nthe variability of 481 hydroxyl (OH) lines. These spectra were collected during\ntwo sets of three nights dedicated to obtaining sky observations every five and\na half minutes. During the first set, we observed how the Moon affects the NIR,\nwhich has not been accurately measured at these wavelengths. We suggest\naccounting for the Moon contribution at separation distances less than 10\ndegrees when 1) reconstructing the sky using principal component analysis 2)\nobserving targets at Y JHK mags fainter than ~15 and 3) attempting a sky\nsubtraction better than 1%. We also identified 126 spectral doublets, or OH\nlines that split into at least two components, at SPIRou's resolution. In\naddition, we used Lomb-Scargle Periodograms and Gaussian process regression to\nestimate that most OH lines vary on similar timescales, which provides a\nvaluable input for IR spectroscopic survey strategies. The data and code\ndeveloped for this study are publicly available.\n",
  "subjects": [
    "Astrophysics/Instrumentation and Methods for Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "R5pVpdtQ_sVZglFXpd57C4s-gCsaznQR8rv6-fhNAhc",
  "pdfSize": "29831863"
}