{"id":"2412.07392","title":"Benchmarking Vision-Based Object Tracking for USVs in Complex Maritime\n  Environments","authors":"Muhayy Ud Din and Ahsan B. Bakht and Waseem Akram and Yihao Dong and\n  Lakmal Seneviratne and Irfan Hussain","authorsParsed":[["Din","Muhayy Ud",""],["Bakht","Ahsan B.",""],["Akram","Waseem",""],["Dong","Yihao",""],["Seneviratne","Lakmal",""],["Hussain","Irfan",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 10:35:17 GMT"}],"updateDate":"2024-12-11","timestamp":1733826917000,"abstract":"  Vision-based target tracking is crucial for unmanned surface vehicles (USVs)\nto perform tasks such as inspection, monitoring, and surveillance. However,\nreal-time tracking in complex maritime environments is challenging due to\ndynamic camera movement, low visibility, and scale variation. Typically, object\ndetection methods combined with filtering techniques are commonly used for\ntracking, but they often lack robustness, particularly in the presence of\ncamera motion and missed detections. Although advanced tracking methods have\nbeen proposed recently, their application in maritime scenarios is limited. To\naddress this gap, this study proposes a vision-guided object-tracking framework\nfor USVs, integrating state-of-the-art tracking algorithms with low-level\ncontrol systems to enable precise tracking in dynamic maritime environments. We\nbenchmarked the performance of seven distinct trackers, developed using\nadvanced deep learning techniques such as Siamese Networks and Transformers, by\nevaluating them on both simulated and real-world maritime datasets. In\naddition, we evaluated the robustness of various control algorithms in\nconjunction with these tracking systems. The proposed framework was validated\nthrough simulations and real-world sea experiments, demonstrating its\neffectiveness in handling dynamic maritime conditions. The results show that\nSeqTrack, a Transformer-based tracker, performed best in adverse conditions,\nsuch as dust storms. Among the control algorithms evaluated, the linear\nquadratic regulator controller (LQR) demonstrated the most robust and smooth\ncontrol, allowing for stable tracking of the USV.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"qZyatcLvh0D6AeAbEjtPpUycQ0FrdeQU_NpbG0pK0No","pdfSize":"13686536"}