{
  "id": "2412.04127",
  "title": "Frequency-tunable biphoton generation via spontaneous four-wave mixing",
  "authors": "Jiun-Shiuan Shiu, Chang-Wei Lin, Yu-Chiao Huang, Meng-Jung Lin, I-Chia\n  Huang, Ting-Ho Wu, Pei-Chen Kuan, and Yong-Fan Chen",
  "authorsParsed": [
    [
      "Shiu",
      "Jiun-Shiuan",
      ""
    ],
    [
      "Lin",
      "Chang-Wei",
      ""
    ],
    [
      "Huang",
      "Yu-Chiao",
      ""
    ],
    [
      "Lin",
      "Meng-Jung",
      ""
    ],
    [
      "Huang",
      "I-Chia",
      ""
    ],
    [
      "Wu",
      "Ting-Ho",
      ""
    ],
    [
      "Kuan",
      "Pei-Chen",
      ""
    ],
    [
      "Chen",
      "Yong-Fan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 12:50:10 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733403010000,
  "abstract": "  We present experimental results on tuning biphoton frequency by introducing a\ndetuned coupling field in spontaneous four-wave mixing (SFWM), and examine its\nimpact on the pairing ratio. This tunability is achieved by manipulating the\ninherent electromagnetically induced transparency (EIT) effect in the\ndouble-$\\Lambda$ scheme. Introducing a detuned coupling field degrades the\nefficiency of EIT-based stimulated four-wave mixing, which in turn reduces the\nbiphoton pairing ratio. However, this reduction can be mitigated by increasing\nthe optical power of the coupling field. Additionally, we observe that blue-\nand red-detuning the biphoton frequency results in distinct temporal profiles\nof biphoton wavepackets due to phase mismatch. These findings provide insights\ninto the mechanisms of frequency-tunable biphoton generation via SFWM, and\nsuggest potential optimizations for applications in quantum communication and\ninformation processing.\n",
  "subjects": [
    "Physics/Quantum Physics",
    "Physics/Atomic Physics",
    "Physics/Optics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "oWuQoUsOtnF1u3x67YsRA37916TT4qNExKZJQoPFXnw",
  "pdfSize": "2009669"
}