{
  "id": "2412.04809",
  "title": "Light-induced magnetic trapping for cold alkali atoms using a combined\n  optical tweezers and nanofibre platform",
  "authors": "Alexey Vylegzhanin, Dylan J. Brown, Sergey Abdrakhmanov and Sile Nic\n  Chormaic",
  "authorsParsed": [
    [
      "Vylegzhanin",
      "Alexey",
      ""
    ],
    [
      "Brown",
      "Dylan J.",
      ""
    ],
    [
      "Abdrakhmanov",
      "Sergey",
      ""
    ],
    [
      "Chormaic",
      "Sile Nic",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 06:55:13 GMT"
    },
    {
      "version": "v2",
      "created": "Mon, 9 Dec 2024 05:18:18 GMT"
    },
    {
      "version": "v3",
      "created": "Tue, 10 Dec 2024 13:24:51 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733468113000,
  "abstract": "  We present a magnetic trapping method for cold $^{87}$Rb atoms, utilising the\nlight-induced magnetic fields from the evanescent field of an optical nanofibre\n(ONF) in conjunction with an optical tweezers. We calculate and plot the\ntrapping potentials for both Gaussian and Laguerre-Gaussian modes of the\noptical tweezers, and quasi-linear polarisation of the ONF-guided field. Based\non the optical powers in the tweezers beam and the ONF-guided mode, we analyse\nthe trap depths and the distances of the trap minima from the surface of the\nnanofibre. We show that, by controlling the powers in both of the optical\nfields, one can vary the trap position over a few hundreds of nanometres, while\nalso influencing the trap depth and trap frequencies. Such control over atom\nposition is essential both for studying distance-dependent effects on atoms\ntrapped near dielectric surfaces, and minimising these effects for quantum\ntechnology applications.\n",
  "subjects": [
    "Physics/Atomic Physics",
    "Physics/Optics",
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "fMJN4kb78fTAneLk2sxaWBCBgES1ffr5lKJsGAO4T7s",
  "pdfSize": "3939299"
}