{
  "id": "2412.03691",
  "title": "Ferroelectric domain walls for environmental sensors",
  "authors": "L. Richarz, I. C. Skogvoll, E. Y. Tokle, K. A. Hunnestad, U. Ludacka,\n  J. He, E. Bourret, Z. Yan, A.T.J. van Helvoort, J. Schulthei{\\ss}, S. M.\n  Selbach, and D. Meier",
  "authorsParsed": [
    [
      "Richarz",
      "L.",
      ""
    ],
    [
      "Skogvoll",
      "I. C.",
      ""
    ],
    [
      "Tokle",
      "E. Y.",
      ""
    ],
    [
      "Hunnestad",
      "K. A.",
      ""
    ],
    [
      "Ludacka",
      "U.",
      ""
    ],
    [
      "He",
      "J.",
      ""
    ],
    [
      "Bourret",
      "E.",
      ""
    ],
    [
      "Yan",
      "Z.",
      ""
    ],
    [
      "van Helvoort",
      "A. T. J.",
      ""
    ],
    [
      "Schultheiß",
      "J.",
      ""
    ],
    [
      "Selbach",
      "S. M.",
      ""
    ],
    [
      "Meier",
      "D.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 20:07:42 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733342862000,
  "abstract": "  Domain walls in ferroelectric oxides provide fertile ground for the\ndevelopment of next-generation nanotechnology. Examples include\ndomain-wall-based memory, memristors, and diodes, where the unusual electronic\nproperties and the quasi-2D nature of the walls are leveraged to emulate the\nbehavior of electronic components at ultra-small length scales. Here, we\ndemonstrate atmosphere-related reversible changes in the electronic conduction\nat neutral ferroelectric domain walls in Er(Mn,Ti)O$_3$. By exposing the system\nto reducing and oxidizing conditions, we drive the domain walls from insulating\nto conducting, and vice versa, translating the environmental changes into\ncurrent signals. Density functional theory calculations show that the effect is\npredominately caused by charge carrier density modulations, which arise as\noxygen interstitials accumulate at the domain walls. The work introduces an\ninnovative concept for domain-wall based environmental sensors, giving an\nadditional dimension to the field of domain wall nanoelectronics and sensor\ntechnology in general.\n",
  "subjects": [
    "Condensed Matter/Materials Science"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "DN-btLSDNsZ8-EhVENq2IrRAlvc4XA8RmkLUFHGktUc",
  "pdfSize": "21587564"
}