{
  "id": "2412.05771",
  "title": "Prism: Semi-Supervised Multi-View Stereo with Monocular Structure Priors",
  "authors": "Alex Rich, Noah Stier, Pradeep Sen, Tobias H\\\"ollerer",
  "authorsParsed": [
    [
      "Rich",
      "Alex",
      ""
    ],
    [
      "Stier",
      "Noah",
      ""
    ],
    [
      "Sen",
      "Pradeep",
      ""
    ],
    [
      "Höllerer",
      "Tobias",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 8 Dec 2024 01:05:41 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733619941000,
  "abstract": "  The promise of unsupervised multi-view-stereo (MVS) is to leverage large\nunlabeled datasets, yet current methods underperform when training on difficult\ndata, such as handheld smartphone videos of indoor scenes. Meanwhile,\nhigh-quality synthetic datasets are available but MVS networks trained on these\ndatasets fail to generalize to real-world examples. To bridge this gap, we\npropose a semi-supervised learning framework that allows us to train on real\nand rendered images jointly, capturing structural priors from synthetic data\nwhile ensuring parity with the real-world domain. Central to our framework is a\nnovel set of losses that leverages powerful existing monocular relative-depth\nestimators trained on the synthetic dataset, transferring the rich structure of\nthis relative depth to the MVS predictions on unlabeled data. Inspired by\nperceptual image metrics, we compare the MVS and monocular predictions via a\ndeep feature loss and a multi-scale statistical loss. Our full framework, which\nwe call Prism, achieves large quantitative and qualitative improvements over\ncurrent unsupervised and synthetic-supervised MVS networks. This is a\nbest-case-scenario result, opening the door to using both unlabeled smartphone\nvideos and photorealistic synthetic datasets for training MVS networks.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "6i6yAKqxnPkrgBJhnZilkKoT86frH5KYc_s19lkfqOk",
  "pdfSize": "1874626"
}