{"id":"2412.19883","title":"A Neural Network-Based Search for Unmodeled Transients in\n  LIGO-Virgo-KAGRA's Third Observing Run","authors":"Ryan Raikman, Eric A. Moreno, Katya Govorkova, Siddharth Soni, Ethan\n  Marx, William Benoit, Alec Gunny, Deep Chatterjee, Christina Reissel, Malina\n  M. Desai, Rafia Omer, Muhammed Saleem, Philip Harris, Erik Katsavounidis,\n  Michael W. Coughlin, Dylan Rankin","authorsParsed":[["Raikman","Ryan",""],["Moreno","Eric A.",""],["Govorkova","Katya",""],["Soni","Siddharth",""],["Marx","Ethan",""],["Benoit","William",""],["Gunny","Alec",""],["Chatterjee","Deep",""],["Reissel","Christina",""],["Desai","Malina M.",""],["Omer","Rafia",""],["Saleem","Muhammed",""],["Harris","Philip",""],["Katsavounidis","Erik",""],["Coughlin","Michael W.",""],["Rankin","Dylan",""]],"versions":[{"version":"v1","created":"Fri, 27 Dec 2024 19:00:01 GMT"}],"updateDate":"2024-12-31","timestamp":1735326001000,"abstract":"  This paper presents the results of a Neural Network (NN)-based search for\nshort-duration gravitational-wave transients in data from the third observing\nrun of LIGO, Virgo, and KAGRA. The search targets unmodeled transients with\ndurations of milliseconds to a few seconds in the 30-1500 Hz frequency band,\nwithout assumptions about the incoming signal direction, polarization, or\nmorphology. Using the Gravitational Wave Anomalous Knowledge (GWAK) method,\nthree compact binary coalescences (CBCs) identified by existing pipelines are\nsuccessfully detected, along with a range of detector glitches. The algorithm\nconstructs a low-dimensional embedded space to capture the physical features of\nsignals, enabling the detection of CBCs, detector glitches, and unmodeled\ntransients. This study demonstrates GWAK's ability to enhance\ngravitational-wave searches beyond the limits of existing pipelines, laying the\ngroundwork for future detection strategies.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Astrophysics/Instrumentation and Methods for Astrophysics","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"b7-s8wUM781VWM6fvVKh_qUy1pQwHwL1FZXzLPgiMOw","pdfSize":"5745608"}