{
  "id": "2412.05219",
  "title": "Structural characterization of the candidate Weyl semimetal CeGaGe",
  "authors": "Liam J. Scanlon, Santosh Bhusal, Christina M. Hoffmann, Helen He, Sean\n  R. Parkin, Brennan J. Arnold, William J. Gannon",
  "authorsParsed": [
    [
      "Scanlon",
      "Liam J.",
      ""
    ],
    [
      "Bhusal",
      "Santosh",
      ""
    ],
    [
      "Hoffmann",
      "Christina M.",
      ""
    ],
    [
      "He",
      "Helen",
      ""
    ],
    [
      "Parkin",
      "Sean R.",
      ""
    ],
    [
      "Arnold",
      "Brennan J.",
      ""
    ],
    [
      "Gannon",
      "William J.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 17:50:52 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733507452000,
  "abstract": "  Weyl semimetals have a variety of intriguing physical properties, including\ntopologically protected electronic states that coexist with conducting states.\nPossible exploitation of topologically protected states in a conducting\nmaterial is promising for technological applications. Weyl semimetals that form\nin a non-centrosymmetric structure that also contain magnetic moments may host\na variety of emergent phenomena that cannot be seen in magnetic,\ncentrosymmetric Weyl materials. It can be difficult to distinguish definitively\nbetween a centrosymmetric structure and one of its non-centrosymmetric\nsubgroups with standard powder X-ray diffractometers in cases where two atoms\nin the compound have nearly the same atomic number, as is the case for the\ncandidate Weyl semimetal CeGaGe. In these cases, a careful single-crystal\nneutron diffraction experiment with high-angle reflections provides\ncomplimentary information to X-ray diffraction and definitively resolves any\nambiguity between centrosymmetric and non-centrosymmetric crystal structures.\nSingle-crystal neutron diffraction measurements on the candidate Weyl semimetal\nCeGaGe confirms that its structure is non-centrosymmetric, described by space\ngroup 109 $\\left(I4_1md\\right)$ rather than the centrosymmetric space group 141\n$\\left(I4_1/amd\\right)$. There are many high-angle reflections in the data set\nthat give clear, physically intuitive evidence that CeGaGe forms with $I4_1md$\nsymmetry since Bragg planes of these reflections can contain Ga with no Ge or\nvice versa whereas the Bragg planes for a structure with $I4_1/amd$ symmetry\nwould have a mix of Ga and Ge. Further, in some crystals we have studied, there\nis clear evidence for a structural transition from body-centered $I4_1md$\nsymmetry to primitive $P4_3$ and/or $P4_1$ symmetry.\n",
  "subjects": [
    "Condensed Matter/Strongly Correlated Electrons",
    "Condensed Matter/Materials Science"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "QCVm9VMTr4EN687vtZyWxGC2zeYnOgTOZoS4-GYYTEg",
  "pdfSize": "7172701"
}