{"id":"2412.10918","title":"LLMs-in-the-Loop Part 2: Expert Small AI Models for Anonymization and\n  De-identification of PHI Across Multiple Languages","authors":"Murat Gunay, Bunyamin Keles, Raife Hizlan","authorsParsed":[["Gunay","Murat",""],["Keles","Bunyamin",""],["Hizlan","Raife",""]],"versions":[{"version":"v1","created":"Sat, 14 Dec 2024 18:10:29 GMT"}],"updateDate":"2024-12-17","timestamp":1734199829000,"abstract":"  The rise of chronic diseases and pandemics like COVID-19 has emphasized the\nneed for effective patient data processing while ensuring privacy through\nanonymization and de-identification of protected health information (PHI).\nAnonymized data facilitates research without compromising patient\nconfidentiality. This paper introduces expert small AI models developed using\nthe LLM-in-the-loop methodology to meet the demand for domain-specific\nde-identification NER models. These models overcome the privacy risks\nassociated with large language models (LLMs) used via APIs by eliminating the\nneed to transmit or store sensitive data. More importantly, they consistently\noutperform LLMs in de-identification tasks, offering superior performance and\nreliability. Our de-identification NER models, developed in eight languages\n(English, German, Italian, French, Romanian, Turkish, Spanish, and Arabic)\nachieved f1-micro score averages of 0.966, 0.975, 0.976, 0.970, 0.964, 0.974,\n0.978, and 0.953 respectively. These results establish them as the most\naccurate healthcare anonymization solutions, surpassing existing small models\nand even general-purpose LLMs such as GPT-4o. While Part-1 of this series\nintroduced the LLM-in-the-loop methodology for bio-medical document\ntranslation, this second paper showcases its success in developing\ncost-effective expert small NER models in de-identification tasks. Our findings\nlay the groundwork for future healthcare AI innovations, including biomedical\nentity and relation extraction, demonstrating the value of specialized models\nfor domain-specific challenges.\n","subjects":["Computer Science/Computation and Language","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"S7K7VK8yveB_MXQzpIeI2rDk6Pzz3yr5AeJ8cNYZiYQ","pdfSize":"165732"}