{"id":"2412.16313","title":"Development of large Micromegas readout planes for experiments searching\n  for rare events","authors":"Hector Mirallas","authorsParsed":[["Mirallas","Hector",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 19:54:37 GMT"}],"updateDate":"2024-12-24","timestamp":1734724477000,"abstract":"  The use of Time Projection Chambers (TPCs) in particle physics experiments\nhas been growing since their invention, reaching sizes equivalent to buildings\n(ALICE or ATLAS at CERN). However, their application in another class of\nexperiments, commonly referred to as rare event experiments, has been more\nrecent.\n  This work focuses on two such experiments aimed at searching for rare events:\nthe search for neutrinoless double beta decay (PandaX-III experiment) and the\nsearch for WIMPs (TREX-DM experiment). Both utilize a large-sized gaseous TPC,\nnecessitating that the corresponding readout plane is also large.\n  Both also employ microbulk Micromegas readout planes. This technology has\nbecome established in recent years and is continuously improving. Due to the\nsize limitation during manufacturing and the concurrent increase in the size of\ndouble beta experiments, there arose a need to develop a tiled readout plane,\nusing a mosaic of modules with microbulk Micromegas, conforming the first part\nof this thesis, in the context of the PandaX-III experiment. The second part,\nfeaturing a single readout plane of 25 x 25 cm2 installed in TREX-DM, focuses\non the specifications that define a Micromegas and its response in a\nhigh-pressure gaseous detector.\n  Additionally, during the work on TREX-DM, the need to reduce the energy\nthreshold of the experiment emerged, leading to the development of another\ncomposite readout plane, the GEM-Micromegas system, in which a GEM specifically\nmanufactured for this system was installed above the Micromegas. Finally,\nleveraging the development of the Micromegas for TREX-DM, a new gaseous\ndetector for the detection of surface alpha particles, called AlphaCAMM, is\nplanned, designed, and implemented, addressing all the requirements of a\nlow-background detector with a projection beyond the TREX-DM experiment.\n","subjects":["Physics/Instrumentation and Detectors","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"sFL9juKx9h-F9tIFDuqmd4gfyoDWV-5Q66ZDzR7Wngk","pdfSize":"33114559"}