{
  "id": "2412.08308",
  "title": "Analyzing the Performance Portability of SYCL across CPUs, GPUs, and\n  Hybrid Systems with Protein Database Search",
  "authors": "Manuel Costanzo, Enzo Rucci, Carlos Garc\\'ia-S\\'anchez, Marcelo\n  Naiouf, Manuel Prieto-Mat\\'ias",
  "authorsParsed": [
    [
      "Costanzo",
      "Manuel",
      ""
    ],
    [
      "Rucci",
      "Enzo",
      ""
    ],
    [
      "García-Sánchez",
      "Carlos",
      ""
    ],
    [
      "Naiouf",
      "Marcelo",
      ""
    ],
    [
      "Prieto-Matías",
      "Manuel",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 11:42:03 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733917323000,
  "abstract": "  The high-performance computing (HPC) landscape is undergoing rapid\ntransformation, with an increasing emphasis on energy-efficient and\nheterogeneous computing environments. This comprehensive study extends our\nprevious research on SYCL's performance portability by evaluating its\neffectiveness across a broader spectrum of computing architectures, including\nCPUs, GPUs, and hybrid CPU-GPU configurations from NVIDIA, Intel, and AMD. Our\nanalysis covers single-GPU, multi-GPU, single-CPU, and CPU-GPU hybrid setups,\nusing the SW\\# protein database search application as a case study. The results\ndemonstrate SYCL's versatility across different architectures, maintaining\ncomparable performance to CUDA on NVIDIA GPUs while achieving similar\narchitectural efficiency rates on most CPU configurations. Although SYCL showed\nexcellent functional portability in hybrid CPU-GPU configurations, performance\nvaried significantly based on specific hardware combinations. Some performance\nlimitations were identified in multi-GPU and CPU-GPU configurations, primarily\nattributed to workload distribution strategies rather than SYCL-specific\nconstraints. These findings position SYCL as a promising unified programming\nmodel for heterogeneous computing environments, particularly for bioinformatic\napplications.\n",
  "subjects": [
    "Computer Science/Distributed, Parallel, and Cluster Computing"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "FDBNWEdDDpgU0rgSkjqDrB3Zyu0mgZ6sZUA8qlJdWjU",
  "pdfSize": "280036"
}