{
  "id": "2412.09009",
  "title": "A physics-informed transformer neural operator for learning generalized\n  solutions of initial boundary value problems",
  "authors": "Sumanth Kumar Boya, Deepak Subramani",
  "authorsParsed": [
    [
      "Boya",
      "Sumanth Kumar",
      ""
    ],
    [
      "Subramani",
      "Deepak",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 07:22:02 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1733988122000,
  "abstract": "  Initial boundary value problems arise commonly in applications with\nengineering and natural systems governed by nonlinear partial differential\nequations (PDEs). Operator learning is an emerging field for solving these\nequations by using a neural network to learn a map between infinite dimensional\ninput and output function spaces. These neural operators are trained using a\ncombination of data (observations or simulations) and PDE-residuals\n(physics-loss). A major drawback of existing neural approaches is the\nrequirement to retrain with new initial/boundary conditions, and the necessity\nfor a large amount of simulation data for training. We develop a\nphysics-informed transformer neural operator (named PINTO) that efficiently\ngeneralizes to unseen initial and boundary conditions, trained in a\nsimulation-free setting using only physics loss. The main innovation lies in\nour new iterative kernel integral operator units, implemented using\ncross-attention, to transform the PDE solution's domain points into an\ninitial/boundary condition-aware representation vector, enabling efficient\nlearning of the solution function for new scenarios. The PINTO architecture is\napplied to simulate the solutions of important equations used in engineering\napplications: advection, Burgers, and steady and unsteady Navier-Stokes\nequations (three flow scenarios). For these five test cases, we show that the\nrelative errors during testing under challenging conditions of unseen\ninitial/boundary conditions are only one-fifth to one-third of other leading\nphysics informed operator learning methods. Moreover, our PINTO model is able\nto accurately solve the advection and Burgers equations at time steps that are\nnot included in the training collocation points. The code is available at\n$\\texttt{https://github.com/quest-lab-iisc/PINTO}$\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Physics/Computational Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "AwrmKS42OA0lxYoA1kcYeWfrsPtKzGW4WzmLwJlmC9s",
  "pdfSize": "7689308"
}