{"id":"2412.12548","title":"The DESI-Lensing Mock Challenge: large-scale cosmological analysis of\n  3x2-pt statistics","authors":"C. Blake, C. Garcia-Quintero, S. Ahlen, D. Bianchi, D. Brooks, T.\n  Claybaugh, A. de la Macorra, J. DeRose, A. Dey, P. Doel, N. Emas, S. Ferraro,\n  J. E. Forero-Romero, G. Gutierrez, S. Heydenreich, K. Honscheid, C. Howlett,\n  M. Ishak, E. Jullo, R. Kehoe, D. Kirkby, A. Kremin, A. Krolewski, M.\n  Landriau, J. U. Lange, A. Leauthaud, M. E. Levi, M. Manera, R. Miquel, J.\n  Moustakas, G. Niz, W. J. Percival, I. P\\'erez-R\\`afols, A. Porredon, G.\n  Rossi, R. Ruggeri, E. Sanchez, C. Saulder, D. Schlegel, D. Sprayberry, Z.\n  Sun, G. Tarl\\'e, B. A. Weaver","authorsParsed":[["Blake","C.",""],["Garcia-Quintero","C.",""],["Ahlen","S.",""],["Bianchi","D.",""],["Brooks","D.",""],["Claybaugh","T.",""],["de la Macorra","A.",""],["DeRose","J.",""],["Dey","A.",""],["Doel","P.",""],["Emas","N.",""],["Ferraro","S.",""],["Forero-Romero","J. E.",""],["Gutierrez","G.",""],["Heydenreich","S.",""],["Honscheid","K.",""],["Howlett","C.",""],["Ishak","M.",""],["Jullo","E.",""],["Kehoe","R.",""],["Kirkby","D.",""],["Kremin","A.",""],["Krolewski","A.",""],["Landriau","M.",""],["Lange","J. U.",""],["Leauthaud","A.",""],["Levi","M. E.",""],["Manera","M.",""],["Miquel","R.",""],["Moustakas","J.",""],["Niz","G.",""],["Percival","W. J.",""],["Pérez-Ràfols","I.",""],["Porredon","A.",""],["Rossi","G.",""],["Ruggeri","R.",""],["Sanchez","E.",""],["Saulder","C.",""],["Schlegel","D.",""],["Sprayberry","D.",""],["Sun","Z.",""],["Tarlé","G.",""],["Weaver","B. A.",""]],"versions":[{"version":"v1","created":"Tue, 17 Dec 2024 05:15:06 GMT"}],"updateDate":"2024-12-18","timestamp":1734412506000,"abstract":"  The current generation of large galaxy surveys will test the cosmological\nmodel by combining multiple types of observational probes. Realising the\nstatistical promise of these new datasets requires rigorous attention to all\naspects of analysis including cosmological measurements, modelling, covariance\nand parameter likelihood. In this paper we present the results of an end-to-end\nsimulation study designed to test the analysis pipeline for the combination of\nthe Dark Energy Spectroscopic Instrument (DESI) Year 1 galaxy redshift dataset\nand separate weak gravitational lensing information from the Kilo-Degree\nSurvey, Dark Energy Survey and Hyper-Suprime-Cam Survey. Our analysis employs\nthe 3x2-pt correlation functions including cosmic shear and galaxy-galaxy\nlensing, together with the projected correlation function of the spectroscopic\nDESI lenses. We build realistic simulations of these datasets including galaxy\nhalo occupation distributions, photometric redshift errors, weights,\nmultiplicative shear calibration biases and magnification. We calculate the\nanalytical covariance of these correlation functions including the Gaussian,\nnoise and super-sample contributions, and show that our covariance\ndetermination agrees with estimates based on the ensemble of simulations. We\nuse a Bayesian inference platform to demonstrate that we can recover the\nfiducial cosmological parameters of the simulation within the statistical error\nmargin of the experiment, investigating the sensitivity to scale cuts. This\nstudy is the first in a sequence of papers in which we present and validate the\nlarge-scale 3x2-pt cosmological analysis of DESI-Y1.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ac2PehylRd_XgwaoIevhx8CSaCSt12eIUiAUkydEs3Y","pdfSize":"2864777"}