{
  "id": "2412.20622",
  "title": "HALLUCINOGEN: A Benchmark for Evaluating Object Hallucination in Large\n  Visual-Language Models",
  "authors": "Ashish Seth, Dinesh Manocha, Chirag Agarwal",
  "authorsParsed": [
    [
      "Seth",
      "Ashish",
      ""
    ],
    [
      "Manocha",
      "Dinesh",
      ""
    ],
    [
      "Agarwal",
      "Chirag",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 29 Dec 2024 23:56:01 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735516561000,
  "abstract": "  Large Vision-Language Models (LVLMs) have demonstrated remarkable performance\nin performing complex multimodal tasks. However, they are still plagued by\nobject hallucination: the misidentification or misclassification of objects\npresent in images. To this end, we propose HALLUCINOGEN, a novel visual\nquestion answering (VQA) object hallucination attack benchmark that utilizes\ndiverse contextual reasoning prompts to evaluate object hallucination in\nstate-of-the-art LVLMs. We design a series of contextual reasoning\nhallucination prompts to evaluate LVLMs' ability to accurately identify objects\nin a target image while asking them to perform diverse visual-language tasks\nsuch as identifying, locating or performing visual reasoning around specific\nobjects. Further, we extend our benchmark to high-stakes medical applications\nand introduce MED-HALLUCINOGEN, hallucination attacks tailored to the\nbiomedical domain, and evaluate the hallucination performance of LVLMs on\nmedical images, a critical area where precision is crucial. Finally, we conduct\nextensive evaluations of eight LVLMs and two hallucination mitigation\nstrategies across multiple datasets to show that current generic and medical\nLVLMs remain susceptible to hallucination attacks.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "rdLC3AeCiGuV2yHxMx-6HH1Ewl14PcItsP2c-3YeUHE",
  "pdfSize": "3402296"
}