{"id":"2412.08459","title":"Reliable Uncertainty Quantification for Fiber Orientation in Composite\n  Molding Processes using Multilevel Polynomial Surrogates","authors":"Stjepan Salatovic, Sebastian Krumscheid, Florian Wittemann, Luise\n  K\\\"arger","authorsParsed":[["Salatovic","Stjepan",""],["Krumscheid","Sebastian",""],["Wittemann","Florian",""],["Kärger","Luise",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 15:24:44 GMT"},{"version":"v2","created":"Tue, 7 Jan 2025 09:59:33 GMT"}],"updateDate":"2025-01-08","timestamp":1733930684000,"abstract":"  Fiber orientation is decisive for the mechanical properties and thus for the\nperformance of composite materials. During manufacturing, variations in\nmaterial and process parameters can significantly influence the exact fiber\norientation. We employ multilevel polynomial surrogates to model the\npropagation of uncertain material properties in the injection molding process.\nTo ensure reliable uncertainty quantification, a key focus is deriving novel\nerror bounds for statistical measures of a quantity of interest, computed via\nthese surrogates. To verify these bounds, we conduct numerical experiments\nusing the Cross-WLF viscosity model alongside the Hagen-Poiseuille flow in a\nrectangular channel. In particular, the impact of uncertainties in fiber length\nand matrix temperature on the fractional anisotropy of fiber orientation is\ninvestigated. The Folgar-Tucker equation and the improved anisotropic rotary\ndiffusion model are used, incorporating recently established analytical\nsolutions of these models as part of our verification. Our results demonstrate\nthat the investigated method significantly improves upon standard Monte Carlo\nestimation, while also providing error guarantees. These findings offer the\nfirst step toward a reliable and practical tool for optimizing fiber-reinforced\npolymer manufacturing processes in the future.\n","subjects":["Computer Science/Computational Engineering, Finance, and Science","Computer Science/Numerical Analysis","Mathematics/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"EPijn9HofkYzW3qJKPDl-gOWqFoixnRnUyHoqgdHEZY","pdfSize":"989901"}