{"id":"2412.01430","title":"MVImgNet2.0: A Larger-scale Dataset of Multi-view Images","authors":"Xiaoguang Han, Yushuang Wu, Luyue Shi, Haolin Liu, Hongjie Liao,\n  Lingteng Qiu, Weihao Yuan, Xiaodong Gu, Zilong Dong, Shuguang Cui","authorsParsed":[["Han","Xiaoguang",""],["Wu","Yushuang",""],["Shi","Luyue",""],["Liu","Haolin",""],["Liao","Hongjie",""],["Qiu","Lingteng",""],["Yuan","Weihao",""],["Gu","Xiaodong",""],["Dong","Zilong",""],["Cui","Shuguang",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 12:10:04 GMT"}],"updateDate":"2024-12-03","timestamp":1733141404000,"abstract":"  MVImgNet is a large-scale dataset that contains multi-view images of ~220k\nreal-world objects in 238 classes. As a counterpart of ImageNet, it introduces\n3D visual signals via multi-view shooting, making a soft bridge between 2D and\n3D vision. This paper constructs the MVImgNet2.0 dataset that expands MVImgNet\ninto a total of ~520k objects and 515 categories, which derives a 3D dataset\nwith a larger scale that is more comparable to ones in the 2D domain. In\naddition to the expanded dataset scale and category range, MVImgNet2.0 is of a\nhigher quality than MVImgNet owing to four new features: (i) most shoots\ncapture 360-degree views of the objects, which can support the learning of\nobject reconstruction with completeness; (ii) the segmentation manner is\nadvanced to produce foreground object masks of higher accuracy; (iii) a more\npowerful structure-from-motion method is adopted to derive the camera pose for\neach frame of a lower estimation error; (iv) higher-quality dense point clouds\nare reconstructed via advanced methods for objects captured in 360-degree\nviews, which can serve for downstream applications. Extensive experiments\nconfirm the value of the proposed MVImgNet2.0 in boosting the performance of\nlarge 3D reconstruction models. MVImgNet2.0 will be public at\nluyues.github.io/mvimgnet2, including multi-view images of all 520k objects,\nthe reconstructed high-quality point clouds, and data annotation codes, hoping\nto inspire the broader vision community.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Artificial Intelligence","Computer Science/Graphics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"XBa3_-sfhrDGGX1rTF36-NhurxOICvrWsar12Grnmi0","pdfSize":"28132320"}