{
  "id": "2412.06651",
  "title": "Chatbots im Schulunterricht: Wir testen das Fobizz-Tool zur\n  automatischen Bewertung von Hausaufgaben",
  "authors": "Rainer Muehlhoff and Marte Henningsen",
  "authorsParsed": [
    [
      "Muehlhoff",
      "Rainer",
      ""
    ],
    [
      "Henningsen",
      "Marte",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 16:50:02 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 10 Dec 2024 07:55:50 GMT"
    },
    {
      "version": "v3",
      "created": "Thu, 12 Dec 2024 14:07:42 GMT"
    },
    {
      "version": "v4",
      "created": "Tue, 17 Dec 2024 17:06:01 GMT"
    },
    {
      "version": "v5",
      "created": "Tue, 21 Jan 2025 20:54:00 GMT"
    }
  ],
  "updateDate": "2025-01-23",
  "timestamp": 1733763002000,
  "abstract": "  This study examines the AI-powered grading tool \"AI Grading Assistant\" by the\nGerman company Fobizz, designed to support teachers in evaluating and providing\nfeedback on student assignments. Against the societal backdrop of an\noverburdened education system and rising expectations for artificial\nintelligence as a solution to these challenges, the investigation evaluates the\ntool's functional suitability through two test series. The results reveal\nsignificant shortcomings: The tool's numerical grades and qualitative feedback\nare often random and do not improve even when its suggestions are incorporated.\nThe highest ratings are achievable only with texts generated by ChatGPT. False\nclaims and nonsensical submissions frequently go undetected, while the\nimplementation of some grading criteria is unreliable and opaque. Since these\ndeficiencies stem from the inherent limitations of large language models\n(LLMs), fundamental improvements to this or similar tools are not immediately\nforeseeable. The study critiques the broader trend of adopting AI as a quick\nfix for systemic problems in education, concluding that Fobizz's marketing of\nthe tool as an objective and time-saving solution is misleading and\nirresponsible. Finally, the study calls for systematic evaluation and\nsubject-specific pedagogical scrutiny of the use of AI tools in educational\ncontexts.\n",
  "subjects": [
    "Computer Science/Computers and Society",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Computation and Language",
    "Computer Science/Emerging Technologies"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "mwp3s5UxNTQIYe_Rz3u_dwg6psw8s1NXplUVpOwvTN8",
  "pdfSize": "3264638"
}