{
  "id": "2412.12544",
  "title": "Seed-CTS: Unleashing the Power of Tree Search for Superior Performance\n  in Competitive Coding Tasks",
  "authors": "Hao Wang, Boyi Liu, Yufeng Zhang, Jie Chen",
  "authorsParsed": [
    [
      "Wang",
      "Hao",
      ""
    ],
    [
      "Liu",
      "Boyi",
      ""
    ],
    [
      "Zhang",
      "Yufeng",
      ""
    ],
    [
      "Chen",
      "Jie",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 05:10:21 GMT"
    },
    {
      "version": "v2",
      "created": "Sat, 28 Dec 2024 02:30:02 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1734412221000,
  "abstract": "  Competition-level code generation tasks pose significant challenges for\ncurrent state-of-the-art large language models (LLMs). For example, on the\nLiveCodeBench-Hard dataset, models such as O1-Mini and O1-Preview achieve\npass@1 rates of only 0.366 and 0.143, respectively. While tree search\ntechniques have proven effective in domains like mathematics and general\ncoding, their potential in competition-level code generation remains\nunder-explored. In this work, we propose a novel token-level tree search method\nspecifically designed for code generation. Leveraging\nQwen2.5-Coder-32B-Instruct, our approach achieves a pass rate of 0.305 on\nLiveCodeBench-Hard, surpassing the pass@100 performance of GPT4o-0513 (0.245).\nFurthermore, by integrating Chain-of-Thought (CoT) prompting, we improve our\nmethod's performance to 0.351, approaching O1-Mini's pass@1 rate. To ensure\nreproducibility, we report the average number of generations required per\nproblem by our tree search method on the test set. Our findings underscore the\npotential of tree search to significantly enhance performance on\ncompetition-level code generation tasks. This opens up new possibilities for\nlarge-scale synthesis of challenging code problems supervised fine-tuning (SFT)\ndata, advancing competition-level code generation tasks.\n",
  "subjects": [
    "Computer Science/Artificial Intelligence",
    "Computer Science/Software Engineering"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "qBdU3LIIomjSM6tGwL-4y4H1hQ7d7D9fl1hAP6KKfDo",
  "pdfSize": "5095878"
}