{
  "id": "2412.05977",
  "title": "Hysteresis-controlled Van der Waals tunneling infrared detector enabled\n  by selective layer heating",
  "authors": "Dmitry A. Mylnikov, Mikhail A. Kashchenko, Ilya V. Safonov, Kostya S.\n  Novoselov, Denis A. Bandurin, Alexander I. Chernov, Dmitry A. Svintsov",
  "authorsParsed": [
    [
      "Mylnikov",
      "Dmitry A.",
      ""
    ],
    [
      "Kashchenko",
      "Mikhail A.",
      ""
    ],
    [
      "Safonov",
      "Ilya V.",
      ""
    ],
    [
      "Novoselov",
      "Kostya S.",
      ""
    ],
    [
      "Bandurin",
      "Denis A.",
      ""
    ],
    [
      "Chernov",
      "Alexander I.",
      ""
    ],
    [
      "Svintsov",
      "Dmitry A.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 8 Dec 2024 15:53:00 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733673180000,
  "abstract": "  Mid-infrared (mid-IR) photodetectors play a crucial role in various\napplications, including the development of biomimetic vision systems that\nemulate neuronal function. However, current mid-IR photodetector technologies\nare limited by their cost and efficiency. In this work, we demonstrate a new\ntype of photodetector based on a tunnel structure made of two-dimensional\nmaterials. The effect manifests when the upper and lower layers of the tunnel\nstructure are heated differently. The photoswitching is threshold-based and\nrepresents a ``jump'' in voltage to another branch of the current-voltage\ncharacteristic when illuminated at a given current. This mechanism provides\nenormous photovoltage (0.05$-$1~V) even under weak illumination. Our\nphotodetector has built-in nonlinearity and is therefore an ideal candidate for\nuse in infrared vision neurons. Additionally, using this structure, we\ndemonstrated the possibility of selective heating of layers in a van der Waals\nstack using mid-IR illumination. This method will allow the study of heat\ntransfer processes between layers of van der Waals structures, opening new\navenues in the physics of phonon interactions.\n",
  "subjects": [
    "Condensed Matter/Mesoscale and Nanoscale Physics",
    "Physics/Optics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "04ZrBwwYqBfeUS5xzsfFfd65UhNL91-SDlkvjPFo4FQ",
  "pdfSize": "1466122"
}