{
  "id": "2412.00799",
  "title": "Percent-level timing of reionization: self-consistent,\n  implicit-likelihood inference from XQR-30+ Ly$\\alpha$ forest data",
  "authors": "Yuxiang Qin, Andrei Mesinger, David Prelogovi\\'c, George Becker,\n  Manuela Bischetti, Sarah E. I. Bosman, Frederick B. Davies, Valentina\n  D'Odorico, Prakash Gaikwad, Martin G. Haehnelt, Laura Keating, Samuel Lai,\n  Emma Ryan-Weber, Sindhu Satyavolu, Fabian Walter and Yongda Zhu",
  "authorsParsed": [
    [
      "Qin",
      "Yuxiang",
      ""
    ],
    [
      "Mesinger",
      "Andrei",
      ""
    ],
    [
      "Prelogović",
      "David",
      ""
    ],
    [
      "Becker",
      "George",
      ""
    ],
    [
      "Bischetti",
      "Manuela",
      ""
    ],
    [
      "Bosman",
      "Sarah E. I.",
      ""
    ],
    [
      "Davies",
      "Frederick B.",
      ""
    ],
    [
      "D'Odorico",
      "Valentina",
      ""
    ],
    [
      "Gaikwad",
      "Prakash",
      ""
    ],
    [
      "Haehnelt",
      "Martin G.",
      ""
    ],
    [
      "Keating",
      "Laura",
      ""
    ],
    [
      "Lai",
      "Samuel",
      ""
    ],
    [
      "Ryan-Weber",
      "Emma",
      ""
    ],
    [
      "Satyavolu",
      "Sindhu",
      ""
    ],
    [
      "Walter",
      "Fabian",
      ""
    ],
    [
      "Zhu",
      "Yongda",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 1 Dec 2024 12:59:51 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733057991000,
  "abstract": "  The Lyman alpha (Lya) forest in the spectra of z>5 quasars provides a\npowerful probe of the late stages of the Epoch of Reionization (EoR). With the\nrecent advent of exquisite datasets such as XQR-30, many models have struggled\nto reproduce the observed large-scale fluctuations in the Lya opacity. Here we\nintroduce a Bayesian analysis framework that forward-models large-scale\nlightcones of IGM properties, and accounts for unresolved sub-structure in the\nLya opacity by calibrating to higher-resolution hydrodynamic simulations. Our\nmodels directly connect physically-intuitive galaxy properties with the\ncorresponding IGM evolution, without having to tune \"effective\" parameters or\ncalibrate out the mean transmission. The forest data, in combination with UV\nluminosity functions and the CMB optical depth, are able to constrain global\nIGM properties at percent level precision in our fiducial model. Unlike many\nother works, we recover the forest observations without evoking a rapid drop in\nthe ionizing emissivity from z~7 to 5.5, which we attribute to our sub-grid\nmodel for recombinations. In this fiducial model, reionization ends at\n$z=5.44\\pm0.02$ and the EoR mid-point is at $z=7.7\\pm0.1$. The ionizing escape\nfraction increases towards faint galaxies, showing a mild redshift evolution at\nfixed UV magnitude, Muv. Half of the ionizing photons are provided by galaxies\nfainter than Muv~-12, well below direct detection limits of optical/NIR\ninstruments including JWST. We also show results from an alternative galaxy\nmodel that does not allow for a redshift evolution in the ionizing escape\nfraction. Despite being decisively disfavored by the Bayesian evidence, the\nposterior of this model is in qualitative agreement with that from our fiducial\nmodel. We caution however that our conclusions regarding the early stages of\nthe EoR and which sources reionized the Universe are more model-dependent.\n",
  "subjects": [
    "Astrophysics/Cosmology and Nongalactic Astrophysics",
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "sm8RI2HMTAWCVORbc7fzBf1KzXXrm0wPftmC7i91oXk",
  "pdfSize": "6637093"
}