{"id":"2412.17986","title":"Ultrafast Coherent Dynamics of Microring Modulators","authors":"Alireza Geravand (1), Zibo Zheng (1), Farshid Shateri (1), Simon\n  Levasseur (1), Leslie A. Rusch (1), Wei Shi (1) ((1) Universit\\'e Laval)","authorsParsed":[["Geravand","Alireza","","Université Laval"],["Zheng","Zibo","","Université Laval"],["Shateri","Farshid","","Université Laval"],["Levasseur","Simon","","Université Laval"],["Rusch","Leslie A.","","Université Laval"],["Shi","Wei","","Université Laval"]],"versions":[{"version":"v1","created":"Mon, 23 Dec 2024 21:12:52 GMT"}],"updateDate":"2024-12-25","timestamp":1734988372000,"abstract":"  Next-generation computing clusters require ultra-high-bandwidth optical\ninterconnects to support large-scale artificial-intelligence applications. In\nthis context, microring modulators (MRMs) emerge as a promising solution.\nNevertheless, their potential is curtailed by inherent challenges, such as\npronounced frequency chirp and dynamic non-linearity. Moreover, a comprehensive\nunderstanding of their coherent dynamics is still lacking, which further\nconstrains their applicability and efficiency. Consequently, these constraints\nhave confined their use to spectrally inefficient intensity-modulation\ndirect-detection links. In this work, we present a thorough study of MRM\ncoherent dynamics, unlocking phase as a new dimension for MRM-based high-speed\ndata transmission in advanced modulation formats. We demonstrate that the phase\nand intensity modulations of MRMs exhibit distinct yet coupled dynamics,\nlimiting their direct application in higher-order modulation formats. This\nchallenge can be addressed by embedding a pair of MRMs within a Mach-Zehnder\ninterferometer in a push-pull configuration, enabling a bistable phase response\nand unchirped amplitude modulation. Furthermore, we show that its amplitude\nfrequency response exhibits a distinct dependency on frequency detuning\ncompared to phase and intensity modulations of MRMs, without strong peaking\nnear resonance. Harnessing the ultra-fast coherent dynamics, we designed and\nexperimentally demonstrated an ultra-compact, ultra-wide-bandwidth\nin-phase/quadrature (I/Q) modulator on a silicon chip fabricated using a\nCMOS-compatible photonic process. Achieving a record on-chip shoreline\nbandwidth density exceeding 5Tb/s/mm, our device enabled coherent transmission\nfor symbol rates up to 180Gbaud and a net bit rate surpassing 1Tb/s over an\n80km span, with modulation energy consumption as low as 10.4fJ/bit.\n","subjects":["Physics/Optics","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"xO1hAdHtBjihlReHhhUZuOypI8nEZskH_2XT-Vy96WI","pdfSize":"13569172"}