{
  "id": "2412.01888",
  "title": "The Millennium and Astrid galaxies in effective field theory: comparison\n  with galaxy-halo connection models at the field level",
  "authors": "Mikhail M. Ivanov, Carolina Cuesta-Lazaro, Andrej Obuljen, Michael W.\n  Toomey, Yueying Ni, Sownak Bose, Boryana Hadzhiyska, C\\'esar\n  Hern\\'andez-Aguayo, Lars Hernquist, Rahul Kannan and Volker Springel",
  "authorsParsed": [
    [
      "Ivanov",
      "Mikhail M.",
      ""
    ],
    [
      "Cuesta-Lazaro",
      "Carolina",
      ""
    ],
    [
      "Obuljen",
      "Andrej",
      ""
    ],
    [
      "Toomey",
      "Michael W.",
      ""
    ],
    [
      "Ni",
      "Yueying",
      ""
    ],
    [
      "Bose",
      "Sownak",
      ""
    ],
    [
      "Hadzhiyska",
      "Boryana",
      ""
    ],
    [
      "Hernández-Aguayo",
      "César",
      ""
    ],
    [
      "Hernquist",
      "Lars",
      ""
    ],
    [
      "Kannan",
      "Rahul",
      ""
    ],
    [
      "Springel",
      "Volker",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 19:00:00 GMT"
    }
  ],
  "updateDate": "2024-12-04",
  "timestamp": 1733166000000,
  "abstract": "  Cosmological analyses of redshift space clustering data are primarily based\non using luminous ``red'' galaxies (LRGs) and ``blue'' emission line galaxies\n(ELGs) to trace underlying dark matter. Using the large high-fidelity\nhigh-resolution MillenniumTNG (MTNG) and Astrid simulations, we study these\ngalaxies with the effective field theory (EFT)-based field level forward model.\nWe confirm that both red and blue galaxies can be accurately modeled with EFT\nat the field level and their parameters match those of the phenomenological\nhalo-based models. Specifically, we consider the state of the art Halo\nOccupation Distribution (HOD) and High Mass Quenched (HMQ) models for the red\nand blue galaxies, respectively. Our results explicitly confirm the validity of\nthe halo-based models on large scales beyond the two-point statistics. In\naddition, we validate the field-level HOD/HMQ-based priors for EFT full-shape\nanalysis. We find that the local bias parameters of the ELGs are in tension\nwith the predictions of the LRG-like HOD models and present a simple analytic\nargument explaining this phenomenology. We also confirm that ELGs exhibit\nweaker non-linear redshift-space distortions (``fingers-of-God''), suggesting\nthat a significant fraction of their data should be perturbative. We find that\nthe response of EFT parameters to galaxy selection is sensitive to assumptions\nabout baryonic feedback, suggesting that a detailed understanding of feedback\nprocesses is necessary for robust predictions of EFT parameters. Finally, using\nneural density estimation based on paired HOD-EFT parameter samples, we obtain\noptimal HOD models that reproduce the clustering of Astrid and MTNG galaxies.\n",
  "subjects": [
    "Astrophysics/Cosmology and Nongalactic Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "TiU1D2UO48k9wqqwd0gRu40ovLHB5GB8TCn9CImcAjM",
  "pdfSize": "13525660"
}