{
  "id": "2412.01458",
  "title": "Real-time tracking the energy flow in cluster formation",
  "authors": "Michael Stadlhofer, Bernhard Thaler, Pascal Heim, Josef\n  Tiggesb\\\"aumker, and Markus Koch",
  "authorsParsed": [
    [
      "Stadlhofer",
      "Michael",
      ""
    ],
    [
      "Thaler",
      "Bernhard",
      ""
    ],
    [
      "Heim",
      "Pascal",
      ""
    ],
    [
      "Tiggesbäumker",
      "Josef",
      ""
    ],
    [
      "Koch",
      "Markus",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 12:50:52 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733143852000,
  "abstract": "  While photodissociation of molecular systems has been extensively studied,\nthe photoinduced formation of chemical bonds remains largely unexplored.\nEspecially for larger aggregates, the electronic and nuclear dynamics involved\nin the cluster formation process remain elusive. This limitation is rooted in\ndifficulties to prepare reactants at well-defined initial conditions. Here, we\novercome this hurdle by exploiting the exceptional solvation properties of\nhelium nanodroplets. We load the droplets with Mg atoms and investigate the\ndynamical response of the formed Mg$_n$ aggregates to photoexcitation with\ntime-resolved photoelectron spectroscopy. Beside the response expected for\nconventional Mg$_n$ clusters, consisting of a prompt signal rise and a decay\ncharacteristic for van der Waals bonds, the transient spectra also show a\ndelayed photoelectron band peaking at 1.2 ps. This delayed signal rise is\ncharacteristic for nuclear dynamics and represents the transition of Mg$_n$\naggregates from a metastable, foam-like configuration, where Mg atoms are\nstabilized with a previously predicted interatomic spacing of 9.5 A, to a\ncompact cluster. With global fitting analysis and ion-electron coincidence\ndetection, the concerted electronic and nuclear dynamics can be tracked on a fs\ntimescale. We find that cluster formation, proceeding with a ($450\\pm180$) fs\ntime constant, is accompanied by the population of highly-excited atomic\nstates. We propose an energy pooling reaction in collisions of two or more\nexcited Mg atoms during cluster formation as the mechanism leading to\npopulation of these high-lying Mg states. Additionally, conversion to kinetic\nenergy through electronic relaxation leads to fragmentation and ejection of\nionic cluster fragments from the He droplet. These results underline the\npotential of He droplets for time-resolved studies of bond formation and to\nuncover involved processes.\n",
  "subjects": [
    "Physics/Chemical Physics",
    "Physics/Atomic and Molecular Clusters"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "G7qHNsTA--OWmlV6fqVVDM17yMwEq-3AfOgLHpmTVyM",
  "pdfSize": "4757545"
}