{"id":"2412.20709","title":"Residual Connection Networks in Medical Image Processing: Exploration of\n  ResUnet++ Model Driven by Human Computer Interaction","authors":"Peixin Dai, Jingsi Zhang, Zhitao Shu","authorsParsed":[["Dai","Peixin",""],["Zhang","Jingsi",""],["Shu","Zhitao",""]],"versions":[{"version":"v1","created":"Mon, 30 Dec 2024 04:57:26 GMT"}],"updateDate":"2024-12-31","timestamp":1735534646000,"abstract":"  Accurate identification and localisation of brain tumours from medical images\nremain challenging due to tumour variability and structural complexity.\nConvolutional Neural Networks (CNNs), particularly ResNet and Unet, have made\nsignificant progress in medical image processing, offering robust capabilities\nfor image segmentation. However, limited research has explored their\nintegration with human-computer interaction (HCI) to enhance usability,\ninterpretability, and clinical applicability. This paper introduces ResUnet++,\nan advanced hybrid model combining ResNet and Unet++, designed to improve\ntumour detection and localisation while fostering seamless interaction between\nclinicians and medical imaging systems. ResUnet++ integrates residual blocks in\nboth the downsampling and upsampling phases, ensuring critical image features\nare preserved. By incorporating HCI principles, the model provides intuitive,\nreal-time feedback, enabling clinicians to visualise and interact with tumour\nlocalisation results effectively. This fosters informed decision-making and\nsupports workflow efficiency in clinical settings. We evaluated ResUnet++ on\nthe LGG Segmentation Dataset, achieving a Jaccard Loss of 98.17%. The results\ndemonstrate its strong segmentation performance and potential for real-world\napplications. By bridging advanced medical imaging techniques with HCI,\nResUnet++ offers a foundation for developing interactive diagnostic tools,\nimproving clinician trust, decision accuracy, and patient outcomes, and\nadvancing the integration of AI in healthcare workflows.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_0f89wdfErhQdw1kCEbeneXS-8DvK6NA_-_6GZUBQ9o","pdfSize":"300653"}