{
  "id": "2412.05445",
  "title": "From Voice to Value: Leveraging AI to Enhance Spoken Online Reviews on\n  the Go",
  "authors": "Kavindu Ravishan, D\\'aniel Szab\\'o, Niels van Berkel, Aku Visuri,\n  Chi-Lan Yang, Koji Yatani, Simo Hosio",
  "authorsParsed": [
    [
      "Ravishan",
      "Kavindu",
      ""
    ],
    [
      "Szabó",
      "Dániel",
      ""
    ],
    [
      "van Berkel",
      "Niels",
      ""
    ],
    [
      "Visuri",
      "Aku",
      ""
    ],
    [
      "Yang",
      "Chi-Lan",
      ""
    ],
    [
      "Yatani",
      "Koji",
      ""
    ],
    [
      "Hosio",
      "Simo",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 21:59:47 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 10 Dec 2024 19:31:29 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733522387000,
  "abstract": "  Online reviews help people make better decisions. Review platforms usually\ndepend on typed input, where leaving a good review requires significant effort\nbecause users must carefully organize and articulate their thoughts. This may\ndiscourage users from leaving comprehensive and high-quality reviews,\nespecially when they are on the go. To address this challenge, we developed\nVocalizer, a mobile application that enables users to provide reviews through\nvoice input, with enhancements from a large language model (LLM). In a\nlongitudinal study, we analysed user interactions with the app, focusing on\nAI-driven features that help refine and improve reviews. Our findings show that\nusers frequently utilized the AI agent to add more detailed information to\ntheir reviews. We also show how interactive AI features can improve users\nself-efficacy and willingness to share reviews online. Finally, we discuss the\nopportunities and challenges of integrating AI assistance into review-writing\nsystems.\n",
  "subjects": [
    "Computer Science/Human-Computer Interaction",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "ZvqB9ZRcS8Iub0eAPG1bTOB05b5VeF-akoTMzvD7ojA",
  "pdfSize": "3047752"
}