{
  "id": "2412.08541",
  "title": "Euclidean Fast Attention: Machine Learning Global Atomic Representations\n  at Linear Cost",
  "authors": "J. Thorben Frank, Stefan Chmiela, Klaus-Robert M\\\"uller, Oliver T.\n  Unke",
  "authorsParsed": [
    [
      "Frank",
      "J. Thorben",
      ""
    ],
    [
      "Chmiela",
      "Stefan",
      ""
    ],
    [
      "Müller",
      "Klaus-Robert",
      ""
    ],
    [
      "Unke",
      "Oliver T.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 16:59:09 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733936349000,
  "abstract": "  Long-range correlations are essential across numerous machine learning tasks,\nespecially for data embedded in Euclidean space, where the relative positions\nand orientations of distant components are often critical for accurate\npredictions. Self-attention offers a compelling mechanism for capturing these\nglobal effects, but its quadratic complexity presents a significant practical\nlimitation. This problem is particularly pronounced in computational chemistry,\nwhere the stringent efficiency requirements of machine learning force fields\n(MLFFs) often preclude accurately modeling long-range interactions. To address\nthis, we introduce Euclidean fast attention (EFA), a linear-scaling\nattention-like mechanism designed for Euclidean data, which can be easily\nincorporated into existing model architectures. A core component of EFA are\nnovel Euclidean rotary positional encodings (ERoPE), which enable efficient\nencoding of spatial information while respecting essential physical symmetries.\nWe empirically demonstrate that EFA effectively captures diverse long-range\neffects, enabling EFA-equipped MLFFs to describe challenging chemical\ninteractions for which conventional MLFFs yield incorrect results.\n",
  "subjects": [
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "3sDVckQQiegCNOaIwlohC3dqwbRCQ8kFpc3F-cYuoM8",
  "pdfSize": "5114127"
}