{"id":"2412.02180","title":"Optical losses as a function of beam position on the mirrors in a 285-m\n  suspended Fabry-Perot cavity","authors":"Y. Zhao, M. Vardaro, E. Capocasa, J. Ding, Y. Guo, M. Lequime, M.\n  Barsuglia","authorsParsed":[["Zhao","Y.",""],["Vardaro","M.",""],["Capocasa","E.",""],["Ding","J.",""],["Guo","Y.",""],["Lequime","M.",""],["Barsuglia","M.",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 05:27:50 GMT"}],"updateDate":"2024-12-04","timestamp":1733203670000,"abstract":"  Reducing optical losses is crucial for reducing quantum noise in\ngravitational-wave detectors. Losses are the main source of degradation of the\nsqueezed vacuum. Frequency dependent squeezing obtained via a filter cavity is\ncurrently used to reduce quantum noise in the whole detector bandwidth. Such\nfilter cavities are required to have high finesse in order to produce the\noptimal squeezing angle rotation and the presence of losses is particularly\ndetrimental for the squeezed beam, as it does multiple round trip within the\ncavity. Characterising such losses is crucial to assess the quantum noise\nreduction achievable. In this paper we present an in-situ measurement of the\noptical losses, done for different positions of the beam on the mirrors of the\nVirgo filter cavity. We implemented an automatic system to map the losses with\nrespect to the beam position on the mirrors finding that optical losses depend\nclearly on the beam hitting position on input mirror, varying from 42 ppm to 87\nppm, while they are much more uniform when we scan the end mirror (53 ppm to 61\nppm). We repeated the measurements on several days, finding a statistical error\nsmaller than 4 ppm. The lowest measured losses are not much different with\nrespect to those estimated from individual mirror characterisation performed\nbefore the installation (30.3 - 39.3 ppm). This means that no major loss\nmechanism has been neglected in the estimation presented here. The larger\ndiscrepancy found for some beam positions is likely to be due to contamination.\nIn addition to a thorough characterisation of the losses, the methodology\ndescribed in this paper allowed to find an optimal cavity axis position for\nwhich the cavity round trip losses are among the lowest ever measured. This\nwork can contribute to achieve the very challenging losses goals for the\noptical cavities of the future gravitational-wave detectors.\n","subjects":["Physics/Instrumentation and Detectors","Physics/Optics","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"9nqZkiZ-5q1X7Q2GYYQl6YrYqKZno2rXv85Woz9AGt8","pdfSize":"3875791"}