{"id":"2412.12778","title":"Rethinking Diffusion-Based Image Generators for Fundus Fluorescein\n  Angiography Synthesis on Limited Data","authors":"Chengzhou Yu (South China University of Technology), Huihui Fang\n  (Pazhou Laboratory), Hongqiu Wang (The Hong Kong University of Science and\n  Technology (Guangzhou)), Ting Deng (South China University of Technology),\n  Qing Du (South China University of Technology), Yanwu Xu (South China\n  University of Technology), and Weihua Yang (Shenzhen Eye Hospital)","authorsParsed":[["Yu","Chengzhou","","South China University of Technology"],["Fang","Huihui","","Pazhou Laboratory"],["Wang","Hongqiu","","The Hong Kong University of Science and\n  Technology"],["Deng","Ting","","South China University of Technology"],["Du","Qing","","South China University of Technology"],["Xu","Yanwu","","South China\n  University of Technology"],["Yang","Weihua","","Shenzhen Eye Hospital"]],"versions":[{"version":"v1","created":"Tue, 17 Dec 2024 10:37:46 GMT"}],"updateDate":"2024-12-18","timestamp":1734431866000,"abstract":"  Fundus imaging is a critical tool in ophthalmology, with different imaging\nmodalities offering unique advantages. For instance, fundus fluorescein\nangiography (FFA) can accurately identify eye diseases. However, traditional\ninvasive FFA involves the injection of sodium fluorescein, which can cause\ndiscomfort and risks. Generating corresponding FFA images from non-invasive\nfundus images holds significant practical value but also presents challenges.\nFirst, limited datasets constrain the performance and effectiveness of models.\nSecond, previous studies have primarily focused on generating FFA for single\ndiseases or single modalities, often resulting in poor performance for patients\nwith various ophthalmic conditions. To address these issues, we propose a novel\nlatent diffusion model-based framework, Diffusion, which introduces a\nfine-tuning protocol to overcome the challenge of limited medical data and\nunleash the generative capabilities of diffusion models. Furthermore, we\ndesigned a new approach to tackle the challenges of generating across different\nmodalities and disease types. On limited datasets, our framework achieves\nstate-of-the-art results compared to existing methods, offering significant\npotential to enhance ophthalmic diagnostics and patient care. Our code will be\nreleased soon to support further research in this field.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"4fYg-6xKQRZqVPZAyUONELwflahabEYiKoK1Rj_yGw8","pdfSize":"4001627"}