{"id":"2412.09696","title":"Soybean Maturity Prediction using 2D Contour Plots from Drone based Time\n  Series Imagery","authors":"Bitgoeul Kim, Samuel W. Blair, Talukder Z. Jubery, Soumik Sarkar, Arti\n  Singh, Asheesh K. Singh, Baskar Ganapathysubramanian","authorsParsed":[["Kim","Bitgoeul",""],["Blair","Samuel W.",""],["Jubery","Talukder Z.",""],["Sarkar","Soumik",""],["Singh","Arti",""],["Singh","Asheesh K.",""],["Ganapathysubramanian","Baskar",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 19:23:50 GMT"}],"updateDate":"2024-12-16","timestamp":1734031430000,"abstract":"  Plant breeding programs require assessments of days to maturity for accurate\nselection and placement of entries in appropriate tests. In the early stages of\nthe breeding pipeline, soybean breeding programs assign relative maturity\nratings to experimental varieties that indicate their suitable maturity zones.\nTraditionally, the estimation of maturity value for breeding varieties has\ninvolved breeders manually inspecting fields and assessing maturity value\nvisually. This approach relies heavily on rater judgment, making it subjective\nand time-consuming. This study aimed to develop a machine-learning model for\nevaluating soybean maturity using UAV-based time-series imagery. Images were\ncaptured at three-day intervals, beginning as the earliest varieties started\nmaturing and continuing until the last varieties fully matured. The data\ncollected for this experiment consisted of 22,043 plots collected across three\nyears (2021 to 2023) and represent relative maturity groups 1.6 - 3.9. We\nutilized contour plot images extracted from the time-series UAV RGB imagery as\ninput for a neural network model. This contour plot approach encoded the\ntemporal and spatial variation within each plot into a single image. A deep\nlearning model was trained to utilize this contour plot to predict maturity\nratings. This model significantly improves accuracy and robustness, achieving\nup to 85% accuracy. We also evaluate the model's accuracy as we reduce the\nnumber of time points, quantifying the trade-off between temporal resolution\nand maturity prediction. The predictive model offers a scalable, objective, and\nefficient means of assessing crop maturity, enabling phenomics and ML\napproaches to reduce the reliance on manual inspection and subjective\nassessment. This approach enables the automatic prediction of relative maturity\nratings in a breeding program, saving time and resources.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"Mpu-zk30zFqjRMNF8Z-Xyt21Y-iOI-cPD8dyxfpnTTU","pdfSize":"1338273"}