{
  "id": "2412.08007",
  "title": "Geometric Deformation of Quantum Mechanics",
  "authors": "Ivan G. Avramidi and Roberto Niardi",
  "authorsParsed": [
    [
      "Avramidi",
      "Ivan G.",
      ""
    ],
    [
      "Niardi",
      "Roberto",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 01:21:57 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733880117000,
  "abstract": "  We develop a novel approach to Quantum Mechanics that we call Curved Quantum\nMechanics. We introduce an infinite-dimensional K\\\"ahler manifold ${\\cal M}$,\nthat we call the state manifold, such that the cotangent space $T_z^*{\\cal M}$\nis a Hilbert space. In this approach, a state of a quantum system is described\nby a point in the cotangent bundle $T^*{\\cal M}$, that is, by a point\n$z\\in{\\cal M}$ in the state manifold and a one-form $\\psi\\in T^*_z{\\cal M}$.\nThe quantum dynamics is described by an infinite-dimensional Hamiltonian system\non the state manifold with a magnetic field $H$, which reduces to the\nSchr\\\"odinger equation for zero curvature and reduces to the equations of\ngeodesics for zero magnetic field. The curvature of the state manifold is\ndetermined by gravity, that is, by the mass/energy of the system, so that for\nmicroscopic systems the manifold is flat and for macroscopic systems it is\nstrongly curved, which prohibits Schr\\\"odinger cat type states. We solved the\ndynamical equations exactly for the complex projective space and the complex\nhyperbolic space and show that in the case of negative curvature there is a\nbifurcation at a critical value of the curvature. This means that for small\nmass all modes are in the quantum regime with the unitary periodic dynamics and\nfor large mass there are classical modes, with not a periodic but rather an\nexponential time evolution leading to a collapse of the state vector.\n",
  "subjects": [
    "Physics/Quantum Physics",
    "Physics/High Energy Physics - Theory",
    "Physics/Mathematical Physics",
    "Mathematics/Mathematical Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "BeMztkSOKmojtWiU1ozvuqjm6WnIv_oXhdYYedptiZs",
  "pdfSize": "304066"
}