{
  "id": "2412.01975",
  "title": "Reactive Synthesis of Sensor Revealing Strategies in Hypergames on\n  Graphs",
  "authors": "Sumukha Udupa, Ahmed Hemida, Charles A. Kamhoua, Jie Fu",
  "authorsParsed": [
    [
      "Udupa",
      "Sumukha",
      ""
    ],
    [
      "Hemida",
      "Ahmed",
      ""
    ],
    [
      "Kamhoua",
      "Charles A.",
      ""
    ],
    [
      "Fu",
      "Jie",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 21:04:54 GMT"
    }
  ],
  "updateDate": "2024-12-04",
  "timestamp": 1733173494000,
  "abstract": "  In many security applications of cyber-physical systems, a system designer\nmust guarantee that critical missions are satisfied against attacks in the\nsensors and actuators of the CPS. Traditional security design of CPSs often\nassume that attackers have complete knowledge of the system. In this article,\nwe introduce a class of deception techniques and study how to leverage\nasymmetric information created by deception to strengthen CPS security.\nConsider an adversarial interaction between a CPS defender and an attacker, who\ncan perform sensor jamming attacks. To mitigate such attacks, the defender\nintroduces asymmetrical information by deploying a \"hidden sensor,\" whose\npresence is initially undisclosed but can be revealed if queried. We introduce\nhypergames on graphs to model this game with asymmetric information. Building\non the solution concept called subjective rationalizable strategies in\nhypergames, we identify two stages in the game: An initial game stage where the\ndefender commits to a strategy perceived rationalizable by the attacker until\nhe deviates from the equilibrium in the attacker's perceptual game; Upon the\ndeviation, a delay-attack game stage starts where the defender plays against\nthe attacker, who has a bounded delay in attacking the sensor being revealed.\nBased on backward induction, we develop an algorithm that determines, for any\ngiven state, if the defender can benefit from hiding a sensor and revealing it\nlater. If the answer is affirmative, the algorithm outputs a sensor revealing\nstrategy to determine when to reveal the sensor during dynamic interactions. We\ndemonstrate the effectiveness of our deceptive strategies through two case\nstudies related to CPS security applications.\n",
  "subjects": [
    "Computer Science/Computer Science and Game Theory",
    "Computer Science/Robotics",
    "Computer Science/Systems and Control",
    "Electrical Engineering and Systems Science/Systems and Control"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "6wz0GANhELjyHk0yZX2TpG8kkKfiAC3O1FDzPuw67ks",
  "pdfSize": "1823641"
}