{
  "id": "2412.12472",
  "title": "Knowledge Boundary of Large Language Models: A Survey",
  "authors": "Moxin Li, Yong Zhao, Yang Deng, Wenxuan Zhang, Shuaiyi Li, Wenya Xie,\n  See-Kiong Ng, Tat-Seng Chua",
  "authorsParsed": [
    [
      "Li",
      "Moxin",
      ""
    ],
    [
      "Zhao",
      "Yong",
      ""
    ],
    [
      "Deng",
      "Yang",
      ""
    ],
    [
      "Zhang",
      "Wenxuan",
      ""
    ],
    [
      "Li",
      "Shuaiyi",
      ""
    ],
    [
      "Xie",
      "Wenya",
      ""
    ],
    [
      "Ng",
      "See-Kiong",
      ""
    ],
    [
      "Chua",
      "Tat-Seng",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 02:14:02 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734401642000,
  "abstract": "  Although large language models (LLMs) store vast amount of knowledge in their\nparameters, they still have limitations in the memorization and utilization of\ncertain knowledge, leading to undesired behaviors such as generating untruthful\nand inaccurate responses. This highlights the critical need to understand the\nknowledge boundary of LLMs, a concept that remains inadequately defined in\nexisting research. In this survey, we propose a comprehensive definition of the\nLLM knowledge boundary and introduce a formalized taxonomy categorizing\nknowledge into four distinct types. Using this foundation, we systematically\nreview the field through three key lenses: the motivation for studying LLM\nknowledge boundaries, methods for identifying these boundaries, and strategies\nfor mitigating the challenges they present. Finally, we discuss open challenges\nand potential research directions in this area. We aim for this survey to offer\nthe community a comprehensive overview, facilitate access to key issues, and\ninspire further advancements in LLM knowledge research.\n",
  "subjects": [
    "Computer Science/Computation and Language"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "H-wUYYZq-A4gzzQxTUCveQxsU1nwZui02Jifgp8rcFs",
  "pdfSize": "1113959"
}