{
  "id": "2412.08593",
  "title": "Leveraging Graph-RAG and Prompt Engineering to Enhance LLM-Based\n  Automated Requirement Traceability and Compliance Checks",
  "authors": "Arsalan Masoudifard, Mohammad Mowlavi Sorond, Moein Madadi, Mohammad\n  Sabokrou, Elahe Habibi",
  "authorsParsed": [
    [
      "Masoudifard",
      "Arsalan",
      ""
    ],
    [
      "Sorond",
      "Mohammad Mowlavi",
      ""
    ],
    [
      "Madadi",
      "Moein",
      ""
    ],
    [
      "Sabokrou",
      "Mohammad",
      ""
    ],
    [
      "Habibi",
      "Elahe",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 18:11:39 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733940699000,
  "abstract": "  Ensuring that Software Requirements Specifications (SRS) align with\nhigher-level organizational or national requirements is vital, particularly in\nregulated environments such as finance and aerospace. In these domains,\nmaintaining consistency, adhering to regulatory frameworks, minimizing errors,\nand meeting critical expectations are essential for the reliable functioning of\nsystems. The widespread adoption of large language models (LLMs) highlights\ntheir immense potential, yet there remains considerable scope for improvement\nin retrieving relevant information and enhancing reasoning capabilities. This\nstudy demonstrates that integrating a robust Graph-RAG framework with advanced\nprompt engineering techniques, such as Chain of Thought and Tree of Thought,\ncan significantly enhance performance. Compared to baseline RAG methods and\nsimple prompting strategies, this approach delivers more accurate and\ncontext-aware results. While this method demonstrates significant improvements\nin performance, it comes with challenges. It is both costly and more complex to\nimplement across diverse contexts, requiring careful adaptation to specific\nscenarios. Additionally, its effectiveness heavily relies on having complete\nand accurate input data, which may not always be readily available, posing\nfurther limitations to its scalability and practicality.\n",
  "subjects": [
    "Computer Science/Software Engineering",
    "Computer Science/Information Retrieval"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "erD9iBA1T_wiWAsfNW3HKK0F24M3Y4CvUpLM3ZL5GAA",
  "pdfSize": "2655851"
}