{
  "id": "2412.07691",
  "title": "The CARMENES search for exoplanets around M dwarfs. The impact of\n  rotation and magnetic fields on the radial velocity jitter in cool stars",
  "authors": "H. L. Ruh, M. Zechmeister, A. Reiners, E. Nagel, Y. Shan, C.\n  Cifuentes, S. V. Jeffers, L. Tal-Or, V. J. S. B\\'ejar, P. J. Amado, J. A.\n  Caballero, A. Quirrenbach, I. Ribas, J. Aceituno, A. P. Hatzes, Th. Henning,\n  A. Kaminski, D. Montes, J. C. Morales, P. Sch\\\"ofer, A. Schweitzer, R. Varas",
  "authorsParsed": [
    [
      "Ruh",
      "H. L.",
      ""
    ],
    [
      "Zechmeister",
      "M.",
      ""
    ],
    [
      "Reiners",
      "A.",
      ""
    ],
    [
      "Nagel",
      "E.",
      ""
    ],
    [
      "Shan",
      "Y.",
      ""
    ],
    [
      "Cifuentes",
      "C.",
      ""
    ],
    [
      "Jeffers",
      "S. V.",
      ""
    ],
    [
      "Tal-Or",
      "L.",
      ""
    ],
    [
      "Béjar",
      "V. J. S.",
      ""
    ],
    [
      "Amado",
      "P. J.",
      ""
    ],
    [
      "Caballero",
      "J. A.",
      ""
    ],
    [
      "Quirrenbach",
      "A.",
      ""
    ],
    [
      "Ribas",
      "I.",
      ""
    ],
    [
      "Aceituno",
      "J.",
      ""
    ],
    [
      "Hatzes",
      "A. P.",
      ""
    ],
    [
      "Henning",
      "Th.",
      ""
    ],
    [
      "Kaminski",
      "A.",
      ""
    ],
    [
      "Montes",
      "D.",
      ""
    ],
    [
      "Morales",
      "J. C.",
      ""
    ],
    [
      "Schöfer",
      "P.",
      ""
    ],
    [
      "Schweitzer",
      "A.",
      ""
    ],
    [
      "Varas",
      "R.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 17:30:48 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733851848000,
  "abstract": "  Radial velocity (RV) jitter represents an intrinsic limitation on the\nprecision of Doppler searches for exoplanets that can originate from both\ninstrumental and astrophysical sources. We aim to determine the RV jitter floor\nin M dwarfs and investigate the stellar properties that lead to RV jitter\ninduced by stellar activity. We determined the RV jitter in 239 M dwarfs from\nthe CARMENES survey that are predominantly of mid to late spectral type and\nsolar metallicity. We also investigated the correlation between stellar\nrotation and magnetic fields with RV jitter. The median jitter in the CARMENES\nsample is 3.1 m/s, and it is 2.3 m/s for stars with an upper limit of 2 km/s on\ntheir projected rotation velocities. We provide a relation between the stellar\nequatorial rotation velocity and RV jitter in M dwarfs based on a subsample of\n129 well-characterized CARMENES stars. RV jitter induced by stellar rotation\ndominates for stars with equatorial rotation velocities greater than 1 km/s. A\njitter floor of 2 m/s dominates in stars with equatorial rotation velocities\nbelow 1 km/s. This jitter floor likely contains contributions from stellar\njitter, instrumental jitter, and undetected companions. We study the impact of\nthe average magnetic field and the distributions of magnetic filling factors on\nthe RV jitter. We find a series of stars with excess RV jitter and distinctive\ndistributions of magnetic filling factors. These stars are characterized by a\ndominant magnetic field component between 2-4 kG. An RV jitter floor can be\ndistinguished from RV jitter induced by activity and rotation based on the\nstellar equatorial rotation velocity. RV jitter induced by activity and\nrotation primarily depends on the equatorial rotation velocity. This RV jitter\nis also related to the distribution of magnetic filling factors, and this\nemphasizes the role of the magnetic field in the generation of RV jitter.\n",
  "subjects": [
    "Astrophysics/Earth and Planetary Astrophysics",
    "Astrophysics/Solar and Stellar Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "sM2lQdie00S7vXaMZOVJFrXtnRIKvxwzxoLJFoD4jHY",
  "pdfSize": "1371400"
}