{
  "id": "2412.15848",
  "title": "Stalling in Space: Attractor Analysis for any Algorithm",
  "authors": "Sarah L. Thomson, Quentin Renau, Diederick Vermetten, Emma Hart, Niki\n  van Stein, Anna V. Kononova",
  "authorsParsed": [
    [
      "Thomson",
      "Sarah L.",
      ""
    ],
    [
      "Renau",
      "Quentin",
      ""
    ],
    [
      "Vermetten",
      "Diederick",
      ""
    ],
    [
      "Hart",
      "Emma",
      ""
    ],
    [
      "van Stein",
      "Niki",
      ""
    ],
    [
      "Kononova",
      "Anna V.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 12:44:58 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734698698000,
  "abstract": "  Network-based representations of fitness landscapes have grown in popularity\nin the past decade; this is probably because of growing interest in\nexplainability for optimisation algorithms. Local optima networks (LONs) have\nbeen especially dominant in the literature and capture an approximation of\nlocal optima and their connectivity in the landscape. However, thus far, LONs\nhave been constructed according to a strict definition of what a local optimum\nis: the result of local search. Many evolutionary approaches do not include\nthis, however. Popular algorithms such as CMA-ES have therefore never been\nsubject to LON analysis. Search trajectory networks (STNs) offer a possible\nalternative: nodes can be any search space location. However, STNs are not\ntypically modelled in such a way that models temporal stalls: that is, a region\nin the search space where an algorithm fails to find a better solution over a\ndefined period of time. In this work, we approach this by systematically\nanalysing a special case of STN which we name attractor networks. These offer a\ncoarse-grained view of algorithm behaviour with a singular focus on stall\nlocations. We construct attractor networks for CMA-ES, differential evolution,\nand random search for 24 noiseless black-box optimisation benchmark problems.\nThe properties of attractor networks are systematically explored. They are also\nvisualised and compared to traditional LONs and STN models. We find that\nattractor networks facilitate insights into algorithm behaviour which other\nmodels cannot, and we advocate for the consideration of attractor analysis even\nfor algorithms which do not include local search.\n",
  "subjects": [
    "Computer Science/Neural and Evolutionary Computing"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "kxvkuX2f4T4nDzlFlK5ApwlhJG2aXrRMYParUZA3yCM",
  "pdfSize": "1102427"
}