{
  "id": "2412.19459",
  "title": "A Prototype Unit for Image De-raining using Time-Lapse Data",
  "authors": "Jaehoon Cho, Minjung Yoo, Jini Yang and Sunok Kim",
  "authorsParsed": [
    [
      "Cho",
      "Jaehoon",
      ""
    ],
    [
      "Yoo",
      "Minjung",
      ""
    ],
    [
      "Yang",
      "Jini",
      ""
    ],
    [
      "Kim",
      "Sunok",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 27 Dec 2024 05:04:56 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735275896000,
  "abstract": "  We address the challenge of single-image de-raining, a task that involves\nrecovering rain-free background information from a single rain image. While\nrecent advancements have utilized real-world time-lapse data for training,\nenabling the estimation of consistent backgrounds and realistic rain streaks,\nthese methods often suffer from computational and memory consumption, limiting\ntheir applicability in real-world scenarios. In this paper, we introduce a\nnovel solution: the Rain Streak Prototype Unit (RsPU). The RsPU efficiently\nencodes rain streak-relevant features as real-time prototypes derived from\ntime-lapse data, eliminating the need for excessive memory resources. Our\nde-raining network combines encoder-decoder networks with the RsPU, allowing us\nto learn and encapsulate diverse rain streak-relevant features as concise\nprototypes, employing an attention-based approach. To ensure the effectiveness\nof our approach, we propose a feature prototype loss encompassing cohesion and\ndivergence components. This loss function captures both the compactness and\ndiversity aspects of the prototypical rain streak features within the RsPU. Our\nmethod evaluates various de-raining benchmarks, accompanied by comprehensive\nablation studies. We show that it can achieve competitive results in various\nrain images compared to state-of-the-art methods.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Electrical Engineering and Systems Science/Image and Video Processing"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "4aksCKPP0DtwhJlviRPCvc1_NnDJRklPoUG_CIpU6G8",
  "pdfSize": "18277612"
}