{
  "id": "2412.06913",
  "title": "Revisiting the relationship of black-hole kicks and multipole\n  asymmetries",
  "authors": "Jannik Mielke, Shrobana Ghosh, Angela Borchers, Frank Ohme",
  "authorsParsed": [
    [
      "Mielke",
      "Jannik",
      ""
    ],
    [
      "Ghosh",
      "Shrobana",
      ""
    ],
    [
      "Borchers",
      "Angela",
      ""
    ],
    [
      "Ohme",
      "Frank",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 19:03:08 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733770988000,
  "abstract": "  Precession in black-hole binaries is caused by a misalignment between the\ntotal spin and the orbital angular momentum. The gravitational-wave emission of\nsuch systems is anisotropic, which leads to an asymmetry in the $\\pm m$\nmultipoles when decomposed into a spherical harmonic basis. This asymmetric\nemission can impart a kick to the merger remnant black hole as a consequence of\nlinear momentum conservation. Despite the astrophysical importance of kicks,\nmultipole asymmetries contribute very little to the overall signal strength\nand, therefore, the majority of current gravitational-wave models do not\ninclude them. Recent efforts have been made to include asymmetries in waveform\nmodels. However, those efforts focus on capturing finer features of precessing\nwaveforms without making explicit considerations of remnant kick velocities.\nHere we close that gap and present a comprehensive analysis of the linear\nmomentum flux expressed in terms of multipole asymmetries. As expected, large\nasymmetries are needed to achieve the largest kick velocities. Interestingly,\nthe same large asymmetries may lead to negligible kick velocities if the\nantisymmetric and symmetric waveform parts are perpendicular to each other\naround merger. We also present a phenomenological tool for testing the\nperformance of waveform models with multipole asymmetries. This tool helped us\nto fix an inconsistency in the phase definition of the IMRPhenomXO4a waveform\nmodel.\n",
  "subjects": [
    "Physics/General Relativity and Quantum Cosmology"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "SRBoBY_PnHfahcenNKjuY7xEDiqJmya55ZBb308L9_A",
  "pdfSize": "5225221"
}