{
  "id": "2412.18710",
  "title": "Simi-SFX: A similarity-based conditioning method for controllable sound\n  effect synthesis",
  "authors": "Yunyi Liu, Craig Jin",
  "authorsParsed": [
    [
      "Liu",
      "Yunyi",
      ""
    ],
    [
      "Jin",
      "Craig",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 25 Dec 2024 00:14:50 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735085690000,
  "abstract": "  Generating sound effects with controllable variations is a challenging task,\ntraditionally addressed using sophisticated physical models that require\nin-depth knowledge of signal processing parameters and algorithms. In the era\nof generative and large language models, text has emerged as a common,\nhuman-interpretable interface for controlling sound synthesis. However, the\ndiscrete and qualitative nature of language tokens makes it difficult to\ncapture subtle timbral variations across different sounds. In this research, we\npropose a novel similarity-based conditioning method for sound synthesis,\nleveraging differentiable digital signal processing (DDSP). This approach\ncombines the use of latent space for learning and controlling audio timbre with\nan intuitive guiding vector, normalized within the range [0,1], to encode\ncategorical acoustic information. By utilizing pre-trained audio representation\nmodels, our method achieves expressive and fine-grained timbre control. To\nbenchmark our approach, we introduce two sound effect datasets--Footstep-set\nand Impact-set--designed to evaluate both controllability and sound quality.\nRegression analysis demonstrates that the proposed similarity score effectively\ncontrols timbre variations and enables creative applications such as timbre\ninterpolation between discrete classes. Our work provides a robust and\nversatile framework for sound effect synthesis, bridging the gap between\ntraditional signal processing and modern machine learning techniques.\n",
  "subjects": [
    "Computer Science/Sound",
    "Electrical Engineering and Systems Science/Audio and Speech Processing"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "uCySrdtbLxvKVsNfrpXpycVHyWq9B7Tl0Vft6dLtHG8",
  "pdfSize": "4386806"
}