{
  "id": "2412.01408",
  "title": "Towards Cross-Lingual Audio Abuse Detection in Low-Resource Settings\n  with Few-Shot Learning",
  "authors": "Aditya Narayan Sankaran, Reza Farahbakhsh, Noel Crespi",
  "authorsParsed": [
    [
      "Sankaran",
      "Aditya Narayan",
      ""
    ],
    [
      "Farahbakhsh",
      "Reza",
      ""
    ],
    [
      "Crespi",
      "Noel",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 11:51:19 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 3 Dec 2024 07:52:35 GMT"
    },
    {
      "version": "v3",
      "created": "Fri, 13 Dec 2024 11:59:06 GMT"
    }
  ],
  "updateDate": "2024-12-16",
  "timestamp": 1733140279000,
  "abstract": "  Online abusive content detection, particularly in low-resource settings and\nwithin the audio modality, remains underexplored. We investigate the potential\nof pre-trained audio representations for detecting abusive language in\nlow-resource languages, in this case, in Indian languages using Few Shot\nLearning (FSL). Leveraging powerful representations from models such as Wav2Vec\nand Whisper, we explore cross-lingual abuse detection using the ADIMA dataset\nwith FSL. Our approach integrates these representations within the\nModel-Agnostic Meta-Learning (MAML) framework to classify abusive language in\n10 languages. We experiment with various shot sizes (50-200) evaluating the\nimpact of limited data on performance. Additionally, a feature visualization\nstudy was conducted to better understand model behaviour. This study highlights\nthe generalization ability of pre-trained models in low-resource scenarios and\noffers valuable insights into detecting abusive language in multilingual\ncontexts.\n",
  "subjects": [
    "Computer Science/Computation and Language",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "P4hyPp8IJ6ZHToVGexXAzfB0LxYHAFgaRy59TGRjJkA",
  "pdfSize": "808983"
}