{"id":"2412.08535","title":"Spatial segregation across travelling fronts in individual-based and\n  continuum models for the growth of heterogeneous cell populations","authors":"Jos\\'e A. Carrillo, Tommaso Lorenzi and Fiona R. Macfarlane","authorsParsed":[["Carrillo","José A.",""],["Lorenzi","Tommaso",""],["Macfarlane","Fiona R.",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 16:48:29 GMT"},{"version":"v2","created":"Thu, 12 Dec 2024 09:25:44 GMT"}],"updateDate":"2024-12-13","timestamp":1733935709000,"abstract":"  We consider a partial differential equation model for the growth of\nheterogeneous cell populations subdivided into multiple distinct discrete\nphenotypes. In this model, cells preferentially move towards regions where they\nfeel less compressed, and thus their movement occurs down the gradient of the\ncellular pressure, which is defined as a weighted sum of the densities (i.e.\nthe volume fractions) of cells with different phenotypes. To translate into\nmathematical terms the idea that cells with distinct phenotypes have different\nmorphological and mechanical properties, both the cell mobility and the\nweighted amount the cells contribute to the cellular pressure vary with their\nphenotype. We formally derive this model as the continuum limit of an\non-lattice individual-based model, where cells are represented as single agents\nundergoing a branching biased random walk corresponding to phenotype-dependent\nand pressure-regulated cell division, death, and movement. Then, we study\ntravelling wave solutions whereby cells with different phenotypes are spatially\nsegregated across the invading front. Finally, we report on numerical\nsimulations of the two models, demonstrating excellent agreement between them\nand the travelling wave analysis. The results presented here indicate that\ninter-cellular variability in mobility can provide the substrate for the\nemergence of spatial segregation across invading cell fronts.\n","subjects":["Mathematics/Analysis of PDEs"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"UejZW4XHL4UKH4sEsFbffFZ-HSFGeCVNcqdF6HPpin4","pdfSize":"2164893"}