{"id":"2412.14034","title":"Using Partial Structure R1 to Do Molecular Replacement Calculations","authors":"Xiaodong Zhang","authorsParsed":[["Zhang","Xiaodong",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 16:52:41 GMT"}],"updateDate":"2024-12-19","timestamp":1734540761000,"abstract":"  The concept of partial structure R1 (pR1) is a generalization of the concept\nof single atom R1 (sR1) (Zhang & Donahue, 2024). The hypothesis is that the\ndeepest hole of a pR1 map determines the orientation and location of a missing\nfragment. In current implementation, the calculation is divided into two steps.\nThe first step is to detect possible orientations of all missing fragments by\nthe holes of a pR1 map of a free-standing fragment in a 3-dimensional\norientation space. The second step is to determine the orientation and location\nof a missing fragment. To this end, if done strictly, all the candidate\norientations are tried. With each candidate orientation, the best choice of\nlocation of the missing fragment is determined by the deepest hole of a pR1 map\nin a 3-dimensional location space. This best choice is combined with the trial\norientation to form one candidate orientation-location. After trying all\ncandidate orientations, a list of candidate orientation-locations are formed,\nfrom which, the one with the lowest R1 determines the orientation and location\nof a missing fragment. Then a newer pR1 is defined by including the atoms of\nthis newly determined fragment into the known atoms. This newer pR1 is used to\ndetermine the next missing fragment in the same way. To shorten the calculation\ntime, the possible locations of all missing fragments can be predicted by the\nholes of a pR1 map of a completely disoriented model of a fragment. All these\nideas of using pR1 to do molecular replacement calculations have been\ndemonstrated by four example data sets.\n","subjects":["Physics/Data Analysis, Statistics and Probability"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"NQYuIcP37BB_Ij1o95QoxmhE56C7rD1VybGRqtILwx8","pdfSize":"1400925"}