{"id":"2412.12378","title":"Diversity in Software Engineering Education: Exploring Motivations,\n  Influences, and Role Models Among Undergraduate Students","authors":"Ronnie de Souza Santos, Italo Santos, Robson Santos, Cleyton Magalhaes","authorsParsed":[["Santos","Ronnie de Souza",""],["Santos","Italo",""],["Santos","Robson",""],["Magalhaes","Cleyton",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 22:14:10 GMT"}],"updateDate":"2024-12-18","timestamp":1734387250000,"abstract":"  Software engineering (SE) faces significant diversity challenges in both\nacademia and industry, with underrepresented students encountering hostile\nenvironments, limited representation, and systemic biases that hinder their\nacademic and professional success. Despite significant research on the\nexclusion experienced by students from underrepresented groups in SE education,\nthere is limited understanding of the specific motivations, influences, and\nrole models that drive underrepresented students to pursue and persist in the\nfield. This study explores the motivations and influences shaping the career\naspirations of students from underrepresented groups in SE, and it investigates\nhow role models and mentorship impact their decisions to stay in the field. We\nconducted a cross-sectional survey with undergraduate SE students and related\nfields, focusing on their motivations, influences, and the impact of mentorship\nand role models on their career paths. We identified eight motivations for\npursuing SE, with career advancement, technological enthusiasm, and personal\ngrowth being the most common. Family members, tech influencers, teachers, and\nfriends were key influences, though 64\\% of students reported no specific\nindividual influence. Role models, particularly tech influencers and family\nmembers play a critical role in sustaining interest in the field, especially\nfor underrepresented groups. This study provides insights into the varied\nmotivations and influences that guide underrepresented students' decisions to\npursue SE. It emphasizes the importance of role models and highlights the need\nfor intersectional approaches to better support diversity in the field.\n","subjects":["Computer Science/Software Engineering","Computer Science/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"JzFwu9Wh4VpqK4gYvOkH-IMWKhRQlx-S1XQd45vS_ZI","pdfSize":"186570"}