{
  "id": "2412.11809",
  "title": "Parallel CPU- and GPU-based connected component algorithms for event\n  building for hybrid pixel detectors",
  "authors": "Tom\\'a\\v{s} \\v{C}elko, Franti\\v{s}ek Mr\\'az, Benedikt Bergmann and\n  Petr M\\'anek",
  "authorsParsed": [
    [
      "Čelko",
      "Tomáš",
      ""
    ],
    [
      "Mráz",
      "František",
      ""
    ],
    [
      "Bergmann",
      "Benedikt",
      ""
    ],
    [
      "Mánek",
      "Petr",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 14:20:39 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734358839000,
  "abstract": "  The latest generation of Timepix series hybrid pixel detectors enhance\nparticle tracking with high spatial and temporal resolution. However, their\nhigh hit-rate capability poses challenges for data processing, particularly in\nmultidetector configurations or systems like Timepix4. Storing and processing\neach hit offline is inefficient for such high data throughput. To efficiently\ngroup partly unsorted pixel hits into clusters for particle event\ncharacterization, we explore parallel approaches for online clustering to\nenable real-time data reduction. Although using multiple CPU cores improved\nthroughput, scaling linearly with the number of cores, load-balancing issues\nbetween processing and I/O led to occasional data loss. We propose a parallel\nconnected component labeling algorithm using a union-find structure with path\ncompression optimized for zero-suppression data encoding. Our GPU\nimplementation achieved a throughput of up to 300 million hits per second,\nproviding a two-order-of-magnitude speedup over compared CPU-based methods\nwhile also freeing CPU resources for I/O handling and reducing the data loss.\n",
  "subjects": [
    "Computer Science/Distributed, Parallel, and Cluster Computing",
    "Physics/Instrumentation and Detectors"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "cUPTwVjGr5fxzJB3NBf1dwc-V6n757iDSGj5d1j_6wU",
  "pdfSize": "1257555"
}