{"id":"2412.07252","title":"Adaptive Weighting Push-SUM for Decentralized Optimization with\n  Statistical Diversity","authors":"Yiming Zhou and Yifei Cheng and Linli Xu and Enhong Chen","authorsParsed":[["Zhou","Yiming",""],["Cheng","Yifei",""],["Xu","Linli",""],["Chen","Enhong",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 07:23:31 GMT"}],"updateDate":"2024-12-11","timestamp":1733815411000,"abstract":"  Statistical diversity is a property of data distribution and can hinder the\noptimization of a decentralized network. However, the theoretical limitations\nof the Push-SUM protocol reduce the performance in handling the statistical\ndiversity of optimization algorithms based on it. In this paper, we\ntheoretically and empirically mitigate the negative impact of statistical\ndiversity on decentralized optimization using the Push-SUM protocol.\nSpecifically, we propose the Adaptive Weighting Push-SUM protocol, a\ntheoretical generalization of the original Push-SUM protocol where the latter\nis a special case of the former. Our theoretical analysis shows that, with\nsufficient communication, the upper bound on the consensus distance for the new\nprotocol reduces to $O(1/N)$, whereas it remains at $O(1)$ for the Push-SUM\nprotocol. We adopt SGD and Momentum SGD on the new protocol and prove that the\nconvergence rate of these two algorithms to statistical diversity is $O(N/T)$\non the new protocol, while it is $O(Nd/T)$ on the Push-SUM protocol, where $d$\nis the parameter size of the training model. To address statistical diversity\nin practical applications of the new protocol, we develop the Moreau weighting\nmethod for its generalized weight matrix definition. This method, derived from\nthe Moreau envelope, is an approximate optimization of the distance penalty of\nthe Moreau envelope. We verify that the Adaptive Weighting Push-SUM protocol is\npractically more efficient than the Push-SUM protocol via deep learning\nexperiments.\n","subjects":["Computer Science/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"sng2ayuhEaAQMsXqFpXWT9EKrInM8gMexvk3eXbxig0","pdfSize":"879949"}