{
  "id": "2412.04876",
  "title": "Dynamic Interference Prediction for In-X 6G Sub-networks",
  "authors": "Pramesh Gautam, Ravi Sharan B A G, Paolo Baracca, Carsten Bockelmann,\n  Thorsten Wild, Armin Dekorsy",
  "authorsParsed": [
    [
      "Gautam",
      "Pramesh",
      ""
    ],
    [
      "G",
      "Ravi Sharan B A",
      ""
    ],
    [
      "Baracca",
      "Paolo",
      ""
    ],
    [
      "Bockelmann",
      "Carsten",
      ""
    ],
    [
      "Wild",
      "Thorsten",
      ""
    ],
    [
      "Dekorsy",
      "Armin",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 09:18:43 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733476723000,
  "abstract": "  The sixth generation (6G) industrial Sub-networks (SNs) face several\nchallenges in meeting extreme latency and reliability requirements in the order\nof 0.1-1 ms and 99.999 -to-99.99999 percentile, respectively. Interference\nmanagement (IM) plays an integral role in addressing these requirements,\nespecially in ultra-dense SN environments with rapidly varying interference\ninduced by channel characteristics, mobility, and resource limitations. In\ngeneral, IM can be achieved using resource allocation and \\textit{accurate}\nLink adaptation (LA). In this work, we focus on the latter, where we first\nmodel interference at SN devices using the spatially consistent 3GPP channel\nmodel. Following this, we present a discrete-time dynamic state space model\n(DSSM) at a SN access point (AP), where interference power values (IPVs) are\nmodeled as latent variables incorporating underlying modeling errors as well as\ntransmission/protocol delays. Necessary approximations are then presented to\nsimplify the DSSM and to efficiently employ the extended Kalman filter (EKF)\nfor interference prediction. Unlike baseline methods, our proposed approach\npredicts IPVs solely based on the channel quality indicator (CQI) reports\navailable at the SN AP at every transmission time interval (TTI). Numerical\nresults demonstrate that our proposed approach clearly outperforms the\nconventional baseline. Furthermore, we also show that despite predicting with\nlimited information, our proposed approach consistently achieves a comparable\nperformance w.r.t the off-the-shelf supervised learning based baseline.\n",
  "subjects": [
    "Computer Science/Information Theory",
    "Mathematics/Information Theory"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "KRfslgxYWi8-El3FtColV-rS5FpVoOfSsE1_R5aCMMQ",
  "pdfSize": "709655"
}