{"id":"2412.10692","title":"Continuous-time optimal investment with portfolio constraints: a\n  reinforcement learning approach","authors":"Huy Chau, Duy Nguyen and Thai Nguyen","authorsParsed":[["Chau","Huy",""],["Nguyen","Duy",""],["Nguyen","Thai",""]],"versions":[{"version":"v1","created":"Sat, 14 Dec 2024 05:35:44 GMT"}],"updateDate":"2024-12-17","timestamp":1734154544000,"abstract":"  In a reinforcement learning (RL) framework, we study the exploratory version\nof the continuous time expected utility (EU) maximization problem with a\nportfolio constraint that includes widely-used financial regulations such as\nshort-selling constraints and borrowing prohibition. The optimal feedback\npolicy of the exploratory unconstrained classical EU problem is shown to be\nGaussian. In the case where the portfolio weight is constrained to a given\ninterval, the corresponding constrained optimal exploratory policy follows a\ntruncated Gaussian distribution. We verify that the closed form optimal\nsolution obtained for logarithmic utility and quadratic utility for both\nunconstrained and constrained situations converge to the non-exploratory\nexpected utility counterpart when the exploration weight goes to zero. Finally,\nwe establish a policy improvement theorem and devise an implementable\nreinforcement learning algorithm by casting the optimal problem in a martingale\nframework. Our numerical examples show that exploration leads to an optimal\nwealth process that is more dispersedly distributed with heavier tail compared\nto that of the case without exploration. This effect becomes less significant\nas the exploration parameter is smaller. Moreover, the numerical implementation\nalso confirms the intuitive understanding that a broader domain of investment\nopportunities necessitates a higher exploration cost. Notably, when subjected\nto both short-selling and money borrowing constraints, the exploration cost\nbecomes negligible compared to the unconstrained case.\n","subjects":["Quantitative Finance/Mathematical Finance"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"R2KwzQTf0oJworq3e_wonyC5S_GpjzNlVD1gr55Od-o","pdfSize":"1668342"}