{
  "id": "2412.13062",
  "title": "The PeV Frontier: Status of Gamma-ray astronomy after two decades with\n  H.E.S.S., MAGIC, VERITAS and the new window recently opened by HAWC and\n  LHAASO",
  "authors": "J. Devin",
  "authorsParsed": [
    [
      "Devin",
      "J.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 16:27:27 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734452847000,
  "abstract": "  One of the main purposes in $\\gamma$-ray astronomy is linked to the origin of\nGalactic cosmic rays. Unlike cosmic rays, $\\gamma$ rays can be used to probe\ntheir production sites in the Galaxy and to find which type of astrophysical\nsources is able to accelerated particles up to PeV energies. Twenty years of\nobservations with current Imaging Atmospheric Cherenkov Telescopes (H.E.S.S.,\nMAGIC and VERITAS) provided an unprecedented view of the very-high-energy\n$\\gamma$-ray sky and a large variety of Galactic sources which are prominent\nTeV emitters, such as supernova remnants, pulsar wind nebulae, massive stellar\nclusters and binary systems, in addition to a large fraction of unidentified\nTeV sources. For a long time, supernova remnants were the most promising\ncandidates for the main source of Galactic cosmic rays, but the new window of\nultra-high-energy $\\gamma$ rays recently opened by HAWC and LHAASO gave\nunexpected results and demonstrated the need to re-evaluate some scenarios and\nto revise some of our definitions. The highest-energy $\\gamma$-ray sources are\nnot associated with standard candidates for the main source of Galactic cosmic\nrays and challenged our usual paradigms, highlighting the vastness of what\nneeds to be explored and understood in the next decades.\n",
  "subjects": [
    "Astrophysics/High Energy Astrophysical Phenomena"
  ],
  "license": "http://creativecommons.org/publicdomain/zero/1.0/",
  "blobId": "FDMu9EMEIZb5nKt6d5FZZWrzi24wcA8054QLdKYyy1I",
  "pdfSize": "4024177"
}