{"id":"2412.18482","title":"Elastic Constants and Bending Rigidities from Long-Wavelength\n  Perturbation Expansions","authors":"Changpeng Lin, Samuel Ponc\\'e, Francesco Macheda, Francesco Mauri,\n  Nicola Marzari","authorsParsed":[["Lin","Changpeng",""],["Poncé","Samuel",""],["Macheda","Francesco",""],["Mauri","Francesco",""],["Marzari","Nicola",""]],"versions":[{"version":"v1","created":"Tue, 24 Dec 2024 15:13:04 GMT"}],"updateDate":"2024-12-25","timestamp":1735053184000,"abstract":"  Mechanical and elastic properties of materials are among the most fundamental\nquantities for many engineering and industrial applications. Here, we present a\nformulation that is efficient and accurate for calculating the elastic and\nbending rigidity tensors of crystalline solids, leveraging interatomic force\nconstants and long-wavelength perturbation theory. Crucially, in the\nlong-wavelength limit, lattice vibrations induce macroscopic electric fields\nwhich further couple with the propagation of elastic waves, and a separate\ntreatment on the long-range electrostatic interactions is thereby required to\nobtain elastic properties under the appropriate electrical boundary conditions.\nA cluster expansion of the charge density response and dielectric screening\nfunction in the long-wavelength limit has been developed to efficiently extract\nmultipole and dielectric tensors of arbitrarily high order. We implement the\nproposed method in a first-principles framework and perform extensive\nvalidations on silicon, NaCl, GaAs and rhombohedral BaTiO$_3$ as well as\nmonolayer graphene, hexagonal BN, MoS$_2$ and InSe, obtaining good to excellent\nagreement with other theoretical approaches and experimental measurements.\nNotably, we establish that multipolar interactions up to at least octupoles are\nnecessary to obtain the accurate short-circuit elastic tensor of bulk\nmaterials, while higher orders beyond octupole interactions are required to\nconverge the bending rigidity tensor of 2D crystals. The present approach\ngreatly simplifies the calculations of bending rigidities and will enable the\nautomated characterization of the mechanical properties of novel functional\nmaterials.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics","Physics/Applied Physics","Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"1wqgvNtrqYV01cAeHUpdFDGC8fnb6Wafd19QBsfO-Qc","pdfSize":"2544040"}