{"id":"2412.18680","title":"Exceptional X-ray activity in BL Lacertae","authors":"Alicja Wierzcholska, Stefan Wagner","authorsParsed":[["Wierzcholska","Alicja",""],["Wagner","Stefan",""]],"versions":[{"version":"v1","created":"Tue, 24 Dec 2024 21:05:33 GMT"}],"updateDate":"2024-12-30","timestamp":1735074333000,"abstract":"  BL Lacertae is a unique blazar for which the X-ray band can cover either the\nsynchrotron or the inverse Compton, or both parts of the broadband spectral\nenergy distribution. In the latter case, when the spectral upturn is located in\nthe X-ray range, it allows contemporaneous study of the low- and high-energy\nends of the electron distribution function. In this work, we study spectral and\ntemporal variability using X-ray and optical observations of the blazar\nperformed with the Neil Gehrels Swift Observatory from 2020 to 2023. The large\nset of observational data reveals intensive flaring activity, accompanied by\nspectral changes in both spectral branches.\n  We conclude that the low-energy and high-energy ends of the particle\ndistribution function are characterised by similar variability scales.\nAdditionally, the hard X-ray observations of BL Lacertae performed with the\nNuclear Spectroscopic Telescope Array (NuSTAR) confirm a concave spectral\ncurvature for some epochs of the blazar activity and reveal that it can be\nshifted up to energies of as high as 8 keV. The time-resolved spectral analysis\nallows us to disentangle X-ray spectral variability features of the synchrotron\nfrom inverse Compton components.\n  Despite significant variability of both spectral components, we find only\nsmall changes in the position of the spectral upturn. The different slopes and\nshapes of the X-ray spectrum of BL Lacertae demonstrate that the classification\nof this source is not constant, and BL Lacertae can exhibit features of either\nhigh-, intermediate-, or low-energy peaked blazar in different epochs of\nobservation. This also indicates that the spectral upturn for this blazar can\nbe located not only in the X-ray range of 0.3-10 keV, but also at lower or\nhigher energies.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"v52ubi0KMwGnxs05gbkWeYIjc6diWhBil5rKyV_oo5M","pdfSize":"763563"}