{"id":"2412.04873","title":"Bullet pressure-cell design for neutron scattering experiments with\n  horizontal magnetic fields and dilution temperatures","authors":"Ellen Fogh, Ga\\'etan Giriat, Richard Gaal, Luc Testa, Jana\n  P\\'asztorov\\'a, Henrik M. R{\\o}nnow, Oleksandr Prokhnenko, Maciej Bartkowiak,\n  Ekaterina Pomjakushina, Yoshiya Uwatoko, Hiroyuki Nojiri, Koji Munakata and\n  Kazuhisa Kakurai","authorsParsed":[["Fogh","Ellen",""],["Giriat","Gaétan",""],["Gaal","Richard",""],["Testa","Luc",""],["Pásztorová","Jana",""],["Rønnow","Henrik M.",""],["Prokhnenko","Oleksandr",""],["Bartkowiak","Maciej",""],["Pomjakushina","Ekaterina",""],["Uwatoko","Yoshiya",""],["Nojiri","Hiroyuki",""],["Munakata","Koji",""],["Kakurai","Kazuhisa",""]],"versions":[{"version":"v1","created":"Fri, 6 Dec 2024 09:08:39 GMT"}],"updateDate":"2024-12-09","timestamp":1733476119000,"abstract":"  The simultaneous application of high magnetic fields and high pressures for\ncontrolling magnetic ground states is important for testing our understanding\nof many-body quantum theory. However, the implementation for neutron scattering\nexperiments presents a technical challenge. To overcome this challenge we\npresent an optimized pressure-cell design with a novel bullet shape, which is\ncompatible with horizontal-field magnets, in particular the high-field magnet\noperating at the Helmholtz-Zentrum Berlin. The cell enabled neutron diffraction\nand spectroscopy measurements with the combination of three extreme conditions:\nhigh pressures, high magnetic fields, and dilution temperatures, simultaneously\nreaching 0.7 GPa, 25.9 T, and 200 mK. Our results demonstrate the utility of\ninformed material choices and the efficiency of finite-element analysis for\nfuture pressure-cell designs to be used in combination with magnetic fields and\ndilution temperatures for neutron scattering purposes.\n","subjects":["Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"wpxlGxwRVOFptY9xelRpZtfg9wccokLOSvPsdH3tVxs","pdfSize":"2221148"}