{
  "id": "2412.07321",
  "title": "A class of refined implicit-explicit Runge-Kutta methods with robust\n  time adaptability and unconditional convergence for the Cahn-Hilliard model",
  "authors": "Hong-lin Liao, Tao Tang, Xuping Wang, Tao Zhou",
  "authorsParsed": [
    [
      "Liao",
      "Hong-lin",
      ""
    ],
    [
      "Tang",
      "Tao",
      ""
    ],
    [
      "Wang",
      "Xuping",
      ""
    ],
    [
      "Zhou",
      "Tao",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 09:10:08 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733821808000,
  "abstract": "  One of main obstacles in verifying the energy dissipation laws of\nimplicit-explicit Runge-Kutta (IERK) methods for phase field equations is to\nestablish the uniform boundedness of stage solutions without the global\nLipschitz continuity assumption of nonlinear bulk. With the help of discrete\northogonal convolution kernels, an updated time-space splitting technique is\ndeveloped to establish the uniform boundedness of stage solutions for a refined\nclass of IERK methods in which the associated differentiation matrices and the\naverage dissipation rates are always independent of the time-space\ndiscretization meshes. This makes the refined IERK methods highly advantageous\nin self-adaptive time-stepping procedures as some larger adaptive step-sizes in\nactual simulations become possible. From the perspective of optimizing the\naverage dissipation rate, we construct some parameterized refined IERK methods\nup to third-order accuracy, in which the involved diagonally implicit\nRunge-Kutta methods for the implicit part have an explicit first stage and\nallow a stage-order of two such that they are not necessarily algebraically\nstable. Then we are able to establish, for the first time, the original energy\ndissipation law and the unconditional $L^2$ norm convergence. Extensive\nnumerical tests are presented to support our theory.\n",
  "subjects": [
    "Mathematics/Numerical Analysis",
    "Computer Science/Numerical Analysis"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "ER5_Bn22tr0w8K_mZilioRFyq8wXPWxXssPwmQNWlvo",
  "pdfSize": "2064189"
}