{
  "id": "2412.19934",
  "title": "Pattern Finding in mm-Wave Spectra of Massive Young Stellar Objects",
  "authors": "Yenifer Angarita, Germ\\'an Chaparro, Stuart L. Lumsden, Catherine\n  Walsh, Adam Avison, Naomi Asabre Frimpong, Gary A. Fuller",
  "authorsParsed": [
    [
      "Angarita",
      "Yenifer",
      ""
    ],
    [
      "Chaparro",
      "Germán",
      ""
    ],
    [
      "Lumsden",
      "Stuart L.",
      ""
    ],
    [
      "Walsh",
      "Catherine",
      ""
    ],
    [
      "Avison",
      "Adam",
      ""
    ],
    [
      "Frimpong",
      "Naomi Asabre",
      ""
    ],
    [
      "Fuller",
      "Gary A.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 27 Dec 2024 21:45:37 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735335937000,
  "abstract": "  Massive stars play a pivotal role in shaping their galactic surroundings due\nto their high luminosity and intense ionizing radiation. However, the precise\nmechanisms governing the formation of massive stars remain elusive. Complex\norganic molecules (COMs) offer an avenue for studying star formation across the\nlow- to high-mass spectrum because COMs are found in every young stellar object\nphase and offer insight into the structure and temperature. We aim to unveil\nevolutionary patterns of COM chemistry in 41 massive young stellar objects\n(MYSOs) sourced from diverse catalogues, using ALMA Band 6 spectra. Previous\nline analysis of these sources showed the presence of CH$_3$OH, CH$_3$CN, and\nCH$_3$CCH with diverse excitation temperatures and column densities, indicating\na possible evolutionary path across sources. However, this analysis usually\ninvolves manual line extraction and rotational diagram fitting. Here, we\nimprove upon this process by directly retrieving the physicochemical state of\nMYSOs from their dimensionally-reduced spectra. We use a Locally Linear\nEmbedding to find a lower-dimensional projection for the physicochemical\nparameters obtained from individual line analysis. We identify clusters of\nsimilar MYSOs in this embedded space using a Gaussian Mixture Model. We find\nthree groups of MYSOs with distinct physicochemical conditions: i) cold,\nCOM-poor sources, ii) warm, medium-COM-abundance sources, and iii) hot,\nCOM-rich sources. We then apply principal component analysis (PCA) to the\nspectral sample, finding further evidence for an evolutionary path across MYSO\ngroups. Finally, we find that the physicochemical state of our sample can be\nderived directly from the spectra by training a simple random forest model on\nthe first few PCA components. Our results highlight the effectiveness of\ndimensionality reduction in obtaining clear physical insights directly from\nMYSO spectra.\n",
  "subjects": [
    "Astrophysics/Astrophysics of Galaxies",
    "Astrophysics/Solar and Stellar Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "D-eWFSjTYiQcB5R2BgBVvegp5dovdugpVgnixiiI8jo",
  "pdfSize": "13881639"
}