{
  "id": "2412.08396",
  "title": "Discovery of Local Analogs to JWST's Little Red Dots",
  "authors": "Ruqiu Lin, Zhen-Ya Zheng, Chunyan Jiang, Fang-Ting Yuan, Luis C. Ho,\n  Junxian Wang, Linhua Jiang, James E. Rhoads, Sangeeta Malhotra, L. Felipe\n  Barrientos, Isak Wold, Leopoldo Infante, Shuairu Zhu, Xiang Ji, and Xiaodan\n  Fu",
  "authorsParsed": [
    [
      "Lin",
      "Ruqiu",
      ""
    ],
    [
      "Zheng",
      "Zhen-Ya",
      ""
    ],
    [
      "Jiang",
      "Chunyan",
      ""
    ],
    [
      "Yuan",
      "Fang-Ting",
      ""
    ],
    [
      "Ho",
      "Luis C.",
      ""
    ],
    [
      "Wang",
      "Junxian",
      ""
    ],
    [
      "Jiang",
      "Linhua",
      ""
    ],
    [
      "Rhoads",
      "James E.",
      ""
    ],
    [
      "Malhotra",
      "Sangeeta",
      ""
    ],
    [
      "Barrientos",
      "L. Felipe",
      ""
    ],
    [
      "Wold",
      "Isak",
      ""
    ],
    [
      "Infante",
      "Leopoldo",
      ""
    ],
    [
      "Zhu",
      "Shuairu",
      ""
    ],
    [
      "Ji",
      "Xiang",
      ""
    ],
    [
      "Fu",
      "Xiaodan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 14:15:03 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733926503000,
  "abstract": "  Recently, the James Webb Space Telescope (JWST) has revealed a new class of\nhigh redshift (high-$z$, $z>4$) compact galaxies which are red in the\nrest-frame optical and blue in the rest-frame UV as V-shaped spectral energy\ndistributions (SEDs), referred to as \"Little Red Dots\" (LRDs). It is very\nlikely that LRDs host obscured broad-line active galactic nuclei (AGNs). In the\nmeanwhile, Green pea galaxies (GPs), which are compact dwarf galaxies at low\nredshift, share various similar properties with high redshift star-forming\ngalaxies. Here we aim to find the connection between the LRDs and GPs hosting\nbroad-line AGNs (BLGPs). With a sample of 19 BLGPs obtained from our previous\nwork, we further identify 7 GPs with V-shaped rest-frame UV-to-optical SEDs\nthat are likely local analogs to LRDs. These V-shaped BLGPs exhibit faint UV\nabsolute magnitudes and sub-Eddington rates similar to those of LRDs. Three of\nthem occupy a similar region as LRDs in the BPT diagram, suggesting they have\nsimilar ionization conditions and gas-phase metallicities to LRDs. These\nsimilarities suggest that V-shaped BLGPs can be taken as local analogs of\nhigh-redshift LRDs. In addition, most (16/19) BLGPs, including 6 V-shaped\nBLGPs, host over-massive black holes above the local $M_{\\rm BH}$-$M_{*}$\nrelation, making it the first sample of galaxies hosting over-massive black\nholes at $z<0.4$. These findings will help us learn more about the formation\nand co-evolution of early galaxies and black holes.\n",
  "subjects": [
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "DGRIVeJACfndpzxmV0e7ZYMrRi38yWx6NbE5daFo8Hw",
  "pdfSize": "5207710"
}