{
  "id": "2412.05054",
  "title": "The effect of radiation pressure on the dispersal of photoevaporating\n  discs",
  "authors": "Alfie Robinson, James E. Owen and Richard A. Booth",
  "authorsParsed": [
    [
      "Robinson",
      "Alfie",
      ""
    ],
    [
      "Owen",
      "James E.",
      ""
    ],
    [
      "Booth",
      "Richard A.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 14:09:37 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733494177000,
  "abstract": "  Observed IR excesses indicate that protoplanetary discs evolve slowly for the\nmajority of their lifetime before losing their near- and mid-IR excesses on\nshort timescales. Photoevaporation models can explain this \"two-timescale\"\nnature of disc evolution through the removal of inner regions of discs after a\nfew million years. However, they also predict the existence of a population of\nnon-accreting discs with large cavities. Such discs are scarce within the\nobserved population, suggesting the models are incomplete. We explore whether\nradiation-pressure-driven outflows are able to remove enough dust to fit\nobservations. We simulate these outflows using cuDisc, including dust dynamics,\ngrowth/fragmentation, radiative transfer and a parameterisation of internal\nphotoevaporation. We find that, in most cases, dust mass-loss rates are around\n5-10 times too small to meet observational constraints. Particles are launched\nfrom the disc inner rim, however grains larger than around a micron do not\nescape in the outflow, meaning mass-loss rates are too low for the initial dust\nmasses at gap-opening. Only systems that have smooth photoevaporation profiles\nwith gas mass-loss rates $>\\sim 5 \\times 10^{-9}$ $M_\\odot$ yr$^{-1}$ and disc\ndust masses $<\\sim$1 $M_\\oplus$ at the time of gap opening can meet\nobservational constraints; in the current models these manifest as EUV winds\ndriven by atypically large high-energy photon fluxes. We also find that the\nheight of the disc's photosphere is controlled by small grains in the outflow\nas opposed to shadowing from a hot inner rim; the effect of this can be seen in\nsynthetic scattered light observations.\n",
  "subjects": [
    "Astrophysics/Earth and Planetary Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "_Ossuhbo93TLwxM_9gIXPhYL-FA_vXr0bAjcxH0eMa4",
  "pdfSize": "5128957"
}