{"id":"2412.00777","title":"Local vs. Global: Local Land-Use and Land-Cover Models Deliver Higher\n  Quality Maps","authors":"Girmaw Abebe Tadesse, Caleb Robinson, Charles Mwangi, Esther Maina,\n  Joshua Nyakundi, Luana Marotti, Gilles Quentin Hacheme, Hamed Alemohammad,\n  Rahul Dodhia, Juan M. Lavista Ferres","authorsParsed":[["Tadesse","Girmaw Abebe",""],["Robinson","Caleb",""],["Mwangi","Charles",""],["Maina","Esther",""],["Nyakundi","Joshua",""],["Marotti","Luana",""],["Hacheme","Gilles Quentin",""],["Alemohammad","Hamed",""],["Dodhia","Rahul",""],["Ferres","Juan M. Lavista",""]],"versions":[{"version":"v1","created":"Sun, 1 Dec 2024 11:48:58 GMT"},{"version":"v2","created":"Wed, 11 Dec 2024 15:11:09 GMT"}],"updateDate":"2024-12-12","timestamp":1733053738000,"abstract":"  In 2023, 58.0% of the African population experienced moderate to severe food\ninsecurity, with 21.6% facing severe food insecurity. Land-use and land-cover\nmaps provide crucial insights for addressing food insecurity by improving\nagricultural efforts, including mapping and monitoring crop types and\nestimating yield. The development of global land-cover maps has been\nfacilitated by the increasing availability of earth observation data and\nadvancements in geospatial machine learning. However, these global maps exhibit\nlower accuracy and inconsistencies in Africa, partly due to the lack of\nrepresentative training data. To address this issue, we propose a data-centric\nframework with a teacher-student model setup, which uses diverse data sources\nof satellite images and label examples to produce local land-cover maps. Our\nmethod trains a high-resolution teacher model on images with a resolution of\n0.331 m/pixel and a low-resolution student model on publicly available images\nwith a resolution of 10 m/pixel. The student model also utilizes the teacher\nmodel's output as its weak label examples through knowledge transfer. We\nevaluated our framework using Murang'a county in Kenya, renowned for its\nagricultural productivity, as a use case. Our local models achieved higher\nquality maps, with improvements of 0.14 in the F1 score and 0.21 in\nIntersection-over-Union, compared to the best global model. Our evaluation also\nrevealed inconsistencies in existing global maps, with a maximum agreement rate\nof 0.30 among themselves. Our work provides valuable guidance to\ndecision-makers for driving informed decisions to enhance food security.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"s1Np1z2f-ji25gtFGwFGTgdqHBzrLF70Sv7sY9Cr3vM","pdfSize":"9219852"}