{
  "id": "2412.16038",
  "title": "Intelligent Approaches to Predictive Analytics in Occupational Health\n  and Safety in India",
  "authors": "Ritwik Raj Saxena",
  "authorsParsed": [
    [
      "Saxena",
      "Ritwik Raj",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 16:39:06 GMT"
    },
    {
      "version": "v2",
      "created": "Mon, 30 Dec 2024 17:28:46 GMT"
    },
    {
      "version": "v3",
      "created": "Wed, 1 Jan 2025 00:35:53 GMT"
    }
  ],
  "updateDate": "2025-01-03",
  "timestamp": 1734712746000,
  "abstract": "  Concerns associated with occupational health and safety (OHS) remain critical\nand often under-addressed aspects of workforce management. This is especially\ntrue for high-risk industries such as manufacturing, construction, and mining.\nSuch industries dominate the economy of India which is a developing country\nwith a vast informal sector. Regulatory frameworks have been strengthened over\nthe decades, particularly with regards to bringing the unorganized sector\nwithin the purview of law. Traditional approaches to OHS have largely been\nreactive and rely on post-incident analysis (which is curative) rather than\npreventive intervention. This paper portrays the immense potential of\npredictive analytics in rejuvenating OHS practices in India. Intelligent\npredictive analytics is driven by approaches like machine learning and\nstatistical modeling. Its data-driven nature serves to overcome the limitations\nof conventional OHS methods. Predictive analytics approaches to OHS in India\ndraw on global case studies and generative applications of predictive analytics\nin OHS which are customized to Indian industrial contexts. This paper attempts\nto explore in what ways it exhibits the potential to address challenges such as\nfragmented data ecosystems, resource constraints, and the variability of\nworkplace hazards. The paper presents actionable policy recommendations to\ncreate conditions conducive to the widespread implementation of predictive\nanalytics, which must be advocated as a cornerstone of OHS strategy. In doing\nso, the paper aims to spark a collaborational dialogue among policymakers,\nindustry leaders, and technologists. It urges a shift towards intelligent\npractices to safeguard the well-being of India's workforce.\n",
  "subjects": [
    "Computer Science/Computers and Society",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "PJL_XuPDMWfDrxnoYwruYuP-GM93HXr6mYbyw8RRbfo",
  "pdfSize": "318698"
}