{
  "id": "2412.15051",
  "title": "Constraints and Sensitivities for Dipole-Portal Heavy Neutral Leptons\n  from ND280 and its Upgrade",
  "authors": "Ming-Shau Liu, Nicholas Kamp, Carlos A. Arg\\\"uelles",
  "authorsParsed": [
    [
      "Liu",
      "Ming-Shau",
      ""
    ],
    [
      "Kamp",
      "Nicholas",
      ""
    ],
    [
      "Argüelles",
      "Carlos A.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 16:58:03 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734627483000,
  "abstract": "  We report new constraints and sensitivities to heavy neutral leptons (HNLs)\nwith transition magnetic moments, also known as dipole-portal HNLs. This is\naccomplished using data from the T2K ND280 near detector in addition to the\nprojected three-year dataset of the upgraded ND280 detector. Dipole-portal HNLs\nhave been extensively studied in the literature and offer a potential\nexplanation for the $4.8\\sigma$ MiniBooNE anomaly. To perform our analysis, we\nsimulate HNL decays to $e^+e^-$ pairs in the gaseous time projection chambers\nof the ND280 detector and its upgrade. Recasting an ND280 search for mass-mixed\nHNLs, we find that ND280 data places world-leading constraints on dipole-portal\nHNLs in the 390-743\\,{\\rm MeV} mass range, disfavoring the region of parameter\nspace favored by the MiniBooNE anomaly. The addition of three years of ND280\nupgrade data will be able to disfavor the MiniBooNE solution at the $5 \\sigma$\nconfidence level and extend the world-leading constraints to dipole-portal HNLs\nin the 148-860\\,{\\rm MeV} mass range. Our analysis suggests that ND280 data\nexcludes dipole-portal HNLs as a solution to the MiniBooNE excess, motivating a\ndedicated search within the T2K collaboration and potentially highlighting the\nneed for alternative explanations for the MiniBooNE anomaly.\n",
  "subjects": [
    "Physics/High Energy Physics - Phenomenology",
    "Physics/Instrumentation and Detectors"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "zaLZ-NM3O3Wmc_ecG1sKnJhG4VprbXww1Oyge4Avt3g",
  "pdfSize": "4464297"
}