{"id":"2412.01503","title":"Phase transitions and remnants of fractionalization at finite\n  temperature in the triangular lattice quantum loop model","authors":"Xiaoxue Ran, Sylvain Capponi, Junchen Rong, Fabien Alet, and Zi Yang\n  Meng","authorsParsed":[["Ran","Xiaoxue",""],["Capponi","Sylvain",""],["Rong","Junchen",""],["Alet","Fabien",""],["Meng","Zi Yang",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 13:55:29 GMT"},{"version":"v2","created":"Mon, 24 Feb 2025 03:12:48 GMT"}],"updateDate":"2025-02-25","timestamp":1733147729000,"abstract":"  The quantum loop and dimer models are archetypal correlated systems with\nlocal constraints. With natural foundations in statistical mechanics, they are\nof direct relevance to various important physical concepts and systems, such as\ntopological order, lattice gauge theories, geometric frustrations, or more\nrecently Rydberg arrays quantum simulators. However, how the thermal\nfluctuations interact with constraints has not been explored in the important\nclass of non-bipartite geometries. Here we study, via unbiased quantum Monte\nCarlo simulations and field theoretical analysis, the finite-temperature phase\ndiagram of the quantum loop model on the triangular lattice. We discover that\nthe recently identified, \"hidden\" vison plaquette (VP) quantum\ncrystal~\\cite{ran2024hidden} experiences a finite-temperature continuous\ntransition, which smoothly connects to the (2+1)d Cubic* quantum critical point\nseparating the VP and $\\mathbb{Z}_{2}$ quantum spin liquid phases. This\nfinite-temperature phase transition acquires a unique property of {\\it thermal\nfractionalization}, in that, both the cubic order parameter -- the plaquette\nloop resonance -- and its constituent -- the vison field -- exhibit independent\ncriticality signatures. This phase transition is connected to a 3-state Potts\ntransition between the lattice nematic phase and the high-temperature\ndisordered phase. We discuss the relevance of our results for current\nexperiments on quantum simulation platforms.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Statistical Mechanics","Physics/High Energy Physics - Theory","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"d-7llfBZG2sR4SIoI9vx1b7ZT2eB-NXdoeBzoC5vlok","pdfSize":"4750544"}