{
  "id": "2412.14652",
  "title": "Stability of chiral magnon condensate in antiferromagnetic insulators",
  "authors": "Therese Frostad, Anne Louise Kristoffersen, Verena Brehm, Roberto E.\n  Troncoso, Arne Brataas, and Alireza Qaiumzadeh",
  "authorsParsed": [
    [
      "Frostad",
      "Therese",
      ""
    ],
    [
      "Kristoffersen",
      "Anne Louise",
      ""
    ],
    [
      "Brehm",
      "Verena",
      ""
    ],
    [
      "Troncoso",
      "Roberto E.",
      ""
    ],
    [
      "Brataas",
      "Arne",
      ""
    ],
    [
      "Qaiumzadeh",
      "Alireza",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 09:03:57 GMT"
    },
    {
      "version": "v2",
      "created": "Fri, 20 Dec 2024 07:56:12 GMT"
    },
    {
      "version": "v3",
      "created": "Mon, 23 Dec 2024 18:07:09 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734599037000,
  "abstract": "  Quasiequilibrium magnon Bose-Einstein condensates in ferromagnetic insulators\nhave been a field of much interest, while condensation in antiferromagnetic\nsystems has not yet been explored in detail. We analyze the stability of\ncondensed chiral magnons in two antiferromagnetic insulators: a uniaxial\neasy-axis system and a biaxial system. We show that two-component magnon\ncondensation and inter-magnon interactions are essential to create metastable\nmagnon condensation. The uniaxial system with a Rashba-type\nDzyaloshinskii-Moriya interaction supports two degenerate condensate\npopulations at finite wave vectors. We find that the condensation state in this\nmodel is stable only when the distribution of condensed magnons between the two\npopulations is symmetric. In addition, we demonstrate the emergence of a\nzero-sound-like Goldstone mode in antiferromagnetic systems that support\ntwo-condensate magnon states. On the other hand, in the biaxial system without\nDzyaloshinskii-Moriya interaction, we predict that the magnon condensate cannot\nstabilize due to the breaking of the magnon degeneracy. Our results suggest\nthat this instability is a general characteristic of single-component\nquasiequilibrium quasiparticle condensates.\n",
  "subjects": [
    "Condensed Matter/Mesoscale and Nanoscale Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "V7kLyBh8otWb8nDqdl2uQ_yoHNQbFQb7k7ofYcsvcVM",
  "pdfSize": "496594"
}