{"id":"2412.05744","title":"PICS: A sequential approach to obtain optimal designs for non-linear\n  models leveraging closed-form solutions for faster convergence","authors":"Suvrojit Ghosh, Koulik Khamaru, Tirthankar Dasgupta","authorsParsed":[["Ghosh","Suvrojit",""],["Khamaru","Koulik",""],["Dasgupta","Tirthankar",""]],"versions":[{"version":"v1","created":"Sat, 7 Dec 2024 20:53:27 GMT"}],"updateDate":"2024-12-10","timestamp":1733604807000,"abstract":"  D-Optimal designs for estimating parameters of response models are derived by\nmaximizing the determinant of the Fisher information matrix. For non-linear\nmodels, the Fisher information matrix depends on the unknown parameter vector\nof interest, leading to a weird situation that in order to obtain the D-optimal\ndesign, one needs to have knowledge of the parameter to be estimated. One\nsolution to this problem is to choose the design points sequentially,\noptimizing the D-optimality criterion using parameter estimates based on\navailable data, followed by updating the parameter estimates using maximum\nlikelihood estimation. On the other hand, there are many non-linear models for\nwhich closed-form results for D-optimal designs are available, but because such\nsolutions involve the parameters to be estimated, they can only be used by\nsubstituting \"guestimates\" of parameters. In this paper, a hybrid sequential\nstrategy called PICS (Plug into closed-form solution) is proposed that replaces\nthe optimization of the objective function at every single step by a draw from\nthe probability distribution induced by the known optimal design by plugging in\nthe current estimates. Under regularity conditions, asymptotic normality of the\nsequence of estimators generated by this approach are established. Usefulness\nof this approach in terms of saving computational time and achieving greater\nefficiency of estimation compared to the standard sequential approach are\ndemonstrated with simulations conducted from two different sets of models.\n","subjects":["Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"5wO8lwfpcdI-eNfk6tUxDowlEfYGYYDhCGM5FcuvR-4","pdfSize":"860241"}