{"id":"2412.02530","title":"WEM-GAN: Wavelet transform based facial expression manipulation","authors":"Dongya Sun, Yunfei Hu, Xianzhe Zhang, Yingsong Hu","authorsParsed":[["Sun","Dongya",""],["Hu","Yunfei",""],["Zhang","Xianzhe",""],["Hu","Yingsong",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 16:23:02 GMT"}],"updateDate":"2024-12-04","timestamp":1733242982000,"abstract":"  Facial expression manipulation aims to change human facial expressions\nwithout affecting face recognition. In order to transform the facial\nexpressions to target expressions, previous methods relied on expression labels\nto guide the manipulation process. However, these methods failed to preserve\nthe details of facial features, which causes the weakening or the loss of\nidentity information in the output image. In our work, we propose WEM-GAN, in\nshort for wavelet-based expression manipulation GAN, which puts more efforts on\npreserving the details of the original image in the editing process. Firstly,\nwe take advantage of the wavelet transform technique and combine it with our\ngenerator with a U-net autoencoder backbone, in order to improve the\ngenerator's ability to preserve more details of facial features. Secondly, we\nalso implement the high-frequency component discriminator, and use\nhigh-frequency domain adversarial loss to further constrain the optimization of\nour model, providing the generated face image with more abundant details.\nAdditionally, in order to narrow the gap between generated facial expressions\nand target expressions, we use residual connections between encoder and\ndecoder, while also using relative action units (AUs) several times. Extensive\nqualitative and quantitative experiments have demonstrated that our model\nperforms better in preserving identity features, editing capability, and image\ngeneration quality on the AffectNet dataset. It also shows superior performance\nin metrics such as Average Content Distance (ACD) and Expression Distance (ED).\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Artificial Intelligence","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"ETCQEiqZgRjznF2LtJ2I9AktTz7YdQyjCzL_8D_r9lk","pdfSize":"1372979"}