{"id":"2412.08911","title":"Rethinking Multi-Objective Learning through Goal-Conditioned Supervised\n  Learning","authors":"Shijun Li, Hilaf Hasson, Jing Hu, Joydeep Ghosh","authorsParsed":[["Li","Shijun",""],["Hasson","Hilaf",""],["Hu","Jing",""],["Ghosh","Joydeep",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 03:47:40 GMT"},{"version":"v2","created":"Sat, 18 Jan 2025 00:35:16 GMT"}],"updateDate":"2025-01-22","timestamp":1733975260000,"abstract":"  Multi-objective learning aims to optimize multiple objectives simultaneously\nwith a single model for achieving a balanced and satisfying performance on all\nthese objectives. However, it suffers from the difficulty to formalize and\nconduct the exact learning process, especially considering the possible\nconflicts between objectives. Existing approaches explores to resolve this\nprimarily in two directions: adapting modeling structure or constraining\noptimization with certain assumptions. However, a primary issue is that their\npresuppositions for the effectiveness of their design are insufficient to\nguarantee the its generality in real-world applications. What's worse, the high\nspace and computation complexity issue makes it even harder to apply them in\nlarge-scale, complicated environment such as the recommender systems. To\naddress these issues, we propose a general framework for automatically learning\nto achieve multiple objectives based on the existing sequential data. We apply\nthe goal-conditioned supervised learning (GCSL) framework to multi-objective\nlearning, by extending the definition of goals from one-dimensional scalar to\nmulti-dimensional vector that perfectly disentangle the representation of\ndifferent objectives. Meanwhile, GCSL enables the model to simultaneously learn\nto achieve each objective in a concise supervised learning way, simply guided\nby existing sequences in the offline data. No additional constraint, special\nmodel structure design, or complex optimization algorithms are further\nrequired. Apart from that, we formally analyze the property of the goals in\nGCSL and then firstly propose a goal-generation framework to gain achievable\nand reasonable goals for inference. Extensive experiments are conducted on\nreal-world recommendation datasets, demonstrating the effectiveness of the\nproposed method and exploring the feasibility of the goal-generation strategies\nin GCSL.\n","subjects":["Computer Science/Machine Learning","Computer Science/Artificial Intelligence","Computer Science/Information Retrieval"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_5-zkVJSOm4MrmZWkBZm68FqdK7H5q1sFCMHMwHSdC0","pdfSize":"1485940"}