{
  "id": "2412.11706",
  "title": "AsymRnR: Video Diffusion Transformers Acceleration with Asymmetric\n  Reduction and Restoration",
  "authors": "Wenhao Sun and Rong-Cheng Tu and Jingyi Liao and Zhao Jin and Dacheng\n  Tao",
  "authorsParsed": [
    [
      "Sun",
      "Wenhao",
      ""
    ],
    [
      "Tu",
      "Rong-Cheng",
      ""
    ],
    [
      "Liao",
      "Jingyi",
      ""
    ],
    [
      "Jin",
      "Zhao",
      ""
    ],
    [
      "Tao",
      "Dacheng",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 12:28:22 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734352102000,
  "abstract": "  Video Diffusion Transformers (DiTs) have demonstrated significant potential\nfor generating high-fidelity videos but are computationally intensive. Existing\nacceleration methods include distillation, which requires costly retraining,\nand feature caching, which is highly sensitive to network architecture. Recent\ntoken reduction methods are training-free and architecture-agnostic, offering\ngreater flexibility and wider applicability. However, they enforce the same\nsequence length across different components, constraining their acceleration\npotential. We observe that intra-sequence redundancy in video DiTs varies\nacross features, blocks, and denoising timesteps. Building on this observation,\nwe propose Asymmetric Reduction and Restoration (AsymRnR), a training-free\napproach to accelerate video DiTs. It offers a flexible and adaptive strategy\nthat reduces the number of tokens based on their redundancy to enhance both\nacceleration and generation quality. We further propose matching cache to\nfacilitate faster processing. Integrated into state-of-the-art video DiTs,\nAsymRnR achieves a superior speedup without compromising the quality.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "NTWV11BgjhCNtltTIU1H2mUFfj9jTmR0BnFbRl4EGKc",
  "pdfSize": "6864576"
}