{"id":"2412.05086","title":"Non-linear magnetic buoyancy instability and galactic dynamos","authors":"Yasin Qazi, Anvar. Shukurov, Frederick. A. Gent, Devika. Tharakkal,\n  Abhijit. B. Bendre","authorsParsed":[["Qazi","Yasin",""],["Shukurov","Anvar.",""],["Gent","Frederick. A.",""],["Tharakkal","Devika.",""],["Bendre","Abhijit. B.",""]],"versions":[{"version":"v1","created":"Fri, 6 Dec 2024 14:44:35 GMT"},{"version":"v2","created":"Tue, 10 Dec 2024 19:17:06 GMT"}],"updateDate":"2024-12-12","timestamp":1733496275000,"abstract":"  The magnetic buoyancy (MBI) and Parker instabilities are strong and generic\ninstabilities expected to occur in most astrophysical systems with sufficiently\nstrong magnetic fields. In galactic and accretion discs, large-scale magnetic\nfields are thought to result from the mean-field dynamo action, in particular,\nthe $\\alpha^2\\Omega$. Using non-ideal MHD equations, we model a section of the\ngalactic disc in which the large-scale magnetic field is generated by an\nimposed $\\alpha$-effect and differential rotation. We extend our earlier study\nof the interplay between magnetic buoyancy and the mean-field dynamo. We add\ndifferential rotation which enhances the dynamo and cosmic rays which enhance\nmagnetic buoyancy. We construct a simple 1D model which replicates all\nsignificant features of the 3D simulations. We confirm that magnetic buoyancy\ncan lead to oscillatory magnetic fields and discover that it can vary the\nmagnetic field parity between quadrupolar and dipolar, and that inclusion of\nthe differential rotation is responsible for the switch in field parity. Our\nresults suggest that the large-scale magnetic field can have a dipolar parity\nwithin a few kiloparsecs of the galactic centre, provided the MBI is\nsignificantly stronger the the dynamo. Quadrupolar parity can remain\npredominant in the outer parts of a galactic disc. Cosmic rays accelerate both\nthe dynamo and the MBI and support oscillatory non-linear states, a spatial\nmagnetic field structure similar to the alternating magnetic field directions\nobserved in some edge-on galaxies.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"gf3IksJ4uI7-Stt8A54j_cePkopx28YTF-OMHOBXZlM","pdfSize":"2810748"}