{"id":"2412.13024","title":"Late-Time Optical and X-ray Emission Evolution of the Oxygen-Rich SN\n  1996cr","authors":"Daniel Patnaude, Kathryn Weil, Robert Fesen, Dan Milisavljevic, Ralph\n  Kraft","authorsParsed":[["Patnaude","Daniel",""],["Weil","Kathryn",""],["Fesen","Robert",""],["Milisavljevic","Dan",""],["Kraft","Ralph",""]],"versions":[{"version":"v1","created":"Tue, 17 Dec 2024 15:42:03 GMT"}],"updateDate":"2024-12-18","timestamp":1734450123000,"abstract":"  When the ejecta of supernovae interact with the progenitor star's\ncircumstellar environment, a strong shock is driven back into the ejecta,\ncausing the material to become bright optically and in X-rays. Most notably, as\nthe shock traverses the H-rich envelope, it begins to interact with metal rich\nmaterial. Thus, continued monitoring of bright and nearby supernovae provides\nvaluable clues about both the progenitor structure and its pre-supernova\nevolution. Here we present late-time, multi-epoch optical and Chandra} X-ray\nspectra of the core-collapse supernova SN 1996cr. Magellan IMACS optical\nspectra taken in July 2017 and August 2021 show a very different spectrum from\nthat seen in 2006 with broad, double-peaked optical emission lines of oxygen,\nargon, and sulfur with expansion velocities of $\\pm 4500$ km s$^{-1}$.\nRed-shifted emission components are considerably fainter compared to the\nblue-shifted components, presumably due to internal extinction from dust in the\nsupernova ejecta. Broad $\\pm 2400$ km s$^{-1}$ H$\\alpha$ is also seen which we\ninfer is shocked progenitor pre-SN mass-loss, H-rich material. Chandra data\nindicate a slow but steady decline in overall X-ray luminosity, suggesting that\nthe forward shock has broken through any circumstellar shell or torus which is\ninferred from prior deep Chandra ACIS-S/HETG observations. The X-ray properties\nare consistent with what is expected from a shock breaking out into a lower\ndensity environment. Though originally identified as a SN IIn, based upon late\ntime optical emission line spectra, we argue that the SN 1996cr progenitor was\npartially or highly stripped, suggesting a SN IIb/Ib.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"jFLFX9-7zvKrOvrI8Aneb9lzCZgSbdIlGtKWgMVvQos","pdfSize":"12055054"}