{"id":"2412.07208","title":"Novel nonlinear system family generated from coupling effect of\n  Sin-Cosine function","authors":"Fangfang Zhang, Jinyi Ge, Cuimei Jiang, Han Bao, Jianlin Zhang, Da\n  Wang, and Yang Zhao","authorsParsed":[["Zhang","Fangfang",""],["Ge","Jinyi",""],["Jiang","Cuimei",""],["Bao","Han",""],["Zhang","Jianlin",""],["Wang","Da",""],["Zhao","Yang",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 05:58:11 GMT"}],"updateDate":"2024-12-11","timestamp":1733810291000,"abstract":"  The Sine-Cosine function, which is widely adopted in mathematics and physics,\nhas attracted our attention due to its unique properties. By delving into the\ncoupling effect of the Sine-Cosine function, we discover a previously\nunreported class of nonlinear systems, namely the Sine-Cosine Nonlinear System\nFamily (SCNSF). This discovery is motivated by the need to expand the\nrepertoire of nonlinear systems and understand the complex behaviors that can\nemerge from the combination of basic trigonometric functions. The SCNSF has\nboth chaotic characteristics in the real number domain and fractal\ncharacteristics in the complex number domain. The classification and general\nmathematical description of SCNSF provide a solid theoretical foundation for\nfurther research. The proposal of three types of classic systems within SCNSF\nand the investigation of their chaotic properties and hardware implementation\nopen up new avenues for practical applications. The large chaotic range\nexhibited by these systems implies their potential applications in various\nfields such as secure communication and chaotic circuit design. Moreover, the\ndiscovery of the chaos generation mechanism based on the coupling effect of the\nSine-Cosine function deepens our understanding of the origin of chaos. In the\ncomplex number domain, the high parameter sensitivity and rich fractal patterns\nof SCNSF can be can be harnessed to develop more advanced encryption algorithms\nand more sensitive signal detection methods, thereby contributing to the\nadvancement of information security and signal processing technologies.\nOverall, the chaotic and fractal properties of SCNSF make it a valuable asset\nin the pursuit of innovative solutions in multiple scientific and engineering\ndisciplines.\n","subjects":["Nonlinear Sciences/Chaotic Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"CYHjQTf_mSx-f3n_4Wn-2KvX7R5XZHt-MhEG1CWhskU","pdfSize":"8186518"}