{"id":"2412.18969","title":"Slow water in engineered nano-channels revealed by color-center-enabled\n  sensing","authors":"Daniela Pagliero, Rohma Khan, Kapila Elkaduwe, Ankit Bhardwaj, Kang\n  Xu, Abraham Wolcott, Gustavo L\\'opez, Boya Radha, Nicolas Giovambattista, and\n  Carlos A. Meriles","authorsParsed":[["Pagliero","Daniela",""],["Khan","Rohma",""],["Elkaduwe","Kapila",""],["Bhardwaj","Ankit",""],["Xu","Kang",""],["Wolcott","Abraham",""],["López","Gustavo",""],["Radha","Boya",""],["Giovambattista","Nicolas",""],["Meriles","Carlos A.",""]],"versions":[{"version":"v1","created":"Wed, 25 Dec 2024 19:11:54 GMT"}],"updateDate":"2024-12-30","timestamp":1735153914000,"abstract":"  Nanoscale confinement of molecules in a fluid can result in enhanced\nviscosity, local fluidic order, or collective motion. Confinement also affects\nion transport and/or the rate and equilibrium concentration in a chemical\nreaction, all of which makes it the subject of broad interest. Studying these\neffects, however, is notoriously difficult, mainly due to the lack of\nexperimental methods with the required sensitivity and spatial or time\nresolution. Here we leverage shallow nitrogen-vacancy (NV) centers in diamond\nto probe the dynamics of room-temperature water molecules entrapped within\n~6-nm-tall channels formed between the diamond crystal and a suspended\nhexagonal boron nitride (hBN) flake. NV-enabled nuclear magnetic resonance\nmeasurements of confined water protons reveal a much reduced H2O\nself-diffusivity, orders of magnitude lower than in bulk water. We posit the\nslow dynamics stem from the accumulation of photogenerated carriers at the\ninterface and trapped fluid, a notion we support with the help of molecular\ndynamics modeling. Our results provide feedback for theories describing\ninterfacial water, and lay out a route for investigating other fluids under\nconfinement.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"igeaUop9XnGP_wN6YvYPVJGkT7UWtW4uN4f_2LJP_QE","pdfSize":"9008050"}