{"id":"2412.07823","title":"Optimizing Locomotor Task Sets in Biological Joint Moment Estimation for\n  Hip Exoskeleton Applications","authors":"Jimin An, Changseob Song, Eni Halilaj, Inseung Kang","authorsParsed":[["An","Jimin",""],["Song","Changseob",""],["Halilaj","Eni",""],["Kang","Inseung",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 17:29:21 GMT"}],"updateDate":"2024-12-12","timestamp":1733851761000,"abstract":"  Accurate estimation of a user's biological joint moment from wearable sensor\ndata is vital for improving exoskeleton control during real-world locomotor\ntasks. However, most state-of-the-art methods rely on deep learning techniques\nthat necessitate extensive in-lab data collection, posing challenges in\nacquiring sufficient data to develop robust models. To address this challenge,\nwe introduce a locomotor task set optimization strategy designed to identify a\nminimal, yet representative, set of tasks that preserves model performance\nwhile significantly reducing the data collection burden. In this optimization,\nwe performed a cluster analysis on the dimensionally reduced biomechanical\nfeatures of various cyclic and non-cyclic tasks. We identified the minimal\nviable clusters (i.e., tasks) to train a neural network for estimating hip\njoint moments and evaluated its performance. Our cross-validation analysis\nacross subjects showed that the optimized task set-based model achieved a root\nmean squared error of 0.30$\\pm$0.05 Nm/kg. This performance was significantly\nbetter than using only cyclic tasks (p<0.05) and was comparable to using the\nfull set of tasks. Our results demonstrate the ability to maintain model\naccuracy while significantly reducing the cost associated with data collection\nand model training. This highlights the potential for future exoskeleton\ndesigners to leverage this strategy to minimize the data requirements for deep\nlearning-based models in wearable robot control.\n","subjects":["Computer Science/Robotics","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Td1T2eqB2KJBjVr5FhZbz2iu6Ms61qcERq1cMRD8Bus","pdfSize":"1269205"}