{
  "id": "2412.03300",
  "title": "Conveying Emotions to Robots through Touch and Sound",
  "authors": "Qiaoqiao Ren, Remko Proesmans, Frederick Bossuyt, Jan Vanfleteren,\n  Francis Wyffels, and Tony Belpaeme",
  "authorsParsed": [
    [
      "Ren",
      "Qiaoqiao",
      ""
    ],
    [
      "Proesmans",
      "Remko",
      ""
    ],
    [
      "Bossuyt",
      "Frederick",
      ""
    ],
    [
      "Vanfleteren",
      "Jan",
      ""
    ],
    [
      "Wyffels",
      "Francis",
      ""
    ],
    [
      "Belpaeme",
      "Tony",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 13:17:42 GMT"
    }
  ],
  "updateDate": "2024-12-05",
  "timestamp": 1733318262000,
  "abstract": "  Human emotions can be conveyed through nuanced touch gestures. However, there\nis a lack of understanding of how consistently emotions can be conveyed to\nrobots through touch. This study explores the consistency of touch-based\nemotional expression toward a robot by integrating tactile and auditory sensory\nreading of affective haptic expressions. We developed a piezoresistive pressure\nsensor and used a microphone to mimic touch and sound channels, respectively.\nIn a study with 28 participants, each conveyed 10 emotions to a robot using\nspontaneous touch gestures. Our findings reveal a statistically significant\nconsistency in emotion expression among participants. However, some emotions\nobtained low intraclass correlation values. Additionally, certain emotions with\nsimilar levels of arousal or valence did not exhibit significant differences in\nthe way they were conveyed. We subsequently constructed a multi-modal\nintegrating touch and audio features to decode the 10 emotions. A support\nvector machine (SVM) model demonstrated the highest accuracy, achieving 40% for\n10 classes, with \"Attention\" being the most accurately conveyed emotion at a\nbalanced accuracy of 87.65%.\n",
  "subjects": [
    "Computer Science/Robotics",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/publicdomain/zero/1.0/",
  "blobId": "BpiNPa8_6zcNnzjEO9nYpueQ42GU4lzS0vt9l-r_fbc",
  "pdfSize": "1966318"
}