{
  "id": "2412.19971",
  "title": "Relative Binding Free Energy Estimation of Congeneric Ligands and\n  Macromolecular Mutants with the Alchemical Transfer with Coordinate Swapping\n  Method",
  "authors": "Emilio Gallicchio",
  "authorsParsed": [
    [
      "Gallicchio",
      "Emilio",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 28 Dec 2024 01:55:43 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735350943000,
  "abstract": "  We present the Alchemical Transfer with Coordinate Swapping (ATS) method to\nenable the calculation of the relative binding free energies between large\ncongeneric ligands and single-point mutant peptides to protein receptors with\nthe Alchemical Transfer Method (ATM) framework. Similarly to ATM, the new\nmethod implements the alchemical transformation as a coordinate transformation,\nand works with any unmodified force fields and standard chemical topologies.\nUnlike ATM, which transfers the whole ligands in and out of the receptor\nbinding site, ATS limits the magnitude of the alchemical perturbation by\ntransferring only the portion of the molecules that differ between the the\nbound and unbound ligands. The common region of the two ligands, which can be\narbitrarily large, is unchanged and does not contribute to the magnitude and\nstatistical fluctuations of the perturbation energy. Internally, the\ncoordinates of the atoms of the common regions are swapped to maintain the\nintegrity of the covalent bonding data structures of the molecular dynamics\nengine. The work successfully validates the method on protein-ligand and\nprotein-peptide RBFE benchmarks. This advance paves the road for the\napplication of the relative binding free energy Alchemical Transfer Method\nprotocol to study the effect of protein and nucleic acid mutations on the\nbinding affinity and specificity of macromolecular complexes.\n",
  "subjects": [
    "Physics/Chemical Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "DPtlKB2KOH8FJw1TXX13XeYQrRQG7JyjHd603pSFyFw",
  "pdfSize": "2179847"
}