{
  "id": "2412.19838",
  "title": "Hierarchical Blockchain Radio Access Networks: Architecture, Modelling,\n  and Performance Assessment",
  "authors": "Vasileios Kouvakis, Stylianos E. Trevlakis, Alexandros-Apostolos A.\n  Boulogeorgos, Hongwu Liu, Waqas Khalid, Theodoros Tsiftsis, and Octavia A.\n  Dobre",
  "authorsParsed": [
    [
      "Kouvakis",
      "Vasileios",
      ""
    ],
    [
      "Trevlakis",
      "Stylianos E.",
      ""
    ],
    [
      "Boulogeorgos",
      "Alexandros-Apostolos A.",
      ""
    ],
    [
      "Liu",
      "Hongwu",
      ""
    ],
    [
      "Khalid",
      "Waqas",
      ""
    ],
    [
      "Tsiftsis",
      "Theodoros",
      ""
    ],
    [
      "Dobre",
      "Octavia A.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 17:02:43 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1734973363000,
  "abstract": "  Demands for secure, ubiquitous, and always-available connectivity have been\nidentified as the pillar design parameters of the next generation radio access\nnetworks (RANs). Motivated by this, the current contribution introduces a\nnetwork architecture that leverages blockchain technologies to augment security\nin RANs, while enabling dynamic coverage expansion through the use of\nintermediate commercial or private wireless nodes. To assess the efficiency and\nlimitations of the architecture, we employ Markov chain theory in order to\nextract a theoretical model with increased engineering insights. Building upon\nthis model, we quantify the latency as well as the security capabilities in\nterms of probability of successful attack, for three scenarios, namely fixed\ntopology fronthaul network, advanced coverage expansion and advanced mobile\nnode connectivity, which reveal the scalability of the blockchain-RAN\narchitecture.\n",
  "subjects": [
    "Computer Science/Networking and Internet Architecture"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "5u0YXNiJMxIVtD7tek9Gi14rB5cHfvDfS54gldl20xY",
  "pdfSize": "4967746"
}