{
  "id": "2412.18242",
  "title": "Multifluid simulation of shear-induced migration in pressure-driven\n  suspension flows",
  "authors": "Mohammad Noori, Joseph D. Berry and Dalton J.E. Harvie",
  "authorsParsed": [
    [
      "Noori",
      "Mohammad",
      ""
    ],
    [
      "Berry",
      "Joseph D.",
      ""
    ],
    [
      "Harvie",
      "Dalton J. E.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 24 Dec 2024 07:51:38 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1735026698000,
  "abstract": "  The present study simulates shear-induced migration (SIM) in semi-dilute\npressure-driven Stokes suspension flows using a multi-fluid (MF) model.\nBuilding on analysis from a companion paper (Harvie, 2024), the specific\nformulation uses volume-averaged phase stresses that are linked to the binary\nhydrodynamic interaction of spheres and suspension microstructure as\nrepresented by an anisotropic, piece-wise constant pair-distribution function\n(PDF). The form of the PDF is chosen to capture observations regarding the\nmicrostructure in sheared suspensions of rough particles, as reported in the\nliterature. Specifically, a hydrodynamic roughness value is used to represent\nthe width of the anisotropic region, and within this region the concentration\nof particles is higher in the compression zone than expansion zone. By\nnumerically evaluating the hydrodynamic particle interactions and calculating\nthe various shear and normal viscosities, the stress closure is incorporated\ninto Harvie's volume-averaged MF framework, referred to as the MF-roughness\nmodel. Using multi-dimensional simulations the roughness and compression zone\nPDF concentration are then globally optimised to reproduce benchmark solid and\nvelocity distributions reported in the literature for a variety of semi-dilute\nmonodisperse suspension flows occurring within rectangular channels. For\ncomparison, two different versions of the phenomenological stress closure by\nMorris and Boulay (1999) are additionally proposed as fully tensorial\nframe-invariant alternatives to the MF-roughness model. Referred to as\nMF-MB99-A and MF-MB99-B, these models use alternative assumptions for\npartitioning of the mixture normal stress between the solid and fluid phases.\nThe optimised solid and velocity distributions from all three stress closures\nare similar and correlate well with the experimental data.\n",
  "subjects": [
    "Physics/Fluid Dynamics",
    "Condensed Matter/Soft Condensed Matter"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "oC_BPocg5jLy777-ZZgroHLFOuRai8VN1N0pIt-Wp5o",
  "pdfSize": "1693744"
}