{
  "id": "2412.20427",
  "title": "AmalREC: A Dataset for Relation Extraction and Classification Leveraging\n  Amalgamation of Large Language Models",
  "authors": "Mansi, Pranshu Pandya, Mahek Bhavesh Vora, Soumya Bharadwaj, Ashish\n  Anand",
  "authorsParsed": [
    [
      "Mansi",
      "",
      ""
    ],
    [
      "Pandya",
      "Pranshu",
      ""
    ],
    [
      "Vora",
      "Mahek Bhavesh",
      ""
    ],
    [
      "Bharadwaj",
      "Soumya",
      ""
    ],
    [
      "Anand",
      "Ashish",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 29 Dec 2024 10:36:33 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735468593000,
  "abstract": "  Existing datasets for relation classification and extraction often exhibit\nlimitations such as restricted relation types and domain-specific biases. This\nwork presents a generic framework to generate well-structured sentences from\ngiven tuples with the help of Large Language Models (LLMs). This study has\nfocused on the following major questions: (i) how to generate sentences from\nrelation tuples, (ii) how to compare and rank them, (iii) can we combine\nstrengths of individual methods and amalgamate them to generate an even bette\nquality of sentences, and (iv) how to evaluate the final dataset? For the first\nquestion, we employ a multifaceted 5-stage pipeline approach, leveraging LLMs\nin conjunction with template-guided generation. We introduce Sentence\nEvaluation Index(SEI) that prioritizes factors like grammatical correctness,\nfluency, human-aligned sentiment, accuracy, and complexity to answer the first\npart of the second question. To answer the second part of the second question,\nthis work introduces a SEI-Ranker module that leverages SEI to select top\ncandidate generations. The top sentences are then strategically amalgamated to\nproduce the final, high-quality sentence. Finally, we evaluate our dataset on\nLLM-based and SOTA baselines for relation classification. The proposed dataset\nfeatures 255 relation types, with 15K sentences in the test set and around 150k\nin the train set organized in, significantly enhancing relational diversity and\ncomplexity. This work not only presents a new comprehensive benchmark dataset\nfor RE/RC task, but also compare different LLMs for generation of quality\nsentences from relational tuples.\n",
  "subjects": [
    "Computer Science/Information Retrieval"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "OLsU6bDEfPDigkaWEUpmJRwzzIfPiFODaLR_R-IQIjs",
  "pdfSize": "2971886"
}