{
  "id": "2412.15046",
  "title": "Applications of machine learning in gravitational wave research with\n  current interferometric detectors",
  "authors": "Elena Cuoco, Marco Cavagli\\`a, Ik Siong Heng, David Keitel,\n  Christopher Messenger",
  "authorsParsed": [
    [
      "Cuoco",
      "Elena",
      ""
    ],
    [
      "Cavaglià",
      "Marco",
      ""
    ],
    [
      "Heng",
      "Ik Siong",
      ""
    ],
    [
      "Keitel",
      "David",
      ""
    ],
    [
      "Messenger",
      "Christopher",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 16:52:43 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734627163000,
  "abstract": "  This article provides an overview of the current state of machine learning in\ngravitational-wave research with interferometric detectors. Such applications\nare often still in their early days, but have reached sufficient popularity to\nwarrant an assessment of their impact across various domains, including\ndetector studies, noise and signal simulations, and the detection and\ninterpretation of astrophysical signals.\n  In detector studies, machine learning could be useful to optimize instruments\nlike LIGO, Virgo, KAGRA, and future detectors. Algorithms could predict and\nhelp in mitigating environmental disturbances in real time, ensuring detectors\noperate at peak performance. Furthermore, machine-learning tools for\ncharacterizing and cleaning data after it is taken have already become crucial\ntools for achieving the best sensitivity of the LIGO--Virgo--KAGRA network.\n  In data analysis, machine learning has already been applied as an alternative\nto traditional methods for signal detection, source localization, noise\nreduction, and parameter estimation. For some signal types, it can already\nyield improved efficiency and robustness, though in many other areas\ntraditional methods remain dominant.\n  As the field evolves, the role of machine learning in advancing\ngravitational-wave research is expected to become increasingly prominent. This\nreport highlights recent advancements, challenges, and perspectives for the\ncurrent detector generation, with a brief outlook to the next generation of\ngravitational-wave detectors.\n",
  "subjects": [
    "Physics/General Relativity and Quantum Cosmology",
    "Astrophysics/Instrumentation and Methods for Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "6JpgYoSvU3hPHL5tbcgNoJ-1mBkg8-FmiTqP6iwN95U",
  "pdfSize": "18914274"
}