{"id":"2412.06937","title":"High-Resolution Rooftop-PV Potential Assessment for a Resilient Energy\n  System in Ukraine","authors":"Christoph Winkler (1 and 2), Kristina Dabrock (1 and 2), Serhiy\n  Kapustyan (1), Craig Hart (3), Heidi Heinrichs (1), Jann Michael Weinand (1),\n  Jochen Lin{\\ss}en (1), and Detlef Stolten (1 and 2) ((1) Forschungszentrum\n  J\\\"ulich GmbH, Institute of Climate and Energy Systems, J\\\"ulich Systems\n  Analysis, J\\\"ulich, Germany, (2) RWTH Aachen University, Chair for Fuel\n  Cells, Faculty of Mechanical Engineering, Aachen, Germany, (3) International\n  Energy Agency (IEA), Paris, France)","authorsParsed":[["Winkler","Christoph","","1 and 2"],["Dabrock","Kristina","","1 and 2"],["Kapustyan","Serhiy","","1 and 2"],["Hart","Craig","","1 and 2"],["Heinrichs","Heidi","","1 and 2"],["Weinand","Jann Michael","","1 and 2"],["Linßen","Jochen","","1 and 2"],["Stolten","Detlef","","1 and 2"]],"versions":[{"version":"v1","created":"Mon, 9 Dec 2024 19:26:38 GMT"},{"version":"v2","created":"Wed, 18 Dec 2024 17:31:39 GMT"}],"updateDate":"2024-12-19","timestamp":1733772398000,"abstract":"  Rooftop photovoltaic (RTPV) systems are essential for building a decarbonized\nand, due to its decentralized structure, more resilient energy system, and are\nparticularly important for Ukraine, where recent conflicts have damaged more\nthan half of its electricity and heat supply capacity. Favorable solar\nirradiation conditions make Ukraine a strong candidate for large-scale PV\ndeployment, but effective policy requires detailed data on spatial and temporal\ngeneration potential. This study fills the data gap by using open-source\nsatellite building footprint data corrected with high-resolution data from\neastern Germany. This approach allowed accurate estimates of rooftop area and\nPV capacity and generation across Ukraine, with simulations revealing a\ncapacity potential of 238.8 GW and a generation potential of 290 TWh/a\nexcluding north-facing. The majority of this potential is located in oblasts\n(provinces) across the country with large cities such as Donetsk, Dnipro or\nKyiv and surroundings. These results, validated against previous studies and\navailable as open data, confirm Ukraine's significant potential for RTPV,\nsupporting both energy resilience and climate goals.\n","subjects":["Physics/Physics and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"fGdatAWyE04C8hypI9cpH0VPJLou_JzxBZl19jIxRZs","pdfSize":"3318044"}