{
  "id": "2412.05121",
  "title": "Exploiting the combined dynamic and geometric phases for optical vortex\n  beam generation using metasurfaces",
  "authors": "Jialong Cui, Chen Qing, Lishuang Feng, and Dengke Zhang",
  "authorsParsed": [
    [
      "Cui",
      "Jialong",
      ""
    ],
    [
      "Qing",
      "Chen",
      ""
    ],
    [
      "Feng",
      "Lishuang",
      ""
    ],
    [
      "Zhang",
      "Dengke",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 15:22:38 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733498558000,
  "abstract": "  The generation of optical vortex beams is pivotal for a myriad of\napplications, encompassing optical tweezing, optical communications, and\nquantum information, among others. The metasurface-based approach has realized\nsignificant advancements in vortex production, utilizing either dynamic or\ngeometric phases. The dynamic design exhibits indifference to the polarization\nstate of incident light, while the geometric design is inextricably tied to it.\nIn the study, we put forth the proposition that combining dynamic and geometric\nphases could unlock the potential of metasurface design in generating optical\nvortices. A hybrid design that harnesses the combined dynamic and geometric\nphases can attain the same objective while offering tunable functional control\nover the polarization of light. We establish a correlation between the\nstructural parameters of metasurface and the topological charge of the\nresulting vortices. The experimental results fully demonstrate the design's\nflexibility and its effective control over the polarization constraints of\nincident light. Our research uncovers the capacity for vortex generation\nthrough the manipulation of hybrid phases introduced by metasurfaces,\nindicating significant potential for the design of optical devices and the\nfuture advancement of innovative optical applications.\n",
  "subjects": [
    "Physics/Optics",
    "Physics/Applied Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "nLCNjpherqBRlV_4uAhdI6J_e7XTuZ7lBVvdH4PbtUg",
  "pdfSize": "6935092"
}