{"id":"2412.01593","title":"ALMA Observations of Massive Clouds in the Central Molecular Zone:\n  External-Pressure-Confined Dense Cores and Salpeter-like Core Mass Functions","authors":"Zhenying Zhang, Xing Lu, Tie Liu, Sheng-Li Qin, Adam Ginsburg, Yu\n  Cheng, Hauyu Baobab Liu, Daniel L. Walker, Xindi Tang, Shanghuo Li, Qizhou\n  Zhang, Thushara Pillai, Jens Kauffmann, Cara Battersby, Siyi Feng, Suinan\n  Zhang, Qi-Lao Gu, Fengwei Xu, Wenyu Jiao, Xunchuan Liu, Li Chen, Qiu-yi Luo,\n  Xiaofeng Mai, Zi-yang Li, Dongting Yang, Xianjin Shen, Meizhu Liu, Zhiqiang\n  Shen","authorsParsed":[["Zhang","Zhenying",""],["Lu","Xing",""],["Liu","Tie",""],["Qin","Sheng-Li",""],["Ginsburg","Adam",""],["Cheng","Yu",""],["Liu","Hauyu Baobab",""],["Walker","Daniel L.",""],["Tang","Xindi",""],["Li","Shanghuo",""],["Zhang","Qizhou",""],["Pillai","Thushara",""],["Kauffmann","Jens",""],["Battersby","Cara",""],["Feng","Siyi",""],["Zhang","Suinan",""],["Gu","Qi-Lao",""],["Xu","Fengwei",""],["Jiao","Wenyu",""],["Liu","Xunchuan",""],["Chen","Li",""],["Luo","Qiu-yi",""],["Mai","Xiaofeng",""],["Li","Zi-yang",""],["Yang","Dongting",""],["Shen","Xianjin",""],["Liu","Meizhu",""],["Shen","Zhiqiang",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 15:09:54 GMT"}],"updateDate":"2024-12-03","timestamp":1733152194000,"abstract":"  We present Atacama Large Millimeter/submillimeter Array (ALMA) Band 6 (1.3\nmm) observations of dense cores in three massive molecular clouds within the\nCentral Molecular Zone (CMZ) of the Milky Way, including the Dust Ridge cloud\ne, Sgr C, and the 20 km s-1 cloud, at a spatial resolution of 2000 au. Among\nthe 834 cores identified from the 1.3 mm continuum, we constrain temperatures\nand linewidths of 253 cores using local thermodynamic equilibrium (LTE) methods\nto fit the H2CO and/or CH3CN spectra. We determine their masses using the 1.3\nmm dust continuum and derived temperatures, and then evaluate their virial\nparameters using the H2CO and/or CH3CN linewidths and construct the core mass\nfunctions (CMFs). We find that the contribution of external pressure is crucial\nfor the virial equilibrium of the dense cores in the three clouds, which\ncontrasts with the environment in the Galactic disk where dense cores are\nalready bound even without the contribution of external pressure. We also find\nthat the CMFs show a Salpeter-like slope in the high-mass (>~3-6 Msun) end, a\nchange from previous works with our new temperature estimates. Combined with\nthe possible top-heavy initial mass functions (IMFs) in the CMZ, our result\nsuggests that gas accretion and further fragmentation may play important roles\nin transforming the CMF to the IMF.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"dos4sHx-DME9t98p3rpYjNK5fjLw0Zb5lLYjBhg_NIg","pdfSize":"9562482"}