{
  "id": "2412.15319",
  "title": "Do the unvaccinated disproportionately harm the vaccinated in a\n  respiratory pandemic?",
  "authors": "Denis G. Rancourt, Joseph Hickey",
  "authorsParsed": [
    [
      "Rancourt",
      "Denis G.",
      ""
    ],
    [
      "Hickey",
      "Joseph",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 18:57:39 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734634659000,
  "abstract": "  A parameter $\\psi$ was recently defined and introduced into the\nepidemiological modelling scientific literature, and is being accepted. The\nsaid parameter was used to argue that there was a disproportionate risk of\ninfection incurred by vaccinated persons due to contacts with unvaccinated\npersons during the declared COVID-19 pandemic. Opposing published results show\nthat, in general, there is virtually never a disproportionate risk to the\nvaccinated from the unvaccinated during a respiratory pandemic. Here, we show\nthat the newly introduced vaccinology parameter $\\psi$ is incorrectly defined\nand that the conclusions of disproportionate risk are not valid. Specifically,\nwe prove that the originating authors Fisman et al. (2022, 2024) incorrectly\ndefined and applied the parameter $\\psi$. Their application would imply that\nthe said risk increases with increasing segregation from the unvaccinated (up\nto complete segregation), increases with increasing vaccination coverage (up to\ncomplete coverage) and increases with increasing vaccine efficacy (up to\nperfect vaccine efficacy), which is impossible. Use of the erroneous parameter\n$\\psi$ has the potential to encourage unnecessarily aggressive public health\npolicies and interventions.\n",
  "subjects": [
    "Physics/Physics and Society",
    "Quantitative Biology/Populations and Evolution"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "yaqEipXqJqlip3yFnUbPB_8DyR8ot0S4g8sKnZWqhlI",
  "pdfSize": "805600"
}