{
  "id": "2412.10787",
  "title": "Why Not Together? A Multiple-Round Recommender System for Queries and\n  Items",
  "authors": "Jiarui Jin, Xianyu Chen, Weinan Zhang, Yong Yu, Jun Wang",
  "authorsParsed": [
    [
      "Jin",
      "Jiarui",
      ""
    ],
    [
      "Chen",
      "Xianyu",
      ""
    ],
    [
      "Zhang",
      "Weinan",
      ""
    ],
    [
      "Yu",
      "Yong",
      ""
    ],
    [
      "Wang",
      "Jun",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 14 Dec 2024 10:49:00 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734173340000,
  "abstract": "  A fundamental technique of recommender systems involves modeling user\npreferences, where queries and items are widely used as symbolic\nrepresentations of user interests. Queries delineate user needs at an abstract\nlevel, providing a high-level description, whereas items operate on a more\nspecific and concrete level, representing the granular facets of user\npreference. While practical, both query and item recommendations encounter the\nchallenge of sparse user feedback. To this end, we propose a novel approach\nnamed Multiple-round Auto Guess-and-Update System (MAGUS) that capitalizes on\nthe synergies between both types, allowing us to leverage both query and item\ninformation to form user interests. This integrated system introduces a\nrecursive framework that could be applied to any recommendation method to\nexploit queries and items in historical interactions and to provide\nrecommendations for both queries and items in each interaction round. Empirical\nresults from testing 12 different recommendation methods demonstrate that\nintegrating queries into item recommendations via MAGUS significantly enhances\nthe efficiency, with which users can identify their preferred items during\nmultiple-round interactions.\n",
  "subjects": [
    "Computer Science/Information Retrieval"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "Bvqorq2A3q6Kb1jpR3AiID84RcI62VRq0JjRiLb5a1U",
  "pdfSize": "1322122"
}