{"id":"2412.01444","title":"Quantization of Visible Light by a Ni$_2$ Molecular Optical Resonator","authors":"Miao Meng, Ying Ning Tan, Yu Li Zhou, Zi Cong He, Zi Hao Zhong, Jia\n  Zhou, Guang Yuan Zhu, Chun Y. Liu","authorsParsed":[["Meng","Miao",""],["Tan","Ying Ning",""],["Zhou","Yu Li",""],["He","Zi Cong",""],["Zhong","Zi Hao",""],["Zhou","Jia",""],["Zhu","Guang Yuan",""],["Liu","Chun Y.",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 12:34:15 GMT"},{"version":"v2","created":"Mon, 20 Jan 2025 04:18:18 GMT"}],"updateDate":"2025-01-22","timestamp":1733142855000,"abstract":"  The quantization of an optical field is a frontier in quantum optics with\nimplications for both fundamental science and technological applications. Here,\nwe demonstrate that a dinickel complex (Ni$_2$) traps and quantizes classical\nvisible light, behaving as an individual quantum system or the Jaynes Cummings\nmolecule.The composite system forms through coherently coupling the two level\nNiNi charge transfer transition with the local scattering field, which produces\nnonclassical light featuring photon anti bunching and squeezed states, as\nverified by a sequence of discrete photonic modes in the incoherent resonance\nfluorescence. Notably, in this Ni$_2$ system, the collective coupling of N\nmolecule ensembles scales as N, distinct from the Tavis-Cummings model, which\nallows easy achievement of ultrastrong coupling. This is exemplified by a\nvacuum Rabi splitting of 1.2 eV at the resonance (3.25 eV) and a normalized\ncoupling rate of 0.18 for the N = 4 ensemble. The resulting quantum light of\nsingle photonic modes enables driving the molecule field interaction in cavity\nfree solution, which profoundly modifies the electronic states. Our results\nestablish Ni$_2$ as a robust platform for quantum optical phenomena under\nambient conditions, offering new pathways for molecular physics, polaritonic\nchemistry and quantum information processing.\n","subjects":["Physics/Quantum Physics","Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"sQEZX0Zt8p0hRtTAr1GIZCugP2n-pdELIjEXEmnKvW8","pdfSize":"1170837"}