{
  "id": "2412.14430",
  "title": "Balanced Gradient Sample Retrieval for Enhanced Knowledge Retention in\n  Proxy-based Continual Learning",
  "authors": "Hongye Xu, Jan Wasilewski, Bartosz Krawczyk",
  "authorsParsed": [
    [
      "Xu",
      "Hongye",
      ""
    ],
    [
      "Wasilewski",
      "Jan",
      ""
    ],
    [
      "Krawczyk",
      "Bartosz",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 01:08:09 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734570489000,
  "abstract": "  Continual learning in deep neural networks often suffers from catastrophic\nforgetting, where representations for previous tasks are overwritten during\nsubsequent training. We propose a novel sample retrieval strategy from the\nmemory buffer that leverages both gradient-conflicting and gradient-aligned\nsamples to effectively retain knowledge about past tasks within a supervised\ncontrastive learning framework. Gradient-conflicting samples are selected for\ntheir potential to reduce interference by re-aligning gradients, thereby\npreserving past task knowledge. Meanwhile, gradient-aligned samples are\nincorporated to reinforce stable, shared representations across tasks. By\nbalancing gradient correction from conflicting samples with alignment\nreinforcement from aligned ones, our approach increases the diversity among\nretrieved instances and achieves superior alignment in parameter space,\nsignificantly enhancing knowledge retention and mitigating proxy drift.\nEmpirical results demonstrate that using both sample types outperforms methods\nrelying solely on one sample type or random retrieval. Experiments on popular\ncontinual learning benchmarks in computer vision validate our method's\nstate-of-the-art performance in mitigating forgetting while maintaining\ncompetitive accuracy on new tasks.\n",
  "subjects": [
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "0O9erdx1afcL9S03uIUcirRcf2Ly7h8G0aYuSyLeH5M",
  "pdfSize": "13917723"
}