{
  "id": "2412.03707",
  "title": "Stellar-gas kinematic misalignments in EAGLE: lifetimes and longevity of\n  misaligned galaxies",
  "authors": "Maximilian K. Baker, Timothy A. Davis, Freeke van de Voort, Ilaria\n  Ruffa",
  "authorsParsed": [
    [
      "Baker",
      "Maximilian K.",
      ""
    ],
    [
      "Davis",
      "Timothy A.",
      ""
    ],
    [
      "van de Voort",
      "Freeke",
      ""
    ],
    [
      "Ruffa",
      "Ilaria",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 20:44:20 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733345060000,
  "abstract": "  The dominant processes by which galaxies replenish their cold gas reservoirs\nremain disputed, especially in massive galaxies. Stellar-gas kinematic\nmisalignments offer an opportunity to study these replenishment processes.\nHowever, observed distributions of these misalignments conflict with current\nmodels of gas replenishment in early-type galaxies (ETGs), with longer\nrelaxation timescales suggested as a possible solution. We use the EAGLE\nsimulation to explore the relaxation of unstable misaligned gas in galaxies\nwith masses of $M_{*}\\geqslant \\mathrm{10^{9.5}}$ M$_\\odot$ between $0<z<1$. We\nextract misalignments from formation to relaxation providing a sample of\n$\\sim3200$ relaxations. We find relaxation timescales tend to be\nshort-duration, with median lifetimes of $\\sim0.5$ Gyr, though with a notable\npopulation of unstable misalignments lasting $\\gtrsim1$ Gyr. Relaxation time\ndistributions show a log-linear relationship, with $\\approx20\\%$ of unstable\nmisalignments persisting for $\\gtrsim3$ torquing times. Long-lived unstable\nmisalignments are predominantly found in galaxies with higher stellar masses,\nlower star-forming gas fractions, higher ongoing gas inflow, and which reside\nin the centres of dense environments. Mergers only cause $\\sim17\\%$ of unstable\nmisalignments in EAGLE. We conclude that, at least in EAGLE, unstable kinematic\nmisalignments are not predominantly driven by gas-rich minor mergers.\nAdditionally, processes that significantly extend relaxation times are not\ndominant in the galaxy population. Instead, we see a diverse formation pathway\nfor misalignments such as through hot halo cooling.\n",
  "subjects": [
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "W4IqVlFfDpPdHa1cFTtMVX9cow8z2b9RfnOT0v-obo0",
  "pdfSize": "2278485"
}