{"id":"2412.19727","title":"Learning to Forget: Bayesian Time Series Forecasting using Recurrent\n  Sparse Spectrum Signature Gaussian Processes","authors":"Csaba T\\'oth, Masaki Adachi, Michael A. Osborne, Harald Oberhauser","authorsParsed":[["Tóth","Csaba",""],["Adachi","Masaki",""],["Osborne","Michael A.",""],["Oberhauser","Harald",""]],"versions":[{"version":"v1","created":"Fri, 27 Dec 2024 16:31:09 GMT"}],"updateDate":"2024-12-30","timestamp":1735317069000,"abstract":"  The signature kernel is a kernel between time series of arbitrary length and\ncomes with strong theoretical guarantees from stochastic analysis. It has found\napplications in machine learning such as covariance functions for Gaussian\nprocesses. A strength of the underlying signature features is that they provide\na structured global description of a time series. However, this property can\nquickly become a curse when local information is essential and forgetting is\nrequired; so far this has only been addressed with ad-hoc methods such as\nslicing the time series into subsegments. To overcome this, we propose a\nprincipled, data-driven approach by introducing a novel forgetting mechanism\nfor signatures. This allows the model to dynamically adapt its context length\nto focus on more recent information. To achieve this, we revisit the recently\nintroduced Random Fourier Signature Features, and develop Random Fourier\nDecayed Signature Features (RFDSF) with Gaussian processes (GPs). This results\nin a Bayesian time series forecasting algorithm with variational inference,\nthat offers a scalable probabilistic algorithm that processes and transforms a\ntime series into a joint predictive distribution over time steps in one pass\nusing recurrence. For example, processing a sequence of length $10^4$ steps in\n$\\approx 10^{-2}$ seconds and in $< 1\\text{GB}$ of GPU memory. We demonstrate\nthat it outperforms other GP-based alternatives and competes with\nstate-of-the-art probabilistic time series forecasting algorithms.\n","subjects":["Statistics/Machine Learning","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"JySHPt2fzgC5AjeCuCQT0lkV4Y5cMeJKj_-NjSdbawk","pdfSize":"1806531"}