{
  "id": "2412.03653",
  "title": "Weakness of X-rays and Variability in High-redshift AGNs with\n  Super-Eddington Accretion",
  "authors": "Kohei Inayoshi, Shigeo Kimura, Hirofumi Noda",
  "authorsParsed": [
    [
      "Inayoshi",
      "Kohei",
      ""
    ],
    [
      "Kimura",
      "Shigeo",
      ""
    ],
    [
      "Noda",
      "Hirofumi",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 19:00:01 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733338801000,
  "abstract": "  The James Webb Space Telescope (JWST) observations enable the exploration of\nactive galactic nuclei (AGNs) with broad-line emission in the early universe.\nDespite their clear radiative and morphological signatures of AGNs in\nrest-frame optical bands, complementary evidence of AGN activity -- such as\nX-ray emission and UV/optical variability -- remains rarely detected. The\nweakness of X-rays and variability in these broad-line emitters challenges the\nconventional AGN paradigm, indicating that the accretion processes or\nenvironments around the central black holes (BHs) differ from those of\nlow-redshift counterparts. In this work, we study the radiation spectra of\nsuper-Eddington accretion disks enveloped by high-density coronae.\nRadiation-driven outflows from the disk transport mass to the poles, resulting\nin moderately optically-thick, warm coronae formed through effective inverse\nComptonization. This mechanism leads to softer X-ray spectra and larger\nbolometric correction factors for X-rays compared to typical AGNs, while being\nconsistent with those of JWST AGNs and low-redshift super-Eddington accreting\nAGNs. In this scenario, UV/optical variability is suppressed due to photon\ntrapping within super-Eddington disks, while X-ray emissions remain weak yet\nexhibit significant relative variability. These characteristics are\nparticularly evident in high-redshift AGNs powered by lower-mass BHs with\n$\\lesssim 10^{7-8}~M_\\odot$, which undergo rapid mass accretion following\novermassive evolutionary tracks relative to the BH-to-stellar mass correlation\nin the local universe.\n",
  "subjects": [
    "Astrophysics/High Energy Astrophysical Phenomena",
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "SqkwTIjPqOeCbHu3ZbgrEx0B1s6IwZW-y9ERhJEZ70o",
  "pdfSize": "3426086"
}