{"id":"2412.14732","title":"Beyond the Hype: A Comprehensive Review of Current Trends in Generative\n  AI Research, Teaching Practices, and Tools","authors":"James Prather, Juho Leinonen, Natalie Kiesler, Jamie Gorson Benario,\n  Sam Lau, Stephen MacNeil, Narges Norouzi, Simone Opel, Vee Pettit, Leo\n  Porter, Brent N. Reeves, Jaromir Savelka, David H. Smith IV, Sven Strickroth,\n  Daniel Zingaro","authorsParsed":[["Prather","James",""],["Leinonen","Juho",""],["Kiesler","Natalie",""],["Benario","Jamie Gorson",""],["Lau","Sam",""],["MacNeil","Stephen",""],["Norouzi","Narges",""],["Opel","Simone",""],["Pettit","Vee",""],["Porter","Leo",""],["Reeves","Brent N.",""],["Savelka","Jaromir",""],["Smith","David H.","IV"],["Strickroth","Sven",""],["Zingaro","Daniel",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 11:01:11 GMT"}],"updateDate":"2024-12-20","timestamp":1734606071000,"abstract":"  Generative AI (GenAI) is advancing rapidly, and the literature in computing\neducation is expanding almost as quickly. Initial responses to GenAI tools were\nmixed between panic and utopian optimism. Many were fast to point out the\nopportunities and challenges of GenAI. Researchers reported that these new\ntools are capable of solving most introductory programming tasks and are\ncausing disruptions throughout the curriculum. These tools can write and\nexplain code, enhance error messages, create resources for instructors, and\neven provide feedback and help for students like a traditional teaching\nassistant. In 2024, new research started to emerge on the effects of GenAI\nusage in the computing classroom. These new data involve the use of GenAI to\nsupport classroom instruction at scale and to teach students how to code with\nGenAI. In support of the former, a new class of tools is emerging that can\nprovide personalized feedback to students on their programming assignments or\nteach both programming and prompting skills at the same time. With the\nliterature expanding so rapidly, this report aims to summarize and explain what\nis happening on the ground in computing classrooms. We provide a systematic\nliterature review; a survey of educators and industry professionals; and\ninterviews with educators using GenAI in their courses, educators studying\nGenAI, and researchers who create GenAI tools to support computing education.\nThe triangulation of these methods and data sources expands the understanding\nof GenAI usage and perceptions at this critical moment for our community.\n","subjects":["Computer Science/Computers and Society","Computer Science/Artificial Intelligence","Computer Science/Human-Computer Interaction","Computer Science/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"41axA3kAjd9r8LV_8wTpvX98bObJpT70ttV7TiKDyJI","pdfSize":"3108997"}