{
  "id": "2412.14854",
  "title": "Surrogate-assisted multi-objective design of complex multibody systems",
  "authors": "Augustina C. Amakor, Manuel B. Berkemeier, Meike Wohlleben, Walter\n  Sextro, Sebastian Peitz",
  "authorsParsed": [
    [
      "Amakor",
      "Augustina C.",
      ""
    ],
    [
      "Berkemeier",
      "Manuel B.",
      ""
    ],
    [
      "Wohlleben",
      "Meike",
      ""
    ],
    [
      "Sextro",
      "Walter",
      ""
    ],
    [
      "Peitz",
      "Sebastian",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 13:48:49 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734616129000,
  "abstract": "  The optimization of large-scale multibody systems is a numerically\nchallenging task, in particular when considering multiple conflicting criteria\nat the same time. In this situation, we need to approximate the Pareto set of\noptimal compromises, which is significantly more expensive than finding a\nsingle optimum in single-objective optimization. To prevent large costs, the\nusage of surrogate models, constructed from a small but informative number of\nexpensive model evaluations, is a very popular and widely studied approach. The\ncentral challenge then is to ensure a high quality (that is, near-optimality)\nof the solutions that were obtained using the surrogate model, which can be\nhard to guarantee with a single pre-computed surrogate. We present a\nback-and-forth approach between surrogate modeling and multi-objective\noptimization to improve the quality of the obtained solutions. Using the\nexample of an expensive-to-evaluate multibody system, we compare different\nstrategies regarding multi-objective optimization, sampling and also surrogate\nmodeling, to identify the most promising approach in terms of computational\nefficiency and solution quality.\n",
  "subjects": [
    "Mathematics/Optimization and Control",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "ghXNWtKGwkFvZavbCJ47q6egm0MyAkpO2nPP-z2LMag",
  "pdfSize": "1397732"
}