{
  "id": "2412.18996",
  "title": "WaveDiffUR: A diffusion SDE-based solver for ultra magnification\n  super-resolution in remote sensing images",
  "authors": "Yue Shi, Liangxiu Han, Darren Dancy, Lianghao Han",
  "authorsParsed": [
    [
      "Shi",
      "Yue",
      ""
    ],
    [
      "Han",
      "Liangxiu",
      ""
    ],
    [
      "Dancy",
      "Darren",
      ""
    ],
    [
      "Han",
      "Lianghao",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 25 Dec 2024 22:26:39 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735165599000,
  "abstract": "  Deep neural networks have recently achieved significant advancements in\nremote sensing superresolu-tion (SR). However, most existing methods are\nlimited to low magnification rates (e.g., 2 or 4) due to the escalating\nill-posedness at higher magnification scales. To tackle this challenge, we\nredefine high-magnification SR as the ultra-resolution (UR) problem, reframing\nit as solving a conditional diffusion stochastic differential equation (SDE).\nIn this context, we propose WaveDiffUR, a novel wavelet-domain diffusion UR\nsolver that decomposes the UR process into sequential sub-processes addressing\nconditional wavelet components. WaveDiffUR iteratively reconstructs\nlow-frequency wavelet details (ensuring global consistency) and high-frequency\ncomponents (enhancing local fidelity) by incorporating pre-trained SR models as\nplug-and-play modules. This modularity mitigates the ill-posedness of the SDE\nand ensures scalability across diverse applications. To address limitations in\nfixed boundary conditions at extreme magnifications, we introduce the\ncross-scale pyramid (CSP) constraint, a dynamic and adaptive framework that\nguides WaveDiffUR in generating fine-grained wavelet details, ensuring\nconsistent and high-fidelity outputs even at extreme magnification rates.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Image and Video Processing",
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/publicdomain/zero/1.0/",
  "blobId": "xxJKBj7oLh-Bx-jfVH_icCe_KnxsdzHChhAg2pGgRQ4",
  "pdfSize": "6310864"
}