{
  "id": "2412.18018",
  "title": "Correlation hypergraph: a new representation of a quantum marginal\n  independence pattern",
  "authors": "Veronika E. Hubeny, Massimiliano Rota",
  "authorsParsed": [
    [
      "Hubeny",
      "Veronika E.",
      ""
    ],
    [
      "Rota",
      "Massimiliano",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 22:29:14 GMT"
    },
    {
      "version": "v2",
      "created": "Mon, 10 Feb 2025 13:40:04 GMT"
    }
  ],
  "updateDate": "2025-02-11",
  "timestamp": 1734992954000,
  "abstract": "  We continue the study of the quantum marginal independence problem, namely\nthe question of which faces of the subadditivity cone are achievable by quantum\nstates. We introduce a new representation of the patterns of marginal\nindependence (PMIs, corresponding to faces of the subadditivity cone) based on\ncertain correlation hypergraphs, and demonstrate that this representation\nprovides a more efficient description of a PMI, and consequently of the set of\nPMIs which are compatible with strong subadditivity. We then show that these\ncorrelation hypergraphs generalize to arbitrary quantum systems the well known\nrelation between positivity of mutual information and connectivity of\nentanglement wedges in holography, and further use this representation to\nderive new results about the combinatorial structure of collections of\nsimultaneously decorrelated subsystems specifying SSA-compatible PMIs. In the\ncontext of holography, we apply these techniques to derive a necessary\ncondition for the realizability of entropy vectors by simple tree graph models,\nwhich were conjectured in arXiv:2204.00075 to provide the building blocks of\nthe holographic entropy cone. Since this necessary condition is formulated in\nterms of chordality of a certain graph, it can be tested efficiently.\n",
  "subjects": [
    "Physics/High Energy Physics - Theory",
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "FNGs50MbA7UTU9u_L39LPC87crRNwxpS2mZGW-of3UE",
  "pdfSize": "492728"
}