{
  "id": "2412.19000",
  "title": "MGAN-CRCM: A Novel Multiple Generative Adversarial Network and\n  Coarse-Refinement Based Cognizant Method for Image Inpainting",
  "authors": "Nafiz Al Asad, Md. Appel Mahmud Pranto, Shbiruzzaman Shiam, Musaddeq\n  Mahmud Akand, Mohammad Abu Yousuf, Khondokar Fida Hasan, and Mohammad Ali\n  Moni",
  "authorsParsed": [
    [
      "Asad",
      "Nafiz Al",
      ""
    ],
    [
      "Pranto",
      "Md. Appel Mahmud",
      ""
    ],
    [
      "Shiam",
      "Shbiruzzaman",
      ""
    ],
    [
      "Akand",
      "Musaddeq Mahmud",
      ""
    ],
    [
      "Yousuf",
      "Mohammad Abu",
      ""
    ],
    [
      "Hasan",
      "Khondokar Fida",
      ""
    ],
    [
      "Moni",
      "Mohammad Ali",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 25 Dec 2024 22:54:28 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735167268000,
  "abstract": "  Image inpainting is a widely used technique in computer vision for\nreconstructing missing or damaged pixels in images. Recent advancements with\nGenerative Adversarial Networks (GANs) have demonstrated superior performance\nover traditional methods due to their deep learning capabilities and\nadaptability across diverse image domains. Residual Networks (ResNet) have also\ngained prominence for their ability to enhance feature representation and\ncompatibility with other architectures. This paper introduces a novel\narchitecture combining GAN and ResNet models to improve image inpainting\noutcomes. Our framework integrates three components: Transpose\nConvolution-based GAN for guided and blind inpainting, Fast\nResNet-Convolutional Neural Network (FR-CNN) for object removal, and\nCo-Modulation GAN (Co-Mod GAN) for refinement. The model's performance was\nevaluated on benchmark datasets, achieving accuracies of 96.59% on Image-Net,\n96.70% on Places2, and 96.16% on CelebA. Comparative analyses demonstrate that\nthe proposed architecture outperforms existing methods, highlighting its\neffectiveness in both qualitative and quantitative evaluations.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Machine Learning",
    "Electrical Engineering and Systems Science/Image and Video Processing"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "TO5kTNlSFLxqgbVjHZA0DLpj8pN82grbh8AJzRsggeA",
  "pdfSize": "3062124"
}