{"id":"2412.06155","title":"Why do some Ultra Diffuse Galaxies have Rich Globular Cluster Systems?","authors":"Duncan A. Forbes, Maria Luisa Buzzo, Anna Ferre-Mateu, Aaron J.\n  Romanowsky, Jonah Gannon, Jean P. Brodie, and Michelle Collins","authorsParsed":[["Forbes","Duncan A.",""],["Buzzo","Maria Luisa",""],["Ferre-Mateu","Anna",""],["Romanowsky","Aaron J.",""],["Gannon","Jonah",""],["Brodie","Jean P.",""],["Collins","Michelle",""]],"versions":[{"version":"v1","created":"Mon, 9 Dec 2024 02:34:37 GMT"}],"updateDate":"2024-12-10","timestamp":1733711677000,"abstract":"  Some ultra diffuse galaxies (UDGs) reveal many more globular clusters (GCs)\nthan classical dwarf galaxies of the same stellar mass. These UDGs, with a mass\nin their GC system (M$_{GC}$) approaching 10\\% of their host galaxy stellar\nmass (M$_{\\ast}$), are also inferred to have high halo mass to stellar mass\nratios (M$_{halo}$/M$_{\\ast}$). They have been dubbed Failed Galaxies. It is\nunknown what role high GC formation efficiencies and/or low destruction rates\nplay in determining the high M$_{GC}$/M$_{\\ast}$ ratios of some UDGs. Here we\npresent a simple model, which is informed by recent JWST observations of lensed\ngalaxies and by a simulation in the literature of GC mass loss and tidal\ndisruption in dwarf galaxies. With this simple model, we aim to constrain the\neffects of GC efficiency/destruction on the observed GC richness of UDGs and\ntheir variation with the integrated stellar populations of UDGs. We assume no\nongoing star formation (i.e. quenching at early times) and that the disrupted\nGCs contribute their stars to those of the host galaxy. We find that UDGs, with\nhigh M$_{GC}$/M$_{\\ast}$ ratios today, are most likely the result of very high\nGC formation efficiencies combined with modest rates of GC destruction. The\ncurrent data loosely follow the model that ranges from the mean stellar\npopulation of classical dwarfs to that of metal-poor GCs as M$_{GC}$/M$_{\\ast}$\nincreases. As more data becomes available for UDGs, our simple model can be\nrefined and tested further.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"lrdGpErneqs-RA2sX8pEZYmWBIJdHZ0Lo3aMw_45gBY","pdfSize":"468747"}