{
  "id": "2412.07541",
  "title": "A data-driven learned discretization approach in finite volume schemes\n  for hyperbolic conservation laws and varying boundary conditions",
  "authors": "Guillaume de Rom\\'emont, Florent Renac, Jorge Nunez, Francisco\n  Chinesta",
  "authorsParsed": [
    [
      "de Romémont",
      "Guillaume",
      ""
    ],
    [
      "Renac",
      "Florent",
      ""
    ],
    [
      "Nunez",
      "Jorge",
      ""
    ],
    [
      "Chinesta",
      "Francisco",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 14:18:30 GMT"
    }
  ],
  "updateDate": "2025-02-25",
  "timestamp": 1733840310000,
  "abstract": "  This paper presents a data-driven finite volume method for solving 1D and 2D\nhyperbolic partial differential equations. This work builds upon the prior\nresearch incorporating a data-driven finite-difference approximation of smooth\nsolutions of scalar conservation laws, where optimal coefficients of neural\nnetworks approximating space derivatives are learned based on accurate, but\ncumbersome solutions to these equations. We extend this approach to\nflux-limited finite volume schemes for hyperbolic scalar and systems of\nconservation laws. We also train the discretization to efficiently capture\ndiscontinuous solutions with shock and contact waves, as well as to the\napplication of boundary conditions. The learning procedure of the data-driven\nmodel is extended through the definition of a new loss, paddings and adequate\ndatabase. These new ingredients guarantee computational stability, preserve the\naccuracy of fine-grid solutions, and enhance overall performance. Numerical\nexperiments using test cases from the literature in both one- and\ntwo-dimensional spaces demonstrate that the learned model accurately reproduces\nfine-grid results on very coarse meshes.\n",
  "subjects": [
    "Mathematics/Numerical Analysis",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Numerical Analysis"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "yo7_3WtUCrUr22ysRM-ueTAe0wD_RiMvAExHC6Zcv6o",
  "pdfSize": "10104371"
}