{
  "id": "2412.01611",
  "title": "Characterizing Jupiter's interior using machine learning reveals four\n  key structures",
  "authors": "Maayan Ziv, Eli Galanti, Saburo Howard, Tristan Guillot, Yohai Kaspi",
  "authorsParsed": [
    [
      "Ziv",
      "Maayan",
      ""
    ],
    [
      "Galanti",
      "Eli",
      ""
    ],
    [
      "Howard",
      "Saburo",
      ""
    ],
    [
      "Guillot",
      "Tristan",
      ""
    ],
    [
      "Kaspi",
      "Yohai",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 15:31:09 GMT"
    },
    {
      "version": "v2",
      "created": "Sun, 8 Dec 2024 11:22:29 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733153469000,
  "abstract": "  The internal structure of Jupiter is constrained by the precise gravity field\nmeasurements by NASA's Juno mission, atmospheric data from the Galileo entry\nprobe, and Voyager radio occultations. Not only are these observations few\ncompared to the possible interior setups and their multiple controlling\nparameters, but they remain challenging to reconcile. As a complex,\nmultidimensional problem, characterizing typical structures can help simplify\nthe modeling process. We used NeuralCMS, a deep learning model based on the\naccurate concentric Maclaurin spheroid (CMS) method, coupled with a fully\nconsistent wind model to efficiently explore a wide range of interior models\nwithout prior assumptions. We then identified those consistent with the\nmeasurements and clustered the plausible combinations of parameters controlling\nthe interior. We determine the plausible ranges of internal structures and the\ndynamical contributions to Jupiter's gravity field. Four typical interior\nstructures are identified, characterized by their envelope and core properties.\nThis reduces the dimensionality of Jupiter's interior to only two effective\nparameters. Within the reduced 2D phase space, we show that the most\nobservationally constrained structures fall within one of the key structures,\nbut they require a higher 1 bar temperature than the observed value. We provide\na robust framework for characterizing giant planet interiors with consistent\nwind treatment, demonstrating that for Jupiter, wind constraints strongly\nimpact the gravity harmonics while the interior parameter distribution remains\nlargely unchanged. Importantly, we find that Jupiter's interior can be\ndescribed by two effective parameters that clearly distinguish the four\ncharacteristic structures and conclude that atmospheric measurements may not\nfully represent the entire envelope.\n",
  "subjects": [
    "Astrophysics/Earth and Planetary Astrophysics",
    "Astrophysics/Instrumentation and Methods for Astrophysics",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "cspZtH7RKoz_yjUhHAzoHouAO_OKC9J_1_o-SwV8Kq8",
  "pdfSize": "4653822"
}