{
  "id": "2412.10127",
  "title": "Interface instability of two-phase flow in a three-dimensional porous\n  medium",
  "authors": "Joachim Falck Brodin, Kevin Pierce, Paula Reis, Per Arne Rikvold,\n  Marcel Moura, Mihailo Jankov, Knut J{\\o}rgen M{\\aa}l{\\o}y",
  "authorsParsed": [
    [
      "Brodin",
      "Joachim Falck",
      ""
    ],
    [
      "Pierce",
      "Kevin",
      ""
    ],
    [
      "Reis",
      "Paula",
      ""
    ],
    [
      "Rikvold",
      "Per Arne",
      ""
    ],
    [
      "Moura",
      "Marcel",
      ""
    ],
    [
      "Jankov",
      "Mihailo",
      ""
    ],
    [
      "Måløy",
      "Knut Jørgen",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 13:15:57 GMT"
    }
  ],
  "updateDate": "2024-12-16",
  "timestamp": 1734095757000,
  "abstract": "  We present an experimental study of immiscible, two-phase fluid flow through\na three-dimensional porous medium consisting of randomly-packed, monodisperse\nglass spheres. Our experiments combine refractive-index matching and\nlaser-induced fluorescence imaging to resolve the morphology and stability of\nthe moving interface resulting from the injection of one fluid into another.\nThe imposed injection rate sets a balance between gravitational and viscous\nforces, producing interface morphologies which range from unstable collections\nof tangled fingers at low rates to stable sheets at high rates. The image data\nare complemented by time-resolved pressure measurements. We develop a stability\ncriterion for the fluid interface based on the analysis of the 3D images and\nthe pressure data. This criterion involves the Darcy permeability in each of\nthe two phases and the time derivative of the pressure drop across the medium.\nWe observe that the relative permeability encountered by the invading fluid is\nmodified by the imposed flow rate in our experiment, which impacts the\ntwo-phase flow dynamics. We show that, in addition to the balance between the\nrelevant forces driving the dynamics, local regions of crystalline order in the\nbeadpack (crystallites) affect the stability of the invading front. This work\nprovides insights into how disorder on multiple length scales in porous media\ncan interact with viscous, capillary, and gravitational forces to determine the\nstability and dynamics of immiscible fluid interfaces.\n",
  "subjects": [
    "Physics/Fluid Dynamics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "d3Er3bMuYqecqs553estPWdthL8djiwSEKq0K1vCmEY",
  "pdfSize": "15740564"
}