{"id":"2412.03558","title":"MIDI: Multi-Instance Diffusion for Single Image to 3D Scene Generation","authors":"Zehuan Huang, Yuan-Chen Guo, Xingqiao An, Yunhan Yang, Yangguang Li,\n  Zi-Xin Zou, Ding Liang, Xihui Liu, Yan-Pei Cao, Lu Sheng","authorsParsed":[["Huang","Zehuan",""],["Guo","Yuan-Chen",""],["An","Xingqiao",""],["Yang","Yunhan",""],["Li","Yangguang",""],["Zou","Zi-Xin",""],["Liang","Ding",""],["Liu","Xihui",""],["Cao","Yan-Pei",""],["Sheng","Lu",""]],"versions":[{"version":"v1","created":"Wed, 4 Dec 2024 18:52:40 GMT"}],"updateDate":"2024-12-05","timestamp":1733338360000,"abstract":"  This paper introduces MIDI, a novel paradigm for compositional 3D scene\ngeneration from a single image. Unlike existing methods that rely on\nreconstruction or retrieval techniques or recent approaches that employ\nmulti-stage object-by-object generation, MIDI extends pre-trained image-to-3D\nobject generation models to multi-instance diffusion models, enabling the\nsimultaneous generation of multiple 3D instances with accurate spatial\nrelationships and high generalizability. At its core, MIDI incorporates a novel\nmulti-instance attention mechanism, that effectively captures inter-object\ninteractions and spatial coherence directly within the generation process,\nwithout the need for complex multi-step processes. The method utilizes partial\nobject images and global scene context as inputs, directly modeling object\ncompletion during 3D generation. During training, we effectively supervise the\ninteractions between 3D instances using a limited amount of scene-level data,\nwhile incorporating single-object data for regularization, thereby maintaining\nthe pre-trained generalization ability. MIDI demonstrates state-of-the-art\nperformance in image-to-scene generation, validated through evaluations on\nsynthetic data, real-world scene data, and stylized scene images generated by\ntext-to-image diffusion models.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"cTDaiBiKukAy7ZDj3b7zPYwR6_NZPMzxRLFVqSn5b70","pdfSize":"10924945"}