{
  "id": "2412.14675",
  "title": "LLMs as mediators: Can they diagnose conflicts accurately?",
  "authors": "\\\"Ozgecan Ko\\c{c}ak (Emory University), Phanish Puranam (INSEAD),\n  Af\\c{s}ar Yegin (Kadir Has University)",
  "authorsParsed": [
    [
      "Koçak",
      "Özgecan",
      "",
      "Emory University"
    ],
    [
      "Puranam",
      "Phanish",
      "",
      "INSEAD"
    ],
    [
      "Yegin",
      "Afşar",
      "",
      "Kadir Has University"
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 09:29:08 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734600548000,
  "abstract": "  Prior research indicates that to be able to mediate conflict, observers of\ndisagreements between parties must be able to reliably distinguish the sources\nof their disagreement as stemming from differences in beliefs about what is\ntrue (causality) vs. differences in what they value (morality). In this paper,\nwe test if OpenAI's Large Language Models GPT 3.5 and GPT 4 can perform this\ntask and whether one or other type of disagreement proves particularly\nchallenging for LLM's to diagnose. We replicate study 1 in Ko\\c{c}ak et al.\n(2003), which employes a vignette design, with OpenAI's GPT 3.5 and GPT 4. We\nfind that both LLMs have similar semantic understanding of the distinction\nbetween causal and moral codes as humans and can reliably distinguish between\nthem. When asked to diagnose the source of disagreement in a conversation, both\nLLMs, compared to humans, exhibit a tendency to overestimate the extent of\ncausal disagreement and underestimate the extent of moral disagreement in the\nmoral misalignment condition. This tendency is especially pronounced for GPT 4\nwhen using a proximate scale that relies on concrete language specific to an\nissue. GPT 3.5 does not perform as well as GPT4 or humans when using either the\nproximate or the distal scale. The study provides a first test of the potential\nfor using LLMs to mediate conflict by diagnosing the root of disagreements in\ncausal and evaluative codes.\n",
  "subjects": [
    "Computer Science/Computation and Language"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "aHElovnee_xZ2f5jzSTqMISDPEdjylL5C5L6dLOi7hs",
  "pdfSize": "973324"
}