{
  "id": "2412.00886",
  "title": "Thermal Macroeconomics: An axiomatic theory of aggregate economic\n  phenomena",
  "authors": "N.J.Chater and R.S.MacKay",
  "authorsParsed": [
    [
      "Chater",
      "N. J.",
      ""
    ],
    [
      "MacKay",
      "R. S.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 1 Dec 2024 16:52:19 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733071939000,
  "abstract": "  An axiomatic approach to macroeconomics based on the mathematical structure\nof thermodynamics is presented. It deduces relations between aggregate\nproperties of an economy, concerning quantities and flows of goods and money,\nprices and the value of money, without any recourse to microeconomic\nfoundations about the preferences and actions of individual economic agents.\nThe approach has three important payoffs. 1) it provides a new and solid\nfoundation for aspects of standard macroeconomic theory such as the existence\nof market prices, the value of money, the meaning of inflation, the symmetry\nand negative-definiteness of the macro-Slutsky matrix, and the Le\nChatelier-Samuelson principle, without relying on implausibly strong\nrationality assumptions over individual microeconomic agents. 2) the approach\ngenerates new results, including implications for money flow and trade when two\nor more economies are put in contact, in terms of new concepts such as economic\nentropy, economic temperature, goods' values and money capacity. Some of these\nare related to standard economic concepts (eg marginal utility of money, market\nprices). Yet our approach derives them at a purely macroeconomic level and\ngives them a meaning independent of usual restrictions. Others of the concepts,\nsuch as economic entropy and temperature, have no direct counterparts in\nstandard economics, but they have important economic interpretations and\nimplications, as aggregate utility and the inverse marginal aggregate utility\nof money, respectively. 3) this analysis promises to open up new frontiers in\nmacroeconomics by building a bridge to ideas from non-equilibrium\nthermodynamics. More broadly, we hope that the economic analogue of entropy\n(governing the possible transitions between states of economic systems) may\nprove to be as fruitful for the social sciences as entropy has been in the\nnatural sciences.\n",
  "subjects": [
    "Economics/General Economics",
    "Physics/Physics and Society",
    "Quantitative Finance/Economics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "u2ZAtT1ZwpgsXlfoM7vHP5qZmEJoJTdp3SvNy50DrvM",
  "pdfSize": "1757931"
}