{"id":"2412.03573","title":"Improving Tool Retrieval by Leveraging Large Language Models for Query\n  Generation","authors":"Mohammad Kachuee, Sarthak Ahuja, Vaibhav Kumar, Puyang Xu, Xiaohu Liu","authorsParsed":[["Kachuee","Mohammad",""],["Ahuja","Sarthak",""],["Kumar","Vaibhav",""],["Xu","Puyang",""],["Liu","Xiaohu",""]],"versions":[{"version":"v1","created":"Sun, 17 Nov 2024 03:02:09 GMT"}],"updateDate":"2024-12-06","timestamp":1731812529000,"abstract":"  Using tools by Large Language Models (LLMs) is a promising avenue to extend\ntheir reach beyond language or conversational settings. The number of tools can\nscale to thousands as they enable accessing sensory information, fetching\nupdated factual knowledge, or taking actions in the real world. In such\nsettings, in-context learning by providing a short list of relevant tools in\nthe prompt is a viable approach. To retrieve relevant tools, various approaches\nhave been suggested, ranging from simple frequency-based matching to dense\nembedding-based semantic retrieval. However, such approaches lack the\ncontextual and common-sense understanding required to retrieve the right tools\nfor complex user requests. Rather than increasing the complexity of the\nretrieval component itself, we propose leveraging LLM understanding to generate\na retrieval query. Then, the generated query is embedded and used to find the\nmost relevant tools via a nearest-neighbor search. We investigate three\napproaches for query generation: zero-shot prompting, supervised fine-tuning on\ntool descriptions, and alignment learning by iteratively optimizing a reward\nmetric measuring retrieval performance. By conducting extensive experiments on\na dataset covering complex and multi-tool scenarios, we show that leveraging\nLLMs for query generation improves the retrieval for in-domain (seen tools) and\nout-of-domain (unseen tools) settings.\n","subjects":["Computer Science/Information Retrieval","Computer Science/Artificial Intelligence","Computer Science/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ngqK3S34pL1hMSbiuIPKfp2hS3bB-DjsFpFLptjZ-GA","pdfSize":"885918"}