{
  "id": "2412.04691",
  "title": "A simple model for longitudinal electron transport during and after\n  laser excitation: Emergence of electron resistive transport",
  "authors": "Robert Meadows, Y. Xue, Nicholas Allbritton and G. P. Zhang",
  "authorsParsed": [
    [
      "Meadows",
      "Robert",
      ""
    ],
    [
      "Xue",
      "Y.",
      ""
    ],
    [
      "Allbritton",
      "Nicholas",
      ""
    ],
    [
      "Zhang",
      "G. P.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 01:06:10 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733447170000,
  "abstract": "  Laser-driven electron transport across a sample has garnered enormous\nattentions over several decades, as it provides a much faster way to control\nelectron dynamics. Light is an electromagnetic wave, so how and why an electron\ncan acquire a longitudinal velocity remains unanswered. Here we show that it is\nthe magnetic field that steers the electron to the light propagation direction.\nBut, quantitatively, our free-electron model is still unable to reproduce the\nexperimental velocities. Going beyond the free electron mode and assuming the\nsystem absorbs all the photon energy, the theoretical velocity matches the\nexperimental observation. We introduce a concept of the resistive transport,\nwhere electrons deaccelerate under a constant resistance after laser\nexcitation. This theory finally explains why the experimental\ndistance-versus-time forms a down-concave curve, and unifies ballistic and\nsuperdiffusive transports into a single resistive transport. We expect that our\nfinding will motivate further investigations.\n",
  "subjects": [
    "Condensed Matter/Materials Science",
    "Physics/Computational Physics",
    "Physics/Optics",
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "36K2eay6fWcfw0zRDEZrYzX-50oIVW4ORuwBIloxvAQ",
  "pdfSize": "245025"
}