{"id":"2412.17622","title":"Be More Diverse than the Most Diverse: Online Selection of Diverse\n  Mixtures of Generative Models","authors":"Parham Rezaei, Farzan Farnia, Cheuk Ting Li","authorsParsed":[["Rezaei","Parham",""],["Farnia","Farzan",""],["Li","Cheuk Ting",""]],"versions":[{"version":"v1","created":"Mon, 23 Dec 2024 14:48:17 GMT"}],"updateDate":"2024-12-24","timestamp":1734965297000,"abstract":"  The availability of multiple training algorithms and architectures for\ngenerative models requires a selection mechanism to form a single model over a\ngroup of well-trained generation models. The selection task is commonly\naddressed by identifying the model that maximizes an evaluation score based on\nthe diversity and quality of the generated data. However, such a best-model\nidentification approach overlooks the possibility that a mixture of available\nmodels can outperform each individual model. In this work, we explore the\nselection of a mixture of multiple generative models and formulate a quadratic\noptimization problem to find an optimal mixture model achieving the maximum of\nkernel-based evaluation scores including kernel inception distance (KID) and\nR\\'{e}nyi kernel entropy (RKE). To identify the optimal mixture of the models\nusing the fewest possible sample queries, we propose an online learning\napproach called Mixture Upper Confidence Bound (Mixture-UCB). Specifically, our\nproposed online learning method can be extended to every convex quadratic\nfunction of the mixture weights, for which we prove a concentration bound to\nenable the application of the UCB approach. We prove a regret bound for the\nproposed Mixture-UCB algorithm and perform several numerical experiments to\nshow the success of the proposed Mixture-UCB method in finding the optimal\nmixture of text-based and image-based generative models. The codebase is\navailable at https://github.com/Rezaei-Parham/Mixture-UCB .\n","subjects":["Computer Science/Machine Learning","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"--LfwHw0m9OWzlM0-DrOBY6Q2aHKq9j0fuhATeVXM_w","pdfSize":"7680007"}