{
  "id": "2412.01944",
  "title": "Enhancing Crop Segmentation in Satellite Image Time Series with\n  Transformer Networks",
  "authors": "Ignazio Gallo, Mattia Gatti, Nicola Landro, Christian Loschiavo, Mirco\n  Boschetti, Riccardo La Grassa",
  "authorsParsed": [
    [
      "Gallo",
      "Ignazio",
      ""
    ],
    [
      "Gatti",
      "Mattia",
      ""
    ],
    [
      "Landro",
      "Nicola",
      ""
    ],
    [
      "Loschiavo",
      "Christian",
      ""
    ],
    [
      "Boschetti",
      "Mirco",
      ""
    ],
    [
      "La Grassa",
      "Riccardo",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 20:08:22 GMT"
    }
  ],
  "updateDate": "2024-12-04",
  "timestamp": 1733170102000,
  "abstract": "  Recent studies have shown that Convolutional Neural Networks (CNNs) achieve\nimpressive results in crop segmentation of Satellite Image Time Series (SITS).\nHowever, the emergence of transformer networks in various vision tasks raises\nthe question of whether they can outperform CNNs in this task as well. This\npaper presents a revised version of the Transformer-based Swin UNETR model,\nspecifically adapted for crop segmentation of SITS. The proposed model\ndemonstrates significant advancements, achieving a validation accuracy of\n96.14% and a test accuracy of 95.26% on the Munich dataset, surpassing the\nprevious best results of 93.55% for validation and 92.94% for the test.\nAdditionally, the model's performance on the Lombardia dataset is comparable to\nUNet3D and superior to FPN and DeepLabV3. Experiments of this study indicate\nthat the model will likely achieve comparable or superior accuracy to CNNs\nwhile requiring significantly less training time. These findings highlight the\npotential of transformer-based architectures for crop segmentation in SITS,\nopening new avenues for remote sensing applications.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Electrical Engineering and Systems Science/Image and Video Processing"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "XCcxnv8ftUfzudtQkqcVCy8DrBJXl2rOOg9uM328vjc",
  "pdfSize": "1564955"
}