{"id":"2412.18044","title":"Spectroscopic footprints of quantum friction in nonreciprocal and chiral\n  media","authors":"O. J. Franca, Fabian Spallek, Steffen Giesen, Robert Berger, Kilian\n  Singer, Stefan Aull and Stefan Yoshi Buhmann","authorsParsed":[["Franca","O. J.",""],["Spallek","Fabian",""],["Giesen","Steffen",""],["Berger","Robert",""],["Singer","Kilian",""],["Aull","Stefan",""],["Buhmann","Stefan Yoshi",""]],"versions":[{"version":"v1","created":"Mon, 23 Dec 2024 23:39:10 GMT"}],"updateDate":"2024-12-25","timestamp":1734997150000,"abstract":"  We investigate how the quantum friction experienced by a polarizable atom\nmoving with constant velocity parallel to a planar interface is modified when\nthe latter consists of chiral or nonreciprocal media, with special focus on\ntopological insulators. We use macroscopic quantum electrodynamics to obtain\nthe velocity-dependent Casimir-Polder frequency shift and decay rate. These\nresults are a generalization to matter with time-reversal symmetry breaking. We\nillustrate our findings by examining the nonretarded and retarded limits for\nfive examples: a perfectly conducting mirror, a perfectly reflecting\nnonreciprocal mirror, a three-dimensional topological insulator, a perfectly\nreflecting chiral mirror and an isotropic chiral medium. We find different\nasymptotic power laws for all these materials. Interestingly, we find two\nbridges between chirality and nonreciprocity through the frequency shift that\narise as a consequence of the magnetoelectric coupling. Namely, the\nposition-dependent Casimir-Polder frequency shift for the nonreciprocal case\ndepend on a geometric magnetic field associated with photoionization of chiral\nmolecules, the Casimir-Polder depending on the velocities for the chiral case\nhave the optical rotatory strength as the atomic response while those for the\nnonreciprocal case depend on an analog of the optical rotatory strength.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"jntrfcAB49_oD5h9q7VHmnd49bNrWHYjcPOmYJZEm7s","pdfSize":"651826"}