{
  "id": "2412.21130",
  "title": "Galaxy Spectra Networks (GaSNet). III. Generative pre-trained network\n  for spectrum reconstruction, redshift estimate and anomaly detection",
  "authors": "Fucheng Zhong, Nicola R. Napolitano, Caroline Heneka, Jens-Kristian\n  Krogager, Ricardo Demarco, Nicolas F. Bouch\\'e, Jonathan Loveday, Alexander\n  Fritz, Aur\\'elien Verdier, Boudewijn F. Roukema, Crist\\'obal Sif\\'on, Letizia\n  P. Cassar\\'a, Roberto J. Assef, Steve Ardern",
  "authorsParsed": [
    [
      "Zhong",
      "Fucheng",
      ""
    ],
    [
      "Napolitano",
      "Nicola R.",
      ""
    ],
    [
      "Heneka",
      "Caroline",
      ""
    ],
    [
      "Krogager",
      "Jens-Kristian",
      ""
    ],
    [
      "Demarco",
      "Ricardo",
      ""
    ],
    [
      "Bouché",
      "Nicolas F.",
      ""
    ],
    [
      "Loveday",
      "Jonathan",
      ""
    ],
    [
      "Fritz",
      "Alexander",
      ""
    ],
    [
      "Verdier",
      "Aurélien",
      ""
    ],
    [
      "Roukema",
      "Boudewijn F.",
      ""
    ],
    [
      "Sifón",
      "Cristóbal",
      ""
    ],
    [
      "Cassará",
      "Letizia P.",
      ""
    ],
    [
      "Assef",
      "Roberto J.",
      ""
    ],
    [
      "Ardern",
      "Steve",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 30 Dec 2024 18:06:37 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735581997000,
  "abstract": "  Classification of spectra (1) and anomaly detection (2) are fundamental steps\nto guarantee the highest accuracy in redshift measurements (3) in modern\nall-sky spectroscopic surveys. We introduce a new Galaxy Spectra Neural Network\n(GaSNet-III) model that takes advantage of generative neural networks to\nperform these three tasks at once with very high efficiency. We use two\ndifferent generative networks, an autoencoder-like network and U-Net, to\nreconstruct the rest-frame spectrum (after redshifting). The autoencoder-like\nnetwork operates similarly to the classical PCA, learning templates\n(eigenspectra) from the training set and returning modeling parameters. The\nU-Net, in contrast, functions as an end-to-end model and shows an advantage in\nnoise reduction. By reconstructing spectra, we can achieve classification,\nredshift estimation, and anomaly detection in the same framework. Each\nrest-frame reconstructed spectrum is extended to the UV and a small part of the\ninfrared (covering the blueshift of stars). Owing to the high computational\nefficiency of deep learning, we scan the chi-squared value for the entire type\nand redshift space and find the best-fitting point. Our results show that\ngenerative networks can achieve accuracy comparable to the classical PCA\nmethods in spectral modeling with higher efficiency, especially achieving an\naverage of $>98\\%$ classification across all classes ($>99.9\\%$ for star), and\n$>99\\%$ (stars), $>98\\%$ (galaxies) and $>93\\%$ (quasars) redshift accuracy\nunder cosmology research requirements. By comparing different peaks of\nchi-squared curves, we define the ``robustness'' in the scanned space, offering\na method to identify potential ``anomalous'' spectra. Our approach provides an\naccurate and high-efficiency spectrum modeling tool for handling the vast data\nvolumes from future spectroscopic sky surveys.\n",
  "subjects": [
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Vc2KuS8quxFTT7ACbwHPPJ6UGeL6VRabYFpGPPiTa8g",
  "pdfSize": "4268231"
}