{"id":"2412.06934","title":"A Scalable Bayesian Spatiotemporal Model for Water Level Predictions\n  using a Nearest Neighbor Gaussian Process Approach","authors":"Victor Hugo Nagahama, James Sweeney, Niamh Cahill","authorsParsed":[["Nagahama","Victor Hugo",""],["Sweeney","James",""],["Cahill","Niamh",""]],"versions":[{"version":"v1","created":"Mon, 9 Dec 2024 19:24:18 GMT"}],"updateDate":"2024-12-11","timestamp":1733772258000,"abstract":"  Obtaining accurate water level predictions are essential for water resource\nmanagement and implementing flood mitigation strategies. Several data-driven\nmodels can be found in the literature. However, there has been limited research\nwith regard to addressing the challenges posed by large spatio-temporally\nreferenced hydrological datasets, in particular, the challenges of maintaining\npredictive performance and uncertainty quantification. Gaussian Processes (GPs)\nare commonly used to capture complex space-time interactions. However, GPs are\ncomputationally expensive and suffer from poor scaling as the number of\nlocations increases due to required covariance matrix inversions. To overcome\nthe computational bottleneck, the Nearest Neighbor Gaussian Process (NNGP)\nintroduces a sparse precision matrix providing scalability without having to\nmake inferential compromises. In this work we introduce an innovative model in\nthe hydrology field, specifically designed to handle large datasets consisting\nof a large number of spatial points across multiple hydrological basins, with\ndaily observations over an extended period. We investigate the application of a\nBayesian spatiotemporal NNGP model to a rich dataset of daily water levels of\nrivers located in Ireland. The dataset comprises a network of 301 stations\nsituated in various basins across Ireland, measured over a period of 90 days.\nThe proposed approach allows for prediction of water levels at future time\npoints, as well as the prediction of water levels at unobserved locations\nthrough spatial interpolation, while maintaining the benefits of the Bayesian\napproach, such as uncertainty propagation and quantification. Our findings\ndemonstrate that the proposed model outperforms competing approaches in terms\nof accuracy and precision.\n","subjects":["Statistics/Applications"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"5olbXCsQX-9TDStNhGqw-Q_o_9DFXvTV16RKIqjDhl0","pdfSize":"6653550"}