{"id":"2412.00039","title":"Modeling H1N1 Influenza Transmission and Control: Epidemic Theory\n  Insights Across Mexico, Italy, and South Africa","authors":"Md Kamrujjaman and Kazi Mehedi Mohammad","authorsParsed":[["Kamrujjaman","Md",""],["Mohammad","Kazi Mehedi",""]],"versions":[{"version":"v1","created":"Fri, 22 Nov 2024 06:21:26 GMT"}],"updateDate":"2024-12-03","timestamp":1732256486000,"abstract":"  This study incorporates mathematical analysis, focusing on developing\ntheories and conducting numerical simulations of Influenza virus transmission\nusing real-world data. The terms in the equations introduce parameters which\nare determined by fitting the model for matching clinical data sets using\nnon-linear least-square method. The purpose is to determine the wave trend,\ncritical illness factors and forecast for Influenza in national levels of\nMexico, Italy, and South Africa and to investigate the effectiveness of control\npolicy and making some suggestions of alternative control policies. Data were\nextracted from the following sources: published literature, surveillance,\nunpublished reports, and websites of Centres For Disease Control and Prevention\n(CDC) \\cite{CDC}, Natality report of U.S. clinics and World Health Organization\n(WHO) Influenza Disease Dashboard \\cite{WHO}. We included total 120 weeks data\n(which are calculated as per thousand) from October 01, 2020 to March 31, 2023\n\\cite{CDC}, throughout this study. Numerical and sensitivity analysis are\ncarried out to determine some prevent strategies. The objectives of local and\nglobal sensitivity analysis is to determine the dominating parameters and\neffective correlation with $\\mathcal{R}_0$. We presented data fitting, Latin\nhypercube sampling, sensitivity indices, Partial Rank Correlation Coefficient,\np-value, estimation of the nature of $\\mathcal{R}_0$ from available data to\nshow validation of the model with these counties. The aim is to determine\noptimal control strategies with drug administration schemes, treatments which\nrepresent the efficacy of drug inhabiting viral production and preventing new\ninfections, minimizes the systematic cost based on the percentage effect of the\ndrug. Finally, we present series of numerical examples and the effect of\ndifferent parameters on the compartments to verify theoretical results.\n","subjects":["Mathematics/General Mathematics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"lfVqdlgqZHuYfY-xnpyMJkmrLJsEVMCq7IJFw9PFjaY","pdfSize":"5452675"}