{"id":"2412.02643","title":"A Bidirectional Long Short Term Memory Approach for Infrastructure\n  Health Monitoring Using On-board Vibration Response","authors":"R. R. Samani, A. Nunez, B. De Schutter","authorsParsed":[["Samani","R. R.",""],["Nunez","A.",""],["De Schutter","B.",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 18:15:34 GMT"}],"updateDate":"2024-12-04","timestamp":1733249734000,"abstract":"  The growing volume of available infrastructural monitoring data enables the\ndevelopment of powerful datadriven approaches to estimate infrastructure health\nconditions using direct measurements. This paper proposes a deep learning\nmethodology to estimate infrastructure physical parameters, such as railway\ntrack stiffness, using drive-by vibration response signals. The proposed method\nemploys a Long Short-term Memory (LSTM) feature extractor accounting for\ntemporal dependencies in the feature extraction phase, and a bidirectional Long\nShort-term Memory (BiLSTM) networks to leverage bidirectional temporal\ndependencies in both the forward and backward paths of the drive-by vibration\nresponse in condition estimation phase. Additionally, a framing approach is\nemployed to enhance the resolution of the monitoring task to the beam level by\nsegmenting the vibration signal into frames equal to the distance between\nindividual beams, centering the frames over the beam nodes. The proposed\nLSTM-BiLSTM model offers a versatile tool for various bridge and railway\ninfrastructure conditions monitoring using direct drive-by vibration response\nmeasurements. The results demonstrate the potential of incorporating temporal\nanalysis in the feature extraction phase and emphasize the pivotal role of\nbidirectional temporal information in infrastructure health condition\nestimation. The proposed methodology can accurately and automatically estimate\nrailway track stiffness and identify local stiffness reductions in the presence\nof noise using drive-by measurements. An illustrative case study of\nvehicle-track interaction simulation is used to demonstrate the performance of\nthe proposed model, achieving a maximum mean absolute percentage error of 1.7%\nand 0.7% in estimating railpad and ballast stiffness, respectively.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ljA4DQDjoltFoJ-xb3VmLA9yByM2ITRatzBipW1-u7Y","pdfSize":"1063319"}