{"id":"2412.08133","title":"Intelligent Electric Power Steering: Artificial Intelligence Integration\n  Enhances Vehicle Safety and Performance","authors":"Vikas Vyas, Sneha Sudhir Shetiya","authorsParsed":[["Vyas","Vikas",""],["Shetiya","Sneha Sudhir",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 06:41:51 GMT"}],"updateDate":"2024-12-12","timestamp":1733899311000,"abstract":"  Electric Power Steering (EPS) systems utilize electric motors to aid users in\nsteering their vehicles, which provide additional precise control and reduced\nenergy consumption compared to traditional hydraulic systems. EPS technology\nprovides safety,control and efficiency.. This paper explains the integration of\nArtificial Intelligence (AI) into Electric Power Steering (EPS) systems,\nfocusing on its role in enhancing the safety, and adaptability across diverse\ndriving conditions. We explore significant development in AI-driven EPS,\nincluding predictive control algorithms, adaptive torque management systems,\nand data-driven diagnostics. The paper presents case studies of AI applications\nin EPS, such as Lane centering control (LCC), Automated Parking Systems, and\nAutonomous Vehicle Steering, while considering the challenges, limitations, and\nfuture prospects of this technology. This article discusses current\ndevelopments in AI-driven EPS, emphasizing on the benefits of improved safety,\nadaptive control, and predictive maintenance. Challenges in integrating AI in\nEPS systems. This paper addresses cybersecurity risks, ethical concerns, and\ntechnical limitations,, along with next steps for research and implementation\nin autonomous, and connected vehicles.\n","subjects":["Computer Science/Robotics","Computer Science/Artificial Intelligence","Computer Science/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"FCNU-pGhCQYYXovigqFkhjwvGdxkej0IRx7pqHD3a74","pdfSize":"113663"}