{
  "id": "2412.10595",
  "title": "Recommendation and Temptation",
  "authors": "Md Sanzeed Anwar, Paramveer S. Dhillon, Grant Schoenebeck",
  "authorsParsed": [
    [
      "Anwar",
      "Md Sanzeed",
      ""
    ],
    [
      "Dhillon",
      "Paramveer S.",
      ""
    ],
    [
      "Schoenebeck",
      "Grant",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 22:44:22 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734129862000,
  "abstract": "  Traditional recommender systems based on utility maximization and revealed\npreferences often fail to capture users' dual-self nature, where consumption\nchoices are driven by both long-term benefits (enrichment) and desire for\ninstant gratification (temptation). Consequently, these systems may generate\nrecommendations that fail to provide long-lasting satisfaction to users. To\naddress this issue, we propose a novel user model that accounts for this\ndual-self behavior and develop an optimal recommendation strategy to maximize\nenrichment from consumption. We highlight the limitations of historical\nconsumption data in implementing this strategy and present an estimation\nframework that makes minimal assumptions and leverages explicit user feedback\nand implicit choice data to overcome these constraints. We evaluate our\napproach through both synthetic simulations and simulations based on real-world\ndata from the MovieLens dataset. Results demonstrate that our proposed\nrecommender can deliver superior enrichment compared to several competitive\nbaseline algorithms that assume a single utility type and rely solely on\nrevealed preferences. Our work emphasizes the critical importance of optimizing\nfor enrichment in recommender systems, particularly in temptation-laden\nconsumption contexts. Our findings have significant implications for content\nplatforms, user experience design, and the development of responsible AI\nsystems, paving the way for more nuanced and user-centric recommendation\napproaches.\n",
  "subjects": [
    "Computer Science/Information Retrieval",
    "Computer Science/Computers and Society",
    "Computer Science/Computer Science and Game Theory"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "eWmjMiighyibkHC5VMwvMdBygyh_SzBg1C7bGm98zs8",
  "pdfSize": "775144"
}