{"id":"2412.18015","title":"VEGAS-SSS: An intra-group component in the globular cluster system of\n  NGC 5018 group of galaxies using VST data","authors":"Pratik Lonare, Michele Cantiello, Marco Mirabile, Marilena Spavone,\n  Marina Rejkuba, Michael Hilker, Rebecca Habas, Enrichetta Iodice, Nandini\n  Hazra, and Gabriele Riccio","authorsParsed":[["Lonare","Pratik",""],["Cantiello","Michele",""],["Mirabile","Marco",""],["Spavone","Marilena",""],["Rejkuba","Marina",""],["Hilker","Michael",""],["Habas","Rebecca",""],["Iodice","Enrichetta",""],["Hazra","Nandini",""],["Riccio","Gabriele",""]],"versions":[{"version":"v1","created":"Mon, 23 Dec 2024 22:17:53 GMT"}],"updateDate":"2025-02-19","timestamp":1734992273000,"abstract":"  Globular clusters (GCs) are fossil tracer of formation and evolution of\ngalaxies and studying their properties provides crucial insights into past\nformation and interaction events. We study the properties of GC candidates in\n1.25 $\\times$ 1.03 sq. degrees area centred on NGC 5018 group of galaxies using\ndeep, wide field and multi-band observations obtained with VST. We derived\nphotometric catalogues of compact and extended sources and identified GC\ncandidates using a set of photometric and morphometric selection parameters. A\nGC candidates catalogue is inspected using a statistical background\ndecontamination technique. The 2D distribution map of GC candidates reveals an\noverdensity of sources on brightest member of group, NGC 5018. No significant\nGC overdensities are observed in other bright galaxies of group. We report\ndiscovery of a candidate local nucleated LSB dwarf galaxy possibly in tidal\ninteraction with NGC 5018. The 2D map also reveals an intra-group GC population\naligning with bright galaxies and along intra-group light component. Radial\ndensity profile of GC candidates in NGC 5018 follows galaxy surface brightness\nprofile. Colour profile of GC candidates centred on this galaxy shows no\nevidence of well-known colour bimodality, which is instead observed in\nintra-group population. From GC luminosity function (GCLF) analysis, we find a\nlow specific frequency $S_{\\!\\rm N}=0.59 \\pm 0.27$ for NGC 5018, consistent\nwith previous results. This relatively low $S_{\\!\\rm N}$ and lack of colour\nbimodality might be due to a combination of observational data limitations and\nthe post-merger status of NGC 5018, which might host a population of relatively\nyoung GCs. For intra-group GC population, we obtain a lower limit of $S_{\\!\\rm\n{N,gr}}\\sim0.6$. Using GCLF as a distance indicator, we estimate that NGC 5018\nis located $38.0 \\pm 7.9$ Mpc away, consistent with values in the literature..\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"NMLTs9QiaJZ0ztIo_qGaUKsoeOPZVQbi16nVbrD_kyU","pdfSize":"24112870"}