{"id":"2412.14240","title":"Noble Dark Matter: Surprising Elusiveness of Dark Baryons","authors":"Pouya Asadi, Austin Batz, Graham D. Kribs","authorsParsed":[["Asadi","Pouya",""],["Batz","Austin",""],["Kribs","Graham D.",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 19:00:00 GMT"}],"updateDate":"2024-12-20","timestamp":1734548400000,"abstract":"  Dark matter could be a baryonic composite of strongly-coupled constituents\ntransforming under SU(2)$_L$. We classify the SU(2)$_L$ representations of\nbaryons in a class of simple confining dark sectors and find that the lightest\nstate can be a pure singlet or a singlet that mixes with other neutral\ncomponents of SU(2)$_L$ representations, which strongly suppresses the dark\nmatter candidate's interactions with the Standard Model. We focus on models\nwith a confining $\\text{SU}(N_c)$ and heavy dark quarks constituting\nvector-like $N_f$-plet of SU(2)$_L$. For benchmark $N_c$ and $N_f$, we\ncalculate baryon mass spectra, incorporating electroweak gauge boson exchange\nin the non-relativistic quark model, and demonstrate that above TeV mass\nscales, dark matter is dominantly a singlet state. The combination of this\nsinglet nature with the recently discovered $\\mathcal{H}$-parity results in an\ninert state analogous to noble gases, hence we coin the term Noble Dark Matter.\nOur results can be understood in the non-relativistic effective theory that\ntreats the dark baryons as elementary states, where we find singlets\naccompanying triplets, 5-plets, or more exotic representations. This\ngeneralization of WIMP-like theories is more difficult to find or rule out than\ndark matter models that include only a single SU(2)$_L$ multiplet (such as a\nWino), motivating new searches in colliders and a re-analysis of direct and\nindirect detection prospects in astrophysical observations.\n","subjects":["Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"HOGu5f5baVAWmvM0E8DrvyU9ebfmw7QcptfSwB8xWMw","pdfSize":"1307398"}