{
  "id": "2412.07921",
  "title": "Electron-Ion Coupling Breaks Energy Symmetry in Organic Electrochemical\n  Transistors",
  "authors": "Lukas M. Bongartz, Garrett LeCroy, Tyler J. Quill, Nicholas Siemons,\n  Gerwin Dijk, Adam Marks, Christina Cheng, Hans Kleemann, Karl Leo, Alberto\n  Salleo",
  "authorsParsed": [
    [
      "Bongartz",
      "Lukas M.",
      ""
    ],
    [
      "LeCroy",
      "Garrett",
      ""
    ],
    [
      "Quill",
      "Tyler J.",
      ""
    ],
    [
      "Siemons",
      "Nicholas",
      ""
    ],
    [
      "Dijk",
      "Gerwin",
      ""
    ],
    [
      "Marks",
      "Adam",
      ""
    ],
    [
      "Cheng",
      "Christina",
      ""
    ],
    [
      "Kleemann",
      "Hans",
      ""
    ],
    [
      "Leo",
      "Karl",
      ""
    ],
    [
      "Salleo",
      "Alberto",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 21:07:38 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733864858000,
  "abstract": "  Organic electrochemical transistors are extensively studied for applications\nranging from bioelectronics to analog and neuromorphic computing. Despite\nsignificant advances, the fundamental interactions between the polymer\nsemiconductor channel and the electrolyte, which critically determine the\ndevice performance, remain underexplored. Here, we examine the coupling between\nthe benchmark semiconductor PEDOT:PSS and ionic liquids to explain the bistable\nand non-volatile behavior observed in OECTs. Using X-ray scattering and\nspectroscopy techniques, we demonstrate how the electrolyte modifies the\nchannel composition, enhances molecular order, and reshapes the electronic and\nenergetic landscape. Notably, the observed bistability arises from asymmetric\nand path-dependent energetics during doping and dedoping, resulting in two\ndistinct, stable states, driven by a direct interaction between the electronic\nand ionic charge carriers. These findings highlight a compelling method to\ncontrol charge carrier dynamics via the electrolyte, positioning it as a\npowerful yet underutilized tool for enabling novel device functionalities.\n",
  "subjects": [
    "Condensed Matter/Materials Science",
    "Condensed Matter/Disordered Systems and Neural Networks",
    "Physics/Applied Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "xoe_T2J2dCKbwaA8hEma4cnTfUoAmoJ1JwpEJYvsGo8",
  "pdfSize": "7442670"
}