{"id":"2412.03791","title":"Coordinate In and Value Out: Training Flow Transformers in Ambient Space","authors":"Yuyang Wang, Anurag Ranjan, Josh Susskind, Miguel Angel Bautista","authorsParsed":[["Wang","Yuyang",""],["Ranjan","Anurag",""],["Susskind","Josh",""],["Bautista","Miguel Angel",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 01:00:07 GMT"}],"updateDate":"2024-12-06","timestamp":1733360407000,"abstract":"  Flow matching models have emerged as a powerful method for generative\nmodeling on domains like images or videos, and even on unstructured data like\n3D point clouds. These models are commonly trained in two stages: first, a data\ncompressor (i.e., a variational auto-encoder) is trained, and in a subsequent\ntraining stage a flow matching generative model is trained in the\nlow-dimensional latent space of the data compressor. This two stage paradigm\nadds complexity to the overall training recipe and sets obstacles for unifying\nmodels across data domains, as specific data compressors are used for different\ndata modalities. To this end, we introduce Ambient Space Flow Transformers\n(ASFT), a domain-agnostic approach to learn flow matching transformers in\nambient space, sidestepping the requirement of training compressors and\nsimplifying the training process. We introduce a conditionally independent\npoint-wise training objective that enables ASFT to make predictions\ncontinuously in coordinate space. Our empirical results demonstrate that using\ngeneral purpose transformer blocks, ASFT effectively handles different data\nmodalities such as images and 3D point clouds, achieving strong performance in\nboth domains and outperforming comparable approaches. ASFT is a promising step\ntowards domain-agnostic flow matching generative models that can be trivially\nadopted in different data domains.\n","subjects":["Computer Science/Machine Learning","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"5Z9d9Vr7QjsvgPtM-NBRgufW7rCxX71PW3MU_iwtbW0","pdfSize":"39251201"}