{
  "id": "2412.17706",
  "title": "Lindblad engineering for quantum Gibbs state preparation under the\n  eigenstate thermalization hypothesis",
  "authors": "Eric Brunner (1), Luuk Coopmans (1), Gabriel Matos (1), Matthias\n  Rosenkranz (1), Frederic Sauvage (1), Yuta Kikuchi (2 and 3) ((1) Quantinuum\n  UK, (2) Quantinuum Japan, (3) RIKEN (iTHEMS) Japan)",
  "authorsParsed": [
    [
      "Brunner",
      "Eric",
      "",
      "2 and 3"
    ],
    [
      "Coopmans",
      "Luuk",
      "",
      "2 and 3"
    ],
    [
      "Matos",
      "Gabriel",
      "",
      "2 and 3"
    ],
    [
      "Rosenkranz",
      "Matthias",
      "",
      "2 and 3"
    ],
    [
      "Sauvage",
      "Frederic",
      "",
      "2 and 3"
    ],
    [
      "Kikuchi",
      "Yuta",
      "",
      "2 and 3"
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 16:35:12 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734971712000,
  "abstract": "  Building upon recent progress in Lindblad engineering for quantum Gibbs state\npreparation algorithms, we propose a simplified protocol that is shown to be\nefficient under the eigenstate thermalization hypothesis (ETH). The ETH reduces\ncircuit overhead of the Lindblad simulation algorithm and ensures a fast\nconvergence toward the target Gibbs state. Moreover, we show that the realized\nLindblad dynamics exhibits resilience against depolarizing noise, opening up\nthe path to a first demonstration on quantum computers. We complement our\nclaims with numerical studies of the algorithm's convergence in various regimes\nof the mixed-field Ising model. In line with our predictions, we observe a\nmixing time scaling polynomially with system size when the ETH is satisfied. In\naddition, we assess the impact of algorithmic and hardware-induced errors on\nthe algorithm's performance by carrying out quantum circuit simulations of our\nLindblad simulation protocol with realistic noise models. This work bridges the\ngap between recent theoretical advances in Gibbs state preparation algorithms\nand their eventual quantum hardware implementation.\n",
  "subjects": [
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "JxDUnhCZhcN2Ahwcih69Ty5X4GUlfLrqVePdssCeu9E",
  "pdfSize": "2460941"
}