{
  "id": "2412.03765",
  "title": "A Benchmark for Math Misconceptions: Bridging Gaps in Middle School\n  Algebra with AI-Supported Instruction",
  "authors": "Otero Nancy and Druga Stefania and Lan Andrew",
  "authorsParsed": [
    [
      "Nancy",
      "Otero",
      ""
    ],
    [
      "Stefania",
      "Druga",
      ""
    ],
    [
      "Andrew",
      "Lan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 23:10:29 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733353829000,
  "abstract": "  This study introduces an evaluation benchmark for middle school algebra to be\nused in artificial intelligence(AI) based educational platforms. The goal is to\nsupport the design of AI systems that can enhance learner conceptual\nunderstanding of algebra by taking into account their current level of algebra\ncomprehension. The data set comprises 55 misconceptions about algebra, common\nerrors, and 220 diagnostic examples identified in previous peer-reviewed\nstudies. We provide an example application using a large language model,\nobserving a range of precision and recall scores depending on the topic and\nexperimental setup that reaches 83.9% when including educator feedback and\nrestricting it by topic. We found that topics such as ratios and proportions\nprove as difficult for LLMs as they are for students. We included a human\nassessment of LLMs results and feedback from five middle school math educators\non the clarity and occurrence of misconceptions in the dataset and the\npotential use of AI in conjunction with the dataset. Most educators (80% or\nmore) indicated that they encounter these misconceptions among their students,\nsuggesting the relevance of the data set to teaching middle school algebra.\nDespite varying familiarity with AI tools, four out of five educators expressed\ninterest in using the data set with AI to diagnose student misconceptions or\ntrain teachers. The results emphasize the importance of topic-constrained\ntesting, the need for multimodal approaches, and the relevance of human\nexpertise to gain practical insights when using AI for human learning.\n",
  "subjects": [
    "Computer Science/Human-Computer Interaction",
    "Computer Science/Computers and Society"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "RO1JkiKFHj-pghZ18q8JI5pB35Pk2nVaREOfE7RvFl0",
  "pdfSize": "4915441"
}