{
  "id": "2412.04629",
  "title": "Argumentative Experience: Reducing Confirmation Bias on Controversial\n  Issues through LLM-Generated Multi-Persona Debates",
  "authors": "Li Shi, Houjiang Liu, Yian Wong, Utkarsh Mujumdar, Dan Zhang, Jacek\n  Gwizdka, Matthew Lease",
  "authorsParsed": [
    [
      "Shi",
      "Li",
      ""
    ],
    [
      "Liu",
      "Houjiang",
      ""
    ],
    [
      "Wong",
      "Yian",
      ""
    ],
    [
      "Mujumdar",
      "Utkarsh",
      ""
    ],
    [
      "Zhang",
      "Dan",
      ""
    ],
    [
      "Gwizdka",
      "Jacek",
      ""
    ],
    [
      "Lease",
      "Matthew",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 21:51:05 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 10 Dec 2024 08:02:24 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733435465000,
  "abstract": "  Large language models (LLMs) are enabling designers to give life to exciting\nnew user experiences for information access. In this work, we present a system\nthat generates LLM personas to debate a topic of interest from different\nperspectives. How might information seekers use and benefit from such a system?\nCan centering information access around diverse viewpoints help to mitigate\nthorny challenges like confirmation bias in which information seekers\nover-trust search results matching existing beliefs? How do potential biases\nand hallucinations in LLMs play out alongside human users who are also fallible\nand possibly biased?\n  Our study exposes participants to multiple viewpoints on controversial issues\nvia a mixed-methods, within-subjects study. We use eye-tracking metrics to\nquantitatively assess cognitive engagement alongside qualitative feedback.\nCompared to a baseline search system, we see more creative interactions and\ndiverse information-seeking with our multi-persona debate system, which more\neffectively reduces user confirmation bias and conviction toward their initial\nbeliefs. Overall, our study contributes to the emerging design space of\nLLM-based information access systems, specifically investigating the potential\nof simulated personas to promote greater exposure to information diversity,\nemulate collective intelligence, and mitigate bias in information seeking.\n",
  "subjects": [
    "Computer Science/Human-Computer Interaction",
    "Computer Science/Computers and Society",
    "Computer Science/Information Retrieval"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "xU8KZqt2rSmndXa7ImPJ2nw06VFYHqJ_GIlyrX5XzHw",
  "pdfSize": "3675902"
}