{
  "id": "2412.20425",
  "title": "An Efficient Stochastic Optimization Method for Global Placement in VLSI\n  Problem",
  "authors": "Yi-Shuang Yue, Yu-Hong Dai, Haijun Yu",
  "authorsParsed": [
    [
      "Yue",
      "Yi-Shuang",
      ""
    ],
    [
      "Dai",
      "Yu-Hong",
      ""
    ],
    [
      "Yu",
      "Haijun",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 29 Dec 2024 10:21:26 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735467686000,
  "abstract": "  The placement problem in very large-scale integration (VLSI) is a critical\nstep in chip design, the goal of which is to optimize the wirelength of circuit\ncomponents within a confined area while adhering to non-overlapping\nconstraints. Most analytical placement models often rely on smooth\napproximations, thereby sacrificing the accuracy of wirelength estimation. To\nmitigate these inaccuracies, this paper introduces a novel approach that\ndirectly optimizes the original nonsmooth wirelength and proposes an innovative\npenalty model tailored for the global placement problem. Specifically, we\ntransform the non-overlapping constraints into rectified linear penalty\nfunctions, allowing for a more precise formulation of the problem. Notably, we\nreformulate the resultant optimization problem into an equivalent framework\nresembling deep neural network training. Leveraging automatic differentiation\ntechniques from deep learning, we efficiently compute the subgradient of the\nobjective function, thus facilitating the application of stochastic subgradient\nmethods to solve the model. To enhance the algorithm's performance, several\nadvanced techniques are further introduced, leading to significant improvements\nin both efficiency and solution quality. Numerical experiments conducted on\nGSRC benchmark circuits demonstrate that our proposed model and algorithm\nachieve significant reductions in wirelength while effectively eliminating\noverlaps, highlighting its potential as a transformative advancement for\nlarge-scale VLSI placement.\n",
  "subjects": [
    "Mathematics/Optimization and Control"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "DCCPsTGI227ppPQrri_I1FQP7jRTupd6JKuf69Q2vPQ",
  "pdfSize": "470293"
}