{"id":"2412.02366","title":"GenMix: Effective Data Augmentation with Generative Diffusion Model\n  Image Editing","authors":"Khawar Islam, Muhammad Zaigham Zaheer, Arif Mahmood, Karthik\n  Nandakumar, Naveed Akhtar","authorsParsed":[["Islam","Khawar",""],["Zaheer","Muhammad Zaigham",""],["Mahmood","Arif",""],["Nandakumar","Karthik",""],["Akhtar","Naveed",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 10:45:34 GMT"},{"version":"v2","created":"Wed, 4 Dec 2024 16:38:01 GMT"},{"version":"v3","created":"Fri, 6 Dec 2024 00:42:40 GMT"}],"updateDate":"2024-12-09","timestamp":1733222734000,"abstract":"  Data augmentation is widely used to enhance generalization in visual\nclassification tasks. However, traditional methods struggle when source and\ntarget domains differ, as in domain adaptation, due to their inability to\naddress domain gaps. This paper introduces GenMix, a generalizable\nprompt-guided generative data augmentation approach that enhances both\nin-domain and cross-domain image classification. Our technique leverages image\nediting to generate augmented images based on custom conditional prompts,\ndesigned specifically for each problem type. By blending portions of the input\nimage with its edited generative counterpart and incorporating fractal\npatterns, our approach mitigates unrealistic images and label ambiguity,\nimproving the performance and adversarial robustness of the resulting models.\nEfficacy of our method is established with extensive experiments on eight\npublic datasets for general and fine-grained classification, in both in-domain\nand cross-domain settings. Additionally, we demonstrate performance\nimprovements for self-supervised learning, learning with data scarcity, and\nadversarial robustness. As compared to the existing state-of-the-art methods,\nour technique achieves stronger performance across the board.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"zcYU-HZRsl0I1nqD-J54EYDvSBTMViLiYL-3urDk4cA","pdfSize":"15443589"}