{
  "id": "2412.05388",
  "title": "CALICO: Conversational Agent Localization via Synthetic Data Generation",
  "authors": "Andy Rosenbaum, Pegah Kharazmi, Ershad Banijamali, Lu Zeng,\n  Christopher DiPersio, Pan Wei, Gokmen Oz, Clement Chung, Karolina Owczarzak,\n  Fabian Triefenbach, Wael Hamza",
  "authorsParsed": [
    [
      "Rosenbaum",
      "Andy",
      ""
    ],
    [
      "Kharazmi",
      "Pegah",
      ""
    ],
    [
      "Banijamali",
      "Ershad",
      ""
    ],
    [
      "Zeng",
      "Lu",
      ""
    ],
    [
      "DiPersio",
      "Christopher",
      ""
    ],
    [
      "Wei",
      "Pan",
      ""
    ],
    [
      "Oz",
      "Gokmen",
      ""
    ],
    [
      "Chung",
      "Clement",
      ""
    ],
    [
      "Owczarzak",
      "Karolina",
      ""
    ],
    [
      "Triefenbach",
      "Fabian",
      ""
    ],
    [
      "Hamza",
      "Wael",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 19:29:16 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733513356000,
  "abstract": "  We present CALICO, a method to fine-tune Large Language Models (LLMs) to\nlocalize conversational agent training data from one language to another. For\nslots (named entities), CALICO supports three operations: verbatim copy,\nliteral translation, and localization, i.e. generating slot values more\nappropriate in the target language, such as city and airport names located in\ncountries where the language is spoken. Furthermore, we design an iterative\nfiltering mechanism to discard noisy generated samples, which we show boosts\nthe performance of the downstream conversational agent. To prove the\neffectiveness of CALICO, we build and release a new human-localized (HL)\nversion of the MultiATIS++ travel information test set in 8 languages. Compared\nto the original human-translated (HT) version of the test set, we show that our\nnew HL version is more challenging. We also show that CALICO out-performs\nstate-of-the-art LINGUIST (which relies on literal slot translation out of\ncontext) both on the HT case, where CALICO generates more accurate slot\ntranslations, and on the HL case, where CALICO generates localized slots which\nare closer to the HL test set.\n",
  "subjects": [
    "Computer Science/Computation and Language",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "f7dt-4uZJBZG0jFSOs8zpDlFHz70H4s6P656UuRUviE",
  "pdfSize": "433507"
}