{
  "id": "2412.07779",
  "title": "Evolution of Thought: Diverse and High-Quality Reasoning via\n  Multi-Objective Optimization",
  "authors": "Biqing Qi, Zhouyi Qian, Yiang Luo, Junqi Gao, Dong Li, Kaiyan Zhang,\n  Bowen Zhou",
  "authorsParsed": [
    [
      "Qi",
      "Biqing",
      ""
    ],
    [
      "Qian",
      "Zhouyi",
      ""
    ],
    [
      "Luo",
      "Yiang",
      ""
    ],
    [
      "Gao",
      "Junqi",
      ""
    ],
    [
      "Li",
      "Dong",
      ""
    ],
    [
      "Zhang",
      "Kaiyan",
      ""
    ],
    [
      "Zhou",
      "Bowen",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 24 Nov 2024 14:59:30 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1732460370000,
  "abstract": "  As multi-modal large language models (MLLMs) are increasingly applied to\ncomplex reasoning tasks, the diversity and quality of reasoning paths become\ncrucial factors affecting their performance. Although current methods aim to\nenhance reasoning quality through path expansion, they often neglect the\ndiversity of reasoning paths and effective information sharing, leading to\nlocal optima and inefficiency. To address these challenges, we propose\nEvolution of Thought (EoT), a multi-objective framework designed to improve\nreasoning by fostering both high-quality and diverse reasoning paths.\nSpecifically, we introduce the Non-dominated Sorting Genetic Algorithm II for\nmulti-objective optimization, utilizing crossover and mutation operators to\npromote greater diversity in reasoning solutions. Additionally, we propose a\nCondensation-Aggregation mechanism to cluster and eliminate redundant paths,\nfacilitate improved information sharing among parent nodes, and ultimately\nenhance both the efficiency and quality of the reasoning process. Validation\nexperiments on various vision-language and language reasoning tasks demonstrate\nthat EoT achieves superior reasoning performance and efficiency compared to\nother competitive baselines. Our study provides a novel perspective on the\ndesign of heuristic reasoning frameworks for MLLMs.\n",
  "subjects": [
    "Computer Science/Neural and Evolutionary Computing",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "91oX4fAHNkKMcxO0MzCRcH3WaawTKZ-KVKlKQBThWHA",
  "pdfSize": "1380741"
}