{"id":"2412.13181","title":"Universal Patterns in the Long-term Growth of Urban Infrastructure in\n  U.S. Cities from 1900 to 2015","authors":"Keith Burghardt, Johannes H.Uhl, Kristina Lerman, Stefan Leyk","authorsParsed":[["Burghardt","Keith",""],["Uhl","Johannes H.",""],["Lerman","Kristina",""],["Leyk","Stefan",""]],"versions":[{"version":"v1","created":"Tue, 17 Dec 2024 18:57:17 GMT"}],"updateDate":"2024-12-18","timestamp":1734461837000,"abstract":"  Despite the rapid growth of cities in the past century, our quantitative,\nin-depth understanding of how cities grow remains limited due to a consistent\nlack of historical data. Thus, the scaling laws between a city's features and\nits population as they evolve over time, known as temporal city scaling, is\nunder-explored, especially for time periods spanning multiple decades. In this\npaper, we leverage novel data sources such as the Historical Settlement Data\nCompilation for the U.S. (HISDAC-US), and analyze the temporal scaling laws of\ndeveloped area, building indoor area, building footprint area, and road length\nand other road network statistics for nearly all metropolitan areas in the U.S.\nfrom 1900 to 2015. We find that scaling exponents vary dramatically between\ncities as a function of their size and location. Three notable patterns emerge.\nFirst, scaling law exponents imply many, but not all, metropolitan areas are\nbecoming less dense and indoor area per capita increases as cities grow, in\ncontrast to expectations. Second, larger cities tend to have a smaller scaling\nexponent than smaller cities. Third, scaling exponents (and growth patterns)\nare similar between nearby cities. These results show a long-term trend that\ncould harm urban sustainability as previously dense populations are rapidly\nspreading out into undeveloped land. Moreover, the regional similarity of\nlong-term urban growth patterns implies that city evolution and sustainability\npatterns are more interconnected than prior research has suggested. These\nresults help urban planners and scientists understand universal, long-term\npatterns of city growth across the US.\n","subjects":["Physics/Physics and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"hwuieJdJiP-OUOQO1jxvHlwWtB8Nls9zg_lsfWzRqNQ","pdfSize":"32236095"}