{"id":"2412.07110","title":"Recent progress on the solid-state materials for photocatalysis","authors":"L. D. Tamang, S. Gurung, R. Zosiamliana, L. Celestine, B. Chettri,\n  Jitendra Pal Singh, A. Laref, Mukhriddin E. Tursunov, Avazbek T. Dekhkonov,\n  D. P. Rai","authorsParsed":[["Tamang","L. D.",""],["Gurung","S.",""],["Zosiamliana","R.",""],["Celestine","L.",""],["Chettri","B.",""],["Singh","Jitendra Pal",""],["Laref","A.",""],["Tursunov","Mukhriddin E.",""],["Dekhkonov","Avazbek T.",""],["Rai","D. P.",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 01:52:19 GMT"}],"updateDate":"2024-12-11","timestamp":1733795539000,"abstract":"  Hydrogen is considered an alternative source of energy to fossil fuels for\nthe fulfilment of current energy demands. Photocatalysis initiates the hydrogen\nevolution reaction which is believed to be the greenest approach to produce\nhydrogen through clean, safe, and environmentally friendly methods. In this\nReview, we focus mainly on the comprehensive analysis of the 2D and 3D bulk\nmaterials on the basis of their superior photocatalytic activities. However,\nseveral literatures have reported the superiority of 2D material over the bulk\ncounterpart in terms of photocatalytic performance owing to their ultrathin\nlayered structures, offer a higher surface-to-volume ratio, flexibility, large\nactive sites for incoming H2O molecules, etc. We have thoroughly analysed the\ndrawbacks of various hydrogen production methods focusing on the photocatalysis\nmechanism and the processes of evolution of hydrogen. In addition to this, a\nshort overview of the various solid-state materials for photocatalysis that\nhave been developed so far and their mechanisms are discussed. Lastly, we have\ndiscussed the recent developments in 2D materials and their composites as\npromising photocatalysts.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"f3D7CsiV-OcB6lijo44O-VJWZpCgrMEotmYY2oI_gKc","pdfSize":"3778040"}