{
  "id": "2412.18883",
  "title": "MotionMap: Representing Multimodality in Human Pose Forecasting",
  "authors": "Reyhaneh Hosseininejad, Megh Shukla, Saeed Saadatnejad, Mathieu\n  Salzmann, Alexandre Alahi",
  "authorsParsed": [
    [
      "Hosseininejad",
      "Reyhaneh",
      ""
    ],
    [
      "Shukla",
      "Megh",
      ""
    ],
    [
      "Saadatnejad",
      "Saeed",
      ""
    ],
    [
      "Salzmann",
      "Mathieu",
      ""
    ],
    [
      "Alahi",
      "Alexandre",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 25 Dec 2024 11:47:26 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735127246000,
  "abstract": "  Human pose forecasting is inherently multimodal since multiple futures exist\nfor an observed pose sequence. However, evaluating multimodality is challenging\nsince the task is ill-posed. Therefore, we first propose an alternative\nparadigm to make the task well-posed. Next, while state-of-the-art methods\npredict multimodality, this requires oversampling a large volume of\npredictions. This raises key questions: (1) Can we capture multimodality by\nefficiently sampling a smaller number of predictions? (2) Subsequently, which\nof the predicted futures is more likely for an observed pose sequence? We\naddress these questions with MotionMap, a simple yet effective heatmap based\nrepresentation for multimodality. We extend heatmaps to represent a spatial\ndistribution over the space of all possible motions, where different local\nmaxima correspond to different forecasts for a given observation. MotionMap can\ncapture a variable number of modes per observation and provide confidence\nmeasures for different modes. Further, MotionMap allows us to introduce the\nnotion of uncertainty and controllability over the forecasted pose sequence.\nFinally, MotionMap captures rare modes that are non-trivial to evaluate yet\ncritical for safety. We support our claims through multiple qualitative and\nquantitative experiments using popular 3D human pose datasets: Human3.6M and\nAMASS, highlighting the strengths and limitations of our proposed method.\nProject Page: https://www.epfl.ch/labs/vita/research/prediction/motionmap/\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Electrical Engineering and Systems Science/Image and Video Processing"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "qtdQ2I9UNhPyhF5q4xheY-zgkHTZKw4nATdSZshenEo",
  "pdfSize": "21122210"
}