{"id":"2412.01678","title":"Gravitational waves and galaxies cross-correlations: a forecast on GW\n  biases for future detectors","authors":"Stefano Zazzera, Jos\\'e Fonseca, Tessa Baker and Chris Clarkson","authorsParsed":[["Zazzera","Stefano",""],["Fonseca","José",""],["Baker","Tessa",""],["Clarkson","Chris",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 16:26:33 GMT"}],"updateDate":"2024-12-03","timestamp":1733156793000,"abstract":"  Gravitational waves (GWs) have rapidly become important cosmological probes\nsince their first detection in 2015. As the number of detected events continues\nto rise, upcoming instruments like the Einstein Telescope (ET) and Cosmic\nExplorer (CE) will observe millions of compact binary (CB) mergers. These\ndetections, coupled with galaxy surveys by instruments such as DESI, Euclid,\nand the Vera Rubin Observatory, will provide unique information on the\nlarge-scale structure of the universe by cross-correlating GWs with the\ndistribution of galaxies which host them. In this paper, we focus on how these\ncross-correlations constrain the clustering bias of GWs emitted by the\ncoalescence of binary black holes (BBH). This parameter links BBHs to the\nunderlying dark matter distribution, hence informing us how they populate\ngalaxies. Using a multi-tracer approach, we forecast the precision of these\nmeasurements under different survey combinations. Our results indicate that\ncurrent GW detectors will have limited precision, with measurement errors as\nhigh as $\\sim50\\%$. However, third-generation detectors like ET, when\ncross-correlated with LSST data, can improve clustering bias measurements to\nwithin $2.5\\%$. Furthermore, we demonstrate that these cross-correlations can\nenable a percent-level measurement of the magnification lensing effect on GWs.\nDespite this, there is a degeneracy between magnification and evolution biases,\nwhich hinders the precision of both. This degeneracy is most effectively\naddressed by assuming knowledge of one bias or targeting an optimal redshift\nrange of $1 < z < 2.5$. Our analysis opens new avenues for studying the\ndistribution of BBHs and testing the nature of gravity through large-scale\nstructure.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"gvRy3xtBJyAZpMOBCh4oyf534EDAg6V5aTdx1k21fLc","pdfSize":"782924"}