{"id":"2412.16978","title":"PromptDresser: Improving the Quality and Controllability of Virtual\n  Try-On via Generative Textual Prompt and Prompt-aware Mask","authors":"Jeongho Kim, Hoiyeong Jin, Sunghyun Park, Jaegul Choo","authorsParsed":[["Kim","Jeongho",""],["Jin","Hoiyeong",""],["Park","Sunghyun",""],["Choo","Jaegul",""]],"versions":[{"version":"v1","created":"Sun, 22 Dec 2024 11:38:04 GMT"}],"updateDate":"2024-12-24","timestamp":1734867484000,"abstract":"  Recent virtual try-on approaches have advanced by fine-tuning the pre-trained\ntext-to-image diffusion models to leverage their powerful generative ability.\nHowever, the use of text prompts in virtual try-on is still underexplored. This\npaper tackles a text-editable virtual try-on task that changes the clothing\nitem based on the provided clothing image while editing the wearing style\n(e.g., tucking style, fit) according to the text descriptions. In the\ntext-editable virtual try-on, three key aspects exist: (i) designing rich text\ndescriptions for paired person-clothing data to train the model, (ii)\naddressing the conflicts where textual information of the existing person's\nclothing interferes the generation of the new clothing, and (iii) adaptively\nadjust the inpainting mask aligned with the text descriptions, ensuring proper\nediting areas while preserving the original person's appearance irrelevant to\nthe new clothing. To address these aspects, we propose PromptDresser, a\ntext-editable virtual try-on model that leverages large multimodal model (LMM)\nassistance to enable high-quality and versatile manipulation based on\ngenerative text prompts. Our approach utilizes LMMs via in-context learning to\ngenerate detailed text descriptions for person and clothing images\nindependently, including pose details and editing attributes using minimal\nhuman cost. Moreover, to ensure the editing areas, we adjust the inpainting\nmask depending on the text prompts adaptively. We found that our approach,\nutilizing detailed text prompts, not only enhances text editability but also\neffectively conveys clothing details that are difficult to capture through\nimages alone, thereby enhancing image quality. Our code is available at\nhttps://github.com/rlawjdghek/PromptDresser.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"3AU9dV3XpwNXF19T_t05DdgeL8WTwNfoluYjx9UvAZA","pdfSize":"11803648"}