{
  "id": "2412.15849",
  "title": "Impact of reionization history on constraining primordial gravitational\n  waves in future all-sky cosmic microwave background experiments",
  "authors": "Hanchun Jiang, Toshiya Namikawa",
  "authorsParsed": [
    [
      "Jiang",
      "Hanchun",
      ""
    ],
    [
      "Namikawa",
      "Toshiya",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 12:46:05 GMT"
    },
    {
      "version": "v2",
      "created": "Wed, 25 Dec 2024 08:40:53 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1734698765000,
  "abstract": "  We explore the impact of the reionization history on examining the shape of\nthe power spectrum of the primordial gravitational waves (PGWs) with the cosmic\nmicrowave background (CMB) polarization. The large-scale CMB generated from the\nreionization epoch is important in probing the PGWs from all-sky experiments,\nsuch as LiteBIRD. The reionization model has been constrained by several\nastrophysical observations. However, its uncertainty could impact constraining\nmodels of the PGWs if we use large-scale CMB polarization. Here, by expanding\nthe analysis of Mortonson & Hu (2007), we estimate how reionization uncertainty\nimpacts constraints on a generic primordial tensor power spectrum. We assume\nthat CMB polarization is measured by a LiteBIRD-like experiment and the tanh\nmodel is adopted for a theoretical template when we fit data. We show that\nconstraints are almost unchanged even if the true reionization history is\ndescribed by an exponential model, where all parameters are within 68%\nConfidence Level (CL). We also show an example of the reionization history that\nthe constraints on the PGWs are biased more than 68% CL. Even in that case,\nusing E-mode power spectrum on large scales would exclude such a scenario and\nmake the PGW constraints robust against the reionization uncertainties.\n",
  "subjects": [
    "Astrophysics/Cosmology and Nongalactic Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Z-tNMP2U_d324bipc-zZi6yp6vXtAilFZXSWIqxvheQ",
  "pdfSize": "1091675"
}