{"id":"2412.05255","title":"TeamCraft: A Benchmark for Multi-Modal Multi-Agent Systems in Minecraft","authors":"Qian Long, Zhi Li, Ran Gong, Ying Nian Wu, Demetri Terzopoulos,\n  Xiaofeng Gao","authorsParsed":[["Long","Qian",""],["Li","Zhi",""],["Gong","Ran",""],["Wu","Ying Nian",""],["Terzopoulos","Demetri",""],["Gao","Xiaofeng",""]],"versions":[{"version":"v1","created":"Fri, 6 Dec 2024 18:41:16 GMT"}],"updateDate":"2024-12-09","timestamp":1733510476000,"abstract":"  Collaboration is a cornerstone of society. In the real world, human teammates\nmake use of multi-sensory data to tackle challenging tasks in ever-changing\nenvironments. It is essential for embodied agents collaborating in\nvisually-rich environments replete with dynamic interactions to understand\nmulti-modal observations and task specifications. To evaluate the performance\nof generalizable multi-modal collaborative agents, we present TeamCraft, a\nmulti-modal multi-agent benchmark built on top of the open-world video game\nMinecraft. The benchmark features 55,000 task variants specified by multi-modal\nprompts, procedurally-generated expert demonstrations for imitation learning,\nand carefully designed protocols to evaluate model generalization capabilities.\nWe also perform extensive analyses to better understand the limitations and\nstrengths of existing approaches. Our results indicate that existing models\ncontinue to face significant challenges in generalizing to novel goals, scenes,\nand unseen numbers of agents. These findings underscore the need for further\nresearch in this area. The TeamCraft platform and dataset are publicly\navailable at https://github.com/teamcraft-bench/teamcraft.\n","subjects":["Computer Science/Artificial Intelligence","Computer Science/Computation and Language","Computer Science/Computer Vision and Pattern Recognition","Computer Science/Multiagent Systems"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"eEnLH9LgdXDai1qqplohybo6ZRINDIMQuUsmPuoOYpY","pdfSize":"43962872"}