{
  "id": "2412.12746",
  "title": "EmbedFuzz: High Speed Fuzzing Through Transplantation",
  "authors": "Florian Hofhammer and Qinying Wang and Atri Bhattacharyya and Majid\n  Salehi and Bruno Crispo and Manuel Egele and Mathias Payer and Marcel Busch",
  "authorsParsed": [
    [
      "Hofhammer",
      "Florian",
      ""
    ],
    [
      "Wang",
      "Qinying",
      ""
    ],
    [
      "Bhattacharyya",
      "Atri",
      ""
    ],
    [
      "Salehi",
      "Majid",
      ""
    ],
    [
      "Crispo",
      "Bruno",
      ""
    ],
    [
      "Egele",
      "Manuel",
      ""
    ],
    [
      "Payer",
      "Mathias",
      ""
    ],
    [
      "Busch",
      "Marcel",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 10:09:55 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734430195000,
  "abstract": "  Dynamic analysis and especially fuzzing are challenging tasks for embedded\nfirmware running on modern low-end Microcontroller Units (MCUs) due to\nperformance overheads from instruction emulation, the difficulty of emulating\nthe vast space of available peripherals, and low availability of open-source\nembedded firmware. Consequently, efficient security testing of MCU firmware has\nproved to be a resource- and engineering-heavy endeavor.\n  EmbedFuzz introduces an efficient end-to-end fuzzing framework for MCU\nfirmware. Our novel firmware transplantation technique converts binary MCU\nfirmware to a functionally equivalent and fuzzing-enhanced version of the\nfirmware which executes on a compatible high-end device at native performance.\nBesides the performance gains, our system enables advanced introspection\ncapabilities based on tooling for typical Linux user space processes, thus\nsimplifying analysis of crashes and bug triaging. In our evaluation against\nstate-of-the-art MCU fuzzers, EmbedFuzz exhibits up to eight-fold fuzzing\nthroughput while consuming at most a fourth of the energy thanks to its native\nexecution.\n",
  "subjects": [
    "Computer Science/Cryptography and Security"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "TIMICmmx_caajmC9iCbFkVfXwektnYpRd7XKpZLek28",
  "pdfSize": "1265725"
}