{
  "id": "2412.18488",
  "title": "A Survey on the Principles of Persuasion as a Social Engineering\n  Strategy in Phishing",
  "authors": "Kalam Khadka, Abu Barkat Ullah, Wanli Ma and Elisa Martinez Marroquin",
  "authorsParsed": [
    [
      "Khadka",
      "Kalam",
      ""
    ],
    [
      "Ullah",
      "Abu Barkat",
      ""
    ],
    [
      "Ma",
      "Wanli",
      ""
    ],
    [
      "Marroquin",
      "Elisa Martinez",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 24 Dec 2024 15:19:36 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1735053576000,
  "abstract": "  Research shows that phishing emails often utilize persuasion techniques, such\nas social proof, liking, consistency, authority, scarcity, and reciprocity to\ngain trust to obtain sensitive information or maliciously infect devices. The\nlink between principles of persuasion and social engineering attacks,\nparticularly in phishing email attacks, is an important topic in cyber security\nas they are the common and effective method used by cybercriminals to obtain\nsensitive information or access computer systems. This survey paper concluded\nthat spear phishing, a targeted form of phishing, has been found to be\nspecifically effective as attackers can tailor their messages to the specific\ncharacteristics, interests, and vulnerabilities of their targets. Understanding\nthe uses of the principles of persuasion in spear phishing is key to the\neffective defence against it and eventually its elimination. This survey paper\nsystematically summarizes and presents the current state of the art in\nunderstanding the use of principles of persuasion in phishing. Through a\nsystematic review of the existing literature, this survey paper identifies a\nsignificant gap in the understanding of the impact of principles of persuasion\nas a social engineering strategy in phishing attacks and highlights the need\nfor further research in this area.\n",
  "subjects": [
    "Computer Science/Cryptography and Security",
    "Computer Science/Computers and Society",
    "Computer Science/Human-Computer Interaction"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "SQE_GfcUU363u-i6-PBYuIuzMLeLXFEHDaLfu7PCgqU",
  "pdfSize": "219341"
}