{
  "id": "2412.10219",
  "title": "Learning Complex Non-Rigid Image Edits from Multimodal Conditioning",
  "authors": "Nikolai Warner, Jack Kolb, Meera Hahn, Vighnesh Birodkar, Jonathan\n  Huang, Irfan Essa",
  "authorsParsed": [
    [
      "Warner",
      "Nikolai",
      ""
    ],
    [
      "Kolb",
      "Jack",
      ""
    ],
    [
      "Hahn",
      "Meera",
      ""
    ],
    [
      "Birodkar",
      "Vighnesh",
      ""
    ],
    [
      "Huang",
      "Jonathan",
      ""
    ],
    [
      "Essa",
      "Irfan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 15:41:08 GMT"
    }
  ],
  "updateDate": "2024-12-16",
  "timestamp": 1734104468000,
  "abstract": "  In this paper we focus on inserting a given human (specifically, a single\nimage of a person) into a novel scene. Our method, which builds on top of\nStable Diffusion, yields natural looking images while being highly controllable\nwith text and pose. To accomplish this we need to train on pairs of images, the\nfirst a reference image with the person, the second a \"target image\" showing\nthe same person (with a different pose and possibly in a different background).\nAdditionally we require a text caption describing the new pose relative to that\nin the reference image. In this paper we present a novel dataset following this\ncriteria, which we create using pairs of frames from human-centric and\naction-rich videos and employing a multimodal LLM to automatically summarize\nthe difference in human pose for the text captions. We demonstrate that\nidentity preservation is a more challenging task in scenes \"in-the-wild\", and\nespecially scenes where there is an interaction between persons and objects.\nCombining the weak supervision from noisy captions, with robust 2D pose\nimproves the quality of person-object interactions.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "oDZMVtagan8HkYXXTRElbTwlGb1vXwmcs1EgBwNeF-Q",
  "pdfSize": "23755782"
}