{
  "id": "2412.15641",
  "title": "Composite asymmetric dark matter with a dark photon portal:\n  Multimessenger tests",
  "authors": "Saikat Das, Ayuki Kamada, Takumi Kuwahara, Kohta Murase, Deheng Song",
  "authorsParsed": [
    [
      "Das",
      "Saikat",
      ""
    ],
    [
      "Kamada",
      "Ayuki",
      ""
    ],
    [
      "Kuwahara",
      "Takumi",
      ""
    ],
    [
      "Murase",
      "Kohta",
      ""
    ],
    [
      "Song",
      "Deheng",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 07:57:48 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734681468000,
  "abstract": "  Composite asymmetric dark matter (ADM) is the framework that naturally\nexplains the coincidence of the baryon density and the dark matter density of\nthe Universe. Through a portal interaction sharing particle-antiparticle\nasymmetries in the Standard Model and dark sectors, dark matter particles,\nwhich are dark-sector counterparts of baryons, can decay into antineutrinos and\ndark-sector counterparts of mesons (dark mesons) or dark photon. Subsequent\ncascade decay of the dark mesons and the dark photon can also provide\nelectromagnetic fluxes at late times of the Universe. We derive constraints on\nthe lifetime of dark matter decay in the composite ADM scenario from the\nastrophysical observations of the $e^+$, $e^-$, and $\\gamma$-ray fluxes. The\nconstraints from cosmic-ray positron measurements by AMS-02 are the most\nstringent at $\\gtrsim2$ GeV: a lifetime should be larger than the order of\n$10^{26}$ s, corresponding to the cutoff scale of the portal interaction of\nabout $10^8 \\text{--} 10^9 \\, \\mathrm{GeV}$. We also show the importance of\nneutrino observations with Super-Kamiokande and Hyper-Kamiokande, which give\nconservative bounds.\n",
  "subjects": [
    "Physics/High Energy Physics - Phenomenology",
    "Astrophysics/High Energy Astrophysical Phenomena"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "liPAhKTmXHYPMC2WjkNL72fRQA3cMnIglowvcyJWIr0",
  "pdfSize": "1069337"
}