{"id":"2412.16451","title":"Correcting Large Language Model Behavior via Influence Function","authors":"Han Zhang, Zhuo Zhang, Yi Zhang, Yuanzhao Zhai, Hanyang Peng, Yu Lei,\n  Yue Yu, Hui Wang, Bin Liang, Lin Gui, Ruifeng Xu","authorsParsed":[["Zhang","Han",""],["Zhang","Zhuo",""],["Zhang","Yi",""],["Zhai","Yuanzhao",""],["Peng","Hanyang",""],["Lei","Yu",""],["Yu","Yue",""],["Wang","Hui",""],["Liang","Bin",""],["Gui","Lin",""],["Xu","Ruifeng",""]],"versions":[{"version":"v1","created":"Sat, 21 Dec 2024 02:50:08 GMT"}],"updateDate":"2024-12-24","timestamp":1734749408000,"abstract":"  Recent advancements in AI alignment techniques have significantly improved\nthe alignment of large language models (LLMs) with static human preferences.\nHowever, the dynamic nature of human preferences can render some prior training\ndata outdated or even erroneous, ultimately causing LLMs to deviate from\ncontemporary human preferences and societal norms. Existing methodologies,\nwhether they involve the curation of new data for continual alignment or the\nmanual correction of outdated data for re-alignment, demand costly human\nresources. To address this challenge, we propose a novel approach, Large\nLanguage Model Behavior Correction with Influence Function Recall and\nPost-Training (LANCET), which requires no human involvement. LANCET consists of\ntwo phases: (1) using influence functions to identify the training data that\nsignificantly impact undesirable model outputs, and (2) applying an Influence\nfunction-driven Bregman Optimization (IBO) technique to adjust the model's\nbehavior based on these influence distributions. Our experiments demonstrate\nthat LANCET effectively and efficiently correct inappropriate behaviors of\nLLMs. Furthermore, LANCET can outperform methods that rely on collecting human\npreferences, and it enhances the interpretability of learning human preferences\nwithin LLMs.\n","subjects":["Computer Science/Machine Learning","Computer Science/Artificial Intelligence","Computer Science/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"FGbCMI9yO2ZpBCYkSkJqiHYVEENKSTwyI8jGiURCkUg","pdfSize":"979197"}