{"id":"2412.08478","title":"ECSeptional DNS Data: Evaluating Nameserver ECS Deployments with\n  Response-Aware Scanning","authors":"Patrick Sattler, Johannes Zirngibl, Fahad Hilal, Oliver Gasser, Kevin\n  Vermeulen, Georg Carle, Mattijs Jonker","authorsParsed":[["Sattler","Patrick",""],["Zirngibl","Johannes",""],["Hilal","Fahad",""],["Gasser","Oliver",""],["Vermeulen","Kevin",""],["Carle","Georg",""],["Jonker","Mattijs",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 15:45:44 GMT"}],"updateDate":"2024-12-12","timestamp":1733931944000,"abstract":"  DNS is one of the cornerstones of the Internet. Nowadays, a substantial\nfraction of DNS queries are handled by public resolvers (e.g., Google Public\nDNS and Cisco's OpenDNS) rather than ISP nameservers. This behavior makes it\ndifficult for authoritative nameservers to provide answers based on the\nrequesting resolver. The impact is especially important for entities that make\nclient origin inferences to perform DNS-based load balancing (e.g., CDNS). The\nEDNS0 Client Subnet (ECS) option adds the client's IP prefix to DNS queries,\nwhich allows authoritative nameservers to provide prefix-based responses. In\nthis study, we introduce a new method for conducting ECS scans, which provides\ninsights into ECS behavior and significantly reduces the required number of\nqueries by up to 97% compared to state-of-the-art techniques. Our approach is\nalso the first to facilitate ECS scans for IPv6. We conduct a comprehensive\nevaluation of the ECS landscape, examining the usage and implementation of ECS\nacross various services. Overall, 53% of all nameservers support prefix-based\nresponses. Furthermore, we find that Google nameservers do not comply with the\nGoogle Public DNS guidelines. Lastly, we plan to make our tool, and data\npublicly available to foster further research in the area.\n","subjects":["Computer Science/Networking and Internet Architecture"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"92BlQCFXlG44A0tXO1nrrSAkgFGl9jUwjYqLHhsHTBk","pdfSize":"930517"}