{
  "id": "2412.13709",
  "title": "Physics-Based Adversarial Attack on Near-Infrared Human Detector for\n  Nighttime Surveillance Camera Systems",
  "authors": "Muyao Niu, Zhuoxiao Li, Yifan Zhan, Huy H. Nguyen, Isao Echizen,\n  Yinqiang Zheng",
  "authorsParsed": [
    [
      "Niu",
      "Muyao",
      ""
    ],
    [
      "Li",
      "Zhuoxiao",
      ""
    ],
    [
      "Zhan",
      "Yifan",
      ""
    ],
    [
      "Nguyen",
      "Huy H.",
      ""
    ],
    [
      "Echizen",
      "Isao",
      ""
    ],
    [
      "Zheng",
      "Yinqiang",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 10:51:59 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734519119000,
  "abstract": "  Many surveillance cameras switch between daytime and nighttime modes based on\nilluminance levels. During the day, the camera records ordinary RGB images\nthrough an enabled IR-cut filter. At night, the filter is disabled to capture\nnear-infrared (NIR) light emitted from NIR LEDs typically mounted around the\nlens. While RGB-based AI algorithm vulnerabilities have been widely reported,\nthe vulnerabilities of NIR-based AI have rarely been investigated. In this\npaper, we identify fundamental vulnerabilities in NIR-based image understanding\ncaused by color and texture loss due to the intrinsic characteristics of\nclothes' reflectance and cameras' spectral sensitivity in the NIR range. We\nfurther show that the nearly co-located configuration of illuminants and\ncameras in existing surveillance systems facilitates concealing and fully\npassive attacks in the physical world. Specifically, we demonstrate how\nretro-reflective and insulation plastic tapes can manipulate the intensity\ndistribution of NIR images. We showcase an attack on the YOLO-based human\ndetector using binary patterns designed in the digital space (via black-box\nquery and searching) and then physically realized using tapes pasted onto\nclothes. Our attack highlights significant reliability concerns for nighttime\nsurveillance systems, which are intended to enhance security. Codes Available:\nhttps://github.com/MyNiuuu/AdvNIR\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "9A1qLOnz1HHCLc_Rn9p9KfuJ5USYyeBX2AvdgcOJYdk",
  "pdfSize": "14498176"
}