{
  "id": "2412.17240",
  "title": "Rethinking Cancer Gene Identification through Graph Anomaly Analysis",
  "authors": "Yilong Zang, Lingfei Ren, Yue Li, Zhikang Wang, David Antony Selby,\n  Zheng Wang, Sebastian Josef Vollmer, Hongzhi Yin, Jiangning Song, Junhang Wu",
  "authorsParsed": [
    [
      "Zang",
      "Yilong",
      ""
    ],
    [
      "Ren",
      "Lingfei",
      ""
    ],
    [
      "Li",
      "Yue",
      ""
    ],
    [
      "Wang",
      "Zhikang",
      ""
    ],
    [
      "Selby",
      "David Antony",
      ""
    ],
    [
      "Wang",
      "Zheng",
      ""
    ],
    [
      "Vollmer",
      "Sebastian Josef",
      ""
    ],
    [
      "Yin",
      "Hongzhi",
      ""
    ],
    [
      "Song",
      "Jiangning",
      ""
    ],
    [
      "Wu",
      "Junhang",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 03:21:24 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734924084000,
  "abstract": "  Graph neural networks (GNNs) have shown promise in integrating\nprotein-protein interaction (PPI) networks for identifying cancer genes in\nrecent studies. However, due to the insufficient modeling of the biological\ninformation in PPI networks, more faithfully depiction of complex protein\ninteraction patterns for cancer genes within the graph structure remains\nlargely unexplored. This study takes a pioneering step toward bridging\nbiological anomalies in protein interactions caused by cancer genes to\nstatistical graph anomaly. We find a unique graph anomaly exhibited by cancer\ngenes, namely weight heterogeneity, which manifests as significantly higher\nvariance in edge weights of cancer gene nodes within the graph. Additionally,\nfrom the spectral perspective, we demonstrate that the weight heterogeneity\ncould lead to the \"flattening out\" of spectral energy, with a concentration\ntowards the extremes of the spectrum. Building on these insights, we propose\nthe HIerarchical-Perspective Graph Neural Network (HIPGNN) that not only\ndetermines spectral energy distribution variations on the spectral perspective,\nbut also perceives detailed protein interaction context on the spatial\nperspective. Extensive experiments are conducted on two reprocessed datasets\nSTRINGdb and CPDB, and the experimental results demonstrate the superiority of\nHIPGNN.\n",
  "subjects": [
    "Computer Science/Computational Engineering, Finance, and Science",
    "Computer Science/Artificial Intelligence",
    "Statistics/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "-I_8D8motOBDm8dCSJ74SO4zODwpOsoFN_IzDaFGbpI",
  "pdfSize": "1508582"
}