{
  "id": "2412.15382",
  "title": "Assessing Students' Understanding of Uncertainty in Undergraduate\n  Physics Laboratory Courses at a Major Canadian University: Longitudinal\n  Results and Misconceptions",
  "authors": "Matheus A. S. Pess\\^oa, Rebecca Brosseau, Benjamin J. Dringoli, Armin\n  Yazdani, Jack Sankey, Thomas Brunner, April Colosimo, Janette Barrington,\n  Kenneth Ragan, Marcy Slapcoff",
  "authorsParsed": [
    [
      "Pessôa",
      "Matheus A. S.",
      ""
    ],
    [
      "Brosseau",
      "Rebecca",
      ""
    ],
    [
      "Dringoli",
      "Benjamin J.",
      ""
    ],
    [
      "Yazdani",
      "Armin",
      ""
    ],
    [
      "Sankey",
      "Jack",
      ""
    ],
    [
      "Brunner",
      "Thomas",
      ""
    ],
    [
      "Colosimo",
      "April",
      ""
    ],
    [
      "Barrington",
      "Janette",
      ""
    ],
    [
      "Ragan",
      "Kenneth",
      ""
    ],
    [
      "Slapcoff",
      "Marcy",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 20:19:47 GMT"
    },
    {
      "version": "v2",
      "created": "Thu, 20 Feb 2025 16:58:32 GMT"
    }
  ],
  "updateDate": "2025-02-21",
  "timestamp": 1734639587000,
  "abstract": "  Over the last five years, McGill University's Office of Science Education\n(OSE) has partnered with faculty members from the Department of Physics to form\nan education working group with the aim of charting the progression of\nstudents' conceptual understanding of uncertainties across their undergraduate\ndegree. The research conducted by this group seeks to provide further insight\ninto both the experimental skill set that students gain through undergraduate\nlaboratory courses and how the department could address noticeable gaps in\nstudent understanding. In this paper, we evaluate the conceptual understanding\nof uncertainty using the Concise Data Processing Assessment (CDPA) instrument.\nFirst, we characterize the physics laboratory curriculum at McGill University\nby evaluating the evolution of CDPA scores across consecutive laboratory\ncourses, and further propose the utilization of this tool for identifying gaps\nin student understanding. Following the analysis of student responses (N=2023),\nwe specifically investigate data collected in second-year courses to better\ndiagnose what student errors can tell us about common misconceptions in\nexperimental physics. This more in-depth research focuses on data collected\nfrom students at the beginning and the end of their first full year of\nexperimental laboratory courses, consisting of two consecutive laboratory\ncourses that build on each other. By the end of the second course, students\nhave engaged with all the material covered in the CDPA test. Interestingly,\nthere have been no changes in CDPA total scores throughout the COVID-19\npandemic. We notice a marked upward shift in student understanding; however,\nthe results indicate that a significant portion of students continue to\nstruggle with uncertainties, basic data analysis, and curve fitting.\n",
  "subjects": [
    "Physics/Physics Education"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "exAJOsT-Ep8VUz-DWViTxL2Mpm8vkUcshYN1v8BNjCc",
  "pdfSize": "965633"
}