{"id":"2412.18189","title":"Toward an Automated, Proactive Safety Warning System Development for\n  Truck Mounted Attenuators in Mobile Work Zones","authors":"Xiang Yu, Linlin Zhang, and Yaw, Adu-Gyamfi","authorsParsed":[["Yu","Xiang",""],["Zhang","Linlin",""],["Yaw","",""],["Adu-Gyamfi","",""]],"versions":[{"version":"v1","created":"Tue, 24 Dec 2024 05:50:45 GMT"}],"updateDate":"2024-12-25","timestamp":1735019445000,"abstract":"  Even though Truck Mounted Attenuators (TMA)/Autonomous Truck Mounted\nAttenuators (ATMA) and traffic control devices are increasingly used in mobile\nwork zones to enhance safety, work zone collisions remain a significant safety\nconcern in the United States. In Missouri, there were 63 TMA-related crashes in\n2023, a 27% increase compared to 2022. Currently, all the signs in the mobile\nwork zones are passive safety measures, relying on drivers' recognition and\nattention. Some distracted drivers may ignore these signs and warnings, raising\nsafety concerns. In this study, we proposed an additional proactive warning\nsystem that could be applied to the TMA/ATMA to improve overall safety. A\nfeasible solution has been demonstrated by integrating a Panoptic Driving\nPerception algorithm into the Robot Operating System (ROS) and applying it to\nthe TMA/ATMA systems. This enables us to alert vehicles on a collision course\nwith the TMA. Our experimental setup, currently conducted in a laboratory\nenvironment with two ROS robots and a desktop GPU, demonstrates the system's\ncapability to calculate real-time distance and speed and activate warning\nsignals. Leveraging ROS's distributed computing capabilities allows for\nflexible system deployment and cost reduction. In future field tests, by\ncombining the stopping sight distance (SSD) standards from the AASHTO Green\nBook, the system enables real-time monitoring of oncoming vehicles and provides\nadditional proactive warnings to enhance the safety of mobile work zones.\n","subjects":["Computer Science/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Km3bfFfrtd-6uqhvyBEBHyMvAZUhZTt7b1uZNnK9Sbs","pdfSize":"7082213"}