{"id":"2412.06044","title":"Cloud Platforms for Developing Generative AI Solutions: A Scoping Review\n  of Tools and Services","authors":"Dhavalkumar Patel, Ganesh Raut, Satya Narayan Cheetirala, Girish N\n  Nadkarni, Robert Freeman, Benjamin S. Glicksberg, Eyal Klang, and Prem\n  Timsina","authorsParsed":[["Patel","Dhavalkumar",""],["Raut","Ganesh",""],["Cheetirala","Satya Narayan",""],["Nadkarni","Girish N",""],["Freeman","Robert",""],["Glicksberg","Benjamin S.",""],["Klang","Eyal",""],["Timsina","Prem",""]],"versions":[{"version":"v1","created":"Sun, 8 Dec 2024 19:49:07 GMT"}],"updateDate":"2024-12-10","timestamp":1733687347000,"abstract":"  Generative AI is transforming enterprise application development by enabling\nmachines to create content, code, and designs. These models, however, demand\nsubstantial computational power and data management. Cloud computing addresses\nthese needs by offering infrastructure to train, deploy, and scale generative\nAI models. This review examines cloud services for generative AI, focusing on\nkey providers like Amazon Web Services (AWS), Microsoft Azure, Google Cloud,\nIBM Cloud, Oracle Cloud, and Alibaba Cloud. It compares their strengths,\nweaknesses, and impact on enterprise growth. We explore the role of\nhigh-performance computing (HPC), serverless architectures, edge computing, and\nstorage in supporting generative AI. We also highlight the significance of data\nmanagement, networking, and AI-specific tools in building and deploying these\nmodels. Additionally, the review addresses security concerns, including data\nprivacy, compliance, and AI model protection. It assesses the performance and\ncost efficiency of various cloud providers and presents case studies from\nhealthcare, finance, and entertainment. We conclude by discussing challenges\nand future directions, such as technical hurdles, vendor lock-in,\nsustainability, and regulatory issues. Put together, this work can serve as a\nguide for practitioners and researchers looking to adopt cloud-based generative\nAI solutions, serving as a valuable guide to navigating the intricacies of this\nevolving field.\n","subjects":["Computer Science/Distributed, Parallel, and Cluster Computing","Computer Science/Artificial Intelligence","Computer Science/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"4uDeIxlObg74k6ZXBd3e8CQLHL2Js5NMcVHkKR7ptKs","pdfSize":"2522938"}