{
  "id": "2412.08207",
  "title": "Measurement-based quantum convolutional neural network for deep learning",
  "authors": "Yifan Sun and Xiangdong Zhang",
  "authorsParsed": [
    [
      "Sun",
      "Yifan",
      ""
    ],
    [
      "Zhang",
      "Xiangdong",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 08:55:07 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733907307000,
  "abstract": "  Recently, quantum convolutional neural networks (QCNNs) are proposed,\nharnessing the power of quantum computing for faster training compared to the\nclassical counterparts. However, this framework for deep learning also relies\non multiple processing layers to capture the representation of data, which\nnecessitates precise dynamical control. Given the current stage of quantum\ncomputing, achieving this level of control at a large scale remains\nchallenging. Here, we propose an alternate approach to implementing QCNNs by\nutilizing cluster states. The training process of the method involves tuning\nthe projection basis of each qubit in cluster states, rather than adjusting the\nparameters of layers of operators in deep quantum circuits. Hence, the whole\nsystem is easier to stabilize by avoiding the complex controls. Leveraging\ntechniques in measurement-based quantum computing, we present an exact cluster\nstate solution to general QCNNs. Followingly, we provide numerical evidence\nthat both quantum and classical data can be learned by measuring cluster\nstates, and a faster convergence of the method is observed. The cluster states\nwe consider in our learning examples are merely square-lattice cluster states,\nwhose implementation at large scale have been reported recently. It indicates\nthat our method has the potential for realizing the advance of quantum deep\nlearning for practical uses.\n",
  "subjects": [
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "-ktzvQEdbD45wOhV5ZrMwyui65Siw1w9b6966hSkoaQ",
  "pdfSize": "1997921"
}