{
  "id": "2412.06299",
  "title": "4D Gaussian Splatting with Scale-aware Residual Field and Adaptive\n  Optimization for Real-time Rendering of Temporally Complex Dynamic Scenes",
  "authors": "Jinbo Yan, Rui Peng, Luyang Tang, Ronggang Wang",
  "authorsParsed": [
    [
      "Yan",
      "Jinbo",
      ""
    ],
    [
      "Peng",
      "Rui",
      ""
    ],
    [
      "Tang",
      "Luyang",
      ""
    ],
    [
      "Wang",
      "Ronggang",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 08:44:19 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733733859000,
  "abstract": "  Reconstructing dynamic scenes from video sequences is a highly promising task\nin the multimedia domain. While previous methods have made progress, they often\nstruggle with slow rendering and managing temporal complexities such as\nsignificant motion and object appearance/disappearance. In this paper, we\npropose SaRO-GS as a novel dynamic scene representation capable of achieving\nreal-time rendering while effectively handling temporal complexities in dynamic\nscenes. To address the issue of slow rendering speed, we adopt a Gaussian\nprimitive-based representation and optimize the Gaussians in 4D space, which\nfacilitates real-time rendering with the assistance of 3D Gaussian Splatting.\nAdditionally, to handle temporally complex dynamic scenes, we introduce a\nScale-aware Residual Field. This field considers the size information of each\nGaussian primitive while encoding its residual feature and aligns with the\nself-splitting behavior of Gaussian primitives. Furthermore, we propose an\nAdaptive Optimization Schedule, which assigns different optimization strategies\nto Gaussian primitives based on their distinct temporal properties, thereby\nexpediting the reconstruction of dynamic regions. Through evaluations on\nmonocular and multi-view datasets, our method has demonstrated state-of-the-art\nperformance. Please see our project page at\nhttps://yjb6.github.io/SaRO-GS.github.io.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Multimedia"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "UsPsH68T-9BOUgCAHswl40Za7pKWA9faeiLi3YtRAIM",
  "pdfSize": "2134139"
}