{"id":"2412.12132","title":"Non-extensive Entropy and Holographic Thermodynamics: Topological\n  Insights","authors":"Saeed Noori Gashti, and B. Pourhassan","authorsParsed":[["Gashti","Saeed Noori",""],["Pourhassan","B.",""]],"versions":[{"version":"v1","created":"Fri, 6 Dec 2024 11:23:18 GMT"}],"updateDate":"2024-12-18","timestamp":1733484198000,"abstract":"  In this paper, we delve into the thermodynamic topology of AdS\nEinstein-Gauss-Bonnet black holes, employing non-extensive entropy formulations\nsuch as Barrow, R\\'enyi, and Sharma-Mittal entropy within two distinct\nframeworks: bulk boundary and restricted phase space (RPS) thermodynamics. Our\nfindings reveal that in the bulk boundary framework, the topological charges,\nare influenced by the free parameters and the Barrow non-extensive parameter\n$(\\delta)$. So, we faced three topological charges $(\\omega = +1, -1, +1)$.\nWhen the parameter $\\delta$ increases to 0.9, the classification changes,\nresulting in two topological charges $(\\omega = +1, -1)$. When $\\delta$ is set\nto zero, the equations reduce to the Bekenstein-Hawking entropy structure,\nyielding consistent results with three topological charges. Additionally,\nsetting the non-extensive parameter $\\lambda$ in R\\'enyi entropy to zero\nincreases the number of topological charges, but the total topological charge\nremains (W = +1). The presence of the R\\'enyi non-extensive parameter alters\nthe topological behavior compared to the Bekenstein-Hawking entropy.\nSharma-Mittal entropy shows different classifications and the various numbers\nof topological charges influenced by the non-extensive parameters $\\alpha$ and\n$\\beta$. When $\\alpha$ and $\\beta$ have values close to each other, three\ntopological charges with a total topological charge $(W = +1)$ are observed.\nVarying one parameter while keeping the other constant significantly changes\nthe topological classification and number of topological charges. In contrast,\nthe RPS framework demonstrates remarkable consistency in topological behavior.\nUnder all conditions and for all free parameters, the topological charge\nremains $(\\omega = +1)$ with the total topological charge $(W = +1)$. This\nuniformity persists even when reduced to Bekenstein-Hawking entropy.\n","subjects":["Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"wR1AGnIdi7nOnc3gL1HaqfIfrFmRz8Uw4MVpl3mM8cs","pdfSize":"2661392"}