{"id":"2412.16611","title":"A Tutorial on Non-Terrestrial Networks: Towards Global and Ubiquitous 6G\n  Connectivity","authors":"Muhammad Ali Jamshed, Aryan Kaushik, Sanaullah Manzoor, Muhammad\n  Zeeshan Shakir, Jaehyup Seong, Mesut Toka, Wonjae Shin, and Malte Schellmann","authorsParsed":[["Jamshed","Muhammad Ali",""],["Kaushik","Aryan",""],["Manzoor","Sanaullah",""],["Shakir","Muhammad Zeeshan",""],["Seong","Jaehyup",""],["Toka","Mesut",""],["Shin","Wonjae",""],["Schellmann","Malte",""]],"versions":[{"version":"v1","created":"Sat, 21 Dec 2024 12:54:59 GMT"}],"updateDate":"2024-12-24","timestamp":1734785699000,"abstract":"  The International Mobile Telecommunications (IMT)-2030 framework recently\nadopted by the International Telecommunication Union Radiocommunication Sector\n(ITU-R) envisions 6G networks to deliver intelligent, seamless connectivity\nthat supports reliable, sustainable, and resilient communications. Recent\ndevelopments in the 3rd Generation Partnership Project (3GPP) Releases 17-19,\nparticularly within the Radio Access Network (RAN)4 working group addressing\nsatellite and cellular spectrum sharing and RAN2 enhancing New Radio (NR)/IoT\nfor NTN, highlight the critical role NTN is set to play in the evolution of 6G\nstandards. The integration of advanced signal processing, edge and cloud\ncomputing, and Deep Reinforcement Learning (DRL) for Low Earth Orbit (LEO)\nsatellites and aerial platforms, such as Uncrewed Aerial Vehicles (UAV) and\nhigh-, medium-, and low-altitude platform stations, has revolutionized the\nconvergence of space, aerial, and Terrestrial Networks (TN). Artificial\nIntelligence (AI)-powered deployments for NTN and NTN-IoT, combined with Next\nGeneration Multiple Access (NGMA) technologies, have dramatically reshaped\nglobal connectivity. This tutorial paper provides a comprehensive exploration\nof emerging NTN-based 6G wireless networks, covering vision, alignment with\n5G-Advanced and 6G standards, key principles, trends, challenges, real-world\napplications, and novel problem solving frameworks. It examines essential\nenabling technologies like AI for NTN (LEO satellites and aerial platforms),\nDRL, edge computing for NTN, AI for NTN trajectory optimization, Reconfigurable\nIntelligent Surfaces (RIS)-enhanced NTN, and robust\nMultiple-Input-Multiple-Output (MIMO) beamforming. Furthermore, it addresses\ninterference management through NGMA, including Rate-Splitting Multiple Access\n(RSMA) for NTN, and the use of aerial platforms for access, relay, and\nfronthaul/backhaul connectivity.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computer Science/Information Theory","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"WgulFOtULda5zk9Nm7tRhiB7OCo3LZmGsKia5fHxK8g","pdfSize":"4519181"}