{"id":"2412.17688","title":"Refining the Two-Band Model for Highly Compensated Semimetals Using\n  Thermoelectric Coefficients","authors":"Ian Leahy, Andrew Treglia, Brian Skinner, Minhyea Lee","authorsParsed":[["Leahy","Ian",""],["Treglia","Andrew",""],["Skinner","Brian",""],["Lee","Minhyea",""]],"versions":[{"version":"v1","created":"Mon, 23 Dec 2024 16:13:40 GMT"}],"updateDate":"2024-12-24","timestamp":1734970420000,"abstract":"  In studying compensated semimetals, the two-band model has proven extremely\nuseful to capture electrical conductivities with intuitive parameters of\ndensities and mobilities of electron-like and hole-like carriers, as well as to\npredict their magnetic field dependence. Yet, it rarely offers practical\ninsight into magneto-thermoelectric properties. Here, we report the field\ndependence of thermoelectric (TE) coefficients in a highly compensated\nsemimetal NbSb$_2$, where we find the Seebeck ($S_{xx}$) and Nernst ($S_{xy}$)\ncoefficients increase quadratically and linearly with field, respectively. Such\nfield dependences were predicted by the semiclassical Boltzmann transport\ntheory and the Mott relation of the two-band system, and they are realized when\ntwo conditions are simultaneously met [1]: the multiple of cyclotron frequency\n($\\omega_c$) and relaxation time ($\\tau$) is much larger than one,\n$\\omega_c\\tau \\gg 1$ and the tangent of Hall angle ($\\theta_H$) is much smaller\nthan one, $\\tan\\theta_H \\ll 1$. We use the relation between two carrier\ndensities $n_e$ (electron-like) and $n_h$ (hole-like) derived from the field\ndependence of the TE coefficients, to refine the two-band model fittings. The\ncompensation factor ($\\frac{|\\Delta n|}{n_e}$, where $\\Delta n = n_e-n_h$) is\nfound two orders of magnitude smaller than what was found in the unrestricted\nfitting and hence the larger saturation field scale for magnetoresistance.\nWithin the framework of the semiclassical theory, we deduce that the\nthermoelectric Hall angle $\\tan\\theta_{\\gamma} = \\frac{S_{xy}}{S_{xx}}$ can be\nexpressed $\\big(\\frac{|\\Delta n|}{n_e}\\times \\omega_c\\tau\\big)^{-1}$. Our\nfindings offer crucial insights not only for identifying the empirical\nconditions for the field-induced enhancement of the TE performance but also for\nengineering efficient thermoelectric devices based on semimetallic materials.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"vg7gIbk0gtriw6kdDfCDGTiOVpNLM0elq1TlCKLAKMc","pdfSize":"3278684"}