{
  "id": "2412.01412",
  "title": "Optimizing Microservices Placement in the Cloud-to-Edge Continuum: A\n  Comparative Analysis of App and Service Based Approaches",
  "authors": "Miguel Mota-Cruz, Jo\\~ao H Santos, Jos\\'e F Macedo, Karima Velasquez,\n  David Perez Abreu",
  "authorsParsed": [
    [
      "Mota-Cruz",
      "Miguel",
      ""
    ],
    [
      "Santos",
      "João H",
      ""
    ],
    [
      "Macedo",
      "José F",
      ""
    ],
    [
      "Velasquez",
      "Karima",
      ""
    ],
    [
      "Abreu",
      "David Perez",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 11:55:37 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733140537000,
  "abstract": "  In the ever-evolving landscape of computing, the advent of edge and fog\ncomputing has revolutionized data processing by bringing it closer to\nend-users. While cloud computing offers numerous advantages, including\nmobility, flexibility and scalability, it introduces challenges such as\nlatency. Fog and edge computing emerge as complementary solutions, bridging the\ngap and enhancing services' proximity to users. The pivotal challenge addressed\nin this paper revolves around optimizing the placement of application\nmicroservices to minimize latency in the cloud-to-edge continuum, where a\nproper node selection may influence the app's performance. Therefore, this task\ngains complexity due to the paradigm shift from monolithic to\nmicroservices-based architectures. Two distinct placement approaches, app-based\nand service-based, are compared through four different placement algorithms\nbased on criteria such as link latency, node resources, and gateway proximity.\nApp-based allocates all the services of one app sequentially, while\nservice-based allocates one service of each app at a time. The study, conducted\nusing YAFS (Yet Another Fog Simulator), evaluates the impact of these\napproaches on latency and load balance. The findings consistently confirm the\nhypothesis that strategies utilizing a service-based approach outperformed or\nperformed equally well compared to app-based approaches, offering valuable\ninsights into trade-offs and performance differences among the algorithms and\neach approach in the context of efficient microservices placement in\ncloud-to-edge environments.\n",
  "subjects": [
    "Computer Science/Networking and Internet Architecture"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "Hz31JAmIFb1TektYXoyzepsHF-Zmy17OJjA7uoqo1dU",
  "pdfSize": "267556"
}