{
  "id": "2412.19273",
  "title": "Anvendelse av kunstig intelligens (KI) i Norge i norsk offentlig sektor\n  2024",
  "authors": "John Krogstie",
  "authorsParsed": [
    [
      "Krogstie",
      "John",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 26 Dec 2024 16:28:49 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735230529000,
  "abstract": "  There are great expectations for the use of AI in Norway. On the other hand,\nit is reported that the adoption of AI in Norway is slower than expected in\nboth the private and public sectors. Using responses from NOKIOS Technology\nRadar 2017-2021, IT in Practice surveys conducted by Ramboll in 2021-2024, as\nwell as another national survey as part of a five-year cycle, this article\nlooks at reported and planned use of AI with a focus on local (municipalities)\nand national government agencies. IT in practice is distributed to a large\nnumber of Norwegian public agencies, with a response rate of over 5o percent.\nThe most recent data (2024) presented in this article is based on responses\nfrom 335 public organizations, with 237 municipalities, and 98 public\norganizations at the national or regional level. The survey confirms that the\nuse of AI is still at an early stage, although expectations are high for future\nuse.\n  --\n  Det er store forventninger til bruk av KI i Norge. P{\\aa} den annen side\nrapporteres det at adopsjonen av KI i Norge g{\\aa}r tregere enn forventet\nb{\\aa}de i privat og offentlig sektor. Ved hjelp av svar fra NOKIOS\nteknologiradar 2017-2021, IT i Praksis unders{\\o}kelser utf{\\o}rt av Ramb{\\o}ll\ni 2021-2024, samt en annen nasjonal unders{\\o}kelse som en del av en\nfem{\\aa}rig syklus, ser vi i denne artikkelen p{\\aa} rapportert og planlagt\nbruk av KI med fokus p{\\aa} lokale (kommuner) og nasjonale offentlige etater.\nIT i praksis distribueres til en lang rekke norske offentlige virksomheter, med\nen svarprosent p{\\aa} over 50 prosent. De nyeste dataene (2024) presentert i\ndenne artikkelen er basert p{\\aa} svar fra 335 offentlige organisasjoner, med\n237 kommuner, og 98 offentlige organisasjoner p{\\aa} nasjonalt eller regionalt\nniv{\\aa}. Unders{\\o}kelsen bekrefter at bruken av KI fortsatt er p{\\aa} et\ntidlig stadium, selv om forventningene er h{\\o}ye til fremtidig bruk.\n",
  "subjects": [
    "Computer Science/Computers and Society"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "qWCo-kX6tHlDUAnvLaJLbWpC6bOAzMuk8wqrZ_hxOog",
  "pdfSize": "1022118"
}