{
  "id": "2412.15841",
  "title": "Geographic distribution of the global agricultural workforce every\n  decade for the years 2000-2100",
  "authors": "Naia Ormaza-Zulueta, Steve Miller, Zia Mehrabi",
  "authorsParsed": [
    [
      "Ormaza-Zulueta",
      "Naia",
      ""
    ],
    [
      "Miller",
      "Steve",
      ""
    ],
    [
      "Mehrabi",
      "Zia",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 12:32:41 GMT"
    },
    {
      "version": "v2",
      "created": "Mon, 23 Dec 2024 10:57:20 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734697961000,
  "abstract": "  Agricultural workers play a vital role in the global economy and food\nsecurity by cultivating, transporting, and processing food for populations\nworldwide. Despite their importance, detailed spatial data on the global\nagricultural workforce have remained scarce. Here, we present a new gridded\ndataset that maps the global distribution of agricultural workers for every\ndecade over the years 2000-2100, distributed at 0.083$\\times$0.083 degrees\nresolution, roughly $\\sim$10km$\\times$10km at the Equator. The dataset is\ndeveloped using an empirical modeling framework relying on generalized additive\nmixed models (GAMMs) that integrate socioeconomic variables, including gross\ndomestic product per capita, total population, rural population size, and\nagricultural land use. The predictions are consistent with Shared\nSocio-economic Pathways and we distribute full time series data for all SSPs 1\nto 5. This dataset opens new avenues for future research on labour force\nhealth, productivity and risk, and could be very useful for developing\ninformed, forward-looking strategies that address the challenges of climate\nresilience in agriculture. The dataset and code for reproducing it are\navailable for the user community [publicly available on publication at DOI:\n10.5281/zenodo.14443333].\n",
  "subjects": [
    "Statistics/Applications"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "hlRIN9V9kAZJb0IT434Dhr9y1HYoFvxYbnhtRr92JZQ",
  "pdfSize": "35037138"
}