{"id":"2412.20804","title":"DELA: A Novel Approach for Detecting Errors Induced by Large Atomic\n  Condition Numbers","authors":"Youshuai Tan, Zhanwei Zhang, Jinfu Chen, Zishuo Ding, Jifeng Xuan,\n  Weiyi Shang","authorsParsed":[["Tan","Youshuai",""],["Zhang","Zhanwei",""],["Chen","Jinfu",""],["Ding","Zishuo",""],["Xuan","Jifeng",""],["Shang","Weiyi",""]],"versions":[{"version":"v1","created":"Mon, 30 Dec 2024 08:56:46 GMT"},{"version":"v2","created":"Fri, 3 Jan 2025 02:19:41 GMT"}],"updateDate":"2025-01-06","timestamp":1735549006000,"abstract":"  Numerical programs form the foundation of modern science and engineering,\nproviding essential solutions to complex mathematical problems. Therefore,\nerrors in numerical results would lead to harmful consequences, especially in\nsafety-critical applications. Since only a few inputs may lead to substantial\nerrors for numerical programs, it is essential to determine whether a given\ninput could result in a significant error. Existing researchers tend to use the\nresults of high-precision programs to assess whether there is a substantial\nerror, which introduces three main challenges: difficulty of implementation,\nexistence of potential faults in the detection of numerical errors, and long\nexecution time.\n  To address these limitations, we propose a novel approach named DELA. Our\napproach is based on the observation that most numerical errors stem from large\ncondition numbers in atomic operations (such as subtraction), which then\npropagate and accumulate. DELA injects small perturbations into the results of\nindividual atomic operations within the program and compares the outcomes of\nthe original program with the perturbed version to detect errors. We evaluate\nDELA with datasets from ATOMU and HSED, as well as data from a complex linear\nsystem-solving program. Experimental results demonstrate that we can detect all\nthe significant errors that were reported by prior research. DELA shows strong\nalignment with high-precision programs of ATOMU and HSED, with average Pearson\nand Spearman correlations of 0.86 and 0.61. Additionally, DELA effectively\ndetects significant errors in complex programs, achieving correlation scores of\n0.9763 and 0.8993. More importantly, in experiments with ATOMU and HSED, DELA's\nperturbed programs run within only 0.13% of the time needed by high-precision\nversions; while for the linear system-solving programs, DELA is 73.46 times\nfaster than the high-precision programs.\n","subjects":["Computer Science/Software Engineering"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"sroz8w9C9xIfXQVvsoeEjowHr_ji1MdvHp3eM0gmpqE","pdfSize":"1154975"}