{
  "id": "2412.17440",
  "title": "The Role of XAI in Transforming Aeronautics and Aerospace Systems",
  "authors": "Francisco Javier Cantero Zorita, Mikel Galafate, Javier M. Moguerza,\n  Isaac Mart\\'in de Diego, M. Teresa Gonzalez, and Gema Gutierrez Pe\\~na",
  "authorsParsed": [
    [
      "Zorita",
      "Francisco Javier Cantero",
      ""
    ],
    [
      "Galafate",
      "Mikel",
      ""
    ],
    [
      "Moguerza",
      "Javier M.",
      ""
    ],
    [
      "de Diego",
      "Isaac Martín",
      ""
    ],
    [
      "Gonzalez",
      "M. Teresa",
      ""
    ],
    [
      "Peña",
      "Gema Gutierrez",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 10:02:17 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734948137000,
  "abstract": "  Recent advancements in Artificial Intelligence (AI) have transformed\ndecision-making in aeronautics and aerospace. These advancements in AI have\nbrought with them the need to understand the reasons behind the predictions\ngenerated by AI systems and models, particularly by professionals in these\nsectors. In this context, the emergence of eXplainable Artificial Intelligence\n(XAI) has helped bridge the gap between professionals in the aeronautical and\naerospace sectors and the AI systems and models they work with. For this\nreason, this paper provides a review of the concept of XAI is carried out\ndefining the term and the objectives it aims to achieve. Additionally, the\npaper discusses the types of models defined within it and the properties these\nmodels must fulfill to be considered transparent, as well as the post-hoc\ntechniques used to understand AI systems and models after their training.\nFinally, various application areas within the aeronautical and aerospace\nsectors will be presented, highlighting how XAI is used in these fields to help\nprofessionals understand the functioning of AI systems and models.\n",
  "subjects": [
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "zQ6v7CrAhdChaeE89-5MOqlwj_A_-wP5pIRovw_1pAA",
  "pdfSize": "260074"
}