{
  "id": "2412.12360",
  "title": "A flexible framework for large-scale FDTD simulations: open-source\n  inverse design for 3D nanostructures",
  "authors": "Yannik Mahlau and Frederik Schubert and Konrad Bethmann and Reinhard\n  Caspary and Antonio Cal\\`a Lesina and Marco Munderloh and J\\\"orn Ostermann\n  and Bodo Rosenhahn",
  "authorsParsed": [
    [
      "Mahlau",
      "Yannik",
      ""
    ],
    [
      "Schubert",
      "Frederik",
      ""
    ],
    [
      "Bethmann",
      "Konrad",
      ""
    ],
    [
      "Caspary",
      "Reinhard",
      ""
    ],
    [
      "Lesina",
      "Antonio Calà",
      ""
    ],
    [
      "Munderloh",
      "Marco",
      ""
    ],
    [
      "Ostermann",
      "Jörn",
      ""
    ],
    [
      "Rosenhahn",
      "Bodo",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 21:17:27 GMT"
    },
    {
      "version": "v2",
      "created": "Thu, 19 Dec 2024 08:57:20 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734383847000,
  "abstract": "  We introduce an efficient open-source python package for the inverse design\nof three-dimensional photonic nanostructures using the Finite-Difference\nTime-Domain (FDTD) method. Leveraging a flexible reverse-mode automatic\ndifferentiation implementation, our software enables gradient-based\noptimization over large simulation volumes. Gradient computation is implemented\nwithin the JAX framework and based on the property of time reversibility in\nMaxwell's equations. This approach significantly reduces computational time and\nmemory requirements compared to traditional FDTD methods. Gradient-based\noptimization facilitates the automatic creation of intricate three-dimensional\nstructures with millions of design parameters, which would be infeasible to\ndesign manually. We demonstrate the scalability of the solver from single to\nmultiple GPUs through several inverse design examples, highlighting its\nrobustness and performance in large-scale photonic simulations. In addition,\nthe package features an object-oriented and user-friendly API that simplifies\nthe specification of materials, sources, and constraints. Specifically, it\nallows for intuitive positioning and sizing of objects in absolute or relative\ncoordinates within the simulation scene. By rapid specification of the desired\ndesign properties and rapid optimization within the given user constraints,\nthis open-source framework aims to accelerate innovation in photonic inverse\ndesign. It yields a powerful and accessible computational tool for researchers,\napplicable in a wide range of use cases, including but not limited to photonic\nwaveguides, active devices, and photonic integrated circuits.\n",
  "subjects": [
    "Physics/Optics",
    "Physics/Computational Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "qfgJY2hw9iRyodEPWrE9yYKfwpPRgA8u8PGAdoWXGe0",
  "pdfSize": "23484808"
}