{
  "id": "2412.05842",
  "title": "DREAM: Domain-agnostic Reverse Engineering Attributes of Black-box Model",
  "authors": "Rongqing Li, Jiaqi Yu, Changsheng Li, Wenhan Luo, Ye Yuan, Guoren Wang",
  "authorsParsed": [
    [
      "Li",
      "Rongqing",
      ""
    ],
    [
      "Yu",
      "Jiaqi",
      ""
    ],
    [
      "Li",
      "Changsheng",
      ""
    ],
    [
      "Luo",
      "Wenhan",
      ""
    ],
    [
      "Yuan",
      "Ye",
      ""
    ],
    [
      "Wang",
      "Guoren",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 8 Dec 2024 07:37:05 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733643425000,
  "abstract": "  Deep learning models are usually black boxes when deployed on machine\nlearning platforms. Prior works have shown that the attributes (e.g., the\nnumber of convolutional layers) of a target black-box model can be exposed\nthrough a sequence of queries. There is a crucial limitation: these works\nassume the training dataset of the target model is known beforehand and\nleverage this dataset for model attribute attack. However, it is difficult to\naccess the training dataset of the target black-box model in reality.\nTherefore, whether the attributes of a target black-box model could be still\nrevealed in this case is doubtful. In this paper, we investigate a new problem\nof black-box reverse engineering, without requiring the availability of the\ntarget model's training dataset. We put forward a general and principled\nframework DREAM, by casting this problem as out-of-distribution (OOD)\ngeneralization. In this way, we can learn a domain-agnostic meta-model to infer\nthe attributes of the target black-box model with unknown training data. This\nmakes our method one of the kinds that can gracefully apply to an arbitrary\ndomain for model attribute reverse engineering with strong generalization\nability. Extensive experimental results demonstrate the superiority of our\nproposed method over the baselines.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "9mCiFOlfFrzCGvbV5AHme0kwgIbFfyj15ZIiO3g2xVw",
  "pdfSize": "2186721"
}