{
  "id": "2412.03674",
  "title": "Performance-driven Computational Design of Multi-terminal\n  Compositionally Graded Alloy Structures using Graphs",
  "authors": "Marshall D. Allen, Vahid Attari, Brent Vela, James Hanagan, Richard\n  Malak, Raymundo Arr\\'oyave",
  "authorsParsed": [
    [
      "Allen",
      "Marshall D.",
      ""
    ],
    [
      "Attari",
      "Vahid",
      ""
    ],
    [
      "Vela",
      "Brent",
      ""
    ],
    [
      "Hanagan",
      "James",
      ""
    ],
    [
      "Malak",
      "Richard",
      ""
    ],
    [
      "Arróyave",
      "Raymundo",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 19:10:28 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733339428000,
  "abstract": "  The spatial control of material placement afforded by metal additive\nmanufacturing (AM) has enabled significant progress in the development and\nimplementation of compositionally graded alloys (CGAs) for spatial property\nvariation in monolithic structures. However, cracking and brittle phase\nformation have hindered CGA development, with limited research extending beyond\nmaterials design to structural design. Notably, the high-dimensional alloy\ndesign space (systems with more than three active elements) remains poorly\nunderstood, specifically for CGAs. As a result, many prior efforts take a\ntrial-and-error approach. Additionally, current structural design methods are\ninadequate for joining dissimilar alloys. In light of these challenges, recent\nwork in graph information modeling and design automation has enabled\ntopological partitioning and analysis of the alloy design space, automated\ndesign of multi-terminal CGAs, and automated conformal mapping of CGAs onto\ncorresponding structural geometries. In comparison, prior gradient design\napproaches are limited to two-terminal CGAs. Here, we integrate these recent\nadvancements, demonstrating a unified performance-driven CGA design approach on\na gas turbine blade with broader application to other material systems and\nengineering structures.\n",
  "subjects": [
    "Condensed Matter/Materials Science"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "CsHFaelzmw3EzIXccZ8p8WgOILO92cLmua2XdUNi1gw",
  "pdfSize": "36066575"
}