{
  "id": "2412.05660",
  "title": "Multimodal Biometric Authentication Using Camera-Based PPG and\n  Fingerprint Fusion",
  "authors": "Xue Xian Zheng, M. M. Ur Rahma, Bilal Taha, Mudassir Masood, Dimitrios\n  Hatzinakos, and Tareq Al-Naffouri",
  "authorsParsed": [
    [
      "Zheng",
      "Xue Xian",
      ""
    ],
    [
      "Rahma",
      "M. M. Ur",
      ""
    ],
    [
      "Taha",
      "Bilal",
      ""
    ],
    [
      "Masood",
      "Mudassir",
      ""
    ],
    [
      "Hatzinakos",
      "Dimitrios",
      ""
    ],
    [
      "Al-Naffouri",
      "Tareq",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 7 Dec 2024 14:09:40 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733580580000,
  "abstract": "  Camera-based photoplethysmography (PPG) obtained from smartphones has shown\ngreat promise for personalized healthcare and secure authentication. This paper\npresents a multimodal biometric system that integrates PPG signals extracted\nfrom videos with fingerprint data to enhance the accuracy of user verification.\nThe system requires users to place their fingertip on the camera lens for a few\nseconds, allowing the capture and processing of unique biometric\ncharacteristics. Our approach employs a neural network with two structured\nstate-space model (SSM) encoders to manage the distinct modalities. Fingerprint\nimages are transformed into pixel sequences, and along with segmented PPG\nwaveforms, they are input into the encoders. A cross-modal attention mechanism\nthen extracts refined feature representations, and a distribution-oriented\ncontrastive loss function aligns these features within a unified latent space.\nExperimental results demonstrate the system's superior performance across\nvarious evaluation metrics in both single-session and dual-session\nauthentication scenarios.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "jcBAGgt761qbV0o-4Ek3Y8ykqFtBXwrsL3mAYhao2Mg",
  "pdfSize": "2612305"
}