{
  "id": "2412.20334",
  "title": "Magnetic Hofstadter cascade in a twisted semiconductor homobilayer",
  "authors": "Benjamin A. Foutty, Aidan P. Reddy, Carlos R. Kometter, Kenji\n  Watanabe, Takashi Taniguchi, Trithep Devakul, Benjamin E. Feldman",
  "authorsParsed": [
    [
      "Foutty",
      "Benjamin A.",
      ""
    ],
    [
      "Reddy",
      "Aidan P.",
      ""
    ],
    [
      "Kometter",
      "Carlos R.",
      ""
    ],
    [
      "Watanabe",
      "Kenji",
      ""
    ],
    [
      "Taniguchi",
      "Takashi",
      ""
    ],
    [
      "Devakul",
      "Trithep",
      ""
    ],
    [
      "Feldman",
      "Benjamin E.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 29 Dec 2024 03:28:52 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735442932000,
  "abstract": "  Transition metal dichalcogenide moir\\'e homobilayers have emerged as a\nplatform in which magnetism, strong correlations, and topology are intertwined.\nIn a large magnetic field, the energetic alignment of states with different\nspin in these systems is dictated by both strong Zeeman splitting and the\nstructure of the Hofstadter's butterfly spectrum, yet the latter has been\ndifficult to probe experimentally. Here we conduct local thermodynamic\nmeasurements of twisted WSe$_2$ homobilayers that reveal a cascade of magnetic\nphase transitions. We understand these transitions as the filling of individual\nHofstadter subbands, allowing us to extract the structure and connectivity of\nthe Hofstadter spectrum of a single spin. The onset of magnetic transitions is\nindependent of twist angle, indicating that the exchange interactions of the\ncomponent layers are only weakly modified by the moir\\'e potential. In\ncontrast, the magnetic transitions are associated with stark changes in the\ninsulating states at commensurate filling. Our work achieves a spin-resolved\nmeasurement of Hofstadter's butterfly despite overlapping states, and it\ndisentangles the role of material and moir\\'e effects on the nature of the\ncorrelated ground states.\n",
  "subjects": [
    "Condensed Matter/Mesoscale and Nanoscale Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "zCCzhsi4b4eYPpciW1_3a1Suj50F6cknI8uC_DkyLdM",
  "pdfSize": "12306809"
}