{"id":"2412.10455","title":"Geo-LLaVA: A Large Multi-Modal Model for Solving Geometry Math Problems\n  with Meta In-Context Learning","authors":"Shihao Xu, Yiyang Luo, Wei Shi","authorsParsed":[["Xu","Shihao",""],["Luo","Yiyang",""],["Shi","Wei",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 07:34:09 GMT"}],"updateDate":"2024-12-17","timestamp":1733988849000,"abstract":"  Geometry mathematics problems pose significant challenges for large language\nmodels (LLMs) because they involve visual elements and spatial reasoning.\nCurrent methods primarily rely on symbolic character awareness to address these\nproblems. Considering geometry problem solving is a relatively nascent field\nwith limited suitable datasets and currently almost no work on solid geometry\nproblem solving, we collect a geometry question-answer dataset by sourcing\ngeometric data from Chinese high school education websites, referred to as\nGeoMath. It contains solid geometry questions and answers with accurate\nreasoning steps as compensation for existing plane geometry datasets.\nAdditionally, we propose a Large Multi-modal Model (LMM) framework named\nGeo-LLaVA, which incorporates retrieval augmentation with supervised\nfine-tuning (SFT) in the training stage, called meta-training, and employs\nin-context learning (ICL) during inference to improve performance. Our\nfine-tuned model with ICL attains the state-of-the-art performance of 65.25%\nand 42.36% on selected questions of the GeoQA dataset and GeoMath dataset\nrespectively with proper inference steps. Notably, our model initially endows\nthe ability to solve solid geometry problems and supports the generation of\nreasonable solid geometry picture descriptions and problem-solving steps. Our\nresearch sets the stage for further exploration of LLMs in multi-modal math\nproblem-solving, particularly in geometry math problems.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Artificial Intelligence","Computer Science/Computational Geometry"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"vkfPRukUD2tsQwB--dNYBWeYLH37PXk4akelEtnfYdE","pdfSize":"924018"}