{"id":"2412.15960","title":"Effective Metric Description of 2+1 Dimensional Quantum Black Holes","authors":"Stefan Hohenegger, Mikolaj Myszkowski, Mattia Damia Paciarini,\n  Francesco Sannino","authorsParsed":[["Hohenegger","Stefan",""],["Myszkowski","Mikolaj",""],["Paciarini","Mattia Damia",""],["Sannino","Francesco",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 14:53:19 GMT"}],"updateDate":"2024-12-23","timestamp":1734706399000,"abstract":"  We develop an effective metric description of 2+1 dimensional black holes\ndescribing deviations from the classical Ba\\~nados-Teitelboim-Zanelli (BTZ)\nblack hole. The latter is a classical 2+1 dimensional rotating black hole with\nconstant negative curvature. The effective metric is constrained by imposing\nthe black hole symmetries and asymptotic classical behavior. The deformed\nmetric is parametrized in terms of a physical quantity that we choose to be a\nphysical distance. The latter can be solved for in three main regions of\ninterest, the one around the horizon, origin, and spatial infinity. The\nfiniteness of physical quantities at the horizon, such as the Ricci and\nKretschmann scalars, leads to universal constraints on the physical parameters\nof the metric around the horizon. This allows us to further derive the general\nform of the corrected Hawking temperature in terms of the physical parameters\nof the effective metric. Assuming that the approach can be generalized to the\ninterior of the black hole, we further develop an effective metric description\nnear the origin. To illustrate the approach, we show how to recast the\ninformation encoded in a specific model of quantum BTZ known as quBTZ black\nhole in terms of the effective metric coefficients.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"VN5NchzWwu3hYSHi9gJl2WSgT9DzhoiAUv46qWZi1Jc","pdfSize":"498688"}