{"id":"2412.09330","title":"Computer-Aided Osteoporosis Diagnosis Using Transfer Learning with\n  Enhanced Features from Stacked Deep Learning Modules","authors":"Ayesha Siddiqua, Rakibul Hasan, Anichur Rahman, Abu Saleh Musa Miah","authorsParsed":[["Siddiqua","Ayesha",""],["Hasan","Rakibul",""],["Rahman","Anichur",""],["Miah","Abu Saleh Musa",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 14:59:10 GMT"}],"updateDate":"2024-12-13","timestamp":1734015550000,"abstract":"  Knee osteoporosis weakens the bone tissue in the knee joint, increasing\nfracture risk. Early detection through X-ray images enables timely intervention\nand improved patient outcomes. While some researchers have focused on\ndiagnosing knee osteoporosis through manual radiology evaluation and\ntraditional machine learning using hand-crafted features, these methods often\nstruggle with performance and efficiency due to reliance on manual feature\nextraction and subjective interpretation. In this study, we propose a\ncomputer-aided diagnosis (CAD) system for knee osteoporosis, combining transfer\nlearning with stacked feature enhancement deep learning blocks. Initially, knee\nX-ray images are preprocessed, and features are extracted using a pre-trained\nConvolutional Neural Network (CNN). These features are then enhanced through\nfive sequential Conv-RELU-MaxPooling blocks. The Conv2D layers detect low-level\nfeatures, while the ReLU activations introduce non-linearity, allowing the\nnetwork to learn complex patterns. MaxPooling layers down-sample the features,\nretaining the most important spatial information. This sequential processing\nenables the model to capture complex, high-level features related to bone\nstructure, joint deformation, and osteoporotic markers. The enhanced features\nare passed through a classification module to differentiate between healthy and\nosteoporotic knee conditions. Extensive experiments on three individual\ndatasets and a combined dataset demonstrate that our model achieves 97.32%,\n98.24%, 97.27%, and 98.00% accuracy for OKX Kaggle Binary, KXO-Mendeley\nMulti-Class, OKX Kaggle Multi-Class, and the combined dataset, respectively,\nshowing an improvement of around 2% over existing methods.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"h-_MuFuH82OWCDuKQOw6OWZ0EQtIHbkl9OtmB57-b3k","pdfSize":"4674355"}