{"id":"2412.15072","title":"ScamChatBot: An End-to-End Analysis of Fake Account Recovery on Social\n  Media via Chatbots","authors":"Bhupendra Acharya, Dominik Sautter, Muhammad Saad and Thorsten Holz","authorsParsed":[["Acharya","Bhupendra",""],["Sautter","Dominik",""],["Saad","Muhammad",""],["Holz","Thorsten",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 17:22:35 GMT"}],"updateDate":"2024-12-20","timestamp":1734628955000,"abstract":"  Social media platforms have become the hubs for various user interactions\ncovering a wide range of needs, including technical support and services\nrelated to brands, products, or user accounts. Unfortunately, there has been a\nrecent surge in scammers impersonating official services and providing fake\ntechnical support to users through these platforms. In this study, we focus on\nscammers engaging in such fake technical support to target users who are having\nproblems recovering their accounts. More specifically, we focus on users\nencountering access problems with social media profiles (e.g., on platforms\nsuch as Facebook, Instagram, Gmail, and X) and cryptocurrency wallets. The main\ncontribution of our work is the development of an automated system that\ninteracts with scammers via a chatbot that mimics different personas. By\ninitiating decoy interactions (e.g., through deceptive tweets), we have enticed\nscammers to interact with our system so that we can analyze their modus\noperandi. Our results show that scammers employ many social media profiles\nasking users to contact them via a few communication channels. Using a large\nlanguage model (LLM), our chatbot had conversations with 450 scammers and\nprovided valuable insights into their tactics and, most importantly, their\npayment profiles. This automated approach highlights how scammers use a variety\nof strategies, including role-playing, to trick victims into disclosing\npersonal or financial information. With this study, we lay the foundation for\nusing automated chat-based interactions with scammers to detect and study\nfraudulent activities at scale in an automated way.\n","subjects":["Computer Science/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"zFMTMdCcJWvrA5jSle2h4qqJpDyIO45j6WHngX8GD28","pdfSize":"765558"}