{
  "id": "2412.13612",
  "title": "Are LLMs Good Literature Review Writers? Evaluating the Literature\n  Review Writing Ability of Large Language Models",
  "authors": "Xuemei Tang, Xufeng Duan, Zhenguang G. Cai",
  "authorsParsed": [
    [
      "Tang",
      "Xuemei",
      ""
    ],
    [
      "Duan",
      "Xufeng",
      ""
    ],
    [
      "Cai",
      "Zhenguang G.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 08:42:25 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 14 Jan 2025 14:16:45 GMT"
    }
  ],
  "updateDate": "2025-01-15",
  "timestamp": 1734511345000,
  "abstract": "  The literature review is a crucial form of academic writing that involves\ncomplex processes of literature collection, organization, and summarization.\nThe emergence of large language models (LLMs) has introduced promising tools to\nautomate these processes. However, their actual capabilities in writing\ncomprehensive literature reviews remain underexplored, such as whether they can\ngenerate accurate and reliable references. To address this gap, we propose a\nframework to assess the literature review writing ability of LLMs\nautomatically. We evaluate the performance of LLMs across three tasks:\ngenerating references, writing abstracts, and writing literature reviews. We\nemploy external tools for a multidimensional evaluation, which includes\nassessing hallucination rates in references, semantic coverage, and factual\nconsistency with human-written context. By analyzing the experimental results,\nwe find that, despite advancements, even the most sophisticated models still\ncannot avoid generating hallucinated references. Additionally, different models\nexhibit varying performance in literature review writing across different\ndisciplines.\n",
  "subjects": [
    "Computer Science/Computation and Language",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "bFdi-TWip-_glCrkL6j4Kb68oEy1FOQF3BYuDbrlygU",
  "pdfSize": "3389511"
}