{
  "id": "2412.02973",
  "title": "Supporting Gig Worker Needs and Advancing Policy Through Worker-Centered\n  Data-Sharing",
  "authors": "Jane Hsieh, Angie Zhang, Mialy Rasetarinera, Erik Chou, Daniel Ngo,\n  Karen Lightman, Min Kyung Lee, Haiyi Zhu",
  "authorsParsed": [
    [
      "Hsieh",
      "Jane",
      ""
    ],
    [
      "Zhang",
      "Angie",
      ""
    ],
    [
      "Rasetarinera",
      "Mialy",
      ""
    ],
    [
      "Chou",
      "Erik",
      ""
    ],
    [
      "Ngo",
      "Daniel",
      ""
    ],
    [
      "Lightman",
      "Karen",
      ""
    ],
    [
      "Lee",
      "Min Kyung",
      ""
    ],
    [
      "Zhu",
      "Haiyi",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 02:34:38 GMT"
    },
    {
      "version": "v2",
      "created": "Wed, 11 Dec 2024 23:47:53 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1733279678000,
  "abstract": "  The proliferating adoption of platform-based gig work increasingly raises\nconcerns for worker conditions. Past studies documented how platforms leveraged\ndesign to exploit labor, withheld information to generate power asymmetries,\nand left workers alone to manage logistical overheads as well as social\nisolation. However, researchers also called attention to the potential of\nhelping workers overcome such costs via worker-led datasharing, which can\nenable collective actions and mutual aid among workers, while offering\nadvocates, lawmakers and regulatory bodies insights for improving work\nconditions. To understand stakeholders' desiderata for a data-sharing system\n(i.e. functionality and policy initiatives that it can serve), we interviewed\n11 policy domain experts in the U.S. and conducted co-design workshops with 14\nactive gig workers across four domains. Our results outline policymakers'\nprioritized initiatives, information needs, and (mis)alignments with workers'\nconcerns and desires around data collectives. We offer design recommendations\nfor data-sharing systems that support worker needs while bringing us closer to\nlegislation that promote more thriving and equitable gig work futures.\n",
  "subjects": [
    "Computer Science/Computers and Society"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "ob-e8NMcQ-hCxjGeVbM4MTRxdzuM265d-liDdoz3aQ8",
  "pdfSize": "1252719"
}