{"id":"2412.02844","title":"A nanolaser with extreme dielectric confinement","authors":"Meng Xiong, Yi Yu, Yury Berdnikov, Simon Klinck Borregaard, Adrian\n  Holm Dubr\\'e, Elizaveta Semenova, Kresten Yvind, Jesper M{\\o}rk","authorsParsed":[["Xiong","Meng",""],["Yu","Yi",""],["Berdnikov","Yury",""],["Borregaard","Simon Klinck",""],["Dubré","Adrian Holm",""],["Semenova","Elizaveta",""],["Yvind","Kresten",""],["Mørk","Jesper",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 21:19:47 GMT"}],"updateDate":"2024-12-05","timestamp":1733260787000,"abstract":"  The interaction between light and matter can be enhanced by spatially\nconcentrating the light field to boost the photon energy density and increasing\nthe photon dwell time to prolong energy transfer between light and matter.\nTraditionally, strong spatial light localization has been achieved using\nplasmonics, which, despite its effectiveness, entails ohmic losses. Recent\nadvances in nanostructured dielectrics offer an avenue for achieving strong\nlight confinement without metallic losses. However, previous studies primarily\nfocused on minimizing the optical mode volume without adequately addressing\nlight-matter interactions. Here, we develop a nanolaser that simultaneously\nlocalizes the electromagnetic field and excited carriers within the same region\nof a dielectric nanobridge. This extreme dielectric confinement of both light\nand matter achieves a mode volume below the diffraction limit and a\nsubwavelength carrier volume without the introduction of lateral quantum\nconfinement, enabling continuous-wave lasing at room-temperature. Moreover, we\nobserve a strong correlation between the mode field and carrier distribution,\nand unexpectedly, the enhanced mode field localization automatically leads to\nmore pronounced carrier localization, promoting self-alignment of light and\nmatter, which significantly reduces the laser threshold. We quantify the\nintensified light-matter interaction with a newly proposed interaction volume,\nwhich generalizes the concept of mode volume to a broad class of active media.\nOur work lays the ground for developing ultra-efficient optoelectronic devices\nby greatly enhancing light-matter interactions through advanced material\nnanostructuring.\n","subjects":["Physics/Optics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"dbBSCXefFvSkp80aawiqqsxRMuDkWZhqjaMrwRDQDnY","pdfSize":"10530854"}