{"id":"2412.04359","title":"DARWEN: Data-driven Algorithm for Reduction of Wide Exoplanetary\n  Networks","authors":"A. Lira-Barria, J. N. Harvey, T. Konings, R. Baeyens, C. Henr\\'iquez,\n  L. Decin, O. Venot, and R. Veillet","authorsParsed":[["Lira-Barria","A.",""],["Harvey","J. N.",""],["Konings","T.",""],["Baeyens","R.",""],["Henríquez","C.",""],["Decin","L.",""],["Venot","O.",""],["Veillet","R.",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 17:18:45 GMT"}],"updateDate":"2024-12-06","timestamp":1733419125000,"abstract":"  Exoplanet atmospheric modeling is advancing from chemically diverse\none-dimensional (1D) models to three-dimensional (3D) global circulation models\n(GCMs), which are crucial for interpreting observations from facilities like\nthe James Webb Space Telescope (JWST) and Extremely Large Telescope (ELT).\nHowever, maintaining chemical diversity in models, especially in GCMs, is\ncomputationally expensive, limiting their complexity. Optimizing the number of\nreactions and species can address this tradeoff, but transparent and efficient\nmethods for such optimization are lacking in current exoplanet literature. We\naim to develop a systematic approach for reducing chemical networks in\nexoplanetary atmospheres while balancing accuracy and computational efficiency.\nOur data-driven method selects optimal reduced chemical networks based on\naccuracy and computational efficiency metrics. This approach can optimize\nnetworks for similar planets simultaneously, assign weights to prioritize\naccuracy or efficiency, and is applicable when including photochemistry. We\nbase our method on sensitivity analysis of a typical 1D chemical kinetics\nmodel, applying principal component analysis to the sensitivities. To achieve\nfast and reliable network reduction, we utilize a genetic algorithm, a\nmachine-learning optimization method that mimics natural selection. We present\nthree schemes tailored for different priorities (accuracy, computational\nefficiency, and adaptability to photochemistry) that demonstrate improved\nperformance and reduced computational costs. Our genetic algorithm-based\nmethod, the first to reduce a chemical network including photochemistry in\nexoplanet research, offers a versatile and efficient approach to enhance both\naccuracy and computational efficiency.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"xjuljn0THJrguFkPXl18OYglgQd0ck5gcJ3FJF3fKGM","pdfSize":"1676627"}