{"id":"2412.16267","title":"A Classification Benchmark for Artificial Intelligence Detection of\n  Laryngeal Cancer from Patient Speech","authors":"Mary Paterson, James Moor, Luisa Cutillo","authorsParsed":[["Paterson","Mary",""],["Moor","James",""],["Cutillo","Luisa",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 10:34:03 GMT"}],"updateDate":"2024-12-24","timestamp":1734690843000,"abstract":"  Cases of laryngeal cancer are predicted to rise significantly in the coming\nyears. Current diagnostic pathways cause many patients to be incorrectly\nreferred to urgent suspected cancer pathways, putting undue stress on both\npatients and the medical system.\n  Artificial intelligence offers a promising solution by enabling non-invasive\ndetection of laryngeal cancer from patient speech, which could help prioritise\nreferrals more effectively and reduce inappropriate referrals of non-cancer\npatients. To realise this potential, open science is crucial. A major barrier\nin this field is the lack of open-source datasets and reproducible benchmarks,\nforcing researchers to start from scratch. Our work addresses this challenge by\nintroducing a benchmark suite comprising 36 models trained and evaluated on\nopen-source datasets. These models are accessible in a public repository,\nproviding a foundation for future research. They evaluate three different\nalgorithms and three audio feature sets, offering a comprehensive benchmarking\nframework. We propose standardised metrics and evaluation methodologies to\nensure consistent and comparable results across future studies.\n  The presented models include both audio-only inputs and multimodal inputs\nthat incorporate demographic and symptom data, enabling their application to\ndatasets with diverse patient information. By providing these benchmarks,\nfuture researchers can evaluate their datasets, refine the models, and use them\nas a foundation for more advanced approaches. This work aims to provide a\nbaseline for establishing reproducible benchmarks, enabling researchers to\ncompare new methods against these standards and ultimately advancing the\ndevelopment of AI tools for detecting laryngeal cancer.\n","subjects":["Computer Science/Sound","Computer Science/Machine Learning","Electrical Engineering and Systems Science/Audio and Speech Processing","Quantitative Biology/Quantitative Methods"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Z1dfAZ63fCgpwHnh4HL58IrnxpMWsRqpO_FZ2E6SRxE","pdfSize":"699413"}