{
  "id": "2412.05240",
  "title": "Automated, Unsupervised, and Auto-parameterized Inference of Data\n  Patterns and Anomaly Detection",
  "authors": "Qiaolin Qin, Heng Li, Ettore Merlo, Maxime Lamothe",
  "authorsParsed": [
    [
      "Qin",
      "Qiaolin",
      ""
    ],
    [
      "Li",
      "Heng",
      ""
    ],
    [
      "Merlo",
      "Ettore",
      ""
    ],
    [
      "Lamothe",
      "Maxime",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 18:18:26 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733509106000,
  "abstract": "  With the advent of data-centric and machine learning (ML) systems, data\nquality is playing an increasingly critical role in ensuring the overall\nquality of software systems. Data preparation, an essential step towards high\ndata quality, is known to be a highly effort-intensive process. Although prior\nstudies have dealt with one of the most impacting issues, data pattern\nviolations, these studies usually require data-specific configurations (i.e.,\nparameterized) or use carefully curated data as learning examples (i.e.,\nsupervised), relying on domain knowledge and deep understanding of the data, or\ndemanding significant manual effort. In this paper, we introduce RIOLU: Regex\nInferencer auto-parameterized Learning with Uncleaned data. RIOLU is fully\nautomated, automatically parameterized, and does not need labeled samples.\nRIOLU can generate precise patterns from datasets in various domains, with a\nhigh F1 score of 97.2%, exceeding the state-of-the-art baseline. In addition,\naccording to our experiment on five datasets with anomalies, RIOLU can\nautomatically estimate a data column's error rate, draw normal patterns, and\npredict anomalies from unlabeled data with higher performance (up to 800.4%\nimprovement in terms of F1) than the state-of-the-art baseline, even\noutperforming ChatGPT in terms of both accuracy (12.3% higher F1) and\nefficiency (10% less inference time). A variant of RIOLU, with user guidance,\ncan further boost its precision, with up to 37.4% improvement in terms of F1.\nOur evaluation in an industrial setting further demonstrates the practical\nbenefits of RIOLU.\n",
  "subjects": [
    "Computer Science/Software Engineering",
    "Computer Science/Databases"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "HwDsn8xzYjKpqLrtaZ1ddD4k00jz52_6fDXjZA5of30",
  "pdfSize": "736520"
}