{
  "id": "2412.18451",
  "title": "Interaction-induced inversion of chiral transports",
  "authors": "Li Pan, Qian Liang, Chang-An Yang, Yu Huang, Pengjie Liu, Fanying Xi,\n  Wei Yi, Xiaofan Zhou, and Jian-Song Pan",
  "authorsParsed": [
    [
      "Pan",
      "Li",
      ""
    ],
    [
      "Liang",
      "Qian",
      ""
    ],
    [
      "Yang",
      "Chang-An",
      ""
    ],
    [
      "Huang",
      "Yu",
      ""
    ],
    [
      "Liu",
      "Pengjie",
      ""
    ],
    [
      "Xi",
      "Fanying",
      ""
    ],
    [
      "Yi",
      "Wei",
      ""
    ],
    [
      "Zhou",
      "Xiaofan",
      ""
    ],
    [
      "Pan",
      "Jian-Song",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 24 Dec 2024 14:22:02 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1735050122000,
  "abstract": "  We study the chiral transport of interacting bosons in a two-leg flux ladder\nwith on-site interactions. Focusing on the flux-induced chiral current along\nthe two legs, we show that, counter-intuitively, on-site interactions can\nreverse the direction of the chiral flow. For a Bose-Einstein condensate whose\ndynamical evolution is driven by the Gross-Pitaevskii equation under the\nmean-field approximation, this reversal can be understood as an\ninteraction-induced dynamic occupation inversion, under which single-particle\nband with opposing chirality becomes heavily populated in the dynamics. This\nchirality inversion also persists in the two-body dynamics with strong quantum\nfluctuations beyond the mean-field regime, as demonstrated through\ntime-dependent density-matrix renormalization group and exact diagonalization\nanalyses. Herein, besides the band-occupation-inversion mechanism, we find that\nthe formation of two-body bound states with opposite chirality contributes\nsignificantly to the reversed chiral transport. Our discovery highlights the\nsignificance of correlation effects in quantum transport, and can be readily\ndemonstrated using cold atoms.\n",
  "subjects": [
    "Condensed Matter/Quantum Gases"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "230uMbqUc54aKp16T31bwMOz1lHd-IEFk4p-8JT1_3M",
  "pdfSize": "4489025"
}