{"id":"2412.13293","title":"Spatial evolution of droplet size and velocity characteristics in a\n  swirl spray","authors":"S. K. Vankeswaram and V. Kulkarni and S. Deivandren","authorsParsed":[["Vankeswaram","S. K.",""],["Kulkarni","V.",""],["Deivandren","S.",""]],"versions":[{"version":"v1","created":"Tue, 17 Dec 2024 19:46:07 GMT"}],"updateDate":"2024-12-19","timestamp":1734464767000,"abstract":"  Spray drop size distribution generated by atomization of fuel influences\nseveral facets of a combustion process such as, fuel-air mixing, reaction\nkinetics and thrust generation. In a typical spray, the drop size distribution\nevolves spatially, varying significantly between the near and far regions of\nthe spray. Studies so far have focused on either one of these regions and are\nunclear on the exact axial location of transition. In this work, we address\nthis crucial gap by considering a swirl atomizer and measuring the droplet\ncharacteristics for different liquid flow conditions of the ensuing spray at\nvarious radial and axial locations. Our results reveal an axial variation in\nthe scaled radial droplet velocity profiles, not followed by the radial drop\nsize profiles, from which we demarcate the near region as the zone which\nextends to 2.0 to 2.5 times film breakup length. Beyond this distance, the drop\nsize characteristics are influenced by external factors such as airflow and\nidentified as the far region. Further, we locate the point of origin of the\ndroplet high-velocity stream along the spray centreline to the end of film\nbreakup of the spray. We also find that the global probability density\nfunctions for droplet size and velocity which show a bimodal behavior in the\nnear-region and unimodal in the far-region being well represented by the double\nGaussian and Gamma distributions, respectively. We further quantify our results\nby number and volume flux distributions, global mean drop sizes, drop size\n($D_d$) axial velocity ($U_a$) correlations, axial velocity based on drop size\nclassification and turbulent kinetic energy (TKE) to reveal the effect of drop\ninertia and air flow in determining the statistics in both the near and far\nregions. We anticipate the findings of this work will guide future\ninvestigations on combustion processes and combustor design based on spray\ncharacteristics.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"xETjz2KF9PyRh01DFRin0w-qgr4txKOiOpQqyziEaAE","pdfSize":"2615220"}