{"id":"2412.06334","title":"TriDi: Trilateral Diffusion of 3D Humans, Objects, and Interactions","authors":"Ilya A. Petrov, Riccardo Marin, Julian Chibane, Gerard Pons-Moll","authorsParsed":[["Petrov","Ilya A.",""],["Marin","Riccardo",""],["Chibane","Julian",""],["Pons-Moll","Gerard",""]],"versions":[{"version":"v1","created":"Mon, 9 Dec 2024 09:35:05 GMT"}],"updateDate":"2024-12-10","timestamp":1733736905000,"abstract":"  Modeling 3D human-object interaction (HOI) is a problem of great interest for\ncomputer vision and a key enabler for virtual and mixed-reality applications.\nExisting methods work in a one-way direction: some recover plausible human\ninteractions conditioned on a 3D object; others recover the object pose\nconditioned on a human pose. Instead, we provide the first unified model -\nTriDi which works in any direction. Concretely, we generate Human, Object, and\nInteraction modalities simultaneously with a new three-way diffusion process,\nallowing to model seven distributions with one network. We implement TriDi as a\ntransformer attending to the various modalities' tokens, thereby discovering\nconditional relations between them. The user can control the interaction either\nas a text description of HOI or a contact map. We embed these two\nrepresentations into a shared latent space, combining the practicality of text\ndescriptions with the expressiveness of contact maps. Using a single network,\nTriDi unifies all the special cases of prior work and extends to new ones,\nmodeling a family of seven distributions. Remarkably, despite using a single\nmodel, TriDi generated samples surpass one-way specialized baselines on GRAB\nand BEHAVE in terms of both qualitative and quantitative metrics, and\ndemonstrating better diversity. We show the applicability of TriDi to scene\npopulation, generating objects for human-contact datasets, and generalization\nto unseen object geometry. The project page is available at:\nhttps://virtualhumans.mpi-inf.mpg.de/tridi.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"sDCe1_sBUv88nOuhJLmVeNhl_NPzpmK53vnG9veckCc","pdfSize":"43742457"}