{"id":"2412.03395","title":"An even simpler hard variant of Not-All-Equal 3-SAT","authors":"Andreas Darmann and Janosch D\\\"ocker and Britta Dorn","authorsParsed":[["Darmann","Andreas",""],["Döcker","Janosch",""],["Dorn","Britta",""]],"versions":[{"version":"v1","created":"Wed, 4 Dec 2024 15:23:46 GMT"},{"version":"v2","created":"Thu, 5 Dec 2024 08:38:49 GMT"}],"updateDate":"2024-12-06","timestamp":1733325826000,"abstract":"  We show that Not-All-Equal 3-Sat remains NP-complete when restricted to\ninstances that simultaneously satisfy the following properties: (i) The clauses\nare given as the disjoint union of k partitions, for any fixed $k \\geq 4$, of\nthe variable set into subsets of size 3, and (ii) each pair of distinct clauses\nshares at most one variable. Property (i) implies that each variable appears in\nexactly $k$ clauses and each clause consists of exactly 3 unnegated variables.\nTherewith, we improve upon our earlier result (Darmann and D\\\"ocker, 2020).\nComplementing the hardness result for at least $4$ partitions, we show that for\n$k\\leq 3$ the corresponding decision problem is in P. In particular, for $k\\in\n\\{1,2\\}$, all instances that satisfy Property (i) are nae-satisfiable.\n  By the well-known correspondence between Not-All-Equal 3-Sat and hypergraph\ncoloring, we obtain the following corollary of our results: For $k\\geq 4$,\nBicolorability is NP-complete for linear 3-uniform $k$-regular hypergraphs even\nif the edges are given as a decomposition into $k$ perfect matchings; with the\nsame restrictions, for $k \\leq 3$ Bicolorability is in P, and for $k \\in\n\\{1,2\\}$ all such hypergraphs are bicolorable.\n  Finally, we deduce from a construction in the work by Pilz (Pilz, 2019) that\nevery instance of Positive Planar Not-All-Equal Sat with at least three\ndistinct variables per clause is nae-satisfiable. Hence, when restricted to\ninstances with a planar incidence graph, each of the above variants of\nNot-All-Equal 3-Sat turns into a trivial decision problem.\n","subjects":["Computer Science/Computational Complexity"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"jZgEAavSlGTGudiruWGEcYipXuhXnER5TYHkB_msjho","pdfSize":"324843"}