{
  "id": "2412.18637",
  "title": "Eigensolutions and thermodynamic properties of generalized hyperbolic\n  Hulthen and Woods-Saxon potential",
  "authors": "Y. M. Assimiou, S. T. Daniel, G. Issoufou, D. F. Anselme, G. Y. H.\n  Avossevou",
  "authorsParsed": [
    [
      "Assimiou",
      "Y. M.",
      ""
    ],
    [
      "Daniel",
      "S. T.",
      ""
    ],
    [
      "Issoufou",
      "G.",
      ""
    ],
    [
      "Anselme",
      "D. F.",
      ""
    ],
    [
      "Avossevou",
      "G. Y. H.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 11:00:04 GMT"
    },
    {
      "version": "v2",
      "created": "Mon, 30 Dec 2024 16:38:23 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1734951604000,
  "abstract": "  In this paper, we present the solutions of the Schr\\\"{o}dinger equation and\nthe thermodynamic properties of generalized hyperbolic Hulthen and Woods-Saxon\npotential. The eigenvalues and eigenfunctions were found using the parametric\nNikiforov-Uvarov method (PNUM). The clean energies of the molecules HCl, NiC,\nCO, I$_2$, H$_2$, LiH, CuLi and CrH are calculated for certain values of $n$\nand $\\ell$. They are positive and close to the energy of the ground state ($n=\n\\ell= 0$) in the case of the atomic unit (whose energies become negative for\n$n=2$). The figures show that the proper energies decrease as $n$, $\\ell$,\n$\\alpha$ increase, while they increase as $m$ increases, which confirms the\nresults obtained in the literature. The obtained energy was used to calculate\nthe partition function from which thermodynamic properties such as average\nenergy, specific heat capacity, entropy and free energy are calculated.\nNumerical results are generated for this generalized hyperbolic Hulthen and\nWoods-Saxon potential. This study showed that the disorder decreases if the\ntemperature decreases and this decrease is more rapid for HCl and H$_{2}$\nmolecules.\n",
  "subjects": [
    "Physics/Chemical Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "JyHKxgiVNMyB7ZXVrBg0-vDKLyX0_Y8pCspqynuRs3M",
  "pdfSize": "783054"
}