{
  "id": "2412.03497",
  "title": "Soft Checksums to Flag Untrustworthy Machine Learning Surrogate\n  Predictions and Application to Atomic Physics Simulations",
  "authors": "Casey Lauer, Robert C. Blake, Jonathan B. Freund",
  "authorsParsed": [
    [
      "Lauer",
      "Casey",
      ""
    ],
    [
      "Blake",
      "Robert C.",
      ""
    ],
    [
      "Freund",
      "Jonathan B.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 17:39:01 GMT"
    }
  ],
  "updateDate": "2024-12-05",
  "timestamp": 1733333941000,
  "abstract": "  Trained neural networks (NN) are attractive as surrogate models to replace\ncostly calculations in physical simulations, but are often unknowingly applied\nto states not adequately represented in the training dataset. We present the\nnovel technique of soft checksums for scientific machine learning, a\ngeneral-purpose method to differentiate between trustworthy predictions with\nsmall errors on in-distribution (ID) data points, and untrustworthy predictions\nwith large errors on out-of-distribution (OOD) data points. By adding a check\nnode to the existing output layer, we train the model to learn the chosen\nchecksum function encoded within the NN predictions and show that violations of\nthis function correlate with high prediction errors. As the checksum function\ndepends only on the NN predictions, we can calculate the checksum error for any\nprediction with a single forward pass, incurring negligible time and memory\ncosts. Additionally, we find that incorporating the checksum function into the\nloss function and exposing the NN to OOD data points during the training\nprocess improves separation between ID and OOD predictions. By applying soft\nchecksums to a physically complex and high-dimensional non-local thermodynamic\nequilibrium atomic physics dataset, we show that a well-chosen threshold\nchecksum error can effectively separate ID and OOD predictions.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Physics/Atomic Physics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "riCsf1KnikvE0vNz6UzlopppuJahtsB2Wx6aWR_J2O0",
  "pdfSize": "534153"
}