{"id":"2412.12042","title":"The Impact of AI Assistance on Radiology Reporting: A Pilot Study Using\n  Simulated AI Draft Reports","authors":"Juli\\'an N. Acosta, Siddhant Dogra, Subathra Adithan, Kay Wu, Michael\n  Moritz, Stephen Kwak, Pranav Rajpurkar","authorsParsed":[["Acosta","Julián N.",""],["Dogra","Siddhant",""],["Adithan","Subathra",""],["Wu","Kay",""],["Moritz","Michael",""],["Kwak","Stephen",""],["Rajpurkar","Pranav",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 18:10:49 GMT"}],"updateDate":"2024-12-17","timestamp":1734372649000,"abstract":"  Radiologists face increasing workload pressures amid growing imaging volumes,\ncreating risks of burnout and delayed reporting times. While artificial\nintelligence (AI) based automated radiology report generation shows promise for\nreporting workflow optimization, evidence of its real-world impact on clinical\naccuracy and efficiency remains limited. This study evaluated the effect of\ndraft reports on radiology reporting workflows by conducting a three reader\nmulti-case study comparing standard versus AI-assisted reporting workflows. In\nboth workflows, radiologists reviewed the cases and modified either a standard\ntemplate (standard workflow) or an AI-generated draft report (AI-assisted\nworkflow) to create the final report. For controlled evaluation, we used GPT-4\nto generate simulated AI drafts and deliberately introduced 1-3 errors in half\nthe cases to mimic real AI system performance. The AI-assisted workflow\nsignificantly reduced average reporting time from 573 to 435 seconds (p=0.003),\nwithout a statistically significant difference in clinically significant errors\nbetween workflows. These findings suggest that AI-generated drafts can\nmeaningfully accelerate radiology reporting while maintaining diagnostic\naccuracy, offering a practical solution to address mounting workload challenges\nin clinical practice.\n","subjects":["Computer Science/Human-Computer Interaction","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"aFJ-hsk2EYXcUjCSuWDb3hwRWnk9h95945jJ3TA9LNw","pdfSize":"3005125"}