{"id":"2412.04335","title":"Investigating the Efficacy of Topologically Derived Time-Series for\n  Flare Forecasting. I. Dataset Preparation","authors":"Thomas Williams, Christopher B. Prior, David MacTaggart","authorsParsed":[["Williams","Thomas",""],["Prior","Christopher B.",""],["MacTaggart","David",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 16:51:51 GMT"}],"updateDate":"2024-12-06","timestamp":1733417511000,"abstract":"  The accurate forecasting of solar flares is considered a key goal within the\nsolar physics and space weather communities. There is significant potential for\nflare prediction to be improved by incorporating topological fluxes of\nmagnetogram datasets, without the need to invoke three-dimensional magnetic\nfield extrapolations. Topological quantities such as magnetic helicity and\nmagnetic winding have shown significant potential towards this aim, and provide\nspatio-temporal information about the complexity of active region magnetic\nfields. This study develops time-series that are derived from the spatial\nfluxes of helicity and winding that show significant potential for solar flare\nprediction. It is demonstrated that time-series signals, which correlate with\nflare onset times, also exhibit clear spatial correlations with eruptive\nactivity; establishing a potential causal relationship. A significant database\nof helicity and winding fluxes and associated time series across 144 active\nregions is generated using SHARP data processed with the ARTop code that forms\nthe basis of the time-series and spatial investigations conducted here. We find\nthat a number of time-series in this dataset often exhibit extremal signals\nthat occur 1-8 hours before a flare. This, publicly available, living dataset\nwill allow users to incorporate these data into their own flare prediction\nalgorithms.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"DG9BRwItpSm-A_ZeG0jPd_bmAYQmNHUha8gz2fBmJrU","pdfSize":"2837159"}