{
  "id": "2412.16074",
  "title": "Motif Caller: Sequence Reconstruction for Motif-Based DNA Storage",
  "authors": "Parv Agarwal, Thomas Heinis",
  "authorsParsed": [
    [
      "Agarwal",
      "Parv",
      ""
    ],
    [
      "Heinis",
      "Thomas",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 17:18:22 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734715102000,
  "abstract": "  DNA data storage is rapidly gaining traction as a long-term data archival\nsolution, primarily due to its exceptional durability. Retrieving stored data\nrelies on DNA sequencing, which involves a process called basecalling -- a\ntypically costly and slow task that uses machine learning to map raw sequencing\nsignals back to individual DNA bases (which are then translated into digital\nbits to recover the data). Current models for basecalling have been optimized\nfor reading individual bases. However, with the advent of novel DNA synthesis\nmethods tailored for data storage, there is significant potential for\noptimizing the reading process. In this paper, we focus on Motif-based DNA\nsynthesis, where sequences are constructed from motifs -- groups of bases --\nrather than individual bases. To enable efficient reading of data stored in DNA\nusing Motif-based DNA synthesis, we designed Motif Caller, a machine learning\nmodel built to detect entire motifs within a DNA sequence, rather than\nindividual bases. Motifs can also be detected from individually identified\nbases using a basecaller and then searching for motifs, however, such an\napproach is unnecessarily complex and slow. Building a machine learning model\nthat directly identifies motifs allows to avoid the additional step of\nsearching for motifs. It also makes use of the greater amount of features per\nmotif, thus enabling finding the motifs with higher accuracy. Motif Caller\nsignificantly enhances the efficiency and accuracy of data retrieval in DNA\nstorage based on Motif-Based DNA synthesis.\n",
  "subjects": [
    "Computer Science/Other Computer Science",
    "Quantitative Biology/Genomics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "GOBx8oNMdz9l1uRyv3vq_Y3kZXxIqtEQezdJZyq38Ck",
  "pdfSize": "467287"
}