{"id":"2412.20885","title":"CF-CGN: Channel Fingerprints Extrapolation for Multi-band Massive MIMO\n  Transmission based on Cycle-Consistent Generative Networks","authors":"Chenjie Xie, Li You, Zhenzhou Jin, Jinke Tang, Xiqi Gao, Xiang-Gen Xia","authorsParsed":[["Xie","Chenjie",""],["You","Li",""],["Jin","Zhenzhou",""],["Tang","Jinke",""],["Gao","Xiqi",""],["Xia","Xiang-Gen",""]],"versions":[{"version":"v1","created":"Mon, 30 Dec 2024 11:52:39 GMT"}],"updateDate":"2024-12-31","timestamp":1735559559000,"abstract":"  Multi-band massive multiple-input multiple-output (MIMO) communication can\npromote the cooperation of licensed and unlicensed spectra, effectively\nenhancing spectrum efficiency for Wi-Fi and other wireless systems. As an\nenabler for multi-band transmission, channel fingerprints (CF), also known as\nthe channel knowledge map or radio environment map, are used to assist channel\nstate information (CSI) acquisition and reduce computational complexity. In\nthis paper, we propose CF-CGN (Channel Fingerprints with Cycle-consistent\nGenerative Networks) to extrapolate CF for multi-band massive MIMO transmission\nwhere licensed and unlicensed spectra cooperate to provide ubiquitous\nconnectivity. Specifically, we first model CF as a multichannel image and\ntransform the extrapolation problem into an image translation task, which\nconverts CF from one frequency to another by exploring the shared\ncharacteristics of statistical CSI in the beam domain. Then, paired generative\nnetworks are designed and coupled by variable-weight cycle consistency losses\nto fit the reciprocal relationship at different bands. Matched with the coupled\nnetworks, a joint training strategy is developed accordingly, supporting\nsynchronous optimization of all trainable parameters. During the inference\nprocess, we also introduce a refining scheme to improve the extrapolation\naccuracy based on the resolution of CF. Numerical results illustrate that our\nproposed CF-CGN can achieve bidirectional extrapolation with an error of 5-17\ndB lower than the benchmarks in different communication scenarios,\ndemonstrating its excellent generalization ability. We further show that the\nsum rate performance assisted by CF-CGN-based CF is close to that with perfect\nCSI for multi-band massive MIMO transmission.\n","subjects":["Computer Science/Information Theory","Computer Science/Machine Learning","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"_cuAQCTt5M2f6TL_1QG8WN7ByK2nFND81LCARJ13l5E","pdfSize":"3174688"}