{
  "id": "2412.06206",
  "title": "SiReRAG: Indexing Similar and Related Information for Multihop Reasoning",
  "authors": "Nan Zhang, Prafulla Kumar Choubey, Alexander Fabbri, Gabriel\n  Bernadett-Shapiro, Rui Zhang, Prasenjit Mitra, Caiming Xiong, Chien-Sheng Wu",
  "authorsParsed": [
    [
      "Zhang",
      "Nan",
      ""
    ],
    [
      "Choubey",
      "Prafulla Kumar",
      ""
    ],
    [
      "Fabbri",
      "Alexander",
      ""
    ],
    [
      "Bernadett-Shapiro",
      "Gabriel",
      ""
    ],
    [
      "Zhang",
      "Rui",
      ""
    ],
    [
      "Mitra",
      "Prasenjit",
      ""
    ],
    [
      "Xiong",
      "Caiming",
      ""
    ],
    [
      "Wu",
      "Chien-Sheng",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 04:56:43 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1733720203000,
  "abstract": "  Indexing is an important step towards strong performance in\nretrieval-augmented generation (RAG) systems. However, existing methods\norganize data based on either semantic similarity (similarity) or related\ninformation (relatedness), but do not cover both perspectives comprehensively.\nOur analysis reveals that modeling only one perspective results in insufficient\nknowledge synthesis, leading to suboptimal performance on complex tasks\nrequiring multihop reasoning. In this paper, we propose SiReRAG, a novel RAG\nindexing approach that explicitly considers both similar and related\ninformation. On the similarity side, we follow existing work and explore some\nvariances to construct a similarity tree based on recursive summarization. On\nthe relatedness side, SiReRAG extracts propositions and entities from texts,\ngroups propositions via shared entities, and generates recursive summaries to\nconstruct a relatedness tree. We index and flatten both similarity and\nrelatedness trees into a unified retrieval pool. Our experiments demonstrate\nthat SiReRAG consistently outperforms state-of-the-art indexing methods on\nthree multihop datasets (MuSiQue, 2WikiMultiHopQA, and HotpotQA), with an\naverage 1.9% improvement in F1 scores. As a reasonably efficient solution,\nSiReRAG enhances existing reranking methods significantly, with up to 7.8%\nimprovement in average F1 scores.\n",
  "subjects": [
    "Computer Science/Computation and Language",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "SLS3CWUmjwOJ20gJSxWz0H-bf08wXqUJ9a39X7mPIE8",
  "pdfSize": "1068160"
}