{"id":"2412.14309","title":"Consistency Matters: Defining Demonstration Data Quality Metrics in\n  Robot Learning from Demonstration","authors":"Maram Sakr, H.F. Machiel Van der Loos, Dana Kulic and Elizabeth Croft","authorsParsed":[["Sakr","Maram",""],["Van der Loos","H. F. Machiel",""],["Kulic","Dana",""],["Croft","Elizabeth",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 20:22:47 GMT"}],"updateDate":"2024-12-20","timestamp":1734553367000,"abstract":"  Learning from Demonstration (LfD) empowers robots to acquire new skills\nthrough human demonstrations, making it feasible for everyday users to teach\nrobots. However, the success of learning and generalization heavily depends on\nthe quality of these demonstrations. Consistency is often used to indicate\nquality in LfD, yet the factors that define this consistency remain\nunderexplored. In this paper, we evaluate a comprehensive set of motion data\ncharacteristics to determine which consistency measures best predict learning\nperformance. By ensuring demonstration consistency prior to training, we\nenhance models' predictive accuracy and generalization to novel scenarios. We\nvalidate our approach with two user studies involving participants with diverse\nlevels of robotics expertise. In the first study (N = 24), users taught a PR2\nrobot to perform a button-pressing task in a constrained environment, while in\nthe second study (N = 30), participants trained a UR5 robot on a pick-and-place\ntask. Results show that demonstration consistency significantly impacts success\nrates in both learning and generalization, with 70% and 89% of task success\nrates in the two studies predicted using our consistency metrics. Moreover, our\nmetrics estimate generalized performance success rates with 76% and 91%\naccuracy. These findings suggest that our proposed measures provide an\nintuitive, practical way to assess demonstration data quality before training,\nwithout requiring expert data or algorithm-specific modifications. Our approach\noffers a systematic way to evaluate demonstration quality, addressing a\ncritical gap in LfD by formalizing consistency metrics that enhance the\nreliability of robot learning from human demonstrations.\n","subjects":["Computer Science/Robotics","Computer Science/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"FnnKVHX5Cmj9CK8JqBpnOL7xR3aiFpv-H8Al9wMZIVQ","pdfSize":"37447663"}