{"id":"2412.15808","title":"Deep learning joint extremes of metocean variables using the SPAR model","authors":"Ed Mackay, Callum Murphy-Barltrop, Jordan Richards, Philip Jonathan","authorsParsed":[["Mackay","Ed",""],["Murphy-Barltrop","Callum",""],["Richards","Jordan",""],["Jonathan","Philip",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 11:39:07 GMT"}],"updateDate":"2024-12-23","timestamp":1734694747000,"abstract":"  This paper presents a novel deep learning framework for estimating\nmultivariate joint extremes of metocean variables, based on the Semi-Parametric\nAngular-Radial (SPAR) model. When considered in polar coordinates, the problem\nof modelling multivariate extremes is transformed to one of modelling an\nangular density, and the tail of a univariate radial variable conditioned on\nangle. In the SPAR approach, the tail of the radial variable is modelled using\na generalised Pareto (GP) distribution, providing a natural extension of\nunivariate extreme value theory to the multivariate setting. In this work, we\nshow how the method can be applied in higher dimensions, using a case study for\nfive metocean variables: wind speed, wind direction, wave height, wave period\nand wave direction. The angular variable is modelled empirically, while the\nparameters of the GP model are approximated using fully-connected deep neural\nnetworks. Our data-driven approach provides great flexibility in the dependence\nstructures that can be represented, together with computationally efficient\nroutines for training the model. Furthermore, the application of the method\nrequires fewer assumptions about the underlying distribution(s) compared to\nexisting approaches, and an asymptotically justified means for extrapolating\noutside the range of observations. Using various diagnostic plots, we show that\nthe fitted models provide a good description of the joint extremes of the\nmetocean variables considered.\n","subjects":["Statistics/Machine Learning","Computer Science/Machine Learning","Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"wx_YKbnjjMBjXAaaR4wB-PaYphj2eqou2juMmYst84w","pdfSize":"6875407"}