{"id":"2412.00802","title":"HT-HEDL: High-Throughput Hypothesis Evaluation in Description Logic","authors":"Eyad Algahtani","authorsParsed":[["Algahtani","Eyad",""]],"versions":[{"version":"v1","created":"Sun, 1 Dec 2024 13:01:48 GMT"}],"updateDate":"2024-12-03","timestamp":1733058108000,"abstract":"  We present High-Throughput Hypothesis Evaluation in Description Logic\n(HT-HEDL). HT-HEDL is a high-performance hypothesis evaluation engine that\naccelerates hypothesis evaluation computations for inductive logic programming\n(ILP) learners using description logic (DL) for their knowledge representation;\nin particular, HT-HEDL targets accelerating computations for the\n$\\mathcal{ALCQI}^{\\mathcal{(D)}}$ DL language. HT-HEDL aggregates the computing\npower of multi-core CPUs with multi-GPUs to improve hypothesis computations at\ntwo levels: 1) the evaluation of a single hypothesis and 2) the evaluation of\nmultiple hypotheses (i.e., batch of hypotheses). In the first level, HT-HEDL\nuses a single GPU or a vectorized multi-threaded CPU to evaluate a single\nhypothesis. In vectorized multi-threaded CPU evaluation, classical (scalar) CPU\nmulti-threading is combined with CPU's extended vector instructions set to\nextract more CPU-based performance. The experimental results revealed that\nHT-HEDL increased performance using CPU-based evaluation (on a single\nhypothesis): from 20.4 folds using classical multi-threading to $\\sim85$ folds\nusing vectorized multi-threading. In the GPU-based evaluation, HT-HEDL achieved\nspeedups of up to $\\sim38$ folds for single hypothesis evaluation using a\nsingle GPU. To accelerate the evaluation of multiple hypotheses, HT-HEDL\ncombines, in parallel, GPUs with multi-core CPUs to increase evaluation\nthroughput (number of evaluated hypotheses per second). The experimental\nresults revealed that HT-HEDL increased evaluation throughput by up to 29.3\nfolds using two GPUs and up to $\\sim44$ folds using two GPUs combined with a\nCPU's vectorized multi-threaded evaluation.\n","subjects":["Computer Science/Artificial Intelligence","Computer Science/Distributed, Parallel, and Cluster Computing","Computer Science/Data Structures and Algorithms","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"_VwDTj7m-YP5NfTZrq8QzSlMTvCoUopNCllnQ9d58X8","pdfSize":"1428443"}