{"id":"2412.16274","title":"Classification of kink clusters for scalar fields in dimension 1+1","authors":"Jacek Jendrej and Andrew Lawrie","authorsParsed":[["Jendrej","Jacek",""],["Lawrie","Andrew",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 16:21:21 GMT"}],"updateDate":"2024-12-24","timestamp":1734711681000,"abstract":"  We consider a real scalar field equation in dimension 1+1 with an even,\npositive self-interaction potential having two non-degenerate zeros (vacua) 1\nand -1. Such a model admits non-trivial static solutions called kinks and\nantikinks. We define a kink n-cluster to be a solution approaching, for large\npositive times, a superposition of n alternating kinks and antikinks whose\nvelocities converge to $0$. They can be equivalently characterized as the\nsolutions of minimal possible energy containing n transitions between the\nvacua, or as the solutions whose kinetic energy decays to 0 in large time.\n  Our first main result is a determination of the main-order asymptotic\nbehavior of any kink n-cluster. The proof relies on a reduction,using\nappropriately chosen modulation parameters, to an n-body problem with\nattractive exponential interactions. We then construct a kink n-cluster for any\nprescribed initial positions of the kinks and antikinks, provided that their\nmutual distances are sufficiently large. Next, we prove that the set of all the\nkink n-clusters is an n-dimensional topological manifold, and we show how it\ncan be parametrized by the positions of the kinks in the configuration. The\nproof relies on energy estimates and the contraction mapping principle, using\nthe Lyapunov-Schmidt reduction technique. Finally, we show that kink clusters\nare universal profiles for the formation/collapse of multikink configurations.\nIn this sense, they can be interpreted as forming the stable/unstable manifold\nof the multikink state given by a superposition of n infinitely separated\nalternating kinks and antikinks.\n","subjects":["Mathematics/Analysis of PDEs","Physics/Mathematical Physics","Mathematics/Mathematical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"zO1LE1XC5Nd2P8a-wk6twRamRhdJCMMg92wBDrIv_6s","pdfSize":"1032887"}