{
  "id": "2412.04441",
  "title": "Learning Artistic Signatures: Symmetry Discovery and Style Transfer",
  "authors": "Emma Finn, T. Anderson Keller, Emmanouil Theodosis, and Demba E. Ba",
  "authorsParsed": [
    [
      "Finn",
      "Emma",
      ""
    ],
    [
      "Keller",
      "T. Anderson",
      ""
    ],
    [
      "Theodosis",
      "Emmanouil",
      ""
    ],
    [
      "Ba",
      "Demba E.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 18:56:23 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733424983000,
  "abstract": "  Despite nearly a decade of literature on style transfer, there is no\nundisputed definition of artistic style. State-of-the-art models produce\nimpressive results but are difficult to interpret since, without a coherent\ndefinition of style, the problem of style transfer is inherently ill-posed.\nEarly work framed style-transfer as an optimization problem but treated style\nas a measure only of texture. This led to artifacts in the outputs of early\nmodels where content features from the style image sometimes bled into the\noutput image. Conversely, more recent work with diffusion models offers\ncompelling empirical results but provides little theoretical grounding. To\naddress these issues, we propose an alternative definition of artistic style.\nWe suggest that style should be thought of as a set of global symmetries that\ndictate the arrangement of local textures. We validate this perspective\nempirically by learning the symmetries of a large dataset of paintings and\nshowing that symmetries are predictive of the artistic movement to which each\npainting belongs. Finally, we show that by considering both local and global\nfeatures, using both Lie generators and traditional measures of texture, we can\nquantitatively capture the stylistic similarity between artists better than\nwith either set of features alone. This approach not only aligns well with art\nhistorians' consensus but also offers a robust framework for distinguishing\nnuanced stylistic differences, allowing for a more interpretable, theoretically\ngrounded approach to style transfer.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "kSHrcjeq18vdkZn_X_xMYnJzvIvJF-l5GOTCD27KlTw",
  "pdfSize": "19172241"
}