{
  "id": "2412.04946",
  "title": "Impact of the Scalar Isovector $\\delta$-meson on the description of\n  nuclear matter and neutron star properties",
  "authors": "Lav\\'inia Gabriela Teodoro dos Santos, Tuhin Malik, Constan\\c{c}a\n  Provid\\^encia",
  "authorsParsed": [
    [
      "Santos",
      "Lavínia Gabriela Teodoro dos",
      ""
    ],
    [
      "Malik",
      "Tuhin",
      ""
    ],
    [
      "Providência",
      "Constança",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 11:06:01 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733483161000,
  "abstract": "  The implications of including the scalar isovector $\\delta$-meson in a\nrelativistic mean-field description of nuclear matter are discussed. A Bayesian\ninference approach is used to determine the parameters that define the\nisovector properties of the model. The properties of nuclear matter and neutron\nstars are discussed. The inclusion of the $\\delta$-meson has only a small\neffect on the maximum mass of the neutron star (NS) and on the speed of sound\nin its interior, but it has a strong effect on the radius and the tidal\ndeformability of low and medium mass stars. This is mainly due to the effect of\nthe $\\delta$-meson on the symmetry energy and its slope and curvature at\nsaturation, increasing the range of possible values of these three properties,\nand in particular allowing positive values of the symmetry energy curvature.\nDue to the effect of the $\\delta$-meson on the symmetry energy, the proton\ncontent of the star is also strongly affected. The inclusion of the\n$\\delta$-meson in the relativistic mean-field description of nuclear matter\nextends the phase space spanned by the model, allowing for a more flexible\ndensity dependence of the symmetry energy compatible with experimental,\nobservational, and ab initio constraints.\n",
  "subjects": [
    "Physics/Nuclear Theory"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "JzyLvu-yR-hIz_znu8wb9lJ1Z7bqIds-9LZ5tyt6P3Q",
  "pdfSize": "3953989"
}