{"id":"2412.18010","title":"Mechanical softening and enhanced elasticity of lunar olivine probed via\n  nanoindentation and high-pressure X-ray diffraction measurements","authors":"P. Gr\\`ebol-Tom\\`as, J. Ib\\'a\\~nez-Insa, J. M. Trigo-Rodr\\'iguez, E.\n  Pe\\~na-Asensio, R. Oliva, D. D\\'iaz-Anichtchenko, P. Botella, J.\n  S\\'anchez-Mart\\'in, R. Turnbull, D. Errandonea, A. Liang, C. Popescu, J. Sort","authorsParsed":[["Grèbol-Tomàs","P.",""],["Ibáñez-Insa","J.",""],["Trigo-Rodríguez","J. M.",""],["Peña-Asensio","E.",""],["Oliva","R.",""],["Díaz-Anichtchenko","D.",""],["Botella","P.",""],["Sánchez-Martín","J.",""],["Turnbull","R.",""],["Errandonea","D.",""],["Liang","A.",""],["Popescu","C.",""],["Sort","J.",""]],"versions":[{"version":"v1","created":"Mon, 23 Dec 2024 22:07:02 GMT"},{"version":"v2","created":"Mon, 10 Feb 2025 08:41:33 GMT"}],"updateDate":"2025-02-11","timestamp":1734991622000,"abstract":"  The mechanical properties of minerals in planetary materials are not only\ninteresting from a fundamental point of view but also critical to the\ndevelopment of future space missions. Here we present nanoindentation\nexperiments to evaluate the hardness and reduced elastic modulus of olivine,\n(Mg, Fe)2SiO4, in meteorite NWA 12008, a lunar basalt. Our experiments suggest\nthat the olivine grains in this lunaite are softer and more elastic than their\nterrestrial counterparts. Also, we have performed synchrotron-based\nhigh-pressure X-ray diffraction (HP-XRD) measurements to probe the\ncompressibility properties of this meteorite and, for comparison purposes, of\nthree ordinary chondrites. The HP-XRD results suggest that the axial\ncompressibility of the orthorhombic $b$ lattice parameter of olivine relative\nto terrestrial olivine is higher in NWA 12008 and also in the highly-shocked\nChelyabinsk meteorite. The origin of the observed differences is discussed. A\nsimple model combining the results of both our nanoindentation and HP-XRD\nmeasurements allows us to describe the contribution of macroscopic and\nchemical-bond related effects, both of which are necessary to reproduce the\nobserved elastic modulus softening. Such joint analysis of the mechanical and\nelastic properties of meteorites and returned samples opens up a new avenue for\ncharacterizing these highly interesting materials.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"VyVnOt_7hCRvQiDP6sxkt8k7K7UcqS_Ftm1kNJPwgjU","pdfSize":"17371120"}