{
  "id": "2412.10208",
  "title": "Efficient Generative Modeling with Residual Vector Quantization-Based\n  Tokens",
  "authors": "Jaehyeon Kim, Taehong Moon, Keon Lee, Jaewoong Cho",
  "authorsParsed": [
    [
      "Kim",
      "Jaehyeon",
      ""
    ],
    [
      "Moon",
      "Taehong",
      ""
    ],
    [
      "Lee",
      "Keon",
      ""
    ],
    [
      "Cho",
      "Jaewoong",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 15:31:17 GMT"
    },
    {
      "version": "v2",
      "created": "Mon, 16 Dec 2024 04:51:01 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734103877000,
  "abstract": "  We explore the use of Residual Vector Quantization (RVQ) for high-fidelity\ngeneration in vector-quantized generative models. This quantization technique\nmaintains higher data fidelity by employing more in-depth tokens. However,\nincreasing the token number in generative models leads to slower inference\nspeeds. To this end, we introduce ResGen, an efficient RVQ-based discrete\ndiffusion model that generates high-fidelity samples without compromising\nsampling speed. Our key idea is a direct prediction of vector embedding of\ncollective tokens rather than individual ones. Moreover, we demonstrate that\nour proposed token masking and multi-token prediction method can be formulated\nwithin a principled probabilistic framework using a discrete diffusion process\nand variational inference. We validate the efficacy and generalizability of the\nproposed method on two challenging tasks across different modalities:\nconditional image generation} on ImageNet 256x256 and zero-shot text-to-speech\nsynthesis. Experimental results demonstrate that ResGen outperforms\nautoregressive counterparts in both tasks, delivering superior performance\nwithout compromising sampling speed. Furthermore, as we scale the depth of RVQ,\nour generative models exhibit enhanced generation fidelity or faster sampling\nspeeds compared to similarly sized baseline models. The project page can be\nfound at https://resgen-genai.github.io\n",
  "subjects": [
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "3y38EngIMDwY0qlRPdkk9cgejU_SOWGodwzFE5HyqNQ",
  "pdfSize": "2339606"
}