{"id":"2412.01795","title":"The Jet Paths of Radio AGN and their Cluster Weather","authors":"E. Vardoulaki, V. Back\\\"ofer, A. Finoguenov, F. Vazza, J. Comparat, G.\n  Gozaliasl, I.H. Whittam, C.L. Hale, J.R. Weaver, A.M. Koekemoer, J.D.\n  Collier, B. Frank, I. Heywood, S. Sekhar, A.R. Taylor, S. Pinjarkar, M.J.\n  Hardcastle, T. Shimwell, M. Hoeft, S.V. White, F. An, F. Tabatabaei, Z.\n  Randriamanakoto, M.D. Filipovic","authorsParsed":[["Vardoulaki","E.",""],["Backöfer","V.",""],["Finoguenov","A.",""],["Vazza","F.",""],["Comparat","J.",""],["Gozaliasl","G.",""],["Whittam","I. H.",""],["Hale","C. L.",""],["Weaver","J. R.",""],["Koekemoer","A. M.",""],["Collier","J. D.",""],["Frank","B.",""],["Heywood","I.",""],["Sekhar","S.",""],["Taylor","A. R.",""],["Pinjarkar","S.",""],["Hardcastle","M. J.",""],["Shimwell","T.",""],["Hoeft","M.",""],["White","S. V.",""],["An","F.",""],["Tabatabaei","F.",""],["Randriamanakoto","Z.",""],["Filipovic","M. D.",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 18:41:24 GMT"}],"updateDate":"2024-12-03","timestamp":1733164884000,"abstract":"  We studied bent radio sources within X-ray galaxy groups in the COSMOS and\nXMM-LSS fields, using radio data from the MeerKAT International GHz Tiered\nExtragalactic Explorations data release 1 (MIGHTEE-DR1) at 1.2-1.3 GHz (angular\nresolutions of 8.9\" and 5\"; <rms> ~ 3.5 and 5.5 uJy/beam). Bent radio active\ngalactic nuclei (AGN) were identified via visual inspection. Our analysis\nincluded 19 bent radio AGN in the COSMOS field and 17 in the XMM-LSS field\nwhich lie within X-ray galaxy groups (2x10^13 >= M200c/Msun = 3x10^14). We\ninvestigated the relationship between their bending angle (BA) - the angle\nformed by the jets or lobes of two-sided radio sources associated with AGN -\nand properties of their host galaxies and large-scale environment probed by the\nX-ray galaxy groups. Our key findings are: a) In the XMM-LSS field, we observed\na strong correlation between the linear projected size of the bent AGN, the\ngroup halo mass, and the projected distance from the group centre. This trend,\nconsistent with previous studies, was not detected in the COSMOS sample. b) The\nBA is a function of environmental density, with the type of medium playing a\nsignificant role. Additionally, at z <= 0.5 we found a higher number of bent\nsources (BA <= 160deg) compared to higher redshifts (z ~ 1), by a factor of\n>1.5. This trend aligns with magnetohydrodynamic simulations, which suggest\nthat denser environments and longer interaction times at lower redshifts\ncontribute to this effect. Comparison with the literature suggests that jet\nbending in galaxy groups within the redshift range 0.1 < z < 1.2 is primarily\ndriven by ram pressure exerted on the jets, which occurs during quiescent\nphases of AGN activity. This study underscores the role of environmental\ninteractions in shaping the morphology of radio AGN within galaxy groups,\nproviding insights into the interplay between large-scale structure and AGN\nphysics.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"k4_wJo4sNR4PF5fi2nihQSPIf-LxDx9K9uDR4hllnG8","pdfSize":"2178338"}