{"id":"2412.14011","title":"Towards an optimised evaluation of teachers' discourse: The case of\n  engaging messages","authors":"Samuel Falcon, Jaime Leon","authorsParsed":[["Falcon","Samuel",""],["Leon","Jaime",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 16:29:45 GMT"},{"version":"v2","created":"Thu, 19 Dec 2024 08:27:54 GMT"}],"updateDate":"2024-12-20","timestamp":1734539385000,"abstract":"  Evaluating teachers' skills is crucial for enhancing education quality and\nstudent outcomes. Teacher discourse, significantly influencing student\nperformance, is a key component. However, coding this discourse can be\nlaborious. This study addresses this issue by introducing a new methodology for\noptimising the assessment of teacher discourse. The research consisted of two\nstudies, both within the framework of engaging messages used by secondary\neducation teachers. The first study involved training two large language models\non real-world examples from audio-recorded lessons over two academic years to\nidentify and classify the engaging messages from the lessons' transcripts. This\nresulted in sensitivities of 84.31% and 91.11%, and specificities of 97.69% and\n86.36% in identification and classification, respectively. The second study\napplied these models to transcripts of audio-recorded lessons from a third\nacademic year to examine the frequency and distribution of message types by\neducational level and moment of the academic year. Results showed teachers\npredominantly use messages emphasising engagement benefits, linked to improved\noutcomes, while one-third highlighted non-engagement disadvantages, associated\nwith increased anxiety. The use of engaging messages declined in Grade 12 and\ntowards the academic year's end. These findings suggest potential interventions\nto optimise engaging message use, enhancing teaching quality and student\noutcomes.\n","subjects":["Computer Science/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"i-fjjyCSHTqCd_nZmw9zOgPINDLdvTyEnGNk6PfaogA","pdfSize":"779326"}