{
  "id": "2412.08370",
  "title": "Noise-Aware Bayesian Optimization Approach for Capacity Planning of the\n  Distributed Energy Resources in an Active Distribution Network",
  "authors": "Ruizhe Yang, Zhongkai Yi, Ying Xu, Dazhi Yang, Zhenghong Tu",
  "authorsParsed": [
    [
      "Yang",
      "Ruizhe",
      ""
    ],
    [
      "Yi",
      "Zhongkai",
      ""
    ],
    [
      "Xu",
      "Ying",
      ""
    ],
    [
      "Yang",
      "Dazhi",
      ""
    ],
    [
      "Tu",
      "Zhenghong",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 13:31:33 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733923893000,
  "abstract": "  The growing penetration of renewable energy sources (RESs) in active\ndistribution networks (ADNs) leads to complex and uncertain operation\nscenarios, resulting in significant deviations and risks for the ADN operation.\nIn this study, a collaborative capacity planning of the distributed energy\nresources in an ADN is proposed to enhance the RES accommodation capability.\nThe variability of RESs, characteristics of adjustable demand response\nresources, ADN bi-directional power flow, and security operation limitations\nare considered in the proposed model. To address the noise term caused by the\ninevitable deviation between the operation simulation and real-world\nenvironments, an improved noise-aware Bayesian optimization algorithm with the\nprobabilistic surrogate model is proposed to overcome the interference from the\nenvironmental noise and sample-efficiently optimize the capacity planning model\nunder noisy circumstances. Numerical simulation results verify the superiority\nof the proposed approach in coping with environmental noise and achieving lower\nannual cost and higher computation efficiency.\n",
  "subjects": [
    "Computer Science/Neural and Evolutionary Computing",
    "Computer Science/Systems and Control",
    "Electrical Engineering and Systems Science/Systems and Control"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "3hmgK2bXtKC4bDHcn9eupTo1hbwHDd_X15UnK_URPno",
  "pdfSize": "1535316"
}