{"id":"2412.14523","title":"Provincial allocation of China's commercial building operational carbon\n  towards carbon neutrality","authors":"Yanqiao Deng, Minda Ma, Nan Zhou, Chenchen Zou, Zhili Ma, Ran Yan, Xin\n  Ma","authorsParsed":[["Deng","Yanqiao",""],["Ma","Minda",""],["Zhou","Nan",""],["Zou","Chenchen",""],["Ma","Zhili",""],["Yan","Ran",""],["Ma","Xin",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 04:41:05 GMT"},{"version":"v2","created":"Sat, 11 Jan 2025 16:57:15 GMT"}],"updateDate":"2025-01-14","timestamp":1734583265000,"abstract":"  National carbon peak track and optimized provincial carbon allocations are\ncrucial for mitigating regional inequality within the commercial building\nsector during China's transition to carbon neutrality. This study proposes a\ntop-down model to evaluate carbon trajectories in operational commercial\nbuildings up to 2060. Through Monte Carlo simulation, scenario analysis is\nconducted to assess carbon peak values and the corresponding peaking year,\nthereby optimizing carbon allocation schemes both nationwide and provincially.\nThe results reveal that (1) the nationwide carbon peak for commercial building\noperations is projected to reach 890 (+- 50) megatons of carbon dioxide (MtCO2)\nby 2028 (+- 3.7 years) in the case of the business-as-usual scenario, with a\n7.87% probability of achieving the carbon peak under the decarbonization\nscenario. (2) Significant disparities will exist among provinces, with\nShandong's carbon peak projected at 69.6 (+- 4.0) MtCO2 by 2029, approximately\n11 times higher than Ningxia's peak of 6.0 (+- 0.3) MtCO2 by 2027. (3) Guided\nby the principle of maximizing the emission reduction potential, the optimal\nprovincial allocation scheme reveals the top three provinces requiring the most\nsignificant reductions in the commercial sector: Xinjiang (5.6 MtCO2), Shandong\n(4.8 MtCO2), and Henan (4.7 MtCO2). Overall, this study offers optimized\nprovincial carbon allocation strategies within the commercial building sector\nin China via dynamic scenario simulations, with the goal of hitting the carbon\npeak target and progressing toward a low-carbon future for the building sector.\n","subjects":["Economics/General Economics","Quantitative Finance/Economics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"SQh04so648aE1rGuuId6r-tAdt3b7ds1kDPznmT6zxA","pdfSize":"1412151"}