{
  "id": "2412.06704",
  "title": "Dynamical Phase Transitions in Non-equilibrium Networks",
  "authors": "Jiazhen Liu, Nathaniel M. Aden, Debasish Sarker, Chaoming Song",
  "authorsParsed": [
    [
      "Liu",
      "Jiazhen",
      ""
    ],
    [
      "Aden",
      "Nathaniel M.",
      ""
    ],
    [
      "Sarker",
      "Debasish",
      ""
    ],
    [
      "Song",
      "Chaoming",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 17:51:52 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733766712000,
  "abstract": "  Dynamical phase transitions (DPTs) characterize critical changes in system\nbehavior occurring at finite times, providing a lens to study nonequilibrium\nphenomena beyond conventional equilibrium physics. While extensively studied in\nquantum systems, DPTs have remained largely unexplored in classical settings.\nRecent experiments on complex systems, from social networks to financial\nmarkets, have revealed abrupt dynamical changes analogous to quantum DPTs,\nmotivating the search for a theoretical understanding. Here, we present a\nminimal model for nonequilibrium networks, demonstrating that nonlinear\ninteractions among network edges naturally give rise to DPTs. Specifically, we\nshow that network degree diverges at a finite critical time, following a\nuniversal hyperbolic scaling, consistent with empirical observations. Our\nanalytical results predict that key network properties, including degree\ndistributions and clustering coefficients, exhibit critical scaling as\ncriticality approaches. These findings establish a theoretical foundation for\nunderstanding emergent nonequilibrium criticality across diverse complex\nsystems.\n",
  "subjects": [
    "Physics/Physics and Society",
    "Condensed Matter/Statistical Mechanics",
    "Nonlinear Sciences/Adaptation and Self-Organizing Systems"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "GRbeuyUKpJd2CYb39fdQkMdoyWLlew2w8J3Js7VKxZs",
  "pdfSize": "4020254"
}