{"id":"2412.02210","title":"CC-OCR: A Comprehensive and Challenging OCR Benchmark for Evaluating\n  Large Multimodal Models in Literacy","authors":"Zhibo Yang, Jun Tang, Zhaohai Li, Pengfei Wang, Jianqiang Wan, Humen\n  Zhong, Xuejing Liu, Mingkun Yang, Peng Wang, Shuai Bai, LianWen Jin, Junyang\n  Lin","authorsParsed":[["Yang","Zhibo",""],["Tang","Jun",""],["Li","Zhaohai",""],["Wang","Pengfei",""],["Wan","Jianqiang",""],["Zhong","Humen",""],["Liu","Xuejing",""],["Yang","Mingkun",""],["Wang","Peng",""],["Bai","Shuai",""],["Jin","LianWen",""],["Lin","Junyang",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 07:03:25 GMT"},{"version":"v2","created":"Thu, 5 Dec 2024 13:51:57 GMT"},{"version":"v3","created":"Tue, 10 Dec 2024 05:01:33 GMT"}],"updateDate":"2024-12-11","timestamp":1733209405000,"abstract":"  Large Multimodal Models (LMMs) have demonstrated impressive performance in\nrecognizing document images with natural language instructions. However, it\nremains unclear to what extent capabilities in literacy with rich structure and\nfine-grained visual challenges. The current landscape lacks a comprehensive\nbenchmark to effectively measure the literate capabilities of LMMs. Existing\nbenchmarks are often limited by narrow scenarios and specified tasks. To this\nend, we introduce CC-OCR, a comprehensive benchmark that possesses a diverse\nrange of scenarios, tasks, and challenges. CC-OCR comprises four OCR-centric\ntracks: multi-scene text reading, multilingual text reading, document parsing,\nand key information extraction. It includes 39 subsets with 7,058 full\nannotated images, of which 41% are sourced from real applications, and released\nfor the first time. We evaluate nine prominent LMMs and reveal both the\nstrengths and weaknesses of these models, particularly in text grounding,\nmulti-orientation, and hallucination of repetition. CC-OCR aims to\ncomprehensively evaluate the capabilities of LMMs on OCR-centered tasks,\nfacilitating continued progress in this crucial area.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"qCnvYi0Lw3RzZPFikyCslg5QnkJ_bvWH0UhDerGsk14","pdfSize":"10210057"}