{"id":"2412.05788","title":"On Diffusion Posterior Sampling via Sequential Monte Carlo for Zero-Shot\n  Scaffolding of Protein Motifs","authors":"James Matthew Young and O. Deniz Akyildiz","authorsParsed":[["Young","James Matthew",""],["Akyildiz","O. Deniz",""]],"versions":[{"version":"v1","created":"Sun, 8 Dec 2024 02:38:59 GMT"}],"updateDate":"2024-12-10","timestamp":1733625539000,"abstract":"  With the advent of diffusion models, new proteins can be generated at an\nunprecedented rate. The \\textit{motif scaffolding problem} requires steering\nthis generative process to yield proteins with a desirable functional\nsubstructure -- a motif. While models have been trained to take the motif as\nconditional input, recent techniques in diffusion posterior sampling can be\nleveraged as zero-shot alternatives whose approximations can be corrected with\nsequential Monte Carlo (SMC) algorithms. In this work, we introduce a new set\nof guidance potentials to describe and solve scaffolding tasks by adapting\nSMC-aided diffusion posterior samplers with an unconditional model, Genie,\nacting as a prior. Against established benchmarks, we successfully scaffold\nseveral single-motif and multi-motif problems. The latter is possible by\npairing reconstruction guidance with $\\mathrm{SE}(3)$-invariant potentials. In\nthe single-motif case, we find these potentials perform comparably to the\nconventional masking approach and that reconstruction guidance outperforms\nreplacement methods when aided with SMC. We additionally consider a guidance\npotential for point symmetry constraints and produce designable internally\nsymmetric monomers with our setup. Overall, this work highlights the\ncapabilities and areas for improvement of zero-shot posterior samplers in motif\nscaffolding tasks. Code is available at:\nhttps://github.com/matsagad/mres-project\n","subjects":["Quantitative Biology/Biomolecules","Computer Science/Machine Learning","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"bt2YWOSfs1TaeMsdVfPoALwmAyHpE2rNJxbhfvdUfMw","pdfSize":"2794780"}