{
  "id": "2412.09324",
  "title": "Are Conditional Latent Diffusion Models Effective for Image Restoration?",
  "authors": "Yunchen Yuan, Junyuan Xiao, Xinjie Li",
  "authorsParsed": [
    [
      "Yuan",
      "Yunchen",
      ""
    ],
    [
      "Xiao",
      "Junyuan",
      ""
    ],
    [
      "Li",
      "Xinjie",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 14:49:55 GMT"
    },
    {
      "version": "v2",
      "created": "Fri, 13 Dec 2024 04:51:11 GMT"
    }
  ],
  "updateDate": "2024-12-16",
  "timestamp": 1734014995000,
  "abstract": "  Recent advancements in image restoration increasingly employ conditional\nlatent diffusion models (CLDMs). While these models have demonstrated notable\nperformance improvements in recent years, this work questions their suitability\nfor IR tasks. CLDMs excel in capturing high-level semantic correlations, making\nthem effective for tasks like text-to-image generation with spatial\nconditioning. However, in IR, where the goal is to enhance image perceptual\nquality, these models face difficulty of modeling the relationship between\ndegraded images and ground truth images using a low-level representation. To\nsupport our claims, we compare state-of-the-art CLDMs with traditional image\nrestoration models through extensive experiments. Results reveal that despite\nthe scaling advantages of CLDMs, they suffer from high distortion and semantic\ndeviation, especially in cases with minimal degradation, where traditional\nmethods outperform them. Additionally, we perform empirical studies to examine\nthe impact of various CLDM design elements on their restoration performance. We\nhope this finding inspires a reexamination of current CLDM-based IR solutions,\nopening up more opportunities in this field.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "8E-o_-Un0lt-U_NA94cfrMzo1Eye4szo3c6-UCaqYx4",
  "pdfSize": "7944768"
}