{"id":"2412.04671","title":"Fully Distributed, Flexible Compositional Visual Representations via\n  Soft Tensor Products","authors":"Bethia Sun, Maurice Pagnucco, Yang Song","authorsParsed":[["Sun","Bethia",""],["Pagnucco","Maurice",""],["Song","Yang",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 23:47:58 GMT"},{"version":"v2","created":"Wed, 15 Jan 2025 09:01:09 GMT"},{"version":"v3","created":"Thu, 23 Jan 2025 01:05:05 GMT"}],"updateDate":"2025-01-24","timestamp":1733442478000,"abstract":"  Since the inception of the classicalist vs. connectionist debate, it has been\nargued that the ability to systematically combine symbol-like entities into\ncompositional representations is crucial for human intelligence. In\nconnectionist systems, the field of disentanglement has gained prominence for\nits ability to produce explicitly compositional representations; however, it\nrelies on a fundamentally symbolic, concatenative representation of\ncompositional structure that clashes with the continuous, distributed\nfoundations of deep learning. To resolve this tension, we extend Smolensky's\nTensor Product Representation (TPR) and introduce Soft TPR, a representational\nform that encodes compositional structure in an inherently distributed,\nflexible manner, along with Soft TPR Autoencoder, a theoretically-principled\narchitecture designed specifically to learn Soft TPRs. Comprehensive\nevaluations in the visual representation learning domain demonstrate that the\nSoft TPR framework consistently outperforms conventional disentanglement\nalternatives -- achieving state-of-the-art disentanglement, boosting\nrepresentation learner convergence, and delivering superior sample efficiency\nand low-sample regime performance in downstream tasks. These findings highlight\nthe promise of a distributed and flexible approach to representing\ncompositional structure by potentially enhancing alignment with the core\nprinciples of deep learning over the conventional symbolic approach.\n","subjects":["Computer Science/Machine Learning","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"z32RV1d_EaRAXdO69mMbQ9Y-w0wDQf3ES7bxh7u66Wg","pdfSize":"2834141"}