{"id":"2412.09370","title":"Word Sense Linking: Disambiguating Outside the Sandbox","authors":"Andrei Stefan Bejgu, Edoardo Barba, Luigi Procopio, Alberte\n  Fern\\'andez-Castro, Roberto Navigli","authorsParsed":[["Bejgu","Andrei Stefan",""],["Barba","Edoardo",""],["Procopio","Luigi",""],["Fernández-Castro","Alberte",""],["Navigli","Roberto",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 15:38:34 GMT"}],"updateDate":"2024-12-13","timestamp":1734017914000,"abstract":"  Word Sense Disambiguation (WSD) is the task of associating a word in a given\ncontext with its most suitable meaning among a set of possible candidates.\nWhile the task has recently witnessed renewed interest, with systems achieving\nperformances above the estimated inter-annotator agreement, at the time of\nwriting it still struggles to find downstream applications. We argue that one\nof the reasons behind this is the difficulty of applying WSD to plain text.\nIndeed, in the standard formulation, models work under the assumptions that a)\nall the spans to disambiguate have already been identified, and b) all the\npossible candidate senses of each span are provided, both of which are\nrequirements that are far from trivial. In this work, we present a new task\ncalled Word Sense Linking (WSL) where, given an input text and a reference\nsense inventory, systems have to both identify which spans to disambiguate and\nthen link them to their most suitable meaning.We put forward a\ntransformer-based architecture for the task and thoroughly evaluate both its\nperformance and those of state-of-the-art WSD systems scaled to WSL,\niteratively relaxing the assumptions of WSD. We hope that our work will foster\neasier integration of lexical semantics into downstream applications.\n","subjects":["Computer Science/Computation and Language","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"_4jadfjOHFyaD1eFnTyt0oKC8c_GEto7Xk0_kZZmECc","pdfSize":"498008"}