{
  "id": "2412.10413",
  "title": "Evaluating Robustness of LLMs on Crisis-Related Microblogs across\n  Events, Information Types, and Linguistic Features",
  "authors": "Muhammad Imran, Abdul Wahab Ziaullah, Kai Chen, Ferda Ofli",
  "authorsParsed": [
    [
      "Imran",
      "Muhammad",
      ""
    ],
    [
      "Ziaullah",
      "Abdul Wahab",
      ""
    ],
    [
      "Chen",
      "Kai",
      ""
    ],
    [
      "Ofli",
      "Ferda",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 8 Dec 2024 10:30:29 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1733653829000,
  "abstract": "  The widespread use of microblogging platforms like X (formerly Twitter)\nduring disasters provides real-time information to governments and response\nauthorities. However, the data from these platforms is often noisy, requiring\nautomated methods to filter relevant information. Traditionally, supervised\nmachine learning models have been used, but they lack generalizability. In\ncontrast, Large Language Models (LLMs) show better capabilities in\nunderstanding and processing natural language out of the box. This paper\nprovides a detailed analysis of the performance of six well-known LLMs in\nprocessing disaster-related social media data from a large-set of real-world\nevents. Our findings indicate that while LLMs, particularly GPT-4o and GPT-4,\noffer better generalizability across different disasters and information types,\nmost LLMs face challenges in processing flood-related data, show minimal\nimprovement despite the provision of examples (i.e., shots), and struggle to\nidentify critical information categories like urgent requests and needs.\nAdditionally, we examine how various linguistic features affect model\nperformance and highlight LLMs' vulnerabilities against certain features like\ntypos. Lastly, we provide benchmarking results for all events across both zero-\nand few-shot settings and observe that proprietary models outperform\nopen-source ones in all tasks.\n",
  "subjects": [
    "Computer Science/Computation and Language",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Social and Information Networks"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "1cFoo2nqHB5T1MPT8n_YKNSHKflENUatIN1Te9Y_Ja0",
  "pdfSize": "1928750"
}