{
  "id": "2412.15791",
  "title": "A Bayesian Approach for Earthquake Impact Modelling",
  "authors": "Max Anderson Loake, Hamish Patten, David Steinsaltz",
  "authorsParsed": [
    [
      "Loake",
      "Max Anderson",
      ""
    ],
    [
      "Patten",
      "Hamish",
      ""
    ],
    [
      "Steinsaltz",
      "David",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 11:07:51 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 14 Jan 2025 11:40:18 GMT"
    }
  ],
  "updateDate": "2025-01-15",
  "timestamp": 1734692871000,
  "abstract": "  Immediately following a disaster event, such as an earthquake, estimates of\nthe damage extent play a key role in informing the coordination of response and\nrecovery efforts. We develop a novel impact estimation tool that leverages a\ngeneralised Bayesian approach to generate earthquake impact estimates across\nthree impact types: mortality, population displacement, and building damage.\nInference is performed within a likelihood-free framework, and a\nscoring-rule-based posterior avoids information loss from non-sufficient\nsummary statistics. We propose an adaptation of existing scoring-rule-based\nloss functions that accommodates the use of an approximate Bayesian computation\nsequential Monte Carlo (ABC-SMC) framework. The fitted model achieves results\ncomparable to those of two leading impact estimation tools in the prediction of\ntotal mortality when tested on a set of held-out past events. The proposed\nmethod provides four advantages over existing empirical approaches: modelling\nproduces a gridded spatial map of the estimated impact, predictions benefit\nfrom the Bayesian quantification and interpretation of uncertainty, there is\ndirect handling of multi-shock earthquake events, and the use of a joint model\nbetween impact types allows predictions to be updated as impact observations\nbecome available.\n",
  "subjects": [
    "Statistics/Applications"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "B9s2AHpQHT_eTIbLkk7KIWcsjaU3TEeZGKwFtkOociQ",
  "pdfSize": "12146002"
}