{
  "id": "2412.20659",
  "title": "Nanosatellite Design Considerations for a Mission to Explore the\n  Propellant Sloshing Problem",
  "authors": "Michael fogel, Snigdha Sushil Mishra, and Laurent Burlion",
  "authorsParsed": [
    [
      "fogel",
      "Michael",
      ""
    ],
    [
      "Mishra",
      "Snigdha Sushil",
      ""
    ],
    [
      "Burlion",
      "Laurent",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 30 Dec 2024 02:28:40 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735525720000,
  "abstract": "  Sloshing Platform for In-Orbit Controller Experimentation is an ambitious,\nstudent run mission to design and fly a cubesat to study fluid sloshing in\nspacecraft. The project will examine zero-g propellant sloshing from an\nexperimental standpoint. Despite the small size and limited payload capacity,\nwe intend to use the cubesat platform to mimic larger spacecraft and implement\nnovel detection and computer vision methods in our analysis. Many modern\nspacecraft rely on propellant-filled tanks to perform attitude control and\nstation-keeping maneuvers. When a large percentage of the spacecraft's mass is\ncomprised of liquid propellant, sloshing becomes a critical aspect of\nspacecraft attitude control and stability. The mission will study the\ntank/fluid dynamics using new methods to gain an enhanced understanding of\nlow-gravity fluid disturbance effects and improve simulations using equivalent\nmechanical models (EMMs). Active control of the fluid leading to the reduction\nof propellant slosh settling times will improve the maneuverability and\nperformance of spacecraft. This paper will focus on satellite payload research\nand design requirements used to inform other aspects of the SPICEsat design. In\nthis paper, mission objectives will be discussed, numerical simulations for the\nproposed control algorithms are demonstrated, and a satellite experiment design\nis presented. Finally, we examine computational fluid dynamics models to\nvalidate the satellite design and propellant sensing components of the proposed\nspacecraft.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Systems and Control",
    "Computer Science/Systems and Control"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "3XJCEyRIR15OJTvwuvSqR0IdBH5Nr4FeSd9ZiqvYXQg",
  "pdfSize": "3043957"
}