{
  "id": "2412.17319",
  "title": "Scattering halos in strongly interacting Feshbach molecular\n  Bose-Einstein condensates",
  "authors": "Yuying Chen, Zhengxi Zhang, Chi-Kin Lai, Yun Liang, Hongmian Shui,\n  Haixiang Fu, Fansu Wei, and Xiaoji Zhou",
  "authorsParsed": [
    [
      "Chen",
      "Yuying",
      ""
    ],
    [
      "Zhang",
      "Zhengxi",
      ""
    ],
    [
      "Lai",
      "Chi-Kin",
      ""
    ],
    [
      "Liang",
      "Yun",
      ""
    ],
    [
      "Shui",
      "Hongmian",
      ""
    ],
    [
      "Fu",
      "Haixiang",
      ""
    ],
    [
      "Wei",
      "Fansu",
      ""
    ],
    [
      "Zhou",
      "Xiaoji",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 06:22:14 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734934934000,
  "abstract": "  We investigate the scattering halos resulting from collisions between\ndiscrete momentum components in the time-of-flight expansion of\ninteraction-tunable $^6\\rm Li_2$ molecular Bose-Einstein condensates. A key\nhighlight of this study is the observation of the influence of interactions on\nthe collisional scattering process. We measure the production of scattering\nhalos at different interaction levels by varying the number of particles and\nthe scattering length, and quantitatively assess the applicability of\nperturbation theory. To delve into a general theory of scattering halos, we\nintroduce a scattering factor and obtain a universal relation between it and\nthe halo ratio. Furthermore, we simulate the formation of scattering halos\nunder non-perturbative conditions and analyze the discrepancies between\nsimulation results and experiments through a return pulse experiment. This\nstudy enhances our understanding of the physical mechanisms underlying\nscattering processes in many-body systems and provides new perspectives for\nfurther theoretical research.\n",
  "subjects": [
    "Condensed Matter/Quantum Gases",
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "E7qzQ4eMuqGrxsQJ3V18bJyJGJ7lCmZqLNmSMr6nhZk",
  "pdfSize": "4213154"
}