{"id":"2412.18720","title":"Effective and Lightweight Representation Learning for Link Sign\n  Prediction in Signed Bipartite Graphs","authors":"Gyeongmin Gu, Minseo Jeon, Hyun-Je Song, and Jinhong Jung","authorsParsed":[["Gu","Gyeongmin",""],["Jeon","Minseo",""],["Song","Hyun-Je",""],["Jung","Jinhong",""]],"versions":[{"version":"v1","created":"Wed, 25 Dec 2024 00:39:38 GMT"}],"updateDate":"2024-12-30","timestamp":1735087178000,"abstract":"  How can we effectively and efficiently learn node representations in signed\nbipartite graphs? A signed bipartite graph is a graph consisting of two nodes\nsets where nodes of different types are positively or negative connected, and\nit has been extensively used to model various real-world relationships such as\ne-commerce, etc. To analyze such a graph, previous studies have focused on\ndesigning methods for learning node representations using graph neural\nnetworks. In particular, these methods insert edges between nodes of the same\ntype based on balance theory, enabling them to leverage augmented structures in\ntheir learning. However, the existing methods rely on a naive message passing\ndesign, which is prone to over-smoothing and susceptible to noisy interactions\nin real-world graphs. Furthermore, they suffer from computational inefficiency\ndue to their heavy design and the significant increase in the number of added\nedges.\n  In this paper, we propose ELISE, an effective and lightweight GNN-based\napproach for learning signed bipartite graphs. We first extend personalized\npropagation to a signed bipartite graph, incorporating signed edges during\nmessage passing. This extension adheres to balance theory without introducing\nadditional edges, mitigating the over-smoothing issue and enhancing\nrepresentation power. We then jointly learn node embeddings on a low-rank\napproximation of the signed bipartite graph, which reduces potential noise and\nemphasizes its global structure, further improving expressiveness without\nsignificant loss of efficiency. We encapsulate these ideas into ELISE,\ndesigning it to be lightweight, unlike the previous methods that add too many\nedges and cause inefficiency. Through extensive experiments on real-world\nsigned bipartite graphs, we demonstrate that ELISE outperforms its competitors\nfor predicting link signs while providing faster training and inference time.\n","subjects":["Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ZP0alYushcQN7S1Wf9R-qrJ3D3Hrq81lHJj2kKvs_cA","pdfSize":"1920672"}