{"id":"2412.02493","title":"RelayGS: Reconstructing Dynamic Scenes with Large-Scale and Complex\n  Motions via Relay Gaussians","authors":"Qiankun Gao, Yanmin Wu, Chengxiang Wen, Jiarui Meng, Luyang Tang, Jie\n  Chen, Ronggang Wang, Jian Zhang","authorsParsed":[["Gao","Qiankun",""],["Wu","Yanmin",""],["Wen","Chengxiang",""],["Meng","Jiarui",""],["Tang","Luyang",""],["Chen","Jie",""],["Wang","Ronggang",""],["Zhang","Jian",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 15:08:03 GMT"}],"updateDate":"2024-12-04","timestamp":1733238483000,"abstract":"  Reconstructing dynamic scenes with large-scale and complex motions remains a\nsignificant challenge. Recent techniques like Neural Radiance Fields and 3D\nGaussian Splatting (3DGS) have shown promise but still struggle with scenes\ninvolving substantial movement. This paper proposes RelayGS, a novel method\nbased on 3DGS, specifically designed to represent and reconstruct highly\ndynamic scenes. Our RelayGS learns a complete 4D representation with canonical\n3D Gaussians and a compact motion field, consisting of three stages. First, we\nlearn a fundamental 3DGS from all frames, ignoring temporal scene variations,\nand use a learnable mask to separate the highly dynamic foreground from the\nminimally moving background. Second, we replicate multiple copies of the\ndecoupled foreground Gaussians from the first stage, each corresponding to a\ntemporal segment, and optimize them using pseudo-views constructed from\nmultiple frames within each segment. These Gaussians, termed Relay Gaussians,\nact as explicit relay nodes, simplifying and breaking down large-scale motion\ntrajectories into smaller, manageable segments. Finally, we jointly learn the\nscene's temporal motion and refine the canonical Gaussians learned from the\nfirst two stages. We conduct thorough experiments on two dynamic scene datasets\nfeaturing large and complex motions, where our RelayGS outperforms\nstate-of-the-arts by more than 1 dB in PSNR, and successfully reconstructs\nreal-world basketball game scenes in a much more complete and coherent manner,\nwhereas previous methods usually struggle to capture the complex motion of\nplayers. Code will be publicly available at https://github.com/gqk/RelayGS\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"DBbiH6sdi3T1kPVV4l0ghS6_7DO6LPp3MqrOLBWrgbI","pdfSize":"11464349"}