{
  "id": "2412.15362",
  "title": "Dynamics of metastable contact soliton dissipative exchange flows in\n  one-dimensional ferromagnetic channels",
  "authors": "Medhanie Estiphanos and Ezio Iacocca",
  "authorsParsed": [
    [
      "Estiphanos",
      "Medhanie",
      ""
    ],
    [
      "Iacocca",
      "Ezio",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 19:48:19 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734637699000,
  "abstract": "  Dissipative exchange flows (DEFs) are large-amplitude boundary value\nsolutions of ferromagnetic channels. In their low-injection limit, DEFs reduce\nto spin superfluids. However, in the strong injection limit, nonlinearities\ndominate close to the injection site and a soliton is formed; this solution has\nbeen termed a contact soliton dissipative exchange flow (CS-DEF). Here, we\nnumerically investigate CS-DEF solutions in a moderate injection regime and a\nfinite injection width. We find a solution where two metastable solitons\ncoexist in the injection region. This solution is metastable in the sense that\nany perturbation to the system will eject one of the solitons out of the\ninjection region. Moreover, soliton dynamics can be excited when two injection\nregions are separated by a certain distance. We find that the ensuing DEF\nbetween the solitons induces a steady-state dynamics in which metastable\nsolitons are continually ejected and nucleated. Furthermore, and depending on\nthe relative signs of the spin injections, the soliton dynamics possess a\nparticular handedness and frequency related to the spin transfer torque\ndelivered by the DEF. Our results provide insights into the transport of spin\ncurrent by DEFs - where the interaction between DEFs and solitons suggests a\nmechanism for detaching contact-solitons from the injection boundary. Although\nthis study focuses on the \"nonlocal\" interaction between solitons, it may lead\nto the investigation of new mechanisms for inserting solitons in a DEF, e.g.,\nfor discrete motion and transport of information over long distances.\n",
  "subjects": [
    "Condensed Matter/Mesoscale and Nanoscale Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "dnF8aC0dFg6KoprU0xQJCUL0zAQfuHRYoMYH7kFpPjU",
  "pdfSize": "644649"
}