{
  "id": "2412.05137",
  "title": "Can Large Language Models Serve as Effective Classifiers for\n  Hierarchical Multi-Label Classification of Scientific Documents at Industrial\n  Scale?",
  "authors": "Seyed Amin Tabatabaei, Sarah Fancher, Michael Parsons, Arian Askari",
  "authorsParsed": [
    [
      "Tabatabaei",
      "Seyed Amin",
      ""
    ],
    [
      "Fancher",
      "Sarah",
      ""
    ],
    [
      "Parsons",
      "Michael",
      ""
    ],
    [
      "Askari",
      "Arian",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 15:51:22 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733500282000,
  "abstract": "  We address the task of hierarchical multi-label classification (HMC) of\nscientific documents at an industrial scale, where hundreds of thousands of\ndocuments must be classified across thousands of dynamic labels. The rapid\ngrowth of scientific publications necessitates scalable and efficient methods\nfor classification, further complicated by the evolving nature of\ntaxonomies--where new categories are introduced, existing ones are merged, and\noutdated ones are deprecated. Traditional machine learning approaches, which\nrequire costly retraining with each taxonomy update, become impractical due to\nthe high overhead of labelled data collection and model adaptation. Large\nLanguage Models (LLMs) have demonstrated great potential in complex tasks such\nas multi-label classification. However, applying them to large and dynamic\ntaxonomies presents unique challenges as the vast number of labels can exceed\nLLMs' input limits. In this paper, we present novel methods that combine the\nstrengths of LLMs with dense retrieval techniques to overcome these challenges.\nOur approach avoids retraining by leveraging zero-shot HMC for real-time label\nassignment. We evaluate the effectiveness of our methods on SSRN, a large\nrepository of preprints spanning multiple disciplines, and demonstrate\nsignificant improvements in both classification accuracy and cost-efficiency.\nBy developing a tailored evaluation framework for dynamic taxonomies and\npublicly releasing our code, this research provides critical insights into\napplying LLMs for document classification, where the number of classes\ncorresponds to the number of nodes in a large taxonomy, at an industrial scale.\n",
  "subjects": [
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Vpi_Uvm98ryDgOXBmLd_-2hIv6ey6BpKI25Zit2Bghc",
  "pdfSize": "575574"
}