{
  "id": "2412.01223",
  "title": "PainterNet: Adaptive Image Inpainting with Actual-Token Attention and\n  Diverse Mask Control",
  "authors": "Ruichen Wang, Junliang Zhang, Qingsong Xie, Chen Chen, Haonan Lu",
  "authorsParsed": [
    [
      "Wang",
      "Ruichen",
      ""
    ],
    [
      "Zhang",
      "Junliang",
      ""
    ],
    [
      "Xie",
      "Qingsong",
      ""
    ],
    [
      "Chen",
      "Chen",
      ""
    ],
    [
      "Lu",
      "Haonan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 07:40:47 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733125247000,
  "abstract": "  Recently, diffusion models have exhibited superior performance in the area of\nimage inpainting. Inpainting methods based on diffusion models can usually\ngenerate realistic, high-quality image content for masked areas. However, due\nto the limitations of diffusion models, existing methods typically encounter\nproblems in terms of semantic consistency between images and text, and the\nediting habits of users. To address these issues, we present PainterNet, a\nplugin that can be flexibly embedded into various diffusion models. To generate\nimage content in the masked areas that highly aligns with the user input\nprompt, we proposed local prompt input, Attention Control Points (ACP), and\nActual-Token Attention Loss (ATAL) to enhance the model's focus on local areas.\nAdditionally, we redesigned the MASK generation algorithm in training and\ntesting dataset to simulate the user's habit of applying MASK, and introduced a\ncustomized new training dataset, PainterData, and a benchmark dataset,\nPainterBench. Our extensive experimental analysis exhibits that PainterNet\nsurpasses existing state-of-the-art models in key metrics including image\nquality and global/local text consistency.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "FpW3GGqu-Rh8DZhDupTyQpGlxnFWdLL5XOiPNt44E7Q",
  "pdfSize": "2423102"
}