{
  "id": "2412.04882",
  "title": "Nonmyopic Global Optimisation via Approximate Dynamic Programming",
  "authors": "Filippo Airaldi, Bart De Schutter, Azita Dabiri",
  "authorsParsed": [
    [
      "Airaldi",
      "Filippo",
      ""
    ],
    [
      "De Schutter",
      "Bart",
      ""
    ],
    [
      "Dabiri",
      "Azita",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 09:25:00 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733477100000,
  "abstract": "  Unconstrained global optimisation aims to optimise expensive-to-evaluate\nblack-box functions without gradient information. Bayesian optimisation, one of\nthe most well-known techniques, typically employs Gaussian processes as\nsurrogate models, leveraging their probabilistic nature to balance exploration\nand exploitation. However, Gaussian processes become computationally\nprohibitive in high-dimensional spaces. Recent alternatives, based on inverse\ndistance weighting (IDW) and radial basis functions (RBFs), offer competitive,\ncomputationally lighter solutions. Despite their efficiency, both traditional\nglobal and Bayesian optimisation strategies suffer from the myopic nature of\ntheir acquisition functions, which focus solely on immediate improvement\nneglecting future implications of the sequential decision making process.\nNonmyopic acquisition functions devised for the Bayesian setting have shown\npromise in improving long-term performance. Yet, their use in deterministic\nstrategies with IDW and RBF remains unexplored. In this work, we introduce\nnovel nonmyopic acquisition strategies tailored to IDW- and RBF-based global\noptimisation. Specifically, we develop dynamic programming-based paradigms,\nincluding rollout and multi-step scenario-based optimisation schemes, to enable\nlookahead acquisition. These methods optimise a sequence of query points over a\nhorizon (instead of only at the next step) by predicting the evolution of the\nsurrogate model, inherently managing the exploration-exploitation trade-off in\na systematic way via optimisation techniques. The proposed approach represents\na significant advance in extending nonmyopic acquisition principles, previously\nconfined to Bayesian optimisation, to the deterministic framework. Empirical\nresults on synthetic and hyperparameter tuning benchmark problems demonstrate\nthat these nonmyopic methods outperform conventional myopic approaches.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Statistics/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "UauN2KcmL6SKFVtT97m94wsrTKke1enbF7Pg-VjTAzE",
  "pdfSize": "776271"
}