{
  "id": "2412.03633",
  "title": "NBM: an Open Dataset for the Acoustic Monitoring of Nocturnal Migratory\n  Birds in Europe",
  "authors": "Louis Airale, Adrien Pajot, Juliette Linossier",
  "authorsParsed": [
    [
      "Airale",
      "Louis",
      ""
    ],
    [
      "Pajot",
      "Adrien",
      ""
    ],
    [
      "Linossier",
      "Juliette",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 18:55:45 GMT"
    },
    {
      "version": "v2",
      "created": "Sat, 8 Feb 2025 18:40:33 GMT"
    },
    {
      "version": "v3",
      "created": "Thu, 13 Feb 2025 13:02:25 GMT"
    }
  ],
  "updateDate": "2025-02-14",
  "timestamp": 1733338545000,
  "abstract": "  The persisting threats on migratory bird populations highlight the urgent\nneed for effective monitoring techniques that could assist in their\nconservation. Among these, passive acoustic monitoring is an essential tool,\nparticularly for nocturnal migratory species that are difficult to track\notherwise. This work presents the Nocturnal Bird Migration (NBM) dataset, a\ncollection of 13,359 annotated vocalizations from 117 species of the Western\nPalearctic. The dataset includes precise time and frequency annotations,\ngathered by dozens of bird enthusiasts across France, enabling novel downstream\nacoustic analysis. In particular, we prove the utility of this database by\ntraining an original two-stage deep object detection model tailored for the\nprocessing of audio data. While allowing the precise localization of bird calls\nin spectrograms, this model shows competitive accuracy on the 45 main species\nof the dataset with state-of-the-art systems trained on much larger audio\ncollections. These results highlight the interest of fostering similar\nopen-science initiatives to acquire costly but valuable fine-grained\nannotations of audio files. All data and code are made openly available.\n",
  "subjects": [
    "Computer Science/Sound",
    "Computer Science/Computer Vision and Pattern Recognition",
    "Electrical Engineering and Systems Science/Audio and Speech Processing"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "ohaChNPdyvZNpF0_THmG_8m_QHmsQyIlRnN39vGcLcw",
  "pdfSize": "1418079"
}