{
  "id": "2412.17959",
  "title": "Analysis of Transferred Pre-Trained Deep Convolution Neural Networks in\n  Breast Masses Recognition",
  "authors": "Qusay Shihab Hamad, Hussein Samma, Shahrel Azmin Suandi",
  "authorsParsed": [
    [
      "Hamad",
      "Qusay Shihab",
      ""
    ],
    [
      "Samma",
      "Hussein",
      ""
    ],
    [
      "Suandi",
      "Shahrel Azmin",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 20:16:45 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1734985005000,
  "abstract": "  Breast cancer detection based on pre-trained convolution neural network (CNN)\nhas gained much interest among other conventional computer-based systems. In\nthe past few years, CNN technology has been the most promising way to find\ncancer in mammogram scans. In this paper, the effect of layer freezing in a\npre-trained CNN is investigated for breast cancer detection by classifying\nmammogram images as benign or malignant. Different VGG19 scenarios have been\nexamined based on the number of convolution layer blocks that have been frozen.\nThere are a total of six scenarios in this study. The primary benefits of this\nresearch are twofold: it improves the model's ability to detect breast cancer\ncases and it reduces the training time of VGG19 by freezing certain layers.To\nevaluate the performance of these scenarios, 1693 microbiological images of\nbenign and malignant breast cancers were utilized. According to the reported\nresults, the best recognition rate was obtained from a frozen first block of\nVGG19 with a sensitivity of 95.64 %, while the training of the entire VGG19\nyielded 94.48%.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Image and Video Processing",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "NA3n-PZgQIesfp0GVCc2eI97W_F3SBmSoDuapGZ3F9c",
  "pdfSize": "328529"
}