{
  "id": "2412.04375",
  "title": "Restricted Phase Space Thermodynamics of 4D Dyonic AdS Black Holes:\n  Insights from Kaniadakis Statistics and Emergence of Superfluid\n  $\\lambda$-Phase Transition",
  "authors": "Abhishek Baruah, Prabwal Phukon",
  "authorsParsed": [
    [
      "Baruah",
      "Abhishek",
      ""
    ],
    [
      "Phukon",
      "Prabwal",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 17:49:48 GMT"
    },
    {
      "version": "v2",
      "created": "Mon, 9 Dec 2024 16:19:03 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733420988000,
  "abstract": "  We study the thermodynamics of $4D$ dyonic AdS black hole in the Kaniadakis\nstatistics framework using the Restricted Phase Space (RPST) formalism. This\nframework provides a non-extensive extension of classical statistical\nmechanics, drawing inspiration from relativistic symmetries and presenting a\nfresh perspective on black hole thermodynamics. Our study analyzes how\nincluding Kaniadakis entropy modifies the phase transition of the dyonic black\nholes. We consider the central charge $C$ and its conjugate chemical potential\n$\\mu$ as the thermodynamic variable along with others except the pressure and\nvolume. Due to the addition of the magnetic charge $\\tilde{Q}_m$, the study of\nthe phase transition becomes much richer by obtaining a non-equilibrium phase\ntransition from an unstable small black hole to a stable large black hole along\nwith the Van der Waals phase transition in the $T-S$ processes. In the $F-T$\nplot, we get an extra Hawking-Page phase transition. Including the deformation\nparameter $\\kappa$ introduces an unstable (ultra-large BH) branch seen in\nalmost all the plots. Turning off the magnetic charge flips the direction of\nthe phase transition seen during its presence. We observe a novel phenomenon\nthat is the superfluid $\\lambda$ phase transition in the mixed\n$(\\tilde{\\Phi}_e,\\tilde{Q}_m)$ which is due to the additional $\\tilde{Q}_m$\ninclusion. Also, in the plots varying $\\kappa$ match with the plot varying $C$\nwhich underlines some sort of correspondence in its meaning which is not\npossible to observe in Gibbs-Boltzmann statistics. As the entropy models change\nthe homogeneity is not lost where mass is of the first order and the rest is\nzeroth order. Finally, the $\\mu-C$ processes in quite similar across black hole\nsystems and entropy formulation marking some kind of universality of this\nprocess.\n",
  "subjects": [
    "Physics/High Energy Physics - Theory",
    "Physics/General Relativity and Quantum Cosmology"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "K-oGfcHuXH-m4j1WqAeGP8vuscPHSjvFwiVguJ2FVo0",
  "pdfSize": "2111064"
}