{
  "id": "2412.16564",
  "title": "Predictive Monitoring of Black-Box Dynamical Systems",
  "authors": "Thomas A. Henzinger, Fabian Kresse, Kaushik Mallik, Emily Yu,\n  {\\DJ}or{\\dj}e \\v{Z}ikeli\\'c",
  "authorsParsed": [
    [
      "Henzinger",
      "Thomas A.",
      ""
    ],
    [
      "Kresse",
      "Fabian",
      ""
    ],
    [
      "Mallik",
      "Kaushik",
      ""
    ],
    [
      "Yu",
      "Emily",
      ""
    ],
    [
      "Žikelić",
      "Đorđe",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 21 Dec 2024 10:17:46 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734776266000,
  "abstract": "  We study the problem of predictive runtime monitoring of black-box dynamical\nsystems with quantitative safety properties. The black-box setting stipulates\nthat the exact semantics of the dynamical system and the controller are\nunknown, and that we are only able to observe the state of the controlled (aka,\nclosed-loop) system at finitely many time points. We present a novel framework\nfor predicting future states of the system based on the states observed in the\npast. The numbers of past states and of predicted future states are parameters\nprovided by the user. Our method is based on a combination of Taylor's\nexpansion and the backward difference operator for numerical differentiation.\nWe also derive an upper bound on the prediction error under the assumption that\nthe system dynamics and the controller are smooth. The predicted states are\nthen used to predict safety violations ahead in time. Our experiments\ndemonstrate practical applicability of our method for complex black-box\nsystems, showing that it is computationally lightweight and yet significantly\nmore accurate than the state-of-the-art predictive safety monitoring\ntechniques.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Systems and Control",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Systems and Control"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "rW90YLcwk562upnMrm0CDMqGUlD4hHp_eHFBOiNxTrk",
  "pdfSize": "531744"
}