{
  "id": "2412.07109",
  "title": "Collision Dynamics and Deformation Behaviors of Multi-Core Compound\n  Droplet Pairs in Microchannel Flow",
  "authors": "S M Abdullah Al Mamun and Samaneh Farokhirad",
  "authorsParsed": [
    [
      "Mamun",
      "S M Abdullah Al",
      ""
    ],
    [
      "Farokhirad",
      "Samaneh",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 01:51:51 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733795511000,
  "abstract": "  We numerically investigate the collision dynamics and deformation behaviors\nof double-core compound droplet pairs within confined shear flows using\nfree-energy-based lattice Boltzmann method. While significant research has\nadvanced our understanding of simple droplet pair interactions, the collision\nbehaviors of core-shell compound droplets, where each shell contains one or\nmore core droplets, remain largely unexplored. Even the pairwise interaction of\nsingle-core compound droplets has not been extensively studied. We address how\nthe interplay between physical parameters (i.e., density and viscosity ratios\nof immiscible fluids and Capillary number) and geometric parameters (i.e.,\ninitial offset distance between the shell droplets) affects the interaction\ntime and collision outcomes of compound droplets. Our findings reveal that the\npresence of inner droplets significantly influences the deformation and\nstability of shell droplets, as well as the collision outcomes of both shell\nand core droplets. We identify several distinct collision outcomes, including\n(i) coalescence of shell droplets, with core droplets remaining separate and\nrotating in a planetary-like motion, (ii) pass-over of shell droplets, where\ncore droplets maintain separation and exhibit both rotational and translational\nmotion, (iii) coalescence of core droplets, with shell droplets passing each\nother, and (iv) pass-over of shell droplets, with the coalescence of core\ndroplets. We demonstrate that the transition between these collision outcomes\nis governed by varying the Capillary number and initial offset. Additionally,\nwe observed that increasing the density and viscosity ratios from unity to\nlarger values always results in the pass-over of shell droplets, with the core\ndroplets remain separated and experience rotational motion.\n",
  "subjects": [
    "Physics/Fluid Dynamics",
    "Physics/Computational Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "nLb7zNQSaucaV1uedTDT1w8h3ZvqmSlCJ2ezSqLJEWM",
  "pdfSize": "28036041"
}