{"id":"2412.14651","title":"Dual Photonics Probing of Nano- to Submicron-Scale Structural\n  Alterations in Human Brain Tissues or Cells and Chromatin or DNA with the\n  Progression of Alzheimers Disease","authors":"Fatemah Alharthi, Ishmael Apachigawo, Dhruvil Solanki, Sazzad Khan,\n  Himanshi Singh, Mohammad Moshahid Khan, and Prabhakar Pradhan","authorsParsed":[["Alharthi","Fatemah",""],["Apachigawo","Ishmael",""],["Solanki","Dhruvil",""],["Khan","Sazzad",""],["Singh","Himanshi",""],["Khan","Mohammad Moshahid",""],["Pradhan","Prabhakar",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 09:02:22 GMT"}],"updateDate":"2024-12-20","timestamp":1734598942000,"abstract":"  Understanding alterations in structural disorders in tissue or cells or\nbuilding blocks, such as DNA or chromatin in the human brain, at the nano to\nsubmicron level provides us with efficient biomarkers for Alzheimers detection.\nHere, we report a dual photonics technique to detect nano- to submicron-scale\nalterations in brain tissues or cells and DNA or chromatin due to the early to\nlate progression of Alzheimers disease in humans. Using a recently developed\nmesoscopic light transport technique, fine-focused nano-sensitive partial wave\nspectroscopy (PWS), we measure the degree of structural disorder in tissues.\nFurthermore, the chemical-specific inverse participation ratio technique (IPR)\nwas used to measure the DNA or chromatin structural alterations. The results of\nthe PWS and IPR experiments showed a significant increase in the degree of\nstructural disorder at the nano to submicron scale at different stages of AD\nrelative to their controls for both the tissue or cell and DNA cellular levels.\nThe increase in the structural disorder in cells or tissues and DNA or\nchromatin in the nuclei can be attributed to higher mass density fluctuations\nin the tissue and DNA or chromatin damage in the nuclei caused by the\nrearrangements of macromolecules due to the deposition of the amyloid beta\nprotein and damage in DNA or chromatin with the progress of AD.\n","subjects":["Physics/Medical Physics","Physics/Biological Physics","Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"lVkZYMcNakLaZCrvjy_nh-zFZkG2t14HHfYn6Zm7rt4","pdfSize":"742075"}