{"id":"2412.10780","title":"Continual Learning for Behavior-based Driver Identification","authors":"Mattia Fanan, Davide Dalle Pezze, Emad Efatinasab, Ruggero Carli,\n  Mirco Rampazzo, Gian Antonio Susto","authorsParsed":[["Fanan","Mattia",""],["Pezze","Davide Dalle",""],["Efatinasab","Emad",""],["Carli","Ruggero",""],["Rampazzo","Mirco",""],["Susto","Gian Antonio",""]],"versions":[{"version":"v1","created":"Sat, 14 Dec 2024 10:24:44 GMT"}],"updateDate":"2024-12-17","timestamp":1734171884000,"abstract":"  Behavior-based Driver Identification is an emerging technology that\nrecognizes drivers based on their unique driving behaviors, offering important\napplications such as vehicle theft prevention and personalized driving\nexperiences. However, most studies fail to account for the real-world\nchallenges of deploying Deep Learning models within vehicles. These challenges\ninclude operating under limited computational resources, adapting to new\ndrivers, and changes in driving behavior over time. The objective of this study\nis to evaluate if Continual Learning (CL) is well-suited to address these\nchallenges, as it enables models to retain previously learned knowledge while\ncontinually adapting with minimal computational overhead and resource\nrequirements. We tested several CL techniques across three scenarios of\nincreasing complexity based on the well-known OCSLab dataset. This work\nprovides an important step forward in scalable driver identification solutions,\ndemonstrating that CL approaches, such as DER, can obtain strong performance,\nwith only an 11% reduction in accuracy compared to the static scenario.\nFurthermore, to enhance the performance, we propose two new methods, SmooER and\nSmooDER, that leverage the temporal continuity of driver identity over time to\nenhance classification accuracy. Our novel method, SmooDER, achieves optimal\nresults with only a 2% reduction compared to the 11\\% of the DER approach. In\nconclusion, this study proves the feasibility of CL approaches to address the\nchallenges of Driver Identification in dynamic environments, making them\nsuitable for deployment on cloud infrastructure or directly within vehicles.\n","subjects":["Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"zfqR-ihOEPYPCiOMkMpdzPWq3C8mtwIKfwJk0h8MN1Y","pdfSize":"782455"}