{
  "id": "2412.14178",
  "title": "The GAIUS Experience: Powering a Hyperlocal Mobile Web for Communities\n  in Emerging Regions",
  "authors": "Rohail Asim, Arjuna Sathiaseelan, Arko Chatterjee, Mukund Lal, Yasir\n  Zaki, Lakshmi Subramanian",
  "authorsParsed": [
    [
      "Asim",
      "Rohail",
      ""
    ],
    [
      "Sathiaseelan",
      "Arjuna",
      ""
    ],
    [
      "Chatterjee",
      "Arko",
      ""
    ],
    [
      "Lal",
      "Mukund",
      ""
    ],
    [
      "Zaki",
      "Yasir",
      ""
    ],
    [
      "Subramanian",
      "Lakshmi",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 18:51:04 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1733251864000,
  "abstract": "  Despite increasing mobile Internet penetration in developing regions, mobile\nusers continue to experience a poor web experience due to two key factors: (i)\nlack of locally relevant content; (ii) poor web performance due to complex web\npages and poor network conditions. In this paper, we describe our design,\nimplementation and deployment experiences of GAIUS, a mobile content ecosystem\nthat enables efficient creation and dissemination of locally relevant web\ncontent into hyperlocal communities in emerging markets. The basic building\nblocks of GAIUS are a lightweight content edge platform combined with a mobile\napplication that collectively provide a Hyperlocal Web abstraction for mobile\nusers to create and consume locally relevant content and interact with other\nusers via a community abstraction. The GAIUS platform uses MAML, a web\nspecification language that dramatically simplifies web pages to reduce the\ncomplexity of Web content within the GAIUS ecosystem, improve page load times\nand reduce network costs. In this paper, we describe our experiences deploying\nGAIUS across a large user base in India, Bangladesh and Kenya.\n",
  "subjects": [
    "Computer Science/Networking and Internet Architecture"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "kjBLZd86BXJa5rwhDNCll4AV7xK5p5J9NmnumowCCzE",
  "pdfSize": "3375795"
}