{"id":"2412.10966","title":"FlowDock: Geometric Flow Matching for Generative Protein-Ligand Docking\n  and Affinity Prediction","authors":"Alex Morehead and Jianlin Cheng","authorsParsed":[["Morehead","Alex",""],["Cheng","Jianlin",""]],"versions":[{"version":"v1","created":"Sat, 14 Dec 2024 20:54:37 GMT"},{"version":"v2","created":"Wed, 15 Jan 2025 21:20:03 GMT"}],"updateDate":"2025-01-17","timestamp":1734209677000,"abstract":"  Powerful generative AI models of protein-ligand structure have recently been\nproposed, but few of these methods support both flexible protein-ligand docking\nand affinity estimation. Of those that do, none can directly model multiple\nbinding ligands concurrently or have been rigorously benchmarked on\npharmacologically relevant drug targets, hindering their widespread adoption in\ndrug discovery efforts. In this work, we propose FlowDock, the first deep\ngeometric generative model based on conditional flow matching that learns to\ndirectly map unbound (apo) structures to their bound (holo) counterparts for an\narbitrary number of binding ligands. Furthermore, FlowDock provides predicted\nstructural confidence scores and binding affinity values with each of its\ngenerated protein-ligand complex structures, enabling fast virtual screening of\nnew (multi-ligand) drug targets. For the well-known PoseBusters Benchmark\ndataset, FlowDock outperforms single-sequence AlphaFold 3 with a 51% blind\ndocking success rate using unbound (apo) protein input structures and without\nany information derived from multiple sequence alignments, and for the\nchallenging new DockGen-E dataset, FlowDock outperforms single-sequence\nAlphaFold 3 and matches single-sequence Chai-1 for binding pocket\ngeneralization. Additionally, in the ligand category of the 16th community-wide\nCritical Assessment of Techniques for Structure Prediction (CASP16), FlowDock\nranked among the top-5 methods for pharmacological binding affinity estimation\nacross 140 protein-ligand complexes, demonstrating the efficacy of its learned\nrepresentations in virtual screening. Source code, data, and pre-trained models\nare available at https://github.com/BioinfoMachineLearning/FlowDock.\n","subjects":["Computer Science/Machine Learning","Computer Science/Artificial Intelligence","Quantitative Biology/Biomolecules","Quantitative Biology/Quantitative Methods"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"eHXDvbnJqi2ZPekSCbXLe6HdU3ri4HhDJ08eKGeuXDQ","pdfSize":"5141685"}