{
  "id": "2412.03764",
  "title": "Thermodynamic Fidelity of Generative Models for Ising System",
  "authors": "Brian H. Lee, Kat Nykiel, Ava E. Hallberg, Brice Rider, Alejandro\n  Strachan",
  "authorsParsed": [
    [
      "Lee",
      "Brian H.",
      ""
    ],
    [
      "Nykiel",
      "Kat",
      ""
    ],
    [
      "Hallberg",
      "Ava E.",
      ""
    ],
    [
      "Rider",
      "Brice",
      ""
    ],
    [
      "Strachan",
      "Alejandro",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 23:02:38 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733353358000,
  "abstract": "  Machine learning has become a central technique for modeling in science and\nengineering, either complementing or as surrogates to physics-based models.\nSignificant efforts have recently been devoted to models capable of predicting\nfield quantities but the limitations of current state-of-the-art models in\ndescribing complex physics are not well understood. We characterize the ability\nof generative diffusion models and generative adversarial networks (GAN) to\ndescribe the Ising model. We find diffusion models trained using equilibrium\nconfigurations obtained using Metropolis Monte Carlo for a range of\ntemperatures around the critical temperature can capture average thermodynamic\nvariables across the phase transformation and extrapolate to higher and lower\ntemperatures. The model also captures the overall trends of physical properties\nassociated with fluctuations (specific heat and susceptibility) except at the\nnon-ergodic low temperatures and non-trivial scale-free correlations at the\ncritical temperature, albeit with some difference in the critical exponent\ncompared to Monte Carlo simulations. GANs perform more poorly on thermodynamic\nproperties and are susceptible to mode-collapse without careful training. This\ninvestigation highlights the potential and limitations of generative models in\ncapturing the complex phenomena associated with certain physical systems.\n",
  "subjects": [
    "Condensed Matter/Statistical Mechanics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "8RmULTsh7oOzubcVKWRbdGutfYJMha9YpEyQN6QASCE",
  "pdfSize": "2170958"
}