{"id":"2412.00472","title":"Enhancing Skin Cancer Diagnosis (SCD) Using Late Discrete Wavelet\n  Transform (DWT) and New Swarm-Based Optimizers","authors":"Ramin Mousa, Saeed Chamani, Mohammad Morsali, Mohammad Kazzazi, Parsa\n  Hatami, Soroush Sarabi","authorsParsed":[["Mousa","Ramin",""],["Chamani","Saeed",""],["Morsali","Mohammad",""],["Kazzazi","Mohammad",""],["Hatami","Parsa",""],["Sarabi","Soroush",""]],"versions":[{"version":"v1","created":"Sat, 30 Nov 2024 13:17:52 GMT"}],"updateDate":"2024-12-03","timestamp":1732972672000,"abstract":"  Skin cancer (SC) stands out as one of the most life-threatening forms of\ncancer, with its danger amplified if not diagnosed and treated promptly. Early\nintervention is critical, as it allows for more effective treatment approaches.\nIn recent years, Deep Learning (DL) has emerged as a powerful tool in the early\ndetection and skin cancer diagnosis (SCD). Although the DL seems promising for\nthe diagnosis of skin cancer, still ample scope exists for improving model\nefficiency and accuracy. This paper proposes a novel approach to skin cancer\ndetection, utilizing optimization techniques in conjunction with pre-trained\nnetworks and wavelet transformations. First, normalized images will undergo\npre-trained networks such as Densenet-121, Inception, Xception, and MobileNet\nto extract hierarchical features from input images. After feature extraction,\nthe feature maps are passed through a Discrete Wavelet Transform (DWT) layer to\ncapture low and high-frequency components. Then the self-attention module is\nintegrated to learn global dependencies between features and focus on the most\nrelevant parts of the feature maps. The number of neurons and optimization of\nthe weight vectors are performed using three new swarm-based optimization\ntechniques, such as Modified Gorilla Troops Optimizer (MGTO), Improved Gray\nWolf Optimization (IGWO), and Fox optimization algorithm. Evaluation results\ndemonstrate that optimizing weight vectors using optimization algorithms can\nenhance diagnostic accuracy and make it a highly effective approach for SCD.\nThe proposed method demonstrates substantial improvements in accuracy,\nachieving top rates of 98.11% with the MobileNet + Wavelet + FOX and DenseNet +\nWavelet + Fox combination on the ISIC-2016 dataset and 97.95% with the\nInception + Wavelet + MGTO combination on the ISIC-2017 dataset, which improves\naccuracy by at least 1% compared to other methods.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Machine Learning","Computer Science/Neural and Evolutionary Computing","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8olhRm2d4eFo-qICjjcjbpJgvEj2i3lqtRi6W3O8MWA","pdfSize":"683606"}