{"id":"2412.13250","title":"Cosmology with Supernova Encore in the lensing cluster MACS J0138$-$2155\n  -- Spectroscopy with MUSE","authors":"G. Granata, G. B. Caminha, S. Ertl, C. Grillo, S. Schuldt, S. H. Suyu,\n  A. Acebron, P. Bergamini, R. Ca\\~nameras, P. Rosati and S. Taubenberger","authorsParsed":[["Granata","G.",""],["Caminha","G. B.",""],["Ertl","S.",""],["Grillo","C.",""],["Schuldt","S.",""],["Suyu","S. H.",""],["Acebron","A.",""],["Bergamini","P.",""],["Cañameras","R.",""],["Rosati","P.",""],["Taubenberger","S.",""]],"versions":[{"version":"v1","created":"Tue, 17 Dec 2024 19:00:00 GMT"}],"updateDate":"2024-12-19","timestamp":1734462000000,"abstract":"  We present a spectroscopic analysis of MACS J0138$-$2155, at $z=0.336$, the\nfirst galaxy cluster hosting two strongly-lensed supernovae (SNe), Requiem and\nEncore, providing us with a chance to obtain a reliable $H_0$ measurement from\nthe time delays between the multiple images. We take advantage of new data from\nthe Multi Unit Spectroscopic Explorer (MUSE) on the Very Large Telescope,\ncovering a central $1 \\rm \\, arcmin^2$ of the lensing cluster, for a total\ndepth of 3.7 hours, including 2.9 hours recently obtained by our Target of\nOpportunity programme. Our new spectroscopic catalogue contains reliable\nredshifts for 107 objects, including 50 galaxy cluster members with secure\nredshift values in the range $0.324 < z < 0.349$, and 13 lensed multiple images\nfrom four background sources between $0.767\\leq z \\leq 3.420$, including four\nimages of the host galaxy of the two SNe. We exploit the MUSE data to study the\nstellar kinematics of 14 bright cluster members and two background galaxies,\nobtaining reliable measurements of their line-of-sight velocity dispersion.\nFinally, we combine these results with measurements of the total magnitude of\nthe cluster members in the Hubble Space Telescope F160W band to calibrate the\nFaber-Jackson relation between luminosity and stellar velocity dispersion ($L\n\\propto \\sigma^{1/\\alpha}$) for the early-type cluster member galaxies,\nmeasuring a slope $\\alpha=0.25^{+0.05}_{-0.05}$. A pure and complete sample of\ncluster member galaxies and a reliable characterisation of their total mass\nstructure are key to building accurate total mass maps of the cluster,\nmitigating the impact of parametric degeneracies, which is necessary for\ninferring the value of $H_0$ from the measured time delays between the lensed\nimages of the two SNe.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"hIs9QT659uXnfFbhEoSo6Ejz6jK1J7RgKtpb_uRXw1M","pdfSize":"28644283"}