{"id":"2412.10745","title":"Enhancing Event Extraction from Short Stories through Contextualized\n  Prompts","authors":"Chaitanya Kirti (1), Ayon Chattopadhyay (1), Ashish Anand (1) and\n  Prithwijit Guha (1) ((1) Indian Institute of Technology Guwahati)","authorsParsed":[["Kirti","Chaitanya","","Indian Institute of Technology Guwahati"],["Chattopadhyay","Ayon","","Indian Institute of Technology Guwahati"],["Anand","Ashish","","Indian Institute of Technology Guwahati"],["Guha","Prithwijit","","Indian Institute of Technology Guwahati"]],"versions":[{"version":"v1","created":"Sat, 14 Dec 2024 08:28:52 GMT"}],"updateDate":"2024-12-17","timestamp":1734164932000,"abstract":"  Event extraction is an important natural language processing (NLP) task of\nidentifying events in an unstructured text. Although a plethora of works deal\nwith event extraction from new articles, clinical text etc., only a few works\nfocus on event extraction from literary content. Detecting events in short\nstories presents several challenges to current systems, encompassing a\ndifferent distribution of events as compared to other domains and the portrayal\nof diverse emotional conditions. This paper presents \\texttt{Vrittanta-EN}, a\ncollection of 1000 English short stories annotated for real events. Exploring\nthis field could result in the creation of techniques and resources that\nsupport literary scholars in improving their effectiveness. This could\nsimultaneously influence the field of Natural Language Processing. Our\nobjective is to clarify the intricate idea of events in the context of short\nstories. Towards the objective, we collected 1,000 short stories written mostly\nfor children in the Indian context. Further, we present fresh guidelines for\nannotating event mentions and their categories, organized into \\textit{seven\ndistinct classes}. The classes are {\\tt{COGNITIVE-MENTAL-STATE(CMS),\nCOMMUNICATION(COM), CONFLICT(CON), GENERAL-ACTIVITY(GA), LIFE-EVENT(LE),\nMOVEMENT(MOV), and OTHERS(OTH)}}. Subsequently, we apply these guidelines to\nannotate the short story dataset. Later, we apply the baseline methods for\nautomatically detecting and categorizing events. We also propose a prompt-based\nmethod for event detection and classification. The proposed method outperforms\nthe baselines, while having significant improvement of more than 4\\% for the\nclass \\texttt{CONFLICT} in event classification task.\n","subjects":["Computer Science/Information Retrieval"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"vx-1nXugmmNdBHsuUADRTSSMQIc20GvjC5qEI8KgOR0","pdfSize":"2238370"}