{"id":"2412.09711","title":"Measuring Partial Reachability in the Public Internet","authors":"Guillermo Baltra, Tarang Saluja, Yuri Pradkin and John Heidemann","authorsParsed":[["Baltra","Guillermo",""],["Saluja","Tarang",""],["Pradkin","Yuri",""],["Heidemann","John",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 20:12:06 GMT"}],"updateDate":"2024-12-16","timestamp":1734034326000,"abstract":"  The Internet provides global connectivity by virtue of a public core -- the\nroutable public IP addresses that host services and to which cloud, enterprise,\nand home networks connect. Today the public core faces many challenges to\nuniform, global reachability: firewalls and access control lists, commercial\ndisputes that stretch for days or years, and government-mandated sanctions. We\ndefine two algorithms to detect partial connectivity: Taitao detects peninsulas\nof persistent, partial connectivity, and Chiloe detects islands, when one or\nmore computers are partitioned from the public core. These new algorithms apply\nto existing data collected by multiple long-lived measurement studies. We\nevaluate these algorithms with rigorous measurements from two platforms:\nTrinocular, where 6 locations observe 5M networks frequently, RIPE Atlas, where\n10k locations scan the DNS root frequently, and validate adding a third: CAIDA\nArk, where 171 locations traceroute to millions of networks daily. Root causes\nsuggest that most peninsula events (45%) are routing transients, but most\npeninsula-time (90%) is due to long-lived events (7%). We show that the concept\nof peninsulas and islands can improve existing measurement systems. They\nidentify measurement error and persistent problems in RIPE's DNSmon that are\n$5\\times$ to $9.7\\times$ larger than the operationally important changes of\ninterest. They explain previously contradictory results in several outage\ndetection systems. Peninsulas are at least as common as Internet outages,\nposing new research direction.\n","subjects":["Computer Science/Networking and Internet Architecture"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"tu3OIqpNyTF-QMLTWWa1F2kq_rRbCMGioRrd18-2Qsc","pdfSize":"1603916"}