{
  "id": "2412.10133",
  "title": "You Name It, I Run It: An LLM Agent to Execute Tests of Arbitrary\n  Projects",
  "authors": "Islem Bouzenia, Michael Pradel",
  "authorsParsed": [
    [
      "Bouzenia",
      "Islem",
      ""
    ],
    [
      "Pradel",
      "Michael",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 13:30:51 GMT"
    }
  ],
  "updateDate": "2024-12-16",
  "timestamp": 1734096651000,
  "abstract": "  The ability to execute the test suite of a project is essential in many\nscenarios, e.g., to assess code quality and code coverage, to validate code\nchanges made by developers or automated tools, and to ensure compatibility with\ndependencies. Despite its importance, executing the test suite of a project can\nbe challenging in practice because different projects use different programming\nlanguages, software ecosystems, build systems, testing frameworks, and other\ntools. These challenges make it difficult to create a reliable, universal test\nexecution method that works across different projects. This paper presents\nExecutionAgent, an automated technique that installs arbitrary projects,\nconfigures them to run test cases, and produces project-specific scripts to\nreproduce the setup. Inspired by the way a human developer would address this\ntask, our approach is a large language model-based agent that autonomously\nexecutes commands and interacts with the host system. The agent uses\nmeta-prompting to gather guidelines on the latest technologies related to the\ngiven project, and it iteratively refines its process based on feedback from\nthe previous steps. Our evaluation applies ExecutionAgent to 50 open-source\nprojects that use 14 different programming languages and many different build\nand testing tools. The approach successfully executes the test suites of 33/55\nprojects, while matching the test results of ground truth test suite executions\nwith a deviation of only 7.5\\%. These results improve over the best previously\navailable technique by 6.6x. The costs imposed by the approach are reasonable,\nwith an execution time of 74 minutes and LLM costs of 0.16 dollars, on average\nper project. We envision ExecutionAgent to serve as a valuable tool for\ndevelopers, automated programming tools, and researchers that need to execute\ntests across a wide variety of projects.\n",
  "subjects": [
    "Computer Science/Software Engineering",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "tJEVwvyRza-crTNdtIm9qbVk0Pfwdm1mgGYk7R5-FEE",
  "pdfSize": "2318255"
}