{
  "id": "2412.05640",
  "title": "The Field-based Model: A New Perspective on RF-based Material Sensing",
  "authors": "Fei Shang, Haocheng Jiang, Panlong Yang, Dawei Yan, Haohua Du,\n  Xiang-Yang Li",
  "authorsParsed": [
    [
      "Shang",
      "Fei",
      ""
    ],
    [
      "Jiang",
      "Haocheng",
      ""
    ],
    [
      "Yang",
      "Panlong",
      ""
    ],
    [
      "Yan",
      "Dawei",
      ""
    ],
    [
      "Du",
      "Haohua",
      ""
    ],
    [
      "Li",
      "Xiang-Yang",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 7 Dec 2024 12:51:47 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733575907000,
  "abstract": "  This paper introduces the design and implementation of WiField, a WiFi\nsensing system deployed on COTS devices that can simultaneously identify\nmultiple wavelength-level targets placed flexibly. Unlike traditional RF\nsensing schemes that focus on specific targets and RF links, WiField focuses on\nall media in the sensing area for the entire electric field. In this\nperspective, WiField provides a unified framework to finely characterize the\ndiffraction, scattering, and other effects of targets at different positions,\nmaterials, and numbers on signals. The combination of targets in different\npositions, numbers, and sizes is just a special case. WiField proposed a scheme\nthat utilizes phaseless data to complete the inverse mapping from electric\nfield to material distribution, thereby achieving the simultaneous\nidentification of multiple wavelength-level targets at any position and having\nthe potential for deployment on a wide range of low-cost COTS devices. Our\nevaluation results show that it has an average identification accuracy of over\n97% for 1-3 targets (5 cm * 10 cm in size) with different materials randomly\nplaced within a 1.05 m * 1.05 m area.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Signal Processing"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "X0nAI-eAty18ThpNr7WuH9crtVaePWLPG88Iibt3N70",
  "pdfSize": "1258223"
}