{"id":"2412.01324","title":"Sparse Hierarchical Non-Linear Programming for Inverse Kinematic\n  Planning and Control with Autonomous Goal Selection","authors":"Kai Pfeiffer","authorsParsed":[["Pfeiffer","Kai",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 09:45:32 GMT"},{"version":"v2","created":"Wed, 25 Dec 2024 09:42:37 GMT"}],"updateDate":"2024-12-30","timestamp":1733132732000,"abstract":"  Sparse programming is an important tool in robotics, for example in real-time\nsparse inverse kinematic control with a minimum number of active joints, or\nautonomous Cartesian goal selection. However, current approaches are limited to\nreal-time control without consideration of the underlying non-linear problem.\nThis prevents the application to non-linear problems like inverse kinematic\nplanning while the robot simultaneously and autonomously chooses from a set of\npotential end-effector goal positions. Instead, kinematic reachability\napproximations are used while the robot's whole body motion is considered\nseparately. This can lead to infeasible goals. Furthermore, the sparse\nconstraints are not prioritized for intuitive problem formulation. Lastly, the\ncomputational effort of standard sparse solvers is cubically dependent on the\nnumber of constraints which prevents real-time control in the presence of a\nlarge number of possible goals. In this work, we develop a non-linear solver\nfor sparse hierarchical non-linear programming. Sparse non-linear constraints\nfor autonomous goal selection can be formulated on any priority level, which\nenables hierarchical decision making capabilities. The solver scales linearly\nin the number of constraints. This facilitates efficient robot sparse\nhierarchical inverse kinematic planning and real-time control with simultaneous\nand autonomous goal selection from a high number of possible goal positions\nwithout any reachability approximations.\n","subjects":["Computer Science/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"sliUG6hwxCKIQYZpgDAvPRPmhCyEld9U2t-ZUmF14oI","pdfSize":"981692"}