{"id":"2412.06093","title":"Selective Enrichment of Full AAV Capsids","authors":"Vivekananda Bal, Jacqueline M. Wolfrum, Paul W. Barone, Stacy L.\n  Springs, Anthony J. Sinskey, Robert M. Kotin, and Richard D. Braatz","authorsParsed":[["Bal","Vivekananda",""],["Wolfrum","Jacqueline M.",""],["Barone","Paul W.",""],["Springs","Stacy L.",""],["Sinskey","Anthony J.",""],["Kotin","Robert M.",""],["Braatz","Richard D.",""]],"versions":[{"version":"v1","created":"Sun, 8 Dec 2024 22:52:57 GMT"}],"updateDate":"2024-12-10","timestamp":1733698377000,"abstract":"  Gene therapies using recombinant adeno-associated virus (rAAV) have been\ndeveloped to treat monogenic and acquired diseases but are currently the most\nexpensive drugs due, in part, to high manufacturing costs. The cells producing\nrAAV generate substantial quantities of empty (50-90%) and partially filled\ncapsids that must be removed prior to final formulation. The conventional\nseparation processes are inefficient in removing empty and partially filled\ncapsids, have low yield, scale poorly, time consuming and need additional\npurification steps. This article demonstrates one step separation of full\ncapsids from a mixture of full, partially filled, and empty capsids, and other\nprotein impurities using selective crystallization, a purification process,\nwhich is first time in protein purification and is performed without physically\nor chemically modifying the target component for the first time in the history\nof selective crystallization, and is highly-efficient, highly-scalable, and\neconomical. Hanging-drop vapor diffusion experiments were used to scout\ncrystallization conditions in which full and empty capsids crystallize, then to\ndefine conditions in which crystals of full, empty, or both full and empty\ncapsids nucleate and grow. The experimental results for rAAV serotypes 5, 8,\nand 9 as exemplary vectors and scale-up results show that full capsids can be\nselectively crystallized and separated in one step from a mixture of full,\npartially filled, and empty capsids, and other proteins with full capsid\nenrichment of greater than 80%, approximately 20% higher, and yield of greater\nthan 90%, approximately greater than 30% higher from the existing methods,\nkeeping their biological activity intact, in a short period of time (less than\n4 h), with approximately 87% reduction in processing time from the existing\nprocessing time and without the need of additional purification steps and in\none round.\n","subjects":["Physics/Medical Physics","Quantitative Biology/Biomolecules"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"EFjbZ8LN1m6kndF6iHwhnM0j85aI-nzp0UeMRF-dfY4","pdfSize":"5551386"}