{
  "id": "2412.00363",
  "title": "Probabilistic Prediction of Ship Maneuvering Motion using Ensemble\n  Learning with Feedforward Neural Networks",
  "authors": "Kouki Wakita and Youhei Akimoto and Atsuo Maki",
  "authorsParsed": [
    [
      "Wakita",
      "Kouki",
      ""
    ],
    [
      "Akimoto",
      "Youhei",
      ""
    ],
    [
      "Maki",
      "Atsuo",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 30 Nov 2024 05:34:58 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1732944898000,
  "abstract": "  In the field of Maritime Autonomous Surface Ships (MASS), the accurate\nmodeling of ship maneuvering motion for harbor maneuvers is a crucial\ntechnology. Non-parametric system identification (SI) methods, which do not\nrequire prior knowledge of the target ship, have the potential to produce\naccurate maneuvering models using observed data. However, the modeling accuracy\nsignificantly depends on the distribution of the available data. To address\nthese issues, we propose a probabilistic prediction method of maneuvering\nmotion that incorporates ensemble learning into a non-parametric SI using\nfeedforward neural networks. This approach captures the epistemic uncertainty\ncaused by insufficient or unevenly distributed data. In this paper, we show the\nprediction accuracy and uncertainty prediction results for various unknown\nscenarios, including port navigation, zigzag, turning, and random control\nmaneuvers, assuming that only port navigation data is available. Furthermore,\nthis paper demonstrates the utility of the proposed method as a maneuvering\nsimulator for assessing heading-keeping PD control. As a result, it was\nconfirmed that the proposed method can achieve high accuracy if training data\nwith similar state distributions is provided, and that it can also predict high\nuncertainty for states that deviate from the training data distribution. In the\nperformance evaluation of PD control, it was confirmed that considering\nworst-case scenarios reduces the possibility of overestimating performance\ncompared to the true system. Finally, we show the results of applying the\nproposed method to full-scale ship data, demonstrating its applicability to\nfull-scale ships.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Systems and Control",
    "Computer Science/Robotics",
    "Computer Science/Systems and Control"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "WA6KVVcQHLssMoDi5dhl-jPPfsAZ_mJA-_nku-NqgSo",
  "pdfSize": "16376511"
}