{"id":"2412.07347","title":"Quantitative Comparison of the Total Focusing Method, Reverse Time\n  Migration, and Full Waveform Inversion for Ultrasonic Imaging","authors":"Tim B\\\"urchner, Simon Schmid, Lukas Bergbreiter, Ernst Rank, Stefan\n  Kollmannsberger, Christian U. Grosse","authorsParsed":[["Bürchner","Tim",""],["Schmid","Simon",""],["Bergbreiter","Lukas",""],["Rank","Ernst",""],["Kollmannsberger","Stefan",""],["Grosse","Christian U.",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 09:40:00 GMT"}],"updateDate":"2024-12-11","timestamp":1733823600000,"abstract":"  Phased array ultrasound is a widely used technique in non-destructive\ntesting. Using piezoelectric elements as both sources and receivers provides a\nsignificant gain in information and enables more accurate defect detection.\nWhen all source-receiver combinations are used, the process is called full\nmatrix capture. The total focusing method~(TFM), which exploits such datasets,\nrelies on a delay and sum algorithm to sum up the signals on a pixel grid.\nHowever, TFM only uses the first arriving p-waves, making it challenging to\nsize complex-shaped defects. By contrast, more advanced methods such as reverse\ntime migration~(RTM) and full waveform inversion~(FWI) use full waveforms to\nreconstruct defects. Both methods compare measured signals with ultrasound\nsimulations. While RTM identifies defects by convolving forward and backward\nwavefields once, FWI iteratively updates material models to reconstruct the\nactual distribution of material properties. This study compares TFM, RTM, and\nFWI for six specimens featuring circular defects or Y-shaped notches. The\nreconstructed results are first evaluated qualitatively using different\nthresholds and then quantitatively using metrics such as AUPRC, AUROC, and\nF1-score. The results show that FWI performs best in most cases, both\nqualitatively and quantitatively.\n","subjects":["Computer Science/Computational Engineering, Finance, and Science","Computer Science/Numerical Analysis","Mathematics/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"uH-u7YGZZmW_T-JPkP-ood9DB2g_HZsj6reP6DQULbQ","pdfSize":"4452742"}