{
  "id": "2412.01950",
  "title": "A Novel Generative Multi-Task Representation Learning Approach for\n  Predicting Postoperative Complications in Cardiac Surgery Patients",
  "authors": "Junbo Shen, Bing Xue, Thomas Kannampallil, Chenyang Lu, Joanna Abraham",
  "authorsParsed": [
    [
      "Shen",
      "Junbo",
      ""
    ],
    [
      "Xue",
      "Bing",
      ""
    ],
    [
      "Kannampallil",
      "Thomas",
      ""
    ],
    [
      "Lu",
      "Chenyang",
      ""
    ],
    [
      "Abraham",
      "Joanna",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 20:24:02 GMT"
    },
    {
      "version": "v2",
      "created": "Wed, 18 Dec 2024 17:40:15 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1733171042000,
  "abstract": "  Early detection of surgical complications allows for timely therapy and\nproactive risk mitigation. Machine learning (ML) can be leveraged to identify\nand predict patient risks for postoperative complications. We developed and\nvalidated the effectiveness of predicting postoperative complications using a\nnovel surgical Variational Autoencoder (surgVAE) that uncovers intrinsic\npatterns via cross-task and cross-cohort presentation learning. This\nretrospective cohort study used data from the electronic health records of\nadult surgical patients over four years (2018 - 2021). Six key postoperative\ncomplications for cardiac surgery were assessed: acute kidney injury, atrial\nfibrillation, cardiac arrest, deep vein thrombosis or pulmonary embolism, blood\ntransfusion, and other intraoperative cardiac events. We compared prediction\nperformances of surgVAE against widely-used ML models and advanced\nrepresentation learning and generative models under 5-fold cross-validation.\n89,246 surgeries (49% male, median (IQR) age: 57 (45-69)) were included, with\n6,502 in the targeted cardiac surgery cohort (61% male, median (IQR) age: 60\n(53-70)). surgVAE demonstrated superior performance over existing ML solutions\nacross all postoperative complications of cardiac surgery patients, achieving\nmacro-averaged AUPRC of 0.409 and macro-averaged AUROC of 0.831, which were\n3.4% and 3.7% higher, respectively, than the best alternative method (by AUPRC\nscores). Model interpretation using Integrated Gradients highlighted key risk\nfactors based on preoperative variable importance. surgVAE showed excellent\ndiscriminatory performance for predicting postoperative complications and\naddressing the challenges of data complexity, small cohort sizes, and\nlow-frequency positive events. surgVAE enables data-driven predictions of\npatient risks and prognosis while enhancing the interpretability of patient\nrisk profiles.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Electrical Engineering and Systems Science/Image and Video Processing"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "90g13JcESgh7W26ILlfbm28BKZMCRcGQP1D5sRvjofc",
  "pdfSize": "1996922"
}