{"id":"2412.01409","title":"An impact-free mechanism to deliver water to terrestrial planets and\n  exoplanets","authors":"Quentin Kral, Paul Huet, Camille Bergez-Casalou, Philippe Th\\'ebault,\n  S\\'ebastien Charnoz, Sonia Fornasier","authorsParsed":[["Kral","Quentin",""],["Huet","Paul",""],["Bergez-Casalou","Camille",""],["Thébault","Philippe",""],["Charnoz","Sébastien",""],["Fornasier","Sonia",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 11:54:30 GMT"}],"updateDate":"2024-12-03","timestamp":1733140470000,"abstract":"  To date, the most widespread scenario is that the Earth originated without\nwater and was brought to the planet mainly due to impacts by wet asteroids\ncoming from further out in space. However, many uncertainties remain regarding\nthe exact processes that supply water to inner terrestrial planets. This\narticle explores a new mechanism that would allow water to be efficiently\ntransported to planets without impacts. We propose that primordial asteroids\nwere icy and that when the ice sublimated, it formed a gaseous disk that could\nthen reach planets and deliver water. We have developed a new model that\nfollows the sublimation of asteroids and evolves the subsequent gas disk using\na viscous diffusion code. We can then quantify the amount of water that can be\naccreted onto each planet in a self-consistent manner. We find that this new\ndisk-delivery mechanism can explain the water content on Earth as well as on\nother planets. Our model shows most of the water being delivered between 20 and\n30 Myr after the birth of the Sun. Our scenario implies the presence of a\ngaseous water disk with substantial mass for 100s Myr, which could be one of\nthe key tracers of this mechanism. We show that such a watery disk could be\ndetected in young exo-asteroid belts with ALMA. We propose that viscous water\ntransport is inevitable and more generic than the impact scenario. We also\nsuggest it is a universal process that may also occur in extrasolar systems.\nThe conditions required for this scenario to unfold are indeed expected to be\npresent in most planetary systems: an opaque proto-planetary disk that is\ninitially cold enough for ice to form in the exo-asteroid belt region, followed\nby a natural outward-moving snow line that allows this initial ice to sublimate\nafter the dissipation of the primordial disk, creating a viscous secondary gas\ndisk and leading to the accretion of water onto the exoplanets.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"edGDwrXh5QrasethEWy7tmSkHSzhERBCsEq5pWVOh0I","pdfSize":"855026"}