{
  "id": "2412.18974",
  "title": "Modeling the effect of grain boundary diffusivity and trapping on\n  hydrogen transport using a phase-field compatible formulation",
  "authors": "Abdelrahman Hussein, Byungki Kim, Tom Depover, and Kim Verbeken",
  "authorsParsed": [
    [
      "Hussein",
      "Abdelrahman",
      ""
    ],
    [
      "Kim",
      "Byungki",
      ""
    ],
    [
      "Depover",
      "Tom",
      ""
    ],
    [
      "Verbeken",
      "Kim",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 25 Dec 2024 19:31:10 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735155070000,
  "abstract": "  Hydrogen grain boundary (GB) trapping is widely accepted as the main cause\nfor hydrogen induced intergranular failure. Several studies were conducted to\nunveil the role of GBs on hydrogen transport; however, a clear understanding is\nyet to be attained. This is due to the limitations of the state-of-the-art\nexperimental procedures for such highly kinetic processes. In this study, we\naim at providing a deeper understanding of hydrogen-GB interactions using\nfull-field representative volume element (RVE). The phase-field method is\nchosen for generating RVEs, since it is the an appropriate numerical tool to\nrepresent GBs. A novel fully-kinetic formulation for hydrogen diffusion and GB\ntrapping is presented, which is compatible with the phase-field based RVEs. GB\ndiffusivity ($D_\\mathrm{gb}$) and trap-binding energy ($E_\\mathrm{gb}$) were\nused as parameters to understand the interactions between diffusion and GB\ntrapping. Uptake and permeation simulations were performed with constant and\ngradient occupancy boundary conditions respectively. In both cases, increasing\n$E_\\mathrm{gb}$, increased the hydrogen GB occupancy. The permeation\nsimulations showed that the hydrogen flux along the GBs increased with\nincreasing both, $D_\\mathrm{gb}$ and, surprisingly, $E_\\mathrm{gb}$. Since\ntrapping increases the hydrogen occupancy along GBs, it also increases the\noccupancy gradients, resulting in a higher flux. This led to the conclusion\nthat, in the case of an external occupancy gradient, GB trapping and diffusion\ncooperate, rather than compete, to increase the hydrogen flux. On the other\nhand, the decisive factor for the retention of hydrogen at the GBs in\npermeation simulations was $D_\\mathrm{gb}$ rather than $E_\\mathrm{gb}$.\n",
  "subjects": [
    "Condensed Matter/Materials Science"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "fnSiAlvlItM4KXCosJrhpae5pXVB2cTP5M5R5mO7dcw",
  "pdfSize": "6463628"
}