{
  "id": "2412.00563",
  "title": "Designing Optimal Mechanisms to Locate Facilities with Insufficient\n  Capacity for Bayesian Agents",
  "authors": "Gennaro Auricchio and Jie Zhang",
  "authorsParsed": [
    [
      "Auricchio",
      "Gennaro",
      ""
    ],
    [
      "Zhang",
      "Jie",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 30 Nov 2024 19:34:42 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1732995282000,
  "abstract": "  In this paper, we study the Facility Location Problem with Scarce Resources\n(FLPSR) under the assumption that agents' type follow a probability\ndistribution. In the FLPSR, the objective is to identify the optimal locations\nfor one or more capacitated facilities to maximize Social Welfare (SW), defined\nas the sum of the utilities of all agents. The total capacity of the\nfacilities, however, is not enough to accommodate all the agents, who thus\ncompete in a First-Come-First-Served game to determine whether they get\naccommodated and what their utility is. The main contribution of this paper\nties Optimal Transport theory to the problem of determining the best truthful\nmechanism for the FLPSR tailored to the agents' type distributions. Owing to\nthis connection, we identify the mechanism that maximizes the expected SW as\nthe number of agents goes to infinity. For the case of a single facility, we\nshow that an optimal mechanism always exists. We examine three classes of\nprobability distributions and characterize the optimal mechanism either\nanalytically represent the optimal mechanism or provide a routine to\nnumerically compute it. We then extend our results to the case in which we have\ntwo capacitated facilities to place. While we initially assume that agents are\nindependent and identically distributed, we show that our techniques are\napplicable to scenarios where agents are not identically distributed. Finally,\nwe validate our findings through several numerical experiments, including: (i)\nderiving optimal mechanisms for the class of beta distributions, (ii) assessing\nthe Bayesian approximation ratio of these mechanisms for small numbers of\nagents, and (iii) assessing how quickly the expected SW attained by the\nmechanism converges to its limit.\n",
  "subjects": [
    "Computer Science/Computer Science and Game Theory"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "P-AmS3f5WQC1GxuArKBI9NVMbS3NWZEXUV5rk_TziyI",
  "pdfSize": "1912522"
}