{
  "id": "2412.03930",
  "title": "MIND: Effective Incorrect Assignment Detection through a Multi-Modal\n  Structure-Enhanced Language Model",
  "authors": "Yunhe Pang, Bo Chen, Fanjin Zhang, Yanghui Rao, and Jie Tang",
  "authorsParsed": [
    [
      "Pang",
      "Yunhe",
      ""
    ],
    [
      "Chen",
      "Bo",
      ""
    ],
    [
      "Zhang",
      "Fanjin",
      ""
    ],
    [
      "Rao",
      "Yanghui",
      ""
    ],
    [
      "Tang",
      "Jie",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 07:12:53 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733382773000,
  "abstract": "  The rapid growth of academic publications has exacerbated the issue of author\nname ambiguity in online digital libraries. Despite advances in name\ndisambiguation algorithms, cumulative errors continue to undermine the\nreliability of academic systems. It is estimated that over 10% paper-author\nassignments are rectified when constructing the million-scale WhoIsWho\nbenchmark. Existing endeavors to detect incorrect assignments are either\nsemantic-based or graph-based approaches, which fall short of making full use\nof the rich text attributes of papers and implicit structural features defined\nvia the co-occurrence of paper attributes. To this end, this paper introduces a\nstructure-enhanced language model that combines key structural features from\ngraph-based methods with fine-grained semantic features from rich paper\nattributes to detect incorrect assignments. The proposed model is trained with\na highly effective multi-modal multi-turn instruction tuning framework, which\nincorporates task-guided instruction tuning, text-attribute modality, and\nstructural modality. Experimental results demonstrate that our model\noutperforms previous approaches, achieving top performance on the leaderboard\nof KDD Cup 2024. Our code has been publicly available.\n",
  "subjects": [
    "Computer Science/Computation and Language",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "q7uMjt-LuVFhrnwoWINTx0oUlHDbVft2N8C7mCeX2sc",
  "pdfSize": "1343429"
}