{
  "id": "2412.02304",
  "title": "Data dependent Moving Least Squares",
  "authors": "David Levin, Jos\\'e M. Ram\\'on, Juan Ruiz-Alvarez, Dionisio F.\n  Y\\'a\\~nez",
  "authorsParsed": [
    [
      "Levin",
      "David",
      ""
    ],
    [
      "Ramón",
      "José M.",
      ""
    ],
    [
      "Ruiz-Alvarez",
      "Juan",
      ""
    ],
    [
      "Yáñez",
      "Dionisio F.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 09:16:47 GMT"
    }
  ],
  "updateDate": "2024-12-04",
  "timestamp": 1733217407000,
  "abstract": "  In this paper, we address a data dependent modification of the moving least\nsquares (MLS) problem. We propose a novel approach by replacing the traditional\nweight functions with new functions that assign smaller weights to nodes that\nare close to discontinuities, while still assigning smaller weights to nodes\nthat are far from the point of approximation. Through this adjustment, we are\nable to mitigate the undesirable Gibbs phenomenon that appears close to the\ndiscontinuities in the classical MLS approach, and reduce the smearing of\ndiscontinuities in the final approximation of the original data. The core of\nour method involves accurately identifying those nodes affected by the presence\nof discontinuities using smoothness indicators, a concept derived from the\ndata-dependent WENO method. Our formulation results in a data-dependent\nweighted least squares problem where the weights depend on two factors: the\ndistances between nodes and the point of approximation, and the smoothness of\nthe data in a region of predetermined radius around the nodes. We explore the\ndesign of the new data-dependent approximant, analyze its properties including\npolynomial reproduction, accuracy, and smoothness, and study its impact on\ndiffusion and the Gibbs phenomenon. Numerical experiments are conducted to\nvalidate the theoretical findings, and we conclude with some insights and\npotential directions for future research.\n",
  "subjects": [
    "Mathematics/Numerical Analysis",
    "Computer Science/Numerical Analysis"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "grcp3zsZ47EamSHSEGfV-t1BlfHvROE7ke1S1tym034",
  "pdfSize": "13263226"
}