{"id":"2412.08377","title":"Boosting weather forecast via generative superensemble","authors":"Congyi Nai, Xi Chen, Shangshang Yang, Yuan Liang, Ziniu Xiao, Baoxiang\n  Pan","authorsParsed":[["Nai","Congyi",""],["Chen","Xi",""],["Yang","Shangshang",""],["Liang","Yuan",""],["Xiao","Ziniu",""],["Pan","Baoxiang",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 13:40:47 GMT"}],"updateDate":"2024-12-12","timestamp":1733924447000,"abstract":"  Accurate weather forecasting is essential for socioeconomic activities. While\ndata-driven forecasting demonstrates superior predictive capabilities over\ntraditional Numerical Weather Prediction (NWP) with reduced computational\ndemands, its deterministic nature and limited advantages over physics-based\nensemble predictions restrict operational applications. We introduce the\ngenerative ensemble prediction system (GenEPS) framework to address these\nlimitations by randomizing and mitigating both random errors and systematic\nbiases. GenEPS provides a plug-and-play ensemble forecasting capability for\ndeterministic models to eliminate random errors, while incorporating\ncross-model integration for cross-model ensembles to address systematic biases.\nThe framework culminates in a super-ensemble approach utilizing all available\ndata-driven models to further minimize systematic biases. GenEPS achieves an\nAnomaly Correlation Coefficient (ACC) of 0.679 for 500hPa geopotential (Z500),\nexceeding the ECMWF Ensemble Prediction System's (ENS) ACC of 0.646.\nIntegration of the ECMWF ensemble mean further improves the ACC to 0.683. The\nframework also enhances extreme event representation and produces energy\nspectra more consistent with ERA5 reanalysis. GenEPS establishes a new paradigm\nin ensemble forecasting by enabling the integration of multiple data-driven\nmodels into a high-performing super-ensemble system.\n","subjects":["Physics/Atmospheric and Oceanic Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"TbvOugFvNn_EPfdjqXNlobeg__AswYRqnxOLwuliJ2s","pdfSize":"15513074"}