{
  "id": "2412.18425",
  "title": "Computing the k-binomial complexity of generalized Thue--Morse words",
  "authors": "M. Golafshan, M. Rigo, M. Whiteland",
  "authorsParsed": [
    [
      "Golafshan",
      "M.",
      ""
    ],
    [
      "Rigo",
      "M.",
      ""
    ],
    [
      "Whiteland",
      "M.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 24 Dec 2024 13:39:58 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1735047598000,
  "abstract": "  Two finite words are k-binomially equivalent if each subword (i.e.,\nsubsequence) of length at most k occurs the same number of times in both words.\nThe k-binomial complexity of an infinite word is a function that maps the\ninteger $n\\geq 0$ to the number of k-binomial equivalence classes represented\nby its factors of length n. The Thue--Morse (TM) word and its generalization to\nlarger alphabets are ubiquitous in mathematics due to their rich combinatorial\nproperties. This work addresses the k-binomial complexities of generalized TM\nwords. Prior research by Lejeune, Leroy, and Rigo determined the k-binomial\ncomplexities of the 2-letter TM word. For larger alphabets, work by L\\\"u, Chen,\nWen, and Wu determined the 2-binomial complexity for m-letter TM words, for\narbitrary m, but the exact behavior for $k\\geq 3$ remained unresolved. They\nconjectured that the k-binomial complexity function of the m-letter TM word is\neventually periodic with period $m^k$. We resolve the conjecture positively by\nderiving explicit formulae for the k-binomial complexity functions for any\ngeneralized TM word. We do this by characterizing k-binomial equivalence among\nfactors of generalized TM words. This comprehensive analysis not only solves\nthe open conjecture, but also develops tools such as abelian Rauzy graphs.\n",
  "subjects": [
    "Mathematics/Combinatorics",
    "Computer Science/Formal Languages and Automata Theory"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "WuBSGMcrEfmBUk5U3JftOOQ_x61rikaBuMXiFyxQzRs",
  "pdfSize": "702330"
}