{"id":"2412.06210","title":"H-FedSN: Personalized Sparse Networks for Efficient and Accurate\n  Hierarchical Federated Learning for IoT Applications","authors":"Jiechao Gao, Yuangang Li, Yue Zhao, Brad Campbell","authorsParsed":[["Gao","Jiechao",""],["Li","Yuangang",""],["Zhao","Yue",""],["Campbell","Brad",""]],"versions":[{"version":"v1","created":"Mon, 9 Dec 2024 05:05:47 GMT"},{"version":"v2","created":"Wed, 25 Dec 2024 12:21:07 GMT"}],"updateDate":"2024-12-30","timestamp":1733720747000,"abstract":"  The proliferation of Internet of Things (IoT) has increased interest in\nfederated learning (FL) for privacy-preserving distributed data utilization.\nHowever, traditional two-tier FL architectures inadequately adapt to multi-tier\nIoT environments. While Hierarchical Federated Learning (HFL) improves\npracticality in multi-tier IoT environments by multi-layer aggregation, it\nstill faces challenges in communication efficiency and accuracy due to high\ndata transfer volumes, data heterogeneity, and imbalanced device distribution,\nstruggling to meet the low-latency and high-accuracy model training\nrequirements of practical IoT scenarios. To overcome these limitations, we\npropose H-FedSN, an innovative approach for practical IoT environments. H-FedSN\nintroduces a binary mask mechanism with shared and personalized layers to\nreduce communication overhead by creating a sparse network while keeping\noriginal weights frozen. To address data heterogeneity and imbalanced device\ndistribution, we integrate personalized layers for local data adaptation and\napply Bayesian aggregation with cumulative Beta distribution updates at edge\nand cloud levels, effectively balancing contributions from diverse client\ngroups. Evaluations on three real-world IoT datasets and MNIST under non-IID\nsettings demonstrate that H-FedSN significantly reduces communication costs by\n58 to 238 times compared to HierFAVG while achieving high accuracy, making it\nhighly effective for practical IoT applications in hierarchical federated\nlearning scenarios.\n","subjects":["Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"yiA8iGRTp81j40Ehruew-m_fT7ZoyK6-q-7QNawHTUM","pdfSize":"9315048"}