{
  "id": "2412.11624",
  "title": "NMR study of the local magnetic order in the kagome Weyl semimetal\n  Co$_3$Sn$_2$S$_2$",
  "authors": "Irek Mukhamedshin, Pawel Wzietek, Fabrice Bert, Philippe Mendels, Anne\n  Forget, Doroth\\'ee Colson, V\\'eronique Brouet",
  "authorsParsed": [
    [
      "Mukhamedshin",
      "Irek",
      ""
    ],
    [
      "Wzietek",
      "Pawel",
      ""
    ],
    [
      "Bert",
      "Fabrice",
      ""
    ],
    [
      "Mendels",
      "Philippe",
      ""
    ],
    [
      "Forget",
      "Anne",
      ""
    ],
    [
      "Colson",
      "Dorothée",
      ""
    ],
    [
      "Brouet",
      "Véronique",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 10:10:14 GMT"
    }
  ],
  "updateDate": "2025-01-10",
  "timestamp": 1734343814000,
  "abstract": "  A magnetic Weyl semimetal presents the intriguing possibility of controlling\ntopological properties through magnetic order. The kagome compound \\CoSnS~has\nemerged as one of the most thoroughly characterized magnetic Weyl semimetals,\nyet the potential coexistence of a ferromagnetic state below $T_c$ = 172~K with\na non-collinear antiferromagnetic phase or a glassy state remains unresolved.\nWe employ $^{59}$Co NMR to gain a local perspective on the magnetic order. The\nmagnetic and electric field gradient tensors at room temperature are determined\nby fitting the NMR spectra using evolutionary algorithms. Zero-field NMR\nmeasurements reveal that all Co sites are equivalent in the magnetic phase at\nlow temperatures and up to 90~K. The local magnetic field follows in intensity\nthe macroscopic magnetization as a function of temperature and is tilted from\nthe c-axis by a few degrees toward the nearest triangle center. Above 90~K, a\nshoulder appears on the low-field side, which we attribute to a preferential\ntilting of the local field in one direction, breaking the equivalence between\nthe three Co sites of the kagome structure. We rule out any coexistence with an\nin-plane antiferromagnetic phase and suggest instead that in-plane\nferromagnetic-like moments appear above 90~K and play an increasing role in the\nmagnetic order up to the magnetic transition.\n",
  "subjects": [
    "Condensed Matter/Strongly Correlated Electrons"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "FtDaR8PC-ofwqwbuz9ZMzWIrsIooMH5RkE96uKV9Hko",
  "pdfSize": "1637152"
}