{
  "id": "2412.12241",
  "title": "Simultaneous observation of bright and dark polariton states in\n  subwavelength gratings made from quasi-bulk WS$_2$",
  "authors": "Paul Bouteyre (1), Xuerong Hu (1), Sam A. Randerson (1), Panaiot G.\n  Zotev (1), Yue Wang (2), Alexander I. Tartakovskii (1) ((1) Department of\n  Physics and Astronomy, University of Sheffield, Sheffield, U.K, (2) School of\n  Physics, Engineering and Technology, University of York, York, UK)",
  "authorsParsed": [
    [
      "Bouteyre",
      "Paul",
      ""
    ],
    [
      "Hu",
      "Xuerong",
      ""
    ],
    [
      "Randerson",
      "Sam A.",
      ""
    ],
    [
      "Zotev",
      "Panaiot G.",
      ""
    ],
    [
      "Wang",
      "Yue",
      ""
    ],
    [
      "Tartakovskii",
      "Alexander I.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 18:49:00 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734374940000,
  "abstract": "  Over the last decade, layered crystals, dubbed van der Waals (vdW) materials,\nhave attracted tremendous interest due to their unique properties in their\nsingle and few layer regimes. Their bulk counterparts, however, have only been\nrecently explored as building blocks for nanophotonics as they offer promising\nproperties such as high refractive indices and adherence to any type of\nsubstrates. We present here a variety of 1D grating structures composed of bulk\ntransition metal dichalcogenide (TMD) WS$_2$ as a highly tunable and versatile\nplatform for observation of multi-level polaritonic system. The WS$_2$ excitons\nare simultaneously strongly coupled with the two grating photonic modes\nincluding the Bound State in the Continuum (BIC) of the lower energetic mode\ngiving rise to polariton-BICs (pol-BICs). The polaritonic dispersion shapes can\nbe varied in a straightforward fashion by choosing WS$_2$ films of different\nthicknesses and by changing the period of the grating.\n",
  "subjects": [
    "Physics/Optics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "uL6KqadTaVZu4DEFBroeVYIfpEhcAPqaQh0BExDZ7rk",
  "pdfSize": "9734652"
}