{
  "id": "2412.09888",
  "title": "gwsnr: A python package for efficient signal-to-noise calculation of\n  gravitational-waves",
  "authors": "Hemantakumar Phurailatpam, Otto Akseli Hannuksela",
  "authorsParsed": [
    [
      "Phurailatpam",
      "Hemantakumar",
      ""
    ],
    [
      "Hannuksela",
      "Otto Akseli",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 06:06:33 GMT"
    },
    {
      "version": "v2",
      "created": "Mon, 13 Jan 2025 11:45:31 GMT"
    }
  ],
  "updateDate": "2025-01-14",
  "timestamp": 1734069993000,
  "abstract": "  Gravitational wave (GW) detection and analysis rely heavily on efficient\nSignal to Noise Ratio (SNR) computation, a critical parameter for identifying\nand characterizing astrophysical signals from detectors like LIGO, Virgo, and\nKAGRA. The gwsnr Python package addresses the computational challenges in GW\nresearch by providing a flexible, user-friendly framework for SNR calculations.\nIt supports diverse detector noise models, waveform approximants, detector\nconfigurations, and signal parameters, making it highly adaptable to various\nresearch needs. The package introduces innovative methods, including a\npartial-scaling interpolation technique for spin-less binary systems, a\nnoise-weighted inner product approach with multiprocessing capabilities, and an\nArtificial Neural Network (ANN) model for rapid detection probability\nestimation of precessing binary black hole systems. Performance is further\noptimized using numba's Just-In-Time (JIT) compiler, enabling significant\nreductions in execution time. Seamlessly integrating with other tools, such as\nthe ler package, gwsnr is instrumental in simulating detectable compact binary\nmergers, estimating GW event rates, and analyzing selection effects in\nhierarchical Bayesian frameworks. This comprehensive toolkit empowers\nresearchers to conduct efficient, precise, and scalable analyses of GW signals.\n",
  "subjects": [
    "Astrophysics/Instrumentation and Methods for Astrophysics",
    "Astrophysics/High Energy Astrophysical Phenomena"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "twC2USkDTvs2_RkrubZ8DO275FK7XBqM7LJ6NSNjZYU",
  "pdfSize": "495078"
}