{"id":"2412.03321","title":"Scalable Bayesian Tensor Ring Factorization for Multiway Data Analysis","authors":"Zerui Tao, Toshihisa Tanaka, Qibin Zhao","authorsParsed":[["Tao","Zerui",""],["Tanaka","Toshihisa",""],["Zhao","Qibin",""]],"versions":[{"version":"v1","created":"Wed, 4 Dec 2024 13:55:14 GMT"}],"updateDate":"2024-12-05","timestamp":1733320514000,"abstract":"  Tensor decompositions play a crucial role in numerous applications related to\nmulti-way data analysis. By employing a Bayesian framework with\nsparsity-inducing priors, Bayesian Tensor Ring (BTR) factorization offers\nprobabilistic estimates and an effective approach for automatically adapting\nthe tensor ring rank during the learning process. However, previous BTR method\nemploys an Automatic Relevance Determination (ARD) prior, which can lead to\nsub-optimal solutions. Besides, it solely focuses on continuous data, whereas\nmany applications involve discrete data. More importantly, it relies on the\nCoordinate-Ascent Variational Inference (CAVI) algorithm, which is inadequate\nfor handling large tensors with extensive observations. These limitations\ngreatly limit its application scales and scopes, making it suitable only for\nsmall-scale problems, such as image/video completion. To address these issues,\nwe propose a novel BTR model that incorporates a nonparametric Multiplicative\nGamma Process (MGP) prior, known for its superior accuracy in identifying\nlatent structures. To handle discrete data, we introduce the P\\'olya-Gamma\naugmentation for closed-form updates. Furthermore, we develop an efficient\nGibbs sampler for consistent posterior simulation, which reduces the\ncomputational complexity of previous VI algorithm by two orders, and an online\nEM algorithm that is scalable to extremely large tensors. To showcase the\nadvantages of our model, we conduct extensive experiments on both simulation\ndata and real-world applications.\n","subjects":["Computer Science/Machine Learning","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"BmeKhPSayj_A2pGIwUidy2AZ8zaO5g0DyMtYQ_HNKzY","pdfSize":"681158"}