{
  "id": "2412.02860",
  "title": "Prospects for gamma-ray emission from magnetar regions in CTAO\n  observations",
  "authors": "M. F. Sousa, R. Jr. Costa, Jaziel G. Coelho, R. C. Dos Anjos",
  "authorsParsed": [
    [
      "Sousa",
      "M. F.",
      ""
    ],
    [
      "Costa",
      "R. Jr.",
      ""
    ],
    [
      "Coelho",
      "Jaziel G.",
      ""
    ],
    [
      "Anjos",
      "R. C. Dos",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 21:53:17 GMT"
    }
  ],
  "updateDate": "2025-01-16",
  "timestamp": 1733262797000,
  "abstract": "  Recent multi-wavelength observations have highlighted magnetars as\nsignificant sources of cosmic rays, particularly through their gamma-ray\nemissions. This study examines three magnetar regions - CXOU J171405.7-31031,\nSwift J1834-0846, and SGR 1806-20 - known for emitting detectable\nelectromagnetic signals. We assess the detectability of these regions using the\nupcoming Cherenkov Telescope Array Observatory (CTAO) by conducting an ON/OFF\nspectral analysis and compare the expected results with existing observations.\nOur findings indicate that CTAO will detect gamma-ray emissions from these\nthree magnetar regions with significantly reduced emission flux errors compared\nto current instruments. In special, the study shows that the CXOUJ1714-3810 and\nSwiftJ1834-0846 magnetar regions can be observed by the full southern and\nnorthern CTAO arrays in just five hours of observation, with mean significances\nabove $10 \\,\\sigma$ and $30 \\,\\sigma$, respectively. This paper discusses the\nregions analyzed, presents key results, and concludes with insights drawn from\nthe study.\n",
  "subjects": [
    "Astrophysics/High Energy Astrophysical Phenomena",
    "Astrophysics/Solar and Stellar Astrophysics",
    "Physics/High Energy Physics - Phenomenology"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Asq_Qsduw-VopNz6-ZXErtcBlY3Gh9zPN_fq2CeKN4A",
  "pdfSize": "5424120"
}