{"id":"2412.10083","title":"Heterogeneous Multi-Robot Graph Coverage with Proximity and Movement\n  Constraints","authors":"Dolev Mutzari, Yonatan Aumann and Sarit Kraus","authorsParsed":[["Mutzari","Dolev",""],["Aumann","Yonatan",""],["Kraus","Sarit",""]],"versions":[{"version":"v1","created":"Fri, 13 Dec 2024 12:17:30 GMT"},{"version":"v2","created":"Tue, 17 Dec 2024 12:39:09 GMT"}],"updateDate":"2024-12-18","timestamp":1734092250000,"abstract":"  Multi-Robot Coverage problems have been extensively studied in robotics,\nplanning and multi-agent systems. In this work, we consider the coverage\nproblem when there are constraints on the proximity (e.g., maximum distance\nbetween the agents, or a blue agent must be adjacent to a red agent) and the\nmovement (e.g., terrain traversability and material load capacity) of the\nrobots. Such constraints naturally arise in many real-world applications, e.g.\nin search-and-rescue and maintenance operations. Given such a setting, the goal\nis to compute a covering tour of the graph with a minimum number of steps, and\nthat adheres to the proximity and movement constraints. For this problem, our\ncontributions are four: (i) a formal formulation of the problem, (ii) an exact\nalgorithm that is FPT in F, d and tw, the set of robot formations that encode\nthe proximity constraints, the maximum nodes degree, and the tree-width of the\ngraph, respectively, (iii) for the case that the graph is a tree: a PTAS\napproximation scheme, that given an approximation parameter epsilon, produces a\ntour that is within a epsilon times error(||F||, d) of the optimal one, and the\ncomputation runs in time poly(n) times h(1/epsilon,||F||). (iv) for the case\nthat the graph is a tree, with $k=3$ robots, and the constraint is that all\nagents are connected: a PTAS scheme with multiplicative approximation error of\n1+O(epsilon), independent of the maximal degree d.\n","subjects":["Computer Science/Multiagent Systems","Computer Science/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"NykoOq2LpKYJDB29m3y36RUgVUMJiedVCbdWBvfjGMM","pdfSize":"2908943"}