{
  "id": "2412.12061",
  "title": "Virtual Agent-Based Communication Skills Training to Facilitate Health\n  Persuasion Among Peers",
  "authors": "Farnaz Nouraei, Keith Rebello, Mina Fallah, Prasanth Murali, Haley\n  Matuszak, Valerie Jap, Andrea Parker, Michael Paasche-Orlow, Timothy Bickmore",
  "authorsParsed": [
    [
      "Nouraei",
      "Farnaz",
      ""
    ],
    [
      "Rebello",
      "Keith",
      ""
    ],
    [
      "Fallah",
      "Mina",
      ""
    ],
    [
      "Murali",
      "Prasanth",
      ""
    ],
    [
      "Matuszak",
      "Haley",
      ""
    ],
    [
      "Jap",
      "Valerie",
      ""
    ],
    [
      "Parker",
      "Andrea",
      ""
    ],
    [
      "Paasche-Orlow",
      "Michael",
      ""
    ],
    [
      "Bickmore",
      "Timothy",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 18:34:32 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734374072000,
  "abstract": "  Many laypeople are motivated to improve the health behavior of their family\nor friends but do not know where to start, especially if the health behavior is\npotentially stigmatizing or controversial. We present an approach that uses\nvirtual agents to coach community-based volunteers in health counseling\ntechniques, such as motivational interviewing, and allows them to practice\nthese skills in role-playing scenarios. We use this approach in a virtual\nagent-based system to increase COVID-19 vaccination by empowering users to\ninfluence their social network. In a between-subjects comparative design study,\nwe test the effects of agent system interactivity and role-playing\nfunctionality on counseling outcomes, with participants evaluated by\nstandardized patients and objective judges. We find that all versions are\neffective at producing peer counselors who score adequately on a standardized\nmeasure of counseling competence, and that participants were significantly more\nsatisfied with interactive virtual agents compared to passive viewing of the\ntraining material. We discuss design implications for interpersonal skills\ntraining systems based on our findings.\n",
  "subjects": [
    "Computer Science/Human-Computer Interaction",
    "Computer Science/Computation and Language",
    "Computer Science/Computers and Society"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "JwIsVS_tacAvRvEjTzZMXex30WSi3KfCjXX-2sqvMPg",
  "pdfSize": "2169886"
}