{
  "id": "2412.13680",
  "title": "Spin correlations in the parent phase of Li$_{1-x}$Fe$_x$ODFeSe",
  "authors": "Hongliang Wo, Bingying Pan, Die Hu, Yu Feng, A. D. Christianson, Jun\n  Zhao",
  "authorsParsed": [
    [
      "Wo",
      "Hongliang",
      ""
    ],
    [
      "Pan",
      "Bingying",
      ""
    ],
    [
      "Hu",
      "Die",
      ""
    ],
    [
      "Feng",
      "Yu",
      ""
    ],
    [
      "Christianson",
      "A. D.",
      ""
    ],
    [
      "Zhao",
      "Jun",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 10:08:17 GMT"
    }
  ],
  "updateDate": "2025-01-06",
  "timestamp": 1734516497000,
  "abstract": "  Elucidating spin correlations in the parent compounds of high-temperature\nsuperconductors is crucial for understanding superconductivity. We used neutron\nscattering to study spin correlations in Li$_{1-x}$Fe$_x$ODFeSe, an insulating\nmaterial with reduced electron carriers compared to its superconducting\ncounterpart ($T_c$ = 41 K), serving as the undoped parent compound. Our\nfindings show a reduced total fluctuating moment in this insulator relative to\nFeSe and 122 iron pnictides, likely due to increased interlayer distances from\nintercalation, which enhance fluctuations and reduce the intensity of spin\nexcitations. Moreover, we observed a V-shaped spin wave-like excitation\ndispersion, contrasting with the twisted hourglass pattern in the\nsuperconducting counterpart. Electron doping shifts spin excitation from\n($\\pi$, 0) point to an incommensurate position towards ($\\pi$, $\\pi$) direction\nbelow 65 meV. This transition from V-shaped to hourglass-like dispersion, akin\nto behaviors in hole-doped cuprates, suggests a potential shared mechanism in\nmagnetism and superconductivity across these diverse systems.\n",
  "subjects": [
    "Condensed Matter/Superconductivity",
    "Condensed Matter/Materials Science",
    "Condensed Matter/Strongly Correlated Electrons"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "4RH5aiJOZNyl5dMJXG0JTKICbSBHvfukg4jTDfrvuc4",
  "pdfSize": "1596073"
}