{
  "id": "2412.04874",
  "title": "Self-Organizing Complex Networks with AI-Driven Adaptive Nodes for\n  Optimized Connectivity and Energy Efficiency",
  "authors": "Azra Seyyedi, Mahdi Bohlouli, SeyedEhsan Nedaaee Oskoee",
  "authorsParsed": [
    [
      "Seyyedi",
      "Azra",
      ""
    ],
    [
      "Bohlouli",
      "Mahdi",
      ""
    ],
    [
      "Oskoee",
      "SeyedEhsan Nedaaee",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 09:13:13 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733476393000,
  "abstract": "  High connectivity and robustness are critical requirements in distributed\nnetworks, as they ensure resilience, efficient communication, and adaptability\nin dynamic environments. Additionally, optimizing energy consumption is also\nparamount for ensuring sustainability of networks composed of\nenergy-constrained devices and prolonging their operational lifespan. In this\nstudy, we introduce an Artificial Intelligence (AI)-enhanced self-organizing\nnetwork model, where each adaptive node autonomously adjusts its transmission\npower to optimize network connectivity and redundancy while lowering energy\nconsumption. Building on our previous Hamiltonian-based methodology, which is\ndesigned to lead networks toward globally optimized states of complete\nconnectivity and minimal energy usage, this research integrates a Multi-Layer\nPerceptron (MLP)-based decision-making model at each node. By leveraging a\ndataset from the Hamiltonian approach, each node independently learns and\nadapts its transmission power in response to local conditions, resulting in\nemergent global behaviors marked by high connectivity and resilience against\nstructural disruptions. This distributed, MLP-driven adaptability allows nodes\nto make context-aware power adjustments autonomously, enabling the network to\nmaintain its optimized state over time. Simulation results show that the\nproposed AI-driven adaptive nodes collectively achieve stable complete\nconnectivity, significant robustness, and optimized energy usage under various\nconditions, including static and mobile network scenarios. This work\ncontributes to the growing field of self-organizing networks by illustrating\nthe potential of AI to enhance complex network design, supporting the\ndevelopment of scalable, resilient, and energy-efficient distributed systems\nacross diverse applications.\n",
  "subjects": [
    "Physics/Computational Physics",
    "Computer Science/Networking and Internet Architecture"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "DT-_rQjPdgXG6xLP18--Jb3UjaWQDVehNlROJbDBWqQ",
  "pdfSize": "3067802"
}