{
  "id": "2412.10154",
  "title": "A Clinical Tuning Framework for Continuous Kinematic and Impedance\n  Control of a Powered Knee-Ankle Prosthesis",
  "authors": "Emma Reznick, T. Kevin Best, Robert Gregg",
  "authorsParsed": [
    [
      "Reznick",
      "Emma",
      ""
    ],
    [
      "Best",
      "T. Kevin",
      ""
    ],
    [
      "Gregg",
      "Robert",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 14:11:49 GMT"
    }
  ],
  "updateDate": "2024-12-16",
  "timestamp": 1734099109000,
  "abstract": "  Objective: Configuring a prosthetic leg is an integral part of the fitting\nprocess, but the personalization of a multi-modal powered knee-ankle prosthesis\nis often too complex to realize in a clinical environment. This paper develops\nboth the technical means to individualize a hybrid kinematic-impedance\ncontroller for variable-incline walking and sit-stand transitions, and an\nintuitive Clinical Tuning Interface (CTI) that allows prosthetists to directly\nmodify the controller behavior.\n  Methods: Utilizing an established method for predicting kinematic gait\nindividuality alongside a new parallel approach for kinetic individuality, we\napplied tuned characteristics exclusively from level-ground walking to\npersonalize continuous-phase/task models of joint kinematics and impedance. To\ntake advantage of this method, we developed a CTI that translates common\nclinical tuning parameters into model adjustments. We then conducted a case\nstudy involving an above-knee amputee participant where a prosthetist\niteratively tuned the prosthesis in a simulated clinical session involving\nwalking and sit-stand transitions.\n  Results: The prosthetist fully tuned the multi-activity prosthesis controller\nin under 20 min. Each iteration of tuning (i.e., observation, parameter\nadjustment, and model reprocessing) took 2 min on average for walking and 1 min\non average for sit-stand. The tuned behavior changes were appropriately\nmanifested in the commanded prosthesis torques, both at the tuned tasks and\nacross untuned tasks (inclines).\n  Conclusion: The CTI leveraged able-bodied trends to efficiently personalize a\nwide array of walking tasks and sit-stand transitions. A case-study validated\nthe CTI tuning method and demonstrated the efficiency necessary for powered\nknee-ankle prostheses to become clinically viable.\n",
  "subjects": [
    "Computer Science/Robotics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "wenNgsMaFmJApUsdbKlDd0K8Wbp26fYp5TyOMoQ3KYQ",
  "pdfSize": "2124270"
}