{
  "id": "2412.19963",
  "title": "Linear Shrinkage Convexification of Penalized Linear Regression With\n  Missing Data",
  "authors": "Seongoh Park, Seongjin Lee, Nguyen Thi Hai Yen, Nguyen Phuoc Long, and\n  Johan Lim",
  "authorsParsed": [
    [
      "Park",
      "Seongoh",
      ""
    ],
    [
      "Lee",
      "Seongjin",
      ""
    ],
    [
      "Yen",
      "Nguyen Thi Hai",
      ""
    ],
    [
      "Long",
      "Nguyen Phuoc",
      ""
    ],
    [
      "Lim",
      "Johan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 28 Dec 2024 01:09:54 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735348194000,
  "abstract": "  One of the common challenges faced by researchers in recent data analysis is\nmissing values. In the context of penalized linear regression, which has been\nextensively explored over several decades, missing values introduce bias and\nyield a non-positive definite covariance matrix of the covariates, rendering\nthe least square loss function non-convex. In this paper, we propose a novel\nprocedure called the linear shrinkage positive definite (LPD) modification to\naddress this issue. The LPD modification aims to modify the covariance matrix\nof the covariates in order to ensure consistency and positive definiteness.\nEmploying the new covariance estimator, we are able to transform the penalized\nregression problem into a convex one, thereby facilitating the identification\nof sparse solutions. Notably, the LPD modification is computationally efficient\nand can be expressed analytically. In the presence of missing values, we\nestablish the selection consistency and prove the convergence rate of the\n$\\ell_1$-penalized regression estimator with LPD, showing an $\\ell_2$-error\nconvergence rate of square-root of $\\log p$ over $n$ by a factor of\n$(s_0)^{3/2}$ ($s_0$: the number of non-zero coefficients). To further evaluate\nthe effectiveness of our approach, we analyze real data from the Genomics of\nDrug Sensitivity in Cancer (GDSC) dataset. This dataset provides incomplete\nmeasurements of drug sensitivities of cell lines and their protein expressions.\nWe conduct a series of penalized linear regression models with each sensitivity\nvalue serving as a response variable and protein expressions as explanatory\nvariables.\n",
  "subjects": [
    "Statistics/Methodology"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "MVJFkEV2eeNicD3hXWmten5zxtwGGvMv4ymOTgRJTbY",
  "pdfSize": "1114934"
}