{
  "id": "2412.05374",
  "title": "Strong Coupling Theory of Superconductivity and Ferroelectric Quantum\n  Criticality in metallic SrTiO$_3$",
  "authors": "Sudip Kumar Saha, Maria N. Gastiasoro, Jonathan Ruhman, Avraham Klein",
  "authorsParsed": [
    [
      "Saha",
      "Sudip Kumar",
      ""
    ],
    [
      "Gastiasoro",
      "Maria N.",
      ""
    ],
    [
      "Ruhman",
      "Jonathan",
      ""
    ],
    [
      "Klein",
      "Avraham",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 19:02:22 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733511742000,
  "abstract": "  Superconductivity in doped SrTiO$_3$ has remained an enduring mystery for\nover 50 years. The material's status as a ``quantum\" ferroelectric metal,\ncharacterized by a soft polar mode, suggests that quantum criticality could\nplay a pivotal role in the emergence of its superconducting state. We show that\nthe system is amenable to a strong coupling (Eliashberg) pairing analysis, with\nthe dominant coupling to the soft mode being a ``dynamical'' Rashba coupling.\nWe compute the expected $T_c$ for the entire phase diagram, all the way to the\nquantum critical point and beyond. We demonstrate that the linear coupling is\nsufficient to obtain a rough approximation of the experimentally measured phase\ndiagram, but that nonlinear coupling terms are crucial in reproducing the finer\nfeatures in the ordered phase. The primary role of nonlinear terms at the peak\nof the superconducting dome is to enhance the effective linear coupling induced\nby the broken order, shifting the dome's maximum into the ordered phase. Our\ntheory quantitatively reproduces the three-dimensional experimental phase\ndiagram in the space of carrier density, distance from the quantum critical\npoint and temperature, and allows us to estimate microscopic parameters from\nthe experimental data.\n",
  "subjects": [
    "Condensed Matter/Strongly Correlated Electrons",
    "Condensed Matter/Superconductivity"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "FhtWmB51SQvSQlp7NDWg1PYgfUH0upbZgAYJrp9_lUo",
  "pdfSize": "11683114"
}