{"id":"2412.14990","title":"Determining the Role of Electrostatics in the Making and Breaking of the\n  Caprin1-ATP Nanocondensate","authors":"Maria Tsanai, Teresa Head-Gordon","authorsParsed":[["Tsanai","Maria",""],["Head-Gordon","Teresa",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 16:01:57 GMT"}],"updateDate":"2024-12-20","timestamp":1734624117000,"abstract":"  We employ a multiscale computational approach to investigate the condensation\nprocess of the C-terminal low-complexity region of the Caprin1 protein as a\nfunction of increasing ATP concentration for three states: the initial mixed\nstate, nanocondensate formation, and the dissolution of the droplet as it\nreenters the mixed state. We show that upon condensation ATP assembles via\npi-pi interactions, resulting in the formation of a large cluster of stacked\nATP molecules stabilized by sodium counterions. The surface of the ATP assembly\ninteracts with the arginine-rich regions of the Caprin1 protein, particularly\nwith its N-terminus, to promote the complete phase-separated droplet on a\nlengthscale of tens of nanometers. In order to understand droplet stability, we\nanalyze the near-surface electrostatic potential (NS-ESP) of Caprin1 and\nestimate the zeta potential of the Caprin1-ATP assemblies. We predict a\npositive NS-ESP at the Caprin1 surface for low ATP concentrations that defines\nthe early mixed state, in excellent agreement with the NS-ESP obtained from NMR\nexperiments using paramagnetic resonance enhancement. By contrast, the NS-ESP\nof Caprin1 at the surface of the nanocondensate at moderate levels of ATP is\nhighly negative compared to the mixed state, and estimates of a large zeta\npotential outside the highly dense region of charge further explains the\nremarkable stability of this phase separated droplet assembly. As ATP\nconcentrations rise further, the strong electrostatic forces needed for\nnanocondensate stability are replaced by weaker Caprin1-ATP interactions that\ndrive the reentry into the mixed state that exhibits a much lower zeta\npotential.\n","subjects":["Physics/Biological Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Jqs9Nvi0KsYZ64ekrXGKvJ4Eh3Nh4_6EsNO1_kOwwyk","pdfSize":"11007881"}