{"id":"2412.19483","title":"Learning Radiance Fields from a Single Snapshot Compressive Image","authors":"Yunhao Li, Xiang Liu, Xiaodong Wang, Xin Yuan and Peidong Liu","authorsParsed":[["Li","Yunhao",""],["Liu","Xiang",""],["Wang","Xiaodong",""],["Yuan","Xin",""],["Liu","Peidong",""]],"versions":[{"version":"v1","created":"Fri, 27 Dec 2024 06:40:44 GMT"}],"updateDate":"2024-12-30","timestamp":1735281644000,"abstract":"  In this paper, we explore the potential of Snapshot Compressive Imaging (SCI)\ntechnique for recovering the underlying 3D scene structure from a single\ntemporal compressed image. SCI is a cost-effective method that enables the\nrecording of high-dimensional data, such as hyperspectral or temporal\ninformation, into a single image using low-cost 2D imaging sensors. To achieve\nthis, a series of specially designed 2D masks are usually employed, reducing\nstorage and transmission requirements and offering potential privacy\nprotection. Inspired by this, we take one step further to recover the encoded\n3D scene information leveraging powerful 3D scene representation capabilities\nof neural radiance fields (NeRF). Specifically, we propose SCINeRF, in which we\nformulate the physical imaging process of SCI as part of the training of NeRF,\nallowing us to exploit its impressive performance in capturing complex scene\nstructures. In addition, we further integrate the popular 3D Gaussian Splatting\n(3DGS) framework and propose SCISplat to improve 3D scene reconstruction\nquality and training/rendering speed by explicitly optimizing point clouds into\n3D Gaussian representations. To assess the effectiveness of our method, we\nconduct extensive evaluations using both synthetic data and real data captured\nby our SCI system. Experimental results demonstrate that our proposed approach\nsurpasses the state-of-the-art methods in terms of image reconstruction and\nnovel view synthesis. Moreover, our method also exhibits the ability to render\nhigh frame-rate multi-view consistent images in real time by leveraging SCI and\nthe rendering capabilities of 3DGS. Codes will be available at:\nhttps://github.com/WU- CVGL/SCISplat.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"UBkVdV9NAGXYab9DWcM8PQiDbkCQZg7O5KlXx5K8Gy4","pdfSize":"13290176"}