{"id":"2412.04884","title":"AI-Driven Non-Invasive Detection and Staging of Steatosis in Fatty Liver\n  Disease Using a Novel Cascade Model and Information Fusion Techniques","authors":"Niloufar Delfan, Pardis Ketabi Moghadam, Mohammad Khoshnevisan, Mehdi\n  Hosseini Chagahi, Behzad Hatami, Melika Asgharzadeh, Mohammadreza Zali,\n  Behzad Moshiri, Amin Momeni Moghaddam, Mohammad Amin Khalafi, Khosrow Dehnad","authorsParsed":[["Delfan","Niloufar",""],["Moghadam","Pardis Ketabi",""],["Khoshnevisan","Mohammad",""],["Chagahi","Mehdi Hosseini",""],["Hatami","Behzad",""],["Asgharzadeh","Melika",""],["Zali","Mohammadreza",""],["Moshiri","Behzad",""],["Moghaddam","Amin Momeni",""],["Khalafi","Mohammad Amin",""],["Dehnad","Khosrow",""]],"versions":[{"version":"v1","created":"Fri, 6 Dec 2024 09:26:22 GMT"}],"updateDate":"2024-12-09","timestamp":1733477182000,"abstract":"  Non-alcoholic fatty liver disease (NAFLD) is one of the most widespread liver\ndisorders on a global scale, posing a significant threat of progressing to more\nsevere conditions like nonalcoholic steatohepatitis (NASH), liver fibrosis,\ncirrhosis, and hepatocellular carcinoma. Diagnosing and staging NAFLD presents\nchallenges due to its non-specific symptoms and the invasive nature of liver\nbiopsies. Our research introduces a novel artificial intelligence cascade model\nemploying ensemble learning and feature fusion techniques. We developed a\nnon-invasive, robust, and reliable diagnostic artificial intelligence tool that\nutilizes anthropometric and laboratory parameters, facilitating early detection\nand intervention in NAFLD progression. Our novel artificial intelligence\nachieved an 86% accuracy rate for the NASH steatosis staging task (non-NASH,\nsteatosis grade 1, steatosis grade 2, and steatosis grade 3) and an impressive\n96% AUC-ROC for distinguishing between NASH (steatosis grade 1, grade 2, and\ngrade3) and non-NASH cases, outperforming current state-of-the-art models. This\nnotable improvement in diagnostic performance underscores the potential\napplication of artificial intelligence in the early diagnosis and treatment of\nNAFLD, leading to better patient outcomes and a reduced healthcare burden\nassociated with advanced liver disease.\n","subjects":["Computer Science/Machine Learning","Computer Science/Artificial Intelligence","Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"Ani1KiVHWyv5Ld5p1G_0DIw642LkBVgNaboY7jPogro","pdfSize":"429475"}