{
  "id": "2412.08641",
  "title": "3D Mesh Editing using Masked LRMs",
  "authors": "Will Gao, Dilin Wang, Yuchen Fan, Aljaz Bozic, Tuur Stuyck, Zhengqin\n  Li, Zhao Dong, Rakesh Ranjan, Nikolaos Sarafianos",
  "authorsParsed": [
    [
      "Gao",
      "Will",
      ""
    ],
    [
      "Wang",
      "Dilin",
      ""
    ],
    [
      "Fan",
      "Yuchen",
      ""
    ],
    [
      "Bozic",
      "Aljaz",
      ""
    ],
    [
      "Stuyck",
      "Tuur",
      ""
    ],
    [
      "Li",
      "Zhengqin",
      ""
    ],
    [
      "Dong",
      "Zhao",
      ""
    ],
    [
      "Ranjan",
      "Rakesh",
      ""
    ],
    [
      "Sarafianos",
      "Nikolaos",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 18:59:17 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733943557000,
  "abstract": "  We present a novel approach to mesh shape editing, building on recent\nprogress in 3D reconstruction from multi-view images. We formulate shape\nediting as a conditional reconstruction problem, where the model must\nreconstruct the input shape with the exception of a specified 3D region, in\nwhich the geometry should be generated from the conditional signal. To this\nend, we train a conditional Large Reconstruction Model (LRM) for masked\nreconstruction, using multi-view consistent masks rendered from a randomly\ngenerated 3D occlusion, and using one clean viewpoint as the conditional\nsignal. During inference, we manually define a 3D region to edit and provide an\nedited image from a canonical viewpoint to fill in that region. We demonstrate\nthat, in just a single forward pass, our method not only preserves the input\ngeometry in the unmasked region through reconstruction capabilities on par with\nSoTA, but is also expressive enough to perform a variety of mesh edits from a\nsingle image guidance that past works struggle with, while being 10x faster\nthan the top-performing competing prior work.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "h9SkWWEvPXx-FNvApbQZGwxdYdxvv4647DuwVWQH3MU",
  "pdfSize": "6200531"
}