{
  "id": "2412.20175",
  "title": "An Undergraduate Course on the Statistical Principles of Research Study\n  Design",
  "authors": "Lee Kennedy-Shaffer",
  "authorsParsed": [
    [
      "Kennedy-Shaffer",
      "Lee",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 28 Dec 2024 15:06:25 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735398385000,
  "abstract": "  The undergraduate curriculum in statistics and data science is undergoing\nchanges to accommodate new methods, newly interested students, and the changing\nrole of statistics in society. Because of this, it is more important than ever\nthat students understand the role of study design and how to formulate\nmeaningful scientific and statistical research questions. While the traditional\nDesign of Experiments course is still extremely valuable for students heading\nto industry and research careers, a broader study design course that\nincorporates survey sampling, observational studies, and the basics of causal\ninference with randomized experiment design is particularly useful for students\nwith a wide range of applied interests. Here, I describe such a course at a\nsmall liberal arts college, along with ways to adapt it to meet different\nstudent and instructor background and interests. The course serves as a\nvaluable bridge to advanced statistical coursework, meets key statistical\nliteracy and communication learning goals, and can be tailored to the desired\nlevel of computational and mathematical fluency. Through reading, discussing,\nand critiquing actual published research studies, students learn that\nstatistics is a living discipline with real consequences and become better\nconsumers and producers of scientific research and data-driven insights.\n",
  "subjects": [
    "Statistics/Other Statistics"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "cdGFGNx4OyFzFFEVjZSrHs5pKCMHmi12j1Kz2KX9GgY",
  "pdfSize": "2093879"
}