{"id":"2412.05930","title":"Identifying an effective model for the two-stage-Kondo regime: Numerical\n  renormalization group results","authors":"P. A. Almeida, E. Vernek, E. V. Anda, S. E. Ulloa, G. B. Martins","authorsParsed":[["Almeida","P. A.",""],["Vernek","E.",""],["Anda","E. V.",""],["Ulloa","S. E.",""],["Martins","G. B.",""]],"versions":[{"version":"v1","created":"Sun, 8 Dec 2024 12:56:17 GMT"}],"updateDate":"2025-02-27","timestamp":1733662577000,"abstract":"  A composite impurity in a metal can explore different configurations, where\nits net magnetic moment may be screened by the host electrons. An example is\nthe two-stage Kondo (TSK) system, where screening occurs at successively\nsmaller energy scales. Alternatively, impurities may prefer a local singlet\ndisconnected from the metal. This competition is influenced by the system's\ncouplings. A double quantum dot T-shape geometry, where a \"hanging\" dot is\nconnected to current leads only via another dot, allows experimental\nexploration of these regimes. Differentiating the two regimes has been\nchallenging. This study provides a method to identify the TSK regime in such a\ngeometry. The TSK regime requires a balance between the inter-dot coupling\n($t_{01}$) and the coupling of the quantum dot connected to the Fermi sea\n($\\Gamma_0$). Above a certain ratio, the system transitions to a molecular\nregime, forming a local singlet with no Kondo screening. The study identifies a\nregion in the $t_{01}$--$\\Gamma_0$ parameter space where a pure TSK regime\noccurs. Here, the second Kondo stage properties can be described by a single\nimpurity Anderson model with effective parameters. By examining the magnetic\nsusceptibility of the hanging quantum dot, a single parameter, $\\Gamma_{\\rm\neff}$, can simulate this susceptibility accurately. This effective model also\nprovides the hanging quantum dot's spectral function accurately within a\nlimited parameter range, defining the true TSK regime. Additionally, spin\ncorrelations between the quantum dots show universal behavior in this parameter\nrange. These findings can guide experimental groups in selecting parameter\nvalues to place the system in either the TSK regime or the crossover to the\nmolecular regime.\n","subjects":["Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"s-LkNnk_z6z8HJZ4n_C9cuA-e9Zv532oAlCdX4RuM7s","pdfSize":"1056758"}