{
  "id": "2412.00938",
  "title": "WR + O binaries as probes of the first phase of mass transfer",
  "authors": "Marit Nuijten (1) and Gijs Nelemans (1,2,3) ((1) Radboud University,\n  (2) KU Leuven, (3) SRON)",
  "authorsParsed": [
    [
      "Nuijten",
      "Marit",
      ""
    ],
    [
      "Nelemans",
      "Gijs",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 1 Dec 2024 19:06:24 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733079984000,
  "abstract": "  Wolf-Rayet (WR) and O-star binaries can be the progenitors of X-ray binaries\nand double black hole binaries, yet their formation is not fully understood.\nFor 21 observed WR+O systems we aim to infer \\rev{if the mass-transfer started\non the main sequence (Case A) or later (Case B). We also calculate (limits on)\nthe mass transfer efficiency $\\beta$, i.e. the fraction of transferred mass\nthat is accreted and the parameter $\\gamma$ that denotes the fraction of\nangular momentum of the binary that is lost per unit mass in units of the\naverage angular momentum of the binary per unit mass. We infer the possible\nvalues for the initial masses based on the observed WR masses and models for WR\nfrom the literature. With these initial primary masses we can create a grid of\npossible periods and secondary masses for which we can determine the values\n$\\beta$ and $\\gamma$ would have taken for either Case A or Case B mass\ntransfer. Based on this we can also determine which case of mass transfer is\nmost likely for each system. Taking into account the progenitor distribution of\nWR+O binaries we find that highly non-conservative Case A mass transfer seems\nto be the most likely scenario for the majority of systems as this can explain\n14 out of 21 systems. The angular momentum loss is likely relatively high\n(typically $\\gamma > 1$). Our finding that most systems in our sample\nexperienced Case-A mass transfer is at odds with the expectation that most\nmassive binaries go through Case B mass transfer. This suggest post-case-B\nsystems are significantly underrepresented in the observed WR+O binary\npopulation, intrinsically or due to severe selection effects.\n",
  "subjects": [
    "Astrophysics/Solar and Stellar Astrophysics",
    "Astrophysics/High Energy Astrophysical Phenomena"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "JarXVEbjFt-cveD_0XSFEShT1vmoe6jY-E2I-cWzieI",
  "pdfSize": "2380622"
}