{
  "id": "2412.17877",
  "title": "MAMBO: a lightweight ontology for multiscale materials and applications",
  "authors": "Fabio Le Piane, Matteo Baldoni, Mauro Gaspari, Francesco Mercuri",
  "authorsParsed": [
    [
      "Piane",
      "Fabio Le",
      ""
    ],
    [
      "Baldoni",
      "Matteo",
      ""
    ],
    [
      "Gaspari",
      "Mauro",
      ""
    ],
    [
      "Mercuri",
      "Francesco",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 22 Dec 2024 22:55:16 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1734908116000,
  "abstract": "  Advancements of both computational and experimental tools have recently led\nto significant progress in the development of new advanced and functional\nmaterials, paralleled by a quick growth of the overall amount of data and\ninformation on materials. However, an effective unfolding of the potential of\nadvanced and data-intensive methodologies requires systematic and efficient\nmethods for the organization of knowledge in the context of materials research\nand development. Semantic technologies can support the structured and formal\norganization of knowledge, providing a platform for the integration and\ninteroperability of data. In this work, we introduce the Materials and\nMolecules Basic Ontology (MAMBO), which aims at organizing knowledge in the\nfield of computational and experimental workflows on molecular materials and\nrelated systems (nanomaterials, supramolecular systems, molecular aggregates,\netc.). Linking recent efforts on ontologies for materials sciences in\nneighboring domains, MAMBO aims at filling gaps in current state-of-the-art\nknowledge modelling approaches for materials development and design targeting\nthe intersection between the molecular scale and higher scale domains. With a\nfocus on operational processes, lightweight, and modularity, MAMBO enables\nextensions to broader knowledge domains and integration of methodologies and\nworkflows related to both computational and experimental tools. MAMBO is\nexpected to advance the application of data-driven technologies to molecular\nmaterials, including predictive machine learning frameworks for materials\ndesign and discovery and automated platforms.\n",
  "subjects": [
    "Condensed Matter/Materials Science",
    "Physics/Computational Physics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "ix37HamUmLUlhsdfdYqq7jxh6H9XDT5Cqm09sqstl0c",
  "pdfSize": "1241149"
}