{
  "id": "2412.08081",
  "title": "How to select slices for annotation to train best-performing deep\n  learning segmentation models for cross-sectional medical images?",
  "authors": "Yixin Zhang and Kevin Kramer and Maciej A. Mazurowski",
  "authorsParsed": [
    [
      "Zhang",
      "Yixin",
      ""
    ],
    [
      "Kramer",
      "Kevin",
      ""
    ],
    [
      "Mazurowski",
      "Maciej A.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 03:59:05 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733889545000,
  "abstract": "  Automated segmentation of medical images highly depends on the availability\nof accurate manual image annotations. Such annotations are very time-consuming\nand costly to generate, and often require specialized expertise, particularly\nfor cross-sectional images which contain many slices for each patient. It is\ncrucial to ensure the best use of annotation resources. In this paper, we\nsystematically answer the question of how to select slices of cross-sectional\nmedical images in order to maximize performance of the resulting deep learning\nsegmentation models. We conducted experiments on 4 medical imaging segmentation\ntasks with varying annotation budgets, numbers of annotated cases, numbers of\nannotated slices per volume, slice selection techniques, and mask\ninterpolations. We found that:\n  1) It is almost always preferable to annotate fewer slices per volume and\nmore volumes given an annotation budget. 2) Selecting slices for annotation by\nunsupervised active learning (UAL) is not superior to selecting slices randomly\nor at fixed intervals, provided that each volume is allocated the same number\nof annotated slices. 3) Interpolating masks between annotated slices rarely\nenhances model performance, with exceptions of some specific configuration for\n3D models.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "38O5oQtjGgpJYJdkoYnciMqwKNa4kAU6X7xk9n-x_BI",
  "pdfSize": "3189940"
}