{"id":"2412.07640","title":"Spatiotemporal imaging of nonlinear optics in van der Waals waveguides","authors":"Ding Xu, Zhi Hao Peng, Chiara Trovatello, Shan-Wen Cheng, Xinyi Xu,\n  Aaron Sternbach, Dmitri N. Basov, P. James Schuck, Milan Delor","authorsParsed":[["Xu","Ding",""],["Peng","Zhi Hao",""],["Trovatello","Chiara",""],["Cheng","Shan-Wen",""],["Xu","Xinyi",""],["Sternbach","Aaron",""],["Basov","Dmitri N.",""],["Schuck","P. James",""],["Delor","Milan",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 16:19:39 GMT"}],"updateDate":"2025-01-16","timestamp":1733847579000,"abstract":"  Van der Waals (vdW) semiconductors have emerged as promising platforms for\nefficient nonlinear optical conversion, including harmonic and entangled photon\ngeneration. Although major efforts are devoted to integrating vdW materials in\nnanoscale waveguides for miniaturization, the realization of efficient,\nphase-matched conversion in these platforms remains challenging. To address\nthis challenge, we develop a far-field ultrafast imaging method to track the\npropagation of both fundamental and harmonic waves within vdW waveguides with\nextreme spatiotemporal resolution. Our approach allows systematic optimization\nof nonlinear conversion by determining the phase-matching angles, mode\nprofiles, and losses in waveguides without a priori knowledge of material\nproperties. We focus on light propagation in slab waveguides of\nrhombohedral-stacked MoS2, an emerging vdW semiconductor with giant nonlinear\nsusceptibility. Our results reveal that these waveguides support birefringent\nphase-matching, demonstrating the material's potential for efficient on-chip\nnonlinear optics. This work establishes spatiotemporal imaging of light\npropagation in waveguides as an incisive and general method to identify new\nmaterials and architectures for efficient nonlinear nanophotonics.\n","subjects":["Condensed Matter/Materials Science","Physics/Optics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"WrU4dPN4MmRGngZo_vij-il2XJM16M98wKIPK8h0AJA","pdfSize":"7338273"}