{
  "id": "2412.16369",
  "title": "Navigating AI to Unpack Youth Privacy Concerns: An In-Depth Exploration\n  and Systematic Review",
  "authors": "Ajay Kumar Shrestha, Ankur Barthwal, Molly Campbell, Austin Shouli,\n  Saad Syed, Sandhya Joshi, Julita Vassileva",
  "authorsParsed": [
    [
      "Shrestha",
      "Ajay Kumar",
      ""
    ],
    [
      "Barthwal",
      "Ankur",
      ""
    ],
    [
      "Campbell",
      "Molly",
      ""
    ],
    [
      "Shouli",
      "Austin",
      ""
    ],
    [
      "Syed",
      "Saad",
      ""
    ],
    [
      "Joshi",
      "Sandhya",
      ""
    ],
    [
      "Vassileva",
      "Julita",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 22:00:06 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734732006000,
  "abstract": "  This systematic literature review investigates perceptions, concerns, and\nexpectations of young digital citizens regarding privacy in artificial\nintelligence (AI) systems, focusing on social media platforms, educational\ntechnology, gaming systems, and recommendation algorithms. Using a rigorous\nmethodology, the review started with 2,000 papers, narrowed down to 552 after\ninitial screening, and finally refined to 108 for detailed analysis. Data\nextraction focused on privacy concerns, data-sharing practices, the balance\nbetween privacy and utility, trust factors in AI, transparency expectations,\nand strategies to enhance user control over personal data. Findings reveal\nsignificant privacy concerns among young users, including a perceived lack of\ncontrol over personal information, potential misuse of data by AI, and fears of\ndata breaches and unauthorized access. These issues are worsened by unclear\ndata collection practices and insufficient transparency in AI applications. The\nintention to share data is closely associated with perceived benefits and data\nprotection assurances. The study also highlights the role of parental mediation\nand the need for comprehensive education on data privacy. Balancing privacy and\nutility in AI applications is crucial, as young digital citizens value\npersonalized services but remain wary of privacy risks. Trust in AI is\nsignificantly influenced by transparency, reliability, predictable behavior,\nand clear communication about data usage. Strategies to improve user control\nover personal data include access to and correction of data, clear consent\nmechanisms, and robust data protection assurances. The review identifies\nresearch gaps and suggests future directions, such as longitudinal studies,\nmulticultural comparisons, and the development of ethical AI frameworks.\n",
  "subjects": [
    "Computer Science/Computers and Society",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "UGJ2oty6hG_8gr-D2fI5wY3CZSm24VID2x8qMuBd7UI",
  "pdfSize": "550014"
}