{
  "id": "2412.13069",
  "title": "Optimal operation of hole spin qubits",
  "authors": "Marion Bassi, Esteban-Alonso Rodr{\\i}guez-Mena, Boris Brun, Simon\n  Zihlmann, Thanh Nguyen, Victor Champain, Jos\\'e Carlos Abadillo-Uriel, Benoit\n  Bertrand, Heimanu Niebojewski, Romain Maurand, Yann-Michel Niquet, Xavier\n  Jehl, Silvano De Franceschi, and Vivien Schmitt",
  "authorsParsed": [
    [
      "Bassi",
      "Marion",
      ""
    ],
    [
      "Rodrıguez-Mena",
      "Esteban-Alonso",
      ""
    ],
    [
      "Brun",
      "Boris",
      ""
    ],
    [
      "Zihlmann",
      "Simon",
      ""
    ],
    [
      "Nguyen",
      "Thanh",
      ""
    ],
    [
      "Champain",
      "Victor",
      ""
    ],
    [
      "Abadillo-Uriel",
      "José Carlos",
      ""
    ],
    [
      "Bertrand",
      "Benoit",
      ""
    ],
    [
      "Niebojewski",
      "Heimanu",
      ""
    ],
    [
      "Maurand",
      "Romain",
      ""
    ],
    [
      "Niquet",
      "Yann-Michel",
      ""
    ],
    [
      "Jehl",
      "Xavier",
      ""
    ],
    [
      "De Franceschi",
      "Silvano",
      ""
    ],
    [
      "Schmitt",
      "Vivien",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 16:33:16 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734453196000,
  "abstract": "  Hole spins in silicon or germanium quantum dots have emerged as a compelling\nsolid-state platform for scalable quantum processors. Besides relying on\nwell-established manufacturing technologies, hole-spin qubits feature fast,\nelectric-field-mediated control stemming from their intrinsically large\nspin-orbit coupling [1, 2]. This key feature is accompanied by an undesirable\nsusceptibility to charge noise, which usually limits qubit coherence. Here, by\nvarying the magnetic-field orientation, we experimentally establish the\nexistence of ``sweetlines'' in the polar-azimuthal manifold where the qubit is\ninsensitive to charge noise. In agreement with recent predictions [3], we find\nthat the observed sweetlines host the points of maximal driving efficiency,\nwhere we achieve fast Rabi oscillations with quality factors as high as 1200.\nFurthermore, we demonstrate that moderate adjustments in gate voltages can\nsignificantly shift the sweetlines. This tunability allows multiple qubits to\nbe simultaneously made insensitive to electrical noise, paving the way for\nscalable qubit architectures that fully leverage all-electrical spin control.\nThe conclusions of this experimental study, performed on a silicon\nmetal-oxide-semiconductor device, are expected to apply to other\nimplementations of hole spin qubits.\n",
  "subjects": [
    "Condensed Matter/Mesoscale and Nanoscale Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "_Qp3pLKAAyEZ6vZclUrSNqBCAoiO7Xw0DxHdO3V0GFY",
  "pdfSize": "8138252"
}