{
  "id": "2412.10759",
  "title": "Ultra Diffuse Dwarf Galaxies Hosting Pseudo-bulges",
  "authors": "Yu Rong, Hong-Xin Zhang, Cheng Cheng, Qi Guo, Weiyu Ding, Zichen Hua,\n  Huiyuan Wang, Xu Kong",
  "authorsParsed": [
    [
      "Rong",
      "Yu",
      ""
    ],
    [
      "Zhang",
      "Hong-Xin",
      ""
    ],
    [
      "Cheng",
      "Cheng",
      ""
    ],
    [
      "Guo",
      "Qi",
      ""
    ],
    [
      "Ding",
      "Weiyu",
      ""
    ],
    [
      "Hua",
      "Zichen",
      ""
    ],
    [
      "Wang",
      "Huiyuan",
      ""
    ],
    [
      "Kong",
      "Xu",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 14 Dec 2024 09:05:59 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734167159000,
  "abstract": "  By analyzing data from DESI Legacy Imaging Survey of the dwarf galaxies in\nthe Arecibo Legacy Fast Alfa Survey, we have identified five ultra-diffuse\ngalaxies (UDGs) featuring central pseudo-bulges. These UDGs display blue\npseudo-bulges with S\\'ersic indices $n<2.5$ and effective radii spanning\n300-700 pc, along with bluer thin stellar disks exhibiting low surface\nbrightness and expansive effective radii that align with the UDG definition.\nThe rotation velocities of these UDGs, determined using HI line widths and\noptical inclinations, exceed those of most dwarf galaxies of similar mass,\nsuggesting the high halo spins or substantial dark matter halos. We propose\nthat these UDGs likely formed through mergers of dwarf galaxies lacking old\nstars in their progenitors, resulting in the development of central bulge-like\nstructures during starbursts triggered by the mergers, while also enhancing\ntheir halo spin. Subsequent gas accretion facilitated the formation of extended\nstellar disks. It is also worth noting the possibility that these UDGs could\nalternatively represent ``failed $L^{\\star}$ galaxies'' with massive dark\nmatter halos but reduced star formation efficiencies. If future high-resolution\nHI observations confirm the presence of massive halos around these UDGs, they\nmay have formed due to intense AGN feedback in the early universe, and may be\nthe descendants of ``little red dots'' observed by the James Webb Space\nTelescope, which are characterized by heightened central black hole masses and\nintensified accretion and feedback processes in the early universe.\n",
  "subjects": [
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "fHjnQYfhYv2YVIdLXPhMoEbw2219JBrW3NsOAw1oSTQ",
  "pdfSize": "3037604"
}