{
  "id": "2412.10530",
  "title": "Deep Reinforcement Learning for Scalable Multiagent Spacecraft\n  Inspection",
  "authors": "Kyle Dunlap, Nathaniel Hamilton, Kerianne L. Hobbs",
  "authorsParsed": [
    [
      "Dunlap",
      "Kyle",
      ""
    ],
    [
      "Hamilton",
      "Nathaniel",
      ""
    ],
    [
      "Hobbs",
      "Kerianne L.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 19:54:51 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734119691000,
  "abstract": "  As the number of spacecraft in orbit continues to increase, it is becoming\nmore challenging for human operators to manage each mission. As a result,\nautonomous control methods are needed to reduce this burden on operators. One\nmethod of autonomous control is Reinforcement Learning (RL), which has proven\nto have great success across a variety of complex tasks. For missions with\nmultiple controlled spacecraft, or agents, it is critical for the agents to\ncommunicate and have knowledge of each other, where this information is\ntypically given to the Neural Network Controller (NNC) as an input observation.\nAs the number of spacecraft used for the mission increases or decreases, rather\nthan modifying the size of the observation, this paper develops a scalable\nobservation space that uses a constant observation size to give information on\nall of the other agents. This approach is similar to a lidar sensor, where\ndetermines ranges of other objects in the environment. This observation space\nis applied to a spacecraft inspection task, where RL is used to train multiple\ndeputy spacecraft to cooperate and inspect a passive chief spacecraft. It is\nexpected that the scalable observation space will allow the agents to learn to\ncomplete the task more efficiently compared to a baseline solution where no\ninformation is communicated between agents.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Systems and Control",
    "Computer Science/Systems and Control"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "XV6-efksk2fQKL1u-rnhQrnRetMa3OSUxX68Pqv90PA",
  "pdfSize": "1291067"
}