{
  "id": "2412.09002",
  "title": "Stellar parameter prediction and spectral simulation using machine\n  learning",
  "authors": "Vojt\\v{e}ch Cvr\\v{c}ek, Martino Romaniello, Radim \\v{S}\\'ara, Wolfram\n  Freudling, Pascal Ballester",
  "authorsParsed": [
    [
      "Cvrček",
      "Vojtěch",
      ""
    ],
    [
      "Romaniello",
      "Martino",
      ""
    ],
    [
      "Šára",
      "Radim",
      ""
    ],
    [
      "Freudling",
      "Wolfram",
      ""
    ],
    [
      "Ballester",
      "Pascal",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 07:09:42 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1733987382000,
  "abstract": "  We applied machine learning to the entire data history of ESO's High Accuracy\nRadial Velocity Planet Searcher (HARPS) instrument. Our primary goal was to\nrecover the physical properties of the observed objects, with a secondary\nemphasis on simulating spectra. We systematically investigated the impact of\nvarious factors on the accuracy and fidelity of the results, including the use\nof simulated data, the effect of varying amounts of real training data, network\narchitectures, and learning paradigms. Our approach integrates supervised and\nunsupervised learning techniques within autoencoder frameworks. Our methodology\nleverages an existing simulation model that utilizes a library of existing\nstellar spectra in which the emerging flux is computed from first principles\nrooted in physics and a HARPS instrument model to generate simulated spectra\ncomparable to observational data. We trained standard and variational\nautoencoders on HARPS data to predict spectral parameters and generate spectra.\nOur models excel at predicting spectral parameters and compressing real\nspectra, and they achieved a mean prediction error of approximately 50 K for\neffective temperatures, making them relevant for most astrophysical\napplications. Furthermore, the models predict metallicity ([M/H]) and surface\ngravity (log g) with an accuracy of approximately 0.03 dex and 0.04 dex,\nrespectively, underscoring their broad applicability in astrophysical research.\nThe models' computational efficiency, with processing times of 779.6 ms on CPU\nand 3.97 ms on GPU, makes them valuable for high-throughput applications like\nmassive spectroscopic surveys and large archival studies. By achieving accuracy\ncomparable to classical methods with significantly reduced computation time,\nour methodology enhances the scope and efficiency of spectroscopic analysis.\n",
  "subjects": [
    "Astrophysics/Solar and Stellar Astrophysics",
    "Astrophysics/Earth and Planetary Astrophysics",
    "Astrophysics/Instrumentation and Methods for Astrophysics",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "oMpgbY-75YwJ1hetWLa5kt9Yr7fR3A838uq5mgYjz3U",
  "pdfSize": "927711"
}