{
  "id": "2412.19915",
  "title": "Identifying Cocoa Pollinators: A Deep Learning Dataset",
  "authors": "Wenxiu Xu, Saba Ghorbani Bazegar, Dong Sheng, Manuel Toledo-Hernandez,\n  ZhenZhong Lan, Thomas Cherico Wanger",
  "authorsParsed": [
    [
      "Xu",
      "Wenxiu",
      ""
    ],
    [
      "Bazegar",
      "Saba Ghorbani",
      ""
    ],
    [
      "Sheng",
      "Dong",
      ""
    ],
    [
      "Toledo-Hernandez",
      "Manuel",
      ""
    ],
    [
      "Lan",
      "ZhenZhong",
      ""
    ],
    [
      "Wanger",
      "Thomas Cherico",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 27 Dec 2024 20:27:52 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735331272000,
  "abstract": "  Cocoa is a multi-billion-dollar industry but research on improving yields\nthrough pollination remains limited. New embedded hardware and AI-based data\nanalysis is advancing information on cocoa flower visitors, their identity and\nimplications for yields. We present the first cocoa flower visitor dataset\ncontaining 5,792 images of Ceratopogonidae, Formicidae, Aphididae, Araneae, and\nEncyrtidae, and 1,082 background cocoa flower images. This dataset was curated\nfrom 23 million images collected over two years by embedded cameras in cocoa\nplantations in Hainan province, China. We exemplify the use of the dataset with\ndifferent sizes of YOLOv8 models and by progressively increasing the background\nimage ratio in the training set to identify the best-performing model. The\nmedium-sized YOLOv8 model achieved the best results with 8% background images\n(F1 Score of 0.71, mAP50 of 0.70). Overall, this dataset is useful to compare\nthe performance of deep learning model architectures on images with low\ncontrast images and difficult detection targets. The data can support future\nefforts to advance sustainable cocoa production through pollination monitoring\nprojects.\n",
  "subjects": [
    "Quantitative Biology/Quantitative Methods",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "0LgqYXFLZXm0iB86BreAhzJ9Hw-d4VoSLEH58X0zhcs",
  "pdfSize": "1009246"
}