{
  "id": "2412.11030",
  "title": "How to Achieve Justice through Big Data: A Study Based on Credit Card\n  Cases in Beijing",
  "authors": "Cheng-To Lin, Chung-Han Tsai, Baowen Zhang, Qingyue Deng, Yunhui Zhao,\n  Zhijia Song",
  "authorsParsed": [
    [
      "Lin",
      "Cheng-To",
      ""
    ],
    [
      "Tsai",
      "Chung-Han",
      ""
    ],
    [
      "Zhang",
      "Baowen",
      ""
    ],
    [
      "Deng",
      "Qingyue",
      ""
    ],
    [
      "Zhao",
      "Yunhui",
      ""
    ],
    [
      "Song",
      "Zhijia",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 15 Dec 2024 02:53:39 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734231219000,
  "abstract": "  With the development of intelligence, the combination of big data and\njudicial practice has become a hot research topic. There are fewer studies on\ncredit card contract disputes related to big data, which makes it difficult to\nrespond to the trend of Big data era. This paper uses the data source of credit\ncard disputes related to the protection of personal information in Beijing from\n2022 to 2024, introduces a social network analysis methodology to analyse\nvalidated judgements and creates a database. Through the analysis of the\nrelationship network indicators of applicable laws and regulations, it can\nclearly show the laws and regulations applicable to this type of dispute in\nChina in terms of substantive and procedural matters. This paper provides a\nmethodology for combining big data with judicial trials and assisting judges in\ntrials. The effective use of social networks will help fill the gap in the\napplication of big data in judicial trials. The result and discussion of the\npaper is also of practical significance for improving the efficiency of\njudicial adjudication, constructing a database for searching classified cases,\nconstructing a holistic system for digital courts, and finally promoting\njustice.\n",
  "subjects": [
    "Computer Science/Social and Information Networks"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "VzSCyUcIXB6x5Ihidr1NNKsv6ODPzfrMVwSnZ3Q1Gus",
  "pdfSize": "1933343"
}