{"id":"2412.13830","title":"Selective excitation of collective modes in multiband superconductor\n  MgB2","authors":"Jiayu Yuan, Liyu Shi, Tiequan Xu, Yue Wang, Zizhao Gan, Hao Wang,\n  Tianyi Wu, Dong Wu, Tao Dong, Nanlin Wang","authorsParsed":[["Yuan","Jiayu",""],["Shi","Liyu",""],["Xu","Tiequan",""],["Wang","Yue",""],["Gan","Zizhao",""],["Wang","Hao",""],["Wu","Tianyi",""],["Wu","Dong",""],["Dong","Tao",""],["Wang","Nanlin",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 13:20:28 GMT"}],"updateDate":"2024-12-19","timestamp":1734528028000,"abstract":"  Recent developments in nonequilibrium and nonlinear terahertz (THz)\nspectroscopies have significantly advanced our understanding of collective\nexcitations in superconductors. However, there is still debate surrounding the\nidentification of Higgs or Leggett modes, as well as BCS charge fluctuations,\nin the well-known two-band superconductor MgB$_2$. Here, we utilized both\nmulti-cycle and single-cycle THz pump-broadband THz probe techniques to\ninvestigate the THz nonlinear response of MgB$_2$. Through multicycle THz\npump-THz probe experiments on MgB$_2$, we observed distinct nonlinear signals\nat both the fundamental frequency ($\\omega$) and the second harmonic frequency\n(2$\\omega$) of the pump pulses, which exhibited resonant enhancement at\ntemperatures where their frequencies respectively match 2$\\Delta_{\\pi}(T)$.\nThey are mainly attributed to the $\\pi$-band Higgs mode. By adjusting the THz\npump pulse to a single-cycle waveform that satisfies non-adiabatic excitation\ncriteria, we observed an over-damped oscillation corresponding to the Leggett\nmode. Our findings contribute to solving the ongoing debates and demonstrate\nthe selective excitation of collective modes in multiband superconductors,\noffering new insights into the interaction between Higgs and Leggett modes.\n","subjects":["Condensed Matter/Superconductivity"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"gNGSQ3fWM4IWwyrn6hGVT83QkI6m3zv0pN6elyRm1VE","pdfSize":"17196581"}