{
  "id": "2412.00100",
  "title": "Steering Rectified Flow Models in the Vector Field for Controlled Image\n  Generation",
  "authors": "Maitreya Patel, Song Wen, Dimitris N. Metaxas, Yezhou Yang",
  "authorsParsed": [
    [
      "Patel",
      "Maitreya",
      ""
    ],
    [
      "Wen",
      "Song",
      ""
    ],
    [
      "Metaxas",
      "Dimitris N.",
      ""
    ],
    [
      "Yang",
      "Yezhou",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 27 Nov 2024 19:04:40 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1732734280000,
  "abstract": "  Diffusion models (DMs) excel in photorealism, image editing, and solving\ninverse problems, aided by classifier-free guidance and image inversion\ntechniques. However, rectified flow models (RFMs) remain underexplored for\nthese tasks. Existing DM-based methods often require additional training, lack\ngeneralization to pretrained latent models, underperform, and demand\nsignificant computational resources due to extensive backpropagation through\nODE solvers and inversion processes. In this work, we first develop a\ntheoretical and empirical understanding of the vector field dynamics of RFMs in\nefficiently guiding the denoising trajectory. Our findings reveal that we can\nnavigate the vector field in a deterministic and gradient-free manner.\nUtilizing this property, we propose FlowChef, which leverages the vector field\nto steer the denoising trajectory for controlled image generation tasks,\nfacilitated by gradient skipping. FlowChef is a unified framework for\ncontrolled image generation that, for the first time, simultaneously addresses\nclassifier guidance, linear inverse problems, and image editing without the\nneed for extra training, inversion, or intensive backpropagation. Finally, we\nperform extensive evaluations and show that FlowChef significantly outperforms\nbaselines in terms of performance, memory, and time requirements, achieving new\nstate-of-the-art results. Project Page: \\url{https://flowchef.github.io}.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Machine Learning",
    "Statistics/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "49PlH_taZZ4u3ouwv2fSgPqX8zLnWAhud3OGIbBLtjo",
  "pdfSize": "13933891"
}