{"id":"2412.05478","title":"SZ-X-ray Surface Brightness Fluctuations in the SPT-XMM clusters","authors":"Charles Romero, Massimo Gaspari, Gerrit Schellenberger, Bradford A.\n  Benson, Lindsey E. Bleem, Esra Bulbul, William Forman, Ralph Kraft, Paul\n  Nulsen, Christian L. Reichardt, Arnab Sarkar, Taweewat Somboonpanyakul, and\n  Yuanyuan Su","authorsParsed":[["Romero","Charles",""],["Gaspari","Massimo",""],["Schellenberger","Gerrit",""],["Benson","Bradford A.",""],["Bleem","Lindsey E.",""],["Bulbul","Esra",""],["Forman","William",""],["Kraft","Ralph",""],["Nulsen","Paul",""],["Reichardt","Christian L.",""],["Sarkar","Arnab",""],["Somboonpanyakul","Taweewat",""],["Su","Yuanyuan",""]],"versions":[{"version":"v1","created":"Sat, 7 Dec 2024 00:37:47 GMT"}],"updateDate":"2024-12-10","timestamp":1733531867000,"abstract":"  The hot plasma in galaxy clusters, the intracluster medium (ICM), is expected\nto be shaped by subsonic turbulent motions, which are key for heating, cooling,\nand transport mechanisms. The turbulent motions contribute to the non-thermal\npressure which, if not accounted for, consequently imparts a hydrostatic mass\nbias. Accessing information about turbulent motions is thus of major\nastrophysical and cosmological interest. Characteristics of turbulent motions\ncan be indirectly accessed through surface brightness fluctuations. This study\nexpands on our pilot investigations of surface brightness fluctuations in the\nSZ and X-ray by examining, for the first time, a large sample of 60 clusters\nusing both SPT-SZ and XMM-Newton data and span the redshift range $0.2 < z <\n1.5$, thus constraining the respective pressure and density fluctuations within\n0.6~$R_{500}$. We deem density fluctuations to be of sufficient quality for 32\nclusters, finding mild correlations between the peak of the amplitude spectra\nof density fluctuations and various dynamical parameters. We infer turbulent\nvelocities from density fluctuations with an average Mach number\n$\\mathcal{M}_{\\text{3D}} = 0.52 \\pm 0.14$, in agreement with numerical\nsimulations. For clusters with inferred turbulent Mach numbers from both\npressure, $\\mathcal{M}_{\\text{P}}$ and density fluctuations,\n$\\mathcal{M}_{\\rho}$, we find broad agreement between $\\mathcal{M}_{\\text{P}}$\nand $\\mathcal{M}_{\\rho}$. Our results suggest a bimodal Mach number\ndistribution, with the majority of clusters being turbulence-dominated\n(subsonic) while the remainder are shock-dominated (supersonic).\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"PpHBuGb7b3CdH7cabAc7vnxZycJRFD0tfY63p_OE3xA","pdfSize":"1808602"}