{"id":"2412.16420","title":"Beyond End-to-End VLMs: Leveraging Intermediate Text Representations for\n  Superior Flowchart Understanding","authors":"Junyi Ye, Ankan Dash, Wenpeng Yin, Guiling Wang","authorsParsed":[["Ye","Junyi",""],["Dash","Ankan",""],["Yin","Wenpeng",""],["Wang","Guiling",""]],"versions":[{"version":"v1","created":"Sat, 21 Dec 2024 00:52:41 GMT"}],"updateDate":"2024-12-24","timestamp":1734742361000,"abstract":"  Flowcharts are typically presented as images, driving the trend of using\nvision-language models (VLMs) for end-to-end flowchart understanding. However,\ntwo key challenges arise: (i) Limited controllability--users have minimal\ninfluence over the downstream task, as they can only modify input images, while\nthe training of VLMs is often out of reach for most researchers. (ii) Lack of\nexplainability--it is difficult to trace VLM errors to specific causes, such as\nfailures in visual encoding or reasoning. We propose TextFlow, addressing\naforementioned issues with two stages: (i) Vision Textualizer--which generates\ntextual representations from flowchart images; and (ii) Textual Reasoner--which\nperforms question-answering based on the text representations. TextFlow offers\nthree key advantages: (i) users can select the type of text representations\n(e.g., Graphviz, Mermaid, PlantUML), or further convert them into executable\ngraph object to call tools, enhancing performance and controllability; (ii) it\nimproves explainability by helping to attribute errors more clearly to visual\nor textual processing components; and (iii) it promotes the modularization of\nthe solution, such as allowing advanced LLMs to be used in the Reasoner stage\nwhen VLMs underperform in end-to-end fashion. Experiments on the FlowVQA and\nFlowLearn benchmarks demonstrate TextFlow's state-of-the-art performance as\nwell as its robustness. All code is publicly available.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"mozalUoRuTY5ni27Y5XvkNGVVQYPGhj3umFgeuVPOxY","pdfSize":"1037719"}