{"id":"2412.15803","title":"WebLLM: A High-Performance In-Browser LLM Inference Engine","authors":"Charlie F. Ruan, Yucheng Qin, Xun Zhou, Ruihang Lai, Hongyi Jin, Yixin\n  Dong, Bohan Hou, Meng-Shiun Yu, Yiyan Zhai, Sudeep Agarwal, Hangrui Cao,\n  Siyuan Feng, Tianqi Chen","authorsParsed":[["Ruan","Charlie F.",""],["Qin","Yucheng",""],["Zhou","Xun",""],["Lai","Ruihang",""],["Jin","Hongyi",""],["Dong","Yixin",""],["Hou","Bohan",""],["Yu","Meng-Shiun",""],["Zhai","Yiyan",""],["Agarwal","Sudeep",""],["Cao","Hangrui",""],["Feng","Siyuan",""],["Chen","Tianqi",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 11:24:13 GMT"}],"updateDate":"2024-12-23","timestamp":1734693853000,"abstract":"  Advancements in large language models (LLMs) have unlocked remarkable\ncapabilities. While deploying these models typically requires server-grade GPUs\nand cloud-based inference, the recent emergence of smaller open-source models\nand increasingly powerful consumer devices have made on-device deployment\npractical. The web browser as a platform for on-device deployment is\nuniversally accessible, provides a natural agentic environment, and\nconveniently abstracts out the different backends from diverse device vendors.\nTo address this opportunity, we introduce WebLLM, an open-source JavaScript\nframework that enables high-performance LLM inference entirely within web\nbrowsers. WebLLM provides an OpenAI-style API for seamless integration into web\napplications, and leverages WebGPU for efficient local GPU acceleration and\nWebAssembly for performant CPU computation. With machine learning compilers\nMLC-LLM and Apache TVM, WebLLM leverages optimized WebGPU kernels, overcoming\nthe absence of performant WebGPU kernel libraries. Evaluations show that WebLLM\ncan retain up to 80% native performance on the same device, with room to\nfurther close the gap. WebLLM paves the way for universally accessible,\nprivacy-preserving, personalized, and locally powered LLM applications in web\nbrowsers. The code is available at: https://github.com/mlc-ai/web-llm.\n","subjects":["Computer Science/Machine Learning","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"XbDWj3215Rr5BcngDVR7wwGm8Kg96EOg46lq7HRWr58","pdfSize":"389399"}