{"id":"2412.01616","title":"Concealing Circumbinary Planets with Tidal Shrinkage","authors":"Saahit Mogan, J. J. Zanazzi","authorsParsed":[["Mogan","Saahit",""],["Zanazzi","J. J.",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 15:38:49 GMT"}],"updateDate":"2024-12-03","timestamp":1733153929000,"abstract":"  Of the 14 transiting planets that have been detected orbiting eclipsing\nbinaries ('circumbinary planets'), none have been detected with stellar binary\norbital periods shorter than 7 days, despite such binaries existing in\nabundance. The eccentricity-period data for stellar binaries indicates that\nshort-period ($< 7$ day) binaries have had their orbits tidally circularized.\nWe examine here to what extent tidal circularization and shrinkage can conceal\ncircumbinary planets, i.e. whether planets actually exist around short-period\nbinaries, but are not detected because their transit probabilities drop as\ntides shrink the binary away from the planet. We carry out a population\nsynthesis by initializing a population of eccentric stellar binaries hosting\ncircumbinary planets, and then circularizing and tightening the host orbits\nusing stellar tides. To match the circumbinary transit statistics, stellar\nbinaries must form with eccentricities $\\gtrsim$ 0.2 and periods $\\gtrsim$ 6\ndays, with circumbinary planets emplaced on exterior stable orbits before tidal\ncircularization; moreover, tidal dissipation must be efficient enough to\ncircularize and shrink binaries out to $\\sim$6-8 days. The resultant binaries\nthat shrink to sub-7-day periods no longer host transiting planets. However,\nthis scenario cannot explain the formation of nearly circular, tight binaries,\nbrought to their present sub-seven-day orbits from other processes like disk\nmigration. Still, tidal shrinkage can introduce a bias against finding\ntransiting circumbinary planets, and predicts a population of KIC 3853259 (AB)b\nanalogs consisting of wide-separation, non-transiting planets orbiting tight\nbinaries.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Tp0KCUJcRRubs3UF8PlfMOBkRmHNBcqyo44FR4yKaVc","pdfSize":"3742793"}