{"id":"2412.14522","title":"CwA-T: A Channelwise AutoEncoder with Transformer for EEG Abnormality\n  Detection","authors":"Youshen Zhao, Keiji Iramina","authorsParsed":[["Zhao","Youshen",""],["Iramina","Keiji",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 04:38:34 GMT"},{"version":"v2","created":"Tue, 24 Dec 2024 00:56:06 GMT"}],"updateDate":"2024-12-25","timestamp":1734583114000,"abstract":"  Electroencephalogram (EEG) signals are critical for detecting abnormal brain\nactivity, but their high dimensionality and complexity pose significant\nchallenges for effective analysis. In this paper, we propose CwA-T, a novel\nframework that combines a channelwise CNN-based autoencoder with a single-head\ntransformer classifier for efficient EEG abnormality detection. The channelwise\nautoencoder compresses raw EEG signals while preserving channel independence,\nreducing computational costs and retaining biologically meaningful features.\nThe compressed representations are then fed into the transformer-based\nclassifier, which efficiently models long-term dependencies to distinguish\nbetween normal and abnormal signals. Evaluated on the TUH Abnormal EEG Corpus,\nthe proposed model achieves 85.0% accuracy, 76.2% sensitivity, and 91.2%\nspecificity at the per-case level, outperforming baseline models such as\nEEGNet, Deep4Conv, and FusionCNN. Furthermore, CwA-T requires only 202M FLOPs\nand 2.9M parameters, making it significantly more efficient than\ntransformer-based alternatives. The framework retains interpretability through\nits channelwise design, demonstrating great potential for future applications\nin neuroscience research and clinical practice. The source code is available at\nhttps://github.com/YossiZhao/CAE-T.\n","subjects":["Computer Science/Machine Learning","Computer Science/Artificial Intelligence","Computer Science/Neural and Evolutionary Computing","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"QdI4zVJmpTo8XdesNKPLuAKKkm7tS-cAIMdT083BKWg","pdfSize":"2125643"}