{
  "id": "2412.09090",
  "title": "Integrated trucks assignment and scheduling problem with mixed service\n  mode docks: A Q-learning based adaptive large neighborhood search algorithm",
  "authors": "Yueyi Li, Mehrdad Mohammadi, Xiaodong Zhang, Yunxing Lan, Willem van\n  Jaarsveld",
  "authorsParsed": [
    [
      "Li",
      "Yueyi",
      ""
    ],
    [
      "Mohammadi",
      "Mehrdad",
      ""
    ],
    [
      "Zhang",
      "Xiaodong",
      ""
    ],
    [
      "Lan",
      "Yunxing",
      ""
    ],
    [
      "van Jaarsveld",
      "Willem",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 09:17:35 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1733995055000,
  "abstract": "  Mixed service mode docks enhance efficiency by flexibly handling both loading\nand unloading trucks in warehouses. However, existing research often\npredetermines the number and location of these docks prior to planning truck\nassignment and sequencing. This paper proposes a new model integrating dock\nmode decision, truck assignment, and scheduling, thus enabling adaptive dock\nmode arrangements. Specifically, we introduce a Q-learning-based adaptive large\nneighborhood search (Q-ALNS) algorithm to address the integrated problem. The\nalgorithm adjusts dock modes via perturbation operators, while truck assignment\nand scheduling are solved using destroy and repair local search operators.\nQ-learning adaptively selects these operators based on their performance\nhistory and future gains, employing the epsilon-greedy strategy. Extensive\nexperimental results and statistical analysis indicate that the Q-ALNS benefits\nfrom efficient operator combinations and its adaptive mechanism, consistently\noutperforming benchmark algorithms in terms of optimality gap and Pareto front\ndiscovery. In comparison to the predetermined service mode, our adaptive\nstrategy results in lower average tardiness and makespan, highlighting its\nsuperior adaptability to varying demands.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Mathematics/Optimization and Control"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "2DxA_ABbFrz_lAtTXu2kRKCNmesPw2YcLKbETm-k9Fc",
  "pdfSize": "3431527"
}