{
  "id": "2412.05454",
  "title": "GLONET: Mercator's End-to-End Neural Forecasting System",
  "authors": "Anass El Aouni, Quentin Gaudel, Charly Regnier, Simon Van Gennip,\n  Marie Drevillon, Yann Drillet and Jean-Michel Lellouche",
  "authorsParsed": [
    [
      "Aouni",
      "Anass El",
      ""
    ],
    [
      "Gaudel",
      "Quentin",
      ""
    ],
    [
      "Regnier",
      "Charly",
      ""
    ],
    [
      "Van Gennip",
      "Simon",
      ""
    ],
    [
      "Drevillon",
      "Marie",
      ""
    ],
    [
      "Drillet",
      "Yann",
      ""
    ],
    [
      "Lellouche",
      "Jean-Michel",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 22:28:43 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733524123000,
  "abstract": "  Accurate ocean forecasting is crucial in different areas ranging from science\nto decision making. Recent advancements in data-driven models have shown\nsignificant promise, particularly in weather forecasting community, but yet no\ndata-driven approaches have matched the accuracy and the scalability of\ntraditional global ocean forecasting systems that rely on physics-driven\nnumerical models and can be very computationally expensive, depending on their\nspatial resolution or complexity. Here, we introduce GLONET, a global ocean\nneural network-based forecasting system, developed by Mercator Ocean\nInternational. GLONET is trained on the global Mercator Ocean physical\nreanalysis GLORYS12 to integrate physics-based principles through neural\noperators and networks, which dynamically capture local-global interactions\nwithin a unified, scalable framework, ensuring high small-scale accuracy and\nefficient dynamics. GLONET's performance is assessed and benchmarked against\ntwo other forecasting systems: the global Mercator Ocean analysis and\nforecasting 1/12 high-resolution physical system GLO12 and a recent\nneural-based system also trained from GLORYS12. A series of comprehensive\nvalidation metrics is proposed, specifically tailored for neural network-based\nocean forecasting systems, which extend beyond traditional point-wise error\nassessments that can introduce bias towards neural networks optimized primarily\nto minimize such metrics. The preliminary evaluation of GLONET shows promising\nresults, for temperature, sea surface height, salinity and ocean currents.\nGLONET's experimental daily forecast are accessible through the European\nDigital Twin Ocean platform EDITO.\n",
  "subjects": [
    "Physics/Fluid Dynamics",
    "Physics/Atmospheric and Oceanic Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "sJ35eFOLwrVl3mk4Di_x05cpjY73pgcOr0fAZn_-aes",
  "pdfSize": "8248144"
}