{"id":"2412.07052","title":"The Impact of Halo Radius Definition on Subhalo Occupation Variation","authors":"Emily Sageser, Yao-Yuan Mao, and Ekta Patel (University of Utah)","authorsParsed":[["Sageser","Emily","","University of Utah"],["Mao","Yao-Yuan","","University of Utah"],["Patel","Ekta","","University of Utah"]],"versions":[{"version":"v1","created":"Mon, 9 Dec 2024 23:26:45 GMT"}],"updateDate":"2024-12-11","timestamp":1733786805000,"abstract":"  Dark Matter halo properties have been studied extensively within the virial\nradius of host halo systems, and previous research shows that there are\ncorrelations between host halo properties and subhalo occupation. This work\nexplores how the correlation would change when one extends the definition of\nsubhalo occupation out to 1.5 Mpc for Milky Way-mass host halos. We compute the\ncorrelations between four host halo properties (half-mass scale, concentration,\npeak-mass scale, and spin) and subhalo occupation with varying halo radius\ndefinitions. We find that the host halo properties impact satellite occupation\nbeyond the virial radius and the locations at which the correlation peaks do\nnot typically align with the virial radius or splashback radius. The behavior\nof the subhalo occupation variation as a function of radius, especially in the\noutskirts, is connected to the effect of halo assembly bias. However, there is\nno universal behavior in the subhalo occupation variation as the halo radius\ndefinition changes. We further find that using a ratio of the number of\nsubhalos within an individual host system rather than total number counts can,\nto some extent, eliminate its concentration dependence. This method shows\npromise for using observed satellite counts to estimate host halo mass. Our\nanalysis highlights the utility of extending observational surveys of satellite\ngalaxies to beyond the virial radius.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7AMAjXG1ZMkEJaKuN-QOnvzW5rXUyv_L36OBT5c46tw","pdfSize":"944553"}