{"id":"2412.18549","title":"Post-pandemic social contacts in Italy: implications for social\n  distancing measures on in-person school and work attendance","authors":"Lorenzo Lucchini, Valentina Marziano, Filippo Trentini, Chiara\n  Chiavenna, Elena D'Agnese, Vittoria Offeddu, Mattia Manica, Piero Poletti,\n  Duilio Balsamo, Giorgio Guzzetta, Marco Aielli, Alessia Melegaro, Stefano\n  Merler","authorsParsed":[["Lucchini","Lorenzo",""],["Marziano","Valentina",""],["Trentini","Filippo",""],["Chiavenna","Chiara",""],["D'Agnese","Elena",""],["Offeddu","Vittoria",""],["Manica","Mattia",""],["Poletti","Piero",""],["Balsamo","Duilio",""],["Guzzetta","Giorgio",""],["Aielli","Marco",""],["Melegaro","Alessia",""],["Merler","Stefano",""]],"versions":[{"version":"v1","created":"Tue, 24 Dec 2024 17:01:29 GMT"}],"updateDate":"2024-12-25","timestamp":1735059689000,"abstract":"  The collection of updated data on social contact patterns following the\nCOVID-19 pandemic disruptions is crucial for future epidemiological assessments\nand evaluating non-pharmaceutical interventions (NPIs) based on physical\ndistancing. We conducted two waves of an online survey in March 2022 and March\n2023 in Italy, gathering data from a representative population sample on direct\n(verbal/physical interactions) and indirect (prolonged co-location in indoor\nspaces) contacts. Using a generalized linear mixed model, we examined\ndeterminants of individuals' total social contacts and evaluated the potential\nimpact of work-from-home and distance learning on the transmissibility of\nrespiratory pathogens. In-person attendance at work or school emerged as a\nprimary driver of social contacts. Adults attending in person reported a mean\nof 1.69 (95% CI: 1.56-1.84) times the contacts of those staying home; among\nchildren and adolescents, this ratio increased to 2.38 (95% CI: 1.98-2.87). We\nestimated that suspending all non-essential work alone would marginally reduce\ntransmissibility. However, combining distance learning for all education levels\nwith work-from-home policies could decrease transmissibility by up to 23.7%\n(95% CI: 18.2%-29.0%). Extending these measures to early childcare services\nwould yield only minimal additional benefits. These results provide useful data\nfor modelling the transmission of respiratory pathogens in Italy after the end\nof the COVID-19 emergency. They also provide insights into the potential\nepidemiological effectiveness of social distancing interventions targeting work\nand school attendance, supporting considerations on the balance between the\nexpected benefits and their heavy societal costs.\n","subjects":["Physics/Physics and Society","Computer Science/Social and Information Networks","Nonlinear Sciences/Adaptation and Self-Organizing Systems","Physics/Medical Physics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"B0Vm8hmi-xF6vMhPueX8nWM-GVmSqzhuS_36hnvcOD0","pdfSize":"13581359"}