{
  "id": "2412.11236",
  "title": "Logarithmic Positional Partition Interval Encoding",
  "authors": "Vasileios Alevizos and Nikitas Gerolimos and Sabrina Edralin and Clark\n  Xu and Akebu Simasiku and Georgios Priniotakis and George Papakostas and\n  Zongliang Yue",
  "authorsParsed": [
    [
      "Alevizos",
      "Vasileios",
      ""
    ],
    [
      "Gerolimos",
      "Nikitas",
      ""
    ],
    [
      "Edralin",
      "Sabrina",
      ""
    ],
    [
      "Xu",
      "Clark",
      ""
    ],
    [
      "Simasiku",
      "Akebu",
      ""
    ],
    [
      "Priniotakis",
      "Georgios",
      ""
    ],
    [
      "Papakostas",
      "George",
      ""
    ],
    [
      "Yue",
      "Zongliang",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 15 Dec 2024 16:22:13 GMT"
    }
  ],
  "updateDate": "2025-01-22",
  "timestamp": 1734279733000,
  "abstract": "  One requirement of maintaining digital information is storage. With the\nlatest advances in the digital world, new emerging media types have required\neven more storage space to be kept than before. In fact, in many cases it is\nrequired to have larger amounts of storage to keep up with protocols that\nsupport more types of information at the same time. In contrast, compression\nalgorithms have been integrated to facilitate the transfer of larger data.\nNumerical representations are construed as embodiments of information. However,\nthis correct association of a sequence could feasibly be inverted to signify an\nelongated series of numerals. In this work, a novel mathematical paradigm was\nintroduced to engineer a methodology reliant on iterative logarithmic\ntransformations, finely tuned to numeric sequences. Through this fledgling\napproach, an intricate interplay of polymorphic numeric manipulations was\nconducted. By applying repeated logarithmic operations, the data were condensed\ninto a minuscule representation. Approximately thirteen times surpassed the\ncompression method, ZIP. Such extreme compaction, achieved through iterative\nreduction of expansive integers until they manifested as single-digit entities,\nconferred a novel sense of informational embodiment. Instead of relegating data\nto classical discrete encodings, this method transformed them into a\nquasi-continuous, logarithmically. By contrast, this introduced approach\nrevealed that morphing data into deeply compressed numerical substrata beyond\nconventional boundaries was feasible. A holistic perspective emerges,\nvalidating that numeric data can be recalibrated into ephemeral sequences of\nlogarithmic impressions. It was not merely a matter of reducing digits, but of\nreinterpreting data through a resolute numeric vantage.\n",
  "subjects": [
    "Computer Science/Data Structures and Algorithms",
    "Computer Science/Information Theory",
    "Electrical Engineering and Systems Science/Signal Processing",
    "Mathematics/Information Theory"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "fasTpE3AdUbp-NRMCFLNMUrIOYH8dXIW8FnvtjA08fA",
  "pdfSize": "79521"
}