{"id":"2412.05943","title":"Adversarial Transferability in Deep Denoising Models: Theoretical\n  Insights and Robustness Enhancement via Out-of-Distribution Typical Set\n  Sampling","authors":"Jie Ning, Jiebao Sun, Shengzhu Shi, Zhichang Guo, Yao Li, Hongwei Li,\n  and Boying Wu","authorsParsed":[["Ning","Jie",""],["Sun","Jiebao",""],["Shi","Shengzhu",""],["Guo","Zhichang",""],["Li","Yao",""],["Li","Hongwei",""],["Wu","Boying",""]],"versions":[{"version":"v1","created":"Sun, 8 Dec 2024 13:47:57 GMT"}],"updateDate":"2024-12-10","timestamp":1733665677000,"abstract":"  Deep learning-based image denoising models demonstrate remarkable\nperformance, but their lack of robustness analysis remains a significant\nconcern. A major issue is that these models are susceptible to adversarial\nattacks, where small, carefully crafted perturbations to input data can cause\nthem to fail. Surprisingly, perturbations specifically crafted for one model\ncan easily transfer across various models, including CNNs, Transformers,\nunfolding models, and plug-and-play models, leading to failures in those models\nas well. Such high adversarial transferability is not observed in\nclassification models. We analyze the possible underlying reasons behind the\nhigh adversarial transferability through a series of hypotheses and validation\nexperiments. By characterizing the manifolds of Gaussian noise and adversarial\nperturbations using the concept of typical set and the asymptotic equipartition\nproperty, we prove that adversarial samples deviate slightly from the typical\nset of the original input distribution, causing the models to fail. Based on\nthese insights, we propose a novel adversarial defense method: the\nOut-of-Distribution Typical Set Sampling Training strategy (TS). TS not only\nsignificantly enhances the model's robustness but also marginally improves\ndenoising performance compared to the original model.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"u_jJymQTtG7hhJKEQgAjgEOb2gndKvGwAIkCC02Ssp0","pdfSize":"6139462"}