{"id":"2412.11698","title":"On Large Language Models in Mission-Critical IT Governance: Are We Ready\n  Yet?","authors":"Matteo Esposito and Francesco Palagiano and Valentina Lenarduzzi and\n  Davide Taibi","authorsParsed":[["Esposito","Matteo",""],["Palagiano","Francesco",""],["Lenarduzzi","Valentina",""],["Taibi","Davide",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 12:21:05 GMT"},{"version":"v2","created":"Fri, 10 Jan 2025 13:35:37 GMT"}],"updateDate":"2025-01-13","timestamp":1734351665000,"abstract":"  Context. The security of critical infrastructure has been a pressing concern\nsince the advent of computers and has become even more critical in today's era\nof cyber warfare. Protecting mission-critical systems (MCSs), essential for\nnational security, requires swift and robust governance, yet recent events\nreveal the increasing difficulty of meeting these challenges. Aim. Building on\nprior research showcasing the potential of Generative AI (GAI), such as Large\nLanguage Models, in enhancing risk analysis, we aim to explore practitioners'\nviews on integrating GAI into the governance of IT MCSs. Our goal is to provide\nactionable insights and recommendations for stakeholders, including\nresearchers, practitioners, and policymakers. Method. We designed a survey to\ncollect practical experiences, concerns, and expectations of practitioners who\ndevelop and implement security solutions in the context of MCSs. Conclusions\nand Future Works. Our findings highlight that the safe use of LLMs in MCS\ngovernance requires interdisciplinary collaboration. Researchers should focus\non designing regulation-oriented models and focus on accountability;\npractitioners emphasize data protection and transparency, while policymakers\nmust establish a unified AI framework with global benchmarks to ensure ethical\nand secure LLMs-based MCS governance.\n","subjects":["Computer Science/Cryptography and Security","Computer Science/Artificial Intelligence","Computer Science/Emerging Technologies","Computer Science/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"2wSQbnPzluPYkxm6vNLol3eIkXJzguNX0HAoEOBA9O0","pdfSize":"216144"}