{"id":"2412.04957","title":"Ultrahigh-temperature ferromagnetism in ultrathin insulating films with\n  ripple-infinite-layer structure","authors":"Yazhuo Yi, Haoliang Huang, Ruiwen Shao, Yukuai Liu, Guangzheng Chen,\n  Jiahui Ou, Xi Zhang, Ze Hua, Lang Chen, Chi Wah Leung, Xie-Rong Zeng, Feng\n  Rao, Nan Liu, Heng Wang, Liang Si, Hongyu An, Zhuoyu Chen, Chuanwei Huang","authorsParsed":[["Yi","Yazhuo",""],["Huang","Haoliang",""],["Shao","Ruiwen",""],["Liu","Yukuai",""],["Chen","Guangzheng",""],["Ou","Jiahui",""],["Zhang","Xi",""],["Hua","Ze",""],["Chen","Lang",""],["Leung","Chi Wah",""],["Zeng","Xie-Rong",""],["Rao","Feng",""],["Liu","Nan",""],["Wang","Heng",""],["Si","Liang",""],["An","Hongyu",""],["Chen","Zhuoyu",""],["Huang","Chuanwei",""]],"versions":[{"version":"v1","created":"Fri, 6 Dec 2024 11:23:23 GMT"}],"updateDate":"2024-12-09","timestamp":1733484203000,"abstract":"  Ferromagnetism and electrical insulation are often at odds, signifying an\ninherent trade off. The simultaneous optimization of both in one material,\nessential for advancing spintronics and topological electronics, necessitates\nthe individual manipulation over various degrees of freedom of strongly\ncorrelated electrons. Here, by selective control of the spin exchange and\nCoulomb interactions, we report the achievement of SrFeO2 thin films with\nresistivity above 106 Ohm.cm and strong magnetization with Curie temperature\nextrapolated to be 1200 K. Robust ferromagnetism is obtained down to 1.0 nm\nthickness on substrate and 2.0 nm for freestanding films. Featuring an out of\nplane oriented ripple infinite layer structure, this ferromagnetic insulating\nphase is obtained through extensive reduction of as grown brownmillerite\nSrFeO2.5 films at high compressive strains. Pronounced spin Hall\nmagnetoresistance signals up to 0.0026 is further demonstrated with a Pt Hall\nbar device. Our findings promise emerging spintronic and topological electronic\nfunctionalities harnessing spin dynamics with minimized power dissipations.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Ad4o_i2FrELF-lUypYNGhh3sITApYzm17LPndWWuP-s","pdfSize":"880503"}