{"id":"2412.07749","title":"The Role of Electron Correlation Beyond the Active Space in Achieving\n  Quantitative Predictions of Spin-Phonon Relaxation","authors":"Soumi Haldar, Lorenzo A. Mariano, Alessandro Lunghi and Laura\n  Gagliardi","authorsParsed":[["Haldar","Soumi",""],["Mariano","Lorenzo A.",""],["Lunghi","Alessandro",""],["Gagliardi","Laura",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 18:48:41 GMT"}],"updateDate":"2024-12-11","timestamp":1733856521000,"abstract":"  Single-molecule magnets (SMMs) are promising candidates for molecular-scale\ndata storage and processing due to their strong magnetic anisotropy and long\nspin relaxation times. However, as temperature rises, interactions between\nelectronic states and lattice vibrations accelerate spin relaxation,\nsignificantly limiting their practical applications. Recently, ab initio\nsimulations have made it possible to advance our understanding of\nphonon-induced magnetic relaxation, but significant deviations from experiments\nhave often been observed. The description of molecules' electronic structure\nhas been mostly based on complete active space self-consistent field (CASSCF)\ncalculations, and the impact of electron correlation beyond the active space\nremains largely unexplored. In this study, we provide the first systematic\ninvestigation of spin-phonon relaxation in SMMs with post-CASSCF\nmulticonfigurational methods, specifically CAS followed by second-order\nperturbation theory and multiconfiguration pair-density functional theory.\nTaking Co(II)- and Dy(III)-based SMMs as case studies, we analyze how electron\ncorrelation influences spin-phonon relaxation rates across a range of\ntemperatures, comparing theoretical predictions with experimental observations.\nOur findings demonstrate that post-CASSCF treatments make it possible to\nachieve quantitative predictions for Co(II)-based SMMs. For Dy(III)-based\nsystems, however, accurate predictions require consideration of additional\neffects, underscoring the urgent necessity of further advancing the study of\nthe effects of electronic correlation in these complex systems.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ujHpphRbv8KzHfAtH6fHNA82B_WeBD9tX_1BCD_26U8","pdfSize":"3617260"}