{
  "id": "2412.01182",
  "title": "MeasureNet: Measurement Based Celiac Disease Identification",
  "authors": "Aayush Kumar Tyagi, Vaibhav Mishra, Ashok Tiwari, Lalita Mehra,\n  Prasenjit Das, Govind Makharia, Prathosh AP, Mausam",
  "authorsParsed": [
    [
      "Tyagi",
      "Aayush Kumar",
      ""
    ],
    [
      "Mishra",
      "Vaibhav",
      ""
    ],
    [
      "Tiwari",
      "Ashok",
      ""
    ],
    [
      "Mehra",
      "Lalita",
      ""
    ],
    [
      "Das",
      "Prasenjit",
      ""
    ],
    [
      "Makharia",
      "Govind",
      ""
    ],
    [
      "AP",
      "Prathosh",
      ""
    ],
    [
      "Mausam",
      "",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 06:40:16 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733121616000,
  "abstract": "  Celiac disease is an autoimmune disorder triggered by the consumption of\ngluten. It causes damage to the villi, the finger-like projections in the small\nintestine that are responsible for nutrient absorption. Additionally, the\ncrypts, which form the base of the villi, are also affected, impairing the\nregenerative process. The deterioration in villi length, computed as the\nvilli-to-crypt length ratio, indicates the severity of celiac disease. However,\nmanual measurement of villi-crypt length can be both time-consuming and\nsusceptible to inter-observer variability, leading to inconsistencies in\ndiagnosis. While some methods can perform measurement as a post-hoc process,\nthey are prone to errors in the initial stages. This gap underscores the need\nfor pathologically driven solutions that enhance measurement accuracy and\nreduce human error in celiac disease assessments.\n  Our proposed method, MeasureNet, is a pathologically driven polyline\ndetection framework incorporating polyline localization and object-driven\nlosses specifically designed for measurement tasks. Furthermore, we leverage\nsegmentation model to provide auxiliary guidance about crypt location when\ncrypt are partially visible. To ensure that model is not overdependent on\nsegmentation mask we enhance model robustness through a mask feature mixup\ntechnique. Additionally, we introduce a novel dataset for grading celiac\ndisease, consisting of 750 annotated duodenum biopsy images. MeasureNet\nachieves an 82.66% classification accuracy for binary classification and 81%\naccuracy for multi-class grading of celiac disease. Code:\nhttps://github.com/dair-iitd/MeasureNet\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "HfxYkJacgF1jclesIhrW3djOcOBpwddpQzxRkVS5Fmg",
  "pdfSize": "40269400"
}