{
  "id": "2412.09605",
  "title": "AgentTrek: Agent Trajectory Synthesis via Guiding Replay with Web\n  Tutorials",
  "authors": "Yiheng Xu, Dunjie Lu, Zhennan Shen, Junli Wang, Zekun Wang, Yuchen\n  Mao, Caiming Xiong, Tao Yu",
  "authorsParsed": [
    [
      "Xu",
      "Yiheng",
      ""
    ],
    [
      "Lu",
      "Dunjie",
      ""
    ],
    [
      "Shen",
      "Zhennan",
      ""
    ],
    [
      "Wang",
      "Junli",
      ""
    ],
    [
      "Wang",
      "Zekun",
      ""
    ],
    [
      "Mao",
      "Yuchen",
      ""
    ],
    [
      "Xiong",
      "Caiming",
      ""
    ],
    [
      "Yu",
      "Tao",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 18:59:27 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1734029967000,
  "abstract": "  Graphical User Interface (GUI) agents hold great potential for automating\ncomplex tasks across diverse digital environments, from web applications to\ndesktop software. However, the development of such agents is hindered by the\nlack of high-quality, multi-step trajectory data required for effective\ntraining. Existing approaches rely on expensive and labor-intensive human\nannotation, making them unsustainable at scale. To address this challenge, we\npropose AgentTrek, a scalable data synthesis pipeline that generates\nhigh-quality GUI agent trajectories by leveraging web tutorials. Our method\nautomatically gathers tutorial-like texts from the internet, transforms them\ninto task goals with step-by-step instructions, and employs a visual-language\nmodel agent to simulate their execution in a real digital environment. A\nVLM-based evaluator ensures the correctness of the generated trajectories. We\ndemonstrate that training GUI agents with these synthesized trajectories\nsignificantly improves their grounding and planning performance over the\ncurrent models. Moreover, our approach is more cost-efficient compared to\ntraditional human annotation methods. This work underscores the potential of\nguided replay with web tutorials as a viable strategy for large-scale GUI agent\ntraining, paving the way for more capable and autonomous digital agents.\n",
  "subjects": [
    "Computer Science/Computation and Language"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "8mH9QG__X6Vtg73tblGfyaTPmdzsyGSI5jiiGbZ1XgQ",
  "pdfSize": "4406938"
}