{"id":"2412.06540","title":"Sloth: scaling laws for LLM skills to predict multi-benchmark\n  performance across families","authors":"Felipe Maia Polo, Seamus Somerstep, Leshem Choshen, Yuekai Sun,\n  Mikhail Yurochkin","authorsParsed":[["Polo","Felipe Maia",""],["Somerstep","Seamus",""],["Choshen","Leshem",""],["Sun","Yuekai",""],["Yurochkin","Mikhail",""]],"versions":[{"version":"v1","created":"Mon, 9 Dec 2024 14:51:26 GMT"},{"version":"v2","created":"Mon, 23 Dec 2024 15:29:22 GMT"},{"version":"v3","created":"Wed, 25 Dec 2024 12:28:00 GMT"},{"version":"v4","created":"Wed, 5 Feb 2025 03:50:59 GMT"}],"updateDate":"2025-02-06","timestamp":1733755886000,"abstract":"  Scaling laws for large language models (LLMs) predict model performance based\non parameters like size and training data. However, differences in training\nconfigurations and data processing across model families lead to significant\nvariations in benchmark performance, making it difficult for a single scaling\nlaw to generalize across all LLMs. On the other hand, training family-specific\nscaling laws requires training models of varying sizes for every family. In\nthis work, we propose Skills Scaling Laws (SSLaws, pronounced as Sloth), a\nnovel scaling law that leverages publicly available benchmark data and assumes\nLLM performance is driven by low-dimensional latent skills, such as reasoning\nand instruction following. These latent skills are influenced by computational\nresources like model size and training tokens but with varying efficiencies\nacross model families. Sloth exploits correlations across benchmarks to provide\nmore accurate and interpretable predictions while alleviating the need to train\nmultiple LLMs per family. We present both theoretical results on parameter\nidentification and empirical evaluations on 12 prominent benchmarks, from Open\nLLM Leaderboard v1/v2, demonstrating that Sloth predicts LLM performance\nefficiently and offers insights into scaling behaviors for complex downstream\ntasks and increased test-time compute.\n","subjects":["Computer Science/Machine Learning","Computer Science/Artificial Intelligence","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"AzUPFvdo3m4fAiCDkX3VwwVYoGYiZ_LgM_lJeHh8sE0","pdfSize":"4013909"}