{
  "id": "2412.10131",
  "title": "RTFAST-Spectra: Emulation of X-ray reverberation mapping for active\n  galactic nuclei",
  "authors": "Benjamin Ricketts, Daniela Huppenkothen, Matteo Lucchini, Adam Ingram,\n  Guglielmo Mastroserio, Matthew Ho and Benjamin Wandelt",
  "authorsParsed": [
    [
      "Ricketts",
      "Benjamin",
      ""
    ],
    [
      "Huppenkothen",
      "Daniela",
      ""
    ],
    [
      "Lucchini",
      "Matteo",
      ""
    ],
    [
      "Ingram",
      "Adam",
      ""
    ],
    [
      "Mastroserio",
      "Guglielmo",
      ""
    ],
    [
      "Ho",
      "Matthew",
      ""
    ],
    [
      "Wandelt",
      "Benjamin",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 13:27:08 GMT"
    },
    {
      "version": "v2",
      "created": "Mon, 24 Feb 2025 10:52:37 GMT"
    }
  ],
  "updateDate": "2025-02-25",
  "timestamp": 1734096428000,
  "abstract": "  Bayesian analysis has begun to be more widely adopted in X-ray spectroscopy,\nbut it has largely been constrained to relatively simple physical models due to\nlimitations in X-ray modelling software and computation time. As a result,\nBayesian analysis of numerical models with high physics complexity have\nremained out of reach. This is a challenge, for example when modelling the\nX-ray emission of accreting black hole X-ray binaries, where the slow model\ncomputations severely limit explorations of parameter space and may bias the\ninference of astrophysical parameters. Here, we present RTFAST-Spectra: a\nneural network emulator that acts as a drop in replacement for the spectral\nportion of the black hole X-ray reverberation model RTDIST. This is the first\nemulator for the reltrans model suite and the first emulator for a\nstate-of-the-art x-ray reflection model incorporating relativistic effects with\n17 physically meaningful model parameters. We use Principal Component Analysis\nto create a light-weight neural network that is able to preserve correlations\nbetween complex atomic lines and simple continuum, enabling consistent\nmodelling of key parameters of scientific interest. We achieve a\n$\\mathcal{O}(10^2)$ times speed up over the original model in the most\nconservative conditions with $\\mathcal{O}(1\\%)$ precision over all 17 free\nparameters in the original numerical model, taking full posterior fits from\nmonths to hours. We employ Markov Chain Monte Carlo sampling to show how we can\nbetter explore the posteriors of model parameters in simulated data and discuss\nthe complexities in interpreting the model when fitting real data.\n",
  "subjects": [
    "Astrophysics/High Energy Astrophysical Phenomena",
    "Astrophysics/Instrumentation and Methods for Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "gV8b_uqJ9EyAKET1SnAJtyUfT-ORbHXRCDeW_GKbB0Q",
  "pdfSize": "6394379"
}