{
  "id": "2412.20573",
  "title": "The intrinsic motivation of reinforcement and imitation learning for\n  sequential tasks",
  "authors": "Sao Mai Nguyen",
  "authorsParsed": [
    [
      "Nguyen",
      "Sao Mai",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 29 Dec 2024 20:44:59 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735505099000,
  "abstract": "  This work in the field of developmental cognitive robotics aims to devise a\nnew domain bridging between reinforcement learning and imitation learning, with\na model of the intrinsic motivation for learning agents to learn with guidance\nfrom tutors multiple tasks, including sequential tasks. The main contribution\nhas been to propose a common formulation of intrinsic motivation based on\nempirical progress for a learning agent to choose automatically its learning\ncurriculum by actively choosing its learning strategy for simple or sequential\ntasks: which task to learn, between autonomous exploration or imitation\nlearning, between low-level actions or task decomposition, between several\ntutors. The originality is to design a learner that benefits not only passively\nfrom data provided by tutors, but to actively choose when to request tutoring\nand what and whom to ask. The learner is thus more robust to the quality of the\ntutoring and learns faster with fewer demonstrations. We developed the\nframework of socially guided intrinsic motivation with machine learning\nalgorithms to learn multiple tasks by taking advantage of the generalisability\nproperties of human demonstrations in a passive manner or in an active manner\nthrough requests of demonstrations from the best tutor for simple and composing\nsubtasks. The latter relies on a representation of subtask composition proposed\nfor a construction process, which should be refined by representations used for\nobservational processes of analysing human movements and activities of daily\nliving. With the outlook of a language-like communication with the tutor, we\ninvestigated the emergence of a symbolic representation of the continuous\nsensorimotor space and of tasks using intrinsic motivation. We proposed within\nthe reinforcement learning framework, a reward function for interacting with\ntutors for automatic curriculum learning in multi-task learning.\n",
  "subjects": [
    "Computer Science/Artificial Intelligence",
    "Computer Science/Human-Computer Interaction",
    "Computer Science/Machine Learning",
    "Computer Science/Robotics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "gFyehrJB8N85CubGRUcGVtJhpwKoj8K5IDiNaqNPUhw",
  "pdfSize": "7335764"
}