{
  "id": "2412.12443",
  "title": "Design and Performance Analysis of an Ultra-Low Power Integrate-and-Fire\n  Neuron Circuit Using Nanoscale Side-contacted Field Effect Diode Technology",
  "authors": "Seyedmohamadjavad Motaman, Sarah Sharif, Yaser Banad",
  "authorsParsed": [
    [
      "Motaman",
      "Seyedmohamadjavad",
      ""
    ],
    [
      "Sharif",
      "Sarah",
      ""
    ],
    [
      "Banad",
      "Yaser",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 01:12:23 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734397943000,
  "abstract": "  Enhancing power efficiency and performance in neuromorphic computing systems\nis critical for next-generation artificial intelligence applications. We\npropose the Nanoscale Side-contacted Field Effect Diode (S-FED), a novel\nsolution that significantly lowers power usage and improves circuit speed,\nfacilitating efficient neuron circuit design. Our innovative integrate-and-fire\n(IF) neuron model demonstrates exceptional performance metrics: 44 nW power\nconsumption (85% lower than current designs), 0.964 fJ energy per spike (36%\nimprovement over state-of-the-art), and 20 MHz spiking frequency. The\narchitecture exhibits robust stability across process-voltage-temperature (PVT)\nvariations, maintaining consistent performance with less than 7% spike\namplitude variation for channel lengths from 7.5nm to 15nm, supply voltages\nfrom 0.8V to 1.2V, and temperatures from -40{\\deg}C to 120{\\deg}C. The model\nfeatures tunable thresholds from 0.8V to 1.4V and reliable operation across\ninput spike pulse widths from 0.5 ns to 2 ns. This significant advancement in\nneuromorphic hardware paves the way for more efficient brain-inspired computing\nsystems.\n",
  "subjects": [
    "Computer Science/Hardware Architecture"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "hBCy8Ds0wcxHJOVTKKMSfObQeUx5vCqxGV6Dxi8JxAM",
  "pdfSize": "1369248"
}