{"id":"2412.01187","title":"Distributionally Robust Power Policies for Wireless Systems under Power\n  Fluctuation Risk","authors":"Gokberk Yaylali, Dionysios S. Kalogerias","authorsParsed":[["Yaylali","Gokberk",""],["Kalogerias","Dionysios S.",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 06:46:28 GMT"}],"updateDate":"2024-12-03","timestamp":1733121988000,"abstract":"  Modern wireless communication systems necessitate the development of\ncost-effective resource allocation strategies, while ensuring maximal system\nperformance. While commonly realizable via efficient waterfilling schemes,\nergodic-optimal policies often exhibit instantaneous resource constraint\nfluctuations as a result of fading variability, violating prescribed\nspecifications possibly within unacceptable margins, inducing further\noperational challenges and/or costs. On the other extent, short-term-optimal\npolicies -- commonly based on deterministic waterfilling-- while strictly\nmaintaining operational specifications, are not only impractical and\ncomputationally demanding, but also suboptimal in a long-term sense. To address\nthese challenges, we introduce a novel distributionally robust version of a\nclassical point-to-point interference-free multi-terminal constrained\nstochastic resource allocation problem, by leveraging the Conditional\nValue-at-Risk (CVaR) as a coherent measure of power policy fluctuation risk. We\nderive closed-form dual-parameterized expressions for the CVaR-optimal resource\npolicy, along with corresponding optimal CVaR quantile levels by capitalizing\non (sampling) the underlying fading distribution. We subsequently develop two\ndual-domain schemes -- one model-based and one model-free -- to iteratively\ndetermine a globally-optimal resource policy. Our numerical simulations confirm\nthe remarkable effectiveness of the proposed approach, also revealing an\nalmost-constant character of the CVaR-optimal policy and at rather minimal\nergodic rate optimality loss.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"kQFSFJi5pUfpUlHDu4Sc1bcqMAMRIH2VKxHiu31F8G4","pdfSize":"829381"}