{
  "id": "2412.16266",
  "title": "Learned Compression of Nonlinear Time Series With Random Access",
  "authors": "Andrea Guerra, Giorgio Vinciguerra, Antonio Boffa, Paolo Ferragina",
  "authorsParsed": [
    [
      "Guerra",
      "Andrea",
      ""
    ],
    [
      "Vinciguerra",
      "Giorgio",
      ""
    ],
    [
      "Boffa",
      "Antonio",
      ""
    ],
    [
      "Ferragina",
      "Paolo",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 10:30:06 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734690606000,
  "abstract": "  Time series play a crucial role in many fields, including finance,\nhealthcare, industry, and environmental monitoring. The storage and retrieval\nof time series can be challenging due to their unstoppable growth. In fact,\nthese applications often sacrifice precious historical data to make room for\nnew data.\n  General-purpose compressors can mitigate this problem with their good\ncompression ratios, but they lack efficient random access on compressed data,\nthus preventing real-time analyses. Ad-hoc streaming solutions, instead,\ntypically optimise only for compression and decompression speed, while giving\nup compression effectiveness and random access functionality. Furthermore, all\nthese methods lack awareness of certain special regularities of time series,\nwhose trends over time can often be described by some linear and nonlinear\nfunctions.\n  To address these issues, we introduce NeaTS, a randomly-accessible\ncompression scheme that approximates the time series with a sequence of\nnonlinear functions of different kinds and shapes, carefully selected and\nplaced by a partitioning algorithm to minimise the space. The approximation\nresiduals are bounded, which allows storing them in little space and thus\nrecovering the original data losslessly, or simply discarding them to obtain a\nlossy time series representation with maximum error guarantees.\n  Our experiments show that NeaTS improves the compression ratio of the\nstate-of-the-art lossy compressors that use linear or nonlinear functions (or\nboth) by up to 14%. Compared to lossless compressors, NeaTS emerges as the only\napproach to date providing, simultaneously, compression ratios close to or\nbetter than the best existing compressors, a much faster decompression speed,\nand orders of magnitude more efficient random access, thus enabling the storage\nand real-time analysis of massive and ever-growing amounts of (historical) time\nseries data.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Databases",
    "Computer Science/Information Retrieval"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "ufkx4z6Gh2GZ1bT7aKlOl3vgPRQ0l9cZD4UYWUBckI0",
  "pdfSize": "1194916"
}