{
  "id": "2412.12143",
  "title": "Harnessing Transfer Learning from Swahili: Advancing Solutions for\n  Comorian Dialects",
  "authors": "Naira Abdou Mohamed, Zakarya Erraji, Abdessalam Bahafid and Imade\n  Benelallam",
  "authorsParsed": [
    [
      "Mohamed",
      "Naira Abdou",
      ""
    ],
    [
      "Erraji",
      "Zakarya",
      ""
    ],
    [
      "Bahafid",
      "Abdessalam",
      ""
    ],
    [
      "Benelallam",
      "Imade",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 22:47:41 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1733784461000,
  "abstract": "  If today some African languages like Swahili have enough resources to develop\nhigh-performing Natural Language Processing (NLP) systems, many other languages\nspoken on the continent are still lacking such support. For these languages,\nstill in their infancy, several possibilities exist to address this critical\nlack of data. Among them is Transfer Learning, which allows low-resource\nlanguages to benefit from the good representation of other languages that are\nsimilar to them. In this work, we adopt a similar approach, aiming to pioneer\nNLP technologies for Comorian, a group of four languages or dialects belonging\nto the Bantu family.\n  Our approach is initially motivated by the hypothesis that if a human can\nunderstand a different language from their native language with little or no\neffort, it would be entirely possible to model this process on a machine. To\nachieve this, we consider ways to construct Comorian datasets mixed with\nSwahili. One thing to note here is that in terms of Swahili data, we only focus\non elements that are closest to Comorian by calculating lexical distances\nbetween candidate and source data. We empirically test this hypothesis in two\nuse cases: Automatic Speech Recognition (ASR) and Machine Translation (MT). Our\nMT model achieved ROUGE-1, ROUGE-2, and ROUGE-L scores of 0.6826, 0.42, and\n0.6532, respectively, while our ASR system recorded a WER of 39.50\\% and a CER\nof 13.76\\%. This research is crucial for advancing NLP in underrepresented\nlanguages, with potential to preserve and promote Comorian linguistic heritage\nin the digital age.\n",
  "subjects": [
    "Computer Science/Computation and Language",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "UIC4hH_2l9D_-IH4hje12c5yW0Wkjkw2fR5FpnYcqjM",
  "pdfSize": "489128"
}