{"id":"2412.11087","title":"Leveraging Large Vision-Language Model as User Intent-aware Encoder for\n  Composed Image Retrieval","authors":"Zelong Sun, Dong Jing, Guoxing Yang, Nanyi Fei, Zhiwu Lu","authorsParsed":[["Sun","Zelong",""],["Jing","Dong",""],["Yang","Guoxing",""],["Fei","Nanyi",""],["Lu","Zhiwu",""]],"versions":[{"version":"v1","created":"Sun, 15 Dec 2024 07:09:02 GMT"}],"updateDate":"2024-12-17","timestamp":1734246542000,"abstract":"  Composed Image Retrieval (CIR) aims to retrieve target images from candidate\nset using a hybrid-modality query consisting of a reference image and a\nrelative caption that describes the user intent. Recent studies attempt to\nutilize Vision-Language Pre-training Models (VLPMs) with various fusion\nstrategies for addressing the task.However, these methods typically fail to\nsimultaneously meet two key requirements of CIR: comprehensively extracting\nvisual information and faithfully following the user intent. In this work, we\npropose CIR-LVLM, a novel framework that leverages the large vision-language\nmodel (LVLM) as the powerful user intent-aware encoder to better meet these\nrequirements. Our motivation is to explore the advanced reasoning and\ninstruction-following capabilities of LVLM for accurately understanding and\nresponding the user intent. Furthermore, we design a novel hybrid intent\ninstruction module to provide explicit intent guidance at two levels: (1) The\ntask prompt clarifies the task requirement and assists the model in discerning\nuser intent at the task level. (2) The instance-specific soft prompt, which is\nadaptively selected from the learnable prompt pool, enables the model to better\ncomprehend the user intent at the instance level compared to a universal prompt\nfor all instances. CIR-LVLM achieves state-of-the-art performance across three\nprominent benchmarks with acceptable inference efficiency. We believe this\nstudy provides fundamental insights into CIR-related fields.\n","subjects":["Computer Science/Information Retrieval"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"5HXmg6K5rqe4ypjorggPIi_mrCqBWa2-t3atY9lyPbw","pdfSize":"9915091"}