{
  "id": "2412.20390",
  "title": "MetricDepth: Enhancing Monocular Depth Estimation with Deep Metric\n  Learning",
  "authors": "Chunpu Liu, Guanglei Yang, Wangmeng Zuo, Tianyi Zan",
  "authorsParsed": [
    [
      "Liu",
      "Chunpu",
      ""
    ],
    [
      "Yang",
      "Guanglei",
      ""
    ],
    [
      "Zuo",
      "Wangmeng",
      ""
    ],
    [
      "Zan",
      "Tianyi",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 29 Dec 2024 07:57:12 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735459032000,
  "abstract": "  Deep metric learning aims to learn features relying on the consistency or\ndivergence of class labels. However, in monocular depth estimation, the absence\nof a natural definition of class poses challenges in the leveraging of deep\nmetric learning. Addressing this gap, this paper introduces MetricDepth, a\nnovel method that integrates deep metric learning to enhance the performance of\nmonocular depth estimation. To overcome the inapplicability of the class-based\nsample identification in previous deep metric learning methods to monocular\ndepth estimation task, we design the differential-based sample identification.\nThis innovative approach identifies feature samples as different sample types\nby their depth differentials relative to anchor, laying a foundation for\nfeature regularizing in monocular depth estimation models. Building upon this\nadvancement, we then address another critical problem caused by the vast range\nand the continuity of depth annotations in monocular depth estimation. The\nextensive and continuous annotations lead to the diverse differentials of\nnegative samples to anchor feature, representing the varied impact of negative\nsamples during feature regularizing. Recognizing the inadequacy of the uniform\nstrategy in previous deep metric learning methods for handling negative samples\nin monocular depth estimation task, we propose the multi-range strategy.\nThrough further distinction on negative samples according to depth differential\nranges and implementation of diverse regularizing, our multi-range strategy\nfacilitates differentiated regularization interactions between anchor feature\nand its negative samples. Experiments across various datasets and model types\ndemonstrate the effectiveness and versatility of MetricDepth,confirming its\npotential for performance enhancement in monocular depth estimation task.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "mY1kRYPrkM30Rya54nqXH0kf56gPSqsar8ILpppv9Xw",
  "pdfSize": "16849234"
}