{"id":"2412.18535","title":"Graph Structure Learning for Spatial-Temporal Imputation: Adapting to\n  Node and Feature Scales","authors":"Xinyu Yang, Yu Sun, Xinyang Chen, Ying Zhang, Xiaojie Yuan","authorsParsed":[["Yang","Xinyu",""],["Sun","Yu",""],["Chen","Xinyang",""],["Zhang","Ying",""],["Yuan","Xiaojie",""]],"versions":[{"version":"v1","created":"Tue, 24 Dec 2024 16:34:50 GMT"},{"version":"v2","created":"Sun, 5 Jan 2025 14:30:45 GMT"}],"updateDate":"2025-01-07","timestamp":1735058090000,"abstract":"  Spatial-temporal data collected across different geographic locations often\nsuffer from missing values, posing challenges to data analysis. Existing\nmethods primarily leverage fixed spatial graphs to impute missing values, which\nimplicitly assume that the spatial relationship is roughly the same for all\nfeatures across different locations. However, they may overlook the different\nspatial relationships of diverse features recorded by sensors in different\nlocations. To address this, we introduce the multi-scale Graph Structure\nLearning framework for spatial-temporal Imputation (GSLI) that dynamically\nadapts to the heterogeneous spatial correlations. Our framework encompasses\nnode-scale graph structure learning to cater to the distinct global spatial\ncorrelations of different features, and feature-scale graph structure learning\nto unveil common spatial correlation across features within all stations.\nIntegrated with prominence modeling, our framework emphasizes nodes and\nfeatures with greater significance in the imputation process. Furthermore, GSLI\nincorporates cross-feature and cross-temporal representation learning to\ncapture spatial-temporal dependencies. Evaluated on six real incomplete\nspatial-temporal datasets, GSLI showcases the improvement in data imputation.\n","subjects":["Computer Science/Machine Learning","Computer Science/Databases"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"qaqveBhBryICBhrnbzq3i1i-1qCfqltRSSRHI2UxRZk","pdfSize":"1911980"}