{
  "id": "2412.02026",
  "title": "Comparing Clustering Approaches for Smart Meter Time Series:\n  Investigating the Influence of Dataset Properties on Performance",
  "authors": "Luke W. Yerbury, Ricardo J. G. B. Campello, G. C. Livingston Jr, Mark\n  Goldsworthy, Lachlan O'Neil",
  "authorsParsed": [
    [
      "Yerbury",
      "Luke W.",
      ""
    ],
    [
      "Campello",
      "Ricardo J. G. B.",
      ""
    ],
    [
      "Livingston",
      "G. C.",
      "Jr"
    ],
    [
      "Goldsworthy",
      "Mark",
      ""
    ],
    [
      "O'Neil",
      "Lachlan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 23:13:20 GMT"
    },
    {
      "version": "v2",
      "created": "Fri, 31 Jan 2025 03:11:59 GMT"
    }
  ],
  "updateDate": "2025-02-03",
  "timestamp": 1733181200000,
  "abstract": "  The widespread adoption of smart meters for monitoring energy consumption has\ngenerated vast quantities of high-resolution time series data which remains\nunderutilised. While clustering has emerged as a fundamental tool for mining\nsmart meter time series (SMTS) data, selecting appropriate clustering methods\nremains challenging despite numerous comparative studies. These studies often\nrely on problematic methodologies and consider a limited scope of methods,\nfrequently overlooking compelling methods from the broader time series\nclustering literature. Consequently, they struggle to provide dependable\nguidance for practitioners designing their own clustering approaches. This\npaper presents a comprehensive comparative framework for SMTS clustering\nmethods using expert-informed synthetic datasets that emphasise peak\nconsumption behaviours as fundamental cluster concepts. Using a phased\nmethodology, we first evaluated 31 distance measures and 8 representation\nmethods using leave-one-out classification, then examined the better-suited\nmethods in combination with 11 clustering algorithms. We further assessed the\nrobustness of these combinations to systematic changes in key dataset\nproperties that affect clustering performance on real-world datasets, including\ncluster balance, noise, and the presence of outliers. Our results revealed that\nmethods accommodating local temporal shifts while maintaining amplitude\nsensitivity, particularly Dynamic Time Warping and $k$-sliding distance,\nconsistently outperformed traditional approaches. Among other key findings, we\nidentified that when combined with hierarchical clustering using Ward's\nlinkage, these methods demonstrated consistent robustness across varying\ndataset characteristics without careful parameter tuning. These and other\nfindings inform actionable recommendations for practitioners.\n",
  "subjects": [
    "Statistics/Applications"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "nljKx1Luiwmx2CENQV5j-o_Eo1rrCqClcxsOED-OsUA",
  "pdfSize": "11790838"
}