{
  "id": "2412.14827",
  "title": "The J-PLUS collaboration. Additive versus multiplicative systematics in\n  surveys of the large scale structure of the Universe",
  "authors": "C. Hern\\'andez-Monteagudo (IAC/ULL), G. Aric\\`o, J. Chaves-Montero, L.\n  R. Abramo, P. Arnalte-Mur, A. Hern\\'an-Caballero, C. L\\'opez-Sanjuan, V.\n  Marra, R. von Marttens, E. Tempel, J. Cenarro, D. Crist\\'obal-Hornillos, A.\n  Mar\\'in-Franch, M. Moles, J. Varela, H. V\\'azquez Rami\\'o, J. Alcaniz, R.\n  Dupke, A. Ederoclite, L. Sodr\\'e Jr., R. E. Angulo",
  "authorsParsed": [
    [
      "Hernández-Monteagudo",
      "C.",
      "",
      "IAC/ULL"
    ],
    [
      "Aricò",
      "G.",
      ""
    ],
    [
      "Chaves-Montero",
      "J.",
      ""
    ],
    [
      "Abramo",
      "L. R.",
      ""
    ],
    [
      "Arnalte-Mur",
      "P.",
      ""
    ],
    [
      "Hernán-Caballero",
      "A.",
      ""
    ],
    [
      "López-Sanjuan",
      "C.",
      ""
    ],
    [
      "Marra",
      "V.",
      ""
    ],
    [
      "von Marttens",
      "R.",
      ""
    ],
    [
      "Tempel",
      "E.",
      ""
    ],
    [
      "Cenarro",
      "J.",
      ""
    ],
    [
      "Cristóbal-Hornillos",
      "D.",
      ""
    ],
    [
      "Marín-Franch",
      "A.",
      ""
    ],
    [
      "Moles",
      "M.",
      ""
    ],
    [
      "Varela",
      "J.",
      ""
    ],
    [
      "Ramió",
      "H. Vázquez",
      ""
    ],
    [
      "Alcaniz",
      "J.",
      ""
    ],
    [
      "Dupke",
      "R.",
      ""
    ],
    [
      "Ederoclite",
      "A.",
      ""
    ],
    [
      "Sodré",
      "L.",
      "Jr."
    ],
    [
      "Angulo",
      "R. E.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 13:17:17 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734614237000,
  "abstract": "  Observational and/or astrophysical systematics modulating the observed number\nof luminous tracers can constitute a major limitation in the cosmological\nexploitation of surveys of the large scale structure of the universe. Part of\nthis limitation arises on top of our ignorance on how such systematics actually\nimpact the observed galaxy/quasar fields. In this work we develop a generic,\nhybrid model for an arbitrary number of systematics that may modulate\nobservations in both an additive and a multiplicative way. This model allows us\ndevising a novel algorithm that addresses the identification and correction for\neither additive and/or multiplicative contaminants. We test this model on\ngalaxy mocks and systematics templates inspired from data of the third data\nrelease of the {\\it Javalambre Photometric Local Universe Survey} (J-PLUS). We\nfind that our method clearly outperforms standard methods that assume either an\nadditive or multiplicative character for all contaminants in scenarios where\nboth characters are actually acting on the observed data. In simpler scenarios\nwhere only an additive or multiplicative imprint on observations is considered,\nour hybrid method does not lie far behind the corresponding simplified,\nadditive/multiplicative methods. Nonetheless, in scenarios of mild/low impact\nof systematics, we find that our hybrid approach converges towards the standard\nmethod that assumes additive contamination, as predicted by our model\ndescribing systematics. Our methodology also allows for the estimation of\nbiases induced by systematics residuals on different angular scales and under\ndifferent observational configurations, although these predictions necessarily\nrestrict to the subset of {\\em known/identified} potential systematics, and say\nnothing about ``unknown unknowns\" possibly impacting the data.\n",
  "subjects": [
    "Astrophysics/Cosmology and Nongalactic Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "HJLCOpcG05gV3vfE153JrhEjFWohmIgBkEQ6aurw_BU",
  "pdfSize": "5109052"
}