{
  "id": "2412.16358",
  "title": "Texture- and Shape-based Adversarial Attacks for Vehicle Detection in\n  Synthetic Overhead Imagery",
  "authors": "Mikael Yeghiazaryan, Sai Abhishek Siddhartha Namburu, Emily Kim,\n  Stanislav Panev, Celso de Melo, Brent Lance, Fernando De la Torre, Jessica K.\n  Hodgins",
  "authorsParsed": [
    [
      "Yeghiazaryan",
      "Mikael",
      ""
    ],
    [
      "Namburu",
      "Sai Abhishek Siddhartha",
      ""
    ],
    [
      "Kim",
      "Emily",
      ""
    ],
    [
      "Panev",
      "Stanislav",
      ""
    ],
    [
      "de Melo",
      "Celso",
      ""
    ],
    [
      "Lance",
      "Brent",
      ""
    ],
    [
      "De la Torre",
      "Fernando",
      ""
    ],
    [
      "Hodgins",
      "Jessica K.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 21:39:20 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734730760000,
  "abstract": "  Detecting vehicles in aerial images can be very challenging due to complex\nbackgrounds, small resolution, shadows, and occlusions. Despite the\neffectiveness of SOTA detectors such as YOLO, they remain vulnerable to\nadversarial attacks (AAs), compromising their reliability. Traditional AA\nstrategies often overlook the practical constraints of physical implementation,\nfocusing solely on attack performance. Our work addresses this issue by\nproposing practical implementation constraints for AA in texture and/or shape.\nThese constraints include pixelation, masking, limiting the color palette of\nthe textures, and constraining the shape modifications. We evaluated the\nproposed constraints through extensive experiments using three widely used\nobject detector architectures, and compared them to previous works. The results\ndemonstrate the effectiveness of our solutions and reveal a trade-off between\npracticality and performance. Additionally, we introduce a labeled dataset of\noverhead images featuring vehicles of various categories. We will make the\ncode/dataset public upon paper acceptance.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "e4CzrLhfkAZI2cX3DTAxJJoq-jlo_kp0ZuvxszxryWA",
  "pdfSize": "8816775"
}