{"id":"2412.02380","title":"Use of surrogate endpoints in health technology assessment: a review of\n  selected NICE technology appraisals in oncology","authors":"Lorna Wheaton and Sylwia Bujkiewicz","authorsParsed":[["Wheaton","Lorna",""],["Bujkiewicz","Sylwia",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 11:05:13 GMT"},{"version":"v2","created":"Fri, 13 Dec 2024 15:17:38 GMT"}],"updateDate":"2025-02-26","timestamp":1733223913000,"abstract":"  Objectives: Surrogate endpoints, used to substitute for and predict final\nclinical outcomes, are increasingly being used to support submissions to health\ntechnology assessment agencies. The increase in use of surrogate endpoints has\nbeen accompanied by literature describing frameworks and statistical methods to\nensure their robust validation. The aim of this review was to assess how\nsurrogate endpoints have recently been used in oncology technology appraisals\nby the National Institute for Health and Care Excellence (NICE) in England and\nWales.\n  Methods: This paper identified technology appraisals in oncology published by\nNICE between February 2022 and May 2023. Data are extracted on methods for the\nuse and validation of surrogate endpoints.\n  Results: Of the 47 technology appraisals in oncology available for review, 18\n(38 percent) utilised surrogate endpoints, with 37 separate surrogate endpoints\nbeing discussed. However, the evidence supporting the validity of the surrogate\nrelationship varied significantly across putative surrogate relationships with\n11 providing RCT evidence, 7 providing evidence from observational studies, 12\nbased on clinical opinion and 7 providing no evidence for the use of surrogate\nendpoints.\n  Conclusions: This review supports the assertion that surrogate endpoints are\nfrequently used in oncology technology appraisals in England and Wales. Despite\nincreasing availability of statistical methods and guidance on appropriate\nvalidation of surrogate endpoints, this review highlights that use and\nvalidation of surrogate endpoints can vary between technology appraisals which\ncan lead to uncertainty in decision-making.\n","subjects":["Statistics/Applications","Economics/Econometrics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0KoI7K9mjNY4mYCa9s72W3CStnIBpBRiWxpQTKsNva4","pdfSize":"227555"}