{
  "id": "2412.05993",
  "title": "Network Slicing with Flexible VNF Order: A Branch-and-Bound Approach",
  "authors": "Quang-Trung Luu, Minh-Thanh Nguyen, Tuan-Anh Do, Michel Kieffer,\n  Van-Dinh Nguyen, Tai-Hung Nguyen, Huu-Thanh Nguyen",
  "authorsParsed": [
    [
      "Luu",
      "Quang-Trung",
      ""
    ],
    [
      "Nguyen",
      "Minh-Thanh",
      ""
    ],
    [
      "Do",
      "Tuan-Anh",
      ""
    ],
    [
      "Kieffer",
      "Michel",
      ""
    ],
    [
      "Nguyen",
      "Van-Dinh",
      ""
    ],
    [
      "Nguyen",
      "Tai-Hung",
      ""
    ],
    [
      "Nguyen",
      "Huu-Thanh",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 8 Dec 2024 16:57:55 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733677075000,
  "abstract": "  Network slicing is a critical feature in 5G and beyond communication systems,\nenabling the creation of multiple virtual networks (i.e., slices) on a shared\nphysical network infrastructure. This involves efficiently mapping each slice\ncomponent, including virtual network functions (VNFs) and their\ninterconnections (virtual links), onto the physical network.\n  This paper considers slice embedding problem in which the order of VNFs can\nbe adjusted, providing increased flexibility for service deployment on the\ninfrastructure. This also complicates embedding, as the best order has to be\nselected. We propose an innovative optimization framework to tackle the\nchallenges of jointly optimizing slice admission control and embedding with\nflexible VNF ordering. Additionally, we introduce a near-optimal\nbranch-and-bound (BnB) algorithm, combined with the A* search algorithm, to\ngenerate embedding solutions efficiently. Extensive simulations on both small\nand large-scale scenarios demonstrate that flexible VNF ordering significantly\nincreases the number of deployable slices within the network infrastructure,\nthereby improving resource utilization and meeting diverse demands across\nvaried network topologies.\n",
  "subjects": [
    "Computer Science/Networking and Internet Architecture"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "5lUuUvmr5VXtLAgQQNa1BBqe0n11UiAH749FCTrdCVM",
  "pdfSize": "1947258"
}