{"id":"2412.13840","title":"Unleashing the Power of Continual Learning on Non-Centralized Devices: A\n  Survey","authors":"Yichen Li, Haozhao Wang, Wenchao Xu, Tianzhe Xiao, Hong Liu, Minzhu\n  Tu, Yuying Wang, Xin Yang, Rui Zhang, Shui Yu, Song Guo, Ruixuan Li","authorsParsed":[["Li","Yichen",""],["Wang","Haozhao",""],["Xu","Wenchao",""],["Xiao","Tianzhe",""],["Liu","Hong",""],["Tu","Minzhu",""],["Wang","Yuying",""],["Yang","Xin",""],["Zhang","Rui",""],["Yu","Shui",""],["Guo","Song",""],["Li","Ruixuan",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 13:33:28 GMT"}],"updateDate":"2024-12-19","timestamp":1734528808000,"abstract":"  Non-Centralized Continual Learning (NCCL) has become an emerging paradigm for\nenabling distributed devices such as vehicles and servers to handle streaming\ndata from a joint non-stationary environment. To achieve high reliability and\nscalability in deploying this paradigm in distributed systems, it is essential\nto conquer challenges stemming from both spatial and temporal dimensions,\nmanifesting as distribution shifts, catastrophic forgetting, heterogeneity, and\nprivacy issues. This survey focuses on a comprehensive examination of the\ndevelopment of the non-centralized continual learning algorithms and the\nreal-world deployment across distributed devices. We begin with an introduction\nto the background and fundamentals of non-centralized learning and continual\nlearning. Then, we review existing solutions from three levels to represent how\nexisting techniques alleviate the catastrophic forgetting and distribution\nshift. Additionally, we delve into the various types of heterogeneity issues,\nsecurity, and privacy attributes, as well as real-world applications across\nthree prevalent scenarios. Furthermore, we establish a large-scale benchmark to\nrevisit this problem and analyze the performance of the state-of-the-art NCCL\napproaches. Finally, we discuss the important challenges and future research\ndirections in NCCL.\n","subjects":["Computer Science/Machine Learning","Computer Science/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Fh4e0HxBCxCun7z-OVDxHVQE1esBV4bYDIAfFNEP8Bc","pdfSize":"2570040"}