{
  "id": "2412.12220",
  "title": "Relieving Universal Label Noise for Unsupervised Visible-Infrared Person\n  Re-Identification by Inferring from Neighbors",
  "authors": "Xiao Teng, Long Lan, Dingyao Chen, Kele Xu, Nan Yin",
  "authorsParsed": [
    [
      "Teng",
      "Xiao",
      ""
    ],
    [
      "Lan",
      "Long",
      ""
    ],
    [
      "Chen",
      "Dingyao",
      ""
    ],
    [
      "Xu",
      "Kele",
      ""
    ],
    [
      "Yin",
      "Nan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 04:04:41 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734321881000,
  "abstract": "  Unsupervised visible-infrared person re-identification (USL-VI-ReID) is of\ngreat research and practical significance yet remains challenging due to the\nabsence of annotations. Existing approaches aim to learn modality-invariant\nrepresentations in an unsupervised setting. However, these methods often\nencounter label noise within and across modalities due to suboptimal clustering\nresults and considerable modality discrepancies, which impedes effective\ntraining. To address these challenges, we propose a straightforward yet\neffective solution for USL-VI-ReID by mitigating universal label noise using\nneighbor information. Specifically, we introduce the Neighbor-guided Universal\nLabel Calibration (N-ULC) module, which replaces explicit hard pseudo labels in\nboth homogeneous and heterogeneous spaces with soft labels derived from\nneighboring samples to reduce label noise. Additionally, we present the\nNeighbor-guided Dynamic Weighting (N-DW) module to enhance training stability\nby minimizing the influence of unreliable samples. Extensive experiments on the\nRegDB and SYSU-MM01 datasets demonstrate that our method outperforms existing\nUSL-VI-ReID approaches, despite its simplicity. The source code is available\nat: https://github.com/tengxiao14/Neighbor-guided-USL-VI-ReID.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "69ARF3KLKiJTquGmNFIA1lz9OXflRP9NiR0g7Iuj2sQ",
  "pdfSize": "1667935"
}