{"id":"2412.08649","title":"Multi-modal Representation Learning Enables Accurate Protein Function\n  Prediction in Low-Data Setting","authors":"Serb\\\"ulent \\\"Unsal (1 and 2), Sinem \\\"Ozdemir (1), B\\\"unyamin Kasap\n  (3), M. Er\\c{s}an Kalayc{\\i} (1), Kemal Turhan (1), Tunca Do\\u{g}an (4 and 5)\n  and Aybar C. Acar (2) ((1) Department of Biostatistics and Medical\n  Informatics, Faculty of Medicine, Graduate School of Health Sciences,\n  Karadeniz Technical University, Trabzon, T\\\"urkiye, (2) Cancer Systems\n  Biology Laboratory (KanSiL), Graduate School of Informatics, Middle East\n  Technical University, Ankara, T\\\"urkiye, (3) Health Sciences University\n  Trabzon Kanuni Training and Research Hospital, Medical Microbiology\n  Laboratory, Trabzon, T\\\"urkiye, (4) Biological Data Science Lab, Dept. of\n  Computer Engineering, Department of Computer Engineering, Hacettepe\n  University, Ankara, T\\\"urkiye, (5) Dept. of Bioinformatics, Graduate School\n  of Health Sciences, Hacettepe University, Ankara, T\\\"urkiye)","authorsParsed":[["Ünsal","Serbülent","","1 and 2"],["Özdemir","Sinem","","4 and 5"],["Kasap","Bünyamin","","4 and 5"],["Kalaycı","M. Erşan","","4 and 5"],["Turhan","Kemal","","4 and 5"],["Doğan","Tunca","","4 and 5"],["Acar","Aybar C.",""]],"versions":[{"version":"v1","created":"Fri, 22 Nov 2024 20:13:55 GMT"}],"updateDate":"2024-12-18","timestamp":1732306435000,"abstract":"  In this study, we propose HOPER (HOlistic ProtEin Representation), a novel\nmultimodal learning framework designed to enhance protein function prediction\n(PFP) in low-data settings. The challenge of predicting protein functions is\ncompounded by the limited availability of labeled data. Traditional machine\nlearning models already struggle in such cases, and while deep learning models\nexcel with abundant data, they also face difficulties when data is scarce.\nHOPER addresses this issue by integrating three distinct modalities - protein\nsequences, biomedical text, and protein-protein interaction (PPI) networks - to\ncreate a comprehensive protein representation. The model utilizes autoencoders\nto generate holistic embeddings, which are then employed for PFP tasks using\ntransfer learning. HOPER outperforms existing methods on a benchmark dataset\nacross all Gene Ontology categories, i.e., molecular function, biological\nprocess, and cellular component. Additionally, we demonstrate its practical\nutility by identifying new immune-escape proteins in lung adenocarcinoma,\noffering insights into potential therapeutic targets. Our results highlight the\neffectiveness of multimodal representation learning for overcoming data\nlimitations in biological research, potentially enabling more accurate and\nscalable protein function prediction. HOPER source code and datasets are\navailable at https://github.com/kansil/HOPER\n","subjects":["Quantitative Biology/Biomolecules","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"phkqba4cvAiS13VZ7fFGfyL_uZrS-mfIKoUDoPNJ6T0","pdfSize":"8016834"}