{
  "id": "2412.11321",
  "title": "X-ray properties of coronal emission in radio quiet Active Galactic\n  Nuclei",
  "authors": "Sibasish Laha (NASA-GSFC), Claudio Ricci, John C. Mather, Ehud Behar,\n  Luigi C. Gallo, Frederic Marin, Rostom Mbarek and Amelia Hankla",
  "authorsParsed": [
    [
      "Laha",
      "Sibasish",
      "",
      "NASA-GSFC"
    ],
    [
      "Ricci",
      "Claudio",
      ""
    ],
    [
      "Mather",
      "John C.",
      ""
    ],
    [
      "Behar",
      "Ehud",
      ""
    ],
    [
      "Gallo",
      "Luigi C.",
      ""
    ],
    [
      "Marin",
      "Frederic",
      ""
    ],
    [
      "Mbarek",
      "Rostom",
      ""
    ],
    [
      "Hankla",
      "Amelia",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 15 Dec 2024 21:39:03 GMT"
    },
    {
      "version": "v2",
      "created": "Fri, 20 Dec 2024 19:23:08 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734298743000,
  "abstract": "  Active galactic nuclei (AGN) are powerful sources of panchromatic radiation.\nAll AGN emit in X-rays, contributing around $\\sim 5-10\\%$ of the AGN bolometric\nluminosity. The X-ray emitting region, popularly known as the corona, is\ngeometrically and radiatively compact with a size typically $\\lesssim 10 \\,\nR_{\\rm G}$ (gravitational radii). The rapid and extreme variability in X-rays\nalso suggest that the corona must be a dynamic structure. Decades of X-ray\nstudies have shed much light on the topic, but the nature and origin of AGN\ncorona are still not clearly understood. This is mostly due to the complexities\ninvolved in several physical processes at play in the high-gravity,\nhigh-density and high-temperature region in the vicinity of the supermassive\nblack hole (SMBH). It is still not clear how exactly the corona is\nenergetically and physically sustained near a SMBH. The ubiquity of coronal\nemission in AGN points to their fundamental role in black hole accretion\nprocesses. In this review we discuss the X-ray observational properties of\ncorona in radio quiet AGN.\n",
  "subjects": [
    "Astrophysics/High Energy Astrophysical Phenomena",
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "PhaMiBT-_sfddEQ93sFYY4TurmGd5uU-DDi6uel45k8",
  "pdfSize": "2440116"
}