{"id":"2412.13689","title":"A bibliometric analysis and scoping study to identify English-language\n  perspectives on slums","authors":"Katharina Henn, Michaela Lestakova, Kevin Logan, Jakob Hartig,\n  Stefanos Georganos, John Friesen","authorsParsed":[["Henn","Katharina",""],["Lestakova","Michaela",""],["Logan","Kevin",""],["Hartig","Jakob",""],["Georganos","Stefanos",""],["Friesen","John",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 10:26:30 GMT"}],"updateDate":"2024-12-19","timestamp":1734517590000,"abstract":"  Slums, informal settlements, and deprived areas are urban regions\ncharacterized by poverty. According to the United Nations, over one billion\npeople reside in these areas, and this number is projected to increase.\nAdditionally, these settlements are integral components of urban systems. We\nconducted a bibliometrical analysis and scoping study using the Web of Science\nDatabase to explore various perspectives on urban poverty, searching for\nscientific publications on the topic and providing details on the countries\nwhere the studies were conducted. Based on 3947 publications, we identify the\nextent to which domestic research organizations participate in studying urban\npoverty and which categories of science they investigate, including life\nsciences \\& biomedicine, social sciences, technology, physical sciences, and\narts & humanities. Thereby, we find that research on slums is often limited to\nspecific countries, e.g. India, South Africa, Kenya, or Brazil. This focus is\nnot necessarily correlated with the number of people living in slums. The\nscientific discourse is up to now predominantly shaped by medical and social\nsciences with few studies addressing technological questions. Finally, our\nanalysis identifies several possible future directions for research on slums.\n","subjects":["Economics/General Economics","Quantitative Finance/Economics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"ulMygzTwPasoU07G3XW1QwIXze73xPeqMdarkvqehMU","pdfSize":"4900644"}