{"id":"2412.05192","title":"A biomechanical study of neck strength and impact dynamics on head and\n  neck injury parameters","authors":"Rahid Zaman, Ashfaq Adnan","authorsParsed":[["Zaman","Rahid",""],["Adnan","Ashfaq",""]],"versions":[{"version":"v1","created":"Fri, 6 Dec 2024 17:17:28 GMT"}],"updateDate":"2024-12-09","timestamp":1733505448000,"abstract":"  Traumatic brain injuries (TBI) are considered a silent epidemic. It affects\nmany people, from automobiles to sports to service members. In this study, we\nemployed a musculoskeletal head-neck model to understand the effect of impact\nlocations, characteristics, and neck strength on head and neck injury severity.\nThree types of impact forces were studied: low-velocity impact (LVI),\nintermediate-velocity impact (IVI), and high-velocity impact (HVI). We\ninvestigated six parameters: linear and rotational accelerations, the\nGeneralized Acceleration Model For Brain Injury Threshold (GAMBIT), neck force,\nneck moment, and Neck Injury Criteria (NIC). We consider seven impact\nlocations, three neck strengths, and three impact characteristics. We studied a\ntotal of 63 cases. It was found that the linear accelerations do not change\nmuch with different neck strengths and impact locations. The impact locations\nhave a significant effect on head and neck injury parameters, and anterolateral\nimpact is the most risky impact location for both head and neck. The maximum\naverage rotational acceleration is for anterolateral eccentric impact which is\n4.75 times more than the average anterior central impact. The lateral impacts\ngenerate about 10% more linear accelerations than anterior and posterior\nimpacts. Neck forces do not vary more than 20% with impact locations and neck\nstrength. The average head and neck injury parameters do not vary more than 10%\nbased on neck strength. Impact characteristics have a significant role in\nGAMBIT and NIC. The average GAMBIT for IVI and HVI were 1.44 and 1.54 times\nhigher than LVI. In summary, the anterolateral eccentric impact has a higher\nprobability of head and neck injury than the other six impact locations. These\nfindings provide objective evidence that can inform injury prevention\nstrategies as well as aid tissue and cellular level studies.\n","subjects":["Quantitative Biology/Tissues and Organs"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"tR9PAxzGrQT35se7cyOC05VC_tC7S_slujTEuRz4rgw","pdfSize":"1616794"}