{"id":"2412.10134","title":"Research Integrity and GenAI: A Systematic Analysis of Ethical\n  Challenges Across Research Phases","authors":"Sonja Bjelobaba (1), Lorna Waddington (2), Mike Perkins (3),\n  Tom\\'a\\v{s} Folt\\'ynek (4), Sabuj Bhattacharyya (5), Debora Weber-Wulff (6)\n  ((1) Uppsala University, Sweden, (2) University of Leeds, UK, (3) British\n  University Vietnam, Vietnam, (4) Masaryk University, Czechia, (5) Institute\n  for Stem Cell Science & Regenerative Medicine, India, (6) HTW Berlin,\n  Germany)","authorsParsed":[["Bjelobaba","Sonja",""],["Waddington","Lorna",""],["Perkins","Mike",""],["Foltýnek","Tomáš",""],["Bhattacharyya","Sabuj",""],["Weber-Wulff","Debora",""]],"versions":[{"version":"v1","created":"Fri, 13 Dec 2024 13:31:45 GMT"}],"updateDate":"2024-12-16","timestamp":1734096705000,"abstract":"  Background: The rapid development and use of generative AI (GenAI) tools in\nacademia presents complex and multifaceted ethical challenges for its users.\nEarlier research primarily focused on academic integrity concerns related to\nstudents' use of AI tools. However, limited information is available on the\nimpact of GenAI on academic research. This study aims to examine the ethical\nconcerns arising from the use of GenAI across different phases of research and\nexplores potential strategies to encourage its ethical use for research\npurposes.\n  Methods: We selected one or more GenAI platforms applicable to various\nresearch phases (e.g. developing research questions, conducting literature\nreviews, processing data, and academic writing) and analysed them to identify\npotential ethical concerns relevant for that stage.\n  Results: The analysis revealed several ethical concerns, including a lack of\ntransparency, bias, censorship, fabrication (e.g. hallucinations and false data\ngeneration), copyright violations, and privacy issues. These findings\nunderscore the need for cautious and mindful use of GenAI.\n  Conclusions: The advancement and use of GenAI are continuously evolving,\nnecessitating an ongoing in-depth evaluation. We propose a set of practical\nrecommendations to support researchers in effectively integrating these tools\nwhile adhering to the fundamental principles of ethical research practices.\n","subjects":["Computer Science/Computers and Society"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"OPDUnrkes84wx76nVQ-HlQtZUL1rhcsT5D_WxVgX_X4","pdfSize":"452540"}