{
  "id": "2412.20039",
  "title": "Tunable cavity coupling to spin defects in\n  4H-silicon-carbide-on-insulator platform",
  "authors": "Tongyuan Bao, Qi Luo, Ailun Yin, Yao Zhang, Haibo Hu, Zhengtong Liu,\n  Shumin Xiao, Xin Ou, Yu Zhou, Qinghai Song",
  "authorsParsed": [
    [
      "Bao",
      "Tongyuan",
      ""
    ],
    [
      "Luo",
      "Qi",
      ""
    ],
    [
      "Yin",
      "Ailun",
      ""
    ],
    [
      "Zhang",
      "Yao",
      ""
    ],
    [
      "Hu",
      "Haibo",
      ""
    ],
    [
      "Liu",
      "Zhengtong",
      ""
    ],
    [
      "Xiao",
      "Shumin",
      ""
    ],
    [
      "Ou",
      "Xin",
      ""
    ],
    [
      "Zhou",
      "Yu",
      ""
    ],
    [
      "Song",
      "Qinghai",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 28 Dec 2024 06:11:08 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735366268000,
  "abstract": "  Silicon carbide (SiC) has attracted significant attention as a promising\nquantum material due to its ability to host long-lived, optically addressable\ncolor centers with solid-state photonic interfaces. The CMOS compatibility of\n4H-SiCOI (silicon-carbide-on-insulator) makes it an ideal platform for\nintegrated quantum photonic devices and circuits. While micro-ring cavities\nhave been extensively studied in SiC and other materials, the integration of\n4H-SiC spin defects into these critical structures, along with continuous mode\ntunability, remains unexplored. In this work, we demonstrate the integration of\nPL4 divacancy spin defects into tunable micro-ring cavities in scalable\nthin-film 4H-SiC nanophotonics. Comparing on- and off-resonance conditions, we\nobserved an enhancement of the Purcell factor by approximately 5.0. This\nenhancement effectively confined coherent photons within the coupled waveguide,\nleading to a twofold increase in the ODMR (optically detected magnetic\nresonance) contrast and coherent control of PL4 spins. These advancements lay\nthe foundation for developing SiC-based quantum photonic circuits.\n",
  "subjects": [
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "gOzmujTbJnhQ3KtkYzRzs5iM4f7BP7MRDg5AYGpGuTI",
  "pdfSize": "1736019"
}