{"id":"2412.04134","title":"Compositional Generative Multiphysics and Multi-component Simulation","authors":"Tao Zhang, Zhenhai Liu, Feipeng Qi, Yongjun Jiao, Tailin Wu","authorsParsed":[["Zhang","Tao",""],["Liu","Zhenhai",""],["Qi","Feipeng",""],["Jiao","Yongjun",""],["Wu","Tailin",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 12:58:30 GMT"}],"updateDate":"2024-12-06","timestamp":1733403510000,"abstract":"  Multiphysics simulation, which models the interactions between multiple\nphysical processes, and multi-component simulation of complex structures are\ncritical in fields like nuclear and aerospace engineering. Previous studies\noften rely on numerical solvers or machine learning-based surrogate models to\nsolve or accelerate these simulations. However, multiphysics simulations\ntypically require integrating multiple specialized solvers-each responsible for\nevolving a specific physical process-into a coupled program, which introduces\nsignificant development challenges. Furthermore, no universal algorithm exists\nfor multi-component simulations, which adds to the complexity. Here we propose\ncompositional Multiphysics and Multi-component Simulation with Diffusion models\n(MultiSimDiff) to overcome these challenges. During diffusion-based training,\nMultiSimDiff learns energy functions modeling the conditional probability of\none physical process/component conditioned on other processes/components. In\ninference, MultiSimDiff generates coupled multiphysics solutions and\nmulti-component structures by sampling from the joint probability distribution,\nachieved by composing the learned energy functions in a structured way. We test\nour method in three tasks. In the reaction-diffusion and nuclear thermal\ncoupling problems, MultiSimDiff successfully predicts the coupling solution\nusing decoupled data, while the surrogate model fails in the more complex\nsecond problem. For the thermal and mechanical analysis of the prismatic fuel\nelement, MultiSimDiff trained for single component prediction accurately\npredicts a larger structure with 64 components, reducing the relative error by\n40.3% compared to the surrogate model.\n","subjects":["Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"AJSfs42r2WKYHqp6NPt50Eg7nRzrGYdBgo97CW4xwd8","pdfSize":"5917569"}