{
  "id": "2412.04486",
  "title": "The Global AI Vibrancy Tool",
  "authors": "Loredana Fattorini, Nestor Maslej, Raymond Perrault, Vanessa Parli,\n  John Etchemendy, Yoav Shoham, Katrina Ligett",
  "authorsParsed": [
    [
      "Fattorini",
      "Loredana",
      ""
    ],
    [
      "Maslej",
      "Nestor",
      ""
    ],
    [
      "Perrault",
      "Raymond",
      ""
    ],
    [
      "Parli",
      "Vanessa",
      ""
    ],
    [
      "Etchemendy",
      "John",
      ""
    ],
    [
      "Shoham",
      "Yoav",
      ""
    ],
    [
      "Ligett",
      "Katrina",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 21 Nov 2024 01:41:17 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1732153277000,
  "abstract": "  This paper presents the latest version of the Global AI Vibrancy Tool (GVT),\nan interactive suite of visualizations designed to facilitate the comparison of\nAI vibrancy across 36 countries, using 42 indicators organized into 8 pillars.\nThe tool offers customizable features that allow users to conduct in-depth\ncountry-level comparisons and longitudinal analyses of AI-related metrics, all\nbased on publicly available data. By providing a transparent assessment of\nnational progress in AI, it serves the diverse needs of policymakers, industry\nleaders, researchers, and the general public. Using weights for indicators and\npillars developed by AI Index's panel of experts and combined into an index,\nthe Global AI Vibrancy Ranking for 2023 places the United States first by a\nsignificant margin, followed by China and the United Kingdom. The ranking also\nhighlights the rise of smaller nations such as Singapore when evaluated on both\nabsolute and per capita bases. The tool offers three sub-indices for evaluating\nGlobal AI Vibrancy along different dimensions: the Innovation Index, the\nEconomic Competitiveness Index, and the Policy, Governance, and Public\nEngagement Index.\n",
  "subjects": [
    "Computer Science/Computers and Society",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "W6Fyi9n_r7MATXF77fBOCuNC1DTA2VQWKxO-x3tRbkA",
  "pdfSize": "6272255"
}