{
  "id": "2412.18428",
  "title": "Explainable Multi-Modal Data Exploration in Natural Language via LLM\n  Agent",
  "authors": "Farhad Nooralahzadeh, Yi Zhang, Jonathan Furst, Kurt Stockinger",
  "authorsParsed": [
    [
      "Nooralahzadeh",
      "Farhad",
      ""
    ],
    [
      "Zhang",
      "Yi",
      ""
    ],
    [
      "Furst",
      "Jonathan",
      ""
    ],
    [
      "Stockinger",
      "Kurt",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 24 Dec 2024 13:42:44 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1735047764000,
  "abstract": "  International enterprises, organizations, or hospitals collect large amounts\nof multi-modal data stored in databases, text documents, images, and videos.\nWhile there has been recent progress in the separate fields of multi-modal data\nexploration as well as in database systems that automatically translate natural\nlanguage questions to database query languages, the research challenge of\nquerying database systems combined with other unstructured modalities such as\nimages in natural language is widely unexplored.\n  In this paper, we propose XMODE - a system that enables explainable,\nmulti-modal data exploration in natural language. Our approach is based on the\nfollowing research contributions: (1) Our system is inspired by a real-world\nuse case that enables users to explore multi-modal information systems. (2)\nXMODE leverages a LLM-based agentic AI framework to decompose a natural\nlanguage question into subtasks such as text-to-SQL generation and image\nanalysis. (3) Experimental results on multi-modal datasets over relational data\nand images demonstrate that our system outperforms state-of-the-art multi-modal\nexploration systems, excelling not only in accuracy but also in various\nperformance metrics such as query latency, API costs, planning efficiency, and\nexplanation quality, thanks to the more effective utilization of the reasoning\ncapabilities of LLMs.\n",
  "subjects": [
    "Computer Science/Artificial Intelligence",
    "Computer Science/Computation and Language"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "2QQMdY0sN6IjA9x4eCvA7wQGJ19lJvrAx4uQcvIPldo",
  "pdfSize": "6131454"
}