{"id":"2412.03781","title":"Scaling laws for concentration-gradient-driven electrolyte transport\n  through a 2D membrane","authors":"Holly C. M. Baldock, David M. Huang","authorsParsed":[["Baldock","Holly C. M.",""],["Huang","David M.",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 00:05:05 GMT"}],"updateDate":"2025-02-21","timestamp":1733357105000,"abstract":"  Two-dimensional (2D) nanomaterials exhibit unique properties that are\npromising for diverse applications, including those relevant to\nconcentration-gradient-driven transport of electrolyte solutions through porous\nmembranes made from these materials, such as water desalination, osmotic power,\nand iontronics. Here we derive general equations, and determine scaling laws in\nthe thick and thin electric-double-layer limits, that quantify the variation of\nthe concentration-gradient-driven flow rate, solute flux and electric current\nwith the pore radius, surface charge density and Debye screening length for the\ntransport of a dilute electrolyte solution through a circular aperture in an\ninfinitesimally thin planar membrane. We also determine scaling laws for the\nelectric-field-driven flow rate in the thin electric-double-layer limit in the\nsame geometry. We show that these scaling laws accurately capture the scaling\nrelationships from finite-element numerical simulations within the\nDebye-H\\\"uckel regime, and extend the theory to obtain scaling laws in the thin\nelectric-double-layer limit that hold even when the electric potential energy\nis large compared with the thermal energy. These scaling laws indicate unusual\nbehavior for concentration-gradient-driven flow in a 2D membrane that is not\nseen in thicker membranes, which has broad implications for liquid transport\nthrough membranes whose thickness comparable to, or smaller than, their pore\nsize.\n","subjects":["Condensed Matter/Soft Condensed Matter","Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"yOXEOTDM5puwteeDewVEsY8lOI79NK0yV1w-Xr0GtdU","pdfSize":"4299830"}