{
  "id": "2412.15452",
  "title": "Mechanistic Insights into the Oxygen Evolution Reaction on Nickel-Doped\n  Barium Titanate via Machine Learning-Accelerated Simulations",
  "authors": "Kajjana Boonpalit and Nongnuch Artrith",
  "authorsParsed": [
    [
      "Boonpalit",
      "Kajjana",
      ""
    ],
    [
      "Artrith",
      "Nongnuch",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 23:14:27 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734650067000,
  "abstract": "  Electrocatalytic water splitting, which produces hydrogen and oxygen through\nwater electrolysis, is a promising method for generating renewable, carbon-free\nalternative fuels. However, its widespread adoption is hindered by the high\ncosts of Pt cathodes and IrO$_{x}$/RuO$_{x}$ anode catalysts. In the search for\ncost-effective alternatives, barium titanate (BaTiO$_{3}$) has emerged as a\ncompelling candidate. This inexpensive, non-toxic perovskite oxide can be\nsynthesized from earth-abundant precursors and has shown potential for\ncatalyzing the oxygen evolution reaction (OER) in recent studies. In this work,\nwe explore the OER activity of pristine and Ni-doped BaTiO$_{3}$ at explicit\nwater interfaces using metadynamics (MetaD) simulations. To enable efficient\nand practical MetaD for OER, we developed a machine learning interatomic\npotential based on artificial neural networks (ANN), achieving large-scale and\nlong-time simulations with near-DFT accuracy. Our simulations reveal that\nNi-doping enhances the catalytic activity of BaTiO$_{3}$ for OER, consistent\nwith experimental observations, while providing mechanistic insights into this\nenhancement.\n",
  "subjects": [
    "Condensed Matter/Materials Science",
    "Condensed Matter/Disordered Systems and Neural Networks"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "98hWNRQS0JPqZPLIFStFmMgdybzgiuFKG9cr7mrfVwg",
  "pdfSize": "14617260"
}