{
  "id": "2412.16381",
  "title": "VerSe: Integrating Multiple Queries as Prompts for Versatile Cardiac MRI\n  Segmentation",
  "authors": "Bangwei Guo, Meng Ye, Yunhe Gao, Bingyu Xin, Leon Axel, Dimitris\n  Metaxas",
  "authorsParsed": [
    [
      "Guo",
      "Bangwei",
      ""
    ],
    [
      "Ye",
      "Meng",
      ""
    ],
    [
      "Gao",
      "Yunhe",
      ""
    ],
    [
      "Xin",
      "Bingyu",
      ""
    ],
    [
      "Axel",
      "Leon",
      ""
    ],
    [
      "Metaxas",
      "Dimitris",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 22:35:47 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734734147000,
  "abstract": "  Despite the advances in learning-based image segmentation approach, the\naccurate segmentation of cardiac structures from magnetic resonance imaging\n(MRI) remains a critical challenge. While existing automatic segmentation\nmethods have shown promise, they still require extensive manual corrections of\nthe segmentation results by human experts, particularly in complex regions such\nas the basal and apical parts of the heart. Recent efforts have been made on\ndeveloping interactive image segmentation methods that enable human-in-the-loop\nlearning. However, they are semi-automatic and inefficient, due to their\nreliance on click-based prompts, especially for 3D cardiac MRI volumes. To\naddress these limitations, we propose VerSe, a Versatile Segmentation framework\nto unify automatic and interactive segmentation through mutiple queries. Our\nkey innovation lies in the joint learning of object and click queries as\nprompts for a shared segmentation backbone. VerSe supports both fully automatic\nsegmentation, through object queries, and interactive mask refinement, by\nproviding click queries when needed. With the proposed integrated prompting\nscheme, VerSe demonstrates significant improvement in performance and\nefficiency over existing methods, on both cardiac MRI and out-of-distribution\nmedical imaging datasets. The code is available at\nhttps://github.com/bangwayne/Verse.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Human-Computer Interaction"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "M9XONvrn8OKuz7rBXpgt8zBqjxganfkw3r5h1SOZIZg",
  "pdfSize": "7337575"
}