{
  "id": "2412.06241",
  "title": "Plagiarism Detection Using Machine Learning",
  "authors": "Omraj Kamat, Tridib Ghosh, Kalaivani J, Angayarkanni V, Rama P",
  "authorsParsed": [
    [
      "Kamat",
      "Omraj",
      ""
    ],
    [
      "Ghosh",
      "Tridib",
      ""
    ],
    [
      "J",
      "Kalaivani",
      ""
    ],
    [
      "V",
      "Angayarkanni",
      ""
    ],
    [
      "P",
      "Rama",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 06:30:27 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733725827000,
  "abstract": "  Plagiarism is an act of using someone else's work without proper\nacknowledgment, and this sin is seen to cut across various arenas including the\nacademy, publishing, and other similar arenas. The traditional methods of\nplagiarism detection through keyword matching and review by humans usually fail\nto cope with increasingly sophisticated techniques used to mask copy pasted\ncontent. This paper aims to introduce a plagiarism detection approach based on\nmachine learning that utilizes natural language processing and complex\nclassification algorithms toward efficient detection of similarities between\nthe documents. The developed model has the capability to detect both exact and\nparaphrased plagiarism accurately using advanced feature extraction techniques\nwith supervised learning algorithms. We adapted and tested our model on an\nextensive text sample dataset. And we demonstrated some promising results about\nprecision, recall, and detection accuracy. These outcomes showed that applying\nmachine learning techniques can significantly enhance the functionalities of\nplagiarism detection systems and improve traditional ones with robust\nscalability. Future work would include enlargement of the dataset and\nfine-tuning of the model toward more complicated cases of disguised plagiarism.\n",
  "subjects": [
    "Computer Science/Emerging Technologies",
    "Computer Science/Computational Complexity"
  ],
  "license": "http://creativecommons.org/publicdomain/zero/1.0/",
  "blobId": "DdKbEMXYK3O4wm6EsdiCi_ass19qZgqN12RAluUeeyk",
  "pdfSize": "693294"
}