{"id":"2412.04469","title":"QUEEN: QUantized Efficient ENcoding of Dynamic Gaussians for Streaming\n  Free-viewpoint Videos","authors":"Sharath Girish, Tianye Li, Amrita Mazumdar, Abhinav Shrivastava, David\n  Luebke, Shalini De Mello","authorsParsed":[["Girish","Sharath",""],["Li","Tianye",""],["Mazumdar","Amrita",""],["Shrivastava","Abhinav",""],["Luebke","David",""],["De Mello","Shalini",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 18:59:55 GMT"}],"updateDate":"2024-12-06","timestamp":1733425195000,"abstract":"  Online free-viewpoint video (FVV) streaming is a challenging problem, which\nis relatively under-explored. It requires incremental on-the-fly updates to a\nvolumetric representation, fast training and rendering to satisfy real-time\nconstraints and a small memory footprint for efficient transmission. If\nachieved, it can enhance user experience by enabling novel applications, e.g.,\n3D video conferencing and live volumetric video broadcast, among others. In\nthis work, we propose a novel framework for QUantized and Efficient ENcoding\n(QUEEN) for streaming FVV using 3D Gaussian Splatting (3D-GS). QUEEN directly\nlearns Gaussian attribute residuals between consecutive frames at each\ntime-step without imposing any structural constraints on them, allowing for\nhigh quality reconstruction and generalizability. To efficiently store the\nresiduals, we further propose a quantization-sparsity framework, which contains\na learned latent-decoder for effectively quantizing attribute residuals other\nthan Gaussian positions and a learned gating module to sparsify position\nresiduals. We propose to use the Gaussian viewspace gradient difference vector\nas a signal to separate the static and dynamic content of the scene. It acts as\na guide for effective sparsity learning and speeds up training. On diverse FVV\nbenchmarks, QUEEN outperforms the state-of-the-art online FVV methods on all\nmetrics. Notably, for several highly dynamic scenes, it reduces the model size\nto just 0.7 MB per frame while training in under 5 sec and rendering at 350\nFPS. Project website is at https://research.nvidia.com/labs/amri/projects/queen\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"OPZEyXgBp3KtwVw-ef6f2yEcgWJUxnQaVmLZRxg3rJc","pdfSize":"16842755"}