{
  "id": "2412.09838",
  "title": "Cultivating a Supportive Sphere: Designing Technology to Increase Social\n  Support for Foster-Involved Youth",
  "authors": "Ila Kumar, Craig Ferguson, Jiayi Wu, Rosalind W Picard",
  "authorsParsed": [
    [
      "Kumar",
      "Ila",
      ""
    ],
    [
      "Ferguson",
      "Craig",
      ""
    ],
    [
      "Wu",
      "Jiayi",
      ""
    ],
    [
      "Picard",
      "Rosalind W",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 04:09:39 GMT"
    },
    {
      "version": "v2",
      "created": "Sun, 5 Jan 2025 22:06:07 GMT"
    },
    {
      "version": "v3",
      "created": "Wed, 15 Jan 2025 17:20:30 GMT"
    }
  ],
  "updateDate": "2025-01-16",
  "timestamp": 1734062979000,
  "abstract": "  Approximately 400,000 youth in the US are living in foster care due to\nexperiences with abuse or neglect at home. For multiple reasons, these youth\noften don't receive adequate social support from those around them. Despite\ntechnology's potential, very little work has explored how these tools can\nprovide more support to foster-involved youth. To begin to fill this gap, we\nworked with current and former foster-involved youth to develop the first\ndigital tool that aims to increase social support for this population, creating\na novel system in which users complete reflective check-ins in an online\ncommunity setting. We then conducted a pilot study with 15 current and former\nfoster-involved youth, comparing the effect of using the app for two weeks to\ntwo weeks of no intervention. We collected qualitative and quantitative data,\nwhich demonstrated that this type of interface can provide youth with types of\nsocial support that are often not provided by foster care services and other\ndigital interventions. The paper details the motivation behind the app, the\ntrauma-informed design process, and insights gained from this initial\nevaluation study. Finally, the paper concludes with recommendations for\ndesigning digital tools that effectively provide social support to\nfoster-involved youth.\n",
  "subjects": [
    "Computer Science/Human-Computer Interaction"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "Trb_12k9Kqa2AhBd8U-lFA3d2Q5tdNc_RzrdfdJPkPA",
  "pdfSize": "5187962"
}