{
  "id": "2412.10018",
  "title": "Thermal atoms facilitate intensity clipping between vectorial dual-beam\n  generated by a single metasurface chip",
  "authors": "Chen Qing, Jialong Cui, Lishuang Feng, and Dengke Zhang",
  "authorsParsed": [
    [
      "Qing",
      "Chen",
      ""
    ],
    [
      "Cui",
      "Jialong",
      ""
    ],
    [
      "Feng",
      "Lishuang",
      ""
    ],
    [
      "Zhang",
      "Dengke",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 09:59:58 GMT"
    }
  ],
  "updateDate": "2024-12-16",
  "timestamp": 1734083998000,
  "abstract": "  Manipulating vector beams is pivotal in fields such as particle manipulation,\nimage processing, and quantum communication. Flexibly adjusting the intensity\ndistribution of these beams is crucial for effectively realizing these\napplications. This study introduces a vectorial dual-beam system utilizing\nthermal atoms as the medium for modulating the intensity profile of vector\nbeams. A single metasurface is employed to generate both the control and signal\nvector beams, each with unique vectorial characteristics. The shaping of the\nsignal beam profile is facilitated by the interaction with thermal atoms, which\ncan be controlled by adjusting the control vector beam. This spatially\nselective absorption is a result of the thermal atoms' response to the varying\npolarizations within the vector beams. In this experiment, two distinct\nmetasurface chips are fabricated to generate vector beams with doughnut-shaped\nand Gaussian-shaped intensity profiles. By adjusting the incident power and\npolarization state of the control light, the doughnut-shaped signal beams can\nbe converted into a rotational dual-lobed pattern or the dimensions of the\nGaussian-distributed signal beams can be modified. This study introduces a\nnovel vector beam shaping technique by integrating metasurfaces with thermal\natoms, offering significant promise for future applications requiring\nminiaturization, dynamic operation, and versatile control capabilities.\n",
  "subjects": [
    "Physics/Optics",
    "Physics/Atomic Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "iyIc231dEY3dylEEWemPx7fJGjdi9wHv7UmyI9QH18U",
  "pdfSize": "2541897"
}