{"id":"2412.08974","title":"Three-Dimensional Construction of Hyperuniform, Nonhyperuniform and\n  Antihyperuniform Random Media via Spectral Density Functions and Their\n  Transport Properties","authors":"Wenlong Shi and Yang Jiao and Salvatore Torquato","authorsParsed":[["Shi","Wenlong",""],["Jiao","Yang",""],["Torquato","Salvatore",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 06:11:53 GMT"}],"updateDate":"2024-12-13","timestamp":1733983913000,"abstract":"  Rigorous theories connecting physical properties of a heterogeneous material\nto its microstructure offer a promising avenue to guide the computational\nmaterial design and optimization. We present here an efficient Fourier-space\nbased computational framework and employ a variety of analytical ${\\tilde\n\\chi}_{_V}({k})$ functions that satisfy all known necessary conditions to\nconstruct 3D disordered stealthy hyperuniform, standard hyperuniform,\nnonhyperuniform, and antihyperuniform two-phase heterogeneous material systems\nat varying phase volume fractions. We show that a rich spectrum of distinct\nstructures within each of the above classes of materials can be generated by\ntuning correlations in the system across length scales. We present the first\nrealization of antihyperuniform two-phase heterogeneous materials in 3D, which\nare characterized by a power-law autocovariance function $\\chi_{_V}(r)$ and\ncontain clusters of dramatically different sizes and morphologies. We also\ndetermine the diffusion spreadability ${\\cal S}(t)$ and estimate the fluid\npermeability $k$ associated with all of the constructed materials directly from\nthe corresponding ${\\tilde \\chi}_{_V}({k})$ functions. We find that varying the\nlength-scale parameter within each class of ${\\tilde \\chi}_{_V}({k})$ functions\ncan also lead to orders of magnitude variation of ${\\cal S}(t)$ at intermediate\nand long time scales. Moreover, we find that increasing solid volume fraction\n$\\phi_1$ and correlation length $a$ in the constructed media generally leads to\na decrease in the dimensionless fluid permeability $k/a^2$. These results\nindicate the feasibility of employing parameterized ${\\tilde \\chi}_{_V}({k})$\nfor designing composites with targeted transport properties.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Statistical Mechanics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"uHnKir902L7q8u8fiWhZRI_IxSwbQG-EbEpFzf807y0","pdfSize":"3254855"}