{
  "id": "2412.17714",
  "title": "The Cosmological Population of Gamma-Ray Bursts from the Disks of Active\n  Galactic Nuclei",
  "authors": "Hoyoung D. Kang, Rosalba Perna, Davide Lazzati, and Yi-Han Wang",
  "authorsParsed": [
    [
      "Kang",
      "Hoyoung D.",
      ""
    ],
    [
      "Perna",
      "Rosalba",
      ""
    ],
    [
      "Lazzati",
      "Davide",
      ""
    ],
    [
      "Wang",
      "Yi-Han",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 16:45:32 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734972332000,
  "abstract": "  With the discovery of gravitational waves (GWs), the disks of Active Galactic\nNuclei (AGN) have emerged as an interesting environment for hosting a fraction\nof their sources. AGN disks are conducive to forming both long and short\nGamma-Ray Bursts (GRBs), and their anticipated cosmological occurrence within\nthese disks has potential to serve as an independent tool for probing and\ncalibrating the population of stars and compact objects within them, and their\ncontribution to the GW-detected population. In this study, we employ Monte\nCarlo methods in conjunction with models for GRB electromagnetic emission in\nextremely dense media to simulate the cosmological occurrence of both long and\nshort GRBs within AGN disks, while also estimating their detectability across a\nrange of wavelengths, from gamma-rays to radio frequencies. {We investigate two\nextreme scenarios: ``undiffused\", in which the radiation escapes without\nsignificant scattering (i.e. if the progenitor has excavated a funnel within\nthe disk), and ``diffused\", in which the radiation is propagated through the\nhigh-density medium, potentially scattered and absorbed. {In the diffused\ncase,} we find that the majority of detectable GRBs are likely to originate\nfrom relatively low redshifts, and from the outermost regions of large\nsupermassive black hole (SMBH) masses, $\\gtrsim 10^{7.5} \\rm M_{\\odot}$. In the\nundiffused case, we expect a similar trend, but with a considerable\ncontribution from the intermediate regions of lower SMBH masses. Detectable\nemission is generally expected to be dominant in prompt $\\gamma$-rays if\ndiffusion is not dominant, and X-ray afterglow if diffusion is important;\nhowever, the nature of the dominant observable signal highly depends on the\nspecific AGN disk model, hence making GRBs in AGN disks also potential probes\nof the structure of the disks themselves.\n",
  "subjects": [
    "Astrophysics/High Energy Astrophysical Phenomena"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "fHl_ekzGhm2rIgfWDCN_xoc0jZ51KMz3degjMu0g-Uk",
  "pdfSize": "7450816"
}