{
  "id": "2412.14713",
  "title": "Cosmology and Source Redshift Distributions from Combining Radio Weak\n  Lensing with CMB Lensing",
  "authors": "Alba Kalaja, Ian Harrison, William R Coulton",
  "authorsParsed": [
    [
      "Kalaja",
      "Alba",
      ""
    ],
    [
      "Harrison",
      "Ian",
      ""
    ],
    [
      "Coulton",
      "William R",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 10:22:55 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734603775000,
  "abstract": "  Measurements of weak gravitational lensing using the cosmic microwave\nbackground and the shapes of galaxies have refined our understanding of the\nlate-time history of the Universe. While optical surveys have been the primary\nsource for cosmic shear measurements, radio continuum surveys offer a promising\navenue. Relevant radio sources, principally star-forming galaxies, have\npopulations with higher mean redshifts and are less affected by dust extinction\ncompared to optical sources. We focus on the future mid frequency SKA radio\ntelescope and explore the cross-correlation between radio cosmic shear and CMB\nlensing convergence ($\\gamma_\\mathrm{R}\\times \\kappa_\\mathrm{CMB}$). We\ninvestigate its potential in constraining the redshift distribution of radio\ngalaxy samples and improving cosmological parameter constraints, including the\nneutrino sector. Using simulations of the first phase of the SKA and the Simons\nObservatory as a CMB experiment, we show how this $\\gamma_\\mathrm{R}\\times\n\\kappa_\\mathrm{CMB}$ cross-correlation can provide $\\sim1 - 10\\%$ calibration\nof the overall radio source redshift distribution, which in turn can\nsignificantly tighten otherwise degenerate measurements of radio galaxy bias.\nFor the case of the next-generation full SKA, we find that the\ncross-correlation becomes more powerful than the equivalent with a\n\\textit{Euclid}-like survey, with constraints $30\\%$ tighter on $\\Lambda$CDM\nparameters and narrower bounds on sum of neutrino masses at the level of $\\sim\n24\\%$. These constraints are also driven by higher redshifts and larger scales\nthan other galaxy-CMB cross-correlations, potentially shedding light on\ndifferent physical models. Our findings demonstrate the potential of radio weak\nlensing in improving constraints, and establish the groundwork for future joint\nanalyses of CMB experiments and radio continuum surveys.\n",
  "subjects": [
    "Astrophysics/Cosmology and Nongalactic Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "cFI3bjo2OwemCqBiO1aWy1Z7Kj8XwvuHynYdPlmIzI0",
  "pdfSize": "2353449"
}