{
  "id": "2412.06549",
  "title": "Prediction of Occluded Pedestrians in Road Scenes using Human-like\n  Reasoning: Insights from the OccluRoads Dataset",
  "authors": "Melo Castillo Angie Nataly, Martin Serrano Sergio, Salinas Carlota,\n  Sotelo Miguel Angel",
  "authorsParsed": [
    [
      "Nataly",
      "Melo Castillo Angie",
      ""
    ],
    [
      "Sergio",
      "Martin Serrano",
      ""
    ],
    [
      "Carlota",
      "Salinas",
      ""
    ],
    [
      "Angel",
      "Sotelo Miguel",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 14:59:27 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733756367000,
  "abstract": "  Pedestrian detection is a critical task in autonomous driving, aimed at\nenhancing safety and reducing risks on the road. Over recent years, significant\nadvancements have been made in improving detection performance. However, these\nachievements still fall short of human perception, particularly in cases\ninvolving occluded pedestrians, especially entirely invisible ones. In this\nwork, we present the Occlusion-Rich Road Scenes with Pedestrians (OccluRoads)\ndataset, which features a diverse collection of road scenes with partially and\nfully occluded pedestrians in both real and virtual environments. All scenes\nare meticulously labeled and enriched with contextual information that\nencapsulates human perception in such scenarios. Using this dataset, we\ndeveloped a pipeline to predict the presence of occluded pedestrians,\nleveraging Knowledge Graph (KG), Knowledge Graph Embedding (KGE), and a\nBayesian inference process. Our approach achieves a F1 score of 0.91,\nrepresenting an improvement of up to 42% compared to traditional machine\nlearning models.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "HbuRFIi0OLJQRsXZIuZF1uVwHvDEcfVNJyewriUhXOc",
  "pdfSize": "3089349"
}