{"id":"2412.15531","title":"Spatiotemporal pattern formations in a two-layer coupled\n  reaction-diffusion Lengyel-Epstein system","authors":"Qidong Wu and Fengqi Yi","authorsParsed":[["Wu","Qidong",""],["Yi","Fengqi",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 03:47:20 GMT"}],"updateDate":"2024-12-23","timestamp":1734666440000,"abstract":"  Spatiotemporal pattern formations in two-layer coupled reaction-diffusion\nLengyel-Epstein system with distributed delayed couplings are investigated.\nFirstly, for the original decoupled system, it is proved that when the\nintra-reactor diffusion rate $\\ep$ of the inhibitor is sufficiently small and\nthe intra-reactor diffusion rate $d$ of the inhibitor is large enough, then the\nsubsystem can exhibit non-constant positive steady state\n$(\\widetilde{u}(x;\\ep),\\widetilde{v}(x;\\epsilon))$ with large amplitude, and\nthat as the parameter $\\tau$ varies, the stability of\n$(\\widetilde{u}(x;\\ep),\\widetilde{v}(x;\\epsilon))$ changes, leading to the\nemergence of periodic solutions via Hopf bifurcation. Secondly, for the\ntwo-layer coupled system, the stability of the symmetric steady state\n$(\\widetilde{u}(x;\\ep),\\widetilde{v}(x;\\epsilon),\\widetilde{u}(x;\\ep),\\widetilde{v}(x;\\epsilon))$\nis studied by treating $k_1,k_2$ (the inter-reactor diffusion rates) and $\\al$\n(the delay parameter) as the main parameters. In case of non-delayed couplings,\nthe first quadrant of the $(k_1, k_2)$ parameter space can be divided into two\nregions: one is stable region, the other one is unstable region, and the two\nregions have the common boundary, which is the primary Turing bifurcation\ncurve. In case of delayed couplings, it is shown that the first quadrant of the\n$(k_1, k_2)$ parameter space can be re-divided into three regions: the first\none is unstable region, the second one is stable region, while the third one is\nthe potential \\lq\\lq bifurcation\\rq\\rq region, where Hopf bifurcation may occur\nfor suitable $\\al$. Our analysis is mainly based on the singular perturbation\ntechniques and the implicit function theorem, and the results show some\ndifferent phenomena from those of the original decoupled system in one reactor.\n","subjects":["Mathematics/Analysis of PDEs"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"F31aBBiIvlOlcFfRh6KArOEXMmYWYdvWYTKKeTt4ASA","pdfSize":"463681"}