{
  "id": "2412.03741",
  "title": "Impact of local structure on melt dynamics in Cu-Ti alloys: Insights\n  from ab-initio molecular dynamics simulations",
  "authors": "Lucas P. Kreuzer, Fan Yang, Andreas Mayer, Noel Jakse",
  "authorsParsed": [
    [
      "Kreuzer",
      "Lucas P.",
      ""
    ],
    [
      "Yang",
      "Fan",
      ""
    ],
    [
      "Mayer",
      "Andreas",
      ""
    ],
    [
      "Jakse",
      "Noel",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 22:13:16 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733350396000,
  "abstract": "  First-principle based molecular-dynamics simulations have been performed for\nbinary Cu$_x$Ti$_{1-x}$ (x = 0.31, 0.50, and 0.76) alloys to investigate the\nrelationship between local structure and dynamical properties in the liquid and\nundercooled melt. The undercooled melts show a pronounced short-range order,\nmajorly a five-fold symmetry (FFS) around the Cu atoms, which competes with bcc\nordering. This complex SRO is also reflected in the partial coordination\nnumbers, where mainly a Z12 coordination is present around Cu, which\ncorresponds to an icosahedral ordering. Higher coordination numbers were\nobtained for Ti compatible with Frank-Kasper polyhedra. The increasing\nFrank-Kasper polyhedra coordination scenario around Ti impacts on the\ninteratomic distances of Ti atoms, which increase with increasing Ti content.\nThe Cu$_{50}$Ti$_{50}$ composition exhibits the highest FFS ordering and amount\nof Frank-Kasper polyhedra, which explains the slowest melt dynamics, found\nexperimentally and in simulations for this composition. Thus, our results\nsuggest that the high undercooling degree and glass-forming ability of binary\nCuTi alloys, originates from the high complexity of the local structure rather\nthan due to the preferred formation of Cu-Ti pairs, as Cu-Ti interactions were\nfound to be weak.\n",
  "subjects": [
    "Condensed Matter/Materials Science"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "3asHqq5wOE9NLIuA6BItvdHzHEg28Sae3ACbwnLSFfM",
  "pdfSize": "1066727"
}