{
  "id": "2412.19582",
  "title": "An Actionable Hierarchical Scene Representation Enhancing Autonomous\n  Inspection Missions in Unknown Environments",
  "authors": "Vignesh Kottayam Viswanathan, Mario Alberto Valdes Saucedo, Sumeet\n  Gajanan Satpute, Christoforos Kanellakis and George Nikolakopoulos",
  "authorsParsed": [
    [
      "Viswanathan",
      "Vignesh Kottayam",
      ""
    ],
    [
      "Saucedo",
      "Mario Alberto Valdes",
      ""
    ],
    [
      "Satpute",
      "Sumeet Gajanan",
      ""
    ],
    [
      "Kanellakis",
      "Christoforos",
      ""
    ],
    [
      "Nikolakopoulos",
      "George",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 27 Dec 2024 10:57:17 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735297037000,
  "abstract": "  In this article, we present the Layered Semantic Graphs (LSG), a novel\nactionable hierarchical scene graph, fully integrated with a multi-modal\nmission planner, the FLIE: A First-Look based Inspection and Exploration\nplanner. The novelty of this work stems from aiming to address the task of\nmaintaining an intuitive and multi-resolution scene representation, while\nsimultaneously offering a tractable foundation for planning and scene\nunderstanding during an ongoing inspection mission of apriori unknown\ntargets-of-interest in an unknown environment. The proposed LSG scheme is\ncomposed of locally nested hierarchical graphs, at multiple layers of\nabstraction, with the abstract concepts grounded on the functionality of the\nintegrated FLIE planner. Furthermore, LSG encapsulates real-time semantic\nsegmentation models that offer extraction and localization of desired semantic\nelements within the hierarchical representation. This extends the capability of\nthe inspection planner, which can then leverage LSG to make an informed\ndecision to inspect a particular semantic of interest. We also emphasize the\nhierarchical and semantic path-planning capabilities of LSG, which can extend\ninspection missions by improving situational awareness for human operators in\nan unknown environment. The validity of the proposed scheme is proven through\nextensive evaluations of the proposed architecture in simulations, as well as\nexperimental field deployments on a Boston Dynamics Spot quadruped robot in\nurban outdoor environment settings.\n",
  "subjects": [
    "Computer Science/Robotics"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "EqdViqE7We8zqB8gseSq3ofgugph-q2JQwSjMjb1GOY",
  "pdfSize": "4665639"
}