{
  "id": "2412.12046",
  "title": "Artificial Intelligence in Traffic Systems",
  "authors": "Ritwik Raj Saxena",
  "authorsParsed": [
    [
      "Saxena",
      "Ritwik Raj",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 18:15:49 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734372949000,
  "abstract": "  Existing research on AI-based traffic management systems, utilizing\ntechniques such as fuzzy logic, reinforcement learning, deep neural networks,\nand evolutionary algorithms, demonstrates the potential of AI to transform the\ntraffic landscape. This article endeavors to review the topics where AI and\ntraffic management intersect. It comprises areas like AI-powered traffic signal\ncontrol systems, automatic distance and velocity recognition (for instance, in\nautonomous vehicles, hereafter AVs), smart parking systems, and Intelligent\nTraffic Management Systems (ITMS), which use data captured in real-time to keep\ntrack of traffic conditions, and traffic-related law enforcement and\nsurveillance using AI. AI applications in traffic management cover a wide range\nof spheres. The spheres comprise, inter alia, streamlining traffic signal\ntimings, predicting traffic bottlenecks in specific areas, detecting potential\naccidents and road hazards, managing incidents accurately, advancing public\ntransportation systems, development of innovative driver assistance systems,\nand minimizing environmental impact through simplified routes and reduced\nemissions. The benefits of AI in traffic management are also diverse. They\ncomprise improved management of traffic data, sounder route decision\nautomation, easier and speedier identification and resolution of vehicular\nissues through monitoring the condition of individual vehicles, decreased\ntraffic snarls and mishaps, superior resource utilization, alleviated stress of\ntraffic management manpower, greater on-road safety, and better emergency\nresponse time.\n",
  "subjects": [
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "vH27Qk-_NhUpi24ynVXRMjSmggoA7ACyV9fw2pleAGk",
  "pdfSize": "1382963"
}