{"id":"2412.07911","title":"Turbo Receiver Design with Joint Detection and Demapping for Coded\n  Differential BPSK in Bursty Impulsive Noise Channels","authors":"Chin-Hung Chen, Boris Karanov, Wim van Houtom, Yan Wu, Alex Alvarado","authorsParsed":[["Chen","Chin-Hung",""],["Karanov","Boris",""],["van Houtom","Wim",""],["Wu","Yan",""],["Alvarado","Alex",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 20:41:09 GMT"}],"updateDate":"2024-12-12","timestamp":1733863269000,"abstract":"  It has been recognized that the impulsive noise (IN) generated by power\ndevices poses significant challenges to wireless receivers in practice. In this\npaper, we assess the achievable information rate (AIR) and the performance of\npractical turbo receiver designs for a well-established Markov-Middleton IN\nmodel. We utilize a commonly used commercial transmission setup consisting of a\nconvolutional encoder, bit-level interleaver, and a differential binary\nphase-shift keying (DBPSK) symbol mapper. Firstly, we conduct a comprehensive\nassessment of the AIRs of the underlying channel model using DBPSK transmitted\nsymbols across various channel conditions. Additionally, we introduce two\nrobust turbo-like receiver designs. The first design features a separate IN\ndetector and a turbo-demapper-decoder. The second design employs a joint\napproach, where the extrinsic information of both the detector and demapper is\nsimultaneously updated, forming a turbo-detector-demapper-decoder structure. We\nshow that the joint design consistently outperforms the separate design across\nall channel conditions, particularly in low AIR situations. However, the\nmaximum performance gain for the channel conditions considered in this paper is\nmerely 0.2 dB, and the joint system incurs significantly greater computational\ncomplexity, especially for a high number of turbo iterations. The performance\nof the two proposed turbo receiver designs is demonstrated to be close to the\nestimated AIR, with a performance gap dependent on the channel parameters.\n","subjects":["Computer Science/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8J9gB_UEc45MVWLhCbgiXXCQanVgF2YLziCFQPCXygc","pdfSize":"460855"}