{"id":"2412.11783","title":"The Black Ninjas and the Sniper: On Robustness of Population Protocols","authors":"Benno Lossin, Philipp Czerner, Javier Esparza, Roland Guttenberg,\n  Tobias Prehn","authorsParsed":[["Lossin","Benno",""],["Czerner","Philipp",""],["Esparza","Javier",""],["Guttenberg","Roland",""],["Prehn","Tobias",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 13:54:52 GMT"}],"updateDate":"2024-12-17","timestamp":1734357292000,"abstract":"  Population protocols are a model of distributed computation in which an\narbitrary number of indistinguishable finite-state agents interact in pairs to\ndecide some property of their initial configuration. We investigate the\nbehaviour of population protocols under adversarial faults that cause agents to\nsilently crash and no longer interact with other agents. As a starting point,\nwe consider the property ``the number of agents exceeds a given threshold\n$t$'', represented by the predicate $x \\geq t$, and show that the standard\nprotocol for $x \\geq t$ is very fragile: one single crash in a computation with\n$x:=2t-1$ agents can already cause the protocol to answer incorrectly that $x\n\\geq t$ does not hold. However, a slightly less known protocol is robust: for\nany number $t' \\geq t$ of agents, at least $t' - t+1$ crashes must occur for\nthe protocol to answer that the property does not hold.\n  We formally define robustness for arbitrary population protocols, and\ninvestigate the question whether every predicate computable by population\nprotocols has a robust protocol. Angluin et al. proved in 2007 that population\nprotocols decide exactly the Presburger predicates, which can be represented as\nBoolean combinations of threshold predicates of the form $\\sum_{i=1}^n a_i\n\\cdot x_i \\geq t$ for $a_1,...,a_n, t \\in \\mathbb{Z}$ and modulo prdicates of\nthe form $\\sum_{i=1}^n a_i \\cdot x_i \\bmod m \\geq t $ for $a_1, \\ldots, a_n, m,\nt \\in \\mathbb{N}$. We design robust protocols for all threshold and modulo\npredicates. We also show that, unfortunately, the techniques in the literature\nthat construct a protocol for a Boolean combination of predicates given\nprotocols for the conjuncts do not preserve robustness. So the question remains\nopen.\n","subjects":["Computer Science/Formal Languages and Automata Theory","Computer Science/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"jEhYnDGXbDtcYxXzbZIrg7c41mEdKBfJQ53XTkUoIFo","pdfSize":"629069"}