{"id":"2412.19615","title":"The Key Steps and Distinct Performance Trends of Pyrrolic vs. Pyridinic\n  M-N-C Catalysts in Electrocatalytic Nitrate Reduction","authors":"Qiuling Jiang, Mingyao Gu, Tianyi Wang, Fangzhou Liu, Xin Yang, Di\n  Zhang, Zhijian Wu, Ying Wang, Li Wei, Hao Li","authorsParsed":[["Jiang","Qiuling",""],["Gu","Mingyao",""],["Wang","Tianyi",""],["Liu","Fangzhou",""],["Yang","Xin",""],["Zhang","Di",""],["Wu","Zhijian",""],["Wang","Ying",""],["Wei","Li",""],["Li","Hao",""]],"versions":[{"version":"v1","created":"Fri, 27 Dec 2024 12:23:09 GMT"}],"updateDate":"2024-12-30","timestamp":1735302189000,"abstract":"  Electrochemical nitrate reduction reaction(NO3RR)offers a sustainable route\nfor ambient ammonia synthesis. While metal-nitrogen-carbon (M-N-C) single-atom\ncatalysts have emerged as promising candidates for NO3RR, the\nstructure-activity relations underlying their catalytic behavior remain to be\nelucidated. Through systematic analysis of reported experimental data and\npH-field coupled microkinetic modelling on a reversible hydrogen electrode\n(RHE) scale, we reveal that the coordination-dependent activity originates from\ndistinct scaling relations governed by metal-intermediate interactions.\nM-N-Pyrrolic catalysts demonstrate higher turnover frequencies for ammonia\nproduction, whereas M-N-Pyridinic catalysts exhibit broader activity ranges\nacross the activity volcano plot. Meanwhile, the adsorption and protonation of\nnitrate, which is a step often dismissed and/or assumed to be simultaneous in\nmany previous reports, is identified to be the rate-determining step (RDS) in\nNO3RR. Remarkably, our subsequent experimental validation confirms the\ntheoretical predictions under both neutral and alkaline conditions. This study\noffers a comprehensive mechanistic framework for interpreting the\nelectrocatalytic activity of M-N-C catalysts in NO3RR, showing that a classical\nthermodynamic limiting-potential model is not sufficiently accurate to capture\nthe RDS and the catalytic performance trends of different materials (even on\nM-N-Pyrrolic and M-N-Pyridinic catalysts). These findings provide brand new\ninsights into the reaction mechanism of NO3RR and establish fundamental design\nprinciples for electrocatalytic ammonia synthesis.\n","subjects":["Physics/Chemical Physics","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"rgtBNMHmzgtoK452_M-EaF4EW8ySOLXI0goIKI50Cz8","pdfSize":"2928523"}