{"id":"2412.21081","title":"The FlEye camera: Sampling the joint distribution of natural scenes and\n  motion","authors":"Charles J. Edelson, Paul Smith, Sima Setayeshgar, William Bialek, and\n  Rob R. de Ruyter van Steveninck","authorsParsed":[["Edelson","Charles J.",""],["Smith","Paul",""],["Setayeshgar","Sima",""],["Bialek","William",""],["van Steveninck","Rob R. de Ruyter",""]],"versions":[{"version":"v1","created":"Mon, 30 Dec 2024 16:59:53 GMT"}],"updateDate":"2024-12-31","timestamp":1735577993000,"abstract":"  To make efficient use of limited physical resources, the brain must match its\ncoding and computational strategies to the statistical structure of input\nsignals. An attractive testing ground for these principles is the problem of\nmotion estimation in the fly visual system: we understand the optics of the\ncompound eye, have a quantitative description of input signals and noise from\nthe retina, and can record from output neurons that encode estimates of\ndifferent velocity components. Furthermore, recent work provides a nearly\ncomplete wiring diagram of the intervening circuitry. What is missing is a\ncharacterization of the visual signals and motions that flies encounter in a\nnatural context. We attack this directly with the development of a specialized\ncamera that matches the high temporal resolution, optical properties, and\nspectral sensitivity of the fly's eye; inertial motion sensors provide ground\ntruth about rotations and translations through the world. We describe the\ndesign, construction, and performance characteristics of this FlEye camera. To\nillustrate the opportunities created by this instrument we use data on movies\nand motion to construct optimal local motion estimators that can be compared\nwith the responses of the fly's motion sensitive neurons.\n","subjects":["Quantitative Biology/Neurons and Cognition","Condensed Matter/Disordered Systems and Neural Networks"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"iVMylTBXHnxG0VNB1e_KtxUBN-6sknqr7WElyoJk8FY","pdfSize":"3772586"}