{"id":"2412.17147","title":"A diffuse-interface model for predicting the evolution of metallic\n  negative electrodes and interfacial voids in solid-state batteries with\n  homogeneous and polycrystalline solid electrolyte separators","authors":"Sourav Chatterjee, Michael Tonks, William Gardner, Marina Sessim","authorsParsed":[["Chatterjee","Sourav",""],["Tonks","Michael",""],["Gardner","William",""],["Sessim","Marina",""]],"versions":[{"version":"v1","created":"Sun, 22 Dec 2024 20:03:52 GMT"}],"updateDate":"2024-12-24","timestamp":1734897832000,"abstract":"  This paper presents a novel diffuse-interface electrochemical model that\nsimultaneously simulates the evolution of the metallic negative electrode and\ninterfacial voids during the stripping and plating processes in solid-state\nbatteries. The utility and validity of this model are demonstrated for the\nfirst time on a cell with a sodium (Na) negative electrode and a\nNa-$\\beta^{\\prime\\prime}$-alumina ceramic solid electrolyte (SE) separator.\nThree examples are simulated. First, stripping and plating with a perfect\nelectrode/electrolyte interface; second, stripping and plating with a single\ninterfacial void at the electrode/electrolyte interface; third, stripping with\nmultiple interfacial voids. Both homogeneous SE properties and polycrystalline\nSEs with either low or high conductivity grain boundaries (GBs) are considered\nfor all three examples. Heterogeneous GB conductivity has no significant impact\non the behavior with a perfect electrode/electrolyte interface. However, it\ndoes result in local changes to void growth due to interactions between the\nvoid edge and the GBs. The void growth rate is a linear function of the flux of\nNa atoms at the void edge, which in turn depends on the applied current\ndensity. We also show that the void coalescence rate increases with applied\ncurrent density and can be marginally influenced by GB conductivity.\n","subjects":["Condensed Matter/Materials Science","Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"35oWFjMTdF_l2vuPzsH26662x1HVHsZnGktSk8UeVjk","pdfSize":"12766053"}