{
  "id": "2412.03977",
  "title": "To bounce or not to bounce in generalized Proca theory and beyond",
  "authors": "Lara Bohnenblust, Serena Giardino, Lavinia Heisenberg, Nadine\n  Nussbaumer",
  "authorsParsed": [
    [
      "Bohnenblust",
      "Lara",
      ""
    ],
    [
      "Giardino",
      "Serena",
      ""
    ],
    [
      "Heisenberg",
      "Lavinia",
      ""
    ],
    [
      "Nussbaumer",
      "Nadine",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 08:53:18 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 25 Feb 2025 17:02:45 GMT"
    }
  ],
  "updateDate": "2025-02-26",
  "timestamp": 1733388798000,
  "abstract": "  It is notoriously difficult to construct a stable non-singular bouncing\ncosmology that avoids all possible instabilities throughout the entire\nevolution of the universe. In this work, we explore whether a non-singular\nbounce driven by a specific class of modifications of General Relativity, the\nvector-tensor generalized Proca theories, can be constructed without\nencountering any pathologies in linear perturbation theory. We find that such\nmodels unavoidably lead either to strong coupling in the tensor or the scalar\nsector, or instabilities in the matter sector during the bouncing phase. As our\nanalysis is performed in a gauge-independent way, this result can be cast in\nthe form of a no-go theorem for non-singular bounces with generalized Proca. In\ncontrast to the no-go theorem found for Horndeski theories, however, it cannot\nbe evaded by considering beyond generalized Proca theory. At the core of our\nresult lies the non-dynamical nature of the temporal component of the vector\nfield, which renders it an ill-suited mediator for a bouncing solution.\n",
  "subjects": [
    "Physics/General Relativity and Quantum Cosmology",
    "Astrophysics/Cosmology and Nongalactic Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "6QHaQ5es2fPjSWqWKjwhr2wBd4wG8pOhaWc0hAHO2eY",
  "pdfSize": "500490"
}