{
  "id": "2412.14670",
  "title": "Analysis and Visualization of Linguistic Structures in Large Language\n  Models: Neural Representations of Verb-Particle Constructions in BERT",
  "authors": "Hassane Kissane, Achim Schilling, Patrick Krauss",
  "authorsParsed": [
    [
      "Kissane",
      "Hassane",
      ""
    ],
    [
      "Schilling",
      "Achim",
      ""
    ],
    [
      "Krauss",
      "Patrick",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 09:21:39 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734600099000,
  "abstract": "  This study investigates the internal representations of verb-particle\ncombinations within transformer-based large language models (LLMs),\nspecifically examining how these models capture lexical and syntactic nuances\nat different neural network layers. Employing the BERT architecture, we analyse\nthe representational efficacy of its layers for various verb-particle\nconstructions such as 'agree on', 'come back', and 'give up'. Our methodology\nincludes a detailed dataset preparation from the British National Corpus,\nfollowed by extensive model training and output analysis through techniques\nlike multi-dimensional scaling (MDS) and generalized discrimination value (GDV)\ncalculations. Results show that BERT's middle layers most effectively capture\nsyntactic structures, with significant variability in representational accuracy\nacross different verb categories. These findings challenge the conventional\nuniformity assumed in neural network processing of linguistic elements and\nsuggest a complex interplay between network architecture and linguistic\nrepresentation. Our research contributes to a better understanding of how deep\nlearning models comprehend and process language, offering insights into the\npotential and limitations of current neural approaches to linguistic analysis.\nThis study not only advances our knowledge in computational linguistics but\nalso prompts further research into optimizing neural architectures for enhanced\nlinguistic precision.\n",
  "subjects": [
    "Computer Science/Computation and Language",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "5mHVmmdIsXzbZ1vBIntsk9vGIMozLkCf0VdHGrVZ2PE",
  "pdfSize": "1681688"
}