{
  "id": "2412.06235",
  "title": "VariFace: Fair and Diverse Synthetic Dataset Generation for Face\n  Recognition",
  "authors": "Michael Yeung, Toya Teramoto, Songtao Wu, Tatsuo Fujiwara, Kenji\n  Suzuki, Tamaki Kojima",
  "authorsParsed": [
    [
      "Yeung",
      "Michael",
      ""
    ],
    [
      "Teramoto",
      "Toya",
      ""
    ],
    [
      "Wu",
      "Songtao",
      ""
    ],
    [
      "Fujiwara",
      "Tatsuo",
      ""
    ],
    [
      "Suzuki",
      "Kenji",
      ""
    ],
    [
      "Kojima",
      "Tamaki",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 06:21:11 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733725271000,
  "abstract": "  The use of large-scale, web-scraped datasets to train face recognition models\nhas raised significant privacy and bias concerns. Synthetic methods mitigate\nthese concerns and provide scalable and controllable face generation to enable\nfair and accurate face recognition. However, existing synthetic datasets\ndisplay limited intraclass and interclass diversity and do not match the face\nrecognition performance obtained using real datasets. Here, we propose\nVariFace, a two-stage diffusion-based pipeline to create fair and diverse\nsynthetic face datasets to train face recognition models. Specifically, we\nintroduce three methods: Face Recognition Consistency to refine demographic\nlabels, Face Vendi Score Guidance to improve interclass diversity, and\nDivergence Score Conditioning to balance the identity preservation-intraclass\ndiversity trade-off. When constrained to the same dataset size, VariFace\nconsiderably outperforms previous synthetic datasets (0.9200 $\\rightarrow$\n0.9405) and achieves comparable performance to face recognition models trained\nwith real data (Real Gap = -0.0065). In an unconstrained setting, VariFace not\nonly consistently achieves better performance compared to previous synthetic\nmethods across dataset sizes but also, for the first time, outperforms the real\ndataset (CASIA-WebFace) across six evaluation datasets. This sets a new\nstate-of-the-art performance with an average face verification accuracy of\n0.9567 (Real Gap = +0.0097) across LFW, CFP-FP, CPLFW, AgeDB, and CALFW\ndatasets and 0.9366 (Real Gap = +0.0380) on the RFW dataset.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "F5gW2USCNVJ9hkyn7fyAfp5WWYedBd3wqKS_7UlO2jo",
  "pdfSize": "3633219"
}