{
  "id": "2412.14801",
  "title": "Extending TWIG: Zero-Shot Predictive Hyperparameter Selection for KGEs\n  based on Graph Structure",
  "authors": "Jeffrey Sardina, John D. Kelleher, Declan O'Sullivan",
  "authorsParsed": [
    [
      "Sardina",
      "Jeffrey",
      ""
    ],
    [
      "Kelleher",
      "John D.",
      ""
    ],
    [
      "O'Sullivan",
      "Declan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 12:47:21 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734612441000,
  "abstract": "  Knowledge Graphs (KGs) have seen increasing use across various domains --\nfrom biomedicine and linguistics to general knowledge modelling. In order to\nfacilitate the analysis of knowledge graphs, Knowledge Graph Embeddings (KGEs)\nhave been developed to automatically analyse KGs and predict new facts based on\nthe information in a KG, a task called \"link prediction\". Many existing studies\nhave documented that the structure of a KG, KGE model components, and KGE\nhyperparameters can significantly change how well KGEs perform and what\nrelationships they are able to learn. Recently, the Topologically-Weighted\nIntelligence Generation (TWIG) model has been proposed as a solution to\nmodelling how each of these elements relate. In this work, we extend the\nprevious research on TWIG and evaluate its ability to simulate the output of\nthe KGE model ComplEx in the cross-KG setting. Our results are twofold. First,\nTWIG is able to summarise KGE performance on a wide range of hyperparameter\nsettings and KGs being learned, suggesting that it represents a general\nknowledge of how to predict KGE performance from KG structure. Second, we show\nthat TWIG can successfully predict hyperparameter performance on unseen KGs in\nthe zero-shot setting. This second observation leads us to propose that, with\nadditional research, optimal hyperparameter selection for KGE models could be\ndetermined in a pre-hoc manner using TWIG-like methods, rather than by using a\nfull hyperparameter search.\n",
  "subjects": [
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "lh-HCnLHRR-CJYYqFzaohVkyaPE1f4mYTukjGQnuXQo",
  "pdfSize": "1095991"
}