{"id":"2412.10795","title":"Reliable and superior elliptic Fourier descriptor normalization and its\n  application software ElliShape with efficient image processing","authors":"Hui Wu (1,2,3,4), Jia-Jie Yang (1,3,4), Chao-Qun Li (5), Jin-Hua Ran\n  (2,4,6), Ren-Hua Peng (6,7) and Xiao-Quan Wang (1,2,3,4,6) ((1) Big Data and\n  AI Biodiversity Conservation Research Center, Institute of Botany, Chinese\n  Academy of Sciences, Beijing, China (2) State Key Laboratory of Plant\n  Diversity and Specialty Crops and Key Laboratory of Systematic and\n  Evolutionary Botany, Institute of Botany, Chinese Academy of Sciences,\n  Beijing, China (3) Plant Science Data Center, Chinese Academy of Sciences,\n  Beijing, China (4) China National Botanical Garden, Beijing, China (5) School\n  of Life Sciences, Qilu Normal University, Jinan, China (6) University of\n  Chinese Academy of Sciences, Beijing, China (7) Key Laboratory of Noise and\n  Vibration Control, Institute of Acoustics, Chinese Academy of Sciences,\n  Beijing, China)","authorsParsed":[["Wu","Hui",""],["Yang","Jia-Jie",""],["Li","Chao-Qun",""],["Ran","Jin-Hua",""],["Peng","Ren-Hua",""],["Wang","Xiao-Quan",""]],"versions":[{"version":"v1","created":"Sat, 14 Dec 2024 11:14:05 GMT"}],"updateDate":"2024-12-17","timestamp":1734174845000,"abstract":"  Elliptic Fourier analysis (EFA) is a powerful tool for shape analysis, which\nis often employed in geometric morphometrics. However, the normalization of\nelliptic Fourier descriptors has persistently posed challenges in obtaining\nunique results in basic contour transformations, requiring extensive manual\nalignment. Additionally, contemporary contour/outline extraction methods often\nstruggle to handle complex digital images. Here, we reformulated the procedure\nof EFDs calculation to improve computational efficiency and introduced a novel\napproach for EFD normalization, termed true EFD normalization, which remains\ninvariant under all basic contour transformations. These improvements are\ncrucial for processing large sets of contour curves collected from different\nplatforms with varying transformations. Based on these improvements, we\ndeveloped ElliShape, a user-friendly software. Particularly, the improved\ncontour/outline extraction employs an interactive approach that combines\nautomatic contour generation for efficiency with manual correction for\nessential modifications and refinements. We evaluated ElliShape's stability,\nrobustness, and ease of use by comparing it with existing software using\nstandard datasets. ElliShape consistently produced reliable reconstructed\nshapes and normalized EFD values across different contours and transformations,\nand it demonstrated superior performance in visualization and efficient\nprocessing of various digital images for contour analysis.The output annotated\nimages and EFDs could be utilized in deep learning-based data training, thereby\nadvancing artificial intelligence in botany and offering innovative solutions\nfor critical challenges in biodiversity conservation, species classification,\necosystem function assessment, and related critical issues.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Quantitative Biology/Quantitative Methods"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"RxFngw7E0rqQXRrt8N46gB1jBQYNYfK34-O1ht_gDoc","pdfSize":"4174956"}