{"id":"2412.08341","title":"ALoRE: Efficient Visual Adaptation via Aggregating Low Rank Experts","authors":"Sinan Du, Guosheng Zhang, Keyao Wang, Yuanrui Wang, Haixiao Yue, Gang\n  Zhang, Errui Ding, Jingdong Wang, Zhengzhuo Xu, Chun Yuan","authorsParsed":[["Du","Sinan",""],["Zhang","Guosheng",""],["Wang","Keyao",""],["Wang","Yuanrui",""],["Yue","Haixiao",""],["Zhang","Gang",""],["Ding","Errui",""],["Wang","Jingdong",""],["Xu","Zhengzhuo",""],["Yuan","Chun",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 12:31:30 GMT"}],"updateDate":"2024-12-12","timestamp":1733920290000,"abstract":"  Parameter-efficient transfer learning (PETL) has become a promising paradigm\nfor adapting large-scale vision foundation models to downstream tasks. Typical\nmethods primarily leverage the intrinsic low rank property to make\ndecomposition, learning task-specific weights while compressing parameter size.\nHowever, such approaches predominantly manipulate within the original feature\nspace utilizing a single-branch structure, which might be suboptimal for\ndecoupling the learned representations and patterns. In this paper, we propose\nALoRE, a novel PETL method that reuses the hypercomplex parameterized space\nconstructed by Kronecker product to Aggregate Low Rank Experts using a\nmulti-branch paradigm, disentangling the learned cognitive patterns during\ntraining. Thanks to the artful design, ALoRE maintains negligible extra\nparameters and can be effortlessly merged into the frozen backbone via\nre-parameterization in a sequential manner, avoiding additional inference\nlatency. We conduct extensive experiments on 24 image classification tasks\nusing various backbone variants. Experimental results demonstrate that ALoRE\noutperforms the full fine-tuning strategy and other state-of-the-art PETL\nmethods in terms of performance and parameter efficiency. For instance, ALoRE\nobtains 3.06% and 9.97% Top-1 accuracy improvement on average compared to full\nfine-tuning on the FGVC datasets and VTAB-1k benchmark by only updating 0.15M\nparameters.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"jQHDCnKqElOin3mGi-U6pH0gZ3ZLDujb-E5E9VER1q4","pdfSize":"5058233"}