{
  "id": "2412.07491",
  "title": "The S2 orbit and tidally disrupted binaries: indications for collisional\n  depletion in the Galactic center",
  "authors": "Yotam Ashkenazy (IASA) and Shmuel Balberg (HUJI)",
  "authorsParsed": [
    [
      "Ashkenazy",
      "Yotam",
      "",
      "IASA"
    ],
    [
      "Balberg",
      "Shmuel",
      "",
      "HUJI"
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 13:17:39 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733836659000,
  "abstract": "  The properties of the stellar cluster surrounding Sagittarius A* can be\nassessed indirectly through the motion of the S-stars. Specifically, the\ncurrent accuracy to which the prograde precession of the S2 star is measured\nallows to place significant constraints on the extended mass enclosed by its\norbit. We suggest that high velocity destructive collisions (DCs) offer a\nnatural mechanism for depleting the mass inside the S2 orbit, thus allowing to\nreconcile the measured precession and the existence of a dense stellar cluster.\nSuch a solution is especially necessary when considering that stars are\nsupplied to the inner part of the cluster by both dynamical relaxation and by\nstars being captured in tight orbits during tidal disruption of binaries. We\nuse analytic arguments and results from simulations to demonstrate that in\norder to obtain a precession that is consistent with observations, collisional\ndepletion is necessary if the capture rate is greater than a few $10^{-6}\nyr^{-1}$. We also show that fluctuations arising from the finite number of\nstars cannot serve as an alternative to DCs for generating consistency with the\nobserved S2 precession. We conclude that astrometric observations of the\nS-stars provide a meaningful indication that the inner part of our galactic\ncenter is shaped by collisional depletion, supporting the hypothesis that DCs\noccur in galactic nuclei at an astrophysically significant rate.\n",
  "subjects": [
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "_52hbJhHdfySlrGPjwkJFYpy8PO2cxCDU9YajGuwrYU",
  "pdfSize": "341243"
}