{"id":"2412.05117","title":"Transformers Can Navigate Mazes With Multi-Step Prediction","authors":"Niklas Nolte, Ouail Kitouni, Adina Williams, Mike Rabbat, Mark Ibrahim","authorsParsed":[["Nolte","Niklas",""],["Kitouni","Ouail",""],["Williams","Adina",""],["Rabbat","Mike",""],["Ibrahim","Mark",""]],"versions":[{"version":"v1","created":"Fri, 6 Dec 2024 15:19:10 GMT"},{"version":"v2","created":"Wed, 18 Dec 2024 17:16:23 GMT"}],"updateDate":"2024-12-19","timestamp":1733498350000,"abstract":"  Despite their remarkable success in language modeling, transformers trained\nto predict the next token in a sequence struggle with long-term planning. This\nlimitation is particularly evident in tasks requiring foresight to plan\nmultiple steps ahead such as maze navigation. The standard next single token\nprediction objective, however, offers no explicit mechanism to predict multiple\nsteps ahead - or revisit the path taken so far. Consequently, in this work we\nstudy whether explicitly predicting multiple steps ahead (and backwards) can\nimprove transformers' maze navigation. We train parameter-matched transformers\nfrom scratch, under identical settings, to navigate mazes of varying types and\nsizes with standard next token prediction and MLM-U, an objective explicitly\npredicting multiple steps ahead and backwards. We find that MLM-U considerably\nimproves transformers' ability to navigate mazes compared to standard next\ntoken prediction across maze types and complexities. We also find MLM-U\ntraining is 4x more sample efficient and converges 2x faster in terms of GPU\ntraining hours relative to next token training. Finally, for more complex mazes\nwe find MLM-U benefits from scaling to larger transformers. Remarkably, we find\ntransformers trained with MLM-U outperform larger transformers trained with\nnext token prediction using additional supervision from A* search traces. We\nhope these findings underscore the promise of learning objectives to advance\ntransformers' capacity for long-term planning. The code can be found at\nhttps://github.com/facebookresearch/maze_navigation_MLMU\n","subjects":["Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"3_YlnzkYQkZBnvVbrY8OaKE9SfPav69t3uIhCCTu3Ec","pdfSize":"2344935"}