{"id":"2412.00079","title":"WGC as WCCC protector: The Synergistic Effects of various Parameters in\n  Identifying WGC candidate Models","authors":"Mohammad Ali S. Afshar, Jafar Sadeghi","authorsParsed":[["Afshar","Mohammad Ali S.",""],["Sadeghi","Jafar",""]],"versions":[{"version":"v1","created":"Tue, 26 Nov 2024 19:45:08 GMT"},{"version":"v2","created":"Thu, 2 Jan 2025 13:31:54 GMT"}],"updateDate":"2025-01-03","timestamp":1732650308000,"abstract":"  The integration of non-commutative geometry and Gauss-Bonnet corrections in\nan action and the study of their black hole responses can provide highly\nintriguing insights. Our primary motivation for this study is to understand the\ninterplay of these two parameters on the geodesics of spacetime, including\nphoton spheres and time-like orbits. In this study, we found that this\nintegration, in its initial form, can limit the value of the Gauss-Bonnet\nparameter ($\\alpha$), creating a critical threshold beyond which changes in the\nnon-commutative parameter ($\\Xi$) become ineffective, and the structure can\nonly manifest as a naked singularity. Furthermore, we found that using a more\ncomplex model, which includes additional factors such as a cloud of strings and\nlinear charge, as a sample for studying spacetime geodesics, yield different\nand varied results. In this scenario, negative $\\alpha$ values can also play a\nrole, notably preserving the black hole form even with a super-extremal charge\n($q > m$). For $\\alpha> 0.1$, the black hole mass parameter becomes\nsignificantly influential, with a critical mass below which the impact of other\nparameter changes is nullified. Interestingly, considering a more massive black\nhole, this high-mass state also maintains its black hole form within the\nsuper-extremal charge range. The existence of these two models led us to our\nmain goal. By examining the temperature for these two cases, we find that both\nsituations are suitable for studying the WGC. Finally, based on the behavior of\nthese two models, we will explain how the WGC acts as a logical solution and a\nprotector for the WCCC.\n","subjects":["Physics/General Physics","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"1nehzd7SAm3O6w2D61YQ6B2CiT9MuAOlBR99a9wR-KQ","pdfSize":"1144558"}