{
  "id": "2412.09483",
  "title": "Early Detection of At-Risk Students Using Machine Learning",
  "authors": "Azucena L. Jimenez Martinez, Kanika Sood, Rakeshkumar Mahto",
  "authorsParsed": [
    [
      "Martinez",
      "Azucena L. Jimenez",
      ""
    ],
    [
      "Sood",
      "Kanika",
      ""
    ],
    [
      "Mahto",
      "Rakeshkumar",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 17:33:06 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1734024786000,
  "abstract": "  This research presents preliminary work to address the challenge of\nidentifying at-risk students using supervised machine learning and three unique\ndata categories: engagement, demographics, and performance data collected from\nFall 2023 using Canvas and the California State University, Fullerton\ndashboard. We aim to tackle the persistent challenges of higher education\nretention and student dropout rates by screening for at-risk students and\nbuilding a high-risk identification system. By focusing on previously\noverlooked behavioral factors alongside traditional metrics, this work aims to\naddress educational gaps, enhance student outcomes, and significantly boost\nstudent success across disciplines at the University. Pre-processing steps take\nplace to establish a target variable, anonymize student information, manage\nmissing data, and identify the most significant features. Given the mixed data\ntypes in the datasets and the binary classification nature of this study, this\nwork considers several machine learning models, including Support Vector\nMachines (SVM), Naive Bayes, K-nearest neighbors (KNN), Decision Trees,\nLogistic Regression, and Random Forest. These models predict at-risk students\nand identify critical periods of the semester when student performance is most\nvulnerable. We will use validation techniques such as train test split and\nk-fold cross-validation to ensure the reliability of the models. Our analysis\nindicates that all algorithms generate an acceptable outcome for at-risk\nstudent predictions, while Naive Bayes performs best overall.\n",
  "subjects": [
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "xLlPIvmnU_WbrZKI3gjgp17IIo5mGJDaGZNfg58BwKw",
  "pdfSize": "279376"
}