{"id":"2412.20288","title":"Simultaneous imaging of bidirectional guided waves enables synchronous\n  probing of mechanical anisotropy, local blood pressure, and stress in\n  arteries","authors":"Yuxuan Jiang, Guo-Yang Li, Keshuai Hu, Shiyu Ma, Yang Zheng, Mingwei\n  Jiang, Zhaoyi Zhang, Xinyu Wang, Yanping Cao","authorsParsed":[["Jiang","Yuxuan",""],["Li","Guo-Yang",""],["Hu","Keshuai",""],["Ma","Shiyu",""],["Zheng","Yang",""],["Jiang","Mingwei",""],["Zhang","Zhaoyi",""],["Wang","Xinyu",""],["Cao","Yanping",""]],"versions":[{"version":"v1","created":"Sat, 28 Dec 2024 21:50:41 GMT"}],"updateDate":"2024-12-31","timestamp":1735422641000,"abstract":"  Arterial biomechanical indicators have long been recognized as fundamental\ncontributors to the physiology and pathology of cardiovascular systems. Probing\nthe multiple biomechanical parameters of arteries simultaneously at different\ntime points within one cardiac cycle is of great importance but remains\nchallenging. Here we report an ultrasound elastography method to quantify\narterial anisotropic stiffness, mechanical stresses in arterial wall, and local\nblood pressure in a single measurement. With programmed acoustic radiation\nforce, arterial axial and circumferential guided elastic waves were induced\nsimultaneously and recorded at multiple time points within one cardiac cycle.\nThen a mechanical model incorporating acoustoelasticity and viscoelasticity of\narteries was proposed to quantitatively predict the correlation of arterial\nguided elastic waves with arterial biomechanical parameters. Our experimental\ndesign and biomechanical model lead to an elastography method to interrogate\nthe variation of blood pressure, arterial bidirectional stiffnesses and\nmechanical stresses in arterial walls with time. In vivo experiments were\nperformed on healthy young, normotensive older and hypertensive older\nvolunteers. The results demonstrate that the reported method can find\napplications in understanding aging of cardiovascular system and diagnosis of\ncardiovascular diseases.\n","subjects":["Physics/Medical Physics","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"ble3cMN50atRxRxdyllS-NUdbcWg4XzfeKWgQ45nSTI","pdfSize":"8763485"}