{"id":"2412.14721","title":"An upper pressure limit for low-Z benign termination of runaway electron\n  beams in TCV","authors":"M Hoppe, J Decker, U Sheikh, S Coda, C Colandrea, B Duval, O Ficker, P\n  Halldestam, S Jachmich, M Lehnen, H Reimerdes, C Paz-Soldan, M Pedrini, C\n  Reux, L Simons, B Vincent, T Wijkamp, M Zurita, the TCV team, the EUROfusion\n  Tokamak Exploitation Team","authorsParsed":[["Hoppe","M",""],["Decker","J",""],["Sheikh","U",""],["Coda","S",""],["Colandrea","C",""],["Duval","B",""],["Ficker","O",""],["Halldestam","P",""],["Jachmich","S",""],["Lehnen","M",""],["Reimerdes","H",""],["Paz-Soldan","C",""],["Pedrini","M",""],["Reux","C",""],["Simons","L",""],["Vincent","B",""],["Wijkamp","T",""],["Zurita","M",""],["team","the TCV",""],["Team","the EUROfusion Tokamak Exploitation",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 10:43:24 GMT"}],"updateDate":"2024-12-20","timestamp":1734605004000,"abstract":"  We present a model for the particle balance in the post-disruption runaway\nelectron plateau phase of a tokamak discharge. The model is constructed with\nthe help of, and applied to, experimental data from TCV discharges\ninvestigating the so-called \"low-Z benign termination\" runaway electron\nmitigation scheme. In the benign termination scheme, the free electron density\nis first reduced in order for a subsequently induced MHD instability to grow\nrapidly and spread the runaway electrons widely across the wall. The model\nexplains why there is an upper limit for the neutral pressure above which the\ntermination is not benign. We are also able to show that the observed\nnon-monotonic dependence of the free electron density with the measured neutral\npressure is due to plasma re-ionization induced by runaway electron impact\nionization. At higher neutral pressures, more target particles are present in\nthe plasma for runaway electrons to collide with and ionize. Parameter scans\nare conducted to clarify the role of the runaway electron density and energy on\nthe upper pressure limit, and it is found that only the runaway electron\ndensity has a noticeable impact.\n","subjects":["Physics/Plasma Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"TvQLwzieqw6fI2qdRD1Zd9OyZXiMsVTa4XM-zCCjVqw","pdfSize":"841215"}