{"id":"2412.09092","title":"Molecular chemistry induced by J-shock toward supernova remnant W51C","authors":"Tian-Yu Tu, Valentine Wakelam, Yang Chen, Ping Zhou, Qian-Qian Zhang","authorsParsed":[["Tu","Tian-Yu",""],["Wakelam","Valentine",""],["Chen","Yang",""],["Zhou","Ping",""],["Zhang","Qian-Qian",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 09:21:11 GMT"}],"updateDate":"2025-01-22","timestamp":1733995271000,"abstract":"  Shock waves from supernova remnants (SNRs) have strong influence on the\nphysical and chemical properties of molecular clouds (MCs). Shocks propagating\ninto magnetized MCs can be classified into \"jump\" J-shock and \"continuous\"\nC-shock. The molecular chemistry in the re-formed molecular gas behind J-shock\nis still not well understood, which will provide a comprehensive view of the\nchemical feedback of SNRs and the chemical effects of J-shock. We conducted a\nW-band (71.4-89.7 GHz) observation toward a re-formed molecular clump behind a\nJ-shock induced by SNR W51C with the Yebes 40 m radio telescope to study the\nmolecular chemistry in the re-formed molecular gas. Based on the local\nthermodynamic equilibrium (LTE) assumption, we estimate the column densities of\nHCO+, HCN, C2H and o-c-C3H2, and derive the maps of their abundance ratios with\nCO. The gas density is constrained by non-LTE analysis of the HCO+ J=1-0 line.\nWe obtain the following abundance ratios: $N({\\rm HCO^+})/N({\\rm CO})\\sim\n(1.0\\text{--}4.0)\\times 10^{-4}$, $N({\\rm HCN})/N({\\rm CO})\\sim\n(1.8\\text{--}5.3)\\times 10^{-4}$, $N({\\rm C_2H})/N({\\rm CO})\\sim\n(1.6\\text{--}5.0)\\times 10^{-3}$, and $N({o\\text{-}c\\text{-}{\\rm\nC_3H_2}})/N({\\rm CO})\\sim (1.2\\text{--}7.9)\\times 10^{-4}$. The non-LTE\nanalysis suggests that the gas density is $n_{\\rm H_2}\\gtrsim 10^4\\rm \\\ncm^{-3}$. We find that the N(C2H)/N(CO) and N(o-c-C3H2)/N(CO) are higher than\ntypical values in quiescent MCs and shocked MCs by 1-2 orders of magnitude,\nwhich can be qualitatively attributed to the abundant C+ and C at the earliest\nphase of molecular gas re-formation. The Paris-Durham shock code can reproduce,\nalthough not perfectly, the observed abundance ratios, especially the enhanced\nN(C2H)/N(CO) and N(o-c-C3H2)/N(CO), with J-shocks propagating in to both\nnon-irradiated and irradiated molecular gas with a preshock density of $n_{\\rm\nH}=2\\times 10^3\\rm \\ cm^{-3}$.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"3BW0rJGM15oAL5VyAtKK_T34ks0haRigcvX_d0m0YjY","pdfSize":"839251"}