{
  "id": "2412.20508",
  "title": "The balance between paraelectricity and ferroelectricity in non-chiral\n  smectic homologs",
  "authors": "Dorota W\\k{e}g{\\l}owska, Micha{\\l} Czerwi\\'nski, Robert Dzienisiewicz,\n  Pawe{\\l} Perkowski, Jadwiga Szyd{\\l}owska, Damian Pociecha, Mateusz\n  Mrukiewicz",
  "authorsParsed": [
    [
      "Węgłowska",
      "Dorota",
      ""
    ],
    [
      "Czerwiński",
      "Michał",
      ""
    ],
    [
      "Dzienisiewicz",
      "Robert",
      ""
    ],
    [
      "Perkowski",
      "Paweł",
      ""
    ],
    [
      "Szydłowska",
      "Jadwiga",
      ""
    ],
    [
      "Pociecha",
      "Damian",
      ""
    ],
    [
      "Mrukiewicz",
      "Mateusz",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 29 Dec 2024 15:56:36 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 31 Dec 2024 08:18:50 GMT"
    },
    {
      "version": "v3",
      "created": "Thu, 13 Feb 2025 13:29:59 GMT"
    }
  ],
  "updateDate": "2025-02-14",
  "timestamp": 1735487796000,
  "abstract": "  Non-chiral liquid crystals (LCs) exhibiting ferroelectricity, distinguished\nby their dynamic responsiveness to external stimuli and high spontaneous\npolarization, provide renewed impetus for research into this area of soft\nmatter and open novel application possibilities. Consequently, identifying\nstructural elements within LC compounds that promote ferroelectricity in\nnon-chiral systems is of critical importance. In this work, two homologs of\nrod-like compounds, with phenyl and ester groups in the rigid core substituted\nby fluorine atoms, differing by a single methylene unit, were synthesized and\ncomprehensively analyzed using complementary experimental techniques and\nquantum-mechanical modeling. This systematic study presents the first\ndocumented instance in which such a minimal structural modification markedly\ninfluences the polarity of smectic phases in two homologs, without\nsubstantially altering phase transition temperatures, particularly the sequence\nand temperature ranges of smectic and nematic phases. Additionally, findings\nreveal that the longer homolog, which exhibits paraelectric phases,\ndemonstrates a pronounced capacity to maintain ferroelectric phases in\nmixtures. These results provide new insights into the critical\nstructure-property relationships between molecular architecture and\nferroelectric characteristics in LCs, facilitating the targeted design of\nnon-chiral compounds with polar phases. Moreover, the properties of the studied\nmixtures underscore the potential to develop multicomponent LC mixtures with\nstable ferroelectric properties in a broad temperature range, a feature of\nconsiderable significance for practical applications.\n",
  "subjects": [
    "Condensed Matter/Materials Science",
    "Condensed Matter/Soft Condensed Matter"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "mvTfrOa9phWwvdrFIEZzJRL7_0qkJ7ikQjZUzSdpBFY",
  "pdfSize": "2054126"
}