{"id":"2412.09499","title":"A novel ML-fuzzy control system for optimizing PHEV fuel efficiency and\n  extending electric range under diverse driving conditions","authors":"Mehrdad Raeesi, Saba Mansour, Sina Changizian","authorsParsed":[["Raeesi","Mehrdad",""],["Mansour","Saba",""],["Changizian","Sina",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 17:47:19 GMT"}],"updateDate":"2024-12-13","timestamp":1734025639000,"abstract":"  Aiming for a greener transportation future, this study introduces an\ninnovative control system for plug-in hybrid electric vehicles (PHEVs) that\nutilizes machine learning (ML) techniques to forecast energy usage in the pure\nelectric mode of the vehicle and optimize power allocation across different\noperational modes, including pure electric, series hybrid, parallel hybrid, and\ninternal combustion operation. The fuzzy logic decision-making process governs\nthe vehicle control system. The performance was assessed under various driving\nconditions. Key findings include a significant enhancement in pure electric\nmode efficiency, achieving an extended full-electric range of approximately 84\nkilometers on an 80% utilization of a 20-kWh battery pack. During the WLTC\ndriving cycle, the control system reduced fuel consumption to 2.86 L/100km,\nrepresenting a 20% reduction in gasoline-equivalent fuel consumption.\nEvaluations of vehicle performance at discrete driving speeds, highlighted\neffective energy management, with the vehicle battery charging at lower speeds\nand discharging at higher speeds, showing optimized energy recovery and\nconsumption strategies. Initial battery charge levels notably influenced\nvehicle performance. A 90% initial charge enabled prolonged all-electric\noperation, minimizing fuel consumption to 2 L/100km less than that of the base\ncontrol system. Real-world driving pattern analysis revealed significant\nvariations, with shorter, slower cycles requiring lower fuel consumption due to\nprioritized electric propulsion, while longer, faster cycles increased internal\ncombustion engine usage. The control system also adapted to different battery\nstate of health (SOH) conditions, with higher SOH facilitating extended\nelectric mode usage, reducing total fuel consumption by up to 2.87 L/100km.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computer Science/Machine Learning","Computer Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"lOdOfpqkgtpCWZuYtb4zctyacggAByyFdlqTGmwb0zA","pdfSize":"1299089"}