{"id":"2412.13699","title":"Two-qubit gate protocols with microwave-dressed Rydberg ions in a linear\n  Paul trap","authors":"Joseph W. P. Wilkinson, Katrin Bolsmann, Thiago L. M. Guedes, Markus\n  M\\\"uller, Igor Lesanovsky","authorsParsed":[["Wilkinson","Joseph W. P.",""],["Bolsmann","Katrin",""],["Guedes","Thiago L. M.",""],["Müller","Markus",""],["Lesanovsky","Igor",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 10:43:54 GMT"}],"updateDate":"2024-12-23","timestamp":1734518634000,"abstract":"  Ultracold trapped atomic ions excited into highly energetic Rydberg states\nconstitute a promising platform for scalable quantum information processing.\nElementary building blocks for such tasks are high-fidelity and sufficiently\nfast entangling two-qubit gates, which can be achieved via strong dipole-dipole\ninteractions between microwave-dressed Rydberg ions, as recently demonstrated\nin a breakthrough experiment at\nhttps://www.nature.com/articles/s41586-020-2152-9 . We theoretically\ninvestigate the performance of three protocols leading to controlled-phase gate\noperations. Starting from a microscopic description of Rydberg ions in a linear\nPaul trap, we derive an effective Hamiltonian that faithfully captures the\nessential dynamics underlying the gate protocols. We then use an optimization\nscheme to fine-tune experimentally controllable parameters like laser detuning\nand Rabi frequency to yield maximal gate fidelity under each studied protocol.\nWe show how non-adiabatic transitions resulting from fast laser driving\nrelative to the characteristic time scales of the system detrimentally affect\nthe fidelity. Despite this, we demonstrate that in the realistic scenario of\nRydberg ions with finite radiative lifetimes, optimizing the best found gate\nprotocol enables achievement of fidelities as high as $99.25\\,\\%$ for a gate\ntime of $0.2\\,\\mu\\mathrm{s}$. This considerably undercuts entangling gate\ndurations between ground-state ions, for which gate times are typically limited\nby the comparably slower time scales of vibrational modes. Overall, this places\ntrapped Rydberg ions into the regime where fast high-accuracy quantum computing\nand eventually quantum error correction become possible.\n","subjects":["Physics/Quantum Physics","Physics/Atomic Physics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"JA370L2dGqpHWA3dU9AUIrZRAABJfg3A8f57I_vip0U","pdfSize":"1604259"}