{
  "id": "2412.11474",
  "title": "Noise-Resilient Homomorphic Encryption: A Framework for Secure Data\n  Processing in Health care Domain",
  "authors": "B. Shuriya, S. Vimal Kumar, and K. Bagyalakshmi",
  "authorsParsed": [
    [
      "Shuriya",
      "B.",
      ""
    ],
    [
      "Kumar",
      "S. Vimal",
      ""
    ],
    [
      "Bagyalakshmi",
      "K.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 06:26:40 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734330400000,
  "abstract": "  In this paper, we introduce the Fully Homomorphic Integrity Model (HIM), a\nnovel approach designed to enhance security, efficiency, and reliability in\nencrypted data processing, primarily within the health care industry. HIM\naddresses the key challenges that noise accumulation, computational overheads,\nand data integrity pose during homomorphic operations. Our contribution of HIM:\nadvances in noise management through the rational number adjustment; key\ngeneration based on personalized prime numbers; and time complexity analysis\ndetails for key operations. In HIM, some additional mechanisms were introduced,\nincluding robust mechanisms of decryption. Indeed, the decryption mechanism\nensures that the data recovered upon doing complex homomorphic computation will\nbe valid and reliable. The healthcare id model is tested, and it supports\nreal-time processing of data with privacy maintained concerning patients. It\nsupports analytics and decision-making processes without any compromise on the\nintegrity of information concerning patients. Output HIM promotes the\nefficiency of encryption to a greater extent as it reduces the encryption time\nup to 35ms and decryption time up to 140ms, which is better when compared to\nother models in the existence. Ciphertext size also becomes the smallest one,\nwhich is 4KB. Our experiments confirm that HIM is indeed a very efficient and\nsecure privacy-preserving solution for healthcare applications\n",
  "subjects": [
    "Computer Science/Cryptography and Security"
  ],
  "license": "http://creativecommons.org/publicdomain/zero/1.0/",
  "blobId": "H6wzMQ6I8pHz4piV4qnTOKFhn_kgZCm0JwseUvmq_xo",
  "pdfSize": "465882"
}