{
  "id": "2412.10397",
  "title": "Constraining the inner boundaries of COCONUT through plasma \\b{eta} and\n  Alfv\\'en speed",
  "authors": "Michaela Brchnelova and Boris Gudiksen and Mats Carlsson and Andrea\n  Lani and Stefaan Poedts",
  "authorsParsed": [
    [
      "Brchnelova",
      "Michaela",
      ""
    ],
    [
      "Gudiksen",
      "Boris",
      ""
    ],
    [
      "Carlsson",
      "Mats",
      ""
    ],
    [
      "Lani",
      "Andrea",
      ""
    ],
    [
      "Poedts",
      "Stefaan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 14:43:29 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1733150609000,
  "abstract": "  Space weather modelling has been gaining importance due to our increasing\ndependency on technology sensitive to space weather effects, such as satellite\nservices, air traffic and power grids. Improving the reliability, accuracy and\nnumerical performance of space weather modelling tools, including global\ncoronal models, is essential to develop timely and accurate forecasts and to\nhelp partly mitigate the space weather threat. Global corona models, however,\nrequire accurate boundary conditions, for the formulations of which we have\nvery limited observational data. Unsuitable boundary condition prescriptions\nmay lead to inconsistent features in the solution flow field and spoil the\ncode's accuracy and performance. In this paper, we develop an adjustment to the\ninner boundary condition of the COCONUT global corona model to better capture\nthe dynamics over and around the regions of stronger magnetic fields by\nconstraining the plasma \\b{eta} and the Alfv\\'en speed. Using data from solar\nobservations and solar atmospheric modelling codes such as Bifrost, we find\nthat the baseline homogeneous boundary condition formulations for pressure and\ndensity do not capture the plasma conditions physically accurately. We develop\na method to adjust these prescribed pressure and density values by placing\nconstraints on the plasma \\b{eta} and the Alfv\\'en speed that act as proxies.\nWe demonstrate that we can remove inexplicable fast streams from the solution\nby constraining the maximum Alfv\\'en speed and the minimum plasma \\b{eta} on\nthe boundary surface. We also show that the magnetic topology is not\nsignificantly affected by this treatment otherwise. The presented technique\nshows the potential to ease the modelling of solar maxima, especially removing\ninexplicable features while, at the same time, not significantly affecting the\nmagnetic field topology around the affected regions.\n",
  "subjects": [
    "Physics/Space Physics",
    "Astrophysics/Solar and Stellar Astrophysics",
    "Physics/Computational Physics",
    "Physics/Plasma Physics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "LhsKVBg0wD8zrYtG3Ft5zgysx_UL0-yz-OVkYbx9YKc",
  "pdfSize": "2358731"
}