{"id":"2412.07354","title":"Impact of Annealing and Nanostructuring on Properties of NV Centers\n  Created by Different Techniques","authors":"Miriam Mendoza Delgado, Lucas Tsunaki, Shaul Michaelson, Mohan K.\n  Kuntumalla, Johann P. Reithmaier, Alon Hoffman, Boris Naydenov, Cyril Popov","authorsParsed":[["Delgado","Miriam Mendoza",""],["Tsunaki","Lucas",""],["Michaelson","Shaul",""],["Kuntumalla","Mohan K.",""],["Reithmaier","Johann P.",""],["Hoffman","Alon",""],["Naydenov","Boris",""],["Popov","Cyril",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 09:44:55 GMT"},{"version":"v2","created":"Mon, 17 Feb 2025 09:46:36 GMT"}],"updateDate":"2025-02-18","timestamp":1733823895000,"abstract":"  Nitrogen-vacancy (NV) centers in diamonds have been an epicenter of research\nfor diverse applications in quantum technologies. It is therefore imperative\nthat their fabrication techniques are well understood and characterized for the\ntechnological scalability of these applications. A comparative study of the\noptical and spin properties of NVs created by ion implantation and chemical\nvapor deposition delta-doping is thus presented, combined with an investigation\non the impact of annealing in vacuum at different temperatures. In addition,\nnanopillars are fabricated with electron beam lithography and reactive ion\netching for enhanced photon collection efficiency. An extensive combination of\ncharacterization techniques is employed. Notably, the smallest nanopillars\npresent fluorescence enhancements of factor around 50, compared to the\nunstructured regions. Annealing is also demonstrated to increase the optical\ncontrast between the NVs' electronic states, the coherence and relaxation times\nboth in bulk as in pillars. Regarding the NV preparation technique, the\ndelta-doping is shown to create NVs with less lattice defects and strain\ncompared to implantation.\n","subjects":["Physics/Applied Physics","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"ZBk37HDroFVyLuj4Gc7nUcGWKyulG4YPDnGuyaYl8kk","pdfSize":"5499418"}