{"id":"2412.08231","title":"Dynamic Modality-Camera Invariant Clustering for Unsupervised\n  Visible-Infrared Person Re-identification","authors":"Yiming Yang, Weipeng Hu, Haifeng Hu","authorsParsed":[["Yang","Yiming",""],["Hu","Weipeng",""],["Hu","Haifeng",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 09:31:03 GMT"}],"updateDate":"2024-12-12","timestamp":1733909463000,"abstract":"  Unsupervised learning visible-infrared person re-identification (USL-VI-ReID)\noffers a more flexible and cost-effective alternative compared to supervised\nmethods. This field has gained increasing attention due to its promising\npotential. Existing methods simply cluster modality-specific samples and employ\nstrong association techniques to achieve instance-to-cluster or\ncluster-to-cluster cross-modality associations. However, they ignore\ncross-camera differences, leading to noticeable issues with excessive splitting\nof identities. Consequently, this undermines the accuracy and reliability of\ncross-modal associations. To address these issues, we propose a novel Dynamic\nModality-Camera Invariant Clustering (DMIC) framework for USL-VI-ReID.\nSpecifically, our DMIC naturally integrates Modality-Camera Invariant Expansion\n(MIE), Dynamic Neighborhood Clustering (DNC) and Hybrid Modality Contrastive\nLearning (HMCL) into a unified framework, which eliminates both the\ncross-modality and cross-camera discrepancies in clustering. MIE fuses\ninter-modal and inter-camera distance coding to bridge the gaps between\nmodalities and cameras at the clustering level. DNC employs two dynamic search\nstrategies to refine the network's optimization objective, transitioning from\nimproving discriminability to enhancing cross-modal and cross-camera\ngeneralizability. Moreover, HMCL is designed to optimize instance-level and\ncluster-level distributions. Memories for intra-modality and inter-modality\ntraining are updated using randomly selected samples, facilitating real-time\nexploration of modality-invariant representations. Extensive experiments have\ndemonstrated that our DMIC addresses the limitations present in current\nclustering approaches and achieve competitive performance, which significantly\nreduces the performance gap with supervised methods.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"zX-LUxH6TVXR-_hNr6u25ThtDJRicimfCZMiX6eXwtI","pdfSize":"10775208"}