{"id":"2412.14869","title":"AI-Powered Intracranial Hemorrhage Detection: A Co-Scale Convolutional\n  Attention Model with Uncertainty-Based Fuzzy Integral Operator and Feature\n  Screening","authors":"Mehdi Hosseini Chagahi, Md. Jalil Piran, Niloufar Delfan, Behzad\n  Moshiri, Jaber Hatam Parikhan","authorsParsed":[["Chagahi","Mehdi Hosseini",""],["Piran","Md. Jalil",""],["Delfan","Niloufar",""],["Moshiri","Behzad",""],["Parikhan","Jaber Hatam",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 14:06:44 GMT"}],"updateDate":"2024-12-20","timestamp":1734617204000,"abstract":"  Intracranial hemorrhage (ICH) refers to the leakage or accumulation of blood\nwithin the skull, which occurs due to the rupture of blood vessels in or around\nthe brain. If this condition is not diagnosed in a timely manner and\nappropriately treated, it can lead to serious complications such as decreased\nconsciousness, permanent neurological disabilities, or even death.The primary\naim of this study is to detect the occurrence or non-occurrence of ICH,\nfollowed by determining the type of subdural hemorrhage (SDH). These tasks are\nframed as two separate binary classification problems. By adding two layers to\nthe co-scale convolutional attention (CCA) classifier architecture, we\nintroduce a novel approach for ICH detection. In the first layer, after\nextracting features from different slices of computed tomography (CT) scan\nimages, we combine these features and select the 50 components that capture the\nhighest variance in the data, considering them as informative features. We then\nassess the discriminative power of these features using the bootstrap forest\nalgorithm, discarding those that lack sufficient discriminative ability between\ndifferent classes. This algorithm explicitly determines the contribution of\neach feature to the final prediction, assisting us in developing an explainable\nAI model. The features feed into a boosting neural network as a latent feature\nspace. In the second layer, we introduce a novel uncertainty-based fuzzy\nintegral operator to fuse information from different CT scan slices. This\noperator, by accounting for the dependencies between consecutive slices,\nsignificantly improves detection accuracy.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Artificial Intelligence","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"WRYiUnChH0VjWYyjWQ1M9Z1aTBTWeVshrx73gvNVyQU","pdfSize":"4588531"}