{
  "id": "2412.13043",
  "title": "DiFfRG: A Discretisation Framework for functional Renormalisation Group\n  flows",
  "authors": "Franz R. Sattler, Jan M. Pawlowski",
  "authorsParsed": [
    [
      "Sattler",
      "Franz R.",
      ""
    ],
    [
      "Pawlowski",
      "Jan M.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 16:08:06 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734451686000,
  "abstract": "  We introduce DiFfRG (Discretisation Framework for functional Renormalisation\nGroup flows), a comprehensive computational C++ framework for solving\nfunctional Renormalisation Group flows in very general truncation schemes. Its\ncentral features are threefold: Firstly, the use of Finite Element Methods\n(FEM) for efficient, easy to set up and quantitatively reliable computations of\nfield dependences. Secondly, the (simultaneous) setup of large, fully\nmomentum-dependent vertex expansions. Thirdly, efficient time-discretisation\nmethods, incorporating insights from studies of solving theories which exhibit\nspontaneous symmetry breaking, going hand in hand with shocks and an\nexponential increase of the information flow velocity in field space. The\nframework provides a Mathematica package for automatic code generation of flow\nequations, finite and zero temperature integration routines with support for\nGPU hardware and extensive parallelisation capabilities. Detailed examples and\ntutorials are provided and discussed herein which showcase and introduce the\nframework to the user. We illustrate the capabilities of DiFfRG with four\nexamples, with the complete codes fully included: finite temperature O(N)\ntheory, a Quark-Meson model, SU(3) Yang-Mills theory and four-Fermi flows in\nthe QCD phase diagram.\n",
  "subjects": [
    "Physics/High Energy Physics - Phenomenology",
    "Condensed Matter/Statistical Mechanics",
    "Physics/High Energy Physics - Theory",
    "Physics/Computational Physics",
    "Physics/Fluid Dynamics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "wWP-YpVvI8cvg0CyAVabpaEDOb0GUn_Yqd1wf9y3TJk",
  "pdfSize": "2089198"
}