{
  "id": "2412.06125",
  "title": "The Development of Low-Q Cavity Type Beam Position Monitor with a\n  Position Resolution of Nanometer for Future Colliders",
  "authors": "S.W. Jang and E.-S. Kim and T. Tauchi and N. Terunuma and P.N. Burrows\n  and N. Blaskovic Kraljevic and P. Bambade and S. Wallon and O. Blanco",
  "authorsParsed": [
    [
      "Jang",
      "S. W.",
      ""
    ],
    [
      "Kim",
      "E. -S.",
      ""
    ],
    [
      "Tauchi",
      "T.",
      ""
    ],
    [
      "Terunuma",
      "N.",
      ""
    ],
    [
      "Burrows",
      "P. N.",
      ""
    ],
    [
      "Kraljevic",
      "N. Blaskovic",
      ""
    ],
    [
      "Bambade",
      "P.",
      ""
    ],
    [
      "Wallon",
      "S.",
      ""
    ],
    [
      "Blanco",
      "O.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 01:12:19 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733706739000,
  "abstract": "  The nano-meter beam size in future linear colliders requires very high\nresolution beam position monitor since higher resolution allows more accurate\nposition measurement in the interaction point. We developed and tested a low-Q\nC-band beam position monitor with position resolution of nanometer. The C-band\nBPM was tested for the fast beam feedback system at the interaction point of\nATF2 in KEK, in which C-band beam position monitor is called to IPBPM\n(Interaction Point Beam Position Monitor). The average position resolution of\nthe developed IPBPMs was measured to be 10.1 nm at a nominal beam charge of\n$87\\%$ of ATF2. From the measured beam position resolution, we can expect beam\nposition resolution of around 8.8 nm and 4.4 nm with nominal ATF2 and ILC beam\ncharge conditions, respectively, in which the position resolution is below the\nvertical beam size in ILC. In this paper, we describe the development of the\nIPBPM and the beam test results at the nanometer level in beam position\nresolution\n",
  "subjects": [
    "Physics/Accelerator Physics",
    "Physics/High Energy Physics - Experiment"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "G1Yq7wjTUcNx1FpPKzRXXRhPqgCA5077ExGvfEhzLFE",
  "pdfSize": "1578452"
}