{"id":"2412.13857","title":"Diagnosising Helicobacter pylori using AutoEncoders and Limited\n  Annotations through Anomalous Staining Patterns in IHC Whole Slide Images","authors":"Pau Cano, Eva Musulen, Debora Gil","authorsParsed":[["Cano","Pau",""],["Musulen","Eva",""],["Gil","Debora",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 13:52:42 GMT"}],"updateDate":"2024-12-19","timestamp":1734529962000,"abstract":"  Purpose: This work addresses the detection of Helicobacter pylori (H. pylori)\nin histological images with immunohistochemical staining. This analysis is a\ntime demanding task, currently done by an expert pathologist that visually\ninspects the samples. Given the effort required to localise the pathogen in\nimages, a limited number of annotations might be available in an initial\nsetting. Our goal is to design an approach that, using a limited set of\nannotations, is capable of obtaining results good enough to be used as a\nsupport tool. Methods: We propose to use autoencoders to learn the latent\npatterns of healthy patches and formulate a specific measure of the\nreconstruction error of the image in HSV space. ROC analysis is used to set the\noptimal threshold of this measure and the percentage of positive patches in a\nsample that determines the presence of H. pylori. Results: Our method has been\ntested on an own database of 245 Whole Slide Images (WSI) having 117 cases\nwithout H. pylori and different density of the bacteria in the remaining ones.\nThe database has 1211 annotated patches, with only 163 positive patches. This\ndataset of positive annotations was used to train a baseline thresholding and\nan SVM using the features of a pre-trained RedNet18 and ViT models. A 10-fold\ncross-validation shows that our method has better performance with 91%\naccuracy, 86% sensitivity, 96% specificity and 0.97 AUC in the diagnosis of H.\npylori. Conclusion: Unlike classification approaches, our shallow autoencoder\nwith threshold adaptation for the detection of anomalous staining is able to\nachieve competitive results with a limited set of annotated data. This initial\napproach is good enough to be used as a guide for fast annotation of infected\npatches.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computer Science/Computer Vision and Pattern Recognition","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"-pwq6LLgY5LUJVPQLDKdbKfGxrnW6zxNWEgw7002fYk","pdfSize":"2126129"}