{"id":"2412.15904","title":"What Are Step-Level Reward Models Rewarding? Counterintuitive Findings\n  from MCTS-Boosted Mathematical Reasoning","authors":"Yiran Ma, Zui Chen, Tianqiao Liu, Mi Tian, Zhuo Liu, Zitao Liu, Weiqi\n  Luo","authorsParsed":[["Ma","Yiran",""],["Chen","Zui",""],["Liu","Tianqiao",""],["Tian","Mi",""],["Liu","Zhuo",""],["Liu","Zitao",""],["Luo","Weiqi",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 13:56:23 GMT"},{"version":"v2","created":"Sat, 1 Feb 2025 15:17:28 GMT"}],"updateDate":"2025-02-04","timestamp":1734702983000,"abstract":"  Step-level reward models (SRMs) can significantly enhance mathematical\nreasoning performance through process supervision or step-level preference\nalignment based on reinforcement learning. The performance of SRMs is pivotal,\nas they serve as critical guidelines, ensuring that each step in the reasoning\nprocess is aligned with desired outcomes. Recently, AlphaZero-like methods,\nwhere Monte Carlo Tree Search (MCTS) is employed for automatic step-level\npreference annotation, have proven particularly effective. However, the precise\nmechanisms behind the success of SRMs remain largely unexplored. To address\nthis gap, this study delves into the counterintuitive aspects of SRMs,\nparticularly focusing on MCTS-based approaches. Our findings reveal that the\nremoval of natural language descriptions of thought processes has minimal\nimpact on the efficacy of SRMs. Furthermore, we demonstrate that SRMs are adept\nat assessing the complex logical coherence present in mathematical language\nwhile having difficulty in natural language. These insights provide a nuanced\nunderstanding of the core elements that drive effective step-level reward\nmodeling in mathematical reasoning. By shedding light on these mechanisms, this\nstudy offers valuable guidance for developing more efficient and streamlined\nSRMs, which can be achieved by focusing on the crucial parts of mathematical\nreasoning.\n","subjects":["Computer Science/Artificial Intelligence","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"RUFRBXC85J4xrSI25lsm2UTZp8OU6mitJ_5P1A2C_kQ","pdfSize":"1418695"}