{"id":"2412.10627","title":"An Active Parameter Learning Approach to The Identification of Safe\n  Regions","authors":"Aneesh Raghavan and Karl H Johansson","authorsParsed":[["Raghavan","Aneesh",""],["Johansson","Karl H",""]],"versions":[{"version":"v1","created":"Sat, 14 Dec 2024 00:31:10 GMT"}],"updateDate":"2024-12-17","timestamp":1734136270000,"abstract":"  We consider the problem of identification of safe regions in the environment\nof an autonomous system. The environment is divided into a finite collections\nof Voronoi cells, with each cell having a representative, the Voronoi center.\nThe extent to which each region is considered to be safe by an oracle is\ncaptured through a trust distribution. The trust placed by the oracle\nconditioned on the region is modeled through a Bernoulli distribution whose the\nparameter depends on the region. The parameters are unknown to the system.\nHowever, if the agent were to visit a given region, it will receive a binary\nvalued random response from the oracle on whether the oracle trusts the region\nor not. The objective is to design a path for the agent where, by traversing\nthrough the centers of the cells, the agent is eventually able to label each\ncell safe or unsafe. To this end, we formulate an active parameter learning\nproblem with the objective of minimizing visits or stays in potentially unsafe\nregions. The active learning problem is formulated as a finite horizon\nstochastic control problem where the cost function is derived utilizing the\nlarge deviations principle (LDP). The challenges associated with a dynamic\nprogramming approach to solve the problem are analyzed. Subsequently, the\noptimization problem is relaxed to obtain single-step optimization problems for\nwhich closed form solution is obtained. Using the solution, we propose an\nalgorithm for the active learning of the parameters. A relationship between the\ntrust distributions and the label of a cell is defined and subsequently a\nclassification algorithm is proposed to identify the safe regions. We prove\nthat the algorithm identifies the safe regions with finite number of visits to\nunsafe regions. We demonstrate the algorithm through an example.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computer Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"hEZ6ZfxoXt_YmmUXsE63aAtL4_obw3IVF9lUSCBtqdA","pdfSize":"458941"}