{
  "id": "2412.08070",
  "title": "A Novel Multiscale Spatial Phase Estimate with the Structure Multivector",
  "authors": "Brian Knight and Naoki Saito",
  "authorsParsed": [
    [
      "Knight",
      "Brian",
      ""
    ],
    [
      "Saito",
      "Naoki",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 03:32:07 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733887927000,
  "abstract": "  The monogenic signal (MS) was introduced by Felsberg and Sommer, and\nindependently by Larkin under the name vortex operator. It is a two-dimensional\n(2D) analog of the well-known analytic signal, and allows for direct amplitude\nand phase demodulation of (amplitude and phase) modulated images so long as the\nsignal is intrinsically one-dimensional (i1D). Felsberg's PhD dissertation also\nintroduced the structure multivector (SMV), a model allowing for intrinsically\n2D (i2D) structure. While the monogenic signal has become a well-known tool in\nthe image processing community, the SMV is little used, although even in the\ncase of i1D signals it provides a more robust orientation estimation than the\nMS. We argue the SMV is more suitable in standard i1D image feature extraction\ndue to the this improvement, and extend the steerable wavelet frames of Held et\nal. to accommodate the additional features of the SMV. We then propose a novel\nquality map based on local orientation variance that yields a multiscale phase\nestimate which performs well even when SNR $\\ge 1$. The performance is\nevaluated on several synthetic phase estimation tasks as well as on a\nfine-scale fingerprint registration task related to the 2D phase demodulation\nproblem.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Image and Video Processing",
    "Electrical Engineering and Systems Science/Signal Processing"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "TgGfW06BJRVs9kV8XsWb43hjBVbn-wPQHOxDaJcdurc",
  "pdfSize": "2155714"
}