{
  "id": "2412.15237",
  "title": "algoTRIC: Symmetric and asymmetric encryption algorithms for\n  Cryptography -- A comparative analysis in AI era",
  "authors": "Naresh Kshetri, Mir Mehedi Rahman, Md Masud Rana, Omar Faruq Osama,\n  James Hutson",
  "authorsParsed": [
    [
      "Kshetri",
      "Naresh",
      ""
    ],
    [
      "Rahman",
      "Mir Mehedi",
      ""
    ],
    [
      "Rana",
      "Md Masud",
      ""
    ],
    [
      "Osama",
      "Omar Faruq",
      ""
    ],
    [
      "Hutson",
      "James",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 16:25:39 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734020739000,
  "abstract": "  The increasing integration of artificial intelligence (AI) within\ncybersecurity has necessitated stronger encryption methods to ensure data\nsecurity. This paper presents a comparative analysis of symmetric (SE) and\nasymmetric encryption (AE) algorithms, focusing on their role in securing\nsensitive information in AI-driven environments. Through an in-depth study of\nvarious encryption algorithms such as AES, RSA, and others, this research\nevaluates the efficiency, complexity, and security of these algorithms within\nmodern cybersecurity frameworks. Utilizing both qualitative and quantitative\nanalysis, this research explores the historical evolution of encryption\nalgorithms and their growing relevance in AI applications. The comparison of SE\nand AE algorithms focuses on key factors such as processing speed, scalability,\nand security resilience in the face of evolving threats. Special attention is\ngiven to how these algorithms are integrated into AI systems and how they\nmanage the challenges posed by large-scale data processing in multi-agent\nenvironments. Our results highlight that while SE algorithms demonstrate\nhigh-speed performance and lower computational demands, AE algorithms provide\nsuperior security, particularly in scenarios requiring enhanced encryption for\nAI-based networks. The paper concludes by addressing the security concerns that\nencryption algorithms must tackle in the age of AI and outlines future research\ndirections aimed at enhancing encryption techniques for cybersecurity.\n",
  "subjects": [
    "Computer Science/Cryptography and Security"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "jsXVrf5AaIeQK3dOtp5C0_LCgEllkamiGauRszfpNaQ",
  "pdfSize": "1530242"
}