{
  "id": "2412.17927",
  "title": "Late-time tails and mass inflation for the spherically symmetric\n  Einstein-Maxwell-scalar field system",
  "authors": "Onyx Gautam",
  "authorsParsed": [
    [
      "Gautam",
      "Onyx",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 19:34:17 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1734982457000,
  "abstract": "  We establish a decay result in the black hole exterior region of spherically\nsymmetric solutions to the Einstein-Maxwell-scalar field system arising from\ncompactly supported admissible data. Our result allows for large initial data,\nand it is the first decay statement for higher order derivatives of the scalar\nfield.\n  Solutions to this model generically develop a singularity in the black hole\ninterior. Indeed, Luk--Oh (arxiv:1702.05715, arxiv:1702.05716) identify a\ngeneric class of initial data that produces $C^2$-future-inextendible\nsolutions. However, they leave open the question of mass inflation: does the\nHawking mass become identically infinite at the Cauchy horizon? By work of\nLuk--Oh--Shlapentokh-Rothman (arxiv:2201.12294), our decay result implies mass\ninflation for sufficiently regular solutions in the generic class considered by\nLuk--Oh (arxiv:1702.05715, arxiv:1702.05716).\n  Together with the methods and results of Luk--Oh (arXiv:2404.02220), our\nestimates imply a late-time tails result for the scalar field. This result\nprovides another proof of generic mass inflation, through a result of Dafermos\n(arXiv:arch-ive/0307013). Another application of our late-time tails result,\ndue to Van de Moortel, is the global construction of two-ended black holes that\ncontain null and spacelike singularities.\n",
  "subjects": [
    "Physics/General Relativity and Quantum Cosmology",
    "Mathematics/Analysis of PDEs"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "qo1kwPNPcezqnON2xNjpqllsLRtO_yt6CqgLlpbMKjs",
  "pdfSize": "1369640"
}