{
  "id": "2412.07332",
  "title": "Model predictive control-based trajectory generation for agile landing\n  of unmanned aerial vehicle on a moving boat",
  "authors": "Ond\\v{r}ej Proch\\'azka, Filip Nov\\'ak, Tom\\'a\\v{s} B\\'a\\v{c}a, Parakh\n  M. Gupta, Robert P\\v{e}ni\\v{c}ka and Martin Saska",
  "authorsParsed": [
    [
      "Procházka",
      "Ondřej",
      ""
    ],
    [
      "Novák",
      "Filip",
      ""
    ],
    [
      "Báča",
      "Tomáš",
      ""
    ],
    [
      "Gupta",
      "Parakh M.",
      ""
    ],
    [
      "Pěnička",
      "Robert",
      ""
    ],
    [
      "Saska",
      "Martin",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 09:23:37 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733822617000,
  "abstract": "  This paper proposes a novel trajectory generation method based on Model\nPredictive Control (MPC) for agile landing of an Unmanned Aerial Vehicle (UAV)\nonto an Unmanned Surface Vehicle (USV)'s deck in harsh conditions. The\ntrajectory generation exploits the state predictions of the USV to create\nperiodically updated trajectories for a multirotor UAV to precisely land on the\ndeck of a moving USV even in cases where the deck's inclination is continuously\nchanging. We use an MPC-based scheme to create trajectories that consider both\nthe UAV dynamics and the predicted states of the USV up to the first derivative\nof position and orientation. Compared to existing approaches, our method\ndynamically modifies the penalization matrices to precisely follow the\ncorresponding states with respect to the flight phase. Especially during the\nlanding maneuver, the UAV synchronizes attitude with the USV's, allowing for\nfast landing on a tilted deck. Simulations show the method's reliability in\nvarious sea conditions up to Rough sea (wave height 4 m), outperforming\nstate-of-the-art methods in landing speed and accuracy, with twice the\nprecision on average. Finally, real-world experiments validate the simulation\nresults, demonstrating robust landings on a moving USV, while all computations\nare performed in real-time onboard the UAV.\n",
  "subjects": [
    "Computer Science/Robotics",
    "Computer Science/Systems and Control",
    "Electrical Engineering and Systems Science/Systems and Control"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "Jpl03SiLgazmTZ7Fq89Ek8KAvQIbL6v9mscsQ5acI-M",
  "pdfSize": "14328064"
}