{"id":"2412.06576","title":"Multimodal Purcell enhancement and optical coherence of Eu$^{\\text{3+}}$\n  ions in a single nanoparticle coupled to a microcavity","authors":"Timon Eichhorn, Nicholas Jobbitt, S\\\"oren Bieling, Shuping Liu, Tobias\n  Krom, Diana Serrano, Robert Huber, Ulrich Lemmer, Hugues de Riedmatten,\n  Philippe Goldner, David Hunger","authorsParsed":[["Eichhorn","Timon",""],["Jobbitt","Nicholas",""],["Bieling","Sören",""],["Liu","Shuping",""],["Krom","Tobias",""],["Serrano","Diana",""],["Huber","Robert",""],["Lemmer","Ulrich",""],["de Riedmatten","Hugues",""],["Goldner","Philippe",""],["Hunger","David",""]],"versions":[{"version":"v1","created":"Mon, 9 Dec 2024 15:29:40 GMT"},{"version":"v2","created":"Thu, 13 Feb 2025 21:36:11 GMT"}],"updateDate":"2025-02-17","timestamp":1733758180000,"abstract":"  Europium-doped nanocrystals constitute a promising material for a scalable\nfuture quantum computing platform. Long-lived nuclear spin states could serve\nas qubits addressed via coherent optical transitions. In order to realize an\nefficient spin-photon interface, we couple the emission from a single\nnanoparticle to a fiber-based microcavity under cryogenic conditions. The\nspatial and spectral tunability of the cavity permits us to place individual\nnanoparticles in the cavity, to measure the inhomogeneous linewidth of the\nions, and to show a multi-modal Purcell-enhancement of two transition in\nEu$^{\\text{3+}}$. A halving of the free-space lifetime to 1.0 ms is observed,\ncorresponding to a 140-fold enhancement of the respective transition.\nFurthermore, we observe a narrow optical linewidth of 3.3 MHz for a few-ion\nensemble in the center of the inhomogeneous line. The results represent an\nimportant step towards the efficient readout of single Eu$^{\\text{3+}}$ ions, a\nkey requirement for the realization of single-ion-level quantum processing\nnodes in the solid state.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"A4ZICVli4asD1UK4AbLXzXpSMtJHM72SKW3DLWNIcmA","pdfSize":"835977"}