{
  "id": "2412.04865",
  "title": "Quantum-Enhanced Multi-Parameter Sensing in a Single Mode",
  "authors": "Christophe H. Valahu, Matthew P. Stafford, Zixin Huang, Vassili G.\n  Matsos, Maverick J. Millican, Teerawat Chalermpusitarak, Nicolas C.\n  Menicucci, Joshua Combes, Ben Q. Baragiola, and Ting Rei Tan",
  "authorsParsed": [
    [
      "Valahu",
      "Christophe H.",
      ""
    ],
    [
      "Stafford",
      "Matthew P.",
      ""
    ],
    [
      "Huang",
      "Zixin",
      ""
    ],
    [
      "Matsos",
      "Vassili G.",
      ""
    ],
    [
      "Millican",
      "Maverick J.",
      ""
    ],
    [
      "Chalermpusitarak",
      "Teerawat",
      ""
    ],
    [
      "Menicucci",
      "Nicolas C.",
      ""
    ],
    [
      "Combes",
      "Joshua",
      ""
    ],
    [
      "Baragiola",
      "Ben Q.",
      ""
    ],
    [
      "Tan",
      "Ting Rei",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 08:58:19 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733475499000,
  "abstract": "  Precision metrology underpins scientific and technological advancements.\nQuantum metrology offers a pathway to surpass classical sensing limits by\nleveraging quantum states and measurement strategies. However, measuring\nmultiple incompatible observables suffers from quantum backaction, where\nmeasurement of one observable pollutes a subsequent measurement of the other.\nThis is a manifestation of Heisenberg's uncertainty principle for two\nnon-commuting observables, such as position and momentum. Here, we demonstrate\nmeasurements of small changes in position and momentum where the uncertainties\nare simultaneously reduced below the standard quantum limit (SQL). We measure\n$\\textit{modular observables}$ using tailored, highly non-classical states that\nideally evade measurement backactions. The states are deterministically\nprepared in the single mode of the mechanical motion of a trapped ion using an\noptimal quantum control protocol. Our experiment uses grid states to measure\nsmall changes in position and momentum and shows a metrological gain of up to\n5.1(5)~dB over the simultaneous SQL. Using an adaptive-phase estimation\nalgorithm with Bayesian inference, we estimate these displacements with a\ncombined variance of 2.6(1.1)~dB below the SQL. Furthermore, we examine\nsimultaneously estimating $\\textit{number}$ and $\\textit{phase}$, which are the\npolar counterparts of position and momentum. This is performed by preparing a\nnovel quantum resource -- number-phase states -- and we demonstrate a\nmetrological gain over their SQL. The combination of quantum control and\nmulti-parameter quantum metrology marks a significant step towards\nunprecedented precision with applications ranging from fundamental physics to\nadvanced quantum technologies.\n",
  "subjects": [
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "fsFPwkTquGGhBKtG_PiLIrq4LVI7-U-cEt6Qcf33t4o",
  "pdfSize": "6156373"
}