{"id":"2412.01405","title":"MambaU-Lite: A Lightweight Model based on Mamba and Integrated\n  Channel-Spatial Attention for Skin Lesion Segmentation","authors":"Thi-Nhu-Quynh Nguyen, Quang-Huy Ho, Duy-Thai Nguyen, Hoang-Minh-Quang\n  Le, Van-Truong Pham, and Thi-Thao Tran","authorsParsed":[["Nguyen","Thi-Nhu-Quynh",""],["Ho","Quang-Huy",""],["Nguyen","Duy-Thai",""],["Le","Hoang-Minh-Quang",""],["Pham","Van-Truong",""],["Tran","Thi-Thao",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 11:49:49 GMT"}],"updateDate":"2024-12-03","timestamp":1733140189000,"abstract":"  Early detection of skin abnormalities plays a crucial role in diagnosing and\ntreating skin cancer. Segmentation of affected skin regions using AI-powered\ndevices is relatively common and supports the diagnostic process. However,\nachieving high performance remains a significant challenge due to the need for\nhigh-resolution images and the often unclear boundaries of individual lesions.\nAt the same time, medical devices require segmentation models to have a small\nmemory foot-print and low computational cost. Based on these requirements, we\nintroduce a novel lightweight model called MambaU-Lite, which combines the\nstrengths of Mamba and CNN architectures, featuring just over 400K parameters\nand a computational cost of more than 1G flops. To enhance both global context\nand local feature extraction, we propose the P-Mamba block, a novel component\nthat incorporates VSS blocks along-side multiple pooling layers, enabling the\nmodel to effectively learn multiscale features and enhance segmentation\nperformance. We evaluate the model's performance on two skin datasets, ISIC2018\nand PH2, yielding promising results. Our source code will be made publicly\navailable at: https://github.com/nqnguyen812/MambaU-Lite.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"n5l1vSx8PXc1Ypixov7EUkxNPCiBwRnGvpHzgGsYB3Y","pdfSize":"1754967"}