{
  "id": "2412.11660",
  "title": "Non-Convex Optimization in Federated Learning via Variance Reduction and\n  Adaptive Learning",
  "authors": "Dipanwita Thakur, Antonella Guzzo, Giancarlo Fortino, Sajal K. Das",
  "authorsParsed": [
    [
      "Thakur",
      "Dipanwita",
      ""
    ],
    [
      "Guzzo",
      "Antonella",
      ""
    ],
    [
      "Fortino",
      "Giancarlo",
      ""
    ],
    [
      "Das",
      "Sajal K.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 11:02:38 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734346958000,
  "abstract": "  This paper proposes a novel federated algorithm that leverages momentum-based\nvariance reduction with adaptive learning to address non-convex settings across\nheterogeneous data. We intend to minimize communication and computation\noverhead, thereby fostering a sustainable federated learning system. We aim to\novercome challenges related to gradient variance, which hinders the model's\nefficiency, and the slow convergence resulting from learning rate adjustments\nwith heterogeneous data. The experimental results on the image classification\ntasks with heterogeneous data reveal the effectiveness of our suggested\nalgorithms in non-convex settings with an improved communication complexity of\n$\\mathcal{O}(\\epsilon^{-1})$ to converge to an $\\epsilon$-stationary point -\ncompared to the existing communication complexity $\\mathcal{O}(\\epsilon^{-2})$\nof most prior works. The proposed federated version maintains the trade-off\nbetween the convergence rate, number of communication rounds, and test accuracy\nwhile mitigating the client drift in heterogeneous settings. The experimental\nresults demonstrate the efficiency of our algorithms in image classification\ntasks (MNIST, CIFAR-10) with heterogeneous data.\n",
  "subjects": [
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "sXBv0qCRetBdpEbqv5bsU-3RyS5SHsmOufnw4SUs5l0",
  "pdfSize": "845793"
}