{"id":"2412.01453","title":"Quadruply Bonded Mo$_2$ Molecules: An Emitter-Resonator Integrated\n  Quantum System in Free Space","authors":"Miao Meng, Ying Ning Tan, Zi Cong He, Zi Hao Zhong, Jia Zhou, Yu Li\n  Zhou, Guang Yuan Zhu, Chun Y. Liu","authorsParsed":[["Meng","Miao",""],["Tan","Ying Ning",""],["He","Zi Cong",""],["Zhong","Zi Hao",""],["Zhou","Jia",""],["Zhou","Yu Li",""],["Zhu","Guang Yuan",""],["Liu","Chun Y.",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 12:43:15 GMT"},{"version":"v2","created":"Wed, 22 Jan 2025 00:39:56 GMT"}],"updateDate":"2025-01-23","timestamp":1733143395000,"abstract":"  In recent decades, significant progress has been made in construction and\nstudy of individual quantum systems consisting of the basic single matter and\nenergy particles, i.e., atoms and photons, which show great potentials in\nquantum computation and communication. Here, we demonstrate that the\nquadruply-bonded Mo$_2$ unit of the complex can trap photons of visible light\nunder ambient conditions, producing intense local electromagnetic (EM) field\nthat features squeezed states, photon antibunching, and vacuum Rabi splitting.\nOur results show that both the electronic and vibrational states of the Mo$_2$\nmolecule are modified by coherent coupling with the scattered photons of the\nMo$_2$ unit, as evidenced by the Rabi doublet4 and the Mollow triplet in the\nincoherent resonance fluorescence and the Raman spectra. The Mo$_2$ molecule,\nacting as an independent emitter-resonator integrated quantum system, allows\noptical experiments to be conducted in free space, enabling fundamental quantum\nphenomena to be observed through conventional spectroscopic instrumentation.\nThis provides a new platform for study of field effects and quantum\nelectrodynamics (QED) in the optical domain. The insights gained from this\nstudy advance our understanding in metal-metal bond chemistry, molecular\nphysics and quantum optics, with applications in quantum information\nprocessing, optoelectronic devices and control of chemical reactivity.\n","subjects":["Physics/Quantum Physics","Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"qfacJxPvPUhzEYPv9KJ72aCW4McWqFjgyYPm5b9v-rc","pdfSize":"1280005"}