{"id":"2412.04008","title":"Deep-Unrolling Multidimensional Harmonic Retrieval Algorithms on\n  Neuromorphic Hardware","authors":"Vlad C. Andrei, Alexandru P. Dr\\u{a}gu\\c{t}oiu, Gabriel B\\'ena,\n  Mahmoud Akl, Yin Li, Matthias Lohrmann, Ullrich J. M\\\"onich, Holger Boche","authorsParsed":[["Andrei","Vlad C.",""],["Drăguţoiu","Alexandru P.",""],["Béna","Gabriel",""],["Akl","Mahmoud",""],["Li","Yin",""],["Lohrmann","Matthias",""],["Mönich","Ullrich J.",""],["Boche","Holger",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 09:41:33 GMT"}],"updateDate":"2024-12-06","timestamp":1733391693000,"abstract":"  This paper explores the potential of conversion-based neuromorphic algorithms\nfor highly accurate and energy-efficient single-snapshot multidimensional\nharmonic retrieval (MHR). By casting the MHR problem as a sparse recovery\nproblem, we devise the currently proposed, deep-unrolling-based Structured\nLearned Iterative Shrinkage and Thresholding (S-LISTA) algorithm to solve it\nefficiently using complex-valued convolutional neural networks with\ncomplex-valued activations, which are trained using a supervised regression\nobjective. Afterward, a novel method for converting the complex-valued\nconvolutional layers and activations into spiking neural networks (SNNs) is\ndeveloped. At the heart of this method lies the recently proposed Few Spikes\n(FS) conversion, which is extended by modifying the neuron model's parameters\nand internal dynamics to account for the inherent coupling between real and\nimaginary parts in complex-valued computations. Finally, the converted SNNs are\nmapped onto the SpiNNaker2 neuromorphic board, and a comparison in terms of\nestimation accuracy and power efficiency between the original CNNs deployed on\nan NVIDIA Jetson Xavier and the SNNs is being conducted. The measurement\nresults show that the converted SNNs achieve almost five-fold power efficiency\nat moderate performance loss compared to the original CNNs.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computer Science/Artificial Intelligence","Computer Science/Hardware Architecture","Computer Science/Neural and Evolutionary Computing"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"j2x0NNCQ0o7s9d0WY-niLDyjEzP3SzL9RdJB35zC_Fs","pdfSize":"570814"}