{"id":"2412.12340","title":"A Large Language Model Approach to Identify Flakiness in C++ Projects","authors":"Xin Sun, Daniel St{\\aa}hl, Kristian Sandahl","authorsParsed":[["Sun","Xin",""],["Ståhl","Daniel",""],["Sandahl","Kristian",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 20:20:45 GMT"}],"updateDate":"2024-12-18","timestamp":1734380445000,"abstract":"  The role of regression testing in software testing is crucial as it ensures\nthat any new modifications do not disrupt the existing functionality and\nbehaviour of the software system. The desired outcome is for regression tests\nto yield identical results without any modifications made to the system being\ntested. In practice, however, the presence of Flaky Tests introduces\nnon-deterministic behaviour and undermines the reliability of regression\ntesting results.\n  In this paper, we propose an LLM-based approach for identifying the root\ncause of flaky tests in C++ projects at the code level, with the intention of\nassisting developers in debugging and resolving them more efficiently. We\ncompile a comprehensive collection of C++ project flaky tests sourced from\nGitHub repositories. We fine-tune Mistral-7b, Llama2-7b and CodeLlama-7b models\non the C++ dataset and an existing Java dataset and evaluate the performance in\nterms of precision, recall, accuracy, and F1 score. We assess the performance\nof the models across various datasets and offer recommendations for both\nresearch and industry applications.\n  The results indicate that our models exhibit varying performance on the C++\ndataset, while their performance is comparable to that of the Java dataset. The\nMistral-7b surpasses the other two models regarding all metrics, achieving a\nscore of 1. Our results demonstrate the exceptional capability of LLMs to\naccurately classify flakiness in C++ and Java projects, providing a promising\napproach to enhance the efficiency of debugging flaky tests in practice.\n","subjects":["Computer Science/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"xl-piG6W6MQbrC9KGYP3bc2y5EI0bPMNn_GODyucoI0","pdfSize":"1259014"}