{
  "id": "2412.14083",
  "title": "Optical Power Beaming in the Lunar Environment",
  "authors": "Mohamed Naqbi, Sebastien Loranger, Gunes Karabulut Kurt",
  "authorsParsed": [
    [
      "Naqbi",
      "Mohamed",
      ""
    ],
    [
      "Loranger",
      "Sebastien",
      ""
    ],
    [
      "Kurt",
      "Gunes Karabulut",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 17:31:44 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734543104000,
  "abstract": "  The increasing focus on lunar exploration requires innovative power solutions\nto support scientific research, mining, and habitation in the Moon's extreme\nenvironment. Optical power beaming (OPB) has emerged as a promising alternative\nto conventional systems. However, the impact of lofted lunar dust (LLD) on\noptical transmissions remains poorly understood. This research addresses that\ngap by evaluating LLD-induced attenuation and optimizing OPB design for\nefficient power delivery over long distances. A combined theoretical and\nsimulation-based approach is employed, utilizing the T-matrix method to model\nLLD attenuation and Gaussian beam theory to optimize transmission and receiver\nparameters. The results indicate that LLD significantly attenuates\nground-to-ground optical power transmission in illuminated regions, thus making\nOPB more suitable in darker areas, such as permanently shadowed regions or\nduring the lunar night. Furthermore, we demonstrate that OPB can operate over\nlong distances on the Moon while maintaining reasonable aperture sizes through\nappropriate optical design optimizations. These findings highlight the\npotential of OPB as a reliable power solution for sustainable lunar exploration\nand habitation.\n",
  "subjects": [
    "Physics/Optics",
    "Physics/Space Physics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "xi0MMN3uW7yBtL-v2LR42TLrTSeLfwkm4tKDIHgVgg8",
  "pdfSize": "1661426"
}