{"id":"2412.09158","title":"Evidence for Local Symmetry Breaking in the Skyrmion-Hosting Ni2In-type\n  Hexagonal Compounds","authors":"Anupam K. Singh, Sanjay Singh, Krishna K. Dubey, Parul Devi, Pritam\n  Das, Martin Etter, Ola. G. Grendal, Catherine Dejoie, Andrew Fitch, Anatoliy\n  Senyshyn, Seung-Cheol Lee, Satadeep Bhattacharjee, and Dhananjai Pandey","authorsParsed":[["Singh","Anupam K.",""],["Singh","Sanjay",""],["Dubey","Krishna K.",""],["Devi","Parul",""],["Das","Pritam",""],["Etter","Martin",""],["Grendal","Ola. G.",""],["Dejoie","Catherine",""],["Fitch","Andrew",""],["Senyshyn","Anatoliy",""],["Lee","Seung-Cheol",""],["Bhattacharjee","Satadeep",""],["Pandey","Dhananjai",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 10:44:27 GMT"}],"updateDate":"2024-12-13","timestamp":1734000267000,"abstract":"  Dzyaloshinskii-Moriya interaction (DMI) plays a crucial role to stabilize the\nexotic topologically stable skyrmion spin-textures in the noncentrosymmetric\ncrystals. The recent discovery of biskyrmions and skyrmions in the globally\ncentrosymmetric crystals has raised debate about the role of the DMI in causing\nthe spin textures, since DMI vanishes in such crystal structures. Theoretical\nstudies, on the other hand, suggest non-vanishing DMI even if there is local\ninversion symmetry breaking in an otherwise globally centrosymmetric crystal\nstructure. Motivated by such theoretical predictions, we present here the\nresults of a systematic crystal structure study of two skyrmion-hosting\nNi2In-type centrosymmetric hexagonal compounds, MnNiGa and MnPtGa, using the\natomic pair distribution function (PDF) technique. Our result provides\ninformation about structural correlations in the short-range (SR), medium-range\n(MR) and long-range (LR) regimes simultaneously. The analysis of the\nexperimental PDFs, obtained from high flux, high energy and high-Q synchrotron\nx-ray powder diffraction patterns, reveal that the local SR structure of both\nMnNiGa and MnPtGa compounds corresponds to the noncentrosymmetric trigonal\nspace group P3m1, while the structure in the MR+LR regimes remains hexagonal in\nthe centrosymmetric P63/mmc space group. These findings are also supported by\ntheoretical DFT calculations. Our results in conjunction with the previous\ntheoretical predictions, provide a rationale for the genesis of skyrmions in\ncentrosymmetric materials in terms of non-vanishing DMI due to local inversion\nsymmetry breaking. We believe that our findings would encourage a systematic\nsearch of skyrmionic textures and other topological phenomena in a vast family\nof centrosymmetric materials.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"94GfNFTnsi-zgWae3duJxt-E00nrUp0kRWPniy6v3kQ","pdfSize":"2442567"}