{"id":"2412.19708","title":"All Finite (Anti)Hermitian Irreducible Representations of the de Sitter\n  and Anti-de Sitter Lie Algebras and Their Lorentz Structure","authors":"Richard A.W. Bradford","authorsParsed":[["Bradford","Richard A. W.",""]],"versions":[{"version":"v1","created":"Fri, 27 Dec 2024 16:02:41 GMT"}],"updateDate":"2024-12-30","timestamp":1735315361000,"abstract":"  Because of the importance of unitarity in quantum physics, work on the\nrepresentations of the de Sitter group has focussed on the unitary case, which\nnecessarily means infinite dimensional matrices for this non-compact group.\nHere we address the finite dimensional representations resulting from the\nrequirement that the Lie algebra generators are either Hermitian or\nanti-Hermitian. The complete classification of all such irreducible\nrepresentations is found and their matrix elements specified. These irreducible\nrepresentations (irreps) are based on backbones defined as the homogeneous\nLorentz sub-algebra and consisting of direct sums of the finite irreps of the\nhomogeneous Lorentz algebra (HLA). Only two types of such backbones arise (see\n5.1a,b herein). Consequently, only certain dimensions of representation are\npossible, namely 4, 5, 10, 14, 20, 30, 35, 55, 56, 91, etc or generally either\n1/6 N(N+1)(N+2) or 1/6 N(N+1)(2N+1) where N=2,3,4,etc is the number of HLA\nirreps in the backbone (minimum 2). The two Casimir invariants can be specified\nin terms of a single integral or half-integral parameter, p. For irreps based\non (5.1a), -C1=p(p+1)-2 and C2=0 with p taking values 2,3,4,etc. For irreps\nbased on (5.1b), -C1=2(p^2-1) and -C2= p^2 (p^2-1) with p taking values\n3/2,2,5/2,3,etc. These correspond to the same expressions found for the unitary\nrepresentations, -C1=p(p+1)+(q+1)(q-2) and -C2=p(p+1)q(q-1) with q=0 and q=p\nrespectively for the two types of irrep. There is thus a far more restricted\nset of finite irreps with Hermitian or anti-Hermitian generators than for the\ndiscrete infinite dimensional unitary irreps. The corresponding irreps of the\nanti-de Sitter group follow immediately from the replacement of the 4-momentum\noperators from V to iV.\n","subjects":["Mathematics/Group Theory","Physics/Mathematical Physics","Mathematics/Mathematical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"GPIUr649TqAP60eEtj270wvu9mlFqDEzFvQO3yMIe9Y","pdfSize":"804156"}