{
  "id": "2412.17581",
  "title": "Building transport models from baroclinic wave experimental data",
  "authors": "M. Agaoglou, V. J. Garcia-Garrido, U. Harlander, A. M. Mancho",
  "authorsParsed": [
    [
      "Agaoglou",
      "M.",
      ""
    ],
    [
      "Garcia-Garrido",
      "V. J.",
      ""
    ],
    [
      "Harlander",
      "U.",
      ""
    ],
    [
      "Mancho",
      "A. M.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 13:53:35 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734962015000,
  "abstract": "  In this paper we study baroclinic waves both from the experimental and the\ntheoretical perspective. We obtain data from a rotating annulus experiment\ncapable of producing a series of baroclinic eddies similar to those found in\nthe mid-latitude atmosphere. We analyze the experimental outputs using two\nmethods. First, we apply a technique that involves filtering data using\nEmpirical Orthogonal Function (EOF) analysis, which is applied to both velocity\nand surface temperature fields. The second method relies on the construction of\na simple kinematic model based on key parameters derived from the experimental\ndata. To analyze eddy-driven fluid transport, we apply the method of Lagrangian\ndescriptors to the underlying velocity field, revealing the attracting material\ncurves that act as transport barriers in the system. These structures\neffectively capture the essential characteristics of the baroclinic flow and\nthe associated transport phenomena. Our results show that these barriers are in\ngood agreement with the transport patterns observed in the rotating annulus\nexperiment. In particular, we observe that the structures obtained from the\nkinematic model, or the one derived in terms of filtered velocities, perform\nwell in this regard.\n",
  "subjects": [
    "Nonlinear Sciences/Chaotic Dynamics",
    "Physics/Atmospheric and Oceanic Physics",
    "Physics/Fluid Dynamics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "T8FZaSzZnatL5iWeeJLABtNOZa6MYOL_uuAaMDd7_fU",
  "pdfSize": "12440302"
}