{"id":"2412.10085","title":"Dynamics of Vector Soliton Singlets and Pairs in Self-Mode-Locked\n  Tm-Doped Fibre Lasers","authors":"Dennis Christian Kirsch, Anastasia Bednyakova, Maria Chernysheva","authorsParsed":[["Kirsch","Dennis Christian",""],["Bednyakova","Anastasia",""],["Chernysheva","Maria",""]],"versions":[{"version":"v1","created":"Fri, 13 Dec 2024 12:19:57 GMT"}],"updateDate":"2024-12-16","timestamp":1734092397000,"abstract":"  Vector solitons present unique optical pulses characterised by coupled\northogonal polarisation components, offering rich, multidimensional dynamics.\nTheir enhanced degrees of freedom make them highly versatile for exploring\nnonlinear wave phenomena and enabling advanced applications in optical\ncommunications and ultrafast technologies. Despite significant recent progress,\nthe intricate dynamics of vector soliton generation remain largely unexplored,\nparticularly their interaction and coupling mechanisms. This study\ncharacterises soliton build-up dynamics in a self-mode-locked Tm-doped fibre\nlaser, where both cavity birefringence and distributed saturable absorber play\nsignificant roles in the intracavity pulse shaping. The recorded single-shot\nspectra using the Dispersive Fourier Transform technique reveal generation\nregimes of singlet solitons and loosely bound two-pulse states. In later case,\nthe observed intensity-dependent temporal splitting of vector soliton\npolarisations is also affected by the repulsive forces due to the interaction\nwith synchronised and unsynchronised dispersive waves, governing the transition\nfrom transient pulse formation to steady-state generation. This study enhances\nour understanding of vector soliton dynamics and sets a solid foundation for\nfurther advanced exploration of their generation regimes across a wide range of\nnonlinear photonic systems.\n","subjects":["Physics/Optics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"imlLe4lriUyz95wcHRW7q6hnscQ0E8TN8a12mXzthS4","pdfSize":"8074911"}