{"id":"2412.04969","title":"From Theory to Practice: Demonstrators of FAIR Data Spaces Across\n  Different Sectors","authors":"Nikolaus Glombiewski, Zeyd Boukhers, Christian Beilschmidt, Johannes\n  Dr\\\"onner, Michael Mattig, Artur Piet, Robert Pietrzynski, Mehrshad\n  Jaberansary, Macedo Maia, Sebastian Beyvers, Yeliz \\\"U\\c{c}er Yediel,\n  Muhammad Hamza Akhtar, Heiner Oberkampf, Jonathan Hartman, Bernhard Seeger,\n  Christoph Lange","authorsParsed":[["Glombiewski","Nikolaus",""],["Boukhers","Zeyd",""],["Beilschmidt","Christian",""],["Drönner","Johannes",""],["Mattig","Michael",""],["Piet","Artur",""],["Pietrzynski","Robert",""],["Jaberansary","Mehrshad",""],["Maia","Macedo",""],["Beyvers","Sebastian",""],["Yediel","Yeliz Üçer",""],["Akhtar","Muhammad Hamza",""],["Oberkampf","Heiner",""],["Hartman","Jonathan",""],["Seeger","Bernhard",""],["Lange","Christoph",""]],"versions":[{"version":"v1","created":"Fri, 6 Dec 2024 11:39:28 GMT"}],"updateDate":"2024-12-09","timestamp":1733485168000,"abstract":"  The principles of data spaces for sovereign data exchange across trusted\norganizations have so far mainly been adopted in business-to-business settings,\nand recently scaled to cloud environments. Meanwhile, research organizations\nhave established distributed research data infrastructures, respecting the\nprinciple that data must be FAIR, i.e., findable, accessible, interoperable and\nreusable. For mutual benefit of these two communities, the FAIR Data Spaces\nproject aims to connect them towards the vision of a common, cloud-based data\nspace for industry and research. Thus, the project establishes a common legal\nand ethical framework, common technical building blocks, and it demonstrates\nthe orchestration of multiple building blocks in self-contained settings\naddressing a diverse range of use cases in domains including health,\nbiodiversity, and engineering. This paper gives a summary of all demonstrators,\nranging from research data infrastructures scaled to industry-ready cloud\nenvironments to work in progress on building bridges between operational\nbusiness-to-business data spaces and research data infrastructures.\n","subjects":["Computer Science/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"D_s24w9akBvLOIQv59_HeqWYTzMltavkQx5mtAk1bAU","pdfSize":"1817785"}