{"id":"2412.16103","title":"Local structure and phonon states mediated by intercalation-driven\n  doping in superconducting $Li_{1.0}(C_5H_5N)_yFe_{2-z}Se_2$","authors":"Alexandros Deltsidis, Myrsini Kaitatzi, Laura Simonelli, Chris Stock,\n  David Voneshen, and Alexandros Lappas","authorsParsed":[["Deltsidis","Alexandros",""],["Kaitatzi","Myrsini",""],["Simonelli","Laura",""],["Stock","Chris",""],["Voneshen","David",""],["Lappas","Alexandros",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 17:44:36 GMT"}],"updateDate":"2024-12-23","timestamp":1734716676000,"abstract":"  Intercalation of two-dimensional (2D) iron chalcogenides with molecular\nspecies requires disentangling electronic and structural contributions to\nunderstand the puzzling limit to superconducting transition temperature ($T_c$)\nat the frontier of long interlayer separations. Here, synchrotron X-ray\nabsorption spectroscopy (XAS) at the Se K-edge sheds light on the impact of\ncarrier-doping on the local structure of the high-$T_c$ (~39 K)\n$Li_{1.0}(C_5H_5N)_yFe_{2-z}Se_2$ phase. This material is derived by annealing\nthe structurally related as-made derivative ($T_c$~ 44 K), with layers being\nprimed apart by [alkali-molecule] guests. Metrics, such as, a reduced filling\nof Se $4p$ orbitals and shorter Fe-Se bonds in the annealed phase, corroborate\nto a lower electron doping level with respect to the as-made one. Analysis of\nthe metal-ligand thermal motion, based on the correlated Debye model, further\nrelates the higher $T_c$ intercalates with the softening of the local Fe-Se\nbond. Beyond electronic effects, intercalation brings forth host-guest\ninteractions that mediate the dynamics of the bulk crystal structure. For this,\nneutron time-of-flight spectroscopy on the annealed derivative, corroborates to\nthe Se-Fe-Se layer being sensitive to chemical pressure effects imposed by the\nconfined organic guests. This reflects in the phonon density of states, where\nharder low-energy transverse acoustic matrix phonons and molecular vibrations\nare witnessed, with respect to the pristine inorganic ($\\beta$-FeSe) and\norganic ($C_5D_5N$) counterparts. On cooling through $T_c$, these excitations\narrive without a collective magnetic-resonance mode - essential in\nunconventional, spin-mediated mechanisms - enquiring about deviations from\noptimal doping. The work highlights that when the Fe-square planes are tuned\nfar apart, carrier-doping leveraged by intercalation plays a key role in the\n$T_c$ parametrization.\n","subjects":["Condensed Matter/Superconductivity","Condensed Matter/Materials Science","Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"HbJ7uvrjHwNOtwrhZYWjIHrRsq1wA87uIxrii_V4j08","pdfSize":"1750110"}