{
  "id": "2412.15324",
  "title": "The effects of different cooling and heating function models on a\n  simulated analog of NGC300",
  "authors": "David Robinson, Camille Avestruz, Nickolay Y. Gnedin, and Vadim A.\n  Semenov",
  "authorsParsed": [
    [
      "Robinson",
      "David",
      ""
    ],
    [
      "Avestruz",
      "Camille",
      ""
    ],
    [
      "Gnedin",
      "Nickolay Y.",
      ""
    ],
    [
      "Semenov",
      "Vadim A.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 19:00:00 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734634800000,
  "abstract": "  Gas cooling and heating rates are vital components of hydrodynamic\nsimulations. However, they are computationally expensive to evaluate exactly\nwith chemical networks or photoionization codes. We compare two different\napproximation schemes for gas cooling and heating in an idealized simulation of\nan isolated galaxy. One approximation is based on a polynomial interpolation of\na table of Cloudy calculations, as is commonly done in galaxy formation\nsimulations. The other approximation scheme uses machine learning for the\ninterpolation instead on an analytic function, with improved accuracy. We\ncompare the temperature-density phase diagrams of gas from each simulation run\nto assess how much the two simulation runs differ. Gas in the simulation using\nthe machine learning approximation is systematically hotter for low-density gas\nwith $-3 \\lesssim \\log{(n_b/\\mathrm{cm}^{-3})} \\lesssim -1$. We find a critical\ncurve in the phase diagram where the two simulations have equal amounts of gas.\nThe phase diagrams differ most strongly at temperatures just above and below\nthis critical curve. We compare CII emission rates for collisions with various\nparticles (integrated over the gas distribution function), and find slight\ndifferences between the two simulations. Future comparisons with simulations\nincluding radiative transfer will be necessary to compare observable quantities\nlike the total CII luminosity.\n",
  "subjects": [
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Ht3jhFKBBno4iPyI1Wl_l5eX-Kxl3I40ciHD0p14bNs",
  "pdfSize": "592857"
}