{
  "id": "2412.04477",
  "title": "Intelligent Tutors for Adult Learners: An Analysis of Needs and\n  Challenges",
  "authors": "Adit Gupta, Momin Siddiqui, Glen Smith, Jenn Reddig, Christopher\n  MacLellan",
  "authorsParsed": [
    [
      "Gupta",
      "Adit",
      ""
    ],
    [
      "Siddiqui",
      "Momin",
      ""
    ],
    [
      "Smith",
      "Glen",
      ""
    ],
    [
      "Reddig",
      "Jenn",
      ""
    ],
    [
      "MacLellan",
      "Christopher",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 19 Nov 2024 19:05:04 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 28 Jan 2025 16:24:45 GMT"
    },
    {
      "version": "v3",
      "created": "Wed, 19 Feb 2025 03:08:14 GMT"
    }
  ],
  "updateDate": "2025-02-24",
  "timestamp": 1732043104000,
  "abstract": "  This work examines the sociotechnical factors that influence the adoption and\nusage of intelligent tutoring systems in self-directed learning contexts,\nfocusing specifically on adult learners. The study is divided into two parts.\nFirst, we present Apprentice Tutors, a novel intelligent tutoring system\ndesigned to address the unique needs of adult learners. The platform includes\nadaptive problem selection, real-time feedback, and visual dashboards to\nsupport learning in college algebra topics. Second, we investigate the specific\nneeds and experiences of adult users through a deployment study and a series of\nfocus groups. Using thematic analysis, we identify key challenges and\nopportunities to improve tutor design and adoption. Based on these findings, we\noffer actionable design recommendations to help developers create intelligent\ntutoring systems that better align with the motivations and learning\npreferences of adult learners. This work contributes to a wider understanding\nof how to improve educational technologies to support lifelong learning and\nprofessional development.\n",
  "subjects": [
    "Computer Science/Computers and Society",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Human-Computer Interaction"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "sTHYLDtqmCvi5t0HzGgN4OQjI_PJ-CiLdzE064iYTg0",
  "pdfSize": "1340190"
}