{
  "id": "2412.02721",
  "title": "Advancing Tritium Self-Sufficiency in Fusion Power Plants: Insights from\n  the BABY Experiment",
  "authors": "Remi Delaporte-Mathurin, Nikola Goles, John Ball, Collin Dunn, Emily\n  Edwards, Sara Ferry, Edward Lamere, Andrew Lanzrath, Rick Leccacorvi, Samuele\n  Meschini, Ethan Peterson, Stefano Segantin, Rui Vieira, Dennis Whyte, Weiyue\n  Zhou, Kevin Woller",
  "authorsParsed": [
    [
      "Delaporte-Mathurin",
      "Remi",
      ""
    ],
    [
      "Goles",
      "Nikola",
      ""
    ],
    [
      "Ball",
      "John",
      ""
    ],
    [
      "Dunn",
      "Collin",
      ""
    ],
    [
      "Edwards",
      "Emily",
      ""
    ],
    [
      "Ferry",
      "Sara",
      ""
    ],
    [
      "Lamere",
      "Edward",
      ""
    ],
    [
      "Lanzrath",
      "Andrew",
      ""
    ],
    [
      "Leccacorvi",
      "Rick",
      ""
    ],
    [
      "Meschini",
      "Samuele",
      ""
    ],
    [
      "Peterson",
      "Ethan",
      ""
    ],
    [
      "Segantin",
      "Stefano",
      ""
    ],
    [
      "Vieira",
      "Rui",
      ""
    ],
    [
      "Whyte",
      "Dennis",
      ""
    ],
    [
      "Zhou",
      "Weiyue",
      ""
    ],
    [
      "Woller",
      "Kevin",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 19:10:49 GMT"
    }
  ],
  "updateDate": "2024-12-05",
  "timestamp": 1733166649000,
  "abstract": "  In the pursuit of fusion power, achieving tritium self-sufficiency stands as\na pivotal challenge. Tritium breeding within molten salts is a critical aspect\nof next-generation fusion reactors, yet experimental measurements of \\gls{tbr}\nhave remained elusive. Here we present the results of the \\gls{baby}\nexperiment, which represents a pioneering effort in tritium research by\nutilizing high-energy (\\SI{14}{\\mega\\electronvolt}) neutron irradiation of\nmolten salts, a departure from conventional low-energy neutron approaches.\nUsing a small-scale (\\SI{100}{\\milli\\litre}) molten salt tritium breeding\nsetup, we not only simulated, but also directly measured a \\gls{tbr}. This\ninnovative approach provides crucial experimental validation, offering insights\nunattainable through simulation alone. Moreover, our findings reveal a\nsurprising outcome: tritium was predominantly collected as HT, contrary to the\nexpected TF. This underscores the complexity of tritium behavior in molten\nsalts, highlighting the need for further investigation. This work lays the\nfoundation for a more sophisticated experimental setup, including increasing\nthe volume of the breeder, enhancing neutron detection, and refining tritium\ncollection systems. Such improvements are crucial for advancing our\nunderstanding of fusion reactor feasibility and paving the way for future\nexperiments.\n",
  "subjects": [
    "Physics/Plasma Physics",
    "Physics/Nuclear Experiment"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "43jQqyhBUdiapQhze73pPfu5q_x1_S1lXTzhtjsXlwc",
  "pdfSize": "1466869"
}