{"id":"2412.06789","title":"The construction of quantum mechanics from electromagnetism. Theory and\n  hydrogen atom","authors":"Hern\\'an Gustavo Solari and Mario Alberto Natiello","authorsParsed":[["Solari","Hernán Gustavo",""],["Natiello","Mario Alberto",""]],"versions":[{"version":"v1","created":"Thu, 14 Nov 2024 13:02:07 GMT"},{"version":"v2","created":"Tue, 28 Jan 2025 12:45:26 GMT"}],"updateDate":"2025-01-29","timestamp":1731589327000,"abstract":"  We reconstruct Quantum Mechanics in a way that harmonises with classical\nmechanics and electromagnetism, free from mysteries or paradoxes as the\n\\emph{collapse of the wave-function} or \\emph{Schr\\\"odinger's cat.} The\nconstruction is inspired by de Broglie's and Schr\\\"odinger's wave mechanics\nwhile the unifying principle is Hamilton's principle of least action, which\nseparates natural laws from particular circumstances such as initial conditions\nand leads to the conservation of energy for isolated systems.\n  In Part I we construct the Quantum Mechanics of a charged unitary entity and\nprescribe the form in which the entity interacts with other charged entities\nand matter in general. In Part II we address the quantum mechanics of the\nhydrogen atom, testing the correctness and accuracy of the general description.\nThe relation between electron and proton in the atom is described\nsystematically in a construction that is free from analogies or ad-hoc\nderivations and it supersedes conventional Quantum Mechanics (whose equations\nlinked to measurements can be recovered). We briefly discuss why the concept of\nisolation built in Schr\\\"odinger's time evolution is not acceptable and how it\nimmediately results in the well known measurement paradoxes of quantum\nmechanics. We also discuss the epistemic grounds of the development and provide\na criticism of instrumentalism, the leading philosophical perspective behind\nconventional Quantum Mechanics.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"btD2a2bPYQgwwKuv5djp8sMU5kt9-vLLTGSFH-x5DF4","pdfSize":"541548"}