{
  "id": "2412.14087",
  "title": "SEKE: Specialised Experts for Keyword Extraction",
  "authors": "Matej Martinc, Hanh Thi Hong Tran, Senja Pollak and Boshko Koloski",
  "authorsParsed": [
    [
      "Martinc",
      "Matej",
      ""
    ],
    [
      "Tran",
      "Hanh Thi Hong",
      ""
    ],
    [
      "Pollak",
      "Senja",
      ""
    ],
    [
      "Koloski",
      "Boshko",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 17:34:32 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734543272000,
  "abstract": "  Keyword extraction involves identifying the most descriptive words in a\ndocument, allowing automatic categorisation and summarisation of large\nquantities of diverse textual data. Relying on the insight that real-world\nkeyword detection often requires handling of diverse content, we propose a\nnovel supervised keyword extraction approach based on the mixture of experts\n(MoE) technique. MoE uses a learnable routing sub-network to direct information\nto specialised experts, allowing them to specialize in distinct regions of the\ninput space. SEKE, a mixture of Specialised Experts for supervised Keyword\nExtraction, uses DeBERTa as the backbone model and builds on the MoE framework,\nwhere experts attend to each token, by integrating it with a recurrent neural\nnetwork (RNN), to allow successful extraction even on smaller corpora, where\nspecialisation is harder due to lack of training data. The MoE framework also\nprovides an insight into inner workings of individual experts, enhancing the\nexplainability of the approach. We benchmark SEKE on multiple English datasets,\nachieving state-of-the-art performance compared to strong supervised and\nunsupervised baselines. Our analysis reveals that depending on data size and\ntype, experts specialize in distinct syntactic and semantic components, such as\npunctuation, stopwords, parts-of-speech, or named entities. Code is available\nat: https://github.com/matejMartinc/SEKE_keyword_extraction\n",
  "subjects": [
    "Computer Science/Computation and Language",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "xF0iWM5-YajWKrym_o4dZi-hE5suewj5LnZ6xSv26aw",
  "pdfSize": "540801"
}