{
  "id": "2412.10122",
  "title": "The Art of Deception: Color Visual Illusions and Diffusion Models",
  "authors": "Alex Gomez-Villa, Kai Wang, Alejandro C. Parraga, Bartlomiej\n  Twardowski, Jesus Malo, Javier Vazquez-Corral, Joost van de Weijer",
  "authorsParsed": [
    [
      "Gomez-Villa",
      "Alex",
      ""
    ],
    [
      "Wang",
      "Kai",
      ""
    ],
    [
      "Parraga",
      "Alejandro C.",
      ""
    ],
    [
      "Twardowski",
      "Bartlomiej",
      ""
    ],
    [
      "Malo",
      "Jesus",
      ""
    ],
    [
      "Vazquez-Corral",
      "Javier",
      ""
    ],
    [
      "van de Weijer",
      "Joost",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 13:07:08 GMT"
    }
  ],
  "updateDate": "2024-12-16",
  "timestamp": 1734095228000,
  "abstract": "  Visual illusions in humans arise when interpreting out-of-distribution\nstimuli: if the observer is adapted to certain statistics, perception of\noutliers deviates from reality. Recent studies have shown that artificial\nneural networks (ANNs) can also be deceived by visual illusions. This\nrevelation raises profound questions about the nature of visual information.\nWhy are two independent systems, both human brains and ANNs, susceptible to the\nsame illusions? Should any ANN be capable of perceiving visual illusions? Are\nthese perceptions a feature or a flaw? In this work, we study how visual\nillusions are encoded in diffusion models. Remarkably, we show that they\npresent human-like brightness/color shifts in their latent space. We use this\nfact to demonstrate that diffusion models can predict visual illusions.\nFurthermore, we also show how to generate new unseen visual illusions in\nrealistic images using text-to-image diffusion models. We validate this ability\nthrough psychophysical experiments that show how our model-generated illusions\nalso fool humans.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "mJFFBm0I6_HShxxqyn4chn80NmSPK1o0_BPZ3u60k9g",
  "pdfSize": "17783348"
}