{"id":"2412.09168","title":"YingSound: Video-Guided Sound Effects Generation with Multi-modal\n  Chain-of-Thought Controls","authors":"Zihao Chen, Haomin Zhang, Xinhan Di, Haoyu Wang, Sizhe Shan, Junjie\n  Zheng, Yunming Liang, Yihan Fan, Xinfa Zhu, Wenjie Tian, Yihua Wang, Chaofan\n  Ding, and Lei Xie","authorsParsed":[["Chen","Zihao",""],["Zhang","Haomin",""],["Di","Xinhan",""],["Wang","Haoyu",""],["Shan","Sizhe",""],["Zheng","Junjie",""],["Liang","Yunming",""],["Fan","Yihan",""],["Zhu","Xinfa",""],["Tian","Wenjie",""],["Wang","Yihua",""],["Ding","Chaofan",""],["Xie","Lei",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 10:55:57 GMT"}],"updateDate":"2024-12-13","timestamp":1734000957000,"abstract":"  Generating sound effects for product-level videos, where only a small amount\nof labeled data is available for diverse scenes, requires the production of\nhigh-quality sounds in few-shot settings. To tackle the challenge of limited\nlabeled data in real-world scenes, we introduce YingSound, a foundation model\ndesigned for video-guided sound generation that supports high-quality audio\ngeneration in few-shot settings. Specifically, YingSound consists of two major\nmodules. The first module uses a conditional flow matching transformer to\nachieve effective semantic alignment in sound generation across audio and\nvisual modalities. This module aims to build a learnable audio-visual\naggregator (AVA) that integrates high-resolution visual features with\ncorresponding audio features at multiple stages. The second module is developed\nwith a proposed multi-modal visual-audio chain-of-thought (CoT) approach to\ngenerate finer sound effects in few-shot settings. Finally, an\nindustry-standard video-to-audio (V2A) dataset that encompasses various\nreal-world scenarios is presented. We show that YingSound effectively generates\nhigh-quality synchronized sounds across diverse conditional inputs through\nautomated evaluations and human studies. Project Page:\n\\url{https://giantailab.github.io/yingsound/}\n","subjects":["Computer Science/Sound","Computer Science/Computer Vision and Pattern Recognition","Computer Science/Multimedia","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"hXaUdNmaOt95ZnvqI1j4ZyHn79jGL_AiI3eExuxqsH8","pdfSize":"8940629"}