{
  "id": "2412.17933",
  "title": "BenCzechMark : A Czech-centric Multitask and Multimetric Benchmark for\n  Large Language Models with Duel Scoring Mechanism",
  "authors": "Martin Fajcik, Martin Docekal, Jan Dolezal, Karel Ondrej, Karel\n  Bene\\v{s}, Jan Kapsa, Pavel Smrz, Alexander Polok, Michal Hradis, Zuzana\n  Neverilova, Ales Horak, Radoslav Sabol, Michal Stefanik, Adam Jirkovsky,\n  David Adamczyk, Petr Hyner, Jan Hula, Hynek Kydlicek",
  "authorsParsed": [
    [
      "Fajcik",
      "Martin",
      ""
    ],
    [
      "Docekal",
      "Martin",
      ""
    ],
    [
      "Dolezal",
      "Jan",
      ""
    ],
    [
      "Ondrej",
      "Karel",
      ""
    ],
    [
      "Beneš",
      "Karel",
      ""
    ],
    [
      "Kapsa",
      "Jan",
      ""
    ],
    [
      "Smrz",
      "Pavel",
      ""
    ],
    [
      "Polok",
      "Alexander",
      ""
    ],
    [
      "Hradis",
      "Michal",
      ""
    ],
    [
      "Neverilova",
      "Zuzana",
      ""
    ],
    [
      "Horak",
      "Ales",
      ""
    ],
    [
      "Sabol",
      "Radoslav",
      ""
    ],
    [
      "Stefanik",
      "Michal",
      ""
    ],
    [
      "Jirkovsky",
      "Adam",
      ""
    ],
    [
      "Adamczyk",
      "David",
      ""
    ],
    [
      "Hyner",
      "Petr",
      ""
    ],
    [
      "Hula",
      "Jan",
      ""
    ],
    [
      "Kydlicek",
      "Hynek",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 19:45:20 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1734983120000,
  "abstract": "  We present BenCzechMark (BCM), the first comprehensive Czech language\nbenchmark designed for large language models, offering diverse tasks, multiple\ntask formats, and multiple evaluation metrics. Its scoring system is grounded\nin statistical significance theory and uses aggregation across tasks inspired\nby social preference theory. Our benchmark encompasses 50 challenging tasks,\nwith corresponding test datasets, primarily in native Czech, with 11 newly\ncollected ones. These tasks span 8 categories and cover diverse domains,\nincluding historical Czech news, essays from pupils or language learners, and\nspoken word.\n  Furthermore, we collect and clean BUT-Large Czech Collection, the largest\npublicly available clean Czech language corpus, and use it for (i)\ncontamination analysis, (ii) continuous pretraining of the first Czech-centric\n7B language model, with Czech-specific tokenization. We use our model as a\nbaseline for comparison with publicly available multilingual models. Lastly, we\nrelease and maintain a leaderboard, with existing 44 model submissions, where\nnew model submissions can be made at\nhttps://huggingface.co/spaces/CZLC/BenCzechMark.\n",
  "subjects": [
    "Computer Science/Computation and Language",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "glV1prfBp7BeFK_GX-rVbppuBS7ZInLaFrEdHoIB9yo",
  "pdfSize": "19841305"
}