{
  "id": "2412.19280",
  "title": "Parametrizations of All Stable Closed-loop Responses: From Theory to\n  Neural Network Control Design",
  "authors": "Clara Luc\\'ia Galimberti, Luca Furieri, Giancarlo Ferrari-Trecate",
  "authorsParsed": [
    [
      "Galimberti",
      "Clara Lucía",
      ""
    ],
    [
      "Furieri",
      "Luca",
      ""
    ],
    [
      "Ferrari-Trecate",
      "Giancarlo",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 26 Dec 2024 16:52:19 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735231939000,
  "abstract": "  The complexity of modern control systems necessitates architectures that\nachieve high performance while ensuring robust stability, particularly for\nnonlinear systems. In this work, we tackle the challenge of designing optimal\noutput-feedback controllers to boost the performance of $\\ell_p$-stable\ndiscrete-time nonlinear systems while preserving closed-loop stability from\nexternal disturbances to input and output channels. Leveraging operator theory\nand neural network representations, we parametrize the achievable closed-loop\nmaps for a given system and propose novel parametrizations of all\n$\\ell_p$-stabilizing controllers, unifying frameworks such as nonlinear Youla\nand Internal Model Control. Contributing to a rapidly growing research line,\nour approach enables unconstrained optimization exclusively over stabilizing\noutput-feedback controllers and provides sufficient conditions to ensure\nrobustness against model mismatch. Additionally, our methods reveal that\nstronger notions of stability can be imposed on the closed-loop maps if\ndisturbance realizations are available after one time step. Last, our\napproaches are compatible with the design of nonlinear distributed controllers.\nNumerical experiments on cooperative robotics demonstrate the flexibility of\nour framework, allowing cost functions to be freely designed for achieving\ncomplex behaviors while preserving stability.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Systems and Control",
    "Computer Science/Systems and Control"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "tlynEi-GD8NPMAsFXau05a2tGXLymKzKOeM2JydjQvg",
  "pdfSize": "1848954"
}