{"id":"2412.01807","title":"Occam's LGS: A Simple Approach for Language Gaussian Splatting","authors":"Jiahuan Cheng, Jan-Nico Zaech, Luc Van Gool, Danda Pani Paudel","authorsParsed":[["Cheng","Jiahuan",""],["Zaech","Jan-Nico",""],["Van Gool","Luc",""],["Paudel","Danda Pani",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 18:50:37 GMT"}],"updateDate":"2024-12-03","timestamp":1733165437000,"abstract":"  TL;DR: Gaussian Splatting is a widely adopted approach for 3D scene\nrepresentation that offers efficient, high-quality 3D reconstruction and\nrendering. A major reason for the success of 3DGS is its simplicity of\nrepresenting a scene with a set of Gaussians, which makes it easy to interpret\nand adapt. To enhance scene understanding beyond the visual representation,\napproaches have been developed that extend 3D Gaussian Splatting with semantic\nvision-language features, especially allowing for open-set tasks. In this\nsetting, the language features of 3D Gaussian Splatting are often aggregated\nfrom multiple 2D views. Existing works address this aggregation problem using\ncumbersome techniques that lead to high computational cost and training time.\n  In this work, we show that the sophisticated techniques for language-grounded\n3D Gaussian Splatting are simply unnecessary. Instead, we apply Occam's razor\nto the task at hand and perform weighted multi-view feature aggregation using\nthe weights derived from the standard rendering process, followed by a simple\nheuristic-based noisy Gaussian filtration. Doing so offers us state-of-the-art\nresults with a speed-up of two orders of magnitude. We showcase our results in\ntwo commonly used benchmark datasets: LERF and 3D-OVS. Our simple approach\nallows us to perform reasoning directly in the language features, without any\ncompression whatsoever. Such modeling in turn offers easy scene manipulation,\nunlike the existing methods -- which we illustrate using an application of\nobject insertion in the scene. Furthermore, we provide a thorough discussion\nregarding the significance of our contributions within the context of the\ncurrent literature. Project Page: https://insait-institute.github.io/OccamLGS/\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"LiuLC_QQtblvyxXrp0NuIOrHKMLmGhWAr6nP-0eWihk","pdfSize":"5392287"}