{"id":"2412.18812","title":"A Tractable Approach for Queueing Analysis on Buffer-Aware Scheduling","authors":"Lintao Li and Wei Chen","authorsParsed":[["Li","Lintao",""],["Chen","Wei",""]],"versions":[{"version":"v1","created":"Wed, 25 Dec 2024 07:46:27 GMT"},{"version":"v2","created":"Wed, 15 Jan 2025 08:17:33 GMT"}],"updateDate":"2025-01-16","timestamp":1735112787000,"abstract":"  Low-latency communication has recently attracted considerable attention owing\nto its potential of enabling delay-sensitive services in next-generation\nindustrial cyber-physical systems. To achieve target average or maximum delay\ngiven random arrivals and time-varying channels, buffer-aware scheduling is\nexpected to play a vital role. Evaluating and optimizing buffer-aware\nscheduling relies on its queueing analysis, while existing tools are not\nsufficiently tractable. Particularly, Markov chain and Monte-Carlo based\napproaches are computationally intensive, while large deviation theory (LDT)\nand extreme value theory (EVT) fail in providing satisfactory accuracy in the\nsmall-queue-length (SQL) regime. To tackle these challenges, a tractable yet\naccurate queueing analysis is presented by judiciously bridging Markovian\nanalysis for the computationally manageable SQL regime and LDT/EVT for\nlarge-queue-length (LQL) regime where approximation error diminishes\nasymptotically. Specifically, we leverage censored Markov chain augmentation to\napproximate the original one in the SQL regime, while a piecewise approach is\nconceived to apply LDT/EVT across various queue-length intervals with different\nscheduling parameters. Furthermore, we derive closed-form bounds on\napproximation errors, validating the rigor and accuracy of our approach. As a\ncase study, the approach is applied to analytically analyze a\nLyapunov-drift-based cross-layer scheduling for wireless transmissions.\nNumerical results demonstrate its potential in balancing accuracy and\ncomplexity.\n","subjects":["Computer Science/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"2i9pdyYjf6H1n-CH6yt1A_rrDkXsgxwIQzRjKdpgg8s","pdfSize":"1040529"}