{"id":"2412.09024","title":"Interacting dark energy models","authors":"Robert Rugg, Shambel Sahlu, and Amare Abebe","authorsParsed":[["Rugg","Robert",""],["Sahlu","Shambel",""],["Abebe","Amare",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 07:39:41 GMT"}],"updateDate":"2024-12-13","timestamp":1733989181000,"abstract":"  This work focuses on two linear interaction models between dark matter and\ndark energy, which are proposed as key factors in explaining cosmic history,\nspecifically the latetime accelerating expansion of the universe. Both models\nare constrained using a Markov chain Monte Carlo analysis (MCMC) using\ndifferent sets of observational data. The analysis was composed using the\nPantheon data set, consisting of 1048 points of SNIa distance moduli\nmeasurements from the Pantheon analysis and the Observed Hubble Parameter (OHD)\ndata set using Baryon acoustic Oscillation (BAO), consisting of 57 data points\nusing distance and expansion rate measurement. Both models showed promising\nresults with the OHD data (BAO), with a interaction that results in a higher\ndark matter content of 56% and 44%, and a Hubble parameter of 65.7+-3km/ s/Mpc\nand 65.8+-3km/ s/Mpc for the interaction dependent on dark matter and dark\nenergy respectively. The pantheon data set however predicted a reverse\ninteraction for both models which does not follow initial assumptions that were\nmade. The pantheon data measured a dark matter content of 18% and 20% with a\nHubble parameter of 72.1 +- 0.003km/ s/Mpc and 72.3 +- 0.004km /s/Mpc. The\nconstrained results are used to revisit the coincidence problem and other\nproblems in standard cosmology. The analysis provided a discrepancy between the\ndifferent data sets with one having a large error margin.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"RstKxczsLVZBCpDzInSPA5OnvKj0lOdj5JgsyCa8qX8","pdfSize":"994298"}