{"id":"2412.05658","title":"Recent advances in hydrogen production using sulfide-based\n  photocatalysts","authors":"Suresh Chandra Baral, Dilip Sasmal, Mitali Hupele, Sradhanjali Lenka\n  and Somaditya Sen","authorsParsed":[["Baral","Suresh Chandra",""],["Sasmal","Dilip",""],["Hupele","Mitali",""],["Lenka","Sradhanjali",""],["Sen","Somaditya",""]],"versions":[{"version":"v1","created":"Sat, 7 Dec 2024 14:05:41 GMT"}],"updateDate":"2024-12-10","timestamp":1733580341000,"abstract":"  Sulfide-based photocatalysts (PC) are promising materials for efficiently\nproducing hydrogen (H2). This chapter aims to provide a detailed survey of the\nrecent advancements in sulfide-based photocatalysts and emphasize their\nenhanced performance and pathways to efficient H2 production. A detailed\nsummary has been given, including several metal sulfides, such as cadmium\nsulfide (CdS), zinc sulfide (ZnS), molybdenum disulfide (MoS2), tungsten\ndisulfide (WS2), lead sulfide (PbS), nickel sulfides (NiS/NiS2), iron disulfide\n(FeS2), copper sulfides (CuS/Cu2S), cobalt sulfides (CoS/CoS2), tin disulfide\n(SnS2), indium sulfide (In2S3), bismuth sulfide (Bi2S3), zinc cadmium sulfide\n(ZnxCd1-xS), manganese cadmium sulfide (MnxCd1-xS), zinc indium sulfide\n(ZnIn2S4), and cadmium indium sulfide (CdIn2S4). This chapter will focus on the\nlatest advancements in metal-sulfide-based materials for photocatalytic\nhydrogen evolution reactions (HER), taking its accelerated growth and excellent\nresearch into account. After briefly outlining the basic properties, the\nchapter will showcase the cutting-edge strategies and recent research progress,\nincluding the construction of heterojunctions, defect engineering, co-catalyst\nloading, elemental doping, and single-atom engineering, which improve the\nelectronic structure and charge separation capabilities of metal sulfides for\nphotocatalytic hydrogen production. A future perspective and outlook have been\nproposed, focusing on some key points and a standard protocol. With this\nknowledge, we hope sulfide-based photocatalysts can be modified and engineered\nto improve their efficiency and stability in future research.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"go-b5OGiUVnHTDZ2y5sJtG14qr3aADM0EhQwnJ3lYoI","pdfSize":"1518243"}