{
  "id": "2412.20210",
  "title": "Towards Real-Time 2D Mapping: Harnessing Drones, AI, and Computer Vision\n  for Advanced Insights",
  "authors": "Bharath Kumar Agnur",
  "authorsParsed": [
    [
      "Agnur",
      "Bharath Kumar",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 28 Dec 2024 16:47:18 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 31 Dec 2024 15:09:14 GMT"
    }
  ],
  "updateDate": "2025-01-03",
  "timestamp": 1735404438000,
  "abstract": "  This paper presents an advanced mapping system that combines drone imagery\nwith machine learning and computer vision to overcome challenges in speed,\naccuracy, and adaptability across diverse terrains. By automating processes\nlike feature detection, image matching, and stitching, the system produces\nseamless, high-resolution maps with minimal latency, offering strategic\nadvantages in defense operations. Developed in Python, the system utilizes\nOpenCV for image processing, NumPy for efficient computations, and\nConcurrent[dot]futures for parallel execution. ORB (Oriented FAST and Rotated\nBRIEF) is employed for feature detection, while FLANN (Fast Library for\nApproximate Nearest Neighbors) ensures accurate keypoint matching. Homography\ntransformations align overlapping images, resulting in distortion-free maps in\nreal time. This automation eliminates manual intervention, enabling live\nupdates essential in rapidly changing environments. Designed for versatility,\nthe system performs reliably under various lighting conditions and rugged\nterrains, making it highly suitable for aerospace and defense applications.\nTesting has shown notable improvements in processing speed and accuracy\ncompared to conventional methods, enhancing situational awareness and informed\ndecision-making. This scalable solution leverages cutting-edge technologies to\nprovide actionable, reliable data for mission-critical operations.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "J-ApYD9R6U4B3ef32jsChzJEc20L5xCi72xawpD93Vo",
  "pdfSize": "865072"
}