{"id":"2412.07051","title":"A Misclassification Network-Based Method for Comparative Genomic\n  Analysis","authors":"Wan He, Tina Eliassi-Rad, Samuel V. Scarpino","authorsParsed":[["He","Wan",""],["Eliassi-Rad","Tina",""],["Scarpino","Samuel V.",""]],"versions":[{"version":"v1","created":"Mon, 9 Dec 2024 23:22:15 GMT"},{"version":"v2","created":"Sun, 12 Jan 2025 01:17:09 GMT"},{"version":"v3","created":"Wed, 15 Jan 2025 22:50:44 GMT"}],"updateDate":"2025-01-17","timestamp":1733786535000,"abstract":"  Classifying genome sequences based on metadata has been an active area of\nresearch in comparative genomics for decades with many important applications\nacross the life sciences. Established methods for classifying genomes can be\nbroadly grouped into sequence alignment-based and alignment-free models.\nConventional alignment-based models rely on genome similarity measures\ncalculated based on local sequence alignments or consistent ordering among\nsequences. However, such methods are computationally expensive when dealing\nwith large ensembles of even moderately sized genomes. In contrast,\nalignment-free (AF) approaches measure genome similarity based on summary\nstatistics in an unsupervised setting and are efficient enough to analyze large\ndatasets. However, both alignment-based and AF methods typically assume fixed\nscoring rubrics that lack the flexibility to assign varying importance to\ndifferent parts of the sequences based on prior knowledge. In this study, we\nintegrate AI and network science approaches to develop a comparative genomic\nanalysis framework that addresses these limitations. Our approach, termed the\nGenome Misclassification Network Analysis (GMNA), simultaneously leverages\nmisclassified instances, a learned scoring rubric, and label information to\nclassify genomes based on associated metadata and better understand potential\ndrivers of misclassification. We evaluate the utility of the GMNA using Naive\nBayes and convolutional neural network models, supplemented by additional\nexperiments with transformer-based models, to construct SARS-CoV-2 sampling\nlocation classifiers using over 500,000 viral genome sequences and study the\nresulting network of misclassifications. We demonstrate the global health\npotential of the GMNA by leveraging the SARS-CoV-2 genome misclassification\nnetworks to investigate the role human mobility played in structuring\ngeographic clustering of SARS-CoV-2.\n","subjects":["Quantitative Biology/Genomics","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"MgAC3HIza2oAuHM8lRYLUXQcUn9U0D3iIVmIRLwX61k","pdfSize":"6419431"}