{"id":"2412.01825","title":"GETAE: Graph information Enhanced deep neural NeTwork ensemble\n  ArchitecturE for fake news detection","authors":"Ciprian-Octavian Truic\\u{a} and Elena-Simona Apostol and Marius\n  Marogel and Adrian Paschke","authorsParsed":[["Truică","Ciprian-Octavian",""],["Apostol","Elena-Simona",""],["Marogel","Marius",""],["Paschke","Adrian",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 18:59:50 GMT"}],"updateDate":"2024-12-03","timestamp":1733165990000,"abstract":"  In today's digital age, fake news has become a major problem that has serious\nconsequences, ranging from social unrest to political upheaval. To address this\nissue, new methods for detecting and mitigating fake news are required. In this\nwork, we propose to incorporate contextual and network-aware features into the\ndetection process. This involves analyzing not only the content of a news\narticle but also the context in which it was shared and the network of users\nwho shared it, i.e., the information diffusion. Thus, we propose GETAE,\n\\underline{G}raph Information \\underline{E}nhanced Deep Neural\nNe\\underline{t}work Ensemble \\underline{A}rchitectur\\underline{E} for Fake News\nDetection, a novel ensemble architecture that uses textual content together\nwith the social interactions to improve fake news detection. GETAE contains two\nBranches: the Text Branch and the Propagation Branch. The Text Branch uses Word\nand Transformer Embeddings and a Deep Neural Network based on feed-forward and\nbidirectional Recurrent Neural Networks (\\textsc{[Bi]RNN}) for learning novel\ncontextual features and creating a novel Text Content Embedding. The\nPropagation Branch considers the information propagation within the graph\nnetwork and proposes a Deep Learning architecture that employs Node Embeddings\nto create novel Propagation Embedding. GETAE Ensemble combines the two novel\nembeddings, i.e., Text Content Embedding and Propagation Embedding, to create a\nnovel \\textit{Propagation-Enhanced Content Embedding} which is afterward used\nfor classification. The experimental results obtained on two real-world\npublicly available datasets, i.e., Twitter15 and Twitter16, prove that using\nthis approach improves fake news detection and outperforms state-of-the-art\nmodels.\n","subjects":["Computer Science/Artificial Intelligence","Computer Science/Computation and Language"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"gsYP9LqDuhfGbdrTbEgng_RrMAN-lkVgWPXiAIEsg8o","pdfSize":"907088"}