{
  "id": "2412.12632",
  "title": "What External Knowledge is Preferred by LLMs? Characterizing and\n  Exploring Chain of Evidence in Imperfect Context",
  "authors": "Zhiyuan Chang, Mingyang Li, Xiaojun Jia, Junjie Wang, Yuekai Huang,\n  Qing Wang, Yihao Huang, Yang Liu",
  "authorsParsed": [
    [
      "Chang",
      "Zhiyuan",
      ""
    ],
    [
      "Li",
      "Mingyang",
      ""
    ],
    [
      "Jia",
      "Xiaojun",
      ""
    ],
    [
      "Wang",
      "Junjie",
      ""
    ],
    [
      "Huang",
      "Yuekai",
      ""
    ],
    [
      "Wang",
      "Qing",
      ""
    ],
    [
      "Huang",
      "Yihao",
      ""
    ],
    [
      "Liu",
      "Yang",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 07:49:49 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734421789000,
  "abstract": "  Incorporating external knowledge into large language models (LLMs) has\nemerged as a promising approach to mitigate outdated knowledge and\nhallucination in LLMs. However, external knowledge is often imperfect. In\naddition to useful knowledge, external knowledge is rich in irrelevant or\nmisinformation in the context that can impair the reliability of LLM responses.\nThis paper focuses on LLMs' preferred external knowledge in imperfect contexts\nwhen handling multi-hop QA. Inspired by criminal procedural law's Chain of\nEvidence (CoE), we characterize that knowledge preferred by LLMs should\nmaintain both relevance to the question and mutual support among knowledge\npieces. Accordingly, we propose an automated CoE discrimination approach and\nexplore LLMs' preferences from their effectiveness, faithfulness and\nrobustness, as well as CoE's usability in a naive Retrieval-Augmented\nGeneration (RAG) case. The evaluation on five LLMs reveals that CoE enhances\nLLMs through more accurate generation, stronger answer faithfulness, better\nrobustness against knowledge conflict, and improved performance in a popular\nRAG case.\n",
  "subjects": [
    "Computer Science/Computation and Language",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "s4CSCLkyngZcJSXOORUS4_FvNnKRJ6QW93ifQQnsIOQ",
  "pdfSize": "5809760"
}