{"id":"2412.06999","title":"Influence of the turbulent magnetic pressure on isothermal jet emitting\n  disks","authors":"N. Zimniak, J. Ferreira, J. Jacquemin-Ide","authorsParsed":[["Zimniak","N.",""],["Ferreira","J.",""],["Jacquemin-Ide","J.",""]],"versions":[{"version":"v1","created":"Mon, 9 Dec 2024 21:07:53 GMT"}],"updateDate":"2024-12-11","timestamp":1733778473000,"abstract":"  The theory of jet emitting disks (JEDs) provides a mathematical framework for\na self-consistent treatment of steady-state accretion and ejection. A\nlarge-scale vertical magnetic field threads the accretion disk where magnetic\nturbulence occurs in a strongly magnetized plasma. A fraction of mass leaves\nthe disk and feeds the two laminar super-Alf\\'enic jets. In previous treatments\nof JEDs, the disk turbulence has been considered to provide only anomalous\ntransport coefficients, namely magnetic diffusivities and viscosity. However,\n3D numerical experiments show that turbulent magnetic pressure also sets in. We\nincluded this additional pressure term using a prescription that is consistent\nwith the latest 3D global (and local) simulations. We then solved the complete\nsystem of self-similar magnetohydrodynamic (MHD) equations, accounting for all\ndynamical terms. The disk becomes puffier and less electrically conductive,\ncausing radial and toroidal electric currents to flow at the disk surface.\nField lines within the disk become straighter, with their bending and shearing\noccurring mainly at the surface. Accretion remains supersonic, but becomes\nfaster at the disk surface. Large values of both turbulent pressure and\nmagnetic diffusivities allow powerful jets to be driven, and their combined\neffects have a constructive influence. Nevertheless, cold outflows do not seem\nto be able to reproduce mass-loss rates as large as those observed in numerical\nsimulations. Our results are a major upgrade of the JED theory, allowing a\ndirect comparison with full 3D global numerical simulations. We argue that JEDs\nprovide a state-of-the-art mathematical description of the disk configurations\nobserved in numerical simulations, commonly referred to as magnetically\narrested disks (MADs). However, further efforts from both theoretical and\nnumerical perspectives are needed to firmly establish this point.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"s80NKowrhDYoLm3Wcm3wwvCFhD98gfCPmo8LYW3n5Tw","pdfSize":"21087492"}