{
  "id": "2412.12964",
  "title": "Policy-relevance of a Model Inter-comparison: Switzerland in the\n  European Energy Transition",
  "authors": "Ambra Van Liedekerke, Blazhe Gjorgiev, Jonas Savelsberg, Xin Wen,\n  J\\'er\\^ome Dujardin, Ali Darudi, Jan-Philipp Sasse, Evelina Trutnevyte,\n  Michael Lehning, Giovanni Sansavini",
  "authorsParsed": [
    [
      "Van Liedekerke",
      "Ambra",
      ""
    ],
    [
      "Gjorgiev",
      "Blazhe",
      ""
    ],
    [
      "Savelsberg",
      "Jonas",
      ""
    ],
    [
      "Wen",
      "Xin",
      ""
    ],
    [
      "Dujardin",
      "Jérôme",
      ""
    ],
    [
      "Darudi",
      "Ali",
      ""
    ],
    [
      "Sasse",
      "Jan-Philipp",
      ""
    ],
    [
      "Trutnevyte",
      "Evelina",
      ""
    ],
    [
      "Lehning",
      "Michael",
      ""
    ],
    [
      "Sansavini",
      "Giovanni",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 14:50:32 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734447032000,
  "abstract": "  The energy transition is reshaping electricity systems, bringing new\nchallenges, and emphasizing the need for strategic planning. Energy policies\nplay a crucial role in guiding this transition. However, assessing their\nimpacts often requires robust modeling involving multiple models and going\nbeyond a single country's scope, analyzing international interactions. In this\nstudy, we examine three Swiss energy policies, analyzing their impacts on both\nthe national energy system and the cross-border electricity flows. We use a\nmodel inter-comparison approach with four electricity system models to explore\nscenarios involving Swiss renewable generation targets, the Swiss market\nintegration, and the Swiss winter import limitations, in the context of various\nEuropean electricity developments. The results indicate that a renewable\ngeneration target leads to a reduction in net imports and electricity prices.\nAdditionally, reduced market integration impacts both Swiss and European energy\ntransitions by limiting trade benefits, underutilizing Variable Renewable\nEnergy Sources (VRES), and increasing electricity supply costs. Lastly, we\nobserve that limiting Swiss winter imports adversely affects electricity\ntrading, driving up both supply costs and electricity prices.\n",
  "subjects": [
    "Physics/Physics and Society"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "LJKZExjPvaj0oP-4k2xAO9uiLoo9mcvtX7W7Vlg-7k0",
  "pdfSize": "4620742"
}