{"id":"2412.11054","title":"The $N_2V$ color center: a ubiquitous visible and near-infrared-II\n  quantum emitter in nitrogen-doped diamond","authors":"Brett C. Johnson, Mitchell O. de Vries, Alexander J. Healey, Marco\n  Capelli, Anjay Manian, Giannis Thalassinos, Amanda N. Abraham, Harini\n  Hapuarachchi, Tingpeng Luo, Vadym Mochalin, Jan Jeske, Jared H. Cole, Salvy\n  Russo, Brant C. Gibson, Alastair Stacey, Philipp Reineck","authorsParsed":[["Johnson","Brett C.",""],["de Vries","Mitchell O.",""],["Healey","Alexander J.",""],["Capelli","Marco",""],["Manian","Anjay",""],["Thalassinos","Giannis",""],["Abraham","Amanda N.",""],["Hapuarachchi","Harini",""],["Luo","Tingpeng",""],["Mochalin","Vadym",""],["Jeske","Jan",""],["Cole","Jared H.",""],["Russo","Salvy",""],["Gibson","Brant C.",""],["Stacey","Alastair",""],["Reineck","Philipp",""]],"versions":[{"version":"v1","created":"Sun, 15 Dec 2024 05:17:02 GMT"},{"version":"v2","created":"Wed, 18 Dec 2024 21:13:13 GMT"}],"updateDate":"2024-12-20","timestamp":1734239822000,"abstract":"  Photoluminescent defects in diamond, like the nitrogen-vacancy (NV) color\ncenter, are at the forefront of emerging optical quantum technologies. Most\nemit in the visible and near-infrared spectral region below 1000 nm (NIR-I),\nlimiting their applications in photonics, fiber communications, and biology.\nHere, we show that the nitrogen-vacancy-nitrogen ($N_2V$) center, which emits\nin the visible and near-infrared-II (NIR-II, 1000-1700 nm), is ubiquitous in\nas-synthesized and processed nitrogen-doped diamond from bulk samples to\nnanoparticles. We demonstrate that $N_2V$ is also present in commercially\navailable state-of-the-art NV diamond sensing chips made via chemical vapor\ndeposition (CVD). In high-pressure high-temperature (HPHT) diamonds, the\nphotoluminescence (PL) intensity of both $N_2V$ charge states, $N_2V^0$ in the\nvisible and $N_2V^-$ in the NIR-II, increases with increasing substitutional\nnitrogen concentration. We determine the PL lifetime of $N_2V^-$ to be 0.3 ns\nand compare a quantum optical and density functional theory model of the\n$N_2V^-$ with experimental PL spectra. Finally, we show that detonation\nnanodiamonds (DND) show stable PL in the NIR-II, which we attribute to the\n$N_2V$ color center, and use this NIR-II PL to image DNDs inside skin cells.\nOur results will contribute to the scientific and technological exploration and\ndevelopment of the $N_2V$ color center and inspire more research into its\neffect on other color centers in diamond.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"dD9XfCqoLpkRe3xDfNnfYI1UhltYp8zSNe6Kp6NtuA4","pdfSize":"10766000"}