{
  "id": "2412.03878",
  "title": "DiffSign: AI-Assisted Generation of Customizable Sign Language Videos\n  With Enhanced Realism",
  "authors": "Sudha Krishnamurthy, Vimal Bhat, Abhinav Jain",
  "authorsParsed": [
    [
      "Krishnamurthy",
      "Sudha",
      ""
    ],
    [
      "Bhat",
      "Vimal",
      ""
    ],
    [
      "Jain",
      "Abhinav",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 05:18:28 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733375908000,
  "abstract": "  The proliferation of several streaming services in recent years has now made\nit possible for a diverse audience across the world to view the same media\ncontent, such as movies or TV shows. While translation and dubbing services are\nbeing added to make content accessible to the local audience, the support for\nmaking content accessible to people with different abilities, such as the Deaf\nand Hard of Hearing (DHH) community, is still lagging. Our goal is to make\nmedia content more accessible to the DHH community by generating sign language\nvideos with synthetic signers that are realistic and expressive. Using the same\nsigner for a given media content that is viewed globally may have limited\nappeal. Hence, our approach combines parametric modeling and generative\nmodeling to generate realistic-looking synthetic signers and customize their\nappearance based on user preferences. We first retarget human sign language\nposes to 3D sign language avatars by optimizing a parametric model. The\nhigh-fidelity poses from the rendered avatars are then used to condition the\nposes of synthetic signers generated using a diffusion-based generative model.\nThe appearance of the synthetic signer is controlled by an image prompt\nsupplied through a visual adapter. Our results show that the sign language\nvideos generated using our approach have better temporal consistency and\nrealism than signing videos generated by a diffusion model conditioned only on\ntext prompts. We also support multimodal prompts to allow users to further\ncustomize the appearance of the signer to accommodate diversity (e.g. skin\ntone, gender). Our approach is also useful for signer anonymization.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "yqMT9ts6Kt59WQLqm2ecuCdfTqOtGYwDb7ajPEv8hv8",
  "pdfSize": "3468803"
}