{"id":"2412.07609","title":"Optical studies of melanin films as a material for solar light absorbers","authors":"T. Obukhova, M. Semenenko, M. Dusheiko, S. Davidenko, Ye. S.\n  Davidenko, S. S. Davidenko, S. Malyuta, S. Shahan, O. S. Pylypchuk, P.\n  Mochuk, M. Voitovych, T. Kuzmenko, A. Sarikov","authorsParsed":[["Obukhova","T.",""],["Semenenko","M.",""],["Dusheiko","M.",""],["Davidenko","S.",""],["Davidenko","Ye. S.",""],["Davidenko","S. S.",""],["Malyuta","S.",""],["Shahan","S.",""],["Pylypchuk","O. S.",""],["Mochuk","P.",""],["Voitovych","M.",""],["Kuzmenko","T.",""],["Sarikov","A.",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 15:48:27 GMT"}],"updateDate":"2024-12-11","timestamp":1733845707000,"abstract":"  This study investigates optical and electrical properties of thin melanin\nfilms self-organized grown from water solutions of eumelanin extracted from\nedible plants. The melanin films exhibit the characteristics of a transparent\nlow conductive polymer with stable in time electrical parameters. The films\ndemonstrate indirect allowed optical transitions, an optical band gap E_g = 1.7\neV and a phonon energy {\\hbar \\omega} = 0.185 eV as well as a high absorption\ncoefficient in the ultraviolet range, which highlight the film potential for\napplications as light-absorbing layers in photovoltaic solar energy converters.\nAnalysis of infrared transmission spectra evidences presence of a significant\namount of OH groups in the films, pointing to their hydrophilicity, which may\nhave an effect on the film electrical conductivity. It is hypothesized as well\nthat the ratio of sp^3 to sp^2 hybridized CH_n bonds influences the films'\noptical and electrical properties and that higher concentration of the sp^2\nbonds may increase the conductivity due to the enhanced {\\pi}-electron\ndelocalization.\n","subjects":["Condensed Matter/Materials Science","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"mHMQ3Jv2NLLKukfi41hXjSKN5OIWcF8_3-JSXwPEfyI","pdfSize":"667176"}