{"id":"2412.04904","title":"Solid-state qubits in moire superlattices","authors":"Zhigang Song, P\\'eter Udvarhelyi, Yidan Wang, Prineha Narang","authorsParsed":[["Song","Zhigang",""],["Udvarhelyi","Péter",""],["Wang","Yidan",""],["Narang","Prineha",""]],"versions":[{"version":"v1","created":"Fri, 6 Dec 2024 10:00:24 GMT"}],"updateDate":"2024-12-09","timestamp":1733479224000,"abstract":"  Qubits are the fundamental units in quantum computing, but they are also\npivotal for advancements in quantum communication and sensing. Currently, there\nare a variety of platforms for qubits, including cold atoms, superconducting\ncircuits, point defects, and semiconductor quantum dots. In these systems, each\nqubit requires individual preparation, making identical replication a\nchallenging task. Constructing and maintaining stable, scalable qubits remains\na formidable challenge, especially for solid-state qubits. The race to identify\nthe best one remains inconclusive, making the search for new qubits a welcome\nendeavor. Our study introduces moir\\'e superlattices of twisted bilayer\nmaterials as a promising platform for qubits due to their tunability, natural\npatterns, and extensive materials library. Our first-principles calculations\nreveal that when the twist angle between the two layers is sufficiently small,\nthese materials foster identical, localized quantum wells within the moir\\'e\nsuperlattices. Each quantum well accommodates a few dispersionless bands and\nlocalized states, akin to the discrete energy levels of an alkali atom.\nExisting experimental techniques allow for individual initialization,\nmanipulation, and readout of the local quantum states. The vast array of 2D\nmaterials provides a multitude of potential candidates for qubit exploration in\nsuch systems. Due to their inherent scalability and uniformity, our proposed\nqubits present significant advantages over conventional solid-state qubit\nsystems.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"9c-vDfH_t9lEV7uqBaulGLKHBPp4tFWPU3zb7iAVaAc","pdfSize":"1189306"}