{"id":"2412.04810","title":"Origin of Increased Curie Temperature in Lithium-Substituted\n  Ferroelectric Niobate Perovskite: Enhancement of the Soft Polar Mode","authors":"Hao-Cheng Thong, Fang-Zhou Yao, Xian-Xian Cai, Ze Xu, Mao-Hua Zhang,\n  Huazhang Zhang, Ben Xu, Yan Wei, Shi-Dong Wang, and Ke Wang","authorsParsed":[["Thong","Hao-Cheng",""],["Yao","Fang-Zhou",""],["Cai","Xian-Xian",""],["Xu","Ze",""],["Zhang","Mao-Hua",""],["Zhang","Huazhang",""],["Xu","Ben",""],["Wei","Yan",""],["Wang","Shi-Dong",""],["Wang","Ke",""]],"versions":[{"version":"v1","created":"Fri, 6 Dec 2024 06:58:40 GMT"}],"updateDate":"2024-12-09","timestamp":1733468320000,"abstract":"  The functionality of ferroelectrics is often constrained by their Curie\ntemperature, above which depolarization occurs. Lithium (Li) is the only\nexperimentally known substitute that can increase the Curie temperature in\nferroelectric niobate-based perovskites, yet the mechanism remains unresolved.\nHere, the unique phenomenon in Li-substituted KNbO3 is investigated using\nfirst-principles density functional theory. Theoretical calculations show that\nLi substitution at the A-site of perovskite introduces compressive chemical\npressure, reducing Nb-O hybridization and associated ferroelectric instability.\nHowever, the large off-center displacement of the Li cation compensates for\nthis reduction and further enhances the soft polar mode, thereby raising the\nCurie temperature. In addition, the stability of the tetragonal phase over the\northorhombic phase is predicted upon Li substitution, which reasonably explains\nthe experimental observation of a decreased orthorhombic-to-tetragonal phase\ntransition temperature. Finally, a metastable anti-phase polar state in which\nthe Li cation displaces oppositely to the Nb cation is revealed, which could\nalso contribute to the variation of phase transition temperatures. These\nfindings provide critical insights into the atomic-scale mechanisms governing\nCurie temperature enhancement in ferroelectrics and pave the way for designing\nadvanced ferroelectric materials with improved thermal stability and functional\nperformance.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"XGBaW-eD9vgD1EHPv7vKlx18FruFcVICYzhB7x2xd5g","pdfSize":"1892354"}