{"id":"2412.07766","title":"Make-A-Texture: Fast Shape-Aware Texture Generation in 3 Seconds","authors":"Xiaoyu Xiang, Liat Sless Gorelik, Yuchen Fan, Omri Armstrong, Forrest\n  Iandola, Yilei Li, Ita Lifshitz, Rakesh Ranjan","authorsParsed":[["Xiang","Xiaoyu",""],["Gorelik","Liat Sless",""],["Fan","Yuchen",""],["Armstrong","Omri",""],["Iandola","Forrest",""],["Li","Yilei",""],["Lifshitz","Ita",""],["Ranjan","Rakesh",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 18:58:29 GMT"},{"version":"v2","created":"Mon, 27 Jan 2025 05:48:05 GMT"}],"updateDate":"2025-01-28","timestamp":1733857109000,"abstract":"  We present Make-A-Texture, a new framework that efficiently synthesizes\nhigh-resolution texture maps from textual prompts for given 3D geometries. Our\napproach progressively generates textures that are consistent across multiple\nviewpoints with a depth-aware inpainting diffusion model, in an optimized\nsequence of viewpoints determined by an automatic view selection algorithm.\n  A significant feature of our method is its remarkable efficiency, achieving a\nfull texture generation within an end-to-end runtime of just 3.07 seconds on a\nsingle NVIDIA H100 GPU, significantly outperforming existing methods. Such an\nacceleration is achieved by optimizations in the diffusion model and a\nspecialized backprojection method. Moreover, our method reduces the artifacts\nin the backprojection phase, by selectively masking out non-frontal faces, and\ninternal faces of open-surfaced objects.\n  Experimental results demonstrate that Make-A-Texture matches or exceeds the\nquality of other state-of-the-art methods. Our work significantly improves the\napplicability and practicality of texture generation models for real-world 3D\ncontent creation, including interactive creation and text-guided texture\nediting.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Graphics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"RUr2u76TC7S81tuIUh6F3BvqfhMaMV6gaWNPEGgGzBA","pdfSize":"9153420"}