{"id":"2412.05305","title":"AdaptiveMDL-GenClust: A Robust Clustering Framework Integrating\n  Normalized Mutual Information and Evolutionary Algorithms","authors":"H. Jahani, F. Zamio","authorsParsed":[["Jahani","H.",""],["Zamio","F.",""]],"versions":[{"version":"v1","created":"Tue, 26 Nov 2024 20:26:14 GMT"},{"version":"v2","created":"Wed, 11 Dec 2024 14:26:35 GMT"},{"version":"v3","created":"Thu, 12 Dec 2024 02:41:04 GMT"}],"updateDate":"2024-12-13","timestamp":1732652774000,"abstract":"  Clustering algorithms are pivotal in data analysis, enabling the organization\nof data into meaningful groups. However, individual clustering methods often\nexhibit inherent limitations and biases, preventing the development of a\nuniversal solution applicable to diverse datasets. To address these challenges,\nwe introduce a robust clustering framework that integrates the Minimum\nDescription Length (MDL) principle with a genetic optimization algorithm. The\nframework begins with an ensemble clustering approach to generate an initial\nclustering solution, which is then refined using MDL-guided evaluation\nfunctions and optimized through a genetic algorithm. This integration allows\nthe method to adapt to the dataset's intrinsic properties, minimizing\ndependency on the initial clustering input and ensuring a data-driven, robust\nclustering process. We evaluated the proposed method on thirteen benchmark\ndatasets using four established validation metrics: accuracy, normalized mutual\ninformation (NMI), Fisher score, and adjusted Rand index (ARI). Experimental\nresults demonstrate that our approach consistently outperforms traditional\nclustering methods, yielding higher accuracy, improved stability, and reduced\nbias. The methods adaptability makes it effective across datasets with diverse\ncharacteristics, highlighting its potential as a versatile and reliable tool\nfor complex clustering tasks. By combining the MDL principle with genetic\noptimization, this study offers a significant advancement in clustering\nmethodology, addressing key limitations and delivering superior performance in\nvaried applications.\n","subjects":["Computer Science/Neural and Evolutionary Computing","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"hEPI_eH_0O0fET6kGAGgVblZlvXaormVFGFWOrJvg9M","pdfSize":"717613"}