{
  "id": "2412.19403",
  "title": "Fully Data-driven but Interpretable Human Behavioural Modelling with\n  Differentiable Discrete Choice Model",
  "authors": "Fumiyasu Makinoshima, Tatsuya Mitomi, Fumiya Makihara, Eigo Segawa",
  "authorsParsed": [
    [
      "Makinoshima",
      "Fumiyasu",
      ""
    ],
    [
      "Mitomi",
      "Tatsuya",
      ""
    ],
    [
      "Makihara",
      "Fumiya",
      ""
    ],
    [
      "Segawa",
      "Eigo",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 27 Dec 2024 01:53:18 GMT"
    },
    {
      "version": "v2",
      "created": "Wed, 8 Jan 2025 02:43:21 GMT"
    }
  ],
  "updateDate": "2025-01-09",
  "timestamp": 1735264398000,
  "abstract": "  Discrete choice models are essential for modelling various decision-making\nprocesses in human behaviour. However, the specification of these models has\ndepended heavily on domain knowledge from experts, and the fully automated but\ninterpretable modelling of complex human behaviours has been a long-standing\nchallenge. In this paper, we introduce the differentiable discrete choice model\n(Diff-DCM), a fully data-driven method for the interpretable modelling,\nlearning, prediction, and control of complex human behaviours, which is\nrealised by differentiable programming. Solely from input features and choice\noutcomes without any prior knowledge, Diff-DCM can estimate interpretable\nclosed-form utility functions that reproduce observed behaviours. Comprehensive\nexperiments with both synthetic and real-world data demonstrate that Diff-DCM\ncan be applied to various types of data and requires only a small amount of\ncomputational resources for the estimations, which can be completed within tens\nof seconds on a laptop without any accelerators. In these experiments, we also\ndemonstrate that, using its differentiability, Diff-DCM can provide useful\ninsights into human behaviours, such as an optimal intervention path for\neffective behavioural changes. This study provides a strong basis for the fully\nautomated and reliable modelling, prediction, and control of human behaviours.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Human-Computer Interaction",
    "Computer Science/Multiagent Systems"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "k0G2Y98GjxCRHBkCpPY9jRx1aZa1L-GTz6UqlSpsQKM",
  "pdfSize": "2971795"
}