{
  "id": "2412.17728",
  "title": "Warped accretion disks and quasars with episodic periodicity of\n  long-term variations",
  "authors": "Yue-Chang Peng, Jian-Min Wang, Pu Du, Shuo Zhai and Yan-Rong Li",
  "authorsParsed": [
    [
      "Peng",
      "Yue-Chang",
      ""
    ],
    [
      "Wang",
      "Jian-Min",
      ""
    ],
    [
      "Du",
      "Pu",
      ""
    ],
    [
      "Zhai",
      "Shuo",
      ""
    ],
    [
      "Li",
      "Yan-Rong",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 17:18:02 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 24 Dec 2024 14:57:00 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1734974282000,
  "abstract": "  It has been found that some quasars are undergoing quasi-periodic variations\n(most of them with damped amplitudes) in optical bands from long-term\nmonitoring campaigns, but how to explain the origin of such light curve\nvariations still remains an open question. In this paper, we use the warped\naccretion disks model to explain the quasi-periodical variations. This model\nemploys a free-bending wave traveling in an accretion disk which causes the\norientation of the central part of the disk to oscillate from the line of\nsight, resulting in a quasi-periodical variation. We numerically solve the\ngoverning equation of warp propagation and calculate the simulated R-band light\ncurves, finding that the periodical light curves generated by this model have\ndamped amplitudes. To compare with observations, we select\nSDSSJ134820.42+194831.5 as a preliminary example from a sample of periodic\nquasar candidates by combining CRTS with other public survey data, and fitted\nits light curve with different observational angles. Our result gives a reduced\n$\\chi^{2}\\simeq 2.4$, implying that the model might give insights to future\napplication of warped disk model.\n",
  "subjects": [
    "Astrophysics/High Energy Astrophysical Phenomena",
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "3p4sSKNUg6U5TcVqs2P90l0A1KH7GuhubdgCkqwbabY",
  "pdfSize": "691743"
}