{
  "id": "2412.09554",
  "title": "Network Dynamics of Emotional Processing: A Structural Balance Theory\n  Approach",
  "authors": "Sepehr Gourabi, Parinaz Khosravani, Shahrzad Nosrat, Roya Mohammadi,\n  Masoud Lotfalipour",
  "authorsParsed": [
    [
      "Gourabi",
      "Sepehr",
      ""
    ],
    [
      "Khosravani",
      "Parinaz",
      ""
    ],
    [
      "Nosrat",
      "Shahrzad",
      ""
    ],
    [
      "Mohammadi",
      "Roya",
      ""
    ],
    [
      "Lotfalipour",
      "Masoud",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 18:43:41 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1734029021000,
  "abstract": "  Understanding emotional processing in the human brain requires examining the\ncomplex interactions between different brain regions. While previous studies\nhave identified specific regions involved in emotion processing, a holistic\nnetwork approach may provide deeper insights. We use Structural Balance Theory\nto investigate the stability and triadic structures of signed brain networks\nduring resting state and emotional processing, specifically in response to\nfear-related stimuli. We hypothesized that imbalanced triadic interactions\nwould be more prevalent during emotional processing, especially in response to\nfear-related stimuli, potentially reflecting the brain's adaptation to\nemotional challenges. By analyzing fMRI data from 138 healthy, right-handed\nparticipants, we found that emotional processing was marked by an increase in\npositive connections and a decrease in negative connections compared to the\nresting state. Our findings clearly show that balanced triads significantly\ndecreased while imbalanced triads increased, indicating a shift toward\ninstability in the brain's functional network during emotional processing.\nAdditionally, the number of influential hubs was significantly lower during\nfear processing than in neutral conditions, suggesting a more centralized\nnetwork and higher levels of network energy. These findings reveal the brain's\nremarkable adaptive capacity during emotional processing, demonstrating how\nnetwork stability dynamically shifts through changes in balanced and imbalanced\ntriads, hub tendencies, and energy dynamics. Our research illuminates a complex\nmechanism by which the brain flexibly reconfigures its functional network in\nresponse to emotional stimuli with potential implications for understanding\nemotional resilience and neurological disorders.\n",
  "subjects": [
    "Quantitative Biology/Neurons and Cognition"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "BaQjaXe7knhXZpq4tIDh1r39QBLdfi6NqqR-DkSIphY",
  "pdfSize": "1188438"
}