{"id":"2412.01964","title":"Energy-based dual-phase dynamics identification of clearance\n  nonlinearities","authors":"Cristian L\\'opez, Keegan J. Moore","authorsParsed":[["López","Cristian",""],["Moore","Keegan J.",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 20:49:32 GMT"}],"updateDate":"2024-12-04","timestamp":1733172572000,"abstract":"  The energy-based dual-phase dynamics identification (EDDI) method is a new\ndata-driven technique for the discovery of equations of motion (EOMs) of\nstrongly nonlinear single-degree-of-freedom (SDOF) oscillators. This research\nuses the EDDI method to obtain mathematical models for SDOF systems with\nclearance nonlinearities. The first key aspect of the EDDI method is that it\nrelates the kinetic energy of the system to the dissipated energy and the\nunderlying non-conservative forces acting on the oscillator. The second key\naspect is that the EOM is identified with only knowledge of the mass of the\noscillator and the transient response. The first phase of the EDDI method\nconstructs the dissipated energy from the kinetic energy, then identifies a\nmathematical model for the damping based on the dissipated energy. To achieve\nthis, the moments in time when the displacements are zero, where the mechanical\nand kinetic energies are equal, are used to compute the energy dissipated by\nthe damping of the system. The second phase begins by computing the\nconservative force acting on the oscillator from either a balance of the other\nforces in the system or through the Lagrange equation. Finally, the stiffness\nmodel is determined by solving a set of linear equations to construct a\nmathematical model for the conservative (elastic) force. The governing\nequations are discovered by incorporating both the damping and stiffness terms.\nThe method is demonstrated by employing analytical and real measured responses\nof nonlinear SDOF systems with different clearances nonlinearities, which shows\nthat the proposed approach is suitable for non-smooth mechanical systems as\nwell as smooth systems.\n","subjects":["Mathematics/Dynamical Systems"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"p8gz7yIxQGXYHoiWXSOTUe6uSQNp67WVL2bjURT7ls4","pdfSize":"1958736"}