{
  "id": "2412.13639",
  "title": "4D Radar-Inertial Odometry based on Gaussian Modeling and\n  Multi-Hypothesis Scan Matching",
  "authors": "Fernando Amodeo, Luis Merino, Fernando Caballero",
  "authorsParsed": [
    [
      "Amodeo",
      "Fernando",
      ""
    ],
    [
      "Merino",
      "Luis",
      ""
    ],
    [
      "Caballero",
      "Fernando",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 09:11:24 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734513084000,
  "abstract": "  4D millimeter-wave (mmWave) radars are sensors that provide robustness\nagainst adverse weather conditions (rain, snow, fog, etc.), and as such they\nare increasingly being used for odometry and SLAM applications. However, the\nnoisy and sparse nature of the returned scan data proves to be a challenging\nobstacle for existing point cloud matching based solutions, especially those\noriginally intended for more accurate sensors such as LiDAR. Inspired by visual\nodometry research around 3D Gaussian Splatting, in this paper we propose using\nfreely positioned 3D Gaussians to create a summarized representation of a radar\npoint cloud tolerant to sensor noise, and subsequently leverage its inherent\nprobability distribution function for registration (similar to NDT). Moreover,\nwe propose simultaneously optimizing multiple scan matching hypotheses in order\nto further increase the robustness of the system against local optima of the\nfunction. Finally, we fuse our Gaussian modeling and scan matching algorithms\ninto an EKF radar-inertial odometry system designed after current best\npractices. Experiments show that our Gaussian-based odometry is able to\noutperform current baselines on a well-known 4D radar dataset used for\nevaluation.\n",
  "subjects": [
    "Computer Science/Robotics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "8H_GkQ_D5jFap92F3zLgVsYOJZZlBqcS-i8whUgXqhk",
  "pdfSize": "1306185"
}