{"id":"2412.09465","title":"OFTSR: One-Step Flow for Image Super-Resolution with Tunable\n  Fidelity-Realism Trade-offs","authors":"Yuanzhi Zhu, Ruiqing Wang, Shilin Lu, Junnan Li, Hanshu Yan, Kai Zhang","authorsParsed":[["Zhu","Yuanzhi",""],["Wang","Ruiqing",""],["Lu","Shilin",""],["Li","Junnan",""],["Yan","Hanshu",""],["Zhang","Kai",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 17:14:58 GMT"}],"updateDate":"2024-12-13","timestamp":1734023698000,"abstract":"  Recent advances in diffusion and flow-based generative models have\ndemonstrated remarkable success in image restoration tasks, achieving superior\nperceptual quality compared to traditional deep learning approaches. However,\nthese methods either require numerous sampling steps to generate high-quality\nimages, resulting in significant computational overhead, or rely on model\ndistillation, which usually imposes a fixed fidelity-realism trade-off and thus\nlacks flexibility. In this paper, we introduce OFTSR, a novel flow-based\nframework for one-step image super-resolution that can produce outputs with\ntunable levels of fidelity and realism. Our approach first trains a conditional\nflow-based super-resolution model to serve as a teacher model. We then distill\nthis teacher model by applying a specialized constraint. Specifically, we force\nthe predictions from our one-step student model for same input to lie on the\nsame sampling ODE trajectory of the teacher model. This alignment ensures that\nthe student model's single-step predictions from initial states match the\nteacher's predictions from a closer intermediate state. Through extensive\nexperiments on challenging datasets including FFHQ (256$\\times$256), DIV2K, and\nImageNet (256$\\times$256), we demonstrate that OFTSR achieves state-of-the-art\nperformance for one-step image super-resolution, while having the ability to\nflexibly tune the fidelity-realism trade-off. Code and pre-trained models are\navailable at https://github.com/yuanzhi-zhu/OFTSR and\nhttps://huggingface.co/Yuanzhi/OFTSR, respectively.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"91Y23APFd0rvb-KnLfkT2BohMCaRg7vIZkQI48CrHUg","pdfSize":"13347202"}