{"id":"2412.09855","title":"CO-CHANGES II: spatially resolved IRAM 30M CO line observations of 23\n  nearby edge-on spiral galaxies","authors":"Yan Jiang (1 and 2), Jiang-Tao Li (1), Qing-Hua Tan (1), Li Ji (1 and\n  3), Joel N. Bregman (4), Q. Daniel Wang (5), Jian-Fa Wang (1 and 2), Li-Yuan\n  Lu (6 and 1), and Xue-Jian Jiang (7) ((1) Purple Mountain Observatory,\n  Chinese Academy of Sciences, 10 Yuanhua Road, Nanjing 210023, China, (2)\n  School of Astronomy and Space Sciences, University of Science and Technology\n  of China, Hefei 230026, China, (3) Key Laboratory of Dark Matter and Space\n  Astronomy, CAS, Nanjing 210023, China,(4) Department of Astronomy, University\n  of Michigan, 311 West Hall, 1085 S. University Ave, Ann Arbor, MI,\n  48109-1107, U.S.A.,(5) Department of Astronomy, University of Massachusetts,\n  Amherst, MA 01003, U.S.A.,(6) Department of Astronomy, Xiamen University, 422\n  Siming South Road, Xiamen 361005, China,(7) Research Center for Intelligent\n  Computing Platforms, Zhejiang Laboratory, Hangzhou 311100, China)","authorsParsed":[["Jiang","Yan","","1 and 2"],["Li","Jiang-Tao","","1 and\n  3"],["Tan","Qing-Hua","","1 and\n  3"],["Ji","Li","","1 and\n  3"],["Bregman","Joel N.","","1 and 2"],["Wang","Q. Daniel","","1 and 2"],["Wang","Jian-Fa","","1 and 2"],["Lu","Li-Yuan","","6 and 1"],["Jiang","Xue-Jian",""]],"versions":[{"version":"v1","created":"Fri, 13 Dec 2024 04:49:53 GMT"}],"updateDate":"2024-12-16","timestamp":1734065393000,"abstract":"  Molecular gas, as the fuel for star formation, and its relationship with\natomic gas are crucial for understanding how galaxies regulate their star\nforming (SF) activities. We conducted IRAM 30m observations of 23 nearby spiral\ngalaxies from the CHANG-ES project to investigatet the distribution of\nmolecular gas and the Kennicutt-Schmidt law. Combining these results with\natomic gas masses from previous studies, we aim to investigate the scaling\nrelations that connect the molecular and atomic gas masses with stellar masses\nand the baryonic Tully-Fisher relation. Based on spatially resolved\nobservations of the three CO lines, we calculated the total molecular gas\nmasses, the ratios between different CO lines, and derived physical parameters\nsuch as temperature and optical depth. The median line ratios for nuclear/disk\nregions are 8.6/6.1 (^{12}\\mathrm{CO}/^{13}\\mathrm{CO}\\ J=1{-}0) and 0.53/0.39\n(^{12}\\mathrm{CO}\\ J=2{-}1/J=1{-}0). Molecular gas mass derived from\n^{13}\\mathrm{CO} is correlated but systematically lower than that from\n^{12}\\mathrm{CO}. Most galaxies follow the spatially resolved SF scaling\nrelation with a median gas depletion timescale of approximately 1 Gyr, while a\nfew exhibit shorter timescales of approximately 0.1 Gyr. The\nmolecular-to-atomic gas mass ratio correlates strongly with stellar mass,\nconsistent with previous studies. Galaxies with lower stellar masses show an\nexcess of atomic gas, indicating less efficient conversion to molecular gas.\nMost galaxies tightly follow the baryonic Tully-Fisher relation, but NGC 2992\nand NGC 4594 deviate from the relation due to different physical factors. We\nfind that the ratio of the cold gas (comprising molecular and atomic gas) to\nthe total baryon mass decreases with the gravitational potential of the galaxy,\nas traced by rotation velocity, which could be due to gas consumption in SF or\nbeing heated to the hot phase.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"nI55Al05hfEGU6U78rsgRMq_0viSOC4Yelwjp0OAsGM","pdfSize":"2134086"}