{
  "id": "2412.08316",
  "title": "Rumor Detection on Social Media with Temporal Propagation Structure\n  Optimization",
  "authors": "Xingyu Peng, Junran Wu, Ruomei Liu, Ke Xu",
  "authorsParsed": [
    [
      "Peng",
      "Xingyu",
      ""
    ],
    [
      "Wu",
      "Junran",
      ""
    ],
    [
      "Liu",
      "Ruomei",
      ""
    ],
    [
      "Xu",
      "Ke",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 11:53:14 GMT"
    },
    {
      "version": "v2",
      "created": "Thu, 12 Dec 2024 06:18:37 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1733917994000,
  "abstract": "  Traditional methods for detecting rumors on social media primarily focus on\nanalyzing textual content, often struggling to capture the complexity of online\ninteractions. Recent research has shifted towards leveraging graph neural\nnetworks to model the hierarchical conversation structure that emerges during\nrumor propagation. However, these methods tend to overlook the temporal aspect\nof rumor propagation and may disregard potential noise within the propagation\nstructure. In this paper, we propose a novel approach that incorporates\ntemporal information by constructing a weighted propagation tree, where the\nweight of each edge represents the time interval between connected posts.\nDrawing upon the theory of structural entropy, we transform this tree into a\ncoding tree. This transformation aims to preserve the essential structure of\nrumor propagation while reducing noise. Finally, we introduce a recursive\nneural network to learn from the coding tree for rumor veracity prediction.\nExperimental results on two common datasets demonstrate the superiority of our\napproach.\n",
  "subjects": [
    "Computer Science/Social and Information Networks",
    "Computer Science/Computation and Language"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "L92wa5WOGVZWKVvPvlx-LMdmOeb68ZVdOp1OxMWpuh4",
  "pdfSize": "717944"
}