{
  "id": "2412.12106",
  "title": "The Brain-Mesh Model: A Unified Framework For Neural Synchrony,\n  Plasticity, And Coherence",
  "authors": "Andreu Ball\\'us",
  "authorsParsed": [
    [
      "Ballús",
      "Andreu",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 29 Nov 2024 10:52:48 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1732877568000,
  "abstract": "  The brain-mesh model introduces a novel three-layered architecture that\nintegrates local and macro-regional connectivity with an underlying,\nmesh-inspired network layer. This foundational mesh layer, based on metallic\nmesh structures, spans the entire brain and generates interference patterns,\nnoise, and resonance effects that modulate both local and global neural\ndynamics. The fused model goes beyond traditional connectivity frameworks by\nproviding a unified explanation for phenomena such as brain-wide phase\ngradients, stable low-frequency resonance frequencies, and long-range\nplasticity effects, which are often difficult to explain cohesively within\nexisting models.\n  In addition to accounting for classical neurobiological observations, such as\nphase synchrony, functional connectivity fluctuations, and local Hebbian\nplasticity, the model offers novel insights into less understood phenomena.\nSpecifically, it predicts connectivity-independent phase gradients across\nnon-synaptic regions, harmonic resonance peaks consistent across individuals,\nand diffuse plasticity driven by global interference patterns, all of which are\nchallenging to explain under current frameworks.\n  These unique predictions align with partial empirical observations, such as\ntraveling wave dynamics, consistent low-frequency oscillations, and\ntask-induced connectivity shifts, underscoring the model's relevance.\nAdditionally, the brain-mesh model generates testable hypotheses that\ndistinguish it from traditional approaches. This provides a promising framework\nfor future experimental validation and opens new avenues for understanding\nglobal brain function.\n",
  "subjects": [
    "Quantitative Biology/Neurons and Cognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "ZRO_odfRoaDTA4kVKmTzzXEouInSgSo0xwmaRdfVbg8",
  "pdfSize": "359633"
}