{
  "id": "2412.11390",
  "title": "Accurate, Robust and Privacy-Preserving Brain-Computer Interface\n  Decoding",
  "authors": "Xiaoqing Chen, Tianwang Jia, Dongrui Wu",
  "authorsParsed": [
    [
      "Chen",
      "Xiaoqing",
      ""
    ],
    [
      "Jia",
      "Tianwang",
      ""
    ],
    [
      "Wu",
      "Dongrui",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 02:37:38 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734316658000,
  "abstract": "  An electroencephalogram (EEG) based brain-computer interface (BCI) enables\ndirect communication between the brain and external devices. However, EEG-based\nBCIs face at least three major challenges in real-world applications: data\nscarcity and individual differences, adversarial vulnerability, and data\nprivacy. While previous studies have addressed one or two of these issues,\nsimultaneous accommodation of all three challenges remains challenging and\nunexplored. This paper fills this gap, by proposing an Augmented Robustness\nEnsemble (ARE) algorithm and integrating it into three privacy protection\nscenarios (centralized source-free transfer, federated source-free transfer,\nand source data perturbation), achieving simultaneously accurate decoding,\nadversarial robustness, and privacy protection of EEG-based BCIs. Experiments\non three public EEG datasets demonstrated that our proposed approach\noutperformed over 10 classic and state-of-the-art approaches in both accuracy\nand robustness in all three privacy-preserving scenarios, even outperforming\nstate-of-the-art transfer learning approaches that do not consider privacy\nprotection at all. This is the first time that three major challenges in\nEEG-based BCIs can be addressed simultaneously, significantly improving the\npracticalness of EEG decoding in real-world BCIs.\n",
  "subjects": [
    "Computer Science/Human-Computer Interaction",
    "Computer Science/Machine Learning",
    "Electrical Engineering and Systems Science/Signal Processing"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "TQItU8CFBbQN94-wIwtGWPiwSAZzl1CKH6StIVgdVxQ",
  "pdfSize": "2340010"
}