{
  "id": "2412.21034",
  "title": "Novel SiC UV Instrumentation Development with Potential Applications for\n  the Habitable Worlds Observatory",
  "authors": "Prabal Saxena, Zeynep Dilli, Peter Snapp, Allison Youngblood, Tilak\n  Hewagama, Shahid Aslam, Chullhee (Chace) Cho, Augustyn Waczynski, Nader\n  Abuhassan, Ahn T. La, Bryan K. Place, Thomas F. Hansico, Ryan Stauffer, Dina\n  Bower, Akin Akturk, Neil Goldsman, Bryce Galey, Ethan Mountfort, Mitchell\n  Gross, Ryan Purcell, Usama Khalid, Yekta Kamali, Chris Darmody, Robert\n  Washington, Tim Livengood, Daniel P. Moriarty, Carl A. Kotecki, Narasimha S.\n  Prasad, and Joseph Wilkins",
  "authorsParsed": [
    [
      "Saxena",
      "Prabal",
      "",
      "Chace"
    ],
    [
      "Dilli",
      "Zeynep",
      "",
      "Chace"
    ],
    [
      "Snapp",
      "Peter",
      "",
      "Chace"
    ],
    [
      "Youngblood",
      "Allison",
      "",
      "Chace"
    ],
    [
      "Hewagama",
      "Tilak",
      "",
      "Chace"
    ],
    [
      "Aslam",
      "Shahid",
      "",
      "Chace"
    ],
    [
      "Chullhee",
      "",
      "",
      "Chace"
    ],
    [
      "Cho",
      "",
      ""
    ],
    [
      "Waczynski",
      "Augustyn",
      ""
    ],
    [
      "Abuhassan",
      "Nader",
      ""
    ],
    [
      "La",
      "Ahn T.",
      ""
    ],
    [
      "Place",
      "Bryan K.",
      ""
    ],
    [
      "Hansico",
      "Thomas F.",
      ""
    ],
    [
      "Stauffer",
      "Ryan",
      ""
    ],
    [
      "Bower",
      "Dina",
      ""
    ],
    [
      "Akturk",
      "Akin",
      ""
    ],
    [
      "Goldsman",
      "Neil",
      ""
    ],
    [
      "Galey",
      "Bryce",
      ""
    ],
    [
      "Mountfort",
      "Ethan",
      ""
    ],
    [
      "Gross",
      "Mitchell",
      ""
    ],
    [
      "Purcell",
      "Ryan",
      ""
    ],
    [
      "Khalid",
      "Usama",
      ""
    ],
    [
      "Kamali",
      "Yekta",
      ""
    ],
    [
      "Darmody",
      "Chris",
      ""
    ],
    [
      "Washington",
      "Robert",
      ""
    ],
    [
      "Livengood",
      "Tim",
      ""
    ],
    [
      "Moriarty",
      "Daniel P.",
      ""
    ],
    [
      "Kotecki",
      "Carl A.",
      ""
    ],
    [
      "Prasad",
      "Narasimha S.",
      ""
    ],
    [
      "Wilkins",
      "Joseph",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 30 Dec 2024 15:59:08 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735574348000,
  "abstract": "  In this paper, we detail recent and current work that is being carried out to\nfabricate and advance novel SiC UV instrumentation that is aimed at enabling\nmore sensitive measurements across numerous disciplines, with a short\ndiscussion of the promise such detectors may hold for the Habitable Worlds\nObservatory. We discuss SiC instrument development progress that is being\ncarried out under multiple NASA grants, including several PICASSO and SBIR\ngrants, as well as an ECI grant. Testing of pixel design, properties and layout\nas well as maturation of the integration scheme developed through these efforts\nprovide key technology and engineering advancement for potential HWO detectors.\nAchieving desired noise characteristics, responsivity, and validating operation\nof SiC detectors using standard read out techniques offers a compelling\nplatform for operation of denser and higher dimensionality SiC photodiode\narrays of interest for use in potential HWO Coronagraph, Spectrograph, and High\nResolution Imaging Instruments. We incorporate these SiC detector properties\ninto a simulation of potential NUV exoplanet observations by HWO using SiC\ndetectors and also discuss potential application to HWO.\n",
  "subjects": [
    "Astrophysics/Instrumentation and Methods for Astrophysics",
    "Astrophysics/Earth and Planetary Astrophysics",
    "Astrophysics/Astrophysics of Galaxies",
    "Astrophysics/Solar and Stellar Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "ergsqMk7q5Ili2mtWRRVUQxi1nWCRcoUq9wjHWnjmhc",
  "pdfSize": "6946914"
}