{
  "id": "2412.00008",
  "title": "The Copernican Argument for Alien Consciousness; The Mimicry Argument\n  Against Robot Consciousness",
  "authors": "Eric Schwitzgebel and Jeremy Pober",
  "authorsParsed": [
    [
      "Schwitzgebel",
      "Eric",
      ""
    ],
    [
      "Pober",
      "Jeremy",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 12 Nov 2024 17:26:49 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1731432409000,
  "abstract": "  On broadly Copernican grounds, we are entitled to default assume that\napparently behaviorally sophisticated extraterrestrial entities (\"aliens\")\nwould be conscious. Otherwise, we humans would be inexplicably, implausibly\nlucky to have consciousness, while similarly behaviorally sophisticated\nentities elsewhere would be mere shells, devoid of consciousness. However, this\nCopernican default assumption is canceled in the case of behaviorally\nsophisticated entities designed to mimic superficial features associated with\nconsciousness in humans (\"consciousness mimics\"), and in particular a broad\nclass of current, near-future, and hypothetical robots. These considerations,\nwhich we formulate, respectively, as the Copernican and Mimicry Arguments,\njointly defeat an otherwise potentially attractive parity principle, according\nto which we should apply the same types of behavioral or cognitive tests to\naliens and robots, attributing or denying consciousness similarly to the extent\nthey perform similarly. Instead of grounding speculations about alien and robot\nconsciousness in metaphysical or scientific theories about the physical or\nfunctional bases of consciousness, our approach appeals directly to the\nepistemic principles of Copernican mediocrity and inference to the best\nexplanation. This permits us to justify certain default assumptions about\nconsciousness while remaining to a substantial extent neutral about specific\nmetaphysical and scientific theories.\n",
  "subjects": [
    "Quantitative Biology/Neurons and Cognition"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "iCFaWsdYhK4bCGcDLFCY_XP4DFi9hZLMGFww31jVnfo",
  "pdfSize": "338351"
}