{"id":"2412.15459","title":"Neutron stars in 4D Einstein-Gauss-Bonnet gravity","authors":"Alejandro Saavedra, Octavio Fierro, Michael Gammon, Robert B. Mann,\n  Guillermo Rubilar","authorsParsed":[["Saavedra","Alejandro",""],["Fierro","Octavio",""],["Gammon","Michael",""],["Mann","Robert B.",""],["Rubilar","Guillermo",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 23:36:28 GMT"}],"updateDate":"2024-12-23","timestamp":1734651388000,"abstract":"  Since the derivation of a well-defined $D\\to4$ limit for 4D\nEinstein-Gauss-Bonnet (4DEGB) gravity coupled to a scalar field, there has been\nconsiderable interest in testing it as an alternative to Einstein's general\ntheory of relativity. Past work has shown that this theory hosts interesting\ncompact star solutions which are smaller in radius than a Schwarzschild black\nhole of the same mass in general relativity (GR), though the stability of such\nobjects has been subject to question. In this paper we solve the equations for\nradial perturbations of neutron stars in the 4DEGB theory with SLy/BSk class\nEOSs, along with the MS2 EOS, and show that the coincidence of stability and\nmaximum mass points in GR is still present in this modified theory, with the\ninteresting additional feature of solutions re-approaching stability near the\nblack hole solution on the mass-radius diagram. Besides this, as expected from\npast work, we find that larger values of the 4DEGB coupling $\\alpha$ tend to\nincrease the mass of neutron stars of the same radius (due to a larger $\\alpha$\nweakening gravity) and move the maximum mass points of the solution branches\ncloser to the black hole horizon.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Solar and Stellar Astrophysics","Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ne8rpfcx9hdxhpxn99y2hMWLbKKOYU_GNIrnjzJvIVc","pdfSize":"1271720"}