{
  "id": "2412.14946",
  "title": "Joint Models for Handling Non-Ignorable Missing Data using Bayesian\n  Additive Regression Trees: Application to Leaf Photosynthetic Traits Data",
  "authors": "Yong Chen Goh, Wuu Kuang Soh, Andrew C. Parnell, Keefe Murphy",
  "authorsParsed": [
    [
      "Goh",
      "Yong Chen",
      ""
    ],
    [
      "Soh",
      "Wuu Kuang",
      ""
    ],
    [
      "Parnell",
      "Andrew C.",
      ""
    ],
    [
      "Murphy",
      "Keefe",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 15:26:55 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734622015000,
  "abstract": "  Dealing with missing data poses significant challenges in predictive\nanalysis, often leading to biased conclusions when oversimplified assumptions\nabout the missing data process are made. In cases where the data are missing\nnot at random (MNAR), jointly modeling the data and missing data indicators is\nessential. Motivated by a real data application with partially missing\nmultivariate outcomes related to leaf photosynthetic traits and several\nenvironmental covariates, we propose two methods under a selection model\nframework for handling data with missingness in the response variables suitable\nfor recovering various missingness mechanisms. Both approaches use a\nmultivariate extension of Bayesian additive regression trees (BART) to flexibly\nmodel the outcomes. The first approach simultaneously uses a probit regression\nmodel to jointly model the missingness. In scenarios where the relationship\nbetween the missingness and the data is more complex or non-linear, we propose\na second approach using a probit BART model to characterize the missing data\nprocess, thereby employing two BART models simultaneously. Both models also\neffectively handle ignorable covariate missingness. The efficacy of both models\ncompared to existing missing data approaches is demonstrated through extensive\nsimulations, in both univariate and multivariate settings, and through the\naforementioned application to the leaf photosynthetic trait data.\n",
  "subjects": [
    "Statistics/Methodology",
    "Statistics/Applications",
    "Statistics/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "EWbpY7CDcPMyZVn7I8W9d214m2ERFkmj4LaD6wx5pSc",
  "pdfSize": "8733741"
}