{
  "id": "2412.15996",
  "title": "Ti and Spi, Carrollian extended boundaries at timelike and spatial\n  infinity",
  "authors": "Jack Borthwick, Ma\\\"el Chantreau, Yannick Herfray",
  "authorsParsed": [
    [
      "Borthwick",
      "Jack",
      ""
    ],
    [
      "Chantreau",
      "Maël",
      ""
    ],
    [
      "Herfray",
      "Yannick",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 15:45:24 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734709524000,
  "abstract": "  The goal of this paper is to provide a definition for a notion of extended\nboundary at time and space-like infinity which, following\nFigueroa-O'Farril--Have--Prohazka--Salzer, we refer to as Ti and Spi. This\ndefinition applies to asymptotically flat spacetime in the sense of\nAshtekar--Romano and we wish to demonstrate, by example, its pertinence in a\nnumber of situations. The definition is invariant, is constructed solely from\nthe asymptotic data of the metric and is such that automorphisms of the\nextended boundaries are canonically identified with asymptotic symmetries.\nFurthermore, scattering data for massive fields are realised as functions on Ti\nand a geometric identification of cuts of Ti with points of Minkowksi then\nproduces an integral formula of Kirchhoff type. Finally, Ti and Spi are both\nnaturally equipped with (strong) Carrollian geometries which, under mild\nassumptions, enable to reduce the symmetry group down to the BMS group, or to\nPoincar\\'e in the flat case. In particular, Strominger's matching conditions\nare naturally realised by restricting to Carrollian geometries compatible with\na discrete symmetry of Spi.\n",
  "subjects": [
    "Physics/General Relativity and Quantum Cosmology",
    "Physics/High Energy Physics - Theory",
    "Physics/Mathematical Physics",
    "Mathematics/Mathematical Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "MqAXEJR0BqQx7K3_5WerbuPgc8n8OOq0JjNjY24gBXI",
  "pdfSize": "914496"
}