{
  "id": "2412.02686",
  "title": "Electron Beam Characterization via Quantum Coherent Optical Magnetometry",
  "authors": "Nicolas DeStefano, Saeed Pegahan, Aneesh Ramaswamy, Seth Aubin, T.\n  Averett, Alexandre Camsonne, Svetlana Malinovskaya, Eugeniy E. Mikhailov,\n  Gunn Park, Shukui Zhang, and Irina Novikova",
  "authorsParsed": [
    [
      "DeStefano",
      "Nicolas",
      ""
    ],
    [
      "Pegahan",
      "Saeed",
      ""
    ],
    [
      "Ramaswamy",
      "Aneesh",
      ""
    ],
    [
      "Aubin",
      "Seth",
      ""
    ],
    [
      "Averett",
      "T.",
      ""
    ],
    [
      "Camsonne",
      "Alexandre",
      ""
    ],
    [
      "Malinovskaya",
      "Svetlana",
      ""
    ],
    [
      "Mikhailov",
      "Eugeniy E.",
      ""
    ],
    [
      "Park",
      "Gunn",
      ""
    ],
    [
      "Zhang",
      "Shukui",
      ""
    ],
    [
      "Novikova",
      "Irina",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 18:56:29 GMT"
    }
  ],
  "updateDate": "2024-12-04",
  "timestamp": 1733252189000,
  "abstract": "  We present a quantum optics-based detection method for determining the\nposition and current of an electron beam. As electrons pass through a dilute\nvapor of rubidium atoms, their magnetic field perturb the atomic spin's quantum\nstate and causes polarization rotation of a laser resonant with an optical\ntransition of the atoms. By measuring the polarization rotation angle across\nthe laser beam, we recreate a 2D projection of the magnetic field and use it to\ndetermine the e-beam position, size and total current. We tested this method\nfor an e-beam with currents ranging from 30 to 110 {\\mu}A. Our approach is\ninsensitive to electron kinetic energy, and we confirmed that experimentally\nbetween 10 to 20 keV. This technique offers a unique platform for non-invasive\ncharacterization of charged particle beams used in accelerators for particle\nand nuclear physics research.\n",
  "subjects": [
    "Physics/Quantum Physics",
    "Physics/Atomic Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "U8eGhPJD7z6ZlpQ5YYEKMWx7L8msJyGEp7iP7Bffn1M",
  "pdfSize": "1730703"
}