{
  "id": "2412.20899",
  "title": "DDIM sampling for Generative AIBIM, a faster intelligent structural\n  design framework",
  "authors": "Zhili He, Yu-Hsing Wang",
  "authorsParsed": [
    [
      "He",
      "Zhili",
      ""
    ],
    [
      "Wang",
      "Yu-Hsing",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 30 Dec 2024 12:22:33 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735561353000,
  "abstract": "  Generative AIBIM, a successful structural design pipeline, has proven its\nability to intelligently generate high-quality, diverse, and creative shear\nwall designs that are tailored to specific physical conditions. However, the\ncurrent module of Generative AIBIM that generates designs, known as the\nphysics-based conditional diffusion model (PCDM), necessitates 1000 iterations\nfor each generation due to its reliance on the denoising diffusion\nprobabilistic model (DDPM) sampling process. This leads to a time-consuming and\ncomputationally demanding generation process. To address this issue, this study\nintroduces the denoising diffusion implicit model (DDIM), an accelerated\ngeneration method that replaces the DDPM sampling process in PCDM. While the\noriginal DDIM was designed for DDPM and the optimization process of PCDM\ndiffers from that of DDPM, this paper designs \"DDIM sampling for PCDM,\" which\nmodifies the original DDIM formulations to adapt to the optimization process of\nPCDM. Experimental results demonstrate that DDIM sampling for PCDM can\naccelerate the generation process of the original PCDM by a factor of 100 while\nmaintaining the same visual quality in the generated results. This study\neffectively showcases the effectiveness of DDIM sampling for PCDM in expediting\nintelligent structural design. Furthermore, this paper reorganizes the contents\nof DDIM, focusing on the practical usage of DDIM. This change is particularly\nmeaningful for researchers who may not possess a strong background in machine\nlearning theory but are interested in utilizing the tool effectively.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "l8EdZ_1tfrNgCT3o181SKr3JaFaCEcuTJe-S3fHuumc",
  "pdfSize": "904651"
}