{
  "id": "2412.13285",
  "title": "A family of instanton-invariants for four-manifolds and their relation\n  to Khovanov homology",
  "authors": "Michael Bleher",
  "authorsParsed": [
    [
      "Bleher",
      "Michael",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 19:29:48 GMT"
    },
    {
      "version": "v2",
      "created": "Thu, 2 Jan 2025 17:52:07 GMT"
    }
  ],
  "updateDate": "2025-01-03",
  "timestamp": 1734463788000,
  "abstract": "  This article reviews Witten's gauge-theoretic approach to Khovanov homology\nfrom the perspective of Haydys-Witten instanton Floer theory. Expanding on\nWitten's arguments, we introduce a one-parameter family of instanton Floer\nhomology groups $HF_{\\theta}(W^4)$, which, based on physical arguments, are\nexpected to be topological invariants of the four-manifold $W^4$. In analogy to\nthe original Yang-Mills instanton Floer theory, these groups are defined by the\nsolutions of the $\\theta$-Kapustin-Witten equations on $W^4$ modulo instanton\nsolutions of the Haydys-Witten equations that interpolate between them on the\nfive-dimensional cylinder $\\mathbb{R}_s \\times W^4$. The relation to knot\ninvariants arises when the four-manifold is the geometric blowup $W^4 = [X^3\n\\times \\mathbb{R}^+, K]$ along a knot $K \\subset X^3 \\times \\{0\\}$ embedded in\nits three-dimensional boundary. The boundaries and corners of this manifold\nrequire the specification of boundary conditions that preserve the topological\ninvariance of the construction and are fundamentally linked to various\ndimensional reductions of the Haydys-Witten equations. We provide a\ncomprehensive discussion of these dimensional reductions and relate them to\nwell-known gauge-theoretic equations in lower dimensions, including the\n$\\theta$-Kapustin-Witten equations, twisted extended Bogomolny equations, and\ntwisted octonionic Nahm equations. Along the way, we record novel results on\nthe elliptic regularity of the Haydys-Witten equations with twisted Nahm pole\nboundary conditions. The upshot of the article is a tentative definition of\nHaydys-Witten Floer theory and a precise restatement of Witten's conjecture: an\nequality between the Haydys-Witten Floer homology $HF^\\bullet_{\\pi/2}([S^3\n\\times \\mathbb{R}^+, K])$ and Khovanov homology $Kh^\\bullet(K)$.\n",
  "subjects": [
    "Physics/Mathematical Physics",
    "Mathematics/Differential Geometry",
    "Mathematics/Mathematical Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "5SxZ-RT1jA28vb2Vx3n-bk8js1w6Vsz_wMOAafiJTts",
  "pdfSize": "1337894"
}