{"id":"2412.12671","title":"Barkhausen noise in the organic ferroelectric copolymer P(VDF:TrFE)","authors":"Andrey Alekseevich Butkevich, Marcel Hecker, Toni Seiler, Martijn\n  Kemerink","authorsParsed":[["Butkevich","Andrey Alekseevich",""],["Hecker","Marcel",""],["Seiler","Toni",""],["Kemerink","Martijn",""]],"versions":[{"version":"v1","created":"Tue, 17 Dec 2024 08:41:24 GMT"}],"updateDate":"2024-12-18","timestamp":1734424884000,"abstract":"  Polarization reversal within a ferroelectric material is commonly described\nas a progression of smaller switching events, giving rise to crackling or\nBarkhausen noise. While studies on Barkhausen noise, and particularly the\nassociated event size distribution, allow for better understanding of switching\nprocesses in ferroelectrics, they were not yet conducted experimentally on\norganic ferroelectric materials. In this work, Barkhausen noise in the organic\nferroelectric copolymer poly(vinylidene fluoride-co-trifluoroethylene)\n(P(VDF:TrFE)) is experimentally investigated under different electric fields,\nincreasing at various rates. A weak dependence of the structure of the\nBarkhausen noise on both the magnitude and rise time of the applied electric\nfield is observed, which manifests as a trend in the probability density\nfunction power-law exponents. Specifically, an increase in maximum electric\nfield leads to an increase of the power-law exponent; increasing the rise time\ncauses a parallel shift towards lower exponents. While these findings do not\nallow to conclusively confirm or refute universal self-organized critical\nbehavior of the polarization reversal avalanches in P(VDF:TrFE), the exponents\nwere found to seemingly converge to the universal value of 1.5 for fast and\nstrong driving, suggesting the system is close to this limit.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Other Condensed Matter"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"1KPYE7XhgRL6xXby3pjbHHQQmC2lmrauZ4EQO9morWY","pdfSize":"2381533"}