{"id":"2412.06251","title":"Fearless Unsafe. A More User-friendly Document for Unsafe Rust\n  Programming Base on Refined Safety Properties","authors":"Mohan Cui, Penglei Mao, Shuran Sun, Yangfan Zhou, Hui Xu","authorsParsed":[["Cui","Mohan",""],["Mao","Penglei",""],["Sun","Shuran",""],["Zhou","Yangfan",""],["Xu","Hui",""]],"versions":[{"version":"v1","created":"Mon, 9 Dec 2024 07:00:31 GMT"},{"version":"v2","created":"Thu, 19 Dec 2024 07:02:19 GMT"}],"updateDate":"2024-12-20","timestamp":1733727631000,"abstract":"  Rust, a popular systems-level programming language, has garnered widespread\nattention due to its features of achieving run-time efficiency and memory\nsafety. With an increasing number of real-world projects adopting Rust,\nunderstanding how to assist programmers in correctly writing unsafe code poses\na significant challenge. Based on our observations, the current standard\nlibrary has many unsafe APIs, but their descriptions are not uniform, complete,\nand intuitive, especially in describing safety requirements. Therefore, we\nadvocate establishing a systematic category of safety requirements for revising\nthose documents.\n  In this paper, we extended and refined our study in ICSE 2024. We defined a\ncategory of Safety Properties (22 items in total) that learned from the\ndocuments of unsafe APIs in the standard library. Then, we labeled all public\nunsafe APIs (438 in total) and analyzed their correlations. Based on the safety\nproperties, we reorganized all the unsafe documents in the standard library and\ndesigned a consultation plugin into rust-analyzer as a complementary tool to\nassist Rust developers in writing unsafe code. To validate the practical\nsignificance, we categorized the root causes of all Rust CVEs up to 2024-01-31\n(419 in total) into safety properties and further counted the real-world usage\nof unsafe APIs in the crates.io ecosystem.\n","subjects":["Computer Science/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"g_ZegxsGsTp2aqj-IEiSeoMAiI8KqwQd4xZ2XxRu8rY","pdfSize":"1202987"}