{"id":"2412.06933","title":"Metastability, atmospheric midlatitude circulation regimes and\n  large-scale teleconnection: a data-driven approach","authors":"Dmitry Mukhin, Roman Samoilov, Abdel Hannachi","authorsParsed":[["Mukhin","Dmitry",""],["Samoilov","Roman",""],["Hannachi","Abdel",""]],"versions":[{"version":"v1","created":"Mon, 9 Dec 2024 19:23:59 GMT"}],"updateDate":"2024-12-11","timestamp":1733772239000,"abstract":"  The low-frequency variability of the mid-latitude atmosphere involves complex\nnonlinear and chaotic dynamical processes posing predictability challenges. It\nis characterized by sporadically recurring, often long-lived patterns of\natmospheric circulation of hemispheric scale known as weather regimes. The\nevolution of these circulation regimes in addition to their link to large-scale\nteleconnections can help extend the limits of atmospheric predictability. They\nalso play a key role in sub- and inter-seasonal weather forecasting. Their\nidentification and modeling remains an issue, however, due to their intricacy,\nincluding a clear conceptual picture. In recent years, the concept of\nmetastability has been developed to explain regimes formation. This suggests an\ninterpretation of circulation regimes as communities of states in which the\natmospheric system remains in their neighborhood for abnormally longer than\ntypical baroclinic timescales. Here we develop a new and effective method to\nidentify such communities by constructing and analyzing an operator of the\nsystem's evolution via hidden Markov model (HMM). The method makes use of graph\ntheory and is based on probabilistic approach to partition the HMM transition\nmatrix into weakly interacting blocks -- communities of hidden states --\nassociated with regimes. The approach involves nonlinear kernel principal\ncomponent mapping to consistently embed the system state space for HMM\nbuilding. Application to northern winter hemisphere using geopotential heights\nfrom reanalysis yields four persistent and recurrent circulation regimes.\nStatistical and dynamical characteristics of these circulation regimes and\nsurface impacts are discussed. In particular, unexpected high correlations are\nobtained with EL-Nino Southern Oscillation and Pacific decadal oscillation with\nlead times of up to one year.\n","subjects":["Physics/Atmospheric and Oceanic Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"PyzX7WE4YwuONd7dTw7Zh60LWc58JIHyKs-VjeIvfoQ","pdfSize":"18216719"}