{
  "id": "2412.20815",
  "title": "Constraining the $f$-mode oscillations frequency in Neutron Stars\n  through Universal Relations in the realm of Energy-Momentum Squared Gravity",
  "authors": "Sayantan Ghosh",
  "authorsParsed": [
    [
      "Ghosh",
      "Sayantan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 30 Dec 2024 09:11:11 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735549871000,
  "abstract": "  Neutron stars (NSs), superdense objects with exceptionally strong\ngravitational fields, provide an ideal laboratory for probing general\nrelativity (GR) in the high-curvature regime. They also present an exciting\nopportunity to explore new gravitational physics beyond the traditional\nframework of GR. Thus, investigating alternative theories of gravity in the\ncontext of superdense stars is intriguing and essential for advancing our\nunderstanding of gravitational phenomena in extreme environments.\nEnergy-Momentum Squared Gravity (EMSG) is a modified theory of gravity that\nextends GR by including nonlinear terms involving the energy-momentum tensor\n$T_{\\mu \\nu}$. This study examines the effects of EMSG on the properties and\nbehaviour of NSs by varying the free parameter $\\alpha$. The hydrostatic\nequilibrium equations in the EMSG framework are derived and solved numerically\nto obtain mass-radius relations for soft, stiff, and intermediate equations of\nstate (EOS). Observational measurements of NS masses and radii are used to\nconstrain the fundamental-mode ($f$-mode) oscillation frequency through its\nuniversal relation with the tidal Love number and compactness. Results indicate\nthat the Stiff EOS undergoes a phase transition at the highest energy densities\nand pressures, followed by the Intermediate and Soft EOSs, highlighting the\ndistinctive characteristics of these models. Additionally, the study explores\nthe impact of EOS choice on the sound speed profile of NSs, reaffirming the\nphysical validity of the models across varying $\\alpha$ values.\n",
  "subjects": [
    "Physics/General Relativity and Quantum Cosmology",
    "Astrophysics/High Energy Astrophysical Phenomena",
    "Physics/Nuclear Theory"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "mZiog0aXJj2_hEGWkOcWh5UsAlk1XJVa7vBDdBMH7o8",
  "pdfSize": "1084149"
}