{
  "id": "2412.07711",
  "title": "New calculation of the geo-neutrino energy spectrum and its implication",
  "authors": "Yu-Feng Li and Zhao Xin",
  "authorsParsed": [
    [
      "Li",
      "Yu-Feng",
      ""
    ],
    [
      "Xin",
      "Zhao",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 18:00:14 GMT"
    },
    {
      "version": "v2",
      "created": "Wed, 11 Dec 2024 11:19:44 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733853614000,
  "abstract": "  The energy spectrum of geo-neutrinos plays a vital role in the experimental\nmeasurement of geo-neutrinos that have profound implications for both particle\nphysics and earth sciences. In this letter, we present a state-of-the-art\ncalculation of the energy spectrum of geo-neutrinos originating from the beta\ndecay of Uranium-238 and Thorium-232. Our calculation is underpinned by the\nlatest updates in the nuclear database, accounts for previously overlooked\nforbidden transitions, and incorporates advanced corrections for the beta\ndecay. This brand new geo-neutrino flux model, compared to the widely-used\nestimates from Enomoto, reveals notable distinction in the energy spectrum\nshape because of our comprehensive approach. When considering the inverse beta\ndecay (IBD) detection process, our findings show a significant deviation in the\npredicted IBD yield of around 4% for Uranium-238 and 9% for Thorium-232 decay\nchains. The implications of using the new geo-neutrino flux model for the\nexperimental analysis are substantial, potentially affecting the analysis\nresults of geo-neutrino measurements of KamLAND and Borexino by around 10% to\n20%. Our study represents a significant advancement in geo-neutrino research,\nestablishing a new benchmark for accuracy and reliability in the field.\n",
  "subjects": [
    "Physics/High Energy Physics - Phenomenology",
    "Physics/Nuclear Experiment",
    "Physics/Geophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "gUtMHIM_xnfAz6w6rQr__A_LO-1Wsunr0MB0CqLwRAQ",
  "pdfSize": "564484"
}