{
  "id": "2412.08358",
  "title": "Revealing hidden bioimaging information by isotropic depolarization\n  filtering",
  "authors": "M\\'onica Canabal-Carbia, Irene Est\\'evez, Emilio Gonz\\'alez-Arnay,\n  Ivan Montes-Gonzalez, Jose J. Gil, Anrau Barrera, Enrique Garc\\'ia-Caurel,\n  Razvigor Ossikovski, Ignacio Moreno, Juan Campos, and Angel Lizana",
  "authorsParsed": [
    [
      "Canabal-Carbia",
      "Mónica",
      ""
    ],
    [
      "Estévez",
      "Irene",
      ""
    ],
    [
      "González-Arnay",
      "Emilio",
      ""
    ],
    [
      "Montes-Gonzalez",
      "Ivan",
      ""
    ],
    [
      "Gil",
      "Jose J.",
      ""
    ],
    [
      "Barrera",
      "Anrau",
      ""
    ],
    [
      "García-Caurel",
      "Enrique",
      ""
    ],
    [
      "Ossikovski",
      "Razvigor",
      ""
    ],
    [
      "Moreno",
      "Ignacio",
      ""
    ],
    [
      "Campos",
      "Juan",
      ""
    ],
    [
      "Lizana",
      "Angel",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 13:05:04 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733922304000,
  "abstract": "  We propose an imaging method to enhance and reveal structures within samples\nby using a polarization-based filter. This filter removes the isotropic content\nwhile amplifying the anisotropic component of depolarization. Whereas isotropic\ndepolarization leads to a complete loss of polarimetric information, the\nanisotropic one is connected with intrinsic characteristics of samples. The\nfilter has the capability to diminish the isotropic depolarization of samples,\nrevealing their inherent information. As representative cases, we analyze the\neffect of the filter in heart and brain sections of animal origin. Results\nhighlight the outstanding performance of the filter. In heart, myocardial and\nsubendocardial structures are better visualized, whereas in the brain, fiber\ntracts are identified. These proves the significance of this filter in the\nmedical field, paving the way to the early detection of pathologies. The\nmethodologies here presented could be applied in a wide range of applications,\nproviding a significant advance in polarization imaging where high isotropic\ndepolarization response is present, this being a common scenario in nature.\n",
  "subjects": [
    "Physics/Optics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "zfg89JUJMYQIl_pw7xD0MKeSOTNYNjozKijCL8bgf18",
  "pdfSize": "10744512"
}