{
  "id": "2412.04222",
  "title": "DistB-VNET: Distributed Cluster-based Blockchain Vehicular Ad-Hoc\n  Networks through SDN-NFV for Smart City",
  "authors": "Anichur Rahman, MD. Zunead Abedin Eidmum, Dipanjali Kundu, Mahir\n  Hossain, MD Tanjum An Tashrif, Md Ahsan Karim, and Md. Jahidul Islam",
  "authorsParsed": [
    [
      "Rahman",
      "Anichur",
      ""
    ],
    [
      "Eidmum",
      "MD. Zunead Abedin",
      ""
    ],
    [
      "Kundu",
      "Dipanjali",
      ""
    ],
    [
      "Hossain",
      "Mahir",
      ""
    ],
    [
      "Tashrif",
      "MD Tanjum An",
      ""
    ],
    [
      "Karim",
      "Md Ahsan",
      ""
    ],
    [
      "Islam",
      "Md. Jahidul",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 14:55:05 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733410505000,
  "abstract": "  In the developing topic of smart cities, Vehicular Ad-Hoc Networks (VANETs)\nare crucial for providing successful interaction between vehicles and\ninfrastructure. This research proposes a distributed Blockchain-based Vehicular\nAd-hoc Network (DistB-VNET) architecture that includes binary malicious traffic\nclassification, Software Defined Networking (SDN), and Network Function\nVirtualization (NFV) to ensure safe, scalable, and reliable vehicular networks\nin smart cities. The suggested framework is the decentralized blockchain for\nsafe data management and SDN-NFV for dynamic network management and resource\nefficiency and a noble isolation forest algorithm works as an IDS (Intrusion\nDetection System). Further, \"DistB-VNET\" offers a dual-layer blockchain system,\nwhere a distributed blockchain provides safe communication between vehicles,\nwhile a centralized blockchain in the cloud is in charge of data verification\nand storage. This improves security, scalability, and adaptability, ensuring\nbetter traffic management, data security, and privacy in VANETs. Furthermore,\nthe unsupervised isolation forest model achieves a high accuracy of 99.23% for\ndetecting malicious traffic. Additionally, reveals that our method greatly\nimproves network performance, offering decreased latency, increased security,\nand reduced congestion, an effective alternative for existing smart city\ninfrastructures.\n",
  "subjects": [
    "Computer Science/Cryptography and Security"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "rrHJPqIt6-sZn9gc_wcKHRgaaH57Hosogu1bftjsjuI",
  "pdfSize": "791150"
}