{"id":"2412.15491","title":"GCA-3D: Towards Generalized and Consistent Domain Adaptation of 3D\n  Generators","authors":"Hengjia Li, Yang Liu, Yibo Zhao, Haoran Cheng, Yang Yang, Linxuan Xia,\n  Zekai Luo, Qibo Qiu, Boxi Wu, Tu Zheng, Zheng Yang, Deng Cai","authorsParsed":[["Li","Hengjia",""],["Liu","Yang",""],["Zhao","Yibo",""],["Cheng","Haoran",""],["Yang","Yang",""],["Xia","Linxuan",""],["Luo","Zekai",""],["Qiu","Qibo",""],["Wu","Boxi",""],["Zheng","Tu",""],["Yang","Zheng",""],["Cai","Deng",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 02:13:11 GMT"}],"updateDate":"2024-12-23","timestamp":1734660791000,"abstract":"  Recently, 3D generative domain adaptation has emerged to adapt the\npre-trained generator to other domains without collecting massive datasets and\ncamera pose distributions. Typically, they leverage large-scale pre-trained\ntext-to-image diffusion models to synthesize images for the target domain and\nthen fine-tune the 3D model. However, they suffer from the tedious pipeline of\ndata generation, which inevitably introduces pose bias between the source\ndomain and synthetic dataset. Furthermore, they are not generalized to support\none-shot image-guided domain adaptation, which is more challenging due to the\nmore severe pose bias and additional identity bias introduced by the single\nimage reference. To address these issues, we propose GCA-3D, a generalized and\nconsistent 3D domain adaptation method without the intricate pipeline of data\ngeneration. Different from previous pipeline methods, we introduce multi-modal\ndepth-aware score distillation sampling loss to efficiently adapt 3D generative\nmodels in a non-adversarial manner. This multi-modal loss enables GCA-3D in\nboth text prompt and one-shot image prompt adaptation. Besides, it leverages\nper-instance depth maps from the volume rendering module to mitigate the\noverfitting problem and retain the diversity of results. To enhance the pose\nand identity consistency, we further propose a hierarchical spatial consistency\nloss to align the spatial structure between the generated images in the source\nand target domain. Experiments demonstrate that GCA-3D outperforms previous\nmethods in terms of efficiency, generalization, pose accuracy, and identity\nconsistency.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"3uurycTEtncxgvWYhhrcXkdQm1BsCNQ2A9KXl9aKnvM","pdfSize":"14550087"}