{
  "id": "2412.13259",
  "title": "Anomalous discharging of quantum batteries: the ergotropic Mpemba effect",
  "authors": "Ivan Medina, Ois\\'in Culhane, Felix C. Binder, Gabriel T. Landi, and\n  John Goold",
  "authorsParsed": [
    [
      "Medina",
      "Ivan",
      ""
    ],
    [
      "Culhane",
      "Oisín",
      ""
    ],
    [
      "Binder",
      "Felix C.",
      ""
    ],
    [
      "Landi",
      "Gabriel T.",
      ""
    ],
    [
      "Goold",
      "John",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 19:00:02 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734462002000,
  "abstract": "  Anomalous thermal relaxation is ubiquitous in non equilibrium statistical\nmechanics. An emblematic example of this is the Mpemba effect, where an\ninitially ``hot'' system cools faster than an initially ``cooler'' one. This\neffect has recently been studied in a variety of different classical and\nquantum settings. In this letter, we find a novel signature of the Mpemba\neffect in the context of quantum batteries. We identify situations where\nbatteries in higher charge states can discharge faster than less charged\nstates. Specifically, we consider a quantum battery encoded in a single bosonic\nmode that is charged using unitary Gaussian operations. We show that the\nergotropy, used here as a dynamical indicator of the energy stored in the\nbattery, can be recast as a phase space relative entropy between the system's\nstate and the unitarily connected passive state, at each time. Our formalism\nallows us to compute the ergotropy analytically under dissipative dynamics and\nallows us to understand the conditions which give rise to a Mpemba effect. We\nalso find situations where two batteries charged to the same value using\ndifferent operations can discharge at different rates.\n",
  "subjects": [
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Hn4gOBx4F5vzivzFIiJiPfDFyWMh21m2zR8rCba2RFY",
  "pdfSize": "1412997"
}