{
  "id": "2412.14272",
  "title": "Split Learning in Computer Vision for Semantic Segmentation Delay\n  Minimization",
  "authors": "Nikos G. Evgenidis, Nikos A. Mitsiou, Sotiris A. Tegos, Panagiotis D.\n  Diamantoulakis and George K. Karagiannidis",
  "authorsParsed": [
    [
      "Evgenidis",
      "Nikos G.",
      ""
    ],
    [
      "Mitsiou",
      "Nikos A.",
      ""
    ],
    [
      "Tegos",
      "Sotiris A.",
      ""
    ],
    [
      "Diamantoulakis",
      "Panagiotis D.",
      ""
    ],
    [
      "Karagiannidis",
      "George K.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 19:07:25 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734548845000,
  "abstract": "  In this paper, we propose a novel approach to minimize the inference delay in\nsemantic segmentation using split learning (SL), tailored to the needs of\nreal-time computer vision (CV) applications for resource-constrained devices.\nSemantic segmentation is essential for applications such as autonomous vehicles\nand smart city infrastructure, but faces significant latency challenges due to\nhigh computational and communication loads. Traditional centralized processing\nmethods are inefficient for such scenarios, often resulting in unacceptable\ninference delays. SL offers a promising alternative by partitioning deep neural\nnetworks (DNNs) between edge devices and a central server, enabling localized\ndata processing and reducing the amount of data required for transmission. Our\ncontribution includes the joint optimization of bandwidth allocation, cut layer\nselection of the edge devices' DNN, and the central server's processing\nresource allocation. We investigate both parallel and serial data processing\nscenarios and propose low-complexity heuristic solutions that maintain\nnear-optimal performance while reducing computational requirements. Numerical\nresults show that our approach effectively reduces inference delay,\ndemonstrating the potential of SL for improving real-time CV applications in\ndynamic, resource-constrained environments.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Distributed, Parallel, and Cluster Computing",
    "Computer Science/Information Theory",
    "Computer Science/Machine Learning",
    "Mathematics/Information Theory"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "KbBr82rZQGqFU5G5FipyCb72uai3HYq-xoJsU2XR9d4",
  "pdfSize": "567085"
}