{
  "id": "2412.09527",
  "title": "Primary Beam Chromaticity in HIRAX: I. Characterization from Simulations\n  and Power Spectrum Implications",
  "authors": "Ajith Sampath, Devin Crichton, Kavilan Moodley, H. Cynthia Chiang,\n  Eloy De Lera Acedo, Simthembile Dlamini, Sindhu Gaddam, Kit M. Gerodias,\n  Quentin Gueuning, N. Gupta, Pascal Hitz, Aditya Krishna Karigiri Madhusudhan,\n  Shreyam Parth Krishna, V. Mugundhan, Edwin Retana-Montenegro, Benjamin R.B.\n  Saliwanchik, Mario G. Santos and Anthony Walters",
  "authorsParsed": [
    [
      "Sampath",
      "Ajith",
      ""
    ],
    [
      "Crichton",
      "Devin",
      ""
    ],
    [
      "Moodley",
      "Kavilan",
      ""
    ],
    [
      "Chiang",
      "H. Cynthia",
      ""
    ],
    [
      "Acedo",
      "Eloy De Lera",
      ""
    ],
    [
      "Dlamini",
      "Simthembile",
      ""
    ],
    [
      "Gaddam",
      "Sindhu",
      ""
    ],
    [
      "Gerodias",
      "Kit M.",
      ""
    ],
    [
      "Gueuning",
      "Quentin",
      ""
    ],
    [
      "Gupta",
      "N.",
      ""
    ],
    [
      "Hitz",
      "Pascal",
      ""
    ],
    [
      "Madhusudhan",
      "Aditya Krishna Karigiri",
      ""
    ],
    [
      "Krishna",
      "Shreyam Parth",
      ""
    ],
    [
      "Mugundhan",
      "V.",
      ""
    ],
    [
      "Retana-Montenegro",
      "Edwin",
      ""
    ],
    [
      "Saliwanchik",
      "Benjamin R. B.",
      ""
    ],
    [
      "Santos",
      "Mario G.",
      ""
    ],
    [
      "Walters",
      "Anthony",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 18:14:19 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1734027259000,
  "abstract": "  The Hydrogen Intensity and Real-time Analysis eXperiment (HIRAX) is an\nupcoming radio interferometric telescope designed to constrain dark energy\nthrough the 21cm intensity mapping of Baryon Acoustic Oscillations (BAO).\nInstrumental systematics must be controlled and carefully characterized to\nmeasure the 21cm power spectrum with fidelity and achieve high-precision\nconstraints on the cosmological parameters. The chromaticity of the primary\nbeam is one such complicated systematic, which can leak the power of spectrally\nsmooth foregrounds beyond the ideal horizon limits due to the complex spatial\nand spectral structures of the sidelobes and the mainlobe. This paper studies\nthe chromaticity of the HIRAX Stokes I primary beam and its effects on accurate\nmeasurements of the 21cm power spectrum. To investigate the effect of\nchromaticity in the 21cm power spectrum, we present a physically motivated beam\nmodeling technique, which uses a flexible basis derived from traditional optics\nthat can account for higher-order radial and azimuthal structures in the\nprimary beam. We investigate the impact of imperfect knowledge of the mainlobe\nand sidelobes chromaticity in the power spectrum space by subtracting a simple\nforeground model in simulated snapshot visibilities to recover the\nH$\\textsc{i}$ power spectrum. Additionally, we find that modeling up to the\noctupolar azimuthal order feature (fourth-order angular variation) in the\nprimary beam is sufficient to reduce the leakage outside the wedge with minimal\nbias.\n",
  "subjects": [
    "Astrophysics/Cosmology and Nongalactic Astrophysics",
    "Astrophysics/Instrumentation and Methods for Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "lJnNyS2ZTmTg1w370vdVrAUJ80dTJTT2DANg08ciw3k",
  "pdfSize": "7335075"
}