{
  "id": "2412.01891",
  "title": "A note on loop resummation in de Sitter spacetime with the wavefunction\n  of the universe approach",
  "authors": "Javier Huenupi, Ellie Hughes, Gonzalo A. Palma, Spyros Sypsas",
  "authorsParsed": [
    [
      "Huenupi",
      "Javier",
      ""
    ],
    [
      "Hughes",
      "Ellie",
      ""
    ],
    [
      "Palma",
      "Gonzalo A.",
      ""
    ],
    [
      "Sypsas",
      "Spyros",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 19:00:00 GMT"
    }
  ],
  "updateDate": "2024-12-04",
  "timestamp": 1733166000000,
  "abstract": "  We analyze the computation of $n$-point correlation functions in de Sitter\nspacetime, including loop corrections, using the wavefunction of the universe\napproach. This method consists of two stages employing distinct Feynman rules.\nFirst, one must compute the wavefunction coefficients using interactions as\nvertices. Then, in the second stage, one computes correlation functions using\nwavefunction coefficients as vertices. For massless fields, loop corrections in\nthe first stage are free of infrared (IR) divergences, which leads to the\nquestion of how this matches the well-known IR behavior of correlators obtained\nvia other methods. By considering a scalar field with an arbitrary potential,\nwe compute $n$-point correlation functions to first order in the potential but\nto all orders in loops. We find that, although loop integrals in the first\nstage are indeed IR convergent, the second procedure reintroduces the IR\ndivergence. We discuss how this induces renormalization of the interaction\npotential such that the final result combining both steps exactly matches the\nform of $n$-point functions previously calculated with other methods.\n",
  "subjects": [
    "Physics/High Energy Physics - Theory",
    "Astrophysics/Cosmology and Nongalactic Astrophysics",
    "Physics/High Energy Physics - Phenomenology"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "xAgptcCpNralkQBzPw3r1CgMIy9gyarE5Xv7-4yrzL4",
  "pdfSize": "212035"
}