{"id":"2412.10189","title":"Commissioning of the MIRAC-5 Mid-Infrared Instrument on the MMT","authors":"Rory Bowens, Jarron Leisenring, Michael R. Meyer, Taylor L. Tobin,\n  Alyssa L. Miller, John D. Monnier, Eric Viges, Bill Hoffmann, Manny Montoya,\n  Olivier Durney, Grant West, Katie Morzinski, William Forrest, Craig McMurtry","authorsParsed":[["Bowens","Rory",""],["Leisenring","Jarron",""],["Meyer","Michael R.",""],["Tobin","Taylor L.",""],["Miller","Alyssa L.",""],["Monnier","John D.",""],["Viges","Eric",""],["Hoffmann","Bill",""],["Montoya","Manny",""],["Durney","Olivier",""],["West","Grant",""],["Morzinski","Katie",""],["Forrest","William",""],["McMurtry","Craig",""]],"versions":[{"version":"v1","created":"Fri, 13 Dec 2024 15:01:04 GMT"}],"updateDate":"2024-12-16","timestamp":1734102064000,"abstract":"  We present results from commissioning observations of the mid-IR instrument,\nMIRAC-5, on the 6.5-m MMT telescope. MIRAC-5 is a novel ground-based instrument\nthat utilizes a state-of-the-art GeoSnap (2 - 13 microns) HgCdTe detector with\nadaptive optics support from MAPS to study protoplanetary disks, wide-orbit\nbrown dwarfs, planetary companions in the contrast-limit, and a wide range of\nother astrophysical objects. We have used MIRAC-5 on six engineering observing\nruns, improving its performance and defining operating procedures. We\ncharacterize key aspects of MIRAC-5's performance, including verification that\nthe total telescope, atmosphere, instrument, and detector throughput is\napproximately 10%. Following a planned dichroic upgrade, the system will have a\nthroughput of 20% and background limiting magnitudes (for SNR = 5 and 8 hour\nexposure times) of 18.0, 15.6, and 12.6 for the L', M', and N' filters,\nrespectively. The detector pixels experience 1/f noise but, if the\nastrophysical scene is properly modulated via chopping and nodding sequences,\nit is less than 10% the Poisson noise from the observed background in an 85 Hz\nframe. We achieve close to diffraction-limited performance in the N-band and\nall bands are expected to reach diffraction-limited performance following the\nadaptive optics system commissioning. We also present an exposure time\ncalculator calibrated to the on-sky results. In its current state, MIRAC-5 will\nbe capable of achieving several scientific objectives including the observation\nof warm wide-orbit companions. Once the adaptive optics is commissioned and a\ncoronagraph installed in 2025, MIRAC-5 will have contrast-limited performance\ncomparable to JWST, opening new and complementary science investigations for\nclose-in companions.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"IR6dSQrrZef8apGM0aQUsBYe1TNxJWG3fhD46_bjmgc","pdfSize":"3800217"}