{
  "id": "2412.11775",
  "title": "Prediction of social dilemmas in networked populations via graph neural\n  networks",
  "authors": "Huaiyu Tan, Yikang Lu, Alfonso de Miguel-Arribas, Lei Shi",
  "authorsParsed": [
    [
      "Tan",
      "Huaiyu",
      ""
    ],
    [
      "Lu",
      "Yikang",
      ""
    ],
    [
      "de Miguel-Arribas",
      "Alfonso",
      ""
    ],
    [
      "Shi",
      "Lei",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 13:47:39 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734356859000,
  "abstract": "  Human behavior presents significant challenges for data-driven approaches and\nmachine learning, particularly in modeling the emergent and complex dynamics\nobserved in social dilemmas. These challenges complicate the accurate\nprediction of strategic decision-making in structured populations, which is\ncrucial for advancing our understanding of collective behavior. In this work,\nwe introduce a novel approach to predicting high-dimensional collective\nbehavior in structured populations engaged in social dilemmas. We propose a new\nfeature extraction methodology, Topological Marginal Information Feature\nExtraction (TMIFE), which captures agent-level information over time.\nLeveraging TMIFE, we employ a graph neural network to encode networked dynamics\nand predict evolutionary outcomes under various social dilemma scenarios. Our\napproach is validated through numerical simulations and transfer learning,\ndemonstrating its robustness and predictive accuracy. Furthermore, results from\na Prisoner's Dilemma experiment involving human participants confirm that our\nmethod reliably predicts the macroscopic fraction of cooperation. These\nfindings underscore the complexity of predicting high-dimensional behavior in\nstructured populations and highlight the potential of graph-based machine\nlearning techniques for this task.\n",
  "subjects": [
    "Physics/Physics and Society"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Dssjcfom29NppbbNxMcZs-Hr3gCdTiud3D6wi8OP5mo",
  "pdfSize": "7107869"
}