{
  "id": "2412.16165",
  "title": "Promoting AI Literacy in Higher Education: Evaluating the IEC-V1 Chatbot\n  for Personalized Learning and Educational Equity",
  "authors": "Stefan Pietrusky",
  "authorsParsed": [
    [
      "Pietrusky",
      "Stefan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 10:33:17 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1733308397000,
  "abstract": "  The unequal distribution of educational opportunities carries the risk of\nhaving a long-term negative impact on general social peace, a country's economy\nand basic democratic structures. In contrast to this observable development is\nthe rapid technological progress in the field of artificial intelligence (AI).\nProgress makes it possible to solve various problems in the field of education\nas well. In order to effectively exploit the advantages that arise from the use\nof AI, prospective teacher training students need appropriate AI skills, which\nmust already be taught during their studies. In a first step, the added value\nof this technology will be demonstrated using a concrete example. This article\nis therefore about conducting an exploratory pilot study to test the Individual\nEducational Chatbot (IEC-V1) prototype, in which the levels can be individually\ndetermined in order to generate appropriate answers depending on the\nrequirements. The results show that this is an important function for\nprospective teachers, and that there is great interest in taking a closer look\nat this technology in order to be able to better support learners in the\nfuture. The data shows that experience has already been gained with chatbots,\nbut that there is still room for improvement. It also shows that IEC-V1 is\nalready working well. The knowledge gained will be used for the further\ndevelopment of the prototype to further improve the usability of the chatbot.\nOverall, it is shown that useful AI applications can be effectively integrated\ninto learning situations even without proprietary systems and that important\ndata protection requirements can be complied with.\n",
  "subjects": [
    "Computer Science/Computers and Society",
    "Computer Science/Human-Computer Interaction"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "WtpvdfGtU3wQYJ0psp5Ells8WukXRTq3dvV04Bq-BXI",
  "pdfSize": "504986"
}