{
  "id": "2412.17612",
  "title": "CoSurfGS:Collaborative 3D Surface Gaussian Splatting with Distributed\n  Learning for Large Scene Reconstruction",
  "authors": "Yuanyuan Gao, Yalun Dai, Hao Li, Weicai Ye, Junyi Chen, Danpeng Chen,\n  Dingwen Zhang, Tong He, Guofeng Zhang, Junwei Han",
  "authorsParsed": [
    [
      "Gao",
      "Yuanyuan",
      ""
    ],
    [
      "Dai",
      "Yalun",
      ""
    ],
    [
      "Li",
      "Hao",
      ""
    ],
    [
      "Ye",
      "Weicai",
      ""
    ],
    [
      "Chen",
      "Junyi",
      ""
    ],
    [
      "Chen",
      "Danpeng",
      ""
    ],
    [
      "Zhang",
      "Dingwen",
      ""
    ],
    [
      "He",
      "Tong",
      ""
    ],
    [
      "Zhang",
      "Guofeng",
      ""
    ],
    [
      "Han",
      "Junwei",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 14:31:15 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734964275000,
  "abstract": "  3D Gaussian Splatting (3DGS) has demonstrated impressive performance in scene\nreconstruction. However, most existing GS-based surface reconstruction methods\nfocus on 3D objects or limited scenes. Directly applying these methods to\nlarge-scale scene reconstruction will pose challenges such as high memory\ncosts, excessive time consumption, and lack of geometric detail, which makes it\ndifficult to implement in practical applications. To address these issues, we\npropose a multi-agent collaborative fast 3DGS surface reconstruction framework\nbased on distributed learning for large-scale surface reconstruction.\nSpecifically, we develop local model compression (LMC) and model aggregation\nschemes (MAS) to achieve high-quality surface representation of large scenes\nwhile reducing GPU memory consumption. Extensive experiments on Urban3d,\nMegaNeRF, and BlendedMVS demonstrate that our proposed method can achieve fast\nand scalable high-fidelity surface reconstruction and photorealistic rendering.\nOur project page is available at \\url{https://gyy456.github.io/CoSurfGS}.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "iK8oAoVFtr5fap2K2-iF1KcTfKD3z9U9-PNgDgLks4E",
  "pdfSize": "23140883"
}