{
  "id": "2412.16371",
  "title": "Photocurrent Enhancement due to Spin-Exchange Carrier Multiplication in\n  Films of Manganese-Doped 'Inverted' CdSe/HgSe Quantum Dots",
  "authors": "Jungchul Noh, Cl\\'ement Livache, Donghyo Hahm, Valerio Pinchetti, Ho\n  Jin, Changjo Kim and Victor I. Klimov",
  "authorsParsed": [
    [
      "Noh",
      "Jungchul",
      ""
    ],
    [
      "Livache",
      "Clément",
      ""
    ],
    [
      "Hahm",
      "Donghyo",
      ""
    ],
    [
      "Pinchetti",
      "Valerio",
      ""
    ],
    [
      "Jin",
      "Ho",
      ""
    ],
    [
      "Kim",
      "Changjo",
      ""
    ],
    [
      "Klimov",
      "Victor I.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 22:04:03 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734732243000,
  "abstract": "  Incorporation of manganese impurities into II-VI semiconductors results in a\ndramatic change in their properties due to strong exchange interactions between\nthe Mn ion and the semiconductor host. In colloidal quantum dots (QDs), these\ninteractions result in a rapid bidirectional energy transfer between the\nmagnetic impurity and the QD intrinsic states, which is characterized by an\nextremely high energy transfer rate of more than ~5 eV/ps. This rate is higher\nthan the rate of energy loss due to phonon emission (typically, ~1 eV/ps or\nless), so Mn-QD interactions could in principle be used to capture and utilize\nthe kinetic energy of the hot carrier before it is lost to phonons. Here, we\ndemonstrate that by using Mn-doped CdSe/HgSe core/shell QDs, we can efficiently\nconvert the kinetic energy of a hot exciton into an additional electron-hole\npair (exciton). This carrier multiplication process occurs through rapid\ncapture of a hot exciton by a Mn ion, which then undergoes spin flip\nrelaxation, producing two excitons near the QD band edge. Due to the inverted\ngeometry of the CdSe/HgSe QDs, both electrons and holes resulting from carrier\nmultiplication occupy the QD shell, allowing them to be easily extracted from\nthe QD for potential use in electro-optical devices or chemical reactions.\n",
  "subjects": [
    "Condensed Matter/Materials Science"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "RHJRirRNHqjL7hgYZki7ol9AOGLfDu_Aznc7UDcG1fY",
  "pdfSize": "5680673"
}