{"id":"2412.10838","title":"Deep Learning Models for Colloidal Nanocrystal Synthesis","authors":"Kai Gu, Yingping Liang, Jiaming Su, Peihan Sun, Jia Peng, Naihua Miao,\n  Zhimei Sun, Ying Fu, Haizheng Zhong, Jun Zhang","authorsParsed":[["Gu","Kai",""],["Liang","Yingping",""],["Su","Jiaming",""],["Sun","Peihan",""],["Peng","Jia",""],["Miao","Naihua",""],["Sun","Zhimei",""],["Fu","Ying",""],["Zhong","Haizheng",""],["Zhang","Jun",""]],"versions":[{"version":"v1","created":"Sat, 14 Dec 2024 14:18:59 GMT"}],"updateDate":"2024-12-17","timestamp":1734185939000,"abstract":"  Colloidal synthesis of nanocrystals usually includes complex chemical\nreactions and multi-step crystallization processes. Despite the great success\nin the past 30 years, it remains challenging to clarify the correlations\nbetween synthetic parameters of chemical reaction and physical properties of\nnanocrystals. Here, we developed a deep learning-based nanocrystal synthesis\nmodel that correlates synthetic parameters with the final size and shape of\ntarget nanocrystals, using a dataset of 3500 recipes covering 348 distinct\nnanocrystal compositions. The size and shape labels were obtained from\ntransmission electron microscope images using a segmentation model trained with\na semi-supervised algorithm on a dataset comprising 1.2 million nanocrystals.\nBy applying the reaction intermediate-based data augmentation method and\nelaborated descriptors, the synthesis model was able to predict nanocrystal's\nsize with a mean absolute error of 1.39 nm, while reaching an 89% average\naccuracy for shape classification. The synthesis model shows knowledge transfer\ncapabilities across different nanocrystals with inputs of new recipes. With\nthat, the influence of chemicals on the final size of nanocrystals was further\nevaluated, revealing the importance order of nanocrystal composition, precursor\nor ligand, and solvent. Overall, the deep learning-based nanocrystal synthesis\nmodel offers a powerful tool to expedite the development of high-quality\nnanocrystals.\n","subjects":["Condensed Matter/Materials Science","Computer Science/Artificial Intelligence","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"RURqGArL73-tRrbwIYVM2g6BEMjgPHfqXbqoCWo6s2Q","pdfSize":"3146371"}