{"id":"2412.16076","title":"Electroweak corrections in the SMEFT: four-fermion operators at high\n  energies","authors":"Hesham El Faham, Ken Mimasu, Davide Pagani, Claudio Severi, Eleni\n  Vryonidou, Marco Zaro","authorsParsed":[["Faham","Hesham El",""],["Mimasu","Ken",""],["Pagani","Davide",""],["Severi","Claudio",""],["Vryonidou","Eleni",""],["Zaro","Marco",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 17:19:52 GMT"}],"updateDate":"2024-12-23","timestamp":1734715192000,"abstract":"  In the Standard Model (SM), electroweak (EW) corrections become significant\nat high energies, particularly at the tera-electronvolt scale and beyond, due\nto the presence of Sudakov logarithms. At these energy scales, the Standard\nModel Effective Field Theory (SMEFT) framework provides an enhanced sensitivity\nto potential new physics effects. This motivates the inclusion of EW\ncorrections not only for SM predictions but also for analyses within SMEFT. In\nthis work, we compute EW corrections in the high-energy limit for a selected\nset of dimension-six operators, specifically the class of four-fermion contact\ninteractions, in key hard-scattering processes relevant to both current and\nfuture colliders: top-quark pair production at the Large Hadron Collider (LHC)\nand in a muon collider scenario, as well as the Drell-Yan process at the LHC.\nWe first discuss the technical details and challenges associated with\nevaluating EW Sudakov logarithms in SMEFT, contrasting them with the SM case.\nWe then present phenomenological results for the aforementioned processes,\nhighlighting the non-trivial effects introduced by EW corrections arising from\nthe insertion of dimension-six, four-fermion operators. Importantly, the\nresulting $K$-factors exhibit significant deviations from their SM\ncounterparts, with dependencies not only on the process but also on the\nspecific operators considered. Finally, we explore the potential to lift flat\ndirections in the SMEFT parameter space by incorporating higher-order\ncorrections, using Fisher information techniques.\n","subjects":["Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"frh2HpXAVXEySNzrkRYFPh1vrbEro_o_2C26xc8hJxU","pdfSize":"2735657"}