{
  "id": "2412.14733",
  "title": "Topological eigenvalues braiding and quantum state transfer near a\n  third-order exceptional point",
  "authors": "He Zhang, Tong Liu, Zhongcheng Xiang, Kai Xu, Heng Fan and Dongning\n  Zheng",
  "authorsParsed": [
    [
      "Zhang",
      "He",
      ""
    ],
    [
      "Liu",
      "Tong",
      ""
    ],
    [
      "Xiang",
      "Zhongcheng",
      ""
    ],
    [
      "Xu",
      "Kai",
      ""
    ],
    [
      "Fan",
      "Heng",
      ""
    ],
    [
      "Zheng",
      "Dongning",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 11:02:49 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734606169000,
  "abstract": "  Non-Hermitian systems exhibit a variety of unique features rooted in the\npresence of exceptional points (EP). The distinct topological structure in the\nproximity of an EP gives rise to counterintuitive behaviors absent in Hermitian\nsystems, which emerge after encircling the EP either quasistatically or\ndynamically. However, experimental exploration of EP encirclement in quantum\nsystems, particularly those involving high-order EPs, remains challenging due\nto the difficulty of coherently controlling more degrees of freedom. In this\nwork, we experimentally investigate the eigenvalues braiding and state transfer\narising from the encirclement of EP in a three-dimensional non-Hermitian\nquantum system using superconducting circuits. We characterize the second- and\nthird-order EPs through the coalescence of eigenvalues. Then we reveal the\ntopological structure near the EP3 by quasistatically encircling it along\nvarious paths with three independent parameters, which yields the eigenvalues\nbraiding described by the braid group $B_3$. Additionally, we observe chiral\nstate transfer between three eigenstates under a fast driving scheme when no\nEPs are enclosed, while time-symmetric behavior occurs when at least one EP is\nencircled. Our findings offer insights into understanding non-Hermitian\ntopological structures and the manipulation of quantum states through dynamic\noperations.\n",
  "subjects": [
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "X-pn_SwWDC2BxEsn12iqPRzkhdfGJsoT-AwnqIdlPeQ",
  "pdfSize": "3923574"
}