{
  "id": "2412.01316",
  "title": "Long Video Diffusion Generation with Segmented Cross-Attention and\n  Content-Rich Video Data Curation",
  "authors": "Xin Yan, Yuxuan Cai, Qiuyue Wang, Yuan Zhou, Wenhao Huang, Huan Yang",
  "authorsParsed": [
    [
      "Yan",
      "Xin",
      ""
    ],
    [
      "Cai",
      "Yuxuan",
      ""
    ],
    [
      "Wang",
      "Qiuyue",
      ""
    ],
    [
      "Zhou",
      "Yuan",
      ""
    ],
    [
      "Huang",
      "Wenhao",
      ""
    ],
    [
      "Yang",
      "Huan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 09:32:36 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733131956000,
  "abstract": "  We introduce Presto, a novel video diffusion model designed to generate\n15-second videos with long-range coherence and rich content. Extending video\ngeneration methods to maintain scenario diversity over long durations presents\nsignificant challenges. To address this, we propose a Segmented Cross-Attention\n(SCA) strategy, which splits hidden states into segments along the temporal\ndimension, allowing each segment to cross-attend to a corresponding\nsub-caption. SCA requires no additional parameters, enabling seamless\nincorporation into current DiT-based architectures. To facilitate high-quality\nlong video generation, we build the LongTake-HD dataset, consisting of 261k\ncontent-rich videos with scenario coherence, annotated with an overall video\ncaption and five progressive sub-captions. Experiments show that our Presto\nachieves 78.5% on the VBench Semantic Score and 100% on the Dynamic Degree,\noutperforming existing state-of-the-art video generation methods. This\ndemonstrates that our proposed Presto significantly enhances content richness,\nmaintains long-range coherence, and captures intricate textual details. More\ndetails are displayed on our project page: https://presto-video.github.io/.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Multimedia"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "E51h29gNGM8btqMt2k5S3cSWA90nLHHkSQ6DX9uK1lk",
  "pdfSize": "19482009"
}