{"id":"2412.17358","title":"Risk-Sensitive Orbital Debris Collision Avoidance using Distributionally\n  Robust Chance Constraints","authors":"Kanghyun Ryu, Jean-Baptiste Bouvier, Shazaib Lalani, Siegfried Eggl,\n  Negar Mehr","authorsParsed":[["Ryu","Kanghyun",""],["Bouvier","Jean-Baptiste",""],["Lalani","Shazaib",""],["Eggl","Siegfried",""],["Mehr","Negar",""]],"versions":[{"version":"v1","created":"Mon, 23 Dec 2024 07:37:16 GMT"}],"updateDate":"2024-12-24","timestamp":1734939436000,"abstract":"  The exponential increase in orbital debris and active satellites will lead to\ncongested orbits, necessitating more frequent collision avoidance maneuvers by\nsatellites. To minimize fuel consumption while ensuring the safety of\nsatellites, enforcing a chance constraint, which poses an upper bound in\ncollision probability with debris, can serve as an intuitive safety measure.\nHowever, accurately evaluating collision probability, which is critical for the\neffective implementation of chance constraints, remains a non-trivial task.\nThis difficulty arises because uncertainty propagation in nonlinear orbit\ndynamics typically provides only limited information, such as finite samples or\nmoment estimates about the underlying arbitrary non-Gaussian distributions.\nFurthermore, even if the full distribution were known, it remains unclear how\nto effectively compute chance constraints with such non-Gaussian distributions.\nTo address these challenges, we propose a distributionally robust\nchance-constrained collision avoidance algorithm that provides a sufficient\ncondition for collision probabilities under limited information about the\nunderlying non-Gaussian distribution. Our distributionally robust approach\nsatisfies the chance constraint for all debris position distributions sharing a\ngiven mean and covariance, thereby enabling the enforcement of chance\nconstraints with limited distributional information. To achieve computational\ntractability, the chance constraint is approximated using a Conditional\nValue-at-Risk (CVaR) constraint, which gives a conservative and tractable\napproximation of the distributionally robust chance constraint. We validate our\nalgorithm on a real-world inspired satellite-debris conjunction scenario with\ndifferent uncertainty propagation methods and show that our controller can\neffectively avoid collisions.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computer Science/Robotics","Computer Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"ZA4oxOJcKjkfSEsVJAbIDEaioi2dvspbYE4_MOzvs_g","pdfSize":"865277"}