{"id":"2412.05260","title":"Machine-Learning Electron Dynamics with Moment Propagation Theory:\n  Application to Optical Absorption Spectrum Computation using Real-Time TDDFT","authors":"Nicholas J. Boyer, Christopher Shepard, Ruiyi Zhou, Jianhang Xu, and\n  Yosuke Kanai","authorsParsed":[["Boyer","Nicholas J.",""],["Shepard","Christopher",""],["Zhou","Ruiyi",""],["Xu","Jianhang",""],["Kanai","Yosuke",""]],"versions":[{"version":"v1","created":"Fri, 6 Dec 2024 18:49:53 GMT"}],"updateDate":"2024-12-09","timestamp":1733510993000,"abstract":"  We present an application of our new theoretical formulation of quantum\ndynamics, moment propagation theory (MPT) (Boyer et al., J. Chem. Phys. 160,\n064113 (2024)), for employing machine-learning techniques to simulate the\nquantum dynamics of electrons. In particular, we use real-time time-dependent\ndensity functional theory (RT-TDDFT) simulation in the gauge of the maximally\nlocalized Wannier functions (MLWFs) for training the MPT equation of motion.\nSpatially-localized time-dependent MLWFs provide a concise representation that\nis particularly convenient for the MPT expressed in terms of increasing orders\nof moments. The equation of motion for these moments can be integrated in time\nwhile the analytical expressions are quite involved. In this work,\nmachine-learning techniques were used to train the the second-order time\nderivatives of the moments using first-principles data from the RT-TDDFT\nsimulation, and this MPT enabled us to perform electron dynamics efficiently.\nThe application to computing optical absorption spectrum for various systems\nwas demonstrated as a proof-of-principles example of this approach. In addition\nto isolated molecules (water, benzene, and ethene), condensed matter systems\n(liquid water and crystalline silicon) were studied, and we also explored how\nthe principle of the nearsightedness of electrons can be employed in this\ncontext.\n","subjects":["Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"u8GN8jGMUPlxCvng0M7zQW5VMZpUJlcce9b6lp1v_FQ","pdfSize":"11210772"}