{"id":"2412.18988","title":"MTCAE-DFER: Multi-Task Cascaded Autoencoder for Dynamic Facial\n  Expression Recognition","authors":"Peihao Xiang, Kaida Wu, Chaohao Lin, Ou Bai","authorsParsed":[["Xiang","Peihao",""],["Wu","Kaida",""],["Lin","Chaohao",""],["Bai","Ou",""]],"versions":[{"version":"v1","created":"Wed, 25 Dec 2024 21:52:31 GMT"}],"updateDate":"2024-12-30","timestamp":1735163551000,"abstract":"  This paper expands the cascaded network branch of the autoencoder-based\nmulti-task learning (MTL) framework for dynamic facial expression recognition,\nnamely Multi-Task Cascaded Autoencoder for Dynamic Facial Expression\nRecognition (MTCAE-DFER). MTCAE-DFER builds a plug-and-play cascaded decoder\nmodule, which is based on the Vision Transformer (ViT) architecture and employs\nthe decoder concept of Transformer to reconstruct the multi-head attention\nmodule. The decoder output from the previous task serves as the query (Q),\nrepresenting local dynamic features, while the Video Masked Autoencoder\n(VideoMAE) shared encoder output acts as both the key (K) and value (V),\nrepresenting global dynamic features. This setup facilitates interaction\nbetween global and local dynamic features across related tasks. Additionally,\nthis proposal aims to alleviate overfitting of complex large model. We utilize\nautoencoder-based multi-task cascaded learning approach to explore the impact\nof dynamic face detection and dynamic face landmark on dynamic facial\nexpression recognition, which enhances the model's generalization ability.\nAfter we conduct extensive ablation experiments and comparison with\nstate-of-the-art (SOTA) methods on various public datasets for dynamic facial\nexpression recognition, the robustness of the MTCAE-DFER model and the\neffectiveness of global-local dynamic feature interaction among related tasks\nhave been proven.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Machine Learning","Computer Science/Multimedia"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"DB5Wz6gYgCcafNuQgkZvtNS6Q9QTHKwXAYcmUtLFOEE","pdfSize":"409871"}