{
  "id": "2412.12558",
  "title": "The Jacobi Factoring Circuit: Quantum Factoring with Near-Linear Gates\n  and Sublinear Space and Depth",
  "authors": "Gregory D. Kahanamoku-Meyer, Seyoon Ragavan, Vinod Vaikuntanathan,\n  Katherine Van Kirk",
  "authorsParsed": [
    [
      "Kahanamoku-Meyer",
      "Gregory D.",
      ""
    ],
    [
      "Ragavan",
      "Seyoon",
      ""
    ],
    [
      "Vaikuntanathan",
      "Vinod",
      ""
    ],
    [
      "Van Kirk",
      "Katherine",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 05:34:54 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734413694000,
  "abstract": "  We present a compact quantum circuit for factoring a large class of integers,\nincluding some whose classical hardness is expected to be equivalent to RSA\n(but not including RSA integers themselves). To our knowledge, it is the first\npolynomial-time circuit to achieve sublinear qubit count for a classically-hard\nfactoring problem; the circuit also achieves sublinear depth and nearly linear\ngate count. We build on the quantum algorithm for squarefree decomposition\ndiscovered by Li, Peng, Du and Suter (Nature Scientific Reports 2012), which\nrelies on computing the Jacobi symbol in quantum superposition. Our circuit\ncompletely factors any number $N$, whose prime decomposition has distinct\nexponents, and finds at least one non-trivial factor if not all exponents are\nthe same. In particular, to factor an $n$-bit integer $N=P^2 Q$ (with $P$ and\n$Q$ prime, and $Q<2^m$ for some $m$), our circuit uses $\\tilde{O}(m)$ qubits\nand has depth at most $\\tilde{O}(m + n/m)$, with $\\tilde{O}(n)$ quantum gates.\nWhen $m=\\Theta(n^a)$ with $2/3 < a < 1$, the space and depth are sublinear in\n$n$, yet no known classical algorithms exploit the relatively small size of $Q$\nto run faster than general-purpose factoring algorithms. We thus believe that\nfactoring such numbers has potential to be the most concretely efficient\nclassically-verifiable proof of quantumness currently known.\n  The technical core of our contribution is a new space-efficient and\nparallelizable quantum algorithm to compute the Jacobi symbol of $A$ mod $B$,\nin the regime where $B$ is classical and much larger than $A$. In the context\nof the larger Jacobi algorithm for factoring $N = P^2Q$, this reduces the\noverall qubit count to be roughly proportional to the length of $Q$, rather\nthan the length of $N$. Finally, we note that our circuit for computing the\nJacobi symbol generalizes to related problems, such as computing the GCD.\n",
  "subjects": [
    "Physics/Quantum Physics",
    "Computer Science/Computational Complexity"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "2s7xw8YzlCHTSxTebruNUrlpTTHkbRM67ZhpR5a_UV0",
  "pdfSize": "517633"
}