{"id":"2412.02566","title":"Effects of multi-photon states in the calibration of single-photon\n  detectors based on a portable bi-photon source","authors":"Sujeet Pani, Duncan Earl and Francisco Elohim Becerra","authorsParsed":[["Pani","Sujeet",""],["Earl","Duncan",""],["Becerra","Francisco Elohim",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 16:54:34 GMT"}],"updateDate":"2024-12-04","timestamp":1733244874000,"abstract":"  Single-photon detectors (SPDs) are ubiquitous in many protocols for quantum\nimaging, sensing, and communications. Many of these protocols critically depend\non the precise knowledge of their detection efficiency. A method for the\ncalibration of SPDs based on sources of quantum-correlated photon pairs uses\nsingle-photon detection to generate heralded single photons, which can be used\nas a standard of radiation at the single-photon level. These heralded photons\nthen allow for precise calibration of SPDs in absolute terms. In this work, we\ninvestigate the absolute calibration of avalanche photodiodes based on a\nportable, commercial bi-photon source, and investigate the effects of\nmulti-photon events from the spontaneous parametric down conversion (SPDC)\nprocess in these sources. We show that the multi-photon character of the\nbi-photon source, together with system losses, has a significant impact on the\nachievable accuracy for the calibration of SPDs. However, modeling the expected\nphoton counting statistics from the squeezed vacuum in the SPDC process allows\nfor accurate estimation of the efficiency of SPDs, assuming that the system\nlosses are known. This study provides essential information for the design and\noptimization of portable bi-photon sources for their application in on-site\ncalibration of SPDs with high accuracy, without requiring any other reference\nstandard.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"G4-PLUsIGGRHmMt8wWTLHlClAgDU7Kjn7UL1VtG2qj0","pdfSize":"2149559"}