{
  "id": "2412.20725",
  "title": "Dialogue Director: Bridging the Gap in Dialogue Visualization for\n  Multimodal Storytelling",
  "authors": "Min Zhang, Zilin Wang, Liyan Chen, Kunhong Liu, Juncong Lin",
  "authorsParsed": [
    [
      "Zhang",
      "Min",
      ""
    ],
    [
      "Wang",
      "Zilin",
      ""
    ],
    [
      "Chen",
      "Liyan",
      ""
    ],
    [
      "Liu",
      "Kunhong",
      ""
    ],
    [
      "Lin",
      "Juncong",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 30 Dec 2024 05:54:23 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735538063000,
  "abstract": "  Recent advances in AI-driven storytelling have enhanced video generation and\nstory visualization. However, translating dialogue-centric scripts into\ncoherent storyboards remains a significant challenge due to limited script\ndetail, inadequate physical context understanding, and the complexity of\nintegrating cinematic principles. To address these challenges, we propose\nDialogue Visualization, a novel task that transforms dialogue scripts into\ndynamic, multi-view storyboards. We introduce Dialogue Director, a\ntraining-free multimodal framework comprising a Script Director,\nCinematographer, and Storyboard Maker. This framework leverages large\nmultimodal models and diffusion-based architectures, employing techniques such\nas Chain-of-Thought reasoning, Retrieval-Augmented Generation, and multi-view\nsynthesis to improve script understanding, physical context comprehension, and\ncinematic knowledge integration. Experimental results demonstrate that Dialogue\nDirector outperforms state-of-the-art methods in script interpretation,\nphysical world understanding, and cinematic principle application,\nsignificantly advancing the quality and controllability of dialogue-based story\nvisualization.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "MyNOqRzKCozkEVrMJ65kpPBubJ_RHtmJvoKqsR4EWeg",
  "pdfSize": "1073894"
}