{
  "id": "2412.18657",
  "title": "Synthesis and Stability Kinetics of Nanoporous TaC Derived from Ta\n  Precursors",
  "authors": "Catherine Ott, Vaibhav Verma, Adam Peters, Ian McCue",
  "authorsParsed": [
    [
      "Ott",
      "Catherine",
      ""
    ],
    [
      "Verma",
      "Vaibhav",
      ""
    ],
    [
      "Peters",
      "Adam",
      ""
    ],
    [
      "McCue",
      "Ian",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 24 Dec 2024 19:07:03 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735067223000,
  "abstract": "  Ultra-high temperature ceramics (UHTCs) are promising materials for use in\nnext-generation aerospace structures but have primarily been used as monolithic\nmaterials or coatings due to processing limitations. Here, new functionality\n(e.g., ablation resistance) is introduced to these materials by developing a\nporous form factor that can be later infiltrated with a secondary phase. This\nUHTC scaffold is synthesized via gas-phase carburization of nanoporous tantalum\nto the ultra-high-temperature ceramic, TaC. The kinetics of Ta conversion in a\ncarburizing environment was examined over a range of temperatures to determine\nrate-limiting behavior and activation energy for the process. A 1-D moving\ninterface model was constructed to predict carburization depth and compare data\nfrom the present work to that in the literature. It was found that the\nactivation energy for carburization increases as conversion proceeds,\nsuggesting a transition from grain boundary to bulk diffusion. Additionally, to\nsimulate potential use cases of this nanoporous ceramic, the compositional and\nmorphological stability was evaluated in a high temperature environment.\nFinally, the utility of this thermally stable porous UHTC was demonstrated\nthrough synthesis of a nanostructured composite of TaC and oxidation-resistant\nmaterial, SiO2.\n",
  "subjects": [
    "Condensed Matter/Materials Science",
    "Physics/Applied Physics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "umBWE9uyh1AkTqmwXgAY6dpdLOVUT_Z0Ty35Rams-co",
  "pdfSize": "4341631"
}