{"id":"2412.11887","title":"On the importance of Ni-Au-Ga interdiffusion in the formation of a Ni-Au\n  / p-GaN ohmic contact","authors":"Jules Duraz, Hassen Souissi, Maksym Gromovyi, David Troadec, Teo\n  Baptiste, Nathaniel Findling, Phuong Vuong, Rajat Gujrati, Thi May Tran, Jean\n  Paul Salvestrini, Maria Tchernycheva, Suresh Sundaram, Abdallah Ougazzaden,\n  Gilles Patriarche and Sophie Bouchoule","authorsParsed":[["Duraz","Jules",""],["Souissi","Hassen",""],["Gromovyi","Maksym",""],["Troadec","David",""],["Baptiste","Teo",""],["Findling","Nathaniel",""],["Vuong","Phuong",""],["Gujrati","Rajat",""],["Tran","Thi May",""],["Salvestrini","Jean Paul",""],["Tchernycheva","Maria",""],["Sundaram","Suresh",""],["Ougazzaden","Abdallah",""],["Patriarche","Gilles",""],["Bouchoule","Sophie",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 15:36:49 GMT"},{"version":"v2","created":"Mon, 10 Feb 2025 14:57:49 GMT"}],"updateDate":"2025-02-11","timestamp":1734363409000,"abstract":"  The Ni-Au-Ga interdiffusion mechanisms taking place during rapid thermal\nannealing (RTA) under oxygen atmosphere of a Ni-Au/p-GaN contact are\ninvestigated by high-resolution transmission electron microscopy (HR-TEM)\ncoupled to energy dispersive X-ray spectroscopy (EDX). It is shown that\noxygen-assisted, Ni diffusion to the top surface of the metallic contact\nthrough the formation of a nickel oxide (NiOx) is accompanied by Au diffusion\ndown to the GaN surface, and by Ga out-diffusion through the GaN/metal\ninterface. Electrical characterizations of the contact by Transmission Line\nMethod (TLM) show that an ohmic contact is obtained as soon as a thin, Au-Ga\ninterfacial layer is formed, even after complete diffusion of Ni or NiOx to the\ntop surface of the contact. Our results clarify that the presence of Ni or NiOx\nat the interface is not the main origin of the ohmic-like behavior in such\ncontacts. Auto-cleaning of the interface during the interdiffusion process may\nplay a role, but TEM-EDX analysis evidences that the creation of Ga vacancies\nassociated to the formation of a Ga-Au interfacial layer is crucial for\nreducing the Schottky barrier height, and maximizing the amount of current\nflowing through the contact.\n","subjects":["Condensed Matter/Materials Science","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"zAlH86KfU1T9qcbOwog64t7uTy82ZmrScB9lMp2nmFY","pdfSize":"30167475"}