{
  "id": "2412.15160",
  "title": "On the structure of the Schur squares of Twisted Generalized\n  Reed-Solomon codes and application to cryptanalysis",
  "authors": "Alain Couvreur, Rakhi Pratihar, Nihan Tan{\\i}sal{\\i}, and Ilaria\n  Zappatore",
  "authorsParsed": [
    [
      "Couvreur",
      "Alain",
      ""
    ],
    [
      "Pratihar",
      "Rakhi",
      ""
    ],
    [
      "Tanısalı",
      "Nihan",
      ""
    ],
    [
      "Zappatore",
      "Ilaria",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 18:37:52 GMT"
    },
    {
      "version": "v2",
      "created": "Thu, 23 Jan 2025 14:20:54 GMT"
    }
  ],
  "updateDate": "2025-01-24",
  "timestamp": 1734633472000,
  "abstract": "  Twisted generalized Reed-Solomon (TGRS) codes constitute an interesting\nfamily of evaluation codes, containing a large class of maximum distance\nseparable codes non-equivalent to generalized Reed-Solomon (GRS) ones.\nMoreover, the Schur squares of TGRS codes may be much larger than those of GRS\ncodes with same dimension. Exploiting these structural differences, in 2018,\nBeelen, Bossert, Puchinger and Rosenkilde proposed a subfamily of Maximum\nDistance Separable (MDS) Twisted Reed-Solomon (TRS) codes over $\\mathbb{F}_q$\nwith $\\ell$ twists $q \\approx n^{2^{\\ell}}$ for McEliece encryption, claiming\ntheir resistance to both Sidelnikov Shestakov attack and Schur products--based\nattacks. In short, they claimed these codes to resist to classical key recovery\nattacks on McEliece encryption scheme instantiated with Reed-Solomon (RS) or\nGRS codes. In 2020, Lavauzelle and Renner presented an original attack on this\nsystem based on the computation of the subfield subcode of the public TRS code.\n  In this paper, we show that the original claim on the resistance of TRS and\nTGRS codes to Schur products based--attacks is wrong. We identify a broad class\nof codes including TRS and TGRS ones that is distinguishable from random by\ncomputing the Schur square of some shortening of the code. Then, we focus on\nthe case of single twist (i.e., $\\ell = 1$), which is the most efficient one in\nterms of decryption complexity, to derive an attack. The technique is similar\nto the distinguisher-based attacks of RS code-based systems given by Couvreur,\nGaborit, Gauthier-Uma\\~na, Otmani, Tillich in 2014.\n",
  "subjects": [
    "Computer Science/Information Theory",
    "Mathematics/Information Theory"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Ti3GsZQ2uIp0kRGQHVIxsTJn8c298NXDutKn5BTF55o",
  "pdfSize": "683745"
}