{
  "id": "2412.12298",
  "title": "A Novel Route to Oscillations via non-central SNICeroclinic Bifurcation:\n  unfolding the separatrix loop between a saddle-node and a saddle",
  "authors": "Kateryna Nechyporenko, Peter Ashwin, Krasimira Tsaneva-Atanasova",
  "authorsParsed": [
    [
      "Nechyporenko",
      "Kateryna",
      ""
    ],
    [
      "Ashwin",
      "Peter",
      ""
    ],
    [
      "Tsaneva-Atanasova",
      "Krasimira",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 19:11:42 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734376302000,
  "abstract": "  In this paper, we investigate saddle-node to saddle separatrix-loops that we\nterm SNICeroclinic bifurcations. There are generic codimension-two bifurcations\ninvolving a heteroclinic loop between one non-hyperbolic and one hyperbolic\nsaddle. A particular codimension-three case is the non-central SNICeroclinic\nbifurcation. We unfold this bifurcation in the minimal dimension (planar) case\nwhere the non-hyperbolic point is assumed to undergo a saddle-node bifurcation.\nApplying the method of Poincar\\'{e} return maps, we present a minimal set of\nperturbations that captures all qualitatively distinct behaviours near a\nnon-central SNICeroclinic loop. Specifically, we study how variation of the\nthree unfolding parameters leads to transitions from a heteroclinic and\nhomoclinic loops; saddle-node on an invariant circle (SNIC); and periodic\norbits as well as equilibria. We show that although the bifurcation has been\nlargely unexplored in applications, it can act as an organising center for\ntransitions between various types of saddle-node and saddle separatrix loops.\nIt is also a generic route to oscillations that are both born and destroyed via\nglobal bifurcations, compared to the commonly observed scenarios involving\nlocal (Hopf) bifurcations and in some cases a global (homoclinic or SNIC) and a\nlocal (Hopf) bifurcation.\n",
  "subjects": [
    "Mathematics/Dynamical Systems"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "xjgl81Ehgq85q-VkQ5JOo7rZB4rwgDGVZKgdRiPorUM",
  "pdfSize": "1005985"
}