{
  "id": "2412.12573",
  "title": "Probing Environmental Dependence of High-Redshift Galaxy Properties with\n  the Marked Correlation Function",
  "authors": "Emy Mons, Charles Jose",
  "authorsParsed": [
    [
      "Mons",
      "Emy",
      ""
    ],
    [
      "Jose",
      "Charles",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 06:06:56 GMT"
    },
    {
      "version": "v2",
      "created": "Wed, 8 Jan 2025 09:09:45 GMT"
    }
  ],
  "updateDate": "2025-01-13",
  "timestamp": 1734415616000,
  "abstract": "  In hierarchical structure formation, correlations between galaxy properties\nand their environments reveal important clues about galaxy evolution,\nemphasizing the importance of measuring these relationships. We probe the\nenvironmental dependence of Lyman-break galaxy (LBG) properties in the redshift\nrange of $3$ to $5$ using marked correlation function statistics with galaxy\nsamples from the Hyper Suprime-Cam Subaru Strategic Program and the\nCanada--France--Hawaii Telescope U-band surveys. We find that the UV magnitude\nand color of magnitude-selected LBG samples are strongly correlated with their\nenvironment, making these properties effective tracers of it. In contrast, the\nstar formation rate and stellar mass of LBGs exhibit a weak environmental\ndependence. For UV magnitudes and color, the correlation is stronger in\nbrighter galaxy samples across all redshifts and extends to scales far beyond\nthe size of typical dark matter halos. This suggests that within a given\nsample, LBGs with high UV magnitudes or colors are more likely to form pairs at\nthese scales than predicted by the two-point angular correlation function.\nMoreover, the amplitude of the marked correlation function is generally higher\nfor LBG samples compared to that of $z \\sim 0$ galaxies from previous\nstudies.We also find that for LBG samples selected by the same absolute\nthreshold magnitude or average halo mass, the correlation between UV magnitudes\nand the environment generally becomes more pronounced as the redshift\ndecreases. On the other hand, for samples with the same effective large-scale\nbias at $z\\sim 4$ and $5$, the marked correlation functions are similar on\nlarge scales.\n",
  "subjects": [
    "Astrophysics/Cosmology and Nongalactic Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "SRUHb5JLrp42Tdxgh1JTIUnud92IP6H82_2wMyV-FOk",
  "pdfSize": "1083492"
}