{"id":"2412.18042","title":"Time-Probability Dependent Knowledge Extraction in IoT-enabled Smart\n  Building","authors":"Hangli Ge, Hirotsugu Seike and Noboru Koshizuka","authorsParsed":[["Ge","Hangli",""],["Seike","Hirotsugu",""],["Koshizuka","Noboru",""]],"versions":[{"version":"v1","created":"Mon, 23 Dec 2024 23:29:29 GMT"}],"updateDate":"2024-12-25","timestamp":1734996569000,"abstract":"  Smart buildings incorporate various emerging Internet of Things (IoT)\napplications for comprehensive management of energy efficiency, human comfort,\nautomation, and security. However, the development of a knowledge extraction\nframework is fundamental. Currently, there is a lack of a unified and practical\nframework for modeling heterogeneous sensor data within buildings. In this\npaper, we propose a practical inference framework for extracting\nstatus-to-event knowledge within smart building. Our proposal includes\nIoT-based API integration, ontology model design, and time probability\ndependent knowledge extraction methods. The Building Topology Ontology (BOT)\nwas leveraged to construct spatial relations among sensors and spaces within\nthe building. We utilized Apache Jena Fuseki's SPARQL server for storing and\nquerying the RDF triple data. Two types of knowledge could be extracted:\ntimestamp-based probability for abnormal event detection and time\ninterval-based probability for conjunction of multiple events. We conducted\nexperiments (over a 78-day period) in a real smart building environment. The\ndata of light and elevator states has been collected for evaluation. The\nevaluation revealed several inferred events, such as room occupancy, elevator\ntrajectory tracking, and the conjunction of both events. The numerical values\nof detected event counts and probability demonstrate the potential for\nautomatic control in the smart building.\n","subjects":["Computer Science/Information Retrieval","Computer Science/Computational Engineering, Finance, and Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0-E5PVF6yBXAQmTlkUoeHC4sptwnS7Zv514ZwVd1igE","pdfSize":"1051704"}