{"id":"2412.08811","title":"Evidence of enhanced two-level system loss suppression in high-Q, thin\n  film aluminum microwave resonators","authors":"Carolyn G. Volpert, Emily M. Barrentine, Alberto D. Bolatto, Ari\n  Brown, Jake A. Connors, Thomas Essinger-Hileman, Larry A. Hess, Vilem Mikula,\n  Thomas R. Stevenson, and Eric R. Switzer","authorsParsed":[["Volpert","Carolyn G.",""],["Barrentine","Emily M.",""],["Bolatto","Alberto D.",""],["Brown","Ari",""],["Connors","Jake A.",""],["Essinger-Hileman","Thomas",""],["Hess","Larry A.",""],["Mikula","Vilem",""],["Stevenson","Thomas R.",""],["Switzer","Eric R.",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 22:53:40 GMT"}],"updateDate":"2024-12-13","timestamp":1733957620000,"abstract":"  As superconducting kinetic inductance detectors (KIDs) continue to grow in\npopularity for sensitive sub-mm detection and other applications, there is a\ndrive to advance toward lower loss devices. We present measurements of\ndiagnostic thin film aluminum coplanar waveguide (CPW) resonators designed to\ninform ongoing KID development at NASA Goddard Space Flight Center. The\nresonators span $\\rm f_0 = 3.5 - 4$\\,GHz and include both quarter-wave and\nhalf-wave resonators with varying coupling capacitor designs. We present\nmeasurements of the device film properties and an analysis of the dominant\nmechanisms of loss in the resonators measured in a dark environment. We\ndemonstrate quality factors of $\\rm Q_i^{-1} \\approx 3.64 - 8.57\n\\times10^{-8}$, and observe enhanced suppression of two-level system (TLS) loss\nin our devices at high internal microwave power levels before the onset of\nquasiparticle dissipation from microwave heating. We observe deviations from\nthe standard TLS loss model at low powers and temperatures below 60 mK, and use\na modified model to describe this behavior.\n","subjects":["Physics/Instrumentation and Detectors","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_l9sqVYr5CpHmASM8yBccZ4nk-gf_gNt-L_IRW9Gn8E","pdfSize":"2356130"}