{
  "id": "2412.08841",
  "title": "Structural Entropy Guided Probabilistic Coding",
  "authors": "Xiang Huang, Hao Peng, Li Sun, Hui Lin, Chunyang Liu, Jiang Cao,\n  Philip S. Yu",
  "authorsParsed": [
    [
      "Huang",
      "Xiang",
      ""
    ],
    [
      "Peng",
      "Hao",
      ""
    ],
    [
      "Sun",
      "Li",
      ""
    ],
    [
      "Lin",
      "Hui",
      ""
    ],
    [
      "Liu",
      "Chunyang",
      ""
    ],
    [
      "Cao",
      "Jiang",
      ""
    ],
    [
      "Yu",
      "Philip S.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 00:37:53 GMT"
    },
    {
      "version": "v2",
      "created": "Fri, 13 Dec 2024 12:23:58 GMT"
    }
  ],
  "updateDate": "2024-12-16",
  "timestamp": 1733963873000,
  "abstract": "  Probabilistic embeddings have several advantages over deterministic\nembeddings as they map each data point to a distribution, which better\ndescribes the uncertainty and complexity of data. Many works focus on adjusting\nthe distribution constraint under the Information Bottleneck (IB) principle to\nenhance representation learning. However, these proposed regularization terms\nonly consider the constraint of each latent variable, omitting the structural\ninformation between latent variables. In this paper, we propose a novel\nstructural entropy-guided probabilistic coding model, named SEPC. Specifically,\nwe incorporate the relationship between latent variables into the optimization\nby proposing a structural entropy regularization loss. Besides, as traditional\nstructural information theory is not well-suited for regression tasks, we\npropose a probabilistic encoding tree, transferring regression tasks to\nclassification tasks while diminishing the influence of the transformation.\nExperimental results across 12 natural language understanding tasks, including\nboth classification and regression tasks, demonstrate the superior performance\nof SEPC compared to other state-of-the-art models in terms of effectiveness,\ngeneralization capability, and robustness to label noise. The codes and\ndatasets are available at https://github.com/SELGroup/SEPC.\n",
  "subjects": [
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "fji02i8O8y4cUX1is9chbqhY5uSgi8XBXOOW9QEA0Pw",
  "pdfSize": "3288706"
}