{"id":"2412.20738","title":"SgrA* spin and mass estimates through the detection of multiple\n  extremely large mass-ratio inspirals","authors":"Ver\\'onica V\\'azquez-Aceves, Yiren Lin, Alejandro Torres-Orjuela","authorsParsed":[["Vázquez-Aceves","Verónica",""],["Lin","Yiren",""],["Torres-Orjuela","Alejandro",""]],"versions":[{"version":"v1","created":"Mon, 30 Dec 2024 06:23:10 GMT"}],"updateDate":"2024-12-31","timestamp":1735539790000,"abstract":"  We analyze the parameter estimation accuracy that can be achieved for the\nmass and spin of SgrA*, the SMBH in our Galactic Center, by detecting multiple\nextremely large mass-ratio inspirals (XMRIs). XMRIs are formed by brown dwarfs\n(BD) inspiraling into a supermassive black hole (SMBH), thus emitting\ngravitational waves (GWs) inside the detection band of future space-based\ndetectors such as LISA and TianQin. Theoretical estimates suggest the presence\nof approximately 10 XMRIs emitting detectable GWs, making them some of the most\npromising candidates for space-based GW detectors. Our analysis indicates that\neven if individual sources have low SNRs ($\\approx10$), high-precision\nparameter estimates can still be achieved by detecting multiple sources. In\nthis case, the accuracy of the parameter estimates increases by approximately\none to two orders of magnitude, at least. Moreover, by analyzing a small sample\nof 400 initial conditions for XMRIs formed in the Galactic Center, we estimate\nthat almost 80 % of the detectable XMRIs orbiting SgrA* will have\neccentricities between 0.43 to 0.95 and an SNR$\\in [10,100]$. The remaining\n$\\sim$20 % of the sources have an SNR$\\in [100,1000]$ and eccentricities\nranging from 0.25 to 0.92. Additionally, some XMRIs with high SNR are far from\nbeing circular. These loud sources with SNR$\\approx 1000$ can have\neccentricities as high as $e\\approx0.7$; although their detection chances are\nlow, representing $\\lesssim$2 % of the detectable sources, their presence is\nnot ruled out.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"ikixx9l-eL8mvoVznZFO1FsxQYZz9YzZMmcMLAHBTtQ","pdfSize":"652217"}