{
  "id": "2412.11334",
  "title": "Optomechanically and Themo-optically driven Interactions between Gilded\n  Vaterite Nanoparticles in Bubbles",
  "authors": "Hod Gilad, Andrey Ushkov, Denis Kolchanov, Andrey Machnev, Toms\n  Salgals, Vja\\v{c}eslavs Bobrovs, Hani Barhum and Pavel Ginzburg",
  "authorsParsed": [
    [
      "Gilad",
      "Hod",
      ""
    ],
    [
      "Ushkov",
      "Andrey",
      ""
    ],
    [
      "Kolchanov",
      "Denis",
      ""
    ],
    [
      "Machnev",
      "Andrey",
      ""
    ],
    [
      "Salgals",
      "Toms",
      ""
    ],
    [
      "Bobrovs",
      "Vjačeslavs",
      ""
    ],
    [
      "Barhum",
      "Hani",
      ""
    ],
    [
      "Ginzburg",
      "Pavel",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 15 Dec 2024 22:56:10 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734303370000,
  "abstract": "  The capability to tailor mutual interactions between colloidal nanoparticles\nstrongly depends on the length scales involved. While electrostatic and\noptomechanically driven interactions can cover nano and micron-scale\nlandscapes, controlling inter-particle dynamics at larger distances remains a\nchallenge. Small physical and electromagnetic cross-sections of nanoparticles\nmake long-range interactions, screened by a fluid environment, inefficient. To\nbypass the limitations, we demonstrate that forming micron-scale bubbles around\ngilded vaterite nanoparticles enables mediating long-range interactions via\nthermo-optical forces. Femtosecond laser illumination leads to the\nencapsulation of light-absorbing particles inside long-lasting micron-scale\nbubbles, which in turn behave as negative lenses refracting incident light. Our\nexperiments reveal the bubble-induced collimation of laser beams, traversing\nover mm-scale distances. The collimated beams are visualized with the aid of\nphase-contrast Schlieren imaging, which reveals refractive index variations,\ncaused by temperature gradients within the fluid. We demonstrate that the\nrefracted beams initiate the formation of secondary bubbles around nearby\ngilded vaterite particles. As the consequence, we demonstrate the ability to\ncontrol secondary bubble motion by pushing and pulling it with optical\nradiation pressure force and by thermocapillary Marangoni effect, respectively.\nThe latter facilitates interactions over millimeter-scale distances, which are\notherwise unachievable. Apart from exploring new physical effects, mediating\nlong-range interactions can find a use in a range of applications including\ndrug design and screening, photochemistry, design of colloidal suspensions, and\nmany others.\n",
  "subjects": [
    "Physics/Optics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "XVeNN3fv67FdixbghMQM5yDRTxQ99WN3ML9SUettk0c",
  "pdfSize": "588919"
}