{"id":"2412.20266","title":"\"Feeling that I was Collaborating with Them\": A 20 years Systematic\n  Literature Review of Social Virtual Reality Leveraging Collaboration","authors":"Niloofar Sayadi, Sadie Co, Diego Gomez-Zara","authorsParsed":[["Sayadi","Niloofar",""],["Co","Sadie",""],["Gomez-Zara","Diego",""]],"versions":[{"version":"v1","created":"Sat, 28 Dec 2024 20:44:24 GMT"}],"updateDate":"2024-12-31","timestamp":1735418664000,"abstract":"  As more people meet, interact, and socialize online, Social Virtual Reality\n(VR) emerges as a promising technology that can bridge the gap between\ntraditional face-to-face and online communication. Compared to traditional\nscreen-based applications, Social VR provides immersive, physical, and\nthree-dimensional social interactions, making it a promising communication tool\nfor enhancing collaborations. Despite the growing interest and research in\nSocial VR, how it has supported collaborations and teamwork has not been\nexplored in depth. To map the existing research in this domain, we conducted a\n20-year systematic literature review to characterize how Social VR has been\nemployed for collaboration. After screening 1,123 articles, we identified 51\narticles that specifically addressed how Social VR has leveraged collaboration\namong remote users. Our findings show that Social VR can enhance team\ncollaboration on three key levels: enhancing individual perceptions and\nexperiences within their groups, fostering team dynamics with virtual elements\nthat enable realistic interactions, and employing VR affordances that augment\nusers' spaces. However, the research requires a deeper understanding of how\nSocial VR can support long-term collaboration and trust-building in\ncollaborative settings. This review highlights the current practices,\nchallenges, and future research opportunities within CSCW, offering insights\nfor theorizing the impact of Social VR on team collaboration and for designing\nnew applications that effectively support remote collaborations.\n","subjects":["Computer Science/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"jn-W_PEkyYBntenIAZotHsjEhsnqOIBPdcS7Qw9QZpA","pdfSize":"2896069"}