{
  "id": "2412.10159",
  "title": "Arbitrary Reading Order Scene Text Spotter with Local Semantics Guidance",
  "authors": "Jiahao Lyu, Wei Wang, Dongbao Yang, Jinwen Zhong, Yu Zhou",
  "authorsParsed": [
    [
      "Lyu",
      "Jiahao",
      ""
    ],
    [
      "Wang",
      "Wei",
      ""
    ],
    [
      "Yang",
      "Dongbao",
      ""
    ],
    [
      "Zhong",
      "Jinwen",
      ""
    ],
    [
      "Zhou",
      "Yu",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 14:20:43 GMT"
    }
  ],
  "updateDate": "2024-12-16",
  "timestamp": 1734099643000,
  "abstract": "  Scene text spotting has attracted the enthusiasm of relative researchers in\nrecent years. Most existing scene text spotters follow the\ndetection-then-recognition paradigm, where the vanilla detection module hardly\ndetermines the reading order and leads to failure recognition. After rethinking\nthe auto-regressive scene text recognition method, we find that a well-trained\nrecognizer can implicitly perceive the local semantics of all characters in a\ncomplete word or a sentence without a character-level detection module. Local\nsemantic knowledge not only includes text content but also spatial information\nin the right reading order. Motivated by the above analysis, we propose the\nLocal Semantics Guided scene text Spotter (LSGSpotter), which auto-regressively\ndecodes the position and content of characters guided by the local semantics.\nSpecifically, two effective modules are proposed in LSGSpotter. On the one\nhand, we design a Start Point Localization Module (SPLM) for locating text\nstart points to determine the right reading order. On the other hand, a\nMulti-scale Adaptive Attention Module (MAAM) is proposed to adaptively\naggregate text features in a local area. In conclusion, LSGSpotter achieves the\narbitrary reading order spotting task without the limitation of sophisticated\ndetection, while alleviating the cost of computational resources with the grid\nsampling strategy. Extensive experiment results show LSGSpotter achieves\nstate-of-the-art performance on the InverseText benchmark. Moreover, our\nspotter demonstrates superior performance on English benchmarks for\narbitrary-shaped text, achieving improvements of 0.7\\% and 2.5\\% on Total-Text\nand SCUT-CTW1500, respectively. These results validate our text spotter is\neffective for scene texts in arbitrary reading order and shape.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "erzeWXaVflzTNF9sRQbrq-GG-48y82MxjBQJV2JVyAM",
  "pdfSize": "1012348"
}