{
  "id": "2412.08540",
  "title": "Orderly Management of Packets in RDMA by Eunomia",
  "authors": "Sana Mahmood, Jinqi Lu and Soudeh Ghorbani",
  "authorsParsed": [
    [
      "Mahmood",
      "Sana",
      ""
    ],
    [
      "Lu",
      "Jinqi",
      ""
    ],
    [
      "Ghorbani",
      "Soudeh",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 16:58:29 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733936309000,
  "abstract": "  To fulfill the low latency requirements of today's applications, deployment\nof RDMA in datacenters has become prevalent over the recent years. However, the\nin-order delivery requirement of RDMAs prevents them from leveraging powerful\ntechniques that help improve the performance of datacenters, ranging from\nfine-grained load balancers to throughput-optimal expander topologies. We\ndemonstrate experimentally that these techniques significantly deteriorate the\nperformance in an RDMA network because they induce packet reordering.\nFurthermore, lifting the in-order delivery constraint enhances the flexibility\nof RDMA networks and enables them to employ these performance-enhancing\ntechniques. To realize this, we propose an ordering layer, Eunomia, to equip\nRDMA NICs to handle packet reordering. Eunomia employs a hybrid-dynamic bitmap\nstructure that efficiently uses the limited on-chip memory with the help of a\ncustomized memory controller and handles high degrees of packet reordering. We\nevaluate the feasibility of Eunomia through an FPGA-based implementation and\nits performance through large-scale simulations. We show that Eunomia enables a\nwide range of applications in RDMA datacenter networks, such as fine-grained\nload balancers which improve performance by reducing average flow completion\ntimes by 85% and 52% compared to ECMP and Conweave, respectively, or employment\nof RDMA in expander topologies like Jellyfish which allows up to 60% lower flow\ncompletion times and higher throughput gains compared to Fat tree.\n",
  "subjects": [
    "Computer Science/Networking and Internet Architecture"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "v8sXzmWPCzDq37hUC5H3Wkqdgebc_fep537xk89j7U8",
  "pdfSize": "3533755"
}