{
  "id": "2412.20920",
  "title": "Channel Charting-assisted Non-orthogonal Pilot Allocation for Uplink\n  XL-MIMO Transmission",
  "authors": "Haohong Che, Li You, Jue Wang, Zhenzhou Jin, Chenjie Xie, Xiqi Gao",
  "authorsParsed": [
    [
      "Che",
      "Haohong",
      ""
    ],
    [
      "You",
      "Li",
      ""
    ],
    [
      "Wang",
      "Jue",
      ""
    ],
    [
      "Jin",
      "Zhenzhou",
      ""
    ],
    [
      "Xie",
      "Chenjie",
      ""
    ],
    [
      "Gao",
      "Xiqi",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 30 Dec 2024 13:01:33 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735563693000,
  "abstract": "  Extremely large-scale multiple-input multiple-output (XL-MIMO) is critical to\nfuture wireless networks. The substantial increase in the number of base\nstation (BS) antennas introduces near-field propagation effects in the wireless\nchannels, complicating channel parameter estimation and increasing pilot\noverhead. Channel charting (CC) has emerged as a potent unsupervised technique\nto effectively harness varying high-dimensional channel statistics to enable\nnon-orthogonal pilot assignment and reduce pilot overhead. In this paper, we\ninvestigate near-field channel estimation with reduced pilot overhead by\ndeveloping a CC-assisted pilot scheduling. To this end, we introduce a\npolar-domain codebook to capture the power distribution of near-field XL-MIMO\nchannels. The CC-assisted approach uses such features as inputs to enable an\neffective low-dimensional mapping of the inherent correlation patterns in\nnear-field user terminal (UT) channels. Building upon the mapped channel\ncorrelations, we further propose a near-field CC-assisted pilot allocation\n(NCC-PA) algorithm, which efficiently enhances channel orthogonality among\npilot-reusing UTs. Numerical results confirm that the NCC-PA algorithm\nsubstantially elevates the wireless transmission performance, offering a marked\nimprovement over the conventional far-field CC-PA approach.\n",
  "subjects": [
    "Computer Science/Information Theory",
    "Electrical Engineering and Systems Science/Signal Processing",
    "Mathematics/Information Theory"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "Vgx6GaGFG-WVVohLug7jrmPgyTGLT0IBTAKMquFDIK8",
  "pdfSize": "244878"
}