{
  "id": "2412.01450",
  "title": "Artificial Intelligence for Geometry-Based Feature Extraction, Analysis\n  and Synthesis in Artistic Images: A Survey",
  "authors": "Mridula Vijendran, Jingjing Deng, Shuang Chen, Edmond S. L. Ho, Hubert\n  P. H. Shum",
  "authorsParsed": [
    [
      "Vijendran",
      "Mridula",
      ""
    ],
    [
      "Deng",
      "Jingjing",
      ""
    ],
    [
      "Chen",
      "Shuang",
      ""
    ],
    [
      "Ho",
      "Edmond S. L.",
      ""
    ],
    [
      "Shum",
      "Hubert P. H.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 12:41:15 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733143275000,
  "abstract": "  Artificial Intelligence significantly enhances the visual art industry by\nanalyzing, identifying and generating digitized artistic images. This review\nhighlights the substantial benefits of integrating geometric data into AI\nmodels, addressing challenges such as high inter-class variations, domain gaps,\nand the separation of style from content by incorporating geometric\ninformation. Models not only improve AI-generated graphics synthesis quality,\nbut also effectively distinguish between style and content, utilizing inherent\nmodel biases and shared data traits. We explore methods like geometric data\nextraction from artistic images, the impact on human perception, and its use in\ndiscriminative tasks. The review also discusses the potential for improving\ndata quality through innovative annotation techniques and the use of geometric\ndata to enhance model adaptability and output refinement. Overall,\nincorporating geometric guidance boosts model performance in classification and\nsynthesis tasks, providing crucial insights for future AI applications in the\nvisual arts domain.\n",
  "subjects": [
    "Computer Science/Artificial Intelligence",
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "KaagZU2Gurj8ZZ3gxs2yI_dS7tZcNFfNk7o7LOkh7Aw",
  "pdfSize": "13420035"
}