{
  "id": "2412.04460",
  "title": "LayerFusion: Harmonized Multi-Layer Text-to-Image Generation with\n  Generative Priors",
  "authors": "Yusuf Dalva and Yijun Li and Qing Liu and Nanxuan Zhao and Jianming\n  Zhang and Zhe Lin and Pinar Yanardag",
  "authorsParsed": [
    [
      "Dalva",
      "Yusuf",
      ""
    ],
    [
      "Li",
      "Yijun",
      ""
    ],
    [
      "Liu",
      "Qing",
      ""
    ],
    [
      "Zhao",
      "Nanxuan",
      ""
    ],
    [
      "Zhang",
      "Jianming",
      ""
    ],
    [
      "Lin",
      "Zhe",
      ""
    ],
    [
      "Yanardag",
      "Pinar",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 18:59:18 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733425158000,
  "abstract": "  Large-scale diffusion models have achieved remarkable success in generating\nhigh-quality images from textual descriptions, gaining popularity across\nvarious applications. However, the generation of layered content, such as\ntransparent images with foreground and background layers, remains an\nunder-explored area. Layered content generation is crucial for creative\nworkflows in fields like graphic design, animation, and digital art, where\nlayer-based approaches are fundamental for flexible editing and composition. In\nthis paper, we propose a novel image generation pipeline based on Latent\nDiffusion Models (LDMs) that generates images with two layers: a foreground\nlayer (RGBA) with transparency information and a background layer (RGB). Unlike\nexisting methods that generate these layers sequentially, our approach\nintroduces a harmonized generation mechanism that enables dynamic interactions\nbetween the layers for more coherent outputs. We demonstrate the effectiveness\nof our method through extensive qualitative and quantitative experiments,\nshowing significant improvements in visual coherence, image quality, and layer\nconsistency compared to baseline methods.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "FoEgPpP1vfnJrG4M_vGQTgl728s7ReplkLItJC2S5P8",
  "pdfSize": "35603813"
}