{
  "id": "2412.14117",
  "title": "High-purity quantum optomechanics at room temperature",
  "authors": "Lorenzo Dania, Oscar Schmitt Kremer, Johannes Piotrowski, Davide\n  Candoli, Jayadev Vijayan, Oriol Romero-Isart, Carlos Gonzalez-Ballestero,\n  Lukas Novotny, and Martin Frimmer",
  "authorsParsed": [
    [
      "Dania",
      "Lorenzo",
      ""
    ],
    [
      "Kremer",
      "Oscar Schmitt",
      ""
    ],
    [
      "Piotrowski",
      "Johannes",
      ""
    ],
    [
      "Candoli",
      "Davide",
      ""
    ],
    [
      "Vijayan",
      "Jayadev",
      ""
    ],
    [
      "Romero-Isart",
      "Oriol",
      ""
    ],
    [
      "Gonzalez-Ballestero",
      "Carlos",
      ""
    ],
    [
      "Novotny",
      "Lukas",
      ""
    ],
    [
      "Frimmer",
      "Martin",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 18:04:04 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734545044000,
  "abstract": "  Exploiting quantum effects of mechanical motion, such as backaction evading\nmeasurements or squeezing, requires preparation of the oscillator in a\nhigh-purity state. The largest state purities in optomechanics to date have\nrelied on cryogenic cooling, combined with coupling to electromagnetic\nresonators driven with a coherent radiation field. In this work, we cool the\nmega-hertz-frequency librational mode of an optically levitated silica\nnanoparticle from room temperature to its quantum ground state. Cooling is\nrealized by coherent scattering into a Fabry-Perot cavity. We use sideband\nthermometry to infer a phonon population of 0.04 quanta under optimal\nconditions, corresponding to a state purity of 92%. The purity reached by our\nroom-temperature experiment exceeds the performance offered by mechanically\nclamped oscillators in a cryogenic environment. Our work establishes a platform\nfor high-purity quantum optomechanics at room temperature.\n",
  "subjects": [
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "yXAQpByxs5ZJtTsHiv0UVsU0Tw6cAA71VIkBlbVThMY",
  "pdfSize": "874390"
}