{
  "id": "2412.17661",
  "title": "Dynamic control of ferroic domain patterns by thermal quenching",
  "authors": "Jan Gerrit Horstmann, Ehsan Hassanpour, Yannik Zemp, Thomas\n  Lottermoser, Mads C. Weber, Manfred Fiebig",
  "authorsParsed": [
    [
      "Horstmann",
      "Jan Gerrit",
      ""
    ],
    [
      "Hassanpour",
      "Ehsan",
      ""
    ],
    [
      "Zemp",
      "Yannik",
      ""
    ],
    [
      "Lottermoser",
      "Thomas",
      ""
    ],
    [
      "Weber",
      "Mads C.",
      ""
    ],
    [
      "Fiebig",
      "Manfred",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 15:39:56 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734968396000,
  "abstract": "  Controlling the domain structure of ferroic materials is key to manipulating\ntheir functionality. Typically, quasi-static electric, magnetic, or strain\nfields are exploited to transform or pole ferroic domains. In contrast,\nmetallurgy makes use of fast thermal quenches across phase transitions to\ncreate new functional states and domain structures. This approach employs the\nrapid temporal evolution of systems far from equilibrium to overcome the\nconstraints imposed by comparably slow interactions. However, guiding the\nnonequilibrium evolution of domains towards otherwise inaccessible\nconfigurations remains largely unexplored in ferroics. Here, we harness thermal\nquenches to exert control over a ferroic domain pattern. Cooling at variable\nspeed triggers transitions between two ferroic phases in a rare-earth\northoferrite, with transient domain evolution enabling the selection of the\nfinal domain pattern. Specifically, by tuning the quench rate, we can either\ngenerate the intrinsic domain structure of the low-temperature phase or\ntransfer the original pattern of the high-temperature phase - creating a hidden\nmetastable domain configuration inaccessible at thermal equilibrium. Real-time\nimaging during rapid quenching reveals two distinct time scales governing\ndomain evolution: a fast fragmentation phase, followed by a slower relaxation\ntowards a new pattern or back to the original one. This dynamic control of\ndomain configurations, alongside external fields, strain engineering, and\nall-optical switching, offers a novel approach for actively manipulating\nferroic order.\n",
  "subjects": [
    "Condensed Matter/Materials Science"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "wQfdjCpXXkSncxv2tUYqGshP-6biId9WlESW6xFcn14",
  "pdfSize": "1617124"
}