{"id":"2412.16065","title":"A Bayesian prevalence-incidence mixture model for screening outcomes\n  with misclassification","authors":"Thomas Klausch, Birgit I. Lissenberg-Witte, Veerle M. Coup\\'e","authorsParsed":[["Klausch","Thomas",""],["Lissenberg-Witte","Birgit I.",""],["Coupé","Veerle M.",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 17:07:23 GMT"}],"updateDate":"2024-12-23","timestamp":1734714443000,"abstract":"  We propose BayesPIM, a Bayesian prevalence-incidence mixture model for\nestimating time- and covariate-dependent disease incidence from screening and\nsurveillance data. The method is particularly suited to settings where some\nindividuals may have the disease at baseline, baseline tests may be missing or\nincomplete, and the screening test has imperfect sensitivity. Building on the\nexisting PIMixture framework, which assumes perfect sensitivity, BayesPIM\naccommodates uncertain test accuracy by incorporating informative priors. By\nincluding covariates, the model can quantify heterogeneity in disease risk,\nthereby informing personalized screening strategies. We motivate the model\nusing data from high-risk familial colorectal cancer (CRC) surveillance through\ncolonoscopy, where adenomas - precursors of CRC - may already be present at\nbaseline and remain undetected due to imperfect test sensitivity. We show that\nconditioning incidence and prevalence estimates on covariates explains\nsubstantial heterogeneity in adenoma risk. Using a Metropolis-within-Gibbs\nsampler and data augmentation, BayesPIM robustly recovers incidence times while\nhandling latent prevalence. Informative priors on the test sensitivity\nstabilize estimation and mitigate non-convergence issues. Model fit can be\nassessed using information criteria and validated against a non-parametric\nestimator. In this way, BayesPIM enhances estimation accuracy and supports the\ndevelopment of more effective, patient-centered screening policies.\n","subjects":["Statistics/Methodology","Statistics/Computation"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"enRZZEmQ25GFjBDoyQi7rUjdn5urChzHWBdfULJoTZc","pdfSize":"2925543"}