{
  "id": "2412.06997",
  "title": "Adhesion study at the interface of PDMS-elastomer and borosilicate\n  glass-slide",
  "authors": "Susheel Kumar, Chiranjit Majhi, Krishnacharya Khare, Manjesh Kumar\n  Singh",
  "authorsParsed": [
    [
      "Kumar",
      "Susheel",
      ""
    ],
    [
      "Majhi",
      "Chiranjit",
      ""
    ],
    [
      "Khare",
      "Krishnacharya",
      ""
    ],
    [
      "Singh",
      "Manjesh Kumar",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 21:06:40 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733778400000,
  "abstract": "  Adhesion control at the interface of two surfaces is crucial in many\napplications. Examples are the design of micro and nanodevices such as\nmicrofuidics devices, biochips, and electronic sensors. Adhesion at the\ninterface of two materials can be controlled by various methods such as\nchemical treatment on the surface of the materials, modification of the surface\ntexture of materials, and change of the mechanical properties of materials. The\nmain idea of this study is to control the adhesion by changing the mechanical\nproperties (modulus) of polydimethylsiloxane (PDMS) elastomer. We vary the\nmodulus of PDMS elastomer by changing the mixing ratio of silicone elastomer\nbase mixing ratio and its curing agent (Sylgard 184, Dow Corning). Our study\nalso includes the effect of the thickness of the PDMS elastomer sheet on its\nadhesion behavior. Adhesion measurements at the interface of the borosilicate\nglass slide and different PDMS elastomer specimens were performed using a wedge\ntest. This method inserts a glass coverslip at the interface to create the\nwedge. We observe a significant decrease in the work of adhesion and an\nincrease in equilibrium crack length with an increase in elastic-modulus and\nthickness of the PDMS elastomer samples. We present and discuss the effect of\nmodulus and specimen-thickness on the adhesion behavior of PDMS elastomer\nagainst glass slide.\n",
  "subjects": [
    "Condensed Matter/Soft Condensed Matter",
    "Physics/Applied Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "O0iC86lf3ziJSNrmWJ2oQ5wDN0VKkeQQoG7XKvkizhY",
  "pdfSize": "4514216"
}