{
  "id": "2412.20860",
  "title": "Adaptive Heuristics for Scheduling DNN Inferencing on Edge and Cloud for\n  Personalized UAV Fleets",
  "authors": "Suman Raj, Radhika Mittal, Harshil Gupta and Yogesh Simmhan",
  "authorsParsed": [
    [
      "Raj",
      "Suman",
      ""
    ],
    [
      "Mittal",
      "Radhika",
      ""
    ],
    [
      "Gupta",
      "Harshil",
      ""
    ],
    [
      "Simmhan",
      "Yogesh",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 30 Dec 2024 10:58:48 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735556328000,
  "abstract": "  Drone fleets with onboard cameras coupled with computer vision and DNN\ninferencing models can support diverse applications. One such novel domain is\nfor one or more buddy drones to assist Visually Impaired People (VIPs) lead an\nactive lifestyle. Video inferencing tasks from such drones can help both\nnavigate the drone and provide situation awareness to the VIP, and hence have\nstrict execution deadlines. We propose a deadline-driven heuristic, DEMS-A, to\nschedule diverse DNN tasks generated continuously to perform inferencing over\nvideo segments generated by multiple drones linked to an edge, with the option\nto execute on the cloud. We use strategies like task dropping, work stealing\nand migration, and dynamic adaptation to cloud variability, to guarantee a\nQuality of Service (QoS), i.e. maximize the utility and the number of tasks\ncompleted. We also introduce an additional Quality of Experience (QoE) metric\nuseful to the assistive drone domain, which values the frequency of success for\ntask types to ensure the responsiveness and reliability of the VIP application.\nWe extend our DEMS solution to GEMS to solve this. We evaluate these\nstrategies, using (i) an emulated setup of a fleet of over 80 drones supporting\nover 25 VIPs, with real DNN models executing on pre-recorded drone video\nstreams, using Jetson Nano edges and AWS Lambda cloud functions, and (ii) a\nreal-world setup of a Tello drone and a Jetson Orin Nano edge generating drone\ncommands to follow a VIP in real-time. Our strategies present a task completion\nrate of up to 88%, up to 2.7x higher QoS utility compared to the baselines, a\nfurther 16% higher QoS utility while adapting to network variability, and up to\n75% higher QoE utility. Our practical validation exhibits task completion of up\nto 87% for GEMS and 33% higher total utility of GEMS compared to edge-only.\n",
  "subjects": [
    "Computer Science/Distributed, Parallel, and Cluster Computing"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "-wySRl-HI15vuR7skoseKbhCCemC__Gtcotdmuonkz0",
  "pdfSize": "2928476"
}