{
  "id": "2412.14623",
  "title": "FRIDAY: Mitigating Unintentional Facial Identity in Deepfake Detectors\n  Guided by Facial Recognizers",
  "authors": "Younhun Kim, Myung-Joon Kwon, Wonjun Lee, and Changick Kim",
  "authorsParsed": [
    [
      "Kim",
      "Younhun",
      ""
    ],
    [
      "Kwon",
      "Myung-Joon",
      ""
    ],
    [
      "Lee",
      "Wonjun",
      ""
    ],
    [
      "Kim",
      "Changick",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 08:21:28 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734596488000,
  "abstract": "  Previous Deepfake detection methods perform well within their training\ndomains, but their effectiveness diminishes significantly with new synthesis\ntechniques. Recent studies have revealed that detection models often create\ndecision boundaries based on facial identity rather than synthetic artifacts,\nresulting in poor performance on cross-domain datasets. To address this\nlimitation, we propose Facial Recognition Identity Attenuation (FRIDAY), a\nnovel training method that mitigates facial identity influence using a face\nrecognizer. Specifically, we first train a face recognizer using the same\nbackbone as the Deepfake detector. The recognizer is then frozen and employed\nduring the detector's training to reduce facial identity information. This is\nachieved by feeding input images into both the recognizer and the detector, and\nminimizing the similarity of their feature embeddings through our Facial\nIdentity Attenuating loss. This process encourages the detector to generate\nembeddings distinct from the recognizer, effectively reducing the impact of\nfacial identity. Extensive experiments demonstrate that our approach\nsignificantly enhances detection performance on both in-domain and cross-domain\ndatasets.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Cryptography and Security"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "H8fvTV4ku1Rj15x6lgPKwHZxQmleTuTGqfQ7VztNYA4",
  "pdfSize": "2491128"
}