{
  "id": "2412.12976",
  "title": "A compact scalable phase modulator with zero static power consumption\n  for visible integrated photonics",
  "authors": "Neil MacFarlane and Firooz Aflatouni",
  "authorsParsed": [
    [
      "MacFarlane",
      "Neil",
      ""
    ],
    [
      "Aflatouni",
      "Firooz",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 14:57:25 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734447445000,
  "abstract": "  Optical modulators in the visible regime have far-reaching applications from\nbiophotonics to quantum science. Implementations of such optical phase\nmodulators on a complementary metal-oxide-semiconductor (CMOS) compatible\nplatform have been mainly limited to utilization of the thermo-optic effect,\nliquid crystal technology, as well as piezo-optomechanical effects. Despite\nexcellent performance, the demonstrations using the thermo-optic effect and\nliquid crystal technology both suffer from limited modulation speed. Moreover,\nthe demonstrations utilizing piezo-optomechanical effects, require very large\nfootprints due to a weak modulation efficiency. Here, we report the\ndemonstration of the first highly scalable compact CMOS-compatible phase\nmodulator in the visible regime based on altering the refractive index of an\nindium-tin oxide capacitive stack over a Si${_3}$N${_4}$ waveguide through the\ncharge accumulation effect. The implemented modulator achieves a two\norders-of-magnitude larger bandwidth compared to thermo-optic and liquid\ncrystal based counterparts and close to 3 orders-of-magnitude higher modulation\nefficiency with about two orders-of-magnitude smaller footprint compared to\npiezo-optomechanical modulators. The 50 ${\\mu}$m long phase modulator achieves\na modulation efficiency, V$_{\\pi}$L, of 0.06 V$.$cm at a zero static power\nconsumption and a 31 MHz bandwidth at 637.9 nm.\n",
  "subjects": [
    "Physics/Optics",
    "Physics/Applied Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "dZzCJWN3A4dcgGOJSSK_mreCGimODy0wTZNhU1L_rFs",
  "pdfSize": "1200752"
}