{"id":"2412.15832","title":"AIFS-CRPS: Ensemble forecasting using a model trained with a loss\n  function based on the Continuous Ranked Probability Score","authors":"Simon Lang, Mihai Alexe, Mariana C. A. Clare, Christopher Roberts,\n  Rilwan Adewoyin, Zied Ben Bouall\\`egue, Matthew Chantry, Jesper Dramsch,\n  Peter D. Dueben, Sara Hahner, Pedro Maciel, Ana Prieto-Nemesio, Cathal\n  O'Brien, Florian Pinault, Jan Polster, Baudouin Raoult, Steffen Tietsche,\n  Martin Leutbecher","authorsParsed":[["Lang","Simon",""],["Alexe","Mihai",""],["Clare","Mariana C. A.",""],["Roberts","Christopher",""],["Adewoyin","Rilwan",""],["Bouallègue","Zied Ben",""],["Chantry","Matthew",""],["Dramsch","Jesper",""],["Dueben","Peter D.",""],["Hahner","Sara",""],["Maciel","Pedro",""],["Prieto-Nemesio","Ana",""],["O'Brien","Cathal",""],["Pinault","Florian",""],["Polster","Jan",""],["Raoult","Baudouin",""],["Tietsche","Steffen",""],["Leutbecher","Martin",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 12:15:54 GMT"}],"updateDate":"2024-12-23","timestamp":1734696954000,"abstract":"  Over the last three decades, ensemble forecasts have become an integral part\nof forecasting the weather. They provide users with more complete information\nthan single forecasts as they permit to estimate the probability of weather\nevents by representing the sources of uncertainties and accounting for the\nday-to-day variability of error growth in the atmosphere. This paper presents a\nnovel approach to obtain a weather forecast model for ensemble forecasting with\nmachine-learning. AIFS-CRPS is a variant of the Artificial Intelligence\nForecasting System (AIFS) developed at ECMWF. Its loss function is based on a\nproper score, the Continuous Ranked Probability Score (CRPS). For the loss, the\nalmost fair CRPS is introduced because it approximately removes the bias in the\nscore due to finite ensemble size yet avoids a degeneracy of the fair CRPS. The\ntrained model is stochastic and can generate as many exchangeable members as\ndesired and computationally feasible in inference. For medium-range forecasts\nAIFS-CRPS outperforms the physics-based Integrated Forecasting System (IFS)\nensemble for the majority of variables and lead times. For subseasonal\nforecasts, AIFS-CRPS outperforms the IFS ensemble before calibration and is\ncompetitive with the IFS ensemble when forecasts are evaluated as anomalies to\nremove the influence of model biases.\n","subjects":["Physics/Atmospheric and Oceanic Physics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"LI3YMLVsn2cFQxdBBdyiUG7qle3D9wbBqPPztoVPQ2g","pdfSize":"10047398"}