{"id":"2412.20997","title":"Towards detection of molecular parity violation via chiral co-sensing:\n  the $^1$H/$^{31}$P model system","authors":"Erik Van Dyke, James Eills, Kirill Sheberstov, John Blanchard, Manfred\n  Wagner, Robert Graf, Andr\\'es Emilio Wedenig, Konstantin Gaul, Robert Berger,\n  Rudolf Pietschnig, Denis Kargin, Danila A. Barskiy, Dmitry Budker","authorsParsed":[["Van Dyke","Erik",""],["Eills","James",""],["Sheberstov","Kirill",""],["Blanchard","John",""],["Wagner","Manfred",""],["Graf","Robert",""],["Wedenig","Andrés Emilio",""],["Gaul","Konstantin",""],["Berger","Robert",""],["Pietschnig","Rudolf",""],["Kargin","Denis",""],["Barskiy","Danila A.",""],["Budker","Dmitry",""]],"versions":[{"version":"v1","created":"Mon, 30 Dec 2024 15:03:37 GMT"}],"updateDate":"2024-12-31","timestamp":1735571017000,"abstract":"  Fundamental weak interactions have been shown to violate parity in both\nnuclear and atomic systems. However, observation of parity violation in a\nmolecular system has proven an elusive target. Nuclear spin dependent\ncontributions of the weak interaction are expected to result in energetic\ndifferences between enantiomers manifesting in nuclear magnetic resonance (NMR)\nspectra as chemical shift differences on the order of $10^{-6}$ Hz to $10^{-3}$\nHz for high-$Z$ nuclei. By employing simultaneous measurements of the\ndiastereomeric splittings for a light and a heavy nucleus in solution-state\nNMR, residual chemical shift differences persisting in non-chiral environment\nbetween enantiomers of chiral compounds smaller than the typical linewidth of\nhigh-field NMR may be resolved. Sources of error must be identified and\nminimized to verify that the observed effect is, in fact, due to parity\nviolation and not systematic effects. This paper presents a detailed analysis\nof a system incorporating \\textsuperscript{31}P and \\textsuperscript{1}H NMR to\nelucidate the systematic effects and to guide experiments with higher-$Z$\nnuclei where molecular parity violation may be resolved.\n","subjects":["Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ESwr3QCg-tRscOfW6mUzlEF8pnKqt6LlyUr9qAnVIOA","pdfSize":"9115313"}