{
  "id": "2412.10121",
  "title": "Familiarity: Better Evaluation of Zero-Shot Named Entity Recognition by\n  Quantifying Label Shifts in Synthetic Training Data",
  "authors": "Jonas Golde, Patrick Haller, Max Ploner, Fabio Barth, Nicolaas Jedema,\n  Alan Akbik",
  "authorsParsed": [
    [
      "Golde",
      "Jonas",
      ""
    ],
    [
      "Haller",
      "Patrick",
      ""
    ],
    [
      "Ploner",
      "Max",
      ""
    ],
    [
      "Barth",
      "Fabio",
      ""
    ],
    [
      "Jedema",
      "Nicolaas",
      ""
    ],
    [
      "Akbik",
      "Alan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 13:06:58 GMT"
    }
  ],
  "updateDate": "2024-12-16",
  "timestamp": 1734095218000,
  "abstract": "  Zero-shot named entity recognition (NER) is the task of detecting named\nentities of specific types (such as 'Person' or 'Medicine') without any\ntraining examples. Current research increasingly relies on large synthetic\ndatasets, automatically generated to cover tens of thousands of distinct entity\ntypes, to train zero-shot NER models. However, in this paper, we find that\nthese synthetic datasets often contain entity types that are semantically\nhighly similar to (or even the same as) those in standard evaluation\nbenchmarks. Because of this overlap, we argue that reported F1 scores for\nzero-shot NER overestimate the true capabilities of these approaches. Further,\nwe argue that current evaluation setups provide an incomplete picture of\nzero-shot abilities since they do not quantify the label shift (i.e., the\nsimilarity of labels) between training and evaluation datasets. To address\nthese issues, we propose Familiarity, a novel metric that captures both the\nsemantic similarity between entity types in training and evaluation, as well as\ntheir frequency in the training data, to provide an estimate of label shift. It\nallows researchers to contextualize reported zero-shot NER scores when using\ncustom synthetic training datasets. Further, it enables researchers to generate\nevaluation setups of various transfer difficulties for fine-grained analysis of\nzero-shot NER.\n",
  "subjects": [
    "Computer Science/Computation and Language"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "XG4kk84dU0I5D_4yS0qxaJqUYVI5EbteaPoATI2b6-k",
  "pdfSize": "4095220"
}