{
  "id": "2412.15242",
  "title": "Script-Based Dialog Policy Planning for LLM-Powered Conversational\n  Agents: A Basic Architecture for an \"AI Therapist\"",
  "authors": "Robert Wasenm\\\"uller, Kevin Hilbert, Christoph Benzm\\\"uller",
  "authorsParsed": [
    [
      "Wasenmüller",
      "Robert",
      ""
    ],
    [
      "Hilbert",
      "Kevin",
      ""
    ],
    [
      "Benzmüller",
      "Christoph",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 12:12:47 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734091967000,
  "abstract": "  Large Language Model (LLM)-Powered Conversational Agents have the potential\nto provide users with scaled behavioral healthcare support, and potentially\neven deliver full-scale \"AI therapy'\" in the future. While such agents can\nalready conduct fluent and proactive emotional support conversations, they\ninherently lack the ability to (a) consistently and reliably act by predefined\nrules to align their conversation with an overarching therapeutic concept and\n(b) make their decision paths inspectable for risk management and clinical\nevaluation -- both essential requirements for an \"AI Therapist\".\n  In this work, we introduce a novel paradigm for dialog policy planning in\nconversational agents enabling them to (a) act according to an expert-written\n\"script\" that outlines the therapeutic approach and (b) explicitly transition\nthrough a finite set of states over the course of the conversation. The script\nacts as a deterministic component, constraining the LLM's behavior in desirable\nways and establishing a basic architecture for an AI Therapist.\n  We implement two variants of Script-Based Dialog Policy Planning using\ndifferent prompting techniques and synthesize a total of 100 conversations with\nLLM-simulated patients. The results demonstrate the feasibility of this new\ntechnology and provide insights into the efficiency and effectiveness of\ndifferent implementation variants.\n",
  "subjects": [
    "Computer Science/Computation and Language",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "vroyEJkXJUkVnupg-oaEZS6xzAlvVMBQqJqU_TxUxj4",
  "pdfSize": "1540487"
}