{
  "id": "2412.13174",
  "title": "ORFormer: Occlusion-Robust Transformer for Accurate Facial Landmark\n  Detection",
  "authors": "Jui-Che Chiang, Hou-Ning Hu, Bo-Syuan Hou, Chia-Yu Tseng, Yu-Lun Liu,\n  Min-Hung Chen, Yen-Yu Lin",
  "authorsParsed": [
    [
      "Chiang",
      "Jui-Che",
      ""
    ],
    [
      "Hu",
      "Hou-Ning",
      ""
    ],
    [
      "Hou",
      "Bo-Syuan",
      ""
    ],
    [
      "Tseng",
      "Chia-Yu",
      ""
    ],
    [
      "Liu",
      "Yu-Lun",
      ""
    ],
    [
      "Chen",
      "Min-Hung",
      ""
    ],
    [
      "Lin",
      "Yen-Yu",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 18:53:43 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 14 Jan 2025 14:48:32 GMT"
    }
  ],
  "updateDate": "2025-01-15",
  "timestamp": 1734461623000,
  "abstract": "  Although facial landmark detection (FLD) has gained significant progress,\nexisting FLD methods still suffer from performance drops on partially\nnon-visible faces, such as faces with occlusions or under extreme lighting\nconditions or poses. To address this issue, we introduce ORFormer, a novel\ntransformer-based method that can detect non-visible regions and recover their\nmissing features from visible parts. Specifically, ORFormer associates each\nimage patch token with one additional learnable token called the messenger\ntoken. The messenger token aggregates features from all but its patch. This\nway, the consensus between a patch and other patches can be assessed by\nreferring to the similarity between its regular and messenger embeddings,\nenabling non-visible region identification. Our method then recovers occluded\npatches with features aggregated by the messenger tokens. Leveraging the\nrecovered features, ORFormer compiles high-quality heatmaps for the downstream\nFLD task. Extensive experiments show that our method generates heatmaps\nresilient to partial occlusions. By integrating the resultant heatmaps into\nexisting FLD methods, our method performs favorably against the state of the\narts on challenging datasets such as WFLW and COFW.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "F3guJrMr4Bc5zO9l4dut8y3ijPqZMvVeMFogndoCwVM",
  "pdfSize": "1665187"
}