{"id":"2412.08717","title":"Probing the major driver of stellar population properties over\n  sub-galaxy scales with SDSS MaNGA IFU spectroscopy","authors":"Ignacio Ferreras, Marina Trevisan, Ofer Lahav, Reinaldo R. de\n  Carvalho, Joseph Silk","authorsParsed":[["Ferreras","Ignacio",""],["Trevisan","Marina",""],["Lahav","Ofer",""],["de Carvalho","Reinaldo R.",""],["Silk","Joseph",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 19:00:03 GMT"}],"updateDate":"2024-12-13","timestamp":1733943603000,"abstract":"  Thanks to Integral Field Unit survey data it is possible to explore in detail\nthe link between the formation of the stellar content in galaxies and the\ndrivers of evolution. Traditionally, scaling relations have connected\ngalaxy-wide parameters such as stellar mass (M$_s$), morphology or average\nvelocity dispersion ($\\sigma$) to the star formation histories (SFHs). We study\na high quality sample of SDSS-MaNGA spectra to test the possibility that\nsub-galaxy ($\\sim$2\\,kpc) scales are dominant, instead of galaxy-wide\nparameters. We find a strong correlation between local velocity dispersion and\nkey line strengths that depend on the SFHs, allowing us to make the ansatz that\nthis indicator - that maps the local gravitational potential - is the major\ndriver of star formation in galaxies, whereas larger scales play a role of a\nsecondary nature. Galactocentric distance has a weaker correlation, suggesting\nthat the observed radial gradients effectively reflect local variations of\nvelocity dispersion. In our quest for a cause, instead of a correlation, we\ncontrast $\\sigma$ with local stellar mass, that appears less correlated with\npopulation properties. We conclude that the inherently higher uncertainty in\nM$_s$ may explain its lower correlation with respect to $\\sigma$, but the extra\nuncertainty needed for $\\sigma$ to have similar correlations as M$_s$ is rather\nhigh. Therefore we posit local velocity dispersion as the major driver of\nevolution, a result that should be reproduced by hydrodynamical models at the\nproper resolution.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"cDlbFJcQqMA-azdbSq9Vnia4cdlINE17VuWythHwz-8","pdfSize":"17076934"}