{
  "id": "2412.16731",
  "title": "Morphing the left atrium geometry: The role of the pulmonary veins on\n  flow patterns and thrombus formation",
  "authors": "Sergio Rodr\\'iguez-Aparicio, Conrado Ferrera, Mar\\'ia Eugenia\n  Fuentes-Ca\\~namero, Javier Garc\\'ia Garc\\'ia and Jorge Due\\~nas-Pamplona",
  "authorsParsed": [
    [
      "Rodríguez-Aparicio",
      "Sergio",
      ""
    ],
    [
      "Ferrera",
      "Conrado",
      ""
    ],
    [
      "Fuentes-Cañamero",
      "María Eugenia",
      ""
    ],
    [
      "García",
      "Javier García",
      ""
    ],
    [
      "Dueñas-Pamplona",
      "Jorge",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 21 Dec 2024 18:41:40 GMT"
    },
    {
      "version": "v2",
      "created": "Thu, 23 Jan 2025 10:38:58 GMT"
    }
  ],
  "updateDate": "2025-01-24",
  "timestamp": 1734806500000,
  "abstract": "  Background: Despite the significant advances made in the field of\ncomputational fluid dynamics (CFD) to simulate the left atrium (LA) in atrial\nfibrillation (AF) conditions, the connection between atrial structure, flow\ndynamics, and blood stagnation in the left atrial appendage (LAA) remains\nunclear. Deepening our understanding of this relationship would have important\nclinical implications, as the thrombi formed within the LAA are one of the main\ncauses of stroke.\n  Aim: To highlight and better understand the fundamental role of the PV\norientation in forming atrial flow patterns and systematically quantifying its\neffect on blood stasis within the LAA.\n  Methods: Two patients with opposite atrial flow patterns were selected for\nthe study. The atria were segmented and subsequently morphed to modify the\npulmonary vein (PV) orientations in a highly controlled manner. CFD analysis\nwere performed using a kinematic model able to reproduce AF conditions. Results\nwere projected into the universal left atrial appendage coordinate (ULAAC)\nsystem to enhance data visualization and comparison.\n  Results: The position of the main atrial vortex can be modified by controlled\nchanges in the PV orientations, which to the best of our knowledge was not\ndemonstrated before. This finding may have important clinical implications, as\nthe behavior and position of the main atrial vortex is crucial to define the LA\nflow patterns and thus the LAA washing, making possible to assess the stroke\nrisk for a particular patient.\n",
  "subjects": [
    "Physics/Medical Physics",
    "Physics/Fluid Dynamics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "VHTzXTSxkjY5qR4tuvdYFm_8JLPJDWKAs2WuzCfB4yQ",
  "pdfSize": "17960259"
}