{"id":"2412.16335","title":"Improving Equity in Health Modeling with GPT4-Turbo Generated Synthetic\n  Data: A Comparative Study","authors":"Daniel Smolyak, Arshana Welivita, Margr\\'et V. Bjarnad\\'ottir, Ritu\n  Agarwal","authorsParsed":[["Smolyak","Daniel",""],["Welivita","Arshana",""],["Bjarnadóttir","Margrét V.",""],["Agarwal","Ritu",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 20:49:17 GMT"}],"updateDate":"2024-12-24","timestamp":1734727757000,"abstract":"  Objective. Demographic groups are often represented at different rates in\nmedical datasets. These differences can create bias in machine learning\nalgorithms, with higher levels of performance for better-represented groups.\nOne promising solution to this problem is to generate synthetic data to\nmitigate potential adverse effects of non-representative data sets.\n  Methods. We build on recent advances in LLM-based synthetic data generation\nto create a pipeline where the synthetic data is generated separately for each\ndemographic group. We conduct our study using MIMIC-IV and Framingham\n\"Offspring and OMNI-1 Cohorts\" datasets. We prompt GPT4-Turbo to create\ngroup-specific data, providing training examples and the dataset context. An\nexploratory analysis is conducted to ascertain the quality of the generated\ndata. We then evaluate the utility of the synthetic data for augmentation of a\ntraining dataset in a downstream machine learning task, focusing specifically\non model performance metrics across groups.\n  Results. The performance of GPT4-Turbo augmentation is generally superior but\nnot always. In the majority of experiments our method outperforms standard\nmodeling baselines, however, prompting GPT-4-Turbo to produce data specific to\na group provides little to no additional benefit over a prompt that does not\nspecify the group.\n  Conclusion. We developed a method for using LLMs out-of-the-box to synthesize\ngroup-specific data to address imbalances in demographic representation in\nmedical datasets. As another \"tool in the toolbox\", this method can improve\nmodel fairness and thus health equity. More research is needed to understand\nthe conditions under which LLM generated synthetic data is useful for\nnon-representative medical data sets.\n","subjects":["Computer Science/Machine Learning","Computer Science/Computers and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"KMfeSNMufWk1-3aeZLik5-zIBq35yTnax7KdnrhpX8k","pdfSize":"1275313"}