{"id":"2412.07912","title":"How Can I Assist You Today?: A Comparative Analysis of a Humanoid Robot\n  and a Virtual Human Avatar in Human Perception","authors":"Bora Tarlan and Nisa Erdal","authorsParsed":[["Tarlan","Bora",""],["Erdal","Nisa",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 20:42:18 GMT"}],"updateDate":"2024-12-12","timestamp":1733863338000,"abstract":"  This study explores human perceptions of intelligent agents by comparing\ninteractions with a humanoid robot and a virtual human avatar, both utilizing\nGPT-3 for response generation. The study aims to understand how physical and\nvirtual embodiments influence perceptions of anthropomorphism, animacy,\nlikeability, and perceived intelligence. The uncanny valley effect was also\ninvestigated in the scope of this study based on the two agents' human-likeness\nand affinity. Conducted with ten participants from Sabanci University, the\nexperiment involved tasks that sought advice, followed by assessments using the\nGodspeed Questionnaire Series and structured interviews. Results revealed no\nsignificant difference in anthropomorphism between the humanoid robot and the\nvirtual human avatar, but the humanoid robot was perceived as more likable and\nslightly more intelligent, highlighting the importance of physical presence and\ninteractive gestures. These findings suggest that while virtual avatars can\nachieve high human-likeness, physical embodiment enhances likeability and\nperceived intelligence. However, the study's scope was insufficient to claim\nthe existence of the uncanny valley effect in the participants' interactions.\nThe study offers practical insights for designing future intelligent\nassistants, emphasizing the need for integrating physical elements and\nsophisticated communicative behaviors to improve user experience and\nacceptance.\n","subjects":["Computer Science/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ximNUwL5_Ksg4MCyvzgQUbKrx-3WWe16-zEDIJn5uuc","pdfSize":"836226"}