{"id":"2412.18019","title":"Bio-inspired site characterization -- towards soundings with lightweight\n  equipment","authors":"Alejandro Martinez, Yuyan Chen, and Riya Anilkumar","authorsParsed":[["Martinez","Alejandro",""],["Chen","Yuyan",""],["Anilkumar","Riya",""]],"versions":[{"version":"v1","created":"Mon, 23 Dec 2024 22:31:40 GMT"}],"updateDate":"2024-12-25","timestamp":1734993100000,"abstract":"  Equipment used for site investigation activities like drill rigs are\ntypically large and heavy to provide sufficient reaction mass to overcome the\nsoil's penetration resistance. The need for large and heavy equipment creates\nchallenges for performing site investigations at sites with limited\naccessibility, such as urban centres, vegetated areas, locations with height\nrestrictions and surficial soft soils, and steep slopes. Also, mobilization of\nlarge equipment to the project site is responsible for a significant portion of\nthe carbon footprint of site investigations. Successful development of self\nburrowing technology can have enormous implications for geotechnical site\ninvestigation, ranging from performance of in situ tests to installation of\ninstrumentation without the need of heavy equipment. During the last decade\nthere has been an acceleration of research in the field of bioinspired\ngeotechnics, whose premise is that certain animals and plants have developed\nefficient strategies to interact with geomaterials in ways that are analogous\nto those in geotechnical engineering. This paper provides a synthesis of\nadvances in bioinspired site investigation related to the reduction of\npenetration resistance by means of modifying the tip shape, expanding a shaft\nsection near the probe tip, applying motions to the tip like rotation and\noscillation, and injecting fluids and generation of reaction forces with\ntemporary anchors that enable self burrowing. Examples of prototypes that have\nbeen tested experimentally are highlighted. However, there are important\nresearch gaps associated with testing in a broader range of conditions,\ninterpretation of results, and development of hardware that need to be\naddressed to develop field ready equipment that can provide useful data for\ngeotechnical design.\n","subjects":["Physics/Geophysics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"PQWUrR4vjZ-xCy9kyElvW89ul5HNsAH1PhXnygjOnEc","pdfSize":"3634970"}