{
  "id": "2412.11127",
  "title": "Modeling the Heterogeneous Duration of User Interest in Time-Dependent\n  Recommendation: A Hidden Semi-Markov Approach",
  "authors": "Haidong Zhang, Wancheng Ni, Xin Li, Yiping Yang",
  "authorsParsed": [
    [
      "Zhang",
      "Haidong",
      ""
    ],
    [
      "Ni",
      "Wancheng",
      ""
    ],
    [
      "Li",
      "Xin",
      ""
    ],
    [
      "Yang",
      "Yiping",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 15 Dec 2024 09:17:45 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734254265000,
  "abstract": "  Recommender systems are widely used for suggesting books, education\nmaterials, and products to users by exploring their behaviors. In reality,\nusers' preferences often change over time, leading to studies on time-dependent\nrecommender systems. However, most existing approaches that deal with time\ninformation remain primitive. In this paper, we extend existing methods and\npropose a hidden semi-Markov model to track the change of users' interests.\nParticularly, this model allows for capturing the different durations of user\nstays in a (latent) interest state, which can better model the heterogeneity of\nuser interests and focuses. We derive an expectation maximization algorithm to\nestimate the parameters of the framework and predict users' actions.\nExperiments on three real-world datasets show that our model significantly\noutperforms the state-of-the-art time-dependent and static benchmark methods.\nFurther analyses of the experiment results indicate that the performance\nimprovement is related to the heterogeneity of state durations and the drift of\nuser interests in the dataset.\n",
  "subjects": [
    "Computer Science/Information Retrieval",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "1GtMxmG2z1hRFIMsXkertt7sXWsyN4AUN5m9b5-l9Bk",
  "pdfSize": "2239593"
}