{"id":"2412.14234","title":"Syzygy: Dual Code-Test C to (safe) Rust Translation using LLMs and\n  Dynamic Analysis","authors":"Manish Shetty, Naman Jain, Adwait Godbole, Sanjit A. Seshia, Koushik\n  Sen","authorsParsed":[["Shetty","Manish",""],["Jain","Naman",""],["Godbole","Adwait",""],["Seshia","Sanjit A.",""],["Sen","Koushik",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 18:55:46 GMT"},{"version":"v2","created":"Sat, 21 Dec 2024 18:49:38 GMT"}],"updateDate":"2024-12-24","timestamp":1734548146000,"abstract":"  Despite extensive usage in high-performance, low-level systems programming\napplications, C is susceptible to vulnerabilities due to manual memory\nmanagement and unsafe pointer operations. Rust, a modern systems programming\nlanguage, offers a compelling alternative. Its unique ownership model and type\nsystem ensure memory safety without sacrificing performance.\n  In this paper, we present Syzygy, an automated approach to translate C to\nsafe Rust. Our technique uses a synergistic combination of LLM-driven code and\ntest translation guided by dynamic-analysis-generated execution information.\nThis paired translation runs incrementally in a loop over the program in\ndependency order of the code elements while maintaining per-step correctness.\nOur approach exposes novel insights on combining the strengths of LLMs and\ndynamic analysis in the context of scaling and combining code generation with\ntesting. We apply our approach to successfully translate Zopfli, a\nhigh-performance compression library with ~3000 lines of code and 98 functions.\nWe validate the translation by testing equivalence with the source C program on\na set of inputs. To our knowledge, this is the largest automated and\ntest-validated C to safe Rust code translation achieved so far.\n","subjects":["Computer Science/Software Engineering","Computer Science/Artificial Intelligence","Computer Science/Machine Learning","Computer Science/Programming Languages"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"naO0BpF3HSPGf54y5XGginaVvD_2AT1_nug_zWwJhLc","pdfSize":"1249014"}