{
  "id": "2412.09433",
  "title": "Solving Multiagent Path Finding on Highly Centralized Networks",
  "authors": "Foivos Fioravantes, Du\\v{s}an Knop, Jan Maty\\'a\\v{s}\n  K\\v{r}i\\v{s}\\v{t}an, Nikolaos Melissinos, Michal Opler and Tung Anh Vu",
  "authorsParsed": [
    [
      "Fioravantes",
      "Foivos",
      ""
    ],
    [
      "Knop",
      "Dušan",
      ""
    ],
    [
      "Křišťan",
      "Jan Matyáš",
      ""
    ],
    [
      "Melissinos",
      "Nikolaos",
      ""
    ],
    [
      "Opler",
      "Michal",
      ""
    ],
    [
      "Vu",
      "Tung Anh",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 16:38:25 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1734021505000,
  "abstract": "  The Mutliagent Path Finding (MAPF) problem consists of identifying the\ntrajectories that a set of agents should follow inside a given network in order\nto reach their desired destinations as soon as possible, but without colliding\nwith each other. We aim to minimize the maximum time any agent takes to reach\ntheir goal, ensuring optimal path length. In this work, we complement a recent\nthread of results that aim to systematically study the algorithmic behavior of\nthis problem, through the parameterized complexity point of view.\n  First, we show that MAPF is NP-hard when the given network has a star-like\ntopology (bounded vertex cover number) or is a tree with $11$ leaves. Both of\nthese results fill important gaps in our understanding of the tractability of\nthis problem that were left untreated in the recent work of [Fioravantes et al.\nExact Algorithms and Lowerbounds for Multiagent Path Finding: Power of Treelike\nTopology. AAAI'24]. Nevertheless, our main contribution is an exact algorithm\nthat scales well as the input grows (FPT) when the topology of the given\nnetwork is highly centralized (bounded distance to clique). This parameter is\nsignificant as it mirrors real-world networks. In such environments, a bunch of\ncentral hubs (e.g., processing areas) are connected to only few peripheral\nnodes.\n",
  "subjects": [
    "Computer Science/Computational Complexity",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "RCi8O9JW6whTGLrA7-mWiSqZQItvdQoOr5R6YS-NyxA",
  "pdfSize": "820083"
}