{
  "id": "2412.01170",
  "title": "Meson spectroscopy in the $Sp(4)$ gauge theory with three antisymmetric\n  fermions",
  "authors": "Ed Bennett, Deog Ki Hong, Ho Hsiao, Jong-Wan Lee, C.-J. David Lin,\n  Biagio Lucini, Maurizio Piai, Davide Vadacchino",
  "authorsParsed": [
    [
      "Bennett",
      "Ed",
      ""
    ],
    [
      "Hong",
      "Deog Ki",
      ""
    ],
    [
      "Hsiao",
      "Ho",
      ""
    ],
    [
      "Lee",
      "Jong-Wan",
      ""
    ],
    [
      "Lin",
      "C. -J. David",
      ""
    ],
    [
      "Lucini",
      "Biagio",
      ""
    ],
    [
      "Piai",
      "Maurizio",
      ""
    ],
    [
      "Vadacchino",
      "Davide",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 06:13:05 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733119985000,
  "abstract": "  We report the results of an extensive numerical study of the $Sp(4)$ lattice\ngauge theory with three (Dirac) flavors of fermion in the two-index\nantisymmetric representation. In the presence of (degenerate) fermion masses,\nthe theory has an enhanced global $SU(6)$ symmetry, broken explicitly and\nspontaneously to its $SO(6)$ subgroup. This symmetry breaking pattern makes the\ntheory interesting for applications in the context of composite Higgs models,\nas well as for the implementation of top partial compositeness. It can also\nprovide a dynamical realisation of the strongly interacting massive particle\nparadigm for the origin of dark matter. We adopt the standard plaquette gauge\naction with the Wilson-Dirac formulation for the fermions and apply the\n(rational) hybrid Monte Carlo algorithm in our ensemble generation process. We\nmonitor the autocorrelation and topology of the ensembles. We explore the bare\nparameter space, and identify the weak and strong coupling regimes separated by\na line of first-order bulk phase transitions.\n  We measure two-point correlation functions between meson operators that\ntransform as non-trivial representations of $SO(6)$, and extract the\nground-state masses and the decay constants, in all accessible spin and parity\nchannels. In addition, we measure the mass of the first excited state for the\nvector meson by solving a generalised eigenvalue problem. Spectral quantities\nshow a mass dependence that is compatible with the expectation that, at long\ndistances, the theory undergoes confinement, accompanied by the spontaneous\nbreaking of the approximate global symmetries acting on the matter fields.\nFinally, we discuss the continuum and massless extrapolations, after setting\nthe physical scale using the gradient flow method, and compare the results to\nthose of existing studies in the quenched approximation, as well as to the\nliterature on closely related theories.\n",
  "subjects": [
    "Physics/High Energy Physics - Lattice",
    "Physics/High Energy Physics - Phenomenology",
    "Physics/High Energy Physics - Theory"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Ug_VGVAnVYLp1NHqsOvNEYh76qq6LDkg198ipUqq-UA",
  "pdfSize": "2294093"
}