{
  "id": "2412.06853",
  "title": "Tube Loss: A Novel Approach for Prediction Interval Estimation and\n  probabilistic forecasting",
  "authors": "Pritam Anand, Tathagata Bandyopadhyay, Suresh Chandra",
  "authorsParsed": [
    [
      "Anand",
      "Pritam",
      ""
    ],
    [
      "Bandyopadhyay",
      "Tathagata",
      ""
    ],
    [
      "Chandra",
      "Suresh",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 8 Dec 2024 15:17:53 GMT"
    },
    {
      "version": "v2",
      "created": "Wed, 11 Dec 2024 07:04:52 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733671073000,
  "abstract": "  This paper proposes a novel loss function, called 'Tube Loss', for\nsimultaneous estimation of bounds of a Prediction Interval (PI) in the\nregression setup, and also for generating probabilistic forecasts from time\nseries data solving a single optimization problem. The PIs obtained by\nminimizing the empirical risk based on the Tube Loss are shown to be of better\nquality than the PIs obtained by the existing methods in the following sense.\nFirst, it yields intervals that attain the prespecified confidence level $t\n\\in(0,1)$ asymptotically. A theoretical proof of this fact is given. Secondly,\nthe user is allowed to move the interval up or down by controlling the value of\na parameter. This helps the user to choose a PI capturing denser regions of the\nprobability distribution of the response variable inside the interval, and\nthus, sharpening its width. This is shown to be especially useful when the\nconditional distribution of the response variable is skewed. Further, the Tube\nLoss based PI estimation method can trade-off between the coverage and the\naverage width by solving a single optimization problem. It enables further\nreduction of the average width of PI through re-calibration. Also, unlike a few\nexisting PI estimation methods the gradient descent (GD) method can be used for\nminimization of empirical risk. Finally, through extensive experimentation, we\nhave shown the efficacy of the Tube Loss based PI estimation in kernel\nmachines, neural networks and deep networks and also for probabilistic\nforecasting tasks. The codes of the experiments are available at\nhttps://github.com/ltpritamanand/Tube_loss\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Lz4lW6wTNvGmfFLKi3QwIFhEqAY1623uG1duiMN3Q0s",
  "pdfSize": "2165893"
}