{
  "id": "2412.17684",
  "title": "COBRA: COmBinatorial Retrieval Augmentation for Few-Shot Learning",
  "authors": "Arnav M. Das, Gantavya Bhatt, Lilly Kumari, Sahil Verma, Jeff Bilmes",
  "authorsParsed": [
    [
      "Das",
      "Arnav M.",
      ""
    ],
    [
      "Bhatt",
      "Gantavya",
      ""
    ],
    [
      "Kumari",
      "Lilly",
      ""
    ],
    [
      "Verma",
      "Sahil",
      ""
    ],
    [
      "Bilmes",
      "Jeff",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 16:10:07 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734970207000,
  "abstract": "  Retrieval augmentation, the practice of retrieving additional data from large\nauxiliary pools, has emerged as an effective technique for enhancing model\nperformance in the low-data regime, e.g. few-shot learning. Prior approaches\nhave employed only nearest-neighbor based strategies for data selection, which\nretrieve auxiliary samples with high similarity to instances in the target\ntask. However, these approaches are prone to selecting highly redundant\nsamples, since they fail to incorporate any notion of diversity. In our work,\nwe first demonstrate that data selection strategies used in prior\nretrieval-augmented few-shot learning settings can be generalized using a class\nof functions known as Combinatorial Mutual Information (CMI) measures. We then\npropose COBRA (COmBinatorial Retrieval Augmentation), which employs an\nalternative CMI measure that considers both diversity and similarity to a\ntarget dataset. COBRA consistently outperforms previous retrieval approaches\nacross image classification tasks and few-shot learning techniques when used to\nretrieve samples from LAION-2B. COBRA introduces negligible computational\noverhead to the cost of retrieval while providing significant gains in\ndownstream model performance.\n",
  "subjects": [
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "EYAJKQ7nA7d8GCwXeYUPTKBuC49TP8GXynHCw8363IE",
  "pdfSize": "28789003"
}