{
  "id": "2412.01048",
  "title": "Cerberus: Attribute-based person re-identification using semantic IDs",
  "authors": "Chanho Eom, Geon Lee, Kyunghwan Cho, Hyeonseok Jung, Moonsub Jin,\n  Bumsub Ham",
  "authorsParsed": [
    [
      "Eom",
      "Chanho",
      ""
    ],
    [
      "Lee",
      "Geon",
      ""
    ],
    [
      "Cho",
      "Kyunghwan",
      ""
    ],
    [
      "Jung",
      "Hyeonseok",
      ""
    ],
    [
      "Jin",
      "Moonsub",
      ""
    ],
    [
      "Ham",
      "Bumsub",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 02:12:28 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733105548000,
  "abstract": "  We introduce a new framework, dubbed Cerberus, for attribute-based person\nre-identification (reID). Our approach leverages person attribute labels to\nlearn local and global person representations that encode specific traits, such\nas gender and clothing style. To achieve this, we define semantic IDs (SIDs) by\ncombining attribute labels, and use a semantic guidance loss to align the\nperson representations with the prototypical features of corresponding SIDs,\nencouraging the representations to encode the relevant semantics.\nSimultaneously, we enforce the representations of the same person to be\nembedded closely, enabling recognizing subtle differences in appearance to\ndiscriminate persons sharing the same attribute labels. To increase the\ngeneralization ability on unseen data, we also propose a regularization method\nthat takes advantage of the relationships between SID prototypes. Our framework\nperforms individual comparisons of local and global person representations\nbetween query and gallery images for attribute-based reID. By exploiting the\nSID prototypes aligned with the corresponding representations, it can also\nperform person attribute recognition (PAR) and attribute-based person search\n(APS) without bells and whistles. Experimental results on standard benchmarks\non attribute-based person reID, Market-1501 and DukeMTMC, demonstrate the\nsuperiority of our model compared to the state of the art.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "XECMFBnnxzLirCeSTjEXg7uoZXGcp1lVXZEO-oPZUMc",
  "pdfSize": "12338816"
}