{"id":"2412.01220","title":"Advances and Challenges of Hexagonal Boron Nitride-based Anticorrosion\n  Coatings","authors":"Onurcan Kaya, Luca Gabatel, Sebastiano Bellani, Fabrizio Barberis,\n  Francesco Bonaccorso, Ivan Cole and Stephan Roche","authorsParsed":[["Kaya","Onurcan",""],["Gabatel","Luca",""],["Bellani","Sebastiano",""],["Barberis","Fabrizio",""],["Bonaccorso","Francesco",""],["Cole","Ivan",""],["Roche","Stephan",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 07:38:47 GMT"}],"updateDate":"2024-12-03","timestamp":1733125127000,"abstract":"  The corrosion of metallic surfaces poses significant challenges across\nindustries such as petroleum, energy, and biomedical sectors, leading to\nstructural degradation, safety risks, and substantial maintenance costs.\nTraditional organic and metallic coatings provide some protection, but their\nlimited durability and susceptibility to harsh environmental conditions\nnecessitate the development of more advanced and efficient solutions. This has\ndriven significant interest in two-dimensional (2D) materials, with graphene\nextensively studied for its exceptional mechanical strength and impermeability\nto gases and ions. However, while graphene offers short-term corrosion\nprotection, its high electrical conductivity presents a long-term issue by\npromoting galvanic corrosion on metal surfaces. In contrast, hexagonal boron\nnitride (h-BN) has emerged as a promising alternative for anticorrosion\ncoatings. h-BN combines exceptional chemical stability, impermeability, and\nelectrical insulation, making it particularly suited for long-term protection\nin highly corrosive or high-temperature environments. While h-BN holds promise\nas anticorrosion material, challenges such as structural defects, agglomeration\nof nanosheets, and poor dispersion within coatings limit its performance. This\nreview provides a comprehensive analysis of recent advancements in addressing\nthese challenges, including novel functionalization strategies, scalable\nsynthesis methods, and hybrid systems that integrate h-BN with complementary\nmaterials. By bridging the gap between fundamental research and industrial\napplications, this review outlines the potential for h-BN to revolutionize\nanticorrosion technologies. These obstacles necessitate advanced strategies\nsuch as surface functionalization to improve compatibility with polymer\nmatrices and dispersion optimization to minimize agglomeration.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"eXca5FgXvX4OMtKM5jhb6azlRuBjLQ5uANYcDW8g8vw","pdfSize":"831762"}