{"id":"2412.06099","title":"DECO: Life-Cycle Management of Enterprise-Grade Chatbots","authors":"Yiwen Zhu, Mathieu Demarne, Kai Deng, Wenjing Wang, Nutan Sahoo, Divya\n  Vermareddy, Hannah Lerner, Yunlei Lu, Swati Bararia, Anjali Bhavan, William\n  Zhang, Xia Li, Katherine Lin, Miso Cilimdzic, and Subru Krishnan","authorsParsed":[["Zhu","Yiwen",""],["Demarne","Mathieu",""],["Deng","Kai",""],["Wang","Wenjing",""],["Sahoo","Nutan",""],["Vermareddy","Divya",""],["Lerner","Hannah",""],["Lu","Yunlei",""],["Bararia","Swati",""],["Bhavan","Anjali",""],["Zhang","William",""],["Li","Xia",""],["Lin","Katherine",""],["Cilimdzic","Miso",""],["Krishnan","Subru",""]],"versions":[{"version":"v1","created":"Sun, 8 Dec 2024 23:00:06 GMT"}],"updateDate":"2024-12-10","timestamp":1733698806000,"abstract":"  Software engineers frequently grapple with the challenge of accessing\ndisparate documentation and telemetry data, including Troubleshooting Guides\n(TSGs), incident reports, code repositories, and various internal tools\ndeveloped by multiple stakeholders. While on-call duties are inevitable,\nincident resolution becomes even more daunting due to the obscurity of legacy\nsources and the pressures of strict time constraints. To enhance the efficiency\nof on-call engineers (OCEs) and streamline their daily workflows, we introduced\nDECO -- a comprehensive framework for developing, deploying, and managing\nenterprise-grade chatbots tailored to improve productivity in engineering\nroutines. This paper details the design and implementation of the DECO\nframework, emphasizing its innovative NL2SearchQuery functionality and a\nhierarchical planner. These features support efficient and customized\nretrieval-augmented-generation (RAG) algorithms that not only extract relevant\ninformation from diverse sources but also select the most pertinent toolkits in\nresponse to user queries. This enables the addressing of complex technical\nquestions and provides seamless, automated access to internal resources.\nAdditionally, DECO incorporates a robust mechanism for converting unstructured\nincident logs into user-friendly, structured guides, effectively bridging the\ndocumentation gap. Feedback from users underscores DECO's pivotal role in\nsimplifying complex engineering tasks, accelerating incident resolution, and\nbolstering organizational productivity. Since its launch in September 2023,\nDECO has demonstrated its effectiveness through extensive engagement, with tens\nof thousands of interactions from hundreds of active users across multiple\norganizations within the company.\n","subjects":["Computer Science/Software Engineering","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"F-qduEYgWTphvEbS8WR4zuY3tcQjMevXcefKPpt266E","pdfSize":"2496084"}