{
  "id": "2412.09255",
  "title": "Implementation of Light Diagnostics for Wakefields at AWAKE",
  "authors": "Jan Mezger, Michele Bergamaschi, Lucas Ranc, Alban Sublet, Jan Pucek,\n  Marlene Turner, Arthur Clairembaud, Patric Muggli",
  "authorsParsed": [
    [
      "Mezger",
      "Jan",
      ""
    ],
    [
      "Bergamaschi",
      "Michele",
      ""
    ],
    [
      "Ranc",
      "Lucas",
      ""
    ],
    [
      "Sublet",
      "Alban",
      ""
    ],
    [
      "Pucek",
      "Jan",
      ""
    ],
    [
      "Turner",
      "Marlene",
      ""
    ],
    [
      "Clairembaud",
      "Arthur",
      ""
    ],
    [
      "Muggli",
      "Patric",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 13:13:49 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1734009229000,
  "abstract": "  We describe the implementation of light diagnostics for studying the\nself-modulation instability of a long relativistic proton bunch in a 10m-long\nplasma. The wakefields driven by the proton bunch dissipate their energy in the\nsurrounding plasma. The amount of light emitted as atomic line radiation is\nrelated to the amount of energy dissipated in the plasma. We describe the setup\nand calibration of the light diagnostics, configured for a discharge plasma\nsource and a vapor plasma source. For both sources, we analyze measurements of\nthe light from the plasma only (no proton bunch). We show that with the vapor\nplasma source, the light signal is proportional to the energy deposited in the\nvapor/plasma by the ionizing laser pulse. We use this dependency to obtain the\nparameters of an imposed plasma density step. This dependency also forms the\nbasis for ongoing studies, focused on investigating the wakefield evolution\nalong the plasma.\n",
  "subjects": [
    "Physics/Plasma Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "DeoWj158XiuskPKDRuiKgf_I5Nm1PM9rZfwRfTug9rc",
  "pdfSize": "2301433"
}