{"id":"2412.17576","title":"DC-operated Josephson junction arrays as a cryogenic on-chip microwave\n  measurement platform","authors":"Senne Vervoort, Lukas Nulens, Davi A. D. Chaves, Heleen Dausy, Stijn\n  Reniers, Mohamed Abouelela, Ivo P. C. Cools, Alejandro V. Silhanek, Margriet\n  J. Van Bael, Bart Raes, Joris Van de Vondel","authorsParsed":[["Vervoort","Senne",""],["Nulens","Lukas",""],["Chaves","Davi A. D.",""],["Dausy","Heleen",""],["Reniers","Stijn",""],["Abouelela","Mohamed",""],["Cools","Ivo P. C.",""],["Silhanek","Alejandro V.",""],["Van Bael","Margriet J.",""],["Raes","Bart",""],["Van de Vondel","Joris",""]],"versions":[{"version":"v1","created":"Mon, 23 Dec 2024 13:49:56 GMT"}],"updateDate":"2024-12-24","timestamp":1734961796000,"abstract":"  Providing radio frequency (RF) signals to circuits working in cryogenic\nconditions requires bulky and expensive transmission cabling interfacing\nspecialized RF electronics anchored at room temperature. Superconducting\nJosephson junction arrays (JJAs) can change this paradigm by placing the RF\nsource and detector inside the chip. In this work, we demonstrate that\nDC-biased JJAs can emit signals in the C-band frequency spectrum and beyond. We\nfabricate reproducible JJAs comprised of amorphous MoGe or NbTiN\nsuperconducting islands and metallic Au weak links. Temperature, magnetic\nfields, applied currents, and device design are explored to control the\noperation of the RF sources, while we also identify important features that\naffect the ideal source behavior. Combined with the proven ability of these\nJJAs to detect microwave radiation, these sources allow us to propose a fully\nDC-operated cryogenic on-chip measurement platform that is a viable alternative\nto the high-frequency circuitry currently required for several quantum\napplications.\n","subjects":["Condensed Matter/Superconductivity"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"yIN20KIn-6mhcav9cPAvq7GK9L1jvY_wVbvyox1LMxg","pdfSize":"4821357"}