{
  "id": "2412.20022",
  "title": "Timescales of Solar System Formation Based on Al-Ti Isotope Correlation\n  by Supernova Ejecta",
  "authors": "Tsuyoshi Iizuka, Yuki Hibiya, Satoshi Yoshihara, Takehito Hayakawa",
  "authorsParsed": [
    [
      "Iizuka",
      "Tsuyoshi",
      ""
    ],
    [
      "Hibiya",
      "Yuki",
      ""
    ],
    [
      "Yoshihara",
      "Satoshi",
      ""
    ],
    [
      "Hayakawa",
      "Takehito",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 28 Dec 2024 04:54:16 GMT"
    }
  ],
  "updateDate": "2025-01-07",
  "timestamp": 1735361656000,
  "abstract": "  The radioactive decay of short-lived 26Al to 26Mg has been used to estimate\nthe timescales over which 26Al was produced in a nearby star and the protosolar\ndisk evolved. The chronology commonly assumes that 26Al was uniformly\ndistributed in the protosolar disk; however, this assumption is challenged by\nthe discordance between the timescales defined by the Al-Mg and assumption-free\nPb-Pb chronometers. We find that the 26Al heterogeneity is correlated with the\nnucleosynthetic stable Ti isotope variation, which can be ascribed to the\nnon-uniform distribution of ejecta from a core-collapse supernova in the disk.\nWe use the Al-Ti isotope correlation to calibrate variable 26Al abundances in\nAl-Mg dating of early solar system processes. The calibrated Al-Mg chronometer\nindicates a >1 Myr gap between parent body accretion ages of carbonaceous and\nnon-carbonaceous chondrites. We further use the Al-Ti isotope correlation to\nconstrain the timing and location of the supernova explosion, indicating that\nthe explosion occurred at 20-30 pc from the protosolar cloud, 0.94 +0.25/-0.21\nMyr before the formation of the oldest solar system solids. Our results imply\nthat the Sun was born in association with a ~25 solar mass star.\n",
  "subjects": [
    "Astrophysics/Earth and Planetary Astrophysics",
    "Astrophysics/Solar and Stellar Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "QFEHlcdnBxbVpB9v8LsM8NOYcx8G6C5d-p7_YpJWJCI",
  "pdfSize": "2783827"
}