{
  "id": "2412.03082",
  "title": "Spin polarization driven by molecular vibrations leads to\n  enantioselectivity in chiral molecules",
  "authors": "Shinji Miwa, Tatsuya Yamamoto, Takashi Nagata, Shoya Sakamoto, Kenta\n  Kimura, Masanobu Shiga, Weiguang Gao, Hiroshi M. Yamamoto, Keiichi Inoue,\n  Taishi Takenobu, Takayuki Nozaki and Tatsuhiko Ohto",
  "authorsParsed": [
    [
      "Miwa",
      "Shinji",
      ""
    ],
    [
      "Yamamoto",
      "Tatsuya",
      ""
    ],
    [
      "Nagata",
      "Takashi",
      ""
    ],
    [
      "Sakamoto",
      "Shoya",
      ""
    ],
    [
      "Kimura",
      "Kenta",
      ""
    ],
    [
      "Shiga",
      "Masanobu",
      ""
    ],
    [
      "Gao",
      "Weiguang",
      ""
    ],
    [
      "Yamamoto",
      "Hiroshi M.",
      ""
    ],
    [
      "Inoue",
      "Keiichi",
      ""
    ],
    [
      "Takenobu",
      "Taishi",
      ""
    ],
    [
      "Nozaki",
      "Takayuki",
      ""
    ],
    [
      "Ohto",
      "Tatsuhiko",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 07:17:15 GMT"
    }
  ],
  "updateDate": "2024-12-05",
  "timestamp": 1733296635000,
  "abstract": "  Chirality pervades multiple scientific domains-physics, chemistry, biology,\nand astronomy-and profoundly influences their foundational principles.\nRecently, the chirality-induced spin selectivity (CISS) phenomenon has captured\nsignificant attention in physical chemistry due to its potential applications\nand intriguing underlying physics. Despite its prominence, the microscopic\nmechanisms of CISS remain hotly debated, hindering practical applications and\nfurther theoretical advancements. Here we challenge the established view that\nattributes CISS-related phenomena to current-induced spin polarization and\nelectron transport across interfaces. We propose that molecular vibrations in\nchiral molecules primarily drive spin polarization, thereby governing CISS.\nEmploying an electrochemical cell paired with a precisely engineered magnetic\nmultilayer, we demonstrate that the magnetic interactions akin to interlayer\nexchange coupling are crucial for CISS. Our theoretical study suggests that\nmolecular vibrations facilitate chirality-dependent spin polarization, which\nplays a pivotal role in CISS-related phenomena such as magnetoresistance and\nenantiomer separation using ferromagnets. These findings necessitate a paradigm\nshift in the design and analysis of systems in various scientific fields,\nextending the role of spin dynamics from traditional areas such as solid-state\nphysics to chemical reactions, molecular biology, and even drug discovery.\n",
  "subjects": [
    "Condensed Matter/Materials Science",
    "Condensed Matter/Mesoscale and Nanoscale Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "KePI9dqN4PtUSacY6ElLcv0eywywn7f8-EQS1NPzfhI",
  "pdfSize": "983212"
}