{
  "id": "2412.21158",
  "title": "Measuring Quantum Discord at the LHC",
  "authors": "Tao Han, Matthew Low, Navin McGinnis, Shufang Su",
  "authorsParsed": [
    [
      "Han",
      "Tao",
      ""
    ],
    [
      "Low",
      "Matthew",
      ""
    ],
    [
      "McGinnis",
      "Navin",
      ""
    ],
    [
      "Su",
      "Shufang",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 30 Dec 2024 18:36:43 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735583803000,
  "abstract": "  There has been an increasing interest in exploring quantities associated with\nquantum information at colliders. We perform a detailed analysis describing how\nto measure the quantum discord in the top anti-top quantum state at the Large\nHadron Collider (LHC). While for pure states, quantum discord, entanglement,\nand Bell nonlocality all probe the same correlations, for mixed states they\nprobe different aspects of quantum correlations. The quantum discord, in\nparticular, is interesting because it aims to encapsulate all correlations\nbetween systems that cannot have a classical origin. We employ two\ncomplementary approaches for the study of the top anti-top system, namely the\ndecay method and the kinematic method. We highlight subtleties associated with\nmeasuring discord for reconstructed quantum states at colliders. Usually\nquantum discord is difficult to compute due to an extremization that must be\nperformed. We show, however, that for the $t\\bar{t}$ system this extremization\ncan be performed analytically and we provide closed-form formulas for the\nquantum discord. We demonstrate that at the high luminosity LHC, discord is\nprojected to be measurable with a precision of approximately 5% using the decay\nmethod and sub-percent levels using the kinematic method. Even with current LHC\ndatasets, discord can be measured with 1-2% precision with the kinematic\nmethod. By systematically investigating quantum discord for the first time\nthrough a detailed collider analysis, this work expands the toolkit for quantum\ninformation studies in particle physics and lays the groundwork for deeper\ninsights into the quantum properties in high-energy collisions.\n",
  "subjects": [
    "Physics/High Energy Physics - Phenomenology"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "W6Dxs8iKknGISI_LP9B1tnDhLPaiBmFDtsRCZhNBaT0",
  "pdfSize": "9361938"
}