{"id":"2412.09261","title":"Single-View Graph Contrastive Learning with Soft Neighborhood Awareness","authors":"Qingqiang Sun, Chaoqi Chen, Ziyue Qiao, Xubin Zheng, Kai Wang","authorsParsed":[["Sun","Qingqiang",""],["Chen","Chaoqi",""],["Qiao","Ziyue",""],["Zheng","Xubin",""],["Wang","Kai",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 13:20:23 GMT"}],"updateDate":"2024-12-13","timestamp":1734009623000,"abstract":"  Most graph contrastive learning (GCL) methods heavily rely on cross-view\ncontrast, thus facing several concomitant challenges, such as the complexity of\ndesigning effective augmentations, the potential for information loss between\nviews, and increased computational costs. To mitigate reliance on cross-view\ncontrasts, we propose \\ttt{SIGNA}, a novel single-view graph contrastive\nlearning framework. Regarding the inconsistency between structural connection\nand semantic similarity of neighborhoods, we resort to soft neighborhood\nawareness for GCL. Specifically, we leverage dropout to obtain\nstructurally-related yet randomly-noised embedding pairs for neighbors, which\nserve as potential positive samples. At each epoch, the role of partial\nneighbors is switched from positive to negative, leading to probabilistic\nneighborhood contrastive learning effect. Furthermore, we propose a normalized\nJensen-Shannon divergence estimator for a better effect of contrastive\nlearning. Surprisingly, experiments on diverse node-level tasks demonstrate\nthat our simple single-view GCL framework consistently outperforms existing\nmethods by margins of up to 21.74% (PPI). In particular, with soft neighborhood\nawareness, SIGNA can adopt MLPs instead of complicated GCNs as the encoder to\ngenerate representations in transductive learning tasks, thus speeding up its\ninference process by 109 times to 331 times. The source code is available at\nhttps://github.com/sunisfighting/SIGNA.\n","subjects":["Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"sCiyV3U-u2FrMJghXFnU3-Yaz1gc3uWNm_PpWDJ3k-U","pdfSize":"1376811"}