{
  "id": "2412.08869",
  "title": "Beyond Reweighting: On the Predictive Role of Covariate Shift in Effect\n  Generalization",
  "authors": "Ying Jin, Naoki Egami, Dominik Rothenh\\\"ausler",
  "authorsParsed": [
    [
      "Jin",
      "Ying",
      ""
    ],
    [
      "Egami",
      "Naoki",
      ""
    ],
    [
      "Rothenhäusler",
      "Dominik",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 02:06:27 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1733969187000,
  "abstract": "  Many existing approaches to generalizing statistical inference amidst\ndistribution shift operate under the covariate shift assumption, which posits\nthat the conditional distribution of unobserved variables given observable ones\nis invariant across populations. However, recent empirical investigations have\ndemonstrated that adjusting for shift in observed variables (covariate shift)\nis often insufficient for generalization. In other words, covariate shift does\nnot typically ``explain away'' the distribution shift between settings. As\nsuch, addressing the unknown yet non-negligible shift in the unobserved\nvariables given observed ones (conditional shift) is crucial for generalizable\ninference.\n  In this paper, we present a series of empirical evidence from two large-scale\nmulti-site replication studies to support a new role of covariate shift in\n``predicting'' the strength of the unknown conditional shift. Analyzing 680\nstudies across 65 sites, we find that even though the conditional shift is\nnon-negligible, its strength can often be bounded by that of the observable\ncovariate shift. However, this pattern only emerges when the two sources of\nshifts are quantified by our proposed standardized, ``pivotal'' measures. We\nthen interpret this phenomenon by connecting it to similar patterns that can be\ntheoretically derived from a random distribution shift model. Finally, we\ndemonstrate that exploiting the predictive role of covariate shift leads to\nreliable and efficient uncertainty quantification for target estimates in\ngeneralization tasks with partially observed data. Overall, our empirical and\ntheoretical analyses suggest a new way to approach the problem of\ndistributional shift, generalizability, and external validity.\n",
  "subjects": [
    "Statistics/Applications",
    "Computer Science/Machine Learning",
    "Statistics/Methodology"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "O2L2_T5wk-gzw4aVOze-HpeS6upqd49j6864Hmf1PG0",
  "pdfSize": "5370510"
}