{"id":"2412.04070","title":"Radio pulsar population synthesis with consistent flux measurements\n  using simulation-based inference","authors":"Celsa Pardo Araujo, Michele Ronchi, Vanessa Graber and Nanda Rea","authorsParsed":[["Araujo","Celsa Pardo",""],["Ronchi","Michele",""],["Graber","Vanessa",""],["Rea","Nanda",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 11:06:12 GMT"}],"updateDate":"2024-12-06","timestamp":1733396772000,"abstract":"  The properties of the entire neutron star population can be inferred by\nmodeling their evolution, from birth to the present, through pulsar population\nsynthesis. This involves simulating a mock population, applying observational\nfilters, and comparing the resulting sources to the limited subset of detected\npulsars. We specifically focus on the magneto-rotational properties of Galactic\nisolated neutron stars and provide new insights into the intrinsic radio\nluminosity law by combining pulsar population synthesis with a simulation-based\ninference (SBI) technique called truncated sequential neural posterior\nestimation (TSNPE). We employ TSNPE to train a neural density estimator on\nsimulated pulsar populations to approximate the posterior distribution of the\nunderlying parameters. This technique efficiently explores the parameter space\nby concentrating on regions that are most likely to match the observed data\nthus allowing a significant reduction in training dataset size. We demonstrate\nthe efficiency of TSNPE over standard neural posterior estimation (NPE),\nachieving robust inferences of magneto-rotational parameters consistent with\nprevious studies using only around 4% of the simulations required by NPE\napproaches. Moreover, for the first time, we incorporate data from the Thousand\nPulsar Array (TPA) program on MeerKAT, the largest unified sample of neutron\nstars with consistent fluxes measurement to date, to help constrain the stars'\nintrinsic radio luminosity. We find that adding flux information as an input to\nthe neural network largely improves the constraints on the pulsars' radio\nluminosity, as well as improving the estimates on other input parameters.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"J4gTopWJRKPagIjVoAeZMomMwmx-z32ev8PwSoXKR-k","pdfSize":"6311195"}