{"id":"2412.05582","title":"DM-SBL: Channel Estimation under Structured Interference","authors":"Yifan Wang, Chengjie Yu, Jiang Zhu, Fangyong Wang, Xingbin Tu, Yan Wei\n  and Fengzhong Qu","authorsParsed":[["Wang","Yifan",""],["Yu","Chengjie",""],["Zhu","Jiang",""],["Wang","Fangyong",""],["Tu","Xingbin",""],["Wei","Yan",""],["Qu","Fengzhong",""]],"versions":[{"version":"v1","created":"Sat, 7 Dec 2024 08:26:00 GMT"}],"updateDate":"2024-12-10","timestamp":1733559960000,"abstract":"  Channel estimation is a fundamental task in communication systems and is\ncritical for effective demodulation. While most works deal with a simple\nscenario where the measurements are corrupted by the additive white Gaussian\nnoise (AWGN), this work addresses the more challenging scenario where both AWGN\nand structured interference coexist. Such conditions arise, for example, when a\nsonar/radar transmitter and a communication receiver operate simultaneously\nwithin the same bandwidth. To ensure accurate channel estimation in these\nscenarios, the sparsity of the channel in the delay domain and the complicate\nstructure of the interference are jointly exploited. Firstly, the score of the\nstructured interference is learned via a neural network based on the diffusion\nmodel (DM), while the channel prior is modeled as a Gaussian distribution, with\nits variance controlling channel sparsity, similar to the setup of the sparse\nBayesian learning (SBL). Then, two efficient posterior sampling methods are\nproposed to jointly estimate the sparse channel and the interference. Nuisance\nparameters, such as the variance of the prior are estimated via the expectation\nmaximization (EM) algorithm. The proposed method is termed as DM based SBL\n(DM-SBL). Numerical simulations demonstrate that DM-SBL significantly\noutperforms conventional approaches that deal with the AWGN scenario,\nparticularly under low signal-to-interference ratio (SIR) conditions. Beyond\nchannel estimation, DM-SBL also shows promise for addressing other linear\ninverse problems involving structured interference.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computer Science/Information Theory","Computer Science/Machine Learning","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"91IXmlCZZK3c9NAGawBjBjTH-C4-cXZsffU8r_wDExM","pdfSize":"1814325"}