{
  "id": "2412.03064",
  "title": "A Survey of Wireless Sensing Security from a Role-Based View: Victim,\n  Weapon, and Shield",
  "authors": "Ruixu Geng, Jianyang Wang, Yuqin Yuan, Fengquan Zhan, Tianyu Zhang,\n  Rui Zhang, Pengcheng Huang, Dongheng Zhang, Jinbo Chen, Yang Hu, Yan Chen",
  "authorsParsed": [
    [
      "Geng",
      "Ruixu",
      ""
    ],
    [
      "Wang",
      "Jianyang",
      ""
    ],
    [
      "Yuan",
      "Yuqin",
      ""
    ],
    [
      "Zhan",
      "Fengquan",
      ""
    ],
    [
      "Zhang",
      "Tianyu",
      ""
    ],
    [
      "Zhang",
      "Rui",
      ""
    ],
    [
      "Huang",
      "Pengcheng",
      ""
    ],
    [
      "Zhang",
      "Dongheng",
      ""
    ],
    [
      "Chen",
      "Jinbo",
      ""
    ],
    [
      "Hu",
      "Yang",
      ""
    ],
    [
      "Chen",
      "Yan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 06:34:36 GMT"
    }
  ],
  "updateDate": "2024-12-05",
  "timestamp": 1733294076000,
  "abstract": "  Wireless sensing technology has become prevalent in healthcare, smart homes,\nand autonomous driving due to its non-contact operation, penetration\ncapabilities, and cost-effectiveness. As its applications expand, the\ntechnology faces mounting security challenges: sensing systems can be attack\ntargets, signals can be weaponized, or signals can function as security\nshields. Despite these security concerns significantly impacting the\ntechnology's development, a systematic review remains lacking. This paper\npresents the first comprehensive survey of wireless sensing security through a\nrole-based perspective. Analyzing over 200 publications from 2020-2024, we\npropose a novel classification framework that systematically categorizes\nexisting research into three main classes: (1) wireless systems as victims of\nattacks, (2) wireless signals as weapons for attacks, and (3) wireless signals\nas shields for security applications. This role-based classification method is\nnot only intuitive and easy to understand, but also reflects the essential\nconnection between wireless signals and security issues. Through systematic\nliterature review and quantitative analysis, this paper outlines a panoramic\nview of wireless sensing security, revealing key technological trends and\ninnovation opportunities, thereby helping to promote the development of this\nfield. Project page:\n\\url{https://github.com/Intelligent-Perception-Lab/Awesome-WS-Security}.\n",
  "subjects": [
    "Computer Science/Human-Computer Interaction",
    "Computer Science/Cryptography and Security"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "xVhCfDy6km2Z4NJzeVquaPu-XICHZgUd81O_MvOY_Z0",
  "pdfSize": "14483130"
}