{"id":"2412.04114","title":"Thermal and RGB Images Work Better Together in Wind Turbine Damage\n  Detection","authors":"Serhii Svystun, Oleksandr Melnychenko, Pavlo Radiuk, Oleg Savenko,\n  Anatoliy Sachenko and Andrii Lysyi","authorsParsed":[["Svystun","Serhii",""],["Melnychenko","Oleksandr",""],["Radiuk","Pavlo",""],["Savenko","Oleg",""],["Sachenko","Anatoliy",""],["Lysyi","Andrii",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 12:32:45 GMT"}],"updateDate":"2024-12-06","timestamp":1733401965000,"abstract":"  The inspection of wind turbine blades (WTBs) is crucial for ensuring their\nstructural integrity and operational efficiency. Traditional inspection methods\ncan be dangerous and inefficient, prompting the use of unmanned aerial vehicles\n(UAVs) that access hard-to-reach areas and capture high-resolution imagery. In\nthis study, we address the challenge of enhancing defect detection on WTBs by\nintegrating thermal and RGB images obtained from UAVs. We propose a\nmultispectral image composition method that combines thermal and RGB imagery\nthrough spatial coordinate transformation, key point detection, binary\ndescriptor creation, and weighted image overlay. Using a benchmark dataset of\nWTB images annotated for defects, we evaluated several state-of-the-art object\ndetection models. Our results show that composite images significantly improve\ndefect detection efficiency. Specifically, the YOLOv8 model's accuracy\nincreased from 91% to 95%, precision from 89% to 94%, recall from 85% to 92%,\nand F1-score from 87% to 93%. The number of false positives decreased from 6 to\n3, and missed defects reduced from 5 to 2. These findings demonstrate that\nintegrating thermal and RGB imagery enhances defect detection on WTBs,\ncontributing to improved maintenance and reliability.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Artificial Intelligence","Computer Science/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Ju7t0EIsHmN7qz2GrOg6wu5lHXJdRs1CIM9NYIOiC7Y","pdfSize":"2030937"}