{"id":"2412.02756","title":"Nucleosynthesis Conditions in Outflows of White Dwarfs Collapsing to\n  Neutron Stars","authors":"Eirini Batziou (1,2), Robert Glas (1), H.-Thomas Janka (1), Jakob\n  Ehring (3,4,1), Ernazar Abdikamalov (5), Oliver Just (6,7) ((1) MPI\n  Astrophysics, Garching, Germany, (2) TUM School of Natural Sciences,\n  Garching, Germany, (3) Academia Sinica, Taipei City, Taiwan, (4) MPI Physics,\n  Garching, Germany, (5) Nazarbayev University, Astana, Kazakhstan, (6) GSI,\n  Darmstadt, Germany, (7) RIKEN, Saitama, Japan)","authorsParsed":[["Batziou","Eirini",""],["Glas","Robert",""],["Janka","H. -Thomas",""],["Ehring","Jakob",""],["Abdikamalov","Ernazar",""],["Just","Oliver",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 19:00:10 GMT"}],"updateDate":"2024-12-05","timestamp":1733252410000,"abstract":"  Accretion-induced collapse (AIC) or merger-induced collapse (MIC) of white\ndwarfs (WDs) in binary systems is an interesting path to neutron star (NS) and\nmagnetar formation, alternative to stellar core collapse and NS mergers. Such\nevents could add a population of compact remnants in globular clusters, they\nare expected to produce yet unidentified electromagnetic transients including\ngamma-ray and radio bursts, and to act as sources of trans-iron elements,\nneutrinos, and gravitational waves. Here we present the first long-term (>5 s\npost bounce) hydrodynamical simulations in axi-symmetry (2D), using energy- and\nvelocity-dependent three-flavor neutrino transport based on a two-moment\nscheme. Our set of six models includes initial WD configurations for different\nmasses, central densities, rotation rates, and angular momentum profiles. Our\nsimulations demonstrate that rotation plays a crucial role for the\nproto-neutron star (PNS) evolution and ejecta properties. We find early\nneutron-rich ejecta and an increasingly proton-rich neutrino-driven wind at\nlater times in a non-rotating model, in agreement with electron-capture\nsupernova models. In contrast to that and different from previous results, our\nrotating models eject proton-rich material initially and increasingly more\nneutron-rich matter as time advances, because an extended accretion torus forms\naround the PNS and feeds neutrino-driven bipolar outflows for many seconds. AIC\nand MIC events are thus potential sites of r-process element production, which\nmay imply constraints on their occurrence rates. Finally, our simulations\nneglect the effects of triaxial deformation and magnetic fields, serving as a\ntemporary benchmark for more comprehensive future studies.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"sG4nFvKkDKuha2PtLDFOXLEPS7nmIKwTN0EZ0K1yHlo","pdfSize":"6053243"}