{"id":"2412.16339","title":"Deliberative Alignment: Reasoning Enables Safer Language Models","authors":"Melody Y. Guan, Manas Joglekar, Eric Wallace, Saachi Jain, Boaz Barak,\n  Alec Helyar, Rachel Dias, Andrea Vallone, Hongyu Ren, Jason Wei, Hyung Won\n  Chung, Sam Toyer, Johannes Heidecke, Alex Beutel, Amelia Glaese","authorsParsed":[["Guan","Melody Y.",""],["Joglekar","Manas",""],["Wallace","Eric",""],["Jain","Saachi",""],["Barak","Boaz",""],["Helyar","Alec",""],["Dias","Rachel",""],["Vallone","Andrea",""],["Ren","Hongyu",""],["Wei","Jason",""],["Chung","Hyung Won",""],["Toyer","Sam",""],["Heidecke","Johannes",""],["Beutel","Alex",""],["Glaese","Amelia",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 21:00:11 GMT"},{"version":"v2","created":"Wed, 8 Jan 2025 20:11:59 GMT"}],"updateDate":"2025-01-10","timestamp":1734728411000,"abstract":"  As large-scale language models increasingly impact safety-critical domains,\nensuring their reliable adherence to well-defined principles remains a\nfundamental challenge. We introduce Deliberative Alignment, a new paradigm that\ndirectly teaches the model safety specifications and trains it to explicitly\nrecall and accurately reason over the specifications before answering. We used\nthis approach to align OpenAI's o-series models, and achieved highly precise\nadherence to OpenAI's safety policies, without requiring human-written\nchain-of-thoughts or answers. Deliberative Alignment pushes the Pareto frontier\nby simultaneously increasing robustness to jailbreaks while decreasing\noverrefusal rates, and also improves out-of-distribution generalization. We\ndemonstrate that reasoning over explicitly specified policies enables more\nscalable, trustworthy, and interpretable alignment.\n","subjects":["Computer Science/Computation and Language","Computer Science/Artificial Intelligence","Computer Science/Computers and Society","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"zEFieOoC3ZILqaAnZAaRZic45sdM3JdC7CwPakwRN2o","pdfSize":"2439335"}