{"id":"2412.03916","title":"Terahertz channel power and BER performance in rain","authors":"Yuheng Song, Jiayuan Cui, Guohao Liu, Jiabiao Zhao, Mingxia Zhang,\n  Jiacheng Liu, Da Li, Peian Li, Chen Yao, Fei Song, Hong Liang, Jianjun Ma","authorsParsed":[["Song","Yuheng",""],["Cui","Jiayuan",""],["Liu","Guohao",""],["Zhao","Jiabiao",""],["Zhang","Mingxia",""],["Liu","Jiacheng",""],["Li","Da",""],["Li","Peian",""],["Yao","Chen",""],["Song","Fei",""],["Liang","Hong",""],["Ma","Jianjun",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 06:35:15 GMT"},{"version":"v2","created":"Sun, 23 Feb 2025 01:07:02 GMT"}],"updateDate":"2025-02-25","timestamp":1733380515000,"abstract":"  Terahertz (THz) communications have emerged as a promising technology for 6G\nnetworks due to their potential for achieving terabit-per-second data rates.\nHowever, the impact of rainfall on THz channel characteristics remains\nincompletely understood, particularly regarding power attenuation mechanisms\nand bit error rate (BER) performance. This article presents a systematic\nmeasurement-based and theoretical investigation of line-of-sight (LoS) THz\nchannel behavior under rainfall conditions, methodically examining both power\nattenuation mechanisms and bit error rate (BER) performance. Our experimental\ncampaign, conducted at frequencies of 220-230 GHz over a 54-meter outdoor\nchannel, is complemented by analytical frameworks incorporating ITU-R and Mie\nscattering models. The study reveals that while rain induces significant power\nattenuation, multipath scattering effects remain minimal, with Rician K-factors\nmaintaining high values. Notably, we observe substantial variations in power\nloss under constant rain rates, attributed to dynamic changes in raindrop size\ndistribution. Comparative analysis demonstrates superior BER performance of\nQuadrature Amplitude Modulation (QAM) in rainfall conditions, while revealing\nincreased environmental sensitivity at higher frequencies. These findings\nunderscore the necessity for adaptive modulation schemes and strategic\nfrequency planning in future THz communication systems.\n","subjects":["Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"bxZkRekXXP9D9DcPn-qhx2U7N8Do6tsUyuMoq6XjZWw","pdfSize":"2886204"}