{
  "id": "2412.14785",
  "title": "Single-mode laser guiding in non-parabolic plasma channels for\n  high-energy electron acceleration",
  "authors": "Zsolt L\\'ecz, Szil\\'ard Majorosi and Nasr A. M. Hafz",
  "authorsParsed": [
    [
      "Lécz",
      "Zsolt",
      ""
    ],
    [
      "Majorosi",
      "Szilárd",
      ""
    ],
    [
      "Hafz",
      "Nasr A. M.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 12:20:29 GMT"
    },
    {
      "version": "v2",
      "created": "Wed, 5 Feb 2025 14:44:58 GMT"
    }
  ],
  "updateDate": "2025-02-06",
  "timestamp": 1734610829000,
  "abstract": "  The discovery of laser wakefield acceleration in gaseous plasma was a major\nmilestone that could lead to a significant reduction of size and cost of large\nelectron accelerators. For higher-energy laser-driven electron acceleration\nguiding plasma channels were proposed, which are matched to the laser pulse\nparameters. For guiding a Gaussian beam, a parabolic density profile is needed,\nwhich is difficult to realize experimentally. The realistic channel profiles\ncan be described by higher order polynomial functions which are not optimal for\nguiding due to the development of undesired distortions in the laser intensity\nenvelope. However, here we show that for non-parabolic plasma channels\nwell-defined matching conditions exist, which we call mode matching. This leads\nto the guiding of the fundamental mode only in the acceleration regime, where\nthe plasma electron density is modulated by the high-intensity laser pulse. In\nthis way we eliminate two deteriorating factors of laser wakefield\nacceleration, namely the mode dispersion and energy leakage. We apply this new\nmatching condition for single-mode guiding in quasi-3D simulations to show that\n10 GeV energies can be reached in a distance of less than 15 cm.\n",
  "subjects": [
    "Physics/Plasma Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "6olGaGlC56Ff_T0wT6XepGFUxXXPCns9U-t7j-XEn8I",
  "pdfSize": "4996857"
}