{
  "id": "2412.11574",
  "title": "PyPotteryLens: An Open-Source Deep Learning Framework for Automated\n  Digitisation of Archaeological Pottery Documentation",
  "authors": "Lorenzo Cardarelli",
  "authorsParsed": [
    [
      "Cardarelli",
      "Lorenzo",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 09:01:32 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734339692000,
  "abstract": "  Archaeological pottery documentation and study represents a crucial but\ntime-consuming aspect of archaeology. While recent years have seen advances in\ndigital documentation methods, vast amounts of legacy data remain locked in\ntraditional publications. This paper introduces PyPotteryLens, an open-source\nframework that leverages deep learning to automate the digitisation and\nprocessing of archaeological pottery drawings from published sources. The\nsystem combines state-of-the-art computer vision models (YOLO for instance\nsegmentation and EfficientNetV2 for classification) with an intuitive user\ninterface, making advanced digital methods accessible to archaeologists\nregardless of technical expertise. The framework achieves over 97\\% precision\nand recall in pottery detection and classification tasks, while reducing\nprocessing time by up to 5x to 20x compared to manual methods. Testing across\ndiverse archaeological contexts demonstrates robust generalisation\ncapabilities. Also, the system's modular architecture facilitates extension to\nother archaeological materials, while its standardised output format ensures\nlong-term preservation and reusability of digitised data as well as solid basis\nfor training machine learning algorithms. The software, documentation, and\nexamples are available on GitHub\n(https://github.com/lrncrd/PyPottery/tree/PyPotteryLens).\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "YNzyit5ZX1EL_JzVHwDxRMk7ZP--HYZrvHnX-7C0Qpc",
  "pdfSize": "5435187"
}