{
  "id": "2412.18655",
  "title": "Simple is not Enough: Document-level Text Simplification using\n  Readability and Coherence",
  "authors": "Laura V\\'asquez-Rodr\\'iguez, Nhung T.H. Nguyen, Piotr Przyby{\\l}a,\n  Matthew Shardlow, Sophia Ananiadou",
  "authorsParsed": [
    [
      "Vásquez-Rodríguez",
      "Laura",
      ""
    ],
    [
      "Nguyen",
      "Nhung T. H.",
      ""
    ],
    [
      "Przybyła",
      "Piotr",
      ""
    ],
    [
      "Shardlow",
      "Matthew",
      ""
    ],
    [
      "Ananiadou",
      "Sophia",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 24 Dec 2024 19:05:21 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735067121000,
  "abstract": "  In this paper, we present the SimDoc system, a simplification model\nconsidering simplicity, readability, and discourse aspects, such as coherence.\nIn the past decade, the progress of the Text Simplification (TS) field has been\nmostly shown at a sentence level, rather than considering paragraphs or\ndocuments, a setting from which most TS audiences would benefit. We propose a\nsimplification system that is initially fine-tuned with professionally created\ncorpora. Further, we include multiple objectives during training, considering\nsimplicity, readability, and coherence altogether. Our contributions include\nthe extension of professionally annotated simplification corpora by the\nassociation of existing annotations into (complex text, simple text,\nreadability label) triples to benefit from readability during training. Also,\nwe present a comparative analysis in which we evaluate our proposed models in a\nzero-shot, few-shot, and fine-tuning setting using document-level TS corpora,\ndemonstrating novel methods for simplification. Finally, we show a detailed\nanalysis of outputs, highlighting the difficulties of simplification at a\ndocument level.\n",
  "subjects": [
    "Computer Science/Computation and Language"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "-WbOxLeIDwRI3fFzYb2gpSDUDO6Bt2GsFBX4tN_otUo",
  "pdfSize": "811937"
}