{
  "id": "2412.14830",
  "title": "Rydberg states and new resonant states of the imidogen molecule NH:\n  pathways for nitrogen release",
  "authors": "Raju Ghosh and Binayak Samaddar Choudhuryt and Janos Zsolt Mezei and\n  Ioan F. Schneider and Nicolina Pop and Kalyan Chakrabarti",
  "authorsParsed": [
    [
      "Ghosh",
      "Raju",
      ""
    ],
    [
      "Choudhuryt",
      "Binayak Samaddar",
      ""
    ],
    [
      "Mezei",
      "Janos Zsolt",
      ""
    ],
    [
      "Schneider",
      "Ioan F.",
      ""
    ],
    [
      "Pop",
      "Nicolina",
      ""
    ],
    [
      "Chakrabarti",
      "Kalyan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 13:19:42 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734614382000,
  "abstract": "  Neutral resonant states of molecules play a very important role in the\ndissociation dynamics and other electronic processes that occur via\nintermediate capture into these states. With the goal of identifying resonant\nstates, and their corresponding widths, of the imidogen molecule NH as a\nfunction of internuclear distance, we have performed detailed R-matrix\ncalculations on the e + NH+ system. In a previous work, we had identified bound\nstates of NH and Feshbach resonances in the e + NH+ system at a single\ngeometry, namely the NH+ equilibrium Re = 2.0205 a0 . Here we present a much\nmore detailed work by repeating the calculation on over 60 internuclear\ndistances to obtain the corresponding potential energy curves. The bound states\nfor nine symmetries have been detailed many of which, particularly the singlet\nstates, were never studied before. Several resonant states of different\nsymmetries, which were unknown until now, have been systematically identified\nand their widths calculated in the present work, which proved much more\nchallenging due to presence of many avoided crossings. It is hoped that the\nbound and the new resonant states obtained here will open up other molecular\ndynamics studies, since for several dissociative processes, although\nexperimental data existed for more than a decade, these are still\nuncorroborated due to absence of molecular data, and hence subsequent\ntheoretical calculations.\n",
  "subjects": [
    "Physics/Atomic Physics",
    "Physics/Plasma Physics",
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "3eRQ3doZYf08rGXazfg7bikyXH_C35ON0x8whIV7-5I",
  "pdfSize": "367723"
}