{"id":"2412.10032","title":"Object-Focused Data Selection for Dense Prediction Tasks","authors":"Niclas Popp, Dan Zhang, Jan Hendrik Metzen, Matthias Hein, Lukas\n  Schott","authorsParsed":[["Popp","Niclas",""],["Zhang","Dan",""],["Metzen","Jan Hendrik",""],["Hein","Matthias",""],["Schott","Lukas",""]],"versions":[{"version":"v1","created":"Fri, 13 Dec 2024 10:47:05 GMT"}],"updateDate":"2024-12-16","timestamp":1734086825000,"abstract":"  Dense prediction tasks such as object detection and segmentation require\nhigh-quality labels at pixel level, which are costly to obtain. Recent advances\nin foundation models have enabled the generation of autolabels, which we find\nto be competitive but not yet sufficient to fully replace human annotations,\nespecially for more complex datasets. Thus, we consider the challenge of\nselecting a representative subset of images for labeling from a large pool of\nunlabeled images under a constrained annotation budget. This task is further\ncomplicated by imbalanced class distributions, as rare classes are often\nunderrepresented in selected subsets. We propose object-focused data selection\n(OFDS) which leverages object-level representations to ensure that the selected\nimage subsets semantically cover the target classes, including rare ones. We\nvalidate OFDS on PASCAL VOC and Cityscapes for object detection and semantic\nsegmentation tasks. Our experiments demonstrate that prior methods which employ\nimage-level representations fail to consistently outperform random selection.\nIn contrast, OFDS consistently achieves state-of-the-art performance with\nsubstantial improvements over all baselines in scenarios with imbalanced class\ndistributions. Moreover, we demonstrate that pre-training with autolabels on\nthe full datasets before fine-tuning on human-labeled subsets selected by OFDS\nfurther enhances the final performance.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"rcqW_HcgoJOHzU9B2ZvHIku2B0vOitefhe3uvL7V8Bo","pdfSize":"14244217"}