{"id":"2412.02833","title":"Economic Hubs and the Domination of Inter-Regional Ties in World City\n  Networks","authors":"Mohammad Yousuf Mehmood and Syed Junaid Haqqani and Faraz Zaidi and\n  Celine Rozenblat","authorsParsed":[["Mehmood","Mohammad Yousuf",""],["Haqqani","Syed Junaid",""],["Zaidi","Faraz",""],["Rozenblat","Celine",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 20:56:32 GMT"}],"updateDate":"2024-12-05","timestamp":1733259392000,"abstract":"  Cities are widely considered the lifeblood of a nations economy housing the\nbulk of industries, commercial and trade activities, and employment\nopportunities. Within this economic context, multinational corporations play an\nimportant role in this economic development of cities in particular, and\nsubsequently the countries and regions they belong to, in general. As\nmultinational companies are spread throughout the world by virtue of\nownership-subsidiary relationship, these ties create complex inter-dependent\nnetworks of cities that shape and define socio-economic status, as well as\nmacro-regional influences impacting the world economy.\n  In this paper, we study these networks of cities formed as a result of ties\nbetween multinational firms. We analyze these networks using intra-regional,\ninter-regional and hybrid ties (conglomerate integration) as spatial motifs\ndefined by geographic delineation of world's economic regions. We attempt to\nunderstand how global cities position themselves in spatial and economic\ngeographies and how their ties promote regional integration along with global\nexpansion for sustainable growth and economic development. We study these\nnetworks over four time periods from 2010 to 2019 and discover interesting\ntrends and patterns. The most significant result is the domination of\ninter-regional motifs representing cross regional ties among cities rather than\nnational and regional integration.\n","subjects":["Physics/Physics and Society","Computer Science/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"XX0AA-ZlxRlw6LQFI0CQkvdLnGr0udqzBUnPujK52e4","pdfSize":"2473721"}