{"id":"2412.11336","title":"Hierarchical Control of State Transitions in Dense Associative Memories","authors":"Anton Grishechkin, Abhirup Mukherjee, Omer Karin","authorsParsed":[["Grishechkin","Anton",""],["Mukherjee","Abhirup",""],["Karin","Omer",""]],"versions":[{"version":"v1","created":"Sun, 15 Dec 2024 23:04:07 GMT"},{"version":"v2","created":"Wed, 8 Jan 2025 14:56:33 GMT"}],"updateDate":"2025-01-09","timestamp":1734303847000,"abstract":"  Dense Associative Memories are dynamical systems that can encode for many\nattractor memory patterns through higher-order interactions. Here we analyze a\ncontinuous form of Dense Associative Memories that emerges in biological and\nengineered settings, including in the gene regulatory networks that control\ncellular identity. The dynamics are governed by the interplay between an\ninverse-temperature-like parameter $\\beta$ and an input field $\\textbf{w}$. The\nparameter $\\beta$ controls the attractor landscape structure: at large $\\beta$,\nmemory patterns are stable attractors, while at lower $\\beta$ values, the\nattractors are associated with progenitor states-weighted combinations of two\nor more memory patterns. We associate progenitor states with self-similarity of\nthe model following a coarse-graining transformation on memory pattern subsets.\nWe use this transformation to propose a hierarchical model for the control of\nthe identity, stability, and basins of attraction of the progenitor states\nwhich facilitates transitions between memory patterns through an annealing-like\nmechanism. We use this framework to explain the dynamical regulation of blood\nformation, demonstrating how robust control of attractor transitions may emerge\nin biological networks and providing a mathematical basis for well-established\nexperimental observations on the hierarchical control of cell identity.\n","subjects":["Quantitative Biology/Cell Behavior","Quantitative Biology/Molecular Networks"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"y6Ex3UXunaBlqB3hj2u5t1NfpPuX0iodp2k1umJl1ks","pdfSize":"3783511"}