{
  "id": "2412.14299",
  "title": "The Multiplex Classification Framework: optimizing multi-label\n  classifiers through problem transformation, ontology engineering, and model\n  ensembling",
  "authors": "Mauro Nievas Offidani, Facundo Roffet, Claudio Augusto Delrieux, Maria\n  Carolina Gonzalez Galtier, Marcos Zarate",
  "authorsParsed": [
    [
      "Offidani",
      "Mauro Nievas",
      ""
    ],
    [
      "Roffet",
      "Facundo",
      ""
    ],
    [
      "Delrieux",
      "Claudio Augusto",
      ""
    ],
    [
      "Galtier",
      "Maria Carolina Gonzalez",
      ""
    ],
    [
      "Zarate",
      "Marcos",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 20:07:27 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734552447000,
  "abstract": "  Classification is a fundamental task in machine learning. While conventional\nmethods-such as binary, multiclass, and multi-label classification-are\neffective for simpler problems, they may not adequately address the\ncomplexities of some real-world scenarios. This paper introduces the Multiplex\nClassification Framework, a novel approach developed to tackle these and\nsimilar challenges through the integration of problem transformation, ontology\nengineering, and model ensembling. The framework offers several advantages,\nincluding adaptability to any number of classes and logical constraints, an\ninnovative method for managing class imbalance, the elimination of confidence\nthreshold selection, and a modular structure. Two experiments were conducted to\ncompare the performance of conventional classification models with the\nMultiplex approach. Our results demonstrate that the Multiplex approach can\nimprove classification performance significantly (up to 10% gain in overall F1\nscore), particularly in classification problems with a large number of classes\nand pronounced class imbalances. However, it also has limitations, as it\nrequires a thorough understanding of the problem domain and some experience\nwith ontology engineering, and it involves training multiple models, which can\nmake the whole process more intricate. Overall, this methodology provides a\nvaluable tool for researchers and practitioners dealing with complex\nclassification problems in machine learning.\n",
  "subjects": [
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "hGB9PN6UMJqP9oxXkxSnnJ96H65HcUSEEgLk5ce-zoE",
  "pdfSize": "4847071"
}