{
  "id": "2412.13016",
  "title": "Design, fabrication and initial test of a novel 3D-Trench sensor\n  utilizing 8-inch CMOS compatible technology",
  "authors": "Manwen Liu, Huimin Ji, Wenzheng Cheng, Le Zhang, Zheng Li, Bo Tang,\n  Peng Zhang, Wenjuan Xiong, Trevor Vickey, E. Giulio Villani, Zhihua Li,\n  Dengfeng Zhang, and Jun Luo",
  "authorsParsed": [
    [
      "Liu",
      "Manwen",
      ""
    ],
    [
      "Ji",
      "Huimin",
      ""
    ],
    [
      "Cheng",
      "Wenzheng",
      ""
    ],
    [
      "Zhang",
      "Le",
      ""
    ],
    [
      "Li",
      "Zheng",
      ""
    ],
    [
      "Tang",
      "Bo",
      ""
    ],
    [
      "Zhang",
      "Peng",
      ""
    ],
    [
      "Xiong",
      "Wenjuan",
      ""
    ],
    [
      "Vickey",
      "Trevor",
      ""
    ],
    [
      "Villani",
      "E. Giulio",
      ""
    ],
    [
      "Li",
      "Zhihua",
      ""
    ],
    [
      "Zhang",
      "Dengfeng",
      ""
    ],
    [
      "Luo",
      "Jun",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 15:35:15 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734449715000,
  "abstract": "  The 3D silicon sensor has demonstrated excellent performances (signal\ncollection, detection efficiency, power consumption, etc.) comparable or even\nbetter with respect to the traditional planar sensor of the ATLAS Detector at\nthe Large Hadron Collider (LHC), especially after the high irradiation fluence,\nmainly due to the shorter drift length of the generated carriers. These\ncharacteristics have made it the most attractive technology for the detection\nand track reconstruction of charged particles for the High Energy Physics\n(HEP). In addition, its application is also being explored in astronomy,\nmicrodosimetry and medical imaging. This paper will present the design and\nfabrication of a novel 3D-Trench sensor which features an enclosed deep trench\nsurrounding the central columnar cathode. This novel sensor has been fabricated\non the 8-inch COMS pilot line at the Institute of Microelectronics of the\nChinese Academy of Sciences (IMECAS) where ultra-narrow etch width of 0.5\n{\\mu}m and the ultra-high depth-to-width ratio (aspect ratio) (>70) have been\nachieved. Its preliminary simulation and characterization results including\nelectrostatic potential, electric field, Current-Voltage (IV),\nCapacitance-Voltage (CV), Charge Collection Efficiency (CCE) and Timing\nPerformance before irradiation will be presented in this paper.\n",
  "subjects": [
    "Physics/Instrumentation and Detectors",
    "Physics/High Energy Physics - Experiment"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "_aMArJJ0I3Z7Va1C1pTUoe3H-85-BEazT6u0rgoL1I0",
  "pdfSize": "42870234"
}