{
  "id": "2412.19976",
  "title": "Will you donate money to a chatbot? The effect of chatbot\n  anthropomorphic features and persuasion strategies on willingness to donate",
  "authors": "Ekaterina Novozhilova, Jiacheng Huang, Le He, Ziling Li, James\n  Cummings",
  "authorsParsed": [
    [
      "Novozhilova",
      "Ekaterina",
      ""
    ],
    [
      "Huang",
      "Jiacheng",
      ""
    ],
    [
      "He",
      "Le",
      ""
    ],
    [
      "Li",
      "Ziling",
      ""
    ],
    [
      "Cummings",
      "James",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 28 Dec 2024 02:17:46 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735352266000,
  "abstract": "  This work investigates the causal mechanism behind the effect of chatbot\npersonification and persuasion strategies on users' perceptions and donation\nlikelihood. In a 2 (personified vs. non-personified chatbot) x 2 (emotional vs.\nlogical persuasion strategy) between-subjects experiment (N=76), participants\nengaged with a chatbot that represented a non-profit charitable organization.\nThe results suggest that interaction with a personified chatbot evokes\nperceived anthropomorphism; however, it does not elicit greater willingness to\ndonate. In fact, we found that commonly used anthropomorphic features, like\nname and narrative, led to negative attitudes toward an AI agent in the\ndonation context. Our results showcase a preference for non-personified\nchatbots paired with logical persuasion appeal, emphasizing the significance of\nconsistency in chatbot interaction, mirroring human-human engagement. We\ndiscuss the importance of moving from exploring the common scenario of a\nchatbot with machine identity vs. a chatbot with human identity in light of the\nrecent regulations of AI systems.\n",
  "subjects": [
    "Computer Science/Human-Computer Interaction",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Computers and Society"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "APIOuodWGLSam1JoQUWHznSPsMBM7enUE1V3jtCDxFI",
  "pdfSize": "569644"
}