{
  "id": "2412.07840",
  "title": "Reassessing the Cepheid-based distance ladder: implications for the\n  Hubble constant",
  "authors": "Marcus H\\\"og{\\aa}s and Edvard M\\\"ortsell",
  "authorsParsed": [
    [
      "Högås",
      "Marcus",
      ""
    ],
    [
      "Mörtsell",
      "Edvard",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 19:00:01 GMT"
    },
    {
      "version": "v2",
      "created": "Wed, 26 Feb 2025 09:21:31 GMT"
    }
  ],
  "updateDate": "2025-02-27",
  "timestamp": 1733857201000,
  "abstract": "  The Hubble constant ($H_0$) is a key parameter in cosmology, yet its precise\nvalue remains contentious due to discrepancies between early- and late-universe\nmeasurement methods, a problem known as the \"Hubble tension.\" In this study, we\nrevisit the Cepheid-based distance ladder calibration, focusing on two\npotential sources of bias in the period-luminosity relation (PLR): (1) the\nassumed prior for the residual parallax offset of the Milky Way (MW) Cepheids\nand (2) systematic differences between Cepheid periods in anchor galaxies\nversus supernova host galaxies. To address the latter, we adopt two different\nstrategies alongside a renewed MW Cepheid calibration. The first strategy\ninvolves resampling anchor and host Cepheids from a common distribution of\nperiods. This approach provides a conservative estimate of $H_0 = (72.18 \\pm\n1.76) \\, \\mathrm{km/s/Mpc}$, including the renewed MW analysis. The increased\nuncertainty reflects the reduced sample size -- about 700 Cepheids per\nresampling compared to 3200 in the original dataset. This method reduces the\nHubble tension from $5.4 \\, \\sigma$ (as reported by the SH0ES collaboration\nwith $H_0 = (73.17 \\pm 0.86) \\, \\mathrm{km/s/Mpc}$) to $2.4 \\, \\sigma$. The\nsecond strategy allows the PLR slope to vary with the period, yielding $H_0 =\n(72.35 \\pm 0.91) \\, \\mathrm{km/s/Mpc}$, including the renewed MW analysis, and\nthe tension reduced to $4.4 \\, \\sigma$. A statistical comparison of the model\nwith the single-linear PLR shows a significant preference for the broken PLR\n(p-value $< 0.001$). Both strategies consistently indicate a downward shift of\napproximately $-1 \\, \\mathrm{km/s/Mpc}$ in $H_0$. Our findings underscore the\nimportance of careful consideration of Cepheid population characteristics for\nprecise $H_0$ calibrations.\n",
  "subjects": [
    "Astrophysics/Cosmology and Nongalactic Astrophysics",
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "fEjwxkOTUBYJcfHwLEWiBWu6C9l-IGuEOP1LgCgb0qE",
  "pdfSize": "5354733"
}