{
  "id": "2412.12164",
  "title": "GAMED: Knowledge Adaptive Multi-Experts Decoupling for Multimodal Fake\n  News Detection",
  "authors": "Lingzhi Shen, Yunfei Long, Xiaohao Cai, Imran Razzak, Guanming Chen,\n  Kang Liu, and Shoaib Jameel",
  "authorsParsed": [
    [
      "Shen",
      "Lingzhi",
      ""
    ],
    [
      "Long",
      "Yunfei",
      ""
    ],
    [
      "Cai",
      "Xiaohao",
      ""
    ],
    [
      "Razzak",
      "Imran",
      ""
    ],
    [
      "Chen",
      "Guanming",
      ""
    ],
    [
      "Liu",
      "Kang",
      ""
    ],
    [
      "Jameel",
      "Shoaib",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 19:12:22 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1733944342000,
  "abstract": "  Multimodal fake news detection often involves modelling heterogeneous data\nsources, such as vision and language. Existing detection methods typically rely\non fusion effectiveness and cross-modal consistency to model the content,\ncomplicating understanding how each modality affects prediction accuracy.\nAdditionally, these methods are primarily based on static feature modelling,\nmaking it difficult to adapt to the dynamic changes and relationships between\ndifferent data modalities. This paper develops a significantly novel approach,\nGAMED, for multimodal modelling, which focuses on generating distinctive and\ndiscriminative features through modal decoupling to enhance cross-modal\nsynergies, thereby optimizing overall performance in the detection process.\nGAMED leverages multiple parallel expert networks to refine features and\npre-embed semantic knowledge to improve the experts' ability in information\nselection and viewpoint sharing. Subsequently, the feature distribution of each\nmodality is adaptively adjusted based on the respective experts' opinions.\nGAMED also introduces a novel classification technique to dynamically manage\ncontributions from different modalities, while improving the explainability of\ndecisions. Experimental results on the Fakeddit and Yang datasets demonstrate\nthat GAMED performs better than recently developed state-of-the-art models. The\nsource code can be accessed at https://github.com/slz0925/GAMED.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "axnuY0oCkifm92YSMCOhqO1VCEh3Du7q_gZt5h5hdTU",
  "pdfSize": "2797247"
}