{"id":"2412.03516","title":"You're (Not) My Type -- Can LLMs Generate Feedback of Specific Types for\n  Introductory Programming Tasks?","authors":"Dominic Lohr, Hieke Keuning and Natalie Kiesler","authorsParsed":[["Lohr","Dominic",""],["Keuning","Hieke",""],["Kiesler","Natalie",""]],"versions":[{"version":"v1","created":"Wed, 4 Dec 2024 17:57:39 GMT"}],"updateDate":"2024-12-05","timestamp":1733335059000,"abstract":"  Background: Feedback as one of the most influential factors for learning has\nbeen subject to a great body of research. It plays a key role in the\ndevelopment of educational technology systems and is traditionally rooted in\ndeterministic feedback defined by experts and their experience. However, with\nthe rise of generative AI and especially Large Language Models (LLMs), we\nexpect feedback as part of learning systems to transform, especially for the\ncontext of programming. In the past, it was challenging to automate feedback\nfor learners of programming. LLMs may create new possibilities to provide\nricher, and more individual feedback than ever before.\n  Objectives: This paper aims to generate specific types of feedback for\nintroductory programming tasks using LLMs. We revisit existing feedback\ntaxonomies to capture the specifics of the generated feedback, such as\nrandomness, uncertainty, and degrees of variation.\n  Methods: We iteratively designed prompts for the generation of specific\nfeedback types (as part of existing feedback taxonomies) in response to\nauthentic student programs. We then evaluated the generated output and\ndetermined to what extent it reflected certain feedback types.\n  Results and Conclusion: The present work provides a better understanding of\ndifferent feedback dimensions and characteristics. The results have\nimplications for future feedback research with regard to, for example, feedback\neffects and learners' informational needs. It further provides a basis for the\ndevelopment of new tools and learning systems for novice programmers including\nfeedback generated by AI.\n","subjects":["Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"pIus8z08Y6YlxHToTmEhTJ4Qfbhxl4tX-i_sAMYAdsM","pdfSize":"350017"}