{
  "id": "2412.06216",
  "title": "Top-r Influential Community Search in Bipartite Graphs",
  "authors": "Yanxin Zhang, Zhengyu Hua, Long Yuan",
  "authorsParsed": [
    [
      "Zhang",
      "Yanxin",
      ""
    ],
    [
      "Hua",
      "Zhengyu",
      ""
    ],
    [
      "Yuan",
      "Long",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 05:27:15 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 10 Dec 2024 06:32:12 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733722035000,
  "abstract": "  Community search over bipartite graphs is a fundamental problem, and finding\ninfluential communities has attracted significant attention. However, all\nexisting studies have used the minimum weight of vertices as the influence of\ncommunities. This leads to an inaccurate assessment of real influence in graphs\nwhere there are only a few vertices with low weights. In this paper, we propose\na new cohesive subgraph model named ($\\alpha$,$\\beta$)-influential community\nthat considers the average weight of vertices from two layers on bipartite\ngraphs, thereby providing a more comprehensive reflection of community\ninfluence. Based on this community model, we present a recursive algorithm that\ntraverses the entire bipartite graph to find top-$r$\n($\\alpha$,$\\beta$)-influential communities. To further expedite the search for\ninfluential communities, we propose a slim tree structure to reduce the search\nwidth and introduce several effective upper bounds to reduce the search depth.\nSince we have proven that this problem is NP-hard, using exact algorithms to\nfind top-$r$ ($\\alpha$,$\\beta$)-communities accurately is very time-consuming.\nTherefore, we propose an approximate algorithm using a greedy approach to find\ntop-$r$ ($\\alpha$,$\\beta$)-communities as quickly as possible. It only takes\n$O((n+m)+m\\log_{}{n})$ time. Additionally, we introduce a new pruning algorithm\nto improve the efficiency of the search. Extensive experiments on 10 real-world\ngraphs validate both the effectiveness and the efficiency of our algorithms.\n",
  "subjects": [
    "Computer Science/Social and Information Networks"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "YYENFhOVQQQ3jj5CGqQw2lNFgsmDAfgQmENyYy8sq3s",
  "pdfSize": "1320710"
}