{
  "id": "2412.04485",
  "title": "EDA-Aware RTL Generation with Large Language Models",
  "authors": "Mubashir ul Islam, Humza Sami, Pierre-Emmanuel Gaillardon, and Valerio\n  Tenace",
  "authorsParsed": [
    [
      "Islam",
      "Mubashir ul",
      ""
    ],
    [
      "Sami",
      "Humza",
      ""
    ],
    [
      "Gaillardon",
      "Pierre-Emmanuel",
      ""
    ],
    [
      "Tenace",
      "Valerio",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 21 Nov 2024 00:37:51 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1732149471000,
  "abstract": "  Large Language Models (LLMs) have become increasingly popular for generating\nRTL code. However, producing error-free RTL code in a zero-shot setting remains\nhighly challenging for even state-of-the-art LLMs, often leading to issues that\nrequire manual, iterative refinement. This additional debugging process can\ndramatically increase the verification workload, underscoring the need for\nrobust, automated correction mechanisms to ensure code correctness from the\nstart.\n  In this work, we introduce AIvril2, a self-verifying, LLM-agnostic agentic\nframework aimed at enhancing RTL code generation through iterative corrections\nof both syntax and functional errors. Our approach leverages a collaborative\nmulti-agent system that incorporates feedback from error logs generated by EDA\ntools to automatically identify and resolve design flaws. Experimental results,\nconducted on the VerilogEval-Human benchmark suite, demonstrate that our\nframework significantly improves code quality, achieving nearly a 3.4$\\times$\nenhancement over prior methods. In the best-case scenario, functional pass\nrates of 77% for Verilog and 66% for VHDL were obtained, thus substantially\nimproving the reliability of LLM-driven RTL code generation.\n",
  "subjects": [
    "Computer Science/Hardware Architecture",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "pbA5nOna7LmIStTWkJbkEFWfkmCauKCYSohsRqCkSik",
  "pdfSize": "478616"
}