{"id":"2412.08706","title":"Engineering of self-bending surface plasmon polaritons through\n  Hermite-Gaussian mode expansion","authors":"J. Hern\\'andez-Rueda, A. S. Sanz, R. Mart\\'inez-Herrero","authorsParsed":[["Hernández-Rueda","J.",""],["Sanz","A. S.",""],["Martínez-Herrero","R.",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 19:00:01 GMT"}],"updateDate":"2024-12-13","timestamp":1733943601000,"abstract":"  Surface plasmon polaritons have received much attention over the last decades\nin fields such as photonics or nanotechnology due to their inherent high\nsensitivity to metal surface variations (e.g., presence of adsorbates or\nchanges in the roughness). Because of this important property, it is expected\nthat they will find promising major applications in widely cross-disciplinary\nareas ranging from material science to medicine. Motivated by this ever-growing\ninterest, here we introduce a novel theoretical framework suitable to design\nnew types of structured paraxial surface plasmon beams and to control their\npropagation along the interface between a dielectric and a lossy metal. This is\npossible by virtue of a convenient Hermite-Gaussian mode expansion, which\nconstitutes a complete basis set upon which new types of structured paraxial\nplasmon beams can be generated. The beams obtained from this method present a\nrather peculiar feature, as they exhibit local intensity maxima at different\npropagation distances. This way of creating tightly confined structured light\nallows us control where to place the beam energy. This, thus, opens up worth\nexploring pathways to manipulate light propagation along metal surfaces at the\nnanoscale. As a proof-of-concept, we provide numerical evidence of the\nfeasibility of the method by considering the analysis of the propagation of\nAiry-based surface plasmon polaritons along an air-silver interface.\n","subjects":["Physics/Optics","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"etCwqiUp94ykxmEQWqdBvxeao9uN-b1jSmNmITYvJy8","pdfSize":"703065"}