{
  "id": "2412.17842",
  "title": "Canine EEG Helps Human: Cross-Species and Cross-Modality Epileptic\n  Seizure Detection via Multi-Space Alignment",
  "authors": "Z. Wang, S. Li and Dongrui Wu",
  "authorsParsed": [
    [
      "Wang",
      "Z.",
      ""
    ],
    [
      "Li",
      "S.",
      ""
    ],
    [
      "Wu",
      "Dongrui",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 13:25:07 GMT"
    },
    {
      "version": "v2",
      "created": "Sat, 8 Feb 2025 02:43:05 GMT"
    }
  ],
  "updateDate": "2025-02-11",
  "timestamp": 1734528307000,
  "abstract": "  Epilepsy significantly impacts global health, affecting about 65 million\npeople worldwide, along with various animal species. The diagnostic processes\nof epilepsy are often hindered by the transient and unpredictable nature of\nseizures. Here we propose a multi-space alignment approach based on\ncross-species and cross-modality electroencephalogram (EEG) data to enhance the\ndetection capabilities and understanding of epileptic seizures. By employing\ndeep learning techniques, including domain adaptation and knowledge\ndistillation, our framework aligns cross-species and cross-modality EEG signals\nto enhance the detection capability beyond traditional within-species and\nwith-modality models. Experiments on multiple surface and intracranial EEG\ndatasets of humans and canines demonstrated substantial improvements in the\ndetection accuracy, achieving over 90% AUC scores for cross-species and\ncross-modality seizure detection with extremely limited labeled data from the\ntarget species/modality. To our knowledge, this is the first study that\ndemonstrates the effectiveness of integrating heterogeneous data from different\nspecies and modalities to improve EEG-based seizure detection performance. The\napproach may also be generalizable to different brain-computer interface\nparadigms, and suggests the possibility to combine data from different\nspecies/modalities to increase the amount of training data for large EEG\nmodels.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Signal Processing",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "8tEnxgGNFFXJtvDYRyZwV22Z63YIKejVYarsz_HsNOU",
  "pdfSize": "8923962"
}