{
  "id": "2412.01356",
  "title": "Text-based Audio Retrieval by Learning from Similarities between Audio\n  Captions",
  "authors": "Huang Xie, Khazar Khorrami, Okko R\\\"as\\\"anen, Tuomas Virtanen",
  "authorsParsed": [
    [
      "Xie",
      "Huang",
      ""
    ],
    [
      "Khorrami",
      "Khazar",
      ""
    ],
    [
      "Räsänen",
      "Okko",
      ""
    ],
    [
      "Virtanen",
      "Tuomas",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 10:34:05 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733135645000,
  "abstract": "  This paper proposes to use similarities of audio captions for estimating\naudio-caption relevances to be used for training text-based audio retrieval\nsystems. Current audio-caption datasets (e.g., Clotho) contain audio samples\npaired with annotated captions, but lack relevance information about audio\nsamples and captions beyond the annotated ones. Besides, mainstream approaches\n(e.g., CLAP) usually treat the annotated pairs as positives and consider all\nother audio-caption combinations as negatives, assuming a binary relevance\nbetween audio samples and captions. To infer the relevance between audio\nsamples and arbitrary captions, we propose a method that computes non-binary\naudio-caption relevance scores based on the textual similarities of audio\ncaptions. We measure textual similarities of audio captions by calculating the\ncosine similarity of their Sentence-BERT embeddings and then transform these\nsimilarities into audio-caption relevance scores using a logistic function,\nthereby linking audio samples through their annotated captions to all other\ncaptions in the dataset. To integrate the computed relevances into training, we\nemploy a listwise ranking objective, where relevance scores are converted into\nprobabilities of ranking audio samples for a given textual query. We show the\neffectiveness of the proposed method by demonstrating improvements in\ntext-based audio retrieval compared to methods that use binary audio-caption\nrelevances for training.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Audio and Speech Processing"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "VflWNmPrzrPrE1fqOHl1fWiBCtpC8f-X71AR4wiZeHU",
  "pdfSize": "326518"
}