{
  "id": "2412.03512",
  "title": "Distillation of Diffusion Features for Semantic Correspondence",
  "authors": "Frank Fundel and Johannes Schusterbauer and Vincent Tao Hu and Bj\\\"orn\n  Ommer",
  "authorsParsed": [
    [
      "Fundel",
      "Frank",
      ""
    ],
    [
      "Schusterbauer",
      "Johannes",
      ""
    ],
    [
      "Hu",
      "Vincent Tao",
      ""
    ],
    [
      "Ommer",
      "Björn",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 17:55:33 GMT"
    }
  ],
  "updateDate": "2024-12-05",
  "timestamp": 1733334933000,
  "abstract": "  Semantic correspondence, the task of determining relationships between\ndifferent parts of images, underpins various applications including 3D\nreconstruction, image-to-image translation, object tracking, and visual place\nrecognition. Recent studies have begun to explore representations learned in\nlarge generative image models for semantic correspondence, demonstrating\npromising results. Building on this progress, current state-of-the-art methods\nrely on combining multiple large models, resulting in high computational\ndemands and reduced efficiency. In this work, we address this challenge by\nproposing a more computationally efficient approach. We propose a novel\nknowledge distillation technique to overcome the problem of reduced efficiency.\nWe show how to use two large vision foundation models and distill the\ncapabilities of these complementary models into one smaller model that\nmaintains high accuracy at reduced computational cost. Furthermore, we\ndemonstrate that by incorporating 3D data, we are able to further improve\nperformance, without the need for human-annotated correspondences. Overall, our\nempirical results demonstrate that our distilled model with 3D data\naugmentation achieves performance superior to current state-of-the-art methods\nwhile significantly reducing computational load and enhancing practicality for\nreal-world applications, such as semantic video correspondence. Our code and\nweights are publicly available on our project page.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "dt6dtOEWKHyzMKfsZ3xyZr-48bXqeibp6Vd2uNHGsH8",
  "pdfSize": "21209235"
}