{"id":"2412.08921","title":"Self-regulated Learning Processes in Secondary Education: A Network\n  Analysis of Trace-based Measures","authors":"Yixin Cheng, Rui Guan, Tongguang Li, Mladen Rakovi\\'c, Xinyu Li,\n  Yizhou Fan, Flora Jin, Yi-Shan Tsai, Dragan Ga\\v{s}evi\\'c, and Zachari\n  Swiecki","authorsParsed":[["Cheng","Yixin",""],["Guan","Rui",""],["Li","Tongguang",""],["Raković","Mladen",""],["Li","Xinyu",""],["Fan","Yizhou",""],["Jin","Flora",""],["Tsai","Yi-Shan",""],["Gašević","Dragan",""],["Swiecki","Zachari",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 04:10:14 GMT"}],"updateDate":"2024-12-13","timestamp":1733976614000,"abstract":"  While the capacity to self-regulate has been found to be crucial for\nsecondary school students, prior studies often rely on self-report surveys and\nthink-aloud protocols that present notable limitations in capturing\nself-regulated learning (SRL) processes. This study advances the understanding\nof SRL in secondary education by using trace data to examine SRL processes\nduring multi-source writing tasks, with higher education participants included\nfor comparison. We collected fine-grained trace data from 66 secondary school\nstudents and 59 university students working on the same writing tasks within a\nshared SRL-oriented learning environment. The data were labelled using\nBannert's validated SRL coding scheme to reflect specific SRL processes, and we\nexamined the relationship between these processes, essay performance, and\neducational levels. Using epistemic network analysis (ENA) to model and\nvisualise the interconnected SRL processes in Bannert's coding scheme, we found\nthat: (a) secondary school students predominantly engaged in three SRL\nprocesses -- Orientation, Re-reading, and Elaboration/Organisation; (b)\nhigh-performing secondary students engaged more in Re-reading, while\nlow-performing students showed more Orientation process; and (c) higher\neducation students exhibited more diverse SRL processes such as Monitoring and\nEvaluation than their secondary education counterparts, who heavily relied on\nfollowing task instructions and rubrics to guide their writing. These findings\nhighlight the necessity of designing scaffolding tools and developing teacher\ntraining programs to enhance awareness and development of SRL skills for\nsecondary school learners.\n","subjects":["Computer Science/Human-Computer Interaction","Computer Science/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"u8hckVYXYxrd1g2RxOd4w5KFzpicU-WBf5gVb237ZLI","pdfSize":"1327797"}