{
  "id": "2412.03063",
  "title": "The FAST Galactic Plane Pulsar Snapshot Survey: VII. Six millisecond\n  pulsars in compact orbits with massive white dwarf companions",
  "authors": "Z. L. Yang, J. L. Han, T. Wang, P. F. Wang, W. Q. Su, W. C. Chen, C.\n  Wang, D. J. Zhou, Y. Yan, W. C. Jing, N. N. Cai, L. Xie, J. Xu, H. G. Wang,\n  R. X. Xu",
  "authorsParsed": [
    [
      "Yang",
      "Z. L.",
      ""
    ],
    [
      "Han",
      "J. L.",
      ""
    ],
    [
      "Wang",
      "T.",
      ""
    ],
    [
      "Wang",
      "P. F.",
      ""
    ],
    [
      "Su",
      "W. Q.",
      ""
    ],
    [
      "Chen",
      "W. C.",
      ""
    ],
    [
      "Wang",
      "C.",
      ""
    ],
    [
      "Zhou",
      "D. J.",
      ""
    ],
    [
      "Yan",
      "Y.",
      ""
    ],
    [
      "Jing",
      "W. C.",
      ""
    ],
    [
      "Cai",
      "N. N.",
      ""
    ],
    [
      "Xie",
      "L.",
      ""
    ],
    [
      "Xu",
      "J.",
      ""
    ],
    [
      "Wang",
      "H. G.",
      ""
    ],
    [
      "Xu",
      "R. X.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 06:34:28 GMT"
    },
    {
      "version": "v2",
      "created": "Fri, 31 Jan 2025 14:54:53 GMT"
    }
  ],
  "updateDate": "2025-02-03",
  "timestamp": 1733294068000,
  "abstract": "  Binary millisecond pulsars with a massive white dwarf (WD) companion are\nintermediate-mass binary pulsars (IMBPs). They are formed via the Case BB\nRoche-lobe overflow evolution channel if they are in compact orbits with an\norbital period of less than 1 day. They are fairly rare in the known pulsar\npopulation; only five such IMBPs have been discovered before, and one of them\nis in a globular cluster. Here we report six IMBPs in compact orbits: PSRs\nJ0416+5201, J0520+3722, J1919+1341, J1943+2210, J1947+2304 and J2023+2853,\ndiscovered during the Galactic Plane Pulsar Snapshot survey by using the\nFive-hundred-meter Aperture Spherical radio Telescope, doubling the number of\nsuch IMBPs due to the high survey sensitivity in the short survey time of 5\nminutes. Follow-up timing observations show that they all have either a CO WD\nor an ONeMg WD companion with a mass greater than about 0.8~$M_\\odot$ in a very\ncircular orbit with an eccentricity in the order of $\\lesssim10^{-5}$. PSR\nJ0416+5201 should be an ONeMg WD companion with a remarkable minimum mass of\n1.28 $M_\\odot$. These massive WD companions lead to a detectable Shapiro delay\nfor PSRs J0416+5201, J0520+3722, J1943+2210, and J2023 +2853, indicating that\ntheir orbits are highly inclined. From the measurement of the Shapiro delay,\nthe pulsar mass of J1943+2210 was constrained to be\n1.84$^{\\,+0.11}_{-0.09}$~$M_\\odot$, and that of PSR J2023+2853 to be\n1.28$^{\\,+0.06}_{-0.05}$~$M_\\odot$.\n",
  "subjects": [
    "Astrophysics/High Energy Astrophysical Phenomena"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "G4DtLjIluBBjw2r8fN2w77uonwDQgHLJ8e56QWj938c",
  "pdfSize": "1175766"
}