{"id":"2412.12942","title":"Transforming Single Photon Camera Images to Color High Dynamic Range\n  Images","authors":"Sumit Sharma, Girish Rongali, Kaushik Mitra","authorsParsed":[["Sharma","Sumit",""],["Rongali","Girish",""],["Mitra","Kaushik",""]],"versions":[{"version":"v1","created":"Tue, 17 Dec 2024 14:20:12 GMT"}],"updateDate":"2024-12-18","timestamp":1734445212000,"abstract":"  Traditional CMOS sensors suffer from restricted dynamic range and sub optimal\nperformance under extreme lighting conditions. They are affected by electronic\nnoise in low light conditions and pixel saturation while capturing high\nillumination. Recent High Dynamic Range (HDR) Imaging methods, often designed\nfor CMOS Sensors, attempt to address these issues by fusing multiple exposures.\nHowever, they frequently introduce artifacts like ghosting and light flickering\nin dynamic scenarios and non-uniform signal-to-noise ratio in extreme dynamic\nrange conditions. Recently, Single Photon Avalanche Diodes (SPADs), also known\nas Single Photon Camera (SPC) sensors, have surpassed CMOS sensors due to their\ncapability to capture individual photons with high timing precision. Unlike\ntraditional digital cameras that first convert light energy into analog\nelectrical currents and then digitize them, SPAD sensors perform direct photon\ndetection, making them less susceptible to extreme illumination conditions.\nTheir distinctive non-linear response curve aids in capturing photons across\nboth low-light and high-illumination environments, making them particularly\neffective for High Dynamic Range Imaging. Despite their advantages, images from\nSPAD Sensors are often noisy and visually unappealing. To address these\nchallenges, we evaluate state-of-the-art architectures for converting\nmonochromatic SPAD images into Color HDR images at various resolutions. Our\nevaluation involves both qualitative and quantitative assessments of these\narchitectures, focusing on their effectiveness in each stage of the conversion\nprocess.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"25IyFz85nIZOHhqNf40zpMNkHoH5iioK1Hlxu3E_c4w","pdfSize":"31336946"}