{"id":"2412.03146","title":"MCVO: A Generic Visual Odometry for Arbitrarily Arranged Multi-Cameras","authors":"Huai Yu, Junhao Wang, Yao He, Wen Yang, Gui-Song Xia","authorsParsed":[["Yu","Huai",""],["Wang","Junhao",""],["He","Yao",""],["Yang","Wen",""],["Xia","Gui-Song",""]],"versions":[{"version":"v1","created":"Wed, 4 Dec 2024 09:13:03 GMT"}],"updateDate":"2024-12-05","timestamp":1733303583000,"abstract":"  Making multi-camera visual SLAM systems easier to set up and more robust to\nthe environment is always one of the focuses of vision robots. Existing\nmonocular and binocular vision SLAM systems have narrow FoV and are fragile in\ntextureless environments with degenerated accuracy and limited robustness. Thus\nmulti-camera SLAM systems are gaining attention because they can provide\nredundancy for texture degeneration with wide FoV. However, current\nmulti-camera SLAM systems face massive data processing pressure and elaborately\ndesigned camera configurations, leading to estimation failures for arbitrarily\narranged multi-camera systems. To address these problems, we propose a generic\nvisual odometry for arbitrarily arranged multi-cameras, which can achieve\nmetric-scale state estimation with high flexibility in the cameras'\narrangement. Specifically, we first design a learning-based feature extraction\nand tracking framework to shift the pressure of CPU processing of multiple\nvideo streams. Then we use the rigid constraints between cameras to estimate\nthe metric scale poses for robust SLAM system initialization. Finally, we fuse\nthe features of the multi-cameras in the SLAM back-end to achieve robust pose\nestimation and online scale optimization. Additionally, multi-camera features\nhelp improve the loop detection for pose graph optimization. Experiments on\nKITTI-360 and MultiCamData datasets validate the robustness of our method over\narbitrarily placed cameras. Compared with other stereo and multi-camera visual\nSLAM systems, our method obtains higher pose estimation accuracy with better\ngeneralization ability. Our codes and online demos are available at\n\\url{https://github.com/JunhaoWang615/MCVO}\n","subjects":["Computer Science/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"yvtzp-m87M_fqvTVtmQ4cxlRIyEM9LJlv-LHoKPjWgM","pdfSize":"981775"}