{
  "id": "2412.03937",
  "title": "AIpparel: A Large Multimodal Generative Model for Digital Garments",
  "authors": "Kiyohiro Nakayama and Jan Ackermann and Timur Levent Kesdogan and Yang\n  Zheng and Maria Korosteleva and Olga Sorkine-Hornung and Leonidas J. Guibas\n  and Guandao Yang and Gordon Wetzstein",
  "authorsParsed": [
    [
      "Nakayama",
      "Kiyohiro",
      ""
    ],
    [
      "Ackermann",
      "Jan",
      ""
    ],
    [
      "Kesdogan",
      "Timur Levent",
      ""
    ],
    [
      "Zheng",
      "Yang",
      ""
    ],
    [
      "Korosteleva",
      "Maria",
      ""
    ],
    [
      "Sorkine-Hornung",
      "Olga",
      ""
    ],
    [
      "Guibas",
      "Leonidas J.",
      ""
    ],
    [
      "Yang",
      "Guandao",
      ""
    ],
    [
      "Wetzstein",
      "Gordon",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 07:35:19 GMT"
    },
    {
      "version": "v2",
      "created": "Fri, 13 Dec 2024 06:15:54 GMT"
    },
    {
      "version": "v3",
      "created": "Mon, 16 Dec 2024 02:39:18 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1733384119000,
  "abstract": "  Apparel is essential to human life, offering protection, mirroring cultural\nidentities, and showcasing personal style. Yet, the creation of garments\nremains a time-consuming process, largely due to the manual work involved in\ndesigning them. To simplify this process, we introduce AIpparel, a large\nmultimodal model for generating and editing sewing patterns. Our model\nfine-tunes state-of-the-art large multimodal models (LMMs) on a custom-curated\nlarge-scale dataset of over 120,000 unique garments, each with multimodal\nannotations including text, images, and sewing patterns. Additionally, we\npropose a novel tokenization scheme that concisely encodes these complex sewing\npatterns so that LLMs can learn to predict them efficiently. AIpparel achieves\nstate-of-the-art performance in single-modal tasks, including text-to-garment\nand image-to-garment prediction, and enables novel multimodal garment\ngeneration applications such as interactive garment editing. The project\nwebsite is at georgenakayama.github.io/AIpparel/.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "l77SsRhoHTuMQt1_mKzPanvoTt3JHHz9DgOtMuTdB80",
  "pdfSize": "20109026"
}