{
  "id": "2412.13483",
  "title": "Unveiling the formation channels of stellar halos through their chemical\n  fingerprints",
  "authors": "Jenny Gonzalez-Jara, Patricia B. Tissera, Antonela Monachesi, Emanuel\n  Sillero, Diego Pallero, Susana Pedrosa, Elisa A. Tau, Brian Tapia-Contreras,\n  Lucas Bignone",
  "authorsParsed": [
    [
      "Gonzalez-Jara",
      "Jenny",
      ""
    ],
    [
      "Tissera",
      "Patricia B.",
      ""
    ],
    [
      "Monachesi",
      "Antonela",
      ""
    ],
    [
      "Sillero",
      "Emanuel",
      ""
    ],
    [
      "Pallero",
      "Diego",
      ""
    ],
    [
      "Pedrosa",
      "Susana",
      ""
    ],
    [
      "Tau",
      "Elisa A.",
      ""
    ],
    [
      "Tapia-Contreras",
      "Brian",
      ""
    ],
    [
      "Bignone",
      "Lucas",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 03:59:29 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734494369000,
  "abstract": "  Stellar halos around galaxies contain key information about their formation\nand assembly history. Using simulations, we can trace the origins of different\nstellar populations in these halos, contributing to our understanding of galaxy\nevolution. We aim to investigate the assembly of stellar halos and their\nchemical abundances in 28 galaxies from CIELO project with logMgal[9 and\n11]Msun. Stellar halos were identified using the AM E method, focusing on the\nouter regions between the 1.5 optical radius and the virial radius. We divided\nthe stellar populations based on their formation channel: exsitu, endodebris,\nand insitu, and analyzed their chemical abundances, ages, and spatial\ndistributions. Additionally, we explored correlations between halo mass,\nmetallicity, and alpha element enrichment. CIELO simulations reveal that\nstellar halos are predominantly composed of accreted material (exsitu and\nendodebris stars), in agreement with previous works. The mass fraction of these\npopulations is independent of stellar halo mass, though their metallicities\nscale linearly with it. Exsitu stars tend to dominate the outskirts and be more\nalpha rich and older, while endodebris stars are more prevalent at lower radii\nand tend to be less alpha rich and slightly younger. Massive stellar halos\nrequire a median of five additional satellites to build 90 percent of their\nmass, compared to lower mass halos, which typically need fewer (median of 2.5)\nand lower-mass satellites and are assembled earlier. The diversity of accreted\nsatellite histories results in well defined stellar halo mass metallicity and\n[alpha/Fe] [Fe/H] relations, offering a detailed view of the chemical evolution\nand assembly history of stellar halos. We find that the [alpha/Fe] [Fe/H] is\nmore sensitive to the characteristics and star formation history of the\ncontributing satellites than the stellar halo mass metallicity relationship\n",
  "subjects": [
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "TdNrJw1arAFGdl0os8NBZQyhgwvc85VQYDDTsAKWxmo",
  "pdfSize": "2302487"
}