{"id":"2412.02590","title":"Convective environments within Mediterranean cyclones","authors":"Alice Portal, Andrea Angelidou, Raphael Rousseau-Rizzi, Shira\n  Raveh-Rubin, Yonatan Givon, Jennifer L Catto, Francesco Battaglioli, Mateusz\n  Taszarek, Emmanouil Flaounas, Olivia Martius","authorsParsed":[["Portal","Alice",""],["Angelidou","Andrea",""],["Rousseau-Rizzi","Raphael",""],["Raveh-Rubin","Shira",""],["Givon","Yonatan",""],["Catto","Jennifer L",""],["Battaglioli","Francesco",""],["Taszarek","Mateusz",""],["Flaounas","Emmanouil",""],["Martius","Olivia",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 17:19:42 GMT"}],"updateDate":"2024-12-04","timestamp":1733246382000,"abstract":"  Understanding convective processes leading to severe weather hazards within\nMediterranean cyclones is relevant for operational forecasters, insurance\nindustry, and enhancing societal preparedness. In this work we examine the\nclimatological link between Mediterranean cyclones and atmospheric conditions\nconducive to the formation of severe convection and convective hazards\n(convective precipitation, lightning and hail potential). Using ATDnet\nlightning detections we find that, from autumn to spring, 20 to 60% of\nlightning hours over the Mediterranean basin and adjacent land regions are\nassociated with the presence of a nearby cyclone. Based on reanalysis data,\nsevere convective environments, deep, moist convection (i.e., lightning\npotential) and related hazards are frequent in the warm sector of Mediterranean\ncyclones and to the north-east of their centres. In agreement with previous\nliterature, convective processes and hazards peak approximately six hours prior\nto the time of minimum pressure of the cyclone centre. Moreover, severe\nconvective environments are often detected in cyclone categories typical of\ntransition seasons (especially autumn) and summer, while they are rarer in deep\nbaroclinic cyclones with peak occurrence during winter. Finally, we show that\ndynamical cyclone features distinguish regions favourable to deep, moist\nconvection. Warm conveyor belts of Mediterranean cyclones, characterised by\nlarge-scale ascent and located in regions of high thermodynamic instability,\nhave the largest lightning potential. The potential is only half as intense\nalong the cyclones' cold fronts.\n","subjects":["Physics/Atmospheric and Oceanic Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"TWUZKoGQCKrRkyAtdQ01rIz8FBpViU9S5oXp7eC3FxE","pdfSize":"2027062"}