{"id":"2412.17137","title":"The Role of Integration Cycles in Complex Langevin Simulations","authors":"Michael W. Hansen, Michael Mandl, Erhard Seiler, D\\'enes Sexty","authorsParsed":[["Hansen","Michael W.",""],["Mandl","Michael",""],["Seiler","Erhard",""],["Sexty","Dénes",""]],"versions":[{"version":"v1","created":"Sun, 22 Dec 2024 18:56:52 GMT"}],"updateDate":"2024-12-24","timestamp":1734893812000,"abstract":"  Complex Langevin simulations are an attempt to solve the sign (or\ncomplex-action) problem encountered in various physical systems of interest.\nThe method is based on a complexification of the underlying degrees of freedom\nand an evolution in an auxiliary time dimension. The complexification, however,\ndoes not come without drawbacks, the most severe of which is the infamous\n'wrong convergence' problem, stating that complex Langevin simulations\nsometimes fail to produce correct answers despite their apparent convergence.\nIt has long been realized that wrong convergence may - in principle - be fixed\nby the introduction of a suitable kernel into the complex Langevin equation,\nsuch that the conventional correctness criteria are met. However, as we discuss\nin this work, complex Langevin results may - especially in the presence of a\nkernel - still be affected by unwanted so-called integration cycles of the\ntheory spoiling them. Indeed, we confirm numerically that in the absence of\nboundary terms the complex Langevin results are given by a linear combination\nof such integration cycles, as put forward by Salcedo & Seiler. In particular,\nwe shed light on the way different choices of kernel affect which integration\ncycles are being sampled in a simulation and how this knowledge can be used to\nensure correct convergence in simple toy models.\n","subjects":["Physics/High Energy Physics - Lattice","Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"dNdqR5VPbybzt2iCiX_0h59g1anpWWiM4nij8XfpN84","pdfSize":"3942400"}