{
  "id": "2412.08069",
  "title": "DialogAgent: An Auto-engagement Agent for Code Question Answering Data\n  Production",
  "authors": "Xiaoyun Liang, Jingyi Ren, Jiayi Qi, Chao Peng, Bo Jiang",
  "authorsParsed": [
    [
      "Liang",
      "Xiaoyun",
      ""
    ],
    [
      "Ren",
      "Jingyi",
      ""
    ],
    [
      "Qi",
      "Jiayi",
      ""
    ],
    [
      "Peng",
      "Chao",
      ""
    ],
    [
      "Jiang",
      "Bo",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 03:31:36 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733887896000,
  "abstract": "  Large Language Models (LLMs) have become increasingly integral to enhancing\ndeveloper productivity, particularly in code generation, comprehension, and\nrepair tasks. However, fine-tuning these models with high-quality, real-world\ndata is challenging due to privacy concerns and the lack of accessible, labeled\ndatasets. In this paper, we present DialogAgent, an automated tool for\ngenerating synthetic training data that closely mimics real developer\ninteractions within Integrated Development Environments (IDEs). DialogAgent\nenables the production of diverse, high-fidelity query-response pairs by\nsimulating multi-turn dialogues and contextual behaviors observed in real-world\nprogramming scenarios. The tool significantly reduces the reliance on manual\ndata generation, increasing efficiency by 4.8 times compared to traditional\nmethods. Our experiments and online deployment demonstrate substantial\nimprovements in model performance for code-related question-answering tasks:\nthe acceptance rate of responses generated by our in-house model is improved by\n33%, after training on synthesized data generated by DialogAgent.\n",
  "subjects": [
    "Computer Science/Software Engineering",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "S8CYN_XzOKNI4JAagSzfpkDuhTBcOMnujIM9xPYxS0I",
  "pdfSize": "1187088"
}