{"id":"2412.08086","title":"Frequency-resolved Transient Absorption Spectroscopy for High Pressure\n  System","authors":"Zi-Qian Cheng, Xiao-Shuang Yin, Liu-Xiang Yang, Hui Dong","authorsParsed":[["Cheng","Zi-Qian",""],["Yin","Xiao-Shuang",""],["Yang","Liu-Xiang",""],["Dong","Hui",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 04:07:19 GMT"}],"updateDate":"2024-12-12","timestamp":1733890039000,"abstract":"  Dynamics of materials under high-pressure conditions has been an important\nfocus of materials science, especially in the timescale of pico- and\nfemto-second of electronic and vibrational motion, which is typically probed by\nultrafast laser pulses. To probe such dynamics, it requires an integration of\nhigh-pressure devices with the ultrafast laser system. In this work, we\nconstruct a frequency-resolved high-pressure transient absorption spectroscopy\nsystem based on a diamond anvil cell (DAC) with transmissive detection. In this\nsetup, we use the narrowband laser as the pump beam and the supercontinuum\nwhite light as the probe beam. To effectively eliminate the scattering noise\nfrom the pump light, we design a double-chopper operating mode, which allows us\nto obtain signals in the complete frequency domain including the overlap region\nwith the pump pulse. And we test system with Rhodamine B solution with the\nprobe wavelength range of 450-750 nm and the 550nm pump, and observe that the\nintensity of the signal peak corresponding to the monomer at 560 nm\ncontinuously decreased relative to the signal peak corresponding to the dimer\nat 530 nm. This indicates that the portion of Rhodamine B molecules in the\ndimer form increases under increasing pressure. Additionally, we find two\ndynamic components of the signal peaks for both monomer and dimer, and the\nshort-lifetime component increases as the pressure is increased, and the\nlong-lifetime component decreases.\n","subjects":["Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"eBzq5GB1E-rlTD9TtkFaeQNFnq292fXNVzaebdaexj4","pdfSize":"4152121"}