{
  "id": "2412.05089",
  "title": "Analytical assessment of the total loss in tubular hollow-core fibers\n  during their fabrication process",
  "authors": "Duanny Silva On\\'orio, Flavio A. M. Marques, Alexandre A. C. Cotta,\n  Jefferson E. Tsuchida, Alexandre Bessa dos Santos, Jonas H. Os\\'orio",
  "authorsParsed": [
    [
      "Onório",
      "Duanny Silva",
      ""
    ],
    [
      "Marques",
      "Flavio A. M.",
      ""
    ],
    [
      "Cotta",
      "Alexandre A. C.",
      ""
    ],
    [
      "Tsuchida",
      "Jefferson E.",
      ""
    ],
    [
      "Santos",
      "Alexandre Bessa dos",
      ""
    ],
    [
      "Osório",
      "Jonas H.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 14:47:58 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733496478000,
  "abstract": "  Hollow-core photonic crystal fibers (HCPCFs) have become a key enabling\ntechnology for addressing a broad spectrum of fundamental and applied needs.\nIndeed, recent advancements achieved by the HCPCF research community have led\nto significant progress, establishing these fibers as the lowest-loss optical\nfibers currently available for use in the visible and ultraviolet ranges.\nHowever, the fabrication process of HCPCFs demands costly infrastructure, and\nachieving ultralow-loss fibers remains a complex technical challenge as\nnumerous fabrication attempts are typically required to optimize their\nperformances. Therefore, predicting these fibers' performances before\nexperimental fabrication is highly desirable. In this work, we tackle this task\nby analytically assessing the total loss in tubular-lattice HCPCFs during their\nfabrication process. By considering the variation in the microstructure's\ngeometrical parameters during fabrication and the different sources of loss, we\nestimate expected loss levels and identify the conditions for loss\nminimization. We understand that our research provides valuable insights into\nthe fabrication process of hollow-core fibers, offering a predictive approach\nto evaluate the fibers' performance before their experimental realization. By\ndetermining optimal conditions considering geometry, fabrication constraints,\nand loss figures, we believe that our work contributes to the ongoing efforts\nto further reduce the loss levels in HCPCFs.\n",
  "subjects": [
    "Physics/Optics",
    "Physics/Applied Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "lWQHpGGkNoPzV0iI9LMZ8cA0BElS94CnluANFqP19D8",
  "pdfSize": "767339"
}