{"id":"2412.00646","title":"Diffusiophoresis in porous media saturated with a mixture of\n  electrolytes","authors":"Siddharth Sambamoorthy and Henry C. W. Chu","authorsParsed":[["Sambamoorthy","Siddharth",""],["Chu","Henry C. W.",""]],"versions":[{"version":"v1","created":"Sun, 1 Dec 2024 02:50:29 GMT"}],"updateDate":"2024-12-03","timestamp":1733021429000,"abstract":"  Current theories of diffusiophoresis in porous media are limited to a porous\nmedium saturated with a valence symmetric electrolyte. A predictive model for\ndiffusiophoresis in porous media saturated with a valence asymmetric\nelectrolyte, or a general mixture of valence symmetric and asymmetric\nelectrolytes, is lacking. To close this knowledge gap, in this work we develop\na mathematical model, based upon the regular perturbation method and numerical\nintegration, to compute the diffusiophoretic mobility of a colloid in porous\nmedia saturated with a general mixture of electrolytes. We model the\nelectrokinetics using the Poisson-Nernst-Planck equations and the fluid\ntransport in porous media using the Brinkman equation with an electric body\nforce. We report three novel key findings. First, we demonstrate that, in the\nsame electrolyte concentration gradient, lowering the permeability of the\nporous medium can significantly weaken the colloid diffusiophoretic motion.\nSecond, we show that, surprisingly, by using a valence asymmetric electrolyte\nthe colloid diffusiophoretic motion in a denser porous medium can be stronger\nthan that in a less dense porous medium saturated with a symmetric electrolyte.\nThird, we demonstrate that varying the composition of an electrolyte mixture\ndoes not only change the strength of the colloid diffusiophoretic motion\ndrastically, but also qualitatively its direction. The model developed from\nthis work can be used to understand and predict natural phenomena such as\nintracellular transport, as well as design technological applications such as\nenhanced oil recovery, nanoparticle drug delivery, and colloidal species\nseparation.\n","subjects":["Condensed Matter/Soft Condensed Matter","Physics/Chemical Physics","Physics/Geophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"lS9Ei9LLHuwwcr-rP8aCnlGFgjGGs4DiHd07SBg5VK8","pdfSize":"980511"}