{
  "id": "2412.17705",
  "title": "Third-Order Exceptional Point in Non-Hermitian Spin-Orbit-Coupled cold\n  atoms",
  "authors": "Yu-Jun Liu, Ka Kwan Pak, Peng Ren, Mengbo Guo, Entong Zhao, Chengdong\n  He, and Gyu-Boong Jo",
  "authorsParsed": [
    [
      "Liu",
      "Yu-Jun",
      ""
    ],
    [
      "Pak",
      "Ka Kwan",
      ""
    ],
    [
      "Ren",
      "Peng",
      ""
    ],
    [
      "Guo",
      "Mengbo",
      ""
    ],
    [
      "Zhao",
      "Entong",
      ""
    ],
    [
      "He",
      "Chengdong",
      ""
    ],
    [
      "Jo",
      "Gyu-Boong",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 16:35:02 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 21 Jan 2025 13:36:30 GMT"
    }
  ],
  "updateDate": "2025-01-22",
  "timestamp": 1734971702000,
  "abstract": "  Exceptional points (EPs) has seen substantial advances in both experiment and\ntheory. However, in quantum systems, higher-order exceptional points remain of\ngreat interest and possess numerous intriguing properties yet to be fully\nexplored. Here, we describe a \\emph{PT} symmetry-protected three-level\nnon-Hermitian system with the dissipative spin-orbit-coupled (SOC) fermions in\nwhich a third-order exceptional point (EP3) emerges when both the eigenvalues\nand eigenstates of the system collapse into one. The band structure and its\nspin dynamics are explored for $^{173}$Yb fermions. We highlight the enhanced\nsensitivity to the external perturbation of EP3 with cubic-root energy\ndispersion. Additionally, we investigate the second-order exceptional point\n(EP2) with square-root energy dispersion in a three-level quantum system with\nthe absence of parity symmetry, which proves that the enhanced sensitivity\nclosely relates to the symmetries of the NH system. Furthermore, we analyze the\nencircling behavior of EP3 in terms of the adiabatic limit and the nonadiabatic\ndynamics and discover some different results from that of EP2.\n",
  "subjects": [
    "Condensed Matter/Quantum Gases",
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "IobcIx5Hp9BCwuI-0wb46-GXZRcoYLJK3ogvu0tOWnA",
  "pdfSize": "9378083"
}