{
  "id": "2412.07487",
  "title": "Stereo Hand-Object Reconstruction for Human-to-Robot Handover",
  "authors": "Yik Lung Pang, Alessio Xompero, Changjae Oh, Andrea Cavallaro",
  "authorsParsed": [
    [
      "Pang",
      "Yik Lung",
      ""
    ],
    [
      "Xompero",
      "Alessio",
      ""
    ],
    [
      "Oh",
      "Changjae",
      ""
    ],
    [
      "Cavallaro",
      "Andrea",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 13:12:32 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733836352000,
  "abstract": "  Jointly estimating hand and object shape ensures the success of the robot\ngrasp in human-to-robot handovers. However, relying on hand-crafted prior\nknowledge about the geometric structure of the object fails when generalising\nto unseen objects, and depth sensors fail to detect transparent objects such as\ndrinking glasses. In this work, we propose a stereo-based method for\nhand-object reconstruction that combines single-view reconstructions\nprobabilistically to form a coherent stereo reconstruction. We learn 3D shape\npriors from a large synthetic hand-object dataset to ensure that our method is\ngeneralisable, and use RGB inputs instead of depth as RGB can better capture\ntransparent objects. We show that our method achieves a lower object Chamfer\ndistance compared to existing RGB based hand-object reconstruction methods on\nsingle view and stereo settings. We process the reconstructed hand-object shape\nwith a projection-based outlier removal step and use the output to guide a\nhuman-to-robot handover pipeline with wide-baseline stereo RGB cameras. Our\nhand-object reconstruction enables a robot to successfully receive a diverse\nrange of household objects from the human.\n",
  "subjects": [
    "Computer Science/Robotics",
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "feAvgNnnwY3JeilD9QBfFh76TvW9X72d4fjaz7ZpCY4",
  "pdfSize": "5475794"
}