{
  "id": "2412.05248",
  "title": "Enhancing FKG.in: automating Indian food composition analysis",
  "authors": "Saransh Kumar Gupta, Lipika Dey, Partha Pratim Das, Geeta\n  Trilok-Kumar, Ramesh Jain",
  "authorsParsed": [
    [
      "Gupta",
      "Saransh Kumar",
      ""
    ],
    [
      "Dey",
      "Lipika",
      ""
    ],
    [
      "Das",
      "Partha Pratim",
      ""
    ],
    [
      "Trilok-Kumar",
      "Geeta",
      ""
    ],
    [
      "Jain",
      "Ramesh",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 18:27:15 GMT"
    },
    {
      "version": "v2",
      "created": "Mon, 9 Dec 2024 09:21:49 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733509635000,
  "abstract": "  This paper presents a novel approach to compute food composition data for\nIndian recipes using a knowledge graph for Indian food (FKG.in) and LLMs. The\nprimary focus is to provide a broad overview of an automated food composition\nanalysis workflow and describe its core functionalities: nutrition data\naggregation, food composition analysis, and LLM-augmented information\nresolution. This workflow aims to complement FKG.in and iteratively supplement\nfood composition data from verified knowledge bases. Additionally, this paper\nhighlights the challenges of representing Indian food and accessing food\ncomposition data digitally. It also reviews three key sources of food\ncomposition data: the Indian Food Composition Tables, the Indian Nutrient\nDatabank, and the Nutritionix API. Furthermore, it briefly outlines how users\ncan interact with the workflow to obtain diet-based health recommendations and\ndetailed food composition information for numerous recipes. We then explore the\ncomplex challenges of analyzing Indian recipe information across dimensions\nsuch as structure, multilingualism, and uncertainty as well as present our\nongoing work on LLM-based solutions to address these issues. The methods\nproposed in this workshop paper for AI-driven knowledge curation and\ninformation resolution are application-agnostic, generalizable, and replicable\nfor any domain.\n",
  "subjects": [
    "Computer Science/Artificial Intelligence",
    "Computer Science/Computation and Language",
    "Computer Science/Information Retrieval"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "8Ipf3cQrWRa_6QBqm8VstNuLqmhM428JQRzoS7n9TUM",
  "pdfSize": "681288"
}