{"id":"2412.15690","title":"Theory of Mixture-of-Experts for Mobile Edge Computing","authors":"Hongbo Li and Lingjie Duan","authorsParsed":[["Li","Hongbo",""],["Duan","Lingjie",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 09:09:10 GMT"}],"updateDate":"2024-12-23","timestamp":1734685750000,"abstract":"  In mobile edge computing (MEC) networks, mobile users generate diverse\nmachine learning tasks dynamically over time. These tasks are typically\noffloaded to the nearest available edge server, by considering communication\nand computational efficiency. However, its operation does not ensure that each\nserver specializes in a specific type of tasks and leads to severe overfitting\nor catastrophic forgetting of previous tasks. To improve the continual learning\n(CL) performance of online tasks, we are the first to introduce\nmixture-of-experts (MoE) theory in MEC networks and save MEC operation from the\nincreasing generalization error over time. Our MoE theory treats each MEC\nserver as an expert and dynamically adapts to changes in server availability by\nconsidering data transfer and computation time. Unlike existing MoE models\ndesigned for offline tasks, ours is tailored for handling continuous streams of\ntasks in the MEC environment. We introduce an adaptive gating network in MEC to\nadaptively identify and route newly arrived tasks of unknown data distributions\nto available experts, enabling each expert to specialize in a specific type of\ntasks upon convergence. We derived the minimum number of experts required to\nmatch each task with a specialized, available expert. Our MoE approach\nconsistently reduces the overall generalization error over time, unlike the\ntraditional MEC approach. Interestingly, when the number of experts is\nsufficient to ensure convergence, adding more experts delays the convergence\ntime and worsens the generalization error. Finally, we perform extensive\nexperiments on real datasets in deep neural networks (DNNs) to verify our\ntheoretical results.\n","subjects":["Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ky8pa9LssiDGlps2JHZ8WLCjmkZd4QOVoQvkg2DXDHQ","pdfSize":"961314"}