{"id":"2412.02986","title":"Bayesian Transfer Learning for Enhanced Estimation and Inference","authors":"Daoyuan Lai, Oscar Hernan Madrid Padilla, Tian Gu","authorsParsed":[["Lai","Daoyuan",""],["Padilla","Oscar Hernan Madrid",""],["Gu","Tian",""]],"versions":[{"version":"v1","created":"Wed, 4 Dec 2024 02:59:20 GMT"}],"updateDate":"2024-12-05","timestamp":1733281160000,"abstract":"  Transfer learning enhances model performance in a target population with\nlimited samples by leveraging knowledge from related studies. While many works\nfocus on improving predictive performance, challenges of statistical inference\npersist. Bayesian approaches naturally offer uncertainty quantification for\nparameter estimates, yet existing Bayesian transfer learning methods are\ntypically limited to single-source scenarios or require individual-level data.\nWe introduce TRansfer leArning via guideD horseshoE prioR (TRADER), a novel\napproach enabling multi-source transfer through pre-trained models in\nhigh-dimensional linear regression. TRADER shrinks target parameters towards a\nweighted average of source estimates, accommodating sources with different\nscales. Theoretical investigation shows that TRADER achieves faster posterior\ncontraction rates than standard continuous shrinkage priors when sources align\nwell with the target while preventing negative transfer from heterogeneous\nsources. The analysis of finite-sample marginal posterior behavior reveals that\nTRADER achieves desired frequentist coverage probabilities, even for\ncoefficients with moderate signal strength--a scenario where standard\ncontinuous shrinkage priors struggle. Extensive numerical studies and a\nreal-data application estimating the association between blood glucose and\ninsulin use in the Hispanic diabetic population demonstrate that TRADER\nimproves estimation and inference accuracy over continuous shrinkage priors\nusing target data alone, while outperforming a state-of-the-art transfer\nlearning method that requires individual-level data.\n","subjects":["Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"qvx9d0rTMTu_HOgjo3aNp310lI5IIDLOCDc1cOGyi30","pdfSize":"2923268"}