{"id":"2412.03046","title":"Real-time Dynamics of Soft Manipulators with Cross-section Inflation:\n  Application to the Octopus Muscular Hydrostat","authors":"Yuchen Sun, Anup Teejo Mathew, Imran Afgan, Federico Renda, Cecilia\n  Laschi","authorsParsed":[["Sun","Yuchen",""],["Mathew","Anup Teejo",""],["Afgan","Imran",""],["Renda","Federico",""],["Laschi","Cecilia",""]],"versions":[{"version":"v1","created":"Wed, 4 Dec 2024 05:52:28 GMT"}],"updateDate":"2024-12-05","timestamp":1733291548000,"abstract":"  Inspired by the embodied intelligence of biological creatures like the\noctopus, the soft robotic arm utilizes its highly flexible structure to perform\nvarious tasks in the complex environment. While the classic Cosserat rod theory\ninvestigates the bending, twisting, shearing, and stretching of the soft arm,\nit fails to capture the in-plane deformation that occurs during certain tasks,\nparticularly those involving active lateral traction. This paper introduces an\nextended Cosserat rod theory addressing these limitations by incorporating an\nextra strain variable reflecting the in-plane inflation ratio. To accurately\ndescribe the viscoelasticity effect of the soft body in dynamics, the proposed\nmodel enhances the constitutive law by integrating the Saint-Venant Kirchhoff\nhyperelastic and Kelvin-Voigt viscous models. The active and environmental\nloads are accounted for the equations of motion, which are numerically solved\nby adapting the Geometric Variable Strain (GVS) approach to balance the\naccuracy and computational efficiency. Our contributions include the derivation\nof the extended Cosserat rod theory in dynamic context, and the development of\na reduced-order numerical method that enables rapid and precise solutions. We\ndemonstrate applications of the model in stiffness tuning of a soft robotic arm\nand the study of complex octopus' arm motions.\n","subjects":["Computer Science/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"yPryAGlkQoUmXy2RH8tSSKNphImv1_JcZH1fmR6H5bY","pdfSize":"4092001"}