{
  "id": "2412.14992",
  "title": "Field-dependent diffeomorphisms and the transformation of surface\n  charges between gauges",
  "authors": "Luca Ciambelli, Marc Geiller",
  "authorsParsed": [
    [
      "Ciambelli",
      "Luca",
      ""
    ],
    [
      "Geiller",
      "Marc",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 16:04:59 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734624299000,
  "abstract": "  When studying gauge theories in the presence of boundaries, local symmetry\ntransformations are typically classified as gauge or physical depending on\nwhether the associated charges vanish or not. Here, we propose that physical\ncharges should further be refined into \"dynamical\" or \"kinematical\" depending\non whether they are associated with flux-balance laws or not. To support this\nproposal, we analyze (A)dS$_3$ gravity with boundary Weyl rescalings and\ncompare the solution spaces in Bondi-Sachs and Fefferman-Graham coordinates.\nOur results show that the Weyl charge vanishes in the Bondi-Sachs gauge but not\nin the Fefferman-Graham gauge. Conversely, the charges arising from the metric\nChern-Simons Lagrangian behave in the opposite way. This indicates that the\ngauge-dependent Weyl charge differs fundamentally from charges like mass and\nangular momentum. This interpretation is reinforced by two key observations:\nthe Weyl conformal factor does not satisfy any flux-balance law, and the\nassociated charge arises from a corner term in the symplectic structure. These\nproperties justify assigning the Weyl charge a kinematical status. These\nresults can also be derived using the field-dependent diffeomorphism that maps\nbetween the two gauges. Importantly, this diffeomorphism does not act\ntensorially on the variational bi-complex due to its field dependency, and is\nable to \"toggle\" charges on or off. This provides an example of a large\ndiffeomorphism $\\textit{between}$ gauges, as opposed to a residual\ndiffeomorphism $\\textit{within}$ a gauge.\n",
  "subjects": [
    "Physics/High Energy Physics - Theory",
    "Physics/General Relativity and Quantum Cosmology"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Lk5A3aaBfs26BOxmPbvVSQxsNzHswQf50Toz0NilNTs",
  "pdfSize": "528597"
}