{"id":"2412.14930","title":"Emergence of unidirectionality and phase separation in optically dense\n  emitter ensembles","authors":"Kasper J. Kusmierek, Max Schemmer, Sahand Mahmoodian, Klemens Hammerer","authorsParsed":[["Kusmierek","Kasper J.",""],["Schemmer","Max",""],["Mahmoodian","Sahand",""],["Hammerer","Klemens",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 15:07:22 GMT"}],"updateDate":"2024-12-20","timestamp":1734620842000,"abstract":"  The transmission of light through an ensemble of two-level emitters in a\none-dimensional geometry is commonly described by one of two emblematic models\nof quantum electrodynamics (QED): the driven-dissipative Dicke model or the\nMaxwell-Bloch equations. Both exhibit distinct features of phase transitions\nand phase separations, depending on system parameters such as optical depth and\nexternal drive strength. Here, we explore the crossover between these models\nvia a parent spin model from bidirectional waveguide QED, by varying positional\ndisorder among emitters. Solving mean-field equations and employing a\nsecond-order cumulant expansion for the unidirectional model -- equivalent to\nthe Maxwell-Bloch equations -- we study phase diagrams, the emitter's\ninversion, and transmission depending on optical depth, drive strength, and\nspatial disorder. We find in the thermodynamic limit the emergence of phase\nseparation with a critical value that depends on the degree of spatial order\nbut is independent of inhomogeneous broadening effects. Even far from the\nthermodynamic limit, this critical value marks a special point in the emitter's\ncorrelation landscape of the unidirectional model and is also observed as a\nmaximum in the magnitude of inelastically transmitted photons. We conclude that\na large class of effective one-dimensional systems without tight control of the\nemitter's spatial ordering can be effectively modeled using a unidirectional\nwaveguide approach.\n","subjects":["Physics/Quantum Physics","Physics/Atomic Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"HMwDLCZgC76DXaLKrjHXRYSxxlzfseNIXAc7YCp1x74","pdfSize":"1668901"}