{"id":"2412.11325","title":"Sonicmesh: Enhancing 3D Human Mesh Reconstruction in Vision-Impaired\n  Environments With Acoustic Signals","authors":"Xiaoxuan Liang, Wuyang Zhang, Hong Zhou, Zhaolong Wei, Sicheng Zhu,\n  Yansong Li, Rui Yin, Jiantao Yuan, Jeremy Gummeson","authorsParsed":[["Liang","Xiaoxuan",""],["Zhang","Wuyang",""],["Zhou","Hong",""],["Wei","Zhaolong",""],["Zhu","Sicheng",""],["Li","Yansong",""],["Yin","Rui",""],["Yuan","Jiantao",""],["Gummeson","Jeremy",""]],"versions":[{"version":"v1","created":"Sun, 15 Dec 2024 22:04:26 GMT"}],"updateDate":"2024-12-17","timestamp":1734300266000,"abstract":"  3D Human Mesh Reconstruction (HMR) from 2D RGB images faces challenges in\nenvironments with poor lighting, privacy concerns, or occlusions. These\nweaknesses of RGB imaging can be complemented by acoustic signals, which are\nwidely available, easy to deploy, and capable of penetrating obstacles.\nHowever, no existing methods effectively combine acoustic signals with RGB data\nfor robust 3D HMR. The primary challenges include the low-resolution images\ngenerated by acoustic signals and the lack of dedicated processing backbones.\nWe introduce SonicMesh, a novel approach combining acoustic signals with RGB\nimages to reconstruct 3D human mesh. To address the challenges of low\nresolution and the absence of dedicated processing backbones in images\ngenerated by acoustic signals, we modify an existing method, HRNet, for\neffective feature extraction. We also integrate a universal feature embedding\ntechnique to enhance the precision of cross-dimensional feature alignment,\nenabling SonicMesh to achieve high accuracy. Experimental results demonstrate\nthat SonicMesh accurately reconstructs 3D human mesh in challenging\nenvironments such as occlusions, non-line-of-sight scenarios, and poor\nlighting.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Sound","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"m3Z3UlDZTlcn_MoUoW4GJfVrDaUQXH6qeOZRiKP6slc","pdfSize":"7814447"}