{
  "id": "2412.16605",
  "title": "Two direct sampling methods for an anisotropic scatterer with a\n  conductive boundary",
  "authors": "Isaac Harris, Victor Hughes, and Andreas Kleefeld",
  "authorsParsed": [
    [
      "Harris",
      "Isaac",
      ""
    ],
    [
      "Hughes",
      "Victor",
      ""
    ],
    [
      "Kleefeld",
      "Andreas",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 21 Dec 2024 12:34:41 GMT"
    },
    {
      "version": "v2",
      "created": "Wed, 8 Jan 2025 20:24:54 GMT"
    }
  ],
  "updateDate": "2025-01-10",
  "timestamp": 1734784481000,
  "abstract": "  In this paper, we consider the inverse scattering problem associated with an\nanisotropic medium with a conductive boundary condition. We will assume that\nthe corresponding far--field pattern or Cauchy data is either known or\nmeasured. The conductive boundary condition models a thin coating around the\nboundary of the scatterer. We will develop two direct sampling methods to solve\nthe inverse shape problem by numerically recovering the scatterer. To this end,\nwe study direct sampling methods by deriving that the corresponding imaging\nfunctionals decay as the sampling point moves away from the scatterer. These\nmethods have been applied to other inverse shape problems, but this is the\nfirst time they will be applied to an anisotropic scatterer with a conductive\nboundary condition. These methods allow one to recover the scatterer by\nconsidering an inner--product of the far--field data or the Cauchy data. Here,\nwe will assume that the Cauchy data is known on the boundary of a region\n$\\Omega$ that completely encloses the scatterer $D$. We present numerical\nreconstructions in two dimensions to validate our theoretical results for both\ncircular and non-circular scatterers.\n",
  "subjects": [
    "Mathematics/Analysis of PDEs"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "NXOoQ9GXsNU7KHoeO_WsF0Mviwhj4I1fv9Gl5c756RA",
  "pdfSize": "1283216"
}