{"id":"2412.09368","title":"Synchrotron X-Ray Multi-Projection Imaging for Multiphase Flow","authors":"Tomas Ros\\'en, Zisheng Yao, Jonas Tejbo, Patrick Wegele, Julia K.\n  Rogalinski, Frida Nilsson, Kannara Mom, Zhe Hu, Samuel A. McDonald, Kim\n  Nyg{\\aa}rd, Andrea Mazzolari, Alexander Groetsch, Korneliya Gordeyeva, L.\n  Daniel S\\\"oderberg, Fredrik Lundell, Lisa Prahl Wittberg, Eleni Myrto\n  Asimakopoulou, Pablo Villanueva-Perez","authorsParsed":[["Rosén","Tomas",""],["Yao","Zisheng",""],["Tejbo","Jonas",""],["Wegele","Patrick",""],["Rogalinski","Julia K.",""],["Nilsson","Frida",""],["Mom","Kannara",""],["Hu","Zhe",""],["McDonald","Samuel A.",""],["Nygård","Kim",""],["Mazzolari","Andrea",""],["Groetsch","Alexander",""],["Gordeyeva","Korneliya",""],["Söderberg","L. Daniel",""],["Lundell","Fredrik",""],["Wittberg","Lisa Prahl",""],["Asimakopoulou","Eleni Myrto",""],["Villanueva-Perez","Pablo",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 15:36:09 GMT"}],"updateDate":"2024-12-13","timestamp":1734017769000,"abstract":"  Multiphase flows, characterized by the presence of particles, bubbles, or\ndroplets dispersed within a fluid, are ubiquitous in natural and industrial\nprocesses. Studying densely dispersed flows in 4D (3D + time) at very small\nscales without introducing perturbations is challenging, but crucial to\nunderstand their macroscopic behavior. The penetration power of X-rays and the\nflux provided by advanced X-ray sources, such as synchrotron-radiation\nfacilities, offer an opportunity to address this need. However, current X-ray\nmethods at these facilities require the rotation of the sample to obtain 4D\ninformation, thus disturbing the flow. Here, we demonstrate the potential of\nusing X-ray Multi-Projection Imaging (XMPI), a novel technique to temporally\nresolve any dense particle suspension flows in 4D, while eliminating the need\nof sample rotation. By acquiring images of a microparticle-seeded flow from\nmultiple viewing directions simultaneously, we can determine their\ninstantaneous three-dimensional positions, both when flowing in a simple liquid\nand a highly dense and opaque complex fluid (e.g. blood). Along with the recent\nprogress in AI-supported 4D reconstruction from sparse projections, this\napproach creates new opportunities for high-speed rotation-free 4D\nmicrotomography, opening a new spatiotemporal frontier. With XMPI, it is now\nfeasible to track the movement of individual microparticles within dense\nsuspensions, extending even to the chaotic realms of turbulent flows.\n","subjects":["Physics/Fluid Dynamics","Condensed Matter/Soft Condensed Matter"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"hYhJo9Sf1KIj4_pN1gK-e_Y-8_vBESxDYJJFBATjbSs","pdfSize":"2050498"}