{
  "id": "2412.02688",
  "title": "Molecular gas and dust properties in $z>7$ quasar hosts",
  "authors": "Francesco Salvestrini, Chiara Feruglio, Roberta Tripodi, Fabio\n  Fontanot, Manuela Bischetti, Gabriella De Lucia, Fabrizio Fiore, Michaela\n  Hirschmann, Umberto Maio, Enrico Piconcelli, Ivano Saccheo, Alessia Tortosa,\n  Rosa Valiante, Lizhi Xie, and Luca Zappacosta",
  "authorsParsed": [
    [
      "Salvestrini",
      "Francesco",
      ""
    ],
    [
      "Feruglio",
      "Chiara",
      ""
    ],
    [
      "Tripodi",
      "Roberta",
      ""
    ],
    [
      "Fontanot",
      "Fabio",
      ""
    ],
    [
      "Bischetti",
      "Manuela",
      ""
    ],
    [
      "De Lucia",
      "Gabriella",
      ""
    ],
    [
      "Fiore",
      "Fabrizio",
      ""
    ],
    [
      "Hirschmann",
      "Michaela",
      ""
    ],
    [
      "Maio",
      "Umberto",
      ""
    ],
    [
      "Piconcelli",
      "Enrico",
      ""
    ],
    [
      "Saccheo",
      "Ivano",
      ""
    ],
    [
      "Tortosa",
      "Alessia",
      ""
    ],
    [
      "Valiante",
      "Rosa",
      ""
    ],
    [
      "Xie",
      "Lizhi",
      ""
    ],
    [
      "Zappacosta",
      "Luca",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 18:57:41 GMT"
    },
    {
      "version": "v2",
      "created": "Mon, 9 Dec 2024 16:15:39 GMT"
    },
    {
      "version": "v3",
      "created": "Tue, 18 Feb 2025 23:33:08 GMT"
    }
  ],
  "updateDate": "2025-02-20",
  "timestamp": 1733252261000,
  "abstract": "  Observational campaigns hunting the elusive reservoirs of cold gas in the\nhost galaxies of quasars at the epoch of reionization (EoR) are crucial for\nstudying the formation and evolution of the first massive systems at early\nepochs.\n  We present new Northern Extended Millimeter Array (NOEMA) observations\ntracing CO(6--5) and CO(7--6) emission lines as well as the underlying\ncontinuum in five of the eight quasars at redshift $z>7$ known to date, thus\ncompleting the survey of the cold molecular gas reservoir in the host galaxies\nof the first quasars.\n  Combining NOEMA observations with archival Atacama Large\nMillimeter/submillimeter Array (ALMA) data, we modeled the far-infrared\nspectral energy distribution with a modified blackbody function to measure dust\nproperties and star formation rates.\n  We used CO and [CII] lines to derive molecular gas masses, which we compared\nwith results from semi-analytic models and observations of galaxies at\ndifferent epochs.\n  No statistically significant detection of CO emission lines was reported for\nthe five quasars in this sample, resulting in a relatively low amount of cold\nmolecular gas in the host when compared with galaxies at later epochs.\n  Nonetheless, gas-to-dust ratios are consistent with the local value,\nsuggesting that the scaling relation between dust and cold gas holds up to\n$z>7$.\n  Quasars at the EoR show star formation efficiencies that are among the\nhighest observed so far and comparable with those observed in luminous quasars\nat Cosmic Noon and those predicted for the brightest ($L_{bol}>3\\times10^{46}$\nerg s$^-1$) quasar objects drawn from the semi-analytic model GAEA.\n  Quasar host galaxies at the EoR are undergoing an intense phase of star\nformation, which suggests a strong coupling between the luminous phase of the\nquasar and the rapid growth of the host.\n",
  "subjects": [
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "2htqlsgnnwL68sTX8bhdwiVYHVRRIbDFQ211i5HQIoY",
  "pdfSize": "14058867"
}