{"id":"2412.14554","title":"The Current Challenges of Software Engineering in the Era of Large\n  Language Models","authors":"Cuiyun Gao, Xing Hu, Shan Gao, Xin Xia, Zhi Jin","authorsParsed":[["Gao","Cuiyun",""],["Hu","Xing",""],["Gao","Shan",""],["Xia","Xin",""],["Jin","Zhi",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 06:10:40 GMT"},{"version":"v2","created":"Fri, 27 Dec 2024 10:17:12 GMT"}],"updateDate":"2024-12-30","timestamp":1734588640000,"abstract":"  With the advent of large language models (LLMs) in the artificial\nintelligence (AI) area, the field of software engineering (SE) has also\nwitnessed a paradigm shift. These models, by leveraging the power of deep\nlearning and massive amounts of data, have demonstrated an unprecedented\ncapacity to understand, generate, and operate programming languages. They can\nassist developers in completing a broad spectrum of software development\nactivities, encompassing software design, automated programming, and\nmaintenance, which potentially reduces huge human efforts. Integrating LLMs\nwithin the SE landscape (LLM4SE) has become a burgeoning trend, necessitating\nexploring this emergent landscape's challenges and opportunities.\n  The paper aims at revisiting the software development life cycle (SDLC) under\nLLMs, and highlighting challenges and opportunities of the new paradigm. The\npaper first summarizes the overall process of LLM4SE, and then elaborates on\nthe current challenges based on a through discussion. The discussion was held\namong more than 20 participants from academia and industry, specializing in\nfields such as software engineering and artificial intelligence. Specifically,\nwe achieve 26 key challenges from seven aspects, including software requirement\n& design, coding assistance, testing code generation, code review, code\nmaintenance, software vulnerability management, and data, training, and\nevaluation. We hope the achieved challenges would benefit future research in\nthe LLM4SE field.\n","subjects":["Computer Science/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"qgGVam6niBSQei9PMAphMNlEODoogypE_Pn_QGLUwqQ","pdfSize":"849064"}