{"id":"2412.05396","title":"An RNA condensate model for the origin of life","authors":"Jacob L. Fine and Alan M. Moses","authorsParsed":[["Fine","Jacob L.",""],["Moses","Alan M.",""]],"versions":[{"version":"v1","created":"Fri, 6 Dec 2024 19:41:27 GMT"}],"updateDate":"2024-12-10","timestamp":1733514087000,"abstract":"  The RNA World hypothesis predicts that self-replicating RNAs evolved before\nDNA genomes and coded proteins. Despite widespread support for the RNA World,\nself-replicating RNAs have yet to be identified in a natural context, leaving a\nkey 'missing link' for this explanation of the origin of life. Inspired by\nrecent work showing that condensates of charged polymers can create\nelectrochemical gradients capable of catalyzing hydrolysis, we consider a\ncatalytic RNA condensate as a candidate for the self-replicating RNA. We\ndevelop a theoretical framework where an RNA condensate formed by the\nspontaneous demixing of disordered RNA sequences undergoes self-replicative\namplification. Our theory addresses two central problems in the origins of\nlife: (i) the origin of compartmentalization and (ii) the error threshold for\nthe accuracy of templated replication. We show that many of the needed\nproperties of this self-replicating RNA condensate have been realized\nexperimentally in recent studies and can be formalized within a standard\npolymer physics framework. Specifically, we propose that short, low-complexity\nRNA polymers formed catalytic condensates capable of templated RNA\npolymerization. Because the condensate properties depend on the RNA sequences,\nRNAs that formed condensates with improved polymerization and demixing capacity\nwould be amplified, leading to a 'condensate chain reaction' and evolution by\nnatural selection. We believe this prediction could be tested with current\nexperimental and theoretical tools. Furthermore, we note that the extant\nnucleolus appears to satisfy many of the requirements of an evolutionary relic\nfor the model we propose. More generally, we suggest that future work on the\norigin of life would benefit from condensate-centric biophysical models of RNA\nevolution.\n","subjects":["Quantitative Biology/Biomolecules"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"wpgA1XD_4oZ58s2-dITDurbIlAiKsJoJz6mGsbUg4c8","pdfSize":"1282723"}