{"id":"2412.11450","title":"GroupFace: Imbalanced Age Estimation Based on Multi-hop Attention Graph\n  Convolutional Network and Group-aware Margin Optimization","authors":"Yiping Zhang, Yuntao Shou, Wei Ai, Tao Meng, and Keqin Li","authorsParsed":[["Zhang","Yiping",""],["Shou","Yuntao",""],["Ai","Wei",""],["Meng","Tao",""],["Li","Keqin",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 05:08:15 GMT"}],"updateDate":"2024-12-17","timestamp":1734325695000,"abstract":"  With the recent advances in computer vision, age estimation has significantly\nimproved in overall accuracy. However, owing to the most common methods do not\ntake into account the class imbalance problem in age estimation datasets, they\nsuffer from a large bias in recognizing long-tailed groups. To achieve\nhigh-quality imbalanced learning in long-tailed groups, the dominant solution\nlies in that the feature extractor learns the discriminative features of\ndifferent groups and the classifier is able to provide appropriate and unbiased\nmargins for different groups by the discriminative features. Therefore, in this\nnovel, we propose an innovative collaborative learning framework (GroupFace)\nthat integrates a multi-hop attention graph convolutional network and a dynamic\ngroup-aware margin strategy based on reinforcement learning. Specifically, to\nextract the discriminative features of different groups, we design an enhanced\nmulti-hop attention graph convolutional network. This network is capable of\ncapturing the interactions of neighboring nodes at different distances, fusing\nlocal and global information to model facial deep aging, and exploring diverse\nrepresentations of different groups. In addition, to further address the class\nimbalance problem, we design a dynamic group-aware margin strategy based on\nreinforcement learning to provide appropriate and unbiased margins for\ndifferent groups. The strategy divides the sample into four age groups and\nconsiders identifying the optimum margins for various age groups by employing a\nMarkov decision process. Under the guidance of the agent, the feature\nrepresentation bias and the classification margin deviation between different\ngroups can be reduced simultaneously, balancing inter-class separability and\nintra-class proximity. After joint optimization, our architecture achieves\nexcellent performance on several age estimation benchmark datasets.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"VIi8lTac9VgSnCz36w2J50dFi9jCB4LGcwU6BtCxsmk","pdfSize":"4712642"}