{
  "id": "2412.19850",
  "title": "The Patterns of Digital Deception",
  "authors": "Gregory M. Dickinson",
  "authorsParsed": [
    [
      "Dickinson",
      "Gregory M.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 25 Dec 2024 15:55:17 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735142117000,
  "abstract": "  Current consumer-protection debates focus on the powerful new data-analysis\ntechniques that have disrupted the balance of power between companies and their\ncustomers. Online tracking enables sellers to amass troves of historical data,\napply machine-learning tools to construct detailed customer profiles, and\ntarget those customers with tailored offers that best suit their interests. It\nis often a win-win. Sellers avoid pumping dud products and consumers see ads\nfor things they actually want to buy. But the same tools are also used for ill\n-- to target vulnerable members of the population with scams specially tailored\nto prey on their weaknesses. The result has been a dramatic rise in online\nfraud that disproportionately impacts those least able to bear the loss.\n  The law's response has been technology centric. Lawmakers race to identify\nthose technologies that drive consumer deception and target them for regulatory\nrestrictions. But that approach comes at a major cost. General-purpose\ndata-analysis and communications tools have both desirable and undesirable\nuses, and uniform restrictions on their use impede the good along with the bad.\nA superior approach would focus not on the technological tools of deception but\non what this Article identifies as the legal patterns of digital deception --\nthose aspects of digital technology that have outflanked the law's existing\nmechanisms for redressing consumer harm. This Article reorients the discussion\nfrom the power of new technologies to the shortcomings in existing regulatory\nstructures that have allowed for their abuse. Focus on these patterns of\ndeception will allow regulators to reallocate resources to offset those\nshortcomings and thereby enhance efforts to combat online fraud without\nimpeding technological innovation.\n",
  "subjects": [
    "Economics/General Economics",
    "Computer Science/Computers and Society",
    "Quantitative Finance/Economics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "ZyreuVoFLaQj4i6-ZzugGMYssQeifRKnMSRUpfCmWHA",
  "pdfSize": "778105"
}