{
  "id": "2412.15316",
  "title": "von Neumann entropy and quantum version of thermodynamic entropy",
  "authors": "Smitarani Mishra and Shaon Sahoo",
  "authorsParsed": [
    [
      "Mishra",
      "Smitarani",
      ""
    ],
    [
      "Sahoo",
      "Shaon",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 17:51:44 GMT"
    },
    {
      "version": "v2",
      "created": "Sat, 18 Jan 2025 11:31:40 GMT"
    }
  ],
  "updateDate": "2025-01-22",
  "timestamp": 1734630704000,
  "abstract": "  The debate whether the von Neumann (VN) entropy is a suitable quantum version\nof the thermodynamic (TH) entropy has a long history. In this regard, we\nbriefly review some of the main reservations about the VN entropy and explain\nthat the objections about its time-invariance and subadditivity properties can\nbe addressed convincingly. In a broader context, we here analyze in detail\nwhether and when the VN entropy is the same or equivalent to the TH entropy. We\nfind that the VN entropy of a large isolated system is equivalent to its TH\nentropy if the system is in a mixed state described by a microcanonical (MC)\nensemble. This equivalence also holds for open system and subsystem if the full\nsystem (i.e. system-bath or subsystem-bath combination) is in a mixed state\ndescribed by an MC ensemble or in a {\\it typical} pure state (or if the {\\it\nEigenstate Thermalization Hypothesis}, {\\it ETH}, holds for the full system).\nUnlike isolated and open system, demonstrating the equivalence for a subsystem\nis not straightforward. We take a one-dimensional spin-1/2 model to numerically\nshow that, if the full system is in a pure state, then the VN entropy of a\nsubsystem is equivalent to its TH entropy if the {\\it ETH} holds for the full\nsystem. We also demonstrate that this equivalence always works (irrespective of\nwhether the {\\it ETH} holds) if the full system is in a mixed state describe by\nan MC ensemble.\n",
  "subjects": [
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Q3O2fi8h7jTIUh8IpolDMJkqCe9O2u2tk4SRkxKcEHI",
  "pdfSize": "2746374"
}