{
  "id": "2412.16452",
  "title": "Sharp Results for Hypothesis Testing with Risk-Sensitive Agents",
  "authors": "Flora C. Shi, Stephen Bates, Martin J. Wainwright",
  "authorsParsed": [
    [
      "Shi",
      "Flora C.",
      ""
    ],
    [
      "Bates",
      "Stephen",
      ""
    ],
    [
      "Wainwright",
      "Martin J.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 21 Dec 2024 02:51:56 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734749516000,
  "abstract": "  Statistical protocols are often used for decision-making involving multiple\nparties, each with their own incentives, private information, and ability to\ninfluence the distributional properties of the data. We study a game-theoretic\nversion of hypothesis testing in which a statistician, also known as a\nprincipal, interacts with strategic agents that can generate data. The\nstatistician seeks to design a testing protocol with controlled error, while\nthe data-generating agents, guided by their utility and prior information,\nchoose whether or not to opt in based on expected utility maximization. This\nstrategic behavior affects the data observed by the statistician and,\nconsequently, the associated testing error. We analyze this problem for general\nconcave and monotonic utility functions and prove an upper bound on the Bayes\nfalse discovery rate (FDR). Underlying this bound is a form of prior\nelicitation: we show how an agent's choice to opt in implies a certain upper\nbound on their prior null probability. Our FDR bound is unimprovable in a\nstrong sense, achieving equality at a single point for an individual agent and\nat any countable number of points for a population of agents. We also\ndemonstrate that our testing protocols exhibit a desirable maximin property\nwhen the principal's utility is considered. To illustrate the qualitative\npredictions of our theory, we examine the effects of risk aversion, reward\nstochasticity, and signal-to-noise ratio, as well as the implications for the\nFood and Drug Administration's testing protocols.\n",
  "subjects": [
    "Statistics/Methodology",
    "Computer Science/Computer Science and Game Theory",
    "Computer Science/Machine Learning",
    "Economics/Econometrics",
    "Mathematics/Statistics Theory",
    "Statistics/Statistics Theory"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "gU59hXP_512nrIi-gO2L_x6CkVPmyDnX38VOHRWxZ4I",
  "pdfSize": "857665"
}