{"id":"2412.07741","title":"Image Retrieval with Intra-Sweep Representation Learning for Neck\n  Ultrasound Scanning Guidance","authors":"Wanwen Chen, Adam Schmidt, Eitan Prisman and Septimiu E. Salcudean","authorsParsed":[["Chen","Wanwen",""],["Schmidt","Adam",""],["Prisman","Eitan",""],["Salcudean","Septimiu E.",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 18:39:33 GMT"}],"updateDate":"2024-12-11","timestamp":1733855973000,"abstract":"  Purpose: Intraoperative ultrasound (US) can enhance real-time visualization\nin transoral robotic surgery. The surgeon creates a mental map with a\npre-operative scan. Then, a surgical assistant performs freehand US scanning\nduring the surgery while the surgeon operates at the remote surgical console.\nCommunicating the target scanning plane in the surgeon's mental map is\ndifficult. Automatic image retrieval can help match intraoperative images to\npreoperative scans, guiding the assistant to adjust the US probe toward the\ntarget plane. Methods: We propose a self-supervised contrastive learning\napproach to match intraoperative US views to a preoperative image database. We\nintroduce a novel contrastive learning strategy that leverages intra-sweep\nsimilarity and US probe location to improve feature encoding. Additionally, our\nmodel incorporates a flexible threshold to reject unsatisfactory matches.\nResults: Our method achieves 92.30% retrieval accuracy on simulated data and\noutperforms state-of-the-art temporal-based contrastive learning approaches.\nOur ablation study demonstrates that using probe location in the optimization\ngoal improves image representation, suggesting that semantic information can be\nextracted from probe location. We also present our approach on real patient\ndata to show the feasibility of the proposed US probe localization system\ndespite tissue deformation from tongue retraction. Conclusion: Our contrastive\nlearning method, which utilizes intra-sweep similarity and US probe location,\nenhances US image representation learning. We also demonstrate the feasibility\nof using our image retrieval method to provide neck US localization on real\npatient US after tongue retraction.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"5pjdL-VfWycc6CjT6yQh64XPC7BvroLrUSPMOwlyaCM","pdfSize":"2978540"}