{"id":"2412.07136","title":"A multimodal ensemble approach for clear cell renal cell carcinoma\n  treatment outcome prediction","authors":"Meixu Chen, Kai Wang, Payal Kapur, James Brugarolas, Raquibul Hannan,\n  Jing Wang","authorsParsed":[["Chen","Meixu",""],["Wang","Kai",""],["Kapur","Payal",""],["Brugarolas","James",""],["Hannan","Raquibul",""],["Wang","Jing",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 02:51:14 GMT"}],"updateDate":"2024-12-11","timestamp":1733799074000,"abstract":"  Purpose: A reliable cancer prognosis model for clear cell renal cell\ncarcinoma (ccRCC) can enhance personalized treatment. We developed a\nmulti-modal ensemble model (MMEM) that integrates pretreatment clinical data,\nmulti-omics data, and histopathology whole slide image (WSI) data to predict\noverall survival (OS) and disease-free survival (DFS) for ccRCC patients.\nMethods: We analyzed 226 patients from The Cancer Genome Atlas Kidney Renal\nClear Cell Carcinoma (TCGA-KIRC) dataset, which includes OS, DFS follow-up\ndata, and five data modalities: clinical data, WSIs, and three multi-omics\ndatasets (mRNA, miRNA, and DNA methylation). Separate survival models were\nbuilt for OS and DFS. Cox-proportional hazards (CPH) model with forward feature\nselection is used for clinical and multi-omics data. Features from WSIs were\nextracted using ResNet and three general-purpose foundation models. A deep\nlearning-based CPH model predicted survival using encoded WSI features. Risk\nscores from all models were combined based on training performance. Results:\nPerformance was assessed using concordance index (C-index) and AUROC. The\nclinical feature-based CPH model received the highest weight for both OS and\nDFS tasks. Among WSI-based models, the general-purpose foundation model (UNI)\nachieved the best performance. The final MMEM model surpassed single-modality\nmodels, achieving C-indices of 0.820 (OS) and 0.833 (DFS), and AUROC values of\n0.831 (3-year patient death) and 0.862 (cancer recurrence). Using predicted\nrisk medians to stratify high- and low-risk groups, log-rank tests showed\nimproved performance in both OS and DFS compared to single-modality models.\nConclusion: MMEM is the first multi-modal model for ccRCC patients, integrating\nfive data modalities. It outperformed single-modality models in prognostic\nability and has the potential to assist in ccRCC patient management if\nindependently validated.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Quantitative Biology/Quantitative Methods"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"-g59ILqcCgQbvHOh6NrlKMZEXxNtjVR_IDxkh35aVsI","pdfSize":"1828038"}