{
  "id": "2412.21086",
  "title": "Co-diffusion of hydrogen and oxygen for dense oxyhydride synthesis",
  "authors": "Masaya Fujioka, Mihiro Hoshino, Suguru Iwasaki, Katsuhiro Nomura, Aman\n  Sharma, Mineyuki Hattori, Reina Utsumi, Yuki Nakahira, Hiroyuki Saitoh",
  "authorsParsed": [
    [
      "Fujioka",
      "Masaya",
      ""
    ],
    [
      "Hoshino",
      "Mihiro",
      ""
    ],
    [
      "Iwasaki",
      "Suguru",
      ""
    ],
    [
      "Nomura",
      "Katsuhiro",
      ""
    ],
    [
      "Sharma",
      "Aman",
      ""
    ],
    [
      "Hattori",
      "Mineyuki",
      ""
    ],
    [
      "Utsumi",
      "Reina",
      ""
    ],
    [
      "Nakahira",
      "Yuki",
      ""
    ],
    [
      "Saitoh",
      "Hiroyuki",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 30 Dec 2024 17:05:34 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735578334000,
  "abstract": "  Oxyhydrides are gaining attention for their diverse functionality. However,\nevaluating electron, ion, and phonon transport properties and comprehending\ntheir mechanism remains challenging due to the difficulty in oxyhydride\nsynthesis involving the trade-off between achieving density sintering and\npreventing hydrogen evolution. High-temperature treatments, often required to\nreduce intergranular resistance, typically cause hydrogen evolution before\nsufficient sintering. Instead of a post-annealing process aiming for strong\nchemical connections between oxyhydride particles, this research demonstrates a\nnovel synthesis technique that converts pre-sintered bulk oxides into\noxyhydrides while preserving the dense state. The process employs a\nhigh-pressure diffusion control method, facilitating the co-diffusion of\nhydride and oxide ions.\n",
  "subjects": [
    "Condensed Matter/Materials Science"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "acCNi8T5AZ_FccnSlu96JbUamXIxG7hTYsmumuXV-Go",
  "pdfSize": "1782608"
}