{
  "id": "2412.08954",
  "title": "An Informational Parsimony Perspective on Symmetry-Based Structure\n  Extraction",
  "authors": "Hippolyte Charvin, Nicola Catenacci Volpi, Daniel Polani",
  "authorsParsed": [
    [
      "Charvin",
      "Hippolyte",
      ""
    ],
    [
      "Volpi",
      "Nicola Catenacci",
      ""
    ],
    [
      "Polani",
      "Daniel",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 05:36:14 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1733981774000,
  "abstract": "  Extraction of structure, in particular of group symmetries, is increasingly\ncrucial to understanding and building intelligent models. In particular, some\ninformation-theoretic models of parsimonious learning have been argued to\ninduce invariance extraction. Here, we formalise these arguments from a\ngroup-theoretic perspective. We then extend them to the study of more general\nprobabilistic symmetries, through compressions preserving well-studied\ngeometric measures of complexity. More precisely, we formalise a trade-off\nbetween compression and preservation of the divergence from a given\nhierarchical model, yielding a novel generalisation of the Information\nBottleneck framework. Through appropriate choices of hierarchical models, we\nfully characterise (in the discrete and full support case) channel invariance,\nchannel equivariance and distribution invariance under permutation. Allowing\nimperfect divergence preservation then leads to principled definitions of \"soft\nsymmetries\", where the \"coarseness\" corresponds to the degree of compression of\nthe system. In simple synthetic experiments, we demonstrate that our method\nsuccessively recovers, at increasingly compressed \"resolutions\", nested but\nincreasingly perturbed equivariances, where new equivariances emerge at\nbifurcation points of the trade-off parameter. Our framework suggests a new\npath for the extraction of generalised probabilistic symmetries.\n",
  "subjects": [
    "Computer Science/Information Theory",
    "Mathematics/Information Theory"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "T5z6iJBBtuQtwA5amUm4GHoYeKi2oVHhqmqp6xcr9Zo",
  "pdfSize": "679439"
}