{"id":"2412.18140","title":"An Instrumental Value for Data Production and its Application to Data\n  Pricing","authors":"Rui Ai, Boxiang Lyu, Zhaoran Wang, Zhuoran Yang and Haifeng Xu","authorsParsed":[["Ai","Rui",""],["Lyu","Boxiang",""],["Wang","Zhaoran",""],["Yang","Zhuoran",""],["Xu","Haifeng",""]],"versions":[{"version":"v1","created":"Tue, 24 Dec 2024 03:53:57 GMT"}],"updateDate":"2024-12-25","timestamp":1735012437000,"abstract":"  How much value does a dataset or a data production process have to an agent\nwho wishes to use the data to assist decision-making? This is a fundamental\nquestion towards understanding the value of data as well as further pricing of\ndata. This paper develops an approach for capturing the instrumental value of\ndata production processes, which takes two key factors into account: (a) the\ncontext of the agent's decision-making problem; (b) prior data or information\nthe agent already possesses. We ''micro-found'' our valuation concepts by\nshowing how they connect to classic notions of information design and signals\nin information economics. When instantiated in the domain of Bayesian linear\nregression, our value naturally corresponds to information gain. Based on our\ndesigned data value, we then study a basic monopoly pricing setting with a\nbuyer looking to purchase from a seller some labeled data of a certain feature\ndirection in order to improve a Bayesian regression model. We show that when\nthe seller has the ability to fully customize any data request, she can extract\nthe first-best revenue (i.e., full surplus) from any population of buyers,\ni.e., achieving first-degree price discrimination. If the seller can only sell\ndata that are derived from an existing data pool, this limits her ability to\ncustomize, and achieving first-best revenue becomes generally impossible.\nHowever, we design a mechanism that achieves seller revenue at most $\\log\n(\\kappa)$ less than the first-best revenue, where $\\kappa$ is the condition\nnumber associated with the data matrix. A corollary of this result is that the\nseller can extract the first-best revenue in the multi-armed bandits special\ncase.\n","subjects":["Computer Science/Computer Science and Game Theory","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7N1t8GmXabtVH9Zub-HoaijOMUzmyIoih3gCU7BF6Z8","pdfSize":"841635"}