{"id":"2412.18310","title":"Actuation and mapping of SAW-induced high-frequency wavefields on\n  suspended graphene membranes","authors":"Hande N. A\\c{c}{\\i}kg\\\"oz, Dong Hoon Shin, Inge C. van der Knijff,\n  Allard J. Katan, Xiliang Yang, Peter G. Steeneken, Gerard J. Verbiest, Sabina\n  Caneva","authorsParsed":[["Açıkgöz","Hande N.",""],["Shin","Dong Hoon",""],["van der Knijff","Inge C.",""],["Katan","Allard J.",""],["Yang","Xiliang",""],["Steeneken","Peter G.",""],["Verbiest","Gerard J.",""],["Caneva","Sabina",""]],"versions":[{"version":"v1","created":"Tue, 24 Dec 2024 09:48:40 GMT"}],"updateDate":"2024-12-25","timestamp":1735033720000,"abstract":"  High frequency acoustic devices based on two-dimensional (2D) materials are\nunique platforms to design and manipulate the spatiotemporal response of\nacoustic waves for next-generation sensing and contactless actuation\napplications. Conventional methods for actuating suspended membranes, however,\ncannot be applied to all 2D materials, or are limited in frequency. There is,\ntherefore, a need for a universal high-frequency, on-chip actuation technique\nthat can be applied to all types of membranes. Here, we demonstrate that\nsurface acoustic waves (SAWs) can be used to efficiently actuate suspended 2D\nmaterials by exciting suspended graphene membranes with high-frequency (375\nMHz) Rayleigh surface waves and mapping the resulting vibration field with\natomic force acoustic microscopy (AFAM). Acoustic waves travelling from\nsupported to suspended graphene experience a reduction in acoustic wavelength\nfrom 10 \\mu m to ~2 \\mu um due to the decrease in effective bending rigidity,\nleading to a decrease in wave velocity on suspended graphene. By varying the\nexcitation frequency, we observed a change in phase velocity from ~160 m/s to\n~700 m/s. This behavior is consistent with the nonlinear dispersion of acoustic\nwaves, as predicted by plate theory, in suspended graphene membranes. The\ngeometry and bending rigidity of the membrane thus play key roles in modulating\nthe acoustic wave pattern and wavelength. This combined SAW actuation and AFAM\nvisualization scheme can give new insights into the fundamentals of acoustic\ntransport at the nanoscale limit and provides a route towards the manipulation\nof localized wavefields for on-chip patterning and transport over 2D materials\nsurfaces.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"f9wgZbTDTDdZKTPgr2bK1gpGbSesFT9k7VQMWtRQTyU","pdfSize":"963999"}