{
  "id": "2412.11801",
  "title": "Classification uncertainty for transient gravitational-wave noise\n  artefacts with optimised conformal prediction",
  "authors": "Ann-Kristin Malz, Gregory Ashton, Nicolo Colombo",
  "authorsParsed": [
    [
      "Malz",
      "Ann-Kristin",
      ""
    ],
    [
      "Ashton",
      "Gregory",
      ""
    ],
    [
      "Colombo",
      "Nicolo",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 14:11:31 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734358291000,
  "abstract": "  With the increasing use of Machine Learning (ML) algorithms in scientific\nresearch comes the need for reliable uncertainty quantification. When taking a\nmeasurement it is not enough to provide the result, we also have to declare how\nconfident we are in the measurement. This is also true when the results are\nobtained from a ML algorithm, and arguably more so since the internal workings\nof ML algorithms are often less transparent compared to traditional statistical\nmethods. Additionally, many ML algorithms do not provide uncertainty estimates\nand auxiliary algorithms must be applied. Conformal Prediction (CP) is a\nframework to provide such uncertainty quantifications for ML point predictors.\nIn this paper, we explore the use and properties of CP applied in the context\nof glitch classification in gravitational wave astronomy. Specifically, we\ndemonstrate the application of CP to the Gravity Spy glitch classification\nalgorithm. CP makes use of a score function, a nonconformity measure, to\nconvert an algorithm's heuristic notion of uncertainty to a rigorous\nuncertainty. We use the application on Gravity Spy to explore the performance\nof different nonconformity measures and optimise them for our application. Our\nresults show that the optimal nonconformity measure depends on the specific\napplication, as well as the metric used to quantify the performance.\n",
  "subjects": [
    "Physics/General Relativity and Quantum Cosmology",
    "Astrophysics/High Energy Astrophysical Phenomena",
    "Astrophysics/Instrumentation and Methods for Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "us8xIzbqQOA5MkP47TmDlMvEHPCZ9VoitxHMEDMqgOM",
  "pdfSize": "2414667"
}