{
  "id": "2412.03226",
  "title": "Information thermodynamics for Markov jump processes coupled to\n  underdamped diffusion: Application to nanoelectromechanics",
  "authors": "Ashwin Gopal, Nahuel Freitas, Massimiliano Esposito",
  "authorsParsed": [
    [
      "Gopal",
      "Ashwin",
      ""
    ],
    [
      "Freitas",
      "Nahuel",
      ""
    ],
    [
      "Esposito",
      "Massimiliano",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 11:23:26 GMT"
    }
  ],
  "updateDate": "2024-12-05",
  "timestamp": 1733311406000,
  "abstract": "  We extend the principles of information thermodynamics to study energy and\ninformation exchanges between coupled systems composed of one part undergoing a\nMarkov jump process and another underdamped diffusion. We derive integral\nfluctuation theorems for the partial entropy production of each subsystem and\nanalyze two distinct regimes. First, when the inertial dynamics is slow\ncompared to the discrete-state transitions, we show that the steady-state\nenergy and information flows vanish at the leading order in an adiabatic\napproximation, if the underdamped subsystem is governed purely by conservative\nforces. To capture the non-zero contributions, we consistently derive dynamical\nequations valid to higher order. Second, in the limit of infinite mass, the\nunderdamped dynamics becomes a deterministic Hamiltonian dynamics driving the\njump processes, we capture the next-order correction beyond this limit. We\napply our framework to study self-oscillations in the single-electron shuttle -\na nanoelectromechanical system (NEMS) - from a measurement-feedback\nperspective. We find that energy flows dominate over information flows in the\nself-oscillating regime, and study the efficiency with which this NEMS converts\nelectrical work into mechanical oscillations.\n",
  "subjects": [
    "Condensed Matter/Statistical Mechanics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "n5VDfTD1x7XzOvX1EfCmPUD8ka-fppOnVBhWmhgrAaM",
  "pdfSize": "5575117"
}