{
  "id": "2412.02427",
  "title": "GerPS-Compare: Comparing NER methods for legal norm analysis",
  "authors": "Sarah T. Bachinger, Christoph Unger, Robin Erd, Leila Feddoul, Clara\n  Lachenmaier, Sina Zarrie{\\ss}, Birgitta K\\\"onig-Ries",
  "authorsParsed": [
    [
      "Bachinger",
      "Sarah T.",
      ""
    ],
    [
      "Unger",
      "Christoph",
      ""
    ],
    [
      "Erd",
      "Robin",
      ""
    ],
    [
      "Feddoul",
      "Leila",
      ""
    ],
    [
      "Lachenmaier",
      "Clara",
      ""
    ],
    [
      "Zarrieß",
      "Sina",
      ""
    ],
    [
      "König-Ries",
      "Birgitta",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 12:46:06 GMT"
    }
  ],
  "updateDate": "2024-12-04",
  "timestamp": 1733229966000,
  "abstract": "  We apply NER to a particular sub-genre of legal texts in German: the genre of\nlegal norms regulating administrative processes in public service\nadministration. The analysis of such texts involves identifying stretches of\ntext that instantiate one of ten classes identified by public service\nadministration professionals. We investigate and compare three methods for\nperforming Named Entity Recognition (NER) to detect these classes: a Rule-based\nsystem, deep discriminative models, and a deep generative model. Our results\nshow that Deep Discriminative models outperform both the Rule-based system as\nwell as the Deep Generative model, the latter two roughly performing equally\nwell, outperforming each other in different classes. The main cause for this\nsomewhat surprising result is arguably the fact that the classes used in the\nanalysis are semantically and syntactically heterogeneous, in contrast to the\nclasses used in more standard NER tasks. Deep Discriminative models appear to\nbe better equipped for dealing with this heterogenerity than both generic LLMs\nand human linguists designing rule-based NER systems.\n",
  "subjects": [
    "Computer Science/Computation and Language",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "KosFB3WB6XUzjS1NLJYU_dEsqsJOAaYqcURCSpmT3ts",
  "pdfSize": "556571"
}