{"id":"2412.20541","title":"SAFE-MEME: Structured Reasoning Framework for Robust Hate Speech\n  Detection in Memes","authors":"Palash Nandi, Shivam Sharma, Tanmoy Chakraborty","authorsParsed":[["Nandi","Palash",""],["Sharma","Shivam",""],["Chakraborty","Tanmoy",""]],"versions":[{"version":"v1","created":"Sun, 29 Dec 2024 18:16:28 GMT"}],"updateDate":"2024-12-31","timestamp":1735496188000,"abstract":"  Memes act as cryptic tools for sharing sensitive ideas, often requiring\ncontextual knowledge to interpret. This makes moderating multimodal memes\nchallenging, as existing works either lack high-quality datasets on nuanced\nhate categories or rely on low-quality social media visuals. Here, we curate\ntwo novel multimodal hate speech datasets, MHS and MHS-Con, that capture\nfine-grained hateful abstractions in regular and confounding scenarios,\nrespectively. We benchmark these datasets against several competing baselines.\nFurthermore, we introduce SAFE-MEME (Structured reAsoning FramEwork), a novel\nmultimodal Chain-of-Thought-based framework employing Q&A-style reasoning\n(SAFE-MEME-QA) and hierarchical categorization (SAFE-MEME-H) to enable robust\nhate speech detection in memes. SAFE-MEME-QA outperforms existing baselines,\nachieving an average improvement of approximately 5% and 4% on MHS and MHS-Con,\nrespectively. In comparison, SAFE-MEME-H achieves an average improvement of 6%\nin MHS while outperforming only multimodal baselines in MHS-Con. We show that\nfine-tuning a single-layer adapter within SAFE-MEME-H outperforms fully\nfine-tuned models in regular fine-grained hateful meme detection. However, the\nfully fine-tuning approach with a Q&A setup is more effective for handling\nconfounding cases. We also systematically examine the error cases, offering\nvaluable insights into the robustness and limitations of the proposed\nstructured reasoning framework for analyzing hateful memes.\n","subjects":["Computer Science/Computation and Language","Computer Science/Computers and Society"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"7NcraydlXUZOaYZupOL8CTwMdKyX1RfDy8k_oiTLTH0","pdfSize":"3192778"}