{"id":"2412.02501","title":"Emergent complex phases in a discrete flocking model with reciprocal and\n  non-reciprocal interactions","authors":"Matthieu Mangeat, Swarnajit Chatterjee, Jae Dong Noh, Heiko Rieger","authorsParsed":[["Mangeat","Matthieu",""],["Chatterjee","Swarnajit",""],["Noh","Jae Dong",""],["Rieger","Heiko",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 15:27:48 GMT"}],"updateDate":"2024-12-04","timestamp":1733239668000,"abstract":"  We have undertaken a comprehensive study of the two-species active Ising\nmodel (TSAIM), a discrete-symmetry counterpart of the continuous-symmetry\ntwo-species Vicsek model [Phys. Rev. E 107, 024607 (2023)], motivated by recent\ninterest in the impact of complex and heterogeneous interactions on active\nmatter systems. In the TSAIM, two species of self-propelled particles undergo\nbiased diffusion in two dimensions, interacting via local\nalignment/anti-alignment. Our investigation explores both reciprocal and\nnon-reciprocal interactions between the two species, along with the possibility\nof species interconversion. In the reciprocal TSAIM, we observe a liquid-gas\nphase transition, exhibiting macrophase-separated bands, and the emergence of a\nhigh-density parallel flocking state, a feature not seen in previous flocking\nmodels. With species interconversion (species-flip dynamics), the TSAIM\ncorresponds to an active extension of the Ashkin-Teller model and exhibits a\nbroader range of steady-state phases, including microphase-separated bands that\nfurther enrich the coexistence region. In the non-reciprocal TSAIM, a novel\nrun-and-chase dynamics emerges. We also find that the system is metastable due\nto droplet excitation and exhibits spontaneous motility-induced interface\npinning, preventing the system from reaching long-range order at sufficiently\nlow noise. A hydrodynamic theory complements our computer simulations of the\nmicroscopic model and confirms the reported phase diagrams.\n","subjects":["Condensed Matter/Statistical Mechanics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"sUseCPiGluCU5mJDBH9T5EkYgQEdIl20IQGMBqwvsTA","pdfSize":"10958816"}