{
  "id": "2412.12560",
  "title": "Laboratory modeling of MHD accretion disks",
  "authors": "Christophe Gissinger",
  "authorsParsed": [
    [
      "Gissinger",
      "Christophe",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 15 Dec 2024 13:42:12 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734270132000,
  "abstract": "  This review article summarizes two decades of laboratory research aimed at\nunderstanding the dynamics of accretion disks, with particular emphasis on\nmagnetohydrodynamic experiments involving liquid metals and plasmas. First, the\nTaylor-Couette experiments demonstrated the generation of magnetorotational\ninstability (MRI) in liquid metals, and highlighted how this instability is\ncritically influenced by boundary conditions and the geometry of the applied\nmagnetic field. These experiments also highlight the nonlinear transition to\nturbulence in accretion disks, and their link with other MHD instabilities in\ncentrifugally-stable flows. A complementary approach, involving laboratory\nexperiments with volumetric fluid driving rather than rotating boundaries,\nenables a quantitative study of angular momentum transport by Keplerian\nturbulence. Collectively, these various laboratory studies offer new\nconstraints on the theoretical models designed to explain the dynamics of\naccretion disks. This is particularly true with regard to the role of Keplerian\nturbulence in protoplanetary disks, where recent observations from the ALMA\ntelescope have considerably revised previously expected values of the magnitude\nof the turbulent fluctuations. Finally, the paper discusses outstanding\nquestions and future prospects in laboratory modeling of accretion disks.\n",
  "subjects": [
    "Astrophysics/Solar and Stellar Astrophysics",
    "Astrophysics/Earth and Planetary Astrophysics",
    "Astrophysics/High Energy Astrophysical Phenomena",
    "Astrophysics/Instrumentation and Methods for Astrophysics",
    "Physics/Plasma Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "SU1YnnAVz8PyogMXJkSf35d7nqHcXaYIjw9X60DjVic",
  "pdfSize": "16277177"
}