{
  "id": "2412.13629",
  "title": "Non-locality in Quadrupolar Gravitational Radiation",
  "authors": "Salvatore Capozziello, Maurizio Capriolo, Amodio Carleo, Gaetano\n  Lambiase",
  "authorsParsed": [
    [
      "Capozziello",
      "Salvatore",
      ""
    ],
    [
      "Capriolo",
      "Maurizio",
      ""
    ],
    [
      "Carleo",
      "Amodio",
      ""
    ],
    [
      "Lambiase",
      "Gaetano",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 09:06:10 GMT"
    },
    {
      "version": "v2",
      "created": "Sat, 1 Feb 2025 14:34:00 GMT"
    }
  ],
  "updateDate": "2025-02-04",
  "timestamp": 1734512770000,
  "abstract": "  General Relativity suffers for two main problems which have not yet been\novercome: it predicts spacetime singularities and cannot be formulated as a\nperturbative renormalizable theory. In particular, many attempts have been made\nfor avoiding singularities, such as considering higher order or infinite\nderivative theories. The price to pay in both cases is to give up locality and\ntherefore they are known altogether as non-local theories of gravity. In this\npaper, we investigate how to recognize the presence of non-local effects by\nexploiting the power emitted by gravitational waves in a binary system in\npresence of non-local corrections as $R\\Box^{-1}R$ to the Hilbert-Einstein\naction. After solving the field equations in terms of the source stress-energy\ntensor $T_{\\mu\\nu}$ and obtaining the gravitational wave stress-energy\npseudo-tensor, $\\tau_{\\mu\\nu}$, we find that the General Relativity quadrupole\nformula is modified in a non-trivial way, making it feasible to find a possible\nsignature of non-locality. Our final results on the gravitational wave\nstress-energy pseudo-tensor could also be applied to several astrophysical\nscenarios involving energy or momentum loss, potentially providing multiple\ntests for non-local deviations from General Relativity. We finally discuss the\ndetectability of the massless transverse scalar mode, discovering that,\nalthough this radiation is extremely weak, in a small range around the model\ndivergence, its amplitude could fall within the low-frequency Einstein\nTelescope sensitivity.\n",
  "subjects": [
    "Physics/General Relativity and Quantum Cosmology",
    "Astrophysics/High Energy Astrophysical Phenomena",
    "Physics/High Energy Physics - Theory"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "QtwCT1_ue1Rg0RavN53i9CtAuM0s6ztM-HSy7n7aeew",
  "pdfSize": "771048"
}