{"id":"2412.07509","title":"Enhancing 3D Object Detection in Autonomous Vehicles Based on Synthetic\n  Virtual Environment Analysis","authors":"Vladislav Li, Ilias Siniosoglou, Thomai Karamitsou, Anastasios Lytos,\n  Ioannis D. Moscholios, Sotirios K. Goudos, Jyoti S. Banerjee, Panagiotis\n  Sarigiannidi, Vasileios Argyriou","authorsParsed":[["Li","Vladislav",""],["Siniosoglou","Ilias",""],["Karamitsou","Thomai",""],["Lytos","Anastasios",""],["Moscholios","Ioannis D.",""],["Goudos","Sotirios K.",""],["Banerjee","Jyoti S.",""],["Sarigiannidi","Panagiotis",""],["Argyriou","Vasileios",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 13:46:44 GMT"}],"updateDate":"2024-12-11","timestamp":1733838404000,"abstract":"  Autonomous Vehicles (AVs) use natural images and videos as input to\nunderstand the real world by overlaying and inferring digital elements,\nfacilitating proactive detection in an effort to assure safety. A crucial\naspect of this process is real-time, accurate object recognition through\nautomatic scene analysis. While traditional methods primarily concentrate on 2D\nobject detection, exploring 3D object detection, which involves projecting 3D\nbounding boxes into the three-dimensional environment, holds significance and\ncan be notably enhanced using the AR ecosystem. This study examines an AI\nmodel's ability to deduce 3D bounding boxes in the context of real-time scene\nanalysis while producing and evaluating the model's performance and processing\ntime, in the virtual domain, which is then applied to AVs. This work also\nemploys a synthetic dataset that includes artificially generated images\nmimicking various environmental, lighting, and spatiotemporal states. This\nevaluation is oriented in handling images featuring objects in diverse weather\nconditions, captured with varying camera settings. These variations pose more\nchallenging detection and recognition scenarios, which the outcomes of this\nwork can help achieve competitive results under most of the tested conditions.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"WAzgZADuDx-90unU_TT7bEPgXLbbGAWzHgi13vRnCCM","pdfSize":"12628733"}