{
  "id": "2412.07784",
  "title": "Toward an Ion-Based Large-Scale Integrated Circuit: Circuit Level\n  Design, Simulation, and Integration of Iontronic Components",
  "authors": "Noa Edri Fraiman, Barak Sabbagh, Gilad Yossifon and Alexander Fish",
  "authorsParsed": [
    [
      "Fraiman",
      "Noa Edri",
      ""
    ],
    [
      "Sabbagh",
      "Barak",
      ""
    ],
    [
      "Yossifon",
      "Gilad",
      ""
    ],
    [
      "Fish",
      "Alexander",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 25 Nov 2024 14:13:38 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1732544018000,
  "abstract": "  Iontronics combines ions as charge carriers with electronic-like operations,\nenabling unique information processing, chemical regulation, and enhanced\nbio-integrability. Standard simulation tools encounter difficulties in\neffectively modeling the behavior of integrated iontronic components,\nhighlighting the need for specialized design and simulation approaches. This\npaper presents a design methodology for iontronic integrated circuits, inspired\nby well-established electronic design methodologies and made possible by the\ndevelopment of a compact model for the iontronic bipolar diode. Grounded in the\ndiode's physical properties and observed behavior, this model provides a\nconceptual framework that could be applied to other iontronic components. It is\nimplemented using standard VLSI (Very Large-Scale Integration) electronic\ndesign tools, enabling simulations that demonstrate diode-based iontronic\ncircuit behaviors and laying the groundwork for the design and simulation of\nhybrid systems integrating electronic and iontronic circuits. The proposed\niontronic circuit simulation approach enables the exploration of how component\nuniformity influences circuit behavior, as well as the impact of diode\nparameters and a deeper understanding of diode characteristics from a circuit\nperspective. These insights are expected to contribute to the development of\nmore complex and efficient iontronic circuits, bringing us closer to practical\nand groundbreaking applications in the field.\n",
  "subjects": [
    "Computer Science/Emerging Technologies"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "egZoSWN4vE5UHXhKRoAIZbVcmKXWE93NhbwocUsQjyo",
  "pdfSize": "2489037"
}