{"id":"2412.06927","title":"Gradient-based facial encoding for key generation to encrypt and decrypt\n  multimedia data","authors":"Ankit Kumar Patel, Dewanshi Paul, Sarthak Giri, Sneha Chaudhary,\n  Bikalpa Gautam","authorsParsed":[["Patel","Ankit Kumar",""],["Paul","Dewanshi",""],["Giri","Sarthak",""],["Chaudhary","Sneha",""],["Gautam","Bikalpa",""]],"versions":[{"version":"v1","created":"Mon, 9 Dec 2024 19:12:17 GMT"},{"version":"v2","created":"Thu, 9 Jan 2025 18:44:39 GMT"}],"updateDate":"2025-01-10","timestamp":1733771537000,"abstract":"  Security systems relying on passwords are vulnerable to being forgotten,\nguessed, or breached. Likewise, biometric systems that operate independently\nare at risk of template spoofing and replay incidents. This paper introduces a\nbiocryptosystem utilizing face recognition techniques to address these issues,\nallowing for the encryption and decryption of various file types through the\nAdvanced Encryption Standard (AES). The proposed system creates a distinct\n32-bit encryption key derived from facial features identified by Histogram of\nOriented Gradients (HOG) and categorized using Support Vector Machines (SVM).\nHOG efficiently identifies edge-aligned facial features, even in dim lighting,\nensuring that reliable biometric keys can be generated. This key is then used\nwith AES to encrypt and decrypt a variety of data formats, such as text, audio,\nand video files. This encryption key, derived from an individual's distinctive\nfacial traits, is exceedingly challenging for adversaries to reproduce or\nguess. The security and performance of the system have been validated through\nexperiments using several metrics, including correlation analysis, Shannon\nentropy, normalized Hamming distance, and the avalanche effect on 25 different\nfile types. Potential uses for the proposed system include secure file sharing,\nonline transactions, and data archiving, making it a strong and trustworthy\napproach to safeguarding sensitive information by integrating the uniqueness of\nfacial biometrics with the established security of AES encryption.\n","subjects":["Computer Science/Cryptography and Security","Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"bLWfiW3ylfTpbFXBBzzMQLmXS5mIWzCc8cLJX3G4BHU","pdfSize":"150623"}