{"id":"2412.13457","title":"Mass Acquisition of Dirac Fermions in Bi4I4 by Spontaneous Symmetry\n  Breaking","authors":"Ming Yang, Wenxuan Zhao, Dan Mu, Zhijian Shi, Jingyuan Zhong, Yaqi Li,\n  Yundan Liu, Jianxin Zhong, Ningyan Cheng, Wei Zhou, Jianfeng Wang, Yan Shi,\n  Ying Sun, Weichang Hao, Lexian Yang, Jincheng Zhuang, Yi Du","authorsParsed":[["Yang","Ming",""],["Zhao","Wenxuan",""],["Mu","Dan",""],["Shi","Zhijian",""],["Zhong","Jingyuan",""],["Li","Yaqi",""],["Liu","Yundan",""],["Zhong","Jianxin",""],["Cheng","Ningyan",""],["Zhou","Wei",""],["Wang","Jianfeng",""],["Shi","Yan",""],["Sun","Ying",""],["Hao","Weichang",""],["Yang","Lexian",""],["Zhuang","Jincheng",""],["Du","Yi",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 03:00:41 GMT"}],"updateDate":"2024-12-19","timestamp":1734490841000,"abstract":"  Massive Dirac fermions, which are essential for realizing novel topological\nphenomena, are expected to be generated from massless Dirac fermions by\nbreaking the related symmetry, such as time-reversal symmetry (TRS) in\ntopological insulators or crystal symmetry in topological crystalline\ninsulators. Here, we report scanning tunneling microscopy and angle-resolved\nphotoemission spectroscopy studies of {\\alpha}-Bi4I4, which reveals the\nrealization of massive Dirac fermions in the (100) surface states without\nbreaking the TRS. Combined with first-principle calculations, our experimental\nresults indicate that the spontaneous symmetry breaking engenders two\nnondegenerate edges states at the opposite sides of monolayer Bi4I4 after the\nstructural phase transition, imparting mass to the Dirac fermions after taking\nthe interlayer coupling into account. Our results not only demonstrate the\nformation of the massive Dirac fermions by spontaneous symmetry breaking, but\nalso imply the potential for the engineering of Dirac fermions for device\napplications.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"MeP2TktAUYUlWjhUwdHjkcirlL64Dl5VigUHu1jXbbw","pdfSize":"5081061"}