{
  "id": "2412.17623",
  "title": "Towards An Unsupervised Learning Scheme for Efficiently Solving\n  Parameterized Mixed-Integer Programs",
  "authors": "Shiyuan Qu, Fenglian Dong, Zhiwei Wei, Chao Shang",
  "authorsParsed": [
    [
      "Qu",
      "Shiyuan",
      ""
    ],
    [
      "Dong",
      "Fenglian",
      ""
    ],
    [
      "Wei",
      "Zhiwei",
      ""
    ],
    [
      "Shang",
      "Chao",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 14:48:32 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 24 Dec 2024 09:05:53 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1734965312000,
  "abstract": "  In this paper, we describe a novel unsupervised learning scheme for\naccelerating the solution of a family of mixed integer programming (MIP)\nproblems. Distinct substantially from existing learning-to-optimize methods,\nour proposal seeks to train an autoencoder (AE) for binary variables in an\nunsupervised learning fashion, using data of optimal solutions to historical\ninstances for a parametric family of MIPs. By a deliberate design of AE\narchitecture and exploitation of its statistical implication, we present a\nsimple and straightforward strategy to construct a class of cutting plane\nconstraints from the decoder parameters of an offline-trained AE. These\nconstraints reliably enclose the optimal binary solutions of new problem\ninstances thanks to the representation strength of the AE. More importantly,\ntheir integration into the primal MIP problem leads to a tightened MIP with the\nreduced feasible region, which can be resolved at decision time using\noff-the-shelf solvers with much higher efficiency. Our method is applied to a\nbenchmark batch process scheduling problem formulated as a mixed integer linear\nprogramming (MILP) problem. Comprehensive results demonstrate that our approach\nsignificantly reduces the computational cost of off-the-shelf MILP solvers\nwhile retaining a high solution quality. The codes of this work are\nopen-sourced at https://github.com/qushiyuan/AE4BV.\n",
  "subjects": [
    "Mathematics/Optimization and Control",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "lVTA70sbrc_X-F50H2P75gaDO4Z2gY-Hi41npvnRF7U",
  "pdfSize": "725469"
}