{"id":"2412.19101","title":"Reconstruction Target Matters in Masked Image Modeling for Cross-Domain\n  Few-Shot Learning","authors":"Ran Ma, Yixiong Zou, Yuhua Li, Ruixuan Li","authorsParsed":[["Ma","Ran",""],["Zou","Yixiong",""],["Li","Yuhua",""],["Li","Ruixuan",""]],"versions":[{"version":"v1","created":"Thu, 26 Dec 2024 07:43:01 GMT"}],"updateDate":"2024-12-30","timestamp":1735198981000,"abstract":"  Cross-Domain Few-Shot Learning (CDFSL) requires the model to transfer\nknowledge from the data-abundant source domain to data-scarce target domains\nfor fast adaptation, where the large domain gap makes CDFSL a challenging\nproblem. Masked Autoencoder (MAE) excels in effectively using unlabeled data\nand learning image's global structures, enhancing model generalization and\nrobustness. However, in the CDFSL task with significant domain shifts, we find\nMAE even shows lower performance than the baseline supervised models. In this\npaper, we first delve into this phenomenon for an interpretation. We find that\nMAE tends to focus on low-level domain information during reconstructing pixels\nwhile changing the reconstruction target to token features could mitigate this\nproblem. However, not all features are beneficial, as we then find\nreconstructing high-level features can hardly improve the model's\ntransferability, indicating a trade-off between filtering domain information\nand preserving the image's global structure. In all, the reconstruction target\nmatters for the CDFSL task. Based on the above findings and interpretations, we\nfurther propose Domain-Agnostic Masked Image Modeling (DAMIM) for the CDFSL\ntask. DAMIM includes an Aggregated Feature Reconstruction module to\nautomatically aggregate features for reconstruction, with balanced learning of\ndomain-agnostic information and images' global structure, and a Lightweight\nDecoder module to further benefit the encoder's generalizability. Experiments\non four CDFSL datasets demonstrate that our method achieves state-of-the-art\nperformance.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"pUDoT59gqaY0ExGj1d4Uh9MYThVerL6hk0cO6cVEl1w","pdfSize":"881169"}