{
  "id": "2412.20789",
  "title": "Pre-trained Audio Transformer as a Foundational AI Tool for\n  Gravitational Waves",
  "authors": "Chayan Chatterjee, Abigail Petulante, Karan Jani, Jesse Spencer-Smith,\n  Yang Hu, Roy Lau, Haowei Fu, Trang Hoang, Stephen Chong Zhao, Suyash Deshmukh",
  "authorsParsed": [
    [
      "Chatterjee",
      "Chayan",
      ""
    ],
    [
      "Petulante",
      "Abigail",
      ""
    ],
    [
      "Jani",
      "Karan",
      ""
    ],
    [
      "Spencer-Smith",
      "Jesse",
      ""
    ],
    [
      "Hu",
      "Yang",
      ""
    ],
    [
      "Lau",
      "Roy",
      ""
    ],
    [
      "Fu",
      "Haowei",
      ""
    ],
    [
      "Hoang",
      "Trang",
      ""
    ],
    [
      "Zhao",
      "Stephen Chong",
      ""
    ],
    [
      "Deshmukh",
      "Suyash",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 30 Dec 2024 08:12:14 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735546334000,
  "abstract": "  As gravitational wave detectors become more advanced and sensitive, the\nnumber of signals recorded by Advanced LIGO and Virgo from merging compact\nobjects is expected to rise dramatically. This surge in detection rates\nnecessitates the development of adaptable, scalable, and efficient tools\ncapable of addressing a wide range of tasks in gravitational wave astronomy.\nFoundational AI models present a transformative opportunity in this context by\nproviding a unified framework that can be fine tuned for diverse applications\nwhile leveraging the power of large scale pre training. In this work, we\nexplore how advanced transformer models, specifically Whisper by OpenAI, can be\nadapted as a foundational model for gravitational wave data analysis. By fine\ntuning the encoder model of Whisper, originally trained on extensive audio\ndata, and combining it with neural networks for specialized tasks, we achieve\nreliable results in detecting astrophysical signals and classifying transient\nnoise artifacts or glitches. This represents the first application of open\nsource transformer models, pre trained on unrelated tasks, for gravitational\nwave research, demonstrating their potential to enable versatile and efficient\ndata analysis in the era of rapidly increasing detection rates.\n",
  "subjects": [
    "Physics/General Relativity and Quantum Cosmology",
    "Astrophysics/High Energy Astrophysical Phenomena"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "WOarxnQbCCakkkPpHcuFtqLdKpLD6HT-yaepKp8zS1E",
  "pdfSize": "2412659"
}