{
  "id": "2412.03510",
  "title": "Stagnation points at grain contacts generate an elastic flow instability\n  in 3D porous media",
  "authors": "Emily Y. Chen and Christopher A. Browne and Simon J. Haward and Amy Q.\n  Shen and Sujit S. Datta",
  "authorsParsed": [
    [
      "Chen",
      "Emily Y.",
      ""
    ],
    [
      "Browne",
      "Christopher A.",
      ""
    ],
    [
      "Haward",
      "Simon J.",
      ""
    ],
    [
      "Shen",
      "Amy Q.",
      ""
    ],
    [
      "Datta",
      "Sujit S.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 17:52:16 GMT"
    }
  ],
  "updateDate": "2024-12-05",
  "timestamp": 1733334736000,
  "abstract": "  Many environmental, energy, and industrial processes involve the flow of\npolymer solutions in three-dimensional (3D) porous media where fluid is\nconfined to navigate through complex pore space geometries. As polymers are\ntransported through the tortuous pore space, elastic stresses accumulate,\nleading to the onset of unsteady flow fluctuations above a threshold flow rate.\nHow does pore space geometry influence the development and features of this\nelastic instability? Here, we address this question by directly imaging polymer\nsolution flow in microfabricated 3D ordered porous media with precisely\ncontrolled geometries consisting of simple-cubic (SC) or body-centered cuboid\n(BC) arrays of spherical grains. In both cases, we find that the flow\ninstability is generated at stagnation points arising at the contacts between\ngrains rather than at the polar upstream/downstream grain surfaces, as is the\ncase for flow around a single grain. The characteristics of the flow\ninstability are strongly dependent on the unit cell geometry: in SC packings,\nthe instability manifests through the formation of time-dependent, fluctuating\n3D eddies, whereas in BC packings, it manifests as continual fluctuating\n'wobbles' and crossing in the flow pathlines. Despite this difference, we find\nthat characteristics of the transition from steady to unsteady flow with\nincreasing flow rate have commonalities across geometries. Moreover, for both\npacking geometries, our data indicate that extensional flow-induced polymeric\nstresses generated by contact-associated stagnation points are the primary\ncontributor to the macroscopic resistance to flow across the entire medium.\nAltogether, our work highlights the pivotal role of inter-grain contacts --\nwhich are typically idealized as discrete points and therefore overlooked, but\nare inherent in most natural and engineered media -- in shaping elastic\ninstabilities in porous media.\n",
  "subjects": [
    "Physics/Fluid Dynamics",
    "Condensed Matter/Soft Condensed Matter",
    "Nonlinear Sciences/Chaotic Dynamics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "BgZuJJAWFVgBX8Ta1SEgm6WlPIXs99HHf3dwcwHwbIY",
  "pdfSize": "4000588"
}