{
  "id": "2412.11633",
  "title": "Geometric monotones of violations of quantum realism",
  "authors": "Alexandre C. Orthey Jr. and Alexander Streltsov",
  "authorsParsed": [
    [
      "Orthey",
      "Alexandre C.",
      "Jr."
    ],
    [
      "Streltsov",
      "Alexander",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 10:22:28 GMT"
    },
    {
      "version": "v2",
      "created": "Thu, 30 Jan 2025 12:31:33 GMT"
    }
  ],
  "updateDate": "2025-01-31",
  "timestamp": 1734344548000,
  "abstract": "  Quantum realism, as introduced by Bilobran and Angelo [EPL 112, 40005\n(2015)], states that projective measurements in quantum systems establish the\nreality of physical properties, even in the absence of a revealed outcome. This\nframework provides a nuanced perspective on the distinction between classical\nand quantum notions of realism, emphasizing the contextuality and\ncomplementarity inherent to quantum systems. While prior works have quantified\nviolations of quantum realism (VQR) using measures based on entropic distances,\nhere we extend the theoretical framework to geometric distances. Building on an\ninformational approach, we derive geometric monotones of VQR using trace\ndistance, Hilbert-Schmidt distance, Schatten $p$-distances, Bures, and\nHellinger distances. We identify Bures and Hellinger distances as uniquely\nsatisfying all minimal criteria for a bona fide VQR monotone. Remarkably, these\ndistances can be expressed in terms of symmetric R\\'enyi and Sandwiched R\\'enyi\ndivergences, aligning geometric and entropic approaches. Our findings suggest\nthat the realism-information relation implies a deep connection between\ngeometric and entropic frameworks, with only those geometric distances\nexpressible as entropic quantities qualifying as valid monotones of VQR. This\nwork highlights the theoretical and practical advantages of geometric\ndistances, particularly in contexts where computational simplicity or symmetry\nis important.\n",
  "subjects": [
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "mhCrmQyfpvjeL2OuBagJfDLxrPZsVZ9bh-IxXa-CVZc",
  "pdfSize": "282094"
}