{"id":"2412.05944","title":"ASb3Mn9O19 (A = K or Rb): New Mn-Based Two-Dimensional Magnetoplumbites\n  with Geometric and Magnetic Frustration","authors":"Jianyi Chen, Stuart Calder, Joseph A. M. Paddison, Gina Angelo, Liana\n  Klivansky, Jian Zhang, Huibo Cao and Xin Gui","authorsParsed":[["Chen","Jianyi",""],["Calder","Stuart",""],["Paddison","Joseph A. M.",""],["Angelo","Gina",""],["Klivansky","Liana",""],["Zhang","Jian",""],["Cao","Huibo",""],["Gui","Xin",""]],"versions":[{"version":"v1","created":"Sun, 8 Dec 2024 13:53:48 GMT"}],"updateDate":"2024-12-10","timestamp":1733666028000,"abstract":"  Magnetoplumbites are one of the most broadly studied families of hexagonal\nferrites, typically with high magnetic ordering temperatures, making them\nexcellent candidates for permanent magnets. However, magnetic frustration was\nrarely observed in magnetoplumbites. Herein, we report the discovery, synthesis\nand characterization of the first Mn-based magnetoplumbite, as well as the\nfirst magnetoplumbite involving pnictogens (Sb), ASb3Mn9O19 (A = K or Rb). The\nMn3+ (S = 2) cations, further confirmed by DC magnetic susceptibility and X-ray\nphotoelectron spectroscopy, construct three geometrically frustrated\nsublattices, including Kagome, triangular and puckered honeycomb lattices.\nMagnetic properties measurements revealed strong antiferromagnetic spin-spin\ncoupling as well as multiple low-temperature magnetic features. Heat capacity\ndata did not show any prominent lambda-anomaly, suggesting minimal associated\nmagnetic entropy. Moreover, neutron powder diffraction implied the absence of\nlong-range magnetic ordering in KSb3Mn9O19 down to 3 K. However, several\nmagnetic peaks were observed in RbSb3Mn9O19 at 3 K, corresponding to an\nincommensurate magnetic structure. Interestingly, strong diffuse scattering was\nseen in the neutron powder diffraction patterns of both compounds at low\nangles, and was analyzed by reverse Monte Carlo refinements, indicating\nshort-range spin ordering related to frustrated magnetism as well as\ntwo-dimensional magnetic correlations in ASb3Mn9O19 (A = K or Rb).\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"my65GLStgJecHJdhKrDp2blosB1ankeVoVx3sZGSyaA","pdfSize":"3503016"}