{
  "id": "2412.17163",
  "title": "Spline Autoregression Method for Estimation of Quantile Spectrum",
  "authors": "Ta-Hsin Li",
  "authorsParsed": [
    [
      "Li",
      "Ta-Hsin",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 22 Dec 2024 21:15:43 GMT"
    },
    {
      "version": "v2",
      "created": "Mon, 30 Dec 2024 20:22:11 GMT"
    }
  ],
  "updateDate": "2025-01-03",
  "timestamp": 1734902143000,
  "abstract": "  The quantile spectrum was introduced in Li (2012; 2014) as an alternative\ntool for spectral analysis of time series. It has the capability of providing a\nricher view of time series data than that offered by the ordinary spectrum\nespecially for nonlinear dynamics such as stochastic volatility. A novel\nmethod, called spline autoregression (SAR), is proposed in this paper for\nestimating the quantile spectrum as a bivaraite function of frequency and\nquantile level, under the assumption that the quantile spectrum varies smoothly\nwith the quantile level. The SAR method is facilitated by the quantile discrete\nFourier transform (QDFT) based on trigonometric quantile regression. It is\nenabled by the resulting time-domain quantile series (QSER) which represents\nproperly scaled oscillatory characteristics of the original time series around\na quantile. A functional autoregressive (AR) model is fitted to the QSER on a\ngrid of quantile levels by penalized least-squares with the AR coefficients\nrepresented as smoothing splines of the quantile level. While the ordinary AR\nmodel is widely used for conventional spectral estimation, the proposed SAR\nmethod provides an effective way of estimating the quantile spectrum as a\nbivariate function in comparison with the alternatives. This is confirmed by a\nsimulation study.\n",
  "subjects": [
    "Statistics/Methodology"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "fWY8QMXU8PT8i4ljdQ-FSmUwr2lRgVBuU5qyxYaYkhk",
  "pdfSize": "2313836"
}