{
  "id": "2412.17640",
  "title": "Hierarchical Vector Quantization for Unsupervised Action Segmentation",
  "authors": "Federico Spurio, Emad Bahrami, Gianpiero Francesca, Juergen Gall",
  "authorsParsed": [
    [
      "Spurio",
      "Federico",
      ""
    ],
    [
      "Bahrami",
      "Emad",
      ""
    ],
    [
      "Francesca",
      "Gianpiero",
      ""
    ],
    [
      "Gall",
      "Juergen",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 15:18:24 GMT"
    },
    {
      "version": "v2",
      "created": "Fri, 24 Jan 2025 17:43:56 GMT"
    }
  ],
  "updateDate": "2025-01-27",
  "timestamp": 1734967104000,
  "abstract": "  In this work, we address unsupervised temporal action segmentation, which\nsegments a set of long, untrimmed videos into semantically meaningful segments\nthat are consistent across videos. While recent approaches combine\nrepresentation learning and clustering in a single step for this task, they do\nnot cope with large variations within temporal segments of the same class. To\naddress this limitation, we propose a novel method, termed Hierarchical Vector\nQuantization (HVQ), that consists of two subsequent vector quantization\nmodules. This results in a hierarchical clustering where the additional\nsubclusters cover the variations within a cluster. We demonstrate that our\napproach captures the distribution of segment lengths much better than the\nstate of the art. To this end, we introduce a new metric based on the\nJensen-Shannon Distance (JSD) for unsupervised temporal action segmentation. We\nevaluate our approach on three public datasets, namely Breakfast, YouTube\nInstructional and IKEA ASM. Our approach outperforms the state of the art in\nterms of F1 score, recall and JSD.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "377kl2ys8Lv9PwVLTQ4AZKAkEqQHjPZO9xC5UtM7Lh0",
  "pdfSize": "1744046"
}