{
  "id": "2412.04852",
  "title": "SleeperMark: Towards Robust Watermark against Fine-Tuning Text-to-image\n  Diffusion Models",
  "authors": "Zilan Wang, Junfeng Guo, Jiacheng Zhu, Yiming Li, Heng Huang, Muhao\n  Chen, Zhengzhong Tu",
  "authorsParsed": [
    [
      "Wang",
      "Zilan",
      ""
    ],
    [
      "Guo",
      "Junfeng",
      ""
    ],
    [
      "Zhu",
      "Jiacheng",
      ""
    ],
    [
      "Li",
      "Yiming",
      ""
    ],
    [
      "Huang",
      "Heng",
      ""
    ],
    [
      "Chen",
      "Muhao",
      ""
    ],
    [
      "Tu",
      "Zhengzhong",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 08:44:18 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733474658000,
  "abstract": "  Recent advances in large-scale text-to-image (T2I) diffusion models have\nenabled a variety of downstream applications, including style customization,\nsubject-driven personalization, and conditional generation. As T2I models\nrequire extensive data and computational resources for training, they\nconstitute highly valued intellectual property (IP) for their legitimate\nowners, yet making them incentive targets for unauthorized fine-tuning by\nadversaries seeking to leverage these models for customized, usually profitable\napplications. Existing IP protection methods for diffusion models generally\ninvolve embedding watermark patterns and then verifying ownership through\ngenerated outputs examination, or inspecting the model's feature space.\nHowever, these techniques are inherently ineffective in practical scenarios\nwhen the watermarked model undergoes fine-tuning, and the feature space is\ninaccessible during verification ((i.e., black-box setting). The model is prone\nto forgetting the previously learned watermark knowledge when it adapts to a\nnew task. To address this challenge, we propose SleeperMark, a novel framework\ndesigned to embed resilient watermarks into T2I diffusion models. SleeperMark\nexplicitly guides the model to disentangle the watermark information from the\nsemantic concepts it learns, allowing the model to retain the embedded\nwatermark while continuing to be fine-tuned to new downstream tasks. Our\nextensive experiments demonstrate the effectiveness of SleeperMark across\nvarious types of diffusion models, including latent diffusion models (e.g.,\nStable Diffusion) and pixel diffusion models (e.g., DeepFloyd-IF), showing\nrobustness against downstream fine-tuning and various attacks at both the image\nand model levels, with minimal impact on the model's generative capability. The\ncode is available at https://github.com/taco-group/SleeperMark.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "PF8bc6Bba-bWOCz1O78a_Pf-mguc0UWz7PBVNk4-v14",
  "pdfSize": "1525911"
}