{"id":"2412.11520","title":"EditSplat: Multi-View Fusion and Attention-Guided Optimization for\n  View-Consistent 3D Scene Editing with 3D Gaussian Splatting","authors":"Dong In Lee, Hyeongcheol Park, Jiyoung Seo, Eunbyung Park, Hyunje\n  Park, Ha Dam Baek, Shin Sangheon, Sangmin kim, Sangpil Kim","authorsParsed":[["Lee","Dong In",""],["Park","Hyeongcheol",""],["Seo","Jiyoung",""],["Park","Eunbyung",""],["Park","Hyunje",""],["Baek","Ha Dam",""],["Sangheon","Shin",""],["kim","Sangmin",""],["Kim","Sangpil",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 07:56:04 GMT"}],"updateDate":"2024-12-17","timestamp":1734335764000,"abstract":"  Recent advancements in 3D editing have highlighted the potential of\ntext-driven methods in real-time, user-friendly AR/VR applications. However,\ncurrent methods rely on 2D diffusion models without adequately considering\nmulti-view information, resulting in multi-view inconsistency. While 3D\nGaussian Splatting (3DGS) significantly improves rendering quality and speed,\nits 3D editing process encounters difficulties with inefficient optimization,\nas pre-trained Gaussians retain excessive source information, hindering\noptimization. To address these limitations, we propose \\textbf{EditSplat}, a\nnovel 3D editing framework that integrates Multi-view Fusion Guidance (MFG) and\nAttention-Guided Trimming (AGT). Our MFG ensures multi-view consistency by\nincorporating essential multi-view information into the diffusion process,\nleveraging classifier-free guidance from the text-to-image diffusion model and\nthe geometric properties of 3DGS. Additionally, our AGT leverages the explicit\nrepresentation of 3DGS to selectively prune and optimize 3D Gaussians,\nenhancing optimization efficiency and enabling precise, semantically rich local\nedits. Through extensive qualitative and quantitative evaluations, EditSplat\nachieves superior multi-view consistency and editing quality over existing\nmethods, significantly enhancing overall efficiency.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"6FMdCwOMHc5CVsxYv8btwsL-c0Hzn1xott_zTTbPTTE","pdfSize":"19878643"}