{
  "id": "2412.19306",
  "title": "Integrated Electro-Optic Absorption Modulator for Silicon Nitride\n  Platform",
  "authors": "Evgeniy S. Lotkov, Alexander S. Baburin, Ali S. Amiraslanov, Evgeniy\n  Chubchev, Alexander Dorofeenko, Evgeniy Andrianov, Ilya A. Ryzhikov, Evgeny\n  S. Sergeev, Kirill Buzaverov, Sergei S. Avdeev, Alex Kramarenko, Sergei\n  Bukatin, Victor I. Polozov, Olga S. Sorokina, Yuri V. Panfilov, Daria P.\n  Kulikova, Alexander V. Baryshev and Ilya A. Rodionov",
  "authorsParsed": [
    [
      "Lotkov",
      "Evgeniy S.",
      ""
    ],
    [
      "Baburin",
      "Alexander S.",
      ""
    ],
    [
      "Amiraslanov",
      "Ali S.",
      ""
    ],
    [
      "Chubchev",
      "Evgeniy",
      ""
    ],
    [
      "Dorofeenko",
      "Alexander",
      ""
    ],
    [
      "Andrianov",
      "Evgeniy",
      ""
    ],
    [
      "Ryzhikov",
      "Ilya A.",
      ""
    ],
    [
      "Sergeev",
      "Evgeny S.",
      ""
    ],
    [
      "Buzaverov",
      "Kirill",
      ""
    ],
    [
      "Avdeev",
      "Sergei S.",
      ""
    ],
    [
      "Kramarenko",
      "Alex",
      ""
    ],
    [
      "Bukatin",
      "Sergei",
      ""
    ],
    [
      "Polozov",
      "Victor I.",
      ""
    ],
    [
      "Sorokina",
      "Olga S.",
      ""
    ],
    [
      "Panfilov",
      "Yuri V.",
      ""
    ],
    [
      "Kulikova",
      "Daria P.",
      ""
    ],
    [
      "Baryshev",
      "Alexander V.",
      ""
    ],
    [
      "Rodionov",
      "Ilya A.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 26 Dec 2024 17:58:35 GMT"
    },
    {
      "version": "v2",
      "created": "Mon, 30 Dec 2024 17:30:59 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735235915000,
  "abstract": "  Silicon nitride (SiN) is currently the most prominent platform for photonics\nat visible and near-IR wavelength bandwidth. However, realizing fast\nelectro-optic (EO) modulators, the key components of any integrated optics\nplatform, remains challenging in SiN. Recently, transparent conductive oxides\n(TCO) have emerged as a promising platform for photonic integrated circuits.\nHere we make an important step towards exceeding possibilities of both\nplatforms, reporting for the first-time high-speed ITO electro-optic modulators\nbased on silicon nitride waveguides. The insertion losses of 5.7 dB and\nbandwidth of about 1 GHz are shown for 300 nm-thickness SiN waveguide platform\nwith 9.3-um-length hybrid waveguide. The fabrication process of devices\nrequires only standard clean room tools, is repeatable and compatible with the\nCMOS technology. Simulation results of optimized device designs indicate that\nfurther improvement is possible and offer promising opportunities towards\nsilicon nitride photonic computation platforms based on ITO.\n",
  "subjects": [
    "Physics/Optics",
    "Physics/Applied Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "r3Na3wV25PQAYRVXGsvlcZz3zqY-2SZlyjZW3TT0ek8",
  "pdfSize": "2598355"
}