{
  "id": "2412.15501",
  "title": "Humanlike Cognitive Patterns as Emergent Phenomena in Large Language\n  Models",
  "authors": "Zhisheng Tang, Mayank Kejriwal",
  "authorsParsed": [
    [
      "Tang",
      "Zhisheng",
      ""
    ],
    [
      "Kejriwal",
      "Mayank",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 02:26:56 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734661616000,
  "abstract": "  Research on emergent patterns in Large Language Models (LLMs) has gained\nsignificant traction in both psychology and artificial intelligence, motivating\nthe need for a comprehensive review that offers a synthesis of this complex\nlandscape. In this article, we systematically review LLMs' capabilities across\nthree important cognitive domains: decision-making biases, reasoning, and\ncreativity. We use empirical studies drawing on established psychological tests\nand compare LLMs' performance to human benchmarks. On decision-making, our\nsynthesis reveals that while LLMs demonstrate several human-like biases, some\nbiases observed in humans are absent, indicating cognitive patterns that only\npartially align with human decision-making. On reasoning, advanced LLMs like\nGPT-4 exhibit deliberative reasoning akin to human System-2 thinking, while\nsmaller models fall short of human-level performance. A distinct dichotomy\nemerges in creativity: while LLMs excel in language-based creative tasks, such\nas storytelling, they struggle with divergent thinking tasks that require\nreal-world context. Nonetheless, studies suggest that LLMs hold considerable\npotential as collaborators, augmenting creativity in human-machine\nproblem-solving settings. Discussing key limitations, we also offer guidance\nfor future research in areas such as memory, attention, and open-source model\ndevelopment.\n",
  "subjects": [
    "Computer Science/Computation and Language",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "X4UuIFjLIXVpQPH349nA3S9gHWr6UoDceOF-C48EeoA",
  "pdfSize": "494589"
}