{"id":"2412.20063","title":"Photonics detection of molecular-specific spatial structural alterations\n  in cell nuclei due to chronic alcoholism and probiotics treatments on colon\n  cancer via a light localization method using confocal imaging","authors":"Ishmael Apachigawo, Dhruvil Solanki, Santanu Maity, Pradeep Shukla,\n  Radhakrishna Rao, Prabhakar Pradhan","authorsParsed":[["Apachigawo","Ishmael",""],["Solanki","Dhruvil",""],["Maity","Santanu",""],["Shukla","Pradeep",""],["Rao","Radhakrishna",""],["Pradhan","Prabhakar",""]],"versions":[{"version":"v1","created":"Sat, 28 Dec 2024 07:36:16 GMT"}],"updateDate":"2024-12-31","timestamp":1735371376000,"abstract":"  Photonics/light localization techniques are important in understanding the\nstructural changes in biological tissues at the nano- to sub-micron scale. It\nis now known that structural alteration starts at the nanoscale at the\nbeginning of cancer progression. This study examines the molecular-specific\nnano-structural alterations of chronic alcoholism and probiotic effects on\ncolon cancer using a mouse model of colon cancer. Confocal microscopy and\nmesoscopic light-scattering analysis are applied to quantify structural changes\nin DNA (chromatin), cytoskeleton, and ki-67 protein cells with appropriate\nstaining dyes. We assessed alcohol-treated and azoxymethane (AOM) with dextran\nsulfate sodium (DSS)-induced colitis models, including ethanol (EtOH) and\nprobiotic (L.Casei) treatments separately and together. The inverse\nparticipation ratio (IPR) technique was employed to quantify the degree of\nlight localization to access the molecular-specific spatial structural disorder\nas a biomarker for cancer progression detection. Significant enhancement of\ncancer progression was observed in the alcohol-treated group, and probiotics\ntreatment with alcohol showed partial reversal of these changes in colon\ncancer. The results underscore the potential of the IPR technique in detecting\nearly structural changes in colon cancer, offering insights into the mitigating\neffects of probiotics on alcohol-induced enhancement of colon cancer.\n","subjects":["Physics/Medical Physics","Physics/Biological Physics","Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ovN_D04HHy0ZYhXzPLRMfo2SfNZd7XmJ92oP9zXX3Po","pdfSize":"961987"}