{"id":"2412.14146","title":"ARTEMIS-DA: An Advanced Reasoning and Transformation Engine for\n  Multi-Step Insight Synthesis in Data Analytics","authors":"Atin Sakkeer Hussain","authorsParsed":[["Hussain","Atin Sakkeer",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 18:44:08 GMT"},{"version":"v2","created":"Fri, 20 Dec 2024 20:25:03 GMT"},{"version":"v3","created":"Thu, 23 Jan 2025 07:06:15 GMT"}],"updateDate":"2025-01-24","timestamp":1734547448000,"abstract":"  This paper presents the Advanced Reasoning and Transformation Engine for\nMulti-Step Insight Synthesis in Data Analytics (ARTEMIS-DA), a novel framework\ndesigned to augment Large Language Models (LLMs) for solving complex,\nmulti-step data analytics tasks. ARTEMIS-DA integrates three core components:\nthe Planner, which dissects complex user queries into structured, sequential\ninstructions encompassing data preprocessing, transformation, predictive\nmodeling, and visualization; the Coder, which dynamically generates and\nexecutes Python code to implement these instructions; and the Grapher, which\ninterprets generated visualizations to derive actionable insights. By\norchestrating the collaboration between these components, ARTEMIS-DA\neffectively manages sophisticated analytical workflows involving advanced\nreasoning, multi-step transformations, and synthesis across diverse data\nmodalities. The framework achieves state-of-the-art (SOTA) performance on\nbenchmarks such as WikiTableQuestions and TabFact, demonstrating its ability to\ntackle intricate analytical tasks with precision and adaptability. By combining\nthe reasoning capabilities of LLMs with automated code generation and execution\nand visual analysis, ARTEMIS-DA offers a robust, scalable solution for\nmulti-step insight synthesis, addressing a wide range of challenges in data\nanalytics.\n","subjects":["Computer Science/Artificial Intelligence","Computer Science/Databases","Computer Science/Information Retrieval","Computer Science/Multiagent Systems"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"mqGoKURbg42_SRLjvffmTAq6gmpnNdv5GGkdzbScJeo","pdfSize":"38663679"}