{"id":"2412.16133","title":"Role of the ratio of tangential to normal stiffness coefficient on the\n  behaviour of vibrofluidised particles","authors":"Alok Tiwari and Sourav Ganguli and Manaswita Bose and V Kumaran","authorsParsed":[["Tiwari","Alok",""],["Ganguli","Sourav",""],["Bose","Manaswita",""],["Kumaran","V",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 18:30:12 GMT"}],"updateDate":"2024-12-23","timestamp":1734719412000,"abstract":"  The selection of parameters in the contact law for inter-particle\ninteractions affects the results of simulations of flowing granular materials.\nThe present study aims to understand the effect of the ratio of tangential to\nnormal spring stiffness coefficient ($\\kappa$) on inter-particle contact\nbehaviour in terms of the rotational coefficient of restitution determined\nusing data obtained from multi-particle simulations. The effect of $\\kappa$ on\nthe profiles of the micro- and macroscopic properties of particles in a\nvibrofluidised bed is also investigated. The Discrete Element Method (DEM) is\nused to simulate a vertically vibrated fluidised bed using the open-source\nsoftware LAMMPS. The inter-particle and wall-particle contact forces are\ndetermined using the linear spring-dashpot (LSD) model. The distribution of the\nmean co-ordination number, force during the contact, contact regimes, and\nrotational coefficient of restitution are determined from the data obtained\nfrom simulations. It was shown that $\\kappa$ plays a significant role in the\ndistribution of inter-particle contacts between different regimes and, thereby,\nthe velocity distribution and profiles of statistically averaged properties of\nthe vibrofluidised particles. Our results show that for particles with surface\nfriction coefficient $\\mu>0.1$, the commonly used value $\\kappa=\\frac{2}{7}$\nresults in quantitatively different results from those obtained using $0.67 \\le\n\\kappa < 1$, a range consistent with the realistic values of Poisson ratios for\nsimple materials.\n","subjects":["Condensed Matter/Soft Condensed Matter"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Cn8WRb9sjqzLDWJxjEjugkD8PyX_1TwaCDvdEFvtBFI","pdfSize":"10142615"}