{"id":"2412.14508","title":"Nuclear and Star Formation Activities in Nearby Galaxies: Roles of Gas\n  Supply and AGN Feedback","authors":"Huynh Anh N. Le and Yongquan Xue","authorsParsed":[["Le","Huynh Anh N.",""],["Xue","Yongquan",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 04:07:44 GMT"}],"updateDate":"2024-12-20","timestamp":1734581264000,"abstract":"  We analyzed a sample of $\\sim$113,000 galaxies ($\\rm z < 0.3$) from the Sloan\nDigital Sky Survey, divided into star-forming, composite, Seyfert, and LINER\ntypes, to explore the relationships between UV-to-optical colors ($\\rm u-r$),\nstar formation rates (SFRs), specific star formation rates (sSFRs), stellar\nvelocity dispersions ($\\rm \\sigma_{*}$), mass accretion rates onto the black\nhole ($\\rm L_{[OIII]}/\\sigma_{*}^{4}$), and Eddington ratios. Star-forming\ngalaxies predominantly feature young, blue stars along the main-sequence (MS)\nline, while composite, Seyfert, and LINER galaxies deviate from this line,\ndisplaying progressively older stellar populations and lower SFRs. $\\rm\nL_{[OIII]}/\\sigma_{*}^{4}$ and Eddington ratios are highest in Seyfert\ngalaxies, moderate in composite galaxies, and lowest in LINERs, with higher\nratios associated with bluer colors, indicating a younger stellar population\nand stronger active galactic nucleus (AGN) activity. These trends suggest a\nstrong correlation between sSFRs and Eddington ratios, highlighting a close\nconnection between AGN and star formation activities. These results may imply\nan evolutionary sequence where galaxies transition from blue star-forming\ngalaxies to red LINERs, passing through composite and Seyfert phases, driven\nprimarily by gas supply, with AGN feedback playing a secondary role. While both\nradio luminosities ($\\rm L_{1.4GHz}$) and Eddington ratios correlate with SFRs,\ntheir trends differ on the SFR$-$stellar mass ($\\rm M_{*}$) plane, with radio\nluminosities increasing with stellar mass along the MS line, and no direct\nconnection between radio luminosities and Eddington ratios. These findings may\nprovide new insights into the interplay between star formation, AGN activity,\nand radio emission in galaxies, shedding light on their evolutionary pathways.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"BdQDYYqkMH66r1KQsYSr-20FE2NXJoRUouT-AietY1k","pdfSize":"13956888"}