{"id":"2412.12493","title":"A Simple and Fast Way to Handle Semantic Errors in Transactions","authors":"Jinghan Zeng, Eugene Wu, Sanjay Krishnan","authorsParsed":[["Zeng","Jinghan",""],["Wu","Eugene",""],["Krishnan","Sanjay",""]],"versions":[{"version":"v1","created":"Tue, 17 Dec 2024 02:47:18 GMT"}],"updateDate":"2024-12-18","timestamp":1734403638000,"abstract":"  Many computer systems are now being redesigned to incorporate LLM-powered\nagents, enabling natural language input and more flexible operations. This\npaper focuses on handling database transactions created by large language\nmodels (LLMs). Transactions generated by LLMs may include semantic errors,\nrequiring systems to treat them as long-lived. This allows for human review\nand, if the transaction is incorrect, removal from the database history. Any\nremoval action must ensure the database's consistency (the \"C\" in ACID\nprinciples) is maintained throughout the process.\n  We propose a novel middleware framework based on Invariant Satisfaction\n(I-Confluence), which ensures consistency by identifying and coordinating\ndependencies between long-lived transactions and new transactions. This\nmiddleware buffers suspicious or compensating transactions to manage\ncoordination states. Using the TPC-C benchmark, we evaluate how transaction\ngeneration frequency, user reviews, and invariant completeness impact system\nperformance. For system researchers, this study establishes an interactive\nparadigm between LLMs and database systems, providing an \"undoing\" mechanism\nfor handling incorrect operations while guaranteeing database consistency. For\nsystem engineers, this paper offers a middleware design that integrates\nremovable LLM-generated transactions into existing systems with minimal\nmodifications.\n","subjects":["Computer Science/Databases","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"Do0YsRWiwpMrafAeqG9p8y6WVDFBl48Bl_U6MXl-Yi0","pdfSize":"1237922"}