{"id":"2412.13697","title":"Splitting criteria for ordinal decision trees: an experimental study","authors":"Rafael Ayll\\'on-Gavil\\'an, Francisco Jos\\'e Mart\\'inez-Estudillo,\n  David Guijo-Rubio, C\\'esar Herv\\'as-Mart\\'inez, Pedro Antonio Guti\\'errez","authorsParsed":[["Ayllón-Gavilán","Rafael",""],["Martínez-Estudillo","Francisco José",""],["Guijo-Rubio","David",""],["Hervás-Martínez","César",""],["Gutiérrez","Pedro Antonio",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 10:41:44 GMT"},{"version":"v2","created":"Mon, 17 Feb 2025 18:53:15 GMT"}],"updateDate":"2025-02-18","timestamp":1734518504000,"abstract":"  Ordinal Classification (OC) is a machine learning field that addresses\nclassification tasks where the labels exhibit a natural order. Unlike nominal\nclassification, which treats all classes as equally distinct, OC takes the\nordinal relationship into account, producing more accurate and relevant\nresults. This is particularly critical in applications where the magnitude of\nclassification errors has implications. Despite this, OC problems are often\ntackled using nominal methods, leading to suboptimal solutions. Although\ndecision trees are one of the most popular classification approaches, ordinal\ntree-based approaches have received less attention when compared to other\nclassifiers. This work conducts an experimental study of tree-based\nmethodologies specifically designed to capture ordinal relationships. A\ncomprehensive survey of ordinal splitting criteria is provided, standardising\nthe notations used in the literature for clarity. Three ordinal splitting\ncriteria, Ordinal Gini (OGini), Weighted Information Gain (WIG), and Ranking\nImpurity (RI), are compared to the nominal counterparts of the first two (Gini\nand information gain), by incorporating them into a decision tree classifier.\nAn extensive repository considering 45 publicly available OC datasets is\npresented, supporting the first experimental comparison of ordinal and nominal\nsplitting criteria using well-known OC evaluation metrics. Statistical analysis\nof the results highlights OGini as the most effective ordinal splitting\ncriterion to date. Source code, datasets, and results are made available to the\nresearch community.\n","subjects":["Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"vbXzg2BpSl0yu6BHdBqyVC5_FaYhS9vqZGUlscNUBcI","pdfSize":"3640121"}