{
  "id": "2412.16162",
  "title": "Survey Insights on M365 Copilot Adoption",
  "authors": "Muneera Bano, Didar Zowghi, Jon Whittle, Liming Zhu, Andrew Reeson,\n  Rob Martin, Jen Parsons",
  "authorsParsed": [
    [
      "Bano",
      "Muneera",
      ""
    ],
    [
      "Zowghi",
      "Didar",
      ""
    ],
    [
      "Whittle",
      "Jon",
      ""
    ],
    [
      "Zhu",
      "Liming",
      ""
    ],
    [
      "Reeson",
      "Andrew",
      ""
    ],
    [
      "Martin",
      "Rob",
      ""
    ],
    [
      "Parsons",
      "Jen",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 16:43:00 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1733157780000,
  "abstract": "  Australia's National Science Agency conducted a six-month trial of M365\nCopilot starting in January 2024 as part of an Australian Government\ninitiative. Three hundred licenses were distributed across CSIRO using a\npersona-based approach to ensure diversity of roles and attributes among\nparticipants. As a scientific research organisation with a unique operational\ncontext, our objective was to study the use of M365 Copilot on enhancing\nproductivity, efficiency, and creativity as well as overall satisfaction and\nethical considerations. This paper presents the results from two surveys,\nconducted before and after the trial. The results showed mixed outcomes, with\nparticipants reporting improved productivity and efficiency in structured tasks\nsuch as meeting summaries and email drafting. Gaps were identified in advanced\nfunctionalities and integration, which limited Copilot's overall effectiveness.\nSatisfaction levels were generally positive, but user experiences varied in\ncertain areas. Ethical concerns, particularly around data privacy, became more\npronounced post-trial. These findings highlight Copilot's potential and the\nneed for further refinement to meet users' diverse needs.\n",
  "subjects": [
    "Computer Science/Human-Computer Interaction"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "fJYJckt-AqGiCm0IudCQyHGkI83K1ILO8LZxBF0AkP8",
  "pdfSize": "615837"
}