{
  "id": "2412.09854",
  "title": "User Identity Protection in EEG-based Brain-Computer Interfaces",
  "authors": "L. Meng, X. Jiang, J. Huang, W. Li, H. Luo and D. Wu",
  "authorsParsed": [
    [
      "Meng",
      "L.",
      ""
    ],
    [
      "Jiang",
      "X.",
      ""
    ],
    [
      "Huang",
      "J.",
      ""
    ],
    [
      "Li",
      "W.",
      ""
    ],
    [
      "Luo",
      "H.",
      ""
    ],
    [
      "Wu",
      "D.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 04:48:33 GMT"
    }
  ],
  "updateDate": "2024-12-16",
  "timestamp": 1734065313000,
  "abstract": "  A brain-computer interface (BCI) establishes a direct communication pathway\nbetween the brain and an external device. Electroencephalogram (EEG) is the\nmost popular input signal in BCIs, due to its convenience and low cost. Most\nresearch on EEG-based BCIs focuses on the accurate decoding of EEG signals;\nhowever, EEG signals also contain rich private information, e.g., user\nidentity, emotion, and so on, which should be protected. This paper first\nexposes a serious privacy problem in EEG-based BCIs, i.e., the user identity in\nEEG data can be easily learned so that different sessions of EEG data from the\nsame user can be associated together to more reliably mine private information.\nTo address this issue, we further propose two approaches to convert the\noriginal EEG data into identity-unlearnable EEG data, i.e., removing the user\nidentity information while maintaining the good performance on the primary BCI\ntask. Experiments on seven EEG datasets from five different BCI paradigms\nshowed that on average the generated identity-unlearnable EEG data can reduce\nthe user identification accuracy from 70.01\\% to at most 21.36\\%, greatly\nfacilitating user privacy protection in EEG-based BCIs.\n",
  "subjects": [
    "Computer Science/Human-Computer Interaction",
    "Computer Science/Cryptography and Security",
    "Electrical Engineering and Systems Science/Signal Processing"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "j499OCnv-PJVyFD7tbHb54d2kmTMmZMvgC55VYuRtoI",
  "pdfSize": "1369344"
}