{
  "id": "2412.04405",
  "title": "Baryon Acoustic Oscillations from galaxy surveys",
  "authors": "Paula S. Ferreira and Ribamar R. R. Reis",
  "authorsParsed": [
    [
      "Ferreira",
      "Paula S.",
      ""
    ],
    [
      "Reis",
      "Ribamar R. R.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 18:24:02 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733423042000,
  "abstract": "  We conducted a review of the fundamental aspects of describing and detecting\nthe Baryon Acoustic Oscillation (BAO) feature in galaxy surveys, emphasizing\nthe optimal tools for constraining this probe based on the type of observation.\nAdditionally, we included new results with two spectroscopic datasets to\ndetermine the best-fit model for the power spectrum, $P(k)$. Using the\nframework described in a previous analysis, we applied this to a different\nsub-sample of the BOSS survey, specifically galaxies with redshifts\n$0.3<z<0.65$. We also examined the eBOSS dataset with redshifts $0.6<z<1.0$,\nadjusting the number of parameters in the traditional polynomial fit to account\nfor the higher redshift range. Our results showed that the dilation scale\nparameter $\\alpha$ derived from the BOSS dataset had smaller error bars\ncompared to the eBOSS dataset, attributable to the larger number of luminous\nred galaxies (LRGs) in the BOSS sample. We also compared our findings with\nother surveys such as WiggleZ, DES Y6, and DESI III, noting that photometric\nsurveys typically yield larger error bars due to their lower precision. The\nDESI III results were in good agreement with ours within $1\\sigma$, with most\nbins close to unity. The variation of $\\alpha$ with respect to the redshift is\nan unresolved issue in the field, appearing in both three-dimensional and\nangular tomographic analyses.\n",
  "subjects": [
    "Astrophysics/Cosmology and Nongalactic Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "xPahKkxVVj03CgRNjJBsLKnXriz6-B4uEIWY5hT3Lgk",
  "pdfSize": "1608154"
}