{
  "id": "2412.17211",
  "title": "Joint Multitarget Detection and Tracking with mmWave Radar",
  "authors": "Jiang Zhu, Menghuai Xu, Ruohai Guo, Fangyong Wang, Guangying Zheng and\n  Fengzhong Qu",
  "authorsParsed": [
    [
      "Zhu",
      "Jiang",
      ""
    ],
    [
      "Xu",
      "Menghuai",
      ""
    ],
    [
      "Guo",
      "Ruohai",
      ""
    ],
    [
      "Wang",
      "Fangyong",
      ""
    ],
    [
      "Zheng",
      "Guangying",
      ""
    ],
    [
      "Qu",
      "Fengzhong",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 01:42:07 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734918127000,
  "abstract": "  Accurate targets detection and tracking with mmWave radar is a key sensing\ncapability that will enable more intelligent systems, create smart, efficient,\nautomated system. This paper proposes an end-to-end detection-estimation-track\nframework named MNOMP-SPA-KF consisting of the target detection and estimation\nmodule, the data association (DA) module and the target tracking module. In the\ntarget estimation and detection module, a low complexity, super-resolution and\nconstant false alarm rate (CFAR) based two dimensional multisnapshot\nNewtonalized orthogonal matching pursuit (2D-MNOMP) is designed to extract the\nmultitarget's radial distances and velocities, followed by the conventional\n(Bartlett) beamformer to extract the multitarget's azimuths. In the DA module,\na sum product algorithm (SPA) is adopted to obtain the association\nprobabilities of the existed targets and measurements by incorporating the\nradial velocity information. The Kalman filter (KF) is implemented to perform\ntarget tracking in the target tracking module by exploiting the asymptotic\ndistribution of the estimators. To improve the detection probability of the\nweak targets, extrapolation is also coupled into the MNOMP-SPA-KF. Numerical\nand real data experiments demonstrate the effectiveness of the MNOMP-SPA-KF\nalgorithm, compared to other benchmark algorithms.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Signal Processing"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "huDAmk-FsZzPm9zNC0dvYoYx5Jx9yIDitnsnsTNLMuc",
  "pdfSize": "4077398"
}