{
  "id": "2412.10149",
  "title": "Learning Radical Excited States from Sparse Data",
  "authors": "Jingkun Shen, Lucy Walker, Kevin Ma, James D. Green, Hugo Bronstein,\n  Keith T. Butler, Timothy J. H. Hele",
  "authorsParsed": [
    [
      "Shen",
      "Jingkun",
      ""
    ],
    [
      "Walker",
      "Lucy",
      ""
    ],
    [
      "Ma",
      "Kevin",
      ""
    ],
    [
      "Green",
      "James D.",
      ""
    ],
    [
      "Bronstein",
      "Hugo",
      ""
    ],
    [
      "Butler",
      "Keith T.",
      ""
    ],
    [
      "Hele",
      "Timothy J. H.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 14:07:19 GMT"
    }
  ],
  "updateDate": "2024-12-16",
  "timestamp": 1734098839000,
  "abstract": "  Emissive organic radicals are currently of great interest for their potential\nuse in the next generation of highly efficient organic light emitting diode\n(OLED) devices and as molecular qubits. However, simulating their\noptoelectronic properties is challenging, largely due to spin-contamination and\nthe multireference character of their excited states. Here we present a\ndata-driven approach where, for the first time, the excited electronic states\nof organic radicals are learned directly from experimental excited state data,\nusing a much smaller amount of data than required by typical Machine Learning.\nWe adopt ExROPPP, a fast and spin-pure semiempirical method for calculation of\nexcited states of radicals, as a surrogate physical model for which we learn\nthe optimal set of parameters. We train the model on 81 previously published\nradicals and find that the trained model is a huge improvement over ExROPPP\nwith literature parameters, giving RMS and mean absolute errors of 0.24 and\n0.16 eV respectively with R$^2$ and SRCC of 0.86 and 0.88 respectively. We\nsynthesise four new radicals and validate the model on their spectra, finding\neven lower errors and similar correlation as for the testing set. This model\npaves the way for high throughput discovery of next-generation radical based\noptoelectronics.\n",
  "subjects": [
    "Physics/Chemical Physics",
    "Condensed Matter/Materials Science"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "0G0V4jlv4YCXn8YVNvMjgeUNOT2PaXwTDzpxIbGwVWc",
  "pdfSize": "8688410"
}