{
  "id": "2412.08471",
  "title": "Enhancement and speed-up of carrier dynamics in a dielectric nanocavity\n  with deep sub-wavelength confinement",
  "authors": "Gaoneng Dong, Ali Nawaz Babar, Rasmus Elleb{\\ae}k Christiansen,\n  S{\\o}ren Engelberth Hansen, S{\\o}ren Stobbe, Yi Yu, and Jesper M{\\o}rk",
  "authorsParsed": [
    [
      "Dong",
      "Gaoneng",
      ""
    ],
    [
      "Babar",
      "Ali Nawaz",
      ""
    ],
    [
      "Christiansen",
      "Rasmus Ellebæk",
      ""
    ],
    [
      "Hansen",
      "Søren Engelberth",
      ""
    ],
    [
      "Stobbe",
      "Søren",
      ""
    ],
    [
      "Yu",
      "Yi",
      ""
    ],
    [
      "Mørk",
      "Jesper",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 15:38:14 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733931494000,
  "abstract": "  The emergence of dielectric bowtie cavities enable optical confinement with\nultrahigh quality factor and ultra-small optical mode volumes with perspectives\nfor enhanced light-matter interaction. Experimental work has so far emphasized\nthe realization of these nanocavities. Here, we experimentally investigate the\nultrafast dynamics of a topology-optimized dielectric (silicon) bowtie\nnanocavity, with device dimensions down to 12 nm, that localizes light to a\nmode volume deep below the so-called diffraction limit given by the\nhalf-wavelength cubed. This strong spatial light concentration is shown to\nsignificantly enhance the carrier generation rate through two-photon\nabsorption, as well as reducing the time it takes for the carriers to recover.\nA diffusion time below 1 ps is achieved for the bowtie cavity, which is more\nthan an order of magnitude smaller than for a conventional microcavity.\nAdditionally, parametric effects due to coherent interactions between pump and\nprobe signals are also enhanced in the bowtie cavity, leading to an improved\nextinction ratio. These results demonstrate important fundamental advantages of\ndielectric bowtie cavities compared to conventional point-defect cavities,\nlaying a foundation for novel low-power and ultrafast optical devices,\nincluding switches and modulators.\n",
  "subjects": [
    "Physics/Optics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "2EPjXu2J8kPTj4df0a1sRiqHh14uuzSqTmB-GWQBLRQ",
  "pdfSize": "2363605"
}