{
  "id": "2412.03748",
  "title": "HIIF: Hierarchical Encoding based Implicit Image Function for Continuous\n  Super-resolution",
  "authors": "Yuxuan Jiang, Ho Man Kwan, Tianhao Peng, Ge Gao, Fan Zhang, Xiaoqing\n  Zhu, Joel Sole, and David Bull",
  "authorsParsed": [
    [
      "Jiang",
      "Yuxuan",
      ""
    ],
    [
      "Kwan",
      "Ho Man",
      ""
    ],
    [
      "Peng",
      "Tianhao",
      ""
    ],
    [
      "Gao",
      "Ge",
      ""
    ],
    [
      "Zhang",
      "Fan",
      ""
    ],
    [
      "Zhu",
      "Xiaoqing",
      ""
    ],
    [
      "Sole",
      "Joel",
      ""
    ],
    [
      "Bull",
      "David",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 22:35:20 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733351720000,
  "abstract": "  Recent advances in implicit neural representations (INRs) have shown\nsignificant promise in modeling visual signals for various low-vision tasks\nincluding image super-resolution (ISR). INR-based ISR methods typically learn\ncontinuous representations, providing flexibility for generating\nhigh-resolution images at any desired scale from their low-resolution\ncounterparts. However, existing INR-based ISR methods utilize multi-layer\nperceptrons for parameterization in the network; this does not take account of\nthe hierarchical structure existing in local sampling points and hence\nconstrains the representation capability. In this paper, we propose a new\n\\textbf{H}ierarchical encoding based \\textbf{I}mplicit \\textbf{I}mage\n\\textbf{F}unction for continuous image super-resolution, \\textbf{HIIF}, which\nleverages a novel hierarchical positional encoding that enhances the local\nimplicit representation, enabling it to capture fine details at multiple\nscales. Our approach also embeds a multi-head linear attention mechanism within\nthe implicit attention network by taking additional non-local information into\naccount. Our experiments show that, when integrated with different backbone\nencoders, HIIF outperforms the state-of-the-art continuous image\nsuper-resolution methods by up to 0.17dB in PSNR. The source code of HIIF will\nbe made publicly available at \\url{www.github.com}.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "oz8scGvx582NKztZA2keJAmPV3gwnYisfMjZraUrmBo",
  "pdfSize": "7249754"
}