{
  "id": "2412.07204",
  "title": "X-ray magnetic circular dichroism and resonant inelastic X-ray\n  scattering explained: role of many-body correlation and mixed-valence\n  fluctuations",
  "authors": "Beom Hyun Kim, Sang-Jun Lee, H. Huang, D. Lu, S. S. Hong, S. Lee, P.\n  Abbamonte, Y. I. Joe, P. Szypryt, W. B. Doriese, D. S. Swetz, J. N. Ullom,\n  C.-C. Kao, J.-S. Lee, and Bongjae Kim",
  "authorsParsed": [
    [
      "Kim",
      "Beom Hyun",
      ""
    ],
    [
      "Lee",
      "Sang-Jun",
      ""
    ],
    [
      "Huang",
      "H.",
      ""
    ],
    [
      "Lu",
      "D.",
      ""
    ],
    [
      "Hong",
      "S. S.",
      ""
    ],
    [
      "Lee",
      "S.",
      ""
    ],
    [
      "Abbamonte",
      "P.",
      ""
    ],
    [
      "Joe",
      "Y. I.",
      ""
    ],
    [
      "Szypryt",
      "P.",
      ""
    ],
    [
      "Doriese",
      "W. B.",
      ""
    ],
    [
      "Swetz",
      "D. S.",
      ""
    ],
    [
      "Ullom",
      "J. N.",
      ""
    ],
    [
      "Kao",
      "C. -C.",
      ""
    ],
    [
      "Lee",
      "J. -S.",
      ""
    ],
    [
      "Kim",
      "Bongjae",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 05:48:35 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733809715000,
  "abstract": "  X-ray magnetic circular dichroism (XMCD) and resonant inelastic X-ray\nscattering with magnetic circular dichroism (RIXS-MCD) provide unparalleled\ninsights into the electronic and magnetic dynamics of complex materials. Yet,\ntheir spectra remain challenging to interpret due to intricate many-body\ninteractions. Here, we introduce a theoretical framework based on the Anderson\nimpurity model, fully incorporating charge transfer (CT) and core-valence\nexchange correlation (CVEC) effects. Using epitaxial ferromagnetic\nLa0.7Sr0.3MnO3 film as a model system, we capture elusive spectral features,\ndemonstrating the necessity of CT inclusion for resolving XMCD subpeaks and\nrevealing the profound impact of CVEC on RIXS-MCD spectra. Our approach not\nonly successfully mirrors experimental results but also opens new avenues for\nexploring spin, orbital, and charge excitations in 3d transition metals and\nother correlated materials.\n",
  "subjects": [
    "Condensed Matter/Strongly Correlated Electrons",
    "Condensed Matter/Materials Science"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "JqgvgMIsMa6b0Rw6d0aD0ZI2qOmUe7PYXivY0g25mk8",
  "pdfSize": "1119679"
}