{
  "id": "2412.04637",
  "title": "Semantic Retrieval at Walmart",
  "authors": "Alessandro Magnani, Feng Liu, Suthee Chaidaroon, Sachin Yadav, Praveen\n  Reddy Suram, Ajit Puthenputhussery, Sijie Chen, Min Xie, Anirudh Kashi, Tony\n  Lee, Ciya Liao",
  "authorsParsed": [
    [
      "Magnani",
      "Alessandro",
      ""
    ],
    [
      "Liu",
      "Feng",
      ""
    ],
    [
      "Chaidaroon",
      "Suthee",
      ""
    ],
    [
      "Yadav",
      "Sachin",
      ""
    ],
    [
      "Suram",
      "Praveen Reddy",
      ""
    ],
    [
      "Puthenputhussery",
      "Ajit",
      ""
    ],
    [
      "Chen",
      "Sijie",
      ""
    ],
    [
      "Xie",
      "Min",
      ""
    ],
    [
      "Kashi",
      "Anirudh",
      ""
    ],
    [
      "Lee",
      "Tony",
      ""
    ],
    [
      "Liao",
      "Ciya",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 22:10:58 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733436658000,
  "abstract": "  In product search, the retrieval of candidate products before re-ranking is\nmore critical and challenging than other search like web search, especially for\ntail queries, which have a complex and specific search intent. In this paper,\nwe present a hybrid system for e-commerce search deployed at Walmart that\ncombines traditional inverted index and embedding-based neural retrieval to\nbetter answer user tail queries. Our system significantly improved the\nrelevance of the search engine, measured by both offline and online\nevaluations. The improvements were achieved through a combination of different\napproaches. We present a new technique to train the neural model at scale. and\ndescribe how the system was deployed in production with little impact on\nresponse time. We highlight multiple learnings and practical tricks that were\nused in the deployment of this system.\n",
  "subjects": [
    "Computer Science/Information Retrieval",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "giPfJ3K56qu5XX095_c6E0Z0sIAuyrgm8KMaiw2BpZE",
  "pdfSize": "563560"
}