{"id":"2412.13846","title":"From Expectation to Habit: Why Do Software Practitioners Adopt Fairness\n  Toolkits?","authors":"Gianmario Voria, Stefano Lambiase, Maria Concetta Schiavone, Gemma\n  Catolino, Fabio Palomba","authorsParsed":[["Voria","Gianmario",""],["Lambiase","Stefano",""],["Schiavone","Maria Concetta",""],["Catolino","Gemma",""],["Palomba","Fabio",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 13:38:28 GMT"},{"version":"v2","created":"Thu, 19 Dec 2024 10:22:55 GMT"}],"updateDate":"2024-12-20","timestamp":1734529108000,"abstract":"  As the adoption of machine learning (ML) systems continues to grow across\nindustries, concerns about fairness and bias in these systems have taken center\nstage. Fairness toolkits, designed to mitigate bias in ML models, serve as\ncritical tools for addressing these ethical concerns. However, their adoption\nin the context of software development remains underexplored, especially\nregarding the cognitive and behavioral factors driving their usage. As a deeper\nunderstanding of these factors could be pivotal in refining tool designs and\npromoting broader adoption, this study investigates the factors influencing the\nadoption of fairness toolkits from an individual perspective. Guided by the\nUnified Theory of Acceptance and Use of Technology (UTAUT2), we examined the\nfactors shaping the intention to adopt and actual use of fairness toolkits.\nSpecifically, we employed Partial Least Squares Structural Equation Modeling\n(PLS-SEM) to analyze data from a survey study involving practitioners in the\nsoftware industry. Our findings reveal that performance expectancy and habit\nare the primary drivers of fairness toolkit adoption. These insights suggest\nthat by emphasizing the effectiveness of these tools in mitigating bias and\nfostering habitual use, organizations can encourage wider adoption. Practical\nrecommendations include improving toolkit usability, integrating bias\nmitigation processes into routine development workflows, and providing ongoing\nsupport to ensure professionals see clear benefits from regular use.\n","subjects":["Computer Science/Software Engineering","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"4c4n8PCGMbWzphZHOEuKUdU1lkquDdJQlhjyU33Ch9I","pdfSize":"619279"}