{
  "id": "2412.15802",
  "title": "Electromagnetic particle-in-cell modeling of an electron cyclotron\n  resonance plasma discharge in hydrogen",
  "authors": "D. Eremin, Yu. Sharova, L. Heijmans, A.M. Yakunin, M. van de Kerkhof,\n  R.-P. Brinkmann, E. Kemaneci",
  "authorsParsed": [
    [
      "Eremin",
      "D.",
      ""
    ],
    [
      "Sharova",
      "Yu.",
      ""
    ],
    [
      "Heijmans",
      "L.",
      ""
    ],
    [
      "Yakunin",
      "A. M.",
      ""
    ],
    [
      "van de Kerkhof",
      "M.",
      ""
    ],
    [
      "Brinkmann",
      "R. -P.",
      ""
    ],
    [
      "Kemaneci",
      "E.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 11:22:57 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734693777000,
  "abstract": "  A low pressure discharge sustained in molecular hydrogen with help of the\nelectron cyclotron resonance heating at a frequency of 2.45 GHz is simulated\nusing a fully electromagnetic implicit charge- and energy-conserving\nparticle-in-cell/Monte Carlo code. The simulations show a number of kinetic\neffects, and the results are in good agreement with various experimentally\nmeasured data such as electron density, electron temperature and degree of\ndissociation. The electron energy distribution shows a tri-Maxwellian form due\nto a number of different electron heating mechanisms, agreeing with the\nexperimental data in the measured electron energy interval. The simulation\nresults are also verified against a drift-diffusion model and proximity is\nobserved between the computational results for the plasma density at the\nlocation of experimental measurement. However, the fluid approximation fails to\naccurately predict radical density and electron temperature because of the\nassumption of a single electron temperature. Special attention is paid to the\ncharacteristics of hydrogen radicals, whose production is strongly\nunderestimated by the fluid model, whereas it is well predicted by the model\nconsidered here. The energy distribution of such radicals demonstrates the\npresence of a relatively large number of energetic hydrogen atoms produced by\nthe dissociation of molecular hydrogen. The new insights are of significance\nfor practical applications of hydrogen plasmas.\n",
  "subjects": [
    "Physics/Plasma Physics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "Y--JniWJHjl4MtKpObgRp2IBmzNQPIzG-yKpaDMY-b0",
  "pdfSize": "4541036"
}