{
  "id": "2412.16098",
  "title": "Explainable AI for Multivariate Time Series Pattern Exploration: Latent\n  Space Visual Analytics with Temporal Fusion Transformer and Variational\n  Autoencoders in Power Grid Event Diagnosis",
  "authors": "Haowen Xu, Ali Boyaci, Jianming Lian, Aaron Wilson",
  "authorsParsed": [
    [
      "Xu",
      "Haowen",
      ""
    ],
    [
      "Boyaci",
      "Ali",
      ""
    ],
    [
      "Lian",
      "Jianming",
      ""
    ],
    [
      "Wilson",
      "Aaron",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 17:41:11 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 24 Dec 2024 05:04:52 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1734716471000,
  "abstract": "  Detecting and analyzing complex patterns in multivariate time-series data is\ncrucial for decision-making in urban and environmental system operations.\nHowever, challenges arise from the high dimensionality, intricate complexity,\nand interconnected nature of complex patterns, which hinder the understanding\nof their underlying physical processes. Existing AI methods often face\nlimitations in interpretability, computational efficiency, and scalability,\nreducing their applicability in real-world scenarios. This paper proposes a\nnovel visual analytics framework that integrates two generative AI models,\nTemporal Fusion Transformer (TFT) and Variational Autoencoders (VAEs), to\nreduce complex patterns into lower-dimensional latent spaces and visualize them\nin 2D using dimensionality reduction techniques such as PCA, t-SNE, and UMAP\nwith DBSCAN. These visualizations, presented through coordinated and\ninteractive views and tailored glyphs, enable intuitive exploration of complex\nmultivariate temporal patterns, identifying patterns' similarities and uncover\ntheir potential correlations for a better interpretability of the AI outputs.\nThe framework is demonstrated through a case study on power grid signal data,\nwhere it identifies multi-label grid event signatures, including faults and\nanomalies with diverse root causes. Additionally, novel metrics and\nvisualizations are introduced to validate the models and evaluate the\nperformance, efficiency, and consistency of latent maps generated by TFT and\nVAE under different configurations. These analyses provide actionable insights\nfor model parameter tuning and reliability improvements. Comparative results\nhighlight that TFT achieves shorter run times and superior scalability to\ndiverse time-series data shapes compared to VAE. This work advances fault\ndiagnosis in multivariate time series, fostering explainable AI to support\ncritical system operations.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "GgMGRNufZJ_olfNxg0mQGNyYWeKFd2laqzOyuO1mAug",
  "pdfSize": "2381168"
}