{
  "id": "2412.13566",
  "title": "Projective purification of correlated reduced density matrices",
  "authors": "Elias Pescoller, Marie Eder, Iva B\\v{r}ezinov\\'a",
  "authorsParsed": [
    [
      "Pescoller",
      "Elias",
      ""
    ],
    [
      "Eder",
      "Marie",
      ""
    ],
    [
      "Březinová",
      "Iva",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 07:33:51 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734507231000,
  "abstract": "  In the search for accurate approximate solutions of the many-body\nSchr\\\"odinger equation, reduced density matrices play an important role, as\nthey allow to formulate approximate methods with polynomial scaling in the\nnumber of particles. However, these methods frequently encounter the issue of\n$N$-representability, whereby in self-consistent applications of the methods,\nthe reduced density matrices become unphysical. A number of algorithms have\nbeen proposed in the past to restore a given set of $N$-representability\nconditions once the reduced density matrices become defective. However, these\npurification algorithms have either ignored symmetries of the Hamiltonian\nrelated to conserved quantities, or have not incorporated them in an efficient\nway, thereby modifying the reduced density matrix to a greater extent than is\nnecessary. In this paper, we present an algorithm capable of efficiently\nperforming all of the following tasks in the least invasive manner: restoring a\ngiven set of $N$-representability conditions, maintaining contraction\nconsistency between successive orders of reduced density matrices, and\npreserving all conserved quantities. We demonstrate the superiority of the\npresent purification algorithm over previous ones in the context of the\ntime-dependent two-particle reduced density matrix method applied to the quench\ndynamics of the Fermi-Hubbard model.\n",
  "subjects": [
    "Physics/Quantum Physics",
    "Condensed Matter/Strongly Correlated Electrons"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "rWdZiUGUiH8jpRpmn1ZAXF_ZTf78fkhTIrE_G7DNEX8",
  "pdfSize": "1087044"
}