{
  "id": "2412.20806",
  "title": "LEO Satellite-Enabled Random Access with Large Differential Delay and\n  Doppler Shift",
  "authors": "Boxiao Shen, Yongpeng Wu, Wenjun Zhang, Symeon Chatzinotas, Bj\\\"orn\n  Ottersten",
  "authorsParsed": [
    [
      "Shen",
      "Boxiao",
      ""
    ],
    [
      "Wu",
      "Yongpeng",
      ""
    ],
    [
      "Zhang",
      "Wenjun",
      ""
    ],
    [
      "Chatzinotas",
      "Symeon",
      ""
    ],
    [
      "Ottersten",
      "Björn",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 30 Dec 2024 09:01:07 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735549267000,
  "abstract": "  This paper investigates joint device identification, channel estimation, and\nsymbol detection for LEO satellite-enabled grant-free random access systems,\nspecifically targeting scenarios where remote Internet-of-Things (IoT) devices\noperate without global navigation satellite system (GNSS) assistance.\nConsidering the constrained power consumption of these devices, the large\ndifferential delay and Doppler shift are handled at the satellite receiver. We\nfirstly propose a spreading-based multi-frame transmission scheme with\northogonal time-frequency space (OTFS) modulation to mitigate the doubly\ndispersive effect in time and frequency, and then analyze the input-output\nrelationship of the system. Next, we propose a receiver structure based on\nthree modules: a linear module for identifying active devices that leverages\nthe generalized approximate message passing algorithm to eliminate inter-user\nand inter-carrier interference; a non-linear module that employs the message\npassing algorithm to jointly estimate the channel and detect the transmitted\nsymbols; and a third module that aims to exploit the three dimensional block\nchannel sparsity in the delay-Doppler-angle domain. Soft information is\nexchanged among the three modules by careful message scheduling. Furthermore,\nthe expectation-maximization algorithm is integrated to adjust phase rotation\ncaused by the fractional Doppler and to learn the hyperparameters in the\npriors. Finally, the convolutional neural network is incorporated to enhance\nthe symbol detection. Simulation results demonstrate that the proposed\ntransmission scheme boosts the system performance, and the designed algorithms\noutperform the conventional methods significantly in terms of the device\nidentification, channel estimation, and symbol detection.\n",
  "subjects": [
    "Computer Science/Information Theory",
    "Electrical Engineering and Systems Science/Signal Processing",
    "Mathematics/Information Theory"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "Zx9mifDXcaQjfyII-cZxxgKuiCG2JO8giEl-Ag8F3So",
  "pdfSize": "2165186"
}