{
  "id": "2412.16992",
  "title": "Generalized Teleportation Fidelity and Singlet Fraction and their\n  Relation for (In)-distinguishable Particles and Its Applications",
  "authors": "Soumya Das, Goutam Paul and Anindya Banerji",
  "authorsParsed": [
    [
      "Das",
      "Soumya",
      ""
    ],
    [
      "Paul",
      "Goutam",
      ""
    ],
    [
      "Banerji",
      "Anindya",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 22 Dec 2024 12:20:38 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734870038000,
  "abstract": "  Quantum teleportation efficiently transfers quantum information between\ndistant locations by utilizing a pre-established composite system. Assessing\nthe effectiveness of teleportation hinges on its fidelity, representing the\nsimilarity between input and output states. This fidelity, in turn, relies on a\nsinglet fraction, quantifying the resemblance of the composite system to\nmaximally entangled states. The relation between teleportation fidelity and\nsinglet fraction given by [Horodecki \\textit{et al}., Phy. Rev. A \\textbf{60},\n1888 (1999)] does not hold for distinguishable particles with multiple degrees\nof freedom or indistinguishable particles with single or multiple degrees of\nfreedom. In this paper, we propose generalized expressions for teleportation\nfidelity and singlet fraction and derive their relations, applicable for both\ndistinguishable and indistinguishable particles with single or multiple degrees\nof freedom. We derive an upper bound for the generalized singlet fraction for\ndistinguishable particles using the monogamy of singlet fraction by [Kay\n\\textit{et al.} Phys. Rev. Lett. \\textbf{103}, 050501 (2009)]. We also show how\nour relation helps to characterize different types of composite states in terms\nof their distinguishability, separability, presence of maximally entangled\nstructure, and the number of degrees of freedom. We complement our theory with\ntwo practical illustrations. First, we demonstrate two counter-intuitive values\nof generalized singlet fraction using our optical circuit and the circuit of\n[Li \\textit{et al.}, Phys. Rev. Lett. \\textbf{120}, 050404 (2018)]. Finally, we\nshow that using an additional degree of freedom as an ancilla instead of a\nparticle can be advantageous in quantum cryptographic protocols.\n",
  "subjects": [
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "a3VxRz0e88Kkhbb2FFYz_0dsU3bpeXPGmnDka_sYAkQ",
  "pdfSize": "1700979"
}