{"id":"2412.08383","title":"YIG/CoFeB bilayer magnonic diode","authors":"Noura Zenbaa, Khrystyna O. Levchenko, Jaganandha Panda, Krist\\'yna\n  Dav\\'idkov\\'a, Moritz Ruhwedel, Sebastian Knauer, Morris Lindner, Carsten\n  Dubs, Qi Wang, Michal Urb\\'anek, Philipp Pirro, and Andrii V. Chumak","authorsParsed":[["Zenbaa","Noura",""],["Levchenko","Khrystyna O.",""],["Panda","Jaganandha",""],["Davídková","Kristýna",""],["Ruhwedel","Moritz",""],["Knauer","Sebastian",""],["Lindner","Morris",""],["Dubs","Carsten",""],["Wang","Qi",""],["Urbánek","Michal",""],["Pirro","Philipp",""],["Chumak","Andrii V.",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 13:48:59 GMT"}],"updateDate":"2024-12-12","timestamp":1733924939000,"abstract":"  We demonstrate a magnonic diode based on a bilayer structure of Yttrium Iron\nGarnet (YIG) and Cobalt Iron Boron (CoFeB). The bilayer exhibits pronounced\nnon-reciprocal spin-wave propagation, enabled by dipolar coupling and the\nmagnetic properties of the two layers. The YIG layer provides low damping and\nefficient spin-wave propagation, while the CoFeB layer introduces strong\nmagnetic anisotropy, critical for achieving diode functionality. Experimental\nresults, supported by numerical simulations, show unidirectional propagation of\nMagnetostatic Surface Spin Waves (MSSW), significantly suppressing\nbackscattered waves. This behavior was confirmed through wavevector-resolved\nand micro-focused Brillouin Light Scattering measurements and is supported by\nnumerical simulations. The proposed YIG/SiO$_2$/CoFeB bilayer magnonic diode\ndemonstrates the feasibility of leveraging non-reciprocal spin-wave dynamics\nfor functional magnonic devices, paving the way for energy-efficient,\nwave-based signal processing technologies.\n","subjects":["Physics/Applied Physics","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"i4UDeusQpetghqoSnf6PsXC-Ga0hu_SZOyASU-8yvqk","pdfSize":"2646490"}