{"id":"2412.01983","title":"Smart Parking with Pixel-Wise ROI Selection for Vehicle Detection Using\n  YOLOv8, YOLOv9, YOLOv10, and YOLOv11","authors":"Gustavo P. C. P. da Luz, Gabriel Massuyoshi Sato, Luis Fernando Gomez\n  Gonzalez and Juliana Freitag Borin","authorsParsed":[["da Luz","Gustavo P. C. P.",""],["Sato","Gabriel Massuyoshi",""],["Gonzalez","Luis Fernando Gomez",""],["Borin","Juliana Freitag",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 21:24:31 GMT"},{"version":"v2","created":"Fri, 6 Dec 2024 20:56:05 GMT"}],"updateDate":"2024-12-10","timestamp":1733174671000,"abstract":"  The increasing urbanization and the growing number of vehicles in cities have\nunderscored the need for efficient parking management systems. Traditional\nsmart parking solutions often rely on sensors or cameras for occupancy\ndetection, each with its limitations. Recent advancements in deep learning have\nintroduced new YOLO models (YOLOv8, YOLOv9, YOLOv10, and YOLOv11), but these\nmodels have not been extensively evaluated in the context of smart parking\nsystems, particularly when combined with Region of Interest (ROI) selection for\nobject detection. Existing methods still rely on fixed polygonal ROI selections\nor simple pixel-based modifications, which limit flexibility and precision.\nThis work introduces a novel approach that integrates Internet of Things, Edge\nComputing, and Deep Learning concepts, by using the latest YOLO models for\nvehicle detection. By exploring both edge and cloud computing, it was found\nthat inference times on edge devices ranged from 1 to 92 seconds, depending on\nthe hardware and model version. Additionally, a new pixel-wise post-processing\nROI selection method is proposed for accurately identifying regions of interest\nto count vehicles in parking lot images. The proposed system achieved 99.68%\nbalanced accuracy on a custom dataset of 3,484 images, offering a\ncost-effective smart parking solution that ensures precise vehicle detection\nwhile preserving data privacy\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"1bQHuRdYH3BY3SfoRMqKTRQrgDIxmyhkBJLkutuxuEs","pdfSize":"4682275"}