{
  "id": "2412.07962",
  "title": "Mayfly: Private Aggregate Insights from Ephemeral Streams of On-Device\n  User Data",
  "authors": "Christopher Bian, Albert Cheu, Stanislav Chiknavaryan, Zoe Gong, Marco\n  Gruteser, Oliver Guinan, Yannis Guzman, Peter Kairouz, Artem Lagzdin, Ryan\n  McKenna, Grace Ni, Edo Roth, Maya Spivak, Timon Van Overveldt, Ren Yi",
  "authorsParsed": [
    [
      "Bian",
      "Christopher",
      ""
    ],
    [
      "Cheu",
      "Albert",
      ""
    ],
    [
      "Chiknavaryan",
      "Stanislav",
      ""
    ],
    [
      "Gong",
      "Zoe",
      ""
    ],
    [
      "Gruteser",
      "Marco",
      ""
    ],
    [
      "Guinan",
      "Oliver",
      ""
    ],
    [
      "Guzman",
      "Yannis",
      ""
    ],
    [
      "Kairouz",
      "Peter",
      ""
    ],
    [
      "Lagzdin",
      "Artem",
      ""
    ],
    [
      "McKenna",
      "Ryan",
      ""
    ],
    [
      "Ni",
      "Grace",
      ""
    ],
    [
      "Roth",
      "Edo",
      ""
    ],
    [
      "Spivak",
      "Maya",
      ""
    ],
    [
      "Van Overveldt",
      "Timon",
      ""
    ],
    [
      "Yi",
      "Ren",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 22:58:36 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733871516000,
  "abstract": "  This paper introduces Mayfly, a federated analytics approach enabling\naggregate queries over ephemeral on-device data streams without central\npersistence of sensitive user data. Mayfly minimizes data via on-device\nwindowing and contribution bounding through SQL-programmability, anonymizes\nuser data via streaming differential privacy (DP), and mandates immediate\nin-memory cross-device aggregation on the server -- ensuring only privatized\naggregates are revealed to data analysts. Deployed for a sustainability use\ncase estimating transportation carbon emissions from private location data,\nMayfly computed over 4 million statistics across more than 500 million devices\nwith a per-device, per-week DP $\\varepsilon = 2$ while meeting strict data\nutility requirements. To achieve this, we designed a new DP mechanism for\nGroup-By-Sum workloads leveraging statistical properties of location data, with\npotential applicability to other domains.\n",
  "subjects": [
    "Computer Science/Cryptography and Security",
    "Computer Science/Databases"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "bKw-kfAenhkldrCyfFBoOfiQPFEm_xuMODID7CtiAdY",
  "pdfSize": "703628"
}