{
  "id": "2412.03316",
  "title": "First Detection of Radio Emission from the Intermediate Mass Black Hole\n  in POX 52: Deep Multi-Band Observations with ATCA and VLA",
  "authors": "Qi Yuan, Hengxiao Guo, Minfeng Gu, Jamie Stevens, Philip G. Edwards,\n  Yongjun Chen, Wenwen Zuo, Jingbo Sun, Jun Yang, Paulina Lira, Tao An, Renzhi\n  Su, Yuanqi Liu, Yijun Wang, Ning Chang, Pengfei Jiang, Ming Zhang",
  "authorsParsed": [
    [
      "Yuan",
      "Qi",
      ""
    ],
    [
      "Guo",
      "Hengxiao",
      ""
    ],
    [
      "Gu",
      "Minfeng",
      ""
    ],
    [
      "Stevens",
      "Jamie",
      ""
    ],
    [
      "Edwards",
      "Philip G.",
      ""
    ],
    [
      "Chen",
      "Yongjun",
      ""
    ],
    [
      "Zuo",
      "Wenwen",
      ""
    ],
    [
      "Sun",
      "Jingbo",
      ""
    ],
    [
      "Yang",
      "Jun",
      ""
    ],
    [
      "Lira",
      "Paulina",
      ""
    ],
    [
      "An",
      "Tao",
      ""
    ],
    [
      "Su",
      "Renzhi",
      ""
    ],
    [
      "Liu",
      "Yuanqi",
      ""
    ],
    [
      "Wang",
      "Yijun",
      ""
    ],
    [
      "Chang",
      "Ning",
      ""
    ],
    [
      "Jiang",
      "Pengfei",
      ""
    ],
    [
      "Zhang",
      "Ming",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 13:49:15 GMT"
    },
    {
      "version": "v2",
      "created": "Sat, 11 Jan 2025 12:53:03 GMT"
    }
  ],
  "updateDate": "2025-01-14",
  "timestamp": 1733320155000,
  "abstract": "  We present the first multi-band centimeter detection of POX 52, a nearby\ndwarf galaxy believed to habor a robust intermediate mass black hole (IMBH). We\nconducted the deep observations using the Australia Telescope Compact Array\n(ATCA), spanning frequencies from 4.5 to 10 GHz, as well as the sensitive\nobservations from the Karl G. Jansky Very Large Array (VLA) operating in its\nmost extended A-configuration at S band (2--4 GHz) and C band (4--8 GHz). In\nthe ATCA observations, the source shows a compact morphology, with only one\ndirection marginally resolved. The higher resolution of the VLA allowed us to\nslightly resolve the source, fitting it well with a two-dimensional Gaussian\nmodel. The detected radio emission confirms the presence of Active Galactic\nNucleus (AGN) activity, indicating either a low-power jet or AGN-driven\nwinds/outflows. Our dual-epoch observations with ATCA and VLA, together with\nprevious non-detection flux density upper limits, reveal radio emission\nvariability spanning two decades. In addition, we find that POX 52 aligns well\nwith the low-mass extension of the fundamental plane for high-accretion,\nradio-quiet massive AGNs.\n",
  "subjects": [
    "Astrophysics/Astrophysics of Galaxies",
    "Astrophysics/Cosmology and Nongalactic Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "H7Zm_e9pp0wv2qxOUrueiqPndmfX8dm0FWV_6GS-tEY",
  "pdfSize": "785818"
}