{
  "id": "2412.13410",
  "title": "The spin-switch scanning tunneling microscopy: an architecture to probe\n  electron-phonon interactions in the atomic scale",
  "authors": "Dezhi Song, Fuyang Huang, Yu Gao, Jiamin Yao, Haimin Zhang, Haiming\n  Huang, Jun Zhang, Xu-Cun Ma, Qi-Kun Xue, Ye-Ping Jiang",
  "authorsParsed": [
    [
      "Song",
      "Dezhi",
      ""
    ],
    [
      "Huang",
      "Fuyang",
      ""
    ],
    [
      "Gao",
      "Yu",
      ""
    ],
    [
      "Yao",
      "Jiamin",
      ""
    ],
    [
      "Zhang",
      "Haimin",
      ""
    ],
    [
      "Huang",
      "Haiming",
      ""
    ],
    [
      "Zhang",
      "Jun",
      ""
    ],
    [
      "Ma",
      "Xu-Cun",
      ""
    ],
    [
      "Xue",
      "Qi-Kun",
      ""
    ],
    [
      "Jiang",
      "Ye-Ping",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 00:57:08 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734483428000,
  "abstract": "  On the spin-valve-like ferromagnet/spin glass/ferromagnet (FM/SG/FM)\nstructure, the tunneling current is dominated by resistance switch (RS) instead\nof the local density of states according to the conventional tunneling theory.\nHere we show lattice-site dependent RS behaviors in one-quintuple-layer Bi2Te3\ndeposited on single MnBi2Te4 septuple layer, which comes from the difference in\nthe efficiency of tunneling electrons to induce focused current or phonons at\ndifferent sites, switching remotely the spin valve by spin-transfer torque or\nspin-phonon interactions. These lead to the observation of the dynamic 2-state\nlattice when the tip scans across the surface as well as the ability of\nscanning tunneling microscope (STM) to reveal atomic-scale features of\nelectron-phonon (EP) interactions. Our work demonstrates the possibility of the\nspin-switch STM to image lattice-site dependent EP interactions of any\nmaterials deposited on the FM/SG/FM structure.\n",
  "subjects": [
    "Condensed Matter/Materials Science",
    "Condensed Matter/Mesoscale and Nanoscale Physics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "NWjuWtJxSE8ihr-tMj1obp0IAGBpUNXgNqvWMb1l0F4",
  "pdfSize": "3368046"
}