{"id":"2412.13741","title":"Data-driven assessment of optimal spatiotemporal resolutions for\n  information extraction in noisy time series data","authors":"Domiziano Doria, Simone Martino, Matteo Becchi, Giovanni M. Pavan","authorsParsed":[["Doria","Domiziano",""],["Martino","Simone",""],["Becchi","Matteo",""],["Pavan","Giovanni M.",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 11:17:42 GMT"},{"version":"v2","created":"Thu, 19 Dec 2024 08:52:08 GMT"},{"version":"v3","created":"Thu, 30 Jan 2025 13:51:45 GMT"},{"version":"v4","created":"Sat, 8 Feb 2025 09:52:29 GMT"}],"updateDate":"2025-02-11","timestamp":1734520662000,"abstract":"  In general, comprehension of any type of complex system depends on the\nresolution used to examine the phenomena occurring within it. However,\nidentifying a priori, for example, the best time frequencies/scales to study a\ncertain system over-time, or the spatial distances at which correlations,\nsymmetries, and fluctuations are, most often non-trivial. Here we describe an\nunsupervised approach that, starting solely from the data of a system, allows\nlearning the characteristic length scales of the dominant key events/processes\nand the optimal spatiotemporal resolutions to characterize them. We tested this\napproach on time series data obtained from simulation or experimental\ntrajectories of various example many-body complex systems ranging from the\natomic to the macroscopic scale and having diverse internal dynamic\ncomplexities. Our method automatically analyzes the system data by analyzing\ncorrelations at all relevant inter-particle distances and at all possible\ninter-frame intervals in which their time series can be subdivided, namely, at\nall space and time resolutions. The optimal spatiotemporal resolution for\nstudying a certain system thus maximizes information extraction and\nclassification from the system's data, which we prove to be related to the\ncharacteristic spatiotemporal length scales of the local/collective physical\nevents dominating it. This approach is broadly applicable and can be used to\noptimize the study of different types of data (static distributions, time\nseries, or signals). The concept of 'optimal resolution' has a general\ncharacter and provides a robust basis for characterizing any type of system\nbased on its data, as well as to guide data analysis in general.\n","subjects":["Physics/Data Analysis, Statistics and Probability"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"2GafeM8tlsqDjtvSlXZPF6W2-39cFADWSDFocqEYWsc","pdfSize":"7952257"}