{
  "id": "2412.18455",
  "title": "Amplifier scheme: driven by indirect-drive under 10 MJ laser toward\n  inertial fusion energy",
  "authors": "Yongsheng Li, Ke Lan, Hui Cao, Yao-Hua Chen, Xiaohui Zhao, Zhan Sui",
  "authorsParsed": [
    [
      "Li",
      "Yongsheng",
      ""
    ],
    [
      "Lan",
      "Ke",
      ""
    ],
    [
      "Cao",
      "Hui",
      ""
    ],
    [
      "Chen",
      "Yao-Hua",
      ""
    ],
    [
      "Zhao",
      "Xiaohui",
      ""
    ],
    [
      "Sui",
      "Zhan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 24 Dec 2024 14:30:26 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1735050626000,
  "abstract": "  Burn efficiency is a key for commercial feasibility of fusion power station\nfor inertial fusion energy, while burn efficiency is usually lower than 30% in\nthe central ignition scheme of inertial confinement fusion (ICF). A recent\nconceptual design for a 10 MJ laser driver [Z. Sui and K. Lan et al., Matter\nRadiat. Extremes 9, 043002 (2024)] provides a new room for target design to\nachieve a higher burn efficiency. Here, we take the advantage of fuel density\nin reaction rate and propose a novel amplifier scheme for increasing burn\nefficiency via two cascading explosions by ICF. The amplifier scheme can be\nrealized either by indirect-drive or by direct-drive. Here, we give a 1D design\nfor an indirect-driven amplifier capsule containing 2.02 mg DT fuel under a 300\neV radiation generated by a 10 MJ and 1785 TW laser inside an octahedral\nspherical hohlraum. As a result, the amplifier capsule has a burn efficiency of\n48% and a gain of 33 at a convergence ratio of 24. This novel scheme can\nachieve a relatively high burn efficiency at a relatively low convergence\nratio, which can greatly relax the stringent requirements of high gain fusion\non hot spot ignition conditions and engineering issues.\n",
  "subjects": [
    "Physics/Plasma Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "hAq62rQUjAnuxc6tf89UgAiUE3zj_oGcnr2-j80ssnc",
  "pdfSize": "2078181"
}