{"id":"2412.14448","title":"Instability of the Environment as a Necessary Condition for Optimal\n  Control of an Economic Object","authors":"Sergey Masaev","authorsParsed":[["Masaev","Sergey",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 01:57:40 GMT"}],"updateDate":"2024-12-20","timestamp":1734573460000,"abstract":"  A review of economic approaches showed the lack of a universal method for\nassessing management decisions in the face of an increasing volume of analyzed\ndata and changing parameters of the external environment. The method of\nintegral indicators is proposed. Integral indicators are one of the modern\nmethods for researching the behavior of an enterprise. It provides an\nassessment of the impact of the external environment. It shows the ability of\nthe enterprise to adapt to new conditions. The dynamics of the correlation\nindicator shows the reaction of the enterprise to the impact of external\nfactors. The purpose of the scientific work was achieved: the optimal control\nof the enterprise was carried out in the conditions of changing the parameters\nof the external environment For this, the model of the economic object and the\nmethod of its analysis are formalized. The structure of an economic object\n(enterprise) is given. The characteristics of the parameters of the external\nenvironment are given. The state of an economic object (enterprise) is modeled\ntaking into account the influence of the external environment. With the help of\nthe software package created by the author, six optimal options for control\ndecisions have been analyzed. The state of an economic object has been modeled\ndepending on the state of the external environment by 5,000 parameters. The\nresearch showed significant changes in the values of the correlation of the\nparameters of the system and the intensity of business processes when the\nconditions for the functioning of the system change. The optimal control of an\neconomic object (enterprise) is selected according to the integral indicator.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ITdtznIILX_sT7OVmQLe2WPGbWtwDmxmraCXsETott0","pdfSize":"681507"}