{
  "id": "2412.05087",
  "title": "Prospects for Observing Astrophysical Transients with GeV Neutrinos",
  "authors": "Angelina Partenheimer, Jessie Thwaites, Ke Fang, Justin Vandenbroucke,\n  Brian D. Metzger",
  "authorsParsed": [
    [
      "Partenheimer",
      "Angelina",
      ""
    ],
    [
      "Thwaites",
      "Jessie",
      ""
    ],
    [
      "Fang",
      "Ke",
      ""
    ],
    [
      "Vandenbroucke",
      "Justin",
      ""
    ],
    [
      "Metzger",
      "Brian D.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 14:45:04 GMT"
    },
    {
      "version": "v2",
      "created": "Mon, 17 Feb 2025 16:36:23 GMT"
    }
  ],
  "updateDate": "2025-02-18",
  "timestamp": 1733496304000,
  "abstract": "  Although Cherenkov detectors of high-energy neutrinos in ice and water are\noften optimized to detect TeV-PeV neutrinos, they may also be sensitive to\ntransient neutrino sources in the 1-100~GeV energy range. A wide variety of\ntransient sources have been predicted to emit GeV neutrinos. In light of the\nupcoming IceCube-Upgrade, which will extend the IceCube detector's sensitivity\ndown to a few GeV, as well as improve its angular resolution, we survey a\nvariety of transient source models and compare their predicted neutrino\nfluences to detector sensitivities, in particular those of IceCube-DeepCore and\nthe IceCube Upgrade. We consider the ranges of neutrino fluence from transients\npowered by non-relativistic shocks, such as novae, supernovae, fast blue\noptical transients, and tidal disruption events. We also consider fast radio\nbursts and relativistic outflows of high- and low-luminosity gamma-ray bursts.\nOur study sheds light on the prospects of observing GeV transients with\nexisting and upcoming neutrino facilities.\n",
  "subjects": [
    "Astrophysics/High Energy Astrophysical Phenomena"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "zQ4fCsHscMY5gop1FGG6AKzeARapjer4y28K6LRx_4o",
  "pdfSize": "1257079"
}