{
  "id": "2412.01447",
  "title": "PLD+: Accelerating LLM inference by leveraging Language Model Artifacts",
  "authors": "Shwetha Somasundaram, Anirudh Phukan, Apoorv Saxena",
  "authorsParsed": [
    [
      "Somasundaram",
      "Shwetha",
      ""
    ],
    [
      "Phukan",
      "Anirudh",
      ""
    ],
    [
      "Saxena",
      "Apoorv",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 12:36:27 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733142987000,
  "abstract": "  To reduce the latency associated with autoretrogressive LLM inference,\nspeculative decoding has emerged as a novel decoding paradigm, where future\ntokens are drafted and verified in parallel. However, the practical deployment\nof speculative decoding is hindered by its requirements for additional\ncomputational resources and fine-tuning, which limits its out-of-the-box\nusability. To address these challenges, we present PLD+, a suite of novel\nalgorithms developed to accelerate the inference process of LLMs, particularly\nfor input-guided tasks. These tasks, which include code editing, text editing,\nsummarization, etc., often feature outputs with substantial overlap with their\ninputs-an attribute PLD+ is designed to exploit. PLD+ also leverages the\nartifacts (attention and hidden states) generated during inference to\naccelerate inference speed. We test our approach on five input-guided tasks and\nthrough extensive experiments we find that PLD+ outperforms all tuning-free\napproaches. In the greedy setting, it even outperforms the state-of-the-art\ntuning-dependent approach EAGLE on four of the tasks. (by a margin of upto 2.31\nin terms of avg. speedup). Our approach is tuning free, does not require any\nadditional compute and can easily be used for accelerating inference of any\nLLM.\n",
  "subjects": [
    "Computer Science/Computation and Language",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "_ZFz6SVtw2I4ZTMnbUzk84tLV4jYeNRgvXF-Pdd5wgE",
  "pdfSize": "1048570"
}