{
  "id": "2412.18164",
  "title": "Stochastic Control for Fine-tuning Diffusion Models: Optimality,\n  Regularity, and Convergence",
  "authors": "Yinbin Han, Meisam Razaviyayn, Renyuan Xu",
  "authorsParsed": [
    [
      "Han",
      "Yinbin",
      ""
    ],
    [
      "Razaviyayn",
      "Meisam",
      ""
    ],
    [
      "Xu",
      "Renyuan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 24 Dec 2024 04:55:46 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1735016146000,
  "abstract": "  Diffusion models have emerged as powerful tools for generative modeling,\ndemonstrating exceptional capability in capturing target data distributions\nfrom large datasets. However, fine-tuning these massive models for specific\ndownstream tasks, constraints, and human preferences remains a critical\nchallenge. While recent advances have leveraged reinforcement learning\nalgorithms to tackle this problem, much of the progress has been empirical,\nwith limited theoretical understanding. To bridge this gap, we propose a\nstochastic control framework for fine-tuning diffusion models. Building on\ndenoising diffusion probabilistic models as the pre-trained reference dynamics,\nour approach integrates linear dynamics control with Kullback-Leibler\nregularization. We establish the well-posedness and regularity of the\nstochastic control problem and develop a policy iteration algorithm (PI-FT) for\nnumerical solution. We show that PI-FT achieves global convergence at a linear\nrate. Unlike existing work that assumes regularities throughout training, we\nprove that the control and value sequences generated by the algorithm maintain\nthe regularity. Additionally, we explore extensions of our framework to\nparametric settings and continuous-time formulations.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Mathematics/Optimization and Control"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "7e-ydfFCku0COf3fqrLMep865nlrQHxGg9vzwR0ju8U",
  "pdfSize": "414922"
}