{
  "id": "2412.00748",
  "title": "Exploring Cognition through Morphological Info-Computational Framework",
  "authors": "Gordana Dodig-Crnkovic",
  "authorsParsed": [
    [
      "Dodig-Crnkovic",
      "Gordana",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 1 Dec 2024 09:56:38 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733046998000,
  "abstract": "  Traditionally, cognition has been considered a uniquely human capability\ninvolving perception, memory, learning, reasoning, and problem-solving.\nHowever, recent research shows that cognition is a fundamental ability shared\nby all living beings, from single cells to complex organisms. This chapter\ntakes an info-computational approach (ICON), viewing natural structures as\ninformation and the processes of change in these structures as computations. It\nis a relational framework dependent on the perspective of a cognizing\nobserver/cognizer. Informational structures are properties of the material\nsubstrate, and when focusing on the behavior of the substrate, we discuss\nmorphological computing (MC). ICON and MC are complementary perspectives for a\ncognizer. Information and computation are inseparably connected with cognition.\nThis chapter explores research connecting nature as a computational structure\nfor a cognizer, with morphological computation, morphogenesis, agency, extended\ncognition, and extended evolutionary synthesis, using examples of the free\nenergy principle and active inference. It introduces theoretical and practical\napproaches challenging traditional computational models of cognition limited to\nabstract symbol processing, highlighting the computational capacities inherent\nin the material substrate (embodiment). Understanding the embodiment of\ncognition through its morphological computational basis is crucial for biology,\nevolution, intelligence theory, AI, robotics, and other fields.\n",
  "subjects": [
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "VUt59G4cRxHRc_NSMrDw3V3ERTWza7MMWagQG--uSJI",
  "pdfSize": "310557"
}