{
  "id": "2412.02920",
  "title": "Assessing the performance of CT image denoisers using Laguerre-Gauss\n  Channelized Hotelling Observer for lesion detection",
  "authors": "Prabhat Kc, Rongping Zeng",
  "authorsParsed": [
    [
      "Kc",
      "Prabhat",
      ""
    ],
    [
      "Zeng",
      "Rongping",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 00:11:19 GMT"
    }
  ],
  "updateDate": "2024-12-05",
  "timestamp": 1733271079000,
  "abstract": "  The remarkable success of deep learning methods in solving computer vision\nproblems, such as image classification, object detection, scene understanding,\nimage segmentation, etc., has paved the way for their application in biomedical\nimaging. One such application is in the field of CT image denoising, whereby\ndeep learning methods are proposed to recover denoised images from noisy images\nacquired at low radiation. Outputs derived from applying deep learning\ndenoising algorithms may appear clean and visually pleasing; however, the\nunderlying diagnostic image quality may not be on par with their normal-dose CT\ncounterparts. In this work, we assessed the image quality of deep learning\ndenoising algorithms by making use of visual perception- and data\nfidelity-based task-agnostic metrics (like the PSNR and the SSIM) - commonly\nused in the computer vision - and a task-based detectability assessment (the\nLCD) - extensively used in the CT imaging. When compared against normal-dose CT\nimages, the deep learning denoisers outperformed low-dose CT based on metrics\nlike the PSNR (by 2.4 to 3.8 dB) and SSIM (by 0.05 to 0.11). However, based on\nthe LCD performance, the detectability using quarter-dose denoised outputs was\ninferior to that obtained using normal-dose CT scans.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Image and Video Processing",
    "Computer Science/Computer Vision and Pattern Recognition",
    "Physics/Medical Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "crUnhrHq-T2dhvWjZ0NirYIZ3fa-FSiCVAQyyglTlfc",
  "pdfSize": "604350"
}