{"id":"2412.10536","title":"The role of nuclear spin diffusion in dynamic nuclear polarization of\n  crystalline nanoscale silicon particles","authors":"Gevin von Witte, Konstantin Tamarov, Neva Sahin, Aaron Himmler, Vera\n  Ganz, Jani O. Moilanen, Vesa-Pekka Lehto, Grzegorz Kwiatkowski, Sebastian\n  Kozerke, and Matthias Ernst","authorsParsed":[["von Witte","Gevin",""],["Tamarov","Konstantin",""],["Sahin","Neva",""],["Himmler","Aaron",""],["Ganz","Vera",""],["Moilanen","Jani O.",""],["Lehto","Vesa-Pekka",""],["Kwiatkowski","Grzegorz",""],["Kozerke","Sebastian",""],["Ernst","Matthias",""]],"versions":[{"version":"v1","created":"Fri, 13 Dec 2024 20:09:03 GMT"}],"updateDate":"2024-12-17","timestamp":1734120543000,"abstract":"  Hyperpolarized nanoparticles (NPs) offer high polarization levels with room\ntemperature relaxation times exceeding half an hour. In this work, we\ndemonstrate that the achievable hyperpolarization enhancement and relaxation\n(decay) time at room temperature are largely independent of the particle size\ncontrary to previous assumptions. This is explained through first-principles\nspin-diffusion coefficient calculations and finite-element polarization\nsimulations. The simulated zero-quantum (flip-flop) line width governing the\nspin diffusion is found to agree with the experimentally accessible\nsingle-quantum (single spin flip, e.g. radio-frequency pulse) line width. The\ntransport of hyperpolarization from strongly hyperfine-coupled spins towards\nthe bulk is most likelybelieved to be responsible for the slow polarization\ndynamics including long room temperature decay time. The line width and\nspin-diffusion simulations are extended to other cubic crystal structures and\nanalytical expressions, which only require insertion of the gyromagnetic ratio,\nlattice constant, isotope abundance and measured spectral density distribution\n(nuclear line width), are fitted. The presented simulations can be adjusted to\nstudy spin diffusion in other materials.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"xI82SEHgfVCi5PjO-hHfEJFz0Pwq3X1WT-PMEyUqEP0","pdfSize":"1479984"}