{
  "id": "2412.18448",
  "title": "Finite size scaling of survival statistics in metapopulation models",
  "authors": "Alice Doimo, Giorgio Nicoletti, Davide Bernardi and Prajwal Padmanabha",
  "authorsParsed": [
    [
      "Doimo",
      "Alice",
      ""
    ],
    [
      "Nicoletti",
      "Giorgio",
      ""
    ],
    [
      "Bernardi",
      "Davide",
      ""
    ],
    [
      "Padmanabha",
      "Prajwal",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 24 Dec 2024 14:17:32 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1735049852000,
  "abstract": "  Spatial metapopulation models are fundamental to theoretical ecology,\nenabling to study how landscape structure influences global species dynamics.\nTraditional models, including recent generalizations, often rely on the\ndeterministic limit of stochastic processes, assuming large population sizes.\nHowever, stochasticity - arising from dispersal events and population\nfluctuations - profoundly shapes ecological dynamics. In this work, we extend\nthe classical metapopulation framework to account for finite populations,\nexamining the impact of stochasticity on species persistence and dynamics.\nSpecifically, we analyze how the limited capacity of local habitats influences\nsurvival, deriving analytical expressions for the finite-size scaling of the\nsurvival probability near the critical transition between survival and\nextinction. Crucially, we demonstrate that the deterministic metapopulation\ncapacity plays a fundamental role in the statistics of survival probability and\nextinction time moments. These results provide a robust foundation for\nintegrating demographic stochasticity into classical metapopulation models and\ntheir extensions.\n",
  "subjects": [
    "Quantitative Biology/Populations and Evolution",
    "Condensed Matter/Statistical Mechanics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "1WNMAbm81on3jo8g1KYVaSs_6gOL-c3UDwDNNv-o8e0",
  "pdfSize": "1351717"
}