{"id":"2412.01383","title":"Second FRCSyn-onGoing: Winning Solutions and Post-Challenge Analysis to\n  Improve Face Recognition with Synthetic Data","authors":"Ivan DeAndres-Tame, Ruben Tolosana, Pietro Melzi, Ruben\n  Vera-Rodriguez, Minchul Kim, Christian Rathgeb, Xiaoming Liu, Luis F. Gomez,\n  Aythami Morales, Julian Fierrez, Javier Ortega-Garcia, Zhizhou Zhong, Yuge\n  Huang, Yuxi Mi, Shouhong Ding, Shuigeng Zhou, Shuai He, Lingzhi Fu, Heng\n  Cong, Rongyu Zhang, Zhihong Xiao, Evgeny Smirnov, Anton Pimenov, Aleksei\n  Grigorev, Denis Timoshenko, Kaleb Mesfin Asfaw, Cheng Yaw Low, Hao Liu, Chuyi\n  Wang, Qing Zuo, Zhixiang He, Hatef Otroshi Shahreza, Anjith George, Alexander\n  Unnervik, Parsa Rahimi, S\\'ebastien Marcel, Pedro C. Neto, Marco Huber, Jan\n  Niklas Kolf, Naser Damer, Fadi Boutros, Jaime S. Cardoso, Ana F. Sequeira,\n  Andrea Atzori, Gianni Fenu, Mirko Marras, Vitomir \\v{S}truc, Jiang Yu,\n  Zhangjie Li, Jichun Li, Weisong Zhao, Zhen Lei, Xiangyu Zhu, Xiao-Yu Zhang,\n  Bernardo Biesseck, Pedro Vidal, Luiz Coelho, Roger Granada, David Menotti","authorsParsed":[["DeAndres-Tame","Ivan",""],["Tolosana","Ruben",""],["Melzi","Pietro",""],["Vera-Rodriguez","Ruben",""],["Kim","Minchul",""],["Rathgeb","Christian",""],["Liu","Xiaoming",""],["Gomez","Luis F.",""],["Morales","Aythami",""],["Fierrez","Julian",""],["Ortega-Garcia","Javier",""],["Zhong","Zhizhou",""],["Huang","Yuge",""],["Mi","Yuxi",""],["Ding","Shouhong",""],["Zhou","Shuigeng",""],["He","Shuai",""],["Fu","Lingzhi",""],["Cong","Heng",""],["Zhang","Rongyu",""],["Xiao","Zhihong",""],["Smirnov","Evgeny",""],["Pimenov","Anton",""],["Grigorev","Aleksei",""],["Timoshenko","Denis",""],["Asfaw","Kaleb Mesfin",""],["Low","Cheng Yaw",""],["Liu","Hao",""],["Wang","Chuyi",""],["Zuo","Qing",""],["He","Zhixiang",""],["Shahreza","Hatef Otroshi",""],["George","Anjith",""],["Unnervik","Alexander",""],["Rahimi","Parsa",""],["Marcel","Sébastien",""],["Neto","Pedro C.",""],["Huber","Marco",""],["Kolf","Jan Niklas",""],["Damer","Naser",""],["Boutros","Fadi",""],["Cardoso","Jaime S.",""],["Sequeira","Ana F.",""],["Atzori","Andrea",""],["Fenu","Gianni",""],["Marras","Mirko",""],["Štruc","Vitomir",""],["Yu","Jiang",""],["Li","Zhangjie",""],["Li","Jichun",""],["Zhao","Weisong",""],["Lei","Zhen",""],["Zhu","Xiangyu",""],["Zhang","Xiao-Yu",""],["Biesseck","Bernardo",""],["Vidal","Pedro",""],["Coelho","Luiz",""],["Granada","Roger",""],["Menotti","David",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 11:12:01 GMT"}],"updateDate":"2024-12-03","timestamp":1733137921000,"abstract":"  Synthetic data is gaining increasing popularity for face recognition\ntechnologies, mainly due to the privacy concerns and challenges associated with\nobtaining real data, including diverse scenarios, quality, and demographic\ngroups, among others. It also offers some advantages over real data, such as\nthe large amount of data that can be generated or the ability to customize it\nto adapt to specific problem-solving needs. To effectively use such data, face\nrecognition models should also be specifically designed to exploit synthetic\ndata to its fullest potential. In order to promote the proposal of novel\nGenerative AI methods and synthetic data, and investigate the application of\nsynthetic data to better train face recognition systems, we introduce the 2nd\nFRCSyn-onGoing challenge, based on the 2nd Face Recognition Challenge in the\nEra of Synthetic Data (FRCSyn), originally launched at CVPR 2024. This is an\nongoing challenge that provides researchers with an accessible platform to\nbenchmark i) the proposal of novel Generative AI methods and synthetic data,\nand ii) novel face recognition systems that are specifically proposed to take\nadvantage of synthetic data. We focus on exploring the use of synthetic data\nboth individually and in combination with real data to solve current challenges\nin face recognition such as demographic bias, domain adaptation, and\nperformance constraints in demanding situations, such as age disparities\nbetween training and testing, changes in the pose, or occlusions. Very\ninteresting findings are obtained in this second edition, including a direct\ncomparison with the first one, in which synthetic databases were restricted to\nDCFace and GANDiffFace.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Artificial Intelligence","Computer Science/Computers and Society","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"rrLqg-tbqf0XCDvSw-oi6QjoX9jQ3lyUM3WEBwopfKg","pdfSize":"5651341"}