{
  "id": "2412.17553",
  "title": "Emerging non-local quantum phenomena in a classical system of\n  organo-metallic microparticles",
  "authors": "I. Carmeli, Vladimiro Mujica, Gregory Leitus, Pini Shechter, Zeev\n  Zalevsky, Shachar Richter",
  "authorsParsed": [
    [
      "Carmeli",
      "I.",
      ""
    ],
    [
      "Mujica",
      "Vladimiro",
      ""
    ],
    [
      "Leitus",
      "Gregory",
      ""
    ],
    [
      "Shechter",
      "Pini",
      ""
    ],
    [
      "Zalevsky",
      "Zeev",
      ""
    ],
    [
      "Richter",
      "Shachar",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 13:20:37 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734960037000,
  "abstract": "  The work investigates enantiomers of chiral organo-metallic particles that\nexhibit a collective memory effect. Under the influence of magnetic field\nmillions of particles in solution form macroscopic shapes and when dispersed\nagain at zero field they return to their original shape. The charge and\nmagnetic behaviors of the particles are strongly dependent on the handedness of\nthe chiral molecule in the hybrid organometallic compound. The microparticles\nforming the shaped structures are collectively coupled under the influence of\nlong-range van der Waals exchange interactions which govern the collective\nmacroscopic structure. There is striking evidence that the nonlocal quantum\nexchange interactions between particles persist up to a distance of 10 meters\nat temperatures above 00C. The forces which govern the collective memory effect\nand shape the macroscopic structure therefore allow to visualize quantum\nphenomena which extend the classical causality notion into an expanded nonlocal\nreality in which the quantum fields of the particles exist simultaneously at\nseparated points in space. We propose that the observations are attributed to\nchiral electronic states dependent van der Waals interactions coupled to vacuum\nfluctuations.\n",
  "subjects": [
    "Physics/Chemical Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "C80DDfS0cFmkg1QDW0pWe6vT9HNb1sGr2uE1dAFeaas",
  "pdfSize": "1571437"
}