{
  "id": "2412.04398",
  "title": "Boosting quantum annealing performance through direct polynomial\n  unconstrained binary optimization",
  "authors": "Sebastian Nagies, Kevin T. Geier, Javed Akram, Dimitrios Bantounas,\n  Michael Johanning, Philipp Hauke",
  "authorsParsed": [
    [
      "Nagies",
      "Sebastian",
      ""
    ],
    [
      "Geier",
      "Kevin T.",
      ""
    ],
    [
      "Akram",
      "Javed",
      ""
    ],
    [
      "Bantounas",
      "Dimitrios",
      ""
    ],
    [
      "Johanning",
      "Michael",
      ""
    ],
    [
      "Hauke",
      "Philipp",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 18:12:20 GMT"
    },
    {
      "version": "v2",
      "created": "Thu, 9 Jan 2025 18:58:23 GMT"
    }
  ],
  "updateDate": "2025-01-10",
  "timestamp": 1733422340000,
  "abstract": "  Quantum annealing aims at solving optimization problems of practical\nrelevance using quantum computing hardware. Problems of interest are typically\nformulated in terms of quadratic unconstrained binary optimization (QUBO)\nHamiltonians. However, many optimization problems are much more naturally\nformulated in terms of polynomial unconstrained binary optimization (PUBO)\nfunctions of higher order. As we show with various problem examples, leveraging\nthe PUBO formulation can bring considerable savings in terms of required number\nof qubits. Moreover, in numerical benchmarks for the paradigmatic 3-SAT\nproblem, we find scenarios where the scaling of the minimal gap during the\noptimization sweep differs significantly, suggesting the possibility of an\nexponentially faster annealing time when using the PUBO as compared to the QUBO\nformulation. This advantage persists even when considering the overhead in\nimplementing the higher-order interactions necessary for PUBO cost\nHamiltonians. As an interesting side effect, the analysis on minimum energy\ngaps of different 3-SAT instance generators reveals different degrees of\nhardness, which will be of interest also for classical benchmark calculations.\nOur findings show a promising path to improving the resource efficiency and\nsweeping speed of quantum annealing, important prerequisites when aiming at\nsolving larger optimization problems with relevance to industry.\n",
  "subjects": [
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "E8jMooi2VNmYLL6WggoJwS5EK2VlTVm3KLzPuZu1ZNE",
  "pdfSize": "1257537"
}