{"id":"2412.13165","title":"Distances between operators acting on different Hilbert spaces","authors":"Olaf Post and Sebastian Zimmer","authorsParsed":[["Post","Olaf",""],["Zimmer","Sebastian",""]],"versions":[{"version":"v1","created":"Tue, 17 Dec 2024 18:44:39 GMT"},{"version":"v2","created":"Fri, 17 Jan 2025 13:41:20 GMT"}],"updateDate":"2025-01-20","timestamp":1734461079000,"abstract":"  The aim of this article is to define and compare several distances (or\nmetrics) between operators acting on different (separable) Hilbert spaces. We\nconsider here three main cases of how to measure the distance between two\nbounded operators: first by taking the distance between their unitary orbits,\nsecond by isometric embeddings (this generalises a concept of Weidmann) and\nthird by quasi-unitary equivalence (using a concept of the first author of the\npresent article).\n  Our main result is that the unitary and isometric distances are equal\nprovided the operators are both self-adjoint and have $0$ in their essential\nspectra. Moreover, the quasi-unitary distance is equivalent (up to a universal\nconstant) with the isometric distance for any pair of bounded operators. The\nunitary distance gives an upper bound on the Hausdorff distance of their\nspectrum. If both operators have purely essential spectrum, then the unitary\ndistance equals the Hausdorff distance of their spectra. Using a finer spectral\ndistance respecting multiplicity of discrete eigenvalues, this spectral\ndistance equals the unitary distance also for operators with essential and\ndiscrete spectrum. In particular, all operator distances mentioned above are\nequal to this spectral distance resp. controlled by it in the quasi-unitary\ncase for self-adjoint operators with $0$ in the essential spectrum. We also\nshow that our results are sharp by presenting various (counter-)examples.\nFinally, we discuss related convergence concepts complementing results from our\nfirst article arXiv:2202.03234\n","subjects":["Mathematics/Spectral Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"NVHpN4yS9YjV0cY8AHKqUS9vuYGcRv-U5yLQ7ejizcA","pdfSize":"571696"}