{
  "id": "2412.14490",
  "title": "MAIDS: Malicious Agent Identification-based Data Security Model for\n  Cloud Environments",
  "authors": "Kishu Gupta, Deepika Saxena, Rishabh Gupta, Ashutosh Kumar Singh",
  "authorsParsed": [
    [
      "Gupta",
      "Kishu",
      ""
    ],
    [
      "Saxena",
      "Deepika",
      ""
    ],
    [
      "Gupta",
      "Rishabh",
      ""
    ],
    [
      "Singh",
      "Ashutosh Kumar",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 03:27:14 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734578834000,
  "abstract": "  With the vigorous development of cloud computing, most organizations have\nshifted their data and applications to the cloud environment for storage,\ncomputation, and sharing purposes. During storage and data sharing across the\nparticipating entities, a malicious agent may gain access to outsourced data\nfrom the cloud environment. A malicious agent is an entity that deliberately\nbreaches the data. This information accessed might be misused or revealed to\nunauthorized parties. Therefore, data protection and prediction of malicious\nagents have become a demanding task that needs to be addressed appropriately.\nTo deal with this crucial and challenging issue, this paper presents a\nMalicious Agent Identification-based Data Security (MAIDS) Model which utilizes\nXGBoost machine learning classification algorithm for securing data allocation\nand communication among different participating entities in the cloud system.\nThe proposed model explores and computes intended multiple security parameters\nassociated with online data communication or transactions. Correspondingly, a\nsecurity-focused knowledge database is produced for developing the XGBoost\nClassifier-based Malicious Agent Prediction (XC-MAP) unit. Unlike the existing\napproaches, which only identify malicious agents after data leaks, MAIDS\nproactively identifies malicious agents by examining their eligibility for\nrespective data access. In this way, the model provides a comprehensive\nsolution to safeguard crucial data from both intentional and non-intentional\nbreaches, by granting data to authorized agents only by evaluating the agents\nbehavior and predicting the malicious agent before granting data.\n",
  "subjects": [
    "Computer Science/Cryptography and Security",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "PSg5Vrty68yeUeQoeO6e0zxBDxTXDk0-krJ1s10nzAo",
  "pdfSize": "1392706"
}