{
  "id": "2412.15371",
  "title": "Observational Signatures of Disk Winds in Protoplanetary Disks:\n  Differentiating Magnetized and Photoevaporative Outflows With Fully Coupled\n  Thermochemistry",
  "authors": "Xiao Hu, Jaehan Bae, Zhaohuan Zhu and Lile Wang",
  "authorsParsed": [
    [
      "Hu",
      "Xiao",
      ""
    ],
    [
      "Bae",
      "Jaehan",
      ""
    ],
    [
      "Zhu",
      "Zhaohuan",
      ""
    ],
    [
      "Wang",
      "Lile",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 20:06:23 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734638783000,
  "abstract": "  Magnetized winds and photoevaporative winds are critical in shaping\nprotoplanetary disk evolution. Using 2D axisymmetric (magneto-)hydrodynamic\nsimulations with Athena++ implementing fully coupled thermochemistry, we\ninvestigate the signatures of the two winds in CO and [C~I] ALMA observations,\nand examine the potential to distinguish the origins. Our simulations reveal\nfundamental differences between the two winds: magnetized winds are colder and\ndenser, exhibiting super-Keplerian rotation with small poloidal velocities of\n$\\lesssim 1~{\\rm km~s}^{-1}$ in the atmosphere ($z/R\\gtrsim0.45$), while\nphotoevaporative winds are hotter and less dense, exhibiting sub-Keplerian\nrotation with higher poloidal velocity of several ${\\rm km~s}^{-1}$. In\naddition to previously identified factors like thermal pressure gradient and\ndisk's self-gravity, we demonstrate that magnetic tension/pressure and\nadvection significantly influence rotational velocities of the gas in the wind,\nwhich lead to emission patterns that are distinct from Keplerian rotation in\nsynthetic ALMA observations. Magnetized winds are visible in CO channel maps\nwhen wind loss rates are $\\gtrsim10^{-8}~M_\\odot~{\\rm yr}^{-1}$. When wind loss\nrates are lower, magnetized winds produce subtle perturbations in channel maps,\nwhich resemble the so-called ``velocity kinks'' produced by protoplanets. While\nphotoevaporative winds dissociate CO through strong XUV radiation and thus are\nweaker in CO, they can create observable ring-like substructures. [C~I]\nemission is optically thin and could be most effective at detecting both winds\nin disks with high gas mass and/or high [C~I] abundance. Due to the spatially\nextended nature of the winds, using a large beam ($\\simeq0.4$\" for disks in\nnearby star-forming regions) will be helpful regardless of the tracer used.\n",
  "subjects": [
    "Astrophysics/Earth and Planetary Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "DYgSmC8VRmlLP-HTyjx7l3tChR_Z0ZYX50DjNZhSTPM",
  "pdfSize": "18618007"
}