{
  "id": "2412.12475",
  "title": "RareAgents: Advancing Rare Disease Care through LLM-Empowered\n  Multi-disciplinary Team",
  "authors": "Xuanzhong Chen, Ye Jin, Xiaohao Mao, Lun Wang, Shuyang Zhang, Ting\n  Chen",
  "authorsParsed": [
    [
      "Chen",
      "Xuanzhong",
      ""
    ],
    [
      "Jin",
      "Ye",
      ""
    ],
    [
      "Mao",
      "Xiaohao",
      ""
    ],
    [
      "Wang",
      "Lun",
      ""
    ],
    [
      "Zhang",
      "Shuyang",
      ""
    ],
    [
      "Chen",
      "Ting",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 02:22:24 GMT"
    },
    {
      "version": "v2",
      "created": "Fri, 14 Feb 2025 08:40:39 GMT"
    }
  ],
  "updateDate": "2025-02-17",
  "timestamp": 1734402144000,
  "abstract": "  Rare diseases, despite their low individual incidence, collectively impact\naround 300 million people worldwide due to the vast number of diseases. The\ninvolvement of multiple organs and systems, and the shortage of specialized\ndoctors with relevant experience make diagnosing and treating rare diseases\nmore challenging than common diseases. Recently, agents powered by large\nlanguage models (LLMs) have demonstrated notable applications across various\ndomains. In the medical field, some agent methods have outperformed direct\nprompts in question-answering tasks from medical examinations. However, current\nagent frameworks are not well-adapted to real-world clinical scenarios,\nespecially those involving the complex demands of rare diseases. To bridge this\ngap, we introduce RareAgents, the first LLM-driven multi-disciplinary team\nframework designed specifically for the complex clinical context of rare\ndiseases. RareAgents integrates advanced Multidisciplinary Team (MDT)\ncoordination, memory mechanisms, and medical tools utilization, leveraging\nLlama-3.1-8B/70B as the base model. Experimental results show that RareAgents\noutperforms state-of-the-art domain-specific models, GPT-4o, and current agent\nframeworks in differential diagnosis and medication recommendation for rare\ndiseases. Furthermore, we contribute a novel rare disease dataset,\nMIMIC-IV-Ext-Rare, to support further advancements in this field.\n",
  "subjects": [
    "Computer Science/Computation and Language",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "wyZ2Q7hJlOBLBt2QgTW_X73IUe7Wz4NrXi87lktLJLg",
  "pdfSize": "2382407"
}