{"id":"2412.19009","title":"FACEMUG: A Multimodal Generative and Fusion Framework for Local Facial\n  Editing","authors":"Wanglong Lu, Jikai Wang, Xiaogang Jin, Xianta Jiang, Hanli Zhao","authorsParsed":[["Lu","Wanglong",""],["Wang","Jikai",""],["Jin","Xiaogang",""],["Jiang","Xianta",""],["Zhao","Hanli",""]],"versions":[{"version":"v1","created":"Thu, 26 Dec 2024 00:53:54 GMT"}],"updateDate":"2024-12-30","timestamp":1735174434000,"abstract":"  Existing facial editing methods have achieved remarkable results, yet they\noften fall short in supporting multimodal conditional local facial editing. One\nof the significant evidences is that their output image quality degrades\ndramatically after several iterations of incremental editing, as they do not\nsupport local editing. In this paper, we present a novel multimodal generative\nand fusion framework for globally-consistent local facial editing (FACEMUG)\nthat can handle a wide range of input modalities and enable fine-grained and\nsemantic manipulation while remaining unedited parts unchanged. Different\nmodalities, including sketches, semantic maps, color maps, exemplar images,\ntext, and attribute labels, are adept at conveying diverse conditioning\ndetails, and their combined synergy can provide more explicit guidance for the\nediting process. We thus integrate all modalities into a unified generative\nlatent space to enable multimodal local facial edits. Specifically, a novel\nmultimodal feature fusion mechanism is proposed by utilizing multimodal\naggregation and style fusion blocks to fuse facial priors and multimodalities\nin both latent and feature spaces. We further introduce a novel self-supervised\nlatent warping algorithm to rectify misaligned facial features, efficiently\ntransferring the pose of the edited image to the given latent codes. We\nevaluate our FACEMUG through extensive experiments and comparisons to\nstate-of-the-art (SOTA) methods. The results demonstrate the superiority of\nFACEMUG in terms of editing quality, flexibility, and semantic control, making\nit a promising solution for a wide range of local facial editing tasks.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Multimedia"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"kBVNdDqWXYzoAVbATrMS2KSPdx1HlY5EIWIMvHSmcUU","pdfSize":"22509769"}