{
  "id": "2412.20354",
  "title": "Distributed Convex Optimization with State-Dependent (Social)\n  Interactions over Random Networks",
  "authors": "Seyyed Shaho Alaviani and Atul Kelkar",
  "authorsParsed": [
    [
      "Alaviani",
      "Seyyed Shaho",
      ""
    ],
    [
      "Kelkar",
      "Atul",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 29 Dec 2024 05:04:41 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735448681000,
  "abstract": "  This paper aims at distributed multi-agent convex optimization where the\n  communications network among the agents are presented by a random\n  sequence of possibly state-dependent weighted graphs. This is the first work\nto consider both random arbitrary communication networks and state-dependent\ninteractions among agents. The state-dependent weighted random operator of the\ngraph is shown to be quasi-nonexpansive;\n  this property neglects a priori distribution assumption\n  of random communication topologies to be imposed on the operator. Therefore,\nit contains more general class of\n  random networks with or without asynchronous protocols. A more general\nmathematical optimization\n  problem than that addressed in the literature is presented, namely\nminimization of a convex function over the fixed-value point set of a\nquasi-nonexpansive random operator.\n  A discrete-time algorithm is provided that is able to converge both almost\nsurely and in mean square to the global solution of the optimization problem.\nHence, as a special case,\n  it reduces to a totally asynchronous algorithm for the\n  distributed optimization problem. The algorithm is able to converge even if\nthe weighted matrix of the graph is periodic and irreducible under synchronous\nprotocol. Finally, a case study on a network of robots in an automated\nwarehouse is\n  given where there is distribution dependency among random communication\ngraphs.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Systems and Control",
    "Computer Science/Systems and Control"
  ],
  "license": "http://creativecommons.org/publicdomain/zero/1.0/",
  "blobId": "_XePyyxZ8x5DArp96Cv63TuFBprfgWQGIWkHNGFaBQ8",
  "pdfSize": "791670"
}