{"id":"2412.01312","title":"Can ChatGPT pass a physics degree? Making a case for reformation of\n  assessment of undergraduate degrees","authors":"Kevin A. Pimbblet, Lesley J. Morrell","authorsParsed":[["Pimbblet","Kevin A.",""],["Morrell","Lesley J.",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 09:27:17 GMT"}],"updateDate":"2024-12-03","timestamp":1733131637000,"abstract":"  The emergence of conversational natural language processing models presents a\nsignificant challenge for Higher Education. In this work, we use the entirety\nof a UK physics undergraduate (BSc with Honours) degree including all\nexaminations and coursework to test if ChatGPT (GPT-4) can pass a degree. We\nadopt a \"maximal cheating\" approach wherein we permit ourselves to modify\nquestions for clarity, split questions up into smaller sub-components, expand\non answers given - especially for long form written responses, obtaining\nreferences, and use of advanced coaching, plug-ins and custom instructions to\noptimize outputs. In general, there are only certain parts of the degree in\nquestion where GPT-4 fails. Explicitly these include compulsory laboratory\nelements, and the final project which is assessed by a viva. If these were no\nissue, then GPT-4 would pass with a grade of an upper second class overall. In\ngeneral, coding tasks are performed exceptionally well, along with simple\nsingle-step solution problems. Multiple step problems and longer prose are\ngenerally poorer along with interdisciplinary problems. We strongly suggest\nthat there is now a necessity to urgently re-think and revise assessment\npractice in physics - and other disciplines - due to the existence of AI such\nas GPT-4. We recommend close scrutiny of assessment tasks: only invigilated\nin-person examinations, vivas, laboratory skills testing (or \"performances\" in\nother disciplines), and presentations are not vulnerable to GPT-4, and urge\nconsideration of how AI can be embedded within the disciplinary context.\n","subjects":["Physics/Physics Education"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"HNgSpRZQdiPiJFw_kp480_nQPACZGsOzsvdV5F2Rts8","pdfSize":"420866"}