{
  "id": "2412.08793",
  "title": "Inferring latent structure in ecological communities via barcodes",
  "authors": "Braden Scherting and David B. Dunson",
  "authorsParsed": [
    [
      "Scherting",
      "Braden",
      ""
    ],
    [
      "Dunson",
      "David B.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 21:53:19 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1733953999000,
  "abstract": "  Accelerating global biodiversity loss has highlighted the role of complex\nrelationships and shared patterns among species in mediating responses to\nenvironmental changes. The structure of ecological communities signals their\nfragility or robustness more so than individual niches of species. We focus on\nobtaining community-level insights that characterize underlying patterns in\nabundances of bird species in Finland. We propose a novel \\texttt{barcode}\nframework for inferring latent binary features underlying samples and species.\n\\texttt{barcode} provides a more nuanced alternative to clustering, while\nimproving current multivariate abundance models. \\texttt{barcode} addresses key\nlimitations of popular methods for model-based ordination and expands the class\nof concurrent ordinations. A key feature is our use of binary latent variables,\nwhich admit simple interpretations such as habitat and sampling factors that\nexplain observed variation. In studying 137 bird species using this framework,\nwe find that three of the five leading factors indicate different types of\nforest habitat, signaling the importance of diverse forest in this community.\nIn contrast, a single factor simultaneously proxies both human intervention and\ncoastal habitats. Supervised species clusters and species-specific geospatial\ndistributions are also inferred.\n",
  "subjects": [
    "Statistics/Applications"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "u1ukGiHnz8SXm-zNE_XoNMdHnaf2y9fZSNj4uK2JPw8",
  "pdfSize": "5135804"
}