{
  "id": "2412.20394",
  "title": "A Universal Method to Transform Aromatic Hydrocarbon Molecules into\n  Confined Carbyne inside Single-Walled Carbon Nanotubes",
  "authors": "Yingzhi Chen, Kunpeng Tang, Wendi Zhang, Huiju Cao, Hongwei Zhang,\n  Yanghao Feng, Weili Cui, Yuan Hu, Lei Shi, Guowei Yang",
  "authorsParsed": [
    [
      "Chen",
      "Yingzhi",
      ""
    ],
    [
      "Tang",
      "Kunpeng",
      ""
    ],
    [
      "Zhang",
      "Wendi",
      ""
    ],
    [
      "Cao",
      "Huiju",
      ""
    ],
    [
      "Zhang",
      "Hongwei",
      ""
    ],
    [
      "Feng",
      "Yanghao",
      ""
    ],
    [
      "Cui",
      "Weili",
      ""
    ],
    [
      "Hu",
      "Yuan",
      ""
    ],
    [
      "Shi",
      "Lei",
      ""
    ],
    [
      "Yang",
      "Guowei",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 29 Dec 2024 08:11:11 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735459871000,
  "abstract": "  Carbyne, a sp1-hybridized allotrope of carbon, is a linear carbon chain with\nexceptional theoretically predicted properties that surpass those of\nsp2-hybridized graphene and carbon nanotubes (CNTs). However, the existence of\ncarbyne has been debated due to its instability caused by Peierls distortion,\nwhich limits its practical development. The only successful synthesis of\ncarbyne has been achieved inside CNTs, resulting in a form known as confined\ncarbyne (CC). However, CC can only be synthesized inside multi-walled CNTs,\nlimiting its property-tuning capabilities to the inner tubes of the CNTs. Here,\nwe present a universal method for synthesizing CC inside single-walled carbon\nnanotubes (SWCNTs) with diameter of 0.9-1.3 nm. Aromatic hydrocarbon molecules\nare filled inside SWCNTs and subsequently transformed into CC under\nlow-temperature annealing. A variety of aromatic hydrocarbon molecules are\nconfirmed as effective precursors for formation of CC, with Raman frequencies\ncentered around 1861 cm-1. Enriched (6,5) and (7,6) SWCNTs with diameters less\nthan 0.8 nm are less effective than the SWCNTs with diameter of 0.9-1.3 nm for\nCC formation. Furthermore, resonance Raman spectroscopy reveals that optical\nband gap of the CC at 1861 cm-1 is 2.353 eV, which is consistent with the\nresult obtained using a linear relationship between the Raman signal and\noptical band gap. This newly developed approach provides a versatile route for\nsynthesizing CC from various precursor molecules inside diverse templates,\nwhich is not limited to SWCNTs but could extend to any templates with\nappropriate size, including molecular sieves, zeolites, boron nitride\nnanotubes, and metal-organic frameworks.\n",
  "subjects": [
    "Condensed Matter/Materials Science",
    "Condensed Matter/Mesoscale and Nanoscale Physics",
    "Physics/Chemical Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "dCIKdDZknxXlFzkOoX08fIGogDi7UIiBk2XghOJ3nFY",
  "pdfSize": "6467363"
}