{"id":"2412.01222","title":"The Subparsec-scale Structure and Evolution of Centaurus A. III. A\n  Multi-Epoch Spectral And Polarimetric VLBA Study","authors":"Steve Prabu, Steven J Tingay, Arash Bahramian, James C.A.\n  Miller-Jones, Callan M. Wood, Shane P.O'Sullivan","authorsParsed":[["Prabu","Steve",""],["Tingay","Steven J",""],["Bahramian","Arash",""],["Miller-Jones","James C. A.",""],["Wood","Callan M.",""],["O'Sullivan","Shane P.",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 07:40:19 GMT"}],"updateDate":"2024-12-03","timestamp":1733125219000,"abstract":"  The Centaurus A radio galaxy, due to its proximity, presents itself as one of\nthe few systems that allow the study of relativistic jet outflows at sub-parsec\ndistances from the central supermassive black holes, with high signal to noise.\nWe present the results from the first multi-epoch spectropolarimetric\nobservations of Centaurus A at milliarcsecond resolution, with a continuous\nfrequency coverage of $4.59-7.78$\\,GHz. Using a Bayesian framework, we perform\na comprehensive study of the jet kinematics, and discuss aspects of the jet\ngeometry including the jet inclination angle, jet opening angle, and the jet\nexpansion profile. We calculate an upper limit on the jet's inclination to the\nline of sight to be $<25^{\\circ}$, implying the lower limit on the intrinsic\njet speed to be $0.2$\\,c. On the observed VLBA scales we detect new jet\ncomponents launched by the central engine since our previous study. Using the\nobserved frequency-dependent core shift in Centaurus A, we find the jet to have\nreached constant bulk speed and conical outflow at the regions probed by the\nbase of the jet at $7.78- 4.59$\\,GHz, and we also estimate the location of the\ncentral black hole further upstream. Through polarimetric analysis (by applying\nRM synthesis for the first time on VLBI data), we find evidence to suggest the\npossible onset of acceleration towards the leading edge of Centaurus A's\nsubparsec-scale jet studied here.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"EyE02NQL6LLOck6pbZ-c-ZRcjfnQL7TfhUIv3VJ3Ols","pdfSize":"16722721"}