{"id":"2412.15899","title":"Simulation-based Bayesian predictive probability of success for interim\n  monitoring of clinical trials with competing event data: two case studies","authors":"Chiara Micoli, Alessio Crippa, Jason T. Connor, I-SPY COVID\n  Consortium, Martin Eklund, Andrea Discacciati","authorsParsed":[["Micoli","Chiara",""],["Crippa","Alessio",""],["Connor","Jason T.",""],["Consortium","I-SPY COVID",""],["Eklund","Martin",""],["Discacciati","Andrea",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 13:53:12 GMT"}],"updateDate":"2024-12-23","timestamp":1734702792000,"abstract":"  Bayesian predictive probabilities of success (PPoS) use interim trial data to\ncalculate the probability of trial success. These quantities can be used to\noptimize trial size or to stop for futility. In this paper, we describe a\nsimulation-based approach to compute the PPoS for clinical trials with\ncompeting event data, for which no specific methodology is currently available.\nThe proposed procedure hinges on modelling the joint distribution of time to\nevent and event type by specifying Bayesian models for the cause-specific\nhazards of all event types. This allows the prediction of outcome data at the\nconclusion of the trial. The PPoS is obtained by numerically averaging the\nprobability of success evaluated at fixed parameter values over the posterior\ndistribution of the parameters. Our work is motivated by two randomised\nclinical trials: the I-SPY COVID phase II trial for the treatment of severe\nCOVID-19 (NCT04488081) and the STHLM3 prostate cancer diagnostic trial\n(ISRCTN84445406), both of which are characterised by competing event data. We\npresent different modelling alternatives for the joint distribution of time to\nevent and event type and show how the choice of the prior distributions can be\nused to assess the PPoS under different scenarios. The role of the PPoS\nanalyses in the decision making process for these two trials is also discussed.\n","subjects":["Statistics/Methodology","Statistics/Applications"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_Nveo6lE1Z7nepSVR7pzhQQSuAHmiM20hRPnz0tUR5M","pdfSize":"730260"}