{
  "id": "2412.10739",
  "title": "DSRC: Learning Density-insensitive and Semantic-aware Collaborative\n  Representation against Corruptions",
  "authors": "Jingyu Zhang, Yilei Wang, Lang Qian, Peng Sun, Zengwen Li, Sudong\n  Jiang, Maolin Liu, Liang Song",
  "authorsParsed": [
    [
      "Zhang",
      "Jingyu",
      ""
    ],
    [
      "Wang",
      "Yilei",
      ""
    ],
    [
      "Qian",
      "Lang",
      ""
    ],
    [
      "Sun",
      "Peng",
      ""
    ],
    [
      "Li",
      "Zengwen",
      ""
    ],
    [
      "Jiang",
      "Sudong",
      ""
    ],
    [
      "Liu",
      "Maolin",
      ""
    ],
    [
      "Song",
      "Liang",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 14 Dec 2024 08:19:30 GMT"
    },
    {
      "version": "v2",
      "created": "Thu, 27 Feb 2025 13:17:17 GMT"
    }
  ],
  "updateDate": "2025-02-28",
  "timestamp": 1734164370000,
  "abstract": "  As a potential application of Vehicle-to-Everything (V2X) communication,\nmulti-agent collaborative perception has achieved significant success in 3D\nobject detection. While these methods have demonstrated impressive results on\nstandard benchmarks, the robustness of such approaches in the face of complex\nreal-world environments requires additional verification. To bridge this gap,\nwe introduce the first comprehensive benchmark designed to evaluate the\nrobustness of collaborative perception methods in the presence of natural\ncorruptions typical of real-world environments. Furthermore, we propose DSRC, a\nrobustness-enhanced collaborative perception method aiming to learn\nDensity-insensitive and Semantic-aware collaborative Representation against\nCorruptions. DSRC consists of two key designs: i) a semantic-guided\nsparse-to-dense distillation framework, which constructs multi-view dense\nobjects painted by ground truth bounding boxes to effectively learn\ndensity-insensitive and semantic-aware collaborative representation; ii) a\nfeature-to-point cloud reconstruction approach to better fuse critical\ncollaborative representation across agents. To thoroughly evaluate DSRC, we\nconduct extensive experiments on real-world and simulated datasets. The results\ndemonstrate that our method outperforms SOTA collaborative perception methods\nin both clean and corrupted conditions. Code is available at\nhttps://github.com/Terry9a/DSRC.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "MlQCdzj4dsIlpZFLsb74FR_DTlomM7AHKAcui89_pw8",
  "pdfSize": "2418219"
}