{
  "id": "2412.05592",
  "title": "From Flexibility to Manipulation: The Slippery Slope of XAI Evaluation",
  "authors": "Kristoffer Wickstr{\\o}m and Marina Marie-Claire H\\\"ohne and Anna\n  Hedstr\\\"om",
  "authorsParsed": [
    [
      "Wickstrøm",
      "Kristoffer",
      ""
    ],
    [
      "Höhne",
      "Marina Marie-Claire",
      ""
    ],
    [
      "Hedström",
      "Anna",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 7 Dec 2024 09:14:46 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733562886000,
  "abstract": "  The lack of ground truth explanation labels is a fundamental challenge for\nquantitative evaluation in explainable artificial intelligence (XAI). This\nchallenge becomes especially problematic when evaluation methods have numerous\nhyperparameters that must be specified by the user, as there is no ground truth\nto determine an optimal hyperparameter selection. It is typically not feasible\nto do an exhaustive search of hyperparameters so researchers typically make a\nnormative choice based on similar studies in the literature, which provides\ngreat flexibility for the user. In this work, we illustrate how this\nflexibility can be exploited to manipulate the evaluation outcome. We frame\nthis manipulation as an adversarial attack on the evaluation where seemingly\ninnocent changes in hyperparameter setting significantly influence the\nevaluation outcome. We demonstrate the effectiveness of our manipulation across\nseveral datasets with large changes in evaluation outcomes across several\nexplanation methods and models. Lastly, we propose a mitigation strategy based\non ranking across hyperparameters that aims to provide robustness towards such\nmanipulation. This work highlights the difficulty of conducting reliable XAI\nevaluation and emphasizes the importance of a holistic and transparent approach\nto evaluation in XAI.\n",
  "subjects": [
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "8O76GAiR2B0fZwmckk9XDejhmDvJX_mOxJK0CXU_ePc",
  "pdfSize": "823067"
}