{"id":"2412.14096","title":"Exploring User Acceptance of Blockchain-Based Student Certificate\n  Sharing System: A Study on Non Fungible Token (NFT) Utilization","authors":"Prakhyat Khati, Ajay Kumar Shrestha, Julita Vassileva","authorsParsed":[["Khati","Prakhyat",""],["Shrestha","Ajay Kumar",""],["Vassileva","Julita",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 17:47:17 GMT"}],"updateDate":"2024-12-19","timestamp":1734544037000,"abstract":"  Blockchain technology has emerged as a transformative tool for data\nmanagement in a variety of industries, including fintech, research and\nhealthcare. We have developed a workable blockchain based system that utilizes\nnon fungible tokens NFTs to tokenize and prove ownership of the academic\ninstitutions credentials. This makes it easier to create provenance and\nownership documentation for academic data and meta credentials. This system\nenables the secure sharing of academic information while maintaining control,\noffering incentives for collaboration, and granting users full transparency and\ncontrol over data access. While the initial adoption of these systems is\ncrucial for ongoing service usage, the exploration of the user acceptance\nbehavioural model remains limited in the existing literature. In this paper, we\nbuild upon the Technology Acceptance Model TAM, incorporating additional\nelements to scrutinize the impact of perceived ease of use, perceived\nusability, and attitude towards the system on the intention to use a blockchain\nbased academic data and meta credentials sharing system. The research, grounded\nin user evaluations of a prototype, employs a TAM validated questionnaire.\nResults indicate that individual constructs notably affect the intention to use\nthe system, and their collective impact is statistically significant.\nSpecifically, perceived ease of use is the sole factor with an insignificant\ninfluence on the intention to use. The paper underscores the dominant influence\nof attitude towards the system on perceived usefulness. It concludes with a\ndiscussion on the implications of these findings within the context of\nblockchain based academic data and meta credentials sharing, incorporating NFTs\nfor ownership definition.\n","subjects":["Computer Science/Computers and Society","Computer Science/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"TB6MeqN4gijxkAaaaYRH-B35F2LVOyS2QzZ0SUZbyfU","pdfSize":"422354"}