{
  "id": "2412.13907",
  "title": "Indirect Zero Field NMR Spectroscopy",
  "authors": "Kai Buckenmaier, Richard Neumann, Friedemann Bullinger, Nicolas Kempf,\n  Pavel Povolni, J\\\"orn Engelmann, Judith Samlow, Jan-Bernd H\\\"ovener, Klaus\n  Scheffler, Adam Ortmeier, Markus Plaumann, Rainer K\\\"orber, Thomas Theis and\n  Andrey N. Pravdivtsev",
  "authorsParsed": [
    [
      "Buckenmaier",
      "Kai",
      ""
    ],
    [
      "Neumann",
      "Richard",
      ""
    ],
    [
      "Bullinger",
      "Friedemann",
      ""
    ],
    [
      "Kempf",
      "Nicolas",
      ""
    ],
    [
      "Povolni",
      "Pavel",
      ""
    ],
    [
      "Engelmann",
      "Jörn",
      ""
    ],
    [
      "Samlow",
      "Judith",
      ""
    ],
    [
      "Hövener",
      "Jan-Bernd",
      ""
    ],
    [
      "Scheffler",
      "Klaus",
      ""
    ],
    [
      "Ortmeier",
      "Adam",
      ""
    ],
    [
      "Plaumann",
      "Markus",
      ""
    ],
    [
      "Körber",
      "Rainer",
      ""
    ],
    [
      "Theis",
      "Thomas",
      ""
    ],
    [
      "Pravdivtsev",
      "Andrey N.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 14:48:48 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734533328000,
  "abstract": "  This study pioneers the two-field correlation spectroscopy (COSY) in zero to\nultralow field (ZULF) liquid state NMR, employing hyperpolarized\n[1-$^{13}$C]pyruvate as a model system. We demonstrate the successful\nintegration of signal amplification by reversible exchange (SABRE) for\nhyperpolarization, enabling the detection of ZULF COSY spectra with increased\nsensitivity. The use of field cycling allows the acquisition of two-field COSY\nspectra at varying magnetic field strengths, including zero-field conditions.\nThis enables insight into both J-coupling and Zeeman-dominated regimes\nbenefiting from ULF field observation sensitivity and mitigation of\nlow-frequency noise by conducting readout at higher fields (>5 $\\mu$T). Our\nstudy explores the effects of polarization transfer, apodization techniques,\nand the potential for further application of ZULF NMR in chemical analysis\nexemplified for three X-nuclei and three corresponding molecules:\n[1-$^{13}$C]pyruvate, [$^{15}$N]acetonitrile and [3-$^{19}$F]pyridine. These\nfindings pave the way for more sensitive and cost-effective NMR spectroscopy in\nlow-field regimes.\n",
  "subjects": [
    "Physics/Medical Physics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "vDpFSCwaz4qqZpoHchbr3g1xaKZ3u7PdOZ4TwKmua-M",
  "pdfSize": "2870244"
}