{
  "id": "2412.01233",
  "title": "Best Practices for Large Language Models in Radiology",
  "authors": "Christian Bluethgen, Dave Van Veen, Cyril Zakka, Katherine Link, Aaron\n  Fanous, Roxana Daneshjou, Thomas Frauenfelder, Curtis Langlotz, Sergios\n  Gatidis, Akshay Chaudhari",
  "authorsParsed": [
    [
      "Bluethgen",
      "Christian",
      ""
    ],
    [
      "Van Veen",
      "Dave",
      ""
    ],
    [
      "Zakka",
      "Cyril",
      ""
    ],
    [
      "Link",
      "Katherine",
      ""
    ],
    [
      "Fanous",
      "Aaron",
      ""
    ],
    [
      "Daneshjou",
      "Roxana",
      ""
    ],
    [
      "Frauenfelder",
      "Thomas",
      ""
    ],
    [
      "Langlotz",
      "Curtis",
      ""
    ],
    [
      "Gatidis",
      "Sergios",
      ""
    ],
    [
      "Chaudhari",
      "Akshay",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 07:54:55 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733126095000,
  "abstract": "  At the heart of radiological practice is the challenge of integrating complex\nimaging data with clinical information to produce actionable insights. Nuanced\napplication of language is key for various activities, including managing\nrequests, describing and interpreting imaging findings in the context of\nclinical data, and concisely documenting and communicating the outcomes. The\nemergence of large language models (LLMs) offers an opportunity to improve the\nmanagement and interpretation of the vast data in radiology. Despite being\nprimarily general-purpose, these advanced computational models demonstrate\nimpressive capabilities in specialized language-related tasks, even without\nspecific training. Unlocking the potential of LLMs for radiology requires basic\nunderstanding of their foundations and a strategic approach to navigate their\nidiosyncrasies. This review, drawing from practical radiology and machine\nlearning expertise and recent literature, provides readers insight into the\npotential of LLMs in radiology. It examines best practices that have so far\nstood the test of time in the rapidly evolving landscape of LLMs. This includes\npractical advice for optimizing LLM characteristics for radiology practices\nalong with limitations, effective prompting, and fine-tuning strategies.\n",
  "subjects": [
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "jU5psc5ygnuGd_cjNsIUKsrs4OdYn53i5GU5PoajwGU",
  "pdfSize": "2214738"
}