{"id":"2412.03083","title":"A Scalable Quantum Neural Network for Approximate SRBB-Based Unitary\n  Synthesis","authors":"Giacomo Belli, Marco Mordacci and Michele Amoretti","authorsParsed":[["Belli","Giacomo",""],["Mordacci","Marco",""],["Amoretti","Michele",""]],"versions":[{"version":"v1","created":"Wed, 4 Dec 2024 07:21:23 GMT"}],"updateDate":"2024-12-05","timestamp":1733296883000,"abstract":"  In this work, scalable quantum neural networks are introduced to approximate\nunitary evolutions through the Standard Recursive Block Basis (SRBB) and,\nsubsequently, redesigned with a reduced number of CNOTs. This algebraic\napproach to the problem of unitary synthesis exploits Lie algebras and their\ntopological features to obtain scalable parameterizations of unitary operators.\nFirst, the recursive algorithm that builds the SRBB is presented, framed in the\noriginal scalability scheme already known to the literature only from a\ntheoretical point of view. Unexpectedly, 2-qubit systems emerge as a special\ncase outside this scheme. Furthermore, an algorithm to reduce the number of\nCNOTs is proposed, thus deriving a new implementable scaling scheme that\nrequires one single layer of approximation. From the mathematical algorithm,\nthe scalable CNOT-reduced quantum neural network is implemented and its\nperformance is assessed with a variety of different unitary matrices, both\nsparse and dense, up to 6 qubits via the PennyLane library. The effectiveness\nof the approximation is measured with different metrics in relation to two\noptimizers: a gradient-based method and the Nelder-Mead method. The approximate\nSRBB-based synthesis algorithm with CNOT-reduction is also tested on real\nhardware and compared with other valid approximation and decomposition methods\navailable in the literature.\n","subjects":["Physics/Quantum Physics","Computer Science/Emerging Technologies","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"CZroJ8RyIpSUERhLXSSHJPILUD5smNuS9_7UOJwPSMM","pdfSize":"1061322"}