{
  "id": "2412.08546",
  "title": "Quantum impurities in finite-temperature Bose gases: Detecting vortex\n  proliferation across the BKT and BEC transitions",
  "authors": "Paolo Comaron, Nathan Goldman, Atac Imamoglu, Ivan Amelio",
  "authorsParsed": [
    [
      "Comaron",
      "Paolo",
      ""
    ],
    [
      "Goldman",
      "Nathan",
      ""
    ],
    [
      "Imamoglu",
      "Atac",
      ""
    ],
    [
      "Amelio",
      "Ivan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 17:01:12 GMT"
    },
    {
      "version": "v2",
      "created": "Thu, 12 Dec 2024 10:13:13 GMT"
    },
    {
      "version": "v3",
      "created": "Fri, 13 Dec 2024 18:52:56 GMT"
    }
  ],
  "updateDate": "2024-12-16",
  "timestamp": 1733936472000,
  "abstract": "  Detecting vortices in neutral superfluids represents an outstanding\nexperimental challenge. Using stochastic classical-field methods, we\ntheoretically show that a quantum impurity repulsively coupled to a\nweakly-interacting Bose gas at finite temperature carries direct spectroscopic\nsignatures of vortex proliferation. In two dimensions, we find that a\nlow-energy (attractive) branch in the excitation spectrum becomes prominent\nwhen the temperature is tuned across the Berezinskii-Kosterlitz-Thouless (BKT)\ntransition. We explain this red-shifted resonance as originating from the\nbinding of the impurity to vortices, where the bosons density (and hence, the\nrepulsive Hartree energy) is reduced. This mechanism could be exploited to\nspectroscopically estimate the BKT transition in excitonic insulators. In\ncontrast, in three dimensions, the impurity spectra reflect the presence of\nvortex rings well below the condensation temperature, and herald the presence\nof a thermal gas above the Bose-Einstein condensation transition. Importantly,\nwe expect our results to have impact on the understanding of Bose-polaron\nformation at finite temperatures.\n",
  "subjects": [
    "Condensed Matter/Quantum Gases",
    "Condensed Matter/Mesoscale and Nanoscale Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "XJ01b5W82HxDWKVJv8v65Zp0MeV2kxhyN3KcG-Z8XaA",
  "pdfSize": "1158223"
}