{
  "id": "2412.03339",
  "title": "Ground-based Cislunar Space Surveillance Demonstrations at Los Alamos\n  National Laboratory",
  "authors": "Yancey Sechrest and Marion Vance and Christian Ward and William\n  Priedhorsky and Robert Hill and W Thomas Vestrand and Przemyslaw Wozniak",
  "authorsParsed": [
    [
      "Sechrest",
      "Yancey",
      ""
    ],
    [
      "Vance",
      "Marion",
      ""
    ],
    [
      "Ward",
      "Christian",
      ""
    ],
    [
      "Priedhorsky",
      "William",
      ""
    ],
    [
      "Hill",
      "Robert",
      ""
    ],
    [
      "Vestrand",
      "W Thomas",
      ""
    ],
    [
      "Wozniak",
      "Przemyslaw",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 14:14:05 GMT"
    }
  ],
  "updateDate": "2024-12-05",
  "timestamp": 1733321645000,
  "abstract": "  Surveillance of objects in the cislunar domain is challenging due primarily\nto the large distances (10x the Geosynchronous orbit radius) and total volume\nof space to be covered. Ground-based electro-optical observations are further\nhindered by high background levels due to scattered moonlight. In this paper,\nwe report on ground-based demonstrations of space surveillance for targets in\nthe cislunar domain exploiting the remarkable performance of 36cm, F2.2 class\ntelescopes equipped with current generation, back-side illuminated, full-frame\nCMOS imager. The demonstrations leverage advantageous viewing conditions for\nthe Artemis Orion vehicle during its return to earth, and the total lunar\neclipse of November 8th 2022 for viewing the CAPSTONE vehicle. Estimated g-band\nmagnitudes for vehicles were 19.57 at a range of 4.4e5 km and 15.53 at a range\nof 3.2e5 km for CAPSTONE and Artemis Orion, respectively. In addition to\nobservations, we present reflectance signature modeling implemented in the\nLunaTK space-sensing simulation framework and compare calculated apparent\nmagnitudes to observed. Design of RApid Telescopes for Optical Response\n(RAPTOR) instruments, observing campaigns of Artemis Orion and CAPSTONE\nmissions, and initial comparisons to electro-optical modeling are reviewed.\n",
  "subjects": [
    "Astrophysics/Instrumentation and Methods for Astrophysics",
    "Physics/Optics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "7qbB-N8OpvNDBED7f0T0H1ilej1NyECAwYPj_kIwJ2A",
  "pdfSize": "11454994"
}