{"id":"2412.09759","title":"Advancements in Maize Cultivation: Synergistic Effects of Dry\n  Atmospheric Plasma Combined with Plasma-Activated Water","authors":"Jean-Paul Kamseu-Mogo, Manon Soulier, Georges Kamgang-Youbi, Hortense\n  No\\\"elle Apala Mafouasson, Thierry Dufour","authorsParsed":[["Kamseu-Mogo","Jean-Paul",""],["Soulier","Manon",""],["Kamgang-Youbi","Georges",""],["Mafouasson","Hortense Noëlle Apala",""],["Dufour","Thierry",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 23:36:04 GMT"}],"updateDate":"2024-12-16","timestamp":1734046564000,"abstract":"  In this study, we investigate the effects of pre-germinative and\npost-germinative plasma treatments, applied separately or in combination, to\nimprove maize germination and early seedling development. Pre-germinative\ntreatment consists of priming the seeds with a dry atmospheric plasma (DAP)\ngenerated by a dielectric barrier device (DBD), characterized by minimal\nradiative emission, low electrical power (4 W) and high emissions of O, OH and\nNO radicals. Post-germinative treatment, known as plasma-activated water (PAW),\nuses a single-pin electrode device (SPED) to generate a DC discharge that\nfeatures a power of 126 W and produces large amounts of OH radicals. The\nresulting PAW, after 5 minutes of SPED treatment, induces a slight\nacidification and increased concentrations of nitrate ions (from 24 to 250\nmg/L), nitrite ions (from less than 0.1 to 56.1 mg/L) and hydrogen peroxide\n(from 0.3 to 18.5 mg/L). Results indicate that DAP applied on maize seeds for\n20 min boosts their germination rate up to 90% (versus only 65% for untreated\nseeds) while reducing the median germination time by 37.5%. Then, seedling\ngrowth monitoring is achieved on control, DAP, PAW and DAP+PAW groups to assess\nstem length, hypocotyl length, leaf count, collar diameter and fresh/dry mass.\nThe DAP+PAW group shows the most robust growth, demonstrating a synergistic\neffect of the combined treatments, particularly with significantly longer stem\nlengths. Additionally, physiological analyses of seedling leaves indicate a\ndecrease in chlorophyll content despite enhanced growth, while fluorescence\nmicroscopy reveals a reduction in stomatal density in leaves treated with DAP\nand PAW, especially in the combined treatment group, potentially impacting\nphotosynthetic efficiency and water regulation.\n","subjects":["Physics/Plasma Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"lpyY0VCbgJUA_tNrtw8kmE_wYUq_YkdAqzYgDT0e85M","pdfSize":"2014061"}