{"id":"2412.04804","title":"Quantum-hydrodynamic modal perspective on plasmonic gap structures","authors":"Pu Zhang, Christos Tserkezis, and N. Asger Mortensen","authorsParsed":[["Zhang","Pu",""],["Tserkezis","Christos",""],["Mortensen","N. Asger",""]],"versions":[{"version":"v1","created":"Fri, 6 Dec 2024 06:26:29 GMT"}],"updateDate":"2025-02-21","timestamp":1733466389000,"abstract":"  Plasmonic gap structures are among the few configurations capable of\ngenerating extreme light confinement, finding applications in surface-enhanced\nspectroscopy, ultrasensitive detection, photocatalysis and more. Their\nplasmonic response undergoes a dramatic, quantum effect-driven transition as\nthe gap size approaches zero. Modal analysis can reveal insights into the\nmechanisms governing this process, which are otherwise obscured by nonlocal\ndamping effects. Here, we offer a fresh modal perspective on the transition of\nthe plasmonic response using quantum hydrodynamic theory (QHT)-based\nquasinormal mode (QNM) analysis. Focusing on the bonding dipolar and\ncharge-transfer plasmons of a nanosphere dimer, we examine the detailed mode\ntransition through the touching regime as well as the asymptotic behavior\ncompared with the classical results as the constituent nanoparticles either\nseparate or overlap. The complex eigenfrequency particularly provides accurate\ninformation on the linewidth and quality factor of the plasmon modes. We\nintroduce an index to characterize charge-transfer efficiency, especially for\nthe charge-transfer plasmon. The significant role of nonlocal damping in the\nmode evolution is elucidated by our mode-resolved QHT-QNM analysis. The\ninsights from our theoretical study provide an integrated understanding of mode\nevolution in plasmonic gap structures, which can further advance gap\nstructure-based applications.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Physics/Optics","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"BhkwMFh7CQmhWnNeQQrAeQQCrzT18wImhyee9TzmluU","pdfSize":"17527764"}