{
  "id": "2412.03949",
  "title": "Learning Speed-Adaptive Walking Agent Using Imitation Learning with\n  Physics-Informed Simulation",
  "authors": "Yi-Hung Chiu, Ung Hee Lee, Changseob Song, Manaen Hu, and Inseung Kang",
  "authorsParsed": [
    [
      "Chiu",
      "Yi-Hung",
      ""
    ],
    [
      "Lee",
      "Ung Hee",
      ""
    ],
    [
      "Song",
      "Changseob",
      ""
    ],
    [
      "Hu",
      "Manaen",
      ""
    ],
    [
      "Kang",
      "Inseung",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 07:55:58 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733385358000,
  "abstract": "  Virtual models of human gait, or digital twins, offer a promising solution\nfor studying mobility without the need for labor-intensive data collection.\nHowever, challenges such as the sim-to-real gap and limited adaptability to\ndiverse walking conditions persist. To address these, we developed and\nvalidated a framework to create a skeletal humanoid agent capable of adapting\nto varying walking speeds while maintaining biomechanically realistic motions.\nThe framework combines a synthetic data generator, which produces\nbiomechanically plausible gait kinematics from open-source biomechanics data,\nand a training system that uses adversarial imitation learning to train the\nagent's walking policy. We conducted comprehensive analyses comparing the\nagent's kinematics, synthetic data, and the original biomechanics dataset. The\nagent achieved a root mean square error of 5.24 +- 0.09 degrees at varying\nspeeds compared to ground-truth kinematics data, demonstrating its\nadaptability. This work represents a significant step toward developing a\ndigital twin of human locomotion, with potential applications in biomechanics\nresearch, exoskeleton design, and rehabilitation.\n",
  "subjects": [
    "Computer Science/Robotics",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "1wUVQxS1-FvYL1I41PdJtQtrYB5J6knnfTKp5NYEcUE",
  "pdfSize": "2052248"
}