{"id":"2412.11700","title":"Laser-induced helicity and texture-dependent switching of nanoscale\n  stochastic domains in a ferromagnetic film","authors":"Dinar Khusyainov, Rein Liefferink, MengXing Na, Kammerbauer Fabian,\n  Robert Fr\\\"omter, Mathias Kl\\\"aui, Dmitry Kozodaev, Nikolay Vovk, Rostislav\n  Mikhaylovskiy, Dmytro Afanasiev, Alexey Kimel, Johan H. Mentink, Theo Rasing","authorsParsed":[["Khusyainov","Dinar",""],["Liefferink","Rein",""],["Na","MengXing",""],["Fabian","Kammerbauer",""],["Frömter","Robert",""],["Kläui","Mathias",""],["Kozodaev","Dmitry",""],["Vovk","Nikolay",""],["Mikhaylovskiy","Rostislav",""],["Afanasiev","Dmytro",""],["Kimel","Alexey",""],["Mentink","Johan H.",""],["Rasing","Theo",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 12:21:41 GMT"}],"updateDate":"2024-12-17","timestamp":1734351701000,"abstract":"  Controlling magnetic textures at ever smaller length and time scales is of\nkey fundamental and technological interest. Achieving nanoscale control often\nrelies on finding an external stimulus that is able to act on that small length\nscales, which is highly challenging. A promising alternative is to achieve\nnanoscale control using the inhomogeneity of the magnetic texture itself. Using\na multilayered ferromagnetic Pt/Co/Pt thin-film structure as a model system, we\nemploy a magnetic force microscope to investigate the change in magnetic\nnanotextures induced by circularly polarized picosecond laser pulses. Starting\nfrom a saturated magnetic state, we find stochastic nucleation of complex\nnanotextured domain networks. In particular, the growth of these domains\ndepends not only on their macroscopic magnetization but also on the complexity\nof the domain texture. This helicity and texture-dependent effect contrasts\nwith the typical homogeneous growth of magnetic domains initiated by an\neffective magnetic field of a circularly polarized laser pulse. We corroborate\nour findings with a stochastic model for the nucleation of magnetic domains, in\nwhich the nucleation and annihilation probability not only depends on the\nhelicity of light but also on the relative magnetization orientation of\nneighboring domains. Our results establish a new approach to investigate\nultrafast nanoscale magnetism and photo-excitation across first-order phase\ntransitions.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"2ozAvokHJf5lSLdtCyLQCI65dgoLQ-m5arqF6cppKCM","pdfSize":"1743880"}