{
  "id": "2412.11882",
  "title": "Hardware-in-the-loop Simulation Testbed for Geomagnetic Navigation",
  "authors": "Songnan Yang, Shiliang Zhang, Qianyun Zhang, Xiaohui Zhang, Xuehui Ma",
  "authorsParsed": [
    [
      "Yang",
      "Songnan",
      ""
    ],
    [
      "Zhang",
      "Shiliang",
      ""
    ],
    [
      "Zhang",
      "Qianyun",
      ""
    ],
    [
      "Zhang",
      "Xiaohui",
      ""
    ],
    [
      "Ma",
      "Xuehui",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 15:31:15 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734363075000,
  "abstract": "  Geomagnetic navigation leverages the ubiquitous Earth's magnetic signals to\nnavigate missions, without dependence on GPS services or pre-stored geographic\nmaps. It has drawn increasing attention and is promising particularly for\nlong-range navigation into unexplored areas. Current geomagnetic navigation\nstudies are still in the early stages with simulations and computational\nvalidations, without concrete efforts to develop cost-friendly test platforms\nthat can empower deployment and experimental analysis of the developed\napproaches. This paper presents a hardware-in-the-loop simulation testbed to\nsupport geomagnetic navigation experimentation. Our testbed is dedicated to\nsynthesizing geomagnetic field environment for the navigation. We develop the\nsoftware in the testbed to simulate the dynamics of the navigation environment,\nand we build the hardware to generate the physical magnetic field, which\nfollows and aligns with the simulated environment. The testbed aims to provide\ncontrollable magnetic field that can be used to experiment with geomagnetic\nnavigation in labs, thus avoiding real and expensive navigation experiments,\ne.g., in the ocean, for validating navigation prototypes. We build the testbed\nwith off-the-shelf hardware in an unshielded environment to reduce cost. We\nalso develop the field generation control and hardware parameter optimization\nfor quality magnetic field generation. We conduct a detailed performance\nanalysis to show the quality of the field generation by the testbed, and we\nreport the experimental results on performance indicators, including accuracy,\nuniformity, stability, and convergence of the generated field towards the\ntarget geomagnetic environment.\n",
  "subjects": [
    "Computer Science/Robotics",
    "Computer Science/Systems and Control",
    "Electrical Engineering and Systems Science/Systems and Control"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "TScn9idkRmlVQawLR4vEkhSRr4-75nNjwsCpHEttv_8",
  "pdfSize": "15394388"
}