{
  "id": "2412.01039",
  "title": "Reducing Inference Energy Consumption Using Dual Complementary CNNs",
  "authors": "Michail Kinnas, John Violos, Ioannis Kompatsiaris, Symeon Papadopoulos",
  "authorsParsed": [
    [
      "Kinnas",
      "Michail",
      ""
    ],
    [
      "Violos",
      "John",
      ""
    ],
    [
      "Kompatsiaris",
      "Ioannis",
      ""
    ],
    [
      "Papadopoulos",
      "Symeon",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 01:46:07 GMT"
    },
    {
      "version": "v2",
      "created": "Wed, 11 Dec 2024 06:22:34 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733103967000,
  "abstract": "  Energy efficiency of Convolutional Neural Networks (CNNs) has become an\nimportant area of research, with various strategies being developed to minimize\nthe power consumption of these models. Previous efforts, including techniques\nlike model pruning, quantization, and hardware optimization, have made\nsignificant strides in this direction. However, there remains a need for more\neffective on device AI solutions that balance energy efficiency with model\nperformance. In this paper, we propose a novel approach to reduce the energy\nrequirements of inference of CNNs. Our methodology employs two small\nComplementary CNNs that collaborate with each other by covering each other's\n\"weaknesses\" in predictions. If the confidence for a prediction of the first\nCNN is considered low, the second CNN is invoked with the aim of producing a\nhigher confidence prediction. This dual-CNN setup significantly reduces energy\nconsumption compared to using a single large deep CNN. Additionally, we propose\na memory component that retains previous classifications for identical inputs,\nbypassing the need to re-invoke the CNNs for the same input, further saving\nenergy. Our experiments on a Jetson Nano computer demonstrate an energy\nreduction of up to 85.8% achieved on modified datasets where each sample was\nduplicated once. These findings indicate that leveraging a complementary CNN\npair along with a memory component effectively reduces inference energy while\nmaintaining high accuracy.\n",
  "subjects": [
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "uG9GaymA8Cu4EF3EzGj9T2A0gajT87acojXuet3NtNE",
  "pdfSize": "3049361"
}