{
  "id": "2412.19777",
  "title": "Application of normalizing flows to nuclear many-body perturbation\n  theory",
  "authors": "Pengsheng Wen, Jeremy W. Holt, Albany Blackburn",
  "authorsParsed": [
    [
      "Wen",
      "Pengsheng",
      ""
    ],
    [
      "Holt",
      "Jeremy W.",
      ""
    ],
    [
      "Blackburn",
      "Albany",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 27 Dec 2024 18:18:20 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735323500000,
  "abstract": "  Many-body perturbation theory provides a powerful framework to study the\nground state and thermodynamic properties of nuclear matter as well as\nassociated single-particle potentials and response functions within a\nsystematic order-by-order expansion. However, computational challenges can\nemerge beyond the lowest orders of perturbation theory, especially when\ncomputing both single-particle potentials and response functions, which in\ngeneral are complex-valued and require Cauchy principal value calculations of\nhigh-dimensional integrals. We demonstrate that normalizing flows are suitable\nfor Monte Carlo importance sampling of both regular and irregular functions\nappearing in nuclear many-body calculations. Normalizing flows are a class of\nmachine learning models that can be used to build and sample from complicated\ndistributions through a bijective mapping from a simple base distribution.\nFurthermore, a well-trained model for a certain target integrand can be\nefficiently transferred to calculate related integrals with varying physical\nconditions. These features can enable more efficient tabulations of nuclear\nphysics inputs to numerical simulations of supernovae and neutron star mergers\nacross varying physical conditions and nuclear force models.\n",
  "subjects": [
    "Physics/Nuclear Theory"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "eQeE4ZF0z1gE1j8UrvUXYB4Zk0RM7-02g13OFnNEWIU",
  "pdfSize": "1093610"
}