{
  "id": "2412.09866",
  "title": "A Simplified Model for Predicting and Designing High-Temperature\n  Ambient-Pressure Superconductors",
  "authors": "Yuting Sun, Shixu Liu, Xin-Gao Gong, and Ji-Hui Yang",
  "authorsParsed": [
    [
      "Sun",
      "Yuting",
      ""
    ],
    [
      "Liu",
      "Shixu",
      ""
    ],
    [
      "Gong",
      "Xin-Gao",
      ""
    ],
    [
      "Yang",
      "Ji-Hui",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 05:17:00 GMT"
    }
  ],
  "updateDate": "2024-12-16",
  "timestamp": 1734067020000,
  "abstract": "  Searching for ambient-pressure conventional superconductors with critical\ntemperatures ($T_C$) higher than 40 K and implementable synthesis routes is a\nkey challenge in the field of high-temperature superconductivity, mainly due to\nlack of efficient and effective models to estimate $T_C$ of potential systems.\nIn this work, we propose a simplified model to estimate the dimensionless\nelectron-phonon coupling (EPC) strength \\lambbda and thus $T_C$ by separately\ntreating the EPC matrix elements which evaluate the pairing strength and the\nphonon-assisted nesting function P(w) which evaluates the matching of electron\nbands and phonon spectra for forming potential electron pairs via phonons. By\napplying the model to screen over the Computational 2D Materials Database\n(C2DB), we successfully identify several systems with TC exceeding 20 K as\nconfirmed by accurate first-principles calculations. Especially,\nTi$_3$N$_2$H$_2$ has a record high $T_C$ value among known MXenes, which is 52\nK (78 K) according to isotropic (anisotropic) Migdal-Eliashberg equations under\nambient pressure. More importantly, we propose a feasible synthesis route for\nTi$_3$N$_2$H$_2$ starting from the experimentally synthesized MXene\nTi$_4$N$_3$. Beyond demonstrating its feasibility and efficiency in identifying\nhigh-$T_C$ superconductors, our model illuminates the critical roles of the\nmatching between electron band and phonon spectra as a necessary condition in\ndetermining $T_C$ and points out the directions for prediction and design of\nhigh-$T_C$ superconductors, which is exemplified by showing a novel designed\nsystem Ti$_3$N$_2$H$_2$ with a possible $T_C$ of 80 K under ambient pressure.\nOur model opens new avenues for exploring high-$T_C$ systems.\n",
  "subjects": [
    "Condensed Matter/Superconductivity"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "wjXhJ8nadlZnQLohrUZ_-sxsXy45xgjULI-3TyUmWQs",
  "pdfSize": "1463415"
}