{
  "id": "2412.06523",
  "title": "Constraints of Cosmic Expansion Using an MSF",
  "authors": "Goratamang Gaedie (1 and 2), Shambel Sahlu (1 and 3), Amare Abebe (1\n  and 4) ((1) Centre for Space Research, North-West University, Potchefstroom,\n  South Africa, (2) South African Astronomical Observatory, Cape Town, South\n  Africa, (3) Department of Physics, Wolkite University, Wolkite, Ethiopia, (4)\n  National Institute for Theoretical and Computational Sciences (NITheCS),\n  South Africa)",
  "authorsParsed": [
    [
      "Gaedie",
      "Goratamang",
      "",
      "1 and 2"
    ],
    [
      "Sahlu",
      "Shambel",
      "",
      "1 and 3"
    ],
    [
      "Abebe",
      "Amare",
      "",
      "1\n  and 4"
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 14:26:54 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733754414000,
  "abstract": "  In this paper, we propose a modified scale factor (MSF) that allows us to\nexplore the accelerating expansion of the universe without invoking the\ntraditional dark-energy model, as described in the Lambda cold dark matter\n($\\Lambda$CDM) model. Instead, the MSF model introduces parameters that\nencapsulate the effects traditionally attributed to dark energy. To test the\nviability of this MSF, we constrained the model using the observational Hubble\nparameter (OHD), distance modulus measurements (SNIa), and their combined\ndatasets (OHD + SNIa). We implement a Monte Carlo Markov Chain (MCMC)\nsimulation to find the best-fit values of the model parameters. The MSF model\nproduced best-fit values for the parameter $p$ associated with the power law of\nthe matter-dominated era and $\\beta$, the exponential parameter for the\ndarkenergy-dominated era. For our MSF, these values are $p$ = 0.28 and $\\beta$\n= 0.52 when using SNIa data, $p$ = 0.63 and $\\beta$ = 0.30 for OHD data and $p$\n= 0.45 and $\\beta$ = 0.53 for a combination of datasets (OHD + SNIa). The\nnumerical results and plots of the deceleration parameter, fractional energy\ndensity, Hubble parameter, and luminosity distance are presented which are the\nkey parameters for studying the accelerated expansion of the universe. We\ncompare the results of our model with that of the $\\Lambda$CDM model and\nreconcile them with astronomical observational data. Our results indicate that\nthe MSF model shows promise, demonstrating good compatibility with current\nastronomical observations and performing comparably to the $\\Lambda$CDM model\nacross various datasets, particularly in predicting the accelerating expansion\nof the universe, while providing a unified framework that incorporates the\nsimultaneous influence of matter and dark energy components.\n",
  "subjects": [
    "Astrophysics/Cosmology and Nongalactic Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "VF1P8ljRpqXU6hrkqNgYESD4cmKmZ5SDI-uZfA5TVFE",
  "pdfSize": "724533"
}