{
  "id": "2412.13961",
  "title": "Harvesting energy from turbulent winds with Reinforcement Learning",
  "authors": "Lorenzo Basile, Maria Grazia Berni, Antonio Celani",
  "authorsParsed": [
    [
      "Basile",
      "Lorenzo",
      ""
    ],
    [
      "Berni",
      "Maria Grazia",
      ""
    ],
    [
      "Celani",
      "Antonio",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 15:40:40 GMT"
    },
    {
      "version": "v2",
      "created": "Wed, 26 Feb 2025 15:08:17 GMT"
    }
  ],
  "updateDate": "2025-02-27",
  "timestamp": 1734536440000,
  "abstract": "  Airborne Wind Energy (AWE) is an emerging technology designed to harness the\npower of high-altitude winds, offering a solution to several limitations of\nconventional wind turbines. AWE is based on flying devices (usually gliders or\nkites) that, tethered to a ground station and driven by the wind, convert its\nmechanical energy into electrical energy by means of a generator. Such systems\nare usually controlled by manoeuvering the kite so as to follow a predefined\npath prescribed by optimal control techniques, such as model-predictive\ncontrol. These methods are strongly dependent on the specific model at use and\ndifficult to generalize, especially in unpredictable conditions such as the\nturbulent atmospheric boundary layer. Our aim is to explore the possibility of\nreplacing these techniques with an approach based on Reinforcement Learning\n(RL). Unlike traditional methods, RL does not require a predefined model,\nmaking it robust to variability and uncertainty. Our experimental results in\ncomplex simulated environments demonstrate that AWE agents trained with RL can\neffectively extract energy from turbulent flows, relying on minimal local\ninformation about the kite orientation and speed relative to the wind.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Systems and Control",
    "Electrical Engineering and Systems Science/Systems and Control",
    "Physics/Fluid Dynamics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Hu4OPROPb3E3CGdLwV_pbUqRmTnNXpjDy3vItZdGN48",
  "pdfSize": "1329984"
}