{"id":"2412.04681","title":"Water Enrichment from Pebble Drift in Disks with Gap-forming Planets","authors":"Whittney Easterwood, Anusha Kalyaan, Andrea Banzatti","authorsParsed":[["Easterwood","Whittney",""],["Kalyaan","Anusha",""],["Banzatti","Andrea",""]],"versions":[{"version":"v1","created":"Fri, 6 Dec 2024 00:40:12 GMT"}],"updateDate":"2024-12-09","timestamp":1733445612000,"abstract":"  Volatiles like $H_2O$ are present as ice in solids in the outer cold regions\nof protoplanetary disks and as vapor in the warm inner regions within the water\nsnow line. Icy pebbles drifting inwards from the outer disk sublimate after\ncrossing the snow line, enriching the inner disk with solid mass and water\nvapor. Meanwhile, proto-planets forming within the disk open gaps in the disk\ngas, creating traps against the inward drift of pebbles and in turn reducing\nwater enrichment in the inner disk. Recent disk observations from millimeter\ninterferometry and infrared spectroscopy have supported this broad picture by\nfinding a correlation between the outer radial distribution of pebbles and the\nproperties of inner water vapor spectra. In this work, we aim at further\ninforming previous and future observations by building on previous models to\nexplore pebble drift in disks with multiple gaps. We systematically explore\nmultiple gap locations and their depths (equivalent to specific masses of\nplanets forming within), and different particle sizes to study their impact on\ninner disk water enrichment. We find that the presence of close-in deep gaps\ncarved by a Jupiter-mass planet is likely crucial for blocking icy pebble\ndelivery into the inner disk, while planets with lower masses only provide\nleaky traps. We also find that disks with multiple gaps show lower vapor\nenrichment in the inner disk. Altogether, these model results support the idea\nthat inner disk water delivery and planet formation are regulated by the mass\nand location of the most massive planets.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0KWn13AFZQJYmQQ14tUJg4vOJowTewm--NPcvVwJy4o","pdfSize":"4058575"}