{"id":"2412.18716","title":"Design and Evaluation of Privacy-Preserving Protocols for\n  Agent-Facilitated Mobile Money Services in Kenya","authors":"Karen Sowon, Collins W. Munyendo, Lily Klucinec, Eunice Maingi, Gerald\n  Suleh, Lorrie Faith Cranor, Giulia Fanti, Conrad Tucker and Assane Gueye","authorsParsed":[["Sowon","Karen",""],["Munyendo","Collins W.",""],["Klucinec","Lily",""],["Maingi","Eunice",""],["Suleh","Gerald",""],["Cranor","Lorrie Faith",""],["Fanti","Giulia",""],["Tucker","Conrad",""],["Gueye","Assane",""]],"versions":[{"version":"v1","created":"Wed, 25 Dec 2024 00:27:13 GMT"}],"updateDate":"2024-12-30","timestamp":1735086433000,"abstract":"  Mobile Money (MoMo), a technology that allows users to complete digital\nfinancial transactions using a mobile phone without requiring a bank account,\nhas become a common method for processing financial transactions in Africa and\nother developing regions. Operationally, users can deposit (exchange cash for\nmobile money tokens) and withdraw with the help of human agents who facilitate\na near end-to-end process from customer onboarding to authentication and\nrecourse. During deposit and withdraw operations, know-your-customer (KYC)\nprocesses require agents to access and verify customer information such as name\nand ID number, which can introduce privacy and security risks. In this work, we\ndesign alternative protocols for mobile money deposits and withdrawals that\nprotect users' privacy while enabling KYC checks. These workflows redirect the\nflow of sensitive information from the agent to the MoMo provider, thus\nallowing the agent to facilitate transactions without accessing a customer's\npersonal information. We evaluate the usability and efficiency of our proposed\nprotocols in a role play and semi-structured interview study with 32 users and\n15 agents in Kenya. We find that users and agents both generally appear to\nprefer the new protocols, due in part to convenient and efficient verification\nusing biometrics, better data privacy and access control, as well as better\nsecurity mechanisms for delegated transactions. Our results also highlight some\nchallenges and limitations that suggest the need for more work to build\ndeployable solutions.\n","subjects":["Computer Science/Cryptography and Security","Computer Science/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"L8i84vpJO0B6CcClLntaBh4Gig8K01y_UVDl8IXAPJE","pdfSize":"7400159"}