{"id":"2412.10722","title":"A technical solution for the rule of law, peace, security, and\n  evolvability of global cyberspace -- solve the three genetic defects of IP\n  network","authors":"Hui Li, Kedan Li, Jiaqing Lv, Yuanshao Liang, Feng Han, Shuo-Yen\n  Robert Li","authorsParsed":[["Li","Hui",""],["Li","Kedan",""],["Lv","Jiaqing",""],["Liang","Yuanshao",""],["Han","Feng",""],["Li","Shuo-Yen Robert",""]],"versions":[{"version":"v1","created":"Sat, 14 Dec 2024 07:33:18 GMT"}],"updateDate":"2024-12-17","timestamp":1734161598000,"abstract":"  Since its inception in the 1960s, the internet has profoundly transformed\nhuman life. However, its original design now struggles to meet the evolving\ndemands of modern society. Three primary defects have emerged: First, the\nconcentration of power among a few dominant entities has intensified\ninternational conflicts and widened the technological divide. Second, the\nInternet Protocol (IP)-based system lacks inherent security, leading to\nfrequent global cybersecurity incidents. Third, the rigidity of the IP protocol\nhas hindered the sustainable development of cyberspace, as it resists necessary\nadaptations and innovations. Addressing these issues is crucial for the future\nresilience and security of the global digital landscape.\n  To address these challenges, we propose the Co-governed Multi-Identifier\nNetwork (CoG-MIN briefly as MIN), a novel network architecture that leverages\nblockchain technology to ensure equal participation of countries worldwide in\ncyberspace governance and the rule of law. As a next-generation network system,\nCoG-MIN integrates mechanisms such as user authentication, data signatures, and\nencryption to significantly enhance network security. In testing environments,\nCoG-MIN has consistently withstood extensive attacks during various\ninternational cybersecurity competitions. Additionally, CoG-MIN supports the\nevolution and interoperability of different identifier systems, remains\nIP-compatible, and facilitates a gradual transition away from IP, providing an\nadaptable ecosystem for diverse network architectures. This adaptability\nfosters the development and evolution of diverse network architectures within\nCoG-MIN, making it a natural progression for the internet's future development.\n  We further introduce a trilogy of cyberspace security theorems... (Due to\ncharacter limitations, the full abstract is available in the paper PDF.)\n","subjects":["Computer Science/Cryptography and Security","Computer Science/Networking and Internet Architecture"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"xUL7T8ODRidBYhc8UXToyebFhvnh5lEWtbtIoC5hpdg","pdfSize":"3744663"}