{"id":"2412.00964","title":"The WALOP-North Instrument I: Optical Design, Filter Design, Calibration","authors":"John A. Kypriotakis, Siddharth Maharana, Ramya M. Anche, Chaitanya V.\n  Rajarshi, A. N. Ramaprakash, Bhushan Joshi, Artem Basyrov, Dmitry Blinov,\n  Tuhin Ghosh, Eirik Gjerlow, Sebastian Kiehlmann, Nikolaos Mandarakas, Georgia\n  V. Panopoulou, Katerina Papadaki, Vasiliki Pavlidou, Timothy J. Pearson,\n  Vincent Pelgrims, Stephen B. Potter, Anthony C. S. Readhead, Raphael\n  Skalidis, Konstantinos Tassis","authorsParsed":[["Kypriotakis","John A.",""],["Maharana","Siddharth",""],["Anche","Ramya M.",""],["Rajarshi","Chaitanya V.",""],["Ramaprakash","A. N.",""],["Joshi","Bhushan",""],["Basyrov","Artem",""],["Blinov","Dmitry",""],["Ghosh","Tuhin",""],["Gjerlow","Eirik",""],["Kiehlmann","Sebastian",""],["Mandarakas","Nikolaos",""],["Panopoulou","Georgia V.",""],["Papadaki","Katerina",""],["Pavlidou","Vasiliki",""],["Pearson","Timothy J.",""],["Pelgrims","Vincent",""],["Potter","Stephen B.",""],["Readhead","Anthony C. S.",""],["Skalidis","Raphael",""],["Tassis","Konstantinos",""]],"versions":[{"version":"v1","created":"Sun, 1 Dec 2024 20:41:52 GMT"}],"updateDate":"2024-12-03","timestamp":1733085712000,"abstract":"  The Wide Area Linear Optical Polarimeter North (WALOP-North) is an optical\npolarimeter designed for the needs of the PASIPHAE survey. It will be installed\non the 1.3m telescope at the Skinakas Observatory in Crete, Greece. After\ncommissioning, it will measure the polarization of millions of stars at high\nGalactic latitude, aiming to measure hundreds of stars per $deg^2$. The\nastronomical filter used in the instrument is a modified,\npolarimetrically-neutral broadband SDSS-r. This instrument will be pioneering\none due to its large field-of-view (FoV) of $30\\times 30$ $arcmin^2$ and high\naccuracy polarimetry measurements. The accuracy and sensitivity of the\ninstrument in polarization fraction will be at the 0.1\\% and 0.05\\% level,\nrespectively. Four separate 4k$\\times$4k CCDs will be used as the instrument\ndetectors, each imaging one of the $0\\deg{}, 45\\deg{}, 90\\deg{}$ and\n$135\\deg{}$ polarized FoV separately, therefore making the instrument a\nfour-channel, one-shot polarimeter. Here, we present the overall optical design\nof the instrument, emphasizing on the aspects of the instrument that are\ndifferent from WALOP-South. We also present a novel design of filters\nappropriate for polarimetry along with details on the management of the\ninstrument size and its polarimetric calibration.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"WetB5pOElM_Wu7I5LvnVvVYsqyNSx_AL-W8NNnpQyts","pdfSize":"12968957"}