{
  "id": "2412.10865",
  "title": "Room temperature exciton-polariton neural network with perovskite\n  crystal",
  "authors": "Andrzej Opala, Krzysztof Tyszka, Mateusz K\\k{e}dziora, Magdalena\n  Furman, Amir Rahmani, Stanis{\\l}aw \\'Swierczewski, Marek Ekielski, Anna\n  Szerling, Micha{\\l} Matuszewski, Barbara Pi\\k{e}tka",
  "authorsParsed": [
    [
      "Opala",
      "Andrzej",
      ""
    ],
    [
      "Tyszka",
      "Krzysztof",
      ""
    ],
    [
      "Kędziora",
      "Mateusz",
      ""
    ],
    [
      "Furman",
      "Magdalena",
      ""
    ],
    [
      "Rahmani",
      "Amir",
      ""
    ],
    [
      "Świerczewski",
      "Stanisław",
      ""
    ],
    [
      "Ekielski",
      "Marek",
      ""
    ],
    [
      "Szerling",
      "Anna",
      ""
    ],
    [
      "Matuszewski",
      "Michał",
      ""
    ],
    [
      "Piętka",
      "Barbara",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 14 Dec 2024 15:33:19 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734190399000,
  "abstract": "  Limitations of electronics have stimulated the search for novel\nunconventional computing platforms that enable energy-efficient and ultra-fast\ninformation processing. Among various systems, exciton-polaritons stand out as\npromising candidates for the realization of optical neuromorphic devices. This\nis due to their unique hybrid light-matter properties, resulting in strong\noptical nonlinearity and excellent transport capabilities. However, previous\nimplementations of polariton neural networks have been restricted to cryogenic\ntemperatures, limiting their practical applications. In this work, using\nnon-equillibrium Bose-Einstein condensation in a monocrystalline perovskite\nwaveguide, we demonstrate the first room-temperature exciton-polariton neural\nnetwork. Its performance is verified in various machine learning tasks,\nincluding binary classification, and object detection. Our result is a crucial\nmilestone in the development of practical applications of polariton neural\nnetworks and provides new perspectives for optical computing accelerators based\non perovskites.\n",
  "subjects": [
    "Physics/Optics",
    "Condensed Matter/Disordered Systems and Neural Networks",
    "Condensed Matter/Materials Science",
    "Condensed Matter/Quantum Gases"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "WWSG4xtKt_iIsMfdE0OjR8Lw9T4Fq_xzWJ9MtvcggDI",
  "pdfSize": "18959358"
}