{
  "id": "2412.15147",
  "title": "Performance of Variational Algorithms for Local Hamiltonian Problems on\n  Random Regular Graphs",
  "authors": "Kunal Marwaha, Adrian She, James Sud",
  "authorsParsed": [
    [
      "Marwaha",
      "Kunal",
      ""
    ],
    [
      "She",
      "Adrian",
      ""
    ],
    [
      "Sud",
      "James",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 18:27:39 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734632859000,
  "abstract": "  We design two variational algorithms to optimize specific 2-local\nHamiltonians defined on graphs. Our algorithms are inspired by the Quantum\nApproximate Optimization Algorithm. We develop formulae to analyze the energy\nachieved by these algorithms with high probability over random regular graphs\nin the infinite-size limit, using techniques from [arXiv:2110.14206]. The\ncomplexity of evaluating these formulae scales exponentially with the number of\nlayers of the algorithms, so our numerical evaluation is limited to a small\nconstant number of layers. We compare these algorithms to simple classical\napproaches and a state-of-the-art worst-case algorithm. We find that the\nsymmetry inherent to these specific variational algorithms presents a major\n\\emph{obstacle} to successfully optimizing the Quantum MaxCut (QMC) Hamiltonian\non general graphs. Nonetheless, the algorithms outperform known methods to\noptimize the EPR Hamiltonian of [arXiv:2209.02589] on random regular graphs,\nand the QMC Hamiltonian when the graphs are also bipartite. As a special case,\nwe show that with just five layers of our algorithm, we can already prepare\nstates within 1.62% error of the ground state energy for QMC on an infinite 1D\nring, corresponding to the antiferromagnetic Heisenberg spin chain.\n",
  "subjects": [
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "MuESmaRXnqwvWz08iJgq1L1Y4j-z8Fgp9-eFHfwoL7o",
  "pdfSize": "857261"
}