{
  "id": "2412.05116",
  "title": "Polarization faticons: Chiral localized structures in self-defocusing\n  Kerr resonators",
  "authors": "Erwan Lucas, Gang Xu, Pengxiang Wang, Gian-Luca Oppo, Lewis Hill,\n  Pascal Del'Haye, Bertrand Kibler, Yiqing Xu, Stuart G. Murdoch, Miro\n  Erkintalo, St\\'ephane Coen and Julien Fatome",
  "authorsParsed": [
    [
      "Lucas",
      "Erwan",
      ""
    ],
    [
      "Xu",
      "Gang",
      ""
    ],
    [
      "Wang",
      "Pengxiang",
      ""
    ],
    [
      "Oppo",
      "Gian-Luca",
      ""
    ],
    [
      "Hill",
      "Lewis",
      ""
    ],
    [
      "Del'Haye",
      "Pascal",
      ""
    ],
    [
      "Kibler",
      "Bertrand",
      ""
    ],
    [
      "Xu",
      "Yiqing",
      ""
    ],
    [
      "Murdoch",
      "Stuart G.",
      ""
    ],
    [
      "Erkintalo",
      "Miro",
      ""
    ],
    [
      "Coen",
      "Stéphane",
      ""
    ],
    [
      "Fatome",
      "Julien",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 15:17:22 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733498242000,
  "abstract": "  We report on numerical predictions and experimental observations of a novel\ntype of temporal localized dissipative structures that manifest themselves in\nthe self-defocusing regime of driven nonlinear optical resonators with two\npolarization modes. These chiral dissipative solitons, which we term\npolarization faticons, break both temporal and polarization symmetry and\nconsist of two bright lobes of opposite polarization handedness, interlocked by\na domain wall. Our study reveals that faticons are connected to a vectorial\nmodulational instability, from which they can be excited through a collapsing\ndynamic. Faticons could offer a novel pathway for frequency comb generation in\nnormal dispersion resonators. More generally, they offer new fundamental\ninsights into vectorial localized dissipative structures and could be relevant\nto other multi-component dissipative systems.\n",
  "subjects": [
    "Physics/Optics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "JIWhzG7j_7dr98OttOb9QvPf0QZf3rJcTdaGLkvXzIk",
  "pdfSize": "4766204"
}