{"id":"2412.07589","title":"DiffSensei: Bridging Multi-Modal LLMs and Diffusion Models for\n  Customized Manga Generation","authors":"Jianzong Wu, Chao Tang, Jingbo Wang, Yanhong Zeng, Xiangtai Li, Yunhai\n  Tong","authorsParsed":[["Wu","Jianzong",""],["Tang","Chao",""],["Wang","Jingbo",""],["Zeng","Yanhong",""],["Li","Xiangtai",""],["Tong","Yunhai",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 15:24:12 GMT"}],"updateDate":"2024-12-11","timestamp":1733844252000,"abstract":"  Story visualization, the task of creating visual narratives from textual\ndescriptions, has seen progress with text-to-image generation models. However,\nthese models often lack effective control over character appearances and\ninteractions, particularly in multi-character scenes. To address these\nlimitations, we propose a new task: \\textbf{customized manga generation} and\nintroduce \\textbf{DiffSensei}, an innovative framework specifically designed\nfor generating manga with dynamic multi-character control. DiffSensei\nintegrates a diffusion-based image generator with a multimodal large language\nmodel (MLLM) that acts as a text-compatible identity adapter. Our approach\nemploys masked cross-attention to seamlessly incorporate character features,\nenabling precise layout control without direct pixel transfer. Additionally,\nthe MLLM-based adapter adjusts character features to align with panel-specific\ntext cues, allowing flexible adjustments in character expressions, poses, and\nactions. We also introduce \\textbf{MangaZero}, a large-scale dataset tailored\nto this task, containing 43,264 manga pages and 427,147 annotated panels,\nsupporting the visualization of varied character interactions and movements\nacross sequential frames. Extensive experiments demonstrate that DiffSensei\noutperforms existing models, marking a significant advancement in manga\ngeneration by enabling text-adaptable character customization. The project page\nis https://jianzongwu.github.io/projects/diffsensei/.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"IoJU5yP2ehFnZ9UOYFkz9XoISpSmBxFqYKmTOZ1OIf8","pdfSize":"12932160"}