{
  "id": "2412.00057",
  "title": "Feasibility of Mental Health Triage Call Priority Prediction Using\n  Machine Learning",
  "authors": "Rajib Rana, Niall Higgins, Kazi Nazmul Haque, John Reilly, Kylie\n  Burke, Kathryn Turner, Terry Stedman",
  "authorsParsed": [
    [
      "Rana",
      "Rajib",
      ""
    ],
    [
      "Higgins",
      "Niall",
      ""
    ],
    [
      "Haque",
      "Kazi Nazmul",
      ""
    ],
    [
      "Reilly",
      "John",
      ""
    ],
    [
      "Burke",
      "Kylie",
      ""
    ],
    [
      "Turner",
      "Kathryn",
      ""
    ],
    [
      "Stedman",
      "Terry",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 25 Nov 2024 02:19:57 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1732501197000,
  "abstract": "  Ensuring accurate call prioritisation is essential for optimising the\nefficiency and responsiveness of mental health helplines. Currently, call\noperators rely entirely on the caller's statements to determine the priority of\nthe calls. It has been shown that entirely subjective assessment can lead to\nerrors. Furthermore, it is a missed opportunity not to utilise the voice\nproperties readily available during the call to aid in the evaluation.\nIncorrect prioritisation can result in delayed assistance for high-risk\nindividuals, resource misallocation, increased mental health deterioration,\nloss of trust, and potential legal consequences. It is vital to address these\nrisks to guarantee the reliability and effectiveness of mental health services.\nThis study delves into the potential of using machine learning, a branch of\nArtificial Intelligence, to estimate call priority from the callers' voices for\nusers of mental health phone helplines. After analysing 459 call records from a\nmental health helpline, we achieved a balanced accuracy of 92\\%, showing\npromise in aiding the call operators' efficiency in call handling processes and\nimproving customer satisfaction.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Audio and Speech Processing",
    "Computer Science/Sound"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "UXKYB--wWyLi3RoxG15Z8ZCI9iOKRT0IbVemK0GV0uo",
  "pdfSize": "2002386"
}