{
  "id": "2412.19441",
  "title": "Comparative Performance Analysis of Quantum Machine Learning\n  Architectures for Credit Card Fraud Detection",
  "authors": "Mansour El Alami, Nouhaila Innan, Muhammad Shafique, and Mohamed\n  Bennai",
  "authorsParsed": [
    [
      "Alami",
      "Mansour El",
      ""
    ],
    [
      "Innan",
      "Nouhaila",
      ""
    ],
    [
      "Shafique",
      "Muhammad",
      ""
    ],
    [
      "Bennai",
      "Mohamed",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 27 Dec 2024 04:17:34 GMT"
    },
    {
      "version": "v2",
      "created": "Fri, 3 Jan 2025 03:36:44 GMT"
    }
  ],
  "updateDate": "2025-01-06",
  "timestamp": 1735273054000,
  "abstract": "  As financial fraud becomes increasingly complex, effective detection methods\nare essential. Quantum Machine Learning (QML) introduces certain capabilities\nthat may enhance both accuracy and efficiency in this area. This study examines\nhow different quantum feature map and ansatz configurations affect the\nperformance of three QML-based classifiers-the Variational Quantum Classifier\n(VQC), the Sampler Quantum Neural Network (SQNN), and the Estimator Quantum\nNeural Network (EQNN)-when applied to two non-standardized financial fraud\ndatasets. Different quantum feature map and ansatz configurations are\nevaluated, revealing distinct performance patterns. The VQC consistently\ndemonstrates strong classification results, achieving an F1 score of 0.88,\nwhile the SQNN also delivers promising outcomes. In contrast, the EQNN\nstruggles to produce robust results, emphasizing the challenges presented by\nnon-standardized data. These findings highlight the importance of careful model\nconfiguration in QML-based financial fraud detection. By showing how specific\nfeature maps and ansatz choices influence predictive success, this work guides\nresearchers and practitioners in refining QML approaches for complex financial\napplications.\n",
  "subjects": [
    "Physics/Quantum Physics",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Wx1RHwPFAFmSi8r22YQlmRMlIWh0q20eAHl0mf0XiEI",
  "pdfSize": "8680298"
}