{"id":"2412.14978","title":"Spectrum-based Modality Representation Fusion Graph Convolutional\n  Network for Multimodal Recommendation","authors":"Rongqing Kenneth Ong, Andy W. H. Khong","authorsParsed":[["Ong","Rongqing Kenneth",""],["Khong","Andy W. H.",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 15:53:21 GMT"}],"updateDate":"2024-12-20","timestamp":1734623601000,"abstract":"  Incorporating multi-modal features as side information has recently become a\ntrend in recommender systems. To elucidate user-item preferences, recent\nstudies focus on fusing modalities via concatenation, element-wise sum, or\nattention mechanisms. Despite having notable success, existing approaches do\nnot account for the modality-specific noise encapsulated within each modality.\nAs a result, direct fusion of modalities will lead to the amplification of\ncross-modality noise. Moreover, the variation of noise that is unique within\neach modality results in noise alleviation and fusion being more challenging.\nIn this work, we propose a new Spectrum-based Modality Representation (SMORE)\nfusion graph recommender that aims to capture both uni-modal and fusion\npreferences while simultaneously suppressing modality noise. Specifically,\nSMORE projects the multi-modal features into the frequency domain and leverages\nthe spectral space for fusion. To reduce dynamic contamination that is unique\nto each modality, we introduce a filter to attenuate and suppress the modality\nnoise adaptively while capturing the universal modality patterns effectively.\nFurthermore, we explore the item latent structures by designing a new\nmulti-modal graph learning module to capture associative semantic correlations\nand universal fusion patterns among similar items. Finally, we formulate a new\nmodality-aware preference module, which infuses behavioral features and\nbalances the uni- and multi-modal features for precise preference modeling.\nThis empowers SMORE with the ability to infer both user modality-specific and\nfusion preferences more accurately. Experiments on three real-world datasets\nshow the efficacy of our proposed model. The source code for this work has been\nmade publicly available at https://github.com/kennethorq/SMORE.\n","subjects":["Computer Science/Information Retrieval","Computer Science/Multimedia"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"AEcXC3SIArXpHWLAbbwFmS_M4gXLD7fp2rkFt8xPsIM","pdfSize":"4751254"}