{"id":"2412.14338","title":"GREGoR: Accelerating Genomics for Rare Diseases","authors":"Moez Dawood, Ben Heavner, Marsha M. Wheeler, Rachel A. Ungar, Jonathan\n  LoTempio, Laurens Wiel, Seth Berger, Jonathan A. Bernstein, Jessica X. Chong,\n  Emmanu\\`ele C. D\\'elot, Evan E. Eichler, Richard A. Gibbs, James R. Lupski,\n  Ali Shojaie, Michael E. Talkowski, Alex H. Wagner, Chia-Lin Wei, Christopher\n  Wellington, Matthew T. Wheeler, GREGoR Partner Members, Claudia M. B.\n  Carvalho, Casey A. Gifford, Susanne May, Danny E. Miller, Heidi L. Rehm,\n  Fritz J. Sedlazeck, Eric Vilain, Anne O'Donnell-Luria, Jennifer E. Posey,\n  Lisa H. Chadwick, Michael J. Bamshad, Stephen B. Montgomery, Genomics\n  Research to Elucidate the Genetics of Rare Diseases (GREGoR) Consortium","authorsParsed":[["Dawood","Moez","","GREGoR"],["Heavner","Ben","","GREGoR"],["Wheeler","Marsha M.","","GREGoR"],["Ungar","Rachel A.","","GREGoR"],["LoTempio","Jonathan","","GREGoR"],["Wiel","Laurens","","GREGoR"],["Berger","Seth","","GREGoR"],["Bernstein","Jonathan A.","","GREGoR"],["Chong","Jessica X.","","GREGoR"],["Délot","Emmanuèle C.","","GREGoR"],["Eichler","Evan E.","","GREGoR"],["Gibbs","Richard A.","","GREGoR"],["Lupski","James R.","","GREGoR"],["Shojaie","Ali","","GREGoR"],["Talkowski","Michael E.","","GREGoR"],["Wagner","Alex H.","","GREGoR"],["Wei","Chia-Lin","","GREGoR"],["Wellington","Christopher","","GREGoR"],["Wheeler","Matthew T.","","GREGoR"],["Members","GREGoR Partner","","GREGoR"],["Carvalho","Claudia M. B.","","GREGoR"],["Gifford","Casey A.","","GREGoR"],["May","Susanne","","GREGoR"],["Miller","Danny E.","","GREGoR"],["Rehm","Heidi L.","","GREGoR"],["Sedlazeck","Fritz J.","","GREGoR"],["Vilain","Eric","","GREGoR"],["O'Donnell-Luria","Anne","","GREGoR"],["Posey","Jennifer E.","","GREGoR"],["Chadwick","Lisa H.","","GREGoR"],["Bamshad","Michael J.","","GREGoR"],["Montgomery","Stephen B.","","GREGoR"],["Diseases","Genomics Research to Elucidate the Genetics of Rare","","GREGoR"],["Consortium","",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 21:11:13 GMT"}],"updateDate":"2024-12-20","timestamp":1734556273000,"abstract":"  Rare diseases are collectively common, affecting approximately one in twenty\nindividuals worldwide. In recent years, rapid progress has been made in rare\ndisease diagnostics due to advances in DNA sequencing, development of new\ncomputational and experimental approaches to prioritize genes and genetic\nvariants, and increased global exchange of clinical and genetic data. However,\nmore than half of individuals suspected to have a rare disease lack a genetic\ndiagnosis. The Genomics Research to Elucidate the Genetics of Rare Diseases\n(GREGoR) Consortium was initiated to study thousands of challenging rare\ndisease cases and families and apply, standardize, and evaluate emerging\ngenomics technologies and analytics to accelerate their adoption in clinical\npractice. Further, all data generated, currently representing ~7500 individuals\nfrom ~3000 families, is rapidly made available to researchers worldwide via the\nGenomic Data Science Analysis, Visualization, and Informatics Lab-space (AnVIL)\nto catalyze global efforts to develop approaches for genetic diagnoses in rare\ndiseases (https://gregorconsortium.org/data). The majority of these families\nhave undergone prior clinical genetic testing but remained unsolved, with most\nbeing exome-negative. Here, we describe the collaborative research framework,\ndatasets, and discoveries comprising GREGoR that will provide foundational\nresources and substrates for the future of rare disease genomics.\n","subjects":["Quantitative Biology/Other Quantitative Biology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"J7kM7ufDyy8wVGt77lQvNReBi1yDMdfW09NY4kJtWe0","pdfSize":"2320724"}