{"id":"2412.12304","title":"The Age-Thickness Relation of the Milky Way Disk: A Tracer of Galactic\n  Merging History","authors":"Lekshmi Thulasidharan and Elena D'Onghia and Robert Benjamin and\n  Ronald Drimmel and Eloisa Poggio and Anna Queiroz","authorsParsed":[["Thulasidharan","Lekshmi",""],["D'Onghia","Elena",""],["Benjamin","Robert",""],["Drimmel","Ronald",""],["Poggio","Eloisa",""],["Queiroz","Anna",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 19:18:14 GMT"}],"updateDate":"2024-12-18","timestamp":1734376694000,"abstract":"  The prevailing model of galaxy formation proposes that galaxies like the\nMilky Way are built through a series of mergers with smaller galaxies over\ntime. However, the exact details of the Milky Way's assembly history remain\nuncertain. In this study, we show that the Milky Way's merger history is\nuniquely encoded in the vertical thickness of its stellar disk. By leveraging\nage estimates from the value-added LAMOST DR8 catalog and the StarHorse ages\nfrom SDSS-IV DR12 data, we investigate the relationship between disk thickness\nand stellar ages in the Milky Way using a sample comprising Red Giants (RG),\nRed Clump Giants (RCG), and metal-poor stars (MPS). Guided by the\nIllustrisTNG50 simulations, we show that an increase in the dispersion of the\nvertical displacement of stars in the disk traces its merger history. This\nanalysis reveals the epoch of a major merger event that assembled the Milky Way\napproximately 11.13 billion years ago, as indicated by the abrupt increase in\ndisk thickness among stars of that age, likely corresponding to the\nGaia-Sausage Enceladus (GSE) event. The data do not exclude an earlier major\nmerger, which may have occurred about 1.3 billion years after the Big Bang.\nFurthermore, the analysis suggests that the geometric thick disk of the Milky\nWay was formed around 11.13 billion years ago, followed by a transition period\nof approximately 2.6 billion years leading to the formation of the geometric\nthin disk, illustrating the galaxy's structural evolution. Additionally, we\nidentified three more recent events -- 5.20 billion, 2.02 billion, and 0.22\nbillion years ago -- potentially linked to multiple passages of the Sagittarius\ndwarf galaxy. Our study not only elucidates the complex mass assembly history\nof the Milky Way and highlights its past interactions but also introduces a\nrefined method for examining the merger histories of external galaxies.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"YNKNIM5hKyTvGPfwZ0-sM3yWYCO0PhN_B_7ZAV-Zt_I","pdfSize":"19645980"}