{"id":"2412.20813","title":"Level crossing instabilities in inviscid isothermal compressible Couette\n  flow","authors":"Govind S. Krishnaswami, Sonakshi Sachdev and Pritish Sinha","authorsParsed":[["Krishnaswami","Govind S.",""],["Sachdev","Sonakshi",""],["Sinha","Pritish",""]],"versions":[{"version":"v1","created":"Mon, 30 Dec 2024 09:09:35 GMT"}],"updateDate":"2024-12-31","timestamp":1735549775000,"abstract":"  We study the linear stability of inviscid steady parallel flow of an ideal\ngas in a channel of finite width. Compressible isothermal two-dimensional\nmonochromatic perturbations are considered. The eigenvalue problem governing\ndensity and velocity perturbations is a compressible version of Rayleigh's\nequation and involves two parameters: a flow Mach number $M$ and the\nperturbation wavenumber $k$. For an odd background velocity profile, there is a\n$\\mathbb{Z}_2 \\times \\mathbb{Z}_2$ symmetry and growth rates $\\gamma$ come in\nsymmetrically placed 4-tuples in the complex eigenplane. Specializing to\nuniform background vorticity Couette flow, we find an infinite tower of\nnoninflectional eigenmodes and derive stability theorems and bounds on growth\nrates. We show that eigenmodes are neutrally stable for small $k$ and small $M$\nbut that they otherwise display an infinite sequence of stability transitions\nwith increasing $k$ or $M$. Using a search algorithm based on the Fredholm\nalternative, we find that the transitions are associated to level crossings\nbetween neighboring eigenmodes. Repeated level crossings result in windows of\ninstability. For a given eigenmode, they are arranged in a zebra-like striped\npattern on the $k$-$M$ plane. A canonical square-root power law form for\n$\\gamma(k,M)$ in the vicinity of a stability transition is identified. In\naddition to the discrete spectrum, we find a continuous spectrum of eigenmodes\nthat are always neutrally stable but fail to be smooth across critical layers.\n","subjects":["Physics/Fluid Dynamics","Physics/Mathematical Physics","Mathematics/Mathematical Physics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"JgZSGKljvlXREfRDgyjwx7157CUVenD3yqd07_G4tWc","pdfSize":"1256617"}