{
  "id": "2412.08121",
  "title": "DTAA: A Detect, Track and Avoid Architecture for navigation in spaces\n  with Multiple Velocity Objects",
  "authors": "Samuel Nordstr\\\"om, Bj\\\"orn Lindquist, George Nikolakopoulos",
  "authorsParsed": [
    [
      "Nordström",
      "Samuel",
      ""
    ],
    [
      "Lindquist",
      "Björn",
      ""
    ],
    [
      "Nikolakopoulos",
      "George",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 06:14:50 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733897690000,
  "abstract": "  Proactive collision avoidance measures are imperative in environments where\nhumans and robots coexist. Moreover, the introduction of high quality legged\nrobots into workplaces highlighted the crucial role of a robust, fully\nautonomous safety solution for robots to be viable in shared spaces or in\nco-existence with humans. This article establishes for the first time ever an\ninnovative Detect-Track-and-Avoid Architecture (DTAA) to enhance safety and\noverall mission performance. The proposed novel architectyre has the merit ot\nintegrating object detection using YOLOv8, utilizing Ultralytics embedded\nobject tracking, and state estimation of tracked objects through Kalman\nfilters. Moreover, a novel heuristic clustering is employed to facilitate\nactive avoidance of multiple closely positioned objects with similar\nvelocities, creating sets of unsafe spaces for the Nonlinear Model Predictive\nController (NMPC) to navigate around. The NMPC identifies the most hazardous\nunsafe space, considering not only their current positions but also their\npredicted future locations. In the sequel, the NMPC calculates maneuvers to\nguide the robot along a path planned by D$^{*}_{+}$ towards its intended\ndestination, while maintaining a safe distance to all identified obstacles. The\nefficacy of the novelly suggested DTAA framework is being validated by\nReal-life experiments featuring a Boston Dynamics Spot robot that demonstrates\nthe robot's capability to consistently maintain a safe distance from humans in\ndynamic subterranean, urban indoor, and outdoor environments.\n",
  "subjects": [
    "Computer Science/Robotics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "7usSytZkmmNNfHSF74Tw4q5v2rvTZGfMy1IH_5YRv44",
  "pdfSize": "10619580"
}