{
  "id": "2412.06357",
  "title": "Mechanisms Behind the Aschenbach Effect in Non-Rotating Black Hole\n  Spacetime",
  "authors": "Mohammad Ali S. Afshar, Jafar Sadeghi",
  "authorsParsed": [
    [
      "Afshar",
      "Mohammad Ali S.",
      ""
    ],
    [
      "Sadeghi",
      "Jafar",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 10:19:23 GMT"
    },
    {
      "version": "v2",
      "created": "Wed, 12 Feb 2025 11:04:19 GMT"
    }
  ],
  "updateDate": "2025-02-13",
  "timestamp": 1733739563000,
  "abstract": "  General relativity predicts that a rotating black hole drags the spacetime\ndue to its spin. This effect can influence the motion of nearby objects,\ncausing them to either fall into the black hole or orbit around it. In\nclassical Newtonian mechanics, as the radius of the orbit increases, the\nangular velocity of an object in a stable circular orbit decreases. However,\nAschenbach discovered that for a hypothetical non-rotating observer, contrary\nto usual behavior, the angular velocity increases with radius in certain\nregions. Although the possibility of observing rare and less probable\nrotational behaviors in a rotating structure is not unlikely or impossible.\nHowever, observing such behaviors in a static structure is not only intriguing\nbut also thought-provoking, as it raises questions about the factors that might\nplay a role in such phenomena. In seeking answers to this question, various\nstatic models, particularly in the context of nonlinear fields, were examined,\nwith some results presented as examples in the article. Among the models\nstudied, the model of Magnetic Black Holes in 4D Einstein Gauss Bonnet Massive\nGravity Coupled to Nonlinear Electrodynamics (M-EGB-Massive) appears to be a\ncandidate for this phenomenon. In the analysis section, we will discuss the\ncommonalities of this model with previous models that have exhibited this\nphenomenon and examine the cause of this phenomenon. Finally, we will state\nwhether this phenomenon is observable in other black holes and, if not, why\n",
  "subjects": [
    "Physics/General Relativity and Quantum Cosmology",
    "Physics/High Energy Physics - Theory"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Wb5t_wj7rcAcW2KOMBi97WvOM0wpq-jWCVd8mboZP8Y",
  "pdfSize": "635462"
}