{
  "id": "2412.07521",
  "title": "Knowledge-based model validation using a custom metric",
  "authors": "Nicola Henkelmann, Stephan Rhode, Johannes von Keler",
  "authorsParsed": [
    [
      "Henkelmann",
      "Nicola",
      ""
    ],
    [
      "Rhode",
      "Stephan",
      ""
    ],
    [
      "von Keler",
      "Johannes",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 13:59:05 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733839145000,
  "abstract": "  Vehicle models have a long history of research and as of today are able to\nmodel the involved physics in a reasonable manner. However, each new vehicle\nhas its new characteristics or parameters. The identification of these is the\nmain task of an engineer. To validate whether the correct parameter set has\nbeen chosen is a tedious task and often can only be performed by experts.\nMetrics known commonly used in literature are able to compare different results\nunder certain aspects. However, they fail to answer the question: Are the\nmodels accurate enough? In this article, we propose the usage of a custom\nmetric trained on the knowledge of experts to tackle this problem. Our approach\ninvolves three main steps: first, the formalized collection of subject matter\nexperts' opinion on the question: Having seen the measurement and simulation\ntime series in comparison, is the model quality sufficient? From this step, we\nobtain a data set that is able to quantify the sufficiency of a simulation\nresult based on a comparison to corresponding experimental data. In a second\nstep, we compute common model metrics on the measurement and simulation time\nseries and use these model metrics as features to a regression model. Third, we\nfit a regression model to the experts' opinions. This regression model, i.e.,\nour custom metric, can than predict the sufficiency of a new simulation result\nand gives a confidence on this prediction.\n",
  "subjects": [
    "Computer Science/Computational Engineering, Finance, and Science"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "yhmqpBrTgI4r41bGP2-Ykk7OIgXwS2FCEWR4ukzMl5o",
  "pdfSize": "2284937"
}