{"id":"2412.19154","title":"Evolutionary de-homogenization using a generative model for optimizing\n  solid-porous infill structures considering the stress concentration issue","authors":"Shuzhi Xu, Hiroki Kawabe, Kentaro Yaji","authorsParsed":[["Xu","Shuzhi",""],["Kawabe","Hiroki",""],["Yaji","Kentaro",""]],"versions":[{"version":"v1","created":"Thu, 26 Dec 2024 10:18:16 GMT"}],"updateDate":"2024-12-30","timestamp":1735208296000,"abstract":"  The design of porous infill structures presents significant challenges due to\ntheir complex geometric configurations, such as the accurate representation of\ngeometric boundaries and the control of localized maximum stress. In current\nmainstream design methods, such as topology optimization, the analysis is often\nperformed using pixel or voxel-based element approximations. These\napproximations, constrained by the optimization framework, result in\nsubstantial geometric discrepancies between the analysis model and the final\nphysical model. Such discrepancies can severely impact structural performance,\nparticularly for localized properties like stress response, where accurate\ngeometry is critical to mitigating stress concentration. To address these\nchallenges, we propose evolutionary de-homogenization, which is a design\nframework based on the integration of de-homogenization and data-driven\nmultifidelity optimization. This framework facilitates the hybrid solid-porous\ninfill design by bridging the gap between low-fidelity analysis and\nhigh-fidelity physical realizations, ensuring both geometric accuracy and\nenhanced structural performance. The low-fidelity level utilizes commonly used\ndensity control variables, while the high-fidelity level involves stress\nanalysis based on structures with precise geometric representations. By\nemploying a de-homogenization-based mapping method, a side-by-side\ncorrespondence between low-fidelity and high-fidelity results is established.\nThe low-fidelity control variables are iteratively adjusted to optimize the\nhigh-fidelity results by integrating deep generative model with multi-objective\nevolutionary algorithm. Finally, numerical experiments demonstrate the\neffectiveness of the proposed method.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8NgzF7-7CV-Fuc3ZbWdQzA7G3XSChx6_7lm5mPMd-kE","pdfSize":"11716087"}