{
  "id": "2412.13272",
  "title": "Coherent Structures Governing Transport at Turbulent Interfaces",
  "authors": "Ali R Khojasteh, Lyke K van Dalen, Coen Been, Jerry Westerweel, Willem\n  van de Water",
  "authorsParsed": [
    [
      "Khojasteh",
      "Ali R",
      ""
    ],
    [
      "van Dalen",
      "Lyke K",
      ""
    ],
    [
      "Been",
      "Coen",
      ""
    ],
    [
      "Westerweel",
      "Jerry",
      ""
    ],
    [
      "van de Water",
      "Willem",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 19:05:52 GMT"
    },
    {
      "version": "v2",
      "created": "Thu, 19 Dec 2024 08:49:33 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734462352000,
  "abstract": "  In an experiment on a turbulent jet, we detect interfacial turbulent layers\nin a frame that moves, on average, along with the \\tnti. This significantly\nprolongs the observation time of scalar and velocity structures and enables the\nmeasurement of two types of Lagrangian coherent structures. One structure, the\nfinite-time Lyapunov field (FTLE), quantifies advective transport barriers of\nfluid parcels while the other structure highlights barriers of diffusive\nmomentum transport. These two complementary structures depend on large-scale\nand small-scale motion and are therefore associated with the growth of the\nturbulent region through engulfment or nibbling, respectively. We detect the\n\\tnti\\ from cluster analysis, where we divide the measured scalar field into\nfour clusters. Not only the \\tnti\\ can be found this way, but also the next,\ninternal, turbulent-turbulent interface. Conditional averages show that these\ninterfaces are correlated with barriers of advective and diffusive transport\nwhen the Lagrangian integration time is smaller than the integral time scale.\nDiffusive structures decorrelate faster since they have a smaller timescale.\nConditional averages of these structures at internal turbulent-turbulent\ninterfaces show the same pattern with a more pronounced jump at the interface\nindicative of a shear layer. This is quite an unexpected outcome, as the\ninternal interface is now defined not by the presence or absence of vorticity,\nbut by conditional vorticity corresponding to two uniform concentration zones.\nThe long-time diffusive momentum flux along Lagrangian paths represents the\ngrowth of the turbulent flow into the irrotational domain, a direct\ndemonstration of nibbling. The diffusive flux parallel to the \\tnti\\ appears to\nbe concentrated in a diffusive superlayer whose width is comparable with the\nTaylor microscale, which is relatively invariant in time.\n",
  "subjects": [
    "Physics/Fluid Dynamics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "iw3i2b1cWpIuBuS-ghABabL3fv-Dg4VkDe9uq2HDfQY",
  "pdfSize": "19609959"
}