{
  "id": "2412.16306",
  "title": "Dependence of convective precipitation extremes on near-surface relative\n  humidity",
  "authors": "Robert J. van der Drift and Paul A. O'Gorman",
  "authorsParsed": [
    [
      "van der Drift",
      "Robert J.",
      ""
    ],
    [
      "O'Gorman",
      "Paul A.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 19:40:24 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734723624000,
  "abstract": "  Precipitation extremes produced by convection have been found to intensify\nwith near-surface temperatures at a Clausius-Clapeyron rate of $6$ to $7\\%$\nK$^{-1}$ in simulations of radiative-convective equilibrium (RCE). However,\nthese idealized simulations are typically performed over an ocean surface with\na high near-surface relative humidity (RH) that stays roughly constant with\nwarming. Over land, near-surface RH is lower than over ocean and is projected\nto decrease by global climate models. Here, we investigate the dependence of\nprecipitation extremes on near-surface RH in convection-resolving simulations\nof RCE. We reduce near-surface RH by increasing surface evaporative resistance\nwhile holding free-tropospheric temperatures fixed by increasing surface\ntemperature. This ``top-down'' approach produces an RCE state with a deeper,\ndrier boundary layer, which weakens convective precipitation extremes in three\ndistinct ways. First, the lifted condensation level is higher, leading to a\nsmall thermodynamic weakening of precipitation extremes. Second, the higher\nlifted condensation level also reduces positive buoyancy in the lower\ntroposphere, leading to a dynamic weakening of precipitation extremes. Third,\nprecipitation re-evaporates more readily when falling through a deeper, drier\nboundary layer, leading to a substantial decrease in precipitation efficiency.\nThese three effects all follow from changes in near-surface relative humidity\nand are physically distinct from the mechanism that underpins the\nClausius-Clapeyron scaling rate. Overall, our results suggest that changes in\nrelative humidity must be taken into account when seeking to understand and\npredict changes in convective precipitation extremes over land.\n",
  "subjects": [
    "Physics/Atmospheric and Oceanic Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "QsFAqppmGZaV1_NsEfg7_xI4XLgagM2_Khyd_9y9LKo",
  "pdfSize": "653141"
}