{
  "id": "2412.14131",
  "title": "Re-visiting the intracellular pathway of transferrin on board of a\n  mathematical simulation",
  "authors": "Franco Nieto and Luis S. Mayorga",
  "authorsParsed": [
    [
      "Nieto",
      "Franco",
      ""
    ],
    [
      "Mayorga",
      "Luis S.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 18:20:47 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734546047000,
  "abstract": "  Modeling and simulation are transforming all fields of biology. Tools like\nAlphaFold have revolutionized structural biology, while molecular dynamics\nsimulations provide invaluable insights into the behavior of macromolecules in\nsolution or on membranes. In contrast, we lack effective tools to represent the\ndynamic behavior of the endomembrane system. Static diagrams that connect\norganelles with arrows are used to depict transport across space and time but\nfail to specify the underlying mechanisms. This static representation obscures\nthe dynamism of intracellular traffic, freezing it in an immobilized framework.\nThe intracellular transport of transferrin, a key process for cellular iron\ndelivery, is among the best-characterized trafficking pathways. In this\ncommentary, we revisit this process using a mathematical simulation of the\nendomembrane system. Our model reproduces many experimental observations and\nhighlights the strong contrast between dynamic simulations and static\nillustrations. This work underscores the urgent need for a consensus-based\nminimal functional working model for the endomembrane system and emphasizes the\nimportance of generating more quantitative experimental data -- including\nprecise measurements of organelle size, volume, and transport kinetics --\npractices that were more common among cell biologists in past decades.\n",
  "subjects": [
    "Quantitative Biology/Subcellular Processes"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "q-j0xbicFKdam0la_e4b5r7A1WdLJmJ-BQ4V5W52i-U",
  "pdfSize": "1834885"
}