{"id":"2412.08800","title":"A Hybrid Framework for Statistical Feature Selection and Image-Based\n  Noise-Defect Detection","authors":"Alejandro Garnung Men\\'endez","authorsParsed":[["Menéndez","Alejandro Garnung",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 22:12:21 GMT"}],"updateDate":"2024-12-13","timestamp":1733955141000,"abstract":"  In industrial imaging, accurately detecting and distinguishing surface\ndefects from noise is critical and challenging, particularly in complex\nenvironments with noisy data. This paper presents a hybrid framework that\nintegrates both statistical feature selection and classification techniques to\nimprove defect detection accuracy while minimizing false positives. The\nmotivation of the system is based on the generation of scalar scores that\nrepresent the likelihood that a region of interest (ROI) is classified as a\ndefect or noise. We present around 55 distinguished features that are extracted\nfrom industrial images, which are then analyzed using statistical methods such\nas Fisher separation, chi-squared test, and variance analysis. These techniques\nidentify the most discriminative features, focusing on maximizing the\nseparation between true defects and noise. Fisher's criterion ensures robust,\nreal-time performance for automated systems. This statistical framework opens\nup multiple avenues for application, functioning as a standalone assessment\nmodule or as an a posteriori enhancement to machine learning classifiers. The\nframework can be implemented as a black-box module that applies to existing\nclassifiers, providing an adaptable layer of quality control and optimizing\npredictions by leveraging intuitive feature extraction strategies, emphasizing\nthe rationale behind feature significance and the statistical rigor of feature\nselection. By integrating these methods with flexible machine learning\napplications, the proposed framework improves detection accuracy and reduces\nfalse positives and misclassifications, especially in complex, noisy\nenvironments.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"W5KdUl14ISNF583DVBxEN0Mi__XHJvhq5w8JRfi7yP0","pdfSize":"14387108"}