{
  "id": "2412.03143",
  "title": "Low-Frequency Turnover Star Forming Galaxies I: Radio Continuum\n  Observations and Global Properties",
  "authors": "J. A. Grundy, N. Seymour, O. I. Wong, K. Lee-Waddell, T. J. Galvin, M.\n  Cluver",
  "authorsParsed": [
    [
      "Grundy",
      "J. A.",
      ""
    ],
    [
      "Seymour",
      "N.",
      ""
    ],
    [
      "Wong",
      "O. I.",
      ""
    ],
    [
      "Lee-Waddell",
      "K.",
      ""
    ],
    [
      "Galvin",
      "T. J.",
      ""
    ],
    [
      "Cluver",
      "M.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 09:08:19 GMT"
    }
  ],
  "updateDate": "2024-12-05",
  "timestamp": 1733303299000,
  "abstract": "  The broad-band radio spectral energy distribution (SED) of star-forming\ngalaxies (SFGs) contains a wealth of complex physics. We aim to determine the\nphysical emission and loss processes causing radio SED curvature and steepening\nto see which observed global astrophysical properties are correlated with radio\nSED complexity. We have acquired radio continuum data between 70 MHz and 17 GHz\nfor a sample of 19 southern local (z < 0.04) SFGs. Of this sample 11 are\nselected to contain low-frequency (< 300 MHz) turnovers (LFTOs) in their SEDs\nand eight are control galaxies with similar global properties. We model the\nradio SEDs for our sample using a Bayesian framework whereby radio emission\n(synchrotron and free-free) and absorption or loss processes are included\nmodularly. We find that without the inclusion of higher frequency data, single\nsynchrotron power-law based models are always preferred for our sample;\nhowever, additional processes including free-free absorption (FFA) and\nsynchrotron losses are often required to accurately model radio SED complexity\nin SFGs. The fitted synchrotron spectral indices range from -0.45 to -1.07 and\nare strongly anticorrelated with stellar mass suggesting that synchrotron\nlosses are the dominant mechanism acting to steepen the spectral index in\nlarger nearby SFGs. We find that LFTOs in the radio SED are independent from\nthe inclination. The merging systems in our SFG sample have elevated specific\nstar formation rates and flatter fitted spectral indices with unconstrained\nLFTOs. Lastly, we find no significant separation in global properties between\nSFGs with or without modelled LFTOs. Overall LFTOs are likely caused by a\ncombination of FFA and ionisation losses in individual recent starburst regions\nwith specific orientations and interstellar medium properties that, when\naveraged over the entire galaxy, do not correlate with global astrophysical\nproperties.\n",
  "subjects": [
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Wi89KwAqmZ6egZ3O0MGR1-VTEjN_QC16x8jZ0VfIoNs",
  "pdfSize": "18197284"
}