{
  "id": "2412.13776",
  "title": "Aggregative games with bilevel structures: Distributed algorithms and\n  convergence analysis",
  "authors": "Kaihong Lu, Huanshui Zhang, Long Wang",
  "authorsParsed": [
    [
      "Lu",
      "Kaihong",
      ""
    ],
    [
      "Zhang",
      "Huanshui",
      ""
    ],
    [
      "Wang",
      "Long",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 12:13:37 GMT"
    },
    {
      "version": "v2",
      "created": "Fri, 20 Dec 2024 11:48:25 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734524017000,
  "abstract": "  In this paper, the problem of distributively searching the Stackelberg\nequilibria of aggregative games with bilevel structures is studied. Different\nfrom the traditional aggregative games, here the aggregation is determined by\nthe minimizer of the objective function in the inner level, which depends on\nplayers' actions in the outer level. Moreover, the global objective function in\nthe inner level is formed by the sum of some local bifunctions, each of which\nis strongly convex with respect to the second argument and is only available to\na specific player. To handle this problem, first, we propose a second order\ngradient-based distributed algorithm, where the Hessain matrices associated\nwith the objective functions in the inner level is involved. By the algorithm,\nplayers update their actions in the outer level while cooperatively minimizing\nthe sum of the bifunctions in the inner level to estimate the aggregation by\ncommunicating with their neighbors via a connected graph. Under mild\nassumptions on the graph and cost functions, we prove that the actions of\nplayers and the estimate on the aggregation asymptotically converge to the\nStackelberg equilibrium. Then, for the case where the Hessain matrices\nassociated with the objective functions in the inner level are not available,\nwe propose a first order gradient-based distributed algorithm, where a\ndistributed two-point estimate strategy is developed to estimate the gradients\nof cost functions in the outer level. Under the same conditions, we prove that\nthe convergence errors of players' actions and the estimate on the aggregation\nto the Stackelberg equilibrium are linear with respect to the estimate\nparameters. Finally, simulations are provided to demonstrate the effectiveness\nof our theoretical results.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Systems and Control",
    "Computer Science/Systems and Control"
  ],
  "license": "http://creativecommons.org/publicdomain/zero/1.0/",
  "blobId": "haKGxCd3XYgewRwv5eULQjxBl91OYoQEwId9UBHerRE",
  "pdfSize": "883529"
}