{"id":"2412.15409","title":"Perturbative study of wave function evolution from source to detection\n  of a single particle and the measurement","authors":"Li Hua Yu","authorsParsed":[["Yu","Li Hua",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 21:30:24 GMT"},{"version":"v2","created":"Wed, 1 Jan 2025 15:21:37 GMT"},{"version":"v3","created":"Sat, 1 Feb 2025 15:48:27 GMT"},{"version":"v4","created":"Mon, 10 Feb 2025 15:26:28 GMT"}],"updateDate":"2025-02-11","timestamp":1734643824000,"abstract":"  We analyze the evolution of a particle wave function when it propagates\nthrough free space in the longitudinal z-direction from a thin entrance slit to\na detector behind a thin exit slit parallel to the horizontal y-axis. We\nconsider an extra aperture slit between the two slits to probe the evolution of\nthe wave function and close the aperture slit starting from wide open until the\ndetection counting rate in a repeated experiment drops to half. When all the\nslits are long and thin, the 1D Schroedinger equation gives the wave function\nevolution until the final detection. The width of the aperture slit in the\nvertical x-direction depends on the z-position of the slit providing an\napproximate description of the wave function evolution. The width of the\nfunction characterizing this dependence starts from the entrance slit. It grows\nwider until it reaches a maximum and then shrinks narrower and finally\ncollapses into the exit slit where the particle is detected. Thus the envelope\nof this function has a spindle shape with its pointed ends at the two slits.\nHence it is very different from the well-known wave function of the\nSchroedinger equation with the initial condition at the entrance slit, which is\nnarrow only at the beginning, then grows wider until it reaches the exit slit,\nwhere it is much larger than the slit width. However, the phase information is\nlost because the aperture slit distorts the wave function. To keep the phase\ninformation, we replace the aperture slit with a thin pin (parallel to the\ny-axis) that blocks the wave function. We then study its perturbative effect on\nthe counting rate of the detector. This analysis provides a function to probe\nthe process of the wave function collapse right before the detection. We show\nthis function is real-valued, with amplitude and phase information, and is\nclosely related to the wave function.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"sWuunNoxt-HFRUJzT9NTx04O-tYjKonBtDsOLGpCX4M","pdfSize":"2037780"}