{
  "id": "2412.11033",
  "title": "AURORA: Automated Unleash of 3D Room Outlines for VR Applications",
  "authors": "Huijun Han, Yongqing Liang, Yuanlong Zhou, Wenping Wang, Edgar J.\n  Rojas-Munoz and Xin Li",
  "authorsParsed": [
    [
      "Han",
      "Huijun",
      ""
    ],
    [
      "Liang",
      "Yongqing",
      ""
    ],
    [
      "Zhou",
      "Yuanlong",
      ""
    ],
    [
      "Wang",
      "Wenping",
      ""
    ],
    [
      "Rojas-Munoz",
      "Edgar J.",
      ""
    ],
    [
      "Li",
      "Xin",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 15 Dec 2024 03:06:22 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734231982000,
  "abstract": "  Creating realistic VR experiences is challenging due to the labor-intensive\nprocess of accurately replicating real-world details into virtual scenes,\nhighlighting the need for automated methods that maintain spatial accuracy and\nprovide design flexibility. In this paper, we propose AURORA, a novel method\nthat leverages RGB-D images to automatically generate both purely virtual\nreality (VR) scenes and VR scenes combined with real-world elements. This\napproach can benefit designers by streamlining the process of converting\nreal-world details into virtual scenes. AURORA integrates advanced techniques\nin image processing, segmentation, and 3D reconstruction to efficiently create\nrealistic and detailed interior designs from real-world environments. The\ndesign of this integration ensures optimal performance and precision,\naddressing key challenges in automated indoor design generation by uniquely\ncombining and leveraging the strengths of foundation models. We demonstrate the\neffectiveness of our approach through experiments, both on self-captured data\nand public datasets, showcasing its potential to enhance virtual reality (VR)\napplications by providing interior designs that conform to real-world\npositioning.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Xj4z74ra5IWQCuF-wDxJdaWu3Xe8ox4bWd1QIL3rzhM",
  "pdfSize": "2441271"
}