{
  "id": "2412.14432",
  "title": "IntroStyle: Training-Free Introspective Style Attribution using\n  Diffusion Features",
  "authors": "Anand Kumar, Jiteng Mu and Nuno Vasconcelos",
  "authorsParsed": [
    [
      "Kumar",
      "Anand",
      ""
    ],
    [
      "Mu",
      "Jiteng",
      ""
    ],
    [
      "Vasconcelos",
      "Nuno",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 01:21:23 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734571283000,
  "abstract": "  Text-to-image (T2I) models have gained widespread adoption among content\ncreators and the general public. However, this has sparked significant concerns\nregarding data privacy and copyright infringement among artists. Consequently,\nthere is an increasing demand for T2I models to incorporate mechanisms that\nprevent the generation of specific artistic styles, thereby safeguarding\nintellectual property rights. Existing methods for style extraction typically\nnecessitate the collection of custom datasets and the training of specialized\nmodels. This, however, is resource-intensive, time-consuming, and often\nimpractical for real-time applications. Moreover, it may not adequately address\nthe dynamic nature of artistic styles and the rapidly evolving landscape of\ndigital art. We present a novel, training-free framework to solve the style\nattribution problem, using the features produced by a diffusion model alone,\nwithout any external modules or retraining. This is denoted as introspective\nstyle attribution (IntroStyle) and demonstrates superior performance to\nstate-of-the-art models for style retrieval. We also introduce a synthetic\ndataset of Style Hacks (SHacks) to isolate artistic style and evaluate\nfine-grained style attribution performance.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Electrical Engineering and Systems Science/Image and Video Processing"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "wpcpMD3GwDpy33jbPvb3kMP-_lNO7j-XvoF3uSo6MaE",
  "pdfSize": "32406493"
}