{"id":"2412.09761","title":"Targeting Cholangiocarcinoma Cells By Cold Piezoelectric Plasmas: In\n  Vitro Efficacy And Cellular Mechanisms","authors":"Manon Soulier, Bouchra Lekbaby, Imane Houari, Henri Decauchy, Allan\n  Pavy, Alexia Coumes, Romain Morichon, Thierry Dufour, Laura Fouassier","authorsParsed":[["Soulier","Manon",""],["Lekbaby","Bouchra",""],["Houari","Imane",""],["Decauchy","Henri",""],["Pavy","Allan",""],["Coumes","Alexia",""],["Morichon","Romain",""],["Dufour","Thierry",""],["Fouassier","Laura",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 23:41:59 GMT"}],"updateDate":"2024-12-16","timestamp":1734046919000,"abstract":"  Cold piezoelectric plasma (CPP) is a novel approach in cancer therapy,\nenabling the development of portable treatment devices capable of triggering\ncancer cell death. While its effectiveness remains underexplored, this research\nfocuses on its application against cholangiocarcinoma (CCA), an aggressive\ncancer of the biliary tract. A CPP device is utilized to generate either a\ncorona discharge (Pz-CD) or a dielectric barrier discharge (Pz-DBD) for in\nvitro experiments. Notably, Pz-CD can deliver more power than Pz-DBD, although\nboth sources produce significant levels of reactive species in plasma and\nliquid phases. This work shows that CPP causes a gradient increase in medium\ntemperature from the center towards the edges of the culture well, especially\nfor longer treatment times. Although Pz-CD heats more significantly, it cools\nquickly after plasma extinction. When applied to human CCA cells, CPP shows\nimmediate and long-term effects, more localized for Pz-CD, while more uniform\nfor Pz-DBD. Immediate effects result also in actin cytoskeleton remodeling\nwithout alteration of the cell membrane permeability. Long-term effects of CPP,\nalthough the antioxidant system is engaged, include activation of the DNA\ndamage response pathway leading to cell death. In conclusion, CPP should be\nrecognized as a promising antitumor therapy.\n","subjects":["Physics/Plasma Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"qii3oodgo6QowpW8dy4SAX-1sSewAyUcGz2ORaTyWWk","pdfSize":"2771681"}