{
  "id": "2412.09541",
  "title": "Kinetic simulations of the Kruskal-Schwarzchild instability in\n  accelerating striped outflows I: Dynamics and energy dissipation",
  "authors": "William Groger, Hayk Hakobyan, Lorenzo Sironi",
  "authorsParsed": [
    [
      "Groger",
      "William",
      ""
    ],
    [
      "Hakobyan",
      "Hayk",
      ""
    ],
    [
      "Sironi",
      "Lorenzo",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 18:32:11 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1734028331000,
  "abstract": "  Astrophysical relativistic outflows are launched as Poynting-flux-dominated,\nyet the mechanism governing efficient magnetic dissipation, which powers the\nobserved emission, is still poorly understood. We study magnetic energy\ndissipation in relativistic \"striped\" jets, which host current sheets\nseparating magnetically dominated regions with opposite field polarity. The\neffective gravity force $g$ in the rest frame of accelerating jets drives the\nKruskal-Schwarzschild instability (KSI), a magnetic analogue of the\nRayleigh-Taylor instability. By means of 2D and 3D particle-in-cell\nsimulations, we study the linear and non-linear evolution of the KSI. The\nlinear stage is well described by linear stability analysis. The non-linear\nstages of the KSI generate thin (skin-depth-thick) current layers, with length\ncomparable to the dominant KSI wavelength. There, the relativistic drift-kink\nmode and the tearing mode drive efficient magnetic dissipation. The dissipation\nrate can be cast as an increase in the effective width $\\Delta_{\\rm eff}$ of\nthe dissipative region, which follows $d\\Delta_{\\rm eff}/dt\\simeq 0.05\n\\sqrt{\\Delta_{\\rm eff}\\,g}$. Our results have important implications for the\nlocation of the dissipation region in gamma-ray burst and AGN jets.\n",
  "subjects": [
    "Astrophysics/High Energy Astrophysical Phenomena"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "lvJUQ2WxNiajqMHIjFpveCeFteyM3oNBVRSSPldLHHk",
  "pdfSize": "17275835"
}