{"id":"2412.06118","title":"Microstructural evolution of Carrara marble during semi-brittle\n  deformation","authors":"Tongzhang Qu, Nicolas Brantut, David Wallis, Christopher Harbord","authorsParsed":[["Qu","Tongzhang",""],["Brantut","Nicolas",""],["Wallis","David",""],["Harbord","Christopher",""]],"versions":[{"version":"v1","created":"Mon, 9 Dec 2024 00:39:58 GMT"}],"updateDate":"2024-12-10","timestamp":1733704798000,"abstract":"  Fifteen marble samples were subjected to semi-brittle deformation through\ntriaxial compression experiments, reaching axial strains of 0.5%, 1.0%, 2.0%,\n4.0%, or 7.5% at temperatures of 20C, 200C, or 350C, under a confining pressure\nof 400 MPa. Deformation twins, lattice curvature, and intragranular\nmicrofractures in the samples were quantitatively characterised using\nforescattered electron images and electron backscatter diffraction.\nMicrostructural analyses revealed that twins accommodate most of the shortening\nduring the first 2% strain, whereas lattice curvature associated with\ngeometrically necessary dislocations predominantly develops in the later\nstages. Intragranular fracture intensity exhibits an almost linear correlation\nwith strain during the first 2% strain but increases more slowly thereafter.\nThe mechanical data indicate a strong temperature dependence of yield stress,\nconsistent with the temperature dependence of the critical resolved shear\nstress for dislocation glide. The subsequent strain hardening is likely caused\nby progressively increasing intensity of interactions among dislocations and\nbetween dislocations and twin boundaries. Based on the microstructural data and\ninterpreted hardening mechanisms, we propose a phenomenological model, with\nmicrostructural state variables, for semi-brittle deformation at our\nexperimental conditions as a step towards development of a microphysical\nconstitutive model of semi-brittle deformation.\n","subjects":["Physics/Geophysics","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"VMaYYpuOIe711kI4ombFtznYMCkRVRfIqAwA1j_bso8","pdfSize":"40219992"}