{
  "id": "2412.01754",
  "title": "Efficient Compression of Sparse Accelerator Data Using Implicit Neural\n  Representations and Importance Sampling",
  "authors": "Xihaier Luo, Samuel Lurvey, Yi Huang, Yihui Ren, Jin Huang, Byung-Jun\n  Yoon",
  "authorsParsed": [
    [
      "Luo",
      "Xihaier",
      ""
    ],
    [
      "Lurvey",
      "Samuel",
      ""
    ],
    [
      "Huang",
      "Yi",
      ""
    ],
    [
      "Ren",
      "Yihui",
      ""
    ],
    [
      "Huang",
      "Jin",
      ""
    ],
    [
      "Yoon",
      "Byung-Jun",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 17:50:49 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733161849000,
  "abstract": "  High-energy, large-scale particle colliders in nuclear and high-energy\nphysics generate data at extraordinary rates, reaching up to $1$ terabyte and\nseveral petabytes per second, respectively. The development of real-time,\nhigh-throughput data compression algorithms capable of reducing this data to\nmanageable sizes for permanent storage is of paramount importance. A unique\ncharacteristic of the tracking detector data is the extreme sparsity of\nparticle trajectories in space, with an occupancy rate ranging from\napproximately $10^{-6}$ to $10\\%$. Furthermore, for downstream tasks, a\ncontinuous representation of this data is often more useful than a voxel-based,\ndiscrete representation due to the inherently continuous nature of the signals\ninvolved. To address these challenges, we propose a novel approach using\nimplicit neural representations for data learning and compression. We also\nintroduce an importance sampling technique to accelerate the network training\nprocess. Our method is competitive with traditional compression algorithms,\nsuch as MGARD, SZ, and ZFP, while offering significant speed-ups and\nmaintaining negligible accuracy loss through our importance sampling strategy.\n",
  "subjects": [
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "k80zdeuqoN1sOSGcuI61TG1SMc-sF8li68qgucfF5M4",
  "pdfSize": "5538387"
}