{
  "id": "2412.15564",
  "title": "Robust and Feature-Preserving Offset Meshing",
  "authors": "Hongyi Cao, Gang Xu, Renshu Gu, Jinlan Xu, Xiaoyu Zhang, Timon\n  Rabczuk, Yuzhe Luo, Xifeng Gao",
  "authorsParsed": [
    [
      "Cao",
      "Hongyi",
      ""
    ],
    [
      "Xu",
      "Gang",
      ""
    ],
    [
      "Gu",
      "Renshu",
      ""
    ],
    [
      "Xu",
      "Jinlan",
      ""
    ],
    [
      "Zhang",
      "Xiaoyu",
      ""
    ],
    [
      "Rabczuk",
      "Timon",
      ""
    ],
    [
      "Luo",
      "Yuzhe",
      ""
    ],
    [
      "Gao",
      "Xifeng",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 04:52:02 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734670322000,
  "abstract": "  We introduce a novel offset meshing approach that can robustly handle a 3D\nsurface mesh with an arbitrary geometry and topology configurations, while\nnicely capturing the sharp features on the original input for both inward and\noutward offsets. Compared to the existing approaches focusing on\nconstant-radius offset, to the best of our knowledge, we propose the first-ever\nsolution for mitered offset that can well preserve sharp features. Our method\nis designed based on several core principals: 1) explicitly generating the\noffset vertices and triangles with feature-capturing energy and constraints; 2)\nprioritizing the generation of the offset geometry before establishing its\nconnectivity, 3) employing exact algorithms in critical pipeline steps for\nrobustness, balancing the use of floating-point computations for efficiency, 4)\napplying various conservative speed up strategies including early reject\nnon-contributing computations to the final output. Our approach further\nuniquely supports variable offset distances on input surface elements, offering\na wider range practical applications compared to conventional methods.\n  We have evaluated our method on a subset of Thinkgi10K, containing models\nwith diverse topological and geometric complexities created by practitioners in\nvarious fields. Our results demonstrate the superiority of our approach over\ncurrent state-of-the-art methods in terms of element count, feature\npreservation, and non-uniform offset distances of the resulting offset mesh\nsurfaces, marking a significant advancement in the field.\n",
  "subjects": [
    "Computer Science/Graphics",
    "Computer Science/Computational Geometry"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "eZSf7v2Ik2imuO2Ul-KuDWgk2els4IMpj_ZPupUwJBU",
  "pdfSize": "32327567"
}