{
  "id": "2412.14768",
  "title": "FLAMe: Federated Learning with Attention Mechanism using Spatio-Temporal\n  Keypoint Transformers for Pedestrian Fall Detection in Smart Cities",
  "authors": "Byeonghun Kim and Byeongjoon Noh",
  "authorsParsed": [
    [
      "Kim",
      "Byeonghun",
      ""
    ],
    [
      "Noh",
      "Byeongjoon",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 11:51:45 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734609105000,
  "abstract": "  In smart cities, detecting pedestrian falls is a major challenge to ensure\nthe safety and quality of life of citizens. In this study, we propose a novel\nfall detection system using FLAMe (Federated Learning with Attention\nMechanism), a federated learning (FL) based algorithm. FLAMe trains around\nimportant keypoint information and only transmits the trained important weights\nto the server, reducing communication costs and preserving data privacy.\nFurthermore, the lightweight keypoint transformer model is integrated into the\nFL framework to effectively learn spatio-temporal features. We validated the\nexperiment using 22,672 video samples from the \"Fall Accident Risk Behavior\nVideo-Sensor Pair data\" dataset from AI-Hub. As a result of the experiment, the\nFLAMe-based system achieved an accuracy of 94.02% with about 190,000\ntransmission parameters, maintaining performance similar to that of existing\ncentralized learning while maximizing efficiency by reducing communication\ncosts by about 40% compared to the existing FL algorithm, FedAvg. Therefore,\nthe FLAMe algorithm has demonstrated that it provides robust performance in the\ndistributed environment of smart cities and is a practical and effective\nsolution for public safety.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "JMj-Plwo-ZFVx4puAjlJzdkIyJIJXhlapRbTvmluERM",
  "pdfSize": "2572497"
}