{"id":"2412.07603","title":"Two Distinct Populations of Dark Comets Delineated by Orbits and Sizes","authors":"Darryl Z. Seligman, Davide Farnocchia, Marco Micheli, Olivier R.\n  Hainaut, Henry H. Hsieh, Adina D. Feinstein, Steven R. Chesley, Aster G.\n  Taylor, Joseph Masiero, Karen J. Meech","authorsParsed":[["Seligman","Darryl Z.",""],["Farnocchia","Davide",""],["Micheli","Marco",""],["Hainaut","Olivier R.",""],["Hsieh","Henry H.",""],["Feinstein","Adina D.",""],["Chesley","Steven R.",""],["Taylor","Aster G.",""],["Masiero","Joseph",""],["Meech","Karen J.",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 15:43:53 GMT"}],"updateDate":"2024-12-11","timestamp":1733845433000,"abstract":"  Small bodies are capable of delivering essential prerequisites for the\ndevelopment of life, such as volatiles and organics, to the terrestrial\nplanets. For example, empirical evidence suggests that water was delivered to\nthe Earth by hydrated planetesimals from distant regions of the Solar System.\nRecently, several morphologically inactive near-Earth objects (NEOs) were\nreported to experience significant nongravitational accelerations inconsistent\nwith radiation-based effects, and possibly explained by volatile-driven\noutgassing. However, these \"dark comets\" display no evidence of comae in\narchival images, which are the defining feature of cometary activity. Here we\nreport detections of nongravitational accelerations on seven additional objects\npreviously classified as inactive (doubling the population) that could also be\nexplainable by asymmetric mass loss. A detailed search of archival survey and\ntargeted data rendered no detection of dust activity in any of these objects in\nindividual or stacked images. We calculate dust production limits of $\\sim10$,\n$0.1$, and $0.1$ kg s$^{-1}$ for 1998 FR$_{11}$, 2001 ME$_{1}$, and 2003 RM\nwith these data, indicating little or no dust surrounding the objects during\nthe observations. This set of dark comets reveals the delineation between two\ndistinct populations: larger, \"outer\" dark comets on eccentric orbits that are\nend members of a continuum in activity level of comets, and smaller, \"inner\"\ndark comets on near-circular orbits that could signify a new population. These\nobjects may trace various stages in the life cycle of a previously undetected,\nbut potentially numerous, volatile-rich population that may have provided\nessential material to the Earth.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"xXlcNFwTrIC11cShZxxbk664Re_NVBuKjcVRe3XKtok","pdfSize":"1534442"}