{"id":"2412.04737","title":"Generative Humanization for Therapeutic Antibodies","authors":"Cade Gordon, Aniruddh Raghu, Peyton Greenside, Hunter Elliott","authorsParsed":[["Gordon","Cade",""],["Raghu","Aniruddh",""],["Greenside","Peyton",""],["Elliott","Hunter",""]],"versions":[{"version":"v1","created":"Fri, 6 Dec 2024 02:54:45 GMT"},{"version":"v2","created":"Mon, 9 Dec 2024 02:26:45 GMT"}],"updateDate":"2024-12-10","timestamp":1733453685000,"abstract":"  Antibody therapies have been employed to address some of today's most\nchallenging diseases, but must meet many criteria during drug development\nbefore reaching a patient. Humanization is a sequence optimization strategy\nthat addresses one critical risk called immunogenicity - a patient's immune\nresponse to the drug - by making an antibody more \"human-like\" in the absence\nof a predictive lab-based test for immunogenicity. However, existing\nhumanization strategies generally yield very few humanized candidates, which\nmay have degraded biophysical properties or decreased drug efficacy. Here, we\nre-frame humanization as a conditional generative modeling task, where\nhumanizing mutations are sampled from a language model trained on human\nantibody data. We describe a sampling process that incorporates models of\ntherapeutic attributes, such as antigen binding affinity, to obtain candidate\nsequences that have both reduced immunogenicity risk and maintained or improved\ntherapeutic properties, allowing this algorithm to be readily embedded into an\niterative antibody optimization campaign. We demonstrate in silico and in lab\nvalidation that in real therapeutic programs our generative humanization method\nproduces diverse sets of antibodies that are both (1) highly-human and (2) have\nfavorable therapeutic properties, such as improved binding to target antigens.\n","subjects":["Computer Science/Machine Learning","Quantitative Biology/Quantitative Methods"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"RQXskGwHXfWcRrwCs2CQzJNzHfmnECm5E8bjoTxbvdk","pdfSize":"2247079"}