{
  "id": "2412.18532",
  "title": "The exact Wheeler-DeWitt equation for the scale-factor minisuperspace\n  model",
  "authors": "Eftychios Kaimakkamis, Herv\\'e Partouche, Karunava Sil and Nicolaos\n  Toumbas",
  "authorsParsed": [
    [
      "Kaimakkamis",
      "Eftychios",
      ""
    ],
    [
      "Partouche",
      "Hervé",
      ""
    ],
    [
      "Sil",
      "Karunava",
      ""
    ],
    [
      "Toumbas",
      "Nicolaos",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 24 Dec 2024 16:25:58 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1735057558000,
  "abstract": "  We consider the classical minisuperspace model describing a closed,\nhomogeneous and isotropic Universe, with a positive cosmological constant. Upon\ncanonical quantization, the infinite number of possible operator orderings in\nthe quantum Hamiltonian leads to distinct Wheeler-DeWitt equations for the\nwavefunction $\\psi$ of the Universe. Similarly, ambiguity arises in the\npath-integral formulation of $\\psi$, due to the infinite choices of\npath-integral measures for the single degree of freedom of the model. For each\nchoice of path-integral measure, we determine the correct operator ordering of\nthe quantum Hamiltonian and derive the exact form of the Wheeler-DeWitt\nequation, including all corrections in $\\hbar$. Additionally, we impose\nHermiticity of the Hamiltonian to deduce the Hilbert-space measure $\\mu$, which\nappears in the definition of the Hermitian inner product. Remarkably, all\nquantum predictions can be expressed through the combination $\\Psi=\\sqrt{\\mu}\\,\n\\psi$, which satisfies a universal Wheeler-DeWitt equation, independent of the\ninitial path-integral prescription. This result demonstrates that all seemingly\ndistinct quantum theories arising from different quantization schemes of the\nsame classical model are fundamentally equivalent.\n",
  "subjects": [
    "Physics/High Energy Physics - Theory",
    "Physics/General Relativity and Quantum Cosmology"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "jdwRD-sJG1HJpIPpfyW_5EbuNu0S-nixn5k-WJVa-dA",
  "pdfSize": "558736"
}