{"id":"2412.06163","title":"ASGDiffusion: Parallel High-Resolution Generation with Asynchronous\n  Structure Guidance","authors":"Yuming Li, Peidong Jia, Daiwei Hong, Yueru Jia, Qi She, Rui Zhao, Ming\n  Lu, Shanghang Zhang","authorsParsed":[["Li","Yuming",""],["Jia","Peidong",""],["Hong","Daiwei",""],["Jia","Yueru",""],["She","Qi",""],["Zhao","Rui",""],["Lu","Ming",""],["Zhang","Shanghang",""]],"versions":[{"version":"v1","created":"Mon, 9 Dec 2024 02:51:24 GMT"}],"updateDate":"2024-12-10","timestamp":1733712684000,"abstract":"  Training-free high-resolution (HR) image generation has garnered significant\nattention due to the high costs of training large diffusion models. Most\nexisting methods begin by reconstructing the overall structure and then proceed\nto refine the local details. Despite their advancements, they still face issues\nwith repetitive patterns in HR image generation. Besides, HR generation with\ndiffusion models incurs significant computational costs. Thus, parallel\ngeneration is essential for interactive applications. To solve the above\nlimitations, we introduce a novel method named ASGDiffusion for parallel HR\ngeneration with Asynchronous Structure Guidance (ASG) using pre-trained\ndiffusion models. To solve the pattern repetition problem of HR image\ngeneration, ASGDiffusion leverages the low-resolution (LR) noise weighted by\nthe attention mask as the structure guidance for the denoising step to ensure\nsemantic consistency. The proposed structure guidance can significantly\nalleviate the pattern repetition problem. To enable parallel generation, we\nfurther propose a parallelism strategy, which calculates the patch noises and\nstructure guidance asynchronously. By leveraging multi-GPU parallel\nacceleration, we significantly accelerate generation speed and reduce memory\nusage per GPU. Extensive experiments demonstrate that our method effectively\nand efficiently addresses common issues like pattern repetition and achieves\nstate-of-the-art HR generation.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7F0uDp6Trwe0pgnG6kukxlVT_R7dy5QqlytqcLx2H0A","pdfSize":"7503043"}