{"id":"2412.10983","title":"The JWST-NIRCam View of Sagittarius C. II. Evidence for Magnetically\n  Dominated HII Regions in the CMZ","authors":"John Bally, Samuel Crowe, Rub\\'en Fedriani, Adam Ginsburg, Rainer\n  Sch\\\"odel, Morten Andersen, Jonathan C. Tan, Zhi-Yun Li, Francisco\n  Nogueras-Lara, Yu Cheng, Chi-Yan Law, Q. Daniel Wang, Yichen Zhang, Suinan\n  Zhang","authorsParsed":[["Bally","John",""],["Crowe","Samuel",""],["Fedriani","Rubén",""],["Ginsburg","Adam",""],["Schödel","Rainer",""],["Andersen","Morten",""],["Tan","Jonathan C.",""],["Li","Zhi-Yun",""],["Nogueras-Lara","Francisco",""],["Cheng","Yu",""],["Law","Chi-Yan",""],["Wang","Q. Daniel",""],["Zhang","Yichen",""],["Zhang","Suinan",""]],"versions":[{"version":"v1","created":"Sat, 14 Dec 2024 22:24:32 GMT"}],"updateDate":"2024-12-17","timestamp":1734215072000,"abstract":"  We present JWST-NIRCam narrow-band, 4.05 $\\mu$m Brackett-$\\alpha$ images of\nthe Sgr C HII region, located in the Central Molecular Zone (CMZ) of the\nGalaxy. Unlike any HII region in the Solar vicinity, the Sgr C plasma is\ndominated by filamentary structure in both Brackett-$\\alpha$ and the radio\ncontinuum. Some bright filaments, which form a fractured arc with a radius of\nabout 1.85 pc centered on the Sgr C star-forming molecular clump, likely trace\nionization fronts. The brightest filaments form a `$\\pi$-shaped' structure in\nthe center of the HII region. Fainter filaments radiate away from the surface\nof the Sgr C molecular cloud. The filaments are emitting optically thin\nfree-free emission, as revealed by spectral index measurements from 1.28 GHz\n(MeerKAT) to 97 GHz (ALMA). But, the negative in-band 1 to 2 GHz spectral index\nin the MeerKAT data alone reveals the presence of a non-thermal component\nacross the entire Sgr C HII region. We argue that the plasma flow in Sgr C is\ncontrolled by magnetic fields, which confine the plasma to rope-like filaments\nor sheets. This results in the measured non-thermal component of low-frequency\nradio emission plasma, as well as a plasma $\\beta$ (thermal pressure divided by\nmagnetic pressure) below 1, even in the densest regions. We speculate that all\nmature HII regions in the CMZ, and galactic nuclei in general, evolve in a\nmagnetically dominated, low plasma $\\beta$ regime.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"FotQZS6R5CnTVjtFuBMF5zdGtUIAQXIcwmYQzYiopnI","pdfSize":"37725331"}