{"id":"2412.12861","title":"Dyn-HaMR: Recovering 4D Interacting Hand Motion from a Dynamic Camera","authors":"Zhengdi Yu, Stefanos Zafeiriou, Tolga Birdal","authorsParsed":[["Yu","Zhengdi",""],["Zafeiriou","Stefanos",""],["Birdal","Tolga",""]],"versions":[{"version":"v1","created":"Tue, 17 Dec 2024 12:43:10 GMT"},{"version":"v2","created":"Wed, 18 Dec 2024 21:29:43 GMT"}],"updateDate":"2024-12-20","timestamp":1734439390000,"abstract":"  We propose Dyn-HaMR, to the best of our knowledge, the first approach to\nreconstruct 4D global hand motion from monocular videos recorded by dynamic\ncameras in the wild. Reconstructing accurate 3D hand meshes from monocular\nvideos is a crucial task for understanding human behaviour, with significant\napplications in augmented and virtual reality (AR/VR). However, existing\nmethods for monocular hand reconstruction typically rely on a weak perspective\ncamera model, which simulates hand motion within a limited camera frustum. As a\nresult, these approaches struggle to recover the full 3D global trajectory and\noften produce noisy or incorrect depth estimations, particularly when the video\nis captured by dynamic or moving cameras, which is common in egocentric\nscenarios. Our Dyn-HaMR consists of a multi-stage, multi-objective optimization\npipeline, that factors in (i) simultaneous localization and mapping (SLAM) to\nrobustly estimate relative camera motion, (ii) an interacting-hand prior for\ngenerative infilling and to refine the interaction dynamics, ensuring plausible\nrecovery under (self-)occlusions, and (iii) hierarchical initialization through\na combination of state-of-the-art hand tracking methods. Through extensive\nevaluations on both in-the-wild and indoor datasets, we show that our approach\nsignificantly outperforms state-of-the-art methods in terms of 4D global mesh\nrecovery. This establishes a new benchmark for hand motion reconstruction from\nmonocular video with moving cameras. Our project page is at\nhttps://dyn-hamr.github.io/.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"6NhX8dysIBn-KzcD1zjwCVS1BHyOr-gcwNIgAMX3ZYc","pdfSize":"7808731"}