{"id":"2412.02745","title":"Quantum anomalous Hall crystals in moir\\'e bands with higher Chern\n  number","authors":"Raul Perea-Causin, Hui Liu, Emil J. Bergholtz","authorsParsed":[["Perea-Causin","Raul",""],["Liu","Hui",""],["Bergholtz","Emil J.",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 19:00:01 GMT"}],"updateDate":"2024-12-05","timestamp":1733252401000,"abstract":"  The realization of fractional Chern insulators in moir\\'e materials has\nsparked the search for further novel phases of matter in this platform. In\nparticular, recent works have demonstrated the possibility of realizing quantum\nanomalous Hall crystals (QAHCs), which combine the zero-field quantum Hall\neffect with spontaneously broken translation symmetry. Here, we employ exact\ndiagonalization to demonstrate the existence of stable QAHCs arising from\n$\\frac{2}{3}$-filled moir\\'e bands with Chern number $C=2$. Our calculations\nshow that these topological crystals, which are characterized by a quantized\nHall conductivity of $1$ and a tripled unit cell, are robust in an ideal model\nof twisted bilayer-trilayer graphene -- providing a novel explanation for\nexperimental observations in this heterostructure. Furthermore, we predict that\nthe QAHC remains robust in a realistic model of twisted double bilayer graphene\nand, in addition, we provide a range of optimal tuning parameters, namely twist\nangle and electric field, for experimentally realizing this phase. Overall, our\nwork demonstrates the stability of QAHCs at odd-denominator filling of $C=2$\nbands, provides specific guidelines for future experiments, and establishes\nchiral multilayer graphene as a theoretical platform for studying topological\nphases beyond the Landau level paradigm.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"fgwOXqWstMR3FMaKF5nN03P9HS6WYf2f0qQduZhYC9c","pdfSize":"1357590"}