{
  "id": "2412.02247",
  "title": "Development and Performance of a Static Pluviometer System",
  "authors": "Parth Saxena, Pratham Saxena, Adarsh Sowcar, Sreeharsha Angara,\n  Ashutosh Pandey and Thomas Basikolo",
  "authorsParsed": [
    [
      "Saxena",
      "Parth",
      ""
    ],
    [
      "Saxena",
      "Pratham",
      ""
    ],
    [
      "Sowcar",
      "Adarsh",
      ""
    ],
    [
      "Angara",
      "Sreeharsha",
      ""
    ],
    [
      "Pandey",
      "Ashutosh",
      ""
    ],
    [
      "Basikolo",
      "Thomas",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 08:22:54 GMT"
    }
  ],
  "updateDate": "2024-12-04",
  "timestamp": 1733214174000,
  "abstract": "  As the frequency and severity of climate-related events such as droughts,\nfloods, and water scarcity continue to escalate, accurate rainfall monitoring\nbecomes increasingly critical. This paper covers various industry methods of\nmeasuring rainfall as well as our own ground pluviometer system. Our system\nconsists of an inexpensive static rain gauge that can operate for approximately\nsix to twelve months without maintenance. It utilizes resistive sensing\ntechnology accompanied by a microcontroller to measure the water level depth\nfrom the device vessel, recording rainfall at an hourly rate. This study also\nprovides a side-by-side comparison of our pluviometer system with an industry\nrain gauge, the MeteoRain 200 Compact, from Barani Systems, with the\ndifferences in data being statistically insignificant. By prioritizing cost,\nsustainability, simplicity, ease of maintenance, and assembly, this research\ncontributes to essential rainfall monitoring solutions, specifically for\ndeveloping countries.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Systems and Control",
    "Computer Science/Systems and Control"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "4oUShQsG9FSJBp8MQSRydYUOrLK1wx6t-tuyB2Kqnx0",
  "pdfSize": "1344118"
}