{"id":"2412.06850","title":"Cardiometabolic Risk Factors in South Asians: An Epidemiological and\n  Anthropological Study in an Urban Populace of Eastern India","authors":"Karishma Yasmin","authorsParsed":[["Yasmin","Karishma",""]],"versions":[{"version":"v1","created":"Sun, 8 Dec 2024 06:49:59 GMT"}],"updateDate":"2024-12-11","timestamp":1733640599000,"abstract":"  Background: This study examines cardiometabolic (CM) risk factors in an urban\nSouth Asian population, integrating medical and Anthropological perspectives to\nexplore the effects of socio-economic, lifestyle, gender-specific factors, and\ncultural norms on health outcomes. Results: Analysis indicates a high\nprevalence of MetS and Pre-MetS, particularly among females, with significant\npredictors including BMI, triglycerides, total cholesterol, and waist\ncircumference, alongside socio-genetic and lifestyle factors. Employing Elastic\nNet logistic regression, the researcher rigorously validated models to evaluate\ntheir predictive performance while also describing the associations and\nprevalence of known risk factors. The use of this method underlines the\nimportance of combining traditional risk factors with socio-genetic,\nbiological, economic and lifestyle variables, while Anthropological insights\nreveal the impact of urbanization and socio-cultural norms on health behaviors.\nConclusion: The study advocates for a multidisciplinary approach in public\nhealth strategies, emphasizing the complex interplay between genetic,\nenvironmental, biological and socio-cultural influences on cardiometabolic\nhealth. This dual approach aligns with descriptive and predictive model goals.\nThe future research should further integrate biomedical sciences with\nsocio-cultural studies to develop culturally sensitive interventions, aiming to\naddress the growing challenge of CM diseases in urban South Asian contexts.\n","subjects":["Quantitative Biology/Quantitative Methods"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"vhVjdeI_Mjov6-jX9h54YFlzXEn_rdoiNPDRq3LlMUo","pdfSize":"799598"}