{
  "id": "2412.02037",
  "title": "A simple tool for the optimization of 1D phononic and photonic bandgap\n  filters",
  "authors": "Prasanna Salasiya and Bojan B. Guzina",
  "authorsParsed": [
    [
      "Salasiya",
      "Prasanna",
      ""
    ],
    [
      "Guzina",
      "Bojan B.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 23:45:51 GMT"
    }
  ],
  "updateDate": "2024-12-04",
  "timestamp": 1733183151000,
  "abstract": "  We develop an effective computational tool for simulating the scattering of\n1D waves by a composite layer architected in an otherwise homogeneous medium.\nThe layer is designed as the union of segments cut from various mother periodic\nmedia, which allows us to describe the wavefield in each segment in terms of\nthe ``left'' and ``right'' Bloch waves. For a given periodic medium and\nfrequency of oscillations, the latter are computed by solving the quadratic\neigenvalue problem which seeks the wavenumber -- and affiliated eigenstate --\nof a Bloch wave. In this way the scattering problem is reduced to a\nlow-dimensional algebraic problem, solved via the transfer matrix approach,\nthat seeks the amplitudes of the featured Bloch waves, amplitude of the\nreflected wave, and that of the transmitted wave. Such an approach inherently\ncaters for an optimal filter design as it enables rapid exploration of the\ndesign space with respect to segment (i) permutations, (ii) cut lengths, and\n(iii) cut offsets relative to the mother periodic media. Specifically, under\n(i)--(iii) the Bloch eigenstates remain invariant, so that only the transfer\nmatrices need to be recomputed. The reduced order model is found to be in\nexcellent agreement with numerical simulations. Example simulations demonstrate\n40x computational speedup when optimizing a 1D filter for minimum transmission\nvia a genetic algorithm approach that entails $O(10^6)$ trial configurations.\nRelative to the classical rainbow trap design where the unit cells of the\nmother periodic media are arranged in a ``linear'' fashion according to their\ndispersive characteristics, the GA-optimized (rearranged) configuration yields\na $40\\%$ reduction in filter transmissibility over the target frequency range,\nfor the same filter thickness.\n",
  "subjects": [
    "Physics/Computational Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Kmc1ab6eDILccVBNoU_j2jGJM30AgbFTjcOROnrPPqo",
  "pdfSize": "1119544"
}