{"id":"2412.01828","title":"The Origin of Supermassive Black Holes from Pop III.1 Seeds","authors":"Jonathan C. Tan, Jasbir Singh, Vieri Cammelli, Mahsa Sanati, Maya\n  Petkova, Devesh Nandal, Pierluigi Monaco","authorsParsed":[["Tan","Jonathan C.",""],["Singh","Jasbir",""],["Cammelli","Vieri",""],["Sanati","Mahsa",""],["Petkova","Maya",""],["Nandal","Devesh",""],["Monaco","Pierluigi",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 18:59:59 GMT"}],"updateDate":"2024-12-03","timestamp":1733165999000,"abstract":"  The origin of supermassive black holes (SMBHs) is a key open question for\ncontemporary astrophysics and cosmology. Here we review the features of a\ncosmological model of SMBH formation from Pop III.1 seeds, i.e., remnants of\nmetal-free stars forming in locally-isolated minihalos, where energy injection\nfrom dark matter particle annihilation alters the structure of the protostar\nallowing growth to supermassive scales (Banik et al. 2019; Singh et al. 2023;\nCammelli et al. 2024). The Pop III.1 model explains the paucity of\nintermediate-mass black holes (IMBHs) via a characteristic SMBH seed mass of\n$\\sim10^5\\:M_\\odot$ that is set by the baryonic content of minihalos.\nIonization feedback from supermassive Pop III.1 stars sets the cosmic number\ndensity of SMBHs to be $n_{\\rm SMBH}\\lesssim 0.2\\:{\\rm Mpc}^{-3}$. The model\nthen predicts that all SMBHs form by $z\\sim20$ with a spatial distribution that\nis initially unclustered. SMBHs at high redshifts $z\\gtrsim7$ should all be\nsingle objects, with SMBH binaries and higher order multiples emerging only at\nlower redshifts. We also discuss the implications of this model for SMBH host\ngalaxy properties, occupation fractions, gravitational wave emission, cosmic\nreionization, and the nature of dark matter. These predictions are compared to\nlatest observational results, especially from HST, JWST and pulsar timing array\nobservations.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"5JcrMy7NXv4uwn-RDLcSEJ2jHajc98AI5Il2ixcdtOA","pdfSize":"8823987"}