{"id":"2412.09426","title":"Meteoroid Ablation within the Jovian Atmosphere: Implications on the\n  Oxygen Delivery to the Gas Giant's Atmosphere","authors":"C.A. Mehta (The United States Coast Guard Academy and Auburn\n  University), D.M. Orlov (University of California, San Diego), T. Feng\n  (University of South Florida), R.W. James (The United States Coast Guard\n  Academy) and E.G. Kostadinova (Auburn University)","authorsParsed":[["Mehta","C. A.","","The United States Coast Guard Academy and Auburn\n  University"],["Orlov","D. M.","","University of California, San Diego"],["Feng","T.","","University of South Florida"],["James","R. W.","","The United States Coast Guard\n  Academy"],["Kostadinova","E. G.","","Auburn University"]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 16:32:54 GMT"}],"updateDate":"2024-12-13","timestamp":1734021174000,"abstract":"  The detection of water molecules within the atmosphere of Jupiter, first by\nthe Galileo Atmospheric Probe, and later by the Juno spacecraft, has given rise\nto the question of whether those molecules are sourced endogenously or\nexogenously. One hypothesis is that the ablation of meteoroids deposited the\nnecessary oxygen into the atmosphere, which was subsequently used in chemical\nprocesses to form water. This paper aims to evaluate this hypothesis by\nsimulating the ablation of carbonaceous objects entering the planet's\natmosphere to determine the possible rates of oxygen delivery and the most\nlikely altitude for such delivery within the Jovian atmosphere. We estimate\nthat carbonaceous meteoroids have the potential to deliver $\\sim 1.4 \\times\n10^7 \\, \\text{kg/m}^2$ of oxygen over a billion years. We further estimate that\nmost of the ablation is expected to occur in the stratosphere, or 450-400 km\nabove the region of 1 bar of atmospheric pressure. In comparison,\nInterplanetary Dust Particles (IDPs) are estimated to deliver roughly $\\sim\n10^2 \\, \\text{kg/m}^2$ of oxygen over the same period.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Physics/Geophysics","Physics/Space Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"wzcXJb-E6iQVJj-yetwwIREPt0TXDxYkatyTESh6168","pdfSize":"777573"}