{
  "id": "2412.13819",
  "title": "Measurement-device-independent entanglement witness with imprecise input\n  states",
  "authors": "Xing-Chen Guo, Mao-Sheng Li",
  "authorsParsed": [
    [
      "Guo",
      "Xing-Chen",
      ""
    ],
    [
      "Li",
      "Mao-Sheng",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 13:08:44 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734527324000,
  "abstract": "  Measurement-device-independent entanglement witnesses (MDI-EWs) enable the\ndetection of entanglement without relying on characterized measurements.\nHowever, the entanglement criteria for MDI-EWs typically assume the idealized\ncondition that the lab input states are precisely the desired ones. In this\nwork, we remove this idealization by considering the realistic scenario in\nwhich lab input states may be imprecise. We introduce a new class of MDI-EWs,\ntermed sensitive MDI-EWs, whose entanglement criteria fail under any non-zero\nimprecision in the input states. We derive sufficient conditions for an MDI-EW\nto be classified as sensitive, revealing that a large class of MDI-EWs exhibit\nthis sensitivity. Additionally, we demonstrate that two well-known MDI-EWs for\nWerner states are sensitive according to our criteria, one of which recovers\nthe result from a previous study [Phys. Rev. A 104, 012429 (2021)]. Moreover,\nwe clarify the concept of lab input states in a way that makes imprecisions\nexperimentally measurable, and propose a systematic approach for modifying the\ncriterion of any MDI-EW to accommodate small imprecisions, thus enhancing\nexperimental relevance. A simple MDI-EW example is provided, where our modified\ncriterion is already optimal. This work bridges the gap between idealized\ntheoretical models and practical experimental conditions, paving the way for\nmore robust and accessible entanglement detection in real-world settings.\n",
  "subjects": [
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "M49OSJ0ylpaga8RTGt_nvmEbHb9GYUW_glqwUApEDgk",
  "pdfSize": "224701"
}