{"id":"2412.03730","title":"Improving Optical Photo-z Estimates Using Submillimeter Photometry","authors":"Pouya Tanouri, Ryley Hill, Douglas Scott, Edward L. Chapin","authorsParsed":[["Tanouri","Pouya",""],["Hill","Ryley",""],["Scott","Douglas",""],["Chapin","Edward L.",""]],"versions":[{"version":"v1","created":"Wed, 4 Dec 2024 21:50:14 GMT"}],"updateDate":"2024-12-06","timestamp":1733349014000,"abstract":"  Estimating the redshifts of distant galaxies is critical for determining\ntheir intrinsic properties, as well as for using them as cosmological probes.\nMeasuring redshifts spectroscopically is accurate, but expensive in terms of\ntelescope time, hence it has become common to measure `photometric' redshifts,\nwhich are fits to photometry taken in a number of filters using templates of\ngalaxy spectral energy distributions (SEDs). However, most photometric methods\nrely on optical and near-infrared (NIR) photometry, neglecting longer\nwavelength data in the far-infrared (FIR) and millimeter. Since the ultimate\ngoal of future surveys is to obtain redshift estimates for all galaxies, it is\nimportant to improve photometric redshift algorithms for cases where\noptical/NIR fits fail to produce reliable results. For specific subsets of\ngalaxies, in particular dusty star-forming galaxies (DSFGs), it can be\nparticularly hard to obtain good optical photometry and thus reliable\nphotometric redshift estimates, while these same galaxies are often bright at\nlonger wavelengths. Here we describe a new method for independently\nincorporating FIR-to-millimeter photometry to the outputs of standard\noptical/NIR SED-fitting codes to help improve redshift estimation, in\nparticular of DSFGs. We test our method with the H-ATLAS catalog, which\ncontains FIR photometry from Herschel-SPIRE cross-matched to optical and NIR\nobservations, and show that our approach reduces the number of catastrophic\noutliers by a factor of three compared to standard optical and NIR SED-fitting\nroutines alone.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8i7KLA1wPEpD7WWBNjkhbOi0wyb1idzIN69NyckS0hM","pdfSize":"1986681"}