{
  "id": "2412.08821",
  "title": "Large Concept Models: Language Modeling in a Sentence Representation\n  Space",
  "authors": "LCM team, Lo\\\"ic Barrault, Paul-Ambroise Duquenne, Maha Elbayad,\n  Artyom Kozhevnikov, Belen Alastruey, Pierre Andrews, Mariano Coria, Guillaume\n  Couairon, Marta R. Costa-juss\\`a, David Dale, Hady Elsahar, Kevin Heffernan,\n  Jo\\~ao Maria Janeiro, Tuan Tran, Christophe Ropers, Eduardo S\\'anchez, Robin\n  San Roman, Alexandre Mourachko, Safiyyah Saleem, Holger Schwenk",
  "authorsParsed": [
    [
      "LCM team",
      "",
      ""
    ],
    [
      "Barrault",
      "Loïc",
      ""
    ],
    [
      "Duquenne",
      "Paul-Ambroise",
      ""
    ],
    [
      "Elbayad",
      "Maha",
      ""
    ],
    [
      "Kozhevnikov",
      "Artyom",
      ""
    ],
    [
      "Alastruey",
      "Belen",
      ""
    ],
    [
      "Andrews",
      "Pierre",
      ""
    ],
    [
      "Coria",
      "Mariano",
      ""
    ],
    [
      "Couairon",
      "Guillaume",
      ""
    ],
    [
      "Costa-jussà",
      "Marta R.",
      ""
    ],
    [
      "Dale",
      "David",
      ""
    ],
    [
      "Elsahar",
      "Hady",
      ""
    ],
    [
      "Heffernan",
      "Kevin",
      ""
    ],
    [
      "Janeiro",
      "João Maria",
      ""
    ],
    [
      "Tran",
      "Tuan",
      ""
    ],
    [
      "Ropers",
      "Christophe",
      ""
    ],
    [
      "Sánchez",
      "Eduardo",
      ""
    ],
    [
      "Roman",
      "Robin San",
      ""
    ],
    [
      "Mourachko",
      "Alexandre",
      ""
    ],
    [
      "Saleem",
      "Safiyyah",
      ""
    ],
    [
      "Schwenk",
      "Holger",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 23:36:20 GMT"
    },
    {
      "version": "v2",
      "created": "Sun, 15 Dec 2024 21:20:12 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1733960180000,
  "abstract": "  LLMs have revolutionized the field of artificial intelligence and have\nemerged as the de-facto tool for many tasks. The current established technology\nof LLMs is to process input and generate output at the token level. This is in\nsharp contrast to humans who operate at multiple levels of abstraction, well\nbeyond single words, to analyze information and to generate creative content.\nIn this paper, we present an attempt at an architecture which operates on an\nexplicit higher-level semantic representation, which we name a concept.\nConcepts are language- and modality-agnostic and represent a higher level idea\nor action in a flow. Hence, we build a \"Large Concept Model\". In this study, as\nproof of feasibility, we assume that a concept corresponds to a sentence, and\nuse an existing sentence embedding space, SONAR, which supports up to 200\nlanguages in both text and speech modalities.\n  The Large Concept Model is trained to perform autoregressive sentence\nprediction in an embedding space. We explore multiple approaches, namely MSE\nregression, variants of diffusion-based generation, and models operating in a\nquantized SONAR space. These explorations are performed using 1.6B parameter\nmodels and training data in the order of 1.3T tokens. We then scale one\narchitecture to a model size of 7B parameters and training data of about 2.7T\ntokens. We perform an experimental evaluation on several generative tasks,\nnamely summarization and a new task of summary expansion. Finally, we show that\nour model exhibits impressive zero-shot generalization performance to many\nlanguages, outperforming existing LLMs of the same size. The training code of\nour models is freely available.\n",
  "subjects": [
    "Computer Science/Computation and Language"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "r2anQyDzSAxNDFsvVJtvBf8N5U-7uYx_RA256S1fyAs",
  "pdfSize": "1909629"
}