{"id":"2412.01157","title":"Local variations of the radial metallicity gradient in a simulated\n  NIHAO-UHD Milky Way analogue and their implications for (extra-)galactic\n  studies","authors":"Sven Buder, Tobias Buck, Qian-Hui Chen, Kathryn Grasha","authorsParsed":[["Buder","Sven",""],["Buck","Tobias",""],["Chen","Qian-Hui",""],["Grasha","Kathryn",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 05:57:03 GMT"}],"updateDate":"2024-12-03","timestamp":1733119023000,"abstract":"  Radial metallicity gradients are fundamental to understanding galaxy\nformation and evolution. In our high-resolution simulation of a NIHAO-UHD Milky\nWay analogue, we analyze the linearity, scatter, spatial coherence, and\nage-related variations of metallicity gradients using young stars and gas.\nWhile a global linear model generally captures the gradient, it ever so\nslightly overestimates metallicity in the inner galaxy and underestimates it in\nthe outer regions of our simulated galaxy. Both a quadratic model, showing an\ninitially steeper gradient that smoothly flattens outward, and a piecewise\nlinear model with a break radius at 10~kpc (2.5 effective radii) fit the data\nequally better. The spread of [Fe/H] of young stars in the simulation increases\nby tenfold from the innermost to the outer galaxy at a radius of 20~kpc. We\nfind that stars born at similar times along radial spirals drive this spread in\nthe outer galaxy, with a chemical under- and over-enhancement of up to 0.1 dex\nat leading and trailing regions of such spirals, respectively. This localised\nchemical variance highlights the need to examine radial and azimuthal selection\neffects for both Galactic and extragalactic observational studies. The arguably\nidealised but volume-complete simulations suggest that future studies should\nnot only test linear and piecewise linear gradients, but also non-linear\nfunctions such as quadratic ones to test for a smooth gradient rather than one\nwith a break radius. Either finding would help to determine the importance of\ndifferent enrichment or mixing pathways and thus our understanding of galaxy\nformation and evolution scenarios.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Ilw5f5ItfPSwXGtsoDbNiLLK4fjvdPswfGF8w4hPMHY","pdfSize":"6924859"}