{
  "id": "2412.10897",
  "title": "Task Diversity in Bayesian Federated Learning: Simultaneous Processing\n  of Classification and Regression",
  "authors": "Junliang Lyu, Yixuan Zhang, Xiaoling Lu, Feng Zhou",
  "authorsParsed": [
    [
      "Lyu",
      "Junliang",
      ""
    ],
    [
      "Zhang",
      "Yixuan",
      ""
    ],
    [
      "Lu",
      "Xiaoling",
      ""
    ],
    [
      "Zhou",
      "Feng",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 14 Dec 2024 17:10:54 GMT"
    },
    {
      "version": "v2",
      "created": "Wed, 25 Dec 2024 09:58:16 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1734196254000,
  "abstract": "  This work addresses a key limitation in current federated learning\napproaches, which predominantly focus on homogeneous tasks, neglecting the task\ndiversity on local devices. We propose a principled integration of multi-task\nlearning using multi-output Gaussian processes (MOGP) at the local level and\nfederated learning at the global level. MOGP handles correlated classification\nand regression tasks, offering a Bayesian non-parametric approach that\nnaturally quantifies uncertainty. The central server aggregates the posteriors\nfrom local devices, updating a global MOGP prior redistributed for training\nlocal models until convergence. Challenges in performing posterior inference on\nlocal devices are addressed through the P\\'{o}lya-Gamma augmentation technique\nand mean-field variational inference, enhancing computational efficiency and\nconvergence rate. Experimental results on both synthetic and real data\ndemonstrate superior predictive performance, OOD detection, uncertainty\ncalibration and convergence rate, highlighting the method's potential in\ndiverse applications. Our code is publicly available at\nhttps://github.com/JunliangLv/task_diversity_BFL.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Statistics/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "oRMYX1d3T3SUos_EyZnZNjxZmII0R-_mCrKDwwViknk",
  "pdfSize": "1425457"
}