{
  "id": "2412.03831",
  "title": "A large language model-type architecture for high-dimensional molecular\n  potential energy surfaces",
  "authors": "Xiao Zhu, Srinivasan S. Iyengar",
  "authorsParsed": [
    [
      "Zhu",
      "Xiao",
      ""
    ],
    [
      "Iyengar",
      "Srinivasan S.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 02:48:49 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733366929000,
  "abstract": "  Computing high dimensional potential surfaces for molecular and materials\nsystems is considered to be a great challenge in computational chemistry with\npotential impact in a range of areas including fundamental prediction of\nreaction rates. In this paper we design and discuss an algorithm that has\nsimilarities to large language models in generative AI and natural language\nprocessing. Specifically, we represent a molecular system as a graph which\ncontains a set of nodes, edges, faces etc. Interactions between these sets,\nwhich represent molecular subsystems in our case, are used to construct the\npotential energy surface for a reasonably sized chemical system with 51\ndimensions. Essentially a family of neural networks that pertain to the\ngraph-based subsystems, get the job done for this 51 dimensional system. We\nthen ask if this same family of lower-dimensional neural networks can be\ntransformed to provide accurate predictions for a 186 dimensional potential\nsurface. We find that our algorithm does provide reasonably accurate results\nfor this larger dimensional problem with sub-kcal/mol accuracy for the higher\ndimensional potential surface problem.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Physics/Atomic and Molecular Clusters",
    "Physics/Chemical Physics",
    "Physics/Computational Physics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "TdL2ejLyL3JRYyESrlEkvDbzOuxFpTLuIcYFlczHiYo",
  "pdfSize": "4574713"
}