{
  "id": "2412.11340",
  "title": "Fast Bayesian Functional Principal Components Analysis",
  "authors": "Joseph Sartini, Xinkai Zhou, Liz Selvin, Scott Zeger, and Ciprian\n  Crainiceanu",
  "authorsParsed": [
    [
      "Sartini",
      "Joseph",
      ""
    ],
    [
      "Zhou",
      "Xinkai",
      ""
    ],
    [
      "Selvin",
      "Liz",
      ""
    ],
    [
      "Zeger",
      "Scott",
      ""
    ],
    [
      "Crainiceanu",
      "Ciprian",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 15 Dec 2024 23:38:06 GMT"
    },
    {
      "version": "v2",
      "created": "Mon, 23 Dec 2024 21:11:36 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1734305886000,
  "abstract": "  Functional Principal Components Analysis (FPCA) is one of the most successful\nand widely used analytic tools for exploration and dimension reduction of\nfunctional data. Standard implementations of FPCA estimate the principal\ncomponents from the data but ignore their sampling variability in subsequent\ninferences. To address this problem, we propose the Fast Bayesian Functional\nPrincipal Components Analysis (Fast BayesFPCA), that treats principal\ncomponents as parameters on the Stiefel manifold. To ensure efficiency,\nstability, and scalability we introduce three innovations: (1) project all\neigenfunctions onto an orthonormal spline basis, reducing modeling\nconsiderations to a smaller-dimensional Stiefel manifold; (2) induce a uniform\nprior on the Stiefel manifold of the principal component spline coefficients\nvia the polar representation of a matrix with entries following independent\nstandard Normal priors; and (3) constrain sampling using the assumed FPCA\nstructure to improve stability. We demonstrate the application of Fast\nBayesFPCA to characterize the variability in mealtime glucose from the Dietary\nApproaches to Stop Hypertension for Diabetes Continuous Glucose Monitoring\n(DASH4D CGM) study. All relevant STAN code and simulation routines are\navailable as supplementary material.\n",
  "subjects": [
    "Statistics/Methodology"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "iC05OJ0m0q0sMUCSKZ5pLRNwaDsZKT6nzyBNY6XAuog",
  "pdfSize": "16950220"
}