{
  "id": "2412.16656",
  "title": "Generalizable Articulated Object Perception with Superpoints",
  "authors": "Qiaojun Yu, Ce Hao, Xibin Yuan, Li Zhang, Liu Liu, Yukang Huo, Rohit\n  Agarwal, Cewu Lu",
  "authorsParsed": [
    [
      "Yu",
      "Qiaojun",
      ""
    ],
    [
      "Hao",
      "Ce",
      ""
    ],
    [
      "Yuan",
      "Xibin",
      ""
    ],
    [
      "Zhang",
      "Li",
      ""
    ],
    [
      "Liu",
      "Liu",
      ""
    ],
    [
      "Huo",
      "Yukang",
      ""
    ],
    [
      "Agarwal",
      "Rohit",
      ""
    ],
    [
      "Lu",
      "Cewu",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 21 Dec 2024 14:57:24 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734793044000,
  "abstract": "  Manipulating articulated objects with robotic arms is challenging due to the\ncomplex kinematic structure, which requires precise part segmentation for\nefficient manipulation. In this work, we introduce a novel superpoint-based\nperception method designed to improve part segmentation in 3D point clouds of\narticulated objects. We propose a learnable, part-aware superpoint generation\ntechnique that efficiently groups points based on their geometric and semantic\nsimilarities, resulting in clearer part boundaries. Furthermore, by leveraging\nthe segmentation capabilities of the 2D foundation model SAM, we identify the\ncenters of pixel regions and select corresponding superpoints as candidate\nquery points. Integrating a query-based transformer decoder further enhances\nour method's ability to achieve precise part segmentation. Experimental results\non the GAPartNet dataset show that our method outperforms existing\nstate-of-the-art approaches in cross-category part segmentation, achieving AP50\nscores of 77.9% for seen categories (4.4% improvement) and $39.3\\%$ for unseen\ncategories (11.6% improvement), with superior results in 5 out of 9 part\ncategories for seen objects and outperforming all previous methods across all\npart categories for unseen objects.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "wC4KUXGKdCIVAXu2_1na7exYyRB0NRwfzcxigDbDmM8",
  "pdfSize": "890799"
}