{"id":"2412.19360","title":"Improving the network traffic classification using the Packet Vision\n  approach","authors":"Rodrigo Moreira and Larissa Ferreira Rodrigues and Pedro Frosi Rosa\n  and Fl\\'avio de Oliveira Silva","authorsParsed":[["Moreira","Rodrigo",""],["Rodrigues","Larissa Ferreira",""],["Rosa","Pedro Frosi",""],["Silva","Flávio de Oliveira",""]],"versions":[{"version":"v1","created":"Thu, 26 Dec 2024 21:56:03 GMT"}],"updateDate":"2024-12-30","timestamp":1735250163000,"abstract":"  The network traffic classification allows improving the management, and the\nnetwork services offer taking into account the kind of application. The future\nnetwork architectures, mainly mobile networks, foresee intelligent mechanisms\nin their architectural frameworks to deliver application-aware network\nrequirements. The potential of convolutional neural networks capabilities,\nwidely exploited in several contexts, can be used in network traffic\nclassification. Thus, it is necessary to develop methods based on the content\nof packets transforming it into a suitable input for CNN technologies. Hence,\nwe implemented and evaluated the Packet Vision, a method capable of building\nimages from packets raw-data, considering both header and payload. Our approach\nexcels those found in state-of-the-art by delivering security and privacy by\ntransforming the raw-data packet into images. Therefore, we built a dataset\nwith four traffic classes evaluating the performance of three CNNs\narchitectures: AlexNet, ResNet-18, and SqueezeNet. Experiments showcase the\nPacket Vision combined with CNNs applicability and suitability as a promising\napproach to deliver outstanding performance in classifying network traffic.\n","subjects":["Computer Science/Networking and Internet Architecture","Computer Science/Artificial Intelligence","Computer Science/Cryptography and Security","Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"jAjH-DS1KpX3eCDO94GZepX_2CgqJCQ69n7Ffe18Btg","pdfSize":"3862314"}