{
  "id": "2412.08186",
  "title": "Towards Automated Algebraic Multigrid Preconditioner Design Using\n  Genetic Programming for Large-Scale Laser Beam Welding Simulations",
  "authors": "Dinesh Parthasarathy, Tommaso Bevilacqua, Martin Lanser, Axel Klawonn,\n  Harald K\\\"ostler",
  "authorsParsed": [
    [
      "Parthasarathy",
      "Dinesh",
      ""
    ],
    [
      "Bevilacqua",
      "Tommaso",
      ""
    ],
    [
      "Lanser",
      "Martin",
      ""
    ],
    [
      "Klawonn",
      "Axel",
      ""
    ],
    [
      "Köstler",
      "Harald",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 08:24:38 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733905478000,
  "abstract": "  Multigrid methods are asymptotically optimal algorithms ideal for large-scale\nsimulations. But, they require making numerous algorithmic choices that\nsignificantly influence their efficiency. Unlike recent approaches that learn\noptimal multigrid components using machine learning techniques, we adopt a\ncomplementary strategy here, employing evolutionary algorithms to construct\nefficient multigrid cycles from available individual components. This\ntechnology is applied to finite element simulations of the laser beam welding\nprocess. The thermo-elastic behavior is described by a coupled system of\ntime-dependent thermo-elasticity equations, leading to nonlinear and\nill-conditioned systems. The nonlinearity is addressed using Newton's method,\nand iterative solvers are accelerated with an algebraic multigrid (AMG)\npreconditioner using hypre BoomerAMG interfaced via PETSc. This is applied as a\nmonolithic solver for the coupled equations. To further enhance solver\nefficiency, flexible AMG cycles are introduced, extending traditional cycle\ntypes with level-specific smoothing sequences and non-recursive cycling\npatterns. These are automatically generated using genetic programming, guided\nby a context-free grammar containing AMG rules. Numerical experiments\ndemonstrate the potential of these approaches to improve solver performance in\nlarge-scale laser beam welding simulations.\n",
  "subjects": [
    "Computer Science/Computational Engineering, Finance, and Science",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Numerical Analysis",
    "Mathematics/Numerical Analysis"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "9mD6rSi0ywUE3BjjIvthpmH_CGORtXeOpWlnjqjpYwA",
  "pdfSize": "5067700"
}