{"id":"2412.14884","title":"Optimal design of interpolation methods for time-delay interferometry","authors":"Martin Staab, Jean-Baptiste Bayle, Olaf Hartwig, Aur\\'elien Hees, Marc\n  Lilley, Graham Woan, and Peter Wolf","authorsParsed":[["Staab","Martin",""],["Bayle","Jean-Baptiste",""],["Hartwig","Olaf",""],["Hees","Aurélien",""],["Lilley","Marc",""],["Woan","Graham",""],["Wolf","Peter",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 14:19:02 GMT"}],"updateDate":"2024-12-20","timestamp":1734617942000,"abstract":"  Time-delay interferometry (TDI) suppresses laser frequency noise by forming\nlinear combinations of time-shifted interferometric measurements. The\ntime-shift operation is implemented by interpolating discretely sampled data.\nTo enable in-band laser noise reduction by eight to nine orders of magnitude,\ninterpolation has to be performed with high accuracy. Optimizing the design of\nthose interpolation methods is the focus of this work. Previous research that\nstudied constant time-shifts suggested Lagrange interpolation as the\ninterpolation method for TDI. Its transfer function performs well at low\nfrequency but requires a high number of coefficients. Furthermore, when applied\nin TDI we observed prominent time-domain features when a time-varying shift\nscanned over a pure integer sample shift. To limit this effect we identify an\nadditional requirement for the interpolation kernel: when considering\ntime-varying shifts the interpolation kernel must be sufficiently smooth to\navoid unwanted time-domain transitions that produce glitch-like features in\npower spectral density estimates. The Lagrange interpolation kernel exhibits a\ndiscontinuous first derivative by construction, which is insufficient for the\napplication to LISA or other space-based GW observatories. As a solution we\npropose a novel design method for interpolation kernels that respect a\npredefined requirement on in-band interpolation residuals and that possess\ncontinuous derivatives up to a prescribed order. Using this method we show that\nan interpolation kernel with 22 coefficients is sufficient to respect LISA's\npicometre-requirement and to allow for a continuous first derivative which\nsuppresses the magnitude of the time-domain transition adequately. The\nreduction from 42 (Lagrange interpolation) to 22 coefficients enables us to\nsave computational cost and increases robustness against artefacts in the data.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ohKosDxXzDnwKdO8KQuHDpuhrVqmQ3qPypQ589IXXog","pdfSize":"1294384"}