{"id":"2412.19350","title":"On the Expressiveness and Length Generalization of Selective State-Space\n  Models on Regular Languages","authors":"Aleksandar Terzi\\'c, Michael Hersche, Giacomo Camposampiero, Thomas\n  Hofmann, Abu Sebastian, Abbas Rahimi","authorsParsed":[["Terzić","Aleksandar",""],["Hersche","Michael",""],["Camposampiero","Giacomo",""],["Hofmann","Thomas",""],["Sebastian","Abu",""],["Rahimi","Abbas",""]],"versions":[{"version":"v1","created":"Thu, 26 Dec 2024 20:53:04 GMT"}],"updateDate":"2024-12-30","timestamp":1735246384000,"abstract":"  Selective state-space models (SSMs) are an emerging alternative to the\nTransformer, offering the unique advantage of parallel training and sequential\ninference. Although these models have shown promising performance on a variety\nof tasks, their formal expressiveness and length generalization properties\nremain underexplored. In this work, we provide insight into the workings of\nselective SSMs by analyzing their expressiveness and length generalization\nperformance on regular language tasks, i.e., finite-state automaton (FSA)\nemulation. We address certain limitations of modern SSM-based architectures by\nintroducing the Selective Dense State-Space Model (SD-SSM), the first selective\nSSM that exhibits perfect length generalization on a set of various regular\nlanguage tasks using a single layer. It utilizes a dictionary of dense\ntransition matrices, a softmax selection mechanism that creates a convex\ncombination of dictionary matrices at each time step, and a readout consisting\nof layer normalization followed by a linear map. We then proceed to evaluate\nvariants of diagonal selective SSMs by considering their empirical performance\non commutative and non-commutative automata. We explain the experimental\nresults with theoretical considerations. Our code is available at\nhttps://github.com/IBM/selective-dense-state-space-model.\n","subjects":["Computer Science/Machine Learning","Computer Science/Artificial Intelligence","Computer Science/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"lrsyIXhao-W25wmOsOdSwXzBfCH1TPTrLts3LF7yymU","pdfSize":"508244"}