{
  "id": "2412.04654",
  "title": "Mutation mitigates finite-size effects in spatial evolutionary games",
  "authors": "Chen Shen, Zhixue He, Lei Shi, and Jun Tanimoto",
  "authorsParsed": [
    [
      "Shen",
      "Chen",
      ""
    ],
    [
      "He",
      "Zhixue",
      ""
    ],
    [
      "Shi",
      "Lei",
      ""
    ],
    [
      "Tanimoto",
      "Jun",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 22:51:11 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733439071000,
  "abstract": "  Agent-based simulations are essential for studying cooperation on spatial\nnetworks. However, finite-size effects -- random fluctuations due to limited\nnetwork sizes -- can cause certain strategies to unexpectedly dominate or\ndisappear, leading to unreliable outcomes. While enlarging network sizes or\ncarefully preparing initial states can reduce these effects, both approaches\nrequire significant computational resources. In this study, we demonstrate that\nincorporating mutation into simulations on limited networks offers an effective\nand resource-efficient alternative. Using spatial optional public goods games\nand a more intricate tolerance-based variant, we find that rare mutations\npreserve inherently stable equilibria. When equilibria are affected by\nfinite-size effects, introducing moderate mutation rates prevent\nfinite-size-induced strategy dominance or extinction, producing results\nconsistent with large-network simulations. Our findings position mutation as a\npractical tool for improving the reliability of agent-based models and\nemphasize the importance of mutation sensitivity analysis in managing\nfinite-size effects across spatial networks.\n",
  "subjects": [
    "Physics/Physics and Society",
    "Quantitative Biology/Populations and Evolution"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "9omX2KyhLTbo2kuchXVNrFB_L0dH5nlFhgMYk-CpfaA",
  "pdfSize": "2332003"
}