{
  "id": "2412.07798",
  "title": "High-contrast absorption magnetometry in the visible to near-infrared\n  range with nitrogen-vacancy ensembles",
  "authors": "Florian Schall, Felix A. Hahl, Lukas Lindner, Xavier Vidal, Tingpeng\n  Luo, Alexander M. Zaitsev, Takeshi Ohshima, Jan Jeske, R\\\"udiger Quay",
  "authorsParsed": [
    [
      "Schall",
      "Florian",
      ""
    ],
    [
      "Hahl",
      "Felix A.",
      ""
    ],
    [
      "Lindner",
      "Lukas",
      ""
    ],
    [
      "Vidal",
      "Xavier",
      ""
    ],
    [
      "Luo",
      "Tingpeng",
      ""
    ],
    [
      "Zaitsev",
      "Alexander M.",
      ""
    ],
    [
      "Ohshima",
      "Takeshi",
      ""
    ],
    [
      "Jeske",
      "Jan",
      ""
    ],
    [
      "Quay",
      "Rüdiger",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 11:10:55 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733483455000,
  "abstract": "  Magnetometry with nitrogen-vacancy (NV) centers has so far been measured via\nemission of light from NV centers or via absorption at the singlet transition\nat 1042 nm. Here, we demonstrate a phenomenon of broadband optical absorption\nby the NV centers starting in the emission wavelength and reaching up to 1000\nnm. The measurements are enabled by a high-finesse cavity, which is used for\nroom temperature continuous wave pump-probe experiments. The red to infrared\nprobe beam shows the typical optically detected magnetic resonance (ODMR)\nsignal of the NV spin with contrasts up to 42 %. This broadband optical\nabsorption is not yet reported in terms of NV magnetometry. We argue that the\nlower level of the absorbing transition could be the energetically lower NV\nsinglet state, based on the increased optical absorption for a resonant\nmicrowave field and the spectral behavior. Investigations of the\nphoton-shot-noise-limited sensitivity show improvements with increasing probe\nwavelength, reaching an optimum of 7.5 pT/$\\sqrt{\\mathrm{Hz}}$. The results\nshow significantly improved ODMR contrast compared to emission-based\nmagnetometry. This opens a new detection wavelength regime with coherent laser\nsignal detection for high-sensitivity NV magnetometry.\n",
  "subjects": [
    "Physics/Applied Physics",
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "CZQ0oWHiIS8_PV-YV5RaESh0LpfU-mwcam8ve3-rXiw",
  "pdfSize": "2310351"
}