{
  "id": "2412.12980",
  "title": "A Physics-Constrained Deep Learning Treatment of Runaway Electron\n  Dynamics",
  "authors": "Christopher J. McDevitt, Jonathan Arnaud, Xian-Zhu Tang",
  "authorsParsed": [
    [
      "McDevitt",
      "Christopher J.",
      ""
    ],
    [
      "Arnaud",
      "Jonathan",
      ""
    ],
    [
      "Tang",
      "Xian-Zhu",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 14:59:52 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734447592000,
  "abstract": "  An adjoint formulation leveraging a physics-informed neural network (PINN) is\nemployed to advance the density moment of a runaway electron (RE) distribution\nforward in time. A distinguishing feature of this approach is that once the\nadjoint problem is solved, its solution can be used to project the RE density\nforward in time for an arbitrary initial momentum space distribution of REs.\nFurthermore, by employing a PINN, a parametric solution to the adjoint problem\ncan be learned. Thus, once trained, this adjoint-deep learning framework is\nable to efficiently project the RE density forward in time across various\nplasma conditions while still including a fully kinetic description of RE\ndynamics. As an example application, the temporal evolution of the density of\nprimary electrons is studied, with particular emphasis on evaluating the decay\nof a RE population when below threshold. Predictions from the adjoint-deep\nlearning framework are found to be in good agreement with a traditional\nrelativistic electron Fokker-Planck solver, for several distinct initial\nconditions, and across an array of physics parameters. Once trained the PINN\nthus provides a means of generating RE density time histories with\nexceptionally low online execution time.\n",
  "subjects": [
    "Physics/Plasma Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "lB5_gJzqKe-qzYaw3N3Ttb1Dcl5__N8Lu-mTiubXUs0",
  "pdfSize": "1705318"
}