{"id":"2412.09038","title":"Width-independent and Robust Multimode Interference Waveguides Based on\n  Anomalous Bulk States","authors":"Lei Liu, Xiujuan Zhang, Ming-Hui Lu, Yan-Feng Chen","authorsParsed":[["Liu","Lei",""],["Zhang","Xiujuan",""],["Lu","Ming-Hui",""],["Chen","Yan-Feng",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 08:03:18 GMT"}],"updateDate":"2024-12-13","timestamp":1733990598000,"abstract":"  Multimode interference (MMI) is a fundamental physical principle that plays a\ncrucial role in modern communication technologies for wave splitting,\nfiltering, switching and multiplexing. Typically, the generation of multimodes\nis highly dependent on the waveguide's cross-section, particularly its width,\nby which the mode profiles and the interference patterns can be severely\naffected, leading to unstable MMI performance. Here, we realize\nwidth-independent and robust MMI waveguides. Our principle is based on the\nunique properties of multilayer graphene lattices. By properly modulating the\nboundary potential, this Dirac-type material supports anomalous bulk states\nwith uniform wavefunctions independent of the sample size. Benefited from such\nan anomaly, the bulk states in a waveguide formed by multiple layers of\ngraphene ribbons exhibit width-independent MMI. Enabled by this intriguing\ncharacterisitc, we construct 2*2 MMI waveguides using bilayer photonic and\nphononic crystals with graphene lattices. By precisely modulating their\nboundaries, the anomalous bulk states and correspondingly the width-independent\nMMI are achieved. Our experimental measurements show that the input wave energy\ntravelling through the MMI waveguide can be split into two outputs with a\nfrequency-tunable ratio, and due to the width-independent characteristic, the\nsplitter is robust to geometric perturbations. We further demonstrate stable\nMMI across multiple interconnects with stepped widths, allowing for high power\ncapacity while maintaining high coupling efficiency. Our approach successfully\ndecouples MMI performance from waveguide width, creating lateral degrees of\nfreedom that enable flexibly scalable and robust photonic, phononic, and\nelectronic integrated circuits for versatile MMI applications.\n","subjects":["Physics/Applied Physics","Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"VoHBWUsvqiC7vU-MNuGgkfL8mLfr0rKe1eWyrZEvZAQ","pdfSize":"5392238"}