{
  "id": "2412.11300",
  "title": "Generative AI as a lab partner: a case study",
  "authors": "Sebastian Kilde-Westberg and Andreas Johansson and Jonas Enger",
  "authorsParsed": [
    [
      "Kilde-Westberg",
      "Sebastian",
      ""
    ],
    [
      "Johansson",
      "Andreas",
      ""
    ],
    [
      "Enger",
      "Jonas",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 15 Dec 2024 20:20:48 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734294048000,
  "abstract": "  Generative AI tools, including the popular ChatGPT, have made a clear mark on\ndiscourses related to future work and education practices. Previous research in\nscience education has highlighted the potential for generative AI in various\neducation-related areas, including generating valuable discussion material,\nsolving physics problems, and acting as a tutor. However, little research has\nbeen done regarding the role of generative AI tools in laboratory work, an\nessential part of science education, and physics education specifically. Here\nwe show various ways in which high school students use ChatGPT during a physics\nlaboratory session and discuss the relevance of using generative AI tools to\ninvestigate acoustic levitation and the speed of sound in air. The findings\nshow agreement with previous research regarding the importance of educating\nstudents about the capabilities and limitations of using generative AI.\nContrasting fruitful and problematic interactions with ChatGPT during lab\nsessions with seven lab groups involving 19 high school students made it\npossible to identify that ChatGPT can be a helpful tool in the physics\nlaboratory. However, the teacher plays a crucial role in identifying students'\nneeds and capabilities of understanding the potential and limitations of\ngenerative AI. As such, our findings show that generative AI tools may handle\nsome questions and problems and thus demonstrate their potential to help\ndistribute teachers' workload more equitably during laboratory sessions.\nFinally, this study serves as an important point of discussion regarding the\nways in which students need support and training to efficiently utilize\ngenerative AI to further their learning of physics.\n",
  "subjects": [
    "Physics/Physics Education"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "G2ppFqgF6K3ROvQxr3-AOxlPhz5rZnXcTopZUjsYNq0",
  "pdfSize": "2801830"
}