{
  "id": "2412.18483",
  "title": "A region-wide, multi-year set of crop field boundary labels for Africa",
  "authors": "L.D. Estes, A. Wussah, M. Asipunu, M. Gathigi, P. Kova\\v{c}i\\v{c}, J.\n  Muhando, B.V. Yeboah, F.K. Addai, E.S. Akakpo, M.K. Allotey, P. Amkoya, E.\n  Amponsem, K.D. Donkoh, N. Ha, E. Heltzel, C. Juma, R. Mdawida, A. Miroyo, J.\n  Mucha, J. Mugami, F. Mwawaza, D.A. Nyarko, P. Oduor, K.N. Ohemeng, S.I.D.\n  Segbefia, T. Tumbula, F. Wambua, G.H. Xeflide, S. Ye, F. Yeboah",
  "authorsParsed": [
    [
      "Estes",
      "L. D.",
      ""
    ],
    [
      "Wussah",
      "A.",
      ""
    ],
    [
      "Asipunu",
      "M.",
      ""
    ],
    [
      "Gathigi",
      "M.",
      ""
    ],
    [
      "Kovačič",
      "P.",
      ""
    ],
    [
      "Muhando",
      "J.",
      ""
    ],
    [
      "Yeboah",
      "B. V.",
      ""
    ],
    [
      "Addai",
      "F. K.",
      ""
    ],
    [
      "Akakpo",
      "E. S.",
      ""
    ],
    [
      "Allotey",
      "M. K.",
      ""
    ],
    [
      "Amkoya",
      "P.",
      ""
    ],
    [
      "Amponsem",
      "E.",
      ""
    ],
    [
      "Donkoh",
      "K. D.",
      ""
    ],
    [
      "Ha",
      "N.",
      ""
    ],
    [
      "Heltzel",
      "E.",
      ""
    ],
    [
      "Juma",
      "C.",
      ""
    ],
    [
      "Mdawida",
      "R.",
      ""
    ],
    [
      "Miroyo",
      "A.",
      ""
    ],
    [
      "Mucha",
      "J.",
      ""
    ],
    [
      "Mugami",
      "J.",
      ""
    ],
    [
      "Mwawaza",
      "F.",
      ""
    ],
    [
      "Nyarko",
      "D. A.",
      ""
    ],
    [
      "Oduor",
      "P.",
      ""
    ],
    [
      "Ohemeng",
      "K. N.",
      ""
    ],
    [
      "Segbefia",
      "S. I. D.",
      ""
    ],
    [
      "Tumbula",
      "T.",
      ""
    ],
    [
      "Wambua",
      "F.",
      ""
    ],
    [
      "Xeflide",
      "G. H.",
      ""
    ],
    [
      "Ye",
      "S.",
      ""
    ],
    [
      "Yeboah",
      "F.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 24 Dec 2024 15:14:58 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1735053298000,
  "abstract": "  African agriculture is undergoing rapid transformation. Annual maps of crop\nfields are key to understanding the nature of this transformation, but such\nmaps are currently lacking and must be developed using advanced machine\nlearning models trained on high resolution remote sensing imagery. To enable\nthe development of such models, we delineated field boundaries in 33,746 Planet\nimages captured between 2017 and 2023 across the continent using a custom\nlabeling platform with built-in procedures for assessing and mitigating label\nerror. We collected 42,403 labels, including 7,204 labels arising from tasks\ndedicated to assessing label quality (Class 1 labels), 32,167 from sites mapped\nonce by a single labeller (Class 2) and 3,032 labels from sites where 3 or more\nlabellers were tasked to map the same location (Class 4). Class 1 labels were\nused to calculate labeller-specific quality scores, while Class 1 and 4 sites\nmapped by at least 3 labellers were used to further evaluate label uncertainty\nusing a Bayesian risk metric. Quality metrics showed that label quality was\nmoderately high (0.75) for measures of total field extent, but low regarding\nthe number of individual fields delineated (0.33), and the position of field\nedges (0.05). These values are expected when delineating small-scale fields in\n3-5 m resolution imagery, which can be too coarse to reliably distinguish\nsmaller fields, particularly in dense croplands, and therefore requires\nsubstantial labeller judgement. Nevertheless, previous work shows that such\nlabels can train effective field mapping models. Furthermore, this large,\nprobabilistic sample on its own provides valuable insight into regional\nagricultural characteristics, highlighting variations in the median field size\nand density. The imagery and vectorized labels along with quality information\nis available for download from two public repositories.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "B2_NVV7vyJ6JLu4wulSK7Sd9aWFq8NdT0cTrBt7e6ug",
  "pdfSize": "16883260"
}