{
  "id": "2412.08574",
  "title": "Learning Sketch Decompositions in Planning via Deep Reinforcement\n  Learning",
  "authors": "Michael Aichm\\\"uller, Hector Geffner",
  "authorsParsed": [
    [
      "Aichmüller",
      "Michael",
      ""
    ],
    [
      "Geffner",
      "Hector",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 17:45:31 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733939131000,
  "abstract": "  In planning and reinforcement learning, the identification of common subgoal\nstructures across problems is important when goals are to be achieved over long\nhorizons. Recently, it has been shown that such structures can be expressed as\nfeature-based rules, called sketches, over a number of classical planning\ndomains. These sketches split problems into subproblems which then become\nsolvable in low polynomial time by a greedy sequence of IW$(k)$ searches.\nMethods for learning sketches using feature pools and min-SAT solvers have been\ndeveloped, yet they face two key limitations: scalability and expressivity. In\nthis work, we address these limitations by formulating the problem of learning\nsketch decompositions as a deep reinforcement learning (DRL) task, where\ngeneral policies are sought in a modified planning problem where the successor\nstates of a state s are defined as those reachable from s through an IW$(k)$\nsearch. The sketch decompositions obtained through this method are\nexperimentally evaluated across various domains, and problems are regarded as\nsolved by the decomposition when the goal is reached through a greedy sequence\nof IW$(k)$ searches. While our DRL approach for learning sketch decompositions\ndoes not yield interpretable sketches in the form of rules, we demonstrate that\nthe resulting decompositions can often be understood in a crisp manner.\n",
  "subjects": [
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "SQfrer_27_OlKbC5MGQBE4TJp5oRA_mMr1x6inFPu0w",
  "pdfSize": "562793"
}