{
  "id": "2412.06874",
  "title": "Real-Time Performance Optimization of Travel Reservation Systems Using\n  AI and Microservices",
  "authors": "Biman Barua and M. Shamim Kaiser",
  "authorsParsed": [
    [
      "Barua",
      "Biman",
      ""
    ],
    [
      "Kaiser",
      "M. Shamim",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 16:08:22 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733760502000,
  "abstract": "  The rapid growth of the travel industry has increased the need for real-time\noptimization in reservation systems that could take care of huge data and\ntransaction volumes. This study proposes a hybrid framework that ut folds an\nArtificial Intelligence and a Microservices approach for the performance\noptimization of the system. The AI algorithms forecast demand patterns,\noptimize the allocation of resources, and enhance decision-making driven by\nMicroservices architecture, hence decentralizing system components for\nscalability, fault tolerance, and reduced downtime. The model provided focuses\non major problems associated with the travel reservation systems such as\nlatency of systems, load balancing and data consistency. It endows the systems\nwith predictive models based on AI improved ability to forecast user demands.\nMicroservices would also take care of different scales during uneven traffic\npatterns. Hence, both aspects ensure better handling of peak loads and spikes\nwhile minimizing delays and ensuring high service quality. A comparison was\nmade between traditional reservation models, which are monolithic and the new\nmodel of AI-Microservices. Comparatively, the analysis results state that there\nis a drastic improvement in processing times where the system uptime and\nresource utilization proved the capability of AI and the microservices in\ntransforming the travel industry in terms of reservation. This research work\nfocused on AI and Microservices towards real-time optimization, providing\ncritical insight into how to move forward with practical recommendations for\nupgrading travel reservation systems with this technology.\n",
  "subjects": [
    "Computer Science/Software Engineering",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Computational Engineering, Finance, and Science",
    "Computer Science/Computation and Language",
    "Computer Science/Programming Languages"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "BwtAvBU0yTT9KaceZt_7_h_Jr8QqsWNITiPXd4zGEaI",
  "pdfSize": "962746"
}