{
  "id": "2412.01858",
  "title": "MQFL-FHE: Multimodal Quantum Federated Learning Framework with Fully\n  Homomorphic Encryption",
  "authors": "Siddhant Dutta, Nouhaila Innan, Sadok Ben Yahia, Muhammad Shafique,\n  David Esteban Bernal Neira",
  "authorsParsed": [
    [
      "Dutta",
      "Siddhant",
      ""
    ],
    [
      "Innan",
      "Nouhaila",
      ""
    ],
    [
      "Yahia",
      "Sadok Ben",
      ""
    ],
    [
      "Shafique",
      "Muhammad",
      ""
    ],
    [
      "Neira",
      "David Esteban Bernal",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 30 Nov 2024 19:53:25 GMT"
    },
    {
      "version": "v2",
      "created": "Wed, 4 Dec 2024 05:35:17 GMT"
    },
    {
      "version": "v3",
      "created": "Thu, 5 Dec 2024 21:45:11 GMT"
    },
    {
      "version": "v4",
      "created": "Fri, 14 Feb 2025 09:45:24 GMT"
    }
  ],
  "updateDate": "2025-02-17",
  "timestamp": 1732996405000,
  "abstract": "  The integration of fully homomorphic encryption (FHE) in federated learning\n(FL) has led to significant advances in data privacy. However, during the\naggregation phase, it often results in performance degradation of the\naggregated model, hindering the development of robust representational\ngeneralization. In this work, we propose a novel multimodal quantum federated\nlearning framework that utilizes quantum computing to counteract the\nperformance drop resulting from FHE. For the first time in FL, our framework\ncombines a multimodal quantum mixture of experts (MQMoE) model with FHE,\nincorporating multimodal datasets for enriched representation and task-specific\nlearning. Our MQMoE framework enhances performance on multimodal datasets and\ncombined genomics and brain MRI scans, especially for underrepresented\ncategories. Our results also demonstrate that the quantum-enhanced approach\nmitigates the performance degradation associated with FHE and improves\nclassification accuracy across diverse datasets, validating the potential of\nquantum interventions in enhancing privacy in FL.\n",
  "subjects": [
    "Physics/Quantum Physics",
    "Computer Science/Cryptography and Security",
    "Computer Science/Distributed, Parallel, and Cluster Computing",
    "Computer Science/Emerging Technologies",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "ZyS5TK6RuM78X0wbFCJXpdZncDczC5FFLw7B0G9CPs4",
  "pdfSize": "3322799"
}