{
  "id": "2412.06897",
  "title": "Little iLocater: paving the way for iLocater",
  "authors": "Robert J. Harris, Jonathan Crass, Marshall C. Johnson, Andrew Bechter,\n  Jennifer Power, Ariadna Calcines Rosario, Justin R. Crepp, Eric Bechter,\n  Brian Sands, Derek Kopon, Steve Ertel, Santiago Barboza and Andrea Bianco",
  "authorsParsed": [
    [
      "Harris",
      "Robert J.",
      ""
    ],
    [
      "Crass",
      "Jonathan",
      ""
    ],
    [
      "Johnson",
      "Marshall C.",
      ""
    ],
    [
      "Bechter",
      "Andrew",
      ""
    ],
    [
      "Power",
      "Jennifer",
      ""
    ],
    [
      "Rosario",
      "Ariadna Calcines",
      ""
    ],
    [
      "Crepp",
      "Justin R.",
      ""
    ],
    [
      "Bechter",
      "Eric",
      ""
    ],
    [
      "Sands",
      "Brian",
      ""
    ],
    [
      "Kopon",
      "Derek",
      ""
    ],
    [
      "Ertel",
      "Steve",
      ""
    ],
    [
      "Barboza",
      "Santiago",
      ""
    ],
    [
      "Bianco",
      "Andrea",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 19:00:07 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733770807000,
  "abstract": "  Diffraction-limited radial velocity instruments offer a pathway towards\nimproved precision and stability, and the exploration of new parameter spaces\nat high spatial and spectral resolution. However, achieving the necessary\nperformance requires careful instrument design and considerable on-sky testing.\nWe describe the design and construction of ``Little iLocater'' (Lili), a\ncompact spectrograph that has been used to validate the performance of the\nfront-end fibre-injection system of the iLocater spectrograph. We present the\ndesign, assembly, and performance using on-sky data obtained at the Large\nBinocular Telescope (LBT), including extraction of spectra from standard stars,\ntesting of the atmospheric dispersion corrector to elevations of 40 degrees,\nand spatially resolved spectra from close companion systems. These results show\nthe front-end fibre-injection system is performing as expected and is\nindicative of iLocater's capabilities once installed at the LBT.\n",
  "subjects": [
    "Astrophysics/Instrumentation and Methods for Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "A1C0qYU3hXdEcQxE2WZVvKvzNYLpsBAunTgTOCE4YEs",
  "pdfSize": "2426796"
}