{
  "id": "2412.21111",
  "title": "Intrinsic meaning, perception, and matching",
  "authors": "William G. P. Mayner, Bj{\\o}rn Erik Juel, Giulio Tononi",
  "authorsParsed": [
    [
      "Mayner",
      "William G. P.",
      ""
    ],
    [
      "Juel",
      "Bjørn Erik",
      ""
    ],
    [
      "Tononi",
      "Giulio",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 30 Dec 2024 17:42:16 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 31 Dec 2024 21:18:41 GMT"
    }
  ],
  "updateDate": "2025-01-03",
  "timestamp": 1735580536000,
  "abstract": "  Integrated information theory (IIT) argues that the substrate of\nconsciousness is a maximally irreducible complex of units. Together, subsets of\nthe complex specify a cause-effect structure, composed of distinctions and\ntheir relations, which accounts in full for the quality of experience. The\nfeeling of a specific experience is also its meaning for the subject, which is\nthus defined intrinsically, regardless of whether the experience occurs in a\ndream or is triggered by processes in the environment. Here we extend IIT's\nframework to characterize the relationship between intrinsic meaning, extrinsic\nstimuli, and causal processes in the environment, illustrated using a simple\nmodel of a sensory hierarchy. We argue that perception should be considered as\na structured interpretation, where a stimulus from the environment acts merely\nas a trigger for the complex's state and the structure is provided by the\ncomplex's intrinsic connectivity. We also propose that perceptual\ndifferentiation - the richness and diversity of structures triggered by\nrepresentative sequences of stimuli - quantifies the meaningfulness of\ndifferent environments to a complex. In adaptive systems, this reflects the\n\"matching\" between intrinsic meanings and causal processes in an environment.\n",
  "subjects": [
    "Quantitative Biology/Neurons and Cognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "2xgcFfbKqQ55PYOcEhz0y9zdhA7Nv79-FOwAC9-eQk0",
  "pdfSize": "30496073"
}