{
  "id": "2412.11074",
  "title": "Adapter-Enhanced Semantic Prompting for Continual Learning",
  "authors": "Baocai Yin, Ji Zhao, Huajie Jiang, Ningning Hou, Yongli Hu, Amin\n  Beheshti, Ming-Hsuan Yang, Yuankai Qi",
  "authorsParsed": [
    [
      "Yin",
      "Baocai",
      ""
    ],
    [
      "Zhao",
      "Ji",
      ""
    ],
    [
      "Jiang",
      "Huajie",
      ""
    ],
    [
      "Hou",
      "Ningning",
      ""
    ],
    [
      "Hu",
      "Yongli",
      ""
    ],
    [
      "Beheshti",
      "Amin",
      ""
    ],
    [
      "Yang",
      "Ming-Hsuan",
      ""
    ],
    [
      "Qi",
      "Yuankai",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 15 Dec 2024 06:14:55 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734243295000,
  "abstract": "  Continual learning (CL) enables models to adapt to evolving data streams. A\nmajor challenge of CL is catastrophic forgetting, where new knowledge will\noverwrite previously acquired knowledge. Traditional methods usually retain the\npast data for replay or add additional branches in the model to learn new\nknowledge, which has high memory requirements. In this paper, we propose a\nnovel lightweight CL framework, Adapter-Enhanced Semantic Prompting (AESP),\nwhich integrates prompt tuning and adapter techniques. Specifically, we design\nsemantic-guided prompts to enhance the generalization ability of visual\nfeatures and utilize adapters to efficiently fuse the semantic information,\naiming to learn more adaptive features for the continual learning task.\nFurthermore, to choose the right task prompt for feature adaptation, we have\ndeveloped a novel matching mechanism for prompt selection. Extensive\nexperiments on three CL datasets demonstrate that our approach achieves\nfavorable performance across multiple metrics, showing its potential for\nadvancing CL.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Fl92-ZBY-wiLeRAk4PdV4qmTNcfi7BTcfF6JBmNGQXo",
  "pdfSize": "1176012"
}