{
  "id": "2412.09448",
  "title": "DumpyOS: A Data-Adaptive Multi-ary Index for Scalable Data Series\n  Similarity Search",
  "authors": "Zeyu Wang, Qitong Wang, Peng Wang, Themis Palpanas, Wei Wang",
  "authorsParsed": [
    [
      "Wang",
      "Zeyu",
      ""
    ],
    [
      "Wang",
      "Qitong",
      ""
    ],
    [
      "Wang",
      "Peng",
      ""
    ],
    [
      "Palpanas",
      "Themis",
      ""
    ],
    [
      "Wang",
      "Wei",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 17:04:35 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1734023075000,
  "abstract": "  Data series indexes are necessary for managing and analyzing the increasing\namounts of data series collections that are nowadays available. These indexes\nsupport both exact and approximate similarity search, with approximate search\nproviding high-quality results within milliseconds, which makes it very\nattractive for certain modern applications. Reducing the pre-processing (i.e.,\nindex building) time and improving the accuracy of search results are two major\nchallenges. DSTree and the iSAX index family are state-of-the-art solutions for\nthis problem. However, DSTree suffers from long index building times, while\niSAX suffers from low search accuracy. In this paper, we identify two problems\nof the iSAX index family that adversely affect the overall performance. First,\nwe observe the presence of a proximity-compactness trade-off related to the\nindex structure design (i.e., the node fanout degree), significantly limiting\nthe efficiency and accuracy of the resulting index. Second, a skewed data\ndistribution will negatively affect the performance of iSAX. To overcome these\nproblems, we propose Dumpy, an index that employs a novel multi-ary data\nstructure with an adaptive node splitting algorithm and an efficient building\nworkflow. Furthermore, we devise Dumpy-Fuzzy as a variant of Dumpy which\nfurther improves search accuracy by proper duplication of series. To fully\nleverage the potential of modern hardware including multicore CPUs and Solid\nState Drives (SSDs), we parallelize Dumpy to DumpyOS with sophisticated\nindexing and pruning-based querying algorithms. An optimized approximate search\nalgorithm, DumpyOS-F which prominently improves the search accuracy without\nviolating the index, is also proposed.\n",
  "subjects": [
    "Computer Science/Databases"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "2lp1VMAfWfnpT3HQQ8lmqIoxN_eYa-JU3-1qJq7A29A",
  "pdfSize": "4474852"
}