{"id":"2412.11641","title":"Comparison of three reconstruction algorithms for low-dose\n  phase-contrast computed tomography of the breast with synchrotron radiation","authors":"Sandro Donato, Simone Caputo, Luca Brombal, Bruno Golosio, Renata\n  Longo, Giuliana Tromba, Raffaele G. Agostino, Gianluigi Greco, Benedicta D.\n  Arhatari, Chris Hall, Anton Maksimenko, Daniel Hausermann, Darren Lockie,\n  Jane Fox, Beena Kumar, Sarah Lewis, Patrick C. Brennan, Harry M. Quiney,\n  Seyedamir Tavakoli Taba, and Timur E. Gureyev","authorsParsed":[["Donato","Sandro",""],["Caputo","Simone",""],["Brombal","Luca",""],["Golosio","Bruno",""],["Longo","Renata",""],["Tromba","Giuliana",""],["Agostino","Raffaele G.",""],["Greco","Gianluigi",""],["Arhatari","Benedicta D.",""],["Hall","Chris",""],["Maksimenko","Anton",""],["Hausermann","Daniel",""],["Lockie","Darren",""],["Fox","Jane",""],["Kumar","Beena",""],["Lewis","Sarah",""],["Brennan","Patrick C.",""],["Quiney","Harry M.",""],["Taba","Seyedamir Tavakoli",""],["Gureyev","Timur E.",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 10:37:44 GMT"}],"updateDate":"2024-12-17","timestamp":1734345464000,"abstract":"  Three different computed tomography (CT) reconstruction algorithms: Filtered\nBack Projection (FBP), Unified Tomographic Reconstruction (UTR) and customized\nSimultaneous Algebraic Reconstruction Technique (cSART), have been\nsystematically compared and evaluated using experimental data from CT scans of\nten fresh mastectomy samples collected at the Imaging and Medical beamline of\nthe Australian Synchrotron. All the scans were collected at the mean glandular\ndose of 2 mGy, using monochromatic X-rays with 32 keV energy, flat-panel\ndetectors with 0.1 mm pixels and 6 meter distance between the rotation stage\nand the detector. Paganin's phase retrieval method was used in conjunction with\nall three CT reconstruction algorithms. The reconstructed images were compared\nin terms of the objective image quality characteristics, including spatial\nresolution, contrast, signal-to-noise, and contrast-to-noise ratios. The images\nwere also evaluated by seven experienced medical imaging specialists, rating\nperceptible contrast, sharpness of tissue interfaces, image noise,\ncalcification visibility and overall image quality. Of the three compared\nalgorithms, cSART was clearly superior to UTR and FBP in terms of most measured\nobjective image quality characteristics. At the same time, the results of the\nsubjective quality evaluation consistently favoured the images reconstructed by\nFBP, followed by UTR, with cSART receiving lower scores on average. We argue\nthat this apparent disagreement between the objective and subjective\nassessments of image quality can be explained by the importance assigned to\nimage contrast in the subjective assessment, while the signal-to-noise ratio\nseemed to receive relatively low weighting. This study was conducted in\npreparation for phase-contrast breast CT imaging of live patients at Australian\nSynchrotron (Melbourne, Australia).\n","subjects":["Physics/Medical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"EKvVNUwk0UWXi9bRc_dvDaCmHqWtKw-7ZEkAem3C1pI","pdfSize":"2214909"}