{"id":"2412.00728","title":"Integrated simulation of cavity design and radiation transport codes\n  (ACE3P + Geant4)","authors":"Lixin Ge, Zenghai Li, Cho-Kuen Ng, Liling Xiao (SLAC, Stanford, CA,\n  USA), Hiroyasu Ego, Yoshinori Enomoto, Hiroshi Iwase, Yu Morikawa, Takashi\n  Yoshimoto (KEK, Tsukuba, Ibaraki, Japan)","authorsParsed":[["Ge","Lixin","","SLAC, Stanford, CA,\n  USA"],["Li","Zenghai","","SLAC, Stanford, CA,\n  USA"],["Ng","Cho-Kuen","","SLAC, Stanford, CA,\n  USA"],["Xiao","Liling","","SLAC, Stanford, CA,\n  USA"],["Ego","Hiroyasu","","KEK, Tsukuba, Ibaraki, Japan"],["Enomoto","Yoshinori","","KEK, Tsukuba, Ibaraki, Japan"],["Iwase","Hiroshi","","KEK, Tsukuba, Ibaraki, Japan"],["Morikawa","Yu","","KEK, Tsukuba, Ibaraki, Japan"],["Yoshimoto","Takashi","","KEK, Tsukuba, Ibaraki, Japan"]],"versions":[{"version":"v1","created":"Sun, 1 Dec 2024 08:39:30 GMT"}],"updateDate":"2024-12-03","timestamp":1733042370000,"abstract":"  A simulation workflow has been developed to study dark current (DC) radiation\neffects using ACE3P and Geant4. The integrated workflow interfaces particle\ndata transfer and geometry between the electromagnetic (EM) cavity simulation\ncode ACE3P and the radiation code Geant4, targeting large-scale problems using\nhigh-performance computing. The process begins by calculating the operating\nmode in the vacuum region of an accelerator structure and tracking\nfield-emitted electrons influenced by the EM fields of the mode calculated by\nACE3P. It then transfers particle data at the vacuum-wall interface for\nsubsequent radiation calculations within the wall enclosure materials through\nGeant4 calculation. The whole integrated simulation workflow will be\ndemonstrated through large-scale dark current radiation calculations for the\nKEK 56-cell traveling-wave structure, and the efficiency of performing these\nsimulations on the NERSC supercomputer Perlmutter will be presented.\n","subjects":["Physics/Computational Physics","Physics/Accelerator Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"OfqnOnGF-Ht_tIRxA0GPMnrRKWuVzNVsEksLJR9EeDY","pdfSize":"2796483"}