{
  "id": "2412.04018",
  "title": "Modeling the astrosphere of LHS~1140",
  "authors": "K. Scherer, K. Herbst, N.E. Engelbrecht, S.E.S. Ferreira, J. Kleimann,\n  J. Light",
  "authorsParsed": [
    [
      "Scherer",
      "K.",
      ""
    ],
    [
      "Herbst",
      "K.",
      ""
    ],
    [
      "Engelbrecht",
      "N. E.",
      ""
    ],
    [
      "Ferreira",
      "S. E. S.",
      ""
    ],
    [
      "Kleimann",
      "J.",
      ""
    ],
    [
      "Light",
      "J.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 09:54:05 GMT"
    }
  ],
  "updateDate": "2025-02-12",
  "timestamp": 1733392445000,
  "abstract": "  The cosmic ray (CR) flux, as well as the hydrogen flux into the atmosphere of\nan exoplanet, can change the composition of the atmosphere. Here, we present\nthe CR and hydrogen flux on top of the atmosphere. To do so, we have to study\nthe 3D multifluid MHD structure of astrospheres. We discuss the shock structure\nof the stellar wind of LHS 1140 using four different models: HD and MHD\nsingle-fluid models, as well as multifluid models for both cases, including a\nneutral hydrogen flow from the interstellar medium. The CR flux in a multifluid\nmodel as well as the ionization rate in an exoplanetary atmosphere are also\npresented. The astrosphere is modeled using the 3D Cronos code, while the CR\nflux at LHS 1140 b is calculated using both a 1D and a 3D stochastic galactic\nCR modulation code. Finally, the atmospheric ionization and radiation dose is\nestimated using the AtRIS code. Results. It is shown that the 3D multifluid\npositions of the termination shock differ remarkably from those found in the 3D\nideal-single fluid hydrodynamic case. CR fluxes computed using a 1D approach\nare completely different from those calculated using the 3D modulation code and\nshow an essentially unmodulated spectrum at the exoplanet in question.\nUtilizing these spectra, ionization rates and radiation exposure within the\natmosphere of LHS 1140 b are derived. The termination shock, astropause, and\nbow shock distances must be taken from the 3D multifluid MHD model to determine\nthe CR fluxes correctly. Moreover, because of the tiny astrosphere, the\nexoplanet is submerged in the neutral hydrogen flow of the interstellar medium,\nwhich will influence the exoplanetary atmosphere. A 3D approach to Galactic\\0\ncosmic ray (GCR) modulation in astrospheres is also necessary to avoid\nunrealistic estimates of GCR intensities.\n",
  "subjects": [
    "Astrophysics/Solar and Stellar Astrophysics",
    "Astrophysics/Earth and Planetary Astrophysics",
    "Astrophysics/High Energy Astrophysical Phenomena"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "YCJeKoLN-JcDdhQrcqNdgaGo7mm0FI3S_zDIgt9M9s4",
  "pdfSize": "936912"
}