{"id":"2412.19713","title":"ProKAN: Progressive Stacking of Kolmogorov-Arnold Networks for Efficient\n  Liver Segmentation","authors":"Bhavesh Gyanchandani, Aditya Oza and Abhinav Roy","authorsParsed":[["Gyanchandani","Bhavesh",""],["Oza","Aditya",""],["Roy","Abhinav",""]],"versions":[{"version":"v1","created":"Fri, 27 Dec 2024 16:14:06 GMT"}],"updateDate":"2024-12-30","timestamp":1735316046000,"abstract":"  The growing need for accurate and efficient 3D identification of tumors,\nparticularly in liver segmentation, has spurred considerable research into deep\nlearning models. While many existing architectures offer strong performance,\nthey often face challenges such as overfitting and excessive computational\ncosts. An adjustable and flexible architecture that strikes a balance between\ntime efficiency and model complexity remains an unmet requirement. In this\npaper, we introduce proKAN, a progressive stacking methodology for\nKolmogorov-Arnold Networks (KANs) designed to address these challenges. Unlike\ntraditional architectures, proKAN dynamically adjusts its complexity by\nprogressively adding KAN blocks during training, based on overfitting behavior.\nThis approach allows the network to stop growing when overfitting is detected,\npreventing unnecessary computational overhead while maintaining high accuracy.\nAdditionally, proKAN utilizes KAN's learnable activation functions modeled\nthrough B-splines, which provide enhanced flexibility in learning complex\nrelationships in 3D medical data. Our proposed architecture achieves\nstate-of-the-art performance in liver segmentation tasks, outperforming\nstandard Multi-Layer Perceptrons (MLPs) and fixed KAN architectures. The\ndynamic nature of proKAN ensures efficient training times and high accuracy\nwithout the risk of overfitting. Furthermore, proKAN provides better\ninterpretability by allowing insight into the decision-making process through\nits learnable coefficients. The experimental results demonstrate a significant\nimprovement in accuracy, Dice score, and time efficiency, making proKAN a\ncompelling solution for 3D medical image segmentation tasks.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computer Science/Computer Vision and Pattern Recognition","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"3gVR_zLqKMbki8cn7_qtvNzY8rju7iKuj7AS3szDi34","pdfSize":"700511"}