{
  "id": "2412.20637",
  "title": "Knowledge Editing for Large Language Model with Knowledge Neuronal\n  Ensemble",
  "authors": "Yongchang Li, Yujin Zhu, Tao Yan, Shijian Fan, Gang Wu, Liang Xu",
  "authorsParsed": [
    [
      "Li",
      "Yongchang",
      ""
    ],
    [
      "Zhu",
      "Yujin",
      ""
    ],
    [
      "Yan",
      "Tao",
      ""
    ],
    [
      "Fan",
      "Shijian",
      ""
    ],
    [
      "Wu",
      "Gang",
      ""
    ],
    [
      "Xu",
      "Liang",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 30 Dec 2024 00:58:00 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735520280000,
  "abstract": "  As real-world knowledge is constantly evolving, ensuring the timeliness and\naccuracy of a model's knowledge is crucial. This has made knowledge editing in\nlarge language models increasingly important. However, existing knowledge\nediting methods face several challenges, including parameter localization\ncoupling, imprecise localization, and a lack of dynamic interaction across\nlayers. In this paper, we propose a novel knowledge editing method called\nKnowledge Neuronal Ensemble (KNE). A knowledge neuronal ensemble represents a\ngroup of neurons encoding specific knowledge, thus mitigating the issue of\nfrequent parameter modification caused by coupling in parameter localization.\nThe KNE method enhances the precision and accuracy of parameter localization by\ncomputing gradient attribution scores for each parameter at each layer. During\nthe editing process, only the gradients and losses associated with the\nknowledge neuronal ensemble are computed, with error backpropagation performed\naccordingly, ensuring dynamic interaction and collaborative updates among\nparameters. Experimental results on three widely used knowledge editing\ndatasets show that the KNE method significantly improves the accuracy of\nknowledge editing and achieves, or even exceeds, the performance of the best\nbaseline methods in portability and locality metrics.\n",
  "subjects": [
    "Computer Science/Computation and Language"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "fE06ZTtQMtJwoH7-gBDf5YB4qr0KvWKwkitic_Pkqf0",
  "pdfSize": "1875365"
}