{"id":"2412.08344","title":"CoDTS: Enhancing Sparsely Supervised Collaborative Perception with a\n  Dual Teacher-Student Framework","authors":"Yushan Han, Hui Zhang, Honglei Zhang, Jing Wang, Yidong Li","authorsParsed":[["Han","Yushan",""],["Zhang","Hui",""],["Zhang","Honglei",""],["Wang","Jing",""],["Li","Yidong",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 12:34:37 GMT"},{"version":"v2","created":"Thu, 12 Dec 2024 09:52:55 GMT"},{"version":"v3","created":"Tue, 21 Jan 2025 12:30:57 GMT"}],"updateDate":"2025-01-22","timestamp":1733920477000,"abstract":"  Current collaborative perception methods often rely on fully annotated\ndatasets, which can be expensive to obtain in practical situations. To reduce\nannotation costs, some works adopt sparsely supervised learning techniques and\ngenerate pseudo labels for the missing instances. However, these methods fail\nto achieve an optimal confidence threshold that harmonizes the quality and\nquantity of pseudo labels. To address this issue, we propose an end-to-end\nCollaborative perception Dual Teacher-Student framework (CoDTS), which employs\nadaptive complementary learning to produce both high-quality and high-quantity\npseudo labels. Specifically, the Main Foreground Mining (MFM) module generates\nhigh-quality pseudo labels based on the prediction of the static teacher.\nSubsequently, the Supplement Foreground Mining (SFM) module ensures a balance\nbetween the quality and quantity of pseudo labels by adaptively identifying\nmissing instances based on the prediction of the dynamic teacher. Additionally,\nthe Neighbor Anchor Sampling (NAS) module is incorporated to enhance the\nrepresentation of pseudo labels. To promote the adaptive complementary\nlearning, we implement a staged training strategy that trains the student and\ndynamic teacher in a mutually beneficial manner. Extensive experiments\ndemonstrate that the CoDTS effectively ensures an optimal balance of pseudo\nlabels in both quality and quantity, establishing a new state-of-the-art in\nsparsely supervised collaborative perception.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Vz_mshTyssiO6Uu-XE2vC7HMcXnrOKO5qGjYBksNO5s","pdfSize":"10719473"}