{"id":"2412.15308","title":"ViFactCheck: A New Benchmark Dataset and Methods for Multi-domain News\n  Fact-Checking in Vietnamese","authors":"Tran Thai Hoa, Tran Quang Duy, Khanh Quoc Tran, Kiet Van Nguyen","authorsParsed":[["Hoa","Tran Thai",""],["Duy","Tran Quang",""],["Tran","Khanh Quoc",""],["Van Nguyen","Kiet",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 13:41:59 GMT"}],"updateDate":"2024-12-23","timestamp":1734615719000,"abstract":"  The rapid spread of information in the digital age highlights the critical\nneed for effective fact-checking tools, particularly for languages with limited\nresources, such as Vietnamese. In response to this challenge, we introduce\nViFactCheck, the first publicly available benchmark dataset designed\nspecifically for Vietnamese fact-checking across multiple online news domains.\nThis dataset contains 7,232 human-annotated pairs of claim-evidence\ncombinations sourced from reputable Vietnamese online news, covering 12 diverse\ntopics. It has been subjected to a meticulous annotation process to ensure high\nquality and reliability, achieving a Fleiss Kappa inter-annotator agreement\nscore of 0.83. Our evaluation leverages state-of-the-art pre-trained and large\nlanguage models, employing fine-tuning and prompting techniques to assess\nperformance. Notably, the Gemma model demonstrated superior effectiveness, with\nan impressive macro F1 score of 89.90%, thereby establishing a new standard for\nfact-checking benchmarks. This result highlights the robust capabilities of\nGemma in accurately identifying and verifying facts in Vietnamese. To further\npromote advances in fact-checking technology and improve the reliability of\ndigital media, we have made the ViFactCheck dataset, model checkpoints,\nfact-checking pipelines, and source code freely available on GitHub. This\ninitiative aims to inspire further research and enhance the accuracy of\ninformation in low-resource languages.\n","subjects":["Computer Science/Computation and Language","Computer Science/Information Retrieval"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"1OfwpNsCmQKtjuW-qJB-PhWQSpRsociYXwWsfxfwzXo","pdfSize":"6180387"}