{
  "id": "2412.16669",
  "title": "Label Privacy in Split Learning for Large Models with\n  Parameter-Efficient Training",
  "authors": "Philip Zmushko, Marat Mansurov, Ruslan Svirschevski, Denis Kuznedelev,\n  Max Ryabinin, Aleksandr Beznosikov",
  "authorsParsed": [
    [
      "Zmushko",
      "Philip",
      ""
    ],
    [
      "Mansurov",
      "Marat",
      ""
    ],
    [
      "Svirschevski",
      "Ruslan",
      ""
    ],
    [
      "Kuznedelev",
      "Denis",
      ""
    ],
    [
      "Ryabinin",
      "Max",
      ""
    ],
    [
      "Beznosikov",
      "Aleksandr",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 21 Dec 2024 15:32:03 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734795123000,
  "abstract": "  As deep learning models become larger and more expensive, many practitioners\nturn to fine-tuning APIs. These web services allow fine-tuning a model between\ntwo parties: the client that provides the data, and the server that hosts the\nmodel. While convenient, these APIs raise a new concern: the data of the client\nis at risk of privacy breach during the training procedure. This challenge\npresents an important practical case of vertical federated learning, where the\ntwo parties perform parameter-efficient fine-tuning (PEFT) of a large model. In\nthis study, we systematically search for a way to fine-tune models over an API\nwhile keeping the labels private. We analyze the privacy of LoRA, a popular\napproach for parameter-efficient fine-tuning when training over an API. Using\nthis analysis, we propose P$^3$EFT, a multi-party split learning algorithm that\ntakes advantage of existing PEFT properties to maintain privacy at a lower\nperformance overhead. To validate our algorithm, we fine-tune\nDeBERTa-v2-XXLarge, Flan-T5 Large and LLaMA-2 7B using LoRA adapters on a range\nof NLP tasks. We find that P$^3$EFT is competitive with existing\nprivacy-preserving methods in multi-party and two-party setups while having\nhigher accuracy.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Cryptography and Security"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "1Y4OKSCYGETkIN292guIddpY_hd4SYTXvCfilKIKork",
  "pdfSize": "836739"
}