{"id":"2412.02996","title":"CLAS: A Machine Learning Enhanced Framework for Exploring Large 3D\n  Design Datasets","authors":"XiuYu Zhang, Xiaolei Ye, Jui-Che Chang, Yue Fang","authorsParsed":[["Zhang","XiuYu",""],["Ye","Xiaolei",""],["Chang","Jui-Che",""],["Fang","Yue",""]],"versions":[{"version":"v1","created":"Wed, 4 Dec 2024 03:29:56 GMT"}],"updateDate":"2024-12-05","timestamp":1733282996000,"abstract":"  Three-dimensional (3D) objects have wide applications. Despite the growing\ninterest in 3D modeling in academia and industries, designing and/or creating\n3D objects from scratch remains time-consuming and challenging. With the\ndevelopment of generative artificial intelligence (AI), designers discover a\nnew way to create images for ideation. However, generative AIs are less useful\nin creating 3D objects with satisfying qualities. To allow 3D designers to\naccess a wide range of 3D objects for creative activities based on their\nspecific demands, we propose a machine learning (ML) enhanced framework CLAS -\nnamed after the four-step of capture, label, associate, and search - to enable\nfully automatic retrieval of 3D objects based on user specifications leveraging\nthe existing datasets of 3D objects. CLAS provides an effective and efficient\nmethod for any person or organization to benefit from their existing but not\nutilized 3D datasets. In addition, CLAS may also be used to produce\nhigh-quality 3D object synthesis datasets for training and evaluating 3D\ngenerative models. As a proof of concept, we created and showcased a search\nsystem with a web user interface (UI) for retrieving 6,778 3D objects of chairs\nin the ShapeNet dataset powered by CLAS. In a close-set retrieval setting, our\nretrieval method achieves a mean reciprocal rank (MRR) of 0.58, top 1 accuracy\nof 42.27%, and top 10 accuracy of 89.64%.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Human-Computer Interaction","Computer Science/Information Retrieval"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_YJZQwzWYKpW1KkZEzo5eufLkQbFDrKqViQ8n7KArMY","pdfSize":"10799204"}