{
  "id": "2412.03896",
  "title": "Multi-scale phylodynamic modelling of rapid punctuated pathogen\n  evolution",
  "authors": "Quang Dang Nguyen, Sheryl L. Chang, Carl J. E. Suster, Rebecca J.\n  Rockett, Vitali Sintchenko, Tania C. Sorrell, Mikhail Prokopenko",
  "authorsParsed": [
    [
      "Nguyen",
      "Quang Dang",
      ""
    ],
    [
      "Chang",
      "Sheryl L.",
      ""
    ],
    [
      "Suster",
      "Carl J. E.",
      ""
    ],
    [
      "Rockett",
      "Rebecca J.",
      ""
    ],
    [
      "Sintchenko",
      "Vitali",
      ""
    ],
    [
      "Sorrell",
      "Tania C.",
      ""
    ],
    [
      "Prokopenko",
      "Mikhail",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 06:10:17 GMT"
    },
    {
      "version": "v2",
      "created": "Sat, 7 Dec 2024 00:43:54 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733379017000,
  "abstract": "  Computational multi-scale pandemic modelling remains a major and timely\nchallenge. Here we identify specific requirements for a new class of pandemic\nmodels operating across three scales: (1) rapid pathogen evolution, punctuated\nby emergence of new variants, (2) human interactions within a heterogeneous\npopulation, and (3) public health responses which constrain individual actions\nto control the disease transmission. We then present a pandemic modelling\nframework satisfying these requirements and capable of simulating multi-scale\ndynamic feedback loops. The developed framework comprises a stochastic\nagent-based model of pandemic spread, coupled with a phylodynamic model of the\nwithin-host pathogen evolution. It is validated with a case study, modelling a\nrapid punctuated evolution of SARS-CoV-2, based on global and contemporary\ngenomic surveillance data, during the COVID-19 transmission within a large\nheterogeneous population. We demonstrate that the model captures the essential\nfeatures of the COVID-19 pandemic and the novel coronavirus evolution, while\nretaining computational tractability and scalability.\n",
  "subjects": [
    "Quantitative Biology/Populations and Evolution"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "wfW2MiVttFhHLi4HevQ8HXdCc7JeopnSZ6y_9WDfoGk",
  "pdfSize": "18368573"
}