{
  "id": "2412.10954",
  "title": "Structured position-momentum entangled two-photon fields",
  "authors": "Radhika Prasad, Sanjana Wanare, Suman Karan, Mritunjay K. Joshi,\n  Abhinandan Bhattacharjee, and Anand K. Jha",
  "authorsParsed": [
    [
      "Prasad",
      "Radhika",
      ""
    ],
    [
      "Wanare",
      "Sanjana",
      ""
    ],
    [
      "Karan",
      "Suman",
      ""
    ],
    [
      "Joshi",
      "Mritunjay K.",
      ""
    ],
    [
      "Bhattacharjee",
      "Abhinandan",
      ""
    ],
    [
      "Jha",
      "Anand K.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 14 Dec 2024 20:16:13 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734207373000,
  "abstract": "  Structured optical fields have led to several ground-breaking techniques in\nclassical imaging and microscopy. At the same time, in the quantum domain,\nposition-momentum entangled photon fields have been shown to have several\nunique features that can lead to beyond-classical imaging and microscopy\ncapabilities. Therefore, it is natural to expect that position-momentum\nentangled two-photon fields that are structured can push the boundaries of\nquantum imaging and microscopy even further beyond. Nonetheless, the existing\nexperimental schemes are able to produce either structured two-photon fields\nwithout position-momentum entanglement, or position-momentum entangled\ntwo-photon fields without structures. In this article, by manipulating the\nphase-matching condition of the spontaneous parametric down-conversion process,\nwe report experimental generation of two-photon fields with various structures\nin their spatial correlations. We experimentally measure the minimum bound on\nthe entanglement of formation and thereby verify the position-momentum\nentanglement of the structured two-photon field. We expect this work to have\nimportant implications for quantum technologies related to imaging and sensing.\n",
  "subjects": [
    "Physics/Quantum Physics",
    "Physics/Optics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "0raq34x_mgtKFfMBgGsgm-jNxmDGSGbEvKn4QYk04ZU",
  "pdfSize": "4880123"
}