{
  "id": "2412.19765",
  "title": "From Ceilings to Walls: Universal Dynamic Perching of Small Aerial\n  Robots on Surfaces with Variable Orientations",
  "authors": "Bryan Habas, Aaron Brown, Donghyeon Lee, Mitchell Goldman, and Bo\n  Cheng",
  "authorsParsed": [
    [
      "Habas",
      "Bryan",
      ""
    ],
    [
      "Brown",
      "Aaron",
      ""
    ],
    [
      "Lee",
      "Donghyeon",
      ""
    ],
    [
      "Goldman",
      "Mitchell",
      ""
    ],
    [
      "Cheng",
      "Bo",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 27 Dec 2024 17:53:01 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735321981000,
  "abstract": "  This work demonstrates universal dynamic perching capabilities for quadrotors\nof various sizes and on surfaces with different orientations. By employing a\nnon-dimensionalization framework and deep reinforcement learning, we\nsystematically assessed how robot size and surface orientation affect landing\ncapabilities. We hypothesized that maintaining geometric proportions across\ndifferent robot scales ensures consistent perching behavior, which was\nvalidated in both simulation and experimental tests. Additionally, we\ninvestigated the effects of joint stiffness and damping in the landing gear on\nperching behaviors and performance. While joint stiffness had minimal impact,\njoint damping ratios influenced landing success under vertical approaching\nconditions. The study also identified a critical velocity threshold necessary\nfor successful perching, determined by the robot's maneuverability and leg\ngeometry. Overall, this research advances robotic perching capabilities,\noffering insights into the role of mechanical design and scaling effects, and\nlays the groundwork for future drone autonomy and operational efficiency in\nunstructured environments.\n",
  "subjects": [
    "Computer Science/Robotics",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "9JJP50JcVyDDX-RrBQX461PFW3RLmbJCboipxJJHqnw",
  "pdfSize": "3514009"
}