{
  "id": "2412.03810",
  "title": "Computing sessile droplet shapes on arbitrary surfaces with a new\n  pairwise force smoothed particle hydrodynamics model",
  "authors": "Riley M Whebell, Timothy J Moroney, Ian W Turner, Ravindra\n  Pethiyagoda, Scott W McCue",
  "authorsParsed": [
    [
      "Whebell",
      "Riley M",
      ""
    ],
    [
      "Moroney",
      "Timothy J",
      ""
    ],
    [
      "Turner",
      "Ian W",
      ""
    ],
    [
      "Pethiyagoda",
      "Ravindra",
      ""
    ],
    [
      "McCue",
      "Scott W",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 02:06:42 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733364402000,
  "abstract": "  The study of the shape of droplets on surfaces is an important problem in the\nphysics of fluids and has applications in multiple industries, from\nagrichemical spraying to microfluidic devices. Motivated by these real-world\napplications, computational predictions for droplet shapes on complex\nsubstrates -- rough and chemically heterogeneous surfaces -- are desired.\nGrid-based discretisations in axisymmetric coordinates form the basis of\nwell-established numerical solution methods in this area, but when the problem\nis not axisymmetric, the shape of the contact line and the distribution of the\ncontact angle around it are unknown. Recently, particle methods, such as\npairwise force smoothed particle hydrodynamics (PF-SPH), have been used to\nconveniently forego explicit enforcement of the contact angle. The pairwise\nforce model, however, is far from mature, and there is no consensus in the\nliterature on the choice of pairwise force profile. We propose a new pair of\npolynomial force profiles with a simple motivation and validate the PF-SPH\nmodel in both static and dynamic tests. We demonstrate its capabilities by\ncomputing droplet shapes on a physically structured surface, a surface with a\nhydrophilic stripe, and a virtual wheat leaf with both micro-scale roughness\nand variable wettability. We anticipate that this model can be extended to\ndynamic scenarios, such as droplet spreading or impaction, in the future.\n",
  "subjects": [
    "Physics/Fluid Dynamics",
    "Computer Science/Numerical Analysis",
    "Mathematics/Numerical Analysis"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "TBXDd8tHeNJiwvFkGs9jl8ef0U9fXmAzJXiNN0oZbLQ",
  "pdfSize": "7569094"
}