{"id":"2412.13134","title":"Practicable Black-box Evasion Attacks on Link Prediction in Dynamic\n  Graphs -- A Graph Sequential Embedding Method","authors":"Jiate Li and Meng Pang and Binghui Wang","authorsParsed":[["Li","Jiate",""],["Pang","Meng",""],["Wang","Binghui",""]],"versions":[{"version":"v1","created":"Tue, 17 Dec 2024 17:53:32 GMT"}],"updateDate":"2024-12-18","timestamp":1734458012000,"abstract":"  Link prediction in dynamic graphs (LPDG) has been widely applied to\nreal-world applications such as website recommendation, traffic flow\nprediction, organizational studies, etc. These models are usually kept local\nand secure, with only the interactive interface restrictively available to the\npublic. Thus, the problem of the black-box evasion attack on the LPDG model,\nwhere model interactions and data perturbations are restricted, seems to be\nessential and meaningful in practice. In this paper, we propose the first\npracticable black-box evasion attack method that achieves effective attacks\nagainst the target LPDG model, within a limited amount of interactions and\nperturbations. To perform effective attacks under limited perturbations, we\ndevelop a graph sequential embedding model to find the desired state embedding\nof the dynamic graph sequences, under a deep reinforcement learning framework.\nTo overcome the scarcity of interactions, we design a multi-environment\ntraining pipeline and train our agent for multiple instances, by sharing an\naggregate interaction buffer. Finally, we evaluate our attack against three\nadvanced LPDG models on three real-world graph datasets of different scales and\ncompare its performance with related methods under the interaction and\nperturbation constraints. Experimental results show that our attack is both\neffective and practicable.\n","subjects":["Computer Science/Cryptography and Security","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"PdGhWen7aBVzw8ogAEjx8jvIEE6U_Q3Y9YCv-S6KaM4","pdfSize":"1616621"}