{"id":"2412.07719","title":"Effects of diameter polydispersity and small-range interactions on the\n  structure of biocompatible colloidal nanoparticles","authors":"Aim\\^e Gomes da Mata Kanzaki, Tiago de Sousa Ara\\'ujo Cassiano, Jo\\~ao\n  Valeriano, Fabio Luis de Oliveira Paula, Leonardo Luiz e Castro","authorsParsed":[["Kanzaki","Aimê Gomes da Mata",""],["Cassiano","Tiago de Sousa Araújo",""],["Valeriano","João",""],["Paula","Fabio Luis de Oliveira",""],["Castro","Leonardo Luiz e",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 18:12:01 GMT"}],"updateDate":"2024-12-11","timestamp":1733854321000,"abstract":"  The particles of synthetic colloids are usually treated with chemical\ntechniques to prevent the loss of colloidal stability caused by van der Waals\nand magnetic dipolar attractive interactions. However, understanding the\ncounterbalance between the attractive and repulsive interactions is challenging\ndue to the limitations of the conventional mesoscopic models at short\nnanoparticle separations. In this study, we examined three models that describe\nshort-range interactions by proposing different corrections to the van der\nWaals energy for short distances. The three models show only a minimal\ndeviation from energy extensivity, as expected of a system with a comparatively\nshort interaction range. Our analysis shows that a more detailed microscopic\nmodel at short-range separations is crucial for proper sampling, which is\nnecessary to estimate physical quantities adequately. The same model predicts\nthat polydispersity can lead to an overall decrease in mean particle distance\nfor a configuration with 5% colloidal volume fraction. The other, simpler\nmodels make the opposite prediction, which opens an interesting venue for\nexperimental exploration that could shed light on the validity of this model.\nThe predicted decrease in particle distance could lead to coagulation,\nsuggesting a preference for ferrofluids with more uniform particle sizes,\nleading to lower attraction, but still responding to applied fields, as needed\nin most applications.\n","subjects":["Condensed Matter/Soft Condensed Matter","Condensed Matter/Statistical Mechanics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"S8tm2VB6HM9vuAiDD-X2QcAleFw8fQxW9mhz9EtTolQ","pdfSize":"7577980"}