{"id":"2412.02752","title":"On the S-stars' Zone of Avoidance in the Galactic Center","authors":"Aleksey Generozov, Hagai B. Perets, Matteo S. Bordoni, Guillaume\n  Bourdarot, Antonia Drescher, Frank Eisenhauer, Reinhard Genzel, Stefan\n  Gillessen, Felix Mang, Thomas Ott, Diogo C. Ribeiro, and Rainer Sch\\\"odel","authorsParsed":[["Generozov","Aleksey",""],["Perets","Hagai B.",""],["Bordoni","Matteo S.",""],["Bourdarot","Guillaume",""],["Drescher","Antonia",""],["Eisenhauer","Frank",""],["Genzel","Reinhard",""],["Gillessen","Stefan",""],["Mang","Felix",""],["Ott","Thomas",""],["Ribeiro","Diogo C.",""],["Schödel","Rainer",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 19:00:02 GMT"}],"updateDate":"2024-12-05","timestamp":1733252402000,"abstract":"  This paper investigates the origin and orbital evolution of S-stars in the\nGalactic Center using models of binary disruption and relaxation processes. We\nfocus on explaining the recently discovered \"zone of avoidance\" in S-star\norbital parameters, defined as a region where no S-stars are observed with\npericenters $\\log(r_p / {\\rm AU}) \\leq 1.57 + 2.6(1 - e)$ pc. We demonstrate\nthat the observed S-star orbital distributions, including this zone of\navoidance and their thermal eccentricity distribution, can be largely explained\nby continuous disruption of binaries near the central supermassive black hole,\nfollowed by orbital relaxation. Our models consider binaries originating from\nlarge scales (5--100 pc) and incorporate empirical distributions of binary\nproperties. We simulate close encounters between binaries and the black hole,\ntracking the remnant stars' orbits. The initially highly eccentric orbits of\ndisrupted binary remnants evolve due to non-resonant and resonant relaxation in\nthe Galactic Center potential. While our results provide insights into the\nformation mechanism of S-stars, there are limitations, such as uncertainties in\nthe initial binary population and mass-function and simplifications in our\nrelaxation models. Despite these caveats, our study demonstrates the power of\nusing S-star distributions to probe the dynamical history and environment of\nthe central parsec of our Galaxy.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"uqfIaZ5LnW__6n_0rt8CYeA5gZz7x6UpBuJWEvybFHM","pdfSize":"1375152"}