{
  "id": "2412.19272",
  "title": "Implementing a Robot Intrusion Prevention System (RIPS) for ROS 2",
  "authors": "Enrique Soriano-Salvador and Francisco Mart\\'in-Rico and Gorka\n  Guardiola M\\'uzquiz",
  "authorsParsed": [
    [
      "Soriano-Salvador",
      "Enrique",
      ""
    ],
    [
      "Martín-Rico",
      "Francisco",
      ""
    ],
    [
      "Múzquiz",
      "Gorka Guardiola",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 26 Dec 2024 16:25:34 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735230334000,
  "abstract": "  It is imperative to develop an intrusion prevention system (IPS),\nspecifically designed for autonomous robotic systems. This is due to the unique\nnature of these cyber-physical systems (CPS), which are not merely typical\ndistributed systems. These systems employ their own systems software (i.e.\nrobotic middleware and frameworks) and execute distinct components to\nfacilitate interaction with various sensors and actuators, and other robotic\ncomponents (e.g. cognitive subsystems). Furthermore, as cyber-physical systems,\nthey engage in interactions with humans and their physical environment, as\nexemplified by social robots. These interactions can potentially lead to\nserious consequences, including physical damage. In response to this need, we\nhave designed and implemented RIPS, an intrusion prevention system tailored for\nrobotic applications based on ROS 2, the framework that has established itself\nas the de facto standard for developing robotic applications. This manuscript\nprovides a comprehensive exposition of the issue, the security aspects of ROS 2\napplications, and the key points of the threat model we created for our robotic\nenvironment. It also describes the architecture and the implementation of our\ninitial research prototype and a language specifically designed for defining\ndetection and prevention rules for diverse, real-world robotic scenarios.\nMoreover, the manuscript provides a comprehensive evaluation of the approach,\nthat includes a set of experiments with a real social robot executing a well\nknown testbed used in international robotic competitions.\n",
  "subjects": [
    "Computer Science/Robotics",
    "Computer Science/Cryptography and Security"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "3hVD_89XJhgZyJdqrgwOJhso8BOghv-myS5v4K4Uyrw",
  "pdfSize": "3625147"
}