{"id":"2412.18660","title":"Computational Assessment of Turbulent Eddy Impact on Hydrodynamic Mixing\n  in a Stirred Tank Bioreactor with Vent based Impellers","authors":"Ayodele James Oyejide, Chidera Samuella Okeke, Jesuloluwa Emmanuel\n  Zaccheus, Ebenezer Olubunmi Ige","authorsParsed":[["Oyejide","Ayodele James",""],["Okeke","Chidera Samuella",""],["Zaccheus","Jesuloluwa Emmanuel",""],["Ige","Ebenezer Olubunmi",""]],"versions":[{"version":"v1","created":"Tue, 24 Dec 2024 19:20:11 GMT"}],"updateDate":"2024-12-30","timestamp":1735068011000,"abstract":"  Homogeneity and efficient oxygen transfer are crucial for aerobic cultures,\nwhich is popularly performed in Stirred Tank Bioreactors, through internal\nmechanical agitation of the impellers.Although there are a number of impeller\ndesigns for achieving this purpose, there are still concerns about the ability\nof the impellers to yield homogeneity and mitigate or eliminate stagnant\nzones.In this study, a novel impeller design, with auxiliary agitators in form\nof vents, was introduced and evaluated for small lab-scale bioreactors. For the\nevaluation, 3D models of a single and double impeller configurations, placed in\ntwo different bioreactors were developed. Computational fluid dynamics was\nemployed to carry out the hydrodynamic simulation using k-epsilon standard\nmodel in the bioreactors.Computational variables such as the flow velocity,\nstreamlines, pressure and wall shear stress on the shaft and impellers, eddy\nviscosity, turbulence eddy dissipation and turbulence kinetic energy were\nobtained and compared in both bioreactors to evaluate the performances at\nspeeds of 50, 100, and 150 revolutions per minute.A comparison of the results\nwith traditional segment-segment and segment-Rushton impellers shows that our\ndouble impeller configuration performs more desirably at speeds ranging from\n100 to 150 RPM. Homogeneity was also achieved in both bioreactors, and there\nwas significant reduction of stagnant zone less than 99 percentage in the\ndouble impeller configuration and significant mitigation in the single impeller\nagitation.\n","subjects":["Physics/Fluid Dynamics","Computer Science/Numerical Analysis","Mathematics/Analysis of PDEs","Mathematics/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"A3QR7bHVlvVugNafuct6SGmbWeSkfQtRvob6uRH0wpE","pdfSize":"2566476"}