{"id":"2412.18586","title":"Uniform Additivity of Tripartite Optimized Correlation Measures","authors":"Joshua Levin (1), Ariel Shlosberg (1 and 2), Vikesh Siddhu (1), Graeme\n  Smith (1 and 3) ((1) JILA, University of Colorado/NIST, Boulder, CO, USA (2)\n  Center for Quantum Information and Control (CQuIC), Department of Physics and\n  Astronomy, University of New Mexico, Albuquerque, New Mexico, USA (3)\n  Institute for Quantum Computing and Department of Applied Mathematics,\n  University of Waterloo, Waterloo, ON, Canada)","authorsParsed":[["Levin","Joshua","","1 and 2"],["Shlosberg","Ariel","","1 and 2"],["Siddhu","Vikesh","","1 and 3"],["Smith","Graeme","","1 and 3"]],"versions":[{"version":"v1","created":"Tue, 24 Dec 2024 18:28:29 GMT"}],"updateDate":"2024-12-25","timestamp":1735064909000,"abstract":"  Information theory provides a framework for answering fundamental questions\nabout the optimal performance of many important quantum communication and\ncomputational tasks. In many cases, the optimal rates of these tasks can be\nexpressed in terms of regularized formulas that consist of linear combinations\nof von Neumann entropies optimized over state extensions. However, evaluation\nof regularized formulas is often intractable, since it involves computing a\nformula's value in the limit of infinitely many copies of a state. To find\noptimized, linear entropic functions of quantum states whose regularized\nversions are tractable to compute, we search for linear combinations of\nentropies on tripartite quantum states that are additive. We use the method of\n\\cite{cross2017uniform}, which considers bipartite formulas, to identify convex\npolyhedral cones of uniformly additive \\emph{tripartite} correlation measures.\nWe rely only on strong subadditivity of the von Neumann entropy and use these\ncones to prove that three previously established tripartite optimized\ncorrelation measures are additive.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"pA0S0EuNdhldUA9SIvwEy3Mgx4Az1Sw35pE9c1ot5x4","pdfSize":"282851"}