{"id":"2412.10963","title":"The geometry of simplicial distributions on suspension scenarios","authors":"Aziz Kharoof","authorsParsed":[["Kharoof","Aziz",""]],"versions":[{"version":"v1","created":"Sat, 14 Dec 2024 20:47:53 GMT"}],"updateDate":"2024-12-17","timestamp":1734209273000,"abstract":"  Quantum measurements often exhibit non-classical features, such as\ncontextuality, which generalizes Bell's non-locality and serves as a resource\nin various quantum computation models. Existing frameworks have rigorously\ncaptured these phenomena, and recently, simplicial distributions have been\nintroduced to deepen this understanding. The geometrical structure of\nsimplicial distributions can be seen as a resource for applications in quantum\ninformation theory. In this work, we use topological foundations to study this\ngeometrical structure, leveraging the fact that, in this simplicial framework,\nmeasurements and outcomes are represented as spaces. This allows us to depict\ncontextuality as a topological phenomenon. We show that applying the cone\nconstruction to the measurement space makes the corresponding non-signaling\npolytope equal to the join of $m$ copies of the original polytope, where $m$ is\nthe number of possible outcomes per measurement. Then we glue two copies of\ncone measurement spaces to obtain a suspension measurement space. The\ndecomposition done for simplicial distributions on a cone measurement space\nprovides deeper insights into the geometry of simplicial distributions on a\nsuspension measurement space and aids in characterizing the contextuality\nthere. Additionally, we apply these results to derive a new type of Bell\ninequalities (inequalities that determine the set of local joint\nprobabilities/non-contextual simplicial distributions) and to offer a\nmathematical explanation for certain contextual vertices from the literature.\n","subjects":["Physics/Quantum Physics","Mathematics/Algebraic Topology"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"fBKj6mor3hzCvij1lyLge1TYxYz1l5clbmQnFQHmxhw","pdfSize":"560026"}