{"id":"2412.13872","title":"High-precision measurement of the W boson mass with the CMS experiment\n  at the LHC","authors":"CMS Collaboration","authorsParsed":[["CMS Collaboration","",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 14:09:26 GMT"}],"updateDate":"2024-12-19","timestamp":1734530966000,"abstract":"  In the standard model of particle physics, the masses of the carriers of the\nweak interaction, the W and Z bosons, are uniquely related. Physics beyond the\nstandard model could change this relationship through the effects of quantum\nloops of virtual particles, thus making it of great importance to measure these\nmasses with the highest possible precision. Although the mass of the Z boson is\nknown to the remarkable precision of 22 parts per million (2.0 MeV), the W\nboson mass is known much less precisely, given the difficulty of the\nmeasurement. A global fit to electroweak data, used to predict the W boson mass\nin the standard model, yields an uncertainty of 6 MeV. Reaching a comparable\nexperimental precision would be a sensitive and fundamental test of the\nstandard model. Furthermore, a precision measurement of the W boson mass\nperformed by the CDF Collaboration at the Fermilab Tevatron has challenged the\nstandard model by significantly disagreeing with the prediction of the global\nelectroweak fit and the average of other $m_\\mathrm{W}$ measurements. We report\nthe first W boson mass measurement by the CMS Collaboration at the CERN LHC,\nbased on a data sample collected in 2016 at the proton-proton collision energy\nof 13 TeV. The W boson mass is measured using a large sample of W$\\to\\mu\\nu$\nevents via a highly granular binned maximum likelihood fit to the kinematic\nproperties of the muons produced in the W$^{+}$ and W$^{-}$ boson decays. The\nsignificant in situ constraints of theoretical inputs and their corresponding\nuncertainties, together with an accurate determination of the experimental\neffects, lead to a precise W boson mass measurement, $m_\\mathrm{W} =$\n80$\\,$360.2 $\\pm$ 9.9 MeV, in agreement with the standard model prediction.\n","subjects":["Physics/High Energy Physics - Experiment"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"llWmQcoSKPJmYDAVVfxpdJDgP-k9JhzTE29L220MdSw","pdfSize":"3099746"}