{
  "id": "2412.17993",
  "title": "Multi-Agent Path Finding in Continuous Spaces with Projected Diffusion\n  Models",
  "authors": "Jinhao Liang, Jacob K. Christopher, Sven Koenig, Ferdinando Fioretto",
  "authorsParsed": [
    [
      "Liang",
      "Jinhao",
      ""
    ],
    [
      "Christopher",
      "Jacob K.",
      ""
    ],
    [
      "Koenig",
      "Sven",
      ""
    ],
    [
      "Fioretto",
      "Ferdinando",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 21:27:19 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1734989239000,
  "abstract": "  Multi-Agent Path Finding (MAPF) is a fundamental problem in robotics,\nrequiring the computation of collision-free paths for multiple agents moving\nfrom their respective start to goal positions. Coordinating multiple agents in\na shared environment poses significant challenges, especially in continuous\nspaces where traditional optimization algorithms struggle with scalability.\nMoreover, these algorithms often depend on discretized representations of the\nenvironment, which can be impractical in image-based or high-dimensional\nsettings. Recently, diffusion models have shown promise in single-agent path\nplanning, capturing complex trajectory distributions and generating smooth\npaths that navigate continuous, high-dimensional spaces. However, directly\nextending diffusion models to MAPF introduces new challenges since these models\nstruggle to ensure constraint feasibility, such as inter-agent collision\navoidance. To overcome this limitation, this work proposes a novel approach\nthat integrates constrained optimization with diffusion models for MAPF in\ncontinuous spaces. This unique combination directly produces feasible\nmulti-agent trajectories that respect collision avoidance and kinematic\nconstraints. The effectiveness of our approach is demonstrated across various\nchallenging simulated scenarios of varying dimensionality.\n",
  "subjects": [
    "Computer Science/Robotics",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "EhNWPOjuu7wfAZKV1AUa2T-DfjRyFGVMXr9OCRUkgbM",
  "pdfSize": "382696"
}