{
  "id": "2412.11590",
  "title": "A Real-Time System for Scheduling and Managing UAV Delivery in Urban",
  "authors": "Han Liu, Tian Liu and Kai Huang",
  "authorsParsed": [
    [
      "Liu",
      "Han",
      ""
    ],
    [
      "Liu",
      "Tian",
      ""
    ],
    [
      "Huang",
      "Kai",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 09:24:04 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734341044000,
  "abstract": "  As urban logistics demand continues to grow, UAV delivery has become a key\nsolution to improve delivery efficiency, reduce traffic congestion, and lower\nlogistics costs. However, to fully leverage the potential of UAV delivery\nnetworks, efficient swarm scheduling and management are crucial. In this paper,\nwe propose a real-time scheduling and management system based on the\n``Airport-Unloading Station\" model, aiming to bridge the gap between high-level\nscheduling algorithms and low-level execution systems. This system, acting as\nmiddleware, accurately translates the requirements from the scheduling layer\ninto specific execution instructions, ensuring that the scheduling algorithms\nperform effectively in real-world environments. Additionally, we implement\nthree collaborative scheduling schemes involving autonomous ground vehicles\n(AGVs), unmanned aerial vehicles (UAVs), and ground staff to further optimize\noverall delivery efficiency. Through extensive experiments, this study\ndemonstrates the rationality and feasibility of the proposed management system,\nproviding practical solution for the commercial application of UAVs delivery in\nurban.\n  Code: https://github.com/chengji253/UAVDeliverySystem\n",
  "subjects": [
    "Computer Science/Robotics",
    "Computer Science/Systems and Control",
    "Electrical Engineering and Systems Science/Systems and Control"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Jy1xKp51fklrVFbMrwdTqFKBA3ZIZsINMhmqx40Jfrs",
  "pdfSize": "1101081"
}