{
  "id": "2412.10177",
  "title": "Signal and Power transmission over Fiber in the DUNE Far Detector",
  "authors": "Sabrina Sacerdoti (for the DUNE Collaboration)",
  "authorsParsed": [
    [
      "Sacerdoti",
      "Sabrina",
      "",
      "for the DUNE Collaboration"
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 14:50:15 GMT"
    }
  ],
  "updateDate": "2024-12-16",
  "timestamp": 1734101415000,
  "abstract": "  One of the far detectors of the Deep Underground Neutrino Experiment (DUNE)\nwill be instrumented with a Vertical Drift Liquid Argon Time Projection Chamber\n(VD LArTPC). It will also be equipped with a Photo-Detection System (PDS),\nwhich determines the time of interaction of non-beam events, as well as\ncontributing to the energy reconstruction. The characteristics of this new type\nof LArTPC required an innovative approach to the placement of the\nphoto-detectors. In order to achieve a high light yield and uniform coverage of\nthe detector, the PDS detectors in the VD LArTPC will be placed not only on the\nmembrane walls of the cryostat, but also on the high voltage surface of the\nTPC's cathode. Such placement enhances the coverage of the PDS but presents an\nimportant technical challenge, since the powering and signal readout of the\ndetectors must be done using non-conducting materials. To this end the\nPower-over-Fiber and Signal-over-Fiber transmission technologies were developed\nwithin the DUNE collaboration, opening a door to further enhance the coverage\nof future PD systems. This document will describe the technical solutions\ndeveloped to this end, as well as presenting the final performance results from\nlaboratory characterization of the devices and the prototype testing campaigns\ncarried out at the CERN Neutrino Platform.\n",
  "subjects": [
    "Physics/High Energy Physics - Experiment",
    "Physics/Instrumentation and Detectors"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "CM1kddt1k9MBfBGJxufPOX_q4EUKx-An55RQCFGzWRM",
  "pdfSize": "3165555"
}