{"id":"2412.02944","title":"Passive polarization-encoded BB84 protocol using a heralded\n  single-photon source","authors":"Anju Rani, Vardaan Mongia, Parvatesh Parvatikar, Rutuj Gharate, Tanya\n  Sharma, Jayanth Ramakrishnan, Pooja Chandravanshi and R. P. Singh","authorsParsed":[["Rani","Anju",""],["Mongia","Vardaan",""],["Parvatikar","Parvatesh",""],["Gharate","Rutuj",""],["Sharma","Tanya",""],["Ramakrishnan","Jayanth",""],["Chandravanshi","Pooja",""],["Singh","R. P.",""]],"versions":[{"version":"v1","created":"Wed, 4 Dec 2024 01:22:16 GMT"}],"updateDate":"2024-12-05","timestamp":1733275336000,"abstract":"  The BB84 quantum key distribution protocol set the foundation for achieving\nsecure quantum communication. Since its inception, significant advancements\nhave aimed to overcome experimental challenges and enhance security. In this\npaper, we report the implementation of a passive polarization-encoded BB84\nprotocol using a heralded single-photon source. By passively and randomly\nencoding polarization states with beam splitters and half-wave plates, the\nsetup avoids active modulation, simplifying design and enhancing security\nagainst side-channel attacks. The heralded single-photon source ensures a low\nprobability of multi-photon emissions, eliminating the need for decoy states\nand mitigating photon number splitting vulnerabilities. The quality of the\nsingle-photon source is certified by measuring the second-order correlation\nfunction at zero delay, $g^{2}(0)=0.0408\\pm0.0008$, confirming a very low\nprobability of multi-photon events. Compared to conventional BB84 or BBM92\nprotocols, our protocol provides optimized resource trade-offs, with fewer\ndetectors (compared to BBM92) and no reliance on external quantum random number\ngenerators (compared to typical BB84) to drive Alice's encoding scheme. Our\nimplementation achieved a quantum bit error rate of 7% and a secure key rate of\n5 kbps. These results underscore the practical, secure, and resource-efficient\nframework our protocol offers for scalable quantum communication technologies.\n","subjects":["Physics/Quantum Physics","Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"2wG_04ZpsvqC-O3obfBHHyeCG5BNAvSkGSQlmwX_f_4","pdfSize":"6543535"}