{
  "id": "2412.03963",
  "title": "Augmenting Minds or Automating Skills: The Differential Role of Human\n  Capital in Generative AI's Impact on Creative Tasks",
  "authors": "Meiling Huang, Ming Jin, Ning Li",
  "authorsParsed": [
    [
      "Huang",
      "Meiling",
      ""
    ],
    [
      "Jin",
      "Ming",
      ""
    ],
    [
      "Li",
      "Ning",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 08:27:14 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733387234000,
  "abstract": "  Generative AI is rapidly reshaping creative work, raising critical questions\nabout its beneficiaries and societal implications. This study challenges\nprevailing assumptions by exploring how generative AI interacts with diverse\nforms of human capital in creative tasks. Through two random controlled\nexperiments in flash fiction writing and song composition, we uncover a\nparadox: while AI democratizes access to creative tools, it simultaneously\namplifies cognitive inequalities. Our findings reveal that AI enhances general\nhuman capital (cognitive abilities and education) by facilitating adaptability\nand idea integration but diminishes the value of domain-specific expertise. We\nintroduce a novel theoretical framework that merges human capital theory with\nthe automation-augmentation perspective, offering a nuanced understanding of\nhuman-AI collaboration. This framework elucidates how AI shifts the locus of\ncreative advantage from specialized expertise to broader cognitive\nadaptability. Contrary to the notion of AI as a universal equalizer, our work\nhighlights its potential to exacerbate disparities in skill valuation,\nreshaping workplace hierarchies and redefining the nature of creativity in the\nAI era. These insights advance theories of human capital and automation while\nproviding actionable guidance for organizations navigating AI integration\namidst workforce inequalities.\n",
  "subjects": [
    "Computer Science/Human-Computer Interaction",
    "Computer Science/Artificial Intelligence",
    "Economics/General Economics",
    "Quantitative Finance/Economics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "-vwv0PsGqvFnjc6NmxN8hQ5elaS6SVHCJw6YuoEXWkw",
  "pdfSize": "1745739"
}