{
  "id": "2412.05932",
  "title": "Testing for isospin symmetry breaking with extensive calculations of\n  isotope shift factors in potassium",
  "authors": "Vaibhav Katyal, A. Chakraborty, B. K. Sahoo, Ben Ohayon, Chien-Yeah\n  Seng, Mikhail Gorchtein, John Behr",
  "authorsParsed": [
    [
      "Katyal",
      "Vaibhav",
      ""
    ],
    [
      "Chakraborty",
      "A.",
      ""
    ],
    [
      "Sahoo",
      "B. K.",
      ""
    ],
    [
      "Ohayon",
      "Ben",
      ""
    ],
    [
      "Seng",
      "Chien-Yeah",
      ""
    ],
    [
      "Gorchtein",
      "Mikhail",
      ""
    ],
    [
      "Behr",
      "John",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 8 Dec 2024 13:01:43 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733662903000,
  "abstract": "  Precise evaluation of the isotope shift (IS) factors for seven low-lying\npotassium (K) states is achieved using relativistic coupled-cluster (RCC)\ntheory. The energies of these states are assessed and compared with\nexperimental data to confirm the accuracy of the wave functions calculated at\nvarying RCC theory approximations and highlight the significance of many-body\nand relativistic effects in determining the energies and IS factors of K.\nVarious methods are used to compute the IS factors, with the finite-field (FF)\napproach yielding results that align with observed and semi-empirical data.\nThis consistency is attributed to orbital relaxation effects that are naturally\npresent in the FF method but emerge only through complex interactions in other\ntechniques. Using the IS factors derived from FF, we review the mean square\nradius difference between $^{38m}$K and $^{39}$K. From this difference and\nmuonic atom x-ray spectroscopy, we deduce the absolute radius of $^{38m}$K\nusing an updated calculation of the nuclear polarizability effect. Finally, we\nevaluate the isospin symmetry breaking (ISB) in this isotriplet by integrating\nthe radius of $^{38m}$K with an updated radius of $^{38}$Ca, concluding that\nthe ISB is compatible with zero. This finding offers a stringent benchmark for\nnuclear model calculations of ISB corrections in nuclear beta decay, which play\na key role in determining the $V_{ud}$ matrix element.\n",
  "subjects": [
    "Physics/Atomic Physics",
    "Physics/High Energy Physics - Phenomenology",
    "Physics/Nuclear Experiment",
    "Physics/Nuclear Theory"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "oz6_vKYbccVp6p15EtK9zAawvZl06RsDsXcu4nsIPiA",
  "pdfSize": "425290"
}