{"id":"2412.03194","title":"Coupled Boundary Element and Finite Volume Methods for Modeling\n  Fluid-Induced Seismicity in Fault Networks within Low-Permeability Rocks","authors":"Pierre Romanet, Marco Maria Scuderi, Jean-Paul Ampuero, Stephanie\n  Chaillat, and Frederic Cappa","authorsParsed":[["Romanet","Pierre",""],["Scuderi","Marco Maria",""],["Ampuero","Jean-Paul",""],["Chaillat","Stephanie",""],["Cappa","Frederic",""]],"versions":[{"version":"v1","created":"Wed, 4 Dec 2024 10:29:33 GMT"}],"updateDate":"2024-12-05","timestamp":1733308173000,"abstract":"  To better understand the mechanics of injection-induced seismicity, we\ndeveloped a two-dimensional numerical code to simulate both seismic and\naseismic slip on non-planar faults and fault networks driven by fluid diffusion\nalong permeable faults. Our approach integrates a boundary element method to\nmodel fault slip governed by rate-and-state friction with a finite volume\nmethod for simulating fluid diffusion along fault networks. We demonstrate the\nmethod's capabilities with two illustrative examples: (1) fluid injection\ninducing slow slip on a primary rough, rate-strengthening fault, which\nsubsequently triggers microseismicity on secondary, smaller faults, and (2)\nfluid injection on a single fault in a network of intersecting faults, leading\nto fluid diffusion and reactivation of slip throughout the network. In both\ncases, the simulated slow slip migrates more rapidly than the fluid pressure\ndiffusion front. The observed migration patterns of microseismicity in the\nfirst example and slow slip in the second example resemble diffusion processes\nbut involve diffusivity values that differ significantly from the fault\nhydraulic diffusivity. These results support the conclusion that the\nmicroseismicity front is not a direct proxy for the fluid diffusion front and\ncannot be used to directly infer hydraulic diffusivity, consistently with some\ndecametric scale in-situ experiments of fault activation under controlled\nconditions. This work highlights the importance of distinguishing between\nmechanical and hydrological processes in the analysis of induced seismicity,\nproviding a powerful tool for improving our understanding of fault behavior in\nresponse to fluid injection, in particular when a network of faults is\ninvolved.\n","subjects":["Physics/Geophysics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"WV16CSXfgv0YPRPFYW1fyazJZnPSFJo9yb36UnqsCjk","pdfSize":"5507208"}