{
  "id": "2412.12696",
  "title": "ALADE-SNN: Adaptive Logit Alignment in Dynamically Expandable Spiking\n  Neural Networks for Class Incremental Learning",
  "authors": "Wenyao Ni and Jiangrong Shen and Qi Xu and Huajin Tang",
  "authorsParsed": [
    [
      "Ni",
      "Wenyao",
      ""
    ],
    [
      "Shen",
      "Jiangrong",
      ""
    ],
    [
      "Xu",
      "Qi",
      ""
    ],
    [
      "Tang",
      "Huajin",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 09:13:22 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734426802000,
  "abstract": "  Inspired by the human brain's ability to adapt to new tasks without erasing\nprior knowledge, we develop spiking neural networks (SNNs) with dynamic\nstructures for Class Incremental Learning (CIL). Our comparative experiments\nreveal that limited datasets introduce biases in logits distributions among\ntasks. Fixed features from frozen past-task extractors can cause overfitting\nand hinder the learning of new tasks. To address these challenges, we propose\nthe ALADE-SNN framework, which includes adaptive logit alignment for balanced\nfeature representation and OtoN suppression to manage weights mapping frozen\nold features to new classes during training, releasing them during fine-tuning.\nThis approach dynamically adjusts the network architecture based on analytical\nobservations, improving feature extraction and balancing performance between\nnew and old tasks. Experiment results show that ALADE-SNN achieves an average\nincremental accuracy of 75.42 on the CIFAR100-B0 benchmark over 10 incremental\nsteps. ALADE-SNN not only matches the performance of DNN-based methods but also\nsurpasses state-of-the-art SNN-based continual learning algorithms. This\nadvancement enhances continual learning in neuromorphic computing, offering a\nbrain-inspired, energy-efficient solution for real-time data processing.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "O14NUKilDBxlaLtMTeIjVS7Zlr3-urM-en46DJEJj8s",
  "pdfSize": "2225338"
}