{
  "id": "2412.04639",
  "title": "Motion-Guided Deep Image Prior for Cardiac MRI",
  "authors": "Marc Vornehm, Chong Chen, Muhammad Ahmad Sultan, Syed Murtaza Arshad,\n  Yuchi Han, Florian Knoll, Rizwan Ahmad",
  "authorsParsed": [
    [
      "Vornehm",
      "Marc",
      ""
    ],
    [
      "Chen",
      "Chong",
      ""
    ],
    [
      "Sultan",
      "Muhammad Ahmad",
      ""
    ],
    [
      "Arshad",
      "Syed Murtaza",
      ""
    ],
    [
      "Han",
      "Yuchi",
      ""
    ],
    [
      "Knoll",
      "Florian",
      ""
    ],
    [
      "Ahmad",
      "Rizwan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 22:15:18 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733436918000,
  "abstract": "  Cardiovascular magnetic resonance imaging is a powerful diagnostic tool for\nassessing cardiac structure and function. Traditional breath-held imaging\nprotocols, however, pose challenges for patients with arrhythmias or limited\nbreath-holding capacity. We introduce Motion-Guided Deep Image prior (M-DIP), a\nnovel unsupervised reconstruction framework for accelerated real-time cardiac\nMRI. M-DIP employs a spatial dictionary to synthesize a time-dependent template\nimage, which is further refined using time-dependent deformation fields that\nmodel cardiac and respiratory motion. Unlike prior DIP-based methods, M-DIP\nsimultaneously captures physiological motion and frame-to-frame content\nvariations, making it applicable to a wide range of dynamic applications. We\nvalidate M-DIP using simulated MRXCAT cine phantom data as well as\nfree-breathing real-time cine and single-shot late gadolinium enhancement data\nfrom clinical patients. Comparative analyses against state-of-the-art\nsupervised and unsupervised approaches demonstrate M-DIP's performance and\nversatility. M-DIP achieved better image quality metrics on phantom data, as\nwell as higher reader scores for in-vivo patient data.\n",
  "subjects": [
    "Physics/Medical Physics",
    "Computer Science/Computer Vision and Pattern Recognition",
    "Electrical Engineering and Systems Science/Image and Video Processing"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Z9aO1wAPIEL1Lzhy3QylSrRjBYueRBFFL5vnELExfYw",
  "pdfSize": "3512152"
}