{"id":"2412.01027","title":"Unleashing In-context Learning of Autoregressive Models for Few-shot\n  Image Manipulation","authors":"Bolin Lai, Felix Juefei-Xu, Miao Liu, Xiaoliang Dai, Nikhil Mehta,\n  Chenguang Zhu, Zeyi Huang, James M. Rehg, Sangmin Lee, Ning Zhang, Tong Xiao","authorsParsed":[["Lai","Bolin",""],["Juefei-Xu","Felix",""],["Liu","Miao",""],["Dai","Xiaoliang",""],["Mehta","Nikhil",""],["Zhu","Chenguang",""],["Huang","Zeyi",""],["Rehg","James M.",""],["Lee","Sangmin",""],["Zhang","Ning",""],["Xiao","Tong",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 01:19:21 GMT"},{"version":"v2","created":"Tue, 3 Dec 2024 03:32:00 GMT"}],"updateDate":"2024-12-04","timestamp":1733102361000,"abstract":"  Text-guided image manipulation has experienced notable advancement in recent\nyears. In order to mitigate linguistic ambiguity, few-shot learning with visual\nexamples has been applied for instructions that are underrepresented in the\ntraining set, or difficult to describe purely in language. However, learning\nfrom visual prompts requires strong reasoning capability, which diffusion\nmodels are struggling with. To address this issue, we introduce a novel\nmulti-modal autoregressive model, dubbed $\\textbf{InstaManip}$, that can\n$\\textbf{insta}$ntly learn a new image $\\textbf{manip}$ulation operation from\ntextual and visual guidance via in-context learning, and apply it to new query\nimages. Specifically, we propose an innovative group self-attention mechanism\nto break down the in-context learning process into two separate stages --\nlearning and applying, which simplifies the complex problem into two easier\ntasks. We also introduce a relation regularization method to further\ndisentangle image transformation features from irrelevant contents in exemplar\nimages. Extensive experiments suggest that our method surpasses previous\nfew-shot image manipulation models by a notable margin ($\\geq$19% in human\nevaluation). We also find our model can be further boosted by increasing the\nnumber or diversity of exemplar images.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"MqshH6J_jK6L4uQF6cIgpsCujrgmrTvFEh_fphuvOYo","pdfSize":"13977651"}