{
  "id": "2412.00786",
  "title": "Sensitively searching for microwave dark photons with atomic ensembles",
  "authors": "Suirong He, De He, Yufen Li, Li Gao, Xianing Feng, Hao Zheng, and L.\n  F. Wei",
  "authorsParsed": [
    [
      "He",
      "Suirong",
      ""
    ],
    [
      "He",
      "De",
      ""
    ],
    [
      "Li",
      "Yufen",
      ""
    ],
    [
      "Gao",
      "Li",
      ""
    ],
    [
      "Feng",
      "Xianing",
      ""
    ],
    [
      "Zheng",
      "Hao",
      ""
    ],
    [
      "Wei",
      "L. F.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 1 Dec 2024 12:20:45 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733055645000,
  "abstract": "  Dark photon is one of the promising candidates of light dark matter and could\nbe detected by using its interaction with standard model particles via kinetic\nmixings. Here, we propose a feasible approach to detect the dark photons by\nnondestructively probing these mixing-induced quantum state transitions of\natomic ensembles. Compared with the scheme by probing the mixing-induced\nquantum excitation of single-atom detector, the achievable detection\nsensitivity can be enhanced theoretically by a factor of $\\sqrt{N}$ for the\nensemble containing $N$ atoms. Specifically, we show that the dark photons, in\nboth centimeter- and millimeter-wave bands, could be detected by using the\nartificial atomic ensemble detector, generated by surface-state electrons on\nliquid Helium. It is estimated that, with the detectable transition probability\nof $10^{-4}$, the experimental surface-state electrons (with $N = 10^8$ trapped\nelectrons) might provide a feasible approach to search for the dark photons in\n$18.61-26.88$ $\\mu$eV and $496.28-827.13$ $\\mu$eV ranges, within about two\nmonths. The confidence level can exceed 95\\% for the achievable sensitivities\nbeing $10^{-14} \\sim 10^{-13}$ and $10^{-12} \\sim 10^{-11}$, respectively. In\nprinciple, the proposal could also be generalized to the other atomic ensemble\ndetectors for the detection of dark photons in different frequency bands.\n",
  "subjects": [
    "Physics/Quantum Physics",
    "Astrophysics/High Energy Astrophysical Phenomena"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "nVSdaCqcC5afG3qBdNY6MPE_SVLJ7Wg_gX3XewIfgWA",
  "pdfSize": "4365017"
}