{
  "id": "2412.00951",
  "title": "A Quantum Computing Approach to Simulating Corrosion Inhibition",
  "authors": "Karim Elgammal and Marc Mau{\\ss}ner",
  "authorsParsed": [
    [
      "Elgammal",
      "Karim",
      ""
    ],
    [
      "Maußner",
      "Marc",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 1 Dec 2024 20:03:38 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733083418000,
  "abstract": "  This work demonstrates a systematic implementation of hybrid\nquantum-classical computational methods for investigating corrosion inhibition\nmechanisms on aluminum surfaces. We present an integrated workflow combining\ndensity functional theory (DFT) with quantum algorithms through an active space\nembedding scheme, specifically applied to studying 1,2,4-Triazole and\n1,2,4-Triazole-3-thiol inhibitors on Al111 surfaces. Our implementation\nleverages the ADAPT-VQE algorithm with benchmarking against classical DFT\ncalculations, achieving binding energies of -0.386 eV and -1.279 eV for\n1,2,4-Triazole and 1,2,4-Triazole-3-thiol, respectively. The enhanced binding\nenergy of the thiol derivative aligns with experimental observations regarding\nsulfur-functionalized inhibitors' improved corrosion protection. The\nmethodology employs the orb-d3-v2 machine learning potential for rapid geometry\noptimizations, followed by accurate DFT calculations using CP2K with PBE\nfunctional and Grimme's D3 dispersion corrections. Our benchmarking on smaller\nsystems reveals that StatefulAdaptVQE implementation achieves a 5-6x\ncomputational speedup while maintaining accuracy. This work establishes a\nworkflow for quantum-accelerated materials science studying periodic systems,\ndemonstrating the viability of hybrid quantum-classical approaches for studying\nsurface-adsorbate interactions in corrosion inhibition applications. In which,\ncan be transferable to other applications such as carbon capture and battery\nmaterials studies.\n",
  "subjects": [
    "Condensed Matter/Materials Science",
    "Physics/Applied Physics",
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "WAbrPIqDpRF-e07CHgp_JuydswYClYTzpYDrpKmp9_M",
  "pdfSize": "3629359"
}