{"id":"2412.04682","title":"Two stages domain invariant representation learners solve the large\n  co-variate shift in unsupervised domain adaptation with two dimensional data\n  domains","authors":"Hisashi Oshima, Tsuyoshi Ishizone, Tomoyuki Higuchi","authorsParsed":[["Oshima","Hisashi",""],["Ishizone","Tsuyoshi",""],["Higuchi","Tomoyuki",""]],"versions":[{"version":"v1","created":"Fri, 6 Dec 2024 00:46:12 GMT"},{"version":"v2","created":"Mon, 17 Feb 2025 02:12:40 GMT"}],"updateDate":"2025-02-18","timestamp":1733445972000,"abstract":"  Recent developments in the unsupervised domain adaptation (UDA) enable the\nunsupervised machine learning (ML) prediction for target data, thus this will\naccelerate real world applications with ML models such as image recognition\ntasks in self-driving. Researchers have reported the UDA techniques are not\nworking well under large co-variate shift problems where e.g. supervised source\ndata consists of handwritten digits data in monotone color and unsupervised\ntarget data colored digits data from the street view. Thus there is a need for\na method to resolve co-variate shift and transfer source labelling rules under\nthis dynamics. We perform two stages domain invariant representation learning\nto bridge the gap between source and target with semantic intermediate data\n(unsupervised). The proposed method can learn domain invariant features\nsimultaneously between source and intermediate also intermediate and target.\nFinally this achieves good domain invariant representation between source and\ntarget plus task discriminability owing to source labels. This induction for\nthe gradient descent search greatly eases learning convergence in terms of\nclassification performance for target data even when large co-variate shift. We\nalso derive a theorem for measuring the gap between trained models and\nunsupervised target labelling rules, which is necessary for the free parameters\noptimization. Finally we demonstrate that proposing method is superiority to\nprevious UDA methods using 4 representative ML classification datasets\nincluding 38 UDA tasks. Our experiment will be a basis for challenging UDA\nproblems with large co-variate shift.\n","subjects":["Computer Science/Machine Learning","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"2VQzYQhaGQWE7BzVmYkWtoxiXXLmLgst3_MoNyPV-Ag","pdfSize":"2663469"}