{
  "id": "2412.15394",
  "title": "A self-organised liquid reaction container for cellular memory",
  "authors": "Sukanta Mukherjee, Enrico Skoruppa, Holger Merlitz, Jens-Uwe Sommer\n  and Helmut Schiessel",
  "authorsParsed": [
    [
      "Mukherjee",
      "Sukanta",
      ""
    ],
    [
      "Skoruppa",
      "Enrico",
      ""
    ],
    [
      "Merlitz",
      "Holger",
      ""
    ],
    [
      "Sommer",
      "Jens-Uwe",
      ""
    ],
    [
      "Schiessel",
      "Helmut",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 20:52:51 GMT"
    },
    {
      "version": "v2",
      "created": "Mon, 23 Dec 2024 14:38:53 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734641571000,
  "abstract": "  Epigenetic inheritance during cell division is essential for preserving cell\nidentity by stabilizing the overall chromatin organisation. Heterochromatin,the\ncondensed and transcriptionally silent fraction of chromatin,is marked by\nspecific epigenetic modifications that are diluted during each cell division.\nHere we build a physical model,based on the formation of a biomolecular\ncondensate,a liquid 'droplet',that promotes the restoration of epigenetic\nmarks. Heterochromatin facilitates the droplet formation via polymer-assisted\ncondensation(PAC). The resulting condensate serves as a reaction chamber to\nreconstruct the lost epigenetic marks. We incorporate the enzymatic reactions\ninto a particle-based simulation and monitor the progress of the epigenetic\nmarkers through an in silico analogue of the cell cycle. We demonstrate that\nthe proposed mechanism is robust and stabilizes the heterochromatin domains\nover many cell generations. This mechanism and variations thereof might be at\nwork for other epigenetic marks as well.\n",
  "subjects": [
    "Physics/Biological Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "W4tkIHalZrV8Xxjd_TpoB186I0bFjviOGtpmjezKkb4",
  "pdfSize": "23206628"
}