{
  "id": "2412.20422",
  "title": "Bringing Objects to Life: 4D generation from 3D objects",
  "authors": "Ohad Rahamim, Ori Malca, Dvir Samuel, Gal Chechik",
  "authorsParsed": [
    [
      "Rahamim",
      "Ohad",
      ""
    ],
    [
      "Malca",
      "Ori",
      ""
    ],
    [
      "Samuel",
      "Dvir",
      ""
    ],
    [
      "Chechik",
      "Gal",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 29 Dec 2024 10:12:01 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735467121000,
  "abstract": "  Recent advancements in generative modeling now enable the creation of 4D\ncontent (moving 3D objects) controlled with text prompts. 4D generation has\nlarge potential in applications like virtual worlds, media, and gaming, but\nexisting methods provide limited control over the appearance and geometry of\ngenerated content. In this work, we introduce a method for animating\nuser-provided 3D objects by conditioning on textual prompts to guide 4D\ngeneration, enabling custom animations while maintaining the identity of the\noriginal object. We first convert a 3D mesh into a ``static\" 4D Neural Radiance\nField (NeRF) that preserves the visual attributes of the input object. Then, we\nanimate the object using an Image-to-Video diffusion model driven by text. To\nimprove motion realism, we introduce an incremental viewpoint selection\nprotocol for sampling perspectives to promote lifelike movement and a masked\nScore Distillation Sampling (SDS) loss, which leverages attention maps to focus\noptimization on relevant regions. We evaluate our model in terms of temporal\ncoherence, prompt adherence, and visual fidelity and find that our method\noutperforms baselines that are based on other approaches, achieving up to\nthreefold improvements in identity preservation measured using LPIPS scores,\nand effectively balancing visual quality with dynamic content.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "8VPYV4ADev1SYgY5CtEzfX33Bt1m8KzTOFLHDG271f4",
  "pdfSize": "1626241"
}