{
  "id": "2412.12793",
  "title": "CRoF: CLIP-based Robust Few-shot Learning on Noisy Labels",
  "authors": "Shizhuo Deng, Bowen Han, Jiaqi Chen, Hao Wang, Dongyue Chen, Tong Jia",
  "authorsParsed": [
    [
      "Deng",
      "Shizhuo",
      ""
    ],
    [
      "Han",
      "Bowen",
      ""
    ],
    [
      "Chen",
      "Jiaqi",
      ""
    ],
    [
      "Wang",
      "Hao",
      ""
    ],
    [
      "Chen",
      "Dongyue",
      ""
    ],
    [
      "Jia",
      "Tong",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 10:56:18 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734432978000,
  "abstract": "  Noisy labels threaten the robustness of few-shot learning (FSL) due to the\ninexact features in a new domain. CLIP, a large-scale vision-language model,\nperforms well in FSL on image-text embedding similarities, but it is\nsusceptible to misclassification caused by noisy labels. How to enhance domain\ngeneralization of CLIP on noisy data within FSL tasks is a critical challenge.\nIn this paper, we provide a novel view to mitigate the influence of noisy\nlabels, CLIP-based Robust Few-shot learning (CRoF). CRoF is a general plug-in\nmodule for CLIP-based models. To avoid misclassification and confused label\nembedding, we design the few-shot task-oriented prompt generator to give more\ndiscriminative descriptions of each category. The proposed prompt achieves\nlarger distances of inter-class textual embedding. Furthermore, rather than\nfully trusting zero-shot classification by CLIP, we fine-tune CLIP on noisy\nfew-shot data in a new domain with a weighting strategy like label-smooth. The\nweights for multiple potentially correct labels consider the relationship\nbetween CLIP's prior knowledge and original label information to ensure\nreliability. Our multiple label loss function further supports robust training\nunder this paradigm. Comprehensive experiments show that CRoF, as a plug-in,\noutperforms fine-tuned and vanilla CLIP models on different noise types and\nnoise ratios.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "YMQUegly1hSEEH8TeP3jChv0Zm0Own9zrT0rkuc-30s",
  "pdfSize": "1268552"
}