{
  "id": "2412.18373",
  "title": "Lu/Se Substitution Effect on Magnetic Properties of Yb-Based Zigzag\n  Chain Semiconductor YbCuS2",
  "authors": "Fumiya Hori, Hiroyasu Matsudaira, Shunsaku Kitagawa, Kenji Ishida,\n  Souichiro Mizutani, Hirotaka Shirai, Takahiro Onimaru",
  "authorsParsed": [
    [
      "Hori",
      "Fumiya",
      ""
    ],
    [
      "Matsudaira",
      "Hiroyasu",
      ""
    ],
    [
      "Kitagawa",
      "Shunsaku",
      ""
    ],
    [
      "Ishida",
      "Kenji",
      ""
    ],
    [
      "Mizutani",
      "Souichiro",
      ""
    ],
    [
      "Shirai",
      "Hirotaka",
      ""
    ],
    [
      "Onimaru",
      "Takahiro",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 24 Dec 2024 11:57:13 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1735041433000,
  "abstract": "  We have investigated the changes in the magnetic properties on YbCuS2 by Lu\nor Se substitutions from a microscopic perspective. In general, it is expected\nthat nonmagnetic Lu substitution dilutes the magnetic Yb3+ concentration, and\nthat Se substitution induces the negative pressure in YbCuS2. The\n63/65Cu-nuclear quadrupole resonance (NQR) measurements on polycrystalline\nYb0.9Lu0.1CuS2 and YbCu(S0.9Se0.1)2 revealed that the Se substitution leads to\nlarger lattice expansion compared to the Lu substitution. The antiferromagnetic\ntransition temperature TN decreased from 0.95 K in the unsubstituted system to\n0.75 K in both substituted systems. Furthermore, the T-linear behavior of the\n63Cu-NQR spin-lattice relaxation rate 1/T1, suggesting the presence of the\ngapless quasiparticle excitations, was observed even in the substituted\nsystems, and the value of 1/T1T increases. These results under the chemical\nsubstitutions are opposite to those under pressure as previously reported, and\nare consistent with the expectation. Our systematic study indicates a clear\nrelationship between the magnetic ordered states and the quasiparticle\nexcitations in YbCuS2.\n",
  "subjects": [
    "Condensed Matter/Strongly Correlated Electrons"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "v5rtw7RNS4uqQAn_tqRJpJ2kvXW780RkJxjUXLnBBlo",
  "pdfSize": "1380947"
}