{
  "id": "2412.10380",
  "title": "Challenges in Human-Agent Communication",
  "authors": "Gagan Bansal, Jennifer Wortman Vaughan, Saleema Amershi, Eric Horvitz,\n  Adam Fourney, Hussein Mozannar, Victor Dibia, Daniel S. Weld",
  "authorsParsed": [
    [
      "Bansal",
      "Gagan",
      ""
    ],
    [
      "Vaughan",
      "Jennifer Wortman",
      ""
    ],
    [
      "Amershi",
      "Saleema",
      ""
    ],
    [
      "Horvitz",
      "Eric",
      ""
    ],
    [
      "Fourney",
      "Adam",
      ""
    ],
    [
      "Mozannar",
      "Hussein",
      ""
    ],
    [
      "Dibia",
      "Victor",
      ""
    ],
    [
      "Weld",
      "Daniel S.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 28 Nov 2024 01:21:26 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1732756886000,
  "abstract": "  Remarkable advancements in modern generative foundation models have enabled\nthe development of sophisticated and highly capable autonomous agents that can\nobserve their environment, invoke tools, and communicate with other agents to\nsolve problems. Although such agents can communicate with users through natural\nlanguage, their complexity and wide-ranging failure modes present novel\nchallenges for human-AI interaction. Building on prior research and informed by\na communication grounding perspective, we contribute to the study of\n\\emph{human-agent communication} by identifying and analyzing twelve key\ncommunication challenges that these systems pose. These include challenges in\nconveying information from the agent to the user, challenges in enabling the\nuser to convey information to the agent, and overarching challenges that need\nto be considered across all human-agent communication. We illustrate each\nchallenge through concrete examples and identify open directions of research.\nOur findings provide insights into critical gaps in human-agent communication\nresearch and serve as an urgent call for new design patterns, principles, and\nguidelines to support transparency and control in these systems.\n",
  "subjects": [
    "Computer Science/Human-Computer Interaction",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "qQORU7g2DceSpvJ68nC-zf_BmJJ--tyRHH6Q0257XCQ",
  "pdfSize": "1232779"
}