{
  "id": "2412.11308",
  "title": "datadriftR: An R Package for Concept Drift Detection in Predictive\n  Models",
  "authors": "Ugur Dar, Mustafa Cavus",
  "authorsParsed": [
    [
      "Dar",
      "Ugur",
      ""
    ],
    [
      "Cavus",
      "Mustafa",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 15 Dec 2024 20:59:49 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734296389000,
  "abstract": "  Predictive models often face performance degradation due to evolving data\ndistributions, a phenomenon known as data drift. Among its forms, concept\ndrift, where the relationship between explanatory variables and the response\nvariable changes, is particularly challenging to detect and adapt to.\nTraditional drift detection methods often rely on metrics such as accuracy or\nvariable distributions, which may fail to capture subtle but significant\nconceptual changes. This paper introduces drifter, an R package designed to\ndetect concept drift, and proposes a novel method called Profile Drift\nDetection (PDD) that enables both drift detection and an enhanced understanding\nof the cause behind the drift by leveraging an explainable AI tool - Partial\nDependence Profiles (PDPs). The PDD method, central to the package, quantifies\nchanges in PDPs through novel metrics, ensuring sensitivity to shifts in the\ndata stream without excessive computational costs. This approach aligns with\nMLOps practices, emphasizing model monitoring and adaptive retraining in\ndynamic environments. The experiments across synthetic and real-world datasets\ndemonstrate that PDD outperforms existing methods by maintaining high accuracy\nwhile effectively balancing sensitivity and stability. The results highlight\nits capability to adaptively retrain models in dynamic environments, making it\na robust tool for real-time applications. The paper concludes by discussing the\nadvantages, limitations, and future extensions of the package for broader use\ncases.\n",
  "subjects": [
    "Statistics/Machine Learning",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "dYbDGAVTRIO03YgBbTjruCYBdna54QNO3O8AYIS7zW4",
  "pdfSize": "1935440"
}