{"id":"2412.01766","title":"Type Ia supernova progenitors: a contemporary view of a long-standing\n  puzzle","authors":"Ashley J. Ruiter and Ivo R. Seitenzahl","authorsParsed":[["Ruiter","Ashley J.",""],["Seitenzahl","Ivo R.",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 18:05:07 GMT"}],"updateDate":"2024-12-03","timestamp":1733162707000,"abstract":"  Type Ia supernovae (SNe Ia) are runaway thermonuclear explosions in white\ndwarfs that result in the disruption of the white dwarf star, and possibly its\nnearby stellar companion. SNe Ia occur over an immense range of stellar\npopulation age and host galaxy environments, and play a critical role in the\nnucleosynthesis of intermediate-mass and iron-group elements, primarily the\nproduction of nickel, iron, cobalt, chromium, and manganese. Though the nature\nof their progenitors is still not well-understood, SNe Ia are unique among\nstellar explosions in that the majority of them exhibit a systematic lightcurve\nrelation: more luminous supernovae dim more slowly over time than less luminous\nsupernovae in optical light (intrinsically brighter SNe Ia have broader\nlightcurves). This feature, unique to SNe Ia, is rather remarkable and allows\ntheir peak luminosities to be determined with fairly high accuracy out to\ncosmological distances via measurement of their lightcurve decline. Further,\nstudying SNe Ia gives us important insights into binary star evolution physics,\nsince it is widely agreed that the progenitors of SNe Ia are binary (possibly\nmultiple) star systems. In this review, we give a current update on the\ndifferent proposed Type Ia supernova progenitors, including descriptions of\npossible binary star configurations, and their explosion mechanisms, from a\ntheoretical perspective. We additionally give a brief overview of the\nhistorical (focusing on the more recent) observational work that has helped the\nastronomical community to understand the nature of the most important distance\nindicators in cosmology.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/Astrophysics of Galaxies","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"HxRzVPuVS4DhYHF0jwIoqhNUFA0BkNVdP25DDHJOq8A","pdfSize":"5320336"}