{
  "id": "2412.10852",
  "title": "Symmetries of a 3D Field-Theoretic Model",
  "authors": "R. Kumar, R. P. Malik",
  "authorsParsed": [
    [
      "Kumar",
      "R.",
      ""
    ],
    [
      "Malik",
      "R. P.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 14 Dec 2024 14:53:10 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 7 Jan 2025 15:15:50 GMT"
    }
  ],
  "updateDate": "2025-01-08",
  "timestamp": 1734187990000,
  "abstract": "  We discuss the discrete as well as the continuous symmetry transformations\nfor a three $(2+1)$-dimensional $(3D)$ combined system of the free Abelian\n1-form and 2-form gauge theories within the framework of\nBecchi-Rouet-Stora-Tyutin (BRST) formalism and establish their relevance in the\ncontext of the algebraic structures that are obeyed by the de Rham\ncohomological operators of differential geometry. In fact, our present\nfield-theoretic system respects six continuous symmetry transformations and a\ncouple of very useful discrete duality symmetry transformations. Out of the\nabove six continuous symmetry transformations four are off-shell nilpotent\n(i.e. fermionic) in nature and two are bosonic. The algebraic structures,\nobeyed by the symmetry operators, are reminiscent of the algebra satisfied by\nthe de Rham cohomological operators. Hence, our present $3D$ field-theoretic\nsystem provides a perfect example for Hodge theory where there is convergence\nof ideas from the physical aspects of the BRST formalism and mathematical\ningredients that are connected with the cohomological operators of differential\ngeometry at the algebraic level. One of the highlights of our present\ninvestigation is the appearance of a pseudo-scalar field in our theory (on the\nsymmetry ground alone) which carries the negative kinetic term. Thus, it is one\nof the possible candidates for the ``phantom\" fields of the cyclic, bouncing\nand self-accelerated cosmological models of the Universe.\n",
  "subjects": [
    "Physics/High Energy Physics - Theory"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "pCyrB19-h2nzZD1ieviXT4BTP-pzSvWhkmEXi_0P1SI",
  "pdfSize": "409062"
}