{
  "id": "2412.03133",
  "title": "Sensitivity of Double Deeply Virtual Compton Scattering observables to\n  GPDs",
  "authors": "J. S. Alvarado, M. Hoballah, E. Voutier",
  "authorsParsed": [
    [
      "Alvarado",
      "J. S.",
      ""
    ],
    [
      "Hoballah",
      "M.",
      ""
    ],
    [
      "Voutier",
      "E.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 08:56:11 GMT"
    }
  ],
  "updateDate": "2024-12-05",
  "timestamp": 1733302571000,
  "abstract": "  Generalized Parton Distributions (GPDs) are multidimensonal structure\nfunctions that encode the information about the internal structure of hadrons.\nUsing privileged channels such as Deeply Virtual Compton Scattering (DVCS) or\nTimelike Compton Scattering (TCS), it is possible to make direct measurements\nat points where the momentum fraction of the parton equals the respective\nscaling variable. Double Deeply Virtual Compton Scattering (DDVCS) is a not yet\nmeasured and promising channel for GPD studies as it allows to perform more\ngeneral measurements at independent momentum fraction and scaling variable\nvalues. GPDs are extracted from Compton Form Factors which arise naturally in\nexperimental observables from different combinations of beam and target\nconfigurations. In the context of the Continuous Electron Beam Accelerator\nFacility (CEBAF) and the Electron Ion Collider (EIC), we report the results of\nan exhaustive study of the DDVCS observables from polarized electron and\npositron beams directed to a polarized proton target. The study focuses on the\nsensitivity of the observables to the parton helicity conserving proton GPDs,\nparticularly the consequences for GPDs measurements via DDVCS at CEBAF and EIC\nbased on the VGG and GK19 model predictions.\n",
  "subjects": [
    "Physics/Nuclear Experiment",
    "Physics/High Energy Physics - Phenomenology"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "SEq7CfDI5mUoVDCicITejhFJ_Mc2hA_U_fm2Ayz-93g",
  "pdfSize": "653856"
}