{"id":"2412.03362","title":"Distortions in Charged-Particle Images of Laser Direct-Drive Inertial\n  Confinement Fusion Implosions","authors":"P. V. Heuer, J. L. Peebles, J. Kunimune, H. G. Rinderknecht, J. R.\n  Davies, V. Gopalaswamy, J. Frelier, M. Scott, J. Roberts, B. Brannon, H.\n  McClow, R. Fairbanks, S. P. Regan, J. A. Frenje, M. Gatu Johnson, F. H.\n  S\\'eguin, A. J. Crilly, B. D. Appelbe, M. Farrell, J. Stutz","authorsParsed":[["Heuer","P. V.",""],["Peebles","J. L.",""],["Kunimune","J.",""],["Rinderknecht","H. G.",""],["Davies","J. R.",""],["Gopalaswamy","V.",""],["Frelier","J.",""],["Scott","M.",""],["Roberts","J.",""],["Brannon","B.",""],["McClow","H.",""],["Fairbanks","R.",""],["Regan","S. P.",""],["Frenje","J. A.",""],["Johnson","M. Gatu",""],["Séguin","F. H.",""],["Crilly","A. J.",""],["Appelbe","B. D.",""],["Farrell","M.",""],["Stutz","J.",""]],"versions":[{"version":"v1","created":"Wed, 4 Dec 2024 14:50:22 GMT"}],"updateDate":"2024-12-05","timestamp":1733323822000,"abstract":"  Energetic charged particles generated by inertial confinement fusion (ICF)\nimplosions encode information about the spatial morphology of the hot-spot and\ndense fuel during the time of peak fusion reactions. The knock-on deuteron\nimager (KoDI) was developed at the Omega Laser Facility to image these\nparticles in order to diagnose low-mode asymmetries in the hot-spot and dense\nfuel layer of cryogenic deuterium--tritium ICF implosions. However, the images\ncollected are distorted in several ways that prevent reconstruction of the\ndeuteron source. In this paper we describe these distortions and a series of\nattempts to mitigate or compensate for them. We present several potential\nmechanisms for the distortions, including a new model for scattering of charged\nparticles in filamentary electric or magnetic fields surrounding the implosion.\nA novel particle-tracing methodology is developed and utilized to create\nsynthetic KoDI data based on the filamentary field model that reproduces the\nmain experimentally observed image distortions. We conclude with a discussion\nof the outlook for KoDI, and potential considerations for other\ncharged-particle diagnostics.\n","subjects":["Physics/Plasma Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"VSHB2Vt_zRY2neOxt3kPe43sVjdccjpPJuQUhvZOxcg","pdfSize":"4727101"}