{
  "id": "2412.13398",
  "title": "Pattern Matching in AI Compilers and its Formalization (Extended\n  Version)",
  "authors": "Joseph W. Cutler, Alex Collins, Bin Fan, Mahesh Ravishankar, Vinod\n  Grover",
  "authorsParsed": [
    [
      "Cutler",
      "Joseph W.",
      ""
    ],
    [
      "Collins",
      "Alex",
      ""
    ],
    [
      "Fan",
      "Bin",
      ""
    ],
    [
      "Ravishankar",
      "Mahesh",
      ""
    ],
    [
      "Grover",
      "Vinod",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 00:29:09 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734481749000,
  "abstract": "  PyPM is a Python-based domain specific language (DSL) for building\nrewrite-based optimization passes on machine learning computation graphs. Users\ndefine individual optimizations by writing (a) patterns that match subgraphs of\na computation graph and (b) corresponding rules which replace a matched\nsubgraph with an optimized kernel. PyPM is distinguished from the many other\nDSLs for defining rewriting passes by its complex and novel pattern language\nwhich borrows concepts from logic programming. PyPM patterns can be recursive,\nnondeterminstic, and can require checking domain-specific constraints such as\nthe shapes of tensors. The PyPM implementation is thus similarly complicated,\nconsisting of thousands of lines of C++ code. In this paper, we present our\nwork on building PyPM, as well as formalizing and distilling and this\ncomplexity to an understandable mathematical core. We have developed a formal\ncore calculus expressing the main operations of the PyPM pattern language. We\ndefine both a declarative semantics - describing which patterns match which\nterms - and an algorithmic semantics - an idealized version of the PyPM pattern\ninterpreter - and prove their equivalence. The development is fully mechanized\nin the Coq proof assistant.\n",
  "subjects": [
    "Computer Science/Programming Languages",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "QiVsMsXemR2sbYUpX-VV1ywBvLxK1wkDx0IH3UA5Ql8",
  "pdfSize": "741251"
}