{"id":"2412.16880","title":"Large-Scale UWB Anchor Calibration and One-Shot Localization Using\n  Gaussian Process","authors":"Shenghai Yuan, Boyang Lou, Thien-Minh Nguyen, Pengyu Yin, Muqing Cao,\n  Xinghang Xu, Jianping Li, Jie Xu, Siyu Chen, Lihua Xie","authorsParsed":[["Yuan","Shenghai",""],["Lou","Boyang",""],["Nguyen","Thien-Minh",""],["Yin","Pengyu",""],["Cao","Muqing",""],["Xu","Xinghang",""],["Li","Jianping",""],["Xu","Jie",""],["Chen","Siyu",""],["Xie","Lihua",""]],"versions":[{"version":"v1","created":"Sun, 22 Dec 2024 06:20:59 GMT"}],"updateDate":"2024-12-24","timestamp":1734848459000,"abstract":"  Ultra-wideband (UWB) is gaining popularity with devices like AirTags for\nprecise home item localization but faces significant challenges when scaled to\nlarge environments like seaports. The main challenges are calibration and\nlocalization in obstructed conditions, which are common in logistics\nenvironments. Traditional calibration methods, dependent on line-of-sight\n(LoS), are slow, costly, and unreliable in seaports and warehouses, making\nlarge-scale localization a significant pain point in the industry. To overcome\nthese challenges, we propose a UWB-LiDAR fusion-based calibration and one-shot\nlocalization framework. Our method uses Gaussian Processes to estimate anchor\nposition from continuous-time LiDAR Inertial Odometry with sampled UWB ranges.\nThis approach ensures accurate and reliable calibration with just one round of\nsampling in large-scale areas, I.e., 600x450 square meter. With the LoS issues,\nUWB-only localization can be problematic, even when anchor positions are known.\nWe demonstrate that by applying a UWB-range filter, the search range for LiDAR\nloop closure descriptors is significantly reduced, improving both accuracy and\nspeed. This concept can be applied to other loop closure detection methods,\nenabling cost-effective localization in large-scale warehouses and seaports. It\nsignificantly improves precision in challenging environments where UWB-only and\nLiDAR-Inertial methods fall short, as shown in the video\n\\url{https://youtu.be/oY8jQKdM7lU }. We will open-source our datasets and\ncalibration codes for community use.\n","subjects":["Computer Science/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"gcPUdT0siCkrOQIrejuFT9JUXI8KNoWqQqUwsPfSMTk","pdfSize":"5573935"}