{
  "id": "2412.06726",
  "title": "ICtoken: An NFT for Hardware IP Protection",
  "authors": "Shashank Balla, Yiming Zhao and Farinaz Koushanfar",
  "authorsParsed": [
    [
      "Balla",
      "Shashank",
      ""
    ],
    [
      "Zhao",
      "Yiming",
      ""
    ],
    [
      "Koushanfar",
      "Farinaz",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 18:15:28 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733768128000,
  "abstract": "  Protecting integrated circuits (ICs) from piracy and theft throughout their\nlifecycle is a persistent and complex challenge. In order to safeguard against\nillicit piracy attacks, this work proposes a novel framework utilizing\nNon-Fungible Tokens (NFTs) called ICtokens, uniquely linked to their\ncorresponding physical ICs. Each ICtoken contains comprehensive information,\nincluding authentication data, supply chain stage and status, ownership\ndetails, and other IC metadata, while also making provision for the secure\nintegration of a logic-locking key. Designed to be publicly logged, ICtokens\nsecurely obscure metering information without compromising functionality. In\naddition, the ICtracker, a distributed ledger technology powered by a swift and\nenergy-efficient consortium blockchain, is used to register and manage ICtokens\nand their respective owners, tracking all associated interactions. This robust\nledger guarantees the traceability and auditing of ICtokens while\nsimultaneously developing a product-level NFT at every transaction point within\nthe supply chain. Consequently, a scalable framework is established, creating\nunique, immutable digital twins for ICs and IC-embedded products in the form of\nICtokens and their transactions. This provides a robust and reliable supply\nchain trail back to the original IP owner, while also offering unprecedented\nassurance to consumers of IC-embedded products. The rich information contained\nwithin ICtokens facilitates more detailed audits than previous proposals for IC\nsupply chain monitoring. A proof-of-concept, implemented as an open-source\nsolution, ensures the ease of adoption of the proposed framework.\n",
  "subjects": [
    "Computer Science/Cryptography and Security"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "oA6JzrKz8Ws555FrIPm-LItY2NLFNzNgpeSkARY1Vys",
  "pdfSize": "1843372"
}