{"id":"2412.12767","title":"A Survey of Calibration Process for Black-Box LLMs","authors":"Liangru Xie, Hui Liu, Jingying Zeng, Xianfeng Tang, Yan Han, Chen Luo,\n  Jing Huang, Zhen Li, Suhang Wang, Qi He","authorsParsed":[["Xie","Liangru",""],["Liu","Hui",""],["Zeng","Jingying",""],["Tang","Xianfeng",""],["Han","Yan",""],["Luo","Chen",""],["Huang","Jing",""],["Li","Zhen",""],["Wang","Suhang",""],["He","Qi",""]],"versions":[{"version":"v1","created":"Tue, 17 Dec 2024 10:31:21 GMT"}],"updateDate":"2024-12-18","timestamp":1734431481000,"abstract":"  Large Language Models (LLMs) demonstrate remarkable performance in semantic\nunderstanding and generation, yet accurately assessing their output reliability\nremains a significant challenge. While numerous studies have explored\ncalibration techniques, they primarily focus on White-Box LLMs with accessible\nparameters. Black-Box LLMs, despite their superior performance, pose heightened\nrequirements for calibration techniques due to their API-only interaction\nconstraints. Although recent researches have achieved breakthroughs in\nblack-box LLMs calibration, a systematic survey of these methodologies is still\nlacking. To bridge this gap, we presents the first comprehensive survey on\ncalibration techniques for black-box LLMs. We first define the Calibration\nProcess of LLMs as comprising two interrelated key steps: Confidence Estimation\nand Calibration. Second, we conduct a systematic review of applicable methods\nwithin black-box settings, and provide insights on the unique challenges and\nconnections in implementing these key steps. Furthermore, we explore typical\napplications of Calibration Process in black-box LLMs and outline promising\nfuture research directions, providing new perspectives for enhancing\nreliability and human-machine alignment. This is our GitHub link:\nhttps://github.com/LiangruXie/Calibration-Process-in-Black-Box-LLMs\n","subjects":["Computer Science/Artificial Intelligence","Computer Science/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"SzrJCRaiQPylQWmp9NodtLdKyCuXTAEdARI_khJJhMw","pdfSize":"1976755"}