{
  "id": "2412.20794",
  "title": "The Casimir Effect in (3+1)-dimensional lattice Yang-Mills theory at\n  finite temperature: the unexpected universality of quarkiton and glueton\n  boundary states",
  "authors": "Maxim N. Chernodub, Vladimir A. Goy, Alexander V. Molochkov,\n  Konstantin R. Pak and Alexey S. Tanashkin",
  "authorsParsed": [
    [
      "Chernodub",
      "Maxim N.",
      ""
    ],
    [
      "Goy",
      "Vladimir A.",
      ""
    ],
    [
      "Molochkov",
      "Alexander V.",
      ""
    ],
    [
      "Pak",
      "Konstantin R.",
      ""
    ],
    [
      "Tanashkin",
      "Alexey S.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 30 Dec 2024 08:33:38 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735547618000,
  "abstract": "  In our earlier work on the Casimir effect in (3+1)-dimensional Yang-Mills\ntheory, we identified two novel nonperturbative states arising in QCD with\nboundaries: the glueton and the quarkiton. The glueton, or \"gluon exciton\", is\na colorless bound state formed by gluons interacting with their negatively\ncolored images in a chromometallic mirror. The quarkiton, or \"quark exciton\",\nis a meson-like state comprising a heavy quark attracted to its image through\nthe mirror. In this study, we extend our analysis to finite temperatures near\nthe deconfinement phase transition $(T \\approx 0.78 T_c)$, where we observe a\nlinear potential between a color-neutral chromometallic mirror and a heavy test\nquark. Our result suggests that the quarkiton state can have a physical\nrelevance since mirrors for photons and, presumably, gluons can be realized in\nfield theories as domain-wall solutions. Furthermore, we find a striking\nuniversality: the ratio of the glueton mass to the bulk $0^{++}$ glueball mass\n- defining the bulk mass gap - matches the ratio of the quarkiton string\ntension to the string tension between quark and anti-quark in the absence of\nthe mirror, with a value $\\mathcal{R} = 0.294(11)$.\n",
  "subjects": [
    "Physics/High Energy Physics - Lattice",
    "Condensed Matter/Other Condensed Matter",
    "Physics/High Energy Physics - Phenomenology",
    "Physics/High Energy Physics - Theory"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "kPMmQJPABCy5gW8Ps39INU36s_M_oOCm-YO7c8KbuIQ",
  "pdfSize": "384413"
}