{
  "id": "2412.00525",
  "title": "GloCOM: A Short Text Neural Topic Model via Global Clustering Context",
  "authors": "Quang Duc Nguyen, Tung Nguyen, Duc Anh Nguyen, Linh Ngo Van, Sang\n  Dinh, Thien Huu Nguyen",
  "authorsParsed": [
    [
      "Nguyen",
      "Quang Duc",
      ""
    ],
    [
      "Nguyen",
      "Tung",
      ""
    ],
    [
      "Nguyen",
      "Duc Anh",
      ""
    ],
    [
      "Van",
      "Linh Ngo",
      ""
    ],
    [
      "Dinh",
      "Sang",
      ""
    ],
    [
      "Nguyen",
      "Thien Huu",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 30 Nov 2024 16:19:25 GMT"
    },
    {
      "version": "v2",
      "created": "Thu, 23 Jan 2025 08:47:52 GMT"
    }
  ],
  "updateDate": "2025-01-24",
  "timestamp": 1732983565000,
  "abstract": "  Uncovering hidden topics from short texts is challenging for traditional and\nneural models due to data sparsity, which limits word co-occurrence patterns,\nand label sparsity, stemming from incomplete reconstruction targets. Although\ndata aggregation offers a potential solution, existing neural topic models\noften overlook it due to time complexity, poor aggregation quality, and\ndifficulty in inferring topic proportions for individual documents. In this\npaper, we propose a novel model, GloCOM (Global Clustering COntexts for Topic\nModels), which addresses these challenges by constructing aggregated global\nclustering contexts for short documents, leveraging text embeddings from\npre-trained language models. GloCOM can infer both global topic distributions\nfor clustering contexts and local distributions for individual short texts.\nAdditionally, the model incorporates these global contexts to augment the\nreconstruction loss, effectively handling the label sparsity issue. Extensive\nexperiments on short text datasets show that our approach outperforms other\nstate-of-the-art models in both topic quality and document representations.\n",
  "subjects": [
    "Computer Science/Computation and Language"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "btyNFtcQZUMbMu8w1Lsjx4Xx9Ok87U6c12YXHssO_eQ",
  "pdfSize": "6736550"
}