{
  "id": "2412.12945",
  "title": "Meta-analysis models relaxing the random effects normality assumption:\n  methodological systematic review and simulation study",
  "authors": "Kanella Panagiotopoulou, Theodoros Evrenoglou, Christopher H Schmid,\n  Silvia Metelli, Anna Chaimani",
  "authorsParsed": [
    [
      "Panagiotopoulou",
      "Kanella",
      ""
    ],
    [
      "Evrenoglou",
      "Theodoros",
      ""
    ],
    [
      "Schmid",
      "Christopher H",
      ""
    ],
    [
      "Metelli",
      "Silvia",
      ""
    ],
    [
      "Chaimani",
      "Anna",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 14:26:01 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734445561000,
  "abstract": "  Random effects meta-analysis is widely used for synthesizing studies under\nthe assumption that underlying effects come from a normal distribution.\nHowever, under certain conditions the use of alternative distributions might be\nmore appropriate. We conducted a systematic review to identify articles\nintroducing alternative meta-analysis models assuming non-normal between-study\ndistributions. We identified 27 eligible articles suggesting 24 alternative\nmeta-analysis models based on long-tail and skewed distributions, on mixtures\nof distributions, and on Dirichlet process priors. Subsequently, we performed a\nsimulation study to evaluate the performance of these models and to compare\nthem with the standard normal model. We considered 22 scenarios varying the\namount of between-study variance, the shape of the true distribution, and the\nnumber of included studies. We compared 15 models implemented in the\nFrequentist or in the Bayesian framework. We found small differences with\nrespect to bias between the different models but larger differences in the\nlevel of coverage probability. In scenarios with large between-study variance,\nall models were substantially biased in the estimation of the mean treatment\neffect. This implies that focusing only on the mean treatment effect of random\neffects meta-analysis can be misleading when substantial heterogeneity is\nsuspected or outliers are present.\n",
  "subjects": [
    "Statistics/Methodology"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "XfHKh9qmkywoGEYFLJ2QQ3F7V2hfzh0VyCtGQyqbOug",
  "pdfSize": "2338138"
}