{"id":"2412.03575","title":"Leveraging Large Language Models for Generating Labeled Mineral Site\n  Record Linkage Data","authors":"Jiyoon Pyo and Yao-Yi Chiang","authorsParsed":[["Pyo","Jiyoon",""],["Chiang","Yao-Yi",""]],"versions":[{"version":"v1","created":"Sun, 17 Nov 2024 18:26:56 GMT"}],"updateDate":"2024-12-06","timestamp":1731868016000,"abstract":"  Record linkage integrates diverse data sources by identifying records that\nrefer to the same entity. In the context of mineral site records, accurate\nrecord linkage is crucial for identifying and mapping mineral deposits.\nProperly linking records that refer to the same mineral deposit helps define\nthe spatial coverage of mineral areas, benefiting resource identification and\nsite data archiving. Mineral site record linkage falls under the spatial record\nlinkage category since the records contain information about the physical\nlocations and non-spatial attributes in a tabular format. The task is\nparticularly challenging due to the heterogeneity and vast scale of the data.\nWhile prior research employs pre-trained discriminative language models (PLMs)\non spatial entity linkage, they often require substantial amounts of curated\nground-truth data for fine-tuning. Gathering and creating ground truth data is\nboth time-consuming and costly. Therefore, such approaches are not always\nfeasible in real-world scenarios where gold-standard data are unavailable.\nAlthough large generative language models (LLMs) have shown promising results\nin various natural language processing tasks, including record linkage, their\nhigh inference time and resource demand present challenges. We propose a method\nthat leverages an LLM to generate training data and fine-tune a PLM to address\nthe training data gap while preserving the efficiency of PLMs. Our approach\nachieves over 45\\% improvement in F1 score for record linkage compared to\ntraditional PLM-based methods using ground truth data while reducing the\ninference time by nearly 18 times compared to relying on LLMs. Additionally, we\noffer an automated pipeline that eliminates the need for human intervention,\nhighlighting this approach's potential to overcome record linkage challenges.\n","subjects":["Computer Science/Information Retrieval","Computer Science/Artificial Intelligence","Computer Science/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"IDUXd14qUrtQygdmZdi6b3MMM2Rm9N1Kirshc2Gt2f0","pdfSize":"2421939"}