{"id":"2412.06408","title":"Influence of momentum confinement in the phase-space dynamics of the\n  Kramers-Henneberger atom","authors":"A. Tasnim Aynul, L. Cruz Rodriguez, C. Figueira de Morisson Faria","authorsParsed":[["Aynul","A. Tasnim",""],["Rodriguez","L. Cruz",""],["Faria","C. Figueira de Morisson",""]],"versions":[{"version":"v1","created":"Mon, 9 Dec 2024 11:36:49 GMT"}],"updateDate":"2024-12-10","timestamp":1733744209000,"abstract":"  We investigate the phase-space dynamics of the Kramers Henneberger (KH) atom\nsolving the time-dependent Schr\\\"odinger equation for reduced-dimensionality\nmodels and using Wigner quasiprobability distributions. We find that, for the\ntime-averaged KH potential, coherent superpositions of eigenstates perform a\ncyclic motion confined in momentum space, whose frequency is proportional to\nthe energy difference between the two KH eigenstates. This cyclic motion is\nalso present if the full time dependent dynamics are taken into consideration.\nHowever, there are time delays regarding the time-averaged potential, and some\ntail-shaped spilling of the quasiprobability flow towards higher momentum\nregions. These tails are signatures of ionization, indicating that vanishingly\nsmall drift momentum is instrumental for stabilization. A comparison of the\nquasiprobability flow with classical phase-space constraints shows that, for\nthe KH atom, confinement occurs in momentum space. This is a major difference\nfrom a molecule, for which the quasiprobability flow is confined in position\nspace for small internuclear separation. Furthermore, we assess the stability\nof different propagation strategies and find that the most stable scenario for\nthe full dynamics is obtained if the system is initially prepared in the KH\nground state.\n","subjects":["Physics/Quantum Physics","Physics/Atomic Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"l8LeaqHKsE_dFwi7Tu1YHtJVt1u2sdxRmu-EDRdLPFI","pdfSize":"1253993"}