{
  "id": "2412.02634",
  "title": "Liquefaction: Privately Liquefying Blockchain Assets",
  "authors": "James Austgen, Andr\\'es F\\'abrega, Mahimna Kelkar, Dani Vilardell,\n  Sarah Allen, Kushal Babel, Jay Yu, Ari Juels",
  "authorsParsed": [
    [
      "Austgen",
      "James",
      ""
    ],
    [
      "Fábrega",
      "Andrés",
      ""
    ],
    [
      "Kelkar",
      "Mahimna",
      ""
    ],
    [
      "Vilardell",
      "Dani",
      ""
    ],
    [
      "Allen",
      "Sarah",
      ""
    ],
    [
      "Babel",
      "Kushal",
      ""
    ],
    [
      "Yu",
      "Jay",
      ""
    ],
    [
      "Juels",
      "Ari",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 18:03:54 GMT"
    }
  ],
  "updateDate": "2024-12-04",
  "timestamp": 1733249034000,
  "abstract": "  Inherent in the world of cryptocurrency systems and their security models is\nthe notion that private keys, and thus assets, are controlled by individuals or\nindividual entities.\n  We present Liquefaction, a wallet platform that demonstrates the dangerous\nfragility of this foundational assumption by systemically breaking it.\nLiquefaction uses trusted execution environments (TEEs) to encumber private\nkeys, i.e., attach rich, multi-user policies to their use. In this way, it\nenables the cryptocurrency credentials and assets of a single end-user address\nto be freely rented, shared, or pooled. It accomplishes these things privately,\nwith no direct on-chain traces.\n  Liquefaction demonstrates the sweeping consequences of TEE-based key\nencumbrance for the cryptocurrency landscape. Liquefaction can undermine the\nsecurity and economic models of many applications and resources, such as locked\ntokens, DAO voting, airdrops, loyalty points, soulbound tokens, and quadratic\nvoting. It can do so with no on-chain and minimal off-chain visibility.\nConversely, we also discuss beneficial applications of Liquefaction, such as\nprivacy-preserving, cost-efficient DAOs and a countermeasure to dusting\nattacks. Importantly, we describe an existing TEE-based tool that applications\ncan use as a countermeasure to Liquefaction.\n  Our work prompts a wholesale rethinking of existing models and enforcement of\nkey and asset ownership in the cryptocurrency ecosystem.\n",
  "subjects": [
    "Computer Science/Cryptography and Security"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "EWf5cmkmqRavYSMfWXm5Z0nFjHSZ-zOhniYlAEArZG0",
  "pdfSize": "606242"
}