{"id":"2412.02368","title":"ScImage: How Good Are Multimodal Large Language Models at Scientific\n  Text-to-Image Generation?","authors":"Leixin Zhang, Steffen Eger, Yinjie Cheng, Weihe Zhai, Jonas Belouadi,\n  Christoph Leiter, Simone Paolo Ponzetto, Fahimeh Moafian, and Zhixue Zhao","authorsParsed":[["Zhang","Leixin",""],["Eger","Steffen",""],["Cheng","Yinjie",""],["Zhai","Weihe",""],["Belouadi","Jonas",""],["Leiter","Christoph",""],["Ponzetto","Simone Paolo",""],["Moafian","Fahimeh",""],["Zhao","Zhixue",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 10:52:06 GMT"}],"updateDate":"2024-12-04","timestamp":1733223126000,"abstract":"  Multimodal large language models (LLMs) have demonstrated impressive\ncapabilities in generating high-quality images from textual instructions.\nHowever, their performance in generating scientific images--a critical\napplication for accelerating scientific progress--remains underexplored. In\nthis work, we address this gap by introducing ScImage, a benchmark designed to\nevaluate the multimodal capabilities of LLMs in generating scientific images\nfrom textual descriptions. ScImage assesses three key dimensions of\nunderstanding: spatial, numeric, and attribute comprehension, as well as their\ncombinations, focusing on the relationships between scientific objects (e.g.,\nsquares, circles). We evaluate five models, GPT-4o, Llama, AutomaTikZ, Dall-E,\nand StableDiffusion, using two modes of output generation: code-based outputs\n(Python, TikZ) and direct raster image generation. Additionally, we examine\nfour different input languages: English, German, Farsi, and Chinese. Our\nevaluation, conducted with 11 scientists across three criteria (correctness,\nrelevance, and scientific accuracy), reveals that while GPT-4o produces outputs\nof decent quality for simpler prompts involving individual dimensions such as\nspatial, numeric, or attribute understanding in isolation, all models face\nchallenges in this task, especially for more complex prompts.\n","subjects":["Computer Science/Artificial Intelligence","Computer Science/Computation and Language","Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"cIYuLSrda31mbIliSTtAl8776xx4_mhhWXGJ5n06mRc","pdfSize":"3816598"}