{
  "id": "2412.01999",
  "title": "AVA: Fault-tolerant Reconfigurable Geo-Replication on Heterogeneous\n  Clusters",
  "authors": "Tejas Mane, Xiao Li, Mohammad Sadoghi, Mohsen Lesani",
  "authorsParsed": [
    [
      "Mane",
      "Tejas",
      ""
    ],
    [
      "Li",
      "Xiao",
      ""
    ],
    [
      "Sadoghi",
      "Mohammad",
      ""
    ],
    [
      "Lesani",
      "Mohsen",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 22:07:23 GMT"
    }
  ],
  "updateDate": "2024-12-04",
  "timestamp": 1733177243000,
  "abstract": "  Fault-tolerant replicated database systems consume less energy than the\ncompute-intensive proof-of-work blockchain. Thus, they are promising\ntechnologies for the building blocks that assemble global financial\ninfrastructure. To facilitate global scaling, clustered replication protocols\nare essential in orchestrating nodes into clusters based on proximity. However,\nthe existing approaches often assume a homogeneous and fixed model in which the\nnumber of nodes across clusters is the same and fixed, and often limited to a\nfail-stop fault model. This paper presents heterogeneous and reconfigurable\nclustered replication for the general environment with arbitrary failures. In\nparticular, we present AVA, a fault-tolerant reconfigurable geo-replication\nthat allows dynamic membership: replicas are allowed to join and leave\nclusters. We formally state and prove the safety and liveness properties of the\nprotocol. Furthermore, our replication protocol is consensus-agnostic, meaning\neach cluster can utilize any local replication mechanism. In our comprehensive\nevaluation, we instantiate our replication with both HotStuff and BFT-SMaRt.\nExperiments on geo-distributed deployments on Google Cloud demonstrates that\nmembers of clusters can be reconfigured without considerably affecting\ntransaction processing, and that heterogeneity of clusters may significantly\nimprove throughput.\n",
  "subjects": [
    "Computer Science/Distributed, Parallel, and Cluster Computing"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "H7GxqMca0Ly2j9l7SKiSHtrU4eYVzp3o33OHwq5Tp80",
  "pdfSize": "921639"
}