{
  "id": "2412.05643",
  "title": "Hydrodynamic density-functional theory for the moving contact-line\n  problem reveals fluid structure and emergence of a spatially distinct pattern",
  "authors": "Andreas Nold, Benjamin D. Goddard, David N. Sibley, Serafim\n  Kalliadasis",
  "authorsParsed": [
    [
      "Nold",
      "Andreas",
      ""
    ],
    [
      "Goddard",
      "Benjamin D.",
      ""
    ],
    [
      "Sibley",
      "David N.",
      ""
    ],
    [
      "Kalliadasis",
      "Serafim",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 7 Dec 2024 13:12:40 GMT"
    }
  ],
  "updateDate": "2025-01-06",
  "timestamp": 1733577160000,
  "abstract": "  Understanding the nanoscale effects controlling the dynamics of a contact\nline -- defined as the line formed at the junction of two fluid phases and a\nsolid -- has been a longstanding problem in fluid mechanics pushing\nexperimental and numerical methods to their limits. A major challenge is the\nmultiscale nature of the problem, whereby nanoscale phenomena manifest\nthemselves at the macroscale. To probe the nanoscale, not easily accessible to\nother methods, we propose a reductionist model that employs elements from\nstatistical mechanics, namely dynamic-density-functional theory (DDFT), in a\nNavier-Stokes-like equation -- an approach we name hydrodynamic DDFT. The model\nis applied to an isothermal Lennard-Jones-fluid with no slip on a flat solid\nsubstrate. Our computations reveal fluid stratification with an oscillatory\ndensity structure close to the wall and the emergence of two distinct regions\nas the temperature increases: a region of compression on the vapor side of the\nliquid-vapour interface and an effective slip region of large shear on the\nliquid side. The compressive region spreads along the fluid interface at a\nlengthscale that increases faster than the width of the fluid interface with\ntemperature, while the width of the slip region is bound by the oscillatory\nfluid density structure and is constrained to a few particle diameters from the\nwall. Both compressive and shear effects may offset contact line friction,\nwhile compression in particular has a disproportionately high effect on the\nspeed of advancing contact lines at low temperatures.\n",
  "subjects": [
    "Physics/Fluid Dynamics",
    "Condensed Matter/Statistical Mechanics",
    "Physics/Chemical Physics",
    "Physics/Computational Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "OJnmvexqkyeztNkRyIbpCbTJsIyYfqbGrdohTyK6drw",
  "pdfSize": "4890289"
}