{"id":"2412.03675","title":"JWST-TST DREAMS: A Precise Water Abundance for Hot Jupiter WASP-17b from\n  the NIRISS SOSS Transmission Spectrum","authors":"Dana R. Louie, Elijah Mullens, Lili Alderson, Ana Glidden, Nikole K.\n  Lewis, Hannah R. Wakeford, Natasha E. Batalha, Knicole D. Col\\'on, Am\\'elie\n  Gressier, Douglas Long, Michael Radica, N\\'estor Espinoza, Jayesh Goyal, Ryan\n  J. MacDonald, Erin M. May, Sara Seager, Kevin B. Stevenson, Jeff A. Valenti,\n  Natalie H. Allen, Caleb I. Ca\\~nas, Ryan C. Challener, David Grant, Jingcheng\n  Huang, Zifan Lin, Daniel Valentine, Mark Clampin, Marshall Perrin, Laurent\n  Pueyo, Roeland P. van der Marel, C. Matt Mountain","authorsParsed":[["Louie","Dana R.",""],["Mullens","Elijah",""],["Alderson","Lili",""],["Glidden","Ana",""],["Lewis","Nikole K.",""],["Wakeford","Hannah R.",""],["Batalha","Natasha E.",""],["Colón","Knicole D.",""],["Gressier","Amélie",""],["Long","Douglas",""],["Radica","Michael",""],["Espinoza","Néstor",""],["Goyal","Jayesh",""],["MacDonald","Ryan J.",""],["May","Erin M.",""],["Seager","Sara",""],["Stevenson","Kevin B.",""],["Valenti","Jeff A.",""],["Allen","Natalie H.",""],["Cañas","Caleb I.",""],["Challener","Ryan C.",""],["Grant","David",""],["Huang","Jingcheng",""],["Lin","Zifan",""],["Valentine","Daniel",""],["Clampin","Mark",""],["Perrin","Marshall",""],["Pueyo","Laurent",""],["van der Marel","Roeland P.",""],["Mountain","C. Matt",""]],"versions":[{"version":"v1","created":"Wed, 4 Dec 2024 19:15:00 GMT"},{"version":"v2","created":"Thu, 9 Jan 2025 19:04:54 GMT"}],"updateDate":"2025-01-13","timestamp":1733339700000,"abstract":"  Water has proven to be ubiquitously detected in near-infrared (NIR)\ntransmission spectroscopy observations of hot Jupiter atmospheres, including\nWASP-17b. However, previous analyses of WASP-17b's atmosphere based upon Hubble\nSpace Telescope (HST) and Spitzer data could not constrain the water abundance,\nfinding that sub-solar, super-solar and bimodal posterior distributions were\nall statistically valid. In this work, we observe one transit of the hot\nJupiter WASP-17b using JWST's Near Infrared Imager and Slitless Spectrograph\nSingle Object Slitless Spectroscopy (NIRISS SOSS) mode. We analyze our data\nusing three independent data analysis pipelines, finding excellent agreement\nbetween results. Our transmission spectrum shows multiple H$_2$O absorption\nfeatures and a flatter slope towards the optical than seen in previous HST\nobservations. We analyze our spectrum using both PICASO+Virga forward models\nand free retrievals. POSEIDON retrievals provide a well-constrained super-solar\n$\\log$(H$_2$O) abundance (-2.96$^{+0.31}_{-0.24}$), breaking the degeneracy\nfrom the previous HST/Spitzer analysis. We verify our POSEIDON results with\npetitRADTRANS retrievals. Additionally, we constrain the abundance of\n$\\log$(H$^-$), -10.19$^{+0.30}_{-0.23}$, finding that our model including H$^-$\nis preferred over our model without H$^-$ to 5.1 $\\sigma$. Furthermore, we\nconstrain the $\\log$(K) abundance (-8.07$^{+0.58}_{-0.52}$) in WASP-17b's\natmosphere for the first time using space-based observations. Our abundance\nconstraints demonstrate the power of NIRISS SOSS's increased resolution,\nprecision, and wavelength range to improve upon previous NIR space-based\nresults. This work is part of a series of studies by our JWST Telescope\nScientist Team (JWST-TST), in which we use Guaranteed Time Observations to\nperform Deep Reconnaissance of Exoplanet Atmospheres through Multi-instrument\nSpectroscopy (DREAMS).\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8401znXDmG-qNGemZHSCFGMmUp3XeJjpDNUJ1b5QM10","pdfSize":"35402592"}