{
  "id": "2412.20579",
  "title": "Crossover of Critical Behavior in Dynamic Phase Transitions of\n  Ferromagnetic Thin Films",
  "authors": "Erol Vatansever, Mikel Quintana, Andreas Berger",
  "authorsParsed": [
    [
      "Vatansever",
      "Erol",
      ""
    ],
    [
      "Quintana",
      "Mikel",
      ""
    ],
    [
      "Berger",
      "Andreas",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 29 Dec 2024 20:56:58 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735505818000,
  "abstract": "  We investigate the crossover of critical behavior for the dynamic phase\ntransition (DPT) in ferromagnetic thin films using Monte Carlo simulations of\nthe kinetic Ising model, focusing on the scaling behavior of the dynamic order\nparameter under a time-dependent external magnetic field. Specifically, we\nstudy the transition of the critical behavior of such film systems from\ntwo-dimensional (2D) to three-dimensional (3D) as a function of the film\nthickness and the distance to the critical point, which enables dimensional\ncrossover observations. Our results indicate that the effective critical\nexponents exhibit a clear transition in their scaling behavior, with thinner\nfilms showing 2D-like characteristics and thicker films displaying 3D-like\nbehavior, for both the DPT and the thermodynamic phase transitions (TPT).\nQuantitatively, the crossover from 2D to 3D behavior occurs at larger film\nthicknesses for the DPT compared to the TPT, suggesting that DPT and TPT are\ngoverned by distinctly different length scales and underlying surface effects.\nThese findings are in agreement with experimental observations in ultrathin Co\nfilms, where dynamic and thermodynamic critical exponents were found to differ.\nTherefore, our study provides an in-depth explanation for critical phenomena in\nthin-film ferromagnets driven by a time-dependent magnetic field. By comparing\nthe dimensional crossover properties of both TPT and DPT, we present a\ncomprehensive understanding of how thin-film geometry and surface effects\ninfluence the scaling laws and critical behavior in nonequilibrium systems.\n",
  "subjects": [
    "Condensed Matter/Statistical Mechanics"
  ],
  "license": "http://creativecommons.org/publicdomain/zero/1.0/",
  "blobId": "6QFwxQwl9NL-eVBY4ipxglX_ipKI8MqgMob1ZKsxpoc",
  "pdfSize": "596687"
}