{
  "id": "2412.06625",
  "title": "Local Magnetoelectric Effects as a Predictor of Surface Magnetic Order",
  "authors": "Sophie F. Weber, Andrea Urru, Nicola A. Spaldin",
  "authorsParsed": [
    [
      "Weber",
      "Sophie F.",
      ""
    ],
    [
      "Urru",
      "Andrea",
      ""
    ],
    [
      "Spaldin",
      "Nicola A.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 16:17:26 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733761046000,
  "abstract": "  We use symmetry analysis and density functional theory to show that changes\nin magnetic order at a surface with respect to magnetic order in the bulk can\nbe generically determined by considering local magnetoelectric responses of the\ncrystal. Specifically, analysis of the atomic-site magnetoelectric responses,\nor equivalently the corresponding local magnetic multipoles, can be used to\npredict all surface magnetic modifications arising purely from symmetry\nlowering via termination of the bulk magnetic order. This analysis applies even\nin materials with no bulk magnetoelectric response or surface magnetization. We\nthen demonstrate our arguments for two example antiferromagnets, metallic\n$\\mathrm{CuMnAs}$ and rock-salt $\\mathrm{NiO}$. We find that the $(010)$ and\n$(1\\bar{1}0)$ surfaces of $\\mathrm{CuMnAs}$ and $\\mathrm{NiO}$ respectively\nexhibit a series of antiferroically, as well as roughness-sensitive,\nferroically ordered, modifications of the surface magnetic dipole moments, via\ncanting or changes in sublattice magnitude, consistent with the bulk ordering\nof the magnetic multipoles. Our findings demonstrate a universal bulk-boundary\ncorrespondance allowing the general prediction of minimal possible surface and\ninterface magnetic modifications, even in non-magnetoelectric materials.\nFurthermore, it paves the way for more accurate interpretations of a wide\nvariety of surface-sensitive measurements.\n",
  "subjects": [
    "Condensed Matter/Materials Science"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "_E2Qhb9-imhuDTJ6xJbnAs_wT7X2E-BPSVVtirOz89w",
  "pdfSize": "2467658"
}