{"id":"2412.00107","title":"Virtual Sensing to Enable Real-Time Monitoring of Inaccessible Locations\n  \\& Unmeasurable Parameters","authors":"Kazuma Kobayashi, Farid Ahmed, Syed Bahauddin Alam","authorsParsed":[["Kobayashi","Kazuma",""],["Ahmed","Farid",""],["Alam","Syed Bahauddin",""]],"versions":[{"version":"v1","created":"Thu, 28 Nov 2024 00:58:29 GMT"}],"updateDate":"2024-12-03","timestamp":1732755509000,"abstract":"  Real-time monitoring of critical parameters is essential for energy systems'\nsafe and efficient operation. However, traditional sensors often fail and\ndegrade in harsh environments where physical sensors cannot be placed\n(inaccessible locations). In addition, there are important parameters that\ncannot be directly measured by sensors. We need machine learning (ML)-based\nreal-time monitoring in those remote locations to ensure system operations.\nHowever, traditional ML models struggle to process continuous sensor profile\ndata to fit model requirements, leading to the loss of spatial relationships.\nAnother challenge for real-time monitoring is ``dataset shift\" and the need for\nfrequent retraining under varying conditions, where extensive retraining\nprohibits real-time inference. To resolve these challenges, this study\naddressed the limitations of real-time monitoring methods by enabling\nmonitoring in locations where physical sensors are impractical to deploy. Our\nproposed approach, utilizing Multi-Input Operator Network virtual sensors,\nleverages deep learning to seamlessly integrate diverse data sources and\naccurately predict key parameters in real-time without the need for additional\nphysical sensors. The approach's effectiveness is demonstrated through\nthermal-hydraulic monitoring in a nuclear reactor subchannel, achieving\nremarkable accuracy.\n","subjects":["Computer Science/Machine Learning","Computer Science/Artificial Intelligence","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"i4Vd-86lKI7Rtvx3Wqe9QFPK6umsaUmr9EPNEBU2prc","pdfSize":"5150917"}