{
  "id": "2412.10619",
  "title": "Separation of measurement uncertainty into quantum and classical parts\n  based on Kirkwood-Dirac quasiprobability and generalized entropy",
  "authors": "Agung Budiyono",
  "authorsParsed": [
    [
      "Budiyono",
      "Agung",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 23:58:37 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734134317000,
  "abstract": "  Measurement in quantum mechanics is notoriously unpredictable. The\nuncertainty in quantum measurement can arise from the noncommutativity between\nthe state and the measurement basis which is intrinsically quantum, but it may\nalso be of classical origin due to the agent's ignorance. It is of fundamental\nas well as practical importance to cleanly separate the two contributions which\ncan be directly accessed using laboratory operations. Here, we propose two ways\nof decomposition of the total measurement uncertainty additively into quantum\nand classical parts. In the two decompositions, the total uncertainty of a\nmeasurement described by a POVM (positive-operator-valued measure) over a\nquantum state is quantified respectively by two generalized nonadditive\nentropies of the measurement outcomes; the quantum parts are identified,\nrespectively, by the nonreality and the nonclassicality | which captures\nsimultaneously both the nonreality and negativity | of the associated\ngeneralized Kirkwood-Dirac quasiprobability relative to the POVM of interest\nand a PVM (projection-valued measure) and maximized over all possible choices\nof the latter; and, the remaining uncertainties are identified as the classical\nparts. Both decompositions are shown to satisfy a few plausible requirements.\nThe minimum of the total measurement uncertainties in the two decompositions\nover all POVM measurements are given by the impurity of the quantum state\nquantified by certain generalized quantum entropies, and are entirely\nclassical. We argue that nonvanishing genuine quantum uncertainty in the two\ndecompositions are sufficient and necessary to prove quantum contextuality via\nweak measurement with postselection. Finally, we suggest that the genuine\nquantum uncertainty is a manifestation of a specific measurement disturbance.\n",
  "subjects": [
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "NVTXIlreT-GPPk0_SFyakK4MQ0kJ1ZfPdj92UQeKLh8",
  "pdfSize": "324205"
}