{
  "id": "2412.15181",
  "title": "Spatial anisotropies from long wavelength tensor modes",
  "authors": "Jorge Nore\\~na, Thiago Pereira, and Sean K. Reynolds",
  "authorsParsed": [
    [
      "Noreña",
      "Jorge",
      ""
    ],
    [
      "Pereira",
      "Thiago",
      ""
    ],
    [
      "Reynolds",
      "Sean K.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 18:53:56 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734634436000,
  "abstract": "  We study the leading physical effect of superhorizon scalar and tensor\nfluctuations on a flat adiabatic universe. We show that it is described by one\nof three Bianchi solutions. It is well known that adiabatic scalar\nperturbations with wavelengths comparable to the horizon scale can mimic the\nspatial curvature of an otherwise flat Friedmann universe. Similarly, adiabatic\ntensor perturbations in the same long-wavelength limit are known to behave as a\nhomogeneous shearing of the background spacetime, as observed in Bianchi type I\ncosmologies. In this work, we examine whether the simultaneous evolution of\nscalar and tensor adiabatic modes in the near-horizon regime could give rise to\nmore general Bianchi cosmologies, including spatially curved cases. Assuming a\nmatter-dominated universe, and working to first order in perturbations but at\nsecond order in a spatial gradient expansion, we identify modes that are either\npure gauge or unsourced, rendering them unobservable. This enables us to derive\nan effective metric that retains the spatial symmetries of three known Bianchi\ncosmologies: type I, V, and IX. These correspond to cases where the \"curvature\"\ninduced by scalar perturbations is zero, negative, or positive, respectively.\n",
  "subjects": [
    "Physics/General Relativity and Quantum Cosmology"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "BEpEQQvqxftTnsHZyx960NO_e2N985YryUVrzSFch-k",
  "pdfSize": "225345"
}