{"id":"2412.15318","title":"Operator K-complexity in DSSYK: Krylov complexity equals bulk length","authors":"Marco Ambrosini, Eliezer Rabinovici, Adri\\'an S\\'anchez-Garrido, Ruth\n  Shir, Julian Sonner","authorsParsed":[["Ambrosini","Marco",""],["Rabinovici","Eliezer",""],["Sánchez-Garrido","Adrián",""],["Shir","Ruth",""],["Sonner","Julian",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 18:54:30 GMT"}],"updateDate":"2024-12-23","timestamp":1734634470000,"abstract":"  In this paper we study the notion of complexity under time evolution in\nchaotic quantum systems with holographic duals. Continuing on from our previous\nwork, we turn our attention to the issue of Krylov complexity upon the\ninsertion of a class of single-particle operators in the double-scaled SYK\nmodel. Such an operator is described by a matter-chord insertion, which splits\nthe theory into left/right sectors, allowing us, via chord-diagram technology,\nto compute two different notions of complexity associated to the operator\ninsertion: firstly the Krylov complexity of Heisenberg evolution, and secondly\nthe complexity of a state obtained by an operator acting on the thermofield\ndouble state. We will provide both an analytical proof and detailed numerical\nevidence, that both Krylov complexities arise from a recursively defined basis\nof states characterized by a constant total chord number. As a consequence, in\nall cases we are able to establish that Krylov complexity is given by the\nexpectation value of a length operator acting on the Hilbert space of the\ntheory, expressed in terms of basis states, organized by left and right chord\nnumber. We find analytical expressions for the semiclassical limit of\nK-complexity, and study how the size of the operator encodes the scrambling\ndynamics upon the matter insertion in Krylov language. We furthermore determine\nthe effective Hamiltonian governing the evolution of K-complexity, showing that\nevolution on the Krylov chain can equivalently be understood as a particle\nmoving in a Morse potential. A particular type of triple scaling limit allows\nto access the gravitational sector of the theory, in which the geometrical\nnature of K-complexity is assured by virtue of being a total chord length, in\nan analogous fashion to what was found for the K-complexity of the thermofield\ndouble state.\n","subjects":["Physics/High Energy Physics - Theory","Condensed Matter/Strongly Correlated Electrons","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"K8Gb-oJfc8x_RDHyMlgkSl1oJYqSA3r1a0wQ_WT2-2Q","pdfSize":"5190605"}