{"id":"2412.19735","title":"A General Framework of Brain Region Detection And Genetic Variants\n  Selection in Imaging Genetics","authors":"Siqiang Su, Zhenghao Li, Long Feng, Ting Li","authorsParsed":[["Su","Siqiang",""],["Li","Zhenghao",""],["Feng","Long",""],["Li","Ting",""]],"versions":[{"version":"v1","created":"Fri, 27 Dec 2024 16:54:11 GMT"},{"version":"v2","created":"Mon, 30 Dec 2024 09:30:18 GMT"}],"updateDate":"2024-12-31","timestamp":1735318451000,"abstract":"  Imaging genetics is a growing field that employs structural or functional\nneuroimaging techniques to study individuals with genetic risk variants\npotentially linked to specific illnesses. This area presents considerable\nchallenges to statisticians due to the heterogeneous information and different\ndata forms it involves. In addition, both imaging and genetic data are\ntypically high-dimensional, creating a \"big data squared\" problem. Moreover,\nbrain imaging data contains extensive spatial information. Simply vectorizing\ntensor images and treating voxels as independent features can lead to\ncomputational issues and disregard spatial structure. This paper presents a\nnovel statistical method for imaging genetics modeling while addressing all\nthese challenges. We explore a Canonical Correlation Analysis based linear\nmodel for the joint modeling of brain imaging, genetic information, and\nclinical phenotype, enabling the simultaneous detection of significant brain\nregions and selection of important genetic variants associated with the\nphenotype outcome. Scalable algorithms are developed to tackle the \"big data\nsquared\" issue. We apply the proposed method to explore the reaction speed, an\nindicator of cognitive functions, and its associations with brain MRI and\ngenetic factors using the UK Biobank database. Our study reveals a notable\nconnection between the caudate nucleus region of brain and specific significant\nSNPs, along with their respective regulated genes, and the reaction speed.\n","subjects":["Statistics/Applications"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"e5zQGVcp6erGRg-dtrj1xjqnMBjr_IY7eotvEV8_sAQ","pdfSize":"4363719"}