{
  "id": "2412.15979",
  "title": "MR-GDINO: Efficient Open-World Continual Object Detection",
  "authors": "Bowen Dong, Zitong Huang, Guanglei Yang, Lei Zhang, Wangmeng Zuo",
  "authorsParsed": [
    [
      "Dong",
      "Bowen",
      ""
    ],
    [
      "Huang",
      "Zitong",
      ""
    ],
    [
      "Yang",
      "Guanglei",
      ""
    ],
    [
      "Zhang",
      "Lei",
      ""
    ],
    [
      "Zuo",
      "Wangmeng",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 15:22:51 GMT"
    },
    {
      "version": "v2",
      "created": "Mon, 23 Dec 2024 16:55:57 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734708171000,
  "abstract": "  Open-world (OW) recognition and detection models show strong zero- and\nfew-shot adaptation abilities, inspiring their use as initializations in\ncontinual learning methods to improve performance. Despite promising results on\nseen classes, such OW abilities on unseen classes are largely degenerated due\nto catastrophic forgetting. To tackle this challenge, we propose an open-world\ncontinual object detection task, requiring detectors to generalize to old, new,\nand unseen categories in continual learning scenarios. Based on this task, we\npresent a challenging yet practical OW-COD benchmark to assess detection\nabilities. The goal is to motivate OW detectors to simultaneously preserve\nlearned classes, adapt to new classes, and maintain open-world capabilities\nunder few-shot adaptations. To mitigate forgetting in unseen categories, we\npropose MR-GDINO, a strong, efficient and scalable baseline via memory and\nretrieval mechanisms within a highly scalable memory pool. Experimental results\nshow that existing continual detectors suffer from severe forgetting for both\nseen and unseen categories. In contrast, MR-GDINO largely mitigates forgetting\nwith only 0.1% activated extra parameters, achieving state-of-the-art\nperformance for old, new, and unseen categories.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "al-nV56IouBffUdc74OazHXoNgXXf7N1U_vHxdAtX_U",
  "pdfSize": "3101993"
}