{"id":"2412.08810","title":"Efficient Dynamic Attributed Graph Generation","authors":"Fan Li, Xiaoyang Wang, Dawei Cheng, Cong Chen, Ying Zhang, and Xuemin\n  Lin","authorsParsed":[["Li","Fan",""],["Wang","Xiaoyang",""],["Cheng","Dawei",""],["Chen","Cong",""],["Zhang","Ying",""],["Lin","Xuemin",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 22:53:27 GMT"}],"updateDate":"2024-12-13","timestamp":1733957607000,"abstract":"  Data generation is a fundamental research problem in data management due to\nits diverse use cases, ranging from testing database engines to data-specific\napplications. However, real-world entities often involve complex interactions\nthat cannot be effectively modeled by traditional tabular data. Therefore,\ngraph data generation has attracted increasing attention recently. Although\nvarious graph generators have been proposed in the literature, there are three\nlimitations: i) They cannot capture the co-evolution pattern of graph structure\nand node attributes. ii) Few of them consider edge direction, leading to\nsubstantial information loss. iii) Current state-of-the-art dynamic graph\ngenerators are based on the temporal random walk, making the simulation process\ntime-consuming. To fill the research gap, we introduce VRDAG, a novel\nvariational recurrent framework for efficient dynamic attributed graph\ngeneration. Specifically, we design a bidirectional message-passing mechanism\nto encode both directed structural knowledge and attribute information of a\nsnapshot. Then, the temporal dependency in the graph sequence is captured by a\nrecurrence state updater, generating embeddings that can preserve the evolution\npattern of early graphs. Based on the hidden node embeddings, a conditional\nvariational Bayesian method is developed to sample latent random variables at\nthe neighboring timestep for new snapshot generation. The proposed generation\nparadigm avoids the time-consuming path sampling and merging process in\nexisting random walk-based methods, significantly reducing the synthesis time.\nFinally, comprehensive experiments on real-world datasets are conducted to\ndemonstrate the effectiveness and efficiency of the proposed model.\n","subjects":["Computer Science/Databases","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"fD8Sl00dFIKCBCT1jeNLiAGGuXM2gorNfnyBWRoORX0","pdfSize":"773909"}