{
  "id": "2412.18341",
  "title": "Quantum Anharmonic Effects on the Superconductivity of I-43m CH4-H3S at\n  High Pressures: a First-Principles Study",
  "authors": "Pugeng Hou, Francesco Belli, Tiange Bi, Eva Zurek, and Ion Errea",
  "authorsParsed": [
    [
      "Hou",
      "Pugeng",
      ""
    ],
    [
      "Belli",
      "Francesco",
      ""
    ],
    [
      "Bi",
      "Tiange",
      ""
    ],
    [
      "Zurek",
      "Eva",
      ""
    ],
    [
      "Errea",
      "Ion",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 24 Dec 2024 10:59:37 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1735037977000,
  "abstract": "  Making use of first-principles calculations we analyze the effect of quantum\nionic fluctuations and lattice anharmonicity on the crystal structure and\nsuperconductivity of I-43m CH4-H3S, one of the lowest enthalpy structures in\nthe C-S-H system, in the 150-300 GPa pressure range within the stochastic\nself-consistent harmonic approximation. We predict a correction to the crystal\nstructure, which is formed by an H3S lattice and CH4 molecules, the phonon\nspectra, and the pressure-dependent superconducting critical temperatures,\nwhich have been estimated in previous calculations without considering ionic\nfluctuations on the crystal structure and assuming the harmonic approximation\nfor the lattice dynamics. Our results show that quantum ionic fluctuations have\nan impact on the distance between H atoms and S atoms in the H3S host lattice,\npushing it towards more symmetric bonds, while the methane molecules are barely\naffected. According to our anharmonic phonon spectra, this structure is\ndynamically stable above 150 GPa, which is 30 GPa lower than the pressure at\nwhich the harmonic approximation predicts the emergence of an instability. As a\nconsequence of the strong anharmonic enhancement of the phonon frequencies, the\nelectron-phonon coupling constant is suppressed by 46% at 200 GPa, and even\nmore at lower pressures. As a result, the superconducting critical temperature\nis overestimated by around 50 K at 200 GPa, such that it falls below 150 K in\nthe whole pressure range studied. Our results underline that ternary hydrides\nare subject to strong anharmonic effects on their structural, vibrational, and\nsuperconducting properties.\n",
  "subjects": [
    "Condensed Matter/Materials Science",
    "Condensed Matter/Superconductivity",
    "Physics/Applied Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "-LtEXAcmBgr_eNLaFH0zldkq3pINFzwRotCKBPzWAGI",
  "pdfSize": "40469020"
}