{
  "id": "2412.16126",
  "title": "A Scenario-Based Assessment of the Long-Term Funding Adequacy of the\n  German Nuclear Waste Fund KENFO",
  "authors": "Mahdi Awawda, Alexander Wimmers",
  "authorsParsed": [
    [
      "Awawda",
      "Mahdi",
      ""
    ],
    [
      "Wimmers",
      "Alexander",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 18:18:38 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734718718000,
  "abstract": "  The German site selection process for high-level nuclear waste was initially\nplanned to conclude in 2031, with the deep geological repository sealed around\nthe year 2080. However, in 2022, substantial delays were announced by the\nresponsible federal agency, pushing the site selection to 2046 or even 2068.\nWith this delay come uncertainties regarding the duration, consequential\nknowledge management, and funding. German nuclear waste management activities\nare funded by the external segregated fund KENFO, which is designed to ensure\nsufficient funding via generating returns on investments (ROI) in the coming\ndecades. Given recent developments, we assess the adequacy of the fund volume\nbased on seven scenarios depicting potential process delays. We find that the\ntarget ROI of 3.7% will not suffice in any case, even if the site selection\nconcludes in 2031, and that cash injections of up to EUR31.07 billion are\nnecessary today to ensure that the fund volume will suffice. We conclude that\ncost estimations must be updated, KENFO must increase its target ROIs,\npotential capital injections must be openly discussed by policymakers, and a\nprocedural acceleration should be implemented to ensure that financial\nliabilities for nuclear waste management are minimized for future taxpayers.\n",
  "subjects": [
    "Economics/General Economics",
    "Quantitative Finance/Economics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "8-QoNQZ4ywC7HwJ5flv94wayJlS6hhEGXXGK3Zri9Zo",
  "pdfSize": "972161"
}