{"id":"2412.12167","title":"Greek2MathTex: A Greek Speech-to-Text Framework for LaTeX Equations\n  Generation","authors":"Evangelia Gkritzali, Panagiotis Kaliosis, Sofia Galanaki, Elisavet\n  Palogiannidi, Theodoros Giannakopoulos","authorsParsed":[["Gkritzali","Evangelia",""],["Kaliosis","Panagiotis",""],["Galanaki","Sofia",""],["Palogiannidi","Elisavet",""],["Giannakopoulos","Theodoros",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 22:29:44 GMT"}],"updateDate":"2024-12-18","timestamp":1733956184000,"abstract":"  In the vast majority of the academic and scientific domains, LaTeX has\nestablished itself as the de facto standard for typesetting complex\nmathematical equations and formulae. However, LaTeX's complex syntax and\ncode-like appearance present accessibility barriers for individuals with\ndisabilities, as well as those unfamiliar with coding conventions. In this\npaper, we present a novel solution to this challenge through the development of\na novel speech-to-LaTeX equations system specifically designed for the Greek\nlanguage. We propose an end-to-end system that harnesses the power of Automatic\nSpeech Recognition (ASR) and Natural Language Processing (NLP) techniques to\nenable users to verbally dictate mathematical expressions and equations in\nnatural language, which are subsequently converted into LaTeX format. We\npresent the architecture and design principles of our system, highlighting key\ncomponents such as the ASR engine, the LLM-based prompt-driven equations\ngeneration mechanism, as well as the application of a custom evaluation metric\nemployed throughout the development process. We have made our system open\nsource and available at https://github.com/magcil/greek-speech-to-math.\n","subjects":["Computer Science/Computation and Language","Computer Science/Artificial Intelligence","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0mwZ27LxTYGpuFlZpMICYU2iinUEPoIuuGGkqxmh4b4","pdfSize":"999896"}