{
  "id": "2412.05429",
  "title": "A Unified Theory for Chaotic Mixing in Porous Media: from Pore Networks\n  to Granular Systems",
  "authors": "Daniel Lester and Joris Heyman and Yves Meheust and Tanguy Le Borgne",
  "authorsParsed": [
    [
      "Lester",
      "Daniel",
      ""
    ],
    [
      "Heyman",
      "Joris",
      ""
    ],
    [
      "Meheust",
      "Yves",
      ""
    ],
    [
      "Borgne",
      "Tanguy Le",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 21:23:17 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733520197000,
  "abstract": "  Recent studies have revealed the central role of chaotic stretching and\nfolding at the pore scale in controlling mixing within porous media, whether\nthe solid phase is discrete (as in granular and packed media) or continuous (as\nin vascular networks and open porous structures). Despite its widespread\noccurrence, a unified theory of chaotic mixing across these diverse systems\nremains to be developed. Furthermore, previous studies have focused on fluid\nstretching mechanisms but the folding mechanisms are largely unknown. We\naddress these shortcomings by presenting a unified theory of mixing in porous\nmedia. We thus show that fluid stretching and folding (SF) arise through the\nsame fundamental kinematics driven by the topological complexity of the medium.\nWe find that mixing in continuous porous media manifests as discontinuous\nmixing through a combination of SF and cutting and shuffling (CS) actions, but\nthe rate of mixing is governed by SF only. Conversely, discrete porous media\ninvolves SF motions only. We unify these diverse systems and mechanisms by\nshowing that continuous media represents an analog of discrete media with\nfinite-sized grain contacts. This unified theory provides insights into the\ngeneration of pore-scale chaotic mixing and points to design of novel porous\narchitectures with tuneable mixing and transport properties.\n",
  "subjects": [
    "Physics/Fluid Dynamics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "gMFQNVa12GWFT3cF2xL_hLha-U8QETA0aMFgt44cn2Q",
  "pdfSize": "17457466"
}