{"id":"2412.19451","title":"Signatures of Core-Envelope Rotational Misalignment in the Mixed-Mode\n  Asteroseismology of Kepler-56","authors":"J. M. Joel Ong","authorsParsed":[["Ong","J. M. Joel",""]],"versions":[{"version":"v1","created":"Fri, 27 Dec 2024 04:40:25 GMT"}],"updateDate":"2024-12-30","timestamp":1735274425000,"abstract":"  Existing asteroseismic rotational measurements assume that stars rotate\naround a single axis. However, tidal torques from misaligned companions, or\ntheir possible engulfment, may bring the rotational axis of a star's envelope\nout of alignment with its core, breaking azimuthal symmetry. I derive\nperturbative expressions for asteroseismic signatures of such hitherto\nunexamined rotational configurations, under the ``shellular approximation'' of\nconstant rotation rates on radially stratified mass shells. In the aligned\ncase, the distribution of power between multiplet components is determined by\nthe inclination of the rotational axis; radial differential misalignment causes\nthis to vary from multiplet to multiplet. I examine in particular detail the\nphenomenology of gravitoacoustic mixed modes as seen in evolved sub- and red\ngiants, where near-resonance avoided crossings may break geometrical\ndegeneracies. Upon applying the revised asteroseismic observational methodology\nthat results from this theoretical discussion to revisit Kepler-56 -- a red\ngiant with a misaligned planetary system -- I find that its core and envelope\nrotate around different rotational axes. While the rotational axis of its core\nis indeed misaligned from the orbit normal of its transiting planets\n(consistently with earlier studies), its envelope's rotational axis is close to\nlying in the sky plane, and may well be aligned with them. More detailed\nasteroseismic modelling, and spectroscopic follow-up, will be required to fully\nelucidate the full spin-orbit geometry of the Kepler-56 system, and potentially\ndiscriminate between hypotheses for how it formed.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"ZTudSVhwtkAvhrhBakEFkGCLd9zsOR0QQdZX8jFfvxg","pdfSize":"5553329"}