{"id":"2412.09567","title":"Temporal Triadic Closure: Finding Dense Structures in Social Networks\n  That Evolve","authors":"Tom Davot, Jessica Enright, Jayakrishnan Madathil, Kitty Meeks","authorsParsed":[["Davot","Tom",""],["Enright","Jessica",""],["Madathil","Jayakrishnan",""],["Meeks","Kitty",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 18:50:55 GMT"}],"updateDate":"2024-12-13","timestamp":1734029455000,"abstract":"  A graph G is c-closed if every two vertices with at least c common neighbors\nare adjacent to each other. Introduced by Fox, Roughgarden, Seshadhri, Wei and\nWein [ICALP 2018, SICOMP 2020], this definition is an abstraction of the\ntriadic closure property exhibited by many real-world social networks, namely,\nfriends of friends tend to be friends themselves. Social networks, however, are\noften temporal rather than static -- the connections change over a period of\ntime. And hence temporal graphs, rather than static graphs, are often better\nsuited to model social networks. Motivated by this, we introduce a definition\nof temporal c-closed graphs, in which if two vertices u and v have at least c\ncommon neighbors during a short interval of time, then u and v are adjacent to\neach other around that time. Our pilot experiments show that several real-world\ntemporal networks are c-closed for rather small values of c. We also study the\ncomputational problems of enumerating maximal cliques and similar dense\nsubgraphs in temporal c-closed graphs; a clique in a temporal graph is a\nsubgraph that lasts for a certain period of time, during which every possible\nedge in the subgraph becomes active often enough, and other dense subgraphs are\ndefined similarly. We bound the number of such maximal dense subgraphs in a\ntemporal c-closed graph that evolves slowly, and thus show that the\ncorresponding enumeration problems admit efficient algorithms; by slow\nevolution, we mean that between consecutive time-steps, the local change in\nadjacencies remains small. Our work also adds to a growing body of literature\non defining suitable structural parameters for temporal graphs that can be\nleveraged to design efficient algorithms.\n","subjects":["Computer Science/Data Structures and Algorithms","Computer Science/Discrete Mathematics","Computer Science/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"L40blkmSdYAhh-6uR3TSmww-pruPKi0ZYLcNjYZvoc0","pdfSize":"390368"}