{
  "id": "2412.01650",
  "title": "Privacy-Preserving Federated Learning via Homomorphic Adversarial\n  Networks",
  "authors": "Wenhan Dong, Chao Lin, Xinlei He, Xinyi Huang, Shengmin Xu",
  "authorsParsed": [
    [
      "Dong",
      "Wenhan",
      ""
    ],
    [
      "Lin",
      "Chao",
      ""
    ],
    [
      "He",
      "Xinlei",
      ""
    ],
    [
      "Huang",
      "Xinyi",
      ""
    ],
    [
      "Xu",
      "Shengmin",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 15:59:35 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 3 Dec 2024 05:46:35 GMT"
    }
  ],
  "updateDate": "2024-12-04",
  "timestamp": 1733155175000,
  "abstract": "  Privacy-preserving federated learning (PPFL) aims to train a global model for\nmultiple clients while maintaining their data privacy. However, current PPFL\nprotocols exhibit one or more of the following insufficiencies: considerable\ndegradation in accuracy, the requirement for sharing keys, and cooperation\nduring the key generation or decryption processes. As a mitigation, we develop\nthe first protocol that utilizes neural networks to implement PPFL, as well as\nincorporating an Aggregatable Hybrid Encryption scheme tailored to the needs of\nPPFL. We name these networks as Homomorphic Adversarial Networks (HANs) which\ndemonstrate that neural networks are capable of performing tasks similar to\nmulti-key homomorphic encryption (MK-HE) while solving the problems of key\ndistribution and collaborative decryption. Our experiments show that HANs are\nrobust against privacy attacks. Compared with non-private federated learning,\nexperiments conducted on multiple datasets demonstrate that HANs exhibit a\nnegligible accuracy loss (at most 1.35%). Compared to traditional MK-HE\nschemes, HANs increase encryption aggregation speed by 6,075 times while\nincurring a 29.2 times increase in communication overhead.\n",
  "subjects": [
    "Computer Science/Cryptography and Security",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "gL5ZG-W5CfvHbA3GohNB7NrAVONbz2Zb6AJjrnsRQMw",
  "pdfSize": "565862"
}