{
  "id": "2412.11405",
  "title": "Leveraging Machine Learning to Overcome Limitations in Quantum\n  Algorithms",
  "authors": "Laia Coronas Sala (1), Parfait Atchade-Adelemou (1 and 2) ((1)\n  Lighthouse Disruptive Innovation Group S.L., (2) MIT Media Lab)",
  "authorsParsed": [
    [
      "Sala",
      "Laia Coronas",
      "",
      "1 and 2"
    ],
    [
      "Atchade-Adelemou",
      "Parfait",
      "",
      "1 and 2"
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 03:14:14 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734318854000,
  "abstract": "  Quantum Computing (QC) offers outstanding potential for molecular\ncharacterization and drug discovery, particularly in solving complex properties\nlike the Ground State Energy (GSE) of biomolecules. However, QC faces\nchallenges due to computational noise, scalability, and system complexity. This\nwork presents a hybrid framework combining Machine Learning (ML) techniques\nwith quantum algorithms$-$Variational Quantum Eigensolver (VQE), Hartree-Fock\n(HF), and Quantum Phase Estimation (QPE)$-$to improve GSE predictions for large\nmolecules. Three datasets (chemical descriptors, Coulomb matrices, and a hybrid\ncombination) were prepared using molecular features from PubChem. These\ndatasets trained XGBoost (XGB), Random Forest (RF), and LightGBM (LGBM) models.\nXGB achieved the lowest Relative Error (RE) of $4.41 \\pm 11.18\\%$ on chemical\ndescriptors, outperforming RF ($5.56 \\pm 11.66\\%$) and LGBM ($5.32 \\pm\n12.87\\%$). HF delivered exceptional precision for small molecules ($0.44 \\pm\n0.66\\% RE$), while a near-linear correlation between GSE and molecular electron\ncount provided predictive shortcuts. This study demonstrates that integrating\nQC and ML enhances scalability for molecular energy predictions and lays the\nfoundation for scaling QC molecular simulations to larger systems.\n",
  "subjects": [
    "Physics/Chemical Physics",
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "wHZAAPUwHAFv_ni9ssv78bRtUNiB3sQJzGrUobxU4js",
  "pdfSize": "739065"
}