{
  "id": "2412.10630",
  "title": "Upstream flow geometries can be uniquely learnt from single-point\n  turbulence signatures",
  "authors": "Mukesh Karunanethy, Raghunathan Rengaswamy, Mahesh V Panchagnula",
  "authorsParsed": [
    [
      "Karunanethy",
      "Mukesh",
      ""
    ],
    [
      "Rengaswamy",
      "Raghunathan",
      ""
    ],
    [
      "Panchagnula",
      "Mahesh V",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 14 Dec 2024 00:55:34 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734137734000,
  "abstract": "  We test the hypothesis that the microscopic temporal structure of near-field\nturbulence downstream of a sudden contraction contains geometry-identifiable\ninformation pertaining to the shape of the upstream obstruction. We measure a\nset of spatially sparse velocity time-series data downstream of\ndifferently-shaped orifices. We then train random forest multiclass classifier\nmodels on a vector of invariants derived from this time-series. We test the\nabove hypothesis with 25 somewhat similar orifice shapes to push the model to\nits extreme limits. Remarkably, the algorithm was able to identify the orifice\nshape with 100% accuracy and 100% precision. This outcome is enabled by the\nuniqueness in the downstream temporal evolution of turbulence structures in the\nflow past orifices, combined with the random forests' ability to learn subtle\nyet discerning features in the turbulence microstructure. We are also able to\nexplain the underlying flow physics that enables such classification by listing\nthe invariant measures in the order of increasing information entropy. We show\nthat the temporal autocorrelation coefficients of the time-series are most\nsensitive to orifice shape and are therefore informative. The ability to\nidentify changes in system geometry without the need for physical disassembly\noffers tremendous potential for flow control and system identification.\nFurthermore, the proposed approach could potentially have significant\napplications in other unrelated fields as well, by deploying the core\nmethodology of training random forest classifiers on vectors of invariant\nmeasures obtained from time-series data.\n",
  "subjects": [
    "Physics/Fluid Dynamics",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "jxfw_7xaraWx-ub_RjIvQZg7aoOQXpYU_GalmFnB6mk",
  "pdfSize": "1815888"
}