{"id":"2412.12344","title":"Field-Resilient Supercurrent Diode in a Multiferroic Josephson Junction","authors":"Hung-Yu Yang, Joseph J. Cuozzo, Anand Johnson Bokka, Gang Qiu,\n  Christopher Eckberg, Yanfeng Lyu, Shuyuan Huyan, Ching-Wu Chu, Kenji\n  Watanabe, Takashi Taniguchi, Kang L. Wang","authorsParsed":[["Yang","Hung-Yu",""],["Cuozzo","Joseph J.",""],["Bokka","Anand Johnson",""],["Qiu","Gang",""],["Eckberg","Christopher",""],["Lyu","Yanfeng",""],["Huyan","Shuyuan",""],["Chu","Ching-Wu",""],["Watanabe","Kenji",""],["Taniguchi","Takashi",""],["Wang","Kang L.",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 20:36:06 GMT"}],"updateDate":"2024-12-18","timestamp":1734381366000,"abstract":"  The research on supercurrent diodes has surged rapidly due to their potential\napplications in electronic circuits at cryogenic temperatures. To unlock this\nfunctionality, it is essential to find supercurrent diodes that can work\nconsistently at zero magnetic field and under ubiquitous stray fields generated\nin electronic circuits. However, a supercurrent diode with robust field\ntolerance is currently lacking. Here, we demonstrate a field-resilient\nsupercurrent diode by incorporating a multiferroic material into a Josephson\njunction. We first observed a pronounced supercurrent diode effect at zero\nmagnetic field. More importantly, the supercurrent rectification persists over\na wide and bipolar magnetic field range beyond industrial standards for field\ntolerance. By theoretically modeling a multiferroic Josephson junction, we\nunveil that the interplay between spin-orbit coupling and multiferroicity\nunderlies the unusual field resilience of the observed diode effect. This work\nintroduces multiferroic Josephson junctions as a new field-resilient\nsuperconducting device for cryogenic electronics.\n","subjects":["Condensed Matter/Superconductivity","Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"jSHWhTp8ZvKjPNK5HPpJ_kHp_DG6Oa5rSN5o5uLoUTk","pdfSize":"5713783"}