{
  "id": "2412.01851",
  "title": "Generalized Loschmidt echo and information scrambling in open systems",
  "authors": "Yi-Neng Zhou, Chang Liu",
  "authorsParsed": [
    [
      "Zhou",
      "Yi-Neng",
      ""
    ],
    [
      "Liu",
      "Chang",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 29 Nov 2024 10:00:00 GMT"
    }
  ],
  "updateDate": "2024-12-04",
  "timestamp": 1732874400000,
  "abstract": "  Quantum information scrambling, typically explored in closed quantum systems,\ndescribes the spread of initially localized information throughout a system and\ncan be quantified by measures such as the Loschmidt echo (LE) and\nout-of-time-order correlator (OTOC). In this paper, we explore information\nscrambling in the presence of dissipation by generalizing the concepts of LE\nand OTOC to open quantum systems governed by Lindblad dynamics. We investigate\nthe universal dynamics of the generalized LE across regimes of weak and strong\ndissipation. In the weak dissipation regime, we identify a universal structure,\nwhile in the strong dissipation regime, we observe a distinctive\ntwo-local-minima structure, which we interpret through an analysis of the\nLindblad spectrum. Furthermore, we establish connections between the thermal\naverages of LE and OTOC and prove a general relation between OTOC and R\\'enyi\nentropy in open systems. Finally, we propose an experimental protocol for\nmeasuring OTOC in open systems. These findings provide deeper insights into\ninformation scrambling under dissipation and pave the way for experimental\nstudies in open quantum systems.\n",
  "subjects": [
    "Physics/Quantum Physics",
    "Condensed Matter/Disordered Systems and Neural Networks",
    "Condensed Matter/Quantum Gases",
    "Condensed Matter/Statistical Mechanics",
    "Condensed Matter/Strongly Correlated Electrons"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "xixhYf_j28zBD6C2uNXMyyghMF1fs07WdbggLWGmTYw",
  "pdfSize": "888473"
}