{"id":"2412.05127","title":"The Prompt Canvas: A Literature-Based Practitioner Guide for Creating\n  Effective Prompts in Large Language Models","authors":"Michael Hewing and Vincent Leinhos","authorsParsed":[["Hewing","Michael",""],["Leinhos","Vincent",""]],"versions":[{"version":"v1","created":"Fri, 6 Dec 2024 15:35:18 GMT"}],"updateDate":"2024-12-09","timestamp":1733499318000,"abstract":"  The rise of large language models (LLMs) has highlighted the importance of\nprompt engineering as a crucial technique for optimizing model outputs. While\nexperimentation with various prompting methods, such as Few-shot,\nChain-of-Thought, and role-based techniques, has yielded promising results,\nthese advancements remain fragmented across academic papers, blog posts and\nanecdotal experimentation. The lack of a single, unified resource to\nconsolidate the field's knowledge impedes the progress of both research and\npractical application. This paper argues for the creation of an overarching\nframework that synthesizes existing methodologies into a cohesive overview for\npractitioners. Using a design-based research approach, we present the Prompt\nCanvas, a structured framework resulting from an extensive literature review on\nprompt engineering that captures current knowledge and expertise. By combining\nthe conceptual foundations and practical strategies identified in prompt\nengineering, the Prompt Canvas provides a practical approach for leveraging the\npotential of Large Language Models. It is primarily designed as a learning\nresource for pupils, students and employees, offering a structured introduction\nto prompt engineering. This work aims to contribute to the growing discourse on\nprompt engineering by establishing a unified methodology for researchers and\nproviding guidance for practitioners.\n","subjects":["Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"DgBo1Nnduaex4q_HuL-WJU6qph4gVgnmxTnTgJHi-Vw","pdfSize":"658270"}