{
  "id": "2412.15126",
  "title": "Efficient Ranking, Order Statistics, and Sorting under CKKS",
  "authors": "Federico Mazzone, Maarten Everts, Florian Hahn, Andreas Peter",
  "authorsParsed": [
    [
      "Mazzone",
      "Federico",
      ""
    ],
    [
      "Everts",
      "Maarten",
      ""
    ],
    [
      "Hahn",
      "Florian",
      ""
    ],
    [
      "Peter",
      "Andreas",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 18:06:25 GMT"
    },
    {
      "version": "v2",
      "created": "Mon, 10 Feb 2025 12:57:44 GMT"
    }
  ],
  "updateDate": "2025-02-11",
  "timestamp": 1734631585000,
  "abstract": "  Fully Homomorphic Encryption (FHE) enables operations on encrypted data,\nmaking it extremely useful for privacy-preserving applications, especially in\ncloud computing environments. In such contexts, operations like ranking, order\nstatistics, and sorting are fundamental functionalities often required for\ndatabase queries or as building blocks of larger protocols. However, the high\ncomputational overhead and limited native operations of FHE pose significant\nchallenges for an efficient implementation of these tasks. These challenges are\nexacerbated by the fact that all these functionalities are based on comparing\nelements, which is a severely expensive operation under encryption. Previous\nsolutions have typically based their designs on swap-based techniques, where\ntwo elements are conditionally swapped based on the results of their\ncomparison. These methods aim to reduce the primary computational bottleneck:\nthe comparison depth, which is the number of non-parallelizable homomorphic\ncomparisons in the algorithm. The current state of the art solution for sorting\nby Hong et al. (IEEE TIFS 2021), for instance, achieves a comparison depth of k\nlog_k^2 N. In this paper, we address the challenge of reducing the comparison\ndepth by shifting away from the swap-based paradigm. We present solutions for\nranking, order statistics, and sorting, that achieve a comparison depth of up\nto 2 (constant), making our approach highly parallelizable and suitable for\nhardware acceleration. Leveraging the SIMD capabilities of the CKKS FHE scheme,\nour approach re-encodes the input vector under encryption to allow for\nsimultaneous comparisons of all elements with each other. Experimental results\nshow that our approach ranks a 128-element vector in approximately 5.76s,\ncomputes its argmin/argmax in 12.83s, and sorts it in 78.64s.\n",
  "subjects": [
    "Computer Science/Cryptography and Security"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "_FrhLpRseVB3cqocsl6T4RzA9nfF114a6nGZuHiY3T0",
  "pdfSize": "325893"
}