{
  "id": "2412.09918",
  "title": "Emission and Coherent Control of Levitons in Graphene",
  "authors": "A. Assouline, L. Pugliese, H. Chakraborti, Seunghun Lee, L. Bernabeu,\n  M. Jo, K. Watanabe, T. Taniguchi, D. C. Glattli, N. Kumada, H.-S. Sim, F. D.\n  Parmentier, P. Roulleau",
  "authorsParsed": [
    [
      "Assouline",
      "A.",
      ""
    ],
    [
      "Pugliese",
      "L.",
      ""
    ],
    [
      "Chakraborti",
      "H.",
      ""
    ],
    [
      "Lee",
      "Seunghun",
      ""
    ],
    [
      "Bernabeu",
      "L.",
      ""
    ],
    [
      "Jo",
      "M.",
      ""
    ],
    [
      "Watanabe",
      "K.",
      ""
    ],
    [
      "Taniguchi",
      "T.",
      ""
    ],
    [
      "Glattli",
      "D. C.",
      ""
    ],
    [
      "Kumada",
      "N.",
      ""
    ],
    [
      "Sim",
      "H. -S.",
      ""
    ],
    [
      "Parmentier",
      "F. D.",
      ""
    ],
    [
      "Roulleau",
      "P.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 07:13:09 GMT"
    }
  ],
  "updateDate": "2024-12-16",
  "timestamp": 1734073989000,
  "abstract": "  Flying qubits encode quantum information in propagating modes instead of\nstationary discrete states. Although photonic flying qubits are available, the\nweak interaction between photons limits the efficiency of conditional quantum\ngates. Conversely, electronic flying qubits can use Coulomb interactions, but\nthe weaker quantum coherence in conventional semiconductors has hindered their\nrealization. In this work, we engineered on-demand injection of a single\nelectronic flying qubit state and its manipulation over the Bloch sphere. The\nflying qubit is a Leviton propagating in quantum Hall edge channels of a\nhigh-mobility graphene monolayer. Although single-shot qubit readout and\ntwo-qubit operations are still needed for a viable manipulation of flying\nqubits, the coherent manipulation of an itinerant electronic state at the\nsingle-electron level presents a highly promising alternative to conventional\nqubits.\n",
  "subjects": [
    "Condensed Matter/Mesoscale and Nanoscale Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "SlDmeVYdpkRXtCxcxgVnXGvTqBdDgAEVgzNojhBHG7o",
  "pdfSize": "44510807"
}