{"id":"2412.14161","title":"TheAgentCompany: Benchmarking LLM Agents on Consequential Real World\n  Tasks","authors":"Frank F. Xu, Yufan Song, Boxuan Li, Yuxuan Tang, Kritanjali Jain,\n  Mengxue Bao, Zora Z. Wang, Xuhui Zhou, Zhitong Guo, Murong Cao, Mingyang\n  Yang, Hao Yang Lu, Amaad Martin, Zhe Su, Leander Maben, Raj Mehta, Wayne Chi,\n  Lawrence Jang, Yiqing Xie, Shuyan Zhou, Graham Neubig","authorsParsed":[["Xu","Frank F.",""],["Song","Yufan",""],["Li","Boxuan",""],["Tang","Yuxuan",""],["Jain","Kritanjali",""],["Bao","Mengxue",""],["Wang","Zora Z.",""],["Zhou","Xuhui",""],["Guo","Zhitong",""],["Cao","Murong",""],["Yang","Mingyang",""],["Lu","Hao Yang",""],["Martin","Amaad",""],["Su","Zhe",""],["Maben","Leander",""],["Mehta","Raj",""],["Chi","Wayne",""],["Jang","Lawrence",""],["Xie","Yiqing",""],["Zhou","Shuyan",""],["Neubig","Graham",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 18:55:40 GMT"}],"updateDate":"2024-12-19","timestamp":1734548140000,"abstract":"  We interact with computers on an everyday basis, be it in everyday life or\nwork, and many aspects of work can be done entirely with access to a computer\nand the Internet. At the same time, thanks to improvements in large language\nmodels (LLMs), there has also been a rapid development in AI agents that\ninteract with and affect change in their surrounding environments. But how\nperformant are AI agents at helping to accelerate or even autonomously perform\nwork-related tasks? The answer to this question has important implications for\nboth industry looking to adopt AI into their workflows, and for economic policy\nto understand the effects that adoption of AI may have on the labor market. To\nmeasure the progress of these LLM agents' performance on performing real-world\nprofessional tasks, in this paper, we introduce TheAgentCompany, an extensible\nbenchmark for evaluating AI agents that interact with the world in similar ways\nto those of a digital worker: by browsing the Web, writing code, running\nprograms, and communicating with other coworkers. We build a self-contained\nenvironment with internal web sites and data that mimics a small software\ncompany environment, and create a variety of tasks that may be performed by\nworkers in such a company. We test baseline agents powered by both closed\nAPI-based and open-weights language models (LMs), and find that with the most\ncompetitive agent, 24% of the tasks can be completed autonomously. This paints\na nuanced picture on task automation with LM agents -- in a setting simulating\na real workplace, a good portion of simpler tasks could be solved autonomously,\nbut more difficult long-horizon tasks are still beyond the reach of current\nsystems.\n","subjects":["Computer Science/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"SdoKUctv2g2qdwc0mKYBezNIot3TUpVe_WQ3B6dp2so","pdfSize":"2145769"}