{"id":"2412.03851","title":"FedMetaMed: Federated Meta-Learning for Personalized Medication in\n  Distributed Healthcare Systems","authors":"Jiechao Gao, Yuangang Li","authorsParsed":[["Gao","Jiechao",""],["Li","Yuangang",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 03:36:55 GMT"}],"updateDate":"2024-12-10","timestamp":1733369815000,"abstract":"  Personalized medication aims to tailor healthcare to individual patient\ncharacteristics. However, the heterogeneity of patient data across healthcare\nsystems presents significant challenges to achieving accurate and effective\npersonalized treatments. Ethical concerns further complicate the aggregation of\nlarge volumes of data from diverse institutions. Federated Learning (FL) offers\na promising decentralized solution by enabling collaborative model training\nthrough the exchange of client models rather than raw data, thus preserving\nprivacy. However, existing FL methods often suffer from retrogression during\nserver aggregation, leading to a decline in model performance in real-world\nmedical FL settings. To address data variability in distributed healthcare\nsystems, we introduce Federated Meta-Learning for Personalized Medication\n(FedMetaMed), which combines federated learning and meta-learning to create\nmodels that adapt to diverse patient data across healthcare systems. The\nFedMetaMed framework aims to produce superior personalized models for\nindividual clients by addressing these limitations. Specifically, we introduce\nCumulative Fourier Aggregation (CFA) at the server to improve stability and\neffectiveness in global knowledge aggregation. CFA achieves this by gradually\nintegrating client models from low to high frequencies. At the client level, we\nimplement a Collaborative Transfer Optimization (CTO) strategy with a\nthree-step process - Retrieve, Reciprocate, and Refine - to enhance the\npersonalized local model through seamless global knowledge transfer.\nExperiments on real-world medical imaging datasets demonstrate that FedMetaMed\noutperforms state-of-the-art FL methods, showing superior generalization even\non out-of-distribution cohorts.\n","subjects":["Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"LEFC7GpEE47CPhWvBwHWvh-b4gCl_Qu4rHMD7qFz4QY","pdfSize":"545474"}