{"id":"2412.00441","title":"Fine Grained Analysis and Optimization of Large Scale Automotive Radar\n  Networks","authors":"Mohammad Taha Shah, Gourab Ghatak, Shobha Sundar Ram","authorsParsed":[["Shah","Mohammad Taha",""],["Ghatak","Gourab",""],["Ram","Shobha Sundar",""]],"versions":[{"version":"v1","created":"Sat, 30 Nov 2024 11:30:57 GMT"}],"updateDate":"2024-12-03","timestamp":1732966257000,"abstract":"  Advanced driver assistance systems (ADAS) enabled by automotive radars have\nsignificantly enhanced vehicle safety and driver experience. However, the\nextensive use of radars in dense road conditions introduces mutual\ninterference, which degrades detection accuracy and reliability. Traditional\ninterference models are limited to simple highway scenarios and cannot\ncharacterize the performance of automotive radars in dense urban environments.\nIn our prior work, we employed stochastic geometry (SG) to develop two\nautomotive radar network models: the Poisson line Cox process (PLCP) for dense\ncity centers and smaller urban zones and the binomial line Cox process (BLCP)\nto encompass both urban cores and suburban areas. In this work, we introduce\nthe meta-distribution (MD) framework upon these two models to distinguish the\nsources of variability in radar detection metrics. Additionally, we optimize\nthe radar beamwidth and transmission probability to maximize the number of\nsuccessful detections of a radar node in the network. Further, we employ a\ncomputationally efficient Chebyshev-Markov (CM) bound method for reconstructing\nMDs, achieving higher accuracy than the conventional Gil-Pelaez theorem. Using\nthe framework, we analyze the specific impacts of beamwidth, detection range,\nand interference on radar detection performance and offer practical insights\nfor developing adaptive radar systems tailored to diverse traffic and\nenvironmental conditions.\n","subjects":["Computer Science/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"uUhYo1DDwRY9iGS55bx41Yq56LFZ5s8Zuu-Rj6kQo3U","pdfSize":"4891823"}