{
  "id": "2412.00978",
  "title": "Patent-publication pairs for the detection of knowledge transfer from\n  research to industry: reducing ambiguities with word embeddings and\n  references",
  "authors": "Klaus Lippert, Konrad U. F\\\"orstner",
  "authorsParsed": [
    [
      "Lippert",
      "Klaus",
      ""
    ],
    [
      "Förstner",
      "Konrad U.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 1 Dec 2024 21:58:44 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733090324000,
  "abstract": "  The performance of medical research can be viewed and evaluated not only from\nthe perspective of publication output, but also from the perspective of\neconomic exploitability. Patents can represent the exploitation of research\nresults and thus the transfer of knowledge from research to industry. In this\nstudy, we set out to identify publication-patent pairs in order to use patents\nas a proxy for the economic impact of research. To identify these pairs, we\nmatched scholarly publications and patents by comparing the names of authors\nand investors. To resolve the ambiguities that arise in this name-matching\nprocess, we expanded our approach with two additional filter features, one used\nto assess the similarity of text content, the other to identify common\nreferences in the two document types. To evaluate text similarity, we extracted\nand transformed technical terms from a medical ontology (MeSH) into numerical\nvectors using word embeddings. We then calculated the results of the two\nsupporting features over an example five-year period. Furthermore, we developed\na statistical procedure which can be used to determine valid patent classes for\nthe domain of medicine. Our complete data processing pipeline is freely\navailable, from the raw data of the two document types right through to the\nvalidated publication-patent pairs.\n",
  "subjects": [
    "Computer Science/Information Retrieval"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "rZCZXhJYfiIEpJeNiB2Yon9NONRwE72M31lGXehoEWs",
  "pdfSize": "1085717"
}