{
  "id": "2412.13018",
  "title": "OmniEval: An Omnidirectional and Automatic RAG Evaluation Benchmark in\n  Financial Domain",
  "authors": "Shuting Wang, Jiejun Tan, Zhicheng Dou, Ji-Rong Wen",
  "authorsParsed": [
    [
      "Wang",
      "Shuting",
      ""
    ],
    [
      "Tan",
      "Jiejun",
      ""
    ],
    [
      "Dou",
      "Zhicheng",
      ""
    ],
    [
      "Wen",
      "Ji-Rong",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 15:38:42 GMT"
    },
    {
      "version": "v2",
      "created": "Mon, 17 Feb 2025 18:51:33 GMT"
    }
  ],
  "updateDate": "2025-02-18",
  "timestamp": 1734449922000,
  "abstract": "  As a typical and practical application of Large Language Models (LLMs),\nRetrieval-Augmented Generation (RAG) techniques have gained extensive\nattention, particularly in vertical domains where LLMs may lack domain-specific\nknowledge. In this paper, we introduce an omnidirectional and automatic RAG\nbenchmark, OmniEval, in the financial domain. Our benchmark is characterized by\nits multi-dimensional evaluation framework, including (1) a matrix-based RAG\nscenario evaluation system that categorizes queries into five task classes and\n16 financial topics, leading to a structured assessment of diverse query\nscenarios; (2) a multi-dimensional evaluation data generation approach, which\ncombines GPT-4-based automatic generation and human annotation, achieving an\n87.47\\% acceptance ratio in human evaluations on generated instances; (3) a\nmulti-stage evaluation system that evaluates both retrieval and generation\nperformance, result in a comprehensive evaluation on the RAG pipeline; and (4)\nrobust evaluation metrics derived from rule-based and LLM-based ones, enhancing\nthe reliability of assessments through manual annotations and supervised\nfine-tuning of an LLM evaluator. Our experiments demonstrate the\ncomprehensiveness of OmniEval, which includes extensive test datasets and\nhighlights the performance variations of RAG systems across diverse topics and\ntasks, revealing significant opportunities for RAG models to improve their\ncapabilities in vertical domains. We open source the code of our benchmark in\n\\href{https://github.com/RUC-NLPIR/OmniEval}{https://github.com/RUC-NLPIR/OmniEval}.\n",
  "subjects": [
    "Computer Science/Computation and Language"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "5q59jWMi3qyVnTdBzJZIOp5bbrALY9eBqleLQHsih8I",
  "pdfSize": "1202149"
}