{
  "id": "2412.06097",
  "title": "Order Theory in the Context of Machine Learning: an application",
  "authors": "Eric Dolores-Cuenca, Aldo Guzman-Saenz, Sangil Kim, Susana\n  Lopez-Moreno, Jose Mendoza-Cortes",
  "authorsParsed": [
    [
      "Dolores-Cuenca",
      "Eric",
      ""
    ],
    [
      "Guzman-Saenz",
      "Aldo",
      ""
    ],
    [
      "Kim",
      "Sangil",
      ""
    ],
    [
      "Lopez-Moreno",
      "Susana",
      ""
    ],
    [
      "Mendoza-Cortes",
      "Jose",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 8 Dec 2024 22:57:41 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733698661000,
  "abstract": "  The paper ``Tropical Geometry of Deep Neural Networks'' by L. Zhang et al.\nintroduces an equivalence between integer-valued neural networks (IVNN) with\nactivation $\\text{ReLU}_{t}$ and tropical rational functions, which come with a\nmap to polytopes. Here, IVNN refers to a network with integer weights but real\nbiases, and $\\text{ReLU}_{t}$ is defined as $\\text{ReLU}_{t}(x)=\\max(x,t)$ for\n$t\\in\\mathbb{R}\\cup\\{-\\infty\\}$.\n  For every poset with $n$ points, there exists a corresponding order polytope,\ni.e., a convex polytope in the unit cube $[0,1]^n$ whose coordinates obey the\ninequalities of the poset. We study neural networks whose associated polytope\nis an order polytope. We then explain how posets with four points induce neural\nnetworks that can be interpreted as $2\\times 2$ convolutional filters. These\nposet filters can be added to any neural network, not only IVNN.\n  Similarly to maxout, poset convolutional filters update the weights of the\nneural network during backpropagation with more precision than average pooling,\nmax pooling, or mixed pooling, without the need to train extra parameters. We\nreport experiments that support our statements.\n  We also prove that the assignment from a poset to an order polytope (and to\ncertain tropical polynomials) is one to one, and we define the structure of\nalgebra over the operad of posets on tropical polynomials.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Artificial Intelligence",
    "Mathematics/Category Theory"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "2-Sk_OONchTb3JrMOXBNZ3jwPMEFeJYWQfAf4AjDJEM",
  "pdfSize": "11562849"
}