{
  "id": "2412.16403",
  "title": "From pixels to parcels: flexible, practical small-area uncertainty\n  estimation for spatial averages obtained from aboveground biomass maps",
  "authors": "Lucas K. Johnson, Grant M Domke, Stephen V Stehman, Michael J Mahoney,\n  Colin M Beier",
  "authorsParsed": [
    [
      "Johnson",
      "Lucas K.",
      ""
    ],
    [
      "Domke",
      "Grant M",
      ""
    ],
    [
      "Stehman",
      "Stephen V",
      ""
    ],
    [
      "Mahoney",
      "Michael J",
      ""
    ],
    [
      "Beier",
      "Colin M",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 23:34:56 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734737696000,
  "abstract": "  Fine-resolution maps of forest aboveground biomass (AGB) effectively\nrepresent spatial patterns and can be flexibly aggregated to map subregions by\ncomputing spatial averages or totals of pixel-level predictions. However,\ngeneralized model-based uncertainty estimation for spatial aggregates requires\ncomputationally expensive processes like iterative bootstrapping and computing\npixel covariances. Uncertainty estimation for map subregions is critical for\nenhancing practicality and eventual adoption of model-based data products, as\nthis capability would empower users to produce estimates at scales most germane\nto management: individual forest stands and ownership parcels. In this study we\nproduced estimates of standard error (SE) associated with spatial averages of\nAGB predictions for ownership parcels in New York State (NYS). This represents\nthe first model-based uncertainty estimation study to include all four types of\nuncertainty (reference data, sample variability, residual variability, and\nauxiliary data), incorporate spatial autocorrelation of model residuals, and\nuse methods compatible with algorithmic modeling. We found that uncertainty\nattributed to residual variance, largely resulting from spatial correlation of\nresiduals, dominated all other sources for most parcels in the study. These\nresults suggest that improvements to model accuracy will yield the greatest\nreductions to total uncertainty in regions like the northeastern and midwestern\nUnited States where forests are divided into smaller spatial units. Further, we\ndemonstrated that log-log regression relating parcel characteristics (area,\nperimeter, AGB density, forest cover) to parcel-level SE can accurately\nestimate uncertainty for map subregions, thus providing a convenient means to\nempower map users. These findings support transparency in future regional-scale\nmodel-based forest carbon accounting and monitoring efforts.\n",
  "subjects": [
    "Statistics/Applications"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "l820MZdjf-iCKjd9if6AYGOwg0e8F07UHd0CYlsskeg",
  "pdfSize": "4923650"
}