{"id":"2412.00062","title":"Deep Learning-Based Electricity Price Forecast for Virtual Bidding in\n  Wholesale Electricity Market","authors":"Xuesong Wang, Sharaf K. Magableh, Oraib Dawaghreh, Caisheng Wang,\n  Jiaxuan Gong, Zhongyang Zhao, Michael H. Liao","authorsParsed":[["Wang","Xuesong",""],["Magableh","Sharaf K.",""],["Dawaghreh","Oraib",""],["Wang","Caisheng",""],["Gong","Jiaxuan",""],["Zhao","Zhongyang",""],["Liao","Michael H.",""]],"versions":[{"version":"v1","created":"Mon, 25 Nov 2024 20:04:16 GMT"}],"updateDate":"2024-12-03","timestamp":1732565056000,"abstract":"  Virtual bidding plays an important role in two-settlement electric power\nmarkets, as it can reduce discrepancies between day-ahead and real-time\nmarkets. Renewable energy penetration increases volatility in electricity\nprices, making accurate forecasting critical for virtual bidders, reducing\nuncertainty and maximizing profits. This study presents a Transformer-based\ndeep learning model to forecast the price spread between real-time and\nday-ahead electricity prices in the ERCOT (Electric Reliability Council of\nTexas) market. The proposed model leverages various time-series features,\nincluding load forecasts, solar and wind generation forecasts, and temporal\nattributes. The model is trained under realistic constraints and validated\nusing a walk-forward approach by updating the model every week. Based on the\nprice spread prediction results, several trading strategies are proposed and\nthe most effective strategy for maximizing cumulative profit under realistic\nmarket conditions is identified through backtesting. The results show that the\nstrategy of trading only at the peak hour with a precision score of over 50%\nproduces nearly consistent profit over the test period. The proposed method\nunderscores the importance of an accurate electricity price forecasting model\nand introduces a new method of evaluating the price forecast model from a\nvirtual bidder's perspective, providing valuable insights for future research.\n","subjects":["Computer Science/Machine Learning","Quantitative Finance/Computational Finance"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"RDQIpXBV3v0O0hpFkJJ_8SX8OrgaToQPJBMf1po0kk4","pdfSize":"2712960"}