{
  "id": "2412.09594",
  "title": "Wait-Less Offline Tuning and Re-solving for Online Decision Making",
  "authors": "Jingruo Sun, Wenzhi Gao, Ellen Vitercik, Yinyu Ye",
  "authorsParsed": [
    [
      "Sun",
      "Jingruo",
      ""
    ],
    [
      "Gao",
      "Wenzhi",
      ""
    ],
    [
      "Vitercik",
      "Ellen",
      ""
    ],
    [
      "Ye",
      "Yinyu",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 18:58:14 GMT"
    },
    {
      "version": "v2",
      "created": "Fri, 10 Jan 2025 09:40:04 GMT"
    }
  ],
  "updateDate": "2025-01-13",
  "timestamp": 1734029894000,
  "abstract": "  Online linear programming (OLP) has found broad applications in revenue\nmanagement and resource allocation. State-of-the-art OLP algorithms achieve low\nregret by repeatedly solving linear programming (LP) subproblems that\nincorporate updated resource information. However, LP-based methods are\ncomputationally expensive and often inefficient for large-scale applications.\nIn contrast, recent first-order OLP algorithms are more computationally\nefficient but typically suffer from worse regret guarantees. To address these\nshortcomings, we propose a new algorithm that combines the strengths of\nLP-based and first-order OLP methods. The algorithm re-solves the LP\nsubproblems periodically at a predefined frequency $f$ and uses the latest dual\nprices to guide online decision-making. In addition, a first-order method runs\nin parallel during each interval between LP re-solves, smoothing resource\nconsumption. Our algorithm achieves $\\mathscr{O}(\\log (T/f) + \\sqrt{f})$\nregret, delivering a \"wait-less\" online decision-making process that balances\nthe computational efficiency of first-order methods and the superior regret\nguarantee of LP-based methods.\n",
  "subjects": [
    "Statistics/Machine Learning",
    "Computer Science/Machine Learning",
    "Mathematics/Optimization and Control"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "EUsJM7sY63wUznE-f0NxR2mwq2nzWlrOOEs7V-x1ugc",
  "pdfSize": "1197631"
}