{
  "id": "2412.01530",
  "title": "Generative AI-based data augmentation for improved bioacoustic\n  classification in noisy environments",
  "authors": "Anthony Gibbons, Emma King, Ian Donohue, Andrew Parnell",
  "authorsParsed": [
    [
      "Gibbons",
      "Anthony",
      ""
    ],
    [
      "King",
      "Emma",
      ""
    ],
    [
      "Donohue",
      "Ian",
      ""
    ],
    [
      "Parnell",
      "Andrew",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 14:20:26 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733149226000,
  "abstract": "  1. Obtaining data to train robust artificial intelligence (AI)-based models\nfor species classification can be challenging, particularly for rare species.\nData augmentation can boost classification accuracy by increasing the diversity\nof training data and is cheaper to obtain than expert-labelled data. However,\nmany classic image-based augmentation techniques are not suitable for audio\nspectrograms. 2. We investigate two generative AI models as data augmentation\ntools to synthesise spectrograms and supplement audio data: Auxiliary\nClassifier Generative Adversarial Networks (ACGAN) and Denoising Diffusion\nProbabilistic Models (DDPMs). The latter performed particularly well in terms\nof both realism of generated spectrograms and accuracy in a resulting\nclassification task. 3. Alongside these new approaches, we present a new audio\ndata set of 640 hours of bird calls from wind farm sites in Ireland,\napproximately 800 samples of which have been labelled by experts. Wind farm\ndata are particularly challenging for classification models given the\nbackground wind and turbine noise. 4. Training an ensemble of classification\nmodels on real and synthetic data combined gave 92.6% accuracy (and 90.5% with\njust the real data) when compared with highly confident BirdNET predictions. 5.\nOur approach can be used to augment acoustic signals for more species and other\nland-use types, and has the potential to bring about a step-change in our\ncapacity to develop reliable AI-based detection of rare species. Our code is\navailable at https://github.com/gibbona1/ SpectrogramGenAI.\n",
  "subjects": [
    "Computer Science/Sound",
    "Electrical Engineering and Systems Science/Audio and Speech Processing",
    "Statistics/Applications"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "IIL4nlmQNvtmHGW_0iAivC25kqQaGZPecJQZBjDnw5k",
  "pdfSize": "1377101"
}