{
  "id": "2412.18803",
  "title": "Trustworthy assessment of heterogeneous treatment effect estimator",
  "authors": "Zijun Gao",
  "authorsParsed": [
    [
      "Gao",
      "Zijun",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 25 Dec 2024 07:05:11 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735110311000,
  "abstract": "  Accurate heterogeneous treatment effect (HTE) estimation is essential for\npersonalized recommendations, making it important to evaluate and compare HTE\nestimators. Traditional assessment methods are inapplicable due to missing\ncounterfactuals. Current HTE evaluation methods rely on additional estimation\nor matching on test data, often ignoring the uncertainty introduced and\npotentially leading to incorrect conclusions. We propose incorporating\nuncertainty quantification into HTE estimator comparisons. In addition, we\nsuggest shifting the focus to the estimation and inference of the relative\nerror between methods rather than their absolute errors. Methodology-wise, we\ndevelop a relative error estimator based on the efficient influence function\nand establish its asymptotic distribution for inference. Compared to absolute\nerror-based methods, the relative error estimator (1) is less sensitive to the\nerror of nuisance function estimators, satisfying a \"global double robustness\"\nproperty, and (2) its confidence intervals are often narrower, making it more\npowerful for determining the more accurate HTE estimator. Through extensive\nempirical study of the ACIC challenge benchmark datasets, we show that the\nrelative error-based method more effectively identifies the better HTE\nestimator with statistical confidence, even with a moderately large test\ndataset or inaccurate nuisance estimators.\n",
  "subjects": [
    "Statistics/Methodology"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Z0Pc19AiI27xRXUZA08ZggD-MS7qUDV3lmstLgkwhH0",
  "pdfSize": "728460"
}