{
  "id": "2412.04727",
  "title": "Learning to Translate Noise for Robust Image Denoising",
  "authors": "Inju Ha, Donghun Ryou, Seonguk Seo, Bohyung Han",
  "authorsParsed": [
    [
      "Ha",
      "Inju",
      ""
    ],
    [
      "Ryou",
      "Donghun",
      ""
    ],
    [
      "Seo",
      "Seonguk",
      ""
    ],
    [
      "Han",
      "Bohyung",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 02:35:44 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733452544000,
  "abstract": "  Deep learning-based image denoising techniques often struggle with poor\ngeneralization performance to out-of-distribution real-world noise. To tackle\nthis challenge, we propose a novel noise translation framework that performs\ndenoising on an image with translated noise rather than directly denoising an\noriginal noisy image. Specifically, our approach translates complex, unknown\nreal-world noise into Gaussian noise, which is spatially uncorrelated and\nindependent of image content, through a noise translation network. The\ntranslated noisy images are then processed by an image denoising network\npretrained to effectively remove Gaussian noise, enabling robust and consistent\ndenoising performance. We also design well-motivated loss functions and\narchitectures for the noise translation network by leveraging the mathematical\nproperties of Gaussian noise. Experimental results demonstrate that the\nproposed method substantially improves robustness and generalizability,\noutperforming state-of-the-art methods across diverse benchmarks. Visualized\ndenoising results and the source code are available on our project page.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Image and Video Processing",
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "cB5ktLhSlQA2DkmmQC7s42FLq8WKoZDsAuYcwkgcBG4",
  "pdfSize": "20877115"
}