{"id":"2412.04067","title":"Automated Medical Report Generation for ECG Data: Bridging Medical Text\n  and Signal Processing with Deep Learning","authors":"Amnon Bleich, Antje Linnemann, Bjoern H. Diem, and Tim OF Conrad","authorsParsed":[["Bleich","Amnon",""],["Linnemann","Antje",""],["Diem","Bjoern H.",""],["Conrad","Tim OF",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 11:05:12 GMT"}],"updateDate":"2024-12-06","timestamp":1733396712000,"abstract":"  Recent advances in deep learning and natural language generation have\nsignificantly improved image captioning, enabling automated, human-like\ndescriptions for visual content. In this work, we apply these captioning\ntechniques to generate clinician-like interpretations of ECG data. This study\nleverages existing ECG datasets accompanied by free-text reports authored by\nhealthcare professionals (HCPs) as training data. These reports, while often\ninconsistent, provide a valuable foundation for automated learning. We\nintroduce an encoder-decoder-based method that uses these reports to train\nmodels to generate detailed descriptions of ECG episodes. This represents a\nsignificant advancement in ECG analysis automation, with potential applications\nin zero-shot classification and automated clinical decision support.\n  The model is tested on various datasets, including both 1- and 12-lead ECGs.\nIt significantly outperforms the state-of-the-art reference model by Qiu et\nal., achieving a METEOR score of 55.53% compared to 24.51% achieved by the\nreference model. Furthermore, several key design choices are discussed,\nproviding a comprehensive overview of current challenges and innovations in\nthis domain.\n  The source codes for this research are publicly available in our Git\nrepository https://git.zib.de/ableich/ecg-comment-generation-public\n","subjects":["Computer Science/Computation and Language","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"kUPx_lcah0Xb62txuWc5vTMX3mx-MLQeRFnHxWZGfWo","pdfSize":"1875613"}