{"id":"2412.06445","title":"Echocardiography to Cardiac MRI View Transformation for Real-Time Blind\n  Restoration","authors":"Ilke Adalioglu, Serkan Kiranyaz, Mete Ahishali, Aysen Degerli, Tahir\n  Hamid, Rahmat Ghaffar, Ridha Hamila, and Moncef Gabbouj","authorsParsed":[["Adalioglu","Ilke",""],["Kiranyaz","Serkan",""],["Ahishali","Mete",""],["Degerli","Aysen",""],["Hamid","Tahir",""],["Ghaffar","Rahmat",""],["Hamila","Ridha",""],["Gabbouj","Moncef",""]],"versions":[{"version":"v1","created":"Mon, 9 Dec 2024 12:44:03 GMT"}],"updateDate":"2024-12-10","timestamp":1733748243000,"abstract":"  Echocardiography is the most widely used imaging to monitor cardiac\nfunctions, serving as the first line in early detection of myocardial ischemia\nand infarction. However, echocardiography often suffers from several artifacts\nincluding sensor noise, lack of contrast, severe saturation, and missing\nmyocardial segments which severely limit its usage in clinical diagnosis. In\nrecent years, several machine learning methods have been proposed to improve\nechocardiography views. Yet, these methods usually address only a specific\nproblem (e.g. denoising) and thus cannot provide a robust and reliable\nrestoration in general. On the other hand, cardiac MRI provides a clean view of\nthe heart without suffering such severe issues. However, due to its\nsignificantly higher cost, it is often only afforded by a few major hospitals,\nhence hindering its use and accessibility. In this pilot study, we propose a\nnovel approach to transform echocardiography into the cardiac MRI view. For\nthis purpose, Echo2MRI dataset, consisting of echocardiography and real cardiac\nMRI image pairs, is composed and will be shared publicly. A dedicated\nCycle-consistent Generative Adversarial Network (Cycle-GAN) is trained to learn\nthe transformation from echocardiography frames to cardiac MRI views. An\nextensive set of qualitative evaluations shows that the proposed transformer\ncan synthesize high-quality artifact-free synthetic cardiac MRI views from a\ngiven sequence of echocardiography frames. Medical evaluations performed by a\ngroup of cardiologists further demonstrate that synthetic MRI views are\nindistinguishable from their original counterparts and are preferred over their\ninitial sequence of echocardiography frames for diagnosis in 78.9% of the\ncases.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computer Science/Computer Vision and Pattern Recognition","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"-2YoqHA-LxRUTIy4tMwSg7t_9hnURvEXwZmK_iwTVp4","pdfSize":"16728572"}