{
  "id": "2412.12597",
  "title": "Distribution-Free Uncertainty Quantification in Mechanical Ventilation\n  Treatment: A Conformal Deep Q-Learning Framework",
  "authors": "Niloufar Eghbali, Tuka Alhanai, Mohammad M. Ghassemi",
  "authorsParsed": [
    [
      "Eghbali",
      "Niloufar",
      ""
    ],
    [
      "Alhanai",
      "Tuka",
      ""
    ],
    [
      "Ghassemi",
      "Mohammad M.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 06:55:20 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734418520000,
  "abstract": "  Mechanical Ventilation (MV) is a critical life-support intervention in\nintensive care units (ICUs). However, optimal ventilator settings are\nchallenging to determine because of the complexity of balancing\npatient-specific physiological needs with the risks of adverse outcomes that\nimpact morbidity, mortality, and healthcare costs. This study introduces\nConformalDQN, a novel distribution-free conformal deep Q-learning approach for\noptimizing mechanical ventilation in intensive care units. By integrating\nconformal prediction with deep reinforcement learning, our method provides\nreliable uncertainty quantification, addressing the challenges of Q-value\noverestimation and out-of-distribution actions in offline settings. We trained\nand evaluated our model using ICU patient records from the MIMIC-IV database.\nConformalDQN extends the Double DQN architecture with a conformal predictor and\nemploys a composite loss function that balances Q-learning with well-calibrated\nprobability estimation. This enables uncertainty-aware action selection,\nallowing the model to avoid potentially harmful actions in unfamiliar states\nand handle distribution shifts by being more conservative in\nout-of-distribution scenarios. Evaluation against baseline models, including\nphysician policies, policy constraint methods, and behavior cloning,\ndemonstrates that ConformalDQN consistently makes recommendations within\nclinically safe and relevant ranges, outperforming other methods by increasing\nthe 90-day survival rate. Notably, our approach provides an interpretable\nmeasure of confidence in its decisions, which is crucial for clinical adoption\nand potential human-in-the-loop implementations.\n",
  "subjects": [
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "w0runR3pzzmTs9ftd_n7I7Oq1cPWhwrkGuUWXqHpxII",
  "pdfSize": "962879"
}