{"id":"2412.05917","title":"Hubble Expansion and Entropy Rates in a Cosmological Model with Merging\n  Clusters and Voids","authors":"A. Shahriar, M. Abbasiyan-Motlaq, M. Mohsenzadeh and E. Yusofi","authorsParsed":[["Shahriar","A.",""],["Abbasiyan-Motlaq","M.",""],["Mohsenzadeh","M.",""],["Yusofi","E.",""]],"versions":[{"version":"v1","created":"Sun, 8 Dec 2024 12:22:01 GMT"},{"version":"v2","created":"Sat, 14 Dec 2024 12:23:58 GMT"}],"updateDate":"2024-12-17","timestamp":1733660521000,"abstract":"  This paper introduces a cosmological model that incorporates the simultaneous\nmerger process for evolving dark energy and evolving dark matter and analyzes\nits Hubble parameter behavior. To validate this model, we assess the\napplicability of the generalized second law of thermodynamics and the maximum\nentropy condition within this framework. We derive a generalized form of the\nHubble parameter for this model, demonstrating that it converges to the\nstandard Hubble parameter in the non-merger case (\\(\\xi = 0\\)). The merging\nmodel's equation of state parameters resembles those of evolving dark matter\nand dark energy, with \\(w_c(z) \\simeq w_{\\rm dm} \\simeq 0\\) and \\(w_v(z) \\simeq\nw_{\\rm de} \\simeq -1\\) at $z\\rightarrow 0$, aligning with recent observations.\nWe attribute the roles of dynamical dark matter and dark energy to super-voids\nand super-clusters, the largest merging objects in the web-like universe. We\ncompare our model by analyzing the Hubble parameter and the entropy along with\nits first and second derivatives for the $w$CDM and standard $\\Lambda$CDM\nmodels. Our plots indicate that the models incorporating only cluster mergers\nexhibit greater discrepancies with both observational Hubble parameters and the\nstandard model at $z > 1$. A key finding is that in models featuring only\ncluster mergers, Hubble and entropy rates consistently decrease. Furthermore,\nwe demonstrate that the $\\Lambda$CDM model with both additive and non-additive\nentropy violates the convexity condition, whereas the merger voids model aligns\nwith maximizing entropy and at the same time may help avert a \\textit{Big Rip}\nscenario for our universe.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"iT2KDO2jyK6pxCMt0BcZ7KLC4TxKJWWvx6RTf5R_ivI","pdfSize":"1794316"}