{"id":"2412.14077","title":"Dialogue with the Machine and Dialogue with the Art World: Evaluating\n  Generative AI for Culturally-Situated Creativity","authors":"Rida Qadri, Piotr Mirowski, Aroussiak Gabriellan, Farbod Mehr, Huma\n  Gupta, Pamela Karimi, Remi Denton","authorsParsed":[["Qadri","Rida",""],["Mirowski","Piotr",""],["Gabriellan","Aroussiak",""],["Mehr","Farbod",""],["Gupta","Huma",""],["Karimi","Pamela",""],["Denton","Remi",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 17:21:14 GMT"}],"updateDate":"2024-12-19","timestamp":1734542474000,"abstract":"  This paper proposes dialogue as a method for evaluating generative AI tools\nfor culturally-situated creative practice, that recognizes the socially\nsituated nature of art. Drawing on sociologist Howard Becker's concept of Art\nWorlds, this method expands the scope of traditional AI and creativity\nevaluations beyond benchmarks, user studies with crowd-workers, or focus groups\nconducted with artists. Our method involves two mutually informed dialogues: 1)\n'dialogues with art worlds' placing artists in conversation with experts such\nas art historians, curators, and archivists, and 2)'dialogues with the\nmachine,' facilitated through structured artist- and critic-led experimentation\nwith state-of-the-art generative AI tools. We demonstrate the value of this\nmethod through a case study with artists and experts steeped in non-western art\nworlds, specifically the Persian Gulf. We trace how these dialogues help create\nculturally rich and situated forms of evaluation for representational\npossibilities of generative AI that mimic the reception of generative artwork\nin the broader art ecosystem. Putting artists in conversation with commentators\nalso allow artists to shift their use of the tools to respond to their cultural\nand creative context. Our study can provide generative AI researchers an\nunderstanding of the complex dynamics of technology, human creativity and the\nsocio-politics of art worlds, to build more inclusive machines for diverse art\nworlds.\n","subjects":["Computer Science/Computers and Society","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"1jmD7MptEjoUkOOckaDLhVSRvHDU0MhZJ6e7E_5HEjw","pdfSize":"214875"}