{
  "id": "2412.15591",
  "title": "Room-temperature nonlinear transport and microwave rectification in\n  antiferromagnetic MnBi$_2$Te$_4$ films",
  "authors": "Shanshan Liu, Rhonald Burgos, Enze Zhang, Naizhou Wang, Xiao-Bin\n  Qiang, Chuanzhao Li, Qihan Zhang, Z. Z. Du, Rui Zheng, Jingsheng Chen,\n  Qing-Hua Xu, Kai Leng, Weibo Gao, Faxian Xiu, Dimitrie Culcer, Kian Ping Loh",
  "authorsParsed": [
    [
      "Liu",
      "Shanshan",
      ""
    ],
    [
      "Burgos",
      "Rhonald",
      ""
    ],
    [
      "Zhang",
      "Enze",
      ""
    ],
    [
      "Wang",
      "Naizhou",
      ""
    ],
    [
      "Qiang",
      "Xiao-Bin",
      ""
    ],
    [
      "Li",
      "Chuanzhao",
      ""
    ],
    [
      "Zhang",
      "Qihan",
      ""
    ],
    [
      "Du",
      "Z. Z.",
      ""
    ],
    [
      "Zheng",
      "Rui",
      ""
    ],
    [
      "Chen",
      "Jingsheng",
      ""
    ],
    [
      "Xu",
      "Qing-Hua",
      ""
    ],
    [
      "Leng",
      "Kai",
      ""
    ],
    [
      "Gao",
      "Weibo",
      ""
    ],
    [
      "Xiu",
      "Faxian",
      ""
    ],
    [
      "Culcer",
      "Dimitrie",
      ""
    ],
    [
      "Loh",
      "Kian Ping",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 06:01:28 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734674488000,
  "abstract": "  The discovery of the nonlinear Hall effect provides an avenue for studying\nthe interplay among symmetry, topology, and phase transitions, with potential\napplications in signal doubling and high-frequency rectification. However,\npractical applications require devices fabricated on large area thin film as\nwell as room-temperature operation. Here, we demonstrate robust\nroom-temperature nonlinear transverse response and microwave rectification in\nMnBi$_2$Te$_4$ films grown by molecular beam epitaxy. We observe multiple\nsign-reversals in the nonlinear response by tuning the chemical potential.\nThrough theoretical analysis, we identify skew scattering and side jump,\narising from extrinsic spin-orbit scattering, as the main mechanisms underlying\nthe observed nonlinear signals. Furthermore, we demonstrate radio frequency\n(RF) rectification in the range of 1-8 gigahertz at 300 K. These findings not\nonly enhance our understanding of the relationship between nonlinear response\nand magnetism, but also expand the potential applications as energy harvesters\nand detectors in high-frequency scenarios.\n",
  "subjects": [
    "Condensed Matter/Materials Science"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "kcyzLg3cmxxFwIiUq_XS7oPLHMJzn6IXDfEYUAdOb0w",
  "pdfSize": "1444235"
}