{"id":"2412.08605","title":"A New Approach to the Low Frequency Stochastic Gravitational Wave\n  Background: Constraints from Quasars and the Astrometric Hellings-Downs Curve","authors":"Jeremy Darling","authorsParsed":[["Darling","Jeremy",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 18:27:15 GMT"}],"updateDate":"2024-12-12","timestamp":1733941635000,"abstract":"  We present new astrometric constraints on the stochastic gravitational wave\nbackground and construct the first astrometric Hellings-Downs curve using\nquasar proper motions. From quadrupolar vector spherical harmonic fits to the\nGaia proper motions of 1,108,858 quasars, we obtain a frequency-integrated\nupper limit on the gravitational wave energy density, $h_{70}^2\\Omega_{GW} \\leq\n0.023$ (95% confidence limit), for frequencies between 11.2 nHz and\n$3.1\\times10^{-9}$ nHz ($1.33/t_0$). However, from the astrometric\nHellings-Downs curve that describes the correlated proper motions between\n2,104,609,881 quasar pairs as a function of their angular separation, we find a\nmuch stronger constraint: a characteristic strain of $h_{c} \\leq 2.9 \\times\n10^{-12}$ for $f_{\\rm ref} = 1$ yr$^{-1}$ and $h_{70}^2\\Omega_{\\rm GW} \\leq\n0.010$ at 95% confidence. We probe down to $\\pm$0.005 $\\mu$as$^2$ yr$^{-2}$ in\ncorrelated power and obtain the lowest astrometric limit to date. This is also\nthe first time that optical wavelength astrometry surpasses limits from\nradio-frequency interferometry. This astrometric analysis does not yet reach\nthe sensitivity needed to detect the pulsar timing-based red gravitational wave\nspectrum extrapolated to the quasar gravitational wave sensitivity window,\nassuming that the turnover in the spectrum occurs at $\\sim$1 nHz for massive\nblack hole binaries. The limits presented here may exclude some exotic\ninterpretations of the stochastic gravitational wave background.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"nC85ZO3qqCudmAzaiGw9Rf5W8IanjkJvxjVG6_58yJ8","pdfSize":"669324"}