{
  "id": "2412.00931",
  "title": "Exploring cosmological imprints of phantom crossing with dynamical dark\n  energy in Horndeski gravity",
  "authors": "Yashi Tiwari, Ujjwal Upadhyay and Rajeev Kumar Jain",
  "authorsParsed": [
    [
      "Tiwari",
      "Yashi",
      ""
    ],
    [
      "Upadhyay",
      "Ujjwal",
      ""
    ],
    [
      "Jain",
      "Rajeev Kumar",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 1 Dec 2024 18:41:32 GMT"
    },
    {
      "version": "v2",
      "created": "Sat, 15 Feb 2025 06:07:09 GMT"
    }
  ],
  "updateDate": "2025-02-18",
  "timestamp": 1733078492000,
  "abstract": "  In the current era of precision cosmology, the persistence of cosmological\ntensions, most notably the Hubble tension and the $S_8$ tension, challenges the\nstandard $\\Lambda$CDM model. To reconcile these tensions via late-time\nmodifications to expansion history, various features such as phantom crossing\nin the dark energy equation of state, a negative energy density at high\nredshifts, etc., are favoured. However, these scenarios cannot be realized\nwithin the framework of GR without introducing ghost or gradient instabilities.\nIn this work, we investigate a dynamical dark energy scenario within the\nframework of Horndeski gravity, incorporating nonminimal coupling to gravity\nand self-interactions. We highlight that the model can exhibit novel features\nlike phantom crossing and negative dark energy densities at high redshifts\nwithout introducing any instabilities. For this specific Horndeski model, we\nperform a comprehensive analysis of the background evolution along with the\neffects on perturbations, examining observables like growth rate, matter and\nCMB power spectrum. To check the consistency of the model with the\nobservational data, we employ MCMC analysis using BAO/$f\\sigma_8$, Supernovae,\nand CMB data. While the model does not outperform the standard $\\Lambda$CDM\nframework in a combined likelihood analysis, there remains a preference for\nnon-zero values of the model parameters within the data. This suggests that\ndynamical dark energy scenarios, particularly those with non-minimal couplings,\nmerit further exploration as promising alternatives to GR, offering rich\nphenomenology that can be tested against a broader range of current and\nupcoming observational datasets.\n",
  "subjects": [
    "Astrophysics/Cosmology and Nongalactic Astrophysics",
    "Physics/General Relativity and Quantum Cosmology",
    "Physics/High Energy Physics - Theory"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "vktZK1qp3agaxeyoCOMcy4b9HWPYm_pjV8iREvuUyyo",
  "pdfSize": "1132685"
}