{"id":"2412.00601","title":"Sphere Packing on a Quantum Computer for Chromatography Modeling","authors":"Benjamin Hall, Ian Njoroge, Colin Campbell, Bharath Thotakura, Rich\n  Rines, Victory Omole, Maen Qadan","authorsParsed":[["Hall","Benjamin",""],["Njoroge","Ian",""],["Campbell","Colin",""],["Thotakura","Bharath",""],["Rines","Rich",""],["Omole","Victory",""],["Qadan","Maen",""]],"versions":[{"version":"v1","created":"Sat, 30 Nov 2024 22:26:38 GMT"},{"version":"v2","created":"Tue, 17 Dec 2024 18:29:11 GMT"}],"updateDate":"2024-12-18","timestamp":1733005598000,"abstract":"  Column chromatography is an important process in downstream biopharmaceutical\nmanufacturing that enables high-selectivity separation of proteins through\nvarious modalities, such as affinity, ion exchange, hydrophobic interactions,\nor a combination of the aforementioned modes. Current mechanistic models of\ncolumn chromatography typically abstract particle-level phenomena, in\nparticular adsorption kinetics. A mechanistic model capable of incorporating\nparticle-level phenomena would increase the value derived from mechanistic\nmodels. To this end, we model column chromatography via sphere packing,\nformulating three versions, each with increasing complexity. The first,\nhomogeneous circle packing, is recast as maximum independent set and solved by\nthe Quantum Approximate Optimization Algorithm on a quantum computer. The\nsecond, heterogeneous circle packing, is formulated as a graphical optimization\nproblem and solved via classical simulations, accompanied by a road map to a\nquantum solution. An extension to the third, heterogeneous sphere packing, is\nformulated mathematically in a manner suitable to a quantum solution. Finally,\ndetailed resource scaling is conducted to estimate the quantum resources\nrequired to simulate the most realistic model, providing a pathway to quantum\nadvantage.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"nhaZLsePDOz446IZD6j8sgEJc2lws7qiwmjGqM1qjsQ","pdfSize":"3244804"}