{
  "id": "2412.07523",
  "title": "JWST Imaging of Edge-on Protoplanetary Disks. IV. Mid-infrared Dust\n  Scattering in the HH 30 disk",
  "authors": "Ryo Tazaki, Fran\\c{c}ois M\\'enard, Gaspard Duch\\^ene, Marion\n  Villenave, \\'Alvaro Ribas, Karl R. Stapelfeldt, Marshall D. Perrin,\n  Christophe Pinte, Schuyler G. Wolff, Deborah L. Padgett, Jie Ma, Laurine\n  Martinien, Maxime Roumesy",
  "authorsParsed": [
    [
      "Tazaki",
      "Ryo",
      ""
    ],
    [
      "Ménard",
      "François",
      ""
    ],
    [
      "Duchêne",
      "Gaspard",
      ""
    ],
    [
      "Villenave",
      "Marion",
      ""
    ],
    [
      "Ribas",
      "Álvaro",
      ""
    ],
    [
      "Stapelfeldt",
      "Karl R.",
      ""
    ],
    [
      "Perrin",
      "Marshall D.",
      ""
    ],
    [
      "Pinte",
      "Christophe",
      ""
    ],
    [
      "Wolff",
      "Schuyler G.",
      ""
    ],
    [
      "Padgett",
      "Deborah L.",
      ""
    ],
    [
      "Ma",
      "Jie",
      ""
    ],
    [
      "Martinien",
      "Laurine",
      ""
    ],
    [
      "Roumesy",
      "Maxime",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 14:00:09 GMT"
    },
    {
      "version": "v2",
      "created": "Fri, 10 Jan 2025 09:23:33 GMT"
    }
  ],
  "updateDate": "2025-01-13",
  "timestamp": 1733839209000,
  "abstract": "  We present near- and mid-infrared (IR) broadband imaging observations of the\nedge-on protoplanetary disk around HH 30 with the James Webb Space\nTelescope/Near Infrared Camera (NIRCam) and the Mid-Infrared Instrument (MIRI).\nWe combine these observations with archival optical/near-IR scattered light\nimages obtained with the Hubble Space Telescope (HST) and a\nmillimeter-wavelength dust continuum image obtained with the Atacama Large\nMillimeter/submillimeter Array (ALMA) with the highest spatial resolution ever\nobtained for this target. Our multiwavelength images clearly reveal the\nvertical and radial segregation of micron-sized and sub-mm-sized grains in the\ndisk. In the near- and mid-IR, the images capture not only bi-reflection\nnebulae separated by a dark lane but also diverse dynamical processes occurring\nin the HH 30 disk, such as spiral- and tail-like structures, a conical outflow,\nand a collimated jet. In contrast, the ALMA image reveals a flat dust disk in\nthe disk midplane. By performing radiative transfer simulations, we show that\ngrains of about 3 $\\mu$m in radius or larger are fully vertically mixed to\nexplain the observed mid-IR scattered light flux and its morphology, whereas\nmillimeter-sized grains are settled into a layer with a scale height of\n$\\gtrsim1$ au at $100$ au from the central star. We also find a tension in the\ndisk inclination angle inferred from optical/near-IR and mm observations with\nthe latter being closer to an exactly edge-on. Finally, we report the first\ndetection of the proper motion of an emission knot associated with the mid-IR\ncollimated jet detected by combining two epochs of our MIRI 12.8-$\\mu$m\nobservations.\n",
  "subjects": [
    "Astrophysics/Earth and Planetary Astrophysics",
    "Astrophysics/Solar and Stellar Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Sk-KtoEiwr3im4HPi1cbj20Ge2d0CpBQlA3qxf-KB54",
  "pdfSize": "3526269"
}