{
  "id": "2412.16861",
  "title": "SoundLoc3D: Invisible 3D Sound Source Localization and Classification\n  Using a Multimodal RGB-D Acoustic Camera",
  "authors": "Yuhang He, Sangyun Shin, Anoop Cherian, Niki Trigoni, Andrew Markham",
  "authorsParsed": [
    [
      "He",
      "Yuhang",
      ""
    ],
    [
      "Shin",
      "Sangyun",
      ""
    ],
    [
      "Cherian",
      "Anoop",
      ""
    ],
    [
      "Trigoni",
      "Niki",
      ""
    ],
    [
      "Markham",
      "Andrew",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 22 Dec 2024 05:04:17 GMT"
    },
    {
      "version": "v2",
      "created": "Sun, 29 Dec 2024 05:06:53 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1734843857000,
  "abstract": "  Accurately localizing 3D sound sources and estimating their semantic labels\n-- where the sources may not be visible, but are assumed to lie on the physical\nsurface of objects in the scene -- have many real applications, including\ndetecting gas leak and machinery malfunction. The audio-visual weak-correlation\nin such setting poses new challenges in deriving innovative methods to answer\nif or how we can use cross-modal information to solve the task. Towards this\nend, we propose to use an acoustic-camera rig consisting of a pinhole RGB-D\ncamera and a coplanar four-channel microphone array~(Mic-Array). By using this\nrig to record audio-visual signals from multiviews, we can use the cross-modal\ncues to estimate the sound sources 3D locations. Specifically, our framework\nSoundLoc3D treats the task as a set prediction problem, each element in the set\ncorresponds to a potential sound source. Given the audio-visual\nweak-correlation, the set representation is initially learned from a single\nview microphone array signal, and then refined by actively incorporating\nphysical surface cues revealed from multiview RGB-D images. We demonstrate the\nefficiency and superiority of SoundLoc3D on large-scale simulated dataset, and\nfurther show its robustness to RGB-D measurement inaccuracy and ambient noise\ninterference.\n",
  "subjects": [
    "Computer Science/Sound",
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Multimedia",
    "Electrical Engineering and Systems Science/Audio and Speech Processing"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "Rpr0D29pfYuShIu2uJPJhB2fmVwHAjpOBL6bnyWsSkI",
  "pdfSize": "5312374"
}