{
  "id": "2412.01149",
  "title": "New Examples of Abelian D4D2D0 Indices",
  "authors": "Joseph McGovern",
  "authorsParsed": [
    [
      "McGovern",
      "Joseph",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 05:46:03 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 7 Jan 2025 18:37:56 GMT"
    }
  ],
  "updateDate": "2025-01-08",
  "timestamp": 1733118363000,
  "abstract": "  We apply the methods of \\cite{Alexandrov:2023zjb} to compute generating\nseries of D4D2D0 indices with a single unit of D4 charge for several compact\nCalabi-Yau threefolds, assuming modularity of these indices. Our examples\ninclude a $\\mathbb{Z}_{7}$ quotient of R{\\o}dland's pfaffian threefold, a\n$\\mathbb{Z}_{5}$ quotient of Hosono-Takagi's double quintic symmetroid\nthreefold, the $\\mathbb{Z}_{3}$ quotient of the bicubic intersection in\n$\\mathbb{P}^{5}$, and the $\\mathbb{Z}_{5}$ quotient of the quintic hypersurface\nin $\\mathbb{P}^{4}$. For these examples we compute GV invariants to the highest\ngenus that available boundary conditions make possible, and for the case of the\nquintic quotient alone this is sufficiently many GV invariants for us to make\none nontrivial test of the modularity of these indices. As discovered in \\cite\n{Alexandrov:2023zjb}, the assumption of modularity allows us to compute terms\nin the topological string genus expansion beyond those obtainable with\npreviously understood boundary data. We also consider five multiparameter\nexamples with $h^{1,1}>1$, for which only a single index needs to be computed\nfor modularity to fix the rest. We propose a modification of the formula in\n\\cite{Alexandrov:2022pgd} that incorporates torsion to solve these models. Our\nnew examples are only tractable because they have sufficiently small triple\nintersection and second Chern numbers, which happens because all of our\nexamples are suitable quotient manifolds. In an appendix we discuss some\naspects of quotient threefolds and their Wall data.\n",
  "subjects": [
    "Physics/High Energy Physics - Theory"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Rx9jz2WoIytLXjqb054KDrhYMsMhtEvzxyMi7dwoSiI",
  "pdfSize": "919784"
}