{
  "id": "2412.06866",
  "title": "LMS-AutoTSF: Learnable Multi-Scale Decomposition and Integrated\n  Autocorrelation for Time Series Forecasting",
  "authors": "Ibrahim Delibasoglu and Sanjay Chakraborty and Fredrik Heintz",
  "authorsParsed": [
    [
      "Delibasoglu",
      "Ibrahim",
      ""
    ],
    [
      "Chakraborty",
      "Sanjay",
      ""
    ],
    [
      "Heintz",
      "Fredrik",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 09:31:58 GMT"
    },
    {
      "version": "v2",
      "created": "Fri, 3 Jan 2025 16:22:31 GMT"
    },
    {
      "version": "v3",
      "created": "Tue, 7 Jan 2025 16:16:49 GMT"
    }
  ],
  "updateDate": "2025-01-08",
  "timestamp": 1733736718000,
  "abstract": "  Time series forecasting is an important challenge with significant\napplications in areas such as weather prediction, stock market analysis,\nscientific simulations and industrial process analysis. In this work, we\nintroduce LMS-AutoTSF, a novel time series forecasting architecture that\nincorporates autocorrelation while leveraging dual encoders operating at\nmultiple scales. Unlike models that rely on predefined trend and seasonal\ncomponents, LMS-AutoTSF employs two separate encoders per scale: one focusing\non low-pass filtering to capture trends and the other utilizing high-pass\nfiltering to model seasonal variations. These filters are learnable, allowing\nthe model to dynamically adapt and isolate trend and seasonal components\ndirectly in the frequency domain. A key innovation in our approach is the\nintegration of autocorrelation, achieved by computing lagged differences in\ntime steps, which enables the model to capture dependencies across time more\neffectively. Each encoder processes the input through fully connected layers to\nhandle temporal and channel interactions. By combining frequency-domain\nfiltering, autocorrelation-based temporal modeling, and channel-wise\ntransformations, LMS-AutoTSF not only accurately captures long-term\ndependencies and fine-grained patterns but also operates more efficiently\ncompared to other state-of-the-art methods. Its lightweight design ensures\nfaster processing while maintaining high precision in forecasting across\ndiverse time horizons. The source code is publicly available at\n\\url{http://github.com/mribrahim/LMS-TSF}\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "bWH8AMQBFvtG__erUxAOVLrvLvAd1GjzlV0YLKeoUNI",
  "pdfSize": "2054575"
}