{"id":"2412.12847","title":"Ab Initio Conformational Analysis of $\\alpha$/$\\beta$-D-Xylopyranose at\n  Pyrolysis Conditions","authors":"Bernardo Ballotta, Jacopo Lupi, Leandro Ayarde-Henr\\'iquez, and\n  Stephen Dooley","authorsParsed":[["Ballotta","Bernardo",""],["Lupi","Jacopo",""],["Ayarde-Henríquez","Leandro",""],["Dooley","Stephen",""]],"versions":[{"version":"v1","created":"Tue, 17 Dec 2024 12:19:44 GMT"}],"updateDate":"2024-12-18","timestamp":1734437984000,"abstract":"  Xylopyranose is the principal monosaccharide unit of hemicellulose, one of\nthe three major biopolymers of lignocellulosic biomass. Understanding its\ndecomposition mechanism is increasingly relevant for thermochemical biorefinery\nresearch such as pyrolysis. Significant efforts have been made to study its\nchemical and structural properties using both computational and experimental\nmethods. However, due to its high structural flexibility and numerous hydroxyl\ngroups, various metastable conformers arise. In this work, we performed a\ncomputational exploration of the conformational space of both anomeric forms,\n$\\alpha$ and $\\beta$ , of D-xylopyranose using the semi-empirical GFN2-xTB\nmethod in conjunction with metadynamics and density functional theory\nsimulations for structural optimization and vibrational analysis. Xylopyranose\nconformers free energy and enthalpy variations are analyzed across temperatures\ntypical of fast biomass pyrolysis (298-1068 K), with the Boltzmann population\ndistribution of the most populated conformers determined. This study provides a\ndetailed computational analysis of the conformational space and thermochemistry\nof xylopyranose. Additionally, 44 and 59 conformers of the $\\alpha$ and $\\beta$\nanomers were found, for both of which a selection of 10 conformers based on\nBoltzmann population distribution analysis is performed to reduce the\nconformational space for ab initio studies of the pyrolysis reaction kinetics.\n","subjects":["Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"k1KtMUrfaFoXQXNk-fdWYXQkl_IuJqzr9tXzxOw6tH8","pdfSize":"3417669"}