{"id":"2412.02808","title":"Temporally Consistent Dynamic Scene Graphs: An End-to-End Approach for\n  Action Tracklet Generation","authors":"Raphael Ruschel, Md Awsafur Rahman, Hardik Prajapati, Suya You, B. S.\n  Manjuanth","authorsParsed":[["Ruschel","Raphael",""],["Rahman","Md Awsafur",""],["Prajapati","Hardik",""],["You","Suya",""],["Manjuanth","B. S.",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 20:19:20 GMT"}],"updateDate":"2024-12-05","timestamp":1733257160000,"abstract":"  Understanding video content is pivotal for advancing real-world applications\nlike activity recognition, autonomous systems, and human-computer interaction.\nWhile scene graphs are adept at capturing spatial relationships between objects\nin individual frames, extending these representations to capture dynamic\ninteractions across video sequences remains a significant challenge. To address\nthis, we present TCDSG, Temporally Consistent Dynamic Scene Graphs, an\ninnovative end-to-end framework that detects, tracks, and links subject-object\nrelationships across time, generating action tracklets, temporally consistent\nsequences of entities and their interactions. Our approach leverages a novel\nbipartite matching mechanism, enhanced by adaptive decoder queries and feedback\nloops, ensuring temporal coherence and robust tracking over extended sequences.\nThis method not only establishes a new benchmark by achieving over 60%\nimprovement in temporal recall@k on the Action Genome, OpenPVSG, and MEVA\ndatasets but also pioneers the augmentation of MEVA with persistent object ID\nannotations for comprehensive tracklet generation. By seamlessly integrating\nspatial and temporal dynamics, our work sets a new standard in multi-frame\nvideo analysis, opening new avenues for high-impact applications in\nsurveillance, autonomous navigation, and beyond.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"JKxyuSFSBd6MnwJZJb7tQ01WO7or4TW7A0Y5cbULxaM","pdfSize":"2081692"}