{"id":"2412.10205","title":"Partially Coherent Crystalline Undulator Radiation from a Positron Bunch\n  Modulated via the SASE XFEL Process","authors":"Hayk L. Gevorgyan and Lekdar A. Gevorgian","authorsParsed":[["Gevorgyan","Hayk L.",""],["Gevorgian","Lekdar A.",""]],"versions":[{"version":"v1","created":"Fri, 13 Dec 2024 15:26:33 GMT"},{"version":"v2","created":"Sun, 12 Jan 2025 10:00:03 GMT"}],"updateDate":"2025-01-14","timestamp":1734103593000,"abstract":"  Crystalline undulator (CU), where the positrons of a bunch are channeled\nplanarly, is considered. In contrast to channeling radiation, CU radiation\n(CUR) occurs due to the average sinusoidal motion of positrons. Taking into\naccount the medium polarization, besides hard photons, soft photons are also\ngenerated. In the SASE XFEL process, microbunching occurs with a longitudinal\nsize on the order of the wavelength of the stimulated radiation due to the\ninteraction between positrons and generated photons at zero angle. These\nmicrobunches in CU will radiate coherently, and the radiation of the bunch will\nbe partially coherent. Charged particles organized into a microbunch with a\nwell-defined spatial phase distribution can emit coherent (synergistic or\ncollective) radiation when the wavelength of the emitted radiation is\ncomparable to or longer than the longitudinal size of the microbunch. The CU\nparameters, the spatial period and the amplitude, are selected to preserve both\nthe channeling phenomenon of positrons and the coherence of CUR from positron\nmicrobunches. The gain of spontaneous radiation depends on the modulation depth\nof the microbunch, which is a critical parameter of the bunch and can also be\ndetermined through the proposed experiment. A numerical analysis has been\nconducted for a specific case involving CUR generated by a positron bunch\nmodulated during the SASE XFEL, at a corresponding wavelength of the process.\n","subjects":["Physics/Accelerator Physics","Physics/High Energy Physics - Experiment","Physics/High Energy Physics - Phenomenology","Physics/Classical Physics","Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"RHvAbijDArn3owDY3aRWvMwJxajR2c3s8igmP1jV36g","pdfSize":"412691"}