{
  "id": "2412.11840",
  "title": "Sonar-based Deep Learning in Underwater Robotics: Overview, Robustness\n  and Challenges",
  "authors": "Martin Aubard, Ana Madureira, Lu\\'is Teixeira, Jos\\'e Pinto",
  "authorsParsed": [
    [
      "Aubard",
      "Martin",
      ""
    ],
    [
      "Madureira",
      "Ana",
      ""
    ],
    [
      "Teixeira",
      "Luís",
      ""
    ],
    [
      "Pinto",
      "José",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 15:03:08 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734361388000,
  "abstract": "  With the growing interest in underwater exploration and monitoring,\nAutonomous Underwater Vehicles (AUVs) have become essential. The recent\ninterest in onboard Deep Learning (DL) has advanced real-time environmental\ninteraction capabilities relying on efficient and accurate vision-based DL\nmodels. However, the predominant use of sonar in underwater environments,\ncharacterized by limited training data and inherent noise, poses challenges to\nmodel robustness. This autonomy improvement raises safety concerns for\ndeploying such models during underwater operations, potentially leading to\nhazardous situations. This paper aims to provide the first comprehensive\noverview of sonar-based DL under the scope of robustness. It studies\nsonar-based DL perception task models, such as classification, object\ndetection, segmentation, and SLAM. Furthermore, the paper systematizes\nsonar-based state-of-the-art datasets, simulators, and robustness methods such\nas neural network verification, out-of-distribution, and adversarial attacks.\nThis paper highlights the lack of robustness in sonar-based DL research and\nsuggests future research pathways, notably establishing a baseline sonar-based\ndataset and bridging the simulation-to-reality gap.\n",
  "subjects": [
    "Computer Science/Robotics",
    "Computer Science/Computer Vision and Pattern Recognition",
    "Electrical Engineering and Systems Science/Signal Processing"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "tDsgtPhiaDvVobcBgBQHh_f3KyU70m7hqrjdM9OQBvw",
  "pdfSize": "1077468"
}