{"id":"2412.16249","title":"Decoding fairness: a reinforcement learning perspective","authors":"Guozhong Zheng, Jiqiang Zhang, Xin Ou, Shengfeng Deng, and Li Chen","authorsParsed":[["Zheng","Guozhong",""],["Zhang","Jiqiang",""],["Ou","Xin",""],["Deng","Shengfeng",""],["Chen","Li",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 01:29:49 GMT"}],"updateDate":"2024-12-24","timestamp":1734658189000,"abstract":"  Behavioral experiments on the ultimatum game (UG) reveal that we humans\nprefer fair acts, which contradicts the prediction made in orthodox Economics.\nExisting explanations, however, are mostly attributed to exogenous factors\nwithin the imitation learning framework. Here, we adopt the reinforcement\nlearning paradigm, where individuals make their moves aiming to maximize their\naccumulated rewards. Specifically, we apply Q-learning to UG, where each player\nis assigned two Q-tables to guide decisions for the roles of proposer and\nresponder. In a two-player scenario, fairness emerges prominently when both\nexperiences and future rewards are appreciated. In particular, the probability\nof successful deals increases with higher offers, which aligns with\nobservations in behavioral experiments. Our mechanism analysis reveals that the\nsystem undergoes two phases, eventually stabilizing into fair or rational\nstrategies. These results are robust when the rotating role assignment is\nreplaced by a random or fixed manner, or the scenario is extended to a latticed\npopulation. Our findings thus conclude that the endogenous factor is sufficient\nto explain the emergence of fairness, exogenous factors are not needed.\n","subjects":["Computer Science/Machine Learning","Condensed Matter/Disordered Systems and Neural Networks","Nonlinear Sciences/Adaptation and Self-Organizing Systems","Physics/Physics and Society","Quantitative Biology/Populations and Evolution"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Vkl27XFwXMvDcSBS-CA6bBsT5sXu9pkx5pR4ET7zNmE","pdfSize":"2900056"}