{
  "id": "2412.02927",
  "title": "Impact of the Hawking Effect on the Fully Entangled Fraction of\n  Three-qubit States in Schwarzschild Spacetime",
  "authors": "Guang-Wei Mi, Xiaofen Huang, Shao-Ming Fei, and Tinggui Zhang",
  "authorsParsed": [
    [
      "Mi",
      "Guang-Wei",
      ""
    ],
    [
      "Huang",
      "Xiaofen",
      ""
    ],
    [
      "Fei",
      "Shao-Ming",
      ""
    ],
    [
      "Zhang",
      "Tinggui",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 00:37:30 GMT"
    }
  ],
  "updateDate": "2024-12-05",
  "timestamp": 1733272650000,
  "abstract": "  Wu et al. [J. High Energ. Phys. 2023, 232 (2023)] first found that the\nfidelity of quantum teleportation with a bipartite entangled resource state,\ncompletely determined by the fully entangled fraction (FEF) characterized by\nthe maximal fidelity between the given quantum state and the set of maximally\nentangled states, can monotonically increase in Schwarzschild spacetime. We\ninvestigated the Hawking effect on the FEF of quantum states in tripartite\nsystems. In this paper, we show that the Hawking effect of a black hole may\nboth decrease and increase the FEF in Schwarzschild spacetime. For an initial\nX-type state, we found that the Hawking effect of the black hole has both\npositive and negative impacts on the FEF of Dirac fields, depending on the\nselection of initial states. For an initial W-like state, the Hawking effect of\nthe black hole has only a positive impact on the FEF of Dirac fields,\nindependent of the selection of initial states. Our results provide an\ninsightful view of quantum teleportation in multipartite systems under the\ninfluence of Hawking effects, from the perspective of quantum information and\ngeneral relativity.\n",
  "subjects": [
    "Physics/General Relativity and Quantum Cosmology",
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "nrl0ipXSMbFCYFubfX0sh6jbosdAb07yY-3unq-SyH8",
  "pdfSize": "261748"
}