{
  "id": "2412.00643",
  "title": "Cosmic Accelerations Characterize the Instability of the Critical\n  Friedmann Spacetime",
  "authors": "Christopher Alexander, Blake Temple and Zeke Vogler",
  "authorsParsed": [
    [
      "Alexander",
      "Christopher",
      ""
    ],
    [
      "Temple",
      "Blake",
      ""
    ],
    [
      "Vogler",
      "Zeke",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 1 Dec 2024 02:13:04 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733019184000,
  "abstract": "  We give a definitive characterization of the instability of the pressureless\n($p=0$) critical ($k=0$) Friedmann spacetime to smooth radial perturbations. We\nuse this to characterize the global accelerations away from $k\\leq0$ Friedmann\nspacetimes induced by the instability in the underdense case. The analysis\nbegins by incorporating the Friedmann spacetimes into a mathematical analysis\nof smooth spherically symmetric solutions of the Einstein field equations\nexpressed in self-similar coordinates $(t,\\xi)$ with $\\xi=\\frac{r}{t}<1$,\nconceived to realize the critical Friedmann spacetime as an unstable saddle\nrest point $SM$. We identify a new maximal asymptotically stable family\n$\\mathcal{F}$ of smooth outwardly expanding solutions which globally\ncharacterize the evolution of underdense perturbations. Solutions in\n$\\mathcal{F}$ align with a $k<0$ Friedmann spacetime at early times,\ngenerically introduce accelerations away from $k<0$ Friedmann spacetimes at\nintermediate times and then decay back to the same $k<0$ Friedmann spacetime as\n$t\\to\\infty$ uniformly at each fixed radius $r>0$. We propose $\\mathcal{F}$ as\nthe maximal asymptotically stable family of solutions into which generic\nunderdense perturbations of the unstable critical Friedmann spacetime will\nevolve and naturally admit accelerations away from Friedmann spacetimes within\nthe dynamics of solutions of Einstein's original field equations, that is,\nwithout recourse to a cosmological constant or dark energy.\n",
  "subjects": [
    "Physics/General Relativity and Quantum Cosmology",
    "Physics/Mathematical Physics",
    "Mathematics/Mathematical Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "sje7tWyy9TeSA5MjknGYN2rxuk3MNLDyfRZWEWpalz8",
  "pdfSize": "2091243"
}