{"id":"2412.04392","title":"Asynchronous Batch Bayesian Optimization with Pipelining Evaluations for\n  Experimental Resource$\\unicode{x2013}$constrained Conditions","authors":"Yujin Taguchi, Yusuke Shibuya, Yusuke Hiki, Takashi Morikura, Takahiro\n  G. Yamada, Akira Funahashi","authorsParsed":[["Taguchi","Yujin",""],["Shibuya","Yusuke",""],["Hiki","Yusuke",""],["Morikura","Takashi",""],["Yamada","Takahiro G.",""],["Funahashi","Akira",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 18:06:09 GMT"}],"updateDate":"2024-12-06","timestamp":1733421969000,"abstract":"  Bayesian optimization is efficient even with a small amount of data and is\nused in engineering and in science, including biology and chemistry. In\nBayesian optimization, a parameterized model with an uncertainty is fitted to\nexplain the experimental data, and then the model suggests parameters that\nwould most likely improve the results. Batch Bayesian optimization reduces the\nprocessing time of optimization by parallelizing experiments. However, batch\nBayesian optimization cannot be applied if the number of parallelized\nexperiments is limited by the cost or scarcity of equipment; in such cases,\nsequential methods require an unrealistic amount of time. In this study, we\ndeveloped pipelining Bayesian optimization (PipeBO) to reduce the processing\ntime of optimization even with a limited number of parallel experiments. PipeBO\nwas inspired by the pipelining of central processing unit architecture, which\ndivides computational tasks into multiple processes. PipeBO was designed to\nachieve experiment parallelization by overlapping various processes of the\nexperiments. PipeBO uses the results of completed experiments to update the\nparameters of running parallelized experiments. Using the Black-Box\nOptimization Benchmarking, which consists of 24 benchmark functions, we\ncompared PipeBO with the sequential Bayesian optimization methods. PipeBO\nreduced the average processing time of optimization to about 56% for the\nexperiments that consisted of two processes or even less for those with more\nprocesses for 20 out of the 24 functions. Overall, PipeBO parallelizes Bayesian\noptimization in the resource-constrained settings so that efficient\noptimization can be achieved.\n","subjects":["Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"ZMVIeBwgUQ6dF0VbDtbPlH4DxadJuXMgDVaBbLoyl2Y","pdfSize":"3873869"}