{
  "id": "2412.08191",
  "title": "Long-term radio variability of active galactic nuclei at 37 GHz",
  "authors": "Sofia Kankkunen, Merja Tornikoski, Talvikki Hovatta, Anne\n  L\\\"ahteenm\\\"aki",
  "authorsParsed": [
    [
      "Kankkunen",
      "Sofia",
      ""
    ],
    [
      "Tornikoski",
      "Merja",
      ""
    ],
    [
      "Hovatta",
      "Talvikki",
      ""
    ],
    [
      "Lähteenmäki",
      "Anne",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 08:33:36 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733906016000,
  "abstract": "  We present the results of analysing the long-term radio variability of active\ngalactic nuclei at 37 GHz using data of 123 sources observed in the Aalto\nUniversity Mets\\\"ahovi Radio Observatory. Our aim was to constrain the\ncharacteristic timescales of the studied sources and to analyse whether up to\n42 years of monitoring was enough to describe their variability behaviour. We\nused a periodogram to estimate the power spectral density of each source. The\npower spectral density is used to analyse the power content of a time series in\nthe frequency domain, and it is a powerful tool in describing the variability\nof active galactic nuclei. We were interested in finding a bend frequency in\nthe power spectrum, that is, a frequency at which the slope $\\beta$ of the\nspectrum changes from a non-zero value to zero. We fitted two models to the\nperiodograms of each source, namely the bending power law and the simple power\nlaw. The bend frequency in the bending power law corresponds to a\ncharacteristic timescale. We were able to constrain a timescale for 11 out of\n123 sources, with an average characteristic timescale x_b = 1300 days and an\naverage power-law slope $\\beta$ = 2.3. The results suggest that up to 42 years\nof observations may not always be enough for obtaining a characteristic\ntimescale in the radio domain. This is likely caused by a combination of both\nslow variability as well as sampling induced effects. We also compared the\nobtained timescales to 43 GHz very long baseline interferometry images. The\nmaximum length of time a knot was visible was often close to the obtained\ncharacteristic timescale. This suggests a connection between the characteristic\ntimescale and the jet structure.\n",
  "subjects": [
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "YbNfj58k1rqdFyw1NIJZhbLhs_LhlpmIdqZQt6NY6fU",
  "pdfSize": "1812564"
}