{
  "id": "2412.20800",
  "title": "VMix: Improving Text-to-Image Diffusion Model with Cross-Attention\n  Mixing Control",
  "authors": "Shaojin Wu, Fei Ding, Mengqi Huang, Wei Liu, Qian He",
  "authorsParsed": [
    [
      "Wu",
      "Shaojin",
      ""
    ],
    [
      "Ding",
      "Fei",
      ""
    ],
    [
      "Huang",
      "Mengqi",
      ""
    ],
    [
      "Liu",
      "Wei",
      ""
    ],
    [
      "He",
      "Qian",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 30 Dec 2024 08:47:25 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735548445000,
  "abstract": "  While diffusion models show extraordinary talents in text-to-image\ngeneration, they may still fail to generate highly aesthetic images. More\nspecifically, there is still a gap between the generated images and the\nreal-world aesthetic images in finer-grained dimensions including color,\nlighting, composition, etc. In this paper, we propose Cross-Attention Value\nMixing Control (VMix) Adapter, a plug-and-play aesthetics adapter, to upgrade\nthe quality of generated images while maintaining generality across visual\nconcepts by (1) disentangling the input text prompt into the content\ndescription and aesthetic description by the initialization of aesthetic\nembedding, and (2) integrating aesthetic conditions into the denoising process\nthrough value-mixed cross-attention, with the network connected by\nzero-initialized linear layers. Our key insight is to enhance the aesthetic\npresentation of existing diffusion models by designing a superior condition\ncontrol method, all while preserving the image-text alignment. Through our\nmeticulous design, VMix is flexible enough to be applied to community models\nfor better visual performance without retraining. To validate the effectiveness\nof our method, we conducted extensive experiments, showing that VMix\noutperforms other state-of-the-art methods and is compatible with other\ncommunity modules (e.g., LoRA, ControlNet, and IPAdapter) for image generation.\nThe project page is https://vmix-diffusion.github.io/VMix/.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "ONTw1A_UTLl0QOo-g-Jk95Ok9FNfN7a9irJuq-dBhaE",
  "pdfSize": "15537119"
}