{"id":"2412.08591","title":"RoomTour3D: Geometry-Aware Video-Instruction Tuning for Embodied\n  Navigation","authors":"Mingfei Han, Liang Ma, Kamila Zhumakhanova, Ekaterina Radionova,\n  Jingyi Zhang, Xiaojun Chang, Xiaodan Liang, Ivan Laptev","authorsParsed":[["Han","Mingfei",""],["Ma","Liang",""],["Zhumakhanova","Kamila",""],["Radionova","Ekaterina",""],["Zhang","Jingyi",""],["Chang","Xiaojun",""],["Liang","Xiaodan",""],["Laptev","Ivan",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 18:10:21 GMT"}],"updateDate":"2024-12-12","timestamp":1733940621000,"abstract":"  Vision-and-Language Navigation (VLN) suffers from the limited diversity and\nscale of training data, primarily constrained by the manual curation of\nexisting simulators. To address this, we introduce RoomTour3D, a\nvideo-instruction dataset derived from web-based room tour videos that capture\nreal-world indoor spaces and human walking demonstrations. Unlike existing VLN\ndatasets, RoomTour3D leverages the scale and diversity of online videos to\ngenerate open-ended human walking trajectories and open-world navigable\ninstructions. To compensate for the lack of navigation data in online videos,\nwe perform 3D reconstruction and obtain 3D trajectories of walking paths\naugmented with additional information on the room types, object locations and\n3D shape of surrounding scenes. Our dataset includes $\\sim$100K open-ended\ndescription-enriched trajectories with $\\sim$200K instructions, and 17K\naction-enriched trajectories from 1847 room tour environments. We demonstrate\nexperimentally that RoomTour3D enables significant improvements across multiple\nVLN tasks including CVDN, SOON, R2R, and REVERIE. Moreover, RoomTour3D\nfacilitates the development of trainable zero-shot VLN agents, showcasing the\npotential and challenges of advancing towards open-world navigation.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Artificial Intelligence","Computer Science/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"F1JFZtXMJTrR6vMz6_s4jes2TkKc1NkMuYmY4rP2iAU","pdfSize":"5444876"}