{
  "id": "2412.17327",
  "title": "Spatial function-on-function regression",
  "authors": "Ufuk Beyaztas, Han Lin Shang, Gizel Bakicierler Sezer, Abhijit Mandal,\n  Roger S. Zoh and Carmen D. Tekwe",
  "authorsParsed": [
    [
      "Beyaztas",
      "Ufuk",
      ""
    ],
    [
      "Shang",
      "Han Lin",
      ""
    ],
    [
      "Sezer",
      "Gizel Bakicierler",
      ""
    ],
    [
      "Mandal",
      "Abhijit",
      ""
    ],
    [
      "Zoh",
      "Roger S.",
      ""
    ],
    [
      "Tekwe",
      "Carmen D.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 06:38:16 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734935896000,
  "abstract": "  We introduce a spatial function-on-function regression model to capture\nspatial dependencies in functional data by integrating spatial autoregressive\ntechniques with functional principal component analysis. The proposed model\naddresses a critical gap in functional regression by enabling the analysis of\nfunctional responses influenced by spatially correlated functional predictors,\na common scenario in fields such as environmental sciences, epidemiology, and\nsocio-economic studies. The model employs a spatial functional principal\ncomponent decomposition on the response and a classical functional principal\ncomponent decomposition on the predictor, transforming the functional data into\na finite-dimensional multivariate spatial autoregressive framework. This\ntransformation allows efficient estimation and robust handling of spatial\ndependencies through least squares methods. In a series of extensive\nsimulations, the proposed model consistently demonstrated superior performance\nin estimating both spatial autocorrelation and regression coefficient functions\ncompared to some favorably existing traditional approaches, particularly under\nmoderate to strong spatial effects. Application of the proposed model to\nBrazilian COVID-19 data further underscored its practical utility, revealing\ncritical spatial patterns in confirmed cases and death rates that align with\nknown geographic and social interactions. An R package provides a comprehensive\nimplementation of the proposed estimation method, offering a user-friendly and\nefficient tool for researchers and practitioners to apply the methodology in\nreal-world scenarios.\n",
  "subjects": [
    "Statistics/Methodology",
    "Statistics/Computation"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "0EaV7LQRCjZ7myr34YA_vulRHxlJtxd7QjfwDU5xNjo",
  "pdfSize": "3229476"
}