{"id":"2412.11779","title":"Impact of Face Alignment on Face Image Quality","authors":"Eren Onaran, Erdi Sar{\\i}ta\\c{s}, Haz{\\i}m Kemal Ekenel","authorsParsed":[["Onaran","Eren",""],["Sarıtaş","Erdi",""],["Ekenel","Hazım Kemal",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 13:49:57 GMT"}],"updateDate":"2024-12-17","timestamp":1734356997000,"abstract":"  Face alignment is a crucial step in preparing face images for feature\nextraction in facial analysis tasks. For applications such as face recognition,\nfacial expression recognition, and facial attribute classification, alignment\nis widely utilized during both training and inference to standardize the\npositions of key landmarks in the face. It is well known that the application\nand method of face alignment significantly affect the performance of facial\nanalysis models. However, the impact of alignment on face image quality has not\nbeen thoroughly investigated. Current FIQA studies often assume alignment as a\nprerequisite but do not explicitly evaluate how alignment affects quality\nmetrics, especially with the advent of modern deep learning-based detectors\nthat integrate detection and landmark localization. To address this need, our\nstudy examines the impact of face alignment on face image quality scores. We\nconducted experiments on the LFW, IJB-B, and SCFace datasets, employing MTCNN\nand RetinaFace models for face detection and alignment. To evaluate face image\nquality, we utilized several assessment methods, including SER-FIQ, FaceQAN,\nDifFIQA, and SDD-FIQA. Our analysis included examining quality score\ndistributions for the LFW and IJB-B datasets and analyzing average quality\nscores at varying distances in the SCFace dataset. Our findings reveal that\nface image quality assessment methods are sensitive to alignment. Moreover,\nthis sensitivity increases under challenging real-life conditions, highlighting\nthe importance of evaluating alignment's role in quality assessment.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"jgng1Gc7hUHauYt02w7gXAOZOnnh-neTm7b4kJCeP4I","pdfSize":"914239"}