{"id":"2412.02803","title":"Gaussian Splatting Under Attack: Investigating Adversarial Noise in 3D\n  Objects","authors":"Abdurrahman Zeybey, Mehmet Ergezer, Tommy Nguyen","authorsParsed":[["Zeybey","Abdurrahman",""],["Ergezer","Mehmet",""],["Nguyen","Tommy",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 20:11:21 GMT"}],"updateDate":"2024-12-05","timestamp":1733256681000,"abstract":"  3D Gaussian Splatting has advanced radiance field reconstruction, enabling\nhigh-quality view synthesis and fast rendering in 3D modeling. While\nadversarial attacks on object detection models are well-studied for 2D images,\ntheir impact on 3D models remains underexplored. This work introduces the\nMasked Iterative Fast Gradient Sign Method (M-IFGSM), designed to generate\nadversarial noise targeting the CLIP vision-language model. M-IFGSM\nspecifically alters the object of interest by focusing perturbations on masked\nregions, degrading the performance of CLIP's zero-shot object detection\ncapability when applied to 3D models. Using eight objects from the Common\nObjects 3D (CO3D) dataset, we demonstrate that our method effectively reduces\nthe accuracy and confidence of the model, with adversarial noise being nearly\nimperceptible to human observers. The top-1 accuracy in original model renders\ndrops from 95.4\\% to 12.5\\% for train images and from 91.2\\% to 35.4\\% for test\nimages, with confidence levels reflecting this shift from true classification\nto misclassification, underscoring the risks of adversarial attacks on 3D\nmodels in applications such as autonomous driving, robotics, and surveillance.\nThe significance of this research lies in its potential to expose\nvulnerabilities in modern 3D vision models, including radiance fields,\nprompting the development of more robust defenses and security measures in\ncritical real-world applications.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Artificial Intelligence","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"AB-4rajoIUUKWAki_NYeR19HZigUJqdvZ7O2Vjxd9jw","pdfSize":"3409602"}