{"id":"2412.20989","title":"New Black Hole Solutions of Second and First Order Formulations of\n  Nonlinear Electrodynamics","authors":"Yosef Verbin, Beyhan Pulice, Ali \\\"Ovg\\\"un and Hyat Huang","authorsParsed":[["Verbin","Yosef",""],["Pulice","Beyhan",""],["Övgün","Ali",""],["Huang","Hyat",""]],"versions":[{"version":"v1","created":"Mon, 30 Dec 2024 14:56:09 GMT"},{"version":"v2","created":"Sat, 11 Jan 2025 15:41:36 GMT"}],"updateDate":"2025-01-14","timestamp":1735570569000,"abstract":"  Inspired by the so-called Palatini formulation of General Relativity and of\nits modifications and extensions, we consider an analogous formulation of the\ndynamics of a self-interacting gauge field which is determined by non-linear\nextension of Maxwell's theory, usually known as nonlinear electrodynamics. In\nthis first order formalism the field strength and the gauge potential are\ntreated, a priori as independent, and, as such, varied independently in order\nto produce the field equations. Accordingly we consider within this formalism\nalternative and generalized non-linear Lagrangian densities. Several new\nspherically-symmetric objects are constructed analytically and their main\nproperties are studied. The solutions are obtained in flat spacetime ignoring\ngravity and for the self-gravitating case with emphasis on black holes. As a\nbackground for comparison between the first and second order formalisms, some\nof the solutions are obtained by the conventional second order formalism, while\nfor others a first order formalism is applied. Among the self-gravitating\nsolutions we find new black holes and study their main characteristics. Some of\nthe solutions can regularize the total energy of a point charge although their\nblack hole counterparts are not regular.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"16gCIC_SmHMW3IePVQdZxZH_MczwVuy0aLSDcs6k-rs","pdfSize":"1266172"}