{
  "id": "2412.12081",
  "title": "$X+y$: insights on gas thermodynamics from the combination of X-ray and\n  thermal Sunyaev-Zel'dovich data cross-correlated with cosmic shear",
  "authors": "Adrien La Posta, David Alonso, Nora Elisa Chisari, Tassia Ferreira,\n  Carlos Garc\\'ia-Garc\\'ia",
  "authorsParsed": [
    [
      "La Posta",
      "Adrien",
      ""
    ],
    [
      "Alonso",
      "David",
      ""
    ],
    [
      "Chisari",
      "Nora Elisa",
      ""
    ],
    [
      "Ferreira",
      "Tassia",
      ""
    ],
    [
      "García-García",
      "Carlos",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 18:49:56 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734374996000,
  "abstract": "  We measure the cross-correlation between cosmic shear from the third-year\nrelease of the Dark Energy Survey, thermal Sunyaev-Zel'dovich (tSZ) maps from\nPlanck, and X-ray maps from ROSAT. We investigate the possibility of developing\na physical model able to jointly describe both measurements, simultaneously\nconstraining the spatial distribution and thermodynamic properties of hot gas.\nWe find that a relatively simple model is able to describe both sets of\nmeasurements and to make reasonably accurate predictions for other observables\n(the tSZ auto-correlation, its cross-correlation with X-rays, and tomographic\nmeasurements of the bias-weighted mean gas pressure). We show, however, that\ncontamination from X-ray AGN, as well as the impact of non-thermal pressure\nsupport, must be incorporated in order to fully resolve tensions in parameter\nspace between different data combinations. We obtain simultaneous constraints\non the mass scale at which half of the gas content has been expelled from the\nhalo, $\\mathrm{log}_{10}(M_c)=14.83^{+0.16}_{-0.23}$, on the polytropic index\nof the gas, $\\Gamma=1.144^{+0.016}_{-0.013}$, and on the ratio of the central\ngas temperature to the virial temperature $\\alpha_T=1.30^{+0.15}_{-0.28}$.\n",
  "subjects": [
    "Astrophysics/Cosmology and Nongalactic Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "i5FJOhOQ-1VLSTd2ndIph30NlBXWi1nHCNnr7g9sRCM",
  "pdfSize": "2083891"
}