{
  "id": "2412.06431",
  "title": "A Program Instrumentation Framework for Automatic Verification",
  "authors": "Jesper Amilon, Zafer Esen, Dilian Gurov, Christian Lidstr\\\"om, Philipp\n  R\\\"ummer, Marten Voorberg",
  "authorsParsed": [
    [
      "Amilon",
      "Jesper",
      ""
    ],
    [
      "Esen",
      "Zafer",
      ""
    ],
    [
      "Gurov",
      "Dilian",
      ""
    ],
    [
      "Lidström",
      "Christian",
      ""
    ],
    [
      "Rümmer",
      "Philipp",
      ""
    ],
    [
      "Voorberg",
      "Marten",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 12:17:31 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733746651000,
  "abstract": "  In deductive verification and software model checking, dealing with certain\nspecification language constructs can be problematic when the back-end solver\nis not sufficiently powerful or lacks the required theories. One way to deal\nwith this is to transform, for verification purposes, the program to an\nequivalent one not using the problematic constructs, and to reason about this\nequivalent program instead. In this article, we propose program instrumentation\nas a unifying verification paradigm that subsumes various existing ad-hoc\napproaches, has a clear formal correctness criterion, can be applied\nautomatically, and can transfer back witnesses and counterexamples. We\nillustrate our approach on the automated verification of programs that involve\nquantification and aggregation operations over arrays, such as the maximum\nvalue or sum of the elements in a given segment of the array, which are known\nto be difficult to reason about automatically. We implement our approach in the\nMonoCera tool, which is tailored to the verification of programs with\naggregation, and evaluate it on example programs, including SV-COMP programs.\n",
  "subjects": [
    "Computer Science/Logic in Computer Science"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "eVg_3XagGblzO2S2_EIY3vbFd30pqqVcsdZTzCnV8ys",
  "pdfSize": "542869"
}