{
  "id": "2412.06252",
  "title": "Frolov Black Hole Surrounded by Quintessence -- I: Thermodynamics,\n  Geodesics and Shadows",
  "authors": "Mrinnoy M. Gohain, Kalyan Bhuyan, Rajnandini Borgohain, Tonmoyee\n  Gogoi, Kakoli Bhuyan, Prabwal Phukon",
  "authorsParsed": [
    [
      "Gohain",
      "Mrinnoy M.",
      ""
    ],
    [
      "Bhuyan",
      "Kalyan",
      ""
    ],
    [
      "Borgohain",
      "Rajnandini",
      ""
    ],
    [
      "Gogoi",
      "Tonmoyee",
      ""
    ],
    [
      "Bhuyan",
      "Kakoli",
      ""
    ],
    [
      "Phukon",
      "Prabwal",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 07:06:40 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733728000000,
  "abstract": "  The Frolov black hole (BH) is a charged extension of the Hayward BH, having\nregularity at the central point $r = 0$ and an asymptotically Schwarzschild\nform for large values of $r$. Such a BH is parameterized by a length scale\nparameter, $\\alpha_0$. In this paper, we analyze the thermodynamic properties,\nnull and timelike geodesics, and shadows of a Frolov BH immersed in a\nquintessence field. Our results indicate that the smaller BH is locally\nthermodynamically stable yet globally unstable at all horizon radii. Neither\nthe quintessence parameter nor the other model parameters like the charge $q$\nand length scale parameter $\\alpha_0$ change this global instability. We extend\nthe study of the null and timelike geodesics to the vicinity of the BH by\nanalyzing how the geodesic motion depends on the model parameters. A strong\nquintessence field exerts a repulsive effect in the case of null geodesics,\nwhile in contrast the precession of timelike orbits is least affected by the\nparameter associated with the quintessence field. Finally, we analyze the\nshadow of the BH system and find that the shadow radii are sensitively\ndependent on model parameters. In contrast the influence of the quintessence\nparameter itself on the size of the shadow is found to be rather weak.\n",
  "subjects": [
    "Physics/General Relativity and Quantum Cosmology"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "kb1SvOITOMBRT2r7npQC8IWOUJ0AgxLF1aTc2tngJXc",
  "pdfSize": "2105789"
}