{
  "id": "2412.06708",
  "title": "FlexEvent: Event Camera Object Detection at Arbitrary Frequencies",
  "authors": "Dongyue Lu, Lingdong Kong, Gim Hee Lee, Camille Simon Chane, Wei Tsang\n  Ooi",
  "authorsParsed": [
    [
      "Lu",
      "Dongyue",
      ""
    ],
    [
      "Kong",
      "Lingdong",
      ""
    ],
    [
      "Lee",
      "Gim Hee",
      ""
    ],
    [
      "Chane",
      "Camille Simon",
      ""
    ],
    [
      "Ooi",
      "Wei Tsang",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 17:57:14 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733767034000,
  "abstract": "  Event cameras offer unparalleled advantages for real-time perception in\ndynamic environments, thanks to their microsecond-level temporal resolution and\nasynchronous operation. Existing event-based object detection methods, however,\nare limited by fixed-frequency paradigms and fail to fully exploit the\nhigh-temporal resolution and adaptability of event cameras. To address these\nlimitations, we propose FlexEvent, a novel event camera object detection\nframework that enables detection at arbitrary frequencies. Our approach\nconsists of two key components: FlexFuser, an adaptive event-frame fusion\nmodule that integrates high-frequency event data with rich semantic information\nfrom RGB frames, and FAL, a frequency-adaptive learning mechanism that\ngenerates frequency-adjusted labels to enhance model generalization across\nvarying operational frequencies. This combination allows our method to detect\nobjects with high accuracy in both fast-moving and static scenarios, while\nadapting to dynamic environments. Extensive experiments on large-scale event\ncamera datasets demonstrate that our approach surpasses state-of-the-art\nmethods, achieving significant improvements in both standard and high-frequency\nsettings. Notably, our method maintains robust performance when scaling from 20\nHz to 90 Hz and delivers accurate detection up to 180 Hz, proving its\neffectiveness in extreme conditions. Our framework sets a new benchmark for\nevent-based object detection and paves the way for more adaptable, real-time\nvision systems.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Robotics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "qHzTCBAX3bS0Gksje6FLG-rwiDT9966U5F5Q8S5SFic",
  "pdfSize": "5226703"
}