{"id":"2412.20873","title":"Neurophenomenal Structuralism and the Role of Computational Context","authors":"Marlo Pa{\\ss}ler and Adrien Doerig","authorsParsed":[["Paßler","Marlo",""],["Doerig","Adrien",""]],"versions":[{"version":"v1","created":"Mon, 30 Dec 2024 11:24:11 GMT"}],"updateDate":"2024-12-31","timestamp":1735557851000,"abstract":"  Neurophenomenal structuralism posits that conscious experiences are defined\nrelationally and that their phenomenal structures are mirrored by neural\nstructures. While this approach offers a promising framework for identifying\nneural correlates of contents of consciousness (NCCCs), we argue that merely\nestablishing structural correspondences between neural and phenomenal\nstructures is insufficient. This paper emphasizes the critical role of\ncomputational context in determining the content of neural structures. We\nintroduce four criteria - Sensitivity, Organization, Exploitation, and\nContextualization - to evaluate which neural structures are viable NCCC\ncandidates. These criteria highlight that, for neural structures to\nmeaningfully mirror phenomenal structures they have to be actively exploited\nand be able to influence behavior in a structure-preserving way. Our analysis\ndemonstrates that anatomical and causal neural structures fail to meet certain\ncriteria, whereas activation structures can, provided they are embedded within\nthe appropriate computational context. Our findings challenge both local and\nrich global structuralist theories for overlooking the content-constituting\nrole of computational context, leading to proposed NCCCs that fail to fully\naccount for conscious content. We conclude that incorporating computational\ncontext is essential for any structuralist account of consciousness, as it\ndetermines the nature of dimensions within neural activation spaces and,\nconsequently, the content of conscious experiences.\n","subjects":["Quantitative Biology/Neurons and Cognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"iuGTZmIYF90MvstwrxCYDujJyzX2L882i2ahCICwNXU","pdfSize":"1655609"}