{
  "id": "2412.20992",
  "title": "Verified Lifting of Deep learning Operators",
  "authors": "Qi Zhan, Xing Hu, Xin Xia and Shanping Li",
  "authorsParsed": [
    [
      "Zhan",
      "Qi",
      ""
    ],
    [
      "Hu",
      "Xing",
      ""
    ],
    [
      "Xia",
      "Xin",
      ""
    ],
    [
      "Li",
      "Shanping",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 30 Dec 2024 14:57:32 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735570652000,
  "abstract": "  Deep learning operators are fundamental components of modern deep learning\nframeworks. With the growing demand for customized operators, it has become\nincreasingly common for developers to create their own. However, designing and\nimplementing operators is complex and error-prone, due to hardware-specific\noptimizations and the need for numerical stability. There is a pressing need\nfor tools that can summarize the functionality of both existing and\nuser-defined operators. To address this gap, this work introduces a novel\nframework for the verified lifting of deep learning operators, which\nsynthesizes high-level mathematical formulas from low-level implementations.\nOur approach combines symbolic execution, syntax-guided synthesis, and\nSMT-based verification to produce readable and formally verified mathematical\nformulas. In synthesis, we employ a combination of top-down and bottom-up\nstrategies to explore the vast search space efficiently; In verification, we\ndesign invariant synthesis patterns and leverage SMT solvers to validate the\ncorrectness of the derived summaries; In simplification, we use egraph-based\ntechniques with custom rules to restore complex formulas to their natural,\nintuitive forms. Evaluated on a dataset of deep learning operators implemented\nin Triton from the real world, our method demonstrates the effectiveness of\nsynthesis and verification compared to existing techniques. This framework\nbridges the gap between low-level implementations and high-level abstractions,\nimproving understanding and reliability in deep learning operator development.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Programming Languages",
    "Statistics/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "QKTMUsDO1rQbZL0-vqhxFyB9CAv2un7BToj8qhXsOZM",
  "pdfSize": "323340"
}