{
  "id": "2412.03025",
  "title": "Human Variability vs. Machine Consistency: A Linguistic Analysis of\n  Texts Generated by Humans and Large Language Models",
  "authors": "Sergio E. Zanotto, Segun Aroyehun",
  "authorsParsed": [
    [
      "Zanotto",
      "Sergio E.",
      ""
    ],
    [
      "Aroyehun",
      "Segun",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 04:38:35 GMT"
    }
  ],
  "updateDate": "2024-12-05",
  "timestamp": 1733287115000,
  "abstract": "  The rapid advancements in large language models (LLMs) have significantly\nimproved their ability to generate natural language, making texts generated by\nLLMs increasingly indistinguishable from human-written texts. Recent research\nhas predominantly focused on using LLMs to classify text as either\nhuman-written or machine-generated. In our study, we adopt a different approach\nby profiling texts spanning four domains based on 250 distinct linguistic\nfeatures. We select the M4 dataset from the Subtask B of SemEval 2024 Task 8.\nWe automatically calculate various linguistic features with the LFTK tool and\nadditionally measure the average syntactic depth, semantic similarity, and\nemotional content for each document. We then apply a two-dimensional PCA\nreduction to all the calculated features. Our analyses reveal significant\ndifferences between human-written texts and those generated by LLMs,\nparticularly in the variability of these features, which we find to be\nconsiderably higher in human-written texts. This discrepancy is especially\nevident in text genres with less rigid linguistic style constraints. Our\nfindings indicate that humans write texts that are less cognitively demanding,\nwith higher semantic content, and richer emotional content compared to texts\ngenerated by LLMs. These insights underscore the need for incorporating\nmeaningful linguistic features to enhance the understanding of textual outputs\nof LLMs.\n",
  "subjects": [
    "Computer Science/Computation and Language"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "QLHd4G8wdfjWf4Yv8dQ1BBfPeCtlZCUPjwMtP7cR5YA",
  "pdfSize": "1341784"
}