{
  "id": "2412.12688",
  "title": "UniEntrezDB: Large-scale Gene Ontology Annotation Dataset and Evaluation\n  Benchmarks with Unified Entrez Gene Identifiers",
  "authors": "Yuwei Miao, Yuzhi Guo, Hehuan Ma, Jingquan Yan, Feng Jiang, Weizhi An,\n  Jean Gao, Junzhou Huang",
  "authorsParsed": [
    [
      "Miao",
      "Yuwei",
      ""
    ],
    [
      "Guo",
      "Yuzhi",
      ""
    ],
    [
      "Ma",
      "Hehuan",
      ""
    ],
    [
      "Yan",
      "Jingquan",
      ""
    ],
    [
      "Jiang",
      "Feng",
      ""
    ],
    [
      "An",
      "Weizhi",
      ""
    ],
    [
      "Gao",
      "Jean",
      ""
    ],
    [
      "Huang",
      "Junzhou",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 09:08:52 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734426532000,
  "abstract": "  Gene studies are crucial for fields such as protein structure prediction,\ndrug discovery, and cancer genomics, yet they face challenges in fully\nutilizing the vast and diverse information available. Gene studies require\nclean, factual datasets to ensure reliable results. Ontology graphs, neatly\norganized domain terminology graphs, provide ideal sources for domain facts.\nHowever, available gene ontology annotations are currently distributed across\nvarious databases without unified identifiers for genes and gene products. To\naddress these challenges, we introduce Unified Entrez Gene Identifier Dataset\nand Benchmarks (UniEntrezDB), the first systematic effort to unify large-scale\npublic Gene Ontology Annotations (GOA) from various databases using unique gene\nidentifiers. UniEntrezDB includes a pre-training dataset and four downstream\ntasks designed to comprehensively evaluate gene embedding performance from\ngene, protein, and cell levels, ultimately enhancing the reliability and\napplicability of LLMs in gene research and other professional settings.\n",
  "subjects": [
    "Computer Science/Databases"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "yikLawzDAjaynhSVZ8YFA6DIaVNu2heuUkRDB8Y8oOM",
  "pdfSize": "6616969"
}