{
  "id": "2412.19130",
  "title": "MVS-GS: High-Quality 3D Gaussian Splatting Mapping via Online Multi-View\n  Stereo",
  "authors": "Byeonggwon Lee, Junkyu Park, Khang Truong Giang, Sungho Jo, Soohwan\n  Song",
  "authorsParsed": [
    [
      "Lee",
      "Byeonggwon",
      ""
    ],
    [
      "Park",
      "Junkyu",
      ""
    ],
    [
      "Giang",
      "Khang Truong",
      ""
    ],
    [
      "Jo",
      "Sungho",
      ""
    ],
    [
      "Song",
      "Soohwan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 26 Dec 2024 09:20:04 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735204804000,
  "abstract": "  This study addresses the challenge of online 3D model generation for neural\nrendering using an RGB image stream. Previous research has tackled this issue\nby incorporating Neural Radiance Fields (NeRF) or 3D Gaussian Splatting (3DGS)\nas scene representations within dense SLAM methods. However, most studies focus\nprimarily on estimating coarse 3D scenes rather than achieving detailed\nreconstructions. Moreover, depth estimation based solely on images is often\nambiguous, resulting in low-quality 3D models that lead to inaccurate\nrenderings. To overcome these limitations, we propose a novel framework for\nhigh-quality 3DGS modeling that leverages an online multi-view stereo (MVS)\napproach. Our method estimates MVS depth using sequential frames from a local\ntime window and applies comprehensive depth refinement techniques to filter out\noutliers, enabling accurate initialization of Gaussians in 3DGS. Furthermore,\nwe introduce a parallelized backend module that optimizes the 3DGS model\nefficiently, ensuring timely updates with each new keyframe. Experimental\nresults demonstrate that our method outperforms state-of-the-art dense SLAM\nmethods, particularly excelling in challenging outdoor environments.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "6aFY1UhO1jTegyhKZbCpjr8tG94pT9fdKL8e4LozMA8",
  "pdfSize": "5387021"
}