{"id":"2412.11654","title":"Smoothness Really Matters: A Simple Yet Effective Approach for\n  Unsupervised Graph Domain Adaptation","authors":"Wei Chen, Guo Ye, Yakun Wang, Zhao Zhang, Libang Zhang, Daixin Wang,\n  Zhiqiang Zhang, Fuzhen Zhuang","authorsParsed":[["Chen","Wei",""],["Ye","Guo",""],["Wang","Yakun",""],["Zhang","Zhao",""],["Zhang","Libang",""],["Wang","Daixin",""],["Zhang","Zhiqiang",""],["Zhuang","Fuzhen",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 10:56:58 GMT"},{"version":"v2","created":"Thu, 19 Dec 2024 11:47:34 GMT"},{"version":"v3","created":"Thu, 16 Jan 2025 03:04:10 GMT"}],"updateDate":"2025-01-17","timestamp":1734346618000,"abstract":"  Unsupervised Graph Domain Adaptation (UGDA) seeks to bridge distribution\nshifts between domains by transferring knowledge from labeled source graphs to\ngiven unlabeled target graphs. Existing UGDA methods primarily focus on\naligning features in the latent space learned by graph neural networks (GNNs)\nacross domains, often overlooking structural shifts, resulting in limited\neffectiveness when addressing structurally complex transfer scenarios. Given\nthe sensitivity of GNNs to local structural features, even slight discrepancies\nbetween source and target graphs could lead to significant shifts in node\nembeddings, thereby reducing the effectiveness of knowledge transfer. To\naddress this issue, we introduce a novel approach for UGDA called Target-Domain\nStructural Smoothing (TDSS). TDSS is a simple and effective method designed to\nperform structural smoothing directly on the target graph, thereby mitigating\nstructural distribution shifts and ensuring the consistency of node\nrepresentations. Specifically, by integrating smoothing techniques with\nneighborhood sampling, TDSS maintains the structural coherence of the target\ngraph while mitigating the risk of over-smoothing. Our theoretical analysis\nshows that TDSS effectively reduces target risk by improving model smoothness.\nEmpirical results on three real-world datasets demonstrate that TDSS\noutperforms recent state-of-the-art baselines, achieving significant\nimprovements across six transfer scenarios. The code is available in\nhttps://github.com/cwei01/TDSS.\n","subjects":["Computer Science/Machine Learning","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"xLfImyMsmQY45WbkM3k7DS9xN8bWwmjfkcZjUp1Ifq4","pdfSize":"1529495"}