{"id":"2412.09089","title":"Probing the low-energy particle content of blazar jets through MeV\n  observations","authors":"F. Tavecchio, L. Nava, A. Sciaccaluga, P. Coppi","authorsParsed":[["Tavecchio","F.",""],["Nava","L.",""],["Sciaccaluga","A.",""],["Coppi","P.",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 09:15:58 GMT"},{"version":"v2","created":"Thu, 16 Jan 2025 12:37:35 GMT"}],"updateDate":"2025-02-05","timestamp":1733994958000,"abstract":"  Many of the blazars observed by Fermi actually have the peak of their\ntime-averaged gamma-ray emission outside the $\\sim$ GeV Fermi energy range, at\n$\\sim$ MeV energies. The detailed shape of the emission spectrum around the\n$\\sim$ MeV peak places important constraints on acceleration and radiation\nmechanisms in the blazar jet and may not be the simple broken power law\nobtained by extrapolating from the observed X-ray and GeV gamma-ray spectra. In\nparticular, state-of-the-art simulations of particle acceleration by shocks\nshow that a significant fraction (possibly up to $\\approx 90\\%$) of the\navailable energy may go into bulk, quasi-thermal heating of the plasma crossing\nthe shock rather than producing a non-thermal power law tail. Other ``gentler\"\nbut possibly more pervasive acceleration mechanisms such as shear acceleration\nat the jet boundary may result in a further build-up of the low-energy ($\\gamma\n\\lesssim 10^{2}$) electron/positron population in the jet. As already discussed\nfor the case of gamma-ray bursts, the presence of a low-energy, Maxwellian-like\n``bump'' in the jet particle energy distribution can strongly affect the\nspectrum of the emitted radiation, e.g., producing an excess over the emission\nexpected from a power-law extrapolation of a blazar's GeV-TeV spectrum. We\nexplore the potential detectability of the spectral component ascribable to a\nhot, quasi-thermal population of electrons in the high-energy emission of\nflat-spectrum radio quasars (FSRQ). We show that for typical FSRQ physical\nparameters, the expected spectral signature is located at $\\sim$ MeV energies.\nFor the brightest Fermi FSRQ sources, the presence of such a component will be\nconstrained by the upcoming MeV Compton Spectrometer and Imager (COSI)\nsatellite.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"K41MhVvIjK7cVa1-F3RUWT2rnyvDWjkVA_0DK6sSjXA","pdfSize":"409050"}