{"id":"2412.15998","title":"CNN-LSTM Hybrid Deep Learning Model for Remaining Useful Life Estimation","authors":"Muthukumar G and Jyosna Philip","authorsParsed":[["G","Muthukumar",""],["Philip","Jyosna",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 15:48:57 GMT"}],"updateDate":"2024-12-23","timestamp":1734709737000,"abstract":"  Remaining Useful Life (RUL) of a component or a system is defined as the\nlength from the current time to the end of the useful life. Accurate RUL\nestimation plays a crucial role in Predictive Maintenance applications.\nTraditional regression methods, both linear and non-linear, have struggled to\nachieve high accuracy in this domain. While Convolutional Neural Networks\n(CNNs) have shown improved accuracy, they often overlook the sequential nature\nof the data, relying instead on features derived from sliding windows. Since\nRUL prediction inherently involves multivariate time series analysis, robust\nsequence learning is essential. In this work, we propose a hybrid approach\ncombining Convolutional Neural Networks with Long Short-Term Memory (LSTM)\nnetworks for RUL estimation. Although CNN-based LSTM models have been applied\nto sequence prediction tasks in financial forecasting, this is the first\nattempt to adopt this approach for RUL estimation in prognostics. In this\napproach, CNN is first employed to efficiently extract features from the data,\nfollowed by LSTM, which uses these extracted features to predict RUL. This\nmethod effectively leverages sensor sequence information, uncovering hidden\npatterns within the data, even under multiple operating conditions and fault\nscenarios. Our results demonstrate that the hybrid CNN-LSTM model achieves the\nhighest accuracy, offering a superior score compared to the other methods.\n","subjects":["Computer Science/Machine Learning","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"unu-Kc5r2GB1_zsT9Y5XyWpBQk7VQZxV3MmB0TCoNbY","pdfSize":"969218"}