{
  "id": "2412.06338",
  "title": "Determining Absolute Neutrino Mass using Quantum Technologies",
  "authors": "A. A. S. Amad, F. F. Deppisch, M. Fleck, J. Gallop, T. Goffrey, L.\n  Hao, N. Higginbotham, S. D. Hogan, S. B. Jones, L. Li, N. McConkey, V.\n  Monachello, R. Nichol, J. A. Potter, Y. Ramachers, R. Saakyan, E.\n  Sedzielewski, D. Swinnock, D. Waters, S. Withington, S. Zhao, J. Zou",
  "authorsParsed": [
    [
      "Amad",
      "A. A. S.",
      ""
    ],
    [
      "Deppisch",
      "F. F.",
      ""
    ],
    [
      "Fleck",
      "M.",
      ""
    ],
    [
      "Gallop",
      "J.",
      ""
    ],
    [
      "Goffrey",
      "T.",
      ""
    ],
    [
      "Hao",
      "L.",
      ""
    ],
    [
      "Higginbotham",
      "N.",
      ""
    ],
    [
      "Hogan",
      "S. D.",
      ""
    ],
    [
      "Jones",
      "S. B.",
      ""
    ],
    [
      "Li",
      "L.",
      ""
    ],
    [
      "McConkey",
      "N.",
      ""
    ],
    [
      "Monachello",
      "V.",
      ""
    ],
    [
      "Nichol",
      "R.",
      ""
    ],
    [
      "Potter",
      "J. A.",
      ""
    ],
    [
      "Ramachers",
      "Y.",
      ""
    ],
    [
      "Saakyan",
      "R.",
      ""
    ],
    [
      "Sedzielewski",
      "E.",
      ""
    ],
    [
      "Swinnock",
      "D.",
      ""
    ],
    [
      "Waters",
      "D.",
      ""
    ],
    [
      "Withington",
      "S.",
      ""
    ],
    [
      "Zhao",
      "S.",
      ""
    ],
    [
      "Zou",
      "J.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 09:41:30 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733737290000,
  "abstract": "  Next generation tritium decay experiments to determine the absolute neutrino\nmass require high-precision measurements of $\\beta$-decay electron energies\nclose to the kinematic end point. To achieve this, the development of high\nphase-space density sources of atomic tritium is required, along with the\nimplementation of methods to control the motion of these atoms to allow\nextended observation times. A promising approach to efficiently and accurately\nmeasure the kinetic energies of individual $\\beta$-decay electrons generated in\nthese dilute atomic gases, is to determine the frequency of the cyclotron\nradiation they emit in a precisely characterised magnetic field. This cyclotron\nradiation emission spectroscopy (CRES) technique can benefit from recent\ndevelopments in quantum technologies. Absolute static-field magnetometry and\nelectrometry, which is essential for the precise determination of the electron\nkinetic energies from the frequency of their emitted cyclotron radiation, can\nbe performed using atoms in superpositions of circular Rydberg states.\nQuantum-limited microwave amplifiers will allow precise cyclotron frequency\nmeasurements to be made with maximal signal-to-noise ratios and minimal\nobservation times. Exploiting the opportunities offered by quantum technologies\nin these key areas, represents the core activity of the Quantum Technologies\nfor Neutrino Mass (QTNM) project. Its goal is to develop a new experimental\napparatus that can enable a determination of the absolute neutrino mass with a\nsensitivity on the order of 10~meV/$c^2$.\n",
  "subjects": [
    "Physics/High Energy Physics - Experiment",
    "Physics/Nuclear Experiment",
    "Physics/Atomic Physics",
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "nKLKhMwZLHqEIz-G7YAkvoyRVknQ87b5ItT5_Wvwbt4",
  "pdfSize": "7037283"
}