{"id":"2412.18687","title":"Self-assembling T7 phage syringes with modular genomes for targeted\n  delivery of penicillin against beta-lactam-resistant Escherichia coli","authors":"Hyunjin Shim","authorsParsed":[["Shim","Hyunjin",""]],"versions":[{"version":"v1","created":"Tue, 24 Dec 2024 21:19:11 GMT"}],"updateDate":"2024-12-30","timestamp":1735075151000,"abstract":"  Bacteriophages are promising alternative antimicrobial agents due to their\nhigh specificity for host bacteria and minimal immunogenicity in humans.\nHowever, their therapeutic application is limited by their nature as biological\nentities, which can lead to unintended evolutionary consequences such as\nhorizontal gene transfer. In this study, we address these challenges by\nrepurposing only the structural components of bacteriophages as vesicles to\ndeliver antibiotics directly into the cytoplasm of bacterial hosts. This\napproach is based on two key hypotheses: first, antibiotics such as\nbeta-lactams remain effective against resistant bacteria if injected directly\ninto the cytoplasm, bypassing resistance mechanisms; second, phage structures\ncan be synthesized and self-assembled in vitro using modular genomes and\ncell-free protein expression systems to carry small molecules such as\nantibiotics as cargo. To test these hypotheses, we utilized T7 phages and\npenicillin-resistant Escherichia coli as a model system. First, we designed the\nT7 phage genome into a modular format containing only the genes encoding\nstructural components and synthesized the gene fragments via de novo gene\nsynthesis. These phage structures were then rebooted in vitro using a cell-free\nprotein expression system in the presence of penicillin G, allowing the\nantibiotics to be incorporated as cargo during the self-assembly process.\nFinally, we tested the antimicrobial activity of these antibiotic-loaded phage\nsyringes against penicillin-resistant E. coli. The results demonstrate that\nphage syringes effectively reduce the population of penicillin-resistant E.\ncoli compared to negative controls, including free penicillin and water. This\nstudy highlights the potential of using phage structures as antibiotic delivery\nvehicles, offering a novel strategy to overcome both antibiotic resistance and\nthe limitations of phage therapy.\n","subjects":["Quantitative Biology/Quantitative Methods"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"7wvFy9ZzUErp7IdVRa-MzIngk-bzH_eEezdC6lZUBv4","pdfSize":"2715852"}