{
  "id": "2412.03550",
  "title": "Teaching an Old Dog New Tricks: Verifiable FHE Using Commodity Hardware",
  "authors": "Jules Drean, Fisher Jepsen, Edward Suh, Srini Devadas, Aamer Jaleel,\n  Gururaj Saileshwar",
  "authorsParsed": [
    [
      "Drean",
      "Jules",
      ""
    ],
    [
      "Jepsen",
      "Fisher",
      ""
    ],
    [
      "Suh",
      "Edward",
      ""
    ],
    [
      "Devadas",
      "Srini",
      ""
    ],
    [
      "Jaleel",
      "Aamer",
      ""
    ],
    [
      "Saileshwar",
      "Gururaj",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 18:47:11 GMT"
    }
  ],
  "updateDate": "2024-12-05",
  "timestamp": 1733338031000,
  "abstract": "  We present Argos, a simple approach for adding verifiability to fully\nhomomorphic encryption (FHE) schemes using trusted hardware. Traditional\napproaches to verifiable FHE require expensive cryptographic proofs, which\nincur an overhead of up to seven orders of magnitude on top of FHE, making them\nimpractical.\n  With Argos, we show that trusted hardware can be securely used to provide\nverifiability for FHE computations, with minimal overhead relative to the\nbaseline FHE computation. An important contribution of Argos is showing that\nthe major security pitfall associated with trusted hardware, microarchitectural\nside channels, can be completely mitigated by excluding any secrets from the\nCPU and the memory hierarchy. This is made possible by focusing on building a\nplatform that only enforces program and data integrity and not confidentiality\n(which is sufficient for verifiable FHE, since all data remain encrypted at all\ntimes). All secrets related to the attestation mechanism are kept in a separate\ncoprocessor (e.g., a TPM) inaccessible to any software-based attacker. Relying\non a discrete TPM typically incurs significant performance overhead, which is\nwhy (insecure) software-based TPMs are used in practice. As a second\ncontribution, we show that for FHE applications, the attestation protocol can\nbe adapted to only incur a fixed cost.\n  Argos requires no dedicated hardware extensions and is supported on commodity\nprocessors from 2008 onward. Our prototype implementation introduces 6%\noverhead to the FHE evaluation, and 8% for more complex protocols. In\nparticular, we show that Argos can be adapted for real-world applications of\nFHE, such as PIR and PSI. By demonstrating how to combine cryptography with\ntrusted hardware, Argos paves the way for widespread deployment of FHE-based\nprotocols beyond the semi-honest setting, without the overhead of cryptographic\nproofs.\n",
  "subjects": [
    "Computer Science/Cryptography and Security"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "OkycvM_-iW32-rR8_veLvlzxfcDdrjY1CByyhCN6ILA",
  "pdfSize": "15592012"
}