{
  "id": "2412.11908",
  "title": "Can Language Models Rival Mathematics Students? Evaluating Mathematical\n  Reasoning through Textual Manipulation and Human Experiments",
  "authors": "Andrii Nikolaiev, Yiannos Stathopoulos, Simone Teufel",
  "authorsParsed": [
    [
      "Nikolaiev",
      "Andrii",
      ""
    ],
    [
      "Stathopoulos",
      "Yiannos",
      ""
    ],
    [
      "Teufel",
      "Simone",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 15:54:06 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734364446000,
  "abstract": "  In this paper we look at the ability of recent large language models (LLMs)\nat solving mathematical problems in combinatorics. We compare models LLaMA-2,\nLLaMA-3.1, GPT-4, and Mixtral against each other and against human pupils and\nundergraduates with prior experience in mathematical olympiads. To facilitate\nthese comparisons we introduce the Combi-Puzzles dataset, which contains 125\nproblem variants based on 25 combinatorial reasoning problems. Each problem is\npresented in one of five distinct forms, created by systematically manipulating\nthe problem statements through adversarial additions, numeric parameter\nchanges, and linguistic obfuscation. Our variations preserve the mathematical\ncore and are designed to measure the generalisability of LLM problem-solving\nabilities, while also increasing confidence that problems are submitted to LLMs\nin forms that have not been seen as training instances. We found that a model\nbased on GPT-4 outperformed all other models in producing correct responses,\nand performed significantly better in the mathematical variation of the\nproblems than humans. We also found that modifications to problem statements\nsignificantly impact the LLM's performance, while human performance remains\nunaffected.\n",
  "subjects": [
    "Computer Science/Computation and Language"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "R5pboaNnVK9I53miBvw2AtbzFz5kXTC40OJzaHfZQa4",
  "pdfSize": "346082"
}