{"id":"2412.16684","title":"MATES: Multi-view Aggregated Two-Sample Test","authors":"Zexi Cai, Wenbo Fei, Doudou Zhou","authorsParsed":[["Cai","Zexi",""],["Fei","Wenbo",""],["Zhou","Doudou",""]],"versions":[{"version":"v1","created":"Sat, 21 Dec 2024 16:19:06 GMT"}],"updateDate":"2024-12-24","timestamp":1734797946000,"abstract":"  The two-sample test is a fundamental problem in statistics with a wide range\nof applications. In the realm of high-dimensional data, nonparametric methods\nhave gained prominence due to their flexibility and minimal distributional\nassumptions. However, many existing methods tend to be more effective when the\ntwo distributions differ primarily in their first and/or second moments. In\nmany real-world scenarios, distributional differences may arise in higher-order\nmoments, rendering traditional methods less powerful. To address this\nlimitation, we propose a novel framework to aggregate information from multiple\nmoments to build a test statistic. Each moment is regarded as one view of the\ndata and contributes to the detection of some specific type of discrepancy,\nthus allowing the test statistic to capture more complex distributional\ndifferences. The novel multi-view aggregated two-sample test (MATES) leverages\na graph-based approach, where the test statistic is constructed from the\nweighted similarity graphs of the pooled sample. Under mild conditions on the\nmulti-view weighted similarity graphs, we establish theoretical properties of\nMATES, including a distribution-free limiting distribution under the null\nhypothesis, which enables straightforward type-I error control. Extensive\nsimulation studies demonstrate that MATES effectively distinguishes subtle\ndifferences between distributions. We further validate the method on the S&P100\ndata, showcasing its power in detecting complex distributional variations.\n","subjects":["Statistics/Methodology","Mathematics/Statistics Theory","Statistics/Statistics Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ZDs1G9702GMPOT9JV1btQjazukoacclnvYLOMZ0cnd0","pdfSize":"551114"}