{"id":"2412.12086","title":"Black Hole Merger Rates in AGN: contribution from gas-captured binaries","authors":"Connar Rowan, Henry Whitehead, Bence Kocsis","authorsParsed":[["Rowan","Connar",""],["Whitehead","Henry",""],["Kocsis","Bence",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 18:55:51 GMT"},{"version":"v2","created":"Tue, 17 Dec 2024 11:46:36 GMT"}],"updateDate":"2024-12-18","timestamp":1734375351000,"abstract":"  It has been suggested that merging black hole (BH) binaries in active\ngalactic nucleus (AGN) discs formed through two-body scatterings via the\ngas-capture process may explain a significant fraction of BH mergers in AGN and\na non-negligible contribution to the observed rate from LIGO-VIRGO-KAGRA. We\nperform Monte Carlo simulations of BH and binary BH formation, evolution and\nmergers across the observed AGN mass function using a novel physically\nmotivated treatment for the gas-capture process derived from hydrodynamical\nsimulations of BH-BH encounters in AGN and varying assumptions on the AGN disc\nphysics. The results suggest that gas-captured binaries could result in merger\nrates of 0.73 - 7.1Gpc$^{-3}$yr$^{-1}$. Most mergers take place near the outer\nboundary of the accretion disk, but this may be subject to change when\nmigration is considered. The BH merger rate in the AGN channel in the Universe\nis dominated by AGN with supermassive BH masses on the order of 10$^{7}\nM_\\odot$ , with 90% of mergers occurring in the range 10$^{6} M_\\odot$ -\n10$^{8} M_\\odot$ . The merging mass distribution is flatter than the initial BH\nmass power law by a factor $\\Delta \\xi$ = 1.1 to 1.2, as larger BHs can align\nwith the disc and successfully form binaries more efficiently. Similarly, the\nmerging mass ratio distribution is flatter, therefore the AGN channel could\neasily explain the high mass and unequal mass ratio detections such as GW190521\nand GW190814. When modelling the BH binary formation process using a simpler\ndynamical friction treatment, we observe very similar results, where the\nprimary bottleneck is the alignment time with the disk. We find the most\ninfluential parameters on the rates are the anticipated number of BHs and their\nmass function. We conclude that AGN remain an important channel for\nconsideration, particularly for gravitational wave detections involving one or\ntwo high mass BHs.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"4YO7LIy9grIaVVNmzZ0xNp9L13g-NAVEQUBpsreyAkU","pdfSize":"780900"}