{
  "id": "2412.11692",
  "title": "A partial likelihood approach to tree-based density modeling and its\n  application in Bayesian inference",
  "authors": "Li Ma, Benedetta Bruni",
  "authorsParsed": [
    [
      "Ma",
      "Li",
      ""
    ],
    [
      "Bruni",
      "Benedetta",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 12:10:23 GMT"
    },
    {
      "version": "v2",
      "created": "Mon, 23 Dec 2024 18:46:34 GMT"
    },
    {
      "version": "v3",
      "created": "Tue, 25 Feb 2025 17:32:08 GMT"
    }
  ],
  "updateDate": "2025-02-26",
  "timestamp": 1734351023000,
  "abstract": "  Tree-based priors for probability distributions are usually specified using a\npredetermined, data-independent collection of candidate recursive partitions of\nthe sample space. To characterize an unknown target density in detail over the\nentire sample space, candidate partitions must have the capacity to expand\ndeeply into all areas of the sample space with potential non-zero sampling\nprobability. Such an expansive system of partitions often incurs prohibitive\ncomputational costs and makes inference prone to overfitting, especially in\nregions with little probability mass. Thus, existing models typically make a\ncompromise and rely on relatively shallow trees. This hampers one of the most\ndesirable features of trees, their ability to characterize local features, and\nresults in reduced statistical efficiency. Traditional wisdom suggests that\nthis compromise is inevitable to ensure coherent likelihood-based reasoning in\nBayesian inference, as a data-dependent partition system that allows deeper\nexpansion only in regions with more observations would induce double dipping of\nthe data. We propose a simple strategy to restore coherency while allowing the\ncandidate partitions to be data-dependent, using Cox's partial likelihood. Our\npartial likelihood approach is broadly applicable to existing likelihood-based\nmethods and, in particular, to Bayesian inference on tree-based models. We give\nexamples in density estimation in which the partial likelihood is endowed with\nexisting priors on tree-based models and compare with the standard,\nfull-likelihood approach. The results show substantial gains in estimation\naccuracy and computational efficiency from adopting the partial likelihood.\n",
  "subjects": [
    "Statistics/Methodology",
    "Mathematics/Statistics Theory",
    "Statistics/Computation",
    "Statistics/Machine Learning",
    "Statistics/Statistics Theory"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "f_1DTKJLLv_D6zUIy0xPpCIsgehfE9NGTesIT49kzow",
  "pdfSize": "2781632"
}