{
  "id": "2412.09789",
  "title": "SILA: Signal-to-Language Augmentation for Enhanced Control in\n  Text-to-Audio Generation",
  "authors": "Sonal Kumar, Prem Seetharaman, Justin Salamon, Dinesh Manocha, Oriol\n  Nieto",
  "authorsParsed": [
    [
      "Kumar",
      "Sonal",
      ""
    ],
    [
      "Seetharaman",
      "Prem",
      ""
    ],
    [
      "Salamon",
      "Justin",
      ""
    ],
    [
      "Manocha",
      "Dinesh",
      ""
    ],
    [
      "Nieto",
      "Oriol",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 02:07:21 GMT"
    }
  ],
  "updateDate": "2024-12-16",
  "timestamp": 1734055641000,
  "abstract": "  The field of text-to-audio generation has seen significant advancements, and\nyet the ability to finely control the acoustic characteristics of generated\naudio remains under-explored. In this paper, we introduce a novel yet simple\napproach to generate sound effects with control over key acoustic parameters\nsuch as loudness, pitch, reverb, fade, brightness, noise and duration, enabling\ncreative applications in sound design and content creation. These parameters\nextend beyond traditional Digital Signal Processing (DSP) techniques,\nincorporating learned representations that capture the subtleties of how sound\ncharacteristics can be shaped in context, enabling a richer and more nuanced\ncontrol over the generated audio. Our approach is model-agnostic and is based\non learning the disentanglement between audio semantics and its acoustic\nfeatures. Our approach not only enhances the versatility and expressiveness of\ntext-to-audio generation but also opens new avenues for creative audio\nproduction and sound design. Our objective and subjective evaluation results\ndemonstrate the effectiveness of our approach in producing high-quality,\ncustomizable audio outputs that align closely with user specifications.\n",
  "subjects": [
    "Computer Science/Sound",
    "Electrical Engineering and Systems Science/Audio and Speech Processing"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "QYSBnX1_FnJoOzyjCByjBTCrLOo8Xmo0CSmsEpi8IO4",
  "pdfSize": "720263"
}