{
  "id": "2412.09335",
  "title": "Does Low Spoilage Under Cold Conditions Foster Cultural Complexity\n  During the Foraging Era? -- A Theoretical and Computational Inquiry",
  "authors": "Minhyeok Lee",
  "authorsParsed": [
    [
      "Lee",
      "Minhyeok",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 15:03:08 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1734015788000,
  "abstract": "  Human cultural complexity did not arise in a vacuum. Scholars in the\nhumanities and social sciences have long debated how ecological factors, such\nas climate and resource availability, enabled early hunter-gatherers to\nallocate time and energy beyond basic subsistence tasks. This paper presents a\nformal, interdisciplinary approach that integrates theoretical modeling with\ncomputational methods to examine whether conditions that allow lower spoilage\nof stored food, often associated with colder climates and abundant large fauna,\ncould indirectly foster the emergence of cultural complexity. Our contribution\nis twofold. First, we propose a mathematical framework that relates spoilage\nrates, yield levels, resource management skills, and cultural activities. Under\nthis framework, we prove that lower spoilage and adequate yields reduce the\nfrequency of hunting, thus freeing substantial time for cultural pursuits.\nSecond, we implement a reinforcement learning simulation, inspired by\nengineering optimization techniques, to validate the theoretical predictions.\nBy training agents in different $(Y,p)$ environments, where $Y$ is yield and\n$p$ is the probability of daily spoilage, we observe patterns consistent with\nthe theoretical model: stable conditions with lower spoilage strongly correlate\nwith increased cultural complexity. While we do not claim to replicate\nprehistoric social realities directly, our results suggest that ecologically\nstable niches provided a milieu in which cultural forms could germinate and\nevolve. This study, therefore, offers an integrative perspective that unites\nhumanistic inquiries into the origins of culture with the formal rigor and\nexploratory power of computational modeling.\n",
  "subjects": [
    "Computer Science/Computers and Society",
    "Computer Science/Artificial Intelligence",
    "Economics/General Economics",
    "Quantitative Finance/Economics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "IgPnTye26TXTQNkz6N6tKZavGAxIL71LSc7iqfBth_k",
  "pdfSize": "2401667"
}