{
  "id": "2412.13389",
  "title": "Marigold-DC: Zero-Shot Monocular Depth Completion with Guided Diffusion",
  "authors": "Massimiliano Viola, Kevin Qu, Nando Metzger, Bingxin Ke, Alexander\n  Becker, Konrad Schindler, Anton Obukhov",
  "authorsParsed": [
    [
      "Viola",
      "Massimiliano",
      ""
    ],
    [
      "Qu",
      "Kevin",
      ""
    ],
    [
      "Metzger",
      "Nando",
      ""
    ],
    [
      "Ke",
      "Bingxin",
      ""
    ],
    [
      "Becker",
      "Alexander",
      ""
    ],
    [
      "Schindler",
      "Konrad",
      ""
    ],
    [
      "Obukhov",
      "Anton",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 00:06:41 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734480401000,
  "abstract": "  Depth completion upgrades sparse depth measurements into dense depth maps\nguided by a conventional image. Existing methods for this highly ill-posed task\noperate in tightly constrained settings and tend to struggle when applied to\nimages outside the training domain or when the available depth measurements are\nsparse, irregularly distributed, or of varying density. Inspired by recent\nadvances in monocular depth estimation, we reframe depth completion as an\nimage-conditional depth map generation guided by sparse measurements. Our\nmethod, Marigold-DC, builds on a pretrained latent diffusion model for\nmonocular depth estimation and injects the depth observations as test-time\nguidance via an optimization scheme that runs in tandem with the iterative\ninference of denoising diffusion. The method exhibits excellent zero-shot\ngeneralization across a diverse range of environments and handles even\nextremely sparse guidance effectively. Our results suggest that contemporary\nmonocular depth priors greatly robustify depth completion: it may be better to\nview the task as recovering dense depth from (dense) image pixels, guided by\nsparse depth; rather than as inpainting (sparse) depth, guided by an image.\nProject website: https://MarigoldDepthCompletion.github.io/\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "2EyUFZjI7PisWraYwmKxaVGKN-OPrToOO3A2hrvoajA",
  "pdfSize": "5767987"
}