{
  "id": "2412.06650",
  "title": "Magnetic Switching in Monolayer 2D Diluted Magnetic Semiconductors via\n  Spin-to- Spin Conversion",
  "authors": "Siwei Chen, Zitao Tang, Mengqi Fang, Rui Sun, Xiaotong Zhang, Licheng\n  Xiao, Seyed Sepehr Mohajerani, Na Liu, Yuze Zhang, Abdus Salam Sarkar, Dali\n  Sun, Stefan Strauf, and Eui- Hyeok Yang",
  "authorsParsed": [
    [
      "Chen",
      "Siwei",
      ""
    ],
    [
      "Tang",
      "Zitao",
      ""
    ],
    [
      "Fang",
      "Mengqi",
      ""
    ],
    [
      "Sun",
      "Rui",
      ""
    ],
    [
      "Zhang",
      "Xiaotong",
      ""
    ],
    [
      "Xiao",
      "Licheng",
      ""
    ],
    [
      "Mohajerani",
      "Seyed Sepehr",
      ""
    ],
    [
      "Liu",
      "Na",
      ""
    ],
    [
      "Zhang",
      "Yuze",
      ""
    ],
    [
      "Sarkar",
      "Abdus Salam",
      ""
    ],
    [
      "Sun",
      "Dali",
      ""
    ],
    [
      "Strauf",
      "Stefan",
      ""
    ],
    [
      "Yang",
      "Eui- Hyeok",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 16:44:01 GMT"
    }
  ],
  "updateDate": "2025-02-14",
  "timestamp": 1733762641000,
  "abstract": "  The integration of two-dimensional (2D) van der Waals (vdW) magnets with\ntopological insulators or heavy metals holds great potential for realizing\nnext-generation spintronic memory devices. However, achieving high-efficiency\nSOT switching of monolayer vdW magnets at room temperature poses a significant\nchallenge, particularly without an external magnetic field. Here, we show\nfield-free, deterministic, and nonvolatile SOT switching of perpendicular\nmagnetization in the monolayer, diluted magnetic semiconductor (DMS), Fe-doped\nMoS2(Fe:MoS2) at up to 380 K with a current density of $7\\times10^4 A cm^{-2}$.\nThe in situ doping of Fe into monolayer MoS2 via chemical vapor deposition and\nthe geometry-induced strain in the crystal break the rotational switching\nsymmetry in Fe:MoS2, promoting field-free SOT switching by generating\nout-of-plane spins via spin-to-spin conversion. An apparent anomalous Hall\neffect (AHE) loop shift at a zero in-plane magnetic field verifies the\nexistence of z spins in Fe:MoS2, inducing an antidamping-like torque that\nfacilitates field-free SOT switching. A strong topological Hall effect (THE)\nwas also observed, attributed to the interfacial Dzyaloshinskii-Moriya\ninteraction (DMI), reducing the energy barrier for SOT switching. This\nfield-free SOT application using a 2D ferromagnetic monolayer provides a new\npathway for developing highly power-efficient spintronic memory devices.\n",
  "subjects": [
    "Condensed Matter/Mesoscale and Nanoscale Physics",
    "Condensed Matter/Materials Science"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "xV7iJqYGxU0aDT1rBj7VLHZPP_PRfwKBD_ztfpHUTgQ",
  "pdfSize": "8451536"
}