{
  "id": "2412.02810",
  "title": "Universal Rates of Empirical Risk Minimization",
  "authors": "Steve Hanneke and Mingyue Xu",
  "authorsParsed": [
    [
      "Hanneke",
      "Steve",
      ""
    ],
    [
      "Xu",
      "Mingyue",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 20:20:39 GMT"
    },
    {
      "version": "v2",
      "created": "Thu, 30 Jan 2025 15:36:39 GMT"
    }
  ],
  "updateDate": "2025-01-31",
  "timestamp": 1733257239000,
  "abstract": "  The well-known empirical risk minimization (ERM) principle is the basis of\nmany widely used machine learning algorithms, and plays an essential role in\nthe classical PAC theory. A common description of a learning algorithm's\nperformance is its so-called \"learning curve\", that is, the decay of the\nexpected error as a function of the input sample size. As the PAC model fails\nto explain the behavior of learning curves, recent research has explored an\nalternative universal learning model and has ultimately revealed a distinction\nbetween optimal universal and uniform learning rates (Bousquet et al., 2021).\nHowever, a basic understanding of such differences with a particular focus on\nthe ERM principle has yet to be developed.\n  In this paper, we consider the problem of universal learning by ERM in the\nrealizable case and study the possible universal rates. Our main result is a\nfundamental tetrachotomy: there are only four possible universal learning rates\nby ERM, namely, the learning curves of any concept class learnable by ERM decay\neither at $e^{-n}$, $1/n$, $\\log(n)/n$, or arbitrarily slow rates. Moreover, we\nprovide a complete characterization of which concept classes fall into each of\nthese categories, via new complexity structures. We also develop new\ncombinatorial dimensions which supply sharp asymptotically-valid constant\nfactors for these rates, whenever possible.\n",
  "subjects": [
    "Statistics/Machine Learning",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "7a2tn9icsV1PMs9Ke3iZlmjj7l2R4Z14RXHwOET3P4M",
  "pdfSize": "713257"
}