{"id":"2412.08463","title":"IRL for Restless Multi-Armed Bandits with Applications in Maternal and\n  Child Health","authors":"Gauri Jain, Pradeep Varakantham, Haifeng Xu, Aparna Taneja, Prashant\n  Doshi, Milind Tambe","authorsParsed":[["Jain","Gauri",""],["Varakantham","Pradeep",""],["Xu","Haifeng",""],["Taneja","Aparna",""],["Doshi","Prashant",""],["Tambe","Milind",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 15:28:04 GMT"}],"updateDate":"2024-12-12","timestamp":1733930884000,"abstract":"  Public health practitioners often have the goal of monitoring patients and\nmaximizing patients' time spent in \"favorable\" or healthy states while being\nconstrained to using limited resources. Restless multi-armed bandits (RMAB) are\nan effective model to solve this problem as they are helpful to allocate\nlimited resources among many agents under resource constraints, where patients\nbehave differently depending on whether they are intervened on or not. However,\nRMABs assume the reward function is known. This is unrealistic in many public\nhealth settings because patients face unique challenges and it is impossible\nfor a human to know who is most deserving of any intervention at such a large\nscale. To address this shortcoming, this paper is the first to present the use\nof inverse reinforcement learning (IRL) to learn desired rewards for RMABs, and\nwe demonstrate improved outcomes in a maternal and child health telehealth\nprogram. First we allow public health experts to specify their goals at an\naggregate or population level and propose an algorithm to design expert\ntrajectories at scale based on those goals. Second, our algorithm WHIRL uses\ngradient updates to optimize the objective, allowing for efficient and accurate\nlearning of RMAB rewards. Third, we compare with existing baselines and\noutperform those in terms of run-time and accuracy. Finally, we evaluate and\nshow the usefulness of WHIRL on thousands on beneficiaries from a real-world\nmaternal and child health setting in India. We publicly release our code here:\nhttps://github.com/Gjain234/WHIRL.\n","subjects":["Computer Science/Machine Learning","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"wENveNgKxttZ_QCEs-q3m1CRyygdRUr0pBaGeroBAX0","pdfSize":"1343260"}