{
  "id": "2412.18031",
  "title": "Faces speak louder than words: Emotions versus textual sentiment in the\n  2024 USA Presidential Election",
  "authors": "Chiyu Wei, Sean Noh, Ho-Chun Herbert Chang",
  "authorsParsed": [
    [
      "Wei",
      "Chiyu",
      ""
    ],
    [
      "Noh",
      "Sean",
      ""
    ],
    [
      "Chang",
      "Ho-Chun Herbert",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 22:51:21 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1734994281000,
  "abstract": "  Sentiment analysis of textual content has become a well-established solution\nfor analyzing social media data. However, with the rise of images and videos as\nprimary modes of expression, more information on social media is conveyed\nvisually. Among these, facial expressions serve as one of the most direct\nindicators of emotional content in images. This study analyzes a dataset of\nInstagram posts related to the 2024 U.S. presidential election, spanning April\n5, 2024, to August 9, 2024, to compare the relationship between textual and\nfacial sentiment. Our findings reveal that facial expressions generally align\nwith text sentiment, although neutral and negative facial expressions provide\ncritical information beyond valence. Furthermore, during politically\nsignificant events such as Donald Trump's conviction and assassination attempt,\nposts depicting Trump showed a 12% increase in negative sentiment. Crucially,\nDemocrats use their opponent's fear to depict weakness whereas Republicans use\ntheir candidate's anger to depict resilience. Our research highlights the\npotential of integrating facial expression analysis with textual sentiment\nanalysis to uncover deeper insights into social media dynamics.\n",
  "subjects": [
    "Computer Science/Social and Information Networks"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "v5j60kZt7W25nT4ttBl9dOVQkuMQ3Bw2NdJf4OxPIow",
  "pdfSize": "851133"
}