{
  "id": "2412.19983",
  "title": "A Dynamic Spillover Effect Investigation on Cryptocurrency Market Before\n  and After Pandemic",
  "authors": "Wenjie Lan",
  "authorsParsed": [
    [
      "Lan",
      "Wenjie",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 28 Dec 2024 02:53:29 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735354409000,
  "abstract": "  This paper distinguishes between risk resonance and risk diversification\nrelationships in the cryptocurrency market based on the newly developed\nasymmetric breakpoint approach, and analyzes the risk propagation mechanism\namong cryptocurrencies under extreme events. In addition, through the lens of\nnode association and network structure, this paper explores the dynamic\nevolutionary relationship of cryptocurrency risk association before and after\nthe epidemic. In addition, the driving mechanism of the cryptocurrency risk\nmovement is analyzed in a depth with the epidemic indicators. The findings show\nthat the effect of propagation of risk among cryptocurrencies becomes more\nsignificant under the influence of the new crown outbreak. At the same time,\nthe increase in the number of confirmed cases exacerbated the risk spillover\neffect among cryptocurrencies, while the risk resonance effect that exists\nbetween the crude oil market and the cryptocurrency market amplified the extent\nof the outbreak's impact on cryptocurrencies. However, other financial markets\nare relatively independent of the cryptocurrency market. This study proposes a\nstrategy to deal with the spread of cryptocurrency risks from the perspective\nof a public health crisis, providing a useful reference basis for improving the\nregulatory mechanism of cryptocurrencies.\n",
  "subjects": [
    "Quantitative Finance/Risk Management",
    "Statistics/Applications"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "9MWU6FxWlxEGV5sdG3zBWPSy5HlOBMa24tol-vBoUqs",
  "pdfSize": "1610464"
}