{"id":"2412.03678","title":"Robust Control Barrier Function Design for High Relative Degree Systems:\n  Application to Unknown Moving Obstacle Collision Avoidance","authors":"Kwang Hak Kim, Mamadou Diagne, Miroslav Krsti\\'c","authorsParsed":[["Kim","Kwang Hak",""],["Diagne","Mamadou",""],["Krstić","Miroslav",""]],"versions":[{"version":"v1","created":"Wed, 4 Dec 2024 19:19:04 GMT"}],"updateDate":"2024-12-06","timestamp":1733339944000,"abstract":"  In safety-critical control, managing safety constraints with high relative\ndegrees and uncertain obstacle dynamics pose significant challenges in\nguaranteeing safety performance. Robust Control Barrier Functions (RCBFs) offer\na potential solution, but the non-smoothness of the standard RCBF definition\ncan pose a challenge when dealing with multiple derivatives in high relative\ndegree problems. As a result, the definition was extended to the marginally\nmore conservative smooth Robust Control Barrier Functions (sRCBF). Then, by\nextending the sRCBF framework to the CBF backstepping method, this paper offers\na novel approach to these problems. Treating obstacle dynamics as disturbances,\nour approach reduces the requirement for precise state estimations of the\nobstacle to an upper bound on the disturbance, which simplifies implementation\nand enhances the robustness and applicability of CBFs in dynamic and uncertain\nenvironments. Then, we validate our technique through an example problem in\nwhich an agent, modeled using a kinematic unicycle model, aims to avoid an\nunknown moving obstacle. The demonstration shows that the standard CBF\nbackstepping method is not sufficient in the presence of a moving obstacle,\nespecially with unknown dynamics. In contrast, the proposed method successfully\nprevents the agent from colliding with the obstacle, proving its effectiveness.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ncMIdVRD2Zo4jnTHaophxco76E49ysdwfj9YxOiS5Lw","pdfSize":"478496"}