{
  "id": "2412.00338",
  "title": "Is p-type doping in TeO2 feasible?",
  "authors": "Zewen Xiao, Chen Qiu, Su-Huai Wei, and Hideo Hosono",
  "authorsParsed": [
    [
      "Xiao",
      "Zewen",
      ""
    ],
    [
      "Qiu",
      "Chen",
      ""
    ],
    [
      "Wei",
      "Su-Huai",
      ""
    ],
    [
      "Hosono",
      "Hideo",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 30 Nov 2024 03:39:54 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1732937994000,
  "abstract": "  Wide-bandgap two-dimensional (2D) beta-TeO2 has been reported as a\nhigh-mobility p-type transparent semiconductor (Nat. Electron. 2021, 4,\n277-283), attracting significant attention. This \"breakthrough\" not only\nchallenges the conventional characterization of TeO2 as an insulator but also\nconflicts with the anticipated difficulty in hole doping of TeO2 by established\nchemical trends. Notably, the reported Fermi level of 0.9 eV above the valence\nband maximum (VBM) actually suggests that the material is an insulator,\ncontradicting the high hole density obtained by Hall effect measurement.\nFurthermore, the detected residual Se and the possible reduced elemental Te in\nthe 2D beta-TeO2 samples introduces complexity, considering that elemental Se,\nTe, and Te1-xSex themselves are high-mobility p-type semiconductor. Therefore,\ndoubts regarding the true cause of the p-type conductivity observed in the 2D\nbeta-TeO2 samples arise. In this work, we employ density functional theory\ncalculations to illustrate that TeO2, whether in its bulk forms of alpha-,\nbeta-, or gamma-TeO2, or in 2D beta-TeO2, inherently exhibits insulating\nproperties and poses challenges in carrier doping due to its shallow conduction\nband minimum and deep valence band maximum (VBM). Our findings shed light on\nthe insulating electrical properties and doping difficulty of TeO2, contrasting\nwith the claimed p-type conductivity in the 2D beta-TeO2 samples, prompting\ninquiries into the true origin of the p-type conductivity.\n",
  "subjects": [
    "Condensed Matter/Materials Science"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "O6LLt-I4vaOZEJQc8xY6WuE74-eoBCMO61w-PgJ0yEg",
  "pdfSize": "1508144"
}