{
  "id": "2412.19470",
  "title": "Movable Antenna-Aided Near-Field Integrated Sensing and Communication",
  "authors": "Jingze Ding, Zijian Zhou, Xiaodan Shao, Bingli Jiao, Rui Zhang",
  "authorsParsed": [
    [
      "Ding",
      "Jingze",
      ""
    ],
    [
      "Zhou",
      "Zijian",
      ""
    ],
    [
      "Shao",
      "Xiaodan",
      ""
    ],
    [
      "Jiao",
      "Bingli",
      ""
    ],
    [
      "Zhang",
      "Rui",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 27 Dec 2024 05:45:35 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735278335000,
  "abstract": "  Integrated sensing and communication (ISAC) is emerging as a pivotal\ntechnology for next-generation wireless networks. However, existing ISAC\nsystems are based on fixed-position antennas (FPAs), which inevitably incur a\nloss in performance when balancing the trade-off between sensing and\ncommunication. Movable antenna (MA) technology offers promising potential to\nenhance ISAC performance by enabling flexible antenna movement. Nevertheless,\nexploiting more spatial channel variations requires larger antenna moving\nregions, which may invalidate the conventional far-field assumption for\nchannels between transceivers. Therefore, this paper utilizes the MA to enhance\nsensing and communication capabilities in near-field ISAC systems, where a\nfull-duplex base station (BS) is equipped with multiple transmit and receive\nMAs movable in large-size regions to simultaneously sense multiple targets and\nserve multiple uplink (UL) and downlink (DL) users for communication. We aim to\nmaximize the weighted sum of sensing and communication rates (WSR) by jointly\ndesigning the transmit beamformers, sensing signal covariance matrices, receive\nbeamformers, and MA positions at the BS, as well as the UL power allocation.\nThe resulting optimization problem is challenging to solve, while we propose an\nefficient two-layer random position (RP) algorithm to tackle it. In addition,\nto reduce movement delay and cost, we design an antenna position matching (APM)\nalgorithm based on the greedy strategy to minimize the total MA movement\ndistance. Extensive simulation results demonstrate the substantial performance\nimprovement achieved by deploying MAs in near-field ISAC systems. Moreover, the\nresults show the effectiveness of the proposed APM algorithm in reducing the\nantenna movement distance, which is helpful for energy saving and time overhead\nreduction for MA-aided near-field ISAC systems with large moving regions.\n",
  "subjects": [
    "Computer Science/Information Theory",
    "Electrical Engineering and Systems Science/Signal Processing",
    "Mathematics/Information Theory"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "v6LdfkA6kUhHFCm--o01umHNzBc1VL15_WhxidECvvI",
  "pdfSize": "4622360"
}