{
  "id": "2412.03822",
  "title": "Beyond the Binary: Capturing Diverse Preferences With Reward\n  Regularization",
  "authors": "Vishakh Padmakumar, Chuanyang Jin, Hannah Rose Kirk, He He",
  "authorsParsed": [
    [
      "Padmakumar",
      "Vishakh",
      ""
    ],
    [
      "Jin",
      "Chuanyang",
      ""
    ],
    [
      "Kirk",
      "Hannah Rose",
      ""
    ],
    [
      "He",
      "He",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 02:35:46 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733366146000,
  "abstract": "  Large language models (LLMs) are increasingly deployed via public-facing\ninterfaces to interact with millions of users, each with diverse preferences.\nDespite this, preference tuning of LLMs predominantly relies on reward models\ntrained using binary judgments where annotators select the preferred choice out\nof pairs of model outputs. In this work, we argue that this reliance on binary\nchoices does not capture the broader, aggregate preferences of the target user\nin real-world tasks. We propose a taxonomy that identifies two dimensions of\nsubjectivity where different users disagree on the preferred output-namely, the\nPlurality of Responses to Prompts, where prompts allow for multiple correct\nanswers, and the Indistinguishability of Responses, where candidate outputs are\nparaphrases of each other. We show that reward models correlate weakly with\nuser preferences in these cases. As a first step to address this issue, we\nintroduce a simple yet effective method that augments existing binary\npreference datasets with synthetic preference judgments to estimate potential\nuser disagreement. Incorporating these via a margin term as a form of\nregularization during model training yields predictions that better align with\nthe aggregate user preferences.\n",
  "subjects": [
    "Computer Science/Computation and Language",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Sm_fYqJ04UDkoxDgSqY6IC1FeVG7ILIA2stbjq-yRnc",
  "pdfSize": "345453"
}