{"id":"2412.17833","title":"Transfer Learning with Active Sampling for Rapid Training and\n  Calibration in BCI-P300 Across Health States and Multi-centre Data","authors":"Christian Flores, Marcelo Contreras, Ichiro Macedo, Javier\n  Andreu-Perez","authorsParsed":[["Flores","Christian",""],["Contreras","Marcelo",""],["Macedo","Ichiro",""],["Andreu-Perez","Javier",""]],"versions":[{"version":"v1","created":"Sat, 14 Dec 2024 14:20:21 GMT"}],"updateDate":"2024-12-25","timestamp":1734186021000,"abstract":"  Machine learning and deep learning advancements have boosted Brain-Computer\nInterface (BCI) performance, but their wide-scale applicability is limited due\nto factors like individual health, hardware variations, and cultural\ndifferences affecting neural data. Studies often focus on uniform single-site\nexperiments in uniform settings, leading to high performance that may not\ntranslate well to real-world diversity. Deep learning models aim to enhance BCI\nclassification accuracy, and transfer learning has been suggested to adapt\nmodels to individual neural patterns using a base model trained on others'\ndata. This approach promises better generalizability and reduced overfitting,\nyet challenges remain in handling diverse and imbalanced datasets from\ndifferent equipment, subjects, multiple centres in different countries, and\nboth healthy and patient populations for effective model transfer and tuning.\n  In a setting characterized by maximal heterogeneity, we proposed P300 wave\ndetection in BCIs employing a convolutional neural network fitted with adaptive\ntransfer learning based on Poison Sampling Disk (PDS) called Active Sampling\n(AS), which flexibly adjusts the transition from source data to the target\ndomain. Our results reported for subject adaptive with 40% of adaptive\nfine-tuning that the averaged classification accuracy improved by 5.36% and\nstandard deviation reduced by 12.22% using two distinct, internationally\nreplicated datasets. These results outperformed in classification accuracy,\ncomputational time, and training efficiency, mainly due to the proposed Active\nSampling (AS) method for transfer learning.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computer Science/Artificial Intelligence","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"3LwW6aATgDLq0gjNI_ZsBj9_TGf4sC3vXCEIOuIgSCQ","pdfSize":"4296641"}