{"id":"2412.03379","title":"MTVNet: Mapping using Transformers for Volumes -- Network for\n  Super-Resolution with Long-Range Interactions","authors":"August Leander H{\\o}eg, Sophia W. Bardenfleth, Hans Martin Kjer, Tim\n  B. Dyrby, Vedrana Andersen Dahl and Anders Dahl","authorsParsed":[["Høeg","August Leander",""],["Bardenfleth","Sophia W.",""],["Kjer","Hans Martin",""],["Dyrby","Tim B.",""],["Dahl","Vedrana Andersen",""],["Dahl","Anders",""]],"versions":[{"version":"v1","created":"Wed, 4 Dec 2024 15:06:39 GMT"},{"version":"v2","created":"Mon, 9 Dec 2024 10:06:22 GMT"}],"updateDate":"2024-12-10","timestamp":1733324799000,"abstract":"  Until now, it has been difficult for volumetric super-resolution to utilize\nthe recent advances in transformer-based models seen in 2D super-resolution.\nThe memory required for self-attention in 3D volumes limits the receptive\nfield. Therefore, long-range interactions are not used in 3D to the extent done\nin 2D and the strength of transformers is not realized. We propose a\nmulti-scale transformer-based model based on hierarchical attention blocks\ncombined with carrier tokens at multiple scales to overcome this. Here\ninformation from larger regions at coarse resolution is sequentially carried on\nto finer-resolution regions to predict the super-resolved image. Using\ntransformer layers at each resolution, our coarse-to-fine modeling limits the\nnumber of tokens at each scale and enables attention over larger regions than\nwhat has previously been possible. We experimentally compare our method,\nMTVNet, against state-of-the-art volumetric super-resolution models on five 3D\ndatasets demonstrating the advantage of an increased receptive field. This\nadvantage is especially pronounced for images that are larger than what is seen\nin popularly used 3D datasets. Our code is available at\nhttps://github.com/AugustHoeg/MTVNet\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"LVjlnNgwxkkt-VnpYtlWnSG-nSIFl-sMS3_AGxAsT0w","pdfSize":"6822893"}