{
  "id": "2412.03336",
  "title": "Spontaneous Torque on an Inhomogeneous Chiral Body out of Thermal\n  Equilibrium",
  "authors": "Kimball A. Milton, Nima Pourtolami, and Gerard Kennedy",
  "authorsParsed": [
    [
      "Milton",
      "Kimball A.",
      ""
    ],
    [
      "Pourtolami",
      "Nima",
      ""
    ],
    [
      "Kennedy",
      "Gerard",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 14:09:54 GMT"
    },
    {
      "version": "v2",
      "created": "Wed, 5 Feb 2025 16:26:21 GMT"
    }
  ],
  "updateDate": "2025-02-06",
  "timestamp": 1733321394000,
  "abstract": "  In a previous paper we showed that an inhomogeneous body in vacuum will\nexperience a spontaneous force if it is not in thermal equilibrium with its\nenvironment. This is due to the asymmetric asymptotic radiation pattern such an\nobject emits. We demonstrated this self-propulsive force by considering an\nexpansion in powers of the electric susceptibility: A torque arises in first\norder, but only if the material constituting the body is nonreciprocal. No\nforce arises in first order. A force does occur for bodies made of ordinary\n(reciprocal) materials in second order. Here we extend these considerations to\nthe torque. As one would expect, a spontaneous torque will also appear on an\ninhomogeneous chiral object if it is out of thermal equilibrium with its\nenvironment. Once a chiral body starts to rotate, it will experience a small\nquantum frictional torque, but much more important, unless a mechanism is\nprovided to maintain the nonequilibrium state, is thermalization: The body will\nrapidly reach thermal equilibrium with the vacuum, and the angular acceleration\nwill essentially become zero. For a small, or even a large, inhomogeneous\nchiral body, a terminal angular velocity will result, which seems to be in the\nrealm of observability.\n",
  "subjects": [
    "Physics/Quantum Physics",
    "Physics/High Energy Physics - Theory"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "4YmRDOd5hRT5RPVBws-yLYx_4VeUxFyTpPc0dC5qtw4",
  "pdfSize": "760561"
}