{
  "id": "2412.00393",
  "title": "Advancing Object-Centric Process Mining with Multi-Dimensional Data\n  Operations",
  "authors": "Shahrzad Khayatbashi, Najmeh Miri, Amin Jalali",
  "authorsParsed": [
    [
      "Khayatbashi",
      "Shahrzad",
      ""
    ],
    [
      "Miri",
      "Najmeh",
      ""
    ],
    [
      "Jalali",
      "Amin",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 30 Nov 2024 08:14:46 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1732954486000,
  "abstract": "  Analyzing process data at varying levels of granularity is important to\nderive actionable insights and support informed decision-making. Object-Centric\nEvent Data (OCED) enhances process mining by capturing interactions among\nmultiple objects within events, leading to the discovery of more detailed and\nrealistic yet complex process models. The lack of methods to adjust the\ngranularity of the analysis limits users to leverage the full potential of\nObject-Centric Process Mining (OCPM). To address this gap, we propose four\noperations: drill-down, roll-up, unfold, and fold, which enable changing the\ngranularity of analysis when working with Object-Centric Event Logs (OCEL).\nThese operations allow analysts to seamlessly transition between detailed and\naggregated process models, facilitating the discovery of insights that require\nvarying levels of abstraction. We formally define these operations and\nimplement them in an open-source Python library. To validate their utility, we\napplied the approach to real-world OCEL data extracted from a learning\nmanagement system that covered a four-year period and approximately 400\nstudents. Our evaluation demonstrates significant improvements in precision and\nfitness metrics for models discovered before and after applying these\noperations. This approach can empower analysts to perform more flexible and\ncomprehensive process exploration, unlocking actionable insights through\nadaptable granularity adjustments.\n",
  "subjects": [
    "Computer Science/Databases"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "fFgOMtJiVhXhS3IyuBpdaWjwD7-Wqy6vXbR6qiAOXo4",
  "pdfSize": "503234"
}