{"id":"2412.16536","title":"Resource-efficient high-threshold fault-tolerant quantum computation\n  with weak nonlinear optics","authors":"Kosuke Fukui, Peter van Loock","authorsParsed":[["Fukui","Kosuke",""],["van Loock","Peter",""]],"versions":[{"version":"v1","created":"Sat, 21 Dec 2024 08:32:53 GMT"}],"updateDate":"2024-12-24","timestamp":1734769973000,"abstract":"  Quantum computation with light, compared with other platforms, offers the\nunique benefit of natural high-speed operations at room temperature and large\nclock rate, but a big obstacle of photonics is the lack of strong\nnonlinearities which also makes loss-tolerant or generally fault-tolerant\nquantum computation (FTQC) complicated in an all-optical setup. Typical current\napproaches to optical FTQC that aim at building suitable large multi-qubit\ncluster states by linearly fusing small elementary resource states would still\ndemand either fairly expensive initial resources or rather low loss and error\nrates. Here we propose reintroducing weakly nonlinear operations, such as a\nweak cross-Kerr interaction, to achieve small initial resource cost and high\nerror thresholds at the same time. More specifically, we propose an approach to\ngenerate a large-scale cluster state by hybridizing Gottesman-Kitaev-Preskill\n(GKP) and single-photon qubits. Our approach enables us to implement FTQC based\non GKP squeezing of 7.4 and 8.4 dB and a photon loss rate of 1.0 and 5.0 %,\nrespectively. In addition, our scheme has a reduced resource cost, i.e., number\nof physical qubits/photons per logical qubit or initial entanglement, compared\nto high-threshold FTQC with optical GKP qubits or fusion-based quantum\ncomputation with encoded single-photon-qubit states, respectively. Furthermore,\nour approach, when assuming very low photon loss, allows to employ GKP\nsqueezing as little as 3.8 dB, which cannot be achieved by using GKP qubits\nalone.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"w2IJRkiEbW3yBE6hJ_WEzaWiH4PS9S1rcZoR1cSmnRY","pdfSize":"1865259"}