{
  "id": "2412.01319",
  "title": "On the classification of duality defects in $c=2$ compact boson CFTs\n  with a discrete group orbifold",
  "authors": "Yuma Furuta",
  "authorsParsed": [
    [
      "Furuta",
      "Yuma",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 09:36:57 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733132217000,
  "abstract": "  We propose a novel approach to exploring duality defects in the $c=2$ compact\nboson conformal field theory (CFT). This study is motivated by the desire to\nclassify categorical symmetries, particularly duality defects, in CFTs. While\nthe $c=1$ case has been extensively studied, and the types of realizable\nduality defects are largely understood, the situation becomes significantly\nmore complex for $c=2$. The simplicity of the $c=1$ case arises from the fact\nthat its theory is essentially determined by the radius of compactification. In\ncontrast, the $c=2$ case involves more parameters, leading to a more intricate\naction of T-duality. As a result, directly solving the condition for a theory\nto be self-dual under orbifolding becomes highly challenging. To address this,\nwe categorize duality defects into four types and demonstrate that the\ncondition for a toroidal branch theory to be self-dual under an orbifold\ninduced by an automorphism generated by shift symmetry can be reformulated as\nquadratic equations. We also found that for ``almost all\" theories we can\nenumerate all solutions for such equations. Moreover, this reformulation\nenables the simultaneous exploration of multiple duality defects and provides\nevidence for the existence of duality defects under specific parameter families\nfor the theory, such as $(\\tau, \\rho) = (it, \\frac{1}{2}+it)$ where $t \\in\n\\mathbb{Q}$.\n",
  "subjects": [
    "Physics/High Energy Physics - Theory",
    "Physics/Mathematical Physics",
    "Mathematics/Mathematical Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "St6o7fZSpnt8l6xFHePqDFZF2ct4VtxnVnJbjy1wSP8",
  "pdfSize": "619351"
}