{"id":"2412.13702","title":"Typhoon 2: A Family of Open Text and Multimodal Thai Large Language\n  Models","authors":"Kunat Pipatanakul, Potsawee Manakul, Natapong Nitarach, Warit\n  Sirichotedumrong, Surapon Nonesung, Teetouch Jaknamon, Parinthapat Pengpun,\n  Pittawat Taveekitworachai, Adisai Na-Thalang, Sittipong Sripaisarnmongkol,\n  Krisanapong Jirayoot, Kasima Tharnpipitchai","authorsParsed":[["Pipatanakul","Kunat",""],["Manakul","Potsawee",""],["Nitarach","Natapong",""],["Sirichotedumrong","Warit",""],["Nonesung","Surapon",""],["Jaknamon","Teetouch",""],["Pengpun","Parinthapat",""],["Taveekitworachai","Pittawat",""],["Na-Thalang","Adisai",""],["Sripaisarnmongkol","Sittipong",""],["Jirayoot","Krisanapong",""],["Tharnpipitchai","Kasima",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 10:45:24 GMT"},{"version":"v2","created":"Thu, 19 Dec 2024 17:36:38 GMT"}],"updateDate":"2024-12-20","timestamp":1734518724000,"abstract":"  This paper introduces Typhoon 2, a series of text and multimodal large\nlanguage models optimized for the Thai language. The series includes models for\ntext, vision, and audio. Typhoon2-Text builds on state-of-the-art open models,\nsuch as Llama 3 and Qwen2, and we perform continual pre-training on a mixture\nof English and Thai data. We employ post-training techniques to enhance Thai\nlanguage performance while preserving the base models' original capabilities.\nWe release text models across a range of sizes, from 1 to 70 billion\nparameters, available in both base and instruction-tuned variants. To guardrail\ntext generation, we release Typhoon2-Safety, a classifier enhanced for Thai\ncultures and language. Typhoon2-Vision improves Thai document understanding\nwhile retaining general visual capabilities, such as image captioning.\nTyphoon2-Audio introduces an end-to-end speech-to-speech model architecture\ncapable of processing audio, speech, and text inputs and generating both text\nand speech outputs.\n","subjects":["Computer Science/Computation and Language","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"dmPS5u0ZQOq-9e55P50WrM9SdA7oWYr_WV4qIuWEUHw","pdfSize":"6200145"}