{
  "id": "2412.16373",
  "title": "FairREAD: Re-fusing Demographic Attributes after Disentanglement for\n  Fair Medical Image Classification",
  "authors": "Yicheng Gao, Jinkui Hao, Bo Zhou",
  "authorsParsed": [
    [
      "Gao",
      "Yicheng",
      ""
    ],
    [
      "Hao",
      "Jinkui",
      ""
    ],
    [
      "Zhou",
      "Bo",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 22:17:57 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734733077000,
  "abstract": "  Recent advancements in deep learning have shown transformative potential in\nmedical imaging, yet concerns about fairness persist due to performance\ndisparities across demographic subgroups. Existing methods aim to address these\nbiases by mitigating sensitive attributes in image data; however, these\nattributes often carry clinically relevant information, and their removal can\ncompromise model performance-a highly undesirable outcome. To address this\nchallenge, we propose Fair Re-fusion After Disentanglement (FairREAD), a novel,\nsimple, and efficient framework that mitigates unfairness by re-integrating\nsensitive demographic attributes into fair image representations. FairREAD\nemploys orthogonality constraints and adversarial training to disentangle\ndemographic information while using a controlled re-fusion mechanism to\npreserve clinically relevant details. Additionally, subgroup-specific threshold\nadjustments ensure equitable performance across demographic groups.\nComprehensive evaluations on a large-scale clinical X-ray dataset demonstrate\nthat FairREAD significantly reduces unfairness metrics while maintaining\ndiagnostic accuracy, establishing a new benchmark for fairness and performance\nin medical image classification.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Computers and Society"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "P9ZH79Skr48dAzkmwLaOfYxVOCNnRDxDbXtV4eh3I70",
  "pdfSize": "2833560"
}