{
  "id": "2412.19245",
  "title": "Sentiment trading with large language models",
  "authors": "Kemal Kirtac and Guido Germano",
  "authorsParsed": [
    [
      "Kirtac",
      "Kemal",
      ""
    ],
    [
      "Germano",
      "Guido",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 26 Dec 2024 15:01:24 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735225284000,
  "abstract": "  We investigate the efficacy of large language models (LLMs) in sentiment\nanalysis of U.S. financial news and their potential in predicting stock market\nreturns. We analyze a dataset comprising 965,375 news articles that span from\nJanuary 1, 2010, to June 30, 2023; we focus on the performance of various LLMs,\nincluding BERT, OPT, FINBERT, and the traditional Loughran-McDonald dictionary\nmodel, which has been a dominant methodology in the finance literature. The\nstudy documents a significant association between LLM scores and subsequent\ndaily stock returns. Specifically, OPT, which is a GPT-3 based LLM, shows the\nhighest accuracy in sentiment prediction with an accuracy of 74.4%, slightly\nahead of BERT (72.5%) and FINBERT (72.2%). In contrast, the Loughran-McDonald\ndictionary model demonstrates considerably lower effectiveness with only 50.1%\naccuracy. Regression analyses highlight a robust positive impact of OPT model\nscores on next-day stock returns, with coefficients of 0.274 and 0.254 in\ndifferent model specifications. BERT and FINBERT also exhibit predictive\nrelevance, though to a lesser extent. Notably, we do not observe a significant\nrelationship between the Loughran-McDonald dictionary model scores and stock\nreturns, challenging the efficacy of this traditional method in the current\nfinancial context. In portfolio performance, the long-short OPT strategy excels\nwith a Sharpe ratio of 3.05, compared to 2.11 for BERT and 2.07 for FINBERT\nlong-short strategies. Strategies based on the Loughran-McDonald dictionary\nyield the lowest Sharpe ratio of 1.23. Our findings emphasize the superior\nperformance of advanced LLMs, especially OPT, in financial market prediction\nand portfolio management, marking a significant shift in the landscape of\nfinancial analysis tools with implications to financial regulation and policy\nanalysis.\n",
  "subjects": [
    "Quantitative Finance/Computational Finance",
    "Computer Science/Machine Learning",
    "Economics/Econometrics",
    "Quantitative Finance/Portfolio Management",
    "Quantitative Finance/Trading and Market Microstructure"
  ],
  "license": "http://creativecommons.org/publicdomain/zero/1.0/",
  "blobId": "micDymlR9PPLs97nzm_ssCOjks-VUX24V728rPREtW4",
  "pdfSize": "1009617"
}