{"id":"2412.08200","title":"GN-FR:Generalizable Neural Radiance Fields for Flare Removal","authors":"Gopi Raju Matta, Rahul Siddartha, Rongali Simhachala Venkata Girish,\n  Sumit Sharma and Kaushik Mitra","authorsParsed":[["Matta","Gopi Raju",""],["Siddartha","Rahul",""],["Girish","Rongali Simhachala Venkata",""],["Sharma","Sumit",""],["Mitra","Kaushik",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 08:43:52 GMT"},{"version":"v2","created":"Wed, 18 Dec 2024 09:36:47 GMT"}],"updateDate":"2024-12-19","timestamp":1733906632000,"abstract":"  Flare, an optical phenomenon resulting from unwanted scattering and\nreflections within a lens system, presents a significant challenge in imaging.\nThe diverse patterns of flares, such as halos, streaks, color bleeding, and\nhaze, complicate the flare removal process. Existing traditional and\nlearning-based methods have exhibited limited efficacy due to their reliance on\nsingle-image approaches, where flare removal is highly ill-posed. We address\nthis by framing flare removal as a multi-view image problem, taking advantage\nof the view-dependent nature of flare artifacts. This approach leverages\ninformation from neighboring views to recover details obscured by flare in\nindividual images. Our proposed framework, GN-FR (Generalizable Neural Radiance\nFields for Flare Removal), can render flare-free views from a sparse set of\ninput images affected by lens flare and generalizes across different scenes in\nan unsupervised manner. GN-FR incorporates several modules within the\nGeneralizable NeRF Transformer (GNT) framework: Flare-occupancy Mask Generation\n(FMG), View Sampler (VS), and Point Sampler (PS). To overcome the\nimpracticality of capturing both flare-corrupted and flare-free data, we\nintroduce a masking loss function that utilizes mask information in an\nunsupervised setting. Additionally, we present a 3D multi-view flare dataset,\ncomprising 17 real flare scenes with 782 images, 80 real flare patterns, and\ntheir corresponding annotated flare-occupancy masks. To our knowledge, this is\nthe first work to address flare removal within a Neural Radiance Fields (NeRF)\nframework.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"cSJuwZb72LIGCN_Vm34E7OmU2vM62YCcGqIkQNlW_00","pdfSize":"46841457"}