{"id":"2412.06700","title":"Facade: High-Precision Insider Threat Detection Using Deep Contextual\n  Anomaly Detection","authors":"Alex Kantchelian, Casper Neo, Ryan Stevens, Hyungwon Kim, Zhaohao Fu,\n  Sadegh Momeni, Birkett Huber, Elie Bursztein, Yanis Pavlidis, Senaka\n  Buthpitiya, Martin Cochran, and Massimiliano Poletto","authorsParsed":[["Kantchelian","Alex",""],["Neo","Casper",""],["Stevens","Ryan",""],["Kim","Hyungwon",""],["Fu","Zhaohao",""],["Momeni","Sadegh",""],["Huber","Birkett",""],["Bursztein","Elie",""],["Pavlidis","Yanis",""],["Buthpitiya","Senaka",""],["Cochran","Martin",""],["Poletto","Massimiliano",""]],"versions":[{"version":"v1","created":"Mon, 9 Dec 2024 17:46:28 GMT"}],"updateDate":"2024-12-10","timestamp":1733766388000,"abstract":"  We present Facade (Fast and Accurate Contextual Anomaly DEtection): a\nhigh-precision deep-learning-based anomaly detection system deployed at Google\n(a large technology company) as the last line of defense against insider\nthreats since 2018. Facade is an innovative unsupervised action-context system\nthat detects suspicious actions by considering the context surrounding each\naction, including relevant facts about the user and other entities involved. It\nis built around a new multi-modal model that is trained on corporate document\naccess, SQL query, and HTTP/RPC request logs.\n  To overcome the scarcity of incident data, Facade harnesses a novel\ncontrastive learning strategy that relies solely on benign data. Its use of\nhistory and implicit social network featurization efficiently handles the\nfrequent out-of-distribution events that occur in a rapidly changing corporate\nenvironment, and sustains Facade's high precision performance for a full year\nafter training. Beyond the core model, Facade contributes an innovative\nclustering approach based on user and action embeddings to improve detection\nrobustness and achieve high precision, multi-scale detection.\n  Functionally what sets Facade apart from existing anomaly detection systems\nis its high precision. It detects insider attackers with an extremely low false\npositive rate, lower than 0.01%. For single rogue actions, such as the\nillegitimate access to a sensitive document, the false positive rate is as low\nas 0.0003%. To the best of our knowledge, Facade is the only published insider\nrisk anomaly detection system that helps secure such a large corporate\nenvironment.\n","subjects":["Computer Science/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"4jM5igjCz7aIWjc5wWoKmRRgyR2aKcyBhSY2I8wjRs0","pdfSize":"2016054"}