{"id":"2412.06197","title":"Modeling, Planning, and Control for Hybrid UAV Transition Maneuvers","authors":"Spencer Folk","authorsParsed":[["Folk","Spencer",""]],"versions":[{"version":"v1","created":"Mon, 9 Dec 2024 04:26:43 GMT"}],"updateDate":"2024-12-10","timestamp":1733718403000,"abstract":"  Small unmanned aerial vehicles (UAVs) have become standard tools in\nreconnaissance and surveying for both civilian and defense applications. In the\nfuture, UAVs will likely play a pivotal role in autonomous package delivery,\nbut current multi-rotor candidates suffer from poor energy efficiency leading\nto insufficient endurance and range. In order to reduce the power demands of\npackage delivery UAVs while still maintaining necessary hovering capabilities,\ncompanies like Amazon are experimenting with hybrid Vertical Take-Off and\nLanding (VTOL) platforms. Tailsitter VTOLs offer a mechanically simple and\ncost-effective solution compared to other hybrid VTOL configurations, and while\nadvances in hardware and microelectronics have optimized the tailsitter for\npackage delivery, the software behind its operation has largely remained a\ncritical barrier to industry adoption. Tailsitters currently lack a generic,\ncomputationally efficient method of control that can provide strong safety and\nrobustness guarantees over the entire flight domain. Further, tailsitters lack\na closed-form method of designing dynamically feasible transition maneuvers\nbetween hover and cruise. In this paper, we survey the modeling and control\nmethods currently implemented on small-scale tailsitter UAVs, and attempt to\nleverage a nonlinear dynamic model to design physically realizable,\ncontinuous-pitch transition maneuvers at constant altitude. Primary results\nfrom this paper isolate potential barriers to constant-altitude transition, and\na novel approach to bypassing these barriers is proposed. While initial results\nare unsuccessful at providing feasible transition, this work acts as a stepping\nstone for future efforts to design new transition maneuvers that are safe,\nrobust, and computationally efficient.\n","subjects":["Computer Science/Robotics","Computer Science/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"o8QhzAAk4w1i0SWaLlQfhz6SoIBIdNQhXzS194qUJ_w","pdfSize":"3663391"}