{
  "id": "2412.10444",
  "title": "Boundary Exploration of Next Best View Policy in 3D Robotic Scanning",
  "authors": "Leihui Li, Xuping Zhang",
  "authorsParsed": [
    [
      "Li",
      "Leihui",
      ""
    ],
    [
      "Zhang",
      "Xuping",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 16:11:13 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1733933473000,
  "abstract": "  The Next Best View (NBV) problem is a pivotal challenge in 3D robotic\nscanning, with the potential to greatly improve the efficiency of object\ncapture and reconstruction. Current methods for determining the NBV often\noverlook view overlaps, assume a virtual origin point for the camera's focus,\nand rely on voxel representations of 3D data. To address these issues and\nimprove the practicality of scanning unknown objects, we propose an NBV policy\nin which the next view explores the boundary of the scanned point cloud, and\nthe overlap is intrinsically considered. The scanning distance or camera\nworking distance is adjustable and flexible. To this end, a model-based\napproach is proposed where the next sensor positions are searched iteratively\nbased on a reference model. A score is calculated by considering the overlaps\nbetween newly scanned and existing data, as well as the final convergence.\nAdditionally, following the boundary exploration idea, a deep learning network,\nBoundary Exploration NBV network (BENBV-Net), is designed and proposed, which\ncan be used to predict the NBV directly from the scanned data without requiring\nthe reference model. It predicts the scores for given boundaries, and the\nboundary with the highest score is selected as the target point of the next\nbest view. BENBV-Net improves the speed of NBV generation while maintaining the\nperformance of the model-based approach. Our proposed methods are evaluated and\ncompared with existing approaches on the ShapeNet, ModelNet, and 3D Repository\ndatasets. Experimental results demonstrate that our approach outperforms others\nin terms of scanning efficiency and overlap, both of which are crucial for\npractical 3D scanning applications. The related code is released at\n\\url{github.com/leihui6/BENBV}.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Robotics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "8fO1IE4qxtRFlxOOQ2wRVTI1NvRaYfBPrKn4tNo4RuQ",
  "pdfSize": "3340501"
}