{
  "id": "2412.05970",
  "title": "Robust magnetoelectric coupling in altermagnetic-ferroelectric type-III\n  multiferroics",
  "authors": "Wei Sun, Wenxuan Wang, Changhong Yang, Ying Liu, Xiaotian Wang,\n  Shifeng Huang, Zhenxiang Cheng",
  "authorsParsed": [
    [
      "Sun",
      "Wei",
      ""
    ],
    [
      "Wang",
      "Wenxuan",
      ""
    ],
    [
      "Yang",
      "Changhong",
      ""
    ],
    [
      "Liu",
      "Ying",
      ""
    ],
    [
      "Wang",
      "Xiaotian",
      ""
    ],
    [
      "Huang",
      "Shifeng",
      ""
    ],
    [
      "Cheng",
      "Zhenxiang",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 8 Dec 2024 15:33:06 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733671986000,
  "abstract": "  Multiferroic materials, characterized by the coexisting of ferroelectric\npolarization (breaking spatial inversion symmetry) and magnetism (breaking\ntime-reversal symmetry), with strong magnetoelectric coupling, are highly\nsought after for advanced technological applications. Novel altermagnets,\ndistinct from conventional magnets, have recently been revealed to exhibit\nunique spin polarization protected by crystal symmetry, which naturally\novercomes the isolation of magnetism from ferroelectrics associated with\nspatial symmetry. In this study, we propose a novel class of type-III\nmultiferroics, where ferroelectricity and altermagnetism are inherently\ninterlocked by crystal symmetry, setting them apart from conventional\nmultiferroics. Through first-principles calculations, ferroelectric switching\nis shown to fully invert the spin polarization of altermagnets, equivalent to a\n180{\\deg} reversal of magnetic spin. This strong magnetoelectric coupling is\nfurther supported by the magneto-optical Kerr effect, revealing a new class of\nmultiferroics with robust, symmetry-driven magnetoelectric coupling and\nproviding a theoretical foundation for the design of next-generation spintronic\ndevices leveraging altermagnetism.\n",
  "subjects": [
    "Condensed Matter/Materials Science"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "2t9ZFnVuHqggPI8wTVp5yR8dEYEJ25jroMKLQzOPJFE",
  "pdfSize": "3970107"
}