{
  "id": "2412.19740",
  "title": "A Root-Zone Soil Salinity Observatory for Coastal Southwest Bangladesh",
  "authors": "Showmitra Kumar Sarkar, Mafrid Haydar, Rhyme Rubayet Rudra, Tanmoy\n  Mazumder, Md. Sadmin Nur, Md. Shahriar Islam, Shakib Mohammad Sany, Tanzim Al\n  Noor, Shakil Ahmed, Myisha Ahmad, Annajmus Sakib, Sai Ravela",
  "authorsParsed": [
    [
      "Sarkar",
      "Showmitra Kumar",
      ""
    ],
    [
      "Haydar",
      "Mafrid",
      ""
    ],
    [
      "Rudra",
      "Rhyme Rubayet",
      ""
    ],
    [
      "Mazumder",
      "Tanmoy",
      ""
    ],
    [
      "Nur",
      "Md. Sadmin",
      ""
    ],
    [
      "Islam",
      "Md. Shahriar",
      ""
    ],
    [
      "Sany",
      "Shakib Mohammad",
      ""
    ],
    [
      "Noor",
      "Tanzim Al",
      ""
    ],
    [
      "Ahmed",
      "Shakil",
      ""
    ],
    [
      "Ahmad",
      "Myisha",
      ""
    ],
    [
      "Sakib",
      "Annajmus",
      ""
    ],
    [
      "Ravela",
      "Sai",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 27 Dec 2024 17:02:12 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735318932000,
  "abstract": "  The research assesses soil salinity in the southwest coastal region of\nBangladesh, collecting a total of 162 topsoil samples between March 1 and March\n9, 2024, and processing them following the standard operating procedure for\nsoil electrical conductivity (soil/water, 1:5). Electrical conductivity (EC)\nmeasurements obtained using a HI-6321 advanced conductivity benchtop meter were\nanalyzed and visualized using bubble density mapping and the Empirical Bayesian\nKriging interpolation method. The findings indicate that soil salinity in the\nstudy area ranges from 0.05 to 9.09 mS/cm, with the highest levels observed\nnear Debhata and Koyra. A gradient of increasing soil salinity is clearly\nevident from the northern to southern regions. This dataset provides a critical\nresource for soil salinity-related research in the region, offering valuable\ninsights to support decision-makers in understanding and mitigating the impacts\nof soil salinity in Bangladesh's coastal areas.\n",
  "subjects": [
    "Physics/Geophysics"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "EAilvLJFibR9qzEBcwBp-NGLpfHxSy3txe4jBrgYe3o",
  "pdfSize": "22131312"
}