{
  "id": "2412.21095",
  "title": "Lyapunov-Based Deep Neural Networks for Adaptive Control of Stochastic\n  Nonlinear Systems",
  "authors": "Saiedeh Akbari, Cristian F. Nino, Omkar Sudhir Patil, Warren E. Dixon",
  "authorsParsed": [
    [
      "Akbari",
      "Saiedeh",
      ""
    ],
    [
      "Nino",
      "Cristian F.",
      ""
    ],
    [
      "Patil",
      "Omkar Sudhir",
      ""
    ],
    [
      "Dixon",
      "Warren E.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 30 Dec 2024 17:19:48 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735579188000,
  "abstract": "  Controlling nonlinear stochastic dynamical systems involves substantial\nchallenges when the dynamics contain unknown and unstructured nonlinear\nstate-dependent terms. For such complex systems, deep neural networks can serve\nas powerful black box approximators for the unknown drift and diffusion\nprocesses. Recent developments construct Lyapunov-based deep neural network\n(Lb-DNN) controllers to compensate for deterministic uncertainties using\nadaptive weight update laws derived from a Lyapunov-based analysis based on\ninsights from the compositional structure of the DNN architecture. However,\nthese Lb-DNN controllers do not account for non-deterministic uncertainties.\nThis paper develops Lb-DNNs to adaptively compensate for both the drift and\ndiffusion uncertainties of nonlinear stochastic dynamic systems. Through a\nLyapunov-based stability analysis, a DNN-based approximation and corresponding\nDNN weight adaptation laws are constructed to eliminate the unknown\nstate-dependent terms resulting from the nonlinear diffusion and drift\nprocesses. The tracking error is shown to be uniformly ultimately bounded in\nprobability. Simulations are performed on a nonlinear stochastic dynamical\nsystem to show efficacy of the proposed method.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Systems and Control",
    "Computer Science/Systems and Control"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "CC96Tvz-ZfIGGBaUE71tPicl2U9nVYQqzoA2A9E9F7w",
  "pdfSize": "2343507"
}