{
  "id": "2412.20956",
  "title": "QuantumLLMInstruct: A 500k LLM Instruction-Tuning Dataset with\n  Problem-Solution Pairs for Quantum Computing",
  "authors": "Shlomo Kashani",
  "authorsParsed": [
    [
      "Kashani",
      "Shlomo",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 30 Dec 2024 13:53:51 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735566831000,
  "abstract": "  We present QuantumLLMInstruct (QLMMI), an innovative dataset featuring over\n500,000 meticulously curated instruction-following problem-solution pairs\ndesigned specifically for quantum computing - the largest and most\ncomprehensive dataset of its kind. Originating from over 90 primary seed\ndomains and encompassing hundreds of subdomains autonomously generated by LLMs,\nQLMMI marks a transformative step in the diversity and richness of quantum\ncomputing datasets.\n  Designed for instruction fine-tuning, QLMMI seeks to significantly improve\nLLM performance in addressing complex quantum computing challenges across a\nwide range of quantum physics topics. While Large Language Models (LLMs) have\npropelled advancements in computational science with datasets like Omni-MATH\nand OpenMathInstruct, these primarily target Olympiad-level mathematics,\nleaving quantum computing largely unexplored.\n  The creation of QLMMI follows a rigorous four-stage methodology. Initially,\nfoundational problems are developed using predefined templates, focusing on\ncritical areas such as synthetic Hamiltonians, QASM code generation,\nJordan-Wigner transformations, and Trotter-Suzuki quantum circuit\ndecompositions. Next, detailed and domain-specific solutions are crafted to\nensure accuracy and relevance. In the third stage, the dataset is enriched\nthrough advanced reasoning techniques, including Chain-of-Thought (CoT) and\nTask-Oriented Reasoning and Action (ToRA), which enhance problem-solution\ndiversity while adhering to strict mathematical standards. Lastly, a zero-shot\nJudge LLM performs self-assessments to validate the dataset's quality and\nreliability, minimizing human oversight requirements.\n",
  "subjects": [
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "tXb86j9KZ3qzsphPlk-ybtXfDUCBTtw3Ar3AZrfVpuU",
  "pdfSize": "812836"
}