{"id":"2412.20292","title":"An analytic theory of creativity in convolutional diffusion models","authors":"Mason Kamb, Surya Ganguli","authorsParsed":[["Kamb","Mason",""],["Ganguli","Surya",""]],"versions":[{"version":"v1","created":"Sat, 28 Dec 2024 22:33:29 GMT"}],"updateDate":"2024-12-31","timestamp":1735425209000,"abstract":"  We obtain the first analytic, interpretable and predictive theory of\ncreativity in convolutional diffusion models. Indeed, score-based diffusion\nmodels can generate highly creative images that lie far from their training\ndata. But optimal score-matching theory suggests that these models should only\nbe able to produce memorized training examples. To reconcile this\ntheory-experiment gap, we identify two simple inductive biases, locality and\nequivariance, that: (1) induce a form of combinatorial creativity by preventing\noptimal score-matching; (2) result in a fully analytic, completely\nmechanistically interpretable, equivariant local score (ELS) machine that, (3)\nwithout any training can quantitatively predict the outputs of trained\nconvolution only diffusion models (like ResNets and UNets) with high accuracy\n(median $r^2$ of $0.90, 0.91, 0.94$ on CIFAR10, FashionMNIST, and MNIST). Our\nELS machine reveals a locally consistent patch mosaic model of creativity, in\nwhich diffusion models create exponentially many novel images by mixing and\nmatching different local training set patches in different image locations. Our\ntheory also partially predicts the outputs of pre-trained self-attention\nenabled UNets (median $r^2 \\sim 0.75$ on CIFAR10), revealing an intriguing role\nfor attention in carving out semantic coherence from local patch mosaics.\n","subjects":["Computer Science/Machine Learning","Condensed Matter/Disordered Systems and Neural Networks","Computer Science/Artificial Intelligence","Quantitative Biology/Neurons and Cognition","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"NV2fQ00AYRA3SMpZdfGH9pMYk6I0pOUV_7ov3rV0XeE","pdfSize":"10270958"}