{
  "id": "2412.06828",
  "title": "Enhancing LLMs for Impression Generation in Radiology Reports through a\n  Multi-Agent System",
  "authors": "Fang Zeng, Zhiliang Lyu, Quanzheng Li, Xiang Li",
  "authorsParsed": [
    [
      "Zeng",
      "Fang",
      ""
    ],
    [
      "Lyu",
      "Zhiliang",
      ""
    ],
    [
      "Li",
      "Quanzheng",
      ""
    ],
    [
      "Li",
      "Xiang",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 21:33:03 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733520783000,
  "abstract": "  This study introduces \"RadCouncil,\" a multi-agent Large Language Model (LLM)\nframework designed to enhance the generation of impressions in radiology\nreports from the finding section. RadCouncil comprises three specialized\nagents: 1) a \"Retrieval\" Agent that identifies and retrieves similar reports\nfrom a vector database, 2) a \"Radiologist\" Agent that generates impressions\nbased on the finding section of the given report plus the exemplar reports\nretrieved by the Retrieval Agent, and 3) a \"Reviewer\" Agent that evaluates the\ngenerated impressions and provides feedback. The performance of RadCouncil was\nevaluated using both quantitative metrics (BLEU, ROUGE, BERTScore) and\nqualitative criteria assessed by GPT-4, using chest X-ray as a case study.\nExperiment results show improvements in RadCouncil over the single-agent\napproach across multiple dimensions, including diagnostic accuracy, stylistic\nconcordance, and clarity. This study highlights the potential of utilizing\nmultiple interacting LLM agents, each with a dedicated task, to enhance\nperformance in specialized medical tasks and the development of more robust and\nadaptable healthcare AI solutions.\n",
  "subjects": [
    "Computer Science/Computation and Language",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "tp19ykJMDOBzA_p3yN6mtyu02EubjtM6C75YbAEZ3MM",
  "pdfSize": "447689"
}