{
  "id": "2412.10405",
  "title": "Elucidating microstructural influences on fatigue behavior for\n  additively manufactured Hastelloy X using Bayesian-calibrated crystal\n  plasticity model",
  "authors": "Ajay Kushwaha, Eralp Demir, Amrita Basak",
  "authorsParsed": [
    [
      "Kushwaha",
      "Ajay",
      ""
    ],
    [
      "Demir",
      "Eralp",
      ""
    ],
    [
      "Basak",
      "Amrita",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 15:46:37 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1733499997000,
  "abstract": "  Crystal plasticity (CP) modeling is a vital tool for predicting the\nmechanical behavior of materials, but its calibration involves numerous (>8)\nconstitutive parameters, often requiring time-consuming trial-and-error\nmethods. This paper proposes a robust calibration approach using Bayesian\noptimization (BO) to identify optimal CP model parameters under fatigue loading\nconditions. Utilizing cyclic data from additively manufactured Hastelloy X\nspecimens at 500 degree-F, the BO framework, integrated with a Gaussian process\nsurrogate model, significantly reduces the number of required simulations. A\nnovel objective function is developed to match experimental stress-strain data\nacross different strain amplitudes. Results demonstrate that effective CP model\ncalibration is achieved within 75 iterations, with as few as 50 initial\nsimulations. Sensitivity analysis reveals the influence of CP parameters at\nvarious loading points on the stress-strain curve. The results show that the\nstress-strain response is predominantly controlled by parameters related to\nyield, with increased influence from backstress parameters during compressive\nloading. In addition, the effect of introducing twins into the synthetic\nmicrostructure on fatigue behavior is studied, and a relationship between\nmicrostructural features and the fatigue indicator parameter is established.\nResults show that larger diameter grains, which exhibit a higher Schmid factor\nand an average misorientation of approximately 42 degrees +/- 1.67 degree, are\nidentified as probable sites for failure. The proposed optimization framework\ncan be applied to any material system or CP model, streamlining the calibration\nprocess and improving the predictive accuracy of such models.\n",
  "subjects": [
    "Computer Science/Computational Engineering, Finance, and Science",
    "Condensed Matter/Materials Science",
    "Computer Science/Machine Learning",
    "Computer Science/Numerical Analysis",
    "Mathematics/Numerical Analysis"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "eeP0fH-P0Au8NsvvKUo2J9RQ1lAi1nCm4JNrqCZHhcw",
  "pdfSize": "2786623"
}