{
  "id": "2412.17555",
  "title": "Buried Interfaces and Spin Orientation in [Co/Pt]10 /Fe multilayer with\n  Orthogonal Magnetic Anisotropy: Effect of Fe Thickness",
  "authors": "Sadhana Singh, Manisha Priyadarsini, Sharanjeet Singh, Ilya Sergeev,\n  Marcus Herlitschke, H. C. Wille, Dileep Kumar",
  "authorsParsed": [
    [
      "Singh",
      "Sadhana",
      ""
    ],
    [
      "Priyadarsini",
      "Manisha",
      ""
    ],
    [
      "Singh",
      "Sharanjeet",
      ""
    ],
    [
      "Sergeev",
      "Ilya",
      ""
    ],
    [
      "Herlitschke",
      "Marcus",
      ""
    ],
    [
      "Wille",
      "H. C.",
      ""
    ],
    [
      "Kumar",
      "Dileep",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 13:21:36 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734960096000,
  "abstract": "  In the present work, spin orientation and variation of the strength of\ncoupling in [Co/Pt]ML/Fe multilayer have been investigated as a function of the\nthickness of the Fe layer. [Co/Pt]ML/Fe multilayer has orthogonal anisotropy\nwith the Fe layer, and [Co/Pt]ML has in-plane magnetic anisotropy and\nperpendicular anisotropy, respectively. Measurements are performed using\nin-situ magneto-optical Kerr effect (MOKE) and isotope-sensitive depth-resolved\nnuclear resonance scattering (NRS) technique. Real-time in-situ MOKE\nmeasurement during Fe growth reveals that with an increase in thickness of the\nFe layer, moments of Fe layer reorientation from out of the plane to in-plane\ndirection. This is attributed to the decrease in the coupling between the\n[Co/Pt]ML and Fe layer. For the depth-dependent study, two [Co/Pt]ML/Fe\nmultilayers having the same thickness but different positions of the Fe57\nmarker layer ([Co/Pt]MLFe/Fe57) and [Co/Pt]MLFe57/Fe ) were studied using the\nNRS technique. Films with varying external magnetic fields were also studied to\ninvestigate coupling strength. Measurements were performed under the x-ray\nstanding wave conditions to enhance resonance yield. It is observed that for\nthe 75 {\\AA} Fe in [Co/Pt]ML/Fe multilayer, the coupling varies along the depth\nof the Fe layer. The coupling is strong at [Co/Pt]ML and Fe interface with\nspins of the Fe layer aligned in the out-of-plane direction, whereas moments\naway from the interface are weakly coupled and aligned in-plane along the\nmagnetic easy axis. Due to this gradient in strength of coupling along the\ndepth, a large magnetic field is required to reorient spins at the interface\nalong the magnetic hard axis of the Fe layer; however, spins away from the\ninterface can rotate freely even in the low magnetic field.\n",
  "subjects": [
    "Condensed Matter/Materials Science"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "ukol_hX-_JQhCeL48EOsyXFufUqknAtO1mWyqN5nWgo",
  "pdfSize": "918807"
}