{
  "id": "2412.14079",
  "title": "Zeptojoule Calorimetry",
  "authors": "Andr\\'as Gunyh\\'o, Kassius Kohvakka, Qi-Ming Chen, Jean-Philippe\n  Girard, Roope Kokkoniemi, Wei Liu, Mikko M\\\"ott\\\"onen",
  "authorsParsed": [
    [
      "Gunyhó",
      "András",
      ""
    ],
    [
      "Kohvakka",
      "Kassius",
      ""
    ],
    [
      "Chen",
      "Qi-Ming",
      ""
    ],
    [
      "Girard",
      "Jean-Philippe",
      ""
    ],
    [
      "Kokkoniemi",
      "Roope",
      ""
    ],
    [
      "Liu",
      "Wei",
      ""
    ],
    [
      "Möttönen",
      "Mikko",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 17:26:37 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734542797000,
  "abstract": "  The measurement of energy is a fundamental tool used, for example, in\nexploring the early universe, characterizing particle decay processes, as well\nas in quantum technology and computing. Some of the most sensitive energy\ndetectors are thermal, i.e., bolometers and calorimeters, which operate by\nabsorbing incoming energy, converting it into heat, and reading out the\nresulting temperature change electrically using a thermometer. Extremely\nsensitive calorimeters, including transition edge sensors, magnetic\nmicrocalorimeters and devices based on 2D conductors such as graphene, have\nbeen shown to reach impressive energy resolutions of 17.6 zJ. Very recently\nsuperconductor--normal-conductor--superconductor (SNS) radiation sensors with\nmetallic and graphene absorbers have resulted in predictions of\nfull-width-at-half-maximum (FWHM) energy resolutions of 0.75 zJ and 0.05 zJ =\n71 GHz$\\times h$, respectively, where $h$ is the Planck constant. However,\nsince these estimates are only mathematically extracted from steady-state noise\nand responsivity measurements, no calorimetry reaching single-zeptojoule energy\nresolution or beyond has been demonstrated. Here, we use a metallic SNS sensor\nto measure the energy of 1-$\\mu$s-long 8.4-GHz microwave pulses with a FWHM\nenergy resolution finer than (0.95 $\\pm$ 0.02) zJ = (5.9 $\\pm$ 0.12) meV,\ncorresponding to 170 photons at 8.4 GHz. The techniques of this work, combined\nwith graphene-based sensors, provide a promising path to real-time calorimetric\ndetection of single photons in the 10 GHz range. Such a device has potential in\noperating as an accurate measurement device of quantum states such as those of\nsuperconducting qubits, or used in fundamental physics explorations including\nquantum thermodynamics, and the search for axions.\n",
  "subjects": [
    "Physics/Instrumentation and Detectors"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "FwvKD1Xa16cdIT2IFUKz16zUXsW3bhqSHfZ1eaSLlcw",
  "pdfSize": "1443960"
}