{
  "id": "2412.12806",
  "title": "Cross-Dialect Information Retrieval: Information Access in Low-Resource\n  and High-Variance Languages",
  "authors": "Robert Litschko, Oliver Kraus, Verena Blaschke, Barbara Plank",
  "authorsParsed": [
    [
      "Litschko",
      "Robert",
      ""
    ],
    [
      "Kraus",
      "Oliver",
      ""
    ],
    [
      "Blaschke",
      "Verena",
      ""
    ],
    [
      "Plank",
      "Barbara",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 11:21:09 GMT"
    },
    {
      "version": "v2",
      "created": "Mon, 6 Jan 2025 16:27:27 GMT"
    }
  ],
  "updateDate": "2025-01-07",
  "timestamp": 1734434469000,
  "abstract": "  A large amount of local and culture-specific knowledge (e.g., people,\ntraditions, food) can only be found in documents written in dialects. While\nthere has been extensive research conducted on cross-lingual information\nretrieval (CLIR), the field of cross-dialect retrieval (CDIR) has received\nlimited attention. Dialect retrieval poses unique challenges due to the limited\navailability of resources to train retrieval models and the high variability in\nnon-standardized languages. We study these challenges on the example of German\ndialects and introduce the first German dialect retrieval dataset, dubbed\nWikiDIR, which consists of seven German dialects extracted from Wikipedia.\nUsing WikiDIR, we demonstrate the weakness of lexical methods in dealing with\nhigh lexical variation in dialects. We further show that commonly used\nzero-shot cross-lingual transfer approach with multilingual encoders do not\ntransfer well to extremely low-resource setups, motivating the need for\nresource-lean and dialect-specific retrieval models. We finally demonstrate\nthat (document) translation is an effective way to reduce the dialect gap in\nCDIR.\n",
  "subjects": [
    "Computer Science/Computation and Language",
    "Computer Science/Information Retrieval"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "4Fz_5TjVQRbE7roMb4m77N_CNXH4pv2dDWzNtjXO6GM",
  "pdfSize": "832298"
}