{"id":"2412.09712","title":"Investigating the Impact of Balancing, Filtering, and Complexity on\n  Predictive Multiplicity: A Data-Centric Perspective","authors":"Mustafa Cavus and Przemyslaw Biecek","authorsParsed":[["Cavus","Mustafa",""],["Biecek","Przemyslaw",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 20:14:45 GMT"}],"updateDate":"2024-12-16","timestamp":1734034485000,"abstract":"  The Rashomon effect presents a significant challenge in model selection. It\noccurs when multiple models achieve similar performance on a dataset but\nproduce different predictions, resulting in predictive multiplicity. This is\nespecially problematic in high-stakes environments, where arbitrary model\noutcomes can have serious consequences. Traditional model selection methods\nprioritize accuracy and fail to address this issue. Factors such as class\nimbalance and irrelevant variables further complicate the situation, making it\nharder for models to provide trustworthy predictions. Data-centric AI\napproaches can mitigate these problems by prioritizing data optimization,\nparticularly through preprocessing techniques. However, recent studies suggest\npreprocessing methods may inadvertently inflate predictive multiplicity. This\npaper investigates how data preprocessing techniques like balancing and\nfiltering methods impact predictive multiplicity and model stability,\nconsidering the complexity of the data. We conduct the experiments on 21\nreal-world datasets, applying various balancing and filtering techniques, and\nassess the level of predictive multiplicity introduced by these methods by\nleveraging the Rashomon effect. Additionally, we examine how filtering\ntechniques reduce redundancy and enhance model generalization. The findings\nprovide insights into the relationship between balancing methods, data\ncomplexity, and predictive multiplicity, demonstrating how data-centric AI\nstrategies can improve model performance.\n","subjects":["Statistics/Machine Learning","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"olQzVJrvu04WciPsmAN1Dpkb3N8kdLHh0gPtJvtDx44","pdfSize":"2261725"}