{"id":"2412.13869","title":"Decoherent Focusing Design and Advanced Passive Speckle Reduction for\n  Laser Illumination Systems","authors":"A. Lapchuk, O. Prygun, D. Manko, I. Gorbov, Y. Morozov","authorsParsed":[["Lapchuk","A.",""],["Prygun","O.",""],["Manko","D.",""],["Gorbov","I.",""],["Morozov","Y.",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 14:05:42 GMT"}],"updateDate":"2024-12-19","timestamp":1734530742000,"abstract":"  To effectively apply passive speckle reduction methods, it is essential to\nuse an illumination system that maximally exploits the non-ideal temporal\ncoherence and angular diversity (spatial coherence reduction) of laser light.\nThis study examines the necessary conditions for these factors to act\nindependently to achieve maximum speckle reduction. A novel design for\ndecoherent focusing of laser illumination into a rectangular, uniformly lit\nspot is proposed. The design is based on an array of rectangular prisms of\nvarying heights and a Fresnel lens comprising crossed 1D cylindrical Fresnel\nlenses with flat facets. Mathematical modelling demonstrates that such a lens\ncan effectively focus a Gaussian beam into a rectangular uniform illuminated\nspot, even for lenses with a high numerical aperture (NA = 0.2). A planar\nimplementation of this lens is also proposed. The comb-like spectrum of a laser\ndiode is shown to limit the capabilities of passive methods, as it is\nchallenging to generate a significant number of decorrelated laser sub-beams\nbeyond the available spectral modes. Experimental results confirm that applying\na slight modulation (~15%) to the laser diode current during intensity\nintegration transforms the comb spectrum into a continuous one. This enables\nthe generation of an unlimited number of decorrelated laser beams, independent\nof the laser's spectral modes, to achieve the desired number for a specific\noptical device.\n","subjects":["Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"x2sPeEKXbiLo2igeOsqnkIRxWFaRae6Ccrkoo8ta3KY","pdfSize":"1292837"}