{"id":"2412.16774","title":"Raft Distributed System for Multi-access Edge Computing Sharing\n  Resources","authors":"Zain Khaliq, Ahmed Refaey Hussein","authorsParsed":[["Khaliq","Zain",""],["Hussein","Ahmed Refaey",""]],"versions":[{"version":"v1","created":"Sat, 21 Dec 2024 21:04:21 GMT"}],"updateDate":"2024-12-24","timestamp":1734815061000,"abstract":"  Researchers all over the world are employing a variety of analysis approaches\nin attempt to provide a safer and faster solution for sharing resources via a\nMulti-access Edge Computing system. Multi-access Edge Computing (MEC) is a\njob-sharing method within the edge server network whose main aim is to maximize\nthe pace of the computing process, resulting in a more powerful and enhanced\nuser experience. Although there are many other options when it comes to\ndetermining the fastest method for computing processes, our paper introduces a\nrather more extensive change to the system model to assure no data loss and/or\ntask failure due to any scrutiny in the edge node cluster. RAFT, a powerful\nconsensus algorithm, can be used to introduce an auction theory approach in our\nsystem, which enables the edge device to make the best decision possible\nregarding how to respond to a request from the client. Through the use of the\nRAFT consensus, blockchain may be used to improve the safety, security, and\nefficiency of applications by deploying it on trustful edge base stations. In\naddition to discussing the best-distributed system approach for our (MEC)\nsystem, a Deep Deterministic Policy Gradient (DDPG) algorithm is also presented\nin order to reduce overall system latency. Assumed in our proposal is the\nexistence of a cluster of N Edge nodes, each containing a series of tasks that\nrequire execution. A DDPG algorithm is implemented in this cluster so that an\nauction can be held within the cluster of edge nodes to decide which edge node\nis best suited for performing the task provided by the client.\n","subjects":["Computer Science/Distributed, Parallel, and Cluster Computing","Computer Science/Emerging Technologies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"YFiGXhJ1q6fHyh4ubNTC3OxW3wxCzB2ROLJNb681R0c","pdfSize":"421856"}