{"id":"2412.05838","title":"A Collaborative Multi-Agent Approach to Retrieval-Augmented Generation\n  Across Diverse Data","authors":"Aniruddha Salve, Saba Attar, Mahesh Deshmukh, Sayali Shivpuje, and\n  Arnab Mitra Utsab","authorsParsed":[["Salve","Aniruddha",""],["Attar","Saba",""],["Deshmukh","Mahesh",""],["Shivpuje","Sayali",""],["Utsab","Arnab Mitra",""]],"versions":[{"version":"v1","created":"Sun, 8 Dec 2024 07:18:19 GMT"}],"updateDate":"2024-12-10","timestamp":1733642299000,"abstract":"  Retrieval-Augmented Generation (RAG) enhances Large Language Models (LLMs) by\nincorporating external, domain-specific data into the generative process. While\nLLMs are highly capable, they often rely on static, pre-trained datasets,\nlimiting their ability to integrate dynamic or private data. Traditional RAG\nsystems typically use a single-agent architecture to handle query generation,\ndata retrieval, and response synthesis. However, this approach becomes\ninefficient when dealing with diverse data sources, such as relational\ndatabases, document stores, and graph databases, often leading to performance\nbottlenecks and reduced accuracy. This paper proposes a multi-agent RAG system\nto address these limitations. Specialized agents, each optimized for a specific\ndata source, handle query generation for relational, NoSQL, and document-based\nsystems. These agents collaborate within a modular framework, with query\nexecution delegated to an environment designed for compatibility across various\ndatabase types. This distributed approach enhances query efficiency, reduces\ntoken overhead, and improves response accuracy by ensuring that each agent\nfocuses on its specialized task. The proposed system is scalable and adaptable,\nmaking it ideal for generative AI workflows that require integration with\ndiverse, dynamic, or private data sources. By leveraging specialized agents and\na modular execution environment, the system provides an efficient and robust\nsolution for handling complex, heterogeneous data environments in generative AI\napplications.\n","subjects":["Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"6pa8CK0t9Q7u4DcclYnu6pNdhd3h68n3VgAhPABlUbU","pdfSize":"1157800"}