{"id":"2412.18198","title":"Driving force of atomic ordering in Fe$_{1-x}$Pt$_{x}$, investigated by\n  density functional theory and machine-learning interatomic potentials Monte\n  Carlo simulations","authors":"Tomoyuki Tsuyama, Takeshi Kaneshita, Akira Matsui, Kohei Ochiai,\n  Hiroaki Tanaka, Ryohei Kondo, Takayuki Fukushima, Haruhisa Ohashi, Atsushi\n  Hashimoto, Yoshishige Okuno, and Jian-Gang Zhu","authorsParsed":[["Tsuyama","Tomoyuki",""],["Kaneshita","Takeshi",""],["Matsui","Akira",""],["Ochiai","Kohei",""],["Tanaka","Hiroaki",""],["Kondo","Ryohei",""],["Fukushima","Takayuki",""],["Ohashi","Haruhisa",""],["Hashimoto","Atsushi",""],["Okuno","Yoshishige",""],["Zhu","Jian-Gang",""]],"versions":[{"version":"v1","created":"Tue, 24 Dec 2024 06:09:05 GMT"}],"updateDate":"2024-12-25","timestamp":1735020545000,"abstract":"  We report the mechanisms of atomic ordering in Fe$_{1-x}$Pt$_{x}$ alloys\nusing density functional theory (DFT) and machine-learning interatomic\npotential Monte Carlo (MLIP-MC) simulations. We clarified that the formation\nenthalpy of the ordered phase was significantly enhanced by spin polarization\ncompared to that of the disordered phase. Analysis of the density of states\nindicated that coherence in local potentials in the ordered phase brings energy\ngain over the disordered phases, when spin is considered. MLIP-MC simulations\nwere performed to investigate the phase transition of atomic ordering at a\nfinite temperature. The model trained using the DFT dataset with spin\npolarization exhibited quantitatively good agreement with previous experiments\nand thermodynamic calculations across a wide range of Pt compositions, whereas\nthe model without spin significantly underestimated the transition temperature.\nThrough this study, we clarified that spin polarization is essential for\naccurately accounting for the ordered phase in Fe-Pt bimetallic alloys, even\nabove the Curie temperature, possibly because of the remaining short-range spin\norder.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"9ms2CRRB__UrlvqfiXbgg68jzVd7qCDAxFvraS2khls","pdfSize":"340097"}