{
  "id": "2412.06175",
  "title": "Classification of Periodic Variable Stars from TESS",
  "authors": "Xinyi Gao, Xiaodian Chen, Shu Wang, Jifeng Liu",
  "authorsParsed": [
    [
      "Gao",
      "Xinyi",
      ""
    ],
    [
      "Chen",
      "Xiaodian",
      ""
    ],
    [
      "Wang",
      "Shu",
      ""
    ],
    [
      "Liu",
      "Jifeng",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 03:14:48 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733714088000,
  "abstract": "  The number of known periodic variable stars has increased rapidly in recent\nyears. As an all-sky transit survey, the Transiting Exoplanet Survey Satellite\n(TESS) plays an important role in detecting low-amplitude variable stars. Using\n2-minute cadence data from the first 67 sectors of TESS, we find 72,505\nperiodic variable stars. We used 19 parameters including period, physical\nparameters, and light curve (LC) parameters to classify periodic variable stars\ninto 12 sub-types using random forest method. Pulsating variable stars and\neclipsing binaries are distinguished mainly by period, LC parameters and\nphysical parameters. GCAS, ROT, UV, YSO are distinguished mainly by period and\nphysical parameters. Compared to previously published catalogs, 63,106 periodic\nvariable stars (87.0$\\%$) are newly classified, including 13 Cepheids, 27 RR\nLyrae stars, $\\sim$4,600 $\\delta$ Scuti variable stars, $\\sim$1,600 eclipsing\nbinaries, $\\sim$34,000 rotational variable stars, and about 23,000 other types\nof variable stars. The purity of eclipsing binaries and pulsation variable\nstars ranges from 94.2$\\%$ to 99.4$\\%$ when compared to variable star catalogs\nof Gaia DR3 and ZTF DR2. The purity of ROT is relatively low at 83.3$\\%$. The\nincreasing number of variables stars is helpful to investigate the structure of\nthe Milky Way, stellar physics, and chromospheric activity.\n",
  "subjects": [
    "Astrophysics/Solar and Stellar Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "LBEYci0NkflJ2qTcV39EwTcgnV7fDmHygz72dBatGDk",
  "pdfSize": "6265885"
}