{
  "id": "2412.07950",
  "title": "An Obliquity Measurement of the Hot Neptune TOI-1694b",
  "authors": "Luke B. Handley, Andrew W. Howard, Ryan A. Rubenzahl, Fei Dai, Dakotah\n  Tyler, Rena A. Lee, Steven Giacalone, Howard Isaacson, Aaron Householder,\n  Samuel Halverson, Arpita Roy, and Josh Walawender",
  "authorsParsed": [
    [
      "Handley",
      "Luke B.",
      ""
    ],
    [
      "Howard",
      "Andrew W.",
      ""
    ],
    [
      "Rubenzahl",
      "Ryan A.",
      ""
    ],
    [
      "Dai",
      "Fei",
      ""
    ],
    [
      "Tyler",
      "Dakotah",
      ""
    ],
    [
      "Lee",
      "Rena A.",
      ""
    ],
    [
      "Giacalone",
      "Steven",
      ""
    ],
    [
      "Isaacson",
      "Howard",
      ""
    ],
    [
      "Householder",
      "Aaron",
      ""
    ],
    [
      "Halverson",
      "Samuel",
      ""
    ],
    [
      "Roy",
      "Arpita",
      ""
    ],
    [
      "Walawender",
      "Josh",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 22:30:43 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733869843000,
  "abstract": "  We present spectral observations of the multiplanet host TOI-1694 during the\ntransit of TOI-1694b, a 26.1 $M_\\oplus$ hot Neptune with a 3.77-day orbit. By\nanalyzing radial velocities obtained from the Keck Planet Finder, we modeled\nthe Rossiter-McLaughlin effect and constrained the sky-projected obliquity to\n${9\\degree}^{+22\\degree}_{-18\\degree}$, which is strong evidence for a nearly\naligned orbit. TOI-1694b is one of fewer than ten small planets accompanied by\nconfirmed outer giant planets for which the obliquity has been measured. We\nconsider the significance of the outer planet TOI-1694c, a Jupiter-mass planet\nwith a 1-year orbit, and its potential role in influencing the orbit of\nTOI-1694b to its current state. Incorporating our measurement, we discuss the\nbifurcation in hot Neptune obliquities and present evidence for an independent\npolar population. The observed polar planets nearly ubiquitously have periods\nof $\\le 6$ days and mass ratios of $10^{-4}$. Early perturbations by outer\ncompanions from resonance crossings in the disk-dispersal stage provide the\nmost compelling explanation for this population. Systems which lack the\nnecessary configuration will retain their primordial obliquity, since hot\nNeptunes lack the angular momentum needed to realign their hosts on relevant\ntimescales.\n",
  "subjects": [
    "Astrophysics/Earth and Planetary Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "GANcGg04v2T2glQoALs0D9DZv7MVAIio2mn6S5VcwdI",
  "pdfSize": "1567900"
}