{
  "id": "2412.08013",
  "title": "Consequences of magneto-electrical coupling in multiferroic\n  VSe$_{2}$$/$Sc$_{2}$CO$_{2}$ heterostructures",
  "authors": "Himangshu Sekhar Sarma, Subhradip Ghosh",
  "authorsParsed": [
    [
      "Sarma",
      "Himangshu Sekhar",
      ""
    ],
    [
      "Ghosh",
      "Subhradip",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 01:40:32 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733881232000,
  "abstract": "  Two-dimensional van der Waals heterostructures are potential game changers\nboth in understanding the fundamental physics and in the realization of various\ndevices that exploit magnetism at the nanoscale. Multiferroic heterostructures\ncomprising a two-dimensional ferroelectric and a two-dimensional ferromagnet\nare ideal candidates for electrical control of properties of the ferromagnets\nthat can lead to non-volatile memory devices, for example. Relatively new but\nimmensely promising two-dimensional materials, MXene and transition metal\ndichalcogenides, can be effectively combined to achieve the goal as both have\nflexibilities in their structures and compositions that are tunable. In this\nwork, using Density Functional Theory, we have investigated the\nmagneto-electric coupling driven transitions in the electronic ground states of\nVSe$_{2}$-Sc$_{2}$CO$_{2}$ bi-layer and tri-layer heterostructures. Our results\ndemonstrate that the change in the ferroelectric polarisation in the MXene\nlayer leads to changes in the spin-polarized band structures of the magnetic\ncomponent VSe$_{2}$ enabling a semiconductor to half-metal transition in these\nheterostructures. We propose several applications of this magneto-electric\ncoupling in these multiferroic heterostructures that can lead to the efficient\noperation of Field Effect transistors and achieve non-volatility in memory\ndevices at the nanoscale.\n",
  "subjects": [
    "Condensed Matter/Materials Science",
    "Condensed Matter/Mesoscale and Nanoscale Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "8Yw2MKrFyqpddIkOVumWANiQH0CG1ZGLA5UvlsE7prU",
  "pdfSize": "4442679"
}