{
  "id": "2412.07201",
  "title": "A Review on the Applications of Transformer-based language models for\n  Nucleotide Sequence Analysis",
  "authors": "Nimisha Ghosh, Daniele Santoni, Indrajit Saha, Giovanni Felici",
  "authorsParsed": [
    [
      "Ghosh",
      "Nimisha",
      ""
    ],
    [
      "Santoni",
      "Daniele",
      ""
    ],
    [
      "Saha",
      "Indrajit",
      ""
    ],
    [
      "Felici",
      "Giovanni",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 05:33:09 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733808789000,
  "abstract": "  In recent times, Transformer-based language models are making quite an impact\nin the field of natural language processing. As relevant parallels can be drawn\nbetween biological sequences and natural languages, the models used in NLP can\nbe easily extended and adapted for various applications in bioinformatics. In\nthis regard, this paper introduces the major developments of Transformer-based\nmodels in the recent past in the context of nucleotide sequences. We have\nreviewed and analysed a large number of application-based papers on this\nsubject, giving evidence of the main characterizing features and to different\napproaches that may be adopted to customize such powerful computational\nmachines. We have also provided a structured description of the functioning of\nTransformers, that may enable even first time users to grab the essence of such\ncomplex architectures. We believe this review will help the scientific\ncommunity in understanding the various applications of Transformer-based\nlanguage models to nucleotide sequences. This work will motivate the readers to\nbuild on these methodologies to tackle also various other problems in the field\nof bioinformatics.\n",
  "subjects": [
    "Computer Science/Computation and Language",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "hww2__7a-BMEf6dT649sDVKP7QW0IMRV8dxG5B0SrgE",
  "pdfSize": "930089"
}