{
  "id": "2412.14331",
  "title": "Detection of the Temperature Dependence of the White Dwarf Mass-Radius\n  Relation with Gravitational Redshifts",
  "authors": "Nicole R. Crumpler, Vedant Chandra, Nadia L. Zakamska, Gautham Adamane\n  Pallathadka, Stefan Arseneau, Nicola Gentile Fusillo, J. J. Hermes, Carles\n  Badenes, Priyanka Chakraborty, Boris T. G\\\"ansicke, and Stephen P. Schmidt",
  "authorsParsed": [
    [
      "Crumpler",
      "Nicole R.",
      ""
    ],
    [
      "Chandra",
      "Vedant",
      ""
    ],
    [
      "Zakamska",
      "Nadia L.",
      ""
    ],
    [
      "Pallathadka",
      "Gautham Adamane",
      ""
    ],
    [
      "Arseneau",
      "Stefan",
      ""
    ],
    [
      "Fusillo",
      "Nicola Gentile",
      ""
    ],
    [
      "Hermes",
      "J. J.",
      ""
    ],
    [
      "Badenes",
      "Carles",
      ""
    ],
    [
      "Chakraborty",
      "Priyanka",
      ""
    ],
    [
      "Gänsicke",
      "Boris T.",
      ""
    ],
    [
      "Schmidt",
      "Stephen P.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 20:58:59 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734555539000,
  "abstract": "  Models predict that the well-studied mass-radius relation of white dwarf\nstars depends on the temperature of the star, with hotter white dwarfs having\nlarger masses at a given radius than cooler stars. In this paper, we use a\ncatalog of 26,041 DA white dwarfs observed in Sloan Digital Sky Survey Data\nReleases 1-19. We measure the radial velocity, effective temperature, surface\ngravity, and radius for each object. By binning this catalog in radius or\nsurface gravity, we average out the random motion component of the radial\nvelocities for nearby white dwarfs to isolate the gravitational redshifts for\nthese objects and use them to directly measure the mass-radius relation. For\ngravitational redshifts measured from binning in either radius or surface\ngravity, we find strong evidence for a temperature-dependent mass-radius\nrelation, with warmer white dwarfs consistently having greater gravitational\nredshifts than cool objects at a fixed radius or surface gravity. For warm\nwhite dwarfs, we find that their mean radius is larger and mean surface gravity\nis smaller than those of cool white dwarfs at 5.2{\\sigma} and 6.0{\\sigma}\nsignificance, respectively. Selecting white dwarfs with similar radii or\nsurface gravities, the significance of the difference in mean gravitational\nredshifts between the warm and cool samples is >6.1{\\sigma} and >3.6{\\sigma}\nfor measurements binned in radius and surface gravity, respectively, in the\ndirection predicted by theory. This is an improvement over previous implicit\ndetections, and our technique can be expanded to precisely test the white dwarf\nmass-radius relation with future surveys.\n",
  "subjects": [
    "Astrophysics/Solar and Stellar Astrophysics",
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "hxuExRjy0SNjLifhlhvZRGj0v5G954lOaAVxxNo9p8I",
  "pdfSize": "1095007"
}