{
  "id": "2412.15101",
  "title": "Review-Then-Refine: A Dynamic Framework for Multi-Hop Question Answering\n  with Temporal Adaptability",
  "authors": "Xiangsen Chen, Xuming Hu, Nan Tang",
  "authorsParsed": [
    [
      "Chen",
      "Xiangsen",
      ""
    ],
    [
      "Hu",
      "Xuming",
      ""
    ],
    [
      "Tang",
      "Nan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 17:48:23 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734630503000,
  "abstract": "  Retrieve-augmented generation (RAG) frameworks have emerged as a promising\nsolution to multi-hop question answering(QA) tasks since it enables large\nlanguage models (LLMs) to incorporate external knowledge and mitigate their\ninherent knowledge deficiencies. Despite this progress, existing RAG\nframeworks, which usually follows the retrieve-then-read paradigm, often\nstruggle with multi-hop QA with temporal information since it has difficulty\nretrieving and synthesizing accurate time-related information. To address the\nchallenge, this paper proposes a novel framework called review-then-refine,\nwhich aims to enhance LLM performance in multi-hop QA scenarios with temporal\ninformation. Our approach begins with a review phase, where decomposed\nsub-queries are dynamically rewritten with temporal information, allowing for\nsubsequent adaptive retrieval and reasoning process. In addition, we implement\nadaptive retrieval mechanism to minimize unnecessary retrievals, thus reducing\nthe potential for hallucinations. In the subsequent refine phase, the LLM\nsynthesizes the retrieved information from each sub-query along with its\ninternal knowledge to formulate a coherent answer. Extensive experimental\nresults across multiple datasets demonstrate the effectiveness of our proposed\nframework, highlighting its potential to significantly improve multi-hop QA\ncapabilities in LLMs.\n",
  "subjects": [
    "Computer Science/Computation and Language"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "OtI9Y0IvMo6f01bxAx-8xCs6H5MYz_M8lThYZBrpuQo",
  "pdfSize": "17550473"
}