{
  "id": "2412.18387",
  "title": "Scaling Capability in Token Space: An Analysis of Large Vision Language\n  Model",
  "authors": "Tenghui Li and Guoxu Zhou and Xuyang Zhao and Qibin Zhao",
  "authorsParsed": [
    [
      "Li",
      "Tenghui",
      ""
    ],
    [
      "Zhou",
      "Guoxu",
      ""
    ],
    [
      "Zhao",
      "Xuyang",
      ""
    ],
    [
      "Zhao",
      "Qibin",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 24 Dec 2024 12:20:24 GMT"
    },
    {
      "version": "v2",
      "created": "Mon, 30 Dec 2024 11:00:35 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735042824000,
  "abstract": "  The scaling capability has been widely validated in neural language models\nwith respect to the number of parameters and the size of training data.\n  One important question is that does the scaling capability also exists\nsimilarly with respect to the number of vision tokens in large vision language\nModel?\n  This study fills the gap by investigating the relationship between the number\nof vision tokens and the performance on vision-language models.\n  Our theoretical analysis and empirical evaluations demonstrate that the model\nexhibits scalable performance \\(S(N_l)\\) with respect to the number of vision\ntokens \\(N_l\\), characterized by the relationship \\(S(N_l) \\approx\n(c/N_l)^{\\alpha}\\).\n  Furthermore, we also investigate the impact of a fusion mechanism that\nintegrates the user's question with vision tokens.\n  The results reveal two key findings.\n  First, the scaling capability remains intact with the incorporation of the\nfusion mechanism.\n  Second, the fusion mechanism enhances model performance, particularly when\nthe user's question is task-specific and relevant.\n  The analysis, conducted on fifteen diverse benchmarks spanning a broad range\nof tasks and domains, validates the effectiveness of the proposed approach.\n",
  "subjects": [
    "Computer Science/Artificial Intelligence",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "AzQU7XlvZK207zfDTf8qeFl37ArMdQP8nng5m3clQUI",
  "pdfSize": "7518126"
}