{
  "id": "2412.10184",
  "title": "Sims: An Interactive Tool for Geospatial Matching and Clustering",
  "authors": "Akram Zaytar, Girmaw Abebe Tadesse, Caleb Robinson, Eduardo G.\n  Bendito, Medha Devare, Meklit Chernet, Gilles Q. Hacheme, Rahul Dodhia, Juan\n  M. Lavista Ferres",
  "authorsParsed": [
    [
      "Zaytar",
      "Akram",
      ""
    ],
    [
      "Tadesse",
      "Girmaw Abebe",
      ""
    ],
    [
      "Robinson",
      "Caleb",
      ""
    ],
    [
      "Bendito",
      "Eduardo G.",
      ""
    ],
    [
      "Devare",
      "Medha",
      ""
    ],
    [
      "Chernet",
      "Meklit",
      ""
    ],
    [
      "Hacheme",
      "Gilles Q.",
      ""
    ],
    [
      "Dodhia",
      "Rahul",
      ""
    ],
    [
      "Ferres",
      "Juan M. Lavista",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 14:55:24 GMT"
    },
    {
      "version": "v2",
      "created": "Fri, 20 Dec 2024 15:49:47 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734101724000,
  "abstract": "  Acquiring, processing, and visualizing geospatial data requires significant\ncomputing resources, especially for large spatio-temporal domains. This\nchallenge hinders the rapid discovery of predictive features, which is\nessential for advancing geospatial modeling. To address this, we developed\nSimilarity Search (Sims), a no-code web tool that allows users to perform\nclustering and similarity search over defined regions of interest using Google\nEarth Engine as a backend. Sims is designed to complement existing modeling\ntools by focusing on feature exploration rather than model creation. We\ndemonstrate the utility of Sims through a case study analyzing simulated maize\nyield data in Rwanda, where we evaluate how different combinations of soil,\nweather, and agronomic features affect the clustering of yield response zones.\nSims is open source and available at https://github.com/microsoft/Sims\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Machine Learning",
    "Physics/Geophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "H8Ps-l16CbcOHirITbaUD-FY_MNBQ-Cdnj1LamDmHxM",
  "pdfSize": "14637257"
}