{
  "id": "2412.20743",
  "title": "Magnetic excitations and interactions in the Weyl ferrimagnet NdAlSi",
  "authors": "Chris J. Lygouras, Hung-Yu Yang, Xiaohan Yao, Jonathan Gaudet, Yiqing\n  Hao, Huibo Cao, Jose A. Rodriguez-Rivera, Andrey Podlesnyak, Stefan Bl\\\"ugel,\n  Predrag Nikoli\\'c, Fazel Tafti, and Collin L. Broholm",
  "authorsParsed": [
    [
      "Lygouras",
      "Chris J.",
      ""
    ],
    [
      "Yang",
      "Hung-Yu",
      ""
    ],
    [
      "Yao",
      "Xiaohan",
      ""
    ],
    [
      "Gaudet",
      "Jonathan",
      ""
    ],
    [
      "Hao",
      "Yiqing",
      ""
    ],
    [
      "Cao",
      "Huibo",
      ""
    ],
    [
      "Rodriguez-Rivera",
      "Jose A.",
      ""
    ],
    [
      "Podlesnyak",
      "Andrey",
      ""
    ],
    [
      "Blügel",
      "Stefan",
      ""
    ],
    [
      "Nikolić",
      "Predrag",
      ""
    ],
    [
      "Tafti",
      "Fazel",
      ""
    ],
    [
      "Broholm",
      "Collin L.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 30 Dec 2024 06:35:31 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735540531000,
  "abstract": "  Weyl fermions can arise from time-reversal symmetry-breaking magnetism, but\ntheir impact on magnetic order is a source of ongoing research. Using\nhigh-precision neutron diffraction and spectroscopy, we present a comprehensive\nexploration of the magnetic structure and excitation spectrum of Weyl semimetal\nand helical magnet NdAlSi. We use Luttinger-Tisza, classical mean-field, and\nrandom-phase approximation techniques to model the dispersive crystal field\nexcitons. We find extended-ranged and sign-changing interactions, suggesting a\ncoupling between conduction electrons and the local moments. We demonstrate\nthat low-symmetry anisotropic Dzyaloshinskii-Moriya interactions, in contrast\nwith higher-symmetry interactions enabled by Weyl fermions, play an important\nrole in stabilizing the complex spin spiral ground state of NdAlSi. Our work\nprovides a first detailed view of microscopic interactions in a Weyl magnet,\nand constrains the role of Weyl electrons and their chirality on the spiral\nmagnetism.\n",
  "subjects": [
    "Condensed Matter/Strongly Correlated Electrons"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "_1jfL1WXldmJU0hiJUsVgeubuQzmY1MIwMlZTLyg0CU",
  "pdfSize": "14223120"
}