{"id":"2412.06281","title":"Suspension Dynamics of Droplets in Acoustic and Gravitational Fields","authors":"Jeyapradhap Thirisangu, Anjan Mahapatra, and Karthick Subramani","authorsParsed":[["Thirisangu","Jeyapradhap",""],["Mahapatra","Anjan",""],["Subramani","Karthick",""]],"versions":[{"version":"v1","created":"Mon, 9 Dec 2024 08:01:34 GMT"}],"updateDate":"2024-12-10","timestamp":1733731294000,"abstract":"  In the field of acoustic suspension or levitation of droplets against\ngravity, the application of Gorkov's acoustic radiation force for small\nparticles (within the Rayleigh limit) or its extensions to larger ones (beyond\nthe Rayleigh limit) is limited to predicting the suspension position of the\ndroplet. Since this approach treats the droplet as a rigid particle, it fails\nto capture the fluid dynamics of the droplet and is also unsuitable for\nstudying interfacial phenomena such as droplet deformation, splitting, or\ncoalescence. In this work, we employ our recently developed acoustic body force\nin Eulerian form, which models the droplet as a fluid, to theoretically\ninvestigate the suspension dynamics of droplet subjected to standing waves\nthrough the interaction between acoustic, interfacial, and gravitational\nforces. Our theory predicts that when interfacial forces are dominant, the\npresence of positive and negative acoustic force regions within droplets\nexceeding the Rayleigh limit reduces the net acoustic force counteracting\ngravity. As a result, the suspension dynamics become highly dependent on\ndroplet size, in contrast to droplets within the Rayleigh limit, where the\ndynamics remain size-independent. Thus, beyond the Rayleigh limit, as the\ndroplet size to wavelength ratio increases, the critical acoustic energy\ndensity ($E_{cr}$) required to suspend the droplet initially rises sharply,\nwhich agrees with recent experimental results. After $E_{cr}$ reaches a local\nmaximum at $d/\\lambda \\approx 0.65$, it exhibits a pattern of alternating\ndecreases and increases, with each successive peak surpassing the previous one.\nRemarkably, our study reveals a size-dependent shifting of the suspension\nposition between nodes and antinodes for droplets beyond the Rayleigh limit,\nwhereas droplets within this limit maintain a consistent suspension position\nregardless of size.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"bWpoORwYy6cq32tk7_6XcNAU24weYmcsVfqQGCEQaAs","pdfSize":"5856861"}