{
  "id": "2412.03966",
  "title": "Demonstration Selection for In-Context Learning via Reinforcement\n  Learning",
  "authors": "Xubin Wang, Jianfei Wu, Yichen Yuan, Mingzhe Li, Deyu Cai, Weijia Jia",
  "authorsParsed": [
    [
      "Wang",
      "Xubin",
      ""
    ],
    [
      "Wu",
      "Jianfei",
      ""
    ],
    [
      "Yuan",
      "Yichen",
      ""
    ],
    [
      "Li",
      "Mingzhe",
      ""
    ],
    [
      "Cai",
      "Deyu",
      ""
    ],
    [
      "Jia",
      "Weijia",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 08:33:52 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733387632000,
  "abstract": "  Diversity in demonstration selection is crucial for enhancing model\ngeneralization, as it enables a broader coverage of structures and concepts.\nHowever, constructing an appropriate set of demonstrations has remained a focal\npoint of research. This paper presents the Relevance-Diversity Enhanced\nSelection (RDES), an innovative approach that leverages reinforcement learning\nto optimize the selection of diverse reference demonstrations for text\nclassification tasks using Large Language Models (LLMs), especially in few-shot\nprompting scenarios. RDES employs a Q-learning framework to dynamically\nidentify demonstrations that maximize both diversity and relevance to the\nclassification objective by calculating a diversity score based on label\ndistribution among selected demonstrations. This method ensures a balanced\nrepresentation of reference data, leading to improved classification accuracy.\nThrough extensive experiments on four benchmark datasets and involving 12\nclosed-source and open-source LLMs, we demonstrate that RDES significantly\nenhances classification accuracy compared to ten established baselines.\nFurthermore, we investigate the incorporation of Chain-of-Thought (CoT)\nreasoning in the reasoning process, which further enhances the model's\npredictive performance. The results underscore the potential of reinforcement\nlearning to facilitate adaptive demonstration selection and deepen the\nunderstanding of classification challenges.\n",
  "subjects": [
    "Computer Science/Artificial Intelligence",
    "Computer Science/Computation and Language"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "PxC-F0e2XgpsuGAJhuNJxS1NFAnAWe-kgX42RTnbNqY",
  "pdfSize": "1213358"
}