{
  "id": "2412.14820",
  "title": "Ultrastable optical frequency dissemination over a branching passive\n  optical network using CDMA",
  "authors": "Rodrigo Gonz\\'alez Escudero, Sougandh Kannoth Mavila, Jeroen C. J.\n  Koelemeij",
  "authorsParsed": [
    [
      "Escudero",
      "Rodrigo González",
      ""
    ],
    [
      "Mavila",
      "Sougandh Kannoth",
      ""
    ],
    [
      "Koelemeij",
      "Jeroen C. J.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 13:11:28 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734613888000,
  "abstract": "  We demonstrate a technique for ultrastable optical frequency dissemination in\na branching passive optical network using code-division multiple access (CDMA).\nIn our protocol, each network user employs a unique pseudo-random sequence to\nrapidly change the optical frequency among many distinct frequencies. After\ntransmission through the optical network, each user correlates the received\nsequence with the transmitted one, thus establishing a frequency-hopping spread\nspectrum technique that helps reject optical signals transmitted by other users\nin the network. Our method, which builds on the work by Schediwy et al. [Opt.\nLett. {\\bf 38}, 2893 (2013)], improves the frequency distribution network's\ncapacity, helps reject phase noise caused by intermediate optical back\nscattering, and simplifies the operational requirements. Using this protocol,\nwe show that a frequency instability better than ~$10^{-18}$ while having more\nthan 100 users operating in the network should be possible. Finally, we\ntheoretically explore the limits of this protocol and show that the\ndemonstrated stability does not suffer from any fundamental limitation. In the\nfuture, the CDMA method presented here could be used in complex time-frequency\ndistribution networks, allowing more users while, at the same time, reducing\nthe network's complexity.\n",
  "subjects": [
    "Physics/Optics",
    "Physics/Applied Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "0X7dnpufO_1bJh7BDMpzJufyuQG2BZ9eNBSyDSIYjME",
  "pdfSize": "639513"
}