{
  "id": "2412.19227",
  "title": "Multi-view Fake News Detection Model Based on Dynamic Hypergraph",
  "authors": "Rongping Ye, Xiaobing Pei",
  "authorsParsed": [
    [
      "Ye",
      "Rongping",
      ""
    ],
    [
      "Pei",
      "Xiaobing",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 26 Dec 2024 14:05:51 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735221951000,
  "abstract": "  With the rapid development of online social networks and the inadequacies in\ncontent moderation mechanisms, the detection of fake news has emerged as a\npressing concern for the public. Various methods have been proposed for fake\nnews detection, including text-based approaches as well as a series of\ngraph-based approaches. However, the deceptive nature of fake news renders\ntext-based approaches less effective. Propagation tree-based methods focus on\nthe propagation process of individual news, capturing pairwise relationships\nbut lacking the capability to capture high-order complex relationships. Large\nheterogeneous graph-based approaches necessitate the incorporation of\nsubstantial additional information beyond news text and user data, while\nhypergraph-based approaches rely on predefined hypergraph structures. To tackle\nthese issues, we propose a novel dynamic hypergraph-based multi-view fake news\ndetection model (DHy-MFND) that learns news embeddings across three distinct\nviews: text-level, propagation tree-level, and hypergraph-level. By employing\nhypergraph structures to model complex high-order relationships among multiple\nnews pieces and introducing dynamic hypergraph structure learning, we optimize\npredefined hypergraph structures while learning news embeddings. Additionally,\nwe introduce contrastive learning to capture authenticity-relevant embeddings\nacross different views. Extensive experiments on two benchmark datasets\ndemonstrate the effectiveness of our proposed DHy-MFND compared with a broad\nrange of competing baselines.\n",
  "subjects": [
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "wKceOcA57octipywmEYFDX10wwxded0QlkU_FJDfvXA",
  "pdfSize": "569383"
}