{
  "id": "2412.07153",
  "title": "From t-Product to t-STP of Cubic Matrices With Application to\n  Hyper-Networked Systems",
  "authors": "Daizhan Cheng, Zhengping Ji",
  "authorsParsed": [
    [
      "Cheng",
      "Daizhan",
      ""
    ],
    [
      "Ji",
      "Zhengping",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 03:22:06 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 11 Feb 2025 08:16:39 GMT"
    }
  ],
  "updateDate": "2025-02-12",
  "timestamp": 1733800926000,
  "abstract": "  From the perspective of dynamic (control) systems over cubic matrices, this\npaper proposes some new products on cubic matrices and uses them to construct\nlinear and nonlinear control systems over cubic matrices. First, the t-product\nof cubic matrices is surveyed, and some algebraic properties are investigated.\nWhen t-product based dynamic (control) systems are considered, its two\nweaknesses are found as follows: (i) it has rigorous dimension restriction;\n(ii) it is unable to formulate nonlinear (control) systems. Then the dimension\nkeeping semi-tensor product (DK-STP) of cubic matrices is proposed, which\novercomes the aforementioned weaknesses. Unfortunately, all subsystems,\ncorresponding to every frontal slides, of a DK-STP based dynamic (control)\nsystem are decoupled, which makes it unsuitable for formulating systems with\ncoupled subsystems. Finally, the t-STP, a combination of t-product with DK-STP,\nis presented. The t-STP related algebraic structures over cubic matrices, such\nas group, ring, module, and Lie group/Lie algebra, etc. are investigated.\nFinally, t-STP based dynamic (control) systems over cubic matrices are\nobtained, and its application to hyper-networked evolutionary games is\ninvestigated.\n",
  "subjects": [
    "Mathematics/Rings and Algebras"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "gOJxB9H47LGlWj_TEmpoQu__Oe5y0NTSBgcWh08YFoA",
  "pdfSize": "237357"
}