{"id":"2412.21068","title":"Finite Horizon Optimization: Framework and Applications","authors":"Yushun Zhang, Dmitry Rybin, Zhi-Quan Luo","authorsParsed":[["Zhang","Yushun",""],["Rybin","Dmitry",""],["Luo","Zhi-Quan",""]],"versions":[{"version":"v1","created":"Mon, 30 Dec 2024 16:35:47 GMT"}],"updateDate":"2024-12-31","timestamp":1735576547000,"abstract":"  In modern engineering scenarios, there is often a strict upper bound on the\nnumber of algorithm iterations that can be performed within a given time limit.\nThis raises the question of optimal algorithmic configuration for a fixed and\nfinite iteration budget. In this work, we introduce the framework of finite\nhorizon optimization, which focuses on optimizing the algorithm performance\nunder a strict iteration budget $T$. We apply this framework to linear\nprogramming (LP) and propose Finite Horizon stepsize rule for the primal-dual\nmethod. The main challenge in the stepsize design is controlling the singular\nvalues of $T$ cumulative product of non-symmetric matrices, which appears to be\na highly nonconvex problem, and there are very few helpful tools. Fortunately,\nin the special case of the primal-dual method, we find that the optimal\nstepsize design problem admits hidden convexity, and we propose a convex\nsemidefinite programming (SDP) reformulation. This SDP only involves matrix\nconstraints of size $4 \\times 4$ and can be solved efficiently in negligible\ntime. Theoretical acceleration guarantee is also provided at the pre-fixed\n$T$-th iteration, but with no asymptotic guarantee. On more than 90 real-world\nLP instances, Finite Horizon stepsize rule reaches an average 3.9$\\times$\nspeed-up over the optimal constant stepsize, saving 75\\% wall-clock time. Our\nnumerical results reveal substantial room for improvement when we abandon\nasymptotic guarantees, and instead focus on the performance under finite\nhorizon. We highlight that the benefits are not merely theoretical - they\ntranslate directly into computational speed-up on real-world problems.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"5ya0AqdmvplvBUHpwSoUDmMPfPwdwCvvoL9BE-D_tZY","pdfSize":"2806060"}