{
  "id": "2412.18874",
  "title": "IUST_PersonReId: A New Domain in Person Re-Identification Datasets",
  "authors": "Alireza Sedighi Moghaddam, Fatemeh Anvari, Mohammadjavad Mirshekari\n  Haghighi, Mohammadali Fakhari, Mohammad Reza Mohammadi",
  "authorsParsed": [
    [
      "Moghaddam",
      "Alireza Sedighi",
      ""
    ],
    [
      "Anvari",
      "Fatemeh",
      ""
    ],
    [
      "Haghighi",
      "Mohammadjavad Mirshekari",
      ""
    ],
    [
      "Fakhari",
      "Mohammadali",
      ""
    ],
    [
      "Mohammadi",
      "Mohammad Reza",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 25 Dec 2024 11:17:43 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735125463000,
  "abstract": "  Person re-identification (ReID) models often struggle to generalize across\ndiverse cultural contexts, particularly in Islamic regions like Iran, where\nmodest clothing styles are prevalent. Existing datasets predominantly feature\nWestern and East Asian fashion, limiting their applicability in these settings.\nTo address this gap, we introduce IUST_PersonReId, a dataset designed to\nreflect the unique challenges of ReID in new cultural environments, emphasizing\nmodest attire and diverse scenarios from Iran, including markets, campuses, and\nmosques. Experiments on IUST_PersonReId with state-of-the-art models, such as\nSolider and CLIP-ReID, reveal significant performance drops compared to\nbenchmarks like Market1501 and MSMT17, highlighting the challenges posed by\nocclusion and limited distinctive features. Sequence-based evaluations show\nimprovements by leveraging temporal context, emphasizing the dataset's\npotential for advancing culturally sensitive and robust ReID systems.\nIUST_PersonReId offers a critical resource for addressing fairness and bias in\nReID research globally. The dataset is publicly available at\nhttps://computervisioniust.github.io/IUST_PersonReId/.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "uGhiAZkeNYEU6XU4mdvjF0vT4iVaPUTlO75F_tvXiNI",
  "pdfSize": "2760869"
}