{
  "id": "2412.00552",
  "title": "Some remarks on Hayward-AdS black hole surrounded by a fluid of strings",
  "authors": "F. F. Nascimento, V. B. Bezerra, J. M. Toledo, G.A. Marques",
  "authorsParsed": [
    [
      "Nascimento",
      "F. F.",
      ""
    ],
    [
      "Bezerra",
      "V. B.",
      ""
    ],
    [
      "Toledo",
      "J. M.",
      ""
    ],
    [
      "Marques",
      "G. A.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 30 Nov 2024 18:34:38 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1732991678000,
  "abstract": "  We obtain a class of solutions corresponding to a generalization of the\nHayward black hole by solving the Einstein equations coupled to a particular\nnonlinear electromagnetic field. The generalization is realized by considering,\nadditionally, the presence of the cosmological constant and a source\ncorresponding to an anisotropic fluid, namely, a fluid of strings, that\nsurrounds the black hole. We show that the obtained class of solutions\npreserves or does not the regularity of the original Hayward black hole\nsolution, depending on the values of the parameter $\\beta$ which labels the\ndifferent solutions. We discuss the characteristics of the solutions, from the\npoint of view of the singularities of spacetime, by examining the behavior of\nthe Kretschmann scalar as well as of the geodesics concerning their\ncompleteness. We analyze some aspects of thermodynamics, particularizing one of\nthe solutions obtained, namely, for $\\beta =-1/2$, in which case the regularity\nof the Hayward black hole is preserved. Some thermodynamic quantities are\nobtained and analyzed, for example, pressure, heat capacity, and the critical\npoints, and we show how these quantities change for different values of the\nparameter $q$ associated with the original Hayward solution, as well as with\nthe parameter $b$ associated with the presence of the fluid of strings. The\nphase transitions are also analyzed by using the equation of state and the\nGibbs free energy.\n",
  "subjects": [
    "Physics/General Relativity and Quantum Cosmology"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "ehvmIthT0NO-ItHJ9qAWir9BO8c8bXFshZejbMBWsO4",
  "pdfSize": "1262812"
}