{
  "id": "2412.09576",
  "title": "Characterizing maximally many-body entangled fermionic states by using\n  $M$-body density matrix",
  "authors": "Irakli Giorgadze, Haixuan Huang, Jordan Gaines, Elio J. K\\\"onig, Jukka\n  I. V\\\"ayrynen",
  "authorsParsed": [
    [
      "Giorgadze",
      "Irakli",
      ""
    ],
    [
      "Huang",
      "Haixuan",
      ""
    ],
    [
      "Gaines",
      "Jordan",
      ""
    ],
    [
      "König",
      "Elio J.",
      ""
    ],
    [
      "Väyrynen",
      "Jukka I.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 18:53:28 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1734029608000,
  "abstract": "  Fermionic Hamiltonians play a critical role in quantum chemistry, one of the\nmost promising use cases for near-term quantum computers. However, since\nencoding nonlocal fermionic statistics using conventional qubits results in\nsignificant computational overhead, fermionic quantum hardware, such as fermion\natom arrays, were proposed as a more efficient platform. In this context, we\nhere study the many-body entanglement structure of fermionic $N$-particle\nstates by concentrating on $M$-body reduced density matrices (DMs) across\nvarious bipartitions in Fock space. The von Neumann entropy of the reduced DM\nis a basis independent entanglement measure which generalizes the traditional\nquantum chemistry concept of the one-particle DM entanglement, which\ncharacterizes how a single fermion is entangled with the rest. We carefully\nexamine upper bounds on the $M$-body entanglement, which are analogous to the\nvolume law of conventional entanglement measures. To this end we establish a\nconnection between $M$-body reduced DM and the mathematical structure of\nhypergraphs. Specifically, we show that a special class of hypergraphs, known\nas $t$-designs, corresponds to maximally entangled fermionic states. Finally,\nwe explore fermionic many-body entanglement in random states. We\nsemianalytically demonstrate that the distribution of reduced DMs associated\nwith random fermionic states corresponds to the trace-fixed Wishart-Laguerre\nrandom matrix ensemble. In the limit of large single-particle dimension $D$ and\na non-zero filling fraction, random states asymptotically become absolutely\nmaximally entangled.\n",
  "subjects": [
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "qOYNFTxxhjFRTAhbjaw7q8IRfzV2fmnTEfpOh32zyuU",
  "pdfSize": "1782966"
}