{
  "id": "2412.06695",
  "title": "DEEPER: Dense Electroencephalography Passage Retrieval",
  "authors": "Niall McGuire and Yashar Moshfeghi",
  "authorsParsed": [
    [
      "McGuire",
      "Niall",
      ""
    ],
    [
      "Moshfeghi",
      "Yashar",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 17:41:25 GMT"
    },
    {
      "version": "v2",
      "created": "Fri, 24 Jan 2025 15:37:53 GMT"
    }
  ],
  "updateDate": "2025-01-27",
  "timestamp": 1733766085000,
  "abstract": "  A fundamental challenge in Information Retrieval (IR) is the cognitive burden\nof translating internal information needs into explicit textual queries. This\ntranslation barrier particularly affects users with undefined information needs\nor those who face physical constraints in traditional text input methods. While\nBrain-Machine Interfaces (BMIs) have emerged as a potential solution for direct\nneural query interpretation, existing approaches that attempt to convert brain\nsignals into text queries have demonstrated limited success in capturing the\ncomplexity of neural semantic patterns. This paper introduces DEEPER Dense EEG\nPassage Retrieval, a novel framework that bypasses the need for explicit query\ntranslation by directly mapping electroencephalography (EEG) signals to\nrelevant text passages. Our approach employs dense retrieval architectures to\ncreate a unified semantic space where both EEG signals and text passages can be\neffectively compared. Experimental evaluation on the ZuCo dataset shows that\nDEEPER substantially outperforms current EEG-to-text baselines, achieving\nnearly 5x improvement in retrieval precision while demonstrating robust\nperformance across a diverse set of 30 participants. Through detailed ablation\nanalysis, we identify key architectural components, including specialized\nneural encoders and strategic negative sampling techniques, that enable\neffective cross-modal semantic alignment. Our findings demonstrate the\nfeasibility of direct EEG passage retrieval and suggest new possibilities for\ndeveloping IR systems that can more naturally interface with users' cognitive\nprocesses.\n",
  "subjects": [
    "Computer Science/Information Retrieval"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Cs2NnZm7DDcEhemQo--R2jl23nm_jsgb1_ns0D80Jno",
  "pdfSize": "2690926"
}