{
  "id": "2412.17939",
  "title": "Wetting-Layer-Assisted Synthesis of Inverted CdSe/PbSe Quantum Dots and\n  their Photophysical and Photo-Electrical Properties",
  "authors": "Vladimir Sayevich, Whi Dong Kim, Zachary L. Robinson, Oleg V. Kozlov,\n  Cl\\'ement Livache, Namyoung Ahn, Heeyoung Jung, Victor I. Klimov",
  "authorsParsed": [
    [
      "Sayevich",
      "Vladimir",
      ""
    ],
    [
      "Kim",
      "Whi Dong",
      ""
    ],
    [
      "Robinson",
      "Zachary L.",
      ""
    ],
    [
      "Kozlov",
      "Oleg V.",
      ""
    ],
    [
      "Livache",
      "Clément",
      ""
    ],
    [
      "Ahn",
      "Namyoung",
      ""
    ],
    [
      "Jung",
      "Heeyoung",
      ""
    ],
    [
      "Klimov",
      "Victor I.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 19:51:46 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1734983506000,
  "abstract": "  Heterostructured quantum dots (QDs) based on narrow-gap PbSe and wide-gap\nCdSe have been studied with an eye on their prospective applications in\nnear-infrared (NIR) light sources, photodetectors, and solar cells. The most\ncommon structural motif is a spherical QD comprising a PbSe core enclosed into\na CdSe shell. However, the potential barrier created by the CdSe shell\ncomplicates extraction of band-edge charge carriers from the QD. Therefore,\nconventional PbSe/CdSe QDs are not suitable for applications in practical\nphotoconversion devices. Here we report inverted CdSe/PbSe core/shell QDs that\novercome this drawback. In these structures, both photocarriers (electron and\nhole) exhibit a significant degree of shell localization and are therefore free\nto move within the QD solid and be extracted into an external circuit. To\ncreate such QDs, we employ a novel synthetic method in which a thin, atomically\ncontrolled wetting layer is used to homogenize the surface of the CdSe core and\nthus promote directionally uniform growth of the PbSe shell. Unlike noninverted\nQDs, inverted core/shell structures exhibit highly efficient photocarrier\ntransport, making them excellent candidates for applications in practical\nphotoconversion including photovoltaics, photodetection, and photochemistry.\n",
  "subjects": [
    "Condensed Matter/Mesoscale and Nanoscale Physics",
    "Condensed Matter/Materials Science"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "Q26DXW1djFX0qTT7oCwdoP73iTCdvM3xDIMQ402Kc7M",
  "pdfSize": "4787647"
}