{"id":"2412.08443","title":"POINTS1.5: Building a Vision-Language Model towards Real World\n  Applications","authors":"Yuan Liu and Le Tian and Xiao Zhou and Xinyu Gao and Kavio Yu and Yang\n  Yu and Jie Zhou","authorsParsed":[["Liu","Yuan",""],["Tian","Le",""],["Zhou","Xiao",""],["Gao","Xinyu",""],["Yu","Kavio",""],["Yu","Yang",""],["Zhou","Jie",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 15:08:25 GMT"}],"updateDate":"2024-12-12","timestamp":1733929705000,"abstract":"  Vision-language models have made significant strides recently, demonstrating\nsuperior performance across a range of tasks, e.g. optical character\nrecognition and complex diagram analysis. Building on this trend, we introduce\na new vision-language model, POINTS1.5, designed to excel in various real-world\napplications. POINTS1.5 is an enhancement of POINTS1.0 and incorporates several\nkey innovations: i) We replace the original CLIP vision encoder, which had a\nfixed image resolution, with a NaViT-style vision encoder that supports native\ndynamic high resolution. This allows POINTS1.5 to process images of any\nresolution without needing to split them into tiles. ii) We add bilingual\nsupport to POINTS1.5, significantly enhancing its capability in Chinese. Due to\nthe scarcity of open-source Chinese datasets for vision-language models, we\ncollect numerous images from the Internet and annotate them using a combination\nof manual and automatic methods. iii) We propose a set of rigorous filtering\nmethods for visual instruction tuning datasets. We comprehensively evaluate all\nthese filtering methods, and choose the most effective ones to obtain the final\nvisual instruction tuning set. Thanks to these innovations, POINTS1.5\nsignificantly outperforms POINTS1.0 and demonstrates strong performance across\na range of real-world applications. Notably, POINTS1.5-7B is trained on fewer\nthan 4 billion tokens and ranks first on the OpenCompass leaderboard among\nmodels with fewer than 10 billion parameters\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Multimedia"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"tg5yt4nRtGKIvCjB5kGyCtK-OP1c25Id8q8hn6M0T3o","pdfSize":"2286624"}