{
  "id": "2412.10265",
  "title": "Adversarial Robustness of Bottleneck Injected Deep Neural Networks for\n  Task-Oriented Communication",
  "authors": "Alireza Furutanpey and Pantelis A. Frangoudis and Patrik Szabo and\n  Schahram Dustdar",
  "authorsParsed": [
    [
      "Furutanpey",
      "Alireza",
      ""
    ],
    [
      "Frangoudis",
      "Pantelis A.",
      ""
    ],
    [
      "Szabo",
      "Patrik",
      ""
    ],
    [
      "Dustdar",
      "Schahram",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 16:33:36 GMT"
    }
  ],
  "updateDate": "2024-12-16",
  "timestamp": 1734107616000,
  "abstract": "  This paper investigates the adversarial robustness of Deep Neural Networks\n(DNNs) using Information Bottleneck (IB) objectives for task-oriented\ncommunication systems. We empirically demonstrate that while IB-based\napproaches provide baseline resilience against attacks targeting downstream\ntasks, the reliance on generative models for task-oriented communication\nintroduces new vulnerabilities. Through extensive experiments on several\ndatasets, we analyze how bottleneck depth and task complexity influence\nadversarial robustness. Our key findings show that Shallow Variational\nBottleneck Injection (SVBI) provides less adversarial robustness compared to\nDeep Variational Information Bottleneck (DVIB) approaches, with the gap\nwidening for more complex tasks. Additionally, we reveal that IB-based\nobjectives exhibit stronger robustness against attacks focusing on salient\npixels with high intensity compared to those perturbing many pixels with lower\nintensity. Lastly, we demonstrate that task-oriented communication systems that\nrely on generative models to extract and recover salient information have an\nincreased attack surface. The results highlight important security\nconsiderations for next-generation communication systems that leverage neural\nnetworks for goal-oriented compression.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Distributed, Parallel, and Cluster Computing",
    "Computer Science/Networking and Internet Architecture",
    "Electrical Engineering and Systems Science/Image and Video Processing"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "kaTz-dM_PjZkCCKqvSw75fKkn8Kmt8GN-6yaPJD234M",
  "pdfSize": "2271768"
}