{
  "id": "2412.06896",
  "title": "The Pristine Inner Galaxy Survey (PIGS) XI: Revealing the chemical\n  evolution of the interacting Sagittarius dwarf galaxy",
  "authors": "Sara Vitali, Alvaro Rojas-Arriagada, Paula Jofr\\'e, Federico Sestito,\n  Joshua Povick, Vanessa Hill, Emma Fern\\'andez-Alvar, Anke Ardern-Arentsen,\n  Pascale Jablonka, Nicolas F. Martin, Else Starkenburg, David Aguado",
  "authorsParsed": [
    [
      "Vitali",
      "Sara",
      ""
    ],
    [
      "Rojas-Arriagada",
      "Alvaro",
      ""
    ],
    [
      "Jofré",
      "Paula",
      ""
    ],
    [
      "Sestito",
      "Federico",
      ""
    ],
    [
      "Povick",
      "Joshua",
      ""
    ],
    [
      "Hill",
      "Vanessa",
      ""
    ],
    [
      "Fernández-Alvar",
      "Emma",
      ""
    ],
    [
      "Ardern-Arentsen",
      "Anke",
      ""
    ],
    [
      "Jablonka",
      "Pascale",
      ""
    ],
    [
      "Martin",
      "Nicolas F.",
      ""
    ],
    [
      "Starkenburg",
      "Else",
      ""
    ],
    [
      "Aguado",
      "David",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 19:00:07 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733770807000,
  "abstract": "  The Sagittarius dwarf spheroidal galaxy (Sgr dSph) is a satellite orbiting\nthe Milky Way that has experienced multiple stripping events due to tidal\ninteractions with our Galaxy. Its accretion history has led to a distinct\nstellar overdensity, which is the remnant of the core of the progenitor. We\npresent a complete chemical analysis of 111 giant stars in the core of Sgr dSph\nto investigate the chemical evolution and enrichment history of this satellite.\nEmploying the metallicity-sensitive Ca H&K photometry from the Pristine Inner\nGalaxy Survey, we selected stars spanning a wide metallicity range and obtained\nhigh-resolution spectra with the ESO FLAMES/GIRAFFE multi-object spectrograph.\nFor the stellar sample covering $-2.13 < \\rm{[Fe/H] < -0.35}$, we derived\nabundances for up to 14 chemical elements with average uncertainties of $\\sim\n0.09$ dex and a set of stellar ages which allowed us to build an\nage-metallicity relation (AMR) for the entire sample. With the most\ncomprehensive set of chemical species measured for the core of Sgr, we studied\nseveral [X/Fe] ratios. Most trends align closely with Galactic chemical trends,\nbut notable differences emerge in the heavy $n$-capture elements, which offer\nindependent insights into the star formation history of a stellar population.\nThe deficiency in the $\\alpha$-elements with respect the Milky Way suggests a\nslower, less efficient early star formation history, similar to other massive\nsatellites. $S$-process element patterns indicate significant enrichment from\nAGB stars over time. The AMR and chemical ratios point to an extended star\nformation history, with a rapid early phase in the first Gyr, followed by\ndeclining activity and later star-forming episodes. These findings are\nconsistent with Sgr hosting multiple stellar populations, from young ($\\sim 4$\nGyr) to old, metal-poor stars ($\\sim 10$ Gyr)\n",
  "subjects": [
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "ykkrm-c5ZaSfCXDjQSDHfUDGAwUzT0Q3_yUjF6QNxLc",
  "pdfSize": "2320117"
}