{
  "id": "2412.16607",
  "title": "Improving Discovery of Known Software Vulnerability For Enhanced\n  Cybersecurity",
  "authors": "Devesh Sawant and Manjesh K. Hanawal and Atul Kabra",
  "authorsParsed": [
    [
      "Sawant",
      "Devesh",
      ""
    ],
    [
      "Hanawal",
      "Manjesh K.",
      ""
    ],
    [
      "Kabra",
      "Atul",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 21 Dec 2024 12:43:52 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734785032000,
  "abstract": "  Software vulnerabilities are commonly exploited as attack vectors in\ncyberattacks. Hence, it is crucial to identify vulnerable software\nconfigurations early to apply preventive measures. Effective vulnerability\ndetection relies on identifying software vulnerabilities through standardized\nidentifiers such as Common Platform Enumeration (CPE) strings. However,\nnon-standardized CPE strings issued by software vendors create a significant\nchallenge. Inconsistent formats, naming conventions, and versioning practices\nlead to mismatches when querying databases like the National Vulnerability\nDatabase (NVD), hindering accurate vulnerability detection.\n  Failure to properly identify and prioritize vulnerable software complicates\nthe patching process and causes delays in updating the vulnerable software,\nthereby giving attackers a window of opportunity. To address this, we present a\nmethod to enhance CPE string consistency by implementing a multi-layered\nsanitization process combined with a fuzzy matching algorithm on data collected\nusing Osquery. Our method includes a union query with priority weighting, which\nassigns relevance to various attribute combinations, followed by a fuzzy\nmatching process with threshold-based similarity scoring, yielding higher\nconfidence in accurate matches. Comparative analysis with open-source tools\nsuch as FleetDM demonstrates that our approach improves detection accuracy by\n40%.\n",
  "subjects": [
    "Computer Science/Cryptography and Security"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "CtMODNq468AuBhxRwNFhOJAXs4dXAGJom1KY6VcyTvY",
  "pdfSize": "186791"
}