{
  "id": "2412.05558",
  "title": "WavFusion: Towards wav2vec 2.0 Multimodal Speech Emotion Recognition",
  "authors": "Feng Li, Jiusong Luo, Wanjun Xia",
  "authorsParsed": [
    [
      "Li",
      "Feng",
      ""
    ],
    [
      "Luo",
      "Jiusong",
      ""
    ],
    [
      "Xia",
      "Wanjun",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 7 Dec 2024 06:43:39 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733553819000,
  "abstract": "  Speech emotion recognition (SER) remains a challenging yet crucial task due\nto the inherent complexity and diversity of human emotions. To address this\nproblem, researchers attempt to fuse information from other modalities via\nmultimodal learning. However, existing multimodal fusion techniques often\noverlook the intricacies of cross-modal interactions, resulting in suboptimal\nfeature representations. In this paper, we propose WavFusion, a multimodal\nspeech emotion recognition framework that addresses critical research problems\nin effective multimodal fusion, heterogeneity among modalities, and\ndiscriminative representation learning. By leveraging a gated cross-modal\nattention mechanism and multimodal homogeneous feature discrepancy learning,\nWavFusion demonstrates improved performance over existing state-of-the-art\nmethods on benchmark datasets. Our work highlights the importance of capturing\nnuanced cross-modal interactions and learning discriminative representations\nfor accurate multimodal SER. Experimental results on two benchmark datasets\n(IEMOCAP and MELD) demonstrate that WavFusion succeeds over the\nstate-of-the-art strategies on emotion recognition.\n",
  "subjects": [
    "Computer Science/Sound",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Multimedia",
    "Electrical Engineering and Systems Science/Audio and Speech Processing"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "LW8lWy7s_CmElXTp929Dg0-uphtVb4Cd9JRAsDXw8TE",
  "pdfSize": "498597"
}