{
  "id": "2412.11877",
  "title": "Directional Swimming of B. Subtilis Bacteria Near a Switchable Polar\n  Surface",
  "authors": "Mahesha Kodithuwakku Arachchige, Zakaria Siddiquee, Hend Baza, Robert\n  Twieg, Oleg D. Lavrentovich, Antal J\\'akli",
  "authorsParsed": [
    [
      "Arachchige",
      "Mahesha Kodithuwakku",
      ""
    ],
    [
      "Siddiquee",
      "Zakaria",
      ""
    ],
    [
      "Baza",
      "Hend",
      ""
    ],
    [
      "Twieg",
      "Robert",
      ""
    ],
    [
      "Lavrentovich",
      "Oleg D.",
      ""
    ],
    [
      "Jákli",
      "Antal",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 15:27:30 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734362850000,
  "abstract": "  The dynamics of swimming bacteria depend on the properties of their habitat\nmedia. Recently it was shown that the motion of swimming bacteria dispersed\ndirectly in a non-toxic water-based lyotropic chromonic liquid crystal can be\ncontrolled by the director field of the liquid crystal. Here we investigate\nwhether the macroscopic polar order of a ferroelectric nematic liquid crystal\n(NF) can be recognized by bacteria B. Subtilis swimming in a water dispersion\nadjacent to a glassy NF film by surface interactions alone. We show that B.\nSubtilis tends to move in the direction antiparallel to the spontaneous\nelectric polarization at the NF surface. Their speed was found to be the same\nwith or without a polar NF layer. In contrast to observation on crystal\nferroelectric films, the bacteria do not get immobilized. These observations\nmay offer a pathway to creation of polar microinserts to direct bacterial\nmotion in-vivo.\n",
  "subjects": [
    "Condensed Matter/Soft Condensed Matter",
    "Condensed Matter/Materials Science",
    "Physics/Biological Physics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "julF-8hDpvtS5ShBX0CT-cdJRe3ULpnXfsqraznZdRo",
  "pdfSize": "6341766"
}