{
  "id": "2412.17700",
  "title": "MRANet: A Modified Residual Attention Networks for Lung and Colon Cancer\n  Classification",
  "authors": "Diponkor Bala, S M Rakib Ul Karim, Rownak Ara Rasul",
  "authorsParsed": [
    [
      "Bala",
      "Diponkor",
      ""
    ],
    [
      "Karim",
      "S M Rakib Ul",
      ""
    ],
    [
      "Rasul",
      "Rownak Ara",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 16:31:45 GMT"
    }
  ],
  "updateDate": "2025-01-28",
  "timestamp": 1734971505000,
  "abstract": "  Lung and colon cancers are predominant contributors to cancer mortality.\nEarly and accurate diagnosis is crucial for effective treatment. By utilizing\nimaging technology in different image detection, learning models have shown\npromise in automating cancer classification from histopathological images. This\nincludes the histopathological diagnosis, an important factor in cancer type\nidentification. This research focuses on creating a high-efficiency\ndeep-learning model for identifying lung and colon cancer from\nhistopathological images. We proposed a novel approach based on a modified\nresidual attention network architecture. The model was trained on a dataset of\n25,000 high-resolution histopathological images across several classes. Our\nproposed model achieved an exceptional accuracy of 99.30%, 96.63%, and 97.56%\nfor two, three, and five classes, respectively; those are outperforming other\nstate-of-the-art architectures. This study presents a highly accurate deep\nlearning model for lung and colon cancer classification. The superior\nperformance of our proposed model addresses a critical need in medical AI\napplications.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Image and Video Processing",
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "xUdvuuaJpTqdjCM2MTtcUiZZFnqmZZXO9S_JYBJx7m4",
  "pdfSize": "656984"
}