{"id":"2412.14469","title":"Who is Helping Whom? Student Concerns about AI- Teacher Collaboration in\n  Higher Education Classrooms","authors":"Bingyi Han, Simon Coghlan, George Buchanan, Dana McKay","authorsParsed":[["Han","Bingyi",""],["Coghlan","Simon",""],["Buchanan","George",""],["McKay","Dana",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 02:35:01 GMT"}],"updateDate":"2024-12-20","timestamp":1734575701000,"abstract":"  AI's integration into education promises to equip teachers with data-driven\ninsights and intervene in student learning. Despite the intended advancements,\nthere is a lack of understanding of interactions and emerging dynamics in\nclassrooms where various stakeholders including teachers, students, and AI,\ncollaborate. This paper aims to understand how students perceive the\nimplications of AI in Education in terms of classroom collaborative dynamics,\nespecially AI used to observe students and notify teachers to provide targeted\nhelp. Using the story completion method, we analyzed narratives from 65\nparticipants, highlighting three challenges: AI decontextualizing of the\neducational context; AI-teacher cooperation with bias concerns and power\ndisparities; and AI's impact on student behavior that further challenges AI's\neffectiveness. We argue that for effective and ethical AI-facilitated\ncooperative education, future AIEd design must factor in the situated nature of\nimplementation. Designers must consider the broader nuances of the education\ncontext, impacts on multiple stakeholders, dynamics involving these\nstakeholders, and the interplay among potential consequences for AI systems and\nstakeholders. It is crucial to understand the values in the situated context,\nthe capacity and limitations of both AI and humans for effective cooperation,\nand any implications to the relevant ecosystem.\n","subjects":["Computer Science/Computers and Society","Computer Science/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"48v4Hmtsg6cJEN4zY3RmMCxAHtqCW1UpfLAI6F0WqBE","pdfSize":"662653"}