{"id":"2412.01809","title":"Particle dynamics and the accretion disk around a Self-dual Black Hole\n  immersed in a magnetic field in Loop Quantum Gravity","authors":"Uktamjon Uktamov and Mirzabek Alloqulov and Sanjar Shaymatov and Tao\n  Zhu and Bobomurat Ahmedov","authorsParsed":[["Uktamov","Uktamjon",""],["Alloqulov","Mirzabek",""],["Shaymatov","Sanjar",""],["Zhu","Tao",""],["Ahmedov","Bobomurat",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 18:52:27 GMT"}],"updateDate":"2024-12-03","timestamp":1733165547000,"abstract":"  In this paper, we study the motion of magnetic dipoles and electrically\ncharged particles in the vicinity of a self-dual black hole in Loop Quantum\nGravity (LQG) immersed in an external asymptotically uniform magnetic field. We\nexplore the effects of the quantum correction parameter and electromagnetic\ninteractions on the particle geodesics. We derive the field equations and\ndetermine the electromagnetic four-vector potential for the case of a self-dual\nblack hole in LQG. We investigate the innermost stable circular orbits (ISCOs)\nfor both magnetic dipoles and electrically charged particles in detail,\ndemonstrating that the quantum correction parameter significantly influences on\nthe ISCO radius, causing it to shrink. Additionally, we show that the ISCO\nradius of magnetic dipoles is greater than that of electrically charged\nparticles due to the magnetic field interaction. We investigate the ISCO\nparameters (i.e., $r_{ISCO}$, $l_{ISCO}$, $\\mathcal{E}_{ISCO}$, $v_{ISCO}$, and\n$\\Omega_{ISCO}$) for magnetic dipoles and electrically charged particles,\nproviding detailed values. Furthermore, we examine the trajectories of charged\nparticles under various scenarios resulting from the quantum correction\nparameter $P$. Finally, analyzing the ISCO parameters that define the inner\nedge of the accretion disk, we explore the accretion disk around a self-dual\nblack hole in LQG. We delve into the electromagnetic radiation flux,\ntemperature, and differential luminosity as radiation properties of the\naccretion disk in detail. We show that the quantum correction parameter shifts\nthe profile of the electromagnetic flux and accretion disk temperature towards\nthe central object, leading to a slight increase in these quantities.\n","subjects":["Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"4NMEeDP1z0bhupOeYNIub0_pyYb-65pN0JgAnHAsoaI","pdfSize":"2104022"}