{
  "id": "2412.05590",
  "title": "Active Sequential Posterior Estimation for Sample-Efficient\n  Simulation-Based Inference",
  "authors": "Sam Griesemer, Defu Cao, Zijun Cui, Carolina Osorio, Yan Liu",
  "authorsParsed": [
    [
      "Griesemer",
      "Sam",
      ""
    ],
    [
      "Cao",
      "Defu",
      ""
    ],
    [
      "Cui",
      "Zijun",
      ""
    ],
    [
      "Osorio",
      "Carolina",
      ""
    ],
    [
      "Liu",
      "Yan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 7 Dec 2024 08:57:26 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733561846000,
  "abstract": "  Computer simulations have long presented the exciting possibility of\nscientific insight into complex real-world processes. Despite the power of\nmodern computing, however, it remains challenging to systematically perform\ninference under simulation models. This has led to the rise of simulation-based\ninference (SBI), a class of machine learning-enabled techniques for approaching\ninverse problems with stochastic simulators. Many such methods, however,\nrequire large numbers of simulation samples and face difficulty scaling to\nhigh-dimensional settings, often making inference prohibitive under\nresource-intensive simulators. To mitigate these drawbacks, we introduce active\nsequential neural posterior estimation (ASNPE). ASNPE brings an active learning\nscheme into the inference loop to estimate the utility of simulation parameter\ncandidates to the underlying probabilistic model. The proposed acquisition\nscheme is easily integrated into existing posterior estimation pipelines,\nallowing for improved sample efficiency with low computational overhead. We\nfurther demonstrate the effectiveness of the proposed method in the travel\ndemand calibration setting, a high-dimensional inverse problem commonly\nrequiring computationally expensive traffic simulators. Our method outperforms\nwell-tuned benchmarks and state-of-the-art posterior estimation methods on a\nlarge-scale real-world traffic network, as well as demonstrates a performance\nadvantage over non-active counterparts on a suite of SBI benchmark\nenvironments.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Statistics/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "nZZuAKfytTTI-zLj7-_9DoLxmcXri8vRllv4itQ9VTI",
  "pdfSize": "7810977"
}