{"id":"2412.05974","title":"Relativistic Electron Acceleration and the 'Ankle' Spectral Feature in\n  Earth's Magnetotail Reconnection","authors":"Weijie Sun, Mitsuo Oka, Marit {\\O}ieroset, Drew L. Turner, Tai Phan,\n  Ian J. Cohen, Xiaocan Li, Jia Huang, Andy Smith, James A. Slavin, Gangkai\n  Poh, Kevin J. Genestreti, Dan Gershman, Kyunghwan.Dokgo, Guan Le, Rumi\n  Nakamura, James L. Burch","authorsParsed":[["Sun","Weijie",""],["Oka","Mitsuo",""],["Øieroset","Marit",""],["Turner","Drew L.",""],["Phan","Tai",""],["Cohen","Ian J.",""],["Li","Xiaocan",""],["Huang","Jia",""],["Smith","Andy",""],["Slavin","James A.",""],["Poh","Gangkai",""],["Genestreti","Kevin J.",""],["Gershman","Dan",""],["Dokgo","Kyunghwan.",""],["Le","Guan",""],["Nakamura","Rumi",""],["Burch","James L.",""]],"versions":[{"version":"v1","created":"Sun, 8 Dec 2024 15:45:50 GMT"}],"updateDate":"2024-12-10","timestamp":1733672750000,"abstract":"  Electrons are accelerated to high, non-thermal energies during explosive\nenergy-release events in space, such as magnetic reconnection. However, the\nproperties and acceleration mechanisms of relativistic electrons directly\nassociated with reconnection X-line are not well understood. This study\nutilizes Magnetospheric Multiscale (MMS) measurements to analyze the flux and\nspectral features of sub-relativistic to relativistic (~ 80 to 560 keV)\nelectrons during a magnetic reconnection event in Earth's magnetotail. This\nevent provided a unique opportunity to measure the electrons directly energized\nby X-line as MMS stayed in the separatrix layer, where the magnetic field\ndirectly connects to the X-line, for approximately half of the observation\nperiod. Our analysis revealed that the fluxes of relativistic electrons were\nclearly enhanced within the separatrix layer, and the highest flux was directed\naway from the X-line, which suggested that these electrons originated directly\nfrom the X-line. Spectral analysis showed that these relativistic electrons\ndeviated from the main plasma sheet population and exhibited an \"ankle\" feature\nsimilar to that observed in galactic cosmic rays. The contribution of \"ankle\"\nelectrons to the total electron energy density increased from 0.1% to 1% in the\nseparatrix layer, though the spectral slopes did not exhibit clear variations.\nFurther analysis indicated that while these relativistic electrons originated\nfrom the X-line, they experienced a non-negligible degree of scattering during\ntransport. These findings provide clear evidence that magnetic reconnection in\nEarth's magnetotail can efficiently energize relativistic electrons directly at\nthe X-line, providing new insights into the complex processes governing\nelectron dynamics during magnetic reconnection.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Solar and Stellar Astrophysics","Physics/Space Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"nEpuwlBcKLrXcyyKeRTJb_UXUDFc4DNTZXN1HgMXyjA","pdfSize":"1989583"}