{
  "id": "2412.02436",
  "title": "Detection of a new GeV source in the outer region of the Coma cluster: a\n  signature of external accretion shock ?",
  "authors": "Xiao-Bin Chen, Kai Wang, Yi-Yun Huang, Hai-Ming Zhang, Shao-Qiang Xi,\n  Ruo-Yu Liu and Xiang-Yu Wang",
  "authorsParsed": [
    [
      "Chen",
      "Xiao-Bin",
      ""
    ],
    [
      "Wang",
      "Kai",
      ""
    ],
    [
      "Huang",
      "Yi-Yun",
      ""
    ],
    [
      "Zhang",
      "Hai-Ming",
      ""
    ],
    [
      "Xi",
      "Shao-Qiang",
      ""
    ],
    [
      "Liu",
      "Ruo-Yu",
      ""
    ],
    [
      "Wang",
      "Xiang-Yu",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 13:18:29 GMT"
    },
    {
      "version": "v2",
      "created": "Mon, 6 Jan 2025 03:08:42 GMT"
    }
  ],
  "updateDate": "2025-01-07",
  "timestamp": 1733231909000,
  "abstract": "  The supersonic flow motions associated with infall of baryonic gas toward\nsheets and filaments, as well as cluster mergers, produces large-scale shock\nwaves. The shocks associated with galaxy clusters can be classified mainly into\ntwo categories: internal shocks appear in the hot intracluster medium within\nthe viral radius, and external accretion shocks form in the outer cold region\nwell outside of the virial radius. Cosmic-ray (CR) electrons and/or protons\naccelerated by these shocks are expected to produce gamma-rays through\ninverse-Compton scatterings (ICS) or inelastic $pp$ collisions respectively.\nRecent studies have found a spatially extended GeV source within the virial\nradius, consistent with the internal shock origin. Here we report the detection\nof a new GeV source at a distance of about 2.8$^\\circ$ from the center of the\nComa cluster through the analysis of 16.2 years of Fermi-LAT data. The hard\nspectrum of the source, in agreement with the ICS origin, and its location in a\nlarge-scale filament of galaxies points to the external accretion shock origin.\nThe gamma-ray ($0.1-10^3$ GeV) luminosity of the source, $1.4\\times 10^{42}~\n{\\rm erg~s^{-1}}$, suggests that a fraction $\\sim 10^{-3}$ of the kinetic\nenergy flux through the shock-surface is transferred to relativistic CR\nelectrons.\n",
  "subjects": [
    "Astrophysics/High Energy Astrophysical Phenomena"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "G00bMbQd7HSm6F_2J4jSGb7u_Kti0mFq1TilVUb2DUg",
  "pdfSize": "975533"
}