{"id":"2412.08633","title":"MNIST-Fraction: Enhancing Math Education with AI-Driven Fraction\n  Detection and Analysis","authors":"Pegah Ahadian, Yunhe Feng, Karl Kosko, Richard Ferdig, Qiang Guan","authorsParsed":[["Ahadian","Pegah",""],["Feng","Yunhe",""],["Kosko","Karl",""],["Ferdig","Richard",""],["Guan","Qiang",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 18:56:28 GMT"}],"updateDate":"2024-12-12","timestamp":1733943388000,"abstract":"  Mathematics education, a crucial and basic field, significantly influences\nstudents' learning in related subjects and their future careers. Utilizing\nartificial intelligence to interpret and comprehend math problems in education\nis not yet fully explored. This is due to the scarcity of quality datasets and\nthe intricacies of processing handwritten information. In this paper, we\npresent a novel contribution to the field of mathematics education through the\ndevelopment of MNIST-Fraction, a dataset inspired by the renowned MNIST,\nspecifically tailored for the recognition and understanding of handwritten math\nfractions. Our approach is the utilization of deep learning, specifically\nConvolutional Neural Networks (CNNs), for the recognition and understanding of\nhandwritten math fractions to effectively detect and analyze fractions, along\nwith their numerators and denominators. This capability is pivotal in\ncalculating the value of fractions, a fundamental aspect of math learning. The\nMNIST-Fraction dataset is designed to closely mimic real-world scenarios,\nproviding a reliable and relevant resource for AI-driven educational tools.\nFurthermore, we conduct a comprehensive comparison of our dataset with the\noriginal MNIST dataset using various classifiers, demonstrating the\neffectiveness and versatility of MNIST-Fraction in both detection and\nclassification tasks. This comparative analysis not only validates the\npractical utility of our dataset but also offers insights into its potential\napplications in math education. To foster collaboration and further research\nwithin the computational and educational communities. Our work aims to bridge\nthe gap in high-quality educational resources for math learning, offering a\nvaluable tool for both educators and researchers in the field.\n","subjects":["Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"d-XvK11sToe137WdG4CJSWpvN0fxIlbJDU0VQPFSYfE","pdfSize":"1136192"}