{"id":"2412.05125","title":"Optimal control under uncertainty with joint chance state constraints:\n  almost-everywhere bounds, variance reduction, and application to (bi-)linear\n  elliptic PDEs","authors":"Rene Henrion, Georg Stadler and Florian Wechsung","authorsParsed":[["Henrion","Rene",""],["Stadler","Georg",""],["Wechsung","Florian",""]],"versions":[{"version":"v1","created":"Fri, 6 Dec 2024 15:33:05 GMT"}],"updateDate":"2024-12-09","timestamp":1733499185000,"abstract":"  We study optimal control of PDEs under uncertainty with the state variable\nsubject to joint chance constraints. The controls are deterministic, but the\nstates are probabilistic due to random variables in the governing equation.\nJoint chance constraints ensure that the random state variable meets pointwise\nbounds with high probability. For linear governing PDEs and elliptically\ndistributed random parameters, we prove existence and uniqueness results for\nalmost-everywhere state bounds. Using the spherical-radial decomposition (SRD)\nof the uncertain variable, we prove that when the probability is very large or\nsmall, the resulting Monte Carlo estimator for the chance constraint\nprobability exhibits substantially reduced variance compared to the standard\nMonte Carlo estimator. We further illustrate how the SRD can be leveraged to\nefficiently compute derivatives of the probability function, and discuss\ndifferent expansions of the uncertain variable in the governing equation.\nNumerical examples for linear and bilinear PDEs compare the performance of\nMonte Carlo and quasi-Monte Carlo sampling methods, examining probability\nestimation convergence as the number of samples increases. We also study how\nthe accuracy of the probabilities depends on the truncation of the random\nvariable expansion, and numerically illustrate the variance reduction of the\nSRD.\n","subjects":["Mathematics/Optimization and Control","Computer Science/Numerical Analysis","Mathematics/Numerical Analysis","Statistics/Computation"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"V1koYpKue6K63itIcFuYmAhMWzZwRE_bz8igNUnMBgc","pdfSize":"2000149"}