{
  "id": "2412.09765",
  "title": "L-WISE: Boosting Human Image Category Learning Through Model-Based Image\n  Selection And Enhancement",
  "authors": "Morgan B. Talbot, Gabriel Kreiman, James J. DiCarlo, and Guy Gaziv",
  "authorsParsed": [
    [
      "Talbot",
      "Morgan B.",
      ""
    ],
    [
      "Kreiman",
      "Gabriel",
      ""
    ],
    [
      "DiCarlo",
      "James J.",
      ""
    ],
    [
      "Gaziv",
      "Guy",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 23:57:01 GMT"
    }
  ],
  "updateDate": "2024-12-16",
  "timestamp": 1734047821000,
  "abstract": "  The currently leading artificial neural network (ANN) models of the visual\nventral stream -- which are derived from a combination of performance\noptimization and robustification methods -- have demonstrated a remarkable\ndegree of behavioral alignment with humans on visual categorization tasks.\nExtending upon previous work, we show that not only can these models guide\nimage perturbations that change the induced human category percepts, but they\nalso can enhance human ability to accurately report the original ground truth.\nFurthermore, we find that the same models can also be used out-of-the-box to\npredict the proportion of correct human responses to individual images,\nproviding a simple, human-aligned estimator of the relative difficulty of each\nimage. Motivated by these observations, we propose to augment visual learning\nin humans in a way that improves human categorization accuracy at test time.\nOur learning augmentation approach consists of (i) selecting images based on\ntheir model-estimated recognition difficulty, and (ii) using image\nperturbations that aid recognition for novice learners. We find that combining\nthese model-based strategies gives rise to test-time categorization accuracy\ngains of 33-72% relative to control subjects without these interventions,\ndespite using the same number of training feedback trials. Surprisingly, beyond\nthe accuracy gain, the training time for the augmented learning group was also\nshorter by 20-23%. We demonstrate the efficacy of our approach in a\nfine-grained categorization task with natural images, as well as tasks in two\nclinically relevant image domains -- histology and dermoscopy -- where visual\nlearning is notoriously challenging. To the best of our knowledge, this is the\nfirst application of ANNs to increase visual learning performance in humans by\nenhancing category-specific features.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Human-Computer Interaction"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "zUvfFeBpCp0R7U5GirKA4PvquQx3KDd9ot32oDF7XTM",
  "pdfSize": "17476652"
}