{
  "id": "2412.00922",
  "title": "Online convex optimization for constrained control of nonlinear systems",
  "authors": "Marko Nonhoff and Johannes K\\\"ohler and Matthias A. M\\\"uller",
  "authorsParsed": [
    [
      "Nonhoff",
      "Marko",
      ""
    ],
    [
      "Köhler",
      "Johannes",
      ""
    ],
    [
      "Müller",
      "Matthias A.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 1 Dec 2024 18:13:21 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733076801000,
  "abstract": "  This paper investigates the problem of controlling nonlinear dynamical\nsystems subject to state and input constraints while minimizing time-varying\nand a priori unknown cost functions. We propose a modular approach that\ncombines the online convex optimization framework and reference governors to\nsolve this problem. Our method is general in the sense that we do not limit our\nanalysis to a specific choice of online convex optimization algorithm or\nreference governor. We show that the dynamic regret of the proposed framework\nis bounded linearly in both the dynamic regret and the path length of the\nchosen online convex optimization algorithm, even though the online convex\noptimization algorithm does not account for the underlying dynamics. We prove\nthat a linear bound with respect to the online convex optimization algorithm's\ndynamic regret is optimal, i.e., cannot be improved upon. Furthermore, for a\nstandard class of online convex optimization algorithms, our proposed framework\nattains a bound on its dynamic regret that is linear only in the variation of\nthe cost functions, which is known to be an optimal bound. Finally, we\ndemonstrate implementation and flexibility of the proposed framework by\ncomparing different combinations of online convex optimization algorithms and\nreference governors to control a nonlinear chemical reactor in a numerical\nexperiment.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Systems and Control",
    "Computer Science/Systems and Control",
    "Mathematics/Optimization and Control"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "n0vrudIVc56b04R1tCeWO-8IRnK4ScZ4zuz7IhoBzWg",
  "pdfSize": "595170"
}