{"id":"2412.12402","title":"Perturbation theory scope for predicting vibronic selectivity by\n  entangled two photon absorption","authors":"C. D. Rodriguez-Camargo, H. O. Gestsson, C. Nation, A. R. Jones, A.\n  Olaya-Castro","authorsParsed":[["Rodriguez-Camargo","C. D.",""],["Gestsson","H. O.",""],["Nation","C.",""],["Jones","A. R.",""],["Olaya-Castro","A.",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 23:13:41 GMT"}],"updateDate":"2024-12-18","timestamp":1734390821000,"abstract":"  Using second-order perturbation theory in the light-matter interaction, we\nderive an analytical approximation for the vibronic populations of a diatomic\nsystem excited by ultrabroadband frequency entangled photons and evaluate the\npopulation dynamics for different degrees of entanglement between photon pairs.\nOur analytical approach make the same predictions as previously derived via\nnumerical solutions of the complete Schr\\\"odinger equation [H. Oka, Physical\nReview A 97, 063859 (2018)], with the added advantage of providing clear\nphysical insights into the vibronic selectivity as a function of the degree of\nphoton correlations while requiring significantly reduced computational effort.\nSpecifically, our analytical expression for the probability of vibronic\nexcitation includes a factor which predicts the enhancement of vibrational\nselectivity as a function of the degree correlation between the entangled\nphoton pairs, the targeted vibrational energy level, and the vibrational\nmolecular structure encoded in the Franck-Condon factors. Our results\nillustrate the importance of going beyond the usual approximations in\nsecond-order perturbation theory to capture the relevance of the vibrational\nstructure of the molecular system of interest in order to gain a deeper\nunderstanding of the possible quantum-enhancement provided by the interaction\nbetween quantum light and matter.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"YPKqfKucdwtAPaoZ9dGG7MWljUtSkUZqB3DmGjeqaWA","pdfSize":"5020585"}