{
  "id": "2412.04471",
  "title": "PaintScene4D: Consistent 4D Scene Generation from Text Prompts",
  "authors": "Vinayak Gupta, Yunze Man, Yu-Xiong Wang",
  "authorsParsed": [
    [
      "Gupta",
      "Vinayak",
      ""
    ],
    [
      "Man",
      "Yunze",
      ""
    ],
    [
      "Wang",
      "Yu-Xiong",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 18:59:57 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733425197000,
  "abstract": "  Recent advances in diffusion models have revolutionized 2D and 3D content\ncreation, yet generating photorealistic dynamic 4D scenes remains a significant\nchallenge. Existing dynamic 4D generation methods typically rely on distilling\nknowledge from pre-trained 3D generative models, often fine-tuned on synthetic\nobject datasets. Consequently, the resulting scenes tend to be object-centric\nand lack photorealism. While text-to-video models can generate more realistic\nscenes with motion, they often struggle with spatial understanding and provide\nlimited control over camera viewpoints during rendering. To address these\nlimitations, we present PaintScene4D, a novel text-to-4D scene generation\nframework that departs from conventional multi-view generative models in favor\nof a streamlined architecture that harnesses video generative models trained on\ndiverse real-world datasets. Our method first generates a reference video using\na video generation model, and then employs a strategic camera array selection\nfor rendering. We apply a progressive warping and inpainting technique to\nensure both spatial and temporal consistency across multiple viewpoints.\nFinally, we optimize multi-view images using a dynamic renderer, enabling\nflexible camera control based on user preferences. Adopting a training-free\narchitecture, our PaintScene4D efficiently produces realistic 4D scenes that\ncan be viewed from arbitrary trajectories. The code will be made publicly\navailable. Our project page is at https://paintscene4d.github.io/\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "FCbst7ZbsvZCg5EPcDYL1nbM2B6KYyfbuCmSGTzCLLA",
  "pdfSize": "8499886"
}