{
  "id": "2412.19354",
  "title": "Federated Hybrid Training and Self-Adversarial Distillation: Towards\n  Robust Edge Networks",
  "authors": "Yu Qiao, Apurba Adhikary, Kitae Kim, Eui-Nam Huh, Zhu Han, Choong Seon\n  Hong",
  "authorsParsed": [
    [
      "Qiao",
      "Yu",
      ""
    ],
    [
      "Adhikary",
      "Apurba",
      ""
    ],
    [
      "Kim",
      "Kitae",
      ""
    ],
    [
      "Huh",
      "Eui-Nam",
      ""
    ],
    [
      "Han",
      "Zhu",
      ""
    ],
    [
      "Hong",
      "Choong Seon",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 26 Dec 2024 21:32:08 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735248728000,
  "abstract": "  Federated learning (FL) is a distributed training technology that enhances\ndata privacy in mobile edge networks by allowing data owners to collaborate\nwithout transmitting raw data to the edge server. However, data heterogeneity\nand adversarial attacks pose challenges to develop an unbiased and robust\nglobal model for edge deployment. To address this, we propose Federated hyBrid\nAdversarial training and self-adversarial disTillation (FedBAT), a new\nframework designed to improve both robustness and generalization of the global\nmodel. FedBAT seamlessly integrates hybrid adversarial training and\nself-adversarial distillation into the conventional FL framework from data\naugmentation and feature distillation perspectives. From a data augmentation\nperspective, we propose hybrid adversarial training to defend against\nadversarial attacks by balancing accuracy and robustness through a weighted\ncombination of standard and adversarial training. From a feature distillation\nperspective, we introduce a novel augmentation-invariant adversarial\ndistillation method that aligns local adversarial features of augmented images\nwith their corresponding unbiased global clean features. This alignment can\neffectively mitigate bias from data heterogeneity while enhancing both the\nrobustness and generalization of the global model. Extensive experimental\nresults across multiple datasets demonstrate that FedBAT yields comparable or\nsuperior performance gains in improving robustness while maintaining accuracy\ncompared to several baselines.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "jkkfJg7VbFMP-uc0l5_f8wOMmiLBFlcpj1uxhqAEkGA",
  "pdfSize": "1336785"
}