{
  "id": "2412.01994",
  "title": "Measuring the expansion history of the Universe with cosmic chronometers",
  "authors": "Michele Moresco",
  "authorsParsed": [
    [
      "Moresco",
      "Michele",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 22:04:01 GMT"
    }
  ],
  "updateDate": "2024-12-04",
  "timestamp": 1733177041000,
  "abstract": "  As revealed by Hubble in 1928, our Universe is expanding. This discovery was\nfundamental to widening our horizons and our conception of space, and since\nthen determining the rate at which our Universe is expanding has become one of\nthe crucial measurements in cosmology. At the beginning of this century, these\nmeasurements revealed the unexpected behavior that this expansion is\naccelerating and allowed us to have a first glimpse of the dark components that\nconstitute $\\sim$95\\% of our Universe. Cosmic chronometers represent a novel\ntechnique to obtain a cosmology-independent determination of the expansion of\nthe Universe, based on the differential age dating of a population of very\nmassive and passively evolving galaxies. Currently, with this new cosmological\nprobe it is possible to constrain the Hubble parameter with an accuracy of\naround 5\\% at $z\\sim0.5$ up to 10-20\\% at $z\\sim2$. In this Chapter, the cosmic\nchronometers approach is presented, describing the method and how an optimal\nsample can be selected; it is then discussed how the most recent measurements\nof the expansion history of the Universe have been obtained with this approach,\nas well as the cosmological constraints that can be derived. Particular\nattention will be given to the systematics involved in this approach and the\ntreatment to properly take them into account. We conclude by presenting\nforecasts that show how future spectroscopic surveys will significantly boost\nthe accuracy of this method and open the possibility to a percent determination\nof the Hubble constant, making cosmic chronometers a powerful independent tool\nto derive information on the expansion history of the Universe.\n",
  "subjects": [
    "Astrophysics/Cosmology and Nongalactic Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "_JIjd48Y6lRJ4UB7f3-IHpnFdRy8865HfAM6PMPkdeA",
  "pdfSize": "2893480"
}