{"id":"2412.19153","title":"Sketch-MoMa: Teleoperation for Mobile Manipulator via Interpretation of\n  Hand-Drawn Sketches","authors":"Kosei Tanada, Yuka Iwanaga, Masayoshi Tsuchinaga, Yuji Nakamura,\n  Takemitsu Mori, Remi Sakai and Takashi Yamamoto","authorsParsed":[["Tanada","Kosei",""],["Iwanaga","Yuka",""],["Tsuchinaga","Masayoshi",""],["Nakamura","Yuji",""],["Mori","Takemitsu",""],["Sakai","Remi",""],["Yamamoto","Takashi",""]],"versions":[{"version":"v1","created":"Thu, 26 Dec 2024 10:17:21 GMT"},{"version":"v2","created":"Wed, 1 Jan 2025 14:33:33 GMT"},{"version":"v3","created":"Tue, 7 Jan 2025 13:41:26 GMT"}],"updateDate":"2025-01-08","timestamp":1735208241000,"abstract":"  To use assistive robots in everyday life, a remote control system with common\ndevices, such as 2D devices, is helpful to control the robots anytime and\nanywhere as intended. Hand-drawn sketches are one of the intuitive ways to\ncontrol robots with 2D devices. However, since similar sketches have different\nintentions from scene to scene, existing work needs additional modalities to\nset the sketches' semantics. This requires complex operations for users and\nleads to decreasing usability. In this paper, we propose Sketch-MoMa, a\nteleoperation system using the user-given hand-drawn sketches as instructions\nto control a robot. We use Vision-Language Models (VLMs) to understand the\nuser-given sketches superimposed on an observation image and infer drawn shapes\nand low-level tasks of the robot. We utilize the sketches and the generated\nshapes for recognition and motion planning of the generated low-level tasks for\nprecise and intuitive operations. We validate our approach using\nstate-of-the-art VLMs with 7 tasks and 5 sketch shapes. We also demonstrate\nthat our approach effectively specifies the detailed motions, such as how to\ngrasp and how much to rotate. Moreover, we show the competitive usability of\nour approach compared with the existing 2D interface through a user experiment\nwith 14 participants.\n","subjects":["Computer Science/Robotics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"if77E7BklMirc-QJUbkzQysV0fGI614LmWTGhC7CXB0","pdfSize":"1923198"}