{"id":"2412.07528","title":"Film Thickness Gauge Based on Interferometric Principle of Y-shaped\n  Optical Fiber","authors":"Juntao He, Yikai Dang, Haoqi Wang, Shaohua Wang, Yingke Li, Ruiyun Ma,\n  Yingyuan Li, Peilin Gao, Jianguo Cao, Yong Pan","authorsParsed":[["He","Juntao",""],["Dang","Yikai",""],["Wang","Haoqi",""],["Wang","Shaohua",""],["Li","Yingke",""],["Ma","Ruiyun",""],["Li","Yingyuan",""],["Gao","Peilin",""],["Cao","Jianguo",""],["Pan","Yong",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 14:04:55 GMT"}],"updateDate":"2024-12-11","timestamp":1733839495000,"abstract":"  In this paper, a thin film thickness gauge based on the interferometric\nprinciple of Y-shaped optical fiber is proposed to achieve accurate measurement\nof film thickness. In this paper, the optical fiber, the interferometric\nprinciple and the film thickness calculation principle are introduced, and the\ninterferometric thickness measurement system based on Y-shaped optical fiber is\nconstructed. The system uses the special structure of Y-shaped optical fiber to\ntransmit the optical signal generated by the light source to the surface of the\nthin film, and obtains coherent optical signals of different wavelengths\nthrough reflection and interference. The spectrometer is used to receive and\ninterpret these interference signals, and the thickness of the film is\ncalculated according to the wavelength difference of the peak positions of the\nadjacent stages, combined with the refractive index of the film. In the\nspecific design, the paper elaborates on the design of each part of the\ninstrument, including the selection and parameter setting of the light source,\nY-fiber and spectrometer. Among them, the Y-shaped optical fiber, as the core\ncomponent of the instrument, has the function of transmitting optical signals\nand detecting optical signals on the surface of thin films. At the same time,\nthe paper also introduces the housing packaging and internal assembly process\nof the instrument to ensure the portability and stability of the instrument.\nThe results show that the thickness gauge has high measurement accuracy and\nstability, which can meet the needs of practical applications.\n","subjects":["Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"6crMYLkL2k5NhPG3AhK0EREdVdPu09OJqJ39lR_oOzQ","pdfSize":"662466"}