{"id":"2412.02726","title":"Electrically Interconnected Platinum Nanonetworks for Flexible\n  Electronics","authors":"Sherjeel Mahmood Baig, Hideki Abe","authorsParsed":[["Baig","Sherjeel Mahmood",""],["Abe","Hideki",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 00:42:48 GMT"}],"updateDate":"2024-12-05","timestamp":1733186568000,"abstract":"  Flexible electronics are attracting attention due to the increasing demand\nfor lightweight, bendable devices that can conform to various surfaces,\nincluding human skin. Although indium tin oxide (ITO) is widely used for\nelectrical interconnection in flexible electronics, its brittleness limits its\ndurability under repeated bending. In this study, we introduce platinum (Pt)\nnanonetworks as an alternative to ITO, offering superior electrical stability\nunder intense and repeated bending conditions. Electrically interconnected Pt\nnanonetworks, with an average thickness below 50 nm, are fabricated on\npolyimide (PI) substrates through an atmospheric treatment that promotes\nnanophase separation in thin deposition films of a platinum-cerium (Pt-Ce)\nalloy, creating a nanotexture of Pt and insulating cerium dioxide (CeO2). The\nresulting Pt nanonetworks on PI exhibit high mechanical flexibility,\nmaintaining a sheet resistance of approximately 2.76 kohm/sq even after 1000\nbending cycles at varying diameters, down to 1.5 mm. Detailed characterization\nreveals critical temperature and time thresholds in the atmospheric treatment\nnecessary to form interconnected Pt nanonetworks on solid surfaces:\ninterconnected nanonetworks form at lower temperatures and shorter treatment\ntimes, while higher temperatures and longer treatments lead to disconnected Pt\nnanoislands. LCR (Inductance, Capacitance, and Resistance) measurements further\nshow that the interconnected Pt nanonetworks exhibit inductor-like electrical\nresponses, while disconnected Pt nanoislands display capacitor-like behavior.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"GRpSoNJg4JYfe_Vt4lr8sBiY3GNMgSaZoYfJD4DEvbc","pdfSize":"927169"}