{
  "id": "2412.11909",
  "title": "Playground of Lognormal Seminumerical Simulations of~the~Lyman~$\\alpha$\n  Forest: Thermal History of the Intergalactic Medium",
  "authors": "Tomas Ondro, Bhaskar Arya and Rudolf Galis",
  "authorsParsed": [
    [
      "Ondro",
      "Tomas",
      ""
    ],
    [
      "Arya",
      "Bhaskar",
      ""
    ],
    [
      "Galis",
      "Rudolf",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 15:54:23 GMT"
    },
    {
      "version": "v2",
      "created": "Mon, 23 Dec 2024 11:00:54 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734364463000,
  "abstract": "  This study aims to test a potential application of lognormal seminumerical\nsimulations to recover the thermal parameters and Jeans length. This could be\nsuitable for generating large number of synthetic spectra with various input\ndata and parameters, and thus ideal for interpreting the high-quality data\nobtained from QSO absorption spectra surveys. We use a seminumerical approach\nto simulate absorption spectra of quasars at redshifts $ 3 \\leq z \\leq 5$.\nThese synthetic spectra are compared with the 1D flux power spectra and using\nthe Markov Chain Monte Carlo analysis method we determine the temperature at\nmean density, slope of the temperature-density relation and Jeans length. Our\nbest-fit model is also compared with the evolution of the temperature of the\nintergalactic medium from various UVB models. We show that the lognormal\nsimulations can effectively recover thermal parameters and Jeans length.\nBesides, by comparing the synthetic flux power spectra with observations from\nBaryon Oscillation Spectroscopy Survey we found, that such an approach can be\nalso used for the cosmological parameter inference.\n",
  "subjects": [
    "Astrophysics/Cosmology and Nongalactic Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "qOSybB3rKSMc_agZgC1cuhaOfweECYdq1PNhgx272FY",
  "pdfSize": "5731656"
}