{"id":"2412.02605","title":"Interpretable Company Similarity with Sparse Autoencoders","authors":"Marco Molinari, Victor Shao, Vladimir Tregubiak, Abhimanyu Pandey,\n  Mateusz Mikolajczak, Sebastian Kuznetsov Ryder Torres Pereira","authorsParsed":[["Molinari","Marco",""],["Shao","Victor",""],["Tregubiak","Vladimir",""],["Pandey","Abhimanyu",""],["Mikolajczak","Mateusz",""],["Pereira","Sebastian Kuznetsov Ryder Torres",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 17:34:50 GMT"},{"version":"v2","created":"Tue, 10 Dec 2024 23:41:53 GMT"}],"updateDate":"2024-12-12","timestamp":1733247290000,"abstract":"  Determining company similarity is a vital task in finance, underpinning\nhedging, risk management, portfolio diversification, and more. Practitioners\noften rely on sector and industry classifications to gauge similarity, such as\nSIC-codes and GICS-codes - the former being used by the U.S. Securities and\nExchange Commission (SEC), and the latter widely used by the investment\ncommunity. Since these classifications can lack granularity and often need to\nbe updated, using clusters of embeddings of company descriptions has been\nproposed as a potential alternative, but the lack of interpretability in token\nembeddings poses a significant barrier to adoption in high-stakes contexts.\nSparse Autoencoders (SAEs) have shown promise in enhancing the interpretability\nof Large Language Models (LLMs) by decomposing LLM activations into\ninterpretable features. We apply SAEs to company descriptions, obtaining\nmeaningful clusters of equities in the process. We benchmark SAE features\nagainst SIC-codes, Major Group codes, and Embeddings. Our results demonstrate\nthat SAE features not only replicate but often surpass sector classifications\nand embeddings in capturing fundamental company characteristics. This is\nevidenced by their superior performance in correlating monthly returns - a\nproxy for similarity - and generating higher Sharpe ratio co-integration\nstrategies, which underscores deeper fundamental similarities among companies.\n","subjects":["Computer Science/Computation and Language","Computer Science/Machine Learning","Economics/General Economics","Quantitative Finance/Economics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"RCYZ8ljrdPbJV5yOagOPXp0fuSSu9GFp3CcsmBQFfQY","pdfSize":"914574"}