{"id":"2412.03804","title":"A mathematical language for linking fine-scale structure in spikes from\n  hundreds to thousands of neurons with behaviour","authors":"Alexandra N. Busch, Roberto C. Budzinski, Federico W. Pasini, J\\'an\n  Min\\'a\\v{c}, Jonathan A. Michaels, Megan Roussy, Roberto A. Gulli, Benjamin\n  W. Corrigan, J. Andrew Pruszynski, Julio Martinez-Trujillo, Lyle E. Muller","authorsParsed":[["Busch","Alexandra N.",""],["Budzinski","Roberto C.",""],["Pasini","Federico W.",""],["Mináč","Ján",""],["Michaels","Jonathan A.",""],["Roussy","Megan",""],["Gulli","Roberto A.",""],["Corrigan","Benjamin W.",""],["Pruszynski","J. Andrew",""],["Martinez-Trujillo","Julio",""],["Muller","Lyle E.",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 01:57:29 GMT"},{"version":"v2","created":"Wed, 15 Jan 2025 02:25:10 GMT"}],"updateDate":"2025-01-16","timestamp":1733363849000,"abstract":"  Recent advances in neural recording technology allow simultaneously recording\naction potentials from hundreds to thousands of neurons in awake, behaving\nanimals. However, characterizing spike patterns in the resulting data, and\nlinking these patterns to behaviour, remains a challenging task. The lack of a\nrigorous mathematical language for variable numbers of events (spikes) emitted\nby multiple agents (neurons) is an important limiting factor. We introduce a\nnew mathematical operation to decompose complex spike patterns into a set of\nsimple, structured elements. This creates a mathematical language that allows\ncomparing spike patterns across trials, detecting sub-patterns, and making\nlinks to behaviour via a clear distance measure. We apply the method to dual\nUtah array recordings from macaque prefrontal cortex, where this technique\nreveals previously unseen structure that can predict both memory-guided\ndecisions and errors in a virtual-reality working memory task. These results\ndemonstrate that this technique provides a powerful new approach to understand\nstructure in the spike times of neural populations, at a scale that will\ncontinue to grow more and more rapidly in upcoming years.\n","subjects":["Quantitative Biology/Quantitative Methods"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0qvCqiOrJqVemCZNGZGVWLslQl98O5TmOuCZOWBm-ys","pdfSize":"6755715"}