{"id":"2412.01714","title":"Joint Phase Time Array: Opportunities, Challenges and System Design\n  Considerations","authors":"Young-Han Nam, Ahmad AlAmmouri, Jianhua Mo, Jianzhong Chalrie Zhang","authorsParsed":[["Nam","Young-Han",""],["AlAmmouri","Ahmad",""],["Mo","Jianhua",""],["Zhang","Jianzhong Chalrie",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 17:03:47 GMT"}],"updateDate":"2024-12-03","timestamp":1733159027000,"abstract":"  This paper presents a novel approach to designing millimeter-wave (mmWave)\ncellular communication systems, based on joint phase time array (JPTA) radio\nfrequency (RF) frontend architecture. JPTA architecture comprises time-delay\ncomponents appended to conventional phase shifters, which offer extra degrees\nof freedom to be exploited for designing frequency-selective analog beams.\nHence, a mmWave device equipped with JPTA can receive and transmit signals in\nmultiple directions in a single time slot per RF chain, one direction per\nfrequency subband, which alleviates the traditional constraint of one analog\nbeam per transceiver chain per time slot. The utilization of subband-specific\nanalog beams offers a new opportunity in designing mmWave systems, allowing for\nenhanced cell capacity and reduced pilot overhead. To understand the practical\nfeasibility of JPTA, a few challenges and system design considerations are\ndiscussed in relation to the performance and complexity of the JPTA systems.\nFor example, frequency-selective beam gain losses are present for the subband\nanalog beams, e.g., up to 1 dB losses for 2 subband cases, even with the\nstate-of-the-art JPTA delay and phase optimization methods. Despite these side\neffects, system-level analysis reveals that the JPTA system is capable of\nimproving cell capacity: the 5%-tile throughput by up to 65%.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"bE48jYozAFcBqpJoP7y2XVkCBQjWEuk8wZQDxg7TNq4","pdfSize":"459262"}