{"id":"2412.00942","title":"Dynamic Indicators of Adherence and Retention in Digital Health Studies:\n  Insights from the Brighten Study","authors":"Dylan Hamitouche, Youcef Barkat, Deven Parekh, Eva Hammer, David\n  Benrimoh","authorsParsed":[["Hamitouche","Dylan",""],["Barkat","Youcef",""],["Parekh","Deven",""],["Hammer","Eva",""],["Benrimoh","David",""]],"versions":[{"version":"v1","created":"Sun, 1 Dec 2024 19:27:40 GMT"}],"updateDate":"2024-12-03","timestamp":1733081260000,"abstract":"  Background: Effective use of mobile health technologies requires high\nparticipant adherence and retention. However, remote digital health studies\noften face high attrition and low adherence, potentially introducing bias and\nlimiting generalizability. Objective: This study aims to identify longitudinal\nindicators of participant retention and adherence to develop strategies for\nimproving data collection in digital health studies and understanding how\ncohorts are shaped by participant withdrawal and non-adherence. Methods: We\nconducted analyses on the Brighten study, a smartphone-based randomized\ncontrolled trial evaluating apps for depression treatment. Participants were\nasked to complete seven digital questionnaires regularly. Outcomes included\nadherence (questionnaire completion), engagement (post-baseline participation),\nand retention (continued participation over time). We analyzed relationships\nbetween these outcomes, static factors (e.g., demographics, average\nquestionnaire scores) and dynamic factors (e.g., questionnaire score changes\nover time). Results: Of 2,201 participants, 1,093 completed at least one\nnon-baseline questionnaire (median completion rate: 37.6%). Adherence was\nhigher among participants with lower average depression severity (P<.001) and\nthose perceiving improvement (P=.001). Demographic factors significantly\ninfluenced adherence and engagement. Participants with greater baseline\ndepressive symptoms were more likely to withdraw before completing non-baseline\nquestionnaires (t=-2.53, P=.01). However, symptom improvement was linked to\nbetter adherence (U=127,084; P<.001) and retention (HR=0.78, P=.002).\nConclusion: Clinical trajectories and perceived improvements in depressive\nsymptoms are key indicators of engagement, adherence, and retention. These\nfindings may enhance data interpretation and inform strategies to boost\nretention and adherence in future trials.\n","subjects":["Quantitative Biology/Quantitative Methods"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"kVIy4AZy8O18voXsiimyjurVV1rVM8ZTxeMAmPUT610","pdfSize":"847080"}