{"id":"2412.18536","title":"Flowery Horizons & Bulk Observers: $sl^{(q)}(2,\\mathbb{R})$ Drive in\n  $2d$ Holographic CFT","authors":"Jayashish Das, Arnab Kundu","authorsParsed":[["Das","Jayashish",""],["Kundu","Arnab",""]],"versions":[{"version":"v1","created":"Tue, 24 Dec 2024 16:35:43 GMT"},{"version":"v2","created":"Thu, 30 Jan 2025 16:33:22 GMT"}],"updateDate":"2025-01-31","timestamp":1735058143000,"abstract":"  We explore and analyze bulk geometric aspects corresponding to a driven\ntwo-dimensional holographic CFT, where the drive Hamiltonian is constructed\nfrom the $sl^{(q)}(2,\\mathbb{R})$ generators. In particular, we demonstrate\nthat starting with a thermal initial state, the evolution of the event horizon\nis characterized by distinct geometric transformations in the bulk which are\nassociated to the conjugacy classes of the corresponding transformations on the\nCFT. Namely, the bulk evolution of the horizon is geometrically classified into\nan oscillatory (non-heating) behaviour, an exponentially growing (heating)\nbehaviour and a power-law growth with an angular rotation (the phase boundary),\nall as a function of the stroboscopic time. We also show that the explicit\nsymmetry breaking of the drive is manifest in a flowery structure of the event\nhorizon that displays a $U(1) \\to {\\mathbb Z}_q$ symmetry breaking. In the\n$q\\to \\infty$ limit, the $U(1)$ symmetry is effectively restored. Furthermore,\nby analyzing the integral curves generated by the asymptotic Killing vectors,\nwe also demonstrate how the fixed points of these curves approximate a bulk\nRyu-Takayanagi surface corresponding to a modular Hamiltonian for a sub-region\nin the CFT. Since the CFT modular Hamiltonian has an infinitely many\nin-equivalent extensions in the bulk, the fixed points of the integral curves\ncan also lie outside the entanglement wedge of the CFT sub-region.\n","subjects":["Physics/High Energy Physics - Theory","Condensed Matter/Strongly Correlated Electrons","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"vRl7xi-jcZa55Rear4VLBzyMXKSI5C-y4gFq0Hr5M8Q","pdfSize":"1904724"}