{
  "id": "2412.20230",
  "title": "Leveraging Large Language Models for Enhancing Autonomous Vehicle\n  Perception",
  "authors": "Athanasios Karagounis",
  "authorsParsed": [
    [
      "Karagounis",
      "Athanasios",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 28 Dec 2024 17:58:44 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735408724000,
  "abstract": "  Autonomous vehicles (AVs) rely on sophisticated perception systems to\ninterpret their surroundings, a cornerstone for safe navigation and\ndecision-making. The integration of Large Language Models (LLMs) into AV\nperception frameworks offers an innovative approach to address challenges in\ndynamic environments, sensor fusion, and contextual reasoning. This paper\npresents a novel framework for incorporating LLMs into AV perception, enabling\nadvanced contextual understanding, seamless sensor integration, and enhanced\ndecision support. Experimental results demonstrate that LLMs significantly\nimprove the accuracy and reliability of AV perception systems, paving the way\nfor safer and more intelligent autonomous driving technologies. By expanding\nthe scope of perception beyond traditional methods, LLMs contribute to creating\na more adaptive and human-centric driving ecosystem, making autonomous vehicles\nmore reliable and transparent in their operations. These advancements redefine\nthe relationship between human drivers and autonomous systems, fostering trust\nthrough enhanced understanding and personalized decision-making. Furthermore,\nby integrating memory modules and adaptive learning mechanisms, LLMs introduce\ncontinuous improvement in AV perception, enabling vehicles to evolve with time\nand adapt to changing environments and user preferences.\n",
  "subjects": [
    "Computer Science/Robotics",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "dZor0jyfQzaedlEeUw5yVM6PSvSeiECR-KUhPxlbQ8o",
  "pdfSize": "78918"
}