{"id":"2412.07034","title":"Constraining solar emission radius at 42 MHz during the 2024 total solar\n  eclipse using a student-commissioned radio telescope","authors":"Olivia R. Young, Timothy E. Dolch, Joseph F. Helmboldt, Christopher\n  Mentrek, Louis P. Dartez, Michael T. Lam, Sophia V. Sosa Fiscella, Evan\n  Bretl, Colin Joyce, Johannes Loock, Grace Meyer, Annabel Peltzer, Joseph\n  Petullo, Parker Reed, Emerson Sigtryggsson, Benjamin Bassett, Andrew B.\n  Hawken, Alejandro Z. Heredia, Paige Lettow, Whit Lewis, Mikayla Manna,\n  Nicholas Mirochnikoff, Michael Zemcov","authorsParsed":[["Young","Olivia R.",""],["Dolch","Timothy E.",""],["Helmboldt","Joseph F.",""],["Mentrek","Christopher",""],["Dartez","Louis P.",""],["Lam","Michael T.",""],["Fiscella","Sophia V. Sosa",""],["Bretl","Evan",""],["Joyce","Colin",""],["Loock","Johannes",""],["Meyer","Grace",""],["Peltzer","Annabel",""],["Petullo","Joseph",""],["Reed","Parker",""],["Sigtryggsson","Emerson",""],["Bassett","Benjamin",""],["Hawken","Andrew B.",""],["Heredia","Alejandro Z.",""],["Lettow","Paige",""],["Lewis","Whit",""],["Manna","Mikayla",""],["Mirochnikoff","Nicholas",""],["Zemcov","Michael",""]],"versions":[{"version":"v1","created":"Mon, 9 Dec 2024 22:46:00 GMT"}],"updateDate":"2024-12-11","timestamp":1733784360000,"abstract":"  Low-frequency solar radio emission is sourced in the solar corona, with\nsub-100 MHz radio emission largely originating from the\n$\\sim$10$^{5}$\\,$\\mathrm{K}$ plasma around 2 optical radii. However, the region\nof emission has yet to be constrained at 35--45\\,MHz due to both\ninstrumentation limitations and the rarity of astronomical events, such as\ntotal solar eclipses, which allow for direct observational approaches. In this\nwork, we present the results from a student-led project to commission a\nlow-frequency radio telescope array situated in the path of totality of the\n2024 total solar eclipse in an effort to probe the middle corona. The\nDeployable Low-Band Ionosphere and Transient Experiment (DLITE) is a\nlow-frequency radio array comprised of four dipole antennas, optimized to\nobserve at 35--45\\,MHz, and capable of resolving the brightest radio sources in\nthe sky. We constructed a DLITE station in Observatory Park, a dark sky park in\nMontville, Ohio. Results of observations during the total solar eclipse\ndemonstrate that DLITE stations can be quickly deployed for observations and\nprovide constraints on the radius of solar emission at our center observing\nfrequency of 42\\,MHz. In this work, we outline the construction of DLITE Ohio\nand the solar observation results from the total solar eclipse that transversed\nNorth America in April 2024.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"P1TcFKwOF8tT7yrLu0kjQuBEc7mbwnuoTzD7v-bWubc","pdfSize":"3582713"}