{"id":"2412.02641","title":"SEMANTIC SEE-THROUGH GOGGLES: Wearing Linguistic Virtual Reality in\n  (Artificial) Intelligence","authors":"Goki Muramoto, Yuri Yasui, Hirosuke Asahi","authorsParsed":[["Muramoto","Goki",""],["Yasui","Yuri",""],["Asahi","Hirosuke",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 18:13:37 GMT"}],"updateDate":"2024-12-04","timestamp":1733249617000,"abstract":"  When language is utilized as a medium to store and communicate sensory\ninformation, there arises a kind of radical virtual reality, namely \"the\nrealities that are reduced into the same sentence are virtual/equivalent.\" In\nthe current era, in which artificial intelligence engages in the linguistic\nmediation of sensory information, it is imperative to re-examine the various\nissues pertaining to this potential VR, particularly in relation to bias and\n(dis)communication. Semantic See-through Goggles represent an experimental\nframework for glasses through which the view is fully verbalized and\nre-depicted into the wearer's view. The participants wear the goggles equipped\nwith a camera and head-mounted display (HMD). In real-time, the image captured\nby the camera is converted by the AI into a single line of text, which is then\ntransformed into an image and presented to the user's eyes. This process\nenables users to perceive and interact with the real physical world through\nthis redrawn view. We constructed a prototype of these goggles, examined their\nfundamental characteristics, and then conducted a qualitative analysis of the\nwearer's experience. This project investigates a methodology for subjectively\ncapturing the situation in which AI serves as a proxy for our perception of the\nworld. At the same time, It also attempts to appropriate some of the energy of\ntoday's debate over artificial intelligence for a classical inquiry around the\nfact that \"intelligence can only see the world under meaning.\"\n","subjects":["Computer Science/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"Oh3V20y4qHx-xg4-ZMVYfpXujrBOquneKo5R9_1E8h8","pdfSize":"9916135"}