{
  "id": "2412.09533",
  "title": "Defect density of states of tin oxide and copper oxide p-type thin-film\n  transistors",
  "authors": "M{\\aa}ns J. Mattsson, Kham M. Niang, Jared Parker, David J. Meeth,\n  John F. Wager, Andrew J. Flewitt and Matt W. Graham",
  "authorsParsed": [
    [
      "Mattsson",
      "Måns J.",
      ""
    ],
    [
      "Niang",
      "Kham M.",
      ""
    ],
    [
      "Parker",
      "Jared",
      ""
    ],
    [
      "Meeth",
      "David J.",
      ""
    ],
    [
      "Wager",
      "John F.",
      ""
    ],
    [
      "Flewitt",
      "Andrew J.",
      ""
    ],
    [
      "Graham",
      "Matt W.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 18:22:51 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1734027771000,
  "abstract": "  The complete subgap defect density of states (DoS) is measured using the\nultrabroadband (0.15 to 3.5 eV) photoconduction response from p-type thin-film\ntransistors (TFTs) of tin oxide, SnO, and copper oxide, Cu$_2$O. The TFT\nphotoconduction spectra clearly resolve all bandgaps that further show the\npresence of interfacial and oxidized minority phases. In tin oxide, the SnO\nmajority phase has a small 0.68 eV bandgap enabling ambipolar or p-mode TFT\noperation. By contrast, in copper oxide TFTs, an oxidized minority phase with a\n1.4 eV bandgap corresponding to CuO greatly reduces the channel hole mobility\nat the charge accumulation region. Three distinct subgap DoS peaks are resolved\nfor the copper oxide TFT and are best ascribed to copper vacancies,\noxygen-on-copper antisites, and oxygen interstitials. For tin oxide TFTs, five\nsubgap DoS peaks are observed and are similarly linked to tin vacancies, oxygen\nvacancies, and oxygen interstitials. Unipolar p-type TFT is achieved in tin\noxide only when the conduction band-edge defect density peak ascribed to oxygen\ninterstitials is large enough to suppress any n-mode conduction. Near the\nvalence band edge in both active channel materials, the metal vacancy peak\ndensities determine the hole concentrations, which further simulate the\nobserved TFT threshold voltages.\n",
  "subjects": [
    "Condensed Matter/Materials Science",
    "Condensed Matter/Mesoscale and Nanoscale Physics",
    "Physics/Applied Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "MeFLJyg3F26bRTXyEKS9dbTpA772dRHr-kgILwQu9rI",
  "pdfSize": "1863987"
}