{
  "id": "2412.09836",
  "title": "Prospects for Systematic Planetary Nebulae Detection with the Census of\n  the Local Universe Narrowband Survey",
  "authors": "Rong Du (Peking University, Caltech), David O. Cook (Caltech),\n  Soumyadeep Bhattacharjee (Caltech), Shrinivas R. Kulkarni (Caltech),\n  Christoffer Fremling, David L. Kaplan, Mansi M. Kasliwal, Russ R. Laher,\n  Frank J. Masci, David L. Shupe, Chaoran Zhang",
  "authorsParsed": [
    [
      "Du",
      "Rong",
      "",
      "Peking University, Caltech"
    ],
    [
      "Cook",
      "David O.",
      "",
      "Caltech"
    ],
    [
      "Bhattacharjee",
      "Soumyadeep",
      "",
      "Caltech"
    ],
    [
      "Kulkarni",
      "Shrinivas R.",
      "",
      "Caltech"
    ],
    [
      "Fremling",
      "Christoffer",
      ""
    ],
    [
      "Kaplan",
      "David L.",
      ""
    ],
    [
      "Kasliwal",
      "Mansi M.",
      ""
    ],
    [
      "Laher",
      "Russ R.",
      ""
    ],
    [
      "Masci",
      "Frank J.",
      ""
    ],
    [
      "Shupe",
      "David L.",
      ""
    ],
    [
      "Zhang",
      "Chaoran",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 03:58:59 GMT"
    }
  ],
  "updateDate": "2024-12-16",
  "timestamp": 1734062339000,
  "abstract": "  We investigate the efficacy of a systematic planetary nebula (PN) search in\nthe Census of the Local Universe (CLU) narrowband (H$\\alpha$) survey that\ncovers a considerably larger sky region of above declination $-20^\\circ$ than\nmost previous surveys. Using PNe observed by the Isaac Newton Telescope\nPhotometric H$\\alpha$ Survey (IPHAS) as validation, we are able to visually\nrecover 432 out of 441 cataloged PNe (98\\%) within the CLU dataset, with 5\nsources having unusable CLU images and 4 missed due to limitations of imaging\nquality. Moreover, the reference PNe are conventionally divided into three PN\nclasses in decreasing order of identification confidence given their spectra\nand morphologies. We record consistently high recovery rate across all classes:\n95\\% of True, 71\\% of Likely, and 81\\% of Possible sources are readily\nrecovered. To further demonstrate the ability of CLU to find new PNe, we\nundertake a preliminary search of compact PNe within a sub-region of the\nvalidation catalog, mainly utilizing the significance of narrow-band colors\n($\\Sigma$) as a metric for identification. In a $200\\,\\rm deg^2$ region, we\nsearch the CLU source catalog and find 31 PN candidates after automated and\nvisual scrutiny, of which 12 are new sources not appearing in previous studies.\nAs a demonstration of our ongoing follow-up campaign, we present\nmedium-resolution optical spectra of six candidates and notice that four of\nthem show emission signatures characteristic of confirmed PNe. As we refine our\nselection methods, CLU promises to provide a systematic catalog of PNe spanning\n$2/3$ of the sky.\n",
  "subjects": [
    "Astrophysics/Solar and Stellar Astrophysics",
    "Astrophysics/Astrophysics of Galaxies",
    "Astrophysics/Instrumentation and Methods for Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "DDMlwwdC4s1vBwOS8yv9QnSo04LdUhkzT3EBlGXFzb8",
  "pdfSize": "4865456"
}