{
  "id": "2412.00361",
  "title": "Investigating the relation between environment and internal structure of\n  massive elliptical galaxies using strong lensing",
  "authors": "S M Rafee Adnan, Muhammad Jobair Hasan, Ahmad Al - Imtiaz, Sulyman H.\n  Robin, Fahim R. Shwadhin, Anowar J. Shajib, Mamun Hossain Nahid, Mehedi Hasan\n  Tanver, Tanjela Akter, Nusrath Jahan, Zareef Jafar, Mamunur Rashid, Anik\n  Biswas, Akbar Ahmed Chowdhury, Jannatul Feardous, Ajmi Rahaman, Masuk Ridwan,\n  Rahul D. Sharma, Zannat Chowdhury and Mir Sazzat Hossain",
  "authorsParsed": [
    [
      "Adnan",
      "S M Rafee",
      ""
    ],
    [
      "Hasan",
      "Muhammad Jobair",
      ""
    ],
    [
      "Imtiaz",
      "Ahmad Al -",
      ""
    ],
    [
      "Robin",
      "Sulyman H.",
      ""
    ],
    [
      "Shwadhin",
      "Fahim R.",
      ""
    ],
    [
      "Shajib",
      "Anowar J.",
      ""
    ],
    [
      "Nahid",
      "Mamun Hossain",
      ""
    ],
    [
      "Tanver",
      "Mehedi Hasan",
      ""
    ],
    [
      "Akter",
      "Tanjela",
      ""
    ],
    [
      "Jahan",
      "Nusrath",
      ""
    ],
    [
      "Jafar",
      "Zareef",
      ""
    ],
    [
      "Rashid",
      "Mamunur",
      ""
    ],
    [
      "Biswas",
      "Anik",
      ""
    ],
    [
      "Chowdhury",
      "Akbar Ahmed",
      ""
    ],
    [
      "Feardous",
      "Jannatul",
      ""
    ],
    [
      "Rahaman",
      "Ajmi",
      ""
    ],
    [
      "Ridwan",
      "Masuk",
      ""
    ],
    [
      "Sharma",
      "Rahul D.",
      ""
    ],
    [
      "Chowdhury",
      "Zannat",
      ""
    ],
    [
      "Hossain",
      "Mir Sazzat",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 30 Nov 2024 05:18:08 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1732943888000,
  "abstract": "  Strong lensing directly probes the internal structure of the lensing\ngalaxies. In this paper, we investigate the relation between the internal\nstructure of massive elliptical galaxies and their environment using a sample\nof 15 strong lensing systems. We performed lens modeling for them using\nLenstronomy and constrained the mass and light distributions of the deflector\ngalaxies. We adopt the local galaxy density as a metric for the environment and\ntest our results against several alternative definitions of it. We robustly\nfind that the centroid offset between the mass and light is not correlated with\nthe local galaxy density. This result supports using centroid offsets as a\nprobe of dark matter theories since the environment's impact on it can be\ntreated as negligible. Although we find a strong correlation between the\nposition angle offset and the standard definition of the local galaxy density,\nconsistent with previous studies, the correlation becomes weaker for\nalternative definitions of the local galaxy density. This result weakens the\nsupport for interpreting the position angle misalignment as having originated\nfrom interaction with the environment. Furthermore, we find the 'residual\nshear' magnitude in the lens model to be uncorrelated with the local galaxy\ndensity, supporting the interpretation of the residual shear originating, in\npart, from the inadequacy in modeling the angular structure of the lensing\ngalaxy and not solely from the structures present in the environment or along\nthe line of sight.\n",
  "subjects": [
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "-fj4QmAQPUAYG5WcREkfVUsIQ6tEi1fNDvHDqFI19UI",
  "pdfSize": "1845237"
}