{"id":"2412.18706","title":"SurvAttack: Black-Box Attack On Survival Models through\n  Ontology-Informed EHR Perturbation","authors":"Mohsen Nayebi Kerdabadi, Arya Hadizadeh Moghaddam, Bin Liu, Mei Liu,\n  Zijun Yao","authorsParsed":[["Kerdabadi","Mohsen Nayebi",""],["Moghaddam","Arya Hadizadeh",""],["Liu","Bin",""],["Liu","Mei",""],["Yao","Zijun",""]],"versions":[{"version":"v1","created":"Tue, 24 Dec 2024 23:35:42 GMT"}],"updateDate":"2024-12-30","timestamp":1735083342000,"abstract":"  Survival analysis (SA) models have been widely studied in mining electronic\nhealth records (EHRs), particularly in forecasting the risk of critical\nconditions for prioritizing high-risk patients. However, their vulnerability to\nadversarial attacks is much less explored in the literature. Developing\nblack-box perturbation algorithms and evaluating their impact on\nstate-of-the-art survival models brings two benefits to medical applications.\nFirst, it can effectively evaluate the robustness of models in pre-deployment\ntesting. Also, exploring how subtle perturbations would result in significantly\ndifferent outcomes can provide counterfactual insights into the clinical\ninterpretation of model prediction. In this work, we introduce SurvAttack, a\nnovel black-box adversarial attack framework leveraging subtle clinically\ncompatible, and semantically consistent perturbations on longitudinal EHRs to\ndegrade survival models' predictive performance. We specifically develop a\ngreedy algorithm to manipulate medical codes with various adversarial actions\nthroughout a patient's medical history. Then, these adversarial actions are\nprioritized using a composite scoring strategy based on multi-aspect\nperturbation quality, including saliency, perturbation stealthiness, and\nclinical meaningfulness. The proposed adversarial EHR perturbation algorithm is\nthen used in an efficient SA-specific strategy to attack a survival model when\nestimating the temporal ranking of survival urgency for patients. To\ndemonstrate the significance of our work, we conduct extensive experiments,\nincluding baseline comparisons, explainability analysis, and case studies. The\nexperimental results affirm our research's effectiveness in illustrating the\nvulnerabilities of patient survival models, model interpretation, and\nultimately contributing to healthcare quality.\n","subjects":["Computer Science/Machine Learning","Computer Science/Artificial Intelligence","Computer Science/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"NFEB8y1rA_HFMZQ3aRFz_XyNd3hNkS0zJHurvCIyzIs","pdfSize":"1592204"}