{"id":"2412.17210","title":"Dual Conditioned Motion Diffusion for Pose-Based Video Anomaly Detection","authors":"Andi Xu, Hongsong Wang, Pinle Ding, Jie Gui","authorsParsed":[["Xu","Andi",""],["Wang","Hongsong",""],["Ding","Pinle",""],["Gui","Jie",""]],"versions":[{"version":"v1","created":"Mon, 23 Dec 2024 01:31:39 GMT"}],"updateDate":"2024-12-24","timestamp":1734917499000,"abstract":"  Video Anomaly Detection (VAD) is essential for computer vision research.\nExisting VAD methods utilize either reconstruction-based or prediction-based\nframeworks. The former excels at detecting irregular patterns or structures,\nwhereas the latter is capable of spotting abnormal deviations or trends. We\naddress pose-based video anomaly detection and introduce a novel framework\ncalled Dual Conditioned Motion Diffusion (DCMD), which enjoys the advantages of\nboth approaches. The DCMD integrates conditioned motion and conditioned\nembedding to comprehensively utilize the pose characteristics and latent\nsemantics of observed movements, respectively. In the reverse diffusion\nprocess, a motion transformer is proposed to capture potential correlations\nfrom multi-layered characteristics within the spectrum space of human motion.\nTo enhance the discriminability between normal and abnormal instances, we\ndesign a novel United Association Discrepancy (UAD) regularization that\nprimarily relies on a Gaussian kernel-based time association and a\nself-attention-based global association. Finally, a mask completion strategy is\nintroduced during the inference stage of the reverse diffusion process to\nenhance the utilization of conditioned motion for the prediction branch of\nanomaly detection. Extensive experiments on four datasets demonstrate that our\nmethod dramatically outperforms state-of-the-art methods and exhibits superior\ngeneralization performance.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"sWGWkbCR2E7sfVQgAPw5froFiCanznIrzicwB254Fy4","pdfSize":"3158012"}