{"id":"2412.07423","title":"Insights into Transient Dynamics of Bacteria Laden Liquid Bridges","authors":"Kush Kumar Dewangan, Srinivas Rao S, Durbar Roy, Atish Roy Chowdhury,\n  Dipshikha Chakravortty, Saptarshi Basu","authorsParsed":[["Dewangan","Kush Kumar",""],["S","Srinivas Rao",""],["Roy","Durbar",""],["Chowdhury","Atish Roy",""],["Chakravortty","Dipshikha",""],["Basu","Saptarshi",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 11:25:48 GMT"},{"version":"v2","created":"Sun, 5 Jan 2025 08:24:48 GMT"}],"updateDate":"2025-01-07","timestamp":1733829948000,"abstract":"  We study evaporation and precipitate formation mechanics of bacteria-laden\nliquid bridge using experimental and theoretical analysis. Aqueous suspension\nof motile and non-motile Salmonella Typhimurium and Pseudomonas aeruginosa\ntypically found in contaminated food and water were used in liquid bridge\nconfiguration between hydrophilic substrates. Using inverse logarithmic\nevaporation flux model, we study volume regression for cylindrical/catenoid\nvolume models with confinement distance as a parameter. For all confinement\ndistances, the regression is linear on normalizing both volume and time as in\nthe case of pure sessile drop. However, in normalized volume and dimensional\ntime space, we observe non-linearities as the evaporation time scales non\nlinearly with the confinement distance. The non-linearities were captured using\nthe catenoid model. The catenoid model conforms to the experimental volume\nregression data at all confinement distances, and the transient liquid bridge\ninterface evolution profile at high confinement distance. We also study the\nprecipitate pattern and bacterial distribution using micro/nano\ncharacterization techniques. We show the average precipitate pattern for both\nsessile and higher confinement distance resembles coffee ring type deposits\nalthough the underlying bacterial distribution differs. For lower confinement,\nwe observe pattern resulting from a combination of coffee ring effect,\nstick-slick motion, and thin film instability. The reduction in confinement\ndistance causes an altered bacterial agglomeration, resulting in a\nmulti-pattern network instead of a single circumferential edge deposition. We\nshow the aerial size of motile bacteria increases with decreasing confinement,\nwhereas the size for non-motile bacteria remains constant in the precipitate.\n","subjects":["Condensed Matter/Soft Condensed Matter","Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"9Rt093y6Fe1UE6KClTgwxOW09UwVoDnVRqMDt2dTXJw","pdfSize":"3393343"}