{
  "id": "2412.13258",
  "title": "Where do X-ray low surface brightness clusters sit with respect to\n  filaments?",
  "authors": "S. Zarattini, S. Andreon, and E. Puddu",
  "authorsParsed": [
    [
      "Zarattini",
      "S.",
      ""
    ],
    [
      "Andreon",
      "S.",
      ""
    ],
    [
      "Puddu",
      "E.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 19:00:02 GMT"
    }
  ],
  "updateDate": "2025-02-19",
  "timestamp": 1734462002000,
  "abstract": "  The aim of this work is to study the position of gas-rich and gas-poor galaxy\nclusters within the large-scale structure and, in particular, their distance to\nfilaments. Our sample is built from 29 of the 34 clusters in the X-ray unbiased\ncluster sample (XUCS), a velocity-dispersion-selected sample for which various\nproperties, including masses, gas fractions, and X-ray surface brightness were\navailable in the literature. We compute the projected distance between each\ncluster and the spine of the nearest filament with the same redshift and\ninvestigate the link between this distance and the previously-mentioned\nproperties of the clusters, in particular with their gas content. The average\ndistance between clusters and filaments is larger for low X-ray surface\nbrightness clusters than for those of high surface brightness, with\nintermediate brightness clusters being an intermediate case. Also the minimum\ndistance follows a similar trend, with rare cases of low surface brightness\nclusters found at distances smaller than 2 Mpc from the spine of filaments.\nHowever, the Kolmogorov-Smirnov statistical test is not able to exclude the\nnull hypothesis that the two distributions are coming from the same parent one.\nWe speculate that the position of galaxy clusters within the cosmic web could\nhave a direct impact in their gas mass fraction, hence on its X-ray surface\nbrightness, since the presence of a filament can oppose resistance to the\noutward flow of gas induced by the central AGN and reduce the time required for\nthis gas to fall inward after the AGN is shut. However, a larger sample of\nclusters is needed in order to derive a statistically-robust conclusion\n",
  "subjects": [
    "Astrophysics/Cosmology and Nongalactic Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "yunfN49OE3IkU1MZNeOQfFMWYqytMmk4n09BnjkN-lI",
  "pdfSize": "821396"
}