{"id":"2412.18512","title":"Elevating Information System Performance: A Deep Dive into Quality\n  Metrics","authors":"Dana A Abdullah, Hewir A. Khidir, Ismail Y. Maolood, Aso K. Ameen,\n  Dana Rasul Hamad, Hakem Saed Beitolahi, Abdulhady Abas Abdullah, Tarik Ahmed\n  Rashid, Mohammed Y. Shakor","authorsParsed":[["Abdullah","Dana A",""],["Khidir","Hewir A.",""],["Maolood","Ismail Y.",""],["Ameen","Aso K.",""],["Hamad","Dana Rasul",""],["Beitolahi","Hakem Saed",""],["Abdullah","Abdulhady Abas",""],["Rashid","Tarik Ahmed",""],["Shakor","Mohammed Y.",""]],"versions":[{"version":"v1","created":"Tue, 24 Dec 2024 15:50:57 GMT"}],"updateDate":"2024-12-25","timestamp":1735055457000,"abstract":"  In today's digital age, information systems (IS) are indispensable tools for\norganizations of all sizes. The quality of these systems, encompassing system,\ninformation, and service dimensions, significantly impacts organizational\nperformance. This study investigates the intricate relationships between these\nthree quality dimensions and their collective influence on key performance\nindicators such as customer satisfaction and operational efficiency. By\nconducting a comparative analysis of various quality metrics, we aim to\nidentify the most effective indicators for assessing IS quality. Our research\ncontributes to the field by providing actionable insights for researchers or\npractitioners to develop the implementation, evaluation and design of\ninformation systems. Also, a quantitative study employing a structured\nquestionnaire survey was conducted to achieve primary data from respondents\nacross various sectors. Statistical analysis, including Cronbach's Alpha\n(0.953) and factor analysis (KMO = 0.965, Bartlett's Test p < 0.000), revealed\nstrong interdependencies among System Quality (SQ), Information Quality (IQ),\nand Service Quality (SerQ). The results demonstrate that high SQ leads to\nimproved IQ, which in turn contributes to enhanced SerQ and user satisfaction.\nWhile all three qualities are crucial, SerQ emerges as the most relevant\nindicator of overall system performance due to its broader representation of\nquality dimensions\n","subjects":["Computer Science/Computers and Society","Computer Science/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Nk-fFk9_aQ588UzRwYjejkzKE8MmHGsqoQZ9_UVklgM","pdfSize":"806758"}