{"id":"2412.21156","title":"Unified dimensionality reduction techniques in chronic liver disease\n  detection","authors":"Anand Karna, Naina Khan, Rahul Rauniyar, Prashant Giridhar Shambharkar","authorsParsed":[["Karna","Anand",""],["Khan","Naina",""],["Rauniyar","Rahul",""],["Shambharkar","Prashant Giridhar",""]],"versions":[{"version":"v1","created":"Mon, 30 Dec 2024 18:35:02 GMT"}],"updateDate":"2024-12-31","timestamp":1735583702000,"abstract":"  Globally, chronic liver disease continues to be a major health concern that\nrequires precise predictive models for prompt detection and treatment. Using\nthe Indian Liver Patient Dataset (ILPD) from the University of California at\nIrvine's UCI Machine Learning Repository, a number of machine learning\nalgorithms are investigated in this study. The main focus of our research is\nthis dataset, which includes the medical records of 583 patients, 416 of whom\nhave been diagnosed with liver disease and 167 of whom have not. There are\nseveral aspects to this work, including feature extraction and dimensionality\nreduction methods like Linear Discriminant Analysis (LDA), Factor Analysis\n(FA), t-distributed Stochastic Neighbour Embedding (t-SNE), and Uniform\nManifold Approximation and Projection (UMAP). The purpose of the study is to\ninvestigate how well these approaches work for converting high-dimensional\ndatasets and improving prediction accuracy. To assess the prediction ability of\nthe improved models, a number of classification methods were used, such as\nMulti-layer Perceptron, Random Forest, K-nearest neighbours, and Logistic\nRegression. Remarkably, the improved models performed admirably, with Random\nForest having the highest accuracy of 98.31\\% in 10-fold cross-validation and\n95.79\\% in train-test split evaluation. Findings offer important new\nperspectives on the choice and use of customized feature extraction and\ndimensionality reduction methods, which improve predictive models for patients\nwith chronic liver disease.\n","subjects":["Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"PixDpZ4vPim3-yPoVGTMloj-_23OBSrSsF4flgLcxM4","pdfSize":"1828890"}