{
  "id": "2412.03681",
  "title": "Acquired TASTE: Multimodal Stance Detection with Textual and Structural\n  Embeddings",
  "authors": "Guy Barel, Oren Tsur, Dan Vilenchik",
  "authorsParsed": [
    [
      "Barel",
      "Guy",
      ""
    ],
    [
      "Tsur",
      "Oren",
      ""
    ],
    [
      "Vilenchik",
      "Dan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 19:23:37 GMT"
    },
    {
      "version": "v2",
      "created": "Fri, 6 Dec 2024 09:43:00 GMT"
    },
    {
      "version": "v3",
      "created": "Wed, 11 Dec 2024 20:08:44 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1733340217000,
  "abstract": "  Stance detection plays a pivotal role in enabling an extensive range of\ndownstream applications, from discourse parsing to tracing the spread of fake\nnews and the denial of scientific facts. While most stance classification\nmodels rely on textual representation of the utterance in question, prior work\nhas demonstrated the importance of the conversational context in stance\ndetection. In this work we introduce TASTE -- a multimodal architecture for\nstance detection that harmoniously fuses Transformer-based content embedding\nwith unsupervised structural embedding. Through the fine-tuning of a pretrained\ntransformer and the amalgamation with social embedding via a Gated Residual\nNetwork (GRN) layer, our model adeptly captures the complex interplay between\ncontent and conversational structure in determining stance. TASTE achieves\nstate-of-the-art results on common benchmarks, significantly outperforming an\narray of strong baselines. Comparative evaluations underscore the benefits of\nsocial grounding -- emphasizing the criticality of concurrently harnessing both\ncontent and structure for enhanced stance detection.\n",
  "subjects": [
    "Computer Science/Computation and Language"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "Uft4Wen4cPpm45uPIP2ppbOYjZcwEWpby1kgrKio_-M",
  "pdfSize": "1329240"
}