{"id":"2412.05908","title":"GBR: Generative Bundle Refinement for High-fidelity Gaussian Splatting\n  and Meshing","authors":"Jianing Zhang, Yuchao Zheng, Ziwei Li, Qionghai Dai, Xiaoyun Yuan","authorsParsed":[["Zhang","Jianing",""],["Zheng","Yuchao",""],["Li","Ziwei",""],["Dai","Qionghai",""],["Yuan","Xiaoyun",""]],"versions":[{"version":"v1","created":"Sun, 8 Dec 2024 12:00:25 GMT"}],"updateDate":"2024-12-10","timestamp":1733659225000,"abstract":"  Gaussian splatting has gained attention for its efficient representation and\nrendering of 3D scenes using continuous Gaussian primitives. However, it\nstruggles with sparse-view inputs due to limited geometric and photometric\ninformation, causing ambiguities in depth, shape, and texture.\n  we propose GBR: Generative Bundle Refinement, a method for high-fidelity\nGaussian splatting and meshing using only 4-6 input views. GBR integrates a\nneural bundle adjustment module to enhance geometry accuracy and a generative\ndepth refinement module to improve geometry fidelity. More specifically, the\nneural bundle adjustment module integrates a foundation network to produce\ninitial 3D point maps and point matches from unposed images, followed by bundle\nadjustment optimization to improve multiview consistency and point cloud\naccuracy. The generative depth refinement module employs a diffusion-based\nstrategy to enhance geometric details and fidelity while preserving the scale.\nFinally, for Gaussian splatting optimization, we propose a multimodal loss\nfunction incorporating depth and normal consistency, geometric regularization,\nand pseudo-view supervision, providing robust guidance under sparse-view\nconditions. Experiments on widely used datasets show that GBR significantly\noutperforms existing methods under sparse-view inputs. Additionally, GBR\ndemonstrates the ability to reconstruct and render large-scale real-world\nscenes, such as the Pavilion of Prince Teng and the Great Wall, with remarkable\ndetails using only 6 views.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"MVEwMUSl-ThyqFYnPZT9ORS5Ip-95oSCDzeMBrxYQow","pdfSize":"16565522"}