{"id":"2412.15599","title":"Electrically tunable MoSe$_2$/WSe$_2$ heterostructure-based quantum dot","authors":"Katarzyna Sadecka, Maciej Bieniek, Paulo E. Faria Junior, Arkadiusz\n  W\\'ojs, Pawe{\\l} Hawrylak, Jaros{\\l}aw Paw{\\l}owski","authorsParsed":[["Sadecka","Katarzyna",""],["Bieniek","Maciej",""],["Junior","Paulo E. Faria",""],["Wójs","Arkadiusz",""],["Hawrylak","Paweł",""],["Pawłowski","Jarosław",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 06:43:40 GMT"}],"updateDate":"2024-12-23","timestamp":1734677020000,"abstract":"  We describe here a theory of a quantum dot in an electrically tunable\nMoSe$_2$/WSe$_2$ heterostructure. Van der Waals heterostructures allow for\ntuning their electronic properties beyond their monolayer counterparts. We\nstart by determining their electronic structure using density functional\ntheory. We obtain the type-II band alignment and close in energy conduction\nband minima (valleys) at the $K$ and $Q$ points in the Brillouin zone. The\nvalence band maxima, also energetically close, are located at the $K$ and\n$\\Gamma$ points. By analyzing the Kohn-Sham wavefunctions, we describe the\nlayer, spin, and orbital contributions. Next, we construct an \\textit{ab\ninitio}-based tight-binding model, which helps us to better understand the\ncomplexity of the interlayer interactions. We determine the effect of a\nvertical electric field, showing that vertical gating enables control of\nvalleys extrema and their occupancy. Finally, we employ the tight-binding model\nto investigate laterally gated quantum dots and analyze the influence of a\nperpendicular electric field on their energy spectrum. Our results demonstrate\nthat tuning the electric field enables control over the valley character of the\nquantum dot states, selectively localizing them in either the $K$ or $Q$\nvalleys, as evidenced by their characteristic degeneracies and wavefunctions.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"M2JDAVDdXDbrijzJagIOgLJH4e0f4xRGDqZ-dDa-Xos","pdfSize":"6825615"}