{"id":"2412.02421","title":"TimeWalker: Personalized Neural Space for Lifelong Head Avatars","authors":"Dongwei Pan, Yang Li, Hongsheng Li and Kwan-Yee Lin","authorsParsed":[["Pan","Dongwei",""],["Li","Yang",""],["Li","Hongsheng",""],["Lin","Kwan-Yee",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 12:36:38 GMT"}],"updateDate":"2024-12-04","timestamp":1733229398000,"abstract":"  We present TimeWalker, a novel framework that models realistic, full-scale 3D\nhead avatars of a person on lifelong scale. Unlike current human head avatar\npipelines that capture identity at the momentary level(e.g., instant\nphotography or short videos), TimeWalker constructs a person's comprehensive\nidentity from unstructured data collection over his/her various life stages,\noffering a paradigm to achieve full reconstruction and animation of that person\nat different moments of life. At the heart of TimeWalker's success is a novel\nneural parametric model that learns personalized representation with the\ndisentanglement of shape, expression, and appearance across ages. Central to\nour methodology are the concepts of two aspects: (1) We track back to the\nprinciple of modeling a person's identity in an additive combination of average\nhead representation in the canonical space, and moment-specific head attribute\nrepresentations driven from a set of neural head basis. To learn the set of\nhead basis that could represent the comprehensive head variations in a compact\nmanner, we propose a Dynamic Neural Basis-Blending Module (Dynamo). It\ndynamically adjusts the number and blend weights of neural head bases,\naccording to both shared and specific traits of the target person over ages.\n(2) Dynamic 2D Gaussian Splatting (DNA-2DGS), an extension of Gaussian\nsplatting representation, to model head motion deformations like facial\nexpressions without losing the realism of rendering and reconstruction.\nDNA-2DGS includes a set of controllable 2D oriented planar Gaussian disks that\nutilize the priors from parametric model, and move/rotate with the change of\nexpression. Through extensive experimental evaluations, we show TimeWalker's\nability to reconstruct and animate avatars across decoupled dimensions with\nrealistic rendering effects, demonstrating a way to achieve personalized 'time\ntraveling' in a breeze.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"9JhBgq89061fPMJTTfw2aaZ38XY03d2W_14gwP028lQ","pdfSize":"34274800"}