{"id":"2412.14223","title":"Towards Precise Prediction Uncertainty in GNNs: Refining GNNs with\n  Topology-grouping Strategy","authors":"Hyunjin Seo, Kyusung Seo, Joonhyung Park, Eunho Yang","authorsParsed":[["Seo","Hyunjin",""],["Seo","Kyusung",""],["Park","Joonhyung",""],["Yang","Eunho",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 15:39:57 GMT"},{"version":"v2","created":"Sun, 23 Feb 2025 13:40:26 GMT"}],"updateDate":"2025-02-25","timestamp":1734536397000,"abstract":"  Recent advancements in graph neural networks (GNNs) have highlighted the\ncritical need of calibrating model predictions, with neighborhood prediction\nsimilarity recognized as a pivotal component. Existing studies suggest that\nnodes with analogous neighborhood prediction similarity often exhibit similar\ncalibration characteristics. Building on this insight, recent approaches\nincorporate neighborhood similarity into node-wise temperature scaling\ntechniques. However, our analysis reveals that this assumption does not hold\nuniversally. Calibration errors can differ significantly even among nodes with\ncomparable neighborhood similarity, depending on their confidence levels. This\nnecessitates a re-evaluation of existing GNN calibration methods, as a single,\nunified approach may lead to sub-optimal calibration. In response, we introduce\n**Simi-Mailbox**, a novel approach that categorizes nodes by both neighborhood\nsimilarity and their own confidence, irrespective of proximity or connectivity.\nOur method allows fine-grained calibration by employing *group-specific*\ntemperature scaling, with each temperature tailored to address the specific\nmiscalibration level of affiliated nodes, rather than adhering to a uniform\ntrend based on neighborhood similarity. Extensive experiments demonstrate the\neffectiveness of our **Simi-Mailbox** across diverse datasets on different GNN\narchitectures, achieving up to 13.79\\% error reduction compared to uncalibrated\nGNN predictions.\n","subjects":["Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"VufJpYaCoKPpBZiIkuRWQT0bvsg3MuIYrzZQF4KHfyc","pdfSize":"6957785"}