{
  "id": "2412.00864",
  "title": "Explicit and data-Efficient Encoding via Gradient Flow",
  "authors": "Kyriakos Flouris, Anna Volokitin, Gustav Bredell, Ender Konukoglu",
  "authorsParsed": [
    [
      "Flouris",
      "Kyriakos",
      ""
    ],
    [
      "Volokitin",
      "Anna",
      ""
    ],
    [
      "Bredell",
      "Gustav",
      ""
    ],
    [
      "Konukoglu",
      "Ender",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 1 Dec 2024 15:54:50 GMT"
    },
    {
      "version": "v2",
      "created": "Sat, 4 Jan 2025 05:09:44 GMT"
    }
  ],
  "updateDate": "2025-01-07",
  "timestamp": 1733068490000,
  "abstract": "  The autoencoder model typically uses an encoder to map data to a lower\ndimensional latent space and a decoder to reconstruct it. However, relying on\nan encoder for inversion can lead to suboptimal representations, particularly\nlimiting in physical sciences where precision is key. We introduce a\ndecoder-only method using gradient flow to directly encode data into the latent\nspace, defined by ordinary differential equations (ODEs). This approach\neliminates the need for approximate encoder inversion. We train the decoder via\nthe adjoint method and show that costly integrals can be avoided with minimal\naccuracy loss. Additionally, we propose a $2^{nd}$ order ODE variant,\napproximating Nesterov's accelerated gradient descent for faster convergence.\nTo handle stiff ODEs, we use an adaptive solver that prioritizes loss\nminimization, improving robustness. Compared to traditional autoencoders, our\nmethod demonstrates explicit encoding and superior data efficiency, which is\ncrucial for data-scarce scenarios in the physical sciences. Furthermore, this\nwork paves the way for integrating machine learning into scientific workflows,\nwhere precise and efficient encoding is critical. \\footnote{The code for this\nwork is available at \\url{https://github.com/k-flouris/gfe}.}\n",
  "subjects": [
    "Statistics/Machine Learning",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Machine Learning",
    "Mathematics/Optimization and Control",
    "Physics/Computational Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "M_UaGiLDaTLfV6WEGV23GStY41E4WoTVQS8DuU4BtzY",
  "pdfSize": "615379"
}