{
  "id": "2412.16551",
  "title": "Universal Machine Learning Interatomic Potentials are Ready for Phonons",
  "authors": "Antoine Loew, Dewen Sun, Hai-Chen Wang, Silvana Botti, and Miguel A.\n  L. Marques",
  "authorsParsed": [
    [
      "Loew",
      "Antoine",
      ""
    ],
    [
      "Sun",
      "Dewen",
      ""
    ],
    [
      "Wang",
      "Hai-Chen",
      ""
    ],
    [
      "Botti",
      "Silvana",
      ""
    ],
    [
      "Marques",
      "Miguel A. L.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 21 Dec 2024 09:28:28 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734773308000,
  "abstract": "  There has been an ongoing race for the past couple of years to develop the\nbest universal machine learning interatomic potential. This rapid growth has\ndriven researchers to create increasingly accurate models for predicting\nenergy, forces, and stresses, combining innovative architectures with big data.\nHere, these models are benchmarked for their performance in predicting phonon\nproperties, which are critical for understanding the vibrational and thermal\nbehavior of materials. Our analysis is based on around 10 000 ab initio phonon\ncalculations, enabling us to assess performance across a range of\nphonon-related parameters while testing the universal applicability of these\nmodels. The results reveal that some models are already capable of predicting\nphonon properties with a high level of accuracy. However, others still exhibit\nsubstantial inaccuracies, even if they excel in the prediction of the energy\nand the forces for materials close to dynamical equilibrium. These findings\nhighlight the importance of considering phonon-related properties in the\ndevelopment of universal machine learning interatomic potentials.\n",
  "subjects": [
    "Condensed Matter/Materials Science",
    "Physics/Computational Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "zXAI17dZ5M6M9cp59Jcvk7ycrTYlNUn04nkAqVmNsyI",
  "pdfSize": "1999045"
}