{
  "id": "2412.04641",
  "title": "Disentangled Representation Learning for Causal Inference with\n  Instruments",
  "authors": "Debo Cheng (1), Jiuyong Li (1), Lin Liu (1), Ziqi Xu (2), Weijia Zhang\n  (3), Jixue Liu (1) and Thuc Duy Le (1) ((1) UniSA STEM, University of South\n  Australia, (2) School of Computing Technologies, RMIT University, and (3)\n  School of Information and Physical Sciences, University of Newcastle)",
  "authorsParsed": [
    [
      "Cheng",
      "Debo",
      ""
    ],
    [
      "Li",
      "Jiuyong",
      ""
    ],
    [
      "Liu",
      "Lin",
      ""
    ],
    [
      "Xu",
      "Ziqi",
      ""
    ],
    [
      "Zhang",
      "Weijia",
      ""
    ],
    [
      "Liu",
      "Jixue",
      ""
    ],
    [
      "Le",
      "Thuc Duy",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 22:18:48 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733437128000,
  "abstract": "  Latent confounders are a fundamental challenge for inferring causal effects\nfrom observational data. The instrumental variable (IV) approach is a practical\nway to address this challenge. Existing IV based estimators need a known IV or\nother strong assumptions, such as the existence of two or more IVs in the\nsystem, which limits the application of the IV approach. In this paper, we\nconsider a relaxed requirement, which assumes there is an IV proxy in the\nsystem without knowing which variable is the proxy. We propose a Variational\nAutoEncoder (VAE) based disentangled representation learning method to learn an\nIV representation from a dataset with latent confounders and then utilise the\nIV representation to obtain an unbiased estimation of the causal effect from\nthe data. Extensive experiments on synthetic and real-world data have\ndemonstrated that the proposed algorithm outperforms the existing IV based\nestimators and VAE-based estimators.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Artificial Intelligence",
    "Statistics/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "mszni5iXEQc2mUaVmY5Nb9mhOF-31eTxpCbJmYvwSr8",
  "pdfSize": "2993885"
}