{
  "id": "2412.10648",
  "title": "Statistical Issues in the Diagnosis of Shaken Baby Syndrome/Abusive Head\n  Trauma",
  "authors": "Maria Cuellar",
  "authorsParsed": [
    [
      "Cuellar",
      "Maria",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 14 Dec 2024 02:35:17 GMT"
    },
    {
      "version": "v2",
      "created": "Mon, 20 Jan 2025 17:23:31 GMT"
    }
  ],
  "updateDate": "2025-01-22",
  "timestamp": 1734143717000,
  "abstract": "  The diagnosis of Shaken Baby Syndrome/Abusive Head Trauma (SBS/AHT) is\nfraught with controversy due to critical statistical deficiencies in the data\nunderpinning these diagnoses. This paper examines the reliability and\nscientific foundation of SBS/AHT through a statistical lens, highlighting the\nlack of independently verified ground truth, contextual biases, data\ncircularity, and diagnostic heterogeneity. These issues render current\nmethodologies inadequate and complicate evaluations of diagnostic accuracy,\nparticularly when legal determinations are integrated into medical assessments.\nWithout empirical evidence validating the specificity of symptoms like subdural\nhematoma, retinal hemorrhage, and brain swelling, the diagnosis remains\nuntested and its foundational validity unproven. We recommend that physicians\nfocus on reporting observed clinical signs and avoid making determinations of\nabuse, which should remain within the legal domain. Addressing these challenges\nrequires comprehensive, high-quality data collection encompassing contextual,\nmedical, and legal information to evaluate the accuracy, repeatability, and\nreproducibility of SBS/AHT diagnoses. These efforts are essential to protect\nvulnerable children while ensuring fairness and accuracy in legal proceedings\ninvolving allegations of abuse.\n",
  "subjects": [
    "Statistics/Applications"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "TPwpqEjxb5vzRNEcNyF_58ADPCx-XVnHB5Cki1aw42s",
  "pdfSize": "1351333"
}