{"id":"2412.09222","title":"Building a Privacy Web with SPIDEr -- Secure Pipeline for Information\n  De-Identification with End-to-End Encryption","authors":"Novoneel Chakraborty, Anshoo Tandon, Kailash Reddy, Kaushal Kirpekar,\n  Bryan Paul Robert, Hari Dilip Kumar, Abhilash Venkatesh, and Abhay Sharma","authorsParsed":[["Chakraborty","Novoneel",""],["Tandon","Anshoo",""],["Reddy","Kailash",""],["Kirpekar","Kaushal",""],["Robert","Bryan Paul",""],["Kumar","Hari Dilip",""],["Venkatesh","Abhilash",""],["Sharma","Abhay",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 12:24:12 GMT"}],"updateDate":"2024-12-13","timestamp":1734006252000,"abstract":"  Data de-identification makes it possible to glean insights from data while\npreserving user privacy. The use of Trusted Execution Environments (TEEs) allow\nfor the execution of de-identification applications on the cloud without the\nneed for a user to trust the third-party application provider. In this paper,\nwe present \\textit{SPIDEr - Secure Pipeline for Information De-Identification\nwith End-to-End Encryption}, our implementation of an end-to-end encrypted data\nde-identification pipeline. SPIDEr supports classical anonymisation techniques\nsuch as suppression, pseudonymisation, generalisation, and aggregation, as well\nas techniques that offer a formal privacy guarantee such as k-anonymisation and\ndifferential privacy. To enable scalability and improve performance on\nconstrained TEE hardware, we enable batch processing of data for differential\nprivacy computations. We present our design of the control flows for end-to-end\nsecure execution of de-identification operations within a TEE. As part of the\ncontrol flow for running SPIDEr within the TEE, we perform attestation, a\nprocess that verifies that the software binaries were properly instantiated on\na known, trusted platform.\n","subjects":["Computer Science/Cryptography and Security","Computer Science/Information Theory","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"z7BHUL9OeXFjDzgI0HQEo4JASCR8hkvtSLm1CzJWAIk","pdfSize":"552382"}