{"id":"2412.10853","title":"SEW: Self-calibration Enhanced Whole Slide Pathology Image Analysis","authors":"Haoming Luo, Xiaotian Yu, Shengxuming Zhang, Jiabin Xia, Yang Jian,\n  Yuning Sun, Liang Xue, Mingli Song, Jing Zhang, Xiuming Zhang, Zunlei Feng","authorsParsed":[["Luo","Haoming",""],["Yu","Xiaotian",""],["Zhang","Shengxuming",""],["Xia","Jiabin",""],["Jian","Yang",""],["Sun","Yuning",""],["Xue","Liang",""],["Song","Mingli",""],["Zhang","Jing",""],["Zhang","Xiuming",""],["Feng","Zunlei",""]],"versions":[{"version":"v1","created":"Sat, 14 Dec 2024 14:54:44 GMT"},{"version":"v2","created":"Fri, 14 Feb 2025 13:33:14 GMT"}],"updateDate":"2025-02-17","timestamp":1734188084000,"abstract":"  Pathology images are considered the ``gold standard\" for cancer diagnosis and\ntreatment, with gigapixel images providing extensive tissue and cellular\ninformation. Existing methods fail to simultaneously extract global structural\nand local detail features for comprehensive pathology image analysis\nefficiently. To address these limitations, we propose a self-calibration\nenhanced framework for whole slide pathology image analysis, comprising three\ncomponents: a global branch, a focus predictor, and a detailed branch. The\nglobal branch initially classifies using the pathological thumbnail, while the\nfocus predictor identifies relevant regions for classification based on the\nlast layer features of the global branch. The detailed extraction branch then\nassesses whether the magnified regions correspond to the lesion area. Finally,\na feature consistency constraint between the global and detail branches ensures\nthat the global branch focuses on the appropriate region and extracts\nsufficient discriminative features for final identification. These focused\ndiscriminative features prove invaluable for uncovering novel prognostic tumor\nmarkers from the perspective of feature cluster uniqueness and tissue spatial\ndistribution. Extensive experiment results demonstrate that the proposed\nframework can rapidly deliver accurate and explainable results for pathological\ngrading and prognosis tasks.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"e2fryqV6GR5wX2lfzm1B33iIAmH-4_1zL10tyyIClvg","pdfSize":"5202648"}