{"id":"2412.01229","title":"Multiple rebrightenings in the optical afterglow of GRB 210731A:\n  evidence for an asymmetric jet","authors":"Jin-Da Li, He Gao, Shunke Ai, Wei-Hua Lei","authorsParsed":[["Li","Jin-Da",""],["Gao","He",""],["Ai","Shunke",""],["Lei","Wei-Hua",""]],"versions":[{"version":"v1","created":"Mon, 2 Dec 2024 07:48:43 GMT"}],"updateDate":"2024-12-03","timestamp":1733125723000,"abstract":"  The broadband afterglow of Gamma-ray bursts (GRBs) is usually believed to\noriginate from the synchrotron radiation of electrons accelerated by the\nexternal shock of relativistic jets. Therefore, the jet structure should have a\nsignificant impact on the GRB afterglow features. The latest observations\nindicate that the GRB jets may possess intricate structures, such as Gaussian\nstructure, power-law structure, or jet-cocoon structure. Most recently, an\nabnormal afterglow of GRB 210731A has raised extensive attention, whose optical\nafterglow exhibites multiple rebrightening phenomena within 4 hours, posing a\nserious challenge to the standard afterglow model. Here we intend to interpret\nthe characteristics of GRB 210731A afterglows within the framework of\nnon-axisymmetric structured jets, where multiple distinct peaks in the\nafterglow light curve are caused by the uneven distribution of energy and\nvelocity within the jet in the azimuth angle direction. Through Monte Carlo\nMarkov Chain fitting, we show that a three-component asymmetric structured jet\ncan well explain the multi-band afterglow data. The energy difference among the\nthree components is about 1.5 orders of magnitude, with higher-energy\ncomponents exhibiting slower speeds. The radiation contribution of each\ncomponent has sequentially dominated the light curve of the afterglow,\nresulting in multiple peaks, with the highest peak occurring at the latest\ntime. We suggest that in the future, polarization observations should be\nconducted on afterglows with multiple brightening signatures, which will help\nto effectively distinguish the structured jet model from other alternative\nmodels, such as energy injection, and ultimately help to determine the true\nconfiguration of jets.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"AWfC_qYhTB1V1ZsNmDn0QO5ld10cAfvcBCFR0LxzkIs","pdfSize":"6088082"}