{"id":"2412.19962","title":"Properties of a static dipolar impurity in a 2D dipolar BEC","authors":"Neelam Shukla and Jeremy R Armstrong","authorsParsed":[["Shukla","Neelam",""],["Armstrong","Jeremy R",""]],"versions":[{"version":"v1","created":"Sat, 28 Dec 2024 01:09:24 GMT"}],"updateDate":"2024-12-31","timestamp":1735348164000,"abstract":"  We study a system of ultra cold dipolar Bose gas atoms confined in a\ntwo-dimensional (2D) harmonic trap with a dipolar impurity implanted at the\ncenter of the trap. Due to recent experimental progress in dipolar condensates,\nwe focused on calculating properties of dipolar impurity systems that might\nguide experimentalists if they choose to study impurities in dipolar gases. We\nused the Gross-Pitaevskii formalism solved numerically via the split-step\nCrank-Nicolson method. We chose parameters of the background gas to be\nconsistent with dysprosium (Dy), one of the strongest magnetic dipoles and of\ncurrent experimental interest, and used chromium (Cr), erbium (Er), terbium\n(Tb), and Dy for the impurity. The dipole moments were aligned by an external\nfield along what was chosen to be the z-axis, and studied 2D confinements that\nwere perpendicular or parallel to the external field. We show density contour\nplots for the two confinements, 1D cross sections of the densities, calculated\nself-energies of the impurities while varying both number of atoms in the\ncondensate and the symmetry of the trap. We also calculated the time evolution\nof the density of an initially pure system where an impurity is introduced. Our\nresults found that while the self-energy increases in magnitude with increasing\nnumber of particles, it is reduced when the trap anisotropy follows the natural\nanisotropy of the gas, i.e., elongated along the z-axis in the case of parallel\nconfinement. This work builds upon work done in Bose gases with zero-range\ninteractions and demonstrates some of the features that could be found when\nexploring dipolar impurities in 2D Bose gases.\n","subjects":["Condensed Matter/Quantum Gases"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"OxdPSp_SSnUbeHJeLNttI-6eHlK-A84hQu2Apk15TBE","pdfSize":"1233570"}