{"id":"2412.03921","title":"Oscillatory Instabilities of a One-Spot Pattern in the Schnakenberg\n  Reaction-Diffusion System in $3$-D Domains","authors":"Siwen Deng, Justin Tzou, Shuangquan Xie","authorsParsed":[["Deng","Siwen",""],["Tzou","Justin",""],["Xie","Shuangquan",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 06:46:52 GMT"}],"updateDate":"2024-12-06","timestamp":1733381212000,"abstract":"  For an activator-inhibitor reaction-diffusion system in a bounded\nthree-dimensional domain $\\Omega$ of $O(1)$ volume and small activator\ndiffusivity of $O(\\varepsilon^2)$, we employ a hybrid asymptotic-numerical\nmethod to investigate two instabilities of a localized one-spot equilibrium\nthat result from Hopf bifurcations: an amplitude instability leading to growing\noscillations in spot amplitude, and a translational instability leading to\ngrowing oscillations of the location of the spot's center $\\mathbf{x}_0 \\in\n\\Omega$. Here, a one-spot equilibrium is one in which the activator\nconcentration is exponentially small everywhere in $\\Omega$ except in a\nlocalized region of $O(\\varepsilon)$ about $\\mathbf{x}_0 \\in \\Omega$ where its\nconcentration is $O(1)$. We find that the translation instability is governed\nby a $3\\times 3$ nonlinear matrix eigenvalue problem. The entries of this\nmatrix involve terms calculated from certain Green's functions, which encode\ninformation about the domain's geometry. In this nonlinear matrix eigenvalue\nsystem, the most unstable eigenvalue determines the oscillation frequency at\nonset, while the corresponding eigenvector determines the direction of\noscillation. We demonstrate the impact of domain geometry and defects on this\ninstability, providing analytic insights into how they select the preferred\ndirection of oscillation. For the amplitude instability, we illustrate the\nintricate way in which the Hopf bifurcation threshold $\\tau_H$ varies with a\nfeed-rate parameter $A$. In particular, we show that the $\\tau_H$ versus $A$\nrelationship possesses two saddle-nodes, with different branches scaling\ndifferently with the small parameter $\\varepsilon$. All asymptotic results are\nconfirmed by finite elements solutions of the full reaction-diffusion system.\n","subjects":["Nonlinear Sciences/Pattern Formation and Solitons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"a2wBR_8jhkzDu8LvDc62uP-bfDrTjgBwafPyNvJQHzQ","pdfSize":"2164522"}