{
  "id": "2412.12305",
  "title": "Investigation of the Nature of the B[e] Star CI Cam in the Optical Range",
  "authors": "E. A. Barsukova, A. N. Burenkov, V. P. Goranskij, S. V. Zharikov, L.\n  Iliev, N. Manset, N. V. Metlova, A. S. Miroshnichenko, A. V. Moiseeva, P. L.\n  Nedialkov, E. A. Semenko, K. Stoyanov, and I. A. Yakunin",
  "authorsParsed": [
    [
      "Barsukova",
      "E. A.",
      ""
    ],
    [
      "Burenkov",
      "A. N.",
      ""
    ],
    [
      "Goranskij",
      "V. P.",
      ""
    ],
    [
      "Zharikov",
      "S. V.",
      ""
    ],
    [
      "Iliev",
      "L.",
      ""
    ],
    [
      "Manset",
      "N.",
      ""
    ],
    [
      "Metlova",
      "N. V.",
      ""
    ],
    [
      "Miroshnichenko",
      "A. S.",
      ""
    ],
    [
      "Moiseeva",
      "A. V.",
      ""
    ],
    [
      "Nedialkov",
      "P. L.",
      ""
    ],
    [
      "Semenko",
      "E. A.",
      ""
    ],
    [
      "Stoyanov",
      "K.",
      ""
    ],
    [
      "Yakunin",
      "I. A.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 19:18:53 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734376733000,
  "abstract": "  We report the results of 24 years of photometric and spectroscopic monitoring\nof CI Cam since its outburst in 1998. In the early years of our research, we\nidentified a system component responsible for the emission of the He II 4686\nline, which moves in an elliptical orbit with a period of 19.407 days and an\neccentricity from 0.44 to 0.49. Variations in optical brightness with the same\nperiod were observed, with an average amplitude of 0.04 magnitudes. The total\namplitude of the He II radial velocity variations was approximately 380\nkilometers per second. The equivalent width of the line varied on timescales of\ntens of minutes as well as with the orbital period, reaching maximum values\nwhen the companion passed the descending node of the orbit. The intensity of\nthe He II 4686 emission has gradually increased over time. Our photometric\nmonitoring revealed pulsations of the main B component of the CI Cam system.\nBetween 2005 and 2009, the B star exhibited multiperiodic pulsations, however,\nsince 2012, it pulsated in a single mode. We interpret the pulsations from 2005\nto 2009 as a resonance of radial modes, with the residual stable mode being the\nfirst overtone. The pulsations are coherent over several months, with average\namplitudes from 0.02 to 0.04 magnitudes in the V band. The pulsation data\nconstrain the spectral type of the primary component of B0 to B2 III, the\ndistance to the system from 2.5 to 4.5 kpc. The classification of the main\ncomponent of CI Cam as a supergiant is ruled out due to the observed pulsation\nperiods. CI Cam is likely in the stage after the first mass exchange and may\nbelong to the FS CMa-type objects.\n",
  "subjects": [
    "Astrophysics/Solar and Stellar Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "drs3DOGq1ixipCcWIlZB_ltIXSuLeeKUIR9mjUWY43w",
  "pdfSize": "1237098"
}