{
  "id": "2412.09476",
  "title": "SIRI-2 Detection of the Gamma-ray Burst 221009A",
  "authors": "Lee J. Mitchell and Justin D. Finke and Bernard Phlips and W. Neil\n  Johnson and Emily Kong",
  "authorsParsed": [
    [
      "Mitchell",
      "Lee J.",
      ""
    ],
    [
      "Finke",
      "Justin D.",
      ""
    ],
    [
      "Phlips",
      "Bernard",
      ""
    ],
    [
      "Johnson",
      "W. Neil",
      ""
    ],
    [
      "Kong",
      "Emily",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 17:21:30 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1734024090000,
  "abstract": "  SIRI-2 is a collection of Strontium Iodide gamma-ray detectors sensitive at\napproximately 400 keV to 10 MeV, launched on the Department of Defense's\nSTPSat-6 to geosynchronous orbit. SIRI-2 detected the gamma-ray burst (GRB)\n221009A and, unlike most GRB detectors, was not saturated and did not require\nany pulse pile-up corrections. The energetics of this burst as measured by\nSIRI-2 are consistent with those found by other instruments, and the Band\nfunction fits to the spectra are consistent with that from the unsaturated\nInsight and GECAM instruments, and similar to corrected spectra from the Fermi\nGamma-ray Burst Monitor, but softer than those found by Konus-Wind when that\ninstrument was saturated. The total fluence measured with SIRI-2 was measured\nto be 0.140 +/- 0.002 erg cm-2, lower than other instruments, likely due to the\nincreasing background of SIRI-2 forcing the calculation to use a smaller time\ninterval. An extrapolation of the distributions of fluences from GRBs to the\nfluence of 221009A measured with SIRI-2 indicates bursts brighter than this one\nshould occur about once every 4,000 years.\n",
  "subjects": [
    "Astrophysics/High Energy Astrophysical Phenomena"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "jIn4aQts8CsgB7eXL2_D5Zzp9U5JrIWDQxSVSfzIHp8",
  "pdfSize": "926780"
}