{"id":"2412.07150","title":"Relativistic Mott transition in strongly correlated artificial graphene","authors":"Liguo Ma, Raghav Chaturvedi, Phuong X. Nguyen, Kenji Watanabe, Takashi\n  Taniguchi, Kin Fai Mak, Jie Shan","authorsParsed":[["Ma","Liguo",""],["Chaturvedi","Raghav",""],["Nguyen","Phuong X.",""],["Watanabe","Kenji",""],["Taniguchi","Takashi",""],["Mak","Kin Fai",""],["Shan","Jie",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 03:17:39 GMT"}],"updateDate":"2024-12-11","timestamp":1733800659000,"abstract":"  The realization of graphene has provided a bench-top laboratory for quantum\nelectrodynamics. The low-energy excitations of graphene are two-dimensional\nmassless Dirac fermions with opposite chiralities at the $\\pm$K valleys of the\ngraphene Brillouin zone. It has been speculated that the electron-electron\ninteractions in graphene could spontaneously break the chiral symmetry to\ninduce a finite mass for Dirac fermions, in analogue to dynamical mass\ngeneration in elementary particles. The phenomenon is also known as the\nrelativistic Mott transition and has not been observed in pristine graphene\nbecause the interaction strength is insufficient. Here, we report the\nrealization of strongly correlated artificial graphene and the observation of\nthe relativistic Mott transition in twisted WSe2 tetralayers. Using magneto\ntransport, we show that the first $\\Gamma$-valley moir\\'e valence band mimics\nthe low-energy graphene band structure. At half-band filling, the system\nexhibits hallmarks of massless Dirac fermions, including an anomalous Landau\nfan originated from a $\\pi$-Berry phase and a square-root density dependence of\nthe cyclotron mass. We tune the interaction across the semimetal-insulator\ntransition by reducing the twist angle below about 2.7 degrees. The emergent\ninsulator is compatible with an antiferromagnetic Mott insulator. Our results\nopen the possibility of studying strongly correlated Dirac fermions in a\ncondensed matter system.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"K7e1ZdDEwM63pcZyFRJr1M17pm-CrIIP6n0_A9RVCTs","pdfSize":"1149451"}