{
  "id": "2412.10633",
  "title": "Magnetic flux emergence and solar eruptions in partially ionized plasmas",
  "authors": "Georgios Chouliaras, V. Archontis",
  "authorsParsed": [
    [
      "Chouliaras",
      "Georgios",
      ""
    ],
    [
      "Archontis",
      "V.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 14 Dec 2024 01:24:22 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734139462000,
  "abstract": "  We have performed 3D MHD simulations to study the effect of partial\nionization in the process of magnetic flux emergence in the Sun. In fact, we\ncontinue previous work and we now focus: 1) on the emergence of the magnetic\nfields above the solar photosphere and 2) on the eruptive activity, which\nfollows the emergence into the corona. We find that in the simulations with\npartial ionization (PI), the structure of the emerging field consists of\narch-like fieldlines with very little twist since the axis of the initial\nrising field remains below the photosphere. The plasma inside the emerging\nvolume is less dense and it is moving faster compared to the fully ionized (FI)\nsimulation. In both cases, new flux ropes (FR) are formed due to reconnection\nbetween emerging fieldlines, and they eventually erupt in an ejective manner\ntowards the outer solar atmosphere. We are witnessing three major eruptions in\nboth simulations. At least for the first eruption, the formation of the\neruptive FR occurs in the low atmosphere in the FI case and at coronal heights\nin the PI case. Also, in the first PI eruption, part of the eruptive FR carries\nneutrals in the high atmosphere, for a short period of time. Overall, the\neruptions are relatively faster in the PI case, while a considerable amount of\naxial flux is found above the photosphere during the eruptions in both\nsimulations.\n",
  "subjects": [
    "Astrophysics/Solar and Stellar Astrophysics",
    "Physics/Plasma Physics",
    "Physics/Space Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "bCPXxwtKbc3GiRMpP0tfsznwkCBkhW6ZtGNrxQbK5iU",
  "pdfSize": "18278893"
}