{
  "id": "2412.06447",
  "title": "Investigating the underlying structure of vector hidden-charm tetraquark\n  states via their electromagnetic characteristics",
  "authors": "U. \\\"Ozdem",
  "authorsParsed": [
    [
      "Özdem",
      "U.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 12:46:11 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733748371000,
  "abstract": "  Accessing a full picture of the internal structure of hadrons would be a key\ntopic of hadron physics, with the main motivation to study the strong\ninteraction binding the visible matter. Furthermore, the underlying structure\nof known exotic states remains an unresolved fundamental issue in hadron\nphysics, which is currently being addressed by hadron physics community. It is\nwell known that electromagnetic characteristics can serve as a distinguishing\nfeature for states whose internal structures are complex and not yet fully\nunderstood. The aim of this study is to determine the magnetic moments of\nvector hidden-charm tetraquark states by making use of QCD light-cone sum\nrules. In order to achieve this objective, the states mentioned above are\nconsidered in terms of the diquark-antidiquark structure. Subsequently, a\ncomprehensive examination is conducted, with four distinct interpolating\ncurrents being given particular consideration, as these have the potential to\ncouple with the aforementioned states. It has been observed that there are\nconsiderable discrepancies between the magnetic moment results extracted\nemploying different diquark-antidiquark structures. Such a prediction may be\ninterpreted as the possibility of more than one tetraquark with the identical\nquantum numbers and similar quark constituents, but with different magnetic\nmoments. The numerical predictions yielded have led to the conclusion that the\nmagnetic moments of the vector hidden-charm tetraquark states are capable of\nprojecting the inner structure of these states, which may then be used to\ndetermine their quark-gluon structure and quantum numbers. In order to provide\na comprehensive analysis, the individual quark contributions to the magnetic\nmoments are also examined.\n",
  "subjects": [
    "Physics/High Energy Physics - Phenomenology",
    "Physics/High Energy Physics - Experiment",
    "Physics/High Energy Physics - Lattice"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "dRRqIkhIjrHqF82yhjG79HMCq_Ys6NRvFbtVXpMYrw8",
  "pdfSize": "916788"
}