{"id":"2412.08009","title":"FLRONet: Deep Operator Learning for High-Fidelity Fluid Flow Field\n  Reconstruction from Sparse Sensor Measurements","authors":"Hiep Vo Dang, Joseph B. Choi, Phong C. H. Nguyen","authorsParsed":[["Dang","Hiep Vo",""],["Choi","Joseph B.",""],["Nguyen","Phong C. H.",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 01:28:48 GMT"},{"version":"v2","created":"Thu, 12 Dec 2024 02:58:41 GMT"},{"version":"v3","created":"Thu, 30 Jan 2025 17:02:31 GMT"},{"version":"v4","created":"Sun, 2 Feb 2025 14:46:42 GMT"}],"updateDate":"2025-02-04","timestamp":1733880528000,"abstract":"  Reconstructing high-fidelity fluid flow fields from sparse sensor\nmeasurements is vital for many science and engineering applications but remains\nchallenging because of dimensional disparities between state and observational\nspaces. Due to such dimensional differences, the measurement operator becomes\nill-conditioned and non-invertible, making the reconstruction of flow fields\nfrom sensor measurements extremely difficult. Although sparse optimization and\nmachine learning address the above problems to some extent, questions about\ntheir generalization and efficiency remain, particularly regarding the\ndiscretization dependence of these models. In this context, deep operator\nlearning offers a better solution as this approach models mappings between\ninfinite-dimensional functional spaces, enabling superior generalization and\ndiscretization-independent reconstruction. We introduce FLRONet, a deep\noperator learning framework that is trained to reconstruct fluid flow fields\nfrom sparse sensor measurements. FLRONet employs a branch-trunk network\narchitecture to represent the inverse measurement operator that maps sensor\nobservations to the original flow field, a continuous function of both space\nand time. Validation performed on the CFDBench dataset has demonstrated that\nFLRONet consistently achieves high levels of reconstruction accuracy and\nrobustness, even in scenarios where sensor measurements are inaccurate or\nmissing. Furthermore, the operator learning approach endows FLRONet with the\ncapability to perform zero-shot super-resolution in both spatial and temporal\ndomains, offering a solution for rapid reconstruction of high-fidelity flow\nfields.\n","subjects":["Physics/Fluid Dynamics","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"umM6voWsnolCndqWDbiBdlsTZ8woUw5JY305JpCEWaY","pdfSize":"8649115"}