{"id":"2412.15378","title":"What Leads to Administrative Bloat? A Dynamic Model of Administrative\n  Cost and Waste","authors":"Vicky Chuqiao Yang and Levi Grenier","authorsParsed":[["Yang","Vicky Chuqiao",""],["Grenier","Levi",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 20:16:21 GMT"}],"updateDate":"2024-12-23","timestamp":1734639381000,"abstract":"  We formulate a quantitative, dynamic model that captures how environmental\nchange, alignment with the environment, managerial decisions, and resource\nconstraints interact to give rise to administrative bloat in organizations,\nresulting in organizational failure. Inspired by empirical findings, we model\ncodified processes that, while initially useful, become obsolete as conditions\nchange, consuming resources until actively removed. Our model predicts a\ncritical threshold in management decision parameters -- the propensity to\ncreate processes in response to problems, and the propensity to prune obsolete\nprocesses in response to administrative burden. This threshold determines two\npossible outcomes: a sustainable equilibrium, where administrative costs\nstabilize below resource limits, and runaway administrative bloat, where costs\n-- dominated by obsolete processes -- grow to resource capacity. The threshold\nworsens with faster environmental changes. A short-term environmental shock\nexceeding a critical threshold can push organizations from sustainability into\nbloat cycles, highlighting the risks posed by events like technological\nupheaval. Importantly, process creation and pruning propensities have\nasymmetrical impacts on outcomes. Avoiding administrative bloat requires\ncarefully balancing codified and ad-hoc solutions, weighing error costs, and\nanticipating future process obsolescence. Finally, We also discuss how our\nmodel may be applied to generate insight from existing and future data.\n","subjects":["Physics/Physics and Society","Mathematics/Dynamical Systems","Nonlinear Sciences/Adaptation and Self-Organizing Systems"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"-odB_UcdSfdE55MFk9tAQyyLKYI5wiFv5fcYd6fqFIw","pdfSize":"1635923"}