{"id":"2412.16299","title":"Interacting dark sector with quadratic coupling: theoretical and\n  observational viability","authors":"Jaelsson S. Lima and Rodrigo von Marttens and Luciano Casarini","authorsParsed":[["Lima","Jaelsson S.",""],["von Marttens","Rodrigo",""],["Casarini","Luciano",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 19:17:28 GMT"},{"version":"v2","created":"Tue, 21 Jan 2025 00:57:00 GMT"}],"updateDate":"2025-01-22","timestamp":1734722248000,"abstract":"  Models proposing a non-gravitational interaction between dark energy (DE) and\ndark matter (CDM) have been extensively studied as alternatives to the standard\ncosmological model. A common approach to describing the DE-CDM coupling assumes\nit to be linearly proportional to the dark energy density. In this work, we\nconsider the model with interaction term\n$Q=3H\\gamma{\\rho_{x}^{2}}/{(\\rho_{c}+\\rho_{x})}$. We show that for positive\nvalues of $\\gamma$ this model predicts a future violation of the Weak Energy\nCondition (WEC) for the dark matter component, and for a specific range of\nnegative values of $\\gamma$ the CDM energy density can be negative in the past.\nWe perform a parameter selection analysis for this model using data from Type\nIa supernovae, Cosmic Chronometers, Baryon Acoustic Oscillations, and CMB\ncombined with the Hubble constant $H_0$ prior. Imposing a prior to ensure that\nthe WEC is not violated, our model is consistent with $\\Lambda$CDM in 2$\\sigma$\nC.L.. In reality, the WEC prior shifts the constraints towards smaller values\nof $H_0$, highlighting an increase in the tension on the Hubble parameter.\nHowever, it significantly improves the parameter constraints, with a preference\nfor smaller values of $\\sigma_8$, alleviating the $\\sigma_8$ tension between\nthe CMB results from Planck 2018 and the weak gravitational lensing\nobservations from the KiDS-1000 cosmic shear survey. In the case without the\nWEC prior, our model seems to alleviate the $H_0$ tension, which is related to\nthe positive value of the interaction parameter $\\gamma$.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"-0QW8mxmyx8pdHKRCNXQ904UN9OyAn5ngL06WkClczk","pdfSize":"9475756"}