{"id":"2412.08984","title":"Predicting Emergency Department Visits for Patients with Type II\n  Diabetes","authors":"Javad M Alizadeh, Jay S Patel, Gabriel Tajeu, Yuzhou Chen, Ilene L\n  Hollin, Mukesh K Patel, Junchao Fei and Huanmei Wu","authorsParsed":[["Alizadeh","Javad M",""],["Patel","Jay S",""],["Tajeu","Gabriel",""],["Chen","Yuzhou",""],["Hollin","Ilene L",""],["Patel","Mukesh K",""],["Fei","Junchao",""],["Wu","Huanmei",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 06:37:32 GMT"}],"updateDate":"2024-12-13","timestamp":1733985452000,"abstract":"  Over 30 million Americans are affected by Type II diabetes (T2D), a treatable\ncondition with significant health risks. This study aims to develop and\nvalidate predictive models using machine learning (ML) techniques to estimate\nemergency department (ED) visits among patients with T2D. Data for these\npatients was obtained from the HealthShare Exchange (HSX), focusing on\ndemographic details, diagnoses, and vital signs. Our sample contained 34,151\npatients diagnosed with T2D which resulted in 703,065 visits overall between\n2017 and 2021. A workflow integrated EMR data with SDoH for ML predictions. A\ntotal of 87 out of 2,555 features were selected for model construction. Various\nmachine learning algorithms, including CatBoost, Ensemble Learning, K-nearest\nNeighbors (KNN), Support Vector Classification (SVC), Random Forest, and\nExtreme Gradient Boosting (XGBoost), were employed with tenfold\ncross-validation to predict whether a patient is at risk of an ED visit. The\nROC curves for Random Forest, XGBoost, Ensemble Learning, CatBoost, KNN, and\nSVC, were 0.82, 0.82, 0.82, 0.81, 0.72, 0.68, respectively. Ensemble Learning\nand Random Forest models demonstrated superior predictive performance in terms\nof discrimination, calibration, and clinical applicability. These models are\nreliable tools for predicting risk of ED visits among patients with T2D. They\ncan estimate future ED demand and assist clinicians in identifying critical\nfactors associated with ED utilization, enabling early interventions to reduce\nsuch visits. The top five important features were age, the difference between\nvisitation gaps, visitation gaps, R10 or abdominal and pelvic pain, and the\nIndex of Concentration at the Extremes (ICE) for income.\n","subjects":["Quantitative Biology/Quantitative Methods","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"EH7KFELZ_tMoHMJhPJ0JKzLqWlpInql-AaXIF87PED4","pdfSize":"1439142"}