{"id":"2412.03728","title":"Monogamy of entanglement inspired protocol to quantify bipartite\n  entanglement using spin squeezing","authors":"Diego Fallas Padilla, Mingjian Zhu, Han Pu","authorsParsed":[["Padilla","Diego Fallas",""],["Zhu","Mingjian",""],["Pu","Han",""]],"versions":[{"version":"v1","created":"Wed, 4 Dec 2024 21:49:45 GMT"}],"updateDate":"2024-12-06","timestamp":1733348985000,"abstract":"  Quantum entanglement is an essential resource for several branches of quantum\nscience and technology, however, entanglement detection can be a challenging\ntask, specifically, if typical entanglement measures such as linear\nentanglement entropy or negativity are the metrics of interest. Here we propose\na protocol to detect bipartite entanglement in a system of $N$ qubits inspired\nby the concept of monogamy of entanglement. We argue that given a total system\nwith some bipartite entanglement between two subsystems, subsequent unitary\nevolution, and measurement of one of the individual subsystems might be used to\nquantify the entanglement between the two. To address the difficulty of\ndetection, we propose to use spin squeezing to quantify the entanglement within\nthe individual subsystem, knowing that the relation between spin squeezing and\nsome entanglement measures is not one-to-one, we give some suggestions on how a\nclever choice of squeezing Hamiltonian can lead to better results in our\nprotocol. For systems with a small number of qubits, we derive analytical\nresults and show how our protocol can work optimally for GHZ states, moreover,\nfor larger systems we show how the accuracy of the protocol can be improved by\na proper choice of the squeezing Hamiltonian. Our protocol presents an\nalternative for entanglement detection in platforms where state tomography is\ninaccessible (in widely separated entangled systems, for example) or hard to\nperform, additionally, the ideas presented here can be extended beyond\nspin-only systems to expand its applicability.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"XS8yOjkeKY0ysQzzsfAtuD9u7NtsdwlZcZJiPljykng","pdfSize":"2147752"}