{
  "id": "2412.17040",
  "title": "HyperNet Fields: Efficiently Training Hypernetworks without Ground Truth\n  by Learning Weight Trajectories",
  "authors": "Eric Hedlin, Munawar Hayat, Fatih Porikli, Kwang Moo Yi, Shweta\n  Mahajan",
  "authorsParsed": [
    [
      "Hedlin",
      "Eric",
      ""
    ],
    [
      "Hayat",
      "Munawar",
      ""
    ],
    [
      "Porikli",
      "Fatih",
      ""
    ],
    [
      "Yi",
      "Kwang Moo",
      ""
    ],
    [
      "Mahajan",
      "Shweta",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 22 Dec 2024 14:37:10 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734878230000,
  "abstract": "  To efficiently adapt large models or to train generative models of neural\nrepresentations, Hypernetworks have drawn interest. While hypernetworks work\nwell, training them is cumbersome, and often requires ground truth optimized\nweights for each sample. However, obtaining each of these weights is a training\nproblem of its own-one needs to train, e.g., adaptation weights or even an\nentire neural field for hypernetworks to regress to. In this work, we propose a\nmethod to train hypernetworks, without the need for any per-sample ground\ntruth. Our key idea is to learn a Hypernetwork `Field` and estimate the entire\ntrajectory of network weight training instead of simply its converged state. In\nother words, we introduce an additional input to the Hypernetwork, the\nconvergence state, which then makes it act as a neural field that models the\nentire convergence pathway of a task network. A critical benefit in doing so is\nthat the gradient of the estimated weights at any convergence state must then\nmatch the gradients of the original task -- this constraint alone is sufficient\nto train the Hypernetwork Field. We demonstrate the effectiveness of our method\nthrough the task of personalized image generation and 3D shape reconstruction\nfrom images and point clouds, demonstrating competitive results without any\nper-sample ground truth.\n",
  "subjects": [
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "1yC_En7fhFt8qqidpGF_J11xwIc28MLSfEl6xQuCR8w",
  "pdfSize": "12571074"
}