{
  "id": "2412.07324",
  "title": "Label Distribution Learning using the Squared Neural Family on the\n  Probability Simplex",
  "authors": "Daokun Zhang, Russell Tsuchida, Dino Sejdinovic",
  "authorsParsed": [
    [
      "Zhang",
      "Daokun",
      ""
    ],
    [
      "Tsuchida",
      "Russell",
      ""
    ],
    [
      "Sejdinovic",
      "Dino",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 09:12:02 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733821922000,
  "abstract": "  Label distribution learning (LDL) provides a framework wherein a distribution\nover categories rather than a single category is predicted, with the aim of\naddressing ambiguity in labeled data. Existing research on LDL mainly focuses\non the task of point estimation, i.e., pinpointing an optimal distribution in\nthe probability simplex conditioned on the input sample. In this paper, we\nestimate a probability distribution of all possible label distributions over\nthe simplex, by unleashing the expressive power of the recently introduced\nSquared Neural Family (SNEFY). With the modeled distribution, label\ndistribution prediction can be achieved by performing the expectation operation\nto estimate the mean of the distribution of label distributions. Moreover, more\ninformation about the label distribution can be inferred, such as the\nprediction reliability and uncertainties. We conduct extensive experiments on\nthe label distribution prediction task, showing that our distribution modeling\nbased method can achieve very competitive label distribution prediction\nperformance compared with the state-of-the-art baselines. Additional\nexperiments on active learning and ensemble learning demonstrate that our\nprobabilistic approach can effectively boost the performance in these settings,\nby accurately estimating the prediction reliability and uncertainties.\n",
  "subjects": [
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "4Gn-PuundHkN-nFLuk24AqPtfzCiTwJDgmPYbp6r-4Q",
  "pdfSize": "540611"
}