{"id":"2412.06494","title":"A cautionary tale on the cost-effectiveness of collaborative AI in\n  real-world medical applications","authors":"Francesco Cremonesi, Lucia Innocenti, Sebastien Ourselin, Vicky Goh,\n  Michela Antonelli and Marco Lorenzi","authorsParsed":[["Cremonesi","Francesco",""],["Innocenti","Lucia",""],["Ourselin","Sebastien",""],["Goh","Vicky",""],["Antonelli","Michela",""],["Lorenzi","Marco",""]],"versions":[{"version":"v1","created":"Mon, 9 Dec 2024 13:50:52 GMT"}],"updateDate":"2024-12-10","timestamp":1733752252000,"abstract":"  Background. Federated learning (FL) has gained wide popularity as a\ncollaborative learning paradigm enabling collaborative AI in sensitive\nhealthcare applications. Nevertheless, the practical implementation of FL\npresents technical and organizational challenges, as it generally requires\ncomplex communication infrastructures. In this context, consensus-based\nlearning (CBL) may represent a promising collaborative learning alternative,\nthanks to the ability of combining local knowledge into a federated decision\nsystem, while potentially reducing deployment overhead. Methods. In this work\nwe propose an extensive benchmark of the accuracy and cost-effectiveness of a\npanel of FL and CBL methods in a wide range of collaborative medical data\nanalysis scenarios. The benchmark includes 7 different medical datasets,\nencompassing 3 machine learning tasks, 8 different data modalities, and\nmulti-centric settings involving 3 to 23 clients. Findings. Our results reveal\nthat CBL is a cost-effective alternative to FL. When compared across the panel\nof medical dataset in the considered benchmark, CBL methods provide equivalent\naccuracy to the one achieved by FL.Nonetheless, CBL significantly reduces\ntraining time and communication cost (resp. 15 fold and 60 fold decrease) (p <\n0.05). Interpretation. This study opens a novel perspective on the deployment\nof collaborative AI in real-world applications, whereas the adoption of\ncost-effective methods is instrumental to achieve sustainability and\ndemocratisation of AI by alleviating the need for extensive computational\nresources.\n","subjects":["Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"eHCpCWj2kPHex0IcfJkP6pxYIka3zzPlaP6qZN_DsR8","pdfSize":"1083933"}