{
  "id": "2412.03281",
  "title": "Fast and flexible long-range models for atomistic machine learning",
  "authors": "Philip Loche, Kevin K. Huguenin-Dumittan, Melika Honarmand, Qianjun\n  Xu, Egor Rumiantsev, Wei Bin How, Marcel F. Langer, Michele Ceriotti",
  "authorsParsed": [
    [
      "Loche",
      "Philip",
      ""
    ],
    [
      "Huguenin-Dumittan",
      "Kevin K.",
      ""
    ],
    [
      "Honarmand",
      "Melika",
      ""
    ],
    [
      "Xu",
      "Qianjun",
      ""
    ],
    [
      "Rumiantsev",
      "Egor",
      ""
    ],
    [
      "How",
      "Wei Bin",
      ""
    ],
    [
      "Langer",
      "Marcel F.",
      ""
    ],
    [
      "Ceriotti",
      "Michele",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 12:42:16 GMT"
    },
    {
      "version": "v2",
      "created": "Wed, 12 Feb 2025 10:01:32 GMT"
    }
  ],
  "updateDate": "2025-02-13",
  "timestamp": 1733316136000,
  "abstract": "  Most atomistic machine learning (ML) models rely on a locality ansatz, and\ndecompose the energy into a sum of short-ranged, atom-centered contributions.\nThis leads to clear limitations when trying to describe problems that are\ndominated by long-range physical effects - most notably electrostatics. Many\napproaches have been proposed to overcome these limitations, but efforts to\nmake them efficient and widely available are hampered by the need to\nincorporate an ad hoc implementation of methods to treat long-range\ninteractions. We develop a framework aiming to bring some of the established\nalgorithms to evaluate non-bonded interactions - including Ewald summation,\nclassical particle-mesh Ewald (PME), and particle-particle/particle-mesh (P3M)\nEwald - into atomistic ML. We provide a reference implementation for pyTorch as\nwell as an experimental one for JAX. Beyond Coulomb and more general long-range\npotentials, we introduce purified descriptors which disregard the immediate\nneighborhood of each atom, and are more suitable for general long-ranged ML\napplications. Our implementations are fast, feature-rich, and modular: They\nprovide an accurate evaluation of physical long-range forces that can be used\nin the construction of (semi)empirical baseline potentials; they exploit the\navailability of automatic differentiation to seamlessly combine long-range\nmodels with conventional, local ML schemes; and they are sufficiently flexible\nto implement more complex architectures that use physical interactions as\nbuilding blocks. We benchmark and demonstrate our torch-pme and jax-pme\nlibraries to perform molecular dynamics simulations, to train ML potentials,\nand to evaluate long-range equivariant descriptors of atomic structures.\n",
  "subjects": [
    "Physics/Chemical Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "uY_zK_QjvBjz_MQNKujSui2Tjtr2IBYsAPq32eaEgIM",
  "pdfSize": "1048530"
}