{"id":"2412.15144","title":"Primordial Gravitational Wave Probes of Non-Standard Thermal Histories","authors":"Annet Konings, Mariia Marinichenko, Oleksii Mikulenko, Subodh P. Patil","authorsParsed":[["Konings","Annet",""],["Marinichenko","Mariia",""],["Mikulenko","Oleksii",""],["Patil","Subodh P.",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 18:26:40 GMT"}],"updateDate":"2024-12-20","timestamp":1734632800000,"abstract":"  Primordial gravitational waves propagate almost unimpeded from the moment\nthey are generated to the present epoch. Nevertheless, they are subject to\nconvolution with a non-trivial transfer function. Within the standard thermal\nhistory, shifts in the temperature-redshift relation combine with damping\neffects by free streaming neutrinos to non-trivially process different\nwavelengths during radiation domination, with subsequently negligible effects\nat later times. Presuming a nearly scale invariant primordial spectrum, one\nobtains a characteristic late time spectrum, deviations from which would\nindicate departures from the standard thermal history. Given the paucity of\nprobes of the early universe physics before nucleosynthesis, it is useful to\nclassify how deviations from the standard thermal history of the early universe\ncan be constrained from observations of the late time stochastic background.\nThe late time spectral density has a plateau at high frequencies that can in\nprinciple be significantly enhanced or suppressed relative to the standard\nthermal history depending on the equation of state of the epoch intervening\nreheating and the terminal phase of radiation domination, imprinting additional\nfeatures from bursts of entropy production, and additional damping at\nintermediate scales via anisotropic stress production. In this paper, we survey\nphenomenologically motivated scenarios of early matter domination, kination,\nand late time decaying particles as representative non-standard thermal\nhistories, elaborate on their late time stochastic background, and discuss\nconstraints on different model scenarios.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"wJrQkJqrdhW3cyQbhm1tuPeW-vU44Ri5OCQcOD5h1jw","pdfSize":"1364573"}