{
  "id": "2412.14189",
  "title": "Toward Ethical Spatial Analysis: Addressing Endogenous Bias Through\n  Visual Analytics",
  "authors": "Chuan Chen, Peng Luo, Bo Zhao, Yu Feng, Liqiu Meng",
  "authorsParsed": [
    [
      "Chen",
      "Chuan",
      ""
    ],
    [
      "Luo",
      "Peng",
      ""
    ],
    [
      "Zhao",
      "Bo",
      ""
    ],
    [
      "Feng",
      "Yu",
      ""
    ],
    [
      "Meng",
      "Liqiu",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 14:31:51 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1733841111000,
  "abstract": "  Spatial analysis can generate both exogenous and endogenous biases, which\nwill lead to ethics issues. Exogenous biases arise from external factors or\nenvironments and are unrelated to internal operating mechanisms, while\nendogenous biases stem from internal processes or technologies. Although much\nattention has been given to exogenous biases, endogenous biases in spatial\nanalysis have been largely overlooked, and a comprehensive methodology for\naddressing them is yet to be developed. To tackle this challenge, we propose\nthat visual analytics can play a key role in understanding geographic data and\nimproving the interpretation of analytical results. In this study, we conducted\na preliminary investigation using various visualization techniques to explore\nendogenous biases. Our findings demonstrate the potentials of visual analytics\nto uncover hidden biases and identify associated issues. Additionally, we\nsynthesized these visualization strategies into a framework that approximates a\nmethod for detecting endogenous biases. Through this work, we advocate for the\nintegration of visualization at three critical stages of spatial analysis in\norder to minimize errors, address ethical concerns, and reduce\nmisinterpretations associated with endogenous biases.\n",
  "subjects": [
    "Computer Science/Human-Computer Interaction",
    "Physics/Data Analysis, Statistics and Probability"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Jb-7nsfMcbkAqPxZLHcQYCsy5F8Zh5_wZxehGV9hwaw",
  "pdfSize": "5759113"
}