{
  "id": "2412.13718",
  "title": "Ultrafast Coulomb blockade in an atomic-scale quantum dot",
  "authors": "Jonas Allerbeck, Laric Bobzien, Nils Krane, S. Eve Ammerman, Daniel E.\n  Cintron Figueroa, Chengye Dong, Joshua A. Robinson, Bruno Schuler",
  "authorsParsed": [
    [
      "Allerbeck",
      "Jonas",
      ""
    ],
    [
      "Bobzien",
      "Laric",
      ""
    ],
    [
      "Krane",
      "Nils",
      ""
    ],
    [
      "Ammerman",
      "S. Eve",
      ""
    ],
    [
      "Figueroa",
      "Daniel E. Cintron",
      ""
    ],
    [
      "Dong",
      "Chengye",
      ""
    ],
    [
      "Robinson",
      "Joshua A.",
      ""
    ],
    [
      "Schuler",
      "Bruno",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 10:58:43 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734519523000,
  "abstract": "  Controlling electron dynamics at optical clock rates is a fundamental\nchallenge in lightwave-driven nanoelectronics. Here, we demonstrate ultrafast\ncharge-state manipulation of individual selenium vacancies in monolayer and\nbilayer tungsten diselenide (WSe$_2$) using picosecond terahertz (THz) source\npulses, focused onto the picocavity of a scanning tunneling microscope (STM).\nUsing THz pump--THz probe time-domain sampling of the defect charge population,\nwe capture atomic-scale snapshots of the transient Coulomb blockade, a\nsignature of charge transport via quantized defect states. We identify back\ntunneling of localized charges to the tip electrode as a key challenge for\nlightwave-driven STM when probing electronic states with charge-state lifetimes\nexceeding the pulse duration. However, we show that back tunneling can be\nmitigated by the Franck-Condon blockade, which limits accessible vibronic\ntransitions and promotes unidirectional charge transport. Our rate equation\nmodel accurately reproduces the time-dependent tunneling process across the\ndifferent coupling regimes. This work builds on recent progress in imaging\ncoherent lattice and quasiparticle dynamics with lightwave-driven STM and opens\nnew avenues for exploring ultrafast charge dynamics in low-dimensional\nmaterials, advancing the development of lightwave-driven nanoscale electronics.\n",
  "subjects": [
    "Condensed Matter/Mesoscale and Nanoscale Physics",
    "Physics/Optics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "2wsaBTlvMieTfsBkbJTBoFJH9-bsPZePU7cZ6fliwdI",
  "pdfSize": "19725039"
}