{"id":"2412.03690","title":"Constraining the link between the 2175{\\AA} dust absorption feature and\n  PAHs in Nearby Star-Forming Galaxies using Swift/UVOT and JWST/MIRI","authors":"A. J. Battisti, I. Shivaei, H.-J. Park, M. Decleir, D. Calzetti, J.\n  Mathew, E. Wisnioski, Elisabete da Cunha","authorsParsed":[["Battisti","A. J.",""],["Shivaei","I.",""],["Park","H. -J.",""],["Decleir","M.",""],["Calzetti","D.",""],["Mathew","J.",""],["Wisnioski","E.",""],["da Cunha","Elisabete",""]],"versions":[{"version":"v1","created":"Wed, 4 Dec 2024 20:02:57 GMT"}],"updateDate":"2024-12-06","timestamp":1733342577000,"abstract":"  The 2175{\\AA} bump is a prominent absorption feature at ultraviolet (UV)\nwavelengths in dust extinction and attenuation curves. Understanding the\nrelative strength of this feature is important for accurate dust corrections at\nboth low- and high-redshift. This feature is postulated to arise from\npolycyclic aromatic hydrocarbon (PAH) dust grains; however, the carrier has not\nbeen definitively established. We present results on the correlation between\nthe 2175{\\AA} feature and PAH abundances in a spatially-resolved manner for 15\nlocal galaxies in the PHANGS-JWST survey that have NUV and mid-IR imaging data\nfrom Swift/UVOT and JWST/MIRI, respectively. We find a moderate positive\ncorrelation between the 2175{\\AA} feature strength and PAH abundance, albeit\nwith large intrinsic scatter. However, most of this trend can be attributed to\na stronger negative correlation of both quantities with SFR surface density and\nspecific-SFR (proxies of ionising radiation). The latter trends are consistent\nwith previous findings that both the 2175{\\AA} carrier and PAHs are small\ngrains that are easily destroyed by UV photons, although the proxy for PAH\nabundance could also be influenced by dust heating. When controlling for SFR\nsurface density, we find weaker correlations between the 2175{\\AA} feature and\nPAH abundances, disfavouring a direct link. However, analyses based on\nspectroscopic measurements of the 2175{\\AA} feature and PAH features are\nrequired to verify our findings. No significant trends with gas-phase\nmetallicity are found for the 2175{\\AA} feature and PAHs, however the\nmetallicity range of our sample is limited. We provide prescriptions for the\nstrength of the 2175{\\AA} feature and PAHs in local massive (metal-rich)\ngalaxies with SFR surface density and specific-SFR, however the former should\nbe used with caution since bump strengths measured from Swift/UVOT are expected\nto be underestimated.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"LyPctd77NfDg5NzKsF_4aC0NoaWQq53OI5vM9D2K9T8","pdfSize":"8279085"}