{
  "id": "2412.20293",
  "title": "Consistent deformations in the presymplectic BV-AKSZ approach",
  "authors": "Jordi Frias and Maxim Grigoriev",
  "authorsParsed": [
    [
      "Frias",
      "Jordi",
      ""
    ],
    [
      "Grigoriev",
      "Maxim",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 28 Dec 2024 22:36:42 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735425402000,
  "abstract": "  We develop a framework for studying consistent interactions of local gauge\ntheories, which is based on the presymplectic BV-AKSZ formulation. The\nadvantage of the proposed approach is that it operates in terms of\nfinite-dimensional spaces and avoids working with quotient spaces such as local\nfunctionals or functionals modulo on-shell trivial ones. The structure that is\nbeing deformed is that of a presymplectic gauge PDE, which consists of a graded\npresymplectic structure and a compatible odd vector field. These are known to\nencode the Batalin-Vilkovisky (BV) formulation of a local gauge theory in terms\nof the finite dimensional supergeometrical object. Although in its present\nversion the method is limited to interactions that do not deform the\npre-symplectic structure and relies on some natural assumptions, it gives a\nremarkably simple way to analyse consistent interactions. The approach can be\nconsidered as the BV-AKSZ extension of the frame-like approach to consistent\ninteractions. We also describe the underlying homological deformation theory,\nwhich turns out to be slightly unusual compared to the standard deformations of\ndifferential graded Lie algebras. As an illustration, the Chern-Simons and YM\ntheories are rederived starting from their linearized versions.\n",
  "subjects": [
    "Physics/High Energy Physics - Theory",
    "Physics/Mathematical Physics",
    "Mathematics/Mathematical Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "B8nc-DRxPVNROKrjlsjD4gxf08y_MqQ7fWY6zzQ8vyc",
  "pdfSize": "267606"
}