{"id":"2412.09042","title":"Preclinical Water-Mediated Ultrasound Platform using Clinical FOV for\n  Molecular Targeted Contrast-Enhanced Ultrasound","authors":"Stavros Melemenidis (1), Anna Stephanie Kim (2), Jenny Vo-Phamhi (1),\n  Edward Graves (1), Ahmed Nagy El Kaffas (3), Dimitre Hristov (1) ((1)\n  Department of Radiation Oncology, Stanford University School of Medicine,\n  Stanford, CA 94305, USA., (2) Tuft University School of Dental Medicine, 1\n  Kneeland St, Boston, MA, 02111, USA., (3) Department of Radiology, University\n  of California, San Diego, La Jolla, CA 92037, USA.)","authorsParsed":[["Melemenidis","Stavros",""],["Kim","Anna Stephanie",""],["Vo-Phamhi","Jenny",""],["Graves","Edward",""],["Kaffas","Ahmed Nagy El",""],["Hristov","Dimitre",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 08:09:07 GMT"}],"updateDate":"2024-12-13","timestamp":1733990947000,"abstract":"  Background: This protocol introduces an ultrasound (US) configuration for\nwhole-body 3D dynamic contrast-enhanced ultrasound (DCE-US) imaging in\npreclinical applications. The set-up relies on a clinical abdominal matrix US\nprobe to enable mice imaging beyond current preclinical systems that are\ngenerally unable to capture whole-body volumetric and dynamic imaging. We\ndemonstrate via this protocol the feasibility of volumetric contrast-enhanced\nand molecular 3D imaging in the entire lower body of mouse, as well as the\ncapability of imaging multiple lesions in the same animal simultaneously with a\nsingle contrast bolus injection.\n  Methods: We modified a silicone cup with a 101.6 mm inner diameter and 6.4 mm\nwall thickness, to a height of 76.2 mm and cut out a rectangular side window\n(12.7 mm x 15.9 mm) at the lower part of the cup. Mice were positioned with\ntheir head and the two front legs outside of the cup while the rest of the body\nremained inside the cup and submerged under water; the edges around the mouse's\nbody in contact with the cup's wall were sealed with Vaseline to prevent water\nleakage, and the cup was filled with warm water to maintain the mouse's body\nheat. Imaging was conducted using a portable clinical ultrasound system (EPIQ 7\nPhilips) with an abdominal matrix-array transducer (PM mode, X6-1) inserted\ninto the top of the cup, and positioned to visualize the entire of the mouse's\nabdomen. The mice were imaged before and after the injection of\nP-selectin-targeted microbubbles.\n  Results: Here, in nude mice with two adjacent tumors, we demonstrate that a\ncommercially available clinical matrix transducer can be utilized to achieve\nwhole-body 3D DCE-US and molecular US imaging, as well as capture independent\nqualitative and quantitative information from several lesions or organs at\ndifferent locations in the animal, through a single bolus injection.\n","subjects":["Physics/Medical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"rTXxiz0yKUoTHVrDgg8lTMmRP4r5pT2hefyRVuqCP2I","pdfSize":"389059"}