{
  "id": "2412.00599",
  "title": "Self-regulated growth of galaxy sizes along the star-forming main\n  sequence",
  "authors": "Shweta Jain, Sandro Tacchella, Moein Mosleh",
  "authorsParsed": [
    [
      "Jain",
      "Shweta",
      ""
    ],
    [
      "Tacchella",
      "Sandro",
      ""
    ],
    [
      "Mosleh",
      "Moein",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 30 Nov 2024 22:13:54 GMT"
    }
  ],
  "updateDate": "2024-12-04",
  "timestamp": 1733004834000,
  "abstract": "  We present a systematic analysis of the spatially resolved star formation\nhistories (SFHs) using Hubble Space Telescope imaging data of $\\sim 997$,\nintermediate redshifts $0.5 \\leq z \\leq 2.0$ galaxies from the GOODS-S field,\nwith stellar mass range $9.8 \\leq \\log \\mathrm{M}_{\\star}/\\mathrm{M}_{\\odot}\n\\leq 11.5$. We estimate the SFHs in three spatial regions (central region\nwithin the half-mass radii $\\mathrm{R}_{50s}$, outskirts between\n$1-3~\\mathrm{R}_{50s}$, and the whole galaxy) using pixel-by-pixel\nspectral-energy distribution (SED) fitting, assuming exponentially declining\ntau model in individual pixels. The reconstructed SFHs are then used to derive\nand compare the physical properties such as specific star-formation rates\n(sSFRs), mass-weighted ages (t$_{\\mathrm{50}}$), and the half-mass radii to get\ninsights on the interplay between the structure and star-formation in galaxies.\nThe correlation of sSFR ratio of the center and outskirts with the distance\nfrom the main sequence (MS) indicates that galaxies on the upper envelope of\nthe MS tend to grow outside-in, building up their central regions, while those\nbelow the MS grow inside-out, with more active star formation in the outskirts.\nThe findings suggest a self-regulating process in galaxy size growth when they\nevolve along the MS. Our observations are consistent with galaxies growing\ntheir inner bulge and outer disc regions, where they appear to oscillate about\nthe average MS in cycles of central gas compaction, which leads to bulge\ngrowth, and subsequent central depletion possibly due to feedback from the\nstarburst, resulting in more star formation towards the outskirts from newly\naccreted gas.\n",
  "subjects": [
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "1CqHuDi4bDffK6WTjd44RrQACsWjCZF4sXzdMXClWvI",
  "pdfSize": "1845708"
}