{
  "id": "2412.06485",
  "title": "Fourier-enhanced reduced-order surrogate modeling for uncertainty\n  quantification in electric machine design",
  "authors": "Aylar Partovizadeh, Sebastian Sch\\\"ops, Dimitrios Loukrezis",
  "authorsParsed": [
    [
      "Partovizadeh",
      "Aylar",
      ""
    ],
    [
      "Schöps",
      "Sebastian",
      ""
    ],
    [
      "Loukrezis",
      "Dimitrios",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 13:35:28 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733751328000,
  "abstract": "  This work proposes a data-driven surrogate modeling framework for\ncost-effectively inferring the torque of a permanent magnet synchronous machine\nunder geometric design variations. The framework is separated into a\nreduced-order modeling and an inference part. Given a dataset of torque\nsignals, each corresponding to a different set of design parameters, torque\ndimension is first reduced by post-processing a discrete Fourier transform and\nkeeping a reduced number of frequency components. This allows to take advantage\nof torque periodicity and preserve physical information contained in the\nfrequency components. Next, a response surface model is computed by means of\nmachine learning regression, which maps the design parameters to the reduced\nfrequency components. The response surface models of choice are polynomial\nchaos expansions, feedforward neural networks, and Gaussian processes. Torque\ninference is performed by evaluating the response surface model for new design\nparameters and then inverting the dimension reduction. Numerical results show\nthat the resulting surrogate models lead to sufficiently accurate torque\npredictions for previously unseen design configurations. The framework is found\nto be significantly advantageous compared to approximating the original (not\nreduced) torque signal directly, as well as slightly advantageous compared to\nusing principal component analysis for dimension reduction. The combination of\ndiscrete Fourier transform-based dimension reduction with Gaussian\nprocess-based response surfaces yields the best-in-class surrogate model for\nthis use case. The surrogate models replace the original, high-fidelity model\nin Monte Carlo-based uncertainty quantification studies, where they provide\naccurate torque statistics estimates at significantly reduced computational\ncost.\n",
  "subjects": [
    "Computer Science/Computational Engineering, Finance, and Science"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "psxwcCsAtn5pkt4rPZc4mRF-_Za49dosT2sXIz5xw1A",
  "pdfSize": "2342021"
}