{
  "id": "2412.20139",
  "title": "Magnetic Phase Diagram of Mn3+xSn1-x Epitaxial Thin Films: Extending the\n  Anomalous Hall Effect to Low Temperatures via Intrinsic Alloying",
  "authors": "K. Gas, J.-Y. Yoon, Y. Sato, H. Kubota, P. Dluzewski, S. Kret, J. Z.\n  Domagala, Y. K. Edathumkandy, Y. Takeuchi, S. Kanai, H. Ohno, M. Sawicki, and\n  S. Fukami",
  "authorsParsed": [
    [
      "Gas",
      "K.",
      ""
    ],
    [
      "Yoon",
      "J. -Y.",
      ""
    ],
    [
      "Sato",
      "Y.",
      ""
    ],
    [
      "Kubota",
      "H.",
      ""
    ],
    [
      "Dluzewski",
      "P.",
      ""
    ],
    [
      "Kret",
      "S.",
      ""
    ],
    [
      "Domagala",
      "J. Z.",
      ""
    ],
    [
      "Edathumkandy",
      "Y. K.",
      ""
    ],
    [
      "Takeuchi",
      "Y.",
      ""
    ],
    [
      "Kanai",
      "S.",
      ""
    ],
    [
      "Ohno",
      "H.",
      ""
    ],
    [
      "Sawicki",
      "M.",
      ""
    ],
    [
      "Fukami",
      "S.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 28 Dec 2024 13:04:46 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735391086000,
  "abstract": "  Antiferromagnets with broken time-reversal symmetry, such as Mn3Sn, have\nemerged as promising platforms for exploring topological and correlated\nelectron physics. Mn3Sn is known to show two magnetic phase transitions: a\nnon-collinear inverse triangular antiferromagnetic (IT-AFM) spin configuration\nis formed below its Neel temperature, whereas at T1 that usually locates below\nroom temperature, it transits to an incommensurate spin state. Accordingly,\nintriguing properties such as a strong anomalous Hall effect, observed from TN\nto T1, disappear below T1, limiting its utility at low temperatures. While bulk\nMn3Sn has been extensively studied, the magnetic phase transitions and their\ntunability in thin films remain largely unexplored. Here, we investigate the\nmagnetic and magneto-transport properties of Mn3+xSn1-x epitaxial thin films\nprepared by magnetron sputtering, systematically varying the Mn-Sn composition.\nOur results reveal that intrinsic alloying with Mn provides us with a handle to\ntune T1, with the IT-AFM phase stabilized down to liquid helium temperatures\nfor x > 0.15. From a magnetic phase diagram for epitaxial thin films, we also\nfind a consistent magnetic anomaly ~55 K below TN, accompanied by thermal\nhysteresis. Furthermore, the reduction of TN in thin films relative to bulk\nvalues is shown to correlate with lattice parameter changes. These findings\nextend the accessible temperature range for Mn3Sn's topological properties,\npaving the way for novel applications and further investigations into the\ninterplay of spin, lattice, and electronic degrees of freedom in thin-film\ngeometries.\n",
  "subjects": [
    "Condensed Matter/Materials Science"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "YCdCGqRwrshKxayQqFeBCAw15AIkiznucWQVSRf9qOw",
  "pdfSize": "1683026"
}