{
  "id": "2412.01790",
  "title": "UNIONS: a direct measurement of intrinsic alignment with BOSS/eBOSS\n  spectroscopy",
  "authors": "Fabian Hervas Peters, Martin Kilbinger, Romain Paviot, Lucie Baumont,\n  Elisa Russier, Ziwen Zhang, Calum Murray, Valeria Pettorino, Thomas de Boer,\n  S\\'ebastien Fabbro, Sacha Guerrini, Hendrik Hildebrandt, Mike Hudson, Ludovic\n  Van Waerbeke, Anna Wittje",
  "authorsParsed": [
    [
      "Peters",
      "Fabian Hervas",
      ""
    ],
    [
      "Kilbinger",
      "Martin",
      ""
    ],
    [
      "Paviot",
      "Romain",
      ""
    ],
    [
      "Baumont",
      "Lucie",
      ""
    ],
    [
      "Russier",
      "Elisa",
      ""
    ],
    [
      "Zhang",
      "Ziwen",
      ""
    ],
    [
      "Murray",
      "Calum",
      ""
    ],
    [
      "Pettorino",
      "Valeria",
      ""
    ],
    [
      "de Boer",
      "Thomas",
      ""
    ],
    [
      "Fabbro",
      "Sébastien",
      ""
    ],
    [
      "Guerrini",
      "Sacha",
      ""
    ],
    [
      "Hildebrandt",
      "Hendrik",
      ""
    ],
    [
      "Hudson",
      "Mike",
      ""
    ],
    [
      "Van Waerbeke",
      "Ludovic",
      ""
    ],
    [
      "Wittje",
      "Anna",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 18:38:23 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733164703000,
  "abstract": "  During their formation, galaxies are subject to tidal forces, which create\ncorrelations between their shapes and the large-scale structure of the\nUniverse, known as intrinsic alignment. This alignment is a contamination for\ncosmic-shear measurements as one needs to disentangle correlations induced by\nexternal lensing effects from those intrinsically present in galaxies. We\nconstrain the amplitude of intrinsic alignment and test models by making use of\nthe overlap between the Ultraviolet Near-Infrared Optical Northern Survey\n(UNIONS) covering $3500 \\, \\mathrm{deg}^2$, and spectroscopic data from the\nBaryon Oscillation Spectroscopic Survey (BOSS/eBOSS). By comparing our results\nto measurements from other lensing surveys on the same spectroscopic tracers,\nwe can test the reliability of these estimates and verify they are not survey\ndependent. We measure projected correlation functions between positions and\nellipticities, which we model with perturbation theory to constrain the\ncommonly used non-linear alignment model and its higher-order expansion. Using\nthe non-linear alignment model, we obtain a $13\\sigma$ detection with CMASS\ngalaxies, a $3\\sigma$ detection with LRGs, and a detection compatible with the\nnull hypothesis for ELGs. We test the tidal alignment and tidal torque model, a\nhigher-order alignment model, which we find to be in good agreement with the\nnon-linear alignment prediction and for which we can constrain the second-order\nparameters. We show a strong scaling of our intrinsic alignment amplitude with\nluminosity. We demonstrate that the UNIONS sample is robust against systematic\ncontributions, particularly concerning PSF biases. We reached a reasonable\nagreement when comparing our measurements to other lensing samples for the same\nspectroscopic samples. We take this agreement as an indication that direct\nmeasurements of intrinsic alignment are mature for stage IV priors.\n",
  "subjects": [
    "Astrophysics/Cosmology and Nongalactic Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "iWC_4us-jhypU_KpkiHMu5PK3s_DlCnO3JeteoD0dzo",
  "pdfSize": "4711931"
}