{
  "id": "2412.09816",
  "title": "Distributed Inverse Dynamics Control for Quadruped Robots using\n  Geometric Optimization",
  "authors": "Nimesh Khandelwal (1 and 2), Amritanshu Manu (1), Shakti S. Gupta (1),\n  Mangal Kothari (1), Prashanth Krishnamurthy (2), Farshad Khorrami (2) ((1)\n  Indian Institute of Technology Kanpur, (2) New York University)",
  "authorsParsed": [
    [
      "Khandelwal",
      "Nimesh",
      "",
      "1 and 2"
    ],
    [
      "Manu",
      "Amritanshu",
      ""
    ],
    [
      "Gupta",
      "Shakti S.",
      ""
    ],
    [
      "Kothari",
      "Mangal",
      ""
    ],
    [
      "Krishnamurthy",
      "Prashanth",
      ""
    ],
    [
      "Khorrami",
      "Farshad",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 03:13:04 GMT"
    }
  ],
  "updateDate": "2024-12-16",
  "timestamp": 1734059584000,
  "abstract": "  This paper presents a distributed inverse dynamics controller (DIDC) for\nquadruped robots that addresses the limitations of existing reactive\ncontrollers: simplified dynamical models, the inability to handle exact\nfriction cone constraints, and the high computational requirements of\nwhole-body controllers. Current methods either ignore friction constraints\nentirely or use linear approximations, leading to potential slip and\ninstability, while comprehensive whole-body controllers demand significant\ncomputational resources. Our approach uses full rigid-body dynamics and\nenforces exact friction cone constraints through a novel geometric\noptimization-based solver. DIDC combines the required generalized forces\ncorresponding to the actuated and unactuated spaces by projecting them onto the\nactuated space while satisfying the physical constraints and maintaining\northogonality between the base and joint tracking objectives. Experimental\nvalidation shows that our approach reduces foot slippage, improves orientation\ntracking, and converges at least two times faster than existing reactive\ncontrollers with generic QP-based implementations. The controller enables\nstable omnidirectional trotting at various speeds and consumes less power than\ncomparable methods while running efficiently on embedded processors.\n",
  "subjects": [
    "Computer Science/Robotics"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "mqGuwUZJhkK2z4q5jlf4GVvvrsGKYkZ4pU1kSi_SynI",
  "pdfSize": "3421716"
}