{
  "id": "2412.03830",
  "title": "Confined Magnetization at the Sublattice-Matched Ruthenium Oxide\n  Heterointerface",
  "authors": "Yiyan Fan, Qinghua Zhang, Ting Lin, He Bai, Chuanrui Huo, Qiao Jin,\n  Tielong Deng, Songhee Choi, Shengru Chen, Haitao Hong, Ting Cui, Qianying\n  Wang, Dongke Rong, Chen Liu, Chen Ge, Tao Zhu, Lin Gu, Kuijuan Jin, Jun Chen,\n  and Er-Jia Guo",
  "authorsParsed": [
    [
      "Fan",
      "Yiyan",
      ""
    ],
    [
      "Zhang",
      "Qinghua",
      ""
    ],
    [
      "Lin",
      "Ting",
      ""
    ],
    [
      "Bai",
      "He",
      ""
    ],
    [
      "Huo",
      "Chuanrui",
      ""
    ],
    [
      "Jin",
      "Qiao",
      ""
    ],
    [
      "Deng",
      "Tielong",
      ""
    ],
    [
      "Choi",
      "Songhee",
      ""
    ],
    [
      "Chen",
      "Shengru",
      ""
    ],
    [
      "Hong",
      "Haitao",
      ""
    ],
    [
      "Cui",
      "Ting",
      ""
    ],
    [
      "Wang",
      "Qianying",
      ""
    ],
    [
      "Rong",
      "Dongke",
      ""
    ],
    [
      "Liu",
      "Chen",
      ""
    ],
    [
      "Ge",
      "Chen",
      ""
    ],
    [
      "Zhu",
      "Tao",
      ""
    ],
    [
      "Gu",
      "Lin",
      ""
    ],
    [
      "Jin",
      "Kuijuan",
      ""
    ],
    [
      "Chen",
      "Jun",
      ""
    ],
    [
      "Guo",
      "Er-Jia",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 02:45:30 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733366730000,
  "abstract": "  Creating a heterostructure by combining two magnetically and structurally\ndistinct ruthenium oxides is a crucial approach for investigating their\nemergent magnetic states and interactions. Previously, research has\npredominantly concentrated on the intrinsic properties of the ferromagnet\nSrRuO3 and recently discovered altermagnet RuO2 solely. Here, we engineered an\nultrasharp sublattice-matched heterointerface using pseudo-cubic SrRuO3 and\nrutile RuO2, conducting an in-depth analysis of their spin interactions.\nStructurally, to accommodate the lattice symmetry mismatch, the inverted RuO2\nlayer undergoes an in-plane rotation of 18 degrees during epitaxial growth on\nSrRuO3 layer, resulting in an interesting and rotational interface with perfect\ncrystallinity and negligible chemical intermixing. Performance-wise, the\ninterfacial layer of 6 nm in RuO2 adjacent to SrRuO3 exhibits a nonzero\nmagnetic moment, contributing to an enhanced anomalous Hall effect (AHE) at low\ntemperatures. Furthermore, our observations indicate that, in contrast to\nSrRuO3 single layers, the AHE of [(RuO2)15/(SrRuO3)n] heterostructures shows\nnonlinear behavior and reaches its maximum when the SrRuO3 thickness reaches\ntens of nm. These results suggest that the interfacial magnetic interaction\nsurpasses that of all-perovskite oxides (~5-unit cells). This study underscores\nthe significance and potential applications of magnetic interactions based on\nthe crystallographic asymmetric interfaces in the design of spintronic devices.\n",
  "subjects": [
    "Condensed Matter/Materials Science",
    "Condensed Matter/Strongly Correlated Electrons"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "xdPv17ecC9jZm5AgkBf4bWzS4t7ZDQuOa-L4EpUT55o",
  "pdfSize": "1793706"
}