{"id":"2412.02601","title":"MERGE: Multi-faceted Hierarchical Graph-based GNN for Gene Expression\n  Prediction from Whole Slide Histopathology Images","authors":"Aniruddha Ganguly, Debolina Chatterjee, Wentao Huang, Jie Zhang, Alisa\n  Yurovsky, Travis Steele Johnson, Chao Chen","authorsParsed":[["Ganguly","Aniruddha",""],["Chatterjee","Debolina",""],["Huang","Wentao",""],["Zhang","Jie",""],["Yurovsky","Alisa",""],["Johnson","Travis Steele",""],["Chen","Chao",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 17:32:05 GMT"}],"updateDate":"2024-12-04","timestamp":1733247125000,"abstract":"  Recent advances in Spatial Transcriptomics (ST) pair histology images with\nspatially resolved gene expression profiles, enabling predictions of gene\nexpression across different tissue locations based on image patches. This opens\nup new possibilities for enhancing whole slide image (WSI) prediction tasks\nwith localized gene expression. However, existing methods fail to fully\nleverage the interactions between different tissue locations, which are crucial\nfor accurate joint prediction. To address this, we introduce MERGE\n(Multi-faceted hiErarchical gRaph for Gene Expressions), which combines a\nmulti-faceted hierarchical graph construction strategy with graph neural\nnetworks (GNN) to improve gene expression predictions from WSIs. By clustering\ntissue image patches based on both spatial and morphological features, and\nincorporating intra- and inter-cluster edges, our approach fosters interactions\nbetween distant tissue locations during GNN learning. As an additional\ncontribution, we evaluate different data smoothing techniques that are\nnecessary to mitigate artifacts in ST data, often caused by technical\nimperfections. We advocate for adopting gene-aware smoothing methods that are\nmore biologically justified. Experimental results on gene expression prediction\nshow that our GNN method outperforms state-of-the-art techniques across\nmultiple metrics.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"b4X8kAnX88QSVuhjpdjdTdB2XByVQKFvA-s8EEVGulY","pdfSize":"47708349"}