{"id":"2412.02856","title":"Is Large-Scale Pretraining the Secret to Good Domain Generalization?","authors":"Piotr Teterwak, Kuniaki Saito, Theodoros Tsiligkaridis, Bryan A.\n  Plummer, Kate Saenko","authorsParsed":[["Teterwak","Piotr",""],["Saito","Kuniaki",""],["Tsiligkaridis","Theodoros",""],["Plummer","Bryan A.",""],["Saenko","Kate",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 21:43:11 GMT"},{"version":"v2","created":"Thu, 23 Jan 2025 15:09:35 GMT"}],"updateDate":"2025-01-24","timestamp":1733262191000,"abstract":"  Multi-Source Domain Generalization (DG) is the task of training on multiple\nsource domains and achieving high classification performance on unseen target\ndomains. Recent methods combine robust features from web-scale pretrained\nbackbones with new features learned from source data, and this has dramatically\nimproved benchmark results. However, it remains unclear if DG finetuning\nmethods are becoming better over time, or if improved benchmark performance is\nsimply an artifact of stronger pre-training. Prior studies have shown that\nperceptual similarity to pre-training data correlates with zero-shot\nperformance, but we find the effect limited in the DG setting. Instead, we\nposit that having perceptually similar data in pretraining is not enough; and\nthat it is how well these data were learned that determines performance. This\nleads us to introduce the Alignment Hypothesis, which states that the final DG\nperformance will be high if and only if alignment of image and class label text\nembeddings is high. Our experiments confirm the Alignment Hypothesis is true,\nand we use it as an analysis tool of existing DG methods evaluated on DomainBed\ndatasets by splitting evaluation data into In-pretraining (IP) and\nOut-of-pretraining (OOP). We show that all evaluated DG methods struggle on\nDomainBed-OOP, while recent methods excel on DomainBed-IP. Put together, our\nfindings highlight the need for DG methods which can generalize beyond\npretraining alignment.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"wNtjkKGlhG4ZzlfNalpKnkoMfkqhDfXpkoIUtCVkhXE","pdfSize":"3338822"}