{
  "id": "2412.05015",
  "title": "Perceptually Transparent Binaural Auralization of Simulated Sound Fields",
  "authors": "Jens Ahrens",
  "authorsParsed": [
    [
      "Ahrens",
      "Jens",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 13:07:35 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733490455000,
  "abstract": "  Contrary to geometric acoustics-based simulations where the spatial\ninformation is available in a tangible form, it is not straightforward to\nauralize wave-based simulations. A variety of methods have been proposed that\ncompute the ear signals of a virtual listener with known head-related transfer\nfunctions from sampling either the sound pressure or the particle velocity (or\nboth) of the simulated sound field. The available perceptual evaluation results\nof such methods are not comprehensive so that it is unclear what number and\narrangement of sampling points is required for achieving perceptually\ntransparent auralization, i.e.~for achieving an auralization that is\nperceptually indistinguishable from the ground truth. This article presents a\nperceptual evaluation of the most common binaural auralization methods with and\nwithout intermediate ambisonic representation of volumetrically sampled sound\npressure or sound pressure and particle velocity sampled on spherical or\ncubical surfaces. Our results confirm that perceptually transparent\nauralization is possible if sound pressure and particle velocity are available\nat 289 sampling points on a spherical surface grid. Other grid geometries\nrequire considerably more points. All tested methods are available open source\nin the Chalmers Auralization Toolbox that accompanies this article.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Audio and Speech Processing",
    "Computer Science/Sound"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "CGkjBWeBU6jY_BlVwuRAPvpC1zBFi77FqHBm9eOU3bg",
  "pdfSize": "1852673"
}