{
  "id": "2412.05938",
  "title": "Accurate Multi-Category Student Performance Forecasting at Early Stages\n  of Online Education Using Neural Networks",
  "authors": "Naveed Ur Rehman Junejo, Muhammad Wasim Nawaz, Qingsheng Huang,\n  Xiaoqing Dong, Chang Wang, Gengzhong Zheng",
  "authorsParsed": [
    [
      "Junejo",
      "Naveed Ur Rehman",
      ""
    ],
    [
      "Nawaz",
      "Muhammad Wasim",
      ""
    ],
    [
      "Huang",
      "Qingsheng",
      ""
    ],
    [
      "Dong",
      "Xiaoqing",
      ""
    ],
    [
      "Wang",
      "Chang",
      ""
    ],
    [
      "Zheng",
      "Gengzhong",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 8 Dec 2024 13:37:30 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733665050000,
  "abstract": "  The ability to accurately predict and analyze student performance in online\neducation, both at the outset and throughout the semester, is vital. Most of\nthe published studies focus on binary classification (Fail or Pass) but there\nis still a significant research gap in predicting students' performance across\nmultiple categories. This study introduces a novel neural network-based\napproach capable of accurately predicting student performance and identifying\nvulnerable students at early stages of the online courses. The Open University\nLearning Analytics (OULA) dataset is employed to develop and test the proposed\nmodel, which predicts outcomes in Distinction, Fail, Pass, and Withdrawn\ncategories. The OULA dataset is preprocessed to extract features from\ndemographic data, assessment data, and clickstream interactions within a\nVirtual Learning Environment (VLE). Comparative simulations indicate that the\nproposed model significantly outperforms existing baseline models including\nArtificial Neural Network Long Short Term Memory (ANN-LSTM), Random Forest (RF)\n'gini', RF 'entropy' and Deep Feed Forward Neural Network (DFFNN) in terms of\naccuracy, precision, recall, and F1-score. The results indicate that the\nprediction accuracy of the proposed method is about 25% more than the existing\nstate-of-the-art. Furthermore, compared to existing methodologies, the model\ndemonstrates superior predictive capability across temporal course progression,\nachieving superior accuracy even at the initial 20% phase of course completion.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Computers and Society"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "TWk23nXG1n_TEnREfBMu9GK7jrLLxu-JyhZSmUMkjPU",
  "pdfSize": "3598610"
}