{"id":"2412.15421","title":"Coherent Superconductor-Semiconductor Epitaxy for Integrated Quantum\n  Electronics","authors":"Julian A. Steele, Patrick J. Strohbeen, Carla Verdi, Ardeshir Baktash,\n  Alisa Danilenko, Yi-Hsun Chen, Jechiel van Dijk, Lianzhou Wang, Eugene\n  Demler, Salva Salmani-Rezaie, Peter Jacobson and Javad Shabani","authorsParsed":[["Steele","Julian A.",""],["Strohbeen","Patrick J.",""],["Verdi","Carla",""],["Baktash","Ardeshir",""],["Danilenko","Alisa",""],["Chen","Yi-Hsun",""],["van Dijk","Jechiel",""],["Wang","Lianzhou",""],["Demler","Eugene",""],["Salmani-Rezaie","Salva",""],["Jacobson","Peter",""],["Shabani","Javad",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 22:12:02 GMT"},{"version":"v2","created":"Tue, 18 Feb 2025 00:26:47 GMT"}],"updateDate":"2025-02-19","timestamp":1734646322000,"abstract":"  Introducing superconductivity into group IV elements by doping has long\npromised a pathway to introduce quantum functionalities into well-established\nsemiconductor technologies. The non-equilibrium hyperdoping of group III atoms\ninto Si or Ge has successfully shown superconductivity can be achieved,\nhowever, the origin of superconductivity has been obscured by structural\ndisorder and dopant clustering. Here, we report the epitaxial growth of\nhyperdoped Ga:Ge films by molecular beam epitaxy with extreme hole\nconcentrations ($n_\\textup{h} = 4.15 \\times 10^{21}$~cm$^{-3}$, ~17.9\\% Ga\nsubstitution) that yield superconductivity with a critical temperature of\n$T_{\\textup{c}} = 3.5$~K and an out-of-plane critical field of 1~T at 270~mK.\nSynchrotron-based X-ray absorption and scattering methods reveal that Ga\ndopants are substitutionally incorporated within the Ge lattice, introducing a\ntetragonal distortion to the crystal unit cell. Our findings, corroborated by\nfirst-principles calculations, suggest that the structural order of Ga dopants\ncreates a narrow band for the emergence of superconductivity in Ge,\nestablishing hyperdoped Ga:Ge as a low-disorder, epitaxial\nsuperconductor-semiconductor platform.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"oKPy46_2JFG-L0MctgjUMDw9z6WHs4n7ksMQlIEOR4A","pdfSize":"9256783"}