{"id":"2412.12266","title":"Searching for hadronic scale baryonic and dark forces at $(g-2)_\\mu$'s\n  lattice-vs-dispersion front","authors":"Kaustubh Agashe, Abhishek Banerjee, Minuyan Jiang, Shmuel Nussinov,\n  Kushan Panchal, Srijit Paul, Gilad Perez, and Yotam Soreq","authorsParsed":[["Agashe","Kaustubh",""],["Banerjee","Abhishek",""],["Jiang","Minuyan",""],["Nussinov","Shmuel",""],["Panchal","Kushan",""],["Paul","Srijit",""],["Perez","Gilad",""],["Soreq","Yotam",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 19:00:04 GMT"}],"updateDate":"2024-12-18","timestamp":1734375604000,"abstract":"  The anomalous magnetic moment of the muon ($\\,a_{\\mu}\\,$) provides a\nstringent test of the quantum nature of the Standard Model (SM) and its\nextensions. To probe beyond the SM physics, one needs to be able to subtract\nthe SM contributions, which consists of a non-perturbative part, namely, the\nhadronic vacuum polarization (HVP) of the photon. The state of the art is to\npredominantly use two different methods to extract this HVP: lattice\ncomputation, and dispersion relation-based, data-driven method. Thus one can\nconstruct different forms of the ``$a_{\\mu}$ test\" which compares the precise\nmeasurement of $a_{\\mu}$ to its theory prediction. Additionally, this opens the\npossibility for another subtle test, where these two ``theory\" predictions\nthemselves are compared against each other, which is denoted as the\n``HVP-test\". This test is particularly sensitive to hadronic scale new physics.\nTherefore, in this work, we consider a SM extension consisting of a generic,\nlight $\\sim(100~{\\rm MeV}-1~{\\rm GeV})$ vector boson and study its impact on\nboth tests. We develop a comprehensive formalism for this purpose. We find that\nin the case of data-driven HVP being used in the $a_{\\mu}$ test, the new\nphysics contributions effectively cancels for a flavor-universal vector boson.\nAs an illustration of these general results, we consider two benchmark models:\ni)~the dark photon ($\\,A'\\,$) and ii)~a gauge boson coupled to baryon-number\n($\\,B\\,$). Using a combination of these tests, we are able to constrain the\nparameter space of $B$ and $A'$, complementarily to the existing limits. As a\nspin-off, our preliminary analysis of the spectrum of invariant mass of $3\\pi$\nin events with ISR at the $B-$ factories (BaBar, Belle) manifests the value of\nsuch a study in searching for $B\\to 3\\pi$ decay, thus motivating a dedicated\nsearch by experimental collaborations.\n","subjects":["Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Experiment"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"qFo0_mehArO5EgiIgRKhlZCLXKolBio0wbdWP4yHRxs","pdfSize":"10778558"}