{
  "id": "2412.14214",
  "title": "GraphicsDreamer: Image to 3D Generation with Physical Consistency",
  "authors": "Pei Chen, Fudong Wang, Yixuan Tong, Jingdong Chen, Ming Yang, Minghui\n  Yang",
  "authorsParsed": [
    [
      "Chen",
      "Pei",
      ""
    ],
    [
      "Wang",
      "Fudong",
      ""
    ],
    [
      "Tong",
      "Yixuan",
      ""
    ],
    [
      "Chen",
      "Jingdong",
      ""
    ],
    [
      "Yang",
      "Ming",
      ""
    ],
    [
      "Yang",
      "Minghui",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 10:01:27 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734516087000,
  "abstract": "  Recently, the surge of efficient and automated 3D AI-generated content (AIGC)\nmethods has increasingly illuminated the path of transforming human imagination\ninto complex 3D structures. However, the automated generation of 3D content is\nstill significantly lags in industrial application. This gap exists because 3D\nmodeling demands high-quality assets with sharp geometry, exquisite topology,\nand physically based rendering (PBR), among other criteria. To narrow the\ndisparity between generated results and artists' expectations, we introduce\nGraphicsDreamer, a method for creating highly usable 3D meshes from single\nimages. To better capture the geometry and material details, we integrate the\nPBR lighting equation into our cross-domain diffusion model, concurrently\npredicting multi-view color, normal, depth images, and PBR materials. In the\ngeometry fusion stage, we continue to enforce the PBR constraints, ensuring\nthat the generated 3D objects possess reliable texture details, supporting\nrealistic relighting. Furthermore, our method incorporates topology\noptimization and fast UV unwrapping capabilities, allowing the 3D products to\nbe seamlessly imported into graphics engines. Extensive experiments demonstrate\nthat our model can produce high quality 3D assets in a reasonable time cost\ncompared to previous methods.\n",
  "subjects": [
    "Computer Science/Graphics",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "3UMzgwA6UBEVl09O7MaX_DRIDxKUezA1Ueo8tcQ-Yf8",
  "pdfSize": "25759069"
}