{
  "id": "2412.15980",
  "title": "iRadar: Synthesizing Millimeter-Waves from Wearable Inertial Inputs for\n  Human Gesture Sensing",
  "authors": "Huanqi Yang, Mingda Han, Xinyue Li, Di Duan, Tianxing Li, Weitao Xu",
  "authorsParsed": [
    [
      "Yang",
      "Huanqi",
      ""
    ],
    [
      "Han",
      "Mingda",
      ""
    ],
    [
      "Li",
      "Xinyue",
      ""
    ],
    [
      "Duan",
      "Di",
      ""
    ],
    [
      "Li",
      "Tianxing",
      ""
    ],
    [
      "Xu",
      "Weitao",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 15:23:18 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734708198000,
  "abstract": "  Millimeter-wave (mmWave) radar-based gesture recognition is gaining attention\nas a key technology to enable intuitive human-machine interaction.\nNevertheless, the significant challenge lies in obtaining large-scale,\nhigh-quality mmWave gesture datasets. To tackle this problem, we present\niRadar, a novel cross-modal gesture recognition framework that employs Inertial\nMeasurement Unit (IMU) data to synthesize the radar signals generated by the\ncorresponding gestures. The key idea is to exploit the IMU signals, which are\ncommonly available in contemporary wearable devices, to synthesize the radar\nsignals that would be produced if the same gesture was performed in front of a\nmmWave radar. However, several technical obstacles must be overcome due to the\ndifferences between mmWave and IMU signals, the noisy gesture sensing of mmWave\nradar, and the dynamics of human gestures. Firstly, we develop a method for\nprocessing IMU and mmWave data to extract critical gesture features. Secondly,\nwe propose a diffusion-based IMU-to-radar translation model that accurately\ntransforms IMU data into mmWave data. Lastly, we devise a novel transformer\nmodel to enhance gesture recognition performance. We thoroughly evaluate\niRadar, involving 18 gestures and 30 subjects in three scenarios, using five\nwearable devices. Experimental results demonstrate that iRadar consistently\nachieves 99.82% Top-3 accuracy across diverse scenarios.\n",
  "subjects": [
    "Computer Science/Human-Computer Interaction"
  ],
  "license": "http://creativecommons.org/publicdomain/zero/1.0/",
  "blobId": "K4qIgppjvZFetru_2HiLFgQQ3ZAPqnyWRondu4eOJL4",
  "pdfSize": "5431238"
}