{
  "id": "2412.01836",
  "title": "Eye dominance and testing order effects in the circularly-oriented\n  macular pigment optical density measurements that rely on the perception of\n  structured light-based stimuli",
  "authors": "Mukhit Kulmaganbetov, Taranjit Singh, Dmitry Pushin, Pinki Chahal,\n  David Cory, Davis Garrad, Connor Kapahi, Melanie Mungalsingh, Iman Salehi,\n  Andrew Silva, Ben Thompson, Zhangting Wang, Dusan Sarenac",
  "authorsParsed": [
    [
      "Kulmaganbetov",
      "Mukhit",
      ""
    ],
    [
      "Singh",
      "Taranjit",
      ""
    ],
    [
      "Pushin",
      "Dmitry",
      ""
    ],
    [
      "Chahal",
      "Pinki",
      ""
    ],
    [
      "Cory",
      "David",
      ""
    ],
    [
      "Garrad",
      "Davis",
      ""
    ],
    [
      "Kapahi",
      "Connor",
      ""
    ],
    [
      "Mungalsingh",
      "Melanie",
      ""
    ],
    [
      "Salehi",
      "Iman",
      ""
    ],
    [
      "Silva",
      "Andrew",
      ""
    ],
    [
      "Thompson",
      "Ben",
      ""
    ],
    [
      "Wang",
      "Zhangting",
      ""
    ],
    [
      "Sarenac",
      "Dusan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 17 Nov 2024 04:07:38 GMT"
    }
  ],
  "updateDate": "2024-12-04",
  "timestamp": 1731816458000,
  "abstract": "  Psychophysical discrimination of structured light (SL) stimuli may be useful\nin screening for various macular disorders, including degenerative macular\ndiseases. The circularly-oriented macular pigment optical density (coMPOD),\ncalculated from the discrimination performance of SL-induced entoptic\nphenomena, may reveal a novel functional biomarker of macular health. In this\nstudy, we investigated the potential influence of eye dominance and testing\norder effects on SL-based stimulus perception, factors that potentially\ninfluence the sensitivity of screening tests based on SL technology. A total of\n28 participants (aged 18-38 years) were selected for the study after undergoing\na comprehensive eye examination. A psychophysical task was performed where\nvarious SL-based entoptic images with multiple azimuthal fringes rotating with\na specific temporal frequency were projected onto the participants' retinas. By\noccluding the central areas of entoptic images, we measured the retinal\neccentricity ($R$) of the perceivable area of the stimuli. The slope of the\ncoMPOD profile ($a$-value) was calculated for each participant using a\nspatiotemporal sensitivity model that takes into account the perceptual\nthreshold measurements of structured light stimuli with varying spatial\ndensities and temporal frequencies. The Pearson correlation coefficient between\neye dominance and testing order effects was $r=0.8$ ($p<0.01$). The\nBland-Altman plots for both factors indicated zero bias. The results indicate\nrepeatable measurements for both eyes, implying minimal impact from eye\ndominance and testing order on SL-based stimulus perception. The results\nprovide a foundation for future studies exploring the clinical utility of SL\ntools in eye health.\n",
  "subjects": [
    "Quantitative Biology/Neurons and Cognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "6sXTGridgjkr4yDdNyHHtBsvm8MoxCMcUDZ7VXpHg2U",
  "pdfSize": "668290"
}