{"id":"2412.12990","title":"Future Aspects in Human Action Recognition: Exploring Emerging\n  Techniques and Ethical Influences","authors":"Antonios Gasteratos, Stavros N. Moutsis, Konstantinos A. Tsintotas and\n  Yiannis Aloimonos","authorsParsed":[["Gasteratos","Antonios",""],["Moutsis","Stavros N.",""],["Tsintotas","Konstantinos A.",""],["Aloimonos","Yiannis",""]],"versions":[{"version":"v1","created":"Tue, 17 Dec 2024 15:07:50 GMT"},{"version":"v2","created":"Fri, 20 Dec 2024 08:19:03 GMT"}],"updateDate":"2024-12-23","timestamp":1734448070000,"abstract":"  Visual-based human action recognition can be found in various application\nfields, e.g., surveillance systems, sports analytics, medical assistive\ntechnologies, or human-robot interaction frameworks, and it concerns the\nidentification and classification of individuals' activities within a video.\nSince actions typically occur over a sequence of consecutive images, it is\nparticularly challenging due to the inclusion of temporal analysis, which\nintroduces an extra layer of complexity. However, although multiple approaches\ntry to handle temporal analysis, there are still difficulties because of their\ncomputational cost and lack of adaptability. Therefore, different types of\nvision data, containing transition information between consecutive images,\nprovided by next-generation hardware sensors will guide the robotics community\nin tackling the problem of human action recognition. On the other hand, while\nthere is a plethora of still-image datasets, that researchers can adopt to\ntrain new artificial intelligence models, videos representing human activities\nare of limited capabilities, e.g., small and unbalanced datasets or selected\nwithout control from multiple sources. To this end, generating new and\nrealistic synthetic videos is possible since labeling is performed throughout\nthe data creation process, while reinforcement learning techniques can permit\nthe avoidance of considerable dataset dependence. At the same time, human\nfactors' involvement raises ethical issues for the research community, as\ndoubts and concerns about new technologies already exist.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Emerging Technologies","Computer Science/Robotics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"RwQgpflPiXOawY2Aw9dgJu3FGOMK2H03Ir5R_TVG6iw","pdfSize":"477241"}