{"id":"2412.02361","title":"Chiral Anomalous Magnetohydrodynamics in action: effective field theory\n  and holography","authors":"Matteo Baggioli, Yanyan Bu, Xiyang Sun","authorsParsed":[["Baggioli","Matteo",""],["Bu","Yanyan",""],["Sun","Xiyang",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 10:40:22 GMT"},{"version":"v2","created":"Tue, 10 Dec 2024 02:36:04 GMT"}],"updateDate":"2024-12-11","timestamp":1733222422000,"abstract":"  Chiral Anomalous Magnetohydrodynamics (CAMHD) provides a low-energy effective\nframework for describing chiral fluids in the presence of dynamical\nelectromagnetic fields and axial anomaly. This theory finds applications across\ndiverse physical systems, including heavy-ion collisions, the early universe,\nand Weyl/Dirac semimetals. Along with Schwinger-Keldysh (SK) effective\ntheories, holographic models serve as a complementary tool to provide a\nsystematic formulation of CAMHD that goes beyond the weak coupling regime. In\nthis work, we explore holographic models with $U(1)_A \\times U(1)$ symmetry,\nwhere the electromagnetic $U(1)$ field is rendered dynamical through mixed\nboundary conditions applied to the bulk gauge field and the axial anomaly is\nintroduced via a Chern-Simons bulk term. Through a detailed holographic SK\nanalysis, we demonstrate that the low-energy effective action derived from this\nmodel aligns precisely with the SK field theory proposed by Landry and Liu and,\nin fact, it generalizes it to scenarios with finite background axial field.\nThis alignment not only validates the holographic model but also paves the way\nfor its use in exploring unresolved aspects of CAMHD, such as the recently\nproposed chiral magnetic electric separation wave and nonlinear chiral\ninstabilities.\n","subjects":["Physics/High Energy Physics - Theory","Condensed Matter/Mesoscale and Nanoscale Physics","Physics/Nuclear Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"YqbWObwUN2eIJDtqcqnsW-y-YE6MB1XvAX1fZR3--j0","pdfSize":"285870"}