{"id":"2412.07488","title":"Dual Random Fields and their Application to Mineral Potential Mapping","authors":"\\'Alvaro I. Riquelme","authorsParsed":[["Riquelme","Álvaro I.",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 13:16:37 GMT"}],"updateDate":"2024-12-11","timestamp":1733836597000,"abstract":"  In various geosciences branches, including mineral exploration,\ngeometallurgical characterization on established mining operations, and remote\nsensing, the regionalized input variables are spatially well-sampled across the\ndomain of interest, limiting the scope of spatial uncertainty quantification\nprocedures. In turn, response outcomes such as the mineral potential in a given\nregion, mining throughput, metallurgical recovery, or in-situ estimations from\nremote satellite imagery, are usually modeled from a much-restricted subset of\ntesting samples, collected at certain locations due to accessibility\nrestrictions and the high acquisition costs. Our limited understanding of these\nfunctions, in terms of the multi-dimensional complexity of causalities and\nunnoticed dependencies on inaccessible inputs, may lead to observing changes in\nsuch functions based on their geographical location. Pooling together different\nresponse functions across the domain is critical to correctly predict outcome\nresponses, the uncertainty associated with these inferred values, and the\nsignificance of inputs in such predictions at unexplored areas. This paper\nintroduces the notion of a dual random field (dRF), where the response function\nitself is considered a regionalized variable. In this way, different\nestablished response models across the geographic domain can be considered as\nobservations of a dRF realization, enabling the spatial inference and\nuncertainty assessment of both response models and their predictions. We\nexplain how dRFs inherit all the properties from classical random fields,\nallowing the use of standard Gaussian simulation procedures to simulate them.\nThese models are combined to obtain a mineral potential response, providing an\nexample of how to rigorously integrate machine learning approaches with\ngeostatistics.\n","subjects":["Statistics/Machine Learning","Computer Science/Machine Learning","Statistics/Applications"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"6WeCEd2IyxSF1Z7arbeJnR93W9SfzMG40ICPQjC0Kjo","pdfSize":"46323518"}