{"id":"2412.07960","title":"Indirect Optimization of Multi-Phase Trajectories Involving Arbitrary\n  Discrete Logic","authors":"Harish Saranathan","authorsParsed":[["Saranathan","Harish",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 22:53:03 GMT"}],"updateDate":"2024-12-12","timestamp":1733871183000,"abstract":"  Multi-phase trajectories of aerospace vehicle systems involve multiple flight\nsegments whose transitions may be triggered by boolean logic in continuous\nstate variables, control and time. When the boolean logic is represented using\nonly states and/or time, such systems are termed autonomously switched hybrid\nsystems. The relaxed autonomously switched hybrid system approach (RASHS) was\npreviously introduced to simplify the trajectory optimization process of such\nsystems in the indirect framework when the boolean logic is solely represented\nusing AND operations. This investigation enables cases involving arbitrary\ndiscrete logic. The new approach is termed the Generalized Relaxed Autonomously\nSwitched Hybrid System (GRASHS) approach. Similar to the RASHS approach, the\noutcome of the GRASHS approach is the transformation of the necessary\nconditions of optimality from a multi-point boundary value problem to a\ntwo-point boundary value problem, which is simpler to handle. This is\naccomplished by converting the arbitrary boolean logic to the disjunctive\nnormal form and applying smoothing using sigmoid and hyperbolic tangent\nfunctions. The GRASHS approach is demonstrated by optimizing a Mars entry,\ndescent, and landing trajectory, where the parachute descent segment is active\nwhen the velocity is below the parachute deployment velocity or the altitude is\nbelow the parachute deployment altitude, and the altitude is above the powered\ndescent initiation altitude. This set of conditions represents a combination of\nAND and OR logic. The previously introduced RASHS approach is not designed to\nhandle such problems. The proposed GRASHS approach aims to fill this gap.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"tBcakfm4tUmv69nF4n-VLQUNZp6m-DfFWLkVysRD2Rw","pdfSize":"1621097"}