{
  "id": "2412.14893",
  "title": "Revealing Hidden States in Quantum Dot Array Dynamics: Quantum\n  Polyspectra Versus Waiting Time Analysis",
  "authors": "Markus Sifft, Johannes C. Bayer, Daniel H\\\"agele, and Rolf J. Haug",
  "authorsParsed": [
    [
      "Sifft",
      "Markus",
      ""
    ],
    [
      "Bayer",
      "Johannes C.",
      ""
    ],
    [
      "Hägele",
      "Daniel",
      ""
    ],
    [
      "Haug",
      "Rolf J.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 14:22:11 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734618131000,
  "abstract": "  Quantum dots (QDs) are pivotal for the development of quantum technologies,\nwith applications ranging from single-photon sources for secure communication\nto quantum computing infrastructures. Understanding the electron dynamics\nwithin these QDs is essential for characterizing their properties and\nfunctionality. Here, we show how by virtue of the recently introduced quantum\npolyspectral analysis of transport measurements, the complex transport\nmeasurements of multi-electron QD systems can be analyzed. This method directly\nrelates higher-order temporal correlations of a raw quantum point contact (QPC)\ncurrent measurement to the Liouvillian of the measured quantum system. By\napplying this method to the two-level switching dynamics of a double QD system,\nwe reveal a hidden third state, without relying on the identification of\nquantum jumps or prior assumptions about the number of involved quantum states.\nWe show that the statistics of the QPC current measurement can identically be\ndescribed by different three-state Markov models, each with significantly\ndifferent transition rates. Furthermore, we compare our method to a traditional\nanalysis via waiting-time distributions for which we prove that the statistics\nof a three-state Markov model is fully described without multi-time\nwaiting-time distributions even in the case of two level switching dynamics.\nBoth methods yield the same parameters with a similar accuracy. The quantum\npolyspectra method, however, stays applicable in scenarios with low\nsignal-to-noise, where the traditional full counting statistics falters. Our\napproach challenges previous assumptions and models, offering a more nuanced\nunderstanding of QD dynamics and paving the way for the optimization of quantum\ndevices.\n",
  "subjects": [
    "Physics/Quantum Physics",
    "Condensed Matter/Mesoscale and Nanoscale Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "PJYx_l8r18Kxgx6gztzx-1Ujeuc4LIFh9NxTECoFbBE",
  "pdfSize": "1313118"
}