{"id":"2412.12877","title":"MIVE: New Design and Benchmark for Multi-Instance Video Editing","authors":"Samuel Teodoro, Agus Gunawan, Soo Ye Kim, Jihyong Oh, Munchurl Kim","authorsParsed":[["Teodoro","Samuel",""],["Gunawan","Agus",""],["Kim","Soo Ye",""],["Oh","Jihyong",""],["Kim","Munchurl",""]],"versions":[{"version":"v1","created":"Tue, 17 Dec 2024 13:00:04 GMT"}],"updateDate":"2024-12-18","timestamp":1734440404000,"abstract":"  Recent AI-based video editing has enabled users to edit videos through simple\ntext prompts, significantly simplifying the editing process. However, recent\nzero-shot video editing techniques primarily focus on global or single-object\nedits, which can lead to unintended changes in other parts of the video. When\nmultiple objects require localized edits, existing methods face challenges,\nsuch as unfaithful editing, editing leakage, and lack of suitable evaluation\ndatasets and metrics. To overcome these limitations, we propose a zero-shot\n$\\textbf{M}$ulti-$\\textbf{I}$nstance $\\textbf{V}$ideo $\\textbf{E}$diting\nframework, called MIVE. MIVE is a general-purpose mask-based framework, not\ndedicated to specific objects (e.g., people). MIVE introduces two key modules:\n(i) Disentangled Multi-instance Sampling (DMS) to prevent editing leakage and\n(ii) Instance-centric Probability Redistribution (IPR) to ensure precise\nlocalization and faithful editing. Additionally, we present our new MIVE\nDataset featuring diverse video scenarios and introduce the Cross-Instance\nAccuracy (CIA) Score to evaluate editing leakage in multi-instance video\nediting tasks. Our extensive qualitative, quantitative, and user study\nevaluations demonstrate that MIVE significantly outperforms recent\nstate-of-the-art methods in terms of editing faithfulness, accuracy, and\nleakage prevention, setting a new benchmark for multi-instance video editing.\nThe project page is available at https://kaist-viclab.github.io/mive-site/\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"acYGXoOL_QMC0Ala5klpycnp2NSYvyz1eYV7KP3xCP0","pdfSize":"17691106"}