{
  "id": "2412.10896",
  "title": "Physics-based battery model parametrisation from impedance data",
  "authors": "No\\\"el Hallemans, Nicola E. Courtier, Colin P. Please, Brady Planden,\n  Rishit Dhoot, Robert Timms, S. Jon chapman, David Howey, Stephen R. Duncan",
  "authorsParsed": [
    [
      "Hallemans",
      "Noël",
      ""
    ],
    [
      "Courtier",
      "Nicola E.",
      ""
    ],
    [
      "Please",
      "Colin P.",
      ""
    ],
    [
      "Planden",
      "Brady",
      ""
    ],
    [
      "Dhoot",
      "Rishit",
      ""
    ],
    [
      "Timms",
      "Robert",
      ""
    ],
    [
      "chapman",
      "S. Jon",
      ""
    ],
    [
      "Howey",
      "David",
      ""
    ],
    [
      "Duncan",
      "Stephen R.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 14 Dec 2024 17:01:31 GMT"
    },
    {
      "version": "v2",
      "created": "Wed, 18 Dec 2024 16:06:06 GMT"
    },
    {
      "version": "v3",
      "created": "Thu, 30 Jan 2025 18:33:14 GMT"
    }
  ],
  "updateDate": "2025-01-31",
  "timestamp": 1734195691000,
  "abstract": "  Non-invasive parametrisation of physics-based battery models can be performed\nby fitting the model to electrochemical impedance spectroscopy (EIS) data\ncontaining features related to the different physical processes. However, this\nrequires an impedance model to be derived, which may be complex to obtain\nanalytically. We have developed the open-source software PyBaMM-EIS that\nprovides a fast method to compute the impedance of any PyBaMM model at any\noperating point using automatic differentiation. Using PyBaMM-EIS, we\ninvestigate the impedance of the single particle model, single particle model\nwith electrolyte (SPMe), and Doyle-Fuller-Newman model, and identify the SPMe\nas a parsimonious option that shows the typical features of measured\nlithium-ion cell impedance data. We provide a grouped parameter SPMe and\nanalyse the features in the impedance related to each parameter. Using the\nopen-source software PyBOP, we estimate 18 grouped parameters both from\nsimulated impedance data and from measured impedance data from a LG M50LT\nlithium-ion battery. The parameters that directly affect the response of the\nSPMe can be accurately determined and assigned to the correct electrode.\nCrucially, parameter fitting must be done simultaneously to data across a wide\nrange of states-of-charge. Overall, this work presents a practical way to find\nthe parameters of physics-based models.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Systems and Control",
    "Condensed Matter/Materials Science",
    "Computer Science/Systems and Control"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Yx2hUDwZgA9F0W16y1ogAoj85Kh17hruczS_8srffgE",
  "pdfSize": "3146371"
}