{
  "id": "2412.08092",
  "title": "Suspense and surprise in the book of technology: Understanding\n  innovation dynamics",
  "authors": "Oh-Hyun Kwon, Jisung Yoon, Lav R. Varshney, Woo-Sung Jung, Hyejin Youn",
  "authorsParsed": [
    [
      "Kwon",
      "Oh-Hyun",
      ""
    ],
    [
      "Yoon",
      "Jisung",
      ""
    ],
    [
      "Varshney",
      "Lav R.",
      ""
    ],
    [
      "Jung",
      "Woo-Sung",
      ""
    ],
    [
      "Youn",
      "Hyejin",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 04:23:39 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733891019000,
  "abstract": "  We envision future technologies through science fiction, strategic planning,\nor academic research. Yet, our expectations do not always match with what\nactually unfolds, much like navigating a story where some events align with\nexpectations while others surprise us. This gap indicates the inherent\nuncertainty of innovation-how technologies emerge and evolve in unpredictable\nways. Here, we elaborate on this inherent uncertainty of innovation in the way\ntechnologies emerge and evolve. We define suspense captures accumulated\nuncertainty and describing events anticipated before their realization, while\nsurprise represents a dramatic shift in understanding when an event occurs\nunexpectedly. We identify those connections in U.S. patents and show that\nsuspenseful innovations tend to integrate more smoothly into society, achieving\nhigher citations and market value. In contrast, surprising innovations, though\noften disruptive and groundbreaking, face challenges in adoption due to their\nextreme novelty. We further show that these categories allow us to identify\ndistinct stages of technology life cycles, suggesting a way to identify the\nsystematic trajectory of technologies and anticipate their future paths.\n",
  "subjects": [
    "Physics/Physics and Society"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "hHy-ulyWY4f1oST_qyD0I0geprhBceRv1G7oLtfRQGM",
  "pdfSize": "1041779"
}