{
  "id": "2412.08736",
  "title": "Critical nanoparticle formation in iron combustion: single particle\n  experiments with in-situ multi-parameter diagnostics aided by multi-scale\n  simulations",
  "authors": "Tao Li, Bich-Diep Nguyen, Yawei Gao, Daoguan Ning, Benjamin B\\\"ohm,\n  Arne Scholtissek, Adri C.T. van Duin, Christian Hasse, Andreas Dreizler",
  "authorsParsed": [
    [
      "Li",
      "Tao",
      ""
    ],
    [
      "Nguyen",
      "Bich-Diep",
      ""
    ],
    [
      "Gao",
      "Yawei",
      ""
    ],
    [
      "Ning",
      "Daoguan",
      ""
    ],
    [
      "Böhm",
      "Benjamin",
      ""
    ],
    [
      "Scholtissek",
      "Arne",
      ""
    ],
    [
      "van Duin",
      "Adri C. T.",
      ""
    ],
    [
      "Hasse",
      "Christian",
      ""
    ],
    [
      "Dreizler",
      "Andreas",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 19:08:58 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1733944138000,
  "abstract": "  The formation of iron oxide nanoparticles (NPs) presents challenges such as\nefficiency losses and fine dust emissions in practical iron combustion systems,\nhighlighting the need for deeper understanding of the formation mechanisms and\nthermochemical conditions. This study combines experiments and multi-scale\nsimulations to analyze NP clouds generated by single iron particles burning in\nhigh-temperature oxidizing environments. The ambient gas conditions were\nprovided by a laminar flat flame burner, with post-flame oxygen mole fractions\nvaried between 20, 30, and 40 vol% at a constant temperature of ~1800K.\nHigh-speed in-situ diagnostics were used to measure particle size, NP\ninitiation, NP cloud evolution, and microparticle surface temperature history.\nThe experimental setup utilized three 10kHz imaging systems: one for two-color\npyrometry and two for diffusive-backlight illumination (DBI), targeting\nparticle size and NP measurements. The findings showcase the powerful\ncapabilities of multi-physics diagnostics in quantifying NP initiation time and\ntemperature, which depend on particle size and ambient oxygen concentration.\nCFD simulations revealed enhanced convection velocity driven by increased\nStefan flow, which transported NPs toward parent iron particles under\nhigh-oxygen conditions. This delayed the detection of NP clouds, leading to\nhigher microparticle temperatures at NP initiation. Molecular dynamics (MD)\nsimulations uncovered FeO2(g) as a key NP precursor, forming when Fe atoms\ndissociate from the liquid phase. The initial temperature significantly\ninfluenced the resulting nanocluster composition, with Fe(II) dominating at\nhigher temperatures and Fe(III) at lower temperatures. This integrated approach\nenhances understanding of NP formation in iron combustion, offering insights\ninto the conditions affecting nanoparticle characteristics.\n",
  "subjects": [
    "Physics/Fluid Dynamics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "LCit6P7anqPQvs0AnEGGPEN4N8SfKGnIc7Z12QeIzno",
  "pdfSize": "8294051"
}