{
  "id": "2412.17296",
  "title": "Comparison of Spatiotemporal Characteristics of Eye Movements in\n  Non-experts and the Skill Transfer Effects of Gaze Guidance and Annotation\n  Guidance",
  "authors": "Shota Nishijima, Asuka Takai",
  "authorsParsed": [
    [
      "Nishijima",
      "Shota",
      ""
    ],
    [
      "Takai",
      "Asuka",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 05:34:08 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734932048000,
  "abstract": "  Methods for converting the tacit knowledge of experts into explicit knowledge\nhave drawn increasing attention. Gaze data has emerged as a valuable approach\nin this effort. However, the effective transfer of tacit knowledge remains a\nchallenge. No studies have directly compared the effects of gaze-based and\nannotation-based guidance or adequately examined their impacts on skill\nimprovement after instruction. This study examined the effects of gaze and\nannotation guidance on the spatiotemporal characteristics of eye movements and\nthe skill transfer of expert evaluation techniques in karate kata performances.\n28 non-expert participants were assigned to three groups: a gaze guidance\ngroup, an annotation guidance group, and a control group. Participants were\npresented with instructional slideshows based on the expert's gaze data and\nannotations. Before and after instruction, participants were asked to evaluate\nkarate kata performance videos performed by practitioners with different skill\nlevels. The results showed that the annotation guidance group exhibited an\neffect of directing gaze toward the presented areas of focus, with a trend of\nincreased total number of fixation areas. On the other hand, while the gaze\nguidance group was not encouraged to make fixations on multiple areas, the\npossibility of promoting peripheral vision was inferred based on measurements\nfrom the eye-tracking system. Regarding ranking results, 71.4% of participants\nin the gaze guidance group showed an improvement in ranking skills, with a\ntrend toward better scoring ability compared to the other groups. This\ndemonstrates the necessity of selecting appropriate methods based on\ninstructional goals to transfer tacit knowledge effectively. Gaze-based\ninstructional methods are expected to be versatile and applicable to karate\nkata and fields such as industry, medicine, and other sports.\n",
  "subjects": [
    "Quantitative Biology/Neurons and Cognition"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "z4GwT8VjJscTndF3NNyWWlRVsBSs2Ll7SQlG3tLmQJM",
  "pdfSize": "1560063"
}