{
  "id": "2412.04532",
  "title": "WinTSR: A Windowed Temporal Saliency Rescaling Method for Interpreting\n  Time Series Deep Learning Models",
  "authors": "Md. Khairul Islam, Judy Fox",
  "authorsParsed": [
    [
      "Islam",
      "Md. Khairul",
      ""
    ],
    [
      "Fox",
      "Judy",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 17:15:07 GMT"
    },
    {
      "version": "v2",
      "created": "Tue, 25 Feb 2025 16:41:01 GMT"
    }
  ],
  "updateDate": "2025-02-26",
  "timestamp": 1733418907000,
  "abstract": "  Interpreting complex time series forecasting models is challenging due to the\ntemporal dependencies between time steps and the dynamic relevance of input\nfeatures over time. Existing interpretation methods are limited by focusing\nmostly on classification tasks, evaluating using custom baseline models instead\nof the latest time series models, using simple synthetic datasets, and\nrequiring training another model. We introduce a novel interpretation method,\n\\textit{Windowed Temporal Saliency Rescaling (WinTSR)} addressing these\nlimitations. WinTSR explicitly captures temporal dependencies among the past\ntime steps and efficiently scales the feature importance with this time\nimportance. We benchmark WinTSR against 10 recent interpretation techniques\nwith 5 state-of-the-art deep-learning models of different architectures,\nincluding a time series foundation model. We use 3 real-world datasets for both\ntime-series classification and regression. Our comprehensive analysis shows\nthat WinTSR significantly outperforms other local interpretation methods in\noverall performance. Finally, we provide a novel, open-source framework to\ninterpret the latest time series transformers and foundation models.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "dC6M05usJAGP2uxr3iZIRwqNFGryz2QLvk1wBAZzYoY",
  "pdfSize": "881668"
}