{
  "id": "2412.06890",
  "title": "Continuous order-to-order quantum phase transitions from fixed-point\n  annihilation",
  "authors": "David Jonas Moser, Lukas Janssen",
  "authorsParsed": [
    [
      "Moser",
      "David Jonas",
      ""
    ],
    [
      "Janssen",
      "Lukas",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 19:00:02 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733770802000,
  "abstract": "  A central concept in the theory of phase transitions beyond the\nLandau-Ginzburg-Wilson paradigm is fractionalization: the formation of new\nquasiparticles that interact via emergent gauge fields. This concept has been\nextensively explored in the context of continuous quantum phase transitions\nbetween distinct orders that break different symmetries. We propose a mechanism\nfor continuous order-to-order quantum phase transitions that operates\nindependently of fractionalization. This mechanism is based on the collision\nand annihilation of two renormalization group fixed points: a quantum critical\nfixed point and an infrared stable fixed point. The annihilation of these fixed\npoints rearranges the flow topology, eliminating the disordered phase\nassociated with the infrared stable fixed point and promoting a second critical\nfixed point, unaffected by the collision, to a quantum critical point between\ndistinct orders. We argue that this mechanism is relevant to a broad spectrum\nof physical systems. In particular, it can manifest in Luttinger fermion\nsystems in three spatial dimensions, leading to a continuous quantum phase\ntransition between an antiferromagnetic Weyl semimetal state, which breaks\ntime-reversal symmetry, and a nematic topological insulator, characterized by\nbroken lattice rotational symmetry. This continuous\nantiferromagnetic-Weyl-to-nematic-insulator transition might be observed in\nrare-earth pyrochlore iridates $R_2$Ir$_2$O$_7$. Other possible realizations\ninclude kagome quantum magnets, quantum impurity models, and quantum\nchromodynamics with supplemental four-fermion interactions.\n",
  "subjects": [
    "Condensed Matter/Strongly Correlated Electrons",
    "Condensed Matter/Statistical Mechanics",
    "Physics/High Energy Physics - Theory"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "wLonWtqdR_AQBcQY03Fzq_MNtgl2NmcEbfFrdlwJ_PI",
  "pdfSize": "3233659"
}