{"id":"2412.20153","title":"Back-Scattering Suppression for Broad-Spectral High-Absorption Silicon\n  Extended Area Blackbody","authors":"HongShuai Zhou, JinHao Zhang, BenFeng Bai, XiRan Mei, KunPeng Chen,\n  XiaoPeng Hao, Jian Song, GuoRui Guo, JiaLin Chen, Tian Tian, WanJie Shen,\n  ZiHeng Zhong, JiaYao Liu, JiHong Zhao and HongBo Sun","authorsParsed":[["Zhou","HongShuai",""],["Zhang","JinHao",""],["Bai","BenFeng",""],["Mei","XiRan",""],["Chen","KunPeng",""],["Hao","XiaoPeng",""],["Song","Jian",""],["Guo","GuoRui",""],["Chen","JiaLin",""],["Tian","Tian",""],["Shen","WanJie",""],["Zhong","ZiHeng",""],["Liu","JiaYao",""],["Zhao","JiHong",""],["Sun","HongBo",""]],"versions":[{"version":"v1","created":"Sat, 28 Dec 2024 13:37:19 GMT"}],"updateDate":"2024-12-31","timestamp":1735393039000,"abstract":"  The stability and emissivity of the online calibration blackbody used in\nhigh-precision infrared remote sensing detectors in extreme environments are\nthe primary limiting factors for their measurement accuracy. Due to the\nlimitations of microstructure size effects, traditional calibration extended\narea blackbody cannot achieve an optimal balance between emissivity and\nstability, thus hindering further improvement in infrared remote sensing\naccuracy. This work proposes a new method that utilize suppressing near-field\nbackscattering to control far-field reflectance. Specifically, through\nsimultaneously reducing backscattering intensity and the backscattering solid\nangle, the reflectance is significantly reduced to an extremely low limit,\nwhich is validated through numerical simulations. Additionally, by combining\nthe femtosecond laser self-convergent processing technique, the spontaneous\nenergy negative feedback mechanism during femtosecond laser processing is\nutilized to achieve the fabrication of a high emissivity, thermally stable,\nmechanically stable, and highly uniform extended area blackbody. The blackbody\nfabricated using this technique can be applied for online calibration in\nvarious extreme environments, significantly improving measurement accuracy and\nservice life.\n","subjects":["Physics/Optics","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"jDxffwecck4bFwyN58a-L4qJnLi6sQgQJ8m7LIDbjcI","pdfSize":"1894407"}