{"id":"2412.11272","title":"Efficient Whisper on Streaming Speech","authors":"Rongxiang Wang, Zhiming Xu, Felix Xiaozhu Lin","authorsParsed":[["Wang","Rongxiang",""],["Xu","Zhiming",""],["Lin","Felix Xiaozhu",""]],"versions":[{"version":"v1","created":"Sun, 15 Dec 2024 18:27:37 GMT"}],"updateDate":"2024-12-17","timestamp":1734287257000,"abstract":"  Speech foundation models, exemplified by OpenAI's Whisper, have emerged as\nleaders in speech understanding thanks to their exceptional accuracy and\nadaptability. However, their usage largely focuses on processing pre-recorded\naudio, with the efficient handling of streaming speech still in its infancy.\nSeveral core challenges underlie this limitation: (1) These models are trained\nfor long, fixed-length audio inputs (typically 30 seconds). (2) Encoding such\ninputs involves processing up to 1,500 tokens through numerous transformer\nlayers. (3) Generating outputs requires an irregular and computationally heavy\nbeam search. Consequently, streaming speech processing on edge devices with\nconstrained resources is more demanding than many other AI tasks, including\ntext generation. To address these challenges, we introduce Whisper-T, an\ninnovative framework combining both model and system-level optimizations: (1)\nHush words, short learnable audio segments appended to inputs, prevent\nover-processing and reduce hallucinations in the model. (2) Beam pruning aligns\nstreaming audio buffers over time, leveraging intermediate decoding results to\nsignificantly speed up the process. (3) CPU/GPU pipelining dynamically\ndistributes resources between encoding and decoding stages, optimizing\nperformance by adapting to variations in audio input, model characteristics,\nand hardware. We evaluate Whisper-T on ARM-based platforms with 4-12 CPU cores\nand 10-30 GPU cores, demonstrating latency reductions of 1.6x-4.7x, achieving\nper-word delays as low as 0.5 seconds with minimal accuracy loss. Additionally,\non a MacBook Air, Whisper-T maintains approximately 1-second latency per word\nwhile consuming just 7 Watts of total system power.\n","subjects":["Computer Science/Sound","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"zApPwlJneLf5aBS-PfBIdayYdf270-pPJt6s-gJ5Pc0","pdfSize":"1487613"}