{"id":"2412.20431","title":"False vacuum decay of excited states in finite-time instanton calculus","authors":"Bj\\\"orn Garbrecht, Nils Wagner","authorsParsed":[["Garbrecht","Björn",""],["Wagner","Nils",""]],"versions":[{"version":"v1","created":"Sun, 29 Dec 2024 10:47:54 GMT"}],"updateDate":"2024-12-31","timestamp":1735469274000,"abstract":"  Extracting information about a system's metastable ground state energy\nemploying functional methods usually hinges on utilizing the late-time behavior\nof the Euclidean propagator, practically impeding the possibility of\ndetermining decay widths of excited states. We demonstrate that such obstacles\ncan be surmounted by working with bounded time intervals, adapting the standard\ninstanton formalism to compute a finite-time amplitude corresponding to excited\nstate decay. This is achieved by projecting out the desired resonant energies\nutilizing carefully chosen approximations to the excited state wave functions\nin the false vacuum region. To carry out the calculation, we employ\nunconventional path integral techniques by considering the emerging amplitude\nas a single composite functional integral that includes fluctuations at the\nendpoints of the trajectories. This way, we explicitly compute the sought-after\ndecay widths, including their leading quantum corrections, for arbitrary\npotentials, demonstrating accordance with traditional WKB results. While the\ninitial starting point of weighting Euclidean propagator contributions\naccording to their endpoints using false vacuum states has been proposed\nearlier, we find several flaws in the published evaluation of the relevant\namplitudes. Although we show that the previous proposition of employing a\nsequential calculation scheme -- where the functional integral is evaluated\naround extremal trajectories with fixed endpoints, weighted only at a\nsubsequent stage -- can lead to the desired goal, the novel composite approach\nis found to be more concise and transparent.\n","subjects":["Physics/High Energy Physics - Theory","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"cTBlj088TepP1nShs01PPdh6pY5NPnJZuSHru7zPqhU","pdfSize":"2509240"}