{"id":"2412.14770","title":"Polarized Dust Emission in Arp220: Magnetic Fields in the Core of an\n  Ultraluminous Infrared Galaxy","authors":"David L Clements, Qizhou Zhang, K. Pattle, G. Petitpas, Y. Ding, J.\n  Cairns","authorsParsed":[["Clements","David L",""],["Zhang","Qizhou",""],["Pattle","K.",""],["Petitpas","G.",""],["Ding","Y.",""],["Cairns","J.",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 11:54:16 GMT"}],"updateDate":"2024-12-20","timestamp":1734609256000,"abstract":"  Arp 220 is the prototypical Ultraluminous Infrared Galaxy (ULIRG), and one of\nthe brightest objects in the extragalactic far-infrared sky. It is the result\nof a merger between two gas rich spiral galaxies which has triggered\nstarbursting activity in the merger nuclear regions. Observations with the\nSubmillimeter Array centred at a frequency of 345 GHz and with a synthesised\nbeamsize of 0.77 x 0.45 arcseconds were used to search for polarized dust\nemission from the nuclear regions of Arp 220. Polarized dust emission was\nclearly detected at 6 sigma significance associated with the brighter, western\nnucleus, with a peak polarization fraction of 2.7 +/- 0.35 per cent somewhat\noffset from the western nucleus. A suggestive 2.6 sigma signal is seen from the\nfainter eastern nucleus. The dust emission polarization is oriented roughly\nperpendicular to the molecular disk in the western nucleus suggesting that the\nmagnetic field responsible is orientated broadly in the plane of the disk, but\nmay be being reordered by the interaction between the two nuclei. Unlike more\nevolved interacting systems, we see no indication that the magnetic field is\nbeing reordered by the outflow from the western nucleus. These observations are\nthe first detection of dust polarization, and thus of magnetic fields, in the\ncore of a ULIRG.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"K8CMR9mBHQVrawINcYKZiRxRaitSBOsNij17fLGusGg","pdfSize":"2557412"}