{"id":"2412.03749","title":"Electrically functionalized body surface for deep-tissue bioelectrical\n  recording","authors":"Dehui Zhang, Yucheng Zhang, Dong Xu, Shaolei Wang, Kaidong Wang,\n  Boxuan Zhou, Yansong Ling, Yang Liu, Qingyu Cui, Junyi Yin, Enbo Zhu, Xun\n  Zhao, Chengzhang Wan, Jun Chen, Tzung K. Hsiai, Yu Huang, and Xiangfeng Duan","authorsParsed":[["Zhang","Dehui",""],["Zhang","Yucheng",""],["Xu","Dong",""],["Wang","Shaolei",""],["Wang","Kaidong",""],["Zhou","Boxuan",""],["Ling","Yansong",""],["Liu","Yang",""],["Cui","Qingyu",""],["Yin","Junyi",""],["Zhu","Enbo",""],["Zhao","Xun",""],["Wan","Chengzhang",""],["Chen","Jun",""],["Hsiai","Tzung K.",""],["Huang","Yu",""],["Duan","Xiangfeng",""]],"versions":[{"version":"v1","created":"Wed, 4 Dec 2024 22:38:37 GMT"}],"updateDate":"2024-12-06","timestamp":1733351917000,"abstract":"  Directly probing deep tissue activities from body surfaces offers a\nnoninvasive approach to monitoring essential physiological processes1-3.\nHowever, this method is technically challenged by rapid signal attenuation\ntoward the body surface and confounding motion artifacts4-6 primarily due to\nexcessive contact impedance and mechanical mismatch with conventional\nelectrodes. Herein, by formulating and directly spray coating biocompatible\ntwo-dimensional nanosheet ink onto the human body under ambient conditions, we\ncreate microscopically conformal and adaptive van der Waals thin films (VDWTFs)\nthat seamlessly merge with non-Euclidean, hairy, and dynamically evolving body\nsurfaces. Unlike traditional deposition methods, which often struggle with\nconformality and adaptability while retaining high electronic performance, this\ngentle process enables the formation of high-performance VDWTFs directly on the\nbody surface under bio-friendly conditions, making it ideal for biological\napplications. This results in low-impedance electrically functionalized body\nsurfaces (EFBS), enabling highly robust monitoring of biopotential and\nbioimpedance modulations associated with deep-tissue activities, such as blood\ncirculation, muscle movements, and brain activities. Compared to commercial\nsolutions, our VDWTF-EFBS exhibits nearly two-orders of magnitude lower contact\nimpedance and substantially reduces the extrinsic motion artifacts, enabling\nreliable extraction of bioelectrical signals from irregular surfaces, such as\nunshaved human scalps. This advancement defines a technology for continuous,\nnoninvasive monitoring of deep-tissue activities during routine body movements.\n","subjects":["Physics/Medical Physics","Electrical Engineering and Systems Science/Signal Processing","Physics/Biological Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"rdBw4QBojBP0auACowSokGpZyu5Gp8YX2RPkg44uFSU","pdfSize":"3562339"}