{
  "id": "2412.02139",
  "title": "Large Deviations Principle for the Fluctuating Boltzmann Equation",
  "authors": "Liu Hong",
  "authorsParsed": [
    [
      "Hong",
      "Liu",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 03:52:57 GMT"
    }
  ],
  "updateDate": "2024-12-04",
  "timestamp": 1733197977000,
  "abstract": "  The Boltzmann equation is one of the most famous equations and has vast\napplications in modern science. In the current study, we take the randomness of\nbinary collisions into consideration and generalize the classical Boltzmann\nequation into a stochastic framework. The corresponding Kolmogorov forward\nequations and Liouville equation in either discrete or continuous time and\nstate space are derived respectively, whose characteristic line gives the\nBoltzmann equation as a consequence of the law of large numbers. Then the large\ndeviations principle for these equations is established, which not only\nexplains the probabilistic origin of the H-theorem in the Boltzmann equation,\nbut also provides a natural way to incorporate the Boltzmann equation into a\nbroader Hamiltonian structure. The so-called Hamilton-Boltzmann equation enjoys\nmany significant merits, like time reversibility, the conservation laws of\nmass, momentum and energy, Maxwellian-Boltzmann distribution as the equilibrium\nsolution, etc. We also present results under the diffusive limit in parallel.\nFinally, the macroscopic hydrodynamic models including 13 moments are derived\nwith respect to our Hamilton-Boltzmann equation under the BGK approximation. We\nexpect our study can inspire new insights into the classical Boltzmann equation\nfrom either the stochastic aspect or a Hamiltonian view.\n",
  "subjects": [
    "Condensed Matter/Statistical Mechanics",
    "Physics/Mathematical Physics",
    "Mathematics/Mathematical Physics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "-O4uxTx9AYlLqGAgEaXMfCAs0Rd2Mgvd0Vj06wM5k3o",
  "pdfSize": "400875"
}