{
  "id": "2412.07279",
  "title": "Impact of Device Resistances in the Performance of Graphene-based\n  Terahertz Photodetectors",
  "authors": "O. Castell\\'o, Sof\\'ia M. L\\'opez Baptista, K. Watanabe, T. Taniguchi,\n  E. Diez, J.E. Vel\\'azquez-P\\'erez, Y.M. Meziani, J.M. Caridad and J.A.\n  Delgado-Notario",
  "authorsParsed": [
    [
      "Castelló",
      "O.",
      ""
    ],
    [
      "Baptista",
      "Sofía M. López",
      ""
    ],
    [
      "Watanabe",
      "K.",
      ""
    ],
    [
      "Taniguchi",
      "T.",
      ""
    ],
    [
      "Diez",
      "E.",
      ""
    ],
    [
      "Velázquez-Pérez",
      "J. E.",
      ""
    ],
    [
      "Meziani",
      "Y. M.",
      ""
    ],
    [
      "Caridad",
      "J. M.",
      ""
    ],
    [
      "Delgado-Notario",
      "J. A.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 08:08:22 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733818102000,
  "abstract": "  In recent years, graphene Field-Effect-Transistors (GFETs) have demonstrated\nan outstanding potential for Terahertz (THz) photodetection due to their fast\nresponse and high-sensitivity. Such features are essential to enable emerging\nTHz applications, including 6G wireless communications, quantum information,\nbioimaging and security. However, the overall performance of these\nphotodetectors may be utterly compromised by the impact of internal resistances\npresented in the device, so-called access or parasitic resistances. In this\nwork, we provide a detailed study of the influence of internal device\nresistances in the photoresponse of high-mobility dual-gate GFET detectors.\nSuch dual-gate architectures allow us to fine tune (decrease) the internal\nresistance of the device by an order of magnitude and consequently demonstrate\nan improved responsivity and noise-equivalent-power values of the\nphotodetector, respectively. Our results can be well understood by a series\nresistance model, as shown by the excellent agreement found between the\nexperimental data and theoretical calculations. These findings are therefore\nrelevant to understand and improve the overall performance of existing\nhigh-mobility graphene photodetectors.\n",
  "subjects": [
    "Condensed Matter/Mesoscale and Nanoscale Physics",
    "Physics/Instrumentation and Detectors"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "gNsVzRBPtz4v-1tsTHMZEkaTzFoVy0nNCXWrYt_KNaw",
  "pdfSize": "1281706"
}