{"id":"2412.09238","title":"Disturbance-Adaptive Data-Driven Predictive Control: Trading Comfort\n  Violations for Savings in Building Climate Control","authors":"Jicheng Shi, Christophe Salzmann, Colin N. Jones","authorsParsed":[["Shi","Jicheng",""],["Salzmann","Christophe",""],["Jones","Colin N.",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 12:47:22 GMT"}],"updateDate":"2024-12-13","timestamp":1734007642000,"abstract":"  Model Predictive Control (MPC) has demonstrated significant potential in\nimproving energy efficiency in building climate control, outperforming\ntraditional controllers commonly used in modern building management systems.\nAmong MPC variants, data-driven predictive control (DPC) offers the advantage\nof modeling building dynamics directly from data, thereby substantially\nreducing commissioning efforts. However, inevitable model uncertainties and\nmeasurement noise can result in comfort violations, even with dedicated MPC\nsetups. This work introduces a disturbance-adaptive DPC (DAD-DPC) framework\ndesigned to ensure asymptotic satisfaction of predefined violation bounds under\nsufficient conditions. The framework employs a fully data-driven pipeline based\non Willems' Fundamental Lemma and conformal prediction for application in\nbuilding climate control. The proposed DAD-DPC framework was validated using\nfour building cases, leveraging a high-fidelity simulation platform, BOPTEST,\nand an actual building testbed, Polydome. For a 5% violation bound, the\nframework achieved energy consumption increases of 2.82%, 2.24%, 3.75%, and\n5.09% while reducing comfort violations by 77.62%, 79.51%, 73.26%, and 39.76%,\nrespectively, compared to other controller configurations. These results\ndemonstrate the framework's ability to effectively balance energy consumption\nand comfort violations, offering a practical solution for building climate\ncontrol applications.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computer Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"28K_rlf6v-RYjcfANRHE8hsFZzWfnpKMflwBOEZM2Zk","pdfSize":"3220035"}