{
  "id": "2412.13947",
  "title": "Real Classification by Description: Extending CLIP's Limits of Part\n  Attributes Recognition",
  "authors": "Ethan Baron, Idan Tankel, Peter Tu, Guy Ben-Yosef",
  "authorsParsed": [
    [
      "Baron",
      "Ethan",
      ""
    ],
    [
      "Tankel",
      "Idan",
      ""
    ],
    [
      "Tu",
      "Peter",
      ""
    ],
    [
      "Ben-Yosef",
      "Guy",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 15:28:08 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734535688000,
  "abstract": "  In this study, we define and tackle zero shot \"real\" classification by\ndescription, a novel task that evaluates the ability of Vision-Language Models\n(VLMs) like CLIP to classify objects based solely on descriptive attributes,\nexcluding object class names. This approach highlights the current limitations\nof VLMs in understanding intricate object descriptions, pushing these models\nbeyond mere object recognition. To facilitate this exploration, we introduce a\nnew challenge and release description data for six popular fine-grained\nbenchmarks, which omit object names to encourage genuine zero-shot learning\nwithin the research community. Additionally, we propose a method to enhance\nCLIP's attribute detection capabilities through targeted training using\nImageNet21k's diverse object categories, paired with rich attribute\ndescriptions generated by large language models. Furthermore, we introduce a\nmodified CLIP architecture that leverages multiple resolutions to improve the\ndetection of fine-grained part attributes. Through these efforts, we broaden\nthe understanding of part-attribute recognition in CLIP, improving its\nperformance in fine-grained classification tasks across six popular benchmarks,\nas well as in the PACO dataset, a widely used benchmark for object-attribute\nrecognition. Code is available at:\nhttps://github.com/ethanbar11/grounding_ge_public.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "IcTtMyFEhqD9giJje2o2-ROg0WVZcS7cPHlm7jBfgx4",
  "pdfSize": "3016027"
}