{
  "id": "2412.02450",
  "title": "A Comprehensive Survey on Dynamic Software Updating Techniques in IoTs",
  "authors": "Madhav Neupane",
  "authorsParsed": [
    [
      "Neupane",
      "Madhav",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 1 Dec 2024 03:35:52 GMT"
    }
  ],
  "updateDate": "2024-12-04",
  "timestamp": 1733024152000,
  "abstract": "  This comprehensive survey paper provides an in-depth analysis of Dynamic\nSoftware Updating (DSU) techniques in the Internet of Things (IoT). This study\ncritically examines eight significant research papers that employ diverse\nmethodologies to address the challenges of DSU in IoT devices. The primary\nobjectives include comparative analysis to identify the application domains of\nDSU tools, classification of program alterations accommodated by these systems,\nevaluation of the advantages and disadvantages of various DSU tools, and\nidentification of potential paths for future research. This paper emphasizes\nthe critical function of DSU in improving energy efficiency, extending\noperational durability, and bolstering security within IoT environments that\ndemand high availability, including applications in smart cities and connected\nvehicles. It delves into the basic approaches and mechanisms of DSU, ranging\nfrom traditional methods to advanced practices like Over-the-Air updates and\ncontainer-based solutions. This survey highlights the evolving nature of DSU\ntechniques, balancing operational efficiency, security, and adaptability amidst\nthe complexities of diverse IoT applications. Through this exploration, the\npaper aims to guide future developments in DSU strategies, enhancing IoT\ndevices' resilience, functionality, and sustainability in a connected world.\nThe insights from this survey are pivotal for researchers, practitioners, and\npolicymakers in shaping effective DSU strategies to meet the growing needs of\nthe IoT ecosystem.\n",
  "subjects": [
    "Computer Science/Software Engineering",
    "Computer Science/Human-Computer Interaction",
    "Computer Science/Networking and Internet Architecture"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "7VcIXBRUnWuAjT946kPHKOEiNwtP_BDeaWkmYnTyTiU",
  "pdfSize": "455020"
}