{"id":"2412.11800","title":"Scalable Temporal Anomaly Causality Discovery in Large Systems:\n  Achieving Computational Efficiency with Binary Anomaly Flag Data","authors":"Mulugeta Weldezgina Asres, Christian Walter Omlin, The CMS-HCAL\n  Collaboration","authorsParsed":[["Asres","Mulugeta Weldezgina",""],["Omlin","Christian Walter",""],["Collaboration","The CMS-HCAL",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 14:11:28 GMT"}],"updateDate":"2024-12-17","timestamp":1734358288000,"abstract":"  Extracting anomaly causality facilitates diagnostics once monitoring systems\ndetect system faults. Identifying anomaly causes in large systems involves\ninvestigating a more extensive set of monitoring variables across multiple\nsubsystems. However, learning causal graphs comes with a significant\ncomputational burden that restrains the applicability of most existing methods\nin real-time and large-scale deployments. In addition, modern monitoring\napplications for large systems often generate large amounts of binary alarm\nflags, and the distinct characteristics of binary anomaly data -- the meaning\nof state transition and data sparsity -- challenge existing causality learning\nmechanisms. This study proposes an anomaly causal discovery approach\n(AnomalyCD), addressing the accuracy and computational challenges of generating\ncausal graphs from binary flag data sets. The AnomalyCD framework presents\nseveral strategies, such as anomaly flag characteristics incorporating\ncausality testing, sparse data and link compression, and edge pruning\nadjustment approaches. We validate the performance of this framework on two\ndatasets: monitoring sensor data of the readout-box system of the Compact Muon\nSolenoid experiment at CERN, and a public data set for information technology\nmonitoring. The results demonstrate the considerable reduction of the\ncomputation overhead and moderate enhancement of the accuracy of temporal\ncausal discovery on binary anomaly data sets.\n","subjects":["Computer Science/Machine Learning","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"BHMd0aj5NBTuQH86bSyu2NJDzyZx6of2S-IrdglYZOc","pdfSize":"4721409"}