{"id":"2412.16122","title":"Multi-scale reconstruction of large supply networks","authors":"Leonardo Niccol\\`o Ialongo, Sylvain Bangma, Fabian Jansen and Diego\n  Garlaschelli","authorsParsed":[["Ialongo","Leonardo Niccolò",""],["Bangma","Sylvain",""],["Jansen","Fabian",""],["Garlaschelli","Diego",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 18:11:14 GMT"}],"updateDate":"2024-12-23","timestamp":1734718274000,"abstract":"  The structure of the supply chain network has important implications for\nmodelling economic systems, from growth trajectories to responses to shocks or\nnatural disasters. However, reconstructing firm-to-firm networks from available\ninformation poses several practical and theoretical challenges: the lack of\npublicly available data, the complexity of meso-scale structures, and the high\nlevel of heterogeneity of firms. With this work we contribute to the literature\non economic network reconstruction by proposing a novel methodology based on a\nrecently developed multi-scale model. This approach has three main advantages\nover other methods: its parameters are defined to maintain statistical\nconsistency at different scales of node aggregation, it can be applied in a\nmulti-scale setting, and it is computationally more tractable for very large\ngraphs. The consistency at different scales of aggregation, inherent to the\nmodel definition, is preserved for any hierarchy of coarse-grainings. The\narbitrariness of the aggregation allows us to work across different scales,\nmaking it possible to estimate model parameters even when node information is\ninconsistent, such as when some nodes are firms while others are countries or\nregions. Finally, the model can be fitted at an aggregate scale with lower\ncomputational requirements, since the parameters are invariant to the grouping\nof nodes. We assess the advantages and limitations of this approach by testing\nit on two complementary datasets of Dutch firms constructed from inter-client\ntransactions on the bank accounts of two major Dutch banking institutions. We\nshow that the model reliably predicts important topological properties of the\nobserved network in several scenarios of practical interest and is therefore a\nsuitable candidate for reconstructing firm-to-firm networks at scale.\n","subjects":["Physics/Physics and Society","Economics/General Economics","Quantitative Finance/Economics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"v6QElL2Uvy4bnQSX64VJladTVkqYwn6M0Rm3E7O2J3s","pdfSize":"1709466"}