{"id":"2412.09232","title":"Uplift modeling with continuous treatments: A predict-then-optimize\n  approach","authors":"Simon De Vos, Christopher Bockel-Rickermann, Stefan Lessmann, Wouter\n  Verbeke","authorsParsed":[["De Vos","Simon",""],["Bockel-Rickermann","Christopher",""],["Lessmann","Stefan",""],["Verbeke","Wouter",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 12:43:42 GMT"}],"updateDate":"2024-12-13","timestamp":1734007422000,"abstract":"  The goal of uplift modeling is to recommend actions that optimize specific\noutcomes by determining which entities should receive treatment. One common\napproach involves two steps: first, an inference step that estimates\nconditional average treatment effects (CATEs), and second, an optimization step\nthat ranks entities based on their CATE values and assigns treatment to the top\nk within a given budget. While uplift modeling typically focuses on binary\ntreatments, many real-world applications are characterized by continuous-valued\ntreatments, i.e., a treatment dose. This paper presents a predict-then-optimize\nframework to allow for continuous treatments in uplift modeling. First, in the\ninference step, conditional average dose responses (CADRs) are estimated from\ndata using causal machine learning techniques. Second, in the optimization\nstep, we frame the assignment task of continuous treatments as a\ndose-allocation problem and solve it using integer linear programming (ILP).\nThis approach allows decision-makers to efficiently and effectively allocate\ntreatment doses while balancing resource availability, with the possibility of\nadding extra constraints like fairness considerations or adapting the objective\nfunction to take into account instance-dependent costs and benefits to maximize\nutility. The experiments compare several CADR estimators and illustrate the\ntrade-offs between policy value and fairness, as well as the impact of an\nadapted objective function. This showcases the framework's advantages and\nflexibility across diverse applications in healthcare, lending, and human\nresource management. All code is available on github.com/SimonDeVos/UMCT.\n","subjects":["Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"di4U8GVaTNyUB790__N5W7UGSld-w_9T58v6uM0TtMw","pdfSize":"2037357"}