{"id":"2412.19865","title":"Interference Management Strategies in HAPS-Enabled vHetNets in Urban\n  Deployments","authors":"Afsoon Alidadi Shamsabadi, Animesh Yadav, Halim Yanikomeroglu","authorsParsed":[["Shamsabadi","Afsoon Alidadi",""],["Yadav","Animesh",""],["Yanikomeroglu","Halim",""]],"versions":[{"version":"v1","created":"Thu, 26 Dec 2024 20:20:38 GMT"}],"updateDate":"2024-12-31","timestamp":1735244438000,"abstract":"  Next-generation wireless networks are evolving towards architectures that\nintegrate terrestrial and non-terrestrial networks (NTN), unitedly known as\nvertical heterogeneous networks (vHetNets). This integration is vital to\naddress the increasing demand for coverage, capacity, and new services in urban\nenvironments. In vHetNets, various tiers can operate within the same frequency\nband, creating a harmonized spectrum-integrated network. Although this\nharmonization significantly enhances spectral efficiency, it also introduces\nchallenges, with interference being a primary concern. This paper investigates\nvHetNets comprising high altitude platform stations (HAPS) and terrestrial\nmacro base stations (MBSs) operating in a shared spectrum, where interference\nbecomes a critical issue. The unique constraints of HAPS-enabled vHetNets\nfurther complicate the interference management problem. To address these\nchallenges, we explore various strategies to manage interference in\nHAPS-enabled vHetNets. Accordingly, we discuss centralized and distributed\napproaches that leverage tools based on mathematical optimization and\nartificial intelligence (AI) to solve interference management problems.\nPreliminarily numerical evaluations reveal that distributed approaches not only\nachieve lower complexity but also deliver superior scalability compared to\ncentralized methods, primarily due to their reduced dependence on global\ninformation.\n","subjects":["Computer Science/Networking and Internet Architecture"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"HzFkgOsMLA1Jh0UrlI_oY4_2FG_bzKZ-zuSMpRmQFoI","pdfSize":"3208635"}