{"id":"2412.11377","title":"Improving Automatic Fetal Biometry Measurement with Swoosh Activation\n  Function","authors":"Shijia Zhou, Euijoon Ahn, Hao Wang, Ann Quinton, Narelle Kennedy,\n  Pradeeba Sridar, Ralph Nanan and Jinman Kim","authorsParsed":[["Zhou","Shijia",""],["Ahn","Euijoon",""],["Wang","Hao",""],["Quinton","Ann",""],["Kennedy","Narelle",""],["Sridar","Pradeeba",""],["Nanan","Ralph",""],["Kim","Jinman",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 02:05:15 GMT"}],"updateDate":"2024-12-18","timestamp":1734314715000,"abstract":"  The measurement of fetal thalamus diameter (FTD) and fetal head circumference\n(FHC) are crucial in identifying abnormal fetal thalamus development as it may\nlead to certain neuropsychiatric disorders in later life. However, manual\nmeasurements from 2D-US images are laborious, prone to high inter-observer\nvariability, and complicated by the high signal-to-noise ratio nature of the\nimages. Deep learning-based landmark detection approaches have shown promise in\nmeasuring biometrics from US images, but the current state-of-the-art (SOTA)\nalgorithm, BiometryNet, is inadequate for FTD and FHC measurement due to its\ninability to account for the fuzzy edges of these structures and the complex\nshape of the FTD structure. To address these inadequacies, we propose a novel\nSwoosh Activation Function (SAF) designed to enhance the regularization of\nheatmaps produced by landmark detection algorithms. Our SAF serves as a\nregularization term to enforce an optimum mean squared error (MSE) level\nbetween predicted heatmaps, reducing the dispersiveness of hotspots in\npredicted heatmaps. Our experimental results demonstrate that SAF significantly\nimproves the measurement performances of FTD and FHC with higher intraclass\ncorrelation coefficient scores in FTD and lower mean difference scores in FHC\nmeasurement than those of the current SOTA algorithm BiometryNet. Moreover, our\nproposed SAF is highly generalizable and architecture-agnostic. The SAF's\ncoefficients can be configured for different tasks, making it highly\ncustomizable. Our study demonstrates that the SAF activation function is a\nnovel method that can improve measurement accuracy in fetal biometry landmark\ndetection. This improvement has the potential to contribute to better fetal\nmonitoring and improved neonatal outcomes.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computer Science/Artificial Intelligence","Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"cnwEQr5BwUiFri19WXamIQrwG5AQsI2y0NKK-qjhhZE","pdfSize":"1967318"}