{
  "id": "2412.07078",
  "title": "Defensive Dual Masking for Robust Adversarial Defense",
  "authors": "Wangli Yang, Jie Yang, Yi Guo, Johan Barthelemy",
  "authorsParsed": [
    [
      "Yang",
      "Wangli",
      ""
    ],
    [
      "Yang",
      "Jie",
      ""
    ],
    [
      "Guo",
      "Yi",
      ""
    ],
    [
      "Barthelemy",
      "Johan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 00:41:25 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733791285000,
  "abstract": "  The field of textual adversarial defenses has gained considerable attention\nin recent years due to the increasing vulnerability of natural language\nprocessing (NLP) models to adversarial attacks, which exploit subtle\nperturbations in input text to deceive models. This paper introduces the\nDefensive Dual Masking (DDM) algorithm, a novel approach designed to enhance\nmodel robustness against such attacks. DDM utilizes a unique adversarial\ntraining strategy where [MASK] tokens are strategically inserted into training\nsamples to prepare the model to handle adversarial perturbations more\neffectively. During inference, potentially adversarial tokens are dynamically\nreplaced with [MASK] tokens to neutralize potential threats while preserving\nthe core semantics of the input. The theoretical foundation of our approach is\nexplored, demonstrating how the selective masking mechanism strengthens the\nmodel's ability to identify and mitigate adversarial manipulations. Our\nempirical evaluation across a diverse set of benchmark datasets and attack\nmechanisms consistently shows that DDM outperforms state-of-the-art defense\ntechniques, improving model accuracy and robustness. Moreover, when applied to\nLarge Language Models (LLMs), DDM also enhances their resilience to adversarial\nattacks, providing a scalable defense mechanism for large-scale NLP\napplications.\n",
  "subjects": [
    "Computer Science/Computation and Language",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Ht9kjuXD_Wgg_79mljf9bG0B5k2gR9uAFXsJRJwDD0k",
  "pdfSize": "760964"
}