{
  "id": "2412.15354",
  "title": "How phonon coherence develops and contributes to heat conduction in\n  periodic and aperiodic superlattices",
  "authors": "Theodore Maranets and Yan Wang",
  "authorsParsed": [
    [
      "Maranets",
      "Theodore",
      ""
    ],
    [
      "Wang",
      "Yan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 19:39:56 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734637196000,
  "abstract": "  This work investigates the impact of device length on thermal conductivity in\nperiodic and aperiodic superlattices (SLs). While it is well known that thermal\nconductivity in aperiodic SLs exhibits a weaker dependence on device length\ncompared to periodic SLs, existing literature attributes this behavior to the\nscattering of coherent phonons by aperiodically arranged interfaces. Through\natomistic wave-packet simulations, we show that coherent phonons in aperiodic\nSLs have spatial extensions limited to a certain number of SL layers, which\nprevents transmission if the extension is shorter than the device length.\nSpecifically, the disordered interface spacing in aperiodic SLs causes coherent\nphonons to behave as non-propagative vibrational modes, resulting in diffuse\nenergy transmission. In periodic SLs, however, coherent phonons can propagate\nacross the entire structure, enabling high transmission. The difference between\nballistic transport in periodic SLs and diffuse transport in aperiodic SLs is\ncaptured in the length-dependence of phonon transmission. These findings\nprovide new insights into phonon coherence and its implications for heat\nconduction in superlattices, with potential applications in the thermal design\nof nanostructures.\n",
  "subjects": [
    "Condensed Matter/Materials Science",
    "Condensed Matter/Mesoscale and Nanoscale Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "6ln4BQsc-sN2rNuYrjncyy9Pv4IHlc3I6snnQ_HCw9k",
  "pdfSize": "5964826"
}