{
  "id": "2412.01122",
  "title": "TAS-TsC: A Data-Driven Framework for Estimating Time of Arrival Using\n  Temporal-Attribute-Spatial Tri-space Coordination of Truck Trajectories",
  "authors": "Mengran Li, Junzhou Chen, Guanying Jiang, Fuliang Li, Ronghui Zhang,\n  Siyuan Gong, Zhihan Lv",
  "authorsParsed": [
    [
      "Li",
      "Mengran",
      ""
    ],
    [
      "Chen",
      "Junzhou",
      ""
    ],
    [
      "Jiang",
      "Guanying",
      ""
    ],
    [
      "Li",
      "Fuliang",
      ""
    ],
    [
      "Zhang",
      "Ronghui",
      ""
    ],
    [
      "Gong",
      "Siyuan",
      ""
    ],
    [
      "Lv",
      "Zhihan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 04:58:48 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733115528000,
  "abstract": "  Accurately estimating time of arrival (ETA) for trucks is crucial for\noptimizing transportation efficiency in logistics. GPS trajectory data offers\nvaluable information for ETA, but challenges arise due to temporal sparsity,\nvariable sequence lengths, and the interdependencies among multiple trucks. To\naddress these issues, we propose the Temporal-Attribute-Spatial Tri-space\nCoordination (TAS-TsC) framework, which leverages three feature\nspaces-temporal, attribute, and spatial-to enhance ETA. Our framework consists\nof a Temporal Learning Module (TLM) using state space models to capture\ntemporal dependencies, an Attribute Extraction Module (AEM) that transforms\nsequential features into structured attribute embeddings, and a Spatial Fusion\nModule (SFM) that models the interactions among multiple trajectories using\ngraph representation learning.These modules collaboratively learn trajectory\nembeddings, which are then used by a Downstream Prediction Module (DPM) to\nestimate arrival times. We validate TAS-TsC on real truck trajectory datasets\ncollected from Shenzhen, China, demonstrating its superior performance compared\nto existing methods.\n",
  "subjects": [
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "jaQ-OHXU1I9uJn-2t3TcOYNQjqfQSdrLM4nwQNtPwJc",
  "pdfSize": "5630149"
}