{"id":"2412.06799","title":"From Quantum Cognition to Conceptuality Interpretation I: Tracing the\n  Brussels Group's Intellectual Journey","authors":"Diederik Aerts, Massimiliano Sassoli de Bianchi and Sandro Sozzo","authorsParsed":[["Aerts","Diederik",""],["de Bianchi","Massimiliano Sassoli",""],["Sozzo","Sandro",""]],"versions":[{"version":"v1","created":"Sat, 23 Nov 2024 00:22:51 GMT"}],"updateDate":"2024-12-11","timestamp":1732321371000,"abstract":"  The conceptuality interpretation of quantum mechanics proposes that quantum\nentities have a conceptual nature, interacting with the material world through\nprocesses that are the physical counterpart of the meaning-based processes\nwhich typically occur in human cognition. This interpretation emerged from the\nearly developments in quantum cognition, a field that uses quantum mathematics\nto model human cognitive activity. It benefited from the specific approach\ntaken by the Brussels research group, modeling concepts themselves as quantum\nentities and minds as measuring apparatuses. The article sketches the essential\nsteps of the intellectual journey going from the first applications of quantum\nnotions and formalisms to human cognition to the proposal of a potentially\ngroundbreaking interpretation of quantum mechanics, offering profound\nexplanations for major quantum phenomena. This was done by drawing numerous\nparallels with the human conceptual domain and suggesting the existence of a\nlevel of cognitive activity that would underlie our physical reality. This\nmeans that an increased cross-fertilization between the conceptuality\ninterpretation and quantum cognition is to be expected in the future, both of\nwhich are synergistic in furthering our understanding of the nature of reality.\nThis is the first part of a two-part article. In the second part, which can be\nread independently of the first, the successes of the interpretation will be\ndescribed in a more systematic way, providing a brief overview of what has been\nachieved so far.\n","subjects":["Physics/History and Philosophy of Physics","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"PUd6LmR-yCZuWJopYn0GpXdPg3KCqn5mYQWyjgz4RIM","pdfSize":"220588"}