{
  "id": "2412.14480",
  "title": "GraphEQA: Using 3D Semantic Scene Graphs for Real-time Embodied Question\n  Answering",
  "authors": "Saumya Saxena, Blake Buchanan, Chris Paxton, Bingqing Chen, Narunas\n  Vaskevicius, Luigi Palmieri, Jonathan Francis, Oliver Kroemer",
  "authorsParsed": [
    [
      "Saxena",
      "Saumya",
      ""
    ],
    [
      "Buchanan",
      "Blake",
      ""
    ],
    [
      "Paxton",
      "Chris",
      ""
    ],
    [
      "Chen",
      "Bingqing",
      ""
    ],
    [
      "Vaskevicius",
      "Narunas",
      ""
    ],
    [
      "Palmieri",
      "Luigi",
      ""
    ],
    [
      "Francis",
      "Jonathan",
      ""
    ],
    [
      "Kroemer",
      "Oliver",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 03:04:34 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734577474000,
  "abstract": "  In Embodied Question Answering (EQA), agents must explore and develop a\nsemantic understanding of an unseen environment in order to answer a situated\nquestion with confidence. This remains a challenging problem in robotics, due\nto the difficulties in obtaining useful semantic representations, updating\nthese representations online, and leveraging prior world knowledge for\nefficient exploration and planning. Aiming to address these limitations, we\npropose GraphEQA, a novel approach that utilizes real-time 3D metric-semantic\nscene graphs (3DSGs) and task relevant images as multi-modal memory for\ngrounding Vision-Language Models (VLMs) to perform EQA tasks in unseen\nenvironments. We employ a hierarchical planning approach that exploits the\nhierarchical nature of 3DSGs for structured planning and semantic-guided\nexploration. Through experiments in simulation on the HM-EQA dataset and in the\nreal world in home and office environments, we demonstrate that our method\noutperforms key baselines by completing EQA tasks with higher success rates and\nfewer planning steps.\n",
  "subjects": [
    "Computer Science/Robotics",
    "Computer Science/Computation and Language",
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/publicdomain/zero/1.0/",
  "blobId": "4apfkDqW3CI0E-uqhGgJbWqphXLTwARN1FCMQxrlcKg",
  "pdfSize": "48698872"
}