{
  "id": "2412.21138",
  "title": "Optimal bound for survival time of the SIRS process on star graphs",
  "authors": "Phuc Lam, Oanh Nguyen, Iris Yang",
  "authorsParsed": [
    [
      "Lam",
      "Phuc",
      ""
    ],
    [
      "Nguyen",
      "Oanh",
      ""
    ],
    [
      "Yang",
      "Iris",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 30 Dec 2024 18:14:27 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735582467000,
  "abstract": "  We analyze the Susceptible-Infected-Recovered-Susceptible (SIRS) process, a\ncontinuous-time Markov chain frequently employed in epidemiology to model the\nspread of infections on networks. In this framework, infections spread as\ninfected vertices recover at rate 1, infect susceptible neighbors independently\nat rate $\\lambda$, and recovered vertices become susceptible again at rate\n$\\alpha$. This model presents a significantly greater analytical challenge\ncompared to the SIS model, which has consequently inspired a much more\nextensive and rich body of mathematical literature for the latter.\nUnderstanding the survival time, the duration before the infection dies out\ncompletely, is a fundamental question in this context. On general graphs,\nsurvival time heavily depends on the infection's persistence around high-degree\nvertices (known as hubs or stars), as long persistence enables transmission\nbetween hubs and prolongs the process. In contrast, short persistence leads to\nrapid extinction, making the dynamics on star graphs, which serve as key\nrepresentatives of hubs, particularly important to study.\n  In the 2016 paper by Ferreira, Sander, and Pastor-Satorras, published in {\\it\nPhysical Review E}, it was conjectured, based on intuitive arguments, that the\nsurvival time for SIRS on a star graph with $n$ leaves is bounded above by\n$(\\lambda^2 n)^\\alpha$ for large $n$. Later, in the seemingly first\nmathematically rigorous result for SIRS (\\cite{friedrich2022analysis}) provided\nan upper bound of $n^\\alpha \\log n$, with contains an additional $\\log n$ and\nno dependence on $\\lambda$.\n  We resolve this conjecture by proving that the survival time is indeed of\norder $(\\lambda^2 n)^\\alpha$, with matching upper and lower bounds.\nAdditionally, we show that this holds even in the case where only the root\nundergoes immunization, while the leaves revert to susceptibility immediately\nafter recovery.\n",
  "subjects": [
    "Mathematics/Probability"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "uhuWiDpgDfEH_RBzJaqv6fAdGXN-byNokfhsESMXRlc",
  "pdfSize": "534707"
}