{
  "id": "2412.10478",
  "title": "Re-examining the social impact of silver monetization in the Ming\n  Dynasty from the perspective of supply and demand",
  "authors": "Tianwei Chang",
  "authorsParsed": [
    [
      "Chang",
      "Tianwei",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 05:33:09 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734067989000,
  "abstract": "  Existing studies have shown that the monetization of silver in the Ming\nDynasty effectively promoted the prosperity of trade in the Ming Dynasty, while\nthe prices of labor, handicraft products and grain were long suppressed by the\ndeformed economic structure. With the expansion of silver application, the\nfluctuation of silver supply and demand exacerbated the above contradictions.\nCapital accumulation that should have been obtained through the marketization\nof labor was easily plundered by the landlord gentry class through silver. This\narticle re-discusses the issue from the perspective of supply and demand.\nCompared with the increase and then decrease of silver supply, the evolution of\nsilver demand is more complicated: at the tax level, the widespread use of\nsilver leads to a huge difference in the elasticity of production and trade\ntaxes. When government spending surges, the increase in tax burden will be\nmainly borne by agriculture and handicrafts. At the production level, the high\nliquidity of silver makes the concentration of social wealth more convenient,\nwhile the reduction in silver supply and the expansion of demand have rapidly\nexpanded deflation, further exacerbating the gap between the rich and the poor.\nSuch combined effect of supply and demand factors has caused the monetization\nof silver to become an accelerator of the economic collapse of the Ming\nDynasty.\n",
  "subjects": [
    "Economics/General Economics",
    "Quantitative Finance/Economics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "BIFsYL3dTXiu0CA_r1WLUVJUspFWdrRIOXFqYHCgCfo",
  "pdfSize": "695461"
}