{
  "id": "2412.02381",
  "title": "Social patch foraging theory in an egalitarian group",
  "authors": "Lisa Blum Moyse, Ahmed El Hady",
  "authorsParsed": [
    [
      "Moyse",
      "Lisa Blum",
      ""
    ],
    [
      "Hady",
      "Ahmed El",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 11:05:36 GMT"
    },
    {
      "version": "v2",
      "created": "Wed, 4 Dec 2024 11:40:23 GMT"
    }
  ],
  "updateDate": "2024-12-05",
  "timestamp": 1733223936000,
  "abstract": "  Foraging is a widespread behavior, and being part of a group may bring\nseveral benefits compared to solitary foraging, such as collective pooling of\ninformation and reducing environmental uncertainty. Often theoretical models of\ncollective behavior use coarse-grained representations, or are too complex for\nanalytical treatment, and generally do not take into account the noisy decision\nmaking process implemented by individual agents. This calls for the development\nof a mechanistic, analytically tractable, and stochastic framework to study the\nunderlying processes of social foraging, tying the microscopic to the\nmacroscopic levels. Based on an evidence accumulation framework, we developed a\nmodel of patch-leaving decisions in a large egalitarian group. Across a variety\nof environmental statistics and information sharing mechanisms, we were able to\nanalytically derive optimal agent strategies. The environmental statistics\nconsidered are either two non-depleting or several successive depleting\npatches. The social information sharing mechanisms are either through\nobservation of others' food rewards or through belief sharing, with continuous\nsharing, pulsatile observation of others' departures or arrivals, or through\ncounting the number of individuals in a patch. Throughout all these conditions,\nwe quantified how cohesive a group is over time, how much time agents spend on\naverage in a patch and what are their group equilibrium dynamics. We found that\nsocial coupling strongly modulates these features across a variety of\nenvironmental statistics. This general modeling framework is crucial to both\ndesigning social foraging experiments and generating hypotheses that can be\ntested. Moreover, this framework can be extended to groups exhibiting\nhierarchical relations.\n",
  "subjects": [
    "Physics/Biological Physics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "SS0aGoVZ8xVX6R-FsP8FD6EKo-XYj59FLx8hBQN_tXQ",
  "pdfSize": "2893294"
}