{
  "id": "2412.06939",
  "title": "Time-dependent density-functional study of hydrogen adsorption and\n  scattering on graphene surfaces",
  "authors": "Samuel S. Taylor, Nicholas Skoufis, Hongbo Du, Cody Covington, and\n  Kalman Varga",
  "authorsParsed": [
    [
      "Taylor",
      "Samuel S.",
      ""
    ],
    [
      "Skoufis",
      "Nicholas",
      ""
    ],
    [
      "Du",
      "Hongbo",
      ""
    ],
    [
      "Covington",
      "Cody",
      ""
    ],
    [
      "Varga",
      "Kalman",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 19:33:04 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733772784000,
  "abstract": "  Time-dependent density-functional theory simulations are performed to examine\nthe effects of varying incident points and kinetic energies of hydrogen atom\nprojectiles on a graphene-like structure. The simulations reveal that the\nincident point significantly influences the hydrogen atom's kinetic energy\npost-interaction, the vibrational dynamics of the graphene lattice, and the\nscattering angles. Incident points that do not directly collide with carbon\natoms result in prolonged interaction times and reduced energy transfer,\nincreasing the likelihood of overcoming the graphene's potential energy barrier\nand hydrogen atom adsorption. The study also explores the role of initial\nkinetic energy in determining adsorption, scattering, or transmission outcomes.\nThese results emphasize the critical influence of initial parameters on the\nhydrogenation process and provide a foundation for future experimental\nvalidation and further exploration of hydrogen-graphene interactions.\n",
  "subjects": [
    "Condensed Matter/Materials Science",
    "Condensed Matter/Mesoscale and Nanoscale Physics",
    "Physics/Chemical Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "dE1XWt97KWGQikWll-bHFMINvbzpJQCpl2--l_KOSi0",
  "pdfSize": "7369963"
}