{
  "id": "2412.00826",
  "title": "Compressed 'CMB-lite' Likelihoods Using Automatic Differentiation",
  "authors": "L. Balkenhol",
  "authorsParsed": [
    [
      "Balkenhol",
      "L.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 1 Dec 2024 14:27:41 GMT"
    },
    {
      "version": "v2",
      "created": "Mon, 17 Feb 2025 15:39:51 GMT"
    }
  ],
  "updateDate": "2025-02-19",
  "timestamp": 1733063261000,
  "abstract": "  The compression of multi-frequency cosmic microwave background (CMB) power\nspectrum measurements into a series of foreground-marginalised CMB-only band\npowers allows for the construction of faster and more easily interpretable\n'lite' likelihoods. However, obtaining the compressed data vector is\ncomputationally expensive and yields a covariance matrix with sampling noise.\nIn this work, we present an implementation of the CMB-lite framework relying on\nautomatic differentiation. The technique presented reduces the computational\ncost of the lite likelihood construction to one minimisation and one Hessian\nevaluation, which run on a personal computer in about a minute. We demonstrate\nthe efficiency and accuracy of this procedure by applying it to the\ndifferentiable SPT-3G 2018 TT/TE/EE likelihood from the candl library. We find\ngood agreement between the marginalised posteriors of cosmological parameters\nyielded by the resulting lite likelihood and the reference multi-frequency\nversion for all cosmological models tested; the best-fit values shift by\n$<0.1\\,\\sigma$, where $\\sigma$ is the width of the multi-frequency posterior,\nand the inferred parameter error bars match to within $<10\\%$. We publicly\nrelease the SPT-3G 2018 TT/TE/EE lite likelihood and a python notebook showing\nits construction at https://github.com/Lbalkenhol/candl .\n",
  "subjects": [
    "Astrophysics/Cosmology and Nongalactic Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "h-dL0aXYOQs8gplSkHfyCFdfkAqw9cCiLgjbZUfrgxA",
  "pdfSize": "1009522"
}