{
  "id": "2412.04443",
  "title": "Diagnosing Systematic Effects Using the Inferred Initial Power Spectrum",
  "authors": "Tristan Hoellinger, Florent Leclercq",
  "authorsParsed": [
    [
      "Hoellinger",
      "Tristan",
      ""
    ],
    [
      "Leclercq",
      "Florent",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 18:57:00 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733425020000,
  "abstract": "  The next generation of galaxy surveys has the potential to substantially\ndeepen our understanding of the Universe. This potential hinges on our ability\nto rigorously address systematic uncertainties. Until now, diagnosing\nsystematic effects prior to inferring cosmological parameters has been out of\nreach in field-based implicit likelihood cosmological inference frameworks. As\na solution, we aim to diagnose a variety of systematic effects in galaxy\nsurveys prior to inferring cosmological parameters, using the inferred initial\nmatter power spectrum. Our approach is built upon a two-step framework. First,\nwe employ the Simulator Expansion for Likelihood-Free Inference (SELFI)\nalgorithm to infer the initial matter power spectrum, which we utilise to\nthoroughly investigate the impact of systematic effects. This investigation\nrelies on a single set of N-body simulations. Second, we obtain a posterior on\ncosmological parameters via implicit likelihood inference, recycling the\nsimulations from the first step for data compression. For demonstration, we\nrely on a model of large-scale spectroscopic galaxy surveys that incorporates\nfully non-linear gravitational evolution and simulates multiple systematic\neffects encountered in real surveys. We provide a practical guide on how the\nSELFI posterior can be used to assess the impact of misspecified galaxy bias\nparameters, selection functions, survey masks, inaccurate redshifts, and\napproximate gravity models on the inferred initial matter power spectrum. We\nshow that a subtly misspecified model can lead to a bias exceeding $2\\sigma$ in\nthe $(\\Omega_\\mathrm{m},\\sigma_8)$ plane, which we are able to detect and avoid\nprior to inferring the cosmological parameters. This framework has the\npotential to significantly enhance the robustness of physical information\nextraction from full-forward models of large-scale galaxy surveys such as DESI,\nEuclid, and LSST.\n",
  "subjects": [
    "Astrophysics/Cosmology and Nongalactic Astrophysics",
    "Astrophysics/Instrumentation and Methods for Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "ckFFY1Mxux0qra0z_A-p73ceqjc4TLt9WtpPXzO_Bkk",
  "pdfSize": "12229708"
}