{"id":"2412.16944","title":"Linguistics-Vision Monotonic Consistent Network for Sign Language\n  Production","authors":"Xu Wang, Shengeng Tang, Peipei Song, Shuo Wang, Dan Guo, Richang Hong","authorsParsed":[["Wang","Xu",""],["Tang","Shengeng",""],["Song","Peipei",""],["Wang","Shuo",""],["Guo","Dan",""],["Hong","Richang",""]],"versions":[{"version":"v1","created":"Sun, 22 Dec 2024 09:28:06 GMT"}],"updateDate":"2024-12-24","timestamp":1734859686000,"abstract":"  Sign Language Production (SLP) aims to generate sign videos corresponding to\nspoken language sentences, where the conversion of sign Glosses to Poses (G2P)\nis the key step. Due to the cross-modal semantic gap and the lack of\nword-action correspondence labels for strong supervision alignment, the SLP\nsuffers huge challenges in linguistics-vision consistency. In this work, we\npropose a Transformer-based Linguistics-Vision Monotonic Consistent Network\n(LVMCN) for SLP, which constrains fine-grained cross-modal monotonic alignment\nand coarse-grained multimodal semantic consistency in language-visual cues\nthrough Cross-modal Semantic Aligner (CSA) and Multimodal Semantic Comparator\n(MSC). In the CSA, we constrain the implicit alignment between corresponding\ngloss and pose sequences by computing the cosine similarity association matrix\nbetween cross-modal feature sequences (i.e., the order consistency of\nfine-grained sign glosses and actions). As for MSC, we construct multimodal\ntriplets based on paired and unpaired samples in batch data. By pulling closer\nthe corresponding text-visual pairs and pushing apart the non-corresponding\ntext-visual pairs, we constrain the semantic co-occurrence degree between\ncorresponding gloss and pose sequences (i.e., the semantic consistency of\ncoarse-grained textual sentences and sign videos). Extensive experiments on the\npopular PHOENIX14T benchmark show that the LVMCN outperforms the\nstate-of-the-art.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Multimedia"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"NNswHfXbO2dJGZP2fz58qBeBqmfiuSqKXnjDQMqYbVA","pdfSize":"6285058"}