{
  "id": "2412.01227",
  "title": "Defect Positioning in Combinatorial Metamaterials",
  "authors": "Chaviva Sirote-Katz, Yotam M. Y. Feldman, Guy Cohen, Tam\\'as\n  K\\'alm\\'an, and Yair Shokef",
  "authorsParsed": [
    [
      "Sirote-Katz",
      "Chaviva",
      ""
    ],
    [
      "Feldman",
      "Yotam M. Y.",
      ""
    ],
    [
      "Cohen",
      "Guy",
      ""
    ],
    [
      "Kálmán",
      "Tamás",
      ""
    ],
    [
      "Shokef",
      "Yair",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 07:44:22 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733125462000,
  "abstract": "  Combinatorial mechanical metamaterials are made of anisotropic, flexible\nblocks, such that multiple metamaterials may be constructed using a single\nblock type, and the system's response depends on the frustration (or its\nabsence) due to the mutual orientations of the blocks within the lattice.\nSpecifically, any minimal loop of blocks that may not simultaneously deform in\ntheir softest mode defines a mechanical defect at the vertex (in two\ndimensions) or edge (in three dimensions) that the loop encircles. Defects\nstiffen the metamaterial, and allow to design the spatial patterns of stress\nand deformation as the system is externally loaded. We study the ability to\nplace defects at arbitrary positions in metamaterials made of a family of block\ntypes that we recently introduced for the square, honeycomb, and cubic\nlattices. Alongside blocks for which we show that any defect configuration is\npossible, we identify situations in which not all sets are realizable as\ndefects. One of the restrictions is that in three dimensions, defected edges\nform closed curves. Even in cases when not all geometries of defect lines are\npossible, we show how to produce defect lines of arbitrary knottedness.\n",
  "subjects": [
    "Condensed Matter/Soft Condensed Matter",
    "Condensed Matter/Statistical Mechanics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "uZ8ev53j6GUpRsunQv_VXbBUbzWBpX0tcRE46tV9oaA",
  "pdfSize": "1149407"
}