{
  "id": "2412.06048",
  "title": "Reduction in Thermal Conductivity of Monolayer MoS2 by Large Mechanical\n  Strains for Efficient Thermal Management",
  "authors": "Jun Liu, Mengqi Fang, Eui-Hyeok Yang, Xian Zhang",
  "authorsParsed": [
    [
      "Liu",
      "Jun",
      ""
    ],
    [
      "Fang",
      "Mengqi",
      ""
    ],
    [
      "Yang",
      "Eui-Hyeok",
      ""
    ],
    [
      "Zhang",
      "Xian",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 8 Dec 2024 19:57:31 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733687851000,
  "abstract": "  Two dimensional (2D) materials such as graphene and transition metal\ndichalcogenides (TMDC) have received extensive research interests and\ninvestigations in the past decade. In this research, we report the first\nexperimental measurement of the in plane thermal conductivity of MoS2 monolayer\nunder a large mechanical strain using optothermal Raman technique. This\nmeasurement technique is direct without additional processing to the material,\nand MoS2's absorption coefficient is discovered during the measurement process\nto further increase this technique's precision. Tunable uniaxial tensile\nstrains are applied on the MoS2 monolayer by stretching a flexible substrate it\nsits on. Experimental results demonstrate that, the thermal conductivity is\nsubstantially suppressed by tensile strains: under the tensile strain of 6.3%,\nthe thermal conductivity of the MoS2 monolayer drops approximately by 62%. A\nserious of thermal transport properties at a group of mechanical strains are\nalso reported, presenting a strain dependent trend. It is the first and\noriginal study of 2D materials' thermal transport properties under a large\nmechanical strain, and provides important information that the thermal\ntransport of MoS2 will significantly decrease at a large mechanical strain.\nThis finding provides the key information for flexible and wearable electronics\nthermal management and designs.\n",
  "subjects": [
    "Condensed Matter/Materials Science",
    "Condensed Matter/Mesoscale and Nanoscale Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "0es7qdK_kwBFCxXWD9sZOUPIdiRHNnhsY_-7zY2fV8A",
  "pdfSize": "559528"
}