{
  "id": "2412.03526",
  "title": "Feed-Forward Bullet-Time Reconstruction of Dynamic Scenes from Monocular\n  Videos",
  "authors": "Hanxue Liang, Jiawei Ren, Ashkan Mirzaei, Antonio Torralba, Ziwei Liu,\n  Igor Gilitschenski, Sanja Fidler, Cengiz Oztireli, Huan Ling, Zan Gojcic,\n  Jiahui Huang",
  "authorsParsed": [
    [
      "Liang",
      "Hanxue",
      ""
    ],
    [
      "Ren",
      "Jiawei",
      ""
    ],
    [
      "Mirzaei",
      "Ashkan",
      ""
    ],
    [
      "Torralba",
      "Antonio",
      ""
    ],
    [
      "Liu",
      "Ziwei",
      ""
    ],
    [
      "Gilitschenski",
      "Igor",
      ""
    ],
    [
      "Fidler",
      "Sanja",
      ""
    ],
    [
      "Oztireli",
      "Cengiz",
      ""
    ],
    [
      "Ling",
      "Huan",
      ""
    ],
    [
      "Gojcic",
      "Zan",
      ""
    ],
    [
      "Huang",
      "Jiahui",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 18:15:06 GMT"
    }
  ],
  "updateDate": "2024-12-05",
  "timestamp": 1733336106000,
  "abstract": "  Recent advancements in static feed-forward scene reconstruction have\ndemonstrated significant progress in high-quality novel view synthesis.\nHowever, these models often struggle with generalizability across diverse\nenvironments and fail to effectively handle dynamic content. We present BTimer\n(short for BulletTimer), the first motion-aware feed-forward model for\nreal-time reconstruction and novel view synthesis of dynamic scenes. Our\napproach reconstructs the full scene in a 3D Gaussian Splatting representation\nat a given target ('bullet') timestamp by aggregating information from all the\ncontext frames. Such a formulation allows BTimer to gain scalability and\ngeneralization by leveraging both static and dynamic scene datasets. Given a\ncasual monocular dynamic video, BTimer reconstructs a bullet-time scene within\n150ms while reaching state-of-the-art performance on both static and dynamic\nscene datasets, even compared with optimization-based approaches.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Graphics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "72ZpP3A6BNnLyRn8rhXYVYKy1bs5Gjlohv5DAIlFThY",
  "pdfSize": "18488189"
}