{"id":"2412.07187","title":"A New Federated Learning Framework Against Gradient Inversion Attacks","authors":"Pengxin Guo, Shuang Zeng, Wenhao Chen, Xiaodan Zhang, Weihong Ren,\n  Yuyin Zhou, Liangqiong Qu","authorsParsed":[["Guo","Pengxin",""],["Zeng","Shuang",""],["Chen","Wenhao",""],["Zhang","Xiaodan",""],["Ren","Weihong",""],["Zhou","Yuyin",""],["Qu","Liangqiong",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 04:53:42 GMT"}],"updateDate":"2024-12-11","timestamp":1733806422000,"abstract":"  Federated Learning (FL) aims to protect data privacy by enabling clients to\ncollectively train machine learning models without sharing their raw data.\nHowever, recent studies demonstrate that information exchanged during FL is\nsubject to Gradient Inversion Attacks (GIA) and, consequently, a variety of\nprivacy-preserving methods have been integrated into FL to thwart such attacks,\nsuch as Secure Multi-party Computing (SMC), Homomorphic Encryption (HE), and\nDifferential Privacy (DP). Despite their ability to protect data privacy, these\napproaches inherently involve substantial privacy-utility trade-offs. By\nrevisiting the key to privacy exposure in FL under GIA, which lies in the\nfrequent sharing of model gradients that contain private data, we take a new\nperspective by designing a novel privacy preserve FL framework that effectively\n``breaks the direct connection'' between the shared parameters and the local\nprivate data to defend against GIA. Specifically, we propose a Hypernetwork\nFederated Learning (HyperFL) framework that utilizes hypernetworks to generate\nthe parameters of the local model and only the hypernetwork parameters are\nuploaded to the server for aggregation. Theoretical analyses demonstrate the\nconvergence rate of the proposed HyperFL, while extensive experimental results\nshow the privacy-preserving capability and comparable performance of HyperFL.\nCode is available at https://github.com/Pengxin-Guo/HyperFL.\n","subjects":["Computer Science/Machine Learning","Computer Science/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"WOkY7kkxN6uv-WVrrR0wja9zim6_YtBe-qVRiSU7Thk","pdfSize":"2446043"}