{
  "id": "2412.08005",
  "title": "Survey on Human-Vehicle Interactions and AI Collaboration for Optimal\n  Decision-Making in Automated Driving",
  "authors": "Abu Jafar Md Muzahid, Xiaopeng Zhao, and Zhenbo Wang",
  "authorsParsed": [
    [
      "Muzahid",
      "Abu Jafar Md",
      ""
    ],
    [
      "Zhao",
      "Xiaopeng",
      ""
    ],
    [
      "Wang",
      "Zhenbo",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 01:19:43 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733879983000,
  "abstract": "  The capabilities of automated vehicles are advancing rapidly, yet achieving\nfull autonomy remains a significant challenge, requiring ongoing human\ncognition in decision-making processes. Incorporating human cognition into\ncontrol algorithms has become increasingly important, as researchers work to\ndevelop strategies that minimize conflicts between human drivers and AI\nsystems. Despite notable progress, many challenges persist, underscoring the\nneed for further innovation and refinement in this field. This review covers\nrecent progress in human-vehicle interaction (HVI) and AI collaboration for\nvehicle control. First, we start by looking at how HVI has evolved, pointing\nout key developments and identifying persistent problems. Second, we discuss\nthe existing techniques, including methods for integrating human intuition and\ncognition into decision-making processes and developing systems that can mimic\nhuman behavior to enable optimal driving strategies and achieve safer and more\nefficient transportation. This review aims to contribute to the development of\nmore effective and adaptive automated driving systems by enhancing human-AI\ncollaboration.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Systems and Control",
    "Computer Science/Systems and Control"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "jzMhH32Vsin7LxqYL6TTjMy5awWmEtQlNJHNfrSjxxM",
  "pdfSize": "1743386"
}