{"id":"2412.09379","title":"Hybrid variable spiking graph neural networks for energy-efficient\n  scientific machine learning","authors":"Isha Jain and Shailesh Garg and Shaurya Shriyam and Souvik Chakraborty","authorsParsed":[["Jain","Isha",""],["Garg","Shailesh",""],["Shriyam","Shaurya",""],["Chakraborty","Souvik",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 15:47:17 GMT"}],"updateDate":"2024-12-13","timestamp":1734018437000,"abstract":"  Graph-based representations for samples of computational mechanics-related\ndatasets can prove instrumental when dealing with problems like irregular\ndomains or molecular structures of materials, etc. To effectively analyze and\nprocess such datasets, deep learning offers Graph Neural Networks (GNNs) that\nutilize techniques like message-passing within their architecture. The issue,\nhowever, is that as the individual graph scales and/ or GNN architecture\nbecomes increasingly complex, the increased energy budget of the overall deep\nlearning model makes it unsustainable and restricts its applications in\napplications like edge computing. To overcome this, we propose in this paper\nHybrid Variable Spiking Graph Neural Networks (HVS-GNNs) that utilize Variable\nSpiking Neurons (VSNs) within their architecture to promote sparse\ncommunication and hence reduce the overall energy budget. VSNs, while promoting\nsparse event-driven computations, also perform well for regression tasks, which\nare often encountered in computational mechanics applications and are the main\ntarget of this paper. Three examples dealing with prediction of mechanical\nproperties of material based on microscale/ mesoscale structures are shown to\ntest the performance of the proposed HVS-GNNs in regression tasks. We have also\ncompared the performance of HVS-GNN architectures with the performance of\nvanilla GNNs and GNNs utilizing leaky integrate and fire neurons. The results\nproduced show that HVS-GNNs perform well for regression tasks, all while\npromoting sparse communication and, hence, energy efficiency.\n","subjects":["Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"giUNLsLRSCh0pkftEj-HQuQOI32mC2R4ooXXN84Wb4U","pdfSize":"3246636"}