{
  "id": "2412.02258",
  "title": "Lessons learned from establishing a rooftop photovoltaic system\n  crowdsourced by students and employees at Aarhus University",
  "authors": "Marta Victoria, Zhe Zhang, Gorm B. Andresen, Parisa Rahdan, Ebbe K.\n  G{\\o}tske",
  "authorsParsed": [
    [
      "Victoria",
      "Marta",
      ""
    ],
    [
      "Zhang",
      "Zhe",
      ""
    ],
    [
      "Andresen",
      "Gorm B.",
      ""
    ],
    [
      "Rahdan",
      "Parisa",
      ""
    ],
    [
      "Gøtske",
      "Ebbe K.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 08:33:42 GMT"
    }
  ],
  "updateDate": "2024-12-04",
  "timestamp": 1733214822000,
  "abstract": "  Energy communities are promoted in the European legislation as a strategy to\nenable citizen participation in the energy transition. Solar photovoltaic (PV)\nsystems, due to their distributed nature, present an opportunity to create such\ncommunities. At Aarhus University (Denmark), we have established an energy\ncommunity consisting of a 98-kW rooftop solar PV installation, crowdsourced by\nstudents and employees of the university. The participants can buy one or\nseveral shares of the installation (which is divided into 900 shares), the\nelectricity is consumed by the university, and the shareowners receive some\neconomic compensation every year. The road to establishing this energy\ncommunity has been rough, and we have gathered many learnings. In this\nmanuscript, we present the 10 largest challenges which might arise when setting\nup a university energy community and our particular approach to facing them.\nSharing these learnings might pave the way for those willing to establish their\nown energy community. We also include policy recommendations at a European,\nnational, and municipality levels to facilitate the deployment of energy\ncommunities\n",
  "subjects": [
    "Physics/Physics and Society"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "vrkPF30mw-bxVxhrLXOh5ZYvIvgu2cY89SSjjK1zMzw",
  "pdfSize": "1633737"
}