{
  "id": "2412.04683",
  "title": "From Principles to Practice: A Deep Dive into AI Ethics and Regulations",
  "authors": "Nan Sun, Yuantian Miao, Hao Jiang, Ming Ding, Jun Zhang",
  "authorsParsed": [
    [
      "Sun",
      "Nan",
      ""
    ],
    [
      "Miao",
      "Yuantian",
      ""
    ],
    [
      "Jiang",
      "Hao",
      ""
    ],
    [
      "Ding",
      "Ming",
      ""
    ],
    [
      "Zhang",
      "Jun",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 00:46:20 GMT"
    },
    {
      "version": "v2",
      "created": "Thu, 6 Feb 2025 05:44:29 GMT"
    }
  ],
  "updateDate": "2025-02-07",
  "timestamp": 1733445980000,
  "abstract": "  In the rapidly evolving domain of Artificial Intelligence (AI), the complex\ninteraction between innovation and regulation has become an emerging focus of\nour society. Despite tremendous advancements in AI's capabilities to excel in\nspecific tasks and contribute to diverse sectors, establishing a high degree of\ntrust in AI-generated outputs and decisions necessitates meticulous caution and\ncontinuous oversight. A broad spectrum of stakeholders, including governmental\nbodies, private sector corporations, academic institutions, and individuals,\nhave launched significant initiatives. These efforts include developing ethical\nguidelines for AI and engaging in vibrant discussions on AI ethics, both among\nAI practitioners and within the broader society. This article thoroughly\nanalyzes the ground-breaking AI regulatory framework proposed by the European\nUnion. It delves into the fundamental ethical principles of safety,\ntransparency, non-discrimination, traceability, and environmental\nsustainability for AI developments and deployments. Considering the technical\nefforts and strategies undertaken by academics and industry to uphold these\nprinciples, we explore the synergies and conflicts among the five ethical\nprinciples. Through this lens, work presents a forward-looking perspective on\nthe future of AI regulations, advocating for a harmonized approach that\nsafeguards societal values while encouraging technological advancement.\n",
  "subjects": [
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "o5WPk-eTMqMNvaiCZC587ToqlpK33mWiTis5egddpo8",
  "pdfSize": "3670647"
}