{
  "id": "2412.07834",
  "title": "Evidence that pre-processing in filaments drives the anisotropic\n  quenching of satellite galaxies in massive clusters",
  "authors": "Harry Stephenson (Lancaster), John Stott, Joseph Butler, Molly Webster\n  and Jonathan Head",
  "authorsParsed": [
    [
      "Stephenson",
      "Harry",
      "",
      "Lancaster"
    ],
    [
      "Stott",
      "John",
      ""
    ],
    [
      "Butler",
      "Joseph",
      ""
    ],
    [
      "Webster",
      "Molly",
      ""
    ],
    [
      "Head",
      "Jonathan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 19:00:01 GMT"
    },
    {
      "version": "v2",
      "created": "Fri, 17 Jan 2025 15:58:09 GMT"
    }
  ],
  "updateDate": "2025-01-20",
  "timestamp": 1733857201000,
  "abstract": "  We use a sample of 11 $z\\approx0.2-0.5$ ($z_{\\text{med.}} = 0.36$) galaxy\nclusters from the Cluster Lensing And Supernovae survey with Hubble (CLASH) to\nanalyse the angular dependence of satellite galaxy colour $(B-R)$ and passive\ngalaxy fraction ($f_{\\text{pass.}}$) with respect to the major axis of the\nbrightest cluster galaxy (BCG). This phenomenon has been dubbed as\n\\say{anisotropic quenching}, \\say{angular conformity} or \\say{angular\nsegregation}, and it describes how satellite galaxies along the major axis of\nthe BCG are more likely to be quenched than those along the minor axis. A\nhighly significant anisotropic quenching signal is found for satellites, with a\npeak in $(B-R)$ and $f_{\\text{pass.}}$ along the major axis. We are the first\nto measure anisotropic quenching out to cluster-centric radii of $3R_{200}$\n($R_{200\\text{, med.}} \\approx 933$ \\si{\\kilo\\parsec}). We find that the signal\nis significant out to at least $2.5R_{200}$, and the amplitude of the signal\npeaks at $\\approx1.25R_{200}$. This is the first time a radial peak of the\nanisotropic quenching signal has been measured directly. We suggest that this\npeak could be caused by a build-up of backsplash galaxies at this radius.\nFinally, we find that $f_{\\text{pass.}}$ is significantly higher along the\nmajor axis for fixed values of local surface density. The density drops less\nrapidly along the major axis and so satellites spend more time being\npre-processed here compared to the minor axis. We therefore conclude that\npre-processing in large-scale structure, and not active galactic nuclei\noutflows (AGN), is the cause of the anisotropic quenching signal in massive\ngalaxy clusters, however this may not be the cause in lower mass halos.\n",
  "subjects": [
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "x4mEyt_5J-9eyTZrTGK61BILN-IIVHA0zOLcK-NKhoA",
  "pdfSize": "8175320"
}