{"id":"2412.12404","title":"High precision spectro-temporal analysis of ultra-fast radio bursts\n  using per-channel arrival times","authors":"Mohammed A. Chamma, Victor Pop and Fereshteh Rajabi","authorsParsed":[["Chamma","Mohammed A.",""],["Pop","Victor",""],["Rajabi","Fereshteh",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 23:15:52 GMT"}],"updateDate":"2024-12-18","timestamp":1734390952000,"abstract":"  Fast radio bursts (FRBs), especially those from repeating sources, exhibit a\nrich variety of morphologies in their dynamic spectra (or waterfalls).\nCharacterizing these morphologies and spectro-temporal properties is a key\nstrategy in investigating the underlying unknown emission mechanism of FRBs.\nThis type of analysis has been typically accomplished using two-dimensional\nGaussian techniques and the autocorrelation function (ACF) of the waterfall.\nThese techniques suffer from high uncertainties when applied to recently\nobserved ultra-FRBs: FRBs that are only a few microseconds long. We present a\ntechnique that involves the tagging of per-channel arrival times of an FRB to\nperform sub-burst slope measurements. This technique leverages the number of\nfrequency channels and can increase the precision of sub-burst slope\nmeasurements by several orders of magnitude, allowing it to be easily applied\nto ultra-FRBs and microshot forests. While scattering and dispersion remain\nimportant and often dominating sources of uncertainty in measurements, this\ntechnique provides an adaptable and firm foundation for obtaining\nspectro-temporal properties from all kinds of FRB morphologies. We present\nmeasurements using this technique of several hundred bursts across 12 repeating\nsources, including over 400 bursts from the repeating sources FRB 20121102A,\nFRB 20220912A, and FRB 20200120E, all of which exhibit microsecond-long FRBs,\nas well as 136 drift rates. In addition to retrieving the known relationship\nbetween sub-burst slope and duration, we explore other correlations between\nburst properties. We find that ultra-FRBs obey the sub-burst slope law along\nwith longer duration bursts, and appear to form a distinct population in the\nduration-frequency relation.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"4Ky38XelX8xYQ78zQX1k0Uptsus5tC5vQFGtcIL4OYI","pdfSize":"2893543"}