{
  "id": "2412.08300",
  "title": "Augmenting Sequential Recommendation with Balanced Relevance and\n  Diversity",
  "authors": "Yizhou Dang, Jiahui Zhang, Yuting Liu, Enneng Yang, Yuliang Liang,\n  Guibing Guo, Jianzhe Zhao, Xingwei Wang",
  "authorsParsed": [
    [
      "Dang",
      "Yizhou",
      ""
    ],
    [
      "Zhang",
      "Jiahui",
      ""
    ],
    [
      "Liu",
      "Yuting",
      ""
    ],
    [
      "Yang",
      "Enneng",
      ""
    ],
    [
      "Liang",
      "Yuliang",
      ""
    ],
    [
      "Guo",
      "Guibing",
      ""
    ],
    [
      "Zhao",
      "Jianzhe",
      ""
    ],
    [
      "Wang",
      "Xingwei",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 11:29:15 GMT"
    },
    {
      "version": "v2",
      "created": "Wed, 18 Dec 2024 03:21:48 GMT"
    },
    {
      "version": "v3",
      "created": "Sat, 21 Dec 2024 09:17:08 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1733916555000,
  "abstract": "  By generating new yet effective data, data augmentation has become a\npromising method to mitigate the data sparsity problem in sequential\nrecommendation. Existing works focus on augmenting the original data but rarely\nexplore the issue of imbalanced relevance and diversity for augmented data,\nleading to semantic drift problems or limited performance improvements. In this\npaper, we propose a novel Balanced data Augmentation Plugin for Sequential\nRecommendation (BASRec) to generate data that balance relevance and diversity.\nBASRec consists of two modules: Single-sequence Augmentation and Cross-sequence\nAugmentation. The former leverages the randomness of the heuristic operators to\ngenerate diverse sequences for a single user, after which the diverse and the\noriginal sequences are fused at the representation level to obtain relevance.\nFurther, we devise a reweighting strategy to enable the model to learn the\npreferences based on the two properties adaptively. The Cross-sequence\nAugmentation performs nonlinear mixing between different sequence\nrepresentations from two directions. It produces virtual sequence\nrepresentations that are diverse enough but retain the vital semantics of the\noriginal sequences. These two modules enhance the model to discover\nfine-grained preferences knowledge from single-user and cross-user\nperspectives. Extensive experiments verify the effectiveness of BASRec. The\naverage improvement is up to 72.0% on GRU4Rec, 33.8% on SASRec, and 68.5% on\nFMLP-Rec. We demonstrate that BASRec generates data with a better balance\nbetween relevance and diversity than existing methods. The source code is\navailable at https://github.com/KingGugu/BASRec.\n",
  "subjects": [
    "Computer Science/Information Retrieval"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "R91olHXDSZkxFRmOjreUwxMtKtZENzfbv5TnWNUX8e4",
  "pdfSize": "1837770"
}