{"id":"2412.13565","title":"CA-Edit: Causality-Aware Condition Adapter for High-Fidelity Local\n  Facial Attribute Editing","authors":"Xiaole Xian, Xilin He, Zenghao Niu, Junliang Zhang, Weicheng Xie,\n  Siyang Song, Zitong Yu, Linlin Shen","authorsParsed":[["Xian","Xiaole",""],["He","Xilin",""],["Niu","Zenghao",""],["Zhang","Junliang",""],["Xie","Weicheng",""],["Song","Siyang",""],["Yu","Zitong",""],["Shen","Linlin",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 07:33:22 GMT"}],"updateDate":"2024-12-19","timestamp":1734507202000,"abstract":"  For efficient and high-fidelity local facial attribute editing, most existing\nediting methods either require additional fine-tuning for different editing\neffects or tend to affect beyond the editing regions. Alternatively, inpainting\nmethods can edit the target image region while preserving external areas.\nHowever, current inpainting methods still suffer from the generation\nmisalignment with facial attributes description and the loss of facial skin\ndetails. To address these challenges, (i) a novel data utilization strategy is\nintroduced to construct datasets consisting of attribute-text-image triples\nfrom a data-driven perspective, (ii) a Causality-Aware Condition Adapter is\nproposed to enhance the contextual causality modeling of specific details,\nwhich encodes the skin details from the original image while preventing\nconflicts between these cues and textual conditions. In addition, a Skin\nTransition Frequency Guidance technique is introduced for the local modeling of\ncontextual causality via sampling guidance driven by low-frequency alignment.\nExtensive quantitative and qualitative experiments demonstrate the\neffectiveness of our method in boosting both fidelity and editability for\nlocalized attribute editing. The code is available at\nhttps://github.com/connorxian/CA-Edit.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"xcCrt_RV0VNzkABQUp51MIe5Zkb5TZzpG_WTt8wzV0U","pdfSize":"10772467"}