{"id":"2412.19056","title":"Disorder-induced delocalization in flat-band systems with quantum\n  geometry","authors":"Chun Wang Chau, Tian Xiang, Shuai A. Chen, K. T. Law","authorsParsed":[["Chau","Chun Wang",""],["Xiang","Tian",""],["Chen","Shuai A.",""],["Law","K. T.",""]],"versions":[{"version":"v1","created":"Thu, 26 Dec 2024 04:50:20 GMT"}],"updateDate":"2024-12-30","timestamp":1735188620000,"abstract":"  We investigate the transport properties of flat-band systems by analyzing a\none-dimensional metal/flat-band/metal junction constructed on a Lieb lattice\nwith an infinite band gap. Our study reveals that disorders can induce\ndelocalization and enable the control of transmission through quantum geometry.\nIn the weak disorder regime, transmission is primarily mediated by\ninterface-bound states, whose localization length is determined by the quantum\ngeometry of the system. As disorder strength increases, a zero-energy\ntransmission channel - absent in the clean system - emerges, reaches a maximum,\nand then diminishes inversely with disorder strength in the strong disorder\nlimit. In the strong disorder regime, the transmission increases with the\nlocalization length and eventually saturates when the localization length\nbecomes comparable to the link size. Using the Born approximation, we attribute\nthis bulk transmission to a finite velocity induced by disorder scattering.\nFurthermore, by analyzing the Bethe-Salpeter equation for diffusion, we propose\nthat the quantum metric provides a characteristic length scale for diffusion in\nthese systems. Our findings uncover a disorder-driven delocalization mechanism\nin flat-band systems that is fundamentally governed by quantum geometry. This\nwork provides new insights into localization phenomena and highlights potential\napplications in designing quantum devices.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"hYSxOyYdRTrpahzjC_uW9L-GnX38VMCSunshsvm0j90","pdfSize":"940719"}