{
  "id": "2412.16858",
  "title": "Cosmic ray spectra and anisotropy under anisotropic propagation model\n  with spiral galactic sources",
  "authors": "Aifeng Li, Zhaodong Lv, Wei Liu, Yiqing Guo and Fangheng Zhang",
  "authorsParsed": [
    [
      "Li",
      "Aifeng",
      ""
    ],
    [
      "Lv",
      "Zhaodong",
      ""
    ],
    [
      "Liu",
      "Wei",
      ""
    ],
    [
      "Guo",
      "Yiqing",
      ""
    ],
    [
      "Zhang",
      "Fangheng",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 22 Dec 2024 04:55:09 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734843309000,
  "abstract": "  In our previous work, we have investigated Galactic cosmic ray (GCR) spectra\nand anisotropy from 100 GeV to PeV, under anisotropic propagation model with\naxisymmetric distributed galactic sources. Numerous observational evidence have\nindicated that the Milky Way is a typical spiral galaxy. In this work, we\nfurther utilize anisotropic propagation models with spiral galactic sources to\ninvestigate spectra and anisotropy of CRs. During the calculation process, we\nemploy the spatially dependent diffusion (SDP) model with different diffusion\ncoefficients for the inner and outer halo, while the background CR sources is\nspiral distribution. To better explain the anomalous observations of nuclear\nspectral hardening at $ {\\cal R}\\sim$ 200 GV and the complicated energy\ndependence of anisotropy from GeV to PeV, we introduce the contribution of the\nGeminga nearby source. Additionally, we incorporate the impact of the local\nregular magnetic field (LRMF) and the corresponding anisotropic diffusion on\nlarge-scale anisotropy within the SDP model. By comparing the spiral and\naxisymmetric distribution models of background sources, it is found that both\nof them can well reproduce the CR spectra and anisotropy from 100 GeV-PeV.\nHowever, their propagation parameters are different. The diffusion coefficient\nwith spiral distribution of CR sources is larger than that with axisymmetric\ndistribution, and its spectral indices are also harder. Future high-precision\nmeasurements of CR anisotropy, such as LHAASO experiment, will be crucial in\nevaluating the validity of our proposed model.\n",
  "subjects": [
    "Astrophysics/High Energy Astrophysical Phenomena"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "ZTS9dG7IBh0mJqu7EJlZ3UsnwZArtJshqLCaKsVDK1Y",
  "pdfSize": "5482017"
}