{
  "id": "2412.08568",
  "title": "Real-Time Trajectory Generation for Soft Robot Manipulators Using\n  Differential Flatness",
  "authors": "Akua Dickson, Juan C. Pacheco Garcia, Ran Jing, Meredith L. Anderson,\n  Andrew P. Sabelhaus",
  "authorsParsed": [
    [
      "Dickson",
      "Akua",
      ""
    ],
    [
      "Garcia",
      "Juan C. Pacheco",
      ""
    ],
    [
      "Jing",
      "Ran",
      ""
    ],
    [
      "Anderson",
      "Meredith L.",
      ""
    ],
    [
      "Sabelhaus",
      "Andrew P.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 17:33:51 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733938431000,
  "abstract": "  Soft robots have the potential to interact with sensitive environments and\nperform complex tasks effectively. However, motion plans and trajectories for\nsoft manipulators are challenging to calculate due to their deformable nature\nand nonlinear dynamics. This article introduces a fast real-time trajectory\ngeneration approach for soft robot manipulators, which creates\ndynamically-feasible motions for arbitrary kinematically-feasible paths of the\nrobot's end effector. Our insight is that piecewise constant curvature (PCC)\ndynamics models of soft robots can be differentially flat, therefore control\ninputs can be calculated algebraically rather than through a nonlinear\ndifferential equation. We prove this flatness under certain conditions, with\nthe curvatures of the robot as the flat outputs. Our two-step trajectory\ngeneration approach uses an inverse kinematics procedure to calculate a motion\nplan of robot curvatures per end-effector position, then, our flatness\ndiffeomorphism generates corresponding control inputs that respect velocity. We\nvalidate our approach through simulations of our representative soft robot\nmanipulator along three different trajectories, demonstrating a margin of 23x\nfaster than real-time at a frequency of 100 Hz. This approach could allow fast\nverifiable replanning of soft robots' motions in safety-critical physical\nenvironments, crucial for deployment in the real world.\n",
  "subjects": [
    "Computer Science/Robotics",
    "Computer Science/Systems and Control",
    "Electrical Engineering and Systems Science/Systems and Control"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "SgZn1J9RxjrZg5dFSuB6siMqocU4NFJHWkmK3EsWQCU",
  "pdfSize": "1664250"
}