{
  "id": "2412.17309",
  "title": "Quantum Approximate Optimisation Applied to Graph Similarity",
  "authors": "Nicholas J. Pritchard",
  "authorsParsed": [
    [
      "Pritchard",
      "Nicholas J.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 23 Dec 2024 06:04:08 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734933848000,
  "abstract": "  Quantum computing promises solutions to classically difficult and new-found\nproblems through controlling the subtleties of quantum computing. The Quantum\nApproximate Optimisation Algorithm (QAOA) is a recently proposed quantum\nalgorithm designed to tackle difficult combinatorial optimisation problems\nutilising both quantum and classical computation. The hybrid nature, generality\nand typically low gate-depth make it a strong candidate for near-term\nimplementation in quantum computing. Finding the practical limits of the\nalgorithm is currently an open problem. Until now, no tools to facilitate the\ndesign and validation of probabilistic quantum optimisation algorithms such as\nthe QAOA on a non-trivial scale exist. Graph similarity is a long standing\nclassically difficult problem withstanding decades of research from academia\nand industry. Determining the maximal edge overlap between all possible node\nlabel permutations is an NP-Complete task and provides an apt measure of graph\nsimilarity. We introduce a novel quantum optimisation simulation package\nfacilitating investigation of all constituent components of the QAOA from\ndesktop to cluster scale using graph similarity as an example. Our simulation\nprovides flexibility and performance. We investigate eight classical\noptimisation methods each at six levels of decomposition. Moreover an encoding\nfor permutation based problems such as graph similarity through edge overlap to\nthe QAOA allows for significant quantum memory savings at the cost of\nadditional operations. This compromise extends into the classical portion of\nthe algorithm as the inclusion of infeasible solutions creates a challenging\ncost-function landscape. We present performance analysis of our simulation and\nof the QAOA setting a precedent for investigating and validating numerous other\ndifficult problems to the QAOA as we move towards realising practical quantum\ncomputation.\n",
  "subjects": [
    "Physics/Quantum Physics",
    "Computer Science/Distributed, Parallel, and Cluster Computing"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "o5lZF7v5eFXFye4svml27niG4BVKqVW_bV1b6Q6Aptk",
  "pdfSize": "1627587"
}