{"id":"2412.06335","title":"StructRide: A Framework to Exploit the Structure Information of\n  Shareability Graph in Ridesharing","authors":"Jiexi Zhan, Yu Chen, Peng Cheng, Lei Chen, Wangze Ni, Xuemin Lin","authorsParsed":[["Zhan","Jiexi",""],["Chen","Yu",""],["Cheng","Peng",""],["Chen","Lei",""],["Ni","Wangze",""],["Lin","Xuemin",""]],"versions":[{"version":"v1","created":"Mon, 9 Dec 2024 09:35:45 GMT"},{"version":"v2","created":"Wed, 11 Dec 2024 05:55:02 GMT"}],"updateDate":"2024-12-12","timestamp":1733736945000,"abstract":"  Ridesharing services play an essential role in modern transportation, which\nsignificantly reduces traffic congestion and exhaust pollution. In the\nridesharing problem, improving the sharing rate between riders can not only\nsave the travel cost of drivers but also utilize vehicle resources more\nefficiently. The existing online-based and batch-based methods for the\nridesharing problem lack the analysis of the sharing relationship among riders,\nleading to a compromise between efficiency and accuracy. In addition, the graph\nis a powerful tool to analyze the structure information between nodes.\nTherefore, in this paper, we propose a framework, namely StructRide, to utilize\nthe structure information to improve the results for ridesharing problems.\nSpecifically, we extract the sharing relationships between riders to construct\na shareability graph. Then, we define a novel measurement shareability loss for\nvehicles to select groups of requests such that the unselected requests still\nhave high probabilities of sharing. Our SARD algorithm can efficiently solve\ndynamic ridesharing problems to achieve dramatically improved results. Through\nextensive experiments, we demonstrate the efficiency and effectiveness of our\nSARD algorithm on two real datasets. Our SARD can run up to 72.68 times faster\nand serve up to 50% more requests than the state-of-the-art algorithms.\n","subjects":["Computer Science/Databases"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Xef7ofpSbr1NFlq2IS6ABgdW3vIOtw8UpKj_5QyIeGw","pdfSize":"3608801"}