{
  "id": "2412.14109",
  "title": "Machine Learning Co-pilot for Screening of Organic Molecular Additives\n  for Perovskite Solar Cells",
  "authors": "Yang Pu, Zhiyuan Dai, Yifan Zhou, Ning Jia, Hongyue Wang, Yerzhan\n  Mukhametkarimov, Ruihao Chen, Hongqiang Wang, Zhe Liu",
  "authorsParsed": [
    [
      "Pu",
      "Yang",
      ""
    ],
    [
      "Dai",
      "Zhiyuan",
      ""
    ],
    [
      "Zhou",
      "Yifan",
      ""
    ],
    [
      "Jia",
      "Ning",
      ""
    ],
    [
      "Wang",
      "Hongyue",
      ""
    ],
    [
      "Mukhametkarimov",
      "Yerzhan",
      ""
    ],
    [
      "Chen",
      "Ruihao",
      ""
    ],
    [
      "Wang",
      "Hongqiang",
      ""
    ],
    [
      "Liu",
      "Zhe",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 17:52:45 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734544365000,
  "abstract": "  Machine learning (ML) has been extensively employed in planar perovskite\nphotovoltaics to screen effective organic molecular additives, while\nencountering predictive biases for novel materials due to small datasets and\nreliance on predefined descriptors. Present work thus proposes an effective\napproach, Co-Pilot for Perovskite Additive Screener (Co-PAS), an ML-driven\nframework designed to accelerate additive screening for perovskite solar cells\n(PSCs). Co-PAS overcomes predictive biases by integrating the Molecular\nScaffold Classifier (MSC) for scaffold-based pre-screening and utilizing\nJunction Tree Variational Autoencoder (JTVAE) latent vectors to enhance\nmolecular structure representation, thereby enhancing the accuracy of power\nconversion efficiency (PCE) predictions. Leveraging Co-PAS, we integrate domain\nknowledge to screen an extensive dataset of 250,000 molecules from PubChem,\nprioritizing candidates based on predicted PCE values and key molecular\nproperties such as donor number, dipole moment, and hydrogen bond acceptor\ncount. This workflow leads to the identification of several promising\npassivating molecules, including the novel Boc-L-threonine N-hydroxysuccinimide\nester (BTN), which, to our knowledge, has not been explored as an additive in\nPSCs and achieves a device PCE of 25.20%. Our results underscore the potential\nof Co-PAS in advancing additive discovery for high-performance PSCs.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Condensed Matter/Materials Science",
    "Physics/Applied Physics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "IA0FFBzXMcFE7e_Xj2kIsGoOaTmgzGZXVjZpu9llX-8",
  "pdfSize": "14007227"
}