{
  "id": "2412.05431",
  "title": "Smart leverage? Rethinking the role of Leveraged Exchange Traded Funds\n  in constructing portfolios to beat a benchmark",
  "authors": "Pieter van Staden, Peter Forsyth, Yuying Li",
  "authorsParsed": [
    [
      "van Staden",
      "Pieter",
      ""
    ],
    [
      "Forsyth",
      "Peter",
      ""
    ],
    [
      "Li",
      "Yuying",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 21:33:58 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733520838000,
  "abstract": "  Leveraged Exchange Traded Funds (LETFs), while extremely controversial in the\nliterature, remain stubbornly popular with both institutional and retail\ninvestors in practice. While the criticisms of LETFs are certainly valid, we\nargue that their potential has been underestimated in the literature due to the\nuse of very simple investment strategies involving LETFs. In this paper, we\nsystematically investigate the potential of including a broad stock market\nindex LETF in long-term, dynamically-optimal investment strategies designed to\nmaximize the outperformance over standard investment benchmarks in the sense of\nthe information ratio (IR). Our results exploit the observation that positions\nin a LETF deliver call-like payoffs, so that the addition of a LETF to a\nportfolio can be a convenient way to add inexpensive leverage while providing\ndownside protection. Under stylized assumptions, we present and analyze\nclosed-form IR-optimal investment strategies using either a LETF or\nstandard/vanilla ETF (VETF) on the same equity index, which provides the\nnecessary intuition for the potential and benefits of LETFs. In more realistic\nsettings, we use a neural network-based approach to determine the IR-optimal\nstrategies, trained on bootstrapped historical data. We find that IR-optimal\nstrategies with a broad stock market LETF are not only more likely to\noutperform the benchmark than IR-optimal strategies derived using the\ncorresponding VETF, but are able to achieve partial stochastic dominance over\nthe benchmark and VETF-based strategies in terms of terminal wealth.\n",
  "subjects": [
    "Quantitative Finance/Computational Finance",
    "Quantitative Finance/Portfolio Management"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "5rJFgo4kpGn6UEtQY9uvna6qH-SLs9AU8Q5qWE3l8V0",
  "pdfSize": "3740204"
}