{"id":"2412.08609","title":"Dust and gas modelling in radiative transfer simulations of\n  disc-dominated galaxies with RADMC-3D","authors":"Francesco Sinigaglia, Miroslava Dessauges-Zavadsky, Lucio Mayer, Pedro\n  R. Capelo, Valentina Tamburello","authorsParsed":[["Sinigaglia","Francesco",""],["Dessauges-Zavadsky","Miroslava",""],["Mayer","Lucio",""],["Capelo","Pedro R.",""],["Tamburello","Valentina",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 18:34:07 GMT"}],"updateDate":"2024-12-12","timestamp":1733942047000,"abstract":"  Bridging theory and observations is a key task to understand galaxy formation\nand evolution. With the advent of state-of-the-art observational facilities, an\naccurate modelling of galaxy observables through radiative transfer simulations\ncoupled to hydrodynamic simulations of galaxy formation must be performed. We\npresent a novel pipeline, dubbed RTGen, based on the Monte Carlo radiative\ntransfer code RADMC-3D , and explore the impact of the physical assumptions and\nmodelling of dust and gas phases on the resulting galaxy observables. In\nparticular, we address the impact of the dust abundance, composition, and grain\nsize, as well as model the atomic-to-molecular transition and study the\nresulting emission from molecular gas. We apply Monte Carlo radiative transfer\na posteriori to determine the dust temperature in six different hydrodynamic\nsimulations of isolated galaxies. Afterwards, we apply ray tracing to compute\nthe spectral energy distribution, as well as continuum images and spectral line\nprofiles. We find our pipeline to predict accurate spectral energy distribution\ndistributions of the studied galaxies, as well as continuum and CO luminosity\nimages, in good agreement with literature results from both observations and\ntheoretical studies. In particular, we find the dust modelling to have an\nimportant impact on the convergence of the resulting predicted galaxy\nobservables, and that an adequate modelling of dust grains composition and size\nis required. We conclude that our novel framework is ready to perform\nhigh-accuracy studies of the observables of the ISM, reaching few tens percent\nconvergence under the studied baseline configuration. This will enable robust\nstudies of galaxy formation, and in particular of the nature of massive clumps\nin high-redshift galaxies, through the generation of mock images mimicking\nobservations from state-of-the-art facilities such as JWST and ALMA.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"pS59uJoII0NOZBRPNtvCRTuual6ii6NI5LcIzjai7Tk","pdfSize":"45708797"}