{
  "id": "2412.01946",
  "title": "The Reality of AI and Biorisk",
  "authors": "Aidan Peppin, Anka Reuel, Stephen Casper, Elliot Jones, Andrew Strait,\n  Usman Anwar, Anurag Agrawal, Sayash Kapoor, Sanmi Koyejo, Marie Pellat, Rishi\n  Bommasani, Nick Frosst, Sara Hooker",
  "authorsParsed": [
    [
      "Peppin",
      "Aidan",
      ""
    ],
    [
      "Reuel",
      "Anka",
      ""
    ],
    [
      "Casper",
      "Stephen",
      ""
    ],
    [
      "Jones",
      "Elliot",
      ""
    ],
    [
      "Strait",
      "Andrew",
      ""
    ],
    [
      "Anwar",
      "Usman",
      ""
    ],
    [
      "Agrawal",
      "Anurag",
      ""
    ],
    [
      "Kapoor",
      "Sayash",
      ""
    ],
    [
      "Koyejo",
      "Sanmi",
      ""
    ],
    [
      "Pellat",
      "Marie",
      ""
    ],
    [
      "Bommasani",
      "Rishi",
      ""
    ],
    [
      "Frosst",
      "Nick",
      ""
    ],
    [
      "Hooker",
      "Sara",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 20:14:46 GMT"
    },
    {
      "version": "v2",
      "created": "Wed, 4 Dec 2024 12:19:35 GMT"
    },
    {
      "version": "v3",
      "created": "Thu, 2 Jan 2025 11:04:46 GMT"
    }
  ],
  "updateDate": "2025-01-03",
  "timestamp": 1733170486000,
  "abstract": "  To accurately and confidently answer the question 'could an AI model or\nsystem increase biorisk', it is necessary to have both a sound theoretical\nthreat model for how AI models or systems could increase biorisk and a robust\nmethod for testing that threat model. This paper provides an analysis of\nexisting available research surrounding two AI and biorisk threat models: 1)\naccess to information and planning via large language models (LLMs), and 2) the\nuse of AI-enabled biological tools (BTs) in synthesizing novel biological\nartifacts. We find that existing studies around AI-related biorisk are nascent,\noften speculative in nature, or limited in terms of their methodological\nmaturity and transparency. The available literature suggests that current LLMs\nand BTs do not pose an immediate risk, and more work is needed to develop\nrigorous approaches to understanding how future models could increase biorisks.\nWe end with recommendations about how empirical work can be expanded to more\nprecisely target biorisk and ensure rigor and validity of findings.\n",
  "subjects": [
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "mPuT8LiI8O8lzKKyhESvXzbJNyl4cmOWQrbWIApHBbs",
  "pdfSize": "312129"
}