{
  "id": "2412.02074",
  "title": "Structure of Quantum Mean Force Gibbs States for Coupled Harmonic\n  Systems",
  "authors": "Joonhyun Yeo and Haena Shim",
  "authorsParsed": [
    [
      "Yeo",
      "Joonhyun",
      ""
    ],
    [
      "Shim",
      "Haena",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 01:33:08 GMT"
    },
    {
      "version": "v2",
      "created": "Fri, 31 Jan 2025 23:04:41 GMT"
    }
  ],
  "updateDate": "2025-02-17",
  "timestamp": 1733189588000,
  "abstract": "  An open quantum system interacting with a heat bath at given temperature is\nexpected to reach the mean force Gibbs (MFG) state as a steady state. The MFG\nstate is given by tracing out the bath degrees of freedom from the equilibrium\nGibbs state of the total system plus bath. When the interaction between the\nsystem and the bath is not negligible, it is different from the usual system\nGibbs state obtained from the system Hamiltonian only. Using the path integral\nmethod, we present the exact MFG state for a coupled system of quantum harmonic\noscillators in contact with multiple thermal baths at the same temperature. We\ndevelop a nonperturbative method to calculate the covariances with respect to\nthe MFG state. By comparing them with those obtained from the system Gibbs\nstate, we find that the effect of coupling to the bath decays exponentially as\na function of the distance from the system-bath boundary. This is similar to\nthe skin effect found recently for a quantum spin chain interacting with an\nenvironment. Using the exact results, we also investigate the ultrastrong\ncoupling limit where the coupling between the system and the bath gets\narbitrarily large and make a connection with the recent result found for a\ngeneral quantum system.\n",
  "subjects": [
    "Condensed Matter/Statistical Mechanics",
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "H56gefXhAbo_7vhFwpz7BJ_YcsiFMCoMGu1NO1iVk9c",
  "pdfSize": "3420632"
}