{"id":"2412.16851","title":"Decoupling Dipolar Interactions in Dense Spin Ensembles","authors":"Linta Joseph, Wynter Alford, Chandrasekhar Ramanathan","authorsParsed":[["Joseph","Linta",""],["Alford","Wynter",""],["Ramanathan","Chandrasekhar",""]],"versions":[{"version":"v1","created":"Sun, 22 Dec 2024 04:32:50 GMT"}],"updateDate":"2024-12-24","timestamp":1734841970000,"abstract":"  Dense spin ensembles in solids present a natural platform for studying\nquantum many-body dynamics. Multiple-pulse coherent control can be used to\nmanipulate the magnetic dipolar interaction between the spins to engineer their\ndynamics. Here, we investigate the performance of a series of well-known pulse\nsequences that aim to suppress inter-spin dipolar couplings. We use a\ncombination of numerical simulations and solid-state nuclear magnetic resonance\n(NMR) experiments on adamantane to evaluate and compare sequence performance.\nWe study the role of sequence parameters like inter-pulse delays and resonance\noffsets. Disagreements between experiments and theory are typically explained\nby the presence of control errors and experimental non-idealities. The\nsimulations allow us to explore the influence of factors such as finite pulse\nwidths, rotation errors, and phase transient errors. We also investigate the\nrole of local disorder and establish that it is, perhaps unsurprisingly, a\ndistinguishing factor in the decoupling efficiency of spectroscopic sequences\n(that preserve Hamiltonian terms proportional to $S_z$) and time-suspension\nsequences (which refocus all terms in the internal Hamiltonian). We discuss our\nfindings in the context of previously known analytical results from Average\nHamiltonian Theory. Finally, we explore the ability of time-suspension\nsequences to protect multi-spin correlations in the system.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Cb1fn6MJI3Ey9H7eye2hN5ecG9h5CMWvaoXmOSMNsf4","pdfSize":"6278101"}