{"id":"2412.00004","title":"Exploring the refuge-induced bubbling phenomenon and harvesting in a\n  three species food chain model that incorporates memory effect and odour\n  effect","authors":"Dipam Das, Debasish Bhattacharjee","authorsParsed":[["Das","Dipam",""],["Bhattacharjee","Debasish",""]],"versions":[{"version":"v1","created":"Mon, 11 Nov 2024 19:17:27 GMT"}],"updateDate":"2024-12-03","timestamp":1731352647000,"abstract":"  In this study, an odour-mediated system is developed and studied. In an\nodor-mediated systems, the sense of smell or odour of species plays a critical\nrole in the interactions between predators and prey. It is widely recognised in\nscientific literature that these systems are very common and essential across\nnatural ecosystems. These systems are crucial for various behaviors, including\nforaging, mating, and avoiding predators. In this paper, it is assumed that the\npresence of prey odour aids the predator in its hunting efforts. It is assumed\nthat both prey and intermediate predators seek refuge against their respective\npredators upon detecting the odour of their predators. In other words, the\nodour of predators assists prey species in evaluating the danger and seeking\nrefuge for hiding. This model incorporates the prey species' harvesting as\nwell. We also explore the impact of fading memory on the system by\nincorporating fractional derivatives into the model. The conditions for both\nthe existence and local stability of the non-negative equilibria are derived.\nThe current model system undergoes both Hopf and transcritical bifurcation when\nthe parameter values are appropriately chosen. The dynamic behaviour of the\nsystem is showcased and thoroughly analysed using a range of diagrams,\nhighlighting the the impact of prey refuge and predator odour parameters. This\npaper extensively examines the long-term impacts of harvesting within the\nsystem. The presence of prey odour plays a significant role in promoting a\nlong-term cohabitation dynamic within this specific system. It has been\nobserved that when individuals within the system have a strong memory, it\npositively affects the stability of the system. Numerical simulations are\nconducted in order to demonstrate and validate the usefulness of the model\nbeing considered, therefore supporting the analytical conclusions.\n","subjects":["Mathematics/General Mathematics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7agezmJurWiUqiejmtQtOhDfK1w_eCwdb6YIou7rnBU","pdfSize":"42124953"}