{"id":"2412.12229","title":"Efficacy of Temporal Interference Electrical Stimulation for Spinal Cord\n  Injury Rehabilitation: A Case Series","authors":"Ruidong Cheng, Yuling Shao, Xi Li, Li Zhang, Zehao Sheng, Chenyang Li,\n  Xu Xie, Huilin Mou, Weidong Chen, Shaomin Zhang, Yuchen Xu, Minmin Wang","authorsParsed":[["Cheng","Ruidong",""],["Shao","Yuling",""],["Li","Xi",""],["Zhang","Li",""],["Sheng","Zehao",""],["Li","Chenyang",""],["Xie","Xu",""],["Mou","Huilin",""],["Chen","Weidong",""],["Zhang","Shaomin",""],["Xu","Yuchen",""],["Wang","Minmin",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 14:15:40 GMT"}],"updateDate":"2024-12-18","timestamp":1734358540000,"abstract":"  Spinal cord injury (SCI) is a debilitating condition that often results in\nsignificant motor and sensory deficits, impacting the quality of life. Current\nrehabilitation methods, including physical therapy and electrical stimulation,\noffer variable outcomes and often require invasive procedures. Temporal\ninterference (TI) stimulation has emerged as a novel, non-invasive\nneuromodulation technique capable of targeting deep neural structures with\nprecision, providing a promising alternative for SCI rehabilitation. This study\nexplores the efficacy of TI stimulation as a non-invasive approach for\nimproving motor and sensory function in patients with incomplete SCI. Three\nmale patients with incomplete cervical SCI (AIS D) participated in a two-week\nintervention consisting of 14 sessions of TI stimulation targeting their injury\nsites. TI stimulation was delivered using frequencies of 1000 Hz and 1040 Hz,\nwith assessments conducted pre- and post-intervention, including motor and\nsensory evaluations, functional scales, and imaging studies.All participants\ndemonstrated significant improvements in neurological function, motor strength,\nsensory perception, and functional independence. Neurological levels of injury\nshifted upward in all cases, with one patient improving from C5 to C7. Graded\nRedefined Assessment of Strength, Sensibility and Prehension (GRASSP) results\nshows additional strength, prehension and sensory outcomes obtained for the arm\nand hand functions of participants. Motor scores (UEMS and LEMS) increased,\nsensory scores for light touch and pin prick improved, and functional\nassessments, such as the Berg Balance Scale (BBS) and Barthel Index (BI),\nshowed marked gains. Pain scores also decreased in two participants,\nhighlighting additional therapeutic benefits.\n","subjects":["Quantitative Biology/Neurons and Cognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"yrRsu-t6FWUMr1xKdX7gw-jrQ4dpckSLWkpwT02Bwac","pdfSize":"313853"}