{
  "id": "2412.09980",
  "title": "Real-Time Fall Detection Using Smartphone Accelerometers and WiFi\n  Channel State Information",
  "authors": "Lingyun Wang, Deqi Su, Aohua Zhang, Yujun Zhu, Weiwei Jiang, Xin He,\n  Panlong Yang",
  "authorsParsed": [
    [
      "Wang",
      "Lingyun",
      ""
    ],
    [
      "Su",
      "Deqi",
      ""
    ],
    [
      "Zhang",
      "Aohua",
      ""
    ],
    [
      "Zhu",
      "Yujun",
      ""
    ],
    [
      "Jiang",
      "Weiwei",
      ""
    ],
    [
      "He",
      "Xin",
      ""
    ],
    [
      "Yang",
      "Panlong",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 13 Dec 2024 09:07:41 GMT"
    }
  ],
  "updateDate": "2024-12-16",
  "timestamp": 1734080861000,
  "abstract": "  In recent years, as the population ages, falls have increasingly posed a\nsignificant threat to the health of the elderly. We propose a real-time fall\ndetection system that integrates the inertial measurement unit (IMU) of a\nsmartphone with optimized Wi-Fi channel state information (CSI) for secondary\nvalidation. Initially, the IMU distinguishes falls from routine daily\nactivities with minimal computational demand. Subsequently, the CSI is employed\nfor further assessment, which includes evaluating the individual's post-fall\nmobility. This methodology not only achieves high accuracy but also reduces\nenergy consumption in the smartphone platform. An Android application developed\nspecifically for the purpose issues an emergency alert if the user experiences\na fall and is unable to move. Experimental results indicate that the CSI model,\nbased on convolutional neural networks (CNN), achieves a detection accuracy of\n99%, \\revised{surpassing comparable IMU-only models, and demonstrating\nsignificant resilience in distinguishing between falls and non-fall activities.\n",
  "subjects": [
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "EMRXTgpyDJdMsXR7CLHHLGNPmCUdfG-aMgvygjKRpzY",
  "pdfSize": "2310433"
}