{
  "id": "2412.10737",
  "title": "Sentiment and Hashtag-aware Attentive Deep Neural Network for Multimodal\n  Post Popularity Prediction",
  "authors": "Shubhi Bansal, Mohit Kumar, Chandravardhan Singh Raghaw, Nagendra\n  Kumar",
  "authorsParsed": [
    [
      "Bansal",
      "Shubhi",
      ""
    ],
    [
      "Kumar",
      "Mohit",
      ""
    ],
    [
      "Raghaw",
      "Chandravardhan Singh",
      ""
    ],
    [
      "Kumar",
      "Nagendra",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 14 Dec 2024 08:18:23 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1734164303000,
  "abstract": "  Social media users articulate their opinions on a broad spectrum of subjects\nand share their experiences through posts comprising multiple modes of\nexpression, leading to a notable surge in such multimodal content on social\nmedia platforms. Nonetheless, accurately forecasting the popularity of these\nposts presents a considerable challenge. Prevailing methodologies primarily\ncenter on the content itself, thereby overlooking the wealth of information\nencapsulated within alternative modalities such as visual demographics,\nsentiments conveyed through hashtags and adequately modeling the intricate\nrelationships among hashtags, texts, and accompanying images. This oversight\nlimits the ability to capture emotional connection and audience relevance,\nsignificantly influencing post popularity. To address these limitations, we\npropose a seNtiment and hAshtag-aware attentive deep neuRal netwoRk for\nmultimodAl posT pOpularity pRediction, herein referred to as NARRATOR that\nextracts visual demographics from faces appearing in images and discerns\nsentiment from hashtag usage, providing a more comprehensive understanding of\nthe factors influencing post popularity Moreover, we introduce a hashtag-guided\nattention mechanism that leverages hashtags as navigational cues, guiding the\nmodels focus toward the most pertinent features of textual and visual\nmodalities, thus aligning with target audience interests and broader social\nmedia context. Experimental results demonstrate that NARRATOR outperforms\nexisting methods by a significant margin on two real-world datasets.\nFurthermore, ablation studies underscore the efficacy of integrating visual\ndemographics, sentiment analysis of hashtags, and hashtag-guided attention\nmechanisms in enhancing the performance of post popularity prediction, thereby\nfacilitating increased audience relevance, emotional engagement, and aesthetic\nappeal.\n",
  "subjects": [
    "Computer Science/Information Retrieval",
    "Computer Science/Social and Information Networks"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "0e9R9GKZISRgHR6L1yA5OE2N1psDdciz6UMbVFrQUX4",
  "pdfSize": "8091440"
}