{"id":"2412.17477","title":"Predicting Satisfied User and Machine Ratio for Compressed Images: A\n  Unified Approach","authors":"Qi Zhang, Shanshe Wang, Xinfeng Zhang, Siwei Ma, Jingshan Pan, Wen Gao","authorsParsed":[["Zhang","Qi",""],["Wang","Shanshe",""],["Zhang","Xinfeng",""],["Ma","Siwei",""],["Pan","Jingshan",""],["Gao","Wen",""]],"versions":[{"version":"v1","created":"Mon, 23 Dec 2024 11:09:30 GMT"}],"updateDate":"2024-12-24","timestamp":1734952170000,"abstract":"  Nowadays, high-quality images are pursued by both humans for better viewing\nexperience and by machines for more accurate visual analysis. However, images\nare usually compressed before being consumed, decreasing their quality. It is\nmeaningful to predict the perceptual quality of compressed images for both\nhumans and machines, which guides the optimization for compression. In this\npaper, we propose a unified approach to address this. Specifically, we create a\ndeep learning-based model to predict Satisfied User Ratio (SUR) and Satisfied\nMachine Ratio (SMR) of compressed images simultaneously. We first pre-train a\nfeature extractor network on a large-scale SMR-annotated dataset with human\nperception-related quality labels generated by diverse image quality models,\nwhich simulates the acquisition of SUR labels. Then, we propose an\nMLP-Mixer-based network to predict SUR and SMR by leveraging and fusing the\nextracted multi-layer features. We introduce a Difference Feature Residual\nLearning (DFRL) module to learn more discriminative difference features. We\nfurther use a Multi-Head Attention Aggregation and Pooling (MHAAP) layer to\naggregate difference features and reduce their redundancy. Experimental results\nindicate that the proposed model significantly outperforms state-of-the-art SUR\nand SMR prediction methods. Moreover, our joint learning scheme of human and\nmachine perceptual quality prediction tasks is effective at improving the\nperformance of both.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Multimedia"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"4RcEq4Uh_-Y6aTZtJc_RF55BdsfgumkYJmxlJ5ZKllQ","pdfSize":"670723"}