{"id":"2412.08216","title":"Nascent water waves induced by the impulsive motion of a solid wall","authors":"Wladimir Sarlin, Zhaodong Niu, Alban Sauret, Philippe Gondret and\n  Cyprien Morize","authorsParsed":[["Sarlin","Wladimir",""],["Niu","Zhaodong",""],["Sauret","Alban",""],["Gondret","Philippe",""],["Morize","Cyprien",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 09:14:18 GMT"}],"updateDate":"2024-12-12","timestamp":1733908458000,"abstract":"  In the present study, we investigated the generation phase of\nlaboratory-scale water waves induced by the impulsive motion of a rigid piston,\nwhose maximum velocity $U$ and total stroke $L$ are independently varied, as\nwell as the initial liquid depth $h$. By doing so, the influence of two\ndimensionless numbers is studied: the Froude number\n$\\mathrm{Fr}_p=U/(gh)^{1/2}$, with $g$ the gravitational acceleration, and the\nrelative stroke $\\Lambda_p =L/h$ of the piston. During the constant\nacceleration phase of the vertical wall, a transient water bump forms and\nremains localised in the vicinity of the piston, for all investigated\nparameters. Experiments with a small relative acceleration $\\gamma/g$, where\n$\\gamma=U^2/L$, are well captured by a first-order potential flow theory\nestablished by \\citet{1990_joo}, which provides a fair estimate of the overall\nfree surface elevation and the maximum wave amplitude reached at the contact\nwith the piston. For large Froude numbers, an unsteady hydraulic jump theory is\nproposed, which accurately predicts the time evolution of the wave amplitude at\nthe contact with the piston throughout the generation phase. At the end of the\nformation process, the dimensionless volume of the bump evolves linearly with\n$\\Lambda_p$ and the wave aspect ratio is found to be governed by the relative\nacceleration $\\gamma/g$. As the piston begins its constant deceleration, the\nwater bump evolves into a propagating wave and several regimes are then\nreported and mapped in a phase diagram in the ($\\mathrm{Fr}_p$, $\\Lambda_p$)\nplane. While the transition from waves to water jets is observed if the typical\nacceleration of the piston is close enough to the gravitational acceleration\n$g$, the wave regimes are found to be mainly selected by the relative piston\nstroke $\\Lambda_p$ while the Froude number determines whether the generated\nwave breaks or not.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"nu4uF8lERwrOGFOsJGFLHUXVmwTw2VaYF9qI2uxvDTc","pdfSize":"10577163"}