{
  "id": "2412.01922",
  "title": "Late-time Evolution and Instabilities of Tidal Disruption Disks",
  "authors": "Anthony L. Piro, Brenna Mockler",
  "authorsParsed": [
    [
      "Piro",
      "Anthony L.",
      ""
    ],
    [
      "Mockler",
      "Brenna",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 19:12:14 GMT"
    }
  ],
  "updateDate": "2024-12-04",
  "timestamp": 1733166734000,
  "abstract": "  Observations of tidal disruption events (TDEs) on a timescale of years after\nthe main flare show evidence of continued activity in the form of optical/UV\nemission, quasi-periodic eruptions, and delayed radio flares. Motivated by\nthis, we explore the time evolution of these disks using semi-analytic models\nto follow the changing disk properties and feeding rate to the central black\nhole (BH). We find that thermal instabilities typically begin\n$\\sim150-250\\,{\\rm days}$ after the TDE, causing the disk to cycle between high\nand low accretion states for up to $\\sim10-20\\,{\\rm yrs}$. The high state is\nsuper-Eddington, which may be associated with outflows that eject\n$\\sim10^{-3}-10^{-1}\\,M_\\odot$ with a range of velocities of $\\sim0.03-0.3c$\nover a span of a couple of days and produce radio flares. In the low state, the\naccretion rate slowly grows over many months to years as continued fallback\naccretion builds the mass of the disk. In this phase, the disk may reach\nluminosities of $\\sim10^{41}-10^{42}\\,{\\rm erg\\,s^{-1}}$ in the UV as seen in\nsome late-time observations. We highlight the importance of the iron-opacity\n\"bump\" at $\\approx2\\times10^5\\,{\\rm K}$ in generating sufficiently high\nluminosities. This work suggests that joint optical/UV observations with radio\nmonitoring could be key for following the disk state as the radio flares are\nproduced.\n",
  "subjects": [
    "Astrophysics/High Energy Astrophysical Phenomena"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "PJYCKKUaSkIIEvztZD6L62aPqA2RIIPzvxGaOeqqc80",
  "pdfSize": "2188859"
}