{
  "id": "2412.09416",
  "title": "Unifying AI Tutor Evaluation: An Evaluation Taxonomy for Pedagogical\n  Ability Assessment of LLM-Powered AI Tutors",
  "authors": "Kaushal Kumar Maurya, KV Aditya Srivatsa, Kseniia Petukhova, and\n  Ekaterina Kochmar",
  "authorsParsed": [
    [
      "Maurya",
      "Kaushal Kumar",
      ""
    ],
    [
      "Srivatsa",
      "KV Aditya",
      ""
    ],
    [
      "Petukhova",
      "Kseniia",
      ""
    ],
    [
      "Kochmar",
      "Ekaterina",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 16:24:35 GMT"
    },
    {
      "version": "v2",
      "created": "Sat, 8 Feb 2025 11:51:57 GMT"
    }
  ],
  "updateDate": "2025-02-11",
  "timestamp": 1734020675000,
  "abstract": "  In this paper, we investigate whether current state-of-the-art large language\nmodels (LLMs) are effective as AI tutors and whether they demonstrate\npedagogical abilities necessary for good AI tutoring in educational dialogues.\nPrevious efforts towards evaluation have been limited to subjective protocols\nand benchmarks. To bridge this gap, we propose a unified evaluation taxonomy\nwith eight pedagogical dimensions based on key learning sciences principles,\nwhich is designed to assess the pedagogical value of LLM-powered AI tutor\nresponses grounded in student mistakes or confusions in the mathematical\ndomain. We release MRBench - a new evaluation benchmark containing 192\nconversations and 1,596 responses from seven state-of-the-art LLM-based and\nhuman tutors, providing gold annotations for eight pedagogical dimensions. We\nassess reliability of the popular Prometheus2 and Llama-3.1-8B LLMs as\nevaluators and analyze each tutor's pedagogical abilities, highlighting which\nLLMs are good tutors and which ones are more suitable as question-answering\nsystems. We believe that the presented taxonomy, benchmark, and human-annotated\nlabels will streamline the evaluation process and help track the progress in AI\ntutors' development.\n",
  "subjects": [
    "Computer Science/Computation and Language"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "GDom3vRwWLyih-ZAgi8xiV0Py-QOarZEooiIGVRgS6w",
  "pdfSize": "2892323"
}