{"id":"2412.15806","title":"TraianProt: a user-friendly R shiny application for wide format\n  proteomics data downstream analysis","authors":"Samuel de la Camara-Fuentes, Dolores Gutierrez-Blazquez, Maria Luisa\n  Hernaez and Concha Gil","authorsParsed":[["de la Camara-Fuentes","Samuel",""],["Gutierrez-Blazquez","Dolores",""],["Hernaez","Maria Luisa",""],["Gil","Concha",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 11:27:16 GMT"}],"updateDate":"2024-12-23","timestamp":1734694036000,"abstract":"  Summary: Mass spectrometry coupled to liquid chromatography (LC-MS/MS) is a\npowerful technique for the charac-terisation of proteomes. However, the diverse\nsoftware platforms available for processing the raw proteomics data, each\nproduce their own output format, making the extraction of meaningful and\ninterpretable results a difficult task. We present TraianProt, a web-based,\nuser-friendly proteomics data analysis platform, that enables the analysis of\nboth label-free and labeled data from Data-Dependent or Data-Independent\nAcquisition mass spectrometry mode support-ing different computational\nplatforms such as MaxQuant, MSFragger, DIA-NN, ProteoScape and Proteome\nDiscoverer output formats. TraianProt provides a dynamic framework that\nincludes several processing modules allowing the user to perform a complete\ndownstream analysis covering the stages of data pre-processing, differential\nexpression analy-sis, functional analysis and protein-protein interaction\nanalysis. Data output includes a wide range of high-quality, cus-tomisable\ngraphs such as heatmap, volcano plot, boxplot and barplot. This allows users to\nextract biological insights from proteomic data without any programming skills.\nAvailability and implementation: TraianProt is implemented in R. Its code and\ndocumentation are available on GitHub at\nhttps://github.com/SamueldelaCamaraFuentes/TraianProt along with a step-by-step\ntutorial incorporated in the repository. Contact: sdelacam@ucm.es Supplementary\ninformation: Supplementary data are available at Bioinformatics online\n","subjects":["Statistics/Applications","Quantitative Biology/Quantitative Methods"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_gHJWqcOfR1QG4MJl8VlZT4rcY-12mctwPVjC61JJoU","pdfSize":"220774"}