{"id":"2412.03058","title":"Revisiting Energy-Based Model for Out-of-Distribution Detection","authors":"Yifan Wu, Xichen Ye, Songmin Dai, Dengye Pan, Xiaoqiang Li, Weizhong\n  Zhang, and Yifan Chen","authorsParsed":[["Wu","Yifan",""],["Ye","Xichen",""],["Dai","Songmin",""],["Pan","Dengye",""],["Li","Xiaoqiang",""],["Zhang","Weizhong",""],["Chen","Yifan",""]],"versions":[{"version":"v1","created":"Wed, 4 Dec 2024 06:25:26 GMT"}],"updateDate":"2024-12-05","timestamp":1733293526000,"abstract":"  Out-of-distribution (OOD) detection is an essential approach to robustifying\ndeep learning models, enabling them to identify inputs that fall outside of\ntheir trained distribution. Existing OOD detection methods usually depend on\ncrafted data, such as specific outlier datasets or elaborate data\naugmentations. While this is reasonable, the frequent mismatch between crafted\ndata and OOD data limits model robustness and generalizability. In response to\nthis issue, we introduce Outlier Exposure by Simple Transformations (OEST), a\nframework that enhances OOD detection by leveraging \"peripheral-distribution\"\n(PD) data. Specifically, PD data are samples generated through simple data\ntransformations, thus providing an efficient alternative to manually curated\noutliers.\n  We adopt energy-based models (EBMs) to study PD data. We recognize the\n\"energy barrier\" in OOD detection, which characterizes the energy difference\nbetween in-distribution (ID) and OOD samples and eases detection. PD data are\nintroduced to establish the energy barrier during training. Furthermore, this\nenergy barrier concept motivates a theoretically grounded energy-barrier loss\nto replace the classical energy-bounded loss, leading to an improved paradigm,\nOEST*, which achieves a more effective and theoretically sound separation\nbetween ID and OOD samples. We perform empirical validation of our proposal,\nand extensive experiments across various benchmarks demonstrate that OEST*\nachieves better or similar accuracy compared with state-of-the-art methods.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"60dKZUoGg6M3Hu-FbfpNWr0hXfD-NgZT7XWPAZT-Bic","pdfSize":"4523030"}