{
  "id": "2412.16953",
  "title": "Aristotle: Mastering Logical Reasoning with A Logic-Complete\n  Decompose-Search-Resolve Framework",
  "authors": "Jundong Xu, Hao Fei, Meng Luo, Qian Liu, Liangming Pan, William Yang\n  Wang, Preslav Nakov, Mong-Li Lee, Wynne Hsu",
  "authorsParsed": [
    [
      "Xu",
      "Jundong",
      ""
    ],
    [
      "Fei",
      "Hao",
      ""
    ],
    [
      "Luo",
      "Meng",
      ""
    ],
    [
      "Liu",
      "Qian",
      ""
    ],
    [
      "Pan",
      "Liangming",
      ""
    ],
    [
      "Wang",
      "William Yang",
      ""
    ],
    [
      "Nakov",
      "Preslav",
      ""
    ],
    [
      "Lee",
      "Mong-Li",
      ""
    ],
    [
      "Hsu",
      "Wynne",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 22 Dec 2024 10:14:09 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734862449000,
  "abstract": "  In the context of large language models (LLMs), current advanced reasoning\nmethods have made impressive strides in various reasoning tasks. However, when\nit comes to logical reasoning tasks, major challenges remain in both efficacy\nand efficiency. This is rooted in the fact that these systems fail to fully\nleverage the inherent structure of logical tasks throughout the reasoning\nprocesses such as decomposition, search, and resolution. To address this, we\npropose a logic-complete reasoning framework, Aristotle, with three key\ncomponents: Logical Decomposer, Logical Search Router, and Logical Resolver. In\nour framework, symbolic expressions and logical rules are comprehensively\nintegrated into the entire reasoning process, significantly alleviating the\nbottlenecks of logical reasoning, i.e., reducing sub-task complexity,\nminimizing search errors, and resolving logical contradictions. The\nexperimental results on several datasets demonstrate that Aristotle\nconsistently outperforms state-of-the-art reasoning frameworks in both accuracy\nand efficiency, particularly excelling in complex logical reasoning scenarios.\nWe will open-source all our code at https://github.com/Aiden0526/Aristotle.\n",
  "subjects": [
    "Computer Science/Computation and Language"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "aZ8G3Yfiu4kZbKDnuH7VOjKYH3rKzU0QpCAiQInxCJ4",
  "pdfSize": "1157978"
}