{
  "id": "2412.16363",
  "title": "Fermi-Liquid $T^2$ Resistivity: Dynamical Mean-Field Theory Meets\n  Experiment",
  "authors": "Jeremy Lee-Hand, Harrison LaBollita, Fabian B. Kugler, Lorenzo Van\n  Mu\\~noz, Jason Kaye, Sophie Beck, Alexander Hampel, Antoine Georges, and\n  Cyrus E. Dreyer",
  "authorsParsed": [
    [
      "Lee-Hand",
      "Jeremy",
      ""
    ],
    [
      "LaBollita",
      "Harrison",
      ""
    ],
    [
      "Kugler",
      "Fabian B.",
      ""
    ],
    [
      "Van Muñoz",
      "Lorenzo",
      ""
    ],
    [
      "Kaye",
      "Jason",
      ""
    ],
    [
      "Beck",
      "Sophie",
      ""
    ],
    [
      "Hampel",
      "Alexander",
      ""
    ],
    [
      "Georges",
      "Antoine",
      ""
    ],
    [
      "Dreyer",
      "Cyrus E.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 21:53:18 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734731598000,
  "abstract": "  Direct-current resistivity is a key probe for the physical properties of\nmaterials. In metals, Fermi-liquid (FL) theory serves as the basis for\nunderstanding transport. A $T^2$ behavior of the resistivity is often taken as\na signature of FL electron-electron scattering. However, the presence of\nimpurity and phonon scattering as well as material-specific aspects such as\nFermi surface geometry can complicate this interpretation. We demonstrate how\ndensity-functional theory combined with dynamical mean-field theory can be used\nto elucidate the FL regime. We take as examples SrVO$_{3}$ and SrMoO$_{3}$, two\nmoderately correlated perovskite oxides, and establish a precise framework to\nanalyze the FL behavior of the self-energy at low energy and temperature.\nReviewing published low-temperature resistivity measurements, we find agreement\nbetween our calculations and experiments performed on samples with\nexceptionally low residual resistivity. This comparison emphasizes the need for\nfurther theoretical, synthesis, and characterization developments in these and\nother FL materials.\n",
  "subjects": [
    "Condensed Matter/Materials Science",
    "Condensed Matter/Strongly Correlated Electrons"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "fhZcSckLNz7c7JSQd2YB0bl5xDUJ9HGuo_bWTxUa0KM",
  "pdfSize": "937134"
}