{
  "id": "2412.05191",
  "title": "Go-or-Grow Models in Biology: a Monster on a Leash",
  "authors": "R. Thiessen, M. Conte, T.L. Stepien, and T. Hillen",
  "authorsParsed": [
    [
      "Thiessen",
      "R.",
      ""
    ],
    [
      "Conte",
      "M.",
      ""
    ],
    [
      "Stepien",
      "T. L.",
      ""
    ],
    [
      "Hillen",
      "T.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 17:15:57 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733505357000,
  "abstract": "  Go-or-grow approaches represent a specific class of mathematical models used\nto describe populations where individuals either migrate or reproduce, but not\nboth simultaneously. These models have a wide range of applications in biology\nand medicine, chiefly among those the modeling of brain cancer spread. The\nanalysis of go-or-grow models has inspired new mathematics, and it is the\npurpose of this review to highlight interesting and challenging mathematical\nproperties of reaction--diffusion models of the go-or-grow type. We provide a\ndetailed review of biological and medical applications before focusing on key\nresults concerning solution existence and uniqueness, pattern formation,\ncritical domain size problems, and traveling waves. We present new general\nresults related to the critical domain size and traveling wave problems, and we\nconnect these findings to the existing literature. Moreover, we demonstrate the\nhigh level of instability inherent in go-or-grow models. We argue that there is\ncurrently no accurate numerical solver for these models, and emphasize that\nspecial care must be taken when dealing with the \"monster on a leash\".\n",
  "subjects": [
    "Quantitative Biology/Cell Behavior",
    "Physics/Mathematical Physics",
    "Mathematics/Mathematical Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "M2OeXL0OO-TDMSYvUECCN55HRwEFHJ18kD6BvGmP7Q0",
  "pdfSize": "1827309"
}