{"id":"2412.13393","title":"MMHMR: Generative Masked Modeling for Hand Mesh Recovery","authors":"Muhammad Usama Saleem, Ekkasit Pinyoanuntapong, Mayur Jagdishbhai\n  Patel, Hongfei Xue, Ahmed Helmy, Srijan Das, Pu Wang","authorsParsed":[["Saleem","Muhammad Usama",""],["Pinyoanuntapong","Ekkasit",""],["Patel","Mayur Jagdishbhai",""],["Xue","Hongfei",""],["Helmy","Ahmed",""],["Das","Srijan",""],["Wang","Pu",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 00:10:00 GMT"}],"updateDate":"2024-12-19","timestamp":1734480600000,"abstract":"  Reconstructing a 3D hand mesh from a single RGB image is challenging due to\ncomplex articulations, self-occlusions, and depth ambiguities. Traditional\ndiscriminative methods, which learn a deterministic mapping from a 2D image to\na single 3D mesh, often struggle with the inherent ambiguities in 2D-to-3D\nmapping. To address this challenge, we propose MMHMR, a novel generative masked\nmodel for hand mesh recovery that synthesizes plausible 3D hand meshes by\nlearning and sampling from the probabilistic distribution of the ambiguous\n2D-to-3D mapping process. MMHMR consists of two key components: (1) a VQ-MANO,\nwhich encodes 3D hand articulations as discrete pose tokens in a latent space,\nand (2) a Context-Guided Masked Transformer that randomly masks out pose tokens\nand learns their joint distribution, conditioned on corrupted token sequences,\nimage context, and 2D pose cues. This learned distribution facilitates\nconfidence-guided sampling during inference, producing mesh reconstructions\nwith low uncertainty and high precision. Extensive evaluations on benchmark and\nreal-world datasets demonstrate that MMHMR achieves state-of-the-art accuracy,\nrobustness, and realism in 3D hand mesh reconstruction. Project website:\nhttps://m-usamasaleem.github.io/publication/MMHMR/mmhmr.html\n","subjects":["Computer Science/Computer Vision and Pattern Recognition","Computer Science/Artificial Intelligence","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7hrNraFusZj7KQmG-CkFURjFkjRVuefN_cc_6TAmE9M","pdfSize":"26500740"}