{
  "id": "2412.19414",
  "title": "The Hobby-Eberly Telescope Dark Energy Experiment Survey (HETDEX) Active\n  Galactic Nuclei Catalog: the Fourth Data Release",
  "authors": "Chenxu Liu, Karl Gebhardt, Erin Mentuch Cooper, Dustin Davis, Donald\n  P. Schneider, Matt J. Jarvis, Daniel J. Farrow, Steven L. Finkelstein, Oscar\n  A. Chavez Ortiz, and The HETDEX Collaboration",
  "authorsParsed": [
    [
      "Liu",
      "Chenxu",
      ""
    ],
    [
      "Gebhardt",
      "Karl",
      ""
    ],
    [
      "Cooper",
      "Erin Mentuch",
      ""
    ],
    [
      "Davis",
      "Dustin",
      ""
    ],
    [
      "Schneider",
      "Donald P.",
      ""
    ],
    [
      "Jarvis",
      "Matt J.",
      ""
    ],
    [
      "Farrow",
      "Daniel J.",
      ""
    ],
    [
      "Finkelstein",
      "Steven L.",
      ""
    ],
    [
      "Ortiz",
      "Oscar A. Chavez",
      ""
    ],
    [
      "Collaboration",
      "The HETDEX",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 27 Dec 2024 02:45:20 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735267520000,
  "abstract": "  We present the Active Galactic Nuclei (AGN) catalog from the fourth data\nrelease (HDR4) of the Hobby-Eberly Telescope Dark Energy Experiment Survey\n(HETDEX). HETDEX is an untargeted spectroscopic survey. HDR4 contains 345,874\nIntegral Field Unit (IFU) observations from January 2017 to August 2023\ncovering an effective area of 62.9 deg2. With no imaging pre-selection, our\nspectroscopic confirmed AGN sample includes low-luminosity AGN, narrow-line\nAGN, and/or red AGN down to g~25. This catalog has 15,940 AGN across the\nredshifts of z=0.1~4.6, giving a raw AGN number density of 253.4 deg-2. Among\nthem, 10,499 (66%) have redshifts either confirmed by line pairs or matched to\nthe Sloan Digital Sky Survey Quasar Catalog. For the remaining 5,441 AGN, 2,083\nare single broad line AGN candidates, while the remaining 3,358 are single\nintermediate broad line (full width at half maximum, FWHM ~ 1200 km s-1) AGN\ncandidates. A total of 4,060 (39%) of the 10,499 redshift-confirmed AGN have\nemission-line regions $3\\sigma$ more extended than the image quality which\ncould be strong outflows blowing into the outskirts of the host galaxies or\nionized intergalactic medium.\n",
  "subjects": [
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "EK8QAMyhY6bgYIPmtzgzWVs38rWzIwh3Q1V8rNidwys",
  "pdfSize": "2504941"
}