{"id":"2412.19357","title":"Habitability in 4-D: Predicting the Climates of Earth Analogs across\n  Rotation and Orbital Configurations","authors":"Arthur D. Adams, Christopher Colose, Aronne Merrelli, Margaret\n  Turnbull, Stephen R. Kane","authorsParsed":[["Adams","Arthur D.",""],["Colose","Christopher",""],["Merrelli","Aronne",""],["Turnbull","Margaret",""],["Kane","Stephen R.",""]],"versions":[{"version":"v1","created":"Thu, 26 Dec 2024 21:39:04 GMT"}],"updateDate":"2024-12-30","timestamp":1735249144000,"abstract":"  Earth-like planets in the circumstellar habitable zone (HZ) may have\ndramatically different climate outcomes depending on their spin-orbit\nparameters, altering their habitability for life as we know it. We present a\nsuite of 93 ROCKE-3D general circulation models (GCMs) for planets with the\nsame surface conditions and average annual insolation as Earth, but with a wide\nrange of rotation periods, obliquities, orbital eccentricities, and longitudes\nof periastra. Our habitability metric $f_\\mathrm{HZ}$ is calculated based on\nthe temperature and precipitation in each model across grid cells over land.\nLatin Hypercube Sampling (LHS) aids in sampling all 4 of the spin-orbit\nparameters with a computationally feasible number of GCM runs. Statistical\nemulation then allows us to model $f_\\mathrm{HZ}$ as a smooth function with\nbuilt-in estimates of statistical uncertainty. We fit our emulator to an\ninitial set of 46 training runs, then test with an additional 46 runs at\ndifferent spin-orbit values. Our emulator predicts the directly GCM-modeled\nhabitability values for the test runs at the appropriate level of accuracy and\nprecision. For orbital eccentricities up to 0.225, rotation period remains the\nprimary driver of the fraction of land that remains above freezing and with\nprecipitation above a threshold value. For rotation periods greater than $\\sim\n20$ days, habitability drops significantly (from $\\sim 70$% to $\\sim 20$%),\ndriven primarily by cooler land temperatures. Obliquity is a significant\nsecondary factor for rotation periods less than $\\sim 20$ Earth days, with a\nfactor of two impact on habitability that is maximized at intermediate\nobliquity.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"bAqhZ90ujjmutvH0OvYX0k_8Cxlm5w0uCmwSJhdxf6M","pdfSize":"16386991"}