{
  "id": "2412.20641",
  "title": "SafeSynthDP: Leveraging Large Language Models for Privacy-Preserving\n  Synthetic Data Generation Using Differential Privacy",
  "authors": "Md Mahadi Hasan Nahid, Sadid Bin Hasan",
  "authorsParsed": [
    [
      "Nahid",
      "Md Mahadi Hasan",
      ""
    ],
    [
      "Hasan",
      "Sadid Bin",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 30 Dec 2024 01:10:10 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735521010000,
  "abstract": "  Machine learning (ML) models frequently rely on training data that may\ninclude sensitive or personal information, raising substantial privacy\nconcerns. Legislative frameworks such as the General Data Protection Regulation\n(GDPR) and the California Consumer Privacy Act (CCPA) have necessitated the\ndevelopment of strategies that preserve privacy while maintaining the utility\nof data. In this paper, we investigate the capability of Large Language Models\n(LLMs) to generate synthetic datasets integrated with Differential Privacy (DP)\nmechanisms, thereby enabling data-driven research and model training without\ndirect exposure of sensitive information. Our approach incorporates DP-based\nnoise injection methods, including Laplace and Gaussian distributions, into the\ndata generation process. We then evaluate the utility of these DP-enhanced\nsynthetic datasets by comparing the performance of ML models trained on them\nagainst models trained on the original data. To substantiate privacy\nguarantees, we assess the resilience of the generated synthetic data to\nmembership inference attacks and related threats. The experimental results\ndemonstrate that integrating DP within LLM-driven synthetic data generation\noffers a viable balance between privacy protection and data utility. This study\nprovides a foundational methodology and insight into the privacy-preserving\ncapabilities of LLMs, paving the way for compliant and effective ML research\nand applications.\n",
  "subjects": [
    "Computer Science/Machine Learning",
    "Computer Science/Cryptography and Security"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "S7lFOUjES06g-rynkTsvRhpQG3AiyEYlg7NyntOPhRo",
  "pdfSize": "328458"
}