{
  "id": "2412.09733",
  "title": "Geometric transport signatures of strained multi-Weyl semimetals",
  "authors": "Varsha Subramanyan, Shi-Zeng Lin, Avadh Saxena",
  "authorsParsed": [
    [
      "Subramanyan",
      "Varsha",
      ""
    ],
    [
      "Lin",
      "Shi-Zeng",
      ""
    ],
    [
      "Saxena",
      "Avadh",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 21:51:44 GMT"
    }
  ],
  "updateDate": "2024-12-16",
  "timestamp": 1734040304000,
  "abstract": "  The minimal coupling of strain to Dirac and Weyl semimetals, and its modeling\nas a pseudo-gauge field has been extensively studied, resulting in several\nproposed topological transport signatures. In this work, we study the effects\nof strain on higher winding number Weyl semimetals and show that strain is not\na pseudo-gauge field for any winding number larger than one. We focus on the\ndouble-Weyl semimetal as an illustrative example to show that the application\nof strain splits the higher winding number Weyl nodes and produces an\nanisotropic Fermi surface. Specifically, the Fermi surface of the double-Weyl\nsemimetal acquires nematic order. By extending chiral kinetic theory for such\nnematic fields, we determine the effective gauge fields acting on the system\nand show how strain induces anisotropy and affects the geometry of the\nsemi-classical phase space of the double-Weyl semimetal. Further, the\nstrain-induced deformation of the Weyl nodes results in transport signatures\nrelated to the covariant coupling of the strain tensor to the geometric tensor\nassociated with the Weyl nodes giving rise to strain-dependent dissipative\ncorrections to the longitudinal as well as the Hall conductance. Thus, by\nextension, we show that in multi-Weyl semimetals, strain produces geometric\nsignatures rather than topological signatures. Further, we highlight that the\nmost general way to view strain is as a symmetry-breaking field rather than a\npseudo-gauge field.\n",
  "subjects": [
    "Condensed Matter/Mesoscale and Nanoscale Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "tt5w9x-V1ls_afB3sOUHwWxGQUS7uXSMTr0Fz_4n4tM",
  "pdfSize": "1856375"
}