{"id":"2412.13273","title":"CompactFlowNet: Efficient Real-time Optical Flow Estimation on Mobile\n  Devices","authors":"Andrei Znobishchev, Valerii Filev, Oleg Kudashev, Nikita Orlov,\n  Humphrey Shi","authorsParsed":[["Znobishchev","Andrei",""],["Filev","Valerii",""],["Kudashev","Oleg",""],["Orlov","Nikita",""],["Shi","Humphrey",""]],"versions":[{"version":"v1","created":"Tue, 17 Dec 2024 19:06:12 GMT"}],"updateDate":"2024-12-19","timestamp":1734462372000,"abstract":"  We present CompactFlowNet, the first real-time mobile neural network for\noptical flow prediction, which involves determining the displacement of each\npixel in an initial frame relative to the corresponding pixel in a subsequent\nframe. Optical flow serves as a fundamental building block for various\nvideo-related tasks, such as video restoration, motion estimation, video\nstabilization, object tracking, action recognition, and video generation. While\ncurrent state-of-the-art methods prioritize accuracy, they often overlook\nconstraints regarding speed and memory usage. Existing light models typically\nfocus on reducing size but still exhibit high latency, compromise significantly\non quality, or are optimized for high-performance GPUs, resulting in\nsub-optimal performance on mobile devices. This study aims to develop a\nmobile-optimized optical flow model by proposing a novel mobile\ndevice-compatible architecture, as well as enhancements to the training\npipeline, which optimize the model for reduced weight, low memory utilization,\nand increased speed while maintaining minimal error. Our approach demonstrates\nsuperior or comparable performance to the state-of-the-art lightweight models\non the challenging KITTI and Sintel benchmarks. Furthermore, it attains a\nsignificantly accelerated inference speed, thereby yielding real-time\noperational efficiency on the iPhone 8, while surpassing real-time performance\nlevels on more advanced mobile devices.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"XOkwTGD3jwW5oTfyXsO4h7Lviqasc5K2f87nFMMXIi4","pdfSize":"7715930"}