{"id":"2412.10893","title":"BgGPT 1.0: Extending English-centric LLMs to other languages","authors":"Anton Alexandrov, Veselin Raychev, Dimitar I. Dimitrov, Ce Zhang,\n  Martin Vechev, Kristina Toutanova","authorsParsed":[["Alexandrov","Anton",""],["Raychev","Veselin",""],["Dimitrov","Dimitar I.",""],["Zhang","Ce",""],["Vechev","Martin",""],["Toutanova","Kristina",""]],"versions":[{"version":"v1","created":"Sat, 14 Dec 2024 16:49:52 GMT"}],"updateDate":"2024-12-17","timestamp":1734194992000,"abstract":"  We present BgGPT-Gemma-2-27B-Instruct and BgGPT-Gemma-2-9B-Instruct:\ncontinually pretrained and fine-tuned versions of Google's Gemma-2 models,\nspecifically optimized for Bulgarian language understanding and generation.\nLeveraging Gemma-2's multilingual capabilities and over 100 billion tokens of\nBulgarian and English text data, our models demonstrate strong performance in\nBulgarian language tasks, setting a new standard for language-specific AI\nmodels. Our approach maintains the robust capabilities of the original Gemma-2\nmodels, ensuring that the English language performance remains intact. To\npreserve the base model capabilities, we incorporate continual learning\nstrategies based on recent Branch-and-Merge techniques as well as thorough\ncuration and selection of training data. We provide detailed insights into our\nmethodology, including the release of model weights with a commercial-friendly\nlicense, enabling broader adoption by researchers, companies, and hobbyists.\nFurther, we establish a comprehensive set of benchmarks based on non-public\neducational data sources to evaluate models on Bulgarian language tasks as well\nas safety and chat capabilities. Our findings demonstrate the effectiveness of\nfine-tuning state-of-the-art models like Gemma 2 to enhance language-specific\nAI applications while maintaining cross-lingual capabilities.\n","subjects":["Computer Science/Computation and Language","Computer Science/Artificial Intelligence","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ykvIPnqEntp4Td4ld5vAnq_va88Xto9WlrJyrkmtNNM","pdfSize":"5928046"}