{
  "id": "2412.16698",
  "title": "Interact with me: Joint Egocentric Forecasting of Intent to Interact,\n  Attitude and Social Actions",
  "authors": "Tongfei Bian, Yiming Ma, Mathieu Chollet, Victor Sanchez, and Tanaya\n  Guha",
  "authorsParsed": [
    [
      "Bian",
      "Tongfei",
      ""
    ],
    [
      "Ma",
      "Yiming",
      ""
    ],
    [
      "Chollet",
      "Mathieu",
      ""
    ],
    [
      "Sanchez",
      "Victor",
      ""
    ],
    [
      "Guha",
      "Tanaya",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 21 Dec 2024 16:54:28 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1734800068000,
  "abstract": "  For efficient human-agent interaction, an agent should proactively recognize\ntheir target user and prepare for upcoming interactions. We formulate this\nchallenging problem as the novel task of jointly forecasting a person's intent\nto interact with the agent, their attitude towards the agent and the action\nthey will perform, from the agent's (egocentric) perspective. So we propose\n\\emph{SocialEgoNet} - a graph-based spatiotemporal framework that exploits task\ndependencies through a hierarchical multitask learning approach. SocialEgoNet\nuses whole-body skeletons (keypoints from face, hands and body) extracted from\nonly 1 second of video input for high inference speed. For evaluation, we\naugment an existing egocentric human-agent interaction dataset with new class\nlabels and bounding box annotations. Extensive experiments on this augmented\ndataset, named JPL-Social, demonstrate \\emph{real-time} inference and superior\nperformance (average accuracy across all tasks: 83.15\\%) of our model\noutperforming several competitive baselines. The additional annotations and\ncode will be available upon acceptance.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Human-Computer Interaction"
  ],
  "license": "http://creativecommons.org/publicdomain/zero/1.0/",
  "blobId": "E1umcgCmAbAa2FokBvRZXKG1AZf3DOp3y9t5lG95ylg",
  "pdfSize": "3319158"
}