{
  "id": "2412.04500",
  "title": "Approximate Computation of Loss Probability for Queueing System with\n  Capacity Sharing Discipline",
  "authors": "M.V. Yashina, A.G. Tatashev",
  "authorsParsed": [
    [
      "Yashina",
      "M. V.",
      ""
    ],
    [
      "Tatashev",
      "A. G.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 07:14:05 GMT"
    }
  ],
  "updateDate": "2024-12-09",
  "timestamp": 1733123645000,
  "abstract": "  A multi-channel queueing system is considered. The arriving requests differ\nin their type. Requests of each type arrive according to a Poisson process. The\nnumber of channels required for service with the rate equal to 1 depends of the\nrequest type. If a request is serviced with the rate equal to 1, then, by\ndefinition, the length of the request equals to the total service time. If at\narrival moment, the idle channels is sufficient, then the arriving request is\nserviced with the rate 1. If, at the arrival moment, there are no idle channel,\nthen the arriving request is lost. If, at arrival moment, there are idle\nchannels but the number of idle channels is not sufficient for servicing with\nrate 1, then the request begins to be in service with rate equal to the ratio\nof the number of idle channels to the number of the channels required for\nservice with the rate 1. If a request is serviced with a rate less than 1 and\nanother request leaves the system, then the service rate increases for the\nrequest in consideration. Approximate formula for loss probability has been\nproposed. The accuracy of approximation is estimated. Approximate values are\ncompared with exact values found from the system of equations for the related\nMarkov chain stationary state probabilities.\n",
  "subjects": [
    "Mathematics/Optimization and Control",
    "Mathematics/Probability"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "TZzb6WJsQ_ypKzvI9I33g1od6Qxlm4-sxWsI_Xz0Ahg",
  "pdfSize": "99728"
}