{
  "id": "2412.01378",
  "title": "A Survey on Deep Neural Networks in Collaborative Filtering\n  Recommendation Systems",
  "authors": "Pang Li, Shahrul Azman Mohd Noah, Hafiz Mohd Sarim",
  "authorsParsed": [
    [
      "Li",
      "Pang",
      ""
    ],
    [
      "Noah",
      "Shahrul Azman Mohd",
      ""
    ],
    [
      "Sarim",
      "Hafiz Mohd",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 2 Dec 2024 11:06:34 GMT"
    }
  ],
  "updateDate": "2024-12-03",
  "timestamp": 1733137594000,
  "abstract": "  This survey provides an examination of the use of Deep Neural Networks (DNN)\nin Collaborative Filtering (CF) recommendation systems. As the digital world\nincreasingly relies on data-driven approaches, traditional CF techniques face\nlimitations in scalability and flexibility. DNNs can address these challenges\nby effectively modeling complex, non-linear relationships within the data. We\nbegin by exploring the fundamental principles of both collaborative filtering\nand deep neural networks, laying the groundwork for understanding their\nintegration. Subsequently, we review key advancements in the field,\ncategorizing various deep learning models that enhance CF systems, including\nMultilayer Perceptrons (MLP), Convolutional Neural Networks (CNN), Recurrent\nNeural Networks (RNN), Graph Neural Networks (GNN), autoencoders, Generative\nAdversarial Networks (GAN), and Restricted Boltzmann Machines (RBM). The paper\nalso discusses evaluation protocols, various publicly available auxiliary\ninformation, and data features. Furthermore, the survey concludes with a\ndiscussion of the challenges and future research opportunities in enhancing\ncollaborative filtering systems with deep learning.\n",
  "subjects": [
    "Computer Science/Artificial Intelligence",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "P-Q9CRyd0VGviLneIhcnOEP_JtZB6f_j8Pfw-zireFk",
  "pdfSize": "847092"
}