{
  "id": "2412.02749",
  "title": "On the detection of stellar wakes in the Milky Way: a deep learning\n  approach",
  "authors": "Sven P\\~oder, Joosep Pata, Mar\\'ia Benito, Isaac Alonso Asensio,\n  Claudio Dalla Vecchia",
  "authorsParsed": [
    [
      "Põder",
      "Sven",
      ""
    ],
    [
      "Pata",
      "Joosep",
      ""
    ],
    [
      "Benito",
      "María",
      ""
    ],
    [
      "Asensio",
      "Isaac Alonso",
      ""
    ],
    [
      "Vecchia",
      "Claudio Dalla",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 19:00:01 GMT"
    }
  ],
  "updateDate": "2025-01-22",
  "timestamp": 1733252401000,
  "abstract": "  Due to poor observational constraints on the low-mass end of the subhalo mass\nfunction, the detection of dark matter (DM) subhalos on sub-galactic scales\nwould provide valuable information about the nature of DM. Stellar wakes,\ninduced by passing DM subhalos, encode information about the mass of the\ninducing perturber and thus serve as an indirect probe for the DM substructure\nwithin the Milky Way (MW). Our aim is to assess the viability and performance\nof deep learning searches for stellar wakes in the Galactic stellar halo caused\nby DM subhalos of varying mass. We simulate massive objects (subhalos) moving\nthrough a homogeneous medium of DM and star particles, with phase-space\nparameters tailored to replicate the conditions of the Galaxy at a specific\ndistance from the Galactic center. The simulation data is used to train deep\nneural networks with the purpose of inferring both the presence and mass of the\nmoving perturber, and assess subhalo detectability in varying conditions of the\nGalactic stellar and DM halos. We find that our binary classifier is able to\ninfer the presence of subhalos, showing non-trivial performance down to a\nsubhalo mass of $5 \\times 10^7 \\rm \\, M_\\odot$. We also find that our binary\nclassifier is generalisable to datasets describing subhalo orbits at different\nGalactocentric distances. In a multiple-hypothesis case, we are able to discern\nbetween samples containing subhalos of different masses. Out of the phase-space\nobservables available to us, we conclude that overdensity and velocity\ndivergence are the most important features for subhalo detection performance.\n",
  "subjects": [
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "5XtMgOFZeycraeU79dK_L8f2HHvIP9K32UL0tDJjDMg",
  "pdfSize": "1186350"
}