{"id":"2412.21092","title":"The (in)stability of quasinormal modes of Boulware-Deser-Wheeler black\n  hole in the hyperboloidal framework","authors":"Li-Ming Cao, Liang-Bi Wu and Yu-Sen Zhou","authorsParsed":[["Cao","Li-Ming",""],["Wu","Liang-Bi",""],["Zhou","Yu-Sen",""]],"versions":[{"version":"v1","created":"Mon, 30 Dec 2024 17:16:23 GMT"}],"updateDate":"2024-12-31","timestamp":1735578983000,"abstract":"  We study the quasinormal modes of Boulware-Deser-Wheeler black hole in\nEinstein-Gauss-Bonnet gravity theory within the hyperboloidal framework. The\neffective potentials for the test Klein-Gordon field and gravitational\nperturbations of scalar, vector, and tensor type are thoroughly investigated\nand put into thirteen typical classes. The effective potentials for the\ngravitational perturbations have more diverse behaviors than those in general\nrelativity, such as double peaks, the existence of the negative region adjacent\nto or far away from the event horizon, etc. These lead to the existence of\nunstable modes ($\\text{Im} \\omega<0$), and the presence of gravitational wave\nechoes. These rich phenomenons are inherent in Einstein-Gauss-Bonnet theory,\nrather than artificially introduced by hand. What's more, the (in)stability of\nquasinormal modes are studied in frequency domain and time domain,\nrespectively. For the frequency aspect, the pseudospectrum is used to account\nfor the instability of the spectrum. For the time domain, we add a small bump\nto the effective potential, and find that the new waveform does not differ\nsignificantly from the original one, where the comparison is characterized by\nthe so-called mismatch functions. This means that quasinormal modes are stable\nin time domain. In this way, our study reveals the non-equivalence of the\nstability of quasinormal modes in the frequency domain and the time domain. We\nalso numerically investigate Price's law at both finite distances and infinity\nwith the assistance of the hyperboloidal approach.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"LXV3adzPwkIGZ3J72xWHcLSwGPixx0NVJ71RHvYJ93U","pdfSize":"13354697"}