{"id":"2412.16393","title":"A Comprehensive Study of the Dust Declines in R Coronae Borealis Stars","authors":"Courtney L. Crawford, Jamie Soon, Geoffrey C. Clayton, Patrick\n  Tisserand, Timothy R. Bedding, Caleb J. Clark, Chung-Uk Lee","authorsParsed":[["Crawford","Courtney L.",""],["Soon","Jamie",""],["Clayton","Geoffrey C.",""],["Tisserand","Patrick",""],["Bedding","Timothy R.",""],["Clark","Caleb J.",""],["Lee","Chung-Uk",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 23:02:18 GMT"},{"version":"v2","created":"Tue, 4 Feb 2025 05:07:13 GMT"}],"updateDate":"2025-02-05","timestamp":1734735738000,"abstract":"  The R Coronae Borealis (RCB) variables are rare, hydrogen-deficient,\ncarbon-rich supergiants known for large, erratic declines in brightness due to\ndust formation. Recently, the number of known RCB stars in the Milky Way and\nMagellanic Clouds has increased from $\\sim$30 to 162. We use all-sky and\ntargeted photometric surveys to create the longest possible light curves for\nall known RCB stars and systematically study their declines. Our study, the\nlargest of its kind, includes measurements of decline activity levels,\nmorphologies, and periodicities for nearly all RCB stars. We confirm previous\npredictions that cool RCB stars exhibit more declines than warm RCBs,\nsupporting a relationship between dust formation and condensation temperatures.\nWe also find evidence for two distinct dust production mechanisms. R CrB and SU\nTau show decline onsets consistent with a Poisson process, suggesting their\ndust production is driven by stochastic processes, such as convection. In\ncontrast, RY Sgr's declines correlate with its pulsation period, suggesting\nthat its dust production is driven by pulsationally-induced shocks. Finally, we\nshow that the dust properties of the related class of DY~Per variables differ\nfrom those of the RCB stars, suggesting differences in their evolutionary\nstatus.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"kFhEi9e_TOJBIOVSKbysOcfrflOfDka3jzBoLNoenrQ","pdfSize":"3120196"}