{"id":"2412.03023","title":"A Multi-Functional Web Tool for Comprehensive Threat Detection Through\n  IP Address Analysis","authors":"Cebajel Tanan and Sameer G. Kulkarni and Tamal Das and Manjesh K.\n  Hanawal","authorsParsed":[["Tanan","Cebajel",""],["Kulkarni","Sameer G.",""],["Das","Tamal",""],["Hanawal","Manjesh K.",""]],"versions":[{"version":"v1","created":"Wed, 4 Dec 2024 04:29:12 GMT"}],"updateDate":"2024-12-05","timestamp":1733286552000,"abstract":"  In recent years, the advances in digitalisation have also adversely\ncontributed to the significant rise in cybercrimes. Hence, building the threat\nintelligence to shield against rising cybercrimes has become a fundamental\nrequisite. Internet Protocol (IP) addresses play a crucial role in the threat\nintelligence and prevention of cyber crimes. However, we have noticed the lack\nof one-stop, free, and open-source tools that can analyse IP addresses. Hence,\nthis work introduces a comprehensive web tool for advanced IP address\ncharacterisation. Our tool offers a wide range of features, including\ngeolocation, blocklist check, VPN detection, proxy detection, bot detection,\nTor detection, port scan, and accurate domain statistics that include the\ndetails about the name servers and registrar information. In addition, our tool\ncalculates a confidence score based on a weighted sum of publicly accessible\nonline results from different reliable sources to give users a dependable\nmeasure of accuracy. Further, to improve performance, our tool also\nincorporates a local database for caching the results, to enable fast content\nretrieval with minimal external Web API calls. Our tool supports domain names\nand IPv4 addresses, making it a multi-functional and powerful IP analyser tool\nfor threat intelligence. Our tool is available at www.ipanalyzer.in\n","subjects":["Computer Science/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"2cpmtRafstn4Hm4_UhGGCZ3JLUPHus_OxVqhdYAFupg","pdfSize":"613940"}