{"id":"2412.09668","title":"Vision-Language Models Represent Darker-Skinned Black Individuals as\n  More Homogeneous than Lighter-Skinned Black Individuals","authors":"Messi H.J. Lee, Soyeon Jeon","authorsParsed":[["Lee","Messi H. J.",""],["Jeon","Soyeon",""]],"versions":[{"version":"v1","created":"Thu, 12 Dec 2024 18:53:49 GMT"}],"updateDate":"2024-12-16","timestamp":1734029629000,"abstract":"  Vision-Language Models (VLMs) combine Large Language Model (LLM) capabilities\nwith image processing, enabling tasks like image captioning and text-to-image\ngeneration. Yet concerns persist about their potential to amplify human-like\nbiases, including skin tone bias. Skin tone bias, where darker-skinned\nindividuals face more negative stereotyping than lighter-skinned individuals,\nis well-documented in the social sciences but remains under-explored in\nArtificial Intelligence (AI), particularly in VLMs. While well-documented in\nthe social sciences, this bias remains under-explored in AI, particularly in\nVLMs. Using the GAN Face Database, we sampled computer-generated images of\nBlack American men and women, controlling for skin tone variations while\nkeeping other features constant. We then asked VLMs to write stories about\nthese faces and compared the homogeneity of the generated stories. Stories\ngenerated by VLMs about darker-skinned Black individuals were more homogeneous\nthan those about lighter-skinned individuals in three of four models, and Black\nwomen were consistently represented more homogeneously than Black men across\nall models. Interaction effects revealed a greater impact of skin tone on women\nin two VLMs, while the other two showed nonsignificant results, reflecting\nknown stereotyping patterns. These findings underscore the propagation of\nbiases from single-modality AI systems to multimodal models and highlight the\nneed for further research to address intersectional biases in AI.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"9jFJEk7quTSg1glL1KqKWgHYP_XffFkgApez_tLideI","pdfSize":"1269130"}