{"id":"2412.08335","title":"Broken time-reversal symmetry detected by tunneling spectroscopy of\n  superconducting Pd-doped CaAgP","authors":"Naoki Matsubara, Rikizo Yano, Kazushige Saigusa, Koshi Takenaka,\n  Yoshihiko Okamoto, Yukio Tanaka, Satoshi Kashiwaya","authorsParsed":[["Matsubara","Naoki",""],["Yano","Rikizo",""],["Saigusa","Kazushige",""],["Takenaka","Koshi",""],["Okamoto","Yoshihiko",""],["Tanaka","Yukio",""],["Kashiwaya","Satoshi",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 12:22:53 GMT"}],"updateDate":"2024-12-12","timestamp":1733919773000,"abstract":"  The appearance of broken time-reversal symmetry (TRS) in superconducting\nstates is an intriguing issue in solid-state physics because of the\nincompatibility of the spontaneous magnetic field and the Meissner effect. We\nidentify broken TRS in Pd-doped CaAgP (CaAg$_{0.9}$Pd$_{0.1}$P) by tunneling\nspectroscopy through the magnetic field response of conductance spectra.\nCaAg$_{0.9}$Pd$_{0.1}$P is a nodal-line semimetal with exotic electronic states\nsuch as drumhead surface states and surface superconductivity. Tunneling\nconductance spectra acquired at the side surfaces of CaAg$_{0.9}$Pd$_{0.1}$P\nunder an applied magnetic field exhibit broad zero-bias peaks with small\nasymmetric structures. Surprisingly, the asymmetric structures are reversed\nexactly by flipping the field direction. On the basis of an analysis which\nstands on the formula of tunneling junctions for unconventional\nsuperconductors, these results are consistent with the pair potential of the\nsuperconductivity breaks the TRS and is strongly coupled to an external\nmagnetic field. We reveal the novel character of superconducting nodal-line\nsemimetals by developing the TRS sensitivity of tunneling spectroscopy. Our\nresults serve as an exploration of broken TRS in superconducting states\nrealized in topological materials.\n","subjects":["Condensed Matter/Superconductivity"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"JDY5tSi5hZMvbLGpLI7xmzp-M4IoE_469RiIgb66zic","pdfSize":"3487181"}