{
  "id": "2412.18067",
  "title": "Automated Materials Discovery Platform Realized: Scanning Probe\n  Microscopy of Combinatorial Libraries",
  "authors": "Yu Liu, Rohit Pant, Ichiro Takeuchi, R. Jackson Spurling, Jon-Paul\n  Maria, Maxim Ziatdinov, and Sergei V. Kalinin",
  "authorsParsed": [
    [
      "Liu",
      "Yu",
      ""
    ],
    [
      "Pant",
      "Rohit",
      ""
    ],
    [
      "Takeuchi",
      "Ichiro",
      ""
    ],
    [
      "Spurling",
      "R. Jackson",
      ""
    ],
    [
      "Maria",
      "Jon-Paul",
      ""
    ],
    [
      "Ziatdinov",
      "Maxim",
      ""
    ],
    [
      "Kalinin",
      "Sergei V.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 24 Dec 2024 00:39:51 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1735000791000,
  "abstract": "  Combinatorial libraries are a powerful approach for exploring the evolution\nof physical properties across binary and ternary cross-sections in\nmulticomponent phase diagrams. Although the synthesis of these libraries has\nbeen developed since the 1960s and expedited with advanced laboratory\nautomation, the broader application of combinatorial libraries relies on fast,\nreliable measurements of concentration-dependent structures and\nfunctionalities. Scanning Probe Microscopies (SPM), including piezoresponse\nforce microscopy (PFM), offer significant potential for quantitative,\nfunctionally relevant combi-library readouts. Here we demonstrate the\nimplementation of fully automated SPM to explore the evolution of ferroelectric\nproperties in combinatorial libraries, focusing on Sm-doped BiFeO3 and\nZnxMg1-xO systems. We also present and compare Gaussian Process-based Bayesian\nOptimization models for fully automated exploration, emphasizing local\nreproducibility (effective noise) as an essential factor in optimal experiment\nworkflows. Automated SPM, when coupled with upstream synthesis controls, plays\na pivotal role in bridging materials synthesis and characterization.\n",
  "subjects": [
    "Condensed Matter/Materials Science",
    "Condensed Matter/Mesoscale and Nanoscale Physics",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "orFitcVlv6mtGpM54tQneMwX1jnOH4gncidgIgNImpw",
  "pdfSize": "1945875"
}