{
  "id": "2412.12507",
  "title": "3DGUT: Enabling Distorted Cameras and Secondary Rays in Gaussian\n  Splatting",
  "authors": "Qi Wu, Janick Martinez Esturo, Ashkan Mirzaei, Nicolas Moenne-Loccoz,\n  Zan Gojcic",
  "authorsParsed": [
    [
      "Wu",
      "Qi",
      ""
    ],
    [
      "Esturo",
      "Janick Martinez",
      ""
    ],
    [
      "Mirzaei",
      "Ashkan",
      ""
    ],
    [
      "Moenne-Loccoz",
      "Nicolas",
      ""
    ],
    [
      "Gojcic",
      "Zan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 03:21:25 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734405685000,
  "abstract": "  3D Gaussian Splatting (3DGS) has shown great potential for efficient\nreconstruction and high-fidelity real-time rendering of complex scenes on\nconsumer hardware. However, due to its rasterization-based formulation, 3DGS is\nconstrained to ideal pinhole cameras and lacks support for secondary lighting\neffects. Recent methods address these limitations by tracing volumetric\nparticles instead, however, this comes at the cost of significantly slower\nrendering speeds. In this work, we propose 3D Gaussian Unscented Transform\n(3DGUT), replacing the EWA splatting formulation in 3DGS with the Unscented\nTransform that approximates the particles through sigma points, which can be\nprojected exactly under any nonlinear projection function. This modification\nenables trivial support of distorted cameras with time dependent effects such\nas rolling shutter, while retaining the efficiency of rasterization.\nAdditionally, we align our rendering formulation with that of tracing-based\nmethods, enabling secondary ray tracing required to represent phenomena such as\nreflections and refraction within the same 3D representation.\n",
  "subjects": [
    "Computer Science/Graphics",
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "FdsWtGOJERJXEkOkMulypPZrR6ThXyamr7_mya_Cfsw",
  "pdfSize": "16702298"
}