{"id":"2412.08710","title":"The 3D morphology of open clusters in the solar neighborhood III:\n  Fractal dimension","authors":"Chang Qin, Xiaoying Pang, Mario Pasquato, M.B.N. Kouwenhoven,\n  Antonella Vallenari","authorsParsed":[["Qin","Chang",""],["Pang","Xiaoying",""],["Pasquato","Mario",""],["Kouwenhoven","M. B. N.",""],["Vallenari","Antonella",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 19:00:01 GMT"},{"version":"v2","created":"Sat, 14 Dec 2024 15:35:16 GMT"},{"version":"v3","created":"Mon, 30 Dec 2024 10:57:59 GMT"}],"updateDate":"2024-12-31","timestamp":1733943601000,"abstract":"  We analyze the fractal dimension of open clusters using 3D spatial data from\nGaia DR3 for 93 open clusters from Pang et al. (2024) and 127 open clusters\nfrom Hunt & Reffert (2024) within 500 pc. The box-counting method is adopted to\ncalculate the fractal dimension of each cluster in three regions: the\nall-member region, $r \\leq r_t$ (inside the tidal radius), and $r > r_t$\n(outside the tidal radius). In both the Pang and Hunt catalogs, the fractal\ndimensions are smaller for the regions $r > r_t$ than those for $r \\leq r_t$,\nindicating that the stellar distribution is more clumpy in the cluster\noutskirts. We classify cluster morphology based on the fractal dimension via\nthe Gaussian Mixture Model. Our study shows that the fractal dimension can\nefficiently classify clusters in the Pang catalog into two groups. The fractal\ndimension of the clusters in the Pang catalog declines with age, which is\nattributed to the development of tidal tails. This is consistent with the\nexpectations from the dynamical evolution of open clusters. We find strong\nevidence that the fractal dimension increases with cluster mass, which implies\nthat higher-mass clusters are formed hierarchically from the mergers of\nlower-mass filamentary-type stellar groups. The transition of the fractal\ndimension for the spatial distribution of open clusters provides a useful tool\nto trace the Galactic star forming structures, from the location of the Local\nBubble within the solar neighborhood to the spiral arms across the Galaxy.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_rZfPDtkjNm4FCCdx9fBnQ8me-Rpl5UAYXGNr2ClA6g","pdfSize":"928171"}