{"id":"2412.07678","title":"Can linguists better understand DNA?","authors":"Wang Liang","authorsParsed":[["Liang","Wang",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 17:06:33 GMT"},{"version":"v2","created":"Thu, 16 Jan 2025 14:33:40 GMT"},{"version":"v3","created":"Fri, 17 Jan 2025 08:54:50 GMT"}],"updateDate":"2025-01-20","timestamp":1733850393000,"abstract":"  Multilingual transfer ability, which reflects how well models fine-tuned on\none source language can be applied to other languages, has been well studied in\nmultilingual pre-trained models. However, the existence of such capability\ntransfer between natural language and gene sequences/languages remains under\nexplored.This study addresses this gap by drawing inspiration from the\nsentence-pair classification task used for evaluating sentence similarity in\nnatural language. We constructed two analogous tasks: DNA-pair\nclassification(DNA sequence similarity) and DNA-protein-pair\nclassification(gene coding determination). These tasks were designed to\nvalidate the transferability of capabilities from natural language to gene\nsequences. Even a small-scale pre-trained model like GPT-2-small, which was\npre-trained on English, achieved an accuracy of 78% on the DNA-pair\nclassification task after being fine-tuned on English sentence-pair\nclassification data(XTREME PAWS-X). While training a BERT model on multilingual\ntext, the precision reached 89%. On the more complex DNA-protein-pair\nclassification task, however, the model's output was barely distinguishable\nfrom random output.Experimental validation has confirmed that the transfer of\ncapabilities from natural language to biological language is unequivocally\npresent. Building on this foundation, we have also investigated the impact of\nmodel parameter scale and pre-training on this capability transfer. We provide\nrecommendations for facilitating the transfer of capabilities from natural\nlanguage to genetic language,as well as new approaches for conducting\nbiological research based on this capability.This study offers an intriguing\nnew perspective on exploring the relationship between natural language and\ngenetic language.\n","subjects":["Computer Science/Computation and Language","Quantitative Biology/Genomics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"lkDk12mAXoHxiRPa21l-aIW6QP39fv5rDBooUKYEEAs","pdfSize":"765812"}