{
  "id": "2412.06217",
  "title": "Large Bidirectional Refractive Index Change in Silicon-rich Nitride via\n  Visible Light Trimming",
  "authors": "Dmitrii Belogolovskii, Md Masudur Rahman, Karl Johnson, Vladimir\n  Fedorov, Andrew Grieco, Nikola Alic, Abdoulaye Ndao, Paul K. L. Yu, Yeshaiahu\n  Fainman",
  "authorsParsed": [
    [
      "Belogolovskii",
      "Dmitrii",
      ""
    ],
    [
      "Rahman",
      "Md Masudur",
      ""
    ],
    [
      "Johnson",
      "Karl",
      ""
    ],
    [
      "Fedorov",
      "Vladimir",
      ""
    ],
    [
      "Grieco",
      "Andrew",
      ""
    ],
    [
      "Alic",
      "Nikola",
      ""
    ],
    [
      "Ndao",
      "Abdoulaye",
      ""
    ],
    [
      "Yu",
      "Paul K. L.",
      ""
    ],
    [
      "Fainman",
      "Yeshaiahu",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 05:27:21 GMT"
    },
    {
      "version": "v2",
      "created": "Sun, 16 Feb 2025 02:00:02 GMT"
    }
  ],
  "updateDate": "2025-02-18",
  "timestamp": 1733722041000,
  "abstract": "  Phase-sensitive integrated photonic devices are highly susceptible to minor\nmanufacturing deviations, resulting in significant performance inconsistencies.\nThis variability has limited the scalability and widespread adoption of these\ndevices. Here, a major advancement is achieved through continuous-wave (CW)\nvisible light (405 nm and 520 nm) trimming of plasma-enhanced chemical vapor\ndeposition (PECVD) silicon-rich nitride (SRN) waveguides. The demonstrated\nmethod achieves precise, bidirectional refractive index tuning with a single\nlaser source in CMOS-compatible SRN samples with refractive indices of 2.4 and\n2.9 (measured at 1550 nm). By utilizing a cost-effective setup for real-time\nresonance tracking in micro-ring resonators, the resonant wavelength shifts as\nfine as 10 pm are attained. Additionally, a record red shift of 49.1 nm and a\nsubstantial blue shift of 10.6 nm are demonstrated, corresponding to refractive\nindex changes of approximately 0.11 and -0.02. The blue and red shifts are both\nconclusively attributed to thermal annealing. These results highlight SRN's\nexceptional capability for permanent optical tuning, establishing a foundation\nfor stable, precisely controlled performance in phase-sensitive integrated\nphotonic devices.\n",
  "subjects": [
    "Physics/Optics",
    "Physics/Applied Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "umAnKZtq0ZjWei0D7MoS7MI6lhKOI1Dn-YtdsTP4aDU",
  "pdfSize": "21751289"
}