{
  "id": "2412.18494",
  "title": "Topological phases protected by projective PT symmetry in\n  alkaline-earth-like atoms",
  "authors": "Xiaofan Zhou, Suotang Jia, and Jian-Song Pan",
  "authorsParsed": [
    [
      "Zhou",
      "Xiaofan",
      ""
    ],
    [
      "Jia",
      "Suotang",
      ""
    ],
    [
      "Pan",
      "Jian-Song",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 24 Dec 2024 15:25:04 GMT"
    }
  ],
  "updateDate": "2024-12-25",
  "timestamp": 1735053904000,
  "abstract": "  An important aspect in categorizing topological phases is whether the system\nis spinless or spinful, given that these classes exhibit distinct symmetry\nalgebras, leading to disparate topological classifications. By utilizing the\nprojective presentation strategy, the topological phases of spinless (or\nspinful) systems can be emulated using spinful (or spinless) systems augmented\nwith gauge fields. In this study, we propose to implement the topological\nphases safeguarded by the unique projective space-time (PT) symmetry inherent\nto spinful models, using synthetic spinless alkaline-earth-like atoms.\nEmploying the separation of orbital and nuclear-spin degrees of freedom, the\nmodel is configured as a rectangular tube penetrated by a uniform magnetic flux\nthrough each plaquette, which simulates a spinless ladder endowed with\nprojective PT symmetry satisfying the algebraic properties of a spinful model.\nFor interacting topological phases with inter-orbital spin-exchange\ninteractions, which also adhere to PT symmetry, the four-fold degeneracy of\nedge modes is split into two pairs of edge modes with two-fold degeneracy. We\nmap the complete phase diagram in the end and discover that these interacting\ntopological phases ultimately evolve into distinct charge-density-wave phases\nvia spontaneous symmetry breaking.\n",
  "subjects": [
    "Condensed Matter/Quantum Gases"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "4ox80s3q7osG-fIyMN2xjx2vJRvupXHx8dZmt3lk1vE",
  "pdfSize": "975313"
}