{"id":"2412.12611","title":"Observing Li Nucleation at Li Metal-Solid Electrolyte Interface in\n  All-Solid-State Batteries","authors":"Yun An, Taiping Hu, Quanquan Pang, and Shenzhen Xu","authorsParsed":[["An","Yun",""],["Hu","Taiping",""],["Pang","Quanquan",""],["Xu","Shenzhen",""]],"versions":[{"version":"v1","created":"Tue, 17 Dec 2024 07:19:50 GMT"}],"updateDate":"2024-12-18","timestamp":1734419990000,"abstract":"  Benefiting from the significantly improved energy density and safety,\nall-solid-state lithium batteries (ASSLBs) are considered one of the most\npromising next-generation energy technologies. Their practical applications,\nhowever, are strongly impeded by the Li dendrite formation. Despite this\nrecognized challenge, a comprehensive understanding of Li dendrite nucleation\nand formation mechanism remains elusive. In particular, the initial locations\nof Li dendrite formation are still ambiguous: do Li clusters form directly at\nthe Li anode surface, or inside the bulk solid electrolyte (SE), or within the\nsolid-electrolyte interphase (SEI)? Here, based on the deep-potential molecular\ndynamics simulations combined with enhanced sampling techniques, we investigate\nthe atomic-level mechanism of Li cluster nucleation and formation at the Li\nanode/SE interface. We observe that an isolated Li cluster initially forms\ninside the SEI between the Li6PS5Cl SE and the Li metal anode, located ~1 nm\naway from the Li anode/SEI boundary. The local electronic structure of the\nspontaneously formed SEI is found to be a key factor enabling the Li cluster\nformation within SEI, in which a significantly decreased bandgap could\nfacilitate electronic conduction through the SEI and reduce Li+ ions to\nmetallic Li atoms therein. Our work therefore provides atomic-level insights\ninto Li-dendrite nucleation at anode/SE interfaces in ASSLBs, and could guide\nfuture design for developing Li-dendrite-inhibiting strategies.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Xtqzinbz6wA_KkxxAfv0MGURV6erlyFChz2ZF_fvJio","pdfSize":"2218856"}