{
  "id": "2412.14064",
  "title": "Oscillators with imaginary coupling: spectral functions in quantum\n  mechanics and quantum field theory",
  "authors": "Bruno W. Mintz and Itai Y. Pinheiro and Rui Aquino",
  "authorsParsed": [
    [
      "Mintz",
      "Bruno W.",
      ""
    ],
    [
      "Pinheiro",
      "Itai Y.",
      ""
    ],
    [
      "Aquino",
      "Rui",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 18 Dec 2024 17:09:30 GMT"
    }
  ],
  "updateDate": "2024-12-19",
  "timestamp": 1734541770000,
  "abstract": "  The axioms of Quantum Mechanics require that the hamiltonian of any closed\nsystem is self-adjoint, so that energy levels are real and time evolution\npreserves probability. On the other hand, non-hermitian hamiltonians with\n${\\cal{PT}}$-symmetry can have both real spectra and unitary time evolution. In\nthis paper, we study in detail a pair of quantum oscillators coupled by an\nimaginary bilinear term, both in quantum mechanics and in quantum field theory.\nWe discuss explicitly how such hamiltonians lead to perfectly sound physical\ntheories with real spectra and unitary time evolution, in spite of their\nnon-hermiticity. We also analyze two-point correlation functions and their\nassociated K\\\"allen-Lehmann representation. In particular, we discuss the\nintimate relation between positivity violation of the spectral functions and\nthe non-observability of operators in a given correlation function. Finally, we\nconjecture that positivity violation of some spectral functions of the theory\ncould be a generic sign of the existence of complex pairs of energy eigenvalues\n(i.e., a ${\\cal{PT}}$-broken phase) somewhere in its parameter space.\n",
  "subjects": [
    "Physics/Quantum Physics",
    "Condensed Matter/Strongly Correlated Electrons",
    "Physics/High Energy Physics - Phenomenology"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "WYxXtseK7qL-kycFzeHC1t4_3mPoYlUgz8YoGnwt_kw",
  "pdfSize": "322079"
}