{"id":"2412.03985","title":"Design, Characterization, and Validation of a Variable Stiffness\n  Prosthetic Elbow","authors":"Giuseppe Milazzo, Simon Lemerle, Giorgio Grioli, Antonio Bicchi, and\n  Manuel G. Catalano","authorsParsed":[["Milazzo","Giuseppe",""],["Lemerle","Simon",""],["Grioli","Giorgio",""],["Bicchi","Antonio",""],["Catalano","Manuel G.",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 09:02:42 GMT"}],"updateDate":"2024-12-09","timestamp":1733389362000,"abstract":"  Intuitively, prostheses with user-controllable stiffness could mimic the\nintrinsic behavior of the human musculoskeletal system, promoting safe and\nnatural interactions and task adaptability in real-world scenarios. However,\nprosthetic design often disregards compliance because of the additional\ncomplexity, weight, and needed control channels. This paper focuses on\ndesigning a Variable Stiffness Actuator (VSA) with weight, size, and\nperformance compatible with prosthetic applications, addressing its\nimplementation for the elbow joint. While a direct biomimetic approach suggests\nadopting an Agonist-Antagonist (AA) layout to replicate the biceps and triceps\nbrachii with elastic actuation, this solution is not optimal to accommodate the\nvaried morphologies of residual limbs. Instead, we employed the AA layout to\ncraft an elbow prosthesis fully contained in the user's forearm, catering to\nindividuals with distal transhumeral amputations. Additionally, we introduce a\nvariant of this design where the two motors are split in the upper arm and\nforearm to distribute mass and volume more evenly along the bionic limb,\nenhancing comfort for patients with more proximal amputation levels. We\ncharacterize and validate our approach, demonstrating that both architectures\nmeet the target requirements for an elbow prosthesis. The system attains the\ndesired 120{\\deg} range of motion, achieves the target stiffness range of [2,\n60] Nm/rad, and can actively lift up to 3 kg. Our novel design reduces weight\nby up to 50% compared to existing VSAs for elbow prostheses while achieving\nperformance comparable to the state of the art. Case studies suggest that\npassive and variable compliance could enable robust and safe interactions and\ntask adaptability in the real world.\n","subjects":["Computer Science/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"c8Nv21u0HzadAhr80kzW-JA8x0s0q-EhYmr7_afbocc","pdfSize":"46288234"}