{"id":"2412.07838","title":"Numerical evidence for the non-Abelian eigenstate thermalization\n  hypothesis","authors":"Aleksander Lasek and Jae Dong Noh and Jade LeSchack and Nicole Yunger\n  Halpern","authorsParsed":[["Lasek","Aleksander",""],["Noh","Jae Dong",""],["LeSchack","Jade",""],["Halpern","Nicole Yunger",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 19:00:01 GMT"}],"updateDate":"2024-12-12","timestamp":1733857201000,"abstract":"  The eigenstate thermalization hypothesis (ETH) explains how generic quantum\nmany-body systems thermalize internally. It implies that local operators'\ntime-averaged expectation values approximately equal their thermal expectation\nvalues, regardless of microscopic details. The ETH's range of applicability\ntherefore impacts theory and experiments. Murthy $\\textit{et al.}$ recently\nshowed that non-Abelian symmetries conflict with the ETH. Such symmetries have\nexcited interest in quantum thermodynamics lately, as they are equivalent to\nconserved quantities that fail to commute with each other and noncommutation is\na quintessentially quantum phenomenon. Murthy $\\textit{et al.}$ proposed a\nnon-Abelian ETH, which we support numerically. The numerics model a\none-dimensional (1D) next-nearest-neighbor Heisenberg chain of up to 18 qubits.\nWe represent local operators with matrices relative to an energy eigenbasis.\nThe matrices bear out seven predictions of the non-Abelian ETH. We also prove\nanalytically that the non-Abelian ETH exhibits a self-consistency property. The\nproof relies on a thermodynamic-entropy definition different from that in\nMurthy $\\textit{et al.}$ This work initiates the observation and application of\nthe non-Abelian ETH.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Quantum Gases","Condensed Matter/Statistical Mechanics","Condensed Matter/Strongly Correlated Electrons","Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"zQblfGLd1Ov_MJv1fJhTZQXI14NzJ6sTYZviHgtYAso","pdfSize":"4968689"}