{"id":"2412.04217","title":"Aligned Music Notation and Lyrics Transcription","authors":"Eliseo Fuentes-Mart\\'inez, Antonio R\\'ios-Vila, Juan C.\n  Martinez-Sevilla, David Rizo, Jorge Calvo-Zaragoza","authorsParsed":[["Fuentes-Martínez","Eliseo",""],["Ríos-Vila","Antonio",""],["Martinez-Sevilla","Juan C.",""],["Rizo","David",""],["Calvo-Zaragoza","Jorge",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 14:50:11 GMT"}],"updateDate":"2024-12-06","timestamp":1733410211000,"abstract":"  The digitization of vocal music scores presents unique challenges that go\nbeyond traditional Optical Music Recognition (OMR) and Optical Character\nRecognition (OCR), as it necessitates preserving the critical alignment between\nmusic notation and lyrics. This alignment is essential for proper\ninterpretation and processing in practical applications. This paper introduces\nand formalizes, for the first time, the Aligned Music Notation and Lyrics\nTranscription (AMNLT) challenge, which addresses the complete transcription of\nvocal scores by jointly considering music symbols, lyrics, and their\nsynchronization. We analyze different approaches to address this challenge,\nranging from traditional divide-and-conquer methods that handle music and\nlyrics separately, to novel end-to-end solutions including direct\ntranscription, unfolding mechanisms, and language modeling. To evaluate these\nmethods, we introduce four datasets of Gregorian chants, comprising both real\nand synthetic sources, along with custom metrics specifically designed to\nassess both transcription and alignment accuracy. Our experimental results\ndemonstrate that end-to-end approaches generally outperform heuristic methods\nin the alignment challenge, with language models showing particular promise in\nscenarios where sufficient training data is available. This work establishes\nthe first comprehensive framework for AMNLT, providing both theoretical\nfoundations and practical solutions for preserving and digitizing vocal music\nheritage.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"hethMY48BboWd5AlNic4tu-x-qXB31qj1tG3v11LFNI","pdfSize":"7388008"}