{
  "id": "2412.06336",
  "title": "A Combined Channel Approach for Decoding Intracranial EEG Signals:\n  Enhancing Accuracy through Spatial Information Integration",
  "authors": "Maryam Ostadsharif Memar and Navid Ziaei and Behzad Nazari",
  "authorsParsed": [
    [
      "Memar",
      "Maryam Ostadsharif",
      ""
    ],
    [
      "Ziaei",
      "Navid",
      ""
    ],
    [
      "Nazari",
      "Behzad",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 09:37:17 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733737037000,
  "abstract": "  Intracranial EEG (iEEG) recording, characterized by high spatial and temporal\nresolution and superior signal-to-noise ratio (SNR), enables the development of\nprecise brain-computer interface (BCI) systems for neural decoding. However,\nthe invasive nature of the procedure significantly limits the availability of\niEEG datasets in terms of both the number of participants and the duration of\nrecorded sessions. To address this limitation, we propose a single-participant\nmachine learning model optimized for decoding iEEG signals. The model employs\n18 key features and operates in two modes: best channel and combined channel.\nThe combined channel mode integrates spatial information from multiple brain\nregions, leading to superior classification performance. Evaluations across\nthree datasets -- Music Reconstruction, Audio Visual, and AJILE12 --\ndemonstrate that the combined channel mode consistently outperforms the best\nchannel mode across all classifiers. In the best-performing cases, Random\nForest achieved an F1 score of 0.81 +/- 0.05 in the Music Reconstruction\ndataset and 0.82 +/- 0.10 in the Audio Visual dataset, while XGBoost achieved\nan F1 score of 0.84 +/- 0.08 in the AJILE12 dataset. Furthermore, the analysis\nof brain region contributions in the combined channel mode revealed that the\nmodel identifies relevant brain regions aligned with physiological expectations\nfor each task and effectively combines data from electrodes in these regions to\nachieve high performance. These findings highlight the potential of integrating\nspatial information across brain regions to improve task decoding, offering new\navenues for advancing BCI systems and neurotechnological applications.\n",
  "subjects": [
    "Computer Science/Human-Computer Interaction",
    "Electrical Engineering and Systems Science/Signal Processing"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "s055GjQwjdO6JevV2ZoYDFuoC-MQ-JudtwLPbqSnsoE",
  "pdfSize": "754760"
}