{"id":"2412.11361","title":"Electrostatic forces from reactive molecular orbitals driving chemical\n  reactions","authors":"Takao Tsuneda and Tetsuya Taketsugu","authorsParsed":[["Tsuneda","Takao",""],["Taketsugu","Tetsuya",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 01:23:59 GMT"}],"updateDate":"2024-12-17","timestamp":1734312239000,"abstract":"  This study offers a physics-based framework for understanding chemical\nreactions, unveiling the pivotal role of the occupied reactive orbital (ORO),\nthe most stabilized occupied molecular orbital during a reaction, in driving\natomic nuclei along the reaction pathway via electrostatic forces. We show that\nthese electrostatic forces are governed by the negative gradient of orbital\nenergy, establishing a direct link between molecular orbital energy variations\nand nuclear motion. The forces generated by OROs, termed reactive-orbital-based\nelectrostatic forces (ROEFs), were systematically analyzed across 48\nrepresentative reactions. Our findings reveal that reactions can be classified\ninto four distinct types, with two dominant types emerging: those that maintain\nreaction-direction ROEFs either from the early stages or immediately preceding\nthe transition state. These ROEFs carve distinct grooves along the intrinsic\nreaction coordinates on the potential energy surface, shaping the reaction\npathway. Notably, ORO variations align directly with the curly arrow diagrams\nwidely employed in organic chemistry, bridging the curly arrow-like\nrepresentation of electron transfer with the rigorous potential energy surface\nframework. This connection highlights the integration of electronic and nuclear\nmotion theories, offering a unified perspective on the forces that drive\nchemical transformations. By linking orbital energy variations to nuclear\nmotions, this study establishes a robust framework for understanding the\ninterplay between electronic structure and reaction mechanisms.\n","subjects":["Physics/Chemical Physics","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"Z5NW_TUmN11z1hIGF87DZJLsSCBrI_busIdEf1_wg8Q","pdfSize":"2204672"}