{"id":"2412.06766","title":"Testing Mutual Independence in Metric Spaces Using Distance Profiles","authors":"Yaqing Chen and Paromita Dubey","authorsParsed":[["Chen","Yaqing",""],["Dubey","Paromita",""]],"versions":[{"version":"v1","created":"Mon, 9 Dec 2024 18:55:05 GMT"},{"version":"v2","created":"Sat, 25 Jan 2025 01:46:40 GMT"}],"updateDate":"2025-01-28","timestamp":1733770505000,"abstract":"  This paper introduces a novel unified framework for testing mutual\nindependence among a vector of random objects that may reside in different\nmetric spaces, including some existing methodologies as special cases. The\nbackbone of the proposed tests is the notion of joint distance profiles, which\nuniquely characterize the joint law of random objects under a mild condition on\nthe joint law or on the metric spaces. Our test statistics measure the\ndifference of the joint distance profiles of each data point with respect to\nthe joint law and the product of marginal laws of the vector of random objects,\nwhere flexible data-adaptive weight profiles are incorporated for power\nenhancement. We derive the limiting distribution of the test statistics under\nthe null hypothesis of mutual independence and show that the proposed tests\nwith specific weight profiles are asymptotically distribution-free if the\nmarginal distance profiles are continuous. We also establish the consistency of\nthe tests under sequences of alternative hypotheses converging to the null.\nFurthermore, since the asymptotic tests with non-trivial weight profiles\nrequire the knowledge of the underlying data distribution, we adopt a\npermutation scheme to approximate the $p$-values and provide theoretical\nguarantees that the permutation-based tests control the type I error rate under\nthe null and are consistent under the alternatives. We demonstrate the power of\nthe proposed tests across various types of data objects through simulations and\nreal data applications, where our tests are shown to have superior performance\ncompared with popular existing approaches.\n","subjects":["Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"6OVb2qoLfw55-GnLcx6dToX_hGkZ0QH7teQ1iUeDAO0","pdfSize":"607047"}