{
  "id": "2412.11844",
  "title": "Modelling chemical clocks -- Theoretical evidences of the space and time\n  evolution of [s/alpha] in the Galactic disc with Gaia-ESO survey",
  "authors": "Marta Molero, Laura Magrini, Marco Palla, Gabriele Cescutti, Carlos\n  Viscasillas V\\'azquez, Giada Casali, Emanuele Spitoni, Francesca Matteucci,\n  Sofia Randich",
  "authorsParsed": [
    [
      "Molero",
      "Marta",
      ""
    ],
    [
      "Magrini",
      "Laura",
      ""
    ],
    [
      "Palla",
      "Marco",
      ""
    ],
    [
      "Cescutti",
      "Gabriele",
      ""
    ],
    [
      "Vázquez",
      "Carlos Viscasillas",
      ""
    ],
    [
      "Casali",
      "Giada",
      ""
    ],
    [
      "Spitoni",
      "Emanuele",
      ""
    ],
    [
      "Matteucci",
      "Francesca",
      ""
    ],
    [
      "Randich",
      "Sofia",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 15:08:14 GMT"
    }
  ],
  "updateDate": "2025-02-26",
  "timestamp": 1734361694000,
  "abstract": "  Chemical clocks based on [s-process elements/alpha-elements] ratios are\nwidely used to estimate ages of Galactic stellar populations. However, the\n[s/alpha] vs. age relations are not universal, varying with metallicity,\nlocation in the Galactic disc, and specific s-process elements. Current\nGalactic chemical evolution models struggle to reproduce the observed [s/alpha]\nincrease at young ages. We provide chemical evolution models for the Milky Way\ndisc to identify the conditions required to reproduce the observed [s/H],\n[s/Fe], and [s/alpha] vs. age relations. We adopt a multi-zone chemical\nevolution model including state-of-the-art nucleosynthesis prescriptions for\nneutron-capture elements (AGB stars, rotating massive stars, neutron star\nmergers, magneto-driven supernovae). We explore variations in gas infall, AGB\nyield dependencies on progenitor stars, and rotational velocity distributions\nfor massive stars. Results are compared with open cluster data from the\nGaia-ESO survey. A three-infall scenario for disc formation captures the rise\nof [s/alpha] with age in the outer regions but fails in the inner ones,\nespecially for second s-process peak elements. Ba production in the last 3 Gyr\nof chemical evolution would need to increase by half to match observations.\nS-process contributions from low-mass AGB stars improve predictions but require\nincreases not supported by nucleosynthesis calculations, even with potential\ni-process contribution. Variations in the metallicity dependence of AGB yields\nshow inconsistent effects across elements. Distributions of massive star\nrotational velocities fail to improve results due to balanced effects on\nelements. We confirm that there is no single relationship [s/alpha] vs. age,\nbut that it varies along the MW disc. Current prescriptions for neutron-capture\nelement yields cannot fully capture the complexity of evolution, particularly\nin the inner disc.\n",
  "subjects": [
    "Astrophysics/Astrophysics of Galaxies",
    "Astrophysics/Solar and Stellar Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "OHP4-snKCsDCx84QpvEZ6etP0vOvNuIPq4Z4t5Oc1wA",
  "pdfSize": "1858958"
}