{"id":"2412.03174","title":"Resilient Timed Elastic Band Planner for Collision-Free Navigation in\n  Unknown Environments","authors":"Geesara Kulathunga, Abdurrahman Yilmaz, Zhuoling Huang, Ibrahim Hroob,\n  Hariharan Arunachalam, Leonardo Guevara, Alexandr Klimchik, Grzegorz\n  Cielniak, Marc Hanheide","authorsParsed":[["Kulathunga","Geesara",""],["Yilmaz","Abdurrahman",""],["Huang","Zhuoling",""],["Hroob","Ibrahim",""],["Arunachalam","Hariharan",""],["Guevara","Leonardo",""],["Klimchik","Alexandr",""],["Cielniak","Grzegorz",""],["Hanheide","Marc",""]],"versions":[{"version":"v1","created":"Wed, 4 Dec 2024 09:54:48 GMT"}],"updateDate":"2024-12-05","timestamp":1733306088000,"abstract":"  In autonomous navigation, trajectory replanning, refinement, and control\ncommand generation are essential for effective motion planning. This paper\npresents a resilient approach to trajectory replanning addressing scenarios\nwhere the initial planner's solution becomes infeasible. The proposed method\nincorporates a hybrid A* algorithm to generate feasible trajectories when the\nprimary planner fails and applies a soft constraints-based smoothing technique\nto refine these trajectories, ensuring continuity, obstacle avoidance, and\nkinematic feasibility. Obstacle constraints are modelled using a dynamic\nVoronoi map to improve navigation through narrow passages. This approach\nenhances the consistency of trajectory planning, speeds up convergence, and\nmeets real-time computational requirements. In environments with around 30\\% or\nhigher obstacle density, the ratio of free space before and after placing new\nobstacles, the Resilient Timed Elastic Band (RTEB) planner achieves\napproximately 20\\% reduction in traverse distance, traverse time, and control\neffort compared to the Timed Elastic Band (TEB) planner and Nonlinear Model\nPredictive Control (NMPC) planner. These improvements demonstrate the RTEB\nplanner's potential for application in field robotics, particularly in\nagricultural and industrial environments, where navigating unstructured terrain\nis crucial for ensuring efficiency and operational resilience.\n","subjects":["Computer Science/Robotics","Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"FvMxLx-6mAChK52zaRAg6lx6IjYrSCQ_AAyLWrIxoc4","pdfSize":"8412488"}