{"id":"2412.08497","title":"Time discretization of Quadratic Forward-Backward SDEs with singular\n  drifts","authors":"Rhoss Likibi Pellat, Emmanuel Che Fonka and Olivier Menoukeu Pamen","authorsParsed":[["Pellat","Rhoss Likibi",""],["Fonka","Emmanuel Che",""],["Pamen","Olivier Menoukeu",""]],"versions":[{"version":"v1","created":"Wed, 11 Dec 2024 16:00:56 GMT"}],"updateDate":"2024-12-12","timestamp":1733932856000,"abstract":"  We investigate the convergence rate for the time discretization of a class of\nquadratic backward SDEs -- potentially involving path-dependent terminal values\n-- when coupled with non-standard Lipschitz-type forward SDEs. In our review of\nthe explicit time-discretization schemes in the spirit of Pag\\`es \\& Sagna (see\n\\cite{PaSa18}), we achieve an error control close to $\\frac{1}{2}$, even under\nthe modest assumptions considered in this work (see \\cite{ChaRichou16}, for\ncomparison). A central element of our approach is a thorough re-examination of\nZhang's $L^2\\text{-time regularity}$ of the martingale integrand $Z$ which\nfollows from an extension of the first-order variational regularity for this\nclass of singular forward-backward SDEs with non-uniform Cauchy-Lipschitz\ndrivers. This is complemented by the recently introduced caracterisation of\nstochastic processes of {\\it bounded mean oscillation} (abbreviated as $\\bmo$)\nby K. L\\^e (see \\cite{Le22}) which we used to derive an $L^p\\text{-version}$ of\nthe strong approximation of SDEs with singular drifts from Dareiotis \\&\nGerencs\\'er (see \\cite{DaGe20}). As such, this study addresses a crucial gap in\nthe numerical analysis of forward-backward SDEs (FBSDEs). To our knowledge, for\nthe first time, the impact of regularization by noise on Euler-Maruyama\nnumerical schemes for singular forward SDEs has been successfully transferred\nto enhance the convergence rate of the discrete time approximations for\nsolutions to backward SDEs.\n","subjects":["Mathematics/Probability"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0S0zEyey03dvIknLptYOZKL3T_4w5UcBDZ1gKDXWVuY","pdfSize":"692059"}