{"id":"2412.02374","title":"Wandering and escaping: recoiling massive black holes in cosmological\n  simulations","authors":"Chi An Dong-P\\'aez, Marta Volonteri, Yohan Dubois, Ricarda S.\n  Beckmann, Maxime Trebitsch","authorsParsed":[["Dong-Páez","Chi An",""],["Volonteri","Marta",""],["Dubois","Yohan",""],["Beckmann","Ricarda S.",""],["Trebitsch","Maxime",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 11:00:44 GMT"}],"updateDate":"2024-12-04","timestamp":1733223644000,"abstract":"  After a merger of two massive black holes (MBHs), the remnant receives a\ngravitational wave (GW) recoil kick that can have a strong effect on its future\nevolution. The magnitude of the kick ($v_\\mathrm{recoil}$) depends on the mass\nratio and the alignment of the spins and orbital angular momenta, therefore on\nthe previous evolution of the MBHs. We investigate the cosmic effect of GW\nrecoil by running for the first time a high-resolution cosmological simulation\nincluding GW recoil that depends on the MBH spins (evolved through accretion\nand mergers), masses and dynamics computed self-consistently. We also run a\ntwin simulation without GW recoil. The simulations are run down to $z=4.4$. We\nfind that GW recoil reduces the growth of merger remnants, and can have a\nsignificant effect on the MBH-galaxy correlations and the merger rate. We find\nlarge recoil kicks across all galaxy masses in the simulation, up to a few\n$10^{11}\\,\\rm M_\\odot$. The effect of recoil can be significant even if the\nMBHs are embedded in a rotationally supported gaseous structure. We investigate\nthe dynamics of recoiling MBHs and find that MBHs remain in the centre of the\nhost galaxy for low $v_\\mathrm{recoil}/v_\\mathrm{esc}$ and escape rapidly for\nhigh $v_\\mathrm{recoil}/v_\\mathrm{esc}$. Only if $v_\\mathrm{recoil}$ is\ncomparable to $v_\\mathrm{esc}$ the MBHs escape the central region of the galaxy\nbut might remain as wandering MBHs until the end of the simulation. Recoiling\nMBHs are a significant fraction of the wandering MBH population. Although the\ndynamics of recoiling MBHs may be complex, some retain their initial radial\norbits but are difficult to discern from other wandering MBHs on radial orbits.\nOthers scatter with the halo substructure or circularise in the asymmetric\npotential. Our work highlights the importance of including GW recoil in\ncosmological simulation models.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7I2LzaUP3QKhkwIGyD2WrWzJaayoTYWz-aGk0hNBMIM","pdfSize":"2531732"}