{
  "id": "2412.07560",
  "title": "Classification of Single Photons in Higher-Order Spatial Modes via\n  Convolutional Neural Networks",
  "authors": "Manon P. Bart, Sita Dawanse, Nicholas J. Savino, Viet Tran, Tianhong\n  Wang, Sanjaya Lohani, Farris Nefissi, Pascal Bass\\`ene, Moussa N'Gom, Ryan T.\n  Glasser",
  "authorsParsed": [
    [
      "Bart",
      "Manon P.",
      ""
    ],
    [
      "Dawanse",
      "Sita",
      ""
    ],
    [
      "Savino",
      "Nicholas J.",
      ""
    ],
    [
      "Tran",
      "Viet",
      ""
    ],
    [
      "Wang",
      "Tianhong",
      ""
    ],
    [
      "Lohani",
      "Sanjaya",
      ""
    ],
    [
      "Nefissi",
      "Farris",
      ""
    ],
    [
      "Bassène",
      "Pascal",
      ""
    ],
    [
      "N'Gom",
      "Moussa",
      ""
    ],
    [
      "Glasser",
      "Ryan T.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 14:49:19 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733842159000,
  "abstract": "  Spatial modes are a promising candidate for encoding information for\nclassical and quantum optical communication due to their potential high\ninformation capacity. Unfortunately, compensation of the wavefront upon\npropagation through the atmosphere is necessary to benefit from advantages\nspatial modes offer. In this work, we leverage the success of convolutional\nnetworks in denoising and classifying images to improve information transfer of\nspatial modes. Hermite-Gauss, Laguerre-Gauss, and Ince-Gauss modes are\nexperimentally generated using single photons and imaged. A denoising\nautoencoder corrects for turbulence effects on the wavefront, followed by a\nconvolutional neural network to classify mode orders. The model achieves a\n99.2% classification accuracy across all modes, and Hermite-Gauss modes\nexhibited the highest individual mode accuracy. As the convolutional networks\nrely solely on intensity, they offer an efficient and cost-effective tool for\noptical communication systems in the single photon limit.\n",
  "subjects": [
    "Physics/Optics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "5aesXQHk-BIgH8QTo0SMS48H1d1LYo0lXQwYoMTgTgo",
  "pdfSize": "10024338"
}