{
  "id": "2412.08730",
  "title": "Reweighted Time-Evolving Block Decimation for Improved Quantum Dynamics\n  Simulations",
  "authors": "Sayak Guha Roy, Kevin Slagle",
  "authorsParsed": [
    [
      "Roy",
      "Sayak Guha",
      ""
    ],
    [
      "Slagle",
      "Kevin",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 19:01:00 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1733943660000,
  "abstract": "  We introduce a simple yet significant improvement to the time-evolving block\ndecimation (TEBD) tensor network algorithm for simulating the time dynamics of\nstrongly correlated one-dimensional (1D) mixed quantum states. The efficiency\nof 1D tensor network methods stems from using a product of matrices to express\neither: the coefficients of a wavefunction, yielding a matrix product state\n(MPS); or the expectation values of a density matrix, yielding a matrix product\ndensity operator (MPDO). To avoid exponential computational costs, TEBD\ntruncates the matrix dimension while simulating the time evolution. However,\nwhen truncating a MPDO, TEBD does not favor the likely more important\nlow-weight expectation values, such as $\\langle c_i^\\dagger c_j \\rangle$, over\nthe exponentially many high-weight expectation values, such as $\\langle\nc_{i_1}^\\dagger c^\\dagger_{i_2} \\cdots c_{i_n} \\rangle$ of weight $n$, despite\nthe critical importance of the low-weight expectation values. Motivated by this\nshortcoming, we propose a reweighted TEBD (rTEBD) algorithm that deprioritizes\nhigh-weight expectation values by a factor of $\\gamma^{-n}$ during the\ntruncation. This simple modification (which only requires reweighting certain\nmatrices by a factor of $\\gamma$ in the MPDO) makes rTEBD significantly more\naccurate than the TEBD time-dependent simulation of an MPDO, and competive with\nand sometimes better than TEBD using MPS. Furthermore, by prioritizing\nlow-weight expectation values, rTEBD preserves conserved quantities to high\nprecision.\n",
  "subjects": [
    "Physics/Quantum Physics",
    "Condensed Matter/Strongly Correlated Electrons"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "8eMeija8jJcptFDE2H-IdLxge9-1nEdLKOmRH8lrIMw",
  "pdfSize": "1023795"
}