{"id":"2412.02794","title":"A Simulated Galaxy Laboratory: Exploring the Observational Effects on UV\n  Spectral Absorption Line Measurements","authors":"R. Michael Jennings, Alaina Henry, Valentin Mauerhofer, Timothy\n  Heckman, Claudia Scarlata, Cody Carr, Xinfeng Xu, Mason Huberty, Simon\n  Gazagnes, Anne E. Jaskot, Jeremy Blaizot, Anne Verhamme, Sophia R. Flury,\n  Alberto Saldana-Lopez, Matthew J. Hayes, Maxime Trebitsch","authorsParsed":[["Jennings","R. Michael",""],["Henry","Alaina",""],["Mauerhofer","Valentin",""],["Heckman","Timothy",""],["Scarlata","Claudia",""],["Carr","Cody",""],["Xu","Xinfeng",""],["Huberty","Mason",""],["Gazagnes","Simon",""],["Jaskot","Anne E.",""],["Blaizot","Jeremy",""],["Verhamme","Anne",""],["Flury","Sophia R.",""],["Saldana-Lopez","Alberto",""],["Hayes","Matthew J.",""],["Trebitsch","Maxime",""]],"versions":[{"version":"v1","created":"Tue, 3 Dec 2024 19:53:33 GMT"}],"updateDate":"2025-01-24","timestamp":1733255613000,"abstract":"  Ultraviolet absorption line spectroscopy is a sensitive diagnostic for the\nproperties of interstellar and circumgalactic gas. Down-the-barrel\nobservations, where the absorption is measured against the galaxy itself, are\ncommonly used to study feedback from galactic outflows and to make predictions\nabout the leakage of HI ionizing photons into the intergalactic medium.\nNonetheless, the interpretation of these observations is challenging and\nobservational compromises are often made in terms of signal-to-noise, spectral\nresolution, or the use of stacking analyses. In this paper, we present a novel\nquantitative assessment of UV absorption line measurement techniques by using\nmock observations of a hydrodynamical simulation. We use a simulated galaxy to\ncreate 22,500 spectra in the commonly used SiII lines while also modeling the\nsignal-to-noise and spectral resolution of recent rest-frame UV galaxy surveys\nat both high and low redshifts. We show that the residual flux of absorption\nfeatures is easily overestimated for single line measurements and for stacked\nspectra. Additionally, we explore the robustness of the partial covering model\nfor estimating column densities from spectra and find under-predictions on\naverage of 1.25 dex. We show that the under-prediction is likely caused by\nhigh-column-density sight-lines that are optically-thick to dust making them\ninvisible in UV spectra.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"bISLtv7LkcOQa48GQvL6T4oeQWz8VcZ9QclcsGLl83o","pdfSize":"1916855"}