{"id":"2412.03528","title":"The R.O.A.D. to clinical trial emulation","authors":"Dimitris Bertsimas, Angelos G. Koulouras, Hiroshi Nagata, Carol Gao,\n  Junki Mizusawa, Yukihide Kanemitsu, Georgios Antonios Margonis","authorsParsed":[["Bertsimas","Dimitris",""],["Koulouras","Angelos G.",""],["Nagata","Hiroshi",""],["Gao","Carol",""],["Mizusawa","Junki",""],["Kanemitsu","Yukihide",""],["Margonis","Georgios Antonios",""]],"versions":[{"version":"v1","created":"Wed, 4 Dec 2024 18:17:09 GMT"}],"updateDate":"2024-12-05","timestamp":1733336229000,"abstract":"  Observational studies provide the only evidence on the effectiveness of\ninterventions when randomized controlled trials (RCTs) are impractical due to\ncost, ethical concerns, or time constraints. While many methodologies aim to\ndraw causal inferences from observational data, there is a growing trend to\nmodel observational study designs after RCTs, a strategy known as \"target trial\nemulation.\" Despite its potential, causal inference through target trial\nemulation cannot fully address the confounding bias in real-world data due to\nthe lack of randomization. In this work, we present a novel framework for\ntarget trial emulation that aims to overcome several key limitations, including\nconfounding bias. The framework proceeds as follows: First, we apply the\neligibility criteria of a specific trial to an observational cohort. We then\n\"correct\" this cohort by extracting a subset that matches both the distribution\nof covariates and the baseline prognosis of the control group in the target\nRCT. Next, we address unmeasured confounding by adjusting the prognosis\nestimates of the treated group to align with those observed in the trial.\nFollowing trial emulation, we go a step further by leveraging the emulated\ncohort to train optimal decision trees, to identify subgroups of patients with\nheterogeneity in treatment effects (HTE). The absence of confounding is\nverified using two external models, and the validity of the treatment\nrecommendations is independently confirmed by the team responsible for the\noriginal trial we emulate. To our knowledge, this is the first framework to\nsuccessfully address both observed and unobserved confounding, a challenge that\nhas historically limited the use of randomized trial emulation and causal\ninference. Additionally, our framework holds promise in advancing precision\nmedicine by identifying patient subgroups that benefit most from specific\ntreatments.\n","subjects":["Statistics/Applications","Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Ivk70hm6W2NW6oExfI7OCc5_PB4C8cT3ongmFR-Ipn4","pdfSize":"1544920"}