{
  "id": "2412.08818",
  "title": "Quantifying Model Uncertainty of Neural Network-based Turbulence\n  Closures",
  "authors": "Cody Grogan, Som Dutta, Mauricio Tano, Somayajulu L.N. Dhulipala, and\n  Izabela Gutowska",
  "authorsParsed": [
    [
      "Grogan",
      "Cody",
      ""
    ],
    [
      "Dutta",
      "Som",
      ""
    ],
    [
      "Tano",
      "Mauricio",
      ""
    ],
    [
      "Dhulipala",
      "Somayajulu L. N.",
      ""
    ],
    [
      "Gutowska",
      "Izabela",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 11 Dec 2024 23:18:57 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1733959137000,
  "abstract": "  With increasing computational demand, Neural-Network (NN) based models are\nbeing developed as pre-trained surrogates for different thermohydraulics\nphenomena. An area where this approach has shown promise is in developing\nhigher-fidelity turbulence closures for computational fluid dynamics (CFD)\nsimulations. The primary bottleneck to the widespread adaptation of these\nNN-based closures for nuclear-engineering applications is the uncertainties\nassociated with them. The current paper illustrates three commonly used methods\nthat can be used to quantify model uncertainty in NN-based turbulence closures.\nThe NN model used for the current study is trained on data from an algebraic\nturbulence closure model. The uncertainty quantification (UQ) methods explored\nare Deep Ensembles, Monte-Carlo Dropout, and Stochastic Variational Inference\n(SVI). The paper ends with a discussion on the relative performance of the\nthree methods for quantifying epistemic uncertainties of NN-based turbulence\nclosures, and potentially how they could be further extended to quantify\nout-of-training uncertainties. For accuracy in turbulence modeling, paper finds\nDeep Ensembles have the best prediction accuracy with an RMSE of\n$4.31\\cdot10^{-4}$ on the testing inputs followed by Monte-Carlo Dropout and\nStochastic Variational Inference. For uncertainty quantification, this paper\nfinds each method produces unique Epistemic uncertainty estimates with Deep\nEnsembles being overconfident in regions, MC-Dropout being under-confident, and\nSVI producing principled uncertainty at the cost of function diversity.\n",
  "subjects": [
    "Physics/Fluid Dynamics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Zs_mukVBRA3SsOo1LtM5YfSYczO4B94NJcsQWLU4bD0",
  "pdfSize": "990378"
}