{
  "id": "2412.06541",
  "title": "Numerical Estimation of Spatial Distributions under Differential Privacy",
  "authors": "Leilei Du, Peng Cheng, Libin Zheng, Xiang Lian, Lei Chen, Wei Xi,\n  Wangze Ni",
  "authorsParsed": [
    [
      "Du",
      "Leilei",
      ""
    ],
    [
      "Cheng",
      "Peng",
      ""
    ],
    [
      "Zheng",
      "Libin",
      ""
    ],
    [
      "Lian",
      "Xiang",
      ""
    ],
    [
      "Chen",
      "Lei",
      ""
    ],
    [
      "Xi",
      "Wei",
      ""
    ],
    [
      "Ni",
      "Wangze",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 14:53:57 GMT"
    },
    {
      "version": "v2",
      "created": "Wed, 11 Dec 2024 09:02:54 GMT"
    }
  ],
  "updateDate": "2024-12-12",
  "timestamp": 1733756037000,
  "abstract": "  Estimating spatial distributions is important in data analysis, such as\ntraffic flow forecasting and epidemic prevention. To achieve accurate spatial\ndistribution estimation, the analysis needs to collect sufficient user data.\nHowever, collecting data directly from individuals could compromise their\nprivacy. Most previous works focused on private distribution estimation for\none-dimensional data, which does not consider spatial data relation and leads\nto poor accuracy for spatial distribution estimation. In this paper, we address\nthe problem of private spatial distribution estimation, where we collect\nspatial data from individuals and aim to minimize the distance between the\nactual distribution and estimated one under Local Differential Privacy (LDP).\nTo leverage the numerical nature of the domain, we project spatial data and its\nrelationships onto a one-dimensional distribution. We then use this projection\nto estimate the overall spatial distribution. Specifically, we propose a\nreporting mechanism called Disk Area Mechanism (DAM), which projects the\nspatial domain onto a line and optimizes the estimation using the sliced\nWasserstein distance. Through extensive experiments, we show the effectiveness\nof our DAM approach on both real and synthetic data sets, compared with the\nstate-of-the-art methods, such as Multi-dimensional Square Wave Mechanism\n(MDSW) and Subset Exponential Mechanism with Geo-I (SEM-Geo-I). Our results\nshow that our DAM always performs better than MDSW and is better than SEM-Geo-I\nwhen the data granularity is fine enough.\n",
  "subjects": [
    "Computer Science/Databases"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "GSLnu4UC6sJYXbheW472xEGRLAPY9MZnN5yG0_R9xvI",
  "pdfSize": "2832141"
}