{
  "id": "2412.15078",
  "title": "Novel Conditions for the Finite-Region Stability of 2D-Systems with\n  Application to Iterative Learning Control",
  "authors": "Chao Liang, Carlo Cosentino, Alessio Merola, Maria Romano, Francesco\n  Amato",
  "authorsParsed": [
    [
      "Liang",
      "Chao",
      ""
    ],
    [
      "Cosentino",
      "Carlo",
      ""
    ],
    [
      "Merola",
      "Alessio",
      ""
    ],
    [
      "Romano",
      "Maria",
      ""
    ],
    [
      "Amato",
      "Francesco",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 17:26:41 GMT"
    }
  ],
  "updateDate": "2024-12-20",
  "timestamp": 1734629201000,
  "abstract": "  Some recent papers have extended the concept of finite-time stability (FTS)\nto the context of 2D linear systems, where it has been referred to as\nfinite-region stability (FRS). FRS methodologies make even more sense than the\nclassical FTS approach developed for 1D-systems, since, typically, at least one\nof the state variables of 2D-systems is a space coordinate, rather than a time\nvariable. Since space coordinates clearly belong to finite intervals, FRS\ntechniques are much more effective than the classical Lyapunov approach, which\nlooks to the asymptotic behavior of the system over an infinite interval. To\nthis regard, the novel contribution of this paper goes in several directions.\nFirst, we provide a novel sufficient condition for the FRS of linear\ntime-varying (LTV) discrete-time 2D-systems, which turns out to be less\nconservative than those ones provided in the existing literature. Then, an\ninteresting application of FRS to the context of iterative learning control\n(ILC) is investigated, by exploiting the previously developed theory. In\nparticular, a new procedure is proposed so that the tracking errors of the ILC\nlaw converges within the desired bound in a finite number of iterations.\nFinally, a sufficient condition to solve the finite-region stabilization\nproblem is proposed. All the results provided in the paper lead to optimization\nproblems constrained by linear matrix inequalities (LMIs), that can be solved\nvia widely available software. Numerical examples illustrate and validate the\neffectiveness of the proposed technique.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Systems and Control",
    "Computer Science/Systems and Control",
    "Mathematics/Optimization and Control"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "K14tTa9Sc-qmNKixSEdSNy8ibT8pQjYm07QFG4BW5so",
  "pdfSize": "863115"
}