{
  "id": "2412.09375",
  "title": "Unveiling the multiband metallic nature of the normal state in nickelate\n  La3Ni2O7",
  "authors": "Bowen Chen, Hengyuan Zhang, Jingyuan Li, Deyuan Hu, Mengwu Huo,\n  Shuyang Wang, Chuanying Xi, Zhaosheng Wang, Hualei Sun, Meng Wang, and Bing\n  Shen",
  "authorsParsed": [
    [
      "Chen",
      "Bowen",
      ""
    ],
    [
      "Zhang",
      "Hengyuan",
      ""
    ],
    [
      "Li",
      "Jingyuan",
      ""
    ],
    [
      "Hu",
      "Deyuan",
      ""
    ],
    [
      "Huo",
      "Mengwu",
      ""
    ],
    [
      "Wang",
      "Shuyang",
      ""
    ],
    [
      "Xi",
      "Chuanying",
      ""
    ],
    [
      "Wang",
      "Zhaosheng",
      ""
    ],
    [
      "Sun",
      "Hualei",
      ""
    ],
    [
      "Wang",
      "Meng",
      ""
    ],
    [
      "Shen",
      "Bing",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 15:44:34 GMT"
    }
  ],
  "updateDate": "2024-12-13",
  "timestamp": 1734018274000,
  "abstract": "  The discovery of unconventional superconductivity around 80 K in perovskite\nnickelates under high pressure has furnished a new platform to explore\nhigh-temperature unconventional superconductivity in addition to cuprates.\nUnderstanding the normal state of nickelate superconductors is crucial to\nuncovering the origin of this unconventional superconductivity and gaining\nfurther insight into its underlying mechanism. In this study, we systemically\nstudied the transport properties of La3Ni2O7 by tuning the pressure under high\nmagnetic fields. Magnetoresistance (MR) consistently exhibits a quasi-quadratic\ndependence on the magnetic field across all measured pressures and\ntemperatures. Increased pressure enhances the metallicity of the system and\nleads to a monotonic increase in MR, which follows the extended Kohler's rule.\nThese results suggest that the normal state of La3Ni2O7 to be a multiband\nmetallic nature.\n",
  "subjects": [
    "Condensed Matter/Superconductivity"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "kWaKels67qls03-uc-cpmn1OXD0YQ0oyDc-QlKRmzeM",
  "pdfSize": "2275878"
}