{
  "id": "2412.09143",
  "title": "Frolov Black Hole Surrounded by Quintessence - II: Quasinormal Modes,\n  Greybody Factors, Deflection Angle and Chaos Bound",
  "authors": "Mrinnoy M. Gohain, Kalyan Bhuyan and Hari Prasad Saikia",
  "authorsParsed": [
    [
      "Gohain",
      "Mrinnoy M.",
      ""
    ],
    [
      "Bhuyan",
      "Kalyan",
      ""
    ],
    [
      "Saikia",
      "Hari Prasad",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 10:28:11 GMT"
    },
    {
      "version": "v2",
      "created": "Mon, 17 Feb 2025 12:03:01 GMT"
    }
  ],
  "updateDate": "2025-02-18",
  "timestamp": 1733999291000,
  "abstract": "  In this work, we have examined the scalar quasinormal modes, greybody\nfactors, weak gravitational lensing, and the chaos bound of a Frolov black hole\nsurrounded by a quintessence field. We studied the quasinormal frequencies and\ndeduced that an increase in the value of the quintessence parameter $c$\ndissipates the oscillatory behavior and thus slow down the decay of\nperturbations. The greybody factors are highly dependent on the multipole\nmoment $l$ and BH parameters, with a larger $q$ hindering the transmission and\nsmaller $\\alpha_0$ making the barrier steeper. The deflection angle of weak\nlensing under thin lens approximation, monotonically decreases as the value of\nimpact parameter $b$ increases, and is visibly affected by the parameter $c$,\nand that $\\alpha_0$ and $q$ has very minimal effect. Lastly, we investigated\nthe chaos bound behaviour of photon trajectories in the near-horizon\nneighbourhood, which indicates that it is satisfied for bigger circular photon\norbits but broken for smaller ones, with high-angular-momentum photons being\nchaotic. This violation of the bound points towards the role of quintessence in\nmodifying the thermodynamic features of the BH, with possible adjustments to\nthe standard Bekenstein-Hawking entropy.\n",
  "subjects": [
    "Physics/General Relativity and Quantum Cosmology"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "dLjiLi7BdoeDiLerFcLs3IXTIIyCSC7q6xmaJCR8LWs",
  "pdfSize": "566346"
}