{"id":"2412.04267","title":"Integrated Minimum Mean Squared Error Algorithms for Combined Acoustic\n  Echo Cancellation and Noise Reduction","authors":"Arnout Roebben, Toon van Waterschoot, Jan Wouters, and Marc Moonen","authorsParsed":[["Roebben","Arnout",""],["van Waterschoot","Toon",""],["Wouters","Jan",""],["Moonen","Marc",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 15:50:47 GMT"}],"updateDate":"2024-12-06","timestamp":1733413847000,"abstract":"  In many speech recording applications, noise and acoustic echo corrupt the\ndesired speech. Consequently, combined noise reduction (NR) and acoustic echo\ncancellation (AEC) is required. Generally, a cascade approach is followed,\ni.e., the AEC and NR are designed in isolation by selecting a separate signal\nmodel, formulating a separate cost function, and using a separate solution\nstrategy. The AEC and NR are then cascaded one after the other, not accounting\nfor their interaction. In this paper, however, an integrated approach is\nproposed to consider this interaction in a general\nmulti-microphone/multi-loudspeaker setup. Therefore, a single signal model of\neither the microphone signal vector or the extended signal vector, obtained by\nstacking microphone and loudspeaker signals, is selected, a single mean squared\nerror cost function is formulated, and a common solution strategy is used.\nUsing this microphone signal model, a multi channel Wiener filter (MWF) is\nderived. Using the extended signal model, an extended MWF (MWFext) is derived,\nand several equivalent expressions are found, which nevertheless are\ninterpretable as cascade algorithms. Specifically, the MWFext is shown to be\nequivalent to algorithms where the AEC precedes the NR (AEC NR), the NR\nprecedes the AEC (NR-AEC), and the extended NR (NRext) precedes the AEC and\npost-filter (PF) (NRext-AECPF). Under rank-deficiency conditions the MWFext is\nnon-unique, such that this equivalence amounts to the expressions being\nspecific, not necessarily minimum-norm solutions for this MWFext. The practical\nperformances nonetheless differ due to non-stationarities and imperfect\ncorrelation matrix estimation, resulting in the AEC-NR and NRext-AEC-PF\nattaining best overall performance.\n","subjects":["Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"nAVWHNjOv_fHNIRq4b0qNKqgrSQdrO6SuypnRWyzeP0","pdfSize":"598301"}