{"id":"2412.04135","title":"DHOST theories as disformal gravity: From black holes to radiative\n  spacetimes","authors":"Jibril Ben Achour","authorsParsed":[["Achour","Jibril Ben",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 12:58:34 GMT"},{"version":"v2","created":"Sat, 8 Feb 2025 12:52:28 GMT"}],"updateDate":"2025-02-11","timestamp":1733403514000,"abstract":"  This manuscript reviews the construction of exact solutions describing both\n(rotating) black holes and non-linear radiative spacetimes in the context of\ndegenerate higher order scalar-tensor (DHOST) theories. We start be reviewing\nthe structure of the DHOST theory space, the notion of degeneracy conditions\nand the stability of these degeneracy classes under disformal field\nredefinition (DFR). Then we discuss several key notions related to stationary\nand axi-symmetric black holes, and in particular the no-hair theorems derived\nin GR and in its scalar-tensor extensions. The rest of the chapters are devoted\nto the disformal solution generating map use to construct new hairy black holes\nsolutions. A brief review of the rotating black holes solutions found so far in\nthis context and a detailed description of the disformed Kerr black hole, we\nfurther comment on on-going efforts to construct rotating black hole solutions\nmimicking the closest the Kerr geometry. Then, we discuss how DFR affects the\nalgebraic properties of a gravitational field and in particular its Petrov\ntype. This provides a first systematic characterization of this effect, paving\nthe road for constructing new solutions with a fixed Petrov type. Finally, we\nreview more recent works aiming at characterizing the effect of a DFR on\nnon-linear radiative geometries. We derive the general conditions for the\ngeneration of disformal tensorial gravitational wave and we study in detail a\nconcrete example in DHOST gravity describing the new radiative effect induced\nby a time-dependent scalar monopoly in such higher-order theory. While most of\nthe material presented here is a re-organized and augmented version of our\npublished works, we have included new results and also new proposals to\nconstruct phenomenologically interesting solutions. This manuscript can be used\nas a review on the construction of exact solutions in DHOST gravity.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"u-UT-0vJIk7gBn468_UYRvPRvn0ipMkTj33eohAF-uo","pdfSize":"4263045"}