{"id":"2412.20980","title":"Efficient Parallel Genetic Algorithm for Perturbed Substructure\n  Optimization in Complex Network","authors":"Shanqing Yu, Meng Zhou, Jintao Zhou, Minghao Zhao, Yidan Song, Yao Lu,\n  Zeyu Wang, Qi Xuan","authorsParsed":[["Yu","Shanqing",""],["Zhou","Meng",""],["Zhou","Jintao",""],["Zhao","Minghao",""],["Song","Yidan",""],["Lu","Yao",""],["Wang","Zeyu",""],["Xuan","Qi",""]],"versions":[{"version":"v1","created":"Mon, 30 Dec 2024 14:32:39 GMT"}],"updateDate":"2024-12-31","timestamp":1735569159000,"abstract":"  Evolutionary computing, particularly genetic algorithm (GA), is a\ncombinatorial optimization method inspired by natural selection and the\ntransmission of genetic information, which is widely used to identify optimal\nsolutions to complex problems through simulated programming and iteration. Due\nto its strong adaptability, flexibility, and robustness, GA has shown\nsignificant performance and potentiality on perturbed substructure optimization\n(PSSO), an important graph mining problem that achieves its goals by modifying\nnetwork structures. However, the efficiency and practicality of GA-based PSSO\nface enormous challenges due to the complexity and diversity of application\nscenarios. While some research has explored acceleration frameworks in\nevolutionary computing, their performance on PSSO remains limited due to a lack\nof scenario generalizability. Based on these, this paper is the first to\npresent the GA-based PSSO Acceleration framework (GAPA), which simplifies the\nGA development process and supports distributed acceleration. Specifically, it\nreconstructs the genetic operation and designs a development framework for\nefficient parallel acceleration. Meanwhile, GAPA includes an extensible library\nthat optimizes and accelerates 10 PSSO algorithms, covering 4 crucial tasks for\ngraph mining. Comprehensive experiments on 18 datasets across 4 tasks and 10\nalgorithms effectively demonstrate the superiority of GAPA, achieving an\naverage of 4x the acceleration of Evox. The repository is in\nhttps://github.com/NetAlsGroup/GAPA.\n","subjects":["Computer Science/Neural and Evolutionary Computing","Computer Science/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"QzE7FTV8sWqwhhs0uFQTMOUINRfcAQ-ymcNgToy1sKE","pdfSize":"708640"}