{
  "id": "2412.07123",
  "title": "A Framework For Estimating Amplitudes of Quantum State With Single-Qubit\n  Measurement",
  "authors": "Nhat A. Nghiem",
  "authorsParsed": [
    [
      "Nghiem",
      "Nhat A.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 02:31:16 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733797876000,
  "abstract": "  We propose and analyze a simple framework for estimating the amplitudes of a\ngiven $n$-qubit quantum state $\\ket{\\psi} = \\sum_{i=0}^{2^n-1} a_i \\ket{i}$ in\ncomputational basis, utilizing a single-qubit measurement only. Previously, it\nwas a common procedure that one could measure all qubits in order to collect\nmeasurement outcomes, from which one can estimate amplitudes of given quantum\nstate. Here, we show that if restricting to single-qubit measurement, and one\ncan perform measurement on arbitrary basis, then the measurement outcomes can\nbe used to assist the finding of amplitudes in the usual computational, or Z\nbasis. More concretely, such outcomes are capable of constructing a system of\nnonlinear algebraic equations, and by classically solving them, we obtain\n$\\Tilde{a}_i$, which is the approximation to the corresponding amplitudes\n$a_i$, including both real and imaginary component. We then discuss our\nframework from a broader perspective. First, we show that estimating all (norms\nof) amplitudes to additive accuracy $\\delta$, i.e., $| |\\Tilde{a}_i - |a_i| |\n\\leq \\delta$ for all $i$, $\\mathcal{O}(4^n/\\delta^4)$ single-qubit measurements\nis sufficient. Second, we show that to achieve total variation\n$\\sum_{i=0}^{2^n-1} | |\\Tilde{a}_i|^2 - |a_i|^2| \\leq \\delta $,\n$\\mathcal{O}(6^n/\\delta^4)$ a single bit measurement is required. Finally, in\norder to achieve an average $L_1$ norm error $ \\sum_{i=0}^{2^n-1} |\n|\\Tilde{a}_i| - |a_i| |/2^n \\leq \\delta$, a single bit measurement\n$\\mathcal{O}(2^n/ \\delta^4)$ is needed.\n",
  "subjects": [
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "oQ1wjtNhsh03p3NEGS8D526Q-lT0qZuGYNOfYzVVKOc",
  "pdfSize": "421829"
}