{
  "id": "2412.09365",
  "title": "A BCool survey of stellar magnetic cycles",
  "authors": "S. Bellotti, P. Petit, S. V. Jeffers, S. C. Marsden, J. Morin, A. A.\n  Vidotto, C. P. Folsom, V. See, J.-D. do Nascimento Jr",
  "authorsParsed": [
    [
      "Bellotti",
      "S.",
      ""
    ],
    [
      "Petit",
      "P.",
      ""
    ],
    [
      "Jeffers",
      "S. V.",
      ""
    ],
    [
      "Marsden",
      "S. C.",
      ""
    ],
    [
      "Morin",
      "J.",
      ""
    ],
    [
      "Vidotto",
      "A. A.",
      ""
    ],
    [
      "Folsom",
      "C. P.",
      ""
    ],
    [
      "See",
      "V.",
      ""
    ],
    [
      "Nascimento",
      "J. -D. do",
      "Jr"
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 15:31:15 GMT"
    },
    {
      "version": "v2",
      "created": "Fri, 13 Dec 2024 09:47:14 GMT"
    }
  ],
  "updateDate": "2025-01-29",
  "timestamp": 1734017475000,
  "abstract": "  The magnetic cycle on the Sun consists of two consecutive 11-yr sunspot\ncycles and exhibits a polarity reversal around sunspot maximum. Although solar\ndynamo theories have progressively become more sophisticated, the details as to\nhow the dynamo sustains magnetic fields are still subject of research.\nObserving the magnetic fields of Sun-like stars are useful to contextualise the\nsolar dynamo. The BCool survey studies the evolution of surface magnetic fields\nto understand how dynamo-generated processes are influenced by key ingredients,\nlike mass and rotation. Here, we focus on six Sun-like stars with mass between\n1.02 and 1.06 MSun and with 3.5-21 d rotation period. We analysed\nhigh-resolution spectropolarimetric data collected with ESPaDOnS, Narval and\nNeo-Narval. We measured the longitudinal magnetic field from least-squares\ndeconvolution line profiles and inspected its long-term behaviour with a\nLomb-Scargle periodogram and a Gaussian process. We applied Zeeman-Doppler\nimaging to reconstruct the large-scale magnetic field geometry at the stellar\nsurface for different epochs. Two stars, namely HD 9986 and HD 56124 (Prot ~ 20\nd) exhibit repeating polarity reversals of the radial or toroidal field\ncomponent on time scales of 5 to 6 yr. HD 73350 (Prot = 12 d) has one polarity\nreversal of the toroidal component and HD 76151 (Prot=17 d) may have short-term\nevolution (2.5 yr) modulated by the long-term (16 yr) chromospheric cycle. HD\n166435 and HD 175726 (Prot =3-5 d), manifest complex magnetic fields without\ncyclic evolution. Our findings indicate the potential dependence of the\nmagnetic cycles nature with stellar rotation period. For the two stars with\nlikely cycles, the polarity reversal time scale seems to decrease with\ndecreasing rotation period or Rossby number. These results represent important\nobservational constraints for dynamo models of solar-like stars.\n",
  "subjects": [
    "Astrophysics/Solar and Stellar Astrophysics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "hvpmtatUZM8S8_JHUdxr07Y8FCOBTyMQhyYlI3xVINA",
  "pdfSize": "18465483"
}