{"id":"2412.04991","title":"Computational Advantage in Hybrid Quantum Neural Networks: Myth or\n  Reality?","authors":"Muhammad Kashif, Alberto Marchisio, Muhammad Shafique","authorsParsed":[["Kashif","Muhammad",""],["Marchisio","Alberto",""],["Shafique","Muhammad",""]],"versions":[{"version":"v1","created":"Fri, 6 Dec 2024 12:31:04 GMT"},{"version":"v2","created":"Fri, 13 Dec 2024 19:59:47 GMT"},{"version":"v3","created":"Fri, 21 Feb 2025 06:52:22 GMT"}],"updateDate":"2025-02-24","timestamp":1733488264000,"abstract":"  Hybrid Quantum Neural Networks (HQNNs) have gained attention for their\npotential to enhance computational performance by incorporating quantum layers\ninto classical neural network (NN) architectures. However, a key question\nremains: Do quantum layers offer computational advantages over purely classical\nmodels? This paper explores how classical and hybrid models adapt their\narchitectural complexity to increasing problem complexity. Using a multiclass\nclassification problem, we benchmark classical models to identify optimal\nconfigurations for accuracy and efficiency, establishing a baseline for\ncomparison. HQNNs, simulated on classical hardware (as common in the Noisy\nIntermediate-Scale Quantum (NISQ) era), are evaluated for their scaling of\nfloating-point operations (FLOPs) and parameter growth. Our findings reveal\nthat as problem complexity increases, HQNNs exhibit more efficient scaling of\narchitectural complexity and computational resources. For example, from 10 to\n110 features, HQNNs show an 53.1% increase in FLOPs compared to 88.1% for\nclassical models, despite simulation overheads. Additionally, the parameter\ngrowth rate is slower in HQNNs (81.4%) than in classical models (88.5%). These\nresults highlight HQNNs' scalability and resource efficiency, positioning them\nas a promising alternative for solving complex computational problems.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"kSv38jKSaNXlIEowwrfoW1eU_wF21C1kNeML8cQWcgg","pdfSize":"1291904"}