{
  "id": "2412.12400",
  "title": "Using machine learning to inform harvest control rule design in complex\n  fishery settings",
  "authors": "Felipe Montealegre-Mora, Carl Boettiger, Carl J. Walters, Christopher\n  L. Cahill",
  "authorsParsed": [
    [
      "Montealegre-Mora",
      "Felipe",
      ""
    ],
    [
      "Boettiger",
      "Carl",
      ""
    ],
    [
      "Walters",
      "Carl J.",
      ""
    ],
    [
      "Cahill",
      "Christopher L.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 16 Dec 2024 23:13:00 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734390780000,
  "abstract": "  In fishery science, harvest management of size-structured stochastic\npopulations is a long-standing and difficult problem. Rectilinear precautionary\npolicies based on biomass and harvesting reference points have now become a\nstandard approach to this problem. While these standard feedback policies are\nadapted from analytical or dynamic programming solutions assuming relatively\nsimple ecological dynamics, they are often applied to more complicated\necological settings in the real world. In this paper we explore the problem of\ndesigning harvest control rules for partially observed, age-structured,\nspasmodic fish populations using tools from reinforcement learning (RL) and\nBayesian optimization. Our focus is on the case of Walleye fisheries in\nAlberta, Canada, whose highly variable recruitment dynamics have perplexed\nmanagers and ecologists. We optimized and evaluated policies using several\ncomplementary performance metrics. The main questions we addressed were: 1. How\ndo standard policies based on reference points perform relative to numerically\noptimized policies? 2. Can an observation of mean fish weight, in addition to\nstock biomass, aid policy decisions?\n",
  "subjects": [
    "Quantitative Biology/Populations and Evolution",
    "Computer Science/Machine Learning",
    "Quantitative Biology/Quantitative Methods"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "r1LMQLQzrHbZJtd5fxdnU_jHWQp_58tXEWCJIjlklPY",
  "pdfSize": "2837123"
}