{"id":"2412.12588","title":"PerSphere: A Comprehensive Framework for Multi-Faceted Perspective\n  Retrieval and Summarization","authors":"Yun Luo, Yingjie Li, Xiangkun Hu, Qinglin Qi, Fang Guo, Qipeng Guo,\n  Zheng Zhang, Yue Zhang","authorsParsed":[["Luo","Yun",""],["Li","Yingjie",""],["Hu","Xiangkun",""],["Qi","Qinglin",""],["Guo","Fang",""],["Guo","Qipeng",""],["Zhang","Zheng",""],["Zhang","Yue",""]],"versions":[{"version":"v1","created":"Tue, 17 Dec 2024 06:44:06 GMT"}],"updateDate":"2024-12-18","timestamp":1734417846000,"abstract":"  As online platforms and recommendation algorithms evolve, people are\nincreasingly trapped in echo chambers, leading to biased understandings of\nvarious issues. To combat this issue, we have introduced PerSphere, a benchmark\ndesigned to facilitate multi-faceted perspective retrieval and summarization,\nthus breaking free from these information silos. For each query within\nPerSphere, there are two opposing claims, each supported by distinct,\nnon-overlapping perspectives drawn from one or more documents. Our goal is to\naccurately summarize these documents, aligning the summaries with the\nrespective claims and their underlying perspectives. This task is structured as\na two-step end-to-end pipeline that includes comprehensive document retrieval\nand multi-faceted summarization. Furthermore, we propose a set of metrics to\nevaluate the comprehensiveness of the retrieval and summarization content.\nExperimental results on various counterparts for the pipeline show that recent\nmodels struggle with such a complex task. Analysis shows that the main\nchallenge lies in long context and perspective extraction, and we propose a\nsimple but effective multi-agent summarization system, offering a promising\nsolution to enhance performance on PerSphere.\n","subjects":["Computer Science/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"9ecNeHUMQOKYsKSp-MQj-WRxn6GnxUcGmcBGy6DVGLE","pdfSize":"4019699"}