{
  "id": "2412.06325",
  "title": "Q-PnV: A Quantum Consensus Mechanism for Security Consortium Blockchains",
  "authors": "Jianming Lin, Hui Li, Hongjian Xing, Runhuai Huang, Weixiang Huang,\n  Shaowen Deng, Yanping Zhang, Weimin Zeng, Ping Lu, Xiyu Wang, Tao Sun,\n  Xiongyan Tang",
  "authorsParsed": [
    [
      "Lin",
      "Jianming",
      ""
    ],
    [
      "Li",
      "Hui",
      ""
    ],
    [
      "Xing",
      "Hongjian",
      ""
    ],
    [
      "Huang",
      "Runhuai",
      ""
    ],
    [
      "Huang",
      "Weixiang",
      ""
    ],
    [
      "Deng",
      "Shaowen",
      ""
    ],
    [
      "Zhang",
      "Yanping",
      ""
    ],
    [
      "Zeng",
      "Weimin",
      ""
    ],
    [
      "Lu",
      "Ping",
      ""
    ],
    [
      "Wang",
      "Xiyu",
      ""
    ],
    [
      "Sun",
      "Tao",
      ""
    ],
    [
      "Tang",
      "Xiongyan",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 09:24:04 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733736244000,
  "abstract": "  Due to the rapid development of quantum computing, many classical blockchain\ntechnologies are now considered insecure. The emergence of quantum blockchain\nholds promise for addressing this issue. Various quantum consensus algorithms\nhave been proposed so far, but there has not yet been a quantum consensus\nalgorithm tailored specifically for consortium blockchain scenarios. In this\npaper, we propose a novel quantum consensus mechanism, named Q-PnV. This\nconsensus mechanism is based on the classical Proof of Vote (PoV), integrating\nquantum voting, quantum digital signature and quantum random number generators\n(QRNGs). By combining Q-PnV with a quantum blockchain using weighted hypergraph\nstates, we propose a comprehensive quantum blockchain solution for consortium\nblockchain scenarios. Compared to the classical method, the quantum blockchain\nbased on Q-PnV can resist quantum attacks and shows significant improvements in\nsecurity and fairness, making it better suit-ed for the future quantum era.\n",
  "subjects": [
    "Computer Science/Cryptography and Security",
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "cY1SU2qCW8NV2Oj8gRM1DLhJFy6Tfl-lLh-nP6V2nfg",
  "pdfSize": "707646"
}