{"id":"2412.05602","title":"Multispecies Animal Re-ID Using a Large Community-Curated Dataset","authors":"Lasha Otarashvili, Tamilselvan Subramanian, Jason Holmberg, J.J.\n  Levenson, Charles V. Stewart","authorsParsed":[["Otarashvili","Lasha",""],["Subramanian","Tamilselvan",""],["Holmberg","Jason",""],["Levenson","J. J.",""],["Stewart","Charles V.",""]],"versions":[{"version":"v1","created":"Sat, 7 Dec 2024 09:56:33 GMT"}],"updateDate":"2024-12-10","timestamp":1733565393000,"abstract":"  Recent work has established the ecological importance of developing\nalgorithms for identifying animals individually from images. Typically, a\nseparate algorithm is trained for each species, a natural step but one that\ncreates significant barriers to wide-spread use: (1) each effort is expensive,\nrequiring data collection, data curation, and model training, deployment, and\nmaintenance, (2) there is little training data for many species, and (3)\ncommonalities in appearance across species are not exploited. We propose an\nalternative approach focused on training multi-species individual\nidentification (re-id) models. We construct a dataset that includes 49 species,\n37K individual animals, and 225K images, using this data to train a single\nembedding network for all species. Our model employs an EfficientNetV2 backbone\nand a sub-center ArcFace loss function with dynamic margins. We evaluate the\nperformance of this multispecies model in several ways. Most notably, we\ndemonstrate that it consistently outperforms models trained separately on each\nspecies, achieving an average gain of 12.5% in top-1 accuracy. Furthermore, the\nmodel demonstrates strong zero-shot performance and fine-tuning capabilities\nfor new species with limited training data, enabling effective curation of new\nspecies through both incremental addition of data to the training set and\nfine-tuning without the original data. Additionally, our model surpasses the\nrecent MegaDescriptor on unseen species, averaging an 19.2% top-1 improvement\nper species and showing gains across all 33 species tested. The fully-featured\ncode repository is publicly available on GitHub, and the feature extractor\nmodel can be accessed on HuggingFace for seamless integration with wildlife\nre-identification pipelines. The model is already in production use for 60+\nspecies in a large-scale wildlife monitoring system.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"UsXhj2MyTokCvJx3U0bPo33fBrIpIU0Zn4kOTnnlSek","pdfSize":"3780805"}