{
  "id": "2412.09268",
  "title": "Partial-immunity of two-photon correlation against wavefront distortion\n  for spatially entangled photons",
  "authors": "Kiran Bajar, Rounak Chatterjee, Vikas S. Bhat and Sushil Mujumdar",
  "authorsParsed": [
    [
      "Bajar",
      "Kiran",
      ""
    ],
    [
      "Chatterjee",
      "Rounak",
      ""
    ],
    [
      "Bhat",
      "Vikas S.",
      ""
    ],
    [
      "Mujumdar",
      "Sushil",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 12 Dec 2024 13:31:20 GMT"
    },
    {
      "version": "v2",
      "created": "Wed, 12 Feb 2025 06:11:46 GMT"
    }
  ],
  "updateDate": "2025-02-13",
  "timestamp": 1734010280000,
  "abstract": "  High-dimensional quantum entanglement in photons offers notable technological\nadvancements over traditional qubit-based systems, including increased\ninformation density and enhanced security. However, such high-dimensional\nstates are vulnerable to disruption by complex disordered media, presenting\nsignificant challenges in practical applications. Spatially-entangled photons\nare conventionally generated using a nonlinear crystal via spontaneous\nparametric down conversion (SPDC). While the effect of disorder on spatially\nentangled photons in the near field of the crystal is well understood, the\nimpact of disorder in the far field is more complex. In this work, we present a\nsystematic study of the randomization of two-photon correlations caused by\narbitrary phase distortions in the far field by breaking it down into odd and\neven parity components. First, we theoretically show that the two-photon field\nis only sensitive to the even-parity part of the phase distortion. In follow-up\nexperiments, we employ a deformable mirror to implement random phase\ndistortions, separating the contributions of odd and even parity phases using\nZernike polynomials. The experimental results are in agreements with the\ntheoretical predictions. Subsequently, we perform numerical simulations to show\nthat these results extend to stronger degrees of disorder. Our key finding is\nthat, since two-photon correlations are only affected by the even-parity\ncomponent of phase modulations, the number of independent adaptive optics\nelements required for optimizing the correlation can be effectively halved,\noffering a significant practical advantage in managing disorder in quantum\nsystems.\n",
  "subjects": [
    "Physics/Quantum Physics",
    "Condensed Matter/Disordered Systems and Neural Networks",
    "Physics/Optics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "uiPdzVwK0pHEiHXopjSvvkUOFNaI84sK858Db9RVY-A",
  "pdfSize": "1280274"
}