{
  "id": "2412.03032",
  "title": "Edge System Design Using Containers and Unikernels for IoT Applications",
  "authors": "Shahidullah Kaiser, Ali Saman Tosun, Turgay Korkmaz",
  "authorsParsed": [
    [
      "Kaiser",
      "Shahidullah",
      ""
    ],
    [
      "Tosun",
      "Ali Saman",
      ""
    ],
    [
      "Korkmaz",
      "Turgay",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 05:05:30 GMT"
    },
    {
      "version": "v2",
      "created": "Sun, 8 Dec 2024 05:41:15 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733288730000,
  "abstract": "  Edge computing is emerging as a key enabler of low-latency, high-efficiency\nprocessing for the Internet of Things (IoT) and other real-time applications.\nTo support these demands, containerization has gained traction in edge\ncomputing due to its lightweight virtualization and efficient resource\nmanagement. However, there is currently no established framework to leverage\nboth containers and unikernels on edge devices for optimized IoT deployments.\nThis paper proposes a hybrid edge system design that leverages container and\nunikernel technologies to optimize resource utilization based on application\ncomplexity. Containers are employed for resource-intensive applications, e.g.,\ncomputer vision, providing faster processing, flexibility, and ease of\ndeployment. In contrast, unikernels are used for lightweight applications,\noffering enhanced resource performance with minimal overhead. Our system design\nalso incorporates container orchestration to efficiently manage multiple\ninstances across the edge efficiently, ensuring scalability and reliability. We\ndemonstrate our hybrid approach's performance and efficiency advantages through\nreal-world computer vision and data science applications on ARM-powered edge\ndevice. Our results demonstrate that this hybrid approach improves resource\nutilization and reduces latency compared to traditional virtualized solutions.\nThis work provides insights into optimizing edge infrastructures, enabling more\nefficient and specialized deployment strategies for diverse application\nworkloads.\n",
  "subjects": [
    "Computer Science/Distributed, Parallel, and Cluster Computing"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "FkadJpVtRDPnF6bO11i8nHkE9f-jn9GoTpH8Wh0bXb4",
  "pdfSize": "921627"
}