{
  "id": "2412.12751",
  "title": "Experimental Study of Low-Latency Video Streaming in an ORAN Setup with\n  Generative AI",
  "authors": "Andreas Casparsen, Van-Phuc Bui, Shashi Raj Pandey, Jimmy Jessen\n  Nielsen, Petar Popovski",
  "authorsParsed": [
    [
      "Casparsen",
      "Andreas",
      ""
    ],
    [
      "Bui",
      "Van-Phuc",
      ""
    ],
    [
      "Pandey",
      "Shashi Raj",
      ""
    ],
    [
      "Nielsen",
      "Jimmy Jessen",
      ""
    ],
    [
      "Popovski",
      "Petar",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 10:15:46 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734430546000,
  "abstract": "  Video streaming services depend on the underlying communication\ninfrastructure and available network resources to offer ultra-low latency,\nhigh-quality content delivery. Open Radio Access Network (ORAN) provides a\ndynamic, programmable, and flexible RAN architecture that can be configured to\nsupport the requirements of time-critical applications. This work considers a\nsetup in which the constrained network resources are supplemented by \\gls{GAI}\nand \\gls{MEC} {techniques} in order to reach a satisfactory video quality.\nSpecifically, we implement a novel semantic control channel that enables\n\\gls{MEC} to support low-latency applications by tight coupling among the ORAN\nxApp, \\gls{MEC}, and the control channel. The proposed concepts are\nexperimentally verified with an actual ORAN setup that supports video\nstreaming. The performance evaluation includes the \\gls{PSNR} metric and\nend-to-end latency. Our findings reveal that latency adjustments can yield\ngains in image \\gls{PSNR}, underscoring the trade-off potential for optimized\nvideo quality in resource-limited environments.\n",
  "subjects": [
    "Computer Science/Networking and Internet Architecture",
    "Electrical Engineering and Systems Science/Signal Processing"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "3KuvrZhDpsqe4Oz4QEn9gIR2owSGlYaR8LJmgUKMafg",
  "pdfSize": "2017789"
}