{"id":"2412.04258","title":"Effect of top metallic contacts on energy conversion performances for\n  near-field thermophotovoltaics","authors":"Youssef Jeyar, Kevin Austry, Minggang Luo, Brahim Guizal, Yi Zheng,\n  Riccardo Messina, Rodolphe Vaillon, Mauro Antezza","authorsParsed":[["Jeyar","Youssef",""],["Austry","Kevin",""],["Luo","Minggang",""],["Guizal","Brahim",""],["Zheng","Yi",""],["Messina","Riccardo",""],["Vaillon","Rodolphe",""],["Antezza","Mauro",""]],"versions":[{"version":"v1","created":"Thu, 5 Dec 2024 15:38:48 GMT"}],"updateDate":"2024-12-06","timestamp":1733413128000,"abstract":"  The design of metallic contact grids on the front side of thermophotovoltaic\ncells is critical since it can cause significant optical and electrical\nresistive losses, particularly in the near field. However, from the theoretical\npoint of view, this effect has been either discarded or studied by means of\nextremely simplified models like the shadowing methods, that consist in simply\nignoring the fraction of the semiconductor surface covered by metal. Our study,\nbased on a rigorous three-body theoretical framework and implemented using the\nscattering matrix approach with the Fourier modal method augmented with\nadaptive spatial resolution, provides deeper insight into the influence of the\nfront metal contact grid. This approach allows direct access to the radiative\npower absorbed by the semiconductor, enabling the proposal of an alternative\ndefinition for the thermophotovoltaic cell efficiency. By modeling this grid as\na metallic grating, we demonstrate its significant impact on the net radiative\npower absorbed by the cell and, consequently, on the generated electrical\npower. Our analysis reveals behaviors differing substantially from those\npredicted by previous simplistic approaches.\n","subjects":["Physics/Optics","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"aBxE1PEcPDLzShmNY0D1akVuBxmo_dhnSxRa0-awKVE","pdfSize":"3525674"}