{
  "id": "2412.05420",
  "title": "Universal approach to light driven \"superconductivity\" via preformed\n  pairs",
  "authors": "Ke Wang, Zhiqiang Wang, Qijin Chen, and K. Levin",
  "authorsParsed": [
    [
      "Wang",
      "Ke",
      ""
    ],
    [
      "Wang",
      "Zhiqiang",
      ""
    ],
    [
      "Chen",
      "Qijin",
      ""
    ],
    [
      "Levin",
      "K.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 21:06:40 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733519200000,
  "abstract": "  While there are many different mechanisms which have been proposed to\nunderstand the physics behind light induced \"superconductivity\", what seems to\nbe common to the class of materials in which this is observed are strong\npairing correlations, which are present in the normal state. Here we argue,\nthat the original ideas of Eliashberg are applicable to such a pseudogap phase\nand that with exposure to radiation the fermions are redistributed to higher\nenergies where they are less deleterious to pairing. What results then is a\nphoto-induced state with dramatically enhanced number of nearly condensed\nfermion pairs. In this phase, because the a.c. conductivity, $\\sigma(\\omega) =\n\\sigma_1(\\omega) + i \\sigma_2(\\omega)$, is dominated by the bosonic\ncontribution, it can be computed using conventional (Aslamazov Larkin)\nfluctuation theory. We, thereby, observe the expected fingerprint of this\nphotoinduced \"superconducting\" state which is a $1/\\omega$ dependence in\n$\\sigma_2$ with fits to the data of the same quality as found for the so-called\nphoto-enhanced (Drude) conductivity scenario. Here, however, we have a\nmicroscopic understanding of the characteristic low energy scale which appears\nin transport and which is necessarily temperature dependent. This approach also\nprovides insight into recent observations of concomitant diamagnetic\nfluctuations. Our calculations suggest that the observed light-induced phase in\nthese strongly paired superconductors has only short range phase coherence\nwithout long range superconducting order.\n",
  "subjects": [
    "Condensed Matter/Superconductivity",
    "Condensed Matter/Strongly Correlated Electrons"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "9efAVnf7n5msMHBsXY0dowTKv3aiOUPY0GLBIbamynk",
  "pdfSize": "1203875"
}