{
  "id": "2412.07499",
  "title": "EDGE: Unknown-aware Multi-label Learning by Energy Distribution Gap\n  Expansion",
  "authors": "Yuchen Sun, Qianqian Xu, Zitai Wang, Zhiyong Yang, Junwei He",
  "authorsParsed": [
    [
      "Sun",
      "Yuchen",
      ""
    ],
    [
      "Xu",
      "Qianqian",
      ""
    ],
    [
      "Wang",
      "Zitai",
      ""
    ],
    [
      "Yang",
      "Zhiyong",
      ""
    ],
    [
      "He",
      "Junwei",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 13:27:58 GMT"
    },
    {
      "version": "v2",
      "created": "Mon, 23 Dec 2024 15:34:09 GMT"
    }
  ],
  "updateDate": "2024-12-24",
  "timestamp": 1733837278000,
  "abstract": "  Multi-label Out-Of-Distribution (OOD) detection aims to discriminate the OOD\nsamples from the multi-label In-Distribution (ID) ones. Compared with its\nmulticlass counterpart, it is crucial to model the joint information among\nclasses. To this end, JointEnergy, which is a representative multi-label OOD\ninference criterion, summarizes the logits of all the classes. However, we find\nthat JointEnergy can produce an imbalance problem in OOD detection, especially\nwhen the model lacks enough discrimination ability. Specifically, we find that\nthe samples only related to minority classes tend to be classified as OOD\nsamples due to the ambiguous energy decision boundary. Besides, imbalanced\nmulti-label learning methods, originally designed for ID ones, would not be\nsuitable for OOD detection scenarios, even producing a serious negative\ntransfer effect. In this paper, we resort to auxiliary outlier exposure (OE)\nand propose an unknown-aware multi-label learning framework to reshape the\nuncertainty energy space layout. In this framework, the energy score is\nseparately optimized for tail ID samples and unknown samples, and the energy\ndistribution gap between them is expanded, such that the tail ID samples can\nhave a significantly larger energy score than the OOD ones. What's more, a\nsimple yet effective measure is designed to select more informative OE\ndatasets. Finally, comprehensive experimental results on multiple multi-label\nand OOD datasets reveal the effectiveness of the proposed method.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "ml45-TH79Hdz8iW6ZXDjnR1YIJLh3b0dbeKWMeBvG_4",
  "pdfSize": "1815420"
}