{"id":"2412.07881","title":"Predicting NOx emissions in Biochar Production Plants using Machine\n  Learning","authors":"Marius K\\\"oppel and Niklas Witzig and Tim Klausmann and Mattia Cerrato\n  and Tobias Schweitzer and Jochen Weber and Erdem Yilmaz and Juan Chimbo and\n  Bernardo del Campo and Lissete Davila and David Barreno","authorsParsed":[["Köppel","Marius",""],["Witzig","Niklas",""],["Klausmann","Tim",""],["Cerrato","Mattia",""],["Schweitzer","Tobias",""],["Weber","Jochen",""],["Yilmaz","Erdem",""],["Chimbo","Juan",""],["del Campo","Bernardo",""],["Davila","Lissete",""],["Barreno","David",""]],"versions":[{"version":"v1","created":"Tue, 10 Dec 2024 19:30:11 GMT"}],"updateDate":"2024-12-12","timestamp":1733859011000,"abstract":"  The global Biochar Industry has witnessed a surge in biochar production, with\na total of 350k mt/year production in 2023. With the pressing climate goals set\nand the potential of Biochar Carbon Removal (BCR) as a climate-relevant\ntechnology, scaling up the number of new plants to over 1000 facilities per\nyear by 2030 becomes imperative. However, such a massive scale-up presents not\nonly technical challenges but also control and regulation issues, ensuring\nmaximal output of plants while conforming to regulatory requirements.\n  In this paper, we present a novel method of optimizing the process of a\nbiochar plant based on machine learning methods. We show how a standard Random\nForest Regressor can be used to model the states of the pyrolysis machine, the\nphysics of which remains highly complex. This model then serves as a surrogate\nof the machine -- reproducing several key outcomes of the machine -- in a\nnumerical optimization. This, in turn, could enable us to reduce NOx emissions\n-- a key regulatory goal in that industry -- while achieving maximal output\nstill. In a preliminary test our approach shows remarkable results, proves to\nbe applicable on two different machines from different manufacturers, and can\nbe implemented on standard Internet of Things (IoT) devices more generally.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computer Science/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"9qD9c9jRKmbOevjb_o76ij1IVyccgnvqcVt_NB6yTCg","pdfSize":"1638922"}