{"id":"2412.15313","title":"Surface Modification and Subsequent Fermi Density Enhancement of Bi(111)","authors":"Kuanysh Zhussupbekov, Killian Walshe, Brian Walls, Andrei Ionov,\n  Sergei I. Bozhko, Andrei Ksenz, Rais N. Mozhchil, Ainur Zhussupbekova,\n  Karsten Fleischer, Samuel Berman, Ivan Zhilyaev, David D. O'Regan and Igor V.\n  Shvets","authorsParsed":[["Zhussupbekov","Kuanysh",""],["Walshe","Killian",""],["Walls","Brian",""],["Ionov","Andrei",""],["Bozhko","Sergei I.",""],["Ksenz","Andrei",""],["Mozhchil","Rais N.",""],["Zhussupbekova","Ainur",""],["Fleischer","Karsten",""],["Berman","Samuel",""],["Zhilyaev","Ivan",""],["O'Regan","David D.",""],["Shvets","Igor V.",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 16:19:54 GMT"}],"updateDate":"2024-12-23","timestamp":1734625194000,"abstract":"  Defects introduced to the surface of Bi(111) break the translational symmetry\nand modify the surface states locally. We present a theoretical and\nexperimental study of the 2D defects on the surface of Bi(111) and the states\nthat they induce. Bi crystals cleaved in ultrahigh vacuum (UHV) at low\ntemperature (110 K) and the resulting ion-etched surface are investigated by\nlow-energy electron diffraction (LEED), X-ray photoelectron spectroscopy,\nultraviolet photoelectron spectroscopy (UPS), and scanning tunneling microscopy\n(STM) as well as spectroscopy (STS) techniques in combination with density\nfunctional theory (DFT) calculations. STS measurements of cleaved Bi(111)\nreveal that a commonly observed bilayer step edge has a lower density of states\n(DOS) around the Fermi level as compared to the atomic-flat terrace. Following\nion bombardment, the Bi(111) surface reveals anomalous behavior at both 110 and\n300 K: Surface periodicity is observed by LEED, and a significant increase in\nthe number of bilayer step edges and energetically unfavorable monolayer steps\nis observed by STM. It is suggested that the newly exposed monolayer steps and\nthe type A bilayer step edges result in an increase to the surface Fermi\ndensity as evidenced by UPS measurements and the Kohn-Sham DOS. These states\nappear to be thermodynamically stable under UHV conditions.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics","Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"BX01auJ2r4f4PCm1iFuAjunT_VoRSR9tHbrd3BbgQ3w","pdfSize":"8178425"}