{"id":"2412.16297","title":"Atomic resolution imaging of 3D crystallography in functional oxide thin\n  films","authors":"Ian MacLaren, Aurys Silinga, Juri Barthel, Josee Kleibeuker, Judith L\n  MacManus-Driscoll, Christopher S Allen, Angus I Kirkland","authorsParsed":[["MacLaren","Ian",""],["Silinga","Aurys",""],["Barthel","Juri",""],["Kleibeuker","Josee",""],["MacManus-Driscoll","Judith L",""],["Allen","Christopher S",""],["Kirkland","Angus I",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 19:14:57 GMT"}],"updateDate":"2024-12-24","timestamp":1734722097000,"abstract":"  Whilst atomic resolution imaging in the scanning transmission electron\nmicroscope (STEM) has revolutionized science and technology, it cannot see\nthings happening out of the plane of the image and merely forms projection\nimages. In this article we show that it is possible to directly map the\ndirection and magnitude of atom displacements at 30{\\deg} to the imaging plane\nin a La2CoMnO6 thin film on (111) LSAT (LaAlO3-(Sr,Ta)AlO3) using a\n4-dimensional scanning transmission electron microscopy (4DSTEM) methodology.\nThe interpretation is backed up by analysis of theoretical simulations. We\nreveal that the b-axis always lies in the plane of interface in every area we\nlooked at, and that the atom modulation is strongly suppressed close to the\nepitaxial interface. This crystallographic detail was not previously revealed\nor visible by conventional STEM imaging and the new methodology sheds a lot\nmore light on why this particular substrate in this orientation best promotes\ndouble perovskite cation ordering and consequently the best achieved magnetic\nordering in this thin film system. This approach of fitting atomic resolution\n4DSTEM data to determine crystal parameters opens the door for a new era of\natomic-resolution crystallography.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"N7uMJzzUQyrpbwwmuFet0xoGGTVLSdEHhmfwQowhDsc","pdfSize":"2667206"}