{
  "id": "2412.03879",
  "title": "E-Commerce in Africa: Divergent Impacts on Rural and Urban Economies",
  "authors": "Jaelyn S. Liang, Rehaan S. Mundy, Shriya Jagwayan",
  "authorsParsed": [
    [
      "Liang",
      "Jaelyn S.",
      ""
    ],
    [
      "Mundy",
      "Rehaan S.",
      ""
    ],
    [
      "Jagwayan",
      "Shriya",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 5 Dec 2024 05:21:32 GMT"
    }
  ],
  "updateDate": "2024-12-06",
  "timestamp": 1733376092000,
  "abstract": "  E-commerce is rapidly transforming economies across Africa, offering immense\nopportunities for economic growth, market expansion, and digital inclusion.\nThis study investigates the effects of e-commerce on select African regions. By\nutilizing readiness factors, including mobile money deployment, GDP per capita,\ninternet penetration, and digital infrastructure, the preparedness of African\ncountries for e-commerce adoption is quantified, highlighting significant\ndisparities. Through case studies in urban and rural areas, including Lagos,\nKano, Nairobi, and the Rift Valley, the study shows e-commerce's significant\neffects on small and medium-sized enterprises (SMEs), employment, and market\nefficiency. Urban centers demonstrated significant gains in productivity and\nprofitability, whereas rural regions experienced slower growth due to limited\ninternet access and infrastructural barriers. Despite these challenges,\nlocalized solutions such as mobile money systems and agricultural e-commerce\nplatforms are bridging gaps. This study highlights the significant potential of\ne-commerce in Africa while emphasizing the need for targeted investments and\nstrategies to address existing regional disparities.\n",
  "subjects": [
    "Economics/General Economics",
    "Quantitative Finance/Economics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "we3i52oKp_yhJxH9YH1RvKAJVrAPIxIGS2GpV-LOwd0",
  "pdfSize": "426308"
}