{
  "id": "2412.07621",
  "title": "NICER Spectral and Timing Analysis of 4U 1630$-$47 and its Heartbeat\n  State",
  "authors": "Ningyue Fan, James F. Steiner, Cosimo Bambi, Erin Kara, Yuexin Zhang,\n  Ole K\\\"onig",
  "authorsParsed": [
    [
      "Fan",
      "Ningyue",
      ""
    ],
    [
      "Steiner",
      "James F.",
      ""
    ],
    [
      "Bambi",
      "Cosimo",
      ""
    ],
    [
      "Kara",
      "Erin",
      ""
    ],
    [
      "Zhang",
      "Yuexin",
      ""
    ],
    [
      "König",
      "Ole",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 15:57:38 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733846258000,
  "abstract": "  We present a spectral and timing analysis of NICER observations of the black\nhole X-ray binary 4U 1630-47 from 2018 to 2024. We find relativistic reflection\nfeatures in the hard and soft intermediate states, and disk wind absorption\nfeatures in the soft intermediate state and soft state. We fit the reflection\nfeatures with RELXILLCP and find a stable and untruncated disk in the\nintermediate states; we fit the wind features with ZXIPCF and find a stable,\nhighly ionized wind with high column density across different outbursts.\nSpecifically, the heartbeat state is seen in two observations in 2021 and 2023\nrespectively. Through the phase-resolved spectral fitting, we find the flux to\nbe correlated with the disk parameters while no strong correlation with the\ncoronal parameters is observed, consistent with the scenario given by the inner\ndisk radiation instability. A significant hard lag on the time scale of a\nsecond and high coherence is observed near the characteristic frequency of the\nheartbeat, which can be explained by the viscous propagation of mass accretion\nfluctuations in the disk. The positive relationship between the heartbeat\nfractional rms and energy can possibly be explained by a disk-originated\noscillation which is then magnified by the corona scattering.\n",
  "subjects": [
    "Astrophysics/High Energy Astrophysical Phenomena"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "cU81_vnyyyPInBKZHLBzgyPHUxNlASJHPhFXlxtvEnE",
  "pdfSize": "1638076"
}