{"id":"2412.20206","title":"Towards Visual Grounding: A Survey","authors":"Linhui Xiao, Xiaoshan Yang, Xiangyuan Lan, Yaowei Wang, Changsheng Xu","authorsParsed":[["Xiao","Linhui",""],["Yang","Xiaoshan",""],["Lan","Xiangyuan",""],["Wang","Yaowei",""],["Xu","Changsheng",""]],"versions":[{"version":"v1","created":"Sat, 28 Dec 2024 16:34:35 GMT"}],"updateDate":"2024-12-31","timestamp":1735403675000,"abstract":"  Visual Grounding is also known as Referring Expression Comprehension and\nPhrase Grounding. It involves localizing a natural number of specific regions\nwithin an image based on a given textual description. The objective of this\ntask is to emulate the prevalent referential relationships in social\nconversations, equipping machines with human-like multimodal comprehension\ncapabilities. Consequently, it has extensive applications in various domains.\nHowever, since 2021, visual grounding has witnessed significant advancements,\nwith emerging new concepts such as grounded pre-training, grounding multimodal\nLLMs, generalized visual grounding, and giga-pixel grounding, which have\nbrought numerous new challenges. In this survey, we initially examine the\ndevelopmental history of visual grounding and provide an overview of essential\nbackground knowledge. We systematically track and summarize the advancements\nand meticulously organize the various settings in visual grounding, thereby\nestablishing precise definitions of these settings to standardize future\nresearch and ensure a fair comparison. Additionally, we delve into several\nadvanced topics and highlight numerous applications of visual grounding.\nFinally, we outline the challenges confronting visual grounding and propose\nvaluable directions for future research, which may serve as inspiration for\nsubsequent researchers. By extracting common technical details, this survey\nencompasses the representative works in each subtopic over the past decade. To\nthe best, this paper presents the most comprehensive overview currently\navailable in the field of grounding. This survey is designed to be suitable for\nboth beginners and experienced researchers, serving as an invaluable resource\nfor understanding key concepts and tracking the latest research developments.\nWe keep tracing related works at\nhttps://github.com/linhuixiao/Awesome-Visual-Grounding.\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"V5BgBYOIVlTR4tzlgK928DYteo-PKNY7cV5E0zkHXq4","pdfSize":"4155628"}