{
  "id": "2412.18097",
  "title": "LangYa: Revolutionizing Cross-Spatiotemporal Ocean Forecasting",
  "authors": "Nan Yang, Chong Wang, Meihua Zhao, Zimeng Zhao, Huiling Zheng, Bin\n  Zhang, Jianing Wang, Xiaofeng Li",
  "authorsParsed": [
    [
      "Yang",
      "Nan",
      ""
    ],
    [
      "Wang",
      "Chong",
      ""
    ],
    [
      "Zhao",
      "Meihua",
      ""
    ],
    [
      "Zhao",
      "Zimeng",
      ""
    ],
    [
      "Zheng",
      "Huiling",
      ""
    ],
    [
      "Zhang",
      "Bin",
      ""
    ],
    [
      "Wang",
      "Jianing",
      ""
    ],
    [
      "Li",
      "Xiaofeng",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 24 Dec 2024 02:14:39 GMT"
    },
    {
      "version": "v2",
      "created": "Wed, 25 Dec 2024 06:28:54 GMT"
    }
  ],
  "updateDate": "2024-12-30",
  "timestamp": 1735006479000,
  "abstract": "  Ocean forecasting is crucial for both scientific research and societal\nbenefits. Currently, the most accurate forecasting systems are global ocean\nforecasting systems (GOFSs), which represent the ocean state variables (OSVs)\nas discrete grids and solve partial differential equations (PDEs) governing the\ntransitions of oceanic state variables using numerical methods. However, GOFSs\nprocesses are computationally expensive and prone to cumulative errors.\nRecently, large artificial intelligence (AI)-based models significantly boosted\nforecasting speed and accuracy. Unfortunately, building a large AI ocean\nforecasting system that can be considered cross-spatiotemporal and air-sea\ncoupled forecasts remains a significant challenge. Here, we introduce LangYa, a\ncross-spatiotemporal and air-sea coupled ocean forecasting system. Results\ndemonstrate that the time embedding module in LangYa enables a single model to\nmake forecasts with lead times ranging from 1 to 7 days. The air-sea coupled\nmodule effectively simulates air-sea interactions. The ocean self-attention\nmodule improves network stability and accelerates convergence during training,\nand the adaptive thermocline loss function improves the accuracy of thermocline\nforecasting. Compared to existing numerical and AI-based ocean forecasting\nsystems, LangYa uses 27 years of global ocean data from the Global Ocean\nReanalysis and Simulation version 12 (GLORYS12) for training and achieves more\nreliable deterministic forecasting results for OSVs. LangYa forecasting system\nprovides global ocean researchers with access to a powerful software tool for\naccurate ocean forecasting and opens a new paradigm for ocean science.\n",
  "subjects": [
    "Physics/Atmospheric and Oceanic Physics",
    "Computer Science/Artificial Intelligence"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "EJZns-UL8VSdfkepzS-gG20eXb77NJd-WvNtIm9SNw0",
  "pdfSize": "3621244"
}