{
  "id": "2412.05946",
  "title": "Evaluating the Predictive Capacity of FLARES Simulations for High\n  Redshift \"Little Red Dots\"",
  "authors": "Louis M. T. Arts",
  "authorsParsed": [
    [
      "Arts",
      "Louis M. T.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sun, 8 Dec 2024 14:05:30 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733666730000,
  "abstract": "  The recent discovery of little red dots - a population of extremely compact\nand highly dust-reddened high redshift galaxies - by the James Webb Space\nTelescope presents a new challenge to the fields of astrophysics and cosmology.\nTheir remarkably high luminosities at redshifts 5 < z < 10, appear to challenge\nLambdaCDM cosmology and galaxy formation models, as they imply stellar masses\nand star formation rates that exceed the upper limits set by these models. LRDs\nare currently subjects of debate as the mechanisms behind their high\nluminosities are not yet fully understood. LRD energy outputs are thought to be\neither dominated by star formation or their energy output results from the\nhosting of active galactic nuclei. We investigate the starburst hypothesis by\nattempting to replicate the stellar properties of LRDs using output data from\nthe FLARES simulation suite. Comparative analysis of galactic properties such\nas galactic number density, stellar mass and star formation rate yield\nsignificant tension between simulated and observed galaxies. The FLARES\nsimulation overestimates the number densities of galaxies with stellar masses\nsimilar to observed LRDs by several orders of magnitude. Additionally, the\nsimulation shows an overestimation of star formation rates. These tensions\nsuggest a potential underestimation by the FLARES model of stellar feedback\nmechanisms such as active galactic nuclei feedback. These results suggest that\nthe starburst hypothesis may be insufficient to explain the observed properties\nof these galaxies. Instead, the AGN scenario should be further investigated by\nrepeating the methods in this study with a hydrodynamic galaxy simulation suite\nthat models a higher influence of AGN feedback mechanisms on stellar activity\nin high redshift galaxies.\n",
  "subjects": [
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by-sa/4.0/",
  "blobId": "XYfyKA19m7w1N8N4QeZ1lWEsh-4ssyZfbF_uz3z60Y8",
  "pdfSize": "9892267"
}