{
  "id": "2412.07595",
  "title": "On volume density and star formation in nearby molecular clouds",
  "authors": "Jan H. Orkisz and Jouni Kainulainen",
  "authorsParsed": [
    [
      "Orkisz",
      "Jan H.",
      ""
    ],
    [
      "Kainulainen",
      "Jouni",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 10 Dec 2024 15:31:41 GMT"
    }
  ],
  "updateDate": "2024-12-11",
  "timestamp": 1733844701000,
  "abstract": "  Volume density is a key physical quantity controlling the evolution of the\ninterstellar medium (ISM) and star formation, but it cannot be accessed\ndirectly by observations of molecular clouds. We aim at estimating the volume\ndensity distribution in nearby molecular clouds, to measure the relation\nbetween column and volume densities and to determine their roles as predictors\nof star formation. We develop an inverse modelling method to estimate the\nvolume density distributions of molecular clouds. We apply this method to 24\nnearby molecular clouds for which column densities have been derived using\nHerschel observations and for which star formation efficiencies (SFE) have been\nderived using observations with the Spitzer space telescope. We then compare\nthe relationships of several column- and volume-density based descriptors of\ndense gas with the SFE of the clouds. We derive volume density distributions\nfor 24 nearby molecular clouds, which represents the most complete sample of\nsuch distributions to date. The relationship between column densities and peak\nvolume densities in these clouds is a piece-wise power-law relation that\nchanges its slope at a column density of $5-10\\times 10^{22}$ H$_2$cm$^{-2}$.\nWe interpret this as a signature of hierarchical fragmentation in the dense\nISM. We find that the volume-density based dense gas fraction is the best\npredictor of star formation in the clouds, and in particular, it is as\nanticipated a better predictor than the column-density based dense gas\nfraction. We also derive a volume density threshold density for star formation\nof $2\\times 10^4$ H$_2$cm$^{-3}$.\n",
  "subjects": [
    "Astrophysics/Astrophysics of Galaxies"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "lFHgOwp4S1J1C7TsX7Ub6_XwMwsOFKsiEbsYYpzzs4Y",
  "pdfSize": "6769105"
}