{"id":"2412.12983","title":"Exploring natural variation in tendon constitutive parameters via\n  Bayesian data selection and mixed effects models","authors":"James Casey, Jessica Forsyth, Timothy Waite, Simon Cotter and Tom\n  Shearer","authorsParsed":[["Casey","James",""],["Forsyth","Jessica",""],["Waite","Timothy",""],["Cotter","Simon",""],["Shearer","Tom",""]],"versions":[{"version":"v1","created":"Tue, 17 Dec 2024 15:02:33 GMT"}],"updateDate":"2024-12-18","timestamp":1734447753000,"abstract":"  Combining microstructural mechanical models with experimental data enhances\nour understanding of the mechanics of soft tissue, such as tendons. In previous\nwork, a Bayesian framework was used to infer constitutive parameters from\nuniaxial stress-strain experiments on horse tendons, specifically the\nsuperficial digital flexor tendon (SDFT) and common digital extensor tendon\n(CDET), on a per-experiment basis. Here, we extend this analysis to investigate\nthe natural variation of these parameters across a population of horses. Using\na Bayesian mixed effects model, we infer population distributions of these\nparameters. Given that the chosen hyperelastic model does not account for\ntendon damage, careful data selection is necessary. Avoiding ad hoc methods, we\nintroduce a hierarchical Bayesian data selection method. This two-stage\napproach selects data per experiment, and integrates data weightings into the\nBayesian mixed effects model. Our results indicate that the CDET is stiffer\nthan the SDFT, likely due to a higher collagen volume fraction. The modes of\nthe parameter distributions yield estimates of the product of the collagen\nvolume fraction and Young's modulus as 811.5 MPa for the SDFT and 1430.2 MPa\nfor the CDET. This suggests that positional tendons have stiffer collagen\nfibrils and/or higher collagen volume density than energy-storing tendons.\n","subjects":["Statistics/Applications"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"HvFDvkEJB9boAIVGSnNoQsfZkD2_I1FGoq6-mb91DcA","pdfSize":"3202977"}