{
  "id": "2412.15911",
  "title": "Kernel shape renormalization explains output-output correlations in\n  finite Bayesian one-hidden-layer networks",
  "authors": "P. Baglioni, L. Giambagli, A. Vezzani, R. Burioni, P. Rotondo, R.\n  Pacelli",
  "authorsParsed": [
    [
      "Baglioni",
      "P.",
      ""
    ],
    [
      "Giambagli",
      "L.",
      ""
    ],
    [
      "Vezzani",
      "A.",
      ""
    ],
    [
      "Burioni",
      "R.",
      ""
    ],
    [
      "Rotondo",
      "P.",
      ""
    ],
    [
      "Pacelli",
      "R.",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 14:01:16 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734703276000,
  "abstract": "  Finite-width one hidden layer networks with multiple neurons in the readout\nlayer display non-trivial output-output correlations that vanish in the\nlazy-training infinite-width limit. In this manuscript we leverage recent\nprogress in the proportional limit of Bayesian deep learning (that is the limit\nwhere the size of the training set $P$ and the width of the hidden layers $N$\nare taken to infinity keeping their ratio $\\alpha = P/N$ finite) to rationalize\nthis empirical evidence. In particular, we show that output-output correlations\nin finite fully-connected networks are taken into account by a kernel shape\nrenormalization of the infinite-width NNGP kernel, which naturally arises in\nthe proportional limit. We perform accurate numerical experiments both to\nassess the predictive power of the Bayesian framework in terms of\ngeneralization, and to quantify output-output correlations in finite-width\nnetworks. By quantitatively matching our predictions with the observed\ncorrelations, we provide additional evidence that kernel shape renormalization\nis instrumental to explain the phenomenology observed in finite Bayesian one\nhidden layer networks.\n",
  "subjects": [
    "Condensed Matter/Disordered Systems and Neural Networks"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "alCbsv5hsZMntNN3kNKLRhLM49S-3neh5zkkJcNxKGo",
  "pdfSize": "1591573"
}