{"id":"2412.16511","title":"Context-Aware Outlier Rejection for Robust Multi-View 3D Tracking of\n  Similar Small Birds in An Outdoor Aviary","authors":"Keon Moradi, Ethan Haque, Jasmeen Kaur, Alexandra B. Bentz, Eli S.\n  Bridge, Golnaz Habibi","authorsParsed":[["Moradi","Keon",""],["Haque","Ethan",""],["Kaur","Jasmeen",""],["Bentz","Alexandra B.",""],["Bridge","Eli S.",""],["Habibi","Golnaz",""]],"versions":[{"version":"v1","created":"Sat, 21 Dec 2024 07:20:57 GMT"}],"updateDate":"2024-12-24","timestamp":1734765657000,"abstract":"  This paper presents a novel approach for robust 3D tracking of multiple birds\nin an outdoor aviary using a multi-camera system. Our method addresses the\nchallenges of visually similar birds and their rapid movements by leveraging\nenvironmental landmarks for enhanced feature matching and 3D reconstruction. In\nour approach, outliers are rejected based on their nearest landmark. This\nenables precise 3D-modeling and simultaneous tracking of multiple birds. By\nutilizing environmental context, our approach significantly improves the\ndifferentiation between visually similar birds, a key obstacle in existing\ntracking systems. Experimental results demonstrate the effectiveness of our\nmethod, showing a $20\\%$ elimination of outliers in the 3D reconstruction\nprocess, with a $97\\%$ accuracy in matching. This remarkable accuracy in 3D\nmodeling translates to robust and reliable tracking of multiple birds, even in\nchallenging outdoor conditions. Our work not only advances the field of\ncomputer vision but also provides a valuable tool for studying bird behavior\nand movement patterns in natural settings. We also provide a large annotated\ndataset of 80 birds residing in four enclosures for 20 hours of footage which\nprovides a rich testbed for researchers in computer vision, ornithologists, and\necologists. Code and the link to the dataset is available at\nhttps://github.com/airou-lab/3D_Multi_Bird_Tracking\n","subjects":["Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"UhRwJIF6Wtd7tKrg38sHzD033aqeX6b_RJAhS96LgWc","pdfSize":"39487471"}