{
  "id": "2412.05456",
  "title": "A Localized Reality Appears To Underpin Quantum Circuits",
  "authors": "Ken Wharton, Roderick Sutherland, Titus Amza, Raylor Liu and James\n  Saslow",
  "authorsParsed": [
    [
      "Wharton",
      "Ken",
      ""
    ],
    [
      "Sutherland",
      "Roderick",
      ""
    ],
    [
      "Amza",
      "Titus",
      ""
    ],
    [
      "Liu",
      "Raylor",
      ""
    ],
    [
      "Saslow",
      "James",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 6 Dec 2024 22:35:45 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733524545000,
  "abstract": "  Although entangled state vectors cannot be described in terms of classically\nrealistic variables, localized in space and time, any given entanglement\nexperiment can be built from basic quantum circuit components with well-defined\nlocations. By analyzing the (local) weak values for any given run of a quantum\ncircuit, we present evidence for a localized account of any circuit's behavior.\nSpecifically, even if the state is massively entangled, the weak values are\nfound to evolve only when they pass through a local circuit element. They\notherwise remain constant and do not evolve when other qubits pass through\ntheir circuit elements. A further surprise is found when two qubits are brought\ntogether in an exchange interaction, as their weak values then evolve according\nto a simple classical equation. The weak values are subject to both past and\nfuture constraints, so they can only be determined by considering the entire\ncircuit \"all-at-once\", as in action principles. In the context of a few basic\nquantum gates, we show how an all-at-once model of a complete circuit could\ngenerate weak values without using state vectors as an intermediate step. Since\nthese gates comprise a universal quantum gate set, this lends support to the\nclaim that any quantum circuit can plausibly be underpinned by localized\nvariables, providing a realistic, lower-level account of generic quantum\nsystems.\n",
  "subjects": [
    "Physics/Quantum Physics",
    "Physics/History and Philosophy of Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "xAI9ob0kYu4FiYZVN20HG61dR2cnZms-4RmOcMp3BfE",
  "pdfSize": "695477"
}