{
  "id": "2412.15760",
  "title": "Indistinguishable MHz-narrow heralded photon pairs from a whispering\n  gallery resonator",
  "authors": "Sheng-Hsuan Huang, Thomas Dirmeier, Golnoush Shafiee, Kaisa Laiho,\n  Dmitry V. Strekalov, Andrea Aiello, Gerd Leuchs and Christoph Marquardt",
  "authorsParsed": [
    [
      "Huang",
      "Sheng-Hsuan",
      ""
    ],
    [
      "Dirmeier",
      "Thomas",
      ""
    ],
    [
      "Shafiee",
      "Golnoush",
      ""
    ],
    [
      "Laiho",
      "Kaisa",
      ""
    ],
    [
      "Strekalov",
      "Dmitry V.",
      ""
    ],
    [
      "Aiello",
      "Andrea",
      ""
    ],
    [
      "Leuchs",
      "Gerd",
      ""
    ],
    [
      "Marquardt",
      "Christoph",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Fri, 20 Dec 2024 10:25:29 GMT"
    }
  ],
  "updateDate": "2024-12-23",
  "timestamp": 1734690329000,
  "abstract": "  Hong-Ou-Mandel interference plays a vital role in many quantum optical\napplications where indistinguishability of two photons is important. Such\nphoton pairs are commonly generated as the signal and idler in the frequency\nand polarization-degenerate spontaneous parametric down conversion~(SPDC). To\nscale this approach to a larger number of photons we demonstrate how two\nindependent signal photons radiated into different spatial modes can be\nrendered conditionally indistinguishable by a heralding measurement performed\non their respective idlers. We use the SPDC in a whispering gallery resonator,\nwhich is already proven to be versatile sources of quantum states. Its extreme\nconversion efficiency allowed us to perform our measurements with only\n\\qty{50}{nW} of in-coupled pump power in each propagation direction. The\nHong-Ou-Mandel interference of two counter-propagating signal photons\nmanifested itself in the four-fold coincidence rate, where the two idler\nphotons detection heralds a pair of signal photons with a desired temporal\noverlap. We achieved the Hong-Ou-Mandel dip contrast of \\(74\\pm 5\\%\\).\nImportantly, the optical bandwidth of all involved photons is of the order of a\nMHz and is continuously tunable. This, on the one hand, makes it possible to\nachieve the necessary temporal measurements resolution with standard\nelectronics, and on the other hand, creates a quantum states source compatible\nwith other candidates for qubit implementation, such as optical transitions in\nsolid-state or vaporous systems. We also discuss the possibility of generating\nphoton pairs with similar temporal modes from two different whispering gallery\nresonators.\n",
  "subjects": [
    "Physics/Quantum Physics",
    "Physics/Optics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "pHpLA7wr8q3qmnLtZ-Za5xS8TuuiXOBfznpOgR2bSOs",
  "pdfSize": "775836"
}