{
  "id": "2412.12469",
  "title": "Optimal Control Operator Perspective and a Neural Adaptive Spectral\n  Method",
  "authors": "Mingquan Feng, Zhijie Chen, Yixin Huang, Yizhou Liu, Junchi Yan",
  "authorsParsed": [
    [
      "Feng",
      "Mingquan",
      ""
    ],
    [
      "Chen",
      "Zhijie",
      ""
    ],
    [
      "Huang",
      "Yixin",
      ""
    ],
    [
      "Liu",
      "Yizhou",
      ""
    ],
    [
      "Yan",
      "Junchi",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 17 Dec 2024 02:06:34 GMT"
    }
  ],
  "updateDate": "2024-12-18",
  "timestamp": 1734401194000,
  "abstract": "  Optimal control problems (OCPs) involve finding a control function for a\ndynamical system such that a cost functional is optimized. It is central to\nphysical systems in both academia and industry. In this paper, we propose a\nnovel instance-solution control operator perspective, which solves OCPs in a\none-shot manner without direct dependence on the explicit expression of\ndynamics or iterative optimization processes. The control operator is\nimplemented by a new neural operator architecture named Neural Adaptive\nSpectral Method (NASM), a generalization of classical spectral methods. We\ntheoretically validate the perspective and architecture by presenting the\napproximation error bounds of NASM for the control operator. Experiments on\nsynthetic environments and a real-world dataset verify the effectiveness and\nefficiency of our approach, including substantial speedup in running time, and\nhigh-quality in- and out-of-distribution generalization.\n",
  "subjects": [
    "Electrical Engineering and Systems Science/Systems and Control",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Machine Learning",
    "Computer Science/Systems and Control",
    "Mathematics/Optimization and Control"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/",
  "blobId": "g5arz8JCSzGx0V54dSv7qAxVc1t9CgoLKMVaYAGlAf4",
  "pdfSize": "1478724"
}