{
  "id": "2412.20009",
  "title": "SolarDesign: An Online Photovoltaic Device Simulation and Design\n  Platform",
  "authors": "Wei E. I. Sha, Xiaoyu Wang, Wenchao Chen, Yuhao Fu, Lijun Zhang, Liang\n  Tian, Minshen Lin, Shudi Jiao, Ting Xu, Tiange Sun, and Dongxue Liu",
  "authorsParsed": [
    [
      "Sha",
      "Wei E. I.",
      ""
    ],
    [
      "Wang",
      "Xiaoyu",
      ""
    ],
    [
      "Chen",
      "Wenchao",
      ""
    ],
    [
      "Fu",
      "Yuhao",
      ""
    ],
    [
      "Zhang",
      "Lijun",
      ""
    ],
    [
      "Tian",
      "Liang",
      ""
    ],
    [
      "Lin",
      "Minshen",
      ""
    ],
    [
      "Jiao",
      "Shudi",
      ""
    ],
    [
      "Xu",
      "Ting",
      ""
    ],
    [
      "Sun",
      "Tiange",
      ""
    ],
    [
      "Liu",
      "Dongxue",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Sat, 28 Dec 2024 04:07:59 GMT"
    }
  ],
  "updateDate": "2024-12-31",
  "timestamp": 1735358879000,
  "abstract": "  SolarDesign (https://solardesign.cn/) is an online photovoltaic device\nsimulation and design platform that provides engineering modeling analysis for\ncrystalline silicon solar cells, as well as emerging high-efficiency solar\ncells such as organic, perovskite, and tandem cells. The platform offers\nuser-updatable libraries of basic photovoltaic materials and devices,\ndevice-level multi-physics simulations involving optical-electrical-thermal\ninteractions, and circuit-level compact model simulations based on detailed\nbalance theory. Employing internationally advanced numerical methods, the\nplatform accurately, rapidly, and efficiently solves optical absorption,\nelectrical transport, and compact circuit models. It achieves multi-level\nphotovoltaic simulation technology from ``materials to devices to circuits''\nwith fully independent intellectual property rights. Compared to commercial\nsoftware, the platform achieves high accuracy and improves speed by more than\nan order of magnitude. Additionally, it can simulate unique electrical\ntransport processes in emerging solar cells, such as quantum tunneling, exciton\ndissociation, and ion migration.\n",
  "subjects": [
    "Physics/Optics",
    "Condensed Matter/Materials Science",
    "Physics/Applied Physics",
    "Physics/Computational Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "kFts_b8T6IDD5g-wG2YqIj-a11-g7kvvYxa93hVhZX4",
  "pdfSize": "4224332"
}