{"id":"2412.04912","title":"UniMIC: Towards Universal Multi-modality Perceptual Image Compression","authors":"Yixin Gao, Xin Li, Xiaohan Pan, Runsen Feng, Zongyu Guo, Yiting Lu,\n  Yulin Ren, Zhibo Chen","authorsParsed":[["Gao","Yixin",""],["Li","Xin",""],["Pan","Xiaohan",""],["Feng","Runsen",""],["Guo","Zongyu",""],["Lu","Yiting",""],["Ren","Yulin",""],["Chen","Zhibo",""]],"versions":[{"version":"v1","created":"Fri, 6 Dec 2024 10:08:55 GMT"},{"version":"v2","created":"Mon, 9 Dec 2024 09:50:00 GMT"}],"updateDate":"2024-12-10","timestamp":1733479735000,"abstract":"  We present UniMIC, a universal multi-modality image compression framework,\nintending to unify the rate-distortion-perception (RDP) optimization for\nmultiple image codecs simultaneously through excavating cross-modality\ngenerative priors. Unlike most existing works that need to design and optimize\nimage codecs from scratch, our UniMIC introduces the visual codec repository,\nwhich incorporates amounts of representative image codecs and directly uses\nthem as the basic codecs for various practical applications. Moreover, we\npropose multi-grained textual coding, where variable-length content prompt and\ncompression prompt are designed and encoded to assist the perceptual\nreconstruction through the multi-modality conditional generation. In\nparticular, a universal perception compensator is proposed to improve the\nperception quality of decoded images from all basic codecs at the decoder side\nby reusing text-assisted diffusion priors from stable diffusion. With the\ncooperation of the above three strategies, our UniMIC achieves a significant\nimprovement of RDP optimization for different compression codecs, e.g.,\ntraditional and learnable codecs, and different compression costs, e.g.,\nultra-low bitrates. The code will be available in\nhttps://github.com/Amygyx/UniMIC .\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computer Science/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"6pMLBfeIrBZmBvrCKywRQhROTChxMcL6xM9B_W1JE18","pdfSize":"30093617"}