{"id":"2412.11794","title":"But Can You Use It? Design Recommendations for Differentially Private\n  Interactive Systems","authors":"Liudas Panavas, Joshua Snoke, Erika Tyagi, Claire McKay Bowen, Aaron\n  R. Williams","authorsParsed":[["Panavas","Liudas",""],["Snoke","Joshua",""],["Tyagi","Erika",""],["Bowen","Claire McKay",""],["Williams","Aaron R.",""]],"versions":[{"version":"v1","created":"Mon, 16 Dec 2024 14:07:16 GMT"}],"updateDate":"2024-12-17","timestamp":1734358036000,"abstract":"  Accessing data collected by federal statistical agencies is essential for\npublic policy research and improving evidence-based decision making, such as\nevaluating the effectiveness of social programs, understanding demographic\nshifts, or addressing public health challenges. Differentially private\ninteractive systems, or validation servers, can form a crucial part of the\ndata-sharing infrastructure. They may allow researchers to query targeted\nstatistics, providing flexible, efficient access to specific insights, reducing\nthe need for broad data releases and supporting timely, focused research.\nHowever, they have not yet been practically implemented. While substantial\ntheoretical work has been conducted on the privacy and accuracy guarantees of\ndifferentially private mechanisms, prior efforts have not considered usability\nas an explicit goal of interactive systems. This work outlines and considers\nthe barriers to developing differentially private interactive systems for\ninforming public policy and offers an alternative way forward. We propose\nbalancing three design considerations: privacy assurance, statistical utility,\nand system usability, we develop recommendations for making differentially\nprivate interactive systems work in practice, we present an example\narchitecture based on these recommendations, and we provide an outline of how\nto conduct the necessary user-testing. Our work seeks to move the practical\ndevelopment of differentially private interactive systems forward to better aid\npublic policy making and spark future research.\n","subjects":["Computer Science/Human-Computer Interaction","Computer Science/Cryptography and Security","Statistics/Applications"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"l4Dq8ggUB5qXWhCXni9bA9jTslCASURpvOVZjMnGeMk","pdfSize":"563447"}