{"id":"2412.15707","title":"Online Optimization Algorithms in Repeated Price Competition:\n  Equilibrium Learning and Algorithmic Collusion","authors":"Martin Bichler, Julius Durmann, Matthias Oberlechner","authorsParsed":[["Bichler","Martin",""],["Durmann","Julius",""],["Oberlechner","Matthias",""]],"versions":[{"version":"v1","created":"Fri, 20 Dec 2024 09:29:57 GMT"}],"updateDate":"2024-12-23","timestamp":1734686997000,"abstract":"  This paper addresses the question of whether or not uncoupled online learning\nalgorithms converge to the Nash equilibrium in pricing competition or whether\nthey can learn to collude. Algorithmic collusion has been debated among\ncompetition regulators, and it is a highly relevant phenomenon for buyers and\nsellers on online retail platforms. We analyze formally if mean-based\nalgorithms, a class of bandit algorithms relevant to algorithmic pricing,\nconverge to the Nash equilibrium in repeated Bertrand oligopolies. Bandit\nalgorithms only learn the profit of the agent for the price set in each step.\nIn addition, we provide results of extensive experiments with different types\nof multi-armed bandit algorithms used for algorithmic pricing. In a\nmathematical proof, we show that mean-based algorithms converge to correlated\nrational strategy profiles, which coincide with the Nash equilibrium in\nversions of the Bertrand competition. Learning algorithms do not converge to a\nNash equilibrium in general, and the fact that Bertrand pricing games are\nlearnable with bandit algorithms is remarkable. Our numerical results suggest\nthat wide-spread bandit algorithms that are not mean-based also converge to\nequilibrium and that algorithmic collusion only arises with symmetric\nimplementations of UCB or Q-learning, but not if different algorithms are used\nby sellers. In addition, the level of supra-competitive prices decreases with\nincreasing numbers of sellers. Supra-competitive prices decrease consumer\nwelfare. If algorithms lead to algorithmic collusion, this is important for\nconsumers, sellers, and regulators to understand. We show that for the\nimportant class of multi-armed bandit algorithms such fears are overrated\nunless all sellers agree on a symmetric implementation of certain collusive\nalgorithms.\n","subjects":["Computer Science/Computer Science and Game Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"N6HIKGg-t7jAMOlte6mC1AEBJfrcZmfJMSxJm5lNT_4","pdfSize":"1530032"}