{"id":"2412.14985","title":"Exploration of the Dynamics of Buy and Sale of Social Media Accounts","authors":"Mario Beluri, Bhupendra Acharya, Soheil Khodayari, Giada Stivala,\n  Giancarlo Pellegrino and Thorsten Holz","authorsParsed":[["Beluri","Mario",""],["Acharya","Bhupendra",""],["Khodayari","Soheil",""],["Stivala","Giada",""],["Pellegrino","Giancarlo",""],["Holz","Thorsten",""]],"versions":[{"version":"v1","created":"Thu, 19 Dec 2024 15:58:37 GMT"}],"updateDate":"2024-12-20","timestamp":1734623917000,"abstract":"  There has been a rise in online platforms facilitating the buying and selling\nof social media accounts. While the trade of social media profiles is not\ninherently illegal, social media platforms view such transactions as violations\nof their policies. They often take action against accounts involved in the\nmisuse of platforms for financial gain. This research conducts a comprehensive\nanalysis of marketplaces that enable the buying and selling of social media\naccounts.\n  We investigate the economic scale of account trading across five major\nplatforms: X, Instagram, Facebook, TikTok, and YouTube. From February to June\n2024, we identified 38,253 accounts advertising account sales across 11 online\nmarketplaces, covering 211 distinct categories. The total value of marketed\nsocial media accounts exceeded \\$64 million, with a median price of \\$157 per\naccount. Additionally, we analyzed the profiles of 11,457 visible advertised\naccounts, collecting their metadata and over 200,000 profile posts. By\nexamining their engagement patterns and account creation methods, we evaluated\nthe fraudulent activities commonly associated with these sold accounts. Our\nresearch reveals these marketplaces foster fraudulent activities such as bot\nfarming, harvesting accounts for future fraud, and fraudulent engagement. Such\npractices pose significant risks to social media users, who are often targeted\nby fraudulent accounts resembling legitimate profiles and employing social\nengineering tactics. We highlight social media platform weaknesses in the\nability to detect and mitigate such fraudulent accounts, thereby endangering\nusers. Alongside this, we conducted thorough disclosures with the respective\nplatforms and proposed actionable recommendations, including indicators to\nidentify and track these accounts. These measures aim to enhance proactive\ndetection and safeguard users from potential threats.\n","subjects":["Computer Science/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"VnLfyInMtmvtN6JXKWv0LqQLVCF-QVH73WgCLG8Hkaw","pdfSize":"874227"}