{
  "id": "2412.03315",
  "title": "Geometry-guided Cross-view Diffusion for One-to-many Cross-view Image\n  Synthesis",
  "authors": "Tao Jun Lin, Wenqing Wang, Yujiao Shi, Akhil Perincherry, Ankit Vora\n  and Hongdong Li",
  "authorsParsed": [
    [
      "Lin",
      "Tao Jun",
      ""
    ],
    [
      "Wang",
      "Wenqing",
      ""
    ],
    [
      "Shi",
      "Yujiao",
      ""
    ],
    [
      "Perincherry",
      "Akhil",
      ""
    ],
    [
      "Vora",
      "Ankit",
      ""
    ],
    [
      "Li",
      "Hongdong",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 13:47:51 GMT"
    }
  ],
  "updateDate": "2024-12-05",
  "timestamp": 1733320071000,
  "abstract": "  This paper presents a novel approach for cross-view synthesis aimed at\ngenerating plausible ground-level images from corresponding satellite imagery\nor vice versa. We refer to these tasks as satellite-to-ground (Sat2Grd) and\nground-to-satellite (Grd2Sat) synthesis, respectively. Unlike previous works\nthat typically focus on one-to-one generation, producing a single output image\nfrom a single input image, our approach acknowledges the inherent one-to-many\nnature of the problem. This recognition stems from the challenges posed by\ndifferences in illumination, weather conditions, and occlusions between the two\nviews. To effectively model this uncertainty, we leverage recent advancements\nin diffusion models. Specifically, we exploit random Gaussian noise to\nrepresent the diverse possibilities learnt from the target view data. We\nintroduce a Geometry-guided Cross-view Condition (GCC) strategy to establish\nexplicit geometric correspondences between satellite and street-view features.\nThis enables us to resolve the geometry ambiguity introduced by camera pose\nbetween image pairs, boosting the performance of cross-view image synthesis.\nThrough extensive quantitative and qualitative analyses on three benchmark\ncross-view datasets, we demonstrate the superiority of our proposed\ngeometry-guided cross-view condition over baseline methods, including recent\nstate-of-the-art approaches in cross-view image synthesis. Our method generates\nimages of higher quality, fidelity, and diversity than other state-of-the-art\napproaches.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "dEEhu1ip8uoRZUd_7QR8y4zWnlIexnUMDiMgLmhXXxw",
  "pdfSize": "46220856"
}