{
  "id": "2412.07023",
  "title": "A Revision for the Draconic Gearing of the Antikythera Mechanism, the\n  eclipse events of Saros spiral and their classification",
  "authors": "Aristeidis Voulgaris, Christophoros Mouratidis and Andreas Vossinakis",
  "authorsParsed": [
    [
      "Voulgaris",
      "Aristeidis",
      ""
    ],
    [
      "Mouratidis",
      "Christophoros",
      ""
    ],
    [
      "Vossinakis",
      "Andreas",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Mon, 9 Dec 2024 22:09:14 GMT"
    },
    {
      "version": "v2",
      "created": "Mon, 16 Dec 2024 15:29:24 GMT"
    }
  ],
  "updateDate": "2024-12-17",
  "timestamp": 1733782154000,
  "abstract": "  Our research is focused on the missing, but important and necessary Draconic\ngearing of the Antikythera Mechanism. The three Lunar cycles Sidereal, Synodic\nand Anomalistic are represented on the Mechanism by correlating the Fragments A\nand C (part of the Front plate), whereas the fourth Lunar cycle Draconic\nresults after correlating the unplaced Fragment D with Fragment A. Considering\nthe deformation of the Mechanism s parts during 2000 years underwater and their\nshrinkage after their retraction from the sea bottom, we present a revised\ngearing scheme of the Draconic scale. The existence of the Draconic gearing is\ncrucial, because both the preserved and the missing eclipse events can be\nprecalculated by the phase correlation of three pointers: of the Lunar Disc, of\nthe Golden sphere/Sun-ray and the Draconic. This means that the eclipse events\nare calculated by pure mechanical processing and that they are not documented\nobserved events. The phase coordination of the three lunar cycles can be used\nas a quality criterion for a functional model of the Mechanism. Eudoxus papyrus\nwas the key for the lost words completion of the Back Plate inscriptions\neclipse events classification of the Antikythera Mechanism.\n",
  "subjects": [
    "Astrophysics/Instrumentation and Methods for Astrophysics",
    "Astrophysics/Earth and Planetary Astrophysics",
    "Physics/History and Philosophy of Physics",
    "Physics/Popular Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "Qp1XSAm4KjvRByqx7-Qo7dpBDSTjmxulB8Z5CsI_2L8",
  "pdfSize": "3388751"
}