{
  "id": "2412.14640",
  "title": "Adaptive Prompt Tuning: Vision Guided Prompt Tuning with Cross-Attention\n  for Fine-Grained Few-Shot Learning",
  "authors": "Eric Brouwer, Jan Erik van Woerden, Gertjan Burghouts, Matias\n  Valdenegro-Toro and Marco Zullich",
  "authorsParsed": [
    [
      "Brouwer",
      "Eric",
      ""
    ],
    [
      "van Woerden",
      "Jan Erik",
      ""
    ],
    [
      "Burghouts",
      "Gertjan",
      ""
    ],
    [
      "Valdenegro-Toro",
      "Matias",
      ""
    ],
    [
      "Zullich",
      "Marco",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Thu, 19 Dec 2024 08:51:01 GMT"
    },
    {
      "version": "v2",
      "created": "Wed, 1 Jan 2025 18:00:00 GMT"
    }
  ],
  "updateDate": "2025-01-03",
  "timestamp": 1734598261000,
  "abstract": "  Few-shot, fine-grained classification in computer vision poses significant\nchallenges due to the need to differentiate subtle class distinctions with\nlimited data. This paper presents a novel method that enhances the Contrastive\nLanguage-Image Pre-Training (CLIP) model through adaptive prompt tuning, guided\nby real-time visual inputs. Unlike existing techniques such as Context\nOptimization (CoOp) and Visual Prompt Tuning (VPT), which are constrained by\nstatic prompts or visual token reliance, the proposed approach leverages a\ncross-attention mechanism to dynamically refine text prompts for the image at\nhand. This enables an image-specific alignment of textual features with image\npatches extracted from the Vision Transformer, making the model more effective\nfor datasets with high intra-class variance and low inter-class differences.\nThe method is evaluated on several datasets, including CUBirds, Oxford Flowers,\nand FGVC Aircraft, showing significant performance gains over static prompt\ntuning approaches. To ensure these performance gains translate into trustworthy\npredictions, we integrate Monte-Carlo Dropout in our approach to improve the\nreliability of the model predictions and uncertainty estimates. This\nintegration provides valuable insights into the model's predictive confidence,\nhelping to identify when predictions can be trusted and when additional\nverification is necessary. This dynamic approach offers a robust solution,\nadvancing the state-of-the-art for few-shot fine-grained classification.\n",
  "subjects": [
    "Computer Science/Computer Vision and Pattern Recognition",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/",
  "blobId": "htGDBr8jO7eFhkCk0kyl3uDFKZpUVxotLGh5NMQgtao",
  "pdfSize": "2156367"
}