{"id":"2412.03411","title":"A dark, bare rock for TOI-1685 b from a JWST NIRSpec G395H phase curve","authors":"Rafael Luque, Brandon Park Coy, Qiao Xue, Adina D. Feinstein,\n  Eva-Maria Ahrer, Quentin Changeat, Michael Zhang, Sarah E. Moran, Jacob L.\n  Bean, Edwin Kite, Megan Weiner Mansfield, Enric Pall\\'e","authorsParsed":[["Luque","Rafael",""],["Coy","Brandon Park",""],["Xue","Qiao",""],["Feinstein","Adina D.",""],["Ahrer","Eva-Maria",""],["Changeat","Quentin",""],["Zhang","Michael",""],["Moran","Sarah E.",""],["Bean","Jacob L.",""],["Kite","Edwin",""],["Mansfield","Megan Weiner",""],["Pallé","Enric",""]],"versions":[{"version":"v1","created":"Wed, 4 Dec 2024 15:49:15 GMT"}],"updateDate":"2024-12-05","timestamp":1733327355000,"abstract":"  We report JWST NIRSpec/G395H observations of TOI-1685 b, a hot rocky\nsuper-Earth orbiting an M2.5V star, during a full orbit. We obtain transmission\nand emission spectra of the planet and characterize the properties of the phase\ncurve, including its amplitude and offset. The transmission spectrum rules out\nclear H$_2$-dominated atmospheres, while secondary atmospheres (made of water,\nmethane, or carbon dioxide) cannot be statistically distinguished from a flat\nline. The emission spectrum is featureless and consistent with a blackbody-like\nbrightness temperature, helping rule out thick atmospheres with high mean\nmolecular weight. Collecting all evidence, the properties of TOI-1685 b are\nconsistent with a blackbody with no heat redistribution and a low albedo, with\na dayside brightness temperature 0.98$\\pm$0.07 times that of a perfect\nblackbody in the NIRSpec NRS2 wavelength range (3.823-5.172 um). Our results\nadd to the growing number of seemingly airless M-star rocky planets, thus\nconstraining the location of the \"Cosmic Shoreline\".\n  Three independent data reductions have been carried out, all showing a\nhigh-amplitude correlated noise component in the white and spectroscopic light\ncurves. The correlated noise properties are different between the NRS1 and NRS2\ndetectors - importantly the timescales of the strongest components (4.5 hours\nand 2.5 hours, respectively) - suggesting the noise is from instrumental rather\nthan astrophysical origins. We encourage the community to look into the\nsystematics of NIRSpec for long time-series observations.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ItZn2wuQBy05XFkGKDu4pBsJKdLwiuYpoiRrNxQMvVk","pdfSize":"25340742"}