{
  "id": "2412.05327",
  "title": "IMPACT:InMemory ComPuting Architecture Based on Y-FlAsh Technology for\n  Coalesced Tsetlin Machine Inference",
  "authors": "Omar Ghazal, Wei Wang, Shahar Kvatinsky, Farhad Merchant, Alex\n  Yakovlev and Rishad Shafik",
  "authorsParsed": [
    [
      "Ghazal",
      "Omar",
      ""
    ],
    [
      "Wang",
      "Wei",
      ""
    ],
    [
      "Kvatinsky",
      "Shahar",
      ""
    ],
    [
      "Merchant",
      "Farhad",
      ""
    ],
    [
      "Yakovlev",
      "Alex",
      ""
    ],
    [
      "Shafik",
      "Rishad",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Wed, 4 Dec 2024 12:22:52 GMT"
    }
  ],
  "updateDate": "2024-12-10",
  "timestamp": 1733314972000,
  "abstract": "  The increasing demand for processing large volumes of data for machine\nlearning models has pushed data bandwidth requirements beyond the capability of\ntraditional von Neumann architecture. In-memory computing (IMC) has recently\nemerged as a promising solution to address this gap by enabling distributed\ndata storage and processing at the micro-architectural level, significantly\nreducing both latency and energy. In this paper, we present the IMPACT:\nInMemory ComPuting Architecture Based on Y-FlAsh Technology for Coalesced\nTsetlin Machine Inference, underpinned on a cutting-edge memory device,\nY-Flash, fabricated on a 180 nm CMOS process. Y-Flash devices have recently\nbeen demonstrated for digital and analog memory applications, offering high\nyield, non-volatility, and low power consumption. The IMPACT leverages the\nY-Flash array to implement the inference of a novel machine learning algorithm:\ncoalesced Tsetlin machine (CoTM) based on propositional logic. CoTM utilizes\nTsetlin automata (TA) to create Boolean feature selections stochastically\nacross parallel clauses. The IMPACT is organized into two computational\ncrossbars for storing the TA and weights. Through validation on the MNIST\ndataset, IMPACT achieved 96.3% accuracy. The IMPACT demonstrated improvements\nin energy efficiency, e.g., 2.23X over CNN-based ReRAM, 2.46X over Neuromorphic\nusing NOR-Flash, and 2.06X over DNN-based PCM, suited for modern ML inference\napplications.\n",
  "subjects": [
    "Computer Science/Hardware Architecture",
    "Computer Science/Artificial Intelligence",
    "Computer Science/Emerging Technologies",
    "Computer Science/Machine Learning"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "r6ZATYGUrnzOwJfxmVSLP4-kK_jzcaUPnG77LYefwFg",
  "pdfSize": "9397302"
}