{
  "id": "2412.02733",
  "title": "Mixed-state phase transitions in spin-Holstein models",
  "authors": "Brett Min, Yuxuan Zhang, Yuxuan Guo, Dvira Segal, and Yuto Ashida",
  "authorsParsed": [
    [
      "Min",
      "Brett",
      ""
    ],
    [
      "Zhang",
      "Yuxuan",
      ""
    ],
    [
      "Guo",
      "Yuxuan",
      ""
    ],
    [
      "Segal",
      "Dvira",
      ""
    ],
    [
      "Ashida",
      "Yuto",
      ""
    ]
  ],
  "versions": [
    {
      "version": "v1",
      "created": "Tue, 3 Dec 2024 18:10:10 GMT"
    }
  ],
  "updateDate": "2024-12-05",
  "timestamp": 1733249410000,
  "abstract": "  Understanding coupled electron-phonon systems is one of the fundamental\nissues in strongly correlated systems. In this work, we aim to extend the\nnotion of mixed-state phases to the realm of coupled electron/spinphonon\nsystems. Specifically, we consider a two-dimensional cluster Hamiltonian\nlocally coupled to a set of single bosonic modes with arbitrary coupling\nstrength. First, we adopt a pure-state framework and examine whether a ground\nstate phase transition out of the symmetry-protected topological phase can be\ncaptured using the standard polaron unitary transformation. This approach\ninvolves restricting the analysis to the low-energy manifold of the phonon\ndegrees of freedom. We find that the pure-state approach fails to detect the\nanticipated transition to a topologically trivial phase at strong spin-phonon\ncoupling. Next, we turn to a mixed-state picture. Here, we analyze mixed states\nof the model obtained by tracing out the phonons degrees of freedom. We employ\ntwo distinct diagnostics for mixed-state phase transitions: (i) the von Neumann\nconditional mutual information (CMI) and (ii) the R\\'enyi-2 CMI. We argue that\nboth measures detect signatures of mixed-state phase transitions, albeit at\ndifferent critical spin-phonon coupling strengths, corresponding to subtly\ndistinct notions of the mixed-state phases.\n",
  "subjects": [
    "Condensed Matter/Strongly Correlated Electrons",
    "Physics/Quantum Physics"
  ],
  "license": "http://creativecommons.org/licenses/by/4.0/",
  "blobId": "bZRtYW-3t0X4UK_CR1EuZTQttEBv3kBGFQlTZr6Q3Jc",
  "pdfSize": "1614711"
}