{"id":"2412.14112","title":"Starting a Synthetic Biological Intelligence Lab from Scratch","authors":"Md Sayed Tanveer, Dhruvik Patel, Hunter E. Schweiger, Kwaku Dad\n  Abu-Bonsrah, Brad Watmuff, Azin Azadi, Sergey Pryshchep, Karthikeyan\n  Narayanan, Christopher Puleo, Kannathal Natarajan, Mohammed A. Mostajo-Radji,\n  Brett J. Kagan, Ge Wang","authorsParsed":[["Tanveer","Md Sayed",""],["Patel","Dhruvik",""],["Schweiger","Hunter E.",""],["Abu-Bonsrah","Kwaku Dad",""],["Watmuff","Brad",""],["Azadi","Azin",""],["Pryshchep","Sergey",""],["Narayanan","Karthikeyan",""],["Puleo","Christopher",""],["Natarajan","Kannathal",""],["Mostajo-Radji","Mohammed A.",""],["Kagan","Brett J.",""],["Wang","Ge",""]],"versions":[{"version":"v1","created":"Wed, 18 Dec 2024 17:58:26 GMT"}],"updateDate":"2024-12-19","timestamp":1734544706000,"abstract":"  With the recent advancements in artificial intelligence, researchers and\nindustries are deploying gigantic models trained on billions of samples. While\ntraining these models consumes a huge amount of energy, human brains produce\nsimilar outputs (along with other capabilities) with massively lower data and\nenergy requirements. For this reason, more researchers are increasingly\nconsidering alternatives. One of these alternatives is known as synthetic\nbiological intelligence, which involves training \\textit{in vitro} neurons for\ngoal-directed tasks. This multidisciplinary field requires knowledge of tissue\nengineering, bio-materials, digital signal processing, computer programming,\nneuroscience, and even artificial intelligence. The multidisciplinary\nrequirements make starting synthetic biological intelligence research highly\nnon-trivial and time-consuming. Generally, most labs either specialize in the\nbiological aspects or the computational ones. Here, we propose how a lab\nfocusing on computational aspects, including machine learning and device\ninterfacing, can start working on synthetic biological intelligence, including\norganoid intelligence. We will also discuss computational aspects, which can be\nhelpful for labs that focus on biological research. To facilitate synthetic\nbiological intelligence research, we will describe such a general process step\nby step, including risks and precautions that could lead to substantial delay\nor additional cost.\n","subjects":["Quantitative Biology/Neurons and Cognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Qy6-IwXwLgZUoMLw5ljlt8sU15-OdQ8UEUkgojtHkxc","pdfSize":"8235772"}