{"id":"2412.20254","title":"An Optimization Driven Link SINR Assurance in RIS-assisted Indoor\n  Networks","authors":"Cao Vien Phung, Max Franke, Ehsan Tohidi, June Heinemann, Andre\n  Drummond, Stefan Schmid, Slawomir Stanczak, Admela Jukan","authorsParsed":[["Phung","Cao Vien",""],["Franke","Max",""],["Tohidi","Ehsan",""],["Heinemann","June",""],["Drummond","Andre",""],["Schmid","Stefan",""],["Stanczak","Slawomir",""],["Jukan","Admela",""]],"versions":[{"version":"v1","created":"Sat, 28 Dec 2024 19:58:39 GMT"}],"updateDate":"2024-12-31","timestamp":1735415919000,"abstract":"  Future smart factories are expected to deploy applications over\nhigh-performance indoor wireless channels in the millimeter-wave (mmWave)\nbands, which on the other hand are susceptible to high path losses and Line-of\nSight (LoS) blockages. Low-cost Reconfigurable Intelligent Surfaces (RISs) can\nprovide great opportunities in such scenarios, due to its ability to alleviate\nLoS link blockages. In this paper, we formulate a combinatorial optimization\nproblem, solved with Integer Linear Programming (ILP) to optimally maintain\nconnectivity by solving the problem of allocating RIS to robots in a wireless\nindoor network. Our model exploits the characteristic of nulling interference\nfrom RISs by tuning RIS reflection coefficients. We further consider\nQuality-of-Service (QoS) at receivers in terms of\nSignal-to-Interference-plus-Noise Ratio (SINR) and connection outages due to\ninsufficient transmission quality service. Numerical results for optimal\nsolutions and heuristics show the benefits of optimally deploying RISs by\nproviding continuous connectivity through SINR, which significantly reduces\noutages due to link quality.\n","subjects":["Computer Science/Networking and Internet Architecture","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"eCjcuf7Amns8BYjBGfu7I--m8ggv_7vO2ouhDvmtngg","pdfSize":"894864"}