{"id":"2412.19330","title":"Identifying Split Vacancies with Foundation Models and Electrostatics","authors":"Se\\'an R. Kavanagh","authorsParsed":[["Kavanagh","Seán R.",""]],"versions":[{"version":"v1","created":"Thu, 26 Dec 2024 18:58:52 GMT"},{"version":"v2","created":"Mon, 30 Dec 2024 17:46:02 GMT"}],"updateDate":"2024-12-31","timestamp":1735239532000,"abstract":"  Point defects are ubiquitous in solid-state compounds, dictating many\nfunctional properties such as conductivity, catalytic activity and carrier\nrecombination. Over the past decade, the prevalence of metastable defect\ngeometries and their importance to relevant properties has been increasingly\nrecognised. A particularly striking example of this is split vacancies, where\nan isolated atomic vacancy transforms to a stoichiometry-conserving complex of\ntwo vacancies and an interstitial ($V_X \\rightarrow [V_X + X_i + V_X]$), which\ncan be accompanied by a dramatic lowering of the defect energy and change in\nbehaviour. Such species are particularly challenging to identify from\ncomputation, due to the `non-local' nature of this reconstruction. Here, I\npresent an approach for efficiently identifying such species in solid-state\ncompounds, through tiered screening which combines geometric analysis,\nelectrostatic energies and foundation machine learning (ML) models. This\napproach allows the screening of all compounds in the Materials Project\ndatabase (including all entries in the ICSD, along with several thousand\npredicted metastable materials), identifying thousands of split vacancy\nconfigurations, hitherto unknown. This study highlights both the potential\nutility of machine-learning potentials for defect investigations, with\nimportant caveats, and the importance of global optimisation approaches for\ncorrectly identifying stable defect geometries.\n","subjects":["Condensed Matter/Materials Science","Physics/Chemical Physics","Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"podsBucPCwta9gciNapUxsKSm6jiAxUbQKOSx5qFpMU","pdfSize":"20598978"}